[{"rating": 1.0, "review": "I bought this with the understanding it would work on my desktop, and it does not. Be advised before you buy.", "verified": true, "helpfulness": "0/0", "author": "anthony jackowitch"}, {"rating": 1.0, "review": "Nothing like Apple TV. Save your money and get an Apple TV instead.  We wanted one more Apple TV device for the house so decided to go with the chrome cast since it is cheaper. One thing I didn't love is that you had to download an app to play things from your device. The Apple TV is all contained in itself so you don't need your tablet to operate it. Small issue with having to use space on your tablet for that. But the big problem is that we have constantly had connection problems. It doesn't stream as quickly as Apple TV so we sit and wait for it to catch up. But most of the time it can't even connect to the wifi and we get nothing until we trouble shoot. Who wants to do that every time you watch tv. We moved it to a different tv that's in the same room as our modem and we still have issues with it. Simply put, the technology is not nearly as good as Apple TV. You get what you pay for I suppose. Save your $ or spend the extra $ to get Apple TV.", "verified": true, "helpfulness": "0/0", "author": "M. Shore \"Two Under Two\""}, {"rating": 3.0, "review": "The Chromecast is OK right now. It needs a lot more industry support to reach the good or great level. It could use a remote control too.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "It would be great if you could play your amazon prime movies on here.  The device would be even better if you could just broadcast everything on your device screen onto the tv, kind of like an HDMI broadcaster.Set up is a little complicated.  The process is made very simple by watching set up videos on youtube.", "verified": true, "helpfulness": "0/0", "author": "Mark Freeman"}, {"rating": 4.0, "review": "Chromecast was So easy to install and set up. The video quality is clear and sharp. I can stream my netflix, hbo go, YouTube, and pandora apps so easily with great quality! I am super satisfied!", "verified": true, "helpfulness": "0/0", "author": "Michelle Dela Cruz"}, {"rating": 5.0, "review": "Works great! It even came in a day earlier then what was planned, I was quite impressed by that too.", "verified": true, "helpfulness": "0/0", "author": "shibbeaner"}, {"rating": 5.0, "review": "This is one of the best products i ever bought, value for money, and fits right where you want it, provides amazing features.i only use it for Youtube and local streaming as where i live we don't have Netflix, etc.", "verified": true, "helpfulness": "0/0", "author": "Alfy"}, {"rating": 1.0, "review": "This product was a complete waste of time and effort to get it to wok.You are better off getting a Roku box!!", "verified": true, "helpfulness": "0/0", "author": "RajahRule"}, {"rating": 5.0, "review": "I love this thing. I even cancelled my directv because I have something to stream with now. I use this with everything. Netflix, amazon streaming or any other streaming for that matter. Best thing I've ever bought. The picture quality is great and the sound is perfect. Can't beat this.", "verified": true, "helpfulness": "0/0", "author": "CRSBOB"}, {"rating": 1.0, "review": "Google never mentioned that you need a paid internet subscription and WI FI setup to use this devise . You need working......  WI FI  for device to work .", "verified": true, "helpfulness": "0/2", "author": "diesel"}]