[{"rating": 5.0, "review": "Everything I was looking for and more! Great value.", "verified": true, "helpfulness": "0/1", "author": "pankee01"}, {"rating": 5.0, "review": "I love this, we got it to help save money. We love so far no issues. We like that you can watch lots of stuff for kids for free or low cost with the prime. I will update as time goes by.", "verified": true, "helpfulness": "1/1", "author": "jackie"}, {"rating": 5.0, "review": "Wow, how nice to have a TV/Video/Streaming box that's virtually instant on with no buffering.  Easy to install, easy to use and easy to use interface.  Also, works great with Amazon Prime Video.", "verified": true, "helpfulness": "1/1", "author": "David Eads"}, {"rating": 4.0, "review": "I going to give it four stars just because it's awesome! I've only been able to play with it once so far but it appears to not have an on /off button. Who would want to leave a electronic device on twenty-four/ seven, if it's not a clock or alarm.", "verified": true, "helpfulness": "0/2", "author": "Jared C."}, {"rating": 2.0, "review": "1st Disclaimer:  I love amazon prime and the offer and benefits i have being a member, so with that being said.  Amazon Fire TV is not that great of a product.  I love some of the features, but If I wasn't an amazon prime member I probably would return it.", "verified": true, "helpfulness": "2/4", "author": "Ty"}, {"rating": 3.0, "review": "I like this unit, and would have given it more starts if it wasn't for one major thing - we have Prime, and the main screen sorts options and states \"watch free with Prime.\" You click on it and the default selection is to PAY. You have to move the cursor and click through 2 more screens in order to actually watch for free. Even if it knows you're logged in with Prime. It should default to the free option if a Prime account owner chooses to watch something that is free, but it doesn't. We got hit with a few charges before we even realized this was happening. Very sneaky, if you ask me.Also, the batteries in the remote die FAST. We just keep a package of batteries near the TV for quick replacement. Amazon needs to work on an auto-off mode when not using the remote.", "verified": true, "helpfulness": "2/2", "author": "Angela"}, {"rating": 5.0, "review": "Thank You Amazon!!! Amazing little gadget!! A++++", "verified": true, "helpfulness": "1/2", "author": "Richard Amoah"}, {"rating": 5.0, "review": "Me and the kids love this lots of movies and shows for all specially with the prime membership", "verified": true, "helpfulness": "1/2", "author": "jwheel"}, {"rating": 5.0, "review": "this is SO AWESOME, and SO MUCH CHEAPER than cable or satellite", "verified": true, "helpfulness": "1/2", "author": "Critter"}, {"rating": 3.0, "review": "Everything that offers, TV, movies, etc. you have to subscribe to services like  Netflix, so if you already have Netflix, basically there is little use for it. Can't access facebook, the downloading of apps is restricted, it will not give you the access to all the apps created.It froze the second time I used it, disconnected the unit and nothing, had to leave it alone and the next day was working again. I've had a better experience with a borrowed iTV from apple.", "verified": true, "helpfulness": "2/3", "author": "Erick"}]