[{"rating": 5.0, "review": "I love the Chromecast it very easy to set up , and easy to use... waiting for support from hulu, pandora, amazon prime, then it will be the perfect ...", "verified": true, "helpfulness": "0/0", "author": "Vladimyr merci"}, {"rating": 1.0, "review": "Edit: 9/17/13Unfortunately I had to return it. (Lowered my rating from 3 to 1 star). Even though it was working last night after 4+ hours of trying. I woke up this morning and it was not working again. The router is 5 feet away from it. It is unreliable and cannot always connect to the internet. FYI, I am pretty familiar with networks and I'm not a novice. This thing is not ready for prime time.9/16/13I spent several hours trying to make the Chromecast work with my network. Chromecast has compatibility issues with several routers. This thing was driving me crazy! I was able to connect it to my network but not the internet.You need to go to Google support here: [...] and check known issues with several routers and workarounds.My router is the Netgear R6300, and In my case, I had to enable ipv6 in the router. (it is disabled by default)I noticed that many people were having similar issue; so I hope this resolves your connectivity problems and help keep your blood pressure down.", "verified": false, "helpfulness": "0/2", "author": "D. Moujaes"}, {"rating": 2.0, "review": "I just got my Chromecast and I am not happy at all.  I was told that we could stream local video but that does not seem to be an option.  There are only 3 apps you can use. YouTube, Netflix and GooglePlay.  What a disappointment.  Don't buy this unless you only want to push that content.  I am sending my 2 units back and buying Apple TV", "verified": true, "helpfulness": "0/6", "author": "Anne \"APB\""}, {"rating": 4.0, "review": "Still playing with it, but love the ease of setup. Wish I could pause playback, but overall, great value for $35.00.", "verified": true, "helpfulness": "1/1", "author": "David Evans"}, {"rating": 5.0, "review": "$35 for streaming tv in HD, you could not have dreamed up anything better. I purchased this device thinking only about the potential and future apps. I currently own 2 Rokus, 2 Smart Bluray players, 1 Apple TV, 1 Smart TV not to mention 3 iPads, 2 iPhones,1 Xbox and 1 Wii all with streaming. I like because I save money on streaming  and I'm a big tech head too. The Google Chromecast has potential in the future to offer mirroring, games and more. So depending on what released in the coming months I plan to purchase at least 3 more of these.", "verified": true, "helpfulness": "0/0", "author": "Ant"}, {"rating": 5.0, "review": "I purchased this device primarily to stream live video and YouTube videos using my Cisco Linksys E3200 wifi router and Samsung 46\" High Definition TV. I am very pleased with my abilities to stream a 2-hour weekly live video of a church service that broadcasts each Sunday morning via a LiveStream channel. I first tried using the Chrome browser on my Windows 7 HP laptop and after about an hour the quality began to degrade. But when I used the Chrome browser on my Windows 7 HP desktop I had no problems at all with the HD live stream. For that reason, I give this device five stars. My rating is because the device does a great job doing what I need it to do. Also the folks at Google chromecast were great when I had technical questions about the initial set-up with my router.", "verified": true, "helpfulness": "0/0", "author": "Carolina Tarheel"}, {"rating": 3.0, "review": "It's okay. It works well with Youtube and Netflix, but that's it. I hope it gets more apps. But I really hope the casting from the Chrome extension comes out of beta soon. I tried casting regular sites with video through my Macbook Pro, and though it's an old Mac and I only have Lion, it works well but does not seem to place nice with the Chromecast. The video is black and you can only hear sound. I tried casting with my husband's PC, and it works but there's still still hiccups and sync issues with video and sound that just ends up being a headache if you get invested in anything. I tried everything, changing the resolution and streaming to a low setting, didn't seem to improve it. I keep waiting for them to get more apps and to have better casting from the Chrome browser. I read online that a lot of people had better luck with this; I didn't because well I can't afford the new computers. I have my old Mac which doesn't really work well with this device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"lafemmejupiter\""}, {"rating": 5.0, "review": "Love it, Just plugged it into TV, Following instructions, Have no problem, simple to use.  I would have like to have had a little more info on the device.", "verified": true, "helpfulness": "0/0", "author": "Greg Ricci"}, {"rating": 4.0, "review": "it works great for me, setup didnt work from m computer for some reason so i did it from my phone in minutes. youtube is great because there are no ads, netflix works great but since i change servers to watch netflix in different countries the chromecast wont allow it. And for the google play music im not allowed to play music that is already on my phone is that is kinda of a downer to me too. And i never use google play video so hat is useless to me. I wont they keep supporting it and dont just forget about it because it has alot of potential. If not then i might have just wasted 35 dollars and 3 months waiting for it to arrive since everyone wants one. Other than that its a great device. (better and cheaper than the nexus q)", "verified": true, "helpfulness": "0/0", "author": "Tyler Barron"}, {"rating": 5.0, "review": "I now have movies in my bedroom. This is a great product. I works perfictly. download the chromecast app and it sets you up in no time. Its compatible with most devices.I'm curently using my Iphone 4.I now have netflics in my room. Very clear and no problems. Can't go wrong with this device for the money. Its go's out of stock so fast that I hade to wait about 4-6 weeks but it was worth the wait.Enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Pure Mood"}]