[{"rating": 4.0, "review": "This has 5 star potential.  Just need to get more platforms involved.  But it works fine.", "verified": true, "helpfulness": "0/0", "author": "Rey C"}, {"rating": 5.0, "review": "Excelent! you can see all what you want!!", "verified": false, "helpfulness": "0/0", "author": "Victoria Bagnulo"}, {"rating": 5.0, "review": "for this price it's one most better in the market", "verified": true, "helpfulness": "0/0", "author": "Elchin Seyidov"}, {"rating": 5.0, "review": "I loved this chrome cast it was nice. i put on my tv it works just the want work. from this you can cast netflix and youtube and so on.", "verified": true, "helpfulness": "0/0", "author": "Bhanu Singh"}, {"rating": 5.0, "review": "Best bang for your buck, especially when they offer extra goodies on top of the cheap price.", "verified": true, "helpfulness": "0/0", "author": "RS_2014"}, {"rating": 5.0, "review": "Great Product. The beta client on the browser is still a little glitchy, but it works a majority of the time.", "verified": true, "helpfulness": "0/0", "author": "Kirk"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "ragilmaratak"}, {"rating": 5.0, "review": "Amazing product!!! I wish more things could be casted.", "verified": false, "helpfulness": "0/0", "author": "Latisha M."}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Vince!"}, {"rating": 4.0, "review": "Chromecast works as advertised, but beware there is no way I know of to use this with Amazon Prime unless you cast a Chrome browser tab, with all the attendant problems of resolution, sound synchronization and color temperature issues that come from casting a browser tab instead of using a native Chromecast app. I realize Amazon is trying to sell a competing product, but how much trouble would it really be to produce an Amazon Prime Video chromecast app, or a comparable priced product that would allow me to stream Prime?", "verified": true, "helpfulness": "1/1", "author": "Frank J. Taylor"}]