[{"rating": 5.0, "review": "You can't beat these for the price.  Pick up a couple and make sure you take one with you on vacation.  If the hotel has a TV with an HDMI port (and hasn't disabled it), you can bypass the crappy and expensive hotel TV options.", "verified": true, "helpfulness": "0/0", "author": "Perry"}, {"rating": 5.0, "review": "Chrome cast is amazing! Simple and really easy to us.", "verified": true, "helpfulness": "0/0", "author": "Kelv The Man"}, {"rating": 5.0, "review": "Love it! My favorite new toy. Does everything I want, and super affordable.", "verified": true, "helpfulness": "1/1", "author": "Andrew S."}, {"rating": 5.0, "review": "best $35 I've ever spent.", "verified": true, "helpfulness": "0/0", "author": "erik linares"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Pedro A. Hernandez"}, {"rating": 5.0, "review": "Very happy with the chromcast. It's a shame is not compatible with airplay (apple device) and/or not open for amazon prime...you can use any apple device with chromecast but only netflix, or youtube...", "verified": true, "helpfulness": "0/0", "author": "BORJA GIRALT"}, {"rating": 1.0, "review": "Google missed the boat with this one.  The Roku is a superior product, particularly as you can do most of what Chromcast offers with the Roku 3.  We did try to stream a ball game that was on the computer, but the stream had the audio so completely out of synch that it was unwatchable.  We finally opted to just connect the computer directly to the TV.I'm a big fan of Google, and will assume this was their one flub.  I'll try the next version when it comes out (sometimes a company has to slip with the first one to get it right.  Just look at the Logitech Wireless Trackball) but I'd pass on this one.", "verified": true, "helpfulness": "0/0", "author": "Javin007 \"Javin\""}, {"rating": 3.0, "review": "thought i would be able to see channels for free and the only thing i see for apps is crackle, are there any others like this. Also for movies free they want you to pay, some channels you have to have comcast to watch", "verified": true, "helpfulness": "0/2", "author": "Gerald"}, {"rating": 4.0, "review": "The uses of the product is wonderful, it streams well and is very easy to use.  The 2 reasons I didn't give it a 5 out of 5 are:1. It doesn't have enough integration with the iphone, I can really only stream from youtube.  If I could stream from Safari it would improve drastically.2. Sometimes the product isn't available to stream from.  I then have to unplug the product and turn it off and back on for it to be available.", "verified": true, "helpfulness": "0/0", "author": "Reviewer"}, {"rating": 4.0, "review": "Just the ideal gadget at my living room!", "verified": true, "helpfulness": "0/0", "author": "wenceslao jaimes"}]