[{"rating": 5.0, "review": "Faster than the Fire TV stick (which is still a great product) and no buffering. With this device and my HDTV antenna for local channels, I don't miss cable at all.", "verified": true, "helpfulness": "0/0", "author": "TES"}, {"rating": 4.0, "review": "Was easy to install and easy to use.  Husband loves the speak Remote.  Thought there might be some newer movies Free without rent. All in all a good buy.", "verified": true, "helpfulness": "0/0", "author": "Dot"}, {"rating": 5.0, "review": "Works better than my SmartTV. Perfect for Prime videos and YouTube.", "verified": true, "helpfulness": "0/0", "author": "Frugalista"}, {"rating": 5.0, "review": "I  just  wanted  to  let  you  know  that  I  believe  that  your  product  is  the  future  of  TV .  I  am  in  love  with  it  and  I  can  take  it  with  me ,  too  keep  it safe  too .", "verified": true, "helpfulness": "0/0", "author": "kevin Theodore"}, {"rating": 5.0, "review": "Easy to set up, love prime movies and Pandora app.", "verified": true, "helpfulness": "0/0", "author": "Shaotong Jia"}, {"rating": 5.0, "review": "I bought this with a Sling TV subscription (you get a discount with Sling). It works great and the combination has allowed me to cut the cable.My main TV was already web-enabled so I was somewhat reluctant to buy this, thinking it was duplicate functionality. But, to have Sling I needed it and am glad I do. I've loaded quite a few other apps and have found lots of interesting things that weren't available on my TV.", "verified": true, "helpfulness": "0/0", "author": "EverLearning"}, {"rating": 5.0, "review": "Nice, as expected and then some.  Many apps and games are available, and images/videos stored on Amazon Cloud Drive can be viewed easily. Voice search works great and is accurate.  A nice addition in the future would be voice commands for faster menu navigation.", "verified": true, "helpfulness": "0/0", "author": "Brian W."}, {"rating": 5.0, "review": "Love,love,love Amazon fire tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome TV control!!!!", "verified": true, "helpfulness": "0/0", "author": "Magic Mike"}, {"rating": 5.0, "review": "I AM ASTONISHED! AMAZED! AND DUMBFOUNDED!I know this is a very long winded description, but I would ask the reader to please read it entirely, as it is the truth, and short of a complete description, even with all that I have stated!  As I have worked on computers for over 15 years, building, configuring, and designing them to be the best of \"Multimedia\" devices available in the free world market, I am completely beside my self as to how great this tiny device works, the extreme high quality, (1080P) High definition, and visual clarity it has rendered upon the screen of my TV! I have bought many \"PC/TV Video Cards\" with 100's of GIGABYTE'S of memory, that were 2, and 3 times it's size! (i.e. Nevada, ATI-HDTV, and more,) but NOT ONE compares with this device. The Price ($99.00 at purchase,) was a fraction of the cost of the many I have bought, and the Size is even more baffling, look at the photo Amazon has provided, and know that the \"Remote Control\" actually fit's in the palm of my hand, and it is larger than the device it's self! I would further recommend with great certainty to any one, the use of this \"Amazon FireTV\" will be pleasing! I would like to also inform everyone that the Description, both on the box, and within the \"Instructions\" do not do \"Justice\" to the device in question, as I have found that the \"Compatibility\" is equally amazing, as this device has recognized every device I have plugged into it via the USB socket on it's back! Not only One device at a time, but with the accompaniment of a USB hub, multiple devices at the same time! (Mouse, Keyboard, Xbox360, Memory stick, and even a Toshiba 300GB 2.5\" hard drive! All at the same time!) This device can also play music and videos, from such devices, regardless of an internet connections, AND it worked perfectly fine while doing it! Want further amazement? I thought I would have to connect this device to my \"Modem\" using a CAT5 cable (LAN connection,) but was amazed to find, it has WIFI built in! Only requiring me to have 2 cables plugged in, the power cord, and an HDMI cable! It is with certainty I can boast, that I will continue to maintain my accounts with AMAZON, and the continued use of this \"Device\", Amazon FireTV. I am completely satisfied!", "verified": true, "helpfulness": "2/3", "author": "Audie Collins"}]