[{"rating": 2.0, "review": "I thought this compatible with Amazon Prime movie streaming!", "verified": true, "helpfulness": "0/0", "author": "Ogbillie"}, {"rating": 3.0, "review": "Does not work with Kindle fire  table.", "verified": true, "helpfulness": "0/0", "author": "john barry"}, {"rating": 4.0, "review": "Great tool to add to your Android repertoire.  The Chromecast easily connects to most things Google.  The video quality is great.  The selection of Apps that it runs are kind of limited but growing all the time.  I use it for Netflix, Pandora, and YouTube without issue.  For the price, you can't beat it for turning your TV into a Smart TV...and honestly, the interface is WAY better than any Smart TV interface I've dealt with.", "verified": true, "helpfulness": "0/0", "author": "C. M. Cattell \"Clinten Cattell\""}, {"rating": 1.0, "review": "Worked really well at first, but we kept having problems as time went on. It kept needing to be rebooting and not being able to connect. It would randomly start and stop working and there never seemed to be a real solution to the problem. I DO NOT recommend this device. Just buy an HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Leslie E Rodman"}, {"rating": 5.0, "review": "Wuv It!!", "verified": true, "helpfulness": "0/0", "author": "LeRoy Pham"}, {"rating": 5.0, "review": "SO easy", "verified": true, "helpfulness": "0/0", "author": "Daniel J Lowery Jr"}, {"rating": 5.0, "review": "Great to stream apps, netflix, laptop screen, phone screen, skype calls on the TV!!", "verified": true, "helpfulness": "0/0", "author": "CLERGET François"}, {"rating": 5.0, "review": "Cheap, and couldn't live with out it. I use it to play YouTube Music Videos on my surround sound system. I don't have to turn on my TV and can listen to the music, play, queue new music, fast forward and rewind from my phone.", "verified": true, "helpfulness": "0/0", "author": "Jason H."}, {"rating": 3.0, "review": "Not very smooth or easy to set up and use.Works but not every time.This was a present so perhaps it's user error.", "verified": true, "helpfulness": "0/0", "author": "Edward Puglisi"}, {"rating": 5.0, "review": "Works simply and as advertised! No issues at all.", "verified": true, "helpfulness": "0/0", "author": "William Wright"}]