[{"rating": 5.0, "review": "Just hooked it up last night and am already in love with it.  Took all of 10 minutes to set up and much of that was due to having to maneuver my television around to get the best angle for the HDMI cable.  The box is so small it fits under my TV and you can barely see it.", "verified": true, "helpfulness": "0/0", "author": "Fred M. Reiser Jr."}, {"rating": 5.0, "review": "Plan on updating my review as I use the device more but initial impression is \"I'm very impressed\".  I have roku, apple tv, games consoles, and now amazon fire tv.  Hands down it's the best so far.  It was difficult to get netflix going but it was the fire tv needed an update that it didn't download on start up for some reason.  The roku are slow, apple tv limited, games consoles are great but apps slow (amazon, netflix, hulu mainly).  I'm sure there are some flaws with the amazon fire tv, none are perfect but this one is impressive as already stated.  Wish the amazon prime for movies were a bit better and could sort by release date of the movie (perhaps it can and I've yet to find).", "verified": true, "helpfulness": "0/1", "author": "terry"}, {"rating": 5.0, "review": "Just plugged it in an ten min. later was watching it.", "verified": true, "helpfulness": "0/0", "author": "ironman"}, {"rating": 3.0, "review": "Question - Why is the HDMI cable not supplied? Why can't Amazon give you all you need to use it in the box?", "verified": false, "helpfulness": "2/7", "author": "Craig Westbrooke"}, {"rating": 5.0, "review": "This is the best addition to our TV set-up yet!", "verified": true, "helpfulness": "0/0", "author": "Wendy Z"}, {"rating": 1.0, "review": "I have been unable to activate (i have a vizeo hi def and direct tv)  after plunging in power and hd cable. I need serious help. Harry", "verified": true, "helpfulness": "1/6", "author": "harry clayman"}, {"rating": 4.0, "review": "Would be 5 stars if it had HBO Go app. As it is I am regretting not getting the Mad Catz MOJO", "verified": true, "helpfulness": "1/1", "author": "Sir Jaxxy \"Jeff\""}, {"rating": 4.0, "review": "Almost perfect...the only wish, to have a power switch on the remote.If you do not use your remote for over a week, you will have to re-pair the remote to the main box, by unplugging the main box.The voice command works very well.We are thinking of getting the newer & smaller plug-in fireTV stick for the spare TVs.", "verified": true, "helpfulness": "0/2", "author": "Come and Get It! \"TejasPOWER\""}, {"rating": 5.0, "review": "East set up and works great", "verified": true, "helpfulness": "0/1", "author": "William Kosar"}, {"rating": 5.0, "review": "Set up was quick and easy.  Quality is great!  Very Happy", "verified": true, "helpfulness": "0/0", "author": "Boodle65 \"Boodle65\""}]