[{"rating": 3.0, "review": "I'm enjoying my Fire TV. I'm disappointed that more movies and TV shows are not free with my Prime membership. So far, most everyone I have wanted to watch is extra. Because of that, I have not used it as much as I was hoping to.", "verified": true, "helpfulness": "2/3", "author": "D. Muniz \"tech unsavy\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "1/2", "author": "Carlos J. Zavala"}, {"rating": 2.0, "review": "I already have a Roku 3 and this was disappointing in comparison.", "verified": false, "helpfulness": "1/3", "author": "Jack R. Henning"}, {"rating": 5.0, "review": "You know, it's much better than I thought it would be.  I already had a Chromecast with the intention of using that for my streaming video, but that device was only ok.  I had used the Amazon app that comes with the Samsung SmartTV and that was also only ok as it was often choppy, wouldn't connect, etc. so I pretty much expected that the Fire TV would be like that app.  Boy, was I wrong!  When it arrived, I left it in the box for about a week because I didn't feel like configuring it.  Knowing that it didn't support bluetooth keyboards, I just didn't look forward to \"typing\" my information using the remote.  However, I was shocked to find that the device comes configured -- I just plug it in, set up the wifi, and it already knows who I am.  At that point, I started to search for something to watch and rather than type things in, the Fire TV pushes you towards using the voice interface.  My expectations were not high, but it works really, really well!  It's too bad the YouTube app doesn't support the voice feature as well, but oh well.  Maybe my experiences with Samsung and Google Chromecast set the bar pretty low, but I'm ridiculously happy with my Fire TV.", "verified": true, "helpfulness": "2/3", "author": "Michael \"avidreader\""}, {"rating": 3.0, "review": "There are too many apps and programs you have to pay for... If you already have a dish or cable your paying for these items already... Also you can't get your local news or channels...Overall I love the feature of amazon fire TV but do full research before you buy one to be fully aware of what it offers, what you can stream for free and what you have to spend more $ on...I gave it 3 stars BC  your Sony DVD / blue rayplayer can stream just as much as the Fire.", "verified": true, "helpfulness": "0/2", "author": "Rebekah A. Goodrow"}, {"rating": 5.0, "review": "This product works. The free movies are limited but the video is great", "verified": true, "helpfulness": "1/2", "author": "Jrob"}, {"rating": 5.0, "review": "WORKS GREAT", "verified": true, "helpfulness": "1/2", "author": "Ehobbs"}, {"rating": 5.0, "review": "Great HD quality and fast download speeds for streaming.", "verified": true, "helpfulness": "1/2", "author": "Michael Belle"}, {"rating": 5.0, "review": "Love this machine.was a big fan of Roku, would not go back after using the fire. Voice search is awesome.", "verified": true, "helpfulness": "1/2", "author": "KLM \"KLM\""}, {"rating": 5.0, "review": "Great product, great price, excellent service. I take it with me I travel.", "verified": true, "helpfulness": "1/2", "author": "sherry hergert"}]