[{"rating": 3.0, "review": "I purchased the Chromecast recently after reading all the reviews that raved about how this was a \"life changing\" device.  I can see where it has the potential to make things much more convenient, but I have yet to really have a positive experience.I have used the Chromecast to interface with both my iPhone and my laptop and it seems to work better with my iPhone.  Buffering is the main problem with video.  If I attempt to stream netflix to the Chromecast device from either my laptop or iPhone, the buffering will downright drive you crazy.  Streaming from a browser? Forget it.  The Chromecast will eventually time out and just stop casting.Admittedly, some of this may be due to my lower-tier internet connection.  I do understand that this may be a bandwidth-heavy device to use, but I do stream netflix through my Xbox 360 with very satisfactory results on a regular basis.  In addition to that, there are much more streaming options readily available through my Xbox that the Chromecast doesn't support as of this review (Vudu, Hulu, etc...)To sum up, this device could be promising but falls short to replace my normal streaming strategies.", "verified": true, "helpfulness": "0/0", "author": "Rigor"}, {"rating": 5.0, "review": "Was easy to set up works great with all our devices. Helps cut the cable. Love being able to read on big screen.", "verified": true, "helpfulness": "1/1", "author": "mvlver"}, {"rating": 4.0, "review": "I bought two of these little gems.  I use them regularly with my iPad and Android tablets plus my Android smart phone.  I only gave it four stars because the app integration with Netflix and others could be a little cleaner.  If the iPad's starts to hibernate it's not very intuitive how to get back to the video you were watching.  Other than that I love this little device.", "verified": true, "helpfulness": "0/0", "author": "John Pfaff"}, {"rating": 1.0, "review": "I am still not able to us it. It cannot access my wireless system for some stupid reason! I have given up trying for now.", "verified": true, "helpfulness": "4/6", "author": "cactusles"}, {"rating": 2.0, "review": "Advertising for Google Chromecast is misleading.  It is very limited in what you can watch on your TV usinf the device: Netflix, Google movies and You Tube only.", "verified": true, "helpfulness": "0/1", "author": "B Lisk"}, {"rating": 5.0, "review": "The installation went  quickly but then I had a problem due to my own misunderstanding. I was unable to get the Google chrome tech people , could not find a number, so I called Netflix. The tech from Netflix patiently got me past my blunder. The system is working beautifully now.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Finnemore"}, {"rating": 5.0, "review": "I have an old 1080i 50 inch hitachi. I did a lot of reading before I purchased this product. Its does everything it says very well. I use Netflix and YouTube and they both stream very well on the tv. I'm in Canada so I don't have access to google play music so that feature doesn't work nor did I expect it to. So if you're in Canada and you want to stream YouTube and Netflix videos. This product and price point is amazing.", "verified": true, "helpfulness": "0/0", "author": "Arun Mekkunnel"}, {"rating": 5.0, "review": "What a device!  Seamlessly casting from all of my device at home and in HD too... Love it wouldn't go back to apple tv for sur", "verified": true, "helpfulness": "0/0", "author": "Eric Arbour"}, {"rating": 4.0, "review": "We are still doing a lot of experimenting, but so far we are very pleased with it. I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "dMeyNet"}, {"rating": 5.0, "review": "Great...! very easy to use.  Amazing product...!  When i get home from work i don't have to use my desk top computer to watch. Netflix..", "verified": true, "helpfulness": "1/1", "author": "jose palacios"}]