[{"rating": 3.0, "review": "so far the product seems to be working for me, although reading different reviews from many different sites, has me a little concerned about some privacy issues tho", "verified": true, "helpfulness": "0/1", "author": "TMA \"TMA\""}, {"rating": 3.0, "review": "I'm using it with my Android mobile and there are still apps lacking support for streaming to Chromecast; the main disappointment is the Gallery app.Players like VLC or mplayer don't support streaming to it either, the only option is to stream the whole desktop (which creates a delay between the PC and the TV)Overall, good product but still in very early stages.", "verified": true, "helpfulness": "0/0", "author": "S6"}, {"rating": 5.0, "review": "I gave this Chromecast a 5 rating because it was very easy to setup and woks with all of my portable devices as well as my laptop. I can stream Netflix, Hulu, free movies, and more.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I had difficulty connecting with my wifi, when you try and find a number to call to get advise, it's not there", "verified": true, "helpfulness": "0/0", "author": "John Toms"}, {"rating": 4.0, "review": "With this product I can put anything that is on my laptop  to the tv in the bedroom! How cool is that!", "verified": true, "helpfulness": "0/0", "author": "darcyjo"}, {"rating": 4.0, "review": "OK, so it works, and it wasn't too hard to setup. Downside is that it's not the easiest to stream your home videos. They either have to be on YouTube or on your desktop, you can't stream them from your phone which is what I was hoping it would do.", "verified": true, "helpfulness": "0/0", "author": "wlg2010"}, {"rating": 5.0, "review": "This thing is awesome.  Super easy to set up and so useful.  I don't know why anyone would by a roku or whatever else people stream with.  It actually doesn't drain your phone's battery or ram while you're streaming, once you start it somehow streams directly to the chromecast but you can pause it with your phone.  I figured this out because I restarted my phone in the middle of streaming a movie on HBOGO and the movie never stopped playing.", "verified": true, "helpfulness": "0/0", "author": "BAH"}, {"rating": 5.0, "review": "just how i like it..........set up was easy even for me!  i have a chromebook so its built in but i hear chrome is easy to downloadright now i use it with netflix mostly but thinking on hulu plus ......maybe trim my $200  a month cable bill a bit", "verified": true, "helpfulness": "0/0", "author": "john is retiring"}, {"rating": 5.0, "review": "The primary reason for taking a chance on Chromecast was in the hope that it would provide the option for captions when watching Netflix. I have a Sony Bravia smart TV and for some reason it is not able to get Netflix captions. I was having to connect with an HDMI cable and use my laptop. The other problem is that Netflix is very slow to connect on my Bravia (certain times of day it would not connect at all), whereas there were no connection issues with my laptop. That's all over since I got Chromecast! Always quick Netflix connections plus captions. I'm controlling it with a Samsung S2 phone. Very easy to use. Love it! Saved me from buying a new TV.UPDATE: the dongle burned out after 3 months. In the hope that it was a fluke I replaced it with a new one.", "verified": true, "helpfulness": "0/0", "author": "goodfaith"}, {"rating": 1.0, "review": "I tried five times to get it going. It worked for ten minutes and then it stopped. Do not buy this piece of crap.", "verified": true, "helpfulness": "0/3", "author": "tim emerson"}]