[{"rating": 5.0, "review": "I love my amazon fire tv. I barely even use my satellite service anymore. The functionality of it is great. The home screen and menus are brilliant. The voice recognition works every time and other voice recognition programs never work for me, Siri for example. It has a great screensaver that shows very beautiful pictures, there are lots of great apps available on it and it is fast. It is worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Lindsay Wood"}, {"rating": 5.0, "review": "OLD: I am a user of Amazon Prime for some time. So the Fire TV was a logical extension to it. I enjoy the unit over all. Very light. Very nice picture over all. I am disappointed in 1 thing - I can not get a DLNA client on it so I can stream my own content from the home server. That means that I need to have another unit. Other than that - it is a great toy! I will add another star as soon as DLNA client is enabled.UPDATED 2014-07-06:Actually I found an application for free to work as the DLNA client. Works like a charm with both: Twonky server and PlayOn. I love the unit.", "verified": true, "helpfulness": "1/1", "author": "Alexander V. Smirnov"}, {"rating": 4.0, "review": "This was my first try with a non cable device. I thought it was easy to use but I am used to a guide with cable and had trouble navigating my way around. If we decide to completely get rid of cable I would go with amazon fire. I didn't like how it would freeze up while watching a show but that has nothing to do with the fire tv device it has to do with your internet connection.", "verified": true, "helpfulness": "0/0", "author": "stozia1"}, {"rating": 5.0, "review": "Works like a charm and has a solid, well made feel to the box and the remote.", "verified": true, "helpfulness": "0/0", "author": "EYEDRZ"}, {"rating": 5.0, "review": "Amazon Fire TV is as advertised, easy to install, easy to use and a wonderful source of movies, both free (if you have Netflix or Amazon Prime) and those available as DVD's or for streaming. At $99 plus the cost of an HDMI cable, it is an excellent value.", "verified": true, "helpfulness": "0/0", "author": "William Toliver"}, {"rating": 3.0, "review": "Great device ... Works great but needs more apps as of now ( which I hear are coming )", "verified": true, "helpfulness": "0/1", "author": "Teryon"}, {"rating": 5.0, "review": "So easy to set up, it actually took longer to unpack and read the instructions than it took to get it up and running. Huge selection of movies, tv shows and apps. I havn't tried any of the games or music yet. Voice search is very fast and accurate, so much easier than typing out a title! Great apps like Smithsonian channel, Crackle TV, Netflix, Hulu, Pandora, Showtime, plus so many more. I've had my Fire TV for almost a month and I'm not disappointed in the least! I got rid of cable recently when the rates went up. Again. This unit is only $99 and with Prime which allows me to watch prime movies and tv shows is only &79 per year, I'm saving a huge amount.", "verified": true, "helpfulness": "0/1", "author": "J Messinger \"purplecat_gardening\""}, {"rating": 5.0, "review": "I love your product. It's really awesome. fits nice under my TV setI am running Xbmc on it and it's running very smoothly. I will love to be able to run all your services outside US", "verified": true, "helpfulness": "0/0", "author": "Mixman"}, {"rating": 5.0, "review": "It's better than I ever expected.", "verified": true, "helpfulness": "1/1", "author": "William M. Kostak"}, {"rating": 1.0, "review": "Aids. The shortest and simplest term I can use to explain the functionality of Netflix on the FireTV. It is atrocious, if you aren't crashing...you're dealing with the year 2000 UI to try and find movies you have full access to and 100x better access too on a tablet that's laying next to you.While the FireTV is fast & works well with things like Plex for streaming personal media, it seems to have little support from large brands like Netflix, Hulu, etc.It's gotten to the point I can't even get Netflix to play an episode of anything on FireTV without reseting the box. Absolutely atrocious.", "verified": true, "helpfulness": "9/13", "author": "Lauren Peters"}]