[{"rating": 5.0, "review": "I love this device, because you can mirror your phone on to your tv or projector. very nice technologies. .", "verified": true, "helpfulness": "0/0", "author": "RAUL"}, {"rating": 5.0, "review": "It's easy to set up, take down, and play videos and audio. I love it!! Works much smoother than my blu-ray player's wifi Netflix, YouTube, etc.", "verified": false, "helpfulness": "0/0", "author": "Logan"}, {"rating": 3.0, "review": "Seemed like a cool idea and cheap enough to try out as a whim. It's now sitting in my junk drawer after being replaced with a ROKU 3. Playback is fine, but it's a real pain to have to use another device to control it. Having a dedicated remote and a real GUI makes it much eaiser to watch streaming video. Would not recommend.", "verified": true, "helpfulness": "0/1", "author": "D. Duck"}, {"rating": 4.0, "review": "It seems to work really good. Now if I can figure out how to get it to connect to the stuff on the computer. It hooks up to the internet to watch any video out there.", "verified": true, "helpfulness": "1/1", "author": "Gregory Mitchell \"Grestmit\""}, {"rating": 5.0, "review": "It works well with my phone. You can search for an app that will play any video to your chromecast.", "verified": true, "helpfulness": "0/0", "author": "dallas sims"}, {"rating": 5.0, "review": "Got this and we eliminated our cable. We watching everything through youtube, hulu, and netflix now.  We have saved hundreds thanks to this thing.", "verified": true, "helpfulness": "0/0", "author": "madameadele"}, {"rating": 4.0, "review": "Nice device!", "verified": true, "helpfulness": "0/0", "author": "Greg Leighton"}, {"rating": 5.0, "review": "Great product, easy to install and configure, good ratio price:quality", "verified": true, "helpfulness": "0/0", "author": "Alejandro Esparza Lopez"}, {"rating": 5.0, "review": "Wonderful little gadget. Google has done a great job integrating Android with it. There are still quite a few issues with losing connection on various apps, which makes pausing playback sometimes quite a chore. It's been slowly getting better, but I'm still giving it a 5 star rating, as the interface is easier to use and understand than any other streaming device I've used.", "verified": true, "helpfulness": "0/0", "author": "Hunter Perrin"}, {"rating": 5.0, "review": "Good price, and being able to watch youtube and netflix on the tv is great. Easy to setup and use with the nexus 9.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}]