[{"rating": 5.0, "review": "Totally Awesome.", "verified": true, "helpfulness": "0/0", "author": "Mikkowus"}, {"rating": 5.0, "review": "the best for your tv", "verified": true, "helpfulness": "0/0", "author": "John C.B."}, {"rating": 4.0, "review": "We use the Chromecast to cast our Netflix, YouTube and other channels onto our Samsung TV. It works really well, inexpensive and has broadened our viewing opportunities.", "verified": true, "helpfulness": "0/0", "author": "prwen"}, {"rating": 5.0, "review": "Awesome device. I use it everyday for streaming Netflix and YouTube..", "verified": true, "helpfulness": "0/0", "author": "Sri"}, {"rating": 4.0, "review": "It's just so hard to find apps to stream to this thing, the fact that all your content has to be local to stream is ridiculous. I know there are ways to stream live stuff, and non-local content, but it's a pain.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Pedreros"}, {"rating": 1.0, "review": "I am extremely dissapointed with this item. You have to use a phone or tablet that has apps to control this device since it doesn't come with a remote. That would be perfectly fine if your phone or tablet was able to find the Chromecast regularly, but that is not the case. Half the time, my iPhone and Nexus 7 can't find the Chromecast on the network so I can't use it at all. Even if I reboot the Chromecast, it still does not work. When it does actually locate, which is about half the time I want to use it, as I'm watching my show on Netflix the Chromecast will disconnect from my phone or tablet and then I can't pause, rewind, or fast forward the show because my remote is now disconnected. If I want to go to the restroom or do something, I can't even pause my show, so I spend five or ten minutes trying to get the app on my device to reconnect just so I can try to pause the show to do what I need to do.If I had known it was going to be this difficult to regularly connect the device I have to use in order to use the Chromecast, I would have just bought a WiFi blue ray player or Amazon's Fire TV which come with remotes that don't require a network to connect to the device. If you are thinking about buying this device, please think twice and spend the extra 10 to 20 dollars to get something that is not going to frustrate you about 80% of the time you try to use it.", "verified": true, "helpfulness": "0/0", "author": "Kevin Nicholas Butler"}, {"rating": 5.0, "review": "love it...great trasactio", "verified": true, "helpfulness": "0/0", "author": "OGL \"OGL\""}, {"rating": 3.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Kubie"}, {"rating": 2.0, "review": "Ideally an awesome substitute since my new phone doesn't have HDMI, but while the audio is fine (naturally), there's choppy video lag due to higher latency despite several different configurations with a top of the line modem, router, top tier ISP, etc.  Nothing helps, rendering it quite worthless.  Perhaps Miracast, or some other dongle might work properly, but until these things can stream just as smoothly as every other WiFi device for the past decade, newer phone models need to be designed with HDMI ports.", "verified": true, "helpfulness": "0/0", "author": "."}, {"rating": 5.0, "review": "AWESOME", "verified": true, "helpfulness": "0/0", "author": "AMAZONIAN SHOP'AHOLIC \"ASA\""}]