[{"rating": 1.0, "review": "Spend the extra money and get an Apple TV.  The streaming function via Google Chrome is just a disaster on this device.", "verified": true, "helpfulness": "0/1", "author": "Spencer Culbert"}, {"rating": 5.0, "review": "My boyfriend and I have friends and family over often.  Sometimes instead of watching movies, we will watch funny YouTube videos. This media player allows us to put the YouTube videos from our smartphones onto our flat screen TV with the click of a button. I love it!  Everyone enjoys it!", "verified": true, "helpfulness": "0/0", "author": "Nicole from Boston"}, {"rating": 1.0, "review": "And that's being generous. I've been able to watch about 1 complete video on Chromecast, and that's after trying to use it through my laptop and Android phone. I've tried YouTube (which is supposed to be the most compatible), but the \"casting\" works very sporadically, and often locks up the Chromecast, my phone, or my computer. I've given it chance after chance, thinking the fault might be mine, but I'm officially giving up on it, approximately 6 weeks after I bought it. Trying to watch other video is about as effective as with YouTube, including Google Play content that I've purchased. It just doesn't work. I thought I'd love the device, and if it worked like it should, I think I would, but it just falls so short of usable at this time that it's worthless. I can't rate it higher based on wishful thinking, so 1 star it is.", "verified": true, "helpfulness": "1/1", "author": "T."}, {"rating": 3.0, "review": "I don't subscribe to cable because I love Netflix and Hulu.  Being able to stream these services without a secondary unit our hooking up my laptop is ideal.  Chromecast was recommend to me by my brother-in-law who is a software developer and it was a brilliant suggestion.  The only issue I have is it doesn't work well with Xfinity wireless router.  Was a lot more difficult to set up then it should have been (after an hour of trying finally found out the Xfinity router wasn't supported).  Did eventually get it working, but too often it takes several minutes to pair it to the wireless between uses.  When it's functioning, it does exactly what it was designed to do and i can either control my viewing by using my Galaxy S3 or my laptop.", "verified": true, "helpfulness": "0/0", "author": "Scott Bates"}, {"rating": 2.0, "review": "I thought it was a simple \"plug and play\" device. The \"plugging\" was easy: Just plug it into an HDMI connection in the back of the TV. However, the \"playing\" part was not that simple. First, it requires a newer OSX that, unfortunately, my Macbook Pro laptop doesn't have (my daughter rescued me with her newer one.) Second, it takes a laptop and Wifi to control (very awkwardly from my bed, since the TV in my bedroom was the main location that it was intended for. I know it can be controlled with my Iphone, but I couldn't read my Iphone without lighting in my bedroom, at bedtime.) I would most definitely love it (and give it 5 stars) if it comes with a remote control instead. I haven't used it since, but did not return it since it works beautifully (again, with a laptop or a and Wifi or a smart phone for control. Just my bad :)", "verified": true, "helpfulness": "1/1", "author": "thomas"}, {"rating": 1.0, "review": "Chromecast is incompatible with the kindle. Returned it when I found out. It took me a few hours to realize that it wasn't my fault it wasn't working.", "verified": true, "helpfulness": "1/2", "author": "Larry Athing"}, {"rating": 4.0, "review": "satisfied with the purchase.  There are still some bugs that obviously need to be worked out, though I have no doubt that Google will address these in time.", "verified": true, "helpfulness": "0/0", "author": "Sail Mctriguer"}, {"rating": 5.0, "review": "I now have three of these devices and they work flawlessly. It is one of the most useful products I have bought for connectivity. It is unbelievably easy to just start watching netflix, youtube, and HBOGO immediately on your TV.", "verified": true, "helpfulness": "0/0", "author": "J. Young \"Young Badger\""}, {"rating": 5.0, "review": "We love our Chromecast. The entire family uses it from multiple devices(android, iphone, ipod). We ended up getting a second on for the kids to use in their game room.", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 4.0, "review": "Received as a Christmas gift. Easy set up and works seamlessly with my smartphone. Works greatwith Netflix & Youtube. Great item for the cost.", "verified": true, "helpfulness": "0/0", "author": "KBS"}]