[{"rating": 5.0, "review": "The issue that it doesnt include the HDMI cable is somethig Amazon have to fix. After that, everything is good.", "verified": true, "helpfulness": "0/1", "author": "OGE"}, {"rating": 3.0, "review": "I like the product and the idea.  However, I have noticed that at times not all the channels are available and it takes a restart of the Fire TV to then get all the channels (specific to the Sling TV app).  Also, it will be great if you guys add an \"escape\" button to the remote because you can only use the \"back\" button which then freezes the screen while it figures out where to go or you press the wrong button and then you have to figure your way back to where you where ...an escape button will be ideal.  Thank you!", "verified": true, "helpfulness": "1/2", "author": "Yanine"}, {"rating": 5.0, "review": "this is the best streamer for sling TV", "verified": true, "helpfulness": "2/2", "author": "Robert R MacNaughton"}, {"rating": 5.0, "review": "Wow!  Verrry nice!  First off it is the only smart device other than a smart phone or tablet (that I know of) that can attach to a 5ghz wireless signal - that alone makes it a winner.  So needless to say there is NO lag, latency, or buffering EVER.  Never even considered it before, but the photo feature with the cloud is something I am using and really like.  Am a Comcast subscriber and have no access to HBOGO or SHOGO but who cares? - have it on the cable box as well as XVTGO.  Got rid of google music finally and am using Amazon music, but have always sensed that the quality of the music is  not as good as other music carriers.  Still think that after going thru the Fire TV.  It's not a big deal, though. The big deal is the digital quality and surround signal and IT IS PERFECT", "verified": true, "helpfulness": "0/0", "author": "Mark Simons"}, {"rating": 5.0, "review": "Great alternative to pay tv. Lots of options to choose from. Something for the whole family.", "verified": true, "helpfulness": "0/0", "author": "Paul C"}, {"rating": 3.0, "review": "Although I frequently experience numerous problems, I suspect all the trouble is directly associated with my despicable internet provider (Frontier). Unfortunately, it appears Frontier actually may have my territory somehow monopolized? Nevertheless, the only thing I am disappointed with is the fact that to this day; I have yet to figure out how to shut the neat little box off?? Unfortunately, It does not have a power \"On/Off\" feature and, it rarely shuts itself off.", "verified": true, "helpfulness": "0/1", "author": "Thomas"}, {"rating": 2.0, "review": "Bought this for my mom.  Didn't support hbo or showtime.  Very limited apps.  Voice command not supported for netflix.", "verified": true, "helpfulness": "1/4", "author": "Nato"}, {"rating": 3.0, "review": "theres only one reason to buy this device,,,,,you have to if you want to use amazon prime fire video service,,,i have 3 android smart tv devices already,,,,,they all work great with android apps,,,,,but they wont work work with amazon prime streaming video,,,,,so i give up,,,,i want to watch hot new movies that netflix doesnt have ,,,,so only choice,,,buy this device,,,,its not much good for anything else,,,,,and it doent even have amazon appstore or amazon marketplace options!!!!.....wow,,,,how stupid is that,,,,,", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Much like the Fire Stick, it is fantastic.", "verified": true, "helpfulness": "0/0", "author": "OverthehillBilly"}, {"rating": 5.0, "review": "This device is the best out there.", "verified": false, "helpfulness": "0/0", "author": "mom"}]