[{"rating": 5.0, "review": "Love it. Only thing is, don't buy the extra plug that they say is often bought with this system. It is included, so if you buy it, you will either have two or have to return the extra. Don't know why it says often bought with unless people buy it thinking they will need it. Don't get caught that way!", "verified": true, "helpfulness": "0/0", "author": "River Bend Farmer \"Book and a Cat\""}, {"rating": 4.0, "review": "When Amazon designed Fire TV, it did so by addressing the weaknesses highlighted in reviews of competing products, so it goes.At the time, complaints were about speed, UI and search. This box is fast, it looks pretty (although cannot be customized) and the voice search works beautifully. But the world has moved on.Content is king, and navigation is Queen. With network and cable operators offering apps for streaming content via Watch ABC, FOXNOW, and others, it's simply easier for me to watch what I want to on a different platform. For services that are on Fire TV (Netflix, Hulu, HBO Go) accessing non-Amazon content requires you to go out of your way. The application isn't in your \"Recent\" list? You have to scroll down to \"Apps\", sideways through a carousel, and then navigate within the application.What would take 3-4 clicks on a Roku or Apple TV can take 12-15 on Fire TV. It almost feels like being punished for not buying the content directly from Amazon. If non-Amazon content were better integrated and easier to navigate, I would use my Fire TV more often and therefore spend more money in Amazon's ecosystem.The box sits under my TV waiting to be useful. If a few things change, I would happily toss out my Roku.1. Integrate shows/movies from third party services in the recently used carousel. It makes no sense that an Amazon-purchased movie is given parity with the Netflix or Hulu apps.2. Work to add more content providers. Watch ABC, FOXNOW, etc. could easily be ported.3. Allow me to customize the view. It shouldn't take me 45 seconds to find HBO Go.I really want to like my Fire TV, because there is so much potential. But the gains in speed and discovery of Amazon content are offset by a clunky interface and limited offerings when compared with competitors.", "verified": true, "helpfulness": "0/0", "author": "Alex MacLeod"}, {"rating": 3.0, "review": "Love the product hate the product. The first one I bought from Best Buy the sound only came out when it wanted to. Not having the same problem with the second one though but still would recommend to a friend", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "I like Amazon Fire TV more that Apple TV", "verified": false, "helpfulness": "0/0", "author": "Kenneth Gammill"}, {"rating": 5.0, "review": "Love, love, love Amazon fire TV!!!", "verified": true, "helpfulness": "0/0", "author": "stephanie watts"}, {"rating": 5.0, "review": "Awesome! Was wary about cutting my cable service, but Amazon Fire TV is a pleasant surprise. I am so happy I did it.It might feel weird for a while, but from now on what I watch is a conscious choice. Plenty of movies on Amazon Prime and I can lifestream CBS and other channels, to watch shows I enjoy like 60 minutes.You can play games, it has voice recognition (you can ask for movies or actors) and it's easy and straightforward.Very happy", "verified": true, "helpfulness": "0/0", "author": "Lucrecia A. Masaya"}, {"rating": 5.0, "review": "Love the hundreds of options.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Plug N Play. Worked great from the get-go. I was a bit leery because it said \"refurbished\", but the price was right. I'm no longer leery. It's definitely an asset if you already have an Amazon Prime Account.  It arrives ready to go. More apps can be added directly to the device from Amazon.com.", "verified": true, "helpfulness": "0/0", "author": "Mike B"}, {"rating": 3.0, "review": "Great performance, high quality, hi def video.... Handicapped by no easy way to view all the videos available. Certainly you can see some of the latest but this library of thousands and thousands of videos is not given in a aggregated visual library that I have been able to find.Its easy enough to do a voice search but if you dont know the specifics or are trying to randomly search for something new you might as well give it up. Yes, I would buy it again and I will keep the service but it makes me wonder why have something with such great hardware that is gimped by such poor presentation of the overall library of free video in a visual format.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "After trying 2 units from amazon fire tv. I was informed that my Television set would not accept the streaming because it was not a HTC compatibleThis should be clearly stated on the advertisement for it. it was not. I was informed that my TV should be at least 3 yrs old not more than 3.this was very disappointing.", "verified": true, "helpfulness": "0/1", "author": "L. Cab \"LCab\""}]