[{"rating": 5.0, "review": "Love the voice feature.", "verified": true, "helpfulness": "0/0", "author": "AJH"}, {"rating": 5.0, "review": "This is by far the best streaming device on the market now and this is coming from a die hard roku 3 user. From apps to games this blows all the others out the water I'm not the kind of person to go to too in depth but you won't be disappointed", "verified": true, "helpfulness": "0/0", "author": "Amazon Alan Parrish"}, {"rating": 5.0, "review": "Husband debated which device we wanted and since I am a prime member went with the Amazon Fire TV box with remote. It is the best decision we ever made. We love love love it! We have been watching the prime series for free and decided to try a movie for 4.99 over the weekend. The picture and sound quality beat our Time Warner on demand by 100 percent. The price is $1 cheaper then TW also. Highly recommend this to other prime members.", "verified": true, "helpfulness": "1/1", "author": "Cathy Taylor"}, {"rating": 5.0, "review": "I got this to replace my Sony BDP-5100 as my online streaming device.  It is much faster at loading videos and does not constantly stutter playing Hulu like the bluray player had started to do.  The Plex app works great as a DLNA server and the DD+ sound on Prime and Netflix is great.", "verified": true, "helpfulness": "0/0", "author": "colin"}, {"rating": 5.0, "review": "Works great. Fast shipping", "verified": true, "helpfulness": "0/0", "author": "Matthew Dankert"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "ajw"}, {"rating": 5.0, "review": "I like this over the Roku, you cant beat for the price and everything that comes with it. Its amazing, you just talk into it and it finds just about anything. I love it.", "verified": true, "helpfulness": "0/0", "author": "Rico"}, {"rating": 5.0, "review": "Just what the Dr. ordered!!!  We have really enjoyed all of the functions.", "verified": true, "helpfulness": "0/0", "author": "William Fleming"}, {"rating": 5.0, "review": "honestly its does what anything can do now a days. the only upside is the 99 a year for prime I guess idk. my wife wanted it. she said give it 5 stars. But it is very snappy compared to most other brands. The specs are a lot better so please do buy this one and not a rokuuuuuu.", "verified": true, "helpfulness": "0/0", "author": "Kodi"}, {"rating": 1.0, "review": "if I cant connect my USB external drive, its just a paper weight for me.", "verified": true, "helpfulness": "1/1", "author": "A. M \"am\""}]