[{"rating": 5.0, "review": "Total home run.  It does everything as advertised as quickly as you can imagine.  This product is the real deal.", "verified": true, "helpfulness": "0/0", "author": "Dylan Kramer"}, {"rating": 4.0, "review": "Gets 5 stars when native apps are added to stream and local media as well. Great price!! Great product overall.", "verified": true, "helpfulness": "0/0", "author": "RW"}, {"rating": 4.0, "review": "Awesome! Just need more apps to support it (which is coming in near future)I love it. Easy to install, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Nimesh Soni"}, {"rating": 1.0, "review": "Doesn't work with my Linksys E 3200 router though documentation says it does. emailed and talked to Google Support. Only works if I diable all my firewalls and allow open access - not going to do THAT! Why couldnt I just plug it into my PC via USB, tell it the network SSID & WEP password and off we go? Is that too hard?! Geez. All my other internet devices work just fine.SOooooooo disappointed. great idea. awesome price. if only it worked. boo.", "verified": true, "helpfulness": "1/3", "author": "ygnition \"Tom\""}, {"rating": 5.0, "review": "Very nice product. . Does everything and some.. I will recommend this product to my fam and friends.. Thank You", "verified": true, "helpfulness": "0/0", "author": "Raymond Rouzan"}, {"rating": 1.0, "review": "It is an utterly useless piece of gadget. I would reccommend that no one buys it until google adds more video apps beside netflix", "verified": true, "helpfulness": "1/5", "author": "sherif"}, {"rating": 4.0, "review": "very easy to install, works great across many devices. So far it has been great for viewing YouTube and watching movies from play.google.com. Also very useful to connect a Laptop to your screen for presentation without additional wiresWill give an additional star when i can start viewing Pictures and movies taken from my phone or device.", "verified": true, "helpfulness": "0/0", "author": "Nagib"}, {"rating": 4.0, "review": "This item at the moment can't be used to watch local files, listen music and so on. Maybe later something will be changed.", "verified": true, "helpfulness": "0/0", "author": "Anton D. Stavinsky"}, {"rating": 5.0, "review": "Very good, easy setupMeet expectations, great value for moneyIts easy to operate with both andriod as well as ios.", "verified": true, "helpfulness": "0/0", "author": "Imran"}, {"rating": 5.0, "review": "Easy setup and low cost make this great for anybody with a hdmi port on their tv to stream netflicks, youtube, etc. Took about 3 min to set up. Now I can control netflicks and hulu plus from my phone or laptop. I love it.", "verified": true, "helpfulness": "0/0", "author": "Patricia K McGowen"}]