[{"rating": 5.0, "review": "My wife and I both absolutely love Amazon FIRE.  I do not have cable or satellite in my vacation home so this fits the bill perfectly.  There are enough Amazon Prime shows to keep me entertained when I am there.  A great low-cost alternative to subscription television.  Just be sure you buy it on sale.  I foolishly paid full price when it is easily found for $20+ less.", "verified": true, "helpfulness": "0/1", "author": "Voice Over"}, {"rating": 5.0, "review": "This thing is awesome !!!  Picture quality is perfect, and the digital sound is what I expected it to be. It connected to my router right away and there has been no lag at all......amazing !!! It came already registered to me, and it worked right outta the box. Imagine that...... something that exceeded my expectations !!!  The interface is very quick and response time is almost nothing.  I am buying another 3 for the other bedrooms. The size of the unit is just smaller than 2 cd cases stacked together.. very small foot print. simply amazing !!!", "verified": true, "helpfulness": "0/0", "author": "Albert Charles Dickens"}, {"rating": 5.0, "review": "The remote's ease of use is phenomenal. It also appears to be a more stable platform than my WD media player.", "verified": true, "helpfulness": "0/1", "author": "Barbara Frommer"}, {"rating": 3.0, "review": "The Fire TV works as advertised. The only two items that are not 100% satisfactory are the remote response, and the ease of mistakenly purchasing content.  To elaborate, the remote seems to become non-responsive if too many button presses are rapidly in sequence, for example, pressing the back arrow to go up a few menu tiers.  Second, when searching for content, specifically included Prime content, you can quickly be presented with purchased content. The newer firmware does a better job of identifying non-included content, but it would be nice if the BUY button was a different color or something.  I'm contemplating turning on the PIN function to prevent a mistake.", "verified": true, "helpfulness": "1/1", "author": "S. Westveer"}, {"rating": 5.0, "review": "I would rebuy this as a gift in a minute. It provides a lot of entertainment. Movies, games, TV shows, radio stations, etc. It is well worth the price.", "verified": true, "helpfulness": "0/1", "author": "Peace"}, {"rating": 4.0, "review": "I got the Fire TV when it was 70 bucks on deal. I do think it is a competitive product and fits in nicely with my other gizmos. Currently I have a smart TV, a Roku 3, and a Synology server. I have to say that out of the bunch, the TV is the easiest to use. It is an LG, and does a very nice job of picking up the DNLA from the Synology. It transcodes nicely so MKV files and most AVI's perform without a hitch through the television itself.The Roku does an excellent job as well. I like having the streaming services all available in one place. It also does a fair job with serving up video from the Synology, but often it has troubles with MKV files.So where does the Fire TV fit in? The immediate attraction is in using Amazon services. Video on the FTV is exceptionally sharp, serves up quickly from the stream, and never seemed to degrade during the show.The interface is simple, but clunky and oddly linear which makes it occasionally unclear what I'm looking at or looking for.I have to say that the reason I got the device at all was because of the horsepower of the unit and the success of sideloading some applications and running XBMC. Sideloaded android applications are hit and miss and of debatable utility.but it's fun as proof of concept. XBMC is an interesting piece of software that requires some time commitment to use. I'm not entirely sure that the expansiveness of its offerings is worth the time invested. Repositories are often down, under attack, or filled with more crap than I want to sift through. But it's there if you wanted, and the instructions are easily available online. It is true that the current stock FTV system is not currently roots me, but this doesn't make a difference in sideloading applications.I have to say that I find it more useful than the Apple TV that I had briefly, but I don't have a lot of investment in iTunes. I don't have a lot invested in Amazon videos either, but I do enjoy \"The Good Wife\"  on the Fire TV makes it a pleasure to watch.On the whole, I do feel like this is more of a hobby box while the Roku is a workhorse. I'll keep playing with the device. It will be interesting to see where it goes.", "verified": true, "helpfulness": "1/1", "author": "J. Hicks"}, {"rating": 5.0, "review": "best purchase I ever made I love it since I don't have cable", "verified": true, "helpfulness": "0/1", "author": "Nancy Huemme"}, {"rating": 2.0, "review": "The service works great - love the microphone interface -- but am disappointed at how little there is access to without having to pay a rental fee.", "verified": true, "helpfulness": "2/3", "author": "Sparky"}, {"rating": 5.0, "review": "LOVE IT!  WILL NEVER leave home to rent a movie again!  Super easy to set up and so user friendly.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was one of my best purchases!  I love my Kindle Fire but I never thought I would be able to view on my TV everything I have on the Kindle Fire.  It is great :-)", "verified": true, "helpfulness": "2/3", "author": "Edith"}]