[{"rating": 4.0, "review": "Extremely easy setup but seems to really prefer a 802.11n or faster network.Initially ran through my Linksys 802.11g wireless router and it was prone to start a NetFlix movie, then after a few seconds, reload it. This may happen several times.I'm a programmer of many years and suspect a timing loop issue -- i.e. it takes longer that the software expects to load at the slower speed so it aborts and starts over. Since most folks running a Chromecast have probably upgraded their network to 802.11n or 802.11ac, this shouldn't be a problem.If not for that one issue, I would have given it 5 stars!I wish all computer devices were this well engineered and programmed!", "verified": true, "helpfulness": "0/0", "author": "DocSalvager"}, {"rating": 3.0, "review": "I'm an Apple user and I purchased the Chromecast thinking it would be a cheaper alternative to the Apple TV (and that's probably where I went wrong).We watch a lot of movies at our house. So I wanted to be able to watch Netflix, Amazon Prime, Hulu, Youtube, directly on my TV as easily and efficiently as possible. Right now we use our PS4 to watch movies and access video streaming apps, but I have to interchange between 3 remote controls before I can accomplish these desired tasks. It's simply not that efficient.Now that you know why I purchased this, I'll tell you what this device can do or at least what I was able to do with it.~ I was able to stream Netflix videos on my TV.~ I was able to watch YouTube videos on my TV.Only the above video streaming apps were available on my Chromecast. I looked for a place to add more apps but I didn't find any. Not also sure if there are any more available, not yet at least.You can also stream your photos and videos on your TV using the Chromecast. But in order to do this you have to download the \"Plex\" app from the app store. Once you have the app, you can connect your Chromecast with it. Then you can upload the files you want to stream on your TV into the Plex app.The Plex app is free. However, if you want to do the file streaming thing, you have to subscribe to Plex. I believe it's $3.50/month or something like that. I didn't see myself utilizing this feature often enough to justify the monthly fee.To sum it up, if you want to watch Netflix and Youtube videos on your TV, or stream photos and videos from your mobile device to your TV (and don't mind paying the monthly fee), and you don't have any other device you can utilize for these purposes then go ahead and purchase the Chromecast. But if you want to do more, I suggest saving up an additional $60 and buy the Apple TV instead.This review is from an Apple user. My review applies to those who intend to operate the Chromecast using an iPhone, an iPad, or a Mac.", "verified": true, "helpfulness": "0/0", "author": "Katherine O. \"pinaycana\""}, {"rating": 5.0, "review": "Easy set up. Used it approximately 5 times since purchase. The Last time I used it, I had issues with TV picture freezing. The sound continued uninterrupted. I tried both 2.4ghz and 5ghz connections and was the same. Not sure if it is the Chrome device or my wifi network. I do notice the TV display is darker as if Chrome transmission is programmed to be too warm with the color tones. I compared to my Netgear push2tv and found the Netgear stream is brighter. Still a easy and inexpensive way to bounce media  to your HDTV.", "verified": true, "helpfulness": "0/0", "author": "Bill R920 \"Broedl\""}, {"rating": 5.0, "review": "I absolutely love my Chromecast. I use it for Netflix, HuluPlus, HBO Go, and Pandora. It's AMAZING!!! Highly RECOMMEND. Maybe one day it'll even work with Amazon?!?!  =)", "verified": true, "helpfulness": "0/0", "author": "Heather Crawford"}, {"rating": 4.0, "review": "It does whatever it is supposed to do and more features are also being added by Google through firmware update.", "verified": true, "helpfulness": "0/0", "author": "suresh.v.kulkarni"}, {"rating": 4.0, "review": "The Chromecast generally does everything Google says it will, though not as much as more expensive set top boxes such as the Roku.  It is very easy to set up and usually works well with the apps Google does support, though recently I had a problem with Chromecasting a YouTube video with the video halting  every 5-10 minutes and looking like it was buffering but never restarting.  I had to stop Chromecasting and reconnect each time to continue.  Chromecasting open tabs from the Chrome browser is in beta and is iffy for broadcasting video from your computer but is still useful for putting your browser screen on your TV.  All in all Chromecast is a deal for the $30 I paid on a special with a $6 credit for Google video.", "verified": true, "helpfulness": "0/0", "author": "Jeff2468"}, {"rating": 4.0, "review": "Is good I like very nice to have for tv for shows to watch is good is nice i like", "verified": true, "helpfulness": "0/0", "author": "Michael Knoll"}, {"rating": 4.0, "review": "Works well!  Enjoying Chromecast, although it would be nice if there were more options than YouTube and Netflix, which we already have.", "verified": true, "helpfulness": "0/0", "author": "Elaine"}, {"rating": 5.0, "review": "Great device. Use it with my phone. No problemsEasy to set up and connect.Great for you tube and hulu", "verified": true, "helpfulness": "0/0", "author": "tessandme \"tess\""}, {"rating": 5.0, "review": "We were looking for a way to play foreign movies from YouTube on the TV, and we wanted the subtitles to show. With our Viera Cast, we couldn't get subtitles. After much searching and finding only an expensive and not so great solution of using an HDMI conversion cable for an older laptop, a sales person finally said, \"You need Chromecast. It's right over there.\" It works great--we have subtitles now--and it cost $50 less than a cable that would have had very limited use. We can connect from our cell phones, tablet or laptop. What's more, we can use it on any TV and access other streaming services as well. It was super easy to set up, and a nice inexpensive solution to use with TVs that don't already have access to streaming media.", "verified": false, "helpfulness": "0/0", "author": "D. Booth \"digitographer\""}]