[{"rating": 4.0, "review": "This was a great buy and purchase from amazon. I love the features and the benefits of being a prime member the only problem is theres not a lot of selections for movies, but great for games", "verified": true, "helpfulness": "0/0", "author": "Jen \"Jen\""}, {"rating": 1.0, "review": "I really love the Amazon Fire TV.  We live in an area with no real radio reception - now we use the music apps through the home theater system and it's awesome.  Been a Prime member for a couple of years and now I can watch everything on my big screen tv.  However, we did run into a problem.  We set the Fire TV up with parental controls - just to keep ourselves from accidentally purchasing instead of viewing strictly Prime movies.  At some point, we temporarily lost internet connnection.  When I tried to reconnect, it wanted my PIN.  However it couldn't verify the PIN unless I was connected to the internet.  And I couldn't connect to the internet without being able to verify the PIN.  A serious Catch 22.  Had a couple of conversations with customer service - the first person I spoke with never did anything.  I then called back and spoke with Garret C.  AMAZON CORPORATE - LISTEN UP!!!!  Garret C. is excellent.  He took care of the problem, stayed in contact while doing so and has been extremely pleasant, polite and helpful.  If you're not going to promote him, at least give him a raise!!!Okay, so the new Fire TV just arrived.  I'll set it up tonight and unless something still doesn't work, this review is done.  Buy this thing and get Amazon Prime - So well worth it!!!UPDATE 9/9/14:  AMAZON CUSTOMER SERVICE IS ATTROCIOUS.  Had another problem with the Fire TV.  Just stopped working on 9/3/14.  On I called Amazon and after being put through three phone calls, I finally got someone who agreed to send out a new unit.  Plus, because it was Thursday and the weekend was coming, they told me they would send it overnight.  Not only did they not send it overnight, they NEVER SENT IT!!!  I checked Amazon Tracking and UPS tracking and the unit never left the facility.  So on Monday, 9/8/14, I again called.  During the first call, I was transferred three times, kept on the phone for over 25 minutes, the 12 minutes ON HOLD.  I hung up, reconnected and told the customer service rep the problem I was having with just getting someone to help me.  She told me that there are people there that will simply transfer you or put you on permanent hold.  I finally talked to a woman who said she would check on it and get right back to me.  30 minutes later and no call back, I had to again get ahold of Amazon.  Finally, after another 15 minutes on the phone, a woman named Tina helped.  She said she would send out a new unit, overnight.  I just received it this morning and will set it up when I get home.  The point of this review is not about the product, but rather THE LOUSY CUSTOMER SERVICE THAT AMAZON THINKS IS OKAY.  I have had to speak with customer service on nine different occasions.  Out of nine times, three people were actually helpful and did their job.  That's 33 percent average Amazon.  Is that your goal?  I implore you, before buying this or anything else from Amazon:  Consider the hassle YOU WILL RUN INTO with customer service.  Shame on you, Amazon, especially for treating a loyal customer so awful.", "verified": true, "helpfulness": "0/1", "author": "burb1016"}, {"rating": 5.0, "review": "I had a Roku 2 and it was giving me problems. This product has a great interface and flawless design! Excellent combination of form and function!I am still using it but so far I love it! I think it is better than apple tv, absolutely faster and easier to use!", "verified": true, "helpfulness": "0/0", "author": "hb \"Holdyn b.\""}, {"rating": 5.0, "review": "Love this product. Nice to watch some old classic shows and movies. I have not had cable for 3 years. I don't miss it at all.", "verified": true, "helpfulness": "0/0", "author": "truth seeker \"truth seeker\""}, {"rating": 5.0, "review": "It has an amazingly clear and crisp picture quality. Very good product if you just want to enjoy Amazon Prime videos, Netflix videos and you tube on your tv like me.", "verified": true, "helpfulness": "0/0", "author": "Asma"}, {"rating": 3.0, "review": "If you enjoy Amazon Instant Video and want a Roku-type device for your home. This is a great option. The major bummer that I found with the device is, unlike AppleTV, it requires you use a third party app to view your media server. Because of this, I did sell it off after a month of owning it.", "verified": true, "helpfulness": "0/0", "author": "Timothy Lusk"}, {"rating": 4.0, "review": "Hulu freezes all the time, the if you go back out a level then it's hard at time to get back to where you left off and the episode of a TV show will restart from the beginning. and if you use your voice to find the show again, then it won't always let you resume.The voice feature to find a show or movie, is AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Kyle G. Main"}, {"rating": 5.0, "review": "We enjoy watching movies in our home rather than a theater and this tool has brought lots of great movies to our attention.  I like Amazon's suggestions for movies we might enjoy -- also TV series that we missed.", "verified": true, "helpfulness": "0/0", "author": "Connie P"}, {"rating": 4.0, "review": "This is a good product.  The biggest drawback is also one of its best features; the remote.  I have gotten spoiled with my other devices that allow me to control them with my android devices when sharing the same network.Now everybody has to remember where they put the remote.  Unit is completely not usable without the remote.As soon as Amazon writes a simple app for the smartphone users this device will be almost perfect.", "verified": true, "helpfulness": "0/0", "author": "BIGROD"}, {"rating": 5.0, "review": "Nicely done, easy to use tooI thought this would be another brain stumper .I like it , WHAT'S  NEXT ?", "verified": true, "helpfulness": "0/0", "author": "joecool4168"}]