[{"rating": 3.0, "review": "The remote rather not intuitive and very sensitive to movement .if I accidentally bump the toggle , it will stop the program and fortunately netflix has option to resume playing but the remote neet major overhaul. otherwise , the menu is pretty decent.", "verified": true, "helpfulness": "0/0", "author": "Squirllvr"}, {"rating": 5.0, "review": "It is said that \"any suitably advanced technology is indistinguishable from magic.\"The Fire TV may not be magic, but you won't convince me it's not. This is what I was looking for when I bought the Roku box 2 years ago, except it wasn't out yet. The picture quality is fantastic, the voice search seems to know what I'm looking for better than I do, and the setup was even easier than the Roku (which a five-year-old could do).I may buy another one for backup, even though I only have one TV.The Amazon Fire TV and Amazon Prime... it doesn't get any better than this!", "verified": true, "helpfulness": "0/0", "author": "Steve Craig"}, {"rating": 4.0, "review": "Really good product to have. Cuts the need for expensive alternatives.  But...more prime video is needed and rentals are too high.  Better to grab a redbox. Overall a great addition to my movie experience.  Thanks amazon!!!!", "verified": true, "helpfulness": "0/0", "author": "alicia1975 \"A. Martins\""}, {"rating": 5.0, "review": "Instant playback! I haven't had any device that starts the shows instantly like the Fire TV.  The voice search is amazing.  It is extremely easy to set up.  I watch more Amazon Prime shows now than I have ever watched before.  Thanks for making such a wonderful product.", "verified": true, "helpfulness": "0/0", "author": "Frankie R. Manion"}, {"rating": 5.0, "review": "I love this thing.  Up to this point, I have only used Bluray players and the Wii to watch Netflix on the TV.  Every Bluray player I have owned sucked at Netflix.  The Fire TV just works.  It is very stable and responsive.  The voice search works everytime.  I don't have too many complaints about the interface.  I would like it to be easier to search only in Prime videos.  You can look at what's new in the Prime, but not new and old stuff.", "verified": true, "helpfulness": "0/0", "author": "Mark R \"che engineer\""}, {"rating": 5.0, "review": "What can I say. Thumbs up", "verified": true, "helpfulness": "0/0", "author": "Nynetta G. Adams"}, {"rating": 2.0, "review": "Not enough family choices available as prime member.", "verified": true, "helpfulness": "2/3", "author": "C. V. Bessette \"Mother of two\""}, {"rating": 5.0, "review": "I have waited for year to find a easy way to show items on my TV that i have found on my TV. There were many programs and apps to reach movies- but the management of them was crazy! UNTIL Amazon Fire TV. I was an early adapter and even ordered it before it actual hit the store. It is so easy to use. The price was right too,especially when as i am, you are an Amazon Prime. I still am hoping for more and more recent movies for free but then again i'm a bit greedy!", "verified": true, "helpfulness": "1/1", "author": "Chrisine Johnson"}, {"rating": 5.0, "review": "I am never at a loss for something to watch with Amazon Fire TV.  I do not miss cable at all! If there is something I want to see, I just go to that particular channel's web site, but even that is rare. If you love movies, this is your ticket. The voice recognition is really fun.", "verified": true, "helpfulness": "1/1", "author": "L.A. Sexton"}, {"rating": 5.0, "review": "I wish there was more broad app support for this already. I've had it for a few months and had to side-load crunchy roll. I love the hardware and its snappy responsiveness.", "verified": true, "helpfulness": "1/1", "author": "Randall \"Randall\""}]