[{"rating": 3.0, "review": "youtube works fine, but chrome tab casting is not good. Chromecast does get disconnected frequently when casting a tab. Due to this reason, I was not able to eliminate need of HDMI cable which i was expecting this device to do.", "verified": true, "helpfulness": "0/0", "author": "vishm"}, {"rating": 5.0, "review": "I bought this as a Christmas gift for a friend who watches a lot of media on his tablet. He said the set up was super easy and he absolutely loves it. He even bought several as gifts for family and friends after trying it out. I think I'm going to buy one for myself next.", "verified": true, "helpfulness": "0/0", "author": "Annise"}, {"rating": 1.0, "review": "Picture quality was degraded and streaming was erratic-slow I was quite disappointed in the performance though the install was easy enough it was quick tio install though functionality was dismal at best!", "verified": true, "helpfulness": "0/1", "author": "Douglas C Hettler"}, {"rating": 5.0, "review": "Keep in mind it won't stream from Mobil chrome yet. You can only use YouTube and Netflix from mobile apps.", "verified": true, "helpfulness": "0/0", "author": "John smith \"Marcelo\""}, {"rating": 1.0, "review": "It is very limitated deviceIt works good with chrome but there is no easy way to stream videos from your smartphone or tablet.It just shares youtube, netflix and etc (not content stored at your device).Lacks something yet to be a good player.Very disappointed.", "verified": true, "helpfulness": "0/1", "author": "Thiago"}, {"rating": 1.0, "review": "I bought it to enable playing my photo albums on my HD TV, but didn't read the description of Chromecast features in enough detail before ordering it to see that it would not work for this purpose.  I am already able to stream Netflix, etc. without the Chromcast and don't need it for what it currently does.  I haven't even taken it out of the box and won't unless/until it allows me to view my photos on my TV.", "verified": true, "helpfulness": "1/4", "author": "Bill"}, {"rating": 5.0, "review": "THis is only going to get better as they continue to develop and allow others to develop. Even though it is not what it is meant for right now, it can mirror your screen but without sound. Read about this yourself and make sure it does what you think it will do but you can't beat the value. Also, don't forget to drink your ovaltine.", "verified": true, "helpfulness": "1/1", "author": "WARRIOR \"WARRIOR!\""}, {"rating": 5.0, "review": "The chrome cast product works great to stream Netflix. Very happy with the product. I will be purchasing another one soon.", "verified": true, "helpfulness": "1/1", "author": "Sandra"}, {"rating": 5.0, "review": "Works like a magic and no complains. Streaming is instantaneous and high quality. Easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Anand Kishore Gaddamu"}, {"rating": 3.0, "review": "The Chromecast was easy to install and did work fine when I tested it with Netflix and Youtube.  The reason for only three stars is because you can't cast everything from an ipad or iphone that you can from your laptop.  Also I must have missed this when reading about it before purchase, you cannot cast from a desktop that does not have wifi even though it is on the same network.  That's probably my misunderstanding.  I have both the Chromecast and a Roku box, if I could only have one it would NOT be the Chromecast.", "verified": true, "helpfulness": "2/3", "author": "BSarkady"}]