[{"rating": 3.0, "review": "Harder to use than I thought it would be. We have a Roku already but got this for the gaming. It's so advanced my 5 and 7 year old can't easily run it. The games keep freezing up as well as the part where you choose shows. If you use the voice command, which was a draw for the kids to use, you get the Amazon shows. Most of which cost money. Still trying to figure it out, but not impressed.", "verified": true, "helpfulness": "0/0", "author": "Sammi S."}, {"rating": 5.0, "review": "Simple to setup and works well. This replaces my cable television service.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "After the free trial I found out that in addition to the subscription fee, some of the content that I wanted to watch required an additional fee.  I promptly canceled.  Other sites don't charge additional fees.", "verified": true, "helpfulness": "1/3", "author": "Michael"}, {"rating": 5.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "Brittany Pruitt"}, {"rating": 5.0, "review": "Exelent", "verified": true, "helpfulness": "0/0", "author": "rubia"}, {"rating": 5.0, "review": "Great product. The only problem is that when the unit goes into standby, you often have to unplug the power to get it to come back on.", "verified": true, "helpfulness": "0/0", "author": "Eclectic \"Voracious Reader\""}, {"rating": 1.0, "review": "I am not able to get to work through my dvd player. We need to get someone to help.", "verified": true, "helpfulness": "0/3", "author": "Jill Campbell"}, {"rating": 5.0, "review": "I purchased this device over a year ago, and I simply love it.  It was super easy to hook up, and when in doubt you can use the speak back feature when you can't find what your looking for.  If someone is looking for a great source of Netflix, Amazon Prime, etc this is perfect.  Considering purchasing another to replace my Wii we use to watch Netflix on.  The Wii is simply too slow as the Amazon Fire has a great processor.  I can even control where in the home we watch the shows by my iPhone.  So great.  Cancel cable.  Cancel dish.  Get some internet, Pay $200 up front (Amazon Fire & Amazon Prime Subscription) and then you only pay for the Internet and Netflix monthly.  Went from paying $150 monthly to $55.", "verified": true, "helpfulness": "0/0", "author": "Doddy"}, {"rating": 5.0, "review": "Love it.  I bought a few for my self. And gave some away fr B-days.", "verified": true, "helpfulness": "0/0", "author": "Michael Gutierrez"}, {"rating": 5.0, "review": "What can I say about Amazon Fire TV? It's great. I bought one for my parents for Christmas 2014 and they have been hooked on Netflix ever since. Even better -- I can watch YouTube videos on our big screen now. Super easy to use (I mean, my parents use it daily, so that should tell you something) and almost never has issues. Even if we do have problems it's been a Netflix-specific or wifi connection problem, never Amazon itself. I know when I move out I will be buying one for myself and foregoing cable. Thank you, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Dana Weikel"}]