[{"rating": 5.0, "review": "I cut cable because of Chromecast. It's the best device you'll purchase for a long while.", "verified": true, "helpfulness": "0/0", "author": "Joey L Jensen"}, {"rating": 5.0, "review": "Excelent", "verified": false, "helpfulness": "0/0", "author": "kathleen basile"}, {"rating": 3.0, "review": "It's a little glitchy for me when I'm using it sometimes. But overall I am pleased with this.", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 5.0, "review": "Awesome and cheap", "verified": true, "helpfulness": "0/0", "author": "John William Saady"}, {"rating": 2.0, "review": "I was disappointed with Chromecast.  It did not work nearly as well as I was hoping.  I had purchased it to sync my laptop with my television, so that I could play emulated games on the big screen.  There was far too much lag to accommodate this.  I have also used this mirror a browser window to my television, but it repeatedly lost connection.  I had to repeatedly restart the stream to the TV.  Sometimes it did work well, and other times it really didn't.This doesn't work for the purposes that I bought it and it only worked sporadically for the express purposes it is sold for.  I would not recommend this product to others.  I've spoken to other people who like the Chromecast, but that wasn't my experience.", "verified": true, "helpfulness": "0/1", "author": "Michael P. Utke"}, {"rating": 1.0, "review": "The worst consumer product I've bought since buying a one of those toy in a bubble as a child.  It would be better worth your money to go buy $35 worth of clothes from the dollar store and see if they shrink/fade/disintegrate in the wash or not.  More entertaining  as well.I have visions of throwing my chromecast out my 4-story window and then running down the stairs to break it further by crushing it under my heel.  I can practically see all the little pieces now, it almost brings tears to my eyes.  Then, I'd like to order a second chromecast, dip it in something flammable, take outside, and light it on fire.  It would be swift, I assume, with a little puff of smoke in the air and then it would be gone...I can't figure out why there are so many positive reviews of this product.  My only theory is that chromecast works well with some systems, but not well at all with others (ie, the right TV, router, phone or notepad, house, state, country...)  Since an IT type person told me about this product, it's also possibly mainly IT type people have bought this product so far and they enjoy the challenge of getting it to work time after time after time.  We're going to give it one more chance and then hope that amazon has a good returns policy.  As my husband said, we'd like to stop suffering.", "verified": false, "helpfulness": "1/4", "author": "Rebecca H"}, {"rating": 5.0, "review": "Works as it was intended", "verified": true, "helpfulness": "0/0", "author": "Jack W Smith"}, {"rating": 1.0, "review": "Not what I expected !", "verified": true, "helpfulness": "0/6", "author": "Harold R Martin"}, {"rating": 5.0, "review": "I'm very much with this.thank you very much may God bless you.😇😇😇", "verified": true, "helpfulness": "0/0", "author": "orlando \"orlando melendez\""}, {"rating": 5.0, "review": "By now a review isn't necessary as many others have sufficiently reviewed it, but I really do love this dongle.  Primarily, I use Google Play Music as my music storage and player.  I really enjoy being able to switch from watching TV to playing music with almost no effort.  Just push the cast button in the music app and start playing my music on my home system.  The TV input switches as soon as I cast something, so there is no need to get the remote and switch to the correct input first.  Now, if Google can get some more apps on board (like Showtime, which is doubtful now with the Amazon contract) it will be that much better.", "verified": true, "helpfulness": "0/0", "author": "Dale K"}]