[{"rating": 5.0, "review": "Easy to set up and use, product is as good as advertised.  It was pretty much plug and play.  Just be sure your wireless modem is strong enough to reach!", "verified": true, "helpfulness": "0/0", "author": "John Thomas"}, {"rating": 5.0, "review": "Plugged into my recently bought oCOSMO 32\" TV and was very simple for me to set up. There was no hassle in the set up process. I was actually surprised how you set up the device. You connect to the Chromecast from your smartphone or laptop using a wifi connection. After you connect its simple, all you have to do is go back to the Chromecast app and finish off the settings. Once again, very easy to put together. Also the packaging is very well done. When you open it up its basically saying, \"well, here you go.\"", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Our streaming needs are primarily Netflix and Amazon.  YouTube not so much, and I guess that's because there is so much searching and typing involved in the YouTube \"experience\" that it lends itself more to the computer than an iPhone or iPad.  Chromecast does not support Amazon, so for us, it starts out only doing half the job.  I bought this as much out of curiosity as need.  We have three Roku boxes and a Vizio TV with built in apps.  One TV, in my office, has no direct streaming, so maybe this could be an answer.  It's not, even though I knew it did not support Amazon streaming.If I use Chromecast with my iPhone, I have only the slightly clunky iPhone apps for Netflix and YouTube and no support for streaming Amazon even from the Chrome browser for iPhone/iPad, because there is no Chrome browser extension for IOS.  I could use it with the Chrome browser on my computer, but then it is limited by my monitor's 4:3 aspect ratio.  In short, Chromecast does less than Roku and not nearly as well as Roku.  One small change, though, and it could become useful:  Get the Amazon streaming app supported or get the iPhone/iPad Chrome extension for Chromecast.  Otherwise, it is too much trouble for what it does.If you are like pretty much everyone I know who streams movies, you need Netflix and Amazon.  If that is you, then the solution is simple:  get a Roku.  It has hundreds of channels and a real remote control.  If, on the other hand, you only stream Netflix, and you want YouTube on the big screen, then Chromecast will work nicely for you, although even then it is only a 3-star device because of its complexity of use compared to Roku.  But if you don't need Amazon, Chromecast might be a decent VALUE--$35 vs $80.", "verified": true, "helpfulness": "2/3", "author": "Bowser B \"Bill\""}, {"rating": 1.0, "review": "This product is horrible.  Set up was easy sure, but it has extreme problems detecting/supporting wifi.  I can stream fine on my computer, tablet, and phone...but when attempting to throw it on chromecast...it buffers for forever or doesn't respond at all.  Spend the extra $70 and get appleTV or another device.", "verified": true, "helpfulness": "1/2", "author": "Jim"}, {"rating": 5.0, "review": "OK, I am not technologically very good, but do try things that I think I can manage to figure out. I tried this because it is advertised as easy to install, and to make streaming media easier, and price-wise seemed quite reasonable. Truly, it was very easy to install. Like, three quick steps. And, it is also true that it makes the streaming process much easier, just a quick click on an icon. It accepts streaming from many different sources, like Hulu, Netflix, YouTube videos, your own online videos, and other things I don't even understand. The one thing it doesn't stream is Amazon Prime videos. Don't know why. Come on Amazon! That is one of the reasons I signed up for Prime some time back, so that I could stream your videos!", "verified": true, "helpfulness": "0/0", "author": "Linda H"}, {"rating": 4.0, "review": "Good picture, excellent streaming. The principal drawback is the inability to \"cast\" from Amazon.It is very easy to use once hooked up properly. (I didn't get it right the first time.)", "verified": true, "helpfulness": "1/1", "author": "Colorado lady"}, {"rating": 5.0, "review": "Can't say enough good things about Chromecast.  It works great, it is super simple to use and set up.  It is by far the best product available in this category.  Sure there are some downsides (no 5GHz wifi) but in the end it works and works well.", "verified": true, "helpfulness": "0/0", "author": "cg"}, {"rating": 4.0, "review": "Despite what some reviewers have written I found this easy to set-up. Took around five minutes. Works perfectly with You Tube but not so well with Netflix. The difficulty is with the Netflix app not this dongle. I do wish that there was an app for watching Amazon Prime videos.", "verified": true, "helpfulness": "1/1", "author": "M Hayden"}, {"rating": 5.0, "review": "It was easy to set up, & the picture quality was better than I expected. I am thinking of getting another for the living room.", "verified": true, "helpfulness": "0/0", "author": "Kerrie"}, {"rating": 4.0, "review": "A great product invention.Works 90% of the time.Sometimes it disconnects during movies, etc.We like this media player, and will continue to use it on a regular basis.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]