[{"rating": 5.0, "review": "Works great, easy to install, provides me very cool view of what I'm working on my PC on my TV...and at a good price.", "verified": true, "helpfulness": "0/0", "author": "Sabrina j souffront"}, {"rating": 5.0, "review": "Love this. We are trying to keep all my toddler's toys in his room versus every room in the house. But it was really boring in his room so we added a TV and used the Google Chromecast to get netflix. It works great!This is the only thing I've tried to do with it though.", "verified": true, "helpfulness": "0/0", "author": "danirue"}, {"rating": 5.0, "review": "Works as described. Follow the directions and don't believe the naysayers. I have no personal interest in this mans guide but I have enjoyed his through work show what can be done plus updates as more developers jump on board and start offering more options and applications for Cromecast. [...]", "verified": true, "helpfulness": "0/0", "author": "Joseph Robertson"}, {"rating": 5.0, "review": "I am not very technical so I was happy to see the easy installation directions. Works great with my Android phone. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Anna Beck \"AG1143\""}, {"rating": 4.0, "review": "i love it have a room with no game system so i put it there tablet phone computer stream love it", "verified": true, "helpfulness": "0/0", "author": "Johnny Groc"}, {"rating": 5.0, "review": "I already got two of them and I'm thinking to get the third one. It is super convenient when you can play any kind of content from your computer and your phone as well.", "verified": true, "helpfulness": "0/0", "author": "Nico"}, {"rating": 5.0, "review": "Easy setup and I use it frequently for YouTube videos and Netflix.  Does what I expected.  Easy to use with phone.  Very cool.", "verified": true, "helpfulness": "0/0", "author": "bigguns68"}, {"rating": 1.0, "review": "Didn't work well in my home, and when it did, it was really unreliable.  It kept disconnecting and had extremely long loading times. Other family members in my household have a roku and apple tv, and they work fine.  I don't know why this didn't work out.", "verified": true, "helpfulness": "0/0", "author": "crystal"}, {"rating": 4.0, "review": "To get 5 stars this needs to have more ability to play local content. I am hoping that this will happen as the SDK was recently released, however for now, I can only play local content through chrome.  This I sflawed in the chrome does not support AC3 audio format (and most 720p movies are in that format), nor does chrome natively play .mkv files. So I need to first convert the audio to AAC (I forget which program I use). I then rename the file to .mp4 and it plays. However if the audio is off I cannot resync it. Hopefully vlc player will soon be chromecast compatible and all issues will be gone.", "verified": true, "helpfulness": "0/0", "author": "A. Hersh"}, {"rating": 3.0, "review": "LIVE videos like streaming sports games will be choppy. Pre-recorded videos like Youtube will be smooth. Performance may vary depending on WiFi signal strength.", "verified": true, "helpfulness": "1/1", "author": "BigDaddy5"}]