[{"rating": 5.0, "review": "Great Streamer, very fast. got it on cyber monday. Don't need it, but it's nice to have.", "verified": true, "helpfulness": "0/0", "author": "Lucifer666"}, {"rating": 5.0, "review": "This works better than expected.  Very easy to set up, very easy to use. I gave it 5 stars, but it could be even better if it had a headphone jack.", "verified": true, "helpfulness": "0/0", "author": "Allan H"}, {"rating": 3.0, "review": "No ability at present to root it. Small but growing (needs to grow much faster) movie and TV selection. Very small app selection. Everything else is good. If you have Prime and are presently entertained by the selection of prime on demand, go for it.", "verified": true, "helpfulness": "1/1", "author": "Mark Saluta"}, {"rating": 5.0, "review": "We're absolutely thrilled with our purchase of Fire TV...super user friendly, content automatically loaded to \"mirror\" our kindle fire hd, the operation of he remote is smooth...our favorite part we played with last night was listening to Amazon Music app (we were already prime members) as our family photo slide show played while we decorated our Christmas tree. How's that for a warm & fuzzy electronic!", "verified": true, "helpfulness": "1/1", "author": "Diana Falise"}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "brenda patterson"}, {"rating": 5.0, "review": "It works EXACTLY as advertized! Very user friendly, lots of choices in movies and TV, I don't do gaming, but it seems to have a lot of choices there also, I highly recommend it!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have a kindle, a kindle reader, and a amazon fire TV. I love them all. I only owned the fire for a few days but it is great, I already watched a few free prime movie and listen to my free prime Springsteen albums. It is very easy to use and I would recommend it to everybody.", "verified": true, "helpfulness": "1/1", "author": "James F. Ellison"}, {"rating": 5.0, "review": "Great Purchase. Glad I got it!", "verified": true, "helpfulness": "0/0", "author": "Terence Brownlee"}, {"rating": 5.0, "review": "I like the fire, the voice activation button works great, and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Robert P Ives"}, {"rating": 5.0, "review": "So far we love our Fire TV. We shall see, but able to watch all our favorite current shows with out commercials....PRICELESS", "verified": true, "helpfulness": "0/0", "author": "C&k"}]