[{"rating": 4.0, "review": "Great idea. The Chromecast itself is very nice, the only issue I have is with apps that support it. Their stability varies widely. Even the Netflix app acts up every once in a while and forgets it's casting. All in all its a great way to turn a TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "A. Ladwig"}, {"rating": 5.0, "review": "Best purchase for my TV loving family. We are able to stream everything with ease.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "Amazing device. I can stream personal videos directly to the TV easily.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Pinero"}, {"rating": 3.0, "review": "I really want to enjoy Chromecast, while it works it is aaawsome, i can play Youtube videos at the maximum resolution without the need to change resolution, you could make playlists while enjoying the device, netflix is gorgeous, theyre implementing playing locally stored photos, tons of stuff, right...Now the CONS and they are in UPPERCASE, it just crashes way too much. I have figure it out the higher the quality the more prone the device is going to restart (netflix, are you listening), it varies depending I dont know, but it could be as much as 10 seconds restarting, also, at least on Netflix, when the chromecast restarts it is difficult to restart the movie being watched again as the phone still thinks the video is been chromecasted. Sometimes you need to close and open the Netflix app again in order for it to work.Just a pain in the...I really like the chromecast, dont get me wrong, I still watch videos on it, but the feel get lost between crashes and restarts!Hope Google finds a way around it but with newer devices on the horizon I simply doubt it", "verified": true, "helpfulness": "0/0", "author": "Samuel Perez"}, {"rating": 5.0, "review": "Works Great and good price !!", "verified": true, "helpfulness": "0/0", "author": "Bruce V. Gray"}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "marisol Zarate"}, {"rating": 5.0, "review": "I love it. It solved my problem. I don't need to bend any more to watch my favorite programs through my laptop.", "verified": false, "helpfulness": "0/0", "author": "Santosh K Mandal"}, {"rating": 3.0, "review": "I bought one after being highly recommended by my friend, but I'm not sure if it's my phone or my internet, but it was a bit laggy when streaming to my TV and kept disconnecting, so in the end I just watched with my phone instead. Also, if your HDMI port doesn't provide enough power, you still have to plug in a USB wire which would hog up both a USB port as well as a HDMI port on your TV, and result in more wires. I have a pretty new Samsung Smart TV (purchased only last year), so I would expect that not many TVs would have enough power from their HDMI port, so it's not just this little dongle that you would plug in to your TV like I expected it to be. I have returned mine, I didn't feel like it was worth it to me as I already have a smart TV that I could use Netflix and Hulu plus on.", "verified": true, "helpfulness": "0/0", "author": "Zedster"}, {"rating": 4.0, "review": "I love the Chromecast!!! It makes watching Netflix on my tv so much easier!!!! Sometimes it curs in and out a little bit...probably due to the WiFi connection but other than that I love it!  I downloaded the app on my phone and can even use it as a remote. Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "ChristineRetundi \"Christine\""}, {"rating": 1.0, "review": "Google doesn't support Web-based authentication. My ebook reader can handle it, but apparently that's too sophisticated for google. When connecting to our network you have to enter a login and a password on a website. Chromecast can handle that and so won't work at all. Glad we just threw away some money!", "verified": true, "helpfulness": "0/0", "author": "tim schmitt"}]