[{"rating": 5.0, "review": "The Chromecast works really well. A good value for the money compared to other devices. Wish they were available in Canada.", "verified": true, "helpfulness": "0/1", "author": "Rush fan"}, {"rating": 5.0, "review": "It was very easy to install and set up. The streaming gives you a very clear picture. I highly recommend this.", "verified": true, "helpfulness": "0/1", "author": "NANCY E BAILEY"}, {"rating": 5.0, "review": "Item does what it is suppose too..easy setup and is what is suspected to do…iI would recommend this to anyone looking to stream movies from netflix", "verified": true, "helpfulness": "0/0", "author": "eddie"}, {"rating": 5.0, "review": "Works like a charm and a breeze to install ~~  Took me a few minutes to figure out how to stream sites other than Netflix or YouTube, but it works just fine on any movie or documentary that I go to watch.", "verified": true, "helpfulness": "0/1", "author": "DGPat"}, {"rating": 4.0, "review": "Great product and easy to use.  Bought it for two of my kids who had been streaming video on their ipads or phones and now can stream on their TV's.  So easy to use I am going to buy one for myself.", "verified": true, "helpfulness": "0/1", "author": "Andrew Cahill"}, {"rating": 4.0, "review": "I really don't blame the device itself for the shortcomings of the chromecast. I had hoped it would basically turn my television into a wireless monitor. It doesn't really do that.It does a great job displaying Netflix or Youtube videos which is what is in fact made to do and \"as described\". The technology was just a little different than I expected. I had hoped to be able to put in a DVD or even use my flatscreen television as a giant monitor.I had made the assumption that it was some kind of wireless HDMI device, which it is..just not to the extent that I had hoped for I guess.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Waters"}, {"rating": 5.0, "review": "Changed my way of looking at TV. Liked it so much, I bought one for each of my two sons.", "verified": true, "helpfulness": "0/1", "author": "george c culbreth"}, {"rating": 5.0, "review": "this is a great compact unit that picks up your youtube programming in 1080 when available. I even found out..that if your tv is off it will turn it on to play your selected program. ..super easy to use.", "verified": true, "helpfulness": "0/1", "author": "Maurice S."}, {"rating": 4.0, "review": "It's good at what it do I love it  I get to watch all my shows without wires from devices", "verified": true, "helpfulness": "0/1", "author": "talvin best"}, {"rating": 5.0, "review": "A great addition to any household where there are both computers and hd televisions.  Easy setup.  Just plug it in to the televisions hdmi port, plug in the power adapter, and turn on the tv.  Change the tv's video source to the hdmi port, and you should see the google chrome-cast booting up.Go to your computer (need wireless), and find a wireless network with the same name as the device shown on the television.  Follow the instructions for setting up the wireless network adapter to match you wireless settings.  That's it.Use a chrome browser, and you can use you big screen tv as a presentation monitor, watch Netflix movies, etc.", "verified": true, "helpfulness": "1/2", "author": "c-i-e-i-o"}]