[{"rating": 5.0, "review": "Great item.  Makes streaming to my TV very easy.", "verified": true, "helpfulness": "0/0", "author": "Squirrel Productions"}, {"rating": 5.0, "review": "Very good product works perfectly.", "verified": true, "helpfulness": "0/0", "author": "prasanth"}, {"rating": 5.0, "review": "great prodoct", "verified": true, "helpfulness": "0/0", "author": "Animesh"}, {"rating": 1.0, "review": "Hate google everything! Don't waist your moNey, threw away?", "verified": true, "helpfulness": "0/0", "author": "Michael Jenkins"}, {"rating": 5.0, "review": "really cool for streaming movies and tv shows", "verified": true, "helpfulness": "0/0", "author": "RONALD A. CASH"}, {"rating": 1.0, "review": "not working", "verified": true, "helpfulness": "0/0", "author": "samer"}, {"rating": 4.0, "review": "It's a chromecast. If you're looking at getting one, there's no shortage of information about what it can do. Just get it if you want, it's cheap.", "verified": true, "helpfulness": "0/0", "author": "Chorca"}, {"rating": 5.0, "review": "I have owned one for 1 year and very happy.my daughter bought a new 55\" smart tv but it didnt have very many apps.so I bought her this because she not only can use netflix but also hbogo, showtime, espn3 to name a few. Also can mirror her samsung 5 on tv for xfinity.etc. very good value for a thid of price of roku3.", "verified": true, "helpfulness": "0/0", "author": "BW"}, {"rating": 4.0, "review": "I like my Chromecast quite a bit and we get a lot of use out of it. It's annoying to me that it doesn't work with Amazon streamed videos, though, and that's probably a very important point for Amazon shoppers. I still have to use an HDMI cable to watch movies I purchase from Amazon on my TV, but this is nice for a wireless experience when I'm watching Netflix or YouTube, or if I just want to see something I'm doing on my laptop on a large screen.", "verified": true, "helpfulness": "0/0", "author": "Amy Druckenmiller"}, {"rating": 4.0, "review": "Excellent!! I am yet to explore so many tricks", "verified": true, "helpfulness": "0/1", "author": "Kalakad Sundaram"}]