[{"rating": 4.0, "review": "This makes watching Prime content a lot faster and easier to navigate.  There are lots of Prime options for TV series and a limited selection of movies (mostly older ones).  The voice control feature works surprisingly well.  We use this several times a week and are pleased with the purchase.  It definitely beats hooking up the computer to the TV with an HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Melanie Corcoran"}, {"rating": 3.0, "review": "Netflix works great but Amazon Prime movies are constantly reloading!", "verified": true, "helpfulness": "0/1", "author": "Judy DeLaney"}, {"rating": 5.0, "review": "Everything out of the box was brand new. i would recommend any customer to purchase this and save a few bucks. the only thing it did not have was the fancy cover on the outside of the outside box. which you dont eve need unless you want to resell it in the short term.", "verified": true, "helpfulness": "0/0", "author": "Saro Keciyolu"}, {"rating": 4.0, "review": "We really like it, we we had better controls over free vs paid content.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Out of box, worked for 3 days and then on light stopped showing on, and unit would not turn on.  Requested replacement, it was promptly sent and this unit on light would turn off after 5 seconds, and didn't work either.  The 3 days of use were impressive and I was actually sad to have to give up on the platform because of non functioning units (2 in a row?)", "verified": true, "helpfulness": "3/3", "author": "Joe Poole"}, {"rating": 4.0, "review": "I chose this over the Roku because of the optical output. We watch movies and want the 5.1 dolby sound and the roku delivers it through the hdmi. My older receiver works very well but does not support hdmi and needs optical sound input. The sound is excellent and the device works fast and it has all of the applications I use. My grandson uses the game controller and he says its good but can use more applications. The voice recognition works well with Amazon applications but does me no good in NETFLIX but that is not a big deal. The main issue I have with it is that the remote control should have some illumination.", "verified": true, "helpfulness": "0/0", "author": "Paul A. Castagna"}, {"rating": 5.0, "review": "I have had Fire TV for about a month now and I just love it. We purchased it to be able to stream sling tv and amazon prime and it works great. The voice search feature is wonderful. I have the remote control app on my phone and it works great.", "verified": true, "helpfulness": "0/0", "author": "T. Frey"}, {"rating": 5.0, "review": "Love the ease of use of this product. We replaced both of our robust with this (which were working perfectly fine). This is so much faster and easier to search on.", "verified": true, "helpfulness": "0/0", "author": "Robin Gilbert-O'Neil"}, {"rating": 3.0, "review": "I would rank higher if the remote had lighted buttons.  Very difficult to use workout light.", "verified": true, "helpfulness": "0/0", "author": "James M. Orrell"}, {"rating": 5.0, "review": "Works great, gives me lots more viewing options and a good supplement to my cable package!", "verified": true, "helpfulness": "0/0", "author": "Kathy B."}]