[{"rating": 1.0, "review": "I' m hoping I can return it for refund.", "verified": true, "helpfulness": "1/12", "author": "JOEL S."}, {"rating": 5.0, "review": "Great speed in the interface that kicks butt on Apple TV", "verified": true, "helpfulness": "0/0", "author": "Dave Anger"}, {"rating": 5.0, "review": "Excelente producto !!!!", "verified": true, "helpfulness": "1/2", "author": "Alex Agudelo Jimenez"}, {"rating": 3.0, "review": "Works fine but burns through batteries for the remote. I've had to change them twice in two weeks.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "UPS man delivered the goods just in time!  As the family was sitting to open gifts, what to my wondering eyes should appear..but a UPS truck with my pre wrapped gift in hand.  It literally went from the driver to my Grandson within a about a minute.  All I did was pop open the box and hNd him the gift already wrapped just in time!  Product yet to be installed..buy delivery was perfect.  ups should repInt their truck to look like Santa's  sleigh!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazing device with great programs.  Best present ever.", "verified": true, "helpfulness": "0/0", "author": "John Carroll"}, {"rating": 1.0, "review": "I purchased this for my wife and I thought it would be a snap. The unit is not recognized by my TV (2 year old Samsung LCD). I called tech support and they told my that my TV is not compatible with the Fire TV. I purchased a refurbished unit for $79 and now I have to buy a $1,000 TV to use it. I am not happy.Amazon should have something that helps customers know if their TV will work with Fire TV but they don't.If you can find the page that shows what TV's it will work with please check BEFORE you order.", "verified": false, "helpfulness": "4/7", "author": "Scully"}, {"rating": 4.0, "review": "The remote control is very responsive. The variety of apps is outstanding. There is not any way to turn the Amazon Fire TV off that we could find. It works just as you would expect, but it would be nice if you could skip the intro tutorial as it's a very straight-forward device to use and doesn't have any features (that we have found so far) that you couldn't figure out on your own.", "verified": true, "helpfulness": "0/0", "author": "Thomas Styron"}, {"rating": 5.0, "review": "Love it!  I am a little technically challenged when it comes to electronic things and I was afraid I might have to ask someone to help me hook it up but this was as easy as they advertise. I am super happy that I have it and I am streaming all my Amazon Prime stuff but Netflix and Hulu as well, it could not be easier.", "verified": true, "helpfulness": "0/0", "author": "JB"}, {"rating": 5.0, "review": "After doing some research, I decided to purchase an Amazon Fire TV to replace our Blu-ray player as our streaming video player for our Amazon, Netflix and HBO accounts since it would no longer maintain internet connectivity and the it was deathly slow to begin with.Setting up the Fire TV could not be any easier, simply plug in the HDMI cable, connect power, either program your WiFi access or connect an ethernet cable and then turn it on.If you have a Prime account, the unit already comes preprogrammed for you, all you have to do after the initial new user video and search for updated firmware is to install any apps that you want to use with the FTV, you can even back out to select others while they are downloading.After setting up our FTV, we tried it out to compare against our other streaming units (1st gen Roku, Blu-ray players & Hopper) since one of our biggest problems has been with buffering while watching our programs unless we allow adequate time for them to be fully downloaded to the device (only Hopper).We selected a show to watch immediately both from Amazon's library and from Netflix, in both cases we had absolutely zero buffering!!Combine that with the highly responsive controls (no lag time or waiting for the device to catch up) and the relatively easy to navigate menus, we have found the a streaming video player that we absolutely love!The only legitimate complaint that I have about using the FTV (which was voiced by other users) is Amazon's choice to not clearly label what programs are free for Prime subscribers (come on Amazon, how hard is it to program the software to identify and tell us what is free?).For those of you who complain about the lack of an HDMI cable, get over it since very few if any products ever come with one (or at least one you actually want to use or is the right length). Amazon offers their own house brand of cables which I have found to be excellent, offer a wide range of lengths and are priced very well for their quality. In my case, this allowed me to order a 3' cable rather than having to deal with a 5' or 6' cable and was only $5 (figure it was a fair trade since my FTV was only $79).We are normally an all Apple household, but being that the Apple TV is far more limited in third party apps that it supports compared to competing products as well as having less memory and processing power, the Fire TV earned our choice to be our streaming video player.As soon as the Fire TV Stick becomes available, will consider purchasing one for our bedroom TV since it has an unused USB port that the power cable can be connected to eliminating the need for a larger power strip.Now if Amazon would package both Fire TV units with a prepaid Prime membership card (priced at say $150 & $89 respectively), this would make an excellent gift for friends and family.", "verified": true, "helpfulness": "1/2", "author": "MR 300 BLK"}]