[{"rating": 4.0, "review": "My first of this type. Was stuck between this and the Fire stick. Thevappscthat are available are very cool. Especially like streaming YouTube to  a 60\". Still may get the Fire stick too. Hopefully more apps will become available soon.", "verified": true, "helpfulness": "0/0", "author": "Pete D."}, {"rating": 5.0, "review": "Better than Apple", "verified": true, "helpfulness": "0/0", "author": "Daniela Trujillo"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Robert H. Wilcox"}, {"rating": 3.0, "review": "Roku is better.  Roku 3 Streaming Media Player (2014 model) allows you to watch a ton of channels with no dropped connections. Worth the extra money. The chromecast worked fine sometimes but got pretty annoying while binge watching shows. Also it gets really hot to the touch quickly", "verified": true, "helpfulness": "0/0", "author": "BrownSugar"}, {"rating": 1.0, "review": "This thing never connects. My phone or tablet can't pick it up to cast Netflix, Hulu etc on to it. It lags like crazy. I bought a wifi extender thinking that my internet connection was the problem, but it still sucks.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Leonardo Xavier Barreto Andrade"}, {"rating": 5.0, "review": "I am an apple advocate and have been so frustrated lately because I cannot stream my movies to my Apple TVs for some strange reason. I bought one of these out of desperation and now has become my dependable streaming movie player. I use it in combination with plex and it is an enjoyable experience. I wish Steve Jobs was still here because quality control has gone down the tubes at Apple.", "verified": true, "helpfulness": "0/0", "author": "Troy Cherry"}, {"rating": 5.0, "review": "I was considering the apple tv because I have multiple apple devises but then I saw this and I went to go buy it having only read the description and decided to try it. I hooked it up and it was easy to set up. it looks great and is easy to control and I saved $65 compared to the apple tv. this is great!", "verified": false, "helpfulness": "0/0", "author": "Condo"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "miles pickens"}, {"rating": 5.0, "review": "OMG!!!! excelent", "verified": true, "helpfulness": "0/0", "author": "BCVV"}]