[{"rating": 5.0, "review": "Using this device connected to the hdmi port on your tv will allow you to stream services like Netflix, Hulu+, amd YouTube. The best part is that you control it via your Android phone or tablet. I found it easy to use and set up. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Apaini"}, {"rating": 4.0, "review": "Like what it does with Netflix and U tube.  Would be a lot better if you could view everything that you put on Google Plus into a single APP.  Can't view pictures from Google files.", "verified": true, "helpfulness": "0/0", "author": "Driveshaft"}, {"rating": 5.0, "review": "Works perfectly! Looking forward to seeing the potential that's unlocked with this device. It's replaced my Roku's in the living room and bedroom!!", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 1.0, "review": "They do not work with our wireless router. Will be returning all three. Bought as Christmas gifts. Will stick with apple products", "verified": true, "helpfulness": "1/2", "author": "Amy Murphy"}, {"rating": 5.0, "review": "Great lil gadget I use it everyday I m very impressed with the quality and the low price Thank you", "verified": true, "helpfulness": "0/0", "author": "David Alan Mooney"}, {"rating": 5.0, "review": "With more apps joining through compatibility this device can be even better. The price is really great. Keep doing the good things Google!", "verified": true, "helpfulness": "0/0", "author": "Sam Job"}, {"rating": 4.0, "review": "It is surprisingly nice to be able to watch my youtube channels on the big screen. It sort of turns your tablet or phone into a universal control. The app selections are limited though. Originally I was under the impression that you could watch anything on your tablet or phone on the big screen, but sadly, it only works with certain apps. But if you hang out on Youtube and TED a lot then you will get plenty of enjoyment.", "verified": true, "helpfulness": "0/0", "author": "Robert L Berry"}, {"rating": 1.0, "review": "I have not been able to take device into use, dispite several trials. Recently I got sw updates done, but got stuck again. I cannot say anything on the active device use.", "verified": true, "helpfulness": "0/1", "author": "Jones"}, {"rating": 5.0, "review": "I bought this for a friend who thought Netflix was only available for her computer. We hooked it up to her 60 Inch HDTV, linked it up and off she went watching Netflix and YouTube.  Set up was extremely easy and now they are using the ChromeCast more than cable.", "verified": true, "helpfulness": "0/0", "author": "Donald L. Moore Jr. \"DubbaDon\""}, {"rating": 3.0, "review": "I bought it thinking I could stream my files from a windows home server 2011.  Even with the latest updates it still won't, unless I download and pay for another piece of software and then convert all my files to a format that works with it.  Until Google releases a SDK this is useless for me.", "verified": true, "helpfulness": "0/0", "author": "Jeffry Lattymer"}]