[{"rating": 4.0, "review": "Works pretty well.  I haven't figured out how to view content via the chrome browser yet, but I plan to give it a try soon.  Netflix works very easily.", "verified": true, "helpfulness": "0/0", "author": "The MBA \"MBA Girl\""}, {"rating": 5.0, "review": "I don't know what to say but this is the best streaming device so far. I wish they make it to stream more than Youtube and Netflix though. But for the price, you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "joy"}, {"rating": 1.0, "review": "Honestly a waste of any money only 4 apps and that,s all you can cast from and not very child friendly with my daughters kindle and cant play you own videos that on network or pads the 4 apps come standard on most newer tv's or on cheap bluray players which would give you more functions i still recommend Roku or dare i say it Apple TV in fact most other blow it out of the water PS Amazon please make your own that works with your Kindles Parents and children would both love you lol", "verified": true, "helpfulness": "1/4", "author": "Antonio P."}, {"rating": 1.0, "review": "Needs to be rethought... Works better on my iPhone 5s than Nexus 10?!?  Come on.  Give me screen mirroring, please!!! Runs crazy hot... they warn you, but it was still a but of a surprise just how hot.  It is SO hot they put a warning in the box to power it off before grabbing it to unplug.  How does a USB power 5v even have enough  power to gen that much heat.  I like the small size and the thoughtful addition of a HDMI extension cable...", "verified": true, "helpfulness": "3/5", "author": "J. jenkins"}, {"rating": 4.0, "review": "used this to turn my 27\" monitor into a netflix-in-the-bedroom machine! works awesome with my droid razr maxx and a nexus 7 tablet. easy to set up and use.my only gripe is that you cannot push photos to it. maybe you can make a slideshow and push something to it? like if you rendered it into an mp4 or something? not sure. havent tried it.needs to be integrated with amazon prime. oh wait, amazon needs to make a video player for android!", "verified": true, "helpfulness": "0/0", "author": "cc"}, {"rating": 3.0, "review": "while it works great for youtube, very other applications accept it. It claims to work with Hulu but requires Hulu+ to work, if that's the case, the most TVs with apps can download Hulu+ directly.It also doesn't work well with casting browser and/or full screen.", "verified": true, "helpfulness": "0/0", "author": "Meng Jiang"}, {"rating": 5.0, "review": "The quality of the picture and video loading speed is great!It is very easy to control from my iphone or ipad.Now I can watch more youtube videos from my big screen TV.Recommend it!", "verified": true, "helpfulness": "0/0", "author": "Jacob Lo"}, {"rating": 5.0, "review": "Love it and so easy to set up and use. You just take it out of the box, plug it in and then use Chrome to search and cast to your TV!! so simple and I am not a techy.", "verified": true, "helpfulness": "0/0", "author": "J. Huang"}, {"rating": 5.0, "review": "I've bought 2 and whenever someone sees mine I get them hooked as well. Now, good luck canceling Comcast, they'll threaten you and attack you viciously.", "verified": true, "helpfulness": "0/0", "author": "ThreeEightFour"}, {"rating": 1.0, "review": "Ordered it. Arrived quickly. Have spent hours trying to get it to work. It should be plug and play. Everything else in my network is plug and play, just might have to add a password. I can't get the Chromecast to work. Waste of $35.  Update: My co-worker tried it on his network and it worked fine. So, I sold it to him.  I still like Google for searching, but doubt I will buy any more of their products.", "verified": true, "helpfulness": "1/5", "author": "David J. Allen"}]