[{"rating": 5.0, "review": "We purchased this through a big box store, purely because we had a gift card to said store, so I cannot comment on shipping. However, this is an awesome little box! We also have a Roku 3, and we like the Fire TV much better. The box is so tiny, you barely notice it! I love the voice searching, it is so much better than having to click through all the letters to spell out what you are searching for and it is surprisingly accurate! The only drawback is that the voice search only seems to work with the Amazon content. This is not an issue for us since we are Prime members and mainly use the Amazon content. We also use Netflix and the interface with the Fire TV is very easy to use and navigate, I plan on using Hulu, but cannot comment on that yet.We purchased the Roku 3 about a year ago with the intention to ditch our satellite provider after the contract is up in about a year, to save money each month. We were impressed with the Roku and knew it would work for our needs, so when we saw that the Fire TV had come out, we knew we had to try it. We will be equipping our remaining TVs with the Fire in the future.I will say this, Fire TV is great if you are already familiar with Amazon and their content. It is even better if you are a Prime member. That membership is worth every darn penny. This box will make the transition from satellite to on demand much easier.", "verified": true, "helpfulness": "2/3", "author": "DM"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "dina corrales"}, {"rating": 5.0, "review": "I haven't used it much so far but expect to when I get the HDMI Switch with Pigtail Cable that I should have bought with the Amazon Fire.", "verified": true, "helpfulness": "0/1", "author": "Barbara Z"}, {"rating": 5.0, "review": "Love it.  Able to get all my movies on Amazon and Netflix, plus other channels. Easy to install.", "verified": true, "helpfulness": "1/2", "author": "Carole H. Elmore \"waterboy\""}, {"rating": 5.0, "review": "I gave this Fire TV to my husband for his birthday on July 13;  within two days, I mentioned that I might like to watch a few things on it.  He got very quiet, and just barely whispered, \"Maybe you need to order one of your own.\"I also gave this to my cousin as a Birthday/Welcome Home/Retirement gift;  I got a text from her two nights ago that simply said, \"Best. Gift. Ever.\"That's all you need to know, besides it is easy to install and easy to use.", "verified": true, "helpfulness": "0/1", "author": "lweaton"}, {"rating": 5.0, "review": "Easy to use....fast on my home wireless network.... many things to choose from", "verified": true, "helpfulness": "0/1", "author": "Melvin Hernandez"}, {"rating": 5.0, "review": "Simply wonderful and a delight to use.  Very quick response when remote keys are pressed (what DirecTv and Verizon FIOS response SHOULD be- but isn't)Fire TC opened up a whole new world to me.", "verified": true, "helpfulness": "0/0", "author": "Chester"}, {"rating": 5.0, "review": "this is a series of questions from a tech-challenged person who is SICK of DirecTV.  First, I live in the country and without DSL, have to use AT&T; wireless for internet connection.  I bought a ROKU unit and a router and then was told ATT wireless would stream slowly and could run up my wireless charges.  Such as taking two hours to stream a movie on ROKU.  Is Amazon Fire TV just another similar adventure as with the ROKU?  Am I stuck with DirecTV and all their mindless commercials?", "verified": false, "helpfulness": "0/2", "author": "el guapo"}, {"rating": 5.0, "review": "Love love love the Fire TV!! Disclaimer, this is the only set-top-box I have ever owned and used extensively. That being said, I have had a great experience with mine.Pros:1. Lightning fast!! I know that's one of the big selling points for Amazon, but they aren't lying. It starts up in seconds. Also, it never really shuts down, only sleeps, so it loads up when you want to watch it instantly.2. I have never had a problem with incessant buffering. I have ours hardwired to the modem, but I also had our \"smart\" TV hardwired and the buffering.... oh the buffering!! It was awful! Not a problem with the Fire TV.3. The voice search has been flawless for me. Unfortunately it only works with Amazon content and can't search Hulu, Netflix, etc. with your voice. Minor inconvenience for me, could be a sticking point for others.4. The box is very small and discreet. It doesn't stick out at all on an entertainment center.ConsNot surprisingly, Amazon put out the Fire TV to get you to buy more things on Amazon. If this surprises you, then I want you to read The Wealth of Nations by Adam Smith, you can buy it on Amazon (http://www.amazon.com/The-Wealth-Nations-Adam-Smith/dp/1604598913). So Naturally, it's going to function best with amazon streaming and games. That being said, the non-Amazon apps also function very well. It's my hope that Amazon will continue to do what's best for their customers and not limit non-Amazon functionality.", "verified": true, "helpfulness": "0/1", "author": "A. Haarstad"}, {"rating": 5.0, "review": "Love it, easy to connect and use.", "verified": true, "helpfulness": "0/1", "author": "clayou"}]