[{"rating": 5.0, "review": "Nice little device to have. It is very user friendly, and for those of us without the smart TV's, it is the next best way to stream videos to our TV sets.", "verified": true, "helpfulness": "0/0", "author": "akinfolami"}, {"rating": 2.0, "review": "Won't work with Kindle Fire HDX 8.9.  Literature was not clear on that point.  It Might work with lap top", "verified": true, "helpfulness": "1/2", "author": "Gary  Smith"}, {"rating": 5.0, "review": "This little electronic gem was super easy to plug in and figure out. Before I knew it, I was streaming HBO Go and watching my favorite shows on the television. I love the Pandora stream, where I can play the music that suits me through my TV, as well as You Tube videos and Netflix films. And Game of Thrones looks so much better on a big screen versus my iPad. Such a nifty little gadget.", "verified": true, "helpfulness": "0/0", "author": "Stephanie S. Woods"}, {"rating": 5.0, "review": "This product was very easy to set up and connect to my wifi and tv.  I didn't realize it was so easy.  I thought I needed a smart tv.  If you have the new flat screen and it is not a smart tv, buy this product and you will not go wrong.", "verified": true, "helpfulness": "0/0", "author": "YG"}, {"rating": 5.0, "review": "Chrome Cast is great.  Its simple and easy to use easy to install.  and for the price its a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Brad Rhow"}, {"rating": 3.0, "review": "The Chromecast had my husband and I very interested from the get-go since whenever we have people over, we seem to be hooking up one of our laptops via HDMI cable, to our TV.This made it easier to show people things online or stream music videos while working out. However, it's just a USB port and sometimes very slow. I know that's dependent on internet connection, but our connection is really fast and we still noticed some problems with freezing, intermittent connectivity, etc. It's a cool concept and only $35, but it's not the most revolutionary invention.", "verified": true, "helpfulness": "2/2", "author": "Aparna B."}, {"rating": 5.0, "review": "I've been using this a lot.You know, I wanted to buy a smart TV earlier this year and found out that first of all, I have got a PS3 and PS4 which make my LED TV a smart TV,Then I decided to buy this USB-looking chromecast and let me tell you I use it a lot. We watch lots of videos from YOUTUBE. You can also watch movies and show on NETFLIX, but most important, you can watch many other sources of video using your GOOGLE CHROME BROWSER. Believe me you are going to love it,.", "verified": true, "helpfulness": "0/0", "author": "Carlos Castano"}, {"rating": 4.0, "review": "It works. I am thinking of cancelling Time Warner. I don't need to write anymore it works and that's it.", "verified": true, "helpfulness": "0/0", "author": "DEMAREE D DEWEESE  SR"}, {"rating": 5.0, "review": "best $35 you can ever spend.  Google is taking over world and $35 will help that.  I also use Google Drive and they just lowered my cost per month so it all works out perfectly!", "verified": true, "helpfulness": "0/0", "author": "steven gross"}, {"rating": 5.0, "review": "Amazing! Easy to use and set up and works with a ton of different apps. It's everything I needed it to be. A must have for anyone who loves netflix  or Hulu or hbogo or any streaming service really but cannot get them on their tv.", "verified": true, "helpfulness": "0/0", "author": "Alexander J Senetcky"}]