[{"rating": 5.0, "review": "Put it in your TV, download an app or a driver on your computer, play stuff on your TV.Honestly as easy as that for 30 dollars.I had a Roku this is WAY less of a headache and works way better because it can be controlled via phone, ipad, computer, etc...", "verified": true, "helpfulness": "1/2", "author": "Jonathan Reinfeld"}, {"rating": 5.0, "review": "You will not go wrong buying this product. Easy to use. You can find almost anything with this. We watched an episode of Lost In Space season 1. Great memories.", "verified": true, "helpfulness": "0/0", "author": "ZZT"}, {"rating": 4.0, "review": "I got my Chromecast a few days ago and have been using it a lot. I love that I can control the content easily with my phone, and don't need a separate remote like a Roku.I want to give this 5 stars, I really do, but there are a few things missing, some of which are at least rumored to be in the works. I'm waiting for a full integration with Plex (should be coming the next next couple of months), and an SDK to allow streaming any content. I wish the cast extension was supported on linux, but hopefully that will come in time. Other than that, my only concern is that it doesn't allow any sort of security. This is probably by design, but I usually wouldn't want everyone on my wifi network to be able to control my Chromecast. Fortunately, it lets you know if somebody else is casting to a device, so it's hard to accidentally override somebody else.In short, if you don't use Linux, aren't a developer, and don't plan to use Plex on it (for the next month or two), treat my review as a definite buy!", "verified": true, "helpfulness": "0/0", "author": "Abhishek Shroff"}, {"rating": 3.0, "review": "I got this mainly to Tab cast, I have a smart tv and blu-ray. My pentium 4 quad core won't cut it. You need at least an iCore 5 for any quality. My desktop iCore 7 with 32mb works well but it is in another location so is not much value. On the plus side all the apps I have tried work great. If the networks ie CBS ABC NBC make apps for this it will be great.", "verified": true, "helpfulness": "0/0", "author": "Terry Ellis"}, {"rating": 1.0, "review": "if i had read that this basically tries to turn your regular tv into a smart tv with just a few of the functions i would not have wasted my time and money.  want to watch youtube or netflix on your tv?  fine works ok with my nexus.  but thats about it.  cannot use it in a hotel like i had hoped because by itself you cannot connect the chromecast to the hotel's wifi.  the advertising on this item is very deceptive and I think attorneys general need to look into the deceptive google advertising.  so glad it was only $35 because if it was more i'd be raising holy h*ll.", "verified": true, "helpfulness": "2/3", "author": "T. Brooks"}, {"rating": 5.0, "review": "Use it , with my iPhone 4s. To stream movies form netflix to my flat screen TV. Works great, love it.", "verified": true, "helpfulness": "0/1", "author": "HEAVY DUTY !!!"}, {"rating": 5.0, "review": "Simple and easy to use. I can control the tv from my phone or ipad.Just plug in, download the app and play.", "verified": true, "helpfulness": "0/0", "author": "Stephen O'Neil"}, {"rating": 1.0, "review": "I was really excited when I ordered this.  It turns out that the only thing I can stream to it are purchased music through Google Music app.  You cant stream images or home videos from your device.  Once I cancelled my Google All Access music subscription then I wasnt able to stream anything at all.  It gave an error saying it cant stream side-loaded music, only music purchased through them.  So now it just sits behind the TV never to be used again.  I guess it can stream Youtube and Netflix but the quality wasnt very good for me. The best way I found to get any media from your phone to the TV is to get a Roku and an app called Allcast.", "verified": true, "helpfulness": "6/7", "author": "Kll9000"}, {"rating": 5.0, "review": "Does what it claims, wonderfully well. Has potential for so much more! :) Hoping to see easy media casting included in future versions.", "verified": false, "helpfulness": "0/1", "author": "Jason Bourne \"Cain is for Charlie. Delta is for Cain.\""}, {"rating": 5.0, "review": "This device turns our normal older TV into a internet connected machine.  We have been watching all our favorite shows on the internet using this device.", "verified": true, "helpfulness": "0/1", "author": "Teresa Sun"}]