[{"rating": 5.0, "review": "family loves it", "verified": true, "helpfulness": "0/0", "author": "peter v bevilacqua"}, {"rating": 5.0, "review": "Absolutely LOVE my fire tv. Having a toddler at home it is so convenient to be able to play shows he's interested in. Huge props to Amazon prime as well for offering instant videos with memberships!!", "verified": true, "helpfulness": "0/0", "author": "Monica"}, {"rating": 2.0, "review": "I had much higher expectations. Disappointed in the limited selection of movies and TV series that are included. I definitely could have done without.", "verified": true, "helpfulness": "0/1", "author": "AKHBR2307"}, {"rating": 5.0, "review": "Amazon fire TV does exactly what I need it to, I got it for $69 not sure what Amazon was trying to tell me but I own 3, great device.", "verified": true, "helpfulness": "0/0", "author": "Julius Langford"}, {"rating": 5.0, "review": "LOVE IT.", "verified": true, "helpfulness": "0/0", "author": "George B."}, {"rating": 5.0, "review": "I love ya, Amazon! You have released to the public a box that beats my expectations! All you consumers out there, you have to buy this if you want the best TV experience since having the best TV experience. You beat my record for best TV box in the country, right above Apple TV and Chromecast! Everyone out there! Buy this! It will be worth every millipenny!-CyberAmp(CyBeR)Feedback Provider since...2015 :3+ Horrible Comedian (Proof: What your reading in these parentheses is a joke) Funny ain't I?", "verified": false, "helpfulness": "0/0", "author": "CyberAmp(CyBeR)"}, {"rating": 5.0, "review": "Purchased a gift for my father in law. He absolutely loves this product. Thinking about cutting the cable cord and getting one for us too!", "verified": true, "helpfulness": "0/0", "author": "Rebecca A Durham"}, {"rating": 5.0, "review": "If you have any other TV stick or whatever else forget it. This is the way to go. I have two of the other ones but Amazon TV really surprised me. I love the voice command. Works like charm :)", "verified": true, "helpfulness": "0/0", "author": "Marcos"}, {"rating": 5.0, "review": "This is a well built, well thought out piece of hardware. The device is very versatile and expandable, of course, it is much better with a prime membership, meaning, anybody that already has a prime membership should seriously consider this over the competition. (eg: roku player, appleTV) as it stands you can do a whole lot with this little box within the confines of a non-technical avarage joe user experience. but, it really shines once you delve into what you can do with this device when you master it's \"secrets\". If you do a little research and don't mind tinkering, the real power of this device reveals itself. like Apple products,  Amazon Fire TV presents itself as a device that is within a walled garden, Unlike Apple The walled garden has an unlocked gate if your willing to tinker,  that alone makes it heads above any of its competition.", "verified": true, "helpfulness": "0/0", "author": "Lance Dibitetto"}, {"rating": 5.0, "review": "The picture was better than expected. I am very glad with ease of set up. Great promotion too .I would not have purchased at full price.", "verified": true, "helpfulness": "0/0", "author": "Pa,m"}]