[{"rating": 5.0, "review": "I have 2 of these. They work very well. I have Amazon Prime, Netflix send Hulu. This is a must have for me. Customer service has been excellent. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Linda Dausel \"Spendy Girl\""}, {"rating": 5.0, "review": "Can't wait till the stick is out.  Already too many wires coming from the back of the TV.", "verified": true, "helpfulness": "0/0", "author": "clark foster johnson"}, {"rating": 5.0, "review": "So far I love it easy to use and navigate!", "verified": true, "helpfulness": "0/0", "author": "Lisa M"}, {"rating": 3.0, "review": "A whole lot of old carp, then they want you to rent!!!! Grrrrrr aggravated.", "verified": true, "helpfulness": "0/3", "author": "Brandie \"love to travel, have an audible book in my hands!!!\""}, {"rating": 3.0, "review": "I received my Fire TV today - yup on a Sunday.  Thumbs up for that.  Packaging was cool & the unit itself has a sleek clean design. Set up was easy enough, just plug in power & connect hdmi cord to device & t.v.  Unfortunately, when it came time for the unit to do its job things did not go as smoothly. For some reason when the unit first fired up it loaded the searching for updates screen but jumped ahead to the instructional video - which Amazon requires you to watch. You can't bypass or fast forward through the instructional video. Came to the parental control password section & the device froze for 5 minutes. Maybe because the device didn't load the software updates?  I unplugged & tried again. Device loaded & began searching for updates. After several minutes device indicated it was unable to perform the updates & directed me to unplug the device wait a few moments replug & start over. I did this & the device successfully connected. After 10 minutes of downloading updates device switched back to searching for updates screen & I had to wait several more minutes. Finally the device loaded but then made me sit through the darn instructional video for a second time. Grrr...I bypassed the parental control section the second time fearing the device would hang-up again. (Will have to figure out how to install a password later because I don't want my child buying the expensive apps without permission.) Tried using the voice control feature with varying results. We searched for Minecraft and the system returned both video & apps results but defaulted to the video results. Despite trying several times we were unable to make the cursor display the app results & had to hit the home button & start over. We used voice search again to find Minecraft but this time the system indicated no results found. Several times. What?  So we tried a typed search for Minecraft. Again system was unable to find it. We tried multiple times with no luck. Incredibly frustrating.  I hit the home button & waited a few minutes before trying to search again using the voice control. This time the system returned both video & apps results but again defaulted to the video results & still would not allow us to access the apps results. So we did a voice search for Minecraft App & finally, finally only the Minecraft App result was returned & we were able to click the app - $6.99! Summary: What should have been a 10 minute or less install took more than an hour. Both voice & typed search functions seem to have issues. The typed search features a single string of letters which is not at all user friendly. It is awkward enough to search with a remote. Having to scroll through a single line of the alphabet makes this even more difficult..  Amazon does not provide a phone number or even an email address for help. Just a link to their website with preset answers to some common questions, none of which provided any help with my issues. I was expecting better. The device is currently streaming content just fine. But I have not decided yet if I am going to return it.", "verified": true, "helpfulness": "1/1", "author": "parismarathon"}, {"rating": 5.0, "review": "I love this here streaming! I've been watching movies I didn't even know existed & they start very quickly so there's no waiting time. This is gonna be great especially since my regular programming on Reg. TV seasons are ending. I love the simplicity of picking movies. And the High-Definition is great. I didn't know when I signed up for Amazon Prime that I would need the Amazon Fire TV. I highly reccomend this product especially if you're like me & like speed and no complications. Really simple to set-up. I'v got about 100 movies on my watch list now. 5 stars definitely from me. I'm somewhat disabled so this is just great for me.", "verified": true, "helpfulness": "0/0", "author": "Hall.Terry82"}, {"rating": 5.0, "review": "Is very good", "verified": true, "helpfulness": "0/0", "author": "Glen Abad"}, {"rating": 5.0, "review": "This is an awesome product.Well worth the cost.The downside? It took me a day to figure out where the 'Enter' button was!!", "verified": true, "helpfulness": "0/0", "author": "Rupert Bodisch"}, {"rating": 5.0, "review": "Picture and Sound are awesome!  1080 P picture and surround - Be sure you go into settings when you receive the unit and adjust resolution settings to 1080 P or picture will be in low res (Low Res is the default when delivered - as soon as you change it in the settings you will have Blu-Ray quality!  Same with the sound.  Quad processor is very fast and streaming is flawless.  Voice is good but sometimes you have to enunciate and talk slowly for voice to understand your request.  If you want to search HD Prime choices you need to mention that in your voice search.  Great value for the money - you will not be disappointed.", "verified": true, "helpfulness": "0/0", "author": "B. Hackman"}, {"rating": 5.0, "review": "Blows Roku 3 away.......No buffering, buffering, buffering.", "verified": true, "helpfulness": "0/0", "author": "Daniel A Gerson"}]