[{"rating": 4.0, "review": "Great piece of equipment, the only flaw is about once a month you have to go into the app settings & delete the cache & data for Netflix & Hulu to play but I don't mind doing it. Hopefully in time a update will fix that issue..  I still love the FireTV", "verified": true, "helpfulness": "0/0", "author": "GH \"Bamaboy\""}, {"rating": 5.0, "review": "Love, love, love my Fire TV!! Actually purchased one for my son and loved it so much I got one for myself. Streaming has never been easier and it's spoiled me!", "verified": true, "helpfulness": "0/0", "author": "Movieslinger"}, {"rating": 5.0, "review": "Are you kidding me? This thing rocks! DO NOT PAY EXTRA TO GET A TV WITH INTERNET/WI FI FEATURES! This box does as much a MILLION TIMES FASTER AND AT A BETTER RESOLUTION! Using my brand new internet TV and Amazon Prime just getting to the shows took forever, the quality was slowed so the resolution was sometime reduced, and often the thing dropped the signal completely! With this Amazon gadget it was instant access, great HD quality, and the signal has NEVER DROPPED SINCE!DO IT!", "verified": true, "helpfulness": "1/1", "author": "Computerboy"}, {"rating": 3.0, "review": "Technically it may be faster than the rest.  However, the content partners are most all \"pay per view\".  I find that useless since I would never pay for a single episode of a series I like especially when it is part of another subscription. I will use it for access to Netflix in my bedroom.  Prime \"free\" movies leave a lot to be desired!  Prime \"pay for view\" is too expensive.I wouldn't have purchased this product had I known its content pricing.Roku 3 is better because of the option to listen privately with headphones connected into the remote.", "verified": true, "helpfulness": "1/1", "author": "Edward J. MacHnik"}, {"rating": 5.0, "review": "I love this thing!  Very easy to install. I had it working 10 minutes after I opened the box. I am completely hooked. I feel like I don't need cable anymore because there is so much variety to offer with my prime membership.  The only thing that Apple TV has that this doesn't is HBOGo.  But they do have a lot of HBO shows with Prime but you have to pay for newer seasons. That's my only complaint and it's not that big of a deal.", "verified": true, "helpfulness": "0/0", "author": "Ashley Marshall"}, {"rating": 5.0, "review": "Simply, the best streaming-only device I've used. Super fast interface. Loads Prime content almost instantly. When it sleeps and you resume it picks up right where you left off. No reloading the app then finding and resuming the content. Amazing.I had a Roku 3. I've used an Apple TV. I had a Chromecast. (Note: I use a PS3 in another room and prefer that Netflix streaming app above any other Netflix interface {outside of the web}. This is the second-best Netlfix app experience behind my PS3).I enjoyed the Roku 3 but it felt like a toy. the interface and apps aren't as nice or snappy. Apple TV was lacking Amazon Prime, so that was out. Chromecast was great as an idea+price however, in practice, using a phone.iPad app as a remote is buggy and clunky.Enter the Fire TV. This thing is fantastic. Amazon Prime videos play nearly instantly. Quite impressive. You don't need to launch a Prime app... the shows just exist.Yes, you can't search for just Prime but that's ok. It is similar to Netflix, however, because if you search for a show/movie there that is only on DVD, you can't play it. You can't really search for a movie that is ONLY available on streaming. It shows up but you can't watch it. So this is really the same concept as Prime and the Fire TV search.I had a couple of small issues early on. It also lost my WiFi signal the first day and took some weird reset/reload/reentering of the login information for it to work again but I've had no issues since (over a month plus). The voice search quit after the first day. After calling support, they asked me to remove the batteries and put them back... and it worked again. Hopefully this doesn't mean the remote will crap out early, but I've had no issues since then.I also stumbled upon the fact that any music I  puchased on Amazon is available to stream. Very cool. I didn't even know that!Played Flappy Birds Family. It was fun. I have a phone/tablet for casual gaming (and a PS3) so I don't plan on using the Fire TV for games.Overall, I'm blown away. This thing is fantastic. Easy to setup. Easy to use. And such a FAST processor. Seriously, you won't believe how quick Prime content can be selected and played or how amazingly fast it resumes after being asleep (even while watching non-Amazon content).", "verified": true, "helpfulness": "0/0", "author": "PandA"}, {"rating": 1.0, "review": "While the device has a great processor, other than games which i have little use for it does not add any functionality to what my Sony TV already has.  Amazon missed the boat by not adding a dlna video player (like WDTV), had this been included would have given it 5 stars.  Hopefully version 2 will add this much needed feature.", "verified": true, "helpfulness": "2/3", "author": "M. Barsoom"}, {"rating": 2.0, "review": "The good:-Fast shipping-Very fast navigation-Good customer serviceThe bad:-Remote kept loosing connection to the box.-Wifi was horrible. I put my laptop and phone next to the Fire box and I was getting full signal however the Fire TV box was only getting 1 bar.-Not many channelsI purchased the Fire TV and received it the next day. Plugged it in and plugged in the and it seemed to work fine. It was very fast. My husband set everything up and we watched a movie on Netflix.The next day it would not wake up with the remote so we unplugged it and plugged it back in. Then it started but the remote would not work. We called customer service for the first time and hooked it back up. Everything was fine until the next night when the same thing happened. Luckily my husband remembered how to reconnect the remote. This happened 4 days in a row. Then my husband unplugged the Internet cable and tried to set it up through Wifi. The signal was horrible. After a hour of trying to get it connected my husband plugged the internet cable back in. Once he did this though the box could not even find the wired internet. We called Amazon for the fourth time and explained what was going on. They tried to walk us through everything but nothing worked. He then said to reset it through the settings. When we originally set the box up we set up a password to keep our son from downloading anything. Well you need this password to reset the box and since the box can't get to the internet, it could not verify the password which meant there is no way to factory reset the thing. This is a BAD setup.We returned it, went out and got a Roku 3 and we love it.", "verified": true, "helpfulness": "1/1", "author": "Kristen NJ"}, {"rating": 3.0, "review": "Is Cool and Slick Voice works well but VERY disappointed that will not display tablets or Laptops but only Kindle.  In reading prior it is misleading to say you can connect your tablet to be displayed but only if it is a kindle.", "verified": true, "helpfulness": "1/1", "author": "P. Taft"}, {"rating": 5.0, "review": "Is it possible to use this device overseas in the Caribbean? i want to know that before I buy it", "verified": false, "helpfulness": "0/1", "author": "Denley Marten"}]