[{"rating": 5.0, "review": "We decided to stop paying high prices for satellite, and were looking at purchasing a Roku. We have never owned a streaming device, but the reviews on the Roku are high. But, my husband had heard about the new Fire TV, and we are always happy with Amazon products. We just hooked our Fire TV up today, and we are more than just impressed. The picture is better than even our satellite produces. We've only used it an hour or so, but it seems to run smoothly and quickly. The home menu is easy to navigate, but does seem to be geared toward a Prime membership, which is understandable. We are very happy with this purchase and are seriously considering buying one for the bedroom, as well as a game controller.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer \"Dark Diva Reviews\""}, {"rating": 4.0, "review": "I ordered this unit and the controller when it first became available and I've had a day or so with the unit so I thought I'd give my opinion. I'm a completely computer/electronics geek, I have XBOX Ones, PS3s, XBOX 360s, Rokus, some old WD Live TV units and Google TVs - so the only thing I can't really compare it to the Apple TV.With that said I'll give my first impressions along with how it stacks up to everything.First the hardware feels great, it's a small unit but it weights a decent amount - so your hdmi cable shouldn't be pulling the thing away from where you placed it (the Roku 3 tends to not stay in place if you have a wire pulling on it).It has a good weight and it feels well made with nice materials. It's fairly small, wider and longer than a Roku 3 but much shorter in terms of height. So overall the build quality is a plus.The remote is well done, not too big but not too small. Has a nice shape which makes it easy to hold, seems like it can take some abuse. Everything is either RF or Bluetooth (like the Roku 3) so it really doesn't matter where the box is place. You can put it behind the TV or hid it somewhere without worry.The speech recognition is something that Amazon is playing up as being something that finally works. While it works well it's also pretty limited as you can't command the unit, it's just basically a voice search. In my experience it doesn't work as well the XBOX One, which is fantastic in the way you can completely control all aspects of the device by search. With the Fire TV you hold down the button on the remote and say whatever you're going to say and then it presents some results at which point you use the controller to select what you want. Certainly it saves time over needing to type stuff, but realize that it's basically just a replacement for an onscreen keyboard and not much else at this point. Also note that the content search is limited to the app store and Prime videos. So unlike the XBOX One when you voice search for something and it gives you results as well as multiple ways to view it (Amazon Video, Netflix, Vudu, XBOX Video, etc) on the if you're searching for a movie it only provides content results from Amazon. Hopefully this is something they will update.As for how the software works, for version 1 it's fairly impressive. The Prime content is presented fairly well and for day 1 there is an acceptable amount of apps and a good selection of games (by day one standards). Everything moves fairly fast - although I noticed some lagginess when I had a few downloads - otherwise it's fairly snappy. The number of apps/channels doesn't even remotely compare to Roku at this point with some huge misses being Vudu and the WWE Network. Also strangely enough you can not access your Amazon Music library. I'm sure those apps are coming, but the lack of Vudu is a huge void even on day one.Prime movies launch quickly and the video quality is good, but I wouldn't really say the experience is better than any other device I've tried it on. Some of the great apps available are things like Plex, which in my testing works perfectly - including MKV files using DTS soundtracks. Someone stated earlier they couldn't get it to work, for me it works fine right out of the box. Other apps load up and run quickly, again on-par with something like the Roku 3.The gaming is actually fairly impressive when you have the controller. Basically the controller the same size/shape of a 360 controller with a few more media buttons on it, it has the same build standard - which is good. Gameplay is quite fluid, everything looks good - it's everything that you'd expect from a modern Android phone/tablet - meaning high resolution graphics which lack the details that you'd expect from consoles. But for the price it's a great unit for kids or for a 3rd TV where you do some casual gaming.Overall for the unit, as of today, I'd give it 4 stars. I would not recommend it over a Roku 3 at the moment as it's just missing too many features (channels). However hopefully that will change quickly and if it does it's a much much closer race. The voice search works fairly well, it's not at a Siri level and it doesn't have the same usefulness as an XBOX One - but it greatly reduces the need to use the onscreen keyboard - at least for Amazon products. Long term this will be a better unit than the Roku 3 do to the superior hardware and the gaming aspects - but if you're buying for today go with a Roku 3.", "verified": true, "helpfulness": "5/11", "author": "Rodney"}, {"rating": 5.0, "review": "Voice recognition is superb. Quality streaming is above Apple TV, photo display, gaming, TV Series, and so much more than any similar other product on the market. Above Google. Provides HD quality. A must have.", "verified": true, "helpfulness": "2/3", "author": "Don Gracey \"docrickets\""}, {"rating": 5.0, "review": "After a couple of hiccups it works great. First couldn't get the remote to pair. Tried new batteries, etc. but no luck. Called Amazon and they thought it was a defective remote and were shipping out a new set immediately. I tried again a couple hours later and paired up.No problems setting up my Netflix or Hulu Plus accounts and I was ready to go. Started streaming a prime tv show and it got partway thru and stopped. Then wouldn't let anything stream from Prime, Netflix, etc.  so called customer service again and they diagnosed and said it appears my router was having an issue. So rebooted that and tried again. Success and I've been streaming all day now. No other issues.I love this product. Way to go Amazon. Fast streaming, easy setup, etc.", "verified": true, "helpfulness": "2/3", "author": "Robert"}, {"rating": 4.0, "review": "The interface is fast and smooth, like using an iPad. I really like the fact that they gave it enough horsepower, which is a problem with a lot of other products (i.e. most smart TV's). It is also great for accessing Amazon Prime video, which looks and sounds great. I have an AppleTV as well, and would give it a slight edge because it has better apps. Specifically, Netflix is better on the AppleTV (in my opinion), and it has other great apps like HBOGO, Apple Movie Trailers, Apple Podcasting App, and Crunchyroll. All of those I use quite a lot, and hopefully Amazon will fill in all of those gaps. Once they do fill the gaps, this will be a real contender! For now, I'd recommend it if you mostly want to watch Amazon Prime Videos and rent movies, as it is perfect for that purpose. They all look and sound really GREAT.", "verified": true, "helpfulness": "2/3", "author": "BattleGnome"}, {"rating": 5.0, "review": "I have many devices such as Roku, Samsung Smart TV, WD Live, etc...  None compare to this device.  Smooth interface, amazing video content playing with no hitches and no pixelation.  The gaming feature of this system is yet to be proven as there are only a few titles available, but looking good so far...", "verified": true, "helpfulness": "2/4", "author": "Hudson Hoen"}, {"rating": 5.0, "review": "So its pretty easy to setup.  The first time I hooked it up it needed a update for the system immediately.  That ended up taking like 15 minutes to download and install.  Besides that, pretty easy.  Especially pairing with the remote.  Plex works like a charm.  I have a old mac pro running plex server in the next room and it plays smoothly and the library loads quickly.  Netflix worked perfectly.  As did Life the board game.  I owned it all ready from my kindle and it just showed up in my apps list.  As did plex, actually.  Which was cool cause that meant that I didn't need to pay for it again.The voice control thing works well.  I tossed out some interesting actor names and it got it right every time.Size wise, the remotes perfect.  Small but not small like the apple tv remote where I am constantly misplacing it.  The Fire TV box itself is tiny.  Super thin, considering it packs a punch under the hood (quad-core, 2gig of ram).The menu is setup nicely and it's easy to navigate.  I don't know,after about three days with it, I like it.  It works and it's quick.", "verified": true, "helpfulness": "2/3", "author": "Z. Brickett \"menotyouorhim\""}, {"rating": 5.0, "review": "Amazon Fire TV is the fastest road to online content.  It was simple to set up, simple to learn, and simple to use.  Pick a movie or TV show, click on it, and start watching like it was stored locally (applies to Amazon Instant Video products).  It is also fast to load Netflix and ESPN (once you've set up your account on Fire TV).  Voice search works wonderfully.  I used to watch online content through a Sony BluRay player, but their noted trouble with streaming left me watching a buffer screen for more time than I was watching the content.  The Amazon Fire TV hasn't paused once since I installed it.I would like to see the voice search applicable to all content and apps (like on a cell phone); right now it only seems to apply to Amazon content.  And Amazon promises continued development of apps and content, which will be appreciated.Well worth the $99.", "verified": true, "helpfulness": "2/3", "author": "pianoman72"}, {"rating": 5.0, "review": "Great picture. Very fast. I also received excellent support in getting my Netflix to work. A well thought out product.", "verified": true, "helpfulness": "6/10", "author": "Edward Young"}, {"rating": 5.0, "review": "We love it.  Quick and easy set up.  System is more responsive than then other systems I have seen.  Voice search is great.  Recommend it to all.Waiting on game controllers, should have ordered earlier.", "verified": true, "helpfulness": "2/4", "author": "K. Kirschke"}]