[{"rating": 4.0, "review": "Works as described but it is no Roku", "verified": true, "helpfulness": "0/0", "author": "Chad Ferguson"}, {"rating": 5.0, "review": "Great technology!", "verified": true, "helpfulness": "0/0", "author": "SoccerGuy"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "matthew"}, {"rating": 5.0, "review": "Google has done it again. After smart TV came out I was thinking about spending $700 dollars to get a new TV but cromecast changed that I just spent $30 and I turned my TV to smart TV. I can stream Netflix,  amazon instant video, pandora , spotify and tons of more applications.  Love it!! And also I travel a lot so I just carry this with me and hook it up in my hotel TV and boom now I have all the shows to watch in big scree.", "verified": true, "helpfulness": "0/0", "author": "Ramenani"}, {"rating": 5.0, "review": "I used to have to use an HDMI cable and this allows me so much convenience. One thing I found out is that you have to program it on your Smart Phone before it'll work; you don't use your laptop. This bit of information is not included in the instructions.", "verified": true, "helpfulness": "0/0", "author": "Jim M from Oregon"}, {"rating": 4.0, "review": "I purchase Google Chromecast to watch what I have on my phone on my TV.You can use this to watch things like You Tube and Netflix as long as you are watching it from an app butit does not mirror whats on your Ipad or Phone.If you want to mirror whats on your Ipad or Phone then what you need is an Apple TV.You can see ANYTHING that is on your phone or Ipad on the TV.No need for an app.its about double the price but well worth it.I own both and use the Apple TV more on our main TV.Chromecast stayed in the kids room for Netflix and You Tube videos.Chromecast not a bad tool, just not what i was looking for.", "verified": true, "helpfulness": "0/0", "author": "SILVIA"}, {"rating": 4.0, "review": "That was what i was looking for ; Have to download it all cromecast Applications with support for this works . Directly if you are playing for youtube, vevo , or other streaming channel , you can disconect your control device and cromecast Keeps running and playing .the pack have a great presentation, and it arrived on the estimation time without issues.", "verified": true, "helpfulness": "0/0", "author": "Cristopher Nunez"}, {"rating": 5.0, "review": "Love this does exactly what I want", "verified": true, "helpfulness": "0/0", "author": "Romey"}, {"rating": 2.0, "review": "Worked great for 5 months now I can't get anything to connect to it. I've tried updating all my software on my devices and reset the chromecast and my wifi network. Nothing. I loved it while it worked but I won't be buying another one. Too frustrating.", "verified": true, "helpfulness": "0/0", "author": "Engineer"}, {"rating": 5.0, "review": "We have two, great product!", "verified": true, "helpfulness": "0/0", "author": "KRiS"}]