[{"rating": 5.0, "review": "Great! Works with all my devices and streams perfect!", "verified": true, "helpfulness": "0/0", "author": "RCSaintL"}, {"rating": 5.0, "review": "very useful device. now it's easy to pump pandora or youtube from anyone's phone to the tv system. great for parties.", "verified": true, "helpfulness": "0/0", "author": "M. Barra"}, {"rating": 1.0, "review": "This product is absolutely terrible. It worked for about a day and now can't connect to anything. Don't waste your money.", "verified": true, "helpfulness": "1/2", "author": "Zach Landis"}, {"rating": 5.0, "review": "Installed for my wife's workplace -- fairly easy setup overall, and non-techies were able to pick up on it pretty quickly.", "verified": true, "helpfulness": "0/0", "author": "Brian Potter"}, {"rating": 2.0, "review": "Did not work in my case", "verified": true, "helpfulness": "0/0", "author": "polsat2000"}, {"rating": 3.0, "review": "Great for streaming from a select few sources like Netflix and YouTube, but casting basic webpages from a laptop is still in beta. I have also had some issues with it losing its connection to my devices and had to change which hdmi port in the tv I used to get it working again. A little glitchy, but handy for the applications I listed.", "verified": true, "helpfulness": "0/0", "author": "Dan C."}, {"rating": 3.0, "review": "I definitely use it a lot less than I thought I would.", "verified": true, "helpfulness": "0/0", "author": "Drew \"Drew\""}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "chuck grundeman"}, {"rating": 5.0, "review": "Chromecast has made me watch TV more than I ever thought possible. I was amazed at the incredible functionality of this dongle (what a great word) based on the price. I love way significantly more than my Apple TV. Bottom line: if you're looking, just get it.", "verified": true, "helpfulness": "1/1", "author": "CatDaddy"}, {"rating": 5.0, "review": "Best streaming device for the price", "verified": true, "helpfulness": "0/0", "author": "JOSE HERNANDEZ"}]