[{"rating": 5.0, "review": "Great buy, and  great picture quality.", "verified": true, "helpfulness": "0/0", "author": "Jimmyg"}, {"rating": 5.0, "review": "Very good product best bang for your buck", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the Chromcast , this is my second one  for the bedroom,  took 10 minutes to get it up and working  now I have netflix in my family room and bedroom", "verified": true, "helpfulness": "1/1", "author": "Jeffrey L."}, {"rating": 2.0, "review": "too much lag with my devices.....not really using it as i had hoped i could stream fromlaptop, notebook, ipad......i can stream...just way to much lag", "verified": true, "helpfulness": "0/0", "author": "Douglas McMillan"}, {"rating": 5.0, "review": "Very Usefull.No Regrets.", "verified": true, "helpfulness": "0/0", "author": "Raghu"}, {"rating": 5.0, "review": "Works excellent with the phone to watch most apps on TV.", "verified": true, "helpfulness": "0/0", "author": "LandShark"}, {"rating": 5.0, "review": "Easy to install and works great!", "verified": true, "helpfulness": "0/0", "author": "Eric Reagan"}, {"rating": 5.0, "review": "exellent!!!", "verified": true, "helpfulness": "0/0", "author": "Kirpal Aquézolo"}, {"rating": 5.0, "review": "Awesome :)", "verified": true, "helpfulness": "0/0", "author": "Rebecca Miniati"}, {"rating": 1.0, "review": "I purchased two of these and have had nothing but trouble using them. They have worked from time to time, but mostly, it has taken 20 minutes to over an hour to get them working each time I have tried using them to connect to Netflix.I regularly get the message \"no Chromecast devices found.\" I have tried using a laptop, an iphone, and an ipad to connect. It is impossible to get help to try to solve this issue either online or by phone. To try to send a message, Google requires that I submit an email by selecting from menus of statements that do not accurately describe my problem. Their primary message for people who cannot connect is to change wireless router settings. I have spent hours, first trying to locate my router instructions, then reading through them. I have also spent much time reading through the forum questions trying to find one that exactly matches my problem. It shouldn't be this hard. There is no phone number, that I'm aware of, to get help by phone. If there is such a number, Google makes it impossible to find. After trying to work with the product, for a month and a half, to try to get it to work properly, I now find it cannot be returned after 30 days. I will never purchase another electronic device that does not offer easily accessible help without having to sort through reams of FAQs or forum questions and answers.After reading many of the reviews in the Apple App Store, I find I am not alone.", "verified": true, "helpfulness": "1/1", "author": "Warren B."}]