[{"rating": 5.0, "review": "I love our Chromcast.  This is our 3rd one!  Easiest way to update your TV without purchasing a brand new smart TV!", "verified": true, "helpfulness": "0/0", "author": "Kiran"}, {"rating": 2.0, "review": "Not really all that great, unfortunately, you are really limited from streaming things from your ipad to the Chrome system.  If you're on a laptop or desktop, I suppose that may work better.  Bought it, but never really use it.", "verified": true, "helpfulness": "0/0", "author": "GooseDad"}, {"rating": 5.0, "review": "Google ChromeCast HDMI Dongle is a very nice way to view YouTube when you are on the go. As long as the TV/Monitor has an HDMI port, then you are good to go. I have had very good luck with this one. The only downside was when a pedestrian used their cell phone to SYNC to my ChromeCast device. They tried to hack into my WI-FI. This is a security problem, so I only use it when I travel.", "verified": true, "helpfulness": "0/0", "author": "Edmund Tiberious Stendall"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 2.0, "review": "Not what I had hoped for, hard to navigate and doesn't seem to work well", "verified": true, "helpfulness": "0/0", "author": "David A Rundquist"}, {"rating": 4.0, "review": "Doing what is expected out of it", "verified": true, "helpfulness": "0/0", "author": "rb"}, {"rating": 4.0, "review": "Does exactly what it's suppose to, technology it's awesome, just be sure to have another power outlet or a usb port on you tv, also this will be difficult if you have your tv mounted to the wall, not much room to plug in :-\\", "verified": true, "helpfulness": "0/1", "author": "shawn"}, {"rating": 5.0, "review": "Love love love!  Absolutely in love with this.  We had gotten rid of our satellite and this fit the bill.  I love the fact that I can cast what I am looking at on my laptop.  It is really great for my online classes since I can cast the video on to the tv.  It is great for You tube videos (we like to cast our music video playlist from You tube.Using a program called plex on our I-Phone we are able to connect to our son's library of movies on his computer 45 miles away!!  There are a lot more apps for it, we just haven't had time to look into them yet.  Amazon has the best price that I had seen around the Portland, Oregon area.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 1.0, "review": "We bought this  device so that we could stream videos from Netflix, which is pretty much what it is supposed to do. Easy enough, right? If only. We have two windows laptops and three android devices (two phones and one tablet). Chrome on windows just stopped seeing the device, out of the blue. Nothing seems to fix it. As for Android, same story: in a completely random way, the device refuses to connect, or drops the connection while you are watching a show. Resetting the device helps with Android, but it's time consuming and a pain in the butt to do every time we want to watch a show. And resetting the device does NOT solve the problem of Chrome on Windows refusing to see it. I have sent my feedback to Google, with no response. Apparently asking that a device works as advertised is too much these days.Moral of the story: it is so not worth the aggravation. Yes, it's cheap, but frankly if I had thrown the money down the toilet it would have been as useful and less time consuming.", "verified": false, "helpfulness": "0/1", "author": "Grumpy"}, {"rating": 5.0, "review": "Work great, particularly when my other streams don't work.", "verified": true, "helpfulness": "0/0", "author": "Parker23se"}]