[{"rating": 5.0, "review": "I love this thing.  We have all smart TVs in our house except the one in our basement.  We payed a small fortune for it, so replacing it was not in the cards.  This little gadget solved the problem, and since we bought the mounting thing-a-ma-jiggy that goes on the back of the TV nobody even knows it is there.  If I had known about this sooner, I would have saved a ton of money on our other TVs by buying the unSmart versions and making them Smart with this gadget.  LOVE it!!!!", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 3.0, "review": "wasn't what i expected", "verified": true, "helpfulness": "0/0", "author": "MIZGEES"}, {"rating": 2.0, "review": "I bought this mainly for a quick and easy way to have Kodi in the living room, and to that end, it has worked fine. HOWEVER, it struggles so often with the other 'normal' apps (Netflix, Hulu, HBOGo), that I find myself using the XBOX more often than not as the default media player. It's hit or miss, but it seems like lately these apps don't work more often than they do. So, if you want something to play with to sideload all sorts of neat stuff, by all means get it. But if you're looking for a basic media player and don't have an option like a SmartTV or gaming console, get a Roku 3. We have both (although the Roku has made its way into the kids' bedroom), and the Roku is a much better unit. More intuitive, user-friendly, and just flat out WORKS more often than the AFTV.", "verified": true, "helpfulness": "1/1", "author": "whiteboyslo"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Alan Pennock \"justme\""}, {"rating": 3.0, "review": "Very disappointed to learn that after watching several seasons of a program on prime and getting \"hooked\" you now want to charge to see the next season. I guess I moved to fast and did not look into Amazon good enough before getting involved. I will warn others.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "I know what your're thinking: if it has a total of 4 stars, then its not bad. Wrong. Most buyers leave feedback 1 to 2 months after purchasing items. The Amazon Fire TV comes with a nice user interface, a voice search function, although that pulled up mostly Amazon Prime shows. But just a few months after purchasing the box it started freezing. So I bought a Roku Stick for backup, thinking the issues may either fix themselves, or Amazon would put out updates. A few more months and the remote stopped working. One fine day, it started working again. Then it stopped working again for a couple of months. I used my cellphone AP to control the box for those couple of months. After doing a factory reset one morning, the remote worked again, with streaming buffering and freezing more frequently. It was around April 2 2015, a little less than a year since I bought this box, that it finally refused to start up. It never went past the Amazon logo at start up. Since I have a Roku Stick, which I also bought on Amazon, I procrastinated for about a week before calling Fire TV tech support. I spoke with a lady who had me go through all the basic troubleshooting steps I already told her I did at least 10 times before calling. Then, to my surprise, she suggested that I bought a new box. Unfortunately, she added, my warranty expired over a week ago. There was nothing else they could do. I read online discussions about this box and found that countless customers had the same defect, which, I learned, was called a brick. Once you Fire TV is unable to go pass the Amazon logo at start up, it has bricked. And Amazon hasn't come up with a fix for that yet. Well, that's a manufacturer defect and should fall under 'Recall'. Armed with this information, I called Fire TV support again. As soon as the rep heard of the box's malfunction, she wasted no time telling me my warranty expired, and I'd have to buy a new box. Whatever happened to repairing? And since this is a widespread Fire TV issue, why aren't Amazon taking responsibility? The rep then promised she would forward an expedited request to replace the box, seeing that the warranty only just expired. I thanked her and hung up. I later received a message from Amazon, saying they were in the process of replacing my box.I should contact them as they just needed to confirm a couple of things. Spoke with a lady who took one look at my account and said, oh, because your warranty expired, that's why they're not sending you a replacement!!! Imagine the frustration. Meanwhile, all I ever wanted was to fix my box.Just because this Fire TV has 4 stars does not mean its not a major failure. Any electronics equipment with a year or several moths lifespan is a failure. The customers who left good ratings for this box did so before they realized it had major issues. Amazon is well aware of this 'brick' issue, and is making no effort to help consumers. Amazon has been a major honest company for quite a while. They need to maintain that by taking care of issues where loyal customers like us are beginning to feel like we're being duped.", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Nice design and specification, but fail with video playback. Bought this to replace my aging AppleTV, which works just fine but long for \"PLEX\" support. Playback video on AppleTV is smooth and artifact free, most notable in the \"BLACK\", while Fire TV would show gradients and artifacts. Also the audio did not seem clear and full. Shame hope to see where this will go, but until than it's \"APPLE TV\".", "verified": true, "helpfulness": "0/0", "author": "Eddie Shedd \"T!mmy\""}, {"rating": 5.0, "review": "I have never been so impressed with a video system like this. No commercials, no interruptions and great movies.", "verified": true, "helpfulness": "0/0", "author": "Anita"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "DUARTE"}, {"rating": 5.0, "review": "I just love it. I replaced my Roku for this one.", "verified": true, "helpfulness": "0/0", "author": "tigregallo"}]