[{"rating": 5.0, "review": "Nice unit. Works great.", "verified": true, "helpfulness": "0/1", "author": "khedquist"}, {"rating": 5.0, "review": "Got it for my husband for Christmas. It took our daughter five minutes to set up. Have it in our bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Angeles Lamoli Silvestry"}, {"rating": 4.0, "review": "Works okay. I think it all depends on your internet speed. We do have issues with it cutting out, but for the price it has served us well.", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Enjoy every moment of casting!", "verified": true, "helpfulness": "0/0", "author": "Darian Ng"}, {"rating": 5.0, "review": "Amazing peice of technolory for the price!! Rarely have any issues with it!", "verified": true, "helpfulness": "0/0", "author": "BlackKnight009"}, {"rating": 5.0, "review": "Love it. I never watch cable anymore. Bought one for the hubs. He loves his too. Never any connection issues. Beautiful screen saver screen shots.  I bring it with me when i travel. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Nurse/Veteran \"Susan C.\""}, {"rating": 5.0, "review": "Why the hell is this 129....", "verified": false, "helpfulness": "5/8", "author": "carlos sosa"}, {"rating": 2.0, "review": "Maybe I was expecting too much, or too ignorant, when I purchased the Chomecast HDMI.  I could only find nice pictures on my TV screen produced by Chromecast.  There weren't and aren't any icons for apps, instruction/help area, or anything else.  I found out that you need to use your other devices apps to \"cast\" something to the screen.  These apps disappear when you shutdown Chromecast, leaving you with pretty pictures once again.  The main feature that I thought would be available was streaming stored items from my desktop computer.  I am not ashamed to admit that I was wrong in thinking Google Chromecast HDMI could preform what you would think would be a simple task.  Maybe, I was dazzled by the other, wonderful and amazing services that Google created.  Not realizing that streaming PC stored items, would pose such a challenge to the world's 8th wonder.", "verified": true, "helpfulness": "0/1", "author": "Penelope Penworthy"}, {"rating": 5.0, "review": "This is convenient and easy to use. We do not use a DVR. This is a great little device to meet all our viewing needs.", "verified": true, "helpfulness": "0/0", "author": "dd121"}, {"rating": 5.0, "review": "This is by far the most used item in our household. The apps work wonderfully on the device. They are able to mirror the display of the casting device but audio and video at same time requires a solid WiFi connection and casting device (phone or tablet) tends to overheat when more then 20 mins in length and then disconnects, only in mirror display mode. I believe this is only a casting device issue which will improve as hardware gets better. The Chromecast itself works beautifully when initiated into use, and then other device (phone or tablet) can be shut off and Chromecast still plays on itself. Its a mini computer by itself, once you verify your intentions it takes over the heavy lifting from your own devices. Think of your phone or tablet or home PC as the remote for this and it just works fine.", "verified": true, "helpfulness": "0/0", "author": "Kevin M."}]