[{"rating": 1.0, "review": "Pretty much a dissappiontment... Doesn't interface with amazon prime, and seems to always have connection issues/times out with other services... I would definitely recommend other devices over this...", "verified": true, "helpfulness": "0/1", "author": "Samantha A. Smelko"}, {"rating": 5.0, "review": "Love it because it works with my mac, pc, android and works with others iphones. If you want to cast I highly recommend this. Several updates have made it even better.", "verified": true, "helpfulness": "0/0", "author": "G-MO"}, {"rating": 5.0, "review": "I bought my first one for my husband for Christmas. We immediately bought another as a gift when we realized how great it was. We just bought a third for the bedroom TV. We use it for YouTube and Netflix primarily. Of course it doesn't work for Amazon Instant- they just came out with their own. Still, you can't beat Chromecast's price- 1/3 of the others. No complaints here!", "verified": true, "helpfulness": "0/0", "author": "Jamie B. \"BuckyD\""}, {"rating": 5.0, "review": "We have Rokus on three other TV sets and was going to get another for the living room as I'm getting ready to give the cable company's expensive premium channel selection the boot for Netflix, Amazon Prime, etc. This was cheap $35 and works right from my smartphone. I have the iPhone but it works on them all. Allow a little time for the first set up, ie don't plug it in five minutes before show time but after that it is a snap. You do need to use the recommended power supply so it is a bit more than you see right here. Amazon has their own Fire out now that I have not checked out. it is $99 and this is $35 though.", "verified": true, "helpfulness": "0/0", "author": "MARK A GRIFFITH JR"}, {"rating": 5.0, "review": "Kinda useful to have around the house.  I don't really use it anymore, but I bought five of them last fall as holiday gifts.  Nobody was excited, at first, but after a couple of weeks, the reviews were quite positive and appreciative.  Unbidden thanks, all around.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Abraham"}, {"rating": 5.0, "review": "At first when I bought this i was disappointed. I could play netflix and youtube videos just fine but that is not why i got this in the first place. I couldn't play video's straight from my computer onto my TV, but I eventually figured out with RealPlayer Cloud how to accomplish it. It still is a little tricky, I have to have my videos in MP4 format and I have to use my cellphone or tablet to tell my computer to play the videos onto my TV but all in all it works smoothly when I figured it all out. I figure since the product is new not everything is completely compatible with it yet, but soon more programs will become compatible with it. I loved this google chromecast so much I went and bought a second one for my other TV. For the price this gadget is extremely useful. I suggested it to several of my friends and would recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Ragsdale"}, {"rating": 5.0, "review": "As always google made something great! I move my Chromecast all over my house to different tv's, whether its to listen to pandora, watch youtube or catch up on my Hulu and Netflix shows. It never lags and i have no problems", "verified": true, "helpfulness": "0/0", "author": "Christina Herriges"}, {"rating": 5.0, "review": "With Price Range $30-$35, this gadget is a \"must\" if you like youtube/netflix at home.Setup is simple and super easy.Pro:- Cheap especially if you are the \"Early\" buyer, (you got 3 months of netflix for free)- Works fine for streaming videos e.g. Youtube and Netflix and even from your PC \"chrome\" browser- More apps are being released now to support chromecastCons:- Amazon Instant Video (come on amazon - release your instant video to this chromecast)", "verified": true, "helpfulness": "0/0", "author": "TWCA \"TW\""}, {"rating": 5.0, "review": "I love how my chrome cast will work with my cell phone (Android) and with my laptop via Wifi.  Works wonderfully, and a superior alternative to Roku.  I can cast anything internet onto my tv screen using my laptop--with one caveat: that you download Google Chrome.  I did, and it will work with .edu websites so I can watch school videos on the TV. The only thing is, my laptop tends to get hot (the fan turns on) when casting.On the cell phone, it works a little differently since it is using application drivers for an android.  I can connect to the chrome cast and run youtube or netflix, no problem.  I don't think it will cast google chrome though.  It will not work on some other applications either.  But if you use it for Netflix or Youtube it works great and the cell phone doesn't seem to get too hot (yes I know it has no fan but trust me, I pick up the phone and it doesn't feel super hot).", "verified": true, "helpfulness": "0/0", "author": "gretchenette"}, {"rating": 4.0, "review": "Was using the Xbox for hbogo and Netflix needs, now I prefer this. Quieter, always on and waiting if the TV is on. Only complaint is that it can be laggy sometimes but still better than drowning out the Xbox", "verified": true, "helpfulness": "0/0", "author": "Eric Frohnapfel"}]