[{"rating": 5.0, "review": "Wow no words amazing amazing. I recommend this device for gadget freeks you can enjoy live streaming on your TV", "verified": true, "helpfulness": "0/0", "author": "Champakram"}, {"rating": 1.0, "review": "Google's tech support pages for the device are somewhat hard to find. You will finally find a long list of router incompatibilities and settings. Never got mine working reliably and I'm good at configuring routers. A $35 consumer device should not be this finicky. I have 6 or 7 smart phones, 6 computers, a security camera two televisions and a file server connected to my router and none of them required me to fool with the router settings. A low-end Roku box is $15 more and will just work.", "verified": false, "helpfulness": "2/3", "author": "B. Gulino"}, {"rating": 5.0, "review": "I have 2 Samsung DVD's on Wirless one wired and both on line with Router.  I bought Chrome Cast for one thing.  That was a way to simple watch videos from U-tube without messing around turning on DVD turning stereo to DVD ect .  ChromeCast out of the box was easy .  Just plug one power wire to Chromecast plugged into Samsung 50\" non-computer Flatscreen 1080P HDMI Port other end to power on wall.  Could of used second HDMI but had a component in it.  Turned TV to ChromeCaster used Apple IPOD Airplay 64bit auto logged into U-Tube put in number from screen and done.  To watch U- Tube from Airplay or Iphone 5S turn on TV select ChromeCaster Input , open app on either apple Device push play, then button looks like blue outline of TV in right hand Corner and select any video. Can darken phone or Airplay and open back up anytime, back up video fast forward, pause change video very fast no delay.  Have a Cisco E 3000 router 19 devices working off it and unit is 50 foot away behind 2 walls and 2 doors, no signal issue - Note router is mounted high by ceiling, TV on wall mount.  I do have HIgh Speed Internet 50 down, 2 -5 up depending on devices in use.  Have fallen asleep in bed and video still play or stop waiting for next video, the Q did not work , but really to be honest did not try to find out why.  Picture is better than 1080I off Dish Network.  I was hoping it would cast dish anywhere as I broke off TV RG-6 connector on TV.  Got parts to fix but find myself  watching a U-Tube.  Have Dish ran thru old VCR RCA jacks till I get time to solder connecter in TV.  Lots more apps coming out.  Real Player is one.  Be-careful or one HDMI movie off iTunes in 1080 will consume 2 GB off free storage and you be paying for iCloud storage.  Never Tried any other app.  Lady from apple Care said she used Chrome Cast in room without Dish wires to watch her sling box.  I am not able to do it from app?  Maybe she logged in some how from Google not sure.  They also just came out with HBO-Go if you have HBO.  Easy way to watch Y-Tube and not have to manually search with Remote on pre-computer TV''s using DVD's.  Wish I had ordered one for living room.", "verified": true, "helpfulness": "0/0", "author": "Bcs"}, {"rating": 5.0, "review": "I LOVE this thing!  Works perfect with iPad and phone.  If you don't have a smart TV, this is the easiest way to get streaming handled!", "verified": true, "helpfulness": "0/0", "author": "Sam Lima"}, {"rating": 5.0, "review": "Chromecast + the BubbleUPnP app and for less than $40 I have everything I need to cast just about any media I can put on my phone! I've also had no problem at all tabcasting from my PC.", "verified": true, "helpfulness": "0/0", "author": "David W"}, {"rating": 5.0, "review": "We watch Netflix from our laptop on our TV and the picture is perfect. I love that I can still do other things on my laptop at the same time.", "verified": true, "helpfulness": "0/0", "author": "HBDGAS"}, {"rating": 5.0, "review": "It was easy to install and we were watching from our laptops within minutes.Best $35 spent ever on technology", "verified": true, "helpfulness": "0/0", "author": "James Elliott"}, {"rating": 3.0, "review": "Works great if you're only going to use streaming media such as youtube, netflix, hulu etc. That was very limited use for me. Also, I couldn't get mine to work with my WiFi SSID broadcast disabled. When I broadcast the SSID it works great but that is like inviting trouble.", "verified": true, "helpfulness": "1/1", "author": "TD"}, {"rating": 5.0, "review": "Installed it on my living room TV (60\" Vizio), a smart tv.  The apps on the TV were pretty poor and the WiFi was very weak.  The Chromecase works very well.  Use Pandora, YouTube, and Netflix. All work well, when more apps come available we will put another one in guest room.It support CEC which makes it better than the Comcast DVR that is connected to the same TV.A very cool product,", "verified": true, "helpfulness": "0/0", "author": "W. Johnson \"Walt\""}, {"rating": 4.0, "review": "For $35 its a decent deal. Works great for Netflix and the occasional time I use it with the browser. I wish it worked with the browser on the iPad or iPhone. Maybe that will be next. I suppose I could hack it and maybe get more out of it.", "verified": true, "helpfulness": "0/0", "author": "Daniel A. Rehbein"}]