[{"rating": 5.0, "review": "The item is truly worth to buy.!", "verified": true, "helpfulness": "0/0", "author": "Daifeny"}, {"rating": 5.0, "review": "Works really good and we are considering ordering on for our bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Bargin Shopper"}, {"rating": 5.0, "review": "Best entertainment alternative to hit the market, but don't just use it out of the box. Get some of the great guides from Kindle on setting it up to do more. That has made a great device even better!", "verified": true, "helpfulness": "0/0", "author": "John-Richard Pagan"}, {"rating": 4.0, "review": "Not perfect, but for $35 it can't be beat. I would have given it 5 stars if it worked with more video apps other than Net flix and chrome. It works with others, but don't buy this thinking this will be just like an HDMI cable, because it's not. But it is still pretty cool, and certainly worth the $35!Works very well with my android phone and YouTube... Kinda cool sitting with your phone casting vids to your tv.", "verified": true, "helpfulness": "0/0", "author": "Mike George"}, {"rating": 5.0, "review": "I love this item. Its does the great job streaming YouTube video on my hd tv. Fast and flawlessly.  But still wish to have a minor function from my Android phone.", "verified": true, "helpfulness": "0/0", "author": "Withitkul Suksawang"}, {"rating": 5.0, "review": "it does what it says :)", "verified": true, "helpfulness": "0/0", "author": "Zalazar"}, {"rating": 1.0, "review": "Wont play anything smoothly from brand new iMac and cable internet.", "verified": false, "helpfulness": "0/3", "author": "Byronian \"StiffTonic\""}, {"rating": 5.0, "review": "Works GREAT!", "verified": true, "helpfulness": "0/0", "author": "James R. Loux"}, {"rating": 5.0, "review": "Love this thing; it's so cheap and great for basically all the function you'd get from a Smart TV. Great price, too!", "verified": true, "helpfulness": "0/0", "author": "Sean O'Connor"}, {"rating": 5.0, "review": "great investment for those without a smart tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]