[{"rating": 5.0, "review": "smarts invent ever, i'm steaming a movie for my kids from my pc to my tv while I'm writing this review.Can't complaint.", "verified": true, "helpfulness": "0/0", "author": "Moises Garcia"}, {"rating": 4.0, "review": "Perfect if you want to stream movies, etc. from Netflix or Huluplus.  Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Yvonne Cunningham"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Antonio Rocha"}, {"rating": 2.0, "review": "Wasn't compatible with Sling TV. Got the purchase price refunded less shipping.", "verified": true, "helpfulness": "0/0", "author": "David Crawford"}, {"rating": 5.0, "review": "The best ...", "verified": true, "helpfulness": "0/0", "author": "cecilia simon"}, {"rating": 5.0, "review": "I bought this for a relative. He likes it. Since he has used it he said NSA has him monitored 24/7 and has since put duct tape over his flat screens camera and mic. If you trust google, you are brain dead. It even works for streaming  'net TV.", "verified": true, "helpfulness": "0/0", "author": "Alfonzo's Amazon prime directive"}, {"rating": 4.0, "review": "Enjoyed it, but switched to Roku in the end.", "verified": true, "helpfulness": "0/0", "author": "The Aviator"}, {"rating": 5.0, "review": "Excellent seller, would recommend.", "verified": true, "helpfulness": "0/0", "author": "Steven Esquivel Fernández"}, {"rating": 5.0, "review": "If you are looking for something convenient and inexpensive for multi purpose media usage, THIS IS IT! I stream almost everything from my phone to my desktop right onto my big screen. I love this little thing.", "verified": true, "helpfulness": "0/0", "author": "Henry"}, {"rating": 3.0, "review": "When it works, it's great! I love that it's compatible with StarzPlay, since none of the other casting devices currently are. My only problem (and it's kind of a big one) is that it malfunctions all the time. Constantly losing connection with whatever I'm casting it from. I know it's not my wireless connection, I'm the only one on it and I typically shut down all other tabs that I'm not casting. Sometimes if I'm watching something I have to reset it multiple times during 1 episode just to get it to continue to cast. If this didn't happen, would definitely be a 5 star product.", "verified": false, "helpfulness": "0/0", "author": "AmandaLeigh \"AmandaLeigh\""}]