[{"rating": 5.0, "review": "Super easy to set up with any wi-fi.  Great picture quality.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It was difficult to use this for all the capabilities that this could have. I would suggest waiting for a media player such as VLC to develop code for Chromecast integration before buying this with the intent of using it as your media center device.However, it does work very well with the apps and extensions that were built with the Chromecast in mind.As more and more developers integrate the Chromecast SDK to their code, this product will become better and better, but, for now, expect to wade through uncharted waters.", "verified": true, "helpfulness": "0/0", "author": "Ji Woong Baek"}, {"rating": 5.0, "review": "It's working.", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 5.0, "review": "all I can say is for a power user, this little thing can do amazing things. easy to configure, please note if you plan on using your pc to do the streaming, as this was primarily meant for tablet or cellular device streaming use, you're going to have to have WiFi capabilities on whatever you choose to stream from, meaning your pc will have to have some sort of wireless NIC. I also learned through some trial an error that it operates best if you're streaming from your pc that has multiple NICs (say a typical rj45 and then maybe some usb wifi card) when you share you're main internet connection with the network adapter you're streaming with. also get the chromecast extension for chrome, which is amazing if you have multiple displays you can free yourself from having to use specific programs or services to stream their media selections. the chrome extension allows you to choose which DISPLAY to stream to your TV, which means you stream the contents of a chosen display to the tv freeing you to continue say playing video games on your other display. This is quite useful as a gamer with a fiance and friends not always interested in sitting around watching you play world of warcraft!", "verified": true, "helpfulness": "0/0", "author": "David F. Jackson \"Techie\""}, {"rating": 5.0, "review": "=)", "verified": true, "helpfulness": "0/0", "author": "HerbstFam \"HerbstFam\""}, {"rating": 4.0, "review": "I have the Chromecast for about six months and I am very pleased with it. I mostly use it to watch YouTube movies and live TV Streams and most of the time works fine. When it doesn't it is because of a slow internet.", "verified": true, "helpfulness": "0/0", "author": "Dorin Sahleanu \"Dorin\""}, {"rating": 5.0, "review": "I have three, one for each TV.  I've purchased them as gifts.. great product for the price.  Only real issue I have is the internet tends to disconnect and you can only use on 2.4gz wireless routers...  does not work on 5.0gz systems...", "verified": true, "helpfulness": "0/0", "author": "Edward Minsky"}, {"rating": 5.0, "review": "What can I say this is pretty impressive technology they can turn your TV into a smart TV with easy instructions and great Google technology. What I like most about this is the back Drop wallpapers that has, makes your TV look like a computer monitor using internet or satellite pictures as its background.", "verified": true, "helpfulness": "0/0", "author": "Andy Natividad"}, {"rating": 5.0, "review": "Works great and easy to install.", "verified": true, "helpfulness": "0/0", "author": "patty alatorre"}, {"rating": 5.0, "review": "Excellent product. Compatible in youtube with Android, Ipad, MAC... For Android is full compatible with all.", "verified": true, "helpfulness": "0/0", "author": "Jose Nunez"}]