[{"rating": 5.0, "review": "Always past by and saw this but never knew what it was until someone told me and it is pretty cool. Wish it could do it without wifi cause now that I moved out and don't have internet, I can't really use it. But it is a very nice product and helpful.", "verified": true, "helpfulness": "0/0", "author": "Cyn"}, {"rating": 3.0, "review": "It works well, provides great image, small and fairly simple to use.However the fact it does not have a remote/integrated apps is a bit annoying. Having to use tablet/phone/computer to cast what I want to see, pause, play, etc is not my preferred choice of interface... it is a bit glitchy. For the price I personally prefer something else (Fire TV stick, Roku, etc)", "verified": true, "helpfulness": "0/0", "author": "E.C.C.R."}, {"rating": 1.0, "review": "This thing is such a pos. It works about 20% of the time. At first I thought maybe it was the app... but then I noticed it's not recognizing my Internet connection. When I have a full connection. So annoying.. wish I'd returned when I had the chance. But then again, that 20% of the time, I love it. But when you work a full time job, you don't have time (or patience) to sit there and try to figure out what the issue is every time you want to watch tv, after a long day at work.", "verified": false, "helpfulness": "0/0", "author": "Cynthia Payne"}, {"rating": 2.0, "review": "So I heard this was great. It allowed all the content on your computer to be broadcast on your TV. What I found out was that it allows you to broadcast all the content of your phone to your TV, as everyone in the room gets to see whatever you're looking at on the screen of your phone as you do so. Meaning you don't select what to share, and embarrassing or private content may be shown to a room of strangers. What's more, if you want to share anything from your computer, it has to be uploaded to your Google+ account. Not exactly broadcasting the contents of your computer.As for all the other apps you can now use on your TV, like Netflix or YouTube, yeah, you can do that with Chrome. For some reason if you don't have a Playstation, Wii, or  other device that was already doing all the streaming content apps, then Chrome is really great. However I already have a PS3 that can do all of this and more, so Chrome is like a sad latecomer, with half the bag of tricks.Unlike a simple USB wifi device, Chrome also requires a plug-in power source, so it's not something that I would consider mobile.So if you don't have a way to watch Netflix on your TV yet, get a chrome, otherwise, ignore the hype, it's not worth it.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "Makes streaming anything from my phone or tablet very easy and quick. It was also very easy to set up to the Wi-Fi.", "verified": true, "helpfulness": "0/0", "author": "David T."}, {"rating": 1.0, "review": "Normally I love google products. I think they're great, but after using the chromecast I just don't think they're ready to step into the hardware world. It was a nightmare to set up, and it rarely (if ever) works. My devices, a galaxy s4 and an HP Envy, just won't sense it. This could be an individual issue with my unit, but who knows...", "verified": false, "helpfulness": "0/0", "author": "Drew Sprayberry"}, {"rating": 4.0, "review": "Gift", "verified": true, "helpfulness": "0/0", "author": "Richard Micklon"}, {"rating": 4.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "happy whit the product .", "verified": true, "helpfulness": "0/0", "author": "sabina copilu-cheatra"}, {"rating": 5.0, "review": "Received in good condition, as described.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]