[{"rating": 5.0, "review": "love  it", "verified": true, "helpfulness": "0/0", "author": "Mary Harvey"}, {"rating": 5.0, "review": "😍😍😍😍😍😍😍😍😍", "verified": true, "helpfulness": "0/0", "author": "Seron Mullings"}, {"rating": 5.0, "review": "I love the Amazon Fire TV because it is so fast downloading shows-- no skips, bumps, or false starts only to freeze up while watching my programs.  I have not tried the gaming part yet, but I am sure it will play like a charm.  I already have a smart TV and the regular Fire Stick.  I love the voice-activated remote.  It is so accurate when speaking into the remote, I hardly ever have to repeat my request.  This truly dominates Chrome and Roku, as I've tried both of those devices on my children's TVs. My Vizio has limited Apps and tends to be slow, and the Fire Stick works just as well as the Fire TV, but has more space to run all my programs.  I recommend this to anyone that doesn't want a $200 a month cable bill!", "verified": true, "helpfulness": "0/0", "author": "Mandyjo \"Cooking junkie, AMAZON fire junkie NOW.\""}, {"rating": 5.0, "review": "Luv it! So much faster than roku was, nice not to be suffering through slow loading programs anymore.", "verified": true, "helpfulness": "0/0", "author": "takeabreak"}, {"rating": 2.0, "review": "Edited Apr 05, 2015Amazon pushed some software updates that takes care of some of the issues:1. Amazon has pushed some new software update that now allows bluetooth headphones to be used. So this takes care of the wireless headphone issue.2. USB file playback issue remains as is. The update from Amazon only allows apps to be Installed in USB, no local file playback possible.=== Original Review ===I purchased this item in view of good ratings and hardware specs.Overall I am dissatisfied with Fire TV for the following reasons:1) No local/USB playback support. You cannot play anything from your thumb-drive like you can in Roku 3.2) No headphone jack in the controller. I miss this while playing movies late in the night. Roku has a headphone jack built into the controller which makes it really easy to attach a headphone.3) Overall UI of Fire TV seems confusing. There seems to be a lot of scrolling involved to find content. Amazon Prime has many good videos but some reason they do not surface so well when browsing. Unless you know what exactly you are searching for, it will be hard to find the content you need. Voice search is great though.", "verified": true, "helpfulness": "1/2", "author": "Tim R. \"Tim\""}, {"rating": 5.0, "review": "I looooooove this, I can watch so many shows and movies!", "verified": true, "helpfulness": "0/0", "author": "Jessica G. Posio"}, {"rating": 4.0, "review": "I'm enjoying not having a cable bill, but still get to watch my favorite shows on Sling TV", "verified": true, "helpfulness": "0/0", "author": "its me"}, {"rating": 5.0, "review": "I bought this product at Staples this is a very good product it works good for his money I purchase something like it at Walmart and I had to take it back it did not like the HDMI cable this product fire TV may not do everything you wanted to do but it works very good with no problems it is worth spending your money on what I bought from Walmart", "verified": true, "helpfulness": "0/0", "author": "ANTONIO GRIGSBY"}, {"rating": 5.0, "review": "Great so far!", "verified": true, "helpfulness": "0/0", "author": "Sharon Franks"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Kevin"}]