[{"rating": 5.0, "review": "Works exactly as described. It's so nice to be able to watch whatever we want on the big screen without wires.", "verified": true, "helpfulness": "0/0", "author": "Erin McCue"}, {"rating": 4.0, "review": "It's value for money but it could be better. A kind of delay when you connect to your PC (chrome) (3-5 seconds).Doesn't works with iPad 1 (chromecast app needs iOS 6+", "verified": true, "helpfulness": "0/0", "author": "Pablo Pino"}, {"rating": 4.0, "review": "This is a great gizmo and works pretty well; however it is limited to streaming only certain apps or channels from your notebook, tablet, etc. I originally thought it would reflect everything your tablet displays, i.e. every app or website. Other than this, the product is quite user-friendly. Perhaps the next generation will overcome this limitation?", "verified": true, "helpfulness": "1/1", "author": "A. J. Stavsky"}, {"rating": 5.0, "review": "NO more useless channels for me. This is it! I am free!I am just so happy that I bought this little fella the Google Chromecast HDMI Streaming Media Player. Should be called Google Easycast.-You just plug it to the HDMI connection on the side or back of your tv. Mine was a little tight and I used the extension that came in the box.-Downloaded the Chromecast App to all my devices (Android phone Atrix 4G and tablet Asus memo pad hd7)-Paired with your device. Enter the code you see in your HDTV or any tv with an HDMI connection, in your device.-Name your Chromecast-Start watching Free skippable Ad Channels on Youtube.", "verified": true, "helpfulness": "0/1", "author": "FATHERFINGER"}, {"rating": 4.0, "review": "I like the technology but would like more options to stream to my TV.Other than Netflix, I don't have too much to stream.", "verified": true, "helpfulness": "0/1", "author": "Maria Guillemette \"Molly Mc B\""}, {"rating": 1.0, "review": "Very difficult to set up. Very vague instructions. I spent almost 3 hours screwing around with trying to get it to work. You just go in circles. What ever happened to PLUG'N'PLAY?Also Amazon reduces the price from $35.00 to $29.99 but doesn't offer an Amazon credit or refund for the difference to the poor suckers who paid $35.00 for it only a few days before it was reduced. Thanks Amazon.And they have the nerve to charge $3.99 to return the piece of junk.I think I will shop my local computer and electronic stores from now on. They believe in customer service. Amazon doesn't!", "verified": true, "helpfulness": "3/9", "author": "Captain EMO"}, {"rating": 4.0, "review": "Works great after I corrected a WIFI password issue.  Cannot connect to a secure network with more than a 63 character password.  Not an issue for most people but I'm paranoid; I like long passwords.  Shortened it to 63 characters and now it works just fine.", "verified": true, "helpfulness": "0/0", "author": "Steve S."}, {"rating": 3.0, "review": "Hopefully it'll get better. It's pretty slow to respond and it will disconnect from my phone and there's no way to stop it then without rebooting the device. I am not sure I'd buy it again, but I'm also pretty sure they will update it and it'll get better.", "verified": true, "helpfulness": "0/0", "author": "P.Norris"}, {"rating": 4.0, "review": "It does exactly what it's supposed to do. Netflix works flawless and same goes for YouTube and Play Music. It's so easy to use that even grandpa can watch Netflix on TV by using tablet and Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Mika Ylisuutari"}, {"rating": 5.0, "review": "It does what it does very well. I like the ability to remote control from my mobile device.I knew this when I bought it, but it has a lot more potential than what is made available.", "verified": true, "helpfulness": "0/0", "author": "Dustin D Thurston"}]