[{"rating": 2.0, "review": "Yes, easy to hook up. Yes, sound generated control.Doesn't give you access to much because it doesn't interface with computer.  So you can have net flux and hula and prime, but you pay for almost everything.  We r returning our box.", "verified": true, "helpfulness": "5/10", "author": "Adriennemk"}, {"rating": 3.0, "review": "I like the voice search, but this device does not have nearly the apps like Roku. I do think the quality of the picture is a little better than Roku. It's priced the same as most devices of this kind.", "verified": true, "helpfulness": "2/2", "author": "randstuff4u"}, {"rating": 3.0, "review": "This device is a stunning piece of hardware, spec wise.  That's pretty much where the fun ends. (I'm not a game player, so I didn't take that into account)The device seems to revolve around Amazon content and everything else is secondary.  Lesson learned here is don't buy a device from someone who provides content, and expect a balanced device.I am going to stick with my Roku 3 for now.", "verified": true, "helpfulness": "8/9", "author": "G. Meyers"}, {"rating": 5.0, "review": "got the amazon fire about a week ago love it!! great choice of options ,easy to use even for me who has trouble sometimes with electronics so many shows and movies and the radio is awesome listening it now would recommend to anyone especially at this price great job amazon!!", "verified": true, "helpfulness": "1/2", "author": "Julie Mobley"}, {"rating": 5.0, "review": "would defintaly recommend fire tv it works great does everything they say it does i loved this little box got a friend coming to check it out probably will buy one.", "verified": true, "helpfulness": "1/2", "author": "thomas pennington"}, {"rating": 5.0, "review": "Very easy to hookup just took a few minutes. Easy to use. Its very small does not take up much room.", "verified": true, "helpfulness": "1/2", "author": "Paulette Benning"}, {"rating": 5.0, "review": "If you like watching movies you will love this.  It's so much faster than having to spell out what you want.  The voice recognition never fails to find what your looking for.  Takes about 5 minutes to hook up.  No so sure if the game controller is worth it.  I haven't found any games that I like and the short lag time makes playing pinball no fun.  Just my opinion.", "verified": true, "helpfulness": "1/2", "author": "montzenger"}, {"rating": 2.0, "review": "Overall I am glad that I purchased the Fire TV.  However there are several critical failings which I wish I had known about prior to purchase.1.  The voice search is easy to use and does recognize titles very well, but the function only searches Amazon content. So if you are searching for a TV series that is available for 'free' from Netflix or Hulu, the only result you will see is from Amazon for a fee.2.  Showtime Anytime App does NOT work if you subscribe to Showtime via Comcast.So to sum up, I will keep my Apple TV on HDMI 1 for most of my digital content consumption, and leave the Fire on HDMI 2 for streaming Prime content only.", "verified": true, "helpfulness": "6/7", "author": "Erin Mulvey"}, {"rating": 5.0, "review": "I have already purchased 2 and 'cut the cord' saving $100 per month.I have no issues with it, however would like a couple features:Needs unified search or at least voice search in app (like in hulu or netflix)Needs more aps, like Target Ticket, HBO Go, twitch, etcAlso I thought it was odd that I got a free 500 token allowance with my first purchase, but not my second.  That seemed odd.Those are just additions I would like.  As is this is a great box and will pay for itself in a month of no cable", "verified": true, "helpfulness": "3/4", "author": "joseph thornton"}, {"rating": 5.0, "review": "Very easy to use. I really like all the apps. Works great and I run it through my receiver and it sounds great!", "verified": true, "helpfulness": "1/2", "author": "Jim Jones"}]