[{"rating": 2.0, "review": "I've been using Roku for years, and decided to give the Fire TV a shot. It's been working fine, but there is one continuous issue that bothers me, and makes the device unwatchable. The sound fades in and out for a second or two throughout a program. I've checked the connections and everything is secure, I've rebooted,and even reinstalled. Nothing is solving the problem. Sadly it's just sitting there now, and I'm using my Roku that has always been reliable...", "verified": true, "helpfulness": "1/2", "author": "Flick \"FlashMind\""}, {"rating": 3.0, "review": "Not excited.  When is someone going to figure out that the cable companies have a strangle-hold on the consuming public and put an end to their monopoly? Why should I have to keep a premium cable subscription to watch Showtime Anytime when I'm using cable's overpriced internet service to watch it on Amazon Fire? Wake up America. Amazon should make their own deal with the premium broadcasters and let us buy a la carte. It's good for Amazon's bottom line and it's good for competition.", "verified": false, "helpfulness": "2/8", "author": "Paul"}, {"rating": 4.0, "review": "I got a 30 day trial of the Amazon Fire TV to test out and compare it to my current Apple TV.  Both are different devices and I do prefer the more visual layout of the Fire TV compared to the barren look of the Apple TV.The apps I tried mostly were Hulu, Netflix, Vevo, and Twitch.  As most would know Amazon's own services are the default option but you can choose to use other services as well.I was disappointed in that the apps look just the same as my old Smart TV Samsung just a bit faster.Netflix was a bigger disappointment because I expected a newer device and platform would have the newer visual layout that Netflix is using on other devices but it still has the same style before they updated to that style.The other bigger disappointment was that it seems the Apple TV uses higher quality video settings when streaming because using the same network I got the same video quality as the Smart TV platform from the Samsung.Which was the video seemed lower in resolution and blurrier.I'm not sure that because it has the same look and guide as the built Netflix app on the Samsung TV it shares the same visual settings but all 3 are connected to the same wifi network and I tested it with the same video.Hulu has differing video quality depending on the show you're viewing with the built in TV app and Fire TV, again, sharing the same video quality.  While the Apple TV having a slight edge in video quality compared to the other two.Vevo looks the same across all platforms but just like the Samsung app the Fire TV has a weird pausing and stuttering playback every now and then when just watching the Vevo TV streams.  It also has the same visual look as the Samsung app.The pausing/stuttering playback happens on their website so it's a tossup on whether the devices, Vevo or my ISP is causing the issue.  The Apple TV does pause every once in a while too but not as much as the Samsung, Fire TV and website.I tried using the Twitch app to test it out and compare it to the app on the iPad and what happened was the Fire TV app actually got stuck in a weird state.I could hear the audio playback even when not in the app and trying to switch over to another app didn't make it go away. I had to unplug the Fire TV to remove the lingering audio issue.It seems the background apps platform that Fire TV uses still has some bugs to work out.  Overall it's a good device for streaming and if you're not a part of any streaming device yet it's a nice contender but my issues were with apps I used and video quality issues that I experienced with Netflix.The outdated look of Netflix was something I didn't expect as the Fire TV is a newer platform but it can always be fixed when the app is updated.There also seems to be some lingering bugs with the Twitch app I experienced but it never happened in either Netflix, Hulu or Vevo. I'm glad Amazon allowed a 30 day trial of the Fire TV as it was a nice thing to know how it worked in my setup and situation but for people that don't care so much about the way the apps look, video quality and lingering background bugs which most can be fixed with software updates then the Fire TV will work for you.  It just didn't work for me.", "verified": true, "helpfulness": "7/9", "author": "CT"}, {"rating": 5.0, "review": "Worth much more then $99!!!", "verified": true, "helpfulness": "0/1", "author": "Joss Bishop"}, {"rating": 5.0, "review": "I had been using my Wii to watch things like netflix. Forget that! I LOVE my new fireTV. It's great for netflix, but it's even better for renting stuff through Amazon! The voice recognition works great. Everything I could want!Make sure you get the cord to hook it up to your TV! It's not included.You may also want to get something to mount it to your TV.", "verified": true, "helpfulness": "2/3", "author": "jdawg"}, {"rating": 5.0, "review": "Easier to use than Appletv", "verified": true, "helpfulness": "1/3", "author": "alice mireles"}, {"rating": 5.0, "review": "I've had Amazon Prime for a long time. Also have Netflix and use an Apple TV. If Amazon really wants to convert people, they should give this out for free to Prime users.", "verified": false, "helpfulness": "3/7", "author": "Pat"}, {"rating": 2.0, "review": "Does not work via Wi-Fi! Needs to be connected to internet directly. Only bought it because it says it's quad core. Another bill for connection of internet.", "verified": true, "helpfulness": "1/17", "author": "JSBofEB"}, {"rating": 5.0, "review": "I upgraded from a Western Digital TV which was having some serious trouble keeping up with Netflix. This little box is great. It's incredibly fast; switching between apps (Netflix and Hulu and Prime) and works fairly well with the Cloud Drive for like home movies. The Prime content mix is a bit murky because it seems to mix free content in with the paid content. And even with the free content sometimes it's a behind the scenes or promo clip that looks exactly like the title movie/TV show. I get why Amazon does the mix but as a Prime member it would seem they could separate these out. I haven't explored too much into connecting network/external drives but it doesn't seem to do that. The WD box did. It also doesn't seem to auto-play the next episode in a series like Netflix or Hulu do. Small issues that hopefully will get fixed/added.", "verified": true, "helpfulness": "3/3", "author": "Matt Z."}, {"rating": 3.0, "review": "Not ready yet.The good -fast but not anymore than Roku 3voice search for PrimeThe bad -Netflix stutters; Netflix playback is not good - the same is excellent on my Apple TV 3.Freezes sometimeVoice search is limitedNetflix interface is not close to Apple TV, cannot search for movies with the same director or actor the way Apple TV doesAmazon Prime is very limited as compared to NetflixNo HBO GoI sent it back because of Netflix issues. Apple TV is great with Netflix interface and streaming. I also observed that the quality of itunes movies is better than Amazon Prime.", "verified": true, "helpfulness": "4/6", "author": "Bond"}]