[{"rating": 3.0, "review": "Aaaaaaaaahhhh sucks I bought apple tv works 10x", "verified": true, "helpfulness": "0/2", "author": "Fox"}, {"rating": 4.0, "review": "Very nice for streaming Netflix, HBO Go, Youtube and other apps on any TV. Most smart TVs have limited apps and don't support HBO Go, so this is a cheap way to upgrade that ability. I would give it 5 stars, but the software is still really buggy. I don't know if it's Chromecast or the individual apps (I'm talking to you Netflix) but it continues streaming but your app won't show connection to the TV anymore, so you can't control the player. It's really annoying.", "verified": false, "helpfulness": "0/0", "author": "Sela"}, {"rating": 5.0, "review": "Basically turns your HDTV into a smart TV. You'll be able to watch Netflix, stream stuff from your phone and laptop on to the big screen. Works fine without any glitches.", "verified": true, "helpfulness": "0/0", "author": "TechDush"}, {"rating": 2.0, "review": "When it works its awesome. I bought this for tecnologically impaired wife hoping that the thing could just be setup and left alone. Unfortunately either the chromecast or router needs to be reset every other day or so because the device cant connect to the cast. Many times the device cant find the chromecast and needs to be reset. My wife will be without tv  until i can come fix it. This is unacceptable. I honestly would have no issue unplugging it every so often but it shouldnt be expected to operate that way. Fix the bugs and this could be a 5 star product.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The roku is so much better!!?", "verified": false, "helpfulness": "0/5", "author": "Lisa M. Angelo"}, {"rating": 2.0, "review": "Worked well when it worked. After only a few weeks it kept rebooting and stopping constantly (after 15-20 minutes) and I got so tired of having to fix it that I switched to a new smart Bluray player. You get those for a few extra bucks and they work well. If you have a smart phone or tablet you can connect it to over WiFi then you have a nice interface... and all major companies will let you connect your devices to their accounts now is my impression.I would not buy this again nor recommend this product to friends. Two stars for the idea.I do hear that google replaces them but I have not looked into that part of the deal. It's sitting in a drawer.", "verified": true, "helpfulness": "0/1", "author": "Gerald in Denver \"Gerald\""}, {"rating": 2.0, "review": "Everything I had read about the chromecast was positive and it seemed awesome. I opened it up yesterday and after 2 hours decided to return it. Lots of disappointments, including:- Very hard to get set up and working the first time - took 40 minutes before it was completely working - had to download an iphone app to get it to work.- It would lose connection to wifi sometimes- Almost always while watching a youtube video, about 3/4 way to the end, it starts getting choppy (our other devices don't do this)- When it completely lost connection to wifi and appeared to go offline, I couldn't figure out how to get it working again. That's when I gave up.The concept of this device is brilliant, but I'm seeing it's still a 1.0 version and needs some improvement.", "verified": true, "helpfulness": "0/1", "author": "Nathan G. Jensen"}, {"rating": 4.0, "review": "Works great to give my children options for streaming movies, BUT Google really needs to work on fine tuning connection issues with Netflix and allowing mirroring from an iPad would make this little little thing a steal and would fly off the shelves!", "verified": true, "helpfulness": "0/0", "author": "sunshinegirls"}, {"rating": 5.0, "review": "Great find to enable me to show photos on my TV or friends' TVs. Needed an HDMI switch but worked it out", "verified": true, "helpfulness": "0/0", "author": "Three Cats Fun"}, {"rating": 5.0, "review": "One of the best things Ive ever bought. I find myself saying a lot \"why am I watching this video on my phone or laptop instead of that 60in plasma?..............\" then I click the Chromecast button and its on my tv! My network seems to allow a nice HD picture over the stream but your results may vary!", "verified": true, "helpfulness": "1/1", "author": "JuanGrande386"}]