[{"rating": 4.0, "review": "My main reason for buying this is to watch movie files on my computer directly on my TV.With the free download of Videostream, it accomplishes this task.The only drawback is that Chromecast gets pretty warm. No so hot that you can smell the heat or can't touch it, but if it were a little bigger you could lay it flat and sit your coffee cup on it to keep your coffee warm.", "verified": true, "helpfulness": "0/0", "author": "Zilla"}, {"rating": 5.0, "review": "Awesome! Sim;e and easy to use", "verified": true, "helpfulness": "0/2", "author": "KMH"}, {"rating": 4.0, "review": "In case anyone is wondering, you need a dependable home wifi connection, a smartphone/tablet or computer, and a tv with an available hdmi port. If you dont have access to any of these, move on.The set up is really simple, it will give you instructions on the tv once you plug it in, but heres a quick run down in case you're interested. You have to turn on your tv and chromecast, and plug the chromecast into your tvs hdmi port. Then you have to install the \"chromecast app\" on your phone/tablet or computer. It will request a code, which you will get via the tv. Once you do that, the chromecast will most likely install updates and restart. It might take a while, so be patient. This item includes the chromecast, a small 3 inch extension to \"make your wifi connection more stable,\" and a usb cable to power the chromecast either through your tvs usb port or the included power adaptor.What the chromecast does is basically use your smartphone/table/computer as a remote control so that you can watch things on your tv, effectively transforming your dumbtv into a smarter one.every once in a while you get promotions simply for having this thing, so that pretty cool.", "verified": true, "helpfulness": "1/1", "author": "Alex Toscano"}, {"rating": 5.0, "review": "Perfect invention", "verified": true, "helpfulness": "0/1", "author": "Aaron S"}, {"rating": 5.0, "review": "Use my Nexus 6 and or 9 to cast my content. If your devices are all Android, makes it so much easier. Especially if the rocking Lollipop.", "verified": true, "helpfulness": "0/0", "author": "C. Davis \"HiJackZX1\""}, {"rating": 1.0, "review": "Total waste of money. After about two hours this unit's audio suddenly gets so distorted that you have to unplug it and re-sync everything up again. Google needs to fix this, the internet is loaded with problems people are having with this product. Shame on Google.", "verified": true, "helpfulness": "0/0", "author": "5T3V3"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "Jonathan Racaniello"}, {"rating": 5.0, "review": "The success I've had pairing my computer to my HDMI TV and using it as a screen makes it worth the price alone.", "verified": true, "helpfulness": "0/0", "author": "M. Wesley"}, {"rating": 5.0, "review": "It's not as easy to use as it should but once you get the hang of it you'll be satisfied, there are other ways to do what this little device does so be sure you understand what the best option for you is.", "verified": true, "helpfulness": "0/0", "author": "Marvin Carrillo"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "Wong Yat Pun Chong"}]