[{"rating": 3.0, "review": "Very fast. I love voice search and the easy access to Amazon Prime content. However it can't play files off my media server.", "verified": true, "helpfulness": "0/0", "author": "P. Platt"}, {"rating": 5.0, "review": "It was so easy to set up and figure out and the programming is everything we like to watch i highly recommend it especially if you were looking to replace.your cable", "verified": true, "helpfulness": "0/0", "author": "Lea Ann Johnson"}, {"rating": 5.0, "review": "It is truly great. I've had it for about a month and we all love it at my house.", "verified": true, "helpfulness": "0/0", "author": "Michael D. Setzer \"\"Not Too Smart\"\""}, {"rating": 5.0, "review": "Love everything about this little device, from wonderful and very powerful specs to design and how it evolves.", "verified": true, "helpfulness": "0/0", "author": "Eduard Kleyn"}, {"rating": 1.0, "review": "Does not work with DSL data rates.", "verified": true, "helpfulness": "1/3", "author": "Amazon customer - I \"Amazon Customer\""}, {"rating": 5.0, "review": "Best investment I ever made.  It went from box to ready to roll in around five minutes.  Remote is one of the best and most intuitive ever seen.  Works like a charm.  I will highly recommend to others.", "verified": true, "helpfulness": "0/0", "author": "no1jman"}, {"rating": 5.0, "review": "Easy to set up ....we absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "J. Nichols \"Johnnyhendrix\""}, {"rating": 5.0, "review": "So far exceeds my expectations, in fact I purchased a second one for our bedroom.  Really like the quality of the picture and the rate at which it downloads (streams).  Voice recognition works really well, better than any other recognition system I tried.  Had a little problem initially with music download lock-up, but called and Amazon help fixed me up right away.  Only wish the \"sleep\" function was easier to get to.", "verified": true, "helpfulness": "0/0", "author": "daylily"}, {"rating": 5.0, "review": "Easy to set up and use.  The navigation is simple, especially with the voice activated controls.  To the consternation of my kids it can't seem to understand them as easy when they try the voice look up, but I am fine with that.", "verified": true, "helpfulness": "0/0", "author": "M Hicken"}, {"rating": 4.0, "review": "We have to unplug to get Netflix to load a couple of times now", "verified": true, "helpfulness": "0/0", "author": "Charles"}]