[{"rating": 4.0, "review": "We really enjoy our Amazon Fire TV However I am not able to understand as to why some of the new movies are not available except to add to watch list. Yet those same movies are available on our laptops from Amazon web site? Also we are really liking the HBO and Show Time. We are over the road truckers and use the amazon tv as our entertainment, every time we try to add a HBO or show time feature it keeps asking for our HBO or Show Time subscription. We do not have a home as we live full time in our truck at least until we get a home built. Then we will add it.My Question is how can I add the extras to Fire TV without having a network  tv carrier.", "verified": true, "helpfulness": "0/1", "author": "Happyjack"}, {"rating": 5.0, "review": "Easy to use. It's almost scary how easy it was to set up. Basically plug and go if have a prime account.", "verified": true, "helpfulness": "0/0", "author": "M Chaney"}, {"rating": 1.0, "review": "You gave me a completely wrong product, not as advertised in the title, you shipped me the iPhone 5 speaker instead of the iPhone 5s speaker. And no tools came with the packaged as advertised. Can I get a free replacement. Thanks.", "verified": true, "helpfulness": "30/36", "author": "somnang sin"}, {"rating": 3.0, "review": "i bought 2 of these, and am generally quite a happy user.especially as an xbmc player, installed via sideloader, this box is fantastic!so, the positives are obvious:affordably priced xbmc player, performant enough to run video files from a network sharealso plays nicely things from the installed version of the amazon storenow the cons:Once you get used to the comfort, you want more! but:Most of things you can purchase from the amazon store, even shown as compatible, are NOT!You can install some apk via the sideloader and many seem to work fine but a few dont,Main problem are input device and google-android-store dependenciesimprovement suggestions to amazon:- dont show apps as compatible in the app store that dont install as compatible! this is really a minimum requirement!!! extremely annoying!!- support the google app store! that'd be such a 'WOW'!!!- in the amazon store, point to some valid apk in case the auto-installer doesnt pickup an app. now this would be such a help!! would make it feel like almost 'open'!!!else, in the short-term, this thing is going to become totally obsolete by such things as the RASPBERRY PI 2 or the ODROID. they cost less and perform as good and completely support the android store and all open apps...", "verified": true, "helpfulness": "0/0", "author": "Kamil Ince"}, {"rating": 5.0, "review": "I was actually disappointed that I could only give it 5 stars!  My Amazon Fire TV was easy to set up and the included self-help video demonstrating the functions of the remote was excellent.", "verified": true, "helpfulness": "0/0", "author": "Rich McClure"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "isela"}, {"rating": 4.0, "review": "Poor review on trying to get Fire TV started,this is why you don't get 5 stars,I was asked the same question over and over, but now the box is working and  I LOVE IT. THANK YOU....... P.S. GET PRIME it's worth it.", "verified": true, "helpfulness": "0/0", "author": "Gary R Fessenden"}, {"rating": 1.0, "review": "Don't waste your money.We received it as a wedding gift. Initially we struggled to even get it to download the initial setup operations. We went through all the FAQs, all the suggested helps. It literally took messing with it everyday for a total of about 12 hours to get it running. And ever since, over a month now, we still can't get anything to play straight through. Either we get \"no internet connection\" ... Check settings, Internet is \"very good.\" Or \"UNKNOWN_ERROR\" please try again later. Or even worse... It freezes at the circle of death mid program or movie. Can not recommend this product at all.", "verified": true, "helpfulness": "1/3", "author": "Lilwolfgirl"}, {"rating": 5.0, "review": "I love this product works great I can watch all my favorite shows instantly.  I also ordered my son the stick he loves it.", "verified": true, "helpfulness": "0/0", "author": "Carl Schniers"}, {"rating": 5.0, "review": "Love it!  My package arrived earlier than originally expected.  It was super easy to install.  And, I could easily browse to my favorite shows...  Amazon continues to be amazing!!  I am a very satisfied shopper.", "verified": true, "helpfulness": "0/0", "author": "Bargain shopper"}]