[{"rating": 5.0, "review": "loved it and will recommend to friends.", "verified": true, "helpfulness": "0/0", "author": "JOHN FOSTER"}, {"rating": 5.0, "review": "This is the second time I have ordered this as a gift.  Came in quickly and in perfect condition both times.  I would order again.  Easy to use and perfect for yourself or as a gift.", "verified": true, "helpfulness": "0/0", "author": "Callie"}, {"rating": 3.0, "review": "Does not have amazon prime video. Keeps losing connectivity with the phone, so you need to keep installing and synchronizing.", "verified": true, "helpfulness": "0/0", "author": "dan"}, {"rating": 4.0, "review": "They did not give me the free 2 months of Hulu.", "verified": true, "helpfulness": "0/0", "author": "Brian J. Lantzy \"Brilansee\""}, {"rating": 5.0, "review": "I LOOOOOOOOOOVE my ChromeCast.  I now own two and it's spectacular to be able to \"cast\" my apps to my TV and to even mirror my phone onto the TV.  I was concerned that casting would drain my battery, but it does not.  The phone just controls the ChromeCast (unless you're mirroring).  I was casting Netflix and had to turn my phone off to replace the battery on my phone and Netflix kept playing, uninterrupted.  REALLY great device and cheap, too!", "verified": true, "helpfulness": "0/0", "author": "Aaron B."}, {"rating": 5.0, "review": "You don't need cable! We steam almost everything from my galaxy phone and iPad, itouch and iPhone with no problem. You won't be able to stream everything but majority of the things you watch on your phone can be steamed directly to the TV!! And it doesn't kill my batteries and I can use my phone to complete other tasks as I'm streaming! It's like magic!", "verified": true, "helpfulness": "0/0", "author": "Treshawna Speid"}, {"rating": 5.0, "review": "Works great & gave me a reason to finally have my dad upgrade my laptop from Vista to Windows 7!", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Chromecast is great and very useful for watching Hulu+, Netflix, WatchESPN, HBO and many others. App selection is growing daily and most apps, Watch ESPN aside, are getting better and more efficient for streaming to a TV.", "verified": true, "helpfulness": "0/0", "author": "Jacob"}, {"rating": 4.0, "review": "really good device", "verified": true, "helpfulness": "0/0", "author": "I.Arias"}, {"rating": 4.0, "review": "Great gadget to have in your personal bedroom, it gets a lot of apps, but I wish I could get more out of it as far as the movie/tv apps go. It could be my phone, but if Chrome would let you utilize Amazon Prime video, I think life would be a lot more close to that vague word called, \"perfect\".", "verified": true, "helpfulness": "0/0", "author": "SgtKaveman"}]