[{"rating": 3.0, "review": "I have found it to be extremely frustrating. I have an iPhone to control it. Sometimes the device just gets out of synch and won't do anything (Hint: there is a teeny-tiny reset button. Sometime sit starts to cast and then the hweel begins to spin and then it can't access the movie (Try again later). I even bought a new wireless router (the TV is 2 rooms away from the router) but that didn't make a difference. Sometimes it works fine -- but that's entirely unpredictable. If itr was reliable it would be a nice device for watching NEtflix (I was disappointed when I bought it that the claimed ability to cast from a browser was only fantasy-ware for a Mac.)", "verified": true, "helpfulness": "0/0", "author": "D. Geller \"Madrikh\""}, {"rating": 5.0, "review": "There is nothing I can say that hasn't already been said on here, but the chromecast is just excellent. For the price it is impossible to beat, it has every app that I really could want, the video quality is fantastic, just nothing bad to say at all. Buy it!", "verified": true, "helpfulness": "0/0", "author": "Garrett"}, {"rating": 5.0, "review": "HelloThis is probably the best product I have used when it comes to mirroring the laptop,i pad,or iPhone to your TV is a breeze it was very easy to set up  I guess for the price it will do a great job I will recommend this product for everyone just remember that if you do not have a network or a WiFi it will not work  one it mirror to the tv you can turn off your devices the mirror will still be on your TV dues to the fact that it connects to your Router  and started to streeme from there what a great idea love itthank you GOOGLE", "verified": true, "helpfulness": "0/0", "author": "tussadiq abbasi"}, {"rating": 2.0, "review": "Not enough apps provided. Pandora did not seem to work. Netflix worked well but they do not have very many new movies. Ok for basic needs.", "verified": true, "helpfulness": "0/0", "author": "Dillj55"}, {"rating": 4.0, "review": "I love being able to view HD video on my TVs without the wires.  The problem is that these devices don't stay connected 100% of the time.  I'd say about half of the time they disconnect from the network and have to be setup again.  I've even taken it to the point where I've reconfigured my wireless router to get it to work according to Google's support.  Still not perfect and I'm not about to give up on 'em yet.  Hopefully an update will take care of the issue.  For under $40 it's a great technology.", "verified": true, "helpfulness": "0/0", "author": "Chad Gabriel \"interfaser solutions\""}, {"rating": 1.0, "review": "It wont work for me.... it keeps reloading... impossible to watch anything without constant interruption!  Have tried it from all of my devices... same issue.  STINKS", "verified": true, "helpfulness": "0/1", "author": "Vija I. Carney \"Vija\""}, {"rating": 5.0, "review": "This is by far the simplest thing to set up as for as a streaming dongle. It works pretty flawlessly, no buffering, in HD, and very fast. I bought one to \"try out\" as I do not have cable TV and was sick of hooking my laptop up to the HDMI port on my television to stream from that. That setup worked but it was a lot of back and forth and clean up after done watching - was hard to truly relax. Chanced this dongle not knowing how it exactly worked, but was truly a great purchase. Easy to lay on the couch and change what you're watching by a touch on your smart phone. Mainly do YouTube but recently tried Netflix and it works perfectly. No real complaints at all. The only things to note is sometimes the YouTube app on my phone resets and I can no longer access what is currently streaming on my TV, but that's the phone's problem, not the chromecasts's.", "verified": false, "helpfulness": "0/0", "author": "TDP"}, {"rating": 3.0, "review": "An amazing product. Installs beautifully and universally impressive when it works....Caution. Very finicky when connecting and disconnecting especially switching devices.Sometimes a good old fashion reboot of your device or the chromecast is needed for everything to find each other...THE WORST is there is a KNOWN incompatibility between the Samsung Galaxy Tabs and NETFLIX to chromecast.Neither Netflix or Chromecast will take responsibility for it and the issues has been out there for a year!!!DON'T EVER count on talking to a human at Google..They are impossible to get help from...", "verified": true, "helpfulness": "0/0", "author": "kenneth j diener"}, {"rating": 5.0, "review": "Very good product! easyly up, at first i had a problem setting up my tv, but i realized that was wireless configuration.", "verified": true, "helpfulness": "0/0", "author": "Nestor"}, {"rating": 5.0, "review": "I wish I would have bought the chrome-cast sooner. The only complaint I have is the inability to stream movies.", "verified": true, "helpfulness": "0/0", "author": "Stefan"}]