[{"rating": 5.0, "review": "Device works great and was very easy to set up.  We have had no problems with it so far and are very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Nicole Bendig"}, {"rating": 2.0, "review": "not enough apps supported at this time. easy of use s good.  att has had many issues with the service for the hbo app", "verified": true, "helpfulness": "0/0", "author": "dont care"}, {"rating": 5.0, "review": "I don't have cable TV, and generally get my media from computers.This device allows me to cast whatever is in a Chrome window to my tv. I can do so from laptops or phones, and when I cast netflix from my phone, very little battery is used.Its nice to have queued during gatherings of friends, as the backgrounds are stellar and we can quickly share with the whole room the interesting things we are looking at on-demand.I am considering getting a 2nd for the TV in my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fun item to use viewing video from my laptop to our large flat-screen TV. It does require a provided power cable attached to the unit that is not obvious when purchasing.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Gonzalez \"Sir Knight R. Gonzalez\""}, {"rating": 5.0, "review": "We recently got rid of cable and started using Hulu Plus, HBO Go and Netflix.  The chromecast has made our viewing experience so much better.  I love controlling it from my phone from anywhere in the house.  Its really the best thing ever if you are streaming media or music to your tv.", "verified": true, "helpfulness": "0/0", "author": "SelenaHodge"}, {"rating": 4.0, "review": "max 720 p resolution is  disappointing.  I was expecting at least 1020p HD screen.I was planning using it on meeting rooms, to connect wireless to HD TVs. Gave up.", "verified": true, "helpfulness": "0/0", "author": "Enzo Maimone \"Enzo\""}, {"rating": 2.0, "review": "I am very disappointed with this product since it says it works with netflix and it is not true, it works fine with youtube only.", "verified": true, "helpfulness": "0/2", "author": "m m s"}, {"rating": 2.0, "review": "But if you're more than 20 feet away with a single wall in the way, don't waste your time. I've tried this is various places in my bedroom and the connection from it to my router is always lost and even non-connectable in some positions. My smartphone and laptop have a near perfect signal in my bedroom, so I have no idea why the Chromecast can't keep up. This is a regretted purchase.", "verified": true, "helpfulness": "0/1", "author": "Ross"}, {"rating": 3.0, "review": "For now, you can't do chromecast from Chrome on iOS.  You could however do it on Windows but the video is not smooth.If you are constantly on Youtube, Netflix, or Hulu, this is a product for you.", "verified": true, "helpfulness": "0/0", "author": "S. Leung \"self_taught_investor\""}, {"rating": 5.0, "review": "Came well packaged and quickly plus a discounted price. Included a HDMI extender, USB power cable, and power adapter plus. A set of instructions printed on box and on inserted paper were clear and easy to follow. Works beautifully. Even a person with beginner computer level should be able to install device and connect to TV.", "verified": true, "helpfulness": "0/0", "author": "Citywlkr \"Only put off until tomorrow what you are willing to die having left undone.' Pablo Picasso\""}]