[{"rating": 5.0, "review": "Works fine as far as I can tell.  Nice to have as it opens up more viewing options on the TV screen.", "verified": true, "helpfulness": "0/0", "author": "Emilie D \"Em\""}, {"rating": 4.0, "review": "Honestly, I really didn't know what to expect.  I bought this for my parents who really wanted something for their HBOGo.  I mis-read and thought that it by default supported Amazon Prime also.Firstly - I'm not as overly impressed with streaming videos from my computer.  Maybe I'm doing some wrong, but I am streaming FROM Google Chrome and the picture just isn't as crisp and the resolution is a little off by default.  It streams MUCH better from my phone or tablet and is truthfully very impressive with fabulous resolution with both Netflix and HBOGo (those are the only services we've really used).Secondly, you can make Amazon prime videos work, but you have to do the workaround for it and its not all that great (Silverlight isn't compatible, you have to disable it....see Google for easy instructions).The set up is really pretty easy.  You do have to have it plugged into a power source, so make sure you have an extra outlet for that.  The app is really easy to install on your tablets and phones and easily integrates in the apps since it appears the apps are already setup to cast.  For instance, on Netflix, you literally tap on the little icon and select your casting device.Battery life on your casting devices? Surprisingly on my GS4 - I can cast an entire movie and it took up MAYBE 10% of my battery life.  I was still able to do whatever on my phone while it was casting with no problems.I would recommend this with reservations - for your main tv that you use with your children?  Probably go for the Roku because it has a remote and the easy access. My kiddos can easily maneuver a Roku, but I wouldn't want them messing with everything involved for this.  If its a secondary unit that isn't your primary source for tv entertainment or you're on a tight budget and don't mind?  Then this is for you.", "verified": true, "helpfulness": "1/1", "author": "MrsK"}, {"rating": 5.0, "review": "First of all Kudos to Amazon for swift delivery.. As not keeping much of a expectation i just installed this baby and found marvelous.I would say this is must buy", "verified": true, "helpfulness": "0/0", "author": "Nowel"}, {"rating": 5.0, "review": "Easy to set up.Easy to control with my phone, or a PC.Super reasonably priced.This is by far the easiest way to get Netflix, YouTube and most internet video on to your TV (though sadly, Amazon Prime video isn't currently supported - but still).You really can't go wrong with this - nothing else to buy.  All you need is an existing WiFi setup in your house, one app download and that's pretty much it - plug it in, change the input to that HDMI channel, and the device will have you up and running in less than 5 minutes.That's not an exaggeration - 300 seconds or less.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Google nails it - simple, easy, portable. Could it connect to more apps? Yup. Am I happy with the clean way it works - even on (sic) Apple devices? Yup.", "verified": true, "helpfulness": "0/0", "author": "G. Kanuck \"gggForce\""}, {"rating": 5.0, "review": "I'm writing a review, but will anyone read it? A great product, far exceeding my expectations. I've heard use is down overall, but not from this end!", "verified": true, "helpfulness": "0/0", "author": "Lee Sin Yong \"creative accountant\""}, {"rating": 3.0, "review": "Good for the price. Does what it's advertised to do. Not the greatest gadget out there but ok for the price. Works for very little other than youtube. Other stuff available but requires subscription--like Netflix", "verified": true, "helpfulness": "0/0", "author": "R. Jerome"}, {"rating": 5.0, "review": "It is fun to use Chrome cast... The best thing is, it is supported unlike \"had excellent potential\" product Google TV.", "verified": true, "helpfulness": "0/0", "author": "GeePee"}, {"rating": 5.0, "review": "Better than apple TV, I literally only use this and don't pay for cable.  It's a more user/device-friendly wifi streaming tool :)", "verified": true, "helpfulness": "0/0", "author": "Kathy A. Tran"}, {"rating": 2.0, "review": "There are so many, much better streaming devices out there. The quality (not great) and steps involved, plus the fact that it needs to be plugged in (another cord to deal with) all added up to serious disappointment with this product.", "verified": true, "helpfulness": "0/0", "author": "Meredith A. Nelson"}]