[{"rating": 5.0, "review": "So happy with this product! Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Laura Elbert"}, {"rating": 4.0, "review": "I have had Fire TV for a few months now. Content is good and getting better. Plug and go preconfigured with Prime account was spot on.The system has some quirks. Playback can halt and blue screen. I have twice so far had to clear the unit. You might want to save this fix from Raghu. you might need it:You are now connected to Raghu from Amazon.comMe:After I select content the screen turns blue. It will revert to the picture screen saver after time out.Raghu:Hello, my name is Raghu. I'll certainly try to help regarding your concern.May I request you to elaborate the issue a little so that I can research this for you?Me:I get the home menu select a show to watch, Starts to launch show then blue screen.after a few minuits the picture slide show starts and displays fineRaghu:OkayIs this the issue with the Amazon Instant videos?Me:yesRaghu:OkayPlease try these steps on the FireTV to o clear app data:1. From the Home Screen, select \"Settings\".2. Select \"Applications,\" then \"Manage Applications\".3. Select \"Amazon Video\".4. Select \"Force Stop\" and then select \"Clear Data\".5. When prompted to \"Delete App Data\", select \"Clear Data\" again.Me:That seemed to work. this is the second time I had to clear data. Is amazon working on a fix for this issue?Raghu are you still with me?Raghu:yesYes, RobertIt might be made availabe by the next set of updates on the Fire TV*availableI am sorry about the inconvenience, you have had to face today.And I am glad we were able to solve this.:)Is there anything else I can help you with ?Me:No.Thanks for the helpRaghu:You're welcome, Robert . Thank you for contacting Amazon. Have a great day. :)System is back and running until the next time.  I hope Amazon fixes this issue.", "verified": true, "helpfulness": "5/5", "author": "BT Bob"}, {"rating": 5.0, "review": "After reading about the \"Amazon Fire TV\", I placed it in my Amazon wish list a few days ago.  Before I had a chance to purchase it, my son purchased it for me.  I already have the \"Apple TV\" streaming device, but I now think Apple has some stiff competition.", "verified": true, "helpfulness": "0/0", "author": "Char"}, {"rating": 5.0, "review": "Does it come with HBO", "verified": true, "helpfulness": "0/3", "author": "debbie"}, {"rating": 5.0, "review": "I bought this mainly so my son could easily Netflix on his room. Unit is super small, which is great, and is easy enough for my 8 yr old to run. My only concern is that the unit itself gets pretty warm sometimes. I have had no issues, but that does bother me a bit.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The only things I want is to somehow have the amazon TV link to my fios account so I can watch things for free (not free per se, but things I pay for via my verizon subscription)  instead of being asked to pay for true blood episodes or something when I already paid for with my hbo sub. I know hbo go is coming to amazon tv but the point still stands bc there are other networks like amc, tmc, syfy, hist, nat geo, cnn, nbc, etc...The other thing is I'd like voice command to be a little better like have it search apps,  but I kno that's a little bit of a technical hurdle. The other thing that would be nice is a narrower search filter, like if instead of action movies I could say \"prime eligible action movies\" or \"prime eligible starring leonardo dicaprio\"Would also be nice to have compatibility with google apps and more app freedom like the ouya. The amazon app store is eh and I gotta figure out if there is a way to get my google/android apps on my fire", "verified": true, "helpfulness": "0/0", "author": "Chris M."}, {"rating": 3.0, "review": "Like the device, but no Amazon Prime Music. Really do not understand how a device that launched in April and it's now July and. No app. Time to hook the roku back up to listen to my  amazon music!", "verified": true, "helpfulness": "1/1", "author": "Kevin \"reality\""}, {"rating": 5.0, "review": "If you have Amazon Prime I definitely recommend getting Amazon Fire TV.  I am absolutely loving it and it has so many features to it that I won't even go into details.  I love that you can just speak what you want and up it pops!  And I didn't have to teach it to learn my voice.  The commercials are true!  Ended up getting it as my gift from my Mother's Day gift card.  Ends up being a really great gift that I love and use all the time now.", "verified": true, "helpfulness": "0/0", "author": "Dubearry"}, {"rating": 4.0, "review": "It does not connect outside US", "verified": true, "helpfulness": "0/0", "author": "Adriana Gomez"}, {"rating": 4.0, "review": "Mostly favorable but way behind my Roku3.  Disappointed watchespn doesn't include Charter cable as all my other devices do, including my Kindle Fire HD.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]