[{"rating": 5.0, "review": "love it soo much!", "verified": true, "helpfulness": "0/0", "author": "Bipin Mathew"}, {"rating": 5.0, "review": "I ordered this for 23$ & it has been by far one of the wisest investments thus far. Very used friendly! The device is small and compact and even comes with an HDMI extender. AMAZING!", "verified": true, "helpfulness": "1/1", "author": "Cherie Clayton"}, {"rating": 5.0, "review": "If you are new to setting things up, just be patient.. It will get set up.. The key is -no matter how difficult this first process is for you, just deal with it, you will soon reap a good reward of enjoying it at such an affordable price The wait and anticipation is actually what makes it seem difficult and prone to making mistakes and frustration... I finally got chromecast after years of roku hd, 1 and 3,- yes 3 rokus. You have to get this as an alternative if you are just mirroring googlechrome and playing netfilx, pandora and others. It basically casts (broadcasts)a single tab which you like to the tv while doing other things on other tabs. so cool...I have a HTPC set up, which is multitasking on 2 monitors (surfing or working) and a tv for viewing movies or listening to music etc (3 monitors). This eliminates the need for a 3rd videocard or usb to vga/hdmi adapter in my case. The streaming of netflix and other apps from almost any device/tab/smartphone with this is so much a giveaway given its price compared to roku3 or roku streaming stick. I have yet to try other features if any like browsing local HDD/network content like music and videos, if this can do that this will be jackpot. I have given up with Roku3 on trying to play homevideos a while ago.", "verified": false, "helpfulness": "0/0", "author": "Donh"}, {"rating": 4.0, "review": "Works great.  Had a little hiccup in the beginning but need to connect the first time with a wireless device.  Wish it could stream in 1080p,  does (720p) and looks really good.  It can only get better. Thanks to Google and Amazon which offered a great price.Mine is connected to a AV receiver first and then decodes 5.1 etc.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Good product but still limited in functionality", "verified": true, "helpfulness": "0/0", "author": "Lona85 \"Diego Lonardoni\""}, {"rating": 4.0, "review": "One of the amazing things i every buy it!  Just simply plug to your HDMI port and ready!I SYNC my chromecaste with my iPhone and Notebook and works perfects, just the fact in notebook is a little more slow, but anyway.The reason for i bought to is the posibility to watch my videos stored on my notebook and i use PLEX Stream. works great!", "verified": true, "helpfulness": "0/0", "author": "Mauri CS."}, {"rating": 5.0, "review": "Love my Chromecasts. It makes my 4 year old TVs smarter! I can stream my digital collection of movies over the network, YouTube, Netflix, all from my laptop, phone tablet, desktop. It's incredible the uses I've found for this. It also takes the download and encoding load off my laptop and phone so the batteries aren't hardly touched with streaming. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Katano"}, {"rating": 5.0, "review": "Great product. Works exactly as advertised. Nice packaging, VERY easy instructions, no hiccups and everything works very nicely. Very well worth the money!", "verified": false, "helpfulness": "0/0", "author": "B Lee Kruegs"}, {"rating": 1.0, "review": "This is a worthless product!  Installation is a problem (it took me several hours to get it to work, since on initial startup it immediately launched an update program that hung up and required multiple restarts), the \"chromecasting\" either wouldn't start at all, would hang, or would work intermittently, THEN hang up and require restarting [always from the beginning of the program], and of course it won't work with certain types of hardware and software (on the latter score, Windows XP isn't supported).  The idea is pretty good (use your large TV screen to view internet-streamed content), but with the development of integrated systems, probably won't be useful for very long), but the implementation is very buggy.  I wouldn't recommend it unless you have particular interest or ability in modifying and debugging to make it work.", "verified": true, "helpfulness": "0/0", "author": "R. Moore"}, {"rating": 4.0, "review": "Just got this one today and the first thing I noticed,  the instructions manual book was missing from the box. :( not the end of the world,  but still,  just can't see why it wouldn't be included just like with any other cromecast package you buy directly from Google.Works fine so far, was easy to install. Get 4 ☆s for incomplete packaging.", "verified": true, "helpfulness": "0/0", "author": "Olga"}]