[{"rating": 5.0, "review": "Works perfect!!!!", "verified": true, "helpfulness": "0/0", "author": "Tre"}, {"rating": 5.0, "review": "Love the product! Super easy set up!", "verified": true, "helpfulness": "0/0", "author": "Marina Munguia"}, {"rating": 5.0, "review": "Bought this Chromecast as a gift after using one myself for a year.  Out of all the TV sticks I've experienced (roku, apple tv, google tv) - Chromecast has, by far, been the easiest to use and had the most flexible options, not to mention that its also the least expensive option.  Can be controlled by any cell phone (both android and iphone) on the same wifi network - huge amount of compaible appls, online content, and there's applications that will stream your own media for a variety of local server types.", "verified": true, "helpfulness": "0/0", "author": "J. Lin"}, {"rating": 5.0, "review": "The chromecast is my favorite new TV gadget. I've been using mine for a while now, but I am considering purchasing another for my home office. I am constantly casting things to my TV like my podcasts, music, youtube videos. and I litterally never touch the Blueray player anymore because I can just buy the movie on google Play and cast it to my TV much easier.  It's not too often that a piece of tech comes along and changes the way you live your life, but this certainly has.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Works great. Wish they would make more apps compatible with it", "verified": true, "helpfulness": "0/0", "author": "Byron McCoy"}, {"rating": 4.0, "review": "arrived as promised", "verified": true, "helpfulness": "0/0", "author": "D. Thompson"}, {"rating": 4.0, "review": "I use this all the time and it works great, sometimes if the WiFi is bad it buffers, but very rarely. Unfortunately you can't play any music to a TV that isn't bought from the Google play store, which kinda blows, otherwise awesome gadget for a low price, I recommend!", "verified": true, "helpfulness": "0/0", "author": "Coltrane Macaulay"}, {"rating": 5.0, "review": "great product!", "verified": true, "helpfulness": "0/0", "author": "Zachary Lunsford"}, {"rating": 1.0, "review": "so sad, I really had high hopes for this thing. But it doesn't work properly! The video will play for about 15 minutes (the longest I got out of it was 24 minutes) and then it just stops working, and I even bought the app for this thing where you can type in the website and strewn video from there , still it won't work it just freezes and that's it. And even when I try to restart the video and skip it to the point where it stopped, it's just showing a loading sign, but doesn't work. I'm extremely disappointed!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "works well no issue's", "verified": true, "helpfulness": "0/0", "author": "CADCAM \"mccormackamplification\""}]