[{"rating": 5.0, "review": "Works as advertised. Now I can easily watch multimedia content from my computer, tablet or phone on my TV.", "verified": true, "helpfulness": "0/0", "author": "Álvaro Amador"}, {"rating": 4.0, "review": "Supported apps always increasing, device is very stable.Set-up requires some use of common sense, but nothing that requires an Engineering degree to understand.A few features that hopefully are considered on the next iteration:Dual-channel WiFi 2.4Ghz and 5GhzSupport for 802.11ACSupport for BTA few features that can be added on the next firmware update:Custom Background Wallpapers and ScreensaverGreat for Plex, Youtube. The new Chromecast app update that also adds mirroring support is surprisingly useful.I would recommend to those who know what this device limitations are, expect too much and you will be disappointed,For roughly $35, the device easily pays for itself.", "verified": true, "helpfulness": "0/0", "author": "d0nat0"}, {"rating": 5.0, "review": "Love it. Keeps the kids busy and opens up You tube like your own personal MTV", "verified": true, "helpfulness": "0/0", "author": "SPG900T"}, {"rating": 4.0, "review": "Works great... would be nice to project entire screen, not just what's in the Google Chrome browser to it, though!", "verified": false, "helpfulness": "0/0", "author": "Clint C.L Roberts"}, {"rating": 3.0, "review": "Both, my wife and me own a Nexus 5. Chromecast works great with my phone, but it doesn't with my wife's. I tried resetting Chromecast and reinstalling app, but still the same... Specifically, mirroring is not working on her phone. Idk how to fix this issue.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Grijalva Od"}, {"rating": 1.0, "review": "I could not connect the Chromecast HDMI to my TV possibly because I own the modem.  My carrier is Comcast and it would be necessary for me to pay monthly rent to Comcast to get a new Modem from Comcast.", "verified": true, "helpfulness": "0/1", "author": "Krishnan Ramachandran"}, {"rating": 5.0, "review": "Works flawlessly, and as expected.  How great it is for you largely depends two things:1) your internet speed.  Below average speeds results in constant buffering and is unwatchable.2) your subscribed pay content:  It's a catch22.  With access to ESPN, HBOGO, Netflix, you will NEVER need cable tv.  However, you can access these apps ONLY if you have an login from your cable box.", "verified": true, "helpfulness": "0/0", "author": "Seattle"}, {"rating": 5.0, "review": "Streaming has never been easier... I know it will take a while to get some of my fave apps but right now its pretty solid no problems whatsoever!", "verified": true, "helpfulness": "0/0", "author": "Lswieckitay \"Lswieckitay\""}, {"rating": 5.0, "review": "Works great also helps if you download videostream for chrome and you can stream files from your computer to the chromecast less buffering.", "verified": true, "helpfulness": "0/0", "author": "mike2416"}, {"rating": 5.0, "review": "So far working like advertised. A++", "verified": true, "helpfulness": "0/0", "author": "Alexandria Lee"}]