[{"rating": 4.0, "review": "Does this work if you have a TV hooked up through a receiver for surround sound?  I just received my 30-day trial. hooked it up, saw it on my TV screen, but I can't find a way to hear audio out through my receiver.  Does this box only work if you're connected directly to a TV without a receiver?", "verified": true, "helpfulness": "0/1", "author": "Tom E."}, {"rating": 1.0, "review": "Unfortunately you can't give less than 1 star.  Brand new but doesn't work; remote not recognized and I couldn't scroll to my network; customer service very nice but for $100 bucks I think the product should function!  Get ChromeCast at $35, it's $75 less and even works!", "verified": true, "helpfulness": "1/9", "author": "clasrk"}, {"rating": 5.0, "review": "The best on the market, it does what it says. With amazon behind how can you go wrong?try it and be amazed", "verified": true, "helpfulness": "0/0", "author": "dorothy mosley"}, {"rating": 5.0, "review": "We were using a blue ray player to get on Amazon Prime and Netflix with just cable internet.  They both slowed down to a crawl.  We purchase a Amazon Fire TV box and now everything is back to normal.  We are happy again.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it! It makes TV a lot more fun and amazon prime and netflix a lot more accessible! And every time I look for the fire remote, I shout \"Gary Busey\"!  Everyone knows what I'm looking for! Best hundred bucks I've spent in a long time!", "verified": true, "helpfulness": "1/1", "author": "Broderick Morris \"BC Morris\""}, {"rating": 4.0, "review": "It's pretty cool, but the only advantage over a Roku is the voice search. Plus Roku has the small HDMI sticks which are great for TVs you move around, like the one bring out next to my hot tub.", "verified": true, "helpfulness": "0/0", "author": "Kevin J. Schmidt"}, {"rating": 5.0, "review": "I just ordered this on Friday, I just received it today one day later! Amazing. Took a minute to set up.Love the color and he sound. Impressive. Additionally the ability to see my pictures from the cloud in my big tv. Cool.", "verified": true, "helpfulness": "0/0", "author": "AM \"love my kindle\""}, {"rating": 5.0, "review": "I have fallen in love with it! It works perfect, and everything looks great, it's a joy to use. I would tell anyone to buy this. I love watching movies and this has made it so much better for me. I was getting a pain in my neck from sitting in front of my computer for hours. I now sit in the comfort of my sofa and watch everything on my flat screen TV.", "verified": true, "helpfulness": "0/0", "author": "Ellen Harris"}, {"rating": 1.0, "review": "i didn't like it needs improvement the a lot of competition out there and better products", "verified": true, "helpfulness": "0/0", "author": "outofsun"}, {"rating": 2.0, "review": "first of all the build quality is excellent, the problem with this device is the prime content is very confusing and limited. pay and free items are all together and most titles are pay. Not having HBO GO is a huge problem and one that stands out when comparing it to other devices. It seems like everything it does offer you can get on a smart tv so why do you need it? I got this as a free trial for being an amazon prime member and I sent it back then day after I got it. It just doesn't compare to the Apple TV.", "verified": true, "helpfulness": "3/5", "author": "Thundershots \"Bill\""}]