[{"rating": 5.0, "review": "Wish there was more free TV shows and movies but it overall like it", "verified": true, "helpfulness": "0/0", "author": "Sean Dehn"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Denise Martinez"}, {"rating": 5.0, "review": "It does everything it says it does. You don't even have to point the remote at the tv for it to work. And the voice search works wonderfully.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 5.0, "review": "Setup was easy ... product works as advertised ... and voice search blew me away!", "verified": true, "helpfulness": "0/0", "author": "Nicholas Androu"}, {"rating": 5.0, "review": "The best", "verified": true, "helpfulness": "0/0", "author": "Alaa A Alahmadi"}, {"rating": 1.0, "review": "the item did not work and i COULD NOT contact Amazon", "verified": true, "helpfulness": "1/2", "author": "Hockeefan"}, {"rating": 5.0, "review": "It is awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Sylvia Stephens"}, {"rating": 1.0, "review": "First I must say if you exclusively live in amazons garden of content, you will love it.I do not. Recently bought a movie on Amazon just to see the difference. On my Fire TV it works fine. On my phone it works fine. When I visit family who doesn't have a Fire TV, its worthless. All my content will be purchased on google play from now on. At least I can do something else with it.Have lots of android content from Google play? You should skip this.Have kids? Expect to either disable the device with pin codes or pay extra (monthly fee)  to provide parental controls that should be included to keep you sane.Parental controls even paid for are simplistic.You want to root you device you bought? Don't amazon will brick it to prevent this from happening. Yes,I said they will literally break your hardware via software to prevent you from adding yourself as a root user so you can add your purchased android content.Thank you for a walled garden. (Sarcasm) I hope this keeps someone else from making the same mistake I did in purchasing what otherwise could have been a great amazing device. Instead it's another port I have to switch between to see my android content. I will now have to choose where to buy content. I'll be buying where I can take it with me. Thanks amazon. Fail.", "verified": true, "helpfulness": "2/4", "author": "Zergor"}, {"rating": 5.0, "review": "The is is surely moneys worth spent. We are enjoying this so much and it is fast and easy to hook and and the sit back enjoy. Amazon Fire really rocks. You could kiss your cable goodbye.", "verified": true, "helpfulness": "0/0", "author": "Robin Robson"}, {"rating": 5.0, "review": "I purchased our Fire TV along with a year of Prime a couple of days before Christmas.It arrived quicker than I thought possible,given what time of year it was. I had it hooked up in 5 minutes, seriously. It immediately found our WiFi & I just ran an HDMI cable into our receiver/home theater. I would've bought something like this sooner but was concerned that I may not be able to easily integrate it into our system. Since we got our Fire TV 12 days ago,my wife has watched all of Downton Abby & we have started watching the Soprano's & Band of Brothers. These were shows we'd heard about but never watched. There are many others available included with Prime that we will get around to.Bottom line- I couldn't be more pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Nugene1 \"Nugene1\""}]