[{"rating": 5.0, "review": "I spend time to figured out finally after a little struggle to connect my moto g then ipad to hdmi.  Finally works and enjoy the espn.", "verified": true, "helpfulness": "0/0", "author": "ching on fok"}, {"rating": 5.0, "review": "Love it.  Wish there were more apps available with it right now.  I have three of them.  Nice to have if you don't have a smart TV", "verified": true, "helpfulness": "0/0", "author": "Nick Galante"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Matthew Gagnon"}, {"rating": 5.0, "review": "I have bought one for each of my tv's and use them everyday. Have not had any problems and it came at a good price.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Ignacio"}, {"rating": 3.0, "review": "I bought this before the Amazon TV stick came out in conjunction with the Roku device. It works to stream stuff from your phone or laptop to your TV. It works and the quality is great but honestly, it's just not worth it compared to the Amazon TV stick. I have to switch between 2 devices and if I would've known about the TV stick - I would've waited and just purchased that. If you already have a Roku device - then maybe go for this. I do think that it was really easy to set up and pretty user-friendly. I don't like that if I go to someone's house to try to use it I have to complete the entire set-up with their internet and then re-set up my internet back at home. It's kind of a pain", "verified": true, "helpfulness": "0/0", "author": "Molly Levine"}, {"rating": 5.0, "review": "this is one of the best assessories for the cell phone a must have", "verified": true, "helpfulness": "0/0", "author": "aldera love"}, {"rating": 5.0, "review": "love my chromecasts!", "verified": true, "helpfulness": "0/0", "author": "Kenneth Smith \"keny\""}, {"rating": 5.0, "review": "I love this product,  it allows my TV to do so much more than any other TV or there.  No if they could get Spotify to Cast that would be great,  but I grid Spoticast works fine for that.  Completely would recommend to anybody.", "verified": true, "helpfulness": "0/0", "author": "Andy Carley"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Daniel Ribeiro Holanda Lima"}]