[{"rating": 5.0, "review": "This was so simple to set up and I love it. Find a movie and hit the cast button, done!!", "verified": true, "helpfulness": "0/0", "author": "Margie Bell"}, {"rating": 4.0, "review": "Occasionally have issues trying to connect to it, otherwise love it.", "verified": true, "helpfulness": "0/0", "author": "Alex Petersen"}, {"rating": 5.0, "review": "This was easy to install and begin using.  I love this!  I can broadcast from my laptop and the application hides in the background so I can continue to use my laptop for work purposes and I don't even realize its running as a background app.", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 4.0, "review": "this is great for Netflix, not so great for amazon prime video, I have not tried it with youtube yet.", "verified": true, "helpfulness": "0/0", "author": "2052"}, {"rating": 1.0, "review": "Not as expected! This product was/is advertised to work in conjunction with our Comcast subscription. I have a fast computer and wifi connection yet video to the TV is less than acceptable, not to mention the audio is non-existent coming through the TV's internal speakers.  Who wants to watch video on the TV and listen to it on the computer speakers? Not me!! While this product worked fine for YouTube, that was not my reasoning for purchasing!  I am very disappointed in this product.  No recommendation from me, Google!", "verified": true, "helpfulness": "0/0", "author": "Sher-lynn"}, {"rating": 1.0, "review": "I have been trying to attempt to return this item due to defect. I had not used this item for a long time as it would not always project what I wanted to see on the screen. Then the other day I went to use it and was taking the Chromecast from the back of my tv and pulled it out and the wires were still inside the unit. I did not force this object into the television but it is obviously broken. No wonder it wasn't working. Unhappy and disappointed. What is more disappointing is the inability to exchange this item. I have pursued this here online but the system is locking me out on that. Defective is defective.", "verified": true, "helpfulness": "0/0", "author": "Cheri VH"}, {"rating": 1.0, "review": "after about fifth time it was used it stopped working. P.C. stated it was no longer connected.Four months old. About five or six hours use.", "verified": true, "helpfulness": "0/0", "author": "Joseph D. Elliott \"rvdriver\""}, {"rating": 5.0, "review": "Great value, works with iphone no problem.", "verified": true, "helpfulness": "0/0", "author": "2sidesof49"}, {"rating": 5.0, "review": "Nice!", "verified": true, "helpfulness": "0/0", "author": "Herica Regina Simões Muniz"}, {"rating": 4.0, "review": "Awesome device for streaming.  I cant give it a perfect rating since it doesnt have amazon instant (and possibly will never have).", "verified": true, "helpfulness": "0/0", "author": "Justin Co"}]