[{"rating": 4.0, "review": "I love it! If you don't have a smart TV, this will give your basic flat screen the capabilites of a Smart TV. I haven't tried the gaming features yet, but can't wait until I do.", "verified": true, "helpfulness": "0/0", "author": "h-townmobile"}, {"rating": 5.0, "review": "Easy set up and easy to use.  A lot of choices for tv shows and movies.  A great buy.", "verified": true, "helpfulness": "0/0", "author": "Jaye Z."}, {"rating": 3.0, "review": "Doesn't do much more than Playstation or Xbox. It has some different apps, but most are just designed to nickle and dime or advertise you to death. It does use substantially less electricity than my tower or game consoles to put internet programming, like Netflix and Amazon prime, on my TV. I did find 4 new apps I actually use so far. This was a gift for me so for free it is great! I do not know if I would ever actually find it desirable enough to purchase or not. If you have favorite apps you should research whether or not they are available on the fire and how they are rated. Many reviews I have read state that the apps here are inferior to the identical app for other equipment.", "verified": true, "helpfulness": "0/0", "author": "CARLTON R CROFT JR"}, {"rating": 5.0, "review": "Best decision ever to get this device! Love it and works flawlessly!", "verified": true, "helpfulness": "0/0", "author": "Devin Vaché"}, {"rating": 5.0, "review": "No less than excellent.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I have 3 Roku boxes and they outperform this considerably. The only thing I liked about this system is the remote. Since it does not use IR it's nice to have say under a blanket to change channels. Other than that i would not recommend this.Wi-fi is not as good as receiving as Roku is,", "verified": true, "helpfulness": "0/0", "author": "seulater"}, {"rating": 3.0, "review": "not enough intrusions,customer service bad, the cost of prime time etc.", "verified": true, "helpfulness": "0/0", "author": "kenneth staudenmayer"}, {"rating": 3.0, "review": "Satisfied", "verified": true, "helpfulness": "0/0", "author": "K Lee"}, {"rating": 5.0, "review": "Bought it for my son with the game controller and he loves it.  We have a ROKU3 and this is certainly as good if not better.  If you are a prime member it has a lot of advantages.  The games are pretty cool and the voice feature is really slick.  Set up was simple and it has performed flawlessly since.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Vicki Jones \"JIM JONES\""}]