[{"rating": 4.0, "review": "I do not have cable. I mostly watch content on youtube and netflix. Though streaming players like Roku did fulfill my need of allowing to stream from these websites onto the TV, I was not a big fan of the interface/remote that made it hard to search for stuff (or even type for that matter). The other solution was to connect a HDMI cable to my laptop/tablet which was ugly. Chromecast provides a neat solution for this especially for netflix/youtube for which it seems to be heavily optimized (the streaming starts off in the device and I have not had any issues like lag so far). But streaming from other websites using the chomecast  plugin is not smooth and I frequently see a lag (I think this is still an experimental feature). Also, streaming videos stored on the system is almost unusable. But I think for the price, I get awesome value from Netflix/youtube streaming.", "verified": true, "helpfulness": "0/0", "author": "Mamamya"}, {"rating": 5.0, "review": "I have Roku so I didn't think that I'd need it.  However, since it was so affordable, I got it anyway and boy am I glad that I did!  We cut our cable cord so we just used my Chromebook via page cast to watch the Super Bowl on our TV.  Set up was very easy and I did not have any problem casting YouTube or other webpages onto my TV.  Casting was super easy from my iPhone 5 as well.  You can't go wrong with this nifty gadget.", "verified": false, "helpfulness": "1/1", "author": "Helen S. Lam"}, {"rating": 5.0, "review": "Works great as advertised! I use it all the time now at home and for the price it's definitely worth it!!", "verified": true, "helpfulness": "0/0", "author": "Brian Ng"}, {"rating": 2.0, "review": "Don't fool your self . Get an Apple TV.Google Chromecast cannot cast from a CHROME browser from apple I-pad or I-phone devices This is not marketed!. You can only cast from a CHROME browser from a PC (Did not try MAC)", "verified": true, "helpfulness": "0/1", "author": "Romita"}, {"rating": 5.0, "review": "Casting from Chrome browser to TV from laptop is wonderful. I have samsung UN46F7500 tv. It has flickering screen issue when connected through HDMI cable. I am fed up contacting Samsung and changing HDMI cables. Chromecast works like charm doing wireless casting from chrome browser. Love this device.", "verified": true, "helpfulness": "0/0", "author": "Kishore Panduri"}, {"rating": 5.0, "review": "GET IT GET IT GET IT - don't even think about it- just do it.  It's far more amazing that what it seems.  We stream movies and it's great to put this on the tv.  No issues at all and I use my phones WIFI", "verified": true, "helpfulness": "0/0", "author": "WaukeeGirl"}, {"rating": 1.0, "review": "Disappointing! Much cheaper than Apple TV, but the proportional lower price is surely related to the limitations of this product. Would not buy it again.", "verified": true, "helpfulness": "0/0", "author": "Alex Pomilio"}, {"rating": 1.0, "review": "If you have any concern at all about your privacy, you should stay away from it. It collects your WiFi information, including the password, forces you to use Chrome browser. Technically it is an OK unit, not better of worse than the alternatives. While it may differ for person to person, for me privacy is very important so this unit is a NO NO. I returned it shortly after I received it.", "verified": true, "helpfulness": "0/2", "author": "cemkur \"cemkur\""}, {"rating": 5.0, "review": "I love my Chromecast, I stream from it constantly from my phone and sometimes from my work laptop when I want to view on a larger screen. I've recommended it to many people. I also love how small and easy to set up it is.", "verified": true, "helpfulness": "0/0", "author": "A. Kugali"}, {"rating": 5.0, "review": "Happy I purchased this item.  Makes it easy to watch movies, tv shows and more.  Easy setup and easy to use. High definition movies are great!!!", "verified": true, "helpfulness": "0/0", "author": "Mary Lou Alfonso"}]