[{"rating": 4.0, "review": "Great Product . The only reason its not getting a Five star rating is because its not compatible with all apps .", "verified": true, "helpfulness": "0/0", "author": "Romario Gelin"}, {"rating": 4.0, "review": "HD quality youtube videos and Netflix.  I only wish it worked with Amazon Prime movies or apps like CBS and ABC.  This could potentially replace on-demand from my cable provider if it did.", "verified": true, "helpfulness": "1/1", "author": "Michael D. Newcomer \"Photography Junkie\""}, {"rating": 5.0, "review": "this was a great way to get netflix and youtube videos on to the living room tv for friends and family.", "verified": true, "helpfulness": "0/0", "author": "User72"}, {"rating": 3.0, "review": "The commercial I seen for this device misled me. I thought it would work with your own personal media files. I may be wrong. maybe I just haven't figured it out. Im a plug and play kind of guy. I really don't have time to figure out entertainment related stuff. I still use it but am limited to Netflix.", "verified": true, "helpfulness": "1/1", "author": "Roman Roque"}, {"rating": 4.0, "review": "Works ok but when it's plugged in, my laptops can't get wifi service.Not sure if it's my router or what.TP-Link TL-WR1043ND using latest firmware from website.", "verified": true, "helpfulness": "0/0", "author": "Uipt"}, {"rating": 4.0, "review": "Using Plex, this has become a pretty solid $35 streaming media player. I've been able to throw any mkv or mp4 files at this thing without issue. Better streaming than my $99 WDTV player, wired or wireless, lol. Seriously, for $35, you really can't go wrong!", "verified": false, "helpfulness": "0/0", "author": "dustin garrett"}, {"rating": 4.0, "review": "For $35, it's hard to be disappointed by the Chromecast. It does a solid job of streaming content to older TVs, particularly with HBO Go (especially with Comcast actually able to stream). Having watched a few things through Netflix and HBO Go, the quality is more than serviceable and interfacing with the device is very easy.My only complaint is that since buying the Chromecast, my TV (a nearly 5 year old Samsung) will occasionally restart as soon as it's turned on, but otherwise works perfectly fine.For it's value, I highly recommend the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "P. Skelly"}, {"rating": 2.0, "review": "slow poor quality video.  Not sure why it has any good reviews. Although the setup and connection was very easy. Nothing like Roku", "verified": true, "helpfulness": "0/0", "author": "clouseau47b"}, {"rating": 3.0, "review": "Compared to hooking up the laptop directly with an HDMI cable, the Chromecast video quality was noticeably lower resolution.  Maybe I'll find another use for it, but for pulling movies from the laptop, I'm sticking with the cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is one of the easiest and most fulfilling tech items I have ever purchased. Easy, easy, EASY! Quality at its best", "verified": true, "helpfulness": "0/0", "author": "Steve"}]