[{"rating": 5.0, "review": "Awesome Game / Book AWESOME At the only way to go back and forth to go back and forth between a little bit more than one million dollars for me.", "verified": false, "helpfulness": "0/0", "author": "Tonia L \"Hello\""}, {"rating": 4.0, "review": "I have 4 roku's and a WDTV Live box so I know connected devices so trust me when I say quality and speed wise this Box is best of all of them...just not perfect ....well yet anyways.Pro's - Speed...voice interface...overall qualityCon's -- no MLB.TV... no NHL GameCenter Live...no slingbox slingcatcher...search doesn't include Netflix, crackle etc....going between channels interface not perfect yetWishlist -- besides the above \"con's\" I would love a sunday ticket app from DirecTV but no other connected device has this yet", "verified": true, "helpfulness": "1/1", "author": "Glenn J. Dioguardi"}, {"rating": 5.0, "review": "Our whole family loves the amazon fire tv, it has been used non stop since we received it!We have already have an xbox which yes we know we can use the apps on there but you cant listen to pandora while playing games and it does not give as much information.. Ive been watching all the reviews and people are giving 1 start reviews and 2 star reviews yet they have not even used it!The fire tv is super responsive, also has a great deal of apps and games to choose from. I never really used my prime movie's until now so I am actually getting what I paid for with my membership.The only negative feedback I have would be that they do need to update how you search through prime movies but I still think it deserves a 5 star review for all the features it has to offer and for the price it costs!", "verified": true, "helpfulness": "0/0", "author": "Danielle"}, {"rating": 5.0, "review": "The setup was so simple, less than five minutes. I was watching Amazons rival in high def no buffering, ever, then I switched to my Amazon Prime account. Using my voice I started looking for things to watch, after 6 test tries the voice found everything I uttered even when I tried to fool it, it found what I said in the fourth choice, amazing. I am amazed with everything about this product.The picture and sound is amazing. I have used most of the comparative boxes out there, this one is the very best. I recommend it to everyone.", "verified": true, "helpfulness": "1/1", "author": "Jeffrey"}, {"rating": 5.0, "review": "I keep reading reviews about what  Amazon Fire TV doesn't have. But I believe that it's great. It as everything I need . And the Video and the audio is far better then the other device's and i use'd them them all . Amazon Fire TV your number 1.", "verified": true, "helpfulness": "1/1", "author": "Albert Ferrell"}, {"rating": 4.0, "review": "Ordered the Fire TV as soon as it became available.  I also own an Apple TV version 2 which is jailbroken and has XBMC installed. The Fire TV is android and thus allows you to sideload various apps.  I was able to sideload XBMC and after trying a couple of versions it seems that 12.3 works the best for me. If you have an Android phone you can sideload apps very easily with a few free apps such as ES File Explorer and JS Terminial.  Google this for instructions. Since the box has only been only out a few weeks give it time before the devs start to really make this operate at its full potential. Obtaining root will also probably be available but I doubt if most users would use it. It is rumored that Apple will be soon offering a new Apple TV but who knows if it will be able to be jailbroken.  Their latest one isn't and its been a couple of years. I don't game so I can't comment on its gaming ability. Use it for entertainment.  Prime works flawlessly and use it for Pandora, Hulu, and Tunedin radio plus the before mentioned XBMC.  With its processor the response is fast.Overall for my useage I am very happy with it and over time its capabilities will only get better. Would actually give this 4.5 stars.", "verified": true, "helpfulness": "1/1", "author": "Sharkguy"}, {"rating": 5.0, "review": "Its the invention of the year.Much more easier than apple tv.The voice recognition is super and more reliable", "verified": true, "helpfulness": "1/1", "author": "aiman alali"}, {"rating": 2.0, "review": "Why would Amazon use a crazy idiot to pitch someone as cool as this.  Is it meant to be saying even a wild-eyed fool can use this technology?  Seriously, I would think twice about using anything that a flake like Gary Busey endorses or promotes.", "verified": false, "helpfulness": "3/18", "author": "Toy Guy \"Toy Pro\""}, {"rating": 4.0, "review": "fire T.V.is a good investment for better t.v..i am sure more is coming.at this time ,I don't have my music cloud on the system,there is no app. for it.amazon has a great idea.like I said its going to get better.when the games start coming it will be the system to have.gets 4 stars til oi can get my music on fire T.V.money spent well.i am enjoying fire T.V.", "verified": true, "helpfulness": "1/1", "author": "fred j."}, {"rating": 5.0, "review": "Let me preface this review by saying, I already own an xbox one and a ps4.  I picked this up knowing that it does the same things that both of them do, but I'm a tech nerd and need to have every device.This device is definitely not as powerful as either of the current consoles, but at $99 its the best value of the 3 options.  The streaming services are unbelievable, and the best feature is the voice search.  Say \"Chuck Norris\" into the remote, which has probably the best speech recognition I've seen to date, and instantly receive a list of all of his titles.  Great gift for a non tech savvy parent who you want to give access to the video streaming to.  There's even a great little 4 minute video tutorial on how to use the device for first time users.  My mom, who can't figure out how to text message on her HTC is already using this with ease.  The best part, is the voice recognition is stored and improved via the cloud, so your future amazon device purchases will benefit from your time talking into the remote of the firetv.  I give this 5 stars.", "verified": true, "helpfulness": "5/5", "author": "JohnnyMac"}]