[{"rating": 5.0, "review": "I am so happy with my Amazon Fire, I can watch my favorite shows at my convenience. I also have many movie, concerts and other choices I am thrilled with.", "verified": true, "helpfulness": "0/1", "author": "Gwen Hatcher"}, {"rating": 4.0, "review": "I'm still learning about it.  There are too many things to do before this one.  Love being able to put my feet up at the end of the day, which is about 2:00 a.m. for me, and be able to watch a good mystery.  this device is so far beyond Roku and NetTV ( which is a piece of crap).", "verified": true, "helpfulness": "1/1", "author": "Ladidot"}, {"rating": 1.0, "review": "The Amazon Fire was able to connect with my \"extended range\" WiFi adapter, but it would not recognize nor accept my WiFi router's password. So I disconnected the range extender, and tried several time to get the Amazon Fire to connect to my regular WiFi signal, even while standing right next to the WiFi router, but to no avail. I was really disappointed because I have 2 Apple iPads, 2 iPhones, an iPod Touch, both a desktop PC and a laptop, a wireless printer and 3 Blu-ray DVD players, all of which use my home WiFi network without a problem. So what's up with the Amazon Fire?", "verified": true, "helpfulness": "6/9", "author": "Ma Zoan"}, {"rating": 3.0, "review": "Got Fire installed (easy) and all Amazon video was down, service outage. Another service outage yesterday. That's 2 in 1 week.No Aereo. Good. Not great.", "verified": true, "helpfulness": "0/1", "author": "william mansfield"}, {"rating": 5.0, "review": "Excellent product. Easy to use. Install was simple. Priced right. Great way to access the Amazon library on your TV.", "verified": true, "helpfulness": "2/2", "author": "Criticalobserver"}, {"rating": 5.0, "review": "I got this over the weekend.  Solved several problems in my home.  Moving boxes and undoing wires all gone.  I had no idea something like this already existed.  Met a rep from Amazon at Best Buy.  This box saved me money.  I am not real tech savy but I was able to install this baby with no problems.  I highly recommend this to people!!", "verified": false, "helpfulness": "2/2", "author": "Patricia Fly"}, {"rating": 2.0, "review": "For some reason, this thing just had connectivity issues with my network - the same network that works fine for my Roku, TiVo and Apple TV.  I had planned to replace the Roku as I liked the idea of the search function, but if it doesn't connect, more efficient searches aren't really that helpful.  I ended up returning it and hooking the Roku back up.", "verified": true, "helpfulness": "2/5", "author": "KimberReads"}, {"rating": 5.0, "review": "Have had RCA and Roku and this beats both of them out of the water. There are so many options I am still finding them. Can't beat the price either, particularly if you have prime. Together they are a great package, and much cheaper than cable or satellite. Very happy with my purchase", "verified": true, "helpfulness": "1/1", "author": "shootmupintx \"Veta Jackson\""}, {"rating": 2.0, "review": "The Amazon Fire TV box and remote was fine, except it did not meet my television specifications, really needed a digital to analog converter box.", "verified": true, "helpfulness": "1/5", "author": "TehillahYaa'el \"Much_Wisdom\""}, {"rating": 4.0, "review": "This media streaming box is excellent and with a few improvements will be the #1 streaming media player on the market. It is very fast (faster than Roku3) and now here is my full review. It is black, small, slim and sexy, the remote is slim and fits perfectly in the palm of your hand, very comfortable, it is 1080P and is compatible with 720P, excellent picture quality, It has quite a few apps and of course it has Netflix, Amazon Prime, Hulu Plus, Crackle and Youtube (which all play very, very well) and HBO Go is coming very soon, there are many more apps, not as many as Roku3, but that will improve soon, it has VOICE SEARCH, which will search Amazon Prime and some of Hulu plus, so far that is it for Voice Searching, it works really great with your voice through the remote controller (i hope they extend the search to all apps), It plays games (better games than Roku3) which looks great, also Amazon has its own Game Company and has released its first game (Sev Zero) on The Amazon Fire TV, it is in High Definition and is multi-player and there are also free games, even for $1.00, also there are many, many more games on the way, it has a game controller just for the Amazon Fire TV, it is a $40.00 purchase, i feel it is too expensive (i use a XBOX 360 wired controller in the USB slot (you must enable \"Developer Options\" in the settings), so far it works fine) There are 2 things it needs, #1. storage is a problem right now, with only 8GB of storage (5.49 useable) i am already out of room to download anything else, a HDD would be wonderful and would mean unlimited space to store apps and games. ( i am sure Amazon is on top of this) #2. there must be a headphone jack on the remote controller for private listening when everyone is asleep. (sounds like a new Amazon Fire TV Remote 2 for private listening, i would buy it) I must admit i do fine myself now using The Amazon Fire TV box over my Roku3 and if Amazon bring the things i mentioned in my review to the Fire TV, this will be the only streaming box i will use. I do recommend this item. Thanks", "verified": true, "helpfulness": "2/3", "author": "Norris G."}]