[{"rating": 1.0, "review": "NOT WORTH A DAM WOULD NOT BUY A CASE FOR 25CENTS", "verified": true, "helpfulness": "0/2", "author": "Gary R Swearingen"}, {"rating": 1.0, "review": "Cannot get it to work with our wireless network. Tried all the troubleshooting and still nada. Also not compatible with windows 8.1 (but what is frankly). Sending back for an amazon firestick that uses a remote - much easier.", "verified": true, "helpfulness": "0/1", "author": "Casey Daniels"}, {"rating": 5.0, "review": "very cool way to stream to a not smart tv", "verified": true, "helpfulness": "0/0", "author": "Eugene"}, {"rating": 5.0, "review": "Best investment I ever made. I grab my tablet and can stream just about anything to my tv. Kids love it when we pop on youtube. HBO Go, Showtime and many other applications are using chromecast. You can stream just about any web video.", "verified": true, "helpfulness": "0/0", "author": "Ramesh L."}, {"rating": 5.0, "review": "I love this device! I bought it to watch HGTV since I don't have cable or satelite. I just have an antenna in my attic. So I stream shows that I like from my phone, tablet, laptop and desktop computers. I'm going to buy another one for another TV since I have been moving it back and forth between 2 television sets. It allows you to cast anything you are watching on Chrome to your television set. And even if you have an older TV without HDMI ports, you can go to youtube and watch a video to show you how to use it on those. You would have to also purchase an HDMI2AV converter to use it on an old tube type television.", "verified": false, "helpfulness": "0/0", "author": "Jmetroj \"Jmetroj\""}, {"rating": 4.0, "review": "As well as expected!", "verified": true, "helpfulness": "0/1", "author": "Mary Grace V David"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/1", "author": "preta"}, {"rating": 5.0, "review": "Must have for any young adult's entertainment center! It's so great for parties.", "verified": true, "helpfulness": "0/1", "author": "Will"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "Ben Coates"}, {"rating": 5.0, "review": "I received my Google Chromecast in the mail and it is fantastic! the versatility of how to plug it in along with extra extensions was very helpful as my TV is mounted on the wall with very little space to add cords. The setup of the Chromecast is very quick and easy with simple step by step instructions right on your screen.  Once set up, streaming has been flawless!  Best investment yet!", "verified": true, "helpfulness": "0/0", "author": "Lindsay Yourist"}]