[{"rating": 4.0, "review": "I use this all the damn time for my Google Play Music. I would like for HBO Go to be supported. Koush is doing some awesome work with this and I expect him to single-handedly make this an awesome accessory!", "verified": true, "helpfulness": "1/1", "author": "Aaron Tinsley"}, {"rating": 5.0, "review": "This dongle plugs into my HDMI port and is powered by an on board USB port I have on my TV. Setup was simple: Downloaded the chromecast app to my phone, connected it with the ChromeCast, and input my information. Setup time was only 2 minutes total. After that, I was able to stream Google Music, Movies, Netflix and Youtube all to my TV. For $35, you really can't go wrong with this.The selection of apps that work with it is quite limited for the time being, but developers are already doing great things with it so the app base should expand in no time. (For those with rooted phones, CyanogenMod ROMS already allow you to stream local content from your phone and ChromeCast your photos and videos.)", "verified": true, "helpfulness": "3/4", "author": "Theledman"}, {"rating": 5.0, "review": "For the price and size this device is hard to not get.  The amount of apps that are currently available to use with the chromecast is very limited, (Netflix, YouTube, and Play Movies) but I see big things for it in the future. Also the clarity is amazing.  It puts out full HD (1080p) for Netflix, on my blu ray player Netflix is only outputting 720p.  YouTube it varies of the quality of the video but still nice its nice to just put the video you want to watch quick on your tv.  Set up is really simple the device for the most part does all the work.  I haven’t rented a movie from Google play yet but I may in the future. All around this is a great device that looks to have a bright future.", "verified": true, "helpfulness": "1/1", "author": "Corey Quackenbush"}, {"rating": 5.0, "review": "It took me less then 5 minutes to set up.  And when I say set up I plugged it in and it told me to go to a website.  I went to the website and put in the code that was on my TV.  Then, without any effort on our part both Kindles, three Cellphones and one IPad all had little Icons added to YouTube and Netflix to start a \"Cast\" to our TV.  Our kids already knew how to get to Netflix on the kindle and I just showed them where the cast icon was and it went straight to the TV.  Netflix and YouTube both work perfectly.  However, HBOGO while in the chrome browser had some lag and the sound got out of sync.  Of course HBOGO doesn't have the app for it yet so hopefully that comes in the future.AMAZING product.  Were canceling cable..", "verified": true, "helpfulness": "1/1", "author": "Ryan Chastain"}, {"rating": 5.0, "review": "one of the best google product designed.love it, small, user-friendly, easy to setup.two issues i can see...one you need a very stable WiFi connection especially for video streaming.two it's you require to power the device either via your TV USB port if you have one if not, you have to have use the AC adapter with the USB cable to power it.other than those minor issues, this device it's probably one of the few must have items at home!", "verified": true, "helpfulness": "0/0", "author": "K. Leung \"Harry\""}, {"rating": 5.0, "review": "You can control Netflix or youtube from a laptop or tablet.  I have a PC with Windows 7 and an IPAD with the latest IOS both work well.  Also you can stream from the Chrome browser services like Bloomberg live.  The only tricky part is making sure to download Google's Chrome browser.  For my setup I plugged Chromecast into an HDMI port on my TV and plugged the power cord into a UBB port also on my TV.  There is a 110 volt adaptor included if you do not have a USB port for power.  I use the wireless internet service in my house.  The device take the video information directly from your wifi.  In my situation the video was greatly improved to HD instead of the video capability of the PC I had previously used which was connected by video and audio cable.  This is a step up from using a PC or a set top box.  The price is great too.", "verified": true, "helpfulness": "0/0", "author": "Floyd E. Mason"}, {"rating": 5.0, "review": "Netflix and youtube look great. Massive improvement over the 360's interface. At ~$11 with the Netflix rebate, it was a steal. I'm looking forward to amazon instant, pandora and whatever else is coming.", "verified": true, "helpfulness": "0/0", "author": "A. Bell"}, {"rating": 4.0, "review": "To my eye the picture quality on Netflix is a step up from my Vizio blueray version of Netflix AND I love that it's much easier to choose and then \"project a movie or show to watch from my tablet, phone, desktop or laptop.\"NOW if Amazon (instant) Video would support it, that would be great.Right now, I might find a movie to rent on Amazon, but then I actually go and rent it from (shudder) Google Play, simply because Google Movie/Play naturally supports Google Chromecast (duh)... Prices and availability seem to match...If the programing (geek) APIs are truly open, should be a snap... for the wizards at Amazon to do and get some of my business back from Google Play!I got mine with the $24 e-voucher for Netflix - I would have bought on Amazon, but they were out by the time I learned about this super little gadget...", "verified": false, "helpfulness": "0/0", "author": "Bob Teatow \"Bob Teatow\""}, {"rating": 5.0, "review": "Pro's-  Pretty easy to install  -  Lets you mirror just about anything from a Chrome browser window.  -  You can sync any android device or anything that has Chromecast support  (i.e.  Apple products with chrome)  -  Has a support from netflix and youtube.  - the price! there are no solutions like this for the money. flat out.Con's- not fully HD, does up to 720p, but for sake of streaming non Youtube and Netflix windows you have to turn the resolution down to 480pnetflix can lag a bit Here a cool trick/tip to get around using chrome cast from a computer in another room", "verified": true, "helpfulness": "0/0", "author": "Honest Dave"}, {"rating": 5.0, "review": "It's quick and easy to setup and I can't wait for developers to put this great product to use. For the price, can't be beat!", "verified": true, "helpfulness": "0/0", "author": "Kevin Kelly"}]