[{"rating": 4.0, "review": "*see update below first review*Now don't get me wrong I am impressed with the product that has been made here. But due to things I misunderstood when researching it I came to find out a few things that upset me for not researching enough (I usually spend DAYS researching a product before I buy it but not this time) and for Google not doing enough on their end to ensure this was a home run. I thought the supported applications for the Chromecast would install on the device and you only used your android devices to access it to control it. Now I know what your going to say \"but it didn't list an internal memory\" and you'd be right. Because the information page for this seems rather slim and needing of more info (or removal of misleading info, research more you'll find I'm not the first nor the last person to be mislead by their product page) I made that mistake you shouldn't in gadgets and assumed. SO when they talk about supported applications what they really mean is the application has to be installed on your handheld device and the developer has to include the option to turn on the casting ability from within their application on your handheld device. Now I have a NAS filled with media, music and pictures and the product pages for this device show PLEX as an supported application, well that's great I thought cause I can use that for DLNA right? Well even though my NAS can get PLEX for free and my Smart TV's can get it for free it's $4.99 to get it to work on the Chromecast, also due to the fact that the applications are on your android device that means you have to repurchase the application for any other android device that is someone else's account (like my wife's tablet and phone). Also the product page shows you that you can use the chrome browser to do web surfing on the TV. Once again I said GREAT! And once again I was disappointed to find out that the Mobile Chrome Browser is NOT supported for Chromecast! Wait a minute didn't Google make this device and already put in Chromecast options into their other programs like YouTube and Google Music? Well that's a yes on both questions so the only question left is why didn't they do their mobile browser as well? Your guess is as good as mine! Now I downloaded the Pandora radio application from within the Chromecast program and my wife already had it on her phone. So my application had the cast option but her's did not. So we checked her Google store and updated the application. Checked it again and still the option was missing! Odd right? Uninstalled it from her device, had her download it from the Chromecast application and this time she had the cast option. That's something to keep in mind if you can't find the option. So i bought this for a 40 inch LCD TV in our bedroom that does not need to be replaced but was purchased before Smart TV's so even though my living room and even the kids room has a Smart TV that can stream our content from the house NAS we couldn't so this seemed like a great solution. Should Google work at fixing the device so things like web browsing from your handheld devices to the Chromecast and find a way to support/encourage other application makers to support casting and find a way to make it so if I buy the application to support the Chromecast that it need not be re-bought for all Google accounts (each Chromecast has it's own unique identifier so really this shouldn't be hard) then this could surely be a great option. Until that day there are still other options out there that work as well or better abet a bit more costly though. I would have personally held off buying had I know all this upfront but I am impressed enough to keep it instead of returning it. Here's hoping that improvements are forthcoming. Like it, love it or leave it that's just my two cents.*update 06/26*With Google's announced updates to chrome I expect to see better improvements from functionality. Biggest update being that you will directly connect to the device from your phone or tablet and no longer require a router to use it. My NAS was made by syncology and they did put out apps days after I got the chromecast to stream to it without costing me a dime. I found this to be a much better solution than using Plex. This device is getting better with the new found support and updates from Google but it will be limited vs a roku device and I'm OK with that.", "verified": false, "helpfulness": "1/1", "author": "B. Smith"}, {"rating": 3.0, "review": "The unit works, picture is good. The app driver is a little crappy but it gets the job done. Has problem with reconnects.Example, watching tv from your tablet in bed. Fall asleep with the Netflix app running and TV sleep timer on. Tv Turns off and the show ends in the background. Next night you have to restart the chromecast two to three times before any device can stream to it. You get error 16001.I don't hate it. But I don't recommend it either. Spend the extra $40 on a low end Roku. You will be happier.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 2.0, "review": "The content you can see is fed to you from Google/YouTube/etc. From what I can tell you have to go to a Chromecast site that offers up what they want. Not what you necessarily want.", "verified": true, "helpfulness": "0/0", "author": "Steve Modifer"}, {"rating": 5.0, "review": "Very easy to install and works great. No complicated instruction. I have told many people how great it is for u tube and HBO to go on normal television.", "verified": true, "helpfulness": "0/0", "author": "Kevin Buchholz"}, {"rating": 1.0, "review": "On the design-side, I had general concerns about the requirement to start things from a phone or computer.  For $30, I was willing to give that a try though.  My goal was to make Netflix available on a secondary TV that has no streaming capabilities.I consider myself a power-user (most would say expert) in consumer electronics and in home networks - having been an early/mid adopter of such devices for 2 decades.  My experience with trying to get this device to work was horrible.  After 7 factory resets, verifying my router had it's latest firmware, and dozens of attempts to set up device I have packed it up and it's going back.  Any self-respecting device should not be this hard to make work.Is it possible that I got a lemon? Yes....however if I got a lemon, then A LOT of people have also gotten a lemon (search for:  chromecast + (\"timeout\" or \"can't connect to wifi\" or \"cannot access internet\").  There are thousands of posts on these topics - ranging from new setups to people that had the thing working for weeks or months and then all of a sudden they are dead in their tracks.  Through the different phases of my troubleshooting, I saw all of those...When I first got the device, I plugged in the USB port and plugged it into my TV.  On my first attempt, I made it through the workflow to where it identified that I was connected to \"my\" chromecast (verify the code you see on the screen) and then it couldn't connect to my wifi at all.  This eventually ended after a factory reset of the device...2nd attempt eventually appeared to work.  I got it connected to my wifi, it updated the firmware, I tried netflix then got the timeout error.  I re-tried and successfully got Netfix to stream from my android phone.  I then tried to change to a new movie and then I could no longer connect to it.  I restarted my phone, restarted my router (broke the streamed movie), Restarted the chromecast - nothing worked.  I couldn't even see the device anymore (even though it claimed a DHCP address from my router and claimed to be connected).  Only choice was to perform another factory reset...I set it up a 3rd time, now I am able to connect to my Wifi, but it can not connect to the internet.  Power-off reset?  Didn't work.  After about a dozen attempts...factory reset.4th time?  Same results.  Another factory reset (it worked once, right?)5th, 6th, 7th time?  Same results.  Could see and connect to wifi, but nothing could make it see the internet.  I tried the setup procedure from my phone and my laptop - multiple times each.  I could get to the internet on any of the other devices on my network, just not this one.So now it is going back.  I know it's tempting to pay $30 and get a streaming device for the basic needs - resist that urge!  It's clear that this device is not ready for \"prime time\".", "verified": true, "helpfulness": "1/1", "author": "Paxton"}, {"rating": 2.0, "review": "This can just stream Youtube videos from your iphone or ipad to tv which any streaming player does..I would go for Netgear Neo player or Roku..", "verified": true, "helpfulness": "0/0", "author": "Mohith Katapady"}, {"rating": 1.0, "review": "This thing is a waste. I really wanted to like it, but most of the time it refuses to connect. When it does connect, it cuts off mid-show (Netflix) and then takes 20 minutes of fiddling with the cast app to \"reconnect me.\" Not really worth the frustration. I will stick with my Xbox. I have changed my network settings and done followed all the suggestions. At the end of the day, I shouldn't have to work this hard to get this thing up and running when a Playstation, Xbox, Wii, hell, even my crappy blu-ray, can connect and stream without going through all this nonsense. Glad I bought it on sale. . .", "verified": true, "helpfulness": "0/0", "author": "The Forester"}, {"rating": 2.0, "review": "My Netgear modem model is not compatible with Chromecast.  My tablet shows Chromecast is connected, but the tv screen display shows no connection.", "verified": true, "helpfulness": "0/0", "author": "Janice Bunn"}, {"rating": 4.0, "review": "This is one of those simple items that revolutionizes TV.  We don't have cable and rely on Netflix and over the air signals.  I used to run Netflix through our XBOX, which requires a membership to XBOX live ($60/year).  I now can get Netflix directly through the chromecast to my TV, and can avoid using the XBOX altogether.  It's cool to be able to stream youtube, etc, but we don't use it for that function.  Google needs to get onboard with other TV streaming services such as amazon prime to earn my 5th star.", "verified": true, "helpfulness": "1/1", "author": "Brian"}, {"rating": 5.0, "review": "Do you want and Apple TV but would rather spend $65 less for something that will do almost all the same things? You need this product attached to every television you own.", "verified": true, "helpfulness": "0/1", "author": "Kevin Daughtrey"}]