[{"rating": 5.0, "review": "This is a great product for the techie people in your life. My son-in-law is very happy with the product.  Its was a Christmas gift last year and they use it every day and is very very happy with the product.", "verified": true, "helpfulness": "0/0", "author": "Kathy Yousse"}, {"rating": 5.0, "review": "Got it in it's awesome packaging, plugged it in and enjoying it since. The picture mode when not using is great. You guys picked out some awesome picture, love just watching that.", "verified": true, "helpfulness": "0/1", "author": "Bear"}, {"rating": 4.0, "review": "Chromcast is Great! Every now and then I have some streaming issues related to my internet services.", "verified": true, "helpfulness": "0/0", "author": "Erik M. Hicks"}, {"rating": 3.0, "review": "A lot of problems I needed to reset everytime to use.", "verified": true, "helpfulness": "0/0", "author": "Mezyad Mutlaq AlMasoud"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Gerald Harbour"}, {"rating": 5.0, "review": "Great product.  My wife and I enjoyed it from the day we plugged it in.", "verified": true, "helpfulness": "0/0", "author": "JW"}, {"rating": 5.0, "review": "Best thing I have ever bought. You can't be the price for everything this does", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Dennison"}, {"rating": 5.0, "review": "This is a great little gadget.  Works great.  High quality.", "verified": true, "helpfulness": "0/0", "author": "Lariat"}, {"rating": 3.0, "review": "I am a little disappointed with this product but it still has potential in the future.  For the price it's worth trying out.  Very easy install, great screen resolution.  My only issue is that it can't play your itunes library w/o a 3rd party app.  Google needs to add more things to watch.  Becasue if y ou want to watch anything besides youtube video' you need to pay for them...(HBO, NETFLIX ETC.)  But for the price it was wortha try and hope in the future Google adds more platforms.", "verified": true, "helpfulness": "0/0", "author": "dianne smith"}, {"rating": 3.0, "review": "I was really trying to find a device that would mirror my computer screen on the TV.  While this device works okay it is too limited on which media sources it will play on the TV.  I was just hopeing it would do more.  I think I'll stick with an HDMI connection directly from the output of my computer.", "verified": true, "helpfulness": "0/0", "author": "Mollie B"}]