[{"rating": 4.0, "review": "Neat little gadget. Main purpose was to stream my local media library to the TV wirelessly, and that worked well. However, when I saw the amount other apps and abilities it has, It becomes disappointing that one does not live in North America.Bearing in mind that it did what i wanted it to very well, the main drawback for it is I guess you cannot expect any more content for this gadget. The Nexus Player has been announced, and Chromecast will probably be forgotten by developers very very soon, and by users soon after.", "verified": true, "helpfulness": "0/0", "author": "Danielius"}, {"rating": 5.0, "review": "Works great! the 3rd party apps that you can download are great as well. Only thing is that streaming from PC is a little laggy otherwise incredibly easy setup and use.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "This was $39 well spent. It take online courses and this really makes watching the lectures a pleasure. Notebooks have their place but the 16:9 screen just does not have the real estate a business device needs.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Almost everything about it is great, the ease of setup, the streaming quality and the ability to queue up videos from multiple devices. My only gripe is that I cannot play local files without the help of a third-party app. C'mon, Google, step up your game.", "verified": true, "helpfulness": "0/0", "author": "The Flying Fishies"}, {"rating": 5.0, "review": "Love em. Bought them for all three of my tvs. They work very well.", "verified": true, "helpfulness": "0/0", "author": "Jared P McGregor"}, {"rating": 5.0, "review": "Yes it did so usefull", "verified": true, "helpfulness": "0/0", "author": "paulo142"}, {"rating": 5.0, "review": "Bought this for 16 year old grandson.he loves it.", "verified": true, "helpfulness": "0/0", "author": "jacqueline appleton"}, {"rating": 4.0, "review": "I have used the Chromecast for a few days and have been pretty happy with it so far. We have a multi-OS household and a variety of streaming devices including Apple TV and Roku. If you have an Android supported device, the Chromecast is a terrific value. My LG G2 is on the supported list which gives me one benefit that other devices in my household do not posess. I can mirror my screen to Chromecast. This gives me an ease of use and allows a greater variety of content. It's easy to view pictures and videos without the need for special apps. When using a 3rd gen iPad or even the new iPhone 5s, I don't see the mirror feature.Though mirroring is nice, it negates one of the best uses for Chromecast. That's the ability to let Chromecast fetch the content itself. You use an app like netflix on your phone or tablet, choose the content and select cast as opposed to local viewing. That free's up your phone to do other things while you watch. You can leave and let the video play by itself. Though not quite as robust as AppleTV or Roku, if your needs are limited to the supported Chromecast apps, it's a great value and less obtrusive as a device since it just plugs into an HDMI port.The only extra wire you'll need is a power chord which though supplied with the hardware is adds a bit of clutter since it needs to be plugged into a powered usb source. If your TV doesn't have a usb plug for power you can use the supplied wall adapter.", "verified": true, "helpfulness": "0/0", "author": "Jim Lagraff \"MiffBuster\""}, {"rating": 5.0, "review": "Great product. Mirrors content from my computer excellently.", "verified": true, "helpfulness": "0/0", "author": "Mike Johnson"}, {"rating": 4.0, "review": "Easy to use, plug and play. Makes watching Netflix and YouTube videos on my TV that much easier. The real seller for me though was the free two months of Netflix included when I bought it and the ability to cast any tab I could open in Chrome. It falls a little short on the Chrome casting as I can't reliably get this to work with fulls screen video, but it works great for everything else. The screen saver like photos displayed on your TV when it's not being used are also quite nice.", "verified": true, "helpfulness": "0/0", "author": "Ethan Nusbaum"}]