[{"rating": 4.0, "review": "Great features but here are my gripes:-Sometimes does not connect to wifi and/or phone-Not very smooth when using my phone (Note 3)-Will disconnect from my phone during a google play movie, and I cant pause the movie until the connection is reestablished.Other then that, ITS AWESOME", "verified": true, "helpfulness": "1/1", "author": "Slick"}, {"rating": 5.0, "review": "With my cable company now scrambling all of its channels, I was faced with the option of renting a second set-top box in order to make my bedroom TV functional. Since I don't use that television a lot, I couldn't see paying a monthly fee to make that happen. Now I can watch Netflix and HBO Go--both of which I already pay for--on the spare TV for the cost of several months of set-top box rental. And setup took less than five minutes.", "verified": true, "helpfulness": "1/1", "author": "Ken Helms"}, {"rating": 3.0, "review": "It is really cool how you can wirelessly (and seamlessly) stream to your TV the way Chromecast allows you too....BUT ....Basically the only thing you get is HBOGO & Netflix?  What kind of crap is that?I wouldn't recommend this if you're using internet as a substitute for cable, and you want to watch more than just HBOGO & Netflix.", "verified": true, "helpfulness": "0/2", "author": "Spencer Williams"}, {"rating": 2.0, "review": "I was excited to get the Chromecast and connect it up to my JVC TV. The first application I tried was Netflix. It seemed to work well. This is, however, where the trouble started for me though. EVERY application I tried other than Netlfix has severe audio chop. I am not sure what the cause is, but the fact I can only use one application successfully with my JVC TV has me giving this only two stars.", "verified": true, "helpfulness": "1/4", "author": "Snyperx"}, {"rating": 5.0, "review": "I have only had issues with the Chromecast when my wireless network was the cause of the issue.  Can't rate highly enough how much this turns any HDTV into a smart TV.  Already have two in my house.", "verified": true, "helpfulness": "1/1", "author": "K. Johansson \"-k\""}, {"rating": 2.0, "review": "First one would go to sleep and not wake up without a power reset.  I worked on it for a few hours with Google support and eventually sent it back.  The second device did not have that problem.However, in my home, powering up ChromeCast and connecting to my TV drops out OTA channels.  Note, I've had two of these devices and they both behave the same way.  I have not tried another TV, but I'm not going to buy a new TV to test it.  The OTA stations drop out when chromecast is on the HDMI port and powered on.Note again, I've had two ChromeCast devices and they both cause the same behavior.Things I've tried recently (this weekend):1) Install a new OTA antenna with better signal (Mohu leaf style via Amazon) - this resulted in more channels, but I still get drop outs with ChromeCast.2) Tried Chromecast it's own extension cable, followed by a 3' HDMI extension cable.  This decreased the frequency of interference, but didn't change the behavior.3) Tested ChromeCast with multiple USB power adapters, including those from Apple - trying to determine if the AC to DC adapter might be causing it.  No change in behavior.I still have the issue...  So in my case, the solution is uplugging ChromeCast when not in use.", "verified": true, "helpfulness": "2/2", "author": "dcg \"dcg\""}, {"rating": 4.0, "review": "Though I was afraid to touch, I got my computer wizard grandson to come install it and it only took him minutes, he was impressed at how well it works.  Honestly, I haven't used it yet - in all these months, but it's there if I want to.", "verified": true, "helpfulness": "0/1", "author": "Joyce Harvey"}, {"rating": 4.0, "review": "It is easier to watch Youtube videos on TV using the Chromecast than my Directv receiver or built in TV app.  I would like to be able to broadcast whatever is playing on my phone onto my TV (photos, music, etc), but c'mon, it's only $35.", "verified": true, "helpfulness": "0/0", "author": "Matthew Koepke"}, {"rating": 5.0, "review": "google, THANK YOU. once again you come up with a product that is perfect for the needs. this thing can stream most of your favorite online movie sources. This is a great product!!", "verified": true, "helpfulness": "0/0", "author": "dsp"}, {"rating": 2.0, "review": "Casting videos was the main reason for this purchase-especially music videos. The audio is not only out of sync with the video but extremely choppy.  It was a waste of my money.", "verified": true, "helpfulness": "1/2", "author": "Michael V Bluhm"}]