[{"rating": 5.0, "review": "I finally broke down and decided to replace my WD Digital Media hub, which was about 4 years old and only support 720p.  Wow, what a difference.  Better interface, easier to use, and crisp clean picture.  The sound is NOTICEABLY improved over the WD, especially the maximum sound level.  The WD sometimes would output at very low volume, even with the receiver turned up to the max.  I also own an Apple TV, and prefer the Fire TV by far.", "verified": true, "helpfulness": "0/0", "author": "BD Books \"BD Books\""}, {"rating": 5.0, "review": "I bought the FireTV to benchmark it against the Roku boxes that I own.  The Roku's have had their issues so I wanted something that just worked.  The FireTV just works.  The speed is amazing and the quality is fantastic.  As for the Roku's - Well, they are in the trash where they belong.I have a smart TV and Comcast X1 and I hate the clunky interfaces of those devices as well.  I use my FireTV for all my streaming needs and could not be happier with it.  So happy that I am going to get a few more for the rest of the TV's in my house.Get it, you will not regret it.", "verified": false, "helpfulness": "0/0", "author": "Hotrodjunkie"}, {"rating": 1.0, "review": "Let me start by saying I got this as a gift.  I have used all the streaming players you can imagine, and this one is the worst.  The hardware is great and it is fast, but save yourself some money and get a Roku, any Roku is better.  Amazon like Apple want to sell content first not hardware, the hardware exist to sell more content, so they are each biased and that makes sense.  Roku doesn't sell content they have no bias to amazon, netflix or anyone one else for that matter so they don't promote anyone's content above any other and all the content suppliers make apps for the Roku.  I love Plex and use it all the time in fact I would argue that plex is the only thing on my Fire TV that I do use it for, but it cost me a dollar to buy the plex app.  No big deal it is only a dollar, but guess what it is free on the Roku.  The apps look terrible, using Netflix is like a flashback to two years ago or if you use netflix on the Wii, yeah it is that bad.  They look like old versions of the android apps that have been ported and up sized for TVs.  If all you want is Amazon content then this may be the box for you, but I still say buy a Roku you can get all the Amazon content plus use great apps like youtube and HBO GO that are not on the Fire TV.  How is that possible to be so late to the streaming hardware business and launch a player that lacks those apps?  If you have never used a set top streamer like a Roku, Apple TV, or any of the others you will likely be impressed, but if you have a Roku and love it do yourself a favor and buy a Roku streaming stick for 50 bucks or buy two for the same price as a Fire TV.  If this hardware ran Roku's software I would have three of them, but this lame Fire OS stinks and if you don't believe me go look at Apple's app store and the Google Play store.", "verified": true, "helpfulness": "5/11", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this Fire TV! My husband is somewhat technically challenged. I set this up and showed my husband how to use it. Last night after I went to bed, he was wasn't able to sleep and came out to watch a movie. He was able to turn it on, find all the Tom Selleck movies, selected one and watched it. With no help from me! This morning I'm listening to a Pandora station and walked by the TV and see the most amazing screen saver pictures. What a sweet treat! I have a \"smart TV\" and have the apps and such through it, but the TV is cumbersome and slow to use (try typing a search with an onscreen keyboard - slow!). The Fire TV is much quicker, easier to use, and the screen saver pictures are a sweet bonus!", "verified": true, "helpfulness": "2/2", "author": "Beth Smith"}, {"rating": 5.0, "review": "Yes, believe it or not I am happy ,very happy with my purchase and so far Amazon Fire TV is living up to its hype . I am so enjoying being able to watch what I want to watch when I want to watch it . No, no one gave me my unit, I changed quite a few diapers to pay for it and ,as usual in my dealings with Amazon, they have delivered what they promised on time ,in pristine condition . Nothing is perfect in this world  but my Amazon makes day to day living just a little bit easier to take and Amazon Fire TV is worth every dollar so, try it, you might just like it and be happy like me.", "verified": true, "helpfulness": "1/1", "author": "Pancakelady"}, {"rating": 2.0, "review": "Easy setup, super fast, radio frequency remote (operate from anywhere in range, through walls etc.) and last but not least, voice search, the reason I bought it.Here's the thing: Voice search only looks through Amazon content and does not delineate between Prime and 'pay for it'  That means you can't do a voice search across all of the content providers like you can with say Tivo.  It also means there is a good possibility you are going end up paying for content that would have otherwise been available on Netflix, or Hulu, or wherever.I would highly advise against putting this devious device in the hands of any household member who does not yet understand the economics of convenience.", "verified": true, "helpfulness": "5/9", "author": "kvrtis"}, {"rating": 5.0, "review": "We really like our fire tv,we are finding so many movies  tv series dnd documentaries to watch,enjoy viewing our photos,just speaking the show title is a plus! Super easy to install and use!", "verified": true, "helpfulness": "0/0", "author": "JULIE S SMITH"}, {"rating": 3.0, "review": "It looks really cool when you plug it in, but when it was time to actually try it, nothing happened. All I really wanted to do was use Netflix. After about 18 tries at DLing the app I finally got to a sign in screen. Then a virtual keyboard popped up, the only issue was the letters didn't change color when I tried to find them. I literally had to guess which letter I was on and type it, then count over to decipher where I thought the next letter was. This went on about 20 minutes until I gave up and went back to watching my regular, functioning TV. Later I try again and magically now the letters are illuminated and I can easily type my log on info, I was ready! But alas, it kept saying my info was inaccurate, even though that very same info was working perfectly for my laptop. Now I call tech support, and they walk me through everything I already tried until we finally find the problem in my settings: \"connected with problems\". Great, this should be easy I thought. We reboot my modem/ router and the Fire, but it has no effect. That was pretty much all they could do so, but still I had \"very good connection\" but \"connected with problems\". So I couldn't actually use anything on this thing. I'll be returning it ASAP and trying the Roku instead.UPDATE - I have corrected my issue thanks to the user comments here, which was my hope in posting this. I called my ISP and they needed to switch a channel on my router and now it works. Hoping this post helps others who encounter this issue. I haven't had a chance to use this yet as I am at work, but will change my score for now, possibly improve further after using.", "verified": false, "helpfulness": "1/6", "author": "Rob Harris"}, {"rating": 5.0, "review": "We just got our Amazon Fire TV today and love it!  I am seriously considering paying the early termination fee to Dish.  We have 10 months left on our contract so even paying the fee we would still be saving about $700.  The variety of content on Fire TV is awesome and love being able to see old episodes of some of my favorite old shows like NYPD Blue among many others.  Thank you Amazon!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I am hopeful, really hopeful, for a giant update for this newer device. What it says it does, it does pretty well. Amazon Movies and TV, check. Netflix, check. Display pictures from your cloud, kinda lame but check. Picture quality is great and the voice search is seemless.However, I have four major complaints:1. No way to separate the FREE prime content with the paid content. There is a section for \"New to Prime,\" that shows free content but that is limited to about 50 tittles. It really seems like they are pushing products for you to pay for. In my opinion however, it is stated pretty clearly what you will have to pay for, so no need to tip toe around worrying about your credit card. It would be nice if it was \"shuffled\" up more often, showing me shows I might not have seen before.2. Limited apps. I figured that an app like HBOgo would be a no brainer for a streaming device from a company that sells HBO shows (and Amazon is advertising an HBOgo app for its new $650 smartphone), but it's NOT there. That's the one app that I really wanted,  but browsing through what is there right now, nothing stands out as something I have to have or would even use. The app browsing is fairly limited,  but you can use the voice command to search for the app you're looking for to find out you can not get it at this time.3. Where is my Amazon music? There is no cloud player offered on this device at the time. When I heard Amazon was offering Prime music, I got so excited I jumped on my fire TV thinking for SURE there would be an update for music. Nothing. You can't even listen to music you've bought, very disappointing.4. It just seems thrown together. With the new releases that Amazon has put out since this item, like Prime music and their new smartphone,  this one was obviously given the least amount of time and love. It is literally an HD dongle that has no power button and an interface that was ripped off of the industry standard, with no \"coming soon to Fire TV\" or updates in sight. The no power button thing didn't bother me for a little while, until I started having to reset the device to factory default. It simply stopped streaming content, unplug replug didn't work, so I reset, logged in again and had to sit through the tutorial one more time. Very frustrating.I will update my review when Amazon updates their device.", "verified": true, "helpfulness": "5/11", "author": "Bynumn Jackson"}]