[{"rating": 1.0, "review": "This will allow us to watch UTUBE on TV but we can't make PRIME movies stream!!!  We hired a geek to come and he didn't know how, either.  IS THERE A TECH HELP LINE FOR THIS ITEM?", "verified": true, "helpfulness": "1/2", "author": "debi mulkey"}, {"rating": 2.0, "review": "I bought the chromecast to send movies (homemade) from my laptop to the tv.  Google won't allow it.  They advertise it like it's the best thing since whatever and it won't work.  They say, oh yeah, it'll work with Plex.  Nope.  They say, oh yeah, it'll work with real player.  Nope.  Doesn't work.  It's a bs device.  Use a hdmi cord from ebay or whatever for $4 instead.  Su ck it Google.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "A great product, support and development will increase as google tries to compete with the likes of roku and apple tv. the future looks bright in my opinion, atm I'm running the realplayer cloud app streaming video from my tablet and I'm pretty impressed so far. i can't wait till mx player gets some chrome cast love....after that its pretty much perfect.", "verified": true, "helpfulness": "1/1", "author": "Danilova"}, {"rating": 1.0, "review": "This device works as stated if you are broadcasting your wireless....SSID.  It does not work at all if you are wise enough to hide your SSID.....For that reason.....I have to give it one star for that reason.", "verified": false, "helpfulness": "1/3", "author": "C Elbert"}, {"rating": 5.0, "review": "These are so easy to set up and the user interface is very nice to use.  More and more apps are being made compatible, too.", "verified": true, "helpfulness": "0/0", "author": "Jason Bourne"}, {"rating": 1.0, "review": "Not easy to configure, requiere external energy supply, only cast youtube and netflix (other are available but with bad content).you can't cast the entire tablet/phone screen only certain apps.", "verified": true, "helpfulness": "1/3", "author": "ALEJANDRO GUERRERO B."}, {"rating": 5.0, "review": "This is by far one of the best gadgets to get. I hate that my TV does not have those nice automatic buttons for Net Flix, etc. With Chrome, you never have to worry about that! I set this up in less than two minutes. I used both my iPhone and iPad to stream content. It worked beautifully. I love it! Best thing that I have bought in awhile!", "verified": true, "helpfulness": "1/1", "author": "R"}, {"rating": 3.0, "review": "Not using as much as I hoped and would have liked too. Also, it doesn't always appear on my wireless network with the iPhone or iPads making it not useful.  I would like to use, it, but so far its either not there or not supported in what I want to watch.", "verified": true, "helpfulness": "0/0", "author": "C. Gibson"}, {"rating": 5.0, "review": "I love my Chromecast. I never thought I would watch so much T.V, but now whenever I'm tired I just switch over to HDMI and watch some of The Office. I love how I can connect my computer monitor to my chromecast by the Chromecast plugin on Chrome. Great invention. Everyone should own one!", "verified": false, "helpfulness": "0/0", "author": "Luke"}, {"rating": 1.0, "review": "The descriptions make it seem like this little tool will suddenly allow you to stream all kinds of internet content onto the TV.  Not so! First my modem was not on their list, and then learned my modem is not compatible.  When I got a different modem, and went through torture to get it to work with this gadget, I found out it is not compatible with Amazon Prime Instant Video streaming!  Sheesh, guess I should have read the fine print before purchasing. Do not recommend.", "verified": true, "helpfulness": "1/2", "author": "SuMo"}]