[{"rating": 5.0, "review": "Coming from someone who doesn't have cable this is a huge improvement. I was able to set it up without problems. I can stream netflix to the tv as well as anything on my daughter's tablet: for instance shows from the Google playstore. Haven't explored all the possibilities yet but very satisfied with the purchase.", "verified": true, "helpfulness": "0/1", "author": "Kristin D."}, {"rating": 2.0, "review": "Installation instructions were not real clear. If you don't  have a new phone with touchscreen then you have to control the tv cast from your computer. Not very handy. I then had to uninstall it to be able to recieve netflix  thru my blueray player again.At this point I do not find it very useful to me.", "verified": true, "helpfulness": "0/1", "author": "peter c swanson"}, {"rating": 4.0, "review": "***** 11/19/2014 update *****Since my original review, Chromecast has expanded its offerings.  Still no Amazon video, but that isn't the fault of Chromecast.  Since then, I've been able to cast my screen from a Nexus 4 and 7.  This is a great feature, which eliminates the need for any miracast receiver.Like----1. Easy to use, easy to transport to other locations.2. Navigation is simplified using a phone/tablet.3. Works fine with iOS and Android.4. Screen casting from Android devices is great.5. Casting from within applications/webpages is prevalent, but we don't use that much.Dislikes--------1. Have to use phone/tablet for navigation.  Sometimes we wish for a simple remote.2. iOS loses sync, app has to be restarted on the device.  Luckily, we don't have to reboot the Chromecast (most of the time).3. Is this going to be another Google dodo?  E.g. Nexus Q, Google TV?  Will support continue with the introduction of Android TV?I have also ordered two Amazon Fire TV sticks to see how they compare with the Chromecast.  I should have a review comparing the two shortly.***** Original review *****The early Chromecast orders were more appealing because of the 3-months of Netflix included.  I use it regularly to watch YouTube and Netflix on my TV in the family room.  The picture quality is better than Netflix through my Roku XD (first gen).  Occasionally, it loses sync with my phone or tablet (both Android).  It has been reasonably easy to get it back in sync though (usually restarting the Chromecast app on the phone/tablet, and restarting Netflix/YouTube).I see great potential for this devices, and devices like it.  I like the idea of keeping the \"smarts\" in one devices, and other devices (like Chromecast) are essentially receivers.Even with the minor flaws, the pricepoint makes it a must have for anyone with a TV with HDMI.", "verified": true, "helpfulness": "0/0", "author": "masterhankshake"}, {"rating": 5.0, "review": "This is by far the BEST product for TV. Google Chromecast is amazing, simple to use & I love it!I switched from Roku. Forget Apple TV. This is a whole different level.Netflix, Hulu & Youtube stream perfectly! Right from your browser.", "verified": false, "helpfulness": "0/1", "author": "Rukminesh"}, {"rating": 4.0, "review": "This little guy has gone quite a ways towards replacing our media PC.  If it would stream local content without the need of screencasting from a PC it would be almost perfect.  We mostly use it for NetFlix and youtube, which consists of about 2/3rds of our viewing.One annoying thing that I will hope get fixed in later updates is the inability to force youtube to a certain quality setting.  Right now it just auto shifts and has little or no ability to buffer.  As long as our 10mb DSL is not congested, and we block CDN servers at the router as well, it's usually okay but there are times were it's flipping back and forth between standard HD.  One other minor thing is older shows on netflix do tend to look a -tiny- bit pixelated when compared to streaming from the media PC -  Not sure why that is but it only seems to happen with older/standard def shows, HD is amazing.  Would also be nice if you could use the TV remote to control some features as you have to use a smartphone, tablet, or PC to control it but that is not that big of a deal.It has limited apps at the moment, would be nice to see other services but still, for price you really can't beat it.", "verified": true, "helpfulness": "0/0", "author": "Clyde Dale \"Clydesdale\""}, {"rating": 5.0, "review": "I really like it and it was so easy to install and it made watching movie a lot easier to watch", "verified": true, "helpfulness": "0/0", "author": "melody colon"}, {"rating": 5.0, "review": "exactly what i was looking for and easy to setup too.  i can find something on my computer, want my wife to see it, so i just cast it to tv monitor and makes it easy to view it together", "verified": true, "helpfulness": "0/0", "author": "Jim Robinson"}, {"rating": 5.0, "review": "The Chromecast was easy to setup and wonderful to use. I linked it to both laptops and Samsung Galaxy S3. Picture and sound work great and I can complete other tasks on computer or phone while watching.", "verified": true, "helpfulness": "0/0", "author": "S. Richardson III"}, {"rating": 5.0, "review": "A pity this device is not offered anymore! I should have purchased 3 more for my TV sets. Thank you..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"HSIUNG.RC\""}, {"rating": 5.0, "review": "love this product, im so glad i bought the google chromecast! it makes watching netflix so much easier. i also love that you can  play youtube vids :)", "verified": true, "helpfulness": "0/0", "author": "Alondra villa"}]