[{"rating": 4.0, "review": "good stuff!", "verified": true, "helpfulness": "0/0", "author": "Christopher D."}, {"rating": 5.0, "review": "This product works great , has all the apps I use and like , really no complaints . I like the layout much better then roku but that's all about personal preference . I have Amazon prime so I get them movies/shows too . Really like the voice remote . My family uses this everyday with no issues", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 1.0, "review": "I like the Apple TV better", "verified": true, "helpfulness": "1/9", "author": "mark"}, {"rating": 3.0, "review": "I have owned almost every single model of Roku box they made.  I have a Nexus player, a couple Google Chromecasts and a couple Smart TVs and Smart Blu-Ray players.  There.  Background done.The hardware specs for the Fire TV are great.  The remote is great - the best feeling/looking remote of all the streaming systems I've used.  The device is also fast - hardly any waiting at all.  However, the user interface leaves much to be desired.  But, I understand why Amazon has it setup the way it is setup.The Fire TV is Amazon-centric.  Meaning it really pushes it's own content over other sources.  Yes, it works with Netflix, Hulu, HBO, etc, but accessing those apps/services is much more difficult than with the Roku box.  This means it takes more time and clicks to load up a \"third party\" app like Netflix or Hulu.  Searching also does not include those other apps.  In my opinion, the Roku user interface and search are reason enough to warrant buying a Roku over the Fire TV.  I got this because I wanted something with a little more speed and I was curious.  I will most likely sell this box, and stick with my Roku 3.I understand though.  Amazon wants you to use its box with its content.  It wants you to rent/purchase movies and videos through them, not the other apps.  I really wanted to like this box, because I really like Amazon products.  I am a Prime member, so I get all the nice Amazon-centric content.  The box itself looks good, is small, and fast.  If I could get the Roku UI/software onto the Fire TV hardware and remote, I'd be in streamer heaven.", "verified": true, "helpfulness": "1/2", "author": "B. Shockley"}, {"rating": 5.0, "review": "Great great great!  How did we stream without it all this time.  Just a wonderful little device that makes streaming so much easier and with better graphical quality to boot.  Plus it came with a PBS app that streams some of our favorite PBS shows.", "verified": true, "helpfulness": "0/0", "author": "Homeschool mom"}, {"rating": 5.0, "review": "The only complaint I have about the Fire TV is that I should have bought it sooner. The streaming quality is excellent. Better than what we had on cable TV! We have dropped our cable TV. Easy to install and easy to use. Lots of Apps. While we cannot use them all for different reasons I'm fairly certain there will be more to come. I suggest you purchase Amazon Prime with this product and take advantage of the 30 free trial offered on HULU + and Netflix or any other app you might want.", "verified": true, "helpfulness": "0/0", "author": "Cindy Elton"}, {"rating": 5.0, "review": "I love this little box I wish i knew how to give great reviews this has been the best gift I've gotten from my pops i love everything about it its more then movies, you can watch youtube chanels is crystal clear with great sound quality you can listen to pandora, play games, load more apps i really don't know what else to say but that this little device entertains me ..", "verified": true, "helpfulness": "0/0", "author": "Benny"}, {"rating": 2.0, "review": "Why is there no simple method to turn it off", "verified": true, "helpfulness": "0/2", "author": "Regular shopper 17"}, {"rating": 5.0, "review": "Exelent", "verified": true, "helpfulness": "0/1", "author": "Marco Vargas"}, {"rating": 5.0, "review": "really good system, the only bad is you can use a hard drive for see your own movies", "verified": true, "helpfulness": "0/1", "author": "Wentyn"}]