[{"rating": 5.0, "review": "I originally thought this would only be good for getting youtube and netflix (podcasts, Google music) on my TV. I soon learned you can cast tabs in chrome(on your PC) directly to your tv with this nifty little device. Have an mp4 you want to watch? open it in chrome( control + O ) and cast it. Want to watch ANYTHING from ANY streaming video site and by casting the tab to your TV you can watch it on the big screen. Excellent value for $30.", "verified": true, "helpfulness": "0/0", "author": "Danny Thopson \"anthrax.man\""}, {"rating": 5.0, "review": "Has solved my Netflix streaming issues with my Sony Blu-ray WiFi player. With Chromecast, no more freezes, drops or buffering. Same with YouTube and a free Photocast app which allows 'casting' of my photo library on to my HDTV.  Couldn't be more pleased and highly recommend for price and simplicity of set up and operation.", "verified": true, "helpfulness": "0/0", "author": "bmg \"bmg43\""}, {"rating": 4.0, "review": "I only got this device because i was tired of hearing either the ps3 or x360 make noise while watching videos.I use medbrowser3 and my iphone 5s to play tv shows in HD and the movies as well. I have to say it's a great buy and easy as hell to setup. Am i having some issues with streaming right now, but i believe it is the network and not the device.Will updated once i'm able to trouble the issue.", "verified": false, "helpfulness": "0/0", "author": "anthony"}, {"rating": 5.0, "review": "Even though I have a new smart TV, loading Youtube or Amazon Prime is slow (loading the actual app). Not to mention you can't pull up a true browser from a smart TV (at least not my 80\" Vizio!). Chrome does both better - youtube loads faster, and clips load faster too (b/c chrome has a stronger wifi antenna?) vs. loading clips through the wifi of my smart tv. Basically anything you can bring up with a browser on your iPad or iPhone, you can beam onto your TV via chrome cast. Picture quality does not suffer!", "verified": true, "helpfulness": "0/0", "author": "Tojam"}, {"rating": 3.0, "review": "It was a better item before google modified chrome so that you are unable to install extensions (add-ins that allow new or different capabilities) that they don't approve of.The browser is linked to this product through an extension, and since I had to start using a different browser out of principle, this decreases the functionality of this device.", "verified": true, "helpfulness": "0/0", "author": "Joe Rigby \"Joe T. Rigby\""}, {"rating": 4.0, "review": "An amazing tool it works perfectly fine with YouTube and Netflex, but I did not like it while browsing. its a litille bet late.", "verified": true, "helpfulness": "0/0", "author": "ahmed Almutair"}, {"rating": 4.0, "review": "Awesome product but looking for compatibility with Dropbox.  Works very well with Netflix and other apps like HBO go. Jeah", "verified": true, "helpfulness": "0/0", "author": "Jmanh12"}, {"rating": 5.0, "review": "This one of the best purchases I have made.  I love that I can stream shows from my iphone and laptop instantly.  My only regret is not buying this sooner!", "verified": true, "helpfulness": "0/0", "author": "Michael Cook"}, {"rating": 3.0, "review": "I purchased two Chromecasts for Christmas for each of my daughters.  This is a mixed review.  The Chromecast would set up for one, but not the other initially. It was very disappointing on Christmas Day to have one child to view whatever she wanted from her HP computer, but the other who has a Chromebook to not have the same experience. My oldest daughter uses her Chromecast daily and swears it's one of the best things she received for Christmas.  My youngest daughter doesn't use hers as much, even though I was able to fix it eventually and thinks it's a hassle at times. They do not have the same manufacturer for the televisions, so I chalked it up to one having a Samsung, more compatible  versus the other having a unfamiliar name, maybe less compatible.  I own a smart tv in my bedroom and was thinking of purchasing another Chromecast for the family room tv (Samsung) so I wouldn't have to purchase another smart tv, but I think I'll wait.  Perhaps Google has not worked out all the bugs on this device. I think the concept is forward thinking, but it's still quite buggy.", "verified": true, "helpfulness": "0/0", "author": "Natasha Romanoff"}, {"rating": 5.0, "review": "Love them ordered one for each TV. PLEX w/ chromecast is amazing, the ability to stream anything to the TV is great!", "verified": true, "helpfulness": "0/0", "author": "kspahr"}]