[{"rating": 5.0, "review": "Works great.  Such a better way to stream movies and tv shows from netflix and hulu.  Only issues I have run into this seem to be more an issue with the transmitting device than the actual receiver itself.", "verified": true, "helpfulness": "1/1", "author": "Jonathan Long"}, {"rating": 5.0, "review": "This is very nice! I just look for any Youtube or netflix video and hit the streaming button and that's it!I will still see what else can this little gizmo can do..Great!", "verified": true, "helpfulness": "0/0", "author": "Eddy Cabrera"}, {"rating": 5.0, "review": "This works so well with all the apps that have elected to use it. I use it on a daily basis and love it!", "verified": true, "helpfulness": "0/0", "author": "Amelia Mohr"}, {"rating": 5.0, "review": "I've used it once or twice. Okay three or four times. But it does need a faster connection to the Internet to be truly useful.", "verified": true, "helpfulness": "0/0", "author": "G. C. Levine \"Doctor Who\""}, {"rating": 4.0, "review": "Test it out between the Roku 3, went with the Roku 3 because of more options but this product can handle its own.", "verified": true, "helpfulness": "0/0", "author": "Brandon Fridia"}, {"rating": 4.0, "review": "I'm doing the Chromecast vs Roku experiment like many people looking to unplug.  I found the Chromecast to be the more versatile of the two however, it lacked the polished feel of the Roku.  But, Netflix and Hulu Plus both operated well from my phone, tablet and laptop.  The only issue I had was that I'm pretty sure my cable provider can distinguish when I'm streaming to the device because when I go to their website to watch programming the picture quality is suddenly extremely pixelated.  Not bad enough that I can't watch it but, just enough to not really enjoy it like Netflix and Hulu Plus.  Chromecast also has a very limited number of apps to run compared to Roku but, if you stream from a website that is not offered on Roku like, anime or music, the Chromecast is a must have for such a reasonable price.", "verified": true, "helpfulness": "0/0", "author": "Marcus"}, {"rating": 5.0, "review": "Simple to connect, follow the prompts can open something on your smartphone or tablet with the option to view on your flat panel no issues to report", "verified": true, "helpfulness": "0/0", "author": "brian anderson"}, {"rating": 4.0, "review": "The device does a great job letting me run Netflix from my iPad mini.  I surf Netflix, find the movie I like and then touch the icon and it loads on my TV.  I can continue to use my ipad to surf the net and do other things while the movie is playing.  The ipad is the controller- which also means that I have to use the ipad to \"pause\" the movie if I want to leave the room which is a little bit of a pain as it takes a little bit to reconnect to netflix and pass the command to pause.Streaming my browser is a little tricky but if I keep my expections in check it is okay.  It doesn't stream your desktop, it streams the active tab on your browser, so if you switch tabs you have to re-cast the current tab.  Also, if you are playing a pop-up window with some video it may not see that.  So it is a little crunchy, not something I would use a lot,For me it was worth $35 bucks all day long.....not much more.", "verified": true, "helpfulness": "0/0", "author": "Steve Odden"}, {"rating": 5.0, "review": "Guess I got my first Chromecast military issued in 72-73'.  Back then they were the size of the highly mobile and well-designed M1 Abrams tanks.  Only thing we could stream was Pong.  Pong was a good dancer, but the only thing we wanted to do was go home.Decades went by and improvements were made.  Like Pong, Chromecast steadily groped its way into the mainstream.  Folks using XMBC realized their streamlined media experience required third party apps to launch Netflix.  Chromecast said, \"What up?\"  People using the PS-4 bought Rokus, but then realized they could probably just use Chromecast for 1/3 the price instead.  \"What up?\"  Chromecast moved from the Vietnam jungle to the secondary TV, then it jumped to the main TV.  \"WHAT UP?\"Google has marketed the Chromecast both broadly and wisely.  Their recent ad titled, \"Even a Woman Can Use It\" was clearly geared at mainstream American ladies.  While laughable and fundamentally flawed for being facially ridiculous, I truly appreciate that outreach effort.If you can use a mouse, you can set this up.  Way better quality on Netflix vs. Live steam (such as NCAA tournament streaming).  With ideal setup, both are fine.  With not ideal setup, Netflix if fine.  Deal with it.", "verified": true, "helpfulness": "0/0", "author": "Cyril Figgus"}, {"rating": 1.0, "review": "Bought this to use in my bedroom to stream Netflix. Half the time it said, ready to cast then it wouldn't connect. Looked online for troubleshooting with no luck. It worked for me a couple times then would load to 25% on Netflix and freeze. Definitely returning and buying a Roku. This thing isn't worth the headache.", "verified": true, "helpfulness": "0/1", "author": "Kaytlin23"}]