[{"rating": 5.0, "review": "Amazing little device", "verified": true, "helpfulness": "0/0", "author": "Sean Hunter"}, {"rating": 5.0, "review": "Awesome little device for only around $30. Loved mine so much that I ended up buying another for my father on Thanksgiving for an insane discount. Works great and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "G. Lewis"}, {"rating": 1.0, "review": "Can only see utube", "verified": true, "helpfulness": "0/1", "author": "rat"}, {"rating": 4.0, "review": "I like it, it came really really fast its not expensive, works well. Think I might get another one.", "verified": true, "helpfulness": "0/0", "author": "Vernon Lawton"}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/0", "author": "Ricardo Colon"}, {"rating": 1.0, "review": "Doesn't work well, when i pause  a show and try to start again the cast icon on any of my device's is gone. So i have to restart my device( android or apple) to get the icon back. Don't bother with this. Get a roku or fire stick.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "turns a dumb tv to a smart tv", "verified": true, "helpfulness": "0/0", "author": "W. Harris \"HarrisCompute\""}, {"rating": 3.0, "review": "Inexpensive an unobtrusive. However, the video freezes and takes forever to startup. I'm not sure if it's my old wifi router that needs updating but it some throughput analysis would be nice to have in the software associated with the device.", "verified": true, "helpfulness": "0/0", "author": "PhilG \"Book Fiend\""}, {"rating": 5.0, "review": "Fast shipping and a awesome device!", "verified": true, "helpfulness": "0/0", "author": "Mike Dearing"}, {"rating": 3.0, "review": "Chromecast is nice for me to watch You Tube on my TV. I am disappointed when viewing photos as I am only able to view one photo at a time & it will not cast slideshows. Also, I cannot use it on my iPod Touch as the iPod is 4th generation & it will not download Chrome unless I have IOS 7 or higher which iPod 4 will not upgrade to. I really would enjoy Chromecast if I were only able to view slideshows & multiple photos. I am casting Chromecast via Apple desktop pc. Chromecast is for me, right now, ok. I can't complain too much as I only paid 26.99 for it on sale.", "verified": true, "helpfulness": "0/0", "author": "Chester"}]