[{"rating": 5.0, "review": "LOVE IT...I use it at least once a day..it stays in my TV and so simple to use..however sometimes the quality is not HD maybe because of strength of internet service", "verified": true, "helpfulness": "0/0", "author": "kiss0809"}, {"rating": 5.0, "review": "Arrived on time. Does what it needs to do.", "verified": true, "helpfulness": "0/0", "author": "DT"}, {"rating": 5.0, "review": "This thing is awesome for the kids room. I live in a apple environment and this thing fits in perfectly. I mainly use this on the kids tv so they can Disney jr since there is no cable in their room.", "verified": true, "helpfulness": "0/0", "author": "Pablo Herrera"}, {"rating": 5.0, "review": "Great product you won't regret!! I also bought an adapter because the hdmi port on our tv is really close to the tv. I was trying to be better safe than sorry. Well this actually comes with an adapter alongside the micro usb cable and charger. Fits great and works fantastic 👍", "verified": true, "helpfulness": "0/0", "author": "Magen Witzleb"}, {"rating": 3.0, "review": "already have one and im buying another one for my new non-smart TV.I would even buy it for LG smart TVs bc LG's interface sucks and lags as hell.Screen mirroring is kind of s***ty pretty much unwatchable", "verified": false, "helpfulness": "0/0", "author": "Felipe"}, {"rating": 5.0, "review": "it is neat that you can put any website on your tv. Only thing is sometimes it freezes, but it is good otherwise", "verified": true, "helpfulness": "0/0", "author": "Chase Dahmer"}, {"rating": 5.0, "review": "Works Great!!!", "verified": true, "helpfulness": "0/0", "author": "gordy"}, {"rating": 5.0, "review": "Thank you!! Arrived faster than the scheduled due date! Works just as described. #veryhappyclient.", "verified": true, "helpfulness": "0/0", "author": "Nneka"}, {"rating": 5.0, "review": "I bought this on a lark and I ended up loving it. I can cast all the movie channels, even Encore and Epix. It's great for someone looking for more than just the content you can get on your TV channels.", "verified": true, "helpfulness": "0/0", "author": "cyberspastic"}, {"rating": 4.0, "review": "Almost always works perfectly. Occasional choppy video or trouble connecting.", "verified": true, "helpfulness": "0/0", "author": "Gil"}]