[{"rating": 3.0, "review": "I decided to try Amazon Fire Tv, because I am already a Prime member, and I am a big fan of Amazon. My Roku 1 needed to be replaced, and I was looking for a device that used the PLEX app to stream media from my PC. I was very disappointed to learn that I had to but the Plex app for $4.99 when it was free on the Roku.I have had issues with picture quality too. And most occasions when I don't even think I am getting DVD quality video, let alone 720p; and definitely not 1080p. I was frustrated enough to shut off the Amazon Fire TV and reconnected my old Roku. I am considering returning it. I have fast internet, Comcast 105mbps internet plan, so I should be able to stream 1080p no problem. Not really sure how streaming 4K will ever be a reality.I also Don't like the fast forward/rewind. I can't understand why you can't see the video while fast forward like you can with a DVR or Blue Ray player. Now that PLEX is available on the XBOX One, I will most likely consider returning amazon Fire TV. If not for XBOX One, for sure for Roku 3.", "verified": true, "helpfulness": "0/1", "author": "Derek B."}, {"rating": 5.0, "review": "Refreshingly simple to set up and use. Occasionally it will crap out but the good news is the device is self healing. No issues, no complaints. It seems to dissipate a bit if heat - design issue with packaging?  Idiot proof interface has no\"off\" button.", "verified": true, "helpfulness": "0/0", "author": "yellowpixels"}, {"rating": 5.0, "review": "Came quickly,easy to set up,does all I need it to do. Could be easier to navigate around some of the programs, really works great with Amazon products.", "verified": true, "helpfulness": "0/0", "author": "Tom C"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Otto Perez Durstova"}, {"rating": 5.0, "review": "I use to have the roku, but the remote died and no longer would work. Then I started using my phone for the roku then the system completely shut down. My dad and I went looking at different devices that I could use and both agreed to try to the amazon fie TV. I always have great luck with amazon products, but I have to say that this has been the greatest experience ever! I wish all my devices were amazon products! I never have problems with the fire TV. Netflix can be touchy, but that is a Netflix issue and not an amazon issue. I highly recommend getting this product if you enjoy your TV experience and technology. This will not disappoint you!!", "verified": true, "helpfulness": "0/0", "author": "Jordyn"}, {"rating": 2.0, "review": "Doesn't come close to Apple TV or Roku. The unit has been problematic from the beginning. The network connection doesn't stay on and you cannot stream a single Live Feed (Sportscenter) without it timing out or loading forever. I have the Amazon Fire TV box plugged in directly using Cat5e to my gigabit router.  Wireless is doesn't stream as well either.The menus are lacking features and very p.lain. Nothing special about this unit. The voice command is ok and only works with Amazon menus and Amazon specific appsI would not recommend this unit and I am an IT consultant with extensive networking knowledge. This until is first market and needs an update.", "verified": true, "helpfulness": "2/5", "author": "Chad"}, {"rating": 5.0, "review": "It is the best and works very well. All shows and movies stream very well and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Cati"}, {"rating": 5.0, "review": "We subscribe to Amazon Prime, Netflix, and Hulu. We have a 2nd gen Apple TV in the kids' playroom upstairs, but it was always a little slow, and though it would let us watch our own recordings and anything we bought from Apple, it doesn't have Amazon Prime as an option.I tried using my TV and Bluray player, but their software is just awful. Takes literally several minutes to pull up Netflix, and several more to begin streaming. It was just painful to even try and use them.The Amazon Fire TV is AWESOME. It's lightning fast, even on our slow (5 Mbps) internet connection. Streaming looks great. Voice search works great.I haven't found one flaw yet... the user interface is easy to understand, and quick to find what you're looking for. It just works.If you're looking for a device that will allow you to stream Netflix, Amazon Prime, Hulu, play games and do much, much more then the Amazon Fire TV is your best bet.", "verified": true, "helpfulness": "1/1", "author": "Brandon Eley"}, {"rating": 5.0, "review": "Works beautifully.  this is everything I had wanted.  I am a 64 yr old grandmother and even I was able to set up without any problems. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Susan B Orihuela"}, {"rating": 4.0, "review": "Excellent, wife loves it so all is good.", "verified": true, "helpfulness": "0/0", "author": "Les"}]