[{"rating": 2.0, "review": "This is not working properly, its random you would see the icon and suddenly its disappear", "verified": true, "helpfulness": "0/0", "author": "Umer K."}, {"rating": 2.0, "review": "First off, I know this isn't an Apple TV, but this thing has some issues. I stream through my Xbox and iPhone and never have buffering issues. As soon as I tried using this, there was a lot of buffering, it would lose the device it was connected to, and sometimes just start over. We tried using it in a couple locations (just to test it) and came up with the same results each time. Pretty disappointing!", "verified": true, "helpfulness": "0/0", "author": "TJChex"}, {"rating": 4.0, "review": "Easy to use, but limited function!", "verified": true, "helpfulness": "0/0", "author": "Sherry Chen"}, {"rating": 1.0, "review": "I bought this chromecast through amazon, I don't know whether I got new product or refurbished product...it is been 3 months I'm using it but it never worked fine since day one...initially I thought it could be with my internet speed, but recently I even changed my ISP provider to Comcast business class with 12 MBPS, still when I share any videos on browser it never plays smoothly....always hangs and huge delay in transmission....whereas my neighbors one working fine....they never had this kind of issue. I even tried installing chromecast in their home but still no luck....I think it is definitely something to do with chromecast device....Seems I do not see return option on Amazon....am looking for amazon help here..", "verified": true, "helpfulness": "0/1", "author": "sapna"}, {"rating": 5.0, "review": "Not what I wanted at fist but then plex started working now it does what I need but if on iOS might as well get Apple TV", "verified": true, "helpfulness": "0/0", "author": "Johnathan Denson"}, {"rating": 5.0, "review": "AWESOME!", "verified": true, "helpfulness": "0/0", "author": "matthew perez"}, {"rating": 5.0, "review": "It plugs into your HDMI port AND a USB port OR the included AC adapter for it's power.  It allows me to stream whatever is displayed on my Android phone and with some Android apps, interfaces directly with the Chromecast so I can do other things on my phone without it being displayed on my TV.  The Chromecast plugin for Chrome Browser is in BETA so it works most of the time but can be flaky.  However this has nothing to do with the Chromecast hardware rather it's software counterpart.  I found that when casting from my PC, it's best when my PC is connected to a wired network connection rather than WiFi for optimal performance.  Maybe it's my surroundings, my network, my router, but it just works better that way.  I've had no performance issues broadcasting, from my Android phone, such as NFL games, Netflix, PocketCasts, or YouTube.If you have a TV that isn't \"smart\" meaning it doesn't have built in WiFi, you will find this device very handy and an inexpensive way to connect various media to your TV.  If you do have a \"smart\" TV, this device is little more than a novelty and doesn't bring much to the table.  With that said, with smartphones or tablets being in almost every modern household, this is a neat device and  affordable.", "verified": false, "helpfulness": "1/1", "author": "Joshua"}, {"rating": 2.0, "review": "Doesn't stream smoothly. Studdering picture.", "verified": true, "helpfulness": "0/0", "author": "PostMeridian \"PostMeridian\""}, {"rating": 5.0, "review": "This device is a great value for the price. You do need a mobile device (Apple or Android) or PC to use it, but I find it a lot easier to use than other streaming devices that are remote based. Mine has been running for almost a year now without any issues. I also like that google is constantly adding new features and plans to continue doing so.", "verified": true, "helpfulness": "0/0", "author": "Michael Furnas"}, {"rating": 2.0, "review": "When it works, it works. When it doesn't, it's a right pain in the butt. I don't know if it's something that I'm doing wrong, but I've found this device to be very hit-or-miss. Which is not something I want when I have a decent-sized monitor and have just cancelled my cable service in lieu of Netflix, Hulu, etc. I have so much trouble setting it up each time I want to use it. If I keep having to troubleshoot, I might send it back and get an HDMI cord like everyone else.", "verified": true, "helpfulness": "0/0", "author": "AshMac02"}]