[{"rating": 1.0, "review": "We'll, it simply did not install as advertised.  And when I tried to get support, Google said there was no support except their forum and self help pages.  I just hate companies that put out a product or software (like Microsoft) and then go out of their way to avoid providing support!!!  Looks like Google may go the way of MS.  I'm done with those guys (MS).  I'm now a Mac user.  They provide excellent support for all of their products.Bob", "verified": true, "helpfulness": "1/2", "author": "Bob R. Rafalovich \"BobR\""}, {"rating": 5.0, "review": "I've been experimenting with cable alternatives for years now and this is hands down one of the best products. It has a simple installation and your phone/tablet is your remote. I also love that you can use your device and it never disrupts what your watching. Google has a slam dunk with this product.", "verified": true, "helpfulness": "0/0", "author": "Justin Jones"}, {"rating": 2.0, "review": "Too simple. I bought a DVD player that basically does the same. It's ok for someone who loves to stream from the Internet though.", "verified": true, "helpfulness": "1/1", "author": "CJ"}, {"rating": 5.0, "review": "I'm so excited that we now have great music and all of our Movies from Netflix and Hulu on the big screen! Even my seven year old daughter can work it!", "verified": true, "helpfulness": "0/0", "author": "TRINA R. JOHNSON"}, {"rating": 5.0, "review": "Works great, my grandson got one for Christmas and I decided I wanted one too. Price was very affordable as well", "verified": true, "helpfulness": "0/0", "author": "G. Claybrook"}, {"rating": 5.0, "review": "Works great. Download show box and local cast! I have bought 2 more. We use it with our tablet and phones.", "verified": true, "helpfulness": "0/0", "author": "Chase"}, {"rating": 1.0, "review": "I decided to ignore bad reviews of the Google Chromecast. That was a bad mistake. I received my Chromecast in after four hours gave up trying to install it. Everything went well until I had to download the first update. I got the message that it could not connect the network. So I opened up Settings and noticed that the WirelessPasswordwas only eight characters long instead of the 10 characters that made up my Internet wireless password. I could not change it nor could I get it to display the characters.I could not find any help on the Google website but a Forum gave me an answer as to how to do change the password. I was told to push the button on the Chromecast until it reset. Just doing that didn't work so I completely uninstalled Chromecast and started all over from the beginning. The same problem cropped up. Even though I entered the correct password for the wireless network, Settings still showed only eight characters. So Amazon, give me a refund.", "verified": true, "helpfulness": "1/2", "author": "Able Devildog"}, {"rating": 3.0, "review": "For movies it is excellent  it works  great but it does not have screen mirroring. Excellent price. I love it.", "verified": true, "helpfulness": "0/0", "author": "ERNESTO DURAN"}, {"rating": 5.0, "review": "Great to interface with Netflix and send to the tv.  I would check out Amazon product before I purchase this and compare the number of applications that it can interface with.", "verified": true, "helpfulness": "1/1", "author": "tim"}, {"rating": 5.0, "review": "The Chromecast handles all of my streaming needs. I use it for Netflix, Youtube, Revision3, Songza, Pandora, And Play Music which are my major media apps. Looks great on TV and using your phone as the remote is easy and natural.", "verified": true, "helpfulness": "0/0", "author": "Jared K"}]