[{"rating": 4.0, "review": "Works great but only uses Netflix and utube it needs more stations. I brought this because it says you can watch anything you see on your chrome browser, no true!", "verified": true, "helpfulness": "0/0", "author": "Bibi Carew"}, {"rating": 4.0, "review": "Love being able to watch Netflix on my older TV. Its pretty cool technology which lets you use your phone as the remote and put the movie on TV without having to drain your phone batteries. I wish there was more support to let you project your computer to the TV. If it could do that I would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Draconianruler"}, {"rating": 5.0, "review": "love it. works great. i would advise to buy this as soon as you can. A++ wish you could stream more though.", "verified": true, "helpfulness": "0/0", "author": "brian reed"}, {"rating": 5.0, "review": "Worth every penny. The future potential for Chromecast is unlimited and this device will only get better with time. A great alternative to AppleTV, Roku, and Boxee. Hopefully it will support Amazon Instant Video in the future!", "verified": true, "helpfulness": "1/1", "author": "ndmertens"}, {"rating": 5.0, "review": "Bought a second one just because it worked so well. But as always the future will tell if others get on board and make your took work better.", "verified": true, "helpfulness": "0/0", "author": "R. Larson \"Rich\""}, {"rating": 3.0, "review": "You need to have fast wifi for this to work. Ours kept buffering and stalling, so we ended up having to watch it on the computer anyway. I've heard great feedback from friends though.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Great product with tons of potential. Very much lacking at the moment due to the lack of apps... Main reason I got it was to take it to a friends place and hook up to their TV and showing the pictures I took on my Iphone, However the app that would do that has been banned. So waiting for Google to allow more apps. Would be nice to watch anything on the TV like I can do with Apple TV. Hope it gets better.", "verified": true, "helpfulness": "0/0", "author": "J. Johnson"}, {"rating": 5.0, "review": "That's right, I love, love, LOVE Google's Chromecast!  It is simply the best electronic device I have purchased in years.  So much so that I bought TWO of them so I could use one in my Family Room and one in my Master Bedroom.  Set-up only takes a few minutes, so simple, the connection works flawlessly, and you can stream ANYTHING you want to watch from your laptop, smart phone, or even PC if connected wirelessly to your TVs.  My wife and I cut down to basic cable years ago because we watch almost everything online for FREE.  Why pay a subscription or extra for a DVR option when you can wait a day and watch almost anything online for free?  Less than $60 on Amazon has afforded us extremely easy access to streaming media in two rooms of our house.  It's AWESOME, highly recommend!", "verified": true, "helpfulness": "1/1", "author": "Macadamia"}, {"rating": 2.0, "review": "I unfortunately did not have this great experience that everyone else does.  The image is blurry, and jumpy, and the sound does not match up with the people talking.  I will just stick to running a cable to the TV, for perfect picture and sound everytime!  While $35 isn't much, it was a waste of money.", "verified": true, "helpfulness": "1/1", "author": "Richard Howie"}, {"rating": 5.0, "review": "We regularly watch netflix through this.  Easy to control with our phones or ipads and once the content is streaming we can use our phones // tablets for other browsing or apps.  We also have occasionally cast web pages.  We like no longer needing to have our ps3 on.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]