[{"rating": 4.0, "review": "Great....wish it had a remote.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "I absolutely love my Chromecast. Although they still don't have as many offerings as some other products they have been coming fast and furious recently. I would highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Gordon Cummings"}, {"rating": 4.0, "review": "I would of gave it a 5 star, but I had trouble setting it up. You see when I was done setting it up it wouldn't work all it said was, \"Connected to internet, but can't connect.\" So I had to call my internet provider (Comcast) after 2 hours the man I was speaking with was able to connect it. Also when you buy this and have trouble making it work I recommend contacting your internet provider and they would help you. Don't return it because you get aggregated. It is worth every penny and its working amazing!!!", "verified": true, "helpfulness": "0/0", "author": "Selena Rios"}, {"rating": 5.0, "review": "This is great product and works great with all my samsung products as well as my laptop.  I have recommended this product to others.", "verified": false, "helpfulness": "0/0", "author": "Ruben E Ayala"}, {"rating": 2.0, "review": "poor result, frequent signal problem never worked more than ten minutes i don't think its my wifi problem i checked my wifi speed its perfect, all other device working great except this stupid chromcast, i m not using it any more because of frustration", "verified": true, "helpfulness": "0/0", "author": "Mukesh Kumar"}, {"rating": 5.0, "review": "chromeTimes!", "verified": true, "helpfulness": "0/0", "author": "Paul Faith"}, {"rating": 1.0, "review": "It hardly worked", "verified": true, "helpfulness": "0/0", "author": "Josh B."}, {"rating": 5.0, "review": "Love the Chromecast. Wish I had one of the phones that can mirror there screen to it, but it's not been that big of a deal. Pair the Chromecast with some all's and you can get all your media on the TV. I use it in combination with a Plex server and it's beautiful. Have some media on my phone, use Allcast or Localcast. I used the WatchESPN app to stream the World Cup live, in HD (my TV cable provider was terrible quality). Use Google Play or Pandora for music. Cast some funny YouTube clips and show family photos from our most recent travels. More apps continue to support Chromecast and updates for Chromecast continue as well. Love this little thing.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Excelent! Does what it says, turns your TV on a SmarTV.", "verified": true, "helpfulness": "0/0", "author": "Jônatas David Hübner"}, {"rating": 1.0, "review": "Did not like it, very hard to set up unimpressed.", "verified": true, "helpfulness": "0/0", "author": "Matt Engebretson"}]