[{"rating": 5.0, "review": "This is the coolest thing! Streams all the videos I want! plus totally easy to set up, just follow some simple directions in the box! Highly recommended!!!", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Installed and configured in less than 5 minutes. Never had any problem with it, it just works, and more services are going cast-enabled every week. I love being able to control Netflix, YouTube etc. using my phone or tablet. Now if I could get my TV, my A/V receiver, my PS3 etc. to do the same...", "verified": true, "helpfulness": "0/0", "author": "J. C. Ellett"}, {"rating": 4.0, "review": "Highly recommend this for anyone who uses a tablet and wants to port video to TV. I would highly recommend downloading the app allcast to go with this product!", "verified": true, "helpfulness": "0/0", "author": "Gavin Dehler"}, {"rating": 5.0, "review": "Chromecast is God's wonderful gift to mankind. The device streams seamlessly from Netflix, Hulu Plus, and HBOgo. I had an issue setting it up, but it was my computer's fire wall. Using the iPhone app eliminated the issue, and Google's Help Desk was more than helpful.", "verified": true, "helpfulness": "0/0", "author": "Amanda Hoddy"}, {"rating": 4.0, "review": "I'll admit it... I love this device. Makes playing netflix movies ultra-simple and avoids having to boot up the PS3 or similar bulky devices to connect. I can use my phone or any of my android tablets to control it (I think it also works with Apple products, but I'm not positive and certainly have no experience with it). Any movie I stream works flawlessly and without synchronization issues. In the case of Netflix, I get playback control on the device I start the cast with, and get options for languages and subtitles that are easy to find.I also found that it works well with DLNA content, and streams media from my mythtv DVR as long as I put a transcode job on all of my recordings to something the Chromcast can understand. There are multiple apps available to chromecast DLNA content, I'll leave it up to you to find your favorite.On the downside, it would be nice to have a device that can display whatever is on the screen of my device, but this isn't it. This merely connects to media servers and streams, with control from local devices.", "verified": true, "helpfulness": "0/0", "author": "Richard F. Ostrow Jr. \"KShots\""}, {"rating": 5.0, "review": "Very nice chrome product. able to stream 1080p you tube videos and i am happy with this.I recommend this product. .", "verified": true, "helpfulness": "0/0", "author": "Ravindra"}, {"rating": 4.0, "review": "After unpacking, it was installed in a glimpse. New tools on mobile and desktop offered everyday.Now you can play your favorite movie from the Chrome tab on a desktop", "verified": true, "helpfulness": "0/0", "author": "Ahmed F Soliman"}, {"rating": 5.0, "review": "I really love this product. Honestly, it makes my time at home really joyful. I cannot afford cable TV because the service cost is ridiculously expensive. But, right after I got the Chromecast, I normally use it to watch the shows and episodes. It is quite easy to operate.", "verified": true, "helpfulness": "0/0", "author": "leo"}, {"rating": 5.0, "review": "Love it! Saves tons on electric. Works just as described and so easy a child can work it. Plus it gives parents another tool to limit tv time.", "verified": true, "helpfulness": "0/0", "author": "Teresina Haywood"}, {"rating": 4.0, "review": "Pretty nifty little device, streams Netflix wonderfully as well as HBO GO. Hope that they port Showtime to it.unaware that it had to be plugged into power,but that was my lack of research. Luckily it wasn't an issue. Lack of apps on it is why I only gave it 4 stars but more are being developed all the time.", "verified": true, "helpfulness": "0/0", "author": "Barbara Kessel"}]