[{"rating": 5.0, "review": "Google has done it again. If you have Netflix, Amazon FireTV and a Chromecast you have the best of all worlds.", "verified": true, "helpfulness": "0/0", "author": "James F. Rendek"}, {"rating": 5.0, "review": "awesome product. I can stream everything from anything to my tv. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "DP"}, {"rating": 5.0, "review": "👍👍👍👍👍", "verified": true, "helpfulness": "0/1", "author": "abdullah"}, {"rating": 4.0, "review": "Good stuff", "verified": true, "helpfulness": "0/0", "author": "Case"}, {"rating": 5.0, "review": "Tops. Simple to install. Supported by many. Inexpensive.", "verified": true, "helpfulness": "0/0", "author": "Kenneth A. Schwarz"}, {"rating": 5.0, "review": "My son uses this.  Works great.", "verified": true, "helpfulness": "0/0", "author": "Norman Staub"}, {"rating": 5.0, "review": "Finally a way to view items on my laptop without HDMI wires.", "verified": true, "helpfulness": "0/0", "author": "PGP \"Rketek\""}, {"rating": 2.0, "review": "Very frustrating for me. The audio goes through the HDMI and can not be separated so I cannot use Bluetooth on any device and my speakers only accept a Bluetooth signal. I wanted it for my Optoma ML750 projector so I would not have to have my devices plugged in but by the time you attach it and with the power cable in the back and then add the stupid Optoma audio out cable which is attached to the outdated VGA cable and with a Bluetooth transmitter dongle attached the whole package is more bulky than having a tablet attached so it is a waste of time. Also what a shame it does not work offline. Yes with WiFi but no internet is what I mean by offline.", "verified": false, "helpfulness": "0/1", "author": "Morrisonlife"}, {"rating": 5.0, "review": "Own a couple of these . they work great.", "verified": true, "helpfulness": "0/0", "author": "BRIAN NICHOLL"}, {"rating": 5.0, "review": "it is working 100% love watching latest movies and others which i have not seen in the movies.", "verified": true, "helpfulness": "0/0", "author": "james rankel"}]