[{"rating": 4.0, "review": "this device does what it says and works and has a very easy setup I'm really happy with it I use it a lot but the only reason it didn't get 5 stars is the limited apps that work with it there will be more in 2014 but as of now theres only 10 apps outside of the few Google Apps there's Netflix and hbo go which is good I'm just waiting for more but I would say it's cool device and for the price it's hard to not recommend", "verified": true, "helpfulness": "0/0", "author": "tougherrob77"}, {"rating": 1.0, "review": "I was very excited to buy 4 of these and ended up using none. If all you want is to stream youtube or netflix, it might do (even though it is wonky) . But most of us want more: stream your tablet or phone display or some media files from your pc. It does none of those!In its usual \"ppl have to do it my way\" google has deliberately blocked those so that you can inky use sanctioned apps and there are few of those. Way to go! I ended up selling them and buying 1 roku 3 and 1 wd.", "verified": false, "helpfulness": "1/2", "author": "Ciapi"}, {"rating": 5.0, "review": "Awesome product....sooo useful..should have ordered much earlier. great interface with laptop and smart phone. Chromecast is great for everyone, get rid of HDMI cables", "verified": true, "helpfulness": "0/0", "author": "Umang V."}, {"rating": 5.0, "review": "I bought one in Houston TX and brought it to Mexico. To set the new wireless I did the factory reset [pressing the button for 20+ seconds] ran the setup again in my laptop and got connected! :D The only apps I had tried were Netflix and Youtube, both work OK when controlled with my android phone.", "verified": false, "helpfulness": "0/0", "author": "J. Carlos González \"jcx\""}, {"rating": 3.0, "review": "Not to be too demanding the product lag is an issue plus more apps is needed. overall I like it!!", "verified": true, "helpfulness": "0/0", "author": "hans Chungong"}, {"rating": 2.0, "review": "Chromecast is not compatible with Apple Airport routers! It will not connect at all. I had to return it. Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "jd_4"}, {"rating": 1.0, "review": "I tried to watch Comcast on my TV. It reminded me of watching the moon landing in 1969. They have nerve taking your money for this piece of junk. After waiting forever to download the new version you get something called \"beta\". This thing is going in the trash and I'll use my $6.00 HDMI cable which actually works. I do not understand why anyone would use this device. The video and sound quality are both terrible.", "verified": true, "helpfulness": "1/2", "author": "Vincent Seidita"}, {"rating": 4.0, "review": "Even at its relatively cheap price, I still struggle to see the value in this thing if you already own a Roku, smart TV, game console, Apple TV, etc. If somehow you don't have any of the above in 2014, then this will do the job and allow you to stream Netflix, Hulu, and YouTube by receiving it from your laptop, phone or tablet--but be sure that your device is compatible, as there are still a lot of kinks that Google has yet to work out in terms of compatibility. Amazon video or many other apps that devices like Roku allow are not available.It's fully capable of streaming all of your local media from all of your devices, but Google blocks this ability and offers no alternative of their own, not yet anyway. Google has crippled this technology, as this device is capable of so much more. Even if it could stream anything and everything on your devices, I already have HDMI cables for my phone and laptop (even cheaper solutions), so again, I don't see the value in owning this device unless you don't have a smart TV and/or devices that are already capable of streaming video.EDIT: Well, I'm revising this review as Google has since addressed many of my concerns with the release of the Chromecast SDK. Additionally, compatibility has improved and there are quite a few apps that support Chromecast (including Aereo soon), now making it a viable competitor to Roku. I also prefer using my existing mobile device as a remote control rather than having yet another remote. Additionally, using the app's interface on my phone is far easier to me than navigating it on the TV with a little remote.I don't feel there is anything mind-blowing that developers have done yet, but the ability to stream local media is a huge plus that bumps my original rating up by a few stars. I'm excited to see what others can do with the SDK. I think there is a lot of untapped potential and it's a steal of a deal for what you may get in the future, and it's quite good for what you get out of the box as well.Amazon Instant Video is still not supported, which is a shame, but I have other devices that can stream this, so it's not a dealbreaker. Tabcasting needs work and is quite a memory hog on the PC, but I've primarily been using it to stream Comcast Xfinity (live TV channels, on demand content) and it generally works well with a few hiccups.Overall, I'm glad that Google has listened and that things are looking up for the Chromecast. Hopefully the support continues and we'll also continue to see new apps churn out for the device.", "verified": false, "helpfulness": "3/3", "author": "L. Humphrey"}, {"rating": 2.0, "review": "I found this devise and I was so happy to have a way to stream to my tv.  As I don't have cable and watch most stuff on my computer or phone this was going to be great.  It was very easy for me to link my computer but I am still have issues connecting my phone.  I watched several shows on it and it is slightly delayed from what's on the computer and at times the audio doesn't sync up.  The device drops some times and I have to restart the connection.  I don't hate it but I am very disappointed in it performance.  as I don't have any issues with my other wireless devise I must assume that it is the google chromecast.", "verified": true, "helpfulness": "1/1", "author": "Scott Wright"}, {"rating": 4.0, "review": "The functionality is limited, but the device works as advertised.  It works pretty well, but I would like to see folders that have no broadcast potential, like documents an pictures.", "verified": true, "helpfulness": "0/0", "author": "EEWoos"}]