[{"rating": 5.0, "review": "Works and looks like the new units I have purchased. Don't hesitate to buy this", "verified": true, "helpfulness": "0/0", "author": "Michael Glenn Roberts"}, {"rating": 5.0, "review": "LOVE my amazon fire tv. There is only one drawback, and that is the very small size of the remote. WE CAN NEVER FIND THE REMOTE. Still 5 stars, I'm sure I will find a solution such as tying a brick to the remote.", "verified": true, "helpfulness": "0/0", "author": "Jimmy"}, {"rating": 2.0, "review": "Scam to get you to pay for movies.", "verified": true, "helpfulness": "0/2", "author": "Bill"}, {"rating": 5.0, "review": "Absolutely love it. Works great no problems here.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon fire has more than exceeded my expectations.  Its supper easy to use as well", "verified": true, "helpfulness": "0/0", "author": "Brenda Carmichael"}, {"rating": 5.0, "review": "Amazon Fire TV is super easy to use.  I'm not super technologically savvy, so up until today I was using a Nintendo Wii to stream everything and it was awful. Fire TV changed my life~ thanks Amazon for designing such a great product!", "verified": true, "helpfulness": "1/1", "author": "Amanda"}, {"rating": 2.0, "review": "It's okay. My crappy internet doesn't help though, and it stops a lot to load. Also, apps like Netflix and Hulu randomly sign out sometimes. There's a lot of icons on the home page, but it's really just a lot of the same crap over and over again. My parents have a Roku, and that is what I will buy next when this craps out on me, or I get sick of it. Another option is a wi-fi connected Blu-Ray player. I had one before that stopped working and that's why I bought the Fire TV. My Blu-Ray player with wi-fi allowed me access Facebook and other websites that this product does not.", "verified": true, "helpfulness": "0/2", "author": "Kristen Maloney"}, {"rating": 3.0, "review": "trouble streaming mlb.tv", "verified": true, "helpfulness": "0/1", "author": "richard wollmuth"}, {"rating": 5.0, "review": "Streams programming & movies interruption-free. Most music apps can be enjoyed thru a surround sound system without leaving the tv on(I think it's only 'Tune in radio' that needs the TV on to function).A great choice of movies & viewing not available from cable.", "verified": true, "helpfulness": "0/0", "author": "R. J. Norkus"}, {"rating": 5.0, "review": "Love it, easy to set up and use! Good price too!", "verified": true, "helpfulness": "0/0", "author": "plata"}]