[{"rating": 5.0, "review": "Great performance and love its size and mobility.  Plus the ability to personalize is nice", "verified": true, "helpfulness": "0/0", "author": "doug"}, {"rating": 5.0, "review": "This FIRE TV is awesome! I've used ROKU 2 for 2 years and it was good but the FIRE TV blows it out of the water. Do not get it just for what it does but for what it could do. It's really fast and the microphone works great, although I wish it worked on other apps not just on Amazon prime platform.", "verified": true, "helpfulness": "1/1", "author": "Omar Perales"}, {"rating": 2.0, "review": "I really liked this unit. It is fast and work beautifully, except of Hulu which doesn't work at all. It will work for a while and then the sound plays, but only black screen. It has been that way from the beginning and Hulu blames your internet provider or Amazon and vice versa. So If you watch hulu a lot this will not work for you.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "1/1", "author": "Dan Thuet"}, {"rating": 4.0, "review": "I have had some issues but not with Amazon Fire per say, I think it was the HDMI cord wasn't a good enough one. I have recently upgraded it to a much better quality one. So we will see .", "verified": true, "helpfulness": "1/1", "author": "Neely R."}, {"rating": 5.0, "review": "Excellent device when paired with Amazon Prime", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Frederick A. Meloy"}, {"rating": 5.0, "review": "works fast, downloads quick, and has several great features my wife and I enjoy daily", "verified": true, "helpfulness": "0/0", "author": "lees86"}, {"rating": 5.0, "review": "So simple even a low-techie can set it up.", "verified": true, "helpfulness": "0/0", "author": "frankie robertson"}, {"rating": 3.0, "review": "Worked well when I had the bandwidth. Unfortunately, my internet with DISH TV does not have a package with enough GB to use it but once a month. Otherwise, I enjoyed it while I had it.", "verified": true, "helpfulness": "0/0", "author": "earthwindfire"}]