[{"rating": 5.0, "review": "Have an Apple TV 2 that I mainly use to use XBMC player on it. Since the ATV2 is a few years old it lags a bit when you navigate around the UI on XBMC. Wanted something more powerful and faster to navigate through the interface so the FTV was my choice.The Amazon content is also good but helps a lot if you're a Prime member.", "verified": true, "helpfulness": "0/0", "author": "Ruben Garcia Jr."}, {"rating": 5.0, "review": "BETTER THEN ROKU", "verified": true, "helpfulness": "0/0", "author": "Naima"}, {"rating": 2.0, "review": "I wanted tho like Fire TV so badly, but the Netflix problems are driving me back to my Roku.  Each day when I try to access Netflix, I have to log in with email and password.  Then I'm told that I can't access Netflix because I don't have an internet connection.  But wait!. If I press Home again, I'm logged in.  I'm tired of this routine.  I also do not like how Netflix appears, with one movie featured largely on the top, and the movies I am browsing appearing very small underneath.  I do like voice commands though... It just takes a very long time tho get tho my favorite programming.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Amazing XBMC/Kodi streamer.", "verified": true, "helpfulness": "0/0", "author": "Tracey S."}, {"rating": 4.0, "review": "so far I love the fire TV.", "verified": true, "helpfulness": "0/0", "author": "Andrica Hamilton"}, {"rating": 5.0, "review": "Love this thing... so much faster than WiFi DVD player.  VERY small and takes up NO room.  Only problem we had was trying to figure out how to turn it off, no off button on remote, so had to unplug it.  VERY good quality picture and easy to navigate thru menu's and lots of choices in programming.", "verified": true, "helpfulness": "0/0", "author": "dbosse"}, {"rating": 4.0, "review": "In a span of 2 days, I bought both the apple TV and amazon fire TV. Hey, it was Black Friday/ Cyber Monday and I was really confused about which one I should go with! I am fully entrenched in both the apple ecosystem and in Amazon Prime. So, both seemed to fit my needs pretty well.I wrote a review of Apple TV and said that I was underwhelmed. I have to admit though that with Amazon Fire, I'm actually quite happy with the functionality.For both streaming devices, it annoys me that I will always still require a cable subscription- neither gives me freedom because the apps I want to use require them. But onwards- I must accept that this is going to be my fate. However, I definitely see both being used for different reasons.For Apple TV, airplay will be used when I want to show my family pictures or videos off my iphone/ipad. Or I want to project whatever is on my phone- I kind of see Apple TV as my easy to use projector.Amazon fire tv...the voice control is awesome. It hasn't not understood me once! I did have an issue about 2 minutes into setting it up where voice control didn't work. at all. so I had to take out the batteries and reset everything. It'll be annoying if that happens again but the amazon sales rep has assured me that should it happen again, they will replace the remote. Love Amazon. Also, I like that I don't need to have direct line of sight for the remote. SO GREAT. I have way too much stuff going on in my small apartment- line of sight is sometimes a luxury I don't have :oD And also I like the way the remote itself feels much better than the apple TV remote. It is sturdier, the buttons don't feel like they are so interconnected that when I push one, I feel like I'm pushing multiple buttons, which is how I feel about the apple TV remote.I love prime. I've been a prime member for so long that I can't imagine life without it (my wallet would probably be happy though...). But I've already gotten used to watching movies and TV shows off of prime so my ability to do so using amazon fire is pretty much seamless. I do have to say that the general search functionality and remote movements are a little annoying- having to scroll down and side by side to get to certain apps etc- it doesn't seem smooth but that may be because it's a new system for me. Maybe with practice, I won't notice it anymore?It is annoying that voice control doesn't work outside of searching for amazon prime stuff- come on, we've bought into the system- increase functionality please! But until that happens, I guess we'll just have to search manually. Although with youtube, you can connect your computer and use your keyboard to search. AWESOME!!With amazon fire, I can't project the stuff from my phone onto my TV. i'm not sure if it works with the amazon tablets but I'm too entrenched in my ipad and iphone so it's not an option for me anyway. So definitely, this helps me really delineate the use of the two systems.Otherwise, I'm sure that as time goes on, I will be getting more fluid with each of these systems and I'll find more things I love and hate about each of them. But I definitely think that as you decide on which system to get, think about what you use most. I use my iphone to take lots of pictures and videos of my twins and I'm so excited for my mom to come over so she can see them on the big screen! For that alone, apple TV is worth it! But my TV shows and movies are all on prime (love my free prime shows!!) so it was a big pain to have to project amazon instant video using airplay to apple TV- I experienced lags and I thought the clarity wasn't great. So, in this case, amazon prime is awesome. So for me, it seems, having both is good because each fulfills a certain need.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I can't use it with my projecter. The voice is not nomal. I have to buy another apple TV.", "verified": true, "helpfulness": "1/4", "author": "Ning Liu"}, {"rating": 2.0, "review": "I have bought and used Roku, Netgear streamer, and WD Tv, and now the Amazon Fire Tv, in which we were so excited to get, but what disappointment, and we are just baffled by all the hype this streamer is given.Pros: Looks good and sleek, pretty image quality, the voice command is also great, but too bad it mostly works only for paid Amazon products! So if you are also looking to use this to replace your cable etc, just cannot see it personally at all, still will cost alot of addtl money!Cons: (After Speaking with Amazon Tech Support to confirm)  No Keyboard on remote like WD TV and other user friendly streamers, The Netflix app to access your Netflix library is still not working, and online reviews shows these problems going back a few months now!,  Another Major deal killer for me, here in 2014, is that Firetv is not even set up play any of your personal media from Ext Drive like videos, music or photos etc, pretty much just an online & Wifi streamer only, even though the Fire tv has a USB port, which is baffling to me, but this is the info was given by there Support.Could not really find much good Free movies etc, so you must also buy Amazon Prime for an addtl 9.00 per month or another 110.00 per year , just to get mostly older mediocre movies etc. All the newer movies are approx 3.99-12.99 each. Cannot believe people still pay almost 5.00 or more to watch an older movie releases, when you have Netflix/Hulu etc!Cannot download from Google play etc, only from high priced Amazon.com.  *Even though there might be ways around some of these Fire Tv cons mentioned, but I did verify most of this with their Tech Support on phone etc.Bottomline, the FireTv does not even come close to my WD TV player, in which I can do so much more, so my search for a better streamer continues, or until Amazon fixes and upgrades at least the Netflix app problem, along with not being able to play external drive items, this to me, is just an Ok streamer so far!", "verified": true, "helpfulness": "1/2", "author": "lw \"lw\""}, {"rating": 1.0, "review": "Amazon will brick the device if you try to make the product more useful.", "verified": false, "helpfulness": "2/6", "author": "B. Stovall \"Monarch\""}]