[{"rating": 5.0, "review": "can't complain, usually I see netflix and youtube so it covers my needs. Works great with my tablet and cellphone. Also the plug in for the chrome on my lapton works fantastic. I can see my screen on the tv for easy play of videos that are not youtube related", "verified": true, "helpfulness": "1/1", "author": "Humberto Alfonso"}, {"rating": 4.0, "review": "I love love love this thing for Hulu, Netflix, Pandora, and HBO Go.Wish I could stream my local MP3s and MPGs or do Amazon Prime Video (do you hear me Amazon!!!!)", "verified": true, "helpfulness": "1/1", "author": "Gary Scott"}, {"rating": 4.0, "review": "All in all the device works well.  There are some overall kinks with the wifi connection, which can lead to slow playback1. There is a minor delay in the casting.  Which can lead to synchronization issues between audio and video, however the chromecast does its best to correct this and can be quite impressive.2. There are times when playback becomes garbled and leads to the casting to crash.  The wireless router is in the same room so it's definitely not a low signal issue.  However, in all fairness it could be a router issue as I have not tested with another router.3. I've also had some issues casting from other devices such as my galaxy note 2 or an asus taichi laptop, where the chromecast reports the device is too slow for successful playback!  Again this could be a router issue but can be a drag.", "verified": true, "helpfulness": "1/1", "author": "Daniel Zeledon"}, {"rating": 5.0, "review": "I wanted to watch Netflix on my TV from my Kindle. Twice, I purchased the cable here that was specifically for the Kindle to HDMI and it didn't fit the Kindle so I sent them back.  I was considering a Roku box or something similar.  Then I saw an ad for the Chromecast.  It's the answer to what I wanted to do and much better than a box for only $30.  I set it up in 5 minutes.  Pretty cool.", "verified": true, "helpfulness": "1/1", "author": "A-Gato \"Aly Gato\""}, {"rating": 4.0, "review": "For the price of this gadget it is well worth it, not that is a must have but for the cost, it is not bad. I found that casting streaming movies from my lap top (internet) to my TV, it plays sluggish and behind. When streaming from YouTube, Netflix or any of the apps that come with the Chromecast there is no problem and plays well.I have kids at home and it is fun to all play our favorite web content from our hand held devices to share with each other. Super easy to install and again, well worth the $35.", "verified": true, "helpfulness": "1/1", "author": "Miguel"}, {"rating": 3.0, "review": "It is good for bringing in youtube videos to the TV. I already have a PC hooked up so didn't make much of a difference there. I couldn't really find a whole lot of utility for it. Might be good to use while travelling", "verified": true, "helpfulness": "1/2", "author": "Abdul S Sait"}, {"rating": 1.0, "review": "Not as easy to install as advertised.  Google customer service could not help with the installation over the phone. They blamed my router. I'm sure for some people the device practically installs itself. The instructions are very poor if you have a problem. Basically just pictures with no words. Had to return the item to Amazon.", "verified": true, "helpfulness": "1/2", "author": "Stephen J. Reid"}, {"rating": 5.0, "review": "Hi Everybody,This is a very useful gadget to have. Setting up is very simple and takes only a couple of minutes. The only draw back for some people is that not many applications support it at this stage.", "verified": true, "helpfulness": "1/1", "author": "Bob"}, {"rating": 4.0, "review": "Easy to use, and install. Only works with YouTube and Netflix. Would like to use it for other streaming channels.", "verified": true, "helpfulness": "1/1", "author": "Andrew J. Calvert"}, {"rating": 4.0, "review": "Works great! Nice little toy to have if your on the roads and traveling. Easy to set up, and will not kill the battery on your device because it doesn't actually stream from you Mac ,iPad etc . It finds whatever you played online and plays it itself. Only reason it's not getting 5 stars is because when you unplug it and bring it to a different Wifi network it will not show up with a \" would u like to join this network ?\" Question. It only remembers the last network u were on so every time you get on a different wifi network you have to go back and set it up every time like it's a new devise, and it's the first time u plugged it in. Not a big deal it only takes about 4 extra minutes, but if u leave it plugged into ur tv on the same network all the time u won't have this issue.", "verified": true, "helpfulness": "1/1", "author": "Eric Swieca"}]