[{"rating": 2.0, "review": "I bought one of these without doing the usual amount of research that I do. As it had good ratings and was cheap I thought it was low risk.Easy to setup with the iPad app but that is about all I can do with iPad. There is no support for the IOS version of Chrome and disappointed that there is no support for Amazon video on demand.Google really needs to commit to more apps across all platforms to make this worth while.", "verified": true, "helpfulness": "1/3", "author": "Steely"}, {"rating": 3.0, "review": "Fruitcake Stick. I did not know, it was this limited in functionality. This is just a glorified Youtube stick for your tv. All of this functionality is doubled in your smart tv, roku box , Apple TV, WD TV box, etc. there is nothin special going on here, except that this stick will build out the reach for YouTube .... Lame and old news.", "verified": true, "helpfulness": "0/3", "author": "prince1099"}, {"rating": 2.0, "review": "So far, I'm about 4 hours into trying to install this gadget with no luck.Apparently there is an issue with Verizon FIOS router....can't find help anywhere....", "verified": true, "helpfulness": "0/2", "author": "Curmudgeon"}, {"rating": 5.0, "review": "I've got this for my girlfriend who had no way to connect Netflix to her TV other than to plug her computer in via HDMI every time.  This allows her to turn on her TV and stream Netflix using her iPad/iPhone as a remote.  We've experienced some hiccups but the dongle is actually pretty darn far from the router so I must say the range is pretty good for a $35 device.As for using this to stream your computer screen to your TV it only lets you stream your chrome browser and there is some SEVERE lag.  But for the price and capability of streaming Netflix with ease I can't complain.  5 stars it is.", "verified": true, "helpfulness": "1/1", "author": "Ryan B \"Byrd\""}, {"rating": 4.0, "review": "The only complaint I have is the lack of apps that support the chromecast. As more apps come to support the chromecast its usefulness will increase. Sometimes if you stop streaming from one device and start trying to stream from another devise, the chromecast gets confused. You have to fully exit the player from the previous devise before trying to stream from another.", "verified": true, "helpfulness": "1/1", "author": "Jethro Veebane"}, {"rating": 5.0, "review": "The Chromecast was a breeze to set up. Simple to use to watch Netflix, YouTube, surf the internet using the Chrome browser, or watching Network shows (CBS, FOX....) also through Chrome browser. Very happy with this product.", "verified": true, "helpfulness": "1/1", "author": "Jason T"}, {"rating": 3.0, "review": "3 stars is good and that is what it is - I can get U-Tube and other things on my TV", "verified": true, "helpfulness": "0/0", "author": "Jim Bee"}, {"rating": 5.0, "review": "Works Great, Very happy, Great price, Easy to set up and use,Will get another one for the bedroom television. The picture and sound quality are excellent.Needs a good wifi signal, we have a small house, so it may have issues in a larger 2 or 3 story house if your wi fi device is far away.But it works perfect in my house", "verified": true, "helpfulness": "0/0", "author": "vino 666"}, {"rating": 5.0, "review": "this device is very easy to set up, price is reasonable and right, picture quality is very good. I would recommend this to people who has old lcd tv which doesn't have wifi build in.", "verified": true, "helpfulness": "0/0", "author": "linus"}, {"rating": 5.0, "review": "I bought this yesterday and I love it. The setup is simple as plugging it in and following the directions on the screen. I can't get enough of it. It definitely beats having to watch hulu plus on my chromebook by a long shot. When I was streaming from my chromebook, I noticed that it was lagging. But, once I streamed it from my phone it was perfect. I don't miss watching regular tv anymore because it seems like nothing is ever on. Not only can I watch whatever I want on my tv whenever I want, I can also listen to music from google play. Im sure many people are wondering if their tv can support chromecast, well most, if not all tvs can support it. All you need is an HDMI port, the usb port is optional because the chromecast comes with a usb cord and a wall charger that can attach to one another so that you can plug it into the wall but, an HDMI port is a must. So, go buy one, it's totally worth it.", "verified": false, "helpfulness": "0/0", "author": "Israel Johnson"}]