[{"rating": 3.0, "review": "WHEN USING CHROMECAST WITH THE IPAD NETFLIX APP, NETFLIX AND CHROMECAST LOSE THEIR CONNECTION. THIS HAPPENS EVEN IF AUTO-LOCK IS DISABLED AND THE IPAD REMAINS AWAKE THROUGHOUT THE MOVIE. RE-ESTABLISHING THE LINK REQUIRES POWERING OFF THE TV (AND CHROMECAST), KILLING THE NETFLIX PROCESS, AND DISABLING/ENABLING WIFI.THAT IS VERY POOR DESIGN OR IMPLEMENTATION ON THE PART OF GOOGLE AND NETFLIX. ONE OR BOTH OF THEM HAS FAILED TO MARKET A RELIABLE PRODUCT THAT CAN OPERATE IN A REAL WORLD ENVIRONMENT.i would rate it 5 stars for performance, but the reliebility issue knocks off 2 stars.", "verified": true, "helpfulness": "0/0", "author": "R. L. Enfield \"Ron Enfield\""}, {"rating": 2.0, "review": "I'm trying to use the Chromecast with Netflix right now.  The Netflix movie loads fine on my laptop, but as soon as I try to cast it to the TV, it gets stuck at 25% and fails.Also, if you're planning on using this in hotel rooms you are out of luck.  It's got no way to get past the \"enter your password\" or \"click OK\" type webpages.  So unless you have tethering or travel with a MiFi puck, you won't be using it on the road.", "verified": true, "helpfulness": "0/0", "author": "S. Carolan \"scarolan\""}, {"rating": 4.0, "review": "The chromecast has been pretty useful for sharing videos on the television. Only one complaint...it burned a chromecast sign on the Plasma screen because it doesn't have a screen saver that moves.", "verified": true, "helpfulness": "0/0", "author": "Burton L. Mendonca"}, {"rating": 5.0, "review": "This device works great for the price. I am able to stream anything from my chrome browser to my tv, and once it is set up it take 2 clicks and you are on your way. although you are not able to stream your own videos, that is not what this is intended for. it is such a great device and I can't recommend it enough if you are tired of paying for xbox live just to watch hulu or netflix on your tv.", "verified": false, "helpfulness": "0/0", "author": "michael cianfaro"}, {"rating": 2.0, "review": "It does what it says it will do - but it doesn't always do the best job.  When you boil it down - the Chromecast is really a way of trying to make a non-smart TV into a smart TV.Does it work?  Sort of.So far I've tested it out using my ipad and iphone, my kindle fire, and my macbook pro - to mixed results from each.iPad/iPhone - I'm lumping these together as they both utilize the same operating system, and more or less, utilize the same apps.  The services I used here was Netflix.  Unfortunately, the streaming was smooth and looked good, but the audio was out of synch.  Essentially unwatchable.  I've heard that they've since updated the apps and the audio is now in synch, but I have not yet confirmed.Kindle Fire - This is my go-to for streaming netflix to bedroom TV.  The stream quality to the television looks great, and the audio is perfectly in synch.  Be warned that if you're using a first gen kindle fire like me, the pausing/scanning won't really work that great.  Additionally, it can be taxing to change programs, or start a new one up after your program has ended and the kindle has fallen asleep.  If you're just putting on one episode or one movie and then just watching, it works fine.  The user experience could definitely use some tweaking, and I Imagine that will come soon.mabook pro - This is where the device really lost it for me.  One of the main benefits I was hoping to get out of chromecast was the ability to \"cast\" my chrome browser.  This was supposed to let me watch stuff on my main television (42\" HD LCD) in HD.  I wanted to be able to use it to cast hulu, or various browser only streaming shows such as cbs.com.  Unlike the netflix aps on my tablets/phone, the streaming was choppy.  The sound was in synch, but it was dropping frames all over the place. I tried lowering the resolution to 480p, but that actually lost the sound synch and kept the frame drops.  Bottom line - it's an okay way to cast your browser window to your TV, but don't expect a great experience.Bottom Line - it has the potential to be really great down the line.  At the moment, there are some positives (kindle streaming of netflix), but the the negatives greatly outweigh the positives.  Hopefully an update at some point will really make it the product it should be.", "verified": true, "helpfulness": "0/0", "author": "M. Andrews"}, {"rating": 4.0, "review": "Lost a star for limited audio quality with tab casting [beta] (can't use a spotify \"app\" because there isn't one, and it doesn't look like there's going to be any time soon.)Songza is an option but a limited one, along with pandora.With netflix, you have to switch to your computer, click next episode, and switch back to chromecast. No \"Next Episode\" button available while casting :( Lost a star.Hulu Plus, Youtube, HBO Plus. +1", "verified": false, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 3.0, "review": "Not much to do with it.  My TVs can already do what Chromecast offer.....nothing special.  DOes not have enough useful apps to put on", "verified": true, "helpfulness": "0/1", "author": "Pogi"}, {"rating": 3.0, "review": "We've been using the chromecast mostly with out laptop. Boy does it lag. Before we purchased the chromecast, we used an HDMI cord to connect to the TV so we could watch and listen to videos and music from our laptop. However, when you do view your whole screen to the TV, you can hear the sound from both the laptop and the TV. And their not in sync, so it sounds like it's echoing. I much prefer using the HDMI cord than the cast. It's a neat idea and I like how there's no cord in between my laptop and TV, but I can go without it.", "verified": true, "helpfulness": "0/0", "author": "Myla"}, {"rating": 1.0, "review": "I hate giving Chromecast an \"I Hate It\" rating, but this device deserves it.  The idea was to display whatever appears in the  GOOGLE CHROME browser, or whatever any authorized content provider streams.  But it does not display movies I select with the Ctrl-O option in Google Chrome on my computer and of course no such option exists for android Chrome, so I cannot play my own personal content with it using my Nexus 7 tablet or my Galaxy S2 phone.This dongle has one obvious purpose - to annoy the holy hell out of users while making money for Google and its commercial allies.By contrast, I can get a Quad Core Mk809 for around 60 bucks from China and have a full blown android tablet if I add a bluetooth keyboard or air mouse.  I bought that combo for about $80 6 months ago and it works beautifully streaming from my Asus RT-N66U wireless router's USB-attached pocket hard drive, or from the 32G Sandisk Ultra microsd chip plugged into a MK809 slot.I will say this:  the Chromecast dongle is a work of art, just beautiful and solid feeling with an elegant design, and so is its packaging - top drawer, first class, pick of the litter.  But I didn't buy it for that.  I bought it for one thing only - to watch selections from MY MOVIE COLLECTION.  And for that it is absolutely lousy, NFG, and a scam.", "verified": true, "helpfulness": "0/2", "author": "Bob Hurt \"Bob Hurt\""}, {"rating": 5.0, "review": "I love this product , it does exactly what I thought and I am very very satisfied with this order love it", "verified": true, "helpfulness": "0/0", "author": "sue Powers"}]