[{"rating": 2.0, "review": "All hype - no content.  You have to use Chrome browser, Netflix, or YouTube.  spend the extra cash and get a Roku.", "verified": true, "helpfulness": "3/4", "author": "Matt"}, {"rating": 3.0, "review": "It's not very impressive.  Once my IPAD goes to sleep, the movie on the TV screen keeps going, and I can no longer control it from the IPAD.  If I only watch half the movie, I usually have to try to figure out where I was when I stopped.  For netflix, Apple TV is head and shoulders above this product.", "verified": true, "helpfulness": "0/0", "author": "Winelover \"Wine lover\""}, {"rating": 2.0, "review": "This does not work on a desktop computer. Maybe you can get it to work if you are a 23rd degree geek. I am just a 5th degree geek, and I have been searching on Google and other sites, including appeals to the Chromecast technical experts. If I ever get it to work, I will post again. Warning! If you plan to run this on a desktop, you are in for a world of hurt.", "verified": true, "helpfulness": "1/5", "author": "H. A. Scarbro"}, {"rating": 5.0, "review": "The Chomecast dongle was a breeze to install & it worked on my Samsung tab 2 7\" after installing Google Chrome  plus cast. Had to install Chrome browser then add cast to it on My PC win7 for it to broadcast from it. You have to have some sort of tablet , PC or Mac to get it going.", "verified": true, "helpfulness": "0/0", "author": "Den"}, {"rating": 4.0, "review": "I love the functionality and for the price you cant beat it. But unfortunately the amount of apps is still very limited and I find myself using it sparingly because of it. I don't regret the purchase especially for 35 bucks, but at the end of the day it is not doing different than what my current setup cant do. I do remain hopeful that more content will be view-able soon.", "verified": true, "helpfulness": "0/0", "author": "Jesus S."}, {"rating": 1.0, "review": "I thought this was going to be like Apple TV and allow me to mirror my display so that we could look at things together.  Unless you're watching movies, it is a complete waste of money and setup time!  I would expect something useful from Google.", "verified": true, "helpfulness": "0/1", "author": "Denny Schooley"}, {"rating": 5.0, "review": "Picked this up for my kids. They love the Youtube, and I was tired of watching them all crowded around my son's 17\" monitor.Youtube streaming is fantastic. I normally don't get 1080p content on my desktop, yet the chromecast gets it everytime. Same for Netflix.The TV I have this on IS a smart TV, but the interface is sluggish and horrid. It has the ability to stream Netflix, and we never do it because it runs like molasses. The tablet makes for a very nice interface, and it's already hooked up to my accounts. Win.I have also used it to \"broadcast\" tabs from my PC for presentations. Very cool to be able to use a big display for showing off my new app while you manage it from your PC. We have even used this for presentations at Trade Shows.I really wish it had a way to natively cast local content, but hopefully that will come. If you want an easy way to get your cloud content on your TV, this works great.", "verified": true, "helpfulness": "1/1", "author": "Jason E. Maggard \"nothing4sale.org\""}, {"rating": 5.0, "review": "This thing is just AWESOME. For the price tag it is just so convenient and exactly what we needed. We have always watched the majority of our TV on the computer since we don't have cable. This allows us to put Hulu, Streampix, etc on our television. I was so impressed that the sound goes right to the TV along with good picture quality. This does exactly what we needed it to do, and now we're watching our shows on a 46 inch TV instead of a little computer screen. I just hope all of the websites we use don't end up blocking this.... but it works for now! :)", "verified": true, "helpfulness": "1/1", "author": "Mrs. A"}, {"rating": 5.0, "review": "This is the cheapest and easiest way to make any TV with an HDMI input a smart TV.  Setup is simple, syncing with your portable device is a snap, and sending content to the device takes two taps.", "verified": true, "helpfulness": "0/0", "author": "Mark Howard"}, {"rating": 4.0, "review": "This is a nice little device, streams seamlessly from netflix, however I am facing problems for youtube casting. video gets frozen every 2-4 mins, if I cast from my android device or youtube.com. However it runs smoothly if I use the browser plugin. I wish it could  stream video from my pc.", "verified": true, "helpfulness": "0/1", "author": "junaed"}]