[{"rating": 5.0, "review": "Amazing tool to buy it ... works with iPad and Note 2 ... ^_^", "verified": false, "helpfulness": "0/0", "author": "Abdul-Rahman Boota"}, {"rating": 4.0, "review": "Good....  კარგია", "verified": true, "helpfulness": "0/0", "author": "Gia"}, {"rating": 3.0, "review": "i dont like to use", "verified": true, "helpfulness": "0/0", "author": "farid boudez"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "P Slim"}, {"rating": 3.0, "review": "It does its job, most of the time. Cheaper than cable or an Xbox, but glitches a lot! I was very disappointed. The trick is to unplug it as soon as you are done using it then plug it back in before you use it. If you plug it in too early, it won't be discoverable after a while. It's a good product, but would be much better if it could be turned on and off with your phone or laptop ( the same thing that controls what is casted ). Also my roommate says the download is so slow that it can't play movies from her computer (from the Internet) but that could be a problem with her computer or the wifi.", "verified": true, "helpfulness": "0/1", "author": "Molly"}, {"rating": 5.0, "review": "This is a great device when I figure  out that you have to keep them powered all the time. One of my TVs keeps the USB connector power all the time and it wasn't having a problem. The other one kills power to the USB port when the TV is off, so I had to power it direct with the power unit provided with the unit. The thing I like about Chromecast is that you can play your content on someone else's Chromcast unit. I purchased the content and I should be able to play it where and when I want. Apple TV has you locked to their device and so when you are at a friends house you are just out of luck playing your content and that is just wrong. If you want to carry your IPAD with you and remote it to the screen that will work, but it is just convenient to use your cell phone to play content when visiting friends.", "verified": true, "helpfulness": "0/0", "author": "SCI-FI Nut \"Gravy Grabber\""}, {"rating": 5.0, "review": "Item as described. A+++++ seller", "verified": true, "helpfulness": "0/1", "author": "varand mardirosian"}, {"rating": 3.0, "review": "It only works about half the time. I have come to expect getting up once or twice to unplug it while the TV is off and start over. I had to call Verizon to get a larger Wifi reach because HBO Go was constantly loading. Overall, I am satisfied enough to not return it, but sometime I scream at it.", "verified": true, "helpfulness": "0/1", "author": "Taylor G."}, {"rating": 5.0, "review": "Great device, I use it every day.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Richard B Fisher III"}]