[{"rating": 5.0, "review": "I love this things.I only used it for a couple days with my android tablet casting You Tube on the TV. It took me less than 4 minutes from opening the package to having You Tube on the screen. No more laptop with a long HDMI cable anymore. I am wireless.I have not try to cast other things yet. I hope casting home movie is also as easy.P.S. my TV does not have an USB port. I am glad that google includes a long usb cord and a USB/AC power adapter.", "verified": true, "helpfulness": "0/0", "author": "H. H. Do \"keep on smiling\""}, {"rating": 5.0, "review": "I got this for a bunch of family members for Christmas.  I didnt get one for myself because I have a \"smart\" tv.  After seeing everyone else's in action I got one for my bedroom tv.  After seeing it on my bedroom tv, I put it on my main \"smart\" tv.  It is faster, less glitchy, and buffers less frequently than the apps on my smart tv.  The user interface is much simpler.  I turned off the internet to my tv and use the chromecast exclusively.Its easy to set-up.  All you really need to know is your wifi network's name and your pass code for your network.  But you must have wifi.Netflix, Youtube, and HBOGo work nearly flawlessly from iPhone, iPad and similar devices. Amazon's instant video app is currently not compatible.  And I havent tried hulu, crackle and a few others.To cast a  video or other resource from a website that doesnt have a compatible app requires a laptop however.", "verified": true, "helpfulness": "0/0", "author": "R. Garten \"Atticus Finch's poolboy\""}, {"rating": 5.0, "review": "excellent price, easy to use, i have 2 they always are usefull, completly recomend it, very very very very good", "verified": true, "helpfulness": "0/0", "author": "Samuel Cantu"}, {"rating": 5.0, "review": "This tiny piece of equipment has given me such fun!  I plugged it into my TV, downloaded the Chromecast program to my Galaxy S4 phone (also my tablet) and voila!!  I was watching movies on my TV in minutes.  It all works seamlessly and it's serious enjoyment.  I also have Pandora on my phone and some days I use Chromecast to play background music over my TV speakers all day.  I really LIKE this little guy!!", "verified": true, "helpfulness": "0/0", "author": "Barbara Lundeen \"there can't be enough books\""}, {"rating": 5.0, "review": "Cool little device!", "verified": true, "helpfulness": "0/0", "author": "KudaMuda"}, {"rating": 1.0, "review": "Worked great when I first got it about 3 months ago but quit casting Netflix about 3 wks ago. Tried all the suggestions but nothing worked. It shouldn't be this complicated or stressful. Unhooked Chromecast and rehooked WII gamebox now can watch Netflix on the TV. Worse $35.00 I ever spent. Unlike me, save your box and receipts so you can return it .", "verified": true, "helpfulness": "1/3", "author": "Nana"}, {"rating": 1.0, "review": "I wanted to stream my photos and videos in my own tablet and laptops not through the chrome or web site.It was so disappointing and annoying.I returned it.", "verified": false, "helpfulness": "1/5", "author": "SoonChun Lee"}, {"rating": 5.0, "review": "Device worked properly out of the box. Setting it up was simple enough, though it helped to know a little bit about how it technically works to help with debugging why it wasn't working right away.", "verified": true, "helpfulness": "0/0", "author": "Greg Noeninckx"}, {"rating": 4.0, "review": "Google Play needs to have lot more apps integrated with this device. Also there is some lag sometimes with youtube and netflix. The wallpaper pictures are what my mom likes;).", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "I spent hours trying to make this work with my router, online and phone, still will not work! I was told to replace my router as to make it compatible with the Google chrome-cast , just what I want to do...spend another $50-70 dollar to save a few!?!", "verified": true, "helpfulness": "0/2", "author": "Jane C. \"geeseoh\""}]