[{"rating": 4.0, "review": "Love the connection to Amazon prime for our other TV's Still need to have cable subscription though....", "verified": true, "helpfulness": "0/0", "author": "Joe Cinosky"}, {"rating": 4.0, "review": "I have to pay for most of the services available.  I was hoping for some free stations.  But it works just like my sons XBOX 360 which is helping me eliminate cable $100 bucks a month saved.", "verified": true, "helpfulness": "0/0", "author": "Alyson Kurjanowicz"}, {"rating": 5.0, "review": "good deal", "verified": true, "helpfulness": "1/1", "author": "Satisfied Customer"}, {"rating": 5.0, "review": "Fire TV set fire in streaming market. 40,000 free movies if you are a prime member. The cool thing I can see my videos & photos on fire TV from any device. Fast streaming , if you have good internet connection.", "verified": true, "helpfulness": "0/0", "author": "gagan"}, {"rating": 5.0, "review": "I love it!  The unit took only 5 minutes to set up and is faster to respond  to commands than Roku or Apple Tv.  The voice command feature works flawlessly and is fun to use!  This is a very small and high-quality device that works exceptionally well - especially with Amazon and Netflix streaming.", "verified": true, "helpfulness": "0/0", "author": "B boy"}, {"rating": 3.0, "review": "movies cost to much with it.i have to pay for free tv and yes i have prime but that does not give me much. It should work like netfix one cost", "verified": true, "helpfulness": "1/1", "author": "ron hanson"}, {"rating": 1.0, "review": "The price is great until you have to convert the HDMI connector to fit into older TVs lacking the HDMI connection.", "verified": true, "helpfulness": "4/7", "author": "Inquisitivesage"}, {"rating": 3.0, "review": "Limited", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My Amazon Fire TV, gets plenty of use in the bedroom. I used this to replace the PS3 that was in the bedroom but finally died. I use the voice functionality which actually works (I am surprised because I have a London Accent and no voice control ever works).I use Plex to stream local media to the Fire TV, which works excellently and I never have an issue with.The Fire TV UI is sleek, quick and looks great on any size TV. (currently on a 55 inch TV) the Prime content is easy to access and 1-click purchases is a breeze.This has been my favorite streaming device so far, I have used Chromecast, PS4,PS3, Apple TV and my Vizio TV. This one is far the best i the market.", "verified": true, "helpfulness": "1/1", "author": "James Perkins \"James P\""}, {"rating": 3.0, "review": "Needs more in the app/game part of the store. Yes I can watch Prime videos on it but good luck finding anything in this sorry interface.", "verified": true, "helpfulness": "0/0", "author": "Timothy Tucker"}]