[{"rating": 4.0, "review": "I <3 my Chromecast! Best $35 I ever spent, hands down! Easy to install and set up! Hope Google continues to develop this products compatibility, however, for my needs I have no complaints as I can access everything I want to with this little device!A+++ rating from me! If you want to cut the strings with your cable provider and save the monthly costs associated with prepackaged commercial tv this is an excellent way to do it! Lots of viewing options available and more being added!Definitely recommend this product!After now owning my Chromecast for some 18 months I am having to replace it. It heats up very quickly now and no longer works. This product worked great for about 15 months, then started acting up. First it just randomly rebooted in the midst of playing a movie....but with each week, the reboots became more frequent.After researching several online forums it would seem this over-heating problem is very common and expected from those who are experts in this kind of technology. There have been reports of it heating up and toasting people's televisions, so I have quit using mine.Now I am wondering if it would be worth it to buy another one, now slightly cheaper, knowing I will likely only get another 18 months or so out of it, or just suck it up and go back to reading books and watching dvds I can burn myself.It was great while it worked! Still a hella lot cheaper than cable. Unfortunately I have come to expect less than stellar performance from Google products/services. With so many pans in the fire it isn't hard to understand why they can not make everything they do Top-Notch.", "verified": true, "helpfulness": "0/0", "author": "Darlene Denis"}, {"rating": 5.0, "review": "I originally got one of these 2 years ago when they first came out, I found myself slowly using it more and more. I used to use my xbox as my primary source of internet related playback, however the ease of using this with my phone has really hooked me, I have purchased 2 more since, for my sister for college and my dad, who understands gadgets as a stereotyped man of 60 should, not at all. However with the phone we just got him, he's been watching movies with ease! Young and old alike can use this easily, though might be better if someone with know how set it up!", "verified": true, "helpfulness": "0/0", "author": "Andrew w. Sawyer"}, {"rating": 5.0, "review": "great product and size that offers so much for so little.", "verified": true, "helpfulness": "0/0", "author": "Sim"}, {"rating": 3.0, "review": "Fire stick is better", "verified": true, "helpfulness": "0/0", "author": "Jerry Allen"}, {"rating": 5.0, "review": "Price - Easy to use - makes my tv useful - I'm happy :D", "verified": true, "helpfulness": "0/0", "author": "Adrian Javier Taguico"}, {"rating": 5.0, "review": "I  love  it..", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "I GOT TWO . ONE FOR WORK AND ONE FOR HOME.  ITS A NO -BRAINER", "verified": true, "helpfulness": "0/0", "author": "victor quinones"}, {"rating": 4.0, "review": "great of gift giving", "verified": true, "helpfulness": "0/0", "author": "Christina-Ante Christman"}, {"rating": 5.0, "review": "Ingenious!", "verified": true, "helpfulness": "0/0", "author": "S. Kirby"}, {"rating": 5.0, "review": "Incredible value... there's so much support for this device and it makes any TV a smart tv.Really nice being able to navigate youtube/netflix on my phone or laptop.", "verified": true, "helpfulness": "0/0", "author": "B26"}]