[{"rating": 1.0, "review": "Well, for people who are using community shared Wifi like me (I rent an apartment near my university and the leasing office provide Wifi for me), this product is USELESS. I called the Time Warner Cable and Google custom service for a whole afternoon, and neither of them gave me a solution to sort this out! I just cannot find my device on my iphone or mac or PC. After trying to solve the problem couple of days latter, I ended up with adding the device \"mac address\" into my Wifi logging account, it works okay for few days. Then it went down again! After reading so many people's review I found this product should work great with home Wifi with your own router near you, but not within a public wifi at all! I am not going to return this cz it's so cheap. I might keep plugging it whenever my iPhone or any other devices could find the chrome cast again in the future~I guess I do not need write pros and cons for I almost never used it after four weeks I bought it thou.Pro:1080p, which is supposed to be.Cons:Not working with a \"logged in\" WifiSet-up time wasted me 2 or 3 daysAny way, I am very disappointed with this product. Google can do this much better, at lease make it works!!", "verified": true, "helpfulness": "0/0", "author": "Junyao Zheng"}, {"rating": 5.0, "review": "Wonderfull, would be better if it had a internet browser.", "verified": true, "helpfulness": "1/1", "author": "Paulo S."}, {"rating": 5.0, "review": "Great Device", "verified": true, "helpfulness": "0/0", "author": "Igor"}, {"rating": 5.0, "review": "We have 3 of these, for the living room and our bedrooms. Simple to cast Netflix or Youtube to one of the TVs and we are all set. Kids love it too.", "verified": true, "helpfulness": "0/0", "author": "Jani P"}, {"rating": 5.0, "review": "love this to stream netflix and HBO Go.  we have one in the living room and one in the bedroom.  is making me consider getting rid of my cable.  love that i can use my phone to select what i want to watch, and then cast it to my TV.  only annoying thing...if your phone rings while you're casting, you can't hit pause on your show:(  have to pick up the call, tell them to hold on, and then go to the app to pause.  wish it would automatically pause if you pick up the phone.  great to bring with you on trips, but always a little tough to get it connected to wifi in hotels.", "verified": true, "helpfulness": "0/0", "author": "Caitlin Espinoza"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "soung lee"}, {"rating": 3.0, "review": "It is a really nice device and it works.  I just wish that it had more troubleshooting examples.  I think that it might be my connectivity but still it does not work well. Other than that it is great! :)", "verified": true, "helpfulness": "0/0", "author": "Evi"}, {"rating": 4.0, "review": "Quick setup.  A little glitchy at first, but works well now.", "verified": true, "helpfulness": "0/0", "author": "dcadog"}, {"rating": 5.0, "review": "Easy set up and watching Netflix and other sites quickly.", "verified": true, "helpfulness": "0/0", "author": "v. hollie mentz"}, {"rating": 4.0, "review": "Absolutely amazing product. Easy to set up, and great HD picture quality. Would occasionally get some glitches where it became unresponsive, but the problems seemed to be related to the iPad app, since once I closed the app, things seemed to work normally.I'd recommend to anyone without a smart-TV who wants to stream Netflix and other online services. I don't use this anymore since I got an HTPC, but for $35 you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "T Bruce"}]