[{"rating": 2.0, "review": "The wire of one of the chromecast doesn't used for! What I can I do?", "verified": true, "helpfulness": "0/0", "author": "Diana Sandoval"}, {"rating": 4.0, "review": "I really love the Chromecast but the apps on my iPhone (Netflix mainly) disconnect from the Chromecast. I don't know if that's due to the Chromecast but it's annoying to have to close the app, then re-open it to re-connect to the Chromecast and stop the next episode from playing (or pause for a break). Other than that it's small, convenient, hides behind the TV, and displays a great picture! When the app issue is resolved I'll change it to 5 stars.", "verified": true, "helpfulness": "0/0", "author": "J.D. Julander"}, {"rating": 5.0, "review": "great!", "verified": true, "helpfulness": "0/0", "author": "ALFONSO F ESPINOZA"}, {"rating": 2.0, "review": "not sure why i bought it", "verified": true, "helpfulness": "0/1", "author": "Rajinder Grewal"}, {"rating": 4.0, "review": "Steup not quite as smooth as it shouild be, but it works very well.", "verified": true, "helpfulness": "0/0", "author": "RB - Mesa AZ"}, {"rating": 5.0, "review": "How can you go wrong for $35 bucks. Obviously does not have the functionality of a Roku or Apple TV, but for Netflix or HBO Go, it can't be beat. Super easy to use and set up. I have one on all my TV's.", "verified": true, "helpfulness": "0/0", "author": "James F"}, {"rating": 5.0, "review": "love it ...", "verified": true, "helpfulness": "0/0", "author": "alge murrell"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "Sometimes a bit quirky to get it ti work.", "verified": true, "helpfulness": "0/0", "author": "Dave C."}, {"rating": 2.0, "review": "It worked for about two weeks, then suddenly stopped. I've tried everything to get it working again, to no avail. I do not recommend this device, as going online has shown me this is a common problem. Basically I now have a flash drive full of really nice photographs that doesn't perform any other function.", "verified": false, "helpfulness": "0/0", "author": "xiaolong"}]