[{"rating": 2.0, "review": "Easy to install. Very limited use.  Cannot play home video, Should have bought Apple TV which has more aps and can project my computer screen on TV", "verified": true, "helpfulness": "0/1", "author": "Ntgsm123"}, {"rating": 3.0, "review": "Too much buffering on youtube app. Netflix and Google play dont work on Singapore. I am just stuck with device. I hv a good Internet connection. The video play at full resolution but it buffers too much so it should understand to lower the resolution but it keeps on playing at same.I am not satisfied with product.", "verified": true, "helpfulness": "1/2", "author": "Sukhrajbir Singh"}, {"rating": 1.0, "review": "I purchased mine directly from Google... mistake...Setting it up didn't really work at all. I have all the requirements that it needed, but I could never get it passed the errors related to connecting to WiFi and UPNP.  The fact you can't get it to work around those issues is beyond me. I have a very expensive wireless router that could more than handle the needs of this device, but IT didn't think so.  Wouldn't let me continue with the setup... (I work with technology every day, and have worked in IT/ with computers and mobile devices for quite some time, so it's not incompetence).The setup is a pain! It's extremely finicky. Honestly if you need to display something on your TV from a laptop/desktop/or mobile device: buy an HDMI cable (they're super cheap on here)!When I tried sending it back to Google, they took almost 2 months to refund me, and they didn't even give me the entire amount back (sent it back in PERFECT condition).  Never buying another product of theirs...", "verified": false, "helpfulness": "4/6", "author": "lahutchi"}, {"rating": 3.0, "review": "Eh, it works pretty well and I use it a lot. There's significant lag time when tab casting, and sometimes a loss of quality. It appears to work pretty well with netflix, although not anywhere near as responsive or seamless as the ads make it look. It basically is just a wireless VGA/HDMI adapter. I'm sure there will be some expanded functionality in the next year or so, but for now its very much still a beta product. It loses connection quite frequently and reboots a lot. But I'm decently satisfied.I find it to be HILARIOUS that this is Amazon's #1 selling product, and it is NOT compatible with Amazon Video. You think that would be the very first feature they would work on before releasing.", "verified": false, "helpfulness": "0/0", "author": "Shaun Greene"}, {"rating": 5.0, "review": "Very easy to set up. Took about five minutes (including an automatically downloaded update). Installing the companion app on several family cell phones also quick and easy. Minutes later family members were taking turns queuing up YouTube videos. No longer need the laptop and bluetooth keyboard and mouse to drive Netflix on the big screen. Works amazingly well. Utility for $35 can't be beat - even if only used for YouTube and Netflix.Now if they could get Pandora lined up ...", "verified": true, "helpfulness": "0/0", "author": "N. Krueger"}, {"rating": 5.0, "review": "It is really fantastic . Very easy to use. The installation was very easy ,there was not any problem in installation . I have bought it directly from amazon. The shipment was fast .", "verified": true, "helpfulness": "1/1", "author": "Ali"}, {"rating": 3.0, "review": "Sucks that no local file playing available since all cast was blocked.  Slow for net flix.Best youtube experience ever. Lovin it!!", "verified": true, "helpfulness": "0/1", "author": "lucky777***"}, {"rating": 3.0, "review": "I would rate it better, if Google had:- Instructions and normal Play, Pause etc controls- How to link the Google browser from iPhone- Connection to Hulu and imdb", "verified": true, "helpfulness": "0/0", "author": "Diz \"deane@aloha.net\""}, {"rating": 3.0, "review": "The Chromecast is great for what it can do but the only reason I bought it was to use it for when I travel. I figured that I could simply plug it in and run it off the hotel's wifi..., but you can't. I'm hoping this is something that Google adds to the Chromecast but for right now there is no way for you to authenticate the Chromecast once it gets connected to the hotel's wifi, generally you would see a log-on screen or something like that, my Paperwhite Kindle for example has this capability.Chromecast doesn't have that option and until it does there isn't much reason to purchase this if you are planning on using it for travel.", "verified": false, "helpfulness": "32/41", "author": "Craig Clark \"coraxery\""}, {"rating": 5.0, "review": "I did have a problem getting it to work with an Actiontec C1000A router, but plugging another router into it and connecting to that network seemed to work well.  Also turning off the Actiontec's firewall works too but it keeps switching it back on every few days or so.", "verified": true, "helpfulness": "0/0", "author": "Ryan Sauerman"}]