[{"rating": 5.0, "review": "For 35 bucks, this provides a lot of fun.  I don't think anyone who drops that piddly amount to get a Chromecast, will be at all disappointed.  However, you do have to have a decent, high-speed connection.  Duh.", "verified": true, "helpfulness": "0/0", "author": "glenn"}, {"rating": 1.0, "review": "Does not work as advertised, work well with you tube but not on netfix. Called support and after 1 hour still didn't work with netfix. They tried to tell me it was my phone but I tried 3 phones and 2 laptops, still told me something was wrong with my phones and computers. Google would not replace the chromecast which was clearly defective. Not worth the $35.", "verified": false, "helpfulness": "3/5", "author": "Gary Suydam"}, {"rating": 1.0, "review": "Have had problems with it. Worked fine at first. But no longer have any sound. Have contacted google for tech support.", "verified": true, "helpfulness": "2/3", "author": "Linda M. Sweeney"}, {"rating": 5.0, "review": "I don't have a gaming system to be able to watch Netflix on my TV so the Chromecast has been amazing. It is so easy to install and use! We were able to finish watching a show we had started on Netflix by mail which meant we were watching for hours on end. Needless to say, I have a lot of shows of the new season and housekeeping to catch up on!!!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 1.0, "review": "As of Oct.9, 2013-I did find that and now have the Chromecast ICON on my TV, saying \"Ready To CAST, but although Chromecast is now linked to my Home Wireless Network, thus my computer, the Blue Icon is not showing up. I have clicked and clicked the \"Download\" the \"Extension\" to my computer, but all you see is constantly is \"searching for it\" and it never finds it. This is an attempt to add the little Blue Chromecast icon to \"YouTube\" or anything else that is available for viewing. Suggestions?As of Oct. 29, 2013-I still am only giving the Chromecast 2 stars. The biggest problem for me is the fact that I wanted to connect my main computer in one room with the TV in my bedroom using the Chromecast. But because the two are more than 20 feet apart, the Chromcast doesn't work.It should be noted that there are several Apps for the smartphone, like \"Twonkybeam\" that you are able to play \"Youtube\" Streaming devices, like Roku. The KindeFire 1st generation has an app \"Playto\" that you can play from tablet to Roku app.I may change my rating in the coming weeks.", "verified": true, "helpfulness": "0/2", "author": "Roy A. Kaminsky"}, {"rating": 5.0, "review": "I use it primarily to stream Spotify to my TV from Google Chrome and it works great. I've also tried it with the Netflix Android App and streaming web videos from Google Chrome to my TV and both work flawlessly.Maybe the users that have found issues streaming from the browser have issues with their wireless connections. I didn't have any issues streaming web pages to my TV.The installation is the easiest installation I've seen for a wireless device.", "verified": true, "helpfulness": "0/0", "author": "rubenmch"}, {"rating": 4.0, "review": "Normally I hook up my Mac Book Pro to the tv via the HDMI cable. However that means I have to give up googling stuff when the movie gets boring. This however allows for me to enjoy my laptop and watch netflix at the same time. I is a little slow to load at first and for about 30 seconds the shows are very pixilated. This clears up and then its fine. Not hard to set up either. Plug, download, and play.", "verified": true, "helpfulness": "0/0", "author": "Spam Sandwich \"I Know What I Like On Tv\""}, {"rating": 5.0, "review": "This product is amazing I can now watch videos from my phone with no lag at all and its under $50 thanks Google.", "verified": true, "helpfulness": "0/0", "author": "konow"}, {"rating": 4.0, "review": "I had  a previous experience with the Chromecast that was not favorable and had returned the product. However,after discovering that I had  a Wi FI issue with my ISP and resolving that,I retried it and it works exactly as advertised. Still not as versatile as I would like(just Netflix and YouTube) and the iPad controls are are still a bit tricky it's a good value for $34.", "verified": true, "helpfulness": "2/3", "author": "Alee"}, {"rating": 5.0, "review": "Chromecast looks like a very interesting device.  It was easy to set up, and also easy to change the setup.  I suspect that for streaming services it should work well.  However, I got it for one particular use, and unfortunately it doesn't yet work well for that.When travelling, I want to watch my home TiVo via a SlingBox.  That works very well.  It is more and more common to find either hotel rooms or vacation rentals with HDTVs (with HDMI ports) and WIFI internet access. Since I watch the SlingBox via a Chrome window, this seemed like the perfect solution to put the picture on the remote TV.  I ran into two separate problems with this (although the second one is the real show-stopper).  In one hotel room, the WIFI was not configured to allow the required plug-and-play connectivity between devices, and I knew better than trying to get that changed.  In a second location where I had more control over the network, everything connect just fine, but the only thing that would display from my Chrome tab with the Slingbox video was the frame of the tab, with a black rectangle where the video should be.  A little internet research showed that this is a known issue, but there's not any indication that either Google or SlingBox will address it.Update 11/19/2013:  After some research on the SlingBox issue, I found that the Chromecast will indeed work with SlingBox if you use the SlingBox Facebook app instead of the Slingbox.com window.  That takes away my concern for the product, and now feel that it works quite well for me.  I've watched (briefly for testing) video from the SlingBox Facebook app, from Xfinity's Video on Demand page, and live video from NASA TV.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer \"do-it-yourselfer\""}]