[{"rating": 1.0, "review": "Very poor streaming", "verified": true, "helpfulness": "0/1", "author": "Ralph"}, {"rating": 5.0, "review": "This is awesome!  You can't go wrong for the money. Not the easiest to use, but once you get the hang of it you realize you dontbneedbthosenother devices.", "verified": false, "helpfulness": "0/0", "author": "Eric m"}, {"rating": 5.0, "review": "im able to start to cut the cable with chromecast", "verified": true, "helpfulness": "0/0", "author": "Chase"}, {"rating": 5.0, "review": "I am a fan of streaming movies.  I've paid good money to my cable company to have a good connection and I make use of a few different services.  That being said, what device do I almost have on my person or close by?  My phone.  Why not use it to control my movie streaming experience?!  The Chromecast allows for this and it works extremely well.  The version I bought only operates on the 2.4 GHz band for WiFi but that wasn't an issue at my house.The service works amazing from both my android and my IOS devices.Configuring it the first time was super easy and Google packaged all the necessary hardware to get me going.The second best part is that it is almost invisible.I recommend the device to all my friends, and after a solid 5 months of ownership, I felt it was time to talk about my experience.  If I get another TV in the house, I'll definitely buy another one of these.Hope you have just as much success.", "verified": true, "helpfulness": "0/0", "author": "Charles P."}, {"rating": 2.0, "review": "Returned it.  It doesn't actually do much since you have to have apps that are enabled to use it.  I was hoping I would just be able to duplicate my device's screen on the TV but alas, that is not what this thing does.", "verified": true, "helpfulness": "0/0", "author": "D. Robinson"}, {"rating": 3.0, "review": "It installs and is setup extremely easy.  However, the connectivity seems to be a real issue.  The playback is choppy and it slows the computer down greatly to transmit the data.  And most of the chromecast computer apps like Netflix and Youtube have not seemed to work in sync with the chromecast at all.  I have since bought a new laptop that has a HDMI port and that seems to work perfectly when hooking it up to the TV.  If you have a laptop with an HDMI port already then I suggest you take that route.", "verified": true, "helpfulness": "0/0", "author": "joel sapp"}, {"rating": 5.0, "review": "works great!!...will be buying another one!!...easy to get working", "verified": true, "helpfulness": "0/0", "author": "John Gordon"}, {"rating": 1.0, "review": "I would definitely not recommend this to anyone.  It worked sporadically with YouTube at first.  It had many bugs, (keeps loosing connection etc....) and any attempt to use it for anything other then YouTube was pointless.  The video and audio would by mismatched, making it useful only for watching old Japanese sound dubbed monster movies.  After about six months, it quite working altogether.  I thought about trying to get it to work again, but Chrome has taken to delivering five or six messages about not being able to load my profile every time I start it up.  This is a problem that is common with windows 7, and so far all tricks and modifications to get it to stop have failed.  You have to wonder what is going on at Google that they keep putting out products that just don't seem to work.  And for that matter changing products and services that were once good to the point where you just want to give them up ... gmail... google voice.  They just seem to keep letting me down. Time to divest.", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 4.0, "review": "This Chromecast item continues to update and get better.  I have had problems with this device and the problems have continued to reduce and the quality of the device continues to improve.  This device still will not work with 2 HDMI to VGA converters that I own.  This device originally worked very badly and the updates for the product have made a huge difference.", "verified": true, "helpfulness": "0/0", "author": "Poppop17"}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "Anika chhabra"}]