[{"rating": 4.0, "review": "I like it overall remote is really good.Haven't try the voice search. Overall very fast. I had couple Google TV Revue and CoStar.This is a lot faster and not having any issues so far. Played all the video & Audio formats so far I tries.Interface feel little cluttered may be because it's different then CoStar, just need get use to it.The reason I had Google TV in the past was Browser and HDMI pass through. HDMI pass through save a input and also don't switch inputs on TV. I cut the cord about a year ago so that wasn't that much issue anymore.I still use browser to view some video online only available on browser. I like to have it on Fire TV too.", "verified": true, "helpfulness": "2/3", "author": "maskands"}, {"rating": 1.0, "review": "I just got the unit yesterday and my first impression is not great. There is potential but it needs more work.The search would be great if it would search more than just Amazon. The plex app doesn't work well, because the device cant play many formats so everything has to be transcoded and then you also lose the surround sound features of the videos.Do not get if your main reason is to watch local content. It is mainly geared towards Amazon videos, they talked about wanting to be an open platform vs others (apple) but they try to force you in every way possible to buy Amazon video.The only good thing I kind of enjoyed was having some games on it.I am going to give it another week to try and convince me, but I think it will probably be going back.I was really hoping this was the device to work for my household.", "verified": true, "helpfulness": "37/81", "author": "S. Fehrman"}, {"rating": 1.0, "review": "I do not own this product , I am giving it 1 star solely because amazon does not mention anywhere if this would work in countries other than the united states or not ! am a Prime user my self and this should have been clear in the description of the item.I will change my rating as soon as I get a proper comment reply from amazon staff , I will change it to 3 stars ( neutral ) if this product works outside of USA.  If it does work , and 1 star if it doesn't , because amazon should seriously consider more all those clients with prime memberships outside united states.if it works , I will order one immediately and adjust my review according to my satisfaction with it. Please don't comment with ( oh , you give it 1 star and you don't own it , way to go ! ) , because I really don't care what you think. This is for amazon to clearly point things out to us ( international customers ) and to give us more attention.", "verified": false, "helpfulness": "19/222", "author": "Sami Hamouri"}, {"rating": 5.0, "review": "I have used the Fire TV for a day, and I think that it is an enormous leap forward in set top box functionality.  My brief review follows.  But first, I'd like to comment on some of the negative reviews I've seen for the product.  Many of them are from people who haven't purchased the product.  Others gripe about what the product doesn't have, even though they product clearly states that it doesn't have it -  for example, there is a lot of grousing about no HBOGo.  Whether that comes to the FireTV or not, it isn't available right now.  A one star review because one app is missing?  Or you can't stream some content from your hard drive (even though there are apparently apps that will perform this task for the Fire TV)? Well, take those types of reviews for what they might be worth.Let me start by saying that I own two Roku 2's.  I've owned Roku's for quite some time.  I don't own the Roku 3, so my comparisons are probably stale.  The Roku is a great product, and you can't go wrong owning one.  But let me describe the features of the FireTV that have so far delighted me:1. Easy connection to my WiFi connection.  I have never been able to connect to my 5G network where my TV is located with my Roku.  The Fire TV picked up the signal easily, and streaming is seamless.  It could be the dual antennas.  Whatever the reason, if signal capture is an issue for you, the Fire TV seems to work well.2. Loading of videos is very fast, almost instantaneous.  I select a video, press the remote to play, and within 2 seconds the video is streaming with no buffering issues.  It's very impressive.3. Set-up was a breeze.  EDIT:  I have read that some people had an issue with the initial update that the Fire TV requires.  Mine updated with no problems.  I was able to connect to my WiFi, and my update downloaded and installed automatically.4. Voice search is very well done.  It took me a couple of attempts to learn to search after pressing the button and then hearing the \"beep\" to talk.  Once I figured that out, I was searching for movies and TV shows easily.  The search results have been accurate.  This is a huge time saver and a great convenience. Only Amazon content is selected during the search process.  I understand that the other content providers have to permit search into their applications for it to work.I have not figured out how to fling my Fire HDX screen to my TV yet.  Once I figure this out, it will open up all kinds of other options for the Fire TV.  I didn't buy the product for this feature, but I'm interested to get it working.  This could be a huge game changer, as you can access content at other sites on the web and display it on your TV.  I hope Amazon provides more help to accomplish this.I purchased the gaming controller and was able to pair it with the Fire TV.  I haven't played anything yet.  But I'm intrigued by the options.One disappointment I have to mention:  where is Amazon music?  My music collection should be available front and center.  There's an app for my phone, there is an Amazon music player app for Roku, so Amazon should integrate the music collection.  It makes sense that they would do so in order to bring even more value to the entire Amazon content platform.  I'm thinking that there will be something shortly, as the rumor is that Amazon is going to provide a music streaming service in the very near future.  Amazon needs to address this promptly.Overall, if graded as just a simple streaming box, it gets a 5.  With the other options the Fire TV may provide -  Miracast screen duplication, games, etc., the product certainly exceeds my expectations.UPDATED 4/5/14:  I've had the Fire TV for two days now. I was  so pleased I purchased another, and they have now replaced my Roku 2XD's. Both of mine set up in no time, and had no issues connecting quickly to my WiFi network and installing the initial download.  I don't have a over-technical set-up for my WiFi.  I have a Comcast cable modem (3rd gen) and a Netgear router.  My Fire's saw the router with ease, and connected the 5G band.  This is something only one of my Roku's could do because of the distance that one of them was from the router.The video quality is superb.  I don't have these boxes set up to take advantage of Dolby 5.1, just simple TV speakers.  But, the sound is forceful and clear.  I've not had any issues of whining or other distortion that some have mentioned.The voice search is frankly amazing.  I have read that some people don't like it or feel it is too limited.  But for searching your Amazon options it is outstanding.  For me, it is fast and accurate and is a huge time saver.  I am eagerly awaiting adoption of the technology by other app vendors.The screen layout does take some time getting used to.  I won't call it clunky, but it is crowded.  It lists items in a fairly rigid order depending upon the category you are in.  And yes, Amazon content comes first.  That' to be expected.  But Amazon doesn't block your access to other apps.  If you want HULU or Netflix, you can get to them easily.  You can even use voice search to find the app you want.  I suspect there will be some streamlining of the interface at some point.  The interface does tie into the interfaces on Fire HDX somewhat, so I can see the attempt at consistency here.Gaming so far has been limited, but I've found a great pinball app and am reliving my younger days on the tables.  The gaming controller works well, and I don't have any lag playing the game.  I haven't attempted any others yet, but I look forward to a good driving game. I'm a casual gamer, not hard-core, and this system may just fit the bill. My Xbox glory days are over, as my kids thoroughly thrash me at Call of Duty.All in all, this box delivers exactly what I wanted and  more.", "verified": true, "helpfulness": "331/371", "author": "kpc001"}, {"rating": 2.0, "review": "I love Amazon, I shop weekly and I'm a Prime Member and I use AIV, but as much as I love them, I wouldn't buy this player. It's the same price as the far superior Roku 3, which has everything this has and MORE..Not to mention the Roku 3 has Vudu..and they are the gateway to accessing my entire 2,600+ title UltraViolet collection, which, sadly, at this time,  AIV does not recognize, nor support.. Not to mention their (Vudu's)site is much easier to navigate. So without Vudu, this device is completely useless to me.. Again, everything I've seen on here, is on the Roku 3, including the YouTube Channel and the Bloomberg TV channel, which their little chart indicates that it's not on Roku..(wrong).. I can also insert an sd mini card for external storage, play stored media from an external device and add \"private\" channels too.. you can't do this with Amazon's player...And yes, I've experienced this Amazon Fire product IN person, so while I don't \"own\" it, I can still review it.. Afterall, that's what a \"review\" is; an opinion of a product or service that you've experienced....", "verified": false, "helpfulness": "10/56", "author": "Jimmy R"}, {"rating": 1.0, "review": "I was excited so i order it the first day i heard about it then after reading all of the bad reviews about 50% of the reviews i decided not to even open it and stop it in transit to be return to amazon.  I wait until they do more updates to the device and gets better reviews prior to purchasing it.", "verified": true, "helpfulness": "12/203", "author": "Amazon Customer \"stephen e\""}, {"rating": 4.0, "review": "When my new Fire TV arrived today, I was cautiously optimistic. We have two Kindle Fires in the house, a 1st Gen and the previous Gen, and we love them. So here is my initial thoughts, I will update this review as time goes by.First impressions, as always Amazon does a great job on the packaging, and this box is actually a little more elegant than when we ordered our fist e-reader way back when. But it carries the glossy black look they used in the past now for the Fire tablets. The box was easy open and the device neatly tucked inside.Hook up was as easy as it gets, and connecting to my Wifi wasn't a problem. It did need a software update out of the box, which these days isnt uncommon. The problem here was I was already seeing an issue. It kept telling me my connection seemed slower than usually  I needed to check it. Having the robust network we must have for a house full of online gamers I knew there could only be a couple of problems. My other devices were working fine on the network, but to alleviate any strain on it i disconnected them all and reset my connection at the modem and router. The download resumed, but still with the same message at the bottom. After about 30 or 45 minutes I finally got the introduction video.So, off and running, I go the app store to spend the coins I got for purchasing the additional controller, see this reveiw, http://www.amazon.com/review/RGDZLYOUBIDI6/ref=cm_cr_rdp_perm . While trying to download a handful of games, which it ques nicely to keep from over working its self, I ran into these problems.  - the interface was slow load images for the apps I was looking at, and somtimes refused to populate the list I was trying to view  - it also would randomly disconnect from the network. This points to a connection issue that i stated earlier. But now I am convinced it is the Wifi radio in the device. I have had gaming systems and streaming devices in this room before and never experienced this issue. This could also be what was causing the previously stated issue with the menus.  - there is no way to force sleep the unit or turn it off.So, I proceed to call tech support. The guy on the phone was really nice and tried to be helpful, but he had no training on the device other than what little he had played around with his. He says, the device will eventually go to sleep, but isnt sure of how long it will take. As far as the wifi goes he suggested doing everything I had already done, except for unpluggin the device for about 3 seconds or so. So I try this, he has me stream something from Prime, which works great, but as soon as i start to download something again, the connection is lost. The phone call ends up being a waste of time. At this point I am disappointed. I know this is a new device and will have issues, but the Wifi? this is proven tech it should work.Pros:Beautiful minimalist designease of setupsmall foot printgames look great, once you get them to workCons:Customer service wasn't trained on trouble shootingWifi connectivity sporadicNo way to force sleep or power down deviceIn the end, it could be a great product. I am going to give it some time and see if another software update might be on the way, or if maybe something was wrong with my network yesterday. I will update soon.**********Update 04/07/14:After a full weekend of putting the Fire TV through the paces I have updated my initial 2 star rating to a four. Here are the reasons why.The network issue appears to be just that, a network issue. Whether it was on my end or because of it being the first full day of release I do not know. But I did not have the connection issue again all weekend. Seeing as this was the biggest reason for my 2 star rating, I have changed that.As far as the auto sleep mode, for those that like to be able to control when something is on, sometimes it works and sometimes it doesn't. The Fire is very fickle about this. But as someone pointed out in the comments and I do agree with them, it is a very minimal power draw and as along as you don't leave  your TV on it shouldn't affect anything.The few games I played were good as far as casual gaming goes. No buggy or jerky movements. But you must remember, this is for casual gaming. You are not going to console quality out of this.Hope this all helps.", "verified": true, "helpfulness": "53/67", "author": "TheDoctor2250"}, {"rating": 3.0, "review": "Can Amazon Fire TV work out of US, like in Asia or Europe it has to be in US to work?", "verified": false, "helpfulness": "2/39", "author": "Sulwan Rehman"}, {"rating": 5.0, "review": "11/5/2014 going between this and the cable box while looking for something to watch.  response to the remote is smooth.8/26/2014 I've meant to up date this earlier but now that it can play amazon music, I am raising it to 5 stars. (althought it took too long)the good:First off, this is not my first streaming box,  I have a roku 2 hd, western digital live and sony blueray that has some streaming features. Neither of the first 2 have gotten a great deal of use after the initial setup because they were hard to use. and slow to navigate menus, and the sony BR only does disks these days..my isp is cablevison,optimum online. with a standard service level.I popped the WD out and connected its hdmi and ethernet cables to the fire tv  (the wd is now retired).  Since this is hard wired, I can't provide any feedback on the wifi speed or stability. but it should also be noted that the other devices felt very slow and underpowered even while wired. I went to the trouble of wireing them because their wifi performance was underwhelming even just 15 ft from my router.The setup: what setup, it downloaded 1 update and was ready to go.The menus : fast, responsive, They were similiar to the menu layouts on the other streaming boxes but there was a kindle fire-ish-ness to it.The remote: not a lot of buttons, but I was making good use of the ones there.No Lag or Pixelation over the course of 6 hours of tv watching at 1080  Videos watched were PRIME offerings of \"the truth about love tour:\", 3 Mythbusters episodes, 3 episodes of Superman animated adventures. I'll be trying more videos, and will update in a few days.  As a wired connection there were no performance issuesSound produced was goodthe bad:no memory card slot.: though this could be coming by usb.no usb support yet that I've seen listed.the wishlist :usb keyboardmouseSC card slot (DNLA supportexternal usb hard drive supportfor gen 2SD cardupdate on 4/7/2014I was moving some cables around, and noticed how hot the device gets. would probably melt a bar of chocolate if it were left on top of it.  Make sure you have air circulation.update on 4/18/2014 on 4/21/2014This is by far the best streaming box I've ever tried.  I've watched more than 2 solid days worth of content so far (all told) prime offering mostly .  between seasons of GRimm and Ancient Aliens, I've been giving it a work out with no problems or issues.  when i am watching a movie its like I've got a dvd, skiping forward and back. the device rocks.", "verified": true, "helpfulness": "15/16", "author": "lts"}, {"rating": 3.0, "review": "I have not purchased this device yet but it does have favorable specification when compared with other set top boxes. I would however consider it seriously if an app for the PBS network was offered as is true of the Roku 3 which I have.", "verified": false, "helpfulness": "2/42", "author": "Donald J. Haggerty"}]