[{"rating": 5.0, "review": "Works great! Should have waited for the cheaper, stick model, that's the story of my life!", "verified": true, "helpfulness": "1/1", "author": "Builder \"Jonny Hendricks\""}, {"rating": 4.0, "review": "The system is very well engineered with no glitches. The system is great for gaming, but there are not enough quality games.", "verified": true, "helpfulness": "0/0", "author": "james bloch"}, {"rating": 5.0, "review": "Easy to set up and use. The voice search is a nice feature.", "verified": true, "helpfulness": "0/0", "author": "ABQ NM"}, {"rating": 5.0, "review": "I am loving this device more and more everyday.I don't look at cable because its waste of time. (just my opinion).I have an AppleTv which I will never give up but that doesn't mean you can't enjoy other streaming media players. What is the most important thing for me is that I am not the only user of these devices. My children are most important and what they are allowed to view and what time of the day they can. UI for this system was to get use to. Like I said Appletv user. I was about to purchase the Roku 3 when I did a comparison of all of them. Firetv tops it. I am waiting for my Roku tv to arrive so I can test that out as well. But I know it will be no comparison to the Firetv.I do have a question though.How many Firetv's can you use in one household under on account. What are the pro/ cons of this.", "verified": true, "helpfulness": "0/0", "author": "G. Will"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Cruiser"}, {"rating": 3.0, "review": "The product is ok but not remarkable. There is considerable buffering at times, and this is NOT caused by my internet speed. I am hugely disappointed in the price Amazon charges relative to what I saw in today's Sunday sale papers. Staples has the Amazon Fire for sale this week for $79. Amazon charges $99. Amazon sells their own product for $20 more than a local store. Wow! Diminishing credibility Amazon!! I have had the Fire for less than a week.", "verified": true, "helpfulness": "0/3", "author": "Phillip R."}, {"rating": 5.0, "review": "Love it. Worked great right out of the box. had a bit of a problem figuring out the apps but not too much.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The first night it worked perfect, and now all it does is buffering (movies and music) Im sending it back and canceling my prime.", "verified": true, "helpfulness": "2/4", "author": "Fred J."}, {"rating": 5.0, "review": "If you have Prime you should have this", "verified": true, "helpfulness": "0/0", "author": "Bill Lutonsky"}, {"rating": 5.0, "review": "For 1080p or 720 p TV, very good resolution.  Hook up to a stereo system and you have a great movie experience.  Easy to setup and running in 10 minutes.", "verified": true, "helpfulness": "0/0", "author": "Tran Thanh"}]