[{"rating": 5.0, "review": "super fast UI = awesome", "verified": true, "helpfulness": "0/0", "author": "Harlan"}, {"rating": 4.0, "review": "Always something new to watch, better than cable t.v.", "verified": true, "helpfulness": "0/0", "author": "Deanna Ladd"}, {"rating": 5.0, "review": "It's extremely reliable in regards to network connectivity, it almost seems more stable even though the Roku I had previously was in the same location.You can play games, use PLEX, Amazon Video.  It's well work the price for just one of those in my opinion.", "verified": true, "helpfulness": "0/0", "author": "thamitch"}, {"rating": 5.0, "review": "This is a great device. Installed without any problems and we started watching right away.  It was a birthday present for my husband and he is already into several of the prime available series! The available viewing and music is much better than my cable vendor. VERY HAPPY with this purchase and would recommend highly.", "verified": true, "helpfulness": "0/0", "author": "Diane Chapka"}, {"rating": 5.0, "review": "The installation was simple and straight forward.", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 4.0, "review": "This is great. We have enjoyed so many movies since installing it. Superb", "verified": true, "helpfulness": "0/0", "author": "Sue A Megran"}, {"rating": 5.0, "review": "Awesome easy to use", "verified": true, "helpfulness": "0/0", "author": "Vtec2011"}, {"rating": 5.0, "review": "Love it so far... easy installation with lots of options for use. My 16 yo daughter loves it for the old TV shows she use to watch years ago.", "verified": true, "helpfulness": "0/0", "author": "Latanya M. Smith"}, {"rating": 5.0, "review": "yhis was a Christmas gift for my kids. They loved it. Loved all the options. It was easy to install.", "verified": true, "helpfulness": "0/0", "author": "Michelle Bernath"}, {"rating": 5.0, "review": "After struggling unsuccessfully to get Chromecast set up on my TV, I ordered the Amazon Fire TV and it worked right away. It was easy to make it part of my wireless network and the voice search worked to find the content I wanted. I am going to order a second one for our other TV.", "verified": true, "helpfulness": "0/0", "author": "Rosanna L. Thornton \"space woman\""}]