[{"rating": 5.0, "review": "You cannot beat the price and it works as advertised.....I would recommended purchasing this product.Now for more apps to be published.....", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Pros: small, easy to install, cheapCons: can only stream Netflix and Hulu, poor user controls for pausing, FF, RW, long initial load time.We have Apple TV in one room and Chromecast in the other, and we completely got rid of cable (hurray!).  I'd recommend folks purchase the Apple TV until Chromecast makes some improvements in the content they offer and the user interface for the application.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Marie Chamberlain"}, {"rating": 4.0, "review": "I bought this thinking it was a little like Google TV but it wasn't. You have to use the Google Chrome browser to stream things from your computer to your TV. Otherwise it is a neat device.", "verified": true, "helpfulness": "0/0", "author": "Christopher Lee"}, {"rating": 5.0, "review": "This google chromecast works excellent.  Can access all YouTube videos as well Netflix.  Very easy to use.  Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Tuan Nguyen"}, {"rating": 3.0, "review": "This works well enough if using with apps that allow you to cast (NetFlix, Hulu).  I would love for Google to make more apps for Windows phone--I would love to cast using my phone but can't.  It also does not stream well using Amazon Prime streaming--if I stream from Chrome on my computer, I can get the picture to stream but cannot get the sound to come through on the tv (the sound still plays on the computer).  It seems like they are always expanding the abilities of this device so there's hope that it will get better.", "verified": true, "helpfulness": "0/0", "author": "KNC"}, {"rating": 5.0, "review": "Pros: Many developers are building new apps and/or making them compatible for chromecast ( which means more support and possibilities).Small design, if your TV USB plug provides the right current, there is no need to connect it to the AC.Easy to configure.PLEX streaming for non-suscribers.Great Price.Cons:None, but the device gets quite hot when connected even if it is not in use, though this has not caused any problems to me.", "verified": true, "helpfulness": "0/0", "author": "Pablo Figueroa"}, {"rating": 2.0, "review": "When I purchased this I was excited to use it to stream my prime account.  At the time of my purchas it was only available from Best Buy, Google, and Amazon.  Surely as a primary retailer its own streaming function would be supported.  Nope.  I have netflix and hulu through my BlueRay.  Disappointed that I didn't read the fine print.  Sold it to a friend and works great for his Netflix.", "verified": true, "helpfulness": "0/0", "author": "Aaron Bingham"}, {"rating": 3.0, "review": "Have had this for a few weeks, and mostly works well. Seems like it has problems with WiFi being on the back of my TV against the wall", "verified": true, "helpfulness": "0/0", "author": "Roger Wichmann"}, {"rating": 1.0, "review": "I couldnt cast netflix on tv it says \"time out connecting to target device (16001)I would not recommend this device.", "verified": true, "helpfulness": "0/1", "author": "JayveeSan"}, {"rating": 2.0, "review": "Difficult to use. Needs complete set up with every use.  Sorry I bought this.  Would not recommend to anyone.  Buy Apple TV INSTEAD", "verified": true, "helpfulness": "0/1", "author": "C. J. Gimigliano"}]