[{"rating": 4.0, "review": "We love the Amazon fire except for the fact that it does not deliver HBO GO for Xfinity subscribers. If that were fixed, it would be five star.", "verified": true, "helpfulness": "0/0", "author": "Anine Colaire \"NickerStickers\""}, {"rating": 4.0, "review": "Got a smart TV. Did not need this. Returned with no problem.", "verified": true, "helpfulness": "0/0", "author": "Andrew Stafford"}, {"rating": 2.0, "review": "The lag coming from Netflix is ridiculous. It runs fine for a while following a reboot and then starts stuttering again for no reason.", "verified": true, "helpfulness": "1/2", "author": "Facelessman01"}, {"rating": 5.0, "review": "I LOVE my Fire TV! I cut the cord and now have Sling and Fire TV. I am so very happy! I really enjoy all of the content for kids, my grandchildren found different movies, TV shows and games to play. I discovered new shows that I really enjoy and watching YouTube and other channels is great. I love being able to watch the videos I take on my phone, on my television screen. I've only had Fire TV for a week, but so far, very happy!", "verified": true, "helpfulness": "0/0", "author": "Dana"}, {"rating": 5.0, "review": "Amazing and worth the money", "verified": true, "helpfulness": "0/0", "author": "Eddie S Gamez"}, {"rating": 5.0, "review": "ONE WORD.....AWESOME", "verified": true, "helpfulness": "0/0", "author": "Karlene Howell"}, {"rating": 5.0, "review": "Love it.  It was an easy set up and easy use.  With Prime , it has an amazing number of viewing possibilities.  We just started using it, but so far great!", "verified": true, "helpfulness": "0/0", "author": "Barbara Y."}, {"rating": 5.0, "review": "Greatest thing since canned soda! Simple installation, but make sure not to enclose the receiver in a cabinet! Any movie at HOME!!!!!!", "verified": false, "helpfulness": "0/0", "author": "Debra Holt"}, {"rating": 5.0, "review": "Love the device, really surprising amount of prime content.Only issue I ran into was that Comcast does not allow this device to access HBO Go which sucks but isn't Amazon's fault.Use it everyday, the voice search function is better than any other device on the market I have used.", "verified": true, "helpfulness": "0/0", "author": "Friarmarty"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kristie Trammel"}]