[{"rating": 5.0, "review": "The advantage that this product provides is that it has an additional sound output port (digital optical) which allows me to route sound to  my Sennheiser wireless earphones---(or receiver deck) as I have trouble hearing properly from the TV sound output.  Now, I can experience full benefit from my 'Prime' movies and new releases as well as all of the other 'apps' that it provides.  In combination with a fast WIFI network it streams movies and other programming without  having to buffer data-----no problems to report.", "verified": true, "helpfulness": "1/1", "author": "Deseret Rider"}, {"rating": 4.0, "review": "AFTV is a great little android TV box. I love it especially the prime member services on the box from videos to music and apps. I urge Amazon to enable the USB for external storage connection as for now it's useless unless u want to use a wireless keyboard which is not a big deal. In addition I urge Amazon to remove the newly added banners and advertisement for prime members as we have enough advertisement and recommendation on their website and emails .Being an Amazon prime  member for years now and appreciating it ,!the above are my recommendation to Amazon for an ever evolving fun experience with their little box.", "verified": true, "helpfulness": "0/0", "author": "HISHAM R KAAKI"}, {"rating": 5.0, "review": "The day I received the Fire TV, it went on sale. I called customer service and they provided the difference.  I love the Fire TV. My favorite function is the voice response.", "verified": true, "helpfulness": "1/1", "author": "CJ"}, {"rating": 5.0, "review": "Fire TV works great.  Streams better than laptop or smart TV and the options are great. Easy interface and voice search works well. Would recommend.", "verified": true, "helpfulness": "1/1", "author": "Ben F."}, {"rating": 4.0, "review": "It's pretty good", "verified": true, "helpfulness": "0/0", "author": "Savannah Bowles"}, {"rating": 5.0, "review": "Very pleased with this!!", "verified": true, "helpfulness": "0/0", "author": "Michael E."}, {"rating": 5.0, "review": "Right out of the box, quick setup and easy to navigate. Tons of stuff available to watch.", "verified": true, "helpfulness": "0/0", "author": "J. Chesnulevich"}, {"rating": 3.0, "review": "Cache fills up too quickly and it causes delays in watching streaming video.", "verified": true, "helpfulness": "0/0", "author": "Scott Duncan"}, {"rating": 5.0, "review": "love it .. best christmas present i've ever received", "verified": true, "helpfulness": "0/0", "author": "anita marie hartzell"}, {"rating": 5.0, "review": "PRETTY GOOD BUT I WISH THERE WERE MORE CURRENT MOVIES, UNLESS I'M NOT FULLY UNDERSTANDING HOE TO USE IT.", "verified": true, "helpfulness": "0/0", "author": "Doubting Detu \"doubting Detu\""}]