[{"rating": 5.0, "review": "I like it so much. I bought 3 of this baby. I give them to my family as a gift. So far so good", "verified": true, "helpfulness": "0/0", "author": "Dang Lee"}, {"rating": 1.0, "review": "Unable to complete connection. Not as easy to install as indicated. I returned it. Will wait until they improve it.", "verified": true, "helpfulness": "1/2", "author": "Judith Kurjack"}, {"rating": 5.0, "review": "We have chromecast in our kitchen and gym and it provides hours of entertainment. It's very easy to install and use.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Mrs P Mahurkar"}, {"rating": 5.0, "review": "I have been waiting for something like this for 20 years, Set up is not as easy as they make it out to be but once you get this little thing cranking you get the same feeling you had the first time you rode a bike without training wheels. It is really a life changing experience, for instance I can have my favorite porn on 1 screen while I file my reports for work on another. I just could not be happier with this purchase.", "verified": true, "helpfulness": "1/1", "author": "BlueCrabVintage"}, {"rating": 2.0, "review": "It is a disappointing product. Functionality is very limited. It is only valuable for Google Chrome users. The Apple TV is a more complete solution even being more expensive.", "verified": true, "helpfulness": "0/0", "author": "rodbra"}, {"rating": 5.0, "review": "A great toy! I can now stream Netflix and Youtube content directly to my TV. No longer do I have to rely on a cable to connect my laptop to my TV. That said; it dos not work correctly on all streaming sites. But Google is working on it. The option to mirror your laptop screen is still in BETA and a bit laggy. One serious letdown, is it's inability to transmit in 1080p, you are stuck with the high-end of 720p at best.All in all a great stocking stuffer for the geek in your life.PS. it comes with a USB cable which can be used to power the device if your TV has one and an HDMI extender for those TV's with hard to reach ports!Update: it's ability to mirror your laptops' screen is NOT compatible with Windows 8. When you switch to the \"Tiles\" mode nothing happens. Also bear in mind that for most, the \"mirror\" option, only works for the Google Chrome Tabs.", "verified": true, "helpfulness": "0/0", "author": "J. Suarez"}, {"rating": 5.0, "review": "Simplicity and affordability make this a 5 star item.  I can watch netflix on my ipad but sometimes I want to watch it on tv and I don't want to hassle with the setup required to do that.  This device takes care of everything.  I downloaded the app on my ipad (works with a smartphone too).  Plugged the chromecast into the hdmi port of my tv.  Synced the ipad and chromecast, then immediately started watching shows on my tv.  My son likes using it to turn a 27\" tv into a second monitor for his chromebook without having to deal with wires.  As long as your wireless connection is strong enough to stream on your ipad or phone, the video stream will be smooth on your tv.  The simplicity is what makes this ingenious.", "verified": true, "helpfulness": "0/0", "author": "R. MILLA \"rmilla\""}, {"rating": 3.0, "review": "This product provides good, clear streaming, but pay close attention to what content can be accessed using it.  Have this and Apple TV and Apple has a much wider selection of content and use.  Hopefully they will expand the available use soon.", "verified": true, "helpfulness": "0/0", "author": "Dr. Robert Mitchell"}, {"rating": 1.0, "review": "I didn't know it was needed 2wifi to be able to transfer the video to my tv, I thought it be simple \"connect & that's it but no\" it wasn't I have to hav a wifi connection to make it work", "verified": true, "helpfulness": "0/6", "author": "Cristian"}, {"rating": 5.0, "review": "Amazing bring able to stream on your tv right from your computerwith just one click. Youtube looks do much better on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Timothy Smith"}]