[{"rating": 4.0, "review": "GOOD PRODUCT WORKS AS ADVERTISED", "verified": true, "helpfulness": "0/1", "author": "woody"}, {"rating": 5.0, "review": "I love this system. It is perfect for my needs. I love that I can do Netfliks, youtube, and Amazon Prime all on my TV effortlessly. This is a great system and I am very happy with this product.", "verified": true, "helpfulness": "1/2", "author": "Deborah M. Rodriguez"}, {"rating": 5.0, "review": "Very easy set up, though downloading takes a while...it is WAY better than the Western Digital device that kept giving me problems.", "verified": true, "helpfulness": "0/2", "author": "Marie Conyers \"Medusa Marie\""}, {"rating": 4.0, "review": "works very well.", "verified": true, "helpfulness": "0/2", "author": "Mick Orr"}, {"rating": 5.0, "review": "This is an very well made product that has impressed me so far. The design is simple and clean with obvious attention to detail. Just holding the small sleek remote makes it clear that it was designed with attention to the smallest details as even the material it's made out of feels like higher quality than the average remote. The system is extremely small (about the size of a piece of bread) and  easy to install. Even the most technology adverse person would have to be able to setup this system in minutes. It works great so far, is easy to navigate, and is very fast. I bought a game controller with the system and I've enjoyed playing some of the free games as well as Minecraft with my kids. My kids watch TV shows on a regular basis with Amazon prime and I was very pleasantly surprised a few days ago when I realized that I could watch the new Captain America and X-men movies before they were available at Redbox and without leaving my house to hunt down a DVD. I think this would be a great purchase even if the price was higher but considering how low the price is, this is a no-brainer as a great purchase.", "verified": true, "helpfulness": "2/2", "author": "Lindsey"}, {"rating": 5.0, "review": "I love everything about it.", "verified": true, "helpfulness": "0/2", "author": "J. Anderson"}, {"rating": 4.0, "review": "Good job!  I emjoy amazon products.", "verified": true, "helpfulness": "0/2", "author": "Paul E. Hampton"}, {"rating": 5.0, "review": "We tried using our different gaming systems to access prime content and it was quirky at best.  The Fire TV device was easy to set up and has worked flawlessly.", "verified": true, "helpfulness": "1/1", "author": "Michael Hying"}, {"rating": 4.0, "review": "This is the first device like this that I own, so I cannot compare to other devices but it works great. A lot for me to see on Prime and good quality, very happy.I would have given it 5 stars if not for the fact that I am already on my 4th set of batteries for the remote.Don't know if I have a defective remote or if this is how it is since the device itself cannot switch off and possibly keeps communicating with the remote long after I'm done. I started taking out the batteries when I'm finished and unplugging the device, just wish I don't have to keep doing this.", "verified": true, "helpfulness": "0/0", "author": "Steven Yuk Low"}, {"rating": 5.0, "review": "Switched to Fire TV, largely because cable kept getting higher and service kept getting poorer. Family loves it!!! Super easy to connect took about 2 minutes because I had to move TV to reach our hemi port. Will be getting another for other TV.", "verified": true, "helpfulness": "0/0", "author": "jst1"}]