[{"rating": 5.0, "review": "Love it paired with Sling TV. I don't regret cancelling my comcast cable at all!", "verified": true, "helpfulness": "0/0", "author": "Matthew J. Jackson"}, {"rating": 5.0, "review": "Fire TV was easy to set up. I LOVE the voice search on the remote. I've been very happy with it.", "verified": true, "helpfulness": "0/0", "author": "BILLY SHARP"}, {"rating": 5.0, "review": "Love that it doesn't buffer in the middle of a show.  The Google Cast one buffered constantly.", "verified": true, "helpfulness": "0/0", "author": "Jill Marie"}, {"rating": 5.0, "review": "I love this product!!  I would say nothing is better for benge watching TV series", "verified": true, "helpfulness": "0/0", "author": "Joe Nichols"}, {"rating": 5.0, "review": "I have so enjoyed our Fire TV. We don't have cable, and we stream stuff by computer in the living room, but didn't want to do that in the bedroom. This was a great alternative and so much more to chose from. I enjoy watching all my shows, playing video games, or just listening to music when I just want to relax and read. I also really enjoy the screen saver that is loaded on there. The pictures are so pretty. I have had no issues with it and  it was easy to get going...just a few minutes and it was up and running!!!", "verified": true, "helpfulness": "0/0", "author": "l.mack"}, {"rating": 5.0, "review": "I also bought the game controller, and it is proving difficult to master. I bought it for the grand kid's visit, and wanted to know how to us it before they arrive. My progress is very limited. However, the Fire is easy to setup and use. The wife and I have spent hours with it. We seldom watched TV together until the Fire arrived.", "verified": true, "helpfulness": "0/0", "author": "Richard J. Emmel"}, {"rating": 5.0, "review": "So fast , 10 times better than apple TV.", "verified": true, "helpfulness": "0/0", "author": "jhohane"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Irene Bowker"}, {"rating": 5.0, "review": "So far so good. I like the minimal buttons , and the voice search is great.", "verified": true, "helpfulness": "0/0", "author": "Bruce P. Kramer"}, {"rating": 5.0, "review": "Really amazing technology! I love Amazon FireTV and have canceled much of my cable services because they're a complete waste of money and superfluous when you have this device. The packaging and quality of the device and remote is VERY high end and rivals Apple packaging and quality. The remote is super easy to use and the voice recognition actually works very well (unlike Siri which is terrible). When the device is \"paused\" it displays (after a few minutes of being paused) really beautiful scenic landscapes on your TV. This is a very intuitive product and I HIGHLY recommend it for streaming and VOD services and games. I almost never watch cable/satellite TV anymore...and Amazon FireTV really makes you realize just how old that way of watching tv is.", "verified": true, "helpfulness": "0/0", "author": "Aaron Alan"}]