[{"rating": 5.0, "review": "LOVE LOVE LOVE Chromecast", "verified": true, "helpfulness": "0/0", "author": "Elisabeth Lawson"}, {"rating": 1.0, "review": "None of my devices would stay connected to the Google Chromecast.  After two weeks of trying to figure out if I was doing something wrong I decided to return the item.", "verified": true, "helpfulness": "0/0", "author": "bordee"}, {"rating": 5.0, "review": "Having your TV fully integrated with all devices on your wifi network is amazing and it's totally the future. This device is a joy to use, and while some applications have some kinks to work out, I highly suggest purchasing one of these for you and your friends.", "verified": true, "helpfulness": "0/0", "author": "Colin"}, {"rating": 5.0, "review": "I use this item daily it has definitely turned a useless 1080p flat screen with no TV hookup into a Netflix and YouTube streaming machine. I have it on constantly as it does provide a set of nice background images and the time as well so when you're not streaming to the device it's still a functional piece of tech. I'm actually thinking about buying a few more for the other TVs around my house and just getting rid of cable and just sticking to my Internet service since I'm able to stream all of my favorite shows straight to this simple device via Netflix.", "verified": true, "helpfulness": "0/0", "author": "camper ruybal"}, {"rating": 3.0, "review": "It's okay, but it should really have a way to link your whole computer screen to your TV. Otherwise, what's the point??", "verified": true, "helpfulness": "0/0", "author": "E. Crockett \"monkeyfunky\""}, {"rating": 5.0, "review": "Great product from Google.", "verified": true, "helpfulness": "0/0", "author": "Perry Kethlaor \"SuperPerry\""}, {"rating": 5.0, "review": "This silly Chromecast has changed the way I watch TV. Everything happens from my phone now, no more fooling around with the laptop when it's time to stream Netflix or one of the other streaming sites, it all happens from the phone and its great. Before long phones will be like remotes for everything in our lives just as much as they are phones, and Chromecast is a perfect example of why that is a good idea.Long live Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jebidiah M."}, {"rating": 5.0, "review": "Excellent product¡", "verified": true, "helpfulness": "0/0", "author": "Ariel Dubra"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Alex brown"}, {"rating": 5.0, "review": "What have I been doing without this product!  I really like it.", "verified": true, "helpfulness": "0/0", "author": "Tamera S. Newman \"botz3\""}]