[{"rating": 5.0, "review": "This is an absolutely awesome preduct.  Set up took less than ten minutes, and was very painless.  The video quality, especially when using Netflix through the Chrome browser, is better and more consistent than having a HDMI cable run directly from the computer to the TV.", "verified": true, "helpfulness": "0/0", "author": "thatguy3510"}, {"rating": 2.0, "review": "WILL NOT MIRROR UNLESS ITS AN APPROVED APP", "verified": true, "helpfulness": "0/0", "author": "Bucks1967"}, {"rating": 5.0, "review": "Wow, I still cant believe what all this Tiny 35$ Chromecast can actually do..  Amazing..  It can stream almost aything..It can cast the entire Chrome Browser page to TV- that means you can actually watch any videos on earth on your TV. (No Smart TVs has this ability).Here comes the Best Part - This is the future..  Cast your Android phone screen to TV , Ooooo Laaa...  and thats it. whatever you do on phone see it on Big screen, when it come to games .. Outstanding.. all of your games on TV.. and no investment on consoles.. If really required we can get a controller for android phone..Overall this is a Small device with Big potential... Google i Salute you...", "verified": true, "helpfulness": "0/0", "author": "Praveen"}, {"rating": 1.0, "review": "I travel a lot and just got around to trying to set it up and its dead on arrival.", "verified": true, "helpfulness": "0/0", "author": "Edward J kulbokas Jr"}, {"rating": 5.0, "review": "A new entertainment option, works well.", "verified": true, "helpfulness": "0/0", "author": "Norm Covey"}, {"rating": 5.0, "review": "Love it. This is my second", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "This thing is awesome.  So useful while traveling.", "verified": true, "helpfulness": "0/0", "author": "Nicholas"}, {"rating": 4.0, "review": "Great but wish it was more compatible with more apps, especially amazon prime movies. But very nice and HD quality for the apps it does support", "verified": true, "helpfulness": "0/0", "author": "SCE Eagle1"}, {"rating": 2.0, "review": "Works very slowly in my home, video is always 480p, even though my computer and cellphone have no problems streaming 1080 over my wifi. I requires resetting frequently, I have no idea why. Seemed like a cool idea, but it really just doesn't work well. I'll just stick to using a regular, reliable, HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "J_schuu"}, {"rating": 5.0, "review": "In my opinion it's not as good as a roku. Having said that, it's still a great product at a much lower price. If you want more channel options, including porn, Roku is the way to go. However this will fit the needs of most people.", "verified": true, "helpfulness": "0/0", "author": "T. Dang"}]