[{"rating": 5.0, "review": "I am wordless, since all the possibilities there are with this device. Google you did it.  Take Netflix and share it with everyone. You don't have to carry more than the phone and the Chromecast. (probably a WiFi router with you) / haven't tried that last one.", "verified": true, "helpfulness": "0/0", "author": "Julio"}, {"rating": 3.0, "review": "Not as user friendly for apple users. Really limited at what you can do with it from and iOS device. I am sure in the near future it will have more capability with apple but at the moment it is seriously lacking.", "verified": true, "helpfulness": "2/4", "author": "Carmen"}, {"rating": 5.0, "review": "Does what it do..It's perfect for my old Samsug Plasma.I like to call it instant Smart TV!!Yes I'd like to see more apps avalable and it would be even better if I had local access to my NAS but either way ME LIKE!!The wait was woorth it..Current Cast Working Devices:Moto RazrSamsung SG3Moto Xoom - Primarly UsedGateway Laptop", "verified": true, "helpfulness": "3/3", "author": "Big D~"}, {"rating": 3.0, "review": "I was eagerly waiting for this product to get back in stock to be able to buy it. I really love collecting such tech products (like a hobby!) but also to me chromecast showed a lot of future potential in it. unfortunately it didn't work for me!As easy as it seems setting up this product gave me a hard time! Everytime I try to connect it with my home wifi, my wifi crashes and I don't see it among the network list until I restart my router again. tried several times using different devices (my windows laptop, android cellphone, an iphone) all with the same result. I called google play tech support they tried figuring out the problem while on the phone and they kept working on it with me on e-mails but nothing changed I even called my internet company who provided the router making sure about the router's default settings and we tried changing to several channels but still nothing worked.I eventually gave up and decided to return it.I really hope google finds a solution for this problem soon because I really want to have it!so in general if you like me have westell ultraline series3 router (provided by cincinnati bell) you probably won't be able to enjoy chromecast for now. btw my router never failed me in any of the other devices", "verified": true, "helpfulness": "0/0", "author": "RB"}, {"rating": 2.0, "review": "Was able to send a you tube from laptop normally one time. After that 2 laptops unable to connect via Chromecast app. When I click you tube from the app it keeps searching for Chromecasts  I need to open you tube in separate browser window and send from there.2 Androids send you tubes with some difficulty via app.I wanted to stream home videos from laptop to TV but that is not doable.", "verified": true, "helpfulness": "0/0", "author": "Richard Van Wasshnova"}, {"rating": 5.0, "review": "The Chromecast HDMI Streaming Media Player really make watching a movie from youtube or Netflix without any problem, and the high definition it produce is great.", "verified": true, "helpfulness": "0/0", "author": "Ispy"}, {"rating": 5.0, "review": "I can play vidoe on Netflix, Youtube etc. from my phone, no wires and it's the size of a flash drive.  Magic!", "verified": true, "helpfulness": "0/0", "author": "Geraldine Bilbao"}, {"rating": 5.0, "review": "before using it, upgrade your chrome, i use low dpi, the performance pretty good with low dpi, no issue, very convenient, i like it", "verified": true, "helpfulness": "1/1", "author": "pvo"}, {"rating": 5.0, "review": "Very easy install, works beautifully, great picture!  Very reasonably priced.  I use it to watch Netflix and You Tube on our HD flat screen TV, the loading of the pictures is fast, the quality of the picture is fantastic!  I am really happy with my purchase, I would definately recommend the Google Chromcast!", "verified": true, "helpfulness": "0/0", "author": "Angela's live account"}, {"rating": 5.0, "review": "Does as advertised.  Great for people that have friends and family over who like to share things ( music, video, photos ) on the big screen instead of the pocket screen.  No passwords needed.  Would recommend for everyone. Great to bring on trips so you can use the hotel tv to view your content and not their basic cable plus HBO package.", "verified": true, "helpfulness": "0/0", "author": "JAMIE J. FERRARIN"}]