[{"rating": 5.0, "review": "Got the dondle today and it was ready to go in less than 5 mins.Used on macbook S4 and iPhone 5 with ease. Able to stream and use my phone at the same time. Great product Google..can't wait to see what updates this will have down the road.", "verified": true, "helpfulness": "4/6", "author": "sayyyyy whattttt"}, {"rating": 2.0, "review": "I use an MK808B dongle Called a mini TV.Cost 40.00 and up, Has BLUETOOTH plus 2 USB inputs and can go \"anywhere\" your computer can go and is just as good. Can even hook up a keyboard and mouse, external flashdrive or hard drive. This also hooks up to your TV HDMI.CHUCKR", "verified": false, "helpfulness": "4/28", "author": "chuckr"}, {"rating": 1.0, "review": "Why this Google lovefest? You make it sound like they just invented the wheel. News flash! There are scores of devices out there that already do what Chromecast does except they do it way better!", "verified": false, "helpfulness": "11/114", "author": "Sir Barks a Lot"}, {"rating": 1.0, "review": "What? when I go to [...] it says, iOS coming soon. Why wasn't this advertised? I am returning this. not worth.Update: iOS setup is currently unavailable. Other setup options are windows 7 leaptop, MAC laptop or android device.I have windows xp laptop. I tried setup on xp laptop and gave up after multiple failed setup attempts.Once the setup is done, I can use my iPhone/iPad to stream.I will need to borrow somebody's windows 7 laptom or android device to setup the chromecast.Lot of waste of time.", "verified": false, "helpfulness": "11/112", "author": "SP"}, {"rating": 5.0, "review": "After spending the last 12 hours with the Chromecast hooked up I can firmly say this is worth 35 and then some. Lets be real, if you have a crappy WIFI connection guess what, your results will stink....junk in and junk out, streaming video requires a good connection....that being said I have a solid Asus router that covers my entire house with 2.4 GHz and 5 GHz WIFI with no issues so this little bad boy get 5 bars on every floor.  The coolest feature is being able to sling chrome tabs to your TV....I spent the night playing videos on Disney.com for my daughter and playing them full screen 720p High Bitrate with out a single hiccup....the Netflix and Google Play Music/Videos functionality works without a hitch in 1080p (right now you can only sling Chrome Tabs in 720p since it is a beta feature)  You really cannot go wrong for $35 it has the potentional to make you a cable cutter since you can sling videos in Chrome tabs without an issue...check it out yourself and ignore the idiots giving the device a 1 star when they have not even tried it yet.", "verified": true, "helpfulness": "5/7", "author": "Bradley Gogats \"Brad\""}, {"rating": 3.0, "review": "[Update Below: They now say that I will get the promotion, and that it will physically come with the device. Expect another update when I get it tomorrow.][Update, Again: I did get the promo code emailed to me by Amazon. I'm satisfied, but spent about 3 hours of my time making sure that this would happen. Now that I got it for $11 I can say that I'm impressed by the Chromecast. But, not that impressed. It doesn't really do very much. Sharing a tab from Chrome is kind of cool, but not that useful. I'd like to share a tab from my phone, or something, but it's been over a month and nothing is materializing. And, Google has squashed one developer's homebrew app that allowed streaming content to the Chromecast. Looks like this device will be a dud because I don't give a cr@p about youtube videos on my TV and every device on the planet streams Netflix. Why would I buy this instead of a Roku?Do yourself a favor and buy a Roku instead.I purchased this at 1:30 PM pacific time from Amazon by linking from the Google product website. After hearing of some confusion over the free netflix promotion, I decided to do some digging:- I called Amazon customer service. They were unaware of the promotion at all. They suggested I call google since it was their product, and they provided me with a number.- Google told me that the promotion wasn't honored if you purchased it from Amazon. I protested since I linked to Amazon from tgoogle's own product page and this difference wasn't made clear. They said there was nothing they could do. They suggested that I call Netflix since, strangely, they claimed that this wasn't even their promotion, it was Netflix's.I'm going to call Netflix, but I suspect that they won't claim responsibility. I don't blame them, really. I blame google. I could have easily purchased it from the google store if I had known there would be a 68% price difference! Jeez! That's mostly the reason I purchased it in the first place. It's already on its way and will be here tomorrow, so it's too late to cancel. I'm really p*ssed about this.Update:- I contacted netflix. They actually seemed to be aware of what I was talking about! They told me that I should get the promotion no matter who I bought it from. However, they said that the promotion was Google's responsibility. They reiterated that they think that I should get the promotion and suggested that I contact Google again. Poop. Overall, though, they were much nicer and sounded much more informed that anyone else I talked to.- I contacted Google again. They told me AGAIN that they could do nothing for me and that I would not get the promotion because I purchased it through Netflix. I, again, asked to speak with a supervisor. After a minute the agent told me that he had new info. They now say that I WILL GET THE PROMOTION and that it will come with the device. Whew! I asked him to email that info to me for confirmation. He did. I'm satisfied for the moment. End.Story.", "verified": true, "helpfulness": "17/45", "author": "Andrew"}, {"rating": 2.0, "review": "I don't have an Android phone or tablet. Perhaps that's the problem. But, if you read all the marketing material about Chromecast, it is promoted as a completely cross-platform device. That's part of what was so appealing. The other part, was the price, particularly with 3 free months of Netflix ($24 value).I ordered online and picked this up at BestBuy this morning because Amazon was out of stock. My receipt lists the Netflix offer, but apparently that has been retroactively pulled. Lots of news stories about that, and I have not been given any codes. So scratch that aspect of the purchase decision. My $11 device is back up to $35.So for $35, what do I get? As far as I have figured out so far, I can mirror content being displayed in my Chrome browser on my Mac. That's almost it. I don't have Netflix. If you go to YouTube and play a video, you can flip that to the Chromecast, close your browser window, and the device plays it directly.Beyond that, although this device is presented as being \"controlled by your phone, tablet, PC\", it is a mirror. Think AirPlay or AirParrot. Beyond YouTube, and presumably Netflix, when you close your laptop, that's that, it's over. There is nothing else \"there\" to control; unlike Roku or AppleTV, for example, which have UIs, the Chromecast does not. I imagined I'd be controlling apps, on the device (or, more likely, in the Cloud), but that's not the case.Want to watch a video on your HD? Play the video in Chrome and mirror it. Want to show photos on the TV? open the phones, one-by-one in Chrome. This really is the problem with no remote control! With AirPlay, I can allow remote devices to be in control, so my AVR can flip through iTunes songs.At this point, I would not recommend purchasing the device. Unless you really like YouTube cat videos, and for some reason want to watch them on your TV instead of on the device that you must use to browse the videos you want to play. The only exception would be to Netflix-enable your TV. That would be worthwhile if the Netflix offer were still there; as-is, I think this $35 is better spent on a more robust Netflix-enabling device for your TV.", "verified": false, "helpfulness": "9/32", "author": "Traveling the world"}, {"rating": 5.0, "review": "First --- I got mine from UPS this morning, and i've been loving it all day.1. Netflix works great -- browsing/choosing/controlling playback from my nexus 4 works beautifully.2. Tab casting also works great. I tried it out with SouthParkStudios, and it was flawless. Only downside (if it's a downside) is that you need to leave your computer in fullscreen mode if you want the southpark video to be in fullscreen.3. Youtube is awesome. There is a new icon on youtube videos that lets you cast to your TV.Welcome to the future, Gents.", "verified": true, "helpfulness": "7/10", "author": "krisw"}, {"rating": 5.0, "review": "The Google Chromecast at launch, even with limited applications on day one, is a fantastic streaming device for the cost of $35.Today this is not the Apple TV or Roku, but after using it for a few Netflix shows, YouTube videos, and video streaming from websites in the Chrome browser I am very impressed.There are a lot of people who are saying this device is nothing new from what is already existing, however, aside from the form factor this device isn't aiming to be something brand new. It's a low profile and with simple cable management, can be hidden completely behind the TV.If you are like me and have been considering a streaming device, but couldn't settle on what to get, do yourself a favor and consider this device.Google already has apps in their Play Store to utilize MLB.TV, HBO Go, Hulu, etc, it's just up the developers to add Chromecast support and i don't see why they won't do that.Unless you are completely biased towards Apple or Roku or paranoid about Google monitoring usage there's no reason to look down on this device.*** UPDATE 7/26/13 ***Amazon wised up and made their content unavailable for Chrome casting. I don't blame them, but hope this means they are working with Google form an app rather than shut out users.I have connected to Skydrive to view photos and documents, works really well. Not perfect, but great way to easily show off photos to a group of people.Had a few issues when the nexus 7 tablet was too close to our baby monitor so I think there was some interference, moved the nexus a few feet away from the monitor and connectivity improved.Again, I think this is a great $35 device with a lot of potential. A lot of places are still directly comparing this to AppleTV and Roku, I think they are doing all three devices a disservice in this comparison.Chromecast gets five stars from me for these reasons:1. Small and discrete. Easy to conceal behind a larger TV, 32\"+. USB power from TV works.2. Works on multiple devices. I don't need a Google product to make it work.3. It is $35. Which is fantastic.4. Extremely portable, adds no weight for travel to my computer bag5. Android is the mobile OS with the most users worldwide, I'm not too worried about app adoption/integration. If there is no app adoption/integration then it is $35.Is see the negatives as:1. Limited content at launch.I don't deduct due to content for the simple reason that it has been three days since launch, the Chromecast was a surprise announcement and not the headline product. I am confident that content apps already in the play store will adopt the feature relatively quickly and easily.", "verified": true, "helpfulness": "13/19", "author": "Michael Kmiec"}, {"rating": 4.0, "review": "It still sounds like a great product and, no, I do not yet own it but people should know that the Netflix offer has been pulled due to the overwhelming response to the product. It doesn't affect my intent to purchase but buyers should be aware as the news just broke. Four stars is to keep from skewing the average with a non-review.[...]", "verified": false, "helpfulness": "4/14", "author": "MadMonk \"RudeBuddhist\""}]