[{"rating": 1.0, "review": "The bottom line here is that Amazon had a chance to best Roku and missed it.  As the basic interface arrived defective any apps or channels that port to it will be unlikely to re-port using the corrected features after Amazon decides to fix the OS.  Maybe I'll try again on version 2. Good hardware and beta OS & software for users without kids. After a week of Fire use, I bought a Roku 3 to compare and am sending back the Fire.The Fire is a really slick piece of hardware.  However, this is first day tech with a good looking clean first start up (call it beta) software.  It is a clean simple interface that lacks quite a few features.  Example: One of the help videos does not exist. This is my last day day insight.  Here is a short report.1. Un-boxing and installing either the Fire or Roku took less than 5 minutes (wired).  I had to hunt for the command to update the Fire software... Roku did it automatically.2. There is lots of stuff to watch on either one. The Roku has Amazon and more channels than the Fire. The Fire has Amazon Prime as its primary free content (if you buy Prime) with fewer channel options and fewer ported apps.  Current news is lacking on the Fire/Prime but there is lots to watch for entertainment.3. For both devices the hardware is apparently well made, really small and handy.  At my house the box replaces a dish or cable box that is 10x larger. I had no perception of either Fire or Roku having a better picture or more speed although much is made of this in other reviewers comments I see/feel nothing.  Maybe the Fire CPU is faster, but who cares if you cant perceive it?  Maybe this shows up for gamers?4. Rewind and fast forward are really sad compared to a dish, DVR or vcr. Not as much ability to see the picture when going either FF or rew.  You are typically unable to fast forward through commercials and some channels have 3 minute content with 2 minutes of the same commercials coming before each content you watch.  I just don't want the content that bad...5. The Roku remote has a headset jack which is far better.  The Fire remote is apparently a great artistic design that looks like it was designed by apple.  Unfortunately the coolness of either remote sacrifices features that are expected. One example would be the key pad.  This is not a problem when using Fire Amazon features. On the Fire Amazon uses voice command.  But its an annoyance when using the apps and other channels, none of whom use the voice command. Apparently Fire developers think this will keep users on their content? Using the majority of the channels/apps/search tools with either remote is a pain when typing.  Fire could win this one easily but failed to port the voice command to text typing.6. For the Fire the main OS controls are typically sorely lacking.  No ability to configure anything that you would want to configure. Frankly the Roku is not much better but it is better. Example below...7a. For instance the Fire child controls lack the ability to lock your kids out of porn.  So this is for a home with no kids.  You cannot lock your kids out of specific apps or adult content or have them log in as a user which is significantly controlled. AMAZON THIS IS A DEAL BREAKER FOR MOST HOUSEHOLDS.  (Before everyone corrects me. Let me say that there is a way to turn off channels that you don't want and then turn them back on each time that you want them.  This is too much of a pain to be useful.)7b. With regard the parental controls, the Roku is just marginally better... enough to use it. If you want child control on the Roku you have one Roku for the adults TV and one for the kids TV.  The one for the kids will only have kid apps and kid content only channels.  Sadly that means that your Prime content is off limits on either device because once you unlock the Amazon Prime access all your kid has to do is search \"Porn\" and there it is.  So on the Roku most of what you would allow your kid to see has to be locked because most of the channels have no parental controls.  There are some notable exceptions but again it is just useful enough that you can use it with kids in the house... and no more.8a. Really the Fire lacks so many features that the best way to use it is to select what you want to watch with your PC on amazon.com then sync the online selections to the unit, you run the unit with the assistance of the PC because the interface is lacking.  Probably your smartphone or tablet will work too.  On the Fire much mention has been made of the failure to include standard criteria searches for content, like Prime and western.... or Prime and comedy.  I read that xbox does this.  On Fire what you have to do is scroll and hunt.  It still works but its annoying and takes forever. In my opinion the failure of the voice control in not doing what you want is more annoying than not having the feature at all.8b.  Since there are a lot more apps and channels on the Roku I would say that I am picking from more choices and although the interface on the channels that are the same as Fire is just as kludgy I didn't find the need to exhaustively search Prime to find something to watch due to the greater number of channels. That said, the Prime content and pick from your pc online is the same problem on both devices.  The main point is that most of what you would want to watch for free is on Prime when using the Fire.For both devicesDependent upon the channel the almost total inability of the software to mark out or exclude series shows that have been watched is a royal pain.  Example: On Amazon if you pick a series that you want to watch then there is no way to mark a show as watched if you previously saw it.  Some channels may mark a watched show when you watched it but you still have to search for unwatched shows among shows marked because you watched them on the Fire or Roku and shows you saw prior. So every time you sit down to watch TV you have to go through every series that you marked to watch to examine if you have seen all of the episodes.  Apparently the programmers thought users want to watch the same episodes over and over again.  Certainly the standard for watching TV's is to have your DVR, dish, vcr or whatever record the new episodes and you could delete each episode from your device after watching it.  With both devices on (example) Amazon you have none of that.  So if you pick a series with 9 seasons each having 10 episodes then you have to search 90 shows to find out if there is one that you want to watch every time you want to find something to watch.  If you pick 10 series you could decide to sit down for an hour to watch TV and spend the entire hour looking for something that you have not seen. JUST BECAUSE THE INTERFACE SUCKS.The bottom line here is that Amazon had a chance to best Roku and missed it.  As the basic interface arrived defective any apps or channels that port to it will be unlikely to report using the corrected features After Amazon decides to fix the OS.  Maybe I'll try again on version 2. So Roku or Fire can win the race by adding voice command available to all channel programmers and apps,useful parental control, better configuration control of the user interface.", "verified": true, "helpfulness": "11/13", "author": "ken \"average guy with opinion\""}, {"rating": 5.0, "review": "Absolutely love the Kindle Fire TVEasy to set up and use. Thank You, again Amazon for a superior product.", "verified": true, "helpfulness": "1/1", "author": "char"}, {"rating": 5.0, "review": "Really like the fire tv, I have had apple tv and this surpasses it.", "verified": true, "helpfulness": "0/0", "author": "Ronald Justus"}, {"rating": 5.0, "review": "Great product.  Responds quickly compared to my Samsung TV with Amazon Prime included.  This thing works great.  I don't know what else I can want from this device.", "verified": true, "helpfulness": "0/0", "author": "GaryS"}, {"rating": 2.0, "review": "Fire TV could be a lot better. The principal deficiencies are a weak search function and a second rate interface for Netflix. The navigation is also not always the best. Too many trips back to the Home screen. Another really annoying deficiency is the difficulty with removing the casing on the remote for battery replacement. Unless you have iron fingers or fingernails, a screwdriver of other implement is needed. The device is fairly fast and they have kept the remote very simple--perhaps too simple but that is a matter of taste.", "verified": true, "helpfulness": "1/4", "author": "David L."}, {"rating": 5.0, "review": "better than cable even got rid of cable and have this was well worth it", "verified": true, "helpfulness": "0/0", "author": "TINA-BUM-BUM"}, {"rating": 3.0, "review": "I'm not going to go into detail since thousands have already done this.I bought this when it first came out, pre-ordered it. It has its pros and cons.  The Amazon content loads lightning fast. But have found that Netflix loads very slow and at times, just drops and has to reload again. I even get a pop up screen telling me that my WiFi signal is very weak, which it is not. If this is the case then why don't I ever have any problems with the Amazon streaming?I have the RoKu side by side with the FireTV. So I would switch back and forth. Netflix content loads quickly on the RoKu and I have no drops.I actually like the user interface of the Fire TV better. But this issue with the slow Netflix streaming is annoying. Sometimes it just hangs for minutes.", "verified": true, "helpfulness": "1/1", "author": "Boozwaa"}, {"rating": 5.0, "review": "Very fast, great quality streams and a perfect companion for amazon prime video.", "verified": true, "helpfulness": "0/0", "author": "Andy \"Andy\""}, {"rating": 5.0, "review": "Bye bye cable!! This was a great investment. Shows download so fast and readily cue to the next episode if you are watching a series. I find I am now watching quality TV instead of just what happens to be on at the time. Saving over a hundred dollars a month and enjoying my choices much more! May have to get another!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Lydon \"Lizzy B\""}, {"rating": 5.0, "review": "best thing ever for stream box, love the stats love the stream rate no lag no playing catch up, better than apple tv!  a MUST HAVE", "verified": true, "helpfulness": "0/0", "author": "George Murphy"}]