[{"rating": 5.0, "review": "Thank you!", "verified": true, "helpfulness": "0/0", "author": "m.ilk19"}, {"rating": 3.0, "review": "Works as advertised, lacks apps like roku but faster better streaming from phone & saves battery on the phone as the screen on the ph can be switched off after you start playing something.", "verified": true, "helpfulness": "0/0", "author": "irian"}, {"rating": 1.0, "review": "Never did get this to work.", "verified": true, "helpfulness": "0/7", "author": "dave gray"}, {"rating": 5.0, "review": "Love this thing.", "verified": true, "helpfulness": "0/0", "author": "Phillip Morrill"}, {"rating": 4.0, "review": "An amazing little electronic device. Useful in so many ways. The downside is it is a little bit slow and unresponsive from time to time.", "verified": true, "helpfulness": "0/0", "author": "ryan nguyen"}, {"rating": 4.0, "review": "Originally I hated this device. It just didn't work for me at all. The connection dropped in the middle of every movie. After months of ownership and occasionally attempting to try it out it finally works. I'm assuming the software has been updated correcting the initial bugs I experienced. It still drops connection occasionally when casting directly from chrome browser but that feature is still in beta, so it is to be expected.I am now able to use it to watch netflix on my tv... Also a decent smattering of other video apps available on my phone. Most importantly I can use it to play my media files using plex. It took a bit of setting tweaking to get it to function well (especially when my pc wasn't hard wired to my router), but it is now fairly reliable.I wouldn't say I love the chromecast, but now that it's working I do quite like it. I really hope amazon instant adds chromecast support to their app, but with their fire stick I sort of doubt it.", "verified": true, "helpfulness": "0/0", "author": "J. Ranieri"}, {"rating": 5.0, "review": "Works great casting from my iMac to my Panasonic plasma set. Was fairly easy to setup even for an old guy like me with bad vision (the reason why I have a large screen plasma set).", "verified": true, "helpfulness": "0/0", "author": "Joe Seda"}, {"rating": 5.0, "review": "love it. worked out of box.. fast shipping too..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like the chromecast", "verified": true, "helpfulness": "0/1", "author": "Olvin"}, {"rating": 4.0, "review": "A great media extension of your phone on your TV.", "verified": true, "helpfulness": "0/0", "author": "J. Carpenter"}]