[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Dennis Harris"}, {"rating": 5.0, "review": "No complaints", "verified": true, "helpfulness": "0/0", "author": "Jose C. Cisneros \"amateur in every respect\""}, {"rating": 3.0, "review": "It isn't bad, and normally I don't mind being a part of beta tests - but the functionality is poor. It doesn't work on Amazon prime, HBO Now, and many many many others. I was thinking these would be added relatively quickly, but it seems like that is not the case. I wish it would just work with more things.", "verified": true, "helpfulness": "0/1", "author": "christina"}, {"rating": 5.0, "review": "Good stuff!", "verified": true, "helpfulness": "0/0", "author": "Tim Bradford"}, {"rating": 5.0, "review": "Loveeeeeeee", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 4.0, "review": "Great product you're just limited too the videos you can cast on  your device mainly just youtube", "verified": true, "helpfulness": "0/1", "author": "Nikki Allison"}, {"rating": 1.0, "review": "Underwhelmed. Connection and buffering issue is much higher than expected. I've used less than 5 times since I've bought it.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Busterud"}, {"rating": 3.0, "review": "HDMI EXTENDER CABLE DIDNT WORK. Sorry for all the caps but I'm not going back to fix it. Works fine for steaming movies on with TV Cast so it's everything I needed.", "verified": true, "helpfulness": "0/0", "author": "T Klink"}, {"rating": 5.0, "review": "I have 75' Samsung curved UHD TV and wasn't sure why I would need this ever. I got it when it went on sale to play with it and had to buy 2 more. I don't use it on my Samsung smart tv because there is no need, I can screen mirror from my Samsung 6s. But for my garage and both of my kids this is awesome. I was even able to send back the Direct TV boxes from there rooms! If wasn't for Direct TV's exclusive on the NFL, I would drop them all together. If you can find it for $20 bucks like I did why not try it out?", "verified": true, "helpfulness": "0/0", "author": "Moose9779"}, {"rating": 5.0, "review": "Literally, one of the best and most useful purchases i have ever made", "verified": true, "helpfulness": "0/0", "author": "D Scott"}]