[{"rating": 1.0, "review": "It's not what I through it would be. Sorry I don't like it . I love everything kindle but not this.", "verified": true, "helpfulness": "1/2", "author": "cope475"}, {"rating": 4.0, "review": "The device works great and is super fast.  Menus and layout are dedicated primarily to AmazonInstant video (paid and Prime video). Current apps that require a cable provider login (hbo go, etc.) are not supported by Charter or Comcast.", "verified": true, "helpfulness": "0/0", "author": "Michael Long"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Shari"}, {"rating": 5.0, "review": "Easy to set up and use. Great choices for older and newer tv & movies. I'm not a gamer but love all of the a available options! It's great to see my favorites from my kindle on a bigger screen!", "verified": true, "helpfulness": "0/0", "author": "barb \"I'm totally addicted to audio books! I listen when my eyes get too tired to read and when I am driving or just don't want to sit and read!\""}, {"rating": 5.0, "review": "I cannot say enough about this product. It has liberated me from cable TV and is easier to use than TV. Take back your viewing power and enjoy the control of Fire TV.", "verified": true, "helpfulness": "0/0", "author": "CLAYDO"}, {"rating": 5.0, "review": "Tried another streaming device and returned it due to connectivity problems. Purchased amazon fire ..... connected to my wireless instantly. I'm a prime member and the prime video/tv selection is awesome. Would definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Mo"}, {"rating": 5.0, "review": "Very easy set-up. I wanted to watch You Tube in my kitchen and it works great. I wish it had a browser on it so I could surf the net a little but it works great for what I wanted it to do.", "verified": true, "helpfulness": "0/0", "author": "Gregory L. Calogero"}, {"rating": 4.0, "review": "Reading other reviews I knew it wouldn't be like having cable but it works for us allowing us to eliminate our cable bill. We love the voice search and the fast speed. It was very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Deborah Heilbrun"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/0", "author": "Alexander"}]