[{"rating": 5.0, "review": "I've had Apple TV, roku and now fire tv. Playing games with the controller, watching movies, listening to local radio, watching netflix. Love it. The voice search needs some work, but I'm happy with it.", "verified": true, "helpfulness": "5/5", "author": "Joe Horn \"cookingquest\""}, {"rating": 2.0, "review": "The UI is counterintuitive in that whatever button you have highlighted is darkened slightly. If there are only two buttons on the screen, you always end up choosing the wrong option.There's no way to browse shows and movies that are available for free to Prime users. You browse everything and hope you get lucky.Too hard for your kids to play games without constantly bumping into in-app purchase options.Too much of this feels like there's a overtly blatant attempt to lead me into spending more money.Try again Amazon.", "verified": true, "helpfulness": "7/12", "author": "Brian Pozar"}, {"rating": 4.0, "review": "I bought the Fire TV because I watch a lot of prime programming as well as Netflix and wondered like most, if super hardware could improve the streaming experience. The answer is a definite yes for Prime and a little better for Netflix. The gaming capability will be very attractive for anyone liking gaming. There are many games available...they work with the remote, just about any wireless controller(Xbox) and the new some Amazon game controller.Construction:Amazon Fire TV is an extremely well built and designed streaming device which works great with Amazon Prime and Netflix. It comes with device, power supply, remote, batteries for remote and quick start directions. The box itself is a very solid, fairly heavy for a small box and sits perfectly on a flat surface. All the connections are on the back so hookup is extremely easy and foolproof. I used an Ethernet cable directly to the router to my TV but the wireless connection works well too.Setup:The setup and first use was completely automated and very easy. One of the first things that the box does is download updated software. It should take 5 minutes but my unit required 15 to 20 minutes to download and several minutes to update. The unit will search for the hand remote (make sure you put your batteries in ASAP so the Fire TV can connect to it). Overall the setup is easy even for the non technically inclined.Comparison to the main competition:I own a Roku 3 which is a great streamer with unparalleled content. It has a fast dual core processor with much less memory, a micro sd slot which Fire TV does not have, controller with earphone port and game controller functions. The Fire TV comes with great apts like Netflix, Hula plus, Pandora etc. and a many other channels. The actual number of channels available now is very enhanced compared to when launched. Amazon has continued to add many apps, channels and games to the Fire TV since it's release and this adds much more value to your purchase.What's great about Fire TV1. Very easy to use and setup is automated.2. Incredible menu speed.3. The box is just over half inch thick and 4 ½ inch square and sits securely on any surface even with all the cables dangling  from the back.4. It runs much cooler than the Roku which can get quite hot even when resting.5. The remote is very light, small and easy to hold, clearly marked and works flawlessly. but has no headphone jack.6. The voice activation for (Amazon Prime and a few other apps) works extremely well.7. HD optical Audio out for your stereo system.8. If you are a Prime member your box is already setup for you. Not a prime member....free 30 day trial is offered.9. Very speedy operation and excellent streaming speed. It's so smooth, Amazon Prime and Netflix content seems like watching a DVD.10.Lots of gaming apps available if you like gaming.11.USB port can use wireless keyboard. This works great with searching for programs in Netflix and other apps. Arrow keys, pause and other keys function well. A usb wireless game controller would probably work well for games.12.Integrates with the Amazon Kindle's to mirror what is on the tablet. It does work.13.Bluetooth controllers can be added including Amazon's new game controller.What's not so great about Amazon Fire TV1. Fire TV now has hundred of apps but it doesn't have the breadth of channels that comes with the Roku lineup.2. It's an Amazon product so Prime is king here. The major channels like Netflix, Hula Plus are there and work well but voice activation won't work with them. A wireless keyboard helps with navigation on these other channels in searching for content.3. The remote doesn't have the headphone jack like Roku.4. The remote works very well as a remote but isn't as flexible for gaming as the Roku remote.5. The menu system works but is flawed compared to Roku which is much easier to navigate.Amazon Fire TV or Roku 3...Which is best?If you are choosing a streamer for the first time and you like to watch a lot of Prime or Netflix, and enjoy games than the Fire TV is a great choice. If you want to explore an unlimited number of channels in the thousands than, I think the Roku (3) is the best choice. It offers fast streaming and a great interface with extremely versatile hand remote. I have both hooked up to different ports and use the Fire TV for Prime and Netflix streaming, games  and Roku for channels not included with the Fire TV. Can't go wrong with either but both is even better.Conclusion:Amazon Fire TV is a great steaming product that I think most customers will enjoy using but like most products it's not perfect. Right now I like the Fire TV and it's the stearmer I used the most.I hope Amazon in time will add many more channels and improve the interface. When that happens, I will consider it worth five stars.", "verified": true, "helpfulness": "5/9", "author": "Roger James \"Doc\""}, {"rating": 5.0, "review": "I have an AppleTV and a Roku.  Amazon Fire TV is making me question my allegiance to Apple for my digital content.  The experience of scrolling through Netflix or Amazon Prime to find something to watch is far easier and faster.  Two big thumbs up", "verified": true, "helpfulness": "5/8", "author": "Andrew Todd"}, {"rating": 5.0, "review": "We are so excited!!  The ease-of-use and options are just amazing.  I have been paying about $100 for cable or satellite each month primarily to have access to the children's channels and a few shows that my husband enjoys.  From here on out we just need the Amazon Fire.  It just seems to good to be true.  Thank so much!", "verified": true, "helpfulness": "5/6", "author": "Sthomas \"tshannon3201\""}, {"rating": 5.0, "review": "After careful research, much of which was done through friendly amazon reviews over the past couple weeks, I ordered the Amazon Fire TV. I appreciate all the honest reviews here because they answered many of my questions. I received my Fire TV and plugged it in effortlessly (my boyfriend did it, but it was literally two cords)- and then it downloaded a software update. Once the update was over, the rest of the install was truly easy- a short video came on explaining how the amazon tv menu works and then the next thing I knew it was set up. My amazon account is already loaded onto the system and downloading apps like netflix or smithsonian channel were quick and easy. I love that the remote is user friendly and the speech function works better than my sons Xbox 360. (Nice!!!!!)My son happened to come home just before I could play with my new streaming device and he is a techie so quickly discovered that his PS4 controller is compatible with the Amazon Fire TV. Once I retrieved my device and had him unplug the remote I found a few things to point out.I have not used other streaming devices so cannot compare. I believe, based on the research I have completed that Roku offers many more channels some of which are free and others are subscription based. Thanks to online articles and helpful reviewers here at amazon, I now know that most devices offer variety of channels to watch tv shows and movies, but not one device offers everything. I do not have cable tv right now so cannot make any claims as to the ease of watching cable through the Amazon Fire TV device.Pros:Easy. Great for those who are not into gaming or really technical. The remote has easy to use  buttons much like cable tv remotes only simpler. A \"home\" button is helpful because it puts the user right at the beginning.Account information preinstalled.Everything loads up automically. Saves time and it is easy.Fast processor translates to moving quicky through selections and downloading applications effeciently. I like the fast speed and think its great!!! My shows played fine especially since I have internet issues in my room.Parental controls available to control ratings and time allowed. I chose not to use this feature.Netflix was easy for me to load- just entered my username and password, then picked my profile. I was able to navigate through netflix without problems and felt comfortable switching from amazon prime shows and netflix without getting confuses.Variety:I was pleased to view the Smithsonian channel with plenty of diverse short clips on nature and science.  This was great. There were also fitness, cooking, and music channels available too.Screensaver: I love the screensaver and it was an unexpected delight! Tons of scenes- good quality and very enjoyable.  They don't repeat the scenes frequently either.Cons:It does not appear that there is an application for Redbox. If there is, I can't find it. I don't have a redbox streaming account but am considering one.It is not always clear which items are \"paid\" versus free in applications. For example, in the main menu for amazon prime many items are available, some of which are for rent. For me, it wasnt until I actually clicked on the movie to get more details before I saw that it cost money. After using the device for a couple of days, I did see that the items that are free state \"Watch now\" versus \"View trailer\".Questions for me to ponder:Would it be feasible to use this device when traveling in hotels with either ethernet access or wifi. I think it would be a pain to have to log the sign in information in daily while spending time at hotels, However, it could be worth it for extended stays. Would it be easier than plugging in an ipad?Summary: Exceeded my expectation and I am very glad I purchased it!!!", "verified": true, "helpfulness": "3/4", "author": "Mom of 3 \"butterflydreams\""}, {"rating": 4.0, "review": "I also own the Roku 3, Apple TV, Google TV and a few other Rokus and other connected devices.  By comparison, I still like the Roku 3 the best, with the Amazon Fire TV second, the Apple TV third and the Google Chromecast last.  For example, the Roku currently will play my amazon cloud music.  I was shocked to discover that Amazon launched this player without this feature, although I understand it is \"coming soon.\"  The Roku also has HBO Go and Slingbox client, both of which are missing on the fire tv, These are 2 video features I use quite often.  That said, the fire tv is a nice little box and the games add a nice touch and should prove more valuable over time.  i like the cloud photo feature.  The voice feature works good as well.  Just a few more features, all solvable with software updates, and this could be my favorite player, but for now Roku 3 still rules for me.", "verified": true, "helpfulness": "2/3", "author": "Robert G Simers"}, {"rating": 5.0, "review": "When I saw this was available I did not hesitate in purchasing it, as it would go well with my Amazon Prime subscription I had recently purchased.  The product arrived in quality packaging, was very easy to set up and worked instantly without any problems.  I use it daily and have not had any issues, this was an excellent purchase.  Hopefully in time Amazon will offer more movies, apps and games as this is a terrific product.", "verified": true, "helpfulness": "2/2", "author": "MontanaUSA"}, {"rating": 2.0, "review": "Pros:-Easy to setup.-Wifi speed is great.Cons:-Can't play video from usb port.-Voice Search is limited to Amazon and Hulu content.-It's not easy to distinguish between free and paid Amazon Prime content.-Adding apps is not at all intuitive. Took me a while to figure out how to add YouTube.-Netflix App is pretty weak.-Most games are dull ports of what you already have on your phone.Overall, I'm left wondering why I bought this. While its technical specs and performance are impressive, it seems like Fire TV was designed to funnel customers directly to paid Amazon content. That's a pretty arrogant move for a $99 device. I hope Amazon realizes that cord-cutters source their content from a wide variety of sources, and that what we really want is a flexible, comprehensive, and open system for accessing it.", "verified": true, "helpfulness": "9/15", "author": "MWK"}, {"rating": 4.0, "review": "I purchased the Amazon Fire TV to replace my Roku 2.  The Roku 2 was cheap and simple.  I got it as a Christmas present and it has worked well for the most part.  I liked that it had HBO Go but was sorely disappointed that it lacked YouTube.First off, I have to mention that it doesn't have HBO Go yet.  Right now, this isn't a deal breaker for me since I've got a lot of non-HBO shows that I'm catching up on.  But I certainly hope that at some point, it will come.Beyond that however, the Amazon Fire TV is fantastic.  The interface is smooth and fast.  When watching Netflix, movies and shows load up noticeably faster.  I used an HDMI cable for both devices but noticed on the Amazon Fire TV that the sound doesn't jump as much from watching regular TV vs a set-top box.  I had to always remember to lower the volume before starting the Roku because the sound would go up so much.  Although the voice search is limited to just Amazon, it does work quite well.  If it ever gets integrated into Netflix, that would be a huge plus.YouTube is available and works great.  I was able to enter my email address and it showed all my subscriptions and favorites, which was very nice.  Playing videos in HD is also smooth and fast.  It's nice to finally be able to show YouTube videos to family and friends on the TV without having to plug my phone with an HDMI adapter.Design wise, I really like the remote.  It's very ergonomic in the hands and is a breeze to use.  The Amazon Fire TV itself is very small and looks very sleek and modern.The reason I don't give it five stars is because setting it up on my wireless network was a PITA.  In fact, I almost returned it.  When I did the initial set-up, it kept disconnecting while trying to download the update.  I tried multiple times restarting the device and my router.  In order to actually get the update, I had to take it upstairs and plug it in with a network cable.  I feared that it would have trouble downloading data once I went back to wireless.  However, once it was updated, it has run flawlessly on my wireless network.  I've had it for over a week now and haven't had any problems.I was considering cancelling my Prime Membership when it expires this August but having this device is making me reconsider.  There is so much good free content available that Prime might even be worth it without the shipping benefit if you consume enough of the content.  I think it would be a great idea to make a separate Prime (Fire TV Prime?) where you don't get the shipping benefits but maybe it cost half as much per year.Overall, for $99 this is a great piece of technology.  If (once?) it gets HBO Go, it will be perfect for my needs.***UPDATE***I own a Galaxy S4 and just happened to check something on YouTube while my Fire TV was on.  This was simply because the search function for YouTube on the Fire TV isn't very good vs a phone interface.  To my surprise, I got a notification on my phone asking if I wanted to display the video on the Fire TV.  Incredible!  I didn't even know it could do this.  I did not set anything up at all, it simply asked me.  I'd hazard to guess this is because I have my bluetooth permanently on.  Now, using YouTube is even better because I just basically search on my phone and it pops up on the TV.", "verified": true, "helpfulness": "2/2", "author": "S. Stephenson"}]