[{"rating": 1.0, "review": "Make sure your TV has 3 HDMI ports. I tried to convert  a USB port to an HDMI, but had many problems.My other TV had an empty HDMI port so I did get it installed... BUT, very little content, no Android-Pad  open Chrome  websites casting to TV ability, and constant WIFI connection drops when streaming. It is only 15 Ft from the modem. The Nexus 10 works just fine even 30 Ft away.", "verified": true, "helpfulness": "0/1", "author": "ROBERT \"OILMAN\""}, {"rating": 5.0, "review": "This is an awesome gadget. Everyone should have one. Watching YouTube on the big screen is the main use here. Plus watching Netflix. Excellent price for what it is.", "verified": true, "helpfulness": "0/0", "author": "Dr. Winkler"}, {"rating": 2.0, "review": "Only streams YouTube an a few other online video sites.Wish it could stream video that have downloaded and saved.Perhaps in the future.", "verified": true, "helpfulness": "2/3", "author": "Mike In NY"}, {"rating": 1.0, "review": "The item is not really working as it expected. The quality of manufacture is also very bad. Don't Recommend to purchase this product.", "verified": true, "helpfulness": "2/3", "author": "Ruslan G"}, {"rating": 5.0, "review": "Was easy to setup and works great with my galaxy 4 phone and win 8 laptop.Instructions are weak but setup is surprisingly slick", "verified": true, "helpfulness": "0/0", "author": "Kathie Burman"}, {"rating": 5.0, "review": "They loved them. Takes a few minutes to install on the HDTV but once installed we were up and running and it worked well.", "verified": true, "helpfulness": "0/0", "author": "Nancy"}, {"rating": 3.0, "review": "It s not perfect but it is good. Most of the video can be read in google chrome(avi mkz...). It will lag some times but I suspect my network is not the best.  Biggest down side is that it does not work properly with slingbox if you make this happen i am buying two more!", "verified": true, "helpfulness": "0/0", "author": "Raphael Janssen"}, {"rating": 1.0, "review": "Chromecast is worthless on iOS. If ALL you care about is watching YouTube and Netflix on your tv then this would be ok. You CANNOT do ANYTHING else on any iOS device (iPhone iPad). No internet. Nothing from your iTunes library. Nothing but YouTube and Netflix. This product is sold as working with any device. That is not really true. It works with your home computer or android device, but is severely limited on iOS. Spend the xtra cash and get Apple TV.", "verified": true, "helpfulness": "1/2", "author": "no"}, {"rating": 5.0, "review": "Love it! Handy, easy to use, and the applications are all great.  Installed in spare guest bedroom and it works beautifully!", "verified": true, "helpfulness": "0/0", "author": "Michael Tirona"}, {"rating": 2.0, "review": "The quality of the video streaming is excellent and it does not lag behind at all. The problem I am having is that I cannot stream much at all from this device and think it is a waste of money! I thought I would be able to stream my videos and photos to it and not just videos from netflix and youtube! Not even amazon instant video?!? I am thinking about sending it back because I cannot do much with it! You can do much more with Apple TV so maybe I will head that route!", "verified": true, "helpfulness": "0/0", "author": "ScoDog"}]