[{"rating": 1.0, "review": "I've tried them all and this is by far the worse.Subjectively: The interface just feels clunky as heck and inconsistent as heck. Voice is nice but does not work in most of the apps.Objectively:No way to search on prime content only. Do a search and you get mixed free/paid results.Even prime content has a little \"buy me\" button under it.Only RF/bluetooth on the remote. You better not loose it because it's impossible to use with most 3rd party remotes.  (apple has the best 3rd party remote integration, roku is the most flexible with both RF and IR.).Some of the apps are just horrible, worst ever. I forget if it was hulu or netflix but at one point my text entry \"keyboard\" was a line of characters across the screen:  A B C D E F .... Z  I literally laughed when I saw that.Amazon shoves their stuff in your face and and everything else is 2nd tier, an app pushed wayyyyyy down the screen.Glitches Glitches Glitches.  It's just locked up several times requiring a complete reboot and we occasionally have problems with the audio on netflix.Overall this product feels very rushed. Over priced for a beta .1 product. If you love Amazon do yourself a favor and wait for version 1.1 or 2.0.", "verified": true, "helpfulness": "6/16", "author": "WildCat13"}, {"rating": 5.0, "review": "Very fast loading and browsing of both Amazon and Netflix. Voice search is perfect so far. I'm really hoping the abilities of this gets expanded with future updates. The gaming is beyond what I expected. I only have the remote but now think the controller would be much added fun. Future games look very promising too!  The ASAP ore buffering feature for Amazon is incredible when it works. It apparently takes time for the system to learn your preferences to better predict it though which is to be expected. I've had two generations of Roku players which I loved, but we have many movies purchased in Amazon so this is the best option for us. So far, this player is far better than any Roku I've used in the past.", "verified": true, "helpfulness": "2/4", "author": "chrissg"}, {"rating": 5.0, "review": "I've had this for a few weeks now & w0w this thing is wonderful. It's speed is like a regular cable connection. There is no real waiting. The quad core processor is a perfect speed CPU. everything about it I love for only 99 bucks u can't go wrong & I'll happily pay for a yearly subscription to prime for only 99 a year. It's so good I change my 80.00 monthly cable bill to (basic local channels HD) which cost me now only 1/2 of what I was paying.(40.00)", "verified": true, "helpfulness": "2/2", "author": "Patrick Ferguson \"TheUSMale2\""}, {"rating": 5.0, "review": "Wow, easy easy to install.  Have not used it yet but did do a test run and it is so simple and so much better than the other ones like it.  I highly recommend this item.", "verified": true, "helpfulness": "0/1", "author": "Jan Butler"}, {"rating": 5.0, "review": "I have Google TV, LG, Roku, this is the one does all. And it comes with voice search...Can't wait for the HBO shows", "verified": true, "helpfulness": "1/1", "author": "Shu Guice"}, {"rating": 5.0, "review": "We were so disappointed that we were never able to use our Roku w/Netflix because it didn't support Closed Captioning!  I was forever borrowing my son's Apple TV. However, this is so user friendly, merely speak into the remote and voila, there are your search results!  Trust me, if I can do it, anyone can do it. A nifty gift, easy to use, hundreds and thousands of movie selections and yes, it DOES support Closed Captioning!  We had zero issues connecting to our wifi and our Fire TV was put at the opposite side of the house - if you have difficulty, you can purchase a neat little plug in wifi booster to boost your signal.  For us, it is definitely a 5 star item!", "verified": true, "helpfulness": "3/3", "author": "Sl Judge \"gatormomz\""}, {"rating": 5.0, "review": "Thanks Amazon.  Not only did my Amazon Prime membership get this to me in less than the 2 day guarantee (took about 36 hrs from purchase to door) - the quality of the device/remote, easy setup, and all of the features make this a great product.Arrived already registered with my account.  One quick software update had me voice searching with ease.  Although the voice search only searches Amazon movies - it's pretty accurate.  Love the 'Trailer' feature (something Netflix doesn't offer) and the ability to fast forward / rewind is great.Waiting for my Fire TV controller to be delivered as it was on back order so I can dive in to some of the games that are offered.Thank you Amazon.", "verified": true, "helpfulness": "2/2", "author": "Buck2Fifty"}, {"rating": 2.0, "review": "I chose the fire-tv because I though it would be better then the roku-3 but they are dragging out getting what I like as far as apps. Like real news apps like fox. I didn't buy this to play games. It also would be nice if the voice search could check other media apps for the cheapest price. Why can't any media players ever have local channels? Yes I know you can switch back to the tv but why? Fire-tv steam as good as roku-3 but I won't give a good rating until they slow up on the game apps and put some meat and potato apps on fire-tv.Michael French", "verified": true, "helpfulness": "2/10", "author": "amigaman"}, {"rating": 3.0, "review": "While watching Royal/Pains the movie seemed to keep jumping like it was all the time trying to catch up. Not sure how else to describe it. Not sure if I will keep it at this point. There may be an update that may address this issue.", "verified": true, "helpfulness": "1/1", "author": "Charles R. Reneau"}, {"rating": 5.0, "review": "We  love the Amazon Fire TV.  Everything you watch on the kindle you can now watch on the large tv.  I refuse to pay for tv programming.  This makes it great, we watch what we want, when we want.  Do not regret purchasing the Amazon Fire TV.  Would recommend it to everyone.  Easy to install.  Just hook up to your tv and follow the directions.  Make sure to purchase the cable when ordering.  It does not come with one.  The voice search is great.  You say what you are looking for and there it is.  No repeating over and over.  It understands.", "verified": true, "helpfulness": "0/0", "author": "Janie Hendrix"}]