[{"rating": 5.0, "review": "I must've been living like a caveman without this bad boy cause once I hooked it up I was going 99 mph into the future. Netflix, Youtube, Facebook, Hell, it's got it all. You want to watch some PornHub on that nifty 55\" flat screen? I got you right here bro. Forget whatever sad set up you got going on right now and pick up one of these chromecasts. You won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 1.0, "review": "Hated it - could not stream from many devices. Should have stuck with my Apple TV but I was being cheap.", "verified": true, "helpfulness": "0/0", "author": "Guadalupe"}, {"rating": 5.0, "review": "i love my chromecast.  great for netflix and streaming from my laptop. i definitely recommend it, and have bought a few more as gifts.", "verified": true, "helpfulness": "0/0", "author": "H.P."}, {"rating": 3.0, "review": "Cutting a star for the number of Apps still available after it being out on the market this long.Cutting a half star for the device heating upAnother big complaint I have is that (I know this will sound strange to most people) the \"screen saver\" images that the device uses consume a lot of bandwidth. This is an unnecessary of my bandwidth and features like this will only add fuel to the fire with ISPs (Net Neutrality...anyone?)", "verified": true, "helpfulness": "0/0", "author": "WONREDSTICK GUY \"WONREDSTICK GUY\""}, {"rating": 5.0, "review": "Great purchase - chromecast makes your android phone tablet and pc with chrome browser all streaming devices to your tv.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 2.0, "review": "I had a least 3 days of being on the phone trying to install the device.  I finally found the problem myself.  That is too much trouble.  And I  couldn't find a phone number to call to try to get help,  Had to be a detective to just get that info.", "verified": true, "helpfulness": "1/2", "author": "Cheryl Kautzky \"cherkay\""}, {"rating": 5.0, "review": "Very usefull and fast! It's much better than smart tv software on yout TV, because it doesn't fail. You can use youtube, netflix and so many applications that you can enjoy a lot.", "verified": true, "helpfulness": "0/0", "author": "Andre"}, {"rating": 5.0, "review": "My fiancé and me love it! We can easily send youtube, hulu plus, netflix etc straight to it. It also helps to be able to just send the tab over if looking at a take out menu, or to buy something and scroll through products.Great thing to get for cheap, instead of paying $70 more dollars for ROKU or Apple TV! Great cheaper alternative.", "verified": true, "helpfulness": "0/0", "author": "Sujan K. Mathur \"The Sooj\""}, {"rating": 4.0, "review": "Bought it on a whim, didnt really need it. Really glad I did, just wish there were more apps for it. Hopefully it catches on soon.", "verified": true, "helpfulness": "0/0", "author": "Manly-Man review guy"}, {"rating": 4.0, "review": "Product is great, set up was easy and was online in no time. I have not used any other video streaming products.I have played video from you tube, crackle and the quality is good. There is no lag or video getting stuck even when I open up other applications and work. Used with iPhone, iPad and computer. For other apps that are not supported, e.g. movie played in browser have to leave the browser in full screen mode for streaming. I normally do not broadcast my wireless network SSID but  chromecast name itself would show up as a public open SSID when looking for network connections. Probably a firmware update fixed it, now it does not show up when I actually found time to look into its settings.I bought this for $35 and within couple of days it was available for $30 (and less) at other prominent e-commerce retailers. I called up amazon to price match but the customer service rep declined saying I could ship it back myself but they wont price match. Expected better service from Amazon from the reviews I read at other places. I should have looked around a little bit.", "verified": true, "helpfulness": "0/1", "author": "SS"}]