[{"rating": 5.0, "review": "Great to watch prime movies on.", "verified": true, "helpfulness": "0/0", "author": "mlane"}, {"rating": 5.0, "review": "Perfect interface for Hulu and Netflix. Voice interaction is very usable.", "verified": true, "helpfulness": "0/0", "author": "John Sachs \"kihei7\""}, {"rating": 4.0, "review": "Works good after a lot of tweaking and help from Amazon", "verified": true, "helpfulness": "0/0", "author": "RJ"}, {"rating": 4.0, "review": "Love it!  I use it with Plex and I do find Plex pauses a lot and it's a bit distracting, however I'm not sure if it's the Amazon Fire or Plex itself.  I plan on experimenting with it to make sure.", "verified": true, "helpfulness": "0/0", "author": "Heather Burvan"}, {"rating": 5.0, "review": "Love the Fire TV - I got one for my husband who hates anything new - but after getting this set up he is really very happy with it.  It was very easy to set up, and it works well and delivers almost anything he wants to watch.  We put the Fire TV in our upstairs  bedroom so my husband could have a second TV there.  We didn't want to have to run another cable upstairs, so this was perfect.  Our wireless is downstairs and we have never had an issue with the wireless.My husband likes it so much that I ended up getting another Fire TV for our daughter's room!~", "verified": true, "helpfulness": "0/0", "author": "S. Bain \"Shelley\""}, {"rating": 5.0, "review": "If you have Prime, you NEED this!", "verified": true, "helpfulness": "0/0", "author": "Mighty Wyte"}, {"rating": 5.0, "review": "Using this for my XBMC/Kodi machine for rooms that I like to hide the box. So far it breezes through everything I've ripped onto my NAS so long as I've run them through Handbrake.  Also fun little prime box for me to watch Nick shows from childhood :)", "verified": true, "helpfulness": "0/0", "author": "Josh R Valentine"}, {"rating": 5.0, "review": "We really don't use our Roku anymore.  Easy and straightforward to use.  Teams well with Amazon Prime.  The voice input is surprising accurate and easy.", "verified": true, "helpfulness": "0/0", "author": "MountainCowboy"}, {"rating": 5.0, "review": "Got this to use with my amazon prime account.  It works perfectly and I can even use xbmc (kodi) on it!  It's my favorite new toy!!", "verified": true, "helpfulness": "0/0", "author": "Christian Steinhardt"}, {"rating": 5.0, "review": "I love it.  Great Alternative to TV", "verified": true, "helpfulness": "0/0", "author": "Catlady \"Shoe Lover\""}]