[{"rating": 5.0, "review": "Good I recommend this", "verified": true, "helpfulness": "1/2", "author": "rogel rodriguez"}, {"rating": 5.0, "review": "Easy to use. My seven year old can get on and maneuver through his games without me. I also like the pin feature so he can't get anything without my permission. I also love the microphone feature on the remote. It had an easy set up and an easy to navigate home page.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is one of the best media tv so far... I have used RokuXD, 3 and Apple TV 3 in which of course you all know that you can't add apps you want.... In Amazon fire tv I added my fav. Apps such as Kodi, Google drive, Dropbox, YouTube, many different apps...some are available on amazon App Store if that doesn't work for you then add Apptoid store or you can add apps using apk. Files. Very easy setup and use, also I can play some games using my regular mouse. Amazon Fire TV is 9/10.... I wish they should come up with ear or head phone jack on fire tv remote like Roku 3....but I love Fire tv.", "verified": true, "helpfulness": "1/1", "author": "Poonam Z."}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "1/1", "author": "JW"}, {"rating": 5.0, "review": "We love our Amazon fire TV!!! It was super easy to set up and get going. I have to admit I was a little worried about my kids being disappointed for not getting an Xbox or Playstation but they are stoked with the games on the fire TV and I am impressed with the graphics and games. I have to hold them back from playing every moment of the day. Yet another winning electronic from Amazon!", "verified": true, "helpfulness": "1/1", "author": "LINDSEY HANKS"}, {"rating": 4.0, "review": "A little less user friendly that expected. I had to do most of the subscriptions online.  Could have been made a little easier for the end user.", "verified": true, "helpfulness": "1/1", "author": "ew"}, {"rating": 5.0, "review": "Easy to use, Family LOVES IT!!!!!!!!", "verified": true, "helpfulness": "1/1", "author": "james"}, {"rating": 3.0, "review": "I got this as a gift. If i could give this a zero i would. If you are not a prime member this is almost useless. I can get vimeo and some music videos that is all. I can not even get you tube;. really are you serious? My only hope is to get the Kodi or xbmc app to load on this thing; but if it will require my laptop and this devise at the same time what would be the point. First taxes now this bummer I am Not Pleased!.Update OK my wife signed me up for prime and i must admit the screen saver while listing to my previous purchased Chris Tomlin album; the pictures are wonderful and amazing pictures of what GOD has made and i was watching them on my 24 inch samsung monitor. It may be worth it just as a juke box if nothing else. They really are beautiful pictures and my music which i had previously purchased through Amazon was automatically loaded.", "verified": true, "helpfulness": "1/5", "author": "jbman"}, {"rating": 4.0, "review": "I had read in previous posts that prime tv and movies were not separated, but this was not an issue with the current software version that was on mine. Over all I was very satisfied with only 2 cons that were one - I wish that once u scrolled to the end of a list that it would start at the beginning again. Two - I wish that there was a quick way to put the fire tv into sleep mode instead of waiting for it to sleep on its own.", "verified": true, "helpfulness": "1/1", "author": "superolson"}, {"rating": 5.0, "review": "AWESOME!!! Love it. Interacts with the tablet also.", "verified": true, "helpfulness": "1/1", "author": "Joshua Robison"}]