[{"rating": 4.0, "review": "so far i am really enjoying it  dont always know whats going on thohave a little trouble getting back and forth  losing my place a bitstill learning", "verified": true, "helpfulness": "0/0", "author": "bakerylady"}, {"rating": 5.0, "review": "It's great. Use it everyday.  The only drawback, is that you have to manually put it in standby.", "verified": true, "helpfulness": "0/0", "author": "Curtis"}, {"rating": 4.0, "review": "Like the variety. Easy to use and set up. We are having fun using it. Awesome when nothing else is worth watching on regular TV.", "verified": true, "helpfulness": "0/0", "author": "L. Douglas \"BKLVR\""}, {"rating": 5.0, "review": "The Best !", "verified": true, "helpfulness": "0/0", "author": "Mary F. Garman \"mf garman\""}, {"rating": 5.0, "review": "Love it. The hardest part was taking the TV down to plug in the cable. A great way to enjoy the subscriptions I enjoy with NetFlex and AmazonPrime. Would recommend to my friends and family.", "verified": true, "helpfulness": "0/0", "author": "GIJane"}, {"rating": 5.0, "review": "This is a simple easy to use device. It does require a reasonable WiFi to supply it with the data. We have used it with our mobile phone and WiFi available in the RV park. So far all is fine. If you use your mobile phone just use care to watch your data plan as TV uses a great deal of GB.", "verified": true, "helpfulness": "0/0", "author": "Seabee"}, {"rating": 5.0, "review": "A very good device. I was amazed to see everything that this little box covers. Movies, sports, history, and on and on. Plenty of games for all ages. I'm really impressed !!", "verified": false, "helpfulness": "0/0", "author": "Charles H Elder"}, {"rating": 5.0, "review": "I love the speech-to-text option on the remote.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So easy to set up and works great!", "verified": true, "helpfulness": "0/0", "author": "LH"}, {"rating": 5.0, "review": "We love this! I can watch tv all day now.....better than going to the movies!", "verified": true, "helpfulness": "0/0", "author": "Emily"}]