[{"rating": 5.0, "review": "Never thought i would be \"flinging\" videos from my tablet up to my tv. If anything else, this Chromecast is so much fun to play with. My most favorite part is being able to watch my Youtube subscriptions on any tv in my house.If you have Hulu Plus, that is a big bonus to the Chromecast also.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I previously used a HDMI cable to connect my laptop to my tv but it wasn't always reliable and the screen size was slightly off. I'd definitely recommend the Chromecast if you like to use Google Chrome. I expect that Google will correct most of my noted complaints as they continue to update the product.Pros:- Easy initial setup- Works pretty well with Netflix and tabcast works great- No cables (other than the powercord if if your tv doesn't have a powered HDMI outlet)Cons:- When I upgraded to Windows 8.1, I experienced connectivity issues. There wasn't much information available online for this issue but I eventually found that if I adjusted the wifi priority list in my settings, I was able to correct it.- Would like to see more integrated apps- Can take a little longer than expected to sync tabs/apps with Chromecast", "verified": true, "helpfulness": "1/1", "author": "Matt S."}, {"rating": 5.0, "review": "Super easy to setup and works perfectly.  With more and more apps getting Chromecast I can't see anyone not owning this.", "verified": true, "helpfulness": "0/0", "author": "Bhavesh Vitha"}, {"rating": 3.0, "review": "This was recomended to me a friend. After ordering it I don't see that it does anything that is an advantage to me.", "verified": true, "helpfulness": "0/1", "author": "Terry"}, {"rating": 5.0, "review": "Before I bought this device I had various laptops and tablets (Mac, PC, Android tablets, iPads...) some didn't have HDMI exit at all some had mini HDMI, some regular.... In order to be able to view from PC/Tablet on the TV,  each device had it's own cable and different configuration on TV HDMI input (some HDMI devices transmitted audio via HDMI cable, some required additional cable for sound) and of course each time you want to change something (even pause/resume)you need to get up, come to computer (which is wired to TV) and make the change.Once I bought Chromecast, i could dispose all those cables, all is wireless now! Simple click on the icon on laptop/tablet and the content is shown on the big screen, no more different cables and custom configuration per device. For the apps that support Chromecast directly (like Youtube) you don't even have to keep the laptop on while the the content is playing on TV. Great product, easy installation, and amazing price for the convenience it gives.No disadvantages, but only hope that more and more apps like software players will support it.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "After setup (using computer or another android device) it works really well. Just turn on Netflix and let it take the stream over. You don't even need to keep Netflix up for it to keep streaming. And for the price you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Samuel Machuga"}, {"rating": 5.0, "review": "I hope more and ore application are written to take advances of this device. The API is out for it so developers get to work.", "verified": true, "helpfulness": "0/0", "author": "John D Reasor"}, {"rating": 5.0, "review": "I simply love thing! When I heard about it I first thought it was too good to be true but for $35 I'll give it a try. I installed it my daughter's room and after a week I ordered got two more. Its a cool piece of tech that can only get better!", "verified": true, "helpfulness": "0/0", "author": "J. Davis"}, {"rating": 5.0, "review": "this device is incredible. No latency, clear pic and sound 95% of the time and most vids from my phone can easily stream to it. Set up is cake.", "verified": true, "helpfulness": "1/1", "author": "smuggler"}, {"rating": 1.0, "review": "I bought this hoping to stream the MP3 files and videos in my android tablet or phone to my receiver. Well, after buying the product, I found out you can't unless you have the music uploaded in Google Play Music, which I can't in my country. You also can't stream videos stored locally on your device.Netflix, Hulu, HBO Go, Pandora are all inaccessible from the Philippines. So its only use is to stream Youtube videos. I eventually sold this product.", "verified": true, "helpfulness": "1/3", "author": "Gavin C. Lim \"Gavin Lim\""}]