[{"rating": 5.0, "review": "this device is a must have to stream your favorite apps. Its only going to get better as more development opens up and other services jump on it.", "verified": true, "helpfulness": "0/0", "author": "Antoshka"}, {"rating": 5.0, "review": "It's really not worth overthinking this. I got it just to play Netflix on our bedroom TV which already has an older Apple TV attached (a model that doesn't support Netflix). I don't want new Apple TVs yet because the current hardware has been around a while and it's no big deal to wait and see what comes out in 2014. In the meantime, why not add this even if it is only for Netflix? It's cheap, it's simple, and it works. And when it gets kicked out of the bedroom it will be no big deal to leave it unused. Except it won't be because there's always someplace this can be used - a home office, for taking on trips, something. I'm glad I have it around.", "verified": false, "helpfulness": "1/1", "author": "AJ"}, {"rating": 5.0, "review": "Affordable, easy to set up and use. Great quality! For a someone who is not looking to spend 65-100 to stream internent on your TV this is amazing! I love it so much!", "verified": true, "helpfulness": "0/0", "author": "Amber Nicola"}, {"rating": 5.0, "review": "Very simple and easy to install, really no install,just plug it and the charger in and go. Works from IPad and IPhone every time from Netflicks and YouTube. Now if only the other apps would get with this simple device.Download the app first it would make it even faster to get going, all in all about 10 minutes total.", "verified": true, "helpfulness": "0/0", "author": "Jay Todd"}, {"rating": 4.0, "review": "This works great!  We use it on our bedroom TV where there's no input other than the built in DVD player.  (We didn't want to run cable into there, so we just used the TV for movies)Only issue I've had is that sometimes it'll buffer for a long time in the middle of a show, but I haven't figured out if that's a problem with the device I'm using to stream (my phone) or with the chromecast...", "verified": true, "helpfulness": "0/0", "author": "Ryan C. Wallace"}, {"rating": 3.0, "review": "It works as advertised . I wish it had digital audio out so I could use my sound system instead of the crummy speakers in my tv.For$40, you can get a blu Ray player with almost all the same service though you give up control by your phone.  But you get better sound. Trade-off", "verified": true, "helpfulness": "0/0", "author": "D. Corbin \"buy all music!\""}, {"rating": 5.0, "review": "This was a low cost item compared to its functionality. I walk on my trewadmill everyday. Now I can watch Youtube & NetFlix with having to buy a Roku at 2-3 times the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The delivery was a day late. It was not as easy to setup as I thought it would be. My only compliant is I can only view YouTube with it, which is a feature of my satellite service. So I really didn't need this.", "verified": true, "helpfulness": "1/1", "author": "Yolanda Mosby"}, {"rating": 5.0, "review": "We gave up the Vizio Co-Star for this bad boy as the connectivity was better.  I wish they had come out with this sooner, it would have saved us some money.The Co-Star works fine if you have a super strong wifi connection, but in the same location the Co-Star couldn't find a connection the Chromecast worked perfectly.  The only annoying thing is that you can't control your tv with your cell like you could with a Roku or Co-Star remote.  Still love it, works great.  I'm just hoping they get more tv apps for it.", "verified": true, "helpfulness": "0/0", "author": "Gail B. Long \"Shi-City\""}, {"rating": 5.0, "review": "My TV is kind of old. The only HDMI port is on its back. Therefore, the communication between the chromecast and my ipad is poor when I set it up. After the initial setup, this issue went away. I can easily control it using my ipad or other portable devices, and the video quality on my TV is great! I appreciate this inexpensive little great product from google.", "verified": true, "helpfulness": "0/0", "author": "T.JOHN"}]