[{"rating": 3.0, "review": "I thought this would be more versatile than what it is.  You can watch movies through your computer wirelessly but you have to do it through chrome.", "verified": true, "helpfulness": "0/1", "author": "Michael Turner"}, {"rating": 4.0, "review": "With some minor glitch sometimes, this little device is perfect for playing movie through youtube or Netflix. Cannot be wrong with this affordable price.", "verified": true, "helpfulness": "0/0", "author": "mark M"}, {"rating": 2.0, "review": "Pros:- Youtube streaming works pretty well with my iPad mini.  I can send Youtube videos from my device to TV very easily.  The picture quality is not great, but it's not bad either.Cons:- Don't count on being able to stream your computer's screen to your TV from Chrome.  The Chrome extension can be very buggy.  It barely functions on one of my computers and on the other one, it's totally unusable.  I looked online and lots of other buyers are having problems too.  Even when it works, there's a lot of lag even though my internet connection is fairly fast.- An Apple TV would've been a much better since I use Apple devices.  I thought this would be almost as good, but it's really not.", "verified": true, "helpfulness": "0/0", "author": "Brian Flaherty"}, {"rating": 5.0, "review": "Everything came perfect and right on time! I am very happy with it but it is a Christmas gift so won't know exactly how great it is until after the holidays!", "verified": true, "helpfulness": "0/0", "author": "kasey"}, {"rating": 3.0, "review": "It is a baby mini streamer in it's infancy that really has no apps yet but can stream chrome content but how can you go wrong for $30 bucks unless you already have a way to get the phone to communicate with the tv which I do and a \"smart\" tv which I do as well.  I'm keeping it because I know they're going to come out with updates.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "Total piece of crap! Wasted my time and money trying to get this thing to work on two (2) very late model Sony and Sharp HDTVs. Google support is non existent! Don't waste your money on this junk!!!", "verified": true, "helpfulness": "2/6", "author": "Melanie K. Lukesh"}, {"rating": 5.0, "review": "simply great, low price, work well but only with google product or app that were developped for it. Do not expect to have fluid video outside you tube...", "verified": true, "helpfulness": "0/0", "author": "Botul \"Botul\""}, {"rating": 4.0, "review": "This is a great product if you understand what its' purpose is. I mainly use it to stream Youtube videos from my phone or iPad. I also occasionally use it to play music. I must say, the streaming quality on it is fantastic. I have had no issues with it. It is incredibly detailed and smooth.", "verified": true, "helpfulness": "0/0", "author": "Neil"}, {"rating": 5.0, "review": "I bought this for $5 off the normal price on Amazon Prime.  Setup was super easy. Streamed Netflix, HBO Go, Youtube, and Play Movies, all without issue.This really is a cool little device and it is not very expensive. It was cheap enough so that if it did not work out, I would send it back. But it is definitely a keeper. What I like best is I can navigate and search for content on a phone or tablet without tying up the television screen. I think that is a big benefit.  That use case alone makes it more enjoyable to use than Roku.I read rumors that Plex will soon be supported by chrome cast. If that is true, that would be a major win for me. I have plenty of content on my Plex Media Server that I would like to stream to the rooms.Downside of the device? None really, at least not as far as I can tell.", "verified": true, "helpfulness": "1/1", "author": "T-Bone"}, {"rating": 4.0, "review": "I really like the concept behind this. It works perfectly with netflix, and you tube, but it's horrible with hulu. It's always stopping to load which makes trying to watch a show a headache.", "verified": true, "helpfulness": "0/1", "author": "Sandy"}]