[{"rating": 2.0, "review": "I bought this few month ago, at the beginning it was all happiness , well , not anymore; The buffering is to often now; When I'm watching Netflix it drops the broadcast continuously, I would not recommend it. I know Google can do better...", "verified": true, "helpfulness": "1/2", "author": "Maria Sanchez"}, {"rating": 4.0, "review": "I owned a Roku3 before I purchased this for a secondary television. It took me several tries to get it working correctly. I have a router extender, and it doesn't work well with one. I finally got it to work with my original router, but I think there will be delays in the projection because of the distance to my router. Anyway, the app works well. I am not sure if the Chromcast has as much content available. I haven't used it a lot, so I can't say for sure. I bought it because I am about to ditch cable and wanted another option for my televisions.", "verified": true, "helpfulness": "0/0", "author": "D. Harris \"prazdancr\""}, {"rating": 5.0, "review": "These types of things are all over the place as far as features, but it does what it's supposed to do.  That's a major plus in today's world!", "verified": true, "helpfulness": "0/0", "author": "Fat techy guy"}, {"rating": 5.0, "review": "This product is excellent for watching movies and manage them from the cell. Ideally it would work the same with all Internet sites. But at least it works great with compatible apps!I recommend it!", "verified": true, "helpfulness": "0/0", "author": "Constanza Figueroa"}, {"rating": 3.0, "review": "This is great if all you want it to do is watch netflix, hulu or youtube. Would have been an easy 5 star if it could stream media from a local source or even use Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "At first, I didn't get it. I have a Vizio smart TV that includes applications for Netflix, Amazon, Hulu and so forth. So at first experimentation, I didn't see what this brought to the table. However, I have since learned where Chromecast shines:1) get Localcast off the Play Store, and stream video and audio from your tablet or phone to your TV.2) take turns with the family, everyone pulling up Youtube videos... this works better with Chromecast, because everyone has their own controller (their phone) and you can get stuff queued up without starting playback until you are ready. Also, it switches automatically.3) if you use VLC Player on your PC, this will soon also stream to Chromecast, making it easy to play any file on your PC to your TV, without needing a media server.", "verified": true, "helpfulness": "0/0", "author": "vaughnsphotoart.com \"photographer\""}, {"rating": 4.0, "review": "I really like the product.  It's nice to be able to use my phone, tablet, or laptop as a remote for my TV.  If you pair the Chromecast with Netflix, you will be happy.Positives1.  HD streaming.2.  When idle, it has beautiful landscape photos that cycle.3.  You can use it for music or video streaming.Negatives1.  About once a week my devices stop being able to connect to it and I have to restart the device and program it from scratch.  This is irritating.2.  Not enough apps.  There is a pictionary-like game that is okay but they could really kill with some fun family-type board game apps.  You could play monopoly on it and never have to clean off the kitchen table.", "verified": true, "helpfulness": "0/0", "author": "Stephen Mink"}, {"rating": 5.0, "review": "Everything I expected! I didn’t know what to expect but I haven’t had any problems at all and the price was just right for what you get.", "verified": true, "helpfulness": "1/1", "author": "Shirin Emami"}, {"rating": 5.0, "review": "This is awesome! It does exactly what it's supposed to.  I would definitely purchase another if need be.  I don't have an Apple TV, nor do I have a wireless adapter for my blu-ray player, but this is a far better and more versatile option.", "verified": true, "helpfulness": "0/0", "author": "Charlie Calvin"}, {"rating": 3.0, "review": "Used it for a few weeks, then It's been sitting there without use. Maybe I was expecting something different.... oh well, it was only $35", "verified": true, "helpfulness": "0/0", "author": "J. Gonzalez"}]