[{"rating": 5.0, "review": "Amazing product - streamline and easy to use.  The interface is somewhat simple - you have to go layer upon layer to get to some items you want.  I have an Apple TV as well and I use the fire tv more often than the Apple TV - due to the prime membership, HBO go and HULU - it's a win win and a cable cutter!", "verified": true, "helpfulness": "0/0", "author": "Emmanuel A."}, {"rating": 5.0, "review": "easy to install and use.  streams with no buffering and has excellent interface with amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Wehrli"}, {"rating": 4.0, "review": "Can't link to HBO Go is. Comcast is my internet carrier otherwise, really enjoying itCraigO", "verified": true, "helpfulness": "0/0", "author": "W. Craig Ostrom"}, {"rating": 5.0, "review": "I had tried out all of the other services like Hulu, and Netflix, and by far Amazon Fire is the best.  Bundled with the Amazon Prime is incredible too. More movies, and I use the Prime music app all of the time.  Oh yea, and fast cheaper shipping of goods from Amazon.", "verified": true, "helpfulness": "0/0", "author": "Bryan Beam"}, {"rating": 4.0, "review": "it is fantastic", "verified": true, "helpfulness": "0/0", "author": "Cindy S Watson"}, {"rating": 5.0, "review": "i am happy with this item", "verified": true, "helpfulness": "0/0", "author": "ROBERTO HERALDEZ"}, {"rating": 5.0, "review": "Awesome product, love the conviencance.", "verified": true, "helpfulness": "0/0", "author": "Klein Nguyen"}, {"rating": 5.0, "review": "Great product, I'd highly recommend it. It's all that I use now.", "verified": true, "helpfulness": "0/0", "author": "James E. Welch"}, {"rating": 4.0, "review": "Seems to be very adequate.", "verified": true, "helpfulness": "0/0", "author": "Richard barber"}, {"rating": 5.0, "review": "I freakin love this thing!  I don't have or want cable.  I was just looking for some this that let me watch netflix and hulu on our tv, while freeing up the iPad.  I got this on sale, lucky me.  I was surprised by how much I loved the amazon music feature.  I was plenty happy with pandora.  No more.  This has no adds and tons of free music.  I love the prime playlists...they are so good, it feels like people created...not just an algorithm.  I was determined to drop Prime after the free trial, but honestly, they got me.  It is an incredible value for all it gives you with programming, shipping rates, ect. Very happy customer.", "verified": true, "helpfulness": "0/0", "author": "Kathryn Hack"}]