[{"rating": 1.0, "review": "I was highly disappointed at this product especially coming from a big company like google its serious a piece of junk. I have strong WiFi and yet I can't watch a movie or show without it skipping I don't have a problem with my other devices just this. I also disconnected everything on my TV because I thought there might be a frequency problem, but no its just Google came out with a non functional piece of equipment. Don't buy this product its trash!", "verified": true, "helpfulness": "0/0", "author": "S Z"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Infinity"}, {"rating": 5.0, "review": "Great product, fast delivery, A++++", "verified": true, "helpfulness": "0/0", "author": "german rodriguez \"QNDQ\""}, {"rating": 5.0, "review": "Enjoying can it do more than utube", "verified": true, "helpfulness": "0/1", "author": "Anointedrivers"}, {"rating": 5.0, "review": "Best.Love it.Where was my life before this product?!Seriously. It's great.My husband would never sit at the computer to watch a how-to video on YouTube.With this, I can slap it up on the big screen, let him work and pause when it needs it.Even my 5 year old knows how to use it. Very easy to use.A must have if you use Netflix, Prime, Hulu, Crackle etc. Streaming media is great.When we want to go to a friend's house and watch a movie-- we just take the Chromecast.No DVDs. No game console. Fits in your pocket.", "verified": true, "helpfulness": "0/0", "author": "Jamie"}, {"rating": 4.0, "review": "Will be nice to have a remote", "verified": true, "helpfulness": "0/0", "author": "Andres"}, {"rating": 1.0, "review": "Good idea. Worked ok one time...Now it only has sound projected from the tv and no picture.. Can't seem to fix the problem...", "verified": true, "helpfulness": "0/0", "author": "Ryan L. Rux"}, {"rating": 3.0, "review": "They need to allow iPhones to display home videos without the third party apps you need to buy and don't work.  Also the connection drops between the phone and chromcast, you always have to reboot the app in order to re sync thus stopping the videos mid play.", "verified": true, "helpfulness": "0/0", "author": "Manny"}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "David A. Cox"}, {"rating": 5.0, "review": "very good things Im Happy", "verified": true, "helpfulness": "0/0", "author": "Jorge G."}]