[{"rating": 5.0, "review": "Amazon fire TV has worked great!", "verified": true, "helpfulness": "0/1", "author": "Joseph N. Amendolara"}, {"rating": 5.0, "review": "Love it so moch, I ordered a Fire Stick for the bedroom.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bought this during the Black Friday sale, it's a nice little piece of tech.  I'm waiting to see what Amazon does at it starts to push out more functionality to the Fire TV.What I do wish, is there was a little more Google Functionality with the FireTV as well, but oh well.", "verified": true, "helpfulness": "1/1", "author": "Chris M Hardy"}, {"rating": 5.0, "review": "Really cool. We have Apple TV downstairs and decided to try Amazon fire upstairs and like it just as much if not even more. Better price for sure.", "verified": true, "helpfulness": "0/0", "author": "D. Peters"}, {"rating": 2.0, "review": "This is a terrific streaming device that is fast, reliable and easy to use. My only knock on it is the voice search function appears to be limited to Amazon Prime services and not other apps such as Netflix.", "verified": true, "helpfulness": "1/3", "author": "E. Younan \"Eric Younan\""}, {"rating": 4.0, "review": "Pros: Powerful box for almost any app, allow to sideload without rootingCons: Remote control has no air mouse function, still small app store catalogue, no bluetooth sound -out", "verified": true, "helpfulness": "0/0", "author": "Oco"}, {"rating": 4.0, "review": "I wish that I could load ImDb and TCM apps. If I can, I don't know how. There are alot of movies that still have a charge added to watch. But the ease to use is great.", "verified": true, "helpfulness": "0/0", "author": "Leisa Smiley"}, {"rating": 5.0, "review": "Long short: best entertainment device I've ever purchased.  Read on for the nitty-gritty.We've been using Fire TV for a month now.  We love it! Our children enjoy the games and we enjoy the videos available from Amazon and other apps.  Installation was very easy.  I opted for a wired connection via Ethernet to my router, but the device was initially connected via wi-fi without any problem. I hit a little snag in connecting the HDMI cable to my TV. When I first tried to play a video, I got an error message that there was a problem with the HDMI connection.  My TV has two HDMI inputs--I plugged it into the other one and everything worked fine.  I've had no mechanical or other problems since.We've synched our PC, phone, and tablet devices to the Fire TV. As many users have mentioned, voice searching works best with Amazon products. For 3rd-party apps like YouTube, using the alpha search is clunky with the remote.  But by synching the device with the PC, I can search with keyboard and fling videos to the Fire TV.  Alternatively, you can play pranks on family and friends by finding videos on mobile devices and flinging them . Rick Roll your loved ones at random. They'll love it as much as ours did.I also purchased the game controller. My children have been grateful, as it's opened up a world of games that are not easily played with the remote. There's some great free games available--some cheesy ones too.I would like searching off-Amazon apps to be a little easier. The workaround is easy enough once you set it up, but it's not intuitive out-of-the-box and could really bother someone who's only a casual computer / internet user.", "verified": true, "helpfulness": "0/0", "author": "NerdyElf \"galadrielm\""}, {"rating": 5.0, "review": "For some background, this is the first device that I've owned like this. I've never had a roku or anything else.I've been pleasantly surprised with the Fire TV. I use it in my mancave so I can watch shows while working out. It's very fast and easy to navigate. It offers plenty of options for entertainment. The enclosure is very small and barely noticeable.The one thing I wish could be different is for the remote to allow voice searching outside of Amazon. Pecking around the on-screen keyboard for other services, like Netflix or Hulu, is a bother.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "I already have both Roku and Apple TV, but when Amazon put this unit on sale I had to try it. I am glad I did! It is much faster than Roku or Apple TV. Streaming is better, so far no freezes.The interface is good but is Amazon-centric for obvious reasons. It is a better interface than Apply TV, and the voice search function works well.Roku is still a better option for those who want access to more channels and the option to develop channels. My Apple TV make end up on ebay soon because of my Fire TV!", "verified": true, "helpfulness": "0/0", "author": "wolfgang62 \"IT Guru\""}]