[{"rating": 2.0, "review": "A little disappointed at the capability of the product with different devices.", "verified": true, "helpfulness": "0/0", "author": "Jerome Morgan"}, {"rating": 5.0, "review": "Great improvement, better than cable.  You can watch what you want, when you want.", "verified": true, "helpfulness": "0/0", "author": "Gerald L Hinkle Sr"}, {"rating": 3.0, "review": "Just ok because you can't cast from Google Chrome when using 2012 Google Nexus 7, fix this and you get 5 stars.", "verified": true, "helpfulness": "0/0", "author": "db"}, {"rating": 4.0, "review": "Very cool! Easy to set up. I was able to stream Netflix movies within minutes of connecting it.", "verified": true, "helpfulness": "0/0", "author": "David Knollin"}, {"rating": 5.0, "review": "We bought our Chromecast to reduce power consumption -- all our streaming media had previously been through our PlayStation, which eats electricity for breakfast. Aside from some VERY minor bugs that are usually taken care of immediately by software updates, we have had no problem with it. I'd recommend Chromecast to anyone looking for a simple-to-use streaming device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "hi"}, {"rating": 5.0, "review": "Connects to my home network and the TV recognized it correctly.The app works best with Chrome and UTube", "verified": true, "helpfulness": "0/0", "author": "snapshot"}, {"rating": 5.0, "review": "If your Wifi connection is good, this will work perfectly. So far I have used it for: Hulu, Netflix, HBO, CW online, Vevo, etc. Very happy!It is very simple to use and set up. Does exactly was it promises, no less no more (does not stream media in your computer, unless you get around it with other apps)", "verified": true, "helpfulness": "0/0", "author": "Andrea B."}, {"rating": 3.0, "review": "Limited App to work with.Too much lagging when streaming from Chrome.", "verified": true, "helpfulness": "0/0", "author": "Haji Syed Hassan"}, {"rating": 5.0, "review": "5 STARS ***** 5 STARS *****", "verified": true, "helpfulness": "0/0", "author": "Su Lin Yang"}]