[{"rating": 5.0, "review": "With the addition of a program called allcast from the play store it turned my chromecast into a great player. It even plays avi's now as well. That's what gave it my 5th star.", "verified": true, "helpfulness": "0/0", "author": "M. Trail \"venomx296\""}, {"rating": 5.0, "review": "If you don't have chromecast, get it! $35 and free tv. this is saving us a ton of money.  Seriously considering cancelling cable altogether", "verified": true, "helpfulness": "0/0", "author": "Nancy Mendes Ross"}, {"rating": 5.0, "review": "Awesome! Love it. Got rid of my cable provider and strictly stream :)", "verified": true, "helpfulness": "0/0", "author": "Vie303 \"MellowYellow\""}, {"rating": 5.0, "review": "I absolutely love this", "verified": true, "helpfulness": "0/0", "author": "G. Hansen"}, {"rating": 5.0, "review": "Love my Chromecast.  Bought two of them to stream Netflix.  Setup is quick and relatively painless.  Streams without interruptions, HD quality and 5.1 sound on Netflix.  HBO GO doesn't support 5.1 sound, which is a bummer.", "verified": true, "helpfulness": "0/0", "author": "amazonaton"}, {"rating": 5.0, "review": "Very good product", "verified": false, "helpfulness": "0/0", "author": "awesome"}, {"rating": 5.0, "review": "love this gadget!  it can be quirky but worth the money.", "verified": true, "helpfulness": "0/0", "author": "theresa"}, {"rating": 5.0, "review": "Couldn't live without this!", "verified": true, "helpfulness": "0/0", "author": "Reece Storey"}, {"rating": 5.0, "review": "Easy to install.  Loving Netflix now!", "verified": true, "helpfulness": "0/0", "author": "Hill"}, {"rating": 5.0, "review": "For the ultra low cost of $35, this is a no brainer to try out.  I was glad I did.  As an Apple TV owner, I had some difficulties when doing the screen mirroring as it (the Apple TV), for some reason, didn't want to work on my 5Ghz wireless channel.  The Chromecast not only worked on the 5Ghz channel, but was super easy to set up.  The instructions are very intuitive and I expect anyone with minimal computer skills to be able to do so without any headache.After months of owning this little thing, I've discovered that my only use for it is the tab casting feature.  With more expensive devices like Apple TV, Xbox, and Roku, you don't need a computer or mobile device to control it like you do with Chromecast.  But being able to cast one of my Chrome tabs to my large LCD screen has proven to be very useful when I'm streaming sports that are, otherwise, unavailable on broadcast television in my area.If you're looking to watch Netflix, YouTube, and Hulu... you may want to look at another product as they're far more convenient and don't require an additional device like a computer, tablet, or phone.  If you're looking to extend your online experience to your TV, Chromecast is the cheapest and most convenient solution you'll find.Love it!", "verified": true, "helpfulness": "0/0", "author": "mikekings12"}]