[{"rating": 3.0, "review": "Limited content in Australia , but overall a reasonable device for streaming to TV from mobile device.Easy to set up on PC too.", "verified": true, "helpfulness": "0/0", "author": "Kamlesh Billimoria"}, {"rating": 1.0, "review": "Didn't work at all.  Tried on three different TV's.  Cheap but no go!  It sounds like a great idea if they get it working.  A cheaper version of Apple TV?", "verified": true, "helpfulness": "0/0", "author": "Wendy L Cuthbert"}, {"rating": 4.0, "review": "This is a really great idea.  It streams Hulu, Netflix, Pandora, and Youtube for me.  Also Will mirror my Chrome Browser on my PC. Works well now and still has tons of room for growth with programmers creating compatible apps for it. Reason for 4/5 is because Google has closed open source for developers for now.Pro:- Looks Good- Easy to use and Install- Very PortableCons- Needed a computer to set up originally- Google has to approve apps before they work with it ( Hopefully this will change soon)", "verified": false, "helpfulness": "0/0", "author": "J. Murphy \"TechGuy88\""}, {"rating": 5.0, "review": "Simply put.  Amazing.  I purchased two of these for easy roving through the house.  One upstairs and one downstairs.  For me the use of youtube on this is great for everyone.  The kids can jump on and control their videos with ease.  As more and more jump on board and support this it can only get better.", "verified": true, "helpfulness": "0/0", "author": "Tigger23 \"tigger23\""}, {"rating": 4.0, "review": "I spend a whole lot of time watching YouTube videos and Netflix and this little gizmo lets me use my iPhone to stream videos onto my big screen TV. It's nice and small and unobtrusive. The only issue is that sometimes for reasons I'm not sure about the little light on the back starts flashing, and when you're trying to sleep even that small light blinking is more than enough to keep you awake. So I have to get up and unplug the power. A bit annoying. Otherwise it's a nice little gadget. It really ought to be able to stream more services, but what it does, it does well.", "verified": true, "helpfulness": "0/0", "author": "Rick Bryan"}, {"rating": 1.0, "review": "Advertising is misleading.  States you can cast anything from Iphone or Ipad and in reality can only stream from two apps.  YouTube and Netflix. Pretty useless until extension for video streaming is added for iOS", "verified": true, "helpfulness": "0/2", "author": "Anthony Trupiano"}, {"rating": 5.0, "review": "For the ability to easily stream music to my TV alone, I love my Chromecast.  It's easy to set up, easy to use, and really convenient.  I also think the interface is rather attractive when things are playing on the TV.  Before our Chromecast getting music to play on our TV was such a pain in the rear, but this makes it painless.  It's also super-portable if you want to take it to use somewhere else, which is a plus.", "verified": true, "helpfulness": "0/0", "author": "Sandra"}, {"rating": 4.0, "review": "You must use Chrome in order to \"Chrome Cast\"& it only works w/few selected apps such as YouTube. Is simple and super easy to use!", "verified": true, "helpfulness": "0/0", "author": "Gina Theresa Colo-Graham D.D"}, {"rating": 4.0, "review": "I wanted to be able to stream through Netflix and this does just that.  I have had a few instances where the device just was not synching with everything and it required unplugging the Chromecast from my TV and resetting my router.  When it is up and running, it is terrific.  I'd say I've had issues with seeing the Chromecast device on Netflix on my phone about 20% of its use.  Most of this was to watch the entire series of Breaking Bad.", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 3.0, "review": "I was surprised by how little the Chromecast does. Suddenly, I understand why it's so much less expensive than a Roku box. It can currently only stream from Netflix, Youtube, and Chrome. To be honest the Chrome stream doesn't seem to work well; I've only tried using it a few times, but every time I do, the image on my TV locks up, and stops following my laptop. The Netflix operation works fairly well, but there can be some issues transitioning between episodes, or getting back to controls, if you have to exit the app, and then return to it on your portable device. Youtube works fairly well, though now my phone (Samsung Galaxy Note 2) tries to send to the Chromecast, when I turn my phone for full screen mode, even when I'm not trying to send to the Chromecast. Google is promising that Chromecast will support a bunch media apps in the future, but I wonder how long it's going to take.", "verified": true, "helpfulness": "0/0", "author": "Archon \"Be Objective\""}]