[{"rating": 3.0, "review": "Not a lot of space to download games.", "verified": true, "helpfulness": "1/1", "author": "iznd"}, {"rating": 5.0, "review": "Amazon Fire TV far exceeded my expectations as a streaming device. My wife and I are so pleased with it's performance that it's beyond words and I also got Prime for $72.00 when it was on sale a few days ago. We recommend the Fire TV very highly to everyone, thank you, Rick.", "verified": true, "helpfulness": "1/1", "author": "Richard Matevish"}, {"rating": 5.0, "review": "The voice activation feature was a real plus!  My unit was purchased for the master bedroom, this feature is really nice.", "verified": true, "helpfulness": "0/0", "author": "Raymond E. Smith"}, {"rating": 5.0, "review": "Really good quality picture", "verified": true, "helpfulness": "0/0", "author": "John A. Leide"}, {"rating": 4.0, "review": "It was easy to set up, I was up and searching almost immediately. However, I had a couple of problems. Searching for Poirot was a problem. I tried \"Poaraw\" and it gave me \"porno\" as solution. I tried \"Poarawt\", and I got stuff starting with M only. I even tried \"Poyrawtt\" without working. I eventually gave up and searched for Agatha Christie, which I find immediately. I have done some other searches, and they worked fine.Picture and sound quality is good. I have had no problems streaming things from my view list. I've only had it for 3 days, but so far it's exactly what I expected.", "verified": true, "helpfulness": "1/1", "author": "Lene Jensen"}, {"rating": 4.0, "review": "pretty fun process...since we don't have a smart TV", "verified": true, "helpfulness": "0/0", "author": "Brian A Keller"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Christine A  DeRose"}, {"rating": 5.0, "review": "VERY PLEASED", "verified": true, "helpfulness": "0/0", "author": "mitzi F hughes"}, {"rating": 5.0, "review": "Very easy to install, only issue of all things was opening the remote control to put in the batteries! It requires a small screw driver head to open the compartment.  Picture is great, very easy navigation,  voice remote does reqire some. Repition to get the correct title.  Very happy with this product.", "verified": true, "helpfulness": "1/1", "author": "Maryellen"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Dustin smith"}]