[{"rating": 5.0, "review": "This is such a great inexpensive streaming tool to have. We bought a second one because we like it so much!", "verified": true, "helpfulness": "0/0", "author": "Kathryn Walenty"}, {"rating": 2.0, "review": "When I first purchased it, I was excited by the commercials that suggested that my iPad Chrome browser could send web pages to my TV. So that, for example I could read my email on my TV screen, or surf the web on my TV. It turns out, that that many of the features do not work with the iPad app, but, only with a laptop/desktop computer. Hopefully, this can be fixed with a future APP for the ipad/ipod. The small size is a plus, and at least it still works with Netflix, and a few other services....", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 4.0, "review": "Setup was a snap. However there was a significant jitter while casting from YouTube or Netflix. Could be because the HDMI port on my TV is hidden from view behind the screen. After I plugged in the HDMI extension provided, the signal quality improved, and there is no jitter now. However, the extension, with the Chromecast plugged in, causes sag, resulting in unseating it slightly at the HDMI port. I taped it up for support,but I expected a fully thought out solution from Google.", "verified": true, "helpfulness": "0/0", "author": "Vijay"}, {"rating": 1.0, "review": "Not near what I thought it was or could do... Very disappointed in Google on this one.  And since this is going on Amazon.....my shipping was late....", "verified": true, "helpfulness": "0/3", "author": "Greg Horinek"}, {"rating": 5.0, "review": "Just get it you don't need reviews and just buy the thing its 35$ what could make you regret your purchase", "verified": true, "helpfulness": "0/2", "author": "Zahid"}, {"rating": 4.0, "review": "So much fun to stream Netflix and YouTube to my TV! Sucks that I can't do videos that I download of my cousin's kids. Very easy setup!", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 4.0, "review": "The Chromecast is a very handy device. It was easy to setup and very ready to use. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "E. E. Perry \"EEPerry\""}, {"rating": 4.0, "review": "Easy to install.  Once get tv on right setting easy to watch from tablet.  The show continues on TV even if tablet would have timed out.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "There are two major problems I had with Chromecast. One was that it only works on Google tied in applications like YouTube. The other was my specific setup. I have a wifi booster in order to get it throughout my house. The Chromecast picked up the booster right away, but as my pc will drop the booster and pick up the main router I would lose the connection. This caused me to have to go back into cc setup and sinc them again, this would go around and around until I spent more time setting it up each time I used it than I did watching it. I've only used it once, the two other times I tried I just gave up. I tried to return it to BestBuy but the fifteen days were up as I had gotten it as a gift.So now when I want to watch anything on my pc I go back to using the hdmi cable which pics up whatever is on the pc and displays it without a half hour of frustrating setup due to the signal dropping.", "verified": false, "helpfulness": "0/1", "author": "Jeff S"}, {"rating": 4.0, "review": "Works great but I do not like that it doesn't place through the surroundsoundBut it is great with YouTube and Netflix streaming from my iPad", "verified": true, "helpfulness": "0/0", "author": "Ezrider5 \"MARTY\""}]