[{"rating": 4.0, "review": "Number 1, this is a great device, especially for the price. The only reason I didn't give it 5 stars is because it's no apply TV, meaning the streaming abilities are limited. I'm not sure if this is because I have apple devices or if the streaming is just limited. But overall, it works great, and enables my ability to watch Netflix, Hulu plus, and YouTube videos from my phone anytime I want.", "verified": true, "helpfulness": "0/0", "author": "Regina"}, {"rating": 5.0, "review": "My wife and I  both have one.  Needs to add local file play from Windows Media Center...great device.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Jerry Mabe"}, {"rating": 5.0, "review": "If you're operating on a budget and would like to stream Netflix, HBO GO, and other apps to your TV then this is a sure bet. Make sure you have a strong wifi connection though, otherwise lag will interfere with the viewing experience", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "Provides big screen HD access to HBO GO, Netflix, youtube, Pandora, Songza, and others, through your wi-fi.  Google continues to add new content providers.  Simple and easy to use and the price is right.", "verified": true, "helpfulness": "0/0", "author": "William Bucholski \"Seeker\""}, {"rating": 5.0, "review": "the software/apps can be flaky every so often, but a quick restart of the app solves it....would be nice if you could cast from iphone browser, but works great from netflix/youtube app, as well as chrome on the laptop", "verified": true, "helpfulness": "0/1", "author": "asdf"}, {"rating": 5.0, "review": "I had early doubts on this product but after an hr or so ... this product is good enough for a bedroom or living room. I personally feel that Apple is easier to navigate with but for the price  I'm willing to sacrifice the ease of navigation.", "verified": true, "helpfulness": "0/0", "author": "NP"}, {"rating": 4.0, "review": "I gave this item 4 out of five stars because I love it it's great and just about perfect. The only downside is you must use Chromecast enabled apps. Wish every app was Chromecast enabled. But still usually there are ways around it to make almost anything work on your television.Not sure why these do not come standard in every television. It's a mush have! For every tv in the house!!!!!You cannot be its price. Thank you Google for picking up the tab on the hardware costs. It costs more to make this device then they are selling it for. So you use google, simple nice tradeoff, thank you Google, bravo,", "verified": true, "helpfulness": "0/0", "author": "Iv"}, {"rating": 4.0, "review": "Simple to install, simple to set up casts screen and audio from either computer to our TV.  Play internet streaming on the big screen or even Power Point presentations or old TV shows.  If you get it on your computer (and I am told your phone, or tablet or laptop) using Google Chrome, you can cast it to your TV.", "verified": true, "helpfulness": "0/0", "author": "REWFM \"REWFM\""}, {"rating": 1.0, "review": "I was excited to buy the chrome cast unfortunately it works about 25% of the time and after a while I just gave up.Its a great idea but undependable.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "He's enjoying it.  Relatively easy to use, and we're looking forward to the additional functionality that we're expecting Google to add.", "verified": true, "helpfulness": "0/0", "author": "J. K. Westgate"}]