[{"rating": 5.0, "review": "Best $35 I have spent in a long time.  I am not techy and I installed it and maintain it with ease.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it was a present but he used it all Christmas day.  Lived up to its expectations.probably get one for me", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Four of us wanted to share interesting videos on YouTube while hanging out in the family room.  We pulled out our various versions of iPhones and one person had a Nexus tablet (android).  Then we started casting videos up on the TV from our various devices.  It worked great!!!  What a nice way to share without crowding around a computer or tablet/phone.  Also works well from our windows desktop and iPad air.  So far we have used it mostly for Netflix and YouTube on our Samsung non-smart LCD TV.  We also have a Wii which has YouTube and Netflix on it, but the ability to cast from multiple devices and search with ease makes this product more useful in our household.", "verified": false, "helpfulness": "1/1", "author": "Anonymous \"Mondeep\""}, {"rating": 5.0, "review": "Amazing clarity. Great High-Def Picture! Taks veiwing pleasure to the next level and allows improved access to thousands of movie/television show titles. If you are TV buff this is for you!", "verified": true, "helpfulness": "0/0", "author": "CLIFF LANE"}, {"rating": 4.0, "review": "Chromecast is a economical way to upgrade a non-smart TV into a smart TV.  It basically turns your TV into an output device so the video quality is going to no better than what it would be on your computer or smart phone.Easy to setup if you have Windows 7 or later.  Otherwise, you will need to add the Google Cast extension to your Chrome browser for your pre-Windows 7 operating system.  This was not stated in the instructions and can frustrate people with older Windows operating systems during initial setup.  Also, the instructions were tiny and hard to read.", "verified": true, "helpfulness": "1/1", "author": "Doug Jean"}, {"rating": 5.0, "review": "Great device works very well never had a problem using it . Very easy to set up and definitely better than the apple TV that's more expensive", "verified": true, "helpfulness": "1/1", "author": "malik boothe"}, {"rating": 5.0, "review": "Chromecast is all I expected after reading about before purchasing it. I've used it every day since I purchased it.", "verified": false, "helpfulness": "0/0", "author": "Keith Dunn"}, {"rating": 4.0, "review": "Great. Need more app too. Slow respond when transfer from crome browser. But I like it. I hope they will update.", "verified": true, "helpfulness": "0/0", "author": "Ram K Shrestha"}, {"rating": 5.0, "review": "Definitely recommend it to you tube users who spend a lot of time watching videos on the internet all the time.", "verified": true, "helpfulness": "0/0", "author": "Anand Kumar"}, {"rating": 5.0, "review": "I simply love this thing.  I am NOT electronic savvy so it is a good thing this Chromecast was so simple to get running.  The only thing Amazon needs to do is get Amazon Prime updated so it will run with Chromecast as so many other streaming programs do.", "verified": true, "helpfulness": "0/0", "author": "Joy Faye Hurt"}]