[{"rating": 2.0, "review": "Has a glitch when trying to use with Chromebook. Verified when i talked to Google Support when it didn`t work. Really disappointed. Supposedly they are working on a fix. Shame on Google having two devices not compatible with each other.", "verified": true, "helpfulness": "0/0", "author": "Westlain"}, {"rating": 5.0, "review": "It was easy to install and I was watching streaming video on my TV in a few minutes. I use it almost every day.", "verified": true, "helpfulness": "0/0", "author": "Sal Carcia"}, {"rating": 1.0, "review": "I ORDERED THIS ITEM ON MARCH 1ST AND I NEVER RECEIVED IT. BOUGHT THE BOOK AND CABLES AND THAT WAS DELIVERED TO ME BUT NOT THE MOST IMPORTANT ONE IS STILL MISSING. IT IS HARD TO CONNECT WITH YOU AND I SURE LIKE TO BE ABLE TO  GET IN TOUCH WITH YOU ABOUT THIS MISSING GOOGLE CHROMECAST. I LIKE TO SEND THE CABLE AND THE BOOK BACK TO YOU.  ANYBODY ELSE WITH THIS PROBLEM? ADIK", "verified": true, "helpfulness": "0/4", "author": "ADIK DIJKSTRA"}, {"rating": 5.0, "review": "The chrome chrome cast cast work works it really does let you stream content I need 6 more words so just adding this sentence.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "great price point! its really fun to have availble when friends come over! makes it so easy to share videos...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It gets a 2 star, because it does work and it's cheap.  The big problem is that it barely does anything and what it does is of mediocre quality at best.Contrary to what you may hear,  this device has NO APPS.  All the apps must be installed in your smartphone or tablet (iOS or Android ... not sure WinPho is supported).  The few apps that are available (less than 20) require that the app be active during the cast or the video will pause when the device goes into standby mode (so far only the YouTube app doesn't have this problem). From what I can see,  it needs the active status just to keep track of the playback time.Casting anything from Chrome has a delay (video on Chrome is ahead from what Chromecast displays) ... but I guess that is acceptable.  What is not acceptable is that the delay also includes out of sync audio.  Sometimes is really bad (as in seconds out of sync) others you get about 500ms .... but no matter what you do (or what device you use to cast) you will always have an annoying out of sync audio.  Note:  Casting from Chrome will drain the hell out of anything.  It works like a video capture (of the screen) and is very power hungry.Also, the video casted from Chrome is cropped in all four sides.  It is cropped to the point that 16:9 HD video (that plays perfectly if played natively on the TV) will not show (or will cut in half) subtitles. Google claims that the problem is the TV cropping the HDMI signal ... but it is hard to believe when the same issue happens on EVERY TV and HD monitor in my house.", "verified": true, "helpfulness": "1/1", "author": "L. Vega"}, {"rating": 4.0, "review": "Can access local file in my network or dlna server. Other than that this product is excellent to watch YouTube and Netflix.", "verified": true, "helpfulness": "0/0", "author": "C. Antunez \"charlie\""}, {"rating": 1.0, "review": "I don't think it's worth the stress and frustration!  Going back to ROKU. Spent too many hours trying to get this thing to work.", "verified": true, "helpfulness": "0/1", "author": "chehalis"}, {"rating": 5.0, "review": "If you're a geek and do not have one of these yet, shame on you.  It is basically an internet adapter for your TV.  You can't beat the price.Go buy one.  Now.", "verified": true, "helpfulness": "0/0", "author": "Michal Rysanek \"Geek Prime\""}, {"rating": 5.0, "review": "I bought this as a small token of my appreciation for my technologically advanced boyfriend on a random day. Little did I know that I was going to end up being even more obsessed with it than him! Google Chromecast is what's up!", "verified": true, "helpfulness": "0/0", "author": "shelby steinberg"}]