[{"rating": 2.0, "review": "Only works with certain programs, not everything on the screen. Manage your expectations so you won't be upset with your purchase.", "verified": true, "helpfulness": "2/5", "author": "AtlantaGA"}, {"rating": 4.0, "review": "Sure there are a couple of bugs to work out still. Remember that this product is only a few months old and that new app functionality for Hulu+, Plex, etc have just recently been added and most Developers work quickly to fix major bugs.A few weeks ago, many new apps were added. SO DON'T LISTEN TO THE REVIEWS SAYING IT ONLY HAS YOUTUBE & NETFLIX. The list of supported apps is here: [...]With that in mind, I find it to work really well, particularly with Plex & Hulu. Very smooth as long as your internet connection is strong and of decent speed, as with any streaming device. Using it on my iPad & iPhone as well as Chrome browser is easy. Set up was easy. Casting is easy. Click the cast button and there it is. In addition, it's a really great tool for work. Presentations can be cast directly from Chrome. I just drag the .pdf into Chrome and cast. Fantastic.The small size makes this a MUCH better option for traveling vs my Roku or ATV. My NAS + Plex + Chromecast = LoveFor my needs & uses, with the addition of HBOGo, Plex & Hulu+,  I've been able to check off all the boxes and will likely sell my Roku now.", "verified": false, "helpfulness": "2/3", "author": "BRKLYN"}, {"rating": 3.0, "review": "While just about every major cable company has relented in allowing its subscribers to watch HBO GO on their Rokus, Comcast has held firm in its prohibition (they only allow HBO GO on Apple TV and Xbox 360).Because it's your tablet, phone or computer that's actually doing the streaming, there's no way for Comcast to prevent you from using a Chromecast to enjoy HBO GO on your TV. So suck it, Comcast!Generally speaking, Chromecast doesn't do anything that my Roku or Blu-ray player (which streams) can do. Picture quality is as good, but no better. If plugged into an A/V receiver it will stream surround sound audio. While a flood of new apps were recently added, it still doesn't support Amazon Prime or MLB.tv.And despite being pretty cheap, the Roku base model isn't much more expensive and offers far more content.Casting from Chrome browser tabs is pretty poor. Not only are most video formats not supported, but even for surfing the web there's a pretty big lag time between what you see on your computer screen and TV.I imagine that Google will eventually provide casting capability to all of its computer, smartphone and tablet apps, allowing its ecosystem to be available on your TV, but until then, you're better off with a Roku (unless you're a Comcast subscriber who wants HBO GO on your TV).", "verified": true, "helpfulness": "1/1", "author": "R.D. Monsoon"}, {"rating": 5.0, "review": "Finally some new apps out. Never have a problem with the device itself. I just get so frustrated with the netflix app.", "verified": true, "helpfulness": "0/2", "author": "thegreyspot"}, {"rating": 5.0, "review": "loved this. inexpensive, easy to install and turns your non wi-fi TV into streaming wi-fi. There seem to be a few competitors on the market but all cost more and if you use Google chrome as your browser, you have more optiosn.", "verified": true, "helpfulness": "0/2", "author": "Waymil."}, {"rating": 1.0, "review": "I own one of these and it has to constantly be reset in order to switch between apps. Spend the money and buy a smart tv. I'm going to!", "verified": true, "helpfulness": "3/8", "author": "dhetrick3"}, {"rating": 3.0, "review": "If you have a compatible smart phone or tablet computer, a WiFi network, and a TV or home theater system with an available HDMI port, this is an inexpensive and effective way to access a lot of content from the Web. With Chromecast, what you see on the TV is conveniently controlled by a smart phone or tablet. It could also be controlled by a  laptop computer, but in many cases that would be less convenient.The biggest disappointment for me is that the mouse cursor doesn't appear on the TV. Thus I cannot control the content displayed  on my TV using a wireless keyboard and mouse (or other input device) connected to my desktop PC in an adjacent room.The Chromecast is easy to set up. It's easy & convenient to use, assuming you have a smart phone or tablet.If you don't have a smart phone or tablet, you might want to consider a mini PC such as:Version Bluetooth Android Google Dongle ORSANOXY%C2%AE MK808 Android Rockchip Cortex A9", "verified": false, "helpfulness": "0/0", "author": "KIZZY Girl"}, {"rating": 3.0, "review": "Functions decently well. Has a few bugs occasionally and I really wish it was more versatile. Amazon prime would be a great addition. Roku is probably more functional, but for the price the Chromecast is okay.", "verified": true, "helpfulness": "0/0", "author": "Ryan Dotson"}, {"rating": 5.0, "review": "Nothing is faster than scrolling on through videos on your phone and casting it to the chromcast. Mirroring a chrome tab is awesome feature no need for a remote, love how small and portable this is for my travels. I use my WiFi hotspot on my phones 4g connection and its great.I take this to every hotel and plug it into the TV, I cast everything, YouTube, Slingplayer, hbogo, Netflix. This beats the hell out of bringing an apple TV or roku when I travel every week.", "verified": true, "helpfulness": "3/3", "author": "EDLEE321"}, {"rating": 1.0, "review": "I bought this a couple of months ago.  Just got around to installing it.  It is advertized as being able to run on the IPAD,  Well it will not install.  When I try to install the app it says I need IOS 6.  IOS 6 does not run on the ipad. I tried to upgrade to ios 6 and it tells me ios5.1 is the latest version for the ipad.  This appears to be false advertizing to me.be carefull.", "verified": true, "helpfulness": "1/11", "author": "stephen"}]