[{"rating": 5.0, "review": "We love our chromecast. Wish I could use it for everything.", "verified": true, "helpfulness": "0/0", "author": "Emily S."}, {"rating": 3.0, "review": "But it works half of the time I always have to reset the great product", "verified": true, "helpfulness": "0/0", "author": "shawn g."}, {"rating": 1.0, "review": "Not worth the money. Better products out there.", "verified": true, "helpfulness": "0/1", "author": "TEXAS ROCKS!"}, {"rating": 5.0, "review": "Simple but reliable. Can cast your phone to your TV. Simple to set up and use.", "verified": true, "helpfulness": "0/0", "author": "yasha"}, {"rating": 2.0, "review": "When it works, it's fine. 75% of the time, my iPad doesn't recognize it. If it does work, most of the time the shows you want to control are unresponsive to the app (Netflix, HBO GO, Showtime, etc). Due to buffering, most 30 minute shows take 40 minutes to watch. Most hour long shows take 1:15 hours.  It's only $35 which is why I gave it 2 stars but it is worth buying the more expensive options. No one wants to deal with this thing.", "verified": true, "helpfulness": "0/0", "author": "RP"}, {"rating": 1.0, "review": "I was so excited about this when it came out.  I went to Best Buy and purchased it thinking I would be able to do a lot more than I actually was able to do.  Brought it home, plugged it into the USB port, plugged it into the outlet (yes you have to plug it in because your TV USB can not power it), and were disappointed from the start.  Pretty much all we were able to use it for was streaming netfilx.  And this was ONLY if we had an app on our phones/tablets/ipods.  Immediately we moved it into the kids room, but realized If the ipod battery ran out, they just couldn't use it and the apps you could use it with was ridiculously minute.  We were under the assumption (yes never assume...) that we would be able to use it to show others video or pictures that were on our phones.  Silly.... why would they make it that convenient!  Commercials make it look so wonderful and then you get the product home and the disappointment begins.  In the end we even took it out of the kids room, simply because we were able to use the xbox for a whole lot more than chromecast could do.  Now it sits in a box, gathering dust.  We will try the Fire TV Stick next and see how that goes.", "verified": false, "helpfulness": "0/1", "author": "Krys A."}, {"rating": 2.0, "review": "Disappointed! The unit had connectivity issues although it was five feet away from the router. It went back to Amazon.", "verified": true, "helpfulness": "0/1", "author": "Harry"}, {"rating": 1.0, "review": "buffer on wifi connections.", "verified": true, "helpfulness": "0/2", "author": "Venkat"}, {"rating": 4.0, "review": "Daughter loves this. Uses daily. Read up on the Chromecast. If you have a \"nonsmart\" TV this is perfect. Netflix for $35. Perfect solution.", "verified": true, "helpfulness": "0/0", "author": "IrishMan"}, {"rating": 4.0, "review": "The product works very well.", "verified": true, "helpfulness": "0/0", "author": "Marimelda Llacuna"}]