[{"rating": 3.0, "review": "I have everything. Roku. Amazon fire. Xbox. DVD player. And I can tell you that the chromecast is great for those who have compatible systems. Amazon Prime does not work with it. The one problem I have is connectivity. It's just a pain sometimes to connect. I prefer the roku. Not the new roku chromecast wannabe. But the old fashion roku box and remote. It works the best.", "verified": true, "helpfulness": "1/1", "author": "J Hardt"}, {"rating": 5.0, "review": "This is the buy of the year. I only wish they would find a way to get the power from the HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Poindexter Book Reviews"}, {"rating": 2.0, "review": "There's is like a 2 sec delay between what i see on pc/phone and TV!!", "verified": true, "helpfulness": "0/0", "author": "Rashad"}, {"rating": 1.0, "review": "CHOPPY CHOPPY CHOPPY.  Got it based on a recommendation from a friend and viewing it myself. Totally worthless and returning it tomorrow.  The graphics are great, but unless you are streaming from a router that is extremely close and/or has little to no interference, aka other HDMI input surrounding it, it is utterly worthless. I will be returning this to best buy tomorrow.  Will await the next gen as all my device can be shown on my tv in some way, but just not as easily as Chromecast promised for quality of display...extremely disappointed.", "verified": false, "helpfulness": "0/0", "author": "Tim the Mick"}, {"rating": 1.0, "review": "Does not work as advertised.  If you try to stream to a HD TV from an IPad or IPhone there is not enough processing power to generate a continuous stream.  An HDMI link from a desktop or laptop works much better.", "verified": true, "helpfulness": "1/2", "author": "Thomas W. Doherty"}, {"rating": 3.0, "review": "its alright", "verified": true, "helpfulness": "0/1", "author": "Patrick Edouard"}, {"rating": 4.0, "review": "This works well for Netflix, but getting it to work with Amazon Prime was annoying--had to sacrifice quality and disable \"Silverlight\" in Chrome. I read that it's because Amazon came out with their own device for streaming, so they made it more difficult for Chromecast to stream Amazon Prime content. Luckily, I watch Netflix 90% of the time, but if you're getting this primarily for Amazon Prime, I'd personally just get the Amazon device--it's 3x the price but at least you don't have to deal with the hassle.As for this device, it's also EXTREMELY annoying that you have to load an episode, pause it, then click the \"Chromecast\" icon--then wait for it to load on Chromecast! Maybe I'm missing something and adding an extra step for myself, but I don't think so--there's no way to select Chromecast before you click on the episode, so you have to wait for it to start, then select it, which causes it to start again. Just a few seconds in total but you have to do it for every episode so it gets old. Another annoying this is that Netflix doesn't automatically go to the next episode, as it usually does. And it'd be great if Google would make a remote controller for this--otherwise, you have to open up your laptop (if it's closed) to use the controls. Again, not a huge deal, but a remote would be ideal.But aside from these relatively minor grievances, I'm happy with this thing. It's pretty cheap--a lot cheaper than the Push2TV or the Amazon Fire TV or whatever it's called. This is easy to set up--took just a minute or two--and is an inexpensive way to stream content onto your TV.Looking back, I might have splurged on the Amazon device or on one of the others, just because I find it slightly cumbersome to load each episode twice before viewing it, and because of the Netflix next episode thing (it makes binge-watching shows a lot more fun). But if you're looking for a low-cost option for streaming to your TV, this is a great option.UPDATE: I ordered the Amazon Fire TV instead and returned the Chromecast. It was just too annoying trying to watch anything from Amazon Prime, and the whole double-loading thing was driving me crazy. I didn't realize until just now that you can use your smartphone as a remote for the Chromecast, which is great. But I'd still prefer a real remote and even though the FireTV is three time more expensive, I think it'll be worth it for me personally.", "verified": true, "helpfulness": "0/0", "author": "JenBar"}, {"rating": 5.0, "review": "Purchased as a gift for my brother and he loves it, and with all of the features and functionality being developed for the chrome its an amazing $35 purchase.", "verified": true, "helpfulness": "0/0", "author": "Jason Hotch"}, {"rating": 3.0, "review": "Wish it worked with amazon prime :(", "verified": true, "helpfulness": "0/2", "author": "Daddyrosie"}, {"rating": 5.0, "review": "The Google Chromecast does all it is meant to do flawlessly. I bought this for a birthday gift for a friend who was thinking of purchasing a Roku so she could watch Netflix in her bedroom without having to watch it on a laptop. She and her husband have lamented to me numerous times how much they love this device. They use their smartphones to choose the movie and then send it over to the device to play on the tv. I have a Roku myself, but with the price difference between the two I would choose the Chromecast if I ever needed another streaming device. It makes no sense to pay 2-3 times more for the same functionality.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}]