[{"rating": 5.0, "review": "It does everything that it states that it will do. It better than a Roku because you don't need to setup any credit card information on file in order to use this. Great product! Great value!", "verified": true, "helpfulness": "0/0", "author": "blackgerman \"afrodeutsch\""}, {"rating": 3.0, "review": "Great concept, cheap price, never use it. Does nothing that a Netflix subscription and an iPad, Xbox, or smart tv can't do. Nice if you don't have any of those items.", "verified": true, "helpfulness": "0/0", "author": "S. Pietracatello \"SPieter\""}, {"rating": 5.0, "review": "This whole thing is slicker than snot on a glass doorknob. The way it connects is great and I'm lucky I have a usb jack on the back of my tv to power this as well. Once I put it on my wireless network it has been super easy to watch YouTube, Amazon prime, Netflix, we even watch episodes of tv shows from the network websites (although not Chromecast enabled it still works OK). I wish my basement tv had more hdmi inputs so I could get one down there as well...", "verified": true, "helpfulness": "0/0", "author": "scott696d"}, {"rating": 2.0, "review": "I have AT&T; U-Verse and the associated modem/router is not compatible with this device.  Therefore, it is useless to me.", "verified": true, "helpfulness": "0/0", "author": "John L. Sworm \"DiverJohn\""}, {"rating": 5.0, "review": "Great way to stream media over a projector or a tv. With the new media cast extensions you can cast local video files too. An chrome tabs", "verified": true, "helpfulness": "0/0", "author": "Sagar"}, {"rating": 5.0, "review": "Totally awesome. But wished we could steam directly from the dvd drive as it is blocked. Still a great product though", "verified": true, "helpfulness": "0/0", "author": "CTS"}, {"rating": 3.0, "review": "The Google Chrome gets it's movies from the Wifi router of your home.At first there's a 3 way connection established between the Chrome, your device (laptop (didn't work with me), cellphone, or tablet), and the router. After setting up the router, the Chrome will receive directions from your phone, tablet (or computer?), to go to a certain web address and retrieve a video to play back.With an app called 'Local Cast' on android, it is possible to play back local files on the Chrome.The con would be, that the phone will 'upload' your locally hosted video files to the router, which routs it to the chrome.That means for a 2Mbit movie, 4+Mbit of bandwidth will be used on your router.What's worse, the Chrome won't work without a router.You can't use your mobile cellular network to download or watch movies. You can't upload a webpage or movie straight from your phone to the Chrome; thus image or screen mirroring isn't really possible.The Chrome also needs a USB port to power itself, however with the right adapters it's pretty easy to just plug it in a stock cellphone charger.Another con is that the Chrome does not have channels installed on itself, but requires you to install channels on your external device (like Laptop, Android or apple phone or tablet). Meaning, Youtube is one of those apps, that allow you to stream the video on the Chrome.Without a laptop, tablet, or smartphone, it's impossible to actually use the Chrome.My biggest pet peeve of the product however, is that it has only 14 channels!Amazon Prime not included!But it is small, and portable, and lightweight, and pretty handy if you want to use any of the pre-installed channels.", "verified": true, "helpfulness": "0/0", "author": "H B"}, {"rating": 5.0, "review": "I find the chromecast a great addition to any television, even TV's that are already labeled as smart TV's.  I ahve one on my smartTV because of the added applications and casting capabilities that are not available on my smartTV.  I can cast XBMC with the help of a little tweaking and an application, Plex Media casting couldn't be better.  I'm super excited for additional applications to come now that Google has opened this up for further development.I take one of my 2 chromecasts with me when I go to friends house to be able to share photos, videos, youtube fun playlists for little parties and run plex movies (for those extra long playdates with family friends).  This little device has proved useful and fun.  Much more useful than I thought it would be.I already had a Roku 2, Apple TV 3 and Jailbroken Apple TV 2.  Each has their strengths and weaknesses.  I can cast a great deal of useful services from each of my android devices.Setup and casting couldn't be easier.I highly recommend making sure you have an available power spot in your powerstrip as I have found it to work better when you have the power connected through power strip as opposed directly to USB port on TV.I also got one as a white elephant style christmas gift.  It was the most sought after item, even though almost no one knew what it was really for.", "verified": true, "helpfulness": "0/0", "author": "Neila23"}, {"rating": 4.0, "review": "I have one for each TV I own. It's not meant to be a generic streaming device. It is specifically for the apps that support it, and it does a great job of that. I only wish the UI in Netflix and Hulu were better on iPhone, and would allow me have some control from the lock screen. Also it would be great if the Netflix app would continue to the next TV show automagicly.", "verified": true, "helpfulness": "0/0", "author": "G. Greer"}, {"rating": 1.0, "review": "Worthless. Does absolutely nothing. I plugged it in several different ways, even plugged the USB Thingy into a power strip.", "verified": true, "helpfulness": "1/1", "author": "NumNuts"}]