[{"rating": 5.0, "review": "Love it, love it, love it.  Now, if only Amazon Instant Video was available for Chromecast....", "verified": true, "helpfulness": "0/0", "author": "K. Levy"}, {"rating": 5.0, "review": "Im hooked!", "verified": true, "helpfulness": "0/0", "author": "J. Milligan \"Rhiannon rings...\""}, {"rating": 5.0, "review": "Absolutely great device, now I can get rid of quite some devices in the electronic department. This solves the problem of space and electrical outlets. Great product anyways.", "verified": false, "helpfulness": "0/0", "author": "Cyberbloke"}, {"rating": 4.0, "review": "I like it because it represents cheap wireless streaming on TV from netflix, but it gives a lot of trouble and you sometimes spend up to 10-20 mins getting it to work with netflix, this happens too often for me.", "verified": true, "helpfulness": "0/0", "author": "Eduardo C."}, {"rating": 5.0, "review": "This Chromecast device is easy to set up, streams HD video from a number of popular sources, and is cost effective compared to some competitors. Prospective buyers should probably review the available streaming sources for this device to make sure what they want to watch (particularly in HD) is streamable. Even then, since this device can accept \"casts\" from the Chrome browser on computing devices, basically anything playing in Chrome can be displayed on the TV, just perhaps not in HD.", "verified": true, "helpfulness": "0/0", "author": "fair review"}, {"rating": 3.0, "review": "For the price this is a quick and easy solution to basic streaming.  Unfortunately there are a few issues:Setup- Setup is not too hard for a tech savvy user, but I can see less tech-literate people having issues.  Connecting the device to HDMI and USB is odd, particularly if your TV does not have a easily visible USB port.  Once physically connected you need to connect a device to the Chromecast's wifi and set up up to connect to your own wifi, then swap your device back to your wifi.  I know plenty of people who are simply not that comfortable connecting to wifi networks, let alone doing all of this.Source of content - You MUST actually get the video content on a laptop or mobile device and then stream it to the Chromecast.  This means you always have to have a computer/tablet/phone running to use this thing.Control - No remote, control is done from the device you are pulling the content up on.  This is not the end of the world, but at times a remote would be nice.Overall this device does some unique things (stream your web browser to your TV) and its a great little toy for the price, but it just isn't very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Lisa & Adam"}, {"rating": 5.0, "review": "very cool", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "is a very great way to stream videos to any device and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Allen J."}, {"rating": 5.0, "review": "Very cool.  Finally got one after hearing about it and not quite digging in to understand what it did.  Throw all my HuluPlus shows on to my big screen with no problems.  Great idea, extremely well implemented.  Highly recommend you try it.  Believe it would be simple to get up and running even for very non-technical people.  Instructions were simple and very clear.", "verified": true, "helpfulness": "0/0", "author": "D. Morgan"}, {"rating": 5.0, "review": "I love connecting this to my TV, and watch tv series on netflix with just some taps on my phone, it's easier than connecting through HDMI from a computer.It's cool to watch youtube videos, netflix and any other video if you mirror through the chrome browser on your computer.You can play any movie you have on your computer. Just left-click on the movie, select the file \"open as default in\", and select chrome. The movie will open up in chrome browser and you can mirror that with the chromecast app for chrome.It literally takes 10 minutes tops to install the chromecast. I love to take it with me while I'm traveling.", "verified": true, "helpfulness": "1/1", "author": "Gioco"}]