[{"rating": 4.0, "review": "really good for $30, it is a new way to control your TV using smartphone and I think better than by remote control.It is not five star because there isn't chromecast app for windows phone", "verified": true, "helpfulness": "0/0", "author": "Fabio Rufino Martins Castro"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Edison Davenport"}, {"rating": 5.0, "review": "This device is AWESOME!!!  I used to have computers hooked up to every TV in my house in order to watch movies.  Then I would try and keep all my movies in sync between my computers.  This device solves that issue.  When you pair it with PLEX media server, it REALLY shines.  I have a Plex client on my Android phone and my PLEX media server on my main computer.  I can direct my media to play on ANY of my TV's over Chromecast right from my Android phone.  I can then stop, pause, fast forward, or rewind  right from my phone.  The media doesn't stream through my phone, rather my phone is just controlling the Chromecast streaming from my Plex Media server.", "verified": true, "helpfulness": "0/0", "author": "David M."}, {"rating": 5.0, "review": "Streaming well", "verified": true, "helpfulness": "0/0", "author": "Lucy Lane"}, {"rating": 5.0, "review": "Bought as a gift......already have one. Fantastic device transports anything from your computer to the T.V.", "verified": true, "helpfulness": "0/0", "author": "Patti R."}, {"rating": 1.0, "review": "poor performance, complicated to use", "verified": true, "helpfulness": "0/0", "author": "eanne"}, {"rating": 5.0, "review": "Very easy to setting up. I thougth its no work in guatemala,  but no. Work  fine, cast mirror  too", "verified": true, "helpfulness": "0/0", "author": "eddy gonzalez"}, {"rating": 5.0, "review": "Great Device.  I'm able to stream all my favorite apps such WatchESPN without any issues.", "verified": true, "helpfulness": "0/0", "author": "Garry Gaskins"}, {"rating": 5.0, "review": "Just what I want !!!", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Works great with YouTube. Once you select a video or play list with your device it no longer uses your device. It goes directly from your wifi to the chromecast. I have a pretty good wifi so I have never had it buffer. I recommend it to all my friends.", "verified": true, "helpfulness": "0/0", "author": "arthur c porter"}]