[{"rating": 4.0, "review": "I love the easy of set up, I am 57 and a Lady, I had no problem at all setting this up, voice command feature and the easy of functions is a added plus. However I am a little disappointed that I could not find some of the apps that are available through ROKU.  Other wise I would have given this  5 STARs.  Thanks", "verified": true, "helpfulness": "0/0", "author": "Lena B."}, {"rating": 5.0, "review": "I can no longer afford $177 per month that Comcast was charging for my cable. Now with Amazon Fire TV I only need to pay Comcast about $70 per month. Amazon Fire TV lets me finnaly see Netflicks at full speed and every App I have tried works very well.  I am very Happy with this service and will likly never go back to comcast for TV.", "verified": true, "helpfulness": "1/1", "author": "Hazen Hiser"}, {"rating": 4.0, "review": "There are many other comprehensive reviews out there extolling the greatness of this set top box. Therefore I won't go into detail about pros and cons or a comparison against other similar devices (except to say I also have 2 models of the Roku and a Matricom android box). Suffice it to say the fire TV is easy to set up and use and marginally better if you have Prime membership (their selection is still leagues behind Netflix's offerings). However, the ability to side load apps is a big plus and doesn't require that much technical knowledge. The one drawback I and many others have pointed out, is the limited space given the inability to use the USB port for additional external storage. Nonetheless, this is the box I would and have encouraged others to purchase.", "verified": true, "helpfulness": "0/0", "author": "J. C. Branche"}, {"rating": 5.0, "review": "Makes up for what's missing on my Apple TV. And yes, they play nice together. It's like having two employees that get along. One makes up for what the other lacks.", "verified": true, "helpfulness": "0/0", "author": "Mark A. Ellis \"Mark A. Ellis\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Rita Allen"}, {"rating": 4.0, "review": "Well, I starting out loving this; BUT without prime you loose a lot.  So, first and foremost, It is awesome for streaming (which is what its for, i know).  But what I mean is, my experience have been flawless.  No lag, long load time, delay's during streaming, etc.  Whatever I've chosen to do; apps, games, movies, have worked without issue.  Picture is as good as what is provided.  So if HD is provided then HD is what you get etc.  Honestly, It lost a star because once prime ran out, AND I discovered that my favorite other streaming provider could be accessed through my satelite box; it basically rendered the box useless.  Cause it felt like everything worth watching I would have to pay for it, no matter how old the show is.  I will probably start back using it to let my children play games, and maybe some apps, but I hope Amazon will add more included content.  But If not, they still have built quite the streaming device and I would recommend it if that's what you're looking for.  I'm just an Amazon Brat that thinks I should pay the least and get the most.  But that's Amazon's fault.  This is how they raised me.", "verified": true, "helpfulness": "0/0", "author": "Dexter Cannon"}, {"rating": 3.0, "review": "Really happy with most of the product. Not very pleased that most of the movies I would like to watch I have to pay for even though I'm an Amazon Prime member. It was advertised to have over 40,000 to watch Free if your a prime member.", "verified": true, "helpfulness": "0/1", "author": "Susan Dugger"}, {"rating": 5.0, "review": "This was the easiest electronic device I have ever installed. I have to use 2 remotes with my DirecTV. The most time I spent was on the phone with DirecTV to find out which remote to get me to the HMDI setting. After that it took perhaps 10. Minutes to finish the installation. I had Apple TV which I have not used since I got Amazon prime videos. I simply unpluged the HMDI cable from the Apple TV and plugged it into the Amazon TV and plugged the power cord into an outlet. NOTE: you must purchase an HMDI CORD TO PLUG INTO THE TV and the AMAZON TV. If you do not have a spare HMDI cable, purchase the one offered with the Amazon TV, so you are ready to install when you get the Amazon TV. After you go back to TV it will power off after awhile like the Apple TV. The remote is small and easy to learn how to navigate. I really love the voice feature. It even understands my Southern English!The navigation is very easy. And you can speak the show, movie, or actor you want to find and it finds everything that is offered to you in mere seconds. I just received it today, and we have watched the last 3 episodes of Downton Abby tonight. We purchased the entire seasonn, and after episode 4 or 5 we received the rest of the episodes. So far it works easily and is the best device of it's kind hands down.", "verified": true, "helpfulness": "0/0", "author": "Tiger08"}, {"rating": 5.0, "review": "This thing is awsome! Makes me almost want to give up cable.", "verified": true, "helpfulness": "0/0", "author": "strucke"}, {"rating": 2.0, "review": "Ranking is dropping..  No promised global search.  Stuttering Netflix.  Amazon, get with it-NOW!  I'm beginning to be sorry I bought this.", "verified": true, "helpfulness": "1/3", "author": "Stephen Charles Holme"}]