[{"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 5.0, "review": "like Chromecast a ton!!. Works really good and for the price is amazing with Netflix and youtube", "verified": true, "helpfulness": "0/0", "author": "Raymond D Jennings Jr"}, {"rating": 5.0, "review": "I can't say enough about this unit, I use it all the time.  I have owned it since it was released and have purchased them for Friends.  This is the best device for streaming.Easy to useUser friendlyLots of apps for it nowThis plus Plex and I can stream my whole movie collection from my Media Server", "verified": true, "helpfulness": "0/0", "author": "James."}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Paul Solorzano"}, {"rating": 5.0, "review": "cool product works good", "verified": true, "helpfulness": "0/0", "author": "cktech71"}, {"rating": 5.0, "review": "This is probably the best product I have EVER purchased (on amazon or otherwise) Very good investment for a low price.  I got rid of my cable!!  LOVE THIS THING!!", "verified": true, "helpfulness": "0/0", "author": "Shauntae L. Weir \"lovechild\""}, {"rating": 2.0, "review": "Needs more in the way of instructional material and/or suggestions.  Had everything installed from my tablet up to the final step and then, to my chagrin, could not establish final connection with router ... no adequate explanation.  I researched online and found that there were many others with similar problems and reached the conclusion that I might need a router signal extender, which I purchased for about 2.5 times the cost of the Chromecast.  I have not had time to install it yet, but why did suggestions only come from others with problems and not from Google?  I'm sure these people are smart(?) enough to know that there are problems out there.", "verified": true, "helpfulness": "0/0", "author": "Jack Stanton"}, {"rating": 2.0, "review": "Did not perform well.  Video was very choppy.  I wanted to use it with Dish Anywhere but was unable.  It seems the product only casts a web page to the TV set.  Casting of the entire screen is \"experimental.\"  Dish Anywhere uses an App that is not in a web page so it cannot be cast to the TV.  You must use cast the entire screen which did not include the sound.  The video was choppy and delayed so the sound coming out of the computer did not match the video on the screen.  I was using the product on a Mac.", "verified": true, "helpfulness": "0/0", "author": "E. Dietze"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "Rhonda Turner"}, {"rating": 5.0, "review": "This is a great product, especially for the price. I bought this at a mere 20 dollars during a cyber Monday deal and it has been the best $20 I have ever spent.My only real beef with it, is that apps that support chromecast are still in an inchoate development phase.Apps like crunchyroll, YouTube, hulu and Netflix support, however their implementation of the product could be more polished.Well, that's something that will eventually be fixed gradually over time and it's not really the manufacturer's fault so I won't take away any stars.", "verified": true, "helpfulness": "0/0", "author": "Franco Selem"}]