[{"rating": 1.0, "review": "Returned.", "verified": true, "helpfulness": "0/0", "author": "Barb"}, {"rating": 5.0, "review": "works great only beef i have with it is there are no audio out puts on box trying to hook up surround sound system yes an optical will work if surround system has imput on it my surround system is only pass through with hdmi cable for some reason i bought a box works well now its easy to use", "verified": true, "helpfulness": "0/0", "author": "nova73"}, {"rating": 5.0, "review": "I thought about getting a Roku 3, and after reading many articles and reviews, decided to go with the Amazon Fire TV.  This is one of the greatest decisions I've ever made.  Sometimes I have buyer's remorse.  For instance, one time I decided to buy a kidney on the black market, but it turned out to be a scam.  This purchase was practically the antithesis of that one, and I have much less regret!  If you buy one of these things, it'll change your life in all the right ways.", "verified": true, "helpfulness": "0/0", "author": "Eric Martin"}, {"rating": 5.0, "review": "It was better than I thought", "verified": true, "helpfulness": "0/0", "author": "Stewart Crawford"}, {"rating": 4.0, "review": "It's too early to give a 5 star rating but so far it's meeting my expectations", "verified": true, "helpfulness": "0/0", "author": "Cheryl"}, {"rating": 4.0, "review": "So Far so good.  I have had a Roku unit for years.  This seems a little more powerful, but I don't think it is that big a deal.", "verified": true, "helpfulness": "0/0", "author": "Bruce Murray On Travel \"Murray On Travel\""}, {"rating": 5.0, "review": "Very easy to install/play; Selection of programs/movies is great and voice search feature works as stated.", "verified": false, "helpfulness": "0/0", "author": "Ann J. Pitchford"}, {"rating": 5.0, "review": "Took a while figuring out the correct password...once registered, works great, great selection of movies and TV Series with PRIME, costs less than Netflix annually. HIGHLY RECOMMENDED !!!", "verified": true, "helpfulness": "0/0", "author": "John Koontz"}, {"rating": 5.0, "review": "I love it.  I had tou before and chromecast and it blows them both out of the water. I definitely reccomend buying one.", "verified": true, "helpfulness": "0/0", "author": "tanner"}, {"rating": 4.0, "review": "Amazom Fire TV was easy to setup. I was up and running in 5 minutes.  My only complaint is that if I am in an app I do not have the option to type in the name of the song I am looking for.  Voice recognition pulls up movies when I enter Laura Story's (singer) name.No problems otherwise.", "verified": true, "helpfulness": "0/0", "author": "Jean Reyes"}]