[{"rating": 5.0, "review": "It's great to see such a variety of videos on YouTube.  I like streaming our family videos and photos from the cloud.  Have used a wired HDMI connection from the computer to the TV but wireless is better.  Simple set-up.", "verified": true, "helpfulness": "0/0", "author": "Carol Orlandi"}, {"rating": 4.0, "review": "I've connected the Chromecast to my TV and It says it's connected but nothing shows up on my TV. Need help!", "verified": true, "helpfulness": "0/1", "author": "Brunie"}, {"rating": 5.0, "review": "Love this thing. Easy install and works like a charm.  You need good internet service (wifi) for it to function smoothly, but I would guess that's the same with any streamer.  They do need to upgrade it with more capability.  For example, I use Amazon streaming which isn't directly available on the dongle, however, since you can stream right from your laptop, tablet or phone, it is somewhat a mute point.Small and sexy.", "verified": true, "helpfulness": "0/0", "author": "R. Stamos"}, {"rating": 5.0, "review": "Chromecast makes NETFLIX an ease to watch, as it streams to my television. I like Chromecast better than a WiFi DVD player.", "verified": true, "helpfulness": "0/0", "author": "SirLaurent"}, {"rating": 5.0, "review": "Awesome must have product! I don't have smartTV, so thank you google for bringing \"SmartTv\" to my TV  for only for 35$.", "verified": true, "helpfulness": "0/0", "author": "MS"}, {"rating": 5.0, "review": "I did not know a few things that surprised me.  I am sure if I had read a little more I would not have been surprised.* The device plugs into an HDMI on the T.V. not your computer.* The device must be powered by a wall socket or USB on the T.V.  So it comes with a cord and plug in.* The device will allow any computer, phone, tablet etc in range to cast anything in a Chrome web browser to the web not just videos.Everyone that sees it ask the same thing...  \"How do you do that?\"Pictures scrolled through on the T.V.,  Facebook stalking for the room to enjoy, etc...G+ hangout (video chat) looks like a futuristic movie.", "verified": true, "helpfulness": "2/2", "author": "Zen \"Zen\""}, {"rating": 3.0, "review": "It's still a little buggy and not to many apps are available for it. Come on Google open this thing up for other developers!", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 5.0, "review": "Sigh.  I just love the Chromecast so much.  I basically use it every day and it makes not having cable - but still having a television - seem so much more bearable than a sad tv that never gets used sitting in my living room.  I wish that they would develop more integration of the casting so that more video playing services worked as well as their Netflix and YouTube integrations.", "verified": true, "helpfulness": "0/0", "author": "Jolene Esterline \"is the coolest.\""}, {"rating": 2.0, "review": "Shipping time was spectacular, over a couple of hours, delivered the next day.Chromecast works only with Chrome browser in PC only, not using Chrome on Ipad. I was expecting that I would see on TV what I selected to play on-screen. in other words if I wanted to view photos from my ipad or computer I should have been able to, but only chrome for PC or Mac would display any photos not from photo viewer. Major lacking functionality to view video from Ipad on the TV Screen. Forget to view movies in the TV from your Ipad. Major disappointment with Chromecast's cross platform functionality.  I will have to check with Android phone to see if it works or disappoints by forcing Chrome to be used.No instructions in package, only indicates user to go to their web page.", "verified": true, "helpfulness": "0/3", "author": "Eduardo"}, {"rating": 5.0, "review": "Use almost every day. Setup was a snap and now google play music and Netflix soothe me weary bones daily. Now all my TVs are smart.", "verified": true, "helpfulness": "1/1", "author": "nipdatip"}]