[{"rating": 5.0, "review": "It was a gift, I haven't heard anything negative about it, so I'll assume all's good.", "verified": true, "helpfulness": "0/0", "author": "lewb"}, {"rating": 4.0, "review": "I got it in a box with everything required: cables, adapters, etc, so figured what the heck, let’s see if the thing works with apple products. OMG it did. It worked on the iphone .", "verified": false, "helpfulness": "0/0", "author": "Claudia Yale"}, {"rating": 5.0, "review": "Terrific streaming device. Also, very portable", "verified": true, "helpfulness": "0/0", "author": "Murdock Cope \"Anonymous\""}, {"rating": 5.0, "review": "This is my second chromecast and I like it. My only complaint is they don't have more apps compatible with it", "verified": true, "helpfulness": "0/0", "author": "danny stephens"}, {"rating": 1.0, "review": "Sketchy looking for something more reliable", "verified": true, "helpfulness": "0/0", "author": "Mariap"}, {"rating": 5.0, "review": "Works very well.  I have had it 2 years.", "verified": true, "helpfulness": "0/0", "author": "Bonnie"}, {"rating": 5.0, "review": "This is my second one--works GREAT!! I can cast from my laptops or my desktop or cell phone--awesome. Max quality is 720P.", "verified": true, "helpfulness": "0/0", "author": "lbambam"}, {"rating": 2.0, "review": "This device worked great for 6 weeks, just long enough for Amazon's return date to expire. At first, I thought the glitch was the fault of Starz, but then it started to happen on Netflix and HBO Go as well. I couldn't get through an episode without it buffering every few minutes. Google apparently knows this isn't a good product, because they'd offer nothing but to replace it with the same thing. No refunds after 15 days and that's ONLY if you bought it on Google Play. Fortunately, Amazon is the greatest and they gave me a one time refund, though it had been two and a half months at this time. For $12 more, I ordered a Roku stick, which has more apps AND a remote AND it's own on screen interface. Skip this.", "verified": true, "helpfulness": "0/0", "author": "americayay"}, {"rating": 1.0, "review": "I was highly disappointed at this product especially coming from a big company like google its serious a piece of junk. I have strong WiFi and yet I can't watch a movie or show without it skipping I don't have a problem with my other devices just this. I also disconnected everything on my TV because I thought there might be a frequency problem, but no its just Google came out with a non functional piece of equipment. Don't buy this product its trash!", "verified": true, "helpfulness": "0/0", "author": "S Z"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Infinity"}]