[{"rating": 5.0, "review": "still exploring the site on both TV's so much is available .I have and will continue to tell my friends !", "verified": true, "helpfulness": "0/0", "author": "Le Benwa"}, {"rating": 5.0, "review": "This is so nice, now I can watch my Amazon Prime on TV!  Plus it was very, very easy to install.  I did it by myself.", "verified": true, "helpfulness": "0/0", "author": "Juanita Thomas"}, {"rating": 5.0, "review": "Lots of apps, and a quick easy to use interface. Easy to set parent controls.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Im in heaven with this machine, i love it... Its worthy every penny... So easy to work it and super fast.", "verified": true, "helpfulness": "0/0", "author": "Kelly Leal"}, {"rating": 1.0, "review": "Bought yesterday, returned today. I'm a libertarian/conservative. ONLY news programming available were liberal opinion sources. I have a Roku 3 in my living room. I now have a Roku in the bedroom as well.", "verified": true, "helpfulness": "2/14", "author": "Kelly Goldstein \"Kelly\""}, {"rating": 5.0, "review": "I love it I will be buying a second one for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Jeannine Ufkin"}, {"rating": 5.0, "review": "I love it, it will take you some time to get use to but if you stick with the fire tv you will love it. Now if I can just get my wife on the band wagon then I can and will cut my cable from comcast. They are blood sucker,  they keep going up on my bill it seem like every six months they are going up on my cable bill. If ylu are thinking about it try it, you will need a little time to watch tv this way but you will adjust with time.", "verified": true, "helpfulness": "0/0", "author": "George Austin"}, {"rating": 1.0, "review": "sucks", "verified": true, "helpfulness": "0/12", "author": "Monty Rich"}, {"rating": 5.0, "review": "Awesome, love it.  Easy set up, simple cool remote, cool graphics to access all your prime videos and music, uploaded all the pics from my phone... Pretty cool!", "verified": true, "helpfulness": "0/0", "author": "Deb Kemp"}, {"rating": 5.0, "review": "Best Kodi box and great for sling tv. I miss airplay but ill be selling my Apple TV", "verified": true, "helpfulness": "0/0", "author": "Tony Bryant"}]