[{"rating": 4.0, "review": "Great Product, Very fast and works much better than Roku, Chromecast, and other devices. I really like how fast it is able to navigate through all the apps, music, and photos.  I wish it had a few more apps including slingbox.  It seems to update much more often than other players as well.  Voice needs to work on Netflix, hopefully this will be added soon.", "verified": true, "helpfulness": "0/0", "author": "techshuffle \"Tech Guru\""}, {"rating": 2.0, "review": "Good box however it misses a lot of apps unlike the roku . I loved the interface which is friendly and the games that are free..My box in specific was not easy to install and had a sound problems for almost a week until I solved this issue accidentally.Overall if u plan to get one ..think carefully as roku is far more superior than this box . If u want a box that have games than this one is for you ..One last note ..the fire tv is evolved around the Amazon service so whenever u click a button u get a recommendation for a movie from Amazon instant ..I do not have a subscription there as I am already using Netflix , Hulu , and vudu so this is really ridiculous..Overall rating is 2 stars ...cannot give more than this ..", "verified": true, "helpfulness": "0/0", "author": "Alaa ElDin Nashed"}, {"rating": 5.0, "review": "Great Christmas present. Have used it a lot since we set it up. Easy to use. Lots to see. Great.", "verified": true, "helpfulness": "0/0", "author": "Gary Zenobia"}, {"rating": 5.0, "review": "Had roku was ok, looked at Apple TV was ok, Amazon Fire TV is amazing, fast and easy to use", "verified": true, "helpfulness": "0/0", "author": "Shawn Karfs"}, {"rating": 5.0, "review": "Awesome access with Prime. Uploading pics and music is easy. All of the apps are fantastic including the Vevo app which plays videos when it starts which is an easy way to entertain guests  during an event. Some of the screen saver apps are a little weak, but all in all this is an amazing tech toy.Streaming quality is amazing, clear and sounds great.Some of the apps could have the volume adjusted.", "verified": true, "helpfulness": "0/0", "author": "BCFair311"}, {"rating": 4.0, "review": "wish amazon prime was included with the amazon fire tv", "verified": true, "helpfulness": "0/0", "author": "Hallie Harris"}, {"rating": 5.0, "review": "Great product, the user interface is awesome. If your doubting getting it don't, much better then TV apps that come on the smart TV", "verified": true, "helpfulness": "0/0", "author": "Josh Gambrell"}, {"rating": 5.0, "review": "Excellent alternative to comcast or phios.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I had a little hard time trying to set it up through wi-fi so I just connected it directly to the TV and it works beautifully, especially the voice command.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "kenny w."}]