[{"rating": 1.0, "review": "Seems to work OK, however does not pick up WiFi signal! Both phones, tablets, and laptop will pick up that WiFi signal, so not very helpful......😬", "verified": true, "helpfulness": "0/1", "author": "Hm S."}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/2", "author": "Aek"}, {"rating": 3.0, "review": "Great on what few Chromecast-optimized sites there are (Netflix, YouTube, etc.), but close to useless everywhere else.  Tabcasting of non-optimized sites amounts to a glorified slideshow; even with a fairly tricked-out Ivy Bridge i5 pushing to the 5GHz band on a dual-N router and leaving the 2.4GHz channel to the Chromecast alone, the results stutter and drop frames to such a degree that the end product is basically unwatchable for any length of time.  If that system on a 30Mbps connection is insufficient to produce a watchable stream, what can?  Does tabcasting even work with a Haswell i7 on FiOS?  From what I've seen I sort of doubt it.  It does work extremely well on the optimized sites--the Netflix image and sound is at least as good as that produced on my PS3, without the fan noise and at a fraction of the power consumption--so it's fine for use on a secondary screen, or if you don't use Prime Instant Video or other random non-optimized sites.  I use both of these, however, and have to say I probably would've been better served just getting a WiDi unit.  Just something to consider if you're in a like situation, as to hardware and viewing preferences.", "verified": true, "helpfulness": "0/0", "author": "N. Bax \"lucky duck\""}, {"rating": 3.0, "review": "Works fine just limited", "verified": true, "helpfulness": "0/2", "author": "Barracuda722"}, {"rating": 5.0, "review": "Awesome product", "verified": false, "helpfulness": "0/1", "author": "Pete Hinkel"}, {"rating": 4.0, "review": "Worked perfectly with everything except Netflix which did not cast at all. This disappointing.", "verified": true, "helpfulness": "0/0", "author": "mohammed akhtar"}, {"rating": 1.0, "review": "I can't it to work and the instruction manual print was so small I couldn't even read it with a magnifying glass.  Online instructions were not good either.  It's just sitting there on the table.  It's not worth it to send it back.", "verified": true, "helpfulness": "0/1", "author": "Juniper5"}, {"rating": 5.0, "review": "Easy to setup! Recommended!The setup for desktop should remove the requirement for a wifi connection since casting is possible via LAN", "verified": true, "helpfulness": "0/0", "author": "YongJin"}, {"rating": 5.0, "review": "Perfect in every way, surprises me every day, hope to get more apps...", "verified": true, "helpfulness": "0/0", "author": "halfaro21"}, {"rating": 5.0, "review": "Quick, easy and awesome. I purchased two and then a third for my parents. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}]