[{"rating": 5.0, "review": "I really like having this thing. It is a lot of fun to put the computer screen on the big screen in my house.", "verified": true, "helpfulness": "0/0", "author": "mctigger1"}, {"rating": 1.0, "review": "I have a smart Samsung TV. I have hooked it up to an Apple TV and both the Apple TV and the smart part of the Samsung work very well. I am a gadget person. So I bought a Chromecast. It did not work, no matter what instructions I followed.", "verified": true, "helpfulness": "0/2", "author": "ebassiri"}, {"rating": 5.0, "review": "Love love love it! Even works with my Windows Vista which they claim is incompatible. Makes me wanna pay for Hulu+ again even though I barely used it before LOL", "verified": true, "helpfulness": "0/0", "author": "Dena"}, {"rating": 5.0, "review": "Great device  Didn't have a smart tv to get you tube and it worked greatttt. I would tell everyone that it does what it said it would", "verified": true, "helpfulness": "0/0", "author": "John Ottomano"}, {"rating": 5.0, "review": "Cancelled my cable a week after getting this.  Best value in electronics, save $$$$ with this.  Netflix, and Plex rock!", "verified": true, "helpfulness": "0/0", "author": "UCF KNIGHT"}, {"rating": 5.0, "review": "Chromecast makes it much more convenient to search for content on Netflix, Hulu, or YouTube, using my phone or tablet, then \"cast\" it to my TV.  Far easier than the tedious searching in those same services using the remote for my smart TV", "verified": true, "helpfulness": "0/0", "author": "ajcook"}, {"rating": 5.0, "review": "I bought this for ESPN 3 and I have been very impressed. As a sports fan in the south, the best game is not always broadcasted in my area, this has worked perfectly. I can now watch the game and not strain my eyes on my smartphone or laptop.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Well built and easy to use product. I use it to watch youtube and netflix and it works great.Hopefully google will add more casting options for apps like the gallery etc.If you are looking for a simple casting solution, this is what you need.", "verified": true, "helpfulness": "0/0", "author": "Sharif Rizal"}, {"rating": 5.0, "review": "It's easy to learn, easy to set up and easy to use. Netflics, YouTube, anything searched on Chrome shows up on the wide screen TV. Best $35 media purchase ever.", "verified": true, "helpfulness": "0/0", "author": "R. Rosoff"}, {"rating": 5.0, "review": "I use it alot but think that the uses for it have a tremendous potential in the World!!  GOOGLE POWER GOOGLE POWER GOOGLE POWER GOOGLE POWER GOOGLE POWER GOOGLE POWER", "verified": true, "helpfulness": "0/1", "author": "Rob Barganier"}]