[{"rating": 5.0, "review": "That's all right!!!", "verified": true, "helpfulness": "0/0", "author": "Arturo Ruiz"}, {"rating": 5.0, "review": "I use this all the time.Works with Chrome, YouTube and HBO Go.", "verified": true, "helpfulness": "0/0", "author": "J. Jennings \"JimJ\""}, {"rating": 4.0, "review": "It is good but I can only view videos from YouTube.", "verified": true, "helpfulness": "0/0", "author": "NctJohn"}, {"rating": 5.0, "review": "One of the best purchases I've made in my life. I love streaming media to my tv and chromecast is the affordable, in my opinion, best tool out there. I use it everyday. My roommates and I love it", "verified": false, "helpfulness": "0/0", "author": "Demetrius Greene"}, {"rating": 5.0, "review": "Wow... can control it with my iphone, ipad, or macbook. Amazing.", "verified": true, "helpfulness": "0/0", "author": "Paul Van"}, {"rating": 4.0, "review": "The device looks pretty well. The only limitation observed is it depend on the supported Apps. I was not able to mirror my android screen to TV at this moment. Hopefully, there is a way or support provided moving forward on this device.", "verified": true, "helpfulness": "0/0", "author": "Koh Kok Beng"}, {"rating": 3.0, "review": "Works great at home, however google didn't make this work for hotels that use a splash screen (which is all of them). So if you want to stream netflix to hotel tvs, look elsewhere.", "verified": false, "helpfulness": "0/0", "author": "Joshua knepper"}, {"rating": 1.0, "review": "Not easy to set up", "verified": true, "helpfulness": "0/1", "author": "Steve"}, {"rating": 5.0, "review": "Use it everyday. :)", "verified": false, "helpfulness": "0/0", "author": "adon phan"}, {"rating": 1.0, "review": "Worked for awhile. Had problems with Ipad, but suffered through it. HOWEVER, the 1st time you have a problem and have to reset it...you are screwed!!! Now I can't connect to android OR apple products. And forget going online...there's 15000 people on blogs that get the same error code, but not a single person that can help!!!! Customer support....forget about it.....spent at least 6 hours trying to make it work after a reboot....nothing. JUNK!The best part of trying to make this thing work is the chest pains!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "john watson"}]