[{"rating": 1.0, "review": "I got this as a gift in December 2013.  At least it was easy enough to set up and it does connect to my wifi network, but I have been unable to use it successfully after several attempts since then.  I mainly wanted to use it to cast video from my WIndows 7 laptop to my TV, so I downloaded the Chromecast extension for Chrome.  I don't have a tablet yet and I have no Android devices.  Frankly, that shouldn't matter.I don't know if it is the Chromecast device or the extension (which seems to be in a state of permanent Beta), but there is such a terrible lag, that any videos are not watchable.  Thinking it could be a wifi setting, I made a few tweaks as suggested by sensible-sounding people on a few tech forums, but nothing has worked.  For a while, video was even showing up with a pink wash over everything (this was because of the Chrome extension).  The pink is gone, but the lag is still there.  I even moved my router and modem to within 18 to 24 inches from the device and nothing changed.  This thing is a dud.People kept suggested it was my network.  Blame the user, right?  I seriously doubted that was the problem and I finally got a Roku.  Roku works like a dream.  That confirmed for me that it is the Chromecast device and its attendant non-functional Beta software that have been the problem.  Take my advice, spend more and get something better.", "verified": false, "helpfulness": "0/1", "author": "Kelley Wine"}, {"rating": 4.0, "review": "Works ok for a $29 device", "verified": true, "helpfulness": "0/0", "author": "MARK E CHRISP"}, {"rating": 2.0, "review": "I give this 2 stars not because of Amazon or the seller but more for the actual Chromcast service.Amazon was great. Prime shipping, received the device in a couple days, Its new, it worked on first plug in.As for Chromecast, I think they have a ways to go. Its a wonderful idea as long as you have an android device. I have a Nook HD+ tablet so i primarily used that to setup and run. The most outstanding issue i have is once i watch a movie say on Netflix, push the Chromecast button on my tablet, it shows up a few seconds later, then half way in the movie i need to pause. Some how the connection from the tablet to the Chromecast breaks. I no longer have any \"remote-type\" controls. I cant pause, FF, RW or stop. I have to click the chromecast button again on the tablet to reconnect, then the movie starts over from the beginning. I'm sure google will fix this in time but its very annoying and I've already stopped using it. I've switch back to Roku which has same ability for apps that match (Netflix, Hulu, Amazon Prime, Plex, etc..)In my opinion, its a \"fun to have\" device but if your not very tech savy or familiar with android OS, its probably not for you.", "verified": true, "helpfulness": "1/1", "author": "Tom T"}, {"rating": 3.0, "review": "I thought you could project your entire Windows screen on the TV. It only projects from a limited list of apps. Activating through the YouTube app clink causes the video to stop playing on your computer once it starts playing on your computer. Anyone else get this or is it specific to my Windows 8 Inspiron 15 Dell laptop or network?", "verified": true, "helpfulness": "0/0", "author": "Dharmesh Kharva"}, {"rating": 5.0, "review": "Makes streaming from your computer or phone a breeze. Sets up in ten min or less and is very intuitive in use. Love it.", "verified": true, "helpfulness": "0/0", "author": "Nicholas M. Sarnicki"}, {"rating": 5.0, "review": "The chromecast was very easy to set up and fairly simple to understand. It had all the necessary apps to cast on. Such as: YouTube, Netflix, Crunchyroll and many others that the cast supports, overall I'm a very happy customer.Cons: the chromecast rarely crashes but when it does, be patient as it relies on your network and sometime it'll take a minute or two to reset.Overall I highly recommend this a lot especially for those trying to steer away from all these expensive cable providersGday :)", "verified": true, "helpfulness": "0/0", "author": "Frankie"}, {"rating": 2.0, "review": "We're all such sheep, or maybe lemmings now, corporations expect us to bow to them.  This thing said;  \" One, two, three\" and that's it!\"  -- as soon as I read that I knew I wouldn't be watching any movies on my Vizio this Saturday night.  I'm an old 'puter nerd, I worked as a software tech for Compaq, when wi-fi was in it's infancy and just getting Windows to recognize things, before \"Plug and Play\" was difficult.  Things conflicted .At first  thought, so this is the seamless device connection of the 21st Century. Then nothing.Everything is connected and double checked, ON.  \"Wait while Windows troubleshoots Network connections.....\" isn't even funny anymore.I could spend time and copy the MAC addresses, IP addresses, ping some devices and generally shake up this little network until Chromecast is at one, with us or I could just send it back.  I'm not working for Google.The last window of the install has right at the end an 'optional' App extension download.  Trying to download the \"App Extension\" locked up Firefox like a stone, so that probably was the problem.  It's the marketers fault.  The engineers build things that work, then the marketers butcher everything with tricks, foibles, take this or else that doesn't work, etc.,  eating resources and causing all sorts of spaghetti-like redundancies in the code.  Screw em all, I\"m not playing anymore.", "verified": true, "helpfulness": "1/1", "author": "Refuso P. off"}, {"rating": 2.0, "review": "The Chromecast app in the Apple App Store requires iOS version 6, but I am using an older iPhone on iOS version 5.1.1, so I can't use it.", "verified": true, "helpfulness": "0/1", "author": "NewPrometheus"}, {"rating": 1.0, "review": "Does not work, waste of money.  Bought one while we were on vacation because we left our Roku at home but we wanted to watch netflix in the condo.  Chromecast found the network but for some reason would not complete the final setup, something about a guest account on the router?  Don't know, don't really care, that packaging lied, made it sound like setup was simple.  Also lied about not needing power, this requires a power outlet, the packaging said nothing about power, just plug into tv and access it over the network.  If you want something that's simple and works just get a roku.", "verified": false, "helpfulness": "3/7", "author": "Tom Jones \"anon\""}, {"rating": 1.0, "review": "better to get a roku.  why do i need to braodcast from my pad, or device - unless you are able to broadcast from every app which you cant, its better to have a streaming box with all included like the roku or amazon fire.  do not get this - what a waste and duplicate technology", "verified": true, "helpfulness": "1/4", "author": "Oujdat"}]