[{"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The remote is unresponsive with a poor range of operation when you can get it to work.  I found the ROKU format easier to use with a remote that works as remotes should.", "verified": true, "helpfulness": "0/1", "author": "jim hancock"}, {"rating": 5.0, "review": "love my fire tv", "verified": true, "helpfulness": "0/0", "author": "alain guignard"}, {"rating": 5.0, "review": "This is an excellent device if you want to use KODI (formerly XBMC). I live in Canada so I have not tried many of the other features as I don't know if they are available to Canadians but it is a quick, stable box if you want to use it for media streaming!", "verified": true, "helpfulness": "1/1", "author": "ChaJazz"}, {"rating": 5.0, "review": "I'm very pleased with the Amazon Fire TV. In the country we don't have the luxury of TV signals or cable companies, and not wanting to pay the high prices of satellite choices this has worked well on my non-smart TV.I'm pleased with the simple remote, and so much faster on search when the cursor is allowed to wrap to the next line instead of having to go back. All options are easily accessible.I'm not a techno wizard, and for me this was an easy set up and use!", "verified": true, "helpfulness": "1/1", "author": "Relias \"JAS's Stuff\""}, {"rating": 5.0, "review": "I own Amazon Firebox since Monday and I love it so much I actually canceled my cable TV. I'm movie fanatic and cable TV did not provide movies for me but Amazon Furebox wow this think have so many movies even new ones.  So many movies shows this little box is the best it costs 99 dollars but it pays back like 200 cable TV every month. So if you do not own one yet go buy one right now the money are well worth and cancel your monthly cable TV because you will find everything on it.", "verified": false, "helpfulness": "1/1", "author": "dd"}, {"rating": 5.0, "review": "this is the perfect for streaming.  I upgraded my Fire TV stick to Fire TV.  It cost a little more but I don't have the wifi issue any more.  Response is also much faster than Fire TV stick!", "verified": false, "helpfulness": "1/2", "author": "Diana Martinez"}, {"rating": 5.0, "review": "I love this great product happy that I purchased this :)", "verified": true, "helpfulness": "0/0", "author": "K. A. Portis"}, {"rating": 5.0, "review": "It's the best thing that I ever had better than having a brand new computer or something, I just love it", "verified": true, "helpfulness": "0/0", "author": "beni"}, {"rating": 2.0, "review": "The buffering is ridiculous. On the fire stick. Only on apps as hulu or Netflix. But makes watching anything is difficult.", "verified": false, "helpfulness": "0/2", "author": "Chris Wheeler"}]