[{"rating": 5.0, "review": "What can I say - Google Chromecast is great.  It has been the device that has caused me to watch a lot less TV and more of what I want to watch that is available out on the Internet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"SJO\""}, {"rating": 4.0, "review": "I love it.  Easy set up, no issues.  The only quirk is that it has to be continuously plugged in to an outlet.  I had read reviews before buying and some people said it charges from the TV and some said needs to be plugged into an outlet.  Not a big deal, was kinda hoping It would charge from the TV.", "verified": true, "helpfulness": "0/0", "author": "Corina M"}, {"rating": 5.0, "review": "These things are awesome.  Can't wait for more apps and services to be added. I have smart TVs, smart blue ray players, apple tv, pc'c and mac mini's hooked to my TVs, and other media device so I really didn't need these but they were cheap so I tried them and amazed with them.  I ordered some as gifts and they were well received.", "verified": true, "helpfulness": "1/1", "author": "TA"}, {"rating": 2.0, "review": "Youtube apps worked only for 2 minutes everytime, after that I have to stop and start the streaming again. Other websites streaming from the Laptop worked only if the laptop is very near to the TV otherwise it gets stuck. Had a very bad time with it and returned it.", "verified": true, "helpfulness": "0/0", "author": "shathyan"}, {"rating": 3.0, "review": "This was a gift to my 3 children-each has their own home, hence, I have noidea about it's use!  But, they were very happy to get it Christmas morning!", "verified": true, "helpfulness": "0/3", "author": "Joanne L Cowan"}, {"rating": 5.0, "review": "My viewing you tube videos has increased multifold since buying the Chromcast. very easy to setup. Absolute value for money. Google needs to be complemented for this product", "verified": true, "helpfulness": "0/0", "author": "Avanish P Dureha"}, {"rating": 4.0, "review": "I would give it a 5 but at the moment I have just begun playing with it .As far as I can see its  proprietary only to special apps .as for streaming your own video that you recorded I cannot figure out ..I will update as I go..", "verified": true, "helpfulness": "0/0", "author": "David E. Nichols"}, {"rating": 4.0, "review": "We're still learning our way around this device, but after some initial needed changes to our wireless router it works fine. The picture quality is very good. When I bought it I thought it simply transferred whatever was on the screen of the device (cell phone/tablet) onto the TV screen, but I'm pretty sure you actually have to download apps that will work with the device. Still, it's cheap and much easier than having to hook my tablet into the TV using a HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Rami Yoakum"}, {"rating": 5.0, "review": "Hour of fun for my Dad!  The gift is great for tech savy and non-tech savy people. Great way to share.", "verified": true, "helpfulness": "0/0", "author": "Elsbeth Just"}, {"rating": 2.0, "review": "Chromecast is all fine and dandy as the reviewers here outline. It has at least for me one fatal flaw: It only works on 2.4 GHZ networks and not on 5 GHZ. So if If you have fast wireless in your house like we do with a 50 Mbps service you must also run a 5 GHZ N network which we do. But Chromecast will not work with such a network so to use it I have to \"dumb down\" my network to 2.4 GHZ B standard. Not cool from a tech leader like Google.", "verified": true, "helpfulness": "0/0", "author": "Cheap-n-Easy"}]