[{"rating": 1.0, "review": "Waste of money.  It is not as easy as apple TV product is.  The Wifi grab speed is not also that good with this product.", "verified": true, "helpfulness": "0/2", "author": "N. Sambamoorthi \"Minjur to Marlboro\""}, {"rating": 5.0, "review": "awesome works just like it states, me and my family enjoy it very much. My kids love watching all their shows on my bed tv now lol.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Sala"}, {"rating": 5.0, "review": "This device has turned my non internet 60\" Samsung LED TV into a virtual unlimited resource for videos and movies and more! It connects to your phone via your wi-fi and bam... I am playing YouTube videos on the big screen and downloading movies off of GooglePlay. Many other apps as well. I love this. Best decision I have made in a long time. WELL worth 35 bucks! Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Steve 1997"}, {"rating": 5.0, "review": "this works great.  meets all of my streaming needs,  much cheaper than upgrading to smart tv. Very easy set up.", "verified": true, "helpfulness": "0/0", "author": "skyking90"}, {"rating": 1.0, "review": "Experienced sound issues when streaming from tablet to tv. Tried the device on another tv, same problem. Tech support was useless and unable to help. Ended up returning the item.", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 4.0, "review": "I bought the Chromecast so that I could stream Netflix to my bedroom tv without spending much on a device. I love that it is so small and is powered by the tv itself; this makes it great for a mounted tv. It does exactly what it says it will: streams video.Cons: you have to use a phone, tablet or laptop to control the device. There is a delay when you find a tv episode or movie to watch in an app to have it start on the Chromecast. The initial setup was a little complicated even for someone who has set up many similar devices.All in all, I would recommend Chromecast for casual use because it gives you streaming functionality at a very low price. However, if you're looking for a device for frequent use, I prefer something with its own remote so you can scroll through content on the streaming device itself rather than relying on your tablet or phone's app to start playing video.", "verified": false, "helpfulness": "0/0", "author": "M. Roberts \"mirobe10\""}, {"rating": 5.0, "review": "A good product if you're interested in using chromecast supported applications. High quality output to TV. Made a perfect gift.", "verified": true, "helpfulness": "0/0", "author": "Kaushini"}, {"rating": 5.0, "review": "It's easy to set up and easy to use. We love the convenience of having it in our bedroom. I stream from my ipad.", "verified": true, "helpfulness": "0/0", "author": "Penny \"Penny B.\""}, {"rating": 1.0, "review": "When it works it really is nice, but that's not as often as it doesn't work. Constant netflix issues. Google wants you to reboot everything you own to try to get it to work. In the end it's just chromecast only works when it wants to.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very happy with the image and sound but sometimes the image freezes while the packets catch up. Works best with sights that have direct support for the chromecast device.", "verified": true, "helpfulness": "0/0", "author": "Gordon Neal \"Teacherman\""}]