[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "VMonk"}, {"rating": 3.0, "review": "Amazon Fire TV has several pluses, but one big (and unexpected) minus.First to the pluses...  It is a lovely device. Apple-like in its feel. Even the packaging is beautiful.  All this shows great care.  Its coming pre-set for a purchasing Amazon Prime member is another plus. As are the clear instructions and simplicity of getting its basic functions up and running. Its voice commands -- to me its biggest selling point -- work okay (slower than expected) within their designed in limitation. But this leads me to the MAJOR disappointment...Reading the on'line blurbs I was left with the impression that the voice commands are universal. No, they are not. The do not help connect the device to chosen programs unless these programs are available in Amazon.My wife, for whom I bought this unit as a gift, is a Fan of the Miss Fisher Mystery series.  When she entered that voice command the system, after not too many seconds, identified the program with a list of the seasons. And each of them said that they were not currently available.  But they are. My wife watches them regularly -- on NetFlix. And yes, she can watch them on NetFlix via the Amazon Fire -- but only if she uses a slow and cumbersome search by entering the name letter by letter.  In other words, for much she watches the Fire is no quicker or more convenient than something like a Roku.  In fact, it is less convenient because the Fire's interface app for NetFlix is less user friendly than the Roku's.So as you can see I have very mixed feelings about the Amazon Fire TV system as it is presently configured.  Can/will Amazon correct this major flaw?  Only time will tell. But making this deficiency clearer is the online promotions for the Fire TV is IMO a must.", "verified": true, "helpfulness": "0/1", "author": "Duckman"}, {"rating": 2.0, "review": "I'm pretty amazed by the hardware power of the Fire TV, it is truly a beast.  But one major issue that I was hoping would not exist almost a year after it's debut, is poor audio quality.I have discovered with Netflix or Hulu that over time (like a couple days), or if you pause for a super long time, the audio quality will be terrible, in that the voices are very tinny with a strange high-pitch at the end when they talk.The only way to fix it is power down the Fire TV and restart it.I don't know if this is Netflix or Hulu or Amazon, but obviously there is some kind of memory leak regarding audio.  So I now 'reboot' the FireTV once a day automatically thru a timer outlet, or manually if the audio suddenly sounds bad.  I used to have to reboot my Roku daily, otherwise it would have playback issues and eventually crash.  I didn't think I'd have to reboot a FireTV from Amazon.So only two stars because obviously there is a major bug somewhere, and I can't believe it hasn't been fixed in 10 months.  I was almost going to return it and get a Roku3, but decided that the FireTV hardware is quite amazing, and I have faith Amazon will correct this issue SOON.", "verified": true, "helpfulness": "1/1", "author": "cara F"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Chayrl Borba"}, {"rating": 4.0, "review": "The device was easy to hook up.  We enjoy having more options to watch,  like television series,  and commercial free.  I haven't explored everything on fire TV, but like what it has offered so far.", "verified": true, "helpfulness": "0/0", "author": "Debra Dawson"}, {"rating": 2.0, "review": "Netflix does not work well. Having multiple problems with it loading and stating loaded. This occurs only with the use of this device. I have read this is an ongoing problem for many that have purchased this item. Very disappointed that Amazon does not try to remedy this before selling to public. Is this a standard for Amazon? I will contact Amazon to see what is the problem", "verified": true, "helpfulness": "0/1", "author": "Erin Khameneh"}, {"rating": 4.0, "review": "I am very happy - it is new so I am still exploring all the possibilities - I would suggest a little more instructions for the electronically challanged such as myself", "verified": true, "helpfulness": "0/0", "author": "theresa zucks"}, {"rating": 5.0, "review": "This is the one. I had s Roko but it did not have a digital audo output. This does and the chose of viewing is phonominal.", "verified": true, "helpfulness": "0/0", "author": "Larry W. Riddle"}, {"rating": 5.0, "review": "So easy to set up and use. The voice command is superb.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Instructions for the hook up we're not adequate.  I finally had to contact my carrier for help.", "verified": true, "helpfulness": "0/0", "author": "Mikel J. Shilling"}]