[{"rating": 3.0, "review": "Setup was not completely straightforward for me. Happily, Google answered its customer service line quickly, although I only batted .500 on getting a rep that was actually useful. (Tip: your wireless network can't be hidden.)As far as the device itself goes, streaming with one of the \"apps\" (Netflix, HBO, Youtube, Google Play) works pretty well, but the \"tab casting\" is so laggy as to be worthless. If you are interested in streaming things besides the supported apps, you will still need to keep your HDMI cable around.", "verified": false, "helpfulness": "0/1", "author": "coffe and oranges"}, {"rating": 5.0, "review": "Works well for the apps that are available on the chromecast, and for the price. Hope more apps will be added soon.", "verified": true, "helpfulness": "1/1", "author": "Joey"}, {"rating": 5.0, "review": "Simply it works as it is described, do not expected more features if they were not promised.I am using it with Youtube, Netflix, Pandora (from android phone and Nexus tablet) and Chrome browser ( from my laptop) and works flawlessly, except sometimes when my internet connection have some lows, but the device itself is excellent, compared with other LG box device. It is a steal at this price. I bought another Chromecast for my 2nd TV.I expect more third party apps with come sooner than later as happened with HBO and Hulu.The only thing I do not like is that Google is preventing the streaming of media files from your devices at your home network.", "verified": true, "helpfulness": "3/3", "author": "Ric"}, {"rating": 4.0, "review": "It's great for netflix for the most part.  Hard to beat the price if you want to stream Netflix from you iPad to TV. Wish it had more content sources, but this was clear in the reviews.  A little glitchy sometimes, but has never failed outright. Just sometime takes closing netflix app and restarting.", "verified": true, "helpfulness": "1/1", "author": "Edward Hillstrom"}, {"rating": 4.0, "review": "I bought this on line at another site that did site to store so I could get it the same day and my wife could get some things she wanted without paying shipping.  Have had it for two days now and have some random thoughts:1.  I started with the A/C adapter but went to just the USB so it would only power the chromecast when the TV was on...no overheated chromecast that way.  The USB cable is about 6 feet long.  There is also an extender cable included that you can put between the TV and chromecast that is supposed to improve wifi reception that is about 6 inches long.2.  With hulu+ or netflix you have to have the video going before you can cast it3.  With a google chrome tab you can cast anything that is in google but after I cast I can only use other tabs that were already open4.  You have to be within 20 feet of TV to cast5.  Casting hulu+ or netflix video from Kindle Fire or Motorola Xoom works fine as long as you have a good internet connection and you can then use the tablet for other things or turn it off6.  If you have a problem with lip synch or jerky video when casting a chrome tab, try changing the video quality by clicking on the cast icon while the video is playing.  Have no idea what internet speed is needed to run high quality video, but my speed is 54 Mbps.Overall am happy since we do not have cable, just set top antenna, and previously had to connect laptop to TV with an HDMI cable", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "\"No big deal, but your Wi-Fi is off...\"No, it's on. I have 4 wifi devices right now. Products that do not just plug in and work should not be shipped.", "verified": true, "helpfulness": "0/3", "author": "Ryan"}, {"rating": 2.0, "review": "Didn't work properly right out of the box. Great concept would have loved to use it for my intended purposes. Also, the Chromecast has a long way to go as far as content goes.", "verified": true, "helpfulness": "0/1", "author": "aaron williams"}, {"rating": 5.0, "review": "Easy to use, adds new life to my old LCD 40''TV and the price is amazing. For some reason Youtube looks better than in my PC and videos load faster", "verified": true, "helpfulness": "0/0", "author": "H Nev"}, {"rating": 5.0, "review": "If you are looking for a consistent experience when watching movies, then this device is what you need. Google has hit the bulls eyes...if you have more than one TV  and most likely the bands are different like i do you will never be able to have the same experience throughout your home, the reason is that all TVs have their own UI some are OK some are down right ugly. Top sets like apple TV or Roku are good in there own right but they only address part of what a true movie night experience can be. Chromecast however addresses 99% of what i consider as a great experience for watching movies...with the Chromecast you create your own, you have your choose of OS or you can use both if you have both platforms IOS or droid...by using your phone  or tablet you can now browse for what you want to watch and once you find just click on the Chromecast icon if the TV is off it will switch on the TV and go to the correct input and show what you chosen to cast, or say the TV is on cable channel ESPN it will switch to the correct input to cast your chosen flick... no more having to switch to the top set or use that ugly UI that the TVs come with. no more using the remote to type for searching a movie to watch... you now type on the device of your choice. Its completely different from airplay...as once you start casting your device is free for anything or anyone to use. there are more features or uses not mention...You will not be unhappy if you get this one.Some might complain about lack of supported apps....but the same complaints were heard of Appletv etc and many new devices in this space...once Google put their resources behind this product it will be hands down the best way for movie night...Once apps like NBA, NHL, Picasa. M-GO and the likes joins... I think it will be truly the best streaming device out there...That's my take, hope it helps anyone who trying to make a decision.Note Device at home.1.Top Sets= Appletv, Roku, WD, Google, PS3, Chromecast  (only using Chromecat now)2. TV= Sony 4K 65\", Sony 47\" Vizio 70\"  (absolutly hate UI)3. OS Platform=ipads and iphone, Sony tablet z, sony phone z, HTC One, S3  (Apple device seems to have the updated apps when compared between the two OS's)Will updated if my opinion changes for any reason.", "verified": true, "helpfulness": "0/0", "author": "ljackson"}, {"rating": 3.0, "review": "Here is the deal with this item.  It allows you to turn your phone, tablet, or computer into a \"nerve center\".  When I got this item, I thought it was going to be the same as roku or apple tv.  It will allow you to turn your phone, computer, tablet into a delivery system, but that is all.  It takes your content on those devices, and streams it.  When you look at the other two devices, it actually has apps that connect directly to the computer so that you don't need another app.  I figure that it does work as far as you only have your phone, your tablet, or other and you want to stream to the tv with it plugged in, but in all, it did not live up to the hype that I had heard from the commercials.", "verified": true, "helpfulness": "0/1", "author": "Malcolm"}]