[{"rating": 3.0, "review": "Easy fast setup but was not impressed with what it offered and the size of the unit .very over priced!", "verified": true, "helpfulness": "1/3", "author": "LESA VANDENHEUVEL"}, {"rating": 1.0, "review": "Although it is setup is quite simple the content leaves much to desire. Unless you subscribe to Amazon Prime, Netflix etc. Your options are almost none. You can get the smear type or access/options from Google's Chromecast at a much lesser price.", "verified": true, "helpfulness": "3/9", "author": "CC"}, {"rating": 1.0, "review": "I bought this from Best Buy.  Thank God that Best Buy has a 14 day no questions asked return policy.The product is innovative and easy to use.  I was completely disappointed however when I learned that I had to pay for most episodes and products.  I ended up returning it within a day.", "verified": false, "helpfulness": "3/8", "author": "Morrow \"dragonfly10\""}, {"rating": 4.0, "review": "Great product. Really love it. Love the voice command and how easy it is to navigate. Only 2 downsides: no hbo go and the voice command only works for amazon prime(no Netflix). From what I hear but of those will be available by the end of the year. If it had both of those things it would be 5 stars.", "verified": true, "helpfulness": "1/1", "author": "Anthony Zaino"}, {"rating": 3.0, "review": "Technologically, it is wonderful. easy to use. However, it did not meet my expectations due to the limited availability of things to watch without added expense.", "verified": true, "helpfulness": "0/1", "author": "neozenov"}, {"rating": 5.0, "review": "Love Love the Amazon fire Tv. So much to watch. Picture quality was amazing. Had company over the holiday and there was something for everyone. So much in such a little package. Who needs cable. Just have internet connection and you're in business. Love the sound on Pandora. Awesome!!!!!! OOPS I forgot to mention voice search. Just press mike button and say movie you want to watch or what actor. AWESOME.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Jones"}, {"rating": 3.0, "review": "Works great for streaming Amazon movies and TV shows when it is working. Haven't used it for games.  I am on my second Fire TV.  First one worked fine for about 2 months then developed some sort of internet connect problem in which case it displayed a status message \"Connected with problems\"?  Worked with Amazon tech rep to resolve problem but ended up returning the Fire TV for another one.  The second one worked fine for about a month then developed the same problem.  I powered it off for a couple weeks while traveling and it has been working okay for about a week since my return. I have had an Apple TV for over a year and never had any of these problems with it.", "verified": true, "helpfulness": "0/0", "author": "Andrea Davis"}, {"rating": 4.0, "review": "Love having Amazon Fire TV, just wish I had easier access to current shows, especially those that don't show up on Hulu+", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Biggest negative is the inability to use close captioned.  Many movies are the same as Netflix. Otherwise we are enjoying it.", "verified": true, "helpfulness": "1/1", "author": "Anna"}, {"rating": 5.0, "review": "Amazing little piece of equipment!  The setup was a snap and it's use has allowed me to catch up on programs teat I missed over the past 10 yrs.  Videos I watch on U-Tube are now viewed on a 61 \" screen vice my 13\" laptop..  Haven't used the games yet, but my grandsons will take care of that issue.", "verified": true, "helpfulness": "0/0", "author": "Larry W. Schofield"}]