[{"rating": 5.0, "review": "As on the picGood", "verified": true, "helpfulness": "0/0", "author": "Elvira"}, {"rating": 5.0, "review": "We have enjoyed using this so often in my house. It's so cool to sit in the living room and share videos on certain subjects from your phone and iPads on the bigger screen. My son loves it to, because then everyone can watch whatever cool YouTube video he found for us to watch on the big tv. It is so easy to use and we even travel with it so in a hotel room everyone can watch movies from our Netflix app.", "verified": true, "helpfulness": "0/0", "author": "HippieMoonMommy"}, {"rating": 5.0, "review": "Bought this as a Christmas gift for my grandma n myself. We love it the only con to this is you must have some kind of device to use it all the apps aren't on there for you to go threw sadly and not everything will work with the computer.", "verified": false, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 2.0, "review": "does not work properly, it freezes when play video from computer, the computer plays streaming video ok , but the chromecast doesn't.", "verified": true, "helpfulness": "0/0", "author": "fernando golotylec"}, {"rating": 2.0, "review": "does not work properly, it freezes when play video from computer, the computer plays streaming video ok , but the chromecast doesn't.", "verified": false, "helpfulness": "0/1", "author": "fernando golotylec"}, {"rating": 5.0, "review": "The Google Chromecast is one of the best electronic purchases that I have made in a long time.  I purchased this unit for use on my Xbox One.  It works without any issues.  I am able to plug it into the HDMI In port on the Xbox One and stream flawlessly from my computer.  It is also convenient because, it can run though a USB power source.  The Xbox One has two USB ports next to the HDMI ports.  I decided to drop cable and explore alternate modes of television.  This is a great buy for use on a standard television and comes with many apps such as Netflix (subscription required).  I attempted to use the Apple TV with the Xbox One and it did not work as anticipated.  The Apple TV id not stream seamlessly with video or sound.", "verified": true, "helpfulness": "0/0", "author": "Lou H. \"William Hofmeister\""}, {"rating": 5.0, "review": "Great Seller, Product Works Excellent And Fast Shipping.  Would Buy Again!!", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 3.0, "review": "chrome cast itself works as advertised but the power adapter quit after 1 use!", "verified": true, "helpfulness": "0/0", "author": "Hilltopper"}, {"rating": 5.0, "review": "I have the Amazon Fire TV stick and having tried the Chromecast, I can say Chromecast works more with my Xfinity account than the Fire TV Stick.I bought it for my mom who isn't technical savvy but it was easy enough to teach her how to cast from her tablet. (Primary Youtube, she loves youtube to watch her Spanish speaking songs and movies)", "verified": true, "helpfulness": "0/0", "author": "PurpleLover"}, {"rating": 1.0, "review": "Don't waste your money. For the first couple of months that I had this, I loved it. I actually loved it so much I put one on each tv in my house. The older they get and the more updates to the chromecast that are done, the more issues I have. I keep finding myself having to reset my units in order for them to work correctly. Connectivity issues, streaming issues, freezing issues, you name it. At the end of the day do they work? Yes, but after a lot of patience. No other devices in my house have any of these issues, and it has led me to throw every single one of the chromecasts away in sheer frustration. For the money you're spending, do yourself a favor and spend just a little more to get a roku.", "verified": true, "helpfulness": "0/0", "author": "David"}]