[{"rating": 3.0, "review": "I simply had no need for this product since I have a gaming system and computer both connected to my TV as is. Purchased it out of curiosity but my Raspberry Pi loads much faster and never buffers on local content. The Chromecast seemed to work fine for Netflix and YouTube but even then, the Xbox360 would buffer faster.", "verified": true, "helpfulness": "1/2", "author": "RN"}, {"rating": 4.0, "review": "Works great.  The only problem we have is that we can't use it to stream Amazon instant video.  Other than that it's exactly what we wanted.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I tried using the beta Chrome tab viewing functionality, but it had glitches (video freezing after a while).  It's also a bit inconvenient to go to my computer to pause or select something to watch.  (Probably easier if I had a (light) laptop, or tablet, but still not as easy as a remote.)", "verified": true, "helpfulness": "1/2", "author": "Jim Baker"}, {"rating": 5.0, "review": "Its a great product, love being able to see youtube and netflix videos. No problems at all with the product only i wish had more apps for users in mexico", "verified": true, "helpfulness": "1/1", "author": "Elsa Maria Oroz"}, {"rating": 5.0, "review": "Many hidden features that can be added usingmanual \"Unlock the Power of Your Chromecast by Aaron Halbert\"Easy to use, as connection via a wireless network.On the earlier versions of Windows XP, Vista does not support some functions", "verified": true, "helpfulness": "1/1", "author": "Valery"}, {"rating": 5.0, "review": "After a simple installation, I set up my tablets & computer to send & receive the proper signals for watching what I want on my HD TV. I am pleased with how simple it is to operate & will use it a lot in the future.", "verified": true, "helpfulness": "1/1", "author": "Dale B."}, {"rating": 1.0, "review": "Did not work. Google support was absolutely no help. I've always been a fan of Google but was very disappointed with this product and support.", "verified": true, "helpfulness": "1/2", "author": "Andy McAllister"}, {"rating": 5.0, "review": "I love it and easy to install ...I have Netflix and it works great and the picture quality is wow", "verified": true, "helpfulness": "1/1", "author": "da"}, {"rating": 5.0, "review": "There are many other devices for streaming content off the net, and all of them have the same problem: a awkward remote that makes finding anything impossible.Chromecast solves the problem: you find videos on your phone, your laptop, or your tablets and then send them up on the screen. If you have an android phone, controls are always available with a touch from the notification menu.", "verified": true, "helpfulness": "1/1", "author": "Mirko Montanari"}, {"rating": 5.0, "review": "small, portable, a little nice niche device to play with, plug and play, hope there will be more apps to play with the cast.", "verified": true, "helpfulness": "1/1", "author": "Toothbrush Pro"}]