[{"rating": 5.0, "review": "one of the best streaming media players in the market, looking forward for version 2", "verified": true, "helpfulness": "0/0", "author": "darkpanda"}, {"rating": 5.0, "review": "It works great!  I wish it didn't have to be plugged into the wall - the picture is a bit deceiving as if it can be plugged in as a small device.  It would have been better if it had a small battery and was rechargeable when not in use.  Otherwise - it works as advertised. No complaints!  I'd buy another one if it was wireless/battery operated.", "verified": false, "helpfulness": "0/0", "author": "MJ"}, {"rating": 3.0, "review": "Nice device, but much of the content requires pre/monthly paid accounts.", "verified": true, "helpfulness": "0/0", "author": "Tal Levinger"}, {"rating": 1.0, "review": "This works well with YouTube, but every other video source I cast is jumpy and \"stuttering.\" It apparently can't handle certain streaming speeds. Don't waste your time with this - get a ROKU.", "verified": false, "helpfulness": "0/0", "author": "Richard G. Williams, Jr. \"Gentle Blood\""}, {"rating": 5.0, "review": "Super easy to set up, easy to use, great addition to my TV", "verified": true, "helpfulness": "0/0", "author": "Zach"}, {"rating": 4.0, "review": "Love the streaming capability . And best part is , you just need to be on the same network . Only con- process speed is kind of slow", "verified": true, "helpfulness": "0/0", "author": "Zaldy32 \"DC\""}, {"rating": 5.0, "review": "I love this product. For best results download web video caster or remote cast after initial setup to use the apps correctly such as Netflix. If you stream from one of those apps it should fix the lag issue.", "verified": false, "helpfulness": "0/0", "author": "M Dot"}, {"rating": 5.0, "review": "My family loves our chromecast.  We repurposed an old 24 inch Asus monitor as a kids TV.  We hooked up a mini soundbar (Bluetooth speaker by anker also 5 stars amazing) and used the aux out on the monitor.  Its perfect.  We have the multiple devices synced with the chromecast.  We mainly use Netflix, plex, and YouTube.  Its positively perfect and dead simple to use and setup.  Great job Google.  Also I leave it plugged in all day...it has this awesome feature where you can display a screensaver type photo stream of random gorgeous landscape photos drawn from the internet or pictures of your own.  Very cool digital picture frame feature.  I love it. 5 stars I can't say that enough.", "verified": true, "helpfulness": "1/1", "author": "Rach"}, {"rating": 5.0, "review": "So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Zagatskiy O."}]