[{"rating": 1.0, "review": "Worst product amazon has ever made. It is slow. It barely works. The apps for it are awful compared to the roku and Apple TV versions. The App Store is a joke. Unlike the roku and Apple TV, this product will not work without a constant Internet connection to amazon. The roku and Apple TV will at least let you stream movies on your local network if your ISP goes down. Do NOT buy!! Bezos should be ashamed.", "verified": true, "helpfulness": "8/13", "author": "Eric Heinemann"}, {"rating": 5.0, "review": "Love my Fire TV. Have to be sure the movies TV and other shows are Prime or you will have to pay to view them. I can watch Hulu Plus and Net Flix also through the Fire TV.  Good purchase.", "verified": true, "helpfulness": "0/0", "author": "Elaine L. Olsen \"cabin fever reader\""}, {"rating": 5.0, "review": "Bought this to replace an AppleTV2. In my eyes it was the clear successor, and easier to hack by far. Snappy, fast and while it needs some improvements in the software, I see these as being successful and a great piece of kit. Will definitely be buying again in the future when they release new models. I don't like most of Amazon's stuff like the Kindle with it's lack of support of the epub file format. I use the Nook there. But for this particular product niche, they have the best.", "verified": true, "helpfulness": "1/1", "author": "BuckRogers"}, {"rating": 1.0, "review": "The product technical specs and functionalities and user interfaces  are excellent and much much better than the AppleTV.But  Amazon's self imposed ultra \"geographical\" restrictions limits the growth of the Prime and Instant Video offerings. I say self-imposed because the same movies and videos are available through U.S. competitors like Netflix or Apple  at the same same locations restricted by Amazon.Even a  U.S. address and sufficient credit balances the system restricts any purchase with the now infamous Amazon's \"geographical restriction\". And yet membership to Prime is allowed but not purchase of non-Prime paid movies!It's quite pathetic and ridiculous!", "verified": true, "helpfulness": "6/8", "author": "Devi"}, {"rating": 5.0, "review": "New Item arrived on time, and really works ... by voice ! Ask for a movie and bang there it is ... !", "verified": true, "helpfulness": "0/1", "author": "Ellis Baxter \"elliseconomics\""}, {"rating": 4.0, "review": "Almost gave up on it till I discovered my Ethernet or wired connection wasn't configured properly and it was using the wireless connection instead. We have slower speed internet and it may rebuffer 2-3 times in the course of a movie but only for a few seconds. Unlike the wireless connection that never went more than a half minute and slowly rebuffed. Like the voice search.", "verified": true, "helpfulness": "0/0", "author": "BbrambTX"}, {"rating": 1.0, "review": "No HBO GO. Why would you not have this?", "verified": false, "helpfulness": "5/11", "author": "Hardy"}, {"rating": 5.0, "review": "it is cool", "verified": true, "helpfulness": "0/5", "author": "DOUG HAGLER"}, {"rating": 5.0, "review": "The set up was easy and I love, love it. I am not sure why I hadn't gotten it sooner.", "verified": true, "helpfulness": "0/1", "author": "Bella"}, {"rating": 4.0, "review": "would love it had  a cheater game controller for the grandkids", "verified": true, "helpfulness": "0/2", "author": "elpj"}]