[{"rating": 5.0, "review": "very easy to use, the resolution on my tv was better than cable provides. However, it did take me a while to figure out how to shut it off/put to sleep. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Sara K."}, {"rating": 5.0, "review": "This device is hands down one of the best electronic devices I have ever purchased. It is easy to use and the video streaming is perfect with absolutely no buffering. I would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "SHSELLIOT"}, {"rating": 3.0, "review": "As my title says, this is my first box of any kind and the first time I have been \"company cable\" free. So if you're looking for a review on specs or comparisons with other boxes there are obviously MANY other reviews to check. I however, had a hard time finding a review from another newbie such as myself that covered the content I'm going to so my hope is that this will help others who were/are (or want to be) in a position similar to my own.First let me say that I am an Amazon Prime member which made this box attractive for the extra benefits and that the box was a gift which came with an XBMC OS installed in it along with some other useful programs that are outside the normal parameters of the Fire TV box itself.Next, I have discovered that you can search program availability on your computer (which is very simple) and add to your watch list by checking the box on your computer screen [Add to Watchlist] and the information will be automatically be forwarded to the Fire TV as part of your account information. I'm certain this is a feature that will prove more convenient and useful as time goes by.As of this review, Amazon has sectioned out the content that is free for Prime members so that is no longer the problem to access that it clearly was at the beginning. Also, I like the availability of the music I have purchased through Amazon to play on my TV. I am however, quite frustrated by the fact that a number of DVDs I have purchased are NOT available for me to watch and that in order to see them I am required to use my DVD player OR BUY THEM AGAIN in order to have access to them through the Fire TV. Further, \"My Music\" does not contain ALL of my purchases through Amazon and this fact, combined with the absence of DVD purchases, leads me to conclude that Amazon has either a set date from which they are working or that buying something from does not necessarily mean that it will be included in \"MY\" Prime for some other unexplainable reason.They also show the availability of PBS through Fire TV, something I very much want, but as of yet I have been unable to locate and/or use it.I am also of the opinion that since hulu plus and Netflix must be paid for as a monthly service, Fire TV as a stand-alone is pretty limited and I have been a little shocked (which is probably naive of me) to see that Amazon, like Comcast inserts product advertising into its programs and also makes a point of giving you ONE free episode in a series and then charges for any other episode you want to see. But in this day and age I should realize that practices like these are permanently embedded in our viewing experience. After-all, we've been getting advertising at the movies for years now.In addition, I find it  more than a little frustrating that when you boot up a series that is complete and also completely free, that series won't run all the way through the length and depth of the seasons and episodes without user prompting. This may be a non-issue for many but I am accustomed to leaving the TV in my great room on all night long as I have chinchillas who are nocturnal and who REALLY watch the TV for entertainment after I've put them in and gone to bed for the night (Shaun the Sheep is a particular favorite) so having to run downstairs every 3-4 hours to continue the programming MAKES ME CRAZY! So, since I can't just leave it on and let it run, I load up my DVD player and set it on repeat.... I miss the days when I could just turn the channel to PBS Sprout and go to bed.In point of fact, if my Fire TV didn't have the XBMC loaded onto it I think I would have gone completely off the deep end and returned the box altogether. It's via the XBMC that I am able to access live TV, network programming, local and world news as-well-as a number of shows and movies that Amazon doesn't make available. Also, those shows are free, which could ultimately make the need for hulu and/or Netflix unnecessary. The only drawback is that booting up any program is very time consuming, you can't channel surf and because it draws off of the same internet connection as EVERY COMPUTER IN THE HOUSE.... you can't use your computer at all while watching TV for fear of being booted out of whatever it is that you wanted to watch in the first place.Yes, I understand that it was my choice to give up cable (well... kind of my choice in that I chose food and other utilities over Comcast) and I also understand that, like my laptop this is a system that will require time, effort and patience to learn. I also understand that you can't have everything. But... 3 weeks in I have already decided to subscribe to another paper and I am also starting to read my way back through our extensive library for the umpteenth time (and reading is GOOD) so in the final analysis, changing the way I watch TV is eliminating the amount of TV I watch and I'm pretty sure that's not what Amazon was going for.I also think it's important to add that the box I have came with 90 days of FREE PHONE TECH SUPPORT so I am lucky enough to have someone I can call who will answer my questions about how to use the box and how to problem solve any issues I have with it. I can't stress enough how important this is to me because the XBMC add-on makes the box as a whole much more useful and enjoyable than the Fire TV on it's own would be especially to someone who is just coming off of cable and all that it had to offer. Don't get me wrong, I'm pretty offended and put-off by all of the companies out there with monopolies on TV viewing and the push for bundling so they can line their already bulging pockets. But switching from cable to a box requires a commitment, patience AND the understanding that what you're switching over to won't be anything like what you had. I'm not saying I'm going back or even that I really want to. I'm just saying that this is VERY different and nothing I read prepared me for it.So, to those of you who are thinking about making the switch or who have made it and are struggling... I hope this helps.I would also like to apologize to any I may have offended for whatever reason and wish everybody out there a happy new year and happy viewing on whatever you choose or have chosen to watch!; - )ADDITIONAL:I have just added PBS to my Amazon viewing and here's how: scroll down to Apps on the far left menu (under games and above music), click right until you come to the PBS logo. Enter the app and it will give you a PBS web address along with a code to enter that will sync your computer and it's location to your PBS station. This is a HUGE feature for me as I watch an enormous amount of PBS programming and like PBS, it's free.This is also the location for HBO GO, which you also enter to activate and is also free (although I'm not sure if it's only free for Prime Members or not).You can also find Hulu, Youtube, Pandora, SHO, Netflix and many other apps/\"channels\" here as well.I think the lesson here is, go exploring! It appears that Amazon is very good about making it clear regarding what is freely available and what you have to pay for. Just be sure to READ the yellow boxes under a program or app and don't be afraid to find out what something does or what you have to do to make IT do what you want!I have also contacted Amazon regarding My Video Library and it looks like I'll be able to load and view my Amazon DVDs after all. I'm going to set-up a \"troubleshooting\" phone contact with them so they can verbally walk me through the process. I'll be back with more on that later. I will also say, cautiously, that I am leaning towards upping my rating a little. It would seem that the more familiar one becomes with the system, the more enjoyable it is. But I still wouldn't want it without the XBMC. Which is something that can be loaded onto applications under the left side menu marked Settings... not that I have any idea of how one would go about doing that...Meanwhile, hang in there folks. I don't know about you but I'm glad you're out there... wrestling with all of this can be a frustrating experience and I for one am glad to know there are others in the boat with me... which is not to say that I want anyone to have to struggle... just that I am comforted in knowing I am not alone.; - )Additional  4 / 21 / 15So I've had the box for about 4 months now and in the final analysis, it's just OK. I got the box in the first place because I wanted to \"cut my cable\" and still be able to watch TV. I can do that but Fire TV isn't exactly the \"viewing bonanza\" Amazon led me to believe. When I originally received the box, it included every series that HBO had produced as a part of \"Prime Free Viewing\". That no longer exists. While they do have some of the cancelled shows, others have been moved to HBO GO which requires a paid subscription to a cable or dish provider to get! Huh??????? Isn't the point of the box to free me from cable? They are also really starting to \"push\" subscription viewing.Case in point: the entire series of Primevel (a BBC production) was free to Prime Members. It now requires a subscription to hulu to watch.Other shows must be accessed from Netflix… and so on. Buy a \"Sling\" subscription, pay for hulu, sign up for Netflix and get a cable or Dish provider so you can watch HBO GO. Buy the game controller so you can access their other \"extras\". They charge for everything I can get from XBMC and SHOWBOX for free and I got a wireless keyboard that can operate any program installed in the box. So I'm not really using the Fire TV as anything much more than a \"storage box\" for the software programming I was lucky enough to have loaded into my Applications file. Yes, the picture is fantastic and the sound out of my TV has also improved immensely… it's also got a great screen saver. But none of those descriptors apply to Amazon's programming and when I really want to watch something… I go to my applications folder and open up something else to view it on. Will we buy a second box? I don't honestly know. But if we do, I'm pretty sure it won't be another Amazon Fire TV box. If things keep going the way they seem to be, it would just be an investment in something that requires more investments to use… and then I'd be pretty much right back where I was with Comcast. Which is what I got the Fire TV Box to replace.As an aside, I am getting ready to purchase a 300mb router which should virtually eliminate my buffering time and allow for the use of other devices at the same time we're watching TV. Something that has not been possible with the standard router that Comcast offers with it's internet/cable service. Buffering time isn't much of a problem with the Fire TV but as most of what I really want to watch isn't available on Amazon (and there was still a problem using other internet devices while having the Fire TV running) I'm pretty excited by the thought of reducing the problems this has presented in the past.", "verified": true, "helpfulness": "7/8", "author": "Janine M. Steiner \"Bearbride\""}, {"rating": 5.0, "review": "Great box, If you have prime you better get this. This is faster than my roku and it plays plex really well, also the games are not bad at all, all my games have been download from the Free app of the day that amazon regularly have, that way im playing every now and then free games. My girls use them in free time mode, this way Im not afraid of them having access to more mature content, really easy and great plus the amazon originals for kids like tumble leaf,galaxy and a couple more are some of my girls favorite show. again if you have prime get this, if you dont have prime ...GET prime.. free 2day shipping plus great content have replace my cable tv, add to this a antenna with all local channels and netflix ..there you go the only thing is that if you dont want prime then this is going to be a bad choice for you. since most of the interface is around prime... by the way I LOVE PRIME MUSIC on this thing, some songs have like a karaoke style .. my wife cant stop singing with this great feature. also my phone pics go automatically to the amazon cloud of unlimited storage for prime members.. i get to see all the pictures on my tv without ever having to upload them myself.. Great product and let see if they bring sling tv.. that's all I need to get my sports and never ever have to get cable again!", "verified": true, "helpfulness": "0/0", "author": "Efrain burgos"}, {"rating": 1.0, "review": "Switched from Apple TV to Fire TV . It is fast and fluid interface but gobbles huge amount of data. Received notice from ISP that I am close to the data limit. Had to unplug this device as that is the only way I could stop this from consuming more.", "verified": true, "helpfulness": "2/6", "author": "Rakesh"}, {"rating": 5.0, "review": "Its a great product.  We have two of them in our house.But both times, a couple weeks after we buy it, it goes on sale for $15 less.That is not cool.", "verified": true, "helpfulness": "0/0", "author": "GGP"}, {"rating": 3.0, "review": "The Amazon TV is great if you primarily want to access Amazon content.  If you are a heavy Netflix or Pandora user (or any non-Amazon app), then this box really doesn't buy you much over rival boxes from Roku, WD, etc. etc.  The USB port on the thing won't recognize external storage devices unless you root it...seriously!  The voice search is essentially pointless as many other reviewers on here and other sites have pointed out.  The voice search was supposed to be one of the strong selling points of this device... epic fail!At this point you are wondering why I gave it 3 stars instead of only 1 or 2.  Three words, XBMC on Snapdragon.  If you don't know what I'm talking about, then just assume this is a one star product.  If you DO know what I'm talking about, then you really need to take the time to side-load XBMC onto your Fire TV.  It runs very smoothly on the Snapdragon quad core processor.  You can easily figure it all out if you spend about 30 minutes on YouTube.  Once you get XBMC up and running, you might actually feel like it's worthy of 4 stars (I do)!  And at the black Friday special price of $75, it is the fastest XBMC machine for the money...", "verified": true, "helpfulness": "13/13", "author": "GG \"geolebeau\""}, {"rating": 2.0, "review": "Still no app for iPhone, even though it was promised a month after launch. It's a PITA to find free content. The remote annihilates batteries. I've had the same batteries in my ROKU remote for over a year and they still work perfectly. My FireTV remote is already on its second set of batteries after 8 months. There aren't many apps available. The FireTV isn't even in the same league as the ROKU3. Don't waste your money...", "verified": true, "helpfulness": "0/2", "author": "Derek Fuller"}, {"rating": 5.0, "review": "We are enjoying the movies that are available to us on this device.", "verified": true, "helpfulness": "0/0", "author": "ptlvr \"ptlvr\""}, {"rating": 3.0, "review": "This is an alright product.  My girlfriend and I purchased one for her parents who are not very tech-savvy, yet wanted an alternative to their expensive cable bill.  (Since we used her account, I won't show up as a verified owner but did all of the setup on this unit)Setup would have been a breeze if it was bought for us.  Amazon pre-loads your Prime account data on to the device so that when you power on, everything is available to you instantly.  Great idea.... unless it's a gift!  Know that if you're buying this for somebody else, they will have access to your account unless you remove it.  We didn't want her younger sister randomly buying TV episodes and movies, and her parents didn't want the hassle of setting up their own Prime account, so we had to lock everything away behind a PIN.  You can't hide non-Prime shows, just PIN lock purchases.  It was aggravating.  A HUGE HUGE HUGE plus to the setup though, was having the first boot go directly to an instructional video.Content was another mess.  They try to shove as much Amazon content in your face as possible, so most of the interface shows Prime content and Amazon-buyable content.  I only spent a few hours setting this up, but remember being frustrated with their category layout.  A better approach would have been to have an app menu, and network/connected media folders much like using a Playstation, Xbox, WD TV (my preference), or other streaming box interfaces.  Netflix wouldn't even install, saying it was queued for download but never showing up.The last major problem I noticed was connection quality.  Shows had to buffer and display in lower resolutions very frequently, but my laptop and phone had great WiFi reception in the same room.  I don't think the parents would have appreciated me running cable through their house to fix the problem, luckily they aren't as picky about the quality.Other than that, I guess it does the job decently.  You get the standard fare of streaming apps, and having it designed to be a get-up-and-go device helps users that are less inclined to learn new technology.  Just be very aware that the whole experience seems designed to have people spend money on content, with your other subscriptions and media available as a side-thought.", "verified": false, "helpfulness": "1/1", "author": "gtc \"gtc\""}]