[{"rating": 5.0, "review": "Good bye cable TV.", "verified": true, "helpfulness": "0/1", "author": "Emil"}, {"rating": 5.0, "review": "I can't say enough about how much we love our Fire TV! It's our main source of entertainment. The voice recognition is great, the interface is easy to use. the remote is simple and clean, and the best part is we can hide the box behind the tv and the remote still works seamlessly. We can even go around the corner with no visibility to the box and it still works. We also have a Roku HD, and the Fire TV blows it out of the water!!! Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Ashley Dirks"}, {"rating": 3.0, "review": "I went down just a bid because it broke in a weeks time but the replacement service did come late sunday evening just as the grandkids were going home , other than that we have enjoyed the service very much.", "verified": true, "helpfulness": "0/0", "author": "Ileata E. Geer"}, {"rating": 5.0, "review": "Very good media box, better one out there I would recommend it to anyone", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 4.0, "review": "It works great but where is the power button.  :<)", "verified": true, "helpfulness": "0/1", "author": "Ablaze PowerSports"}, {"rating": 1.0, "review": "I am returning because I don't want to purchase basic apps.", "verified": true, "helpfulness": "1/7", "author": "Teresa"}, {"rating": 5.0, "review": "AAA fire tv Box !", "verified": true, "helpfulness": "0/1", "author": "Mike T."}, {"rating": 5.0, "review": "I had a WD TV Live prior to this, and loved it for several years.  In comparison, the video quality on the firetv is better, and it's much, much faster.  The only downside for me is the lack of native local media support.  This can be rectified by adding third party programs like XMBC, if you're up for a bit of hacking.", "verified": true, "helpfulness": "0/0", "author": "Dylan S"}, {"rating": 1.0, "review": "Difficult to use. Keeps dropping the wireless signal. My Apple TV and my Roku never have this issue.", "verified": true, "helpfulness": "2/5", "author": "Nancy L. Schlegel \"nschlegel\""}, {"rating": 5.0, "review": "The amount of download GB quickly exceeded my monthly data cap. However, it is an excellent product and the selection is incredible.  I'll be back when I have enough data available to fully use it.", "verified": true, "helpfulness": "0/0", "author": "Alaska Doc"}]