[{"rating": 5.0, "review": "While not perfect, the Fire TV is probably the best streaming box available at the moment.I was searching for a device that had all of the big three streaming services (Netflix, Hulu, and Amazon Prime Video) in HD.  I also wanted the ability to utilize Kodi/XBMC for the browsing of my locally stored media.  Finally, I also wanted the ability to be able to access any external apps from within Kodi/XBMC.  The Fire TV hits almost all of these criteria with perfection.PROS:- Great interface for Netflix and Hulu.  It's responsive, intuitive, and fast.  Excellent.- Great hardware at the price point.  Nearly impossible to find similar hardware capabilities at this price and still be certified by Netflix, etc. to have HD viewing.- Solid catalog of games. I do not use the device for gaming so this is purely based on browsing the available apps.- Can sideload apps. To me, this is a huge pro.  Combined with the officially supported apps, this creates a pretty large pool of apps. This is stark contrast to the Apple TV with it's nonexistent app store.- Can sideload Kodi/XBMC as well as SPMC.  For those interested, the Kodi experience on the Fire TV is great.  Looks great, is very quick and responsive, even on heavier skins.- Ethernet port.  A simple but very important aspect for me.  Living in closely built residences, I can get a lot of wireless interference if any distance from my router, With the hard wired ethernet connection, I never have to worry about streaming bandwidth.- Latest firmware update allows USB storage.  Huge benefit.CONS:- My biggest complaint is the Fire TV home screen.  I completely understand that Amazon wants to funnel traffic to their Prime Video service.  It's a great service with great content.  However, the current presentation is confusing and not conducive to browsing between various streaming services.  Ideally, I would like the ability to determine what is shown on the home screen, whether it my Prime Video Watchlist, or which apps I want to display (from ANY installed app).  I do not like the multiple bars of Prime content before I even get to my Watchlist and my apps.That's really it as far as cons.  Like I said, it's a great device that is almost perfect.  However, for me the one con is significant.  Not a deal breaker, nor would it stop me from recommending the device, but it's the only thing stopping the Fire TV from being the almost perfect streaming device.Overall, highly recommended and five stars.", "verified": true, "helpfulness": "0/0", "author": "Mitch.B"}, {"rating": 5.0, "review": "This is the BEST purchase I ever made!!! I'm able to watch shows from my childhood, movies from today and everything in between. I love using the Netflix app with it as well. It's awesome!! I highly recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Erin Kates"}, {"rating": 5.0, "review": "Access to all my purchased CD's was an unexpected surprise! And if you are a Amazon Prime customer, this is a must have!!!!!", "verified": true, "helpfulness": "0/0", "author": "Claudia Jurcazak"}, {"rating": 1.0, "review": "not enough rom", "verified": true, "helpfulness": "1/8", "author": "mavinolasco"}, {"rating": 2.0, "review": "Not as advertised. You need additional items to use this product. one is a HDMI cable and the other is some type of internet or cable service.", "verified": true, "helpfulness": "0/7", "author": "Willie Williams"}, {"rating": 5.0, "review": "It works as advertised.  It streams movies faster than my Roku XD.  I like the voice activated remote control.", "verified": true, "helpfulness": "0/0", "author": "Antonio F Laihee"}, {"rating": 5.0, "review": "Only had a chance to play with it for a little bit but first impression is positive.  The interface is fast, smooth and responsive", "verified": true, "helpfulness": "1/2", "author": "Tri L."}, {"rating": 1.0, "review": "NO, NO !Bad,  I wanted To watch NETFLIX , it puts your movies to pay, like it was Netflix & will not give me the list of ONLY Netflix.also charged my grown Son who gave me me Amazon Fire TV for a Birthday gift for a movie I never watched ! Nasty", "verified": true, "helpfulness": "1/9", "author": "Maria V MILLER"}, {"rating": 3.0, "review": "I could only give it three stars because Amazon does not allow the existing USB port to be used for streaming existing media to the TV. We have several dozen digital movies that could easily be streamed to the TV through the FireTV, but Amazon has disabled this feature.Another thing that I did not like about the FireTV is that it does not have a process for the approval of certain videos from the Prime library into the kid's account. It would be nice for there to have been accounts for the kids that had movies from the Prime library that parents could control or pre-approve. As it is, for my kids to watch a movie, I have to put in my PIN code every time.On a few positive notes, we have enjoyed making use of the unlimited digital photo library. We have uploaded our pictures to the Amazon Cloud drive, and we can view our family pictures on the TV through the FireTV.  The Fire TV is a polished product. The access to media from Amazon is very nice. The interface and remote are very well done.If Amazon would create accounts that could have Prime movies approved by parents and access to the USB port for streaming already purchased media, I would upgrade it to 5 stars.", "verified": true, "helpfulness": "1/4", "author": "M. Mitchell \"Historicus\""}, {"rating": 4.0, "review": "Very much like apple tv", "verified": true, "helpfulness": "0/0", "author": "MICKEY"}]