[{"rating": 4.0, "review": "Very simple design and easy to use. It won't solve all of your media needs but great for people on the road or RVers. Small and simple is the way to go.", "verified": true, "helpfulness": "1/1", "author": "Tom Wiggin"}, {"rating": 3.0, "review": "Most of the functionality is good, easy to set up and use, great for turning your tv into a your monitor and great for cord cutters/ However my issue was mainly around lag, I have a pretty good wifi network at my home with max speed of 50 mbp/s and on all the apps that I tested (YouTube, Hulu, & Netflix) it would \"buffer\" every 30-60 seconds and it made viewing almost impossible. I used it like 3 times and now I'm already back to using another device to stream. Hope it gets better.", "verified": true, "helpfulness": "3/4", "author": "brunella trotta"}, {"rating": 2.0, "review": "In order to make this thing work, I've got to re-configure my Belking router, though it's on the list routers compatible with Google Chromecast.Ordinarily this would not pose much of a problem, but Google's instructions are not clear and Google doesn't permit their service reps to walk you through the procedure.  So I'm stuck with the thing.  Maybe Belkin will help, but the router is past warranty.  Anyway, I can't stream on-line programs to my TV.", "verified": true, "helpfulness": "1/2", "author": "Jack Libeu"}, {"rating": 3.0, "review": "The Chromecast does it's few things well... But that's all.Youtube and Netflix and Pandora are great. I haven't found much else that it's good for. Plex is still not supported, and my entire collection of local movies is no good on this.The upside is that it's affordable. If you're on the fence, think about what you want to do with it. Watch Netflix? Put Youtube on the TV? Play Pandora through the TV? Then go to town, you'll be thrilled. Anything else? Don't bother, you'll need to use hacks and there are better options.", "verified": true, "helpfulness": "1/2", "author": "AndyVA"}, {"rating": 5.0, "review": "I purchased Google Chromecast as a Christmas gift for my 29 year old nephew.  He loved it!  It was easy for him to set up and he will get a lot of use out of it.", "verified": true, "helpfulness": "1/1", "author": "Paula Graham"}, {"rating": 3.0, "review": "I love the concept and I can connect from my phone to it and the beta laptop chrome extension.  In my opinion it does not go far enough or do enough. It should have a built in browser and a few other features.  It is really on good for NetFlix and Youtube or Hulu at this time.  They have supposedly recently blocked rooting as well.  It is kind of fun if you do not have a smart TV.Price was ok but for the few features they should give them away...LOL", "verified": true, "helpfulness": "2/4", "author": "onemichael"}, {"rating": 5.0, "review": "Took me a while to setup as my 47 inch LG HDTV did not detect this until I unplugged the TV from power. Simple power cycle with remote did not help. After setup completed, I love it. Which more apps were available. HULU Plus is awesome. Image quality and ease of use are great.", "verified": true, "helpfulness": "1/1", "author": "toliver5"}, {"rating": 5.0, "review": "This device is great and a huge bargain. All the negative reviews are literally people with poor wifi setups in their homes or people complaining that the device doesn't do things that Google never said it does.", "verified": true, "helpfulness": "1/2", "author": "D. Rock"}, {"rating": 3.0, "review": "This is totally useless If you have any kind of gaming system or smart tv. I bought it hoping that I'd be able to stream my Slingbox through it but wasn't able to. It does what it's supposed to but is VERY limited so far, only being able to work with about 4 apps so far. As of right now, I would rather buy a Roku or Apple TV box.", "verified": true, "helpfulness": "3/4", "author": "Philip Chiang"}, {"rating": 5.0, "review": "Google hit it out of the park with the Chromecast, all my Netflix and Youtube videos are on my big screen with one touch, what else is there to say?", "verified": true, "helpfulness": "0/1", "author": "Reinaldo Rojas"}]