[{"rating": 4.0, "review": "I brought this mostly because my DVD streaming device would always buffer, very annoying.  We have watched 2 movies and 6 episodes of Orphan Black and not once has this device paused to buffer!  I think the speech search is cool and works about as good has it could. The browsing is fast. Menus are nice, large format, and easy to see.My reasons for - 1 star:I'm not sure why Amazon did not include a cloud music player, it would have been nice if I could play music that is in my Amazon Cloud.  Maybe cloud music streaming will come later with a 3rd party app, but I think that since this is an Amazon streaming device, the customer should be able to stream music, and audio books, at least if they were purchased from Amazon, and on a customers Amazon Cloud, but again maybe these things will come with development, I hope anyway.  The other thing that bothers me a little bit it that when you are browsing you don't know if the movie, or show is available with Prime, you have to click \"choose other ways to watch\" and go into that menu before you know if it is available with Prime.In summery: performance wise a great device, could be an overall really great device with a few more features.", "verified": true, "helpfulness": "3/3", "author": "chris"}, {"rating": 3.0, "review": "I have Roku, Chromecast, and Apple TV. I would put this second behind Roku for general usage and last for Netflix usage.My main issues:The Netflix interface is a generation or two back from the others. Primitive and needs upgrading.Hulu video had problem with losing audio sync. Switched over to Roku and didn't have the same problem.No Amazon Music Player. Really? I can't believe Amazon went to market without this. I have to use my Roku to listen to Amazon music.Amazon Instant Video is of course better at the expense of the shortcomings of the others.I would like to switch over to Roku but it's just not there yet. I like the ideas of some of Amazon's innovations, but the basics just aren't there: Netflix, Hulu, and Amazon Cloud Music are a miss for now.", "verified": true, "helpfulness": "3/3", "author": "James M."}, {"rating": 4.0, "review": "I have three streaming players in addition to a blue ray disc player that will stream also. SO here is my take on the Amazon Fire TV:Likes:It is very easy to use and set up.Love the interface.Love voice search.I like being able to find inexpensive games to play and have something other remote play with.Love the updatability of it. They can continue to improve and expand it.It is fairly fast.Dislikes:Wish I could play items off my media server from it. Need to add app for streaming your own videos and make it as easy as the rest of interface.More content (I know it will be forth coming)Overall, I would definitely recommend buying one.", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 4.0, "review": "I have owned many different media streaming products.  I currently am using 2 Roku(s), a Google TV, A chrome tv, and a smart TV. In addition, I used to use a netgear 2000.The Amazon Fire TV arrived yesterday.  the packaging was very nice but simple.  I immediately noticed the quality of the Fire TV during the unboxing - it does seem to be very well made. The unit is very thin which means you can put it almost anywhere. Also, the unit actually is heavier than it looks, which is nice because that means it will not slide off of your entertainment center if you have anything plugged into it. The unit has a LAN connection on the back, as well as HDMI, optical, and what seems to be a 3.5 mm jack.  The remote reminded me a lot of an Apple TV unit with the round interface button and the overall look of the remote.Connection was very easy, and it came right on. The menus are laid out well and very easy to navigate through. Surprisingly, the unit was already setup to my amazon prime, so there was no setup required for that part.  It appears that the unit is running on android, which is awesome - that would explain why there are android games available to play on the unit (you can purchase a game controller separately).The voice search works great.  I was able to find everything quickly.  In addition, this unit does include YouTube - Roku does not.The only thing that I did not like about the Amazon Fire TV is that many of the TV shows are not free, and I do have a prime account, so that is annoying, and I took away a star for that.  Also, no HDMI cable comes with the unit, but that is not a huge sticking point.All in all it is a nicer unit than the Roku and probably even with Apple TV (I say that because you can mirror your ipad through an apple TV to your TV which gives it some cred.).", "verified": true, "helpfulness": "0/0", "author": "Gadetking \"40 Miles Out\""}, {"rating": 4.0, "review": "I mostly use it for Netflix and streaming Prime video. The main drawbacks have been covered by most other users.The power adapter is too wide so nothing fits beside it on a power strip. Amazon should replace cord and send to those who purchased.The voice search is great, but it only works for Amazon content. It should be available for at least Netflix.The free prime content could be separated a little better from the paid content on Amazon.No Spotify - This is the biggest drawback for me. Hopefully Amazon can add to an update soon.", "verified": true, "helpfulness": "1/1", "author": "Matthew Balliet"}, {"rating": 3.0, "review": "The Search Function only allows you to search on Amazon Prime.  If you have a Netflix Account, the voice command search does not work.  If you try to search using a voice comand while on the Netflix App, it boots you out to Amazon Prime.  Not Good!  There is also no way to search Amazon Prime Movies.  It will only allow out to see Recently Added to Amazon Prime Moives.", "verified": true, "helpfulness": "2/2", "author": "Matthew Powers"}, {"rating": 5.0, "review": "I installed Amazon's Fire TV yesterday and have found it to work exactly as described.  I really like the following features:- The voice based search.  I have done around 50 searches and it has been spot on with the results.  To me, this feature alone makes the Fire TV a better choice than any of the other options.- I like how clicking on the sides of the wheel takes you either forward or back ten seconds in whatever video you are playing.- Pandora is very nice (I ended up subscribing to the upgraded level of service).- I find it very interesting that you can install Android based apps.  Lots of potential there.One little tip for those who are creating a Pandora account, if you create the account through your TV and then attempt to access it from your computer by going to pandora.com the website will tell you that you are not registered.  I ended up creating a new account via the computer using the same settings as I did on the Fire TV and upgraded my service.  When I went back to the Fire TV none of my changes were seen (no upgrade, no channels I had added via the computer, etc) until I signed out of the app, quit it and restarted it.  Once I did that everything synched up just fine.", "verified": true, "helpfulness": "1/2", "author": "Brian Maher"}, {"rating": 5.0, "review": "I have been a long time Apple TV fan, this is better!!!Easy, fast and well made.Has voice recognition, the movies fly off the Amazon Prime they connect so fast its addicting.I just hope they add more apps, I would start with the Ted talk app.", "verified": true, "helpfulness": "1/1", "author": "J.F"}, {"rating": 3.0, "review": "I sold my Roku 3 to get the new Amazon Fire TV. I also have an Apple TV that I regularly use.The Fire TV does a great job in presenting the Amazon Prime content. The Netflix content is at least as rich, but all that is squeezed into one little application, and gets second class treatment. I pay almost as much money for the Netflix content, and I regret that I no longer have the excellent interface of Roku 3 to discover the content I pay for.If you have Netflix, either switch to Amazon Prime subscription, or just stick with Roku 3.", "verified": true, "helpfulness": "3/3", "author": "hoosier_grad"}, {"rating": 5.0, "review": "I have this hooked up through my Visio 60\" LCD tv which in turn pipes out to my Vizio 2.1 sound bar.The FireTV plays 1080p MKV files from my Plex server with almost no initial buffering and they look amazing.Video for Amazon Prime plays almost as quickly as I can push the button, which is great for watching Sesame Street with my baby girl in the mornings.The box is tucked behind my wall-mounted TV and I have no remote issues from about 10 feet away.I got this to replace my chromecast because of freezing issues and so far it has be perfect.Now I just need them to get Google Play Music running on this bad boy and I can donate my chromecast to my parents.", "verified": true, "helpfulness": "0/0", "author": "Tyler"}]