[{"rating": 5.0, "review": "Great product, comes in handy with lots of on-line streaming. Easy setup with home wireless network , no Hassel, will definitely recommend to friends", "verified": true, "helpfulness": "0/0", "author": "Nicholas Punch"}, {"rating": 4.0, "review": "What a fantastic product!  Google allows you to display ANYTHING on your computer's Chrome browser.  For those without a cable subscription and rely upon Netflix, Hulu, etc....this is a MUST.  I also use an AppleTV for streaming from an iPhone/iPad, but there are times when I'd like to use my iPad and watch TV, too.For $30, how can you go wrong?Only two slight inconveniences (not enough to make me not buy another, though)....1) If you don't have a USB connection on your TV, this is going to be a tad inconvenient.  The picture of the device is a bit misleading -- it actually requires a cable coming out of the back for more power -- HDMI does not provide enough alone.  If you don't have the USB connection, you have to connect it to a power strip.2) Configuration and use is not overly streamlined or intuitive.  I'm pretty tech savvy and this took me a few minutes to figure out.I'm hoping the capability of this device is expanded over time.  I feel like I'm beta testing this product.  Spend $30 for a really good device today with the HOPE of it turning into a great product in the near future.", "verified": true, "helpfulness": "0/0", "author": "Tom Hayden"}, {"rating": 5.0, "review": "Ease of use, everything reviews said it would do and more. Like the ability for control through my tablet. Thank you", "verified": true, "helpfulness": "0/0", "author": "Robert Randall"}, {"rating": 3.0, "review": "well, it is cheaper, but you are more limited in what you can send to the tv.  And it has to be managed by a Google application.Roku is definitely more robust and has more offerings, but it costs more.So it all depends on what you are after.One thing about Chromecast, it does not like to automatically reconnect to your wireless network if the network goes down.  I use a hotspot and occasionally shut it down.  After I bring it back up I have to reboot the power on the Chromecast as well.Yes, the Chromecast needs a power supply.  You do not save any power outlets vs. the Roku.  But it takes up less space than the Roku since it does not need any \"tabletop\" space.So, it is a decent device for what it is, and cheaper.  But until they up the offerings, Roku is more robust and does not carry the Google reputation for tracking everything you do... (Don't know if this does, but Google does have the reputation...... just saying)", "verified": true, "helpfulness": "0/0", "author": "Terrence Michael Miller"}, {"rating": 4.0, "review": "Delivery was great as usual but this is a gift so I cannot evaluate yet.  Will re-rate once I get more info.", "verified": true, "helpfulness": "0/2", "author": "Bob"}, {"rating": 1.0, "review": "Simply will not connect to my WiFi (D-Link DIR-651). I have the latest firmware on my router, tried enabling/disabling multicast and UPnP, nothing. I have a half dozen other devices of various OSes using this same network with no problems, the WiFi is working just fine.", "verified": true, "helpfulness": "1/2", "author": "Joel"}, {"rating": 5.0, "review": "The Chromecast works great and required a 30 second install.Good job Google! Can seriously consider cord-cutting as an option now!", "verified": true, "helpfulness": "0/0", "author": "James A Lavorato"}, {"rating": 2.0, "review": "I got this because I travel frequently and want to be able to watch streaming -- but this doesn't always work very well. Out of the 5 places I tried, it only worked at 2.  And if the TV doesn't have HDMI you can't use it (and adapters are as expensive as the device). When it works it works great -- but it's not as universal as I had hoped.", "verified": true, "helpfulness": "1/1", "author": "g"}, {"rating": 5.0, "review": "Works best with android operating system, limited with the iPhone. It's basically a tv receiver and you can't go wrong for the price.", "verified": true, "helpfulness": "0/0", "author": "April Laureski"}, {"rating": 3.0, "review": "I'm not sure why Google went ahead with the Chromecast with only a handful of programs available. It worked as intended but would often freeze up on my iphone 3GS when I used the phone as a remote and  I tried to activate closed captioning. I'll stick with using an hdmi splitter from the back of my Roku and watching movies in two different rooms on two different tv's. I like Google products, I'm writing this review on a Samsung Chromebook and I have a Google tablet but I feel the introduction of the Chromecast was a bit premature with what it has to offer.", "verified": true, "helpfulness": "0/0", "author": "gadget happy"}]