[{"rating": 3.0, "review": "cannot cast local media files and cannot cast in other apps, if it can connect to router with ethernet it will be much better", "verified": true, "helpfulness": "0/0", "author": "Timothy"}, {"rating": 4.0, "review": "The Chromecast is a great dongle with a lot of potential behind it. I got it for my mother to use in her VIZIO E320i-A0 32-inch 720p 60Hz LED Smart HDTV because it would not hang onto a WiFi connection. I also dug out an old Samsung Galaxy S for her to use with it.Setup is extremely easy. You plug it into an HDMI port of your TV, and plug the USB cable into a USB port (Most modern TVs have a USB port that can supply power). Then you give it the password to your WiFi and download the app for your phone (or Chrome extension for you computer) and let it do the work for you.When it's setup it's also pretty easy to use. Compatible apps on your phone like Netflix and YouTube will have a button at the top to tell it to send the information to the Chromecast and you just let it do it's thing again. One of the best parts is that since the Chromecast gets the info from the cloud, it is able to keep a steady connection and you can just set your phone aside and not worry about it (until you want to pause or rewind, of course) and it won't use any extra battery at all from your device.My one major gripe with the Chromecast is that it has SO MUCH potential behind it, but Google is limiting it (maybe to keep streaming partners happy). You can only stream Netflix, YouTube, Hulu Plus, Google Play Movies, and you can stream what you seen in your Chrome Browser on your computer over your home network to the Chromecast, but it did not work well at all for me, though I do have a lot of walls in my house that could mess with my connection (the picture is really bad quality and I probably got about 10 FPS on it). Developer have found ways to stream pretty much anything to the Chromecast from your device, but Google has been quick to patch them (automatic updates in the background). Also, Google has said they are working on an HBO GO app which is great news.Also, you may notice this thing get pretty hot after use, but don't worry because pretty much the entire inside of it is made up of two aluminum heatsinks that are designed to pull heat away from the components inside so the outside gets very hot, but that means it's working!TL;DR: This is an AWESOME product for this price. It is easy to setup and use, but it is doesn't quite live up to the potential it has by having a fairly limited amount of streaming apps, and squashing outside developers workarounds to get other things streaming on it. But I very highly recommend this device to someone wanting a good, cheap way to get some streaming onto your TV, especially if it's not a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Wade Johnson"}, {"rating": 2.0, "review": "I purchased the Chromecast expecting to be able to cast anything for my iPad to my TV. First it doesn't work with first generation iPad. Second. It really only casts utube, netflix, and a couple of google apps. Next it worked ok for netflix with my iPhone at first then died after about two weeks. I first contacted google for tech support. That was the worst experience I have had with tech support ever. Unbelievable lack of customer support and incredible hassle trying to get a replacement. So I finally gave up and contacted Amazon.  Amazon took care of the issue straight away with no hassle and no delay. l give Chromecast a grade of C for functionality, Google an F for tech support and Amazon an A+ for customer service.", "verified": true, "helpfulness": "0/0", "author": "Patrick L \"Boater\""}, {"rating": 4.0, "review": "I chose this over spending more money on a device just so I could watch Netflix. It's just enough for what I need. The interface via iPhone is easy-peasy, a little more of a pain if you don't use a smartphone. Easy set-up, and more sites eventually. Works for me!", "verified": true, "helpfulness": "0/0", "author": "AFKBRB"}, {"rating": 4.0, "review": "Not so easy to set up, but after that works great.No more cables to conect to TV very good interface for netflix via cel phoneI miss a support for the PLex Media Server", "verified": true, "helpfulness": "0/0", "author": "Victor S. C. Mendes"}, {"rating": 5.0, "review": "I purchased this knowing what I am getting into, other people that complaining just don't understand what Chromecast actually does.I bought this even I own a LG smart TV (2011 version) because it gave me more option of what I can do with my TV,,,,in a much convenient way. Using the smartphone or tablet to gain control over it, I found myself always watching Youtube on the big screen. It's just so quick and easy.I also used the function which can mirror your chrome web browser screen to the TV, by using it that way, you can watch unsupported services through it.I think Google really hit a home run on the Chromecast, plus there will be much more support in the later days (even not, watching just Youtube is already enough for me,,,considering the price)IT IS A MUST BUY", "verified": true, "helpfulness": "0/0", "author": "C. Wu"}, {"rating": 4.0, "review": "early adopter tax includes but not limited to:* Netflix can only watch one at a time, no repeat mode* Double buffering first to start stream on PC, then futzing with UI to cast it over to TV, could be cleaner* Noted as beta, Google Tab cast definitely lives up to beta designation* Must use Wifi to cast meaning old school cats using Ethernet (for its superior latency and timing advantages) cannot cast.  We still exist and have feelings, Google!  Blech Wifi only mode.I am being a bit harsh, because it's mostly wonderful and pleasant, the video quality is top notch, and for the price, pretty dope all around.", "verified": true, "helpfulness": "0/0", "author": "JDJ"}, {"rating": 5.0, "review": "my son asked for this for his birthday ,he is a computer Geek and loves things like this  who knows what he will ask for Christmas !", "verified": true, "helpfulness": "0/0", "author": "kathy porter"}, {"rating": 3.0, "review": "If you have Verizon FiOS you might want to check and make sure your equipment supports the required protocols. I did get it to work at the office and is pretty slick little toy.", "verified": true, "helpfulness": "0/0", "author": "shopper"}, {"rating": 5.0, "review": "If you're big into netflix, but don't own a game console, THIS IS FOR YOU!!!  Streams with great quality, easy to install and control. With a little technical know how you can even stream your own library of videos from your computer to your tv. Home run for the price!! Requires PERSONAL wifi.", "verified": true, "helpfulness": "0/0", "author": "Jaunell"}]