[{"rating": 3.0, "review": "Screen mirroring sucks. The dedicated apps work pretty good though.", "verified": true, "helpfulness": "0/0", "author": "The Infamous"}, {"rating": 3.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "R. K"}, {"rating": 5.0, "review": "Product has changed everything, anything you can do on your phone or tablet you can do on TV.YouTube, Netflix, Hulu, HBO GO,videos and so much more", "verified": true, "helpfulness": "0/0", "author": "daniel"}, {"rating": 5.0, "review": "Great for streaming stuff to my HDTV. Let's me make the most out of that technology while keeping me confined to my couch while entertaining myself.", "verified": false, "helpfulness": "0/0", "author": "Earl Temple"}, {"rating": 4.0, "review": "makes watching netflix real easy, right from the phone", "verified": true, "helpfulness": "0/0", "author": "Travelin' Queen \"Queenie\""}, {"rating": 2.0, "review": "Apparently chrome cast is not compatible with iphone 6 and a Mitsubishi projector TV (2010). Tried two different ones and it connected for a second, then would randomly turn off and couldn't get it to work again. Tried many things, even with a Samsung tablet and still wouldn't connect to the TV..", "verified": true, "helpfulness": "0/0", "author": "Rena Mae"}, {"rating": 4.0, "review": "Tweets out sometimes. Not sure if it's my iPhone app or the unit itself. When it works (4/5 times - hence the star rating) it does a fine job of casting to my TV.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "I bought this to use in the bedroom since that tv doesn't have the capability of having the Netflix app on the tv itself. I run it through the Iphone and it seems to work good so far.", "verified": true, "helpfulness": "0/0", "author": "MMCher \"M\""}, {"rating": 5.0, "review": "Took some time to figure it out but it was worth it", "verified": true, "helpfulness": "0/0", "author": "bill masiarik"}, {"rating": 5.0, "review": "Love this thing!  Streaming videos from phone to tv super easy!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]