[{"rating": 5.0, "review": "The first time I set it up I had a little issue from my Chromebook and Note 3. So I did it from my laptop and now when I move it in between tvs it is a breeze. I had a Android stick which was like a tablet but I really did not like how we had to use the screen on my phone to move the mouse arrow. The chromecast does less but does exactly what I need. I stream from my chrome browser, netflix , Youtube, Google Play Music and thats pretty much all I need. Worth every penny. No need for Roku any more. I will probably buy three more.", "verified": true, "helpfulness": "0/0", "author": "Bigchrome"}, {"rating": 5.0, "review": "Great little device. I was watching YouTube and Netflix on my Wii. Dragging speakers around the house to listen to Pandora. Now I've plugged this thing in, it has integrated my media apps with the TV. $35 and done. Often when friends and I watch movies, it starts conversations about things on YouTube like (HISHE) and we can quickly jump to YouTube (in HD) on the TV.I did have some signal issues with the wifi (goes through several walls at angles and the TV blocks), but I used the 3\"  extension cord they provide and I'm set.", "verified": true, "helpfulness": "0/0", "author": "Nik"}, {"rating": 4.0, "review": "I love this thing.  How much better than \"plug it in and use it\" can you get?  And the price is definitely right compared to other products.  We have primarily used it for Netflix so far.  Smooth and responsive.  It also allows you to push your Chrome browser onto your device.  I have used that to watch Funny Or Die on my TV when I was too lazy to go to the computer!  That is a little jumpy, but I think its still in beta.  I wish there were more services/apps that were Chromecast-compatible, but I think that's just a matter of time.  If Chromecast was forever limited to what it has not I would be a little disappointed...but only a little.", "verified": true, "helpfulness": "0/0", "author": "Rancheros"}, {"rating": 4.0, "review": "It does work well if you have the latest software.  Don't try to use it with old versions.  Works great from iphone 5.", "verified": true, "helpfulness": "0/0", "author": "Walter Zagieboylo"}, {"rating": 1.0, "review": "it will work for 10 to 15 minutes and then stop. it will not restart unless you log back on to the system", "verified": true, "helpfulness": "1/2", "author": "John Francis"}, {"rating": 4.0, "review": "Convienent for what its worth.  If you already have Netflix, use Youtube and Android a lot, it's a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Olecusz23"}, {"rating": 5.0, "review": "Amazing little media device! I love being able to cast video from my phone, computer or tablet to the entertainment center. When I first hooked it up, family was around, and we watched a bunch of videos.If you use Android, it's great to be able to make a cue of many vid on YouTube that will just keep playing.", "verified": true, "helpfulness": "0/0", "author": "Judson Bartels \"MySoundChurch.com\""}, {"rating": 4.0, "review": "The product works, it was very simple to setup. However, what affected the performance between the device, is the adsl speed. Consider a high speed connection. Then the streaming should fly!!", "verified": true, "helpfulness": "0/0", "author": "Kostas Piperis"}, {"rating": 1.0, "review": "I purchased this solely based on their description to view whatever I was watching on my computer could be \"cast\" to the TV screen. Not so! The channel my video is on was not recognized by the Chromecast. it would cast other videos just not the ones I want.", "verified": true, "helpfulness": "0/0", "author": "cb"}, {"rating": 5.0, "review": "Now when there is nothing to watch on TV, just find what you like on Netflix or YouTube and enjoy, great product, well made", "verified": true, "helpfulness": "0/0", "author": "Naeem"}]