[{"rating": 5.0, "review": "Its great for watching netflix and hulu. i will say that if your sending movies form a computer through the Chrome browser it requires to play it on the screen and on the tv. This slows my computer way down if i try to do other things on it at the same time.", "verified": true, "helpfulness": "0/0", "author": "Kl3mta3"}, {"rating": 3.0, "review": "It took me awhile to figure out how to use this gizmo, but it works OK.  Somehow I got the impression that I could watch everything from my computer, like Facebook, e-mail and MSN and Yahoo News on the TV. This turned out not to be true. Programs have to have a special app to be compatible. I read that there are many more apps to come, but if they are anything like those they currently have available, they can keep them. So far, I can only watch YouTube. We'll see what the future brings.", "verified": true, "helpfulness": "0/0", "author": "Wise Man \"flawed classic\""}, {"rating": 5.0, "review": "Works just like I spected, faster with google apps little slow with others but does the job, and the quality to the screen is really good.", "verified": true, "helpfulness": "0/0", "author": "Cesar Avilez"}, {"rating": 5.0, "review": "Works well and very easy to connect.  Make sure your TV has an HDMI and a USB port.  If not, you can use HDMI and the power supply cord.It is controlled using your phone via a chromecast app and it still has very few apps that work with it but I can see potential for bigger things.  I currently does not mirror your phone.  It just gives you a new button on apps like YouTube, Netflix, Vevo, Pandora, to cast to your TV.  Your phone must also be on your home wifi network as well as the chromecast.", "verified": true, "helpfulness": "1/1", "author": "Ski"}, {"rating": 5.0, "review": "Hope to see more apps added to this hardware. for the time being anything i want to use on my tv i put it into google chrome and \"cast this tab\"", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 4.0, "review": "The price on offer was good. Easy to install and performs well most of the time. The list of apps is good. sometimes it is difficult to connect specially with Avia.", "verified": true, "helpfulness": "0/0", "author": "M. Abdullatif"}, {"rating": 1.0, "review": "I can't get it to work with my laptop and I'm an advanced computer user.  But my network set-up is complex, too.  \"Customer support\" consists of pointing you to some FAQ's you've probably already read before you contact them.  Absolutely zero in their email response addressing my specific issues.  Sent a second email asking again for specific answers and was flat told they had none.  Glad it was so cheap -- I don't feel cheated quite so much.", "verified": true, "helpfulness": "0/0", "author": "Sandshark"}, {"rating": 5.0, "review": "This is an awesome item to purchase for yourself or as a gift!  We've taken in on vacation several times since our purchase and had no problems using it.  Very much worth the money!!", "verified": true, "helpfulness": "0/0", "author": "Andrea W. Mesplay"}, {"rating": 5.0, "review": "It was very easy to setup up and works very well.  We cast stuff from our iphones, android phones and laptops without any trouble.", "verified": true, "helpfulness": "0/0", "author": "J. Hart"}, {"rating": 3.0, "review": "I have a couple of BlueRay players with apps, and a ROKU that I use for streaming over the internet and from my Media Player.  One of these days, I'm going to cut the cord.", "verified": true, "helpfulness": "0/0", "author": "Jean Turpin"}]