[{"rating": 1.0, "review": "Chromecast is for tech savvy people. I find it hard to use.  I didn't realize that when I purchased it.", "verified": true, "helpfulness": "1/1", "author": "Dawkevjon"}, {"rating": 5.0, "review": "I love this for watching movies off Netflix...I don't have cable so this is a great option to have and I have it on both my tvs", "verified": true, "helpfulness": "0/0", "author": "Melinda Thibault"}, {"rating": 5.0, "review": "easy to install but not that easy for operating if you're not familiar with technology. If you enjoy movies in your notebook chromecast is for you.", "verified": true, "helpfulness": "0/0", "author": "Renato Falconi"}, {"rating": 5.0, "review": "I can't figure out what the difference is between this product (which is priced so reasonable) and the APPLE Streaming Media Player, which is so much more expensive", "verified": true, "helpfulness": "0/0", "author": "Mary C"}, {"rating": 3.0, "review": "I guess my expectations were too great or I haven't yet figured it all out.  I am able to get Netflix, Hula, etc., but I was able to get them with my Sony System.  As I learn more, I may be better satisfied.", "verified": true, "helpfulness": "0/0", "author": "Larry J Burge"}, {"rating": 5.0, "review": "I take back my last review. After only 2nd use the device no longer works. Very disappointed. will not recommend. I should have bought another roku.", "verified": true, "helpfulness": "0/0", "author": "franklin hoffmann"}, {"rating": 4.0, "review": "I like Chromecast as I can cast videos from youtube directly from my phone/tablet. But casting from Chrome browser does not synchronize properly on the TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It has made streaming movies from Netflix a very simple process. I used to connect with an HDMI  wire. Now all I have to do is wirelessly stream it from my computer directly to my TV.  It Like Magic.", "verified": true, "helpfulness": "0/0", "author": "Ron Griffith"}, {"rating": 1.0, "review": "I couldn't get this to work - looked on line and followed the instructions.  Still it won't work - couldn't find a phone number to call and after having a friend try to help gave up and returned the item.  I'm normally pretty good with technology but it wasn't as easy as plug and play like the instructions said - so I'll wait a little longer until they can make it easier.  Lucky my computer screen is 20 in so I can handle watching from my computer if I have to.", "verified": true, "helpfulness": "0/0", "author": "Amy Griswold"}, {"rating": 5.0, "review": "I love this device.  What I use it for most is streaming my own movie files onto my 60 inch plasma using the chrome extension. I can't believe this 30 dollar device works so well", "verified": true, "helpfulness": "0/0", "author": "A. G. Cynecki"}]