[{"rating": 2.0, "review": "The Chromecast is a wonderful device..... when it decides to work. There is nothing more frustrating than coming home from a long day at work only to have to \"troubleshoot\" and figure out why it's not working or connecting. I give it two stars because it is a nifty piece of equipment. But I do caution that it is not for everyone, and the hardware itself probably could be improved in many areas before it fully replaces traditional subscription-based cable and satellite alternatives.Pros -1) Connecting to Netflix, Hulu, etc. is seamless. I have been able to use the Chromecast to cut out my cable TV subscription.Cons1) No 5G wireless connectivity. This is not an issue in a single family home without a lot of competing interfering signals, but it is a small nightmare in an apartment. Given the amount of data a Chromecast consumes, this can be a big issue.2) Potential to fail - my 2nd Chromecast - which I barely used - just stopped working.  It would not connect to the network and was not recognized by any device (Android or IOS).I have experience in working with two separate Chromecasts in two different houses connected to two separate networks. I still believe it is a better alternative to cable or FIOS.  That being said, if you are not technically proficient or don't want to troubleshoot connectivity issues on a semi-regular basis, look elsewhere.", "verified": false, "helpfulness": "0/0", "author": "Richard Reid"}, {"rating": 5.0, "review": "Love it can stream videos from a tablet", "verified": true, "helpfulness": "0/0", "author": "R. F. Cwik"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Gonzalo Anuch"}, {"rating": 1.0, "review": "Has not worked in months", "verified": true, "helpfulness": "0/0", "author": "Tratanna Vernon"}, {"rating": 5.0, "review": "I was surprised at how easy it was to set up. Only been having for a short time, but it works just as described...", "verified": false, "helpfulness": "0/0", "author": "HSI"}, {"rating": 5.0, "review": "Absolutely worth the price. Easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Shenee Owens"}, {"rating": 3.0, "review": "Vẻ intermittant. Have to rết router all the time when I use it. Takes over network..??", "verified": true, "helpfulness": "0/0", "author": "Rick Wulfe"}, {"rating": 4.0, "review": "Perfect! So easy to just mirror my phone!", "verified": true, "helpfulness": "0/0", "author": "carmico"}, {"rating": 4.0, "review": "Over all a great product", "verified": true, "helpfulness": "0/0", "author": "David Kirk"}, {"rating": 1.0, "review": "It quit working after 1 month", "verified": true, "helpfulness": "0/0", "author": "Elizabeth R Stein"}]