[{"rating": 5.0, "review": "family and i really like the amazom fire tv.", "verified": true, "helpfulness": "0/0", "author": "Raymond B. Bedford"}, {"rating": 3.0, "review": "The unit works perfectly and I love all of the access. The remote eats batteries like there's no tomorrow. I found that I have to remove them after each use if I want them to still function the next day. Can't seem to find a way to complain about this! Thankfully, I have a smartphone that I obtained the app to replace the remote.", "verified": true, "helpfulness": "0/0", "author": "jack"}, {"rating": 5.0, "review": "I wish I had the ability to give this device more stars! The Fire TV is exactly what I anticipated plus much more. Not only does it support all the major streaming services, but Amazon's willingness to let the customers put other Android apps on the device via Sideloading makes the possibilities endless. Finally a streaming/media device that does everything I want it to, without having to find work-arounds (I'm looking at you cromecast). I'll be outfitting every TV in my house with a firestick.", "verified": false, "helpfulness": "0/0", "author": "Michael D Clark"}, {"rating": 5.0, "review": "unbelievable", "verified": true, "helpfulness": "0/0", "author": "FRANK STORINO"}, {"rating": 5.0, "review": "I had an Apple TV for years. Not only does the Fire TV do everything the Apple TV does (even airplay, with 3rd party software), it does everything I had wished the Apple TV had done. It is more powerful, had more storage, works well with others, and costs the same. As far as I can tell, it is the best digital TV app available. Don't look past this one.", "verified": true, "helpfulness": "0/0", "author": "Andrew B. Bolin"}, {"rating": 1.0, "review": "First off I loved Fire TV when it worked!  I got the Certified Refurbished model and was happy to get it cheaper than full price and much sooner than I would a new one. For the first week it was great.  Then we began having to reset (unplug it) due to losing connect with the wifi.  Over the span of 3 weeks the  length of time a video would play without restarting became shorter and shorter. Now as soon as I try to start a video it loses connection.This is why I don't believe this is a wifi issue:1.  It is closer to the modem than anything else in the house using wifi.2.  This is happening even when nothing else is using wifi at the same time.3.  My son plays online gaming with no problems while i play Amazon movies on my Wii Game system in another room at the same time. (both further away from the modem.)I went online to request an exchange and was immediately called by a tech, who by the way English was not his first language! Ugh!  After problem solving for several minutes with him he determined an engineer would need to look in to my problem & he would email or call me 24-48 hours.  That was a week ago and no one has called or emailed me back.  Obviously Amazon does not want it's customers to call since they don't provide a phone#.  Not even a call back number on their own products? Really?  None of the online Videos addressed this issue. I needed a live person to help me or send out a replacement!  Buying the refurbished product seemed like a good idea.  I was under the impression it would like new. Now  I'm thinking this product was returned due to the same problem I an experiencing , OR the customer received bad or no customer service.  Either way it was not the great deal I thought it was.I loved the product but as a very loyal Amazon Customer, I'm very disappointed.  I am really surprised since this is an Amazon Product.Even with all I've mentioned, Fire TV is awesome and I still want a working unit.  But I'm returning this one!", "verified": true, "helpfulness": "2/4", "author": "Ronda M"}, {"rating": 5.0, "review": "love, love, love our fire tv. Will likely buy another for our 2nd TV.", "verified": true, "helpfulness": "0/0", "author": "Joseph H."}, {"rating": 5.0, "review": "very easy to set up and use, everything you need for entertainment on your tv", "verified": true, "helpfulness": "0/0", "author": "Gary Savary"}, {"rating": 5.0, "review": "I've been using my laptop to stream movies which got old fast as I had to keep moving my laptop when I wanted to use it for things other than movies. I saw this, read the reviews and gave it a try....wish I had done it sooner. The box is small and powerful, the control is small and easy to use. It appears the issue with prime movies being a stand alone has been resolved. This is the best buy I'll make all year!!!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Buffarilla"}, {"rating": 2.0, "review": "We are on our second unit. The first unit's remote went through a set of batteries every night. Returned it to Best Buy and now the second unit will not turn off. Amazon is currently trying to figure out why it won't shut off.", "verified": false, "helpfulness": "0/2", "author": "Patrick L. Blythe \"Big Daddy\""}]