[{"rating": 1.0, "review": "Does nothing but say \"ready to cast\" All connections are right. Video's available and youtube but nothing shows on my TV. A piece of junk nicely packaged.", "verified": true, "helpfulness": "4/6", "author": "Higrade"}, {"rating": 5.0, "review": "The Chromecast works exactly as promised. It streams Netflix, YouTube and Pandora. More options will likely be added. Then it will be even more valuable.", "verified": true, "helpfulness": "1/1", "author": "Technophile"}, {"rating": 3.0, "review": "I like the device but if keep using it there are some annoyances,- I dont see TVQueue feature for youtube.com in browser (very annoying after got used to it in app)- For me I need to unplug and plugin back in order to be detected in apps/browser. I dont find time to look more (may be a firewall issue but why it looses the connection from other devices after some idle time, chromecast itself says connected fine.)- Their help site is a joke. all they have is shiny videos and content about basic product. I doubt google is very serious about this product either (like GTV)", "verified": true, "helpfulness": "0/0", "author": "V. kantamaneni \"Venki\""}, {"rating": 5.0, "review": "Pros:Makes it easy to view youtube and music on the TVresponsivehigh definitioncan control it from every devicePrice (compared to a WiDi adapter or a Roku Box)Cons:Slow desktop casting", "verified": true, "helpfulness": "0/0", "author": "Zayd"}, {"rating": 5.0, "review": "This work fantastically with Netflix. I was forever trying to find a way to watch Netflix on my television without paying $100 for Roku. This is defiantly worth the money.", "verified": true, "helpfulness": "0/0", "author": "Ian"}, {"rating": 1.0, "review": "Purchased this on black friday, very disappointed.  Sadly, the google chromecast sucks.  Casts a chrome tab for two seconds.  Casts netflix with poor video quality and no audio for about 2 minutes.  I checked the router compatibility, mine is on the list.  The router is about 6 feet away from the dongle - xbox 360 and apple tv work fine.  Will be returning this on Monday.", "verified": false, "helpfulness": "1/7", "author": "Chris"}, {"rating": 3.0, "review": "meh. the quality is not as good as using a cable because netflix lags A LOT (even on my wifi which is usually very fast) however steup is very easy and it does exactly what it is advertised to do.", "verified": true, "helpfulness": "1/1", "author": "dazzle"}, {"rating": 4.0, "review": "Overall I'm actually QUITE IMPRESSED,especially for the cost. The options are just a bit disappointing for the lack of them. For Netflix, Google Play & (I guess) Hulu it works quite well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Capn Jack\""}, {"rating": 5.0, "review": "I just installed the Google Chromecast and it is working great.  I can stream movies and tv programs directly from my Google Nexus 7.  Installation was a breeze and everything went according to the directions.  I can also watch movies that I recorded to my Nexus 7 with no problem.  I am very pleased with this product.", "verified": false, "helpfulness": "1/1", "author": "Dale J. Martiny"}, {"rating": 1.0, "review": "The set up was suppose to be fast and easy. Well, suppose to be! It's freaking NOT. After endless attempt that took over 50 minutes it the computer and ipad finally found the chromecast. Praise The Lord!!! If only the configuration was stable, I wouldn't be writing this review, but it lasted exactly two bourse and 37 minutes! The ipad and computer lost the chromecast. Well, I'm on the hunt for this illusive chromecast. This time it took me \"only\" 42 minutes to reinstall the file that finds this chromecast and to find it. Well, if it only ended there, I wouldn't be here, right? Wrong! The following morning I got lost all connection with the chromecast. Lets roll up our sleeves and hunt this device's signal again. This time it took over an hour, but by noon I already lost all connectivity with the chromecast again.At this point I realized that this technology is a piece of junk and returned it back to the box and shipped it back to Amazon. Maybe it's adolescence issues, maybe it's just not ready for the public yet. Either way, there are better products out there that work much better and are stable. Thanks but no thanks, google.", "verified": true, "helpfulness": "4/8", "author": "Greer Aviv"}]