[{"rating": 4.0, "review": "I purchased this for a 2nd tv.  It is identical to my first tv which has a Roku 3 attached.Plus:- Price.- Youtube.- Phone integration.  Roku 3 has a phone app but the integration of the Chromecast with other phone apps (netflix, youtube, google music) was much better than having to use a separate app.  This is definitely the right way to go.- Powers off with your tv if you hook its power to the tv's usb connection.Minus:- Inferior wifi reception.  I switched between the Roku in the exact same spot and same tv.  The Roku got great reception.  The Chromecast reception was a notch down.  This showed up in Netflix by the video frequently stopping while it waited to download.  I solved this by upgrading to a newer Wifi router and the problem went away.- No remote control.Overall, I would purchase the Chromecast over the Roku 3. The wifi wasn't a big issue for me as I needed to upgrade my router anyway.I value the better phone integration over having a remote.  Who needs an extra thing you're looking for in the cracks of the sofa.  My personal preference is for my phone to be the center of my media.Finally, I'm a cheap a*s and I don't see any reason to pay 2-3x to solve the same problem.Final answer is this is a very elegant solution to getting content onto my tv.  I think google will own tv access with this architecture, so many of these are being sold that much more content will rapidly become available (personally though netflix+youtube give me everything I need, but Netflix better be ready for youtube to one day knock it out).", "verified": true, "helpfulness": "0/0", "author": "R. Singer"}, {"rating": 2.0, "review": "Chrome can only project what is on the browser, so if you have an Excel sheet, you want to show to the audience, you are better off using Apple TV airplay.  Chromecast works well only with the browser projections, it does so very well.  If I can for 100 dollars project everything on the computer and more with Apple TV, I think Apple TV is a better buy than the Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Harshad Wadhar \"compgeekmd\""}, {"rating": 3.0, "review": "I choose this rating because this product is still very new.  If they add other features then it might rock, but til they do, it's not better than apple TV nor it will replace it anytime soon.", "verified": true, "helpfulness": "0/2", "author": "Abraham Fernandez \"Fern\""}, {"rating": 2.0, "review": "I like this only if you are doing short videos. The  item overheats and then the quality suffers because the stream slows down and even stops. I will keep it for now. Its a great idea but would have liked it to be heat resistant. I love that you can stream from google chrome. I get to see my shows. Movies are another issue.", "verified": true, "helpfulness": "0/0", "author": "Oswaldo Garcia"}, {"rating": 5.0, "review": "Chromecast does everything I needed it too.  It's way easier to use than our now sold Roku and faster.  I know the applications are limited on Chromecast right now, but Netflix, Google Music and stream a tab from a Chrome browser on a computer does everything I need it to.", "verified": true, "helpfulness": "0/0", "author": "P. Farrell"}, {"rating": 4.0, "review": "I bought this because I have a new T,V, in my bedroom.  Unfortunately, it is not a smart T.V., which means it would not be able to pick up a a WiFi signal from my wireless router downstairs. I thought this was a logical solution to being able to view movies on Netflix and get my e mails upstairs.  I guess I must have misunderstood the applications this little device handles.  As far as I can tell, you can't surf the internet, but you can get streaming video from Netflix.  So, I get to watch the movies and shows I want, but dont' get the rest of the other stuff I would have liked.  I'm hoping that in future Googlel will be able to update the software on this device so I can get the full functionality I wanted.  But really, for just $35 it really is still a very good deal for those of us who like ot binge-watch shows.", "verified": true, "helpfulness": "0/1", "author": "LuAnn Di Paglia"}, {"rating": 4.0, "review": "Almost plug and play, very easy to install.  Nice image.I hope more and more apps work with it soon.  It would be really nice to cast photos from my phone, tablet and/or laptop to the TV.Keep working please", "verified": true, "helpfulness": "0/0", "author": "Orozco"}, {"rating": 3.0, "review": "Very limited application support and generally works okay. When streaming, the mobile device used to initiate the stream loses it's connection so you can't control video playback. Maybe a few more releases and it'll be ready for prime time.", "verified": true, "helpfulness": "0/0", "author": "RichardM \"RM in AK\""}, {"rating": 4.0, "review": "Works great with Netflix and YouTube .  Disappointed I can't use to stream movies from amazon or kindle.  I would use a lot  more .", "verified": true, "helpfulness": "0/0", "author": "Serd"}, {"rating": 5.0, "review": "no problems streaming netflix & youtube to big screen. Took less than 4 mins to set it up! no lag, no delay!!", "verified": true, "helpfulness": "0/0", "author": "Kenny Le"}]