[{"rating": 5.0, "review": "We are loving it!  This was a great family gift.  We can watch TV shows, movies, or listen to music.  Games can be played on it as well but we are too wrapped up in the TV shows, movies, and music to look any further.", "verified": true, "helpfulness": "1/1", "author": "Terri Gorsulowsky"}, {"rating": 4.0, "review": "Useful. I like the search by voice feature. Using the manual menu is a little more cumbersome than Roku.  I am disappointed that I have been unable to get Plex to recognize / find the Amazon Fire device for steaming from files on my PC but other than that it works fine.", "verified": true, "helpfulness": "0/0", "author": "Cyberwiz \"Cyberwiz\""}, {"rating": 5.0, "review": "So much better than cable because with a fire stick you can fling local tv from your computer and with this you can just ask your TV, I am not kidding, to find you any show. Just press the button and say the name of any show, actress, or movie.....and there it is.", "verified": true, "helpfulness": "1/1", "author": "Diana R. Clement \"Dog Hound\""}, {"rating": 5.0, "review": "I love this this product.  They have now come out with a smaller version with the USB stick but I am still loving mine.  The five stars I am giving it should say it all. I just finished watching the entire four seasons of Downtown Abbey.", "verified": true, "helpfulness": "0/0", "author": "karen andersen"}, {"rating": 4.0, "review": "I love it. I am a long time user of streaming media servers, and have purchased many different brands. The Amazon Fire TV box just took over first place. The screen saver is beautiful high definition images,  and is enjoyable to watch. It has never had to buffer, and I absolutely love the voice search. Roku3 now moves down to 2nd place.*After further use, I am giving this item 4 stars, (instead of the 5 I gave it earlier). The biggest improvement would be for the usb in the device to actually do something. The Roku has a media streamer built in that works, and it turns out that the usb port built in the Fire TV device is non functional at present. So all things considered, Amazon Fire Tv is a great streamer, but could be better with a little work.", "verified": true, "helpfulness": "0/0", "author": "JOSEPH DILLEY"}, {"rating": 4.0, "review": "Great little unit. Was a Roku fan and owner but this Fire TV is faster and the picture is much better. The only problem I'm having is with Netflix. I Don't work on my new Fire TV by Amazon. They told me they are working on the App but other reviews have this going on for over two months. I hate to return it over one App problem. I like Netflix. That's the reason for only three stars.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "Happy with the device. Streaming and Switching between application menu is pretty quick", "verified": true, "helpfulness": "0/0", "author": "Javed Shaikh"}, {"rating": 2.0, "review": "I want to like this device.  The voice command is awesome and surprisingly precise.  The build quality is excellent - the box feels substantial.  It has a small footprint.  Music streaming is terrific.BUT, I have experienced regular streaming issues - the spinning circle of death.  Amazon customer service, while unfailingly prompt and courteous, tells me it's my internet connection.  Problem is my Roku box which is in the same location and using the same WiFi works just fine.  It's gotten to the point where I don't even bother trying to use my Fire TV for anything but music, which has yet to fail me.A real shame.  I'm an Amazon fan in general and think the Fire TV in particular had great potential.  I guess no one gets a hit  every time at bat.", "verified": true, "helpfulness": "0/1", "author": "The Shadow"}, {"rating": 5.0, "review": "The only is I paid 99.00 for it and the next day you all drop it down to 79.00 I sure would like to get that 20.00 off.", "verified": true, "helpfulness": "0/3", "author": "myra"}, {"rating": 5.0, "review": "Responsive to the voice, you just have to remember to hold the button when you are speaking to the remote.  Great search feature!", "verified": true, "helpfulness": "0/0", "author": "Craftsman Joe \"JOE\""}]