[{"rating": 5.0, "review": "Cant go wrong with this", "verified": true, "helpfulness": "0/0", "author": "bargainproducts0"}, {"rating": 5.0, "review": "My favorite Media streamer.  Easy to set up, and if you have a smart phone or tablet your set.  You can even use a kindle fire with it depending on the app.  Netflix and Pandora work I know that.  I use an app called Allcast to even cast local videos off my network to it!  Only con is the lack of 5ghz wifi.  Come on Google, time to release a Chromecast 2.0 with 5ghz wifi!", "verified": true, "helpfulness": "0/0", "author": "Cory D. Wilson"}, {"rating": 5.0, "review": "only one word could describe this product \"amazing\".", "verified": true, "helpfulness": "0/0", "author": "AbdelHameed"}, {"rating": 5.0, "review": "Flawless", "verified": true, "helpfulness": "0/0", "author": "Emily Re"}, {"rating": 5.0, "review": "Easy to hook up & use, love it.", "verified": true, "helpfulness": "0/0", "author": "Janner"}, {"rating": 5.0, "review": "great product.. expect more updates", "verified": true, "helpfulness": "0/0", "author": "Vinuraj P K"}, {"rating": 4.0, "review": "A little inconvenient with the iPhone--Apple TV is a much better fit.", "verified": true, "helpfulness": "0/0", "author": "David Anthony Nathan Rothschild"}, {"rating": 1.0, "review": "I have the Asus RT-AC66U wireless router.  It's not on the 'accepted' list from Chromecast (although the AC68U is) and after updating my firmware, 20 minutes with Google, 40 minutes with ASUS and 2 hours on the internet this was returned.  Google told me what settings needed to be enabled and disabled and even after we (me and the ASUS rep) went through them all it didn't work with multiple reboots.Save yourself the hassle...unless your router is on the list, don't get this.Here is the list https://support.google.com/chromecast/table/3477832?hl=en", "verified": false, "helpfulness": "0/0", "author": "Michael A"}, {"rating": 5.0, "review": "No more HDMI cables!!!!", "verified": true, "helpfulness": "0/0", "author": "C. Rubio \"Cyn\""}, {"rating": 5.0, "review": "Changed the way we have our entire home setup.  These allow for wire free media entertainment to all out TV's in the house from music, to videos, to games and movies.  Easy to use and new applications and support coming out all the time.  Plus, when not in use, the pictures, weather and time are a nice addition.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}]