[{"rating": 4.0, "review": "DirecTV customers might want to think twice on the box , Showtime and History Channel have no support for you , hbo go is non existent and if it comes out probably wont support directv as well...Dolby Digital 5.1 users beware , this unit only supports Dolby plus and will NOT downconvert to 5.1 over hdmi ! you have to use the optical out. what does this mean ? well it means if you have an older receiver your not gonna get surround sound. Both the Roku3 and Amazon Fire tv will not give me 5.1 on my older receiver but appletv and my ps3 do .... other people have complained about this and its still not fixed. the only cure is to turn off dolby plus and settle for stereo or buy a newer receiver that supports dolby plus. dolby plus is suppose to carry the 5.1 stream but its clearly not being passed properly to the hdmi....I did add the Plex app which made the unit more functional on my network. The video looked great. Speed felt great. I wish they would add a user home screen with just the apps I want to see to clear some clutter....", "verified": true, "helpfulness": "3/3", "author": "John Hillestad"}, {"rating": 2.0, "review": "sent it back!  I bought this for one of our other TVs and it works well except I cannot use the Showtime app!  How lame is that?  I also have Apple TV and I can use any app they have on it. This needs to be fixed.", "verified": true, "helpfulness": "2/2", "author": "Hector Zumwalt"}, {"rating": 5.0, "review": "(2 Days with it). What I don't like is how Amazon has made it so the\"Prime\" content is mixed with the \"For Pay\" content, with no easy way to just see what is ONLY \"Prime\" content. This is obviously made to divert you into buying more non Prime content...Amazon, please give us a CLEAR way to view \"Prime Only\" if that's what we want. I know we can voice search for anything... and that's great, but sometimes we just want to \"Go Fishing\" and would like to fish in the \"Prime\" pond only. This is a pretty big deal when you compare this to competing (Think ROKU) products that let you do just that.Hard to believe your competition does a better job with presenting your own content than you do. Maybe an update in the near future will \"Fix\" this.", "verified": false, "helpfulness": "2/5", "author": "DAVID \"P\""}, {"rating": 2.0, "review": "Parental controls did not have expected functionality.  For instance, there is no way to set rating restrictions on amazon prime content.  FreeTime app works well for time limits but does not integrate well with Amazon Prime.  I wanted to set up free time so my child could watch only Amazon Prime content that was rated PG-13 or under and TV-14 or under.  I could not find any way to do this.  This seams like extremely basic parental control functionality that should be available.", "verified": true, "helpfulness": "1/2", "author": "Andrew F. Thompson"}, {"rating": 5.0, "review": "Fredmeyers", "verified": false, "helpfulness": "0/1", "author": "robert c bowker"}, {"rating": 5.0, "review": "this thing is awesome.", "verified": true, "helpfulness": "0/0", "author": "Brandon R Calhoun"}, {"rating": 5.0, "review": "Everything and more I expected!", "verified": true, "helpfulness": "0/0", "author": "Manuel Chavez"}, {"rating": 4.0, "review": "I wish it had a volume control", "verified": true, "helpfulness": "0/0", "author": "stan1137"}, {"rating": 4.0, "review": "Quick and easy to find the movie we are wanting to see.", "verified": true, "helpfulness": "0/0", "author": "Glen & Sue Prator"}, {"rating": 5.0, "review": "5 Stars so far. I bought this Fire TV  to replace a ROKU that would freeze and reboot while watching shows. Very aggravating. It is obvious that the Fire is a superior product by the speed at which it responds to commands. The interface is simple, the voice control works very well and even though  I didn't think I would like it, it is much faster than clicking on a virtual keyboard. It has yet to freeze or work unexpectedly. So if it lasts and continues to work flawlessly I will continue to give it five stars.", "verified": true, "helpfulness": "1/1", "author": "Michael Haire"}]