[{"rating": 1.0, "review": "Absolute waste of money if your pushing video.  Tried to stream a movie from my surface to my tv and was COMPLETELY unwatchable.  Only used it the one time and never pulled it back out since.", "verified": true, "helpfulness": "0/2", "author": "The Truth"}, {"rating": 5.0, "review": "As expected", "verified": true, "helpfulness": "0/0", "author": "OnlyShopOnline"}, {"rating": 5.0, "review": "I love it I can see all my programs from my table or cellphone in my tv it works perfectly", "verified": true, "helpfulness": "0/0", "author": "carmen campos"}, {"rating": 5.0, "review": "When I get tired of Amazon Prime, Google Chromecast is a nice fall back for my viewing pleasure (though I have to admit that I still like Amazon Prime better than most of the apps on Chromecast).One of the advantages of Chromecast is that it takes up so little space.There are many apps, and there will be more becoming available as time passes.This device is a wonderful addition to my television, and you don't risk very much money to try it out.I recommend it to you so that you have additional resources for your daily viewing pleasure.John", "verified": true, "helpfulness": "0/0", "author": "John Williamson 2100 \"J.W.2100\""}, {"rating": 5.0, "review": "Works great I like being able to operate this unit from my cell or tablet.", "verified": true, "helpfulness": "0/0", "author": "squeakcln"}, {"rating": 4.0, "review": "I have to restart the Chromecast for the first use of everyday, a bit annoying but overall I love that my phone is the remote control which eliviates having to actually look for the tv remote.", "verified": true, "helpfulness": "0/0", "author": "Erin"}, {"rating": 5.0, "review": "excellent one! i can watch anything typed in chrome from computer!", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "Works great for me. I use it for Netflix, HBO Go, Youtube etc...", "verified": true, "helpfulness": "0/0", "author": "Lisa Gregory"}, {"rating": 5.0, "review": "I love this product. I have one up to my bedroom a second one in my shop, and will be purchasing a third one for when I travel. The days or nothing on TV are going. Anything you can watch on your phone or laptop or PC can now be watched Wireless  on TV. I love it.The days of nothing on tv are going. Anything you can watch on your phone or laptop or pc. One thing you do need to know about this product you need to know is much better to have wifi attached to your phone because it will kill your data Usage :-).", "verified": true, "helpfulness": "0/0", "author": "Amazon Mike"}, {"rating": 5.0, "review": "Great device, works fast and as I expected", "verified": true, "helpfulness": "0/1", "author": "Rich \"drawdy10\""}]