[{"rating": 2.0, "review": "I was very disappointed in this unit but in part that may have been due to my expectations which were not in keeping with the purpose of the Chromecast.  I was under the impression that what was on my computer screen could be seen on my television.  That is only true for streaming.  If you wanted to put a power point presentation or spreadsheet or other such info up for display to a group that is not what this unit is made for.  Good for streaming movies and UTUBE clips.Also, I kept loosing connection and my computer was within 3 foot of my router and television.  That was so frustrating I went and purchased a long HDMI cable which met all my needs and cost about the same.", "verified": true, "helpfulness": "0/0", "author": "Larry Amore"}, {"rating": 5.0, "review": "I love my Chromecast. My opinion of the device aligns really well with the review on TechSmash:http://techsmash.net/2014-chromecast-depth-review/", "verified": false, "helpfulness": "0/0", "author": "Curtis Wallen"}, {"rating": 2.0, "review": "I love the idea of being able to stream from your device straight to your TV without the hassle of cables. However, I don't feel like the Chromecast was fast enough to keep up with the speed of the videos I was trying to play. Maybe this will be a better device when it's improved in the future!", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "very very good", "verified": true, "helpfulness": "0/0", "author": "abdullah"}, {"rating": 4.0, "review": "When it work, it's great. It's on a TV ten feet from my wireless router, and it still doesn't work 100% of the time.", "verified": true, "helpfulness": "0/0", "author": "tom"}, {"rating": 5.0, "review": "Love it! Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Who needs cable with this device...I don't need cable anymore.", "verified": true, "helpfulness": "0/0", "author": "ear4music"}, {"rating": 4.0, "review": "I love it. It struggles on my network to broadcast any videos in tabs. There is quite a bit they could work on, but it is seamless in google music and youtube.", "verified": true, "helpfulness": "0/0", "author": "Tom-Q"}, {"rating": 5.0, "review": "Not much to say other than you should have one by now.", "verified": true, "helpfulness": "0/0", "author": "Portland79"}, {"rating": 1.0, "review": "probably not the fault of the device. I just have trouble with tech things.", "verified": true, "helpfulness": "0/2", "author": "Donna Jean Haunch"}]