[{"rating": 5.0, "review": "Love this little guy! I've had one since day one and it has never let me down. Each update gives it more to offer, and I have a feeling the best is still yet to come. Super easy to set up, interact, and execute functions. For the price you can't really do better...also, be on the lookout for the various deals they tend to offer with purchase such as Google Play credit, free trials of services, and gift cards.", "verified": true, "helpfulness": "0/0", "author": "Moozicmon"}, {"rating": 5.0, "review": "Love it!!!", "verified": false, "helpfulness": "0/0", "author": "Patricia Zelaya"}, {"rating": 2.0, "review": "It's alright for watching videos from your phone or some videos from the web, but it is not anywhere near as useful as it should be. Google is so wrapped up in Chrome that this caster isn't worth it. It doesn't work on any browser other than Chrome. You can't stream your own videos from your computer to it, which is a complete waste as the capability is clearly there. I'm sure it's due to \"Copyright\" BS, but if you're a creator, you can't watch your own videos. It's incompatible with Amazon Prime and numerous other streaming services.The cons definitely outweigh the pros. If you're a simpleton who wants to watch Netflix from Chrome, then by all means, get this, it works wonderfully. But if you get frustrated because companies want to tell you what you can and can't do and they know better than you how you use technology, get an HDMI cable. Then you can do what you want when you want. Chromecast isn't worth the price.", "verified": true, "helpfulness": "1/3", "author": "Kenny"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Astrid Desiree"}, {"rating": 4.0, "review": "It was a little difficult to get it connected.  I purchased this to stream from my computer.  It wouldn't work from my computer nor my smartphone.  Both of these were too old and wouldn't work. I finally purchased a tablet and now it is working fine.  There is a delay once you hit the connect to Chrome on screen button.  But all is well.  Side note:  Not all websites can be accessed via Chrome.  I have found that HGTV does work very well.", "verified": true, "helpfulness": "0/0", "author": "Survivorqueen"}, {"rating": 2.0, "review": "Items were delivered on December 20th and I have yet to get them working. Also, the TV advertising of the Chrome and Chromecast failed to show that the item has to be plugged into a wall socket. Also, there are no instructions with the item except to log onto a website (writing is in orange and very small. Had to use a magnifying glass to even read the information.).  Also, there is no information listed anywhere as to how long the item has to be plugged into a wall socket. It is obvious Google does not want any customers who are over 30. I have decided to shop in stores from now on.", "verified": true, "helpfulness": "2/3", "author": "Paul H. Price"}, {"rating": 4.0, "review": "I bought this for $31.50 ( inclusive of tax ) and am happy about the purchase.Despite having a smart led TV , I prefer to use chromecast for watching YouTube videos and other videos from Google chrome browser as it is easier for me(easier to search videos).It is definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Uma Chandrasekaran"}, {"rating": 5.0, "review": "Very good shipping and quality of item is great!", "verified": true, "helpfulness": "0/0", "author": "Trent"}, {"rating": 3.0, "review": "Very buggy....only Youtube seems to work well with this device, No other video file I play seems to work...Hopefully Google will fix this over time", "verified": true, "helpfulness": "0/1", "author": "sreenath"}, {"rating": 3.0, "review": "It's OK!", "verified": true, "helpfulness": "0/1", "author": "Tom D."}]