[{"rating": 5.0, "review": "Just what I hoped it would be like, really easy to use. Got on sale which made it even better!", "verified": true, "helpfulness": "0/0", "author": "momto2"}, {"rating": 5.0, "review": "Thank you very much, everything is fine! I love this thing. All worked very well. Thanks again. Recommend to everyone.", "verified": true, "helpfulness": "0/0", "author": "Oleg"}, {"rating": 4.0, "review": "Great for streaming.Probably needs more options to send video from tablets... Perhaps VLC could send video to the Chromecast?", "verified": true, "helpfulness": "0/0", "author": "Abraham Aguilar"}, {"rating": 1.0, "review": "I tried everything, including reading owners manual. I think I already had most of the downloadable programs thru my smart tv.So I can't give a high rating , but I'm sure a lot of buyers would really like this item", "verified": true, "helpfulness": "0/1", "author": "Stan Sklodowski"}, {"rating": 3.0, "review": "It works with  hulu and netflix just fine on my hp laptop and my  kindle fire HDX.  Havn't  been able to get it to work from chrome with the extension add on. Was surprised that it was a used one rather than new. But I don't plan on returning it.", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 3.0, "review": "I wanted to use this on my main TV a Toshiba 40\" that is a few years old.  The Chromecast would not recognize the HDMI at all.  When I connected it to a newer TV ( a cheap Haier) it worked fine.For $35 I can't really complain, but it is not quite as simple as Google makes it out to be.", "verified": true, "helpfulness": "0/1", "author": "JustAnotherTechnoweenie \"abused_commuter\""}, {"rating": 4.0, "review": "Great way to get television streamed to your tv, and I love that there are no wires that need to be plugged in other than what goes to the tv. It is very portable. The only downside is lack of apps. Roku has Chromecast beat on that front.", "verified": true, "helpfulness": "0/0", "author": "mary clark"}, {"rating": 4.0, "review": "I only use the Chromecast for Netflicks, and Pandora, buy these apps alone make it worth the money.  Would like to use it to mirror my tablet screen as well, and there are apps for that too.", "verified": true, "helpfulness": "0/0", "author": "John V. Mennucci"}, {"rating": 5.0, "review": "Love it. Works perfectly. Arrived fast. Works with my phone, iPad or computer. Really nice. I would definitely recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Shara E"}, {"rating": 5.0, "review": "notsure if I can stream movies and such from my tablet yet.....but it was purchased for son and he likes it.I did however watch a lifetime movie on my tablet thru youtube,but im wanting to watch a movie thru tablet in general,not sure bout that yet.", "verified": true, "helpfulness": "0/0", "author": "arin"}]