[{"rating": 5.0, "review": "I never get on sites and leave reviews. Just don't think about it really. That fact that I not only am leaving a review, but have also ordered a second one? That says allot about this device. I am extremely happy with the chrome cast and have recommended it to all my coworkers and friends.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Chrome cast is a great idea. But the only protection it has is your WiFi password and anyone can hack in and use your tv for what they want if they have your wifi they have your chromecast at there disposal. There should be a password protection on it", "verified": false, "helpfulness": "0/0", "author": "cameroon15"}, {"rating": 5.0, "review": "Works like a charm. I love it and my daughter loves it so I am going to get her one for her TV.", "verified": true, "helpfulness": "0/0", "author": "Marcus Mitchell"}, {"rating": 5.0, "review": "It is everything that I wanted it to be", "verified": true, "helpfulness": "0/0", "author": "Janiel Lopez"}, {"rating": 5.0, "review": "Chromecast makes streaming video much more convenient than using the built in apps on my TV. I can use my phone or tablet to browse and cat videos instead of using the TV remote.", "verified": true, "helpfulness": "0/0", "author": "omaha1280"}, {"rating": 5.0, "review": "Work great as always!!", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "no problems.", "verified": true, "helpfulness": "0/0", "author": "George W. Harris \"Scifi fan\""}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Bought one of these for myself and one for my son for Christmas.  Low and behold, on Christmas morning he had done the same thing.  I have thoroughly enjoyed mine.  Since I'm not a fan of any kind of sports, it's a godsend when I'd really rather watch something else than football.  Now if they would show us the halftime shows instead of a bunch of comments, predictions and utter nonsence, I might be enticed to watch football again.  I dearly love to see the bands.  Til then, I'll stick to my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Duchessmine \"Duchessmine\""}, {"rating": 1.0, "review": "Having a problem keeping connected, goes in and out watching a movie,very frustrating runs very hot, might be a bad one.  Not sure of the warranty and how long.", "verified": true, "helpfulness": "0/0", "author": "Sal gambe"}]