[{"rating": 5.0, "review": "LOVE LOVE LOVE this product!  We own more than one and have saved tons of money on our cable bill by no longer using a cable box in the bedrooms.  We have Chrome Cast in the bedrooms and can watch Netflix, Hulu, HBO and many other programs!  My cale bill was reduced by $30 a month (essentially the cost of 1 ChromeCast) by returning no longer needed cable boxes.", "verified": true, "helpfulness": "0/0", "author": "KTorres"}, {"rating": 5.0, "review": "So convenient to be able to pull up anything from my phone onto the TV! Setup was a breeze. I knew Netflix and Amazon Video would be great, but being able to throw a YouTube video up on the screen is nice!", "verified": true, "helpfulness": "0/0", "author": "Jason Costello"}, {"rating": 5.0, "review": "For the price this works great, with a laptop, iPod touch, and a older iPad.  The kids love having this on a spare tv for Netflix and playing music.  Small form factor and easy setup.", "verified": true, "helpfulness": "0/0", "author": "T. Moore"}, {"rating": 5.0, "review": "I can chrome cast from my android phone or my table. It is very easy and comfortable. I love use my TV as a radio with Pandora.", "verified": true, "helpfulness": "0/0", "author": "Carmen Betancourt"}, {"rating": 5.0, "review": "very good device.  is excellent for non smart tv to get streaming to ur tv.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "Good product.  Cheap and fast enough for the price.", "verified": true, "helpfulness": "0/0", "author": "ALONSO RODRIGUEZ A."}, {"rating": 5.0, "review": "Love it!  Works perfectly and as described.  Turns your regular flat screen into a smart tv instantly!", "verified": true, "helpfulness": "0/0", "author": "Barry"}, {"rating": 1.0, "review": "cost too much", "verified": true, "helpfulness": "0/4", "author": "Hillel Shemer"}, {"rating": 5.0, "review": "Just as advertised.  Pleased with results", "verified": true, "helpfulness": "0/0", "author": "T Brock"}, {"rating": 5.0, "review": "Set up is easy using the app from the playstore. You can mirror the entire screen for some devices such as the HTC M7, Nexus 5, Nexus 7 2013, Samsung Galaxy Note 3 and LG G Pro and a few others which I have not tested. For other devices you'll only be able to cast the compatible apps such as YouTube, Netfix and so on. You can even cast whatever you are doing on Google Chrome from your laptop. No more fiddling with cables. Goodbye Slimport", "verified": true, "helpfulness": "0/0", "author": "Dayton Harrison"}]