[{"rating": 1.0, "review": "I know many people have brand loyalty, but I am one that does not. That being said, I am impressed with the speed and usability of the new Amazon Fire TV. I cannot believe how seemless it operates, how small it is for what it does, and the sheer number of apps and even GAMES that it supports and plays! You can even hook up a bluetooth controller that is NOT made by Amazon, and it works wonderfully. This product is a must, especially if you are an Amazon Prime member. Wonderful buy, puts the Roku, Apple TV and Chromecast to shame. Wonderful!!!!!UPDATEI was blown away by the thing at first, but now its borderline unusable. Will not get my wifi signal without unplugging it and plugging it back in, then disconnecting the remembered wifi channel, and reconnecting. And even after all that, it still takes over a minute to connect.The UI is always very laggy, and does not respond to button pushes on the remote until 10-15 seconds later, making searches frustrating and painful. The box also does not have a switch or option to TURN IT OFF. Such a simple thing, why isn't it able to do even that? The more time goes by, the more I wish I could return this thing, but its out of date with amazon.", "verified": true, "helpfulness": "2/2", "author": "SGT Walter Fulmer"}, {"rating": 5.0, "review": "I've seen the competition at other peoples' houses, so I never thought that I'd ever stream TV/Movies. But when I finally joined Amazon Prime, it was a no-brainer to buy Fire TV. As a former software engineer of graphical user interfaces, this is by far the most impressive thing I've seen. It's fast and really easy to use. Ten-second skip forward or backward is a nice -- in a noisy house where you missed the dialog. Throw in speech-search capability and TONS of prime content to watch and Amazon's done it again. Nice job Amazon, great piece of hardware and great piece of software too!", "verified": true, "helpfulness": "0/0", "author": "Just Al"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "david kirchner"}, {"rating": 5.0, "review": "Absolutely love this devise for streaming content, Amazon TV, or Netflex easy to install and once it's installed the remote makes it easy to navigate..", "verified": true, "helpfulness": "0/0", "author": "Darrel"}, {"rating": 5.0, "review": "Best buy of the year. I'm an apple geek and the Fire TV destroys the Apple TV", "verified": true, "helpfulness": "0/0", "author": "Darin"}, {"rating": 5.0, "review": "The more I use it the more I like it.", "verified": true, "helpfulness": "0/0", "author": "charles h spaits jr"}, {"rating": 4.0, "review": "I'm still learning the ins and outs", "verified": true, "helpfulness": "0/0", "author": "AUGUST SPIER"}, {"rating": 1.0, "review": "FireTV was a HUGE DISAPPOINTMENTMAD CATZ makes the FireTV controller.... MAD CATZ also puts a Tegra 4 and Stock Android on their console, is faster, and allows you to obtain every app on the Google Play Store and enjoy future Android content for only $10.00 more....http://store.madcatz.com/home/?whence=", "verified": true, "helpfulness": "2/6", "author": "John Crittenden"}, {"rating": 5.0, "review": "We love our Amazon Fire TV!!!!  I hooked it up very easily and it's been working great for a few months now.  We've never had HBO or any of those special stations so we are catching up on lots of things and watch more on it than regular TV.  We were already Prime members and haven't paid to watch anything yet.", "verified": true, "helpfulness": "0/1", "author": "WineLover"}, {"rating": 5.0, "review": "This powerful little tv box is a life saver. I bought before moving to help battle rising cable prices. Now our basic cable isn't even working a week into our move. Enter my fire tv box! With Disney Jr. For my young son. Hulu and Netflix for me were doing great I can't wait to download games and enjoy the other awesome features such as free time that this box offers!", "verified": true, "helpfulness": "1/2", "author": "Jessica"}]