[{"rating": 5.0, "review": "Amazing and simple video streamer. Works great with Plex. Real easy to connect to home network and cast or stream to TV.", "verified": true, "helpfulness": "0/0", "author": "Stan Laudon"}, {"rating": 5.0, "review": "The Chromecast device is well worth the money just for $35 you don't have to worry about having cables all over the floor", "verified": true, "helpfulness": "0/0", "author": "Bruce Proctor"}, {"rating": 5.0, "review": "It is so simple however I would like it a little more user friendly with content from my own network. The price is right!", "verified": true, "helpfulness": "0/0", "author": "KJerome \"KJ\""}, {"rating": 4.0, "review": "It streams literally anything from your PC or mobile web device as long as you have a wireless network.  Only limitation is to use your device as the remote control, which can be quite an inconvenience if you don't like running back and forth between your laptop and the TV just to pause the movie.  But it can be solved with streaming from an iPhone or other mobile device to use as a remote, which I plan on getting real soon.  Aside from that, I don't feel the need to get a Roku or other player, since you can access any site and stream in a browsing tab.", "verified": true, "helpfulness": "1/1", "author": "70s Punk Fan"}, {"rating": 5.0, "review": "One of the best products I've ever bought on Amazon. Set up was super simple. You must have google play to download the app, so I could not do it from my kindle fire, but I was able to do it on my phone and once it was set up on my phone it allowed me to use my kindle. This is seriously worth the $35 you will spend. Allows you to stream Pandora as well as everything they listed. You can also use your device as usual, accessing web and apps without any disruption to your videos or music.", "verified": true, "helpfulness": "1/1", "author": "Sabrina S."}, {"rating": 1.0, "review": "I am usually very pleased with Google products, so when I heard of Chromecast I ordered two right away.  However, the Chromecast has been consistently disappointing.  I was very surprised at how little functionality is provided by this device.  It only works with a few sources, and even then, every three or four minutes it disconnects itself.  Often it must be unplugged or rebooted just to make it connect again.It performed so unreliably that we disconnected it.I am accustomed to receiving much better value from Google products.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product. Easy to use with laptop, Phone and IPad. Makes watching stuff online very easy and the sound and picture are great.", "verified": true, "helpfulness": "0/0", "author": "Scott Ritter"}, {"rating": 1.0, "review": "Didn't do what we had hoped (and been led to believe) it would do, sent it back. Love the Roku", "verified": true, "helpfulness": "1/6", "author": "Erika Stillson"}, {"rating": 5.0, "review": "I have been waiting a long time for this kind of thing. Until now I was just using a long HDMI cable to connect my computer to the tv in order to \"cast\" my desktop, tabs, or other things up there. This does that and more because it works with my iPhone, Kindle Fire, and Windows 7 computer.You should know that it does not work with my old Macbook Pro (it's a 2008) so I recommend checking the system requirements if you are not sure: [...]When I use it with the MacBook Pro, it works with things like YouTube and Netflix which are Chromecast compatible but when using it with a Chrome tab, it doesn't send any sound. (This is the same thing that happens when using an HDMI cable from the MacBook so I think it is something inherent in that generation of MacBooks and how sound output works.) The sound still comes out of the computer so a work around would be to use a wire from the headphone jack on the computer and connect it to the tv to get the sound to come out there.It works perfectly with my Windows 7 and with newer MacBooks and it is incredibly convenient to use. Also, not having to change anything to go from connecting my iPhone, Kindle Fire, tablet, computer... is really convenient, no wire to trip over.Also, I wondered about a power source before buying t so I'll let you know... it comes with a USB to mini-USB power cord and includes a plug for outlets as well. I have mine plugged into a power enabled USB port on my tv for convenience but if you don't have one available, you can put it into a wall socket.Set up was also really easy, just connecting it to Wifi using the computer, then it was all good to go. No changes or settings were needed for the tablets and phones to be able to connect because it all happens over the local Wifi network.Great stuff here and I'm looking forward to the growing number of applications that support it natively. For now, being able to send a Chrome tab to the tv, or cast netflix from my phone (instead of logging in with a video game system) is really convenient.", "verified": false, "helpfulness": "1/1", "author": "J. Ts"}, {"rating": 5.0, "review": "Fantastic! I literally unpacked this and in less than 30 minutes it was up and running and I was casting from Netflix. So much better than everyone squeezing around the laptop to watch things! Can't speak to casting from other sites and services, but I'm just looking to stream Netflix for now and it does this perfectly and easily!", "verified": true, "helpfulness": "0/0", "author": "Leslie A Pallotta"}]