[{"rating": 5.0, "review": "Wondeful and so simple to hook up and use! Way better then the Roku I had before! Couldn't be happier.", "verified": true, "helpfulness": "2/2", "author": "missfloyd14 \"Margaret E Andrews\""}, {"rating": 5.0, "review": "I love the Fire TV. It has a lot of shows and movies to watch and I look forward to even more apps that will be developed for it!", "verified": true, "helpfulness": "1/1", "author": "Brian E. Ritenbaugh"}, {"rating": 3.0, "review": "I didn't like the idea that only Amazon is on the voice activation.  Would love it if it would have a free with prime search separate from all searches. And it does cut out more then my wireless blue ray which is right next to this wireless device. But it does work and I wont return so I will give it the 3 stars as its okay mainly because it is easy.", "verified": false, "helpfulness": "0/4", "author": "maria cahill"}, {"rating": 4.0, "review": "very easy to hook up and get started.  component that you talk in to search works great. i wish there were more movies and shows for free on amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "This is a fabulous product for the technically challenge.  My family has a lot of gadgets.I bought the Amazon Fire for its simplicity.  It is nice to come home and with one clickI’m watching my favorite shows.  Thank you, Thank you", "verified": true, "helpfulness": "2/2", "author": "Beth"}, {"rating": 5.0, "review": "My Vizio HDTV is internet ready and I have been using it to watch Amazon Prime movies and Netflix among other apps. I was fed up with the buffering, re-buffering, lost of internet connectivity, out of sync programs, hiccups, and other annoyances, so I tried Fire TV.The specs were impressive, so I decided to give it a try. Performance was even better than I expected. Setup was very easy and only required entering a passkey for my router. I watched a movie. It started almost immediately and played smoothly. Voice control is a killer feature. it is definitely worth the price. I suspect newer smart HDTV's will start using this technology, but until then, the Amazon Fire TV is the way to go.", "verified": true, "helpfulness": "1/1", "author": "Shorian \"gadget guru\""}, {"rating": 4.0, "review": "Very great movie choice, my only down fall for this item is the amount of data watching a movie takes. I am having a problem finding a data/wireless network with unlimited access. If I had that I would be watching something at all times.", "verified": true, "helpfulness": "1/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon fire with its 2 gigabyte capacity solved my problem with buffering that happened on my previous device. It also accesses my Prime selection way faster than the device I replaced. Another big plus is the ease of use, especially voice command with the listen mode.", "verified": true, "helpfulness": "0/0", "author": "Fred Welsh"}, {"rating": 5.0, "review": "I dont need to know how it performs or works or even looks. I got it free. HA HA. thanks amazon!", "verified": true, "helpfulness": "1/10", "author": "kg"}, {"rating": 5.0, "review": "I was apprehensive to purchase the Amazon Fire TV, but took the plunge!  Am so glad I did!  It was as easy to set up as advertised, and even easier to use. I now have such an expansive library of television series and movies to watch, I may never have to watch cable tv again!  Next step...cancel cable?", "verified": true, "helpfulness": "1/1", "author": "Stephen F Taylor"}]