[{"rating": 5.0, "review": "Not perfect but it is the best media player that I have. After looking at various media player devices, I would pick the Fire TV over the Minix Neo X-8H, HP Chromebox and the Matricon G-Box and I am glad that I did. I have a Roku 3, Western Digital WD Live TV (connected to my movie collection hard drive), Playstation 3 (gaming), Panasonic blu-ray player (DVDs) and a Fire TV all connected to the same TV. None of them are perfect as they all have their pros and cons.Pros:Very responsive and quick.... you can tell it has a quad core processor.Lots of apps... Not as much as Roku but enough. Lets be real because most of the billion Roku apps are unnecessary. I have like 40 Roku apps but there are only a handful of apps that I actually use.Gaming.... Much better than Roku and WD Live TV. I will stick with my PS3 but it is nice to have the option.Android (xbmc and root capable).... Roku 3 lacks customization. This is what really separates Fire TV from the others. What many others are complaining about \"lack of\" such as USB storage support, more games/apps, HBO Go and internet browser, I actually have available on my Fire TV working fine.Cons:Cluttered Screen that is feeding too much Amazon content. Roku 3 is more organized and easier to navigate especially for apps outside of Amazon.Netflix dated user interface...... I don't have Prime but I do have Netflix. I am so happy with the netflix user interface on my Playstation 3 and Roku 3 as you get that large picture with the description of the movie/show. I was expecting the same nice netflix user interface on the Fire TV but that didn't happen. Why does Amazon skimp out and have the dated bad netflix user interface? We know why. Thank goodness the picture quality is good though. Lets hope they fix their netflix user interface.I am a fan of both the Roku 3 and the Fire TV but Fire TV's pros make up for it cons and that is why I give the edge to the Fire TV over the Roku 3. I would later buy another Fire TV for another room. If Amazon organized their home screen better BY INCLUDING OTHER APPS and updated their 2008 netflix user interface, it would put itself way above the competitors. To be fair though, the most recent used apps are available on the home screen. Right now, I would say the Amazon Fire TV deserves a 4.5 stars out of 5.Here is a tip.... The Logitech K400 keyboard with built-in touchpad works great with the fire tv. Lot of people and I didn't like the sleep mode taking 30 minutes and the fire tv not having an on/off button. It seems like a waste of electricity. The keyboard has a power button that immediately turns the fire tv either on or off in sleep mode.", "verified": true, "helpfulness": "5/5", "author": "BAH"}, {"rating": 4.0, "review": "which it connected with more websites", "verified": true, "helpfulness": "0/2", "author": "Cheryl Bledsaw"}, {"rating": 3.0, "review": "It works well enough, but the USB that can't read thumb drives really drives the value down. It also doesn't have much storage space, and since they upsold me on buying the game controller, I'd prefer that the system be able to hold one game (Walking Dead) and still run Netflix, but it couldn't seem to do that.", "verified": true, "helpfulness": "1/1", "author": "Matthew Wilding \"a jack of all things\""}, {"rating": 5.0, "review": "Amazon put a lot of thought into Fire Tv. It is the BEST streaming device available today. I have owned Roku, Chromecast, Apple Tv and Raspberry Pi. But nothing comes close to the Fire Tv experience. It is extremely fast. When I play anything on it, it starts playing instantly. When Amazon touts the ASAP feature, they are not blowing smoke. Fire Tv DOES start playing anything ASAP- instantly.Amazon designed the device in such a way that it does not get in the way of your entertainment. This is the same philosophy as the Kindle Papertwhite and Kindle. My Fire Tv simply blends in with my other entertainment devices and decor. It also has a very aesthetically pleasing design. I think Amazon deliberately designed it to be \"lost\" leaving you with your entertainment only.I am extremely satisfied with it. My experience with Amazon Fire Tv will be even better when Amazon brings Prime Music to it. I am already enjoying Amazon Music on my Fire Tv. But I am waiting for Prime Music on it.", "verified": true, "helpfulness": "0/0", "author": "ReviewerFromBR"}, {"rating": 5.0, "review": "I have been using a DVD player to access Amazon Prime and Netflix (mainly) and sometimes U-tube.  My wife and I just put up with the slow access, multiple re-bufferings, sound outs, and the like.  When I first heard of the Amazon FireTV, I reviewed it and then put it on my wish list.  Our son uses AppleTV and likes it; so I was torn between the two.  However, I kept coming back to look at the reviews on Amazon.com.  Finally I ordered the Amazon FireTV.  I couldn't be more satisfied with it.  It was easy to set up and worked perfectly out of the box.  No research or trying to understand installation instructions required.  The Amazon FireTV works as advertised.  What else can I say.  The only thing the caused some initial concern is that there is no way to switch it off when returning to cable TV.  I found out that it shuts off by itself after a short period of nonuse.  Problem solved.", "verified": true, "helpfulness": "1/1", "author": "Rogers, Arkansas"}, {"rating": 5.0, "review": "Love Amazon Fire.....Don't know what I ever did without it....", "verified": true, "helpfulness": "0/0", "author": "Connie Paul"}, {"rating": 1.0, "review": "I am experiencing a problem with connectivity. For days now I have not been able to get the product to work. It keeps saying that home and all the other categories are not available. I cannot find a way to talk to a tech person so I cannot use my system.", "verified": true, "helpfulness": "3/5", "author": "James Young"}, {"rating": 4.0, "review": "Out Fire TV has rendered our Apple TV the device that nobody remembers. It is the true spiritual successor to our now-departed PS3.The ONE annoyance is that I have to enter my PIN every time I want to watch a trailer or item available with Prime. These are free items; why do I need to verify my identity?The other inconvenience is the lack of a YouTube app. Pay Google whatever they're asking.The feature requests would be:1. Make voice search available to all apps. It works so well; let me search Netflix, or Crackle, or MLB/NBA with it!2. Get the updated Netflix UI, and hopefully a version tuned for the Fire TV so that it's even smoother while navigating.3. Again: get a YouTube app. I don't care what Google is holding you ransom for; pay it.Yeah, that's it. My needs are simple :-)", "verified": true, "helpfulness": "0/1", "author": "Oluseyi \"itinerant theoretician\""}, {"rating": 5.0, "review": "I love this tv!!!! We bought the Apple TV a few years ago and this one by far is better.", "verified": true, "helpfulness": "0/1", "author": "Nicole Farwell"}, {"rating": 5.0, "review": "Between the speed, the form factor, the selection of apps, and the clarity of the picture, this player is just awesome.I also have a kindle fire HDX, and while you can't control the Fire TV with it, you can mirror the screen pretty damn well.I just wish Showtime would get their stuff together and allow you to use all provider logins.  That's really the one thing holding this back.", "verified": true, "helpfulness": "1/1", "author": "kingcarlos"}]