[{"rating": 5.0, "review": "I was attracted to the Amazon Fire TV after I received a promotional email about the Fire Stick. After reading the reviews about the ease of the voice control on the Fire TV, I opted to try it. It is incredibly user-friendly and is so much better than scrolling through the alphabet to spell out requests. We have a vacation home too and the compact size of the device will be easy to take from place to place. We have only viewed a couple of documentaries but the reception so far has been perfect. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Flyfisher"}, {"rating": 3.0, "review": "need more mainstream prime movies and shows", "verified": true, "helpfulness": "0/1", "author": "Donnie Lunsford"}, {"rating": 5.0, "review": "Exceeded my expectations! I love it.  Especially the voice controlled remote.", "verified": true, "helpfulness": "0/0", "author": "Mark Jackson"}, {"rating": 5.0, "review": "My opinion is that this device is one of Amazon's best product next to the Kindle :-)", "verified": true, "helpfulness": "0/0", "author": "mizflud \"I love listening to stories, and I love to read. Before audio books I listened to my mom  read to me, and as I grew older my sisters  and I read stories to each other. On my Kindle Fire I enjoy reading along with the audio.  I have no favorite genre  as long  as the story is enjoyable and holds my attention.\""}, {"rating": 5.0, "review": "Captions on Instant Video! Hallelujah! I don't know why anyone would buy this new. It's been 9 months now, not a single issue other than an annoying tendency to watch entire series start to finish in single sittings. This thing will make you lose sleep. Highly recommend. Parents be advised: There are many Prime cartoons. Your child will only watch one. Forever. You've been warned.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very Glad I Cut my Cable TV.  REALLY HAPPY WITH THE Qualty and Fire TV visual and sound quality!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "blkftbear"}, {"rating": 1.0, "review": "Couldn't get any of the features to work.", "verified": true, "helpfulness": "0/1", "author": "Patrick Harvey"}, {"rating": 4.0, "review": "Like it so far, pretty good with Slingtv. The audio over Bluetooth is a nice and better than the wired one on the roku remote. The one knock is integration with Amazon content. My wife has a fire phone and saves pictures to the cloud. The prime account on the fire TV is associated with her account. She was  not pleased to see all her phone pics available ( sans passcode) to be played by anyone with the fire TV remote.I'm all for pushing amazon content to all devices IF one wants to but you should have the option to not push it to certain devices. I spoke to Amazon about this they said it should be an option but it's not an option now and who knows if they will implement it or not.Apparently, the persistent \"It's out of stock we don't know when, or if, it will be restocked is consistent with a new device being release.", "verified": false, "helpfulness": "0/0", "author": "gurest"}, {"rating": 5.0, "review": "Extremely easy to install and it has a very user friendly interface.", "verified": true, "helpfulness": "0/0", "author": "Norbert DeAmato"}, {"rating": 5.0, "review": "Love my Fire TV.  I use it everyday and it's so fast.  Will get another one soon.", "verified": true, "helpfulness": "0/0", "author": "Hao Van Nguyen"}]