[{"rating": 1.0, "review": "Too troublesome to use and not user friendly . Doesn't work with hardly anything and seems to slow down the whole system", "verified": true, "helpfulness": "0/2", "author": "david jackson"}, {"rating": 5.0, "review": "Bought it to watch Netflix on the big screen I Luv that I can plug it in to what ever HDTV I want to watch. I'm not stuck in one room.", "verified": true, "helpfulness": "0/0", "author": "Angie Hartness"}, {"rating": 4.0, "review": "This did just what it says it does and at a very good price, but without being able to get amazon prime movies it falls short. Ruko just came out with one like this, and it has a remote and let's you watch amazon prime. It's a little more expensive but less than Apple TV which is great.", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 3.0, "review": "I really wish I could use this, however, it is not compatible with 720p TVs which is a huge bummer.", "verified": true, "helpfulness": "0/0", "author": "Hawkins \"Biggs\""}, {"rating": 5.0, "review": "I purchased one for myself first from a big box store as it was definitely a impulse buy. Works wonderfully with both iPhone and android supported apps. I went ahead and made the plunge to send my mom one of these via mail. She was able to set it up herself and get it working with no problem. She uses Netflix now all the time. Great buy.", "verified": true, "helpfulness": "0/0", "author": "Christopher Padilla"}, {"rating": 5.0, "review": "this is a big hit.  i have an older tv and during our new year's eve party, my family was having fun with this prodct especially with all the dance videos on youtube.  controlling the chromecast on a tablet is better than hooking up my laptop to the tv.", "verified": true, "helpfulness": "0/0", "author": "Eric Papa"}, {"rating": 5.0, "review": "I love my Google Chromecast!!! Even though I'm an Apple user and can't stream my iTunes library or videos and pictures from iPhone there are many awesome ways to use the Chromecast. I have used it on a daily basis for about 3 months and it has worked exceptionally well. It does take some technical aptitude to set up and use to the best of its abilities. I listen to music on my tv through the Chromecast, and watch Netflix using my iPhone.  I also cast movies, purchased through the Google Play store on my Android tablet, onto my tv. It's also worth noting that since I purchased the Chromecast, for myself and 2 other people, they've released an update that expanded the apps that were able to cast to the Chromecast; furthermore I feel this is just the beginning to a fast growing development. Happy Casting!", "verified": true, "helpfulness": "0/0", "author": "Matt Coffman"}, {"rating": 5.0, "review": "Have lot of series and movies on my Mac. Worked well with Plex Media Server running on my iMac. But for it to work needed to get the Plex app from App Store for my iPhone.The app works like remote on the iPhone.", "verified": true, "helpfulness": "0/0", "author": "iNasir"}, {"rating": 2.0, "review": "Pros:-There's no cords running from your computer to the TV.-Installation and setup was pretty easy.Cons:-It only works 40% of the time.  A lot of time it's slow and can't stream in real-time.-It isn't compatible with Silverlight, which is what's used when we run Amazon Instant Video.", "verified": false, "helpfulness": "0/1", "author": "Ace"}, {"rating": 5.0, "review": "After years of struggling to get traction with Google TV, Google finally found its living-room hit: the remarkably priced $35 Chromecast.Google's streaming stick has been an instant hit and although it was rather limited at launch, the Chromecast has steadily improved, adding Hulu Plus, Pandora, Google Music, Plex, Vevo, and HBO Go since its debut. That's in addition to Netflix, YouTube and Google Movies & TV, making it a basic, but competent streamer -- especially for the price.However, the recent improvements still don't make the Chromecast my favorite budget streaming-video device. The Roku LT ($50) is just $15 more and offers up hundreds more channels, including prominent services like Amazon Instant, MLB.TV, Rdio, PBS, Vudu, Watch ESPN, and Watch Disney. Roku also has other niceties such as excellent cross-platform search and a true onscreen interface, which some will prefer over the Chromecast's smartphone/tablet-only control. It doesn't have the Chromecast's awesome-sounding screen-mirroring capability, but that feature doesn't work all that well in practice. The Chromecast is sure to catch up, especially with the recent release of the Google Cast Software Development Kit, but at the moment Roku still has the lead.The GoodThe Google Chromecast is a dirt-cheap wireless video dongle that streams Netflix, YouTube, Pandora, Google Music, Google Movies & TV, and HBO Go to your TV using Android or iOS tablets as remotes. Its small size hides neatly behind your TV and makes it easy to take with you when traveling.The BadThe beta screen-mirroring feature won't work as well as you want it to, so you're largely limited to the supported apps. The lack of a dedicated remote also means you always need a smartphone or tablet nearby. And for $15 more, you can get a Roku box with many more channels and an onscreen interface for a more traditional TV experience.The BottomLine Google's $35 Chromecast stick is a cheap and easy way to add streaming video and music to your TV, but it still isn't as fully featured as similarly priced Roku boxes.", "verified": false, "helpfulness": "0/0", "author": "PSB"}]