[{"rating": 5.0, "review": "Took some time to figure it out but it was worth it", "verified": true, "helpfulness": "0/0", "author": "bill masiarik"}, {"rating": 5.0, "review": "Love this thing!  Streaming videos from phone to tv super easy!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Okay", "verified": true, "helpfulness": "0/0", "author": "Juan C."}, {"rating": 1.0, "review": "The front of the connector was bent when I got it. I had to endlessly try to get this to connect... finally it did and works but if you bump the TV or the washing machine is on spin... I have to re connect.... sorry amazon I'm a prime customer but the one I got wasn't up to par...", "verified": true, "helpfulness": "0/0", "author": "james davidson"}, {"rating": 5.0, "review": "Happy best buy so far", "verified": true, "helpfulness": "0/0", "author": "Brian Romero"}, {"rating": 5.0, "review": "So I just bought a big bad ass 60 inch LED smart TV which already has Netflix built-in as well as the ability to all-connect to the internet. So I have access to internet TV, YouTube and Netflix on that TV no problem in the man cave.But! My living room TV didn't have anything built into it so I decided to try out Chromecast.Setup was a breeze! You can be setup in a minute or two! On screen instructions are provided when you power up the Chromecast and browse for its WiFi signal through your TV's settings.Now, I can watch anything I want wireless from the internet on my TV! No more long and painful nights being stuck in my computer chair just to watch Netflix!Anyone who loves to watch YouTube videos, Netflix or Hulu will absolutely adore Chromecast!PROS:Watch anything you'd normally watch on the internet on any TV in your house when you connect it to Chromecast!CONS:You should have a fast internet connection to eliminate buffering and increase and enhance playability on larger TV screens. This is important for screen resolution and the overall quality of the media you plan to play.", "verified": false, "helpfulness": "0/0", "author": "David Batterson \"David Batterson\""}, {"rating": 1.0, "review": "I connected this to my tv and followed all the setup directions. When I stream a movie all it does i skip and stop quite often. I have tried getting help from a booklet I purchased from Amazon but no help there. I also went on line to try and find help but all I found was other people with the same problem.If there is any help for this I would like to know.Respectfully;Finley Pritchett", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I like it a lot", "verified": true, "helpfulness": "0/1", "author": "Beimann"}, {"rating": 5.0, "review": "We love streaming movies and watching videos with it", "verified": true, "helpfulness": "0/0", "author": "laura jackson"}, {"rating": 5.0, "review": "Even though I have other devices I still use this one periodically.", "verified": true, "helpfulness": "0/0", "author": "Keith Whitaker"}]