[{"rating": 4.0, "review": "My only issue isn't really the Chromecast, it is my wifi signal isn't strong where it is.  I do have wired ethernet available, but it doesn't have a way to take advantage of that. ... Bummer.  Due to having a dual band router, I have dual-band wifi router available with a  strong 5GHz signal where it is, but it ONLY uses 2.4GHz not 5GHz channels.I did juryrig a way to get more wifi so I could test, and it works well for my needs.  My daughter has one and it works well for her at her house.At least it is cheap and for me I am just counting it as an experiment that didn't succeed like I had hoped.For what it is, I am impressed.  It just isn't what I had 'assumed' it would be.", "verified": true, "helpfulness": "0/0", "author": "servant74"}, {"rating": 1.0, "review": "We have great wifi in our apartment and yet Google Chrome never streams anything well. It's always glitchy and we always end up having to connect the laptop with the HDMI lead instead. Waste of money unfortunately.", "verified": true, "helpfulness": "1/1", "author": "Stefan Williams"}, {"rating": 3.0, "review": "This is a really good product worth the money spent and because I am a student on a budget I like to shop Amazon because of the Price.", "verified": true, "helpfulness": "0/0", "author": "Steveo"}, {"rating": 5.0, "review": "I bought this as a birthday present for my high-tech boyfriend and we have nothing but good things to say about it. I'm not a very techy person, but after he showed me how to use it with my phone / computer using google chrome, I was pretty ecstatic. We are excited to see what other updates this device will have in the future. Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "britt"}, {"rating": 5.0, "review": "I made a good purchase, for the price it is a excellent product. All as expected and I will possible buy again.", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "The device itself works fine, I just wish I could stream more things with it. I'd buy one again.  Heck,  I'd even buy one for someone else...", "verified": true, "helpfulness": "0/0", "author": "Mr. Crawford"}, {"rating": 5.0, "review": "I was skeptical that I needed this when I already use other devices as media hubs.  It's one of the best purchases I've made. You need a little bit of geek know how (maybe not the best gift for your elderly grandparents) but it's also really simple to use (even my wife uses it regularly and easily.) Streams whatever you want it to stream with enough tinkering around, although we just use it for Netflix mainly. Originally bought it for main TV, but now it has given the non-cable bedroom TV new life. We love it.", "verified": true, "helpfulness": "0/0", "author": "Anchovies"}, {"rating": 3.0, "review": "I thought this thing would pick up internet stations like a Roku or something like that, so was a bit disappointed.  Can't find any need or use for it.  Works great for what it does, was able to broadcast from my laptop and my phone to the tv, but don't really need to do that.", "verified": true, "helpfulness": "0/0", "author": "Robert P"}, {"rating": 5.0, "review": "Bought this for my son.  He loves it and say's it works great.  Another great option for watching your favorite shows.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 4.0, "review": "not bad but Ill keep my Roku for additional viewing options. Setup was easy...but wish I could cast what every is in the browser", "verified": true, "helpfulness": "0/0", "author": "William P Smelser"}]