[{"rating": 4.0, "review": "Works very well, but I really wish it supported airplay in conjunction with the cast function. Currently I use a Raspbmc pi and this together for my entertainment center.", "verified": true, "helpfulness": "0/0", "author": "Cody Bellinger"}, {"rating": 4.0, "review": "I purchased the Chromecast to stream Netfix content to our TV in the bedroom and can report that it works very well.  Occasionally, it will have a minor glitch and staying connected to the WiFi, but that has been very infrequent since I moved a wireless access point closer to the bedroom.  For $35, I don't think you can go wrong with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Pen"}, {"rating": 5.0, "review": "Good product, v. pleased - have found a huge number of films to watch, so not worth going to the cinema any more!", "verified": true, "helpfulness": "0/0", "author": "sowbury"}, {"rating": 3.0, "review": "Good concept and does what it says but needs to be supported by more apps and it needs to be opened up to other developers. You cant even stream your own content from your own device.  Fix these and then it would be 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Eric Coates"}, {"rating": 5.0, "review": "I can put youtube videos and even my chrome browser on my big screen using my netbook for all to see together.", "verified": true, "helpfulness": "0/0", "author": "D. Bouldin \"volunteer\""}, {"rating": 2.0, "review": "frequent stop/buffering on video streaming inside chrome browsermy wifi speed is 36mbpsok watching yutube video which is always smooth", "verified": true, "helpfulness": "0/1", "author": "eric chen"}, {"rating": 4.0, "review": "The chromecast works perfectly for what is advertises. It is extremely convenient that it will automatically switch inputs when casting something (it will not however switch back to what you were watching before casting). Google is clearly trying to expand the app compatibility and in my opinion they are only missing watchESPN and Amazon prime video.Bottom line is I would recommend this to anyone who wants an easy way to play Netflix or Chrome browser mirroring. Extremely satisfied!", "verified": true, "helpfulness": "0/0", "author": "Scott Donahue"}, {"rating": 5.0, "review": "It's easy to install and use. And I used it with my Iphone, laptop, and tablet. And my friends enjoying watching it on my tv.", "verified": true, "helpfulness": "0/0", "author": "joel"}, {"rating": 5.0, "review": "This is a great little device that helped me to transition from cable to antenna tv and get rid of expensive monthly cable bills.", "verified": true, "helpfulness": "0/0", "author": "doncar"}, {"rating": 5.0, "review": "I originally thought I was going to be able to cast any video using Chrome browser. Unforchantly its only works if your are using the PC...Not a Mac or Android operating system.", "verified": true, "helpfulness": "0/0", "author": "Michael"}]