[{"rating": 5.0, "review": "Best $35 I ever spent!", "verified": true, "helpfulness": "0/0", "author": "Jeremy Pedersen"}, {"rating": 5.0, "review": "I got this a lot earlier than I expected and was really happy! It's easy to setup (only took about 3 minutes) and is really great for entertainment purposes. The installation is so easy a 5 year old can do it! Five stars hands down!", "verified": true, "helpfulness": "0/0", "author": "Davis Marlette"}, {"rating": 1.0, "review": "It's rather annoying and lots of lag when using it with the cast tab on the computer. If you decrease the quility, use a good computer, and use a good router you can get okay experience. The \"apps\" must be sent from a cell phone or tablet running android or a chrome browser.To put it simple this device only works with Google software and is still very limited. I will be returning this, It's far from what they make it sound like. The only feature that is nice is sending any page and video to your TV wirelessly, but it does a poor job of that.", "verified": true, "helpfulness": "0/0", "author": "Glamdring"}, {"rating": 5.0, "review": "I love the Chromecast and the price was right.  My only complaint is that It cant seem to access my Amazon Prime movies.", "verified": true, "helpfulness": "0/0", "author": "Home James"}, {"rating": 5.0, "review": "What can i say. Just awesome!", "verified": true, "helpfulness": "0/0", "author": "JoshuaSix \"Jaiz\""}, {"rating": 2.0, "review": "i still have to run my computer and control the netflix with my computer  so this was not what i was looking for so i will be sending it back", "verified": true, "helpfulness": "0/0", "author": "jd"}, {"rating": 5.0, "review": "Perfect little streaming device.  Just plug it in and set it up with my phone.  Instantly turns any HD tv into a Smart tv.", "verified": true, "helpfulness": "0/0", "author": "DUSTIN HERNDON"}, {"rating": 5.0, "review": "loved it got 2 more lol", "verified": true, "helpfulness": "0/0", "author": "kevin robinson"}, {"rating": 4.0, "review": "Really awesome. Just wish there were more iOS apps that supported it. Although it works seamlessly with the one app (PLEX) that I bought it for so I guess I can't complain that loudly.Installs and sets up in minutes without a PhD or complex instructions. Uses a very small footprint. But do yourself a favor and get the miniUSB power cable so you don't have to run the AC adapter. Very happy so far!", "verified": true, "helpfulness": "0/0", "author": "David Gaudet"}, {"rating": 5.0, "review": "Hassle free installation.  Now we watch netflix on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Anthony Ragona"}]