[{"rating": 5.0, "review": "Works great going to by one for every tv in the house.Nice  to watch Netflix and YouTube without draining your tablet or phone", "verified": true, "helpfulness": "0/0", "author": "JoeMofknDot"}, {"rating": 4.0, "review": "It works great but there are not enough apps for it. Would like to see more media. Sirius xm other video streams. If it works on my android tab should be able to view.", "verified": true, "helpfulness": "0/0", "author": "brad pimental"}, {"rating": 5.0, "review": "As a \"cable cutter\", this little device is a great addition to our home.  We move it from TV to TV in our house, and it pops on an works.  Hulu, Netflix, YouTube playlists all work great.  Needs Amazon Instant Video.", "verified": true, "helpfulness": "0/0", "author": "Christopher Germann"}, {"rating": 4.0, "review": "I received the Google Chromecast for Christmas. I wasn't able to set it up through the Android app as recommended. Even though my phone detected the device, the app kept disconnecting the Wi-fi and then displayed an \"unable to connect to Chromecast\" error. I was able to complete setup using my desktop computer which has a wireless networking card.Once setup was complete, I had to install the Google Chrome browser. That is really the only downside I've found with this device. I don't want to use Chrome. I prefer a different, much more secure browser. But the Chrome browser is required. This is my main reason for giving it 4 stars instead of 5. It would be nice to have an official add-on for my preferred browser.After installing the Chrome browser and the Chromecast addon, whenever you go to a video site such as Youtube or Netflix, the player has a small Chromecast logo on the play bar. You just click that and the video is automatically streamed to your television.  It doesn't play on both devices. The computer (or app) goes into a pause mode while the video plays on the HDTV.The quality seems good enough. HD videos show crystal clear, sound is excellent with no noticeable lag, and it seems to stream smoothly. I was very happy to enjoy some Netflix original programing on my HDTV. One downside is that you can't browse or otherwise use the computer while watching the streaming program. Once you leave the page, the streaming stops. (Update: You can open other windows and use the computer, but unless you have very high speed internet access, it does affect the streaming.)My phone app did work once I had setup completed on the desktop. So I am able to control streaming content through my phone now. For $35, its a nice way to enjoy streaming movies and video.", "verified": true, "helpfulness": "0/0", "author": "JBJ"}, {"rating": 1.0, "review": "I had love and hate relationship with this gadget. In general, I found it very flaky, especially how frequently I needed to reset the device. And boy, and it's as painful as having a boil in your ass to set it up again.Other resentment I had with chromecast(actually google in general) is how they have confined casting support exclusively to chrome browser only. It sure makes sense for google to get as much user data off the browser, but come on guys, this is pinnacle of creepiness.", "verified": true, "helpfulness": "1/3", "author": "San"}, {"rating": 1.0, "review": "I'm amazed that this product has received the ratings it has given how restrictive google has made this device.  I received this for a Christmast present, immediately thought this would be a wireless tool to connect our iphones and laptops to our project wirelessly.  I packed away my dvd player (which was using the current HDMI input in my projector), plugged the Chromecast in and set it up.  That's when things went sideways.  When I downloaded the app to my iphone, I would only \"cast\" from youtube or netflix.  How is that helpful at all?  I might as well just use my laptop which connects to my projector, right?  The real benefit of this device would be to cast photos and videos from my phone, not one of googles proprietary or locked down partner tools.  This is a device that is clearly designed to increase marketshare of a small number of \"players\" like Hulu, Netflix, etc and NOT at all designed with the customer in mind.", "verified": false, "helpfulness": "2/5", "author": "Volski"}, {"rating": 1.0, "review": "this sucks...you have to set up your router to recognize chromecast...pain in the royal azz..after playing with it for 2 days i configured my router and then net flix played for 5min then buffers and then chromecast stops working", "verified": true, "helpfulness": "2/4", "author": "So"}, {"rating": 5.0, "review": "Got this for a Christmas present from my step-son. He knows I was thinking about it and braved Black Friday to secure one at a good price. I used my laptop to do the setup because it was quick and during the process, I installed the Chromecast add-on into the Chrome browser. I had an adaptor to run video from my Samsung Galaxy Note 3 to the HDMI port of our TV but that tethered my phone while we watched a video and we'd hear the alert tones from my phone on our surround sound system. With Chromecast, I installed the app onto my handset and immediately enjoyed 1080p video on my TV and once I started a video and \"cast\" it to the TV, I could turn off the screen or go to any other app without interrupting the video on the TV screen. That includes alert tones since the Chromecase dongle is a standalone piece of hardware and not directly fed by my phone. While I couldn't see a way to control volume using Hulu+, the function is available on the Netflix app which is VERY convenient! With my laptop, what you have on a browser tab is what you see on the screen. So, if you have work to do or play a browser-based game, you'l be able to use your TV for a much larger display. I look forward to additional functionality from Hulu+ and others but I'm very pleased with how the unit functions and highly recommended it!", "verified": false, "helpfulness": "1/1", "author": "M. Perez \"Tony Perez\""}, {"rating": 5.0, "review": "I care for browsing through movies on netflix using my chromebook or smartphone over using the blu-ray. It has always worked and was easy to setup multiple devices. Hopefully there will be more movie apps available in the future.", "verified": false, "helpfulness": "0/0", "author": "Don stueve"}, {"rating": 5.0, "review": "Excellent device and easy to install.  Took about 2 minutes to install and about 20 to update.  It opens up a whole new world of Netflix viewing.  However, be sure your device can download the Chromecast App before purchasing.  Not all android devices (i.e. Nook) not allow the app's download.", "verified": true, "helpfulness": "1/1", "author": "Richard C"}]