[{"rating": 5.0, "review": "The Chromecast works great and required a 30 second install.Good job Google! Can seriously consider cord-cutting as an option now!", "verified": true, "helpfulness": "0/0", "author": "James A Lavorato"}, {"rating": 2.0, "review": "I got this because I travel frequently and want to be able to watch streaming -- but this doesn't always work very well. Out of the 5 places I tried, it only worked at 2.  And if the TV doesn't have HDMI you can't use it (and adapters are as expensive as the device). When it works it works great -- but it's not as universal as I had hoped.", "verified": true, "helpfulness": "1/1", "author": "g"}, {"rating": 5.0, "review": "Works best with android operating system, limited with the iPhone. It's basically a tv receiver and you can't go wrong for the price.", "verified": true, "helpfulness": "0/0", "author": "April Laureski"}, {"rating": 3.0, "review": "I'm not sure why Google went ahead with the Chromecast with only a handful of programs available. It worked as intended but would often freeze up on my iphone 3GS when I used the phone as a remote and  I tried to activate closed captioning. I'll stick with using an hdmi splitter from the back of my Roku and watching movies in two different rooms on two different tv's. I like Google products, I'm writing this review on a Samsung Chromebook and I have a Google tablet but I feel the introduction of the Chromecast was a bit premature with what it has to offer.", "verified": true, "helpfulness": "0/0", "author": "gadget happy"}, {"rating": 1.0, "review": "My Kindle Fire prime movies will not connect to the Chromecast even after installing Tootle Chrome and ES File Explorer so I can watch them on my TV", "verified": true, "helpfulness": "0/2", "author": "Arwyn Morris"}, {"rating": 5.0, "review": "Bought this several months ago and still having problems getting it set up.  Wifi in my home is terrible and directions said to change the router password.  I though I was tech savy but this has almost got me beat.  If you have good wifi, it will probably work well.  Apple TV was much easier to set up.", "verified": true, "helpfulness": "0/0", "author": "D. McDougald"}, {"rating": 1.0, "review": "haven't been able to use it because of the Wifi system that time warner gave me. help help help Me", "verified": true, "helpfulness": "0/2", "author": "C. Uhas"}, {"rating": 5.0, "review": "Does everything advertised and more. Easy to install and use. I have no techno savy but had no problem installing", "verified": true, "helpfulness": "0/0", "author": "David speer"}, {"rating": 5.0, "review": "Leave it to Google.  This little dongle(?) does all it says it will, and better than I expected.  Often I get a better, higher res, Netflix picture with Chromecast than direct through my TV.  Even my old MacBook runs the show well.  I'm guessing that the picture goes directly to the dongle, not through the computer, so even an ancient computer will do fine. At $35, it's a no-brainer.  Great idea, Google: as usual.", "verified": true, "helpfulness": "1/1", "author": "Pat R."}, {"rating": 5.0, "review": "This little thing is amazing for those who have TV without NETFLIX preinstall it is perfect. Simple to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Marcos Pujol"}]