[{"rating": 5.0, "review": "I am very happy with the Chromecast.  I use it all the time.  It is so much easier to use than the apps in my blue ray player", "verified": true, "helpfulness": "0/0", "author": "kenE"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Avery Rowlison"}, {"rating": 2.0, "review": "This is a great product, when it works properly. The main issue is that every time you pick up your phone or tablet, it has to reconnect. This often takes several seconds, in which you can't pause or do anything. Many times it just never connects. Your only option is to back out, reconnect and start over. Some apps I've tried, like Vudu don't work at all. Not sure what the issue is there. Also, forget about screen casting. I have the galaxy s5. I've gotten it to work once. But never again. Connects and then drops after a moment. This is with three different routers and trying all different settings. Casting from a pc using chrome is only slightly better. Supposedly this is in beta, but it's been out for at least a year.", "verified": false, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Love this product, now I can watch movie on the big screens instead of my phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "Kyle Bradstreet"}, {"rating": 5.0, "review": "Great for my Iphone but when I tried to connect to my computer it would only allow it in German so you have to look at the fine print to allow it to find the English version. Not an easy task unless you are a whiz at it? But all in all it works great 8~)", "verified": true, "helpfulness": "0/0", "author": "Tony Talmich"}, {"rating": 5.0, "review": "Wish it had apps imbedded like Firestick", "verified": true, "helpfulness": "0/1", "author": "Michael H. Goldner"}, {"rating": 5.0, "review": "one of my favorite things!  How did we survive without this??", "verified": true, "helpfulness": "0/0", "author": "E.W"}, {"rating": 5.0, "review": "Great product, great price, and gives you pretty ultimate convenience. While I wouldn't put this up there with Apple TV, Roku, or the Amazon Fire, I do like this product and have given several out as gifts. Everyone, including myself, seems to be satisfied with what this product is capable of. Although it may lack the functionality of the other products I listed, it still works well.", "verified": true, "helpfulness": "1/1", "author": "Kyle B"}, {"rating": 5.0, "review": "It works just the way it's supposed to. I am very pleased with my Chromcast. I plan to order another one soon", "verified": false, "helpfulness": "0/0", "author": "Joseph Davis"}, {"rating": 5.0, "review": "Got it for my teenage kids. Worked like a charm. Setup not bad.", "verified": true, "helpfulness": "0/0", "author": "Big Papa"}]