[{"rating": 5.0, "review": "I have owned an Apple TV (3rd Generation), my parents own a Roku. I purchased the Chromecast because I was curious and it ended up replacing my Apple TV. Any device can be a remote, the future possibilities for in-app casting are endless, the picture quality is fantastic (especially using the Hulu Plus app for Android), it does NOT overheat (or even get very hot) if you use the extension cable to angle it away from your TV. There were no wireless traffic problems to my surprise. I don't see my network slowing down or our internet, which is fairly slow at 12mbps. If you have slow internet, you can cast in 480p SD. This thing is feature packed and really pretty incredible for only $35!", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 2.0, "review": "Not as functional as Apple TV or Roku.  Disappointed with the way it integrates with the sound system for my television.", "verified": true, "helpfulness": "0/0", "author": "DR M"}, {"rating": 5.0, "review": "Simplifying my viewing the web, family photos and just plain fun.  Provides a whole new way means of sharing interesting videos or information with the rest of the family. Easy integration with Chrome browser as well.", "verified": true, "helpfulness": "0/0", "author": "Derek Small"}, {"rating": 5.0, "review": "Very easy to setup in minutes.  Better then a setup box. Love netfix and Hulu. Goodbye cable company.  Can wait for more companies to join.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Ohare \"Robert O'Hare\""}, {"rating": 5.0, "review": "Awesome device. Easy to cast doesn't use the processing power of phone. Love watching YouTube on it. So get it.", "verified": true, "helpfulness": "0/0", "author": "Siddharth"}, {"rating": 5.0, "review": "i tested the chromecast for a couple of weeks now and i can tell this is the easiest way to netflix! at the end my daughter is enjoying this as much as me", "verified": true, "helpfulness": "0/0", "author": "Rene Allan Martinez"}, {"rating": 5.0, "review": "When Google released this the second after their press conference announcement. I found out that this item became sold out in less than half the day. I've been watching reviews and previews of this item and it is far by if not, one of the most awesome streaming receiver for your TV. Currently Streams Hulu, Netflix, Google Play Movies/Music, and Youtube. New apps to stream soon so, keep that noted to keep an eye out for a updates on this.", "verified": true, "helpfulness": "0/0", "author": "Kenji Kyoudai"}, {"rating": 5.0, "review": "Another way to stream media. I got it to stream google play media, and it works very well. If you are a fan of other Google products its a no brainer", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 4.0, "review": "Can stream video from ABC.com and YouTube fairly easily but not from WWW.HULU.COM . Had one show that was very choppy with the video while the audio just kept running. Still exploring it's capabilities", "verified": true, "helpfulness": "0/0", "author": "Chris Moran"}, {"rating": 3.0, "review": "I researched the chromecast device to ensure it worked with an iPad.  My wife has collected hundreds of pictures on her iPad and wished to display them on the TV.  The chromecast does work with the iPad but only with Chrome (which I knew) but I have yet to find a way for Chrome on the iPad to display pictures stored on that iPad.  Other than that the Chromecast works great, streams movies, and will display picutures sent from my MBP.", "verified": true, "helpfulness": "0/0", "author": "J. Legrand \"jl\""}]