[{"rating": 5.0, "review": "Works great for watching Netflix on my big screen instead of my iPad.  Very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "Diane Shortsleeve"}, {"rating": 5.0, "review": "Chromecast is one of the best purchases I've made it a long time.  It's incredible value for the cost.  I previously had a small computer that I used as a media center complete with a wireless keyboard and mouse.  Chromecast removes the need of having this computer while simplifying the process of turning your tv into a media center.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "All is ok", "verified": true, "helpfulness": "0/0", "author": "Gustavo Camacho \"ingaco\""}, {"rating": 5.0, "review": "Excellent tool, I love it and it is great with you tube !", "verified": true, "helpfulness": "0/0", "author": "Alessandro C."}, {"rating": 5.0, "review": "it's not only cheap but a great way of mirror your tablet or cellphone screen", "verified": true, "helpfulness": "0/0", "author": "Luchoga1"}, {"rating": 1.0, "review": "I was sorely disappointed with this.  In fact, so disappointed, I purchased the Amazon Fire Stick (something I would have done in the first place, had they been able to access HBO Go at the time of purchse.)  The Chromecast is incredibly difficult to get to work.  It took 2 TVs and 3 electronic devices before we were able to finally cast anything (and we have a household that is up on tech items).  Get the Amazon Fire Stick.  It is a breeze to operate and worth every penny!", "verified": true, "helpfulness": "0/2", "author": "vacation4mom"}, {"rating": 1.0, "review": "Had problems at first, figured out how to make it work better, now it's a good product. Ui is not great, does really stupid things sometimes and should include something like all cast in the chromecast app. But overall, it's a good thing to have.Edit: removed a star, really overly difficult to set up on different wireless networks, has general problems. A better idea to spend a bit more and get a higher quality device.Edit 2: Its really not a very good device, I've stopped using it, regret buying it. Not worth the hassle.", "verified": true, "helpfulness": "0/0", "author": "A.D. Olson"}, {"rating": 4.0, "review": "Some disadvantages, but very useful when you get to know it", "verified": true, "helpfulness": "0/0", "author": "Felipe Correa \"(`(°°)´)\""}, {"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "Keith Heaton"}, {"rating": 4.0, "review": "I really like this device. It allows me to watch movies and shop on my big screen TV which is great because my vision is not the greatest.", "verified": true, "helpfulness": "0/0", "author": "Lavern"}]