[{"rating": 4.0, "review": "Very good. ..", "verified": true, "helpfulness": "0/0", "author": "Carlo J."}, {"rating": 5.0, "review": "So easy to install and play.  I had it up and running in less than 15 mins. Plugged in downloaded app, turned on netflix and voila. It's great because when hubby and I want to watch something on netflix in our den. (we do not have a cable box in there)  We plugged it on the tv and had our laptop streaming the movie and in no time it was on the tv for us to enjoy!  Would recommend to anyone who does not have a device that already streams netflix, prime, hulu etc.  It would not be worth having unless you used it for some other reason than watching tv.  Possibly to show a group of people how to do something, demonstration on a webpage.", "verified": true, "helpfulness": "0/0", "author": "Avid Shopper \"Colee Uebel\""}, {"rating": 5.0, "review": "Stream YouTube good picture and video a good product", "verified": true, "helpfulness": "0/0", "author": "Jose Lopez"}, {"rating": 5.0, "review": "As long as your internet service provider doesn't suck, this is an awesome little contraption.  It's very easy to cast from your Chrome browser or from the YouTube app on Android.  Some websites even have built in Chromecast usability.", "verified": true, "helpfulness": "4/4", "author": "Adam Shaffer"}, {"rating": 5.0, "review": "This is a great gadget that solves the problem of getting content from your tablet or PC to an older TV.Using on my Nexus tablet, I notice no lag, no sync issues, not video or audio issues. When using the Hulu app, I sometimes lost my video controls, which is a huge PITA, but not an issue with the hardware or Chromecast-supplied hardware.Casting from browser pages is simple and accurate, too.", "verified": true, "helpfulness": "0/0", "author": "Sam R."}, {"rating": 5.0, "review": "Great", "verified": false, "helpfulness": "0/0", "author": "Meykg"}, {"rating": 2.0, "review": "can not watch HD movies as it glitches and gets slow and loses resolution. Even in games if the screen is mirrored", "verified": true, "helpfulness": "0/0", "author": "mahmoud el charif"}, {"rating": 5.0, "review": "awesome device", "verified": true, "helpfulness": "0/0", "author": "Sam mc gee"}, {"rating": 5.0, "review": "love it! so easy to use and can do so much.", "verified": false, "helpfulness": "0/0", "author": "Ahana79 \"adam\""}, {"rating": 5.0, "review": "Second one. It's pretty rad.", "verified": true, "helpfulness": "0/0", "author": "B. Rockwood \"dasrockness\""}]