[{"rating": 4.0, "review": "easy to use great selection", "verified": true, "helpfulness": "0/0", "author": "Classic"}, {"rating": 5.0, "review": "Very easy to set up and use.  Also as a Prime Member, I have many options for movies and TV shows to watch for free.", "verified": true, "helpfulness": "0/0", "author": "Beth McEuen"}, {"rating": 5.0, "review": "This is a great device.  it gives you everything the others do plus Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "AL Roger"}, {"rating": 4.0, "review": "Very easy to set up and use =)", "verified": true, "helpfulness": "0/0", "author": "SAS"}, {"rating": 4.0, "review": "I love the way it is set up on the screen and being able to talk to it to find what I am looking for.", "verified": true, "helpfulness": "0/0", "author": "Susan Ristenpart"}, {"rating": 4.0, "review": "A lot of positive features. So many it takes awhile to get up to speed on operation and viewing.", "verified": true, "helpfulness": "0/0", "author": "interested \"Paul Leinbach\""}, {"rating": 5.0, "review": "Received as a Mother's Day gift and absolutely love it. So much better than a wire across the room from my kindle fire. Never had any streaming problems with videos or music. Not a gamer so not sure how well the speed is with the games.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "While we are a house full of new technology. This has been a real shiny new toy for the household, Though the controller if you have kids is a must buy.", "verified": true, "helpfulness": "0/0", "author": "ted marrin"}, {"rating": 5.0, "review": "Fantastic !!!! I never seem to have any qualms about Amazon products and this certainly is a good one.  As a member of Prime, I am happy as can be with the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Charles R. Scheidt"}, {"rating": 5.0, "review": "Best cord cutting purchase I have ever made. I have a chromecast as well and the firetv gets used probably 95% of the time. I dont have cable anymore, because with netflix, prime and hulu there is legitimately no need! Easy to use, easy to setup and it is physically small. There is nothing to complain about here.", "verified": true, "helpfulness": "0/0", "author": "Kevin D Stanley"}]