[{"rating": 4.0, "review": "Great streaming box, super quick and not at all sluggish. I just upgraded from the Roku 2 and it's a huge world of difference.However proceed with caution, it turns out that the Fire TV doesn't always play well with all routers. We had a slightly older single band N Linksys router which worked fine with everything else we own but it caused the Fire TV to be buggy.Specifically Netflix was pretty much unusable and we would have to uninstall the app multiple times before it might even open. We returned the unit to best buy after we had this problem all night and got a replacement assuming it was the device. The second one did the same thing, until we plugged it directly into the router. We went an got a new AC dual band Linksys router and it works PERFECTLY now.TLDR version: great streaming box, but it might not fully work with your N router", "verified": true, "helpfulness": "0/0", "author": "Angel M."}, {"rating": 4.0, "review": "We really like Amazon Fire TV. We use a Roku 3 in most of our rooms; however, we have tried the Amazon Fire TV in one room. It is great for watching  movies and shows with my family. However, I personally like the Roku 3 better, because I can access more channels. My 8-year old daughter uses our Fire TV all the time. The shows load quickly and the picture quality is pretty good. I also like the screen saver feature. Amazon Prime is a great option for streaming Prime movies and shows. They also have other channels, like PBSkids. To be clear, I have a few Roku 3s in my home, in addition to Amazon Fire TV. I like them both for streaming content. I prefer the Roku 3; but we use the Amazon Fire TV and we enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Nicole's Mom"}, {"rating": 5.0, "review": "It isn't very often that something exceeds my expectations, but the Fire TV has done it. It works as advertised for video streaming, and the gaming experience is surprisingly good. Since installing it, broadcast TV and our Wii game console see little to no use. My only nit-pick is that browsing for Amazon Prime videos isn't what it should be. I can (voice!) search for anything specific, but if I want to browse all four star or higher sci-fi movies then I am out of luck. I have to do the search on the website and save the results to my watch list.", "verified": true, "helpfulness": "0/0", "author": "Kevin Paul Mcdonald"}, {"rating": 5.0, "review": "Last year almost, I bought my Fire TV on Cyber Monday for a good deal. A few days later, Amazon emailed me asking me to write a review on it. I didn't think that I was worthy enough to write such a review about such an amazing device, so I just let the email sit in my inbox... until now. So here it goes! I use my Fire TV all the time to do things like watch Netflix and You Tube , play video games, and other things all the time! When it's connected to the internet, which is required at all times, I can stream using many apps on the Amazon App Store that have been converted from mobile to TV. I love the remote that comes with it (the Amazon Fire TV Remote), though, I find myself using my keyboard that I have plugged into the USB port provided more than the remote, since I have it set up at my desk. I can also control it using my Kindle and Android tablets using the stream buttons on certain apps on them like You Tube, Netflix, and Spotify. There's also the Fire TV app on Android which is nice as well. Overall, I just love using my Amazon Fire TV, and I belive that it beats any other streaming device out there similar to it. Thanks, Amazon!", "verified": true, "helpfulness": "1/1", "author": "Caleb Hawn \"Caleb Hawn\""}, {"rating": 1.0, "review": "Disappointed thought it had Wi-Fi but I spoke to Sloan at customer service and he explained and apologized for the misunderstanding. I still wanted to go with amazon tv so I spent ALL.night trying to get internet and all they wanted to do was sell me tv so unfortunately I had to return it", "verified": true, "helpfulness": "2/8", "author": "debrann fusco"}, {"rating": 5.0, "review": "Very well done. Comparable to apples product in allot of ways. I would give the \"GUI\" interface nod to Apple....but only slightly...Amazon's is very good too, and with Amazon's voice search being so good and easy to use, I would say they are equally easy to use.Better hardware in the Amazon, what with the Snapdragon SOC, but that only matters if you do more than simple streaming (games, apps, and so forth).For me, the big difference is that Apple doesn't stream amazon prime offerings, nor does apple offer a comparable streaming subscription service (YET....I think it's in the works, and of  of course you can use Netflx and all the others), so I currently find the Amazon product more useful.I'm a pretty critical of these type electronics...been streaming media through my house since I hacked my PS2 to stream music and pictures back in the 90's....(to a CRT TV no less....pre-LCD). Anyway, the only thing Amazon got wrong is that clunker of an excuse for a controller, and that's not what I'm rating here.", "verified": true, "helpfulness": "2/2", "author": "Michael B."}, {"rating": 5.0, "review": "Works great, apps are very easy to use", "verified": true, "helpfulness": "0/0", "author": "Amanda L Doll"}, {"rating": 5.0, "review": "Best Christmas gift to our childrens' families.", "verified": true, "helpfulness": "0/0", "author": "Darlene K"}, {"rating": 2.0, "review": "I don't own this item but looking into it. I want to buy one for every tv in the house but I don't see the point in owning this device! You can't share your account in the household... It would cost me more to run Sling,Hulu,etc. then it's cost me for cable. If I could let my kids and the living room tv and my room tv share the accounts for channels I wouldn't see an issue but seems kinda pointless for multiple tvs.", "verified": false, "helpfulness": "2/10", "author": "it suck"}, {"rating": 5.0, "review": "It was fairly easy to set up and we are enjoying the choices available right now.", "verified": true, "helpfulness": "0/0", "author": "Kathy"}]