[{"rating": 5.0, "review": "Works great. I mostly use it for netflix and amazon videos. The voice recognition is the best I have ever seen.", "verified": true, "helpfulness": "0/0", "author": "Gregg K. Sullivan \"Iluvamazon\""}, {"rating": 5.0, "review": "I love it. It's worth every penny.  I am an amazon prime member and I got it within 2 days", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "nice box", "verified": true, "helpfulness": "0/0", "author": "Emilio E. Wong L. \"emil\""}, {"rating": 3.0, "review": "The Fire TV works fine as far as it goes.  I am impressed with the voice search - it really works well.  What I am disappointed with is the limited access to internet streaming.  I was hoping to be able to have unlimited access to TV network web sites for streaming shows as I can with my computer.  What I found is that I am able to obtain only limited access filtered through Amazon Prime.  If I had understood this limitation, I probably would not have purchased this device at this time.  For me, it does not provide the kind of service that would allow me to drop my cable contract.", "verified": true, "helpfulness": "0/0", "author": "J. Africa"}, {"rating": 4.0, "review": "I've only had this for a few days and haven't had much time to play with it, but setup was fairly easy and getting a list made wasn't hard either. The size is amazing and the remote works well. It is easier for me to locate content via the web than via TV but that's a personal preference. I've been happy so far, except I can't watch previous NCIS (any) without paying for the episode. I'm looking for ways to save some money on TV entertainment and with this I may be cancelling my TiVo in the next few weeks! Even with adding on Netflix and Hulu I will be paying much less than my cable services!", "verified": true, "helpfulness": "0/0", "author": "mrk"}, {"rating": 5.0, "review": "So easy to set up. I did however have an issue initially with my Prime Music showing up on my TV. I called and spoke with 2 separate people. One rep told me it should be working and couldn't understand why it wasn't. The other told me that this was a capability yet. This did not make sense to me as I can get it on my iPhone and computer. I found the answer in an on line forum. I believe I just had to do a hard reboot and it was fixed.Love the iPhone remote app!", "verified": true, "helpfulness": "0/0", "author": "Kelli Rushton"}, {"rating": 4.0, "review": "I think the voice control is what sold me on the FireTV. I think one thing that can be improved is if the user is able to use the voice search across all apps. For example, you could do a voice search on the home screen and have it also search Netflix options.", "verified": true, "helpfulness": "0/0", "author": "christina"}, {"rating": 5.0, "review": "Awesome piece of equipment, bought for wife, easy for her to use.  Setup was easy, great purchase.", "verified": true, "helpfulness": "0/0", "author": "wade abrams"}, {"rating": 5.0, "review": "I replaced an older Roku model which was rather slow and prone to a lot of screen snow.Fire tv image is clear and crisp HD.  I found navigating with the remote rather cumbersome and the screen setup could use some tweaking to better delineate menus and where your remote is.However, the voice search is fast and extremely accurate.  Even if you can't recall the title of the film, search for a specific actor to see available choices.The best feature is being able to control the box with my Kindle Fire.  Remember when Comcast was promising a tablet-like remote?  This is pretty close.  I do my searching/selecting, pause, rewind, etc. on the kindle.  Because you can easily tailor your kindle display to show watchlists by free (prime) or rent, it saves a lot of time while not narrowing choices.Edit 01/04/2015. Using the kindle fire apps and mirroring (settings, display & sounds, turn on-off mirror to TV) I can finally access HBOGO programming on my TV.  Comcast has been blocking this for years even though I'm an HBO subscriber. The Showtime app works as well.", "verified": true, "helpfulness": "0/0", "author": "Milsma"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "David Mills"}]