[{"rating": 5.0, "review": "Connected very fast to my android tablet for setup. Had one USB to plug into the tv for power, hdmi in for input to chromecast plugin. Works great, you can shut off your phone or tablet after you hit play and can watch it on the big screen in bed or living room easily", "verified": true, "helpfulness": "0/0", "author": "kje1"}, {"rating": 5.0, "review": "Ignore the naysayers. Many of the complaints found in the 1-star reviews for the Chromecast make absolutely no sense.People complain about video freezing while being too naive to understand that it's their internet speed, not the Chromecast causing it.  Others stay that its functionality is too limited or that it has false advertising. This is simply not true, the Chromecast does everything it is advertised to do, and the faster your internet, the better it works.  If anything, this products packaging actually UNDERADVERTISES it since new apps are being added that support its functionality. For streaming HD video, you would want an internet connection of at least 6Mbps or better. Many people have 15Mbps, which is plenty fast enough.Netflix recommends 5-7Mbps for HD video, and 12Mbps or better for streaming 3D on their website.Some people complain about it not having Amazon InstantVideo support. WELL DUH! Amazon is one of Google's main competitors in the tablet space, they would rather have people streaming Amazon InstantVideo on a Kindle Fire rather than a Google device.  It's not Google's fault for the lack of Amazon InstantVideo support, it's Amazon's. Just ask yourself why Amazon hasn't even bothered to make an InstantVideo app for android. It's because then nobody would have reason to buy their precious Kindle Fires and everyone would be buying better, more functional tablets like the Nexus 7 instead.If you want to watch Amazon Instant Video, then simply install the Google Cast extension for Chrome, and type chrome://plugins and make sure the Microsoft Silverlight plugin is disabled, and then you can use Flash to watch Amazon InstantVideo instead, and simply cast the tab via the Google Cast extension for Chrome. It's not an ideal solution though, but it's also not really much of a con either considering the price of the Chromecast.Other people complain about not being able to stream the content from their galleries. There apps that let you do this, such as Plex. People need to update their reviews to reflect this rather than knocking a product because of their inability to learn how to use it.I have personally bought 5 of these and have been using them for months. I bought one for my 74-year old grandmother for Xmas and she already understands how to use it. It works amazingly well, and new apps are adding Chromecast support all the time. There is no on or off switch on the device, simply unplug it from it's USB power source (whether it be a USB port on your HDTV, or the AC adapter included) if you wish to turn it off while in use.You can download the Chromecast app to reboot it, check the MAC and IP addresses, rename it (such as Living Room, Master Bedroom etc).  If your TV's HDMI inputs are too close together, the wider rounded end of the chromecast may be too bulky to fit between your other HDMI inputs, but fortunately, Google includes an HDMI extender cable in the packaging to eliminate this problem.The best part is, it updates itself automatically, much like the Chrome browser. If you wish to update it to the latest version, simply reboot it via the Chromecast app, or turn your TV off and on again, or unplug the Chromecast's USB power source and plug it back in.Lastly, the Chromecast serves as a beautiful slideshow of photography from Google engineers such as the amazing photographer Romain Guy,who used to be a part of Android but now works on Google's robotics team, as well as several other photographers.  New images appear to be added every week, so you'll never get bored of the same images over and over and over again.It works with all the biggest and most important apps for streaming content such as:Google Play MusicGoogle Play Movies & TVYouTubeNetflixHulu PlusPandoraHBO GOVevoRed Bull.TVSongzaPlexPostTVVikiRealPlayer CloudSupport for more apps will be added in the coming months, so have patience, as this product has only been out for about 5 months now.  If you want an inexpensive way to watch Netflix, YouTube, Google Play Music and TV, or listen to music from your Google Play Music collection, and don't own a smart TV or smart bluray player, this is the perfect device for you.  Really what the Google Chromecast does, is that it allows for any HDTV to be converted into a Smart App-enabled TV.  It's absolutely perfect for parties or family gatherings where everyone wants to be able to share their own content through the TV.There's many reasons why this is currently the #1 electronic gadget on Amazon, most of which I have listed above in my review.", "verified": false, "helpfulness": "1/1", "author": "Tyler Chappell"}, {"rating": 5.0, "review": "Thanks Google! about time an affordable and convenient device like this came out, gave out about five of them as Xmas presents.Max B", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Streams flawless. I'm very happy with the purchase. Google has brought in 10 more new apps and I m sure there will be many useful apps to follow", "verified": true, "helpfulness": "0/0", "author": "V. Ghai \"Vinny\""}, {"rating": 5.0, "review": "My son loves this.  We stream YouTube videos on the big screen for him.  Old McDonald, all kinds of stories that are read and animated in some very creative ways and even episodes of the Brainy Baby show.  He loves being able to see it on the big screen and I love watching him get excited and dance or clap along.  My two year old has already taken over my fancy big screen TV....", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "The chromecast works wonderfully. My current phone is an iphone. My old phone is a samsung galaxy. The chromecast does not work as quickly on iphone as it does on android. After you iphone locks its screen it takes a while, probably 30 seconds for the iphone to reconnect to the chromecast and open the app currently being cast to pause the video.Android does not have this problem so I just began using my old android phone as the \"TV\" remote.", "verified": true, "helpfulness": "0/0", "author": "reviewer12321"}, {"rating": 5.0, "review": "It is simple to use. Does not require any complex setup. We started using from the first day and it works very good.", "verified": true, "helpfulness": "0/0", "author": "gem"}, {"rating": 5.0, "review": "I got my Chromecast for Christmas and love it. I am an android user (HTC One and Nexus 7) and setup was a breeze. I have a 4 year old Pioneer plasma and connected to an open HDMI port, downloaded the Chromecast app and was on my way.First you have to update the Chromecast, then you are ready to stream. YouTube looks amazing!! Considering how slow YouTube is on a desktop, I was blown away with the lack of buffering and quality. Same with Netflix. Streaming from Google Music is great too. I will look at using Plex next.I'm very pleased with my Chromecast. If you have android and understand what the Chromecast does vs other options, buy it. Well worth the money.", "verified": false, "helpfulness": "0/0", "author": "Robert Bishop"}, {"rating": 5.0, "review": "Most fun I have had without cable! It's so convenient to stream or controll from your phone or kindle or whatever you have.", "verified": true, "helpfulness": "0/0", "author": "Greenbean"}, {"rating": 1.0, "review": "I very rarely write reviews. However, in this case, I feel like I have to. I've had a horrible experience with this device; I have tried to use it 4 or 5 times, always unsuccessfully. Sometimes I can hear sound but can't see anything, other times there is a lot of lag between sound and image, other times I can watch something but if I put it on full screen mode, the image is gone. I really don't know why Google decided to release a device that is clearly not ready for the public. Get it together, people!", "verified": true, "helpfulness": "1/1", "author": "M. Moreno"}]