[{"rating": 5.0, "review": "The Amazon fire tv took me a total of five minutes to plug in and use. It's small, lightweight, and really sleek. It easily blends into your tv area and is not bulky or noisy. So easy to use and has some fantastic features. For a hundred bucks this will turn any tv into a smart tv!", "verified": true, "helpfulness": "1/1", "author": "JT"}, {"rating": 1.0, "review": "Had many quality issues with this item.  Sent 1 back and got it replaced within a month or so that one died too.  Thankfully was able to get a full refund for the product.  The idea is great and all but the quality of the product is just not there. Never see any electronic device die that fast and the replacement one had the exact same issues as the first unit.  Was not impressed at all.", "verified": true, "helpfulness": "3/5", "author": "Karen Lehn"}, {"rating": 4.0, "review": "Works great has good picture I would give it a 5 star except you can't load other apps Easley but except for that it does all I need it to do", "verified": true, "helpfulness": "1/1", "author": "Gary payton"}, {"rating": 5.0, "review": "Very easy to use a  fast box beats anything from matricom hands down.", "verified": true, "helpfulness": "0/1", "author": "Jim \"jpayne\""}, {"rating": 5.0, "review": "I love this fire tv stick i wish i had on my smart tv because. Some of the app that fire tv have my smart tv don\"t have like stazt and showtime and there are more but can\"t remember right now.", "verified": false, "helpfulness": "0/1", "author": "edna"}, {"rating": 5.0, "review": "works great just what I expected", "verified": true, "helpfulness": "0/1", "author": "Georgette D Miller"}, {"rating": 5.0, "review": "This gadget worked perfectly once I had all the buttons figured out (Amazon, you could include a better manual).  I did, however, have to call Amazon tech support because all the instructions were in German and I couldn't figure out how to find the \"change language\" setting.  Tech solved it quickly, and we were good to go.  Be careful of all the selections: many options cost extra.  Since so many shows are now available only via the net, this is almost becoming a necessity.", "verified": true, "helpfulness": "1/1", "author": "Carol A."}, {"rating": 4.0, "review": "A nice realy fast dievice. Way better and faster then the apps on my smart Tv  and blue ray player. The voice search is a great bonus. And if you have amazon prime it's a no brainer to get this device over orthers. It has most of the same apps as the competition plus there are some cool games you can play on it also!Just wish some of the tv apps did not need a cable subscription. But that seems to be a issue across all platforms.Would definitely recommend one!", "verified": true, "helpfulness": "1/1", "author": "Ralph Procida"}, {"rating": 5.0, "review": "blew me away how fire tv works and im sure i havent done all yet and added prime which smokes netflix which has been good for time thanks steve", "verified": true, "helpfulness": "1/1", "author": "steve wolfe"}, {"rating": 5.0, "review": "Great buy. Love it", "verified": true, "helpfulness": "0/1", "author": "Monica M Williamson"}]