[{"rating": 2.0, "review": "Had this 3 weeks and couldn't get it to work with my wireless router, even though chromecast documentation said it was compatible.  Looked online for solutions, most of which were very technical and beyond my comfort level.  Router manufacturer wouldn't provide support since the warranty had expired.  Ended up returning it.  So, lesson learned, some things aren't as easy as plug in and go.", "verified": true, "helpfulness": "0/0", "author": "truemainer"}, {"rating": 5.0, "review": "Best $35 I've ever spent. Easy to install/use has made watching you tube and netflix easy on my big screen- absolutely recommend.", "verified": true, "helpfulness": "0/0", "author": "Shana"}, {"rating": 1.0, "review": "Had to return as defective.  Would not stay in the slot.  Was refunded the money with no problem.", "verified": true, "helpfulness": "0/0", "author": "Purlitzer reader \"Purlitzer reader\""}, {"rating": 5.0, "review": "This thing is amazing.  I need to order more for all my HDMI tv's.  I love just using my phone to control the tv and put up netflix.  and now that it has broadcast what the phone displays. I can watch online tv shows who don't support chromecast easily!!!", "verified": true, "helpfulness": "0/0", "author": "B. Renken \"Photographer\""}, {"rating": 3.0, "review": "Pretty basic streaming player. I would give it a 5 but i can't get amazon prime on this (which i knew beforehand) but it still prevents me from giving it a 5. you do need to download an app and have the apps you want to play on your phone for it to work (i did not know beforehand) but if you already have netflix, youtube, etc on your phone, like I did, then it's a non-issue. if you need something for cheap this is the way to go but I would love to know the difference in the Roku streaming stick (also more expensive).", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 3.0, "review": "Just ok. Apple TV is much better", "verified": true, "helpfulness": "0/0", "author": "MOACIR SUHAI"}, {"rating": 1.0, "review": "Never got it to do anything useful.  Ultimately it never was able to cast a tab/window and that is what I really hoped it would do...tried everything.  Maybe next model.", "verified": true, "helpfulness": "0/0", "author": "TEConnor"}, {"rating": 3.0, "review": "Pros:- Great resolution/clarity- Lets you watch your phone/computer on your TV. This includes TV shows you might have missed, twitch.tv, etc- Smart in a number of ways. For instance, when you start casting it will turn on your TV and switch it to the Chromecast inputCons:- If the wifi connection drops for even a moment, you need to run back to your computer to start casting. No automatic reconnect- Cannot adjust the screen area via chromecast. It is cutting off the edges on two of my TVs (about 15% each way). This causes some streams to lose vital information- Support is via google forums. Answers tend to be basic. No clear way to provide feedback for beta products (the Chrome extension)", "verified": false, "helpfulness": "0/0", "author": "M. Klimp"}, {"rating": 5.0, "review": "The perfect element for tv home highly recommended", "verified": true, "helpfulness": "0/0", "author": "hellfish2"}, {"rating": 5.0, "review": "Gift recipients loved it", "verified": true, "helpfulness": "0/0", "author": "James"}]