[{"rating": 5.0, "review": "Such a flawless, easy set up, for the price this device can't be beat. I use it a lot at my girlfriend's house who doesn't have a smart TV. I typically use it to watch Netflicks streaming from my Ipad. What is cool is that you can stream it and then still use your ipad for other web surfing.", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 4.0, "review": "Limited amount of downloads with apple products. Bought a movie on Google Play and can't watch it with Chromecast as it is not compatible. But Netflix and HuluPlus work great.", "verified": true, "helpfulness": "0/0", "author": "ELLEN D BUTLER"}, {"rating": 4.0, "review": "I like the concept of the Chromecast, but Google is dragging its feet in allowing other developers to utilize the APIs. I'm glad Hulu and Netflix are there, but there is much more that I'd like to see, like Vimeo, Crunchyroll, and Spotify. Heck, even allowing casting of games would be great. Until then, I am more apt to use my Apple TV since it has more available to stream and can mirror my entire iOS device...not just \"approved\" apps.", "verified": true, "helpfulness": "0/0", "author": "CLPhoto"}, {"rating": 4.0, "review": "I bought this device originally to complement my Apple TV but it has all but replaced it now. I used to have an iPhone and iPad but have since moved onto an Android phone and Nexus 7 tablet. When I was part of the Apple ecosystem, everything worked great with Apple TV with it's Airplay and streaming music from devices or PC, it was great.Now that I'm using Android based devices, I wanted to give the Chromecast device a shot for 2 very specific reasons:* I watch a lot of You Tube and Netflix. Apple TVs interface for You Tube and Netflix (or the one built it into my Bluray player for that matter) isn't exactly the smoothest to use. Searching, typing, navigating around can be cumbersome and klunky. Now I'm able to queue up things, navigate, search both You Tube and Netflix with ease on my Nexus. The best part is once I queue up something to play, I can continue using my tablet without disturbing the playback or draining my battery. I can search for that next set of You Tube clips I want to play and add them to the queue.*I stream most of my TV from my laptop since I cut the cord. I have had very little issues streaming content from a website to my TV through the Chrome browser. Now I don't have to have an HDMI cable hooked up and I have my Chromecast connected to my receiver so I get everything over my home stereo system. Occasionally there are some hiccups like it stops playing or rubberbands but by and large it works very well for not needing any wiring.Those two points alone and the ease at which I can do them are worth the $35 to me. I still use my Apple TV but primarily it's used for streaming my music from my PC, catching up on NBA, NHL or MLB highlights with their respective apps for free or checking out the Apple Trailer app to watch movie trailers. That's probably about 10-15% of the streaming I do though and the bulk is now handled by the little Chromecast.I'm docking it a star because of it's lack of ability to have the option to do true mirroring like Apple does & the inability to send local content easily to the Chromecast. If it was able to do that, this would be a phenomenal device but I understand that Google is more or less in the hosting/cloud content business.I love it and recommend it but know what purpose you want to use it for. It's serving my purposes quite nicely. If you have the majority of music being housed in iTunes like myself, having the Apple TV just to stream to a home stereo system is justification enough to have one the Apple TVs too. They complement each other pretty well in my setup and uses.", "verified": false, "helpfulness": "1/1", "author": "Achtungg"}, {"rating": 4.0, "review": "Even thought this device only works with a few apps currently, its price and simplicity make it a winner.Setup is very simple. Plug it into the HDMI or your TV and walkthrough the setup process to get on the wireless network. Make sure you have the Chromecast apps on your devices and start streaming to the TV.The only problem is the lack of apps. When that is fixed this device will be well work 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 4.0, "review": "The image quality is not up to par for me, but it works well otherwise.  The image tends to be on the cooler side and is brighter than it should be.  It's very easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Dat"}, {"rating": 5.0, "review": "I won't go into major detail on how it works. I can say this:-It's easy to setup-Its easy to use-its cheap in comparison to other options out thereFew complaints:-Google is starting to limit what you can do with it.  Locally hosted videos are not super easy to use, if you can open them in Google Chrome  you can stream it but you can't just stream from a video player.-Amazon video is not easy to use with it.Buy one!  $35 and it does a lot", "verified": true, "helpfulness": "0/0", "author": "C. L. Trujillo \"Lane\""}, {"rating": 2.0, "review": "Ok, after all that hype I got it.  It works great, its easy to use, but it only has two apps: Netfix and Hulu.... I only use Netflix.Anyone one if this product is going to develop?", "verified": true, "helpfulness": "0/0", "author": "Richard A. Muirragui"}, {"rating": 4.0, "review": "When it works it works fine. However it drops out occasionally - probably more to do with the internet connection than the device.I recommend it.", "verified": false, "helpfulness": "0/0", "author": "Howard Friedlander"}, {"rating": 5.0, "review": "Bought it the day it was released. I was hoping it would be a replacement for a miracast adapter (i thought it had the same functions). To my amusement, the product is very limited function wise. You cant mirror what your doing with your android phone nor tablet (I own the nexus 4 phone and the nexus 7 tablet). I gave it to my parents and they love watching netflix on their tv.", "verified": true, "helpfulness": "0/0", "author": "Oscar A. Fernandez \"Oscar Fernandez\""}]