[{"rating": 5.0, "review": "Works great, I have a 3 year old HD TV.  Easy to install, Have wireless internet.  Hooked up to my lap top and desk top.", "verified": true, "helpfulness": "0/0", "author": "greenbird97"}, {"rating": 5.0, "review": "This is a cheap, great little option. For the price, I am not going to complain much...it's a tad slow, but who cares. Once you get the show pulled up you want to watch there aren't any issues. Pretty cool little device that you can easily move around to TV's, even take out of town with you and plug into the hotel TV if there is a spot for it.", "verified": true, "helpfulness": "0/0", "author": "Amanda M"}, {"rating": 1.0, "review": "I was sent a malfunctioning product. It is not recognized by any TVs. Cannot be connected. It turns on but the white light does not go on when connected to the TV", "verified": true, "helpfulness": "0/0", "author": "Jordan Suls"}, {"rating": 1.0, "review": "Be careful buying this garbage, product of the war between Microsoft and Google. If you have newer Windows and a program requires Microsoft Media Player, forget about transmitting it to your TV set, or transmitting it at all. IT DOES NOT WORK.", "verified": true, "helpfulness": "0/0", "author": "Stanley Kwiatkowski"}, {"rating": 3.0, "review": "I use this on a daily basis and it does not always work. I have to re-booth it every once in a a while especially when two people switch screen back and forth. I still like it  and use it daily since it works with all my electronics (computer, phone and tablet) although not so great for laptops. Other than a couple of glitches, I like more than using an HDMI cable with my computer", "verified": true, "helpfulness": "0/0", "author": "Maria L. Jimenez"}, {"rating": 5.0, "review": "Got this as gift from a friend. It was so easy to setup, Now I can watch youtube on my TV and control everything  from my smart phone. it was so clear and fast, beat the small screen on my phone anytime.", "verified": false, "helpfulness": "0/0", "author": "Heather"}, {"rating": 3.0, "review": "Not what I was expecting.  I wanted to be able to see what I play in my phone transmitted to my TV.  Not the case.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Ramirez"}, {"rating": 5.0, "review": "Once again a affordable product from google. Streaming movies from tablet and laptops are easy using chrome.it would be nice if the device can get its power directly from the hdmi port , instead of the cable", "verified": true, "helpfulness": "0/0", "author": "Jaffer"}, {"rating": 2.0, "review": "I have Comcast and trying to get it to work with my cable modem was shall we say... a pain. Finally got it going with some work a rounds but it's never really be stable. Seems to work well for others though so give this whatever weight you think it's worth. YMMV", "verified": true, "helpfulness": "0/0", "author": "Mark Gardner"}, {"rating": 5.0, "review": "The Chromecast player has worked well on two different brand TV's and with all devices I have tested it on including Iphone 5S, Chrome table, desktop and laptop for Netflix and Youtube. The only drawback is that you cannot send web pages from a smart phone or the Chrome tablet. It does work to send pages from a laptop however you can only send one page at a time. Even with the listed drawbacks I gave it 5 stars due to the low price and quick portability.", "verified": true, "helpfulness": "0/0", "author": "DBMechEng"}]