[{"rating": 5.0, "review": "Everything I expected and better. For the price, it does a lot! I recommend this to anyone looking for a cheap media streaming device.", "verified": true, "helpfulness": "0/0", "author": "Chivaughn Charles"}, {"rating": 1.0, "review": "Can't get to work put in back in box oh well", "verified": true, "helpfulness": "0/1", "author": "Tommy e roberts"}, {"rating": 4.0, "review": "Great product. I been constantly having to reset it though. Not sure if it's the Chromecast or my TWC internet. I woul tend to believe it's the internet provider. Only downside is that there aren't a lot of TV providers casting yet. I use it when I travel and it's great for HBO, Starz, Showtime, ESPN and Netflix.", "verified": true, "helpfulness": "0/0", "author": "D. Brax"}, {"rating": 5.0, "review": "Love this!!! There are so many apps for this as well.", "verified": true, "helpfulness": "0/0", "author": "Guitar Playa"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "JERONE GLASFORD"}, {"rating": 5.0, "review": "Absolutely love my Google Chromecast.  Had I known about this little device before buying a new smartTV for my bedroom, I would have just purchased this instead, saving me hundreds on a new TV.This little guy just plugs into the back of the TV and is able to receive a wireless signal from my Laptop, Phone, or tablet.  I can stream any Video streaming service to it; and even 'cast' individual GoogleChrome pages to my TV as well.", "verified": true, "helpfulness": "0/0", "author": "Adam DeLay"}, {"rating": 5.0, "review": "Awesome product.", "verified": false, "helpfulness": "0/0", "author": "greeenteeee"}, {"rating": 5.0, "review": "I love it...use it with real player to cast movie's I download.. channel 7 app let's you cast soon...ESPN let's you cast", "verified": true, "helpfulness": "0/0", "author": "Raul R."}, {"rating": 5.0, "review": "How did I live before this? My only complaint is that television shows don't autoplay the next episode on netflix. I heard that they do if you have the smartphone app though, so once I can get a smartphone I'll have no complaints! I love that my computer doesn't need to be awake for the video to keep streaming.", "verified": true, "helpfulness": "0/0", "author": "Emma Andromacy"}, {"rating": 4.0, "review": "This device turned my old LCD TV into a smart TV, which is great. However, it can be a little buggy.", "verified": true, "helpfulness": "0/0", "author": "Richard Eduardo Gandara"}]