[{"rating": 5.0, "review": "I am loving this.  Plugged into a TV and can watch Netflix & Amazon Prime movies.  Also found some great shows.  Classic Cartoons, U Tube, appts.  Pick up and move TV to screen room or backyard.  Just need electric to plug in.", "verified": true, "helpfulness": "0/0", "author": "Dawn Bibeau"}, {"rating": 4.0, "review": "Probably pointless to review this with over 20k reviews as I doubt anyone will see this.But wanted to add that I have both Fire TV and the Fire Stick and suggest you go straight for the Fire TV even if you have to pay to have a hard line network cable run from your router to the box. It is SO much better.No lags, no twirly thing, just a way better experience!", "verified": true, "helpfulness": "1/1", "author": "MakeItSo#1"}, {"rating": 4.0, "review": "Lots of feature and apps. Fast startup. Except: No power off button. Lack of Wireless AC standard.", "verified": true, "helpfulness": "1/1", "author": "PC"}, {"rating": 2.0, "review": "I was lead to believe that all of the movies were free . It doesn't work on Android Tablets ! If you want any current movies EXPECT to pay for them !", "verified": true, "helpfulness": "1/3", "author": "David J Rappa"}, {"rating": 5.0, "review": "OMG it arrived on Sunday and I was excited Amazon is the only one that delivers on Sunday. And I set it up super easy love it. Amazon is the best", "verified": true, "helpfulness": "1/1", "author": "Bxcatgirl \"Love Patricia Briggs and Sherrilyn Kenyon and J.R Ward\""}, {"rating": 4.0, "review": "Lost wireless connection off and on. Better with RJ 45 connection. The movies I want to watch are not prime.  It costs money. I would rather just want TV.", "verified": true, "helpfulness": "1/1", "author": "jack wong"}, {"rating": 3.0, "review": "This is my second unit, so not real sure how to rate it. When it's operating it's a 5/5 awesome. I've had this unit 1 1/2 days so I guess I'll let you know in a few more days.", "verified": true, "helpfulness": "1/1", "author": "WILLIE MEIERS"}, {"rating": 5.0, "review": "I managed to purchase a refurbished unit for $85, and this is the best upgrade for a home theater pc. The response time is good, and variety of apps are great. Obviously, you have good integration with all things Amazon. My only knock is not having the vudu app on here. I'm also hoping to see the Sling TV supported on this device. The form factor is small, and since the unit uses a bluetooth remote that doesn't require line of sight, I've mounted the Fire TV behind by TV.", "verified": true, "helpfulness": "1/1", "author": "Sonny Bautista"}, {"rating": 5.0, "review": "I am seriouly glad I decided to purchase this product! Wow, life is good!!Lots of Apps, along with lots of cool features!!", "verified": true, "helpfulness": "0/0", "author": "Timothy Harris \"Mr. Tim\""}, {"rating": 5.0, "review": "We bought this for a Christmas gift and the recipient loves it.", "verified": true, "helpfulness": "0/0", "author": "Fix All"}]