[{"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Kathy Inman"}, {"rating": 5.0, "review": "It was very easy to set up. Got all my apps like all the different prime videos available. Not dis appointed at all, in fact ordered fire stick for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Sandra Heart"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/1", "author": "Emili Suero \"suero\""}, {"rating": 4.0, "review": "awesome piece of work....", "verified": true, "helpfulness": "0/0", "author": "Clint Carbaugh"}, {"rating": 5.0, "review": "It's everything I expected and more.....I love it!", "verified": true, "helpfulness": "0/0", "author": "Dan Hewitt"}, {"rating": 5.0, "review": "Great unit, super fast. Better than Roku, or any other. No waiting for it to buffer.", "verified": true, "helpfulness": "0/0", "author": "William Medina"}, {"rating": 5.0, "review": "Totally love my amazon tv!  As a prime member I would watch stuff on my laptop but now I just switch my hdmi on my tv and I am good to go. I have never had a bad experience with amazon (unlike apple) and this product lived up to all my expectations.  In fact I love it so much I bought the amazon phone and plan to switch out of my apple in spite of so many people dissing the phone.  Unfortunately, there seems to be some Amazon negativity out there which blinds people to the fact that the Amazon phone specs reveal obvious superiority over other smart phones.  But I digress, buy amazon fire tv.", "verified": true, "helpfulness": "0/0", "author": "A. Harwood \"rosebud\""}, {"rating": 5.0, "review": "This is a great device and adds so much more to my TV Viewing.  Easy to setup.  I began using within 5 minutes of hookup.  My TV has only two HDMI ports.  One is used for the DirectTV feed and one was for the Blu-Ray.  Bought an HDMI switch to handle multiple inputs off of one port and it works great with the Fire TV device.", "verified": true, "helpfulness": "1/1", "author": "Thomas K Frazier"}, {"rating": 4.0, "review": "I really like this device.  I don't own a smart tv so I tried a few other devices before I found this one.  This one has the best WiFi speed and the game apps are cool.  The only downside is that the selection from Netflix is better than that of Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "This thing is totes dope... you can totes use it to watch Cary Agos be dope as can be.  That dude is a national treasure.  There should be an episode where Blake Griffin tomahawk jamz all over that Scott Card girl.  Also, Amazon should do a marketing campaign with Big Sean, then give me some royalty checkz.", "verified": true, "helpfulness": "0/3", "author": "Matthew Mouse"}]