[{"rating": 3.0, "review": "It was good bu the casting of chrome browser from laptop was horrible. It is good otherwise for people who do not have roku,google tv, apple tv, ps3, xbox or any other device to connect to their tv.", "verified": true, "helpfulness": "0/0", "author": "akshay jangid"}, {"rating": 5.0, "review": "So much more user friendly than my tv's smart controls. Using my Nexus 7 (2013) and gs3 for Netflix and YouTube is just awesome.", "verified": true, "helpfulness": "0/0", "author": "Bobby"}, {"rating": 4.0, "review": "Very useful purchase, I'm from Uruguay (SouthAmerica) and the device works perfectly fine! I was afraid Google Chromecast does not accept my location, but everything worked really good!The main feature of this device is that you can broadcast Youtube videos and Netflix Films from your PC, Tablet and Smartphone to your HD TV, by plugging it to its HDMI port. Also you can cast a webpage that you are in your PC (not sure if it is possible to do the same with your cellphone).Only one thing, not groovy at all, sometimes there is a delay or freeze between the video you are casting and the TV, and some Youtube playlist does not play all the songs...", "verified": true, "helpfulness": "0/0", "author": "hugo"}, {"rating": 5.0, "review": "So easy! We love it!! You can stream your desktop with it now so its not just for movies/music anymore.", "verified": true, "helpfulness": "0/0", "author": "KJ914"}, {"rating": 5.0, "review": "We have this item connected to an HDMI A/V tuner/receiver in a mid-sized corporate conference room.  Not many providers are supported yet (YouTube and Netflix at this writing), but very simple to use.", "verified": true, "helpfulness": "0/0", "author": "Steven Moore"}, {"rating": 5.0, "review": "Cudos. It is so easy to install and so easy to operate. Few problems here and there but it works great almost all the time.", "verified": true, "helpfulness": "0/0", "author": "reddph"}, {"rating": 4.0, "review": "Love it for the price can't go wrong with this product.i recommend it for anyone EZ to used  and installed", "verified": true, "helpfulness": "0/0", "author": "oakland williams"}, {"rating": 4.0, "review": "Excellent option to stream content from different devices, particularly from PCs. I wish there were more apps to work with.", "verified": true, "helpfulness": "0/0", "author": "Alexander R. Gonzalez"}, {"rating": 4.0, "review": "Love it!!!!! It workes I can wutch on a big screen in my bed!! Gr8 pics doesn't get stuck yay", "verified": true, "helpfulness": "0/0", "author": "meira"}, {"rating": 5.0, "review": "It does not play that well with my apple products but still gets the job done. Its pretty amazing that i can connect everything with this to my television and I hope they are able to get more apps. This doest get rid of my roku but hopefully soon it will.", "verified": true, "helpfulness": "0/0", "author": "Estevan Gutierrez"}]