[{"rating": 5.0, "review": "Love it, can check my mail ,  and all the news from the grand old recliner.", "verified": true, "helpfulness": "0/0", "author": "Nina LeCompte"}, {"rating": 5.0, "review": "Wish I would have bought this sooner! Makes my life much simpler!", "verified": true, "helpfulness": "0/0", "author": "Eric Hansen"}, {"rating": 5.0, "review": "Goodbye U-Verse. with sling TV, Netflix, Hulu, and prime all TV is covered. love the voice search. This will add up to $150.00 a month in savings.", "verified": true, "helpfulness": "0/0", "author": "Ken A Bitter"}, {"rating": 4.0, "review": "I purchased the Amazon Fire TV for use at a vacation home and in particular for use with Slingbox, a device that lets you send your home TV service over the internet to a mobile device , a computer or to a remote TV using the free SlingPlayer app on Fire TV. Fire TV was the only devise of its kind that has a SlingPlayer app. Without Fire TV  the only way to project my home TV service on to my TV at my vacation home is to use my IPhone as the receiving device and connect it to the TV with a HDMI cable. With Fire TV, which I plug directly into my internet router with an Ethernet cable I get a much stronger signal and a wireless remote to operate Slingbox on my remote TV.The Fire TV remote is excellent, especially the voice activated search feature which enables you to search for just about any content available in a flash without having to scroll through reams of screens and program guides.I also down loaded an app from the Fire TV app store that enables me to mirror anything on my IPhone on the TV screen, including photos, videos or anything appearing on my phone such as internet content that may not be available on the Fire TV.The Fire TV worked very smoothly and easily. I have not had enough time to try out all its features yet and if they all work as well as what I have tried I would give it five stars.", "verified": true, "helpfulness": "1/1", "author": "chris colavito"}, {"rating": 5.0, "review": "Works really well! Can't complain at all!", "verified": true, "helpfulness": "0/0", "author": "Jaspreet Loodu"}, {"rating": 5.0, "review": "Spectacular!", "verified": true, "helpfulness": "0/0", "author": "John Ventura"}, {"rating": 5.0, "review": "Great product. Works like a charm. Rare downloading problems. Loads rapidly.", "verified": true, "helpfulness": "0/0", "author": "Arthur V Ciampi"}, {"rating": 5.0, "review": "I absolutely LOVE my Amazon Fire TV!!!!  I cannot tell  you enough how much I am enjoying this.  Easy to set up, the mount on the back of the tv keeps everything out of sight and I'm just really happy with the whole thing.", "verified": true, "helpfulness": "0/0", "author": "Fruitloopz"}, {"rating": 1.0, "review": "I hate to say this, but to be honest, this had to be the worst buying decision ever made.  I have a subscription to Daily Burn and it constantly buffers.  Netflix is a laughing joke.  A lot of the programs don't work or constantly buffer.  I would not recommend this product but would probably stay with my Roku box instead.", "verified": true, "helpfulness": "1/6", "author": "Andi \"Book-Lvr\""}, {"rating": 4.0, "review": "The Amazon Fire TV is a great product but it stops playing the movie constantly. I don't know if it's the connection or what but it makes it hard to watch. Other than that I like this product.", "verified": true, "helpfulness": "0/0", "author": "Sandra M. Rodville"}]