[{"rating": 5.0, "review": "We found the setup a piece of cake, the remote simple to understand and use, and the search process (especially the typing) much better than our Samsung smart DVD player's).  We love the clarity and excellence we're getting from our Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Walter R Knox Jr"}, {"rating": 4.0, "review": "I think it is not as good unless you have prime to go with it. Prime should be discounted if you get Fire also.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Once i plugged it in it was as easy as 1.2.3. So easy to use and the best part is  you can play video games on it. Been playing the Walking Dead (got the game controller for it) had to stop tho bc i was getting frustrated with the game. But other than that LOVE LOVE LOVE the FIRE TV. I brag about it to everyone!", "verified": true, "helpfulness": "0/0", "author": "Phillip"}, {"rating": 5.0, "review": "I love my Amazon Fire! The voice search is great, it has a simple interface that's easy to use.  It doesn't take up much space and allows me to watch movies, t.v. shows, play games or listen to music with little effort.", "verified": true, "helpfulness": "0/0", "author": "Michele Ryckaert"}, {"rating": 5.0, "review": "The week Fire TV came out our son moved out taking his game platforms that we had been using to get Amazon Prime and Netflix, so getting a Fire TV was a no-brainer. It exceeded my original expectations and is easier to use than the game platforms. Once again Amazon has hit it out of the park. I considered my Fire TV to be as essential to my life as my Kindle Fire HDX 8.9, on which I am writing this review.", "verified": true, "helpfulness": "0/0", "author": "$ubteacher"}, {"rating": 5.0, "review": "EASY to set up. took 10 minutes MAX. I have had Prime for a long time and never used the free video rental feature; now i will.Buy the HDMI Cable from Amazon (about $7.00), it is not included.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works well. Really fast and works as advertised. However, connecting it wasn't as easy as advertised. There was a small problem connecting to the Comcast modem/router. Once connected it is great. The voice option is useful.", "verified": true, "helpfulness": "0/0", "author": "Sparty 69"}, {"rating": 4.0, "review": "My mom wanted to get rid of her local cable TV service and the combination of Amazon TV + Kindle Fire HDX is a solid combination that affords her superior service at a lower monthly cost. The one things that I was concerned about turned out to be a complete \"non-issue\": TRAINING.My mom is close to 70 years of age (don't tell her I mentioned her age) and it's always difficult to introduce new technologies and new methods of doing learned things for the elderly. (e.g. my mom was still running Windows Vista on a 12 year old PC and has never had a smart phone).To my surprise, she gravitated towards the Kindle like a moth to light and Amazon Fire TV is so user friendly, \"it just made sense to her.\"Well done product development team. While I have a laundry list of featureset enhancements to recommend, for a version 1 product, you knocked it out of the park. Well done.", "verified": true, "helpfulness": "0/0", "author": "D. Thoma"}, {"rating": 5.0, "review": "I have always been unhappy with Netflix because my router would continually buffer or just lock me out.  Ibought a better router and that didn't help. Amazon Fire TV solved it.I find it a little clunky finding what I want. The remote is not user friendly.  I have never been able to get the menu button to do anything, however the buffering question was the main reason I bought it and I love the results.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have to admit that this device works better then I expected.  It's hard to believe that HD movies and TV can be such a high quality and still be delivered over the internet.  Amazon Fire TV is easy to use, works as promised in the advertising and is compact so fits easily on a shelf or wherever I want to put it.  Given the picture quality and the functionality of the device, I use it much more then I expected.  One of the great features is the way movies and TV programs are organized so I can find what I want to view very fast.  It's so easy that I haven't even used the voice command feature yet.  This is a high quality device that is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Ronald C. Brooks \"Ron\""}]