[{"rating": 5.0, "review": "Wonderful little device simple to follow setup instructions for the most part. Small form factor means less clutter as well as being very easy to move, take with to another device. Once setup all you need do is plug it into any TV anywhere. Traveling and using your mobile hotspot just plug it into the hotel TV and you are good to go. If you go somewhere and cannot access your network and need access to a new one? Simply setup, it will find that network, you enter in the password and you are good to go.Of course for tablets you need the \"chromecast\" app. Download that before you do anything else. Also download the \"remote cast\" app as it will allow your tablet to do double duty as a remote control.Then plug the chromecast dongle into a vacant hdmi out on your hdtv. Next if you have a usb port on the TV just plug the cable that comes with in and then into the chromecast to power it. If no usb on the TV chromecast comes with a wall usb adapter so that works too. On newer sets you don't even need to worry about the usb power source as the hdmi is powered but don't count on that.Next your television has multiple hdmi outputs so you must select using your TV remote the correct one where your chromecast is plugged in, no different than selecting the one for say your Blu-ray player.You will then see the initial setup screen. Before you get started be sure you know your network name and password as you will be asked. Start the process and soon you are done. It is very simple to do.Next is to set up your devices, from where you will be streaming content, tablet, pc or mac. It is a little different for tablets as opposed to pc's and macs. If you have a tablet at this point you are basically all done just need to set options and get familiar with using it.If using a pc or mac go to the \"google chromecast help\" webpage. Just do a search for that term. Using google search the first item in your results is the link you want. Under the heading \"learn more\" click on the link \"get started with chromecast\" it will guide you step by step even the step where you download the chromecast software to your pc/mac. After having done that just continue through the steps to get a feel for it. (on tablets you use apps directly such as Netflix and YouTube within each upper right corner click on the chromecast icon) but using the chrome browser on your pc or mac device you can mirror anything from your laptop/desktop to your chromecast enabled flat screen.Open the chrome browser then get the \"google cast\" extension. Once installed Click the Cast button in Chrome. Look to the upper right on your chrome menu bar and listed with your other extensions is \"chromecast.\" Sometimes depending on screen size you will need to left click on the >> double arrows to view all your extensions. Otherwise first time right click on google cast for a drop down menu. You will see at the top \"options.\" Left click and then you will see your device with either the generic name it came with or one you have given it during the initial setup process. Under options check automatic resizing and full screen zoom. Then depending on the strength of your Wi-Fi network signal choose the best display quality 720p+, 720p or 480i. Then simply close that tab/window.From then on when you are using the chrome browser and you want to mirror the image to the chromecast device all you need do is go to the upper right corner of the browser, left click on google cast and then you will see your device, \"cast this tab to,...\"whatever you have named your chromecast and just left click on that and momentarily your entire screen is then on your hdtv. Close the tab to end the mirror stream to your television. So be it the front page of cnn, espn or hbogo if you have a pc or mac setup you can get it all via your Wi-Fi network to mirror on a large screen, so long as that television is within your Wi-Fi network range. If not or a weak signal do as I have and pick up a Wi-Fi signal extender. They range from $50 to $100 and can make a huge difference.There is much more you can do with the chromecast and more details I found the best to be at \"techhive.\" Again just do a search and then search there for chromecast. All this may sound a little overwhelming but it really is simple once you get going. It took me about 30 minutes to complete the install on three pc's and two android tablets. After that it took me about ten minutes become familiar with how to use chromecast with either the tablets from apps or the pc using chrome browser tabs. It's the best $35 I've spent in a long time.", "verified": false, "helpfulness": "4/6", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I got this today and it's easy to setup. I used to use PS3 and Apple TV to stream contents from my devices or Amazon or YouTube already. I think Chromecast is great product for someone who doesn't have any those devices. I'm not sure if someone who has PS3 or Apple TV like me will love this device. Also this device needs USB power. So you need to hook it up to two ports with unwanted long wire. Now I see why Google doesn't want to mention it in any photos and even promo videos. It looks clutter. This made everyone confused. As a result of wiring with USB cable, well, it looks weird. Overall, it's great device but not super yummy.* Is there anyone who got a redeem code for Netflix? Is it by email from Google? I know the promotion is over but I heard buyer who ordered before 1pm PST can redeem it. But how?- Update : Amazon updated its product info. It says \"Customers who ordered their Chromecast prior to 5:31 PM PST on July 24, 2013 will receive a Netflix gift code via email within 5 days of their product's ship date.\" Thanks for letting me know, jonsid.- Update : I heard you don't need to hook up to USB if you have HDMI 1.4 ready TV. I'm not sure about it since my TV doesn't have it but it seems it's true. Check out your TV.", "verified": true, "helpfulness": "15/24", "author": "xoundbox \"xoundbox\""}, {"rating": 5.0, "review": "Picked up my unit after a long ordeal with Best Buy yesterday. Didn't have much time to play with it once I got home, but here's what I did find out:1. It works as advertised from both a laptop and my phone. Don't have a tablet to test it with but I imagine it would be the same experience as the phone. I was able to watch several youtube clips and netflix without loosing connectivity. BTW, I'm using a linsys WRT54G running DD-WRT on comcast in a 2400 sq ft 1 story house. The tv is at one end and the router at the other. I still get 4 out of 5 bars of signal on this unit, unlike my smart bluray player that gets 1-2 out of 5 bars of signal in the same room.2. I have a 2 year old Sharp LED but apparently the HDMI ports don't have power. Luckily the usb port was right there. The cord for the usb cable comes with a velcro tie wrap to take up the excess length so it remains out of sight.3. Music streaming from my phone was pretty cool. The song, cover art, artist name, etc are all displayed on the tv screen and I was able to control the volume also. Was unable to find a way to play \"side-loaded\" (songs on your sd card) songs though. Hopefully there will be an update to do so in the future, If not, im sure somebody will figure it out.That's all I have for now. I wish I'd bought more for my kids rooms (to control their programming remotely). Looks like i'll be waiting a while for that. Oh yeah, IF YOU'RE LOOKING FOR ONE OF THESE AT BEST BUY, BUT YOUR STORE IS SHOWING NO INVENTORY, CALL! I called mine and was told that they had 6 even though the website said \"ship to store 3 - 5 days\". They weren't even on the floor when I got there; just sitting on the counter in the pc department because there hadn't been a shelf made for them. I'll update more as I learn.", "verified": false, "helpfulness": "1/1", "author": "Quen"}, {"rating": 4.0, "review": "I got this initially because I thought with the 3 months free Netflix promotion it would cost me next to nothing.  Unfortunately they decided to rescind that promotion so I was 7 hours shy of qualifying for that.  Still it is a neat gadget I hope to have work for me in the future more than I can actually use it right now.Currently I have Blu Ray players on all my TV's which have WiFi connections with a ton of apps.  Those all work seamlessly and without any delays or buffering.  I am hoping that with the increased apps and support that the Chromecast will become more useful for me.At $35 it has a lot of future potential.It was very easy to set up my Chromecast.  It was up and running in just a few minutes and I have tried out everything from Netflix to all the content I happened to have on the various tabs of my computer.  When playing a YouTube video at 720P it did have some issues keeping up, it was not entirely smooth as if I were watching it directly on my computer or through one of my WiFi capable Panasonic Blu Ray players.I am trying to find a dvd player that will work within a browser so that I can stream a DVD or BluRay from my laptop to a TV using Chromecast.  If I am able to find a way to do this it would become immediately much more valuable to me.Since you need to power the Chomecast via a USB power source and my TV does not have a USB port I have used the A/C adapter but have also successfully used a 12,000Mah battery I bought new from Ebay for 10.33 which is designed to charge smart phones and tablets.  I am waiting to see how long the capacity is for using it with Chromecast.  I have not had the time to measure that yet but am happy that I have this alternative way to power up the device.I had been hoping to use this with TV's in hotels but apparently that does not work.  There is an article on Cnet discussion this issue.  I doubt many hotels will want to let go of their very overpriced movies they offer but right now there are issues with using a hotel's WiFi with Chromecast.  Hopefully this will be resolved in the future to make it possible for this use.So Chromecast is a good idea, a neat device and has lots of potential.  It is new and very limited in it's apps which I think is going to expand for sure.  As for some of it's other limitations it is a wait and see situation.  I use many Google features from the Chrome browser to storing my music on Google play for free to using free Google Maps as a navigator on my smart phone.  Those all work exceptionally well and have remained free for a long time which is great.  Hopefully Chromecast will become as useful to me as those applications.The best part is that I only have that $35 at risk.", "verified": false, "helpfulness": "0/0", "author": "thomasterrible"}, {"rating": 4.0, "review": "just got it.  the set up from the box was easy.  but it does have a power wire that i wasn't aware off before.  not a big deal.i have 42 Vizio dumb LCD tv that we don't use since we subscribe to cable.  so it was just hanging on wall, until now.the set up via computer was kind of easy.  we have mac, ipad, windows and Ubuntu systems.  first i tried Ipad, no luck. don't currently support it.  might in future.  then i tried mac.  had a hard time getting the download file to install in application folder (i'm not mac user) then went to windows.  it took 3 min and i was up and running.  one issue was that window system was plug in to LAN and not on WiFi, so i had to unplug LAN and let it sit on wifi for few.  once it was detected the network, it worked.i just tried \"casting\" hd clip from Ubuntu system via chrome browser and it worked great.  same for hulu.iPad chrome still don't have support for casting.  it should be updated soon, but not sure when.for not, i have to use either mac, pc or ubuntu to \"cast\" movies, but that's not a big deal for me.  the fact that my stupid TV will be used again...........priceless ($35)will be waiting on other options such as pictures, movies on hard drive.  right now the chromecast cant steam that over to tv.  maybe some app developers will incorporate that feature in, but for now its mainly chrome browser.UPDATE: 7/27/13i was able to CAST movies on my HD to the dumb tv via chrome browser.  picture quality was great.  try this method:  1. open chrome.  2. open folder where you have movies stored.  3. COPY the file name (Cnt C), 4. go back to chrome and paste the file name in to the address file:  /home/files/TV Shows/?????.mp4  5. click the CAST botton and go watch you show.this worked with Ubuntu base desktop.  it should work for all others as well.STILL running in to other technical issues:  i can CAST VOD of the desktop running ubuntu, but can't CAST the same show running on Win 7 platform.  not sure whey.  CAN CAST HULU from both platforms.  the casting is still in BETA form, so i'm keeping my rating at 4 for now.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Get this if you are only going to use it for netflix and youtube.  It works seamlessly with these sites.  However it is not ready to cast directly from chrome.  It has audio problems.  It streams very jerkily.  It was just not ready to put out for this purpose.  I will update my review if these problems are fixed.", "verified": true, "helpfulness": "17/25", "author": "Shon Adamson"}, {"rating": 5.0, "review": "[...]Join the FB page here keep up to date, learn more and see what other users are doing. Excellent product", "verified": true, "helpfulness": "0/10", "author": "Usa"}, {"rating": 5.0, "review": "Google's Chromecast is brilliant. I mean really brilliant. The fact that any chrome tab can be \"cast\" to any dumb TV is amazing. It was so easy to setup and works amazingly well. So far, there is no noticeable lag or delay and quality is amazing - I tried playing a Netflix video and it worked very well. I'll revise this review with more findings as I get to use it more.(You rock Amazon. It's amazing I already have it in my hands.)", "verified": true, "helpfulness": "1/2", "author": "Sankara Rameswaran"}, {"rating": 5.0, "review": "Though I had ways to play netflix or youtube from my blue ray player before, searching for content and displaying was a pain. I had similar problems even with the xbox for content consumption, as input is much better with a device that you use all the time. Its not that its not possible, it is just that its not easy.With this product I found it very easy to choose the content I want to play on TV. Even youtube.com/willow never used to work in my earlier blueray player even with subscription. Yesterday was able to play quite a few videos from there without any hiccup. I havent tried their live broadcasts, so not sure it works 100%.I also have google music subscription. My yamaha receiver doesnt have bluetooth, so it isnt easy to stream digital music to my receiver at home. With this I was able to stream directly to the receiver at very high quality, surely not possible with the gadgets I have at home.I had multiple profiles / users for youtube and music subscription. I was able to smoothly transition between multiple users in a tablet and still chromecast content.I initially tried connecting the dongle to TV and then use optical out to receiver, but that caused the AV source to switch to different in the receiver for every new song (Possibly a bug). I instead connected it to the receiver and things work like a charm.I have seen quite a few gadgets that tries solving this problem. This is the first one I felt solves my needs. I tinker around with stuff quite a bit, so I rarely buy Apple products. I cant compare to Apple TV experience, but can certainly tell it is better for online content consumption than any product using a remote with buttons, including google tv. The experience with the 35$ dongle is sure worth it.", "verified": true, "helpfulness": "3/4", "author": "Sriram"}, {"rating": 5.0, "review": "Had it out of the box, plugged in, connected to my network and streaming Netflix in about 3 minutes. Simplicity rocks. I've got XBox Gold, Roku, HDMI cables for my laptop and phone, but this device is perfect for it's ease of use. I'll definitely be dropping it in my pocket to carry on vacation, business travel, etc. And, since the SDK was just released, app develops will have other streaming apps working soon I'm sure. Looking forward to seeing what sort of functionality the hackers can get out this little piece of streaming hardware.", "verified": true, "helpfulness": "3/4", "author": "Bryan"}]