[{"rating": 4.0, "review": "Excellent unit with a great selection of content.", "verified": true, "helpfulness": "0/0", "author": "ChasmJ."}, {"rating": 1.0, "review": "I purchased this unit to get away from unwanted and added fee's for no contract cancel at any time programs I didn't want.I do not Recommend buying this product and adding Prime to the package. I just finished the 30 day trial and do not want to pay for a full year. I was told today that monthly options are not available. I tried to purchase Hulu today to try that and was told I can't until I pay the  annual fee for prime. So I have purchased a product that I can't use after the initial 30 days unless I pay for a year upfront on a product I'm not sure I want to keep. Dissatisfied Customer!", "verified": true, "helpfulness": "3/5", "author": "Bill C"}, {"rating": 2.0, "review": "We had the Apple TV and debated between getting another Apple TV and Amazon Fire when getting one for our second TV. What a mistake getting the Fire as a Comcast customer. You can't use the HBO Go app, Showtime Anytime app, or XFinity to go. All of these are available on Apple TV. If you have another provider, Amazon Fire TV is definitely the better deal as long as you don't mind not having the use of airplay.", "verified": true, "helpfulness": "3/4", "author": "Brian Davis"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Mario Perales"}, {"rating": 5.0, "review": "We LOVE it!!! We are able to stream netflix with hardly any buffering. :)", "verified": true, "helpfulness": "1/1", "author": "pamela vickers"}, {"rating": 3.0, "review": "Bought it when they released. It has been a bit glitchy but works OK most of the time. Amazon customer service has been great but they are still working out software bugs. In time, they will get the software worked out and then it will be a much better box.", "verified": true, "helpfulness": "0/0", "author": "KirkMoto"}, {"rating": 4.0, "review": "Good selection. Great picture.  Some of the shows through Netflix keep freezing up for some reason but most play fine.  I bought the amazon fire tv stick as well for the bedroom.  Great reception from my wireless router in the other part of the house.  I am going to buy the game controller next.  Good bye 100$ cable bills!!", "verified": true, "helpfulness": "0/0", "author": "Sherry S."}, {"rating": 5.0, "review": "very cool and easy", "verified": true, "helpfulness": "0/0", "author": "Michael J Heacock"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Walter J."}, {"rating": 5.0, "review": "great device...really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Heyward Drummond"}]