[{"rating": 5.0, "review": "I'd like to start by saying Wow, thank you google. We loved the Chromecast so much that we purchased a second one and even a few more for gifts. It just makes our viewing experience alot more simplistic. Practically anything we would like to see on the television can be streamed from a phone, laptop, tablet, etc. I personally believe that these types of devices are the future and Google is paving the way for a much anticipated POST big cable company world. Would definitely recommend to anyone.", "verified": true, "helpfulness": "0/1", "author": "Daniel J Mott"}, {"rating": 5.0, "review": "Straight awesome. I have hosted several epic karaoke parties using Youtube.", "verified": true, "helpfulness": "0/1", "author": "MC"}, {"rating": 5.0, "review": "Love everything about this. Bought one for every TV.I have been stealing cable for over 15 years but never really watched TV. They recently went all digital and I no longer could get a signal and I missed the background noise but found myself continuously hitting mute for all the commercials.Now I still have the background light and only watch what I want to watch and with no commercials!", "verified": true, "helpfulness": "0/1", "author": "Apu"}, {"rating": 5.0, "review": "Great product from  google!", "verified": true, "helpfulness": "0/1", "author": "Andrew"}, {"rating": 1.0, "review": "Pretty worthless unless you want to pay for Google's overpriced movies.  Installed OK but you need a computer as a controller. The interface can be confusing.Another negative, the default content providers on Googlecast i.e. Netflix, HULU do NOT include AMAZON PRIME.  I strongly recommend getting the Amazon link product if you are an Amazon Prime subscriber.", "verified": true, "helpfulness": "1/2", "author": "L. King"}, {"rating": 5.0, "review": "Excelent product. Work fine for me", "verified": true, "helpfulness": "0/1", "author": "Aristides Falcon"}, {"rating": 4.0, "review": "I like it so far, after a week's use. Very easy to set up. I was worried about using my smartphone and/or tablet as the only remote, but have overcome that fear. Once it finds your plugged-in Chromecast, downloaded the Chromecast app and Chromecast remote, works better, for my uses, than my 7 year old Roku box. Faster action f than the Roku remote, nicer interface. I currently use it only at home, but will broadcast on my phone or my tablet. I currently only subscribe to Netflix monthly, which is fine with me in conjunction with a nice big cable bill that I don't have to pay for; I just happen to live here. For the budget-conscious, I paid just under $23 for it, plugged the included AC adapter into the wall, and it gives a very nice HD signal on my 720p HD (capable of 1080i) eight year old teevee.", "verified": true, "helpfulness": "0/1", "author": "elvis2013 \"elvis57\""}, {"rating": 3.0, "review": "A major problem in areas with poor internet providers", "verified": true, "helpfulness": "0/1", "author": "Philip M. Carswell"}, {"rating": 5.0, "review": "Very good and perfect condition", "verified": true, "helpfulness": "0/1", "author": "Rinks"}, {"rating": 3.0, "review": "When this works, it's great.  But it only works about half the time.  I can't plan on a night with Netflix, I can only hope.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}]