[{"rating": 5.0, "review": "Handy Gadget...helps avoid HDMI cables and allows use of TV as monitor in hotel rooms. Set up was easy. Wish it supported Chrome on iPhone", "verified": true, "helpfulness": "0/0", "author": "Phil Singleton"}, {"rating": 5.0, "review": "Excellent product for the price. You plug this in to an HDMI port of your tv and provide it with an power (all chord as included). Once you change the input on your TV to the selected HDMI port, you will be required to hook this dongle to your wifi. You can do it ehrough your regular tv remote, so set was a breeze.Now actual working - Uses are pretty limited right now. The compatible apps are Netfllx, YouTube, HBO®, Hulu Plus, Pandora, Google Play. I have only used youtube on this and found this pretty easy to use. Once you tell you tube to cast the video (on ur phone, pc etc), you can close the video on the phone and the video will keep playing on the tv.However, possibly the best feature is the cast a tab feature. Anything that see on your chrome browser can be sent to your tv (videos, webpage etc). The downside is that the browser needs to remain open while the video is playing. I have not noticed any lag in videos so that is good. However, you will probably not be able to use ur pc for anything else. Note that this does not more when playing amazon videos because of the technology amazon uses to play videos. However, it does work with normal hulu website.All in all for $35, a very good product.", "verified": true, "helpfulness": "0/0", "author": "vik"}, {"rating": 3.0, "review": "Come on Google...you could do better. Why haven't you guys make possible to stream stuff from the android tablets or smartphones using this device? Why is it limited to Netflix and Youtube? Anyway, the installation is simple and works flawlessly...but I still think it could do more.", "verified": true, "helpfulness": "0/0", "author": "Victor Bastos"}, {"rating": 5.0, "review": "Chromecast is an awesome way for iPad or iOS or Android mobile devices to control video on your big-screen LCD TV. The quality and performance are great.For now, the only things that work are YouTube, NetFlix, or HBO GO. Looking forward to a lot more coming...The only drawback was the half hour it took to download the firmware update the first time I plugged it in and connected to my WiFi.", "verified": true, "helpfulness": "1/1", "author": "GeoFan \"GeoDude\""}, {"rating": 4.0, "review": "Only had the item for a few days. So far, so good but haven't had much time to play with it. I'll most likely upgrade the stars to 5 once I've tried access to other sites besides Netflix. Although, once I connected to Netflix, it worked like a charm.How can you go wrong for $35.00?Mr. William", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 2.0, "review": "Good concept but VERY POOR implementation so far. Purchased and Returned.Let's start with the lack of apps... Nearly 4 months after release, still barely any utility for use with mobile devices. You can only stream music via Google Play. You have Netflix, Hulu Plus, HBO go. But if you have a device that already does those like just about every DVD player or TV these days, chromecast doesn't shine or add much functionality. Additionally, you won't burn the battery on your mobile device or have to rely on a separate \"control\" if you have a universal remote. You can't stream local files or movies from your mobile devices. No other apps have surfaced after 3+ months (except tic tac toe). I purchased it primarily with the hope of being able to stream from my Nexus 7 to a TV on vacation visiting relatives to share pictures and movies from our visits. But that is not possible. Yes, I should have done my research but it was an impulse purchase. Anyway that also leads me into my second beef with chromecast....Poor router compatibility.... Just to get it up and running at home, I had to experiment with my wireless router settings (Netgear WNDR3700v2). It would not work with the wireless N network and I eventually had to throttle my wireless speed down to 54Mbps on the G network to get it to even connect. - potentially limiting streaming quality. Tried another older linksys router that was replaced by the Netgear and experienced similar difficulties. Neither were on Google's workaround list for routers with known issues. This is NOT what you should have to go through to get a device like this up and running. It should be very much \"plug and play\" not \"plug and pray\". This will become even harder if you are on the road and do not have access to the router settings where you are. I simply cannot see putting yourself through the headache if you do not get lucky and chromecast connects without a hitch. It'll be a hit or miss proposition when you are travelling. No guarantee - so why risk it?All in all, I'm quite disappointed and was expecting more since my Nexus 7 (2013) is such a great tablet. I'm going to return it and get a miniport adapter for wired connections and a netgear Push to TV for wireless with Mircast. With screen mirroring, I can do everything and more on the Nexus natively than Chromecast can do after 3+ months. Sure it will cost more but I won't be limited by the VERY FEW THINGS IT ACTUALLY CAN DO.Overall opinion: SKIP IT.", "verified": false, "helpfulness": "3/3", "author": "James Tindill"}, {"rating": 4.0, "review": "Google made a great device. It streams from my tablet with ease.I wish it ran on 5 Ghz band, or over a person normal network. It works basically from Wi-Fi device to device, so don't expect a computer that is connected by Ethernet to a WiFi router to be able to stream.", "verified": true, "helpfulness": "0/0", "author": "Lowsky1208"}, {"rating": 5.0, "review": "I love it chromecast. It installs easy. It is easy to use. It combines the internet and the TV. It is now time for silly cat pictures casted from my computer to my TV. <3", "verified": true, "helpfulness": "0/0", "author": "Kristina R. Anderson"}, {"rating": 3.0, "review": "I can't say I regret purchasing my Chromecast, but it's often an exercise in frustration if my internet connection isn't operating at maximum speed. You don't get to set the quality that it uses, and sometimes playback just freezes rather than telling you it's buffering. Actually, sometimes it doesn't even seem like it's buffering. The YouTube app on my phone will spontaneously lose/forget the connection, forcing me to exit the application and reconnect. Lockscreen controls usually take two taps to do anything, as if the first tap is just to make it reconnect. There aren't many supported services, and there's not much of an advantage over just hooking my computer up to my TV. Hopefully Google opens things up a bit in the future.", "verified": false, "helpfulness": "0/0", "author": "Riley"}, {"rating": 2.0, "review": "Need more apps, it only plays a few. I was expecting more, disappointed. I was expecting more especially when it's a google product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]