[{"rating": 4.0, "review": "It is such a simple, small, yet entertaining product. Setup is very simple, streaming is awesome, audio video quality is good as well.We can play a locally saved video from google chrome browser nicely, a little lag, but not too bad.", "verified": true, "helpfulness": "0/0", "author": "TW"}, {"rating": 5.0, "review": "I bought this as a way to stream media to our TV, Things like Netflix and Youtube ( and hopefully in the future, Spotify!!!) from our new Chromebook laptop. Gotta say its pretty great, the quality is fine for viewing, not THE BEST, but that is likely our router versus the actual unit itself. Dont care it does exactly what i had hoped and no more wires and cables from our TV to our laptops just to watch some movies via Wifi ( we dont have any other devices that play these things)It also works on my 2013 Kindle Fire HD 7\". I was very happy to find that after a little searching on the internet, i was able to get it working within around ten or so minutes without getting too technical with my Kindle.Too bad that Amazon has its features so locked down on the kindle because Chromecast is a much better service than Miracast, for sure.", "verified": false, "helpfulness": "0/0", "author": "Alicia Holmes"}, {"rating": 5.0, "review": "I bought one, I use it all the time. I use it for Netflix, HBOgo, Google Play, etc. I bought a second one for myself and one as a gift.", "verified": true, "helpfulness": "1/1", "author": "Ryan"}, {"rating": 4.0, "review": "Set-up easy, controls easy; does what it says it will do. It would be nearly perfect if it truly MIRRORED.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Constant freeze ups. Randomly stops working. Not computer issue. Have I7 processor with 8 gig RAM. Worth about 5 bucks for nice screen view.", "verified": true, "helpfulness": "0/0", "author": "HJW"}, {"rating": 1.0, "review": "Billed as streaming all your stuff.  I got it and then find out the nothing on my iphone can be streamed, and no Comcast support.  You can stream Netflix - wow - what can't.", "verified": true, "helpfulness": "2/2", "author": "sheluga"}, {"rating": 5.0, "review": "This product is amazing.  It makes streaming youtube, netflix, etc  from your laptop or phone so easy.  You can also stream whatever is on your screen screen to your tv as well.  It is so easy to use.", "verified": true, "helpfulness": "0/0", "author": "Cherie"}, {"rating": 1.0, "review": "This product is far from ready for primetime. Worked great -- the first time I used it. Tried to connect using the same laptop used for setup and Chromecast could not find network. Tried everything. WAP password was not posted. Other laptops that were not configured with the Chromecast extension suddenly started to see Chromecast as another wireless network.  Returned this item.", "verified": false, "helpfulness": "0/0", "author": "ARN \"JD\""}, {"rating": 5.0, "review": "great product.  Had been using the Wii to watch Netflix, but it would freeze and require reloads.  The Chromecast player loads and plays flawlessly.  Going to be getting a second one for the kids' tv shortly.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Trent Mahler"}, {"rating": 1.0, "review": "A real pain the rear to setup-  I digress to express like the many experienced writers about the equipment used to set up.  I don't need the self gratification of letting the world know about my 70 inch Sony Bravia...etc.One word.  This is an attempt by Google and its advertising payments to gather advertising media, nothing else.And it is NOT easy to set-up.  Try it on a Mac running Mavericks.I gave up.  Not sending it back, will sell to some stool who prays at the Gardens of Google.", "verified": true, "helpfulness": "1/6", "author": "Joe Lynch"}]