[{"rating": 4.0, "review": "This works perfectly for my wife and I. We stream Netflix from my iPhone almost every day. Setup was easy. I just wish it had broader support.", "verified": true, "helpfulness": "1/1", "author": "Sterling"}, {"rating": 4.0, "review": "Got this to take with me on business trips.  I really like being able to watch Netflix and Amazon videos right off of my laptop when I am traveling or in my bedroom where I do not have a Blu Ray player..  I only gave it four stars though for one reason and that is it can't connect to all hotel wifi networks.  Some hotels require that you put in a password and login name on a website to connect to the WiFi and I have not figured out a way to do this on the Chromecast yet.  But still for $35, this is a great addition to my suitcase.", "verified": true, "helpfulness": "0/0", "author": "Amanda Tulumalo"}, {"rating": 5.0, "review": "People get way carried away with reviewing this product.  I'm not technologically challenged but not a tech expert that will dissect this product to death!!!  So for those of you looking for a cheap way to utilize your older flat screens this product is perfect.I refuse to pay for cable.  It is stupid to pay for television where it costs hundreds of $$ to watch commercials 40% of the time.  I would rather be at the beach!!!  I only pay for services that offer commercial-free streaming which is limited to Netflix and HBO (correct me if I'm wrong).  Of course we all know of the \"forbidden\" sites you can stream from as well but this product will not allow you to do it so you'll just have be a little creative and use your laptop or tablet (which you can plug into your tv with an HDMI and stream whatever you want from the internet).I like that I can use my iPhone and stream on my older tv and it is simple to use.  You don't have to be a computer geek to figure it out.  Plug and play.  Love the simplicity of it all!!!  Yes, it would be great if Google just removes all the stupid restrictions on what sites you can stream because you can get around it anyway.  So Google, what's the point?  Give it up!!", "verified": true, "helpfulness": "0/0", "author": "Ivanka B."}, {"rating": 5.0, "review": "My wife and I use this more than we tune into normal tv to broadcast netflix to our tv here at home and at our cabin up at the mountains. WELL WORTH THE $35 SPENT!!!", "verified": true, "helpfulness": "0/0", "author": "Mitchal G. Miller"}, {"rating": 2.0, "review": "COMMERCIALS in YOUTUBE Google pays Add Blocker to not work. After the window to return the device commercials started to appear and could not get the device to work. Would like to return it but its too late.", "verified": true, "helpfulness": "0/0", "author": "CustomMotoredBicycles"}, {"rating": 1.0, "review": "I returned it after fighting with it for a week. The network wouldn't connect it, It wouldn't get a signal but my table next to it did just fine. It finally installed and hooked up to only give me download errors after 2 seconds of the movies. Not worth the trouble it took to return it. Still waiting for the credit.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 4.0, "review": "What I wanted was an HDMI connector so I could connect my little Android mobile device to the big screen so I could play my lectures/presentations and videos. Since my Nexus 7 does not have an HDMI connector I thought I would try the Chromecast instead. It does not work for this purpose so at first I didn't like it.Chromecast works very well with the YouTube application.So I hooked it up on the big monitor and sound system in my dining room. When we have company I set it up in advance. The Chromecast puts up some nice pictures that no-one notices. So when someone talks about their favourite YouTube video, I pull out my Nexus and we can all enjoy the experience. We end up passing the nexus around arguing about who has the best video. Since some of us like to sing it usually turns into a sing-a-long. So I guess now I like it.The Chromecast requires modification to the application to work. There are a few applications in the play store that are modified. The applications that seem to work best are from internet broadcasters like YouTube.Vimeo does not appear to be supported yet ....", "verified": true, "helpfulness": "0/0", "author": "traveler \"traveler\""}, {"rating": 5.0, "review": "Excellent device, works great with my Nexus 4/7 ( Youtube, Google music, etc. ). Great value for your money .", "verified": true, "helpfulness": "0/0", "author": "David Hanhart"}, {"rating": 5.0, "review": "We have missed TV shows and found them on line and used an hdmi cable to connect the laptop to the TV to stream.  The Chromecast is very easy to set up and actually works!  I haven't seen other reviews that mentioned how to get off line content to the screen but I figured out what to do.  I went to the pictures location on my computer and copied the address at the top, I then opened Chrome on my PC and pasted that address in the address line and clicked on the Chromecast icon and cast it to that tab I just created.  The pictures are just listed but when clicked on will show up on the TV after a few seconds.  I hope this helps someone trying to put content from their computer hard drive on the TV.", "verified": true, "helpfulness": "0/0", "author": "Joe E \"joeeth\""}, {"rating": 1.0, "review": "if u have smart tv, is throwing money in the trash buy itlost moneyproduct is not effectiveterrible", "verified": true, "helpfulness": "0/1", "author": "gilmar poubel"}]