[{"rating": 5.0, "review": "This works very well for streaming movies. Instead of viewing films on my computer I can now send them to my T.V. screen which is much more convenient and pleasant.", "verified": true, "helpfulness": "1/1", "author": "J. Becker"}, {"rating": 5.0, "review": "I got one and it worked great, it messed up a little bit so I ordered a replacement one. And the replacment came with in two days and that one works great. I'd defenetly recommend to buys this if you don't have a smart tv", "verified": true, "helpfulness": "1/1", "author": "Jose_Balle"}, {"rating": 5.0, "review": "It came quickly, set up was relatively easy.  Have been watching all the world cup games on TV using watch ESPN app on iPad.", "verified": true, "helpfulness": "0/0", "author": "Daniel Wespetal"}, {"rating": 3.0, "review": "I purchased Google Chromecast for $30 at BestBuy in December.  While it is a good product I have a two issues:- Picture does not to seem to be as high-res as Roku- No physical remoteThe no physical remote is why I ended up getting a Roku3 and using the Chromecast on my basement TV.  I didn't realize how much this would annoy me.  With Netflix there are no commercials to FFW through,  so why would I need a physical remote?  Simple answer,  it is a royal PITA to have to open up my phone if I need to pause or rewind the streamed content.", "verified": false, "helpfulness": "0/1", "author": "PopsicleMan"}, {"rating": 5.0, "review": "Very happy with it. The only problem is the YouTube app for kindle. The version available does not work with the Comcast. It does not have that option. The iPhone app however works perfectly", "verified": false, "helpfulness": "0/0", "author": "Marimer"}, {"rating": 5.0, "review": "For 35 USD it is an amazing product but still it cannot replace a normal cable. i recommend it to every person.", "verified": true, "helpfulness": "0/0", "author": "Said"}, {"rating": 3.0, "review": "Met my expectations .good deal for the price.easy to use.no problems operating or switching between t.v.s.satisfied fully.i recommend  chromecast to anyone.", "verified": true, "helpfulness": "0/0", "author": "Norah Rothery"}, {"rating": 1.0, "review": "Work great for the first week and then Netflix completely stop working. You tube works fine but the main reason for purchase was for Netflix.", "verified": true, "helpfulness": "0/0", "author": "computerdude"}, {"rating": 5.0, "review": "To heck with buying things like Roku or Apple TV. The Chromecast is great. I think it'll get more and more attention and more and more apps using it. If you have a decent wifi signal to the part of the house it's located, it'll do you well.", "verified": true, "helpfulness": "0/0", "author": "CT \"Amazon Nut\""}, {"rating": 4.0, "review": "Plenty of the more useful reviews on this will be better than mine, but the one thing I would suggest is missing is the ability to use your mobile's signal to stream over a non-internet wifi network to the TV.  I had a 4 week period with no cable and no internet but had a wifi signal at my house and discovered that i had to sit and watch my phone while my 50\" TV sat idly by.  Only a small caveat, but this would be nice from my perspective.  I could then only have a phone internet plan, then get HBO/Netflix through my TV which is all I watch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]