[{"rating": 2.0, "review": "Did not meet my expectations.I bought a Fire Stick and it is much better.", "verified": true, "helpfulness": "0/3", "author": "skiya"}, {"rating": 4.0, "review": "works great except on smart tv which does cause issuesnice to eliminate the hdmi cable!have one on 2 tvs and love it", "verified": true, "helpfulness": "0/0", "author": "Tim Devaney"}, {"rating": 5.0, "review": "Shallow learning curve.  Can downgrade Dish and save some $", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The easiest way yo make a smart tv from a dumb tv. Easy setup. Intant satisfacción.", "verified": true, "helpfulness": "0/0", "author": "ivanv4"}, {"rating": 5.0, "review": "Love this thing", "verified": true, "helpfulness": "0/0", "author": "juan Batz"}, {"rating": 1.0, "review": "We bought this to try and it wouldn't even connect to our internet. Would have been nice to know that it only connects to some modems and not all before buying.", "verified": true, "helpfulness": "0/1", "author": "ihearangels"}, {"rating": 5.0, "review": "Although, i have a ps4 which can use netflix but using the chromecast save me electricity. Love this little device, highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Emmanuel"}, {"rating": 5.0, "review": "Greatest thing ever!", "verified": true, "helpfulness": "0/0", "author": "SMC1986"}, {"rating": 5.0, "review": "works great and we love it", "verified": true, "helpfulness": "0/0", "author": "R. Daniel \"bigmama\""}, {"rating": 5.0, "review": "The only thing I regret about this device is that I didn't buy it sooner.It's very easy to relocate. If I decide I want to stream in another room all I have to do is unplug the power cord from the wall and the hdmi cable from the tv. It is approximately 2 inches long by 1 inch wide so it's very portable.It's easy to set up. All you need is a wifi connection and a tablet or smartphone. Set up took me less than five minutes.This device gives me a wider variety of content to stream than my smart blue ray player. All you have to do its download apps to your smartphone or tablet (ex: Netflix, HBO GO, YouTube, Pandora,  etc...) and select the chrome cast symbol in the app.(NOTE: Netflix and HBO GO both require a subscription in order to use. If you currently subscribe to hbo you should be able to access HBO GO.)The best part of the HBO GO  app is that I can access season 1 of true detectives. I am unable to access the show through UVERSE's HBO ON DEMAND.I would definitely recommend this product. You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]