[{"rating": 2.0, "review": "It was a complete disappointment -- I thought I would be able to stream movies or my own video files from a notebook or a smartphone, or at least broadcast snapshots made by a smartphone.In reality: - Chromecast is too slow, so Full-HD movies or videos produce significant lags - Chromecast audio codec support is poor, so chances are you movie won't have sound - Slideshow of photos via Chromecast takes too long to load next image, so it is pain to wait - There are too few applications in Google Play that support Chromecast, and those that do in most cases are paid (or required in-app purchase to support Chromecast) - The Chrome browser plugin is not stable (at least on MacBook Air), it crashes periodically and requires restartThe only use case for Chromecast today is watching Youtube video, which it does pretty good (not counting a few minor issues).", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 4.0, "review": "Have used on one PC and two different HD TVs. Works but not as intuitive as the advertising would have one believe.", "verified": true, "helpfulness": "0/0", "author": "james wilson \"jhw\""}, {"rating": 2.0, "review": "Work as expected, but after latest update, couldn't connect to my TP-Link Wi-Fi. Waiting for an upgrade to revert the situation.", "verified": true, "helpfulness": "0/0", "author": "hernan prieto"}, {"rating": 4.0, "review": "I think that it is dependable and it is fast with connectivity to wireless internet and  it has a really low percentage in buffering or interference and it is user freindly to connect to device", "verified": true, "helpfulness": "0/0", "author": "mike turner"}, {"rating": 5.0, "review": "Easy, fun, and efficient. Must have for all streaming video watchers. I've pretty much ran out of Netflix movies to watch.", "verified": true, "helpfulness": "0/0", "author": "Reed Elkins"}, {"rating": 4.0, "review": "This Works Great To Stream Netflix using your smartphone or ipad. I would haven it 5 stars if it streamed Amazon Content too.", "verified": true, "helpfulness": "0/0", "author": "Amy Augustine"}, {"rating": 5.0, "review": "We were having a lot of trouble streaming Netflix on our tv. It kept stahling out and we would have to reload the the program several times during each episode. It was just awful. Now we stream with no problems and it couldn't be easier to use. So simple just unplug the old wire in the back of the tv and then plug in Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Cinder"}, {"rating": 5.0, "review": "We've had the 60\" TV in the living room for 3 years now. After plugging in the Chromecast was the first time I used it. Now, everyone in the family can find me on the living room couch instead of my basement corner.", "verified": true, "helpfulness": "0/0", "author": "kafeaulait"}, {"rating": 5.0, "review": "Buy one at Amazon after hookup to my TV and do all the set up , wow ! the best youtube player via your smart phone or tablet so far , it streaming videos from youtube smoothly without buffering . For $35 I was very please with it so I go to Bestbuy and buy 3 more , one for my other TV, the other two for my sister , she also very happy with it .", "verified": true, "helpfulness": "0/0", "author": "safari"}, {"rating": 4.0, "review": "The Chromecast was an easy setup.  Just plug one part into an HDMI input and the other part to the USB port on the back of my TV.  I wish there were more apps.  I am waiting to see what else I can get from my iPhone to my larger screen TV.", "verified": true, "helpfulness": "0/0", "author": "cshueh"}]