[{"rating": 5.0, "review": "I made a great investment. I bought three boxes and my daughter loves it. I think you should buy it.", "verified": false, "helpfulness": "1/4", "author": "Imaniwint"}, {"rating": 2.0, "review": "I admit it, I don't get why this exists. It just doesn't make sense to me. At this price point, I don't see any reason to invest in this thing.But don't get me wrong at all. There's nothing critically wrong with Fire TV, not really. Actually, it does a lot of things a *lot* better than the other standalone media devices or services, like Apple TV, Roku, and certainly the disaster that is Android TV, not to be confused with Chromecast, a totally different thing.But $100 for a streaming device? A hundred bucks? For what? It doesn't make sense to me. Was everyone really that dissatisfied with their decade-old PlayStation 3's, their Chromecast dongles, their $50-or-so Roku boxes? What about Smart TVs or Smart Blu-ray players that do the same thing? What about the things we already own?Seriously, what *doesn't* have the same capabilities these days to stream the same media? And when are these guys who make these things going to get that voice control is just not a good-enough feature on its own for most people? I don't know about you, maybe you absolutely must have voice control, but I don't. And I definitely don't think that's a feature worth $100, even if it works for the most part.Since the \"Gaming\" part of this setup hasn't even really been established at all, that's not reviewable. It might as well be left out, because, uh, it sort of is left out for the time being. It's not a factor. It's the same thing as a 3D Blu-ray player, many of which you probably own, but never once used the 3D feature. Yeah, it's there, but it doesn't matter, and it doesn't have to be there.Until this somehow stands out just a little more from the myriad devices that throw in \"Smart\" features that already let us do everything this thing does, I don't follow what makes this important, right now. It's so late to the party that I can't imagine it being a hit. But it doesn't stand out, not really. It's a great media box, for sure, but it's also an astonishingly-expensive media box that does the same thing other media boxes do well-enough, already.But chances are you already know all this. Chances are very high you already *have* a media box of some sort. Me, I've got PlayStation 3's acting exclusively as \"Smart\" Blu-ray players, since they're just about the best Blu-ray players out there, and they're *really* cheap. They've only gotten cheaper as time goes on, and it's not like the PS4 was a necessary step up for most people when it came to that regard.That frightening Gary Busey-looking guy (is that really him?) who looks like he just escaped from Arkham Asylum aside, this box doesn't really break any fantastic new ground. This is an extremely saturated market for devices that can stream media, and you've got to include things like the Nexus 7, too, or anything else that can hook up to a TV and stream HD content, too, in the same way.Is a voice-search function worth $100? I don't think so. Amazon's a great company, and their Kindle Fire HDs (not so much the HDX's, but that's a different story) were and still are pretty damned good devices. But if I remember right, those can hook up to a TV, too, can't they? I'm almost positive that they can. But even if it couldn't, there's no way anyone doesn't already own *some* device that streams media just fine. You'd have to be actively dodging them to have missed it.For the time being, I can't give this a high grade. I mean, yeah, it works, and it works very well. But it's incredibly expensive for what it does, and what it does is already being done--and has been done--for many, many years. I just don't see the need this device fills, except for possibly a niche audience that absolutely must have voice control, and nothing else will do.Other than those people, though, this is a no-brainer: You don't need to bother.", "verified": false, "helpfulness": "5/18", "author": "Christopher Engel"}, {"rating": 5.0, "review": "Several years ago I purchased a Roku for our living room. It worked great but we wanted to expand this type of viewing to other HDTVs. This was an easy decision since Amazon stands behind what it sells. The device arrived on time with great packaging. It was beyond easy to install--if you can plug a lamp in, then you can do this install. After its programming is updated, it goes to a start page that fully explains this device. The Fire TV is about 25% the size of our older Roku. The Fire TV does a voice search which is very fast! Just say the Title you want and it finds it fast. No more searching menus for what you want to watch. If you're thinking of this type of device, try this one!", "verified": true, "helpfulness": "1/1", "author": "mark95man"}, {"rating": 4.0, "review": "We absolutely love our Fire. The only thing we were surprised about was that the most of the latest movies cost 5.99 to rent. The free movies are fairly old. I had to purchase Netflix with another monthly bill, to get movies to rent for no additional cost. It is simple to set up but you will need to purchase another HDMI cable. But like I said, its easy to install if you have WIFI.", "verified": true, "helpfulness": "0/2", "author": "James A. Norton"}, {"rating": 5.0, "review": "Since I opened the box I have been looking forward to doing this review. I ordered it and in 2 days had it delivered. The box and how it is packaged kind of gives you an idea of how well this device has been thought out. First it is about as big as two stacked pieces of  bread, which was surprising. Second the hook up and set up was intuitive. The on screen instructions are great too. Make sure you know your wifi password and that you gave an hdmi cable...Operating this little dream is so easy, fast and convenient. I have all the same  features in my Samsung TV and Panasonic  Bluray DVD but they take so long to load up it isnt worth the bother. The Fire loads quickly and is intuitive. This box is a design that is the best of Apple and Microsoft rolled into one. If you have Prime you need this to take advantage, easily, of all the free programming.", "verified": true, "helpfulness": "5/6", "author": "mike \"mike\""}, {"rating": 1.0, "review": "Picked this up as a replacement for my WD Live TV media player.Pros:Installed easily right out of the box.Access to Prime media was a selling point for me.Cons:Limited to apps that Amazon wants you to have. (It runs Android 4.2, unlock the thing and let me load what I want.)Doesn't access network shares without an app. Only app Amazon allows is Plex. Plex doesn't see ISO files as media like my WD does.Box could be real sweet if the developers as listened to what people use these things for. I may try one again if its opened up.", "verified": true, "helpfulness": "14/26", "author": "Scott Hackathorn"}, {"rating": 4.0, "review": "This little device is great.  Fast, it reacts almost right away very impressive. Voice search on the fire TV is the best I have used on all my devices. Only one thing that really bothers me is you can't really control what apps you want on top. Reason being not everyone will be focused on straight media from amazon. I use plex as my main app, as I have digitized all the blurays and DVDs I own. Main reason I bought the fire TV was the support of plex. Now that aside I couldn't be happier.  They could always add then ability down the road anyway.", "verified": true, "helpfulness": "2/2", "author": "Alex"}, {"rating": 5.0, "review": "The amazon Fire TV has made all other similar boxes obsolete.  Great program selection and with Amazon Prime membership there are numerous movies to watch for free.  Have already bought another unit as a gift.", "verified": true, "helpfulness": "2/3", "author": "IslandOne"}, {"rating": 4.0, "review": "So Im opened to innovation but some of your reviews don't make sense, soooo get what you want but seriously for those of you who say get an Xbox1 or all televisions have internet capabilities.....well reality check people that's why we say different strokes for different folks. I have a HDTV w/ no internet capabilities. Its almost like your asking for someone to invent laziness don't be upset that you cant play PS4 games on the WiiU ( oh im sorry that hasn't been invented yet). You guys are soo persnickety with things that are way left field. My mom doesn't own a game system BECAUSE SHE DOENST PLAY THEM so she has a streaming box, ya get it. You don't like the remote?...then get innovative and invent a better one, if you think they can do better than suggest it, don't whine about it. ugh anyways the system is GREAT for what it is INTENDED to do..Thank Amazon", "verified": false, "helpfulness": "1/3", "author": "d.Wade"}, {"rating": 5.0, "review": "Amazon fire is fantastic! It was easy to set up and easy to use.  This is a great product, worth the money!", "verified": true, "helpfulness": "1/2", "author": "Brenda"}]