[{"rating": 3.0, "review": "I dont know where the issue is. It suddenly drops off and I have to connect again. Overall a great product", "verified": true, "helpfulness": "0/0", "author": "Vishnu Vijayakumar \"dealdemon\""}, {"rating": 2.0, "review": "We are on the apple platform do this didn't work for us.  We would have to spend more money on google apps that we just didn't need just to listen to our music, and the apps that we wanted to use were not available on the apple platform.I was hopeful about this product but it didn't work out, maybe they can make it better in the future.", "verified": true, "helpfulness": "0/0", "author": "K. Mask"}, {"rating": 5.0, "review": "I love my Chromecast. It's so handy! Makes watching Netflix so much easier.Only problem I've run into, which is basically my fault cuz I'm lazy, is that if it's plugged in in my living room, and I'm in my bedroom and forget it's in my living room, and go to start up a show on Netflix, it'll switch over on the living room TV with no notice. So if someone is out there, it switches automatically to what I accidentally turn on. Whoops!But I completely love it. I got one for my boyfriend for Christmas, fell in love with it instantly, as did all his friends. Now we all have them! Such a great little toy!", "verified": true, "helpfulness": "0/0", "author": "Leslie Knechtel"}, {"rating": 5.0, "review": "Now all we need is for Amazon prime to get connected with it. It did take a few minutes to set up, but after that it works great. I am actually going to use this on my boat this summer!", "verified": true, "helpfulness": "0/0", "author": "TheWolfTc"}, {"rating": 5.0, "review": "I really like this product and I totally use it for Netflix. Clarity is awesome compared to other streaming device. Youtube works great too. It is very easy to use as we can control it from your phone or tablet or laptop. I totally recommend to everyone who has TV with HDMI input.", "verified": true, "helpfulness": "1/1", "author": "Manasa"}, {"rating": 5.0, "review": "It is cheap, (35 bucks) it is EASY to install, just plug it into your TV. What amazed me is that it casts with greater resolution than my high tech Laptop and my Ethernet plug in.It5 casts Netflix with great accuracy, much less download time. YouTube is a gahst and when you want to show pictures to your family, just upload them from anywhere in the nation/world to your Google + account and walla, you have them on you TV, high resolution large picture show.Way to go Google!", "verified": true, "helpfulness": "1/1", "author": "Matt Schuster"}, {"rating": 5.0, "review": "I have had a Roku for years - and as I added a new TV it was time to decide what I will need to add the \"smarts\" to the TV. I have had smart TVs before and they are typically outdated within a year and the software in them have a lot to be desired - I feel it is a lot better bang for the buck by buying a cheaper \"non-smart\" TV and just add a Roku to it. This time I thought I would change it up and get the Chromecast instead. And boy did it deliver. Of course Chromecast is not for you if you are looking for lots and lots of channels. Its for you if you use Youtube a lot - want the flexibility of using your own apps to look for media and then just one tap on the screen and Wallah - its on your TV.I would have to say I was hoping that it will get power right from the HDMI port - I saw somewhere if you have a recent TV it will work - and I do have a brand new TV so I was disappointed when the Chromecast will not power up from the HDMI port - and I need to add more cables to get it power. If you have a wall-mounted setup with all cables going through a conduit behind the wall this may be something you need to consider. If your TV has a USB port (mine does, but I was using it already for a media drive) then its as simple as connecting the USB cord to your TV's USB port. I suggest getting a short cord so things are a little tidier.Other than that I can't complain. Netflix, Youtube, Hulu Plus, Google Videos, Pandora play seamlessly on the Chromecast from any device. Google says iOS5 is not supported, but I have used an old iPad running iOS5 successfully to cast content to the Chromecast. If you want local content, Get RealPlayer Cloud which can cast videos from your mobile device to the chromecast. And all in full HD.And all this just around a third of the price of the latest Roku. Now I have a Roku in one room and the Chromecast in another - I find myself using chromecast more often because it is so simple - I can go to netflix from my computer and then send it to the TV - a lot better than going through endless remote clicks to find what you are looking for on the Netflix app.Love it!", "verified": true, "helpfulness": "0/0", "author": "Amdroid007"}, {"rating": 5.0, "review": "We are not big users of streaming media, but I've always wanted a media player, for some reason. I could never justify spending $50-100 for something I wasn't going to use, but for $35 I finally pulled the trigger. We use it primarily for letting the kids watch YouTube videos or Netflix. With YouTube it is nice to be able to setup a playlist of \"approved\" videos on our computer or phone and let them watch. They love watching and dancing to the Kids Bop videos.", "verified": true, "helpfulness": "1/1", "author": "Illini Fan"}, {"rating": 3.0, "review": "Love it it works well just as expected,  I bought the book Unlock your chromecast,,it recommends downloading PLAX  well it sounds good but it gave me nothing but problems, i first downloaded to my windows 7  my system crashed,  took it out but it just would not go away,, took 5 hours to get my PC working again,  so i tried downing loading to my mac 6.8 again caused problems, so guess I will use my HDMI cable, That PLAX was nothing but trouble,  ??? has any one else had A problen with Plax ??  Chrome cast worth the money", "verified": true, "helpfulness": "0/0", "author": "William T. Montgomery"}, {"rating": 5.0, "review": "Nice for traveling as it allows you to stream Netflix, etc. from your tablet or phone. Also nice if you have multiple TVs and only one game system.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Auditore"}]