[{"rating": 1.0, "review": "My experience with Google Chromecast was an extremely disappointing one. First, it would now power up correctly. After about fifteen minutes, unplugging everything, replugging everything back in, rebooting, and using 2 HDMI ports I finally got it to simply power on correctly. THEN it had trouble connecting to my network. After three attempts, it finally got online. I could have put all of this behind me, but then I tried casting something onto the TV and found the sound lagged extremely with the picture. Plus, the picture was horrible quality! All in all, it was a disappointing purchase. I'll stick with my Blue Ray player and the \"old fashioned\" plugging my laptop into my TV through an HDMI cable.", "verified": true, "helpfulness": "3/5", "author": "JenS \"junegeminijen\""}, {"rating": 3.0, "review": "I wanted to love this. I really did. While it is a good device for $35, it is not a great device. Yes, I understand it is very cheap, but it is just that: cheap. No, I do not mean the build quality is poor, that is excellent in fact. It is the speed of the device. Everything is just sub-par in terms of load times in my opinion. After using this and going back to my Roku, it is like a breath of fresh air. I would just rather spend another $35-$65 and get the real deal. That's just my humble opinion.", "verified": true, "helpfulness": "0/0", "author": "Brandon Elbers"}, {"rating": 4.0, "review": "For those who stream and watch “online” videos/movies/TV-dramas on the small computer monitors from websites, Chromecast can cast all the videos (in 720P HD) from your PC (from your study or anywhere in your home) to your big-screen TV (in your living room). I used to have a PC (with wifi adapter) next to the TV to do this....now, Chromecast replaces that PC and does a better job. Here are few basic requirements in order to make the setup work:• Wifi (wireless home network) with hi-speed broadband (Fios, cable, etc.) internet connection in your home.• Desktop and/or laptop PC (share the same wifi home network) with Windows7 or 8 or 8.1 OS….Chrome browser installed in your PC is required (free download from Google).• Everything you watch online through the Chrome browser (from your PC) can cast onto your big-screen TV….basically, everything on the internet! Watching Youtube videos/movies is especially good because Youtube has a special Chromecast icon built-in that will produce high-quality HD video. PC must stay on while playing video on TV.• Chromecast also works with most mobile devices (late model Android tablets/smart-phones or iPads/iPhones)….but, only Chromecast-supported apps (Youtube, Netflix, Hulu-plus…etc.) can cast videos onto your TV….and, your mobile device has to be within 20’ from your TV....the mobile device can be off while playing video on TV. Wish there are more apps that support Chromecast for Android or Apple mobile devices though.....• Big-screen LCD/plasma TV set must have HDMI (required) and USB (optional for power) ports.In general, Chromecast works well if this is what you want to do.....", "verified": true, "helpfulness": "0/0", "author": "T. Jen"}, {"rating": 3.0, "review": "I have used chromecast with PC, IPhone, IPad and Android phone.1. Netflix, YouTube and Google play worked as advertised from all the devices mentioned above.. I mean It's really good...2. Chrome tab can be cast to chromecast but I found it bit legging.. except for few websites like YouTube, Netflix (at least these are the one I know) other websites having video does not have way to cast video on full screen on TV.  Considering currently it is on beta, things are supposed to improve with time3. Had trouble setting up chromecast with router (provided by service provider). WiFi crashes as soon as chromecast try to connect to WiFi. Fortunately I had another router, which is playing nice with chromecast.Currently limited to few apps and websites however  I think it is having huge potential. The  way Google is working on it, it looks like in 2014 there will be lots of apps and websites with chromecast support.. Then it will surely deserve 5 stars...", "verified": true, "helpfulness": "1/1", "author": "Lale"}, {"rating": 1.0, "review": "Only works for Netflix and Youtube, I thought it would also work for other applications, like Amazon Prime movies.Oh Well", "verified": true, "helpfulness": "2/4", "author": "Michael"}, {"rating": 4.0, "review": "Left off a star just until more apps are added, because otherwise I LOVE this thing. Price is great, functionality is awesome, even just to start with and just having Netflix and Youtube mainly for native apps, it works great. I don't have the most stellar wifi connection either (my router could use an upgrade as its about 2 years old and needs a firmware update also) BUT regardless of that the Chromecast still works smooth, with hi-def quality video showing on my flat screen. And now that Hulu and HBO GO is available on it, its a must-have for sure. Can't wait until all apps have the compatibility built in to use with Chromecast. BIG FAN.", "verified": true, "helpfulness": "0/0", "author": "Vincent Orleck"}, {"rating": 5.0, "review": "Google has done it again by blowing away the competition with it's own super cheap streaming device. The Chromecast gets better everyday now that more and more apps are compatible with it. It is however worth to note that the Chromecast requires USB power and will take up an outlet if your TV doesn't have a USB port.", "verified": false, "helpfulness": "0/0", "author": "agileconnor"}, {"rating": 1.0, "review": "Don't waste your money. It freezes on YouTube, unwatchable. Few other apps work and picture quality is terrible. Maybe development down the road will improve but it's not even close to usable. Not to mention pics take forever to load.", "verified": true, "helpfulness": "2/4", "author": "TGG"}, {"rating": 1.0, "review": "Not ready for prime time! My friend and I were eager to try this. Did the connection to my TV's HDMI using the player, extender and power adapter (not as simple as the ad photo implies). Then found Windows Media Player does not work, and there were several steps (in developer mode) required to try to get it to work. This prevents me from my primary purpose in buying the device. Going back to Apple TV which works as advertised. Sending this back.", "verified": true, "helpfulness": "1/2", "author": "Canary"}, {"rating": 1.0, "review": "After several phone calls to Verizon (my internet provider) and the Google help line, I finally was able to confirm that the Chromecast device IS NOT compatible w/ the Verizon Actiontec router.  No where is this written but there are many online comments about this issue.", "verified": true, "helpfulness": "1/2", "author": "Nancy Fisher"}]