[{"rating": 3.0, "review": "It performed every task it was advertised to.  I thought the lack of a remote would be eliminated by the use of my phone or laptop.  But if you loose connection or close the apps on your phone, you often loose control of the Chromecast, until you start another video.  Almost perfect - but still missing some software fine tuning.", "verified": true, "helpfulness": "0/0", "author": "Ismael E. Gerena \"Geek of Games, Computers and SciFi\""}, {"rating": 5.0, "review": "The Chromecast can stream Amazon movies, Netflix, YouTube and other services to your TV.  Actually any tab, but others cannot be fullscreen.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I couldn't get this gadget to work on two different computers, even after consulting the google support and other help sites", "verified": true, "helpfulness": "0/0", "author": "Ellores Brailey"}, {"rating": 3.0, "review": "I understand this was an item to stream media for different devices, but had lots of trouble streaming a device with a friend's Wi-Fi with a simple 30 minute episode through the Google Chrome browser cast. It is okay - still kept it for the price. Awaiting further updates to better performance.", "verified": true, "helpfulness": "0/0", "author": "cheesycrabdip"}, {"rating": 1.0, "review": "I have owned the Chromecast for a couple months now and Starting with the last Chrome update 4 weeks ago, the Googlecast Extension, which is required to use with Chromecast, has been crashing in the browser every 10-5 minutes. Google is aware of the problem but they are in no rush to fix the problem.", "verified": false, "helpfulness": "0/0", "author": "R. Smith"}, {"rating": 5.0, "review": "I use it everyday whether its Netflix or just going through my Youtube subscriptions.Its perfect, especially for its price. Works with all the phones, tablets, and computers in our house. No problem with Apple products such as the iphone. Bought 5 of these up until this point. Some for myself and some for friends.", "verified": true, "helpfulness": "0/0", "author": "Stig"}, {"rating": 1.0, "review": "Why should you have to download the Chrome browser for this device to work? I do not feel this product is advertised correctly. I do not like how the  Chrome instructions explain that all kinds of information is collected about you the user, including possibly your phone number??? We need privacy laws back in the United States.", "verified": true, "helpfulness": "0/1", "author": "D \"D.\""}, {"rating": 5.0, "review": "I love it, I would recommended this product to several of my friends and they loved it. This products saves time from going to red box and also the streaming of youtube videos from your phone to your tv is the best feature!!", "verified": true, "helpfulness": "0/0", "author": "Angel383"}, {"rating": 1.0, "review": "I had no luck getting anything more than the start screen to appear on the TV until I called Tech support. After spending 1.5 hours with tech support it will work very nicely with youtube which has the chromecasting program built in but absolutely nothing else. I was unable to get any web pages to cast using the google chrome with the chromecast add-in. I had thought that if google put their name on something it would work.", "verified": true, "helpfulness": "0/0", "author": "Chad Law"}, {"rating": 5.0, "review": "For the price, it's amazing.  Even though it's new and it's full potential has yet to be realized, for sharing web pages, photos, audio, and video it's great if you use the Chrome Browser.  It doesn't play local content (yet), but then for the price I can't mark it down a star.", "verified": true, "helpfulness": "0/0", "author": "Sc0ut3[R]"}]