[{"rating": 1.0, "review": "I just couldn't get it to work. I tried to use it on a Vizio television. I do not have a remote for that Television so nada - I would like to return the unit", "verified": true, "helpfulness": "0/1", "author": "JAN T"}, {"rating": 1.0, "review": "Extremely disappointed that the hype did not live up to the performance. It is,for all practical purposes, incompatible with my cable internet providers in house configuration.There is no useful or practical tech support for the chrome cast device from the manufacturer. \"Instructions\" for trouble shooting problems are non existent or at least obscurely placed on some web site as to be useless. Basically verizon customers check compatibility prior to purchase. Now, how about returning this thing!", "verified": true, "helpfulness": "0/3", "author": "D. Ravensscroft"}, {"rating": 4.0, "review": "It's great being able to play direct to the TV from the iPad. It's a bit unfortunate that it only works with streaming items that have an app, so you have to search for apps. But great quality, and perhaps more companies will start making the apps.", "verified": true, "helpfulness": "0/0", "author": "Lisa P."}, {"rating": 5.0, "review": "I am enjoying using the Google Chromecast - it is great! So nice to be able to stream from my computer to my t.v. and so easy to operate - it operates itself!", "verified": true, "helpfulness": "0/0", "author": "Grace Wilson"}, {"rating": 2.0, "review": "Slow speed from internet to TV causing a lag in speed. The device is nothing compared to Roku 3 which works perfectly.", "verified": true, "helpfulness": "0/0", "author": "David Sauers"}, {"rating": 5.0, "review": "The set up was SUPER EASY and it works great! Definitely the best product for streaming out on the market!", "verified": true, "helpfulness": "0/0", "author": "Kelly Moose"}, {"rating": 5.0, "review": "This is a great product.  My coworker recommended I get it.  It was easy to connect and it works perfectly.  I'm glad I made the purchase and definitely recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "K. Holmes"}, {"rating": 5.0, "review": "so far its great i wish it was avail for Crackle or anything else on the tablet to tv ......!", "verified": true, "helpfulness": "0/0", "author": "Ronnie W. Davis"}, {"rating": 5.0, "review": "I purchased one for my Dad for Christmas and rubbed it in my husbands face (little did he know I also had purchased one for him too and it was already under the tree).  My Dad travels a lot for work and takes his to watch Netflix, etc at the hotel.  My husband liked his so much we have already bought a second one, so both or our TVs have a Chromecast.  Its fun to name the Chromecast as well.  Its very easy to connect to as well.  I can control it form my phone and watch HBOgo, Netflix, etc.  It so nice when there is absolutely nothing on tv.", "verified": true, "helpfulness": "0/0", "author": "Amanda P."}, {"rating": 4.0, "review": "I use Chromecast on the TV in my bedroom and in the Living Room. It's a great way for me to have access to my favorite podcasts and listen to them through the speakers on my TVs. I also prefer using the YouTube app through Chromecast over using the Samsung SmartTV app because it gives me much better control over fast forwarding and skipping sections the boring intros and getting to the real content. For the price, Chromecast adds a ton of value.I look forward to more apps being added to the Google Play Store.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]