[{"rating": 3.0, "review": "Bought this for a kitchen tv to be able to play netflix while cooking or eating in there.  Easily hidden away in the back of the tv and you can't beat the price. If you have a smartphone or tablet this is a no brainer.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have tried a number of things to make my T.V. Netflix compatible. Had a streaming box that was slow and lacked the full functions of each internet stream. Had a blueray player with wifi that never connected to the router. Finally, this little guy, and I do mean little. It plugs in behind the T.V. out of sight, freeing up space the other guys claimed. No more lost remotes - your phone is the remote. If you lose it you can simply call it to find. I can cast webpages, Youtube, Netflix, pretty much everything except amazon prime, which is a shame. It connects quickly. You can pause or rewind a show with your phone still locked. Plus, when it's on but not connected to anything, the screensaver images are breathtaking on the television screen. I cannot say enough good things about it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "So you have to control it via a tablet or pc or phone.  No problem there except it can get annoying if you watch in bed and have to keep grabbing the device you're charging to turn things off.  Could not get Plex to function in any reasonable fashion making it a paperweight at this point.  Plex just keeps pausing and playing and pausing despite playing great on Samsung TV in another room, or even using a Roku box in the same part of the house as the chromecast.  So yeah, it's cheap.  But unless you're just using it for Netflix or Hulu it doesn't do much more than that... but it does that well.", "verified": true, "helpfulness": "0/0", "author": "Steve-O"}, {"rating": 3.0, "review": "Doesn't  have enough aps.  Not even Google search  can connect to it with IPAD. Needs more internet functions like email and news.  Needs more aps like YouTube which works slowly.", "verified": true, "helpfulness": "0/0", "author": "Robert D. Young"}, {"rating": 5.0, "review": "I love it, it make it so easy to share with others what is on the computer, laptop or tablet screen.", "verified": true, "helpfulness": "0/0", "author": "K. Scofield \"angelheartsroses\""}, {"rating": 3.0, "review": "Doesn't work with everything , But it's cheap.AND Like most Google items not as good as the other products made for Macs.", "verified": true, "helpfulness": "0/0", "author": "chuck howard"}, {"rating": 3.0, "review": "Pros:It's small, it fits right behind your TV, and you can use your phone to control it. Let also not forget about its most important feature: the price.Cons:Limited app support. It is an open source device so I can only imagine we will see a lot more software come out for this device, but at the same time its current state is very limited and buggy. I use mine with an iPhone which is even more cumbersome. I have had friends with android phones hook up to the chromecast, but it still had the same limitations, it was just less buggy.Overall:Very cool and innovative device, but not something I would buy for your mom and dad. It would be for a hobbyist or someone who likes testing new technology.", "verified": true, "helpfulness": "0/0", "author": "Joe & Amber"}, {"rating": 3.0, "review": "Lack of free streaming apps really limits this device. I think it will get better though since Google has opened it up to more developers.", "verified": true, "helpfulness": "0/0", "author": "Jerry Kirk"}, {"rating": 3.0, "review": "My Chromecast has a long idling time when it begin to operate. It needs a lot of patience because of idling.", "verified": true, "helpfulness": "0/0", "author": "KIM, BYUNGHYUN"}, {"rating": 5.0, "review": "Now I don't need to turn on my xbox or use the crappy smart TV software. Can't wait for more apps to come to this device it crushes!", "verified": true, "helpfulness": "0/0", "author": "Jordan Gillis"}]