[{"rating": 1.0, "review": "I purchased the Google Chromcast Media player to watch videos on my HDMI TV, but the second time that I used it, I was totally disappointed.  The first time worked fine, but second time it dropped the one hour show at least 10 times.  I never had such experience watching via my Laptop or my smart TV.  This product will not replace your Laptop or a tower that you can connect to your HDMI TV and watch Youtube, Netflix or Amazon primes.", "verified": true, "helpfulness": "0/3", "author": "Fred D"}, {"rating": 4.0, "review": "OK...It is cheap, easy to use, but limited compared to Roku or other options. Word is that they will be adding more functionality but I don't know if it will be available as a free upload enhancement or not.", "verified": true, "helpfulness": "0/0", "author": "Dee"}, {"rating": 2.0, "review": "Bought it to sling Netflix on my iPad to my TV. I have to reboot the chrome cast almost every night because Netflix can't find the device. Sometimes it lags behind, example when I press pause on the iPad it may take it a minute or two before it pauses. Only certain video players will work with it. Not ready for primetime.", "verified": true, "helpfulness": "0/1", "author": "Steven Eubanks"}, {"rating": 5.0, "review": "I don't have cable and got tired of watching Netflix on my laptop when I have a big beautiful TV.  This thing is so easy to use!  Plus I can detach it and hook it up to my bedroom TV in a matter of seconds.  Great device!", "verified": true, "helpfulness": "1/1", "author": "Robonita"}, {"rating": 5.0, "review": "I always used to wish I could send the data from my tablet or phone onto my tv and now I can. Works great for presentations at work and for showing movies with the fam. Love it", "verified": true, "helpfulness": "1/1", "author": "Helena Kelly"}, {"rating": 4.0, "review": "After downloading the app I found the player worked great, unfortunately if the player is plugged into the HDMI input and the player is not used it causes interface.  The picture and sound go out every few minutes, very annoying.", "verified": true, "helpfulness": "0/1", "author": "Richard"}, {"rating": 4.0, "review": "This thing works awesome. The only part I didnt like is that the apps are very limited right now and I had a hard time setting it up with my phone.", "verified": true, "helpfulness": "0/0", "author": "Brian Reid"}, {"rating": 4.0, "review": "works well, not 100% with hulu, but netflix vimeo and the other's advertised with it are great. Great present because it's only 35 bones!", "verified": true, "helpfulness": "0/0", "author": "Kyle H"}, {"rating": 4.0, "review": "The Chromcast works better, superior picture and controls, than my DVD player I was using to view Netflix & Youtube. Disappointed that the Chrome browser app on my iPhone did not interface with the Chromcast to let me browse the internet via my TV. I hope Chrome updates their browser app to do this soon. Then Chromcast would be really worth it.", "verified": true, "helpfulness": "0/0", "author": "David Kandel"}, {"rating": 5.0, "review": "Despite the warning (received after purchase) that it might not work with Windows XP, it nevertheless works very well.  I could have used better instructions - particularly on the setup so as to avoid firewall issues I had to accommodate.  I have a wireless router with a hard wire connection to my computer.  I can control the Chromecast device either from my computer or my Android smart phone.  Once installed, it works great!", "verified": true, "helpfulness": "0/0", "author": "R. F. Mack"}]