[{"rating": 2.0, "review": "Picture is not as good as uverse. Changed settings from auto to 1080p still poor picture", "verified": true, "helpfulness": "2/3", "author": "Russ mccollum"}, {"rating": 5.0, "review": "This is a nice addition to our household...view  movies or TV hits you like when you want -- at the tip your fingers. Voice command finds it fast!...Easy to operate...we are non-techs. Beautiful Screen Saver pics...TV has to be HD ready with an HD port...I called about the requirements before we got this one.  Amazon has many more options available for the Old Silver Screen movies, then Netflix -- if you are into them, as we are. And, no need to buy the newest television to make Amazon Fire TV work...we loved this feature the best!!", "verified": false, "helpfulness": "1/2", "author": "Sherry88"}, {"rating": 4.0, "review": "First product like this that I have bought. I considered buying an Apple TV, however I bought this solely on the specs. I just wish it had DLNA media support without the use of third party apps. I like my Fire TV though since it provides me with instant access to my online content on my TV.", "verified": true, "helpfulness": "0/1", "author": "A Guy"}, {"rating": 5.0, "review": "The fire tv is great, It works even better than i thought it would, I love it and would tell anyone who wants a streaming boxthis is the one to get.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am enjoying this product and really appreciate the fast connection to viewing movies without any buffering effect during downloading process. The actual downloading of a movie is immediate!", "verified": true, "helpfulness": "1/1", "author": "Tx Bear"}, {"rating": 5.0, "review": "Made all the difference in streaming movies and TV shows. It's reliable, and the speech recognition feature is an added bonus. Remote is easy to use. Would highly recommend it!", "verified": true, "helpfulness": "1/1", "author": "Kay Wildman"}, {"rating": 4.0, "review": "Nice addition to Amazon Prime membership", "verified": true, "helpfulness": "1/1", "author": "Bradford R Gilmer"}, {"rating": 5.0, "review": "Great device! \"GARY BUSEY!\"", "verified": true, "helpfulness": "0/0", "author": "Robert H Opramolla"}, {"rating": 1.0, "review": "DOES IT WORKS IN SAUDI ARABIA?", "verified": false, "helpfulness": "1/18", "author": "oozaifa"}, {"rating": 4.0, "review": "The product is light has a small footprint it was extremely easy to setup and using the remote is easy and straightforward. The remote with mic picks up your request the very first time and shows extensive content related to the subject matter Haven't had the opportunity to use any of the other similar devices (Roku, Chrome cast) but they'd be hard pressed to beat out Amazon Fire", "verified": true, "helpfulness": "1/1", "author": "Bryant V. Ulmer \"B. Ulmer\""}]