[{"rating": 5.0, "review": "Easily installed, easy to use.  Now we watch what we want on our schedule--lots of options out there.  Enjoyed by whole family.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just Plug it into the TV port....Plug in the Power...(plug and adapter included) ...Log onto the installation website and let it install itself.Works as retailer claimed (For Me)......Love it!", "verified": true, "helpfulness": "0/0", "author": "Michael Mursko"}, {"rating": 4.0, "review": "Google did an awesome job with this for the price. $35 compared to Apple Tv's $100+ just can't be beaten. But you get what you pay for. It works wonderfully for youtube, netflix, hulu, etc. But when it comes to mirroring tabs from chrome, it gets a bit glitchy. It also doesn't do desktop mirroring yet. Once those two things are fixed, I would give this 10 stars.", "verified": true, "helpfulness": "0/0", "author": "mypennameisblank"}, {"rating": 4.0, "review": "This is not a revolutionary product but I love it!It works really great from my phone but it does not work very well using Chrome browser - it disconnects all the time.Awesome with YouTube because you can queue multiple videos.", "verified": true, "helpfulness": "0/0", "author": "Remy LeBeau"}, {"rating": 5.0, "review": "Easy to install, versatile and soooooo cool! Finally get my Netflix in the bedroom too. Breakfast in bed just got a lot better!!", "verified": true, "helpfulness": "0/0", "author": "Scott Ullrich"}, {"rating": 4.0, "review": "While most of the software is still in beta, and sometimes it shows, its a very neat product and I am excited to continue to mess with it.", "verified": true, "helpfulness": "0/0", "author": "JBrosk89"}, {"rating": 5.0, "review": "SIMPLY AWSOME!  This device has limited apps, but I discovered that if you type \"file:///c:/\" (without the quotes) in your google chrome browser location bar that you can access and play and stream local video through google chrome to your TV, this includes accessing video through any drive such as your DVD drive...just change c to your drive letter in the command above.  It's like finding a file on you local machine using FTP file browsing methods.  Don't worry you can't delete a file accidentally...it won't let you.  Look for user and applications...users...video...etc.  Once you locate where your local video or picture files are located you are basically calling the file up using your browser and running the file...pretty easy. Hint...set a bookmark in your browser to find files easily later once you locate them initially. Theoretically this should work with any file type your google chrome browser can open...such as .pdf .mkv .avi .jpg .mp4 ...etc.  you must have google chrome chromecast installed properly using the instructions as they come with the chromecast dongle.  No extra programs needed.... just chrome browser and chromecast and an internet connection. Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "It does what it says it will do but there are limited services. The picture is clear and trouble-free in all Comcast services", "verified": true, "helpfulness": "0/0", "author": "Russell Dunn"}, {"rating": 3.0, "review": "WHEN USING CHROMECAST WITH THE IPAD NETFLIX APP, NETFLIX AND CHROMECAST LOSE THEIR CONNECTION. THIS HAPPENS EVEN IF AUTO-LOCK IS DISABLED AND THE IPAD REMAINS AWAKE THROUGHOUT THE MOVIE. RE-ESTABLISHING THE LINK REQUIRES POWERING OFF THE TV (AND CHROMECAST), KILLING THE NETFLIX PROCESS, AND DISABLING/ENABLING WIFI.THAT IS VERY POOR DESIGN OR IMPLEMENTATION ON THE PART OF GOOGLE AND NETFLIX. ONE OR BOTH OF THEM HAS FAILED TO MARKET A RELIABLE PRODUCT THAT CAN OPERATE IN A REAL WORLD ENVIRONMENT.i would rate it 5 stars for performance, but the reliebility issue knocks off 2 stars.", "verified": true, "helpfulness": "0/0", "author": "R. L. Enfield \"Ron Enfield\""}, {"rating": 2.0, "review": "I'm trying to use the Chromecast with Netflix right now.  The Netflix movie loads fine on my laptop, but as soon as I try to cast it to the TV, it gets stuck at 25% and fails.Also, if you're planning on using this in hotel rooms you are out of luck.  It's got no way to get past the \"enter your password\" or \"click OK\" type webpages.  So unless you have tethering or travel with a MiFi puck, you won't be using it on the road.", "verified": true, "helpfulness": "0/0", "author": "S. Carolan \"scarolan\""}]