[{"rating": 5.0, "review": "Amazon Fire TV is so easy to use and has such a variety of shows to watch.  I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Greta"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/2", "author": "Sergio C. Alegarbes"}, {"rating": 5.0, "review": "We absolutely LOVE it and it's only been the first day.  We discussed dropping cable T.V. and watching our Prime and Netflix.  Saving $100 per month has been worth it.  We  bought the Fire TV  when it was on sale because we didn't like not having a remote control, and we wanted the larger drive space than the fire stick offered.  We also like that it can be hard-wired or use WiFi.  We don't have any of the other subscription services, so we can't comment on that.Note:  After you connect to your TV and internet, the first thing you should do is update to the latest software.  That's what we had to do to get it to install Netflix properly.", "verified": true, "helpfulness": "0/0", "author": "Texas Tilly"}, {"rating": 5.0, "review": "Excellent.  However Netflix and Hulu offer more value than Prime.", "verified": true, "helpfulness": "0/0", "author": "Kimberly L Stokes-Holder"}, {"rating": 3.0, "review": "I bought it on one of those Amazon one-time-only deals and I'm quite happy with it.  The Fire-TV is basically like the video section of the Fire tablet, but on a bigger screen, and I like that. It does freeze-up on occasion which is why I don't rate it higher.  On average I'mm happy with Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Kevin Powell"}, {"rating": 1.0, "review": "Extremely bad streaming quality.  Would buffer every 30 secs, had it on WiFi at first and then hooked it up through Ethernet and no significant change.  I figured I got a bad unit seeing as how I have a chrome stick and fire stick that work perfectly well over my WiFi.  Sent the thing back and amazon charged me a return shipping fee, like it was my choice to get a defective unit.  I originally wanted a replacement because I really like my fire stick but Amazon made it so darn hard (to get a replacement) that I decided to just send it back.  Unless you want to game on these systems just get the fire stick, the interface is exactly the same and it's much cheaper.", "verified": true, "helpfulness": "2/5", "author": "Randy Bot"}, {"rating": 1.0, "review": "no it did not meet my expectations . Sent it back , waiting on refund. Buying each episode was way to much.", "verified": true, "helpfulness": "2/6", "author": "Vicki Pittman"}, {"rating": 5.0, "review": "Works as advertised.  The voice search is a nice feature. My only complaint is the lack of movies available on prime; although, Netflix doesn't make much worthwhile available for streaming either.", "verified": true, "helpfulness": "1/2", "author": "Kurt A. Omodt"}, {"rating": 5.0, "review": "Love the Amazon Fire TV", "verified": true, "helpfulness": "0/2", "author": "Saul R Sanchez"}, {"rating": 2.0, "review": "just got today I thought it wold speed up my download speed on my smart tv but there is no difference, I have a 55 inch LG tv , yes is is nice to organize my other things like pics but not worth the money. Very hard to watch a movie when you have to wait to see movie. I know it is not amazons fault but when I read there reviews thought that that it would speed it up from my smart tv. so pretty much useless  unless i get faster internet.", "verified": true, "helpfulness": "0/5", "author": "ssimmy"}]