[{"rating": 5.0, "review": "Still learning how to use it, but so far so good!", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "I'm in love with this.", "verified": true, "helpfulness": "0/0", "author": "kevin"}, {"rating": 1.0, "review": "Being a retired IT manager for HP, I think this product sucks hugely. It's not easy, it takes multiple re-boots, it fails to work properly as advertised and is a pos. Couple this with Prime and you have a nice package called customer lunacy. Don't try this with a wifi. Don't try this on your home network. Save the money and buy something that works. I've spent countless hours trying to simply watch my Prime, so now it's time to cut loose the stupid tech shackles that bind my wallet and go for something that works void of me having to trouble shoot it every time I use it.", "verified": false, "helpfulness": "0/0", "author": "Jim E. Heckel \"Frog\""}, {"rating": 5.0, "review": "Works for what I need it too ! Thanks !", "verified": true, "helpfulness": "0/0", "author": "Andres Q."}, {"rating": 5.0, "review": "I am very pleased with this  product. I have told my friends about it.", "verified": true, "helpfulness": "0/0", "author": "Teaira Foster"}, {"rating": 1.0, "review": "Just worked for about 3 hours then overheated..... disappointed", "verified": true, "helpfulness": "0/0", "author": "Schedir"}, {"rating": 3.0, "review": "Still having trouble of getting it to work", "verified": true, "helpfulness": "0/0", "author": "LAURIE J. CASTANEDA"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Tito"}, {"rating": 5.0, "review": "This is hands down my favorite thing i have ever bought on Amazon.  The Chromecast has opened my family up to a while new world of entertainment.  Yeah maybe it has less features than Apple tv or Roku.  For the cost it is amazing, has never let us down, and I really enjoy streaming from my phone to the t.v. easily.  It makes those funny videos I want to share with my family that much easier to view.  I would recommend this product for any and all people.", "verified": true, "helpfulness": "0/0", "author": "Jason Witter"}, {"rating": 5.0, "review": "I like the chromecast because it gives me smart tv capabilities with out buying the tv. The only thing I don't like is sometimes it disconnects while casting.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]