[{"rating": 1.0, "review": "Gave this to my husband for his birthday- It does not work and I haven't gotten around to returning it. Wish I had bought at Best Buy instead.", "verified": true, "helpfulness": "0/1", "author": "Eva W."}, {"rating": 1.0, "review": "Chromecast is a terrible product that does NOT work the way it is advertised. Very frustrating to set up and only works with a couple apps. Great idea......horrible follow-thru.", "verified": true, "helpfulness": "0/2", "author": "Andrew Hura"}, {"rating": 5.0, "review": "I AM VERY MUCH NOT COMPUTER LITERITE.  TOOK A LITTLE WHILE FOR ME TO UNDERSTAND HOW TO HOOK THIS UP, BUT WITH THE HELP OF YOUTUBE YOU CAN DO ANYTHING.  ONCE I GOT THE SITE SET UP I LOVE IT.... I HAVE USED THE PLAYER MORE THAN I THOUGHT I WOULD.  AND IT BEATS THE PRICE OF TRYING TO BUY ANOTHER SMART TV.  NOW ALL TV'S IN MY HOUSE ARE SMART...", "verified": true, "helpfulness": "0/0", "author": "colleen"}, {"rating": 3.0, "review": "I am not sure if I am operating it correctly but I am not a huge fan of Chromecast.  I thought I would love it.  But here is my issue.  The lag time between the app and casting it onto the TV.  I use a Chromebook to cast onto the TV.  I have fast internet but there are still issues with streaming on the TV.  When I look at the Chromebook, it's streaming fine.  So there is a lag between the Chromebook and the TV when using Chromecast.However, this is a good inexpensive alternative to regular TV.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 3.0, "review": "Small and portable and able to start streaming....just could find a way to stop streaming without unplugging the chromecast or switching out of hdmi.  Probably just takes a bit more investigating but Apple TV is more intuitive.", "verified": true, "helpfulness": "0/0", "author": "Della Hartley"}, {"rating": 5.0, "review": "Works seamlessly with Netflix and HBOGo apps from iPhone. Set-up is quick and HD quality is excellent. Good price other similar devices and no new remote to deal with since you use your phone to control.", "verified": true, "helpfulness": "0/0", "author": "Rico"}, {"rating": 4.0, "review": "Great for what it does!  I only hope they keep adding services to it and make it better.No complaints.", "verified": true, "helpfulness": "0/0", "author": "John Culp"}, {"rating": 5.0, "review": "Great for the apartment. All I use is Netflix so I don't have to purchase cable and it works perfect.", "verified": true, "helpfulness": "0/0", "author": "ryan martin"}, {"rating": 5.0, "review": "I bought this for my parents as a gift and one for myself to test out the ease of use.  It works great.  Very easy to install (just plugs in) and then download a couple of apps.  Even my electronically challenged parents can work this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up, easy to use and remains out of sight behind my TV screen.  And I can watch full screen videos thru Chrome or  YouTube.", "verified": true, "helpfulness": "0/0", "author": "Chip12414"}]