[{"rating": 5.0, "review": "LOVE this! I can watch so many movies and TV shows all when I want to. I can start and stop them if I need to go somewhere and start where I left off. So I never have to watch just parts of movies any more. It also suggests other movies I might like by what I have watched.", "verified": true, "helpfulness": "0/0", "author": "BPM"}, {"rating": 4.0, "review": "after getting it installed (much problems) I do like the product.", "verified": true, "helpfulness": "0/0", "author": "carol marie morrison"}, {"rating": 4.0, "review": "I is complicated but doable. Some of the glitches are annoying..like a slow down or lack of loading on some tv shows...Blacklist just did it and I had start start over. No resume is a pain...but all in all  with steady improving I will stay and buy amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Dorothy Hurkett"}, {"rating": 4.0, "review": "This is a very device everything about it is great but the prime subscription is too expensive to me. That is why I returned it unfortunately", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Sling TV and Netflix is all a girl needs.  The buffering I was experiencing with the Fire Stick is almost completely gone.  It only happens when two people are in the house streaming at the same time.  When I'm home alone I've seen no issues with it.  I wish the voice command worked inside the apps.  It only works within the Fire TV environment.", "verified": true, "helpfulness": "0/0", "author": "Venus K"}, {"rating": 5.0, "review": "The amazon fire is a great streaming device,i tried the Apple tv and by far,fire tv exceeds all my expectations.great device", "verified": true, "helpfulness": "0/0", "author": "kwasi gyateng"}, {"rating": 5.0, "review": "I bought the Amazon fire and also the slingbox M1.If you buy it alone you basically you are converting your TV to a smart TV.If you buy it in conjunction with the slingbox you can watch you cable TV anywhere in the world as it all works through WIFI.", "verified": true, "helpfulness": "0/0", "author": "Carlos J. Deuriarte \"Carlos\""}, {"rating": 5.0, "review": "Great device.  Hooked up on LAN line it is outstandingly fast.  Availability of entertainment on it from movies to games to TV programs is seemingly endless.  Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Joseph S. Lubrano"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Lynette"}]