[{"rating": 4.0, "review": "Streams everything you want. Only downside is it can run a little warm to the touch and nervous it will not last long because of that but at <$35 you can't beat it.", "verified": true, "helpfulness": "0/0", "author": "Derek Fuchs"}, {"rating": 5.0, "review": "Enjoying every moment of it.  Wish there were more options available.  At this point only NetFlix and YouTube are watchable using this.", "verified": true, "helpfulness": "0/0", "author": "Mohammed Kamal"}, {"rating": 1.0, "review": "I bought this on the assumption that it was basically plug n play.  Turns out it is incompatible with my Belkin router, which I just bought 30 days ago.  Google has a page with compatible routers at [...], so check there first.  We got tech help from Belkin but they could not resolve the issue.  I really wish this was working.  I will try to return the router I have and get one from the list, and then update this review.", "verified": true, "helpfulness": "0/1", "author": "Tomcat"}, {"rating": 4.0, "review": "First off: It's an OK little piece of electronic.Why I bought it? I wanted something to being able to watch my new TV in the family room.What do I use it for? I have lots of media (videos and music) in a NAS, and use AVIA media player to view them, however is limited in the video type reproduction. Perfect to watch you tube, Netflix, Pandora.Pro: cheap, easy install, small, flawless Netflix and youtube reprotaction.Limits: You are forced to have and use either a PC or an Android tablet/phone to control it. Needs the paid version of Avia to being able to Cast media. Some videos (expecially older like DiVX) won't work.What I would like? a GoFlex APP to being able to cast from my NAS directly; No video codec limitation. Cast button on windows mobile APPs.", "verified": true, "helpfulness": "0/0", "author": "Wurz"}, {"rating": 3.0, "review": "After owning an Apple TV device for a while I expected something similar and this is not. It's true it costs a third of the other but It only works with a few apps on my iPhone (YouTube, HBOgo & Netflix) and it will NOT stream to my tv any of the videos or music from my iPhone playlists since it's not compatible with the Airplay feature. In order to stream \"some\" of the content on your laptop you need to download an additional program to your browser that forces you to use GoogleChrome and again this only adds very limited functionality. This product has potential if they seriously improve it and make it more user friendly for iPhone owners.", "verified": true, "helpfulness": "0/1", "author": "Sebastian"}, {"rating": 1.0, "review": "I'm rather disappointed with the streaming quality of this little device. There is a noticeable lag between the audio and video feed. I have tried streaming from a wired pc, moving the Rupert until it was 10 feet from the Chromecast, and all to no avail. I keep hoping it is some firmware issue that will be corrected, but as of yet it hasn't.", "verified": true, "helpfulness": "1/2", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The Chromecast HDI streaming player was easy to install and is a pretty amazing product.  I purchased one for each of my grown children as well as myself for Christmas and They use it all the time.", "verified": true, "helpfulness": "0/0", "author": "CHTX"}, {"rating": 5.0, "review": "Works great, easy to install, cheap. What more can I say?  I can use either iPhone or kindle for  remotes.", "verified": true, "helpfulness": "0/0", "author": "whitbred"}, {"rating": 3.0, "review": "I do like being able to watch Netflix, HBO go, and YouTube on my television via this device. I understand you can also watch home videos. I have not tried that yet. I'm not much of a television watcher, I'm not interested in the latest flick or weekly drama. But, I do enjoy watching a movie from time to time and this device makes it convenient for me. I will give it a much higher rating once I can watch Amazon prime via this device. Right now, that is not happening.", "verified": true, "helpfulness": "0/0", "author": "Donna Anderson"}, {"rating": 5.0, "review": "A little tricky to setup with smart phones or tablets, but once done it works great.  YouTube works the best, Chrome works, too, but I can see it struggles to catchup.  Likes to see more sources like YouTube be included.", "verified": true, "helpfulness": "0/0", "author": "Songtao Ma"}]