[{"rating": 5.0, "review": "works awesome.", "verified": true, "helpfulness": "0/0", "author": "Unnat Shrestha"}, {"rating": 5.0, "review": "This is a great way to easily connect all my devices (iPad, iPhone, HP Chromebook and HP Windows laptop to the big screen.", "verified": true, "helpfulness": "0/0", "author": "Mark Parkison"}, {"rating": 4.0, "review": "Good purchase.  Clear streaming quality.", "verified": true, "helpfulness": "0/0", "author": "Sealya"}, {"rating": 1.0, "review": "Bought this so we wouldn't have to constantly fiddle with cables to hook laptop up to TV. First parts of setup only took seconds. The last bit took hours. It only worked half the time and in the end, physically hooking up the laptop each time amounted to much less work and frustration than using chromecast. It doesn't work with all the things we wanted to watch anyways. One of my few returns in a decade.", "verified": true, "helpfulness": "0/0", "author": "BOK"}, {"rating": 3.0, "review": "When it world its great, but sometimes it turns off and you need to install all again...", "verified": false, "helpfulness": "0/0", "author": "Daniela Escobar"}, {"rating": 5.0, "review": "This is the second one i bought perfect for netflix", "verified": false, "helpfulness": "0/0", "author": "meesly"}, {"rating": 5.0, "review": "I like it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up and use. Very good value for the price.", "verified": true, "helpfulness": "0/0", "author": "Antonio J. Gomez"}, {"rating": 4.0, "review": "Google Chromecast is a very neat and useful little device.  I have actually found that even though Google's product documentation suggests to plug the power cord for the Chromecast into an outlet rather than via the television's USB, I feel that when hooked-up via the USB the Chromecast works better because the dongle is only powered-on when the television is powered-on.  When the Chromecast is plugged directly into an outlet it is always on, even when the television is not being used and the device gets very warm to the touch.  I feel like that cannot be good for the dongle.  I have been using our Chromecast hooked up via the USB for three months now without any issues or freezes.Usage:  Everyone in my family, adult to 5 year old, uses our Google Chromecast to stream Netflix, which works perfectly.  We also use it to stream YouTube videos and use the PLEX Media Server via our home PC.  Those are the three main things we use our Chromecast for.  We use our Apple iPad and iPhones to control everything done on the Chromecast.  No problems with anything.  I have purchased three other Chromecast for other family members and they love the functionality as well.Note: Verizon FiOS customers will need to edit their wireless router's default configuration to get the Google Chromecast to work properly.  If you do a Google search you will find the solution.  If I remember correctly, only one setting had to be disabled and it worked immediately after that.", "verified": true, "helpfulness": "1/1", "author": "HalliganHook"}, {"rating": 5.0, "review": "Awesome! Great for those days when you want to watch Netflix but feel like your actually watching TV. Now just can't wait until you can stream non-internet items as well! that would be cool.", "verified": true, "helpfulness": "0/0", "author": "Mok"}]