[{"rating": 5.0, "review": "Have only used a couple of days. At this time the product has worked as advertised. Very satisfied at this time!", "verified": true, "helpfulness": "0/0", "author": "Ronald T. Olague"}, {"rating": 5.0, "review": "Great features!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this streaming device and I've used a lot of them. I still prefer Roku for the Netflix app and versatility, but the Fire has such a great design. It's super fast and has a terrific remote. Also, the screen saver images are mesmerizing!", "verified": true, "helpfulness": "0/0", "author": "Paul Clary"}, {"rating": 5.0, "review": "Wow! What an incredible little device. I've looked into streaming devices for years, but was never convinced that they were worth the time or trouble of integrating them into my setup until FireTV. It has EVERY app that I want with the exception of VUDU, but I have a work around for that. Streaming quality is outstanding and the interface is well thought out and easy to navigate. Hands down the best streaming I've seen.", "verified": true, "helpfulness": "0/0", "author": "Mat M"}, {"rating": 5.0, "review": "I have had the fire TV for a few weeks now and I am really enjoying it.  I will be honest and say that the main reason I bought it was for the ability to play android games on my TV.  So far so good, but it could use more games.  The library is pretty limited and most of them require you to purchase things during the game play if you want to go very far, but the games that are available are pretty fun.  Otherwise, I use it for Netflix which works great.  In order for Netflix to work however, you will need to download the newest system update through settings.  It took me a while to figure this out and I wish Amazon would have notified me of this but I had to search through random forums to see if others were having the same problem.All in all, I enjoy the Fire TV and I'm excited for the future updates that I'm sure will add even more awesome features.", "verified": true, "helpfulness": "0/0", "author": "Davis C."}, {"rating": 5.0, "review": "Excellent device", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works really well, good picture quality too. There was a little bit of trouble with Netflix, both downloading the app and getting it to work, but now it seems fine. More apps (ABC, CBS, etc) would be nice.", "verified": true, "helpfulness": "0/0", "author": "jms"}, {"rating": 5.0, "review": "Exceeded expectations for initial presentation, setup and performance.", "verified": true, "helpfulness": "0/0", "author": "Tomm Aldridge"}, {"rating": 2.0, "review": "I don't have Amazon prime. couple friends said this box was awesome without it. I didn't think it was worth the money. If you get Prime it would probably be worth it. I just don't wsnt itI decided to keep this and bought Amazon prime. Glad I did. I love it. Good games, apps and plenty of shows and movies. Good purchase", "verified": true, "helpfulness": "1/1", "author": "Patrick Daugherty"}, {"rating": 5.0, "review": "Really works great. Previously we used to watch Amazone Prime movies through our smart TV, but that was slow and inconvenient. The Fire TV was a huge improvement, also compared to out ChromeCast stick. What we still miss is an App to control the Fire Tv from out iPad.", "verified": true, "helpfulness": "0/0", "author": "M. Van Lookeren Campagne"}]