[{"rating": 5.0, "review": "This product was exactly what we needed and we were very happy with it.It was also exactly how it was described on the website.", "verified": true, "helpfulness": "0/0", "author": "Rich Smith"}, {"rating": 5.0, "review": "I love the simplicity, easy setup and how small this device is. Its perfect for making any \"dumb\" tv into a smart one!4.5 Stars!I am removing .5 stars as it will not play Amazon Prime video very smoothly. Seems like the video will only play around 15fps which makes it look choppy. Other than that it's worked great with every other thing I've played on it. Nice high quality video and audio!Use the chrome app \"VIDEOSTREAM\" to play files from your computer in the browser, then cast away!Finally, I can just send a video or music to my TV without any hassle!", "verified": true, "helpfulness": "0/0", "author": "Jon G."}, {"rating": 4.0, "review": "Works as expected. I use it with my Note 3 phone on an older model Phillips flat screen TV that is not internet connected.", "verified": true, "helpfulness": "0/0", "author": "Mike D"}, {"rating": 5.0, "review": "Love it. Really considering breaking away from cable. fast and easy set up. looking to purchase another one soon!", "verified": true, "helpfulness": "0/0", "author": "Ale-B"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Trushar Champaneria"}, {"rating": 5.0, "review": "This was a gift for my sister. She loved it.", "verified": true, "helpfulness": "0/0", "author": "KimF30329"}, {"rating": 5.0, "review": "I have purchased three of these for three people and everyone loves them! First, I bought it for my grandfather. He discovered Netflix and was in love. This product helped him stream his favorite shows and movies on the TV with ease and he didn't have much of a learning curve. My fiance has one as well and likes to stream TwitchTV (a game streaming website) and it streams perfectly. There isn't much lag time in connection and everything works great! There was only one time we had an issue, which was something that was caused by our internet. Once fixed, everything was back on track.", "verified": true, "helpfulness": "0/0", "author": "M. Novotny \"amalzing\""}, {"rating": 2.0, "review": "Not easy to use at any moument", "verified": true, "helpfulness": "0/0", "author": "Big AL \"In my room\""}, {"rating": 4.0, "review": "Excellent!.", "verified": true, "helpfulness": "0/0", "author": "Tomas V Pla"}, {"rating": 5.0, "review": "Love this don't regret buying this at all", "verified": true, "helpfulness": "0/0", "author": "Amlak Francis"}]