[{"rating": 5.0, "review": "If I could give more than just 5 stars for this little wonder I would!  I've been using my FireTv box for about two months now and this little guy is well worth the money we paid for it.First off: I am not a gamer. You will not find any comment from me about gaming on this device.  Move on if you're a gamer.I wanted to have an alternative to cable TV when there's nothing on - which is often.  We have found an array of documentaries, movies, and TV shows that we love.  We also use our Netflix account with this device.I can say that the picture quality, and also sound quality are really quite good for such a small little box.  We use an HDMI connection and even non HD shows look good on our screen.  I really like the closed captioning feature on this as well.  I'm hard of hearing so I have to use it daily.  I can hear the shows with my hearing aids in but sometimes I miss a word or two.  The captioning feature is easy and clear to read and I feel is much better than the standard broadcast captioning.Well I have to run...my son is crying! I just wanted to give some highlights!", "verified": true, "helpfulness": "0/0", "author": "Julie Chamberlain"}, {"rating": 5.0, "review": "Its way faster than my apple tv 2 and 3. Voice search is really handy.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 4.0, "review": "I love this product, everything is great except problem with HDMI audio. I tried several HDMI cables, but after waking up Fire TV do not output any sound and I need to pull out HDMI cable and put it back to get audio back.", "verified": true, "helpfulness": "0/0", "author": "Golub"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "Larry D Shoemaker, MD"}, {"rating": 5.0, "review": "Love the options and the parental controls. NOW, it needs more apps like Disney Junior, HBO, and the ability to play videos fire tv on our android phones. A mirror/streaming function for our laptops would be nice also. Thanks", "verified": true, "helpfulness": "0/1", "author": "Adrienne M."}, {"rating": 1.0, "review": "Didn't like it. Might as well keep my money and use the internet.", "verified": true, "helpfulness": "2/10", "author": "Ebony Bean \"EB\""}, {"rating": 4.0, "review": "i had alll the others but this worked best", "verified": true, "helpfulness": "0/1", "author": "Thomas Ordon Personal"}, {"rating": 3.0, "review": "Overall it is good save for two glaring issues. First you can only have one prime account assigned at a time. This is a problem for households with multiple accounts that have purchased movies. Second, it is buggy. It consistently loses connections and throws code 13 errors. Amazon's workarounds only work part of the time.", "verified": true, "helpfulness": "2/3", "author": "Ben Abernathy"}, {"rating": 5.0, "review": "Very easy to set-up. It would be helpful to know that HDMI cord was not included.", "verified": true, "helpfulness": "0/2", "author": "tmason"}, {"rating": 5.0, "review": "Installed so fast and is very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Shannon"}]