[{"rating": 5.0, "review": "I like to Roku 3 much better than the Fire TV because it has many many many more channels BUT this is still a very good entertainment device.  So if you are mostly looking for a solution to watch your Amazon Prime content, HULU, NETFLIX, or SLING TV + playing visually entertaining games this is the device for you.  I love the voice search feature and the xbox like remote control for playing games.  The game video graphics are excellent.  The user interface is nicely designed.  It gets 5 starts for these reasons.On the other hand, If you want more content besides the ones I listed..... the ROKU has a massssssssive advantage on content over the Fire TV.  You get thousands of more channels.Either way, this is a good device.  The one you chose depends on what you are looking for.", "verified": true, "helpfulness": "0/1", "author": "Cesar Castro"}, {"rating": 5.0, "review": "Much happier with this than D-link", "verified": true, "helpfulness": "0/1", "author": "Jerrie E. Wolfe \"Dog-Maid\""}, {"rating": 5.0, "review": "Once I received my amazon fire tv, I cancelled my cable TV and been watching it ever since. I access my Netflix and Hulu. There are a host of other things including games. I'm getting ready to order the game controller from Amazon so I can play the games. Wonderful entertainment all in on. I love it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I bought two of these and the batteries needed to be changed after three weeks on one, then a week later the other needed new batteries.When the batteries went on the first I thought sh-t happens.When the other one needed to have new batteries a week after the first went dead I felt ripped off.I never thought amazon would be put its name on such a poor product", "verified": true, "helpfulness": "0/1", "author": "francis j donato"}, {"rating": 4.0, "review": "I am thinking of purchasing this item but what I am interested in is the Kodi app for streaming movies. will the Fire TV ever have that app?", "verified": false, "helpfulness": "0/1", "author": "Annie Tryon \"laceywillow\""}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/1", "author": "alexis pena"}, {"rating": 4.0, "review": "I have liked what I have seen so far with Fire TV. Very pro for Prime - so be ready for that. Has a lot of options and the wife likes the gaming options with the unit. So far better than Apple TV.", "verified": true, "helpfulness": "0/1", "author": "Jerry Howell"}, {"rating": 5.0, "review": "Outstanding item. More than expected", "verified": true, "helpfulness": "0/1", "author": "chris"}, {"rating": 5.0, "review": "My son suggested getting this, and I'm glad I did!  It works very well.  Love it.  I have no complaints at all.", "verified": true, "helpfulness": "0/1", "author": "JC"}, {"rating": 2.0, "review": "Not at all what I thought it was. Shows are too expensive and prime has a small selection for shows and movies", "verified": true, "helpfulness": "0/1", "author": "taylor"}]