[{"rating": 4.0, "review": "There are a few misconceptions with this device..  Currently you are limited to streaming1) from smartphone and tablet apps that are chromecast enabled - about half a dozen for android at the time of this writing, fewer for iOS devices)  2) from the chrome browser on a desktop.  This limits you to web pages, streaming content, and media files (video/audio) you can drag into chrome and click the \"cast\" button.This devices essentially turns your phone into a remote.  Unless you are streaming local media from your desktop, the content does not pass through your device (and as a result doesn't kill your battery).  For example, when using netflix via chromecast, the chromecast dongle itself makes a connection to the netflix server - your phone merely acts as a remote.That said, this has replaced every set-top accessory we have plugged into our TV.  Our whole digital entertainment layout is just chromecast + netflix + hulu now.", "verified": true, "helpfulness": "0/0", "author": "DJD"}, {"rating": 5.0, "review": "The best, most practical streaming device today. Priced right, easily useable and most versatile.BEST alternative to a  wana-be SmartTV!", "verified": true, "helpfulness": "0/0", "author": "Yosef Taitz"}, {"rating": 5.0, "review": "The Chromecast was easy to connect to my wireless network and easy to connect to my TV.  Works great with compatible apps such as Youtube and Netflix.", "verified": true, "helpfulness": "0/0", "author": "William J. Bartus"}, {"rating": 1.0, "review": "App does not sync with what is being viewed on the TV. After 15 minutes, I have packed it up back in the box to send it back to Amazon for a refund. Going to take my money and go buy a solution which works-- an Apple TV.", "verified": true, "helpfulness": "2/4", "author": "jonah Vinciguerra"}, {"rating": 4.0, "review": "it plugs right into your tv and allows you to do so many things I am just starting to scratch the surface of what it can do", "verified": true, "helpfulness": "0/0", "author": "bstnbeverly"}, {"rating": 3.0, "review": "Relatively easy to install but it is very important to follow the instructions carefully.  I was also surprised to learn and it does not support as many apps as expected and if the app is not specifically supported it will not work at all.  There is something in the online discussions about \"tabcasting\" but I have not been able to make that work.  I was surprised to find that a product sold by Amazon does not support Amazon Prime Streaming and is not compatible with the Kindle Fire (there are work arounds but I mainly use my iPad anyway).  I also have the Apple TV device (which has its flaws too), but at least it works with just about anything you can display on the iPad.  Works great with Netflix but overall, kind of disappointed at the limited support.", "verified": true, "helpfulness": "0/0", "author": "Stephen P Wing"}, {"rating": 4.0, "review": "The dongle is perfect for us and we bought two of these. There are only a few apps that are supported directly. The list has been growing although the most recent additions are not the most popular apps. I did find it annoying that while the mobile/tablet Youtube app can add videos to Playlist for continuous playback I wasn't able to do the same from laptop browser.I am pleasantly surprised by how well the browser tab casting works. Based on the reviews I was expecting choppy performance but if you set to 480p casting in the tab setting I haven't even had one glitch.  Another thing that pleasantly surprised me was that it can turn on my Samsung TV that was bought in 2009. For that, of course, you need to plug the Chromecast USB to the external power outlet and not to the TV itself. It did not work with Vizio and another Samsung TV that we have, though. On those sets the TV must be on but it can change the input. I am not sure yet but it may be a TV issue.What's more, you can even cast your whole desktop screen to the TV but then the sound does not get cast to the TV. There are workarounds for playing your own media too. As more apps go native and possibly ipad/phone browser gets the ability to cast I might change my rating to 5-star. We picked it up on huge discount and also received $6 credit for Google Play store but haven't figured what to use the credit for. Another little thing, the screen saver images, they are just gorgeous. I wish they are able to add the location where the pictures were taken.", "verified": true, "helpfulness": "0/0", "author": "anurag p"}, {"rating": 5.0, "review": "I love this thing! I use it for Netflix, YouTube, Google Play Movies and Music, and with RealPlayer Cloud to stream local content. The best device ever for the price. I can't wait to see what people will do with the SDK in 2014.", "verified": true, "helpfulness": "0/0", "author": "K. Tam"}, {"rating": 5.0, "review": "This is little and you wont even notice it and it connects to all my ios devices and laptop i love it!!!", "verified": true, "helpfulness": "0/0", "author": "BrandonPinero"}, {"rating": 5.0, "review": "Expecting more apps in the future as Google is working on it. I hope this investment will not be a waste. Recommends to others", "verified": true, "helpfulness": "0/0", "author": "RJ \"RaRi\""}]