[{"rating": 5.0, "review": "The amazon fire is amazing", "verified": true, "helpfulness": "0/0", "author": "elizabeth herlinger"}, {"rating": 4.0, "review": "Good Buy ! i have Apple TV , Chromecast, PS4, Xbox one etc... and i like this better them them all in terms of navigation, and mirroring , but the remote could use some work on battery life and staying connected to the network , but it is easier to use if you have an android device. Netflix works lik\\e Normal , and Plex navigation is greatly better than the ps4 ...", "verified": true, "helpfulness": "0/0", "author": "Dream Killer"}, {"rating": 5.0, "review": "We got the Sling TV/ Amazon deal and absolutely love it! We cancelled our cable and are still able to watch all of the same shows, PLUS, have all of the Prime Videos on demand.  It's so easy to use, my 18-month old has even learned how to speak into the remote and pull up \"Bubble Guppies\".", "verified": true, "helpfulness": "1/1", "author": "TARDIS"}, {"rating": 3.0, "review": "very easy to activate, but I am not sure that I will get much use out of it. Programs and movies are very outdated especially the free ones. I guess that is why they are free. Single episodes of recent series are charged and can add up very fast at 2.99 per episode. I do not think I will keep my subscription to Netflix. Movies are not worth the cost.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Love being able to watch my Netflix and YouTube though here.  Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "denigma \"denigma\""}, {"rating": 4.0, "review": "Works great! Easy set up! We even brought it with us and hooked it up in our hotel when traveling.  The only downside is that The Netflix app doesn't always work, a lot of the amazon tv shows and movies cost money even if they are years old.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Wingard \"Books 4 School\""}, {"rating": 3.0, "review": "Would be nice to browse the  internet and make your TV a smart tv", "verified": true, "helpfulness": "0/0", "author": "SHADEL HAMILTON"}, {"rating": 4.0, "review": "Love it!!!! Super easy to install and navigate through.", "verified": true, "helpfulness": "0/0", "author": "roberto fuentes"}, {"rating": 5.0, "review": "I really like the Amazon Fire TV unit.  It works very well, as advertised.  I am surprised that the voice recognition works as well as it does.  The designers have done a good job!", "verified": true, "helpfulness": "0/0", "author": "Oliver Crandell \"oliverc\""}, {"rating": 4.0, "review": "Works as expected. Good streaming speed with little \"buffering\".", "verified": true, "helpfulness": "0/0", "author": "Michael"}]