[{"rating": 5.0, "review": "Let's face it - watching anything on your television is a mess. Your set top box is probably low resolution, has a clunky remote and more clunky channel browser.  Your favorite console cost a pretty penny, and still takes awhile to boot up and into netflix.  Or you could just lay down an HDMI cable to your laptop and live with cords through the middle of the room.I haven't found a complete solution, but the Chromecast gets a good way along the path.Bonuses- cheap (half the price of most stand alone boxes)- monthly payments? (looking at you xbox. \"value added\")- seen as a computer.  This may not be your problem, but Comcast, for example, can enable Hbo to stream to your PS4, but not your Roku. Streaming from your computer dodges that bullet.- stream and browse.  Once streaming is started, you can even close the tab and use your laptop otherwise.Negatives- Each service needs to change internally to support it, so no Hulu Plus, or MaxGo as last I checked.- The laptop controller - it's an even larger remote to keep track of, and I do miss voice controlTips- If your chromecast is getting power from your tv or receiver, it wont also be able to turn it on for you. Plug it into an outlet for more magic.", "verified": true, "helpfulness": "0/0", "author": "Jett Jones"}, {"rating": 4.0, "review": "I was shocked at how intuitive set up was. I shouldn't be as one day Google will rule the world, but it was very simple. It play Youtube videos perfectly which is my main use. My only regret is that it doesn't allow for Amazon Prime movies to be direct to the device rather than streaming from the computer. Hopefully it will soon.", "verified": true, "helpfulness": "0/0", "author": "Sarasota Food Lover"}, {"rating": 5.0, "review": "I purchased it and use it a lot it's great. The customer service for this item is great I called several times and can continue to call if need be. I like what googles did with this product.ffsalsa@yahoo.com", "verified": true, "helpfulness": "0/0", "author": "ffsalsa"}, {"rating": 5.0, "review": "Bought this for my hubby for Christmas and he loves it! He is a gadget guy and was looking at the reviews on the google chrome cast and was looking at purchasing it after the holidays. Santa surprised Santa! Ha! Ha!", "verified": true, "helpfulness": "0/0", "author": "A. Hughes"}, {"rating": 4.0, "review": "Unable to give me access to the Prime free videos, even though they do play on Chrome.Guess I'll have to buy videos from Google.", "verified": true, "helpfulness": "0/0", "author": "Gary"}, {"rating": 4.0, "review": "Decided to try Chromecast first before buying an AppleTV.  So far, it's working well.  Using primarily for Netflix and sending video from my laptop or iPad to the TV.  Am able to power the Chromecast from a USB port on my new LG LED TV, so no extra cables hanging down from behind the TV.  It's all tucked away on the back, out of sight.", "verified": true, "helpfulness": "0/0", "author": "Timothy Henard"}, {"rating": 1.0, "review": "Horrible setup mired in incompatibilities, software reads \"beta,\" final install quirky, often disconnects once setup. Seemed like a good idea: play Netflix & YouTube on a TV that doesn't have it built in, spend less than an Apple TV. WRONG! Put your money toward Apple TV or new TV with Netflix built in. Setup experience: Attach device, TV displays URL for setup. On iPad, it requires an app just for one time setup, app  requires newer  iOS than our iPad supports. Try Windows PC, open IE, web page reads \"You must use Google's Chrome browser for setup.\" Install Chrome, website says \"Probably won't work with this computer.\" Without stating so, it turns out your PC MUST use wireless but our desktop is cabled.  Get neighbor w/ Macbook Pro. Finally setup completes without a snag and \"Just works.\" But back to iPad and our Windows PC, they can't install or use Chromecast app. Oh, look, not even Google's own YouTube app can stream from iPad but the app from the good folks at Netflix DOES WORK. So, for 30 bucks and lot of headaches you can stream Netflix but nothing else to your TV. Chromecast isn't worth $30, they should be paying you to be their beta tester. Put your money toward a quality device like a cheap disc player with apps, used AppleTV or just a smart TV to begin with. Total fail.", "verified": true, "helpfulness": "0/0", "author": "Gadget Junky"}, {"rating": 2.0, "review": "I wonder if google intentionally made this thing to have issues with windows 8.1Let me first point out that, I have really tried to like this product and make it work, but it just won't let me. I have spent hours on it to make this thing work (see below), but in vain. Now back to the review. I got a windows 8.1 Lenovo Carbon X1 with windows 8.1 and I absolutely love the laptop. Super fast, < 30 seconds boot time, SSD, etc...so, no I don't have a reason to switch to Android or Apple. Not that I hate it, but just because I don't need to. Following is what I tried to make this thing work from day1.1. Followed instructions and found that Chrome browser shows an error \"No Cast devices Found\". In other words, chrome browser cannot connect to chromecast or it does not find the device on the network. I verified that laptop and chromecast are on the same network.2. Troubleshooted and found that I should turn on sharing on my local network (LAN). Did that via windows sharing center. Still the same error3. Rebooted the router. Still no success. So I tried to do the same with another laptop I have, but pretty old with a core 2 duo processor (Google recommends i3 or newer processor). It worked fine since it has windows 8 (not 8.1). But the streaming was pathetic. I find it hard to believe that chromecast only transfers metadata of youtube video from laptop and then streams it from network and not from your laptop. Because, you have to keep the video ON on your laptop in order for the video to stream on your TV. If you pause the video on your laptop, the same thing will happen on your TV. WTF ? I probably could have just connected HDMI of my laptop if I have to do that or may be set up a server at my home.3. Called Google Customer Care. I think the representative was pretty nice, but he asked me follow the standard procedures like reboot router, laptop, etc...Spent over an hour on the phone, but no success again4. Lots of surfing on bing/google to find out a solution including official chromcast troubleshooting guide. Believe me, its not even worth listing everything here. I found out that a lot of other folks using windows 8.1 are facing the same issue, but no resolution. Google can't solve it, obviously Microsoft would not claim it as their problem either. I verified that sharing on LAN just works fine on windows 8.1. So, its probably chromecast5. Manually added chromcast and chrome to my firewall for inbound and outbound connections. That's not only for http/TCP connections, but for any protocol. I know its not at all secure, but just wanted to check if its the issue with Windows OS or anti-virus. As usual, nothing worked.I have finally given up on this device. I am going to just connect my old laptop to TV via HDMI and login remotely to that laptop if I need to use that laptop. This way, I can make it as a streaming device too. Piece of cake. So much for 25 bucks, not worth the effort.All in all, a negative experience with a Google product, disappointing.", "verified": true, "helpfulness": "0/0", "author": "animageofmine"}, {"rating": 4.0, "review": "It does the job it's supposed to do, and does it well, my reservation on the 5 star review is that the chromecast lacks a lot of support and apps to go with it.", "verified": true, "helpfulness": "0/0", "author": "Benny C"}, {"rating": 1.0, "review": "I bought the Chromecast to take with me on trips, so I could watch Netflix on the tv in my room.  Unfortunately, Google failed to load a simple browser on to it, so it's unable to join any hotel network.  It will never end up using this now.I was also surprised to find the only apps loaded on to the Chromecast were Netflix and You Tube.  Why not Hulu + or HBO Go etc...As a final note, the Chromecast runs extremely hot, I don't feel comfortable leaving it plugged in.", "verified": true, "helpfulness": "1/1", "author": "Jon Blaeser \"MCO JFK flyguy\""}]