[{"rating": 1.0, "review": "You still have to play videos and things with your phone.  The device doesn't directly stream from the internet.  You start a video or song or whatever on your phone, then click a button to \"transfer\" the media to the tv screen.I wrongly assumed it would work like other streaming devices such as Rasberry Pi for about the same price.  I was mistaken.Not impressive.  Not particularly useful.  I gave it away to a friend.", "verified": true, "helpfulness": "1/5", "author": "Aaron"}, {"rating": 1.0, "review": "Been thru the set up and even with help from a techie can not get it to work.  No help available from google.", "verified": true, "helpfulness": "0/2", "author": "George R. Mcgee"}, {"rating": 5.0, "review": "Got this to go with my LG 47\" SmartTV I ordered at the same time. The tv has built in internet browser but doesn't play flash videos. Based off those reviews, I ordered this with it to solve that problem. Everything installed properly and got to working with my wireless routher (linksys with \"g\" band, older model). Tried off my laptop (no bells or whistles and running internet on Wifi), that didn't go well. It would cast but too much lag time. Tried it off my desktop (also no bells or whistles but hard wired into the internet connection) and it run very smoothly. As I type this, I'm \"casting\" Nfl redzone onto my tv with no problems whatsoever. You will need to install and run off of Google chome browser for this to work. In addition, add on the chromecast extension and install the chromecast app when you receive the product. Very easy setup.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great piece of technology to watch Netflix, etc. very happy with the easy set up. Got one for my dad too- even he could set it up. love it! Fast shipping.", "verified": true, "helpfulness": "1/1", "author": "Hide \"hide\""}, {"rating": 1.0, "review": "OK, My wife got me this form my birthday. I was all excited. No more would I need to hard wire my laptop to the TV to play videos.Unfortunately, the only video you can stream comes from the internet (e.g. Hulu, YouTube, Netflix, Pandora, etc...). Both my TV and Blu-Ray can already stream from these sources with built in apps. So the only people who need the chromecast are those who have older HDTVs or blu-ray players without this capability.That said, if you don't like the user interface on your TV for these apps, it may be worth it for you. YouTube being the biggest pain to use via your TV remote. However, we don't usually sit and watch YouTube on the TV. YouTube is usually used individually on laptops or iPads in our house and we don't need to stream it for all to see. However, I can always search and then cue up the netflix video via my laptop and then watch it on my TV by going to my instant queue. My TV remote does a nice job of controlling the netflix video. So again, no need for the chromecast.So the device is pretty useless for me. The advertising makes it seem like you can stream from your device to chromecast. But in reality, all you are doing is telling chromecast to go out to the internet and stream video from youtube, netflix, etc. NOT from your device (PC, iPad, Phone, etc...)Very misleading advertising on this google. I'm pretty disappointed.", "verified": false, "helpfulness": "0/2", "author": "C. Schneider"}, {"rating": 1.0, "review": "Google support and troubleshooting did not help. Factory reset, different port, unplug TV for 15 min. Turn off other HDMI etc does not work. They said I needed to replace the stick. I did and it still doe not work. What a waste of time!", "verified": true, "helpfulness": "0/2", "author": "Joseph M. Mansy"}, {"rating": 5.0, "review": "I spent most of the day watching YouTube videos on our big screen TV.  This has got to be one of the best things I have ever bought.", "verified": true, "helpfulness": "1/1", "author": "Slick"}, {"rating": 3.0, "review": "Good product, but I assumed that I cold watch my homemade videos.Not yet, maybe sometime in the future. Wait and see!", "verified": true, "helpfulness": "0/1", "author": "Gerd Wegmann"}, {"rating": 5.0, "review": "I am electronically naive so when I bought this as a gift it was on the basis of the description.  When I saw it being used to transfer from a laptop to a large flatscreen tv, I was delighted to see it do exactly what had been described!", "verified": true, "helpfulness": "0/0", "author": "bandedlady \"bandedlady\""}, {"rating": 5.0, "review": "This is a great bargain for the price! It would be nice to be able to upgrade to make it totally internet friendly!!", "verified": true, "helpfulness": "0/0", "author": "ROGER L. GEARY"}]