[{"rating": 5.0, "review": "though there is room for improvement. It works really well as it is currently designed. I would recommend you really read into the specs before you buy it as you may not fully understand it's limits. The primary limit at this time is wireless router compatibility. I got lucky because my primary router was on the list. However, in a secondary location I cannot use it.But, I can use it on my Android. So, there are a few conventions you need to understand.", "verified": true, "helpfulness": "0/0", "author": "Michael Smith"}, {"rating": 1.0, "review": "Usually I like Google products so I was hugely disappointed. All I want to do is watch Netflix on this TV. The connectivity issues are insane. Even once the setup was finally finished and it was hooked up to my wifi, the loading and buffering time was unbearable. My Wii used to be able to play Netflix on this exact same TV with no problems, so why can't Chromecast?If you do get it to work, there is no way to pause, rewind, fastforward, etc. You're supposed to be able to do it from your phone or Chrome browser. Neither worked for me.It completely froze a week into owning it, so I tried the trusty unplug-replug and now I can't get it to reconnect to my wifi network. I'm returning it and will get a Roku or Fire TV or something.", "verified": true, "helpfulness": "2/2", "author": "Melissa"}, {"rating": 5.0, "review": "Me and my wife used to just watch hulu, netflix, etc on our laptops, but now we just cast them onto our TV and the quality is very good.", "verified": true, "helpfulness": "1/1", "author": "D.M."}, {"rating": 5.0, "review": "Simple to set up and use. I love being able to watch youtube on my big screen. Netflix and HBO Plus work great. Hoping to see more apps in the near future.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I probably use my ChromeCast every day. I like to multitask while I watch tv, and this has made a lot of things easier. Streaming movies, shows, even listening to music. The only problem is that if you minimize Chrome (which you can only stream through Chrome, unfortunately) then it starts to skip and freeze. It does a lot of skipping and freezing where I will have to disconnect and then reconnect. I have pretty strong Internet connection, yet it still doesn't seem to be enough sometimes.", "verified": true, "helpfulness": "0/0", "author": "Rae Quigley \"raequigs\""}, {"rating": 5.0, "review": "I wanted some way to watch Netflix and Youtube on TV.  After looking at various devices I picked Chromecast.  It is very easy to set up and I was watching Netflix in about 10 minutes.  Of the options out there Chromecast was the cheapest.  I am installing Chromecast on each TV so I needed 5.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Fitch"}, {"rating": 2.0, "review": "I was excited to buy this product, however after several months I still cannot figure out how to use it. It works well at other homes. Lacking technical support.", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 3.0, "review": "It's a good product with inmense potential but very limited.  It would be a killer iff you could use it to mirror your computer (mac or PC) to projectors or TV, also very good if it had a RC.", "verified": true, "helpfulness": "0/0", "author": "R. Izquierdo \"juron\""}, {"rating": 3.0, "review": "It works OK if you have multiple devices to cast to your TV, but if you only have one device, you will get a better experience with an HDMI cord.  There is a 3 second lag time between the device and what appears on the TV.  Good start, but improvements are needed.", "verified": true, "helpfulness": "0/0", "author": "Bernard R. Bossert Jr. \"BJ\""}, {"rating": 5.0, "review": "I love this device, I highly recommend it especially if you have other android devices like phone since it ties in very well with that ecosystem (as it should). At first it didn't have a whole lot of apps but it has been steadily growing and for the price it offers quite a bit!", "verified": true, "helpfulness": "0/0", "author": "C. Sympson \"Soopaman2004\""}]