[{"rating": 5.0, "review": "Received it with no issues. Very easy to set up and you can stream from your phone or tablet. Nice for areas where you do not want wires (HDMI cables) exposed. Works over WiFi", "verified": true, "helpfulness": "0/0", "author": "pk"}, {"rating": 5.0, "review": "Our family subscribed to netflix after getting tired of the cable bill. We found ourselves watching our shows on the smartphones and ipad, until we tried googlechrome. It was simple to install, and we were immediately able to start watching our favorite shows. Also a great value. Highly recommend!", "verified": true, "helpfulness": "0/1", "author": "Theresa Baxter \"totallytheresa\""}, {"rating": 5.0, "review": "Google's second attempt at TV (the first being Google TV) has totally exceeded my expectations. I use the Google Play Store to purchase Music and Movie (and to rent movies). It works PERFECTLY! Not only can you Cast from you your purchases, you can also cast from a list of other apps. In addition, you can cast web pages from your laptop via Google Chrome web browser. It's small, it's powerful, and I just love it. I've had it for about two hours and I'm ready to downgrade my cable subscription to basic cable. GOOGLE ROCKS!", "verified": true, "helpfulness": "0/0", "author": "Dominique H."}, {"rating": 5.0, "review": "It's so small and easy to use.  Plug it in, grab your smartphone, tablet, laptop, etc and enjoy.  I have a roku and a smart tv, and I like using this better than both of the other options.  Number one reason, you never have to look for the remote!  Okay you still need the remote to switch to the input mode but that's it!  If your attached to your IPad or phone like I am, you can start watching a video on the IPad and with one touch cast it on the screen.  You don't have to stay in the app like if your using Netflix or something.  You can start a show and still browse other shows or surf the net on the device.  You never have to find the remote that always falls into the seat cushion or on the floor. You can control everything on the device you always have in your hand.  Very cool, definitely feeding my netflix addiction!  For the price best deal for streaming online content to your tv, no cords no fuss!", "verified": true, "helpfulness": "0/0", "author": "Mel"}, {"rating": 5.0, "review": "Works great with newer operating systems for Mac. Works great with Android operating systems.  When you are not watching a movie, or listening to the radio, has a slide show of great pictures", "verified": true, "helpfulness": "0/0", "author": "D. Wilhelm \"Wilhelm Portraits\""}, {"rating": 5.0, "review": "Best way to watch internet content on your TV, period. At $35, get one for every capable TV in your house, you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Quick delivery and good quality on arrival.  Love the quality of the picture.  Really enhances your options to view movies, etc.", "verified": true, "helpfulness": "0/0", "author": "CGG"}, {"rating": 5.0, "review": "Functionality and price are remarkable. Chromecast functions flawlessly as designed. Easy to set up and start watching from netflix or youtube", "verified": true, "helpfulness": "1/1", "author": "John E. Albertson"}, {"rating": 4.0, "review": "Really enjoy being able to 'throw' things from my iPad to my TV via Chromecast. I am hoping they expand applications in the future and allow more than just Netflix/iTunes from the iPad. I've used this succesfully via Chrome on my MacBook Pro HOWEVER I do find that the audio/video are a bit out of sync when playing Netflix, etc. from the laptop to Chromecast.All in all, happy with the purchase. For $30 it does what it should, nothing more.", "verified": true, "helpfulness": "0/0", "author": "K.V.C.L. \"K.V.C.L.\""}, {"rating": 3.0, "review": "It's pretty cool, but the main reason I got it was to utilize a browser component.  However the chrome browser on both my phone and tablet won't punch out to the TV.  So until I can do that, this purchase is a bit of a let down.", "verified": false, "helpfulness": "0/0", "author": "Alere Tox"}]