[{"rating": 2.0, "review": "I got a a good deal for my Chromecast purchase. However, I am disappointed at its limited applications. I thought it could \"chromecast all websites and links\". But it DOES NOT! It requires Chromecast Extension to access other websites. Unfortunately it supports limited platforms for this feature and NOT iPad at this time. With iPad, I can only use Chromecast for Youtube and Netflix. Disappointingly, I have no need to subscribe Netflix. I give it 2 stars for the price.", "verified": true, "helpfulness": "0/0", "author": "R C"}, {"rating": 1.0, "review": "This is a glorifies screen saver for your TV.  It does not stream from any of my devices...  compatibility issues from my 3-year old mac book pro, and nothing from my iPhone 4S.  Nothing of this variety, that costs $35 should take more than an hour of time for an experienced technology user. There are virtually no instructions and the top level of the website is of no help...  unless you consider 'call Cisco' for router compatibility issues an answer.", "verified": true, "helpfulness": "2/4", "author": "R. Adams"}, {"rating": 4.0, "review": "Does what it should lags alittle but that's expected and I new what I was getting (12 Meg Internet) can't wait for more app support for some reason won't play any of my music from the Google music player. Would really really love to see a cast button on Google Chrome mobile that would be great.", "verified": true, "helpfulness": "0/1", "author": "Brady"}, {"rating": 5.0, "review": "The setup was a touch complicated, since this is the second Chromecast in the house. I'm told if there's only one it's pretty simple. It works easily from Google products and you can often get local media to stream via playing it in Chrome. I use it all the time for playing music in the main room from either my computer or phone, and it's made me seriously think about getting a straight Android tablet too. Very much simplifies the connections behind the TV, and perfect if your TV runs right into speakers. Hopefully it's obvious that I like the Google suite, like G-Music, Chrome, YouTube and Android; if you prefer other services, this won't be as useful. Nevertheless I think you'll like it better than physically plugging things in, like some sort of gross caveman.", "verified": true, "helpfulness": "0/0", "author": "Alexander Verbeck"}, {"rating": 5.0, "review": "Bought this for some friends, and they love that they can easily stream from their phone and computer to their tv!  they are planning to cancel their cable and just use chromecast to watch netflix.", "verified": true, "helpfulness": "0/0", "author": "Half a slice of french toast"}, {"rating": 4.0, "review": "So, I'm not the most techy person, but I'm no slouch. It took a little doing getting this to work properly, you have to have an HDMI port on your TV and either an UBS on your TV, too or a nearby electrical outlet, so make it work. I hooked mine up via my laptop. The main purpose was so I can watch HBO Go or MAX Go on my TV without having to buy a Roku or a new Blu-ray (I cannot get HBO Go on my current Blu-ray for some reason.) It works pretty well. The picture was pretty good, although if you watch YouTube on your TV this way, expect the same quality that you watch on your computer... not always good. For $35, not a bad deal, but not as easy as I first thought it would be.", "verified": true, "helpfulness": "0/0", "author": "K. R. Sontag \"kcrocklein\""}, {"rating": 2.0, "review": "While the Chromecast device does everything it says it does, the fact that Chromecast lacks support for the Microsoft Surface is extremely disappointing. While it does say this in the fine print, its an afterthought as it PR spouts how quick and easy the device can connect to Windows and Android devices.I purchased this for my elderly mother to use with her new Tablet she was so excited only to be let down when it was not compatible. While I did connect it to her Android phone, part of the functionality that was promised is lost while using it this way.Continuing, the lack of Vudu and Amazon Instant Video support is appalling. HBO Go is nice, but its not enough in the end to make this device worth even the sale price I paid for it.", "verified": true, "helpfulness": "1/1", "author": "Devon Isherwood"}, {"rating": 5.0, "review": "Yeah, this is the coolest thing ever.Streams pandora from your phone, you tube, your laptop....so cool.  They are insane for selling it so cheap, I would have paid 100bucks for it without blinking an eye.SOOOOO WORTH IT!!!!!", "verified": true, "helpfulness": "0/0", "author": "n3v3rfall"}, {"rating": 5.0, "review": "Best purchase i ever made. Use it daily for Pandora and Netflix. Was very much worth the money and have told several friends to get it. Great add on or alternative to expensive cable tv.", "verified": true, "helpfulness": "0/0", "author": "Amber"}, {"rating": 5.0, "review": "This is an excellent device including great apps for HBOGo, YouTube, Netflix, and more. The best feature is still in beta (testing) which is the tab casting feature for Google Chrome browser. There are two resolutions that I see (720p and high frame-rate 720p). Personally I don't see much of a difference in them and I have a very fast internet connection (70mbps download and 35mbps upload). Still the quality is acceptable. The rest of the apps are so fast and responsive and the ability to work with my laptop, desktop, tablet, and smartphone lets me use whatever device is closest to me.I am a STRONG believer that you shouldn't keep buying expensive hardware like streaming boxes and media players because hardware will not upgrade on its own. This device is such a simple piece of hardware which strongly focuses on the software on the devices you use every day. This is why this product is really great.Lastly the price is unbelievable for only $35!? I got mine for $30 on Amazon and it was one of the best deals I have ever gotten for cost to usability.I hope this review helps!#amazonvine", "verified": true, "helpfulness": "0/0", "author": "Sunny Patel"}]