[{"rating": 4.0, "review": "I love this thing. So far I've only used it to stream youtube videos to my TV and for that alone it is worth it. Setup is very easy and it works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Mike R."}, {"rating": 5.0, "review": "Google has done it again - Chromecast is awesome, smart, fast, and really easy to use. For the price, you can't beat it. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Stephanie218"}, {"rating": 5.0, "review": "This is exactly what the Nexus Q should have been. I currently use this device to stream Netflix, and Google Play Music. It's potential will increase when Google releases a public API that developers can work with as many more web services will incorporate play support (my speculation). At the moment, I wish it had Amazon Prime streaming support, though I'm hopeful that will eventually be available.These make such a great gift for friends and family.", "verified": false, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "Really easy to set up. Just takes a couple minutes as you have to sync your chromecast with the internet as well as the device youre using to stream.  It works great though.  No problems.  The only thing i wish it could do is make the tv act like an additional screen to your device.  That would make it much more usefull and desirable....at least for me", "verified": true, "helpfulness": "0/0", "author": "Matt Ahlers"}, {"rating": 4.0, "review": "The only problem that I've had so far is the the plug-in keeps disappearing from my browser, and to my dismay I can't use it on my laptop because it still has Vista - which means every time I want to watch something else I have to go into the office and access the desktop - I was hoping I could use it from my laptop and never leave the couch once I'm settled in for TV watching.  But, that's temporary as eventually this old laptop will get to the point it's no longer worth fixing and I'll replace it.  I've never used it from my iphone since my TV already has a Netflix app on it and there's almost nothing on Youtube I'd ever want to \"watch\" while settled in for a night of TV.", "verified": true, "helpfulness": "0/0", "author": "Biggie"}, {"rating": 5.0, "review": "Chromecast is a really nice streaming device which works well to display YouTube videos, home videos, etc. The one problem is the lack of apps on Android. If Google ever releases their SDK, many more apps will appear.", "verified": true, "helpfulness": "0/0", "author": "Fred Green"}, {"rating": 5.0, "review": "I bought one for myself and it work perfect.  I can watch work-out youtube videos in a big screen.  I thought it would be helpful for my parents, so they can watch shows from youtube too.  They are using it and are very happy", "verified": true, "helpfulness": "0/0", "author": "Marielena Len \"Marielena\""}, {"rating": 5.0, "review": "This product was very easy to install and set up. Works as advertised.Would definitely recommend it to anybody needing a streaming device.", "verified": true, "helpfulness": "0/0", "author": "KC"}, {"rating": 5.0, "review": "I had no problem getting it to stream Netflix to my non-smart TV's HDMI port, using a cheap $50 tablet PC.  I had to get a Gmail account (something I'd rather avoid) to register with the Google store (something else I'd rather avoid).  There's no need to buy anything or submit a CC#, but I'd much rather have just \"sideloaded\" the bare app file without jumping through Google's hoops first.With the TV sitting there and my home wifi router turned on, the Chromecast dongle sends a series of well composed photographic pictures to the screen as an idle desktop.  With the tablet powered up, Netflix selected and set to \"cast,\" Netflix takes over the TV's screen.It will NOT (as is) stream files from your PC to your TV, but there are several work-arounds (hacks or tips) on ways to do that if you feel inclined to tinker.If you want far more flexibility and don't mind being tied to a HDMI umbilical, it would be better to just buy a cheap tablet with an HDMI output port IMO, but this thing does what it says it will, and doesn't cost a fortune.", "verified": true, "helpfulness": "0/0", "author": "dauntless"}, {"rating": 5.0, "review": "Very cheap and very easy way to stream movies, netflix, and music to your TV. Portable as well. Worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Dane William Ehrman"}]