[{"rating": 5.0, "review": "Love it. Such a cheap way to just get hulu/netflix on your TV. Youtube integration as well as pandora, etc... is flawless.", "verified": true, "helpfulness": "0/0", "author": "nate"}, {"rating": 5.0, "review": "Chromecast does what it says. In addition to youtube and several movie streaming services like netflix, you can cast any tab in chrome browser which is really cool. My only issue that it doesn't work with media player programs and you can't simply cast your pc or tablet screen content. But as I said, it does what it says and does it well. At 30 dollars, it's a steal.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Whitebox"}, {"rating": 4.0, "review": "This works very well. I use it with my iPhone.  It's a little glitchy sometimes (which is why the 4 stars instead of 5), where if the iPhone goes to sleep and wakes up, it doesn't always sync up with the chromecast, so I lose the capability to pause or stop the video. But overall, it works very well.  I'm also able to cast from Google chrome to my TV.  Despite the glitches occasionally, I love it.  I'd definitely recommend it!", "verified": true, "helpfulness": "0/0", "author": "S. Legg"}, {"rating": 5.0, "review": "It's amazing and every week the capabilities are expanding and it's $35! If you're on the fence just buy it already, you won't regret it.", "verified": true, "helpfulness": "0/0", "author": "IndieDev"}, {"rating": 2.0, "review": "My devise does not work all the time. I have called google support twice but all they do is take me through troubleshooting steps that only temporarily fix my issue. The issue is the chromecast always shows as connected via the television but when trying several different devices a connection to the chromecast cannot be found. I would appreciate it if you guys would just send me a new one because I've read the reviews and it seems I'm not the only one with this problem. I am currently not a satisfied customer.", "verified": true, "helpfulness": "0/0", "author": "Rodney B."}, {"rating": 5.0, "review": "I love it for streaming netflix, youtube, HBOgo, and Amazon Prime to my TV. My dad bought me one for Christmas and I just bought another one to put in the bedroom. For 35$ you cant really go wrong.Be warned, A lot of the people complaining about the Chromecast because they have no idea what it does or how to use it. It does not turn your TV into a computer. It does not allow you to play videos from your hard drive natively (You can do it, it takes a few minutes to set up). It does not allow you to stream 5 things at once.You do need an internet connection to use this device. You do need a wireless network to use this device. You do need at least one other mobile device to set it up initially.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Great product works great. Brilliant device to play movies n files through your tv. Plex is a fine app to use with this device. Plex is very nice to use and organized very well. Streaming of all apps is flawless and is in hd.", "verified": true, "helpfulness": "0/0", "author": "terry gonzalez"}, {"rating": 5.0, "review": "It is a very dumb device and that is what makes it so good.No keyboard, no mouse no nothing to get you confused with. Just need your phone or tablet and connection to the wifi.Initial setup was very straight forward.", "verified": true, "helpfulness": "0/0", "author": "Alexiel Mejias"}, {"rating": 5.0, "review": "Very simple to install and setup.  Good picture quality, no lagging.  We have an older television and a google nexus tablet running our wifi on a cable modem.  Not much tech needed to get great results - and only $35.  Nice!", "verified": true, "helpfulness": "0/0", "author": "Mama B"}, {"rating": 4.0, "review": "I watch movies when ever I want. I would have liked more instructions, mostly on the operating part as apposed to the installation.", "verified": true, "helpfulness": "0/0", "author": "gina villano"}]