[{"rating": 1.0, "review": "Chromecast is a scam. Stay far away from it. Just another product that was created to screw over the consumer. And their helpline is worst than the product itself", "verified": true, "helpfulness": "4/13", "author": "cicero grimes"}, {"rating": 5.0, "review": "excellent quality product , good assortment of goods , bought because I know these brands as the best in its class!", "verified": true, "helpfulness": "0/0", "author": "Askar"}, {"rating": 1.0, "review": "Maybe I expected too much, but the thing does almost nothing. Basically, it will fling netflix and youtube videos on your big screen and that's it. I don't have a netflix account. I don't care all that much about youtube. I was mostly interested in it for casting internet from my tablet. Except that doesn't work at all. It is impossible to install the chrome cast extension on my tablet for reasons that are unclear. Clicking on the link that should take me to the download redirects me to a page that lacks the necessary button. Going straight to the google store tells me that my OS is not supported, when it's google's f'ing OS! I can get it to work on my desktop, located one floor up, but why bother?Unless google increases the number of compatible apps, above a whopping 2, and pretty fast, then this is a completely useless piece of dook. I'll add stars if in the near future it turns into something other than a dumb waste of money.", "verified": true, "helpfulness": "4/11", "author": "Area Man"}, {"rating": 4.0, "review": "I pre-downloaded app for my Iphone and the Chrome extension for Google chrome on my PC. When the device came in the mail, I was up and running in 5 minutes or less. I have two issues so far.1. I can't seem to get it to turn on my TV (yes I am using ac adapter), but I think I need to make adjustments in my TV menu setting.2. Most of the cable channel networks (TNT, TBS, USA, etc.) have their online streaming blocked if you don't sign in with your cable provider (I have no cable provider).  The few that weren't blocked sucessfully \"cast\" from the PC to the TV just fine.Hoping more apps are coming. So issue number one I can live with, issue number two is a real big pain in the rear!", "verified": false, "helpfulness": "0/0", "author": "PupfosterG"}, {"rating": 5.0, "review": "Google has taken a very different approach to bringing web video to television as compared to Apple, Roku, and others: they're relying on the mobile apps we're already using as opposed to trying to invent a television based interface for every application.As an owner of a Roku and an AppleTV, I have to say that Google's approach is probably the way to go (at the moment).  The device works seamlessly with the Netflix and YouTube apps and can also stream content from Google's Chrome browser on the Mac and PC.  That browser streaming feature is a great way to get content from your favorite TV shows that don't yet offer an app or a way to stream on a television normally short of plugging a PC to the television.For $35 you can't go wrong. This is an excellent device that has some great and innovative uses ahead of it.", "verified": true, "helpfulness": "2/2", "author": "Lon J. Seidman \"lon@ lon.tv\""}, {"rating": 1.0, "review": "I was excited to receive my Chromecast today and tried to set it up.  Initially, it had trouble connecting to either of the two wireless networks I have in my house.  After fiddling with the main DSL router, however, it seemed to kick in.  (It may have been when I changed most of the 802.11b Rates(Mbps)options from \"basic supported\" to \"supported\".  Or maybe it just coincidentally connected at about that time.)  Since then, I have several times gotten it to connect to the network, but it tells me it can't connect to the internet through the network (although all my other devices have no problem getting on the internet through the same network.  In fact I'm connected through it as I write this.)  Afterwards, each time, it forgets the network password.I tried Google troubleshooting.  Unfortunately, they give a limited list of problems you're allowed to have and mine isn't one of them.  There is no way to contact them for other issues.  (\"Contact Us\" just returns you to the canned issues list.)I'm a software developer and fairly knowledgeable (though not an expert) when it comes to networking.  I'm used to configuration issues with new technology.  But Google needs to provide better diagnostic tools that pinpoint the problems if they don't want to provide support beyond their canned answers.  It's a pity because this looks like a product that has potential.  But this kind of experience damages the Google brand.", "verified": true, "helpfulness": "5/15", "author": "DMG"}, {"rating": 5.0, "review": "The chromecast is just plan easy to use. Right out of the box it's simple setup made it a breeze. After having it for a couple months I still use it every other day. I can't wait for more apps to support it, but it still has the staying power I need.", "verified": false, "helpfulness": "0/1", "author": "Paul J"}, {"rating": 3.0, "review": "I just wanted to try this product and i wasn't very pleased with it. But for the price, it is not that bad :)", "verified": true, "helpfulness": "0/1", "author": "Ashwin Balasubramanian \"Ashwin Bala\""}, {"rating": 2.0, "review": "You cannot get HULU on this device.  I should have read some reviews on it, but the way it was selling I thought there were many more choices.  The set up initially was easy, but every time I tried to use it, I have to set it up again and hold my breath to see if it will see my home wifi network.  I cannot get it to keep my network settings so I gave up on it.  It's gathering dust in the living room now.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Netflix and Google Streaming is just OK as the quality of content drops. Chrome Tab casting is just pathetic, not sure whether thorough testing was done before releasing the product.", "verified": true, "helpfulness": "0/2", "author": "Yamadhoot \"pool\""}]