[{"rating": 3.0, "review": "it works well but it only works with certain apps that listed on the chromecast website, and these apps I dont use. So I have to return the item.", "verified": true, "helpfulness": "0/0", "author": "Peony"}, {"rating": 5.0, "review": "Use it in combination with my xbox one to watch Belgian television, works great in combination with the chrome browser as well.", "verified": true, "helpfulness": "0/0", "author": "Stefaan Van Damme"}, {"rating": 2.0, "review": "We used it a few times and it worked sporadically and now it does't work at all :(", "verified": true, "helpfulness": "0/0", "author": "Dlphnfrvr"}, {"rating": 1.0, "review": "I've spent waaaay too much time trouble shooting this thing.  When it worked it was great but it's never worked reliably and I'm done with being in denial.  This thing is simply not a reliable product (or at least mine's not).First, it's finky when it comes to router settings.  You have to have so many things \"just so\" or it will not even connect in the first place.  The protocols/hardware should have been designed to anticipate anything but the midrage of 2013 router technology.Second, once you do get it set up it will disappear without warning.  Google says to keep it close to the router but even that doesn't help--it seems to be a hardware/firmware thing.", "verified": true, "helpfulness": "1/2", "author": "DaveR"}, {"rating": 4.0, "review": "Great device, some technical issues with it. Great when it works.", "verified": true, "helpfulness": "0/1", "author": "N. Pappas \"Nick\""}, {"rating": 5.0, "review": "Veary good", "verified": true, "helpfulness": "0/1", "author": "Nouh Ali Al-Sharaf"}, {"rating": 4.0, "review": "So far the streamer has worked fine. I am watching movies from Netflix through my phone, which blows my mind.", "verified": true, "helpfulness": "0/0", "author": "doctormama"}, {"rating": 4.0, "review": "Love the Chromecast! We have one on each tv and we use it all the time. We have people over and of course get to talking about something we saw on youtube. This is ideal so EVERYONE can see the video from their seats and not huddled around a phone.It truly is HD and Netflix streams superbly! No problems here!!", "verified": true, "helpfulness": "1/1", "author": "Lindsey"}, {"rating": 5.0, "review": "Love the Chromecast! We use it daily at our house! So easy to use!", "verified": true, "helpfulness": "0/1", "author": "Casey Crisp"}, {"rating": 2.0, "review": "I'm not as impressed with this device as I am with the Roku stick, or the Amazon stick.If I want to mirror my device screen to my TV, this is great, but what if you're watching a movie with friends, streaming from your phone, and you get a text message or phone call? Since it mirrors everything on your phone, this is not exactly conducive to privacy because it'll show everything you're doing on the TV, plus it means you can't do anything else on your phone or tablet while you're streaming.The Roku device is awesome because it does not mirror the screen, showing every move in your transmitting device. When I turn on my SlingMedia and connect to my TV via Roku, I can open other apps in my transmitting device, even turn off the phone and it'll keep transmitting to my TV. This stick doesn't let you do that. And if it does, it must be a hidden feature somewhere because I can't find it, thus making it user unfriendly.Sadly, I'm looking to return it. For my purposes, I'm not impressed. I'm yet to find where the apps are. This is not as user friendly as the Amazon or Roku sticks.", "verified": true, "helpfulness": "0/0", "author": "MCVNYC \"Maria Vale\""}]