[{"rating": 5.0, "review": "I've had a chromecast for a a while but barely used it due to the limited number of apps.  Recently Plex added their app to the chrome device.  Plex is a free media server (Chrome support is in beta and part of their paid product but soon to be free) that allows your to watch your personal media collection on any device.  Use chromecast and Plex together have been flawless!  I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Cory Landers"}, {"rating": 5.0, "review": "I got this as a gift for my parents, who don't keep up with technology, but do happen to have a tablet.  They are now able to watch Netflix so easily!  Smooth picture, no delay, you'd never know it was wireless.  Watching them with it made me want to get one for myself (which I just ordered)!  A great deal for those who have specific subscriptions (Netflix, etc.)!", "verified": true, "helpfulness": "1/1", "author": "Sue"}, {"rating": 5.0, "review": "I have to be honest and say that I was minutes from purchasing a roku 3, which seems like a great device, but ultimately decided on this as it was priced at $29. I am glad I made this decision because it has been awesome to use and so easy. From setup to streaming I am very happy thus far.One of my favorite features is using this with my chromebook and then casting to my tv. I have been able to watch everything from Amazon prime videos to ESPN and for those of us who do not have a smart tv at home for $35 this fills the void nicely IMO. No real lag time with prime videos and ESPN live stream has done a nice job with this so far.Overall I am very happy and look forward to continued use with this going forward.", "verified": true, "helpfulness": "1/1", "author": "lummox pandit \"lummox\""}, {"rating": 5.0, "review": "This is awesome. Stream everything from my kindle to my tv. Ingenious.Would like to have had more information on the installation requirements.", "verified": true, "helpfulness": "0/0", "author": "Theresa Hann"}, {"rating": 2.0, "review": "I expected to see anything all that I can share from my laptop/iPad on my TV but again there are only a few Apps like You Tube and Netflix that can be shared and not everything.", "verified": true, "helpfulness": "0/0", "author": "Mallikarjuna Pamidi"}, {"rating": 1.0, "review": "Tried with iOS, android and a google chrome device and could not get it to function.  Even brought in a relative who is a google employee to assist with same result.  Website for troubling shooting problems is poor and only recycles you back to the app which has no support function.  Only message that made any sense was that I would somehow need to reprogram my router.  Not exactly what plug and play is supposed to be!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love my chromecast all around. Have been using it for 2 weeks now and it's just smooth. Use it with Plex Pass to stream your local media from home devices. Netflix, Youtube & Plex have no issues at all. Looking forward to 2014 when Google opens up SDK for other developers and then you have a magic in your hand ;-) The best part is, the device is free once the content is transfered to chromecast.", "verified": true, "helpfulness": "0/1", "author": "Kashif Zahid"}, {"rating": 4.0, "review": "One thing that you are not made aware of is this item is in BETA phase still.Meaning there is only a few things you can do with it.You can stream from your phone and laptop but the only things that work are Google play, youtube and netflix. If you have spotify or things of that nature it won't work.Still worth it if you don't mind making a full transfer to all things google.", "verified": true, "helpfulness": "0/1", "author": "Alex"}, {"rating": 5.0, "review": "Absolutely love this thing. Was a gift for my husband for Christmas and he said it was very easy to hook up. Only complaint is that it's a pain to use with Hulu, but I think that's Hulu rather than Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Jennifer E. Flint MacLean"}, {"rating": 3.0, "review": "The Chromecast does the job with respect to picture quality and works pretty well on the wifi in my home. However, I tried to use it in a NYC hotel and it would not access the wifi that was available. Also, it works with hulu, netflix, amazon and other streaming sites but does not offer other options for photos and other websites.", "verified": true, "helpfulness": "0/1", "author": "Ron the reader"}]