[{"rating": 5.0, "review": "I can not stop recommending this Media player. Now that local content playback has been released is the most used piece of technology in my house.", "verified": true, "helpfulness": "0/0", "author": "salvador"}, {"rating": 5.0, "review": "This little fob is AWESOME.  We travel quite a bit and only take our ipad with Netflix.  Now kids can watch their Netflix movies & shows on the TV instead of huddling around a little screen, and we can watch documentaries, series, etc while we're away from home.  You have to make sure TV has proper HDMI input.  Sometimes can be a little finicky to setup but once you figure it out youre good. Sometimes would disconnect after non-use for a day or two, but just unplugged everything to reset and it reconnected no problem.", "verified": false, "helpfulness": "0/0", "author": "Andrea Vance"}, {"rating": 5.0, "review": "Works fine!I bought this item and it works just fine in latin america with a tp-link router.", "verified": true, "helpfulness": "0/0", "author": "Irene Arizaga"}, {"rating": 5.0, "review": "Changed my life awesome if you have kids", "verified": true, "helpfulness": "0/0", "author": "luis"}, {"rating": 1.0, "review": "It was different from the delivered product advertised!!!!", "verified": true, "helpfulness": "0/5", "author": "Teixeira, Walker"}, {"rating": 5.0, "review": "works good", "verified": false, "helpfulness": "0/0", "author": "valueshopper"}, {"rating": 5.0, "review": "If you're looking for one more way to 'cut the cable' or 'dish', this is one sweet little tool. Basically anything you can upload to your computer screen can be 'broadcast' to the Chromecast dongle. Just plug it into the HDMI input on your flat screen TV or your amp and load the software at the webpage. The rest is even easier. Click on the icon when you have loaded the page and 'voile' it's projected to your TV. Works great with YouTube and hundreds of other video streaming websites many of which are free online. You have the option of using a USB cable or the 'wall wart' power supply. I chose the USB since it was available on my TV. Even while you're making your decision on what to watch the Chromecast has some incredible backgrounds/screensavers to entertain. I spent nearly an hour just appreciating the 'breath-taking' images shot by professional and amateur photographer. With the cost of cable and dish services escalating out of control, I decided to spend a few dollars once or twice a year on programming I prefer rather than a hundred dollars every month for stations I never watch. So far I have invested in ROKU, Chromecast, BasicTalk and FIOS internet. I have disconnected dish services and land-line phone and am still saving 50 percent of what I was spending. I highly recommend this approach to selective 'intelligent' viewing.", "verified": true, "helpfulness": "0/0", "author": "AFRTS Veteran \"CB Franks\""}, {"rating": 4.0, "review": "Needs a better UI and more apps but does exactly what it advertises.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "Not as easy to get started as hoped.  Instructions very vague.Download Chromecast app.  Download Netflix app. Watch from Netflix app. (Or Hulu or whatever app)You can still use your iPhone or iPad while watching programs. When you need to change something, go back to Netflix app.Apple TV better as you get the onscreen menu. Spend the money!", "verified": true, "helpfulness": "0/0", "author": "Charles Mc Leod"}, {"rating": 5.0, "review": "Great product works great", "verified": true, "helpfulness": "0/0", "author": "Potty"}]