[{"rating": 1.0, "review": "Beware, google chromecast is not as usefull on Mac OS as it is on other platform.  The promise is as long as the content is loaded in chrome browser you'd be able to stream to TV via chromecast.  In reality it depends.I have two of them myself purchased as soon as it's released, which I used to be able to stream video from any website to TV as long as the content is loaded in the chrome browser (even the chrome browser on a macbook).  Today, I found there is a problem in streaming, either no audio on TV or simply the chromecast option is not available in the browser, albeit certain web site such as youtube has a direct chromecast stream option now by clicking the chromecast icon within youtube player.While this is not what used to be, there has always been a problem playing youtube or any video streaming in chrome browser on macbook.  Searching on web returned some discussion shows that the issue is with chrome browser plugin \"Adobe Flash Player (2 files) - Version: 11.6.602.167\" (enter \"chrome://plugins\" expand details in chrome) which came with two versions, Shockwave Flash 11.6 r602 and 11.9 r900.  The odd part of it is the first version intermittently mute the audio on Mac when playing video but streams to chromecast on TV with audio fine, whereas the latter never has problem with audio as long as you play youtube on Mac but streaming to Chromecast via chrome browser will not have audio.  One way or the other you're screwed if you switch back and forth between browser and TV, unless you constantly check/uncheck the \"chrome://plugins\" to switch between the two shockwave plugins accordingly.The only way to avoid this hassle is to leave the second shockwave plugins enabled (disable the first one), while only use the chromecast option within youtube. However, for other web video site who doesn't yet have a direct chromecast option hence you must use chrome browser's streaming, you must opt to the \"switching shockwave plugins\".  However, this tweak has not become a \"mandate\" for chrome browser on windows PC, mainly because the \"mute within browser\" problem never existed with the first adobe plugin.This quick diagnosis has shown how complex the nature of today's consumer experience based on a mix of technologies from several independent vendors competing to each other.  It's hardly Google alone plays the \"evil\" here but takes Apple, Adobe and Google together to bring you a multimedia solution that sucks.  The rule of thumb can be led to conclude thanks to the collective \"effort\" from these vendor is to stay with a single vendor for everything, otherwise you're on your own.In the end, if you're on Mac, stay away from Chromecast.", "verified": true, "helpfulness": "2/3", "author": "Baikal \"Baikal\""}, {"rating": 3.0, "review": "I liked this product. It worked well and is easy to use. Would buy this product again. Able to watch", "verified": true, "helpfulness": "0/0", "author": "Tommie Jean Jones"}, {"rating": 5.0, "review": "Does everything it says it does.It will even turn your tv on and change the input to itself when interacting with it!Apps work fine from mobile devices and, I just wish if the apps closed while watching, they would be able to automatically reconnect and get control again. Once media starts playing, the chromecast acts like a cable box and your computer is simple a remote that doesn't even need to be running to work so, which is cool", "verified": true, "helpfulness": "1/1", "author": "Dustin Doloff"}, {"rating": 5.0, "review": "I love this!  More \"channels\" are being added all the time.  Using an Android tablet as the remote is much more flexible than the remote for other streaming devices I have.", "verified": true, "helpfulness": "0/0", "author": "Mark Smith"}, {"rating": 5.0, "review": "Even if all you do is cast youtube or music, it is worth it. I bought it on impulse and I didn't think I would use it much, but I have been doing most of the youtube watching on it and casting music which works great with my audio system connecting to my TV.Plus using it to watch Hulu, Netflix, and HBO is great.", "verified": true, "helpfulness": "0/0", "author": "Portland Original"}, {"rating": 5.0, "review": "My TV is 6 or 7 years old, but Chromecast turned it into an internet TV. Great invention! Love it!", "verified": true, "helpfulness": "0/0", "author": "Wendy"}, {"rating": 2.0, "review": "Doesn't allow to cast files from my PC to TV. Frustrating that Google doesn't allow to slideshow my photos to TV.Seems to be a walled garden of apps that Google lets you use.", "verified": true, "helpfulness": "0/1", "author": "Spindoc \"Tester1\""}, {"rating": 5.0, "review": "Love It! My coworkers were talking about how they wished they could watch a game and videos on a bigger screen rather than either bunching up around each others' smart phones or hearing it repeated over and over as it was shown anew to those who hadn't seen it yet.  For the 1ST TIME EVER,  I  was the one who told them about the newest technology - of Chrome-casting - and within a week was being thanked profusely. I get to watch from my phone or PC (so easy) and got a new level of respect from my peers...", "verified": true, "helpfulness": "0/0", "author": "P Weaver"}, {"rating": 1.0, "review": "\". . .send anything on the web to your TV from your smartphone\" (per Google) for the price of, say, a fast food dinner for two sounds too good to be true and, alas, it is not true; but it's false advertising. Another Google product thrown into the market before perfecting it. You can watch streamings like Netflix and You Tube on your TV with your Android smartphone, but you can't surf the web because, listen to this, you need a Chrome browser extension that (duh!) Google has not yet made available for its own Android OS (!!!) but only for Windows, and other OS's. Thus I'm returning this disappointing thing. I was an early grateful admirer of Google for opening new horizons for users, but over the years the founders' principles seem to have been eroded by subsequent managements to the point that Google is now following Microsoft's fate. At present there is no reliable gadget for surfing the web on your TV using a smartphone; there's a rumor that Amazon is planning one that would do the job. Let's hope so.", "verified": false, "helpfulness": "2/4", "author": "Doctor T"}, {"rating": 5.0, "review": "I initially bought a Chromecast for myself and fell in love with the simplicity and value of the device.  Setup was very simple through the smartphone app so that just about anyone could figure this out with the device completing its first auto-update upon first use.  When I purchased my device on Black Friday 2013, only a few specific apps were available but since then, many others have come out.  I would certainly recommend that everyone with a \"dumb\" HDMI-capable TV at least few years old invest in a Chromecast to add years of use to your TV.  The user experience is so much more polished than a similar Network enabled BluRay player.  As just a random detail, follow the suggestion in the instructions to power the device from the included USB power adapter rather than from your TV's USB (if equipped) so that the HDMI link (e.g. Regza-Link, etc.) allows it to control your TV power and inputs automatically.  Since my initial purchase, I've given three Chromecasts to friends.", "verified": true, "helpfulness": "0/0", "author": "Joe Cloyd"}]