[{"rating": 3.0, "review": "Some times it does not want to play sound from my android phone after watching for a few minutes  We have slower wifi internet. I don't know if that's the cause or not. But its frustrating to be in the middle of a movie or show and loose all sound.", "verified": true, "helpfulness": "0/0", "author": "Jayson"}, {"rating": 5.0, "review": "Work perfect", "verified": true, "helpfulness": "0/0", "author": "Javier Arends"}, {"rating": 2.0, "review": "As first I liked this device. I thought it was a fairly good product idea and execution. Since I've started using this, it's been problem after problem.1... Setup was the first problem. My network identified the Chromecast but would not let it into the network. After fine tuning my router(about 5 minutes), problem solved. Up and running.2...  When casting to it, there appears to be a loss of fidelity in the signal or something. The picture it's never as good on my tv as it is on my portable devices (1 year old HD plasma TV).3... Every couple weeks the Chromecast becomes undetectable by the app, the TV and my laptop. If I change the TV input to the Chromecast port I see the screensaver from the device but still cannot connect to it. I've tried a power off reset but those never have worked. That means you'll have to make sure it's powered up, press in the reset button for 20-30 seconds (yawn), erases all the settings you had in place. Now go through headache #1 at least 4-12 times. Each time the device becomes invisible to the network it seems to require increasing numbers of hard resets(strange. Is it mad at me?). Now you can finally re enter all your previously input settings, but why bother since it's only going to be erased at the next hard reset anyway.Why does it require being in the network anyway? Why can't I broadcast P2P and maintain the image quality? Or at the least, just maintain the image quality? Try to update the software? Not a chance. As soon as it's plugged into my PC it goes invisible and refuses to update. All in all this feels like it was rushed to market without adequate testing or support structure. This feels familiar somehow.......... kinda like it was developed and sold by that software company up in Washington. Let's just sell millions of them, expect that 30% will fail and be returned to be \"refurbished\" and dumped back into the market. Then when people complain we'll tell them a fix is on the way and here's a set of instructions that we didn't test or really spend time on. Good luck and by the way, the warranty is expired so you can go away now.", "verified": true, "helpfulness": "0/0", "author": "L. Clark \"arkangl\""}, {"rating": 4.0, "review": "Google Chormecast is a great product-price quality. It would be great if it had the mirror feature for apple devices, You will notice a little bit of lagging, but when you start to feel unfullfilled, remember to take into account that your getting this product for only $30!!!", "verified": true, "helpfulness": "0/0", "author": "Gerald"}, {"rating": 5.0, "review": "A pretty good product. Great for projecting online movies etc to the TV.", "verified": true, "helpfulness": "0/0", "author": "Salil Kapoor"}, {"rating": 3.0, "review": "i'm kind of on the fence. i'm keeping it because the fire doesn't work with our 2008 rca flat screen unless i (apparently) do something to make the resolution less on the stick itself. this connects automatically, which it scores points on. where i wasn't thrilled is that unlike the fire stick, which you can load apps onto, this just seems to be an interface between the tv and whatever you are using to control it. instead of going back and forth in a paragraph, i'll just list the pros and cons. for the record, i'm a mom to a toddler who loves watching disney \"tanes\", \"fish\", \"toys, \"cars\" etc, and accessing my disney movies was also important and the one thing i needed (other than a connection) that the fire stick didn't do.pros:-connects to the older tv without making modifications-has disney movies anywhere. the fire stick doesn't.-can be operated from the livingroom, which is really important given that i have another toddler here a few days a week and that in june i'll be strapped to a baby and breast pump around the clock.-i no longer have to have the kindle connected via hdmi connector so i don't have to worry about bad physical connections or my son unplugging things.-we can watch disney movies in the bedroom that we don't have the dvd's to. our bedroom tv has a built in dvd player. and having paid $20 for a used flat screen tv, i'm not eager to go wearing out that part!cons:-the thing is only an interface. it doesn't allow you to download apps to it like the stick does. you have to have them all on the device that you are using to control it, which means less space on the phone or whatever. i was hoping that the phone would be more of a remote control instead of the brains of the team.-sometimes it takes a few minutes for a movie to load.-sometimes the connection drops and you have to go back and restart the app connection through chromecast and then leave that to them go to another app to start the movie.all in all i'm keeping it. we don't have cable in the bedroom, nor do we have all of the dvd's to all of our movies as some of them are bluray and digital copy only. we wanted something for the bedroom because of the cost of cable on another box. all in all, if you have to use your phone and storage is an issue, just select the apps that you're most likely to use instead of every single one that you have accounts to.", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 1.0, "review": "Lots of connectivity issues", "verified": true, "helpfulness": "0/0", "author": "Brianna Lieser"}, {"rating": 5.0, "review": "The single most simple and most useful piece of technology I have ever owned. What did I do before my Chomecast?", "verified": true, "helpfulness": "0/0", "author": "DSnyder"}, {"rating": 5.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "Lorraine Bell"}, {"rating": 5.0, "review": "Wish we would have bought this sooner!  We love it!", "verified": true, "helpfulness": "0/0", "author": "kalix"}]