[{"rating": 3.0, "review": "I have not been able to use it.  I think it might be because of our router.  We have been so busy that it has not been on the top of our list to do things.", "verified": true, "helpfulness": "0/2", "author": "Life is good \"Happy to be\""}, {"rating": 5.0, "review": "Perfect for Netflix and MLB network!!", "verified": true, "helpfulness": "0/0", "author": "Hector Gutierrez"}, {"rating": 5.0, "review": "I have been using my Chromecast since January of 2014 and I love it.  It is quick and easy to setup, and works with my phone and laptop (which runs Linux) nearly perfectly.  There have been a few hiccups with the casting feature with certain apps such as Youtube and Netflix.  These problems happen so infrequently that it does not affect my opinion of the device.The quality of the streams looks great as long as you have an adequate wifi connection.  It might be a drawback for some people that Chromecast only supports wifi, but it hasn’t affected me in any negative ways.  I personally only have a few gripes.1. Chromecast cannot draw power directly from the HDMI port in most cases.  It is necessary to attach usb cable into your TV or an outlet.2. The Netflix app does not yet support autoplay on Chromecast.3. You can easily transport the Chromecast between TVs on your network, but you must reset the device if you wish to use a different network.What really sets the Chromecast apart for me is its ability to stream local content to your TV right out of the box.  Using the Chrome browser you can open a limited number of file formats such as mp4.  This is already a great feature, but there are several ways to add extra support for file formats such as flv and avi.  Currently I am using a chrome extension called Videostream for Google Chromecast.  It allows you to stream nearly any file type directly to the device, and in my experience so far it works flawlessly.  There are other solutions to this issue.  I believe there is a divx plugin for Chrome that adds support to the browser for extra file types, however it was not straight forward for me to install on my Linux based laptop.I am so happy with the device that I am about to buy a second.  The price is right, and it goes above and beyond my expectations of a streaming device.", "verified": false, "helpfulness": "1/1", "author": "J. C. Wearn"}, {"rating": 2.0, "review": "The device is good but not enough supporting apps. Freezes the mobile quite often even while using with YouTube. Need software improvement.", "verified": true, "helpfulness": "0/2", "author": "ywvwy"}, {"rating": 3.0, "review": "While the Chromecast is fun to use the novelty wears off quickly since whenever you want to change what's playing through it, you have to use your phone. That is why I like the Roku Streaming Stick better than this because for $15 more, you get a remote which lets you choose what to watch right on the TV screen and you don't need to fuddle with a phone or computer to get something playing.I also like the fact that Roku is not Google, so I know that everything that I do on the Roku is not being tracked by Google and I can rest assured that someday when I'm watching something it won't automatically be posted somewhere like Google+ without my knowledge.", "verified": true, "helpfulness": "1/3", "author": "WB"}, {"rating": 5.0, "review": "I keep this in my briefcase for work presentations both in the office, conferences, and outside meetings.It makes streaming my iPad/iPhone/Macbook a breeze and works instantly.", "verified": true, "helpfulness": "0/0", "author": "Colin S."}, {"rating": 5.0, "review": "What a deal!  Works without problem right out of the box.  Now streaming loads of stuff to the TV.  Apple TV was barely okay for 99.00.  Chromecast kicks its ass.", "verified": true, "helpfulness": "1/1", "author": "Shawn R. Keenen \"Skeenen\""}, {"rating": 5.0, "review": "Awesome device. I like its portability. I use this at home and when i travel. The price for such a useful device would have me buy one for every TV in my house. This is also a great affordable gift for anyone.", "verified": true, "helpfulness": "0/0", "author": "james walters"}, {"rating": 5.0, "review": "For me it is great ,if you are a person with access to only a few streaming sites it will be well worth it.For those who live outside of the US it will work ,I live in Trinidad and it works great .", "verified": true, "helpfulness": "1/1", "author": "Joel"}, {"rating": 5.0, "review": "Excellent movie streaming device for Netflix, Amazon Prime, Google Play, etc. The concept of using a cell phone, tablet or laptop to control your TV is exactly as it should be; and the HD quality is amazing. Note, reviewers stating that Amazon Prime is not supported are wrong. It just requires to enable Adobe Flash instead of Silverlight in your Amazon Instant Video Settings.", "verified": true, "helpfulness": "0/0", "author": "Music lover"}]