[{"rating": 4.0, "review": "- I use it mainly for streaming (youtube & netflix).- I used it for Pandora for a while (worked well) but I did not wanted my tv on while I only played music.Pros:- Works well with youtube and netflix.Cons:- Turns off when tv is off. Takes a long time to turn on.", "verified": true, "helpfulness": "0/0", "author": "Roberto Rios"}, {"rating": 3.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Augusto"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I bought my Chromecast weeks after it came out. I use it mostly for Youtube or to Cast Tv shows. It's a pretty fun tool to use however, there isn't much it can do..YET..The potential application this device can be used for are pretty awesome and it's only a matter of time before they become a reality.Bottom line: 35 isn't bad for what it does but if you are looking for an all in one device you may be better off waiting a while or going with a Roku or similar.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I love this product, except it doesn't work with the most up-to-date operating system for mac (Mavericks). I've spent hours troubleshooting and can't find a good solution. A major disappointment. BUT on all of our other devices it works great.", "verified": true, "helpfulness": "1/1", "author": "Katherine Bayles"}, {"rating": 5.0, "review": "Great device to stream Movies and TV shows from your phone to the TV. The most inexpensive streaming device out there, and it's very easy to set up and use. Streaming Netflix, Hulu Plus, Vudu, YouTube, MLB and others works well. Even streaming from the Chrome browser works good on both Windows PC and the Chromebook. I like it so well I've bought one for each TV in the house, and also as gifts for others.", "verified": true, "helpfulness": "0/0", "author": "Edwin \"EJ\""}, {"rating": 5.0, "review": "Plugs into an HDMI port on your television, your computer monitor, whatever.  Then you can watch Netflix, YouTube, stream what's happening on your PC to the device.  Very impressed with this piece of equipment.It does require power either from a USB port in your TV, or through an adapter (which is supplied) plugged into the wall.It's very easy to control from your phone, which is my main use for it.  All my friends were very impressed when I told them I wanted to show them a YouTube video, pulled out my phone, and it appeared on the TV.  It's also nice if you don't have a SmartTV and still want to stream NetFlix on it.", "verified": true, "helpfulness": "0/0", "author": "Garret Prenguber"}, {"rating": 5.0, "review": "I got this product earlier than expected and i gotta say i love it, very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Michelle Smith"}, {"rating": 5.0, "review": "Bought this for a buddy for a gift.  He has used it for about 2 weeks and loves it.  Can not beat the price. Exactly as described.  On time delivery as usual.", "verified": true, "helpfulness": "0/0", "author": "Mark Wright"}, {"rating": 5.0, "review": "Great little product. Bought it mainly for the kids to enjoy Netflix. We have gotten to. Of use out of it so far. We've owned it for about 2 months. No complaints.", "verified": true, "helpfulness": "0/0", "author": "Rosales"}]