[{"rating": 3.0, "review": "Bought this to use on my study tv to make it smart.  The only thing that I have gotten to work using this is Netflix.  I am now considering buying a book on how to add other applications.  The instructions that come with it are not much help.", "verified": true, "helpfulness": "0/0", "author": "Joe R"}, {"rating": 2.0, "review": "Only 4 youtube? And i cant share my photos and videos from my cell phone...solo para youtube yno se puede ccompartirfotos y videos de mi teléfono o tableta, las aplicaciones son caras", "verified": true, "helpfulness": "0/0", "author": "Rudy"}, {"rating": 2.0, "review": "does not seem to work with the apps it is supposed to - no user friendly guidelines; HBOGO does not \"cast\"", "verified": true, "helpfulness": "0/0", "author": "robert"}, {"rating": 4.0, "review": "Its not always working 100%. Sometimes signal drops and it stops working. It might be that my internet looses signal or connection with chromecast. But in general great product.", "verified": true, "helpfulness": "0/0", "author": "Lee"}, {"rating": 4.0, "review": "Set up for my parents so they could have a \"smart\" TV.  Not too many viewing options other than YouTube.", "verified": true, "helpfulness": "1/1", "author": "eschorn"}, {"rating": 1.0, "review": "I should return it, half the things on my phone dont work over app. When I can use it I get picture but no sound at all. Completely useless", "verified": true, "helpfulness": "1/2", "author": "Jason Leinwand"}, {"rating": 3.0, "review": "Would be great if more apps would work with it..... Hopefully it will happen soon, until then, 3 stars only!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I like it to play my favorite youtube and other videos through this device in my TV, but google needs to add more App to support it like as Apple TV.", "verified": true, "helpfulness": "0/0", "author": "buzaki"}, {"rating": 3.0, "review": "Worked well. Opened the door to many new movies and tv shows. I am able to watch full series of shows.", "verified": true, "helpfulness": "0/0", "author": "Terence P. Byrne"}, {"rating": 5.0, "review": "Awesome product for allowing patients to view some of our procedures on you tube on a large flat screen format", "verified": true, "helpfulness": "0/0", "author": "Christopher Glapa"}]