[{"rating": 5.0, "review": "For just $35, Chromecast has brought home entertainment to another level for my family. The kids can now watch their favourite videos from YouTube on the big screen TV. Definitely worth the buy.", "verified": true, "helpfulness": "0/0", "author": "Lester Tan"}, {"rating": 5.0, "review": "Easy as pie to set up. Works way better than expected. If you don't have this yet, get it NOW!", "verified": true, "helpfulness": "0/0", "author": "Joseph Voigt"}, {"rating": 2.0, "review": "I was excited to try this streamer, but soon after I set it up, my Comcast gateway began acting abnormal. All other devices in the home were unable to access internet service, and everyone began complaining how bad the Comcast service had become lately. Then, I took my gateway to Comcast and got a free replacement, after explaining the situation with my internet connection. To my surprise, the situation did not improve at all with the new gateway. Then, I put my techie hat on and decided to troubleshoot my connectivity -- trying to calm upset souls in the family with the continued bad service. At some point, I suspected the Chromecast might have something to do with this abnormality, and removed it from the TV, unpowerd and put it away. Later that day, the internet service improved a bit, and over the next couple of days, we were back to the blazing speed which the family got used to. Two possibilities -- either Comcast detected the Chromecast and applied policy to affect my service (why do they do that?), or the Chromecast WiFi signal interference with the gateway WiFi caused it to choke and unable to operate -- I am doing further investigation to find out the root-cause.", "verified": true, "helpfulness": "0/1", "author": "Michael Damena"}, {"rating": 5.0, "review": "The latest additions to the Chromecast offerings make this a powerful contender to the Roku's. I definitely recommend it as a last minute tech gift this year!", "verified": true, "helpfulness": "0/0", "author": "Larry Borders"}, {"rating": 5.0, "review": "perfect product, so easy to setup.Very useful with kids since linked on lot of sources like Youtube and Viki.Would definitely recommend to anyone or for Christmas gift", "verified": true, "helpfulness": "0/0", "author": "Jerome"}, {"rating": 5.0, "review": "It is the best. I really enjoyed using it. You have to give it a shot and try it. :)", "verified": true, "helpfulness": "1/1", "author": "Ali"}, {"rating": 5.0, "review": "Neat gadget. Now I can watch movies in the bedroom too. Easy to install, works great. Would recommend it greatly!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"SymplyAmused\""}, {"rating": 3.0, "review": "Chromecast doesn't support Amazon playback. It might have to do with Amazon's mobile availability, but regardless, it makes the product less valuable in comparison to Roku. Chromecast is about half the cost of Roku, and is extremely portable, but I still think Roku is a better deal due to their app selection. If you use Amazon video, then get a Roku.", "verified": true, "helpfulness": "0/1", "author": "John"}, {"rating": 1.0, "review": "Will not work with Microsoft RT and does not stream netflicks from phone. Very Dissappointed with performance. Wanted for netflicks.", "verified": true, "helpfulness": "0/2", "author": "Sadie Wells"}, {"rating": 5.0, "review": "The chromecast worked exactly as I expected. It was very easy to set up and use. My phone also meshes very well with the device.", "verified": true, "helpfulness": "0/0", "author": "anthony"}]