[{"rating": 4.0, "review": "OK, so I already have Roku, why do I need Chromecast? One reason is that my cable provider explicitly does not support HBO Go on Roku. But Chromecast is a go.I didn't realize that Chromecast does not use your phone's bandwidth for streaming; apparently Android hands off to Chromecast, and Chromecast then streams directly from the WiFi; keeps streaming even if you shut your phone off completely.  That's good; I wasn't expecting that.I don't like that nowhere in the product images do they show that this thing requires a wall charger. I knew it did, so was not disappointed, but some people might be unpleasantly surprised.  This doesn't matter too much since it's all hidden behind your TV.", "verified": true, "helpfulness": "2/2", "author": "Salvatore Mendola"}, {"rating": 3.0, "review": "It is definitely a new product that has a few issues that could be tweaked to make it awesome. But it has a lot of potential and if you're streaming music/movies/tv shows from the supported applications....it's really a great luxury to have!", "verified": true, "helpfulness": "1/1", "author": "LizzM"}, {"rating": 2.0, "review": "This device is definately not worth the money. It only works about half the time and doesn't do everything it claims. You can stream Netflix and Youtube from your Iphone/Ipad but only until the device gets confused. Since multiple devices can stream, it often forgets which device has control. Turn your Iphone off after streaming starts and there is no control over the device, which makes it very impractical to say the least.At times I can't get my devices to recognize Chromecast for more than a few seconds, then it drops again. I should point out that I am about 8 feet away from the TV and I can stream Netflix to my devices just fine. It also does the Netflix \"sit and spin\" far more often than when just streaming directly to my phone or tablet.Chrome browser does not have an extention for Chromecast on Iphone or Ipad, so forget using the device for web browsing. This was the primary reason for my choosing Chromecast over Roku.I suppose you can stream your Chrome Browser from a desktop or laptop, but my question is why???? It's easy enough to connect those devices to your TV without this stupid gadget. You can easily use and HDMI cable or even VGA which would work better than this.I wish I had bought Roku but wanted to save a few bucks. I will end up getting one anyway since this thing is so bad.", "verified": false, "helpfulness": "1/2", "author": "martin ward"}, {"rating": 5.0, "review": "Love Chromecast, have one for each TV at home", "verified": true, "helpfulness": "1/1", "author": "Gladys Fleitas"}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 2.0, "review": "It consumes lot of internet bandwidth. When chrome cast runs, all other devices on the same WiFi goes terribly slow. There should be technological improvements for bandwidth optimization.Also it doesn't stream saved files playing on the device like playing a saved movie from laptop's hard drive.", "verified": true, "helpfulness": "1/1", "author": "nishant"}, {"rating": 4.0, "review": "Fantastic price point option for competition with the Roku, Apple, and Amazon products. Continued improvements and support from other companies/apps has also helped.", "verified": true, "helpfulness": "1/1", "author": "Chris J. Sutherland"}, {"rating": 5.0, "review": "My teenage daughter loves, loves, loves this product. I hardly see her anymore. Easy to use and install.", "verified": false, "helpfulness": "1/1", "author": "Lisa Walton"}, {"rating": 5.0, "review": "This device is by far the best home entertainment investment you can make!", "verified": true, "helpfulness": "1/1", "author": "Pat"}, {"rating": 1.0, "review": "It's not working well especially from the iPhone.  Is there something going on between Google & Apple to make it bit difficult for each other?", "verified": true, "helpfulness": "1/1", "author": "Pepper Mom"}]