[{"rating": 5.0, "review": "The Amazon Fire TV met and exceeded my expectations.  Easy to hook up....easy to use....wonderful entertainment.  I would highly recommend it to anyone.  It was so easy, even those who are electronically challenged can be watching movies, etc., in less than 15 minutes.  This is especially great for those who have the high definition televisions that are not \"smart\" televisions. It is worth every dime of the purchase price.  Don't forget the HDMI Cable.  Instead of having to run out to a store to purchase the cable, just add it to your order from Amazon so you won't have to wait to try out this wonderful device.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 4.0, "review": "I bought this device because I know Amazon makes excellents devices. I can see many things with my Fire TV: I can watch my photos,  videos and play games. The only thing I do not like is I can not enjoy films by streaming because my location outside USA is not ready yet. For this reason I give four stars.", "verified": true, "helpfulness": "0/0", "author": "fabio"}, {"rating": 5.0, "review": "Have a Samsung Smart TV and I was never able to get the 'smart' part of it to work as advertised.  It was very slow and aggravating.  My son has a Roku, and loves it; I'm a big fan of Amazon Fire products, so had to get this.  As many have said, it's VERY snappy performance-wise.  Biggest disappointment is selection of prime movies and TV shows, which could and should be improved.  But for the investment, it's a winner.", "verified": true, "helpfulness": "0/0", "author": "Boydster"}, {"rating": 5.0, "review": "I love Amazon Fire TV, however I might think differently if I were not a Prime Member. There are many \"free\" shows and movies available for Prime Members that carry fees for non-members.", "verified": true, "helpfulness": "0/0", "author": "Dennis Lindberg"}, {"rating": 2.0, "review": "This product has some pluses.  The streamer box is solidly built, and it's a minimalist black slab that virtually disappears from view, unlike the hokey design language of a Roku.  The remote control is also well designed, with a main button that's easy to find with your thumb, even in the dark.  It's a petite remote, so a person with large hands might find it too dainty.  The chips inside the box seem better (certainly faster) than those in the Roku 3.  The preloading feature is a good innovation that works well.  So what's the problem?  Well, there are several.  One is that the device is very Amazon-centric.  The audio search, for example, does not work with Netflix.  And if you're an Amazon Prime member, you can't just browse through your free content.  Amazon throws other choices (for extra dollars) into the mix, as if they are nagging you.  Overall, the software for the device is unpolished and does not provide a seamless experience.  It seems thrown together.  I found the experience to be constantly annoying.  My Roku 3 is not as speedy, but overall it provides a better experience, and offers all sorts of oddball channels along with the mainstream ones.", "verified": true, "helpfulness": "1/3", "author": "Bob C"}, {"rating": 1.0, "review": "Fire TV is easy to set up and use. The problem is with the selection. I purchased Fire TV with the hopes that my family could save money by not renting or buying movies or TV shows on demand or at the video store . I was very disappointed to discover that most of the shows they wanted to watch were only available on-demand and the price was higher than if we just bought them at the video store. For my kids, there were only 2 episodes of Drake and Josh, 1 or 2 seasons of Spongebob, Breaking Bad was more expensive than buying it through our cable provider....Sure there are tons of movies, but most of them have been out for years, how many times can you watch The Silence of the Lambs? Sorry, One word to describe Fire TV - Underwhelming.", "verified": true, "helpfulness": "3/9", "author": "Webster19"}, {"rating": 5.0, "review": "I was getting irritated with my Samsung Blu Ray player. It constantly would forget the Netflix login, and lock up playing Netflix. As well as generally poor performance in all apps. The Amazon Fire TV, what a refreshing change! It's fast, responsive, and most of all, ALL of the apps I have used so far, work FLAWLESSLY. And the wireless performance is unmatched by ANY device in my home at the moment. It was clearly designed well, and it shows. One last thing, the ease of use, is absolutely amazing.", "verified": true, "helpfulness": "0/0", "author": "Not My Real Name"}, {"rating": 5.0, "review": "I have been using Apple Tv for many years and got Amazon tv to try it. I is much easier to use and much faster.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is a great option to lower your cable bill. downgrade your cable package and watch TV episodes for free, rent movies, and play games (some of which are free). Setup was a snap, just plug it in and it walks you through it. I also bought the game controller, which is an Xbox variety as are the games, and my grandson loves it. You can set up a watch list for your favorite programs and save time by going through the numerous selections only once when you initially setup the watch list. There are new selections that keep being added to the lists, making plenty of things to choose from. You need Amazon Prime to fully take advantage of it, but at $75/year, it is way cheaper than an expensive cable bill.", "verified": true, "helpfulness": "0/0", "author": "KindleFanatic"}, {"rating": 4.0, "review": "I have really enjoyed using the Fire TV. It's fast and full of interesting features, save one, I subscribe to Hulu Plus and Netflix. Fire TV is able to search Hulu Plus but cannot search Netflix. This drawback is significant for me. I hope that very soon the search capability of the unit will be upgraded in order to include Netflix. Besides this deficiency, Fire TV is a winner.", "verified": true, "helpfulness": "0/0", "author": "CoolBreeze27603"}]