[{"rating": 5.0, "review": "Love this device .....No lagging or stopping for buffering....", "verified": true, "helpfulness": "0/1", "author": "Lori"}, {"rating": 4.0, "review": "Nice little box to add features to a non-smart tv.  Nice interface, easy navigation, fast and reliable. On par with my Sony streaming player that was about 30 bucks more.  Well done Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "We were using Netflix and it worked great, then we wanted to try Amazon Fire because we would have more programs to choose from. Our internet provider is not the speediest but it works well with Netflix but not at all with Amazon Fire. We wanted to evaluate it so we didn't return it right away and when we tried it said we only had 30 days to return it, Bye Bye $100.00 on a product that never worked.", "verified": true, "helpfulness": "1/10", "author": "Daniel M. Zutter"}, {"rating": 4.0, "review": "Its ok but I am having problems viewing Prime Time movies.  Its probably great for others but until I figure out what is wrong with my prime account I will just say I like it.", "verified": true, "helpfulness": "0/1", "author": "Tinker"}, {"rating": 5.0, "review": "interface is so smooooth and quick!", "verified": true, "helpfulness": "0/1", "author": "Rob Stahl"}, {"rating": 5.0, "review": "I love Fire TV!  It is an even better value when you have Amazon Prime. However, not being able to sort through available programs by what is Prime and what is not - is a DRAG.  Amazon you need to fix that issue.", "verified": true, "helpfulness": "0/0", "author": "Sandy B. of The Book Blog"}, {"rating": 5.0, "review": "This product is awesome.  A clear winner for Amazon.  The voice recognition feature works flawlessly.", "verified": true, "helpfulness": "0/1", "author": "Michael Rew \"santaslittlehelper\""}, {"rating": 5.0, "review": "Amazon does it again - better than the Roku or any other device on market.  Voice Search feature is the best.", "verified": true, "helpfulness": "0/1", "author": "Cinnamon"}, {"rating": 5.0, "review": "My wife bought it. The processing speed is incredible. I like how you can easily do an app search using voice.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "I love ! Amazon has hit another homerun. Easy to set up, easy to use. Fantastic product. Love you Amazon.", "verified": true, "helpfulness": "0/1", "author": "Pipperz"}]