[{"rating": 4.0, "review": "Works great in our family room.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "Effective and simple to set up. Haven't used too many of its options yet but add use daily.", "verified": true, "helpfulness": "0/0", "author": "C. E. Snyder"}, {"rating": 5.0, "review": "I have both the full box and the stick.  The box definitely is faster than the stick.  Both are very smooth though and very powerful.  Great to have practically all of my streaming media options available.  Its seamless to pick up from any TV wherever you are in a series.  We actually prefer to use the fireTV box over the built in streaming apps on our vizio TVs because there is practically no lag.  The voice search is pretty nice but not essential.  Usually just saves time when searching for a long title.  However, after you have identified something with the voice control and added it to the watch list the stick and easily pick it up and play it on other TVs.  The screensaver was a nice little bonus.  Out of the box it has lots of great nature photography from all over the world.  You can also set it up to use your saved photos.  Music is nice over either pandora app or the amazon prime music app.  Well done amazon!  We are seriously considering using the sling app only for TV and dropping cable.  The only thing missing is local broadcast channels like ABC, NBC, etc.", "verified": true, "helpfulness": "1/1", "author": "W. Dan Marks"}, {"rating": 5.0, "review": "This is the best player in the world!  System software updates keep making it better.  Love the Bluetooth feature for listening with earphones!  Roku offers only headphone jack to its remote...who wants to be plugged in when you can be cord free!  I own a Roku in the kitchen, but wish it was Fire TV.  This system is easy to use, simple to understand, and the design is perfection!  I now own two Fire TVs and recommend to everyone as the best out there.", "verified": true, "helpfulness": "0/0", "author": "Suze K \"SK\""}, {"rating": 5.0, "review": "Works very well, just as advertised.", "verified": true, "helpfulness": "0/0", "author": "J. Fiorello"}, {"rating": 5.0, "review": "We are loving our fire TV and loving the money we are saving from cutting cable!", "verified": true, "helpfulness": "0/0", "author": "Emily M."}, {"rating": 4.0, "review": "Very pleased with this device! Not savvy about electronic gadgets, but this one, so far, meets my expectations. Love the voice activation feature.", "verified": true, "helpfulness": "0/0", "author": "Helene Brown"}, {"rating": 5.0, "review": "Great purchase, works flawlessly with XBMC", "verified": true, "helpfulness": "0/0", "author": "Alexander Lo"}, {"rating": 2.0, "review": "Great product", "verified": true, "helpfulness": "0/6", "author": "martha McCrary"}, {"rating": 4.0, "review": "Can it work from my T-Mobile phone?  This my internet connection.", "verified": false, "helpfulness": "0/2", "author": "C. Valosen"}]