[{"rating": 4.0, "review": "Perfect for netflix, hbo go, youtube, web browsing etc. basically anything you can reach with your browser.  I want to be able to play media directly from my hard drive easily though.  Then again I haven't had much time to research how to do it but I'm confident it can be done.", "verified": true, "helpfulness": "0/0", "author": "Matthew Oesterling"}, {"rating": 5.0, "review": "I needed to stop using my ps3 to use netflix because the system was a hassle to turn on, change input, wait, select netflix. Now I just use my mobile or tablet to switch my lcd tv automatically when I turn on chromcast.", "verified": true, "helpfulness": "0/0", "author": "Albert"}, {"rating": 5.0, "review": "this is a great buy I enjoyed very much and use it all the time I would definitely recommend this to a friend or just anyone", "verified": true, "helpfulness": "0/0", "author": "cliff"}, {"rating": 5.0, "review": "I wish the stream from my laptop worked a little easier/better. Streaming from your phone or a tablet works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Cadman Campell"}, {"rating": 1.0, "review": "I don't remember reading that only an Android device would work with the Chromecast player. So I failed to make it work with either a Mac laptop or my Kindle. I cannot be bothered trying to navigate through an evening's video entertainment on my stupidly-small Android smart phone.", "verified": true, "helpfulness": "1/2", "author": "Brad N."}, {"rating": 1.0, "review": "It never occurred to me that I would have to download a Google play app and that Amazon would not have something comparable.  Boo to both Amazon and Google.", "verified": true, "helpfulness": "0/1", "author": "Andrea Hill"}, {"rating": 5.0, "review": "Great product. Easy to setup and easy to use. I was very impressed with the picture quality as well. I defiantly recommend purchasing.", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 1.0, "review": "If you think that you will be able to surf the web while simultaneously watching the web pages on your tv think again! It doesn't even work with my nexus7. Pretty useless at this point.", "verified": true, "helpfulness": "0/1", "author": "Dean"}, {"rating": 5.0, "review": "That's amazing and good price when you want to buy it don't be late buy now and enjoy with it", "verified": true, "helpfulness": "0/0", "author": "mohammed alazmi"}, {"rating": 4.0, "review": "Easy small and streams from your smart phone works great can carry it in your pocket and take it with you anywhere", "verified": true, "helpfulness": "0/0", "author": "Lolo"}]