[{"rating": 2.0, "review": "Setup was straight forward and easy as was firmware update, unfortunately the Chromecast while worked great at first it wreaked havoc on my wireless network requiring me to reboot my router once a day to get it and my phone to reconnect. I returned it, too bad because I did love the thing when it worked but requiring me to reboot my router once a day is too much.", "verified": true, "helpfulness": "0/0", "author": "G. Avila"}, {"rating": 3.0, "review": "I was super excited to get this gadget! However, the lag time between computer and tv screen is frustrating (could be my internet service provider). The other issue I run into often is the player crashes a fair bit. So, unfortunately I end up not using this as much as I thought I would and for the things I wanted to use it.", "verified": true, "helpfulness": "0/0", "author": "Katrina L. Greene"}, {"rating": 3.0, "review": "Three stars, meaning, it's just OK, so far.  If we could get Rhapsody to cast that would probably bump it up another star.  I'm also deducting a star for how much power this thing uses, it gets pretty hot!  And that's just when it's idle, doing nothing.  Wish there was a way it could go into standby mode or something.So all in all I don't really use it that much.  My wife uses it to stream Pandora sometimes, or if we have friends over, sometimes we'll look up Youtube videos on it, but that's about it really.  It needs to be compatible with more media, which hopefully will be coming soon.", "verified": true, "helpfulness": "0/0", "author": "Mr. Nelson"}, {"rating": 1.0, "review": "I am not able to connect it as it says \"connect to my Router but can't access the Internet\".If you know how to connect it please call me @ 502 821 7635.", "verified": true, "helpfulness": "0/0", "author": "satinder krishan"}, {"rating": 1.0, "review": "It doesn't allow you to do enough with your own system yet to be of value.If you could pretty much show anything you wanted on a tv screen then you have a winner.  That is not what this is.  It's limitations are it's downfall.  Too early for them to be selling this.Google the greatest company in the world, seems you can fail. You owe people $35 bucks for this piece subpar dongle.", "verified": true, "helpfulness": "0/0", "author": "Michael Schindler"}, {"rating": 5.0, "review": "I heard about this from friends. I have other products, but this one is compact, works flawlessly, and is very easy to broadcast with.", "verified": true, "helpfulness": "0/0", "author": "John S. Nicholson"}, {"rating": 5.0, "review": "Epic option for casting online videos from your laptop and cellphone. It was so easy to install and you are able to carry it with you when you travel and attach it in your hotel (if it is hd-ready). It is worth every cent. In fact, I think it is underpriced. They should allow for there to be a two for one deal or a multi-room package so that you can cast throughout your home. I know longer have to hook up clunky wires to my TV from my laptop. And the videos are high quality. Thanks Google.", "verified": false, "helpfulness": "0/0", "author": "Sam Snead \"Analytical Shopper\""}, {"rating": 5.0, "review": "Love my Chromecast! i purchased this mostly because I wanted to view HBOgo and my smart TV nor my Blu Ray had the app available. Works great. Great picture. and i love the wallpaper of pictures when you aren't casting..", "verified": true, "helpfulness": "0/0", "author": "Wendy Jamison"}, {"rating": 3.0, "review": "“Trying out the supported apps worked great, but the reason I bought it was to stream Amazon Prime movies to a TV that doesn't have an Internet or WiFi connection. Unfortunately this is where the bad news starts. While I can Cast from a Chrome browser in general, Amazon Prime uses Silverlight which appears is not supported yet. When I cast the tab I see everything on the tab except the video itself. Hopefully Amazon will support casting directly, both to simply allow me to watch Amazon Movies on the ChromeCast”。", "verified": true, "helpfulness": "0/0", "author": "Kainy Guo"}, {"rating": 5.0, "review": "I have never been a \"tech\" person. I have totally always pushed away from the latest and newest technology but Chromecast is AWESOME!! Works perfectly and super easy to setup.", "verified": true, "helpfulness": "0/0", "author": "kailyn williams"}]