[{"rating": 5.0, "review": "I really love it.  Easy to install, can control it with iPhone and with my Nexus tablet, works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Rafael A. Solorzano"}, {"rating": 5.0, "review": "Is such a great item that every person with a smartphone should have, it's easy to set up and you feel too confortable when you use it", "verified": true, "helpfulness": "0/0", "author": "Lwis"}, {"rating": 5.0, "review": "It's really pretty hard to go wrong, for $35. Being able to use my phone as a remote, and using the normal mobile interface of each app to do so, is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "What a piece of junk. Doesn't do anything it promises, including starting up! My phone is now filled with useless Google apps. Not portable, if you set it up once on wifi it is next to impossible to change to different wifi. So bad it's amazing", "verified": true, "helpfulness": "0/0", "author": "Trevor"}, {"rating": 4.0, "review": "I had one hickup with this when I first started. It was running hot and crashing. Then I moved it to a different HDMI slot on my TV and it worked fine ever since. This is great on my droid device and girlfriends apple phone to stream Netflix YouTube and Pandora. You can do a lot more than those sites but that's all we really use it for. Looking forward to updates to make it easier to surf internet by Chromecast as I found this was limited.", "verified": true, "helpfulness": "0/0", "author": "Matthew Standland"}, {"rating": 3.0, "review": "I am not a developer. I am not an own all the movies and music in the \"cloud\" person.I already have wifi dvd players on my too many TVs, so I can watch Netflix and YouTube whenever I want to.I bought the Chromecast sort of impulsively. I thought I would be able to see things on my chrome browser on the TV.Well, no, it won't do that from one of my tablets or my phone. You have to have a laptop for that. Even then, I don't think you can view just what you see on the chrome browser on the TV.You see the people in the demos laptop on lap, picture on the laptop and the same picture on the TV. Redundant. But fun? They look amazed.You have to download applications to your device, to \"cast\" to the TV. The \"apps\" are hard to distinguish at the play store.There's even \"an app for that\". Someone's app tries to sort out the Chromecast apps for you.If you subscribe to HBO, or some other paid video services you can cast them to your TV. But I guess that means someone else's TV cause you already can see them on your TV, Or can you buy HBO without the cable company? That might be cool.With the Chromecast you get to see your home photos and videos on the big screen.So now your relatives can make you see their selfie,,vacations, and kids parties in 60\" HD.Yikes.So, like the Google Fiber that will someday maybe come to my house, Google has this neat idea that is waiting for someone else to do something smart with.OKIt was $35 worth of fun to set it up. I had to remember my password to the wifi. That was a good thing.YouTube is beautiful through it. From the dvd it is hard to use and looks bad.Wait,Wait.Could those smart Google people be thinking of the future and the Chromcast will transfer my long awaited Google Fiber TV to more than  the  one TV box that comes with the deal?Dream on hopeful dreamer.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I gave this device four stars because day-to-day workings and app selection need improvement, but make no mistake - I love this thing.  I just bought my third one yesterday to put on a house television.  I thought this device might be a game changer when Google announced it last summer (almost in passing) and it has proven to be.  I think it is no accident that the newer version of the Roku streaming stick no longer requires an MHL connection to work, the price has dropped substantially, and the 1200 available channels through Roku are mentioned loudly and often in ads and other comparisons.Here is what I love about this little device:It is unobtrusive and can be powered either by a wall outlet or a USB port (most newer tvs have the USB port these days).  It is wicked easy to set up.  When I visit distant family or friends, I can bring my Chromecast so I can share or watch my media content over whatever else might be available.Some reviewers of Chromecast have complained that there is no remote.  I think that is one of the great advantages of this device.  I am tired of having to keep track of remotes.  I love that my smartphone or tablet (one of which is always nearby) can be used to choose, and otherwise control, my program and then that smartphone or tablet is available for other tasks.  That is brilliant - and along with the all-inclusive price of $35 - simply an amazing deal.  I get most of my streaming content through either Google Play movies or Netflix.  As far as I know, the only way to watch Google Play media on a tv screen is with Chromecast.  It's also great to be able to \"cast\" Internet content to a tv with Chromecast -  another great innovation.  Yet another nice touch is the revolving set of pretty photographs that scroll on the hdmi input screen that Chromecast occupies - much more preferable to just a black or blue screen.Here is what needs improving about Chromecast:The minimalist engagement required to set this device up is great until something goes wrong.  The only indication is the \"absence\" of the Chromecast icon.  The icon's absence is easy to miss.  I missed it just last night when I wanted to watch \"The Fifth Estate\" on my tv.  Chromecast could do a better job of holding onto the wi-fi signal.  Its hold on a wifi network seems to degrade over time - especially if there is a period of weeks between uses.  The \"help\" documentation doesn't really help, as the only way I have found to fix the situation is to reset my router.  I shouldn't have to do that to get Chromecast to reconnect to my wi-fi network.  Chromecast can also lose its connection to a program while it is playing.  There have been times when I get a program to play on my tv, but it is also playing on my tablet - and always at a different point in the program.  That's not supposed to happen, but it does, once in awhile.I don't think Chromecast needs to connect to 1200 applications, the way Roku does, to be successful.  It's not the number of channels, it's the quality of channels or apps that is important.  Being able to use Chromecast for Google Play media, You Tube, Hulu Plus, Pocket Casts and HBO Go makes the device useful to me.  But I would like to see Chromecast apps for Starz and Showtime and even Amazon Prime (ok, Amazon Prime is not likely, but I can hope, right??).  I think Google could add partnerships at a faster clip and be more aggressive about getting compatible apps developed for premium channels like Epix and Starz.And another thing -  Google can do a much better job of keeping the list of compatible apps up to date.  For example.  Pocket Casts is my go to podcast app and it is compatible with Chromecast.  But it is not included in the list of Chromecast apps on Google's own website.  Tsk, tsk, Google!Anyway, I think Chromecast is an amazing piece of engineering innovation, but that said, it still is a work-in-progress.  That's why I gave it four stars instead of five.  I hope Google continues to invest its considerable resources into Chromecast development.  I could pay for and be happy with a Roku media streaming stick, but I would rather pay for and be amazed by the (almost) awesome Chromecast.", "verified": true, "helpfulness": "1/1", "author": "morjoie"}, {"rating": 5.0, "review": "Love it! Great! Super! Love it! Great! Super! It is a great item. Super even! I use it more than my mo tv", "verified": true, "helpfulness": "0/0", "author": "Brian Latour"}, {"rating": 3.0, "review": "It is a bit of a pain to use sometimes and really the best quality it that your Google purchased movies will play in HD on your television. The biggest negative is that in order to play your music through it you have to upload all songs to the Google Cloud and that's more of a pain than what you should have to deal with for such a simple task.", "verified": true, "helpfulness": "0/1", "author": "Christopher Nuzzo \"Digital Chris\""}, {"rating": 5.0, "review": "Inexpensive, easy to install, no need for cable, satellite.  Ability to stream from electronic devices to TV is incredible.  Love it and bought another as a gift.  There are additional apps made available free of charge as well as some that are not.  The selections is huge and you will have fun finding all the neat things available for viewing.  Obviously a fan and would recommend this to anyone who wants to have more control on their viewing.  PS many are ad free!!", "verified": true, "helpfulness": "0/0", "author": "Betty C."}]