[{"rating": 5.0, "review": "Love.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Works Perfectly", "verified": true, "helpfulness": "0/0", "author": "Surgeon"}, {"rating": 5.0, "review": "This is a great tool. Use it to save money on your cable bill, get live streaming NHL, movies and everything else on your TV from your phone, tablet or laptop.", "verified": true, "helpfulness": "0/1", "author": "Eric Toft"}, {"rating": 1.0, "review": "There needs to be much better disclosure in the description here. I purchased this to use in our condo in the mountains, where we have a wifi system that covers the whole condo complex. The Chromecast setup requires that you first connect your laptop, phone, or tablet to the Chromecast device and then connect the Chromecast device to your external wifi. After much frustration, I discovered from the user forum that you cannot connect a Chromecast device to a \"hotel type\" wifi network that requires you to enter a user name an password in a special screen or web page. The forum says that some people have succeeded in a workaround whereby they set up a wifi hotspot on one mobile device and then connect the Chromecast to the Internet via the hotspot on the mobile device. This should be disclosed in the ads.", "verified": true, "helpfulness": "1/1", "author": "Judy in California"}, {"rating": 5.0, "review": "very very good works like a charm", "verified": true, "helpfulness": "0/0", "author": "DedoA"}, {"rating": 5.0, "review": "I love this lil guy with all my heart", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 5.0, "review": "Very convenient for getting media available on a TV or monitor in a pinch. Also very small and portable.", "verified": true, "helpfulness": "0/0", "author": "Holden Lewis"}, {"rating": 5.0, "review": "Once of my best purchases Yeh.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "I love this little invention. It allows me to stream YouTube and Netflix to my TV. Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Buyer"}]