[{"rating": 5.0, "review": "This thing is great. Super easy hook up. I use it in the bedroom where I don't have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "love bassets"}, {"rating": 5.0, "review": "So far I'm loving it.  Very user friendly, for some reason just love the little remote.  Maybe because it's so simple and a simple, nice design.", "verified": true, "helpfulness": "0/0", "author": "deb"}, {"rating": 5.0, "review": "My husband loves it.  I haven't gotten to use it as much but  I did play my music playlist, works great.  My grandsons played games on it and loved it.  I think it was well worth the money.  I see the price has come down since I brought it.  It was on back order but was shipped faster than they predicted.  Thanks Amazon.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was for my 13 year old daughter who doesn't have cable, but really enjoys Netflix shows, YouTube, and Pandora radio.  She loves it \"100%!\"", "verified": true, "helpfulness": "0/0", "author": "Ralph"}, {"rating": 5.0, "review": "Beat my expections", "verified": true, "helpfulness": "0/0", "author": "Edgar E. Tullis"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "Erica"}, {"rating": 5.0, "review": "We've been accessing Amazon Prime through our blue-ray for the last couple of years. The Fire TV is soooooo much faster, more stable, and more streamlined and user friendly. We absolutely love the voice recognition also...immediate results, without searching through menu's.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Movies I have to pay for and games that aren't interesting.", "verified": true, "helpfulness": "1/5", "author": "Bob Duckworth"}, {"rating": 5.0, "review": "Loads movies quickly and functions really well.", "verified": true, "helpfulness": "0/0", "author": "T. Gordon"}, {"rating": 5.0, "review": "It was very easy to set up and I love it. We've been using it for almost a month and have found the remote to be so responsive (both voice and buttons), everything starts quickly, picture is great, and seems so intuitive. The only thing that threw us for a loop during set-up was getting the netflix app to work. It wouldn't initially download and let us log in but we restarted the FireTV, searched for updates, and tried again as suggested by someone online helping another with the same issue and it worked like a charm.", "verified": true, "helpfulness": "0/0", "author": "kbgtigger2"}]