[{"rating": 5.0, "review": "Not sure how I lived without this device!", "verified": true, "helpfulness": "0/0", "author": "Patricia Rainone"}, {"rating": 2.0, "review": "Locked up my Samsung Galaxy Tab Pro 8.4 when I tried to cast the screen. As this was my intended primary use for it, I returned it. I am back to an HDMI converter/cable. Maybe when Google gets it right in the future ...", "verified": false, "helpfulness": "0/0", "author": "Ivo Zvolanek"}, {"rating": 4.0, "review": "Works great. Instructions could be a lot better but it isn't too bad to configure.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Manuel"}, {"rating": 5.0, "review": "Love Google Chrome! Just change the in out on my TV and bam! my phone, iPad, laptop, everything works in seconds on the tv", "verified": true, "helpfulness": "0/0", "author": "Katrina Kyser"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "KMR Rambke"}, {"rating": 1.0, "review": "Streaming skips so bad all the time. It's awful and beyond frustrating. When I stream what i stream is fine on my computer or laptop but terrible and skips on the tv. I HATE IT>", "verified": true, "helpfulness": "0/2", "author": "Kelsy"}, {"rating": 2.0, "review": "Takes longer to load than what was advertised,  also I assumed I could just stream over WiFi w/o  Internet connection... This is sadly not the case.  Also there's no Google Chromecast app for steaming videos from my phone... Although the quality is better when streaming Netflix using chromecast than my PC,  however it often delays in loading time", "verified": true, "helpfulness": "0/1", "author": "asher hill"}, {"rating": 1.0, "review": "Extremely disappointed, perhaps the worst holiday purchase this year. It does not function as described on the box and failed to meet the main reason I bought it (streaming Comcast Xfinity to my bedroom), save your money", "verified": false, "helpfulness": "0/2", "author": "Fr. Stephen Sinclair"}, {"rating": 5.0, "review": "excellent product and sellerthanks very much!!", "verified": true, "helpfulness": "0/0", "author": "Nicolas Rubio"}]