[{"rating": 5.0, "review": "Nice gadget. Takes up very little space.  A lot easier to pick up and take to a friends house than a console. Other than the media streaming the games are entertaining. Don't have to worry about paying for a network membership like I did with Xbox, just need WiFi or a LAN line. The boardgames they have, \"Life\" in particular, help pass time and easy to put down then resume later.  No hardcore platform games but that's not the purpose of this device. With the HDMI connection the resolution and clarity are great.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey A Cox II"}, {"rating": 5.0, "review": "man i just love this box thank god for amazon thay just do it right nobody does is better,just keep the hits coming", "verified": true, "helpfulness": "0/0", "author": "marquetta wright"}, {"rating": 5.0, "review": "Excellence begins with sleek packaging, then comes super small modern remote. Easy to begin using.  Undoubtedly it brings with it a fun experience.", "verified": false, "helpfulness": "0/0", "author": "Kenneth Guthery"}, {"rating": 5.0, "review": "I really like it a whole lot I would definitely recommend it to a friend is one thing I would like to know are they going to make the screensavers with the time and whether on them they have it on the Roku is a cool feature for me in the morning  getting ready for work but other than that I love it", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "I was pleasantly surprised how this little gadget works. Easy to install and use! The speed on this is awesome. Already having the Amazon Prime membership, it was a deal I couldn't turn down. So far the apps I have used, Hulu and Pandora work at faster speeds on Amazon Fire than my Dish, Sony Blue Ray and Wii. The process is convenient and quick to operate. Love the voice command feature! Works very well in my opinion. It may be my imagination, the sound quality seems to be more crisp. Normally I wait to buy new techno products, but not this time. Love Amazon and I trust them!", "verified": true, "helpfulness": "0/0", "author": "John N"}, {"rating": 5.0, "review": "Great hd picture and sound. Plays games very well. Lots of good shows and movies to choose fromWith a Prime membership. Very satisfied", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer \"Rosane Self\""}, {"rating": 4.0, "review": "Overall I'm enjoying watching Amazon Prime Shows, Netflix, HULU on the television rather than my computer. VEVO takes to long to buff the videos.", "verified": true, "helpfulness": "0/0", "author": "Tuttie"}, {"rating": 4.0, "review": "Love the seamless transitions but it still has some work left to be done. Biggest thing for me would be allowing filtering and aoeing you to purchase things from Amazon aside from stream content.", "verified": true, "helpfulness": "0/0", "author": "Bryan Watkins"}, {"rating": 5.0, "review": "It was SO easy to set up!  I can wait to start watching all the films and programming it has to offer!", "verified": true, "helpfulness": "0/0", "author": "vjevanslaw"}, {"rating": 5.0, "review": "Awsome I love it best purchase I made so far I recomend it very high speed great apps very easy to use  :)", "verified": true, "helpfulness": "0/0", "author": "Luz M."}]