[{"rating": 5.0, "review": "use on my office TV works", "verified": true, "helpfulness": "0/0", "author": "B. Northam \"murder coniseur\""}, {"rating": 5.0, "review": "Awesome product, wish I would have purchased it much earlier. The only drawback is that sometimes audio gets too quiet to hear. A quick reboot of the Chromecast resolves the issue every time.", "verified": true, "helpfulness": "0/0", "author": "The Strassa of Luffle"}, {"rating": 5.0, "review": "Slower, and not a great inerface than apple's TV, but works great for those TV's that you can't put Apple TV's on.  Or if you can't afford to have Apple TV's hooked up to every TV in your house.  Depends on your phone's signal to the WiFi.", "verified": true, "helpfulness": "0/0", "author": "naakedbmw \"naakedbmw\""}, {"rating": 3.0, "review": "Like it when I can stream, but its so limited.  DO NOT like only being able to stream anything i want.  I constantly am up against sites or things that won't cast.  Bummer.  Cheap, but make sure you know what it can cast.  Cheap doesn't mean its good.", "verified": true, "helpfulness": "0/0", "author": "Love movies that make you think. \"pecan928\""}, {"rating": 5.0, "review": "Gives Family Movie Night a whole new perspective!  Great product!", "verified": true, "helpfulness": "0/0", "author": "AWard"}, {"rating": 5.0, "review": "This is a great thing to have I was given a very large flat screen and was upset that it was not a smart tv,  this made my stupid tv smart.. :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Working great on my home wifi. Even though I have a slow internet connection, it can provide me with a excellent video quality (720p) and stable loading speed (Sometimes, it is just a little bit choppy). The only disadvantage is that it doesn't have the function to separate the audio with the video. I was using my computer with my Chromecast. Unfortunately, my monitor doesn't have a sound output so I cannot use it on my 'monitor'. But, as I said, it works great on my TV.", "verified": true, "helpfulness": "0/0", "author": "Allen Lou"}, {"rating": 5.0, "review": "Arrived quickly and the product works great!", "verified": true, "helpfulness": "0/0", "author": "shaneka johnson"}, {"rating": 5.0, "review": "Works great, streams even from the phone to full HD on the TV.  Picked up chrome app called Videostream to be able to stream video files straight  from my computer too!", "verified": true, "helpfulness": "0/0", "author": "Roy Michael Gallagher"}, {"rating": 5.0, "review": "Easy to install and set up and worked well the very first time.", "verified": true, "helpfulness": "0/0", "author": "Steven Dorsey"}]