[{"rating": 5.0, "review": "I would definitely recommend this on to others. Links right up to my chromebook and iphone. Is fast and reliable, and cheap!", "verified": true, "helpfulness": "0/0", "author": "Chase"}, {"rating": 5.0, "review": "Love it! It needs some improvements, but it's still in beta so don't be worried. Looking forward to the vast improvements that are abound.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "I love exactly WHAT IT DOES. I dont expect much out of a $35 device. I dont demand it go all out. It meets my expectations: Playing youtube from my phone. That's all I need or want it to do and it does it fine. I like that if I play to chromecast, my Sony TV will automatically switch inputs to the Chromecast. Don't know if that's a chromecast thing or a Sony thing.", "verified": true, "helpfulness": "1/1", "author": "SSC"}, {"rating": 1.0, "review": "I recently bought this device expecting not much given the $35 against a more expensive but powerful device like Roku streaming stick which costs around $70. It's amazing how poor this device performs in the living room. I have a Vizio TV that already supports YouTube and Netflix but I didn't like the browsing experience. Chromecast just show to me a bad experience from the beginning to the end. During the setup process, it updated twice, needed to reset the device around three times to make it work, after all the mess... the wifi signal was so poor even using the \"extension\" provided. Considering the TV has a very good signal and my iPad too has a very good signal on the SAME living room, it is disappointing to see the one bar wifi icon and chromecast complaining about the signal. Then came the real job... trying to stream a youtube video just didn't start after a minute, the iPad consumed too much more battery than watching the same video from the iPad. It's known that the device establishes the connection with the provided wifi and not with the iPad itself so I cannot understand how bad the app was programmed to end up taking all that juice from it.Overall, I recommend to stay AWAY from this device and if you are willing to spend the money, take another $30 bucks to buy Roku's stick. Bundled with more channels, features you won't feel that disappointment from a dead product (like many other Google failures poorly engineered).", "verified": true, "helpfulness": "1/5", "author": "Alberto C"}, {"rating": 5.0, "review": "It is a very convenient gadget, I don't have to always turn on my Netflix box,  When using my laptop I can cast from one tab and work with other multiple tabs, so I am no longer restricted to just watching, the ability to multi-task is awesome.  Casting does not work fully with some sites, perhaps future software updates will rectify that.", "verified": true, "helpfulness": "0/0", "author": "Anthea"}, {"rating": 1.0, "review": "I though it would work on all sites on Chrome . It does not !  Save your money for something more usefull..", "verified": true, "helpfulness": "0/2", "author": "RICHARD CONNER"}, {"rating": 1.0, "review": "So far it has not lived up to what it's hyped to be, I purchased it maily for being able to broadcast Netflix to my TV and it hasn't worked AT ALL, . Very disappointed in my purchase.", "verified": true, "helpfulness": "0/4", "author": "H. Rogers"}, {"rating": 5.0, "review": "Great price especially for a multi-tv household like mine. Now I can watch netflix in the bedroom, stream hulu in the livingroom for guests and still use my phone/tablet for whatever else I need at the moment. All for half the price of a non-mobile Apple TV!", "verified": false, "helpfulness": "1/1", "author": "Joseph Lee"}, {"rating": 2.0, "review": "The product was advertised in such a way as to seem to transmit the contents of the computer screen to a nearby television.  While it does do this, it only does it for certain specific, extremely limited applications.  Since the only one of these limited applications I use is a browser, this product is relatively useless to me.  With my computer on one side of a large room, and the television on the opposite, I cannot browse using the television.", "verified": true, "helpfulness": "0/2", "author": "L. G. Riddle"}, {"rating": 5.0, "review": "No wires, no fuss! Easy to use, easy to setup! I use it everyday, plan on buying 3 more for the rooms without cable.", "verified": true, "helpfulness": "0/0", "author": "Demeaturis Whitt"}]