[{"rating": 4.0, "review": "Ease of use yes. Convenient yes. Works well with Apple stuff mostly. Works well with Tablo and IPod no.", "verified": true, "helpfulness": "0/1", "author": "Sarah Langston \"Montananslikebookstoo\""}, {"rating": 5.0, "review": "Awesome product, until your wife puts the remote through the washing machine, and then you realize a replacement is $30. The mobile app is a pain to use if you have a lock screen that requires a passcode.", "verified": true, "helpfulness": "1/2", "author": "Shifty \"trance addict\""}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 3.0, "review": "Fire TV Good. Remote Junk. 6 month life span.", "verified": true, "helpfulness": "1/1", "author": "George Neurohr"}, {"rating": 5.0, "review": "Still learning all the things this thing does. Really worth every penny.", "verified": true, "helpfulness": "1/1", "author": "Marlin S. Blake"}, {"rating": 5.0, "review": "enjoyed it but wanted the stick so i could take it with me", "verified": true, "helpfulness": "1/1", "author": "Andre Young \"andre\""}, {"rating": 1.0, "review": "RMA'd the stick and went with this instead and it does work however since my ISP seems to have some issues in my area box well not provide adequate buffett to deal with bandwidth fluctuation.  Opened a ticket to see if there was a setting, support said no.  Was used to other products where one could pause the viewing and the unit would continue to download content but this unit stops downloading content when paused so have to deal with buffering issue.  Tried 6 +/- movies with same results so it just sits there not being used.", "verified": true, "helpfulness": "2/3", "author": "Michael L Thompson"}, {"rating": 3.0, "review": "I like the options with Fire TV, but so far it has been a bit glitchy, and it is occasionally necessary to unplug the unit for it to work properly.", "verified": true, "helpfulness": "2/2", "author": "Kelli Domroes"}, {"rating": 5.0, "review": "I bought this for my husband and he just loves it. It give me so many options to watch program that we may not have access to. I am glad he enjoys it. It was an Anniversary present.", "verified": true, "helpfulness": "1/1", "author": "Angela Lunn"}, {"rating": 5.0, "review": "I have no idea why anyone would ever buy anything other than Amazon Fire TV! Previous to purchasing the Fire TV, I used a Sony blu-ray player with wi-fi and apps like Netflix and AmazonPrime, but it was slow and frequently stopped working. I have not had a single problem with Amazon Fire TV. It is exceptionally fast and the microphone works fantastically well! Worth much more than it's priced!", "verified": true, "helpfulness": "2/2", "author": "Angellove"}]