[{"rating": 4.0, "review": "Works great and does exactly what I wanted without taking up any room on my tv shelves.  It arrived quickly and packaged nicely. Would recommend this.", "verified": true, "helpfulness": "0/1", "author": "Tonya Harmon"}, {"rating": 3.0, "review": "In terms of a tablet, you can only have 2 real sites ready to work well with it, netflix and youtube. there are other sites but they don`t have any interesting content. It is possible to stream other sites (beta) using a laptop or desktop but it is not the idea to get this thing. I suggest Google to work hard in order to offer a real connecting service between the tablet and the TV", "verified": true, "helpfulness": "0/0", "author": "Carlos Alvarez"}, {"rating": 1.0, "review": "Product will not work when you use a hotel WIFI. You cannot log in to their network. I had to find that out by looking for answers on line. So pretty much useless when traveling", "verified": true, "helpfulness": "0/1", "author": "John Martin"}, {"rating": 5.0, "review": "Very pleased with the ease of the setup and getting started.  Have only used once and noticed some lag between picture and sound.  As the program continued this lag seemed to disappear.  Looking forward to using this more>", "verified": true, "helpfulness": "0/0", "author": "Jon White"}, {"rating": 1.0, "review": "Didn't work to my expectations and then very difficult to return... they make it so hard to return that I'm about to give up the process and just consider it a loss.", "verified": true, "helpfulness": "1/3", "author": "Daniel K. Schmidt"}, {"rating": 3.0, "review": "This product has huge potential, but right now your options are pretty limited. It's fun to play around with, but if you have a play station or xbox then there is nothing this product can do that they can't but it is pretty awesome using my phone to navigate through Netflix and YouTube on my TV.", "verified": true, "helpfulness": "0/0", "author": "CourtJester"}, {"rating": 3.0, "review": "I like the concept, but thought I could cast everything from my tablet, not just certain programs associated with chromecast.", "verified": true, "helpfulness": "0/0", "author": "Pat Thering"}, {"rating": 5.0, "review": "There is a lot of ambiguity about what the Chromecast can and can't do.  When you search for answers to its capabilities, you are confronted with a lot of noise especially in the over 10,000 reviews here on Amazon.  In this review, I tried to document what did and didn't work for my very basic setup.My setup:HP Windows 8 Desktop w/ Intel Core I3 processor, 8GB RAM, hard wired ethernetLinksys WRT54G router - 10Mbps internet connection.  No VPN.Acer A100 TabletSamsung ARM ChromebookSamsung HDTV (It only has 2 HDMI ports so I also have an HDMI switch)Chrome Browser with Chromecast extension on HP and Chromebook with Tab projection quality set at StandardI installed the Chromecast setup app on the tablet.  Installation was fast and easy.  An automatic software upgrade was done as soon as the wireless was ready.The first thing I did was test Amazon prime video using tab cast.  I used the pop out mode and then right clicked in the title bar and used set as tab.  This gives you access to the cast icon.I tried the Chromebook first.  The video was choppy and audio and video were out of synch.  Not acceptable.Then I tried the HP desktop with the Chrome browser.  The wired connection found the wireless Chromecast.  I used the same approach as I used on the Chromebook with the pop out window.  Video was relatively smooth and the video/audio synch was not perfect, but OK.  I was able to watch 5 episodes of Alpha House.  I was also able to watch an episode of Sherlock from PBS.org.  The quality was very good and full screen worked.Next, I watched an MP4 video from the desktop hard drive.  I used <CTRL> O to find the file and the chrome video player played it.  Subtitles only display if they are burned in to the file.  Playback was acceptable.  Because I set up the Chrome browser in standard (480p) mode, the video quality was not the greatest, but certainly acceptable.You can't tabcast from the tablet.Youtube worked fine from the tablet and desktop.  From the Chromebook, Youtube was a little flaky.  It worked but the controls (pause, volume) lagged.  I don't have Netflix.Pandora worked the best from the tablet app.  From the desktop and Chromebook, you have to cast the browser tab, which results in the browser screen on your TV.  From the tablet, the name of the song and the artist were displayed like a screen saver to avoid burn in on the TV.Google Play music worked fine from the Chromebook and desktop.  On the tablet, which has an SD card full of the same music I uploaded to Play, I got an error on a few files regarding side loaded music files not being able to play.  I did not try Google Play Movies.All in all, I am very pleased with the Chromecast.  It met my expectations and the price was right.Update - 2/1/14  Occasionally when casting Youtube from the tablet, the cast cuts out after about 10 mins.  Sometimes, the tablet and the cast are out of synch and you can't pause the cast because a different video is displayed on the tablet. One nice thing about Chromecast is that any device can take control of what is being casted and cast something new.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We tried the Wei and looked at Best Buy for a device for streaming movies from Netflix. The Wei was to complicated to get it to work and by the time my husband finally got it set up, we were over watching a movie!! The streaming device from Best Buy was expensive. I found this on Amazon and gave to my husband for Christmas. We love it. Easy to set up and easy to use. I just go onto Netflix on my iPad, select a movie and bingo, we are watching the movie in our great room while enjoying our popcorn.  Great deal for under $40.", "verified": true, "helpfulness": "0/0", "author": "Marty Anderson"}, {"rating": 4.0, "review": "Only does a fraction of what I expected.  Basically good for Netflix and does nothing your smart TV cant already do. I think mines doomed for a life in the drawer with many other over hyped gadgets I just had to have.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]