[{"rating": 5.0, "review": "better  than HDMI cabel", "verified": true, "helpfulness": "0/0", "author": "omar.shafaq"}, {"rating": 5.0, "review": "Great product, and still in the game since Google announced software updates. So it's still a recommendable purchase.", "verified": true, "helpfulness": "0/0", "author": "Oscar Bastardo"}, {"rating": 1.0, "review": "Bought so that i could mirror apps---ANY apps, basically whatever is on my iPad screen (y'know, just like Apple TV but in a smaller, more convenient package...) to a TV display but it does not. It only works with ONE app i have: Netflix (maybe they should rename it \"Netcast\" & have Netflix include it as a part of their subscription services :-))And oh---it doesn't allow for a LAN set up either, you gotta use it with an internet connection.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product, works as advertised!", "verified": true, "helpfulness": "0/0", "author": "Kenneth"}, {"rating": 5.0, "review": "Excellent Product", "verified": true, "helpfulness": "0/0", "author": "Jose T."}, {"rating": 1.0, "review": "It was working fine until the last auto update.  Now it wont connect to any of my 2 routers.  Support is the worst.  They should get american reps, those foreign reps cant even communicate, I got so irritated just trying to talk to them.  Their excuse was my ROUTER NO GOOD, NO WORK WITH GOOGLE CHROMECAST.  I have 2 of them.  Google doesnt even want to replace them.  ROUTER NO GOOD, NO WORK....", "verified": true, "helpfulness": "0/0", "author": "User"}, {"rating": 5.0, "review": "We've used this quite often to connect our VIZIO TV with desktop (Windows OS), Nexus 7 tablet (Android OS), and HP ChromeBook (Chrome OS). All of our devices use the Google Chrome browser to cast the video. We are very pleased with the quick setup, ease of use, and quality video display. Needed a TVPower USB Power Cable for Chromecast to work with the VIZIO TV.", "verified": true, "helpfulness": "0/0", "author": "CW in KCMO"}, {"rating": 5.0, "review": "Excellent product, highly recommend", "verified": true, "helpfulness": "0/0", "author": "NEW FARM BOY"}, {"rating": 5.0, "review": "Received this as a gift. Let me tell you, it is the gift that keeps on giving! When I first got my Chromecast about a year ago, it had fairly limited capabilities. Since then, updates from Google along with 3rd party apps have really expanded what this can do. From screen mirroring my phone and computer desktop, to casting streaming flash and mp4 videos from nearly any and every source, this little dongle can do it all! And at this price, I might just stock up and buy a couple more for use at work, home, and on the go!", "verified": false, "helpfulness": "1/1", "author": "Patrick R."}, {"rating": 5.0, "review": "Absolutely perfect.  It does everything you could think to use it for.  I use my phone as my controller for my TV and the chromecast and stream videos, pandora, netflix, music, youtube, and my tabs on my explorer flawlessly without any lag.I have a Fire stick as well and while I like having the menu and remote in certain situations, I have never regretted the chromecast not having a menu once.  It is also far easier to stream things to the chromecast than the firestick.People who do not know how to stream from devices might prefer the menu of a firestick.", "verified": true, "helpfulness": "0/0", "author": "Collin P."}]