[{"rating": 3.0, "review": "I rely heavily on this as I only use my iPad to broadcast netflix to my TV. There are all sorts of minor glitches, having to close and reopen the program, completely shutting down and turning back on at times, falls off the wifi network...etcOnly Youtube and Netflix work on it.But when it works its great.", "verified": true, "helpfulness": "0/0", "author": "J. Baker"}, {"rating": 5.0, "review": "I bought this primarily to stream Netflix to a Samsung 22\" 1080p TV which is on my kitchen counter. Since I already have Netflix I had it up and running in a few minutes. The picture quality is outstanding. What's more you can stream any web page to the TV by clicking the \"cast\" button at the top right corner of the page. I cast the last episode of Borgen which was streaming on PBS. It worked perfectly.", "verified": false, "helpfulness": "0/0", "author": "William Schneck"}, {"rating": 5.0, "review": "Works as described. Provides easy user interfaces.  Works better with Netflix and Huluplus than Roku and is very easy to transport on vacation. I will buy more!", "verified": true, "helpfulness": "0/0", "author": "dpf"}, {"rating": 5.0, "review": "Plug it on my TV ,and bang got Netflix on the tube through my phone wow this is incredible very nice", "verified": true, "helpfulness": "0/0", "author": "Terry Leyba"}, {"rating": 1.0, "review": "If you have problems, Google support will be quick to remind you this is a Beta product.  What they don't make clear, is that you are their Beta tester and will be forced to suffer through their learning curve.The product specs state... \"Supports Netflix, YouTube, HBO GO, Hulu Plus, Pandora, and Google Play Movies and Music mobile apps as well as select content through Chrome browser.\"This is a flat out lie. This product only works for sites that provide the Chromecast plug in via their app, and there are very few of them.  Really, Netflix, YouTube and HuluPlus are about the only useful ones.  If you want to watch anything else via the Chrome browser, you can't.  It simply doesn't work.  Amazon Instant Video is blocked.  And if you try to cast anything from your Chrome browser, such as Hulu, it will freeze up and is not watchable.Save yourself the grief.  Spend a few dollars more and get the Roku.", "verified": false, "helpfulness": "6/11", "author": "Dusty"}, {"rating": 1.0, "review": "The Chromecast was Google's first opportunity to really hit apple and Microsoft where it hurt. I believe that the expectations far exceeded the delivery. I originally had planned to turn my whole life around converting my entire household into a Google environment. I got of course the Chromecast, and Chromebook to start. Little did I know that the only Chromebook that supports Chromecasting was the Pixel. Literally the most disappointing thing that Google could possibly do to me.. So I dropped it all and went Microsoft. Now that I've invested in one, I'm not really disappointed. But I seriously doubt Google can contend if it doesn't sort out its own compatibility issues first.", "verified": true, "helpfulness": "4/6", "author": "Price John Monroe"}, {"rating": 5.0, "review": "this thing is pretty awesome! I can play music from my phone to my sound system wirelessly or videos or my computer desktop. The only drawback was getting some of the apps (google play music & pandora) to work on my phone but the next day they suddenly worked.", "verified": true, "helpfulness": "1/1", "author": "mike"}, {"rating": 4.0, "review": "I just got this yesterday on the mail and I love it. It took me a little to get to know it, and it get used to it. The set up was easy on my samsung galaxy S3 as well as on my laptop. What I didn't like was all the apps that I had to download on my phone, and that on my computer I had to install google chrome to use it. Other than that fantastic product.", "verified": true, "helpfulness": "1/1", "author": "A. Martinez"}, {"rating": 3.0, "review": "I would like it more if the instructions in how to use it were written for people who aren't familiar with the home theater concept and don't use video games.  I have it plugged in to the back of my TV but have yet to make it work.  I've gotten no help from Google support yet.  I have the feeling that I will eventually puzzle through and get it to work.  I only hope my TV lasts that long.  I've read many complaints about the lack of any real programming.  Obviously, there are people out there who have gotten it to work.", "verified": true, "helpfulness": "0/0", "author": "Luise Healey"}, {"rating": 2.0, "review": "I hate the audio delay between my laptop and the big TV screen...very annoying. It doesn't work as promised...a waste of money.", "verified": true, "helpfulness": "0/0", "author": "Big Wally \"Foodie\""}]