[{"rating": 1.0, "review": "Oh My God !  Have you seen their terms of service. \"When you upload, submit, store, send or receive content to or through our Services, you give Google (and those we work with) a worldwide license to use, host, store, reproduce, modify, create derivative works (such as those resulting from translations, adaptations or other changes we make so that your content works better with our Services), communicate, publish, publicly perform, publicly display and distribute such content. \"", "verified": true, "helpfulness": "0/2", "author": "Tinker'r"}, {"rating": 3.0, "review": "I bought three new TVs for our house. I wasn't really interested if they were \"smart\" or not. Well my daughter's tv is a smart TV and my wife and daughter have become Netflix junkies. I bought Chrome cast so we could all enjoy Netflix in the living room rather than sitting on the bed, floor and desk in my daughter's room.I have yet to get it to work properly. I can't get it to connect in any of the bedrooms and in the living room it buffers a lot. I'd return it...but honestly I'm too busy and/or lazy to deal with it.", "verified": true, "helpfulness": "0/1", "author": "Richard"}, {"rating": 5.0, "review": "The Chromecast was super easy to set up and performs better than expected. Now all those videos and movies we watch online can easily be streamed directly to the TV. Even my technologically-challenged mom can operate it without any issues. Goodbye cable/satellite bill!", "verified": true, "helpfulness": "0/0", "author": "Dawn H"}, {"rating": 4.0, "review": "works best with netflix, but even with netflix there will be periods of slow loading or crashing and having to refresh on the laptop.  sometimes it will act like it's going to cast, but it will just show a loading screen forever.  it will only play for sure if you see the title of the movie/show on both the laptop and the tv.when i cast cbs.com, the chrome cast frequently stops casting when the first commercial break comes on.when using it to cast a dvd from my laptop or a software program, the sound doesn't come through on the tv, so i have to have the sound coming from the laptop.  not too big of a deal since my laptop is in the same room as the tv, but it is a bit of a problem when i'm watching a show with subtitles because the sound comes from the laptop a couple seconds before the subtitles show on the screen.  the delay can be annoying.sometimes the chrome cast performs worse when multiple devices are using the wifi connection at the same time.if there's a similar wireless product that works better in these areas, let me know.", "verified": true, "helpfulness": "0/0", "author": "Jun-Jun"}, {"rating": 5.0, "review": "Was thinking about subscribing to the premium channels just to watch certain shows I was missing but with this I'm not missing anything and it is all at my finger tips with no need to fill up my DVR to watch when ever I want to.", "verified": true, "helpfulness": "0/0", "author": "Adrian Jackson"}, {"rating": 2.0, "review": "Lag like you wouldn't believe it. Makes watching anything from either my LG 7 LTE tablet or Samsung Galaxy S6 purely infuriating. Gone are the simpler days of my Galaxy Mega that could just attach via HDMI cable to my Samsung TV. This device has me so frustrated that I'm looking to get an older phone, just so I can use the HDMI cable again. Samsung screwed folks over big, for sure, by making this worthless S6 not support the HDMI cable connection, and therefore forcing me to waste  $35 on Chromecast. Might as well buy a newer TV all together now, that's the next logical step. What a ripoff.", "verified": true, "helpfulness": "0/1", "author": "KidKat8807"}, {"rating": 5.0, "review": "Man is this great with my computer and free movies to chrome cast to..", "verified": true, "helpfulness": "0/0", "author": "alfred guy"}, {"rating": 4.0, "review": "Greatly expanded my viewing choices. I am not limited by my cable channels. I can enjoy anything on the 'big screen' by casting from my tablet! I don't have a DVD or TV so this is a very economical choice!", "verified": true, "helpfulness": "0/0", "author": "Suti"}, {"rating": 5.0, "review": "Works great.  Bought so I could watch You Tube on my TV.  Found out I can play You Tube on my TV with my Roko and much easier.  Don't use it much now.", "verified": true, "helpfulness": "0/1", "author": "Bonnie S. Johnson"}, {"rating": 5.0, "review": "Much more convenient than I had figured. Plug into your tv and stream whatever you want to your big tv and keep being able to use your phone whenever you want and still let your show play. Whether it be a Netflix original or some youtube music videos while you clean up the house, this streaming device really is great and it's so easy to set up.", "verified": true, "helpfulness": "0/0", "author": "frozeninferno"}]