[{"rating": 5.0, "review": "Good idea for chrome to have this - considering the multitude of like offerings from other companies.  Maybe the chrome notebook/laptop can have this built in?", "verified": true, "helpfulness": "0/0", "author": "lyle stewart"}, {"rating": 5.0, "review": "I love this thing because it is so tiny. I guess only complaint is that I can't stream anything locally for free and idk if you ever will. You can stream stuff from a chrome browser and I am cool with that.", "verified": true, "helpfulness": "0/0", "author": "Ridonkylous"}, {"rating": 5.0, "review": "Easy to install, if you have wireless. The quality of the image is solid and a smaller delay than I expected. Worth the money for me.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Great value for $35. Thinking of canceling DirectTV because of this awesome gadget! Gave them to my brother-in-laws for Christmas and they loved them!", "verified": false, "helpfulness": "0/0", "author": "Ashley Honke"}, {"rating": 1.0, "review": "Simple set up instructions, but complicated to set up. Have only been able to cast from laptop chrome browser. Good connection. Poor quality. None of the 2 apps that work from phone have the cast button. Worthless with phone. Does not worked as hoped or advertised.", "verified": true, "helpfulness": "1/1", "author": "RFJ"}, {"rating": 5.0, "review": "Honestly its really cool to just throw stuff up on your screen from YouTube and anything other tab on chrome from yur computer or tablet or phone or whatever.", "verified": true, "helpfulness": "0/0", "author": "Preston"}, {"rating": 3.0, "review": "At first I thought it did not work. Even though the initial setup was not difficult, it is confusing that first you need to find the Chromecast device in the the settings of phone, pad or laptop you are using during installation, and change the settings to the device. After it is installed, the device goes back to the last setting router you had and Chromecast does not appear in the available router list.Once installed the TV screen showed \"Ready to cast\", but the phone, pad and laptop could not see the device in the Chromecast App.  I reset the Chromecast and reinstalled several times, but it still did not work. In further reading troubleshooting, an issue is made about the few compatible routers. I thought that was the issue, since the Technicolor TG582n does not appear in Chromecast's router lists. It was not the problem.Chromecast's list of compatible routers is incomplete, they should add the very common Technicolor to their list. Instructions should make it more of an issue to turn all devices on and off, before worrying about router compatibility.After turning on and off the router a couple of times, the devices could all see the Chromecast and it started working. Easy once it starts to work, but a mystery while you see \"Ready to cast\" but no device could find it, and the icon necessary to cast did not appear.I found out that even though Netflix and Youtube work well, Ipads and Iphones are NOT able to cast Chrome tabs. Software is not \"yet\" available. Also you need to install a Chrome extension to be able to cast from a laptop. More support is necessary to make this a better device.", "verified": true, "helpfulness": "1/1", "author": "FJ"}, {"rating": 5.0, "review": "Very easy to use and now we can stream all our favorite shows and movies from Netflix or other apps. Highly recommend if you don't have a smart tv yet!", "verified": true, "helpfulness": "0/0", "author": "Caroline S"}, {"rating": 5.0, "review": "I had my Chromecast up and running in just a few minutes and was watching cat videos on YouTube just as quickly (cat videos were a kid-friendly choice to test this with. Also: hilarious). After the initial setup, videos appear on my television almost immediately.I've seen some complaints about this device being light on apps- and I suppose it is. However, I've not found this to be a problem. 99.9% of what I would use this for is available to me. Netflix, Hulu Plus, HBO GO, YouTube, and Pandora. Done. Well worth the 35.00 right there.I've read that there are more apps on the way and I have no doubt that's true. Even as it stands, this is a great device.", "verified": true, "helpfulness": "0/0", "author": "Man Of Aluminum"}, {"rating": 1.0, "review": "This was inexpensive at less than half of what I paid for Roku3. It does not compare however. I can use it to watch Netflix while I work out but not much more. It really needs the software to access more content including Amazon streaming.In the back of my mind I also suspect that google is spying on users by gathering data from their Wifi usage. Am I just being paranoid?", "verified": true, "helpfulness": "0/1", "author": "ROY N. UDWIN"}]