[{"rating": 1.0, "review": "Who needs to watch youtube on their big screen? It doesn't work the way I thought it would.  What a big letdown", "verified": true, "helpfulness": "1/5", "author": "Tracy L Fortman"}, {"rating": 5.0, "review": "I love it. My techie friend loves it. Even my technophobe Dad loves it. That pretty much covers it.Sometimes Netflix freezes, so I power cycle and unplug/replug. That has solved the problem so far. Otherwise it's my prefered method for tv watching on an actual tv. How novel. We were using plex before, then tried to upgrade machines, and it was a horrible mess. Screen sharing stopped working. The new drives were iffy. Plex would not recognize the directory and you can't just play a file in it like you would VLC. Mac's are on their way out and Plex is crap, so use this instead and let the cloud take over our lives.", "verified": true, "helpfulness": "1/1", "author": "H.L. \"Silent Knell\""}, {"rating": 3.0, "review": "It works great for streaming netflix and hulu. You can't stream any sideloaded content however, even if the application supports it. For this reason, it gets a 3/5.", "verified": true, "helpfulness": "0/0", "author": "Matt Peters"}, {"rating": 5.0, "review": "Fun essay to use . Grandson uses it all the time . Works well have had no problems using it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "As i see the only disadvantages that it does not support all applications but overall it is very good .", "verified": true, "helpfulness": "0/0", "author": "Ahad ALOtaibi"}, {"rating": 4.0, "review": "I don't know if its my network but i have to reset my wireless (actually go into the setting and then exit and save)(no changes made btw) every time the chromecast loses power to connect.  it's a cool idea but mine is buggy.  my dad has one and his seems to work well so does my brother also.  it's possible i got a lemon....I'm a little known for that.... only other complaint.  it will not let you stream anything from the browser to the tv. (Video) unless its through its approved app.", "verified": true, "helpfulness": "1/1", "author": "Anthony Hayward"}, {"rating": 5.0, "review": "I was a bit leery of any product that cheap. But no longer doubting. This gizmo works great 98 percent of the time. I love it because I can watch instructional videos from Photoshop CC and or Canon right on my TV. The first thing I did was pull up an old classic, Tobacco Road off You Tube. Every other site, if you find it, rents it.", "verified": true, "helpfulness": "0/0", "author": "MiannaJo"}, {"rating": 5.0, "review": "if your like me spending $7 a month on hulu plus just so you can stream it through your gaming device this little thing will more than pay for it'self in just a few short months. add in it's ability to stream webpages and youtube and it will change the way you do TV", "verified": true, "helpfulness": "0/1", "author": "jasonmerril"}, {"rating": 2.0, "review": "I give this two stars due to the extremely limited content offerings.  No Netflix, cannot stream from your phone, no USB or sd slot.  I don't even use it.  I bought a Roku 3 and it is on a totally different level.  The Roku has seemingly endless variety of content and does all the things this thing doesn't.  I don't recommend this unless you just want to watch YouTube on your TV.", "verified": true, "helpfulness": "3/4", "author": "Proud Hillbilly"}, {"rating": 5.0, "review": "Just what you need for standard streaming, very easy to setup and I love that I can control that from any device.I can pick the movie from my HTC Phone, Ipad, etc. and up we go is going directly to my TV. There are a ton of new apps in the Google Play store that support chromecast now anything form Hulu to an app to use your TV as a whiteboard", "verified": true, "helpfulness": "0/0", "author": "TonyT"}]