[{"rating": 5.0, "review": "Fire TV is Awesome !!!! Setup in minutes easy to use. Just replaced my Roku with the Fire and BOOM mind blown this little box is fast and easy a great picture my roku is slow slow compared to this.......Why did I wait so long to upgrade to FIRE TV", "verified": true, "helpfulness": "0/0", "author": "Jack Campbell"}, {"rating": 4.0, "review": "aaa", "verified": true, "helpfulness": "0/0", "author": "MARTHA RIZO"}, {"rating": 3.0, "review": "Very excited to use, super easy installation, I was super pumped to find the most recent season and episodes of The Walking Dead ( Zulu and Netflex don't offer) but amazon wants to charge me per episode?! I am a prime member! Isn't that why I pay membership fee and bought it outright?! Little disappointed now.", "verified": true, "helpfulness": "1/1", "author": "Alison Greene"}, {"rating": 5.0, "review": "I,m realy  enjoyong it but I wish it came w/instruction book", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Got this for Xmas 2014. Really disappointed. Not allowed to use USB port for storage, play movies, music or anything. Just AZ streaming.!!!!!", "verified": true, "helpfulness": "0/2", "author": "warbler \"Husky55\""}, {"rating": 4.0, "review": "Nice unit for receiving Net Flicks and Prime Instant Video.  Easy to use.  One downside ... you can't hook it up to an older TV.  The TV must have a HDMI port.  I ordered this for my Great Room where I have a nice, but 10-year old, Sony TV that I'm not ready to replace.  It is ok ... I moved a ROKU unit to my great room and am using the Fire in my bedroom, which has a newer TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon Fire TV is fast, fun, and has many options! Still learning how to do everything, but enjoying thoroughly as I go along.", "verified": true, "helpfulness": "0/0", "author": "Taylor \"A. Taylor Todd\""}, {"rating": 3.0, "review": "Allowed access to many movies, but not completely as advertised.  Bought this along with Amazon Prime.  Can not watch movies on my Android tablet which is a joke.", "verified": true, "helpfulness": "1/1", "author": "Lojac"}, {"rating": 4.0, "review": "Easy to use, even for a non-techie like me.  The only thing preventing me from giving it 5 stars is that sometimes when streaming Netflix, it kind of freezes for a split second and then moves on. We didn't have that problem when watching the same series through Netflix without the Fire, so can only assume it's that.", "verified": true, "helpfulness": "0/0", "author": "L. Taylor \"Colorado Bookworm\""}, {"rating": 4.0, "review": "I do like it but it is geared to show mostly pay for view items so be careful you don't just hit play and then realize you just bought something. The box is small and the remote is very easy to use. I do particularly like the voice feature. Overall a good buy.", "verified": true, "helpfulness": "0/0", "author": "Joan E. Guentz \"guentzje\""}]