[{"rating": 4.0, "review": "I just wanted to leave a quick review highlighting the one functionality of the Fire TV that made it a winner for me.  I switched from a Roku 3 that I had been using for a year to the Fire TV.  The sole functionality that won me over was the addition of Spotify Connect technology (combined with the optical audio output).  What that allowed me to do is run the HDMI to my TV and run the optical output straight to my stereo integrated amplifier with the desired outcome being the ability to stream music without having to have my television on. It allows you to 1) navigate and control Spotify using the interface native to the controlling device (in this case an Ipad Air and a Motorola Moto X) while 2) not having my personal devices do the actual streaming as would be the case with bluetooth and I believe Airplay technologies.  That saves you a bit of battery life plus leaves your controlling device more responsive to other things you might want to do with them.  From the video side I pretty much just use Netflix, Amazon Prime Video, Crackle, PBS and Hulu - the Amazon hardware seems to be faster than the Roku box but I will say not having the voice search work on Netflix is irritating (Question for Amazon: how do you think paying for content from Amazon that I am getting from an existing subscription fee would in any way make me a happier customer?).  In back to back comparisons I detected a slightly better video quality from the Fire TV.  Making the voice search cross platform compatible would make this device a strong 5 star contender.  My guess is that happens when Roku puts out their next device that does just that.  In the end, the media that I buy does come from Amazon - I just don't want to accidentally buy something I could stream for free.  Either way, I recommend the Fire TV, particularly for Spotify Premium subscribers.", "verified": true, "helpfulness": "2/2", "author": "Chris Hopkins \"newcastle68\""}, {"rating": 4.0, "review": "So far so good for the week that I had it.  I also have the 60 day free Amazon prime.  I was happy when seeing the Sopranos on prime with out paying $24 for episode 1 . Not sure if it's prime or not, but The animated batman series is one of my favorites and they have it.. Very happy so far.", "verified": true, "helpfulness": "3/3", "author": "Jovan aponte"}, {"rating": 4.0, "review": "works just fine and a good plug in.......", "verified": false, "helpfulness": "0/0", "author": "William K. Allen"}, {"rating": 3.0, "review": "I like most of the features on this device, however I was extremely disappointed to find out I couldn't stream videos off of my hard drive through the USB port on the back of this device.", "verified": true, "helpfulness": "0/0", "author": "Bull"}, {"rating": 4.0, "review": "So far so good.  Works well and is quick.  There are a few things that bug me, but they are minor; the menu is a bit annoying to use, going into categories and such, but just a learning curve I guess.  The next is once a parental guide is set, you have to input the code for EVERYTHING.  I set it so my son couldn't make purchases, but even to watch the TV shows on prime he likes requires the code.", "verified": true, "helpfulness": "0/0", "author": "Tyson"}, {"rating": 5.0, "review": "love it...", "verified": true, "helpfulness": "1/1", "author": "Pinterest Lady"}, {"rating": 3.0, "review": "Love it. Nevet have to think about what is 9n...I have so many choices.", "verified": true, "helpfulness": "0/1", "author": "Penny Read Husum"}, {"rating": 5.0, "review": "Great product.  My only complaint would be that their is no on/off switch.  It turns off by itself after about 15 minutes of inactivity.  Why not give me the ability to turn it off myself AND the ability for it to turn off itself?", "verified": true, "helpfulness": "0/0", "author": "Salomon"}, {"rating": 5.0, "review": "Its a Great Device. Loving it. Gaming is Awsome. Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Nithyanandam N"}, {"rating": 2.0, "review": "Nearly everything accessible through Amazon Fire TV costs! Old TV shows from the 60s and 70s cost per episode! These same shows are free on regular TV. Like with Netflix, many of the shows that are free are crap! Although I am still evaluating Amazon Fire TV, it is not off to a good start.", "verified": true, "helpfulness": "1/2", "author": "M. Wayne \"M. Wayne\""}]