[{"rating": 4.0, "review": "Works well. Was surprised some of the shows I wanted carried a charge  Was under the impression they were at no additional charge with amazon prime.", "verified": true, "helpfulness": "0/0", "author": "nanaluvsflwrs"}, {"rating": 5.0, "review": "easy to use very good service", "verified": true, "helpfulness": "0/0", "author": "farnk caretti"}, {"rating": 5.0, "review": "Best remote I've every operated.  Selection of shows is nearly endless. Easy to set up.Even the voice control works. A pleasant surprise.", "verified": true, "helpfulness": "0/0", "author": "Cliff reader"}, {"rating": 5.0, "review": "Super easy to use and you can always find something to watch with Amazon's Fire TV!  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Gina--Baby"}, {"rating": 5.0, "review": "Excellent product! I am cutting the cable...", "verified": true, "helpfulness": "0/0", "author": "Brian D. Hercules"}, {"rating": 3.0, "review": "The Amazon Fire is easy to set up and it is a good streaming device. Note that it does not come with an HDMI cable, but that is not unusual for these things - just be aware that you will need to purchase that separately if you don't already have one. The voice search feature is very cool EXCEPT it only pulls programming from Amazon...pretty enormous glitch there, and kind of shady. Even if you have Netflix, for example, and are signed in - if you want to find a program - it will only pull Amazon programming. Just be aware so that you don't end up paying Amazon for something to which you have free access by virtue of a subscription elsewhere. The Roku (another streaming device) has a search feature (which is not voice activated) that will show you everywhere a program is available and give you price comparisons...that is what I was expecting from a search feature. I would have given this product five stars were it not for this shady little glitch with the voice search. Kind of disgusting and misleading for Amazon to advertise that you can search for programming easily with this feature when, in reality, you can search for programming ON AMAZON easily with this feature.", "verified": true, "helpfulness": "1/2", "author": "MelDel \"Mel Del\""}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "marcelo"}, {"rating": 5.0, "review": "Having been delivered form sports fanaticism...Knowing that the talking heads of the news world tell mostly lies...and always report with their own agenda anyways...Having never been a reality show guy...Never seen a single episode of:Survivor, Glee, Duck Dynasty, American Idol, America's got talent, Dancing with the Stars...(You name it, I haven't watched it...)All these things considered, I am made for internet TV.Very pleased with my choice to cut the cable.I am missing nothing,And AT&T; can support immoral causes with someone else's money.And I'm saving 75.00/mo on programming...And I'm saving 70.00/mo on internet...And I'm getting 100G/mo more data...And I can live with myself...And THAT is priceless!", "verified": true, "helpfulness": "1/2", "author": "James"}, {"rating": 5.0, "review": "So far it exceeds expectations", "verified": true, "helpfulness": "0/0", "author": "Alvin Trotman"}, {"rating": 5.0, "review": "Nice product, we use this to run Sling since cutting the cable/satellite service.", "verified": true, "helpfulness": "1/1", "author": "Illinois Joe \"Joe\""}]