[{"rating": 5.0, "review": "Works like a charm for what it was designed to accomplish. The small compact size is great. I use it to bring Netflix to an \"unsmart\" outdoor tv.", "verified": true, "helpfulness": "0/0", "author": "Walter E. Keasler \"Dr.K\""}, {"rating": 5.0, "review": "Does exactly what I wanted it to. Streams from one chrome browser page to tv. Can move to different tvs as needed.  All wireless.  No cord to trip over.", "verified": true, "helpfulness": "0/0", "author": "Richard Parker"}, {"rating": 5.0, "review": "This is the greatest invention for streaming Netflix to your TV wirelessly! It makes Netflix appear on the screen, prevents pauses in buffering, and you can still do other things on your computer without changing the stream on the TV. Regular HDMI cables don't allow for that! I only wish it would wirelessly transmit anything (such as windows media player) but I know it's just a matter of time. I can't believe how affordable and how awesome! Kepp up the good work Google!", "verified": true, "helpfulness": "0/0", "author": "Rae Charles"}, {"rating": 5.0, "review": "Chromecast met all my expectations, I have had zero concerns, and it works great for all my apps I love. Only negative is Vudu and Amazon are not available.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I tried and tried to get this thing to work with no luck. Thankfully Amazon policy made it easy to return and get full credit for the purchase.", "verified": true, "helpfulness": "1/1", "author": "Edward J. Joy \"louietrips\""}, {"rating": 4.0, "review": "Device agnostic with bluetoothEasy to useGreat for traveling and streaming movies when in hotelsNo cons, no issues", "verified": true, "helpfulness": "0/0", "author": "Brian Seiton"}, {"rating": 2.0, "review": "It was not clear to me from the info available of the product, but anyway I bought it. Limited streaming.", "verified": true, "helpfulness": "0/0", "author": "Sergio H P P Eckhardt"}, {"rating": 3.0, "review": "I don't understand what all the hype was about. I suppose for the price, this is a good product, but I was expecting it to do a lot more. I wasn't impressed by the games or apps, finding them to be simplistic and pointless. It works well with Netflix and HBO GO. I wish however, that when watching shows on Netflix that it would stream the next show automatically instead of having to switch back and forth between my iPad and TV. That is not a deal breaker, but when I want to watch multiple episodes of a tv show, sometimes I find it less cumbersome just to watch directly from my iPad.I originally purchased a defective item from best buy. I saw it there and snagged it before mine was sent from the  amazon waiting list. It worked at first but then stopped casting, only showing the screensaver and chrome-cast logo on my tv. I spent over an hour attempting to reset it and troubleshoot over the phone with customer service before it was deemed defective. I have had no problems with my second chrome-cast purchase.This is a good item for the price and is very small and portable. I have only used mine in my home tv, but think it would be a great product for people who travel a lot and want to take their Netflix with them.", "verified": true, "helpfulness": "0/0", "author": "Katrina Coukos"}, {"rating": 4.0, "review": "Youtube works flawlessly, although I miss netflix in India. If you have many tablets and smartphones, this is a must have for making you TV smart.", "verified": true, "helpfulness": "0/0", "author": "Amit Arora"}, {"rating": 4.0, "review": "UPDATE 3/15/2014: Ever since Plex app made the media server available without the $4 a month subscription a couple days ago, I would say Chromecast is really worth its $35. Luckily I was subscribed for only a month before the change. I'm keeping my rating to 4 stars though because unless you have a smart device (tablet/phone), there's really no other way to control Chromecast other than from your computer. There's no remote control for this thing. It doesn't affect me but I'm sure this could be a deal breaker for some.OLD REVIEW:Very convenient if you hate wires hanging all over your living room if you want to watch internet on a big TV in the living room. Connecting my laptop to the TV is arguably more superior in every way except convenience. The only thing that keeps it from 5 stars is because there are hardly any compatible apps for it. I bought it mainly to stream from my home media server but soon realized Plex is my only option. Its a great app when it works but its a $5 app on top of the $4 a month subscription. Subscription to stream your own media that's already in your house!? Its such nonsense but hopefully soon other developers will come out with more media sharing options.  Also make sure you have wireless N router if you want a smooth stream when media sharing. But chromecast is only $35, so its pretty good for what it is. If you watch a lot of YouTube and hulu plus, and or HBO go, then this is great.", "verified": true, "helpfulness": "0/0", "author": "Michael Ng"}]