[{"rating": 4.0, "review": "So far I'm very pleased with the Fire TV. The voice control is very easy to use and you don't have to repeat yourself 10 times before it understands you which is nice! We are hoping to cancel our cable service and just use the Fire TV. The only disappointment so far is with the selection of Prime TV and movies. I think that for the price of the annual subscription there should be more TV shows available. I hope more get added! Otherwise, quite happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Sgoodwin1331"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Ron S."}, {"rating": 4.0, "review": "If you're an Amazon prime member, you are going to enjoy this streaming device.Pros:- Voice Search is really cool- Pretty good as a gaming platform (racing, bowling, tank games are cool on this interface)- Fast interface.  You can tell that this device has some nice hardware included.- Found a wireless receiver that allowed me to use an Xbox 360 controller with Fire TV!  Be sure to pair this receiver with your Xbox controller using your PC.  Look here for more info: Xbox 360 Wireless Gaming Receiver for Windows- The device is VERY small (about 4-5\" square) so its easy to take along.  I'm travelling soon and plan to take this with me as a portable video, music, gaming device for my kids.Cons:- Wish that Netflix was as 'native' to the device as Amazon Video.  Amazon interfaces (video, games, music) are built it...which is awesome, but other interfaces (Netflix, Hulu, etc) are treated as apps (i.e. you have to explicitly open them to use them).- There is no easy way to turn the device off.  There is a 'sleep' option BURIED in the system menu and no reference to it in the package that I found.  I had to search on-line to find out how to put it to sleep.  For now, I've found its easiest to unplug it.  Unplugged is the only way to guarantee no power consumption and that it won't accidentally turn on when the remote is bumped (its very easy to 'wake it up' by brushing the remote).- Cost of the BT gaming controller is $40 (which seems high when the stick is $40 -- I got for $20 -- and brick was $70), but found a good option (see pros).  I bought one to use with the stick because its the only option.- Can't play music while watching a video (okay, fine...I guess this wasn't a surprise but it would've been nice for Christmas morning to have the fireplace video with pandora's Christmas music channel).Updated 6/2/15:There was an updated that silently showed up in the last few months that added a 'sleep' option on a very cool menu that shows up when you press and hold 'Home'.  Thanks Amazon!I also REALLY like that I can punch in the parental lock code now without my kids seeing me navigate to the number.  My 8 and 6 year olds were having an easy time figuring out what the lock code was.  The new interface helps keep it secret.", "verified": true, "helpfulness": "2/2", "author": "swatt77"}, {"rating": 5.0, "review": "Awesome product!! I think I've used it almost every day since I've purchased!", "verified": true, "helpfulness": "0/0", "author": "Melissa O'Neill"}, {"rating": 5.0, "review": "Wonderful product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Short on words but if your looking for an alternative to the high priced cable movies this is perfect. I am no techie so I was afraid that this would be hard for me to hook up...Not an issue. Basically plug in and go. Works like a charm", "verified": true, "helpfulness": "0/0", "author": "Harpers Nana"}, {"rating": 5.0, "review": "love it so far voice mode works perfect easy easy to use", "verified": true, "helpfulness": "0/0", "author": "Todd Miller"}, {"rating": 5.0, "review": "Love it! !!", "verified": true, "helpfulness": "0/0", "author": "Phillip C. Wright"}, {"rating": 3.0, "review": "The fire responds fast but seems to  have about the same things as Netflix or Roku, not to impressed with it.", "verified": true, "helpfulness": "0/0", "author": "DANAL"}, {"rating": 3.0, "review": "if you could mount usb drives without rooting I'd of given 5 stars", "verified": true, "helpfulness": "0/0", "author": "william a mcelroy"}]