[{"rating": 5.0, "review": "on time and good product", "verified": true, "helpfulness": "0/0", "author": "Mark K."}, {"rating": 5.0, "review": "I love this. We used to have to hook our TV up to our computers through an HDMI cable which was awkward and inconvenient, but now we just have to open chrome and start casting and we can see anything on our computer screen on the TV! Netflix and youtube apps work great, and I love being able to stream pandora through my TV/surround sound. There are lots of other great iPhone apps that can use Chromecast, including one that will put famous works of art on your TV so it doesn't look so ugly (great if it's hanging above your fireplace like mine).Setup was easy and only took a few minutes. Definitely worth the $30!", "verified": true, "helpfulness": "0/0", "author": "Emily G"}, {"rating": 5.0, "review": "Works great and use it all the time to cast movies.. now have one on each TV", "verified": true, "helpfulness": "0/0", "author": "Fred Miller"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Sergio"}, {"rating": 5.0, "review": "Waited to buy this until Google added full screen mirroring, was not dissappointed - works as advertised.  Best 35$ I have spent on an electronic device, and it allowed me to get rid of the Logitech Revue.  Thank you Google!!!", "verified": true, "helpfulness": "0/0", "author": "BattleGirlKristi"}, {"rating": 5.0, "review": "I've had it for a year now an never regretted my purchase. I use it just about every day, great netflix, hbo, hulu, etc subscriptions.", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 2.0, "review": "very hard to use, and the video it not clear. don't buy this one.", "verified": true, "helpfulness": "0/0", "author": "tnguyen"}, {"rating": 3.0, "review": "I wish there could be a simpler method to broadcast the Pics and Videos from my smartphone to the 42\" TV so I could show them to Gradma... I know I know.... this feature is coming out soon but just for certain smartphone models (Sadly my low budget Android is not within them :(I haven't tested broadcasting services (Netflix, Hulu, etc.) because I don't live in the States so the content we receive for those services here in South America is really crappy.Don't get me wrong; Chromecast has a lot of potential, but for me it only works for streaming Youtube videos...", "verified": true, "helpfulness": "0/1", "author": "Jorge Salinas Flores \"Coco\""}, {"rating": 4.0, "review": "Works well as expected. Wish there are more app support.", "verified": true, "helpfulness": "0/0", "author": "Sean Qiu"}, {"rating": 5.0, "review": "Amazing product and is a perfect gift bought a bunch of them as gifts, I have one for my work trips to use on the go", "verified": true, "helpfulness": "0/0", "author": "BENJAMIN B CERVANTES VEGA"}]