[{"rating": 4.0, "review": "It works well. I wish I had more control over the device as I am used to with my Android phones.I feel they could improve certain things like if it were having trouble streaming it would pop up a message on the screen and provide some tips to resolve it.", "verified": true, "helpfulness": "0/0", "author": "Nate Dizzle \"tech guru\""}, {"rating": 5.0, "review": "This thing rocks, I have 2 apple tv's , airport extreme, and all I really used them for was youtube and netflixUnfortuneately Apples remote app crashes every time you wake the ipads from sleep andyou end up having to restart the Remote App and reconnecting to the specific apple tv. (irritating and time consuming)Latest apple tv ios update did not addresss the issue. (unfreekin-believable) even though the forums are full of complaints.So I just ordered a second chromecast (because they work)Both Apple Tv's are now sitting in a drawer. (what a waste of money)If your like me and your main thing is youtube and netflixTHIS IS WHAT YOU WANT !", "verified": true, "helpfulness": "0/0", "author": "baby killer"}, {"rating": 5.0, "review": "It's easy to set up and it's easy to use. I totally recommend!", "verified": true, "helpfulness": "0/0", "author": "Albert Torres"}, {"rating": 5.0, "review": "Makes any TV with a HDMI input an easy to use Smart TV.", "verified": true, "helpfulness": "0/0", "author": "A. O. Zamora-roatt"}, {"rating": 3.0, "review": "Great product... however limited in terms of sound processing ability (no Dolby D, DTS), and also unable to read movies directly from a Synology NAS. Otherwise, value for money device", "verified": true, "helpfulness": "0/0", "author": "Haridas Maulloo"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "MING-KAO CHIU"}, {"rating": 5.0, "review": "Love these so much I have them all over my house and have gifted them to everyone I know. Amazing product.", "verified": true, "helpfulness": "0/0", "author": "Carnagio \"Carnagio\""}, {"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I bought the Google Chromecast to try to connect my TV & the internet.To some degree, I have to say the Chromecast is a success.Youtube, & some other web sites work great, & you can customize the Chromecast a little.Using one of our computers, there are a number of web sites we can use w/ the TV, which is great.BUT; its not really able to 'interact' w/ the web, the way most of us do w/ a computer or a tablet.I'm still looking for a way to surf the 'net, do email, news, & the other stuff I do online, because the Chromecast is really pretty limited in what you can do w/ it.Its works well for what it does, it just doesn't do enough for me.My bad, I'll keep looking for a device that well let me access the web on my TV.For videos, & sites that focus on them, its great, but that's about all it can do.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Steedley \"sl0j0n\""}, {"rating": 5.0, "review": "Great!", "verified": false, "helpfulness": "0/0", "author": "Anas Patel"}]