[{"rating": 1.0, "review": "Worked for almost a year and then my TV quit recognizing it. Have to remove it and plug it back in a half dozen times, then run the setup app so my PC will see it. This routine takes about 10 minutes and I have to do it each time I want to use it. Also if you call for support, be prepared for a foreign support agent using a script who makes you complete a whole bunch of troubleshooting steps (including a factory reset) which takes about an hour. Also they won't keep any of your info on file so you'll have to do it all over again if you call back for an RMA after trying the mandatory factory reset (which won't fix your problem). Fun stuff.", "verified": false, "helpfulness": "0/0", "author": "RunMore"}, {"rating": 4.0, "review": "Great product. I hope Google creates Chromecast support for more apps.", "verified": true, "helpfulness": "0/0", "author": "Gaius N."}, {"rating": 5.0, "review": "SIMPLY A MUST HAVE DEVICE...Works really well with IOS .. My 3 year old use to hog my phone for his youtube cartoons... now even he can use it to chromecast it... its an amazing innovation..", "verified": true, "helpfulness": "0/0", "author": "Viv28"}, {"rating": 5.0, "review": "Very gooooooood", "verified": true, "helpfulness": "0/0", "author": "fahd"}, {"rating": 5.0, "review": "excellent!", "verified": true, "helpfulness": "0/0", "author": "jesgonza \"jazz crazy\""}, {"rating": 5.0, "review": "Amazing product", "verified": true, "helpfulness": "0/0", "author": "asepulveda"}, {"rating": 5.0, "review": "Within 10 minutes of picking the package up from my doorstep I was streaming Netflix onto my tv. The plugs right into an HDMI drive, which you then plug into the wall. The setup was EXTREMELY user friendly. It walks you through everything on both your phone/tablet/laptop and the tv. We currently use it in our guest bedroom because our guests can download the app, hook it up to our chromecast and watch their nextlix/hulu/ whatever! I highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Kelsi DM"}, {"rating": 2.0, "review": "It is good for picture not for video.Sound lags.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "We got rid of our cable and now use Chromecast and an antennae to watch all our tv. There are more apps adding Chromecast capabilities all the time.", "verified": true, "helpfulness": "0/0", "author": "SurferGirlSD"}, {"rating": 1.0, "review": "Love google, hate this product. MK809IV is so much better and so much more familiar.Android is android. Leave it looking like a phone/tablet setup", "verified": true, "helpfulness": "0/0", "author": "Bri"}]