[{"rating": 5.0, "review": "Great little device whether you use Amazon Prime or Netflix.  If you are a Amazon Prime member, then this is a must have.  The interface and remote are much more intuitive than any smart tv and continue to improve with updates.", "verified": true, "helpfulness": "0/0", "author": "Chris Hill"}, {"rating": 5.0, "review": "Great even better than Apple TV more memory .", "verified": true, "helpfulness": "0/0", "author": "Cleveland jones jr"}, {"rating": 1.0, "review": "disappointed that the voice search they promised for Netflix is still not there.  don't buy this expecting that because they have made no more announcements.ADDED Fed 18, 2015:  Removing 2 stars because of added performance issues no one can seem to solve.STILL no voice search for Netflix, which is what we always watch - they announced it was coming last April, almost a year ago.We CONSTANTLY have buffering issues with Netflix and screen freezes with Hulu -  I have called both Amazon and Netflix - tonight I tried Netflix after about the 30th time it stopped to buffer - they did something, about half an hour later we were back to buffering every few minutes.I've tried all the solutions I've found online - clearing cache and data, uninstalling and reinstalling, power cycling, standing on one leg, even cursing.yet Amazon content works perfectly.Accident?  I think not.I'm looking at buying another Roku now, as we never had these problems with the first generation Roku.  I regret giving it away.  Voice search, the 1 feature that drew me to Fire, is useless if it only drives you to spend more money on the same videos you can get on Netflix.  THIS IS NOT A GOOD NETFLIX PLAYER.I wish I could return my Fire TV but am outside the return window.Maybe I'll call Amazon and see what they can do about it - they do have great customer service and seem to bend over backwards to keep customers happy.", "verified": true, "helpfulness": "0/2", "author": "bloomz"}, {"rating": 5.0, "review": "just LOVE-IT.RECENTLY CONNECT WIT ALL THE SHOWS FOR ME , MY FAMILY AND MY KIDS", "verified": true, "helpfulness": "0/1", "author": "PROTRADE007"}, {"rating": 3.0, "review": "Belt clip broke fairly easy", "verified": true, "helpfulness": "0/5", "author": "D. Bauerle"}, {"rating": 4.0, "review": "This is an absolutely fine piece of technology.  However, you are limited on the number of \"free\" movies and TV shows that Amazon Fire TV has to offer.  What surprised me was the number of high  classic moves had a charge to watch.  Had I known this in the  beginning, I probably would have stayed with NETFLIX.  Let me say again, the hardware, especially the voice control is A #1.", "verified": true, "helpfulness": "0/0", "author": "David K. Volitis"}, {"rating": 1.0, "review": "Worst Choice Ever!", "verified": false, "helpfulness": "1/11", "author": "Abbie Broderick"}, {"rating": 4.0, "review": "excellent product.", "verified": true, "helpfulness": "0/0", "author": "Glen Callahan"}, {"rating": 5.0, "review": "OK.  These reviews really mean a lot to me.  I've read all kinds of informative reviews, including the one and two star reviews.  As far as  can tell, all the issues people have brought up have been resolved.Fire TV arrived this morning (two day delivery) (prime member), and it took me all of 10 minutes to set up.  I'm almost 65 years old, and do have a little bit of computer savvy.  But  I have a home theater receiver (or whatever), and, in the past year had to update to one with hdmi cables.  I plugged the Fire into a port on the receiver, changed where the input was coming from, and BAM.  It connected.  Our house is set up on WIFI and I did have to enter the password (OMG).... but then BINGO!  Sound and picture are wonderful.One of the complaints was not having the \"Prime\" TV and Movie selections segregated.  Well, they are now.  I tried out the Iheart radio, and it came in perfectly.  Tried Netflix.  Perfect.  Tried Amazon video.  Perfect.  Am not much of a gamer, so that is unchartered territory.  But so far everything works wonderfully and I am very happy!  Simple and effective.  I think I love it!  It works just as well as my Kindle Fire Pad that I've had for over a year now.Previously I had tried to use other equipment to do what Fire TV does. Xbox, blue ray player, smart tv, etc., but they all have a lot of glitches that are not present with Fire TV.  It just works!!  It is SIMPLE to use!  I'd recommend it to anyone who wants a simple way to watch whatever they want!The only con I've found is in setting up aps with some of the networks.  They ask for an email name and password, and I don't know which one they want.  Since I have Comcast, I assumed it was that one, but I may need to set things up for the aps differently than my mind has determined.  I will need more time to get that part done!Thanks, Amazon, for this wonderful item!", "verified": true, "helpfulness": "3/3", "author": "Mary Anne V."}, {"rating": 5.0, "review": "Perfect little companion for my TV. Could not have wished for a better HTPC replacement. Its very fast and fluid, only complaint would be that voice search does not work with other streaming services.", "verified": true, "helpfulness": "0/0", "author": "Thijs D."}]