[{"rating": 4.0, "review": "Awesome!!! Very VERY FAST!!! So much better than Apple TV. we have 4 Apple TV's and just got our second Amazon Fire TV. The Apple TV's are horrible. We really only use for people that have Apple products that they want to display on TV. Of course any other product would be able to be displayed onto the TV but Apple makes you purchase their $200 poor quality slow product in order to do the same thing my other phones and tablets can do for free and no other products necessary. That said, Amazon put a nice product together and simple as pie to install. Just plug in and go. It also has Netflix. Although, we are finding most things we want to see is only available on Amazon Prime. I think the price should be lowered back to $84. It doesn't seem much of a difference, but once I sold a few friends on it, they chose not to buy because they said the price went up. Also the voice command feature is great and it works. If they can get it to under $80, it would probably see a huge movement. I would be interested in another but waiting for it to drop back down.", "verified": true, "helpfulness": "0/0", "author": "Freedom Writer"}, {"rating": 5.0, "review": "Works perfect.", "verified": true, "helpfulness": "0/0", "author": "RICHARD  KIES"}, {"rating": 5.0, "review": "How much is this a month if I buy it? I just have a regular standard t.v do I need buy some type cord?", "verified": false, "helpfulness": "0/3", "author": "Jennifer"}, {"rating": 4.0, "review": "I rate this highly because it fills a programming niche I was trying to fill - lots of nice stuff my wife likes.  Great for that.  Picture, sound and interface is great.  Setup easy.  What's missing?  Prime access to all major and most minor cable and broadcast current year programming.Doesn't have everything, but does what it has superbly.BUY", "verified": true, "helpfulness": "0/0", "author": "DiggaFromDover \"DiggaFromDover\""}, {"rating": 3.0, "review": "Hulu and Netflix seem to need removed and re-installed at times to continue working (once every ~6-8 weeks).  No reboot option in the menu which is frustrating because at times the box is not working and a reboot will fix (other times it requires removal and re-install of apps, re-entering your account information, etc..).Overall its quick and streams fast when its working, haven't tried the search option lately but it was Amazon focused - I'd like to search other apps as well in a global search as I might have already paid for a service that is providing that title (rather then renting or buying from Amazon).The box is good enough for me to keep around, and things may change with updates in the future, but I don't feel there is anything other than the hardware specifications that is very special about it.", "verified": true, "helpfulness": "0/0", "author": "M. Jones"}, {"rating": 1.0, "review": "Acdently hit a buy button was charged for show I had already seen on TV for free. Did not ask are you sure you want to purchase. I could see my monthly bill if I had kept it. Also not enough free pictures worth watching.i can stream just as much on my Sony Blue Ray player.", "verified": false, "helpfulness": "1/5", "author": "Kenneth N."}, {"rating": 5.0, "review": "This is an amazing thing to have for people like me who love to watch a lot of different shows on a lot of different networks!!!  Hulu and Netflix on my TV is wonderful!!!!!!!  This box is very small, convenient and easy to use, and you can use it in different rooms of the house at your convenience!!!!!  I LOVE IT!!!  Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Lisette S. Marquez \"Lisette\""}, {"rating": 1.0, "review": "Fire TV is great, until I got a warning from Comcast that my data limit had been reached this month. I have a 300GB limit, and generally I barely get past the 200GB mark. When I got the bill, my usage this month was 678GB.I changed my WiFi password and downloaded an app to track my usage. I noticed that I was eating over 1GB per hour for some reason. I started unplugging and disconnecting various devices from my router. Then I remembered that I've only had the Fire TV up and running for about a month, so I did  a quick Google search.Turns out the \"mosaic\" screen saver has a glitch, where rather than showing cached images, it's constantly streaming it, gobbling up data in the process.It's an easy fix (just turn off that screen saver), but I'm giving Amazon one star for knowing about it, and not warning new customers of the glitch, which in my case, means a huge financial hit in the form of my internet bill.UPDATE (February 2015):Even after turning off the mosaic feature, my Fire TV continues to gobble data at a rate that pales my Apple TV. Unplugging the Fire TV for a month confirms that it is the culprit.Until a fix is in sight, I'd suggest sticking with an Apple TV MD199LL/A (Current Version) or a Roku 3 Streaming Media Player.", "verified": true, "helpfulness": "15/19", "author": "Christopher C. Stanley"}, {"rating": 5.0, "review": "Wprks great, reduces buffering time and time to load a video.  Audio search feature is excellent.", "verified": true, "helpfulness": "0/0", "author": "Suzanne Russo"}, {"rating": 5.0, "review": "Very good product. It's the best.", "verified": true, "helpfulness": "0/0", "author": "Don H."}]