[{"rating": 4.0, "review": "I picked this up because I wanted a seamless, Wireless way to connect my tablet to my flat screen. The set up was a breeze, the picture is amazing but the problem I have is that there are too FEW app's for it. Namely, no Amazon or HULU?!?! What's up with that?!?!", "verified": true, "helpfulness": "0/1", "author": "MR. KENT"}, {"rating": 2.0, "review": "This is an insert from the Wall Street Journal weeks ago.The company said late Thursday that emails it sent to customers who placed orders for the device had \"an incorrect estimated order delivery of late October,\" an Amazon spokesman said.Amazon's earlier emails said Chromecast may not be delivered to customers until as late as October 30, much later than the mid-August update in prior messages to customers.The company said it will send around new emails with updated shipping information.\"We are actively fulfilling orders and all customers who placed orders prior to August 7 should receive their orders in the coming weeks,\" said the spokesman, in an email.Many Chromecast buyers were upset to hear of the delay to get the popular device, which helps stream content from mobile phones, tablets and laptops to television sets.I ordered mine on JULY 31st and I never received an updated email, so I called, emailed, and went to the chat room.  They all tell me Amazon isn't responsible for any news releases.  Sounds like to me they made a news release to cover themselves and have no intentions on resolving the order issue. Pure PR Stunt!!!!", "verified": true, "helpfulness": "0/6", "author": "elliotte white"}, {"rating": 5.0, "review": "I've had it about a week now and love using it!  I can start it from one device and pause, play or stop from another.  The controls even conveniently display automatically on my Galaxy S4 lock screen.  I keep it plugged into my A/V receiver instead of the TV.  Looking forward to additional support from other content providers and to more useful information such as news feeds on the home screen as has been speculated about online.I got in just under the wire for the 3 months free Netflix which was a great bonus, but I would have happily paid the full $35 for the simple and convenient wireless functionality it provides.", "verified": true, "helpfulness": "0/2", "author": "E. George"}, {"rating": 5.0, "review": "So simple and easy to use, works great with my Netflix. I have also used it with my google play items as well and it works great. The only issues I have had is keeping up the controls on both my tablet and phone when watching netflix which can make it a challenge to start another episode of a television show or turn it off altogether. Hopefully it will be fixed with a few more updates.", "verified": true, "helpfulness": "0/1", "author": "Rachael E."}, {"rating": 4.0, "review": "I've seen lots of reviews complaining about what the Chromecast doesn't do, these seem to be from people who didn't do much research on it before they got it.  Seemed pretty clear to me that it was simply an easy method for streaming Netflix and YouTube to your TV - and for $35, that ain't bad.  But with that said I am hoping other applications are soon added that will work with it (and it was that in mind that I went ahead and purchased it).  Specifically Picasa.  This seems like a no brainer, especially since Google owns Picasa.  It would be great to be able to do slideshows using your phone or tablet. Any \"mirroring\" of ANY other apps would be great as well.  In the meantime I'm happy to use it to watch Netflix and YouTube.The good:Portability (great for trips)Ease of useThe bad:Get's really hotUnless you have a powered USB connection it's kind of a pain to run a power cord to it (fortunately my home theater receiver made this easy)", "verified": true, "helpfulness": "1/1", "author": "Lord of Suburbia"}, {"rating": 5.0, "review": "It installed in seconds, which it was Ipad ready but I can wait.  Watched HBOgo on my big screen for the first time as well as very easy browsing.  It also stayed on HBO as I was surfing.  Just waiting to buy another for my bedroom tv. j", "verified": false, "helpfulness": "1/2", "author": "Amazon Customer \"Longview reader\""}, {"rating": 1.0, "review": "This may be the most worthless product on the market. You can not send anything from your phone or tablet to the tv. You can play music purchased on the google play store, you can watch google approved YouTube videos only, and you can watch Netflix. Really really bad. You can't even send your pictures to the tv! ?!!!!!????? There are thousands of devices out there that do all of this already... And they all do it better. Don't waste your money. Horrible", "verified": false, "helpfulness": "5/28", "author": "Harry Skigi"}, {"rating": 5.0, "review": "Chromecast is a simple, elegant, and perfectly executed piece of technology. I have been using it everyday since I got it for a variety of things. This includes Netflix, Google Play Music, YouTube, and mirroring my browser to watch unsupported video sites.I am a heavy YouTube user, so being able to watch all my content on the big screen for 35 dollars is good enough for me. And because it pulls directly from YouTube's servers, it has little-to-no buffering or lag. I also am very pleased with the interface to stream fro YouTube. It is pretty useful, though I'd like to see it revamped and more unified across platforms(desktop and mobile).Another good use I have found for the Chromecast is the browser mirroring function. I use this to watch TV shows on unsupported video sites. It works great. Plain and simple. The only problem is that if you have very slow internet or have multiple users using your home network, you may run into buffering issues. That said, I still use it to watch practically everything on my tv now.The Chromecast is essentially an ingenious take on the media streaming device. Coming in at 35 dollars makes this throw away money cheap. Anything under 50 dollars is worth the risk. And Chromecast delivers. As opposed to the Apple TV or Roku Box, Chromecast attempts to leave it's functions as open as possible and the only major gripe I have is that it only streams in 720p, for now", "verified": false, "helpfulness": "5/6", "author": "TyJGarrett"}, {"rating": 3.0, "review": "3 stars because it supports very less apps from smart devices. good product otherwise. Another thing is it is slow even over fast internet.I have Roku player that is way better in terms of number of channels.", "verified": true, "helpfulness": "0/3", "author": "Sam"}, {"rating": 1.0, "review": "Unfortunately they don't tell you ahead of time that your router needs to have UPnP capability.  I have FIOS and the wireless router they provide does not have any options to enable/disable UPnP.  Get error message right from the start that my WiFi is not on.  My WiFi is on 24/7.  Check your router options and settings before purchasing this item.  Also, Google tech support person was one of the rudest people I've ever spoken to over the phone.", "verified": true, "helpfulness": "12/26", "author": "Christopher Schiavone"}]