[{"rating": 5.0, "review": "This thing absolutely works 100% as-advertised, unless you have a slightly older HDTV that doesn't listen to HDMI CEC commands (like I do, in which case you only lose the auto-powerup and input auto-switching features).  Then it works 98% as advertised, but that's not Google's fault.Don't be discouraged by some reviews I have seen that talk about \"Google\" only supporting a small number of apps.  Those reviewers don't understand how this works and why their arguments are irrelevant.  All the power is in the device you use to control the Chromecast, and compatibility is dependent on the app authors (not Google).  Google is providing APIs that should make it pretty easy to add Cast capabilities to apps, to the ball is in the developers' courts to expand the number of compatible apps.", "verified": true, "helpfulness": "2/3", "author": "EvilBob \"EvilBob\""}, {"rating": 4.0, "review": "The potential for this once pandora and chrome (from Android) casting is available is why I bought it.  I don't use netflix and I use youtube sometimes so reall this is fairly limited at the moment.The ability for it to turn on your TV and swap inputs for you is awesome.  Note that turning the TV on is only possible if the USB power is on while the TV is not (usually will mean external power source) and I believe it requires the latest HDMI standard.  The input switching should work for most everyone.I love that it streams from the net itself so your phone isn't rendering or DLing anything.  Saves my battery while I still get to use it as a remote and browse whatever else I want to while the thing I \"cast\" is on the TV.Awesome device, awesome price, awesome potential.  Needs more apps to reach 5 stars.", "verified": true, "helpfulness": "0/1", "author": "Justin R. Mattern"}, {"rating": 5.0, "review": "I can't say enough good things here. GET ONE. After using mine for a day or so I ordered another for the bedroom TV.Right now there are limited apps but there are MANY more in the works by third parties. I predict this will be a VERY popular product.", "verified": true, "helpfulness": "0/1", "author": "David Turner"}, {"rating": 3.0, "review": "setup went ok, it took it a few times for it to log on to my wifi.my real issue has been buffering, often and for long periods of time.  now before you go right to \"oh, your wifi signal is weak\" its not. roku works fine, as does my laptop and mobile devices. there are no actions you can take to pause or refresh the chromecast to help it along, nor see what the signal looks like. at one point, i had to unplug it and plug it back in. it really could use a UI on the mobile device or computer to see whats going on.i got the netflix deal, so for $11 im not going to rage, and i assume the bugs will get worked out as the updates come along.if you have a streaming device thats working for you (roku, console, server, etc.) stick with it for now.", "verified": true, "helpfulness": "1/3", "author": "Drev7"}, {"rating": 5.0, "review": "We now watch more youtube videos on the large screen . Has made search easy from the PC and cast the right video to the TV.This was a pain with the native apps on the TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just use this link and get it for the price that google is setting it at.[...]Just click on best buy.", "verified": false, "helpfulness": "1/1", "author": "Mike"}, {"rating": 5.0, "review": "Google chromecast is amazing. I can't believe how much bang I got for my buck. It's great for parties, especially when you can pick and choose from your phone. Overall, it's a no brainier, buy one!", "verified": false, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 5.0, "review": "I thought I would like this but I ended up loving it! Seriously, this is great and it will only get better over time. I was worried that I would regret buying the first iteration but I most certainly haven't!!!", "verified": true, "helpfulness": "0/0", "author": "Daniel Blackman"}, {"rating": 1.0, "review": "works with YouTube but not Amazon Prime instant vidoesOnce again Google disappoints...Setup worked, it never said it would only work with Chrome..Can send YouTube to TV but when I try Amazon Instant Videos, it just shows a black screen on the TV", "verified": false, "helpfulness": "4/46", "author": "Amazon Customer \"bmcdevitt\""}, {"rating": 4.0, "review": "This product is a geeks dream! I love it, there are so many things you can do with it, and it just launched. I can't wait to see what other developers do with it.The only thing that's a bummer is that Amazon sent an email promising the 3 month free netflix subscription and they haven't delivered on the promise. If you promise something, do it!", "verified": true, "helpfulness": "0/0", "author": "ALDANA MARROQUIN LUIS FERNANDO"}]