[{"rating": 5.0, "review": "I've been using Fire TV for two days and I would say that it is really impressive. Rather than calling it a set-top box, I would regard it as a serious game console. It's not a simple toy like other set-top boxes, but has a high standard of hardware specs that is capable of running many hard-core games. The whole experience is fluent. I have an Apple TV and an Xbox 360, but Fire TV quickly became the most useful one.", "verified": true, "helpfulness": "103/109", "author": "MGhostSoft \"MGhostSoft\""}, {"rating": 4.0, "review": "This product has excellent hardware with the quad-core processor and 4 gigabytes of ram.  Firstly, I would like to say, I already own roku 2, google chromecast, and a panasonic blu-ray player with internet enabled apps and wifi.  This product compared the aforementioned devices is more responsive and quicker.  As other reviewers have noted it is particularly fast with amazon content.  Overall the device has great promise as it is a fresh release, with that being said, the amazon fire tv leaves some areas for future improvement.Pros:Great HardwareSnappy responseSmooth InterfacePossibility for light gamersVoice Recognition (if enabled for other content in the future)Cons:Voice Recognition only works with amazon contentNo VUDU or for some No HBO-GOInterface focuses almost solely on Amazon content (this makes sense)Overall, I feel this device with some future updates could be a 5-star device.  It has the potential to be a 5-star device with some polishing to software and overall \"openness\" of the device.", "verified": true, "helpfulness": "2/2", "author": "Time2wind"}, {"rating": 5.0, "review": "I purchased this item out of curiosity. The more I use it, the easier it gets. It installed effortlessly. Previously, I had used a 25-foot long hdmi-mini-hdmi cable from my Amazon Fire HD to my TV. Now, I can overcome my fear of tripping over the wire, as I move about my living room. Well done, Amazon.Now, I hope to receive my email over this Amazon Fire TV. Since this is device is new to me, I look forward to exploring all its offerings.", "verified": true, "helpfulness": "1/1", "author": "Joseph T Fegan \"jfegan\""}, {"rating": 1.0, "review": "I guess this will be great one day but it wasn't ready to be released. No, HBO, No Vudu and so many other things. For an open platform you can't beat ROKU. Not ready for primetime, that's all I can say.", "verified": true, "helpfulness": "8/32", "author": "Carl L"}, {"rating": 5.0, "review": "**UPDATE FROM 2 STARS to 5 STARS**I tried to return and then return and replace the Fire TV because of the items listed below.  The return/replace web page on the Amazon site would not allow me to return and replace stating that it was NOT an Amazon product and was sold by independent seller.  WHAT???  So I called Amazon and talked to Chris who was a great customer service person and he helped me so that I did not have to return my Fire TV.  He had me to clear the cache on the Fire TV and also suggested that I reboot my modem and wifi at least every two weeks.  I am so glad to say that this fixed my problems with my Fire TV and I am completely satisfied with it.  Many reviews say that they cannot find the Prime free movies or shows, but it is very simple and the first list on the Fire TV is Prime movies and TV.  Also if you look at the upper left corner of the \"photo\" of the movie it is clearly states Prime.  If it does not have Prime then you have to pay. I hope others have had a great customer service experience as I did and got their problems with the Fire TV worked out.***********The Good:I ordered the Fire TV on Thursday and it was delivered by FedEx to me on Saturday with Prime. Thanks Amazon for the fast delivery. The packaging was so good almost to the point of being annoying. Every part is nicely wrapped, so take your time. The set up was super fast. Actually it took me longer to unpack it than to set it up. It starts up quicker than either of my Apple TVs. I am really an Apple product user with two Apple TVs, iPad, iPhone, Mac Book Pro, so adding the Fire TV was more for my Prime membership than anything else. I have to say that the Fire TV interface is so much better than the Apple TV and so is the remote. Maybe is seems better because it is new and fresh to me.  I just love it, but....The Bad:The Fire TV buffers every five minutes! Very annoying since I have a super fast WIFI and Comcast speed always greater than 20 Mbps. It keeps displaying the message \"Your video will continue to frequently pause until a faster Internet connection speed (800 Kbps or higher) is available. You might want to try again later when you have a faster Internet connection.\" I have checked my Internet speed while the Fire TV is buffering and displaying the message and my speed is always above 20 Mbps. I have had both of my Apple TVs, iPad, and Mac all downloading at the same time and I have NEVER had a buffering or freeze problem. I have read that other Amazon Verified Fire TV owners are having the same problem. This buffering happens while watching either a Prime or Netflix movie or TV show.Solution:The only way that I can watch the Fire TV is to completely Power Off my iPhone, iPad, Mac or PC and anything using my network. It will still buffer, but only about every thirty to forty minutes. As much as I hate to say this, but I will be returning the Fire TV and hoping that Amazon will eventually fix this problem. Right now it is to annoying, aggravating and takes way too long to watch. If in the future the problems are worked out then I will reorder.NOTE:I am not saying that any product or device that Amazon produces is good or bad.  I am not saying that any other company is producing a better or inferior product.  ALL companies have their good and bad qualities.  THIS REVIEW IS ONLY ABOUT THE PROBLEM THAT I AM HAVING WITH MY FIRE TV.  If you own the Fire and not having any problems then I am glad for you and I hope that anyone who owns or is about to own the Fire TV has no problems and enjoys their device.", "verified": true, "helpfulness": "9/10", "author": "Gmduh"}, {"rating": 1.0, "review": "Fire TV does not work with my DSL wireless internet.  My Roku and Sony DVD player are able to play streaming content without issues, so the problem is definitely with the Fire TV. I am sending it back now.  I was able to establish wireless connection, and update the software on the second attempt.  After unplugging the device for several minutes, it finally worked.  It works ok when nobody else is online; however, with teenagers in the house, that is a rare opportunity.  As soon as someone else gets online, the Fire TV will only play for a couple of minutes before it has to stop and re-buffer.  It simply requires too much bandwidth for my 3 MB/S DSL connection.  My Sony DVD player will adjust the video quality, based on internet speed; but not the case with Fire TV (and it will not go lower than 720p).  Also, I was very disappointed with the voice search feature; as it only searches Amazon content.  The Roku searches everything, so I expected the same or better capability.  I am very disappointed with Fire TV.", "verified": true, "helpfulness": "13/37", "author": "Michael"}, {"rating": 5.0, "review": "What a perfect little device this is. We can't afford a monthly tv service but we do have amazon prime that seven been using on our tablets. This allows us to watch virtually anything we want right on our tv! I set it up (which was a super easy, one step process), let it so a software update and went right to our watch list and immediately started watching a movie. No hiccups or glitches whatsoever. Amazon has yet another 5 star product!", "verified": true, "helpfulness": "2/3", "author": "tommyboy"}, {"rating": 4.0, "review": "I don't own one now but I would consider it if they would have more gigs of storage. I also wish these companies would put commercial skip on smart boxes more than 30 seconds? Do this box have it?", "verified": false, "helpfulness": "0/16", "author": "nythawk"}, {"rating": 5.0, "review": "We want something to substitute for a smart TV that is not quite as fast as the new units.  The Fire TV product works well and is fast.", "verified": true, "helpfulness": "2/2", "author": "John Mehok"}, {"rating": 5.0, "review": "I was getting very frustrated with my current streaming devices and Netflix.  I was especially frustrated with dolby digital support on the devices (see more below).  I currently have a Roku 3, Roku HD, and Apple TV.  I actually like my Roku devices a lot, especially the Roku 3.  It's fast and I really like the ability to plug in headphones into the remote.  Also, the amount of apps are great.The Apple TV is also a good device but I hate the closed environment, and the remote is always lost (too small).  The Apple TV only used for Airtime now for streaming music and occasional movies from iTunes.My biggest issue with the Roku was how audio was streamed from some services, Netflix included.  Netflix streams surround sound in dolby digital plus and doesn't have an option to downgrade this to dolby digital standard.  My issue is that my receiver doesn't support dolby digital plus so I was stuck listening to movies in stereo and then having my receiver try to simulate surround sound.  It SUCKED!  I was about ready to buy another receiver ($400+) but then I saw this product and I thought I would give it a chance.  In the audio section of settings on the fire TV, there are options for surround sound settings.  One option is to stream standard dolby digital through optical instead of streaming dolby digital plus through HDMI.  While I would have preferred standard dolby digital through HDMI, this solution worked for what I need.  I can now stream surround sound using my 7 year old receiver.The rest of the product is nice as well.  The remote is great.  The limited gaming we have done with the family has been fun.  Streaming is fast and loading Apps is fast.  I'm very confident that many more Apps are in the works.  I wish HBO Go was supported.  I also wish Showtime anytime was supported with Dish customers but that has nothing to do with Fire TV.I would buy this over the Roku 3 unless you want to watch this in the bedroom.  The ability to listen to headphones through the remote is something I wish this had.  However, I am VERY happy with this purchase.  Great product Amazon.", "verified": true, "helpfulness": "8/8", "author": "johnnyprime"}]