[{"rating": 5.0, "review": "I decided to buy this because I can no longer watch youtube on my bluray player. I should have bought it a long time ago because it is WAY faster and more reliable than the bluray. Very large selection of apps available. As other reviewers have said, it would be nice to have the ability to use the voice search within apps like netflix, or to be able to voice search only within Prime movies rather than all Amazon movies.", "verified": true, "helpfulness": "0/0", "author": "M. Hays"}, {"rating": 5.0, "review": "Order came in as expected. Everything was packaged as it should be. I was able to download Netflix, Hulu Plus and Sling TV. All run with no issues. When I had a problem with streaming video a couple of month later the customer sever line was quick and they were very helpful. And all that was wrong was a lose wire. It worked just like new. I love Amazon.", "verified": true, "helpfulness": "0/0", "author": "Angelique Cordeau"}, {"rating": 5.0, "review": "Its an Amazing Device!! Love it!!", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 5.0, "review": "great stable android box. I use it exclusively for KODi to get free tv and movies. Net flix works great so does hbo go. I wish it was more 3rd party app friendly as i can not create a short cut for kodi officially and the trick way is not good to do for the app.", "verified": true, "helpfulness": "0/0", "author": "G. M. Hernandez \"cdspinna\""}, {"rating": 5.0, "review": "Top quality at a reasonable price, what more can you say?", "verified": true, "helpfulness": "0/0", "author": "teletub \"William E. Schueler\""}, {"rating": 5.0, "review": "Easy set up and lots of options for hours of viewing pleasure!  Would love for an ABC app to be added in the future.", "verified": true, "helpfulness": "0/0", "author": "Teri S. Pigg"}, {"rating": 5.0, "review": "I love my Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Vanita Hill"}, {"rating": 5.0, "review": "It's awesome! I recommend it to everyone", "verified": true, "helpfulness": "0/0", "author": "jimmy wayne medley"}, {"rating": 5.0, "review": "Voice recognition feature is awesome. Love the selection on Amazon prime. Our new favorite show is \"complicated\".", "verified": true, "helpfulness": "0/0", "author": "Alan S Trench"}, {"rating": 4.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Robert W. Roy"}]