[{"rating": 5.0, "review": "really good", "verified": true, "helpfulness": "0/0", "author": "Ankan Dutta"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Armando Rave"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Hany Morkos \"Dr. Morkos\""}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "PS"}, {"rating": 5.0, "review": "Bought two of these - one for the living room, one for the master bedroom.  Extremely happy.  They came with the USB plug to power the device either through a TV's powered USB port, and also came with the adapter to power the device through an AC outlet.Extremely easy to set up, love that I can cast / stream anything on the screen of my phone, Netflix, Pandora etc etc etc.  Lots of compatible apps and the picture quality when cast to either of my Sharp Aquos 40\" LCD bedroom or 60\" LCD living room TVSs is amazing 1080 HD.  I love how easy these things are and the range of features!  Definitely recommend to anyone who is looking for a way to stream movies, music, etc to their TVs.In the living room, I plugged the Chromecast into an unused HDMI input on the back of my Yamaha 7.2 ch receiver, and have thus far found that the Dolby Digital and DTS surround encoding (typically 5.1) in streaming movies is perfectly reproduced as it would be with a Blu-Ray or anything else with a multi-channel digital soundtrack.The only thing I wish the Chromecast had that it does not, which I didn't think about until I installed it in the living room system, is an analog audio output, perhaps via headphone jack.  This is only because I have a dual zone Receiver where zone 2 powers a pair of outdoor speakers.  I typically play music outdoors, but since my receiver is not capable of playing audio input through the HDMI inputs in zone 2, I cannot use this device to stream pandora, etc, outside.  I'm not taking any stars off for this, just would be a nice bonus feature...", "verified": true, "helpfulness": "0/0", "author": "hfa8592"}, {"rating": 5.0, "review": "I have no need for cable anymore!!! by far the best thing that has ever happened to me with Netflix and Hulu on my phone I stream my shows to the TV and I am saving SO MUCH MONEY without  cable!", "verified": true, "helpfulness": "0/0", "author": "rebecca"}, {"rating": 5.0, "review": "Use this to cast sports from online, netflix and music for when we have people over. Casting from chrome works great, usually little to no distortion and just a small delay even with the crappy generic WiFi router I have from the cable company. Casting apps video from your phone using netflix,etc is super easy and looks great as well. I also use it to stream music even though I can connect to my speakers via bluetooth. Because its Wifi I can go anywhere in the house with my phone and not lose signal unlike bluetooth which needed to be within 10ish feet and little to no obstacles. This also saves battery as I don't need bluetooth on and I am already connected to my home WiFi regardless. Still finding new and cool ways to use it.", "verified": true, "helpfulness": "0/0", "author": "K. Weingartner"}, {"rating": 5.0, "review": "I own two of these, one for each TV in our home. They are super convenient. The only issue is there is no Google Cast app for Kindle. That is annoying, Amazon.We primarily use our phones to run this, however. And now we have a Chromebook, which is perfect for this, because you can stream anything on the web to your TV with the Google Cast app for Chrome.", "verified": true, "helpfulness": "0/0", "author": "Anthony G. Pero"}, {"rating": 5.0, "review": "great product, i've made smart my stupid LCD :)", "verified": false, "helpfulness": "0/0", "author": "Maximiliano o."}, {"rating": 4.0, "review": "Great item", "verified": false, "helpfulness": "0/0", "author": "Rob"}]