[{"rating": 4.0, "review": "I love chromecast. The only issue that I regret is that the dongle does not handle live events on YouTube.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works pretty well...I have had some connectivity interruptions.  I would recommend it to anyone with a \"dumb\" TV.....BOOO YAAAAAHHH! Whammy!", "verified": true, "helpfulness": "0/0", "author": "Nicholas Hess"}, {"rating": 5.0, "review": "Works flawlessly! The convenience of running this thing through your computer, tablet or phone can't be beat. A steal @ $35!", "verified": true, "helpfulness": "0/0", "author": "Bernard Samuels"}, {"rating": 4.0, "review": "Very good we look forward to more content, easy to set up we used it in our bedroom. Great price", "verified": true, "helpfulness": "0/0", "author": "Earl D. Farrow"}, {"rating": 3.0, "review": "Works well but ONLY streams (to Samsung HDTV) what is seen \"live\" by (MacBook Pro) laptop in a Google Chrome browser window.  E.g., if laptop is tuned to show a YouTube using Chrome, that's what TV shows.  So far I have found no way to show anything brought up in another bowser, nor without browser at all (such as a DVD playing in the DVD slot).  If you're subscribed to a service playable in Chrome, then that will appear on your HDTV. In essence, the device mirrors merely what Chrome shows, period.The setup is much more complicated than the ads and box suggest: A download is needed, and other steps are involved which are tactically not mentioned until they are required.  But it all worked, as far as setup goes.", "verified": true, "helpfulness": "0/0", "author": "L. Jagerman"}, {"rating": 5.0, "review": "I own this, two Roku boxes and a WDTV Live.This is a great concept, but, as of right now, it doesn't do much. It's about a third the price of a Roku, but it does probably less than a third of what a Roku does. Only really supports Netflix and YouTube. Yes, you can send anything that Chrome plays to your TV, but the quality of that image is nothing you want to watch for any kind of extended period.When it supports more stuff (hulu plus, HBO GO), it will be a better option, but for now, get a Roku and resist the price tag. You get what you pay for.Update (1/2/14) - Okay, so now the thing is great. Casting a tab running a video still isn't great, but now that Hulu and HBO Go work with it, it's pretty cool. I honestly feel like Google set the price too low when you compare it to Apple TV or a Roku box, but I am okay with paying less.", "verified": true, "helpfulness": "0/0", "author": "D. Dahlbeck \"Tappah\""}, {"rating": 3.0, "review": "Good product but not enough apps to go on , also only works off apps thought you would be able to show your videos and pics from my iPhone", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"volps\""}, {"rating": 5.0, "review": "I am amazed by this product. Google does a good job innovating new tech products recently. I just update Hulu plus cuz its now supporting streaming via chromecast as well.", "verified": true, "helpfulness": "0/0", "author": "feilun chen"}, {"rating": 5.0, "review": "It is working good to help stream Netflix. Amazon has become my go to place for my craft and household needs.", "verified": true, "helpfulness": "0/0", "author": "Kathy Echevarria"}, {"rating": 5.0, "review": "Extremely easy to set up and to operate. Small enough to take when I travel and is very well made.", "verified": true, "helpfulness": "0/0", "author": "Robert T. Mccarthy"}]