[{"rating": 5.0, "review": "Watch Youtube and Netflix and nearly anything you can stream to Chrome browser.  Initially I had a lot of trouble with the controls (stop/play/pause/etc.) on my phone maintaining the connection.  I've have to futz with Netflix, and/or the Chromecast app to get controls, and real quick hit the button before I lost connectivity.  On the last update of Chromecast and Netflix seems like these issues are behind us - last couple times I used it the control stayed active the whole time - 2 movies.", "verified": true, "helpfulness": "1/1", "author": "Bob Cox"}, {"rating": 5.0, "review": "Everything came perfectly, the product is awesome.", "verified": true, "helpfulness": "0/0", "author": "Lucía R."}, {"rating": 5.0, "review": "Works great just like advertised...", "verified": true, "helpfulness": "0/0", "author": "LILMAC5150"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "gerardo"}, {"rating": 5.0, "review": "Have used it for a week now. I like it so far. Now all the app designers have to perfect the ones that work with Chromecast and Design some new apps. Like one that could be used as a remote.", "verified": true, "helpfulness": "0/0", "author": "lovell1208"}, {"rating": 2.0, "review": "I have a LG Smart TV and Google Chromecast is absolutely useless! It doesn't stream anything other than YouTube but I have YouTube already built into my smart TV!", "verified": true, "helpfulness": "0/1", "author": "reviewer"}, {"rating": 5.0, "review": "love it! so easy to use and so worth the price!!", "verified": true, "helpfulness": "0/0", "author": "kymanikaya"}, {"rating": 3.0, "review": "I like my Chromecast but it is pretty limited in playback abilities. Programs that are meant to work with the Chromcast such as Youtube and Netflix work really well. Sometimes the chromecast will freeze when casting from other video websites and sometimes the sound does not work. Overall I'm happy with what I got for the price of the Chromecast and just had higher expectations for a Google product. It works most of the time and does an overall good job in casting from my tablet and computer to my TV. I would recommend this streaming player over others out there on the market.", "verified": true, "helpfulness": "0/1", "author": "Stephen"}, {"rating": 5.0, "review": "Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Ketch"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Pingocho"}]