[{"rating": 3.0, "review": "Works pretty good I now have tow of them but the second one that I got l loss audio periodically have to restart it all the time  ( not to happy )", "verified": true, "helpfulness": "0/0", "author": "Luis J Correia"}, {"rating": 5.0, "review": "I have been really impressed with my chromecast. One thing to realize is that it requires additional power (not just the HDMI port) which is not shown in the pictures. If your TV has a USB port you can power it from there, otherwise it comes with a converter for a wall outlet, but it is not quite as cordless as the pictures make it seem! I highly recommend it though, I use it with my phone and my computer with no problems.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "Works great. It's supposed to be okay to leave it plugged in - but I personally don't like how it warms. It doesn't get dangerous hot or too warm for electronics, but warm enough that I don't think it will last forever if it stays in 24/7. I know it defeats a purpose or two, but I'd rather just plug the USB in when I want to cast. I love not having to run a long expensive HDMI cable from my laptop, or mini hdmi cables from my phone. My wife's tablet couldn't connect without it!!  Also, I love how I can work on my laptop while casting. for instance, I'm writing this review right now while casting Rio2 from this laptop through HBOgo. I love how it doesn't just copy paste the screen but gets rid of borders and is recognized by most apps from the laptop end and the tv end!! So you can't tell you are casting on either device. The movie doesn't play on the laptop when casting, just shows title screen, and pause etc. functions - therefore doesn't effect the tv when my screen times out or goes onscreen saver!! Love this device. Very smart tech. In fact I'll add a photo of RIO while I'm writing this review!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works well.  Software works better than my glitchy Philips TV Hulu software.It's good, but I've since upgraded to Roku 3 - which has totally replaced my Chrome - I find it better for permanence of install.Regardless, Chromecast good to have in your travel bag, so you can pop it into a hotel or friend's TV and stream your Netflix/Hulu/Crackle...assuming that hotel & friend have a wifi access point you can also access.  That's the downside of this thing.  It requires your phone PLUS an internet connection.  I have unlimited data on my phone but Chromecast doesn't care, it has to have a foot in both pools.If I remember correctly, it does not do Amazon TV...maybe that's because I don't have an Amazon phone...The BIG UPSIDE is that this is THE MOST CONSISTENT tool (other than Roku).  I've tried Netgear's Miracast device - it's cool because it does NOT require a separate internet connection from your phone.  However it can sometimes be flaky and drop the signal.  Chromecast maintains the connection - Kudos to that.", "verified": true, "helpfulness": "0/0", "author": "N. Byrnes \"Nate\""}, {"rating": 5.0, "review": "I use it alot", "verified": true, "helpfulness": "0/0", "author": "Gary Fish"}, {"rating": 3.0, "review": "Not nearly as clear cut of a stream as I thought it would be.  It's ok for everything except for streaming Video.  It starts to lag right off the bat and doesn't stop.  Great novelty item though!", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "My second Chromecast!!!Flawless!", "verified": true, "helpfulness": "0/0", "author": "William Cook"}, {"rating": 5.0, "review": "I am not great at installing any electronics or understanding how to use new devices but this product was extremely easy to use and instal", "verified": true, "helpfulness": "0/0", "author": "Ae86silverred"}, {"rating": 2.0, "review": "I decided to purchase a Chromecast because the price was right and I thought it functioned the same as a Roku. It does not. Not even close. You definitely need an Android powered phone, tablet or laptop, and the Chromecast app to operated Chromecast. On the up side, you can stream YouTube, Hulu and other Chromecast partnered apps and websites on your TV.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "I love chrome cast", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]