[{"rating": 5.0, "review": "This is a great way to bring the family together, now you are no isolated in your tablet or phone watching that youtube video, share it with the family on the big screen. Quite easy to set up and seamless afterwards.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"As Eiras\""}, {"rating": 4.0, "review": "Took a few days to figure it all out.  Working well now when streaming Netflix, except for an occasional pause while watching a movie.  Better than streaming through our blue ray DVD which pauses far more often.  Not sure why, could be our DSL network which is all that is available to us here.", "verified": true, "helpfulness": "0/0", "author": "Russ Rienecker"}, {"rating": 5.0, "review": "Watch Youtube a lot, it's nice to have this small device to broadcast videos on TV.1. Easy to use and setup.2. HD video quality on TV.3. Price is reasonable.Love it and recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "Henry Zhang \"Henry Z.\""}, {"rating": 5.0, "review": "Works just fine for me and my FamilyCan watch all the media content from the Internet, Netflix  & more", "verified": true, "helpfulness": "0/0", "author": "Erick Ruiz"}, {"rating": 5.0, "review": "This little device is exactly what I was looking for.  You have to use some external device (laptop, smartphone, tablet) to make it work which makes it even nicer to use. We have our main big screen hooked to Netflix using a wii with poor navigation .  All the other TVs in the house use this Google Chomecast device.  It works good.  Only downside...you have to have your external device to use it.  For example, if you are using your phone to run the downstairs big screen and you left your phone upstairs, you have to go get your phone before you can watch.", "verified": true, "helpfulness": "0/0", "author": "Keith Tede"}, {"rating": 5.0, "review": "I was keeping a Wii plugged in just to watch netflix - this eliminated the device and associated clutter.  Works as advertised!", "verified": true, "helpfulness": "0/0", "author": "dusty"}, {"rating": 5.0, "review": "Very cool, and getting cooler with every new interface that's released.  You can access the Chromecast from most devices, without any significant hassle, and, once it's playing your media, it is no longer using resources on your device, so it doesn't slow down anything else you're doing.  It's just providing a remote control for all your cloud-based media from any compatible device.  Just what you always wanted, without the complexity of a PC, or some weird universal remote, or even clunky Linux-based interfaces.  Slick, fast, and simple.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"kevindsingleton\""}, {"rating": 4.0, "review": "I purchased this just before Christmas for $29. Having a 5 year old 42\" flat screen, this dongle, along with a Roku and LG BluRay makes our TV somewhat smart. Seems TV technology changes by the hour and our TV was outdated within weeks of acquisition.For viewing Youtube videos, it's simply superior. It eliminates huddling around a computer or tablet. We homeschool and use Khan Academy extensively and for that, it's exceptional. Occasionally but not often, there is a slight lag and the audio will be out of sync just enough to be noticeable.Netflix works very well.  I sure wish Google and Amazon could figure things out. It would be a wonderful and what seems obvious, way to view Amazon Prime videos, as the platforms to view prime are limited.Since it casts Chrome, webpages are easily viewed. This simplifies some of our homeschooling tasks and eliminates the need to plug a computer into the TV via HDMI cable. That alone makes this little device worthwhile to me.Overall, I think this is a solid addition to our home A/V setup. Entry is low, even at $35 and is a good value. And I'm confident that more and improved content will arrive in the coming months. If you homeschool, it's a must-have, will save time and change the way you present content to your students. There's not much more to add to the other reviews here, which are thoughtful and extensive. It's a low-cost, high-value addition to your video capabilities. With that, I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Greg de Mocskonyi"}, {"rating": 5.0, "review": "Simple operation. Took a little effort to get installed, but no problems since. Would recommend if you have a good wifi signal and non smart TV", "verified": true, "helpfulness": "0/0", "author": "Keith Portillo"}, {"rating": 1.0, "review": "Very limited capability. Only good for YouTube and nextflix. Will not mirror tablet chrome browser.  As of right now, better to get roku player.", "verified": true, "helpfulness": "0/0", "author": "Bodie"}]