[{"rating": 1.0, "review": "I am still trying to use it.", "verified": false, "helpfulness": "0/1", "author": "b lain"}, {"rating": 5.0, "review": "I want one for every TV!", "verified": true, "helpfulness": "0/0", "author": "rod"}, {"rating": 5.0, "review": "amazing", "verified": true, "helpfulness": "0/0", "author": "JanelleB"}, {"rating": 4.0, "review": "The device is great and easy to setup and pair to my device.", "verified": true, "helpfulness": "1/1", "author": "sherwin b varona"}, {"rating": 1.0, "review": "Stopped working after 1 week.", "verified": true, "helpfulness": "0/1", "author": "A. I \"Trip\""}, {"rating": 3.0, "review": "First off this is a fantastic product. The quality that it streams to your TV is flawless, if you use a built in chomecast feature.Unfortunately, the chromecast has no browser capability, hence you cannot use it when you travel unless you have a mobile hotspot or some other way to connect to the internet. I purchased this product so I could stream to my TV while traveling. This fact alone was very disappointing. If google ever offers some sort of update so that you can jump on a browser to log into hotel internet, this would make the chrome cast much better.", "verified": true, "helpfulness": "0/0", "author": "John F. Watson"}, {"rating": 3.0, "review": "They make it sound like it will stream everything on your mobile devices. It in fact does not. It only streams apps and websites that support chrormecast. I really wanted to watch Direct TV Mobile and NBC Sports Live Extra and neither are supported. It did play Hulu + fine from my iPhone 5. But I already have ROKU and bought this for the streaming. Needless to say its going back.", "verified": false, "helpfulness": "0/0", "author": "G Cope"}, {"rating": 1.0, "review": "If it sounds too good to be true, it usually is. On paper, this is a great product.  But, we live on planet earth and this device is a few years away from what the marketing team slapped on the cover of the package.  This device is unable to maintain a solid connection to WiFi. Watching TV is all about turning off your brain and enjoying a few hours of relaxation.  This device will take all the fun out of watching your favorite shows and leave you frustrated and even angry at times. Do yourself a favor and spend $65 extra dollars for Apple TV, I did... I wish I'd done it sooner.-I would give it 3 stars on a good day.  It did work well at times, the other 90% of the time, it was 1 star material.", "verified": false, "helpfulness": "3/5", "author": "Miguel"}, {"rating": 5.0, "review": "I love it. Mirroring works great as well as streaming netflix and youtube.", "verified": true, "helpfulness": "0/0", "author": "Ali Kasmani"}, {"rating": 5.0, "review": "Okay, this is slick. Maybe not so much for the Android-sphere yet, but that will come. This little guy is, after all, the 800 pound gorilla in the room. Now if AMAZON PRIME INSTANT VIDEO WILL GET ONBOARD WITH AN ANDROID APP... hint, hint. Come on guys, you know it's futile to resist and in the long run you stand to make a ton of money. TON OF MONEY. You know I'm right about this. I can cast from my PC (BTW, thank you, Amazon), but I'd really like to do it from my cell phone and tablet. Convenience is everything. And I know the folks at Amazon will agree with that!", "verified": true, "helpfulness": "1/1", "author": "Arthur C. Cox"}]