[{"rating": 1.0, "review": "Worthless.  All my TV's can already get YouTube and I don't watch Netflix.  Until they make this \"play anything from the web\" as advertised it sits in a box.", "verified": true, "helpfulness": "0/3", "author": "Mike Bradfield"}, {"rating": 2.0, "review": "The main reason I bought this was view You Tube.  Also, if we traveled I thought this would be good to have when I wanted to watch Netflix or Amazon. Pictures appear only in black and white on 5 year old Vizio.", "verified": true, "helpfulness": "0/0", "author": "Marky Mark Twain"}, {"rating": 5.0, "review": "I had it working in about 5 minutes. Read the directions before you plug it in. I bought a few for Christmas gifts!", "verified": true, "helpfulness": "0/0", "author": "Benjamin Wilson"}, {"rating": 5.0, "review": "As advertised, this little baby made my not-so-smart TV in to a smart one!  I can now watch my Netflix!", "verified": true, "helpfulness": "0/0", "author": "Thomas Zucker-scharff \"tzs20\""}, {"rating": 4.0, "review": "Streaming from apps on Android or YouTube on a computer works great. Streaming a Chrome browser does not work as well as advertised. At current, it is an extremely low refresh rate- no good for video. Hopefully they fix this in an update. Also it would be nice to see support for Chrome on Android, once they get the Chrome on PC working.", "verified": true, "helpfulness": "0/0", "author": "Myr Herder \"MyrHerder\""}, {"rating": 2.0, "review": "Totally useless if you have a Xbox 360. it does the same thing much slower than the Xbox with less features.", "verified": true, "helpfulness": "0/0", "author": "Philippe Martin \"Philos\""}, {"rating": 5.0, "review": "I had been planning to replace my older Blu-Ray player with one that supported Netflix, but this is way better.  It was very easy to configure via the web and has not missed a beat.  For the price, you can't beat it, and your friends will think you are awesome when you start a movie on your phone or tablet and then cast it to your TV.", "verified": true, "helpfulness": "0/0", "author": "Dillon R."}, {"rating": 2.0, "review": "it is essentially a tool to stream you tube on to the TV.  It does much, much less than a Roku.", "verified": true, "helpfulness": "1/1", "author": "F. P. Hickey \"Fran\""}, {"rating": 2.0, "review": "Product is great, but stopped working after a week of light use. It seems to be a known issue with the hardware and it's possible to exchange it for a new one but I'd expect a better quality out of a hardware like this, it was a very frustrating experience.", "verified": true, "helpfulness": "0/0", "author": "Joaquim N."}, {"rating": 4.0, "review": "An interesting little device! Did a couple of things I didn't expect it \"could\" do (i.e., casting a Youtube video from a device, then being able to search for another Youtube video while the first one is still playing on the TV).Was very easy to set up in Windows 7, and XP (even though there was a warning that XP might not work). It was a bit more tricky to get my Samsung Galaxy Note II to work, but eventual I got it working. I haven't tired it on my Windows 8 of iPAD yet.The device is small and is made well (feels like quality construction).", "verified": true, "helpfulness": "0/0", "author": "John Champagne"}]