[{"rating": 5.0, "review": "I love Amazon Fire. It's so easy to use and so many movies and TV shows to choose from.", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 5.0, "review": "Setup is a snap - and i was streaming movies in 5 minutes.  Excellent instruction video walks you through the quick setup function. Prior to ordering this device, I tried setting up the RoKu TV and it was a disaster - Spent 3.5 hours with 2 Roku techs and they finally blamed the problem on my Comcast router.  Ironic that the Amazon Fire TV had no problems with the same Comcast router - Glad i sent the Roku back and got the Amazon Fire TV", "verified": true, "helpfulness": "0/0", "author": "WM. KALISZ"}, {"rating": 5.0, "review": "Nice option for smart tv.", "verified": true, "helpfulness": "0/0", "author": "Adam J Lawrence"}, {"rating": 2.0, "review": "I guess it takes time to get use to it. I prefer Apple tv though.", "verified": true, "helpfulness": "0/3", "author": "jose burgos"}, {"rating": 3.0, "review": "It does what they all do I could of just used my ps4  ......my low rating is for the voice is cool but does not work with alot of the apps ......like youtube......and the major flaw Is the usb port . It's useless for any type of movies or music you wanna play from an external hard drive or flash drive . I should of just went with the stick and saved 65$", "verified": true, "helpfulness": "0/0", "author": "jason"}, {"rating": 5.0, "review": "Love this Christmas gift.", "verified": true, "helpfulness": "0/0", "author": "Paul D Neuss"}, {"rating": 5.0, "review": "Makes watching so much easier than going through a game system... Watch it so much more now... Love it!!", "verified": true, "helpfulness": "0/0", "author": "Katheran Olsen"}, {"rating": 5.0, "review": "Amazing! I have had the latest version of Apple TV for over a year and while I really like it, the Fire TV is much faster and has more features and apps than the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Terry  Delaney"}, {"rating": 4.0, "review": "Annoying emails.", "verified": true, "helpfulness": "0/1", "author": "Margaret A. Savage"}, {"rating": 4.0, "review": "good product, the back order on it was a pain to wait for, and the \"cannot\" bypass intro video was annoying.. but it plays well, no lag (100mb/50mb), easy to navigate, super intuitive contronls, remote looks basic, but it does everything a cable remote does with 10% of the buttons.", "verified": true, "helpfulness": "0/1", "author": "will ryan"}]