[{"rating": 5.0, "review": "Works fine - should have gotten the voice activated one.", "verified": true, "helpfulness": "0/0", "author": "John C. Stocks \"John Stocks\""}, {"rating": 4.0, "review": "Pretty good. Mic searching works great. Never fails. bluetooth control is great since you don't have to be in sight of the box to control it. Super fast interface, a breeze to go through the menus. That's one of the reasons I bought it. My review is missing one star due to despite having Prime, it seems like I have to pay for everything I look for. Seemingly small selection of free movies included in Amazon Prime.", "verified": true, "helpfulness": "1/1", "author": "10in30 Muscle! \"Lose 10 lb in 30 days! 10in30 dot com\""}, {"rating": 1.0, "review": "You still have to pay for everything within a \"free\" app. It's not really a great deal unless you absolutely don't need cable TV. The only thing I liked was the app called Pluto and listening to the music channels that have the music videos as well. The streaming was a little questionable too. For me, this was not worth it.", "verified": true, "helpfulness": "2/3", "author": "Mckayla"}, {"rating": 4.0, "review": "It was a little challenging to set up, but it works fine. The batteries that came with it only lasted a few weeks.", "verified": true, "helpfulness": "0/0", "author": "Jean Boston \"Jean\""}, {"rating": 5.0, "review": "Only problem is I have comcast and they don't support HBO go on it.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "I bought this when we decided to drop the cable TV.  It works great and I really enjoy having it around.  The selection of free content is decent and buying the few shows we watch is cheaper then paying the monthly cable fee we had (obviously this might not apply to everyone since programming and amount of TV people watch differs greatly from person to person).  All in all, we are happy with it.", "verified": true, "helpfulness": "0/0", "author": "Brian Kennedy"}, {"rating": 5.0, "review": "We cut cable about 6 months ago. We have been using Hulu, and Netlix on our Blu-Ray player, the wireless died leaving us without service. We bought the Fire TV. WOW the interface is amazing, everything works flawlessly and is very smooth. I am so happy we bought this device. I have never written a review before but I had to for this. I highly recommend this product for streaming content.", "verified": true, "helpfulness": "0/0", "author": "Adam Kraft"}, {"rating": 5.0, "review": "Installation was very easy and have been using for about 1 month. Supplement cable package with this device and its great. Voice recognition works well.", "verified": true, "helpfulness": "0/0", "author": "william j bernhardt"}, {"rating": 5.0, "review": "I think Amazon was really smart to come out with the Fire TV. Just got mine and I love it. I've been a Prime member for a while now, and having the Fire TV really ties a lot of the media options (videos, tv, music) together.", "verified": true, "helpfulness": "0/0", "author": "DMBC"}, {"rating": 3.0, "review": "As an internet facilitator it works better than any other device I own or have used.  Unfortunately the USB port is non functional which makes the unit useless for me so I was forced to return it.", "verified": true, "helpfulness": "1/1", "author": "John Nickelson"}]