[{"rating": 5.0, "review": "Google has a winner. I use my chromecast daily. I've recommended it several people i work with and actually went to their house and showed them how to use it. What I love is the look on their faces when it finally hits home and they get how useful and awesome the chromecast is.", "verified": true, "helpfulness": "0/0", "author": "xomneus"}, {"rating": 1.0, "review": "I bought and used product for 2 months. Now I got some issues with netflix not working due to an update. Google needs to fix this", "verified": false, "helpfulness": "0/0", "author": "Tyler Bach"}, {"rating": 5.0, "review": "Google always makes great products, and the Chromecast is no exception. All I wanted was Netflix on my bedroom TV. It's not a very old TV, but they're innovating so fast nowadays that I can't afford to buy next-gen smart TV's every year.For $35 this essentially turns my TV into a smart TV. I looked at Rokus, which seemed nice and had a little bit more features, but the one I was looking at was $80+ and I really only wanted Netflix.One feature I wish it had was to play local media, but I trusted that Google will keep up with Chromecast support and more apps would become available. So far they've added a few more and it doesn't look like they're going to stop :)", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 3.0, "review": "I am adept at interpreting directions or figuring out technical devices, but the Chromecast instructions were extremely inadequate.  I had to check on-line boards to learn why the Chromecast was not properly installing. Then, I had to phone the manufacturer when a certain Netflix show was not streaming right.  It turned out that Chrome needed an update, but without phoning, I never would have known.  Given all of the above, I still find the Chromecast more economical than Roku.", "verified": true, "helpfulness": "1/1", "author": "M. J. Herman"}, {"rating": 5.0, "review": "I love the chromecast I watch Hulu and netflix with it. I never miss out on a show. I love love love it.", "verified": true, "helpfulness": "0/0", "author": "Roxanna Shinaut"}, {"rating": 5.0, "review": "purchased 3 of these devices and they are simply phenomenal!! in the beginning it would cut out all the time but after firmware fixes and app updates it now very reliable. so practical i use it all the time watching youtube videos on my tv. would love to be able to cast my phones screen and play music directly from my phone using these.", "verified": true, "helpfulness": "0/0", "author": "GT"}, {"rating": 5.0, "review": "I use it all the time to stream things from my phone and computer to the TV. It works well, and I would highly recommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "ILoveComputers"}, {"rating": 2.0, "review": "I heard about this device on a TV advertisement.  Thought it would be a good thing to have to transfer online videos to the TV for viewing.  Be aware that there are no specifications given to tell you what you need for this item to work.  Your OS has to be \"7\" or above and you have to have an updated modem.  Microsoft will tell you that you need to have \"Silverscreen\" to run the program, but windows doesn't like Google and once you have downloaded \"Silverscreen\", Chromecast will tell you it is not compatible.  It has been a headache to get it to work and I am not there yet.  Really, with the quality of others Google products, I am quite surprised with this one - disappointed!", "verified": true, "helpfulness": "0/0", "author": "Dan L"}, {"rating": 2.0, "review": "in theory this product sounds great. I had hard time getting it hooked up so it would actually do what it is suppose to do but there is all kinds of pausing and losing the connection so far it is not worth what I paid for it I am hopping it is my servers issue as I had high hopes that this would be something good and useful. When all is said and done it may be returned.", "verified": true, "helpfulness": "0/0", "author": "Trudy Harper"}, {"rating": 5.0, "review": "Great little gadget, I use it from my phone and tablet to cast videos that I want to enjoy on my living room TV or indeed to share with my family.", "verified": true, "helpfulness": "0/0", "author": "Efros \"12th level priest\""}]