[{"rating": 5.0, "review": "Read the other reviews. These are amazing. Why don't you have one?", "verified": true, "helpfulness": "0/0", "author": "Dane E Letcavage"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Meiloth"}, {"rating": 3.0, "review": "Although it is nice having for some things, I was disappointed that I'm unable to stream Amazon Instant Video.  If I could, I would have given this product 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Seth Meysenburg"}, {"rating": 5.0, "review": "I love this thing. We don't even have cable anymore. It works great with my phone, tablet, and computer. Hello NETFLIX! Pandora! Youtube!  Random browser window! We even put on a streaming shot of a fireplace complete with Christmas music and fa-la-la-la-la the holidays away. We named ours Home Sweet Home, but you can get creative too with the name obviously. It's easy to set up and the random images that cycle through on the \"sleep\" screen are actually beautiful and make us look like we have actual taste in photography. Speaking of, anyone know how to submit a picture to the Chromecast loop?", "verified": true, "helpfulness": "0/0", "author": "btotheridgette \"btropicana\""}, {"rating": 5.0, "review": "Best product I ever bought, will be buying another one this Xmas", "verified": true, "helpfulness": "0/0", "author": "Pheng Lo"}, {"rating": 2.0, "review": "Constantly lose ability to stream from various devices (iPad Mini, iPhone, Samsung Galaxy 4, etc.) and have to restart the wireless router (and sometimes the TV as well) to re-establish connection so that streaming icon (and Chromecast ID) appears on list once again.", "verified": true, "helpfulness": "0/0", "author": "Donald E. Strong \"dsatamazon\""}, {"rating": 4.0, "review": "My Chromecast arrived a few days ago and I can say that it works really well!My only concern with this product is that it never came with a USB adapter as advertised!! Even the photo portrayed it have a USB adapter from the Chromecast unit itself directly into the TV USB.As it was written to describe Unit:Box includes Chromecast, HDMI extender, USB power cable, and power adapter. No remote needed. Mine only came with a power adapter. Was going to buy this adapter as my buddy had it, however saw and read that this unit came with it. Well...I was wrong.I will give call Amazon and will let you know of their response to give it 5 stars.Cheers and Happy Holiday Shopping!", "verified": true, "helpfulness": "0/0", "author": "D. Ong \"Darren\""}, {"rating": 1.0, "review": "This device was so hard to set up. I could not finish the setup for it because my network would not detect it so every time i plugged it in it would basically be automatically reset to factory settings. I can only cast for a couple of minutes then my phone would disconnect from the device. I would not recommend this to anyone because if you have an older router it will not work. Plus you cannot take it with you on trips because it will not work in a hotel and if you go to someone else's house and they have an older router it will not work. A waste of money.", "verified": true, "helpfulness": "0/0", "author": "E. Berumen"}, {"rating": 5.0, "review": "Works fine. Nice packaging and image resolution.", "verified": true, "helpfulness": "0/0", "author": "Javier Molinas Meilicke"}, {"rating": 3.0, "review": "The chromcast itself is great but I now see why this is cheaper than the 30 dollar one in store. This DOES NOT!! come with an HDMI power cable you have to plug it into the wall or buy it seperate. Little frustrating it doesn't say that anywhere.", "verified": true, "helpfulness": "0/0", "author": "Ryan McGrath"}]