[{"rating": 3.0, "review": "Does it support any web browser like Google or Explorer or Safari like Google TV from Logitech does ? I don't know why no one talks about the browser ....", "verified": false, "helpfulness": "2/20", "author": "Neeraj Budhiraja"}, {"rating": 3.0, "review": "As promised, the Amazon Fire TV is faster than any of the devices out there at the moment. Below are the Pros and Cons that I found on the device.Pros:- Responsive interface and easy to use.- Wide range of available apps to choose from. I.e. Netflix, Hulu, Crackle, etc.- It's able to play Pandora in the background while you browser movies and shows.- Voice search works very well! (but it only pulls back Amazon results as of the time of this review.)- Videos games work great, but you really need the gaming controller to take advantage of them.Cons:- The biggest cons for me was the fact that the search doesn't pull from all available options. The results are strictly from Amazon content.- No native way of accessing media in an external hard drive or in your home network. (This can be solved with third party apps such as Plex.)- As of the time of this review, there is no way to push content to the device unless you have a Kindle Fire.- Gaming controller is a little expensive in my opinion.The device is great, but it is centered around Amazon's content and the other apps don't take advantage of the great feature the Amazon fire TV offers. An example of that is the ASAP technology and voice search. This currently only works with Amazon content.I would love to see applications have better integration with the device. When I see my recently watched content, I would like to see movies and shows I watched from Netflix, Amazon, Hulu, etc; not just the ones from Amazon. I hope some of this things change with future updates and it becomes the ultimate device to serve media to your living room at a reasonable price. The potential is there!", "verified": true, "helpfulness": "2/2", "author": "Saul"}, {"rating": 4.0, "review": "We do really love this. It is convent and easy to use. A little pricey on most of the movie rentals and my 7 year old has been disappointed more than once because a movie she wanted to watch wasn't available to rent at all, had to purchase. Don't get me started on the game control......... Shipping is 3 weeks out :-(", "verified": true, "helpfulness": "0/0", "author": "Cheri_p"}, {"rating": 5.0, "review": "The Amazon Fire TV is almost better than the Apple TV, and only \"almost\" because my family uses iMacs and iPads that integrate with the Apple TV more seemlessly for photos, videos, and music I have stored on my Macs.One can easily set up the Amazon Fire TV without opening the instructions, and I love that it's already registered to my Amazon Prime account.  VERY IMPORTANT - If you're going to buy one as a gift, but sure to check the \"this will be a gift\" box.  When you check the \"this will be a gift\" box, Amazon will deliver the Amazon Fire TV unregistered. The recipient can register the Amazon Fire TV to their own Amazon account when they set it up.The voice control has worked flawlessly for me.  HD videos begin to play immediately with absolutely no buffering.  And I love the HD audio.", "verified": true, "helpfulness": "1/2", "author": "Michael Trotman"}, {"rating": 5.0, "review": "I already own Roku, a Google TV device, Chromecast, AppleTV, all the consoles and a Smart TV. Why do I need another device? I don't, but I was intrigued by what Amazon was marketing. When I first heard of Amazon's plans to put out a device, I figured it would be highly proprietary, much like Apple. I figured Amazon would not include other video services, but when it was released, I was wrong. Not only did Amazon include access to the likes of Hulu and Netflix, it really integrated them quite well into the landscape.Amazon Fire TV is a strong device, with a small footprint, and a small, slick remote. It's super fast, thanks to a strong processor and a dual-band network interface. The voice search makes it easy to find virtually anything on Amazon's own service and I hope that this can eventually be integrated with Netflix, Hulu, YouTube, and any other services Amazon allows onto the device in the future. It really does make searching for content a breeze.Purchasing a video from Amazon's own library is simple as a few clicks and once you purchase, you can begin watching right away. The pricing is reasonable and as far as I can see, actually beats the pricing on competitor services. This makes Amazon a compelling choice, though the major drawback is the lack of UltraViolet on purchases from Amazon's catalog. Mind you, I'm not too worried about Amazon closing anytime soon and feel confident my purchases will always be safe.I already have been able to watch a complete movie purchased through Amazon, as well as a number of shows on Amazon Prime. In addition, I have watched several shows on Hulu and streamed some Netflix programming too. I have never had one issue with buffering or lagging content. The same can't be said about my experiences on other devices, in which I usually see my connectivity slowed and plenty of lag with, be it on my television, console or Roku. I believe much of this may be the single-band vs dual-band issues I have had on my home network. So Amazon saves the day here with its dual-band integrating wonderfully with my home network.My only complaints the lack of some channels I very much want to see. First, I want to see Vudu on this device. I already have a strong library on Vudu. While I can watch a majority of that content through Flixster, thanks to UltraViolet, I can't watch it all and certainly not in HD. One solve for this would be for Amazon to partner with UltraViolet. Regardless, I would love to see Vudu make its way onto the device. I also had expected to see MLB.TV, as I thought I saw that advertised. Hopefully that will show up soon. Besides these missing channels, there are a few others from Roku that would be nice and I would not mind seeing some level of PlayOn integration too. But, for the most part, I'm happy with the promise of possible channels in the future.As I said, outside the device, I would love to see Amazon go UltraViolet. I would be the icing on the cake for this device. But, it's not 100 percent necessary. The pricing point on the videos Amazon offers is excellent and has everyone beat. I pretty much can get all the content I'm looking for from Amazon, Netflix, and Hulu.So in summary, 5 Stars, just needs Vudu, MLB.TV and UltraViolet integration through Amazon.", "verified": true, "helpfulness": "3/5", "author": "Brian McClimans"}, {"rating": 5.0, "review": "The voice command really works! The unit is fast and makes navigation of Amazon Prime and Netflix speedy. It makes the Roku unit seem to be very slow compared to this unit. I'm retiring the Boxee and Roku units. I use this on a Gigabit wired network. Voice commands sure beat slow text input.I have a 60\" Samsung Smart 3D TV that has Netflix, and Amazon Prime on the built in menu. The Fire TV is extremely fast compared to the Samsung Smart TV Netflix and Prime operations.Also if you are an Amazon Prime customer and ordered through that account, the unit comes pre-configured and requires no additional input to use. It connects automatically.", "verified": true, "helpfulness": "2/4", "author": "Marvin B. \"rohoryder\""}, {"rating": 5.0, "review": "I have been using my Fire TV for the past three days, and I am quite happy with Amazon's offering in this space. It is really easy to set up, as I am not the most tech-forward person. I was able to pair my game controller and screen share my Kindle HDX. I really like how Amazon is integrating all of its products in to the Amazon product system. The voice search is really accurate, but it does not search in non-Amazon apps - hopefully that's something that will change. The look and feel of the menus is simple and well designed - it's easy to navigate, and no issues picking it up from the box and getting started.", "verified": true, "helpfulness": "1/2", "author": "Kindle Customer"}, {"rating": 4.0, "review": "After initial setup, the Fire TV was working wonderfully.  Very accurate voice commands, and super fast performance.  After loading Plex and a few other Games, the voice search stopped working (not acknowledging any voice input), I didn't use it much, so I figured it would be ironed out eventually.  Now, the entire remote is unresponsive.  Tried fresh batteries, restarted several times, the Fire TV gets to the home screen (screen saver eventually kicks in too), but no way to get the remote controls to respond.This device appears to have been pushed out way too fast with little quality control.  Hopefully they get this fixed soon.Update: Worked through the issue with Amazon support.  I really wish there were better support documents published for the device, it's almost impossible to search for help, as everything returned by the search engines is about the product release.For those who may experience this issue, (or any remote losing it's pairing), here is how the functionality was restored:1. Unplug the Fire TV and remove batteries from remote2. Power on Fire TV, wait until home screen loaded3. Verify the white LED on the front is still flashing (slowly), this means the Fire TV is searching for paired devices (remotes)4. Replace the batteries in remote, wait 8-10 seconds for remote to boot.5. Hold home button on remote until white led becomes solid (~5 seconds).6. Viola! Hope this helps someone else out there.Updated my rating as well.  This device runs so buttery smooth with Plex.  The response time is fantastic.  Hopefully they voice search API is exposed and developers can tap into it for app integration.", "verified": true, "helpfulness": "2/4", "author": "Jonez"}, {"rating": 5.0, "review": "It’s a familiar drill for anyone who owns a Kindle Fire.  They’ll say, “It’s not like the iPad, can’t do what the iPad does!” And we say, “We know it’s not an iPad, if we wanted an iPad we would have purchased one.”  Thus the Kindle works for our books, periodicals and video the way we want to use them.I’m not interested in comparing other streaming devices as the Amazon Fire TV is my first.  With that said, it absolutely does the job for way I watch TV and work with my apps.  It works for my Amazon, Prime content and Netflix very nicely.  The voice search works perfectly and saves lots of button pushes especially with 2 kids under 10 in the house.  The voice search works with Vevo, but not with Netflix.  Not necessarily upset about that because the remote allows for fast entry.Set-up is very easy, it does all the work for you, and even non-Amazon content loads fast.  What can I say? I haven’t been able to keep my hands off of it since it arrived.  A wonderful device.  Glad I didn’t harken the 1 star reviews from folks just kicking tires.  I actually put my money down and I’m satisfied.Just like the Kindle Fire It does not do everything.  But there is nothing that I want to do…that it can’t do.  I’m willing to grow with the device as it becomes more refined.", "verified": true, "helpfulness": "4/5", "author": "CP"}, {"rating": 3.0, "review": "I have used all sorts of devices: Windows Media Center PC, Raspberry Pi with XBMC, Roku, Apple TV, Chromecast, Samsung Smart TV and now the Amazon Fire TV.If you want to watch Netflix & Hulu, any of these devices will be just fine. Beyond that your mileage will vary.Of all the solutions I've used, Roku is still my favorite because of content options. XBMC had a lot of plugins but required using my phone as remote and it was too confusing for my wife.I think this device has potential if Amazon can manage to get more apps. First day I tried it I had to swap it out for Roku so I could get Mormon Channel or BYU TV. If I could install Android apps I think this device would be even better.Next up, I think I'm going to buy the G-Box so I can get back on XBMC (lots of content plugins) and install android apps. I really want to watch CBS shows and as I understand the only way to stream CBS shows right now is online or with an Android app.", "verified": true, "helpfulness": "1/4", "author": "Dustin L. Davis"}]