[{"rating": 4.0, "review": "Still learning to use ..  like what I have so far.", "verified": true, "helpfulness": "0/1", "author": "Jay Richardson"}, {"rating": 1.0, "review": "Amazon fire is Awesome! But why the 1 STAR then?My remote works for less than 6-8 hours on an average. It is not that anyone is continuously accessing/using it, but even with a 100% idle time of just changing batteries and not leaving it unused, the batteries still drain out. This is the same, be it Lithium Ion or any other forms of AAA batteries. I saw a few reviews before buying Amazon Fire TV, but never believed those reviews since I have never had a bad service or product from Amazon in the past 10+ years. This is my first time and I would hope the last.Amazon Fire Team, please respond or do something about the same. Thank you!", "verified": true, "helpfulness": "2/4", "author": "R. S. Shyaam Sundhar \"Shyaam\""}, {"rating": 2.0, "review": "Wouldn't connect password to my wireless network.  Tech support couldn't resolve. Amazon replacing item,  Had extreme difficulty understanding Wi-Fi support technician due to her accent.  Everything went well until the Refurbished Fire TV found correct network but would never connect using network password.  We'll see how the replaacement works!!!!!!!!!Allen C. Geiser", "verified": true, "helpfulness": "0/1", "author": "Allen C. Geiser"}, {"rating": 2.0, "review": "Ok, I in theory would *LOVE* my Amazon FIRE Tv except for the fact that the sound GOES, randomly. I'm watching an episode of Friends, and then all of a sudden the sound is high-pitched and tinny. This is a problem that is not resolved by a new HDMI cord, the only solution is unplugging the Fire TV and re-starting it.  I'm very disappointed because other than this faulty issue, it is easy to navigate and user friendly. The speak-to-text search is nice, and Amazon seems to be getting new apps all the time. The only issue with new apps is that they aren't always supported by my cable provider (for example HBO Go won't work with Comcast on Fire TV where it does on the Kindle Fire).I reported this issue to Amazon and they are sending me a new unit. If the new unit does not have the sound issue, I will up my review to 4 stars. - Amazon sent me a new unit, and thus far I have not had the sound issues. I am pleased with this product, only hope that cable providers cooperate and let their content be available (HBOGO will not work with my provider on the Fire TV).And I am returning my Fire TV unit, the sound issue happened again. 2 Stars, don't bother with it, until they figure out how to make a product that is consistent. Go with an Apple TV instead.", "verified": true, "helpfulness": "1/3", "author": "Niryana"}, {"rating": 5.0, "review": "We really love it.  So easy to set up and go. I figured for us that are technology challenged we'd fight it. Nope, had it hooked up and running in 10 minutes.  We are Prime members so we are watching tons of things. Probably won't use it to it's full capabilities but love what we do use.", "verified": true, "helpfulness": "0/0", "author": "Mary Eason"}, {"rating": 5.0, "review": "This is my favorite streaming box by far and I also  own 3 Rokus and the Fire Stick.Nothing moves as fast as the Fire Tv, everything loads super fast including movies, tv shows and when you are searching for apps, games, movies etc., everything pops up and you can search through these lists in lighting speed. At first, I was still used to my Roku remote and occasionally hit the Home button by mistake but it would put the show or movie I was watching in Recent and it would start instantly.The remote is simple with the circle handling all the main functions of browsing, fast forwarding, rewinding and pausing. The remote is encased in rubber and feels fantastic in your hand. Of course, the remote has the voice search unlike the Stick where you have to type it in.If you like to play games, I really have to recommend the Fire Tv with the game controller which can be bought as a bundle. Although, you can use the controller with the Fire Stick not all of the same games are available on the Stick. My two favorite games Hungry Shark Evolution and Asphalt 8 Airborne are not on the Stick and are way more awesome on the Fire Tv than on the Fire tablet.The only app that I have noticed is not on the Stick is BBC news but is on the Fire Tv.Oh, and I just love the screensaver slide show on both the Fire Tv and Fire Stick. It is so bright and colorful and always puts me in a great mood.", "verified": true, "helpfulness": "0/0", "author": "chinagirl \"ncchinagirl\""}, {"rating": 5.0, "review": "Love this!!!  The voice feature is fantastic and it's very user friendly to use!!!", "verified": true, "helpfulness": "0/0", "author": "kkc"}, {"rating": 5.0, "review": "Love it.  Tried the fire stick, but returned because the streaming is too slow.  Well worth it.", "verified": true, "helpfulness": "1/1", "author": "Emily T"}, {"rating": 3.0, "review": "I like it but the remote is not complete user friendly and keeps losing wifi connection. Thought it was my wifi connection in the house but recently upgraded and none of my other devices are experiencing the same issue. I like the small size and easy of screen navigation and linkage with Amazon account.", "verified": true, "helpfulness": "0/0", "author": "wonderpassion"}, {"rating": 5.0, "review": "Easy to install - just love it!!  Wish I had done this long ago!  I do wish getting Netflix on it was easier... but that may be me not being terribly computer/electronics savvy.", "verified": true, "helpfulness": "0/0", "author": "L. Saul \"Misty'sMom\""}]