[{"rating": 5.0, "review": "Good quality, great productWe are enjoying everyday!!", "verified": true, "helpfulness": "0/0", "author": "Antonio Avendano"}, {"rating": 5.0, "review": "Works great with my network, my android  (Samsung S4), and Asus Transformer tablet. I am able to cast photos, and watch movies with no problem.  It was very easy to setup.  It can be powered by usb or wall adapter,  which were both included in the box. It works great with hulu, shobox, Viki, chrome,  and netflix from my devices.  It was shipped in an impressive timely manner.", "verified": true, "helpfulness": "0/0", "author": "Omar Archer"}, {"rating": 4.0, "review": "got it for my wife for Christmas. Works well. Can be a little finicky with streaming sometimes, but when it does work, it's nice to be able to look at pictures and netflix on non-smart TV's", "verified": true, "helpfulness": "0/0", "author": "Rizzoe"}, {"rating": 5.0, "review": "This Chromecast has been exceptional. I have gotten more $ in Google credits than I had to spend to by the Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Jim Woodcock"}, {"rating": 5.0, "review": "Like how many different apps are applying the use of devices like this. It's very versatile", "verified": true, "helpfulness": "0/0", "author": "marco perlera"}, {"rating": 5.0, "review": "best thing ever", "verified": true, "helpfulness": "0/0", "author": "zbo2a"}, {"rating": 5.0, "review": "I can move it around from TV to TV where needed and stream Netflix or WatchESPN to the TV whenever I want.  Convenience and picture quality are much better than buying a cable to connect your device to the TV manually, and the cost is comparable as well.", "verified": true, "helpfulness": "0/0", "author": "Ruben Morales III"}, {"rating": 4.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Juan Magadan"}, {"rating": 3.0, "review": "Surprisingly limited on what you can stream onto your t.v.", "verified": true, "helpfulness": "0/0", "author": "Anthony Sepulveda"}, {"rating": 5.0, "review": "Works perfectly", "verified": true, "helpfulness": "0/0", "author": "Jordan Sparks"}]