[{"rating": 5.0, "review": "Had this unit for about a week and cant' stay away from it! Absolutely love it! It's quad core processor blows my Roku 3's dual core away. Videos load almost instantly! 1080p resolution on Prime and Netflix is beautiful. Haven't tried the games yet, but plan on purchasing a controller in a few days. Very satisfied with my purchase!", "verified": true, "helpfulness": "0/0", "author": "Wayne"}, {"rating": 5.0, "review": "I had a ROKU.  I find the sound and picture clarity much better with the Amazon Fire.  I got a sound bar after I got the Amazon Fire and that improved the sound even more.  I had Bose speakers before that and still had a hard time with the dialog in films where characters had heavy foreign accents.  Music is much better also.  I would like to be able to listen to my Kindle Fire books on the TV because of the superior sound.  Does anyone know how to do this?", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Carter"}, {"rating": 5.0, "review": "GREAT \"GAGET\" I AM NEW TO STREAMING TV BUT SO FAR THE SYSTEM WAS A SNAP TO SET UP AND EVERY THING WORKS AS DESCRIBED. I WILL NEVE MISS A SERIES OF SOME TV SHOW. AND TO THINK AMAZON PRIME IS INCLUDED", "verified": true, "helpfulness": "0/1", "author": "Charles L. Alexander"}, {"rating": 5.0, "review": "Absolutely LOVE IT. I was expecting an involved installation and setup process. The entire installation and setup took less the 5 minutes and that long because I spent 2.5 minutes looking for my glasses. Loved it so much I bought 2.", "verified": true, "helpfulness": "0/0", "author": "Daz"}, {"rating": 5.0, "review": "I just got this today and so far I love it.  It's very easy to find the prime free movies and TV.  It was very easy to set up and get it going.  I mirrored my Kindle HDX with it and works fine.  I've been a prime member for three years now and very impressed with everything they have to offer.", "verified": true, "helpfulness": "1/1", "author": "Larry C. Copeland \"copelarry\""}, {"rating": 1.0, "review": "I'm sure I'd like this product if I could get it to work with my display.  I have an older Panasonic AE900U projector which native resolution is 720p.  The projector also supports 1080i/60 but NOT 1080P.  When I plugged in my Fire TV initially the white Amazon logo appeared for about 10 seconds and then the screen started to flash on/off.  I could see some sort of graphics at the bottom of the screen.  I couldn't seem to get anywhere.  I connected the Fire TV directly to my projector same thing.  During this time the power LED would dim and brighten about every 2 seconds and at one point would turn orange.  I connected the network cable, let it boot, press all the keys on the remote until something happened (I think it updated the firmware). Now it will boot up and not flash but I only see a small portion of the display, like the top section of the screen has been stretched over the entire display.  The projector reports it's displaying 1080i/60.  I can't log into the my amazon account because I can't see the on screen keyboard.  I think there might be a menu option to manually set 720p but I can't get pack the login.  Very frustrating.  I've had no other problems connecting other devices to this projector over HDMI, blueray, dvd, playstation, xbox, cable box, computers, etc.Update:FYI - I this sounds unlikely but I believe my new FireTV killed my projector.  It was a Panasonic AE-900U that was about 7 years old with 4000 hours on it so I'm not that choked about it.  I've had probably close to 100 devices plugged into the projector over it's life through an HDMI switch, computers get plugged and unplugged daily without problem.  For some reason when the FireTV was first plugged in the projector didn't switch to it's native resolution of 720P, instead it tried to show the picture in 1080i (which the FTV doesn't support).  I could see the top half of the picture stretched over the entire height of the screen.  Unfortunately it was not possible to navigate to the settings menu on the FTV to try changing the resolution because the device wants to upgrade and make you sign in to your amazon account first.  Disappointed that it didn't work, I plugged my other devices back in one by one and nothing, no picture.  All the projector menus work and are displayed but no picture with any other device.  I plugged the FTV back in and same skewed picture.  I tried plugging the FTV and other devices directly into the projector with a short HDMI cable and same results.  It may have just been the projectors time to die, but it was very well maintained and I haven't had an issue with it until this point.  It's just too much of a coincidence that this was the first time plugging this new device into the projector.  I suspect the FTV HDMI is not completely running to backward compatible HDMI 1.0 specs, this confused the projector and hooped it.  Anyone else still using a Panasonic AE-900U with the ATV or have seen a similar issue?", "verified": true, "helpfulness": "2/4", "author": "Ryan Sieber"}, {"rating": 5.0, "review": "What can I say that hasn't already been said.", "verified": true, "helpfulness": "0/0", "author": "Walt Nicholson"}, {"rating": 4.0, "review": "Was not in love with Amazon Prime-couldn't find many movies to watch without having to pay extra, but Netflix and Hulu Plus make up for it. Seems to be working pretty great.", "verified": true, "helpfulness": "1/1", "author": "Kim Hardin"}, {"rating": 4.0, "review": "Received my Amazon Fire TV as a birthday gift.  Love it, regardless that pay/rent movies are mixed with Prime free content.  The one flaw I'm finding with mine is that the batteries in the remote are dead every two days!  It gets expensive to replace them that frequently.  Do I by any chance have a defective remote?", "verified": true, "helpfulness": "0/0", "author": "JDBN"}, {"rating": 5.0, "review": "I can install most of android apps on it, very very impressive piece of hardware.", "verified": true, "helpfulness": "0/0", "author": "Steve"}]