[{"rating": 5.0, "review": "After switching to Android with the Nexus 4 from the iPhone 4, one of the biggest things I missed was AirPlay and Apple TV. I think Google finally heard us after the failed Nexus Q experiment. This thing is about the size of a USB stick but has some incredible functionality which I think adds some advantages over Apple TV.It doesn't have as many apps as Apple TV, but what it does allow you to do is use your device after you've initiated streaming something. For example, I fire up Netflix/YouTube on my phone or tablet and then choose what I want to watch, send it to Chromecast, and it starts streaming from the cloud. This allows me to use my phone or tablet while my TV streams the content I chose. Another great feature is streaming a tab from Chrome on your PC or Mac. I can share out any tab I want to replicate it on my TV. While I share that tab, I can open more and work on those while the shared tab is still displayed. This works pretty well but can definitely depend on your wireless network. I've seen some stuttering and lag when displaying some content, especially while scrolling. Having said that, it's definitely a killer feature of the thing. I have this hooked up to my Samsung Plasma and when I hit stream to Chromecast on my phone, it automatically switches the input to the Chromecast and starts playing my video.Did I mention the price? You're getting a lot of the same functionality as other streaming devices in something this small for a fraction of the cost. If you're thinking about getting this, definitely pull the trigger. You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Drew A. Rohaly"}, {"rating": 3.0, "review": "In truth you can't do much with it. Maybe that will improve down the road. I think it could be kinda nice for a hotel room. Able to watch youtube or netflix on the screen.", "verified": true, "helpfulness": "0/0", "author": "RJW"}, {"rating": 2.0, "review": "I think I was initially attracted to the chromecast for it's aesthetic promise.  I loved the idea of a media device that disappeared entirely from view.  I purchased it primarily to see if it would be something my parents would use and compared it to a Roku and an apple tv.The aesthetic promise is quickly lost when I have extra cables dangling out of the chromecast to power the small device.  I know some got lucky that it was actually powered by the hdmi port itself, but I have a relatively new quality tv and it could not power it.The ease of use purported by making your other devices the remote also gets lost quickly since I've lost the attraction to phones as remotes and laptops as remotes since the benefit of having a physical remote to pick up quickly, barely look at, to either stop or lower the volume is immeasurable.", "verified": true, "helpfulness": "0/0", "author": "J. Siegal"}, {"rating": 3.0, "review": "Limited use device (Youtube, Netflix and Hulu) but the price makes it much easier to justify.  I will be curious to see what Google does with this in future software releases.", "verified": true, "helpfulness": "0/0", "author": "DK"}, {"rating": 4.0, "review": "It was very easy to setup, and works beautifully.  I just wish that there were more apps available for IOS that would support it.", "verified": true, "helpfulness": "0/0", "author": "Charles Breaux"}, {"rating": 3.0, "review": "Very functional for watching You Tube an Netflix and easy to use.  However, the inability to cast other web pages and not being able to show my mobile pictures and videos on the TV screen make this product a bummer.  Apple TV would have been a better alternative.", "verified": true, "helpfulness": "0/0", "author": "dniska"}, {"rating": 2.0, "review": "chromecast only works with 3-4 apps that google has allowed them to be used to cast the video to your TV so that was a big minus for me. also quality of video is decent but you can tell is not smooth as it should be. I returned the product after 1 day... google did a good job at making it seem better than what it is on their TV commercials.", "verified": true, "helpfulness": "0/0", "author": "tofusi"}, {"rating": 3.0, "review": "It is okay, but our Wii is streaming Nexflix much better.  You have to download the entire show from Netflix (haven't tried Hulu yet) first, and some of the movies can't be downloaded to the Chromecast.  That is dumb.  I hope it will work nicely for sports that we can play on our laptops, but don't have through our basic cable.  Haven't gotten to try that yet.  If that works, it is worth the $30.", "verified": true, "helpfulness": "0/0", "author": "K-grl \"K-grl\""}, {"rating": 4.0, "review": "Absolutely Love It! It is easy to set up. It works great. The only downside is that it is not HD. It is 720. This is not an issue for me and at $35 it can hardly be called a complaint. But it works flawlessly. You do need Chrome so make sure you have the Chrome Browser.When I plugged it into the back of my Samsung, my laptop's wi-fi immediately recognized it. It took a few minutes for Chromecast to update itself to the latest software update but that was it. Now I click the upper righthand icon and I am watching Netflix on my big screen TV. The sound comes through the TV so Netflix is no different than HBO.", "verified": true, "helpfulness": "0/0", "author": "Mr. Ted Schachter \"ted schachter\""}, {"rating": 5.0, "review": "While I don't use it everyday, I do fine it very useful.  I also have an Apple TV.  It is comparable (minus the iTunes content and HBO Go).  But for $35, you really can't go wrong with this.  Using a phone or tablet as the remote is nice too.  The clever way it plugs in to the back of your TV's HDMI port and with a USB cable that also plugs into the back of your TV is genius; it is invisible.", "verified": true, "helpfulness": "0/0", "author": "Buster55 \"Joe\""}]