[{"rating": 5.0, "review": "Chromecast is the device that you didn't know you needed till you started using it. Setup is dead simple. Then you simply hit the cast button on your phone or laptop, and the home theatre comes to life, playing Netflix,  Pandora, or \"couch-sourced\" YouTube playlists from all friends in attendance. Your phone becomes the all-in-one remote that even your grandma can figure out, and it works from everywhere your WiFi reaches. And there are services you can use to stream your own content as well! Once you start using one, you'll want one for every tv in the house.", "verified": false, "helpfulness": "1/1", "author": "Ian \"ian@razordaze.com\""}, {"rating": 1.0, "review": "I have been wanting this for a long time but without Amazon app it would be a paperweight. I  don't think Google and Amazon are going to play nice over this.", "verified": false, "helpfulness": "1/3", "author": "debbie13410 \"I love history and complex characters.  But I also love to read techno thrillers and spy novels.\""}, {"rating": 5.0, "review": "Awesome! This is easy to use. Works great with a smartphone especially with Android.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"BABYJAMEZ\""}, {"rating": 5.0, "review": "This has got to be the best tech gadget I have ever purchased.Can stream anything easily tv, no cables, or tricky setups.", "verified": true, "helpfulness": "0/0", "author": "c flowe"}, {"rating": 1.0, "review": "BEWARE!!!! Use at your own risk. received as a gift. when I downloaded app and google chrome on my laptop to set up I also got 8 malware/adware programs included. After 2 days I have not been able to completely remove them all. My laptop is virtually useless. I have made sure EVERYONE  I KNOW IS AWARE OF THIS. I will not ever try this or any other google product", "verified": false, "helpfulness": "0/4", "author": "patrick Lesnak"}, {"rating": 4.0, "review": "Works, but you can't cast everything. I would like if you could cast Google books and kindle but sadly at the moment you can't.", "verified": true, "helpfulness": "0/0", "author": "ssosix"}, {"rating": 3.0, "review": "Great picture but lack of apps.  I wanted to show local TV directly.", "verified": true, "helpfulness": "0/1", "author": "Jon Kettenhofen"}, {"rating": 1.0, "review": "I wanted to be able to \"mirror\" my Chrome browser onto the TV in order to watch iSho.ws, but the Chromecast would not allow me to do this. I have and iPhone, an iPad, and a Dell Laptop (all running Chrome as primary browser). I was misled to think that the Chromecast would \"mirror\" my Chrome browser directly onto the TV, but it does not do this. It can run YouTube, Hulu Plus (which I don't use), and Netflix (which I don't use, because iSho.ws is free).", "verified": false, "helpfulness": "0/1", "author": "Inman"}, {"rating": 5.0, "review": "This is an excellent product!  Easy to setup and to connect to and gives you a lot of functionality at your fingertips.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Dustin L Stewart"}, {"rating": 5.0, "review": "Awesome price", "verified": true, "helpfulness": "0/0", "author": "Christopher Lehnow"}]