[{"rating": 5.0, "review": "Best purchase ever! I love that I can remotely control my t.v. & even more so that I can show up to friends houses & put my favorite movies on without even being inside", "verified": true, "helpfulness": "0/0", "author": "lindsey"}, {"rating": 1.0, "review": "This is a piece of bs. Crap. Buffers all the time although I have 50mbps line and router is just next to the chromcasr. Again it is not compatible with iPhone, you have to download chrome browser for it to work.", "verified": true, "helpfulness": "0/1", "author": "Nandkishor Kulkarni \"NK\""}, {"rating": 5.0, "review": "Very entertaining.", "verified": true, "helpfulness": "0/0", "author": "Deck Re-builder"}, {"rating": 5.0, "review": "Brilliant. Works as described. No need to have smart TV", "verified": true, "helpfulness": "0/0", "author": "Kiran"}, {"rating": 5.0, "review": "Everyone needs one. Streaming video is the future - not stupid cable.", "verified": true, "helpfulness": "0/0", "author": "TILII"}, {"rating": 4.0, "review": "The device in general, works well... how well, depends on your Android device..  it works best with 4.4.2... and as you go back in numbers, you get less function.I liked it well enough to buy a second one, just to take with me when I travel, for streaming from my tablet to the TV in my hotel.I recommend getting one, especially if you have a device running on 4.4.2 or higher.", "verified": true, "helpfulness": "0/0", "author": "R. Barbre \"RBarbre\""}, {"rating": 4.0, "review": "Works well with Android phones and laptops with most apps. Does not support Amazon Prime streaming video.", "verified": true, "helpfulness": "0/0", "author": "Warren \"Wazoomr\""}, {"rating": 5.0, "review": "Very cool!!!", "verified": true, "helpfulness": "0/0", "author": "Fernando Daniel"}, {"rating": 4.0, "review": "I'm still trying to find out what else it can do, but so far so good", "verified": true, "helpfulness": "0/0", "author": "Josue Cardona"}, {"rating": 5.0, "review": "Cool device for displaying on a big screen but I'm gonna try Fire Tv just for the games and Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Amelia Bello"}]