[{"rating": 5.0, "review": "Easy alternative to Apple TV, can be used with many streaming apps on most TVS and easy to install move around the house for the convenience of everyone!", "verified": true, "helpfulness": "0/0", "author": "Amber W"}, {"rating": 1.0, "review": "Cheaper than the Roku but not better.  No problems streaming from the Roku. The chromecast is another story.  Reboots and resets constantly. Horrible.", "verified": false, "helpfulness": "0/1", "author": "j irizarry"}, {"rating": 2.0, "review": "it didn't for me after numerous attempts and much research online. Best I could determine it doesn't work with my Arris router. They have a so-called compatiblity list that only lists certain models [...]", "verified": true, "helpfulness": "0/0", "author": "Back sufferer"}, {"rating": 5.0, "review": "Use primarily for Netflix streaming to my TV.  I absolutely love this device.  So easy to setup and configure.  It just plain works.  Such a refreshing change to have technology that works with no fuss.", "verified": true, "helpfulness": "1/1", "author": "LASO"}, {"rating": 5.0, "review": "Get your Netflix subscription and unhook your premium cable or sat channels. Great price to be able to have more options.", "verified": true, "helpfulness": "0/0", "author": "Terrence P. Tague"}, {"rating": 5.0, "review": "Loved these so much I bought 3 more for all my TV's! They work really well for Plex and I would highly recommend opting for these instead of getting a \"smart\" TV", "verified": true, "helpfulness": "0/0", "author": "Noah J."}, {"rating": 5.0, "review": "I have 2 of these in my house where one is for living room, and one is for bedroom, and this Chromecast works with my Synology DiskStation and I can stream any movies I have in the server to any of the TV in the house.", "verified": true, "helpfulness": "0/0", "author": "K. Tse \"Ultraman Forever\""}, {"rating": 5.0, "review": "When I first got the chromecast after reading all the hype about it my husband didn't understand the point of it, but now that we have been using it for a few months we would not survive without it.  It fills a void that was left when we cancelled cable, now my children can watch their favorite Disney XD shows on Netflix in the kitchen while having breakfast in the morning, and we can keep the peace in the morning.  Well worth the money spent on it.  My only wish for this item was that it could stream Amazon On Demand, I guess it can if you control it through your laptop and stream on chrome, but we normally control it from our tablets, and streaming from chrome seems a bit choppy anyway.  Works beautifully for us streaming Netflix and Youtube.", "verified": true, "helpfulness": "0/0", "author": "catgal77"}, {"rating": 2.0, "review": "I love the idea of the chromecast, and I wish it worked as advertised - but it has a number of technical issues that prevent it from functioning like it's supposed to. It will not stream for more than a 15 minute period no matter the quality of video being streamed, and while it is working the video suffers frequent quality issues. Unfortunately Google's support page simply says that these are known issues that they're \"working on,\" but that's been the case every since I purchased the comcast from Best Buy last year. Be aware that you're receiving a product which doesn't work nearly as well as I had hoped, and consistently doens't work at all.", "verified": false, "helpfulness": "1/1", "author": "MG"}, {"rating": 5.0, "review": "I stream shows from Netflix/HBO GO to my TV and it works extremely well. Both Netflix and HBO GO have Chromecast buttons on their actual media player which is awesome. I've had no problems with either. I've also streamed some games and Youtube videos from Google chrome. It takes a few seconds for the sound to \"catch up\" to the video, but it works well. Another pro is that anyone with access to your WiFi can play music videos via Youtube on their phone. It's helpful because everyone has a different taste and you just let people do their thing without having to worry about what to play. I have this connected thru my sound system and it works well.", "verified": true, "helpfulness": "0/0", "author": "John S"}]