[{"rating": 4.0, "review": "Great product it does what it's suppose to just make sure you have a really good Internet connection or else it's not going to work.  This device is Internet based so pick one up and get rid of the hdmi cable.", "verified": true, "helpfulness": "0/1", "author": "Yashmina Uejima"}, {"rating": 5.0, "review": "I don't know what else to say about the Google Chromecast...However, this thing is amazing.I yuck it up to everyone i know. I suggest you buy it and enjoy it for yourself!.One note, if you don't use Youtube, Netflix, or Chrome Browser... it might be a waste of money.", "verified": true, "helpfulness": "0/1", "author": "Ron"}, {"rating": 5.0, "review": "Google Chromecast was easy to set up and worked great!  For about $35, it is a good deal too.  Definitely worth the money.", "verified": true, "helpfulness": "0/1", "author": "David Cagle"}, {"rating": 5.0, "review": "Two words of advice for anyone viewing this product, buy it! This item looks and fits great and at $35, it's a steal.  Other Streaming devices can cost well upwards of $100 and the cheapest I've found is around $50.  I tried a vizio streaming player before ordering this and was very disappointed.  My complaints: tedious to use with the remote, required space on a shelf and it was fairly costly.  The chromecast solved all of these woes.  It's controlled by my iPhone which I set up in a matter of minutes, it plugs in to your HDMI port well out of sight and it is super cheap!I went into this with an expect the worst hope for the best attitude, since I didn't expect a great picture or good sound from such a small and cheap device.  I was wrong!  The picture is fantastic, but does take 10-15 seconds to buffer and focus into true HD.  it's a little blurry for those few seconds.  So what, right? I agree.BUY IT, you will love it.", "verified": true, "helpfulness": "0/0", "author": "Cody D"}, {"rating": 3.0, "review": "It does not perform as they advertise, it is not that easy to connect from your phone. Sometimes it disconnect and I have a very good wifi signal.", "verified": true, "helpfulness": "0/0", "author": "Osiris Villacampa"}, {"rating": 4.0, "review": "It's good for Netflix and youtube. Works well with multiples for other rooms. Works from everyone's phone or tablet in the house. Tricky to set up if your not technology inclined.", "verified": true, "helpfulness": "0/1", "author": "Shane Bowman"}, {"rating": 5.0, "review": "This is a must have in my opinin.  Even if you have a smart tv this allows you to remote control youre media from youre phone.  I plah youtube netflix pandora.  And anything on google chrome browser pics videos ect.", "verified": true, "helpfulness": "0/1", "author": "ed"}, {"rating": 5.0, "review": "good product on time delivery", "verified": true, "helpfulness": "0/0", "author": "pcexp"}, {"rating": 5.0, "review": "Received this promptly however the directions for use was a little confusing and took more time to get this to work with my laptop than I had anticipated. However, once I got it in working condition it is great!! and will use it.", "verified": true, "helpfulness": "0/1", "author": "Lori L. Lewis"}, {"rating": 4.0, "review": "I love it! I love how I can stream anything from my computer. Downside is that I was under the impression that I could show more things from my phone when it can only do a few select things from my phone.", "verified": true, "helpfulness": "0/1", "author": "Kristin"}]