[{"rating": 5.0, "review": "Easy directions to follow, easy to install and works very well. If you have a Netflix account, you should have this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This item shipped really fast , was easy to connect and works exactly as promised. Recently they are updating software to allow the Chromecast to allow apps like AllCast to work on this device. Overall its a great price for a great little gadget.", "verified": true, "helpfulness": "0/0", "author": "Noe Villanueva \"Push Star\""}, {"rating": 1.0, "review": "I REALLY wanted my TV to work well with Chromecast. I just moved it to a mount in my bedroom and really didn't want to have  shelf for BluRay or Roku. This seemed the perfect solution - just stream content from my iPhone or iPad. Except the device simply can't hold the signal and you're constantly buffering.I originally thought it was my wifi or internet connection, but since then have replaced it and extended the signal only to experience the same issue. It's PAINFUL to watch Netflix with this. Had to return it.", "verified": true, "helpfulness": "1/1", "author": "leylabot \"Leyla\""}, {"rating": 5.0, "review": "This is seriously really nice! I use it alot, mostly to watch youtube and netflix. I can't wait until there's an upgrade that allows it to have more integration.", "verified": true, "helpfulness": "0/0", "author": "Laura Anderson"}, {"rating": 2.0, "review": "I bought this in hopes of streaming from my desktop computer to my flatscreen tv. I found out that it only works if you have a wifi type of product; such as, an ipad, iphone, or other handheld device. I'm not happy.", "verified": true, "helpfulness": "0/3", "author": "Davecat \"Davecat\""}, {"rating": 5.0, "review": "Google has a hit on their hands.I did have to buy a new router, flash ddwrt and put in some forwards to get it to work with Hulu plus in my country. But besides that its one of the best purchases I've ever made.I can't wait for Plex to release the chromecast support in it's app for everyone so I can stop paying for Plexpass monthly!WarrenTrinidad & Tobago", "verified": true, "helpfulness": "0/0", "author": "WarrenC - Trinidad & Tobago"}, {"rating": 5.0, "review": "We absolutely love our chromecast!!! We are actually thinking of canceling our cable because this is all we watch.  Wish we had one for each tv in our home.", "verified": true, "helpfulness": "0/0", "author": "chad halbach"}, {"rating": 1.0, "review": "I have been trying to contact someone about my product never arriving.  I was able to report that the product didn't arrive but Amazon told me to wait until the end of the 3rd to see if it arrived.  It did not and now there is no method for me to get in touch with anyone about replacing my product.  I am an Amazon Prime member and order things for business and personal use.  I have only returned a single item in my history as a customer.  I hope someone fixes this situation or my business is gone.", "verified": true, "helpfulness": "0/2", "author": "A. Martin"}, {"rating": 4.0, "review": "I was pleased with the ease of start up. I was surprised to find that I needed additional software to cast photos to my TV but it was easily and cheaply available on the internet.", "verified": true, "helpfulness": "0/0", "author": "S. C. Fisher"}, {"rating": 3.0, "review": "Pretty cool for streaming Pandora at parties and watching movies and shows rented from the Play store, but casting a pure webpage from Chrome is pretty mediocre.  Other devices around the house perform its other current capabilities much better (PS3)?.", "verified": true, "helpfulness": "0/0", "author": "Simon S. Dietsch"}]