[{"rating": 1.0, "review": "After owning this device for a little more than a year, I couldn't get it connect to my wireless.  No amount of resets would make it work.  Only by using the factory reset option was I able to get it to work.  Not happy at all with this.", "verified": true, "helpfulness": "2/2", "author": "Glen Walker"}, {"rating": 5.0, "review": "Working great in South Africa, almost no buffering. Games run like a dream. plug and plug with xbox 360 controller", "verified": true, "helpfulness": "0/0", "author": "John MacAlister"}, {"rating": 5.0, "review": "I love my Amazon Fire TV.  If you have a prime membership with Amazon this is the best thing going.  I have Comcast cable and many of the TV series for previous seasons, you have to buy and with the Fire TV and so many choices makes this a \"no brainer\" choice.", "verified": true, "helpfulness": "0/0", "author": "Randall Wilson"}, {"rating": 3.0, "review": "I really like it and it's a great and fast device.One thing only must be fixed which is the ability to play media from usb sticks or usb disks. I have many big usb disks and when I connect them to ftv nothing is happening.", "verified": true, "helpfulness": "0/0", "author": "Chris Kisirgiannopoulos"}, {"rating": 1.0, "review": "SHAME ON YOU AMAZON!!!I bought this for my Dad as a Father's Day gift because he has a difficult time operating electronics and I thought the voice activation feature would allow him to use Netflix to watch shows like a Breaking Bad and House of Cards. Shows that are free with his Netflix account. I think it's pretty obvious that Amazon is taking advantage of elderly people who are not tech savy by only showing them options to pay Amazon to watch a show and not showing them the free options available for the very same show on Netflix. So disappointed in the monopoly they are having on the voice operations.", "verified": true, "helpfulness": "4/9", "author": "M. Schwartz \"amazin\""}, {"rating": 4.0, "review": "The Fire TV is a great product. As far as AFT vs Roku 3, they are in use fairly equal, though the voice search function does save time and hassle. Its use is limited, though they are planning to expand the voice functions which will make it an amazing feature. If you have a Roku and like it, then there's no point to switching. If you are new to streaming sets, then this is maybe the best option to get.There are a few quirks which I hope to see fixed:Even with the screen saver off, the screen with go black after 20 minutes while playing Pandora, and there is inconsistent response from the remote in waking it. When you press a button to wake the screen sometimes it will not also perform the action of the button pressed, but sometimes it will.While using the Hulu app, at random times the image will freeze but the audio and progress bar continue. It usually will unfreeze by skipping forward or backward and resuming. Though one time the video was frozen in spite of this and i had to leave the Hulu app and re-enter it.There is an undocumented item in the settings called \"Quiet Time\". I have no idea what it does, nor have I been able to find anyone who knows what it is.I like how there are ratings from IMDb (an Amazon company) included with movies and TV shows (for content streamed from Amazon). It would be great though to also have movie genres listed, as well as the option to use Rotten Tomatoes or some other service for the ratings.", "verified": true, "helpfulness": "0/0", "author": "Trust me, I'm not a hipster"}, {"rating": 1.0, "review": "Amazon Fire TVgot my first Fire TV and after signing in, downloading and setting up apps, it started!! began to notice the the lips were moving, followed by the sound. called AMAZON went through all the proceedures, clearing  caches, etc, restarting, filling in all the blanks again, and it worked. then after a few days, the cache that's supposed to clear, did not, the voices were out of sync, and back to all the fun, clear, clear, clear, plug, unplug, reset to default, cause it sure was not my fault, then back on! yes, and of course if you wanted to watch a movie during dinner, by the time you are done all this, DINNER is cold. and then there is the PHILLIPINE factor, where you can only half understand the tech guy, who can only half understand you, but he says he speaks engrish, I'm sorry, I'm sorry, I'm placing you on hold, I'm sorry, oh you want FIRE TV, I'm sorry I only do kindle fire, right house, wrong FIRE!! I suggested the Fire Dept. and he said I'm sorry, good idea! (I'm not kidding), as I told him the FIRE was on TV. OMG, this is crazy!! did I not dial 1 for englich, or is that 2?? anyway, I called back and got FIRE TV, cleared cache, reset, restarted, redid, and should have rebuilt, and evidently there is a problem, as they wanted  the unit for developer review. in the meantime, as this was my Father's Day gift, the leadership team member, over knighted me a new unit, and I was to send this one back for study! the new unit arrived today, so I started it up, when I got home tonight after a graduation party. Hmmmm, tried Netflix, and get all sorts of errors, can't find Netflix, restart Netflix, then the WHITE screen of DEATH, and Fire is locked up. unplug unit, plug in, call AMAZON FIRE DEPT. and the nice young lady starts with, unplug unit, hold, plug in unit, go to setting, apps, and clear caches for amazon prime, and Netflix, try again, same thing, restart Netflix, oh well, how about a total system reset, did that too, still no Netflix, she goes to check on her Fire TV, it's working, I say nothing, pull my ALLEGEDLY BRAND NEW unit, put back the old one, and don't you know it, as they are telling me it must be a Netflix issue, it sure as hell works now on my old fire box!! WTF?? DUH, uh oh, no do do, AMAZON lied to me, telling me they were overnighting me a new unit, and this is a replacement Piece of Defication, as it was blister packed to a hunk of cardboard, and certainly did not look like a new unit! so, I got screwed out of my fathers day gift, as the next one will not come until Tuesday, and ups will be here on Monday to pick up all the bad units!! YES, AMAZON SUCKS around my house right now, and as this was bought by my son, as his first AMAZON Purchase, being lied to, and screwed over has left a very bad taste in a young customer's mouth, and AMAZON has left a lasting impression on him of how big business works, and how they lie!!! guess we will see how FIRE BOX 3 works out! I almost can't wait!!", "verified": true, "helpfulness": "3/14", "author": "Shooter5"}, {"rating": 5.0, "review": "should have bought this a long time ago. enjoymovies, especially some of the old ones. with the fire tv, I get the choice of old or new movie", "verified": true, "helpfulness": "0/0", "author": "the old seadog"}, {"rating": 3.0, "review": "Typical android based apps not responding and just closes.  Please add a restart command feature on the next update.  I have to physically go to the unit and unplug and plug the power cord and it needs to be restarted and I have to do this a few times a day.", "verified": true, "helpfulness": "0/0", "author": "Jimmy"}, {"rating": 5.0, "review": "I use this primarily as a plex client and it performs perfectly and I am planning on buying another soon.", "verified": true, "helpfulness": "0/0", "author": "David W. Wilson"}]