[{"rating": 5.0, "review": "My granddaughters play this non stop. Love it", "verified": true, "helpfulness": "0/1", "author": "Mamaw"}, {"rating": 3.0, "review": "This is an ok product. The dislikes are not nearly as many choices as netflix, Most of them you have to pay for and for some reason is doesn't come over my TV in high def. Wouldn't buy again.", "verified": true, "helpfulness": "0/1", "author": "Philler Oliver \"dianne o.\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "J. Adams"}, {"rating": 1.0, "review": "sent it back.", "verified": true, "helpfulness": "0/4", "author": "Drummer \"KindleLover\""}, {"rating": 5.0, "review": "We love it.", "verified": true, "helpfulness": "0/1", "author": "Elise Buckner"}, {"rating": 5.0, "review": "I had purchase the Fire TV to replace the WII that I was using to watch movies in my living room.  In my bedroom I have the Google Chromecast. With 1 weekend of watching my Hulu, Netflix, and now Prime Videos the entire weekend.  I decided to move the Amazon Fire TV in my bedroom and have never looked back.  I have moved the Google Chromecast in the living room and love the Amazon Fire TV device.  Love that I can use my Prime Membership for other then great shipping rates and quick delivery.  Really love my weekends now........Thanks Amazon", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased my Amazon Fire TV on July 17. I have a 40\" LED TV. The quality of the movies and videos is incredible. I have a sophisticated stereo component system but let me tell you it is amazing the Quality of the sound that comes through this Fire TV onto my TV.Today I fianlly learned how to stream the music videos I want to see from Youtube. Youtube has so much good stuff.  I received from Amazon a 30 day trial for Prime and it is worth getting the yearly subscription which I intend to get when my 30 day trial ends. Prime offers a lot of good movies and series plus you get free shipping if purchased from Amazon.", "verified": true, "helpfulness": "0/1", "author": "Eduardo Ruiz \"The Critic\""}, {"rating": 5.0, "review": "I love it. I absolutely love it. It's easy to navigate and I love the ease of the menu. I also love that you don't have to turn it off.", "verified": true, "helpfulness": "0/1", "author": "jbeck097"}, {"rating": 5.0, "review": "Definitely makes cutting the cable cord much easier!", "verified": true, "helpfulness": "0/1", "author": "Joey"}, {"rating": 5.0, "review": "Works great and is fast.  I subsequently purchased a Nexus Player as well, and the Firetv still wins for content and usability.  The only thing I use the Nexus player for is Google Play Music at this point.", "verified": true, "helpfulness": "0/1", "author": "Ophidia"}]