[{"rating": 5.0, "review": "item exactly as described said the seller, 100 % recommended, excellent product.", "verified": true, "helpfulness": "0/1", "author": "Joshuan"}, {"rating": 4.0, "review": "Easy to set-up and use.  Works great on my computer system since I am using Google Chrome and the internet router and TV are in the same room.  Your results may vary.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 3.0, "review": "The Chromecast works well with my mac book pro with Chrome Browser.  However, when I use it with Android phone, the video playback is jittery.  It is possible because the video player that I am using on my Android have the Chromecast stream option.  I had to mirror the Android screen to Chromecast to watch video.  YouTube works good with Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Chris Kirby"}, {"rating": 5.0, "review": "I'm happy with my chromecast.", "verified": true, "helpfulness": "0/1", "author": "herta lorono teheran"}, {"rating": 4.0, "review": "Very good, only issue is the lag when I'm sharing my windows desktop to the chromecast. And some unexpected stops when playing movies using PLEX.", "verified": true, "helpfulness": "0/0", "author": "Adrián Pérez Fernández"}, {"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "laurence robinson"}, {"rating": 4.0, "review": "Its good!!", "verified": true, "helpfulness": "0/2", "author": "claudio shigekazu oya"}, {"rating": 1.0, "review": "piece of a s***stopped working after 1 year!yeah cheap ass quality worked only 1 yr!", "verified": false, "helpfulness": "0/3", "author": "GHC"}, {"rating": 5.0, "review": "The chromecast is the perfect gift. I love it. I use it for card games when I have people over or to watch Netflix and look at photos. I also stream movies with it. I almost want to by my whole family each of their own!. I highly recommend this to anyone with any knowledge of phones and casting devices.", "verified": false, "helpfulness": "0/0", "author": "Ben Campbell"}, {"rating": 3.0, "review": "This is an interesting product.  I have had a Roku for several years and really liked the platform, and did not think that I would ever switch.  However, I recently decided to stop moving the Roku form room to room and thought I would try one of the new streaming stick devices.  The Roku device similar to Chromecast was $50 whereas the Chromecast is only $30.  Having used the Chromecast, I cannot see how other similar products can go for so much where this product only retails for $30.  The concept is interesting and different from the standard Roku which is a platform that has all channels available in one place.  With Chromecast, you have to have several apps to make this product stream to your TV.  The Chromecast acts only as an interface to get streaming content from your phone, tablet, computer, ect... to go to your television screen.  If you already have Youtube, Netflix, Crackle, ect on your device then this is no problem.  If you have to add these apps then this is slightly annoying but tolerable. The video quality is not the best, Netflix plays slightly grainy but not bad.  In all this device is a great way to stream content to the big screen from your devices but this is not really a replacement for a full platform device like my Roku 3 but for the money, this is a cool way to get content from a device to your TV.", "verified": true, "helpfulness": "2/2", "author": "Chasin T Turnier"}]