[{"rating": 5.0, "review": "I have purchased 5 of these bad boys from friends and family.  Google continues to make the product better by adding additional apps that have the ability to cast.  As long a google continues to allow the development, this will surpass the Rokus.", "verified": true, "helpfulness": "0/0", "author": "M. Retif"}, {"rating": 4.0, "review": "No compatibility with al devices to stream. E.g. nexus 5 cannot stream amazxon prime movies. You will need a kindle firme.", "verified": true, "helpfulness": "0/0", "author": "David Sperber"}, {"rating": 5.0, "review": "I received all of my recent purchases from Amazon quickly and at a decent price. The Chromecast is a very cool device.", "verified": true, "helpfulness": "0/0", "author": "felix j. bracero"}, {"rating": 2.0, "review": "Disappointed.  Here is a real review since what I found on the web was hopeful garbage from people who want google's favor. Anything \"can\" get better but I wanted to buy it now so what can it do now is the question!  FYI I had google tv and it sucked and I was one of the first to point that out too. All you can use is what google allows which is the same thing every wii, roku etc used when they first came out.  I think chromecast has 6 apps you can use and you have to pay for the premium version of any app to use the apps ability to even use the chromecast.  The tv ad for this is misinformation at best.  You cannot use a smart phone to chromecast what you see on your phone to your tv because the chrome browser mobile version conveniently does not have the functionality to work with chromecast (if you look closely at the ads for chromecast, you can see the only thing google shows streaming is youtube.  So if all you do is youtube, then this is good for you - but there is some dumb design even with this. You cannot see the movie playing on your phone while on tv...but if you want to fast forward, rewind, or change to a time in the movie you have to use your phone and basically guess where you are going to end up.)**The one thing it is good for is using a regular computer terminal running chrome.  It can cast what you see on your computer chrome browser to the tv.  So that is cool but but you need your computer to be near your tv if you want to control/enjoy/quality check what you see on your tv.FYI The Chromecast requires 2 jacks not just one.  They don't mention this either, but you have to power this dongle.  So you need to plug it into your HDMI jack but also plug the other side into a usb port (hopefully your tv has one) or to the AC adapter it comes with.  So again the ad misleads.  You don't just plug this little stick in and you're done!Bottom line, chromecast has good intentions but really has a long way to go, like google tv.  Roku and Apple have Google beat.  This is as of: 20131227", "verified": true, "helpfulness": "1/2", "author": "The Guy"}, {"rating": 5.0, "review": "This little piece of tech worked flawlessly .....just one time. The next day it wouldn't work and was warm to touch. Tried everything possible, looked at forums, chromecast help pages (useless).I like things google, wanted for it to work. Maybe it was a defective sample, well.... who has time to be beta tester.UPDATE: Reordered after hearing personal experiences from people I know. Works great now, setup was a breeze, wonderful addition to media consumption.", "verified": true, "helpfulness": "1/2", "author": "Prosaic \"SP\""}, {"rating": 4.0, "review": "Shame on Google for \"locking down\" the Chromecast to only a handful of apps.  I have a clone of this that plays any video on my phone.  Not sure why Google doesn't allow it.", "verified": true, "helpfulness": "0/0", "author": "R. Meadows \"cyfan2000\""}, {"rating": 5.0, "review": "Roku= $100.00 ..............But wait, you still need an HDMI cord..so..$100.00 +Apple T.V= $100.00 ..............But wait, you still need an HDMI cord..so..$100.00 +ChromeCast=$35......................................................................................................................The only bad thing I would say is that it does not support as many apps as the others, but I'm sure Google is working on changing that.Conclusion: Get the ChromeCast, it is the bast bang for your buck,streams in FULL HD, and is probably a good investment.- IT CHANGES YOUR DUMB TV INTO A SMART TV!!", "verified": false, "helpfulness": "1/2", "author": "Freedomrings"}, {"rating": 1.0, "review": "**Update**  It's broken.  I tried setting it up multiple times.  I can't get it to work anymore.  I re-installed the chromecast app, I reset the chromecast..  It finds the chromecast, but it won't let it join my network.  It's a brick now.If you want to watch Youtube videos on your TV (and Vimeo now) you can do that.  If you want to look at your own video and photos, get ready to throw your privacy out the window.  There is a way to do it, it's called \"Plex\".  You don't have to have a Chromecast to sign up for it, you can sign up without it.  It seems to me like it requires a direct line into your hard drive.  No thanks.  I'll just plug my computer into my TV with a USB cable like I have in the past.  How sad that it can't do something so simple without making you jump through hoops.**Edit**  You can look at your photos and other things that can be opened with Chrome browser without having to upload.  This option is PAINFULLY slow.  It sends the info to your router and then back to your TV.  It might as well not even exist.", "verified": false, "helpfulness": "0/0", "author": "Richard A. Rossi"}, {"rating": 5.0, "review": "Got my Chromecast after I saw my daughter's on Christmas and was impressed with how easy it was. Got mine, plugged it in and nothing happened! Looked at my Samsung manual. Couldn't figure it out so called Samsung and was told mine was too old (2010) and it wouldn't work. Then talked to Comcast to see if they had any ideas but we just kept getting wrapped around the axle. Back to the Samsung manual and realized I didn't have the correct resolution on the TV so called Samsung once again. Asked how I could change the resolution on the TV and she said it was driven by the input. After some discussion she said 1. plug in the Chrome Cast  while the TV is off. 2. Plug in the Chrome Cast usb to turn it on, 3. The TV turned itself on and was at the correct resolution.VOILA!!! The setup for the WIFI link automatically started. Have both laptops set up now, will start on the phones now. I have to wonder how many of the 1 star ratings are due to this sequencing error?", "verified": false, "helpfulness": "1/1", "author": "terry m"}, {"rating": 5.0, "review": "Turns any non-smart tv into a smart tv . Setup is quite simple but the manual doesn't really state the setup instructions clearly .", "verified": true, "helpfulness": "0/0", "author": "Fadzli Rahim"}]