[{"rating": 5.0, "review": "chromecast is amazing. turns a regular tv into a smart tv", "verified": true, "helpfulness": "0/0", "author": "cody"}, {"rating": 1.0, "review": "I thought this was going to be a godsend but it is a disappointment. It lags, and loses connection constantly out of nowhere. thumbs down.", "verified": true, "helpfulness": "0/1", "author": "Nicole M"}, {"rating": 3.0, "review": "They are ok for what it does.  Personally i'd go with a different solution next time.", "verified": true, "helpfulness": "0/0", "author": "AB"}, {"rating": 4.0, "review": "For the price, this is a pretty slick piece of equipment.  It does quite a lot!  I have been using it mostly to mirror my phone or my tablet so I can stream TV shows or share photos and slideshows with my photography clients.  It has impressed my clients, and it's very portable, so that's a plus for me!You MUST have an HDMI port on your television, and it MUST be near an open outlet.  I did not expect that I would have to have it connected to a power source, but you do.  Other than that, it works pretty much as advertised.", "verified": true, "helpfulness": "0/0", "author": "S.L.S. \"Starks\""}, {"rating": 5.0, "review": "Great deal", "verified": true, "helpfulness": "0/0", "author": "David Velasquez Jaime"}, {"rating": 5.0, "review": "We just like this media player it is cheaper then using cable TV players", "verified": true, "helpfulness": "0/0", "author": "thomas"}, {"rating": 5.0, "review": "I bought my Chromecast last year and I could not be happier. I use it every day. I really don't know how I got along without it!", "verified": false, "helpfulness": "0/0", "author": "AMelchor"}, {"rating": 2.0, "review": "Couldn't get it to work and my daughter is pretty tekkie", "verified": true, "helpfulness": "0/1", "author": "ruby206"}, {"rating": 5.0, "review": "is perfect", "verified": true, "helpfulness": "0/0", "author": "JOSE LUIS ORNA CHAVEZ"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Guillermo"}]