[{"rating": 5.0, "review": "I use this from my ipad and love it. I initially had trouble setting it up as I had to make changes on my router. Once I had that done, it works great.", "verified": false, "helpfulness": "0/0", "author": "Dorothy"}, {"rating": 5.0, "review": "Very Good Thanx Dan", "verified": true, "helpfulness": "0/0", "author": "Dan M."}, {"rating": 5.0, "review": "I use this when travelling so I can stream netflix and tv shows onto the hotel tv instead of looking at my tiny laptop screen. The newer updates seem to be fixing most of my issues with lag. Plus the artwork/photos are really cool.", "verified": true, "helpfulness": "0/0", "author": "Otis"}, {"rating": 5.0, "review": "Muy buen producto", "verified": true, "helpfulness": "0/0", "author": "EDISON TRONCOSO"}, {"rating": 5.0, "review": "Simple! Easy! Quick! Works great! No problem so far! Love it. No need to have cable now :)", "verified": true, "helpfulness": "0/0", "author": "Hye Lim Shin"}, {"rating": 3.0, "review": "We don't use this much.  It doesn't work very well with our Microsoft products and phones.", "verified": true, "helpfulness": "0/0", "author": "golden larson"}, {"rating": 4.0, "review": "I was skeptical since my other TV's were Smart and had direct internet access, but this was really easy to setup and use. My only issue is that Google isn't partnered with Amazon Prime. We just watch Prime on our other TV's. We have Roku also but Chromecast seems easier to use and more versatile.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "good product and fast shipping .. bye", "verified": true, "helpfulness": "0/0", "author": "Juan Carlos Ruggiero"}, {"rating": 5.0, "review": "Got this for my daughter when she returned home from college for the summer. I had her cableturned off in her room and used this for a replacement, being that all she ever watch is Netflix...and she can take it with her, when she returns this fall.....", "verified": true, "helpfulness": "0/0", "author": "~ELENA~ \"Elena\""}, {"rating": 5.0, "review": "I loved it, work very well and is easy to install and use. It would be great to have more mobile applications with support for Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Isaías Gätjens M"}]