[{"rating": 5.0, "review": "I love this.  It is so easy to use, and has made viewing things like Amazon Prime shows and Hulu shows so much easier.  It even helps my sound system work better.", "verified": true, "helpfulness": "0/0", "author": "Terri Hook"}, {"rating": 5.0, "review": "We love it!  It is fast and the little remote is small and elegant. We highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Susan J. Schmitz"}, {"rating": 4.0, "review": "I would love to give this a 5 star rating, as it is ALMOST a perfect device. Great video quality, good collection of apps, decent service, however, many shortfalls that really are easy for Amazon to address if they choose to.1. USB - no reason you couldn't use this for an USB thumb drive or hard drive. In fact there are proof of concept rooted Fire tv's that are doing this. Unfortunately the Amazon updates will break rooted devices, so that is not a good option (and seriously, we shouldn't have to root a device to use it to its full potential). Amazon really needs to address this to compete with Roku's and networked Blue Ray players if they really want to be the leader. Just little things like looking at pictures, or watching something offline... An SD card reader would be good (USB adapter fine) to review pictures from a camera...2. Apps, still pretty restricted on this. Really tied into their main screen for the purpose of Amazon selling you content. I use this for Netflix, HBOGO, and while Amazon prime is great that is not the only offering so these others deserve to be integrated (aka, voice search) as well. Again, disadvantage to Roku on Chromecast. Also, I should be able to load any apps I bought from the Amazon App store (or really Google Play, but I see where they're coming from) onto this (without having to do a whole sideload). This will be a major disadvantage when other Android tv devices come out without the Amazon restrictions.3. Speaking of Apps, HBOGO, while working for others is blocked by Comcast/Xfinity, sort this out guys, I don't care who's in the right, just make it happen.4. Games, be warned you have to buy a controller to use them. Now, doesn't have to be a firetv controller, it could be an XBOX 360 wired controller, or a wireless receiver for xbox, or a Logetech F310, so you have options, kudo's for that, but you still need a controller. Would also be nice if there was more options on wireless mice (although good job with apps for Android controllers that work well with it.5. Coins, alright, has absolutely nothing to do with Fire TV but still, would be nice to be able to get say 10 cents when you need it, you buy coins and get apps and earn coins and then find you are 5 coins short of what you want, so only choice is to buy 500 more? Cut us some slack...6. An OFF button, seriously, I like to be able to turn things off and having to do it with a power strip is silly. Standby would be fine as well.Anyway, other than that I love it. I still like having a smart tv but performance wise with my second tv is as good and sometimes better. I like the fire tv specs significantly over the fire stick, especially come holidays when they threw it on sale. I say we continue to hound Amazon to fix these tweaks and they should be the dominant player in home streaming. Some things like USB drive access, App or Play access might end up being the distinguishing factor for their competition, again as more Android TV devices hit the market.", "verified": true, "helpfulness": "1/1", "author": "Edgar"}, {"rating": 5.0, "review": "While I had high expectations for the product, that my wife loved it from the very first moment that she started to use it sold me on it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "We received a Fire TV for Christmas, and so far there are many things we like about it.  We upgraded from an earlier generation Roku.  Pros: the quality of the picture is outstanding.  In addition to Prime video, it accesses all of the apps that we use the most (ESPN, Netflix, Pandora).  The remote is very nice.  I also like the feature that allows me to zip a show I'm watching on my iPad to the Fire TV (it doesn't always work, though…seems to have some bugs).  Cons: The interface is confusing and centered on Prime.  The fact that it's centered on Prime was no a surprise, but it is not easy to navigate from app to app or even types of shows/movies.  I think Amazon could work on making it more stream-lined.  Second- and this is a big one for us- my husband has very low vision and the interface is much too text heavy with small font to boot.  It's not great for people with visual impairments.  Too much text, too much going on on the screen, and difficult to navigate.  We are considering switching to a Roku 3, but it has low reviews...", "verified": false, "helpfulness": "0/0", "author": "LTK"}, {"rating": 5.0, "review": "Love it...I may get another for the bedroom tv.Works perfect", "verified": true, "helpfulness": "0/0", "author": "Sandra Freel"}, {"rating": 4.0, "review": "Really enjoying this, and I'm no technical type.  It's easy and fast, with lots of opportunity to binge.Great product.", "verified": true, "helpfulness": "0/0", "author": "Cheryl Stafford"}, {"rating": 4.0, "review": "Just wonderful.  Better than Apple TV  Easy to use and lots more of everything.", "verified": true, "helpfulness": "0/0", "author": "Robert J Schrader"}, {"rating": 5.0, "review": "We love our Amazon Fire Tv! It clear and fast and just what we needed to have access to all our favorites at the touch of a button with voice command.", "verified": true, "helpfulness": "0/0", "author": "jhschick \"Heather Schick\""}, {"rating": 5.0, "review": "Love Amazon Fire TV.  Lots of content, great reception.", "verified": true, "helpfulness": "0/0", "author": "Jackie"}]