[{"rating": 3.0, "review": "It is a neat product in theory but doesn't really work as well as expected. For the price there is no way you can go wrong though.", "verified": true, "helpfulness": "0/0", "author": "ABailey8833"}, {"rating": 5.0, "review": "Better than sliced bread.  Liked the first one so much we bought 3 others for gifts.  Simple instructions to get started.", "verified": true, "helpfulness": "0/0", "author": "Barbara Farr"}, {"rating": 5.0, "review": "Friend on Facebook posted this; my daughter commented that she wanted one, so I purchased it for her Christmas Gift.  She loves it!", "verified": true, "helpfulness": "1/1", "author": "Carolee Del Re"}, {"rating": 5.0, "review": "Google DOES rule the world. Once set up it is really easy to cast youtube or netflix to your tv. I would highly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "This is great technology.  Netflix that night of \"Intouchables\" on couch with Sweetheart instead of huddled around laptop.Great buy!", "verified": true, "helpfulness": "0/0", "author": "Grace P. Olrun"}, {"rating": 5.0, "review": "Works great as push-to-tv movies played on google's chrome browser. Wish chrome would use more formats in coordination with CTRL+O for playing local file to tv.", "verified": true, "helpfulness": "0/0", "author": "customer"}, {"rating": 5.0, "review": "Absolutely love this product. With the new app addictions it fits my lifestyle perfectly. Don't have a smart tv in my living room and this pretty makes up for it.", "verified": true, "helpfulness": "0/0", "author": "Octavius Todd"}, {"rating": 1.0, "review": "I'd rate this pile of garbage a negative infinity if I could. I would expect better from Google. This product is crap!  DO NOT BUY!  I want my money back.I have to factory default reset the device every time I want to use it. I have restarted the device, and uninstalled the app from my end devices. I use a Samsung Galaxy S4, iPad mini,  & IPAD 3. I cannot use any of them.  They cannot find my device, even though it is connected to my WiFi with full bars. I am using the WiFi \"booster\" adapter also. The dongle gets incredibly hot, and I wouldn't be surprised if it catches fire soon. I am warning you,  this product is garbage. DO NOT BUY!!!", "verified": true, "helpfulness": "1/2", "author": "White GhostZ"}, {"rating": 5.0, "review": "For $35 I have a device that streams movies to my TV from my IPad.  I think that's cool.  I had to buy new cables for my older flat screen TV to free up the HDMI slot for the Chromecast (thanks to a \"nerd\" at Best Buy), but that was a no-brainer. Yea, Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Barbara Sullivan"}, {"rating": 2.0, "review": "From my lenovo laptop, its not streaming properly. And also it is disconnecting chromecast connection lot of times when running the program from laptop.But, if you use iphone, its working fine.I don't know how it streaming from other laptops?Please be careful when you buying this product.", "verified": true, "helpfulness": "0/0", "author": "Gopal Voruganti"}]