[{"rating": 5.0, "review": "This and Netflix has totally changed the way we watch TV -- As in, we watch TV now.  Must have.", "verified": true, "helpfulness": "0/0", "author": "Jon F."}, {"rating": 5.0, "review": "I did not end up buying this on Amazon, because I wanted it before I left on a trip and did not want to pay extra shipping...anyway.. loved it so much I bought a second one when we got back.PROS:-So simple to install, even an apple person can do it ;-)-Streams well on the core sites they advertise for it-Really inexpensive, and really easy to carry.. we used it on the trip to show some pictures to friends and family on their HD TVs worked with everything we plugged it into.- Casts pictures that you have on your phone/sd card really well- Converted a power point preso to a format it could handle and was able to use it for a presentation via casting.. pretty cool..CONS:- Needed an additional app to cast from the general storage on our cell phones..but it was free- Not able to effectively cast all video's from our phones.  Strangely the videos we took on our phones would be choppy when played back / casted. But movies we downloaded worked fine.  Tried it on two separate phone apps, one paid one free, same problem. We have Samsung phones...so not sure what this issue is about... but frustrating.- With the native software it will not rotate videos or make them bigger or smaller to fit the TV screen.. get a companion app and it works fine (we used: LocalCast great app more features that the paid ones.. must downlod)  So overall, great buy and we are very happy with the purchase. It is so nice to take with you to the grandparents house and simply plug and play and show the newest grand kid pics.  Simply a must buy... If I only had the patience, I could have saved $4 by buying it on amazon. They will get my next purchase.. i will be giving theses as gifts in the future.Enjoy Cheers.", "verified": false, "helpfulness": "0/0", "author": "Matt"}, {"rating": 4.0, "review": "I bought the Chromecast when it was a few bucks off list price last week. So far, I'm not blown away by its capabilities or features, however, it does fill a niche void that I didn't realize was there. The setup was painless, and how it interacts with my phone and the phones apps is pretty seamless. I've only tested it with Netflix thus far, and the streaming frame rates definitely don't *look* 1080p, even though it assures me they are. Call me dubious. Another annoyance is when I start to 'cast a Netflix stream to my TV, it seems that I have to press \"play\" through the Netflix App, then again from the pull=up/pull-down Chromecast menu. This happens irregardless of whether I click the Chromecast button first, or last. Could just be a quirk with my phone (Samsung Note 3).Disclaimer: all of my TV's are dumb. However, they all have a Windows PC attached to them with full keyboards and mice in tow. We recently put a TV into our workout room, and decided against a full fledged \"smart tv\", for various reasons. I also didn't want to deal with another PC in that area. Because of that, I was cross shopping this and a Roku Streaming Stick (2014 - HDMI), when i decided to just pull the trigger when the Chromecast was on sale. After all, it was only thirty bucks...not exactly a big leap (not that it was at $35 either...).Although, I haven't tried the Roku stick yet, I'm pretty confident that we'll end up moving on to something with build-in apps and a dedicated remote. The need to have your device with you at all times to make changes, is a little iffy given our situation. The fact that you'll be drawing power from your phones battery, and fairly quickly in my case, leaves a little to be desired. Sure, I could plug in the phone at the same time, but that takes away from the convenience.With that said, I wont be returning the Chromecast. I could definitely see it being useful while on trips to the in-laws, or while on a business trip. In any case, definitely worth the low cost of entry, and it will be even more so once developers take advantage of the API.", "verified": true, "helpfulness": "0/0", "author": "JRad"}, {"rating": 5.0, "review": "Always wanted to own a Google Chromecast HDMI Streaming Media Player And what I ordered was a Google Chromecast HDMI Streaming Media Player which is exactly what I got :I", "verified": true, "helpfulness": "0/0", "author": "Karl Löve"}, {"rating": 5.0, "review": "i ordered this device because with my other connected devices(roku, ps3) i could not watch hbo go because i have comcast and they are a bunch of big smelly jerks. hbo go streams from my phone or tablet to this with no problem.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy to use with my phone or laptop.  Just wish it could be used to cast videos from iTunes or other browsers.", "verified": true, "helpfulness": "0/0", "author": "Christina M."}, {"rating": 4.0, "review": "I like watching netflix and youtube videos. This was an easy set up and now I'm watching all of those HD quality. Send it up from the phone or the chrome book.", "verified": true, "helpfulness": "0/0", "author": "Tad Caudill"}, {"rating": 5.0, "review": "Yes it's that great. The device is exactly what I wanted, besides the side effect of being more lazy.  Biggest woohoo moment is that my sound system doesn't have a remote. Being that this allows you to control volume on your device. I am surprised no one else has used this as a sales point.  You will not regret buying this. So cool.", "verified": true, "helpfulness": "0/0", "author": "Thatdude"}, {"rating": 5.0, "review": "I love my Chromecast. Especially now that the SDK is open to developers, more and more apps are able to take advantage of it. Being able to cast YouTube videos wirelessly is a breeze, and I even bought one for my parents (who appreciate its ease of use as well).I think this device still has lots of room to grow, and look forward to seeing how it matures.", "verified": true, "helpfulness": "0/0", "author": "T. Davis"}, {"rating": 2.0, "review": "Does not get casted from my laptop into to the TV. I have raised ticket to google support which has not been addressed even after a month", "verified": true, "helpfulness": "2/2", "author": "anil katarey"}]