[{"rating": 5.0, "review": "This seriously might be the best purchase I have ever made in my life. Why would you drop $100+ over a media box that can't really do what this can do? THIS THING IS THIRTY DOLLARS! Stop thinking of reasons to not buy one and just give it a chance. You quite literally have nothing to lose.", "verified": true, "helpfulness": "0/0", "author": "Carlos Coro"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "phillip f butchers"}, {"rating": 5.0, "review": "don't write well in English", "verified": true, "helpfulness": "0/0", "author": "Cristina tineo"}, {"rating": 5.0, "review": "Awesome product ... recomment this for tv that is not that smart.This will fulfil the need ..", "verified": true, "helpfulness": "0/0", "author": "Venkatesh"}, {"rating": 1.0, "review": "This thing sucks, it's only good for watching netflix. It loses connection to my computer(2 feet away) all the time, can only stream local files up to 720p quality(no 1080 support) and the programs available to support streaming local files to your TV lose sync between video and audio if you try to rewind or fast forward at all.  I wish I had picked one of the other streaming media player options...going to use this as a skipping stone and try something else.", "verified": true, "helpfulness": "0/0", "author": "Ryan S."}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Ed Douglass"}, {"rating": 5.0, "review": "5 minutes at most to set up.  I have mine plugged into the back of my receiver as the HDMI port on my TV is inaccessible due to it being mounted on the wall.", "verified": true, "helpfulness": "0/0", "author": "Robert K."}, {"rating": 2.0, "review": "Get a Roku if you want better apps, etc.", "verified": true, "helpfulness": "0/0", "author": "YamesBaskets"}, {"rating": 4.0, "review": "it's just fun. My daughter enjoys watching youtibe videos on TV screen.", "verified": true, "helpfulness": "0/0", "author": "Oscar Arce"}, {"rating": 4.0, "review": "The Chrome is good, but it needs a more responsive control system. We use a Chrome on two different TVs and use our Android phones to control them. I really enjoy using the Chrome with things like HBO GO, but if I am watching a show and need to pause, waking up the phone and getting the Chrome to pause, and stay paused, sometimes takes too long and I have to tell folks on the phone to hang on while I wait for the show to pause. I since then have bought two Amazon Fire Sticks, and the remote that comes with them is exactly what is needed with the Chrome. HBO GO is not yet available on the Fire Stick, that, and how much easier it is to get some of my home media to stream to the Chrome means that the Chrome wins out in these areas. It is a hard choice between them, and I use both the Fire Stick and the Chrome, but if I am streaming something that I can get on either the Chrome or Fire Stick, the Fire Stick is my choice due to its remote.", "verified": true, "helpfulness": "0/0", "author": "David C. Harris \"davethekey\""}]