[{"rating": 5.0, "review": "I purchased the box about a month ago and have been very pleased with it so far. It is very easy to set up and use. The voice search function works great! I look forward to any future new channels and apps!", "verified": true, "helpfulness": "0/0", "author": "Kimberly A Look"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "ERNEST DELOSSANTOS"}, {"rating": 1.0, "review": "Don't buy!!  Signed up with Sling TV and used this, does not work.  It continuously buffers.  Good luck trying to watch anything.", "verified": true, "helpfulness": "0/2", "author": "Angelo Strazzera"}, {"rating": 5.0, "review": "Item as described.  Fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Mark E. Liszeo"}, {"rating": 4.0, "review": "You can only stream one album at a time. You must then select another album to continue. Annoying when you listen to music at home. The selection process is very fast.", "verified": true, "helpfulness": "0/0", "author": "William C. Karg"}, {"rating": 1.0, "review": "This is the outcome of pure IGNORANCE! HAVE NONE OF YOU ALLOWED THE GRACE OF THE LAWD SHED UPON YOUR VERY EXISTENCE!? THIS IS THE TOOL IN WHICH THE ARMY OF SATAN USES TO CONTROL HIS HOARDS OF TREACHOROUS BEASTS OF MEN! AND YOU DARE CALL THIS ENTERTAINMENT!? THIS IS SATANIC INDOCTRINATION AT ITS DAMN FINEST! I PURCHASED THIS OBJECT OF FILTH WITH MUCH REGRET! HEAR, YE, THIS SHALL BE MY ONE AND ONLY WARNING!", "verified": false, "helpfulness": "0/13", "author": "Example: Mark Twain \"FLIMPAMPO!!\""}, {"rating": 1.0, "review": "I am very disappointed with the fire TV.  I have Roku and ATT uverse.  I chose to purchase the fire TV because I use amazon for all my purchases.  The device is substandard.  The sound quality is in and out.  The control is hit and miss.  It works perfectly and then it seems to have a mind of its own.  I should have just gone with another Roku.  I use all your AWS services for me and my business so I assumed it would have been tested.  This device is a beta device at best.  You should be have never let it reach market.", "verified": true, "helpfulness": "1/3", "author": "Jason Cousins"}, {"rating": 5.0, "review": "love it!!", "verified": true, "helpfulness": "0/0", "author": "tifdea"}, {"rating": 5.0, "review": "Great product. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Christopher Crowley"}, {"rating": 5.0, "review": "We love Amazon Fire T.V. We use an HD antenna for all our local channels, buy some cable shows on Prime and also use Hulu and Netflix. This is the future of TV watching and it has saved us a considerable amount of money overall annually. It was well packaged and arrived on time.", "verified": true, "helpfulness": "1/1", "author": "Alicia Baker"}]