[{"rating": 5.0, "review": "I love this. I have this tv portal app on my phone. Now i can watch movies and shows on my tv. Love it. Dont really use it for netflix or anything because i can use my ps4. But this is great", "verified": true, "helpfulness": "0/0", "author": "Eneka D. Dennis"}, {"rating": 5.0, "review": "Great for watching Netflix, Hulu, and Chomecast approved apps.Does not support Xbox or Playstation gaming. Certainly does not support windows.Not designed to prop open windows, Can be used as a paper weight when not in use.Overall five stars.", "verified": true, "helpfulness": "0/0", "author": "Cleveland"}, {"rating": 2.0, "review": "This device is only useful to play youtube.  Roku is far superior on everything else.  I do love Youtube.  Chromecast Youtube is far simpler than Roku.  In that one respect, it's better.  It's too expensive for just YouTube.  It should be $10, I paid $30.  I thought it would do more and be easier to use.  It's not really difficult, but to use it for one channel, you have to think it thru everytime.  Again, unless you love YouTube, buy Roku instead.", "verified": false, "helpfulness": "0/0", "author": "Scotty700"}, {"rating": 1.0, "review": "Did not last very long.", "verified": true, "helpfulness": "0/0", "author": "Laura Vaporean"}, {"rating": 5.0, "review": "cool little device", "verified": true, "helpfulness": "0/0", "author": "S. Cohen"}, {"rating": 5.0, "review": "Like everything Google does, it's sleek and works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Pascal Renault"}, {"rating": 5.0, "review": "Got this for the pops for fathers day, he loves it! Easy to stream your favorite media onto the TV.", "verified": true, "helpfulness": "0/0", "author": "zach"}, {"rating": 5.0, "review": "If you don't have at least 1 of these you are missing out!", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "I have always been a Google person and I have bought multiple good chromes. I have never had an issue with it and recommend it to anyone looking for a streaming device", "verified": true, "helpfulness": "0/0", "author": "Zack"}, {"rating": 5.0, "review": "easy setup", "verified": true, "helpfulness": "0/0", "author": "tina bierhal"}]