[{"rating": 1.0, "review": "Defective right out of the box. Tech service said they would get back to  me in 2-3 days with an update. The proper response would have been we will ship you a new one immediately and send you a return label for the defective one.", "verified": true, "helpfulness": "4/8", "author": "Jeff Ferguson"}, {"rating": 5.0, "review": "I've mostly cut the cord on Cable-TV (I still have limited service in my living room) but have this in the bedroom. Netflix, Amazon, Twitch.tv, and Plex to stream my personal collection = AWESOME. The hardware is very well designed and I love the minimalism of it and wish every bit of hardware I owned could be made of the same rubberized plastic that the remote is made of. Well worth the money I really couldn't be happier with this box.", "verified": true, "helpfulness": "1/1", "author": "Jedi"}, {"rating": 1.0, "review": "the item was returned as it duplicated what I already had - it should be taken out of the reviews", "verified": true, "helpfulness": "1/18", "author": "Ed L. \"wood butcher\""}, {"rating": 3.0, "review": "Once you get around to consuming content, it's great. The voice search is great for searching Amazon content, but if they truly supported Hulu, Netflix, etc., the search results would cover those options as well. So I have to search on Netflix, and then if that doesn't work, check Prime. And netflix searching is tedious with the remote.I got the game controller, played their opening game, and it was immediately clear they were not serious about video games.I got the twitch.tv app, and even though they've aqcuired twitch.tv, the video quality is unacceptable. The old xbox 360 twitch app is better, and neither compare to using a computer.Watching shows and movies works great though, quality is fine.", "verified": true, "helpfulness": "1/1", "author": "Adam Overton"}, {"rating": 5.0, "review": "easy to set up!  the only thing that irritated me is you may be watching a series, eg Doc Martin, via prime and all of sudden they start charging for that show!  A heads up would be great. When I called to lodge a complaint they did give me my money back on the one episode and let me have the rest of the season for free.", "verified": true, "helpfulness": "2/2", "author": "Oshuna Oma"}, {"rating": 4.0, "review": "My amazon fire tv solves many streaming problems for me, my only problem, and something that I developed after I bought it, is that it doesn't support (or I don't know how to enable) bluetooth audio.", "verified": true, "helpfulness": "1/1", "author": "Phil DeVeau"}, {"rating": 5.0, "review": "I can honestly say this device is awesome.  Very simple to set up and even more simpler to use not to mention the discount price of $85 bucks Amazon offers from time to time.  Enough said, and thanks for reading.", "verified": true, "helpfulness": "1/1", "author": "Tin Zaw \"lashionative\""}, {"rating": 5.0, "review": "Works as advertised !", "verified": true, "helpfulness": "1/1", "author": "Robert C McClure"}, {"rating": 3.0, "review": "Works well enough.  Fast processor.  Voice search is very good with the exception it will not search anything but Amazon.  If you have Netflix or another app, you have to use their search feature. Also cannot limit search results to Amazon Prime like you can on other devices.", "verified": true, "helpfulness": "1/1", "author": "JeffMac"}, {"rating": 5.0, "review": "We love it, guess we'll have to get another one for our other TV, when will we have access to HBO?", "verified": true, "helpfulness": "0/0", "author": "BNowell"}]