[{"rating": 5.0, "review": "It was easy to setup, and plays netflix and youtube videos just fine. I am really hopeful now that they opened it up to developers for more apps. A twitch app would be great!", "verified": true, "helpfulness": "1/1", "author": "JRW"}, {"rating": 3.0, "review": "it works as advertised, but you need to have the apps on your phone or tablet loaded before it will work.", "verified": true, "helpfulness": "0/0", "author": "jimbobmcclan"}, {"rating": 5.0, "review": "Love everything about this product. One of the best gadgets Google made! I do wish Google would make it so this a can stream other content aside from the net..", "verified": true, "helpfulness": "0/0", "author": "Eric Coachman"}, {"rating": 2.0, "review": "A multibillion company such as Google, can and should do better than this. The cheap Vizio smart TV that I have does the same thing already. What a waste of my money. I guess I'll have to wait for some company like Apple to show the rest of these jokers how to do things right (although Apple's been dragging their behind too). The technology exists to do great things with this, so it's not that, I don't get it, what am I supposed to do with this thing? I gave a two star because the physical quality seems good.", "verified": true, "helpfulness": "0/0", "author": "Gary Campla"}, {"rating": 1.0, "review": "We were looking for a device which would allow us to live stream content from a laptop to the television without having to plug the laptop into an hdmi port. We set this thing up and started streaming, but it was very herky jerky and hard to follow. Videos always appear more jerky than the feed. Then, although it is possible to start a video and do other things with the laptop, the interface doesn't allow you to view the video in full screen. You have to have the stream open in a google chrome window with full screen selected, and as soon as you try to alt-tab to another task the video goes out of full screen on both the laptop and the television and you have to watch a tiny window. We may try to use it when traveling so we don't have to walk over to the television every time we want to change something, but if it doesn't work better than it has, we'll stick with carrying an hdmi cable...Well, we tried taking it on a trip, and the hotel where we stay didn't allow peer to peer connections on their network. We travel with a ton of animals and really like our hotel, so going elsewhere is not an option. Since we have HDMI enabled laptops and a neotv, this thing is useless for us.", "verified": false, "helpfulness": "0/0", "author": "MikosMom"}, {"rating": 1.0, "review": "I have contacted Google Customer service but I have been disappointed with this product. The time it takes to load is long and most times it does not load. I prefer my Roki. I am ready to send this back or just toss it!", "verified": true, "helpfulness": "3/4", "author": "Arye Berk"}, {"rating": 4.0, "review": "I Use thing all day, everyday. I mostly use it for YouTube and Netflix and occasionally I stream my downloaded videos and photos on am app called Avia.", "verified": false, "helpfulness": "1/1", "author": "jessie vargaz"}, {"rating": 4.0, "review": "let me start off with the most important thing, I like my Chromecast, HOWEVER, I find myself loaded with complaints. for starters, it often crashes but Im not sure if that is the internet connection or the devices. Also I knew what i was getting in buying it, that i would be very limited on the apps that I could stream to my Chromecast, yet now that I have it, it has proven to be quite a disappointment, essentially, I what to be able to stream more apps, all of them if possible but more particularly the gallery (photos). Lastly the most disappointing thing i found was the incredible slowness and glitches with I connected my laptop to it. aside from these complaints I use it very often and I greatly appreciate the images that posted while it is idle.", "verified": true, "helpfulness": "0/0", "author": "Manuel T. Castor"}, {"rating": 5.0, "review": "I bought two and I love how you can load them both on one device and switch programs from another room......I can watch some of my movies from my tablet and that is great because i dont have to use the HDMI", "verified": true, "helpfulness": "0/0", "author": "daisy may"}, {"rating": 5.0, "review": "I got a Chromecast as soon as it was announced so for 30 bucks I figured it was the perfect Christmas gift for a friend of mine. I was correct and they love it.", "verified": true, "helpfulness": "0/0", "author": "Eric"}]