[{"rating": 3.0, "review": "Have had a lot of problems with this, one day it works the next day it doesn't. Could be a router issue (Verizon FIOS router) but I implemented every recommended setting for my particular router/setup. When it does work it is awesome.", "verified": true, "helpfulness": "0/1", "author": "Person who bought stuff"}, {"rating": 5.0, "review": "Bought this as a gift for my boyfriend and it is absolutely amazing to have in the house! With the new updates coming up for it that were announced at Google I/O, the Chromecast was a definite must have.", "verified": false, "helpfulness": "0/0", "author": "Trisha G. \"Honto ni?\""}, {"rating": 3.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "charlesmossburg"}, {"rating": 4.0, "review": "Doesn't work at hotels but if all you want to do is watch Netflix at home this is for you. You can even stream Pandora. It's very fun to take control of the Chromecast with multiple devices (especially when you are the one kicking someone else off) but that can also be a downfall.  No remote to lose so that's a plus. Just learned this weekend though that it won't work on the wifi at most hotels so that's a huge drawback for me. You also can't mirror Apple devices so if you are an Apple person shell out another $50 and get the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Mark Morr"}, {"rating": 4.0, "review": "Cheap & Easy; Needs a Spotify App", "verified": false, "helpfulness": "0/0", "author": "RailHawksFC"}, {"rating": 1.0, "review": "Terrible connection problems", "verified": true, "helpfulness": "0/2", "author": "Leo"}, {"rating": 4.0, "review": "Cuts out a lot more than I'd like from a phone or tablet.  Seems much more steady when cast from a PC.  Watching a sporting event through WatchESPN is quite painful...", "verified": true, "helpfulness": "0/0", "author": "Ryan Winston"}, {"rating": 5.0, "review": "Love this device! So useful and easy to use with my household devices Android, iPhone, iPad and computers.", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 5.0, "review": "good deal", "verified": true, "helpfulness": "0/0", "author": "raj7070"}, {"rating": 3.0, "review": "Well it's ok but sometimes it work", "verified": true, "helpfulness": "0/0", "author": "maurice jackson"}]