[{"rating": 4.0, "review": "I installed the software for the Chromecast on my computer and iPhone. It was a bit glitchy to set up, but after setup it was fairly easy to use.  The information for the devise says that you can start a video on your computer and then use your iPhone to stop or start the video, but this is way to cumbersome.  There is no way to pause the video, so you need to stop the video and then start it on the second devise where it loads again.  And while you are doing this it is using two of your subscription devises on Netflix.  I decided to stick with one device to control the video, and it works great except for not being able to pause the video.  Hopefully Google will update the software to handle that.I am pleased with Chromecast overall and since I only plan to use it for Netflix, I haven't tested the other features.  And because it is so portable, I will be able to easily move it to another TV.  And when I buy a new HD TV, it won't have to be a more expensive Smart TV.  Keep in mind that Chromecast is only 720p so will not take full advantage of your 1080p TV.  It is powered through your USB port on your TV, but if you don't have a USB port it comes with an AC plug.  I wanted to be able to watch Netflix on a television that is not a Smart TV, and did not want to buy a DVD box that is Netflix capable, and it provides that service for me.", "verified": true, "helpfulness": "0/0", "author": "Midnight Reader \"Pallas\""}, {"rating": 4.0, "review": "A while transpired before I elected to purchase Google Chromecast HDMI Streaming Media player. When browsing around the internet and amazon.com between Black Friday and Cyber Monday I noticed this dongle was marked down to $29 and change with gratis shipping. Apparently, I was in a fine mood that day clicking it into my cart.As usual product was delivered quickly and in excellent condition. Once parcel had acclimated to the room's environment I installed on the living room TV. This was an exhausting process as one must plug it into a HDMI port, plug the power cable into a free USB port and opposite end of USB cable into the Google Chromecast dongle. Less than a minute in actual time . . . then a swift installation of the Google Chrome Browser and inputting code broadcasted on TV screen the process was completed.Yesterday I gave Google's Chromecast HDMI Streaming Media Player a workout, it handled everything thrown at it without issue. I could not be happier in its ease of installation and use. In addition, it actual functions as stated with a quality feel and construction.PROS:AttractiveCompactSolid ConstructionSolid weightMinimal partsEasy SetupEasy Installation of Chrome BrowerWorked without issueReasonably pricedCONS:There is approximately 1 to 2 second delay in image and sound when viewing computer screen and TV screen simultaneously. Miner -- NOT an ISSUE to deter anyone from purchasing.It would have been nice not to have to install another browser because I prefer Microsoft's IE browser.Again, miner -- NOT an ISSUE to deter anyone from purchasing.Given what I have stated here, I am planning acquiring more for additional TVs with a spare for travel.DIGITAL SIGNATUREI like to close my reviews with a THANK YOU because I do appreciate you investing your precious time in reading my material. We live in a complex complicated world where time is at a premium. I do pray you found this review like my others informative and helpful in aiding your next purchasing decision. Your comments are always welcome and I make every attempt to reply to comments as time permits. Again THANK YOU for the opportunity to aid you in spending your hard earned money wisely.I am not employed or receive any compensation by the manufacture or any organization promoting this product or additional hardware. I purchased or received as a gift my product like anyone else and just sharing my myriad thoughts and experience with you.I hereby extend to you a plethora of blessing of good health and welling being. Bless you all.2013 Copyrighted by Dr. Gary Drury", "verified": true, "helpfulness": "0/0", "author": "Gary A. Drury \"Techman1\""}, {"rating": 4.0, "review": "Just an incredible device with so much potential.  Makes watching from multiple sources online very easy with limited setup. This can only get better from here.", "verified": true, "helpfulness": "0/0", "author": "ManOnTheEats"}, {"rating": 3.0, "review": "I was so hopeful for this little device.  I was ready to stream our personal videos and pics so we could share when we visited family.  This fell way short.  It only streams a couple of specific apps on both iPad and Chrome, making it useless to our family.  Real disappointed.", "verified": true, "helpfulness": "1/1", "author": "Jess Dean"}, {"rating": 3.0, "review": "Chromecast is very easy to setup and easier to use.  Appears to be a highly portable, quality, reliable device for streaming video from a source device such as a PC, tablet, or smartphone, but there are some limitations.  For me, the inability to stream Amazon Prime instant video is one of those limitations, but not as significant as not being able to stream in a typical hotel environment.  In order to affect streaming, your source device and Chromecast must be able to communicate with each other on the same network - not a problem at home.  While hotel networks will generally permit network access by more than one user device at a time, they typically do not permit two user devices to communicate with each other for security reasons, so if you want to view a Netflix movie via Chromecast, you will have to do so with your smartphone set as a wireless hotspot.If and when Google can resolve the above two issues, then this would truly be a five star device!", "verified": true, "helpfulness": "1/1", "author": "Charles D"}, {"rating": 5.0, "review": "Great product from Google. I have been using this for last 2 months and love chrome cast. I use my Samsung Galaxy Note to cast Netflix, Youtube etc. without a problem.", "verified": true, "helpfulness": "0/0", "author": "bj"}, {"rating": 5.0, "review": "Don't even think twice.  Best device, best price, easy installation.  A no-brainer!  Forget paying extra for apps on a TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Norma J Norris\""}, {"rating": 5.0, "review": "Great device for viewing Netflix, Hulu+, and Google Play movies/shows on your own TV. Very convenient!!! And makes viewing much better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Chromecast is awesome and easy to use! I ordered a second one shortly after receiving and testing the first. Great product!!!!!", "verified": true, "helpfulness": "0/0", "author": "03banana"}, {"rating": 1.0, "review": "this device frequently losses connection. It is very frustrating. does not perform as expected. i would not recommend this device.", "verified": true, "helpfulness": "0/3", "author": "darren"}]