[{"rating": 5.0, "review": "Great resource - easy to use", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "Easy to install", "verified": true, "helpfulness": "0/0", "author": "nn"}, {"rating": 5.0, "review": "Excelent! I highly recommend this seller!!", "verified": true, "helpfulness": "0/0", "author": "leandro"}, {"rating": 2.0, "review": "For my iPad, it only works for certain apps. For my Android phone, it will show the screen itself. It's awkward to use for web browsing and the like because I have to keep looking back to my phone to input things. Better to just stick to playing video or get a smart tv to begin with. Not much different from connecting a device directly with a HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Watanabe Poemi \"Poemi-chan\""}, {"rating": 5.0, "review": "Love this thing works just as advertised", "verified": true, "helpfulness": "0/0", "author": "Victor Nguyen \"John Nguyen\""}, {"rating": 5.0, "review": "I hate this it did not work at all and if it didn't work it all, to work perfectly it will have to be connected 24 seven to why five and if you turn your phone are your iPod off because that's basically the remote for it stops working because your phone automatically disconnects it and it does it always stays connected to the TV is stop showing the show that you were watching I did not like it", "verified": true, "helpfulness": "0/1", "author": "melisa x3"}, {"rating": 1.0, "review": "Ours worked for about 3 months flawlessly. At first, we used it pretty regularly to stream Netfix and Hulu. Then we replaced our main TV with a smart TV and stopped using the Chromecast for several months. Recently, we decided to connect it to one of our other TVs. It would stream for 5-10 mins then stop and disconnect/drop the connection on its own. We've tried resetting it and setting it up over and over again, but to no avail. It's just maddening to try to use this thing. I've researched online for help and I just find endless forums of folks with the same issues with their Chromecast but no solutions so far. Needless to say, Google customer service is non existent! Spare yourself the frustration and don't waste your money on this!!", "verified": true, "helpfulness": "0/0", "author": "North of 30 \"North of 30\""}, {"rating": 3.0, "review": "lots of disconnect issues!  usually only works for about 30 mins then have to cycle the router and browser.when it works it is amazing!", "verified": true, "helpfulness": "0/0", "author": "Anthony Puma"}, {"rating": 5.0, "review": "Love this gadget.", "verified": true, "helpfulness": "0/0", "author": "Justin Huffman"}, {"rating": 1.0, "review": "I got the Google Chromecast as a gift last Christmas. I'm pretty tech savvy, and after a few minutes to set up, I was ready to start casting from my pic, to my computer...or was I? It turns out that only the latest and greatest Google devices (not tied specifically to a certain OS, as I had 4.4) and all of my Samsung devices and tablets were not compatible with the Chromecast browser extension. When I used (of all things!) my iPad as my remote, it worked. I could cast from my tablets YouTube and Netflix, to Chromecast. On my PC however, I couldn't reliably stream anything. Connectivity is poor, and the constant results of having to reboot the Chromecast every fifteen minutes because it inexplicably loses its connection, rendered the device utterly useless. I literally threw it in the trash, and I've watch Arrow and The Flash, buffer and disconnect free ever since.Don't buy this device, and instead spend your money on either a bigger monitor, or Apple TV.", "verified": false, "helpfulness": "0/0", "author": "James"}]