[{"rating": 5.0, "review": "So easy to watch Netflix and YouTube! I love being able to share from my phone instead of having to turn on my computer every time. Wish more programs were included  - like Vudu.", "verified": true, "helpfulness": "0/0", "author": "Natalie"}, {"rating": 4.0, "review": "Works good for the most part, setup is pretty easy, with one downfall.  You must have wifi in order to install the chromecast app.  This was not a problem on my phone, but my desktop is wired only, so I was not able to use it with my desktop.  My understanding is once it is installed, it will work fine with a wired connection on the pc, but it won't let you complete installation unless you have wifi.  Other than that, it works fine with my phone.  I'm rather disappointed in the app selection, but the device itself seems fine.  I'd really like to see an option to stream local network media.  Seems like an app like that should have been included.  You can do it with Plex, and I have no problem paying for the $5 app, but a $5 monthly fee on top of that just to have the option of chromecast seems like robbery.  I'm hopeful the app selection will improve soon.", "verified": true, "helpfulness": "0/0", "author": "Java Joe"}, {"rating": 5.0, "review": "Was looking for a way to use my IPhone 5 and laptop to stream Netflix and YouTube to my 55 i9nch TV.  This worked perfectly.", "verified": true, "helpfulness": "0/0", "author": "William Tourville"}, {"rating": 3.0, "review": "The neatest idea.  However not having enough apps that allow casting currently limits the applicability. I suppose time will cure this.", "verified": true, "helpfulness": "0/0", "author": "Gerold I. Holden Jr."}, {"rating": 5.0, "review": "The packaging was above par, and the Chromecast was simple to install and get working. I'd recommend the product as excellent.", "verified": true, "helpfulness": "0/0", "author": "Richardh58"}, {"rating": 4.0, "review": "It's great for youtubeIt's great for NetflixBut, as of right now it doesn't do much more.  Would be great to send the movies or pictures that I have on my device to the TV.  I hope more updates change this.", "verified": true, "helpfulness": "0/0", "author": "BlueHawaii2003HD"}, {"rating": 3.0, "review": "You can see only you tube or netflix or 2or 3 aps on your tv it don't let you see your downloaded videos or your music on the phone that's wy.", "verified": true, "helpfulness": "0/0", "author": "manuel dominguez"}, {"rating": 4.0, "review": "Had good luck using it with the few apps for a verizon powered droid maxx, HBO GO, Netflix, youtube, ect, but beyond that, using it with the pc didn't work out so well, netflix from the pc to chromecast was glitchy at best, didn't work to be blunt.  And eh, and I may need to read more into the how-to's, but trying to tether it to my phones wifi, and using 4G, I couldn't get it to stream in any app or connect beyond detection.", "verified": true, "helpfulness": "0/0", "author": "Phil"}, {"rating": 3.0, "review": "Not too bad, but it does take some getting used to.  It is nice you can work it from your smart phone, but it pretty much seems to have everything I already have with the jelly bean, so I kind of feel that I may have wasted my money.  Time will tell.", "verified": true, "helpfulness": "0/0", "author": "Ansley Boston"}, {"rating": 4.0, "review": "Works great but still being developed so limited resources. But with knowledge and some time you can get it to do just about anything you want it to", "verified": true, "helpfulness": "0/0", "author": "kpin"}]