[{"rating": 5.0, "review": "Our poorest of all most mothers were only trying to say, \"It helps me when you all think up.  Try prayer, kindly.  Keep kosher if one would.  Our entire world is really just trying to surrender/give up both: to nature, buddha-God, the world, other things: reality, raub; read real, need not ever cap. always anyway.  Word, the The is still trying to hide [w-God deceated, o-Christ, r-Mary, d-Jesus] shut!It up!!  Shut it up!  Antigone said it said.  It, the subjectless word, is, and yet another again, that, subjectless & so on & so forth unto the very end.  But! These kids have so badly been already, so ever seemingly so, hurt: by the end...  Ado, forever again, hay hallo, how how how, would so very much only wish to see you once more fore ever again, hush, Shiva sleeps yet forever again, avec, her mom and her only very very only very very very very very very most friends.  Fair well when foul times are unfair.  Fair all well would put even Humpty back together again.  Pray for a living economy unto 2020+10,000&divadend;, again fair, Dallas are we all still so forever so totally very upset so forever for War, genocide, holocaust, abamanation, or could you, perhaps try over again.  Games are fair or they had had had had been M.U.R.D.E.R.s yet ever again.  Goodt by unt goodt luck friend we say both for one and for once and for all: currupt!  Think \"it\" etc. better again.  I.e., nuter.  Josef", "verified": false, "helpfulness": "0/1", "author": "Gwey Lao yey yey \"Joseph Patrick Brazill\""}, {"rating": 5.0, "review": "Like it alot. Easy set up and we watched several programs within the first few hours!", "verified": true, "helpfulness": "0/0", "author": "R. Hamilton"}, {"rating": 5.0, "review": "Excellent. The voice recognition was superb when trying to select movies, Very simple to use.", "verified": true, "helpfulness": "0/0", "author": "H. Likar"}, {"rating": 5.0, "review": "Great device, I also have an apple TV and Fire TV has become my go to streaming device.", "verified": true, "helpfulness": "0/0", "author": "Said with Zig \"Mon-Said\""}, {"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "marilyn"}, {"rating": 5.0, "review": "it's one outstanding product", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "chong lu"}, {"rating": 4.0, "review": "Just wish it had more choices.", "verified": true, "helpfulness": "0/0", "author": "j"}, {"rating": 5.0, "review": "Great processor runs really smooth.", "verified": true, "helpfulness": "0/0", "author": "Chad M Smith"}, {"rating": 1.0, "review": "I connect my Kindle Fire to my tv and get the same result. Disappointed.  Not enough info on your page, the box or the directions. Unfortunately I'm not the type who returns.", "verified": true, "helpfulness": "2/5", "author": "Judith E Tannehill"}]