[{"rating": 1.0, "review": "Screen casting from a browser crashes constantly, has low frame rate. My Mac air was huffing and puffing to keep up.", "verified": true, "helpfulness": "3/3", "author": "Clark Breyman"}, {"rating": 5.0, "review": "I was so excited to finally have a device that supported HBO go.  That's pretty much the only reason I use my Chromecast. I have a smart TV, so most of the supported apps for Chromecast are already available to me, except for the coveted HBO go.  It was easy to set up and connect to the wifi.  I like the slideshow of stock photos that display while it's idle. When I turn on my TV and select Chromecast as the input, it connects and starts quickly.  Picture quality for HBO is great. Life would not be worth living without this little device.", "verified": true, "helpfulness": "0/0", "author": "Autumn Krepop"}, {"rating": 5.0, "review": "I love this little gadget.  It's easy to set up using your computer or smart phone and more and more apps/websites are gaining the ability to be \"cast\" to this device.Pros:Nearly everything. Netflix, Vudu, Youtube, etc. all with your portable devices and computers.Con:you have to use the HDMI extension on TVs that have the HDMI inputs close together.", "verified": true, "helpfulness": "0/0", "author": "Russell Paddick"}, {"rating": 5.0, "review": "The Google Chromecast functions absolutely perfectly, outperforming most if not all smart TV's on the market as of its release. A simple design that streams music, movies, and any content you so choose elegantly and efficiently, using any computer, tablet, or phone as a powerful yet simple remote control with virtually no learning curve. It uses HDMI, the most widely used AV cord in the industry as of 2014. And more and more apps and websites are becomming compatable with this device every day. The only downside for this product is that it's so simple to use that it's a shame that it couldn't be easier to set up.If you can't currently stream to your TV, and you want to for cheap. You can do no wrong with Chromecast. In this case, simplicity truly is perfection.", "verified": true, "helpfulness": "0/0", "author": "Buris"}, {"rating": 5.0, "review": "This is my 3rd Chromecast device.Easily watch Netflix, Hulu Plus, Youtube etc on any HDMI enabled TV. (must be on same WIFI network)I have 1 in Bedroom, another in Living Room and this 3rd one is going in Kitchen.You can find many Apps that allow you to stream from your mobile phone and tablet to your TV with your Chromecast.Also you can use your Laptop or computer to do the same.I strongly suggest looking for YouTube Videos that describe and review the Chromecast.Can't beat the price and you will wonder why you even need Cable or Satellite TV.Great as a Gift too.", "verified": true, "helpfulness": "0/0", "author": "S Pettersen"}, {"rating": 5.0, "review": "This has made watching streaming tv so easy. I have already recommend it to everyone I know. It's easy to install and we haven't had any issues, we've been using it almost daily for over a month now.", "verified": true, "helpfulness": "0/0", "author": "katc"}, {"rating": 5.0, "review": "This thing WAS wonderful...streaming Netflix to our TV was a cinch.  Too bad I upgraded to a larger TV which connects itself to Netflix.  Maybe I should sell the Chrome dongle?", "verified": true, "helpfulness": "0/2", "author": "BPKD \"BPK-Dawg\""}, {"rating": 4.0, "review": "My sons have enjoyed transferring their films from the chromecast to their tv.  They are satisfied with the product and are happy to have it.", "verified": true, "helpfulness": "0/0", "author": "Carmencita"}, {"rating": 1.0, "review": "i cannot make it work  I followed all the instruction  I need to find a way to make it work", "verified": true, "helpfulness": "0/1", "author": "venezia"}, {"rating": 1.0, "review": "It's cheap enough but you have touse Chrome and stick with the other Google products. I hooked it up and was instantly disappointed. Save your money and by a Roku. I realize it is meant for different use but this didn't fit mine and it felt cheap and cheezy", "verified": true, "helpfulness": "1/1", "author": "Will"}]