[{"rating": 5.0, "review": "I really like the Amazon Fire TV.  The voice recognition is awesome.  I do wish there were more Prime movies and tv shows (free).  I was a bit disappointed at the selection.  I would still like to have CBS, NBC, etc available without an extra charge with the Amazon Prime.  All in all, still happy with my purchase.", "verified": true, "helpfulness": "1/1", "author": "Tammey Foster"}, {"rating": 4.0, "review": "I can't listen to my music!", "verified": true, "helpfulness": "0/1", "author": "Alejandro \"Humberto Bonilla\""}, {"rating": 5.0, "review": "Excellent use of TV. Perfect choice!", "verified": true, "helpfulness": "0/0", "author": "Gayle Johnson"}, {"rating": 1.0, "review": "I would love to purchase the Amazon Fire TV, but I will hold off until The Blaze is available. So, one star for now.", "verified": false, "helpfulness": "1/18", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Probably the best option as far as video services go.  You can also use the service on your devices (Pads, phones, etc).  Wish their selection was a little larger though.  Mainly got it due to having Amazon prime for a year.", "verified": true, "helpfulness": "0/0", "author": "John Doe"}, {"rating": 5.0, "review": "it is so easy to use.  I love it", "verified": true, "helpfulness": "0/0", "author": "foxy185"}, {"rating": 5.0, "review": "Got it with the trial membership and was disappointed that just about all the good stuff still costed $ to watch but we have Netflix and love using the remote for easier access to it.", "verified": true, "helpfulness": "0/1", "author": "Momnurse"}, {"rating": 5.0, "review": "This is another great investment where my wife and I can enjoy great TV when we have our down time in the evenings. Love it.", "verified": true, "helpfulness": "0/0", "author": "Larry Williams"}, {"rating": 3.0, "review": "Fire tv is a great concept. But I do have problems with it not shutting  down. Also their app prices are ridiculous. Some basic games are priced $4.99 a nd $6.99.", "verified": true, "helpfulness": "1/4", "author": "John J. Mazzucchi \"ZOOK\""}, {"rating": 5.0, "review": "I love this devise. The remote is just big enough. the menu is easy to go through and for the price you CAN'T beat it!! THis is a great devise for parent with small children. My son always has something to watch!!", "verified": true, "helpfulness": "1/2", "author": "Steve"}]