[{"rating": 5.0, "review": "I am very satisfied with the product and the vendor. everything went according to agreed", "verified": true, "helpfulness": "0/0", "author": "Marcelo"}, {"rating": 5.0, "review": "Great, and super fast ad capible. I have all of these things and I like them all a little.My favorite is Roku. Great box with no limits on apps. This is my second fav, and the Apple TV falls behind both of them.I have a WD Live (older, still works great!) and an always broken Vizio Co-star. This is the fastest of the lot.", "verified": true, "helpfulness": "0/0", "author": "Christopher Barrett \"cmbadass\""}, {"rating": 5.0, "review": "Must better then Apple TV.", "verified": true, "helpfulness": "0/0", "author": "amazon shopper"}, {"rating": 3.0, "review": "Unit worked as advertised until a week ago. Now I cannot connect to Netflix. I've tried several ways to fix it but to no avail. DO NOT buy this unit. Go with Roku or Apple TV. I wasted $99.00 on this unit and will now order Roku and throw this unit away.Update: After posting my review Amazon Tech Support called me asked me a few questions about the issues I was having with the Fire TV unit. I explained the issues and what I had tried to do to fix the unit. After a week or so they called and gave a few suggestions which did not fix the problem so they sent me a new unit to replace the faulty box. Got the new Fire TV yesterday and all seems well. I was impressed that Amazon took it upon themselves to contact me and resolve this issue.", "verified": true, "helpfulness": "4/14", "author": "Vulcan"}, {"rating": 5.0, "review": "I had been looking for a set-top for my Plex system, in addition to a box that would give me Netflix, Pandora, and a few other key providers.  I tried Chromecast, which worked but wasn't horribly user friendly since I needed to use my phone as a remote.  When Amazon Fire TV came out, I bought it on launch day.  I now own two, and will be buying one for every TV in the house as time goes on.I mainly use it with Plex, which is fantastic!  It does have a few flaws:1. Occasionally the UI will get \"jumpy\", but a power cycle fixes it.  It didn't do that right away, but started to after a few weeks.  So I'm assuming it's a software update that caused it.  I'm hoping a software update fixes it.2. There's no way to disable the sleep feature, which is problematic for me and the Plex UI on the PC.  I can't just pick something on my PC and have it stream to the Fire TV (ie, music) without first waking up the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Carissa McCann"}, {"rating": 1.0, "review": "Help! I have been trying to set this up. I have an Emerson TV & have 7550 Wi-Fi router & I have Frontier 9190 internet service. The message Connection to Netgear 7550 appears on all info I enter.", "verified": true, "helpfulness": "3/8", "author": "Joyce Nunley"}, {"rating": 3.0, "review": "Very nice for what it does but it IS NOT A MEDIA PLAYER.  This may not matter to the bulk of the Amazon audience but it will matter to those of us who are ecosytem-agnostic.  For instance - you cannot attach an external drive to the USB port, transfer a bunch of home movies to it and have the Fire TV dish it out.  The hit product in this category will be the box that combines what Fire currently delivers with an open invitation for others to play.  Perhaps, Fire Plus ???  Sure would like to see Sonos jump in here!", "verified": true, "helpfulness": "1/3", "author": "Tom Gimbel"}, {"rating": 5.0, "review": "WORKS - WORKS - WORKS", "verified": true, "helpfulness": "0/1", "author": "Grace Rainforth"}, {"rating": 5.0, "review": "Hands-down the best thing you can own for your TV. So amazing.Also, as an Android developer, this thing is amazing to work with. I look forward to more generic Android apps having keyboard support so this will work with more non-Amazon apps though.", "verified": true, "helpfulness": "1/1", "author": "Alan Hardman"}, {"rating": 5.0, "review": "I am very happy with my Fire TV.  No commercials and so many different options.  Find what you want when you want.  I like watching a show from season 1 to the finale.  I have been able to watch many shows I missed when they were on primetime tv.  And I really enjoy the 125 dollars a month I am saving.  I totally did away with DirectTv.  And don't miss it at all !Also, customer service is supreme.  If I have a problem, I can have it fixed within minutes. Fantastic !!", "verified": true, "helpfulness": "1/1", "author": "Michele Ray"}]