[{"rating": 4.0, "review": "This device can stream good content.  It glitches to my big TV but I think that is a format issue.", "verified": true, "helpfulness": "0/0", "author": "Shaun M Boudreaux"}, {"rating": 5.0, "review": "Chromecast works even better than advertised. It's a GREAT addition to our entertainment system - easy to use and powerful.", "verified": true, "helpfulness": "0/0", "author": "Dana"}, {"rating": 1.0, "review": "My Chromecast arrived and worked well for about a week. Now, however, none of the videos on YouTube seem to be playable. There's an error message \"This video is not available for remote playback.\" Videos that played fine yesterday now do not play at all to a Chromecast device. In other words, Google / YouTube have made some change that makes the Chromecast a worthless piece of plastic and metal. So I'm returning that piece of plastic and metal. Thanks, Google, for another flawed user experience!", "verified": true, "helpfulness": "0/0", "author": "weedlebat"}, {"rating": 1.0, "review": "Apparently it won't work with older modems. It kept shutting down all internet connection in the whole house, including our phonesI can't really rate it fairly because I couldn't get it to work at all. I also bought the online book, which wad no help at all.", "verified": true, "helpfulness": "0/0", "author": "olivernumber2"}, {"rating": 1.0, "review": "I purchased this because current laptop does not have an HDMI port. The marketing by Google claims that you can cast the content being played in the chrome browser to your TV, but this results in an unwatchable choppy lagged out video. I get netflix and all of the other apps on my xbox, so this device is completely worthless to me since I can't stream online content as they claim. I even reduced the quality to the lowest setting and it still can not handle the video. I wish I could give this zero stars!", "verified": true, "helpfulness": "0/0", "author": "david prats"}, {"rating": 5.0, "review": "THis is a great way to look at movies from the web from your iPad.I don't like the fact that it restricts you to Chrome.  I use Firefox.... but them this is a Google product afterall.Setup was very easy, and it works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Kottil R."}, {"rating": 3.0, "review": "I still like Roku better. This is useful for certain circumstances but make sure you know what it's use will be before buying. It's inexpensive enough that even if you don't use it often, it's worth having though. I can \"cast\" from my HTC One, Nexus 7 and Lenovo Yoga2Pro with no issues.", "verified": true, "helpfulness": "0/0", "author": "Daniel Burstiner"}, {"rating": 5.0, "review": "I love this item, I wish I bought way before I spent so much on cable.  This is the best!!!", "verified": true, "helpfulness": "0/0", "author": "Melinda"}, {"rating": 2.0, "review": "I wish I had read the reviews before buying this lousy product!! Yes, it works and is straight forward,  but not intuitive to install. My huge complaint is that, compared to Roku and Apple TV, this thing is a joke!! It only supports a handful of video apps like Netfiix, YouTube and HBO Go.....What a joke Google, come on guys you can do way better than this!A waste of money, save the $35 and get Roku, Apple TV or now Amazon TV", "verified": true, "helpfulness": "0/2", "author": "Edward F. Avila"}, {"rating": 4.0, "review": "This device is not perfect, but for $35, I'd say it's pretty good. Here are my issues with it:After watching a few episodes of 24 on Netflix, it starts going slow every now and then, the video will be in slow motion and the audio doesn't match. This may be due to the device becoming too hot, since the first hour or two is usually fine. Although this could possibly be a Netflix issue rather than a device issue. My wi-fi is pretty fast and have had no problems watching Netflix on my laptop.Also, be aware that if your TV doesn't have a USB port then you will have to plug in Chromecast to an electrical outlet.This device advertises that you can stream anything from your Google Chrome internet browser, but the few videos I've tried have been choppy and unwatchable.So overall, I like the device, and it works great for HBO Go, Netflix (except for the aforementioned lag), Pandora, and YouTube; not so good if you want to stream any video directly from your Chrome browser. It's easy to use, and if you have a USB port on your TV, it can just hide behind the TV without anyone knowing it's there.", "verified": true, "helpfulness": "0/0", "author": "Corey"}]