[{"rating": 5.0, "review": "Great device. Simple setup. Save your money on a smart TV and purchase the chromecast and convert your TV to a smart one.", "verified": true, "helpfulness": "0/0", "author": "ronjans"}, {"rating": 5.0, "review": "Great accessory!I'm using it on TV and also with projector to make wireless presentations.", "verified": true, "helpfulness": "0/0", "author": "Diego"}, {"rating": 5.0, "review": "Really cool and easy set up!", "verified": true, "helpfulness": "0/0", "author": "Grego P"}, {"rating": 5.0, "review": "The best thing ever", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "this thing is a must have, but that's obvious, since it was sold out for like ever when i was trying to buy one in stores...", "verified": true, "helpfulness": "0/0", "author": "Rog"}, {"rating": 5.0, "review": "I have two... Love them. Absolutely brilliant invention from Google. Works great. Perfect for movies, and can be played from anyone's device in our family, or anyone connected to our wifi network.", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 4.0, "review": "Great price, connectivity and portability. Bring it with you on holidays and stream.", "verified": true, "helpfulness": "0/0", "author": "G. Rivet \"G @ Arabia\""}, {"rating": 4.0, "review": "While I would like to give this 5 stars, sometimes if refuses to cast for no good reason.  No errors, no direction... just doesn't work.  I've mainly noticed this when broadcasting movies over WIFI between my PC and Chrome.  My wifes laptop seems to work mostly great.  There is some glitching.  One GREAT feature is the pictures that are displayed when not in use.  I leave the TV on and it provides great art to the room!", "verified": true, "helpfulness": "0/0", "author": "Casey Caster"}, {"rating": 4.0, "review": "So I bought this device in order to stream stuff on putlocker, nbaliveonline, solarmovie, and free project tv. I had a lot of problems to start with especially with Chrome running on windows. First off, When the Google Cast extension is added for my windows x64 system, by itself it's not a big deal, but when it goes to websites like Solarmovie, it goes INSANE on my CPU - it runs it at 100% and I thought it was because of the loading (it's not), even when the loading of the video is done, the CPU is still running 100%. I thought this could be a spyware issue, so I ran my anti-spyware software, deleted all my cookies, temp files, etc - made no difference. Also the CPU was not affected after I turn on/off my adblock plus, so it's not that extension. What I found out was this was an extension issue of Google Cast - when I turn it off, my CPU goes back to normal. Note also, I am running an older computer (running Intel Celeron 925 @ 2.30 Ghz). So this is a huge issue, because my stream on my tv is TERRIBLE, consistently skipping!So I switched to my android tablet, which has a Dual core, 1000 MHz processor. I searched through the forums to download an app called \"Web Video Caster\" and downloaded it. Then I streamed solarmovie, and BAM! works like a charm!", "verified": false, "helpfulness": "0/0", "author": "Peazfool"}, {"rating": 4.0, "review": "ok to use.  Can't use for web surf", "verified": true, "helpfulness": "0/0", "author": "LP"}]