[{"rating": 5.0, "review": "It is great to have this device", "verified": true, "helpfulness": "0/0", "author": "Cyndi Angelu"}, {"rating": 3.0, "review": "The versatility of the Chromecast is a plus, but I'm generally unimpressed with its execution. The streaming speed from my browser window is very slow, and it occasionally gets hung up buffering Netflix despite the service working perfectly fine on all other machines in my home. For my purposes, the Apple TV is more useful, but this is a solid inexpensive alternative for those who prefer to avoid Apple.", "verified": true, "helpfulness": "0/0", "author": "James McCoy"}, {"rating": 2.0, "review": "We've tried them both (and also tried Roku for a while) and in our opinion the Amazon Fire TV Stick is much better than Chromecast. Why? It has a remote. Chromecast requires that you use your phone. So, that means you have to download tons of apps to your phone so that they can be used with Chromecast when it should be about your TV. Chromecast causes extra phone battery drain too.Actually, all of these TV enhancement players would make a greater splash if you could download any app to your TV and it worked with them.", "verified": false, "helpfulness": "0/1", "author": "stryder"}, {"rating": 4.0, "review": "Easy set up no problems so far.", "verified": true, "helpfulness": "0/0", "author": "Capt. EZ"}, {"rating": 5.0, "review": "Super!", "verified": true, "helpfulness": "0/0", "author": "CatsMeow \"chuck132\""}, {"rating": 5.0, "review": "This stick is amazing.", "verified": true, "helpfulness": "0/0", "author": "Ali Hussain Alnujaie"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "D. B.One \"¡NonProfit!\""}, {"rating": 5.0, "review": "works great so far!!", "verified": true, "helpfulness": "0/0", "author": "Demetrius K. Oliveira"}, {"rating": 5.0, "review": "It wasn't the one I needed for the TV I have", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Ann Hanan"}, {"rating": 5.0, "review": "awsome cheap and a way to add channels to my tv", "verified": true, "helpfulness": "0/0", "author": "enrique casas"}]