[{"rating": 4.0, "review": "I've been using the Fire TV for a few days now and in general I like it. Like many have said, navigation is quick and the picture is really good. There are a few things that I think need working on though. First, voice search needs to work with Netflix. Even when in the app, the voice search pushes you out to Amazon video. I can't understand why when in the app, voice search couldn't be used instead of type search. Second, there doesn't seem to be a way to turn the box off. It stays on constantly. When I switch my TV source back to Fire TV, it is playing a screen saver. Why not turn off and save a bit of electricity. I would think it would last longer if it turned off as well. It would allow the unit to cool down as it stays pretty warm.Please add the ability for voice search for ALL apps loaded, but especially Netflix!Update 9/27/14: Once I forced an update on the box, it now turns itself off. This little device is great. However, I stand by the need for voice search to work in all apps. The other nice thing is that somehow it communicates with my TV (Samsung) and automatically switches it to the proper input when I turn the FireTV on. I only wish my cable box did the same when I want to switch back. Another great feature of the FireTV. Would upgrade to 4.5 stars based on this, if I could. Still a half star from awesome without the voice search in Netflix and other Apps.", "verified": true, "helpfulness": "1/1", "author": "S. Olson"}, {"rating": 5.0, "review": "I love my Amazon Fire TV!  Not only do I watch my Prime Videos on my big television now, but I also watch my Netflix videos!  This is so much faster that the Chrome Cast device I bought to watch Netflix with.  I am very satisfied.", "verified": true, "helpfulness": "0/0", "author": "M. Cooke"}, {"rating": 5.0, "review": "I will go to China next month,does it still work in there?", "verified": false, "helpfulness": "0/0", "author": "Fangfang Liang"}, {"rating": 1.0, "review": "Bloomberg TV doesn't even come close to justifying choosing this over Roku3 which has HBO Go instead.  Also the Roku3 has CrunchyRoll.  Honestly, go with the cheaper option and you'll be happier unless you somehow believe that Amazon's latest attempt at trying to join the already established streaming box, smart TV, all-in-one console market actually holds any value.The only positive I can think of is that this box is much faster than any of the competitors.  That really doesn't matter in terms of browsing and streaming your videos, when even the slowest is as fast as watching on a smart TV with built-in apps or console.  Luckily I didn't have to buy it and the roommate is returning his as it serves no purpose for us.", "verified": false, "helpfulness": "3/11", "author": "dSK"}, {"rating": 2.0, "review": "Take pause. The Fire TV is an awesome device, but the remote is freaking microscopic. And there's no app to help you find the remote or to replace it in a pinch. We lose that thing at least once a week, but we've really lost it now. Torn our house apart, except for my son's room because he's currently sleeping in there!Replacement remotes run $30, which just make it seem like they're purposefully making them easy to lose. What other device has a remote valued at 30%? As a parent, I rejoice things that make my life easier. I thought this was it! Oh how wrong I was....", "verified": true, "helpfulness": "0/9", "author": "Jess"}, {"rating": 5.0, "review": "I had Amazon Prime for like a year and never used my Amazon Instant Video. Once I realized how many movies and tv shows and documentaries there are, I realized I was missing out on a large part of my membership. So I ordered Amazon Fire TV so I could watch them on TV.I no longer have cable. I watch stuff for free on Amazon Prime or using Fire TV's Netflix app. I also really like the Pandora app. A Spotify app would be nice.The voice command works well. I like how simple the remote is and the smooth, rubberized texture. It was very easy to install, and if you order online it is already synced with your account (this kind of creeped me out at first as I didn't make the connection mentally LoL).When there is no activity for a while, there is a nice screen saver of different landscapes.", "verified": true, "helpfulness": "6/6", "author": "Char King"}, {"rating": 5.0, "review": "Definately Greatttttttttt! That sums it up.I highly recommend it.", "verified": true, "helpfulness": "0/2", "author": "Otis Boxer \"Otis\""}, {"rating": 3.0, "review": "no 802.11AC and to gigabyte port.", "verified": false, "helpfulness": "0/4", "author": "Jacki"}, {"rating": 2.0, "review": "I bought this thinking it would be great because I can get my prime, hulu plus and Netflix all in one place. However although easy to hook up to the tv and the remote is cool because of the voice command this product from Amazon is a waste. The problem I am have is the box gets hot very quickly and the picture no matter if it's hulu or Netflix freezes every 5 minutes so you can hear it but the picture doesn't move. Then it catches up and freezes again. I was thinking maybe it's hulu or Netflix so I continued watching from my game console and there wasn't any problems at all which leads me to believe I spent $99 on a gadget that doesn't work properly. So sadden because everything about the gadgets from Amazon I love. I have owned at least 4 different Kindles.", "verified": true, "helpfulness": "1/5", "author": "Marcy"}, {"rating": 3.0, "review": "I can't figure out how to \"rate\" a movie without going online. How can I remember which movie I've already seen? I'm a subscriber to HBO but can't watch HBO shows on my Fire TV. It just told me I need to sign up for \"one click\" to watch my Netflix. Amazon tries too hard to push their \"pay\" options.", "verified": true, "helpfulness": "0/0", "author": "Chesty Puller"}]