[{"rating": 4.0, "review": "This thing is great! Simple setup and does just what Google says it will.  I gave it 4 stars because Google broke the third party app AllCast for Android - so now all you can cast from your Android phone is NetFlix, YouTube and Google Play - no local content and nothing from a Chrome browser on your phone. Sure would be nice to see support for Prime Video!! It's new... hopefully things will only get better!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The chromecast is pretty ho-hum, more of a parlor trick when compared to the Roku 3. Even though the Roku is a little more expensive (2.82 times in the case of the Roku 3) it's 10x's more useful.As far as the chromecast goes I have it hooked up to a LCD monitor in my basement just in case I want to catch something on Netflix while I'm down there and I've found using my phone to control it is much more convenient than using a tablet.", "verified": true, "helpfulness": "1/1", "author": "Pat"}, {"rating": 3.0, "review": "I have been using an Apple TV for several months at both home and my office. At home it's mostly for picture viewing, streaming video, a bit of web browsing and mostly music. At the office we use it to allow visitors and staff the ability to quickly connect to our projectors and sound systems. Apple TV excels at these functions but I was excited to hear about Google's Chromecast because there are some things that Apple TV blocks - streaming Amazon videos being the main one. After using Chromecast for a few days now I make the following observations:Pros:Cheaper than Apple TVBattery consumption on your phone/tablet is minimal as the device pulls content from the Cloud rather than your deviceVERY easy config, though the Apple TV is just as easyCompact package though I had to use the power cord it ships with as my Sound Bar did not supply enough power via HDMICons:Works with a limited number of servicesYou cannot mirror your screen as you can with Apple TVOverall the Chromecast is useful if you are going to be streaming media from one of the supported services. If you want to share other content such as pictures, mp3's, presentations, spreadsheets, etc this is not going to be the right device for you. Overall I would recommend that iOS users (iphone, ipad) purchase an Apple TV rather than a Chromecast as you will be able to perform a much wider variety of functions with that.", "verified": true, "helpfulness": "1/2", "author": "D. Brennan"}, {"rating": 5.0, "review": "Put your chrome browser on a tv, simple as that. It works beautifully! Wifi strength could probably be stronger, but given it's size I think they did about as well as possible.", "verified": true, "helpfulness": "0/0", "author": "Daniel M Ralls"}, {"rating": 5.0, "review": "My chromecast has to be, hands down, one of the best purchases I have ever made through amazon. It's everything I hoped it would be and more. Couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Bethany Lucas"}, {"rating": 3.0, "review": "Due to the popularity of this device I had to wait months to get it. I can say it was worth the wait. But not in a jump up and down, it was worth the wait, it's going to change my entertainment lifestyle kind of way. Just mild excitement at this pointMy biggest concern is not with the technology. It's pretty solid, easy to set up as long as you have a power outlet near your device and a strong internet signal.It's with the content providers catching on to it and developing more and more apps that allow you to \"cast\" their content. Youtube and Netflix only hold your attention so long. If Hulu and others content providers adopt it, it will change my entertainment lifestyle quite a bit.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 3.0, "review": "Pretty cool, but I haven't found it very useful yet.  Also I find the display framerate to be a bit strange.", "verified": true, "helpfulness": "0/0", "author": "Chad M. Grigsby \"web_dev_dude\""}, {"rating": 5.0, "review": "This device is truly revolutionary for its size and what its POTENTIAL can be. People are so quick to down it for only having a few services, but this is just the beginning. I'm using Google Play Movies and Music so much more now. Love this lil' bugger.", "verified": true, "helpfulness": "0/0", "author": "Lamarr Wilson"}, {"rating": 5.0, "review": "Google has a relatively long history of trying to get into the TV device market and I should say this time they nailed it. What can be a better remote than your phone or tablet? You can use touch to navigate, use a proper keyboard when typing in search and so on. It's just awesome.Before I got Chromecast I used to watch Netflix on PS3 or a tablet because watching it on a PC was unbearable due to issues with Silverlight. Now I don't need any of that, I can just stream video or music from my Nexus 10 tablet or Android phone. It works beautifully. Streaming from a browser also works very well although it does consume a lot of CPU on my MacBook Pro running Linux. Hopefully this will be improved in newer versions of Chrome. Despite high CPU usage watching full-screen video I haven't noticed any lags, the audio stream perfectly matched video.Installation is very easy, even my grandma could do it with her eyes shut.", "verified": true, "helpfulness": "0/0", "author": "vitaut"}, {"rating": 1.0, "review": "I just got the Chromecast device, setup was easy.  This could have been an amazing device, but it will not allow you to view local files such as pictures and videos, and even though the device is able to handle it, Google purposefully disabled the feature.  Essentially, it is just a youtube and netflix viewer.  I thought it would allow me to share the pictures and video that I have taken on my Galaxy 3 phone.  But, unfortunately, that feature is not allowed, even though the device is capable of doing it.  Third party software providers were banned from enabling that feature.  This could of been a five star item.", "verified": true, "helpfulness": "1/4", "author": "Trueml"}]