[{"rating": 5.0, "review": "I've had the Chromecast for a few days now and it does exactly what I want it to do. I have been controlling it with my Nexus 7 tablet and it has been able to send all kinds of media straight to the TV with very few problems. It occasionally takes a few seconds to get connected, but I have found few, if any, types of media that it will not play. Even if there is something that doesn't work great, you can mirror your screen (at least from the Nexus 7; I've heard not all devices can do this) to the Chromecast display. Everything seems to run smoother than my Apple TV, especially screencasting or pushing videos from a web browser to the television. The only real con is that you really should have an Android tablet or phone to get the most out of the Chromecast.The price is hard to beat for what you get. I got it on sale for $23, and an Apple TV can cost $100.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works as expected", "verified": true, "helpfulness": "0/0", "author": "kjandmharper"}, {"rating": 2.0, "review": "I bought a chromecast when they first came out and just recently bought a roku streaming stick. I thought the chromecast was the next great thing finally freeing me from the shackles of cable but google dropped the ball big time. It's a nusences to use and the streaming media available is stale. Get the roku, it's way better.", "verified": true, "helpfulness": "1/1", "author": "Katie Leiby"}, {"rating": 5.0, "review": "I love it I can watched any program I want now even from viki", "verified": false, "helpfulness": "0/1", "author": "Perla Carolina Orozco Barajas"}, {"rating": 5.0, "review": "👍", "verified": true, "helpfulness": "0/2", "author": "abdullah"}, {"rating": 5.0, "review": "works great and packaging was in perfect condition", "verified": true, "helpfulness": "0/0", "author": "Beverly Lupo"}, {"rating": 4.0, "review": "Overall very good.  Would be a five stars if it would do streaming from the iPhone Chrome browser application.", "verified": true, "helpfulness": "0/0", "author": "Fidel Vera"}, {"rating": 3.0, "review": "Works well, once it can get a connection to my router. Be careful as it only works on 2.4gHz wireless signals so make sure you can config your router if using dual signals. Also, at first it would not work on my WPA2 network (kept saying it could not connect), but after shutting everything down and rebooting it eventually accepted the network.Edit: Having owned now for awhile, I am removing 1 star until Google decides to support DTS and AC3 decoding. I am getting tired of hitting personal movies that have no sound b/c Google doesn't support these two common audio formats.", "verified": true, "helpfulness": "1/1", "author": "William Dazey"}, {"rating": 5.0, "review": "I couldn't get this working for several weeks, but just talked to my IT guy at work and he had to change some settings on my router and now it's working great!  I called google support 1st and they were no help.", "verified": true, "helpfulness": "0/0", "author": "Maureen Sweet"}, {"rating": 4.0, "review": "This unit is great for those who use the following: Android with Netflix, laptop with Chrome browser. It isn't so great if you have an ipad mini with netflix. The problems with the ipad are sluggish performance, dropped sessions (it takes a long time for it to rediscover what the chromecast is doing and sync up).So most nights as I sit with my wife, I'm the one who takes over with my Galaxy note 2 and control the chromecast. My experience is very good with this setup. My wife and the ipad mini is 50 % frustration.", "verified": true, "helpfulness": "0/0", "author": "Dennis E Klotz jr"}]