[{"rating": 3.0, "review": "Chromecast can turn a dumb TV into a limited capability smart TV for only $35. That's the good news. The not so good news is that you cannot (currently) \"cast\" local content from your PC or Android device even though the hype implies that you can.  The device set up easily and performs well with the very limited default apps, and you can \"cast\" a tab from Chrome on your PC or laptop to your TV (NOT your android device) . Keep in mind that \"casting a tab\" from PC (or laptop) based Chrome does not include any of your local content (photo files, video files, music files, anything from your hard drive).  That said, Google promises enhanced capability in the future as more apps become available, so time will tell. For the time being the device falls short of my expectations (my TV was already smart enough to stream Youtube, Netflix and others, and I certainly expected to be able cast from my Android smartphone).  So read all the reviews, be careful of the hype, and do not set your expectations too high before you buy. This product is OK but not for everyone.", "verified": true, "helpfulness": "1/1", "author": "KAA"}, {"rating": 5.0, "review": "Very easy to set up, great picture quality, sounds great.the only negative so far is the lack of support from HBOgo, Showtimego, Amazon and such.", "verified": true, "helpfulness": "0/0", "author": "Adam & Bekki Paul/Callaway"}, {"rating": 4.0, "review": "market not mature yet, besides youtube, I got no other use at all. It's easy to set up, waiting more applications.", "verified": true, "helpfulness": "0/1", "author": "yz"}, {"rating": 4.0, "review": "i installed mine with no problems using the included power connection as my older tv did not have all the needed ports.watched a movie on you tube. after shutting the tv and wifi i noticed that the dongle was flashing a small light and when i touched it it was extremely hot. so i unplugged it from the power source.is this \"normal\"?", "verified": true, "helpfulness": "0/0", "author": "paul"}, {"rating": 3.0, "review": "I purchased this because I thought it would be a way to expand my TV options as I had cancelled my DirecTV service.  Unfortunately, I had hoped that Amazon Prime free streaming videos would be able to be shown on my TV.  The only way that works is to disable the silverlight plugin.. then you experience a lot of latency issues between dialogue and video.  So it doesn't work for that.It was also not quite as simple to set up as advertised.  I tried it three different days (quitting when I got frustrated).. before I actually achieved success.Not sure why I wouldn't just want to use an hdmi cable from my laptop to be honest.  Maybe if I keep using it.. and apps get upgraded.. it will have more utility?", "verified": true, "helpfulness": "1/1", "author": "saltgrain"}, {"rating": 5.0, "review": "This simply does it all! Trust me the got it right on this little thing, get one before the lock down all the potential it can do! Simply put WOW! Amazing!", "verified": true, "helpfulness": "0/1", "author": "Joe"}, {"rating": 3.0, "review": "There are very few options relative to stations.I did like the buffering feature, it appears the show is buffered on the device in its entirety and then played. Had NO buffering issues during the movie and the quality was perfect!", "verified": true, "helpfulness": "0/0", "author": "The Duke"}, {"rating": 1.0, "review": "This device was a real disappointment! I was under the impression that the Chromecast would work with my beloved Kindle Fire HD and I was so excited over all the possibilities and especially since it was only $35.00, what a wonderful thing! Well forget it folks. Once I connected the device to my TV and followed the directions for visiting the Google.com/Chromecast/Setup website and logging in to my chrome (gmail) account which was required to complete the setup process for the Chromecast device, my progress was halted! Before I could even acquire the free Chromecast App, a warning came up that informed me that I did not have any devices! I realized that they were telling me that I did not have any \"Google devices\" and as I read further into the Google website, it was mentioned that the Chromecast was not for use with the Kindle Fire HD or Amazon Prime! So why wasn't that information made blatantly available and clear before I spent my $35.00? I went on a search for a solution hoping that someone would give me some help. Yes there are a few idiot Individuals on YouTube who talk very fast so you can't understand them but after replaying their clips a few times you will learn that getting the Chromecast App on to your Kindle is all that you have to do and of course they are all doing it through \"Jailbreak\" websites that carry risky viruses and possible identity theft leaks. I was tempted but thankfully Amazon made that endeavor impossible since I couldn't get anything to download to my Kindle Fire HD unless it is in the Amazon App store (even though I have selected the option to allow applications from unknown sources to download onto my Kindle which I activated from the \"settings\" menu on my Kindle Fire). So now I'm stuck with this really useless device that only individuals who own Google devices should buy! I believe that Communication should have been much clearer about the compatibility of the Chromecast with other devices instead of misleading people into thinking that you can use the Chromecast on any smartphone or (Kindle)tablet out there. It's very clear to me that this is all just a marketing/selling plot by Google to get you to buy their \"compatible only with Google\" device and then maybe you might buy there Nexus devices just to get it to work! I can only imagine the millions of dollars that Google has made from the high hopes of technophiles like me around the world with this crafty ruse on the public. Please save your $35.00 dollars for something else that really works and doesn't make you waste hours of time trying to find a solution when there isn't one! Anyway, I don't know whether to put my Chromecast on the shelf and hope that one day Google will make things possible for me to use it or just send it back?", "verified": true, "helpfulness": "1/7", "author": "Arizona Shopper"}, {"rating": 3.0, "review": "So I love what it does, when it works well.  Easy to use BUT if you have a lot of devices in your house sharing the wifi... it just won't work without stuttering.", "verified": true, "helpfulness": "0/0", "author": "Ronny P"}, {"rating": 2.0, "review": "I bought this product with lot of hope, got mine a month after ordering from google. Chromecast keeps disappearing on my network. Most of the time my iphone and ipad cant find the device.i have a sony bravia smart tv and thought it shd work great but i have to reset it number of times and set it back up which takes a lot of time and patience.Same happens on my nexus too.Also its only limited to netflix and youtube. Need more apps .thiniking of returning it. Truly disappointed.", "verified": false, "helpfulness": "0/1", "author": "Arnab"}]