[{"rating": 5.0, "review": "I love the fire TV.", "verified": true, "helpfulness": "0/0", "author": "L"}, {"rating": 2.0, "review": "Pro's1.It's an excellent box at first!2.Tons of apps3. Kodi!!4. 5GHz wireless works well with with my router, no buffer issues. same goes for 2.4GHz until that band gets saturated5. Voice search works well \"tho only for Prime movies or videos\"6. latest firmware gave much needed love to prime music UICon's 1. New update instills adverts now, WTH Amazon!!!!!!! are you now going to pay me??? BAD BAD BAD!! 2. Netflix after viewing 3+ shows, or more then 1 movie it will start to jitter/freeze/lag forcing you to restart the app. 3. most all tv show/movie apps has the same ill effect as the netflix app. 4. prime interface or the whole fire tv UI NEEDS TO BE REDONE!!! 5. Kodi works well only drawbacks it seems to suffer is that once viewing extended content Kodi will not start jitter/lag/etc it will simply crash. 6. prime content DOES NOT suffer the above ill effects because you are never in a app, however IMO: Amazon Prime content is LIMITED via the FIRE UI making NETFLIX much more appealing \"YOU READING THIS AMAZON!?!?\" 7. Prime Music all around SUCKS!!!!!! must use pc to add limited content to your prime music, and that interface on both amazon site and fire UI is HORRID!  8.a since last firmware update prime music much better however still room for improvemen 9. AMAZON please for the love of god, PAY to have voice search DEVELOPED across multi apps 10. Amazon makes it impossible to play local media, must use apps bad AMAZON!!! 11. NO SUPPORT for Google Play 12. Amazon makes it impossible to jailbreak it,,,don't we OWN the devices AMAZON????Overall Its ok for what it is but has much room for improvement! If you plan buying this id advise getting the stick and NOT the box!", "verified": true, "helpfulness": "0/2", "author": "Joe Castaneda"}, {"rating": 4.0, "review": "I have been very happy with the Fire TV.  The unit is extremely quick and responsive and has a huge selection of applications.  The controller is simple to use yet very effective for navigating.  Prime content is very easy to access.  Netflix works great.  HBO Go also works great.  Searching is easy.  For streaming media over the internet from subscription services this unit works fantastically.  If you are only buying this as a black box to stream subscription services over the internet to your TV then this is a 5 star unit.However, if you expect it to replace using something like a gaming console there are some limitations that you should be aware of before you purchase the Fire TV box.  There are other streaming media boxes that don't have these limitations, so be sure that you can live without these features before you choose the Amazon Fire TV:One limitation is that you may also not stream any local media from your network to the Fire TV without installing apps both on the Fire TV and your computer.  I use an application called Plex to stream from my computer to my Fire TV unit.  This works very well but it is disappointing that the Fire TV cannot do this on its own.Another limitation which bothers me much more than the local network streaming is the useless USB port.  The unit has a USB port on the side but it will not connect to an external hard drive or flash drive to play media off it like you would an Xbox or a Playstation.  This is simply not possible on the Fire TV at this time.  I can understand this on the Fire TV stick obviously, but this review is for the larger box which should come with the capability to play files.  Other streaming media players and all gaming consoles have the ability to play local files through the USB port so it is quite disappointing that Amazon left this feature out.I replaced an old Sony streaming media player with the Fire TV when my girlfriend moved out and took it with her.  This unit was slightly disappointing because even that cheap Sony streamer could play files over USB hard drives/flash drives and for whatever reason Amazon did not include this feature.  I can live without the network media streaming since Plex is a decent workaround but because of Amazon not including these features natively I am giving the unit 4 stars.", "verified": true, "helpfulness": "0/0", "author": "James C"}, {"rating": 5.0, "review": "Seriously haven't watched traditional TV much at all since I got my Amazon TV. It's everything a streaming media device should be...fast to setup, easy to use, and backed by Amazon and their amazing customer service. Paired with my prime membership, this is a 10!", "verified": true, "helpfulness": "0/0", "author": "Amazon Addict"}, {"rating": 5.0, "review": "With the newest firmware update, you have the ability to now store apps on a USB drive.  I am using a Startech 2.5 USB/eSATA enclosure that has a 300 gb Hard drive in it.  That enclosure does require external power for it.  I have also tried a Crucial 64 gb SSD drive with the Fire TV box, and had no problems with using it.I would say that this is the best improvement ever with the Fire TV.  Especially with the fact that a lot of game apps can be around 5 gb.  Out of the box, the Fire TV uses around 3 gb of storage space.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. I have enjoyed have this in my bedroom. It works great for my hulu and netfix. I have had it for a few weeks now and have not had any problems.", "verified": true, "helpfulness": "0/0", "author": "K.J. \"kjnixphoto\""}, {"rating": 5.0, "review": "Best purchase for my Daughter EVER!", "verified": true, "helpfulness": "0/0", "author": "Erick Boggs"}, {"rating": 5.0, "review": "Love this device...", "verified": true, "helpfulness": "0/0", "author": "Tony Mobley"}, {"rating": 4.0, "review": "So far so good! Very easy to get started and eliminates our huge cable box. The only issue I currently saw was when we did a voice search for a TV show we were watching in HULU it took us to the purchase option of the Amazon prime for that show not to the HULU one", "verified": true, "helpfulness": "0/0", "author": "Jerson Briones"}, {"rating": 2.0, "review": "Almost anything that's any good even if it's older you have to pay extra to watch. very limited in it's scope of whats included with prime, it has not won me over.", "verified": true, "helpfulness": "0/1", "author": "Rebecca MacMillan"}]