[{"rating": 1.0, "review": "I bought this to stream Amazon Prime Video. IT DOES NOT WORK.", "verified": true, "helpfulness": "0/0", "author": "June Williams"}, {"rating": 2.0, "review": "All the rave reviews of this thing... I don't get it. It's a piece of junk compared to the Roku.  This is GOOGLE and it doesn't even detect dual band 5ghz networks? Terribly slow, no good for real quality... terrible explanations that you have to connect to IT from tour phone as a wifi source and then change to your actual router. Screen casting from the latest hi end phones (Samsung Galaxy S6 Edge) is pretty bad and laggy.  But of course, they are using old wireless n 2g speed.  I know it's only 35 bucks but it's pretty much useless compared to the other products out there for a few bucks more.", "verified": true, "helpfulness": "0/0", "author": "Blackout (Michael Biggins) \"Michael Biggins aka Blackout\""}, {"rating": 5.0, "review": "Setup was a breeze and completed within 3 minutes!  I was immediately streaming Netflix and YouTube videos to my television.  Unlike my Apple TV and Smart TV-enabled television, there have never been issues with videos rendering (blurry before finally become clear). As soon as I begin streaming something to the Chromecast, it IMMEDIATELY presents a crystal clear picture on my television.Given its simplicity and multitude of programs which are compatible with the device, I would recommend this device to anyone looking for a cost-effective solution for streaming virtually any video to a television wirelessly. I would go as far as to say I prefer using my Chromecast on my Smart TV-enabled televisions since they quality of the streaming surpasses anything I can view with a Smart TV program.Pros: Simple interface, Easy to setup, Crystal clear picture qualityCons: Requires a power supply (via included USB cable) - luckily, my television had a USB port in the back which provided power to the device. otherwise, you'll need to have it plugged into a simple plug that accepts USB cables (i.e. phone charging plug).", "verified": true, "helpfulness": "1/1", "author": "Jimmy J \"Jimmy J\""}, {"rating": 4.0, "review": "Set up my new Chromecast (with my TMobile CellSpot wireless router, and a standard home A/V system with old-school \"hi-fi\" stereo components and a Vizio HD monitor) about 2 months ago. Spent maybe a half hour or so on the initial setup of the Chromecast, monitor, and all 5 devices we use to stream from (iPhone and two Samsung Galaxies, plus Mac and ASUS/Windows laptops), including downloading the app x 5 and tweaking settings/passwords. Very easy,I've gotta say, this thing is pretty cool! It's convenient and fun to search around for content and stream it like shazam. And to control the whole package from our phones, anywhere in the house: pause, replay, navigate, connect, configure settings and adjustments, search, stream...all over wifi from the phone or computer to the \"big screen.\"The only glitches so far have had to do with the Chromecast unit disconnecting from my wifi signal on the rare occasion, and I believe that's only when its connection has been idle for an extended period and it \"times out,\" or when multiple devices are competing for the bandwidth. Easily reconnects using your PIN, though. Also, I would love to see more content outlets support Chromecast (I'm talking to you, Amazon Prime On Demand)...but I'm pretty confident more will come on board sooner rather than later.All in all, an inexpensive, simple and very useful little device & app to stream to your A/V system. Well worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Reen"}, {"rating": 3.0, "review": "we'll see how long this one last.", "verified": true, "helpfulness": "0/0", "author": "lorraine parish"}, {"rating": 5.0, "review": "Greatest thing ever invented", "verified": true, "helpfulness": "0/0", "author": "Alanna O'Brien"}, {"rating": 5.0, "review": "Works perfectly", "verified": true, "helpfulness": "0/0", "author": "jorperc"}, {"rating": 1.0, "review": "Sucks", "verified": true, "helpfulness": "0/3", "author": "Rommel Garcia"}, {"rating": 5.0, "review": "Love my google chrme. Just what I wanted!", "verified": false, "helpfulness": "0/1", "author": "Jodi Alladan"}, {"rating": 5.0, "review": "does what it says it'll do", "verified": true, "helpfulness": "0/1", "author": "Eric Sun"}]