[{"rating": 5.0, "review": "It works great. I have only used it with NET FLIX  but I will be trying it on other media soon.", "verified": true, "helpfulness": "0/0", "author": "richard j. zalewski"}, {"rating": 4.0, "review": "This this is awesome, I love it. except for one thing, If you have an older computer, streaming either movies in chrome or video from a streaming site (other than netflix, youtube or apps like that) you're going to have a laggy, interrupted time. It still works, but it is harder to enjoy. Lowering the bitrate, ie quality, will definitely help.Other than that this thing is awesome, beats having a long HDMI cable sticking out of my computer.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 4.0, "review": "Overall, I am very pleased with the Chromecast. I use it to stream content from ESPN3.com, and it works very well. I have played around with YouTube a little and it works pretty well too. I did notice if I am streaming a game from ESPN3 and try to switch over to another tab to browse the web, or if I try to use Skype the stream freezes often. For my purposes, that is a bit of a drawback, but if you are going to watch movies and not use your computer while watching, this thing will be perfect.", "verified": true, "helpfulness": "0/0", "author": "C. Lee"}, {"rating": 5.0, "review": "I have been trying for months how to get netflix on my TV - this is the answer!  It took no brains to install and it works great.  Thank you thank you thank you!  Best buy ever!", "verified": true, "helpfulness": "0/0", "author": "rockyg48"}, {"rating": 4.0, "review": "Does everything advertised as does it well.Still needs more 3rd party app support, but this will come.Sometimes switches theTV over to AV HDMI input even though I am not using it - requires me to switch the TV back to the tuner. Not an issue for me, but annoys the wife and throws the kids off as they cannot switch back by themselves.", "verified": true, "helpfulness": "0/0", "author": "Jeppe Funk Kirkegaard"}, {"rating": 5.0, "review": "I thoroughly like Google Comcast! It allows me to enjoy the different media on my AV system that was unfulfilling on my tablets or smartphone. Streaming movies has become my favorite pastime. Being retired with the Chicago winter we just had going outside was necessity only!!! It became my cure for boredom. Plan to purchase a couple more to give as gifts.", "verified": true, "helpfulness": "0/0", "author": "Gregory Davis"}, {"rating": 1.0, "review": "No air play like feature missing important options only works with certain apps. Do not buy a waste of money", "verified": true, "helpfulness": "0/0", "author": "james lindsey"}, {"rating": 5.0, "review": "I love this and super easy to set up.  I use my Chromecast as an addition to my Roku for a second tv.  The only drawback is that it is imcompatible with Silverlight so some websites will not broadcast properly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Kitsap Foody\""}, {"rating": 1.0, "review": "I love Google. They have many quality products, but this is not one of them. Apple TV smokes this product. I was really hoping that this would be a good product and was let down. It was inexpensive, but should had been better. It really doesn't do much of anything.", "verified": true, "helpfulness": "0/1", "author": "Adam Doud \"Turtle\""}, {"rating": 4.0, "review": "For $35, it is worth the price.  I found it easy to pair with both an android tablet and my iPhone.  Content streams smoothly for me on my network.  Google recently opened the API, so hopefully more compatible apps will be released.update Aug 2014I use this now on our main tv.  We don't have cable, so we use Netflix & specific websites.  One website that I use is Disney Jr for the kids.  I am able to EASILY cast the web page from my home pc to our tv downstairs.", "verified": true, "helpfulness": "1/1", "author": "Adam R."}]