[{"rating": 4.0, "review": "Google Chromecast is a decent, cheap alternative to Roku or Apple TV, which have much more functionality at 2-3x the price.If you have an iPhone/iPad or Droid phone/tablet, you'll have no trouble streaming Netflix, HBO GO, Hulu, YouTube, and other popular video apps. But, you won't have a remote control. Rewinding a video on your iPad can get awkward. A minor inconvenience, but definitely not as smooth of an interface as the Apple TV. Roku also offers a model with a nifty headphone jack in the remote. These are obvious examples of how those devices offer more functionality than the Chromecast.The function to broadcast whatever is on Google Chrome is in beta and does not work well. Currently it only works on a laptop or computer and not on mobile devices, which kind of defeats the purpose of the device. It also does not work well if you try to stream video (say by watching shows or movies you can't get on Hulu or Netflix) - the quality and frame rate are very poor. I thought this would work as well as the \"mirroring\" function for the Apple TV, but it's not even close.If you want full functionality, you either have to spend a little more for the better devices, or wait until the Chromecast works out its technical issues. If you just want a cheap device to help you use your favorite apps on a TV, then Chromecase gives you a cheap and easy option to do exactly that.", "verified": true, "helpfulness": "0/0", "author": "CMC"}, {"rating": 4.0, "review": "We found the ability to surf the web on our old 32\" Sony flat-screen using this device so much fun, that we got a new LG 55\" Smart TV.  With this or the Smart TV you gotta be careful to play 720p (1280x720) videos to truly enjoy decent picture clarity.  So we only used it for a month or so, but it worked fine & there was no problem linking remote command of this device with my Samsung smartphone.  The 4 & not 5 stars is because you're more limited what web site you can access than other similar devices & Smart TVs.", "verified": true, "helpfulness": "0/0", "author": "Bill Blackburn, Ukiah CA"}, {"rating": 5.0, "review": "Works great! Setup was effortless. I'm using it with Plex and works very good. I algo stream srt and idx subtitles.Tried it with mkv files at up to 720p with 0 issues. Just a little buffering lag and that's it. Youtube function works also fine. Now I can watch all of my media files in every room, all I have to do is bring this small device with me.", "verified": true, "helpfulness": "0/0", "author": "Federico Touriz"}, {"rating": 3.0, "review": "Since I already have a Blu-ray player that lets me access many of the streaming services, the main advantage of this device is being able to cast content from my laptop to the larger TV screen. The main thing I'm doing is casting episodes of network shows that I missed watching during the week. And it's only marginally useful for that.The problems are:1. First and foremost, the video feed seems to stall and sputter. This doesn't happen when i just watch a video on my laptop, so I don't think it's my internet connection. the audio seems to continue, but the image freezes. Really annoying.2. The laptop goes into sleep mode. This doesn't happen when I'm watching an episode normally. Sure, I can configure my settings to not sleep, but then I'd have to change that again when I'm done watching TV so it doesn't stay on when I walk away to do household chores or take a phone call. So every time there is a commercial, I have to remember to jiggle the cursor.3. You can't really use your computer for something else, although the description says that. Because the video is full-screen, you can't get to another tab without leaving full screen. And if you aren't in full-screen, then your TV screen will show all sorts of useless material around what you are watching.I may try taking it on the road with me, so I can get Netflix and other streaming services on TVs at hotels. Not sure if it will work, but that might be useful. When I get a TV set up in the guest bedroom, maybe I'll put this little device in there. Otherwise, i don't find much use to being able to project laptop tabs to the TV.", "verified": true, "helpfulness": "0/0", "author": "Elle"}, {"rating": 2.0, "review": "I really admire Google, but I am disappointed with this product.  First, it is really is the set up, and the directions are very clear - just follow them. Secondly, I love the photographs that appear on my TV, after it is set up.  They are beautiful.  I could watch these for hours, which is kind why I am disappointment.  If all you want to is watch cast stuff from your chrome browser, this is definately the product for you, and it would be a 5 stars product.  However, I fell into the hype in the being thinking that it would be like Apple TV, but it's not.  However, for $35, about the cost of an HMDI cable I can see pretty pictures and cast anything that is in my brower (not the desktop of my computer).  Anyway, I feel I have invested in the future of Google, and I am bore now.", "verified": true, "helpfulness": "0/0", "author": "Roland Frye"}, {"rating": 5.0, "review": "So simple to set up and use. I like how I can use my phone or a device to control Netflix. Hoping they add more variety of use soon.", "verified": true, "helpfulness": "0/0", "author": "D. L. Thompson \"camera crazy\""}, {"rating": 5.0, "review": "I've streamed sports from my chrome browser.  The relay from chrome to HDTV is not bad at all, and quality depends on the stream itself.  Exactly what I'm looking for because it saves $40-$50 a month for extra TV channel packages", "verified": true, "helpfulness": "0/0", "author": "Jecht"}, {"rating": 4.0, "review": "Works well", "verified": false, "helpfulness": "0/0", "author": "Jaime Serna"}, {"rating": 4.0, "review": "Best thing since Blu Ray only ten times more convenient.  You have to have this.  The only part that is not right is that it does not work for Amazon Prime Video streaming.  Once they get that contract and technology worked out it is a ten star product.", "verified": true, "helpfulness": "0/0", "author": "Litig8r in Denver \"Litig8r\""}, {"rating": 5.0, "review": "Easy to use!!  Bought two more for the children in college so they could stream at their convenience inbetween studying.", "verified": true, "helpfulness": "0/0", "author": "K. Dee"}]