[{"rating": 2.0, "review": "Actually, I have not yet been able to get it set up - after spending over three hours tonight.  In theory the set-up is very simple.  There is a step-by-step process the app walks you through.  However, it will not connect to my Wi-Fi when I get to that step.  After searching extensively for solutions, including changing router settings, I have still have not had luck.  I rated this two stars because I really like the idea of it, if only the set-up were simpler.", "verified": true, "helpfulness": "0/0", "author": "Daniel E Carberry"}, {"rating": 1.0, "review": "Got one from my daughter for Christmas. Worked good for 1 day. Now it constantly disconnects. I can turn it off for an hour and let it cool off and turn it back on and it will work for about 40 minutes before it starts disconnecting. Contacted support and they ran me through hours of testing and then offered to replace it if I had receipt. It was a gift!! Piece of junk.", "verified": false, "helpfulness": "0/1", "author": "E. Trigg"}, {"rating": 4.0, "review": "Delivery fairly quick. Best to go on line for directions as most companies are making mini sized direction and u need to blow them up ten times their size to read.  Yet it was simple to install and easy to set up. It is hard these days to find a good deal as i am sure everyone who likes tekki stuff understands. My hope is that this device will be updated to include other funtions. Right now it transferes well from my lap top or android tablet and streams netflix without a glitch. The device can warm up so it is wise to unplug it when not in use. It also streams utube well. I gave it a 4 star as i don't know how long it will hold up. If u don't want to put a lot of money and you like the funtions then give it a try.", "verified": true, "helpfulness": "0/0", "author": "oceaninmotion"}, {"rating": 4.0, "review": "Love the freedom to access my movies.  The difference between this an my western digital and chromecast is awesome.  I highly recommend this", "verified": true, "helpfulness": "0/0", "author": "donald raab"}, {"rating": 5.0, "review": "This small product is great!  So easy to setup... only takes a couple of minutes and it is ready to use. Easily portable...it goes on vacation with us so we can stream our favorite shows/movies/music video.", "verified": true, "helpfulness": "0/0", "author": "LJ Wilkins \"LJ\""}, {"rating": 4.0, "review": "First let me say that I'm a long time Roku user, so any experience with streaming devices is built around that model.  With that being said, Chromecast will NOT replace a Roku should that be your current streaming device or if you were looking to upgrade from an older Roku model.  However, the Chromecast is a good device for someone who is looking for a simple way to broadcast net content to their television.  The device is very simple to set up and \"throwing\" a show, music, or webpage from your phone, tablet, or laptop is as simple a pushing a button.  The only disappointment so far has been the lack of supporters in terms of major sites such as Amazon Prime Video, however hopefully that will change over time.  If your looking for something for heavy TV watching (to replace your cable or dish) then use Roku, but if your looking for a fun device that will bring a lot of your home android devices and computers together to your tv then give this a shot.", "verified": true, "helpfulness": "0/0", "author": "Jeremy- Amazon Customer"}, {"rating": 5.0, "review": "We bought one as a gift. The recipient loved it, so we got one for ourselves. Ir was easy to set up and use. We were surprised at how much better the picture is on the TV.", "verified": true, "helpfulness": "0/0", "author": "M. M. Dobrick \"inquiring mind\""}, {"rating": 5.0, "review": "Impressed with the quality and the ease of use and setup. Will recommend to anyone who wants to extend their entertainment options", "verified": true, "helpfulness": "0/0", "author": "raghu"}, {"rating": 4.0, "review": "Desktop sharing is good.Sharing just a browser window is good.Everything else, I like Apple TV better.Good to buy if you are a Andriod user.", "verified": true, "helpfulness": "0/0", "author": "Subash Sunderrayappan"}, {"rating": 3.0, "review": "I purchased Chrome and found that it is really limited.  The only options are Netflix and YouTube.  No Hulu Plus or any other options.  I have 2 Apple TV's and I get 20+ options which include Netflix, YouTube, Hulu Plus, iTunes, my computer, my personal movies, and the list goes on.  If your interest is only YouTube and Netflix, then get it.  Otherwise, don't.", "verified": true, "helpfulness": "1/1", "author": "Donia"}]