[{"rating": 5.0, "review": "My husband is in love.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"SugarMama\""}, {"rating": 2.0, "review": "First remote worked for a couple days then stopped.  Agent told me I had to return broken remote but I've had to e-mail Amazon because no return info has been given to me.  Have to unplug/plug back in everytime I want to use.  Not a good experience so far.", "verified": true, "helpfulness": "1/2", "author": "Jeffrey D. Hallmark \"wedge23\""}, {"rating": 1.0, "review": "This thing is junk! The picture quality is poor and flickers, sometimes going to just snow. I wanted to get a replacement so I logged into my Amazon account to get a return authorization, only to find out that you can't do normal returns with this product by filling in a web form. Nope. You have to call a special phone number, wait on hold, be told that you need to be transferred, wait on hold some more, then be told they need to troubleshoot first. Since this was a gift to someone else and I didn't have the unit in front of me we couldn't troubleshoot. Too much hassle. Best idea, besides not buying to begin with, is return for refund and get a Roku.", "verified": false, "helpfulness": "4/19", "author": "oldgeek"}, {"rating": 5.0, "review": "This is great easy to set up in minutes works great", "verified": true, "helpfulness": "0/0", "author": "Rich Drapeau"}, {"rating": 4.0, "review": "Pros:  Crystal clear video.  We never have lags or pauses in video.  Everything is crystal clear with perfect streaming.  It was very easy to set up.  It took us less than 10 minutes to plug it in and start watching movies.  The FireTV has a small footprint, hardly taking up any space.  Easy to use remote.Cons:  The FireTV eats up your data.  This is the first time we ever got close to using up our data for the month.  In one day, it can use up to 20GB of data.  If you have Comcast, then you might be in an area with a 300GB cap, which means you'll get close to your max before the end of the month.  Not sure if disabling the screen saver is going to fix this problem.", "verified": true, "helpfulness": "7/7", "author": "Colleen"}, {"rating": 5.0, "review": "Much better than our Roku. Just hope it upgrades so Prime music on Cloud can be enjoyed without having to miror our Kindle to listen to it.", "verified": true, "helpfulness": "0/0", "author": "SC"}, {"rating": 5.0, "review": "works great, looking forward to voice search for netflix!by adding xbmc (google it), and using it as my all purpose streaming client, this does just about everything i need to view content from all my sources.  (but i still have an oppo blu ray player for serious videophile viewing)", "verified": true, "helpfulness": "0/0", "author": "David C. Cambron \"geek\""}, {"rating": 3.0, "review": "I am a previous Roku owner.  I loved it, but it died so we switched to this.  I really like the Fire TV and we use it all of the time.  I have two gripes.  One is that when we use the Pandora App, I am then unable to select a movie on Netflix or Amazon.  They will start to load and then will stop and go back to the beginning of the app.  The only fix I've found is that I need to unplug Amazon Fire TV and restart it.  The second thing is that on Roku, we can play a show from the beginning, but I'm unable to find this feature on Amazon Fire TV.  I may just be missing something, but we have to rewind the whole show in order to play from the beginning.  Otherwise, I do enjoy this product.", "verified": true, "helpfulness": "2/2", "author": "M. OBrien \"momof2\""}, {"rating": 5.0, "review": "This is one of my favorite purchases off of Amazon. This product is simple to operate, extremely user-friendly, and very ergonomic. The bluetooth controller is perfect because I can now hide the box in the TV stand cabinet and not worry about reception problems. I hardly watch cable now.", "verified": true, "helpfulness": "1/1", "author": "Michel Tabchouri"}, {"rating": 5.0, "review": "Wonderful device! My only criticism is that you cannot watch HBO GO on it. That is a huge drawback.", "verified": true, "helpfulness": "0/0", "author": "Junebaby"}]