[{"rating": 1.0, "review": "RUBBISH!Firmware update breaks device! You have no way to opt out of getting it either and no way to roll back. Regretting purchasing every day.", "verified": true, "helpfulness": "1/1", "author": "Ian"}, {"rating": 4.0, "review": "Amazon Fire TV is great.  The only thing I would change so far is the PIN.  When entering the PIN, even if you have Hide Password chosen, it still briefly shows the password.  I use a Logitech Smart Keyboard and even when typing the PIN it still briefly shows it.  I would recommend that especially when using a keyboard that the password not be shown, even briefly.  Other than that the last two weeks have been great with the Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Russ V."}, {"rating": 5.0, "review": "Disconnecting a large house from cable TV years ago, I have had the opportunity to experience many generations of video streaming devices. I currently have smart TVs in the kids' rooms (buggy and problematic), Chromecast in the gym (Really cool, but very limited), Windows Media Center in the office (requires a computer hooked up to a TV), game consoles in the family room ...and Fire TVs in my den and bedroom. If you are invested into Amazon (Prime member, subscriber, cloud account, etc) you need to get the Fire TV! It turns your TV into a big Kindle. With all the benefits of cloud access for all of your music (not just  purchased) and pictures uploaded to the cloud. Plus all the prime videos and music. What has impressed me the most is how quickly Amazon responds to customer needs. Amazon has made numerous improvements even in the last few months!", "verified": true, "helpfulness": "0/0", "author": "Andrew By"}, {"rating": 3.0, "review": "This was our first internet tv device and I think I set my expectations too high. I just wasn't impressed with the content and preloaded channels. It may be easy to add channels, but I haven't bothered to figure it out as it's not that intuitive. I have since bought a roku streaming stick for another room at half the price and I much prefer the roku - though it isn't as fast, the roku menu seems easier to navigate and is compatible with more channels like HBOgo. Adding channels is super easy too. Not having HBOgo, is a big downfall to this device, however the speed is pretty impressive.", "verified": true, "helpfulness": "2/2", "author": "ASig"}, {"rating": 5.0, "review": "I enjoy watching movies when I want to watch them and where. This is nice for the TV, so I can be on my computer doing work while watching a movie. Looking forward to when they add music to the device so that I can listen to all my music on my tablet through my TV speakers.", "verified": true, "helpfulness": "1/1", "author": "wotsoffun"}, {"rating": 5.0, "review": "Love my amazon Fire TV.I can watch  my movies and TV  any time.No reruns or commercials.", "verified": true, "helpfulness": "1/2", "author": "bettyjanedavis"}, {"rating": 4.0, "review": "Aug 19, 2014 - These are my impressions after 5 days of using the Fire TV, and I'm sure that there's much more to discover. Long and short, the hardware is magnificent, the OS is decent but has a few frustrating flaws, but it ABSOLUTELY delivers a great experience for watching Amazon Prime's generous library of movies and television shows. Amazon has a GREAT start with the Fire TV, and with some OS updating, tweaking the menus and search functionality, the Fire TV will really be a wonderful, polished experience. If you're looking for a clean, easy way to stream Amazon content, it would be hard to beat the Amazon Fire TV.After eyeing the Amazon Fire TV for a few months, the recent sale price ($84) was enough to tip the scales and get me to bite. Do we really NEED Amazon Fire TV? No, not exactly. We have streaming options galore via Apple TV, Xbox 360, Verizon Fios DVR box, but... I've really longed for an easier way to stream Amazon content on our TV.Amazon Prime is worth it for the shipping benefits alone, and the free digital content is a major bonus. Especially as Amazon adds more and more content. We've eliminated all need for Netflix, and we're spending a little less with iTunes. There are still some big holes in streaming content availability (looking at you, Game of Thrones), but the majority of our favorite shows and movies are available, with a little patience.We're aspiring cord cutters, hoping to drop the monthly cable subscription. It's ALMOST worth it for us, and I hope that Amazon Fire TV moves us in that direction. We've been using Apple TV for a couple of years. The Apple TV is tied to our home computer and media library. For most of our kiddo content, we can stream from our home computer through an Apple TV / iTunes / Home Sharing setup. No need for discs, just load up whatever Elmo or Disney adventure the kids happen to want. There are lots of options with Apple TV for streaming, renting, and buying the content we want, and we love the Radio streaming for music content.So enter Amazon Fire TV.First impressions - the box is beautiful. Amazon is demonstrating a great deal of pride in the product via the packaging, and it feels like real quality. Colorful graphics sleeve on a black box with a fiery orange interior. Each component is snugly nestled in its own compartment, cradled and loved with plenty of plastic shielding to keep all the surfaces shiny and scratch free during shipping.Note, Amazon Fire TV does not include an HDMI cable. If you don't have a spare around the house, you'll need to purchase that separately. Any ol' HDMI cable will do, and there's NO need to spend extra on a brand like Monster. They all work!The Amazon Fire TV itself is a lovely black brick, all sleek and shiny. It blends in perfectly near the base of our Sony TV, nearly invisible. The Apple TV is a bit taller and more rounded than the Fire TV, but they're otherwise very similar in size and appearance.The remote is awesome. It's double the thickness of the Apple TV remote, which I like, because that darned Apple remote slips into every crack and crevice and HIDES. The Amazon remote is slightly rubberized, and feels nice and easy to grip. The buttons are nicely thought out, offering easy options for forward, rewind, play, pause, home, return/back, and menu. Best of all, there's a voice activation option. But here's the first negative, I don't love the functionality of the voice activation. To use it, you've got to push and hold the button while you speak, then release it. It works, but it feels clumsier than Siri or other smarter tech. More on that later.Setup is easy. Attach the cables, and turn it on. Setup your Amazon Fire TV to connect to your wifi network, or wire it into your LAN. That's about it. Since Amazon pre-loads it with your Amazon account info, there's no other setup work to do. You're up and running. If you don't already have Amazon Prime, or if you're gifting the Fire TV, there are options to use the included free trial.Your mileage may vary on this feature, but unlike the other peripherals attached to our system, Fire TV performs a special trick when turned on. It also turns on the TV, and switches the input to the appropriate Fire TV port. Wow. This is probably a Sony issue, not to be blamed on others, but the Apple TV, Wii U, Xbox 360 do not have this cool start-up interaction.So, Fire TV is attached, turned on, and ready to go.The menu system is okay. It gives options for Movies, TV, Music, Search, Apps, and more. Nothing very fancy or innovative, but it's intuitive enough. I immediately tested out the voice activation, searching for one of our favorite shows. Bingo. It immediately recognized our requested show, and loaded up Season 1 ep 1. Huzzah!The voice activation is a little clumsy. It is VERY good at hearing your request and translating into the right text for search function. It's just not very smart, not compared with something like SIRI. I tried different options, like 'play Fringe' or 'play Fleet Foxes', and it does NOT allow any activation instruction in the voice command ('no results for PLAY FLEET FOXES'). It's only good for vanilla searching, but that's still a powerful and helpful tool.Searching for TV Shows or Movies works pretty flawlessly, but searching for music is a pain. Searching for an artist returned all sorts of music, music video, and miscellaneous results. We've loaded our music library into Amazon, and sometimes use the Prime free music streaming options, but the Fire TV seemed to ignore some of the music in our library while searching. Using Amazon on the computer, you can add albums and songs to your free Prime library, but it doesn't seems like you can do this using Fire TV. Again, searching for an artist, the results of available albums and songs was spotty, seemingly incomplete for many, for whatever reason.Back to the menu system, there's another major flaw for big content libraries, which are easy to assemble considering Amazon offers so many free opportunities. Scrolling through your music by artist is TEDIOUS. Since voice search / search ignores some of the music in your library, its unreliable for finding the particular album or song that you're seeking. If you use the menu system to navigate to a particular artist, better hope that they're early in the alphabet. Otherwise, you're holding the remote button for long, long minutes at a time to scroll through your entire library. If you've got 250+ artists to nav through, it would require serious patience to scroll out to S or T. I'm not sure why they've opted for a linear scroll, rather than a grid option that would page through many more, much faster. Or an option to 'skip' to a particular alphanumeric character.About Apps. I think Apple TV wins this one, at least for the introductory phase. I prefer Apple TV's preloaded Apps, allowing me to use what I wish, ignore what I don't. Fire TV's flexibility to install what you wish is a nice idea. Disney Jr installed without a problem. Vivo did not, and encountered some error. I didn't bother to try and fix it, I don't really care about Vevo, but the basic search feature pushed me to the Vevo app, and the need to install felt bothersome. If search is going to require Apps to play content results, those Apps should come pre-installed.So much more that we haven't experience yet, especially gaming. As we use the Fire TV, I expect that we'll return and add more to this review. It's filled a void in our TV experience, allowing us to stream Amazon content conveniently, with some great perks.", "verified": true, "helpfulness": "3/3", "author": "Panda Band"}, {"rating": 5.0, "review": "This is a great device, much better than Apple TV. However it does not work well with regular batteries. It is like some of the cameras that use regular batteries, not very well. Get some good rechargeable batteries and the problem is solved. I am speculating that because the communication between the remote and the box is bluetooth, you need a little more power. The regular batteries work when you first put them in but in a few days that don't.", "verified": true, "helpfulness": "0/0", "author": "R. Delaney"}, {"rating": 3.0, "review": "Way too many buffering issues while using Netflix or Hulu.  On the same network, our Roku and Apple TV haven't the same issue.  I bought the Fire TV based on specs, like RAM and processor speed; yet another example of why specs alone shouldn't define a product.  Based on specs, this device should run circles around our older Roku and Apple TV, yet it simply doesn't.", "verified": true, "helpfulness": "7/7", "author": "R. Truax"}, {"rating": 3.0, "review": "lucky got netflix amazon not that great with movies", "verified": true, "helpfulness": "0/1", "author": "michael"}]