[{"rating": 5.0, "review": "Purchase an Amazon Fire TV in the United States for use in Latin America, particularly in Guatemala.The first time I was opened in Guatemala, it worked very well from the beginning.You do not have all the features that would be available in the U.S. but using it was exactly what I expected.The service is completely limited and perhaps is one of the most important is the Amazon Instant Video but from the beginning I knew that would not work so I do not complain about this part.I can download any application without any problem, whatever.In terms of games I can download and play all. The only thing I did not like was that there are games that take up more than 2GB and only a little 5GB of memory, which makes it fills very quickly.Although it is not clear that it serves the USB port on the rear.Netflix, Crackle, Youtube works perfectly.I hope someday allow use Amazon Amazon Instant Video in Latin America! It would be really great!", "verified": true, "helpfulness": "0/0", "author": "richieavila"}, {"rating": 1.0, "review": "When you offer The Blaze TV I will consider purchasing.  I already have a Roku & like it very much!", "verified": false, "helpfulness": "1/13", "author": "Mary Hynes"}, {"rating": 4.0, "review": "This is the best streamer that I have had so far. The machine is really snappy, and the content selection is good. Youtube, Hulu, Netflix are here and of course Amazon. There are a few critical apps missing: HBO Go and the sort (for most people, I don't have HBO and I don't care).Has decent wifi capability (I have a very noisy wifi neighbors and it still manages to stream from my old router).The hardware is very good for what you get, and is probably slightly subsidized by Amazon (meaning, the thing probably costs more than what it is sold for); Amazon probably makes up for it with increased content sales.App selection is still very poor, but I am confident that it will improve. Which leads to the real two problems that I have with the device:1. You cannot connect an external disk to this thing and play content from it.2. You cannot expand the storage. If you download a bunch of heavy games, you will max out the internal storage really fast. And then you have to \"manage\" the space of the thing. This is silly in an age where a SD flash card with 32GB of storage costs $12.Issue #2 may eventually be fixed. For issue #1 there is a possibility to stream content to the Fire TV, with either Plex or AllCast (which I have not tried yet). Plex is a hit or miss app, content does not always appear.", "verified": true, "helpfulness": "0/0", "author": "Nikolai Hristov"}, {"rating": 2.0, "review": "Do not get this if you plan on using plex with surround sound! The only format that the fire will support any audio above stereo is MP4. Since most Plex users use mkv format this makes this box a dud. Its a real shame because the interface is much better than Roku. But no surround on Plex is a deal breaker. No amount of transcoding or tweaking can really fix it without re-encoding your files. Its a known flaw in the Plex forums but with no real workaround. Its an Amazon issue.", "verified": true, "helpfulness": "1/1", "author": "JASON R."}, {"rating": 4.0, "review": "I bought one of these for my girlfriend in May '14 and installed it for her because she was already a Prime subscriber. Very nice looking unit that is packaged in a very nice box so if you are giving it as a present you won't have to package it up any nicer. Setup was extremely easy even though her's was not pre-registered to her Prime account. There is a short tutorial when it starts up and after that it is very easy to use. I researched ahead of time and had also ordered the $6 HDMI cable because it does not come with that. It worked great for her so I ordered one for myself shortly after that because I cancelled cable TV last year and have been living on antenna TV and DVD's. I have been using it fairly often and have had no problems at all. I did buy a new standard DOCSIS 3.0 modem and increased my internet speed quite a bit so I don't know if there are streaming problems at slower speeds or not.I did buy it so I could watch stuff without paying (I am a Prime member) and I can do that, but I do agree with other reviewers that  as Prime subscribers we should be able to search for free Prime content only if desired. I can work through it but it is a pain. I watched my girlfriend's 8 year old boy keep saying \"Prime movies\" into the remote the other day so he could look for stuff that he could watch since he knows his mother is not going to let him watch anything that costs money. That doesn't work so his 10 year old brother tried and then they just gave up on it so I don't know how much they will end up using it.In summary; if you are a Prime member already, if you spend about $106 dollars you have a lot of free content you can watch but you will have to surf around for it.", "verified": true, "helpfulness": "0/0", "author": "MJH"}, {"rating": 2.0, "review": "I decided to \"cut the cable\" after believing all of the claims of Hulu Plus having \"day old shows\" and Amazons vast library of \"free\" programming.  Other reviews can explain better than I regarding the workings of the Amazon Fire system.  I will say it was easy to set up and the voice system works amazingly well. The pictures are clear, etc. However, the \"search\" process could have, should have, been better executed as it is cluttered and can seem overwhelming.  My main disappointment (and it is a big one) is the numerous additional fees. I do not watch a lot of contemporary programming but I do like the guy shows: Fast N Loud, Pawn Stars, Dual Survivor, etc.  Anything remotely current requires an additional $1.99 or $3.99 PER EPISODE.  Amazon will \"additional fee\" you to death and any savings realized from dumping the cable company can be eaten up easily.  The hype would lead one to think there would be more free programming than limited episodes of really \"old\" stuff or \"B\" series programs which did not make the grade.  HuluPlus is even a bigger disappointment, but that is for another review.* UPDATE August 28, 2014:  After a few months of LIGHT use, my Amazon Fire is kaput.  It will no longer load any content thus leaving me with the \"customer service\" headache to deal with.  Until the replacement or repair process is complete, I will not really miss it that much anyway. When I purchased this unit, I also bought a Roku 3 (refurbished) on Amazon for half the price.  Truth is I like the Roku better as it has more free content (ie: ESPN 3 for free).  Besides, Roku streams Amazon Prime as well as any other apps such as Netflix, etc. for less money and I find I use the Roku far more often than the Fire..Granted, the Fire has the voice search, but it only works with Amazon, not any other app.  And, it really is disappointing to discover how comparatively little of the Amazon Prime content is actually \"free.\"  The Fire, externally at least, appears well made but mine died way before it should have.  Yes, I want my Fire replaced and I'll use it once this is worked out.  But as a long time Amazon Prime customer and fan I find the Fire TV does not warrant the hype and fails to meet my expectations for a durable and easy to use device.**August 29 UPDATE:  Customer Service was able to \"fix\" my problem over the phone, explaining the device has an \"internal hiccup\" which they are \"working on\" but have not \"fixed\" quite yet.  Going through the steps of clearing content and then rebooting took care of it, but I was warned this \"could\" happen again.  Unlike other reviewers, my experience with customer service was positive.  However, based upon price and my overall experience with the Amazon Fire TV, I doubt I would buy it again.", "verified": true, "helpfulness": "3/7", "author": "Average Joe 12"}, {"rating": 4.0, "review": "I love the remote! The speech search feature works wells in Amazon which is all I need. The selection is fine for us.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "This product is so easy to use... and YES, my first voice search was GARY BUSEY.  I love this thing... and I use it all the time.", "verified": true, "helpfulness": "0/0", "author": "Rick Sharp"}, {"rating": 5.0, "review": "I can only compare my amazon fire to streaming via an xbox as I have not used other devices; however, overall I am very happy. To begin with, this thing is very small and anyone can use it. All you do is plug it in with a hdmi cable. It plays an introductory video (and of course you have to connect to wi-fi) and you are good to go. I love the ease of the remote. I have not used the voice commands yet as I typically watch netflix (though i have prime). Things load up very quickly and I also like that you don't have to turn it on and off. While this may sound silly, I always forgot to turn off my xbox (or fell asleep). This device hibernates on its own and you don't need to do anything. The only negative I have found so far is that quite frequently I get a message that it cannot play this title right now and it returns me to the previous netflix page. While this happened once in a blue moon on the Xbox, it was rare. It may happen 3 or 4 times during a show. Luckily, it is a small inconvenience as I just press the middle button again and the title always starts back up. I still am giving it 5 stars though, as this is no biggee and still takes less time than turning an xbox controller back on!", "verified": true, "helpfulness": "1/1", "author": "Rachel Mays"}, {"rating": 5.0, "review": "I got tired of our Roku and saw this. It works great. Not bad price either. I recommend it too", "verified": true, "helpfulness": "0/0", "author": "pegster"}]