[{"rating": 3.0, "review": "Lots of movies I would like to watch but you have to buy them or rent them.....really? 10-15-20 year old movies we have to rent them...they are not free with this system? For example.....Johnny Depp movies....there may be 1 or 2 out of 25 we can watch for free.....would really love to watch these older movies for free.....we have them on dvd but is much more easier to watch them with prime....this is why we got prime to do away with our dvds but if there are no movies of our interest then why have this system? Really would be WELL worth the money if we could watch any of these older movies for free.....I do not expect to watch the newer releases like even up to 1 year ago for free but really? the older ones we have to rent? and these older ones we can rent for free or 1$ at our local rental place you guys want 2-3$ a movie! Please change this!!! Thanks!!", "verified": true, "helpfulness": "0/3", "author": "Jim Hicks"}, {"rating": 5.0, "review": "If they'd just make the search function work on all media sources this device would be about perfect for a set top box.", "verified": true, "helpfulness": "1/1", "author": "Bryan Shaw"}, {"rating": 5.0, "review": "This is one of the nice things about prime membership, free shipping and prime tv. We are enjoying using it.", "verified": true, "helpfulness": "1/2", "author": "Jeanne F. Homan"}, {"rating": 4.0, "review": "My family and I absolutely love this product. I wanted to drop my cable service and decided to research other options and came across the fire amazon fire TV. Once I read the reviews, it took another month before I ordered it. First the shipping is excellent. I ordered it on a Wednesday morning and It arrived via FedEx on Saturday...WOW. My son and I plugged it into our Toshiba 65\" with the  HDMI cord and the magic happened. This set-up is elementary. We put our passwords into HULU, NETFLIXs, Pandora, Youtube, etc and watch movies all night. The size is great.", "verified": true, "helpfulness": "1/1", "author": "markisha"}, {"rating": 4.0, "review": "I do enjoy my Fire TV but when will I be able to listen to my Prime Music on my Fire TV?", "verified": true, "helpfulness": "2/3", "author": "sailfish836"}, {"rating": 4.0, "review": "It's ok... the worst part is I can't see the tiny little print that they use to describe content... EVEN WITH MY DRIVING GLASSES ON... I'm 35 not 85!!!  How could the designers make such an oversight?  I have to get right up to the tv to pick something... not fun.  The setup was extremely easy.", "verified": true, "helpfulness": "4/8", "author": "Andwelesmomma"}, {"rating": 5.0, "review": "everything i have expected for portable home entrainment. id definitely say this is better than the roku.", "verified": true, "helpfulness": "1/4", "author": "Daniel B."}, {"rating": 5.0, "review": "Plugged it in and it works great. Great variety of movies using Amazon Prime and Netflix. Not enough time in the day to see it all.", "verified": true, "helpfulness": "1/2", "author": "Home Project Guy"}, {"rating": 5.0, "review": "Amazon's media and prime content deserved the best streaming server.  This is a must have and I can't believe how much 'legacy' shows we have discovered as a family.  Thank you Amazon", "verified": true, "helpfulness": "0/0", "author": "Chip"}, {"rating": 4.0, "review": "Have had a succession of Roku boxes, starting with the first one up to latest Roku 3. The Fire TV ihas snappier performance across the board. Videos load noticeably faster and look great. Has a good selection of  apps, including TWiT TV and Plex, which are essentials for me. Netflix performance is great. Loads much faster than Roku 3.Cons: Would have given 5 stars, except for it currently does not have HBO Go, which is a big deal for me and is available on Roku now. Almost a deal breaker, but they say it should be added to the Fire TV by the end of the year. Voice search is cool, but it it is limited to Amazon offerings at this time. It needs to be universal to be truly useful, but I expect them to get there eventually.Even with the two cons, I recommend this device to anyone looking to purchase.", "verified": true, "helpfulness": "1/2", "author": "Stiksister"}]