[{"rating": 3.0, "review": "Easy to setup and use. However, apps are very limited, Even Chrome does not supported.And the review needs more word. Gotta say youtube have done a really good job on all kinds of platforms.", "verified": true, "helpfulness": "0/0", "author": "fei lin"}, {"rating": 4.0, "review": "Nice little unit.  Cannot wait till there are more apps.  Very user friendly. This is a nice product and worth the dollars.  Much better than Apple TV for long term streaming.", "verified": true, "helpfulness": "0/0", "author": "oarbutt"}, {"rating": 5.0, "review": "Best price I found on the web.  Shipping was fast!!  I have Roku on one tv and added this to the other.  I now have one to play movies for the kids.  We follow the Canton Charge, NBA dLeague.  I can now watch the games on tv!!  (Youtube). I just wish google had more apps.", "verified": true, "helpfulness": "0/0", "author": "T. Murphy"}, {"rating": 2.0, "review": "The devices seems simple to use and probably is if it worked consistently.  My device requires me to reinitialize the account every time.  It worked great when I streamed Netflix the first time I got it to work then when I went in the second time I had to reiitialize my account.  What a pain...", "verified": true, "helpfulness": "0/0", "author": "Adam J Sortino"}, {"rating": 2.0, "review": "If you don't already have Netflix capability then this could be OK, but it takes forever to load the streaming videos.  We already have a TV that has Netflix, so we wanted this because it says it streams HBO Go and Hulu+... NOT TRUE!  Lame.  We returned it.  You are probably better off with a ROKU or something else. This is a great idea, but it needs a lot of work.", "verified": true, "helpfulness": "0/0", "author": "JLW"}, {"rating": 5.0, "review": "So cheap yet so awesome.  I use it daily and I canceled my cable subscription as well. I put an antenna in the attic to get CBS, FOX, NBC, and ABC.  Then I use chromecast to supplement what I do not get for free over the air with the antenna...", "verified": true, "helpfulness": "0/0", "author": "Bryan D Shephard"}, {"rating": 3.0, "review": "It is basic and works just with YouTube and fresh rate is slow. Hope Google expands on user tools very soon.", "verified": true, "helpfulness": "0/0", "author": "Dhar Jattipatti"}, {"rating": 4.0, "review": "I really like this media player, it works perfectly good quality of image and audio, I'm no giving 5 stars only because it doesn't have too much applications on its compatible list yet, once they have more than the bunch of apps I'll give them 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Alan Cruz \"alanof\""}, {"rating": 3.0, "review": "It is awkward to use. I think I will stick with my Roku. I am a Google fan, but they missed the mark with this one.", "verified": true, "helpfulness": "0/0", "author": "Dirk P. Dorresteyn \"Dirk\""}, {"rating": 5.0, "review": "I love this thing.  I leave it on my Bedroom TV and control it with my iPhone.  No buffering, clear picture and sound...and I can use the closed captioning which is easily controlled through the phone.  What a cool invention.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]