[{"rating": 1.0, "review": "Hated it.  Not comparable to a Roku or Apple TV (which is also not comparable to a Roku).", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "I have two of these devices and they worked great until an update around Sep. 9, 2014 (Build 19084).  There have been lots of complaints about the update (search for \"chromecast build 19084\").  Since it's been only a week, it's too early to see what Google will do, or if it's really a Netflix problem, but I won't buy another Chromecast until it's fixed.  That said, both Chromecasts stream perfectly, but the iPad or iPhone we use to control it (stop, start, back, forward, etc.) somehow gets disconnected from the stream, so the stream just continues until you power cycle the Chromecast.  Google may have also dropped support for older devices like the original iPad and the iPhone 4, which worked with Chromecast until this new software update, but don't work with it after the update.  Stay tuned for the next software update.", "verified": true, "helpfulness": "0/0", "author": "gb"}, {"rating": 4.0, "review": "sometimes there is connection issues i wonder if it is an isolated issue.", "verified": true, "helpfulness": "0/0", "author": "Sabindra Pradhan"}, {"rating": 5.0, "review": "best thing since television", "verified": true, "helpfulness": "0/0", "author": "wayne L. minear"}, {"rating": 1.0, "review": "The WIFI on the chromecast is not all that strong, you need to be near your router, or it won't work. and it won't tell you what is wrong, it just says error during installation try again. I work with computer all day and install all my hardware and software, still took me 1/2 day to figure out what was wrong.even the support website was no help at allalso the apps are not installed on the device like apple tv, you need to install the apps on your own smartphone or tablet, one by one", "verified": false, "helpfulness": "1/1", "author": "koory Hashempour"}, {"rating": 5.0, "review": "Works great! Great product. Props to seller!!!!", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "Lovely concept", "verified": true, "helpfulness": "0/0", "author": "Ahmed F. Kilani, Ph.D."}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Andy Yu"}, {"rating": 5.0, "review": "This works as advertised.  It did take me a bit to understand the way it works but once I did it was a piece of cake to use.", "verified": true, "helpfulness": "0/0", "author": "owen"}, {"rating": 4.0, "review": "If your Wifi is old, you may need to upgrade it to get Chromecast to work.  I was using an old Motorola Netopia 3347 router but was planning on upgrading it anyway.  My only complaint is that I wasted about an hour trying to do the install; I even called Google Help and all they had to offer was to \"reboot the Wifi and do a hardware reset on the Chromecast device and if that doesn't work, reply to the email\" that they sent regarding the trouble ticket.  I had already rebooted the Wifi so I stopped the install and just ordered a new WiFi device.  I selected the Ubiquiti Networks UniFi AP Enterprise WiFi System.  I just couldn't use Chromecast until the new AP arrived.  Now the Wifi and Chromecast are working great.", "verified": true, "helpfulness": "0/0", "author": "The Rabbit Whisperer"}]