[{"rating": 1.0, "review": "I can't get it to work.", "verified": true, "helpfulness": "0/1", "author": "marie"}, {"rating": 5.0, "review": "Love this player! I've bought two of them.  They are so versatile. You can send  anything on your phone to your TV. This can do everything Roku can do and more.", "verified": true, "helpfulness": "0/0", "author": "Thomas W."}, {"rating": 5.0, "review": "Excellent Product Overall!!!", "verified": true, "helpfulness": "0/0", "author": "Charles Larson"}, {"rating": 5.0, "review": "Works wonderful cannot understand what people write", "verified": true, "helpfulness": "0/0", "author": "JohnR \"JR\""}, {"rating": 3.0, "review": "It's a cool toy at a great price, but currently has limited functionality (project certain videos from computer/mobile to TV) so I end up not using.  Also has glitchy performance in all the various settings and devices I've tried.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 3.0, "review": "I really wanted to like Chromecast and was excited to get it in. The instructions made it seem like setup should be rather easy, but it took me sifting through forums on router setting configurations for Chromecast to get it to finally connect. Now the setup is easy, but Chromecast decides to disconnect about once a week, and doesn't work seamlessly with most of the apps on my smartphone. I like it well enough when it works, but it has enough issues to be frustrating. Streaming from the chrome tab from my PC works much more consistently than the smartphone apps.", "verified": false, "helpfulness": "0/0", "author": "thedoogmeister"}, {"rating": 5.0, "review": "So much fun and easy to use.  I even bought my parents one and they use it all the time.  One of our favorite activities is sitting in the living room and we all just build a huge playlist of music videos from youtube.", "verified": true, "helpfulness": "0/0", "author": "Nick Ramstead"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Jamestwelch"}, {"rating": 5.0, "review": "We got this because we have a TV that doesn't have an internet connection.  We use it for streaming Netflix and Pandora mostly.  Works flawlessly.  I had a few issues with disconnects using my phone, but none with my tablet.", "verified": true, "helpfulness": "0/0", "author": "Goodolsen"}, {"rating": 5.0, "review": "works ok", "verified": true, "helpfulness": "0/0", "author": "BW"}]