[{"rating": 5.0, "review": "Its the best invention ever!", "verified": true, "helpfulness": "1/2", "author": "Lynn"}, {"rating": 3.0, "review": "This product has a lot of nice features but is horribly organized! I am a Prime Member and love to shop at Amazon; however, the organization of Fire TV is horrible. I thought I was upgrading from my Roku 3 by purchasing Fire TV but in actuality I still use my Roku more because it is much better organized than Fire TV. I'm not sure why Amazon feels the need to make the consumers toggle through their apps/products just to get to our favorite apps. Roku has a home screen that allows consumers to see and organize our favorite apps the way we like without having to toggle through unwanted apps. This is something you'd expect from Fire TV being an upgrade and all....... I am a regular shopper and Prime Member at Amazon, I know how to purchase through them without having their products crammed in my face every time I want to view my favorite apps. Amazon, please dedicate a home screen to the consumers so that we may organize and view our favorite apps the way we like. Lastly, allowing the viewers to search other apps like Netflixx with the voice search would be nice. If not I'll have to switch to apple tv when they come out with their new model later this year which is suppose to have all the new upgrades. I'd like to stick with Fire TV. With those adjustments I'd give them 5stars. Hope you are listening. Thanks", "verified": true, "helpfulness": "0/0", "author": "Nicky"}, {"rating": 1.0, "review": "The unit worked great for 12 and a 1/2 months then it could no longer connect to the internet, it seems all amazon products only last a year. I had a kindle that lasted 11 months and then died. The problem is Amazon like so many other companies that want to be in the electronics industry, find a product from an overseas vendor and slap their name on it. The unit only has a 1 year warranty for a reason, they only expect you to get one year out of it before it dies. Do yourself a favor and purchase the Google Chromcast or Apple TV or the Roku 3 device its less money, The fire TV is loaded with stuff that you will probably never use. Amazon Customer service used to be top notch but it took two days after my initial contact to even get a response, thats typical of how Amazon treats its vendors not its customers, but it seems thats all changed now. I have an Amazon Echo that I expect will be dying in 5 more months based on the life cycle of Amazon branded product. I will never purchase another product branded Amazon unless I only plan to use it for a few months.", "verified": true, "helpfulness": "3/6", "author": "Martin Fensterstock"}, {"rating": 2.0, "review": "Sorry I had to return I'm very happy withe my sources", "verified": true, "helpfulness": "1/4", "author": "D. Papagiannakis \"TROULIS\""}, {"rating": 2.0, "review": "I am having  issue with Youtube search stuff, I will call support and see and check If something I am missing.", "verified": true, "helpfulness": "0/2", "author": "shabbir hussain"}, {"rating": 4.0, "review": "I really like this product and would highly recommend it. It's fast, easy to use, and I love that it has access to so many things I want to watch on my TV rather than a computer or tablet. I also think the graphics are better than when I'm watching cable TV. I also love the remote - its size, ease of use, and the voice feature. The only things I would say is the voice feature only works in the Amazon app, not in Netflix or any of the other ones. And sometimes the search finds are not exactly what I'm looking for. But overall, I would definitely recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Stephanie A Crites"}, {"rating": 5.0, "review": "So far I love it. I will continue to use and see if I can replace my cable.", "verified": true, "helpfulness": "0/1", "author": "Rudolph Jackson"}, {"rating": 5.0, "review": "Awesome. Got rid of Dish and now save over $125 a month.", "verified": true, "helpfulness": "1/2", "author": "M. Metz - Albuquerque, NM"}, {"rating": 5.0, "review": "It met my expectations!", "verified": true, "helpfulness": "0/1", "author": "awesome job"}, {"rating": 5.0, "review": "Simple and easy to set up and useWould recommend this to anyone", "verified": true, "helpfulness": "1/2", "author": "Roxanne Christian"}]