[{"rating": 5.0, "review": "I have read some really silly and badly placed reviews here. This is an amazing product. All be it that apps are limited, for a Prime member its amazing. When an app comes out to sync with a home media server it's game over for every other product. Just like the instructions says. Plug in connect to the internet and enjoy. Learn how to use what you own \"Everyone else\"", "verified": true, "helpfulness": "2/4", "author": "Dustin Cross"}, {"rating": 5.0, "review": "I've tried most and returned most.You would have to fight me to get this back.I sat and talked to it all day and it didn't miss a word.Don't know why there aren't lines around NYC to by this future item.", "verified": true, "helpfulness": "2/4", "author": "Richard Piazza"}, {"rating": 5.0, "review": "The Amazon Fire TV only took a couple of minutes to unpack and install. The network set-up was easy. Don't be fooled by the unit's small size, inside Amazon has packaged a lot of functionality. The remote is well designed and the voice mode for searches has been accurate for me in each usage. The initial video nicely explains the unit and its features. I find this to be great with Netflix and Amazon Prime Video; after installing the YouTube application, I also enjoyed some music videos.In short, I am delighted with this produce!", "verified": true, "helpfulness": "3/3", "author": "Robert P."}, {"rating": 5.0, "review": "This device delivers a tremendous array of content.  I have a chromecast device as well.  The amazon fire TV device works much better because it has much more content.  The voice search works really well and the remote is very solidly built.  Lots of TV programming and apps. I am not a gamer so I can't comment on it.  I highly recommend this product.  It does not come with an HDMI cable which is needed.  All you need is your network and Netflix passwords, that is if you have an account.  Well worth the money.", "verified": true, "helpfulness": "3/3", "author": "Dano1988 \"Dano\""}, {"rating": 1.0, "review": "Get lost Amazon. Friend got this and wished she hadn't. Better to stick with a Smart TV or any BluRay player that has all these apps and much more on them. Amazon trying to make a buck on nothing and acting like its the most groundbreaking thing since......", "verified": false, "helpfulness": "7/48", "author": "zx2781 \"zx2781\""}, {"rating": 2.0, "review": "The main reason I'm writing this review and returning the product is because of the silly implementation of Parental controls. Amazon has an inconsistent approach to providing this ability and this product implements it differently than any other product that you use to watch your Amazon video.If you activate parental controls on this product you have  enter your PIN for EVERY video you watch.  It does not use the restrictions based system in your Video Settings portion of your account.  Very tedious and inconsistent.", "verified": true, "helpfulness": "5/10", "author": "Bruce Kessel \"avid reader\""}, {"rating": 1.0, "review": "Got it hooked up, and connected to wifi for it to download the update. Never will connect. I think its ignorant that it should even need an update out of the box. Will update review if support can help me, but as of now I feel like I made a lateral move, or worse, getting this to replace a chromecast.Update: stayed on the phone with firetv tech assistance for ~1hr and they didn't know what to do. The guy I spoke with was very nice, but said the only thing he was seeing to do was try to leave it on overnight and let it keep trying to download, even though it said it couldn't. Well, that didn't work. Same think 7 hours later. In other words, it still sucks.", "verified": true, "helpfulness": "11/28", "author": "Brian C."}, {"rating": 3.0, "review": "So far I really like this box, I've sideloaded HBOGO and XBMC  so along with Netflix my video needs are mostly satisfied. My major gripe is how Amazon has hidden away is free prime video.  Rentals and purchases are right in your face, but there really needs to be a way to browse free Prime video. Give me that and I'll add stars.", "verified": true, "helpfulness": "5/8", "author": "Jeffery A Elkins"}, {"rating": 1.0, "review": "It pains me to write this, because I am a loyal AmazonPrime, Kindle and Audible.com member, but the product that I received is a fail.I have been \"setting up\" for over two hours.  I have a wireless network that downloads at 20+MPS and downloads between 12-15 MPS as measured exactly where the device is located.  I have been through two complete, painfully slow \"network updates\" during the which the device indicates that I have a \"slow internet connection\" (meanwhile multiple other wireless devices are working flawlessly throughout the house and immediately near this device) .  After the \"download\" indicates that it is complete, the installation fails part way through and the device resets and begins again on a software download.Kind of like \"Ground Hog Day\" - but this device is not learning.The only thing that I can compare this to is internet dialup in the early 1990's.  I remember ATT Worldnet used to take endless time to download and fail on Washington Post content.  Jeff Bezos, did you use some of that old ATT Worldnet software that the Washington Post had in a dusty storage corner?I have Verizon FIOS to the house at 50/25 and the wireless speeds indicated above.I watched the various \"unpacking\" videos on YouTube and am glad that that early testers were able to get their devices to work.All I get after each software update and installation is:\"System update is not successful at this time, Amazin Fire TV will restart in a few minutes\"Maybe Gary Busey is the appropriate spokesman for this product.....I guess I will send the AmazonFire back.  Very disappointing to release a product or a product that relies upon network support system for downloading firmware-type software upon its initial release.  It is does require such massive firmware downloads, the  Amazon network should be able to provide the support to enable the device to function.Since I started drafting this review, the device went through another \"software update, installation, installation unsuccessful\" cycle.Signed,Sad, sad Amazon Prime customer. \"Partying like its 1993\"", "verified": true, "helpfulness": "379/436", "author": "Paul Nolan"}, {"rating": 1.0, "review": "One major reason I purchased was access to JUSTIFIED. Have to pay ,even as PRIME user !!  SUCKS FOR ME !", "verified": true, "helpfulness": "10/36", "author": "Gregory T."}]