[{"rating": 5.0, "review": "Love it..", "verified": true, "helpfulness": "0/0", "author": "abel banda"}, {"rating": 5.0, "review": "Awesome!!! Extremely fast loading and playing of videos.  I was worried that I might have issues with buffering/interrupted play due to my internet speed ( I have a \"smart\" Blueray player and was unable to watch videos on it using apps like Hulu, Netflix etc. due to constant buffering) but have not experienced any problems with Fire TV.  Very user friendly, easy to install, and the very small size of the box makes it easy to hide.  If you are an Amazon Prime member, then you get access to tons of free movies/shows.  Even if you are not a prime member, you can still rent many movies (I found the prices were slightly cheaper than my current cable company) or use the Netflix, Hulu, etc. apps.  I also like that the Fire TV can work in conjunction with my Kindle Fire HDX.  All of my photos are readily available to view on my tv if desired.", "verified": true, "helpfulness": "1/1", "author": "JH"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "dardo martinez"}, {"rating": 5.0, "review": "Best streaming system I've found n I have Roku n Netgear. Very intoxicating n fun. One u start using tv become obsolete.", "verified": true, "helpfulness": "0/0", "author": "Sharon A. Abraham"}, {"rating": 3.0, "review": "Coming from a Roku, I'm not at all impressed by this interface. It's a lot more cluttered than my Roku and it seems a lot harder to find things. It seems focused around selling you movies through Amazon, for obvious reasons, with apps like Netflix and Pandora seeming like a secondary focus. The search function doesn't work with Netflix at all, and even among Amazon offerings, doesn't seem to work properly. A search for \"how I met your mother\" yielded seven results, many with Neil Patrick Harris, but none of which were actually \"how I met your mother\" despite the show being available for purchase through Amazon Instant Video. There's also no option to control it through an Android phone. Both Roku and Chromecast have this option so it seems like a pretty big omission.I would like to say that the box itself is very beautifully designed! Much more elegant than the cartoonist-looking Roku. And even though there's no Android app, the Bluetooth remote is a fantastic feature! I wish I could pack the Roku interface into Amazon's hardware! Sadly, interface wins out for me and I'll be returning this shortly.Update: So after a little more digging around, it would seem that the shows that I thought were missing were not actually missing.  They're just displaying the wrong image.  For example, the previous search for How I Met Your Mother actually did come up with the show itself, but the image displayed for the show is for a mini-series called, \"The Bro Code Six-Pack.\"  Likewise, searching for Chopped shows the image for the \"Chopped: Grill Masters\" mini series.However, I've come across another annoyance with the Fire TV.  Every time I install an app, it sends me an \"order confirmation\" email.  To me, this reinforces the idea that the Fire TV is first and foremost intended to view Amazon content, with additional channels being a secondary benefit.  Contrast this with the homogeneous ecosystem on Roku or Chromecast where no single app or channel gets priority over any other.", "verified": true, "helpfulness": "0/0", "author": "Eryk"}, {"rating": 5.0, "review": "Works great. You get real 5.1 or better digital sound from Netflix. No worrying about buffering crap either. I would purchase another one quickly if this unit breaks down. I depend on it.", "verified": true, "helpfulness": "0/0", "author": "gipsyman"}, {"rating": 2.0, "review": "We live in a rural area, dsl is available but not the best speeds. We had a roku for a few years and it streamed pretty well, all things considered. My husband decided the amazon fire tv would be better, so we got one. I have been disappointed since the first day. The picture is better than our roku, but the streaming is awful. In fact tonight I shut it off in disgust after the first 10 minutes of a show had to load every 10 seconds or so. I expect to have some trouble because of our dsl speeds here, but this is ridiculous. Even amazon prime streamed better on our roku. We had high hopes for the fire tv, but it has greatly disappointed us. If you live in an area where your internet speeds aren't the greatest, don't buy this device unless you just enjoy watching shows load every 10 to 30 seconds.", "verified": false, "helpfulness": "2/3", "author": "CurlieGrandma"}, {"rating": 4.0, "review": "Nice build quality.  Great video quality - better than using a pc to stream amazon prime video.  Voice search works well.  Just wish that more movies were available for free viewing w/ prime.  Have not tried with Hulu or Netflix so can't comment. Have not tried game apps yet either.", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 5.0, "review": "I like it the way amazon gives the true skinny on theirs and the market at large. I trust the honorable company more than the ME company. keep up the good work amazon.", "verified": false, "helpfulness": "0/0", "author": "Don Sr."}, {"rating": 5.0, "review": "This is so great. I had the Google Chromecast but returned it and got the Fire TV instead.....SO much better. Even little things, like with Netflix, Amazon Fire TV automatically goes to the next episode (with Chromecast, I had to manually go back and select it). And with Chromecast, I had to select an episode, load it, then pause it and load it in Chromecast. And it didn't work well with Amazon Prime shows. Maybe it's not fair to compare since Fire TV is about 3x the price of Chromecast but still...it's night and day. I also love the remote.I did have some sound quality issues in Netflix briefly, but restarting the Fire TV box solved the problem. Since then, no issues!", "verified": true, "helpfulness": "1/1", "author": "JenBar"}]