[{"rating": 4.0, "review": "Disappointed that there is no Chroecast app for older Ipad1 . The app works with my 3GS iPhone,so it seems to be a crapshoot .", "verified": true, "helpfulness": "0/1", "author": "Jerry D. Gibson"}, {"rating": 1.0, "review": "I bought this for Christmas and then spent and entire day trying to get a stable connection with the toogle, my ipad, iphones, laptop.The setup was easy however for a zillion reason we could not Cast between any of the devices we have in the house to the Samsung HD Plasma TV.  The box came with no directions except a stupid plug and play which is always bad news.The comcast wifi connection kept dying between the toogle and simply returing a error message of..ready for this...\"OOPS\" I'm not kidding \"OOPS\".  Save your money and headaches and don't buy this electronic not ready for prime time junk.", "verified": true, "helpfulness": "0/3", "author": "JS NH \"Tech Guy\""}, {"rating": 3.0, "review": "HBO go does not come in on that Netflix does. Netflix works good however I would like more apps thank you .", "verified": true, "helpfulness": "0/1", "author": "Autrey"}, {"rating": 4.0, "review": "Google Chromecast is a good product; however, it could use some improvements. Firstly, if you have a router that is more than 2 years old, there's a good chance that you may have to upgrade your unit to work with Chromecast.  Your internet provider should switch it out for you for free.  I have FIOS and Verizon just sent me a new router in the mail when I told them the router was incompatible with Chromecast.  Once you download the software from the Google site, the setup is fairly easy. You can even set it up with an app on your phone as I did.  Simply plug in your Chromecast to your TV, connect it to your WiFi, and follow the instructions displayed on your TV screen. You must use the Google Chrome browser with Chromecast, which is a con for me, BUT on a positive note you can open other tabs without disturbing your streaming. Personally, I like my Safari browser better, but the show must go on. When you open Chrome, it asks you to merge all your Google accounts, e.g., Gmail, Youtube, Google +, etc. Negative. Google get out of my business. You needn't merge your accounts to operate Chromecast, thankfully. I like that there is a simple icon to start \"casting\" (streaming) to your TV.  It's intuitive. I saw the icon and figured I should click on it and presto something started happening with the TV screen. While Chromecast streams like it is supposed to do, there are very few sites that are optimized for Chromecast streaming.  Netflix is optimized but some shows gave error codes stating that they could not be streamed with Chromecast, e.g., I received error codes with some episodes of the Boondocks but had no issues streaming other episodes. Perhaps there were connectivity issues with Chromecast itself.  Chromecast did freeze up a few of times while streaming and I had to reboot the unit, but no technology is without its kinks. We casted nearly 15 hours of Netflix and spent maybe 20 minutes total with rebooting (we had to reboot a couple of times on one particular day). The occasional reboot is not a deal breaker for me. Overall, it is a solid product and does what it is supposed to do.  Once more sites are optimized for streaming it will be an even better product. For the price, I am satisfied with the product and I would recommend it.", "verified": true, "helpfulness": "1/1", "author": "BronxChik"}, {"rating": 5.0, "review": "Very easy to install and set up.  Does exactly whats advertised and does cheap!! $35 a worth while purchase for anyone", "verified": true, "helpfulness": "0/0", "author": "Paul porrini"}, {"rating": 5.0, "review": "The Google Chromecast is fantastic. It was easy to install and super easy to use. It makes streaming video and music to my living room fun", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "Wow, how easy is that to use and watch Netflix on our television!Amazon went above and beyond the call when we ordered this item as it was not only shipped right away, but arrived the day before we were expecting it.When we plugged in the device it immediately began its setup procedure and just was so easy to use.Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "My living room TV setup has a smart tv with GoogleTV as well as other internet content streaming devices like PS4, however my bedroom TV was just a regular \"dumbTV\" (not internet connected). I didn't want to spend a whole lot of money to be able to get good content on that TV and this turned out to be a perfect solution!The Chromecast comes with the Chromecast unit, a USB cable, a wall power adapter, and an HDMI extender cable. Setup was a breeze. You plug in the Chromecast unit into an HDMI port on your TV or receiver, you then plug the usb cable into the Chromecast and the other end into the TV (only if the USB port on the TV says \"USB\" or has the USB symbol, if it says \"service\" it won't power the device). If your TV does not have a proper USB port you can use the power adapter and plug it into the wall. Once I plugged it in the TV immediately showed the Chromecast setup screen and asked me to go to [...] . There you can connect it to your network and after about 3 minutes of downloading updates, the Chromecast was ready to use (almost).I did the setup using my android tablet (Samsung Galaxy Note 10.1) and I first needed to download the Chromecast app from Google Play store. After I downloaded the app I then had to download apps for the content providers, namely Netflix and HuluPlus (I already had Youtube, HBOgo and Pandora). When you launch one of those apps there is a little icon you can click to stream to the Chromecast. Important to note that the Chromecast DOES NOT mirror your screen! If your in HBOgo and you click the chromecast icon, your TV then shows the HBO logo until you press play on a movie/TV show. Your scrolling through menus does not show up on the TV. Also during play the movie only shows up on the TV while you are free to use the tablet or computer for other things!Using a computer you can sortof do a screen mirror using tab casting. Its not quite screen mirroring since you can only cast a  tab in a Google chrome browser (assuming you downloaded the chrome extension). I prefer to use my tablet since the native apps like HBOgo and Netflix work better than streaming on my laptop for some reason. My laptop streams come through choppy (not a fault of the Chromecast, its just always been that way on my laptop).The streaming video came in great, no choppyness at all. The audio sound good too.The reason I only gave this 4 stars is because:1) There is no Amazon Instant Video app and I have purchased a few movies on Amazon over the years and there are a few things on Prime I'd like to be able to watch.2)Showtime Anytime app is not supported. HBOgo is supported but not Showtime Anytime? Showtime has some great original programming and since I do not have a cablebox in my bedroom I would like to be able to watch Showtime via the Chromecast. As of right now this is only possible via tabcasting3)Tabcasting is not supported on Android tablets or phones. My tablet uses a Chrome browser, why can't I download a chrome extension for Chromecast? Its ridiculous that a tablet with an Android operating system (created by Google), that uses a Chrome browser (created by Google), isn't fully functional with the Chromecast (created by Google).Hopefully these things are fixed in future updates. If and when they are I will update my review/ratingAt the end of the day, this only costs $35. The low cost makes this a great buy even with the limitations", "verified": false, "helpfulness": "0/0", "author": "Banquero"}, {"rating": 5.0, "review": "We set up 3 devices to control Chromecast  - Acer Chromebook, macbook, and iPad. Streamed from YouTube - better than ps3!", "verified": true, "helpfulness": "0/0", "author": "TC"}, {"rating": 5.0, "review": "Installation was quick and easy. Took about 8 minutes to initialize and name the device. Once set up, it moves easily to other TVs. I was able to watch Netflix and YouTube, and listen to Pandora on an ipad mini, ASUS tablet, Samsung Galaxy phone, Windows laptop, and Windows PC- all without issues. The picture quality and sound were all good. I am hoping that more apps are added to the device soon such as picture viewer and imovies.", "verified": false, "helpfulness": "0/0", "author": "lr"}]