[{"rating": 2.0, "review": "Set up to use on IPad Air; so hard to work with; As I am watching my program on my TV, then try to access other apps on my Ipad, almost impossible to get back control of the program you were watching...  Very few apps compared to Roku. Apple TV is my second  best compared to the Chromecast", "verified": true, "helpfulness": "2/3", "author": "Bick"}, {"rating": 5.0, "review": "I love this item, just need to have Google chrome for iOS to chromecast what I am doing on the browser.Easy Set-Up, Wish my tv had more HDMI ports, I dont want to keep unplugging this.", "verified": true, "helpfulness": "0/0", "author": "Hender Maxwell"}, {"rating": 5.0, "review": "This is a wonderful product that does exactly what it says.  It's nice to be able to stream video from any device wireless.  I would would be a lot nicer if I had USB ports on my TV to power it.  Make sure you have USB capability or an outlet close by for the short power cord.", "verified": true, "helpfulness": "0/0", "author": "Richard L. Strasemeier"}, {"rating": 4.0, "review": "I got excited when I learned that there is a device that can transmit video signals from my laptop to TV. So i bought one from Amazon about 3 months ago which was cheaper than Bestbuy though. Got it, set it up, it worked like a champ on my laptop, Sony Xperio, and Galaxy Note 2 to TV. I will get another one today for another TV in my Salon business.", "verified": true, "helpfulness": "0/0", "author": "Pip Koy"}, {"rating": 1.0, "review": "it was cool while it lasted but broke on me about a week later. didn't expect much so it didn't really surprise that it broke so fast, you get what you pay for...", "verified": true, "helpfulness": "0/5", "author": "stoner"}, {"rating": 5.0, "review": "The Chromecast is very easy to use and totally convenient. Amazon is awesome, and makes shopping so convenient. Worth the money!", "verified": true, "helpfulness": "0/1", "author": "Amy"}, {"rating": 5.0, "review": "This is a great device!  Its almost to easy to setup and its fool proof to use.  Its got a lot of things coming out for it all the time and I am satisfied with its current offerings.  I can't wait for the games to adapt to it more.  Also for the price its amazing!", "verified": true, "helpfulness": "0/0", "author": "Carlo"}, {"rating": 1.0, "review": "Purchased this yesterday and spent most of the day trying to set it up. After searching web forums and reconfiguring my router, I finally found a Google number that I can call for live assistance. Seems that this product will not work with a dual-band router unless each band acts independently. Called Netgear to try to configure the router as needed, only to learn that its free assistance is only for ninety days!  What a racket.Anyway, I gave up, brought it back to Bestbuy and exchanged it for Apple TV., which was up and running in five minutes.Sorry, Google.  I gave you a chance but you blew it on the lack of technical help. You owe me an afternoon back.", "verified": false, "helpfulness": "2/3", "author": "John Clahane"}, {"rating": 2.0, "review": "Sometimes ya get a lemon...or perhaps it's me, or perhaps it's the product?  At any rate the setup was a bit confusing for the variously aged products that I have.  Perhaps it was the mix of products and their age?  <<chuckle>>  I just didn't like it, but for $30.00 I'm not going nuts about it!", "verified": true, "helpfulness": "0/1", "author": "Robert Johnson"}, {"rating": 2.0, "review": "The dongle worked from the computer to the TV, but I could not get the internet to work on TV.", "verified": true, "helpfulness": "0/1", "author": "T North"}]