[{"rating": 5.0, "review": "Writing reviewsI think the device is superb but I see no value in writing a review at this time. If you continue asking me for my rating but dismiss the rating without a written review I will dismiss any future request.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Overall this device works well, however, it's more disappointing than impressive.The pros: The voice search works pretty well. Streaming is fast even without an Ethernet cable plugged in.The cons: There is no news or sports. If you want to sign up for ESPN or Showtime, you have to have a cable account. I have never heard of the vast majority of the movie titles that are listed for Prime, Netflix and Hulu Plus. If you want to watch the most recent episodes of your favorite tv shows, you have to pay an extra $2.99 per episode.", "verified": true, "helpfulness": "1/2", "author": "Ryan Pope"}, {"rating": 5.0, "review": "I like the \"Amazon Fire TV\" box so much I bought a second one for the bedroom. There are TV shows and movies that we haven't seen or need to  see a previous season. Plus I love Pandora, now I can use it in the kitchen and my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Kathleen D. Alderson"}, {"rating": 4.0, "review": "Hi,I'm a gadget maniac and I own Chromecast, Apple TV and Fire TV. I'm really impressed by Amazon Fire TV. It's definitely my favorite TV device. The UI is very nice and fluid, I like the apps and games available in the marketplace (hopefully Amazon will add Hulu and other video streaming services). But my favorites features are:1. Kindle Fire screen mirroring - I love being able to show my family or to myself whatever I have on my Kindle screen, on a my big TV.2. Second screen support - while you are watching a movie or a serial, the Kindle screen shows a small picture with the name of each actor who appears in the current scene. You know how many time I wonder where I saw him/her before? Now with Kindle and Fire TV I can see right away. Data are pulled from IMDB so you just click the actor image and get the IMDB card - very, very cool and intelligent use of the second screen (I wish this feature will be used by other apps, like sport streaming apps and videogames).The videogame controller is high quality, almost at the same level of Xbox's.So, good job Amazon - keep working on it and you will have a killer device in few months,,,", "verified": true, "helpfulness": "0/0", "author": "Marco Verdesca"}, {"rating": 4.0, "review": "When you do a voice search it only finds things on Amazon which most of the results cost money.  I have only had it a couple weeks so this is my finding right now.Over all I do love it and enjoy the optical audio output.I do wish and hope Amazon will start using Flingo. It is a great feature on D-Link.", "verified": true, "helpfulness": "0/0", "author": "S. Sanders \"raybug42\""}, {"rating": 4.0, "review": "It's like replacing your computer monitor with your TV. All the same features but a bigger screen. I love it!", "verified": true, "helpfulness": "0/0", "author": "Danny E Atwater"}, {"rating": 5.0, "review": "I really like this product, the only thing I would want to add to it is the ability to search the internet", "verified": true, "helpfulness": "1/1", "author": "Marlene"}, {"rating": 5.0, "review": "A very nice product as it is easy to use and was easy to install.  I do recommend this to your customers.", "verified": true, "helpfulness": "0/0", "author": "Larry D. Christensen"}, {"rating": 1.0, "review": "Doesn't provide any features that roku apple tv or any smart tv or smart dvd player would.  Unless you have a Kindle Fire you really should get something else.  If you have an ipad or iphone you should skip this all together.", "verified": true, "helpfulness": "6/25", "author": "J. Frame"}, {"rating": 3.0, "review": "During the set up the remote had trouble staying paired to the Fire TV, so I had to watch the intro video twice.  Also, there is an intro video that you can't skip, which is pretty obnoxious.The user interface doesn't seem as intuitive as Roku's to me, however it is extremely responsive, which was a major issue with the Roku 1/2/Stick.It's currently missing a lot of the channels that Roku has, including HBO Go, which is very important to many people (myself included).For the price, I would suggest the Roku 3.  It's slightly cheaper and has a better channel selection, however it isn't as slick and smooth as the Fire's interface.", "verified": true, "helpfulness": "0/0", "author": "Christopher Dwyer"}]