[{"rating": 1.0, "review": "This is the worst streaming device I have ever used.  It worked great for about a week and then it started really messing up.  I usually only stream netflix for my daughter.  Within a 30 minute show, it will stop to buffer at least three times and will sometimes stop working all together.  Sometimes I can get it to work again, other times I cannot.It is incredibly frustrating and it was a complete waste of money.", "verified": false, "helpfulness": "0/1", "author": "Jessica Rooks"}, {"rating": 5.0, "review": "👍👍👍👍👍", "verified": true, "helpfulness": "0/0", "author": "Kinghkp"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "jcb"}, {"rating": 5.0, "review": "This is a pretty awesome little device..so awesome that we have 2 and we have gifted 2..the amount of apps compatible with chrome cast keep growing and its perfect for putting up youtube and netflix on the tv with ease.. google keeps added more and more features for this device and would recommend it to any one for easy streaming on the big screen", "verified": true, "helpfulness": "0/0", "author": "AL"}, {"rating": 4.0, "review": "works as expected except for amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Shari Damewood \"Shari Damewood\""}, {"rating": 1.0, "review": "It sucks", "verified": true, "helpfulness": "0/1", "author": "Salvador Quintanilla"}, {"rating": 5.0, "review": "For $35 dollars, this is the best addition to our TV. My daughter uses it every day and I personally like for streaming music from my computer upstairs. We have only had minor connections every now and then, but nothing too big. Even when we got a Wi-Fi Blu-Ray player, we still use the Chromecast for netflix over the Blu-Ray Player. The only thing I do not like about it is that it will get quite hot when running. Is says in fine print that it is okay for it to get very hot as it means it is running normally, but it does scare me a little. Other than that, you should be clicking the buy button right now!", "verified": false, "helpfulness": "0/0", "author": "Theresa T."}, {"rating": 5.0, "review": "The best streaming device for the price. Works seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Sandeep Kasamsetty"}, {"rating": 5.0, "review": "excellent product and attention", "verified": true, "helpfulness": "0/0", "author": "francisco madrigal"}, {"rating": 4.0, "review": "I purchased this product expecting a lot more features.  I can not give a negative review because it does what it states it can do.  I would rather have a product that can cast any screen that I was on.  This product does not do that.", "verified": true, "helpfulness": "0/0", "author": "Pete"}]