[{"rating": 5.0, "review": "Ran into some problems when trying to order from Amazon (probably heavy server traffic) so I ran down to best buy five minutes down the road and purchased this device for 25 dollars and some change! Really satisfied with this purchase, works off of individual app platforms from your phone.A huge plus is that it lets you use your phone or device while content is playing.", "verified": false, "helpfulness": "0/0", "author": "Robert Reyes"}, {"rating": 4.0, "review": "Good buy", "verified": true, "helpfulness": "0/2", "author": "MJ"}, {"rating": 5.0, "review": "Neatly packaged. The kids love it.", "verified": true, "helpfulness": "0/2", "author": "A. Hashimi \"Ace of hearts\""}, {"rating": 5.0, "review": "Awesome! Versatile! I use one in my bedroom and one in my living room. I take one with me when I'm staying in a hotel and it makes the experience much better.", "verified": true, "helpfulness": "0/0", "author": "R. Vaughan \"mid-cycle adopter\""}, {"rating": 3.0, "review": "I had a problem setting it up on my laptop. It came up with a screen that said my browser was not compatible even when I downloaded the Google browser to set it up. Luckly I had an app on my iPad to set it up. While streaming Netflix through either my iPad or iPhone i had trouble with the casting button staying on Netflix. I could start my movie, but ten minutes later I would go to pause it and the casting button was gone. I couldn't pause the show or do anything. Having to completely close out of the netflix app on my iOS and go back into the app it would come back so I could stop it. Then I tried using it on my Samsung tablet and had no problem loosing the cast button, and it worked very good with this tablet with the android system. So all together it wouldn't work good with my iOS, but worked great with my android.", "verified": true, "helpfulness": "0/0", "author": "Bob Gipson"}, {"rating": 5.0, "review": "Simple to set up and easy to use. Love it", "verified": true, "helpfulness": "0/0", "author": "Marlon Musselman"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Richard Froehlich \"Rich\""}, {"rating": 5.0, "review": "Simple, easy to use and really works great. I have apple TV and Roku and normally end up using the Chromecast most of the time. I watch HD streaming videos from my phone all the time.  Makes moving a slideshow to the TV a snap!PROS- Small, Simple, CheapCONS- Can not always get it to work with all phones, not sure if it is the phone or the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "John M. Kirkpatrick"}, {"rating": 1.0, "review": "It doesn't work at all. I have been plugging it in the wall. its not showing up on my TV and I am just not recommended not to connect..  why??? ha.  no farther explanation at all.  no directions to troubleshoot..", "verified": false, "helpfulness": "0/1", "author": "t.thuntley"}, {"rating": 5.0, "review": "Great item!! Highly recommended!!", "verified": true, "helpfulness": "0/1", "author": "Pedro Figueroa"}]