[{"rating": 3.0, "review": "Set up was easy but the connection does not stay on when not in use and it does not find my best wifi it picks up my older slower work wifi. I have to unplug and replug the power cord for it to reconnect. it is nice to control this from your device! I do like this product if it wasn't for the constant disconnection I would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Ryan Williams"}, {"rating": 3.0, "review": "At this point, there are too few apps available to 'cast' to my TV.  My Roku gets all the same sites and more.  Another big disappointment is that my Nexus 7 (2012) tablet doesn't work with Chromecast for displaying web pages.  It isn't good press for Google when YouTube demos show Samsung tablets rather than the Nexus.  If you don't have a Smart TV, a Roku or other box, Chromecast may be a good low cost introduction.  If you have one of these other devices, wait or be very careful checking if your existing tablet or laptop will accept the Chromecast extension.", "verified": true, "helpfulness": "0/0", "author": "SantaFe Dave"}, {"rating": 5.0, "review": "Put this on a tv that does not have the smart features and didn't want to have to get a blu ray or game system. Works awesome, Wish Amazon Prime was available.", "verified": true, "helpfulness": "0/0", "author": "David Draper"}, {"rating": 3.0, "review": "It'd be great if it were possible to cast any content from any Android device, but it seems only certain apps allow this, such as Netflix, YouTube, HBO GO, Hulu Plus, Pandora, or Google Play Movies (and Music) mobile apps as well as \"select content\" through the desktop Chrome browser (but not from Chrome on Android).Fortunately I have HBO on cable so I get HBO Go, but not Netflix or Hulu Plus, and aside from those only movies from Google Play may be cast.Apart from YouTube there is no free content, and the standard Android media player app cannot cast playback of a downloaded movie file (MP4, MKV, etc.).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We just got this gizmo ($29.95 with Prime 2-day shipping) and already have watched the latest Downton Abbey online, on our TV.  There are a number of web sites that have videos that are not in Vimeo or Youtube that we are interested in. Also audio casts.  All of these are now available to us on our TV (convenient) with Chromecast using Google Chrome browser.The video and sound quality is not usually as good as HD TV or DVDs but it has been quite good enough to watch full length videos. The most useful application to us is viewing and listening to media from sites that aren't included in Blu-ray or Roku (Sony Blu-ray seems to have more than Roku now.)Chromecast setup is almost automatic and very easy.  This along with the Sony BDP-S5100 Blu-ray player gives us access to more than we are likely to view.From a Cruft blog:\"From the start with Chromecast, set-up is simple. You need a Wi-Fi computer to download the set-up software and here is where it gets good. I  think most consumer broadband routers come with WEP, WPA, or WPA enabled by default and before you connect to the wireless network, the device has to be configured--usually just selecting the SSID and key is sufficient. With the Chromecast, the only way to connect is via Wi-Fi but if it can't get on the Wi-Fi network, where do you start?Simple, the installer disconnects your laptop from your Wi-Fi network and (I think) puts it into ad-hoc mode so that it can connect to Chromecast. Once it connects, the application selects the last SSID your laptop used under the assumption that Chromecast will connect to that SSID as well (and you can change it) and then you can have the application automatically pull in the WEP/WPA, WPA2 key used to connect to the SSID. I didn't need to do enter a key. Once the configuration is set, Chromecast connects to your Wi-Fi network and the application restores your last Wi-Fi profile and then verifies it can communicate with Chromecast.Anyone can set-it up. I'd feel comfortable giving this to my mother and letting her do the set-up. I have a very strong feeling that the Google engineers could have simplified the process further by simply disconnecting from the WLAN, grabbing the last SSID and Key, and then reconnecting the LAN with out any user interaction and been right 99% of the time. It would make sense.Using Chromecast is also simple. I launched Youtube on my Sammy found a video and pushed it to Chromecast. Simple. Easy. Idiot proof.\"I've submitted 3 customer images to illustrate how to show full screen mode from a site like PBS (see customer images) I hope this helps.", "verified": true, "helpfulness": "15/15", "author": "Jim"}, {"rating": 5.0, "review": "I have one of these on ever Display and TV in my house. I will continue to buy these as gifts and for myself.", "verified": true, "helpfulness": "0/0", "author": "mike.mike.mike."}, {"rating": 5.0, "review": "Works as expected.  Allowed me to make all my TVs smart TVs.  Also now that Plex works with it, all my TVs can act as HTPC for me.  Love them and I was very happy being an early adopter.Also great to play Netflix Kids for my son.", "verified": true, "helpfulness": "0/0", "author": "Beef0270"}, {"rating": 5.0, "review": "I absolutely love this item.  It was easy to connect and use for streaming movies.  I had previously purchased a Sony Media Streamer from Amazon but it kept freezing over and over.  I have suggested the purchase of this item to many of my friends who are also experiencing problems with their current streamer from Sony.", "verified": true, "helpfulness": "0/0", "author": "Claudia M. Young"}, {"rating": 2.0, "review": "There is no question that this is a great product, but it does not work for me at the current state.If you are thinking of chrome casting from your tablet of phone, know that there are only a limited set of apps that support it. Youtube, Netflix works, no support for Amazon Prime Videos. No Tab casting from Chrome Browser or Safari. No expectation provided on when they will be supported. I am staying with my old Google TV for now. Returned it today.", "verified": true, "helpfulness": "0/0", "author": "AZIndian \"PG\""}, {"rating": 4.0, "review": "I was so excited about getting this little gadget. it works ok for the most part but sometimes it's a little glitchy when i watch Netflix. i can't figure out if its Netflix or My WiFi router... maybe i need a stronger one.", "verified": true, "helpfulness": "0/0", "author": "Lorena Lopez"}]