[{"rating": 3.0, "review": "Got my order b4 the date it was suppose to cum which is great... But for sum reason its slow on the tv from my phone i think i might return it", "verified": true, "helpfulness": "0/1", "author": "Nickole"}, {"rating": 5.0, "review": "Bought this for a yankee swap Christmas gift, and it was a hit.  Niece loves it.  Bought the other niece one too.", "verified": true, "helpfulness": "0/0", "author": "power ranger 1"}, {"rating": 5.0, "review": "Amazing product.Great value for it's fair low price.Excellent alternative for streaming content from any wi-fi connected device in your home!", "verified": true, "helpfulness": "0/0", "author": "Shaked"}, {"rating": 5.0, "review": "Wonderful thing!YouTube, games, streaming through your TV.", "verified": true, "helpfulness": "0/0", "author": "Matthew McIntosh"}, {"rating": 5.0, "review": "I love my Google Chromecast!  I use it to play pandora in my house and when the wii gives us problems with netflix for some reason my phone never does.  I just stream it from there and there are no issues.  The other day my son was frustrated with his Wii Batman game and I couldn't figure it out either.  So we pulled up a youtube video to walk us through the level and streamed it on the tv, he was so excited!", "verified": true, "helpfulness": "0/0", "author": "Jacqueline d'Estries"}, {"rating": 5.0, "review": "Awesome device", "verified": true, "helpfulness": "0/0", "author": "Loraine Hicks"}, {"rating": 1.0, "review": "It worked great for 3 months. Absolutely fun and I just wished more apps had the ability to use chromecast. However, one day it quit working and I did everything they tell you to do, talked to the help line for an hour and NOTHING would make it work. It totally crapped out and the Google customer service is horrid.", "verified": true, "helpfulness": "0/0", "author": "Melinda Jamieson \"luvmyfrg\""}, {"rating": 4.0, "review": "Good one.", "verified": true, "helpfulness": "0/0", "author": "Rajesh Chavakula"}, {"rating": 1.0, "review": "Worked pretty well for the first few months. I had to do a couple of factory resets and pay with it during that time, but I got by with it. A little over three months after I got it, though, I would get a flashing white screen and it would not play properly. I tried resetting it again, but no luck. Too late to return.", "verified": true, "helpfulness": "0/0", "author": "scott davis"}, {"rating": 5.0, "review": "I really love this little thing. It works without incident every time. I have had it for over a year, and the supported app list has only grown more robust as time goes on. I am currently purchasing a second one for my upstairs TV, and may buy a couple more for some family members. This little dongle I originally received as a gift has turned out to be one of my favorite gadgets.", "verified": false, "helpfulness": "0/0", "author": "chikngreez"}]