[{"rating": 5.0, "review": "Easy to set up and use. There are more and more apps supporting Chromecast every day. Using the website it was very easy to setup the device. Now, with the IOS app, setup and using it is even easier.", "verified": true, "helpfulness": "1/2", "author": "jerry550"}, {"rating": 3.0, "review": "Programed it on my smart TV according to instructions but it still won't work. Got be something out there that works & user friendly.", "verified": true, "helpfulness": "1/4", "author": "Adalam2u"}, {"rating": 4.0, "review": "This media player works well. The Chrome browser has a good working add-on that makes it very easy to use the Chromecast device! It would help if more apps were created to work with this device!", "verified": true, "helpfulness": "1/1", "author": "Railman302"}, {"rating": 1.0, "review": "Only works with select routers.  Does not work with any AT&T; routers.  I can't even find a good list of routers it does work with.", "verified": true, "helpfulness": "3/9", "author": "Ed"}, {"rating": 5.0, "review": "Opened the box. Plugged it in.  Watched YouTube on my TV.No set up, no problems, no glichesIt's nice living in the future :-)", "verified": true, "helpfulness": "1/1", "author": "opus111"}, {"rating": 4.0, "review": "I'm very glad I purchased this device.  It works flawlessly with my iPad to play YouTube videos on the TV.  I deducted one star since it is not yet compatible with many other applications.", "verified": true, "helpfulness": "1/1", "author": "King Bob"}, {"rating": 5.0, "review": "Great Product. Only thing lacking right now is apps that will work with chromecast, however more should be coming in December according to the latest reports I have read. You tube works great and streaming movies are no problem.", "verified": true, "helpfulness": "1/1", "author": "Paul J. Esposito"}, {"rating": 1.0, "review": "I bought one of these as I am regularly on the road.  I wastoldby the google rep that it would stream anywhere there is a wifi, great product, I have one and its the best.. blah blahas long as you are right next to a wifi, it works well.  in my house it streamed without lags, but if you go less than 3 wifi bars, it will stop to buffer every few seconds, especially if hd, and theres no way to set bitrate that I have found.on the road, I was told I could use it in hotels, etc.  this is wrong.  the unit will not connect to any public wifi that has a secondary login page (you connect and when you try to go somewhere a page pops up and you login, or click an agreement)all in all, lots of hype but little substance.  im going to return mine until they get their act  more together.  the ability to stream directly to it would be very nice also.shame, I really did want to love it, but feel \"meh..\"I think ill just get a slightly bigger device that can do more, maybe a roku or similar.", "verified": false, "helpfulness": "2/5", "author": "Terry Y."}, {"rating": 5.0, "review": "Works seamlessly with iPad and tv. Easy install and no waiting for product to start streaming.  No problems and is intuitive to work", "verified": true, "helpfulness": "4/4", "author": "Maria Oliveri"}, {"rating": 1.0, "review": "No support for anything useful. I bought this thinking it would be superior to a Roku. I should have purchased the damn Roku.", "verified": true, "helpfulness": "2/9", "author": "Amazon Customer"}]