[{"rating": 5.0, "review": "Love this little device! If only it worked with all music/video apps.", "verified": true, "helpfulness": "0/0", "author": "joe weisenbach"}, {"rating": 5.0, "review": "I purchased this hoping it would solve my no cable issue. I expected an entirely different experience. This thing is amazing! I can literally sit in my chair in the living room and cast cartoons (pbs, Netflix, etc) from there. It comes with an abundance of apps you can download. The entire set up process took me about five minutes. My television is now a smart tv with out paying the extra $ to upgrade. I will probably buy two more for my others. So if you are looking for a cheaper alternative like I was.. I suggest buying this. Make sure you have wifi and a smart phone, the rest is cake.", "verified": false, "helpfulness": "0/0", "author": "Jacque G."}, {"rating": 5.0, "review": "So easy to use. $30 and you stream video (almost anything) from the internet direction to the TV it's installed on. How can you go wrong?We use it with Netflix, Hulu, Youtube, and many other video sources. It is SUPER EASY to set up. All you need is a TV with an HDMI port and a wireless internet connection. You can even put a Chromecast on each TV in the home and stream to whatever location you wish. You use your phone as a remote control and to easily browse content. WE LOVE IT. No boxes, no wires, no programming, no computer.Pros: Easy to use, endless content, wireless, transportable between TVs, easy setup, value for the $Cons: I can't find one.", "verified": false, "helpfulness": "0/0", "author": "Jason W"}, {"rating": 2.0, "review": "Google is a household name nowadays. Most of us browse the internet daily using their search engine and Google has a big market of mobile devices with its Android operating system platform. Now, Google has made it into your living room with Chromecast.The Chromecast is a media streaming device about the size of a USB drive. It plugs directly into an HDMI port on your TV and can be powered by either a USB port on your TV or by using the power plug packaged with the device. Google has done a really nice job of partnering with a lot of top entertainment channels. Some of the options Chromecast offers for viewing include HBO go, Netflix, Hulu Plus and Plex.When I tested out the functions of streaming media player, it seemed to work pretty well. It connected easily to my home network Because I have experience with the Apple TV as my primary media streaming device, I was expecting some of the same functionality to be available with the Chromecast. I was sorely disappointed when I discovered that the tiny device did not play nicely with my iOS devices.One of the things I value with my Apple TV is the ability to stream media directly from my iOS devices. Without the AirPlay ability available through the Chromecast, my viewing experience was greatly disheartening. Even though the regular viewing options worked alright, the advanced features were lacking on the Google Chromecast.One thing the Apple TV does not have that the Chromecast does is Plex. And, having the option to open the Plex app on my iPhone and send whatever that’s in my Plex Library to the TV was awesome.Another thing I noticed was that after about 15 minutes of watching a movie, the Chromecast was hot to the touch. This was concerning especially since I had only been using it for a very short period of time. It’s such a small device and even though I didn’t experience it, I would think that continued use with a device that is overheating would effect functionality and long-term use.Google Chromecast is a fairly standard streaming media player. It worked pretty well, but I’m not happy about the loss of functionality with my iOS devices. With so many players in the market, I’m not sure that Chromecast can compete.\"This product was received at a free or discounted price in exchange for my review. I am a technology journalist and pride myself on providing fair and honest reviews. Please feel free to ask any questions you might have.\"", "verified": false, "helpfulness": "8/9", "author": "Nicholas Calderone \"Senior Editor, Co-Founder of MacSources\""}, {"rating": 4.0, "review": "Fun to play with.  Glad I got it.", "verified": true, "helpfulness": "0/0", "author": "M. Campbell \"M. Campbell\""}, {"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 1.0, "review": "Google is very tricky.  They won't like you watch Amazon movies, which is not cool!", "verified": true, "helpfulness": "0/1", "author": "Bryan Lasater"}, {"rating": 4.0, "review": "Had some difficulties with connecting to my Wifi but other than that this is working great to stream my Chrome browser.  I use my Roku for everything else.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It doesn't work- freezes up every time and the computer source is only about 20' away.", "verified": true, "helpfulness": "0/0", "author": "Nadine Vangelisti"}, {"rating": 5.0, "review": "doing everything i expected, multiple apps support this now including VLC. You can mirror entire desktop or Samsung Galaxy s5. their is a lag problem for any live broadcast. results vary but i do not find this when using apps such as Netflix and hulu which are not really live broadcast. amazon prime video is very odd to setup.", "verified": true, "helpfulness": "0/0", "author": "DS"}]