[{"rating": 5.0, "review": "Does exactly as advertised and you cannot beat the price.  I primarily use it for netflix and HBOGO and I've had zero issues with it.", "verified": true, "helpfulness": "0/0", "author": "MTL"}, {"rating": 5.0, "review": "We stream Netflix, YouTube, Pandora, Songza, and much more to the TV, now. We almost never switch to the other inputs; there's no need! We don't even have cable anymore.Chromecast boots quickly, and very rarely lags.Just get it- especially if you don't have/want cable or satellite. Even if you do, I can't really express how great it is to be able to wirelessly stream almost anything from Google Chrome on the computers, or from most of the apps on our android devices.I really love technology.", "verified": true, "helpfulness": "0/0", "author": "greenjy"}, {"rating": 4.0, "review": "Something I learned when I hooked it up - it is simply an HDMI signal -- no separate audio out (again, exactly as it is supposed to be). This affected me though because my TV does not have separate audio out for my surround sound. So when viewing with Chromecaset on a limited TV (one without audio outputs like mine), you are forced to listen with the TV speakers.Otherwise, easy setup, easy use, works great!", "verified": true, "helpfulness": "1/1", "author": "John Hamilton \"crazyonlooker\""}, {"rating": 4.0, "review": "I bought it because, I generally used xbox to stream netflix, and other stuffs. The weird part was, the controller, where it was too hard to search for something in netflix. Chromecast solved that problem really nicely. However, I have removed one star just because it cannot stream remote desktop yet. I would have loved to see that happening any time soon.", "verified": true, "helpfulness": "0/1", "author": "Jay Patel"}, {"rating": 5.0, "review": "Whether you cut the cord from cable or not, this is so worth getting. It adds tons of things to watch whenever you want and it's so easy to plug in and use!", "verified": true, "helpfulness": "0/0", "author": "Lh"}, {"rating": 5.0, "review": "This is one of my favorite gadgets. Makes it easy to access Netflix and Youtube from my Galaxy S4 Android phone.", "verified": true, "helpfulness": "0/0", "author": "Phil Holmes"}, {"rating": 5.0, "review": "I boughtnthis item to see if I could stream videos to my TV from my tablet but was a afraid it would be difficult to do it, but found out it was extremely easy to use it.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 4.0, "review": "Works great! Having problems casting from my Chrome Browser though. All in all a great revolutionary product... I Love it!", "verified": true, "helpfulness": "0/0", "author": "Cliffb"}, {"rating": 4.0, "review": "Works just as advertised.  Plug into an HDTV and stream from compatible apps or any Chrome tab. The main issue is lack of compatible apps and that you can't cast Chrome tabs from android yet.  I expect more compatibility to come in the future, making this a great deal.", "verified": true, "helpfulness": "1/1", "author": "dsf007"}, {"rating": 5.0, "review": "I was looking for an inexpensive way to watch my shows without the computer and wires. This better than another box I had to purchase and wire to my tv.", "verified": true, "helpfulness": "0/0", "author": "lorenzo muratore & Mariaelena Muratore"}]