[{"rating": 5.0, "review": "Love it!  Got it on a promo with a NAS HDD.  I have a smart TV and a Windows Media Center box, so I wasn't planning on getting a Chromecast.  There's very little it does for me that I didn't already have set up.  It has some cool features, though.If you don't have a smart TV, or are looking for a quick and easy way to \"beam\" content from your mobile device to your TV, this is it!", "verified": true, "helpfulness": "0/0", "author": "Garry Adams"}, {"rating": 5.0, "review": "I bought this gift for my father and this is all he talks about, definetly worth the price and works amazingly.", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 5.0, "review": "Best product EVER!!!!!", "verified": true, "helpfulness": "0/1", "author": "ramx915"}, {"rating": 3.0, "review": "I will not call this as excellent product at least in India- Less number of apps available in India. Mainly lack of Play Music- Need good wifi router. I had older one but after purchasing netgear, results are much better. So if you have older routers, extra cost of new routerBut considering cost of product, it is very worth to purchase. I mean youtube works very well and worth to spend this much amount for youtube.", "verified": true, "helpfulness": "0/2", "author": "Gautam Moharir"}, {"rating": 3.0, "review": "The Chromecast will not work with Microsoft Windows Vista Home Premium SP2, even though it states that it does, do not purchase this unless you have Windows 7, Google Chromecast will need detect any other program. It works great with your all Android and Nook Tablet.", "verified": true, "helpfulness": "0/1", "author": "Bobbie Haynes"}, {"rating": 5.0, "review": "So simple, couldn't go back to not owning it. A must have if you watch Netflix or Youtube. Plus you can't beat the price", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "When a new gadget arrives in any household, everyone wants to see what it can do. The first thing I did was mirror my phone on the 55 inch screen in the living room while playing games! Unfortunately, there was just enough lag to make that task suck chromecast, my cousins come over and with our phones, this let's us watch YouTube hilarity after hilarity. I bought two of these, one for the big screen in  the living room and one for our bedroom. I've been using them regularly for the past couple of months. This is what I've found:Pros: stream youtube, netflix, pandora, songza, etc with just your phone, tablet, pallet or what not. You can even stream from your chrome browser on your desktop. The ladies in our house get to watch their asian soap operas on the big tv.Cons: it needs a power plug, the pictures don't show the usb power cable that goes with it. And the apps are limited that support it. However, there are more and more apps supporting it coming out.Bottom line: If you're looking for a new gadget to infuse your mobile gadgets with, great!If you're looking at cutting the cord, this is very limited for the average user. For those out there that are more Internet and gadget savy, we will almost always find a free resource to use!", "verified": true, "helpfulness": "0/0", "author": "Jonathan"}, {"rating": 5.0, "review": "So convenient! Love it I use it everyday Perfect Use with Netflix and Youtube", "verified": true, "helpfulness": "0/0", "author": "Howin1"}, {"rating": 3.0, "review": "I have an Apple TV as my main streaming device, and bought this one to use in my room's TV that I barely use, and for that purpose is great, but I definitely don't recommend this as your main streaming device I am using it with iPhone 5s and sure you can stream from Apps like netflix, youtube, or if you have seagate has from their apps and few other, but if you are streaming from an app, netflix for example, after 5 minutes or so for some reason unknown to me the app lost communication with the chromecast and you have no way to pause, stop or do anything until you close it (double click home button & swipe up) and open it up again so you can have control of the device again, this happened also with other apps. But for the price I think is fair, maybe a few bucks cheaper would be more realistic price for this but still ok, and probably the bugs will be fixed over time.", "verified": true, "helpfulness": "0/1", "author": "AB"}, {"rating": 5.0, "review": "Excellent Product!", "verified": true, "helpfulness": "0/0", "author": "Anjan"}]