[{"rating": 5.0, "review": "I absolutely LOVE THIS DAMN THING!!!!!!!!!!!!! I can take it with me and plug it in just about anywhere!! plan on getting more for other rooms in the house. just wish other apps were available, according to amazon customer service, more apps are to be released very soon!!", "verified": true, "helpfulness": "2/2", "author": "Jules"}, {"rating": 4.0, "review": "A bit more Prime content would have garnered a 5th star.  Easy user interface. Fast response and easy to use.", "verified": true, "helpfulness": "1/1", "author": "Keepin' it real \"jnast\""}, {"rating": 3.0, "review": "Just for starters, if you are buying this for games you should wait. Not all of us want a Playstation or Xbox; even if we do we want better and cheaper options for basic games. (especially for kids or when you only want to kill a half hour). When you don't have a lot of time $60 games aren't really worth it if you never have dedicated time to play.I have plenty of ways to stream currently, and I will say, so far it seems to match capabilities for that area of use. If you are primarily a Prime Streamer and don't have any devices, are looking for a new one or just something small and compact this is worth it.For Streaming, I do agree with others that they should separate the Prime list from the regular somehow in your watch list, it is really frustrating when you just want to pick out a movie quickly and you have to skip around forever.One other note on Amazon Movie/TV streaming.... it would be really nice if they gave you the option to convert a rental into a purchase once you finish the movie. It would be a great way to increase streaming purchases while also giving users the opportunity to save money. I've actually been discouraged from buying a movie, I loved after seeing it the first time through renting on Amazon, because I just dropped $6 on the rental. I don't really want to drop $10 - $18  immediately after. If the cost was reduced by the rental fee (they can even keep a $1 for the trouble) I would have bought them on the spot.Overall the remote works great for navigating, I do not use the voice feature because I don't want that stuff stored on their servers. (you can have the voice search data removed from the servers - search on YouTube for a tutorial).I have had issues where Amazon servers aren't available on the FIRE TV but are through my other streamers and computer.Now again for gaming:1) There needs to be a way that you can have a one day trial of a game before you purchased. I have purchased 4 games so far that unfortunately either look horrible when stretched to fit a TV rather than the tablet they were designed for or are just too glitchy, some button mapping doesn't work or the game design is just poor overall. See you later 4 x $4.99 (avg cost).2) Overall the play and looks of games seems to be on par with Sega Genesis to Playstation 1 in my experience. While this can be fun I do think in a year or two when more designers are actually focused on the Fire TV specifically this will change.3) Hard Drive needs to be bigger. It is nice that game saves can stay in the cloud but having to download your favorite 4 games over and over when you decide to switch is kind of a problem.4) I have tried both the Amazon Controller (lent to me for a few days) and the Xbox 360 controller using the USB wireless dongle. There are plenty of reviews on the Amazon controller and I think there is a consensus being reached there, that I concur with, about the updates needed for the next version. The 360 option works and is better overall for response and feel, unfortunately the best games I’ve played do have some mapping issues. Everything works but maybe one trigger doesn't map. The games that look worse and are poorly designed and way too basic all map fine. Go figure. There is also no way to change the mapping or set it on the 3rd party controller. That would be a great add.5) They have pre-set categories and genres for you to find games but for some reason not all available games show up in these lists. (same goes when you use the search feature)", "verified": true, "helpfulness": "1/1", "author": "Bo Brink \"Bo\""}, {"rating": 5.0, "review": "Love being able to speak the commands.", "verified": true, "helpfulness": "0/0", "author": "Pat Crosskno"}, {"rating": 5.0, "review": "The Fire TV is smooth fast with no loading screens so far. It has a very sleek interface and easy navigation; the voice control is very good as well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The Fire TV is an awesome invention, however, each time it comes on the screen flickers. Then once you're watching a show, the picture will cut in and out. Sometimes it cuts out fast enough it will pick back up where it went out and keep on playing. Mostly though, it will cut out for a few seconds then come back on, but it's paused. Meaning I have to pick up the remote and press play again. This happens about 4 times during a 30 minute show and over 10 times during a movie. Quite annoying to say the least. Not sure if it's the Amazon Fire's problem or some other problem I haven't diagnosed yet. I will hook this up to another TV and see if the problem persists.EDITI had the Fire TV hooked up to an older Sanyo 46\" flat screen. I'm pretty sure it was the TV making it cut in & out. Hooked it up to a Vizio 42\" and played Clerks 2 as a test and not one cut out. So it had to be that the older Sanyo TV didn't have enough mustard to run this gadget. Oh well, TV's have been switched and it's smooth sailing so far!", "verified": true, "helpfulness": "0/0", "author": "Michael Woody"}, {"rating": 2.0, "review": "Not that great", "verified": true, "helpfulness": "0/7", "author": "Thomas Algren"}, {"rating": 3.0, "review": "Somethings are great about the streamer like Prime but, YouTube sucks really bad.  Roku and Apple TV are better choices by far.  Got sucked in by the payment program.  My mistake.", "verified": true, "helpfulness": "0/3", "author": "michael scoggins"}, {"rating": 5.0, "review": "Enjoying it a lot.", "verified": true, "helpfulness": "0/1", "author": "Steven M. Petr \"Steve's Woodworking  Room\""}, {"rating": 5.0, "review": "Best thing that ever came out.", "verified": true, "helpfulness": "0/1", "author": "lelandhack"}]