[{"rating": 5.0, "review": "Had it for about a month now, and so far it is everything I had hoped for.  Getting off cable for good by year's end!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love the voice search capability for Prime. But lots of listings in Prime aren't available to watch immediately which is really annoying. The search abilities in Netflix are slow and trying to search by name takes forever to scroll and type each letter.", "verified": true, "helpfulness": "0/0", "author": "Kourtney Heintz"}, {"rating": 4.0, "review": "This is an easy to install, easy to use gateway to a wealth of streaming entertainment sources. My only complaint is that in the state it was delivered, Netflix was not accessible. I had to contact Amazon's telephone tech support (800 number to the Phillipines) and even the tech had to go to his supervisor to get the solution. After 20 minutes of him instructing me to try various solutions, he was told that I had to go to \"About\" in the Systems menu and run an \"update\" in order to then reveal the download icon for the Netflix app. The tech guy was excellent and stuck with me all the way. But Amazon should have shipped this with the Netflix app ready to download and install. Otherwise, great unit and worth the price.", "verified": true, "helpfulness": "0/0", "author": "Randall Grimm"}, {"rating": 5.0, "review": "This was the big reaction gift this year, my sons face when he opened the paper was worth 10x what I paid.  Set up was a snap (and on Xmas morning that's huge). Integrated with my Amazon seasmlessly. It was everything we expected. Buying the game controller ASAP.", "verified": true, "helpfulness": "0/0", "author": "J. Milbrandt"}, {"rating": 5.0, "review": "We love our Amazon Fire TV! WE also have a Roku, but the Amazon is by far the better choice. Excellent!", "verified": true, "helpfulness": "0/0", "author": "Wendy Olson"}, {"rating": 5.0, "review": "Everything I expected and more...a truly amazing product. Only draw back is not being able to shop amazon products through the fire tv...we would have been able to do all of our Xmas shopping from the couch instead of the PC. Still a 10 star product!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Woks fantastic", "verified": true, "helpfulness": "0/0", "author": "Michael P."}, {"rating": 5.0, "review": "I have been using the Roku 2 for about 5 years and I loved that device.  When Amazon lowered the price for the FireTV I thought I would give it a try as change can be good.The fire tv was simple to setup and install the upgrade it required. Had it up and running in less than 10 minutes.  Once you order Amazon links it to your Prime account making the process seamless.  Linking my Netflix was perfect without issue.  The instructional video was cute and informative.I purchased the Amazon  HDMI cable that was suggested as the reviews were very positive, and it truly enhances the system.I love the display of Netflix , it seems to think more than on my previous streaming player and Sony Google TV I use.  I am finding more movies of interest and quality than I was able to on the previous player.  Prime also seems to show me more of a selection that I am enjoying.The picture quality on the FireTV is amazing and fast. The screen saver mode is very nice, hope they add more themes to this.  I love that when watching a season it will put the thumbnail of the next episode in the bottom right corner for you to quickly advance.I would recommend the device to anyone.", "verified": true, "helpfulness": "0/0", "author": "Blkfeet"}, {"rating": 1.0, "review": "HBOGo finally arrives, and Comcast does not allow for it to be streamed on Amazon Fire.Really Comcast?As much as Amazon may have their hands tied, ultimately the product is as useful as a doorstop for Comcast subscribers wanting HBOGo.", "verified": true, "helpfulness": "3/9", "author": "BonnyG"}, {"rating": 5.0, "review": "Best thing ever a must have!", "verified": true, "helpfulness": "0/0", "author": "Heather"}]