[{"rating": 5.0, "review": "If you're reading this, you must have heard about what this is, so I'll just sum it all up in pros and cons.Pros- Makes any TV a smart tv, cheap, easy to set upCons- Apps are limited, and you can't cast tabs from a tablet (even a Google one!)", "verified": true, "helpfulness": "0/0", "author": "Doug Didier"}, {"rating": 1.0, "review": "by far the worst less reliable device of its kin on the market, it works only with chrome browser ( wich is not the best one, a waste of money I ended up trashing in frustration for its poor performance, oh and its proclaimed free netflix, is not so,  highly recommend you spend your money on a better brand.", "verified": false, "helpfulness": "1/2", "author": "antonio cruz zavaleta"}, {"rating": 5.0, "review": "Best gift I ever got my husband. And cheap money too! He has been using it daily since xmas.I will be getting a couple more for my daughters!", "verified": true, "helpfulness": "0/0", "author": "Virginia Wheeler"}, {"rating": 4.0, "review": "Works well easy to install reasonable price need more time to review.  Need more apps from google to evaluate the purchase", "verified": true, "helpfulness": "0/0", "author": "SS Schultz"}, {"rating": 3.0, "review": "I really like what Google did with the ChromeCast. It's really easy to use, small, and portable. Set-up was a snap and anyone could do it. The apps that work on it, like streaming video from your desktop or Android phone are work well. Compared to using other media devices like smart TV's, Blu-Ray, or receivers, to show Youtube or Netflix, it's as easy or easier to use. I love being able to send Youtube videos to ChromeCast for display.What it lacks and the reason I knicked 2 stars. There's no way to show images from your Android Gallery account on the ChromeCast which for me is pretty important. I think this is a huge short coming and I don't see Google supporting the Android Gallery any time soon expecting that someone will develop an app for it but this, I think, is pretty basic functionality.The second star was because Google Play Music won't figure out that music stored locally on my Android phone is also stored on my Google Play music and stream from there nor does it offer the ability to have Play Music show only music on Google's service. I store music on my phone because I am disconnected enough and will soon be on a capped data plan that streaming is a non-starter for me. However, I'd like to be able to easily stream music to ChromeCast from Play Music even if I am limited to what is on Google's Services. Since I have music stored locally, the Play App won't even attempt to see if it's on the service and refuses to play. Boo.For both of these issues, I could probably set-up a media server to deliver video, music, and pictures, but I don't want to. I don't want to waste the electricity, generate the heat, or create the noise that those systems generate when they are not in use. I have been actively trying to reduce the amount of electronics that are left running.", "verified": true, "helpfulness": "0/0", "author": "Mike Fratto"}, {"rating": 5.0, "review": "We use our Chomecast HDMI everyday. I Don't know what I'd do without it! It is so nice to watch things on our TV screen and not our little computer monitors!", "verified": true, "helpfulness": "0/0", "author": "LongarmLinda"}, {"rating": 5.0, "review": "Bought it for my daughter. She just set it up and loves it. She said its fast and gets a great picture.", "verified": true, "helpfulness": "0/0", "author": "roger thurman"}, {"rating": 4.0, "review": "This new purchase allows my children to be able to cast movies from their tablets to their own TV's.  Very nice!", "verified": true, "helpfulness": "0/0", "author": "Sara Lee \"Sandy\""}, {"rating": 1.0, "review": "You need patience to watch movies from chrome cast...most of the times it will have connectivity issues to your network...even if it connects it will work for maximum 1 hour...again it will have issue....daily i used to reset the chrome cast and set it up.....I got bored..Instead of this I would have used my hdmi cord and watch all websites..i don't recommend this to my friends.", "verified": true, "helpfulness": "0/0", "author": "Maniks \"Maniks\""}, {"rating": 5.0, "review": "At first I was considering the apple TV but decided to go with the less expensive Chromecast, Glad I did.  Works great and set up was a breeze!  I basically use this to watch Netflix on the T.V. I have loved watching Youtube videos and listing to music videos as well. Shippment was prompt and arrived within just a few days.  Would recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "blayde_hayli"}]