[{"rating": 5.0, "review": "Simple to set up and just as easy to use. Awesome!", "verified": true, "helpfulness": "0/1", "author": "Beatleknight"}, {"rating": 1.0, "review": "I think it sucks.", "verified": true, "helpfulness": "1/8", "author": "Anthony S. Nicholson"}, {"rating": 5.0, "review": "just Love it!!!", "verified": true, "helpfulness": "0/2", "author": "Budman"}, {"rating": 3.0, "review": "I was pretty disappointed with the Fire TV. Overall, it seems like a well-made device. It's easy to use, quick and responsive, the voice search works a treat. Here's my problem. I bought it for the Free Time. But it doesn't work the way it works on a tablet. On the Fire HD tablet, I've got my main user profile and its password protected. When the kid uses it he has no choice but to use his free time profile. But on Fire TV there is no ability to create user profiles or password protect them. So I have to go in and make everything require a pin, which makes using it for me a pain, and it only applies to amazon content. If I want to restrict the kid's access to Netflix, as an example, I have to disable it completely.  So basically, it makes the device more kid friendly and completely unfriendly to everyone else.If Amazon had designed this so you have the option of creating a main user profile and password protecting that, while allowing kids access to Free Time independently -- just as on their tablets, this would be a home run. Really disappointing.", "verified": true, "helpfulness": "1/2", "author": "DS"}, {"rating": 5.0, "review": "Simply amazing", "verified": true, "helpfulness": "0/2", "author": "Brandon"}, {"rating": 5.0, "review": "Much more easy to use than expected. I would strongly recommend this to anyone considering it.", "verified": true, "helpfulness": "0/1", "author": "mntnpeak"}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/1", "author": "Eric Baker"}, {"rating": 1.0, "review": "we had the smaller fire stick which would loose its signal often this version is superior and works much better, no cutting off with a better quality picture", "verified": true, "helpfulness": "2/6", "author": "patricia holm"}, {"rating": 5.0, "review": "I have found this to be an amazing addition to have and use  !!", "verified": true, "helpfulness": "0/1", "author": "Ruth Jansen"}, {"rating": 4.0, "review": "Replaced a Roku and so far am pleased.  Four stars only because the auto power off feature is not working and you have to manually power off with the remote.", "verified": true, "helpfulness": "0/1", "author": "Ken \"Pop\""}]