[{"rating": 5.0, "review": "Love Google Chromcast", "verified": true, "helpfulness": "0/0", "author": "Senada"}, {"rating": 1.0, "review": "Useless.Can't cast anything from iOS Chrome to TV. It's not supported.Also, when you cast Chrome from laptop to TV, the resolution on TV is not proper. The picture does not fill the TV screen.", "verified": true, "helpfulness": "1/1", "author": "Varun"}, {"rating": 5.0, "review": "Works excellent !  You do need a power supply usb wire to power this up, for addl cost if you dont have extra from your Samsung style phone.", "verified": true, "helpfulness": "0/0", "author": "Jon Moser"}, {"rating": 1.0, "review": "I thought this would be great for use with the PC with the shows that we stream. But the pause are not worth it. I'd rather watch it on the small PC screen with no pauses.", "verified": true, "helpfulness": "0/0", "author": "Ronald Stone"}, {"rating": 5.0, "review": "Loving it! More apps.  I've bought several as gifts as well.", "verified": true, "helpfulness": "0/0", "author": "Richmond Amporful"}, {"rating": 1.0, "review": "Why pay the list price of $35 when you can pay almost 4 times as much for the same product?!?!", "verified": false, "helpfulness": "5/7", "author": "Hutch"}, {"rating": 4.0, "review": "Good if your expectations are not too high.  It's inexpensive and would make your dumb tv a bit smarter.  You'll need a smart phone or tablet though.", "verified": true, "helpfulness": "0/0", "author": "D. Wong"}, {"rating": 4.0, "review": "It's quirky and had stability issues when it first came out, but this is a very solid media streaming device for HDMI TVs. I would recommend it to people looking for a light-use casting solution. I wish more applications supported the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Creighton Magoun"}, {"rating": 5.0, "review": "Love it! Worth it! Youtube app not so good in some android devices. Also, Google chrome for android doesnt allow chrome extensions :( so i can't cast my tabs, which is amazing and i've done with my laptop.However, not chromecast's fault. This device is just amazing.", "verified": false, "helpfulness": "0/0", "author": "Paulina Herra"}, {"rating": 5.0, "review": "Super great product that I love very much and use all the time.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Hodge"}]