[{"rating": 1.0, "review": "I do not understand why but Chromecast does not work very well at my house. A waste of money.", "verified": true, "helpfulness": "0/0", "author": "Stan"}, {"rating": 1.0, "review": "Just doesn't work as easily as advertised. I bought one for my parents tried to set it up with their iPads, (I'm a geek too), and it was a nightmare to set up. I never got it to work properly with Apple iPads or iPhones.Save your money and do the right thing --- buy a Roku. I saved up and bought them the newest Roku and it's simple and they love it and more importantly they can use it.And no....  I have no vested interest in Roku.", "verified": true, "helpfulness": "0/0", "author": "Jennifer L. Perkins \"gnostic\""}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Tom"}, {"rating": 5.0, "review": "I do like it!", "verified": true, "helpfulness": "0/0", "author": "saykham keomanivong"}, {"rating": 5.0, "review": "Product works as expected. Wish it had a remote to use with it. It is a little annoying to have to reopen the app on your phone or whatever you a streaming from to pause/stop streaming.", "verified": true, "helpfulness": "0/0", "author": "Megan \"Megan\""}, {"rating": 5.0, "review": "I got this as a gift for my parents and they love it! Inexpensive gift for someone you know loves streaming Netflix, HBOGo, etc.", "verified": true, "helpfulness": "0/0", "author": "William McKee"}, {"rating": 4.0, "review": "Just a slight lag present. Overall, great!", "verified": true, "helpfulness": "0/0", "author": "Robz7 \"RS777\""}, {"rating": 5.0, "review": "Does exactly what it says it will do. It's awesome to be able to watch YouTube and Netflix on my TV through my phone.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Love Google Chromcast", "verified": true, "helpfulness": "0/0", "author": "Senada"}, {"rating": 1.0, "review": "Useless.Can't cast anything from iOS Chrome to TV. It's not supported.Also, when you cast Chrome from laptop to TV, the resolution on TV is not proper. The picture does not fill the TV screen.", "verified": true, "helpfulness": "1/1", "author": "Varun"}]