[{"rating": 5.0, "review": "Great little thing. I use it all the time with my iPad.An update for 4K would be great as now I do not think it can support 4K. Also, it would be nice if it drew power from the HDMI port rather than having to use a separate USB port.", "verified": true, "helpfulness": "0/0", "author": "ajpug"}, {"rating": 3.0, "review": "This device is good and is functional, but does not work as a mirror of my cell phone and only works with some apps, at least for android.", "verified": true, "helpfulness": "0/0", "author": "Felix S"}, {"rating": 5.0, "review": "Started to explore all of its capabilities lately and I must say, this is the BEST purchase for the price to date.  Truly amazing gadget that offers a large amount of app streaming capabilities as well as streaming of locally saved videos and images. Still a fairly new product, and google supported, so there are new updates and enhanced capabilities daily.A must-have for the gifted techies", "verified": true, "helpfulness": "0/0", "author": "Jonathan Carofilis"}, {"rating": 4.0, "review": "Neat device, but a little frustrating to realize that it won't store any of your login information. If you're planning on putting one of these in your living room, you need to remember that anyone who wants to stream to it must have the login credentials for whatever service you're trying to use.This can be frustrating if you're used to being able to, for example, turn on your PS4 and run Netflix using your roommate's saved login credentials!", "verified": true, "helpfulness": "0/0", "author": "Nesciosquid"}, {"rating": 5.0, "review": "Chromecast has changed the way I watch media. Between groups of friends adding to a YouTube queue, or easily streaming Netflix, this is a no-brainer for $35.", "verified": true, "helpfulness": "0/0", "author": "Ben Lockhart"}, {"rating": 5.0, "review": "Tricky to install if your router is not on the list of compatible devices. Otherwise it is the obvious choice in low cost media streaming. As if I didn't watch enough Netflix before!", "verified": true, "helpfulness": "0/0", "author": "erica"}, {"rating": 4.0, "review": "Works pretty good.  What I like is that the sound casts as well, so you don't need external speakers.  You just watch everything on the TV.  Also, the item came in a timely manner with no problems.", "verified": true, "helpfulness": "0/0", "author": "sjensens"}, {"rating": 5.0, "review": "our child loves it.", "verified": true, "helpfulness": "0/0", "author": "michael  morin"}, {"rating": 5.0, "review": "Bought this for \"Cyber Monday\" after one of my friends showed me how theirs worked.  I use it in my bedroom which doesn't have a \"Smart TV\" and absolutely love it!  The easy access control with smart phone, or tablet, or computer, whichever is with me is outstanding.  Easy to use and one of my best amazon purchases ever!", "verified": true, "helpfulness": "0/0", "author": "L-Mack \"Landon\""}, {"rating": 5.0, "review": "The best equipment ever definitely recommend", "verified": true, "helpfulness": "0/0", "author": "Khalid Armstrong"}]