[{"rating": 5.0, "review": "This is the best thing I have bought in a long while.  Very easy to install the program on your computer.  We just open the program we want to watch, click on the desktop and there it is.  Awesome for the money.", "verified": true, "helpfulness": "0/0", "author": "D. Brown"}, {"rating": 5.0, "review": "Easiest possible streaming solution available.  And a great price, to boot.  There is no device to program or provide power.  Just stick it right and your tv and bam!", "verified": true, "helpfulness": "0/0", "author": "L. Marie Parker \"Parker\""}, {"rating": 5.0, "review": "This devices has a combination of Easy to use, Cheap and Excelent Video Quality. I have three month using it and i haven't  had any problem with it.", "verified": true, "helpfulness": "0/0", "author": "Edward Jimenez"}, {"rating": 5.0, "review": "Awesome device! For $35 it turns your normal TV in to a smart TV. It is incredibly simple to setup and use.", "verified": true, "helpfulness": "1/1", "author": "Michael"}, {"rating": 1.0, "review": "Loved at first, but they disabled features to cast your laptop screen.... just use it to cast , Netflix etc now, but my smart TV can do that. .. oh wellIm looking for Microsoft to get up off there butts and make one of these that can cast from the XBONE to one of these for DVR tv etc. .. .  or TIVO to do something similar.", "verified": true, "helpfulness": "3/5", "author": "Emalee Grover"}, {"rating": 5.0, "review": "I like the fact that it doesn't need a separate power source other than plugging into the TV's usb outlet (and yest it come with the set), nor takes any additional space in front or above the TV. Works seamless with Netflix. I can play many YouTube videos via Chromecast that is installed on my Nexus 7 android tablet . No need for set top box like Roku box. You don't waste power at all, since the device turns on, when the TV is turned on. Best and most affordable streamer yet. Have used for several months now and happy with it.", "verified": true, "helpfulness": "0/0", "author": "Tsering"}, {"rating": 5.0, "review": "Love It. Why pay move for the others? If you stream Hulu and Netflix’s on your iPad or other device, you need this. I was a little apprehensive at first about this. Seeing how others are more expensive. If you want the basic into to turn your HD TV into a “smart TV: to stream movies or shows, this is it.Set up is EZ and fast. Plug it into an HDMI slot and within five minutes you’re streaming.", "verified": true, "helpfulness": "0/0", "author": "Anthony j Thomas"}, {"rating": 5.0, "review": "Love it. Just waiting for more apps and content that supports the device. The chrome plugin to cast a tap is probably the most used aspect of this device for me.", "verified": true, "helpfulness": "0/0", "author": "T George"}, {"rating": 2.0, "review": "After a couple months, I'm really really bored.  No games, no showing my pictures or videos, ugh.It's basically a Netflix and Youtube player.  Yes, I know it can also share your chrome browser, but that is laggy and lame.Thanks google, you fooled me again into buying another beta product with no future.", "verified": true, "helpfulness": "0/0", "author": "h0tw1r3"}, {"rating": 5.0, "review": "Turns my stupid bedroom TV into an almost-as-smart as my smart TV... TV. Youtube and Netflix work great. The music thing is a little janky but I never listen to music on my TV anyway. Basically you upload all of your music to \"google play\" and then google decides what you can legitimately play on your TV. Not sure why they didn't just allow you to stream directly to the unit but whatever its freakin $35. Buy it!", "verified": true, "helpfulness": "0/0", "author": "Lamont Walton"}]