[{"rating": 5.0, "review": "We just gave up cable and got the Amazon Fire TV instead. There is no way we are ever going back to cable.It is simple to plug the tiny box into the back of the TV with a HDMI cable. The box comes with hundreds of apps preloaded. I am am an Amazon Prime member and also have a Kindle which makes the whole experience even better. The first time you open an app, you may have to go through some start up steps but having the Kindle made this easy. We subscribed to trials of Netflix and Hulu Plus but they were so good we kept the subscriptions. Seriously, name a show, any show, and every complete series is there on your TV. On demand. Between the shows that come free with Prime, Netflix and Hulu Plus all our family's favorite shows are on there. There is a PBS app for Downton Abbey (every season) and even news shows.People talk about getting rid of cable as if it is a big sacrifice and a set top box/antenna combo is alright but a poor substitute for cable. This is simply not true! Amazon Fire TV blows cable out of the water. We were originally going to get a house antenna too to try to recreate the cable experience but there really is no point. The secret needs to get out: cable is old fashioned, overpriced and out of date. Amazon Fire TV is the way forward.", "verified": true, "helpfulness": "2/2", "author": "Mom of 3"}, {"rating": 2.0, "review": "I am disappointed with Fire TV for the following reasons:1) I am a big fan of Amazon Cloud Player for music and this was a major reason why I purchased a fire tv.  However, the music player app is absolutely terrible.  You cannot search your music (don't believe Amazon's help site on this one) and if you want to listen to an artists whose name starts at the end of the alphabet you have to page through all of the artists by hand (same for albums and songs).  This would literally take hours to get to a song if your music collection is large and makes it functionally useless. I notified Amazon and they said they would pass the info on to the developers.2) It's a pain to turn it off.  Although the unit goes to sleep after 30 minutes, I hate LEDs and I would manually make it go to sleep through a command that is buried in a few sub menus.  Seems like a small thing, but I don't need another LED in my life reminding me that I'm wasting electricity, and a sleep button should be on the home screen.3) There are Amazon Prime ads all the place.  Give it a rest already please.  I don't need to be reminded every time I click a new menu that I my life would be complete if I signed up for prime. I bought the device - it is not a billboard for your service.I should note that on a hardware level it seems to work well and my only complaints stem from the software end of things.It could have been excellent, and if the software development teams get it right it still might be.  I will probably be returning mine though.", "verified": true, "helpfulness": "2/3", "author": "P. LaFrance"}, {"rating": 1.0, "review": "I have had nothing but good things to say about Amazon and their products....until the Fire TV.  It has crapped out 3 times now.  The last two times were related to an update.  A new box was sent to my daughter, who purchased it as a gift, it was hooked up and we were unable to get it to work.  After 10 minutes on the phone with a very nice rep from Amazon Fire TV we  were told that the I T crew is working on a fix for the past week and he is confidant that it will be operational in 24 to 48 hours....huh?  This is frustrating and NOT what I and my daughter have come to expect from Amazon.  When it worked, it was terrific but when it stopped working it becomes a waste of time and money.  We'll see what happens in 24 to 48 hours.", "verified": false, "helpfulness": "6/8", "author": "lavendablu"}, {"rating": 5.0, "review": "Easy to set up. Easy to use and compact", "verified": true, "helpfulness": "0/1", "author": "chad clark"}, {"rating": 4.0, "review": "So easy to set up and use. VERY intuitive to learn. Super simple navigation. Say goodbye to your obsolete remote with 100 unused and half broken buttons. I learned  how to use this remote within 30 seconds of looking at it. NO 100 PAGE MANUAL REQUIRED! Simple, to the point, and only a few buttons is all you need. Boatloads of free movies and a few wonderful made for tv series with Prime. If you like watching hard to find, artsy or independent films not found on regular tv, here it is.I have one question though: How can I subscribe to get full channels like History and Nat Geo? Please let me know if you see this. I see no question section on this page and cannot find the info online anywhere. Thanks!", "verified": true, "helpfulness": "1/1", "author": "Reti"}, {"rating": 3.0, "review": "If you buy this as a streamer, particularly for Amazon content, I think you will  like this.  It's fast and responds to voice input for Amazon content.  If you are looking to mirror your Android device or PC, you may not.  Although it has screen mirroring, I was unable to get it to work properly with my tablet running Android 4.4.2.  My Roku 3 recognizes the tablet as well as my two, Win 8.1 PCs.  Not being able to mirror, limits the content available.  For example, with the Roku 3 I can stream all episodes of Downton Abbey for free directly from the website instead of relying on the availability from certain services.  Sling TV also works fine on the Fire TV.", "verified": false, "helpfulness": "2/3", "author": "John Shaw Hodson"}, {"rating": 5.0, "review": "Love it! Voice command is great, and especially love the pbs and history apps available. I have Apple TV but, I actually do prefer my amazon fire. 😁", "verified": true, "helpfulness": "0/0", "author": "GarciaY"}, {"rating": 3.0, "review": "I've noticed that once I start to watch 'Included with Prime' TV series' or movies in a particular genre, suddenly, they are no longer included. After watching several episodes or maybe one season of a particular show, it will no longer included in Prime, and they start charging per episode. One evening I tried to continue a program I had previously watched about 3 seasons of, and overnight, it was no longer 'included' and they were charging for it. I was right in the middle of a season!! Are they keeping track of what we like to watch on a regular basis, then start charging for it? It seems that there are fewer and fewer programs/movies 'Included in Prime' than there used to be (at least programs I am interested in). Has anyone else noticed this? I've decided to start watching Downton Abbey starting with season 1 again, just to see how long I have before they start charging me for it. I'm now watching some TV shows on YouTube. I have to watch on my Kindle Fire HDX, because when I tried to set YouTube up on the Fire TV box, it wouldn't allow me to. Most options to set up, were (what I call) 'grayed out.' Trying to select them with the remote didn't work. If anyone knows what I've missed there, PLEASE let me know!!", "verified": false, "helpfulness": "1/1", "author": "C. L. Rowe"}, {"rating": 5.0, "review": "Awesome box.", "verified": true, "helpfulness": "0/1", "author": "James Ensom"}, {"rating": 5.0, "review": "Love it very much", "verified": true, "helpfulness": "0/1", "author": "yourdata"}]