[{"rating": 5.0, "review": "I purchased this for my husband for Christmas, he was so excited!! It is all it claims to be! A snap to install. It performs perfectly! You can instantly cue up videos from your phone or tablet. You can create playlists as well! GREAT, GREAT, GREAT!!!", "verified": true, "helpfulness": "0/0", "author": "Susan C."}, {"rating": 4.0, "review": "Works well for most things but when streaming live sports in HD it just can't keep up.  My wireless network isn't at fault so i assume its the chromecast not keeping up with the stream.  :)", "verified": true, "helpfulness": "0/0", "author": "S. Woodruff"}, {"rating": 5.0, "review": "It's is great! Works as well ... Aloha enjoying the show as share with family picture and movie.Happy holiday", "verified": true, "helpfulness": "0/0", "author": "David Opdyke"}, {"rating": 3.0, "review": "I was not overly impressed with the Chromecast. I have a Roku and for my money it is a better deal. Content on the Chromecast is limited at best. You need apps loaded on your android phone, iphone or ipod to stream anything. Or you can stream some content from your PC, which for me was choppy at best. overall I rate this 3 stars. It's OK but I would not recommend it.", "verified": true, "helpfulness": "1/1", "author": "CEmons"}, {"rating": 3.0, "review": "Easy to install and use, but it doesn't work with Chrome on an IPad. I probably should have bought Apple TV.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It is not rally a streamer. The installation process is not as simple as it looks. It should have at least the streamer capability - no reason to block it.", "verified": true, "helpfulness": "0/0", "author": "Yigal Ben-Zeev"}, {"rating": 5.0, "review": "The Chromecast dongle(s) integrated seemlessly into my network and TVs.  The interfaces for Netflix / Google Play / Pandora / Youtube / and Google Cast all play well.", "verified": true, "helpfulness": "0/0", "author": "Rick E. Pfefferle"}, {"rating": 4.0, "review": "It took a while to figure out how to use.  If you have a ROKU box, do not waste your money.  This will be a great product once they get the other servces (Amazon, etc.) to incorporate the Cromecast into their products.", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Love this product! I've ordered one for my friends and my family and it is superb! Always clear, reliable and fast streaming. Easy to set up and everyone loves it.", "verified": true, "helpfulness": "0/0", "author": "HK2712"}, {"rating": 1.0, "review": "I am not sure why this product received all the hype that it generated. All it offered was the ability to show my Chrome browser on the TV screen, and even then the resolution was poor. So for $35 a better alternative is just use an HDMI cable and see your PC screen on the TV. I would suggest a Roku, Apple TV (my choice) or save your money and buy a web enabled TV.", "verified": true, "helpfulness": "2/2", "author": "Perry T Lockhart"}]