[{"rating": 4.0, "review": "YouTube needs to be added to the App Store!", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "Lacking in a few departments & features, however this is a great product through & through. A Must have for those seeking solid entertainment in their lives with little effort. Kudos!", "verified": true, "helpfulness": "0/0", "author": "Daniel R Parker"}, {"rating": 2.0, "review": "No biggie. Fewer free choices than I expected. It works fine. Its just that there are lots of ways to hook the TV up to the web without all the marketing.", "verified": true, "helpfulness": "0/0", "author": "R. Oswald"}, {"rating": 2.0, "review": "Fire TV does what advertised by adding streaming movies and access to streaming apps like Netfix; however, every time I turn it on, I have to go to the unit, unplug it (to reset it) because it delivers no sound. Every time. Switching brands to add to other rooms.", "verified": true, "helpfulness": "0/0", "author": "dswan19"}, {"rating": 4.0, "review": "Is god", "verified": false, "helpfulness": "0/0", "author": "pedro tejada"}, {"rating": 5.0, "review": "This is so cool.", "verified": true, "helpfulness": "0/0", "author": "frank p viteretti"}, {"rating": 5.0, "review": "Love it.  Couldn't ask for a better product.  Simple to setup and ease of use afterwards.", "verified": true, "helpfulness": "0/0", "author": "Kenny"}, {"rating": 5.0, "review": "This is an amazing piece of equipment.  I was looking for a way to reduce my cable bill and was torn between all the available options out there.  When I finally came upon the Fire TV, it pretty much had everything I was looking for.  It combined all the things of the Chromecast and Roku, plus all the benefits of Amazon and Prime.  I was able to drop a huge portion of my Comcast (and we all know how great it is to get rid of as much Comcast as possible!) ans save quite a bit of money.  I especially like that Amazon left the Fire TV \"unlocked\" so then I can install non-official apps.  I think this might be the best thing I've bought from Amazon so far and I highly recommend it...for $100 it seems like a no-brainer.", "verified": true, "helpfulness": "0/0", "author": "Thomas Rosswaag"}, {"rating": 5.0, "review": "Works Great Love it", "verified": true, "helpfulness": "0/0", "author": "Sue Congemi"}, {"rating": 4.0, "review": "Love it! More options than chromecast. Scrolling around can be a bit awkward. Wish there were a few more options on the remote but it is worth the money. Getting me closer to fetid rid of cable", "verified": true, "helpfulness": "0/0", "author": "Jill Weinreb"}]