[{"rating": 5.0, "review": "very good product, it works fine", "verified": true, "helpfulness": "0/0", "author": "camgcr"}, {"rating": 1.0, "review": "Weak software 4.4 and higher? 90% of the androids out there are 4.3 and lower. Worked with my Note 3 but not my Note 10.1 or Tab 10.1.Overheats after 30min. Killed the device completely. Good luck getting a refund.", "verified": false, "helpfulness": "0/0", "author": "J. Bighley \"JCob\""}, {"rating": 4.0, "review": "Very simple to set up and use. I only wish it would stream from a Windows desktop a little better.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Have had mine for over a year now, it is fantastic!", "verified": false, "helpfulness": "0/0", "author": "Robert Bishop"}, {"rating": 4.0, "review": "It's awesome", "verified": true, "helpfulness": "0/0", "author": "Darien"}, {"rating": 1.0, "review": "I loved my chromecast when i first got it because it streamed all my netflix shows and movies. then suddenly, with no change in anything, it stopped working. i deleted and redownloaded both chromecast and netflix app. no solution. i turned off all the power supply in both the wireless router and the tv and chromecast. not the solution. youtube streams fine. netflix plays fine on my phone. there have been many other reports of netflix and chromecast not working. what gives??", "verified": true, "helpfulness": "0/0", "author": "bizzy"}, {"rating": 5.0, "review": "Mirror app on galaxy S5 is awesome with chromecast. I can watch Netflix, popcorntime, and youtube from my phone. I can watch video or pics on my TV I took with my phone. Anything  you can watch on your S5 can be watched on your TV.", "verified": true, "helpfulness": "0/0", "author": "C Spangler"}, {"rating": 5.0, "review": "Enjoy this device very much, have one on all my TV's", "verified": true, "helpfulness": "0/0", "author": "Linda D. Woods040377"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "maxene stroup"}, {"rating": 5.0, "review": "Excellent Seller. A+++", "verified": true, "helpfulness": "0/0", "author": "J. Mata"}]