[{"rating": 5.0, "review": "We have just had it out of the box for a few days but so far it has worked great. Easy to set up. I just thought there would be more free movies. Maybe I just haven't found them yet", "verified": true, "helpfulness": "0/0", "author": "Chytuck"}, {"rating": 2.0, "review": "Did not work out of the box... directly connected via ethernet cable...support escalated to development but never heard from support again. Had to install new wireless router, then it worked...signed up for FREE Prime trial and got billed $99.. So $99 for Fire TV $99 for Prime and $60 for new router  and $258 later packed it all up and sent it back...How can this be a good way to Cut-the-Cord?", "verified": true, "helpfulness": "0/3", "author": "Gary"}, {"rating": 3.0, "review": "I expected so much, that got disappointed. The interface is excellent but streaming is not good. In same circumstances I found roku streaming better (no hick-ups)", "verified": true, "helpfulness": "0/2", "author": "Carlos \"cam2c\""}, {"rating": 1.0, "review": "I get We're having trouble playing this title right now all the time, no other device in my household does this.  Picture quality is not high def. Very poor product!", "verified": true, "helpfulness": "0/6", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Wife uses it mostly to watch Grey's Anatomy and other TV series that she missed. Could a 4 1/2", "verified": true, "helpfulness": "0/0", "author": "Bruce F"}, {"rating": 3.0, "review": "Amazon Fire was delivered timely.  Setup was pretty easy.  The only issue I have right now that I can contribute to the Fire is that every time we watch a new show, the volume is muted.  The only way to get the volume back up is to change the tv's input source from the hdmi (fire) to the television. The HDMI cord was new and delivered from Amazon so I can't determine if the issue is with the device or the cord.  Either way, its a bit annoying.", "verified": true, "helpfulness": "1/1", "author": "Chemene Pope"}, {"rating": 5.0, "review": "Great product with an easy user interface.", "verified": true, "helpfulness": "0/1", "author": "Mclovin87 \"Summer Lovin\""}, {"rating": 5.0, "review": "Great! My wife loves it!", "verified": true, "helpfulness": "0/1", "author": "alex"}, {"rating": 5.0, "review": "easy to use. i love it", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I am very pleased with the performance of the Amazon Fire TV system.  It was easy to install, provides a good picture and has a great selection of movies w tv series.", "verified": true, "helpfulness": "1/1", "author": "Vivian L. Blair"}]