[{"rating": 4.0, "review": "Not exactly  what we expected. Thought we would also have access to live local channels.", "verified": true, "helpfulness": "0/4", "author": "Synthia Alley"}, {"rating": 5.0, "review": "This is a great way to access a larger variety of movies, HBO series, music, videos, etc. I previously used Chrome Cast, but because of wanting to access Amazon Prime movie offerings, I was unable to stream them via Chrome Cast. To my delight, switching to Amazon Fire TV has been well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Aussie"}, {"rating": 5.0, "review": "Amazon Fire TV! 10 out of 10! Great product! Get it today! Nothing bad to say about it!", "verified": true, "helpfulness": "0/0", "author": "Benton \"due soth fan\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "bats"}, {"rating": 5.0, "review": "I've owned several Android \"sticks\" and have not been quite happy with the streaming quality.  I figured I'd give the Fire TV a shot.  I was not disappointed.  I personally use a wired ethernet connection to stream content at home, but used it via wirelessly as well.  No complaints.  It has to be the best streaming device I've used.Some notes:1) If you're a novice tech person and can't push apk files to the device, you will be limited to Amazon's Prime content and the limited number of apps Amazon has available for the Fire TV2)  If you're willing to experiment or you're comfortable with side loading or pushing apps to the device, the Fire TV is quite powerful.  I've been able to Push Hockeystreams, NFL Sunday Ticket, XBMC and other apps to the device-all of which work really well.  I've had success connecting a bluetooth keyboard/mouse to the Fire TV as well (certain pushed apps will require a keyboard/mouse and won't work with the Fire TV remote).  Youtube is an excellent resource for easy \"how-to\" directions to do all this.The device does eat up a lot of data.  Streaming hockey games at high def/std def for 4-5 hrs last night ate up 5GB's of data.  For those being throttled (Comcast for example), you may want to monitor your activity.", "verified": true, "helpfulness": "0/0", "author": "J. D."}, {"rating": 5.0, "review": "Great product. I have Roku but I like Fire TV better. Faster streaming of movies. Voice search is great. This is the one to beat", "verified": true, "helpfulness": "0/0", "author": "Eddie Rodriguez"}, {"rating": 4.0, "review": "I'm definitely a fan of my Amazon Fire TV. I was going to buy another Roku, but realized that the streaming service I use most is Prime Instant Video, so why not go with Amazon? The interface is simple, but elegant; the channels are extensive. The only gripe I have is that there's no HBOGo, but if that's the only issue, then I'm very satisfied. Great product, and the voice search feature is a revelation in itself. Highly recommended.", "verified": true, "helpfulness": "1/1", "author": "Jamaal Buckley"}, {"rating": 4.0, "review": "cc", "verified": true, "helpfulness": "0/0", "author": "warren gold"}, {"rating": 5.0, "review": "Easy setup! I really was suprised by the quality of it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome love the talk feature", "verified": true, "helpfulness": "0/0", "author": "TJ"}]