[{"rating": 5.0, "review": "I literally have not had one problem with it. Loading can be a little slow sometimes. However, what we consider slow now days is when loading isn't happening \"immediately\". So when I say slow, I am just warning you may have to watch the loading bar on the screen for 7-10 seconds. I have no problem with that. I did notice other reviewers had made mention of this \"delay\".If you have been thinking about it, I say go for it.Having the ability to move it from room to room makes streaming and viewing a lot easier.", "verified": true, "helpfulness": "0/0", "author": "Thick Southern Accent"}, {"rating": 5.0, "review": "I had originally bought my Chromecast last Christmas. I remember everyone in my family was confused as to why I would need one, this Christmas I ended up buying FOUR for my family members. They are all obsessed with it. It works great and makes my tv viewing experience a seamless one.", "verified": true, "helpfulness": "0/0", "author": "Navneet K."}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Hamed"}, {"rating": 5.0, "review": "I bought this for my chick who is an Android User. She LOVES IT! Turns my old 50\" plasma into a smart TV. What a great deal!", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 1.0, "review": "The device was not very useful in first place because of bad picture quality. Then Roku started to support YouTube and later casting from Android phone to TV. Finally it died one month after the one year of warranty expired. Google technical support was extremely poor.", "verified": true, "helpfulness": "0/0", "author": "Alex Mezhibovsky"}, {"rating": 3.0, "review": "Sound kicks out a lot requiring reboot to get back.  Not sure if its Chromecast or Amazon Prime?", "verified": true, "helpfulness": "0/0", "author": "Jim Hall"}, {"rating": 5.0, "review": "Greatly enabled my hdtv functionality by incorporating it into the web.", "verified": true, "helpfulness": "0/0", "author": "IgorReviewing"}, {"rating": 4.0, "review": "Great option to make a dumb TV smart, or to stream from apps not on a smart TV. Easy to use (as long as it doesn't get in a bad mood, see below). App support is fairly good, with some holes or odd restrictions for what I can only assume are corporate reasons (Xfinity, Amazon).Taking a star off for some quirky behavior sometimes (like disconnecting but continuing to play rendering the playback unstoppable, or not appearing as available in apps even though it is online).", "verified": true, "helpfulness": "0/0", "author": "djkronik57"}, {"rating": 5.0, "review": "I like this.  It replaces the little box that I was using but, it's much easier.  One just need click on the icon on one's lap top screen and the screen on the computer magically appears on the TV. Easy, easy to install and run.  I use it mostly for old youtube movies.", "verified": true, "helpfulness": "0/0", "author": "DrJake \"world traveler\""}, {"rating": 4.0, "review": "Works as described. Puts your phone screen on the TV.", "verified": true, "helpfulness": "0/0", "author": "Coop"}]