[{"rating": 4.0, "review": "It is an excellent product and useful to project on a big TV screen as an alternate to using a projector with video content.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Good price for this streaming player. Easy to connect to your TV. If you have a Wifi account or connection it works very well. You need to have a PC or a smartphone in order to stream content from them.", "verified": true, "helpfulness": "0/0", "author": "Miguel Figueroa"}, {"rating": 5.0, "review": "After using this for a few months, I love my Chromecast. No more having to mess with my BlueRay player's poor Netflix player, having to plug a phone or a laptop in for Pandora or other music, and don't have to futz with finnicky remotes. Switch to Chromecast input, and use my phone or laptop. Casting tabs in Chrome is great for watching videos anywhere besides YouTube, and showing friends and family stuff online.My one beef is you need a good router and internet connection, otherwise you can tend to drop the connection, but that's not Google's fault. And it's so much cheaper than the other options, and designed to work with my Android devices. For around $30, It's a no-brainer!!!", "verified": true, "helpfulness": "0/0", "author": "WrenchEd"}, {"rating": 5.0, "review": "The Chromecast does one thing that my Roku(s), Tivo, and similar devices don't do when it comes to Comcast: Stream HBO Go. That alone makes it worth the $35, which is half what a Roku costs. The Roku has an advantage because it has an actual remote and you don't need a mobile device to use it ... which is a small drawback to Chromecast, because if your battery is low there's an issue, or if you want to change what you're watching, it's not as quick. But the battery usage for your phone is minimal, since the video is only playing on your TV, and as for switching to a different show, it's just a little hassle if you have to punch in your password because your phone has been sitting still for a bit.Considering you can take this anywhere and you don't need cords, it's fantastic. I've used it for YouTube, Netflix, and HBO Go so far with no issues.A side note- your router does matter. I had to make a small adjustment in my router settings (there are tutorials all over) to allow Chromecast to work. Some routers automatically work, others you have to get into the settings for a minute.", "verified": true, "helpfulness": "0/0", "author": "Andrew R. Shaw"}, {"rating": 1.0, "review": "You have to power down daily,  or reboot your router every time you use it. If properly updated, it may work better.", "verified": true, "helpfulness": "0/2", "author": "ryan"}, {"rating": 4.0, "review": "For the price and size this is a must own for any tech savy house hold. With more developers lining up to work with the product, the future of this device looks even brighter than the present.", "verified": true, "helpfulness": "0/0", "author": "Henry Hill"}, {"rating": 2.0, "review": "Just turn back now if you think you'll be able to magically stream all video content from your device to your TV. It does NOT work for this purpose if the website does not have a Chromecast icon integrated.Luckily for me, I got this specifically for using HBO GO, which I can stream from my phone or laptop. It is EXCELLENT for this purpose.", "verified": true, "helpfulness": "0/0", "author": "bogmonkey"}, {"rating": 4.0, "review": "It is my second chromecast and it's getting better all the time.There are so many apps that use the chromecast SDK now, this stick is improving by the day. I am curious what else will be supported and I think it is a great piece of equipment.Easy to setup and easy to use with your smartphone or tablet.", "verified": true, "helpfulness": "0/0", "author": "Amazon-Kunde"}, {"rating": 5.0, "review": "Just love it.  Easy to install, easy to use.  We have two of them!  I highly recommend Chromecast for anyone who does a lot of television watching.  We are retired and are in a good deal of the winter.  Great way to pass the time.", "verified": true, "helpfulness": "0/0", "author": "LadyDi"}, {"rating": 4.0, "review": "After a few minutes setting this baby up, i could stream youtube, netflix and just about anything i want from my CPU or phone to my TV. Only downside is that you cannot yet stream local media such as iTunes to your TV, it must be played from the chrome browser. Great value for the cost.", "verified": true, "helpfulness": "0/0", "author": "Alex Holter"}]