[{"rating": 2.0, "review": "Unit needs to cast content direct from a device vs. only through an Internet connection.", "verified": true, "helpfulness": "0/0", "author": "AZmike"}, {"rating": 5.0, "review": "Nice.", "verified": true, "helpfulness": "0/0", "author": "Janewit Kraprayoon"}, {"rating": 5.0, "review": "Awesome works great", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Great price and free shipping. Built well and would advise to buy if you use YouTube and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Gregory Koranda"}, {"rating": 4.0, "review": "It worked just like it was supposed to, and it was very easy to install. The directions were clear and easy to understand.", "verified": false, "helpfulness": "0/0", "author": "Skyspy"}, {"rating": 5.0, "review": "Works really well - good product for the cost.", "verified": false, "helpfulness": "0/0", "author": "EO"}, {"rating": 5.0, "review": "I literally use this every day. I have cable with every channel available but some how there's still a lot of nothing a lot of the time. I only use this for netflix on my tv. i spent a large chunk on a smart tv and i do love it but still had a great hd tv, so when found this i thought id give it a try. It works great. i intend to buy another for my backroom. For now i just move it with me. its easy to set up. although honestly i connected it to the tv and had my husband connect it from that point to our devices. I recommend this to everyone. If you have an hdmi port i see no reason to have to buy smart tvs thanks to this little device.", "verified": true, "helpfulness": "0/0", "author": "Brittany"}, {"rating": 4.0, "review": "Easy to use and affordable,i am happy with it for it works well.", "verified": false, "helpfulness": "0/0", "author": "amber"}, {"rating": 5.0, "review": "Words cannot describe this device. Joy and gladness seep out from the seams because it is overfull with both. You will forever be cleaning joy and gladness from the ground beneath it... but even so... it is the greatest media player you have ever purchased.", "verified": true, "helpfulness": "0/0", "author": "Isaac Martin"}, {"rating": 5.0, "review": "Great device, easy to set up and was streaming movies in no time.", "verified": true, "helpfulness": "0/0", "author": "Adrian Guzman"}]