[{"rating": 3.0, "review": "It would be nice if it works works with VLC player or other outlets.  Otherwise it's very easy to use", "verified": true, "helpfulness": "0/0", "author": "Fady Yousif"}, {"rating": 5.0, "review": "Works fantastic in areas of good wifi reception.  Drops out if signal is week.  It is a good product at a good price", "verified": true, "helpfulness": "0/0", "author": "Jer"}, {"rating": 4.0, "review": "Some times it is less than obvious what one is to do and the order one should do things or if steps are necessary when returning.Generally works well. Disappointed that it does not have a kindle app.", "verified": true, "helpfulness": "0/0", "author": "big but not pig headed"}, {"rating": 5.0, "review": "Great product for the price!! It runs very smoothly and is extremely portable! I recommend this product and a great alternative to apple TV!", "verified": true, "helpfulness": "0/0", "author": "Kevin Goldstein"}, {"rating": 5.0, "review": "We love it for what it does so far. Easy to use in a hotel room or visiting a friend", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 3.0, "review": "Not all that..can't use it as a stand alone. .Also caused conflict with home wifi..otherwise not a bad thing. .I think", "verified": true, "helpfulness": "0/0", "author": "joseph m charnigo"}, {"rating": 4.0, "review": "this will be so much better when google adds more to it. great concept and awesome first run. I can cast from my laptop ANY webpage and some apps from my phone.  It does have issues when trying to watch videos on the web in full screen but I figure that will be worked out very soon.", "verified": true, "helpfulness": "0/0", "author": "nursemm05"}, {"rating": 4.0, "review": "It works like a charm. 4 stars only because not too many apps. But my samsung tv was having youtube app. Now i can see youtube without any issues", "verified": true, "helpfulness": "0/0", "author": "V. Sabareesh Kolichetty"}, {"rating": 4.0, "review": "Great device. Simple and easy to use. Just wish there was more compatibility for other devices. Just compatible with google music, youtube, netflix, and google play", "verified": true, "helpfulness": "0/0", "author": "that guy"}, {"rating": 5.0, "review": "AMAZING product, everything about it is great! No more having to go searching for an hdmi cable any time I want to watch a movie or show family photos. One slight downfall is that the tab casting can be quite glitchy on videos, but compared to what else this thing can do its a five start to me!", "verified": true, "helpfulness": "0/0", "author": "Justin Goetz"}]