[{"rating": 5.0, "review": "Works perfect!!!", "verified": true, "helpfulness": "0/0", "author": "Antonio Geremiah Porter"}, {"rating": 5.0, "review": "Excellent product if you hace an android phone por tablet", "verified": true, "helpfulness": "0/0", "author": "Peter E."}, {"rating": 5.0, "review": "This device is awesome! Can play Netflix, Pandora, and YouTube. You can also screen mirror and show what's on your screen on to the TV. However, it does not play I Heart Radio or Spotify.  It is connected by an HDMI but powered by USB port. If you don't have a USB port on the back of the TV, it comes with an outlet adapter. It is super easy to connect to and I use it all the time! I'm so glad someone recommended it to me!", "verified": false, "helpfulness": "0/0", "author": "Kell"}, {"rating": 3.0, "review": "Product as describe.", "verified": true, "helpfulness": "0/1", "author": "VonGrahl"}, {"rating": 2.0, "review": "I was a little disappointed in this device. As soon as I paired it with my tv it had to download an update which took about 4 hours, and I really wish it could use Bluetooth streaming to play videos directly from my phone instead of having to go through an app. I bought this so I could play all the movies I've bought through iTunes but it will only stream through YouTube or other apps. Would work awesome with Netflix, just make sure you are using an unlimited Internet connection, this will devour your cellular data!", "verified": true, "helpfulness": "0/1", "author": "Ashley Yates"}, {"rating": 4.0, "review": "Doesn't always connect", "verified": true, "helpfulness": "0/0", "author": "Justin swick"}, {"rating": 4.0, "review": "Working well, easy set-up!", "verified": true, "helpfulness": "0/0", "author": "Dfib"}, {"rating": 1.0, "review": "While it was recommended by an Amazon employee  as a solution to stream my Kkndle onto my TV screen it was not the correct  item.", "verified": false, "helpfulness": "0/3", "author": "Jacqueline Israel"}, {"rating": 4.0, "review": "I don't like having to use my phone for chromecast. I like my appleTV much better. But it's alright for the price.", "verified": false, "helpfulness": "0/0", "author": "Kristin"}, {"rating": 5.0, "review": "Does everything as advertised and does it extremely well--Bill Ticker", "verified": true, "helpfulness": "4/4", "author": "Billy F Tucker"}]