[{"rating": 4.0, "review": "Very disappointed to learn that voice search does not work on Netflix.Overall performance of Amazon fire TV works very well. Amazing pick up from remote to device.Voice search capabilities misleading regarding ability to work in NetFlix.Might as well buy the fire stick with standard remote. Save money with that choice.", "verified": true, "helpfulness": "0/0", "author": "LARRY O KEY"}, {"rating": 4.0, "review": "Have found Fire responds the way I expected and the content was very good.", "verified": true, "helpfulness": "0/0", "author": "James R. Lamb \"Jim Lamb\""}, {"rating": 5.0, "review": "Great product.  Runs XBMC smoothly", "verified": true, "helpfulness": "0/0", "author": "Brian G"}, {"rating": 4.0, "review": "Great unit", "verified": false, "helpfulness": "0/1", "author": "George Cunningham"}, {"rating": 5.0, "review": "This is the first \"TV\" device we've had, so I wasn't sure what to expect. I purchased the Fire TV console because I understood it would download programs prior to playback for a better streaming experience. Our television, which runs off our WIFI, is in a part of the house that doesn't always get a good signal and tends to stop playing because of it. It got so bad that the television just sat for a couple of months because we were so frustrated by the poor playback. I was hoping the Fire TV would work despite the varying connection strength. We've only had the unit for a few days, but in that time we've watched four full-length movies without interruption, so it seems to be meeting our expectations. I'm glad O bought it.", "verified": true, "helpfulness": "0/0", "author": "mtflyfish"}, {"rating": 4.0, "review": "So far i like the Fire TV. Only issue I've had was purchasing a season of a TV series on my computer and I wasn't able to view it on the fire TV maybe I didn't wait long enough for it to show up... wasn't sure about this. it seems like all my other purchases were there but i went ahead and bought it from the Fire TV as well and watched the episodes from there. Most likely this is where I will purchase my episodes and movies so it shouldnt be a big  deal. Also i haven't noticed a way to setup a kids profile... again may be my lack of experience with it so far (I've only used it for a few days) but having a kids profile to let my kids loose on it would be nice.", "verified": true, "helpfulness": "0/0", "author": "David Giammona"}, {"rating": 4.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "LaToya madkins"}, {"rating": 4.0, "review": "GreAt enjoying veiwing", "verified": true, "helpfulness": "0/1", "author": "Ruth Spooner"}, {"rating": 5.0, "review": "I have been a prime member for to years. I now am able to watch and play everything on the t.v .in our living room. My son has a blast speaking into the remote to find his programs. I have a tablet that I was streaming onto the t.v., but this is so much better! What a great Christmas gift from Santa! Good job on this one Amazon, Thanks!", "verified": false, "helpfulness": "0/0", "author": "Musiclover"}, {"rating": 4.0, "review": "Nice device. Easy to configure and no more stuttering like my Apple TV. Recommend", "verified": true, "helpfulness": "0/0", "author": "formula100"}]