[{"rating": 5.0, "review": "Awesome, but one for each TV in the house.  Great interface, plenty of streaming options, easy controls.", "verified": true, "helpfulness": "0/0", "author": "SB619"}, {"rating": 2.0, "review": "Not what I expected.  Settings are not clear.  More instructions are needed.  I can get better access via my blu Ray player.", "verified": true, "helpfulness": "0/0", "author": "Dorothy M. Reina"}, {"rating": 4.0, "review": "Chromecast is a pretty good product for streaming music and movies to your television. It isn't perfect, but you can't beat the price. I wish more apps were capable of synchronizing. One of my favorite options is streaming an entire webpage from your computer using Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Alison"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Mohammed Barabea"}, {"rating": 2.0, "review": "I have had trouble viewing YouTube and video's from other sources, and sometime the cast picture is at a different speed than the device it is cast from.Maybe its me and I was expecting more than the device is capable of delivering...Still having problems, really should have sent it back but lost the packing material..", "verified": true, "helpfulness": "0/0", "author": "Anthony555 \"Anthony k.Nance\""}, {"rating": 5.0, "review": "I will use this all year round... Love it...", "verified": true, "helpfulness": "0/0", "author": "barmorec"}, {"rating": 5.0, "review": "Awesome. Now we can chill and watch TV instead of straining to both view the desk top at the same time.", "verified": true, "helpfulness": "0/0", "author": "Poozy"}, {"rating": 4.0, "review": "The device itself is fine as are the installation instructions.  However, the instructions for casting from various devices is poor.  I had to view a few YouTube videos before getting it to work fully.", "verified": true, "helpfulness": "0/0", "author": "Richard R. Pardi"}, {"rating": 5.0, "review": "Love this little thing!!!!!", "verified": true, "helpfulness": "0/0", "author": "noel"}, {"rating": 3.0, "review": "Didn't realize it's not really compatible with apple devices and seems to stream clearer from my laptop when I just use a regular hdmi cord. Wouldn't say I'm disappointed, just waste of money for me.", "verified": true, "helpfulness": "0/0", "author": "Janae Bradshaw"}]