[{"rating": 5.0, "review": "Awesome!!  Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Dena Obney"}, {"rating": 2.0, "review": "SORRY. Exchanged it - for a Roku 3 after realizing I'd have to join Amazon Prime to receive anything/much/enough.", "verified": true, "helpfulness": "0/0", "author": "Anne Elliot"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Jones"}, {"rating": 5.0, "review": "Very intuitive!  Like this product a lot.  Speech search is very cool!", "verified": true, "helpfulness": "0/0", "author": "Gary P."}, {"rating": 5.0, "review": "what can i say, i guess there is no words to explain how cool ammazon tv is. i now just bought the new amazon stick.", "verified": true, "helpfulness": "0/0", "author": "david parra"}, {"rating": 4.0, "review": "I like the Fire TV it works very well to watch shows on my prime account but I mainly bought it to use the gaming option. I find the games work pretty good on it but I thought it would use all android games and it doesn't but there are quite a few games available. I haven't used any of the other apps  at this time but might try Netflix I like to watch old TV shows.  I would recommend it to people who have Amazon Prime its the easiest way to watch and you get many other options to use it for.", "verified": true, "helpfulness": "0/0", "author": "Carl Kriebel Jr."}, {"rating": 4.0, "review": "I love it for most of the part, but has some issues. Biggest bummer is that it doesnt natively support videos being played from local storage/external drives. My old Sony set-top box did just fine. Another big issue is that voice search only works with Amazon Prime and im not looking to purchase it in the near future. Other than those issues, the experience is streamlined. Menus and navigation are fast and responsive with little to no lag, only on loading up new apps. Wifi works great, range and connection are superb, router only 40ft away. I mainly use netflix and hulu, they work very well aside from the occasional hiccups when loading a show every now and then, but my connection is probably to blame. I find it strange that there is no power button as i dont watch that frequently to warrant having the FTV on standby all the time. If they fix those issues, this would be the perfect media player. I have faith in Amazon and am pleased in their products.", "verified": true, "helpfulness": "0/0", "author": "Steven F Ng"}, {"rating": 4.0, "review": "Good v1 product and continues to get better.", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 5.0, "review": "expectations more than met!", "verified": true, "helpfulness": "0/0", "author": "Frank Cervantes"}, {"rating": 5.0, "review": "Best streaming device EVER!!  I have a Roku but this beats them all.  Fast, user friendly.  Best thing to happen to TV.  The voice remote takes all the searching and searching out of existence.  Thank you Amazon for making my video watching experience so much better!", "verified": true, "helpfulness": "0/0", "author": "Peter Lufkin"}]