[{"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/1", "author": "Esteban Vega Gonzalez"}, {"rating": 5.0, "review": "great image", "verified": true, "helpfulness": "0/1", "author": "VIVIANA REYES ALARCON"}, {"rating": 5.0, "review": "SWEET!!  =)", "verified": true, "helpfulness": "0/1", "author": "J. Summers"}, {"rating": 2.0, "review": "It may work, but it didn't for me, in may case asked me to do some special setting on my router, which I did and still didn't work.", "verified": true, "helpfulness": "0/1", "author": "Luis Beato"}, {"rating": 5.0, "review": "Nice product....", "verified": true, "helpfulness": "0/1", "author": "kyblue"}, {"rating": 5.0, "review": "I loved it, this is making my BlueRay useless hahaha!!! Also my BlueRay disc's are kind of becoming useless too with this item... I have almost all my movies stored in that new vudu thing and don't even need my TV's remote, I do everything through my phone: turn on the TV, change channel(phone app function) and with Chromecast I watch all my movies thruogh the phone and enjoy a better video phone call with relatives far away.", "verified": true, "helpfulness": "0/0", "author": "Javier Alatorre"}, {"rating": 1.0, "review": "1/2 Star!!! Did not work in my systems and there were NO notations in the product write-up as to what configuration of system was required for it to work!!!VERY. VERY DISSAPPOINTED..................", "verified": true, "helpfulness": "1/1", "author": "On-Line Buyer"}, {"rating": 1.0, "review": "I'm actually very disappointed with this product. I downloaded Chrome and anytime I try to stream to my TV I get choppy connection and audio/video sync issues. I was using airplay and thought if I switched this would be better but it is by far inferior. I don't even use it... What a waste of money. Buyer beware.", "verified": true, "helpfulness": "1/2", "author": "Landon Clark"}, {"rating": 3.0, "review": "it is ok", "verified": true, "helpfulness": "0/1", "author": "julie spielman"}, {"rating": 5.0, "review": "All I can say is awesome.  We use this everyday, and the picture is crystal clear!", "verified": true, "helpfulness": "0/0", "author": "Ellen"}]