[{"rating": 5.0, "review": "The first thing I have to say is that it is your responsibility to learn about the product and understand what it does and doesn't support. That being said our tech genius friends across the internet have found several workarounds and the Chromecast SDK just recently went public (aka the manual for app developers to use to program in Chromecast support), so we can expect full support for many apps in the coming months.I use it for mostly Pandora and Netflix and love that I can just grab my phone off the table and have full access to my various libraries to pick and choose while whatever it is keeps playing on the screen.To the college students: this thing is awesome for parties! Unsecure your wifi network for the night then create and share a public playlist for anyone to add to. With this I can have music videos playing on the TV while my A/V system bumps (and people aren't always stopping the music to switch phones).", "verified": false, "helpfulness": "0/0", "author": "Coggeshall"}, {"rating": 5.0, "review": "The Chromecast is a high quality streaming product, realize though it doesn't stream FROM your device, but from the \"Cloud\" or just the internet if you want to think of it that way. Works really well with Plex Media Server and the Plex App!", "verified": true, "helpfulness": "0/0", "author": "Fabian B."}, {"rating": 5.0, "review": "This is a great device, its a cheap way to get Programming to any television in you house. I Recommend", "verified": true, "helpfulness": "0/0", "author": "Preston M. Holder"}, {"rating": 4.0, "review": "If you are running Chrome on your computer or smartphone (except iPhone) you can easily plug in your TV and currently watch (with subscription) Netflix and or Hulo plus. I happen to like these two internet companies thus Im happy with it. You need fast internet and wifi connection (you can obtain obtain with a router, apple airport is ok too.).In regards to other channels to watch these are the only two I like unless you like oriental movies. I find it I don't need TW cable with antenna and chrome cast with one  for the living room TV.FYIYou need a router unless your cell or tablet have their own wifi and you have plenty of data available. With a router once you make the connection with let's say your cell, the rest goes thru your router over the internet connection and you are not using data from your plan.", "verified": true, "helpfulness": "0/0", "author": "adfoxie"}, {"rating": 4.0, "review": "Good deal helps fight the high cost of cable plus I watch what and when i want to.and not alot of money", "verified": true, "helpfulness": "0/0", "author": "robert oconnor"}, {"rating": 4.0, "review": "It's very easy to install, just like the other comments said here. I didn't get the high quality graphs though, but that might be the original signal, not chromecast. 4 stars overall.", "verified": true, "helpfulness": "0/0", "author": "Anne Liu"}, {"rating": 5.0, "review": "Love Chromecast!  Netflix and their original programming are now on \"speed dial\" at our home.  Haven't had the need for HBOGo yet and really don't want to spend another $7.99 for Hulu Plus ... but streaming from our tablet's and computers or watching Netflix is pretty outstanding.", "verified": true, "helpfulness": "0/0", "author": "Al Hays"}, {"rating": 2.0, "review": "This was a gift for my husband.  He was so excited.  But it wasn't able to do what we had expected (basically take anything on the small screen of the computer and project it on the large TV.  Appears to only work with Netflix, not Amazon Prime movies.  And not the webpage or spreadsheet or document displayed on the computer.Tried to return, Amazon wouldn't let us, since it was over the return deadline.  So stuck with it now, until Chromecast is updated and plays nice with other systems.", "verified": true, "helpfulness": "0/0", "author": "window shopper \"window shopper\""}, {"rating": 5.0, "review": "Worked great!  Did exactly what it was supposed to do.  I am able to stream movies and/or music videos from my IPAD to my TV using the Chromecast and my wi-fi at home.", "verified": true, "helpfulness": "0/0", "author": "Rosemary J. Diletto \"Rosemary J. Diletto\""}, {"rating": 4.0, "review": "I really just got this because I didn't have another way to play HBOgo on my TV. My TV is \"smart\" so I can stream netflix, amazon, youtube et al directly but not HBOgo. While a downloaded the add on for Chrome browswer, I found that when I tried to display the web from my computer it didn't work well. Like the screen was sunbleached and inverse. Weird. For $35, I got my use out of it watching all 3 seasons of Game of Thrones one rainy 4day weekend. I can also imagine this is good for a tv that doesn't have the cable box (like if I put one in my bedroom).But out of the box, it was easy to setup and start using. One weirdness is there doesn't seem to be a hierarchy of devices using it: my boyfriend and I kept taking control away from each other via our phones. That is he was streaming something annoying so I just streamed over it and it took then he did the same. if you got some wisecrackers, or roomies or kids that don't get along... that could be a point of contention.anyways, it's a good product for a great price.", "verified": true, "helpfulness": "0/0", "author": "jijiferjones"}]