[{"rating": 5.0, "review": "Good tinked prosuct, rigth price vs the versatility in it, still learning on things to do with it.Needs a remote for easear RW and ffw videos.", "verified": true, "helpfulness": "0/0", "author": "Carlos R. Gordillo"}, {"rating": 2.0, "review": "A little delayed and choppy while using the beta feature used to watch live sports. I prefer to use a HDMI cord for flawless connection and quality.", "verified": true, "helpfulness": "0/0", "author": "J. Atterberry"}, {"rating": 5.0, "review": "I like it, good purchase for the price. Efficient and effective,  easy to install and use.i wish it didn't need power suply and using 5 volt  of USB instead of long wire and adapter  but that could be desirable feature for next version.", "verified": true, "helpfulness": "0/0", "author": "Houman T"}, {"rating": 2.0, "review": "I am constantly being challenged for passwords every time I plug it in. My ROKU and MY Smart TV's pretty much do to thing and they never challenge me for passwords. My ROKU has a \"Cloud\" APP that my computer can interact with. So, if I can put it on my computer I can put it on the \"Cloud\" and view it on my Big Screen TV through my ROKU I am sure the \"Cloud\" app would start charging after I used I a couple of times.\"The only reason I think of to use a Chromecast  is for presentations.\" (I am retired, I don't do presentations anymore!) My Camera Charges through my PlayStation 4 and downloads all my pictures and videos to the PlayStation 4 while its charging. PlayStation make the best presentation of home photos and videos I have ever seen. There is no incentive for me to even put myself through the trouble of using my Chromecast. My Chromecast sits in a drawer some where and has been there since last January.", "verified": true, "helpfulness": "0/0", "author": "Delton C. Baker"}, {"rating": 5.0, "review": "Takes a little effort to learn its functions linking the computer, TV, and Android device via Chrome cast and screen cast. A fun gadget that expands my entertainment choices.", "verified": true, "helpfulness": "0/0", "author": "D. Chang"}, {"rating": 4.0, "review": "Only problem is that there is no ChromeCast sign on some videos when I use my Google browser on my phone (does anybody knows a good app to send any video to ChromeCast?). Also I need to use some other apps to send my own files to the TV and those apps are super slow. If anybody know a good app to watch your own files, let me know please!", "verified": true, "helpfulness": "0/0", "author": "can ozkan"}, {"rating": 5.0, "review": "I purchased these before.  I love it.  Best TV dongle yet.  I bought this batch of them for xmas gifts - everyone was happy.", "verified": true, "helpfulness": "0/0", "author": "Shawn William Cummings \"Shawn C\""}, {"rating": 5.0, "review": "Useful!", "verified": true, "helpfulness": "0/0", "author": "anar novruzov"}, {"rating": 5.0, "review": "Easy to install and works seamlessly with my Sony HD television.", "verified": true, "helpfulness": "0/0", "author": "Sue Taylor"}, {"rating": 5.0, "review": "Very nice. I love it.", "verified": true, "helpfulness": "0/0", "author": "Timothy"}]