[{"rating": 4.0, "review": "Ordered my Chromecast on July 24th, while it was temporarily out of stock but before the Netflix promotion expired. Just received it this afternoon.For some background, I'm pretty used to setting up Rokus, Apple TVs, and HDMI/MHL cables for getting content off mobile devices and onto big screens. Generally, it's a bit of a pain; logging into services with a remote control is a chore, and getting the cables to actually display the full screen of a device onto a television is hit-and-miss.Setting up the Chromecast, on the other hand, was thirty seconds of downloading the Chromecast app onto my Galaxy Note 2, then maybe two minutes of actual configuration from the phone. Easiest setup I've ever seen for a streaming device like this. Within five minutes, I was already streaming Netflix and Youtube to my living room television.So far, Netflix has been fine. I'm on a pretty slow connection out here in rural Illinois (1.5Mbps down, ick), so the picture does get pretty pixelated, but that's purely because of my own Internet connection. Took it to a friend's apartment in-town and the picture quality is just as good as any other device in the house.Youtube's been a bit shakier, though, because of my connection. Whereas Netflix will adjust the picture quality, Youtube doesn't seem to do that when casting (I lose the option to turn off HD); therefore I get a lot of buffering. Once again, on a modern Internet connection, there wasn't any issues whatsoever.I haven't had a chance to try the Chrome tab casting yet or the local media playback, but I'll update this review when I do. I also didn't have my iPad or my Chromebook available, so there's some other things I'll add later.But, for now, it's great at the tasks it's expected to do, and I can only imagine that the third-party support is going to get even better.For Android and iOS users wanting to get Netflix and Youtube on the big screen in the easiest way possible, and you don't already have something that can do that this seamlessly (I hate smart TV interfaces), get a $35 Chromecast. And, if you need that extra functionality, I highly recommend waiting. They've built it; now, the support will come.", "verified": true, "helpfulness": "4/5", "author": "Tim Tahtinen"}, {"rating": 5.0, "review": "I actually have 3 of these (I couldn't wait) I ordered one form Google first, then I ordered one from Amazon and finally the anticipation got to me and I picked one up at best buy so I could immediately try it out (I don't have cable so all my tv is viewed online)Got the one home from best buy; here has been my experience1.)  Netflix and youtube work FLAWLESSLY in high definition and perfectly synced audio, at least for me not matter what device or computer I used.2.)  All of my (previously) current laptops from the most powerful (don't make fun I'm not a gamer) Samsung with a B950 Intel Processor to my lesser internet only pc's had problems with either audio or video quality when casting a tab.  The B950 could cast a tab if I turned the quality down to the lowest.  However some sites would still not work.3.)  Today I picked up a Samsung laptop with and 2.4ghz i3 open box from bestbuy for $214.00 HOLYCOW  I now can stream with perfect audio and in the highest resolution supported for casting a tab while I write this review in another!  It's AMAZING :)  That being said if you have the requirements they want you WON'T be disappointed, this is a night and day difference!  And I realize I had to spend the extra money on the higher performance laptop, but I will sell one of the older ones and recoup at least 1/2 my money, get to enjoy a faster laptop, and still be ahead over having cable with their none stop commercials and outrageous monthly fees :)", "verified": true, "helpfulness": "1/2", "author": "Seth"}, {"rating": 2.0, "review": "Ads do not tell you that unit is incompatible with some hdmi televisions. Find out if your tv is compatible before you waste your time or money.", "verified": true, "helpfulness": "4/13", "author": "Scottie"}, {"rating": 5.0, "review": "I have a bad ass 5.1 theater setup with xbox 360 and ps3 all networked.  I currently use apps on those devices for my media streaming but I was curious.  Chromecast is a great addition to the family.  I received the device earlier today, setup was a breeze.  I've been casting youtube videos from my IPhone 5 all day with no issues.  The first video you should fire up is Tomorrowland 2011.  This device will be perfect when Google adds casting ability to the browser on the IPhone.  Then I will never leave the house.", "verified": true, "helpfulness": "3/4", "author": "D. Tran \"mma fiend\""}, {"rating": 4.0, "review": "Well $35 - ~$28 = $7 with netflix subscription. Amazing price for Youtube and netflix streaming. Chrome Tab Casting is good but it is letterboxed which makes for a sub-optimal experience.But well worth the money and as more apps come online, it will be very useful.I recommend it.", "verified": true, "helpfulness": "1/1", "author": "Nalin Singal"}, {"rating": 3.0, "review": "The Chromecast will not turn my TV on, that is very minor thing.The problem is the Chromecast is now it is so limited in what it can do, basically watch Netflix and You Tube and get into The Google play (music and movies) on a pay basis. Yes, you can watch it on your TV without a wired adapter and this is nice. My Roku XS  Console can get 10X more internet contents plus Netflix and You Tube also (I paid $59 for this at Costco) yes with the Roku player I must use their included remote. Google needs to get a hundred good solid company's to make players that work with Chromecast to make it a must have product. If this happens buy Chromcast if not this prouduct will die on the vine. Wait Wait Wait before you buy.", "verified": true, "helpfulness": "0/1", "author": "John L. Kelly \"John L Kelly\""}, {"rating": 5.0, "review": "Received my order of (3) today. Plugged one into my TV and 5 minutes later I was watching Netflix. Wondered if I could plug it into one of my soundbar's HDMI inputs. VOILA!, works like a champ. I haven't yet figured out all of this great little gizmo's capabilities, but if my first 5 minutes with it is any indicator, I'm looking forward to a really good time exploring all it's features. BRAVO, Google... you've got a real game-changer here!UPDATE:From Google Chrome, go to your Amazon account, go to Your Prime, select your movie, click the Cast tab in the browser, and there you are. Amazon Prime on Chromecast!", "verified": true, "helpfulness": "1/2", "author": "CT Krouse"}, {"rating": 4.0, "review": "Well, I ordered the Chromecast the day I read the announcement about it, and it arrived a day after the gift code for 3 months of Netflix (which I didn't know about when I placed the order, but it was a good marketing idea and, if I wasn't already seeking a way to link TV & my new One piece Windows 8 computer [which lacks an HDMI port], would have sold me).It literally took five minutes to get up and running (only because I didn't push it far enough into the HDMI socket, LOL).I tried it with HULU from the Chrome browser on my PC.  Those who use HULU know it can be spotty over wireless connections, so some problems were expected.  What I didn't expect was a one second or more delay between browser and TV images -- not that you'd normally be watching both.  It is nice to be able to watch \"web only\" programs on the TV -- but you cannot \"full screen\" and still use the computer.  It would be nice if, somehow, the transmission source could be \"second screened\", maybe it can ... I'll need to experiment.The real annoyance  is that the Chromecast doesn't work with a KINDLE HD as the source.  The app download says no device, so refuses to download the app to the KINDLE HD.For those interested in hardware, the Chromecast comes with USB power wire to connect to computer, plus they provide a plug in adapter for direct from outlet (which is better -- with Kindle the plugin is an extra, here it's just provided); they also provide a HDMI extender/adapter -- so fishing for the HDMI slot on the TV is a one time effort and you can shift from Chromecast to HDMI cable (as with my ROKU box) without being annoyed and fumbling around.  Thus, both of these show the designers were really thoughtful and the company marketers made it a nice touch ... now if it would only work with a KINDLE HD...", "verified": true, "helpfulness": "0/1", "author": "William L. Lipton Jr. \"Bill Lipton\""}, {"rating": 3.0, "review": "See edit at bottom regarding update.Just got it yesterday and couldn't wait to try it out.I have an Insight TV with a MHL and a standard HDMI port. I tried it in the MHL port first since I had heard it might be able to draw power from it but it did not power up. I then plugged it into a 3 to 1 HDMI cable I use Portta PET0301S 3x1 HDMI Switcher Support 3D to plug in my PC, Kindle HD, and Raspberry Pi hackboard. Plugged the USB cable that came with the Chromecast into a powered USB hub Belkin USB 2.0 4-Port Ultra-Mini Hub I use with the Raspberry Pi, I'm a little gadget happy, the player fired up and the 3 to 1 automatically switched to it. The TV did not power on by itself, but when I turned it on and switched to that HDMI port it soon was displaying the startup screen.After that, setup was a breeze.Tried it with two computers, the computers, the TV with Chromecast, and the Wifi router were in the same room.First I tried with an older Win 7 laptop with a two core CPU and 4 GB ram. Hulu worked great, with none of the problems of catching up that I have read about in some reviews. It does run about half a second behind the pc, but I was able to leave it running while trying out doing other things on the PC and it worked with no problems. I could view it full screen and alt tab to a different window.Netflix works fine, and now that I can set up different profiles for different family members it is even better.Viewing Amazon videos did not work, which I had heard was the case, I understand it has to do with the Silverlight plug-in Chrome uses on Windows, imagine someone will come up with a workaround soon.Second I tried it on a netbook with an Atom CPU and 1 GB ram. Hulu was horrible. The image on the TV stayed static for seconds at a time and the sound was constantly cutting out. Netflix did not due any better. I think the Chrome browser is overwhelming the machine.Last I tried my Kindle. I was able to download a Chrome apk and get it running, but when I tried to install the Chromecast extension I was told that my device was not supported. I could not find anything in the App store that would work either.Worked great with my PC though and it is early days, I'll bet that there is a Kindle app in the works and a way will be found to cast Amazon videos from Windows. For $35 how can you go wrong!And if anybody at Amazon is listening, WE NEED A KINDLE COMCAST APP!!!EDIT:When I wrote the previous, I was the only one home. Another family member came home later and fired up their laptop. The sound from the Hulu show I was watching started lagging, sometimes really badly. A quick pause would bring it back into sync, but after a little bit I gave up and plugged a HDMI cable directly into laptop. Our router is getting on in years, a more updated one might handle the increased traffic better. Am thinking of trying the laptop on a network cable, but that will be a pain.", "verified": false, "helpfulness": "1/2", "author": "Tony Barban"}, {"rating": 5.0, "review": "I have been using the Chromecast since two days after it came out, and I have to say that it not only has enormous potential, but is already a more than functional device.A little about this way I watch TV- I have been \"untethered\" for more than a year, using only Hulu, Netflix and occasional purchases from Amazon and Itunes to fuel my tv habit, and I don't intend to look back. I have had a lot of interaction with Apple TV, and I am a pretty high-level user. More importantly, I use my computers as an educational tool, to project the internet and presentations in front of my classroom. In my opinion, the Chromecast delivers a nearly equal (if not better) experience than the Apple TV, and for a third of the price.Many have said that the Chromecast (and particularly its Beta features) do not work well without good internet. I couldn't say. I can say, however, that with decent internet, there are none of the issues that I've had with other streaming devices, such as pauses to buffer, or mismatched sound. (My current internet is not the best, which I know well from having Verizon Fios and lightning speeds for the last two years, but it more than sufficient for day to day netflix and rarely has hiccups.) This is not only for direct Netflix or Youtube streaming, but also for mirroring of Chrome webpages, and even videos.Some features haven't been loudly advertised, but should be.Features of the device, in order of facility:1) Direct Netflix, Youtube and Google Play streaming.  The way this works is that you use your computer or phone as a sort of remote control. I've only tested it with Mac products (Laptop, iPhone and iPad), and they have all worked beautifully. The best thing about this is you device doesn't have to be on for anything but pressing play! No lost battery power or tied up devices, which puts it at the same level as AppleTV for streaming, and with Google's more open developer philosophy, we should be seeing many more streaming services adapt their apps for this feature soon. It goes beyond the Apple TV, Wii and other devices in that it works through native apps and devices with keyboards, making the selection of a movie or TV show a far less annoying process.2) Chrome(browser) Casting.  When in Chrome you are able to press a button on the top right hand part of your screen and reflect anything in Chrome to your tv. Again, this for me was without hiccups or lags, despite many reviews claiming that this process is slow and jumpy, I have found it quite the opposite. The downside of this is that your device must be on to stream its content to the TV, and that there is not yet support for this for iPhones and iPads (it worked great on my Mac laptop), but I'm sure it will come soon, and this is no different again to mirroring or streaming content through an Apple TV. The upside is that Chrome supports the streaming of movies from all (as far as I can tell) the major streaming sites, and so you can project Hulu and the like with no trouble by pulling it up in your browser. The cherry on the cake (or, actually the meat in the pie) is that Chrome also supports the playing of all sorts of media, including MP3 and MP4, which means that by (on a Mac), selecting \"open with\" and choosing Chrome (you need to specify that you want more than just supported applications available to open with on newer macs), you can stream all files except for AVI to your TV as well, with perfect picture and perfect sound, at least on my connection. There is an issue with Quicktime only streaming video but not sound that I have not yet seen worked out.3) Computer Casting  This is the feature everyone is claiming that the Chromecast doesn't have- but it does! It is in a highly experimental mode, but I have had no troubles, freezes or hiccups trying it. When you go to the ChromeCasting menu in the Chrome browser, there is a small, grey, barely visible arrow in the top right hand corner of the menu. Click on that and you have the option to mirror your whole screen, not just a Chrome tab. Fair warning, this projects only image and not sound, unlike casting a browser window, but as a teacher this will prove the most valuable thing about the device. Being able to project your computer to a classroom screen is one of the reasons Apple TV has been so successful in educational purchases, but now a device has arrived with the same functionality- the same ability to project a power point presentation or a website to your students- at a third of the cost! The feature may be in beta testing now, but it is available, and I imagine it will only get better and more stable. I was not able to convince my administration to shell out $100 per classroom for an Apple TV, but I am sure they will have no problem with a $35 device that does the same. It costs less than a Mac to VGA cord for a wired projection interface.I want to get the word out that these features are there, because I think Google has been selling itself short. If you have been on the fence about getting a streaming device for your TV, I think Google has just come up with a major contender.", "verified": false, "helpfulness": "8/13", "author": "Z Hava"}]