[{"rating": 4.0, "review": "I have owned this for almost two years. It worked fine for most of the time. But lately it's video casting has been progressively getting unwatchably choppy. Meaning that it's gotten so bad that I cannot actually watch the video without getting too frustrated. I tried restarting both my computer and the Chromecast stick (including unplugging it for a while), but it didn't seem to help.  I know that high data usage on our internet line was not a factor because there was no one else on the network except me. So I'm thinking that the Chromecast unit is getting old. Another problem may have been that I bought this Chromecast about a month or two before it was originally \"available\" for shipping. So it may be that I got one of the early units that maybe didn't have all the bugs worked out of it yet.", "verified": true, "helpfulness": "0/0", "author": "David Otazu"}, {"rating": 5.0, "review": "The Best I sorry I waited so long to get one", "verified": true, "helpfulness": "0/0", "author": "michael leonard"}, {"rating": 5.0, "review": "Nothing to say that hasn't been said.  Buy it.", "verified": true, "helpfulness": "0/0", "author": "caleb"}, {"rating": 5.0, "review": "Amazing technology. Great buy for anyone with an HDMI port.", "verified": true, "helpfulness": "0/0", "author": "richard"}, {"rating": 3.0, "review": "it's useless without a smartphone. the Roku streaming stick is much better and has a remote.", "verified": false, "helpfulness": "0/0", "author": "Big D"}, {"rating": 5.0, "review": "I own 4, enough said.", "verified": true, "helpfulness": "0/0", "author": "Travis \"TH\""}, {"rating": 5.0, "review": "I ready like this chrome cast it worked right away. I would buy it again.", "verified": true, "helpfulness": "0/0", "author": "Windy G. Snow"}, {"rating": 4.0, "review": "Sometimes it was not clear", "verified": true, "helpfulness": "0/0", "author": "Lauretta"}, {"rating": 3.0, "review": "I find that there is missing option", "verified": true, "helpfulness": "0/0", "author": "zaki"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Nancy Garrison"}]