[{"rating": 4.0, "review": "Prior to having my Google Chromecast I was using a very long HDMI cable (I am living in an apartment so I do believe it's either 25 or 30 feet long). Transporting my laptop is a pain (as the battery doesn't last very long), so it always stays on my desk in my office. The HDMI cable worked, but it meant I had a wire running out of my office and across my living room to the TV. I had to be very careful not to trip on it. With the Chromecast I can play from my laptop OR my iPad.The only problem for me is that you are limited to what you can watch/see via Chromecast. With my HDMI cable I could make my TV pretty much a bigger monitor and do whatever I would typically do on the computer on it (my mouse and keyboard are wireless and will work from my living room). I really wish I could do that with the Chromecast, especially for playing music (without having to put on YouTube videos).", "verified": true, "helpfulness": "0/0", "author": "Jo T."}, {"rating": 5.0, "review": "Fast set up, works wonderful, no issues, it's perfect.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works perfectly!!! Love it already! GreT investment and much better than an Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Amanda Vasquez"}, {"rating": 5.0, "review": "Incredible value for $35.  Using it at a vacation home where we wanted to avoid paying another massive fee to Comcast for cable channels.  ESPN, HBO and Netflix (and other Chromecast compatible networks) are all effortlessly streamed on the big screen TV using our cellphones as remote controls.  Love it!You will need a decent wireless internet signal to make it work.", "verified": true, "helpfulness": "0/0", "author": "Douglas L. Shafer"}, {"rating": 5.0, "review": "love this Chromecast. We can get Hulu Netflix YouTube and a few other great apps broadcast to out HDMI TV. It can be sent from laptop iPad and Computer and you can travel with it if the hotel has an HDMI output. Highly recommend and a great price too.", "verified": true, "helpfulness": "0/0", "author": "Robert J Johnson"}, {"rating": 1.0, "review": "Doesn't say it only works with 2.4 GHz Band Network and not 5Ghz. routers and modems.  Just threw $35 out the window.  What happened to truth in advertising?", "verified": true, "helpfulness": "0/0", "author": "Ron Zeglin"}, {"rating": 5.0, "review": "It worked great.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Tereza Clark"}, {"rating": 5.0, "review": "Awesome I love it thank you so much", "verified": true, "helpfulness": "0/0", "author": "ahmed"}, {"rating": 2.0, "review": "Unit needs to cast content direct from a device vs. only through an Internet connection.", "verified": true, "helpfulness": "0/0", "author": "AZmike"}, {"rating": 5.0, "review": "Nice.", "verified": true, "helpfulness": "0/0", "author": "Janewit Kraprayoon"}]