[{"rating": 5.0, "review": "Works right out of the box.  Using it in Singapore with VPN to watch uncensored movies on YouTube and NetFlix.", "verified": true, "helpfulness": "0/0", "author": "Diederik Zwager"}, {"rating": 4.0, "review": "This works great. Easy setup and start playing movies. I use it of Netflix and You Tube.  Wish it worked with amazon instant movies.", "verified": true, "helpfulness": "0/0", "author": "racuatt"}, {"rating": 1.0, "review": "Highly unreliable and cheap (in price and quality). Half the time I can't even get on the network. When I do it stalls and heats up like a pan. And did I mention you can't do anything with it except netflix, YouTube, and the useless browser plugin", "verified": true, "helpfulness": "1/4", "author": "Moki"}, {"rating": 4.0, "review": "This is a great little device. Cheap as. In Australia, you cannot get the Chromecast app or the Hulu/Netflix apps. You have to scour the web, find the apk's and then side load them. Once you overcome this inconvenience, it is not that bad, but still a little limited. If Google can get cracking on (a) dealing with the geoblocking rubbish and (b) making more apps Chromecast compatible, this could really give Apple TV and other streaming devices a run for their money!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Update, 12.20.2013:With additional content partners launched and improvements to the tab casting experience, I now wholeheartedly give Chromecast a 5 star rating, up from the 4 stars at launch.------------------------------------Original Review.This is a brilliant concept and execution- mostly- with a few rough edges and limited content options.Setup will be easy for anyone using a laptop or system with built-in wifi card. Don't try to use a desktop you've connected by ethernet that doesn't have a wireless connection- you'll get an unhelpful message about VPN, although calling google support was a better support experience than anticipated.As a internet streaming device, it is probably the best option on the market for adding \"smart tv\" functions for web streaming to the millions of early HDTV's that didn't have this feature.  Due to the clever integration with Netflix and YouTube across Android, iOS, and any browser, using Chromecast is very convenient.  Lost the remote? Just grab your next internet connected device- VERY nice.People who have an xbox and can use that for streaming- IF they pay for xbox gold- Chromecast can be an attractive option VS.  paying for gold. People who have netflix and or youtube access via blu-ray or other interfaces may be won over by the ability to use basically any internet enabled device as a remote- and i'm thinking this is a clever way to facilitate second screen experiences as well.It'll be interesting to see if Chromecast gets other content providers like Hulu, Amazon Prime, etc. to start delivering their content this way- that's probably the biggest reason NOT to buy a chromecast- in terms of video, don't count on playing it unless it's on yotube or netflix.the tab casting experience nearly gets the product dropped to 3 stars for me, as it is atrocious- but google did a really great job with the two content providers they support, so overall it's a 4.  even on a gigabit wired network with a high-end access point less than 10 feet from the Chromecast, the video streaming performance was pathetic.  i've been an IT pro for over 5 years, and this really was one of the least impressive features i've seen go live- music and photo tab casting worked when I browse to local files in chrome, but videos were awful even after dropping quality to the lowest settings.It's frustrating the feature I was most interested in- \"tab casting\" my own content was basically unusable- so I really hope google puts in the work to improve this feature- although to be fair when streaming internet content chrome cast really shines.", "verified": true, "helpfulness": "0/0", "author": "J. Everett"}, {"rating": 5.0, "review": "Great if you want to turn you dumb tv into a \"basic\" smart tv.  Google is adding functionality all the time! Excited to see additional functionality for such an inexpensive device!", "verified": true, "helpfulness": "0/0", "author": "Jason Consoer"}, {"rating": 5.0, "review": "i love this thing! i wish i could stream sites from my phone onto the screen, but besides that all the features it supports work with out  a hitch! do need wifi though so keep that in mind if you got a wired internet set up.", "verified": true, "helpfulness": "0/0", "author": "Cory i."}, {"rating": 5.0, "review": "Set up was a bit of trial and error, but my son managed it after a few attempts. The install help is very rudimentary, it would be useful to make it a bit specific. I actually have it plugged into my receiver and now the sound system fully enabled too. I recommend Chromecast. I would like to see a lot more apps becoming available in the near future.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Outstanding product I would have rated the device higher if apps capability increases Keep chopping wood Google what a awesome device", "verified": true, "helpfulness": "0/0", "author": "DIXK1"}, {"rating": 1.0, "review": "Not enough services available at this time. Thought it would show all on computer to tv. Good price but did meet my needs at this time.", "verified": true, "helpfulness": "1/2", "author": "Dana P Quinn"}]