[{"rating": 5.0, "review": "no more cable!!!  this is great!!", "verified": true, "helpfulness": "0/0", "author": "Joseph J."}, {"rating": 4.0, "review": "Very good product", "verified": true, "helpfulness": "0/0", "author": "Girish"}, {"rating": 5.0, "review": "Easy to use, and I can switch it to another TV without reprogramming it.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 5.0, "review": "Look, it's Google. So if there is a way to make this easier or foolproof, Google will do it. Just plug the thing on your TV (remember to buy a usb power cable if your tv is as old as mine), download the app for your phone and turn your tv on. Google will guide you through a 3 step setup to pair your chromecast with your phone and then connect it with your wifi. That's it. Really.You'll spend more time figuring what to do with it other than netflix than with all the setup and installation process.PS: hope you have a strong internet connection cos this little thing will suck your connection dry. If you live in a third world country like me, forget about casting a movie and doing some skype at the same time. You'll have to choose cos your connection will drop on some of them.", "verified": true, "helpfulness": "0/0", "author": "Francisco M."}, {"rating": 5.0, "review": "AWESOME LOVE THIS THING", "verified": true, "helpfulness": "0/0", "author": "Ernesto Villanueva"}, {"rating": 5.0, "review": "Very good how much recommend this article, the shipping was very fast", "verified": true, "helpfulness": "0/0", "author": "Jorge P."}, {"rating": 1.0, "review": "They fail to tell you that it will not work with several common routers", "verified": true, "helpfulness": "0/0", "author": "Joe Ramirez"}, {"rating": 4.0, "review": "Good one", "verified": true, "helpfulness": "0/0", "author": "Arunkumar Krishnan"}, {"rating": 5.0, "review": "Works great. Very useful with the added luxury of it being portable.", "verified": true, "helpfulness": "0/0", "author": "Marla Chupack \"Gadget Princess\""}, {"rating": 5.0, "review": "Don't pay extra for a Smart TV, get one of these instead.  Easy set up. Good if you travel.", "verified": true, "helpfulness": "0/0", "author": "JQ"}]