[{"rating": 2.0, "review": "Amazon did its job well as always. But Google Customer Service, who is responsible for warranty cases, did not.The device ran wonderfully until Dec 6th, then i could not get any HDMI signal out of it. Even worse no other device connected to my tv through HDMI worked, until i pulled out the Chromecast. Then all the other sources worked again.Called Google Service went through all the typical procedures, the representative finally decided the Chromecast needed to be replaced. From here it went bad. They send me messages about how to setup the device and a represantative will contact you in 24 to 48 hours, but nothing to solve my problem, which is replacing the device.I really liked my Chromecast up to then, but now i am waiting and waiting.....", "verified": true, "helpfulness": "5/5", "author": "Karsten Schmietz"}, {"rating": 5.0, "review": "We purchased this because we wanted to watch Hulu from our ipad to the tv. It works great and we recommend using the extension that comes with it.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "bought two.  1 for home and one for travel.  More apps have recently deployed with chromecast capabilities too.  I use travel one at g/f house to stream my hbo and Netflix shows.  I'll periodically have YouTube channel playlist playing through it on my home TV.", "verified": true, "helpfulness": "0/0", "author": "J. Lopez"}, {"rating": 2.0, "review": "When I first bought this five months ago, both YouTube and Netflix worked fine, but after just a week or so, Netflix stopped working and has not worked since. I reported the problem to Chromecast technical support, and they replied back promptly that they were aware of the problem and were working to fix it, but that has been a few months ago and still no progress. I start Netflix on a Samsung Galaxy Tab 2 10.1 running Android 4.2.2 and the Chromecast is plugged into a 2012 LG LM6200 HDTV. Luckily, we have two other devices that stream Netflix on our TV, so we don't really need the Chromecast to do that, but still it should do what it promised to do. Also, what I really want Chromecast to do is cast a video running in the Chrome browser on my Android tablet, like it does on some laptops (although it doesn't quite do it on my current laptop, which is 8 years old and still runs Windows XP).UPDATE 1/14/2014: Netflix finally started working again after about five months of not working at all. Now it works perfectly once again. I suppose now Chromecast rates five stars.", "verified": true, "helpfulness": "0/0", "author": "Scott T. Hutchinson"}, {"rating": 5.0, "review": "My tablet is a Nook and I wanted to be able to \"cast\" it onto my kitchen television to watch while I preparing meals. The Chromecast has been very compatible and has made it possible to view shows on a larger screen and increase the volume during meal preparations.", "verified": true, "helpfulness": "0/0", "author": "Shelia Williams"}, {"rating": 3.0, "review": "I like it but what i dont like about it is that its limited to 2 apps youtube or netflix. .", "verified": true, "helpfulness": "0/1", "author": "Juan Carlos"}, {"rating": 2.0, "review": "I bought chromecast for browsing on TV through the chrome browser (on windows 8 laptop) and to mirror pc screen on tv, two things that I still cannot do through my DLNA devices using my PCs and smart tv through wifi. Chromecast is a disappointment for both. There is a lag while I browse and sometimes it even stops working when the website contains videos on it. Same happens with mirroring. Youtube works very well but I didn't need chromecast for that as my smart tv has the youtube app and it works fine. My internet is broadband but not the fastest and that could be a reason, since it does not completely work through your wifi network as far as I understand. So compared with the smart tv's apps chromecast does not work that well since my smart tv's and blue ray's wifi and apps work fine with my actual internet speed. My wifi router is a high end one and so is the laptop I tested casting (last gen i7 processor, 8 gigs RAM, SSD) so the problem is not in my devices. Chromecast's price earns the two stars I have given it, the only reason I still have it and did not return. I want to wait and see if there will be any improvements or any additional Windows apps for it in the future.", "verified": true, "helpfulness": "0/0", "author": "Enzo"}, {"rating": 4.0, "review": "It works well for internet on your TV, but I don't think I can put other PC activity, say playing a DVD on the PC, on the TV. SO you still need the HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "works well easy to set up, just does not work with IP blockers/shields. Also requires AC or USB power source which is not advertised.", "verified": true, "helpfulness": "0/0", "author": "jrav"}, {"rating": 4.0, "review": "Awesome device for $35. Streaming has never been easier for me. We have multiple TVs that are not connected to the internet - until you plug this guy into the HDMI port. Currently there are only a few services available; Netflix, Youtube, and HBO, but it solves the connectivity problem well. I only use Netflix and Youtube but they work amazingly well. My internet service is 17Mb down and 2.5Mb up, which seems good enough to drive this little guy. I mostly use it with an IPad but I tested it with the IPhone and it works great.The only downside is that the sound gets out of sync with the video occasionally. This problem has come up about 5% of the usage time. I would have given it 5 stars had this problem not been present.", "verified": true, "helpfulness": "0/0", "author": "Jeff \"Technology Guy\""}]