[{"rating": 5.0, "review": "Works as a charm. My children are able to watch their shows on a big screen and I can stream mines.", "verified": true, "helpfulness": "0/0", "author": "Vanessa Lopez"}, {"rating": 3.0, "review": "Streaming can be sometimeish. When it works well, it works very well!", "verified": true, "helpfulness": "0/0", "author": "vetondenet"}, {"rating": 5.0, "review": "Very convenient, very affordable, great product.", "verified": true, "helpfulness": "0/0", "author": "Richard cabrera"}, {"rating": 5.0, "review": "fantastic little device", "verified": true, "helpfulness": "0/0", "author": "roijk"}, {"rating": 2.0, "review": "Wish I had done some research before I picked this up at a local store.  There are massive limitations and it forces you to use the Chrome browser from your laptop in order to use this.  I do not like Chrome and prefer Firefox (for now).The product specifications are, as such, not truthful.  The packaging does not specify that you need to use the Chrome browser.  It only states that it supports Windows.  If it supports windows, then why do I need to install Chrome?  A truthful spec would say it supports Chrome browsers on these platforms (e.g. Windows, iOS).  Went looking for a way to submit this review direct to Google, but somehow they seem to not have a product feedback page.I feel I've been mislead and will not purchase another piece of Google hardware without first deeply researching this.  All the other limitations of this product make it unusable for me which is a shame.", "verified": false, "helpfulness": "0/1", "author": "S. White"}, {"rating": 5.0, "review": "Work's great", "verified": true, "helpfulness": "0/0", "author": "alease brown"}, {"rating": 1.0, "review": "Could never get it to sync with my iPhone or iPad. sent it back. Chances are you will, too.", "verified": true, "helpfulness": "0/2", "author": "C. Allman"}, {"rating": 2.0, "review": "disapointed, no workee w chrome browser... wish i knew before purchase....wtfo?", "verified": true, "helpfulness": "0/3", "author": "G.A. Bishop"}, {"rating": 5.0, "review": "Very cool gadget, easy to use and install. I've used it with a Samsung tab and Samsung Galaxy s2 streaming videos from Netflix and YouTube. Cool for someone that doesn't have those apps in other devices", "verified": true, "helpfulness": "0/0", "author": "Pierre Astudillo"}, {"rating": 5.0, "review": "Great Product, thank you.", "verified": true, "helpfulness": "0/0", "author": "Peter F. \"DMB Fan\""}]