[{"rating": 5.0, "review": "Small square box incredible ease of use features. The remote controller with microphone is well designed. The optional game controller is a must have if you plan to enjoy games. Easy to side load android apps.", "verified": true, "helpfulness": "0/0", "author": "Rohiers2"}, {"rating": 5.0, "review": "I just received my Amazon Fire TV and I have to say it works very well.  The picture quality on my Samsung TV is excellent.  It was also extremely easy to set up.  The only issue I have with it is the position of the home button on the remote.  When  I watch a movie and have to pause it, I some how keep on hitting the home button.  I just wish this button was placed in a different position on the remote.  This is just a very minor issue.  I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Charlie The Pug"}, {"rating": 5.0, "review": "What really WOWed me about this was it's capabilities in such a small form-factor. I didn't read the dimensions ahead of time so expected it to be the size of a Roku or router. I was very surprised to see that it's really small - a lot smaller than any of the devices that it competes with (gaming consoles, DVD players, streaming machines). It also has a sleek and simple design that I like a lot.Things downloaded and loaded at decent speeds despite my poor internet connection. It was pretty easily navigable and the voice search is quite good. It recognized what I was saying every time but once (and I suspect that time it was only searching in the current application instead of system-wide). The games may not be PS4 or xbox1 quality, but they are surprisingly good and you can have a lot of fun on them. I am enjoying Sev Zero so far, and since it's their pilot game, I'm sure they will just get better from  here. At this price, it's a pretty incredible value. I stopped playing video games a few years ago but have been considering starting again - I kept putting it off because I didn't want to spend $500 on a console just to end up being too busy to play much. The $99 price tag made the Amazon Fire TV a pretty low-commitment way to get back into gaming so it was a kind of obvious choice.Pros: Insanely good price. Performs multiple services (games, music, movies/tv). Small, sleek design. Easy to setup, use, and navigate.Cons: I want to watch Hulu on it, but only seems to have HuluPlus. It seems to be mostly built to bring you Amazon Prime content easily, and since I'm not a Prime user, this is somewhat annoying.Overall, I would say it is definitely worth $99.", "verified": true, "helpfulness": "0/0", "author": "JM"}, {"rating": 5.0, "review": "I have Apple and Google TV.Fire is the next level.If you want to break away from cable, gotta try Fire.Even my wife loves it.", "verified": true, "helpfulness": "0/0", "author": "Dan Clemson"}, {"rating": 5.0, "review": "Amazon Fire TV is an incredibly useful product, IF you use other Amazon family products like a Kindle Fire and Amazon Prime Videos.The product comes loaded with your Amazon profile. If you are an Amazon Prime member, this is very nice because you can begin watching your shows right away, no additional setup needed. The product functions much like Apple TV and a Roku player. The added voice search makes it a step above. The browsing is very quick with short load times. It is evident that the hardware is well made. The ability to stream movies with Dolby Digital encoding is also very nice.If you like the option of playing some games, the controller would probably be a worthwhile investment, but, as a game console owner, it seems a like an additional investment that would be better spent on my existing system. This is something that you should judge for yourself as you decide if you want to invest money into Amazon Fire games.The interplay of the Kindle Fire tablet and the Kindle Fire TV is also pretty cool with the ability to take the show from the tablet to the big screen.All in all, if I were in the market for a streaming media player, I would buy the one that matched the devices that I ALREADY own. If you have iPhones and Macbooks, I would buy an Apple TV. If you have Chromebooks, love Chrome, and want to save money, a Chromecast would be good. If you like nifty niche products, the Roku might be for you. If you are a console gamer, the PS 4 or Xbox One should be good enough for you. Lastly, if you are a fan of all things Amazon then Amazon Fire TV might be for you.****Update****After three weeks of using the Amazon Fire TV, I am SOLD on it. The voice search is very helpful, but the part that makes it best is the SPEED. Amazon videos take very little time to load. It is easy to fast forward and rewind. I have been so surprised by the ease of use and think this is much better than the PS 4 that I was using.Additionally, the streaming quality of the World Cup matches through the \"Watch ESPN\" app was amazing. The picture quality was stellar. The quality was easily 720p if not the full 1080. I also love that the Dolby Digital plus 5.1 sound option is available. Sound, picture, and speed is terrific and makes this device worth purchasing. As I mentioned earlier, if you won other Amazon products, this is a no-brainer. However, even if you don't own other Amazon products, this is still an amazing streaming device worth the $99. Enjoy it!", "verified": true, "helpfulness": "1/2", "author": "Bristable"}, {"rating": 5.0, "review": "Love it...so easy to use...just wish it came with the cables (HDMI and Audio Optical), but love it anyway...Apple TV, eat ur heart out!", "verified": true, "helpfulness": "0/0", "author": "Rissa Castro"}, {"rating": 5.0, "review": "I'm an Amazon Prime member and this is Perfect for me. I had a Roku previously that was acting up, I replaced it with Fire TV. This is a very solid unit and compact. It is very fast to respond and I haven't any issues with lag or reloads. I am glad I got it...", "verified": true, "helpfulness": "0/0", "author": "Dunamis"}, {"rating": 5.0, "review": "It is truly as easy to set us as Amazon advertises. I unpacked it, but the supplied batteries in the controller, plugged the HDMI cable into my tv and the Fire TV box, and plugged the power to the Fire TV in. Bingo I had service. My Amazon Prime account was immediately active as advertised.The time to download a movie was less than a 1/3 of the time it takes my Roku XS, and it plays the movies without ever having to stop and buffer. The quality of the image on both Amazon Prime and Netflix is amazing, much better than via my Roku XS box.The controller is a radio and doesn't need line-of-sight to have commands recognized and executed by the Fire TV box.Once Amazon Cloud Player for my music is added to the Fire TV I will be in hog heaven.", "verified": true, "helpfulness": "0/0", "author": "Bruce E"}, {"rating": 5.0, "review": "I bought an Amazon Fire TV and we love it! Talk about ease of use!! The set of was simple and I just go into my Prime and select programs, movies etc that we would like to watch and put them on our watch list, just so simple and the voice command is great!", "verified": true, "helpfulness": "0/0", "author": "Diva \"Diva\""}, {"rating": 4.0, "review": "I received my fire TV a couple weeks ago. Overall oI am happy with it however I have had a fee times that it takes a ridiculous amount of time buffering and had a hard time loading Netflix. I thought it was my internet connection so I tried my ps3 and had no problem.  I look forward to more apps and features in the future.", "verified": true, "helpfulness": "1/1", "author": "Brian Miller"}]