[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "lou barrios"}, {"rating": 5.0, "review": "Cant say anymore. Fire TV is great.", "verified": true, "helpfulness": "0/0", "author": "David Trotman"}, {"rating": 3.0, "review": "The voice request only works on the amazon paid subscription. The search option is a little hard to work with and does not allow continuous browsing for different movies. Same old movies on Netflix unless you do a lot of searching.", "verified": true, "helpfulness": "0/0", "author": "Michael Booth"}, {"rating": 5.0, "review": "Liked it so much I bought the stick for the bedroom. I also decided to order the game remote...", "verified": true, "helpfulness": "0/0", "author": "David M."}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "billy snow"}, {"rating": 1.0, "review": "Can't get it to work with my Samsung Smart TV.", "verified": true, "helpfulness": "2/3", "author": "Philip Harrison"}, {"rating": 5.0, "review": "As a prime subscriber .. this has been a great product.I move it to different televisions easy depending on where I want to watch or listen.I am impressed with how well it handles streaming and buffering of movies using the wireless... I have had no disruptions.The Menu is easy to move through.. the only problem is there are so many choices.", "verified": true, "helpfulness": "0/0", "author": "K. Bard \"Ken\""}, {"rating": 1.0, "review": "The unit keeps restarting and reloading every time I start watching anything its a defective unit I have tried all troubleshooting thoughts ,don't want to hassle with return if Amazon cares about me as customer they will send a replacement ASAP", "verified": true, "helpfulness": "1/3", "author": "midway motors inc"}, {"rating": 4.0, "review": "This has some really good features and some not so good featuresGood:+Boots fast+Nice remote+Low power draw+Supports many streaming services+Voice search is cool and works wellNot so good:-No Yahoo Screen support-Unit powers down when the TV is off.  I was kinda hoping to stream music through my audio system with the TV off but when the TV shuts down the Fire TV does as well.-UI is really biased towards Amazon services.  For example voice search only works on Amazon.All in all this is a really nice device but part of me wishes I had purchased a Roku 3 instead.  It might be a little bit better.", "verified": true, "helpfulness": "2/2", "author": "Nathan A. Vonada"}, {"rating": 5.0, "review": "If you are in the market for a streaming media player this is the one. The combination of this little unit and prime are awesome. Prime still has a little way to go still with content but can't really complain with the other benefits. Also added ability to children's games on it and music is a bonus too. Can't really go wrong.", "verified": true, "helpfulness": "0/0", "author": "TheMaxwell"}]