[{"rating": 5.0, "review": "Took about 5 minutes to set up, even with my 4 year old tv. Plugged it in, downloaded the app to my iPad and set it up using the app instructions. So far I've tried casting chrome tabs, netflix, hulu, and YouTube. All the video streaming was great... No lagging and nice crisp pictures. Videos actually seem to buffer better with the chrome cast than with our wii, which also streams hulu, etc. Casting chrome tabs is a little laggy, but it is in beta so hopefully it will get better. Image quality was great, though.Other things I like include the fact that streaming from my devices doesn't drain their battery (streaming as actually from the cloud) and the really beautiful screen saver that shows up on your tv when you aren't casting anything. Casting from the devices is also very intuitive (I've tried iPad, iPhone, and computer). All in all, I'm very pleased! If I had more than one tv I'd buy a chrome cast for every one.", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 5.0, "review": "It works great, but it seems to get hot and has to be unplugged to reset it.  Then it works fine.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Allows user to use Netflix and stream movies and shows - downside is that amazon prime does not stream with sound using google chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 2.0, "review": "works great for the price,but only two stars for the Very limited content that you can get.hopefully that will add some more", "verified": true, "helpfulness": "0/0", "author": "Randy Mayes"}, {"rating": 5.0, "review": "So the good is that netflix, hulu plus, and youtube work great on this.I can even send my desktop over fairly easy with the browser plugin.  With the plugin there is a little lag, but I have rarely found the audio and video to be out of sync.  The video on my tv is out of sync with my computer by quite a lot, but the audio and video comong through the tv are in sync I would say 95% of the time.  The other 5% are when I have paused video and try to resume after a long pause.  Considering that this feature is still in beta I can live with that.", "verified": true, "helpfulness": "0/0", "author": "JimInTheBox"}, {"rating": 4.0, "review": "I love this little guy.  He supports my YouTube obsession and allows me to cast whatever I want through the magic window from my Chrome browser.In all seriousness Chromecast is a great device with a couple bugs.  I look forward to seeing these work themselves out with software updates in the future.  Of course this device has \"streaming support\" built in; YouTube, PostTV, Netflixs, Hulu, etc... these recourses require you to initiate casting from another device as the Chromecast has no input capability besides from a host device (PC/Mac computer, android cellphone/tablet, iTouchPhonePad).  It may make the Chromecast sound like a dumb device... and it kind of is but... if you are casting, say, YouTube from your android, the cellphone/tablet is not processing the video hence saving battery, once the request is sent to the Chromecast you can turn the display of your android device off as the Chromecast itself is doing all the downloading, processing, and display through the stick.  Plus when not watching video or listening to music you can view beautiful photography as well as the Chromecast’s status on its “homepage” of sorts.Did I mention bugs?  One irk is when watching a YouTube playlist, the first couple seconds of each video and audio will repeat 3 times before starting to play… while not anything extremely time consuming it just seems unpolished.  Also when casting a tab to the Chromecast through Chrome’s extension it will probably stop casting at least once through a feature length movie, again, not terribly time consuming as all you must usually do is select “cast this tab” again.  There are as well a few rare instances (once every couple of days) that I must restart the chrome browser in order to cast either a tab or video from supported sites like YouTube or PostTV.  None of these are “deal-breakers” but, it does seem to verify the Beta status you tend to feel it is in at points.  Google does a good job of pushing updates fairly frequently, those updates sit and wait until the Chromecast restarts to start anything so no interruptions if already watching a movie and a updated is posted.  Each update usually makes something noticeably better, if not just a new set of photography while waiting for a cast.For $30 ($35 when I bought it) you can't go wrong if you want any functionality from this thing you don’t have elsewhere.  Already have a Roku, Smart TV, Apple TV, PS3/4, etc etc?  Does it stream from any internet source, any file able to be loaded into your browser?  If you want to see something on your TV that can be loaded into/opened within the Chrome browser on your computer you can with Chromecast.  I love it and hope to see more improvements and enhancements!", "verified": true, "helpfulness": "0/0", "author": "Jose Monsanto \"Frankis\""}, {"rating": 4.0, "review": "It streams some stuff but very limited as to its abilities. as of now there are almost 10 apps you can use it with.", "verified": true, "helpfulness": "0/0", "author": "steven"}, {"rating": 4.0, "review": "Rated at 4 stars because device does not work with Vista. Probably my fault that I didn't research more but did not see that info.  But device is a real pleasure to use with Android. Much easier than using my media pc for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Gary Holsted"}, {"rating": 5.0, "review": "If you have a smart TV or DVD/Bluray, you really don't need it.  Having said that I got one anyway.  I'm not real impressed with my smart Bluray's connectivity and its slow reaction to commands.  This little thing streams YouTube and Nextflix effortlessly. The only draw back, it's support by a very limited number of content providers.  It will stream much of what you have in your Chrome browser window, but places like Comcast have prevented me from streaming from my computer to my TV.  Yes, of course I already have Comcast on my TV, but I tried it to see if it would work.  It's new, so it will have issues and shortcomings, but I think it's great.", "verified": true, "helpfulness": "1/1", "author": "The Tall Paul"}, {"rating": 4.0, "review": "This is the product that will do it for you. Plug it into an HDMI port on your TV and download the app/extension to your device and you are set.", "verified": true, "helpfulness": "0/0", "author": "techguysmtx \"Solution Software\""}]