[{"rating": 5.0, "review": "I just love my chromecast!! We don't have a gaming system in our bedroom and sometimes we wanted to watch movies in there and now we can and it was way less expensive and less complicated tben other gadgets ti stream in our room!! Plus it's portable and we go outta town a lot so its perfect!!", "verified": true, "helpfulness": "0/0", "author": "Leticia Martinez"}, {"rating": 1.0, "review": "the box advertises that you can \"send video or anything on the web to your tv from your smartphone tablet or laptop\"...it also states that it works with \"...iOS...\". While it can stream YouTube, Netflix, Pandora, HBO Go, and Hulu Plus on my iPhone and iPad, it CANNOTstream google Play and Chrome as it also advertises on the box. This is device may be able to \"send video or anything on the web to your tv \", but only under certain circumstances on certain devices. The marketing implies that it can do everything exactly the same on ALL smartphones, tablets or laptops...not true!", "verified": true, "helpfulness": "1/2", "author": "Kris Klinger"}, {"rating": 1.0, "review": "Absolute junk - - gave it away to a co-worker I don't like.  You better have a SmartPhone first to use it.  Very confusing to use.  I work in electronics designing navigation systems for airplanes, so I'm no stanger to eletronics..................besides, it's extremely limited in what it can do.  You can only watch so many YouTubes!!!!!", "verified": true, "helpfulness": "1/4", "author": "Michael Fleharty \"Custom Builder\""}, {"rating": 4.0, "review": "Simple plug and play interface, started a little finicky, and sound can only come from TV (not sound system attached to TV) or sound will not work. But for $35, I'll take the tinny highs of my TV onboard sound.", "verified": true, "helpfulness": "0/0", "author": "Sal Crivelli"}, {"rating": 5.0, "review": "Having the ability to watch HBO Go on a TV as opposed to my laptop when I travel is great!! With HBO Go and Netflix I'm set, but  having more services supported by it would always be a plus. Installation is quick and simple and the set-up afterwards is just as easy.The only issue I've encountered has been using my phones hot spot + my girlfriends phone as the streaming device. The chromecast wouldn't complete the set-up process; I had to switch the streaming device from her phone to my laptop so it could complete the set up.", "verified": true, "helpfulness": "0/0", "author": "R. Ayala"}, {"rating": 5.0, "review": "We use this to stream Netflix and YouTube to our HDTV, and it works beautifully.  The picture is crystal clear; I'm no expert but I'd say the picture and sound are around Blu Ray quality.  I'm really hoping that Google will get around to making it easier to \"cast\" (as they call it) your web browser onto your TV; my family and I would like to be able to watch TV shows directly from, say, CBS's or NBC's websites, but so far this feature doesn't work well at all.  The audio and video are too choppy to be enjoyable.  But even with that being the case, the Netflix and YouTube streaming work perfectly, and for such a small price the Chromecast is definitely worth it.", "verified": true, "helpfulness": "1/1", "author": "Richard C."}, {"rating": 5.0, "review": "I love chromecast!  The only thing I wish it did that it doesn't (yet) is amazon prime streaming.  No cable for 3 years running and this is the easiest and most reliable streaming I have done yet. The controls on the phone *sometimes* don't work like I'd want, a little laggy, but for the most part, awesome!", "verified": true, "helpfulness": "0/0", "author": "Karen W"}, {"rating": 5.0, "review": "best value ever.  I do wish i could stream from software other than chrome.  Google has gone to great lengths to make sure this is not possible.  You can always use handbrake to encode your movies as mp4 so the audio and video codec works in chrome.", "verified": true, "helpfulness": "0/0", "author": "Yakoob A."}, {"rating": 4.0, "review": "This item is a great product!  Now it needs to do more like live view of your android devices and keeps up with what you are doing and not refreshing every time you go to a  new window in Chrome or open a new tab. Also wish that it streamed in 1080p not 720p.", "verified": true, "helpfulness": "0/0", "author": "Trent Ferguson"}, {"rating": 2.0, "review": "I've used this device to watch several Netflix movies, only to find the sound disappear at some point?  I own several streaming devices, including the awesome Netgear Neo running Android, and none with an audio problem.", "verified": true, "helpfulness": "0/0", "author": "Richard E. Newberry \"richinthenight\""}]