[{"rating": 2.0, "review": "It doesn't allow mirroring and only lets me stream YouTube and a few apps.  Not that great--I was hoping it would do more.", "verified": true, "helpfulness": "1/5", "author": "Peter E."}, {"rating": 1.0, "review": "If you have a Time Warner Modem, don't waste your time with this device. It will NOT work! The WPA2 security setting is insurmountable. I call TWC, Google, and Arris (modem manufacturer). What a huge waste of time. More frustration that its worth EVEN if they had been able to make it work.", "verified": true, "helpfulness": "0/5", "author": "Edward A. Dingess \"The Intolerant One\""}, {"rating": 5.0, "review": "This is  the single best purchase I've made all year. Very simple to set up and use. I actually use the netflix function on this rather than the xbox one because it is so much better to control from my phone, computer, laptop, or ipad than using an xbox controller. The youtube function is really great as well.", "verified": true, "helpfulness": "1/2", "author": "sammy davis"}, {"rating": 3.0, "review": "I read posts that this product was idiot-proof, but this intermediate computer, laptop, tablet user did have a lot of problems getting it going.  Then it buffers too much during the movie.  I changed my settings - helped but not entirely.  And the movies just stop playing just as I get interested.  I guess to watch commercial-free fairly new movies for the price of Netflix and this Chrome cast, it is OK for the price.  It has been disappointing though.  I thought it would perform better.  I did try it momentarily with a new Moto X smartphone last night and it seemed great, but haven't watched long enough to see.  It did not work with my tablet and did with my laptop, but by far it appears to work best with the phone.", "verified": true, "helpfulness": "1/1", "author": "Suzyq"}, {"rating": 4.0, "review": "Not as great as I was hoping it would be. It can be laggy streaming from your computer, but streaming from YouTube on my phone works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Christopher Atik"}, {"rating": 5.0, "review": "The best purchase I have ever made in my life. Stream for Hulu still has lots of hickups but the stream for youtube and streaming tabs is  near perfect. I use a little chromebook to do everything so the ability to watch youtube all day on a big screen and still use my computer is amazing.", "verified": false, "helpfulness": "0/1", "author": "KAD"}, {"rating": 3.0, "review": "Will not work on devices on which you can not install Google Chrome - Darn Window's Phone!!!!", "verified": true, "helpfulness": "0/0", "author": "Fidel"}, {"rating": 4.0, "review": "Great for casting YouTube from phone/tablet. Casting from Chrome browser on PC is OK as it is in beta. Only mp4 local video can be played in Chrome browser and casted to TV. Really need more compatible apps and better PC casting!", "verified": true, "helpfulness": "0/0", "author": "Angela Zhou"}, {"rating": 5.0, "review": "this is a flawless streaming device.  I'm super pleased with it but unfortunately does not support movie players such as VLC, WMP, etcetc.. otherwise, I use it on certain icefilms streams, netflix, youtube, and cosmosdocumentaries.", "verified": true, "helpfulness": "0/2", "author": "Chris"}, {"rating": 5.0, "review": "This is exactly what streaming tv should be.  Finally Google got it right -- simply connect this dongle to your TV or AV Unit (use the included extender if you dont have room), connect it to a plug (or if your tv/av has a usb port that works too) and you have a powerful streaming tool.Google is hard at work including streamcasting to various apps -- it already has most of the big names covered (google music, hulu, netflix, hbogo, plex, and youtube) as well as multiple others.  Soon this tool will also support direct streaming from android phones (as found in the API).  Technically there is no stopping what this tool can do and it takes up less room than an apple tv, roku, or other media streamer.Drawbacks?Of course there are -- 1) it doesnt let you stream (currently) from chrome on your phone -- only from your computer.  2) XBMC can not be loaded to the dongle, although this may change when android phone streaming is opened up  then you can stream directly from your supported handset.  3) not enough apps -- definitely needs to be supported more widely -- but I am sure this will happen in the future.All in all its a great product and you can not beat the price", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]