[{"rating": 4.0, "review": "Only con - stays powered on at all times if it needs to be plugged in via the power adaptor.  Other than that works great.  TV is smart enough to know that once your casting to switch to the chromecast source to view!Great little product for the money.  Great for get togethers, everyone can link to wifi and choose the next video!", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 3.0, "review": "el product is good but no play all video and all display... and block my tv o turn off and turn on.", "verified": true, "helpfulness": "0/1", "author": "Henry Francois Andrade"}, {"rating": 5.0, "review": "Pretty simple and easy to use.  would love to see more apps as developers jump on board.  Yet another quality product from Google.Thanks guys!", "verified": true, "helpfulness": "0/0", "author": "B Nelsen"}, {"rating": 1.0, "review": "After waiting for this on Backorder, I was excited to get it. My purpose was to use it from a Den and then use it outside Lanai to stream vids from my iDevice's.Wrong . . . . . . . I was extremely disappointed with google and this lame product.I am not goin to go into the reasons why, coz I see many reviews have written the limits, or lack of limits.Dont waste your money on this unless u want to youtube lolapple TV does so much more few a few extra bucks.", "verified": true, "helpfulness": "1/5", "author": "Den \"Spoke and Strings\""}, {"rating": 2.0, "review": "The main thing I wanted it for was to play Vudu movies for my son but that service doesn't work with it,only Netflix and youtube which doesn't have the best kids movies. This sucks!!!", "verified": true, "helpfulness": "0/1", "author": "Michael"}, {"rating": 1.0, "review": "I haven't  figured out how to use it yet. I think it needs more parts. I taked with one of your techs but your web site was too slow.", "verified": true, "helpfulness": "0/2", "author": "Ray Burrows"}, {"rating": 5.0, "review": "Works great with Netflix and YouTube apps! Still getting use to using it with Chrome.Set up is easy and fast!I definitely recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Patrick Doggett"}, {"rating": 5.0, "review": "It works great, super easy to install and a huge saver if you're not going to get cable (like me!).  It shipped super fast and I've been loving it ever since!", "verified": true, "helpfulness": "0/0", "author": "Chelsie Polifka"}, {"rating": 4.0, "review": "Chromecast is amazingly simple to use and it streams high quality videos very well. I had it up and running in about 5 minutes, including downloading the app to my phone and laptop. I use it a lot to view videos of live music and other YouTube content. Depending on how it was recorded, the audio and the video are excellent (if the source is bad, playback is no better). Using my phone as a remote to queue up videos is very convenient. Chromecast does not interfere with other uses of the phone.  It works great with Netflix. It would be a 5 star but the breadth content is pretty limited at this moment (It would, for example, be great if there was Amazon Prime available). I understand that Google is working to expand the available content.", "verified": true, "helpfulness": "0/0", "author": "William S. Holland"}, {"rating": 4.0, "review": "Once you overcome the set-up, it's a pretty cool, useful device.  I could not set it up with my Samsung Chromebook, which seemed counter-intuitive since I ordered to Chromecast to use with the Chomebook.  In any event, I was able to use my daughter's ipod touch to set up the Chromecast on the HDTV (pretty easily actually) and then downloaded the Chromecast software to  the Chromebook and I was off and running.  It's great for sending a movie from Netflix on the Chromebook to the HDTV and I discovered you can actually close up the Chromebook and it seems to just keep streaming directly.  Pausing it or stopping and starting it will cause it to glitch, but if you just want to start a movie or tv show and watch right through this is a great device.", "verified": true, "helpfulness": "0/0", "author": "Marty Voss"}]