[{"rating": 5.0, "review": "Take this with you when you travel. Great for hotel rooms. I LOVE it. It set the industry standard", "verified": true, "helpfulness": "0/0", "author": "DooF"}, {"rating": 5.0, "review": "I bought this as a gift to my Mom in Law, she uses it probably every day. We recently used it while on vacation to entertain my nephew with Netflix while the adults ran around getting ready for the day.", "verified": false, "helpfulness": "0/0", "author": "Moxie"}, {"rating": 4.0, "review": "The best thing I've plugged into my TV.  Netflix, HBOGo and music streaming is infinitely easier.  However, streaming local files or your window tab is jittery and not great.  Streaming from external sources is great though.", "verified": true, "helpfulness": "0/0", "author": "Todd Forsyth"}, {"rating": 4.0, "review": "A cheap alternative to other streaming products. I currently own a Roku 2 box and this product. I purchased the Chromecast for simple YouTube viewing on my TV. It gets the job done.As a whole, this product is much more compatible with Android devices. You can stream most video outside of Chromecast approved apps on an Android device.If you're a heavy Mac user like me, you would be better off with an Apple TV. However, if you're looking for a cheaper option, this device works well and is incredibly easy to use.", "verified": true, "helpfulness": "0/0", "author": "Bjar"}, {"rating": 5.0, "review": "I have 2 apple tv's and this chromecast. The chromecast is cool because it is a little bigger than a standard usb dongle. It's somewhat limited because you need a pc, mac, ipad or smart phone and a wifi connection in order to be able to stream something on your tv. But it's great for business trips and stuff like that.", "verified": true, "helpfulness": "0/0", "author": "DOUGLAS S. FRASER H."}, {"rating": 5.0, "review": "It was a very good bought. I like it a lot.", "verified": false, "helpfulness": "0/0", "author": "aristeu melo"}, {"rating": 3.0, "review": "It was a cheap experiment to see if any serious streaming could be done from a ipad or other device.  It couldn't.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 3.0, "review": "Chrome extension still in beta version, it has some glitches and issues, I hope they update it soon", "verified": true, "helpfulness": "0/0", "author": "Joel Tello Guzmán"}, {"rating": 4.0, "review": "Very good product, Very easy to configurate and to use", "verified": true, "helpfulness": "0/0", "author": "GB"}, {"rating": 5.0, "review": "Good purchase for a reasonable price", "verified": true, "helpfulness": "0/0", "author": "Juan Gerardo Guandique"}]