[{"rating": 5.0, "review": "this makes possible you do not need to have a smart tv anymore.using your cell as your remote control and reproducing youtube, nrtflix, and hulu videos on your tv are two of the most useful features that u can ever have", "verified": true, "helpfulness": "0/0", "author": "lennier"}, {"rating": 5.0, "review": "Works flawlessly!  Setup was a breeze and the device streams seamlessly over WiFi.  Too bad it doesn't stream local media (yet).", "verified": true, "helpfulness": "0/0", "author": "David Collins"}, {"rating": 4.0, "review": "I thought it would work with any device, you need the software loaded on each device to use? I was hoping to plug and go, not that easy!", "verified": false, "helpfulness": "0/1", "author": "Speed Biker"}, {"rating": 5.0, "review": "Just what my TV needed.  Now when there's nothing on broadcast (I refuse to have cable) I just find a Netflix movie and play it on my 37\" TV, which is at the center of my computer work station.", "verified": true, "helpfulness": "0/0", "author": "Tim Domenico"}, {"rating": 5.0, "review": "Awesome Price for what you get. Great if you don't have a wifi TV. Works with most major sites. youtube Netflix Pandora and more", "verified": true, "helpfulness": "0/0", "author": "Ted"}, {"rating": 4.0, "review": "Google has done a pretty good job here by creating a relatively inexpensive method for wirelessly sending videos and the web to your TV.  Syncing with your laptop is easy as long as you are willing to use Google Chrome as your browser.  If you don't like Chrome only use it when you want to sync and use your preferred browser all other times.  Now when using an iPhone, the only two apps that work with Chromecast right now are YouTube and Netflix, so there is not a lot of versatility here (is this really a surprise considering it is considerably cheaper than Apple TV?).  I have read that Android phones work a little better.  I use Chromecast mainly to watch Amazon Instant Video from my laptop, and with a few tweeks it works flawlessly.  I highly recommend this device especially if you are mainly going to use it as a way to view internet content on your TV.  I mean if you buy the Chromecast and are having trouble getting something to work, just Google it.  Somebody out there in cyberspace is sure to have figured it out.", "verified": true, "helpfulness": "1/1", "author": "bwhulsey"}, {"rating": 4.0, "review": "Inexpensive access to Netflix.  Access to various web services is limited, and use of Android phone or Tablet is rather limiting and clunky.  Overall interesting and worth the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "An absolutely stellar little device.Pros :SIMPLE. I cannot stress this point enough. Plug it in, follow the brief instructions, and you're done.CHEAP. If i had to buy a new one every month (which is absurd) it would still be less than 1/4 my monthly cable bill.CONVENIENT. I can cast from any of my smart devices, from anywhere in reach of your WiFi connection.Cons:Windows Tablet RT OS does not support it.I have 2, one for each of my TVs and I turned off my cable service entirely in favor of an internet based entertainment situation. This device has already saved me hundreds of dollars in cable subscription bills and tons of heartache dealing with terrible cable service and hit-or-miss DVR performance.", "verified": true, "helpfulness": "1/1", "author": "Eddie Garza"}, {"rating": 5.0, "review": "love it, pandora, youtube, chrome, netflix, and now hbo go! super easy to use and work very well. HBO can be clunky at times, but it seems to be getting better. Way better than the tv installed apps.", "verified": true, "helpfulness": "1/1", "author": "Kris Ramsey"}, {"rating": 5.0, "review": "I received this item in good time and it works as good as it should it streams well with my Nexus 7 ,HTC phone and laptop. Must say pictures are very clear. Try one for yourself", "verified": true, "helpfulness": "0/0", "author": "Errol J Bryan"}]