[{"rating": 5.0, "review": "best purchase ever for the price a must have in every home", "verified": true, "helpfulness": "0/1", "author": "cottonsince85"}, {"rating": 5.0, "review": "Love it, buy them for every TV in the house. Send them as gifts. They're perfect.There are so many supported apps now that at this price, you can't afford not to own one of these, especially if you have an Android phone.I use my Chromecast just about everyday. It's incredibly simple and easy to use. It takes a couple minutes to setup and then in no time you'll be beaming things to your TV. And now with Android's screencast, you can bean your devices screen to the TV. It's pretty damn awesome..", "verified": false, "helpfulness": "0/1", "author": "C. John Smith"}, {"rating": 5.0, "review": "This little device has made my cord cutting so much better.  I dreaded the need to yank out my hdmi cable from behind my TV and connect it to my laptop.  Now with this I can push almost any content (if latency isn't an issue) to my TV with a couple clicks.", "verified": true, "helpfulness": "0/1", "author": "Andrew S."}, {"rating": 5.0, "review": "Loving it!", "verified": true, "helpfulness": "0/0", "author": "Atlantis"}, {"rating": 4.0, "review": "Love it, but it would be nothing without the Videostream app for PC...", "verified": true, "helpfulness": "0/0", "author": "Javier"}, {"rating": 5.0, "review": "The answer to my streaming question!  Works way better than any of the other devices I've tried!!  Rarely any buffering at all.  Crisp/clean 1080P picture every time.  LOVE my Chromcast!!", "verified": true, "helpfulness": "1/1", "author": "Medina"}, {"rating": 5.0, "review": "Chromecast is worth every dollar and is worthy of your attention. With the new update it mirrors everything from your smartphone.", "verified": false, "helpfulness": "0/0", "author": "frances"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "JAMIE HARDY"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Janis Shoemaker"}, {"rating": 5.0, "review": "Recieved  quicklyWorked as advertised", "verified": true, "helpfulness": "0/0", "author": "David wallace"}]