[{"rating": 4.0, "review": "I love the fact that I can stream videos to my tv from my phone but sometimes it freezes then I have to restart my phone so I can make it work again.. Those little glitches I hope it can get fixed.", "verified": true, "helpfulness": "0/0", "author": "Cindy"}, {"rating": 4.0, "review": "Its a bit early in the ownership stage of this product only having it for two days but so far its going pretty good. I watched an HD movie from Netflix and only towards the end did it slow down a little bit but then was gone. I have successfully displayed pictures on my tablet and phone on the TV as well as videos. There are plenty of apps in the store to set this up. Best of all for $35 it presents full featured gadget that delivers.", "verified": true, "helpfulness": "0/0", "author": "Help-Me-Help-You"}, {"rating": 1.0, "review": "This would be great if it just displayed your tab on your TV. So much potential. No Amazon Prime rentals because Google wants you to BUY movies from them. The really frustrating problem is that I thought this little guy was going to afford me unlimited youtube (unlike a roku). While it does not seem to block youtube videos, It won't play videos that are blocked for mobile devices if you use a mobile device as your remote. JUNK!", "verified": true, "helpfulness": "0/1", "author": "larry"}, {"rating": 5.0, "review": "I love this gadget, Easy to set up and use.  Recommend for those looking for an easy way to stream.", "verified": true, "helpfulness": "0/0", "author": "J. King \"King\""}, {"rating": 5.0, "review": "Coolest thing ever for watching movies.  Does everything from my smartphone.  Works great and simple to use.  Picture quality is great.", "verified": true, "helpfulness": "0/0", "author": "James Skeel"}, {"rating": 5.0, "review": "I absolutely love chromecast its easy to move around the house to different tvs. I can manage from all my devices phone, tablet, and pc. my favorite gift thus far. Thank you google", "verified": true, "helpfulness": "0/0", "author": "Grecia Nunez"}, {"rating": 4.0, "review": "This has been basically a great piece of hardware having the ability to watch anything streaming through Chrome or apps like Hulu Plus BUT for some reason when I try to stream Netflix through the app it freezes and eventually says that I'm not connected to the network (my network) but I obviously am streaming everything else without a problem. I can watch Netflix if I stream it through Chrome on my Mac but that's not why I bought it. It must be a Netflix/Chromecast issue/bug. I would have given it 5 stars if it weren't for this issue. Recommended!", "verified": true, "helpfulness": "0/0", "author": "Bird"}, {"rating": 5.0, "review": "I finally feel like I am living in the 21st centuryWe bought one for each tv, and we travel with them too.great gift for people.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Exactly what I was looking for...All media on the TV without too much effort. Tons of apps available to be used.", "verified": true, "helpfulness": "0/0", "author": "Sergio Ferreira \"bucka\""}, {"rating": 5.0, "review": "Cool and useful and very simple to use ! i have 2 of them one of each of my TV's", "verified": true, "helpfulness": "0/0", "author": "George T. Haber"}]