[{"rating": 4.0, "review": "I have not used it much, but it delivers! I t is nice to watch the movies on the TV vs the computer.Very easy to install.", "verified": true, "helpfulness": "0/0", "author": "Laura Colon"}, {"rating": 5.0, "review": "All I wanted was a cheap Netflix device and this met the bill. It will only get better from this initial deployment.", "verified": true, "helpfulness": "0/0", "author": "Greg"}, {"rating": 4.0, "review": "Need more apps and  vastly improved tab casting.  A deal at $35 with 3 months of Netflix.Can't wait for more apps.Sebastian", "verified": true, "helpfulness": "0/0", "author": "Sebastian  Franzen"}, {"rating": 5.0, "review": "Setup was a breeze. This little device works perfectly and at 35 bucks is a steal. Going to order another one back in stock.", "verified": true, "helpfulness": "0/0", "author": "LeRoy Brown"}, {"rating": 5.0, "review": "Works as advertised - hardly any setup, great picture quality.  Can't wait to see all the functionality still to come.  Thanks again, Google.", "verified": true, "helpfulness": "0/0", "author": "John Galt"}, {"rating": 5.0, "review": "Had a couple gliches, but overall I am pleased with the Chromecast's performance.  It is a good value, and great if you use Netflix alot, which we do.", "verified": true, "helpfulness": "0/0", "author": "Patrick Bush"}, {"rating": 4.0, "review": "This is nice and works well for me at least.  You can view any online web page on your TV using this device.I was disappointed in the fact it will not play videos from your folders/files on your computer that have been downloaded from the web.  It was not advertised as doing this, but thought just maybe it would.I have a Netflix subscription and have used it a lot for that.  Am hopeful that other program, similar to Netflixwill be added in the future and that the device can be updated.  We shall see.", "verified": true, "helpfulness": "0/0", "author": "DARRELL D. ELLIOTT \"dax\""}, {"rating": 4.0, "review": "Currently, my only objection is really the amount of content I have access too.  There was some software glitches when it first came out but with the first patch, I think they all disappeared.  I expect Google to continue to improve this device and can't wait to see future enhancements.", "verified": true, "helpfulness": "0/0", "author": "john boyer"}, {"rating": 5.0, "review": "Simple, easy to use, does everything I wanted it to do and has great future potential. Anyone who uses Google music or youtube would love this product.", "verified": true, "helpfulness": "0/0", "author": "Marc Federico \"mfed3\""}, {"rating": 5.0, "review": "You can't go wrong with this $35.00 dongle! A MUST have ! Netflix streaming is GREAT! I think it is a wonderful investment. I own a roku 2 XDS and Apple TV - the best part of the dongle is working on other items while watching content", "verified": true, "helpfulness": "0/0", "author": "Michael W Jackson"}]