[{"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Vegas Vic"}, {"rating": 5.0, "review": "Wow!  This is my first attempt in using this type of device, and I think I hit the jackpot.  It is so easy to install, and with my Prime membership, I have access to a ton of movies, TV series and music to entertain and enjoy.  My only regret is that I didn't buy it sooner.Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "James A Whitaker"}, {"rating": 3.0, "review": "I liked my fire tv, but it had to be replaced after about 3 weeks.  I am not real happy that I can't mirror my kindle t the second screen.  There should be better explanations of compatibility with different pieces of equipment.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Rose"}, {"rating": 2.0, "review": "AppleTV is much more intuitive, easy to integrate, and streams better at my house. I love almost everything Amazon, but this one has let me down so far. I am ready for Sling to move to my Samsung SmartTV.", "verified": true, "helpfulness": "0/1", "author": "Britney Voorhees"}, {"rating": 1.0, "review": "dont like how i have to pay for everything that i want to see even with prime..free items only consist of old movies....NONE of my favorite tv shows were free even old seasons..", "verified": true, "helpfulness": "0/2", "author": "Quarttaus Cobbs"}, {"rating": 5.0, "review": "After struggling with Sony WiFi Blu Ray and never being able to get a connection it has really been a relief to get even a better picture on my 1080 than I got from Uverse and Comcast. Not once has the coverage not been there. I only have one tiny complaint. When you are browsing it is not clear whether I will be charged for the selected movie until after I open it. You won't be sorry for your selection.", "verified": true, "helpfulness": "0/0", "author": "John Henry"}, {"rating": 3.0, "review": "The prime shows are nice but it fails to mention that mostl other non prime shows are ppv which means you still have to go to netflix where they are free.", "verified": true, "helpfulness": "0/0", "author": "jeff ludwig"}, {"rating": 5.0, "review": "More than has exceeded my expectations. I like the freedom of not being tied down to a year or two long contract. Even better, they just added new channels.", "verified": true, "helpfulness": "0/0", "author": "Steve Watts"}, {"rating": 4.0, "review": "I really like it!  The layout is better than Roku, but Fire TV has fewer channel options and that is why it gets a 4 Star Rating instead of a 5 Star Rating.  That being said, I have no regrets and I really like my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "DUPDAWG \"Todd\""}]