[{"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "Sandra"}, {"rating": 5.0, "review": "What I love about Chromecast is:1. The price.  I am saving lots of money by cancelling my cable subscription.  I am using it for Netflix, Hulu and MLBTV.2. When I launch shows from my laptop and cast them to my TV, I can then do other things on my laptop. I previously had an HDMI cable running from my laptop to my TV, but then couldn't used my laptop for anything else.  If I switched to work on a spreadsheet or another website, that would display on my TV instead of the show.  With Chromecast, the Chromecast device runs the show, leaving your laptop (or whatever device you used to originally launch the show) to be free for other uses.3. The beautiful photos that Chromecast cycles through as a screensaver on the TV.It was easy to set up.  I just followed the instructions and it was running in 5 minutes.  Once in the while, there is freezing but not often.  I'd rather have that then pay the outrageous prices for cable.", "verified": true, "helpfulness": "0/0", "author": "J. DeFlores"}, {"rating": 3.0, "review": "Does not work on our old LCD TV even though it supports 1080p.", "verified": false, "helpfulness": "0/0", "author": "ervinpm"}, {"rating": 5.0, "review": "It's just awesome. You start with thinking where would you use it and end up using it a lot.$35 is really quite less for this much awesomeness.", "verified": false, "helpfulness": "0/0", "author": "Aditya Gupta"}, {"rating": 5.0, "review": "works fine", "verified": true, "helpfulness": "0/0", "author": "OCProf \"OCP\""}, {"rating": 5.0, "review": "It is very easy and simple. It basically makes any old tv a smart tv for only 35 bucks. I loved it so much I bought two more.", "verified": true, "helpfulness": "0/0", "author": "Benjamin O."}, {"rating": 4.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Monjur Ahmed"}, {"rating": 4.0, "review": "Set-up is painfully easy, grandma could do it.This is a great step in PC to home theater sharing.The only con is that even with FiOs fiber optic internet speeds, there is a little to much buffering when trying to stream videos from your SD card to the TV. Although, with a strong internet connection, streaming internet video, such as YouTube, it's almost flawless, even in HD.", "verified": false, "helpfulness": "1/1", "author": "B"}, {"rating": 5.0, "review": "If you're opting out of traditional cable or satellite tv service, you need one of these. Even if you do have a SmartTv. Wonderful Device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far very little but tulizado and is easy to set up, I hope to open a little apple applications and so to enjoy this great product .......", "verified": true, "helpfulness": "0/0", "author": "Gonz"}]