[{"rating": 5.0, "review": "HAPPY", "verified": true, "helpfulness": "0/0", "author": "Jonathan Monge Arias"}, {"rating": 5.0, "review": "Best Streaming Product for $35", "verified": true, "helpfulness": "0/0", "author": "Muneeb Mufti"}, {"rating": 5.0, "review": "A sharp little device for streaming and computer desktop sharing options. Not a complaint to be found after two months of use.", "verified": true, "helpfulness": "0/0", "author": "R. Bradley \"they call me Claven\""}, {"rating": 4.0, "review": "I really do love my Chromecast. This is the second I've purchased.  I would like to see them come out with some better apps but for the most part it does exactly what I need which is stream Netflix and Youtube from my PC, tablet or phone to my TV.", "verified": true, "helpfulness": "0/0", "author": "Christine Koval"}, {"rating": 5.0, "review": "Amazing Product!", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 4.0, "review": "Love it.  Really changed my TV watching world in one little device.", "verified": true, "helpfulness": "0/0", "author": "Leticia Villarreal"}, {"rating": 5.0, "review": "I actually prefer using my Chromecast over similar functions on my Smart TV. Its super simple to use and pretty intuitive. I especially love the Youtube playlist feature (great for entertaining guests).", "verified": true, "helpfulness": "0/0", "author": "Alan Blashaw"}, {"rating": 5.0, "review": "This is the best product that Google has ever put out. Great way of getting content from your computer, or mobile device, to your screen with minimal hassle.The ONLY issue I have is that the Chromecast must see the outside internet to be able to stream even local content. For example, if I have sync content locally with Plex, and travel to a hotel, the Chromecast is worthless. I can bring a wireless router for the Chromecast and mobile device to both be on, but since the Chromecast can't see the internet, it no worky.", "verified": true, "helpfulness": "0/0", "author": "Pat McKay"}, {"rating": 4.0, "review": "Love it.  So far I have not missed having cable.  This had satisfied my TV watching needs.", "verified": true, "helpfulness": "0/0", "author": "EnglishTeacher"}, {"rating": 5.0, "review": "Works seamlessly from my phone or laptop.", "verified": true, "helpfulness": "0/0", "author": "JR"}]