[{"rating": 4.0, "review": "Interesting item", "verified": true, "helpfulness": "0/0", "author": "WEI"}, {"rating": 5.0, "review": "works great! my old LED TV has memory issues that can't handle the new YouTube streaming video. This product fixed that problem and now plays youtube flawlessly.", "verified": true, "helpfulness": "0/0", "author": "G."}, {"rating": 5.0, "review": "A terrific little gadget and inexpensive too.", "verified": true, "helpfulness": "0/0", "author": "urantia2 \"urantia2\""}, {"rating": 4.0, "review": "In light of a recent review I wrote on the Fire TV Stick, I figured I'd come here and write one for Chromecast as well, since I've owned it even longer than my Fire TV Stick--only seems fair.Comparing Chromecast, Fire TV Stick, and Roku, I find that the Chromecast is the best balance between price, performance, and capability.In terms of overall design, Chromecast is definitely the most bare-bones.  There's no physical remote (just software on various devices).  There's not even really much of an interface, when you're using it.  Almost everything is done via simple play, pause, and queue controls on a smartphone or other device.  It's a bit sparse for my liking, but it's simple enough and it's efficient.In contrast, Fire TV Stick and Roku were built around navigating and finding content on your TV screen.  With Chromecast, you find things on your device, typically.  I like the on-screen searching, since it allows a more social experience--everyone can look at the TV, even if only one person is in control of the interface.If not for the HDCP issues I'm having which effectively makes my Fire TV Stick a useless dongle attached to my TV, I would recommend it over the Chromecast.  However, in their current state, and based on the poor support from Amazon (and the fact that I've never once had to contact anyone about Chromecast support), I would recommend a Chromecast before a Fire TV Stick.  Or, if you can wait, I'd recommend doing so until the Amazon Fire TV Stick has some of its glaring functionality (and customer support) issues resolved, which currently make it a product I would not purchase again", "verified": false, "helpfulness": "1/1", "author": "M. Donnelly"}, {"rating": 3.0, "review": "Needs some bugs worked out.  Lags behind and have to close out of app and restart occasionally.", "verified": true, "helpfulness": "0/0", "author": "Farmer Chris"}, {"rating": 1.0, "review": "This doesn't work with my router or network. I'm not sure where the problem is, or how to fix it. Help appears to be non-existent. I'm returning it.", "verified": true, "helpfulness": "1/3", "author": "Vicky K. Woodard"}, {"rating": 5.0, "review": "Yep, it's a chromecast. Not much else to say. If you know what a chromecast is, then you know it's amazing. If you don't know what it is, then you should be reading about it on one of Google's pages and not in an online retailer's reviews.", "verified": true, "helpfulness": "0/1", "author": "Derrick Haynes"}, {"rating": 2.0, "review": "Did not meet my expectations.I bought a Fire Stick and it is much better.", "verified": true, "helpfulness": "0/3", "author": "skiya"}, {"rating": 4.0, "review": "works great except on smart tv which does cause issuesnice to eliminate the hdmi cable!have one on 2 tvs and love it", "verified": true, "helpfulness": "0/0", "author": "Tim Devaney"}, {"rating": 5.0, "review": "Shallow learning curve.  Can downgrade Dish and save some $", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]