[{"rating": 3.0, "review": "Mirroring is okay but Google needs to get Amazon Prime to be compatible as an app.  Just okay for the price", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 4.0, "review": "Works well, but has problems with ipad netflix", "verified": true, "helpfulness": "0/0", "author": "Kevin Morrow"}, {"rating": 1.0, "review": "Terriblbe....won't take password....it's garbage....do not buy.", "verified": false, "helpfulness": "0/6", "author": "ja1535"}, {"rating": 2.0, "review": "Go with apple tv, its worth the extra money. i have both, youre missing out on so much with this thing.", "verified": true, "helpfulness": "0/0", "author": "Kevin McAvoy"}, {"rating": 5.0, "review": "We did not know what we were missing.  Being able to cast has charged how we use and view the tv.", "verified": true, "helpfulness": "0/0", "author": "DrGeorge10 \"George J Fero\""}, {"rating": 5.0, "review": "Bought as a gift for my son-in-law. It works great in their bedroom, after initial set-up on their cellphone, they can now watch their Netflix in the bedroom without an additional unit.", "verified": true, "helpfulness": "0/0", "author": "Cyndy"}, {"rating": 5.0, "review": "Working good", "verified": true, "helpfulness": "0/0", "author": "Laynne S. Gensler"}, {"rating": 5.0, "review": "I love the chromecast. setup was super easy, it comes with a power cord for the HDMI. I downloaded the chromecast to my phone and tablet and use them as a remote to stream the videos I want. Very useful for people without cable.", "verified": true, "helpfulness": "0/0", "author": "Shonette Greene \"Shonny\""}, {"rating": 5.0, "review": "Fantastic device that does everything it claims.  It interfaces well with Applie iPads and it comes with the USB power interface that allows you to have your device powered by your HDTV if it has a USB port.  Most HDTV's today have a USB port and so this arrangement is idea since when you power on your HDTV, it powers on the Chromecast device, and when you power off your TV, it powers off the Chromecast.Any application that features a Chromecast interface will stream video.  I have used mine with great results on Netflix.  I have also used it with the Major League Baseball package named MLB.com.", "verified": false, "helpfulness": "0/0", "author": "Kenneth Wayne Stallings \"Ken Stallings\""}, {"rating": 1.0, "review": "There are IPhone apps that can do the same as Chromecast. I have 3 Roku players and thought the Chromecast was an inexpensive alternative. It doesn't come close.  I'm sure those commenters who also own Roku's would agree. I recommend a Roku and installing either Playon media server or Plex media server on your PC. Both are compatible with Roku. Playon has many apps, one of which allows me to watch live MLB and NFL games without having to buy a sports package.", "verified": true, "helpfulness": "0/2", "author": "Gift Recipient \"Sleeping in a cold bed\""}]