[{"rating": 2.0, "review": "it has delay!!!there is a considerable delay between the device you are casting from and the TV.Also, when you try to send the desktop to your TV it won't work properly.", "verified": true, "helpfulness": "0/0", "author": "Ehsan"}, {"rating": 1.0, "review": "Could not get this thing to work.  I called customer service and they said I need the the wireless router within 20 feet.  I moved the router to within 10 feet and it still kept dropping the connection.  Very frustrating experience.  The customer service person I spoke to was nice.", "verified": true, "helpfulness": "1/3", "author": "S. A. Moran \"SAM\""}, {"rating": 5.0, "review": "This product was very easy to install and is a lot of fun to use.  I just bought a second one as a gift for my niece", "verified": true, "helpfulness": "0/0", "author": "Debra"}, {"rating": 3.0, "review": "Would like Google to come out with more Apps which can stream. I will be an excellent when google enables chrome browser on mobile devices to stream. Currently chrome browser can stream only through laptops and desktops.", "verified": true, "helpfulness": "0/0", "author": "Ezt"}, {"rating": 1.0, "review": "Mandates the use of Windows 7or above. The device will not work with Windows XP or below!  Gave mine to my Nephew.", "verified": true, "helpfulness": "1/2", "author": "kjock"}, {"rating": 4.0, "review": "It mostly works great but there seem to still be a few bugs. Sometimes it will not play videos and I will have to power cycle it to get it to play again. Other than that, it works great. Nice quality on the TV and pretty easy. If you don't have a smart TV already, this is a great option and I'm sure it will only get better. I paid thirty five dollars and I think for that price it's worth the few small issues I've had.", "verified": true, "helpfulness": "0/0", "author": "Nathan Perry"}, {"rating": 3.0, "review": "doesn't work from pcs with older operating systems. also can't cast from chrome browser for android on my HTC one.", "verified": true, "helpfulness": "0/0", "author": "caes"}, {"rating": 2.0, "review": "Did not work at all so I cannot rate because I could not try out. Hopefully not to be charge for shipping", "verified": true, "helpfulness": "0/1", "author": "HOA DUONG"}, {"rating": 5.0, "review": "Took some time to originally set up.  Now that it works, it is super.  No more stringing hdmi cables to hook into the TV.  I'm not a video  transmission perfectionist so I don't notice there to be less quality in the picture than I get from Roku or my other google play device.", "verified": true, "helpfulness": "0/0", "author": "Charlesqc2"}, {"rating": 5.0, "review": "Very nice, and inexpensive.  Easy to install, I have Chromecast on both of my televisions and use them all the time.", "verified": true, "helpfulness": "0/0", "author": "R. Chojnacki"}]