[{"rating": 5.0, "review": "this is really very easy to use and very easy to watch movies on the TV. I really like it", "verified": true, "helpfulness": "0/0", "author": "chakradhar"}, {"rating": 5.0, "review": "Love, love, love this item! We can watch home videos from our phones as well as stream movies. Great value!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 1.0, "review": "I've been a longtime fan of Rokus, but when mine recently broke, and I was waiting for a replacement to be sent from Roku, I wanted a way to still be able to watch Netflix, Hulu Plus, and HBO Go on my television. Since this was on sale at Best Buy at the time for $30 bucks, I decided to pick one up to see what it was like. I also thought the small size would be easy to pack and would be great for when I travel.I haven't been more frustrated in a product in a very long time. Unlike some other reviewers I had no difficulty setting it up, but that's the only thing that hasn't been frustrating about this thing. There's such a lag between the time I try to start \"casting\" to the time it finally start playing. And of course there are the many times when it will say that it's connecting and just never does. Once a video does finally start playing it will very, very rarely play straight through without multiple pauses, or the video will stop while the sound continues, or the sound stops while the video continues, or it will just stop completely and never start again. These problems happen regardless if I'm using Netflix or HBO GO. I have given up on trying to get it play Hulu Plus because it has never worked.These aren't issues that I have while using any of these apps on my iPad, iPhone or MacBook Pro, so I'm left thinking that it's a problem with the chromecast. I also never had any of these problems with my Roku. There's also the fact that it doesn't work with the Amazon Video Player. Watching a movie or any other video should be a relaxing and enjoyable event. The Google Chromecast just completely ruins that experience. There are so many other products to stream video save yourself the stress and buy anything else besides this. As soon as the new Roku arrives this will be relegated to the junk drawer.", "verified": false, "helpfulness": "2/2", "author": "Emma Dilemma"}, {"rating": 4.0, "review": "Pro:Easy to connect and use. my daughter and I can \"share \" my tablet..:) Con: Interface with Hulu and other companies still not ready..", "verified": true, "helpfulness": "0/0", "author": "Nadia Ferguson"}, {"rating": 5.0, "review": "This little device is exactly what I needed. I can now watch youtube videos and Netflix on my large samsung TV without the need for anything else. I originally wanted a keyboard but this unit lets me control the tv from my Droid Razar MAXX. I get much better resolution than using the HDMI cord from my droid to the TV. I am very glad that I read about this device. So easy to install.", "verified": true, "helpfulness": "0/0", "author": "C. David"}, {"rating": 5.0, "review": "Who needs Apple TV, you can do all the things Apple TV does with Chromecast for a third of the price. I would reccomend this to anyone it's worth it", "verified": true, "helpfulness": "0/0", "author": "abigail jacobs"}, {"rating": 5.0, "review": "It is of limited use...... but I love it anyway.Being able to cast youtube, netflix, pandora, or mirror a chrome tab may seem like it is of limited use......But it is sort of awesome.", "verified": true, "helpfulness": "0/0", "author": "Michael Sandler"}, {"rating": 4.0, "review": "It is a great little gadget that allows me to watch Netflix on my Sony LED TV without the wires. It took me 5 minutes to install and I've had no problems with it using it with iPhone 4, iPad 2. Unfortunately you cannot use it with safari with a mac computer, but works with Chrome, though I've had trouble with it, sometimes it just stopped working. But, since I can use it with the other gadgets, it is no problem for me. Sometimes it takes a while for the Netflix iphone app to go back to the Chromecast to control (pause, stop, etc.), but if you are patient it will show up...For the price, it does the job and is nice to not have all those wires. The image and sound are neat and gorgeous. Good job GOOGLE!", "verified": true, "helpfulness": "0/0", "author": "M. Paz Bernal \"pachis\""}, {"rating": 5.0, "review": "Amazing device.My kids are happy.", "verified": true, "helpfulness": "0/0", "author": "Danilo Cardenas Coral"}, {"rating": 4.0, "review": "Works in the Chrome environment but have to move pics and docs to Chrome tools for viewing.  Works great for sharing web sites and youtube.", "verified": true, "helpfulness": "0/0", "author": "m. ketch"}]