[{"rating": 3.0, "review": "I like that you can stream anything from your chrome browser.  However from my iPhone i am limited to about 3-4 apps that allow streaming.  I don't see why google doesn't provide more of a appleTV feel to it by giving the chromecast some kind of a desktop feature, instead of a screen saver look.  I WOULD LOVE for this device to turn my TV into a smart one and it looks like it is going in that direction.  OVERALL--You can not find anything else on the market that allows you stream to your TV with this kind of quality for the PRICE.  Def worth the money, lets just pray that it evolves.  PROS: HBO go is compatible, NETFLICKS, HULU plus etc", "verified": true, "helpfulness": "0/0", "author": "mMaisonet"}, {"rating": 5.0, "review": "My experience with Chromecast has been very positive. Video quality is excellent and it connects reliably. I have it connected to my digital receiver and I get 5.1 sound form supported content. HDMI CEC also works well as it turns on the TV and receiver and switches to the correct input. The limiting factor so far has been the relatively few apps that have been released with Chromecast support. But with the recent release of the Chromecast SDK there should be many more coming soon. I would highly recommend getting one of these. Also remember that unlike other products, this one works cross-platform.", "verified": true, "helpfulness": "0/0", "author": "Jorge Suarez"}, {"rating": 2.0, "review": "When I bought the chromecast I was very excited. It was advertised as a device that allowed you to project/mirror your phone/tablet screen onto you television but that is absolutely not the case. When I realized this I wasn't too unhappy since the price was so cheap, besides I was still hoping that I could stream amazon prime or hbo onto my bedroom tv. Well that's not possible either. Here's what you can stream onto your tv--YouTube and vevo. That's it. Pretty darn limited if not useless if you ask me. Better to save your 40 bucks and get a roku or appletv.", "verified": true, "helpfulness": "1/3", "author": "R. Magallon"}, {"rating": 5.0, "review": "would buy another if needed works great and is worth the cost is very useful and happy to have it", "verified": true, "helpfulness": "0/0", "author": "Kyle D"}, {"rating": 3.0, "review": "I got my Chrome cast as a gift, I loved the idea of streaming straight from my Phone ,Laptop and android tablet.  I was bothered by the fact that most what I wanted to hear from youtube, was unable to be played. You must have Google Chrome to do anything. via the Chrome cast.Netflix..slow to load, I get it better using my WII.It is pretty much a blue tooth type thing only made for Google.Great concept, but lacks certain features.", "verified": false, "helpfulness": "0/0", "author": "Robin H"}, {"rating": 3.0, "review": "The device is easy to install - it connects to your existing Wi-Fi network and accepts transmissions from any connected device.  However, it only works using Google Chrome and compatible apps such as YouTube and Hulu.  It would be much handier if I could transmit from any video player, or if I could just extend my desktop to the t.v.", "verified": true, "helpfulness": "0/0", "author": "DAVID ROMANOVSKY"}, {"rating": 4.0, "review": "I have this connected to an older HDTV that has an HDMI input. The quality of the streaming is good when I can get it to connect. Even when sitting about six feet away the Chromecast device will occasionally not appear when roaming for a device. When the connection is made, however, the quality of the video and audio is quite good. This is a nice, low cost way to turn a regular TV with an HDMI input into a Smart TV with spending the money on an entertainment PC. Particularly for those who carry their tablets or portable computers around the house, this is recommended as a convenient accessory for watching content. It allows the source device to be used for other things while the video is playing on the assigned display.", "verified": true, "helpfulness": "0/0", "author": "Shopper"}, {"rating": 1.0, "review": "Works with router some days, most days it doesn't. Support is impossible to get. They send you back to FAQ's that you have already read.Wouldn't waste your money on it.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "If you don't have any other device for watching Netflix and Hulu on your tv, I could see this being useful. All the Chromecast adds is a way to stream YouTube on your tv really efficiently. Give this a pass and get a Roku instead.", "verified": true, "helpfulness": "0/0", "author": "lasercats"}, {"rating": 3.0, "review": "Purchased this chrome cast with an LG TV in order to stream apps to my TV, does a great job streaming just wish more apps supported the casting feature.", "verified": true, "helpfulness": "0/0", "author": "Jason"}]