[{"rating": 4.0, "review": "I like the concept, and when it works, it's very nice and also tiny. But its Wi-Fi issues out in our kitchen made me swap it out for my old Roku, which never seems to lose the signal like the Chromecast always did.We have only one other HD TV in the house (in the living room), and that's a SmartTV, so we don't need something like a Chromecast there. I haven't found a way to get it to work on an older CRT TV, though I suppose I could buy some sort of adapter to get it to work. But then it'll start to get as pricey as just getting another Roku, which I *know* works well anywhere in the house.", "verified": true, "helpfulness": "0/0", "author": "Linda M. Parker \"- aka Linda M. Au\""}, {"rating": 4.0, "review": "you cant use it to stream local content without an internet connection, which is frustrating. Otherwise it's great.", "verified": true, "helpfulness": "0/0", "author": "Screwyluie"}, {"rating": 2.0, "review": "Didn't work for us at all.  Sorry about that...", "verified": true, "helpfulness": "0/0", "author": "DorothyofOz \"DorothyofOz\""}, {"rating": 3.0, "review": "as expected", "verified": true, "helpfulness": "0/0", "author": "john baker"}, {"rating": 2.0, "review": "Voice is almost never in sync with the picture on TV. I did not like the product but I would say it is good piece of thinking to invent this.", "verified": true, "helpfulness": "0/0", "author": "itsmuqtadar"}, {"rating": 5.0, "review": "Would like to see more apps support this great product.", "verified": true, "helpfulness": "0/0", "author": "Jon Jamison"}, {"rating": 4.0, "review": "Works awesome from my phone, laptop, and desktop for streaming various apps and sites. Video quality isn't great if you are trying to stream a regular video file from a computer though. Otherwise you cant beat it for the value!", "verified": true, "helpfulness": "0/0", "author": "Mitchel L. Burton \"Jagg\""}, {"rating": 1.0, "review": "Faulty device, had to be sent back to Google and replaced with a new one.", "verified": true, "helpfulness": "0/1", "author": "Josephine"}, {"rating": 3.0, "review": "Wish it had more apps. Google says soon???", "verified": true, "helpfulness": "0/0", "author": "Pam Brandell"}, {"rating": 3.0, "review": "Thought I could use Chromecast to stream media from an iPad or iPhone, but apparently it only works with Androids and PCs.", "verified": true, "helpfulness": "0/0", "author": "Stranger"}]