[{"rating": 1.0, "review": "Miss leading, only works with certain aps, waist of money, smart tv has everything  google Chrome offers", "verified": true, "helpfulness": "0/0", "author": "Sherry Boles"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Jeremiah Carroll"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Homan"}, {"rating": 4.0, "review": "Sometimes there is a lag, but generally it works very well.", "verified": true, "helpfulness": "0/0", "author": "Jmac"}, {"rating": 1.0, "review": "I did not like Google Chromecast I could not get is to play on my TV. It was a wast of money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was easy to set up and streams better than our AppleTV.  It does have some limits (won't currently work over iphone wifi hotspot) but well worth it.", "verified": true, "helpfulness": "1/1", "author": "Kyle Taylor"}, {"rating": 4.0, "review": "I really liked this product.  I use this product for Youtube, Netflix, and Plex (all supported apps) and it is an amazing product.  Occasionally devices are a little slow to connect to it if you want to pause a movie but it isn't anything that I couldn't live without.  A few times I tried casting a chrome browser tab and it was okay but the video seemed to lag occasionally (why it got 4 instead of 5 stars).  Overall I really like this product and will be buying a second one for the TV in my living room soon.", "verified": true, "helpfulness": "0/0", "author": "Justin S. Scheretie \"dude\""}, {"rating": 2.0, "review": "withoutWithout mirroring it's a worthless piece of electronics... My phone and tablet and computers do all the rest. I bought it for those programs that don't normally stream and this thing DON'T WORK!! Waste of money!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Goldstein"}, {"rating": 4.0, "review": "We already have one, this price was too good to pass.", "verified": true, "helpfulness": "0/0", "author": "LibbiLay"}, {"rating": 5.0, "review": "One of the best devices of 2014! This is a great little device if you watch a lot of internet videos. Works with any laptop, Android, or iPhone. The compatible apps are growing constantly. Decent WiFi and internet are a must, otherwise you will have lag. Works great as a wireless speaker too, just hook it up to the HDMI port on your home stereo system, and viola! You have your stereo streaming Pandora. Overall, you should definitely consider this if you want to easily watch basically any internet video on your big screen.", "verified": true, "helpfulness": "1/1", "author": "Daniel Weaver"}]