[{"rating": 4.0, "review": "The initial setup stopped when the \"scanning for network\" came on the screen and then nothing else happened. I went through tech support (very nice, quick response) and wasn't able to get past that part of setup. I know my wireless network works and the box was close to the router and not in a cabinet per the online help/troubleshooting information. They sent me a new box overnight. Same problem.Here is the cause and solution: My SSID (network name) is hidden and there are no other networks close enough for the Fire TV box to pickup, so it couldn't progress to the screen for manually entering wireless information. Once I used an Ethernet cable to connect the box to the network everything started working. I unplugged the Fire TV box, relocated it to the television I wanted to pair it with, and then did entered the wireless network information.I like the voice search feature. There are fewer games than I hoped for, but more apps than I thought there would be. Overall I am pleased with it.", "verified": true, "helpfulness": "0/0", "author": "Z bear dune gal"}, {"rating": 1.0, "review": "My Internet not fast enough for this device", "verified": true, "helpfulness": "2/5", "author": "grandpa"}, {"rating": 3.0, "review": "right now I like the connection to Netflix", "verified": true, "helpfulness": "0/1", "author": "Sweet PEA"}, {"rating": 4.0, "review": "If your TV doesn't connect to the internet to stream shows then this may be what you need. I mistakenly thought it had internal storage for storing shows so I could play them back at a location with no internet. No storage made it no good for me but my sister-in-law got one and loves it. I will say that Amazon took mine back with no hesitation.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 1.0, "review": "Does not work properly. Ordered Amazon prime and don't get any shoes from it. The apps are slow and either don't show or loss properly. Was excited setting up but quite disjointed with results and customer service", "verified": true, "helpfulness": "2/5", "author": "Elmer Rodriguez"}, {"rating": 3.0, "review": "YouTube crashes very often.. Application interface is could have been more user friendly.. A smart phone app remote will be very useful.. Casting from phone or tablet is not smooth. Only good thing about it is the hardware", "verified": true, "helpfulness": "0/0", "author": "Naveen Kumar Mareddy \"kumar\""}, {"rating": 5.0, "review": "I bought one and had to take it back, it had to be plugged in every time to turn it on, and then it would freeze and not do anything.  I exchanged it for another  one, this one works great !I work a lot, and haven't got to do a lot with it yet.  I absolutely  love the cloud and having family slide shows on my TV, with Pandora in the background,  playing  music.  I also have it to watch my Netflix  on.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Overall the Fire TV is nice. The remote/Fire TV seems very sensitive. I'll be scrolling through the items on screen pressing the direction arrow one time for each item I want to scroll past and it will jump 2-3 items. It's VERY annoying when I am trying to type something it using the on screen keyboard.", "verified": true, "helpfulness": "0/0", "author": "S. Parks"}, {"rating": 5.0, "review": "Easy to operate and works great.", "verified": true, "helpfulness": "0/0", "author": "nora hanson"}, {"rating": 4.0, "review": "A friend has this item and very impressed.  But truly waiting for the Amazon Fire Tv 2.  Here is a list of what I think is essential to upgrade to blow the socks off the competition.1.  More user friendly to other tablet brands for mirroring2.  USB for external drive that plays media/ DNLA capability3.  Voice search engine for all content not just Amazon4.  Flash Drive accessory for downloading gaming apps up to 64gb5.  Ability to play AVI and MKV files.6.  Ability to play blue-tooth speakers or headphones (Market with Beats or Bose)7.  Ability to play blu-ray content8.  Bundle item with game controller and 1 year Amazon Prime and sale for $179 or something reasonable.9.  Allow for voice web browsing.  Amazon Shopping App might benefit from this.", "verified": false, "helpfulness": "0/0", "author": "Darrin Reid"}]