[{"rating": 3.0, "review": "There seems to be alot more to buy then are part of the prime membership.  I had to add Netflix  it appears a smart tv with Netflix might have been the better choice.", "verified": true, "helpfulness": "0/0", "author": "Katherine A. Craig"}, {"rating": 5.0, "review": "Highly Recommended, bought 2 now... Only can get better with new features. Voice control remote is a great feature, works well with even non native English speakers.", "verified": true, "helpfulness": "0/0", "author": "AlanG \"Alan\""}, {"rating": 1.0, "review": "too complicated to figure for a senior citizen", "verified": true, "helpfulness": "2/4", "author": "Sydell Bryant"}, {"rating": 3.0, "review": "Before any changes on my part I consider this a good product worked as expected, after side loading KODI / XBMC (no root needed)  and adding a couple apps I now consider this a great product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Hoping for more Apps from TV Stations (NBC, ABC, CBS).", "verified": false, "helpfulness": "0/0", "author": "Jermaine Williams"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Bryan Wooldridge"}, {"rating": 3.0, "review": "I was disappointed that several of the apps are not available if you are a Direct TV subscriber (such as the History channel or Showtime Anytime).", "verified": true, "helpfulness": "0/0", "author": "Pat Stendback"}, {"rating": 5.0, "review": "Works great.  The fact that you can sideloade andoid apps makes this thing worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Sean Pengra"}, {"rating": 5.0, "review": "i love my new fire tv. its easy to download apps and to stream. the only thing i wish is that there were somewhere to see all available apps out there instead of having to search for everything.", "verified": true, "helpfulness": "0/0", "author": "Ivyeyez"}, {"rating": 5.0, "review": "I love this device as it has replaced my apple TV and other devices.", "verified": true, "helpfulness": "0/0", "author": "Carlos Ramirez"}]