[{"rating": 5.0, "review": "After receiving my Chromecast, I was able to set it up in no time.  5 minutes after unwrapping the package,  I was broadcasting YouTube videos to my TV with ease.  Although the Google platforms and Netflix are the primary broadcasters (AT THIS TIME), everything and more can be found on YouTube, so that doesn't bother me.  As far as the price is concerned, you just can't beat it!  I watch videos from other sites through my Chrome browser and broadcast with ease to my TV as well.  If you're on the fence, I would highly recommend it.  You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 4.0, "review": "I bought this to broadcast shows that we missed.  Don't have a DVR; cost was excessive so I subscribed to Hulu to see and broadcast the missed shows.The problem is CBS shows, our most watched station, are not available through Hulu.So initially, I was a little disappointed that I couldn't cast tv shows from the laptop to the tv.  I Googled it and found there is an add-on app that enables you to broadcast from a laptop.This app isn't available for the tablet or smart phone.  The CBS app doesn't work with Chromcast.It's almost just as easy to watch the show on the laptop.I'm hoping Google will make an Android app available to solve this issue.", "verified": true, "helpfulness": "1/1", "author": "R. Banfield"}, {"rating": 4.0, "review": "It is a really good product, I would recommended... i hope by the time they add more apps to stream video", "verified": true, "helpfulness": "0/0", "author": "Fernando Gutierrez"}, {"rating": 5.0, "review": "great product. very useful for youtube and netflix. needs some polishing and a better app for computer but the apps for handheld devices are great.", "verified": true, "helpfulness": "0/0", "author": "richi3182002"}, {"rating": 5.0, "review": "Simple to set up and works great with Netflix and YouTube!I like it so much that I have just placed another order with Amazon so I can stream to a 2nd TV in the house.", "verified": true, "helpfulness": "0/0", "author": "jpcitylights"}, {"rating": 5.0, "review": "The internet is the source for all content. $35 + $8/mo is a whole lot better than $65/mo for commercials.", "verified": true, "helpfulness": "0/0", "author": "Brian Williams"}, {"rating": 5.0, "review": "Works great for streaming Netflix.  I look forward to plugins being released for Hulu and other streaming apps. Using my phone and tablet for control works well, and I don't have to worry about line of sight like my universal remote control that I have to fight with for my bluray player.", "verified": true, "helpfulness": "0/0", "author": "Orweller Family"}, {"rating": 4.0, "review": "It's great if you want a cheap, super easy setup, media streaming device assuming the only media you want is from Netflix, Hulu Plus, or Youtube. Google is not allowing any other content provider to utilize the Chromecast and there is no date for when they will, if ever.Otherwise:Setup: super simple.Hardware Requirements:Wireless networkHDMI input (on TV or entertainment system)USB (on anything for power, I use my cable box) or a power outletAndroid phone/tablet or computer. I use a Galaxy Tab 2 7.0.Whatever device sends the \"cast\" becomes the remote, so in my case I have to grab my tablet when I want to pause, which isn't that responsive. I can't image using a phone. Can your phone support the Chromecast? If you can watch Netflix smoothly then probably. For a computer you need Chrome (the browser) and some additional plugins, but again you will have to go back to your computer/laptop to pause, rewind, ffwd, etc.Supposedly you can cast any web page from the Chrome browser. I tried to cast Sleepy Hollow from my laptop and I got a very choppy video, so it didn't work for video. The rest of the web page looked fine if you line to look at a website on your TV.I'll give it a fifth star when I can stream my movies from my NAS.", "verified": false, "helpfulness": "0/0", "author": "Neal III \"Nealiii\""}, {"rating": 4.0, "review": "It's called a \"Chrome\"cast, so you MUST install the Google Chrome browser on your computer. It works as described and very easy to install.", "verified": true, "helpfulness": "0/0", "author": "marek@831"}, {"rating": 5.0, "review": "Turn your dumb tv into a smartTV.  But it will be better when it has more apps.  Right now it has Netflix and YouTube.  The cool thing is that once you get a show or movie going, you can pause it right from your phone.  The APP is in the ChromeCast, not your phone, but if they are on the same home network, you can control it.  The Beta cast from Chrome works, but with some delay.  Great for the money especially if you're a Netflix person.", "verified": true, "helpfulness": "0/0", "author": "Sutch"}]