[{"rating": 5.0, "review": "Amazing little gadget at an unbelievable price.  Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "James Colyer Guzman"}, {"rating": 4.0, "review": "Have to reboot quite frequently as the tablet and device aren't still in sync", "verified": true, "helpfulness": "0/0", "author": "Christon Kaiser"}, {"rating": 5.0, "review": "Excellent! Grate performance and very easy to set up!!", "verified": true, "helpfulness": "0/0", "author": "Juan Pedro Quiros"}, {"rating": 5.0, "review": "So far so gd. Make sure you have the latest mac operating system.", "verified": true, "helpfulness": "0/0", "author": "Patrick Wynne"}, {"rating": 5.0, "review": "Its a must, I cant see not having it now.  You could almost cut off your TV subscription and just send over form a smartphone or anything on that WiFi. Got one on every TV.  With Wonder Share Mobile I stream downloaded movies to the chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Marcus"}, {"rating": 2.0, "review": "Really awesome product. ... when it works. We have found it to be very touchy. I struggle to have my phone'find it' half the time even though it's clearly working on the television side of things.moving the tv inevitably ends ina huge battle to hook the chromecast up again because it gets confused. It's so touchy we often have to unplug our microwave to make it work. Excited for someone to come out with higher quality product with a similar price tag.", "verified": false, "helpfulness": "0/0", "author": "economicsdiva"}, {"rating": 5.0, "review": "I am so happy I got this.  I can stream any device in my house, including my computer!!!", "verified": true, "helpfulness": "0/0", "author": "Kiki Nana"}, {"rating": 3.0, "review": "It worked as expected, but by not having a dedicated remote (for my spouse and child to use - I was ok with using my phone to control it), easy access to Amazon Instant Video (you can Tabcast from a laptop), or consistent or reliable Plex performance convinced us to send it back and get a Fire TV stick (which should arrive today and we'll see if it's a better device for our needs).Also: the light on the Chromecast is bright.  Why would this be an issue?  Well, on our LG TV the Chromecast would turn off when the TV was off, but our Best Buy Insignia TV would always provide constant power to the Chromecast, which in our bedroom turned out to be a nuisance at night, especially when the Chromecast went haywire and started flashing the light.", "verified": true, "helpfulness": "0/0", "author": "M. Zolikoff"}, {"rating": 3.0, "review": "The device functions perfectly...  but I just don't like it much.  I gladly payed more to get an Apple TV.  Much more pleasurable viewing experience.", "verified": true, "helpfulness": "0/0", "author": "jfrazier"}, {"rating": 5.0, "review": "You need to have a VERY GOOD Wifi signal strength to use it. I had to set up a repeater.", "verified": true, "helpfulness": "0/0", "author": "Daniel Sánchez"}]