[{"rating": 2.0, "review": "Already own a Roku and can't help comparing Chromecast to the device I already have. I do not use any android or I-devices so controlling this device is using a chrome browser.Roku vs. Chromecast is night and day. 100s of channel vs. a handful? Idea is to avoid another remote but often a remote comes handy. FF, rewind, pause, etc. a remote is a better tool than re-launch  chrome, may be wait a second or two for allowing me to launch the menu a perform my action: not exciting.Roku + Plex far better than this product.", "verified": false, "helpfulness": "0/2", "author": "Safe Hot"}, {"rating": 3.0, "review": "Works like it says it does.  Setup was simple. Worked flawlessly on my Android phone and my Wife's iPhone.For me, it's like a neat idea in search of a problem to solve.  What you can watch is extremely limited. That may change, so I'm not getting rid of it, but still...Issues:You still have to fumble with the remote for the TV in order to turn it on and adjust the volume and change the input.  You might as well just get a Roku and a programmable remote.Should allow for headphones through the smart device instead of routing the sound to the TV.If you can play it on your smart device, using headphones or not, why not just do that?Tried to set it up on my desktop computer, but it wouldn't work because it said it needed WiFi.  WTF? My computer is 2 feet from the router and is hardwired to it for speed and convenience, but apparently if I want to send something from it to the Chromecast, I need to buy another USB WiFi adapter to transmit the 2 feet at a much slower rate just to make this work.", "verified": true, "helpfulness": "0/1", "author": "Grady Imel"}, {"rating": 3.0, "review": "It was not as good as i expected. Some times it is slow and also do not support web browsers.", "verified": true, "helpfulness": "0/1", "author": "Sardar Asad Ali Khan"}, {"rating": 5.0, "review": "This Chromescast is pretty awesome. Id recommend it. You will turn your flat screen into a Smart TV essentially. Keep in mind, you have to have the chromecast plugged into the HDMI and USB cable. They sort if misrepresent this fact. You should have a USB near your HDMI port on your TV, if not you have to have it plugged into the wall.Also, you need the Chrome Browser on your computer to cast non Cast video sources such as Sho Go or any website other than Netflix or Youtube which has the button to Cast directly. With the Chromescast extension you can cast anything!!!!!!!!!!!!!!!!!!Plus you can still use your browser while in FULL SCREEN Mode. JUST PRESS THE WINDOWS BUTTON!!! Best tip I can give you. I have my phone, kindle and laptop all setup to cast to my CHROMEY (thats my Chromecasts name..LOL). Buy IT now if you need it. I stop playing online games on my Xbox and only watched Netflix and Vudu with it.  The Chromecast has allowed me to ELIMINATE my XBOX LIVE SUBSCRIPTION!!!", "verified": true, "helpfulness": "20/24", "author": "DJ"}, {"rating": 4.0, "review": "This is really great, why does Amazon sell it but does not provide instant video on it? It's OK to make money selling the competitors product and screw your own prime customers......", "verified": true, "helpfulness": "1/2", "author": "Nerdy \"Kitchen junkie\""}, {"rating": 4.0, "review": "Casting from phone or computer has become a cinch.This is a great device to just shared with others.Hopefully Chromecast will be able to share anything on the computer in the future (5 stars), but from now only youtube and chrome tabs, hence the 4 stars.Would recommend anyone to buy this.", "verified": true, "helpfulness": "1/1", "author": "Sean F Chan"}, {"rating": 1.0, "review": "Very poor product google. Does nothing more than stream Netflix and Youtube from mobile devices. You can apparently do more  with a pc. If your pc has hdmi, you can cast anything the pc has with just a hdmi cable, no reason to have this piece of hardware. Very minimal functionality. If you fancy doing more than playing netflix or youtube from this device, please save your money", "verified": true, "helpfulness": "8/12", "author": "Shankar B. Kolinjavadi"}, {"rating": 5.0, "review": "If all you use your set top box (Roku, Apple TV, Tivo, BluRay) or smartTV for is Netflix, YouTube, HBOGo, and you always have your phone on you...Then, this can replace them and be much easier and faster to use.  Plus, it makes quick 'hey check this out' moments much easier for showing those videos on YouTube.Yeah, it's super cheap and portable too.  Love this little thing and looking forward to new features and new apps that support it.", "verified": true, "helpfulness": "0/0", "author": "Nate S"}, {"rating": 5.0, "review": "Love this thing! I did not like the idea of having to plug it in, when I plugged it into the USB port, the volumn went out on my new tv, but a simple restart fixed that. After I got it running, I love the thing! Watching Netflix or YouTube is simple as touching the chrome button, highly recommend this item.", "verified": true, "helpfulness": "1/1", "author": "Andrew Riemer \"Chiefsadr\""}, {"rating": 5.0, "review": "I ordered the Chromecast on Friday Evening from my iPhone.  I was away on Saturday, but when I came home on Sunday, the package was in my mailbox!  My account shows that it was delivered on Sunday, but I don't normally get Sunday delivery.  I was amazed!  Kudos to Amazon for such a quick response!The setup for the Chromecast was fairly simple.  I plugged it into an empty HDMI port on my TV and plugged the other plug (connected with a separate plug from the opposite end of the HDMI plug) into a USB port on my TV.  The device is powered through the USB port (an optional power cord is provided to plug into an outlet).  I then ran a setup app from my laptop which found the Chromecast through my network and set everything up.  This took about 15 minutes.  The app placed a \"Google Cast\" icon on my Google browser that enabled me to \"cast\" content  from a tab on my browser.  In addition, I was able to stream content from HBOGo, Netflix, YouTube and Pandora to my TV.  I watched a show on HBOGo and was able to switch to another tab to surf the internet while the show continued to play.  Pretty neat.  To playback from an iPhone or iPad, you download the Chromecast App and you can stream content from these devices via your home WiFi setup.  You run the original setup once and then just install the App on other devises and you get the \"Cast\" icon on the additional devices.  It doesn't get much simpler than that.The device doesn't everything I'd like it to do, but it's pretty good for the price.  For instance, I can't stream content from my NAS drive to the TV, but I have a WD TVLive that does this just fine.  Also, I have to go back to the particular app, such as HBOGo, to control playback, but these are minor issues given the price of the device.  Kudos to Google for creating such an inexpensive device that delivers as advertised.  Hopefully, support for more applications will come in the future.", "verified": true, "helpfulness": "0/0", "author": "William Stasinopoulos \"BankerBill\""}]