[{"rating": 3.0, "review": "Pros: Quality is great and 2 gigs is screaming fast.I gave it three stars because it won't stream for our purposes at work. None of these streaming devices (apple tv, roku, fire tv) so far can stream a YouTube Live Broadcast. Something something video encoding something. I had hope for the Fire TV since it uses Miracast and not broadcast for screencasting. Broadcasting isn't allowed on our university network, too many security issues. But as far as I can tell, the Fire TV will only stream through Miracast to Amazon phones and tablets, and we are using thinkpads and nexus 7 as our mainstay tablets in my department. GG Amazon, love that proprietary hardware.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Still trying to figure it out ;(", "verified": true, "helpfulness": "0/4", "author": "Martha"}, {"rating": 3.0, "review": "Its probably the best overall option I've had and I have owned them all.  Even several XBMC box's I setup.  The biggest disappointment and the main thing I was gaining by getting this was voice search.  It only works in amazon prime area.  It dont work on youtube(super disappointed and the main thing I wanted), netflix, plex, or anywhere that matters for me.  So its as if the feature doesn't exist at all.  I have heard netflix will be supported eventually but youtube and plex likely never will.  If you are getting this as an upgrade from another media box and voice search is the main thing that appeals to fire tv then maybe its not actually worth it.", "verified": true, "helpfulness": "0/1", "author": "K. Alten"}, {"rating": 5.0, "review": "I was in the market for a second Roku when the Fire TV came out.  Decided to buy this instead.  Have been very happy with it.  My kids love playing Minecraft PE on it (and other games).  We watch Netflix, Hulu, YouTube, and Prime Videos on it.  Only one thing I would like is a Vudu app instead of having to use Flixster to access my UV library.", "verified": true, "helpfulness": "0/0", "author": "mxduppup"}, {"rating": 3.0, "review": "I received the product yesterday. So far, there have been bumps in the road with the two apps I've attempted to use.1) WatchESPN loads as if it is going to play but freezes on the live feed.2) I tried to set up Spotify and found that the device does not have a true Spotify app. It can only stream from another wireless device on the same network. Further, I hard wired the device. This renders the Spotify app useless since my phone can only \"see\" Wi-fi devices on the network.I hope there are no other \"quasi-apps\" lurking out there that depend on some other device for their functionality. I'd also like to hear when (not if!) Amazon plans to correct the Spotify mistake and make it a full featured app on the system.I had high hopes for this product. The reality is underwhelming so far. I hope I will get to update this review with more positive comments as I dig deeper into the system.", "verified": true, "helpfulness": "0/1", "author": "Jared"}, {"rating": 5.0, "review": "Works great so far.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "awesome streamer 1000% better than my old one we love it!", "verified": true, "helpfulness": "0/0", "author": "Deborah S."}, {"rating": 5.0, "review": "Easy to use and some great shows streaming on Prime.", "verified": true, "helpfulness": "0/0", "author": "Shirley Gitler"}, {"rating": 5.0, "review": "Perfect!Installs in seconds, intuitive remote . . . who could ask for more/", "verified": true, "helpfulness": "0/0", "author": "Gil Miller \"CrowMoon Studio\""}, {"rating": 2.0, "review": "Initially, we were so pleased with the Fire that I ordered two more.  Big mistake and waste of money. I've lost count of how many programs that were available via Prime were removed from the Prime free instant video group before I could finish watching one season. It feels very much like bait and switch, since it was the Prime free instant video selection that sold me on the Fire.In some cases, we've found it was cheaper to buy DVDs than to purchase shows/movies through Amazon Instant Video.In addition to content disappearing from the Prime group, the Fire itself has been a pain.  We've had to reboot all of ours repeatedly.  They freeze up, fail to load the watchlist, and/or fail to function at all without being unplugged and restarted.When we lost some of our favorite programs from the Prime group, we checked out videos through YouTube.  We can watch shows and movies on YouTube via an old TiVO in our home theater without any problem.  When we try to do the same on the Fire, it inevitably freezes up and shows the loading icon after about 10 minutes.  The rare times we can restart and get past the initial stopping point, it will freeze again in 5 - 10 minutes.  We've tried pausing the programs at the start to allow more time for loading to see if that helps, but no luck.This week we finally gave up and called the cable company to reinstall our service.", "verified": true, "helpfulness": "0/2", "author": "SouthernHome"}]