[{"rating": 5.0, "review": "I truly love my Amazon fire I love the convenience of being able to use  the remote to find everything from movies and music; which are clearer and brighter! the reception on the Amazon Fire is clearer and brighter I will recommend the Amazon Fire to all my friendsI Thanks for your promptness my Amazon Fire arrived on time! I love shopping on Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Bought this so I would have a device which supported a number of the streaming services I use. It was not as inexpensive as several other options, but had the best combination of technology and cost (caught it on sale for $84). I have it connected to my internet service by ethernet, use HDMI to deliver the picture to the TV and optical digital to send sound to the receiver (did not do thorough due diligence and thought it had coaxial digital, but was able to use a front input). It would be a nice feature to have a USB port for pictures.Very intuitive to set up and get started. The tiny remote could be easy to lose, but it is as simple as it can be. Good picture (I have 1080i, so must choose 720p) and surround sound. Don't use for gaming, just TV, music and pics.", "verified": true, "helpfulness": "0/0", "author": "Chris in Texas"}, {"rating": 5.0, "review": "So easy to set up!  I love the wide choice of content.  It is easier to use than my provider's on demand!!", "verified": true, "helpfulness": "0/0", "author": "Kim Policastro"}, {"rating": 4.0, "review": "Was very easy to setup.  Wish there was a search feature.  I also don't understand if I'm paying for Amazon prime why do I have to pay extra for new release movies?", "verified": true, "helpfulness": "0/0", "author": "JoAnn Malauulu"}, {"rating": 5.0, "review": "As good as the other brand, even better if you have prime. The quality of the picture is excellent", "verified": true, "helpfulness": "0/0", "author": "Johncski"}, {"rating": 5.0, "review": "We have Roku 2 and Amazon Fire.  Amazon fire is by far way faster to stream.  The picture quality is wonderful.  Look forward to buy a second fire TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this", "verified": true, "helpfulness": "0/0", "author": "a.s."}, {"rating": 5.0, "review": "I haven't opened it yet but sure it's perfect", "verified": true, "helpfulness": "0/0", "author": "itzKat \"Kat\""}, {"rating": 5.0, "review": "We are really enjoying our new Fire TV.  We ditched the cable company.", "verified": true, "helpfulness": "0/0", "author": "Carroll Clan"}, {"rating": 4.0, "review": "The first one they shipped didn't work, so they sent me a new one \"free of charge\". I mean really why would you say that if the issue wasn't my fault. Over the phone they never said anything about returning the unit. Next thing I know I have a charge on my account for the new one. I had to call to get a return labe. All in all I have enjoyed the amazon tv.", "verified": true, "helpfulness": "0/0", "author": "Jon R."}]