[{"rating": 4.0, "review": "Very cool technology - I like it a lot. Works quite well with my smartphone, tablet and my desktop. Would recommend to a friend.", "verified": true, "helpfulness": "0/0", "author": "John P."}, {"rating": 4.0, "review": "We've had some problems with the interfaces on other machines, but most of them are fairly minor. Overall it does what it claims pretty well. There seem to be more partners every few weeks.", "verified": true, "helpfulness": "0/0", "author": "Adam C. Lawson"}, {"rating": 5.0, "review": "I now have two of these and I find them really useful. The app works great from all of the devices I have including Android phones, iPhones, iPads etc.", "verified": true, "helpfulness": "0/0", "author": "Anthony J Sheehan"}, {"rating": 4.0, "review": "Quick and Easy configuration/installation.5 ⭐if there where more apps that support chromecast. Fast and no hangups, clear and bright image.", "verified": true, "helpfulness": "0/0", "author": "Ola harrius"}, {"rating": 4.0, "review": "Love it, but my husband says you can't purchase movies from iTunes.If it does & we are just technically challenged, then please tell me & I will definitely give 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Debbie Moran"}, {"rating": 4.0, "review": "It would be good, if your TV came with additional HDMI slots and you can have one dedicated solely for it.  It sets up real fast but I am giving it one star less due to its lack of application.I am using a Samsung Note 2 and there's not many apps that can help project the photos in my phone easily.  Other than that, its easy to run Youtube.  There are other apps like Plex but I don't want to spend extra if I am only using it now and then.", "verified": true, "helpfulness": "0/0", "author": "ROY CHAN"}, {"rating": 5.0, "review": "Awesome device. Use it so much already. Flawless streaming, easy setup, no skipping, buffering, or long load times. Makes watching Netflix and HBO Go easy on the TV", "verified": true, "helpfulness": "0/0", "author": "SuperDuty"}, {"rating": 2.0, "review": "The good features are limited by Google to make this a second class player. The things I wanted to use it for can't be done. I wanted to receive photos and videos I have on my MacBook Pro or Sony Vaio laptop and I can't do it.I bought an Apple TV instead and can do what I want.", "verified": true, "helpfulness": "0/0", "author": "rgr1444"}, {"rating": 5.0, "review": "It's still quite limited in term of features but there are workarounds with third party apps like Avia that allow you to view your photos and videos. Perfect for YouTube and Netflix and so simple to set up!", "verified": true, "helpfulness": "0/0", "author": "Cris"}, {"rating": 5.0, "review": "This little gadget is amazing!!  We have a 36\" Flat Screen TV and can't afford Cable; we put Netflix from my Laptop to the screen..  No more Squinting at an 11\" screen.  I don't have to pay $75.00 a month to a greedy cable company, merely $8.00 to Netflix and the one time payment for the \"Google Chromecast\".  This is Wonderful!! Thank You.", "verified": true, "helpfulness": "0/0", "author": "MomOf5NanaOf4"}]