[{"rating": 5.0, "review": "Not as complete a kit as a Roku or Apple TV, since there is no remote, but it is the biggest \"bang for your buck\" for those that want to bring \"smart tv\" features to an older HDMI capable tv.  One of our Panasonic plasma panels did not have any wi-fi features or apps, so the Chromecast was very inexpensive upgrade to the panel.  We also had a barely used Nook HD tablet to employ as a remote and streaming source.  The Nook does not have bluetooth or an IR blaster, but since the Chromecast uses wi-fi for controls, it breathed new life into the tablet as well.", "verified": true, "helpfulness": "0/0", "author": "M. Ichiyama"}, {"rating": 5.0, "review": "Amazing for $35, I have a roku 2 and a roku 3. Chrome cast is great for the TV in the kitchen and as a media TV next to my computer. But I prefer the roku for the living room and the roku is easier for the parents to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "awesome device.  easy to setup. from the time I took it out of the box to installing the app on my phone, no more than 10 min to setup.", "verified": true, "helpfulness": "0/0", "author": "Ivan Escobar"}, {"rating": 5.0, "review": "the product is of good quality.I hope to continue with you .thank you", "verified": true, "helpfulness": "0/0", "author": "Alexander Lozada"}, {"rating": 5.0, "review": "Best little device to send things from any of my devices up to the big screen with ease. Thanks Google!", "verified": true, "helpfulness": "0/0", "author": "Jason E. Davis \"Fireytitan\""}, {"rating": 4.0, "review": "It works great if your wideband does", "verified": true, "helpfulness": "0/0", "author": "Alejandro Pérez Villaseñor"}, {"rating": 5.0, "review": "Wonderful device,  great for netflix, YouTube,  google play, casting to TV", "verified": true, "helpfulness": "0/0", "author": "L.P."}, {"rating": 4.0, "review": "Full of mysteries and changes every day.. a great option to explore the frontier beyond the \"Smart TV's\"", "verified": true, "helpfulness": "0/0", "author": "Jamhil Moyano"}, {"rating": 1.0, "review": "\"Stream anything onto your tv\"?\" Yeah, right. You just use phone apps on your smartphone and it connects to your tv (completely useless if you already have a smart tv or internet tv). They replaced GoogleTV (which they clearly ended support for) with this crap. They don't back up their products and will leave you, the customer, in the dark. Stick to software and programming and stop trying to make crappy hardware, Google.", "verified": true, "helpfulness": "2/3", "author": "H. A. S."}, {"rating": 5.0, "review": "Works perfect. Thought it would be laggy/low res at first, but it's absolutely amazing. Easy setup, plugged it in, was good to go 5 minutes later.", "verified": true, "helpfulness": "0/0", "author": "Micdog"}]