[{"rating": 1.0, "review": "Well...I just got my hands on it right now....setup was fast and kind of easy...but...BUT...I am having issues with the netflix cast....something is wrong...and the online help is not HELPING AT ALL...I already emailed their support department...lets wait and see what they will tell me....and yes...I made sure I had all the software involved up to date...I am trying to use it with a Samsung tablet (Android) and an iphone (just downloaded the chrome cast app and netflix app to it)..all netflix versions work fine WITH THEIR RESPECTIVE DEVICES...as soon as I click on the cast icon....things go downhill....another thing....it runs really HOT...I am concerned about that...UPDATEI got frustrated and angry...support will only advise me to \"reboot\"which I already did...I tried it with and android device and with iphone device...same results for the netflix problem...I upload a video...I am sorry...I mix spanish/english languages on my talk...but you DO GET the idea !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Such a great product--affordable and made well! One thing specifically I love about it that isn't in the product description is that it is narrow enough to not hinder its neighbor plugs. A lot of times these bigger plug-ins will use one plug then cover up all or part of another one.", "verified": true, "helpfulness": "0/0", "author": "Laura Johnson"}, {"rating": 5.0, "review": "I purchased my Chromecast on a Wednesday 11:30P Black Friday special for $29.99. I am not looking back at all on this nice little device. It is great! I have plugged it into an Onkyo receiver that has multi HDMI slots. I use my front Aux HDMI port and plug the USB power cord (required) in to the USB port on the front of my Onkyo device. I was very happy about that easy front-side setup.Problem, but resolved it, not an issue with Chromcast, but with my local home network setup. The initial setup was easy, recognition was fast, however because of the setup of my WIFI I had a little hiccup. Maybe my mention of my problem can help others ... I have a Cisco EA4500 Wireless router (love it!) and the initial setup creates two ranges, 2.4ghz and 5ghz, but not only that, it puts the same name \"newtorkssidname\" (as an example) for both ranges. As a computer application developer, the error \"\", seemed to me to be something about \"finding\" the wireless. Knowing that I was connected, using my WIFI DLNA that I wasn't having problems connecting. So, I had a sneaking suspicion that the Chromecast could decipher between using 2.4ghz and 5ghz using the *same* network SSID name. So, I while I was trying to Chromcast connect, I changed the 5ghz name from \"networkssidname\" to \"networkssidname2\" to give it a unique name for that channel. And voila, it starting casting from my Android device, immediately.Ever since I've had it, I've been to my friends house, parents house, around my own house on TVs that are not connected to my cable boxes and am streaming through Amazon Prime (love it!), Hulu+ (love it!), Netflix (love it!), Google Chrome (extension) and will become more de-coupled from my satellite cable box (love it, but it's getting too pricey and lacking variety like I can get from the other three). There's no lag, very crisp and clear. My 1080p screen is awesome, music casting from Google Music (love it!).The devices/software I'm casting with are Windows (Vista, 7), Mac, Android (HTC One, Nexus 4, Nexus 7), iPhone (5c), Kindle Fire HD, Google Music. Unfortunately, Amazon Prime is not a casting option.", "verified": false, "helpfulness": "0/0", "author": "Greg Wright"}, {"rating": 5.0, "review": "Really impressive and clever technology in a small, inexpensive package. We've had ours for only a couple of days now, and it's improved the way we're using our TV. In particular, the kids can now share their favorite YouTube videos with the whole family instead of insisting we all huddle around their laptop or iPod.Setup was very easy.We also have a Tivo, which we use for (among other things) streaming Netflix. The Chromecast's video quality with Netflix isn't as good as the Tivo's, probably because the Tivo's Internet connection is wired, and the Chromecast is WiFi. Definitely not a deal killer for us.", "verified": false, "helpfulness": "0/0", "author": "A. Wait \"artwait\""}, {"rating": 4.0, "review": "It was super easy to set up and works as stated. It would be great if it were capable of streaming any content instead of specific apps.", "verified": true, "helpfulness": "0/0", "author": "Danielle Jordan"}, {"rating": 2.0, "review": "It only lets you connect to a few limited web-based services. No access to browser, etc.  $35.00 down the drain for a promising technology!", "verified": false, "helpfulness": "0/0", "author": "mikea"}, {"rating": 3.0, "review": "Netflix and recorded youtube video streams work perfect on Chromecast. Setup itself is very easy and one can keep adding devices that you can cast from as long as they have google chrome on them. But the biggest downer for me was lack of integration with Amazon Instant Videos. There is a hack to uninstall silverlight and force AIV to use Flash but that experimental cast is extremely annoying. It disconnects every now and then and its annoying to see the video run on both your device and TV and many times TV frames are few fraction seconds behind. Same with live stream from youtube videos. I was so prepared to cast a live cricket game and was completely turned off by its unresponsiveness. Overall I regret not buying a Roku player instead.", "verified": true, "helpfulness": "0/0", "author": "AK"}, {"rating": 1.0, "review": "I was under the impression that I could plug this into my TV quickly, easily, and have access to all my Internet stuff.  I have an older DLP HDTV, so it's becoming more trouble than it's worth!  Very frustrating, it took time and research to figure out, it won't play on my TV without another $40 adapter!  I would not suggested it for people who are not good with technology, or don't have someone to help them.  Also not so great for us seniors who are on limited budget!Anita", "verified": true, "helpfulness": "1/2", "author": "A. J."}, {"rating": 1.0, "review": "Let me know if the class action suit gets rolling. I am a fan of Google, but this device way supposed to allow me to cast anything from Chrome to the TV. Not the case. You tube and netflix?  I do not want to post my videos on YouTube and NetFlix lame, and another monthly fee.I am significantly disappointed but more than anything it will make me question a future purchase of Google products if they continue with this : sell it one way and then mandatory update it to strip it of its great functions ... I bet there is another product coming to sell those features back to the public.That is just plain criminal!", "verified": false, "helpfulness": "1/5", "author": "Darrell DeShaw"}, {"rating": 5.0, "review": "Easy to use, great option for getting rid of cable and more streaming options should be available soon.  I like it.", "verified": true, "helpfulness": "0/0", "author": "Jorge Fernandez"}]