[{"rating": 2.0, "review": "Not many apps support chromecast unless you are using youtube and paid content provider apps. Think about Apple TV if you are an Apple fan.", "verified": true, "helpfulness": "1/4", "author": "DN"}, {"rating": 5.0, "review": "Does what it says it will and now even more services are coming online with it. I got in at the right time and had it early with one for each HDTV.", "verified": true, "helpfulness": "0/0", "author": "Avid Reader"}, {"rating": 5.0, "review": "THis item works very well, a little odd, that the movie actually palsy via the I[ad and image is then sent to tv using the CHromcast,but once installed works great.Little slow to boot up but then plays with out interruption", "verified": true, "helpfulness": "0/0", "author": "jerry w abney"}, {"rating": 5.0, "review": "I love being able to control Netflix and You Tube on my high def televisions using my phone or tablet.  Easier than doing it through game consoles.  VERY easy to set up and use.  Great picure quality.  I have bought 2 of them and will soon be buying 2 more.", "verified": true, "helpfulness": "0/0", "author": "Mir"}, {"rating": 2.0, "review": "it's great when it works.  it's been very glitchy and lagging.  now it's stopped working entirely.  very disappointed.  thank goodness for the warranty.", "verified": true, "helpfulness": "1/2", "author": "Paula Mcdade"}, {"rating": 2.0, "review": "Very bugging device...It only cast at the lowest level and even then does not work.  i have been emailing back and forth with Google support now for 11 days.,When it works great...but just tried restarting it 5 times and just getting a black screen, I have reset my network updated firmware on my chromecast and router. Tried multiple computers etc.When it works I will be very happy to buy one and use it daily right now I think I am going stick with Roku.", "verified": true, "helpfulness": "0/1", "author": "Dewolf"}, {"rating": 4.0, "review": "Works great, easy to install....if you have a use for it GET THIS.  I don't use it as much as I thought I would but i'll start incorporating it more and more.", "verified": true, "helpfulness": "0/0", "author": "chris moorhead"}, {"rating": 4.0, "review": "I really like it.  If I caould watch Amazon streaming movies on it,I'd like it even better,  It was easy enough to set up and use, but I'd like to be able to watch something besides Youtube with it.", "verified": true, "helpfulness": "0/0", "author": "Michael B. Patterson"}, {"rating": 5.0, "review": "Perfect! I don't need and HDMI to micro-HDMI cable and be far from my tablet just because I want to see netflix.", "verified": true, "helpfulness": "0/1", "author": "Luiz Felipe Silva"}, {"rating": 3.0, "review": "Good Product, but needs more apps, in iOS just youtube and netflix, in windows supports google chrome, when chromecast let send streaming of photos, movies, to tv would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Aldo Christian Monraz \"AMONRAZ\""}]