[{"rating": 1.0, "review": "Extremely limited in it's possibilities. will only work with Google applications. Also not easy to configure. Only good for users of Google docs.", "verified": true, "helpfulness": "0/0", "author": "Víctor Hernández"}, {"rating": 5.0, "review": "This is excellent and stay's hidden, I donated our Sony streamming box because I get more out of this and there are no wires and remotes I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "AJ M"}, {"rating": 5.0, "review": "Very good product for a very cheap priceIt is a must have item in any house,  will enjoy it", "verified": true, "helpfulness": "0/0", "author": "Heriberto Olivares"}, {"rating": 5.0, "review": "Great price and shipped really fast.  Product works great!  I want to but more for my other televisions so I can jump to which l whichever tv I want!", "verified": true, "helpfulness": "0/0", "author": "gFoRcE"}, {"rating": 2.0, "review": "The Google Chromecast HDMI Streaming Media Player is an inexpensive alternative to units made my Roku and Western Digital.  The savings is not worth the additional effort required for EVERY use.  All viewing selections must be made independently on a PC as opposed to the other streaming video players that have remote input units.", "verified": true, "helpfulness": "0/1", "author": "John N."}, {"rating": 3.0, "review": "Great product but make sure you have fast WiFi otherwise the video will be choppy making watching movies very painful.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Vanmeter"}, {"rating": 5.0, "review": "Set up takes a while, but once set up, works perfectly with my Chromebook.Great little gadget for the money. Does appear to get warm.", "verified": true, "helpfulness": "0/0", "author": "ASDG"}, {"rating": 5.0, "review": "Chromecast have performed well beyond expectations, and worked well with another one and across network with a plex server providing local content.", "verified": true, "helpfulness": "0/0", "author": "WTM"}, {"rating": 4.0, "review": "Excellent but can only broadcast from specific applications and cannot show everything from mobiles. For example you cannot broadcast soccer matches from beIN sport", "verified": true, "helpfulness": "0/0", "author": "ABDULLAH ALMAATEEQ"}, {"rating": 4.0, "review": "Good thing but it took a day to install it in the hotel (see below).You can share from several apps only.For Windows there is a workaround - you can share from chrome specific tab or the whole desktop---------------------Hotels often have additional authorization to wifi and chromecast CANNOT deal with it.I searched how to resolve it but did it by myself:1. on laptop download app which can create a wifi hotspot (not every works. For me Connectivity works great)2. connect to your Chromecast from another device (I used my android phone) using the hotspot from you laptopYou cannot connect to chromecast from laptop because during installation chromecast app temporary disconnects all other connections.After initial installation will be done you can use your laptop to connect to chromecast too.", "verified": true, "helpfulness": "0/0", "author": "Sergiy"}]