[{"rating": 3.0, "review": "It's very simple to start to use. Only one thing is that you need to un-plug it from your TV if you don't use it. It will interfere the TV (Samsung) reception. When you have it to plug it to TV and just watching TV, then often on the reception appears interrupted.", "verified": true, "helpfulness": "0/0", "author": "sha1123"}, {"rating": 5.0, "review": "The only downside I see in this product is that you must ALWAYS have the mobile device or computer available to get the content. There is no remote to get you into content a La Roku. But then again this device is increadibly affordable. I can cast content on my mobile and walk away or open a tab in my Chrome browser and do some other activity while the movie or video is streaming in another room (must be on the same network wired/wireless or combo doesn't matter). I've also found a way to use plex to stream local media content from my local network, great for home movies!Again, I half wish this had a remote seperate that I could browse the network from but then I guess that defeats the idea of CASTING.", "verified": true, "helpfulness": "0/0", "author": "W. Stoddard \"Certified Genius\""}, {"rating": 5.0, "review": "I bought many as gift for friends, home use and all my friends love it. Easy to setup, connect flawless and no need wired connection from laptop/phone/tablet to the TV.", "verified": true, "helpfulness": "0/0", "author": "Sweetboy"}, {"rating": 3.0, "review": "Its pretty cool for Netflix and Hulu and Youtube. Find something you want to watch on your phone and \"cast\" it to the device. Lack of Amazon Prime support is a big disappointment.", "verified": true, "helpfulness": "0/0", "author": "Kevin Joubert"}, {"rating": 5.0, "review": "Despite my interest in casting Chrome from my computer, my first trial was casting Netflix from my phone. It worked beautifully, and I was very happy with my purchase... until I got around to casting from Chrome. That was an utter failure. We've got enough bandwidth that streaming video has never been a problem", "verified": true, "helpfulness": "0/0", "author": "Saad"}, {"rating": 5.0, "review": "Great product. I take it every where I go, I guess u could say I am a pretty good salesmen,  almost every I have shown and demostrated it to have also purchased one.", "verified": true, "helpfulness": "0/0", "author": "shouright"}, {"rating": 2.0, "review": "Several mainstream popular routers are unsupported. Making this far from plug and play. Its ok, but honestly there are much more versatile and easier / cheap alternatives", "verified": true, "helpfulness": "0/0", "author": "VulcanJedi \"transcender\""}, {"rating": 5.0, "review": "This is the kind of toy (and for work of course) that i expect from Google, i love it! Thanks", "verified": true, "helpfulness": "0/0", "author": "Tractorman"}, {"rating": 5.0, "review": "great item for the price. i had bought two at the same time and i love the quality and respond. i wish they would work better after 4 hours of playback .", "verified": true, "helpfulness": "0/0", "author": "Mblessing"}, {"rating": 1.0, "review": "it sucks don't buy. takes forever to connects and when it does it only work for one episode. (don't buy)!!", "verified": true, "helpfulness": "1/2", "author": "Leander Galicia"}]