[{"rating": 2.0, "review": "I wanted to see if it was superior to my Roku 3, and it is not by a wide margin.  If you cannot afford the Roku than it is a decent alternative", "verified": true, "helpfulness": "0/0", "author": "W. Wright"}, {"rating": 5.0, "review": "I love Chromecast.  I works everytime.  I don't have a problem with it stopping and reloading constantly,  I had this problem before and with Chromecast it just doesn't seem to happen.  I bought a second one for my bedroom after I decided I liked it in the living room.", "verified": true, "helpfulness": "1/1", "author": "Terri Heath"}, {"rating": 5.0, "review": "This dongle is definitely worth the price, and there is no subscription fee (except for subscritption fees necessary for Netflix, Hulu Plus, etc). Before we had to run an HDMI cord to our television from our laptops to play movies from Netflix on the big screen, which was cumbersome and annoying. The only draw back is that it doesn't allow all media being viewed to be streamed to the television. However, even in the six months or so we have had the Chromecast, Google has expanded the number of applications that are compatible with it and will hopefully continue to do so. Even those, like my partner, who struggle with technology will find this easy to operate.", "verified": true, "helpfulness": "1/1", "author": "Wherethepeachesgrow"}, {"rating": 3.0, "review": "When I try to stream videos from my Synology NAS Chromecast can not play most of the formats.  The application support is also still very less.  From a Samsung android tabled using chrome browser I can not cast.  They are working on a beta for this.  I tried the beta, it is very unstable and crashes the tablet.Overall this is a great idea.  I still love that I can stream from youtube, etc.  But a lot more can be done with this product.  I see third party individuals or companies do much more with chromecast.  The example is the \"Allcast\" application in Google play.  Another individual wrote an application to cast any video from desktop, Google banned this.  This makes one wonder whether Google purposely does not want to provide full capabilities of chromecast.  If individual developers can unleash the capabilities of this device,  I am sure that Google can do much more.  The question is why are they not doing?", "verified": true, "helpfulness": "0/0", "author": "kj287 \"kj287\""}, {"rating": 4.0, "review": "I purchased the Chrome because I was thinking of returning my Amazon Fire.  I decided to keep the Fire and because the Chrome was so cheap I just kept it too.  All my friends love the Chrome, but honestly, I don't like it nearly as much as I do my Roku or my Fire.  But it keeps me from running a long HDMI cable across my bedroom when I want to watch HBO Go (which Xfinity doesn't allow on my Roku or my Fire.) All in all, it does what it says it will do, it is well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Ms. Pam \"I love technology, reading, music, and shoes (not necessarily in that order.)\""}, {"rating": 5.0, "review": "Just buy it. Its worth the price and addicting to use. More application will be added eventually and its cheaper than a Roku.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 2.0, "review": "I tried the Chromecast on our home network where we are subscribers to ATT DSL service.  The dongle was easy to install but the network load bogged down too much that the video was jerky and the audio was off track.  When I direct wired the same laptop to the TV via HDMI cable, all the problems cleared up and the program was displayed exactly as normal, leaving me to believe that my network load was too much to use the device successfully.  I like the concept, but it wouldn't work for me.Also, I tried to use this device from my Mac laptop but was never successful at achieving the link between the Mac and Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Bill Zaspel\""}, {"rating": 5.0, "review": "I love this thing. It's making our tv watching so much easier. We use mostly with netflix, haven't had any problems, and will purchase more for additional tv's.", "verified": true, "helpfulness": "0/0", "author": "Tam Ferg"}, {"rating": 2.0, "review": "Too slow for streaming something from chrome.  And it only lets you stream from the chrome browser which makes it very limited to use", "verified": true, "helpfulness": "0/0", "author": "Priyank"}, {"rating": 5.0, "review": "I plugged it in and after some initial updating, I was presented with a clear 1080 HD photo-stream, which is the default Chromecast \"ready\" screen.  Using my laptop or phone (both have been setup for use), I start Google Chrome, or the Netflix app and tell it to cast.  What was on the phone or laptop quickly appears on the HDTV.  Using it at two different homes (one with only 6 Mbps download speed), the streaming is clear, full HD and almost NEVER has any pauses or hiccups. I am very happy!Other than the Netflix app, I have only tried some direct TAB casting from Google Chrome, with works great while surfing or reading email.I see Google is working hard at creating more apps and I hope we see Amazon Prime??, ESPN and others in the future!", "verified": true, "helpfulness": "0/0", "author": "mbotts"}]