[{"rating": 5.0, "review": "It came in 2 days and works just fine.", "verified": true, "helpfulness": "0/0", "author": "Steve Flammer"}, {"rating": 5.0, "review": "This just gets better with every software update. For 35 bucks, any TV with a HDMI port becomes a smart TV. You will need an android device to use. I have two if these and love them.", "verified": true, "helpfulness": "0/0", "author": "Justin L"}, {"rating": 5.0, "review": "There are issues about not having some apps and what not, but being able to stream right from Google Chome is worth it all.  I bought one for myself, liked it so much I bought one for my mom.  Will be buying one for my Aunt soon!", "verified": true, "helpfulness": "0/0", "author": "binkisoto799"}, {"rating": 5.0, "review": "Bought as a gift for Christmas, for my daughter  it was a great price , she loved it , I am thinking of buying one for me", "verified": true, "helpfulness": "0/0", "author": "joe in virginia"}, {"rating": 3.0, "review": "I guess I can't get the extension on my phone.", "verified": true, "helpfulness": "0/1", "author": "Dennis D. Ranck \"Dennis\""}, {"rating": 4.0, "review": "its ok if you don't have a smart tv or cable tv etc...", "verified": true, "helpfulness": "0/0", "author": "bing xiong"}, {"rating": 5.0, "review": "No wonder why this is the best deal on wireless cast solution so far!It is amazing!", "verified": true, "helpfulness": "0/0", "author": "Leon \"Leon\""}, {"rating": 5.0, "review": "Very good!", "verified": true, "helpfulness": "0/0", "author": "Xingchi Pan"}, {"rating": 5.0, "review": "I love this little guy!  I dropped all cable recently and function solely on Netflix and Amazon Prime.  This works great with Netflix (haven't tried it with Prime yet).  It is on my bedroom TV which has a pretty weak WiFi signal, but I rarely have any lag or issues with it.  I just plugged it in, read the instructions, set it up with my Android phone, and I haven't had a single problem out of it at all!", "verified": true, "helpfulness": "0/0", "author": "Mrs Fant"}, {"rating": 4.0, "review": "cool but for some reason the mirror image is delayed in the words of the mouth Are off so not cool and has a buffering  image same times the hdmi  wires works better", "verified": true, "helpfulness": "0/0", "author": "sam perez"}]