[{"rating": 4.0, "review": "## UpdateSince writing this review I have purchased an Xbox One which pretty much makes the Chromecast obsolete.The one thing I have found it to still be useful for is travelling. Any decent hotel will have TVs with HDMI ports. So just bring along the Chromecast and plug it in to have access to all your streaming video services. Just remember to bring the wall plug because not all TVs will have the USB port.---## Original ReviewI bought this because it was so cheap, I figured it was worth a try before going to amazon fire or roku.Up to this point I've just been hooking my laptop up to an HDMI cable when i wanted to watch something on the TV. Now I can just push something up from my iPhone or my chrome browser on my laptop. If I want to watch amazon prime VOD I just open it in chrome, use the chrome extension to push it up to the screen and that's it. I can even continue doing other things on my laptop while the video is playing.The only downsides are the limited number of apps and the extension's lack of support for silverlight. This means if I want to watch something on amazon prime I have to use the flash player instead of silverlight.", "verified": true, "helpfulness": "0/0", "author": "HCarleton"}, {"rating": 5.0, "review": "Fabulous product. Shipped quickly. We use this daily and it's a great product. Sometimes, when we lose our WIFI connection on the computers, but are in the middle of a movie, the Chromecast continues with the movie until completion! We really like chromecast.", "verified": true, "helpfulness": "0/0", "author": "C. Hankins \"SewnUp!\""}, {"rating": 5.0, "review": "Works great!  Put Netflix and other streaming services on your TV for $30?  What's not to like?", "verified": true, "helpfulness": "0/0", "author": "Stephen Buckley"}, {"rating": 5.0, "review": "works better than my roku's, WOW", "verified": true, "helpfulness": "0/0", "author": "Jaye \"Movie lover\""}, {"rating": 5.0, "review": "Love this device much more than my Apple TV", "verified": true, "helpfulness": "0/0", "author": "William C. Harding"}, {"rating": 2.0, "review": "I was really excited about this, but it lags too much and the picture quality is not great.", "verified": true, "helpfulness": "0/0", "author": "Leela Simmons"}, {"rating": 5.0, "review": "This originally did not make it to my house by the supposed date, as there were some mail forwarding issues. However I contacted amazon customer service and they were very helpful and polite and did not hesitate to send me a new one. I love the convenience of watching netflix and other streaming products through it and the portability is awesome. I wish amazon prime video would stream though.", "verified": true, "helpfulness": "0/0", "author": "Kaitlyn Reynolds"}, {"rating": 5.0, "review": "I have an older flat screen that does not have built-in wi-fi, so having this device to cast Netflix is great!Unfortunately, I went thru a period of not being able to cast Netflix.  I was able to cast everything else, YouTube etc, but just not Netflix.I finally figured out what my problem was.  I think it had something to do with the transition from IPV4 to IPV6.  I went to my router configuration, disable IPV6, and I am able to cast Netflix again!  Disabling IPV6 was not a solution in my book.  I re-enabled IPV6, and I am back to not being able to cast Netflix.The solution: update my router firmware.  When I did that, everything works great!So now, I love my Google Chromecast HDMI Streaming Media Player!", "verified": true, "helpfulness": "0/0", "author": "T. Lew"}, {"rating": 5.0, "review": "People get real, the Chromecast is pure bang for your buck, just $35 miserable bucks vs. $100 for Apple TV. It does what it does, and it is quite proper. With the latest update, and if you have a really new smartphone like the S5, you can actually cast your telephone into de TV, so it means you can have all your apps and games on your TV. This means streaming video directly from Chrome to Android, music from spotify, watching your own videos and photos, and you can even set your phone as a camera an cast Skype, youtube, wathever. Games can be casted as well, and Android Phones can become the controlles, Bombsquad is a game on Android Market that can be used in this setting. This is the perfect gift for somebody who travels a lot, as you can have your netflix account on any hotel with wifi, and you can share your presentations is there is a HDMI compatible TV in the room. So yes, for just $35 bucks you get a lot!!! Actually, people who graded the Chromecast with one star either they have s***ty phones or slow internet connections. And as the Chromecast App is receiveng lots of updates, I feel that the Chromecast gets better and better with time.Try this, opening a free streaming movie in Chrome for Android and cast it directly into your TV!", "verified": false, "helpfulness": "0/0", "author": "Juan Algravez \"Client Très Exigeant\""}, {"rating": 2.0, "review": "Currently it's a waste of money because I do not have a compatible device to perform an initial setup.On my smartphone I have an old android version (2.x) for which no app is available.And through my Linux desktop, there is no possibility of setup and after some googling, I found this link: \"https://productforums.google.com/forum/#!topic/chromecast/OW8YCsYjQGs\".Hopefully I'll find quickly a workaround.", "verified": true, "helpfulness": "0/1", "author": "Kristoffel De Geest"}]