[{"rating": 5.0, "review": "This device works great, I had minor glitches with the device were it would freeze while stream a movie from my S5 phone. Although the freezing is a minor inconvenience, it is a great idea at a amazing price.", "verified": true, "helpfulness": "0/0", "author": "Billy"}, {"rating": 2.0, "review": "I bought Chromecast 20 months ago, it has quirks and annoyances but basically works.  Today (5/21/2015) it disabled itself pending new permissions.  To continue using, Google now requires permission to read and modify all data on all websites you visit.  I'm not joking or exaggerating, that's what it said.  There is no way I am giving them that permission to read and modify my personal information.  Google makes a lot of money selling web users' personal data, I'm going to do my best to keep my data out of their hands.  Not always easy to do, but in this case it was easy enough to unplug Chromecast from my TV and delete the app from my computer.", "verified": true, "helpfulness": "1/2", "author": "Pat Denver"}, {"rating": 3.0, "review": "It doesn't work with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Noelle"}, {"rating": 2.0, "review": "It's hard to use. When it works it works great, but getting it to talk to our router is hard.After several more months of messing with it, it was difficult.  A lightning strike blew out our Roku box and the upgrade of that did everything that we bought the Chromecast player for.  I felt that it was a poor use of my dollar.", "verified": true, "helpfulness": "2/2", "author": "abhaille \"abhaille\""}, {"rating": 2.0, "review": "very limited functions not very useful with apple products but looks cool", "verified": true, "helpfulness": "1/2", "author": "EAsian"}, {"rating": 5.0, "review": "Shipped and received in 2 business days! Have played around with it for 1 day, mostly YouTube and casting the chrome screen from my laptop. Have casted from 3 different phones in the house. Very little setup and worked like a charm out of the box. There are some glitches though in terms of phone freezing or video continuing to play on TV even when I stop casting. There seems to be a lag or outright disconnect at times. Not sure if this is related to WiFi connection or the phone or the chromecast device itself. Will try and figure this out and hope to see less of this in the future.", "verified": true, "helpfulness": "0/0", "author": "CS"}, {"rating": 5.0, "review": "The best ever!! My life was divided in two: before and after chrome cast!'", "verified": true, "helpfulness": "0/0", "author": "Rose"}, {"rating": 5.0, "review": "Good Thanks", "verified": true, "helpfulness": "0/0", "author": "anh vuong"}, {"rating": 5.0, "review": "GREAT", "verified": true, "helpfulness": "0/0", "author": "Arthur R. Pelous"}, {"rating": 1.0, "review": "Just doesn't work. It did for about 5 min that's it. So frustrating. I've tried over 10 times I just give up.  It just doesn't to my WIFI. I just don't understand it. Anyone have any ideas before I send this crap back....", "verified": true, "helpfulness": "0/0", "author": "Big Chuck \"Charles S\""}]