[{"rating": 5.0, "review": "Our kids love Fire TV.  We have only had it for a couple of weeks, so I will update after adding a game controller and some time.", "verified": true, "helpfulness": "0/1", "author": "Mike Summey"}, {"rating": 5.0, "review": "I received the device as a promotion for being a loyal customer for a trial period. At the end of my trial I knew there was no way I was sending the device back . Another amazing device by Amazon!", "verified": true, "helpfulness": "1/2", "author": "Tasia427"}, {"rating": 3.0, "review": "ok", "verified": true, "helpfulness": "0/4", "author": "T. Manns \"twometer\""}, {"rating": 3.0, "review": "When I'm watching Amazon Prime Videos this is a great piece of equipment.  Clear picture and hardly ever any choppiness (this would be due to the internet connection, which I'm using wireless connection).  There are a few downfalls which, hopefully, will change in the near future:1) There is no HBO GO.  Not sure why since it looks like the other streaming TV boxes have it (Roku, etc.).  Looks like Amazon may be working on this, so I hope sooner than later.2) Had the box stop working for a day or two about a month after I started using it.  Customer service was quick and helpful and it's been flawless since.3) It's a bit deceiving that the Fire TV page claims this device is perfect for music, but you don't get access to your Prime Music streaming.  It plays Pandora just fine, but I got excited that I could make playlists online with the Prime Music (which I did) and listen to the songs through my TV speakers.  The only Amazon Music that it lets you play are those songs that you have purchased.  The customer service told me my concern was important to them, but no mention of a timetable for when (or if) I should expect to be able to use this feature of my Prime membership.", "verified": true, "helpfulness": "2/2", "author": "Sean F."}, {"rating": 4.0, "review": "The first Amazon Fire TV did not work so great, but they replaced with another one and it works great now.", "verified": true, "helpfulness": "0/0", "author": "Charles Hamillton \"Chuck\""}, {"rating": 2.0, "review": "Insufficient functionality - ok for a small bedroom TV, but accessing video services through my computer is quicker, with a lot more choices. Voice control would be better if it worked with services other than Prime (At least that's all I could get it to work with). Overall - disappointing..", "verified": true, "helpfulness": "1/4", "author": "SpuriusL"}, {"rating": 4.0, "review": "Love it, movies begin streaming instantly.  Very easy setup. Even better if you have a prime account.The bad: Movie rentals are a little pricey", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little unit is easy to use and I swear my marginal internet runs better through amazon fire tv. Totally love it. Highly recommend", "verified": true, "helpfulness": "0/0", "author": "Em in Idaho"}, {"rating": 5.0, "review": "nice to have it one problem i though prime get free all movie and tv but not all oh", "verified": true, "helpfulness": "0/2", "author": "Daniel chamberlain"}, {"rating": 5.0, "review": "We enjoy it so much. My wife loves it, especially the voice recognition.", "verified": true, "helpfulness": "0/1", "author": "Michael Selesnick"}]