[{"rating": 3.0, "review": "I have several different streaming media systems and this one is the fastest, but not my favorite.  My favorite is actually the Boxee, but it is outdated and no longer available. I like Google TV from NetGear but I was really hoping for a better interface for Amazon content with the Amazon Fire TV box. If you know the name of a movie or show that you want to watch, voice recognition is terrific. However, if you want to search to find something for Prime members only,good luck. I could not figure out a way to browse Amazon Prime content only by genre. Rather frustrating as some of the other apps on my other media streaming devices have a better Amazon interface.", "verified": true, "helpfulness": "5/5", "author": "Rocky"}, {"rating": 5.0, "review": "Solid build quality, the remote control feels velvety smooth, and the programming available is just as good as the competition.", "verified": true, "helpfulness": "0/0", "author": "Triplet dad Edgar"}, {"rating": 3.0, "review": "Okay this is easy, if I already have a cable box what would I need this for an will it work with my cable box?", "verified": false, "helpfulness": "1/13", "author": "nathan williams"}, {"rating": 5.0, "review": "I wasn't sure if this was going to be worth it for me, but it's very convenient to have all of my online media options all in one place. I had been connecting my laptop to my TV to watch my Amazon selections, Netflix, and Hulu, but I almost have no need for my laptop anymore. It takes up far less space, obviously, and the remote is much nicer than using a mouse. I will definitely be recommending this to all of my friends.", "verified": true, "helpfulness": "2/3", "author": "Charlotte James \"Char\""}, {"rating": 5.0, "review": "This product is great! I have an apple tv for my bedroom, but as soon as this came out I needed to get it for the family room. I love the voice search plus it has Showtime Anytime! That was one of the main factors of buying it. Apple tv does not have the Showtime app, this does so its perfect because my family loves watching the shows through them. Sure you can't search through only the amazon prime content, but it doesn't really matter to me because I have a netflix account as well. Overall, the product was fast and simple to set up. I did not have update problems like others have claimed. If you're looking for a streaming device this one should be great for you!", "verified": true, "helpfulness": "0/2", "author": "AJDB"}, {"rating": 2.0, "review": "This device seems to work fine.  The problem that I have with it is that Amazon Prime members still are prompted to pay to rent movies that are 20 years old.  Amazon needs to spend a lot of time upgrading their streaming library and make a Prime membership worth the price increase ($99 now).  One should be able to watch a \"free\" HD movie without paying a supplemental charge and at least watch movies that are more than a decade old without having to pay rental fees!!  For the free content, one has to click through the menu more than should be required to find the free material.  It is as if Amazon is trying to gouge the user for rental fees with its default settings for the searches.Update: after further evaluation, I have downgraded this device from three stars to two due to the pitiful content available to view by a Prime member without paying rental fees.  I must have searched 8-10 standard older movies and all required rental.  Just as bad as national competitor streamer account where nothing one wants to watch is available, as least in my experience.  This device may be a good portal for viewing streaming content. Good luck finding anything much worth watching without paying rental fees.", "verified": true, "helpfulness": "5/9", "author": "J. King"}, {"rating": 5.0, "review": "Blows Roku out of the water when it comes to setup and use. Easy to use, apps installed easily. It also gets points for allowing access to competitors' products (such as Netflix), unlike Apple TV (which, as of this writing, does not allow access to Amazon). Very pleased.", "verified": true, "helpfulness": "1/1", "author": "skydiver30960"}, {"rating": 5.0, "review": "We were taking advantage of Amazon Prime's free programming via our Wii app, when I decided to purchase the Amazon Fire TV.  I ordered on Amazon with a 2-3 week 'initial' delivery lead time.  My spousal unit was home when it arrived, so he had already taken it over.  Here is what he had to say:Okay. I know that I’m easily entertained, but this has to be on the top ten list of coolest gadgets ever. I’ve recently been taking advantage of Amazon Prime’s free programming in a quest to find something worth watching on TV. Mind you, my standards aren’t particularly high but it’s been a challenge because TV really does generally suck. With that said, I found the Amazon app for the Wii and have been using that as of late to broaden my entertainment options. However, I haven’t been using it very often due to limited buffer, slow connection speeds and low resolution. This week, we finally upgraded to Amazon’s new Fire TV device. Wow.The shipment arrived in only a couple of business days, which is more impressive than one would think given that when the order was placed, the estimated arrival date was two weeks away. Setup was more simple than you can even imagine:• Take out of box.• Connect device to TV or A/V system with HDMI cable.• Plug power adapter into outlet.• Turn on TV.• Follow instructions on screen.Yep, it was that difficult. Took me all of 3-1/2 minutes. From there, the Amazon Fire TVAmazon Fire TV literally does everything except enter the encryption code for your wireless network. Assuming that you’re using a wireless connection instead of wired (as I am), it finds your network, leaving you to confirm the correct network and enter your code. After that, the device connects, installs any required updates and other than prompting you to select whether or not you want parental controls, that’s about it. If you have an Amazon Prime account and you order it through Amazon, it comes pre-configured with your account information already in the settings.Once it’s up and running (about 5 minutes to perform the software updates), it takes you directly to an introductory video that explains the basics. One that I might add, is almost unnecessary given the relative simplicity of the interface. Nonetheless, it’s a handy short video that shows you the basics. There are more help videos available that you can access later on if you find something you’re unsure about, but as previously noted, it’s pretty simple to use and doesn’t take a genius to figure out how to navigate and find what you want.Picture and audio quality are excellent and run full 1080p. Even with the high quality, I have yet to experience any latency or buffering issues at all. Granted, my internet access runs on average around 40 mbps, so I can’t attest to how it may operate at slower connection speeds, but with everybody on broadband these days I would be surprised if many had an issue.So far, the only issue that I’ve had was finding programming that’s free with Amazon Prime. From the home screen, it’s listed in two different categories, “Recent” and “Top” Prime titles. That’s easy, but if you search for something, when you pull the program up it shows the prices to rent or buy. On the Wii app, the program image has a little band across the corner that tells you the title is included free with Prime. The Fire TV didn’t appear to have this, so at first I was having difficulty finding the free stuff when searching (since I am cheap, after all). I finally noticed that the images have a small white banner that says “Prime” across it on the upper left corner. Problem solved… (you can also find it by looking at the “more ways to watch” button. If the title is available to watch for free with your Prime account, it will give you that option.)It’s early yet, so I haven’t had much time to explore all the different options but as of now I’m giving it a big thumbs up surrounded by 5 stars with whipped cream and a cherry on top.", "verified": true, "helpfulness": "6/6", "author": "M. Hendley \"SpideysMJ\""}, {"rating": 5.0, "review": "I am not usually able to install things without at least one support call, but this practically did everything for me, my existing library & netflix automatically synced - I plugged it in and it practically took over from there. I especially appreciated how easy it was to tie in to my wireless network - all I had to do was put in the network password once, it took over from there.", "verified": true, "helpfulness": "0/0", "author": "Mary Beth Golden"}, {"rating": 3.0, "review": "Some issues so far:-When using Dolby Digital via optical, pausing playback causes a very high pitched noise, and un-pausing causes a loud cracking noise.-Playback randomly freezes/unfreezes, causing the above hiss and pop. It is clear that the Fire TV is doing something in the background because the video slows down then speeds up to catch up.  This happens randomly, perhaps 3 times per movie.-Scrolling through movies and TV shows horizontally is a massive pain, as I can't see very much at a time.  I should be able to change views so I can see maybe 9 titles at a time and then page through.  The scrolling animation causes plenty of eyestrain as I try to zip through, looking for something worth watching.-Content is not 100% there yet.  Many popular movies are missing.-I am a Prime member, yet they want to sell me the movie/show even though I can just press play and watch it for free.-For whatever reason, playback can sometimes switch to SD.  I'd much rather force HD all the time, then have the option to pause and let it buffer.  Bandwidth is not the issue at my end, but obviously during peak times the internet and perhaps Amazon's servers might be overly busy.With all that said, the reason I bought this was to gain access to Prime stuff in HD without having to buy a \"supported\" TV.  I have a home theater projector, and dealing with HDMI audio splitters is a pain (i.e. Roku).  So having optical out is what sold me and I'm happy enough.", "verified": true, "helpfulness": "6/6", "author": "JRod"}]