[{"rating": 5.0, "review": "This is my first streaming box. It was easy to set up, an it's easy to use. I've been streaming through smart dvd players. The Fire TV is much faster. I also like the additional content from Amazon Prime. I guess time will tell. So far it's delivering as promised(including the voice commands) :-)", "verified": true, "helpfulness": "2/2", "author": "I. Sanders"}, {"rating": 5.0, "review": "This product has amazing potential, there is a down of room for additional streaming applications and services.  This looks to be a platform that has plenty of room to grow.  The box is easy to setup, easy to use, and lightning fast!", "verified": true, "helpfulness": "0/0", "author": "admo"}, {"rating": 1.0, "review": "No hbo go and vudu is a deal breaker.  VUDU is where I have a pile of movies I purchased.  Would give 5 stars otherwise.", "verified": false, "helpfulness": "6/28", "author": "David"}, {"rating": 4.0, "review": "This is a very good streaming media player, but nothing revolutionary here. It works great, but it's not much different than the many others on the market. This is essentially a Roku 3. It supports all the usual Netflix, Hulu etc. channels. The only difference is that it emphasizes the Amazon prime videos from the main menu (obviously, since it is an amazon product). So if you use Amazon prime much you will probably love it. If you never use amazon prime and opt for Netflix or others, then I would recommend you go with a Roku 3, as the majority of the main menu is made for watching amazon media. This has a very nice and responsive interface which is a little faster than the Roku 3. I also like the remote on this product a lot more (or rather, I cannot stand the Roku remote).Lastly, the reason I gave this 4 stars instead of 5 - it does *not* support external content. I have no idea why they have ports to plug it in and it even powers them up but it will not read anything (this is not a bug, they built it this way). Why any company would put out a product where you cannot use an external drive these days is beyond me. So do not buy this if you have any hopes of that. You will still need an additional media player to read any external drives.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Updating review:  Received replacement for below quickly(36 hrs) - plug and play, worked, no problems with updating.  Video quality is great, loading programs quick. Then it goes downhill for me... the selection of TV 'channels' is almost absent - comparing to Roku 3.  Feels like product was released too soon.  Voice search is fun, but limited to Amazon.  I am returning for now and will re-purchase when at least Acorn TV is available.  If you play games - maybe worth it to you....but not for a TV watcher, reminds me of when I was a kid -- you could only get 3 stations and where VERY happy then, but not now.  Upgraded rating from 0(yes I know they don't have it) to 3 based on speed of loading and decreased buffering.Received new Fire TV - 3 days after promised.  Took 10 minutes just to free it from packaging.  Plugged in perfect - no issues, On screen instructions easy simple no issue - except that nothing happened... thinking that something was wrong with my set up -- plugged old Roku back in - working with no problem... tried Fire Again - would not update.  Followed onscreen instructions - nothing So attempted to connect to amazon.com/firetvsupport --- except it directs you to the purchase site AGAIN..  So tried set -up again -- nothing.  Very unhappy - sent a hot e-mail to Amazon - they quickly replied and are sending a replacement...So \"Zero\" for product so far, \"Zero\" for support website.... but 5 for Amazon quick response.", "verified": true, "helpfulness": "8/30", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have had my apple TV for a few years. I got my Fire TV last Friday.Fire TV responds quicker.Voice search worked well. Manual search is more tedious than Apple probably because less on screen.On home screen has most recently accessed at top making them readily available (good for Hulu and Netflix).Fire TV does not list show date.A good buy for accessing my Amazon purchases which are not available on Apple TV.I also hope it is more stable as I have to reset my Apple TV at least once a week.Presentation of shows are equal.George Martin", "verified": true, "helpfulness": "7/7", "author": "George Martin \"marnet\""}, {"rating": 5.0, "review": "This is incredible...It does it all and then some. The ability to watch Netflix, listen to music, and play games all while using the voice command is truly amazing!", "verified": true, "helpfulness": "5/6", "author": "Ryan"}, {"rating": 5.0, "review": "I bought this over the Roku3 because of what it does and will do in the future. Yes Roku has more channels but given the same amount of time I am sure Amazon will have far more than it does. I like that it has a screen saver and turns off after some time, something Roku does not do. I use this to watch Netflix and Youtube. If it had a web browser it would be AWESOME. I like it, I recommend it, I'm sure Amazon will work to improve its content.", "verified": true, "helpfulness": "5/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have been using the Apple TV for about 2 years and it was great but I wanted something I could watch my Amazon movies on too.  The Fire TV was a snap to hook up and get started.  EASY!!  I look forward to seeing all the features and letting my grandson play his games on here.  This is all I need for both Amazon movies and Netflix along with his games.  Can't say enough good about how easy it is to use and I am challenged with new technology!", "verified": true, "helpfulness": "6/6", "author": "Lisa Hay"}, {"rating": 4.0, "review": "Amazon Fire TV is great. I enjoy watching the amazon Prime movies. But, the voice control does not work for me  I tried for about an hour it never understood my voice.  Maybe it does do southern dialects.", "verified": true, "helpfulness": "0/1", "author": "Dexter Dean"}]