[{"rating": 4.0, "review": "Amazon Fire has performed as advertised.  It was simple to set up and easy to use.  It would be nice to be able to have volume control but overall I'm very pleased with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Robert W. Carter"}, {"rating": 5.0, "review": "It's simplicity is based on Roku it has gone several step better.  There are excellent photo as screen shot when the player is inactive.  There should have been an option to add memory, but thus far it has enough memory to keep my movies streaming", "verified": true, "helpfulness": "0/0", "author": "rrobinson"}, {"rating": 4.0, "review": "I now own three of the major streaming devices, Roku, AppleTV, and the FireTV. I wish I could give it 5 stars but while I still wait, over 2 months now, for one major promised app (MLBTV) I cannot. The FireTV is fast and responsive for all of the apps I've used. The picture quality is outstanding and I cannot wait for the ,soon to be released (as described on the website), MLBTV app. I live in an area were the quality of the internet connection varies greatly and I've found that trying to stream movies or TV shows mostly unbearable on both the Roku and AppleTV due to buffering, the FireTV however excels in this area and it rarely requires buffering after the show or movie starts. I would like to see expanded capability with the USB port to add the ability to stream video, music, or photos from a USB drive similar to what my Roku has.", "verified": true, "helpfulness": "2/2", "author": "R. Tusing"}, {"rating": 5.0, "review": "5 Stars, great, wonderful, the best viewing you could have (would give 6 stars if they had it).I ordered the Fire TV on a Saturday, Amazon shipped on Sunday, and It got to my post office Monday; very fast delivery.  In fact all my Amazon prime mail has come fast so far.I was viewing my Amazon prime video on my PC through the browser, and the video quality was horrible, bad color, somewhat grainy (even though I have broadband at 10 mbs).  This was due to the fact that Amazon and my browsers (I.E., Firefox, or Chrome) would not use Silverlight (for whatever reason) but would only play using the flash player.When the Fire TV arrived I plugged into ethernet, HDMI, and it worked perfectly.  The TV box is very small and looks good.The difference in video quality was like night and day.  Again I had to view in a browser with flash player. If you were able to get Silverlight to work on your PC? then viewing may not be as bad as mine. But Fire TV video and sound quality is excellent, and the voice search also works very well.Now to a pet peeve; I kept hoping that Amazon would provide a Windows 8 app where I could view my Amazon prime (they do have one for the pay and rental of videos), but they never did.  Had I been able to get silverlight to work, or if there was an app, I most likely would not have purchased Fire TV, as I only want to watch my free Prime videos in somewhat decent quality.But I only have high praise for the Fire TV and the video quality.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Amazon offered me a free 30 day trial of the Amazon Fire Tv which I gladly accepted because I seen the commericals on Tv and I was a little curious about the product. When I got the product it was easy to setup. But the navigation through the prime video is confusing with the fact that you cannot separate the prime content with the paid content and the voice search is a little hit and miss for me. It sometimes doesn't work for me, I don't know if it's me but either way this product doesn't give me enough to make me want to pay the $99 so unfortunately I'll have to return it.  At least it gives me 30 more days of Amazon Prime so if your amazon prime expired, you can try the free trial of amazon tv if they offer it to you. I'm glad that amazon actually gave a free trial for an electronic product when other companies wouldn't even try so props to amazon.", "verified": true, "helpfulness": "0/1", "author": "L.T.T."}, {"rating": 2.0, "review": "I have Roku 3 and Rasberri pi for XBMC , i thought to replace these 2 devices with amazon fire tv.. but i was very disappointed with amazon fire tv picture quality .. its very poor compared to roku3 and rasberry pi.", "verified": true, "helpfulness": "2/9", "author": "Amazon_GK"}, {"rating": 5.0, "review": "Having connected a wireless router to ATT, a DVR and Dish receiver to my HDTV, and setting up a wireless PC connection, I expected some hassle in connecting the Fire. It took more time to get the wrapping off of the parts than it did to hook it up.Watched a Prime movie in five minutes.", "verified": true, "helpfulness": "1/1", "author": "Ken Ayala"}, {"rating": 2.0, "review": "I bought an Amazon Fire and it is easy to set up and worked well for the first week then the remote controller start to have problem.First the voice search started to work intermittently then later I can't navigate from one to other screen. I don't know what to do and intend to call customer service but before that I try to remove the battery and put a new one and it works again. I checked the Amazon battery and both of them read 1.05 and 1.15 volt. It is unbelievable with lest than two weeks and the batteries already dead.You make a nice product and try to save pennies by using the Made in China battery to explain how is it happens. I try to give you feedback and try to hold on to two bad batteries and if you really care about your quality let me know I can send to you for your root cause analysis.", "verified": false, "helpfulness": "2/6", "author": "Hue Nguyen"}, {"rating": 4.0, "review": "I purchased this as a mother's day present for my grandmother, who frequently uses her Prime account and my Netflix account to stream shows/movies. She's a die-hard Amazon fan, loves her Kindle Fire so I thought this would be perfect for her.For the most part, this is true. She's not tech savvy, so I was hoping the voice search would be a useful tool for her. To some extent it is but it would be so much more useful if it searched outside of Amazon's offerings.The fact that the Prime Videos are not separated have also been a source of confusion. I advised my grandmother to just bypass that and voice search for Netflix and type in what she wants and since then she's been binge watching Breaking Bad. =)", "verified": true, "helpfulness": "0/0", "author": "Brandi"}, {"rating": 5.0, "review": "Thanks to this little device I no longer have cable tv. I am a movie buff and with the Netflix app., some popcorn and time to kick back this was an excellent purchase for me. I especially like the \"Search\" mike on the remote that allows you to speak a movie or an actorand get an instant response.", "verified": true, "helpfulness": "1/1", "author": "R. G. V."}]