[{"rating": 2.0, "review": "Voice search does not work with netflix.  Will not sync with my WD My cloud.  Since I do not pay the extra $100/yr for amazon prime I might return.", "verified": true, "helpfulness": "0/0", "author": "jimj"}, {"rating": 5.0, "review": "Loved it.  Really easy to set up and use,", "verified": true, "helpfulness": "0/0", "author": "H. Laue"}, {"rating": 3.0, "review": "I wasn't ready to spend the money to upgrade to a smart tv so I purchased this instead.  I like that I have access to Amazon Prime movies and Netflix but all of the other services also require a subscription.  It kind of defeats the purpose of having the device, you might as well pay for cable.  I dislike that I don't have access to you tube or any other Google services (should have read the fine print and done more research).", "verified": true, "helpfulness": "0/0", "author": "Aspen Shanti"}, {"rating": 4.0, "review": "It is a great piece of hardware. No stuttering, no lag. My only complaint, and it's not really a fire issue, is there is no Vudu app and as such a glaring whole in the line up. Once that is filled it's a five star solution. As an aside, if Amazon supported ultraviolet this could be remedied as well.", "verified": true, "helpfulness": "0/0", "author": "Mr. T"}, {"rating": 5.0, "review": "I love the Voice Search, and trust me IT WORKS!! This is an excellent streaming device. I recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "LLoyd"}, {"rating": 5.0, "review": "Very easy to use.  Really like the voice control search feature.", "verified": true, "helpfulness": "0/0", "author": "Kenneth T."}, {"rating": 5.0, "review": "Great device !!  a lot of features .", "verified": true, "helpfulness": "0/0", "author": "Rafael Oleaga"}, {"rating": 5.0, "review": "Not too bad, am enjoying it so far so good 👌", "verified": true, "helpfulness": "0/0", "author": "Renee hinds"}, {"rating": 5.0, "review": "I like this so much better than the Roku player I had. Gave the Roku away when I got this. This is much easier to navigate, nice big easy to read menus that are very intuitive and easy to use, love the voice search feature. This is the only one to buy, forget all the other brands, Amazon Fire is number one in my opinion.", "verified": true, "helpfulness": "0/0", "author": "DownValleyGirl"}, {"rating": 4.0, "review": "I like that it is fast and responsive, works really well on wi-fi. I am still getting used to the remote control, sometimes you want to rewind and turn off captions and sometimes it works well on Amazon Prime but not to well on Hulu Plus.Now, this is our upgrade from a Roku which we still like very much!Last thing, please Amazon, stop with the rivalry, let us add the Google Play app on the Fire!! I have tons of stuff there too and it would be nice to just use one streamer instead of Roku and Fire.", "verified": true, "helpfulness": "0/1", "author": "Gaia321"}]