[{"rating": 5.0, "review": "The only thing that I have to say about this product is, Awesome! Its easy to connect and images are in 1080p, sharp. Even the sound comes in strong. I recommend tis product to everyone.", "verified": true, "helpfulness": "0/0", "author": "Pepi"}, {"rating": 3.0, "review": "I just had to read few comments regarding this streaming box from Google/ Chromecast  and figured until they get the bugs worked out of it I will wait to buy it. If you must have it then for $35.00 OK you could do worse with your money. But I am  happy with my Roku3 and it too has it drawbacks No local channels available, NO NFL Channel bummer :(  if they offered that instead of the NFL mobile app for smart phones that cost $ 5.00 per month to use I say great and if you have more than one HDTV  you will need an another Roku3. And if you are like me in need of new HDTV  I check out some of the used dealers on the various websites like Amazon ect  you will find many of them have streaming services already installed", "verified": false, "helpfulness": "0/1", "author": "Lewis W. Cunningham \"Wayne Cunningham\""}, {"rating": 2.0, "review": "Works fine with Apps.No lag whatsoever and streaming and super fast.Netflix, YouTube is amazing.Picture quality is awesome.Google chrome browser is a MAJOR flop.Google chrome browser Didn't work with my HTC one! Samsung 3G and Apple IPAD.Tried with laptop and Google chrome browser and the lag is AWEFUL.Disconnected like 20 times.Does not run for a minute and gets disconnected.Tried with music apps and again it has big time lag and does not play well.If you are looking at wireless streaming will not recommend this product.", "verified": true, "helpfulness": "1/2", "author": "GEEMAN \"Giridar\""}, {"rating": 5.0, "review": "Simple, intuitive, and an amazing price. Chromecast is the best. I can not wait for the software updates to come.", "verified": true, "helpfulness": "0/0", "author": "Lenin Cortes"}, {"rating": 5.0, "review": "Crystal clear viewing and very easy to use. I love how small and portable it is. I love how you can cast from a laptop, PC, iPhone or iPad, etc. Can't wait for more apps to be compatible with it.", "verified": true, "helpfulness": "0/0", "author": "Karl Fisher"}, {"rating": 5.0, "review": "This has turned into a hand little electronic gadget. It's simple to install and use. I was dreading setting this up but into turned into a breeze. easy to understand directions even for this person who is not a technical guru at all. Just a few minutes after I had it out of the box i was able to use it. The only drawback is that only a very few apps are able to use this. Netflix,YouTube and Google play at this time. But for $35 it's really a good investment for hopefully more in the future.", "verified": true, "helpfulness": "0/0", "author": "CatMan"}, {"rating": 5.0, "review": "Its easyto use  and simple to set up and it does work well. Cant wait for the upgrades where you can play any PC media through it. Glad to get it in the early stages its worth it.", "verified": true, "helpfulness": "0/0", "author": "Stephen Lapage"}, {"rating": 3.0, "review": "The device looks pretty snazzy, until you realize that it needs a power source - a fact that is carefully omitted in the marketing.  I have a USB input right next to the HDMI port, so it's not a big deal, but if you don't you'll need to plug it in like any standard appliance.Second, the apps are very limited.  Google needs to quickly expand to Picasa and other apps to make this a more interesting product.On the positive side, it is fairly plug and play, and is pretty cool for the apps that do work (YouTube, Chrome).", "verified": true, "helpfulness": "0/0", "author": "Seth Goldman"}, {"rating": 4.0, "review": "I had heard and read great things about the Chromecast, so I went in with high expectations.  I ordered it during the extended backorder period, and waited for over a month to get my Chromecast.  Amazon was upfront when I bought it, saying it could be up to 2-3 months before I would receive it.  Happily I received an e-mail from Amazon stating they received the Chromecast early and I received it after 4.5 weeks.The product packaging is very nice - reminiscent of iPad/iPhone packaging.  Inside is the Chromecast, small rudimentary instruction booklet, USB power cable, and a power adapter if a USB slot is not available.The Chromecast uses HDMI to connect to your TV.  It doesn't receive power over the HDMI, so the USB adapter cable goes into the other end of the Chromecast and then into a USB port on your TV.  Plug both in and then install the app on your devices.  Once you've plugged it in, change your TV to display that HDMI input.  You will also need a wireless network to connect to.Setup is very easy.  You'll spend the majority of your time just downloading the Chromecast app to your device, whether it be an Android or Apple product.  I installed the app on both a Samsung Galaxy IIIS and an iPad 2 (running iOS 7).  I also installed the Android and Apple Google Chrome app in each respective device.  Once the Chromecast app is installed, you open the app and it will automatically recognize the Chromecast.  You will enter your password for your wireless network and it will connect in a few seconds.  You can then change the name of the Chromecast, and you're off to the races.From your Android or Apple device, you can stream video and audio from Netflix, YouTube, Chrome, and Google Play.  When you are in those apps, there will be a new icon in the upper right hand corner that will connect your feed to the Chromecast.  The transition of the video to the Chromecast is extremely fast, and YouTube videos look fantastic (assuming they're good quality videos in the first place).  You can pause, play, and fast forward from your Android or Apple device, and responsiveness is very quick.  Netflix is fantastic to use with the Chromecast as well.So, if I like it that much, why deduct a star?  Only because I wish it connected directly with more apps right now (I'm looking at you,  Amazon Prime).  I have not tried to stream Amazon Prime to the Chromecast through the Google Chrome browser, but that will be next.  Once I've done so, I'll post the results.Overall - this is the cat's meow.", "verified": true, "helpfulness": "3/3", "author": "Heath"}, {"rating": 5.0, "review": "The Google Chromecast HDMI Streaming Media Player does a fantastic job of streaming video to the TV, I have an older computer which is a little slow but it still streams Netfix and YouTube with no problem. Streaming from Google chrome is a little more difficult but as I said my computer is old and a little slow. I see in the instructions it says the unit may get hot, I don't normally watch more then one program at a time so I haven't experience that problem. If you don't have a USB port on your TV it has to be plugged into an electrical outlet, I keep the unit plugged into the TV but I unplug the unit from the electrical outlet after use.", "verified": true, "helpfulness": "1/1", "author": "Frederick Jimenez \"Frederick\""}]