[{"rating": 5.0, "review": "LOVE LOVE LOVE MY GOOGLE'S CHROMECAST.  ONE OF THE BEST PRODUCTS I HAVE EVER OWNED.", "verified": true, "helpfulness": "0/0", "author": "QualityIsKey \"carebear\""}, {"rating": 5.0, "review": "I've bought 3 of these already. So simple and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Under The Table N' Dreaming"}, {"rating": 5.0, "review": "Love Chrome Cast!", "verified": true, "helpfulness": "1/1", "author": "Lucky Girl"}, {"rating": 4.0, "review": "Xcellent", "verified": true, "helpfulness": "0/0", "author": "Manoj Singh"}, {"rating": 5.0, "review": "Easy setup and it works great.  Super useful when pulling up a YouTube video, Netflix, or other digital media onto your TV.", "verified": true, "helpfulness": "0/0", "author": "Thomas G. Bassett"}, {"rating": 5.0, "review": "Being technially challenged I was shocked at how easy this was to set up and easy to watch shows on.  Cable company coming tomorrow to pick up their crap!", "verified": true, "helpfulness": "0/0", "author": "Joey V."}, {"rating": 4.0, "review": "I like it", "verified": true, "helpfulness": "0/0", "author": "victor valenzuela"}, {"rating": 5.0, "review": "Amazing product from Google. Ease of mirroring or streaming if you make good use of it", "verified": true, "helpfulness": "0/0", "author": "Avinash Shimoga Ganesh"}, {"rating": 4.0, "review": "This is a neat little device and it lets me stream movies from my computer to my TV like I wanted to. The problem is, it just doesn't seem like a polished final product. There are crashes, long delays sometimes, and sometimes it just plain refuses to do what you want and you have to figure out a workaround. For starters, the Chromecast plugin for Chrome doesn't always work great. I can't just click the button and have it stream. The default casting option always gives an error. I have to play my movie in a tab in Plex, then go into the options and select the option to cast the tab itself. Just requires a few more button clicks and fiddling. The second biggest annoyance is that when streaming from my iPhone or iPad, sometimes the cast button shows up and sometimes it disappears. It takes me restarting my device a few times and/or the Chromecast for them all to finally talk to each other and recognize what I'm wanting to do. Sometimes when you pause it on your phone and then click play again it will spaz out and restart from the beginning instead of remembering where you left off.So my summary is that if you need a way to stream some movies or shows to a TV and you're tech savvy enough to mess with stuff, then it's $35 well spent. If you're a Chrome user, that's an even bigger bonus. This is not a device for, say, your grandparents or kids to sit down and enjoy right out of the box. I can't recommend it to most people for that reason. I would recommend a Roku 3 or similar for that demographic.", "verified": true, "helpfulness": "0/0", "author": "J. Thurman"}, {"rating": 5.0, "review": "Wife uses it every night. Works great from upstairs!", "verified": true, "helpfulness": "0/0", "author": "Robert A. Demsky \"Book Doctor\""}]