[{"rating": 5.0, "review": "I was going to buy a blu-ray player with Netflix and You Tube installed on the machine. I dreaded getting all the wires and connections going, and then I ran across Chromecast while surfing one evening. I ordered one, hooked it up in five minutes, ( OK, maybe 10 minutes, but it took me a while to find my wifi password ) reactivated my Netflix account, and started watching the complete Mad Men series from episode one. Picture and sound quality are great (1080 TV ) I have since ordered two more for my golfing buddies, and they worked very well. Easy to connect, easy to \"cast\" a wonderful little gadget. I love it!", "verified": true, "helpfulness": "0/0", "author": "James Lawn"}, {"rating": 5.0, "review": "Works great, fast, and very easy to use. Title about sums it up.Definitely would recommend this Chromecast to anyone who is looking for a streaming media player.", "verified": true, "helpfulness": "0/0", "author": "Parker"}, {"rating": 5.0, "review": "Bought this for my husband to use with the Sunday Ticket special offer and stream from his laptop to watch the Cowboys' game when we are in Florida...Fairly easy to set up--didn't try to watch anything but Sunday Ticket since we have smart flatscreen/DVD player there and can get Netflix, Amazon Prime with them...Signing on to the DirectTV site was hassle and there was some loss of image quality once the game was \"cast\" to the big screen...but way better than watching on the laptop and better than not seeing the game at all...We left it there in case our daughter and SIL wanted to use it next week...", "verified": true, "helpfulness": "1/1", "author": "Loves2Read"}, {"rating": 3.0, "review": "Its good for those who watches  you tube and  Netflix.  I want to see my photos but I can not. I think its difficult or I don't know how to. But its not  even addressed any where if it could. wast of money looks like.Not for Apple users.", "verified": true, "helpfulness": "0/1", "author": "Kush Desai"}, {"rating": 5.0, "review": "I really like this. I cannot say that I use it a ton yet, but do plan to more in the future. Only played with it a few times. Setup was a tad hairy at first...was having problems hooking up to my router, but I did get it and super easy to use once it is hooked up. Very convenient when you are trying to show a room full of people something  and not have them all huddled by your laptop! Entire room can see it all at the same time..whether it be a movie off Netflix or a website looking up a product...etc. I thought the price was a deal (I got 3 months of Netflix thrown in on the deal too). It's pretty handy thing to have.", "verified": true, "helpfulness": "0/0", "author": "Boatnone"}, {"rating": 4.0, "review": "Easy to set up and works well.  The only problem I have with it so far is there's not many programs you can stream to it.  I'd give it 5 stars if it just had Hulu+.  If you have a PS3, you can d/l the chromecast ap and get Netflix to work as if the PS3 was the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Chromecast works exactly as advertised and I haven't encountered any major issues after a week of use. I'm looking forward to it being even better once more types of content are available for it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This was the best investment you can make if you love to stream and be able to view easily on your tv. We love to stream movies and this product made it painless and fast to do.", "verified": true, "helpfulness": "0/0", "author": "Newsome"}, {"rating": 5.0, "review": "for this price, it turns my slightly older LCD into a modern \"smart\" tv.love the netflix and YouTube linking.wish it had more apps, Chrome for Android, Hulu, and my phone's media player... not just play movies.also, there's a bit of load errors with YouTube on LONG video's that you stop mid way through and come back to.", "verified": true, "helpfulness": "0/0", "author": "Muffinman_187 \"Muffinman187\""}, {"rating": 3.0, "review": "Bought it,,,had to wait almost 2 months to get because it was out of stock, When I finally got it it was easy to set up...Cons: no reset button,,,like the Roku you have to unplug it...limited apps", "verified": true, "helpfulness": "0/0", "author": "Sharon"}]