[{"rating": 5.0, "review": "Chromecast works like a charm and I have no complaints at all about it. I use it with my laptop to stream movies to my smart tv with no problem at all. You may have to set the picture quality to the lowest setting because if you don't the picture will be choppy. you have to down load and use Google Chrome with it to play movies. You can import movies from Bing also to watch. The only draw back is that you will watch so many movie you will use your down load allotment use fast especially is your on satalite conection. I would recommend this to anyone who enjoys watching internet movies or U-tube junkies.", "verified": true, "helpfulness": "0/0", "author": "Roye S. Feagans"}, {"rating": 1.0, "review": "I was disappointed in this. You can only send things from the Chrome browser. I have a Sony blue-ray that is connected to Netflix, Hulu and Amazon Video, so I wasn't looking for that. I really wanted it to send PowerPoints. I would have liked to be able to send Apple iTunes. Can't do any of this.", "verified": true, "helpfulness": "1/1", "author": "boosmom96 \"romance junkie\""}, {"rating": 2.0, "review": "I found out that it only works with certain applications, like netflix or hulu. I couldn't even view my own pics or video! I sent it back without opening it. A lot of potential, but too many limitations.", "verified": true, "helpfulness": "2/2", "author": "Mary Smith"}, {"rating": 2.0, "review": "Unless you love YouTube or Netflix this really does not serve much purpose. Until they add an app where I can put movies from a home network (not actual device) to it I will leave it on the shelf to collect dust.", "verified": true, "helpfulness": "2/2", "author": "Scott Everngam"}, {"rating": 5.0, "review": "Since this is my second Chromecast Player you may rightly infer that I love this product.  However, I must comment that my second installation was not as simple as the first.  For some reason neither USB port in the television powered the device. I finally got it to power-up using the wall outlet and it is now working.  I suppose this is more of a television port issue as opposed to a defective Chromecast Player.  I love watching the back episodes of great shows like, \"Breaking Bad.\"", "verified": true, "helpfulness": "0/1", "author": "Pat4Peace"}, {"rating": 4.0, "review": "Easy to setup. easy to use. Youtube stream and performance is much better that the embedded application on Smart TV.Need more Apps to have 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Christopher Avila \"asternux\""}, {"rating": 5.0, "review": "Perfect functionallity, a great gadget from Google. Needs more apps that support it, at the moment only youtube and netflix support but I'm sure to more apps are coming.", "verified": true, "helpfulness": "0/0", "author": "David Luna"}, {"rating": 4.0, "review": "We love our Chromecast and it plugged right into the TV. As soon as we turned on our devices it found them and the set up was really pretty easy. We love using Netflix, YouTube and Google play.", "verified": true, "helpfulness": "0/0", "author": "Michael L."}, {"rating": 1.0, "review": "Upon attempting the setup on a Windows 7 machine, I keep getting an error message telling me to turn on the WiFi.  Well the WiFi is turned on, or else I would not have been able to download the setup in the first place, you piece of crap.  Then I try to do setup on a Chromebook, instead....both Google machines right?........it does something funky with screen resolution so you can not read anything to continue with the install.  And, of course, Google's Help section is equally worthless. I don't have time to mess around with this, and I'm fairly tech savvy.  Save your money.", "verified": true, "helpfulness": "2/4", "author": "38ChevyGuy"}, {"rating": 5.0, "review": "Do not need to invest in an expensive smart T.V if you buy one of these. It is easy to set up and use. You can stream and cast pretty much anything on to your big screen. Got this for my boyfriend and he loves it!", "verified": true, "helpfulness": "1/1", "author": "msnmna"}]