[{"rating": 1.0, "review": "This will not work with your windows phone or windows RT tablet. You should also not let it connect to the internet so you can flash (hack) it.", "verified": true, "helpfulness": "2/6", "author": "Amy"}, {"rating": 5.0, "review": "Set up was a breeze and streaming is incredibly simple. This is the beginning of the end for network tv!  Love this product.", "verified": true, "helpfulness": "0/0", "author": "C. Armbruster \"Savvy Shopper\""}, {"rating": 1.0, "review": "This device can stream Youtube videos only or may be Netflix (which I have not tried yet). If you are planning to use it for general purpose other than youtube, I would suggest not waisting your money for something that has extremely limited use.", "verified": true, "helpfulness": "3/5", "author": "Zafar"}, {"rating": 1.0, "review": "Chromecast was impossible to setup on my HP Netbook. The setup routinescreens are too large to fitin the visible area of the screen so thebuttons cannot be seen or accessed directly.Their windows do not change size when youuse Google Chrome zoom feature andthey can't be resized by selectinga corner or side and dragging withmouse.  So if you have a smallscreen PC your setup is tedioustrial and error and very frustrating.This with the Chrome browser seems likean unforced error on Google's part.Does anyone at Google use a netbook or small screen PC?(I use highest resolution for screen to display max view.)I used my desktop to go through the setup and was able see buttonsto tab the netbook to response buttons after about45 minutes of trying.Then I opened Youtube, brought up a video I have in favorites andplayed it.  My results were terrible, unlistenable soundthat constantly broke up.  Video was OK on my 42\"HD TV but was slower than what was onmy PC.  I tried it again on another HDTV in aroom closer to my Netgear router and hadthe same problem. I didn't try Netflix because my Roku on both setsusing the same wireless networks works perfectly.  It just doesn'thave Youtube available (yet).I'm going to buy a wifi extender today.If that doesn't fix it, it will be oneBay tomorrow morning.  It's not worth this much time, expense andfrustration just to stream Youtube to a TV.  Also spent 20 minutes or more on Google support trying to get some answers but it's so basic andgeneric that I doubt anyone with a real problem is helped.Evidently works well for a lot of people and has a no brainer price point, but very disappointing so far...", "verified": true, "helpfulness": "3/5", "author": "johnny in the usa"}, {"rating": 1.0, "review": "This is such a great concept, unfortunately it doesn't quite function as intended. After first getting the Chromecast up and running I noticed that it had no sound, and this is where it began. Not being a fan of dealing with tech problems I figured I would step away and come back to it in a few days. Once returning to try and get this item to work it no longer would appear on my tv or computer. So now I have a really cool concept that has no functionality. After being on the phone with Chromecast tech support they suggested that I reset my wi-fi settings, unplug my tv, reset my home router and internet. If this is what is necessary for this thing to work I will pass. If you want an item that works, just go with Apple TV and spend the extra money for an item that is reliable. If you're the type to buy something that doesn't work, then this is the perfect item for you to not watch movies or listen to music through.", "verified": true, "helpfulness": "1/3", "author": "Matthew P. Lemieux"}, {"rating": 1.0, "review": "I have not successfully gotten mine to work yet, had to research some trouble shooting tips and I am going to try again after I figure out how to change my router settings.If this really is the issue, then I think they need to fix it, my phone and other devices connect to my Wifi very easily, why is it that I have to change something on my router?In addition to that, issue, you need to be aware that this thing needs power. The HDMI Plug in is at one end, and There is a USB plug in at the other end, it comes with a Power adapter too so you can plug into the wall, however, you will need to make sure this thing reaches the outlet. By the time you add everyting else, this thing isn't much smaller than a Ruku box. Since it does have a USB, then why not have the option to plug it in to a PC and set it up that way?Each time you take it to a new Wifi spot, you will have to set it up again, and I read that you will not be able to set it up at hotels and on public wifi.If it does eventually work and work well, then I will be pretty happy with it, but so far, it's not looking very good.", "verified": true, "helpfulness": "4/6", "author": "Carson Evans"}, {"rating": 1.0, "review": "The item was rated too high. You can use it only through U-tube, or Netflix. Totally disappointed and use less.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I bought two of these thinking it would be a nice way to stream web content on HD TV's.  Boy was I wrong.  Apparently unless you have high end PC/Tablet configurations, the image on the TV is at best 5 seconds behind the sending device, when it actually connects. And that's with the 5GB setting on the NETGEAR router.  Had another instance where the connection dropped out while the microwave was on (related/unrelated/coincidence? dunno;was able to replicate it on demand though).  Too bad, bought into the hype, very disappointed.  Sent them back for refund.", "verified": false, "helpfulness": "1/2", "author": "MikeS"}, {"rating": 2.0, "review": "1/21/14 Update -I am changing my rating from 1 star to 2 because Google has apparently tried its hardest to overcome DRM hobbling (within the overlord whims of the Bar Association's despotic \"case law\") by enabling streaming from personal devices to Chromecast via RealPlayer Cloud. The effect of this indirect DRM circumvention does not work very well (inconsistent reliability, and only streams small files unless you first upload them to RealCloud), but I will happily grant one additional star for this effort.It is relevant to ask, however, if a small company like Real can enable us to stream videos from our personal devices to television monitors through Chromecast, why cannot a big company like Google do it? Nobody doubts adding the unnecessary detour of RealCloud slows playback. Why not skip it, letting users stream in the fastest and most direct manner possible? For me, the answer is obvious, Google is a big juicy target for DRM lawsuits. Google apparently does not dare to do what Real dares, standing its ground against obsolete DRM middlemen and their corrupt Bar Association lawyers, judges and politicians. Yet I am sure we can agree, \"Don't be evil\" requires taking a stand before acquiescing to that which is personally repugnant  [...]. I call upon members of the Google corporation to do what they personally know is right, and not let the corporate machine override their humanity.10/4/13 Original (One star) Review -Digital Rights Management (DRM) is loaded on this device. DRM makes users jump through hoops and hobbles Chromecast's best features. For example, the DRM on Chromecast determines any SD card to be a threat it cannot control, so it prevents the user from playing music on the phone or tablet through Chromecast until the SD card is removed. Worse, Chromecast does not tell you what the problem is or how to fix it (probably because \"Remove your SD card and jump though a dozen other DRM hoops to make Chromecast work\" sounds a little absurd). Instead, you get the cryptic message, \"Playback error -- Unable to play the song. Can't play a sideloaded song remotely.\"If you google that message, you run into a dozen forums with hundreds of people, each who have a different fix that works for them on their particular setup. By massaging DRM just right, it is possible to get Chromecast to work, but probably not with an SD card because DRM has not figured out how to make anything useful also safe for \"intellectual property\" corporations (and never will for the fairly obvious reason that innovation is at odds with DRM control).None of this is google's fault. Without DRM, Chromecast would be an awesome device, but with DRM, the best features of Chromecast are virtually unusable.", "verified": true, "helpfulness": "1/3", "author": "G. Barton"}, {"rating": 2.0, "review": "I found the Chromecast to be pretty cool the first time I plugged it in, but after realizing it's wimpy to non-existent support for amazon prime video, I decided to return it.  Yes it has access to the web, but it just didn't cast the video from Amazon for me.  Besides, I didn't need a glorified youtube viewer.Besides that I had an issue getting my device to connect to it after the initial setup.  I would set it up, could cast some things, but once I closed the app on my phone, it wouldn't find the chromecast again.  I factory reset the Chromecast a number of times before tossing up my hands and sending it back.  So despite its low price tag, it went back.Perhaps a Roku is what I will end up with.", "verified": true, "helpfulness": "1/1", "author": "D. Elston \"Supersport\""}]