[{"rating": 5.0, "review": "I was very amazed at the capability of this device for its size. Set up was very fast, less than 5 mins. Since I don't have Cable or anything of sort, It become my entertainment system (I have netflix, and Hulu). Most major entertainment app has it (Hulu, netflix, HBO, youtube, etc). The only thing that doesn't work on this is if you cast it from a browser, then, it would only transfer screenshot of your chrome, and not the sound. I hope they can fix this in the future where one can stream music through chrome tab (soundcloud, etc...).", "verified": true, "helpfulness": "0/0", "author": "Minhnhut Vo"}, {"rating": 1.0, "review": "A callous product. Buy only if you want to waste $40.A horrible webpage or iPhone app as the controller. With almost non-existent instructions.A terrible, slow rendering of webpages cast on the TV screen.Bought one for a small TV in the bedroom and really felt cheated.I have a Apple TV box (cost $100) connected to the TV in the living room. That works like a charm.I am neither a Apple fan boy or Google hater. Just an average consumer at ease with technical gadgets.But this Google Chromecast is beyond the pale.", "verified": false, "helpfulness": "0/1", "author": "Pinaki Poddar"}, {"rating": 5.0, "review": "I have purchased 2 so far for every TV in the house!  Hulu plus, netflix, and youtube ready! For amazon streaming? I hook up my  personal laptop when we need it for a rental. (this isn't something we do everyday)  Great little device and great price!", "verified": true, "helpfulness": "0/0", "author": "Alessandro Miralles"}, {"rating": 4.0, "review": "I live in NZ so had to get this forwarded to me. Is a great device cant comment on US streaming services but works extremely well with computer chrome browser, shame this doesn't seem to work on my android tablet and phone chrome browser app but is good for music and you tube videos on these with the chromecast enabled apps. Picture is good on my 40\" samsung 3d series 6 tv. Would have given 5 stars if it worked streaming on chrome app. One great development would be to see it being able to stream anything being shown on computer as HDMI chord can be a pain.", "verified": true, "helpfulness": "0/0", "author": "Sophia"}, {"rating": 2.0, "review": "When I first got this, I tried it on my 4 year old Samsung HDTV - whenever the Chromecast was powered, my TV would have severe interference on all over-the-air channels, making them unwatchable. That also made the Chromecast basically unusable unless I wanted to unplug it whenever I wasn't using it.But it works fine with my brand new (late 2014) Samsung HDTV, so I guess that model is better shielded.", "verified": false, "helpfulness": "1/1", "author": "A. Benenson"}, {"rating": 3.0, "review": "5GHz is most suited for devices which require uninterrupted wider bandwidth for video/audio streaming or multimedia content.Google Chromecast does not support 5GHz only 2.4GHz", "verified": true, "helpfulness": "2/2", "author": "Yago"}, {"rating": 4.0, "review": "I got a Nexus for my mom last Christmas and decided to get her this too so she could play things on the tv. Works really well with playing movies from Google Play, Netflix, and playing videos from YouTube. My mom really likes the screensaver too and keeps it on the screen when no one's watching tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was fed up with cable, satellite because of the commercials that constantly come on. I bought one for the living room and one for the bedroom and use with Netflix or You tube all of the time. I am able to shoot videos of the grandkids and project it on my TV with the Avea app.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really like the chromecast.  I was skeptical at first, but the fact that you can use it on a chromebook or phone makes it a winner", "verified": true, "helpfulness": "0/0", "author": "Michael W. Laing"}, {"rating": 3.0, "review": "It's just dumb to not allow Apple i-devices to broadcast Safari directly to Chromecast. Who opens a browser from a PC to the TV?", "verified": true, "helpfulness": "0/0", "author": "Regular buyer"}]