[{"rating": 3.0, "review": "It's ok!!!", "verified": true, "helpfulness": "0/0", "author": "Nilson Oliveira"}, {"rating": 5.0, "review": "Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Janet"}, {"rating": 1.0, "review": "did not last for a week", "verified": true, "helpfulness": "0/0", "author": "ali kalafalh"}, {"rating": 5.0, "review": "Even though it's fairly limited to a few applications it works very well with them. Note a fairly decent Internet connection is required.", "verified": true, "helpfulness": "0/0", "author": "mark w harris"}, {"rating": 5.0, "review": "Why wouldn't you get one of these? If for no other reason than that you can share YouTube videos on the big screen with friends and family... it's worth it for that alone. Think of how awesome those Russian Dash Cam Videos will look! haha. You can watch Google Play videos on it, too - and screen-share, and much more. A great and inexpensive little tool!", "verified": true, "helpfulness": "0/0", "author": "Maggie Wolfe Riley"}, {"rating": 5.0, "review": "Love it and totally worth it", "verified": true, "helpfulness": "0/0", "author": "Zachary Schoen"}, {"rating": 4.0, "review": "working fine", "verified": true, "helpfulness": "0/0", "author": "Yona Wachsman"}, {"rating": 4.0, "review": "This is a great product but, I have a hard time staying connected sometimes or disconnecting.  I would recommend it for the money.", "verified": true, "helpfulness": "0/0", "author": "mtvick"}, {"rating": 5.0, "review": "I have used chromecast with my cell phone, tv and laptop.  It is very simple to install and works very well with streaming movies from Netflix.  I am well pleased with the price and performance.", "verified": true, "helpfulness": "0/0", "author": "Charles A. Bulluck"}, {"rating": 4.0, "review": "For the price, this thing is awesome. It handles Netflix and Hulu great from my phone.However, now that I've owned it a while, I sort of wish that I'd splurged for something with more features. There are a lot of websites that this device doesn't work with.Also I can't really send video from my computer to the Chromecast reliably. Maybe when I get a faster computer or phone the streaming video feature will work better.", "verified": true, "helpfulness": "0/0", "author": "Rusty504"}]