[{"rating": 5.0, "review": "Love it! However, if you're watching Amazon video you have to switch one of your settings from Silverlight to Adobe Flash. That was a hard fact to find.Set up was easy. Everything works well. I had misunderstood what it works with - must be an internet page you're looking at - but that was my problem.", "verified": false, "helpfulness": "0/0", "author": "SueO"}, {"rating": 5.0, "review": "I own both the Google Chromecast and Fire TV Stick. As I mentioned in my review of the Fire TV Stick, both devices have advantages. What I like about the Chromecast is the easy interface in the iOS app and the fact that Google offers incentives from time to time, i.e. $20 Google Play credit and free movies. Casting from the YouTube and Netflix apps was seamless and the quality of the video was great.", "verified": true, "helpfulness": "0/0", "author": "Sergio Caballero"}, {"rating": 1.0, "review": "Gee...  Chromecast is NOT easy to set up!  It only works with certain types of routers.  If your home wireless network router is not on the list whose default settings work with Chromecast, then the fix is basically for you to go get your masters degree in networking because you're going to have to access your home router to \"Disable Access Point/AP Isolation\",  \"Enable UPnP Multicast\", install \".NET 3.5 Framework\"...  Sounds like fun, the day after Christmas with your hopeful kids who saved up their money to give their dad this gift looking on...?", "verified": false, "helpfulness": "0/1", "author": "RedlandsReader \"redlandsreader\""}, {"rating": 1.0, "review": "Gee...  Chromecast is NOT easy to set up!  It only works with certain types of routers.  If your home wireless network router is not on the list whose default settings work with Chromecast, then the fix is basically for you to go get your masters degree in networking because you're going to have to access your home router to \"Disable Access Point/AP Isolation\",  \"Enable UPnP Multicast\", install \".NET 3.5 Framework\"...  Sounds like fun, the day after Christmas with your hopeful kids who saved up their money to give their dad this gift looking on...?", "verified": false, "helpfulness": "30/44", "author": "RedlandsReader \"redlandsreader\""}, {"rating": 5.0, "review": "Have one in every room. Works great. Easy to use.", "verified": true, "helpfulness": "0/1", "author": "DLRVanHalen"}, {"rating": 4.0, "review": "Chromecast is awesome if you own a regular hd non smart tv. You can stream a lot of stuff from android devices, and PCs if you have the right apps and plug ins, you do need at least a wireless router, or two android devices to use it with no router.", "verified": true, "helpfulness": "0/0", "author": "O. Valverde"}, {"rating": 3.0, "review": "It works ok with SD programs but it is jerky on the picture with HD programs. They need to correct this problem. Also the highest HD setting that they have is 720P and my TV is 1080P. I do enjoy watching shows from the 50's and 60's on my TV which I get from my computer. I would say that if a person wants to watch older stuff then they will love it but the HD stuff needs improvement. You can change the settings from 720P HD to standard definition which I have done.", "verified": true, "helpfulness": "0/0", "author": "Jerry L. Davis"}, {"rating": 4.0, "review": "Cool product", "verified": true, "helpfulness": "0/0", "author": "Kt2011"}, {"rating": 5.0, "review": "Really nice and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Gonzalo Martinez"}, {"rating": 4.0, "review": "What is not to like?", "verified": true, "helpfulness": "0/0", "author": "Herman Goldfield \"Retired and Content\""}]