[{"rating": 5.0, "review": "I love this little gadget. I mainly use it for streaming netflix but it's good for mirroring chrome tabs to your tv too.", "verified": true, "helpfulness": "0/0", "author": "E. A. Senanayake"}, {"rating": 4.0, "review": "No support for the 5ghz band, still pretty much in beta as far as apps go, but a very smooth interface. Enjoyable for what it is. A cheap internet video streaming device.", "verified": true, "helpfulness": "0/0", "author": "william Murray"}, {"rating": 5.0, "review": "I love it ! It is just what the doctor ordered!!!! I couldn't be happier with this item.  It is easy to use and appears to work effortlessly .", "verified": true, "helpfulness": "0/0", "author": "Keith Davis"}, {"rating": 5.0, "review": "Nice little gadget. I use it to stream video from my desktop to my tv. I no longer need connecting hdmi cables.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "I wasn't sure how well Google Movies would play on my Samsung 65\" 120 HZ but it's doing great at 1080p, HD. I'm watching Star Trek right now and there's no difference and NO lag whatsoever. I also received it one day early..thanks to Amazon's shipping. I couldn't be happier. I'll be watching many more movies on Chromcast knowing the quality is perfect on my big screen. Thanks again Google!", "verified": true, "helpfulness": "0/0", "author": "Slinger05"}, {"rating": 4.0, "review": "I love the concept, and the product works really well.  I'm just eager for more and more apps to become available.  There was an update a couple days ago that added 5 or 6 more streaming services so that's a good sign.  Satisfied with the purchase so far.", "verified": true, "helpfulness": "0/0", "author": "JayWavy"}, {"rating": 5.0, "review": "I use this every day and I love it!  I do have to warn you guys that set up MAY be a bit difficult if it doesn't \"connect\".  Once I got it set up though, there has been zero problems.  I heard some people run in to that setup connection problem but a lot don't.", "verified": true, "helpfulness": "0/0", "author": "Tina"}, {"rating": 3.0, "review": "It's cool, but even with Chrome browser and casting a tab, I'd like to be able to see actual full laptop screen activity on the screen. Not, just what chrome chooses to cast. It's fun to cast Netflix and Youtube to the TV. And love the instant power on trigger that the advanced HDMI port on newer TV's facilitate. All in all, I will be very happy to see the Chromecast stick cast more onto my TV. I guess it's all about OS wars really, so I get it. I just hope the product evolves and that we can do more soon. I'd be curious to hear what Android users and Chrome laptop users will be able to do. Onward and Upward!", "verified": true, "helpfulness": "0/0", "author": "Rev"}, {"rating": 4.0, "review": "Its a really cool device.  I got it because it will eventually pair with the Lima and then will stream any video you want to your TV.  Currently I am NOT very happy with the fact that I can't stream EVERYTHING that is on my computer to the ChromeCast.  A lot of AVI files will not stream natively and a lot of workarounds are out there but this should be an inherent function: stream any media on your computer to your ChromeCast.  It would be a 5-star product if it didn't SELECTIVELY stream media from a PC to the TV.", "verified": true, "helpfulness": "1/1", "author": "brad10380"}, {"rating": 5.0, "review": "Works well, I love to use it when I'm binge youtubing.Set up was easy and the video quality adjusts to look good on a large TV.", "verified": true, "helpfulness": "0/0", "author": "Remington Churchill"}]