[{"rating": 5.0, "review": "works great i stream everything from my phone recommend it 100%", "verified": true, "helpfulness": "0/0", "author": "Bryan Adames"}, {"rating": 5.0, "review": "Very good quality, exactly what I expected with this purchase. is a great article I recommend ..usually I use with Nextflix and it's amazing", "verified": true, "helpfulness": "0/0", "author": "Oriel A. Barría"}, {"rating": 5.0, "review": "Product as described.", "verified": true, "helpfulness": "0/0", "author": "Alan H. Londerville"}, {"rating": 5.0, "review": "Easy to setup and use! Comes with everything I needed", "verified": true, "helpfulness": "0/0", "author": "oshei willians"}, {"rating": 3.0, "review": "Synching process seems to be a hit or miss at times.  Sometimes it will sync right away with the device (whether it be apple phone or android phone or macbook laptop or windows computer),  sometimes it just won't...and its happening wiith both apple and non-apple products so I don't think its the devices,  I have reason to believe it's the chromecast software.  And before you say it.... I can assure you it is not user error :)", "verified": true, "helpfulness": "1/1", "author": "Brijesh P \"accord75\""}, {"rating": 3.0, "review": "good innovator that started the trend, but needs much improvement. take some notes from the fire stick!", "verified": true, "helpfulness": "1/1", "author": "TheDude"}, {"rating": 5.0, "review": "For the price, it is hard to beat the convenience provided by this device.a very small price to pay to convert your idiot box to a smart TV!!  The quality of apps available on playstore is increasing and there are some fun games too.A must buy for anyone with a smartphone and a HDMI capable TV.CONS: None, but I wish they streamed in 1080P or 2k video for extra 10 bucks!", "verified": true, "helpfulness": "0/0", "author": "average_customer"}, {"rating": 4.0, "review": "Got it working!  Now if this whole casting thing improves just a bit more and we can access our favorite channels individually by subscription I will be SO HAPPY to get rid of cable!  I would love to have voice commands and I guess that this will be available on all the brands soon.  I just bought this one because it was the least expensive way to try out this new system.", "verified": true, "helpfulness": "0/0", "author": "S. Turnau"}, {"rating": 5.0, "review": "I live in Tijuana, so I needed a player that would work internationally.I first bought a Roku 3. It included several channels, but no Netflix. I returned it and bought the Chromecast instead.My daughters love it. They have Samsung tablets, and control the TV with them (you don't get a remote control, so you must have a computer, tablet or smart phone to communicate with the device).If your TV has a USB port, you can connect the device to an HDMI port and then power it from the USB port. Great solution. If you turn on the TV, it turns on. Turn the TV off, and you turn off the chromecast. No need to stop the movie before turning off the TV. You can also connect it to a wall, but then you would have to stop whatever you are watching besides turning off the TV.You can add an extension to Chrome (the browser) on a PC, and share your browser with the TV.A great product.", "verified": false, "helpfulness": "0/0", "author": "Armando L. Franco Carrillo"}, {"rating": 3.0, "review": "I like the Chromecast idea.  You need your laptop or a smartphone for it. I want to see more apps, but sometimes you end up on sites and you will see the icon for Chromecast which means you can stream it to your Chromecast/T.V.  That being said it has also asked me if I wasn't to stream to my Roku.  If you have a smartphone and only want about a half a dozen apps for video this is for you.", "verified": true, "helpfulness": "0/0", "author": "Three quarters full \"Thanks for Reading - Deekster\""}]