[{"rating": 5.0, "review": "Sooooo easy! And amazing!", "verified": true, "helpfulness": "0/0", "author": "C. Douglas \"Clean freak\""}, {"rating": 5.0, "review": "Awesome. Don't need cable anymore. Always get Amazon Fire, I also have a cheaper off brand unit and it isn't near as good.", "verified": true, "helpfulness": "0/0", "author": "Ronald Maxwell"}, {"rating": 5.0, "review": "best box you will ever buy.", "verified": true, "helpfulness": "1/1", "author": "leonard forbes"}, {"rating": 5.0, "review": "I've only had it 24 hrs.  It works fine, setup was beyond simple, and these things are never easy for me.  I did struggle with opening the remote and finally flipped it with a small screwdriver.  I think it's going to live up to the claims.  I mainly want to review Amazon Customer Support.  My music was not on the Fire TV.  I did not have a clue, I went to the help screen and within 30 seconds was speaking to a rep.  These people are wonderful.  The 1st rep guided me through \"fix it\" attempts, with no success, she forwarded me to another tech, who patiently walked me through the steps, stayed with me for the whole process until the problem was resolved and my music appeared.  Customer Support may be the best thing about Amazon.  They are courteous, considerate, patient, thoughtful and knowledgeable.  Yes, the Fire TV is great.  The Customer Support is awesome.", "verified": true, "helpfulness": "1/1", "author": "Sunstorm22"}, {"rating": 5.0, "review": "We LOVE our Amazon Fire TV! It does exactly what I need it to do and more: we get our shows and movies and even better our Prime music right in our living room. I even like using the Prime music's feature of having lyrics to songs as a Karaoke \"machine\". Just a few weeks after I bought this Amazon came out with the stick and I can't say I wasn't upset to have paid more than double but I honestly understand that you can't replace this stand-alone powerful box and I'd buy it again in a heart beat- best product out there for sure. I'm not going to give a technical review like some other people did but I'll just say that if you have Amazon Prime than you shouldn't be buying any other TV streaming product and should feel very safe getting this one.", "verified": true, "helpfulness": "0/0", "author": "agru"}, {"rating": 5.0, "review": "I've had it for about a month and forgot about Netflix. I still have access to Netflix but right now I don't have time for both. I am probably going to buy another one for the second TV in the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Mark P."}, {"rating": 4.0, "review": "This is a great device that fills a huge void in the video game market for casual gamers like myself.  Amazon has done almost everything right, except for one thing: The device is crippled due to lack of memory and no official way to expand.  Amazon, release the USB memory expansion already!!!  What is the delay?", "verified": true, "helpfulness": "0/0", "author": "Nettie \"Nettie\""}, {"rating": 5.0, "review": "Got this for my in-laws and it is perfect for them!  Super easy to use.", "verified": true, "helpfulness": "0/0", "author": "hawkeye_dani"}, {"rating": 5.0, "review": "I've used the xbox 360, roku 2, smart TVs, smart Blu-Ray players, the Wii, and probably a few other devices that I've forgotten about along the way to stream internet services to my TV. The amazon fire is my favorite in terms of cost/performance ratio. Not only does the Fire have a nice, fast interface, but it also plays games very smoothly, all for a very reasonable price. The voice recognition works about as well, if not better, than any other voice recognition I've encountered in tech. I highly recommend the Fire TV. You can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "thompsje"}, {"rating": 3.0, "review": "need to get more familiar with it.", "verified": true, "helpfulness": "0/1", "author": "Ed Barry"}]