[{"rating": 5.0, "review": "Got rid of my need for cable television service. Easy to set up, easy to use, haven't had a single issue", "verified": true, "helpfulness": "0/0", "author": "Collin Marsden"}, {"rating": 5.0, "review": "This little guy does just what I needed it to do.  I run things from my Nexus and Laptop and they run wonderfully on the big screen. it's not big deal to keep it connected to a power source. Big deal!  It's 35 bucks and you can look at media on the big screen.  It's perfect!", "verified": true, "helpfulness": "0/1", "author": "A. Delgadillo \"angieloohoo\""}, {"rating": 2.0, "review": "It does not work. There is no user guide. Please send me a user guide.It is of no use as it is.", "verified": true, "helpfulness": "0/0", "author": "Enrique Setaro"}, {"rating": 2.0, "review": "Playback via browser has poor quality and sets my computer ablaze as the fan screams and the CPUs work.  I understand it's considered \"beta\", but they have a long way to go to fix it.  Native playback worked fine.  I ended up buying Apple TV...3X the cost, 10x the product.", "verified": true, "helpfulness": "0/0", "author": "Doug S"}, {"rating": 2.0, "review": "The first day I had it Netflix worked fine from my phone. Chrome looked kind of blurry and it was a pain getting local videos to work, but once I did they were constantly freezing with sound distortions. On the third day I had it I went to watch Netflix and got an error message saying it couldn't connect. I went to unplug the chromecast from the tv and it was really warm. Way warmer than I'm used to any electronics getting. I left it unplugged for a while and tried it again.So in short it overheats after three days of being plugged in, casts Chrome very poorly, and Netflix works well. If you only want to watch netflix and don't mind unplugging it every couple days to let it cool down then get it, otherwise find something better.", "verified": false, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "It makes streaming movies from my computer easy. No more wires to run from my laptop to the tv and you can take it and plug it in on any tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I HIGHLY RECCOMEND THIS! IT WORKS AWESOME AND LETS YOU PUT YOUR MOVIES ON YOUR LARGE TV SCREEN!!ITS VERY COOL!! IM GLAD I GOT ONE!!! WHAT ARE YOU WAITING FOR??? LOL GET YOURS TOO!!! HEHECAME TO ME VERY FAST AND WAS VERY EASY TO INSTALL. WORKS GREAT WITH NET FLIKS!TYVM!!!VAL B.", "verified": true, "helpfulness": "0/0", "author": "VALERIE :)"}, {"rating": 1.0, "review": "I got the Chromecast a few weeks ago, and returned it in favor of a NetGear Push2TV Wi-Di/Miracast device.Chromecast, as advertised, was outrageously easy to set up.  But my internet connection, which is pretty fast for most purposes, wasn't good enough to handle what I was trying to watch.  There was constant buffering, lag time with the sound (think dialogue from old 70's martial arts movies), and bad picture quality.", "verified": true, "helpfulness": "0/1", "author": "AFV"}, {"rating": 3.0, "review": "I bought this device basically to view my movies I had converted from DVD and loaded them on my tablet. The only way to view them was to downlaod a app at a cost of $3.99 and it only works on certain files like AVI or MP4 and only if you have WIFI enabled. I wish there was a device that was like this but didn't need WIFI to Stream, say in a hotel room where I can bring my own shows and plug in my HDMI device to the TV and load shows from my tablet wirelessly. As far as this device I guess it's OK for youtube and Netflix or whatever your into.", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 5.0, "review": "This works with everyone's computers and devices - laptop, desktop and android phone. It loads up quickly and the picture quality is good.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]