[{"rating": 5.0, "review": "Wish they would've came up with this years ago. Absolutely love it, works very well. Other companies need to look at this as the number one in adaption plug-ins.", "verified": false, "helpfulness": "10/17", "author": "Jeremy H. Jones"}, {"rating": 5.0, "review": "Sets up super fast and easy.  Awesome picture.  Only 2 small nits that might make me drop it do 4.5 stars.  1) it requires a power cable, which they never so on the adds, so that can be ugly hanging off your tv.  2) Since there is no remote, when we are watching a netflix movie from the iPad, it takes a long time to pause or rewind if you miss something. You have to power on the iPad, open Netflix app (wait......) then hit the pause or rewind.  Too bad they don't have a one button remote: Pause, unpause.I only use for Netflix, so don't know if it has issues with other apps.", "verified": true, "helpfulness": "0/0", "author": "P3t3r P"}, {"rating": 4.0, "review": "I was amazed at how simple it was to set up the device and to use it with my MacBook Air.  I was primarily interested in being able to cast videos from web sites (such as cbs.com) to a TV I don't have a DVR/cable box hooked up to.  I can cast any web site video from my MacBook Air.  One minor note...if you are casting from an iPad or iPhone you can't cast all web videos...you can only cast from You Tube app or Netflix.", "verified": true, "helpfulness": "0/0", "author": "wcr1951"}, {"rating": 5.0, "review": "Really cool more android apps working all the time. Netflix bubble upnp YouTube no need for a roku. Anyone in the house can control it", "verified": true, "helpfulness": "0/0", "author": "Michael Rouleau"}, {"rating": 1.0, "review": "I thought this would be a great addition to our media center, NOPE! The streaming is awful!!! I am quite upset with quality.", "verified": true, "helpfulness": "0/0", "author": "Omar"}, {"rating": 5.0, "review": "I chose the 5 star because it does what I want it to do and it was easy to hook up.If your just someone who wants to stream from Netflex like me this is it. Cant beat the price.", "verified": true, "helpfulness": "0/0", "author": "Sandra Jensen \"Gaia Sandy\""}, {"rating": 5.0, "review": "Works better than I could imagine, just need to tell my router to play nice. I can't believe this wasn't $100 or more. It's great for netflixing cartoons for the kids.", "verified": true, "helpfulness": "0/0", "author": "Chad D. Laibly"}, {"rating": 3.0, "review": "I'm not a huge fan of chromecast.  For what it does it's pretty cool, but it wasn't worth spending the money for me.  I am more of a fan of Apple TV or ROKU than Chromecast.  I have a cable that allows me to hook my MacBook up to my TV and do everything that Chromecast does, without the lag.  With chromecast you have to have some sort of compatible device to link to it and then from there it streams to your TV.  The lag is pretty bad and the setting up was more of hassle than the benefit that I saw in it.  Like I said the cable that I have allows me to hook my MacBook up to my TV and do everything that Chromecast can do and more at a fraction of the price.  If you're looking for a device to hook up to your TV and keep there permanently I would highly recommend an Apple TV or Roku, read more about them and decide which one is better for you.", "verified": true, "helpfulness": "0/0", "author": "John Sugzdinis"}, {"rating": 1.0, "review": "What a piece of Chrap. So slow. Horrible resolution.  Was promptly returned - never to be purchased again. Very very disappointed.", "verified": false, "helpfulness": "0/1", "author": "Jay of CA"}, {"rating": 5.0, "review": "Great product! Very impressed with easy installation. Love to \"cast\" movies from our Android supporting devices.Depending on which high-speed internet provider (and movie streaming service) you use, you may experience faster streamed movies = much higher resolution streamed movie quality, For example, in our home when we do NOT use the Chromecast, then Comcast \"throttles back\" the streaming rate for Netflix down below 0.8 MB/sec (horrible!) when we use any one of my other media players (Apple TV, Western Digital HD Media Player, or Sony Sony BDP-S580 Blu-ray Disc Player). (Comcast is a horrible high-speed internet provider)However, if I stream Netflix directly through the Chromecast, the streaming rate and resulting movie resolution is MUCH higher. This makes sense because Comcast wouldn't dare throttle all streaming and web surfing done directly through any PC or smartphone appearing device. You see, it is not so easy for Comcast to determine IF you are streaming Netflix through a pc/tablet/smartphone, but Comcast can tell based on IP if you're streaming Netflex through many set-top-box style media streaming players", "verified": true, "helpfulness": "0/0", "author": "Stockstradr \"Stockstradr\""}]