[{"rating": 1.0, "review": "I did quite a bit of reading before ordering this and was looking forward to being able to display my photos on our TV.The set up process seemed to go well and the Cromecast would connect to my home network but displayed a message that it could not connect to the Internet.  I restarted the device several times, reserved an IP address in my router.  I could never test casting a web page or any of the Chromecast enabled apps as the device never installed properly.Chromecast is on the way back to Amazon for refund.", "verified": true, "helpfulness": "2/3", "author": "Tom Dowd"}, {"rating": 4.0, "review": "Wonderful tool so far... does a good job with the available options. I'm anxious to see what the future of the device brings!", "verified": true, "helpfulness": "0/0", "author": "John Matherly"}, {"rating": 5.0, "review": "Very easy set-up using the new Nexus 7. Crystal clear video streaming from wireless router using the HDMI extender. Used primary for Netflix and YouTube and works great. Great compatibility with Chrome cast app available for all platforms.", "verified": true, "helpfulness": "1/1", "author": "Jason"}, {"rating": 1.0, "review": "Google did a bait and switch.  Advertised a wide range of video streaming capability and then forcibly \"updated\" all these features out.  This thing is a glorified Youtube player and that is ALL.  Worthless Google.  this device is simply for spying on you for advertising and that is the only reason google made it.  What a stupid worthless device.  I'm taking it back to the store tomorrow.  Good job google!  duuuuurrrr.", "verified": false, "helpfulness": "1/4", "author": "R. McGinness"}, {"rating": 5.0, "review": "Having come from a Roku, the interface system of the Chromecast is so much better. Initially, controlling what you're watching on your TV by using your smart phone seems a bit unwieldy, but then when you actually use it, it becomes extremely intuitive, and you wonder why more devices aren't following suit.The lack of a user interface on the Chromecast itself means that the device can be cheaper, because it doesn't have the programming or require the hardware to run a user interface.", "verified": true, "helpfulness": "0/0", "author": "Damian Harouff"}, {"rating": 1.0, "review": "This thing is DUMB. Save your money and buy something that you can do something with. It does work nice, Nexflix is not preloaded and youtube. Why would you use electric running your desktop or laptop to scream a movie to your TV. Great idea just needs work.", "verified": true, "helpfulness": "2/7", "author": "Fuzz"}, {"rating": 5.0, "review": "The stream quality is excellent from either a smartphone or kindle HD 7! Setup was easy and fast. Piece of cake.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great Purchase. Basically a wireless hdmi cord. Awesome gift idea for the holidays. Works with anything and turns the tv into a very smart one.", "verified": true, "helpfulness": "1/1", "author": "Brian Mandozzi"}, {"rating": 5.0, "review": "I love my Chromecast. It was was very easy to set up the product and have it ready to cast and stream videos. Google Chrome makes it so easy. The price of the product is not bad either. You cannot get any of the other similar products like Roku or Apple TV anywhere close to this price. However, the downside is that it does not support all the streaming websites that those other products do. But I believe that Google is working to improve this product and make it even better. It needs time, I guess.", "verified": true, "helpfulness": "0/1", "author": "H07"}, {"rating": 5.0, "review": "So easy to install.  It took less than 10 minutes and now I can truly watch my movies anywhere.  And I can use it on any TV in my house.", "verified": true, "helpfulness": "0/0", "author": "Working Mom of Twins \"Working Mom of Twins\""}]