[{"rating": 1.0, "review": "After installing could not access internet on any computer, guest or mine.  Not at all safisfactory.  Returned to Amazon.com  where I purchased it.  Installed Roku which worked fine.", "verified": true, "helpfulness": "0/0", "author": "Martha C. Irwin"}, {"rating": 4.0, "review": "the only probs are no local aera traffic and there are some bugs very few and i had to open ports cause its not compatible with my routerbut otherwise im glad i got it", "verified": true, "helpfulness": "0/0", "author": "Cory allan Flasher"}, {"rating": 2.0, "review": "I am not sure what is the problem but I had the third replacement for this device and replaced my wifi router to fix the streaming problem I have but it continually drops streaming and disconnects.  I  tried running in 2.4 GHz or 5GHz but the issue remains.", "verified": true, "helpfulness": "0/0", "author": "Venerando Gacusan Tangco \"Randy Tangco\""}, {"rating": 3.0, "review": "This inexpensive item does an awful lot of cool stuff.  I assumed you could cast ANYTHING that was on your Laptop/mobile screen onto your television.  That is not the case, but it is still a lot of fun and a great way to watch videos and movies.", "verified": true, "helpfulness": "0/1", "author": "Greg Webb"}, {"rating": 5.0, "review": "Use this almost every night. Only disadvantage is it does not automatically play the next episode you have to manually play it on whatever device you are using. A minor disadvantage imo.", "verified": true, "helpfulness": "0/0", "author": "Brett"}, {"rating": 5.0, "review": "The Chromecast by Google is a great buy! Very easy to stream YouTube videos from computer and phone directly to the tv! Worth the buy!", "verified": true, "helpfulness": "0/0", "author": "starfox"}, {"rating": 3.0, "review": "I guess I should have researched this a bit more - I was under the impression that you would be able to show what was on you phone or iPad on your TV. Not so - only YouTube and Netflix. I wanted the ability to show slidshow of pics or even look at Facebook :-(  At least it didn't cost much :-)", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 3.0, "review": "Simple in design and easy to use.  I just wish I could do more with it out of the box.  It was cheap enough for my to purchase out of curiosity.  I haven't used it regularly.  I think the last time I actually used it was 2-months ago", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "This could have been my issue if it wasn't described, but I purchased it to view my computer screen on the TV... When I tried to set it up, it turns out it doesn't work with a MacBook Air... While the tech help person was very helpful and DID get me up and running for a short period of time...it is not working now and I cannot get it working again with this computer.:(  Also, only works with certain sites...not all sites..my ignorance...as I assumed it would \"mirror\" my computer monitor..not the case...just be aware..It works great when it works with compatible computers/ipads and with specific sites like  You Tube, but that's not what I wanted it for.", "verified": true, "helpfulness": "1/1", "author": "bhyogini"}, {"rating": 5.0, "review": "I had used a Netgear streaming player in the past, but it just quit. I had bought 4 of the Google Chromecast players for family for Christmas and they all liked the ease of using their IPhones to program their watching preferences, so I decided to buy one for my bedroom. Love the ease of using it. Very easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Betty H."}]