[{"rating": 4.0, "review": "would be perfect if it were compatible with more appsI  heard they were opening their operating  code up,  but I haven't seen any new apps.And,  the Google play music app won't let you play sings you have already downloaded from Amazon mp3.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Product worked just as described, no issues whatsoever, only wish it had more things to do with it instead of just Netflix and YouTube.  Hopefully there will be an upgrade to the device in the near future to add more programs.", "verified": true, "helpfulness": "0/0", "author": "JimmyG"}, {"rating": 5.0, "review": "Easy to use and set up. Works great. We like it so much we ordered 2 more for the other TVs in the house", "verified": true, "helpfulness": "1/1", "author": "t"}, {"rating": 5.0, "review": "Really like this little guy. Even though I normally watch Netflix through my xbox, I still find I'm using this about once a week for things I want to watch/stream that aren't on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Geoff Weathersby"}, {"rating": 1.0, "review": "This chromecast is not compatible with Amazon videos.  It doesn't work with my mac or my kindle.  It only works when someone brings over a PC.  I wish I had returned it when it was still possible.", "verified": true, "helpfulness": "1/2", "author": "J. Carpenter \"Joanne Carpenter\""}, {"rating": 5.0, "review": "This was ordered as a gift and my mom is very happy with it. It makes streaming a breeze which is what she wanted!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We love it. I like to watch movies on my tablet and projecting it on the big TV screen with the help of Chromcast; it' s  great. Get it as as you can. It's a great investment .", "verified": true, "helpfulness": "0/0", "author": "Pelagie Bong"}, {"rating": 5.0, "review": "Easy to setup, works well, and able to use the \"cast a tab\" feature to cast video from other sites, as long as the computer is fast enough. Worked well on a newer Macbook Pro (1 year old), but the video was choppy on an Intel Core Duo laptop (which is 5+ years old) - would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "M D"}, {"rating": 3.0, "review": "The product is a fantastic idea.  Unfortunately internet bandwidth is not quite there yet.  I bought this product to watch tv shows i missed later because I don't have dvr.  It does work, but often the video lags a second behind the audio and somethimes the audio sounds robotic.  It is no fault of the device-that's obviously a bandwidth issue but still a bit disappointing.  I have 18mbps U-Verse internet.", "verified": true, "helpfulness": "1/1", "author": "Shalynn Ehrhart"}, {"rating": 4.0, "review": "Great for Netflix. Works with really good image quality. Good design, easy setup. Would be better if you could browse from internet and view phone content, but it's not advertised to do so, anyway. That's why I didn't give 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Kellen"}]