[{"rating": 3.0, "review": "its a nice product(built solid), voice search is nice(a little gimmicky), however it does not stand up against the Roku 3 in connectivity or Channels/apps.", "verified": true, "helpfulness": "0/1", "author": "Billy Powers"}, {"rating": 5.0, "review": "Working real well.  I have cancelled my cable movie channels :-)", "verified": true, "helpfulness": "1/1", "author": "Ann-Marie Evans"}, {"rating": 5.0, "review": "This unit is good and works as expected.  It is nice to be able to watch Amazon Video's from my tv.  I wish it would be clearer which video's are free and which are not.  have made a few purchases by mistake.", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 5.0, "review": "flawless, fast and reliable. i highly recommend it!!!", "verified": true, "helpfulness": "0/0", "author": "todd v grewell"}, {"rating": 5.0, "review": "Except to go to work, buy groceries and go to church have I left my couch LOL But seriously, this thing is amazing!!! I was unsure if I wanted to purchase one and I finally set up my movie room in my basement and a friend of mine told me that they'd switch to the Fire TV device after their Apple TV was stolen.  I've been a Prime customer for years and I have a 1st generation Kindle Fire so I figure why not convert and get the FireTV.  Well, my friend told me that Best Buy sold them and I drove with them to the nearest location and low and behold we bought the last one on the shelf! After stopping by Chipotle for dinner, we set up the Amazon Fire TV ( easy as 1,2,3!) and my first movie that we watched was World War Z.  I love the voice search feature and the remote is very sensitive... The only thing that sucks is that my Kindle Fire (1st gen) is not compatible with it.  But I may trade it in for a HD version.  Other than that, I watch all of my fave tv shows, movies and listen to music and I love the screen savers... I recommend this device to anyone that is loves Amazon products and service and wants quality tv without paying a monthly fee for tv watching. There are even apps that you can download and watch tv on (i.e. Youtube, Pluto.tv, etc).  I've also downloaded my HuluPlus and Neflix accounts to my Fire TV device so I'm current with new/current releases.  Love it!!! Get yours today!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The options  are endless. LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Kathleen Braun"}, {"rating": 4.0, "review": "We love the Amazon Fire box for the options it gives us in TV since we do not pay for cable or satellite in our household. Our only disappointment was that we have an older TV and it was not combatible with an HDMI to RCA converter cord. We had to buy a new TV in order for the Amazon Fire box to work. Please put the info in the description so people know.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel S. Christie \"GreenDart\""}, {"rating": 5.0, "review": "This thing is a must for any one the streams amazon or netflix.  Super fast easy to use I love it.", "verified": true, "helpfulness": "0/0", "author": "mayhem99"}, {"rating": 4.0, "review": "I LOVE IT, JUST NEEDS A LITTLE TWEEKING BY AMAZON TO GET 5 STARS", "verified": true, "helpfulness": "0/1", "author": "Lloyd G. Kay"}, {"rating": 5.0, "review": "Quite simply - I love this!!!!!", "verified": true, "helpfulness": "0/0", "author": "J. Rossi"}]