[{"rating": 5.0, "review": "I already had a prime account and a netflix account, so there is no additional cost for me to use Fire TV. I had been using my blluray player to watch netflix and my wii to watch prime instant video and it was tedious and confusing. Now I can watch all my streaming video using one remote and one setting on my video receiver. The voice search works well even though I don't have a clear speaking voice.. I have only been using Fire TV for a few days, but it is doing everything I bought it to do so I have no negative things to say about it so far.", "verified": true, "helpfulness": "1/1", "author": "Dave Zehner"}, {"rating": 5.0, "review": "I love my Amazon Fire Tv I can watch what I want when I want. So many movies and shows. Easy to hook up. The box is small doesn't take a lot of space. The price is unbeatable. LOVE IT!!!!", "verified": true, "helpfulness": "1/1", "author": "doggie closet mom"}, {"rating": 5.0, "review": "Nifty little device.  I just wish it had a button for standby mode as opposed to waiting.  It's actually smaller than I expected which is nice.", "verified": true, "helpfulness": "0/0", "author": "Derrick"}, {"rating": 5.0, "review": "Just an FYI ... Amazon reached a deal HBO to stream many shows from HBO network to your amazon prime account which is GREAT! Along with now being able to use HBO GO as well.Google it for more details!!!Here is the article (Apr 23, 2014 at 10:02AM)..........Big news for HBO fans: You can now watch many shows from the pay cable service without actually paying for cable, or buying the DVDs (or pirating the shows).HBO has made a major deal with Amazon that gives Amazon Prime members unlimited streaming access to past seasons of shows like The Sopranos and Deadwood, as well as select seasons of current series such as True Blood and Boardwalk Empire. (See the full list below.) This is HBO's first deal licensing its content to a streaming service. On average, the deal covers content that is at least three years old. For newer seasons, sorry -- HBO still requires you get a subscription with a cable or satellite provider.The network has previously licensed some content to basic cable networks, a move that's actually keeping a few shows off Amazon Prime for the time being since they're tied up in other deals (namely, Sex and the City, Entourage and Curb Your Enthusiasm).Also, HBO is not putting its top-rated show, Game of Thrones, on Amazon Prime (because, frankly, Thrones is too big of a breadwinner for the network -- it's DVD sales have set records).There's also a second part of the deal which allows owners of Fire TV -- the company's new streaming box -- to watch HBO's current programming online service HBO Go. (But you still need an HBO subscription through a traditional provider, and HBO already made a similar deal for Kindle Fire.) Fire TV is a Roku-like box that allows you to stream online TV services like Netflix, Hulu, Amazon Prime and, eventually, HBO Go. Amazon is targeting a year-end date for adding the HBO service.Here's all the shows going onto Amazon Prime starting May 21, from HBO's release:  - All seasons of revered classics such as The Sopranos, The Wire, Deadwood, Rome and Six Feet Under, and of recent favorites such as Eastbound & Down, Enlightened and Flight of the Conchords. Update: Oz too.  - Epic miniseries, including Angels in America, Band of Brothers, John Adams, The Pacific and Parade's End  - Select seasons of current series such as Boardwalk Empire, Treme and True Blood  - Hit original movies like Game Change, Too Big To Fail and You Don't Know Jack  - Pedigreed documentaries including the Autopsy and Iceman series, Ghosts of Abu Ghraib and When the Levees Broke  - Hilarious original comedy specials from Lewis Black, Ellen DeGeneres, Louis CK and Bill Maher  - The multi-year deal will bring additional seasons of the current series named above, along with early seasons of other series like Girls, The Newsroom and Veep to Prime members over the life of the deal.", "verified": false, "helpfulness": "9/9", "author": "Chris I."}, {"rating": 4.0, "review": "I have a Sony Bravia HD TV. Have  Chrome cast, WD TV live, OUYA, PS3  and a Blue ray player. Bought AFTV due to the amazing specs and to to side load XBMC. Content availability (apps) and flexibility (to side load apps like XMC) is good, but the video (picture) quality when I play HD content from Prime or Netflix is horrible.For comparisopn, playing Netflix content through Chromecast is super crisp and clear but when i play the same video through AFTV,  there is some kind of black / grey hue and picture quality is not as sharp and crisp. I played with video settings and set it to max (1080P @60Hz) but still Video clarity was not good. I use Amazon's HDMI cables, tried swapping cables with WDTV and the same issue, so its not anything to do with cables. Have tried this box using wireless and wired, and I have 50 mbps download speed, so its not the internet connection either. It's a disappointment if a box with such nice specs does not do the basic thing it is made for, deliver HD video for HD content..I really hoped that this would be the one.***Update - Connected to a different TV (Samsung) and Pic quality seems to be better? Increased the stars because I was able to load XBMC for Ouya on this and can also watch Amazon prime and Netflix on the same device. i dont think there exists a device today which can do all 3 (Amazon Prime, Netflix and XBMC). If only I could access my NAS without having to go through Plex or XBMC!", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Set up was awesome...and EASY.Literally did everything by itself except for me putting in my network password.It is FAST loading too. Way faster than my Roku by far.But the voice search is awesome...but only very limited.The interface to find movies is terribly set up and laid out....and if you don't shell out the $99 for Amazon Prime...there is nothing on there for free basically.I am disappointed as I am an Amazon fan and expected more from them.", "verified": true, "helpfulness": "1/3", "author": "Rich U \"spousespy\""}, {"rating": 4.0, "review": "Everything is great about the amazon fire, I only wish to get more free movies available for the Fire.  I am sure as things progress that will change.  Even though a lot of the TV shows that cost $$ I can get for free with my Direct TV I am in the transition of trying to reduce the already $900.00 plus a year bill with Direct TV.  Amazon Prime, Hulu Plus and Netflix as a combo is way cheaper per year.  Overall I would recommend this as a great addition with the combination of the others and not as a stand alone only media source.", "verified": true, "helpfulness": "0/0", "author": "Anthony Solorio"}, {"rating": 2.0, "review": "I had high hopes for this, but it fell way short. I like the remote and I like the optical out put for audio, but it was not as easy to set up as my Roku was and it just doesn't work like it should. Right out of the box it took 4 tries to get it to see the remote, and then it took 6 tries for it to download the latest software. Once it finally started downloading the update, it took forever. I final got it up and running, tried to watch a show on Hulu and the video kept freezing while the audio kept going. Very annoying. I was hoping it would work it self out, but 2 days later and it's still doing it. I'm going to send it back today. I'm still on the fence if I'm just going to get another Roku or if I'll try another Fire TV. I'm hoping mine was just defective and if I get another it will be as fast and seamless as they are made out to be.", "verified": true, "helpfulness": "2/4", "author": "Bill H."}, {"rating": 5.0, "review": "Amazon fire TV it's a complete device and it's easy to use and set up. It's all what you need to stream videos, pictures, music and games. It would be nice if The Fire TV had a web browser to increase the possibilities with this great device.", "verified": true, "helpfulness": "2/2", "author": "LEONARDO"}, {"rating": 5.0, "review": "As you expected from Amazon, the Fire TV is user oriented, very easy to install and use, I highly recommend it", "verified": true, "helpfulness": "0/0", "author": "René A. Lankenau"}]