[{"rating": 4.0, "review": "The UI is fast and responsive. Improving with bug fixes and updates.  Great buy if you are heavily invested in the Amazon eco system.  Otherwise you might have better options elsewhere.", "verified": true, "helpfulness": "0/0", "author": "A. Nichols"}, {"rating": 3.0, "review": "No prime music, LAME, LAME, LAME!!! They have been saying it's coming forever, still isn't here. One of THE main reasons I bought it. NO space, and you can't add your own storage!!!! USB port is useless!EDIT: Now has Amazon music so I gave it another star, still NO space, and useless USB port. At least it runs XBMC, so it's not THAT bad.", "verified": true, "helpfulness": "4/5", "author": "Rob D'Aquin"}, {"rating": 5.0, "review": "Love this.  Easy to set up and easy to use.  Love watching movies on my tv with this device.  Worth the money.", "verified": true, "helpfulness": "0/0", "author": "L. Scheve \"sassesmom\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Giuseppina Passalacqua"}, {"rating": 2.0, "review": "The built in streaming services like primetv, hulu and netflix work great but my primary reason for buying this was to have a nice frontend for my plex server that I stream all my digitally converted movies from. Plex absolutely sucks on this device. I realize this is mostly the fault of the Plex developers, except that the Plex app works flawlessly on my phone, laptop, tablets, chromecast, every other android device etc. I don't know what the issue is between Amazon and Plex but it makes for a terrible experience. I will be figuring out a way to resale mine since I've had it longer than 30 days and will replace it with a Chromecast. The Chromecast has been able to play everything I throw at it flawlessly despite being wifi only.Bottom line, if you intend to use this as a Plex frontend, keep looking.", "verified": true, "helpfulness": "3/4", "author": "Josh"}, {"rating": 5.0, "review": "I love it! La mejor compra que he hecho en este año!", "verified": true, "helpfulness": "0/0", "author": "Socrates A, Del Orbe Calzado"}, {"rating": 1.0, "review": "Worst purchase I've made with Amazon. Sad. Unit refuses to work after a few months and Amazon is not replying to my complaints. It'sjunk and a total loss.", "verified": true, "helpfulness": "2/5", "author": "D. West \"DDonal\""}, {"rating": 5.0, "review": "Easy to put together and use. I am having a ball with Netflix and Amazon videos!!", "verified": true, "helpfulness": "0/0", "author": "Lois L. Voncannon"}, {"rating": 5.0, "review": "This is the best.  I like it better than my apple tv.  I love the voice command.  It works very well.  I still have to hang on to my apple tv foe certain apps that are specific to apple.  I tried buying the fire tablet bit it lacks what apple could deliver so I kept both.  I hope fire tv adds more apps.  We like spirit  clips and hallmark.  I'm hoping they will eventually add these as well.", "verified": true, "helpfulness": "2/2", "author": "J. Jerg"}, {"rating": 3.0, "review": "The five star reviews here are indubitably from \"Newbees\" to video streaming. Yes, streaming is \"miraculous\", but this Amazon box has shortcomings (compared to Roku and probably Apple TV). Experienced streamers have found several negatives. (Read those 2/3 star reviews.)One irritation, and no doubt confusing for newcomers, is the \"Push\" Amazon is doing for their own content (movie rentals and music downloads) and \"Join Prime\". (BTW, I've been Prime since Day One.) As others have said; this is really a device aimed at Amazon movie rentals and Prime subscription. Netflix, Pandora (music), Crackle, Vudu, hulplus, ESPN, PBS etc. are 2nd (maybe 3rd) string using this device. Roku, on the other hand has a slick, easy-to-use unbiased interface whereas the Amazon menu system is clunky, and parochial.And another \"oh-oh\" issue: If nothing is being streamed for awhile, the box turns itself \"off\". So you turn on the TV and nothing but a black blank screen! There is no On/Off button on the remote; by chance pressing any button woke it up so it wasn't the TV going dead.  The box has a little LED pilot light that indicates On/Off, but if you locate the box, say, at the rear of the TV the LED isn't visible. (The Remote uses RF instead of an IR beam so you can place the box out of sight. Nice feature but note the drawback in the previous sentence.) Every other component in our system provides something on the screen while \"asleep\", all of which are dynamically moving around so no screen burn: Roku (moving logo), FIOS TV (\"Press Menu to view\"), Dish (logo), WD Media Viewer (menu). Note that power (electrical) use is trivial in those cases (no image processing, just a dumb signal), so Fire can't make that a big deal (\"Eco-friendly\" hype-phooey). IN FACT, Fire IS using power, even when \"OFF\" in order for its RF receiver to detect the Remote's button-pushing. The power used by those other components to supply a screen logo or whatever is epsilon, about the same as a couple of LED pilot lights. (Look around your house at night with the lights dimmed and probably see ten's of LEDs glowing. So why Fire is going blank seems to be an \"Eco\" PR feature, but confusing for us.Engineering/Accounting flaw: Moiré effect.  Amazon Fire has a default screensaver comprised of many slides of beautiful landscape scenes from around the world. Magnificent mountain, ocean, and desert scenes (AND some foreign cities). The bad feature, is using a slide transition that implements an \"Ultra-Slow Zoom\" to hint that the observer is flying along in an airplane or whatever. This technique is popular in TV shows like Soap Operas and drama movies and the like where watchers are supposed to feel focus on the actors emotional attributes. Gets to be annoyingly redundant after a while. AND, in order to save ROM, a cost-saving implementation reduces the flawless original photographic resolution to something like 1080. What happens then, during that slow zoom algorithm, a dynamic Moiré artifact pattern is introduced. Parts of an image where a beat frequency exists result in a \"shimmering\", \"sizzling\" effect in regions of the scene. Sometimes mountainsides appear to be smoldering, water scenes as though excited by ultrasound and so on.  Highly distracting and cheap-appearing. Had the original photographic resolution been retained ($$$), the feature probably would have been acceptable. Suggestions to Amazon: get rid of the ultra-slow zoom or use original very hi-res photo storage. And get rid of potentially offensive man-made objects, like places-of-worship and certain foreign cities. Another hint for Amazon: On those beautiful screensaver scenic photos, put a little title/phrase (in text) in the lower corner mentioning the locale of the scene. Like Grand Canyon USA, or Palau reef etc.One nice Fire TV compatibility: the new NetFlix multi-user feature: You can have more than one user, each with a unique \"User Profile\" for their own personal \"My List\" (viewing preferences). Mom has her Chick Flicks, Dad his Sci-Fi, Junior Sponge Bob, and toddler Curious George. Up to now, NetFlix viewing preferences/suggestions have been co-mingled and a pain to slug through for each individual. Very cool feature. Unfortunately, I don't believe Amazon streaming has caught up with this yet.Something I miss (we have 4 Rokus in the house) is RCA or 8mm AV jacks. Analog seems passé, but not so. For people wanting to listen privately or for the hearing impaired or to avoid harassing the neighbors with 5.1, the EARS wireless earphone product (Amazon sells them) is great, EXCEPT; it needs a traditional RCA jack connection. (You know: Red, White and Yellow plugs, or an 8MM-to-RCA cable.) So those old TVs you have are now junk. The little cheapo TV in Johnny's bedroom and the lady's kitchen TV work with this box. Some Roku models, on the other hand DO have AV output.WHY IS STREAMING WONDERFUL? No, it's not HDTV, which of course IS nice, but the fact that there are NO COMMERCIALS! (I counted ten in a row recently on a broadcast channel, and a couple were repeated in the same break!)These streaming boxes; Amazon/Roku/Apple, will soon be unnecessary. New TVs are \"Smart\", meaning they will stream content with built-in hardware (no box needed). Drop by Costco or Best Buy and check out the new Smart big-screens.I returned ours and went back to Roku. Perhaps Version Two will be better. Keith", "verified": true, "helpfulness": "5/10", "author": "Pentatomidae \"Miscreanter Pentatomidae\""}]