[{"rating": 4.0, "review": "Chromscast works pretty well but doesnt always have the best sync. Oce media starts to play it usually plays all the way through but occasionally it sucks.", "verified": true, "helpfulness": "0/0", "author": "G. Maher \"King of the Amazon\""}, {"rating": 5.0, "review": "It took me a while to figure this product out, but now that we have it working I'm very pleased. If I could just get my WiFi to cooperate!  The other evening we couldn't watch a documentary because my gadgets kept reloading.  I'm assuming it was my WIFI.", "verified": true, "helpfulness": "0/0", "author": "Betsy"}, {"rating": 5.0, "review": "Excellent device.  My kids and I use it all the time.  Works well.", "verified": true, "helpfulness": "0/0", "author": "Jeff Kennard"}, {"rating": 5.0, "review": "For the price, you can't beat this.  great little product..", "verified": true, "helpfulness": "0/0", "author": "Happy Buyer M-LA"}, {"rating": 4.0, "review": "I bought this and a Roku stick, for the money this is a very good deal. I prefer the ease of use of the Roku stick over the Chromecast. Would not hesitate to purchase this again and have recommended it to plenty of people who dont want to fork out $50 for a Roku.", "verified": true, "helpfulness": "0/1", "author": "Michael"}, {"rating": 5.0, "review": "Works as much as you'd expect, every now and then it randomly disconnects but it's easy enough to get it back That being said, I'm happy with it, it's intuitive, has a fast connection, and does what I want it to.", "verified": true, "helpfulness": "0/0", "author": "Abigail"}, {"rating": 5.0, "review": "Awesome experience!", "verified": true, "helpfulness": "0/0", "author": "Marissa Luz"}, {"rating": 3.0, "review": "Ya it is cheap ... and the set up is easy ... but when I got a Roku 3 my Chromecast became obsolete.  Roku does almost everything Chromecast can do (except mirror a Chrome browser ... which surely is valuable ... especially for presentations) yet Roku does so much more! Most importantly Chromecast does not stream Amazon Instant Video!  Good thing this is so cheap as it falls way short of Roku and Apple TV and Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Christopher J. Owens"}, {"rating": 5.0, "review": "works perfect", "verified": true, "helpfulness": "0/0", "author": "Rodney K. Tarzwell \"Iceman\""}, {"rating": 3.0, "review": "Appear valuable, but how often do you \"cast\" images when you can just connect the device to a smart tv with an USB cord.  Firestick much better value.", "verified": true, "helpfulness": "0/0", "author": "R.B.L."}]