[{"rating": 4.0, "review": "I really like my Fire Stick and particularly love the fact that it is so portable. Set up was very easy and accessing Amazon Prime video as well as Netflix and Crackle has been great. I don't understand why I can access Showtime Anytime from my Kindle but not the Fire Stick. I also wish HBOGO were an app I could access by Fire Stick as I can on my Kindle. If not for these two shortcomings I might have gone with five stars.", "verified": false, "helpfulness": "0/0", "author": "Kathryn E. Claxton"}, {"rating": 5.0, "review": "So much easier to use than Apple TV.  Very easy set up - up and running in less than 5 minutes.  Voice search works great.  Been enjoying tv shows and movies all week.  Seems to buffer much better than Apple TV also.  Only 2 instances of slight buffer time in the middle of shows.  Recovered very quickly. Apple TV took about a minute to recover and happened much more often.So far so good - getting another one for kitchen tv.", "verified": true, "helpfulness": "0/0", "author": "Mark M"}, {"rating": 5.0, "review": "A must buy if your a prime member. Comes with all the basics like Netflix nd hulu and more. But prime will allow you to see even more free shows and movies", "verified": true, "helpfulness": "0/0", "author": "Caelan doorley"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Donna Barber"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Ayobami L."}, {"rating": 5.0, "review": "Wow! Movies, music (my favorite) right at my fingertips! Easy to install, easy to use. Had no problem with initial set up. Have spent a ton of time adding movies and music to my watchlists - I could spend all day browsing the movies to watch. I figure I've already watched enough movies to pay for the Fire TV. We've had no issues whatsoever with the streaming, pausing, etc. This just couldn't be any better.", "verified": true, "helpfulness": "0/0", "author": "Jeanette G."}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "M. Morales"}, {"rating": 5.0, "review": "Visiting my oldest daughter out of state, she showed and recommend it.  I spent two weeks using it and enjoying it...soon as I got home I ordered mine and have been enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Felix E. Ramirez"}, {"rating": 5.0, "review": "I like it alot.  Watch movies etc.  I would have bought two sticks over this but I like it.", "verified": true, "helpfulness": "0/0", "author": "Gail Geriak"}, {"rating": 5.0, "review": "My kids love our new Fire TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]