[{"rating": 5.0, "review": "Pros: Everything that Chromecast says it will stream works.  I know that other companies are working on getting other applications to work, like HBO Go and I absolutely am excited about that!Cons: If your TV does not have a USB port, you will still have to run a power cord to the wall.  Pretty minor, since newer TVs already have built-in USB ports.HIGHLY RECOMMENDED!!!", "verified": true, "helpfulness": "0/0", "author": "Manny Reyes"}, {"rating": 5.0, "review": "Google really got it right with this.  The out of box experience was flawless, and within a few minutes I was streaming YouTube and Netflix content on my television and controlling it from my Nexus 7.  It was one of the few products that I felt compelled to toss away the packaging right away because it was clear that I'd never need it again -- this thing is likely to have a long and productive life attached to the back of the television.Actually, my one nit with the device: the white status LED is far too bright, but it's nothing that a bit of black tape won't fix.", "verified": true, "helpfulness": "0/0", "author": "T"}, {"rating": 1.0, "review": "Can't rate this product does not work in CostaRica, hoping to be able to use it someday. Hope Google will get the app working here.", "verified": true, "helpfulness": "2/3", "author": "Ian Mac Allister"}, {"rating": 5.0, "review": "Excellent, easy to configure and works well. and the Build quality is more than expected.Work well with my iphone and ipad. expecting more app to support it.", "verified": true, "helpfulness": "0/0", "author": "Tom \"TT\""}, {"rating": 5.0, "review": "This product came faster than I expected. Seamless set up and works great. No bells and whistles like Apple TV, but it's great for streaming content from your mobile devices.", "verified": true, "helpfulness": "0/0", "author": "Richard A. Hayman"}, {"rating": 4.0, "review": "Easy to setup and works great with Netflix. Cannot play music stored on my device with Goggle Play Music program. It must just be for streaming off of the Internet. Really do not want to open a Goggle streaming music account. Hope more companies sign on, especially Pandora. Noticed Sony has or will have a similar device. Worth the money but disappointed about the music.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 3.0, "review": "a bit limited for now, especially outside US.google should add upnp support to it and would be perfect :)", "verified": true, "helpfulness": "0/0", "author": "Liviu Sas"}, {"rating": 1.0, "review": "Since Chrome upgrade to a new version, I cannot cast my webpage from Chrome webstie to the TV anymore.  Therefore, you might want to reconsider if you want to mirror content from the website to a big screen.", "verified": true, "helpfulness": "188/243", "author": "Keng Qui"}, {"rating": 3.0, "review": "Easy to install, but would prefer more flexibility in controlling TV from phone other than start and stop. Was supposed to get three months free service from Netflix. Entered the codes given to me, but still being charged full price from Netflix. Will give them one more month to correct bill. Besides Netflix, the only other uses for this are U Tube and Google movies. I'm waiting for them to add ability for me to be able to access other programming.", "verified": true, "helpfulness": "0/1", "author": "Stephen Kennedy"}, {"rating": 1.0, "review": "This is a player for Netflix and Youtube, and that is all I could get it to do.  I already use my Roku for that (and so much more), so this was useless for me.I thought it would show anything from Google Chrome on my TV.  I could not get it to show anything that was not Youtube.  I only tested it on Youtube, as I currently don't have Netflix.A useless device, just get a roku instead and save yourself some trouble.  The Roku is more expensive, but worth the price.Very disappointed.", "verified": true, "helpfulness": "3/6", "author": "Ashley"}]