[{"rating": 5.0, "review": "Awsome…", "verified": true, "helpfulness": "0/1", "author": "Vincent Adamkiewicz"}, {"rating": 4.0, "review": "Took some updates and phone help to get Netflix working. Phone help was excellent by the way.", "verified": true, "helpfulness": "0/0", "author": "R. Hall"}, {"rating": 5.0, "review": "I am very pleased with this purchase. Fire was so easy to connect there was no crazy frustrating stomping or cussing. I've been using it mostly for listening to my music & Pandora right now. But once this holiday season is over & there is more time to relax I'll definitely use it for TV & movies I've wanted to watch. It also offers some really great apps & has some of the games I play so I'll be playing with it more. I highly recommend purchasing one for yourself or as a gift. It's well worth it.", "verified": true, "helpfulness": "0/0", "author": "New York Moose \"Claire\""}, {"rating": 5.0, "review": "I bought the amazon fire tv after having pre-ordered the amazon fire tv stick.  For whatever reason the amazon fire tv sticks were being sold in stores on black friday 2014 while my preorder I placed when the product was announced was delayed to December 2014!  I cancelled the amazon fire tv stick preorder and was shopping around when I saw the bundle sale on the amazon fire tv on amazon.com.  The additional power and additional ports were too tempting at the black friday price.  I also bought the amazon fire hd 7\" tablet that was also on a bundle sale on the website since I heard there were some neat features between the two products.I already own a 3rd gen apple tv, ps3, ps4, a samsung blu ray player with wifi and apps and I've hooked up various pcs to the tv as htpcs.  Basically these machines overlap in capabilities and going with any of them will give you streaming to some services but all will have pros and cons.  I won't go into a comparison as it'll be a lot more typing than I want to do.A few highlights of my couple weeks with the device are as follows:The voice search works extremely well.  Shockingly well, in fact.  My voice is very low and soft and most automated pbx systems and siri won't understand me.  The fire tv takes under a second to process my voice prompt and return one to a few relevant search prompts.  The search results are relevant and useful.  The downside is it only works with amazon products.I have an amazon prime account and the amazon prime streaming library is large and has some pretty neat tv shows and movies.  The device buffers quickly and plays back hd streams quickly.  The first minute or two will be low definition and grainy but as the stream buffers the resolution will catch up and quality is good.I also have a netflix account and buffering and streaming on the amazon fire tv is similarly quick.  I like the ui layout on the apple tv better though.I've tried a couple amazon fire tv apps and they work pretty well.  I haven't tried any games but that's not what I bought the device for.I wanted to use the device for undocumented purposes (xbmc/kodi apps, etc) and I won't go into details but the device is working out great for what I wanted.  There's a lot on the internet about the hows and whys.I haven't turned on my apple tv since I've gotten the amazon fire tv and I use the ps3/ps4 for games and the blu ray player for blu rays and dvds.  I use the amazon fire tv for all my streaming/media playing.  The amazon fire tv is a powerful device with some pretty neat features and for my purposes will probably service me well for the next few years.  Highly recommended.", "verified": true, "helpfulness": "1/1", "author": "CookieMonster"}, {"rating": 2.0, "review": "Having a difficult time finding anything that is free! It seems everything we want to watch is like 2.99! I am a prime member and I thought that a lot of movies and tv shows would be free, what's the story?", "verified": true, "helpfulness": "1/5", "author": "kate ruggieri"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/2", "author": "ccerj5"}, {"rating": 2.0, "review": "Sometimes movies or apps will not run. Not sure why. $4-6 to rent a movie or possibly more. Not sure if that's reasonable or not. I should have just gotten Chromecast seems efficient and alot cheaper. If anyone has helpful tips please share", "verified": true, "helpfulness": "0/2", "author": "Raquel"}, {"rating": 1.0, "review": "You need wires to use this product", "verified": true, "helpfulness": "1/16", "author": "candi"}, {"rating": 5.0, "review": "It feels my needs. So far so good.", "verified": true, "helpfulness": "0/1", "author": "Pokerface58 \"bambam\""}, {"rating": 5.0, "review": "Could not figure it out 1st time.Will  give it  another try.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}]