[{"rating": 5.0, "review": "This has worked flawlessly since I hooked it up a couple months ago. I replaced the Samsung App on my Blu Ray player and have no experience with competing products. Really fast response times. Great selection from my Amazon Prime subscription and love that I can also access my Netflix and HuluPlus. My kids (6&7) talked me into a subscription for DailyBurn and we do the yoga classes. The remote is amazingly well thought out and the voice commands have been remarkably accurate. Now if only it would include HBOgo!", "verified": true, "helpfulness": "1/1", "author": "DougV"}, {"rating": 5.0, "review": "The best part is talking to it instead of having to spell out names and titles.The worst part is finding time to use it.", "verified": true, "helpfulness": "2/2", "author": "shannon"}, {"rating": 4.0, "review": "This is a great product.  Set up is easy.  Using the product is easy. The speak to button is great.  Product comes with helpful tutorial.The only reason I did not give it 5 stars is because it is really confusing to search and watch only Prime videos.  I find myself looking for just amazon prime content but it is mixed with content you have to buy so I ended up setting up parental controls so I am forced to input a pin before watching a show in order to double check I am watching something included with Prime.I really wish there was a way to filter this content. Also, I wish it would be easy to access kid oriented content.  Like Netflix does with profiles.Good product, not so easy navigation.", "verified": true, "helpfulness": "2/3", "author": "Robert L Rueda"}, {"rating": 3.0, "review": "Great if all you want Is amazon prime, netflix, and hulu content. Only about 25 channels and only 3 or 4 free that are worth watching. No PBS, History, or any other learning channels. It does have Smithsonian. It is fast and voice search is awsome but only for amazon content.", "verified": true, "helpfulness": "0/2", "author": "spgd01"}, {"rating": 4.0, "review": "If you have Amazon Prime a definite plus. I don't have Netflix or any other service, but if they have the quality of Prime this is a real keeper. Crackle is a pleasant surprise also. I would recommend spending some time checking it out. I am very happy with it and the prospects in the future.", "verified": true, "helpfulness": "0/0", "author": "R. Shirley"}, {"rating": 5.0, "review": "I had seen this on Amazon web site but when I saw the Gary Busey commercial I knew I had to have it.  Once we had it set up I pushed the microphone button and said Gary Busey and sure enough all his movies pop up on the screen.  I have tried several other searches and rarely has it let me down.  When it does it is mainly do to me having a little trouble enunciating certain words after dental surgery.  Overall this is an excellent value, especially if you use Amazon Prime and Instant movies.  Even if you don't use Amazon I think you will find all the features worth buying for such a great price.  It is great using apps and games as well on the TV, and if you have a big screen it looks even better.  The menu system makes it easy to choose and the microphone is by far easier to do a search than using the type in one letter at a time approach you find with most TV remotes.  I will be glad when cable TV comes up with this type of talk to remote.CA Luster", "verified": true, "helpfulness": "2/3", "author": "C. A. Luster \"The Rook\""}, {"rating": 5.0, "review": "I am very pleased with my Amazon Fire TV.  It does everything I need it to; now I don't have to use my PS4 to watch Netflix or anything else (there's no Pandora on PS4 and it comes with a REAL remote control).  Navigation is very simple, voice searching works like a charm, and it loads / plays quick with very little waiting.I have only had one problem with it so far.  My power went out briefly one day while I was watching Netflix.  When power was restored at my house, the Fire came up and I could navigate within it with no problem...but when I tried to restart Netflix and continue the movie I was watching, all I got was a black screen.  I tried it two or three times before changing tactics.  All it took was me unplugging the power adapter for 2 or 3 minutes and it was back to full capability.This was a very wise purchase for me, I have no complaints whatsoever, though I do have to echo the sentiments of those who would rather the FREE with Amazon Prime movies to be more clear when browsing.  There should be, in my opinion, a different menus for Paid For movies, Paid For with Prime movies, and Free with Prime movies.  They're currently all under one roof, which can be a little irritating at times.", "verified": true, "helpfulness": "2/2", "author": "Cadence"}, {"rating": 5.0, "review": "Was frustrated with on demand services offered by cable companies, so I got this to use to watch movies, etc. Love it", "verified": true, "helpfulness": "1/1", "author": "C Mitchell meyers"}, {"rating": 5.0, "review": "Great deal,No problems with voice command ! One problem is if internet glitches you have to reset everything.But it doesn't happen often, I have an Apple tv right  next to it and it kicks Apple tv,s  butt !!! I keep Apple tv because it was a gift from my daughter for my 50th Bday.", "verified": true, "helpfulness": "1/1", "author": "philip adams"}, {"rating": 4.0, "review": "I purchased the fire tv as I mostly watch tv through prime and wanted a way to avoid having to stream through my laptop all the time. I can say that it has exceeded my expectations in every way, streaming is nearly instant and i find the interface quite user friendly. I enjoy the fact that it's always ready to watch, and while I do have a higher end laptop the fire tv is faster for general watching. If I could add one feature it would be the ability to stream tv from networks that allow online viewing. Having no tv service I do enjoy watching NBA and NFL games on the few networks that stream them, along with a few weekly shows. This is the only reason I gave fire tv 4 instead of 5 stars, and while I knew this was the case when I bought the unit I'm still a little disappointed. Overall I am happy with fire tv and would purchase it again, I just hope Amazon can find a way to address this one small complaint, the box clearly has the hardware, so i am hopeful streaming live tv will be possible in the future.", "verified": true, "helpfulness": "2/2", "author": "Patrick Richardson"}]