[{"rating": 5.0, "review": "Set up is nearly automatic, picture is superb and cross platform usability (I Pads and Phones AND Windows PCs) is great.Only negative is lack of Amazon player app for me.", "verified": true, "helpfulness": "1/1", "author": "Wayne J."}, {"rating": 1.0, "review": "This is an extremely difficult device to set up.  It requires you to download an application on your PC or phone.  On a PC, it requires your PC to have 'native' WiFi.  That means that the chrome cast application has to be able to directly access the WiFi interface.  My PC has a USB wireless adapter that uses a separate WiFi interface, so no luck there.  Then I tried to use my MacBook Pro laptop.  The setup detects the unit, then shifts your WiFi to join a ChromecastXXXX network (XXXX is a number assigned to your device).  You are then given the address 192.168.254.253 to connect to the unit.  Once you verify a code on the unit, you provide the unit you WiFi network and key.  The unit and my laptop then both rejoin my WiFi network.  Here's where the problem comes in.  Your WiFi router must support uPNP, otherwise you can't find the Chromecast device.  Since I use a work provided router, no luck there.So I had an old DLink wireless router, that supports uPNP, and I tried to set it up again from my Apple laptop.  After going through the steps again, I couldn't find the Chromecast again.  Again no joy.  Finally I downloaded the Chromecast application onto my iPhone.  The setup on an iPhone requires you to manually shift the phone's WiFi settings, which I did.  I finally got a Ready to Cast message on the screen.  I tried casting Netflix from my iPhone, but found it took forever to load content.  It did finally work, though.My AppleTV unit has wired and wireless interfaces, and has a remote control.  I can stream content from my iTunes library or directly from my devices.  Even though it is significantly more expensive ($99 vs $35), it simply works better.I've seen many Android stick PCs on the market at the sub $40 price range, and I will admit that Google's Chromecast is much better designed.  It came with an HDMI extension which wasn't needed since unlike Android stick PCs, this one was slim enough to fit into the HDMI port without crowding other HDMI cables.  it has a long micro-USB cable for power, and the TV's USB port powered the unit with no issues.  An AC adapter is also provided.Google just tried to be too cute with it's WiFi antics.", "verified": true, "helpfulness": "0/2", "author": "Edward D Lopez"}, {"rating": 1.0, "review": "Won't work with a kindle, won't work with a lot of devices.  But they don't mention this in their marketing.  After two hours of trying to download the app, I gave up.  I tried their support page.  No mention of this issue.  I supplied feedback, seeking an answer. I got a page that thanked me for the feedback, but said that couldn't get back to me personally.I am just glad that I learned about their crappy tech support, before we purchased Chromebooks for my office staff.  What a Joke.On a third party website, I learned this doesn't work with kindle or many phones.I found a list of devices that it DOES work on.  So I tried to use my phone.  I had to sign in with my Google account.  But the page flashed a sign in screen, that disappeared within a second.  After numerous attempts, I finally gave up.I had been anticipating the arrival of this device for several weeks.  What a letdown!  I am returning this overhyped product.  And due to the misleading advertising and total lack of support, I will never purchase a piece of Google hardware again.Oh yes, we have a senior blog.  My review will appear in the Sr. tech section weeeeeeeeeee34wshortly!  And this product won't make it into my Amazon store either.  Shame on you Google!", "verified": true, "helpfulness": "1/5", "author": "World \"Traveler\""}, {"rating": 1.0, "review": "So far Google has dropped the ball on this one. I love my selection of Netflix, Play Movies, YouTube, and Play Music. That is an unbelievable selection there.", "verified": true, "helpfulness": "0/6", "author": "7ftchkn \"7ftchkn\""}, {"rating": 5.0, "review": "Excellent product !! We love it and will never go back to cable again. Thank you for this awesome gadget !", "verified": false, "helpfulness": "0/0", "author": "Elice"}, {"rating": 3.0, "review": "I wanted to like this device. I really did. So many people are buying it. But nearly as many are returning it because it really offers little or no advantage to anyone who has a smart TV. The device is very limited in what it can do, and setting it up the first time can be frustrating.It only works with the Chrome browser. You must download a software plug-in to your Chrome browser for this to work. It isn't easy to set up the connection between your tablet device and the Chromecast dongle if you're trying to use an Apple based tablet or phone. Once set up, however, you can broadcast whatever you see on your Chrome browser onto your TV screen.There are two ways this Chromecast device gets the internet video into your TV. Right now, it is optimized only for importing videos from Youtube, Amazon or Netflix. For these three services, the Chromecast dongle pulls the video from the internet source and not from your handheld phone or tablet device. You use your tablet device only as the video controller, not the video source. In this mode, the video transmission works OK. But again, most new TVs and DVD players can already do this without a Chromecast device.While Chromecasting should be a cool function, it does not always work smoothly. For videos from sources other than Youtube, Amazon or Netflix, the Chromecast simply transmits the signal from your tablet device to the Chromecast using your Wi-Fi connection. Because this uses an additional chunk of your Wi-Fi bandwidth, the video frame rate slows down the video frame rate so much that the images stutter and skip. And that's using a high speed cable network of 20 MPS. I can't even imagine trying this on 2 MPS DSL or a 5 MPS phone company based internet connection.Besides using it for Youtube, Amazon or Netflix, for all other videos the Chromecast device becomes nothing more than a wireless substitute for the HDMI cable you would otherwise need connected between your tablet device and your TV. In most cases, you'll have much smoother video using the HDMI cable instead of the Chromecast device. The cable is easier, faster, cheaper and it works as good as your tablet can receive the video.I wanted to like Chromecast, but its complications and limitations at this time do not seem to make the viewing experience any better than what a Smart TV can offer on its own. Perhaps the future will bring more Chromecast functions with less limitations and greater ease of use.", "verified": false, "helpfulness": "0/1", "author": "Rick Bennette \"Rick Bennette\""}, {"rating": 2.0, "review": "The bottom line is that you cannot mirror the screen of your phone with chromecast. Seems like a pretty standard and useful capability that has been left out.  Although they are promising more capabilities this device will only deliver internet content and your mobile device only serves as a remote to that content.  Dissapointing, two stars.", "verified": true, "helpfulness": "0/3", "author": "Vitaly Polovin"}, {"rating": 1.0, "review": "I was eagerly anticipating this device and finally received it today. It's going back tomorrow, after I wasted hours of time trying to set it up.  It wouldn't connect to my wireless network because - apparently - it doesn't like my router.  I called Google and the person who answered couldn't get it to work either.  She obviously had no idea what she was doing and scrambled for the right script, which is always a problem when you don't really understand the device you're trying to support.  She kept insisting that I needed to run things from the Chrome browser even though I kept telling her that Chrome was IRRELEVANT because I was just trying to SET THE STUPID THING UP, which has nothing to do with what she kept referring to as \"casting\" because you can't \"cast\" if you can't get the idiotic thing set up in the first place.I thought this was going to be an easy way to connect my laptop to the TV, since my laptop doesn't have an HDMI port.  But this turned into a nightmare.  I am not a techie and I was really angry that I had to go into the guts of my router to try and modify its settings (although it turned out that they were set correctly - and I did it with the assistance of my router manual, not the useless Google support person - hey, I thought they were all supposed to be brilliant.  Apparently not.).  I wanted to \"plug and play,\" not curse and read manuals. As they said in some Monty Python movie, \"Run away!\"  I am sending in back to Amazon tomorrow.  Let some other poor sucker deal with it.", "verified": true, "helpfulness": "2/5", "author": "Goldie Pippin Asia"}, {"rating": 3.0, "review": "I upgraded my internet speed to the highest available from Time Warner today. The modem they supply has built in WIFI, which needs to be activated by TWC by speaking with their techs. The catch is that TWC has access to my home wifi; as soon as I turn on the Chromecast I lose the internet. And you thought NSA knows everything.", "verified": false, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "I order it now a month ago and I still have not been able to get it to work.Looks like I have to order another one. I may have just got a lemon.Bought a new one and it works!", "verified": true, "helpfulness": "0/1", "author": "Heidy Chavez"}]