[{"rating": 2.0, "review": "Most programs. Are pay to view.  I thought there would be a wider and newer selection for prime users.  I don't think I would have bought this if I had known the choices I am getting.", "verified": true, "helpfulness": "0/1", "author": "Robert Beaulieu"}, {"rating": 5.0, "review": "Works very well, except Netflilx  doesn't load all the time.  Other than that works great, 10x better than Google tv", "verified": true, "helpfulness": "0/0", "author": "Gary from SC"}, {"rating": 5.0, "review": "Cannot get my wife away from it.  She always has it on and is finding tv programs she has never heard of to watch and enjoy.", "verified": true, "helpfulness": "0/0", "author": "Wayne B. Hyde \"Wayne Hyde\""}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Brett M."}, {"rating": 2.0, "review": "I returned the unit within a week after my purchase of it.  The apps on the unit are limited and not to my liking.  I could not see having the box just setting there and not being used often.  Then I realized that I do not have a Blu Ray Player so I purchased a Blu Ray player with Wi Fi unit in it.Now I can get to the same place on the net as the Fire TV with more apps to choose from.  But I do not have the Amazon apps for one of my choices.", "verified": true, "helpfulness": "0/1", "author": "Arthur W. Sweetland \"AWS\""}, {"rating": 4.0, "review": "I have only scratched the surface of what this thing is supposed to do but so far its been great. Set was easy. I am actually using it wirelessly  because my house is an older cement block house and I don't feel like hammer drilling walls. That being said you will need to go through the wireless configuration to get going. Once you get connected it will download some set up files and updates. Within 10 minutes I was enjoying Netflix horizontally and comfortable from my bed. This packs a punch to be so tiny.. I had to ad some picture frames to shelf because it looks bare with this little box all alone. At this point, I do not have any negative comments for this little guy. I'm happy..the wife is happy so all is well in Fort Walton Beach.", "verified": true, "helpfulness": "0/0", "author": "Scott Zane"}, {"rating": 4.0, "review": "Great product easy to use, Prime movie selection not as good as Netflix and / or Hulu...  ...which was a REAL SURPRISE and disappointment for a company that normally has the highest quality and best products (and I really like Amazon).I would have a hard time recommending this over Chromecast (Google) and Netflix because of the limited (outdated) Prime offerings.....", "verified": true, "helpfulness": "0/0", "author": "P Lemay"}, {"rating": 1.0, "review": "Not at all what I was expecting :(", "verified": true, "helpfulness": "0/4", "author": "brad 204"}, {"rating": 5.0, "review": "Enjoying it so far.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Grimes"}, {"rating": 5.0, "review": "Easy to install, easy to use and crystal clear signal ! Perfect", "verified": true, "helpfulness": "0/0", "author": "Robert M. Auman"}]