[{"rating": 4.0, "review": "Had this unit for a couple of weeks now. Very easy to set up and operate. Remote control could only be better if it was backlight. Processing power and ram are on par with necessity. Ability to add additional storage is a welcome plus. I would like some customize menu options in the future but that's just my preference. Very good product I would recommend it above the sticks any day.", "verified": true, "helpfulness": "0/0", "author": "Greg Osman"}, {"rating": 4.0, "review": "Extremely easy to set up, super easy to use. Love the voice search feature. Very pleased with programming currently available.", "verified": true, "helpfulness": "0/0", "author": "Sheileen W."}, {"rating": 4.0, "review": "OK", "verified": true, "helpfulness": "0/0", "author": "ROHO"}, {"rating": 5.0, "review": "I love this product. I love how well the voice command works. Wish my phone worked as well.", "verified": true, "helpfulness": "0/0", "author": "Cynthia McClelland"}, {"rating": 5.0, "review": "I live in the middle of nowhere Iowa barely got Internet to my house.  Box works great crystal clear all the shows me and my family need or want.  Easy to set up easy to use .  Good job Amazon. Alex", "verified": true, "helpfulness": "0/0", "author": "A.Hudson"}, {"rating": 2.0, "review": "Love the hardware, but the app selection available from the amazon store is pathetic.", "verified": true, "helpfulness": "0/1", "author": "B. Stewart"}, {"rating": 4.0, "review": "The fire TV itself is quite amazing! I was expecting an experience like the Apple TV, sort of cumbersome but to my surprise voice recognition is quite amazing. The only short coming I experience was more of a service issue due to the limited selection of viewable content for subscription movies and television shows to the prime account. Once they get that ironed out this would be an unstoppable force", "verified": true, "helpfulness": "0/0", "author": "Dimitrios Scott"}, {"rating": 3.0, "review": "This box can't be beat for streaming Amazon content. Playback is instant and smooth. The \"x-ray\" feature in Amazon video is a neat bonus. In my experience, however, Netflix, Hulu and HBO Now apps have issues on this device. Netflix and Hulu almost always develop synchronization problems between video and audio. The HBO Now app drops frames which can be very distracting.I don't have issues with any of these on my other streaming devices, only on the Fire TV.If you need a way to watch Amazon video content on your TV, this is definitely the best way to make that happen.I would look elsewhere for a Netflix, Hulu or HBO Now solution, though.", "verified": true, "helpfulness": "1/2", "author": "Goaty66"}, {"rating": 5.0, "review": "A large variety of things to watch.  Bye bye cable.", "verified": true, "helpfulness": "0/0", "author": "Jocko48"}, {"rating": 5.0, "review": "*UPDATE 9/9/15--A new version of Apple TV was announced today, which this review does not take into account. This review should be considered a comparison solely between Amazon Fire TV and Apple TV 3rd gen and older models.*I am deeply entrenched in the Apple ecosystem. I own a MacBook Pro, an iPhone, an iPod, and more. But when I went looking for a streaming TV box I went with Amazon’s Fire TV and have never looked back. I’ve loved the Fire TV from day one, and have since gone so far as to ditch my cable box. Not only that, but every time I’ve used an Apple TV I’ve been reassured in my decision, since the Fire TV is better in just about every way. If you’re interested in why, read on. If not, rest assured that the Fire TV is a great choice, perhaps rivaled only by Roku, which I haven’t been able to test.Here’s some background if you’re debating between the Apple TV and Amazon Fire TV:Apple TV was released in 2007 and has seen limited updates since its release. The current version was released in 2013 and is showing its age. It is basically a minor update from the 2012 version, so I think it’s fair to consider it 3.5 years old at this point. Transitions between apps are slow, videos are slow to load, and connectivity can be iffy at times. This is mostly due to the aging hardware. Additionally, the interface is clunky—it consists of many tiles that you navigate between. These tiles struck me as unorganized, and I think the most apt description is that it’s like a bad port of iOS, the operating system of iPhone and iPad. Throw in the flimsy remote, which sacrifices functionality for simplicity with it’s strange button layout, and Apple has struck out on their streaming box. Perhaps an update from Apple is in the works, but for the time being I just can’t recommend it.Amazon’s Fire TV was released in April 2014 and is still less than 1.5 years old. Its hardware is top-notch, and the additional option of using an external USB drive for storage is a generous feature. The interface is clean and well designed, with recently used apps appearing at the top for easy access. Content categories like TV, Movies, and Music are easy to navigate between and browse through. Transitions are lightning quick, apps load smoothly and speedily, and connectivity rarely hiccups (when it did I received a refund on the movie I had rented from Amazon!). The remote is well designed with a premium feel. It runs on Bluetooth so it works pointing in any direction. Batteries haven’t needed replacement after 6 months, and the voice search has hardly ever misunderstood me. All of this adds up to a killer piece of AV equipment from Amazon.Both devices offer a huge amount of content to stream. Amazon and iTunes will have different offerings, but for the sake of simplicity I think they’re about equal on new release availability. They can both access Netflix, and now they can both access HBO Now and HBO Go, previously only available through Apple. They’re about the same price, barring a special deal from time to time. My iPhone might work more seamlessly with Apple TV, but I can still use it to search for YouTube videos on Fire TV and cast them up to the big screen. In my mind, the loss of Apple ecosystem continuity pales in comparison to the please of Amazon Fire TVs excellent hardware and software.", "verified": true, "helpfulness": "0/0", "author": "ECtheG"}]