[{"rating": 4.0, "review": "Some problems with connectivity", "verified": true, "helpfulness": "0/0", "author": "Vanessa"}, {"rating": 5.0, "review": "came on time,,and works awesome,,,easy to set up and easy to use,,,so much better than trying the cable thing,,,works with my laptop and phone,,,recommend this gadget to everyone,,,,,did not come with usb cord as advertised but wall plug works just as well,,,", "verified": true, "helpfulness": "0/0", "author": "kory sanger"}, {"rating": 5.0, "review": "I have several of these. Love them.", "verified": true, "helpfulness": "0/0", "author": "AmaTom"}, {"rating": 2.0, "review": "I've had this for a month now and every single time I've used it I've had to restart my wifi in order for my laptop or phone to link with the chromecast receiver. It's very annoying.", "verified": true, "helpfulness": "0/0", "author": "Mikeyt"}, {"rating": 4.0, "review": "Good experience but there are some bugs still.", "verified": true, "helpfulness": "0/0", "author": "Henrique Taira"}, {"rating": 3.0, "review": "With a good strong Wi-Fi signal, this thing rocks. My family uses it all the time to stream Netflix. I recently got the T-Mobile Personal CellSpot (a re-branded Asus RT-AC68U Wi-Fi router) and since then the Netflix performance has been excellent. Before that, with a somewhat inferior Wi-Fi router the Chromecast had some trouble maintaining connection.I'd give it five stars if it supported more streaming services. My understanding is that Google is to blame for this by not providing the needed support to 3rd-party developers. In that regard, the Roku boxes far outshine Chromecast. But then again, they typically cost quite a bit more.I've tried casting my Android tablet and phone screen to the Chromecast, and that somewhat works. Usually the result is the movie running in fits and starts, and the phone/tablet dropping connection to the Chromecast after a few minutes. A frustrating way to try to watch a movie, to say the least.If you're content with Netflix and YouTube, this is the device for you.", "verified": true, "helpfulness": "0/0", "author": "Roger Chaplin"}, {"rating": 5.0, "review": "Excellent quality and preformed as expected.Easy to install and operate. Love it.", "verified": true, "helpfulness": "0/0", "author": "Jerry Lowery"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "David Marsh"}, {"rating": 3.0, "review": "Gets you access to programming you might otherwise not be able to watch on your TV, but the stream skips. Not a replacement for a cable subscription if you can afford it.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "Fine product. Seamless setup.", "verified": true, "helpfulness": "0/0", "author": "Shawn_ON_CA"}]