[{"rating": 5.0, "review": "buying amazon fire tv is great to watch my prime shows. During football season it is especially great while my husband watches football on other tv.....", "verified": true, "helpfulness": "0/0", "author": "areader"}, {"rating": 4.0, "review": "We love the Fire TV!  All of our favorite shows are available instantly and it's much more affordable than regular cable.  The only drawback is that I wish it had the same apps available as the kindle... Would love to have apps like Watch Disney/Disney Jr., Watch TBS, Watch ABC, etc.  available for download.  Overall, very pleased!", "verified": true, "helpfulness": "0/0", "author": "Bec"}, {"rating": 5.0, "review": "We have only used the Amazon Fire for a couple of weeks, but it was everything they said it was. Very easy to use, and to set up. Small enough that we just velcro stuck it to the back of the tv, no one even sees it, no big box setting out in view. The voice command is a real time saver when looking for movies or programs.", "verified": true, "helpfulness": "1/1", "author": "Denise Baatz"}, {"rating": 4.0, "review": "I bought this mostly because it was interesting technically. I wanted to use it mostly to watch Netflix and it works well for that. The one thing I don't like is that it automatically plays the next episode of the series I am watching, but this is probably a feature of Netflix rather than the Fire TV itself. I like the voice search, but it only gets me as far as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Warren"}, {"rating": 5.0, "review": "Seems to work well, good movie selection easy to use. It was a gift for mothers and fathers day.excellent gift that I would recommend", "verified": false, "helpfulness": "0/0", "author": "robert wetmore"}, {"rating": 5.0, "review": "We are new to streaming and have been very pleased with Amazon Fire TV.  The selection is large and it is incredibly easy to use.  Even my 4 year old can do it.", "verified": true, "helpfulness": "0/0", "author": "Kathern M."}, {"rating": 5.0, "review": "what more do you need ?games - checkmovies - checktons of free content ( prime member ) - Checkhigh quality design - checkSuperb Amazon support - double checkthe only con i have is that you have to be in the US to use your free prime movies and shows ( which in my oppinon is bad and i would really like it to change )", "verified": true, "helpfulness": "0/0", "author": "Ali Yousif Al Khaja \"ak\""}, {"rating": 5.0, "review": "I ONLY HAD AMAZON FIRE TV FOR A FEW WEEKS AND IT IS MORE THEN I THOUGHT IT WOULD BE, IT DOES EVERY THING. THE BEST THING I LIKE ABOUT IT IS THE MIRRORING FROM THE TABLET TO THE TV, WE HAVE A 55 IN TV SO SEEING EVERYTHING FROM THE TABLET TO THE TV IS GREAT. I WOULD RECOMEND THIS TO EVERYONE.THE SOONER YOU BUY IT THE FASTER YOU CAN ENJOY IT .", "verified": true, "helpfulness": "0/0", "author": "john zimmer"}, {"rating": 5.0, "review": "The Amazon Fire blows the ROKU away!!!! Hands down. The playback is amazing and it is SO easy to use.", "verified": true, "helpfulness": "1/1", "author": "Druscilla"}, {"rating": 1.0, "review": "Was hoping this would make an ideal XBMC box but I found it to be too underpowered to really fix the bill.", "verified": true, "helpfulness": "1/10", "author": "Devin Cook"}]