[{"rating": 5.0, "review": "I bought it for a gift to a neighbor and after I gave it to them they went on a long winter vacation and I haven't heard how it works on thier home TV yet.", "verified": true, "helpfulness": "0/1", "author": "Richard Bovelle"}, {"rating": 3.0, "review": "Works great, but there is nothing to do with it.I just gave to my work place to show presentation from google docs on a big TV", "verified": true, "helpfulness": "0/0", "author": "Liaz Kamper"}, {"rating": 5.0, "review": "I love it I plunged it in did set up Wow I was there in know time flat, showing  You Tube  Video's  for my little girl .", "verified": true, "helpfulness": "0/0", "author": "E K R"}, {"rating": 5.0, "review": "I just love this product it works well I'm very pleased with it !!!!! I will buy another one for another room it's like having the internet on my TV. Thank you", "verified": true, "helpfulness": "0/0", "author": "Priscilla Perry"}, {"rating": 5.0, "review": "I bought this when I lost my dog ate part of my roku remote.  Works great and easy to use!", "verified": true, "helpfulness": "0/0", "author": "David Swanson"}, {"rating": 4.0, "review": "At present, it only casts web pages via computer: it won't cast a web page from your Chrome browser used on your mobile device. Full functionality via desktop or loop - limited functionality via ipad. Netflix works from ipad fine.", "verified": true, "helpfulness": "0/0", "author": "Greg Baker"}, {"rating": 3.0, "review": "It works great if you have a wifi router bit I use my phone as a hot spot since I live in a rural comunity without other Internet access and it doesn't work.  Your phone must connect to the device through wifi, so I need to use my wife's phone to create a hot spot then mine to control the chrome cast device.  Otherwise it works well.  If there was a dedicated remote like roku units have it would fix this issue.  My situation is out of the norm and that's why I still give it 3 stars", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "One in main living room works. I bought one for my daughter and it only works through her kindle. Third one for my granddaughter and she is still having a problem to get it to work.", "verified": true, "helpfulness": "0/0", "author": "Andrea Irizarry"}, {"rating": 4.0, "review": "I wanted another smart tv without having to buy another set.  Chromecast is the perfect solution.  It works beautifully.  I look forward to the day more options become available.  Knowing the power of Google the wait should not be that long.  Another plus is that the device is portable and can be used on any TV in the house with a HDMI port.Chromecast is easy to set up and easy to use.  So much so that I didn't have to \"consult\" with my 20 something sons for help.  Keep on innovating Google and thanks.", "verified": true, "helpfulness": "0/0", "author": "MWW \"MWW\""}, {"rating": 5.0, "review": "Love it! I would recommend anybody to get it! It is simple-EST-EST-EST device that you could use, easy to set up and easy to control.", "verified": true, "helpfulness": "0/0", "author": "Prof Inuyasha"}]