[{"rating": 5.0, "review": "Make sure you have a good HDMI cable but besides that....very pleased! But if you want to watch sports, you still need cable. All in all, a good little device.", "verified": true, "helpfulness": "0/0", "author": "Emily B"}, {"rating": 5.0, "review": "Bought this f2f or my husband.He really likes it better than the box we have for all the different movie s.Much easier to use and faster  in every aspect.", "verified": true, "helpfulness": "0/0", "author": "dottiek"}, {"rating": 5.0, "review": "This works great, much better than a larger one I bought at a store in town. I would recommend this to everyone!", "verified": true, "helpfulness": "0/0", "author": "nanac1998"}, {"rating": 5.0, "review": "Love my Fire TV", "verified": true, "helpfulness": "0/0", "author": "Matthew Maras"}, {"rating": 1.0, "review": "This product is terrible. The picture kept freezing and blacking out while the sound kept going. I had to take it back as it was unwatchable. I've had no problems on the same setup with my Apple TV. I would like to get Amazon Prime though, so I'l probably get a Roku instead.", "verified": false, "helpfulness": "0/2", "author": "bjpete"}, {"rating": 5.0, "review": "Absolutely the best decision to purchase the Fire TV.  Loading of videos is instantaneous.  Netflix works better than my Logitech Reveue Google TV.  Games are great also.  Family just loves it and we use it mostly over my Google TV.", "verified": true, "helpfulness": "2/2", "author": "J. van Vlimmeren"}, {"rating": 1.0, "review": "Plex is still not working correctly so this box is useless to me plus hbo go is still not available", "verified": true, "helpfulness": "0/1", "author": "Michael holsenbeck"}, {"rating": 4.0, "review": "The one thing I hope they do with this is make it so you can stream music from your PC or external hard drive with out having to use a third party software over the web. Other then that I like how it's set up.", "verified": true, "helpfulness": "0/0", "author": "Michael A Chaffee"}, {"rating": 5.0, "review": "get it now item", "verified": true, "helpfulness": "0/0", "author": "Casey Carlson"}, {"rating": 2.0, "review": "Not impressed. Used it for 2 days then went back to Chromecast. Search is useless except for Prime content. In our home we have Roku 3 and chrome sat and this just doesn't compare with either in my book. Maybe the next generation will be a little better", "verified": true, "helpfulness": "1/1", "author": "chrissy"}]