[{"rating": 3.0, "review": "Not what I expected. I was expecting to be able to broadcast from websites not just certain apps. Thinking of returning", "verified": true, "helpfulness": "1/1", "author": "Mama Elle2010"}, {"rating": 4.0, "review": "Would have given a 5 but cannot get chrome on my andriod.  Otherwise, it works just fine.  Easy to set up and use.  Thanks", "verified": true, "helpfulness": "0/0", "author": "sweedie"}, {"rating": 5.0, "review": "I chose this rating because it is such a great product. I ordered three more and gave them as Christmas gifts. Easy to use. easy to set up and great packaging. So nice to watch a movie or whatever on the bog screen instead of my computer or phone.", "verified": true, "helpfulness": "1/1", "author": "caffeineacademy"}, {"rating": 2.0, "review": "if you only want youtube and pandora controlled from your phone or device, this is for you. I wanted to stream plex and found that you need to have a paid app or subscription to stream. there is also no remote, so if you want to control from different devices, you need to buy the app on each device (i.e. tablet, iphone, android).I have a Roku3, and i much prefer to go ahead and get another one for other rooms and have a remote and free apps.", "verified": true, "helpfulness": "0/0", "author": "Christopher Weger"}, {"rating": 4.0, "review": "If you don't already have a Roku, them this would probably be 5 stars for you.  None evasive with extra wires all around & the fact that you can control it with any Wi-Fi device in your home.  We already have a Roku which pretty much does the same.  I thought we would of been able to stream from websites to the TV, but not so. Was looking forward to cutting cable so I could stream shows from the bravo website through this device, but you can only go through certain channels of \"Chromecast\". For the price though it is definantly worth it! We spent $99 on the Roku. Did not give 5 stars because you cannot stream from direct website", "verified": true, "helpfulness": "1/1", "author": "Lynda Hill"}, {"rating": 5.0, "review": "this product is so amazing i love how easy it is to setup and to use. every household need one.", "verified": true, "helpfulness": "0/0", "author": "O. Animashun"}, {"rating": 2.0, "review": "Does not work with Netflix or Pandora which were the main reasons I bought it. Very deceptive and false advertising.", "verified": true, "helpfulness": "0/1", "author": "Craig Woods"}, {"rating": 3.0, "review": "its a great product but hate the delay when you use the extension to connect to the tv.. its frustrating", "verified": true, "helpfulness": "0/0", "author": "edwin w waldron"}, {"rating": 4.0, "review": "Again, works great with natve apps (hulu +, HBOGO, Netflix and YouTube.  Tried casting Amazon videos from my Mac and they come out jerky.  Hope this can be resolved at some point. I assume more native sources are coming????", "verified": false, "helpfulness": "1/1", "author": "stephanie matamoros"}, {"rating": 5.0, "review": "This is a fantastic device! Great bargain. Easy to use. Compact, unobtrusive. I would definitely recommend this for anyone to purchase.", "verified": true, "helpfulness": "0/0", "author": "D. Torgersen"}]