[{"rating": 5.0, "review": "This thing really simplifies the process of getting what you want on your television from another device without other cables. I'm the kind of guy who's living space is already sloppy with wires and cables...and prior to this I was running an HDMI cord from my desktop or laptop to my TV just to watch streaming entertainment. With chromecast, the hassle of configuring all this junk is alleviated and there is one less cable to trip on.Better yet, if I want to take my stuff to another room, all I have to do is take the chromecast and I can do the same thing on any television. I don't watch a lot of live TV, so this thing is great...and I'm finally using my tv for something other than games.", "verified": false, "helpfulness": "1/2", "author": "Mike"}, {"rating": 5.0, "review": "I am actually shocked at how easy this is to use and how well it works. Picture from tablet to big screen amazingly good. Got this as a gift for my son who travels for work all the time and he uses it all the time.", "verified": true, "helpfulness": "0/0", "author": "notacriticjusta fan"}, {"rating": 5.0, "review": "Sorry can't give a rating yet;(, cant get chromecast to connect add says how easy to connect to TV but dosen't say,how to get help when encountering problems with connection", "verified": true, "helpfulness": "0/2", "author": "Elle"}, {"rating": 5.0, "review": "It's my favorite. I don't need to pay for cable or anything. It's hard to figure out the chrome tab casting.", "verified": true, "helpfulness": "0/2", "author": "Philip Bryant"}, {"rating": 1.0, "review": "Chromecast is NOT compatible with Mac airport Wifi!  Buyer beware!  You try using a router but that may not be compatible as well !", "verified": true, "helpfulness": "0/1", "author": "kermit nourse"}, {"rating": 4.0, "review": "This devise is simple to install and easy to work. You never loose your remote as long as you have your phone.", "verified": true, "helpfulness": "0/1", "author": "charles noll"}, {"rating": 5.0, "review": "I stopped using mine PS3 for netflix and pandora after purchasing Chromecast. I have android and my wife have ios and we both can control it with no problem. I gotta say, there is more options for controlling it with android. I only missing that I cannot stream pictures or videos from my phone. I know it's not streaming from the phone, but from network, but it would be nice if you could access google+ to do so.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazingly simple to set up and use. Let's just hope Google get more services on it quickly and it will be truly great.", "verified": true, "helpfulness": "0/1", "author": "Darren D. Chapman"}, {"rating": 1.0, "review": "I haven't fully used mine yet that review will come later. I just want to let people know when you purchase this device you get a $6 gift card to purchase a movie from Google Play. The only problem with that is there are no good movies for $6. You also need to add tax and you can not mix payment. So the $6 card is not good for movies just Apps. This is a very wrong doing on Google Play!", "verified": false, "helpfulness": "0/5", "author": "Robert"}, {"rating": 5.0, "review": "Bought this prior to going on a 10 day trip where we would be living in a timeshare.  Two days into the trip my wife had her appendix out and was not able to do much of anything but sit/lay in bed due to pain.  The Chromecast came in handy.  I normally travel with a wireless travel router, which allows me to have wireless access for multiple devices while only paying for one wireless connection on the timeshare provided wireless network. With the wife not able to do much and is not a reader, we used the Chromecast extensively watching Netfix and HuluPlus, used several hours each day.  Used both a Nexus 7 tablet with the Netfix and Hulu apps installed and a Acer Chromebook.  Currently there are not any Chromecast apps available for Chromebooks but the Chrome browser has a plugin that allows \"casting\" the Chrome browser tab to the TV.  The Chromecast provided lots of entertainment that we wanted to watch rather then the junk on TV.  The Chromecast worked without issue. The timeshare network provided 1.5Mb down most of the time but there were times when there was some buffering and when checking the wireless speed it had dropped to about 300Kb down or less.  Buffering occurred more with HuluPlus then Netflix. Netflix seems to determine the speed of the connection and adjust the picture quality accordingly.  The HuluPlus app allows you to select 3 different picture qualities but did not find this to work as well as Netflix. The buffering usually happened around 6pm when vacationing folks were getting back and getting their email fixes I would guess.  Would then get better later in the eve. Overall very pleased with how this worked.  Since so small, this will be a part of what goes on every trip along with the TP-Link TL-WR3020.  Most places we stay at (timeshares) the TVs have HDMI ports but the TVs are still using the old analog cable connections. The router and Chromecast hardly take up any room when packing.  I take the Chromebook in a PC backpack so will have room for these as well.I did not find it the least bit hard to use/setup like some of the 1 star folks report but I am somewhat technical with electronic devices and have supported wireless networks.  Reviewing the doc I would guess my wife, who is not technical at all and afraid that she might screw things up, would have some trouble.--bill", "verified": true, "helpfulness": "1/1", "author": "Bill1228 \"Myersw\""}]