[{"rating": 1.0, "review": "We've only been able to use this a few times.  Every single time we try to watch anything, there's a technical issue and I spend an hour trying to get it to work.", "verified": true, "helpfulness": "1/2", "author": "Robbie C"}, {"rating": 5.0, "review": "Iwas pleased with the fire t v", "verified": true, "helpfulness": "0/0", "author": "laurence g weber"}, {"rating": 4.0, "review": "I love it. I've owned several Roku's and this beats any of them. Only reason why I didn't give it 5 stars is; I still have to use a side loaded dish anywhere app. Not all side loaded apps act like they are supposed to, and is a little quirky, but still usable with a USB mouse.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 4.0, "review": "Very easy to install and use. Only took about 5 minutes from the start of installation to watching shows.", "verified": true, "helpfulness": "0/1", "author": "sophie"}, {"rating": 5.0, "review": "Easy to set up.  Does everything as advertised.", "verified": true, "helpfulness": "0/1", "author": "John Forster"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Toots"}, {"rating": 4.0, "review": "Overall a good device. Works very good but has limited apps. Needs Starz play", "verified": true, "helpfulness": "0/0", "author": "R. Hall"}, {"rating": 1.0, "review": "Optical out didnt work and i got license errors.  I was not able to play anything.", "verified": true, "helpfulness": "2/3", "author": "Ryan W. Radtke"}, {"rating": 5.0, "review": "I love that I can stash this in the cabinet under the tv and, because the remote is WiFi, never have to have the cabinets open. It keeps looking nice and clean.It also works great and is fast and blah blah blah...", "verified": true, "helpfulness": "0/0", "author": "KL"}, {"rating": 5.0, "review": "It's so much better then Roku TV and Apple TV. Easier to use and navigate. Very easy to use. Would recommend to anyone", "verified": true, "helpfulness": "0/0", "author": "pnina"}]