[{"rating": 5.0, "review": "Loving it very much", "verified": true, "helpfulness": "0/0", "author": "Donna Harwood"}, {"rating": 4.0, "review": "Very good casting of music & pictures but videos  are a little laggy. Streaming from YouTube works great.", "verified": true, "helpfulness": "0/0", "author": "Ram Lissauer"}, {"rating": 5.0, "review": "Best money I ever spent!", "verified": true, "helpfulness": "0/0", "author": "Antonio Araujo"}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Tals Abroad"}, {"rating": 1.0, "review": "Only ordered this product to primarily stream from tv and new websites via Chrome browser.Cons: - Setup took a few hours as one router setting was causing an issue. I ended up finding the solution on YouTube, as the Chromecast workaround was ineffective and dated. -  Streaming websites or just mirroring my laptop was choppy, low resolution, and slow. -  Resolution on youtube and netflix was far from HD quality, ironically my Roku3 on the same wireless network looks great for the same applications. - You get what you pay for with this product - Not reliable HD qualityPros: - Cheap - A quick and dirty solution for screen mirroring if performance and quality are not important. - The screen backgrounds were very cool and of high resolution, but not cool enough to justify me keeping Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Zack"}, {"rating": 3.0, "review": "The picture from the laptop is good but from my smartphone it lags.", "verified": true, "helpfulness": "0/0", "author": "Charles Glenn"}, {"rating": 5.0, "review": "Was easy to set up and use. Works as advertised.  Great value for the money.", "verified": true, "helpfulness": "0/0", "author": "Robert G. Barnwell"}, {"rating": 3.0, "review": "its good", "verified": true, "helpfulness": "0/0", "author": "Sally"}, {"rating": 5.0, "review": "I never get on sites and leave reviews. Just don't think about it really. That fact that I not only am leaving a review, but have also ordered a second one? That says allot about this device. I am extremely happy with the chrome cast and have recommended it to all my coworkers and friends.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Chrome cast is a great idea. But the only protection it has is your WiFi password and anyone can hack in and use your tv for what they want if they have your wifi they have your chromecast at there disposal. There should be a password protection on it", "verified": false, "helpfulness": "0/0", "author": "cameroon15"}]