[{"rating": 5.0, "review": "Second one I bought.  It is worth the money.", "verified": true, "helpfulness": "0/0", "author": "Lucy"}, {"rating": 5.0, "review": "Great piece of technology. Really useful for Netflix and YouTube integration, plus you can send a tab to your TV and still work on your laptop. Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "You don't need to buy a smart TV with Chromecast. Just plug it to free HDMI port. Love it.", "verified": true, "helpfulness": "0/0", "author": "Roberto Garcia"}, {"rating": 5.0, "review": "Plug it in, configure, and go!Both me and my husband have Android tablets, and have found it extremely useful for watching movies from the Google Play store, playing music at a party through our TV, and entertaining our friends with crazy cat videos.", "verified": true, "helpfulness": "0/0", "author": "Jordan \"PandemicSoul\""}, {"rating": 5.0, "review": "Works great and is very convenient for streaming music, games, and YouTube videos. Another great thing is that if you download the Chromecast app, you can stream your phone screen to your TV, which can allow you to show pictures and videos you've taken. All in all, for $35, I can't complain.", "verified": true, "helpfulness": "0/0", "author": "Jared Martos"}, {"rating": 5.0, "review": "Received it quickly, works very well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Seems to work well, if you have a fast internet connection.", "verified": true, "helpfulness": "0/0", "author": "Tom Howlett"}, {"rating": 4.0, "review": "Enhanced support and updates have made it one of my most used widgets. Recommended!", "verified": true, "helpfulness": "0/0", "author": "Samuel \"iNetSynch\""}, {"rating": 3.0, "review": "I won't say if this is a good or bad product. I will say if you are like me and try to use it with an AT&T; 2-Wire router it may not work. They are not supported. Don't expect to get an answer from a AT&T; repairman because you won't. Guess it goes against their U-verse sales. I have read a bunch on re-configuring the router to make it work but so far I haven't had any luck. I guess some of you guru's can. I will have to go back to my old WD-Live.", "verified": true, "helpfulness": "0/0", "author": "jerry"}, {"rating": 1.0, "review": "i bought this because i was told by different people who had bought it that it turned your tv in to a smart tv not i have a smart tv and it is nothing like a smart tv  all u can do with it is use it to watch a video on youtub or net flex frome your android tablet it will not work on the ipad even tho it says it will i can hook up an hdmi to my dell and tv and do more and it is a lot cheaper or if u want more then one tv hooked up buy an hdmi splitter  dont wast your mony or time on chrom cast if i had received the right info i would not have wasted my money now the roku stick does turn your tv into a smart tv wish i had bought that in stead i have a friend who did that instead of buying a smart tv she bought a good hd tv and the stick and payed less then i did for my smart tv and she gets a lot more on the roku stick then i do on my smart tv", "verified": true, "helpfulness": "0/2", "author": "amber"}]