[{"rating": 4.0, "review": "Wish there were more apps you could put on there. The setup was easy but have noticed that once you configure it for one network it is hard to port it around and make it work with different networks.", "verified": true, "helpfulness": "0/0", "author": "eyelyte"}, {"rating": 1.0, "review": "really wanted this to work. But it looses wifi connection. It says sorry but your wifi is off. tried to reset it and it says it cant connect. Callled customer service and  get \"Oh you need to restart your router and computer and chromecast. so everytime I want to use the chromecast I have to do all that....... o.k. wasted 35 dollars. Don't waste yours . get a roku or apple tv . This product isn't worth the plastic it is made of.", "verified": false, "helpfulness": "1/5", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Be careful...this item is not compatible with your wifi if you have an Airport Extreme (Apple), unless you downgrade the version you use on the Airport Extreme router. Am I not surprised that a Google product does not work with an Apple product?  Coincidence?  Grow up Google...", "verified": true, "helpfulness": "0/1", "author": "jz65"}, {"rating": 3.0, "review": "The main reason for getting this was so I could watch on my TV what was on my chrome browser. But it doesn't work as I expected. You need to refresh each browser screen. Which means it can't show video started with Chrome. It seeems to work ok for Netflix but I havent used it after found out it won't work for the other purpose.", "verified": true, "helpfulness": "0/0", "author": "Robert White"}, {"rating": 5.0, "review": "It was worth the 3 week wait! Took 5 minutes to install and I use it ALL THE TIME. Easy to use and works great with Netflix & Youtube on my iPad. Can't wait for them to roll out this technology on other platforms.", "verified": true, "helpfulness": "0/0", "author": "Preet"}, {"rating": 5.0, "review": "Works great and super easy to set up and use.  My only question is when is Amazon going to get it together and release an app so I can play Amazon Instant Video with my Chromecast?", "verified": true, "helpfulness": "0/0", "author": "M. Cole"}, {"rating": 5.0, "review": "The excellent product for century 21, save you a lot money without use cable tv, direct tv. I bought 4 chromecast so far for my house, I would recommend to everyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great little device, however wish it would display everything on the ipad screen.  Right now only You Tube and Netflix.  Needs more options to cast videos.", "verified": true, "helpfulness": "0/0", "author": "R. Roth \"guvno\""}, {"rating": 1.0, "review": "I love Google BUT this is not what I would expect from them!!!I plugged it in to my smart TV thinking that there was a possibility that it would perform better than the TV.  No such luck.  It will not work with older Android OS's (2.3 is what I tried first).  It worked with my Chrome browser but it was slow and clunky.  I have a cable internet connection that is usually running at about 30 Mbps.  When I use my laptop or tablet to stream Netflix to it, it makes multitasking online almost impossible.I cannot find any technical details about how this device receives the signal/data that it send through the HDMI output, but it seems like the data is actually steaming through the device that you are using as the remote, then back through your router to the Chromecast.  Using this causes my Cisco wireless router to have trouble keeping a good internet connection to other active devices on my wireless network.It seems that Google should have the remote be setup so that (with the exception of Chrome browser tabs) data be streamed directly to the Chromecast from the internet service (like Netflix or You Tube) instead of through the remote like it seems to do.", "verified": true, "helpfulness": "2/6", "author": "R. Kufner \"Teckie Guy\""}, {"rating": 4.0, "review": "The Google Chromecast is GREAT!!!!  It is simple plug and play.  The setup is a breeze and you can be watching video within minutes.  I can use my smartphone or table to control on my TV.  I would recommend this to all my friends and family.", "verified": true, "helpfulness": "0/0", "author": "Gerardo"}]