[{"rating": 2.0, "review": "It says you can cast from your iphone or ipad but you cant cast from chrome on these devices. You have to use a computer to do it. I would not buy this again as the instructions are very misleading. Says you can do all these things but you can't...... works great for netflix and youtube but forget the internet on an ipad etc.", "verified": true, "helpfulness": "0/0", "author": "melissa"}, {"rating": 1.0, "review": "Bought one of these about 3 weeks ago.  Sometimes it works sometimes it don't.  I keep getting messages like \"no chromecast found\" then I reset the chromecast and go through the setup again only to get a message \"could not communicate with chromecast\".  I've sent multiple feedbacks to Google with no response.  Huge disappointment.", "verified": true, "helpfulness": "0/1", "author": "Jason A."}, {"rating": 5.0, "review": "My hubby loves this. I bought it for a gift for him and it comes in handy", "verified": true, "helpfulness": "0/0", "author": "GAMECOCK FAN \"gamecock fan\""}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Claudio Sawczen Junior"}, {"rating": 1.0, "review": "Plugged it in and software downloaded. After an hour of figuring it out, I finally got video to cast onto the TV but no sound.  Beware -  ChromeCast.com has terrible troubleshooting.  It was useless.  Help forums were just as useless.  There's no way to contact them for any type of phone or email support or any instructions for no sound troubleshooting.  Complete waste of money unless you can read lips.", "verified": true, "helpfulness": "0/0", "author": "E. OBD \"eclectic tastes\""}, {"rating": 5.0, "review": "For $30 I thought for sure this would be a piece of crap - but Chromecast is really awesome.  We do not have cable - we only pay $7.99/month for Netflix, and the app is really excellent.  We also tried Hulu out for a little, and that app was great as well.  Today I just discovered I can install an addon to my chrome browser to send whatever I've watching on my PC to my TV - so all the shows that are available for a limited time for free on the Networks website (ahem Walking Dead) - I can watch on my TV instead of hovering over my desk! The quality is surprisingly good - and for free, I have no complaints.", "verified": false, "helpfulness": "1/1", "author": "K. Woodworth"}, {"rating": 5.0, "review": "saving a lot of money Bye Bye Cable Bill :D", "verified": true, "helpfulness": "0/0", "author": "craig"}, {"rating": 5.0, "review": "Great product. I use it everyday and have one on every TV. Works flawlessly and is extremely easy to get going.The capabilities are endless!", "verified": true, "helpfulness": "0/0", "author": "quads"}, {"rating": 4.0, "review": "Like all chromecasts, there are connectivity issues, but for the price and size its great. Super easy to travel with and the fact that it includes google play credits now is even better!", "verified": true, "helpfulness": "0/0", "author": "Sportzchck \"Liz\""}, {"rating": 5.0, "review": "Gotta have it to stream from tablet  to t v,", "verified": true, "helpfulness": "0/0", "author": "ed botuss"}]