[{"rating": 5.0, "review": "I really love this gadget, so freaking useful, works like a champ, and its getting a lot of apps in the android market lately, and the price is so good", "verified": true, "helpfulness": "0/0", "author": "Fabian Alejandro Fariñas Gil \"Fabians19\""}, {"rating": 4.0, "review": "good for google only", "verified": false, "helpfulness": "0/0", "author": "Polroith Nen"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Charankamal"}, {"rating": 1.0, "review": "Its simple, IT does NOT work well with amazon prime..", "verified": true, "helpfulness": "0/1", "author": "James Kennedy"}, {"rating": 5.0, "review": "This unit has changed the way I watch TV forever. To be honest, I let it sit around for four months because I just didn't want to deal with the installation procedures. That was a waste of four months. The install is dead simple and took just about 15 minutes. Tech guys could have done it in 5 minutes I'm sure. So now I watch everything that comes in on my iPads, iPhones, Google tablets, Samsung Note III and other various video and photo sources. I use this unit on a Sony Bravia 54 inch TV. The syncing of signals is seamless. The HD videos are spectacular. If you have international TV subscription services you will never want to leave the TV room. For the price on offer this unit is a steal. I \"cut the cord\" years ago and have saved thousands of dollars. The Google Chromecast just makes getting rid of the cable companies that much easier.", "verified": true, "helpfulness": "0/0", "author": "kevin \"Old HP Guy\""}, {"rating": 1.0, "review": "I think they should mention that you must sign up for a Monthly ($35) fee to use this device", "verified": true, "helpfulness": "1/3", "author": "R. Smith"}, {"rating": 4.0, "review": "Great little device. If I was looking for another one I would go with the ROKU Streaming Stick", "verified": true, "helpfulness": "0/0", "author": "Ronald"}, {"rating": 4.0, "review": "Just plug it in to the back of the TV and do some setup to get it connected with your wireless network and you're in business. This is ideal for sending YouTube videos (or videos from any website) directly to your TV. It was perfect for cosmosontv.com. We also us it to stream content from foreign websites where there is no television service in America.I'm marking one star down because it is a little quirky. I think the engineers have a few issues to flush out.", "verified": true, "helpfulness": "0/0", "author": "Dylan"}, {"rating": 5.0, "review": "Very useful, works great, excellent price.", "verified": true, "helpfulness": "0/0", "author": "Gary F. Anderson"}, {"rating": 1.0, "review": "don't really like it", "verified": true, "helpfulness": "0/1", "author": "Madison \"MO\""}]