[{"rating": 1.0, "review": "don't buy this. it was advertised as a device that will play whatever you're watching on your computer on your tv and it was a big lie. I worked for four hours trying to get it to display ANYTHING on the tv. Biggest waste of 40+ dollars. Don't make the same mistake I did.", "verified": true, "helpfulness": "0/3", "author": "RB SALYER"}, {"rating": 5.0, "review": "Fair price and works great!  Glad we bought it.  I would definitely recommend to anyone who wants to wirelessly send media from their ipad or ipod to their television.", "verified": true, "helpfulness": "0/0", "author": "Amy M. Phillips \"Amy937\""}, {"rating": 4.0, "review": "This doggle is easy to set up and use. I was amazed at how it interfaced so easily and cleanly with my Netflix and YouTube apps on my iPhone. The same is to be said for casting tabs from Chrome on my Dell. The only disappointment is that non-\"approved\" utilities like Hulu and Amazon Instant Video don't cast well from Chrome on my Dell at all. When I tried to streaming video it was choppy, positive, and overall not watchable. I also could not find a way to use Spotify or iTunes through the Chromecast as well. Google Play worked some, but not as crystal clear as Netflix/YouTube. However, overall it is a wonderful product streaming viewing material to my TV while freeing up my devices.", "verified": true, "helpfulness": "1/1", "author": "Abbey Close"}, {"rating": 1.0, "review": "I had faith in this device from the beginning. I actually set up my house in anticipation of the device coming and working, having my tv set up with no cables running to it at all in hopes of having everything run through chromecast. My router is a new AC router with 800mb/s throughput,  a very high end home built gaming computer, and internet is 30+mb/s. There is no bottleneck causing my issues with this device. To make this clear I have never given any product 1 star before and hope I never do again. When attempting to use youtube the chromecast will fail to move from one video to the next in the queue and after the first video you watch it is no longer usable until you reset it. The feature that works best is casting from my desktop files from my computer.That isn't to say it works properly, but at least you can watch about 20 minutes of video or so before the chromecast breakdown. Casting videos from amazon prime or hulu dont work at all. In response to this device I am now going to run HDMI through some pretty inconvenient places to my new TV because it isn't moving after I have remodeled. Please wait for version 2.0, at least maybe a 5.0 GHz model that can do double the throughput and maybe stream HD. I'd pay 200$ for a device that worked as advertised.", "verified": true, "helpfulness": "3/5", "author": "Brian"}, {"rating": 5.0, "review": "I bought this for my husband for his birthday and he loved it. It's easy to use and super convenient. We also bought one for his grandpa and that required a little explaining since he wasn't used to these kind of things. So we downloaded the app for him and he's got the hang of it already. Great product!", "verified": true, "helpfulness": "0/0", "author": "Leah Vickery"}, {"rating": 5.0, "review": "Its good! No problems. Exactly what was Advertised. inexpensive and wonderful. A great bargain. And amazing controls. Perfect for streaming Netflix.", "verified": true, "helpfulness": "0/0", "author": "Brian Holden"}, {"rating": 5.0, "review": "It is cheap and practical, I use it to stream European soccer tournaments which are not always available on cable tv. Easy to hook up and nice to use on netflix.", "verified": true, "helpfulness": "0/0", "author": "Iskender Suleimanov"}, {"rating": 4.0, "review": "Easy set up. Was able to easily stream from a Windows 7 laptop and a Droid 4 phone. Still a little buggy running it on a Ubuntu machine, but it's more Chrome related that the actual product. I don't think 'd replace my Roku with it, but it's still a  fun toy for the price.", "verified": true, "helpfulness": "0/0", "author": "KD F"}, {"rating": 1.0, "review": "I really wanted this thing to work. Unfortunately, it never did. I never was able to get it set up. Every time I went through the process, I was told that my UPnP on my router was not enabled. I went into router settings, and it was in fact enabled.So I contacted Google's customer service by phone. Talked to a guy  who seemed like he was trying to be helpful. He couldn't solve my problem, but said he would refer my case to a supervisor who would email me in 24-48 hours. Well, that never happened, so I called again. I talked to another person who saw no record of my complaint, but assured me that he would take care of it and make sure a supervisor contacted me. No one ever did.So, I returned the Chromecast and ordered a Roku instead. Very happy with that product over the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "HaleyK"}, {"rating": 5.0, "review": "Works great.  Occasionally I have to manipulate the sound on the computer to get it to play on the TV, but all in all, this is a great little device for the cost.  Get one!", "verified": true, "helpfulness": "0/0", "author": "Charlie Brann"}]