[{"rating": 1.0, "review": "We bought this excited to have streaming options for our non smart TV, but it's a refurbished product and I believe that's why it didn't work properly. Our phones kept getting disconnected from the chrome cast and it just turned into too much trouble so we returned it. We plan on purchasing another, brand new, after we do some more research and comparing.", "verified": true, "helpfulness": "0/0", "author": "Thaddeus Davis"}, {"rating": 5.0, "review": "Good Product And Easy To Use", "verified": true, "helpfulness": "0/0", "author": "Robert G."}, {"rating": 5.0, "review": "So glad I ordered this from Amazon, was a great price.", "verified": true, "helpfulness": "0/0", "author": "SANDRA  POPWELL"}, {"rating": 5.0, "review": "I love it..", "verified": true, "helpfulness": "0/0", "author": "ron"}, {"rating": 5.0, "review": "Installed it on my daughter's TV which has no WiFi. Instantly (after downloading and installing the Chromecast app for Android) we were able to watch Netflix, observe my security cameras, and watch other Chromecast compatible applications. Nice little gadget if your TV has an HDMI input but doesn't have WiFi.", "verified": true, "helpfulness": "0/0", "author": "Carlo Verdi"}, {"rating": 5.0, "review": "Awesome for streaming from my pc to my tv at my shop. just what i was looking for", "verified": true, "helpfulness": "0/0", "author": "Bruce Belmer"}, {"rating": 5.0, "review": "Best streaming device on the market. I have android and IOS. Works great on both. Was so happy with the product that I bought another one.", "verified": true, "helpfulness": "0/0", "author": "Hal 9000"}, {"rating": 1.0, "review": "Still has problems... keeps giving me \"oopss I should not be here\" error when using Netflix.Keep away if your looking for something more stable, buy if you like challenges... this is the one for you...On a side note Google wants all your info, including your media taste... be aware... the big brother will be watching! (the DNS servers -Internet address resolution service - are hard coded to google servers and cannot be changed which is a challenge overseas... just imagine...).Regards!", "verified": true, "helpfulness": "0/0", "author": "Randall Cascante"}, {"rating": 5.0, "review": "Awesome little device for using Netflix and other apps on a non smart TV wirelessly.", "verified": true, "helpfulness": "0/0", "author": "Jesse J."}, {"rating": 5.0, "review": "Very god!", "verified": true, "helpfulness": "0/1", "author": "Erik Cândido de Oliveira"}]