[{"rating": 5.0, "review": "This is absolutely a wonderful gadget... I have watched YOU TUBE and many netflix shows on my TV and it is really awesome.", "verified": true, "helpfulness": "0/0", "author": "Dan Howe"}, {"rating": 1.0, "review": "I specifically bought this to cast music to my television from pc.  This function works intermittently and the extension often crashes.  With so few other supported apps, and the specific function i was looking for barely working, i cannot recommend.  Buy a Roku, it does more, and it does it better.", "verified": false, "helpfulness": "0/0", "author": "-tp"}, {"rating": 5.0, "review": "What a small unassuming device with big rewards. Worked so well with Netflix! I am not a tech wizzard so this was so easy to figure out-it was a pleasure.", "verified": true, "helpfulness": "0/0", "author": "M. Fields-Kasuba"}, {"rating": 4.0, "review": "It works for streaming netflix cheaply, not much else though. They have been adding support for more services, devices, but the really big problem is that you can't stream movies that are directly on your device or from the web. There are some google chrome extensions that people have made to overcome this, but it's still very very flaky. It doesn't seem to like mp4 file either, so there's that.", "verified": true, "helpfulness": "0/0", "author": "isableandaking"}, {"rating": 5.0, "review": "I love my chromecast, i use it ALL the time with netflix and others.  with my home theatre set up i feel like i'm watching in my own private movie theatre", "verified": true, "helpfulness": "0/0", "author": "melissa mendenhall"}, {"rating": 3.0, "review": "It does not work without being connected to power plug which is its major drawback. Secondly, it only works on web. I wish it would work to see videos and pictures on TV from my tablet.", "verified": true, "helpfulness": "0/1", "author": "Shubham Trivedi"}, {"rating": 5.0, "review": "Simply, it's fast, easy to use, easy to set up, and there is even a beta app now that you can view exactly what's on your computer screen. Mostly though, you just have to keep a tab open with your netflix, or youtube, etc open while you watch TV and browse the internet as usual.", "verified": true, "helpfulness": "0/0", "author": "Rick \"Rick\""}, {"rating": 5.0, "review": "LOVE the Chromecast. Super easy to install and very easy to use. Delivery was really fast as well. I'm a happy customer.", "verified": true, "helpfulness": "0/0", "author": "Amanda McCoy"}, {"rating": 3.0, "review": "My desktop computer is in my bedroom, the router is in the hallway and the TV with Chromecast is in the living room on another floor.So sometimes the cast works and sometimes it dies.", "verified": true, "helpfulness": "0/0", "author": "Samuel H Dorfman"}, {"rating": 1.0, "review": "The only reason I am giving this a one star rating is because I could not get it to communicate with my router.It should have been made clear that there are few router it will work with on their default settings. There is a list out there indicating compatible routers and routers that will work with modifications. ( Google chromecast compatible routers )My Cisco Linksys will not and it is very difficult to get in touch with their tech support to get the info needed to make the modifications needed.", "verified": true, "helpfulness": "0/0", "author": "Johnnie J"}]