[{"rating": 5.0, "review": "Very  nice like magic", "verified": true, "helpfulness": "0/0", "author": "jason quash"}, {"rating": 1.0, "review": "Bought it primarily for its wireless display casting. There are some deceptive advertising that this supports miracast, it doesn't. it does not use wifi direct at all. instead it clogs your network sending what is effectively a VNC view from your device to the dongle, and poorly i have to say. lots of audio sync issues, horrible image rendering, pixelation at it struggles to stream even 720p content...It also suffers from google update syndrome, keep an eye on your settings because it conveniently 'forgets' things when it updates, primarily your privacy configuration..the worst is that you can't do a damn thing with if it can't use the network to contact mama google every time you start it up.the reason is that apps are not stored on the dongle, which is understandable; but casting your screen from a device on the same network is an operation that needs no internet access, but google requires it anyway....FAIL.(note that it can update its firmware but the simple casting application can't reside on the chip? BULLS****)its been out for two years and while google has made updates, and LOTS of folks have complained about this issue on the bug forums, google has shown no interest in changing this requirement..so its going back to the store and netgear push2tv is coming home instead. you give up a lot of control and personal information for that 35 dollar hdmi wart...more than i'm willing to give..", "verified": false, "helpfulness": "1/1", "author": "musicmonster"}, {"rating": 5.0, "review": "The only reason to not LOVE your chrome cast is if you don't know how to use it. I got rid of cable after this bad boy came in.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Phillips"}, {"rating": 5.0, "review": "This is my second one. I hope that there will be some improvements and upgrades over time.", "verified": true, "helpfulness": "0/0", "author": "Miro"}, {"rating": 5.0, "review": "Definitely a great gadget to have, as it now allows me to view some of my favorite stuff on the big screen.", "verified": true, "helpfulness": "0/0", "author": "madbox411"}, {"rating": 2.0, "review": "did not work for me....maybe someone with more experience", "verified": true, "helpfulness": "0/0", "author": "bartonchick"}, {"rating": 5.0, "review": "show very clear,I like the way it shows beautiful pictures&better; then my cable. I recommend this to product to my friends or to anyone.  BEAUTIFUL !!!!", "verified": true, "helpfulness": "0/0", "author": "Willene Harrison"}, {"rating": 4.0, "review": "just nice and simple.", "verified": true, "helpfulness": "0/0", "author": "flecia"}, {"rating": 3.0, "review": "This thing is like magic and we take it everywhere my parents house cause they don't have Netflix and it's great for the hotel too when I'm on a buisnes trip and I want to watch something bigger than my tablet! Plus it was so cheap because of the black Friday deals!", "verified": true, "helpfulness": "0/0", "author": "b1ackva1kyrie"}, {"rating": 1.0, "review": "Device works but it was a struggle. Then it turns out to watch a ball game you must have a cable account for it.Please fix the app to tell someone up front what the limitations are.My wife is so upset with me for getting it onto her machine and not being able to delete it.PBS Video seemed to have password problems", "verified": false, "helpfulness": "0/1", "author": "seapwc \"seapwc\""}]