[{"rating": 5.0, "review": "This is great for what I use it for, streaming videos from my computer/laptop/tablet/phone.  I have had no issues at all with the laptop, tablet, but I have had some small lag issues or buffering issues from the desktop computer or phone.Other than that its great for the price and does the job, I would recommend this to anyone that likes to travel and watch movies from their tablet or laptops.", "verified": true, "helpfulness": "0/0", "author": "Cody"}, {"rating": 5.0, "review": "I love it..just what i needed...not a waste of money like i thought it might be...easy to use you will love it.", "verified": true, "helpfulness": "0/0", "author": "carol"}, {"rating": 5.0, "review": "This is our second unit.  The first one got trashed by grandkid(s) because it was in the HDMI port that was on the side of the TV and it got damaged when they were playing.  Wiser for that, I put inserted the new one in an HDMI port on the rear of the TV.  Both units worked find when linked to the software.  We use it mostly for Netflix.", "verified": true, "helpfulness": "0/0", "author": "R. Putnam"}, {"rating": 5.0, "review": "There are many applications that can be used to cast, what you want to see, to your TV. I use PlexTV.Chrome cast does an excellent job in reproducing the video I choose in my notebook in my TV.I recomend.", "verified": true, "helpfulness": "0/0", "author": "Alroger Luiz Gomes"}, {"rating": 4.0, "review": "This device is neat in that it allows you to \"cast\" your small screen or regular computer videos and such to a TV connected to the Chromecast. I wish there had been more clear information about how it worked, though. Because it doesn't actually stream media from device to TV, it streams from the internet from it's own wireless connection. The app that you install on your device essentially makes your device a remote control for the Chromecast. I don't use it as much as I expected to, but it's still a nice toy to have. I still use my Roku more.", "verified": true, "helpfulness": "0/0", "author": "J. Vaughn"}, {"rating": 5.0, "review": "You  know if you want this product or not. If you do its perfect and works exactly like you think it will.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 4.0, "review": "We are full time rvers. We thought the chrome cast would be perfect to use going from park to park using with each wifi set up but this is not the case. It has it's limits.  After talking with the google tech we found out if an individual pass word is used for a second portal to wifi, chrome cast can not go through.  We now have a hot spot.  This works great.  The tech with Google had no knowledge hooking to hot spot but said \"it might work\".  We now have Netflix and it works great..", "verified": true, "helpfulness": "0/1", "author": "Carolyn in Texas"}, {"rating": 3.0, "review": "still testing it and have not really used it.  what is itv that you want from me?  it's not worth the money at this point.", "verified": true, "helpfulness": "0/0", "author": "leroy moy"}, {"rating": 5.0, "review": "Can't beat the price and a lot easier to use than hooking up a laptop every time you want to stream a show. We use it for Netflix and with my iPad. Couldn't be easier!", "verified": true, "helpfulness": "0/0", "author": "Happy \"epenguin\""}, {"rating": 3.0, "review": "Installation was easy, but I am not thrilled with the quality of the \"cast\". There is a bit of a delay from the device to the tv. This was especially noticeable when using pandora. The songs would not play through there was a skip every few seconds, it brought me back to the 90's when I'd try to listen to a badly scratched cd!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]