[{"rating": 5.0, "review": "it was cheapand my son likes to watch teletubbies on youtube with itcan't really go wrong wit it", "verified": true, "helpfulness": "0/0", "author": "sam"}, {"rating": 4.0, "review": "4 out of 5 since I cannot taste the Salami. However the product is pretty decent for Netflix usage. Just need to get a better Android-device since my 150€ Huawei lags with the Chromecast/Netflix-app.", "verified": true, "helpfulness": "0/0", "author": "Markku Kynsijärvi"}, {"rating": 5.0, "review": "It's great, super convenient. In particular for netflix users.Couldn't have been more easy to set up and use. If you want to sit down and watch a netflix show, or a youtube video, this is the way to go.", "verified": true, "helpfulness": "0/0", "author": "peter_s"}, {"rating": 5.0, "review": "The ability to watch videos(Youtube) on my HDTV is really great. And the flexibility to cast from any android/ ipad is really useful.", "verified": true, "helpfulness": "0/0", "author": "Deepak"}, {"rating": 2.0, "review": "It works smoothly with YouTube (haven't tried with Netflix) , but other regular sites with streaming content are choppy because it has to play the entire page w/ video on both devices (TV & computer). Not sure why can't they automatically detect the streaming content URL from the page and play that  only on the TV to save the network bandwidth and avoid the choppy play. I returned it after trying for a week, but will buy if they can resolve this issue.", "verified": true, "helpfulness": "0/0", "author": "Venki"}, {"rating": 5.0, "review": "I absolutely ADORE my Chromecast. As with all Google Products, you simply plug it in and it goes; first time, everytime.Set-up takes seconds. Thereafter, it really is as quick & simple as clicking on the Cast icon, (that appears across all your devices in Aps with the coding) on the same wireless network. There is no additional fuss or installation required.The simplicity of the Chromecast really can't be overstated.My technophobic other-half who hates everything new and reserves special venom for 'stupid nerd toys', began casting in seconds, loves it and is now rarely ever off it. Indeed, I'm being pressured to get a second Chromecast for the bedroom.The sooner Ap developers get on board with with Chromecast; the better. It is undoubtedly the future. One Google innovation that isn't likely to go the way of the IG Homepage.", "verified": true, "helpfulness": "0/0", "author": "Si"}, {"rating": 4.0, "review": "Wiatching Youtube on TV is a great feature, but need more applications to support it => hope it will be there soon", "verified": true, "helpfulness": "0/0", "author": "Serguei GLOTOV"}, {"rating": 5.0, "review": "Been waiting on this for quite some time. This little product works really well and I watch videos from tabs.", "verified": true, "helpfulness": "0/0", "author": "Paul Giang"}, {"rating": 1.0, "review": "This product doesn't do much other than play netflix and YouTube on my tv... To bad my tv and receiver already do this. Thought I'd be able to mirror everything from my iPad, at the very least I was hoping to mirror safari and movies on my iPad... Skip this and get the Apple TV.", "verified": true, "helpfulness": "0/3", "author": "kyle hindley"}, {"rating": 5.0, "review": "Great way to watch videos from YouTube and Netflix on my TV.  Works flawlessly with my Android phone and tablet.  LOVE this!  Will probably buy another for another TV.  Well worth it!", "verified": true, "helpfulness": "0/0", "author": "L Rogers"}]