[{"rating": 4.0, "review": "Easy to set up, easy to use. I thought there would be more free programs to watch. I haven't used it as much as I thought I would.", "verified": true, "helpfulness": "1/1", "author": "MLO"}, {"rating": 2.0, "review": "OKAY,here is my Amazon Fire TV box review, first before i bought this box, i read about it, i was under the impression it would load some of the video before it started to play it, that doesn't appear to be true, every time i pic a TV show or movie, it starts playing almost immediately. The next 20 minutes are spent stopping and starting, and its totally annoying, now pay attention at this point if anybody is reading this, i know i have a slow connection, somewhere between .4 mbps and 1.2 mbps. now with that said, i buy or watchlst all the  SD programs, it still doesnt load. I then press pause thinking its loading up, and it doesnt, i press play and it immediately pauses again, like it didnt load up anything. My Sony blu ray player when i press pause you can see a progress bar of the program downloading, i press play and the program plays flawlessly to the end. i have looked for settings to make the amazon box load the video but cant find any. if any body knows how to get it to download when its paused please tell me, other wise this thing was just a waste of money??????????????P.S. ITS AS IF IT IS ALWAYS TRYING TO PLAY THE PROGRAMS IN HD, AND IN MY CASE I DONT WANT THAT!!!", "verified": true, "helpfulness": "0/2", "author": "Pipefittermike636"}, {"rating": 5.0, "review": "I  love it and also  bought one for my daughter", "verified": true, "helpfulness": "0/0", "author": "Larry Du Bois"}, {"rating": 5.0, "review": "Ordered this as our second Fire TV.  We have had many different type of streaming devices and this is our favorite.  It is quick and functions as we would expect it to.", "verified": true, "helpfulness": "0/0", "author": "S Family"}, {"rating": 5.0, "review": "I love it and use it constantly. I wish the batteries would last longer in the remote.", "verified": true, "helpfulness": "0/0", "author": "Abbey Rhodes"}, {"rating": 5.0, "review": "The Amazon Fire TV is fast and does everything I want it to. I love the voice search capability and the and how when you search a movie it will check your other apps to see if you can watch it for free. The overall performance of the Amazon Fire TV was amazing!", "verified": true, "helpfulness": "0/0", "author": "Jason Hunsaker"}, {"rating": 5.0, "review": "Was as expected...I watch it everyday...", "verified": true, "helpfulness": "0/0", "author": "Jean A Schultz"}, {"rating": 5.0, "review": "This item was on my Christmas list for 2014 and it did NOT dissapoint! I'm very happy with the product and use it daily. Since setting it up the day after Christmas, I've only ran into 1 instance where I've had to reset it via the remote. I've found some really cool apps that have fitness videos as well as my normal apps like Hulu, Netflix, HBO, etc. A huge plus is the option to hook it up wired via an ethernet cord or wirelessly as well as the voice search (hasn't pulled up anything incorrect yet as most voice recognition services do because of my accent!). Also, the prime eligible videos (movies and series) are the absolute best part! Overall, I'm super happy with the product.", "verified": true, "helpfulness": "2/2", "author": "Charla"}, {"rating": 3.0, "review": "It's alright. Even after you buy the Amazon Prime Membership you STILL have to PAY to watch most of what's on Fire TV.I thought that there was a lot more to watch for free after you had the prime membership than there is. I don't think we'll use it near as much as I thought that we would.", "verified": true, "helpfulness": "0/0", "author": "iaff170"}, {"rating": 5.0, "review": "We love the availability of children's material on Prime.", "verified": true, "helpfulness": "1/1", "author": "Jeremy Jones"}]