[{"rating": 5.0, "review": "I am very happy with chromecast, the setup was incredibly easy and trouble free. I was pleasantly surprised that a 1.0 device worked so well out the box. Works wonderfully for netflix streaming.", "verified": true, "helpfulness": "0/0", "author": "Rolando Godoy"}, {"rating": 5.0, "review": "By far, one of the greatest inventions, since the computer itself!!!  Very easy to setup and works with everything on your network!!", "verified": true, "helpfulness": "0/0", "author": "Chris Russell"}, {"rating": 4.0, "review": "I like being able to view online videos, music and my favorite shows on my tv. It also comes on automatically when I click on my phones netflix, pandora and HBOgo", "verified": true, "helpfulness": "0/0", "author": "Melanie Moradi"}, {"rating": 5.0, "review": "Great and simple device to use.  Accomplishes the objective of simply streaming your entertainment on to the big screen.  Price is fantastic.", "verified": true, "helpfulness": "0/0", "author": "zen-net"}, {"rating": 5.0, "review": "My Samsung TV is 6 years old and did not have built-in internet streaming capability.  The Google Chromecase is an inexpensive way to achieve this functionality.", "verified": true, "helpfulness": "0/0", "author": "Drjhp \"Still learning\""}, {"rating": 5.0, "review": "This is a great little device that makes it very easy to project movies, pictures, etc onto your tv with great quality and precision. Simple and very easy to use. So far no problems at all.", "verified": true, "helpfulness": "0/0", "author": "Susan B. Westbrook"}, {"rating": 3.0, "review": "You can output the contents of the Chrome browser to the TV or stream video to it while doing other tasks on computer.  However the mouse doesn't appear on the TV screen while you are browsing.  Also has to have a computer or phone to control selection of video material.  Not bad for the price.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 4.0, "review": "I use my Android to stream NETFLEX to a large TV in the living room. Now looking for more movie sources to stream.", "verified": true, "helpfulness": "0/0", "author": "Edward B. Barger Jr."}, {"rating": 5.0, "review": "That's good and bad. I like the Apple TV because I can stream directly off my iPad. I realize, though, that these are two competing operating systems. And this is less than 1/2 the cost of the Apple TV. Great item! I have two in my house along with the Apple TV and use these more. Plus it compensates for my smart TV's actually being a very stupid TV. Nothing ever works well with that feature. What gives?", "verified": true, "helpfulness": "0/0", "author": "Brian Richardson"}, {"rating": 5.0, "review": "Bought it for my husband for Christmas and he loved it , so bought 3 more as gifts! I'm sure they will like it also", "verified": true, "helpfulness": "0/0", "author": "J. Frey"}]