[{"rating": 5.0, "review": "I still sent it back, because it's a little half-baked, as the USB ports don't work yet. Everything else about the device is great. But a media hub with USB ports should offer a good experience viewing local content....", "verified": true, "helpfulness": "0/2", "author": "Willie L"}, {"rating": 4.0, "review": "This is the 1st streaming box  that i bought and it is a very good for the price of 99.", "verified": true, "helpfulness": "0/1", "author": "M. aggas"}, {"rating": 5.0, "review": "I've been pleased with the device so far, as it has presented a fairly easy setup process and the introduction guide aided in maneuvering the interface.  The voice recognition is fairly well built, mostly because I have a strong accent and for me to speak clear and normal; I received a strong feedback from the built in search application.  I plan to use this device for streaming media, either from Amazon Prime, Netflix, Crackle, HuluPlus, etc..and the need for a strong WiFi signal is needed; mostly because I don't plan on using a LAN connection at all.  Therefore, it has never once dropped signal and this can be because I keep the box atop of the desk instead of inside a open cabinet.  Overall, I'm very pleased with my purchase and I will update over the course of 3-6 months of use.", "verified": true, "helpfulness": "1/1", "author": "D. Lundy \"Technician\""}, {"rating": 5.0, "review": "My family and I really enjoy our Amazon Fire TV, the kids are having a great time with the games.", "verified": true, "helpfulness": "0/0", "author": "Jim Sacca"}, {"rating": 3.0, "review": "I thought when I bought the Fire TV to replace my Roku LT that I'd be getting all or most of the TV and music apps that I currently have, maybe even some of the magazine and newspaper apps.  But, no, not by a long shot.  The number of channels that I've given up by disconnecting my Roku LT is staggering.  Yes, there are games.  But I didn't buy the Fire TV as a gaming machine.I'm willing to hang in there, waiting for Amazon to upgrade their apps so they work on the Fire TV.  I see there's a problem with Kindle Fire HD apps upgrading to the Kindle Fire HDX.  Not happy about that, but patience is a virtue, and more are becoming HDX friendly.  So some problem with apps upgrading to Fire TV is forgivable.  Not for long though.  Amazon, you need to get to work.  This is ridiculous.On the other hand, Fire TV is fast and efficient.  There's lots of storage space.  Voice search is great...just wish I could search Netflix, too.  On the whole, this is a good machine.So, hardware A-.  Software D+.Update: May 23, 2014Amazon Fire TV is winning me over completely.  The speed of the hardware and ease of Voice Search is outweighing the lack of apps.  And now that old seasons of HBO are available to Prime members, well, this is good.So, when Voice Search becomes available across all apps, the hardware score will become A+.  Because Amazon is moving quickly to add valuable apps, with PBS, ABC and Disney in the works, the software score is now B.BTW I would still like the Vudu app on Fire TV even though Flixster also has my Ultraviolet movies.  There are 5 movies which show up on Vudu which don't show up on Flixster.  All of these are Disney movies which allowed me to choose whether I wanted the digital copies on Vudu or iTunes.  I chose Vudu, thinking I'd have more flexibility.  So, I can watch these movies on my Blu-ray player, Windows 7 computer, and my Android tablet.  And yes, my old Roku.  But not on my Fire TV, Kindle HDX, Surface or Windows Phone.  Bummer!  How spoiled I became so quickly.  What is this world coming to?", "verified": true, "helpfulness": "0/1", "author": "Nine Cats Corner"}, {"rating": 3.0, "review": "content that draws more attention in this type of equipment are the movies, and I was surprised when I realized that most, almost the entire contents of amazon prime is restricted only to usa.", "verified": true, "helpfulness": "0/3", "author": "Tavo"}, {"rating": 3.0, "review": "Many TVs and BD players as well as most media streamers support DLNA, why not the Fire TV ? This is a deal breaker.Until Amazon adds DLNA support to play media from a NAS or server there is no way I am going to get one.", "verified": false, "helpfulness": "0/3", "author": "TechGeek \"TXcrude\""}, {"rating": 4.0, "review": "This small box is great!! I have no need for a blue ray player because this thing is so fast the video looks like blue ray. Very smooth video play back. Planned on buying, trying, returning since we have smart tv that does the same; But the speed and quality made this a keeper.  Only reason a 4 star was because the Game controller from amazon was so expensive.", "verified": true, "helpfulness": "0/1", "author": "Jenifer"}, {"rating": 5.0, "review": "My husband wanted to talk to the tv so I gave him the fire tv for his birthday  it's amazing and fun to talk to. We had a slight problem with the word Zorro otherwise we don't have a problem. There are a lot of great movies and shows to chose from.  We would love to be able to get the www network on it.", "verified": true, "helpfulness": "0/0", "author": "Nadine Isabelle"}, {"rating": 5.0, "review": "I loved this thing from the second I opened the package and saw the sleek design. It's elegant, sets up in minutes, auto-downloads the latest version of itself and you're off and running.Every app I've installed has been seamless.One thing I would like to see: A screen saver that makes the screen go blank (though I supposed uploading my own album of black pictures would do the trick)  This would be nice to have when listening to music and snoozing off the zzzz-land....overall this thing rocks... definite bang for the buck", "verified": true, "helpfulness": "1/1", "author": "Dahlya"}]