[{"rating": 5.0, "review": "Out of the box excellent.  i plan to try the stick as well.", "verified": true, "helpfulness": "0/0", "author": "Rob Parris"}, {"rating": 5.0, "review": "What an amazing little device this Amazon  Fire TV is! It is so user friendly and stocked with so much entertainment; ie. video, audio, movies, TV shows and even all of your downloaded pictures  (free storage ) that it almost defies one's imagination. The video and audio are almost of movie theater  quality. It is simple to install (even for a technophobe).It has a remote selection device that seamlessly responds to your voice. It is so enjoyable that we just purchased another one for another TV.The only slight improvement  I would suggest is to increase the selection of free  movies and TV shows. If amazon did that, they could conquer the world! Thanks, Steve G.", "verified": true, "helpfulness": "0/0", "author": "Numero Uno"}, {"rating": 5.0, "review": "Loooove this device... Easy to use.. Works perfect with my harmony remote and as an Anynet+ device", "verified": true, "helpfulness": "0/0", "author": "Karl P."}, {"rating": 5.0, "review": "Absolutely wonderful gift!", "verified": true, "helpfulness": "0/0", "author": "Sandra L. Latimer"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Freeman Hill \"Mike Hill\""}, {"rating": 4.0, "review": "i like it , but android tv looks so much butter", "verified": true, "helpfulness": "0/0", "author": "Ciro"}, {"rating": 4.0, "review": "Very satisfied with this now.  I had some issues with getting Netflix to work but it started working.  Awesome little box!", "verified": true, "helpfulness": "0/0", "author": "Clint"}, {"rating": 5.0, "review": "Great selection of shows and apps, I have Amazon Prime so it's that much better", "verified": true, "helpfulness": "0/0", "author": "Jason Berglund"}, {"rating": 2.0, "review": "It keeps turning off,when not in use and I have to unplug  and replying all the connections.  Also the remote is not working,as it should.  I had to replace the batteries.", "verified": true, "helpfulness": "0/1", "author": "mary jane lukas"}, {"rating": 5.0, "review": "Very nice. Easy to navigate and use.", "verified": true, "helpfulness": "0/0", "author": "Lori B Clutter"}]