[{"rating": 5.0, "review": "Very goo", "verified": true, "helpfulness": "0/1", "author": "anazario"}, {"rating": 3.0, "review": "Really not a very good option for movies - the 40,000 free movies are mostly unknowns and the movies that are more current or older but with well known actors/actresses are for the most part available for purchase only. Less expensive options are available from other sources if you want to watch those movies. The best thing about Fire is the voice activation - much better than manually entering info. Except for the small initial cost for the Fire device - the 40,000 movies are esentially free since they come as part of the prime delivery option which I would use anyway. So I consider it a reasonably inexpensive perk - but of somewhat limited benefit considering the quality of the free movies available.", "verified": true, "helpfulness": "1/4", "author": "Luther Ben Weaver \"LBW\""}, {"rating": 5.0, "review": "I LOVE my Fire TV", "verified": true, "helpfulness": "0/0", "author": "Corvettedrvr"}, {"rating": 4.0, "review": "[Update: After reading what another reviewer here said about getting a refund after the price change, I emailed Amazon customer service and got a response saying, \"Since the price of the item has changed within seven days of the delivery of the order, I've issued a refund for the price difference.\" That is great. Thank you Amazon. I still have not had the device long enough to commit to higher than a 4 star review, but I am now up to 4.5 if it would let you award partial stars. One thing I did not mention before. It can be a little tricky to open the battery compartment on the remote to install the provided batteries. If you Google/Bing the issue, there are plenty of instructions on how to open it, including a very helpful YouTube video at http://youtu.be/jpz5yM0etKo. I guess I am not the only one who had a problem with it. I used a plastic knife like you would buy for a picnic instead of the metal screwdriver used in the video. Watched some Netflix this evening using the Fire TV and my Viewsonic computer monitor as a display device, and the results were excellent. Video and audio were great with no hesitation for buffering. End of update.]I just received my Fire TV today, and I would usually not review a product until I had more time with it, but I will make an exception in this case because I am mad at myself for buying when I did. As I said, I just got it today, and I see that it is now on sale for $15 less than I paid. I should have taken a couple of days more to make up my mind. That said, I will make a few comments based on my limited experience with the device.I wish it had an on/off switch. I have it connected to the same monitor I use for my computer. It is not a television where you can use your remote to select an input device. Either the computer or the Fire has to be off. You can plug the Fire TV into an outlet strip so you do have an on/off switch.This next one is a little difficult to explain. The remote control has a rounded back. One of the controls on the front of the remote is a wheel used for left/right and up/down. You must actually press the wheel to relay your command. It is not touch sensitive, but requires a definite press. Pressing this wheel at the 3 or 9 o'clock positions causes the remote to twist in your hand due to the rounded back offering no resistance. Like if you push down on one side of a canoe, the other side goes up. This would not be an issue if the back was more square.These minor annoyances aside, the device does what it says it will do. It does a much better job of streaming video that my 6 year old laptop. It is very simple yet elegant in design. Don't forget, it does not come with an HDMI cable to connect the Fire TV device to your TV, but you can order the same one offered from Amazon as part of the Fire TV gaming bundle. This cable is inexpensive, but good quality.", "verified": true, "helpfulness": "0/0", "author": "Broke in Arizona \"gap4\""}, {"rating": 5.0, "review": "This is the best streaming product I used so far ; better than apple, roku and goggle chrome.", "verified": true, "helpfulness": "0/1", "author": "Amirul Islam"}, {"rating": 5.0, "review": "Way to go Amazon! I ordered the Fire TV Friday morning, Oct 31, and it was at my doorstep just after noon Sat, Nov 1. Granted I'm a Prime subscriber, but still . . . was there a drone dispatched to my apt.? I mean, I don't live in Seattle or anywhere near a large city! Amazing.The Fire TV is the size of a piece of bread, yet it delivers more quality than I ever expected or imagined.Then the glitch. I was so impressed, I went to the Amazon.com Fire TV url to copy and forward to a friend, and found that the price had been cut! But, knowing Amazon has outstanding customer service, I dispatched an email to customer service, and today (Wed, Nov 5) I got a notice that my billing had been adjusted. Nice. Way to go! No wonder I'm an Amazon fan.Back to the Fire TV itself. As many have noted, it isn't really easy to find the movies that are included in my Prime subscription (I don't call them \"free\" movies, because, well, they're not; after all, I pay for my Prime subscription). My work-around is to go to the Amazon website, login, go the Prime section and look through the available movies and add ones I'm interested in to my Watchlist. A bit of effort, yes, but, it works. Also, attached to any movie I like is a row of other \"similar\" movies I can explore.Even though there are many movies I can watch without additional costs above my Prime subscription, there are many, many more that require purchase to watch, and/or to upgrade to HD. Not a deal breaker, but still, not necessarily what I was expecting. Take \"Fargo,\" for example. An old movie I like, but to watch it I'd have to pay extra, and the rental costs are not less than my local Safeway or cable TV. Even some of the older TV series require a purchase to watch, although my cable OnDemand doesn't.There is no way to turn off the Fire TV (except by unplugging it) although it does \"turn off\" after 30 minutes of downtime (even though it is still available for updates and downloads - so is it really off?).But all in all, I'm satisfied with the Fire TV, and continue to be amazed at Amazon's customer service. Thanks guys (and you, too Jeff)! No wonder I've been a fan for over 20 years.", "verified": true, "helpfulness": "1/1", "author": "Jim J."}, {"rating": 3.0, "review": "I purchased the amazon fire to replace my xbox one which was being moved into a different room. After playing with it in best buy I thought that the feature to use the voice search for any movie would allow the search to not only search through Amazon Prime but also through Netflix and Hulu. Which it doesn't seem to be able to be able do. :( We still have the prime because we hope that that feature will be changed. Other than that flaw everything loads quickly and is easy to use.", "verified": false, "helpfulness": "0/3", "author": "M. Whitney"}, {"rating": 5.0, "review": "Brand new item. So far it works as advertised. Was easy to set up ( I'm a 75 year old male non- techie and even I cojld do it!!!), and worked fine right out if the box.Voice search feature is cool and actually works, too! Have only used it for movies and TV shows so far, but no complaints.", "verified": true, "helpfulness": "0/0", "author": "Cap'nR"}, {"rating": 2.0, "review": "So I love amazon for online shopping and have never been disappointed with shipping or products offered but after much research, I decided to go with the amazon fire tv. I knew from the get go that it didn't offer many channels but after reading it had unlimited access to over 40,000 videos on prime alone plus 200,000 tv shows, I figured what the heck, why not. Well, I only found about 100 movies and maybe 60 tv shows. 160 is no comparison to 40,000 and 60 tv shows is certainly no comparison to 200,000!!!! Show me even 5,000 movies and a afew thousand tv shows, and I might feel a little better about the purchase. Alot of the movies or shows were kinda outdated with a semi recent one here and there. Very disappointed!! Thankfully I have prime which gave me access to most movies and shows for free, but I can't even imagine someone buying this with no prime account to watch movies. You might get lucky with a handful of free shows or movies from like 20 years ago though but how many times can you watch the same ones over and over?. I don't have any experience with roku or apple tv, but I can't imagine them being this bad. After all, I believe Roku 3 has over 1000 channels or something. Maybe, I'm missing something, but if someone can shed some light and show me where to access these 40,000 videos, I would be grateful. Do your research and be aware that your free movies will be very limited.!! On the plus side, the unit seems well made, the remote works well, and the menus are pretty straightforward. But please, amazon, you really ought to be more honest about the 40,000 videos and 200,000 tv shows!!.", "verified": true, "helpfulness": "4/5", "author": "JerseyShoreGreg"}, {"rating": 3.0, "review": "I bought this as a new plex device.  The UI is very nice.  Everything is very fast.  However, there are some issues with the remote buttons \"sticking\".There is no HDMI cable included in the box.There is no IR support for universal remotes.  This is incredibly frustrating and will force me buy another remote or buy a USB -> IR receiver.  That tacks on at least $25 to the price if you want IR universal remote support.The inability for this device to integrate into my existing home theater setup is frustrating.  I'll probably keep the device because of the lovely UI and general speediness.", "verified": true, "helpfulness": "3/3", "author": "AnonReviewer"}]