[{"rating": 5.0, "review": "This is a nice product. I always stream videos for my LO so she can watch youtube on TV.", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 3.0, "review": "Like the Roku remote control better. This works, but I don't like the lag time for tablet controls.", "verified": true, "helpfulness": "0/0", "author": "Becky \"Blen\""}, {"rating": 5.0, "review": "We have one and bought this one as a gift for our parents. They aren't very tech savvy but this was very easy for them. Love it, good job google!Now if only you would add NFL...", "verified": false, "helpfulness": "0/0", "author": "Kristin Moran"}, {"rating": 3.0, "review": "Ok product. I expected more, my own fault. But still good.", "verified": true, "helpfulness": "0/0", "author": "maragon705"}, {"rating": 5.0, "review": "this works great, very fast and easy install.", "verified": true, "helpfulness": "0/0", "author": "George Pierpont"}, {"rating": 5.0, "review": "I can't believe I put off buying this for so long. Loving it.", "verified": true, "helpfulness": "0/0", "author": "UncaLawwy"}, {"rating": 5.0, "review": "Very good choice.", "verified": true, "helpfulness": "0/0", "author": "OVIDIU MORAR"}, {"rating": 5.0, "review": "I love this! Just got it a few days ago and it has closed the gap on things I've been missing since we cut out cable. Highly recommend!", "verified": false, "helpfulness": "0/0", "author": "vpetro"}, {"rating": 3.0, "review": "Before I start, the Chromecast works great if it's what you want.  I found no bugs while operating it,  and because it is HDMI-CEC capable,  all I need to do is click cast to Chromecast on my phone,  and then it turns on my TV,  surround sound,  and changes to the appropriate source.  However, if you do research on what the Chromecast is actually capable of,  this is where the review comes in.  There is no kind of UI on the actual Chromecast,  and the only way to control it is with your phone,  computer,  or tablet.  That is really annoying when you are trying to go to sleep with it on,  and it has no sleep yet to turn off during the night.  Also,  because it runs through your phone or other device,  there are only a certain number of apps that work smoothly with Chromecast.  You can use the screen mirror,  but it is extremely laggy with a lot of bugs.I would not purchase this again,  but I would consider buying something like the Nexus Player,  Kindle Fire TV Stick,  or a Roku.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "I love Chromecast.  I have one on all of my TV's so if I switch rooms while I am watching something, it is easy to take with me.", "verified": true, "helpfulness": "0/0", "author": "Connie K Davis"}]