[{"rating": 5.0, "review": "I LOVE LOVE this.  I can sit on my couch and watch youtube on my big screen.  Or, I can use my phone to scroll through photos on my phone and show them to a big group while they display on my HD bigscreen.", "verified": true, "helpfulness": "0/0", "author": "David Anthony"}, {"rating": 5.0, "review": "My daughter is using this in college.  Cheaper than cable!  Easy to set up too.", "verified": true, "helpfulness": "0/0", "author": "William Bertram"}, {"rating": 5.0, "review": "You like to watch Netflix or YouTube? or viewing pictures on TV with your family? Would you like a device very easy setup, excellent performance, and also that is controlled from the cell phone? Then you will love the Chromecast!", "verified": false, "helpfulness": "0/0", "author": "Luis Barboza \"SnowFir\""}, {"rating": 1.0, "review": "I received only one, but i bought 3. The box of the 2 others was empty. What happens ?", "verified": true, "helpfulness": "0/1", "author": "Humberto Mattos Carvalho"}, {"rating": 4.0, "review": "It took some trial and error and searching online for help before I could get the unit to work. When I followed the installation directions and it didn't work, I had nothing else to go by.", "verified": true, "helpfulness": "0/0", "author": "Paul Rae"}, {"rating": 5.0, "review": "I got one of these, played with it for a little bit, and honestly forgot about it.  Then my nephew came over and started playing NFL Highlight videos from the couch.  He didn't have to touch the TV remote.  I'm not sure how he even knew I had it.  After that, I was intrigued.  I ended up buying a second one for the bedroom.My TV menus can be a little slow to navigate, especially if you are trying to search for something.  With this, I can look up a video on my phone, which is MUCH easier and faster, and then just tap the Chromecast share button.  The TV automatically just starts playing the video.  You don't even have to change channels.If you stream a lot of video, this really is a must have.  Especially considering the price!", "verified": true, "helpfulness": "0/0", "author": "Ted D. Hadley"}, {"rating": 5.0, "review": "Great product, great price, easy to use", "verified": true, "helpfulness": "0/0", "author": "Harvey f Sterling"}, {"rating": 5.0, "review": "Great quality and makes my life easy when watching online videos.", "verified": true, "helpfulness": "0/0", "author": "Amit Bhatnagar"}, {"rating": 5.0, "review": "Best streaming media player out there! Very easy to set up and use. I didn't think that I would really have a use for this thing until I actually got it. Now that Google is expanding their support for it and allowing you to cast your screen (on select phones) I use it all the time! Might even buy 1 or 2 more the Christmas!", "verified": true, "helpfulness": "0/0", "author": "Angela Jones"}, {"rating": 5.0, "review": "Great product, it works well!", "verified": true, "helpfulness": "0/0", "author": "Christopher Marquand"}]