[{"rating": 3.0, "review": "The product itself works fine. It was easy to hook up and easy to use. The issue I have is with the rental prices of some of the movies. It seems some of the older movies rent for the same price as the latest releases. That to me is plain unfair. Any movie older than a year should be greatly reduced. Amazon needs to address this pricing issue.", "verified": true, "helpfulness": "0/0", "author": "David W. Wunsch \"disgruntled consumer\""}, {"rating": 4.0, "review": "It,s very easy to use. I also like the voice command feature which makes it easier to find movies that you are looking for.", "verified": true, "helpfulness": "0/0", "author": "Michael Melville"}, {"rating": 5.0, "review": "This is awesome. The only thing is that it doesn't have a power button", "verified": true, "helpfulness": "0/0", "author": "Riley Merrill"}, {"rating": 5.0, "review": "Love it.  I am getting all caught up on shows I've been wanting to see. I may never leave the house again!!", "verified": true, "helpfulness": "0/0", "author": "Pam Francis-tuss \"sactopam\""}, {"rating": 5.0, "review": "Easy to set-up.  Easy to use. My kids love it.", "verified": true, "helpfulness": "0/0", "author": "Kevin Cheatham"}, {"rating": 2.0, "review": "It's OK bit seems limited", "verified": true, "helpfulness": "0/1", "author": "Jim Strunk \"Jim Strunk\""}, {"rating": 5.0, "review": "Great. Even my technology challenged husband can use it.  Content is fabulous", "verified": true, "helpfulness": "0/0", "author": "Davis \"Educator, married, no children\""}, {"rating": 5.0, "review": "Better then Apple TV", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 4.0, "review": "I only gave this a 4 star rating because I hold out 5 stars for mind altering experiences.  Lots of old movies that I like.  Lots of newer stuff the kids like.  Soupy Sales, Lancelot Link, Rocky and Bullwinkle, Many many Godzilla movies, Li really like it.  ATT Uverse lost money on this little thing.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Even though Gary Busey is a bit annoying in the Fire TV ads, I prefer my Fire TV box to my Roku box for its voice search capability and seamless integration with Amazon Prime Instant Video.  I also recently bought the Fire TV Stick and prefer the voice search of Fire TV, vs. typing in my search terms for Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]