[{"rating": 5.0, "review": "This is the best thing ever.  And I don't write reviews.  I am so impressed. I LOVE Apple TV and I'm sad that I am a convert. But, it would be SADDER, if I had ignored Fire TV.  And I almost did.  Unbelievable.  Get it !  You can always send it back if you don't like it. But you will love it.", "verified": true, "helpfulness": "1/1", "author": "Jen A \"!aani\""}, {"rating": 5.0, "review": "I've had Netflix and Hulu for a long time, and was really underusing them. The Amazon Fire is wonderful and works really well with these programs. I don't like the search function because it only searches in Amazon Prime, which is very much more likely to charge for a video than Netflix.", "verified": true, "helpfulness": "0/0", "author": "Dianne Clark"}, {"rating": 2.0, "review": "I had high hopes for this device, but I just got sick and tired of having the Fire TV disconnect from my TV. It also pauses what I am watching. Sometimes it will be fine for a while, and sometimes it disconnects/pauses every few seconds to a point where is very annoying. I have to turn my TV off and back on every time to reconnect.  I connected by Xbox to the same TV and had no issues, so it is the Fire TV.This is a problem is you are playing a game (specially a pinball game) since the screen goes blank when it disconnects and you lose your place in the game. I called customer service, and they said they never heard of this issue (which is weird since I see a lot of the same complaints in the reviews) and really said nothing that would fix this.I am hoping Amazon will fix this issue in a patch and deliver what was promised.", "verified": true, "helpfulness": "1/3", "author": "William C. Gundaker"}, {"rating": 5.0, "review": "We had Apple TV first, it is ok.  The Netflix and other applications work better than the Apple application.  \"Geniuses\" at Apple said we were having an internet modem problem, but then why wouldn't Netflix and HULU experience the same?  All from the same modem.  Then we went ahead and bough the Fire TV - and are so glad we did.  We are PRIME members, so there are loads of titles available to us under the PRIME account (can't really say 'free' since we pay an annual fee for PRIME), movies load in an instant, no waiting for the spinning circle, then for authorization . . . sometimes Apple TV would return a message indicated \"Your title will be available to watch in 9 hours and 14 minutes\". . well since it was a 2 hour movie. . not interested in waiting 9 hours for it to load.  We have not had that problem one time with the FIRE TV.  And the voice search is a great feature, not the selling point, but a nice 'extra'.  Apple has been moved to the bedroom TV, still painfully slow. . .", "verified": true, "helpfulness": "0/0", "author": "D. Nothaus"}, {"rating": 4.0, "review": "Amazon Fire TV is great and I was happy to get a pay plan for it. I just wish HBO GO was available on this. I know it will be later in the fall, but I wish it was on there when I bought it. What Amazon Fire does offer is awesome. I use Netflix, Hulu Plus, Pandora and Amazon Prime quite a bit on this thing and everything is fast.", "verified": true, "helpfulness": "0/0", "author": "Gabie"}, {"rating": 5.0, "review": "I have had the Fire TV up and running for a few days now.  Thus far it has been a fantastic device!  It is so much faster than the app on my Sony TV.We have watched a few movies and TV episodes on it and it never buffers, does not have to check the connection speed, nothing, it just instantaneously starts!The RF remote is great, doesn't need line of sight and the speak to search function has been flawless.  It has never once failed to produce the correct results.As of this date the Prime choices are clear and easy to find.  Yes, a search just for Prime content would be nice, but I have not had an issue yet finding Prime content.  In this regard, the Sony app is better, but not having to wait 5 minutes for the app to get on screen then struggle for 5 more typing in a search query on the remote is a blessing and a half.Install was a breeze, setup took just a few minutes. The device, like the Apple TV is always on, so getting to content is as easy and quick as getting to the correct input, and touching a remote button.Having both the Fire TV and the AppleTV, I prefer the Fire. This is mainly because of the content with being a Prime member.  The AppleTV is mainly used to mirror the iPad to the TV now.I would gladly purchase this device again, and likely will as gifts.", "verified": true, "helpfulness": "0/0", "author": "RLC"}, {"rating": 5.0, "review": "I love my fire t.v. I had a google t.v. hisense or whatever it's called. I actually gave it away happily. The fire t.v. is the best 100.00 I have ever spent as far as television/movie access aparatus. I love my fire t.v. and it was already set up to my amazon account. I just needed to put in my wifi password. Even netflix is a breeze now.", "verified": true, "helpfulness": "0/0", "author": "Rene Beaurline"}, {"rating": 5.0, "review": "Works as advertised.  Very easy setup and very nice interface on my TV.  I can't compare to any other product because this is my first experience streaming content, but I think it works very well.It is a good idea to use your home computer to review, and add content to your watch list because you can navigate all the choices much faster.", "verified": true, "helpfulness": "0/0", "author": "nibes"}, {"rating": 5.0, "review": "Does everything it said and more!  Highly rate it!  SOOO MUCH better than the ROKU, easy to use and support is great!", "verified": true, "helpfulness": "0/1", "author": "Denise"}, {"rating": 2.0, "review": "If you have cable TV, almost anything available on Amazon Fire TV is on cableunless you are willing to buy subscriptions, pay to view things, or join Net Flix or something like it", "verified": true, "helpfulness": "1/6", "author": "Amazon Customer"}]