[{"rating": 4.0, "review": "It is worth the price. Got a tablet for Christmas, should have read all of the specs on this. Can only use a few apps with this. Was thinking that I could see everything that I do on my tablet on the TV.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Roku or Google Chrome?  $99 vs $39?  Easily for the price and performance differences Chromcast is the winner.  Got it stuck it into the USB socket in the TV, pair it with your device and you are in business. Anything that you can stream on your device can be streamed to your TV with the same quality.  If the original video is HD, it will play HD on your TV.  Simple, works great.", "verified": true, "helpfulness": "0/0", "author": "Szoo2"}, {"rating": 5.0, "review": "It does exactly what was advertised. Need more apps to increase my enjoyments. I like the crisp videos in hd.", "verified": true, "helpfulness": "0/0", "author": "Brotherair"}, {"rating": 5.0, "review": "Excellent Price. Easy to set up on myTV with its HDMI port and power . Works seamlessly. Needs more apps.", "verified": true, "helpfulness": "0/0", "author": "Wayne C."}, {"rating": 5.0, "review": "Easy to set up and use. Works get with IPad and no more wires running from my computer to TV", "verified": true, "helpfulness": "0/0", "author": "david raymond"}, {"rating": 3.0, "review": "Tho' the degree of difficulty may be attributed in part to my own ineptitude with such technology accessories, I thought it could have been an easier start-up.", "verified": true, "helpfulness": "0/0", "author": "Frank W. Hawthorne"}, {"rating": 5.0, "review": "My life has changed since I got this thing. I don't know why anyone would think twice before buying this. Its soo cheap", "verified": true, "helpfulness": "0/0", "author": "W. Ali"}, {"rating": 5.0, "review": "I love Chromecast!  I bought a second one last week.  I can watch Netflix, Kindle and Youtube plus more.  Got rid of cable four years ago and not sorry one bit knowing that I save $180 a month without it. This item is worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Camilla Rose \"Camilla Rose\""}, {"rating": 5.0, "review": "Love it, works great, we use it probably 4 nights a week.  Super easy to use, to the point my techno-phobe wife has no issues with it.  We got a second and have it in multiple rooms now.  Lovelovelove it.", "verified": true, "helpfulness": "0/0", "author": "Geoffrey F. Marsh"}, {"rating": 5.0, "review": "Great Product!Works well with apple products and pc.Would recommend it to people who are looking for streaming media player.", "verified": true, "helpfulness": "0/0", "author": "RQTS"}]