[{"rating": 3.0, "review": "I really wish I could use it, but my router/modem isn't compatible w/it. Plus, it comes w/a USB cable, so I paid for something I can't use and something else I didn't need. I'm keeping it though, I will replace my router/modem. I really think this is a cool thing. Plus I paid for Amazon Prime and want to see the movies on TV, not a 6\" screen.", "verified": true, "helpfulness": "0/2", "author": "zoe"}, {"rating": 2.0, "review": "Welcome to the Chromecast Beta testing team. If you bought one of these, you are a lab rat for Google while they fix all the many, many bugs and shortcomings. Barely works, I returned it for a second Roku. Controlling playback with your phone/tablet is very clunky. This REALLY needs a physical remote or at least a remote on the streaming device. The wireless antenna is very weak, and it would stall out constantly unless it was very close to the router. My other wireless devices work great all over the house, this one refuses to work unless its in the same room as the router. Also, no support for TWC TV and no support for Amazon. This device needs A LOT of work and much better apps before its worth even the sale price. For $20 more I got a second Roku box which is 1000 times better.Needs an App badly! Casting is controlled by an overlay on the App, for example in Netflix it puts a casting icon that tells your phone to cast the show. The controls are flaky at best. On the touchscreen the visual indicator that you have pressed play for example, makes the Play Icon turn from white to light gray. It's difficult to see the difference. Also, its not responsive. Click play, nothing happens, click play again, nothing happens, click play again, nothing happens. It sits there for 30 seconds then run all the clicks really fast like they were stored up and all executed at once.Playback is often jumpy and freezes. My Roku box does this very rarely but the Chromecast would freeze frequently (on the same wireless connection) and go though endless buffering.", "verified": false, "helpfulness": "0/1", "author": "Dexter and Trixie VanDerSnoot"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Botteon"}, {"rating": 2.0, "review": "its not capatable to apple product", "verified": true, "helpfulness": "0/1", "author": "Vene lagon"}, {"rating": 5.0, "review": "Works great. Prompt delivery", "verified": true, "helpfulness": "0/0", "author": "Big Woozie"}, {"rating": 5.0, "review": "Very useful, but could be a bit faster.", "verified": false, "helpfulness": "0/0", "author": "Louis Boutin"}, {"rating": 5.0, "review": "Hello ... the product is excellent and very beautiful .. thank you .. and happy day", "verified": true, "helpfulness": "0/0", "author": "abdrhman alsalh"}, {"rating": 4.0, "review": "Fun product, but not enough supporting applications, although a great one is Plex", "verified": true, "helpfulness": "0/0", "author": "Itamar Sharoni"}, {"rating": 5.0, "review": "Just best media player ever.", "verified": true, "helpfulness": "0/0", "author": "Stavr"}, {"rating": 5.0, "review": "Best $23 I've ever spent. Love this little gadget! Extremely satisfied with the product, price, and shipping speed!", "verified": true, "helpfulness": "0/0", "author": "Jaime"}]