[{"rating": 5.0, "review": "It just does what it is supposed to, no hassles, it works great!", "verified": true, "helpfulness": "0/0", "author": "ticostudio"}, {"rating": 1.0, "review": "product worked at first but now will not sync up.  I think it is broken.  Lasted only 9 months.  very disappointing.", "verified": true, "helpfulness": "1/1", "author": "neil mendel"}, {"rating": 5.0, "review": "Works Great!!", "verified": true, "helpfulness": "0/0", "author": "ervert knohr"}, {"rating": 1.0, "review": "Cant seem to get it to wrk w/ our Samsung S5 or Note3 Screen Mirror feature. Didn't come w/ much information. Can't figure it out. Tried Googling n YouTube for info, but no success", "verified": true, "helpfulness": "0/0", "author": "Joanna Leal"}, {"rating": 5.0, "review": "Now I can watch Netflix without dragging in the Wii when I want to watch in my room.", "verified": true, "helpfulness": "0/0", "author": "K.H."}, {"rating": 5.0, "review": "Love it got to ordere a couple of more soon!!!", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 2.0, "review": "Not worth.", "verified": true, "helpfulness": "0/0", "author": "Sumeet"}, {"rating": 5.0, "review": "Works Great, Now I dont have to sit up and watch streamed movies on my computer", "verified": true, "helpfulness": "0/0", "author": "Allison Bryan"}, {"rating": 5.0, "review": "Works fantastic.  I use it especially for Netflix, Hulu and YouTube.  HOWEVER (not the product's fault), Amazon will not let it work on Amazon streaming videos (Prime Videos) which is a bummer.  There is no legitimate workaround and the workaround available is horrible.", "verified": true, "helpfulness": "0/0", "author": "Jean K"}, {"rating": 5.0, "review": "Works just as it advertises. This is my second unit. I do not have any smart tvs in my house but chrome cast makes it seem that way. Was easy to set upThe only disappointment is not with Chromecast but rather the app who do not have it as an option to cast. With only a smartphone,  a cheap one at that, it's a whole new experience.  The kids love that they can cast from thier phones.... maybe a bit too much for my liking. .. lolAn inexpensive option for a guest room too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]