[{"rating": 5.0, "review": "I have enjoyed my Chromecast after purchasing it a couple of months ago. I watch Netflix and YouTube, mostly, but I can stream Hulu and other content. The price is excellent, and it's hard to believe such a small device could do so much. You need a smartphone to use as a remote to cast your content. Netflix and YouTube use lots of WiFi, so you may go over your WiFi provider's limit, but Chromecast is not the problem. It's the best $30 I have spent in a long time.", "verified": true, "helpfulness": "0/0", "author": "Dianna"}, {"rating": 5.0, "review": "fabulous", "verified": true, "helpfulness": "0/0", "author": "nomilev"}, {"rating": 4.0, "review": "Beautiful device, a transfer of mobile content to television, but disadvantage. The applications restricted only to Google. You can not use other applications", "verified": true, "helpfulness": "0/0", "author": "Salama A Alsharari"}, {"rating": 5.0, "review": "My husband says this is the best Christmas gift he received this year! It's fun to share our favorite YouTube music videos with each other!!", "verified": true, "helpfulness": "0/0", "author": "S. L. Cesard \"Lynn in VA\""}, {"rating": 5.0, "review": "it just works", "verified": true, "helpfulness": "0/0", "author": "Ahmed Zarouni \"azarouni\""}, {"rating": 5.0, "review": "Enjoying Chromecase HDM1 streaming.", "verified": true, "helpfulness": "0/0", "author": "Kathleen"}, {"rating": 5.0, "review": "No issues Good Product, Was what I expected will buy from them again.", "verified": true, "helpfulness": "0/0", "author": "mrsucram"}, {"rating": 2.0, "review": "I'm reviewing this now almost two years after purchasing, so I'm already way behind the times. For the record, we've used Apple TV for the last year and are pretty dang happy with it.In any case, the Chromecast of 2013 was a terrible product. It froze. It logged in and out sporadically. It never did what it was supposed to. And perhaps worst of all, it created its own WiFi network (to enable streaming) that my iPad hopped on automatically, leading to frustrating Internet attempts for a good couple months. I'm a total Luddite so I'm sure there were ways and hacks to make it work that I never explored, but I'm not gonna change who I am for Google, so there.Like I said, not sure how the product is doing now, but we like Apple TV enough to not want to find out. But, at $35, this Chromecast was no bigger a waste of money than one cocktail at Tenjune in NYC, so there's that.", "verified": true, "helpfulness": "0/0", "author": "Annie Z"}, {"rating": 5.0, "review": "More than expected here in the package.  Works really well over good internet service.  Sometimes has problems in apartment dorms where the internet varies.", "verified": true, "helpfulness": "0/0", "author": "TC"}, {"rating": 4.0, "review": "do your homework first. Chromecast is fine, but others may work better", "verified": true, "helpfulness": "0/0", "author": "Michael L. Timm \"Sandman\""}]