[{"rating": 5.0, "review": "It has surpassed my expectations. Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Fire TV is great and makes accessing Prime movies and TV easy.  Setup was accomplished with minimal effort.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A Christmas gift from my son & his family. Love it !", "verified": true, "helpfulness": "0/0", "author": "Katherine E. White"}, {"rating": 4.0, "review": "Great, I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Glenda Standridge"}, {"rating": 5.0, "review": "Love this system, easy to install and use, small so can hide or mount anywhere.", "verified": true, "helpfulness": "0/0", "author": "Kisha Turnbeaugh"}, {"rating": 5.0, "review": "This was so easy to set up! Took me just a few minutes and the on screen tutorial was very easy to understand. It's so nice to watch my Amazon Prime on my big screen TV.", "verified": true, "helpfulness": "0/0", "author": "Linda Saunders"}, {"rating": 5.0, "review": "A must have if you are using front projector and want to have instant Amazon content in your home theater. What you also get is TONS of other content through various free apps (check out Pluto TV - I friggin' love it!). HD streaming is smooth and instant given you have a decent IP bandwidth speed available. Speak and seek is really nice too: fast, reliable and seamless. My kids are also enjoying the games. They are not XBOX 360 quality by any stretch of imagination, but are decent, run well, and most of them are free - a combo hard to beat these days. I only wish the gaming controller was available in less than 4 weeks... Overall score... it's a must have for any Amazon Prime member. I snatched it while it was on 30% off sale... sucks to be you if you didn't, lol.", "verified": true, "helpfulness": "0/0", "author": "Andrew Rogowski"}, {"rating": 5.0, "review": "Easy to set up and use. It provided the convenience I had been looking for with out having to login.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great. Works right out of the box. Easy to use. Just what I was wishing for.", "verified": true, "helpfulness": "0/0", "author": "JR in Hawaii \"JRC808\""}, {"rating": 5.0, "review": "We are enjoying this new way of watching television.", "verified": true, "helpfulness": "0/0", "author": "KEH"}]