[{"rating": 3.0, "review": "Likes:- fantastic, compact HDMI-plug design- intuitive and responsive on-screen controlsIssues:- confusing at first to install both Chrome and the Chromecast plugin for iOS- need to power through USB means there are still logistical constraints (distance from and cabling to either a wall plug or powered USB port)- when viewing YouTube videos using Chrome, so many HD videos that were viewable on streaming device (phone, tablet, laptop) weren't through the Chromecast (not viewable due to resolution issues)", "verified": true, "helpfulness": "0/0", "author": "HK"}, {"rating": 4.0, "review": "Seems to work well. It was a gift. . I looked on the net and worked for a good while before I could get it to work.", "verified": true, "helpfulness": "1/1", "author": "Danny R. Guill"}, {"rating": 5.0, "review": "A most used toy during the holidays. Though our TV has internet capability, using chromecast made everything simpler (search, select, play). Setup was simple, loading app on smart phones (android and apple) was straightforward.  It was easy to stream from one smartphone to the next.  I encourage Google to expand the list of apps that can chromecast, and to make it easy to view photos and videos that are on personal folders.  I wish I can have chromecast in my car - to cast google-maps onto the nav screen", "verified": true, "helpfulness": "0/0", "author": "SK"}, {"rating": 5.0, "review": "Lots of fun and easy to use turning your phone into a big screen production - the requirement that you type in so many words on these ratings makes me often delete the emails for a rating but this product fascinating", "verified": true, "helpfulness": "0/0", "author": "Marian Fordyce"}, {"rating": 1.0, "review": "i purchased this to use with my Prime membership so i could watch movies on my tv without using hdmi as my laptop has no hdmi connection. i am extremely disappointed in this purchase and would like to know if you are going to adapt prime to allow you to stream this way. thank you, Marcy Hagmeier marcyhagmeier@gmail.com", "verified": true, "helpfulness": "2/2", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Pretty cool little device. Very portable and simple to move from room to room. The apps are limited, but we enjoyed the free trial at Netflix. I'm not sure why, but not all casting was in HD even when the original file was. Probably just me.", "verified": true, "helpfulness": "0/0", "author": "volksmark"}, {"rating": 4.0, "review": "Concept is great.  Controlling it, though, between phone and laptop can freeze it up.  Really wish I could give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "esenef74"}, {"rating": 3.0, "review": "This was a great choice for the price. Only drawback was that you really only stream movies and video. does not link to the entire PC nor the phone. So great for movies and turns your TV to similar Smart TV if you have WIFI in your house to set it up.My son purchased a ROKU for me for Christmas so I'll do some comparing", "verified": true, "helpfulness": "0/0", "author": "carlos krieger"}, {"rating": 1.0, "review": "The Chromecast only cost me $25 and it is still a rip off. It offers an iPhone user nothing but YouTube and Netflix streaming. But 90% of the TV made in the last five years offer that anyway. I had hoped I could stream web content or my music but it does not. A quick visit to the web site was also useless and when they wrote me an email back to help all I got was the same useless FAQ from the website.If you have an iPhone spend the extra money and get an Apple TV. This thing is pretty much useless.", "verified": true, "helpfulness": "1/1", "author": "Alan L. Emery"}, {"rating": 5.0, "review": "I can pull up a video on Netflix and when I'm ready to broadcast to my TV, it automatically tunes to that setting and begins playing.  I have spent many hours getting caught up watching a new favorite (after the fact) shows--Breaking Bad.", "verified": true, "helpfulness": "0/0", "author": "Adam Knott"}]