[{"rating": 1.0, "review": "Amazon just came out with the fire tv but it needs a software download. I downloaded the update 3 different times and it still won't work.", "verified": true, "helpfulness": "2/18", "author": "JJ"}, {"rating": 4.0, "review": "I would give it a 4.5 if it was an option because it performs flawlessly in everything it is advertised to do, however, I believe that since it is running Android 4.2.2 it should be able to do a little more and it needs a less cluttered GUI.Let me start out by saying that the FireTV reboot is ridiculously SUPER FAST, only seconds. I bought this to replace my ROKU XS, the ROKU crashes on occasion and was slow in general, rebooting was a pain. The FireTV is so much faster in comparison and easier to live with.The YOUTUBE integration with the phone or tablet is very nicely done and really the only way to watch a YouTube web-series on the FireTV because the YouTube app on the FireTV is unorganized and it is very hard to find web series in any particular order. much like the rest of the device. With the phone and tablet integration I can connect my phone's YouTube app to the FireTV and anything I play on the phone automatically starts playing on the FireTV, Nice!The FireTV has everything you want for a media device but it lacks a simple App Store to browse, instead you have a catagories with a small subset to choose from, other than you have to know what you want to add and search for it via Voice or Text search feature. There is no reason to reinvent the wheel here AMAZON, just add an App Store, and a simple home-screen to put those apps on.The voice search feature works flawlessly, Hulu loads very fast and is the best I have seen on any device. Plex is great. Everything works great. it is an awesome device.Lack of Splashtop and Twonky Beam? I read a review on Splashtop's own website that said the FireTV would be packaged with Splashtop preloaded, I can't find it on amazon's website for the FireTV, where is it? Splashtop and a wireless keyboard and mouse connected via USB, if possible, would give a powerhouse user Remote Desktop Connection (RDC) capabilties to thier home PC while on the go, just grab the FireTV before a plane flight and have full access to your home PC for gaming and productivity. Honestly Twonky is not really that important because of the excellent phone/tablet to YouTube integration, mostly what people beam to ROKU is probably YouTube anyway, but it doesn't make sense to leave it off the list.Check out Splashtop's News page for reference to the article saying it is preloaded on FireTV.Remember that this is a first generation device, and for a first gen product it really is very good, best TV Media box on the market today.Fuax", "verified": true, "helpfulness": "1/1", "author": "fuax"}, {"rating": 5.0, "review": "The ease of talking to the remote and to search is fantastic. This is a goooooooooood toy!!!! And while I am typing this review, I had it in search mode on my TV and, to avoid burning idle image onto tv screen since the system was idle, it automatically started putting up \"scenic background pictures'... not just shrinking the screen and jumping around like other gadgets do. This thing is Amazing!! goodbye... TIME TO PLAY!!!!!!", "verified": true, "helpfulness": "3/4", "author": "Kevin"}, {"rating": 5.0, "review": "Packaging: \"A\" nice appearance and easy to use. Would be an A+ except I is shipped in typical Amazon amounts of excessive cardboard and plastic bubbles.Power: \"A+\" really does start playing the video you have selected within 1 second of selecting it. No spooling, loading or spinning circle to mock you. Much faster than Roku3, Netflix on PC or Amazon Instant Video on PC.Picture Quality: \"A+\" true HD quality video, even when loading video through other apps. ESPN app is slow to load, but that is clearly on the ESPN side as it is so much slower than the rest of the apps to load.Voice Recognition: Overall great.  So far, only once has it not recognized what we were looking for.  However, after enunciating more clearly, it found it.Complaints:For the first day, the time it took the FireTV to wake up (when you are attempting to use it for the first time after it has gone into sleep mode) was in excess of 1 minute.  However, over the past couple of days, we have experienced that less.The required software update took forever to download an install. I believe it was in excess of 10 minutes. Additionally, the device kept appearing to shut down, the lights would go off and the screen would switch to a \"no signal\" message.", "verified": true, "helpfulness": "1/1", "author": "Sally Last"}, {"rating": 5.0, "review": "At first skeptical, I was extremely impressed by the ease of setup and voice activated feature of the Fire.  Also, the remote is very comfortable to hold and the plastic used feels better on the skin.", "verified": true, "helpfulness": "2/3", "author": "Robyn Ronen \"Robyn R.\""}, {"rating": 4.0, "review": "Overall I'm pleased with the Fire TV. Its fast, easy to use and the video quality is excellent. I'm looking forward to getting more apps, especially HBO Go. The one big negative for me is the use of Bluetooth for controlling the Fire TV leaves me unable to control the box with my Harmony Remote. Since I have the Harmony Ultimate which supports Bluetooth I'm hoping that support will get added. I just wish that Amazon had taken the trouble to work with Logitech to get this supported from the beginning.", "verified": true, "helpfulness": "2/2", "author": "Chiefhoser"}, {"rating": 3.0, "review": "FireTV, for all of its streaming prowess, has one big downfall in my opinion. The interface is a jumbled mess that cannot be configured. I realize that Amazon's goal is to sell a yet another content delivery platform, but FireTV is so Amazon content focused that it falls flat. Navigating the home screen and numerous menus is a chore. Amazon may have \"Fixed\" this by adding voice search(this actually works quite well for Amazon content), but only for a select subset of available services and focused toward Amazon. I appreciate that Amazon does not want to support competing streaming services and home-based streaming any more than is required to sell a product, but when I need to remember the equivalent of the Konami Code to find something non-Amazon that I want, they have failed. Perhaps a future update will clean this mess up, but until then I'll stick with other products with cleaner interfaces.", "verified": true, "helpfulness": "3/5", "author": "46and2"}, {"rating": 4.0, "review": "I'll try not to be to redundant with all the other revues but I have extensive experience with digital media devices, content and services which I've been studying and enjoying for over a decade.  I was very impressed with how easy my Fire TV linked to my Kindle HDx and set itself up.  This review will be about the Fire TV but also the Kindle Fire HDx as well  as Prime (cloud services too) and how they all function together.My focus will be more on the Features and Benefits of the product and how it works within the group of digital services, content and devices.  Fire TV specifications and comparisons to all the competitive products are everywhere, I'll be paying more attention to ease of use, value, merchandising, etc...A great feature I haven't seen mentioned but I haven't read them all revues, is upon turning the Fire TV on it automatically turns on my Samsung 8100 TV and switches to the correct HDMI port.  This is a fabulous function and I suspect goes unnoticed.  It saves me the time of turning on my tv and switching ports and it does it seamlessly, I suspect it grabs the data from my Kindle HDx but would like to know if that is the case?Simple issue; the search button needs held down throughout the duration of using the mic which is counter intuitive to how cell phones and cars function.  Amazon either needs to make it clearer when the Search Screen pops up by putting in red (flashing possibly) anyone that just taps the Search button vs holding it.  The Mic should do more than Search and allow other voice commands ie: when filling out forms in APPs or online. I'm not saying this is the wrong way I'm simply saying it's counter intuitive, other than that it works extremely well within the Amamzon APP, I have not tested it amount other APPs.I assume the USB port is going to be used for a Cam for Skype and/or Mayday eventually.Put a small keypad on the game controller to make it more useful similar to the keypads on the Xbox controllers which work great.  I do not have a game controller as yet but will most likely buy one, hopefully after they've put a keypad on it or lowered the price.  As I have not tested the Game Controller I can only hope it includes a Search button as it would be idiotic if it didn't.I collect movies and have purchased them on every service available including ripping my DVDs for availability online and have approximately 1500 recorded on Microsoft's Media Center.  All total approximately 5k movies either in clouds, on other services or within my servers (both Linus and Windows).  I need the ability to access all these movies most importantly those that are on my servers within my Intranet.  Plex doesn't come close.  Using a Windows machine (with 30 plus TB's for movies and music) coupled with an Xbox solves everything except search and combining all services.  I am very interested in knowing if others would like to be able to access (seamlessly) their owned movies or music from any platform from a single device/player? ie: Media Center, VUDU, CinemaNow, xbox Video, iTunes, etc...?  Currently the best server/client software out there is PlayOn so Amazon please get this Fire/Kindle Ready.I have had a couple hours of tech support which was as much learning about the product as it was advising on merchandising to additionally functionalities.  I must say once I got to the Fire TV tech department they knew their product and were very polite which served me as well as the Mayday function my Kindle (priceless).Finally, at least for my first revue week, it would be great to have a single APP or minimally within My Account, allow gift cards for all services in one central location ie: HULU, Netflix, Yours, etc...  This goes for both the Fire TV and the Kindle, I should never have to leave the UI to do anything relating to anything on it (unless it's a ute security concern but even then you can add another level of security.Thanks for getting it mostly right on the first launch, a rare treat!Marc 4/9/14 AMI do not plan on posting more than weekly but this had to get out immediately.  I am also a Prime member and will soon be posting a review of it, in addition I spend quite a lot each month on digital content.  I just discovered an extremely annoying merchandising ploy in the Fire TV User Interface.  On every search they post all the prices for purchasing even if you have Prime, you'll need to click on \"More Ways to Watch\" and open another window to see it is available via your Prime membership.  This is simply disgusting merchandising, all searches and views should display Prime prominently instead of tricking a Prime member into purchasing a video they are already paying to watch.Marc 4/9/14 PM", "verified": true, "helpfulness": "1/3", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I'm not going to lie. I'm a huge amazon fan, and despite at one point being a mac lover and owning only i-devices, I have converted as Amazon has made improvement after improvement to their tablets.Well this thing, the Fire TV, is so amazing to begin with that there are no improvements necessary.  In fact, I'll be selling my Roku 3 this weekend because I don't need it anymore!Let's start with the apps/games.  Everything I've bought (or got for free!) from the amazon app store, that is compatible with the TV, is already in my library (I don't have to pay for them again!)That means I can share apps between my kindles and Fire TV without additional purchases.  Even apple doesn't do that!Second - the picture is crystal clear and I have not seen \"buffering....\" even once!  Super fast.The remote works and feels a lot like the xbox remote, so there is no re-learning how to use one.  The reactions are fast and on time!I really can't recommend this enough to anyone interested in a set-top box.  Seriously, people. Ditch the cable box and come on board!", "verified": true, "helpfulness": "3/5", "author": "MicheleLK \"Michele\""}, {"rating": 4.0, "review": "...It's snappy and gets the job done on most media fronts with flank speed...only gripe from me is lack of access to my favorite browser.  Now, you'd think amazon would make it easier to go to their store, eh?", "verified": true, "helpfulness": "0/5", "author": "Charlie Groh"}]