[{"rating": 5.0, "review": "Chromecast is a fun device to have. It's not a necessity, but it's at $35, it's worth buying to be able to watch YouTube videos and see webpages on your television.", "verified": true, "helpfulness": "0/0", "author": "Kilar"}, {"rating": 5.0, "review": "Excellent product, it is useful and easy to connect, just need more apps to use at home, but i really like it.", "verified": true, "helpfulness": "0/0", "author": "Omar Cabezas Mora"}, {"rating": 5.0, "review": "Chromecast works awesome! Perfect solution for the 'non tech savy' end user.  I use two of these in the house (one in living room and one in bedroom) and it works great for everything from youtube videos/music, to google play apps, to pandora. Love it!", "verified": true, "helpfulness": "0/0", "author": "Cody A."}, {"rating": 4.0, "review": "It does enough for my needs. Hope to see new apps supported by Chromecast, especially Google apps. Is it not strange that half of the manufacture's own apps are not supported.", "verified": true, "helpfulness": "0/0", "author": "ahboby"}, {"rating": 4.0, "review": "Great gadget, but there is still a lot of work to be completed. The speed streaming is not optimus per chrome.", "verified": true, "helpfulness": "0/0", "author": "Andres M."}, {"rating": 3.0, "review": "I am actually disappointed in this device. The quality of the picture and sound is quite low and a 2-3 second delay with broken sounds make it difficult to follow the subject specially when I try to listen to a lecture of a web based educational course.I am sorry to see this as I have read a lot of good ratings by the others. I was very hopeful.", "verified": true, "helpfulness": "0/0", "author": "siamak"}, {"rating": 3.0, "review": "Roku's streaming stick didn't work with my Comcast and CIsco router setup.  I wish it had.  I want a remote, not just a tablet or phone casting.  On to another product...", "verified": true, "helpfulness": "0/0", "author": "Fizz"}, {"rating": 5.0, "review": "Works exactly as advertised and easy to install. It's amazing that so much technology can be inside such a small box. Works with Windows Vista even though the directions say it might not.", "verified": true, "helpfulness": "0/0", "author": "billshoff \"No animal left behind; rescue one today.\""}, {"rating": 1.0, "review": "I BOUGHT THE GOOGLE CHROME FOR TWO REASONS.It mounted behind my wall mnt. Tv.and I could control it with my tablet. THE USB POWER CABLE SHOWED. MY TABLET IS A kindle HDX.I could not even set it up.I AM EQUALY UP SET WITH Amazon for selling a product that is not compatible with there device.", "verified": true, "helpfulness": "0/4", "author": "Dane LaGrow"}, {"rating": 4.0, "review": "The only reason I gave it 4 stars (instead of 5 stars) is the lack of support for Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "KAB199 \"Park199\""}]