[{"rating": 5.0, "review": "i can watch world cup through espn app.good job amazon!", "verified": true, "helpfulness": "0/0", "author": "roboticist"}, {"rating": 5.0, "review": "I love this device. Easy to setup and use. I haven't watched regular tv in 2 months. Being a Prime member just adds to owning this thing. The free tv series and movies are awesome. Love it and I recommend it to all my friends.", "verified": true, "helpfulness": "0/0", "author": "Matthew Howell"}, {"rating": 2.0, "review": "Based on price, functionality, and the number of channels, the Amazon Fire TV was found to be far behind the Roku.", "verified": true, "helpfulness": "1/1", "author": "DGUyMD"}, {"rating": 5.0, "review": "Perfect for any room in the house. Absolutely love the real time voice commands. Set up is easy,  allows you to enjoy all movies and shows with the touch of a button or sound of your voice.", "verified": true, "helpfulness": "0/0", "author": "matt parker"}, {"rating": 4.0, "review": "I love everything about amazon fire tv but the remote control. I find it to small and it blends in with my furniture. I must lose it a hundred times a day. I resorted to putting duck tape on it to find it.", "verified": true, "helpfulness": "0/0", "author": "Kristie Feldt"}, {"rating": 1.0, "review": "1 star: Mostly because it sat on my tv stand and was never used. If I wasn't already into Apple for content and apps and hardware... this may have been a MUCH better deal for me.", "verified": true, "helpfulness": "3/3", "author": "evaledude"}, {"rating": 5.0, "review": "Great streamer  working very fast  , and the GUI is very easy to use", "verified": true, "helpfulness": "0/0", "author": "Yaron Samson"}, {"rating": 5.0, "review": "I'll have to steal McD's line \"I'm lovin' it\". This is a must have. We have two of these in our house.", "verified": true, "helpfulness": "0/0", "author": "Dr. Wright"}, {"rating": 4.0, "review": "Love it!  It's easy to use with easy set up.  It would be more helpful if there was a section for Prime shows only.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I thought i would realy enjoy it, but i found it disconects alot, restart and the arabic channels i watch gone one after another. When it comes to movies, there are alot of movies, very new and all types but they also stop at some point whilst im watching, sometime more than once and i have to restart the device and then i loose interest in the movie itself! I myself would not recommend it to anybody. Btw my internet is realy fast speed 50 from RCN", "verified": true, "helpfulness": "9/9", "author": "MR W F NAJI"}]