[{"rating": 5.0, "review": "This is an amazing product. I can now cast You Tube videos from my smartphone to my TV.", "verified": true, "helpfulness": "0/0", "author": "Joe Lestingi"}, {"rating": 5.0, "review": "It's a Chromecast.  Not much more needs to be said.  Great device.  Works really well with our Nexus 7.", "verified": true, "helpfulness": "0/0", "author": "Justin McCullough"}, {"rating": 5.0, "review": "I use this mainly to stream my workout videos onto the living room TV, works great!  Also love to use it for Pandora.  Such a great concept.  Easy to install and setup, and the price is awesome!", "verified": true, "helpfulness": "0/0", "author": "DDillon"}, {"rating": 5.0, "review": "World as advertised... Simple", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Love our Chromecast. I even got one for my mom! We are mainly Hulu and Netflix watchers, so this is perfect. I also like the option to stream music through it, such as Pandora and Songza.", "verified": true, "helpfulness": "0/0", "author": "Mallo"}, {"rating": 3.0, "review": "Not as useful as Roku. Gave this to a family member. They are happy with it.", "verified": true, "helpfulness": "0/0", "author": "JoJoJava"}, {"rating": 4.0, "review": "This is great if you want to view content that usually isn't included on other sticks/media devices such as Netflix or Amazon Prime.  If you are just needing a streaming stick for Netflix, Amazon, Hulu, etc., go with the Roku stick or media streaming box or maybe the new Amazon stick but I have never used it so I can't comment on it.  I have both the Chromecast and the Roku 3400M streaming stick.  The Roku does a better job with the app streaming and it's more user friendly.  Where the Chromecast comes in handy is viewing content from pretty much any device on the Wifi network.  Example, I played a DC fighting game using my phone streaming to the tv.  Other good uses would be displaying photos/videos on other peoples phone for everyone to view.  I am really glad I purchased the product but I think it should be marketed in a slightly different but similar category as the streaming sticks offered by Amazon and Roku to highlight the strengths of the Chromecast that other sticks simply do not have.Update: 1/15/2015I just uploaded a video of me streaming Borderlands The Pre-Sequel from my laptop to the Chromecast in my bedroom.  You have to keep it in windowed mode or it won't work and it does suffer from lag.  It's good if you want to stream it for viewing but will not work for playing the game on the tv due to lag.", "verified": true, "helpfulness": "0/0", "author": "StickyHoneyBuns"}, {"rating": 5.0, "review": "I love my Chromecast. I've purchased several now. At this price, no reason not to have one on each TV. My mother had surgery earlier this year and was going to have a lot of bedrest so I also picked up one for her so she could stream Hulu and Netflix while recovering. My biggest issue with it was that I couldn't stream downloads from my desktop, but they've now remedied that issue and I can now cast any file I've downloaded. Great investment! At this price, it really is a no-brainer.", "verified": true, "helpfulness": "0/0", "author": "Pharadei"}, {"rating": 5.0, "review": "I NOW have a smart tv for close to nothing. great service as well.", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "No issues at all. Perfect.", "verified": true, "helpfulness": "0/0", "author": "Baranidharan"}]