[{"rating": 3.0, "review": "I love the specs, and the look and feel of the GUI but I can not love the device itself until the audio pass through issue is resolved. I use Plex to organize and play my media and without 5.1/7.1 sound, it is only half the experience. It is clearly advertised as having that capability but Amazon has not delivered.  Once that is resolved I have to withhold my five star rating.", "verified": true, "helpfulness": "0/1", "author": "Bryant Carter"}, {"rating": 5.0, "review": "I've never owned an Apple TV, but I've owned a few Rokus and a Chromecast and I've enjoyed all of them for different strengths. However, the Amazon Fire TV appears to have a lot more potential than those others (at least for now). It runs smoothly, videos play nice and crisp even though my internet isn't the best, and it plays TONS of games! While the Roku had a few, they weren't that great and I don't remember any being free that were fun at all.My only complaint is that I maxed the storage in a couple days and had to remove some of the larger games, but it's something I've had to work around on devices for years. Also, Web browser support? That would be nice, and I'm hopeful - this device hasn't been out long and I'm sure that Amazon is busy at work improving it just like they do all their other gadgets.`Overall, very solid device with a nice remote and tons of things to do!", "verified": true, "helpfulness": "0/0", "author": "Aaron T Muntean"}, {"rating": 5.0, "review": "The Amazon Fire TV is very responsive.  Amazon video's play as fast as changing a channel on the TV most of the times.  I love that Amazon doesn't lock the device down so you can side load some other basic apps.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Prentice"}, {"rating": 3.0, "review": "I really have a love and ...not so much relationship with the Fire TV.  I purchased hoping to eventually have one device cover what I would call the Superfecta of Apps.  Those are Prime Streaming, Netflix, HBO Go and Plex.  Prime and Netflix work great!  HBO Go is on it's way, so I can't comment quite yet.  Plex is a complete disappointment as I have my Fire TV connected to my home theater and it doesn't support 5.1 audio from MKV files.  I know there is an XBMC workaround, but that's a pain.  If I wanted a workaround, I'll continue using my Apple TV with Plexconnect.  The remote's feel and voice search are great and in theory the bluetooth is better than IR.  In practice, most of the time, I just want to use my Harmony remote to control all of my devices...and again you can only get this to work using a workaround. I'm going to try mapping the Harmony to a MCE USB receiver.  The interface is nice, though nothing amazing, but the speed is lickety split.  I'm sure this will evolve with updates and new models.  I did take advantage of the $19 Fire TV Stick offer for Prime Members, so I like my Fire TV enough to try it out.  Fingers crossed for improvements along the way.", "verified": true, "helpfulness": "0/0", "author": "M. Walker"}, {"rating": 5.0, "review": "Cut the cord w/satellite service and are saving a bundle!  This works great!  Very pleased.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I am comparing this to Roku. I like the voice search option but, it is only good for amazon tv. So, if you are in another app expect that if you use the voice search it will take you out of the current app and place you into amazon.Lastly, I am not a big fan of the remote. - Roku has headset connection and better layout", "verified": true, "helpfulness": "0/0", "author": "Nicole K Newman \"Camomile7\""}, {"rating": 5.0, "review": "Easy to install, took some getting use to using the  menu, but love it! We live out in the country, renting a DVD was always a problem, now that problem in totally over.", "verified": true, "helpfulness": "0/0", "author": "Miz Blue \"I am a retired part owner of a Financial Services and Health Insurance Agency.  Recently sold our home in Dallas and moved to East Texas Country.\""}, {"rating": 5.0, "review": "I LOVE my Amazon Fire TV. This is my 3rd streaming ONLY device, but this is the first I will both keep and use. Let me first say, I am a self-described technology junkie. New tech REALLY excites me and I love to have a new toy, as long as that toy is not obscenely over-priced. I have all the current game systems and primarily use those for streaming. Here's the thing, THIS IS MUCH FASTER at streaming content than either of my New generation consoles (PS4, Xbox One) and EXTREMELY destroys my PS3 in the streaming department. I love the voice recognition to quickly search for a movie, music, or specific artist or actor. It seems to work even better than my Xbox One w/ Kinect (Though that is my current favorite gadget). Truth is, I got this hoping it would help with my buffering issue that my PS3 gave me in my bedroom. It has, it also runs silently and is ready to use in about 2 seconds. I cannot recommend this enough. It is so fast, and if you use Amazon as your primary media company (buying music, buying movies, paying for Prime) then it is an absolute NO-BRAINER!!!!!", "verified": true, "helpfulness": "0/0", "author": "Khalid Mundwiller \"K Diddy\""}, {"rating": 5.0, "review": "Keeps kids entertained. I'm not a fan of the rising price of cable. Once we added the Fire TV, we were able to cut the cable bill some by getting rid of many of the channels we weren't watching. The options on Fire TV made up for it in more ways than one. With so many re-runs and networks showing the same shows over and over again, this was a great option to watch the shows you want when you want to.", "verified": true, "helpfulness": "0/0", "author": "Blaze"}, {"rating": 5.0, "review": "I never used the chrome cast again. The firetv is great for family entertaining and you don't have to keep synchronizing the comm with the cellphone. We use the game controller for everything, find apps, see movies, games, etc. We try different tv apps, netflix, and it is great having in the very same place the prime amazon video and even the amazon market to purchase movies and see them right away, we don't like waiting two days for a dvd. We can leave the kids alone for a while safely with the freetime, and they love the video games that we have found so far.  When you need to purchase, it always asks for the password, and every time any action that might be not good for children, it keeps asking for the password, which the kids don't like but we do and really makes the parents feel safe. For the kids, again, we just activate the free time and they are safe and without passwords.", "verified": true, "helpfulness": "1/1", "author": "dan"}]