[{"rating": 5.0, "review": "For me & my Netflix subscription, this little piece of technology has been being used almost 24/7 since I bought it as a Christmas present for myself. I absolutely love this gadget! I even bought one for my parents to use. Dad usually watches what he wants, so now Mom gets to watch what she wants on their other large screen. She loves it as much as I do!!", "verified": true, "helpfulness": "0/0", "author": "Munch64"}, {"rating": 4.0, "review": "Its OK but it does not have YUPPTV and that was one of the reasons why I bought Chromecast. Otherwise, it's easy to stream Youtube from your tablet or phone onto your TV.Paid $35 but this routinely sells for $20 or so when you look for coupons online.", "verified": true, "helpfulness": "0/0", "author": "Tampaite"}, {"rating": 5.0, "review": "Excelent Product!!!", "verified": false, "helpfulness": "0/0", "author": "Sandra Blanco"}, {"rating": 5.0, "review": "Works great for watching movies and Pandora! Great product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Javi \"atenaexclamation\""}, {"rating": 3.0, "review": "As expected....good quality.", "verified": true, "helpfulness": "0/0", "author": "Mike Wagner"}, {"rating": 4.0, "review": "It only took me 10 minutes to set up the device and mobile app. Casting apps is quick! I mainly use Crunchyroll and Netflix, but I also found a great app called Videostream that lets you watch videos from your laptop on the TV. It is exclusive to the Chromecast, and I personally like it better than the Plex channel. It can support all my MKV videos with subtitles. Another great feature of this device is that it's easy to cast your google chrome browser to the TV. Overall, I prefer this device over the Roku which I used for about two years. It's faster and more simple to use. The streaming quality is great. No problems so far!I also love the default chromecast display on the TV. It shows different pictures in HD (mostly nature) and has the time displayed on the bottom right corner.Drawbacks: Chromecast doesn't officially support Amazon Prime Instant Videos. You have to play the video on your google chrome browser and cast the browser to your TV screen (with adobe flash selected in settings). Roku's Amazon channel is far superior and plays videos in better quality.Also, I can't cast my phone or tablet screen to the TV. The phone is too small, and my tablet just freezes up. Only the computer works.Fortunately I'm hardly ever in a situation where I need to cast my tablet's screen or use Amazon Prime (Google Playstore is a great alternative for buying and renting movies and TV shows).For the price, this is a steal!", "verified": true, "helpfulness": "0/0", "author": "Mimi Taylor"}, {"rating": 1.0, "review": "didn't work with my DirectTV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As advertised", "verified": true, "helpfulness": "0/0", "author": "alan"}, {"rating": 5.0, "review": "This thing speaks for itself. For the price of it you can't get better value. Works as expected and is seamless to install and setup. Using the built in you tube app on my TV was rough. Having this now makes all the different. I can select you tube videos from my phone and send it to the chrome cast and videos start immediately. Love it!", "verified": true, "helpfulness": "0/0", "author": "Philip Qumsieh"}]