[{"rating": 1.0, "review": "I am running an approved router, Windows 8, did everything tech said to set this thing up and it still does not connect to my network. Every device I own connects easily. Even tried another approved router to no avail. I could spend hours every night trying to get tech help on the line so I'm past my window of opportunity to return it. I would NOT recommend this gadget there are better ways to connect your devices to your tv.", "verified": true, "helpfulness": "0/0", "author": "SoCal"}, {"rating": 4.0, "review": "It's great, can use to see videos and movies in my LCD TV.", "verified": true, "helpfulness": "0/0", "author": "Edgar Mancipe"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "JCB"}, {"rating": 3.0, "review": "Screen mirroring doesn't work well for playing movies, but the supported apps work great", "verified": true, "helpfulness": "0/0", "author": "Altier"}, {"rating": 4.0, "review": "easy to use and easy to install but chrome needs to expand their streaming compatibility with more apps! works GREAT with hulu+! i can stream to chromecast from my ipad and my note3 and my laptop!", "verified": true, "helpfulness": "0/0", "author": "Prudence"}, {"rating": 3.0, "review": "It works but has limitations.  We could not get a signal on the TV (in the rec room), so it's in the bedroom where it will get minimal use.", "verified": true, "helpfulness": "0/0", "author": "Tommy"}, {"rating": 1.0, "review": "Chromecast is great for streaming videos from an app, BUT I bought the Chromecast to stream videos from my Chrome browser on my laptop. This only works if you are watching videos from YouTube. If you stream videos from your laptop on any other website, there's an UNBEARABLE LAGGGGG. This is annoying because the product description clearly states that it supports laptop streaming... Google's definition of streaming is apparently: stop motion picture x 1,000 = UNBEARABLEI'll be sending it back for a refund.", "verified": true, "helpfulness": "1/1", "author": "Idifie"}, {"rating": 3.0, "review": "When i try it for first time , it works really good. After a week it started to lost wifi.", "verified": true, "helpfulness": "0/1", "author": "Cuc truong"}, {"rating": 5.0, "review": "Bought one of these at launch based off of price alone and didn't use it at first because I have a smart TV and a HTPC.  Since plex and several other apps began supporting chromecast, I use it almost daily.Streaming quality is excellent.  Can't wait for VLC to support it.", "verified": true, "helpfulness": "0/0", "author": "Mr McC \"Andrew M.\""}, {"rating": 5.0, "review": "So much more affordable than some other options out there. Perfect for netflix and HBO Go. Wish I could watch Amazon Prime through it.", "verified": true, "helpfulness": "0/0", "author": "mk"}]