[{"rating": 5.0, "review": "I have one at home and one in the office, and we're buying more for the office. When giving presentations, anyone can take over and project their screen without hassle. Attaching it to the ceiling mounted projector works well too -- no more tedious plugging and unplugging.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "An amazing device and for only $35.  I know we will get a lot of pleasure watching movies, etc. and bringing them into our home.  I highly recommend Google Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 1.0, "review": "It is one of the useless devices. Do not buy it unless one is clear why does he needs it.", "verified": true, "helpfulness": "0/4", "author": "Manoj Kumar Srivastava"}, {"rating": 4.0, "review": "Nice and it works well but it can use more apps, Some times using the computer it can hang up some so that can use a little work,", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just plug it and ready to go.It does what it's supposed to do without any hassle. Send any movies bought through the play store or any videos and control them from your phone/tablet.", "verified": true, "helpfulness": "0/0", "author": "Diego Perez"}, {"rating": 3.0, "review": "Streaming is not as expected. If you are looking for a wireless hdmi device, this is NOT the product you are looking for.As well, if you are looking for an android set-top-box, not your device either.It needs a power supply (usb) and it is easy to configure. For the price, it is a bargain, but don't expect great things. The screen definition is not the best you can get. 1080p is a mirage and it DOESN'T work with Android devices (WTF!). You still need to operate it from a Win/Mac pc.Said the above, looking at youtube or any other streaming website, is acceptable. When a streaming starts, looks like from your main pc you can still do other things and let the TV keep playing. However, I would rather buy an HDMI wireless device and get benefit of using any other OS and device. From a mobile it is impossible to be used as you don't have a support for Chrome.Google needs to start having internal discussions and collaborations between its teams. How this device is not talking with Chrome for Android and Android itself, is a pity and a poor project deliverty execution.", "verified": true, "helpfulness": "0/0", "author": "G. E. Fiorentini \"Edoardo\""}, {"rating": 4.0, "review": "Why would you need a $35 Chromecast when the TV or Bluray player does the same thing?  Quite simply these so-called smart-TVs or smart devices suck.  They are like wireless phone carriers and smartphone manufacturers putting their own bloatware, adware, and then never bothering them to update their software after their products' release.  With a Chromecast, the compatible app on your iOS or Android device will always be updated and will have a much better interface and more features than anything a TV or \"smart-device\" manufacturer will release, maybe excepting Apple TV and the Roku (which I have not tried personally).Since I own both an iPad and an Android phone, I can attest that setting up the Chromecast is a little easier on the Android on its respective Chromecast app, but certainly not difficult on the iPad, which requires disconnecting from your WiFi network to connect to the Chromecast.  Also, you can use an Android device to stream music from your Google Play Music cloud storage, but not from your device unfortunately.  I did have an issue of not having any songs playing since they were both on my phone and on the cloud, but it had been resolved recently.Some gripes I have is that the included HDMI extension cable is not flexible enough to hide behind the side of the TV.  Also, Chromecasting from a Chrome browser is a bit of a miss.  While online video playback is okay, there is a bit of a delay when scrolling through web pages.  Chromecasting from a Chrome browser utilizes a lot of CPU power on my 2011 MacBook Air, and revs up my cooling fans.  So if you wan't a quiet web streaming experience, I'd probably recommend a faster computer, an Apple TV + Mac / iOS, a compatible Chromebook, or a very quiet HTPC.", "verified": true, "helpfulness": "1/1", "author": "Brian Guinitaran"}, {"rating": 1.0, "review": "I am giving this a bad review because my computer stopped connecting to the internet after installing the app.  If anyone knows why this happened please comment.  I would love to know your thoughts.I plugged this in and installed the chromecast app and started to watch a movie from the internet and it stopped working after 3 seconds as the connection dropped.  After trying everything I could think of, I decided it wasn't for me and removed the device.  My computer still wouldn't connect to the internet.Here's the strange thing.  I could connect to some sites like Facebook but only through searching through Google first and connecting to the link from the search results.  I tried restarting my computer, my modem, my router, uninstalling chromecast, reinstallinlg, uninstalling again, restarting, etc.  I even asked questions on online forums to get help and was told that this was a noted issue with no known resolution.  Even connecting the modem right to my laptop didn't work.I called my ISP and they told me I needed to restore my computer to a date before the chromecast app was installed.  When I went to try it, there was only one restore point on my computer.  The day I installed chromecast which was a week prior.  This is strange because my computer creates restore points every day.  Hmmmm.  Makes you think.I ended up having to restore my computer to factory settings which was a huge pain and waste of time.  I'm sure this works great for a lot of people but I wasn't the lucky one.  I sold it on Craigslist for $25.  Thanks for nothing Google.", "verified": true, "helpfulness": "0/2", "author": "ktg13"}, {"rating": 2.0, "review": "As soon as I plugged it in I realized I just paid $40 for something my laptop already does but with only 2 options. Netflix or YouTube. You can't even hack it anymore.", "verified": true, "helpfulness": "0/2", "author": "Doogie"}, {"rating": 5.0, "review": "i orderd this for my 24in led tv and love it i though i was going to be wait for a good month but i orderd i placed the first order on 9/1/13 then i cancelled it on 9/11/13 and reordered it on 9/11/13 after i saw it was say shipping in 10 to 13 days then updated to 7 to 10 days i had to wait for about a week and a day to get it shipped out tuesday 9/17/13 and had thuresday 9/19/13 hulu plus just got added if pandora and amazon prime instant viedo and hbo go i will be fine with i would like if they will support belkin@tv app because going to be ordering that soon once we replace the tv in my man cave with a big flat screen tv", "verified": true, "helpfulness": "0/1", "author": "William"}]