[{"rating": 5.0, "review": "this product is great. came new in package and cast's shows from our computer great. very happy with it", "verified": true, "helpfulness": "0/1", "author": "Tarrah M."}, {"rating": 1.0, "review": "No instructions about what to do with it.  JUST THE DEVICE IN A BOX.  nOT ALL OF US WERE BORN KNOWING EVERYTHING ABOUT EVERY THING!  I GOT AN BACHLORS DEGREE IN LITERATURE AND HISTORY BUT THEY NEVER COVERED HOW A TV WORKS.  wHAT AM I SUPPOSED TO DO?  oristorush@bellsouth.net,709 BLACK WOLF RUNSpartanburg. SC 29306REV. DR. JIM RUSH", "verified": true, "helpfulness": "0/0", "author": "James Rush"}, {"rating": 5.0, "review": "Works awesome! Except if you have poor wifi. My wifi stinks so it loses connection sometimes.", "verified": true, "helpfulness": "0/0", "author": "Brett Bowser"}, {"rating": 4.0, "review": "Wished it worked better with Google Music", "verified": true, "helpfulness": "0/0", "author": "Curtis Carey"}, {"rating": 4.0, "review": "Work great", "verified": true, "helpfulness": "0/0", "author": "Alise L Orlando-Aly \"Alise\""}, {"rating": 5.0, "review": "I love this gem! Casting from my phone or laptop makes it so simple! I wish more of my apps could cast, but hopefully more will be added in the future.", "verified": true, "helpfulness": "0/0", "author": "Patricia A Gardner"}, {"rating": 3.0, "review": "I wish we had bought another roku player. You have to have an app for everything you want to use on your phone or tablet. It freezes up a lot when using my iPhone, not sure why. It works better with the tablet. It isn't horrible, but it isn't great either.", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "Very convenient and easy to use and set up!", "verified": true, "helpfulness": "0/0", "author": "Nikki"}, {"rating": 5.0, "review": "I use with my tv Sony and works excellent.", "verified": true, "helpfulness": "0/0", "author": "Agus"}, {"rating": 5.0, "review": "exactly what I was hoping for and more.  can cast anything (shows, sporting events, movies, etc.) from my iPad, iPhone, or any computer device to my big screen tv.  works like a charm.", "verified": true, "helpfulness": "0/0", "author": "SidMac"}]