[{"rating": 3.0, "review": "Well.. it's there. It was $35 (but I got 3 free months of Netflix, so it was pretty cheap) but I hardly ever use it. I am a gadget guy, and had to have this of course.. but I don't really see myself using it much. Maybe one day, but now it sits in the back of the tv.. and that's about it.", "verified": true, "helpfulness": "0/8", "author": "Robb Fladry \"robb_fladry\""}, {"rating": 5.0, "review": "This is awesome! Much cheaper and better than a roku. You can literally stream anything on the internet! Highly recommend.", "verified": true, "helpfulness": "5/6", "author": "Lkjolsing"}, {"rating": 5.0, "review": "Works as advertised. Great for streaming Netflix videos. I just wish I could use it to watch the movies that are on my computer on the television with it.", "verified": true, "helpfulness": "0/0", "author": "Kevin Wheeler"}, {"rating": 5.0, "review": "This is not entirely plug and play, but very close. Use your computer to guide you through the website instructions while connecting through your smart device.  Currently streaming Pandora through my HDMI equipped Stereo and the sound quality is great.  Wife is gone so I am testing, only a few broken knickknacks shaken off the shelf.  Maybe later Ill settle down and watch something on Netflix, maybe.", "verified": true, "helpfulness": "1/1", "author": "Michelle Gable"}, {"rating": 4.0, "review": "It's a great little device that makes watching YouTube videos and Netflix incredibly easy. With the upcoming release of the development kit, hopefully we'll get some more apps to play around with!", "verified": true, "helpfulness": "0/0", "author": "Jaredfrommars"}, {"rating": 1.0, "review": "This device did not work! Maybe I just got a bad device. The following features are absolutely broken in my device.  - Casting youtube videos from iPad or iPhone  - Casting Netflix videos from iPad  - Casting Chrome tab from PCI hope all these scenarios are fixed in the next version of the device.", "verified": true, "helpfulness": "1/2", "author": "sharan"}, {"rating": 3.0, "review": "A little bit of false advertising on Google's part with regards to streaming from a smartphone.  The commercials make it look like you can stream anything from an iPhone but this is not the case.  The iPhone app only allows streaming of, wait for it, Netflix and YouTube.  Yay!  Yet another way to stream content to your TV from those two apps, just in case you don't have a Roku, Apple TV, Smart TV, Smart DVD player, or any one of the huge number of devices which already exist for these two services.I have an iMac and this does allow streaming of content from the Chrome browser.  For example, I'm able to stream foreign television which is kind of cool and I can watch Monday Night Football by streaming.I'm disappointed that I have to use an old fashioned computer to stream from a browser but hopefully Google will add the ability to stream from an iPhone or Android browser in the near future.", "verified": false, "helpfulness": "1/2", "author": "Neil bey"}, {"rating": 4.0, "review": "Installs easily,  works well love using my tablet or phone as my remote. Use HBO to go,  hulu and Netflix with no problems.  Streams videos from my desk top chrome browser no problem.  Have yet to stream a movie from the play store, but I imagine that'll work great too.Minus 1 star due to lack of apps,  but I understand that Google is releasing development tools now, so that should change soon.", "verified": true, "helpfulness": "1/1", "author": "Scoo"}, {"rating": 2.0, "review": "Not as flexible as you might think and they have disabled some of the original ways to use it at home.", "verified": true, "helpfulness": "1/2", "author": "Patrick"}, {"rating": 5.0, "review": "It is a good buy. I really came to know the use of this device once it arrived in mail. It is good gadget to have in everyone's house.", "verified": true, "helpfulness": "0/0", "author": "Alok Kumar"}]