[{"rating": 5.0, "review": "We decided to reduce our satellite TV package, basically keeping it for local news, as we watched very few channels of what was offered. We felt we were being forced to pay to subsidize channels we never watched to keep the channels we liked; the package included many sports channels and reality shows that were never viewed. The cost of the Fire TV set up was less expensive than a month's cost for the satellite package we'd had. We like the broad selection of quality shows offered on Fire TV. We have also rented some movies; the price and availability for them was very reasonable, and the payment and delivery of them was easy. I have yet to figure out the voice activated remote, but I'm a bit of a Luddite, so I think that has more to do with me than the remote. The Fire TV was an affordable purchase for us fits our viewing habits.", "verified": true, "helpfulness": "0/0", "author": "DD McC"}, {"rating": 4.0, "review": "Happy with my purchase", "verified": true, "helpfulness": "0/0", "author": "IceQwn8"}, {"rating": 5.0, "review": "Love our Amazon tv! Bye be cable!", "verified": true, "helpfulness": "0/0", "author": "Geoff Giotas"}, {"rating": 1.0, "review": "Even after having Amazon replace it and installing 2 system updates Netflix sound cuts out and the FireTV won't play any sound until reboot. Other apps work fine. I don't care who's fault it is, FireTV has much decreased value and I still need to use my old Roku because of this.", "verified": true, "helpfulness": "2/3", "author": "Seth M. Baker"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "TH"}, {"rating": 4.0, "review": "very good but i can't get HBO NOW ON IT", "verified": true, "helpfulness": "0/0", "author": "Joseph Cecilio"}, {"rating": 3.0, "review": "First... The player is great... But, the remote is working very intermittently. We have only had it a week and I think I'm going to need a new remote soon.Second... If \"grandma\" was given this as a tech gift ... She wouldn't be able to use it out if the box since it doesn't come with an HDMI cable. Not the end of the world for most family's but at least put a short HDMI cable in the box amazon.", "verified": true, "helpfulness": "0/0", "author": "justin merritt"}, {"rating": 5.0, "review": "I believe It's a good product but it would not work with our Internet provider AT&T; because of the slow Internet speed. AT&T; will not upgrade the old system in our area", "verified": true, "helpfulness": "0/0", "author": "R Ryan"}, {"rating": 4.0, "review": "Works great and downloads Apps very fast. Every movie and T.V. program that I have watched with it have streamed really well.It only has One drawback that I have found so far: It doesn't have a way to Turn It Off... I have to unplug it in order to keep the Fire TV from constantly being on (and therefore using bandwidth).", "verified": true, "helpfulness": "0/0", "author": "Jimmy H."}, {"rating": 5.0, "review": "its better than cable", "verified": true, "helpfulness": "0/0", "author": "Russell Neunsinger"}]