[{"rating": 5.0, "review": "I love the ease of use.  With all of the new apps that can be used with it now,  it is giving Roku a run for its money.  Now if we can just get Amazon Prime Video to work on it....", "verified": true, "helpfulness": "1/1", "author": "Dante Sovereign"}, {"rating": 5.0, "review": "Love our Chromecast and had to order another one. Cut your cables! Suck it Time Warner.", "verified": true, "helpfulness": "1/1", "author": "Leighton"}, {"rating": 5.0, "review": "Great service!! Great Experience", "verified": false, "helpfulness": "0/0", "author": "daniel ramos"}, {"rating": 5.0, "review": "What a deal!!!", "verified": true, "helpfulness": "0/0", "author": "Livinnsc"}, {"rating": 4.0, "review": "This is a great stream/caster, using my Samsung GALAXY S5 cell, especially if you're totally tired of cable contracts and deals only with bundling which usually end after 1-year and skyrocketing cable bills.  THANKS to the Google Chromecast streamer which I use with (Showbox) to watch movies or tv shows, NO MORE CONTRACTS, YAY!!!  It seems to cast well on any larger sized screen, our largest being 84 inches.HOWEVER, I only give it 4-stars because each device will need it's own & they don't tell you it only works with (allcast= which costs $4.99/monthly in my area).Being the electronic brains-WIFE of our castle, I initially I thought I didn't have the Chromecast setup, correctly connected.  I had to search you-tube to find out about this - allcast, which after purchasing enabled me to stream/cast and catch up on everything I haven't seen on tv or at the movies.  SURE EVERYTHING may not be available right away with what I downloaded and use - Showbox, but with all that I've missed and almost daily updates, I'm not missing much at all.  So don't worry ladies if you don't have that electronically skilled nor informed husband or (male) species around, the Chromecast is simple enough to connect yourself.  Just make sure you have a television with HDMI capability/connection and an electrical outlet for better streaming/casting.I definitely recommend purchasing; you will need one for each TV or device you plan to stream/cast on unless you plan on going through the set up each and every time, plugging it into each different device.  I'm not sure if you need to purchase allcast for each item.  So far we've only purchased the Chromecast for one tv which is fine for our almost, empty nest.  An Amazon Prime  membership enables us to view movies and shows as well on the PC's in the house.  So for now, only one more Chromecast will be purchased for viewing on the den tv ......HAPPY STREAM/CASTING!!!!!!", "verified": true, "helpfulness": "1/1", "author": "DaWizSista"}, {"rating": 5.0, "review": "Excelent.", "verified": true, "helpfulness": "0/0", "author": "Assuero Braz"}, {"rating": 2.0, "review": "The work was fine, but it broke within 1 year and 2 months.", "verified": true, "helpfulness": "0/0", "author": "Ted"}, {"rating": 5.0, "review": "Wish was a audio solution....come on Google an easy add here..... ok Google (wait my smartwatch just woke up ... if your TV has audio out - mine has digital optic out - it streams audio just fine. You have to have your TV on but I quite often use music stations on my cable TV. Hooked into the back of my audio reciever I now can stream audio throughout my house and my phone is now my remote. Now 5 stars! Much easier to set up than Rocki which is supposed to do the same thing but is just so painful to set up.", "verified": false, "helpfulness": "1/1", "author": "P. Nicholson"}, {"rating": 1.0, "review": "It kept dropping off the network and I couldn't reconnect to it because it would not show up to cast. Did a factory reset on it like 3 times and would still do this. I ended up returning it for a refund. Would not recommend it to anyone especially college students living in residence halls.", "verified": true, "helpfulness": "1/1", "author": "Sonia Moreno"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Ender Salas \"Dreck\""}]