[{"rating": 2.0, "review": "What can I say? The search button doesn't work with Netflix and finding \"free\" content on prime is hard because it's interspersed with for-pay-only content.", "verified": true, "helpfulness": "2/4", "author": "James Blackwell"}, {"rating": 5.0, "review": "I love it!!! I don't need Netflix anymore. The fire TV is great at streaming everything. I don't need expensive cable anymore either!!!", "verified": true, "helpfulness": "0/0", "author": "The Bossman"}, {"rating": 1.0, "review": "I've had this little thing for a month tomorrow.  Finally yesterday, we got it to work.  First of all it came without a remote control, they had to send me one.  I thought OMG, I have to buy the remote...but no, their mistake...I have two Kindle's and love them.  I have had two Roku's and loved them, burnt those bad boys ups...I can't sleep like a normal person, so my TV is on 24/7...anyway my husband found an adapter for the HDMI cable, our cable company used the one on our TV's.  Last night and today I have played with the TV Fire, and mainly you have to pay for the movie or I've can watch it on regular TV...I thought it said that I got Netflix for buying this little box...but no, it's just a trail offer...if it had of been hooked up last week, they would have it back in their place and I would have my $113.00 in my pocket...and might have my prime in my pocked...this is not what I payed for.  Nah, I would have kept my prime and got a new Roku.  So Amazon you sucked me in this time...but not next time...I was going on the Kindle name...Hey ya'll we don't even have a warranty!", "verified": true, "helpfulness": "1/12", "author": "Vickie Nelson"}, {"rating": 3.0, "review": "My first review of FIRE TV blasted the audio search feature. Now it is working perfectly. Not sure how that happened. The simplicity of the remote and the audio search function sets a new standard in the industry. It is truly fantastic. However, nearly all the shows and movies that I checked out I can access via Netflix for FREE. With FIRE TV, it seems like everything is $2.99. I need to spend more time researching this, but my first reaction is disappointment, as I was hoping to replace Netflix, but that ain't happening soon. It may be the most user-friendly system in the world, but if rentals are priced ridiculously high, what good is it. Competitive technology should soon be available to interface with all third party streaming providers. C'mon AMAZON, get your pricing in line like you do with the rest of your business. We pay to be PRIME Members, we pay $100 for your hardware, just be competitive with the rental costs, or I will need to take a pass. Don't let the FIRE go out on this one.", "verified": true, "helpfulness": "1/8", "author": "James Watts"}, {"rating": 3.0, "review": "Disappointed that MLB TV is not an app on Amazon Fire TV.  I have used Roku for years because I live in the middle of Wisconsin and cannot get other teams than the Brewers on Dish TV.When will MLB TV be an app available for Fire?  If this will not change soon, I'll be returning Fire and continue to use Roku.", "verified": true, "helpfulness": "1/3", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Let me say I am a bit of an Amazon junkie-- I shop on Amazon, have a kindle, use the cloud for my music and I am a Prime Member. Each and every one of my Amazon experiences I have felt really good about...but I returned this one.The truth be told...it is just not a Roku. Even compared to our now slow and clunky Roku 2 it just does not compare in user friendly capabilities. The real issue is the interface. While better than some that I have seen on DVD's or as part of a smart tv,  I have seen the real let down was in Amazon Prime's own interface which does not have an easy way to just search at random by category the huge selection--just forces you into tight options of categories. It also does not tell you what is included in prime and what is paid. While we certainly pay for movies and shows on Amazon and appreciate having the option there are days that is not an option and there is no way to find out what is free until you click.Also the voice feature works--but only with the Amazon interface--not with Netflix.The Roku has a feature where you can search Hulu, Netflix and Amazon for a particular title and find what you are looking for.I had high hopes for the kid's freetime option that will someday be available on the Fire because I love Freetime service on the kindle--but honestly it would have to blow me away to make up for the overall letdownI am sure a few versions from now this will kick butt compared to everything on the market, but right now it just does not live up to the Roku", "verified": true, "helpfulness": "4/5", "author": "J M P \"Hotel Mom 123\""}, {"rating": 5.0, "review": "I traded my ROKU for the amazon Fire and don't regret it one bit. This is a dynomite little box that allows me many viewing features and works better than my ROKU!!!", "verified": true, "helpfulness": "0/0", "author": "Libbie57"}, {"rating": 3.0, "review": "Have extra money around.  Buy it.  Replacement for Smart TV, not needed.  Lot more watching options and faster streaming a big plus.  Excellent with Prime Membership.  Drawback a lot of TV shows you have to pay for.", "verified": true, "helpfulness": "0/0", "author": "E Chumly Manka"}, {"rating": 4.0, "review": "Let me start by saying that before I purchased this item I was kinda hesitant, because of the fact that I LOVE apple products!! Hence I have two apple TV boxes in my house... However I bought this, Amazon Fire TV because I signed up for Amazon Prime... If I choose I can still rent movies the same way that I do on iTunes... I would say that if you are an Amazon Prime member you SHOULD get this!!! You can stream everything onto your TV!! Plus anything \"app\" that you want such as Netflix is available!!I especially LOVE the Voice Search Feature!! Which is one thing that the Apple TV does NOT have!! ( I hate going through the letters via remote to search for something, it takes forever!!)", "verified": true, "helpfulness": "0/0", "author": "Megan Berkley"}, {"rating": 4.0, "review": "I think amazon fire tv is freaking great I like the variety of tv shows and movies I'm really glad I bought it I even canceled my cable this is pretty much all I need for my viewing pleasure", "verified": true, "helpfulness": "0/0", "author": "aaron fischer"}]