[{"rating": 5.0, "review": "Fantastic, love it. Thank you.!!!!!!", "verified": true, "helpfulness": "0/0", "author": "BARBARA J DININO"}, {"rating": 5.0, "review": "I like the fire TV, because it works great it giving me access to lots of movies. The voice command works very good, and it is very fast like 2 or 3 seconds when you put in a search option, I would recommend it to anyone. I do have one complaint, The instructions on how to operate the remote is not very good. It took me a long time to figure it out, before I was able to really able to use the remote. I did make one purchase that improves the ease of use of the fire TV. It was a remote device, called a HDMI Amplifier switcher 3X1. this lets me put the output from the fire TV and my local channels into one .This lets me switch between local and fire TV using the controller that came with the switcher.", "verified": true, "helpfulness": "1/1", "author": "Henry Baldwin"}, {"rating": 5.0, "review": "Really nice streaming box. I have owned Rokus and Chromecasts in the past, but this blows them away. Unit feels solid and is made with quality in mind and looks great. You can sideload other android apps, making the possibilities endless. Would recommend to other and I have, several friends have bought them after my recommendation. I now own 2 of them and my family enjoys them.", "verified": true, "helpfulness": "0/0", "author": "Danny Davis Jr"}, {"rating": 5.0, "review": "I tried Apple tv but could not use it because of constant buffeting issues.  Fire tv works great without any buffering.", "verified": true, "helpfulness": "0/0", "author": "Pontiac Al"}, {"rating": 5.0, "review": "Absolutely fantastic. Easy to set-up and I've had a great experience using it. It really holds your hand during the set-up process, offers a number of \"free-to-try\" services and eases the user into using it. Did compare with other options on the market and this offered (by far) the best price/quality ratio and I couldn't be happier. The only regret is not getting this sooner.", "verified": true, "helpfulness": "0/0", "author": "Sigmundur Halldorsson"}, {"rating": 5.0, "review": "Bought it 30 days from today have had no issues with it just love and lets you be in control can add any games from the Google Play Store..", "verified": true, "helpfulness": "1/1", "author": "Francisco R. Zendejas"}, {"rating": 5.0, "review": "Excellent device - lots of apps, including the regulars as well as a lot of games, i-heart radio etc. The slideshow feature is nice. I love the voice activated search - saves a lot of on-screen keyboard operations  !", "verified": true, "helpfulness": "0/0", "author": "LovesElectronics"}, {"rating": 4.0, "review": "it is very awesome. I really like the voice search function cuz I am too lazy to go through a TV Guide or electronic schedule. With this you can say your favorite actor's name, your favorite genre, the name of a movie or TV show, and it just comes up. The only thing I wish was different is automatically work with Netflix, so if it did not have it on Amazon Prime and automatically with default to Netflix so you can watch it. Other than that it's great for streaming", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 5.0, "review": "Fire TV is an awesome product.  Exceeds my expectations in every way.  Easy to use and is fast!  Great Job Amazon!", "verified": false, "helpfulness": "2/2", "author": "Dennis Clark"}, {"rating": 5.0, "review": "Great product.  We purchased this mostly to catch up on semi-recent movies that we couldn't substantiate spending $40-50 a pop to see in the theaters. (few movies today are worth that kind of money).  As we are Prime members, it is a fantastic deal!  Admittedly, we will probably not use all the other online service features, as we aren't that into main-stream TV.  Purchased the upgrade (from Stick) unit to better ensure performance from our router, which is upstairs.  So far, no transmission issues.", "verified": true, "helpfulness": "0/0", "author": "Craig Isaman"}]