[{"rating": 5.0, "review": "It is awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "Lynda L. Simpson"}, {"rating": 5.0, "review": "Very nice, use it often, large selection.", "verified": true, "helpfulness": "0/0", "author": "Robbie Rouse"}, {"rating": 4.0, "review": "For your TV has added a lot of value to my household. I was disappointed that the initial unit did not come with its own HDMI cable but once one was purchased the set up of the unit was very easy. I would like to be able to see movie and television show searches have the provider listed as well. Sometimes it is difficult to find outwe are in movies being offered from… Is it from Amazon prime? Is it from Netflix?Overall this is been a big win and a great addition to our household", "verified": true, "helpfulness": "0/0", "author": "guitargearjunkee"}, {"rating": 5.0, "review": "I have had my Fire TV box hooked up for 3 days now and am absolutely addicted to it.  I am thinking of canceling cable.  It is very easy to use.  Love the voice option.  I see so many things to watch that for the past few nights I have been up until 3AM.  Thanks Amazon for another great product.", "verified": true, "helpfulness": "0/0", "author": "Judith Poss"}, {"rating": 5.0, "review": "With AFTV, Amazon Prime, and Netflix, we enjoy the best programming wherever we have a Wi-Fi connection and HDTV, Kindle Fire HDX, or PC! A pleasure to catch up on fine American and British series, free HBO and Showtime series and comedy specials, and niche membership channels like Gaiam TV.Don't be intimidated by the technology. Switching between Amazon Fire TV and satellite service is a cinch!We're still tethered to Dish TV for a variety of HD \"cable\" channels, including Fox News, TNT, TCM, AHC, OWN, ID, History, H2, Discovery, PBS channels, and local and national broadcast channels. We use TWC for high-speed PC Internet connection, since we lose Dish service during heavy storms.I'm open to suggestions for reducing satellite and or cable costs.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very easy set-up. I was watching a movie in minutes! Love it.", "verified": true, "helpfulness": "0/0", "author": "Peter F. Aldrich"}, {"rating": 4.0, "review": "I like it so far the only thing us that it's not compatible with some of the apps that I like to use", "verified": true, "helpfulness": "0/0", "author": "rayodd nugent"}, {"rating": 4.0, "review": "A good section of Movies for a small price", "verified": true, "helpfulness": "0/0", "author": "George D. Bernhardt"}, {"rating": 5.0, "review": "works excellent", "verified": true, "helpfulness": "0/0", "author": "Rafael Gomez"}, {"rating": 4.0, "review": "I love this little box - it's zippy, responsive, workhorse and is great for Amazon Instant Video and Netflix.  We use this as our primary entertainment and it just does its thing.Another great feature is it lets you sideload android apps easily so you can upload your android apps even if they're not part of the Amazon store!Knocking one star off for a not so great app offering and a tedious means of shopping for them, but only one star since it's easy to sideload the apps.", "verified": true, "helpfulness": "0/0", "author": "Paul Martin"}]