[{"rating": 4.0, "review": "In my short experience with this device, I was able to watch movies/shows from Youtube, Netflix, Hulu Plus, and Rabbit TV quite seamlessly. It's not for games, it's for video-watching. If I worked for the cable companies, I would be very afraid. One night, after recording Grimm on our Comcast DVR, it wouldn't play. It kept hanging up when we tried to play it.I brought the show up on Hulu Plus, and was watching it in minutes. I really believe that if your a bust person that watched TV when you want, the combination of Netflix/Hulu Plus/Rabbit TV/Chromecast will keep you happy in couch potato mode for as long as you like.Of course, you need good Wi-Fi :-)", "verified": true, "helpfulness": "0/0", "author": "well-read and still learning"}, {"rating": 5.0, "review": "I have bought one of these for each TV in the house. It makes it easy to stream movies from Netflix, Google Play, etc. while controlling it from my phone.", "verified": true, "helpfulness": "0/0", "author": "Trapper D"}, {"rating": 4.0, "review": "This is also perfect if you don't own a PS3, Xbox 360, a wii, and a 60 inch 3-D smart T.V. it will be redundant but if you don't have those things, it'll be perfect. I gave mine away to a friend that doesn't have those things but I may buy another one just to have for vacations. I do travel quite a bit and think this will be perfect for that. Once they can put CBS and ABC to go, it'll really be worth it!!", "verified": true, "helpfulness": "0/0", "author": "bigmoe1866 \"bigmoe1866\""}, {"rating": 5.0, "review": "Google Chromecast HDMI Streaming Media Player makes it easy to watch Youtube, and Netflix.It is Awesome!!!!Keep it up", "verified": true, "helpfulness": "0/0", "author": "Nickolas Schulz"}, {"rating": 5.0, "review": "Plugged in and had it up and running in a matter of minutes. Auto updating took longer than setting it up.", "verified": true, "helpfulness": "0/0", "author": "Craig"}, {"rating": 5.0, "review": "Great work fine no problem I have two. Enjoy movies and TV on my TV can't wait for more apps", "verified": true, "helpfulness": "0/0", "author": "chago"}, {"rating": 5.0, "review": "I received one as a gift for Christmas last year (2013) since I was buying a HDTV. Here's the thing: if you own/going to buy a Smart TV that has Netflix and Youtube on it, then the Chromecast is a WASTE of money. The Chromecast plugs into the tv allowing you to stream stuff to your HDTV. I do believe that Google will be allowing other services to cast eventually.I saved alot of money when choosing my HDTV because I already subscribe to Netflix. I don't need all the extras on a SmartTv. Setup is easy, and don't forget the plug-in at the very end. Got one for my sister as well.There is another thing the Chromecast can do: you can wireless stream your local files to your HDTV. Google Chrome has an extension that puts the Chromecast tab into Chrome and some minor setup. I've done it on mine. But there are some flaws.The streaming is sometimes slow, so watching videos gets choppy or buffers randomly. You can turn your TV into a HUGE desktop if you wish.I've even managed to get my Kindle Fire HD to Cast my content onto my HDTV. I'm not going to get into specifics. I've had all that set-up since February of this year.Reminder: If you have a SmartTV-----NO Chromecast.", "verified": true, "helpfulness": "0/0", "author": "B. Mason"}, {"rating": 2.0, "review": "I had great expectations for Chromecast but with the very weak instructions included with the product I finally had to give up.W E Hooper", "verified": true, "helpfulness": "0/0", "author": "W. Euan Hooper"}, {"rating": 5.0, "review": "This is Google's greatest invention. This is the most convenient piece of technology ever and it's really easy to use. If there were any problems, it would probably be the App you're trying to cast. I haven't had any issues. This will be even greater when more apps are added.", "verified": true, "helpfulness": "1/1", "author": "Alex"}, {"rating": 4.0, "review": "Very nice merchandise!　are using more than three hours, the problem comes out to reflect sound. return to normal and  if put a little time.　Once it is improved, there is no problem at all in the Google Chromecast HDMI Streaming", "verified": true, "helpfulness": "0/0", "author": "Mika Suzuki"}]