[{"rating": 5.0, "review": "I have bought three of these so far from Amazon. They go on sale for 29.99 quite frequently so I seem to snatch them up when that happens. It's great being able to stream Netflix/Plex/youTube to them all over the house.", "verified": true, "helpfulness": "0/1", "author": "D. Guthery"}, {"rating": 2.0, "review": "This product did not fit into my TV - the HDMI port was on the back, and the flat screen TV could not be mounted on the wall.  The Chomecast broke.  It also was not compatible with our wi-fi router.", "verified": true, "helpfulness": "2/4", "author": "loveallanimals"}, {"rating": 5.0, "review": "I got mine for about $35 - which is waayy cheaper than the apple device.  Super easy to install (basically plug-n and link your device to it).Now I've been watching Netflix on my tv instead of my laptop or phone, in addition to other subscriptions - easily from my phone.  Youtube cat videos on my tv instead of my wee phone - nothing better!", "verified": true, "helpfulness": "0/0", "author": "Sally"}, {"rating": 5.0, "review": "Easy to set up. Just follow the TV screen prompt. Need computer or tablet to complete code verification.The Chromecast player is amazing. It receives my wifi signal well even when behind my TV. It runs a little warm but so far so good. I can stream video from various Apps from my ipod4,ipod5,tablet and Windows PC. Be sure to update or install the latest versions of Streaming Apps on your iOS and Android devices. For the desktop computer's Chrome browser, install the AddOn or Plugin to enable the Chromecast icon. Always play the video first before tapping or clicking the Chromecast square icon usually on the top right of the screen. The icon turns to blue color when video streaming is enabled. If I move the Chromecast device to another TV with HDMI jack, that TV will stream the video, if not, click the icon on the PC, tablet or mobile device to disconnect and click again to reconnect and it always worked for me.There is little control other than Pause/Play on the ipod, tablet or desktop computer. Some apps allows fast forwarding the movie if you pause the movie first. Works well with Netflix, Viki, Dramafever, Youtube so far.", "verified": true, "helpfulness": "1/1", "author": "Ed T."}, {"rating": 5.0, "review": "I must say that it's at Walmart for $35. Just saying... I expect online deals to be better. It is a good product if you have a decent flat screen and want to make it \"smart\" using a laptop, tablet, etc. The other great thing is that it connects directly to your wifi just like your laptop does, so the devices don't have to be close together.", "verified": true, "helpfulness": "0/0", "author": "ayojeera"}, {"rating": 5.0, "review": "I received my Chromecast for Christmas 2013, so I've had it for about four months now. In that time I have discovered an incredible amount of functionality, and like my title states, it almost seems like magic to me.It was super easy to set up, and it has allowed me to watch a wide variety of media. Services like Netflix, Youtube, BeyondPod, and Pandora work very well to play media streamed from the cloud. More recently, I have discovered the powers of Plex and casting from the Chrome browser itself to play some of the media I have stored locally.  Media looks sharp, and takes advantage of my TV's HD capabilities more than anything else I watch.It works well with my laptop, as old and underpowered as it is. It also works well with my off-brand Android phone, although at times, I do find that sometimes my phone loses communication with the Chromecast and I am unable to control the media that is streaming. In this case, I have to start broadcasting the media again to reestablish a connection, which can be annoying if I am in the middle of watching something.A note about television aspect ratios: my TV is pretty old (8 years) and is a 4:3 resolution, like TVs used to be. I have to change the input on my TV to accept 16:9 media, because the Chromecast itself cannot detect the proper aspect ratio and just stretches to fill the screen, regardless of dimension. I would imagine this would not be a problem on most modern televisions.Despite these two problems, the ease of use, the ability to play pretty much any media I can get my hands on, and the great appearance make this a wonderful device that I would recommend to anyone. The price is 100% worth it; go ahead and get one now!", "verified": false, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 4.0, "review": "I gave this 4 instead of 5 stars because for some reason it doesn't work well with my 60\" Sharp Aquos TV. I don't know if it's a Sharp problem, but I've tried cable extensions and everything and it tends to clock out so frequently that it makes it unwatchable.  However, on all my other TV's it works flawlessly, so overall I recommend it. Just be careful if you have a Sharp TV.", "verified": true, "helpfulness": "0/0", "author": "Texas23"}, {"rating": 4.0, "review": "It works pretty well and being that I don't have cable it is really good for those days when I want to watch a movie or some thing.", "verified": true, "helpfulness": "0/0", "author": "ricasauce"}, {"rating": 5.0, "review": "Great seller, fast delivery, the seller is always connected, low price and good quality. Would recommend this product.", "verified": false, "helpfulness": "0/0", "author": "Igor"}, {"rating": 5.0, "review": "Excellent packaging, really usefull, very intuitive use. Compact and not expensive. Really a good option to cast your device to the TV", "verified": true, "helpfulness": "0/0", "author": "Gabriel Silveira"}]