[{"rating": 5.0, "review": "Love this thing! It really reduced the amount of clutter in front of the TV and I never pay for cable now. Has everything I need.", "verified": false, "helpfulness": "0/0", "author": "Debra Keller"}, {"rating": 3.0, "review": "Great when it works, often takes many attempts to connect to.", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 3.0, "review": "It's nice but the only problem is if you're in college you can't hook it up to your wifi. I had to use the mobile hotspot on my phone which uses a ton of data. You will have to get a travel router for it which is another like $20.", "verified": true, "helpfulness": "0/0", "author": "Bailey Marasti"}, {"rating": 5.0, "review": "work great getting another one for my bedroom", "verified": true, "helpfulness": "0/0", "author": "Kathy N."}, {"rating": 5.0, "review": "Performed as described.", "verified": true, "helpfulness": "0/0", "author": "louis"}, {"rating": 5.0, "review": "SO GREAT. Everything I expected, received package in full, GREAT QUALITY.", "verified": true, "helpfulness": "0/0", "author": "Mary Shea"}, {"rating": 3.0, "review": "I've been eyeing the Chromecast for a while and finally bought one. Well... it was great, when it was working. It didn't occur to me that I'd have so much trouble with my wifi/router. Apparently Chromecast has recommended routers and internet providers, and my router (although outdated) wasn't one recommended and CenturyLink (my internet provider) doesn't offer many routers that are 'recommended' by Google. So instead of updating my router, to one I'm not sure will work with this device, I'll just have to send this back, which stinks. It set up really easily and would show up on my network. I'd be able to stream something from Netflix, but within a minute the Chromecast would disappear from my network and I was unable to control what I was streaming. Apparently there's a way to change your routers settings to allow it to multicast, but my router is too old to allow that. I'll probably need to look into updating my router before I give Chromecast another try. Check if you have a compatible router or if there's a way to work around an issue you have with streaming here...https://support.google.com/chromecast/table/3477832?hl=en", "verified": true, "helpfulness": "2/2", "author": "Kaitlyn Boyer"}, {"rating": 5.0, "review": "It's awesome!!  Very easy to set up and stream anything from any device within my wife area.  There is no reason to not have one or two of these around.", "verified": true, "helpfulness": "0/0", "author": "Nick C."}, {"rating": 5.0, "review": "If you upload your files to Google Drive you can then stream your files to Chromecast.  Also if you use the chrome Browser you caneed stream any file that plays there to chromecast.", "verified": true, "helpfulness": "0/0", "author": "Clinton D. Hart"}, {"rating": 4.0, "review": "Works good when used with supporting apps, but very choppy when watching a show that the app doesn't have built in chromecast features...needs more apps intergrated with it.", "verified": true, "helpfulness": "0/0", "author": "Dockdc"}]