[{"rating": 4.0, "review": "This little device isn't bad at all. It works well with wireless connection. Just wish that I could use it more other than Netflix and You tube.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I thought, hey, it's only $35, why not? And I've used it almost daily since it arrived. Buy it, you won't regret it.", "verified": true, "helpfulness": "0/1", "author": "tacoma, wa"}, {"rating": 1.0, "review": "I chose this rating because I believed that this was a plug and play item; it is not. Check your router type before you buy because certain routers require troubleshooting and reconfiguration to work.  Google response was to contact my router manufacturer and the manufacturer was of limited help.  This would be great if it worked but the expectation of plug and play turned into days of trying troubleshoot and reconfigure my router.  Do your homework before you buy.", "verified": true, "helpfulness": "0/0", "author": "gene"}, {"rating": 1.0, "review": "The device would not play a show or movie (Netflix) without re-cycling, then displaying an error message, about trying later.", "verified": true, "helpfulness": "0/0", "author": "michael friedman"}, {"rating": 5.0, "review": "It's badass. There just isn't an easier way to access streaming video on your tv. Thanks Google. Xo Xo Xo.", "verified": true, "helpfulness": "0/0", "author": "Joshua Alder"}, {"rating": 5.0, "review": "Christmas gift for my husband...and he couldn't be happier!  Liked it so much we got it for our babysitter for a gift too!", "verified": true, "helpfulness": "0/0", "author": "robin mcnair"}, {"rating": 4.0, "review": "A few popular services, like Netflix and Youtube can be easily \"cast\" from networked PC's and mobile devices on to your TV.  For $39 bucks, it seems worth it so far.  Hopeful that there will be upgrades in the service that will allow for broader selection of services to \"cast\" on to my TV.", "verified": true, "helpfulness": "0/0", "author": "dudeskii \"madmanmike\""}, {"rating": 4.0, "review": "works great! easy to connect. i love being able to stream from my phone! projecting chrome browser content is still slow... but streaming content from youtube and netflix is excellent. :)", "verified": true, "helpfulness": "0/0", "author": "noel maguigad"}, {"rating": 5.0, "review": "The Google Chromecast is a great streaming device for everyone who does not need to stream local data from their mobile devices or desktop. So basically, things like pictures, videos, or movies in your phone, tablet, or computer cannot be sent to the Google Chromecast. If people need that type of service, I would recommend an Apple TV. I would also recommend Apple TV as it now supports a lot of apps and streaming services.But for a small (yet still growing in numbers as developers decide to implement the Chromecast technology in their apps) number of app support and services such as Netflix, HuluPlus, Viki (Free Subscription), and YouTube, Google Chromecast is a great and cheap way to start media streaming to your TV.For more info on the Google Chromecast here is a helpful article I read provided in the following link:[...]", "verified": true, "helpfulness": "0/0", "author": "Joey Amalei"}, {"rating": 5.0, "review": "We have had chromecast for a couple of weeks.  Waited for someone to help us install and finally did it ourselves.  We are techno non existent, but finally figured it out of 45 minutes.  We.ll worth the effort", "verified": true, "helpfulness": "0/0", "author": "Mimi"}]