[{"rating": 3.0, "review": "Does not connect to my tv service Direct TV, so unable to use certain aspects of the unit.", "verified": true, "helpfulness": "0/1", "author": "DERRY PEARCE"}, {"rating": 5.0, "review": "I absolutely love this device!  I was having trouble with my Sony DVD player that includes apps like Netflix & Amazon Video maintaining a wi-fi connection no matter what I tried.  This device loads my content very quickly & I don't have any buffering issues at all.  The picture & sound quality are great.  Super easy to set up - took less than a minute!  It automatically synced to my Prime account.  The device is really small.  It would be really easy to travel with this to anywhere that has a wi-fi connection.  Love, love, love!", "verified": true, "helpfulness": "0/0", "author": "ckp2014"}, {"rating": 5.0, "review": "I love this device!  We were previously streaming content through our blu-ray player but after reading some of the reviews decided to get an Amazon Fire TV.  I cannot believe the difference.  As everyone has said it is easy to set up, but what I really notice is first how much quicker I am able to load apps such as Netflix, also I am seeing an improvement in my picture quality.  I do love it.  However I do hope it becomes easier to see which videos are free with Prime and which are for rent while looking at them on screen.  To get around that I go to my computer and do my searching of the videos and stick them on my Watchlist.  Other than that I am thrilled with this device.", "verified": true, "helpfulness": "0/0", "author": "Rkar \"R Kar\""}, {"rating": 4.0, "review": "I'm pleased with the performance and ease of use of the device. However, I wonder why I can get Pandora but not Prime Music.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey G"}, {"rating": 5.0, "review": "This \"TV box\" has made our media room much busier - voice search is nice, the popular apps are easy to use. It's fast / responsive.  The only gripe I have so far with it is that a connected keyboard works excellent with Hulu+ & Netflix (searches using the keyboard rather than the on-screen keyboard through the included remote), but not with YouTube. I've tried 2 different usb wireless keyboards - they work great with the other apps, just not the YouTube app - please fix this Amazon!", "verified": true, "helpfulness": "1/1", "author": "NetHolio"}, {"rating": 5.0, "review": "Love this! Will purchase as gifts!", "verified": true, "helpfulness": "0/0", "author": "Catherine L Jolley"}, {"rating": 4.0, "review": "Great to use for Netflix and Plex Media Server!  I've had no problems after initial set-up.  Hulu works pretty well too.  There should definitely be a way to browse only movies that are available for free through Prime.  The lack of this feature makes it less likely that I will use Amazon Instant Video. But overall, it works really.  If you use Plex, I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "J. S. Goodspeed"}, {"rating": 5.0, "review": "This is the best for streaming Netflix HBO, Prime and on and on.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Great gimmick.  My wife and I moved to our retirement farm and didn't want to go with a full satellite setup.  We are movie fans, and not into serial television at all, so this looked to be a good way to go.  They just need to figure out how to provide sporting events (NFL) from a streaming source and I will have all I want.", "verified": true, "helpfulness": "0/0", "author": "Stream Whipper \"KingFisher\""}, {"rating": 5.0, "review": "This is an update after using the FireTV for 3 weeks.Love it. Fast, easy to set up and use. Fast on startup of Netflix and other selections. Optic fiber outlet for older sound systems. Roku 3 has only HDMI.BUT - Why can't we turn off the TV without the box quitting the stream to TuneIn Radio? We are not in the room to watch it, so why have the TV on. The FireTV is connected to the Amp for sound, not to the TV. We can shut down the TV and still stream our ISP provided radio stations through cable box. Why can't Amazon do the same thing?AND WARNING - We are blowing through our download monthly ceiling faster with the FireTV than streaming through the Blue-Ray DVD player. We know about the Mosaic screen saver setting. Mosaic is off.", "verified": true, "helpfulness": "0/0", "author": "Ter \"Ter\""}]