[{"rating": 4.0, "review": "Works great, great price. Use it to watch netflix. The tabcasting feature is cool, but definitely still a work in progress.", "verified": true, "helpfulness": "0/0", "author": "Gruntled Pig"}, {"rating": 5.0, "review": "Obviously google has billions to spend on the product, which seems to show in Chromecast. Simple device, simple concept, but works like a charm. Casting directly from the browser is little jittery, but Youtube video works like a charm. Google is coming with more apps, which will make this product even better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "One of the best liked and least expensive gifts I got for the kids this years (16 and 17 year olds), both love this thing.", "verified": true, "helpfulness": "0/0", "author": "PaulBWatertownCT"}, {"rating": 2.0, "review": "I thought I was buying a device that would wirelessly project onto my TV whatever I see on my laptop but that's not what this device does.  Oh it has the capability but google only allows it to project google friendly content.  For example, I can't use this device to project amazon instant video's onto my TV.  It also forces you to use google chrome which I was open to trying but have found it to be lacking in features that I have come accustom to with firefox.", "verified": true, "helpfulness": "0/1", "author": "Lew"}, {"rating": 4.0, "review": "Although it is a great gadget it can be quite difficult to set it up! I bought 2 and one of them was very easy to install. Exactly as mentioned in the instructions. The other one could not find my router... Later I notice that quite some people have the same issue. After some trial-and-error I learned that some settings of the router can prevent communication between the dongle and the network (e.g. WPS on/off). Google had some good FAQ on that matter.Other than that, this is definitely a must-have!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Eduardo Barbaro\""}, {"rating": 3.0, "review": "its not having so many feature as i thought they need add some more feature like running audio from the music player and scound screen mirroring", "verified": true, "helpfulness": "0/0", "author": "mohammed"}, {"rating": 4.0, "review": "The most economical way to convert your TV to a Smart TV and it does the job pretty well. I would definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Sandeep Punjabi"}, {"rating": 2.0, "review": "It just didn't work, and in a weird way. Failing 95% of the wifi networks tested, but not all. Horrible reception but nice animations.", "verified": true, "helpfulness": "0/1", "author": "Raphael Balimann"}, {"rating": 4.0, "review": "I received it and its working, I tried it with my samsung s3 and note 3 androids its perfect also I tryid the HD video from you tube its works great, the thing I like it you can list all your videos and it will play on base of the sequence, the only reason 4 star because its not working with 3g or 4g mobile data package you need to connect your mobile to wifi so it can connect.", "verified": true, "helpfulness": "1/1", "author": "Adel"}, {"rating": 4.0, "review": "ProsFairly pricedConsdoesn't stream from own home network and serverCauses my youtube app to crash on nexus 4. Anyone else have freezing issues?", "verified": true, "helpfulness": "0/0", "author": "Love.Live.Life \"-Andrew\""}]