[{"rating": 4.0, "review": "Great product. The \"voice-search\" feature is excellent. If Amazon could find a way to add a filter feature that only let you view only the Amazon Prime, stream-able content (instead of stuff you have to buy to watch....it would be a 5/5. Its always a bummer to search for something, find it, and have to click through to realize its not streaming.", "verified": true, "helpfulness": "1/1", "author": "arlopear"}, {"rating": 4.0, "review": "Works well.", "verified": true, "helpfulness": "1/1", "author": "iKonectU Communication Services \"gjm\""}, {"rating": 5.0, "review": "One week in.  So far so good.", "verified": true, "helpfulness": "1/1", "author": "Eddie Zeezabo"}, {"rating": 5.0, "review": "Fire TV has a very good selection of viewing for current movies and TV programming, many of which are included with Amazon Prime. The voice recognition system is the best I have ever used! It is almost flawless. The wireless HD streaming is smooth, seamless and of outstanding quality. I have yet to experience any buffering or image distortion. You just select a program to watch and start watching, it is that easy.", "verified": true, "helpfulness": "1/1", "author": "Garrett E. Budwine"}, {"rating": 5.0, "review": "Looks and acts like a new device. I've had no issues with it. Was very easy to set up and it watches like tv. I did hook up with ethernet cable rather than relying on wireless, just to ensure I have the steadiest connection, but that was based on preference rather than anything else. I can say it's a huge difference between looking at a show, say on abc.com rather than looking at the same show on fire tv... on my laptop, which is older, the graphics move at a snails pace and you can't ever match up what is happening with what you see.. using this, it's really like watching live.", "verified": true, "helpfulness": "1/1", "author": "A C"}, {"rating": 5.0, "review": "I love the amazon fire tv! I am so glad I bought it!! My sister has the apple tv, but when I bought my mom an amazon fire tv, my sister  installed it and liked it so much better then the apple tv, she bought herself an amazon fire tv for another tv in her house. Its so easy to install, I have never had a problem with it and have gotten to catch up on all the tv series I missed. I love that it connects with our netflix account, and there is so much available for free!!!", "verified": true, "helpfulness": "1/1", "author": "J. R. Allen"}, {"rating": 5.0, "review": "Worked perfectly, as advertised, out of the box. Streaming worked exactly as expected.", "verified": true, "helpfulness": "1/1", "author": "Michael Landi"}, {"rating": 5.0, "review": "My family loves the amazon fire TV. Lots to choose from and love the talk search feature. It works great and easy to set up.", "verified": true, "helpfulness": "1/1", "author": "dswain"}, {"rating": 5.0, "review": "My family is so glad we cut the cord and bought Amazon Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Jessica"}, {"rating": 3.0, "review": "Service is decent but even with Prime so many of the titles still have a rental fee.  Have had some issues with it stopping during movie play but not too often", "verified": true, "helpfulness": "1/1", "author": "GSB"}]