[{"rating": 5.0, "review": "Wow.I own all of the new streaming players.This one is the best.Fastest performance.Voice search is cool.Cant go wrong with the top Three,apple tv, roku 3, but this one I love!!!!", "verified": true, "helpfulness": "1/1", "author": "Knowmastermike"}, {"rating": 5.0, "review": "My 2 year old grandson could set this up.  If you're a Prime member this is must have.  For the money, it's well worth it.  It came set up (with my account).  Dump cable get this!!", "verified": true, "helpfulness": "2/2", "author": "Review Frenzy \"It's the quality\""}, {"rating": 5.0, "review": "This device has taken over the responsibilities of my Roku 2 and an older Intel Atom HTPC computer. XBMC/PlexApp runs GREAT on it. I'm really liking the voice search. The only thing I would want is the HBOGO app, but thanks to Prime+some HBO shows, most people should be fine with what's currently being offered.", "verified": true, "helpfulness": "2/2", "author": "Baseer"}, {"rating": 1.0, "review": "Someone at Amazon sat there and thought, \"Let's make it so that the intro video, which we have designed for the bottom 5% in terms of tech skills, UTTERLY IMPOSSIBLE to skip for the other 95% who know how to press buttons to make things happen on a screen.\"It is in the name of that person that I dedicate this one-star rating. I'd just like you to know that as soon as I found out it couldn't be skipped, I turned off the TV. I have no idea what most of the intro says. I will not have hardware I paid for, forcing me to watch some idiot video against my will.The claustrophobic UI that isn't as good as Roku's would be reason enough to knock off two stars, considering that it costs the same and provides absolutely nothing of value to the majority of people who buy these things. Of course, this is a higher-spec box, but how many people have a reason to care? A hundred or so? The video you get out of this thing is the same you'd get with a Roku, except that the Roku has a much nicer interface. As for the games, this is not in any way, shape or form a console killer. More like a cell phone that talks to your big screen. That's about the processor and graphics capabilities you can expect.The voice feature is nice, but that feature doesn't make up for the clunky UI. I also have to wonder what Amazon is doing with all of our voiceprints. I know they are saving them remotely because there's a blurb about deleting them in the UI. What are they doing with them? Probably nothing advantageous to us. The tech is already good enough to recognize peoples' voices. Having 800 copies of a person saying \"youtube\" does what for us, exactly?", "verified": true, "helpfulness": "5/19", "author": "Huns"}, {"rating": 5.0, "review": "I love it, great games, movies selections, and lots of other apps!", "verified": true, "helpfulness": "1/1", "author": "Leonel Enrique Parrales Jimenez"}, {"rating": 5.0, "review": "Great for punishing kids with documentaries", "verified": true, "helpfulness": "1/5", "author": "Dan Effinite"}, {"rating": 3.0, "review": "I still use my roku in the living room with big TV as it  has way more apps and access than the Fire, was debating to put the fire in living room and just use the roku in my bedroom. But very limited with just basic apps, Hope Amazon gets way more app channels like roku has in the near future.", "verified": true, "helpfulness": "0/2", "author": "Me \"Me\""}, {"rating": 5.0, "review": "Pretty much changed my habits without even trying.  I just head here first now, since I can find just about anything anywhere.  The voice search works extremely well, though I hope in future versions of the software their programmers think a little more about who is searching, and what results get displayed.  Like any search engine, you have to take the results with a grain of salt and use your own reasoning to sort out what their engine chose to display.  That said, I still use my Fire TV to search for options first before exploring my other alternatives.", "verified": true, "helpfulness": "1/1", "author": "K. Transue"}, {"rating": 5.0, "review": "I simply enjoy my FirevTv...the best feature besides what the advertisement says the equipment can do, is the simple connection..I mean it's like out the box and within 5-10 minutes it's plug in and sit back watch !! So many great movies to stream to your tv thru Amazon Prime and if you have Hulu or Netflix its even better. Plus all the other apps and games..and I notice that it adds new apps like Redbull TV and others..I highly reccomend it, I told 5 friends and family members how great the HD streaming in and they all order the same day without even seeing the demo on line! Way to go Amazon...my TV viewing is on Fire!!", "verified": true, "helpfulness": "1/1", "author": "Dr Hodges"}, {"rating": 5.0, "review": "Love the fact that the fire is so quick compared to any other streaming device.  I canceled my cable tv provider a while back and use only netflix and prime.  Easy enough for a 5 year old to learn the remote and watch kids shows.", "verified": true, "helpfulness": "0/0", "author": "JV"}]