[{"rating": 5.0, "review": "Awesome but should have HBO GO! I love Amazon Fire TV, it has so many great features and is better than Apple TV. I had an Apple TV but decided to switch to the Amazon Fire TV and do not regret!!!", "verified": false, "helpfulness": "0/1", "author": "Carla M Carvalho Fontana"}, {"rating": 5.0, "review": "Loads videos without skipping, videos are always great quality, and very easy to use. By far the best wireless system I've tried.", "verified": true, "helpfulness": "0/0", "author": "Ann"}, {"rating": 1.0, "review": "So you're trying to lure ROKU customers away with Amazon Fire TV, yet you don't even offer the very channel that most ROKU users bought ROKU to get in the first place.....the Blaze TV.Let me know when you offer the Blaze TV channel and maybe I'll lose the ROKU.", "verified": false, "helpfulness": "4/16", "author": "richard wilson"}, {"rating": 5.0, "review": "This box is wonderful.  Impressive from the first minute, it got here in right away, the packaging is like opening a gift box.It set up in less than 10 minutes, super easy to use.  The instruction book tells you how to connect: connect one end of the HDMI cable to the tv, the other to the Fire TV box, plug in the power cord, and set the tv to the appropriate HDMI input (channel) and that's it.  Use the remote control to sign in to your wireless network - it can be a little confusing to figure out the key board commands, but that too takes seconds to figure out.  You can also connect with an Ethernet cable no need to have wireless internet, the only thing you really need is the HDMI connection on the television.There's a little intro video that explains how to use the control clearly, no frustrations, no need to call tech support.  The resolution and the sound are fantastic.  Huge selection, I can see anything I want when I want, favorite shows, stuff I missed, stuff I never heard of, no need to wait for a show time, or record anything.  It's all there.I can't see any reason to have cable or satellite television at this point.", "verified": true, "helpfulness": "1/1", "author": "harry57"}, {"rating": 4.0, "review": "All and all very pleased with this product. It does exactly what I wanted it to do (play Hulu, Netflix, and Youtube on my tv) without having to use a tablet, lap top or phone like the Chromecast does. My only complaint is that the voice commands don't work while searching in these apps, only to search Amazon content, but that is the fault of the app developers, not of Amazon.  Annoying, but not a big deal.I would kill for a key pad for this, as having to cycle back and forth across the entirety of the alphabet to type in searches is pretty painful.", "verified": true, "helpfulness": "1/1", "author": "Mike Potts"}, {"rating": 3.0, "review": "It does not have an app for HBO go", "verified": true, "helpfulness": "4/7", "author": "btice1"}, {"rating": 5.0, "review": "I have been more than happy with my Fire TV since the moment I hooked it up, and it just keeps getting better. First, it is easily the best content streaming device I have had. I say that after using four different Blu-ray players--two from Samsung, one Sony, and my current Panasonic. All of those had limitations or problems that made them less useful than this unit. The constant upgrading is great and the new services just keep coming. Really was happy the other day when I found I could access my entire Amazon Cloud music library, and if that wasn't enough, I found last night that I could access all the photos and videos from my iPhone from Fire TV with an app. This summer, with the purchase of two after-market controllers my grandkids had hours of trouble-free enjoyment playing various games. If I didn't have so many DVD's I would be tempted to mothball all my Blu-ray players and get another Fire TV unit. Only one negative I can think of is not having access (so far) to VUDU. Other than that, I can't think of anything I have purchased in years that has been so trouble-free, so easy to use, and so flexible, with more and more features to come, I expect.", "verified": true, "helpfulness": "0/0", "author": "William Sutton"}, {"rating": 5.0, "review": "I like it as it is easy to search for shows I wish it had the sling blade app and or the ability to add other apps", "verified": true, "helpfulness": "0/0", "author": "Jay vabch"}, {"rating": 5.0, "review": "I have spent 2weeks using my new Fire TV and I love it.The Fire TV lets me see all the shows I missed  the first time around.and catch up on the currant ones..I have Amazon prime and  use it daily with my Fire TV. I use the voice search all the time it's Great.You can even get Netflix and hulu with the Fire TV.AAA ++", "verified": true, "helpfulness": "0/0", "author": "Connie Lewis"}, {"rating": 5.0, "review": "Great packing, design and interface.", "verified": true, "helpfulness": "0/0", "author": "lansing1905"}]