[{"rating": 5.0, "review": "Love the voice recognition .. It's awesome I really want every body to have one it has change my tv watching experience", "verified": true, "helpfulness": "0/0", "author": "safiya neal"}, {"rating": 5.0, "review": "Nice compliment to Apple TV and content is usually less expensive.", "verified": true, "helpfulness": "0/0", "author": "Page Pittman"}, {"rating": 2.0, "review": "netflix app constantly gets logged out & i have to re-enter my email and password.  happens about once every 2 weeks or less.  same thing happens on my fire tv stick as well.both netflix & amazon customer support haven't been able to fix this... i'm guessing amazon's doing something dumb to keep netflix from working properly... i haven't had this problem on any other platforms... i've used netflix on game consoles, roku, google chrome, chromecast, blu ray players... just about every other platform this is available on.  i *never* get logged out of amazon prime.integration with music really sucks.  like, REALLY sucks.  i have a sizeable amazon mp3 collection & navigating to an album is a complete pain in the ass.3d games run really well, surprisingly well.", "verified": true, "helpfulness": "1/2", "author": "DB Bookreader"}, {"rating": 1.0, "review": "Can't get it up and running-----will keep trying----", "verified": true, "helpfulness": "1/4", "author": "Ruth"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "&#34;Robear&#34;"}, {"rating": 5.0, "review": "Just what we expected.  Easy to hook-up and great movies to watch.  A step closer to cancelling our satellite service.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "I am very happy with this purchase I have no complaints so far thank you very much", "verified": true, "helpfulness": "0/0", "author": "carlos garcia"}, {"rating": 2.0, "review": "I would have given it a 3 star rating but do to the fact you can't connect an external hard drive to the USB in order to watch home movies,videos,pictures,music,etc i really don't care for it. A must for me as a decent media streaming player.The Hardware is nice and quick but so is my roku3.I don't see any advantage of buying this for a user looking to stream via amazon prime,netflix or the other standard streaming apps or the ROkU 3.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Good integration of other providers apps (Netflix, PBS, etc) make this a good alternative go cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Nice enough but I find the lack of information about using the interface frustrating. Why do I have to purchase the user manual? Perhaps I missed something.  I was so excited to see Meerkat Manor listed as series I could watch only to find all the videos \"unavailable\". What does that mean? I even went to the Amazon site to purchase them as instant video and can't. Okay. I stuck out on my first attempt but found something else that I enjoyed watching.My biggest criticism, other than the lack of a free user's guide that actually is useful, is that I can't figure out how to stream content from my PC. I don't have and don't need an Amazon Fire tablet. I searched online and can't find any thing that indicates this is possible. I am glad I kept the ChromeCast I got for Christmas. I have two online subscriptions - Lynda.com and Artistnetwork.tv. I can stream the videos to the TV using the Chrome browser and the ChromeCast device. The reason I invested in the Amazon Fire TV is that I can't stream Amazon Prime movies through ChromeCast. My assumption was that I would be able to stream web videos using the Fire TV unit. If I am wrong in my current belief that this isn't possible please advise and tell me how to do this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]