[{"rating": 3.0, "review": "Works well but there is a very big push towards amazon tv products and there is a feeling like they are trying to push you to accidentally pay for programming and movies that are not part of say your Netflix or hbo account. Also if you have an alternate amazon account you can't use it ( i.e. A friends account or a roommates account) because the box gets registered to the buyer; so you can only use the registered account for amazon. They have really tightened up the security with it for max profit. And that's a bit of a bummer.", "verified": true, "helpfulness": "1/3", "author": "Ben D."}, {"rating": 5.0, "review": "Easy set up and use.  I am LOVING my Fire TV!", "verified": true, "helpfulness": "1/1", "author": "Janice"}, {"rating": 3.0, "review": "The product may state that it has parental controls but in reality they are not the same as they would be on the website.  On the fire tv there are two options,  \"prompt for pin code for every video\" or \"dont prompt at all.\"  It does not distinguish between G or R rated movies, which is how it works on amazons website. Which makes it useless to me because I purchased solely for the touted parental controls.", "verified": true, "helpfulness": "1/2", "author": "ziv gerber"}, {"rating": 5.0, "review": "Love it! It's right next to the Apple TV and so far I think the Fire might be the winner. Only time will tell....", "verified": true, "helpfulness": "0/0", "author": "Megan \"Megan\""}, {"rating": 5.0, "review": "Easier than I expected to set up.  Easy to use. Enjoying watching new movies and old tv episodes.", "verified": true, "helpfulness": "0/0", "author": "Chuck Chico"}, {"rating": 5.0, "review": "Love this product!  Much more advanced than Roku or any Netflix device.  Well worth it.", "verified": true, "helpfulness": "0/0", "author": "Matthew Black"}, {"rating": 4.0, "review": "It's easy to use.", "verified": true, "helpfulness": "0/0", "author": "Renee"}, {"rating": 3.0, "review": "It's a great Amazon-specific experience, but it misses out on other experiences such as Chromecast, AirPlay, Google Play Store, and iTunes Store.", "verified": true, "helpfulness": "0/1", "author": "Tom \"Tom\""}, {"rating": 5.0, "review": "Gave it as a  gift to my  son and his  family  so  far  he  loves it...  thanks Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Dorothy C"}, {"rating": 3.0, "review": "There seems to be very little content that you do not have to pay for.  Had I know I would have to pay money for almost everything we want to watch I don't think I would have purchased this.  In addition to Paying a yearly fee for Amazon Prime you have to pay for movies or pay a monthly fee for Netflix  or Hulu.  The movies we want to watch seem to cost more than the monthly fee for Netflix.", "verified": true, "helpfulness": "1/3", "author": "Kathlene G. Coats"}]