[{"rating": 5.0, "review": "It does a wonderful job with new additions coming all the time.", "verified": true, "helpfulness": "0/0", "author": "Troy Tripamer \"We grow too soon old and too late smart.\""}, {"rating": 5.0, "review": "This is the most amazing piece of machinery I have ever come across. It was sooooo simple to set up even with my Cable Company's box already in existence. My only problem is I temporarily forgot my password to my internet service but I called my CC for it and it was Voila , up and running.. This is the BOMB .. I could use another word but it more than likely wouldn't be proper. :)  Fire TV is full of wonderful surprises.  I paused the movie we were watching and the most BEAUTIFUL photographs came up changing, every few seconds a new one was there to see.  We actually waited a while to see more and I have to tell you that none were repeated.  Stopping the movie to watch at a later time is so simple. When you come back to watch it, just scroll over to Resume. That easy... FULL screen movies and we have a 51\" screen.. it's nothing like watching movies on Vudu where we just get a strip of the movie,  AMAZON, WE LOVE YOU AND YOUR NEW TRINKETS.", "verified": true, "helpfulness": "0/0", "author": "Smelly Kats 6"}, {"rating": 3.0, "review": "It has not power switch.", "verified": true, "helpfulness": "0/6", "author": "Daxiangli"}, {"rating": 5.0, "review": "I received my box yesterday and was a little nervous after reading the reviews of the Fire TV that were negative.  I was, primarily, purchasing this to watch Prime content.  I had decided to cancel my Netflix and Microsoft Music, and save over $200/year, buy subscribing to Prime.  Some had stated that you couldn't search for Prime only, and Amazon was somehow trying to \"trick\" you into purchasing more. All I did was go to search and type in \"Prime\", and Amazon Prime Instant Video came up as a choice.  It displayed more prime choices than I will ever need.  You can also search for your movies/shows online and put them on your \"Watchlist\", and very easily access them from the box.Set up was very easy, and I was surprised at how small the box actually was, since replacing a Logitech Revue.  The remote works efficiently, and the voice control is pretty nice as well.Be aware that if you change your sound preference to the Dolby Digital Plus, some shows won't have sound, and it will have to be turned to \"off\".It's a neat box, and I look forward to exploring the other features that it offers.", "verified": true, "helpfulness": "0/0", "author": "aksteeel"}, {"rating": 5.0, "review": "Love the remote.  Very responsive.", "verified": true, "helpfulness": "0/0", "author": "Karen Lyons"}, {"rating": 5.0, "review": "I got it on the exact delivery date. It took 5 minutes to plug in and \"Walla\" my TV is amazing! I love the variety of Prime shows and movies...this device is excellent and takes up no space! So far I love it!", "verified": true, "helpfulness": "1/1", "author": "Julio Rodriguez"}, {"rating": 5.0, "review": "I've been using a WD player for a long time, and after going back and forth for several weeks on getting a Roku 3 or Amazon Fire TV, I went with Amazon. I am very happy with my choice. The Amazon Fire TV is super fast and responsive, loads Netflix and Prime videos almost instantly, and after installing Vimo(app from app store) I can play most of the media from my home media server. I have found that the Fire TV doesn't like ISO, AVI, or M2TS files, but has no problem with MKV, or MP4. If you're in the market for a new media player or just to upgrade from an older slower one, I think most people will be happy with the Amazon Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Rhunic"}, {"rating": 5.0, "review": "Received my Fire TV and the setup took about five minutes... easy peasy!  This replaced a Roku 2 and I was shocked at how fast everything loaded... blew the Roku out of the water!  The voice search in Amazon is awesome and responsive.  I also used it to view my pictures that are loaded in Amazon Cloud... so cool!  The playback is instantaneous, and I have not seen it drop off to buffer while watching like I was experiencing with the Roku.  Still have to explore interaction with my Kindle HDX, but if it works like all the other features, I am sure I will not be disappointed!  Love it!", "verified": true, "helpfulness": "0/0", "author": "Quiet Life \"Quiet Life\""}, {"rating": 4.0, "review": "Everything is fine, but didn't give it a five start because the paid movies are very expensive!", "verified": true, "helpfulness": "0/2", "author": "Ana Elizabeth Iosipan"}, {"rating": 4.0, "review": "I have both this and the Apple TV. I NEVER use the Apple devise anymore and yes I am one of the Kool-Aid drinking Apple users. This blends all my various accesses into one devise IE Amazon Prime and all the HBO, Show Time, Netflix yada yada yada into one place. The voice search really does work! Some of the functionality is a little different then what I would have seemed intuitive but after doing it wrong once the learning curve is complete. I was blaming this device for some strange issues but I soon learned my issues were caused by the content providers and NOT this excellent little devise.Well worth the cost.Sorry Apple but you loose on this one!", "verified": true, "helpfulness": "1/1", "author": "Opinions are like... \"Al\""}]