[{"rating": 5.0, "review": "Got mine today. Had it out of the box and running in fairly short order. Set up is pretty easy if you have all the current system requirements. Once it is set up just about any device that can access the same network the Chromecast is on can use it. The reason I give it 3 stars is that it is limited right now in what it can do. It will only stream what is out on the internet, not what is stored locally on your device. As for what it will stream that is pretty limited. Netflix, Youtube, Google Play Muisc, Google Play TV, and remember nothing that is stored on your device will stream even through the Google Play Apps. I do like the Cast extension for the Chrome Browser so I can stream my laptop browser screen to the TV. The does have promising benefits. Supposedly there will be apps flying off the shelf for this as the architecture is open and easy to develop for. When that happens and I start to see apps that will allow me stream the pictures and video stored on my phone and other devices to the TV I will upgrade my rating. Right now its MEH!UPDATE: There are quite a few apps available now. One of which I use to stream content from my phone is the AVIA app. I did have to spend $2.99 to unlock the feature in the app that allows streaming from my device but its there now and it works well. Since we have had the Chromecast for like 6 months now the thing its used the most for in our house is streaming You Tube videos. Which by itself is worth the price of this thing.", "verified": true, "helpfulness": "0/0", "author": "Kelly Britton"}, {"rating": 5.0, "review": "It's fantastic. I use it everyday now for NetFlix and YouTube. Best $35 i ever spent. It was well worth the wait.", "verified": true, "helpfulness": "0/0", "author": "BoricuaGabe"}, {"rating": 5.0, "review": "I originally ordered from Amazon with an unknown delivery date. I cancelled my Amazon order and ordered through Google and it delivered in a week. Know what you're getting here. Googlecast has limited functionality...at the moment. It only has apps for Google Play, Netflix and YouTube...plus anything you can play in the Chrome browser. They are working on plugins from HBOGo and Hulu at the moment and should expect a release soon. Also, I would expect some type of function to browse a local media server. Know that you're not getting everything right now and you're buying in at the ground floor, much like those of us who bought the Xoom before it had MicroSD capabilities. All of that said, what it does it does great and I will be cancelling all of my movie channels tomorrow. Netflix has a ton of movies and TV shows (plus 1 month free when you sign up), plenty for me anyway. Any others I can get somewhere else. Get it knowing it will get better in time and you won't be sorry.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was a lucky one to get the chromecast early.  It's simple enough for a non-techie to plug in and play. A+ work Google, keep innovating!", "verified": true, "helpfulness": "0/0", "author": "SJS \"SJS\""}, {"rating": 5.0, "review": "works great , all accessaries you may need are included which would cost you much if you bought them separately , all back up software are available and free for all devices, and the price is very affordable , I told my friends and many are buying it.the only thing that is not good about it is that you wait for months until it is being shipped , I'm sure its because of the big demand .", "verified": true, "helpfulness": "0/0", "author": "Ahmed Mashshay"}, {"rating": 5.0, "review": "It is simple to follow the instructions.  Just plug in and your tv functions like a browser.  Watch movies.  Listen to music.  Anything!", "verified": true, "helpfulness": "0/0", "author": "Heide Scott"}, {"rating": 1.0, "review": "I don't usually write bad reviews and I was on board and loving the Chromecast at first.I can't get this piece of trash to connect to my wifi. It connects and I watch movies and I enjoy having it and then out of the blue randomly once a week the damn thing stops connecting. I factory reset and reset my modem and unplug and replug it in and then it works...for like 3 days. I don't want to spend 2 hours fixing something that I want to use for an hour every few days. This is simply stupid. I was try to be supportive of Google and using their products because I figured they were a good company but forget this I am going to go back to running Microsoft everything.Don't waste your time and money.", "verified": false, "helpfulness": "4/9", "author": "J. Gallaugher"}, {"rating": 5.0, "review": "I pre-ordered this when I first heard about it in July, and it only arrived September 4th.After using it for a day, I can already see why people are so adamant about how amazing it is. For $35, you get a simple dongle that can literally be set up in 2 minutes, and from there can immediately start streaming Netflix, YouTube, or Google Movies / Music. It's ridiculously intuitive; the kind of thing you could give your parents and have them use with minimal instruction.App-wise, there are currently only 4 applications supported: Netflix, YouTube, Google Movies and Google Music. But that's fine by me: Google is testing the \"Chromecast SDK\" and when it's ready and 3rd parties can begin integrating with the Chromecast dongle... well, get ready for a flood of Hulu / etc support.I've already ordered another one.", "verified": true, "helpfulness": "0/0", "author": "Arron L. Washington"}, {"rating": 1.0, "review": "This product wasn't made keeping user experience in mind. Plenty of bugs, WIFI reception is bound to be a problem because this dongle has to be attached so close to the TV which is a big hub of radiation. This radiation interferes with WIFI reception and I rate it flaky at best.Google isn't known for being huge on user experience.  Setup is confusing. It took me hours to just figure out how to get chromecast to connect to my network. I started with the Ipad, it didn't work. Then I tried chrome on Linux PC, it didn't work. Then I tried Chrome on Windows 7, it didn't work. Finally, I used the Windows 7 application and it didn't work 5 times, before connecting to my home network. Phew! I consider myself an expert in technology and I had a ton of trouble, god knows how much regular folk's will suffer setting this thing up.Bottom line - if you aren't getting the free 3 month Netflix subscription with this, not worth spending $35 on this device. Go get yourself some beer and wings instead.", "verified": false, "helpfulness": "3/8", "author": "crew cut \"crew cut\""}, {"rating": 3.0, "review": "I ordered this Chromecast the day it was announced and received the 3 free months of Netflix, and I was extremely excited when it arrived, but at this point it's not as great as it can be. Being able to quickly put on Netflix on different TVs in my apartment is neat, but that's all I really do. It sort of works as my HDMI cord for now since mine broke, but it's only my HDMI cord for applications it is allowed to stream. It's cool for $35, but it's nothing to go home to mom and rave about. My roommates were completely in awe that I could control it from my iPhone though. It's an all right little gizmo.", "verified": true, "helpfulness": "0/0", "author": "Abby Buarapha"}]