[{"rating": 1.0, "review": "Received this from Amazon today and setup was very easy. Took about five minutes. Compared to Roku the picture quality is terrible. A lot of buffering. When I click the icon on my PC it takes me directly to a porn site that blinks on and off. Cannot go to anything else. Eh, no thank you!", "verified": true, "helpfulness": "4/54", "author": "SAM"}, {"rating": 3.0, "review": "This is a gud product if you are only using to stream Netflix or you tube . Although streaming from the chrome Browser is beta , I would expect a better product coming with a GOOGLE tag .Streaming any video from the browser on to the TV has serious lag and audio sync issues . Was  a total disappointment . I would retain Roku over Chromecast anyday , unless the Browser support issues have been rectified .", "verified": true, "helpfulness": "0/4", "author": "techsampler"}, {"rating": 4.0, "review": "First of all  if you got the netflix deal, this thing could be considered free. Let ignore the cost of the doggle and look at the cost of the accesories that came with it. A hdmi extender, usb charger and usb cable would cost around ~11 or more if you buy it at Best Buy or any retails. The netflix deals last 3 months, which total to 8 x 3 = 24. All these things added together already make this thing worth it. However, the functionality of the actual chromecast is still pretty lacking. I tried connecting to my computer and due to bad wifi or something, I get very bad picture quality and youtube videos lack. I rather just connect my pc to a hdmi cable and extend my screen. BEWARE if you have bad wifi.", "verified": true, "helpfulness": "0/0", "author": "Jimmy"}, {"rating": 5.0, "review": "For $35 there is no reason to not buy one of these.  The amazing thing is that it is already worth the cost, and will only get better as more and more apps support Chromecast.  Set up is impossibly easy, and it runs nearly seamlessly after the initial buffer.  For $100 I would think this thing is cool and probably never buy it. For $35 I don't see how you can pass on it.", "verified": true, "helpfulness": "0/0", "author": "BlastTyrant"}, {"rating": 4.0, "review": "The only reason I took a star off this rating is because of the lack of apps. It's not really all that surprising because it's SDK is not even finished yet so Devs can't really publish to the Play Store just yet.One of the absolute best features of this (besides the easy setup) is the chrome browser extension Google Cast. With this extension you can send anything withing a browser to the chromecast. Not only that but there is an option to send the entire computer screen over to it as well. This feature in combination with powerful applications like Plex Media Server make this one of the best Streaming Media Players around, since you can stream anything on your PC to the device over WiFi.So far only 3 official apps exist, YouTube, Google Play Music and Google Videos. One very important thing to know about YouTube is that Live channels aren't supported just yet. They all give an error when trying to cast them over.If it were not for these small issues I would totally give it 5 stars. I plan on buying  a few more to replace my Roku once more apps start appearing on the device.Feel free to ask questions on this review and I'll try to respond to as many of them as possible.", "verified": true, "helpfulness": "0/0", "author": "Luis O. Dasta \"lando786\""}, {"rating": 5.0, "review": "This little dongle is pretty amazing, it does it's job and does it's job very well. For those of you out there wondering how worth it it really is with it being so limited you have to understand it's well worth it and won't be limited for so long. This little dongle only requires developers to add a few lines of code to make their apps work with the Chromecast and with such wide adoption by consumers developers will be getting on updating their apps very quickly.Streaming content from an Android and iOS device is very easy, BUT it cannot stream local movies or music! Only music from Google Play Music, and videos from Google Play, Netflix, and YouTube are supported right now. That is only for Android and iOS though. On a computer you can drag any movie stored on your hard drive into the Google Chrome window, Chromecast (or Google Cast) the tab and it will play it. You can even cast your entire desktop though this is still an experimental feature.One of the coolest features of this is with iOS and Android streaming it isn't actually \"streaming\" it is actually casting. What happens is the Chromecast will look up your content from YouTube or Netflix (so far) and then play it using its own Wi-Fi network, at this point your device becomes a remote and nothing more, you can use it just like normal. The device won't heat up or lose battery power because it isn't actually streaming the Chromecast is doing all the work.When it comes to mirroring a tab on your computer or mirroring your whole computer desktop it is streaming though, it does have to get the image from your computer so it will wear down the battery on your computer a little faster. It does have a little bit of a lag as well but software updates will soon fix that I'm sure. You can use the tab casting method to watch movies from other services besides just Netflix and YouTube with (almost) no problems. Some sites don't work and the quality may be degraded somewhat but in my testing none of that was really a problem. I don't have Hulu so I didn't test that out.This device is amazing, especially considering there is much more to come, and well worth the $35 price tag. At that price why are you even considering this? Get it now!Don't forget to let me know if my review was helpful!", "verified": true, "helpfulness": "3/4", "author": "Eric Herrera"}, {"rating": 4.0, "review": "Pretty easy setup and it works with my older Samsung mp3 player. Hopefully a majority of apps will soon be able to cast, guess we'll have to wait and see. Packaging is top rate even comes with a short 4\" HDMI male to female extension. Pretty slick device especially at the price it'll be even slicker if Google throws major support behind itPS After over a week with my Chromecast I can tell you Roku has nothing to worry about I mean Cast works but is definitely a work in progress. I'm keeping it for travel and You Tube since Roku can't get UT on their box. Chrome's interface with NF is a joke tap tap tap tap and nothing until finally it wakes up same annoying NF delays using Nexus or Samsung devices. You Tube interface is better.", "verified": false, "helpfulness": "0/0", "author": "Goodfella"}, {"rating": 4.0, "review": "When you stream media to this device Google calls the process Chromecasting. You can Chromecast from a Chrome browser by installing the Chromecast extenstion available for free on google site. I found the instruction very easy to follow and the device was installed in a couple of minutes.Chromecasting from my personal Iphone4s and my work phone Samsung Galaxy S4 was easy and quick. The video stream was uninterrupted and just plain smooth. I did try streaming unsupported sites such as hulu from several laptops in my home. I found when streaming these unsupported sites the streaming flows through your computer as opposed to Netflix which streams directly to the ChromeCast HDMI player. This means of the four laptops I tested from only our homes newest computer an HP Envy 15t running Windows 8 with an Intel Core I7 processor and 12gb of ram was able to stream video smoothly the rest of our older computers had varying degrees of success. So as expected the older the computer the worst the video stream but I want to reiterate this is not a problem on supported sites such as Netflix.", "verified": true, "helpfulness": "0/1", "author": "Sal S."}, {"rating": 5.0, "review": "Thought I would need a new TV, but with this little dongle, I can now watch netflix and youtube on my 6-yr-old TV. And for $35 it's a steal!!", "verified": true, "helpfulness": "2/3", "author": "EyeBoughtIt"}, {"rating": 5.0, "review": "In less than two minutes I was up and running. The device turns my TV on and works flawlessly - it's simply amazing!I've read tons of review from those who don't quite understand the product. Here's the thing - I have a smart TV, I have a Roku, and I have a Google TV... they all can stream YouTube and Netflix. But which one is best? Without question the Chromecast blows them all out of the water - I don't have to learn to use a new menu; the same menu I use on my phone and tablet is what controls this little device... perfectly!I've heard some say \"It only works with Netflix and Youtube, and Google Play, and Google Play Music, - but I don't think they see that this device is brand new and is being promoted heavily.The code to make an app work with this device is extremely short.... there will be HUNDREDS of apps coming on line - there simply is NO GOOD reason for developers not to add this little bit of code to their applications. HBO GO, Pandora, Songza, and on and on and on WILL come on board. There is simply no reason they won't.For 35.00 you will have the easiest, cleanest, and best experience ever!", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer"}]