[{"rating": 5.0, "review": "I am sure this is a great product; we do not have the proper adapters on our television to hook this up.", "verified": true, "helpfulness": "0/0", "author": "Amy Nelson"}, {"rating": 1.0, "review": "Our Chromecast works some of the time with some or our video sources and some of our devices. But never with all of them. One week it suddenly errors on a particular TV that had worked OK.  Then the next week it stops working with a source like Netflix or BBC iPlayer that had until then worked perfectly well.  Last week my Android device lost its ability to cast, despite the fact that I had not updated it in any way whatsoever.I can only assume that Google keep meddling with the firmware, creating another ten problems for every one they solve.I advise you not to waste any money on this technology until it becomes mature and stable. I am returning mine for a refund - and if they refuse, it might grind the thing under my heel. We waste HOURS trying to get this useless thing to work.", "verified": false, "helpfulness": "0/0", "author": "guitar"}, {"rating": 5.0, "review": "Cant beat the price for the features. Love using this with my phone/tablet/chromebook/PC. As more and more apps continue to gain Google cast support, my love for the Chromecast only grows. I use Netflix, Hulu Plus, HBO Go, ESPN, and casting tabs from desktop.  I have no experience with ROKU, so i cannot compare but at a starting price of $35 this is not a risky purchase by any means. Works well with all devices and is easy to setup.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 1.0, "review": "I cant watch anything from my macbook:(Its very useless", "verified": true, "helpfulness": "0/1", "author": "Gryzli"}, {"rating": 5.0, "review": "stream pandora to your TV for parties and the like, cheap and easy to use. don't bother with the fancier (more expensive alternatives)", "verified": true, "helpfulness": "0/0", "author": "wmitchell"}, {"rating": 5.0, "review": "wonderful but wating for more!!", "verified": true, "helpfulness": "0/0", "author": "Michel Cepeda"}, {"rating": 5.0, "review": "Great and inexpensive compared to other streaming players.  Will play just about anything and is constantly being updated.", "verified": false, "helpfulness": "0/0", "author": "Derek Clark"}, {"rating": 4.0, "review": "It was okay.", "verified": true, "helpfulness": "0/0", "author": "chiefmac \"chiefmac\""}, {"rating": 2.0, "review": "If you have a Mac computer don't waste your time get an apple TV it's way better. But if you don't it is a good product. I just hate the delay though.", "verified": false, "helpfulness": "0/0", "author": "Randy"}, {"rating": 4.0, "review": "Fun for video apps", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"carol\""}]