[{"rating": 1.0, "review": "It cuts off a lot. Try to use it with VUDU movie app with my Asus rt-ac68u Router but it buffers a lot. It works a little better with NETFLIX.  Nobody live on Google so you can talk about the problem you are having. The only  thing I like about chromecast is the graphic still photos they have on my TV screen. Overall chromecast is a great idea, but for $35 you get what you pay for.", "verified": true, "helpfulness": "0/1", "author": "Stephen linton"}, {"rating": 5.0, "review": "It works  great  so far but I wish  they had written  instructions with it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "the best gadget for my tv!!! makes msy tv smarter....", "verified": true, "helpfulness": "0/0", "author": "lemuel magaso"}, {"rating": 5.0, "review": "What not to like.", "verified": true, "helpfulness": "0/0", "author": "a reader \"areader\""}, {"rating": 2.0, "review": "This product glitches constantly. The audio cuts out randomly, and hulu just crashes and starts playing on my phone. Occasionally the video gets pixelated. Netflix works slightly better but still has issues. Definitely not worth the $30 I paid for it. Save your money and by an apple tv...", "verified": false, "helpfulness": "0/0", "author": "janice"}, {"rating": 5.0, "review": "Love it works great was easy to set-up and to use! I am super happy with my purchase!", "verified": false, "helpfulness": "0/0", "author": "Heart Felt \"emy\""}, {"rating": 5.0, "review": "Works great and now I can watch Netflix and other programs on my TV.  Works just like its advertised.", "verified": true, "helpfulness": "0/0", "author": "Diana Perez"}, {"rating": 5.0, "review": "This thing is awesome! You can cast practically anything! It is very responsive. I have had it for a few months now and I love it. I am going to get another for the living room even with an Xbox one.", "verified": true, "helpfulness": "0/0", "author": "Xavier Alvarez"}, {"rating": 1.0, "review": "Sucked.", "verified": false, "helpfulness": "0/3", "author": "kyle burdick"}, {"rating": 5.0, "review": "It's a Chromecast. What more needs to be said. It just works and works well.", "verified": true, "helpfulness": "0/0", "author": "Tri-State Tech \"Tri-State Tech Consulting\""}]