[{"rating": 1.0, "review": "couldn't get it to work", "verified": true, "helpfulness": "2/4", "author": "Sam Bradshaw"}, {"rating": 5.0, "review": "I love my Fire TV, I also bought a Fire Stick I can take with me. I've never used anything like this before, and I found it makes it very easy to access lots of media content, including Netflix and Amazon video. I'm very selective on my TV watching and this makes it easy to find exactly what I want to watch when I have time to watch it.", "verified": true, "helpfulness": "0/0", "author": "CV"}, {"rating": 5.0, "review": "We like it very much, but there are a few glitches with Sling, which we purchased as part of Amazon Fire TV. For one, when I tried to go on Sling the first day, it didn't recognize the email we used when we paid 3 months in advance, so I had to give them another email and pay another $20. Also, often when we are watching a program, it will suddenly shut down, which is annoying. The best part of Amazon Fire TV is getting rid of satellite TV programming and charges and having a larger selection of movies and TV programs.", "verified": true, "helpfulness": "0/0", "author": "Joseph P. Reynolds"}, {"rating": 3.0, "review": "It is OK.. not all features works outside US.", "verified": true, "helpfulness": "0/2", "author": "Marcos Ch"}, {"rating": 5.0, "review": "Really Like it a lot. For some reason it does not automatically go into sleep mode after 30 minutes like it should. I just get in the habit of going to settings and putting it to sleep when I am done for the day.", "verified": true, "helpfulness": "0/0", "author": "Henry T. Wheeler Jr."}, {"rating": 5.0, "review": "very easy to hook up and programming is excellent", "verified": true, "helpfulness": "0/0", "author": "D. Rand \"Nubble\""}, {"rating": 5.0, "review": "Arrived as advertised. Happy with purchase. Would recommend product to friends.", "verified": true, "helpfulness": "0/0", "author": "Stephen F. Marra"}, {"rating": 4.0, "review": "This darn thing works great, best picture cuality ever, I like it very much.", "verified": true, "helpfulness": "0/0", "author": "Manuel A. Perez"}, {"rating": 4.0, "review": "Enjoying this box and the Prime TV service. Very easy to use - just wish that there was a way to a) hook up an external keyboard and b) attach a USB hard disk so I could play my music files over the box. Maybe someday?", "verified": true, "helpfulness": "0/0", "author": "Michael Goldstein - AlbumCoverHallofFame"}, {"rating": 5.0, "review": "Awesome Product.  My family has greatly enjoyed the Amazon Fire TV.  We have a couple of Chrome Cast that I kept for the workout room so I can caste from my phone, but found the Amazon Stick and Fire TV to be easier and more versatile to use.  We bought the Amazon stick for our bedroom and have the Amazon Fire TV in our living room.  We shared this with my extended family and now all of them have Amazon Fire TVs and are enjoying them immensely.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"tah565\""}]