[{"rating": 5.0, "review": "I use this daily!  It is way more useful that I had ever imagined, and is constantly getting updates and more apps.", "verified": true, "helpfulness": "0/0", "author": "Jacob Green"}, {"rating": 5.0, "review": "This works great for watching my netflix on my big screen TV as opposed to my iPad. Easy setup as we'll.", "verified": true, "helpfulness": "0/0", "author": "R. Rodriguez"}, {"rating": 5.0, "review": "Enough people have reviewed this by now. It's certainly one of the cheapest options for getting netflix to your TV", "verified": true, "helpfulness": "0/0", "author": "wealy"}, {"rating": 2.0, "review": "Simply doesn't work very well.The initial set-up for the device is very easy. It comes with a USB cord because apparently the HDMI port can't power the chromecast or something? I don't know. So anyway you need to have a USB port on your TV or else you'd have to plug it into the wall. Not a big deal. However, the streaming is such bad quality that it makes it nearly impossible to watch without having to fidget with your computer. Youtube, Netflix, whatever... None of them work well. There are constant interruptions in the connection, or sometimes it just randomly disconnects and I have to reconnect it only for it to happen again 10 minutes later. It's a fun concept on paper, but doesn't translate well. My recommendation is to just save your $30 and hook up your computer directly with an HDMI. No interruptions, no disconnects, no lag, and it's so much cheaper. And for you people who want to cast directly from your smartphone, get one of those big ass android phones. Thing could be a TV anyway.", "verified": false, "helpfulness": "0/1", "author": "daniel miyake"}, {"rating": 4.0, "review": "I have two of these now.  Using this with Hulu plus and Netflix enabled me to turn off my regular cable subscription, save about $1,000 per year and still deliver everything my family wants to see (any more).It does require people to be a little more tech savvy.  Setup was easy but using the apps (Netflix, Hulu, Chrome browser etc.) takes some getting used to and so I wouldn't recommend it for older people or people that are technically challenged.  But you're 11 year old will absolutely be able to show you how it works.", "verified": true, "helpfulness": "0/0", "author": "Wolf"}, {"rating": 5.0, "review": "Excelent.", "verified": true, "helpfulness": "0/0", "author": "Sofía Rabellino"}, {"rating": 4.0, "review": "Still needs some work but Google is quickly becoming my favorite streamer. I can take it anywhere with me and I use plex/netflix and other apps to stream my media across at home or on the go. The only issue ive run into is if your using a sound bar with optical connections it can cut the sound out if the media goes quiet for a few seconds. Then it kicks back in.", "verified": true, "helpfulness": "0/0", "author": "Chad R."}, {"rating": 1.0, "review": "What a joke! Google should have stayed with the idea of the Google TV! I have one of each and I only regret buying this stupid dongle.", "verified": true, "helpfulness": "1/2", "author": "C. Sellers"}, {"rating": 2.0, "review": "I already had a Roku so this purchase never made sense for me in the first place.  I'm very disappointed that it doesn't work with Google's own Android Chrome browser. Very warm when in standby mode.I originally hoped for lots of updates to add features in the future, but it's been a long time since it was introduced and I've given up on that idea.", "verified": true, "helpfulness": "0/0", "author": "Older, not necessarily wiser"}, {"rating": 5.0, "review": "I really love this gadget, so freaking useful, works like a champ, and its getting a lot of apps in the android market lately, and the price is so good", "verified": true, "helpfulness": "0/0", "author": "Fabian Alejandro Fariñas Gil \"Fabians19\""}]