[{"rating": 5.0, "review": "Works like it should, and a great value.", "verified": true, "helpfulness": "0/1", "author": "KLR"}, {"rating": 5.0, "review": "It is awesome amazing.  Now we can watch movies from my laptop in HD.", "verified": false, "helpfulness": "0/1", "author": "Juan jose rubio"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Donna Metcalf"}, {"rating": 5.0, "review": "This is the best thing for those of us too cheap to set up cable on multiple tvs, or too lazy to put the game console on to pull up the apps.  It can stay plugged in at all times so you can switch to chromecast whenever.  I must also mention that it is FANTASTIC for playing ambient music from your Google Playlist when you are getting ready to go out or having a party.  Chromecast, yes.", "verified": true, "helpfulness": "0/0", "author": "greengoddess02"}, {"rating": 4.0, "review": "The chromecast is definitely my favorite streaming device simply because it doesn't have much of a physical profile. I'm usually cramped for space near my TV's so the ability to just plug something into an HDMI slot and not have to make room for it near the TV is crucial for me.Usually works well with the Chromecast compatible apps on my phone and makes it a lot easier to navigate exactly what you want to get to. This will be a problem if you're buying for a less tech savy user, they will likely miss the inclusion of a basic remote that simplified input methods.", "verified": true, "helpfulness": "1/1", "author": "Mike Babineaux"}, {"rating": 2.0, "review": "never worked!", "verified": true, "helpfulness": "0/0", "author": "snowsurfer"}, {"rating": 4.0, "review": "I am able to cast what is on the internet thru Chrome with little or no effort.. Most depends on the computer you own as if you want to stream a show, it has to be able to do this task. Chromecast only reflects the out put of your computer or other device you use. I have two laptops. One new and the other about 4 years old. The 4 year old laptop almost could not handle the stream at times where as the new one I did not have a problem.. I used the same movie..", "verified": true, "helpfulness": "0/0", "author": "William H Lapeer"}, {"rating": 4.0, "review": "Overall its pretty good streams well but only if we are casting real good blue ray content or dvd content and internet is very good.Otherwise the content is not casting well.", "verified": true, "helpfulness": "0/1", "author": "prash4u8019"}, {"rating": 5.0, "review": "Anything we expected, excelent solution for home entertainment", "verified": true, "helpfulness": "0/0", "author": "Gerson Alvarado \"Geralvaco\""}, {"rating": 5.0, "review": "Very easy set up. Works great. I have had a Roku for 4 years and I love this one. I can control from my iPhone!", "verified": true, "helpfulness": "0/0", "author": "kp"}]