[{"rating": 5.0, "review": "great investment!", "verified": true, "helpfulness": "0/0", "author": "CHARLES J MURPHY"}, {"rating": 5.0, "review": "Amazon Fire TV is AMAZING!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Eric Gunderway"}, {"rating": 5.0, "review": "Easy to install...even for a non-techie novice. Easy to use.  I wish all my remotes were as simple and intuitive as Amazon's! Works well. Still exploring capabilities with Prime video. But I love it!!", "verified": true, "helpfulness": "0/0", "author": "NanC"}, {"rating": 4.0, "review": "Please expand voice search capability. Fast few bugs. No Facebook 😟", "verified": true, "helpfulness": "0/0", "author": "Hashani Perkins"}, {"rating": 4.0, "review": "Needs high speed internet access. Works good", "verified": true, "helpfulness": "1/1", "author": "Miles K Sovereign"}, {"rating": 5.0, "review": "The choices are fantastic. Being a Prime member makes the difference. You need to go Prime. It's worth it. Voice command remote is outstanding. As long as your mouth is not full of food or gargling mouthwash, your voice command selection will be spot on every time. Quad core processors make the difference. This tiny black box screams between menu selections and produces  super quality resolution. Buy the $6 Amazon HDMI cable. It really makes the difference. Amazon Fire TV is way ahead of the competition.", "verified": true, "helpfulness": "0/0", "author": "D. Murphy"}, {"rating": 5.0, "review": "We love our Amazon Fire TV! I have three boys that are 13, 11 & 8. They said, \"Let's get rid of our cable!\" Say no more, cable is gone. They are huge sports fans & don't want to miss a game & keep up with their fantasy football. Amazon Fire meets all their needs & mine. Get it!", "verified": true, "helpfulness": "0/0", "author": "N. Bratrud \"jackntomsmom\""}, {"rating": 5.0, "review": "Flawless performace... Awesome wireless... Beautiful picture. I love this little device.", "verified": true, "helpfulness": "0/0", "author": "Radwan Ghamrawi"}, {"rating": 5.0, "review": "Great, works easily, quick.  We love it!", "verified": true, "helpfulness": "0/0", "author": "Maria Kosowsky"}, {"rating": 4.0, "review": "We use it daily, but sometimes the sound gets distorted and once we unplug the power cord and then plug it back in the sound works fine.", "verified": true, "helpfulness": "0/0", "author": "Michael Gaewsky"}]