[{"rating": 5.0, "review": "very useful tool when watching movies or your favorite TV shows", "verified": true, "helpfulness": "1/1", "author": "Ronnie McGee"}, {"rating": 5.0, "review": "Great priduct. But you have to know how to maje it fit your needs.", "verified": true, "helpfulness": "0/0", "author": "Orna Nosrati"}, {"rating": 5.0, "review": "it is so easy plug and do a little downloading which it does for you and you have tv. the only thing is the Korean drama my wife likes to watch,it has to many breaks in the shows,you will watch for five minutes and get 10 minutes of commercials", "verified": true, "helpfulness": "0/0", "author": "bruce rankhorn"}, {"rating": 5.0, "review": "Worked perfectly. Would highly recommend.", "verified": true, "helpfulness": "1/1", "author": "dusty"}, {"rating": 5.0, "review": "This is an awesome product that interfaces directly into my home automation system. I was going to go back to Amazon and buy one for each TV, but when I went back to buy 3 more, they are no longer available??? What gives?", "verified": true, "helpfulness": "1/1", "author": "Dickie"}, {"rating": 5.0, "review": "I am a Prime member and this device has tied it all together. Thank you Amazon for your excellent product and service.", "verified": true, "helpfulness": "1/1", "author": "Jim Hogue"}, {"rating": 5.0, "review": "Great!!!!", "verified": true, "helpfulness": "0/0", "author": "kara"}, {"rating": 5.0, "review": "It's really great! I love my fire tv. I can order movies, tv shows and with my Prime membership I can select tv & movies that I like for free. Just awesome.", "verified": true, "helpfulness": "1/1", "author": "DW"}, {"rating": 2.0, "review": "Quite disappointed with the content available. I have a Prime Amazon subscription and most of the movies and shows you can watch are available on Netflix. Most of best movies and shows available cost extra.", "verified": true, "helpfulness": "1/1", "author": "Eduardo Melnik"}, {"rating": 1.0, "review": "If amazon would have added a key board I would have rated 4-5 star. Also it is so limited with what you can do with it. I wouldn't recommend for their offering price.", "verified": true, "helpfulness": "0/1", "author": "Bennett Koch"}]