[{"rating": 5.0, "review": "Worked as promised.  Just plug & play.  Since I bought it from Amazon directly, it was already configured to my Amazon account.", "verified": true, "helpfulness": "1/1", "author": "Doug M."}, {"rating": 5.0, "review": "About as good as it gets, I have used other streaming players and this simply blows the competitions doors off.", "verified": true, "helpfulness": "1/1", "author": "John W."}, {"rating": 5.0, "review": "OK, take this from a lover of all things Apple... This is really a great TV box. The software is admittedly new, but is already pretty darn good, especially for a first-generation device. I have two non-smart TVs. For one, I have an Apple TV, which is untouchable due to the Airplay and iCloud features... if you are invested in the Apple ecosystem at all, you need at least one Apple TV in your house for this reason. For the other TV, I used to have the latest and greatest Roku (Roku 3, I think it was... I can't tell now because I hit it with a hammer too many times). That was my second Roku, bought to replace my first one which had a terrible problem where it was somehow injecting a constant hum into my sound system. The new Roku had no hum, and performed quite well, except IT WOULDN'T STAY CONNECTED TO MY WIFI NETWORK. It was the most frustrating thing ever, and I tried every single solution I could think of, even changing encryption and channels on my wireless router about 10 times. I was resetting everything on a nightly basis to get it to work, and even that only worked half the time. I finally got just too frustrated, and demolished the Roku 3, and now I will never purchase a Roku device again.Anyways, on to the device that I'm supposed to be reviewing. The Amazon Fire TV went on a cyber monday sale for half price, and I must say it was a steal at that price. It came setup with my Amazon account already, which was nice and convenient. The WiFi performs as good or better than the Apple TV, and lightyears better than either Roku before it. I have not had any connectivity issues with it, except in WatchESPN, but I'm pretty sure that's an ESPN problem. It is the fastest by far at loading videos. Amazon videos somehow start playing instantly (it's like magic, I swear), while videos from other sources take a few seconds at most to begin playing. The remote is good, but not great. The voice search is also very good, but I wish it could reach into more apps. Gaming is nothing special, but this would be an easy and cheap way to trick young kids into thinking you bought them a real gaming console. I like how slim the box is... for a wall-mounted TV it would be preferable to mount to the back of the TV itself, since the remote does not require line of sight to function. The packaging was very nice, even better than typical Amazon stuff in my opinion. I have not had a single hiccup with the software... no bugs, no freezes, no crashes. Honestly, if it weren't for the Airplay and iCloud integration I mentioned above, I would probably replace my Apple TV with another one of these. Sure, it prioritizes Amazon content over other content, but I don't hold that against them. It is still just as easy to access Netflix on this device as on anything else.", "verified": true, "helpfulness": "3/3", "author": "Steven Hughes \"ReturnZero\""}, {"rating": 5.0, "review": "This is amazing and fun to look at my stuff on the big screen, thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Cornelia L Rogers"}, {"rating": 5.0, "review": "Awesome, fast as fast can be.", "verified": true, "helpfulness": "0/0", "author": "Kyle Anderson"}, {"rating": 3.0, "review": "System froze all the time have to reboot it every time. Finally have to exchange the device. Not very impressive.", "verified": true, "helpfulness": "0/0", "author": "Vi Trinh"}, {"rating": 3.0, "review": "Doesn't have an intuitive UI and difficult to use apps", "verified": true, "helpfulness": "1/1", "author": "Chintamani Kurse"}, {"rating": 5.0, "review": "I love the easy access to Amazon video product on my TV screen. The quality of the presentations is outstanding.", "verified": true, "helpfulness": "0/1", "author": "Robert B. Miller"}, {"rating": 1.0, "review": "Cannot get it to work any more.", "verified": true, "helpfulness": "2/4", "author": "Tita"}, {"rating": 5.0, "review": "insignia", "verified": false, "helpfulness": "0/1", "author": "claudiaromero517.cr@gmail"}]