[{"rating": 5.0, "review": "All day viewing and re-viewing cool for kids and adults alike.", "verified": false, "helpfulness": "0/0", "author": "Tiyanna \"Everyone has to have that \"Thing They Love!\" This is how I find and keep up with mine!\""}, {"rating": 5.0, "review": "Very best for who don't have a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Glauco"}, {"rating": 3.0, "review": "Works as advertised.  Not for high speed internet. Seems to lag.", "verified": true, "helpfulness": "0/0", "author": "Matthew W. Conley"}, {"rating": 5.0, "review": "Excellent!!", "verified": true, "helpfulness": "0/0", "author": "Fiorela Dinverno"}, {"rating": 5.0, "review": "We have these on every tv. More and more support for these.  Love them.  Easy to use and work great.", "verified": true, "helpfulness": "0/0", "author": "Carter"}, {"rating": 3.0, "review": "Works ok for YouTube but not genvideos.  Pretty easy set up on desktop computer.", "verified": false, "helpfulness": "0/0", "author": "Amy Jackson"}, {"rating": 1.0, "review": "Hated it.  Not comparable to a Roku or Apple TV (which is also not comparable to a Roku).", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "I have two of these devices and they worked great until an update around Sep. 9, 2014 (Build 19084).  There have been lots of complaints about the update (search for \"chromecast build 19084\").  Since it's been only a week, it's too early to see what Google will do, or if it's really a Netflix problem, but I won't buy another Chromecast until it's fixed.  That said, both Chromecasts stream perfectly, but the iPad or iPhone we use to control it (stop, start, back, forward, etc.) somehow gets disconnected from the stream, so the stream just continues until you power cycle the Chromecast.  Google may have also dropped support for older devices like the original iPad and the iPhone 4, which worked with Chromecast until this new software update, but don't work with it after the update.  Stay tuned for the next software update.", "verified": true, "helpfulness": "0/0", "author": "gb"}, {"rating": 4.0, "review": "sometimes there is connection issues i wonder if it is an isolated issue.", "verified": true, "helpfulness": "0/0", "author": "Sabindra Pradhan"}, {"rating": 5.0, "review": "best thing since television", "verified": true, "helpfulness": "0/0", "author": "wayne L. minear"}]