[{"rating": 5.0, "review": "I am very happy to get this Fire TV. Specially for my son, after coming back from school he used to start his TV right away, without finishing his homework,Now, Fire TV solved my problem because my son can watch his videos any time whenever he wants. Now he , himself finishes his homework first than like to enjoy his videos , games...... etc.", "verified": true, "helpfulness": "0/0", "author": "Lajkalra"}, {"rating": 5.0, "review": "I am loving this after turning in my cable boxes and saving $150/month on TV.  The box works great.  I haven't had much luck with the voice control but I think I need practice with it.  My adult children have them and don't have trouble with it.  I got this half price but subscribing to Sling TV.  It also is synced to all my Amazon services, Prime, music etc...can do it all on the TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"The Queen of it ALL\""}, {"rating": 5.0, "review": "This is the one you're looking for. Look no further this box is the perfect companion for all your movie and tv apps.Quality. Get one today I have 2, one of them is installed on a \"smart tv\" because it's WiFi was no good, the Fire Box took care of all issues.", "verified": true, "helpfulness": "0/0", "author": "Russell Hassell"}, {"rating": 5.0, "review": "Easy to use and I have been happy with its performance", "verified": true, "helpfulness": "0/0", "author": "Christopher J Hansen"}, {"rating": 5.0, "review": "Vera Nice", "verified": true, "helpfulness": "0/0", "author": "Eddie"}, {"rating": 5.0, "review": "Quick and reliable", "verified": false, "helpfulness": "0/0", "author": "John W."}, {"rating": 5.0, "review": "Love love love....so this is what love is. Streams well using the cat5 connection. Has some problems with streaming HD via wireless, but everything I have has the same problems. No, it's not my router (have tried 3 different brands). But I know several others who have issues with streaming HD. So decided to do the hardwire thing and is well. Wifi is great when you have no other option, but if you have access to the \"wire\", that's the way to go.", "verified": true, "helpfulness": "0/0", "author": "powmaster"}, {"rating": 2.0, "review": "Navigation in Hbo ( sling) is terrible", "verified": true, "helpfulness": "0/1", "author": "Hasan Aker"}, {"rating": 4.0, "review": "I like many things about the Amazon Fire TV. It is fast, has excellent HD, and the remote is user friendly. The sound is extremely quiet. I have a competitors product that also has some nice features but the definition is not nearly as good and it has a loud hum on audio. The optical output on the Fire TV worked perfectly and sounds great. I do miss Acorn TV. We enjoy British Television so we watch it often. That is what I miss most on Fire TV. Except for that, it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Bob D"}, {"rating": 5.0, "review": "Simple installation .. Works perfectly..", "verified": true, "helpfulness": "0/0", "author": "Ronald E. Stewart"}]