[{"rating": 5.0, "review": "Fantastic...Very easy to install & set up....Great product...", "verified": false, "helpfulness": "0/0", "author": "JTK"}, {"rating": 5.0, "review": "Best investment for my tv in a minute.  Makes viewing things from my phone, computer and tablet onto my tv easy and enjoyable.", "verified": true, "helpfulness": "0/0", "author": "matthew nixon"}, {"rating": 5.0, "review": "I thought this would be redundant, as I already have an old lap top connected to my TV for watching netflix and Google movies, but the smart phone netflix interface is actually better than the computer one. Now I want to buy another one for my downstairs TV.", "verified": false, "helpfulness": "0/0", "author": "Paulrik"}, {"rating": 5.0, "review": "We Love Google Chromecast it works  well  with our Flat screen TV  and  we are able to watch our favorite shows online.", "verified": true, "helpfulness": "0/0", "author": "Adrienne Bertrand"}, {"rating": 2.0, "review": "Skipping video streamed from the web possibly due to wifi traffic. Low quality picture on a 1080p screen. Resolution issues. Add to that the fact that my internet provider has deemed it acceptable to block video streams from broadcast websites like CBS and this thing is just a dust cover for an HDMI port", "verified": true, "helpfulness": "0/0", "author": "anymouse \"S\""}, {"rating": 4.0, "review": "Not 100% happy with it, but for $35 its a good deal. I'd like it to stream more than just those things that Chromecast apps allow you to stream.  That's why I bought into the Kickstarter campaign for the Mozilla Matchstick a couple of days ago. For $18, the Matchstick promises to stream a wider variety of video products.", "verified": true, "helpfulness": "1/1", "author": "E. Wisekal \"OCD on my good days\""}, {"rating": 1.0, "review": "Very limited in what works with iPhone.  Save your money.", "verified": true, "helpfulness": "0/2", "author": "Mo2Tex"}, {"rating": 5.0, "review": "great for the old tv", "verified": true, "helpfulness": "0/0", "author": "Adrian"}, {"rating": 5.0, "review": "Great product.  I use it all the time", "verified": true, "helpfulness": "0/0", "author": "Julie Sharman"}, {"rating": 5.0, "review": "Love our Chromecast - and a fraction of the cost of most other casting hardware", "verified": true, "helpfulness": "0/0", "author": "Hfrnxmd \"R. Hench\""}]