[{"rating": 4.0, "review": "Now I can stream movies from Phone, tablet and laptop to the TV over wireless connection. Also keeps the devices available for use while the movie is being played on TV.", "verified": true, "helpfulness": "0/0", "author": "ITGuy2010"}, {"rating": 5.0, "review": "This is an excellent product for the price with the potential of being enormous. Setup and using is super easy. Love the fact that I can access youtube, netflix, songza, etc on my phone and cast it to my tv with ease, with also casting webpages to my tv via chrome browser. Can't wait to see the progress this player makes thoughout the years when new applications and advance technology.", "verified": true, "helpfulness": "0/0", "author": "Corey J Plant"}, {"rating": 1.0, "review": "On my setup, the device was plagued by constant signal dropouts.  I couldn't get a video to run for more than a few seconds without  buffering or freezing, whether the source was Netflix, HBO Go, or YouTube.  My wif-fi signal is not the problem, as I can stream Netlfix and other video sources through my wireless Blu-Ray player or on my iPad.", "verified": true, "helpfulness": "1/1", "author": "GG \"GG\""}, {"rating": 5.0, "review": "I am so glad to have ordered this.  It was easy to set up, and I enjoy being able to watch my Hulu Plus shows now instead of on my little iPad, but on my 47\" TV!", "verified": true, "helpfulness": "0/0", "author": "davidln1"}, {"rating": 3.0, "review": "My daughter loves it because she can watch her Littlest pet shop videos from YouTube onto the Big Screen.  So for her its great.  I have not yet learned how to do what I want with it so for me its just ok.  Once I figure it out I'm sure I will upgrade my review.", "verified": true, "helpfulness": "0/1", "author": "Lawrence W."}, {"rating": 4.0, "review": "Its a great product and I have been using it with zero problems. Tab casting and inability to play local media are  the only downside to this media player.", "verified": true, "helpfulness": "0/0", "author": "DB"}, {"rating": 1.0, "review": "All you have to do is plug it in the back of your TV and login. But, the rate of rate of the visual transfer is slow and not in sync with the audio, which throws you off as you're watching. A hard wired connetion through your computer works better. It is OK at best but not great.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I gave this 5 stars because it does exactly what is says it would and it is really easy to set up and use. I really only use it for netflix and it works great with that you just need a smart phone, tablet, or computer to control it.", "verified": true, "helpfulness": "0/0", "author": "Dale Bromenshenkel"}, {"rating": 4.0, "review": "I wish it was easier to stream directly from your computer. I have tried to download the right software so it can copy whatever is on my computer screen. But when just doing netflix or youtube it works great.", "verified": true, "helpfulness": "0/0", "author": "meagan"}, {"rating": 3.0, "review": "I should have done more (well, any) research on this before I bought it.  The directions were not terribly clear, although, we were able to figure the connections out fairly easily on our own.I was disappointed to learn that it does not pair with the Kindle Fire, and the only content available is through YouTube and Netflix.But it was not very expensive, and my husband is enjoying watching surf videos that he finds on YouTube.", "verified": true, "helpfulness": "0/0", "author": "Amanda Gallagher"}]