[{"rating": 5.0, "review": "Excellent system. As good as any smart tv app on the market!", "verified": true, "helpfulness": "0/0", "author": "Santos"}, {"rating": 5.0, "review": "Works very well I'm satisfied", "verified": true, "helpfulness": "0/0", "author": "George C. Ricketts"}, {"rating": 2.0, "review": "I found it to be difficult to make apps work, it was not what I expected when I suggested  this as a Christmas gift for my husband. I returned it and am waiting for a refund to order something else for him.", "verified": false, "helpfulness": "1/2", "author": "MC"}, {"rating": 4.0, "review": "Seriously great little device.  I own an SAppleTV, that I now don't use.  It can access Netflix, Hulu, and my Plex Media Server all from this device.  To make it perfect, you need to remove the necessity for internet connectivity to function - once this is done, its 5 stars easy!.  Games are a plus and are surprisingly a lot of fun", "verified": true, "helpfulness": "0/0", "author": "John Hardin"}, {"rating": 5.0, "review": "Love this.  We are not very up on all these new fangled things and were afraid we wouldn't be able to set it up ourselves.  Boy we wrong it was simple and we had it up and running in less than 15 min and it is so easy to access and use even for us \"older\" people that aren't up on all these new things to use .  I would highly recommend this.  If you have Amazon Prime its even better as there are way more free movies to watch.  If you don't have Prime get it, if you buy a lot from Amazon or like to watch a lot of movies it will pay for itself many times over in a year.  Amazon is always our first place to go!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "weather worrier \"cas\""}, {"rating": 4.0, "review": "Really like it. Not sure about the \"always on\" feature, and I wish it had the YouTube app, but beyond that, I'm really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "P. Harrison"}, {"rating": 1.0, "review": "We returned it due to the buzzing feedback when watching Netflix.", "verified": true, "helpfulness": "1/3", "author": "Michell Cahill \"M&m;\""}, {"rating": 3.0, "review": "The product was as described but I was disappointed that there are not more free Prime movies....most still have a charge....I don't use it very often", "verified": true, "helpfulness": "0/0", "author": "James M. Guilfoyle"}, {"rating": 5.0, "review": "I'm addicted to this.  I've forgotten what I used to watch on cable.", "verified": true, "helpfulness": "0/0", "author": "Megan Kelleher"}, {"rating": 5.0, "review": "So good I bought two!", "verified": true, "helpfulness": "0/0", "author": "Richard J."}]