[{"rating": 5.0, "review": "Worth buyingGood experienceExcellent qualityHappy to see movies , songs etc on tv without having latest tv model which have everything in built", "verified": false, "helpfulness": "0/0", "author": "Gaurav"}, {"rating": 5.0, "review": "I love it!  Not complicated to set up, worked within minutes (after updating software).  Perfect if you read the description and understand it has limited apps like netflix and youtube for watching.  HboGo works very well through this..... I hope they add more apps soon.  Showtime Anytime would be nice.... but overall, I am quite pleased with this product.", "verified": true, "helpfulness": "0/0", "author": "SubarcticJewel"}, {"rating": 3.0, "review": "Chrome is ok. Nothing to write home about. I guess for $35, it's hard to expect much. And you get exactly what you pay for. I don't like how it shows my entire browser window on the TV screen when I try to stream RedBull XCO video to the TV. I tried to use the settings to make it show only the video but it does not work. AppleTV or Roku with Plex Media Server is the better way to go.", "verified": true, "helpfulness": "0/0", "author": "The Croatian Sensation"}, {"rating": 5.0, "review": "With more and more apps on Android store, like Allcast, Avio one can also stream local media to the TV.Ensure you have wireless connection in proximity and this thing works better than any smart TV.", "verified": true, "helpfulness": "0/0", "author": "Sujana Koujala"}, {"rating": 5.0, "review": "I received this device on April 15 and set it up in 5 minutes. All you have to do is plug it into an outlet and into the HDMI input from your TV. You need a smart phone, tablet or a computer using Chrome as the internet browser, set up  by downloading the app and entering the WiFi password. Once set up, I was able to watch whatever was on my laptop. tablet or phone with a click of a button. This device makes watching whatever you want with a push of a button. I am able to watch MLB, Netflix, HBO Go, Vevo, Youtube, Amazon Prime, Hulu and more.", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "I gave this to my husband as a gift after he mentioned it. He is TV watching, internet surfing fool to where we have 2 cable services in our house. He is soooooooo happy with this gadget. You can connect your internet browser from your phone or computer and watch it on tv. I had no idea this technology existed. You do need to have a fast internet service for this to work optimally so we upgraded our speed. This is an awesome buy!!", "verified": true, "helpfulness": "1/1", "author": "Mia Morrison"}, {"rating": 5.0, "review": "I am looking for a simple way to display the streaming services I subscribe to (Netflix, HuluPlus, etc)Very simple to set up, seamless interface with my iPhone app.", "verified": true, "helpfulness": "0/0", "author": "L. MINICK"}, {"rating": 5.0, "review": "Got it looked up in the Living room. Push cast to Pandora, Youtube, Netflix, or whatever and it turns the TV on, switches to the right input and starts playing!", "verified": true, "helpfulness": "0/0", "author": "John Colpitt"}, {"rating": 5.0, "review": "It is simple to install and easy to use on your computer or ipad /kindle. I love it!!!!!! Travels easy also and you can use it in most hotels.", "verified": true, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 2.0, "review": "Not what I expected.Without wifi it is useless.No instructions leaves most clueless w/o Internet support.Waste of my money.", "verified": true, "helpfulness": "1/2", "author": "Ted Biller"}]