[{"rating": 1.0, "review": "not worth the money, as it doesn't support basic functions. like casting from one's gallery.overall better buy hdmi cable to have full capabilities of streaming.", "verified": true, "helpfulness": "1/2", "author": "Tabish"}, {"rating": 3.0, "review": "better off with a Roku, Need a fast computer to cast internet to your TV, will be better with more apps, which is the game. and Google will catch up with more apps,", "verified": true, "helpfulness": "0/0", "author": "john T."}, {"rating": 1.0, "review": "Piece of crap that needs more testing, spent 2 days with googles nonhelpdesk to get this running without success. This product is not mature and stay away from it.", "verified": true, "helpfulness": "2/3", "author": "Nilesh P."}, {"rating": 4.0, "review": "I bought it for my wife and she really loves it.  The one negative is that it does not support streaming from all media, but for YouTube videos, it works great.  The separate wire for power adds to the clutter though.", "verified": true, "helpfulness": "0/0", "author": "bbk3e"}, {"rating": 3.0, "review": "My TV is relatively old (about two inches thick!) so that standard Chromecast connection doesn't work - needs to be plugged into the wall and the TV. Have used it to watch UTube, and that was OK.", "verified": true, "helpfulness": "0/0", "author": "Loyd E. Eskildson \"Pragmatist\""}, {"rating": 5.0, "review": "Great little piece of hardware.  Easy to setup and enjoy Netflix, HULU, YouTube, etc on the television.  I just ordered another one for the bedroom tv.  No complaints.", "verified": true, "helpfulness": "0/0", "author": "UG"}, {"rating": 1.0, "review": "Do not Buy!...requires high speed inet, more than DSL can give!... loses wifi network constantly!... needs to be restarted, and reconfigured constantly!... tries to interrupt wifi connection of other devices connected!... streaming stops for \"buffering\" all the time!... limited chose of what can be streamed!", "verified": false, "helpfulness": "1/4", "author": "IK.NYC \"IK.NYC\""}, {"rating": 5.0, "review": "Price tag is just Unbeatable , device Works perfectly and of course as advertised, delivery was on perfect timing, packaging of the product was very neat and clean, super easy to install and use, couldnt ask for more, thanks a million!", "verified": true, "helpfulness": "0/0", "author": "daniel tejeda"}, {"rating": 3.0, "review": "It's very simple to start to use. Only one thing is that you need to un-plug it from your TV if you don't use it. It will interfere the TV (Samsung) reception. When you have it to plug it to TV and just watching TV, then often on the reception appears interrupted.", "verified": true, "helpfulness": "0/0", "author": "sha1123"}, {"rating": 5.0, "review": "The only downside I see in this product is that you must ALWAYS have the mobile device or computer available to get the content. There is no remote to get you into content a La Roku. But then again this device is increadibly affordable. I can cast content on my mobile and walk away or open a tab in my Chrome browser and do some other activity while the movie or video is streaming in another room (must be on the same network wired/wireless or combo doesn't matter). I've also found a way to use plex to stream local media content from my local network, great for home movies!Again, I half wish this had a remote seperate that I could browse the network from but then I guess that defeats the idea of CASTING.", "verified": true, "helpfulness": "0/0", "author": "W. Stoddard \"Certified Genius\""}]