[{"rating": 2.0, "review": "Why does Amazon sell this product when you cant even watch your Amazon Prime Videos with it.  Amazon will not stream to Chromecast.  Very dissapointed. Works well with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Sheree Shaw"}, {"rating": 5.0, "review": "well what can I say It works , i got it fast , not much else really to say .", "verified": true, "helpfulness": "0/0", "author": "rafal"}, {"rating": 3.0, "review": "Lags a bit while playing Pandora and web searching.", "verified": true, "helpfulness": "0/0", "author": "Scott Porter"}, {"rating": 4.0, "review": "Works great.  Except for the fact that you have to use your mobile device to watch anything, it works just as it is advertised.", "verified": true, "helpfulness": "0/0", "author": "Stephen Davis"}, {"rating": 5.0, "review": "Excelente producto.", "verified": true, "helpfulness": "0/0", "author": "Alvaro Augusto Rios Ayala"}, {"rating": 5.0, "review": "Handy gadget.", "verified": true, "helpfulness": "0/0", "author": "mustang man"}, {"rating": 5.0, "review": "Love this doohickey. It does what it says and it's as \"plug and play\" as any device gets. I'd recommend adding one of those 6-8\" USB power cables to your order (yes, the Chromecast needs an outboard power source) to avoid the need for a wall outlet and to cut back on cable clutter. Just be sure you'll have an unused USB port on the back of your monitor first.Beam the entertainment you're watching on your Chrome-based computer, tablet or phone to your TV for less than the price of one drink at a good restaurant.What's not a good thing about that?", "verified": true, "helpfulness": "0/0", "author": "Jim Bosha"}, {"rating": 4.0, "review": "Very perfect product. We can use android phone or ipad to control it. netfix app also can cast to TV by this device.A little bit shortcoming is that I felt the device is a little warm when the usb cable is connected all the time.", "verified": true, "helpfulness": "0/0", "author": "njxfma"}, {"rating": 5.0, "review": "great deal", "verified": true, "helpfulness": "0/0", "author": "Jose R. Tagle"}, {"rating": 5.0, "review": "Incredible product, it changed my life!", "verified": true, "helpfulness": "0/0", "author": "Pedro"}]