[{"rating": 5.0, "review": "I love this box, very fast, doesn't get hot, shipping was fast,  very pleased with my purchase!!!!", "verified": true, "helpfulness": "1/1", "author": "DavidDub"}, {"rating": 3.0, "review": "look good on beginning,but after i received and connected to the tv,the remote(amazon fire tv) doesn't control the volume,so when you want to control the volume(up or down) you have to use the tv remote,major flaw on part of Amazon Fire Tv.Call tech support,and no solution,only offer to return the unit,wich doesn't make sense.Any way ,i kept the unit to see the difference from other boxes.", "verified": true, "helpfulness": "1/4", "author": "Cristina"}, {"rating": 5.0, "review": "So far Works great.ordered it with a game controller which controls the fire tv also.very easy to use.my 8yr old dau uses it more than me.she loves the fire tv.I'm glad I bought it.the only problem I have is when I connect my kindle to the fire tv it gets knocked off after a few minutes otherwise it works great.I don't regret I got it", "verified": true, "helpfulness": "0/1", "author": "luis f"}, {"rating": 5.0, "review": "Received my fire TV a few weeks back and installed it in the den. Really enjoying the service and thinking about dropping cable.Now I want one for the bedroom.  How would that work? Would the second device mirror my den's content? Any recommendations?", "verified": true, "helpfulness": "1/1", "author": "Danny \"Danny\""}, {"rating": 4.0, "review": "The device is very easy to set up and works very well except for one small but important issue.  When the device reads personal video files that were uploaded to CloudDrive, it displays them with only the duration of the video.  The file name or video name is not displayed, even though it is part of the Cloud Drive stored information.  Photo albums are displayed with the name, but not videos.  That does not sound like a big problem, but if there are many videos and I need to select a particular one it is very difficult.", "verified": true, "helpfulness": "1/1", "author": "Dom Perignon \"Carm\""}, {"rating": 5.0, "review": "Easy setup.  Little tough getting the HBO app to work but tech support straightened it out pretty quickly.  Great product.", "verified": true, "helpfulness": "1/1", "author": "david l. krugman"}, {"rating": 1.0, "review": "Amazon Fire TV thinks I'm a Brit. Not that there's anything wrong with that in and of itself, but this has several drawbacks when it comes to using this particular device:*It wants to billl me in pounds sterling for content.*The available content appears to be that available in the UK, not in my country of residence. Perversely, this means that much UK-sourced content is not available to me on Amazon Prime video due to local licensing restrictions.*While it was nice that I was able to download the BBC iPlayer, the Beeb has my IP address sussed out as hailing fromCalifornia, not Cambridgeshire, and refuses to send me content.*There appears to be no way to reset the device to recognize my US-based Amazon account. I have deregistered and reregistered the device, but it still thinks I'm British.*I found and tried the \"phone me\" feature to describe my plight to Amazon, but as I have a US phone number that does not conform to UK Standard Trunk Dialing (or its successor technology), the screen tells me they couldn't reach me.While I have been treated to the British accent version of the welcome video, the system is proving to be, as they say over there, worse than useless. I have written this scathing review because there appears to be no other channel for delivering feedback. I do hope that someone from Amazon reads this and responds. Until then, I am finding this device to be extremely frustrating.", "verified": true, "helpfulness": "1/6", "author": "Martin Chorich \"wahnsinnig\""}, {"rating": 4.0, "review": "Relatively easy to install, streams well - no breaks or pauses.  One particularly nice feature was being able to resume a Prime video where I'd left off the previous day.  Good tool to increase the value of a Prime membership.Original remote would drain a set of batteries overnight, Amazon provided a quick replacement and return shipping.", "verified": true, "helpfulness": "2/2", "author": "J. Hill"}, {"rating": 5.0, "review": "works great!  I was streaming through my Wii and it was difficult---this works great!", "verified": true, "helpfulness": "1/1", "author": "Sue Gill"}, {"rating": 5.0, "review": "Worth the money.", "verified": true, "helpfulness": "2/3", "author": "Layne Smith"}]