[{"rating": 5.0, "review": "As stated.", "verified": true, "helpfulness": "0/2", "author": "C. Hann"}, {"rating": 4.0, "review": "Why is there no option to ask questions on this product?  I can ask questions on every other item on Amazon, but not this one.  I noticed a strange name on my router, a device called \"android-<long hex value>\".  At first I thought someone hacked my network, but then I realized it was the Amazon Fire TV.  Is there any way to give it a different name?", "verified": true, "helpfulness": "0/0", "author": "Don Merlin"}, {"rating": 5.0, "review": "I love my FireTV. This is, by far, the BEST android based media stream player on the market. It plays EVERYTHING. I have a DLNA server with numerous different codecs and have not experienced a single issue with any of my content. In addition to my DLNA server, I also use this for streameing via Netflix and Amazon Video without any issues. Lastly I have also sideloaded XBMC/KODI on this device and am quite happy with it's performance. It does crash from time to time but only in the menus, never during a stream. Kudos to Amazon for this device.", "verified": true, "helpfulness": "1/1", "author": "C.S. Fuller"}, {"rating": 4.0, "review": "Clever device, so easy to use even Gary Busey can do it.", "verified": true, "helpfulness": "0/2", "author": "David"}, {"rating": 5.0, "review": "No doubt it is better than both Apple TV and Roku.  I love the Amazon Fire. Great remote too.  Now I wish I would have waited for the Fire Stick...Oh well :)", "verified": true, "helpfulness": "0/1", "author": "DCP"}, {"rating": 2.0, "review": "The Amazon Fire TV is pretty good for consuming Amazon digital content.  It is not very good for consuming content through other providers such as Netflix and Hulu.  For example, I have had to put my Netflix credentials in repeatedly - it will work just fine for a while, but then for some reason I have to log in to the app again.  This has not happened on my Roku devices (I have a 2 and a 3).  There have also been times when the Fire TV would not open the Netflix app (long wait followed by an error message that makes it seem like a problem with Netflix), but I would bring my Roku 3 into the same room, on the same WiFi network, plug it into the same TV, and it would work just fine. Last night was the last straw - I tried to watch a show on Hulu, but there was no sound, no matter whether I exited the app and relaunched, or restarted the show, etc.  This has also happened several times on the Fire TV, but not on Roku. Even with Amazon content, I sometimes get a notification that the device can't play the requested video.  After a lot of frustration, I am done with the Fire TV, and I have ordered another Roku 3 to replace it. BTW, I have owned the Amazon Fire TV for about 7 months, so this is not a review based on a quick impression.", "verified": true, "helpfulness": "4/7", "author": "S. Stromberg"}, {"rating": 4.0, "review": "much better movie streaming than my Apple TV side by side, no interruption  Would have given it 5 stars if the gaming was better than the normal phone app gaming.", "verified": true, "helpfulness": "0/0", "author": "Donny Larsen"}, {"rating": 2.0, "review": "Apparently I was a little confused when I purchased this device.  I thought it was a further evolved way to stream content from multiple sources.  What's I've discovered is that it's a device that streams Amazon Prime content very well, and everything else is an afterthought.  Would be great if, and hopefully when, Amazon improves its content, but it's not good for Netflix.  HBOgo is still not included.  Any case, I have a smart dvd player that works the same, and wish I would have saved my money.", "verified": true, "helpfulness": "4/6", "author": "Amazon Customer \"bmacpdx\""}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/1", "author": "Clinton Sowards"}, {"rating": 5.0, "review": "Very Nice Not all locked down like appleTv. The remote is great. easy to keep kid safe. It is a steal of a deal!", "verified": true, "helpfulness": "0/1", "author": "Woodstock \"Capt.\""}]