[{"rating": 5.0, "review": "It works great so far!", "verified": true, "helpfulness": "0/0", "author": "zadea kealon"}, {"rating": 5.0, "review": "I love my google chromecast! Why spend an extra $100+ on a smart TV when you can turn any \"dumb\" TV into a full featured streaming device!I've had a Chromecast for a little over a year now and it's been the best thing for someone who cut the cable and uses online streaming services (such as Netflix and Hulu) to watch all my shows. In addition to an OTA (over the air) antenna for local news, you can truly cut the cable with a chromecast. I don't have any experience with other streaming devices, but I can say the low price tag on this google device is what drew me to it. It plays movies, TV shows, music, photos, and more without any connection issues and is very responsive. It's never crashed on me and never had an issue connecting to my wifi (although it is only 2.4ghz).The Chromecast is perfect for any living room, bedroom, kitchen or any other place you have a TV, and with the low price tag you can afford to make every TV in your house a Smart TV! One added benefit when I bought mine was that Google offered a $20 google play credit for chromecast owners, making this device almost free. Would definitely recommend to any person looking for a streaming device.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "If you're the kind of person that likes to show other people Youtube videos or marathon Netflix with friends then this won't fail you.I've had a great time with mine! Definitely a win for college life. Plus, no messy cords like HDMI to a laptop.You need to charge it sometimes but you have to do that to everything else you own.I don't think you'll regret the buy.", "verified": true, "helpfulness": "0/0", "author": "Katelyn Gray"}, {"rating": 1.0, "review": "I couldn't really do much with it due to the fact that I don't have Wi-Fi in my home. The HDMI cord works great though.", "verified": true, "helpfulness": "0/3", "author": "Tiasha"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Lisa T. Clements"}, {"rating": 2.0, "review": "This thing's great if you like watching an icon tabulating the rate at which it is loading 6-7 times per show. It doesn't seem to matter how fast your internet is.  I can certainly stream from other devices with the same wifi connection. It's also not useful for using on a wifi connection that requires verification by clicking on an agreement internet page as is common in hotels.  Clearly some room to improve.", "verified": true, "helpfulness": "1/2", "author": "Lourdemaul"}, {"rating": 5.0, "review": "good!", "verified": true, "helpfulness": "0/0", "author": "gyounngrae kang"}, {"rating": 4.0, "review": "Absolutely love using this. I use it for Hulu, Netflix, Youtube and just about anything I want from my Chrome browser.Only reason I gave it 4 stars and not 5 was because there is a problem right now with broadcasting flash videos from the Chrome browser. Google is aware of the issue and they say that they will try to fix it. Once fixed, I will change to 5 stars", "verified": true, "helpfulness": "0/0", "author": "Yourui Ruan"}, {"rating": 5.0, "review": "works well, great for viewing large size 60\" tv screen shots of the laptop,", "verified": true, "helpfulness": "0/0", "author": "jay"}, {"rating": 5.0, "review": "Something essential and must be in the presence of your TV. You can see the pictures and movies YouTube with ease.", "verified": true, "helpfulness": "0/0", "author": "Saleh Almohessen"}]