[{"rating": 2.0, "review": "Streaming from my compute( Mac) was not smooth .. Ended up with Roku stick..", "verified": true, "helpfulness": "0/0", "author": "Chandar"}, {"rating": 5.0, "review": "good ~ . use till now, but only use for youtube ...", "verified": true, "helpfulness": "0/0", "author": "Kah Hau"}, {"rating": 5.0, "review": "I love this. I actually have 2.", "verified": true, "helpfulness": "0/0", "author": "Tonja  C. Thompson"}, {"rating": 5.0, "review": "If you don't have one of these, you need to get one.", "verified": true, "helpfulness": "0/0", "author": "Tom Sayer"}, {"rating": 5.0, "review": "Very satisfied with this purchase!!", "verified": true, "helpfulness": "0/0", "author": "Larry Scheps"}, {"rating": 2.0, "review": "didn't do what I expected it to do. didn't realize I had to have a Wi-Fi connection other rthan my phone hot-spot.", "verified": true, "helpfulness": "0/1", "author": "Lawrence Miller"}, {"rating": 5.0, "review": "Setup:  Setting it up was very easy.  I inserted the dongle into an available HDMI input on my TV, the installation screen appeared on the TV with instructions, which included going to a website, it verified the connection through my WiFi access point, and that was it.  The whole thing took a minute to do.Power:  It came with a power cable (micro usb on the dongle end, a/c plug on the other end).  It also came with a HDMI extender, but I did not need that.  The dongle has a small, power/cycle button on it.Multi-User Casting:  I can cast from my chromebook, PC and android phonewhen I want to share something with others in the room. I switch my TV to the input that has the Chrome dongle, and I click a button in my browser, and there it is, for everyone to see.  When someone else with Chromcast on their device wants to cast their screen to the TV, they do the same thing, and it knocks out my cast and puts up theirs.  Then, I can cast something and knock out their cast.  We can go back and forth that way.", "verified": true, "helpfulness": "0/0", "author": "The Bings"}, {"rating": 5.0, "review": "Pretty amazing piece of equipment here. Wish that I hadn't hesitated on buying this when it first came out. Since then, Ive bought one for everyone in my family for their homes. It seems like every quarter ChromeCast is giving free promo stuff at chromecast/offers. Free movies, rentals, etc. The amount of apps that support chromecast has increased SUBSTANTIALLY. Tons to choose from. I personally like watching Comedy Central, HBO, and to project my laptop screen to my TV the most (projectfreetv). No buffering issues at all. My internet speeds are 18 down and 1.5 up Uverse)", "verified": true, "helpfulness": "0/0", "author": "Nathan \"Nathan\""}, {"rating": 5.0, "review": "Works great, packaged well and came promply.", "verified": true, "helpfulness": "0/0", "author": "SG73"}, {"rating": 5.0, "review": "two months ago I bought a ROKU 2 for use in Latin America, but not worked, but  Chromecast works great !  I no problem to view the chanels", "verified": true, "helpfulness": "0/0", "author": "Álvaro Saldarini"}]