[{"rating": 5.0, "review": "This kicks Apple TV's But_ . It works and easier to teach your non tekie friends on how to use it. Just talk into it! Done!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I bought this device discounted through a Sling TV  promotion.", "verified": true, "helpfulness": "0/0", "author": "william veling"}, {"rating": 5.0, "review": "By far the best choice for set box tv, if your thinking cutting the cord look no more and get your self a recondtioned fire tv.", "verified": true, "helpfulness": "0/0", "author": "lio"}, {"rating": 4.0, "review": "I really like the picture quality and speedy processor. It feels like a solid device, not that plastic feel like the competition. I own several Rokus and a Chrome cast. If you're into the Amazon ecosystem as I am, then it could work well for you. However, I use the USB port on my Roku often and  I watch YouTube on my TV a lot. If you're into using your external apps or the USB port to access media, then this may not be for you at this particular time. If you want Netflix, Amazon Instant Video and some games and apps, then give this a try. Did I mention the picture quality is excellent?!?!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great producted but limited  on  apps for downloading  and lack of apps store  for apps like vudu cinnamonnow and do on great for watching movie's great for downloading  amazon movie's prime great production  of the maker  of it . The true HD  video", "verified": true, "helpfulness": "0/0", "author": "sammuel  armatis"}, {"rating": 5.0, "review": "Great product, lots more to watch now!", "verified": true, "helpfulness": "0/0", "author": "Ronald E Williams"}, {"rating": 5.0, "review": "Very easy to setup and operate.  Hopefully I will be able to loose cable.", "verified": true, "helpfulness": "0/0", "author": "Bumble Bee"}, {"rating": 5.0, "review": "Fantastic", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Love my Fire TV. We watch all the time. I hate commercials and this device lets us watch lots of TV with no commercials.", "verified": true, "helpfulness": "0/0", "author": "airmech41"}, {"rating": 5.0, "review": "I love it. I can stream any and every thing from it. It also makes my tv picture quality better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]