[{"rating": 4.0, "review": "A Christmas gift for my son. He is well pleased and tells me it is functioning very well as intended.", "verified": true, "helpfulness": "0/0", "author": "Blaine A. Jackson \"arcajun1\""}, {"rating": 5.0, "review": "I like using the chromecast it is very fun and easy to use. I like using it for YouTube videos", "verified": true, "helpfulness": "0/0", "author": "brandon ara higgins"}, {"rating": 4.0, "review": "The Chromecast works as advertised and I really like it. The only reason I didn't give it a full 5 stars is because it's kind of a pain that it has to be plugged into the wall at all times.", "verified": true, "helpfulness": "0/0", "author": "Janene Jost"}, {"rating": 3.0, "review": "I bought this item excited that I could watch shows from the computer.  However, I have a slower DSL so it doesn't work. I think they should have put that on the package.", "verified": true, "helpfulness": "0/0", "author": "Linda Mcvety"}, {"rating": 5.0, "review": "Performs pretty well. Note: It does work better with Android devices than Apple, but that was to be expected, so no surprise there. Currently there are more app options for Android than Apple.", "verified": true, "helpfulness": "0/0", "author": "Chris Weiss"}, {"rating": 4.0, "review": "Great gadget!  My tv is a few years old so it took awhile to get it all connected, but then it worked great.  One thing it won't do is play your own recorded video. .. of your family, etc off your device  unkess you post it from a site like You tube.", "verified": true, "helpfulness": "0/0", "author": "Jill L. Brower \"kirbysgirl\""}, {"rating": 1.0, "review": "This product works fine only on google related sites like you tube. Tried to access other sites with googlechrome and found to have  buffering problem and casting disconnection very often. Not sure on the problem. Don't recommend this product unless you have no other option.", "verified": true, "helpfulness": "1/1", "author": "Srinivasa Venkateshu"}, {"rating": 4.0, "review": "Setting it up was not as easy as it looked, not able to setup on all devices (Kindle Fire) or computer.", "verified": true, "helpfulness": "0/0", "author": "John Gonczy"}, {"rating": 5.0, "review": "Great little gadget converted my tv to a smart one.smart device it is easy to use.A must have forgreat tvs", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 4.0, "review": "Needs to work with VPN though.  Great interface from iPHONE, Google or Windows devices.  More selection would help.  Great product for the money.", "verified": true, "helpfulness": "0/0", "author": "Tec_Chief"}]