[{"rating": 3.0, "review": "So far so good but it is missing some essential things.  For one... Music.  I want prime music!  This seems very obvious and I wonder what is taking so long to get prime music on the fire tv.Two... Casting and remote.  Where is the amazon fire tv app for my tablets and phones?  I want to be able to control it via my phone using the app and I want to be able to cast to it using my phone via the app.", "verified": true, "helpfulness": "0/1", "author": "Robert Ellis"}, {"rating": 5.0, "review": "Awesomely quick-works great!", "verified": true, "helpfulness": "1/1", "author": "Michael L. Hester"}, {"rating": 4.0, "review": "This is one of the best products out there, so many tv shows, movies, etc. The only drawback is that some older tv shows ( friends, home improvement, i am just naming these 2 as an example) cost money per episode or season(your choice)i am just saying that for those shows being older you have to buy then", "verified": true, "helpfulness": "0/0", "author": "Adriane M."}, {"rating": 2.0, "review": "I really like this device and its potential but have to wonder about a few problems. It's great for prime videos....or should I say the videos this device lets you see (150 of each genre although there are many more available that you can find with your PC). Why the limit for a device made specifically for watching those videos? Of course you can use the voice search if you just so happen to know the title of a movie that also happens to be a prime video. But I'm probably like most people in that I use my prime service to see movies that I haven't seen before.As for the gaming side: Sev Zero is truly an awesome game and alot of fun. It's pretty much instant action and the levels are relatively short. The gameplay and aiming is easy to pick up. Its really great for casual gamers like myself who just want to play a quick game after work to wind down. But where are the other games??? I mean, the gaming controller sells for $40 so you'd think they would be putting out more games customized for it. On the Amazon Game Studio website it looks like they are focusing on tablet and phone games instead. Will there be any more for the fire tv that customers buy a special controller for? Sure there are other games you can get but they are ported over and don't work exactly perfect. For example, the game Modern Combat crashes  whenever I attempt to play a multiplayer match. Is the Fire TV capable of online multiplayer? I'm not so sure because Sev Zero doesn't have a multiplayer option (I know there is an app for a separate device for a friend to \"help,\" but that's not true multiplayer). So if there isn't multiplayer then why didn't they just remove that option in the game menu for the Fire TV port. Or there could be a bug but this thing has been out for a few months now so you'd think that maybe they would fix it.So in the end I have a great way to watch my prime videos, assuming I look up the titles on my computer first and then use the voice search to get them to appear on the Fire TV. And I have 1 great game. I'm happy but waiting for more.Update: a few weeks later I started having trouble with the unit randomly restarting or going to a blank screen. Returned without problems. Will try the fire stick when that comes out.", "verified": true, "helpfulness": "1/1", "author": "radioman2014"}, {"rating": 2.0, "review": "Scrolling through the shows offered was tedious and time consuming.  I was an Apple TV user for two years and going back.  This was a big disappointment.  Who cares about the talk to remote.  Using Apple TV you can get an app for your phone and talk to it.  Amazons easy returns are always wonderful, but this product was not impressive at all.  Not to mention, the Amazon Prime Movies are terrible!", "verified": true, "helpfulness": "1/1", "author": "nw adventurer"}, {"rating": 5.0, "review": "This thing is spectacular. I have hulu, netflix, amazon prime... It's saved me about 200 a month in cable bills.WOOHOO! Thanks for the fire tv!", "verified": false, "helpfulness": "0/0", "author": "Steven Mix"}, {"rating": 4.0, "review": "The Fire TV weighs heavily towards Amazon services, not bad if you're in the Amazon eco system.  I already owned several apps upon my first turning it on, previously in the App Store as I expected. Most apps (games) played very well, even better than expected but there was one at least that crashed regularly, The Bard's Tale.  -Space was limited, would not be able to install all that I owned, even external memory would help.  -HDMI CEC was appreciated by one in the house, another thought it was a concern as it was triggered regularly during other devices usage by anyone touch a remote button at random times.  -The interface was clean, a couple of preschoolers were able to navigate it with ease in mere minutes, but too generic, Amazon Prime (again) oriented, and was not as fast as it could be.  -The size was conveniently very small, would not be surprised if I took it on travels*  -*Going to try the Nexus TV as I have returned this, I was actually going to go for the Mad Catz M.O.J.O., but the Nexus TV came up just in time.", "verified": true, "helpfulness": "0/0", "author": "Guardian4673"}, {"rating": 2.0, "review": "Worked fine for the first couple weeks, then it would no longer connect to Netflix.  That's the main thing I wanted to use it for.  I've had multiple tech support contacts with both Amazon and Netflix and even my ISP Comcast.  Nobody can figure out why I can't connect to Netflix anymore.  My other devices still work with Netflix, but not Fire TV.  It's passed the 30 day return period and the best I got from Amazon was they will continue to look into the problem.  in the meantime I have a device that it mostly useless to me.  So I guess it's back to Roku and add my Fire TV to the pile of other useless electronic junk I have in the house.  This however will be my only brand new junk in the pile.", "verified": true, "helpfulness": "2/4", "author": "Garview"}, {"rating": 3.0, "review": "I have had a lot of problems with mine. But each time, I call the Amazon helpline, and they were able to help me. What I buy another one? Probably not, but was only 99 bucks.", "verified": true, "helpfulness": "0/1", "author": "Tony Clements \"Tony Clements\""}, {"rating": 2.0, "review": "I had high hopes for the Amazon Fire TV but those hopes were quickly dashed by its poor performance. Trying to stream Netflix was an exercise in frustration since it failed to open frequently and when it worked, the streaming froze repeatedly. It could very well have been a problem with this particular unit but it's obviously not for me. Thanks for letting me try it out anyway.", "verified": true, "helpfulness": "2/4", "author": "Jaxavanna"}]