[{"rating": 3.0, "review": "Not very impressed with it though.  When I stream Netflix, the picture locks up and the audio keeps playing. Eventually the picture unfreezes, but it is very annoying as it happens frequently.  I should have bought another ROKU.", "verified": true, "helpfulness": "0/0", "author": "Kelli Heflin"}, {"rating": 2.0, "review": "I've owned apple tvs over the years and figured I should get something for my parents. Thought well, I have prime, might as well try out the Fire TV. Sadly it is just not ready.Voice search was spectacular. Understood everything said to it, and was really cool. Really wanted to keep the fire tv just for this.However, it doesn't work in apps. So no voice search in netflix or any other streaming app. I read they are opening it up to app devs, but probably a long ways off before it just works.The other issue is that while the search works great, what comes up is mostly stuff you must purchase. Even with it tied to my prime account, most of what came up required renting or purchasing, and it was not well indicated what was on prime for free vs what had to be paid for. You really had to go into the video description page to find that information out, then back to the search to move to the next video.Also, there was no way to limit all the results to only be prime videos. If that was there I would have kept it. I have prime, I have netflix. I don't want to see things I need to purchase. If I do a search and its not covered in those services, I don't want to see it. But sadly there was no option for that.Best you can do is set it to require a code to purchase anything, which while it would stop errant purchases, does nothing for usability.Remote and hardware was great, but sadly the UX is just not up to par.", "verified": true, "helpfulness": "4/5", "author": "Cory"}, {"rating": 5.0, "review": "This device is very small (which I like) and easy to hook up and use. I've had problems in the past with getting electronics to work because they instructions were so complex or lacking information, but this is eazy breezy to install and use (must have wi-fi). I purchased the AmazonBasics high-speed HDMI cable, plugged it in to the Amazon Fire and my TV, and was ready to explore the menu. I recommend Amazon Fire TV to anyone wanting to view a huge variety of movies, TV programs, listen to music, or play games on their TV.", "verified": true, "helpfulness": "0/0", "author": "Debbie L. Gallamore"}, {"rating": 5.0, "review": "Really Enjoy And Watch A Lot - Love This Listen To Music And Watch TV Shows And Movies Almost Everyday!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I was excited when I placed an order and couldn't wait when it arrived. When I received it, I hooked it up right away to my TV and here came the problem: it got connected but I couldn't register because it said \"Sign-In failed. Please try Amazon ID and password again\" it no matter how much I tried. I tried to reboot it by unplugging and plugging it back, wifi and direct ethernet connecting, I typed my password like 10 times and the weird thing is I could log in from the web site but I couldn't log in from Fire TV! It didn't even let me create a new ID! I got so frustrated that I almost threw it out of the window! I called customer service and the guy was very patient, he told me to try everything and even tried to change the new password but still, no luck! He asked for the MAC Addres but no MAC address on the box, so I have him the DNS # on the box. He tried something and voila, it worked! What happened was the box was shipped to me without being scanned or activated first (just like when you buy a prepaid phone or itunes cards, they are needed to be scanned at the cash register first) Anyway, after the frustration over, here are the pros and cons:Pros: It's fast! Voice search (but unfortunately, it's not universal search) I like the remote control (I noticed that they copy almost everything from Apple TV like the packaging, remote control layout,... but Amazon makes it better, it's bigger, more responsive, and more importantly, blu tooth that you won't have to point it at the box!)Cons: It's only 8G! After the initial update, I only have about 4.7G left! WTF! And there's no micro SD slot to extent the memory! I'm pretty sure Fire TV 2 will definitely have more memory. There's USB port, but besides using it for keyboard & mouse, there's no use for it! But hopefully with future updates, I can hook it up to my external HD or thump drive to play my movies, pics, musics,....Overall, like, Apple TV, Roku, WD Live, it's not perfect but I like it! I would replace the rest of my streaming devices if it has more apps like Roku (I don't need hundreds of apps like Roku, I definitely want more apps) I can plug in my external hard drive to play my movies, photos,... like WD Live, and if I can sideload an android app to airplay my ipad, iphone,....then I would give it perfect score even though I'll have to deal with only > 4G memory because I know that I cannot ask for too much and I know that Amazon Fire TV's main purpose is as a streaming device and not an gaming console.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer \"Johndoe01\""}, {"rating": 4.0, "review": "My IPhone does not understand me but Fire TV does. Easiest install ever too. It came preloaded with all my info, so I did not have to sown time trying to register it and loading info. It took me 5 min to plug in 3 cords.", "verified": true, "helpfulness": "0/0", "author": "Teri Hayman"}, {"rating": 5.0, "review": "The Amazon Fire TV is very response and very easy to use. Navigating through the menus and even \"typing\" with the device is very intuitive. much more so than my Apple TV and Roku. The picture quality when I stream YouTube or Vimeo seems superior to the other products as well.PROSSimplePowerfulNo waiting for bufferingVivid picture quality (best in class?)GamingNEUTRALLooking forward to Cloud Player to become active so I can stream my Amazon Cloud PlayerLooking forward to the USB port becoming active so I can view my own photo and video contentMissing a shopping app to buy from Amazon.com. Would love to shop from Fire TV. \"Group shopping\" from the TV for large ticket items seems like a natural fit.CONSNot as many apps as Roku (need to verify this)Minor, but, if you get your password wrong when you are trying to activate a 3P app, the User Name also disappears. Frustrating.Very happy with this product, and looking forward to firmware updates in the coming months/years. Will be getting another one for the basement TV as well, mainly for the games.", "verified": true, "helpfulness": "1/1", "author": "Andrew J Harnish"}, {"rating": 4.0, "review": "Great device, as long as you're primarily using it to stream content. If you try to use it for gaming or local storage, then it's likely that you'll quickly hit the device's rather low storage ceiling, although you can use a USB flash drive for additional storage.+ The device now supports USB flash drives.+ The remote is very easy to use.+ The UI is very fast and responsive.+ Voice search is very accurate.- The device only includes 8 GB of internal storage. Get a USB flash drive.- The games are mostly quick ports of mobile games.** Regarding the games mostly being ports of mobile games, I don't have a problem with mobile games, per se. My issue in this case is that there don't appear to be many builds that're specifically designed for Amazon Fire TV. Some games don't have their controls mapped to the controller by default. That's just bizarre. Also, too many games employ the annoying practice of being small to download initially, only to have to download a lot more content afterwards.", "verified": true, "helpfulness": "1/1", "author": "Kevin Bender"}, {"rating": 5.0, "review": "Love this device it's so cool I would like to buy another one for my father if you all have any on discount just email me jdo405@bellsouth.net", "verified": true, "helpfulness": "0/0", "author": "jonathan oswalt"}, {"rating": 4.0, "review": "Need more apps.I need this to replace dishnetwork for my mom. It can almost do it but I need those news apps that are available for tablets so she can see news programs like ABC7 in LA.", "verified": true, "helpfulness": "0/0", "author": "Thomas Cantrelll"}]