[{"rating": 5.0, "review": "Thank you Amazon; you are really top gun.  I would highly recommend it.", "verified": true, "helpfulness": "0/1", "author": "S. Sando \"ssandr\""}, {"rating": 5.0, "review": "Love it! The movies are priced affordable.  works much better than using the apps connected via internet.  best to have streaming device like Fire TV", "verified": true, "helpfulness": "0/1", "author": "Tennessee Broker"}, {"rating": 5.0, "review": "Love it - Easy to setup and use - this is the way media content is intended to be watched", "verified": true, "helpfulness": "0/0", "author": "H G Chamberlain III \"I am an entrepreneur, author, coach and mentor.  My focus is to assist small business owners to streamline and systematize their business.\""}, {"rating": 3.0, "review": "I would have given it a 5 star if i could get to fully utilize it. For some strange reason my geographic location is a problem so i'm only limited to good old faithful NETFLIX. Will love if that issue be resolve promptly, seeing that it isn't stated that one will have to live in the US to enjoy PRIME.", "verified": true, "helpfulness": "1/2", "author": "Tendia Oliphant"}, {"rating": 5.0, "review": "I Love Amazon Fire TV.Lots of movies and TV shows.Fast streaming, no waiting on buffering.Great small size.", "verified": true, "helpfulness": "0/0", "author": "August Winter"}, {"rating": 5.0, "review": "Best toy of the year!  Super easy to set up and most apps activated and sync'ed quickly and easily.  Currently digging through my Prime stuff.  This is what they meant when they predicted the 1000's of channels when I was growing up in the 60's and 70's.  So much to watch that I actually want to see.  We haven't had cable TV for over three years and really didn't miss it.  I love I can now watch what I want, when I want without having to dig through the dreck (reality TV, nuff said) that is so much of the TV landscape these days.", "verified": true, "helpfulness": "0/0", "author": "L. Kramer"}, {"rating": 3.0, "review": "I loved it but had to return it and go back to Roku.Pros - it is lightling fast.  It plays pretty pictures when it's resting. Voice control is nice but only works in Amazon Prime.Cons-this is why I returned. You cannot enable pin-code ordering.  You click twice and you bought it.  My four year old keeps buying shows.  They refund when I send an email to complain, but it's a lot of hassle.  They told me that I could turn off one-click ordering on my Amazon account but that didn't work.  Then they admitted that there is no way to turn off 1-click ordering, except enabling full parental controls.  Full parental controls means that you enter a pincode for every single thing you watch.  Too much.The other problem is that eventually it stopped telling me what was and wasn't prime.  I would have to check on another device.  I accidently paid for something that was free on prime.  I bought the whole season because my kid likes it.  Then I found out on the kindle that this was a free show.  They seem to go out of their way to obscure what's free and what's not free.  Then it seemed to just be default charging me for prime shows.  I thought maybe it was broken that it wasn't recognizing my account.  I called tech support.  The guy was heavily accented and hard to understand.  Walked me through rebooting it, then said a tech support person would call me back in 3 days.  I plugged in the old Roku instead.  Amazon was nice about taking it back even though it was past the return date.Problem #3- cannot read the tiny text from my chair on the 35 inch TV.  Roku uses bigger fonts in the description.  I had to get up and stand close to the TV to know what I was selecting. You cannot adjust this text.Oh - free time - just an aside.  Not really worth it.  My kid not interested in any of that stuff.  The dregs of children programming past and very limited episodes of the good stuff. Free time is not a work-around for the one click ordering problem.I was sorry to see it go.  The Roku is really not as nice.  I miss the speed, mostly.  I might go back in a few years when they get the kinks worked out.", "verified": true, "helpfulness": "1/5", "author": "calamityj"}, {"rating": 5.0, "review": "I love my Fire TV! The voice search works perfectly and makes navigation much easier than Roku or Apple TV. The variety of available content is good and I expect it will only get better. I would like to see a classic movie channel like TCM or similar content through Amazon Instant Prime. Best one of the bunch IMHO.", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 2.0, "review": "I have several different boxes at home from Apple TV to the Ruku and by far the Amazon Fire TV has been a frustrating box which continually is buffering or disconnecting my connection I have switch the box thinking it was defective but such was not the issue spent countless hours with my cable provider and wireless router support and no one has been able to figure out the issue including Amazon support. Just to tell me that they would refund me my money.", "verified": true, "helpfulness": "0/6", "author": "Jonnei Campaz"}, {"rating": 4.0, "review": "Good product if you're using the Amazon-preloaded apps. It supports third-party programs, but treats them as second class citizens, as Amazon doesn't allow you to pin them in the front page without sideloading another program. You have to upload them by clicking through their Apps maintenance menu... Kind of a hassle.The remote control (included) can use some improvements, to allow typing, instead of having to rely on another remote control.Memory is also a bit tight and could be improved.There is room for improvement.", "verified": true, "helpfulness": "0/0", "author": "Marco R"}]