[{"rating": 4.0, "review": "I received my chromecast and set it up in just a few minutes. Much much better experience than the GoogleTV I had. I downloaded the chromecast app rom the Play Store for my android phone and it found it quickly and I just punched in the password for the wifi and I was good to go.The apps that it does work with work great. I've used the netflix, google play music and video, and youtube. The beta chrome tab casting works ok but there is a noticeable 2-3 second delay from what's on the computer screen to what shows on the tv.That's about it though. Not many apps support it yet and if you're looking for a netflix/youtube dongle that will fit in your pocket you can't beat it for the price.Giving it 4 stars for now due to the lack of app support. It really need Amazon video and mp3 as well as Hulu.", "verified": true, "helpfulness": "0/0", "author": "C0untDeM0net \"Eric\""}, {"rating": 3.0, "review": "When I first heard about this, I was pretty excited. I wasn't sure if it would do exactly what I wanted, but for $35, I was willing to try it out. I got it yesterday and set it up on a Samsung Galaxy Note tablet. I didn't realize from the ads that it required a separate power supply. Fortunately, my TV has a USB port that I could plug it into. I would have hated to have another device to plug into the power strip. However, having it plugged in to the USB port means that it can't turn on the TV when the TV is turned off (like they do in the ads).It was nice being able to see Youtube videos on TV, but I generally don't spend much time only watching Youtube videos (I'm usually checking my e-mail or browsing the web at the same time) and I don't use Netflix or buy anything through GooglePlay, so Youtube was basically all I could use it for. Even with that, I feel like if you have a decent sized computer screen, there really isn't any point in trying to watch a short Youtube video on a large TV. Also, I don't like the fact that I have to use GoogleChrome to use the device. You can also get Netflix, Youtube and other applications through a SmartTV or a blu-ray player with Wi-Fi, so if you have either of those, there really isn't any point in using this device.I think it's nice for the novelty, but like someone else said in another review, it's basically just a \"Youtube player\". Ultimately, I think it would be better to shell out a hundred or so bucks and get an HDMI video transmitter and then be able to see whatever you want from your computer on your TV screen.", "verified": true, "helpfulness": "9/13", "author": "ChakaA"}, {"rating": 3.0, "review": "As soon as I saw Google released this item and it costs $11 after Netflix code, I didn't think twice to buy it.Got my Chromecast yesterday and hooked it up with my TV really easy setup. It works with most of the websites I watch streaming videos. I noticed at few instances there was a slight delay in video between laptop and TV. I noticed videos got stuck at few instances and it adjusted by itself after few seconds, think my wi-fi connection drop.Before Chromecast I used to connect my laptop using HDMI cable which wasn't long enough to bring laptop to couch and ugly cable hanging out of my TV. Now this reduced cable clutter and solves my issue with just $11, no one can beat that price factor.Five stars for the price, usability and does what I expect it to do.", "verified": true, "helpfulness": "70/85", "author": "JD not-a-pro Photographer \"JD\""}, {"rating": 5.0, "review": "Picked this up at best buy yesterday and it is awesome! It works seamlessly and is dead simple. For 35 bucks, it's a steal.", "verified": false, "helpfulness": "1/2", "author": "SKiD"}, {"rating": 2.0, "review": "I am an appleTV user, I though this might complement my setup essentially for youtube clips. Installation was ok but clunky and counterintuitive, I had to install using my MacBook Pro since it wouldn't install with my MacPro (computer has to be within 20 feet of TV) also it wouldn't connect to the 5 GHz band of my router, only the 2.4, oh well. So after few tries it is setup to my Samsung TV and it worked lunching youtube clips through my iPod 4. Discovered that it offers almost same functionality already available through my samsung BluRay player, oh well. Did not try the Netflix because I had the service suspended and Google special offer evaporated. For now I can only test youtube since it is the only service available. I would say it is ok to launch a clip but beyond that, it is clunky. Hard to control the playback, navigation, turn on/off etc really useless. It would be nice to have its own app available (a la appleTV remote), as opposed to control thru the youtube app which if you exit you need to start over again. There are no other services available for now so it is really limited. Will wait to see how this evolves overtime. At $35 I don't feel horrible about wasting money, although it is a waste since it offers nothing new or more convenient than what I already have. AppleTV with airplay is far more superior. The youtube app on appleTv is much better and more convenient. I doubt if the Chromecast will change that landscape anytime soon.", "verified": true, "helpfulness": "10/25", "author": "Med A"}, {"rating": 5.0, "review": "f you don't care too much for content that is exclusively on traditional TV and don't have a massive local library, this device is perfect! The user experience is seamless like what we've come to expect from Apple.I used to have a computer plugged into my TV with a wireless keyboard. This brought an end to that.Price: For $35 and three free months of Netflix (worth $24), it costs about the same as a nice sandwich. With the Roku stick priced at $99 as the closest rival, I didn't even bat an eyelid buying this!Setup: So easy! Plug into a power source and HDMI cable, run one-time the setup app on Android or your computer to hook it up to your home wifi network and it's ready to go.Interoperability: The way this works is your mobile devices or computer talk to Google servers and Google relays the message back to your Chromecast, so your devices are never directly streaming to your Chromecast. I suspect the way Chrome browser mirroring works is that Chrome pushes the DOM up and Google relays it back down to your Chromecast.What all this means is that the device is super easy to use. You can control is from multiple phones as long as they're on the same wifi network with no additional authentication. Starting a stream from one app or device automatically takes over from the last.It also means your phone's isn't killing its battery streaming to your TV. In fact, its likely using less power than it would playing the video on its own screen.Local Content: Chromecast is basically a stripped down version of Chrome running on a dongle connected to your TV. That means all content has to be streamed over a web protocol, so your MKVs are likely to not work.I'm trying to see if I can write an app to reference my local storage in some useful way. The API is here - [...]Simplicity: The lack of feature clutter makes this device amazing! It promises Netflix, YouTube and Chrome tabs from your computer (hint: pretty much everything else) and does it really well!. Another big win over the Roku stick is that there's no extra remote to worry about. You can control this from the apps you know and love.I have a Sonos that I love but this takes it a step further because I don't have to use something like the clunky Sonos app and I can directly use the YouTube or Netflix apps.Video Quality: I was getting 1080p from Netflix over my FiOS connection regularly. It helps that my TV is placed right over my router.Verdict: Shut up and take my money!", "verified": false, "helpfulness": "3/5", "author": "Abhinav"}, {"rating": 5.0, "review": "UPDATE A YEAR LATERI originally purchased 2 Chromecasts the day the product was announced at Google I/O 2013. I didn't even know what it was I ordered other than it was a cheap way to stream content from Google Play. Since getting my two dongles I have added 3 more to my home networks (every TV has one now).Google has done what Apple failed to do. That is offer a \"Smart TV\"/cord cutting solution at an extremely affordable price. The updates this year (July 2014) include full screen mirroring from all Android devices(your Home Screen goes up on the TV), local casting (my photos & videos on the TV) and now there's a host of supported apps that let me put just about anything on my TV.You do still need to provide power to your dongle with the supplied USB cable. (I find plugging it into the power brick allows me to remotely turn on the TV as well as change the source from my phone alone.) But the price has actually dropped $5 over the last year.This is no longer a \"What if\" geek toy but a \"must have\" accessory for every home TV. Setup is dropdead simple. Under 5 minutes from any device (phone, tablet, computer). The longest task is entering your WiFi password.I gave these out to my siblings as stocking stuffers last Christmas. Now it is among the accessories I buy for every new TV. What is lacking is still some app support. NFL needs to add Chromecasting to their NFL Rewind. The news site apps need to have Chromecast.Due to the app development and continued low price I've upped my star rating from 4 to 5. Don't think; just buy.", "verified": true, "helpfulness": "0/0", "author": "JenKoko"}, {"rating": 5.0, "review": "In this review, I will focus on a feature that has not been covered well by other reviewers. In Google's introduction of the chromecast device, they showed how they could press the chromecast button in the youtube app on smartphone and the TV would automatically turn ON and switch to the correct input to play the youtube video. I can confirm that it works exactly like they demoed. It is pretty impressive :-)There a few things you need to do to make it work. Firstly you have to enable the HDMI-CEC feature on your TV. HDMI-CEC is marketed under different names by different manufacturers. Panasonic calls it Viera-Link, Onkyo calls it RIHD and Toshiba calls it Regza link. You will have to read your TV manual and find out how to enable HDMI-CEC correctly in the TV settings. For my Panasonic TV, I set the \"Viera Link\" to \"ON\" and \"Power on Link\" to \"Yes\". The \"power on link\" setting allows the chromecast device to Turn ON the TV when you send a video to the chromecast device. Also, for the chromecast device to Turn ON the TV, it should be plugged in directly to a power outlet using the included adapter. If you power chromecast though the USB port on your TV, it will lose power when you switch OFF the TV. Chromecast device with no power cannot turn ON the TV. Make sure you turn OFF everything after changing the settings to test the Auto power ON functionality.After you setup the TV as described above you can send the video to TV and chromecast will turn it ON and switch the input to the one you have plugged the chromecast device into.For users who have an Audio Video Receiver (AVR), the above setup may not be the best. I could set up the TV to send audio to the receiver through Audio Return Channel(ARC). But for some reason ARC would pass through only stereo sound. Not the DD+ 5.1 sound from Netflix. I don't know if this is an inherent limitation of ARC. Also, after watching a youtube video, switching back to cable TV is a pain. You have to manually switch the input on the TV and the receiver.So in my final setup, I plugged in the chromecast device directly into the receiver. With this setup I can receive DD+ 5.1 sound from Netflix movies. With this setup, chromecast can automatically turn ON the receiver and switch to the correct input on the receiver. Note that you have to have the HDMI-CEC functionality enabled on the receiver for chromecast to be able to turn on the receiver and switch the input. Thanks to Mr. Godwin for pointing out that you can use the HDMI-CEC functionality on the receiver to turn On the TV itself. So your chromecast can turn ON the receiver and your receiver could in turn switch ON the TV. I couldn't get my receiver to turn ON the TV. But it has nothing to do with the chromecast device itself.One another benefit of plugging chromecast into the receiver is that you don't have to turn the TV ON if you just want to listen to google music or audio from youtube videos through your receiver. Since my TV does not get turned ON when the receiver is turned on, I can chromecast a song or youtube video from a different room and it will turn ON just the receiver and play the music. The best part is that it doesn't drain my battery as the video is not playing on the phone and hence I do not need to keep the screen on.Overall I am very happy with chromecast. As others have mentioned, the setup was incredibly easy and trouble free. I was pleasantly surprised that a 1.0 device worked so well out the box.I think Google made a smart move by creating the hardware for Google cast and integrating that functionality into two of the most used video apps youtube and netflix. If they had introduced the googlecasting protocol in Android and left it up other manufacturers to implement this feature, it would have met the fate of Google TV, Miracast etc. Now that there is a reference implementation where Google has shown what a good experience looks like third party manufacturers and app makers will take this and run with it. I am excited about the future possibilities.", "verified": true, "helpfulness": "206/262", "author": "George Varghese"}, {"rating": 5.0, "review": "No problems setting this up using my Macbook.  After it's installed on a TV HDMI port, and that port is selected on the TV, you get a TV screen giving you a URL to go.  There you download and run an OS X app, which sets up the device -- basically getting it on your wi-fi network.I then tested out casting from Youtube on Android phone and tablet, screen casting movies running in Chrome on the computer, and also casting from Google music.  All worked exactly as advertised.  I didn't notice significant lags when screen casting, but that is probably because my router is about 2 feet from the Chromecast player.So if what it does is what you want, I highly recommend it.", "verified": true, "helpfulness": "1/1", "author": "Chuck Osmund"}, {"rating": 5.0, "review": "I like it for very light use. I'm a techie who don't watch TV. My TV fires up less than a dozen times a year, for some football games and state of the union address since I got it in 2004. I definitely don't pay for TV, whether it's cable, satellite, Hulu, Netflix. Doesn't matter.This thing is well designed, very easy to setup without any instructions. But then again, I almost never read instructions. I put on hours of youtube documentaries while I'm doing things around the living room, and it works well for this purpose.I even read some ebooks on Amazon cloud player with it. There's a few second lag for page turns but it's nice to read ebooks on large screens while sitting confortably.It also gives me an excuse to keep my old tablet - the HTC flyer as a remote control for it.It actually does a decent job streaming online content in X264. But then again, I'm not glued to the TV; I use it as a background radio when I'm doing chores. So far, I'm happy with it. Not a lot of bugs, and that's amazing because I usually catch a lot of bugs playing with gadgets.And I'm definitely replacing my old popcorn hour with it. Let's face it, navigation on TV is painful, and that's what this Chromecast is all about.for $35, with a 3 month netflix coupon, not having to glue myself to the TV, I'm pretty happy with it.(I'm not happy with Amazon dragging its feet on the netflix coupon, though.)", "verified": true, "helpfulness": "2/3", "author": "Hsiao Yu Chen"}]