[{"rating": 1.0, "review": "I have barely opened the box, and I already hate it.  It requires a power adaptor or USB from the TV to power it.  The clunky power adaptor is conspicuously left out of the product photos.  LAME!Update:  I plugged it into my tv, and got it set up just fine.  Picture was ok, just like most streaming video, just ok.  However, since my tv is mounted on the wall, I will not be keeping the chromecast, since it requires and extension cord up the fireplace to the power it.  Off to e-bay with it.  Glad I only wasted $35.", "verified": true, "helpfulness": "8/47", "author": "winchmonkey"}, {"rating": 3.0, "review": "The video quality isn't great and I ran into some trouble setting up, but I'd say overall it's worth $35.  Its value will increase as more services adopt their API.Don't buy it if you like the idea of the chrome tab mirror feature. I've tried it on several different computers and they're all super laggy.  Not useable for streaming video.", "verified": true, "helpfulness": "2/4", "author": "iJeff06"}, {"rating": 5.0, "review": "I had to buy a new router before the streaming media player started to work. Too slow.  Not Google's fault.  The product itself and the documentation are as good as it gets.  I already  had Roku which can deliver more media choices, but the Google Chromecast concept of streaming whatever you have on your Chrome home page is simpler and will soon have more media.  I miss the possibility of Amazon streaming, but if I want it bad enough, I use Roku.Easy as pie to install and works exactly as advertised.  You won't get the free NetFlix promotion because \"He who hesitates pays more\", but I, as an earliest adopter, payed a net of less than $10 for this useful and cute gadget.", "verified": true, "helpfulness": "0/1", "author": "Herbertk"}, {"rating": 1.0, "review": "The Chromecast installed easily and the Netflix account could be set up, although it certainly was not easy to get the discount coupon and have it honored.The only problem is that the system does not work!I have a high speed internet system (and am a scientist who knows what that means and measures its bandwidth).I tried to watch a Netflix movie, (episode 1 of House of Cards). I saw good video (but not better than that)with just acceptable audio (the words were hard to make out because the sound was so reverberant and bass emphasized) but THE PICTURE STOPPED ABOUT EVERY 30 SECONDS and took about 2 MINUTES TO RELOAD before showing again for something like another 30 seonds!!In other words the system did not work.By the way Netflix showed the movie on the computer was just fine.SHAME ON GOOGLE!", "verified": true, "helpfulness": "9/46", "author": "Robert S. Eisenberg"}, {"rating": 1.0, "review": "If you have the patience it MAY work after 2 days. Mine did for a while before concking out!I dont want to spend another 2 days...", "verified": true, "helpfulness": "5/36", "author": "Mark T \"c-man\""}, {"rating": 4.0, "review": "It is great at what it does, but it seems to be limited at the moment. Once more apps start allowing the cast feature this will be amazing! Netflix from my phone (with phone as remote) and easy to take anywhere makes this one of my favorite gadgets by far!", "verified": true, "helpfulness": "3/4", "author": "Brian"}, {"rating": 4.0, "review": "I purchased the Chromecast from Google Play on 7/24 and received it yesterday. I've only had it hooked up for 24 hours, so my review is likely to change.Good: really easy to watch youtube and netflix videos from your laptop on TV, can still use other tabs in your Chrome browser while the video is playing, can send your desktop or pictures to the TV also.Bad: limited video formats supported, doesn't work with vimeo or a few other video websites I tried last night (choppy play).If you already have something that plays Netflix/Youtube videos, don't buy the Chromecast just yet unless you really want it. I'm still using the Roku XS for Netflix as it has a wired connection to my internet and I don't have to use my laptop. There are other reasonably priced streaming devices available on the market, it will not replace the main devices I currently use (HDMI cable from laptop to TV, Xbox 360 for Youtube app, Roku XS for Netflix/Hulu/Amazon).", "verified": false, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I'm sure it will be awesome if I can ever get it to connect to my wifi!?! The wifi is alitlle weak in the front of house but all my other devices can connect just fine. I've taken off password and firewall settings disable.. It just gets that far in the setup and refuses to connect to my wifi in the setup.I tried using iPad through browser and computer using app.. Neither would allow me to get chromecast to handshake with media link.Google help was no help online couldn't find exact description of problem listed. Something about Upup connection setting?I have a new medialink wireless router.. Anyone have any idea what I'm doing wrong?", "verified": true, "helpfulness": "12/44", "author": "Richard Shorten"}, {"rating": 5.0, "review": "This is by far the easiest way to stream to a HDMI TV.  Set up is a breeze.  You can either use your App from the play store or use your google chrome app.  If you have a Belkin router and have problems just change your security settings.  When it streams its clear and sound is great.  Loving it right now.", "verified": true, "helpfulness": "1/2", "author": "K Quicksall"}, {"rating": 1.0, "review": "The unfortunate thing about this device is that you have sellers who have bought up large supplies of these units to try and turn around and sell them at an outrageous mark-up.  Buying a product for $100.00 or more that retails at $35.00 is not only foolish, it lacks any common sense.In two or three weeks, Google will either replenish the supply to legitimate retailers or something else will have come along and the public will have lost interest in this device.  If you pay this kind of mark-up for this device, you may pay out money for something that you might not receive or what you will receive may be damaged.  If the latter is the case, you will be stuck with something that you can't use and the seller either can't or won't replace the device and they most probably won't refund your money.I would advise anyone considering buying from one of the sellers on here to really think about it before putting your money down.  Retailers such as Amazon or Best Buy will more likely honor their return policy and make good on damaged or defective items than most of the rip off artists who bought up these devices just to mark them up in an effort to rip off consumers.", "verified": false, "helpfulness": "14/62", "author": "Freddie L. Hinton"}]