[{"rating": 5.0, "review": "ThankYou", "verified": true, "helpfulness": "0/0", "author": "Daniel L. Shane"}, {"rating": 2.0, "review": "If you want a good experience go with the AppleTV. This thing is SLOW and the image isn't great.", "verified": true, "helpfulness": "0/0", "author": "SMysteryman"}, {"rating": 5.0, "review": "Love the Chromecast, wish they had a remote but hey I'll love.", "verified": true, "helpfulness": "0/0", "author": "Kiefer Anderson"}, {"rating": 5.0, "review": "Absolutely love my Chromecast. Definitely suggest it to the buyer.", "verified": true, "helpfulness": "0/0", "author": "Puppylover"}, {"rating": 5.0, "review": "Good, cheap way to stream to a TV. Need space USB to power the device. Does come with an AC adapter tho.", "verified": true, "helpfulness": "1/1", "author": "Jonathan Swinford"}, {"rating": 5.0, "review": "It's a chromecast. It's a cheap alternative to a bluray player or a game system to watch Netflix.", "verified": true, "helpfulness": "0/0", "author": "Ross Jacobs"}, {"rating": 5.0, "review": "This is great for my only digital tv, in my bedroom, for watching Netflix.  Works great.", "verified": true, "helpfulness": "0/0", "author": "Ramona"}, {"rating": 3.0, "review": "Doesn't stay connected to phone or other devices well. Always got it to work but still needs some of the kinks worked out.", "verified": true, "helpfulness": "0/0", "author": "Silverio"}, {"rating": 5.0, "review": "I've had a Chromecast for over a year now and I still love it! My dad's a technology neanderthal and even he can use it. The only thing it doesn't do is play movies I bought via iTunes, but considering how much it does do (everything else!) and the considerable price difference, I don't mind having to physically hook my laptop to the TV to watch iTunes movies. And it is so very easy to use! Just open an app on your phone that is Chromecast compatible, select the cast button, and cast. That's it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Finally we can enjoy watching youtube on the big screen!!  I like the screen saver scenic view, too.", "verified": true, "helpfulness": "0/0", "author": "Ringo"}]