[{"rating": 5.0, "review": "Love it...streams movies seamlessly and loads a movie instantly....no waiting like Netflix....voice search is awesome.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "when i get bored of  comcast i can watch this and i found this show on there thats called shaun the sheep and i love it", "verified": false, "helpfulness": "0/0", "author": "BLUEJAY"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "RAUL RUANO"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Ken Steele"}, {"rating": 5.0, "review": "I'm so glad I decided to buy Amazon Fire TV. No more waiting for movies to upload. This thing is super fast!", "verified": true, "helpfulness": "0/0", "author": "Deb"}, {"rating": 5.0, "review": "What can I say???  I love this.  Much more user friendly than the apple tv", "verified": true, "helpfulness": "0/0", "author": "Jessica M Honecker"}, {"rating": 3.0, "review": "My main contention with this is that the Plex App is not being updated quick enough. Not sure if its Amazon or the Plex Team. Eitherway, if I had know it was going to be like this I would have purchased something else.The other stuff it does is not bad, and it streams video very nicely. Not wild at the high controller cost, might as well get a console at that rate.", "verified": true, "helpfulness": "0/0", "author": "AP"}, {"rating": 5.0, "review": "I love my new toy.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 4.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Terry Dawsey"}, {"rating": 5.0, "review": "We've been a Roku family for years, and our Roku devices have served us well.  However, more and more of my digital content is purchased through Amazon (to say nothing of their huge, growing free Prime video content), so it just made sense to try out Amazon's hardware.  I'm glad I did.  This device is fast, easy to control/navigate through, easy to customize via downloadable apps, has a great remote control app for my phone...I could go on and on.  We own both a Fire TV and a Fire Stick.  They're both great streaming devices.Bonus: the certified refurbished unit appeared brand new.  Why pay the brand new price when Amazon fully stands behind the less pricey refurb model?", "verified": true, "helpfulness": "0/0", "author": "Forgiven Anyway"}]