[{"rating": 1.0, "review": "Probably the worst purchase of my life!  waste of $30...if you are thinking of buying this, take your $30 crumple it in your hand then burn it...that will give a better value to your money than this.Its difficult to use and to set up.  If you want to stream buy another device and pay the extra money...", "verified": true, "helpfulness": "0/1", "author": "Tim The Champ"}, {"rating": 5.0, "review": "Going to cancel my cable. I love this this", "verified": true, "helpfulness": "0/0", "author": "mia"}, {"rating": 5.0, "review": "Love it! 1 word CardCast!", "verified": true, "helpfulness": "0/0", "author": "Heather Lola Rondeau \"Heather Rondeau\""}, {"rating": 1.0, "review": "I purchased 2 Chromecast units.  They worked fine for about a year.  Both failed weeks outside the warranty. Google support  would not do any thing to make this right.  I'm now a Roku owner and could not be happier.  Stay away if you want to use this for more than one year.", "verified": false, "helpfulness": "0/0", "author": "JamesM"}, {"rating": 5.0, "review": "This is a great product to use if you do not have a box that plays Netflix or others. Works well with no problems.", "verified": true, "helpfulness": "0/0", "author": "NPB"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Edwin P."}, {"rating": 5.0, "review": "The best decision that we made!! this is a new form of entertainment.!", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Evgeny"}, {"rating": 1.0, "review": "A few months after the one year warranty expired, the Chromecast stop functioning and Google didn't provide any solution. Don't buy if you plan on using it for more than one year!", "verified": false, "helpfulness": "1/1", "author": "Tona Byrd"}, {"rating": 5.0, "review": "Works as advertised. Mom trips out when she realizes she can cast from her phone to her big screen.", "verified": true, "helpfulness": "0/0", "author": "jerry chanh ly"}]