[{"rating": 5.0, "review": "Very easy to use and fun to share your screen onto a TV", "verified": true, "helpfulness": "0/0", "author": "Ryan Xuereb"}, {"rating": 4.0, "review": "So far so good", "verified": true, "helpfulness": "0/0", "author": "PLM"}, {"rating": 1.0, "review": "obsolete", "verified": true, "helpfulness": "0/3", "author": "MIKE S."}, {"rating": 5.0, "review": "Love it! Great product! Easy installation, and seriously love the chromecast app!", "verified": true, "helpfulness": "0/0", "author": "abiusambiz"}, {"rating": 5.0, "review": "Love the chromecast.", "verified": true, "helpfulness": "0/0", "author": "J. Larson"}, {"rating": 5.0, "review": "This thing rocks.  I wouldnt recommend for those people who can barely operate the remote, but it is very,very easy to use once you understand the gist of it.  You need to control it from your PC, smartphone, tablet etc.  We use it for netflix, but can also stream Hulu and a bunch of other apps.  This is perfect for those tvs in the house with no smart capabilty.  For the price, these things are great and we love it.", "verified": false, "helpfulness": "0/0", "author": "Dibbs"}, {"rating": 4.0, "review": "Everything came in the box as specified. Very easy to get it up and running. It works great! Something has to be mind blowing to get 5 stars from me, so 4 stars means its pretty darn good.", "verified": true, "helpfulness": "0/0", "author": "Court Woods"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/0", "author": "Barbara Berreth"}, {"rating": 4.0, "review": "Fun, not enough apps on my phone work with it for me. If you are an avid netflixer, you should probably get this. Turns any TV in to a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Seth Kent"}, {"rating": 5.0, "review": "Love google, google chrome and chromecast. But sometimes the device doesn't show up on my laptop. I'm not sure if its a hardware issue or my wifi, but unplugging and plugging my chromecast back in usually fixes it!", "verified": true, "helpfulness": "0/0", "author": "A. Bi"}]