[{"rating": 5.0, "review": "Excellent item, works great with my Samsung galaxy smartphone and my Samsung television. I used also with my Sony tv", "verified": true, "helpfulness": "0/0", "author": "Arlette"}, {"rating": 3.0, "review": "I have and iPhone, Ipad and win 8 tablet, for Youtube app in tv works really nice, but anything more", "verified": true, "helpfulness": "0/0", "author": "Carlos Sandoval"}, {"rating": 2.0, "review": "The iPad app is clunky and slow.  Sometimes the iPad connects to Chromecast, sometimes it doesn't.  Same goes for the Chromecast itself.  Every time I use it, it is a roll of the dice as to whether or not it is going to connect to the internet.  I'm kind of shocked and disappointed in the unreliability of this, but I guess for $35, what do you expect?", "verified": true, "helpfulness": "0/0", "author": "NickH"}, {"rating": 1.0, "review": "Not happy about this product you require a tablet, laptop or desktop to display on the TV, even then not everything is compatible. you are better off getting yourself the Samsung allshare cast and image everything on your phone or tablet.I am an android fan love Google products but sorry Google you get an F on this one.", "verified": true, "helpfulness": "2/5", "author": "IGotzurReviewRighthee"}, {"rating": 5.0, "review": "Chromecast takes care of a problem we had...our TV & Home Entertainment System is not Wi-Fi, and our cable modem is rooms away from where the big high-def TV is, and running a cable 100 feet was not an option.  With Chromecast, we can now enjoy streaming with Netflix, Google Play, HBO Go, and a few others.  It was easy to install, set-up and operate.  (we both have android smartphones)  I guess we could even take it on vacation with us for a rainy day or night, as it is very small & convenient to pack-up, as long as we have Wi-Fi & a TV with an HDMI port.  Chromecast works well for me!", "verified": true, "helpfulness": "1/1", "author": "JSM69"}, {"rating": 5.0, "review": "It did exactly what I need it to do. Cast my Netflix, Youtube and even my google Chrome desktop on my TV. If you don't have a SMART TV, this would be a nice addition to have. I control chromecast with my samsung S3, no problems. Great Chromecast background scenary. It fit snug back on the TV in the HDMI port. Waiting for more firmware updates. I know there much more this thing can do.", "verified": true, "helpfulness": "0/0", "author": "Spencer-Marc"}, {"rating": 1.0, "review": "iT hard to hook up.You cannot get want they say you can view. Can give me the address so I can return it. Thank you.", "verified": true, "helpfulness": "1/4", "author": "ronald kowalski"}, {"rating": 5.0, "review": "Plug and play and you're ready to go. The only thing that's needed is more apps that are compatible with yhe device such we Amazon Prime video streaming.", "verified": true, "helpfulness": "0/0", "author": "Christy"}, {"rating": 3.0, "review": "Not at all what we had hoped for. Very little apps were compatible with the Chrome. It was returned after disappointment.", "verified": true, "helpfulness": "0/1", "author": "SteelerGirl \"SteelerGirl\""}, {"rating": 5.0, "review": "Streaming from my tablet and computer have been incredibly easy.  Once the device is plugged in, you use a supported app and can send it from your tablet to the chromecast through your wifi connection.  The picture is clear and in HD.A few warnings- if your wifi connection is slow and you normally have lags in viewing films on your tablet/pc, you will have the same lags in the chromecast.  It's not the fault of your chromecast, it's your wifi.  Second- It does use your battery a bit to watch/stream the video, so plug in while you are streaming.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]