[{"rating": 4.0, "review": "I figured for the price, the Chromecast device was worth a shot.  It is significantly less expensive than any of the other popular streaming units out there (Roku, Apple TV, etc.).  I will say that for the content that it is designed, the picture is great - Netflix, Hulu, Google, Play, Youtube. While it doesn't surprise me, I wish amazon video was supported. For any non-chromecast supported content, the image is great, but I have found that the audio lags. I tried TBS's streaming channel, and it looked great on the cast, but as the content went on, the audio lagged farther and farther behind.Setup is a snap - you plug it in to your HDMI slot on your video device, register your unit and connect it to your wireless network.  Chrome has a plugin that allows you to cast any content from your desktop, laptop, mobile device, etc. It's pretty awesome as it is, but it would be super awesome if they somehow snuck in an OTA digital receiver.  My guess is that they didn't want to mess around with antennae.Pros:Great price pointEasy setupVideo and audio quality is superb for applications that are paired with chromecastCompact and unobtrusiveCons:Needs more content available (probably to be increased in the future)Non-chromecast content quality is sketchy.Overall worth the investment if you have a nice TV or projector and you want to watch your Netflix, Hulu or Google Play  streaming content  on your home theater setup.", "verified": true, "helpfulness": "0/0", "author": "Lurchie"}, {"rating": 1.0, "review": "Dont waste your money.  This thing cant even mirror from smart phones or tablets. Get a roku 3. more money but well worth it", "verified": false, "helpfulness": "1/2", "author": "mojo"}, {"rating": 4.0, "review": "Chromecast is a must buy...it is an easy way to connect to existing networks to listen to Pandora, Google TV, Music, Movies, Netflix. It works from smart phones, tablets (mac/pc/android). Watch YouTube to know exact limitations of smartphones: you cannot cast from Google chrome browser on phone.  You get full hd to your tv using apps rather than browser.I cannot wait for more browsing capability like photos with slide show ability.", "verified": true, "helpfulness": "0/0", "author": "How n Judi"}, {"rating": 2.0, "review": "This will only stream limited media services.  It does not stream what is on your tablet, without add-on apps.  They couldn't be used on my device and the Netflix app doesn't work either.", "verified": true, "helpfulness": "0/0", "author": "Jane A. Taylor Jaehning"}, {"rating": 5.0, "review": "I love being able to see NetFlix and YouTube on my Chromecast. I would love to have more streaming options available to me. Works great.  There are a couple of hiccups causing me to start over when it doesn't know where to play the video, but overall this is a compact, and most efficient item. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Lynn Dougherty \"lynnpd99\""}, {"rating": 1.0, "review": "First. the power energy.. really need a usb to power up.. !! not cool!To many Issues trying to synchronize  some devices!!", "verified": true, "helpfulness": "1/3", "author": "Gabriel G."}, {"rating": 4.0, "review": "it's really great product. i really recommend for people who love to watch youtube and Netflix on your computer. Please read system requirement for installing the program so that you will not have any trouble like me :)", "verified": true, "helpfulness": "0/0", "author": "Joy"}, {"rating": 4.0, "review": "This is a great tool! If only it could display more that would be nice. But I think they are working on it. Great device! Love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "because there are restrictions of playback (playable depending if the audio is aac vs ac-3) I cannot play most of my MKVs. Hopefully this gets fixed later on.", "verified": true, "helpfulness": "0/0", "author": "360madden"}, {"rating": 5.0, "review": "Chromecast is easy to install and use. Highly recommended for the relatively low cost. Hoping they develop more applications to usewith it.", "verified": true, "helpfulness": "0/0", "author": "tdlaw2"}]