[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 1.0, "review": "No longer works with NETFLIX - cannot play ant NETFLIX content.  Apparently a bad upgrade, but no way to report a problem.", "verified": true, "helpfulness": "0/4", "author": "Thomas A. Rowland"}, {"rating": 1.0, "review": "No option to reduce hd quality.  Everything else was great.", "verified": true, "helpfulness": "0/9", "author": "cjrisharris"}, {"rating": 2.0, "review": "Generally like FireTV, but I don't really like the interface (though voice search works well).  I'd much rather have a more robust remote.  'Typing' everything with one click at a time is awful, and so twenty years ago.  I also don't like being forced to upgrade apps, especially ones that absolutely do not work. One of the reasons I bought this device was because it had Netflix integrated. The latest version absolutely sucks, does not work on FireTV, and Amazon forced the upgrade, clearly without testing. It has been broken for a month now.  Amazon should A) not force people to update  B) test the apps they allow onto their platform and C) allow people to downgrade when the app doesn't work. I blame Amazon as much as Netflix.  I bought FT in part for NF and IT DOES NOT WORK!  Where's my partial refund?", "verified": true, "helpfulness": "1/2", "author": "Raptor"}, {"rating": 1.0, "review": "Purchased the Fire TV under the impression that I could get Dolby Digital via the optical out. Purchased the unit at Best Buy when I found the unit on sale for $15 off. I purchased the unit and found there is an option in the settings menu for Dolby Digital via the optical out except it only transmits stereo. Tried every possible setting to see if by some miracle it would play surround sound. It will not happen via the optical out.Spent 52 minutes with Amazon support to be told after much trouble shooting that unit does not support Dolby Digital via the optical out!!! Are you kidding me?Apps appear to be extremely limited compared to Roku, but was not the deal breaker for me. Roku feels like a child's toy in comparison to Fire TV with the build quality and the menu setup and function. Remote has a great weight and feel.Too bad for the sound issue, due to it not having the surround output it is getting returned. If you require an optical output to your surround sound setup this is not going to do it. Unit is packed up and getting returned.", "verified": false, "helpfulness": "24/25", "author": "Julie S."}, {"rating": 5.0, "review": "Plug and play. Connected to wireless flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Splash"}, {"rating": 5.0, "review": "voice search is an impressive flawless feature. Hopefully the smart streamer devices will support miracast across android and windows, or possibly an m-card port, programming guide app and/or support, similar to a configuration with an HD Homerun paired to WMC Xbox extender. If users don't have these features, how else are users suppose to watch the Huskies tear it up in the Pac12 without a fox sports app on the marketplace?", "verified": true, "helpfulness": "0/0", "author": "Karl"}, {"rating": 5.0, "review": "AWESOME~", "verified": true, "helpfulness": "0/0", "author": "Donna Gangadeen"}, {"rating": 1.0, "review": "This product had the potential to be great, but I am heavily disappointed in the way that Amazon stood behind the product.  I received this very late in May, and now 6 months later, the device will not even power on.  I contacted Amazon, but they were not willing to stand behind the product and I have no desire to purchase again.  I was originally lured in with a\"try it free for 30 days\" program and wish that I had not done so.  Would recommend other options based on what type of programming you are seeking.Also to note...there are only a few Prime movies worth checking out (meaning they are free).  The original programming seemed great, though I never saw any more than 1 episode of a show.  Otherwise, this was a great way to watch pay per view movies at a discount versus my cable provider.", "verified": true, "helpfulness": "1/4", "author": "Justin Sullins"}, {"rating": 4.0, "review": "I've been very happy with this product purchase. As an Amazon Prime member I was leaning toward the Fire TV verses other similar devices. Having done the research I knew what to expect and I got exactly that. It does its job very well and the games have been a welcome addition. The free inclusion of \"The Game of Life\" has been a huge hit with our 6-year old and we play several times a week. The primary use of this device is Netflix and, to a lesser degree, Prime movies. I've downloaded a few novelty apps but mostly it's a movie box.The one complaint I share with those reviews that I had read previously is how clunky some of the menus can be - that's what keeps me from giving it 5-stars. Once in a while a screen won't load properly but a quick hit of the back button refreshes the screen. It happens so infrequently that I debated whether to either mention it.I did go for the Amazon controller which, in addition to doing a fine job with the more intensive games, allows you to play casual games without having to pass the remote control.Lastly I want to mention that it has a very small footprint and with a black matte finish I hardly notice it's there. Very nice.If you are on the fence as to which of these boxes to buy, go with the Fire TV and purchase a subscription to Amazon Prime. It's a great combination. Although I am an iPad user, I am considering buying a Kindle Fire to complete the experience.", "verified": true, "helpfulness": "0/0", "author": "Mick89"}]