[{"rating": 5.0, "review": "Really pleased. I am impressed with the Fire.  It's easy to setup. Just plug it in, watch a short video and rock-n-roll.The picture on my HDTV is fantastic. I like the voice activated feature.", "verified": false, "helpfulness": "1/2", "author": "Hallie"}, {"rating": 5.0, "review": "So easy to use...now I need to keep track of my internet units when I never needed to before!  Enjoying music, photos, movies and TV.", "verified": true, "helpfulness": "2/2", "author": "Sanji"}, {"rating": 5.0, "review": "This is a great device. I've now replaced all of my Apple TVs with these. I find the system UI and Netflix UI to both be more efficient and better-designed.My only nit is the intro tutorial. It needs a \"Skip\" button. I've watched it once and I'm forced to watch it every time I set up a new device. Also, I tried hitting the \"Back\" button to see if I could skip out of it and it took me all the way back to the beginning again, made me re-enter my wifi password (really?) and made me start the tutorial animation from the beginning.I hope Amazon is able to add HBO Go to the apps list as well.", "verified": true, "helpfulness": "2/2", "author": "Mike Downey"}, {"rating": 5.0, "review": "I have been a Prime member for years and my son wanted a gaming system for his room. He also doesn't have cable in his room. We have Netflix and Hulu subscriptions, and with the Prime offerings and all of the games we already own in the Amazon environment this fits the \"do it all\" bill. If you are already invested in Amazon it's a no-brainer.Even better - it works, and it works well. The system is *fast*. It loads most videos almost instantly, no buffering. Navigation is a breeze if you're used to Fire OS.I have Rokus on all of the other TVs. While they are great, I am quite sure they are eventually going to be replaced by Amazon devices, one by one. When is the next gen coming out? :)", "verified": true, "helpfulness": "1/1", "author": "K. Burke"}, {"rating": 4.0, "review": "Good:The Amazon Fire TV was wonderful!  The interface is really good and the voice search really works.  It's actually useful.  It is super fast; we didn't notice any load time lag or anything.  The $99 price tag is comparable to the top Roku box.  We also pay for the Prime membership which only adds to Fire TV's grade.Bad:The $99 price tag was a real bummer for us.  It isn't even that we don't think it is worth the cost, because it really is.  We just aren't prepared to pay it right now.  Perhaps in the future.  Also, we have all the devices we need that have similar functionality.  An example being my PS3 and Blu-ray players.  That is another downside to the Fire TV, it doesn't play discs.  This is, and will only continue becoming, less of an issue in the streaming content world.So, it you are cool spending the $200 (Fire TV + Prime) for it.  You will not be disappointed", "verified": true, "helpfulness": "0/1", "author": "Paul Desormier"}, {"rating": 3.0, "review": "Wish the apps also worked with the voice commands.  Also, the way it integrates the use of Prime is not very user friendly, in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "I'm so disappointed in this product......and that's being nice.  Our family is a HUGE fan of Amazon and we own several kindles and we've been a prime member for years.  Since the day we opened the box (we got this for my husband for Father's day) we haven't been able to watch much of anything without it buffering more than not.  We know this is not our internet connection as we're able to stream on all other devices with no issues.  I expected so much more and when I went to read the almost 600 other one star reviews I realized we were so not alone!!!!  I'm at a loss as to how Amazon could sell such a faulty product.", "verified": true, "helpfulness": "4/12", "author": "Meegan"}, {"rating": 2.0, "review": "I wouldn't recommend this to anyone. There are very limited apps and most need cable providers.the game selection is terrible nothing new. I would just wait for Google to release their android TV.", "verified": true, "helpfulness": "1/9", "author": "seth castilla"}, {"rating": 2.0, "review": "Signed up for Amazon prime – I don't know if it's because I'm still on the  trial but every single show seems to cost money-we never had a problem with the speed of the Internet using our Blu-ray player to access Netflix but with this thing it seems to keep how is buffering problems-not super pleased right now with the Amazon prime service or this item– hope it gets better", "verified": true, "helpfulness": "0/4", "author": "john O"}, {"rating": 4.0, "review": "This has been such fun to have and to use.  Very simple and intuitive...and I'm loving how fast the connections are...so much faster than my blu-ray player.", "verified": true, "helpfulness": "0/0", "author": "Emma Tea \"cupcake\""}]