[{"rating": 5.0, "review": "All I can say is that I'm very happy with my Chromecast. It's not perfect of course but it works extremely well and it will only get better. This is the future of TV and I'm sure future TV's will come with a Chromecast integrated. Hopefully TV manufacturers stop with all the \"smart tv\" crap and start adopting this as a default.Pros:- Cheapest solution for making your TV connected to the internet.- Small and convenient.- Really easy setup- Uses your phone or computer as remote- Works with Android, PC, iOS and Macs- If you have a TV with HDMI CEC it will turn on your TV automatically and switch inputs.- Made by Google- Works perfect with Netflix and Youtube to startCons:- Needs more apps and better performance when casting chrome tabs but it will get there.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Just Ordered this Item today.No Tax,shipping and 3 months of netflix makes it a slick deal.Only drawback of this piece will be any local contents cant be viewed directly onto tv.But 11$ for this device...I cant be any more choosy..", "verified": true, "helpfulness": "9/107", "author": "Harry"}, {"rating": 5.0, "review": "First off, it was extremely easy to set up right out of the box! I plugged it into an HDMI slot in my Pioneer A/V receiver, plugged the USB into the receiver as well, and then switched to the correct input. There is a setup wizard on the screen that will guide you through setup in very few steps. After it was setup, you are good to go. I instantly cast a youtube video in 1080p, and tried out some music as well. There are a couple downsides so far based on my setup but nothing I didn't expect when I bought it.1. It does not automatically switch inputs if you are using a receiver. It only works that way if you plug it into a TV. This is based only on my experience. Perhaps different receivers behave differently. I use a Pioneer VSX-919AH-K (B001UA6OLS2. This is a toss up depending on how good your wireless speed is, but I wanted to see if I could stream amazon prime videos in HD. Because it isn't pulling the movie from the cloud, you are using up most of your bandwidth on the HD stream from your computer/laptop. This caused lots of skipping, and loss of quality since there was less bandwidth for the chromecast to eat up.Overall based on my limited usage, I'm very happy with how it is working. Its been seamless between both my phone and computer. If I have anything else worthwhile to inform you about, I'll update my review. Feel free to ask questions and I'll get back to you as soon as I can.", "verified": false, "helpfulness": "1/3", "author": "Bill"}, {"rating": 5.0, "review": "I don't think that I left my desk since I saw the live feed from the Google Conference. I can't to be an to be owner of this amazing device! There will be an update once I'm able to play with the Chromecast!!!", "verified": false, "helpfulness": "14/137", "author": "keith"}, {"rating": 4.0, "review": "I already have an Apple TV and have been seriously looking at getting a Roku Box to attach to the other television in the bedroom, but then I watched Google announce this little beauty. It is only 35 dollars and ultra-portable, so you could definitely buy two or three and then take one with you on trips to use in a hotel or at a friend's place while you are away. All it takes is an hdmi port (common on most HDTV's made in the last several years) and a WiFi connection and you are ready to get streaming. This piece of hardware is also unique in that you won't need to replace it with newer hardware, just upgrade the software as it becomes available! This is what Apple should have released years ago! A wonderful product and cheap enough to justify the cost for all the TV's in your house. Get ready to stream netflix, pandora, and anything you want from your Chrome Browser! A must have.", "verified": false, "helpfulness": "17/134", "author": "camstep1405"}, {"rating": 4.0, "review": "This device should be a no-brainer for anybody who wants to try or already has netflix. $35 for a 3 months of netflix plus a neat way to remotely control your content from netflix, youtube, google play, and any other site that adds chromecast controls!My only negative is that based on the unveil, there doesn't appear to be a way to stream local content or use the device as an extended display for gaming like airplay. That said, streaming local content shouldn't be too much of stretch for some industrious developers, and additional functionality like mirrored and extended display could always be enabled in an update.", "verified": false, "helpfulness": "6/100", "author": "Chris"}, {"rating": 5.0, "review": "When the chromecast arrived, it was incredibly easy to set up. I was able to plug it in and immediately start the set up process. Rather than plugging it directly into a TV, mine is plugged into a receiver. When I bought the device, Netflix was still offering a three-month free trial. As a Netflix subscriber, this brought my cost down to just $11. At $11, this device is a no-brainer. At $35, it is a tougher one. I will try to compare the Apple TV and the Chromecast since those are the two I have.Set-UpThe set-up process was incredibly simple. I plugged the device in and instructions popped up on the screen directing me. I pulled up the website it told me to on my computer and I downloaded an app. The app then helped me connect the chromecast to my wifi network. After getting it connected, I then had to download an extension for my chrome browser. All in all, it took under five minutes from getting the package from the UPS man to watching videos on the device.First impressionsWith the chrome browser, you are able to place a browser tab on the screen. I personally noticed that text was not as clear on the screen as it was on my computer screen. I have a 42 inch tv, and I cannot speak to whether or not that is due to buffering issues or something simpler. I then went to YouTube. On YouTube videos there is now a button in the bottom right hand corner that allows you to play the video directly on the TV screen. My understanding is that this ends up being a more effective method than Apple's mirroring for the Apple TV. While you can only use certain Apple laptops for mirroring, the ones that can are uploading the information and the Apple TV is then downloading it which slows the process down a bit. The Chromecast does not have the ability to mirror entire parts of the screen or anything like that, but streaming videos did seem very fast on the Chromecast. I also played a YouTube video from my phone. Similarly, a new box is in the corner that allows you to send the video to the Chromecast.Other notesI have no idea what the future for the Chromecast looks like. I do believe, though, that Google typically opens their software up to more development than Apple does. Unless you have a specific laptop that can mirror to the Apple TV, the two products are very similar. On Apple TV you can watch and listen to local media which is nice. The difference between $35 (or $11 for me) and $99 is pretty drastic and I don't personally think the added functionality of the Apple TV is probably worth that.  If you already have an Apple TV, you probably don't need a Chromecast. If you don't have either, I'd snag a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 5.0, "review": "So affordable. $35 for a nice device and 3 months of Netflix (~$24). I'm looking forward to try this device out on my TV.", "verified": false, "helpfulness": "9/138", "author": "TVguy"}, {"rating": 5.0, "review": "This Is an awesome looking dongle! This will absolutely change the TV world! I will post more information after mine arrives tommorow.", "verified": true, "helpfulness": "10/157", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Google has a new innovation, the Chromecast, a HDMI dongle that can \"cast\" content from supported mobile apps to your TV using WiFi. The other innovation is the ability to cast content from your computer's Chrome browser tab (assuming you have a decently powerful computer), such as Amazon Instant and Hulu.Note this just came out a few days ago, and it will be better with time as more developers create apps that can use this. This has huge potential and I believe that Google is going to rule the living room with this 2-inch low-priced device, Google has learned from the failure of the Google TV platform to become mainstream.", "verified": true, "helpfulness": "1/3", "author": "Franklin Morrison"}]