[{"rating": 5.0, "review": "It's a very good product to watch movies/tv serious from the computer at the tv and also it's very good to present presentation at work to people from the laptop so they can watch it on a bog screen.", "verified": true, "helpfulness": "0/1", "author": "Reut halevy"}, {"rating": 4.0, "review": "The app works fine but because of the size it only fit one of my TV's. it was a little trick to download but now it is running fine. I use my smartphone to run it which is cool. They need to make it smaller to fit all TV's.", "verified": true, "helpfulness": "0/0", "author": "K. Funk \"kfunk\""}, {"rating": 5.0, "review": "Simple to setup and works flawlessly. I like it so much I am buying another one. I would recommend this to anyone who is looking for a cheap way to stream youtube and netflix to their TV.", "verified": true, "helpfulness": "0/1", "author": "Rashpal"}, {"rating": 1.0, "review": "No use of it. It was a surprise for me that android version of chrome don't support chromecast. The only app on android that supports chromecast and that I am using is Youtube. But Youtube app can cast video to my TV without chromecast. I don't need to cast from my PC, but i experimented with it, and it has serious lags when casting from chrome in 720p.", "verified": true, "helpfulness": "5/7", "author": "Stepan Orda"}, {"rating": 4.0, "review": "KNOW WHAT U R GETTING FIRST!!!So, if you are planning on getting one of these things just know: you cannot stream ur own media...at least not right now. This perfect for \"dumb\" TVs or for bypassing most \"smart\" TV interfaces that aren't good anyway. At the moment of this write up it works with: Google media (YouTube and Play apps), Netflix, HBO Go, Pandora and Google recently created a SDK so more apps should be on the way to allow you to use this device the way you want. Set up is a breeze, i used the IOS app to do it and it took like three minutes and the only problem I have had is that once it would lose the stream, it would just throw up an error message, in order to rectify this all I had to do was detach it from the television and its power source and re-plug it in a \"reboot\" if you will. All in all its a good device and does what it's asked to 99% of the time.", "verified": true, "helpfulness": "0/1", "author": "jim"}, {"rating": 1.0, "review": "What a useless little device.  Its really nothing more than a glorified Youtube player.  If you are tech-savvy you probably already have a smart internet-connected TV or a Roku or a laptop with HDMI output, all of which do way more than this guy.  You can \"throw\" Youtube from your computer to your TV but that's about it.  Oh...and it does Netflix but not if you're running Linux ('cause Netflix refuses to support Linux on philosophical grounds...but that's another tale.)  I didn't test Netflix since we're a Linux household, but I'd expect it works fine.  But again, there are so many other ways to watch Netflix who needs an extra dongle.  By the time you click your remote to select this HDMI device, you could have selected the native Netflix app on the TV or cranked up your Roku.  It does Google Play Movies as well as Google Play Music but this device doesn't add any functionality.  My Google Music connects via bluetooth directly to my sound system.  Why would I want to run the TV just so I can throw music from my phone or computer to the TV and then back through the sound system.Lastly and this is no big deal, but some really smart programmers figured out how to root the Chromecast within days of its release.  They added all kinds of functionality but Google quickly found a way to re-handicap its device forcing an automatic \"upgrade\" as soon as it powers up the first time.  This blocked the root exploit.  So rather than create a device and let smart people all over the world figure out how to make it do the coolest things, they chose to prevent its real use by keeping it handicapped.So buy this if you really have no way to watch Netflix on your TV.  Or if you want to buy movies from Google Play.  Or just can't get enough Youtube.  (As if....)Google continues to prove its not in the business of creating new and innovative hardware or delivering content in new ways.  Its about collecting information and selling it.This thing didn't add anything to my technology experience.  Thanks to Amazon for accepting a return.", "verified": true, "helpfulness": "4/6", "author": "Dr. Don Olive"}, {"rating": 2.0, "review": "Really not enough apps for this and you cant stream your videos or picturesBad can not recommend for now till new apps", "verified": true, "helpfulness": "0/0", "author": "Scott R."}, {"rating": 4.0, "review": "I was using a Trendnet TEW673 GRU router and apparently this gadget is incompatible with the router. On set-up it got me up to the point of \"ready to cast\" but it cannot be found on the network so it will not proceed to download the extension. Called technical support and they were not able to resolve the issue. Looked on the troubleshooting guide and there is a list of compatible and incompatible routers there. Only one model of Trendnet router was listed there which was compatible but unfortunately my router was not it. To solve the problem I bought another router, since my old router was no longer supported by Trendnet,  which was on the list and set-up was a breeze from there.  Totally satisfied with the performance of the product after set-up.", "verified": true, "helpfulness": "0/0", "author": "R. Locsin \"rayman\""}, {"rating": 2.0, "review": "I was really looking forward to using the Chromecast. I ended up being severely disappointed. The controls on mobile are a bit wonky and sometimes it doesn't recognize that a Netflix episode is over, so I have to completely close the Chromecast app and the Netflix app to reset it. It seemed to get better with time, but it's not perfect.Netflix and Youtube seem to stream fine via Chrome browser, but you can't stream much else. It's awful. This is pretty much the only reason I bought the Chromecast, and it doesn't even work. Try to stream a video on a tab? Prepare to watch either a very small video or just listen to the audio! You can watch it small - as it comes in a normal tab - but as soon as you make it full screen, the TV screen goes black. The audio continues to play. It's apparently a very common problem and there doesn't appear to be a fix.Overall, this product isn't worth it. Get a Roku. The interface is better, they have working remotes, and they actually work like they should. I'd give this a one star, but I recognize that they're working on it. It has a long way to go before it gets above two stars for me. Right now, it's just a crappy Netflix browser.", "verified": true, "helpfulness": "0/0", "author": "KRM"}, {"rating": 4.0, "review": "I bought this instead of a smart Blu-ray player for use in a bedroom, since there is a PS3 in the house that play blu-rays and have access to most apps. It is extremely easy to set up and use and every app I've used with it has worked very well. If you subscribe to HBO, access to HBO Go has been limited to mobile devices / tablets and XBOX Live (which I refuse to pay for because, Netflix, Hulu+ and various other entertainments apps should be free considering, you pay for those services individually). Being able to catch up on full seasons of shows using an actual television -- not a smaller-screen device, or sitting in front of a computer -- makes the price of this well worth it. It's also really good for listening to music, especially if you have a Google Music subscription. It is small enough to conveniently travel with, so you could use it in hotels and in other's homes (and maybe even the Doctor's office, if they have WiFi and you feel so inclined). I think the apps that currently work for this device and potential for more app support in the future makes this a good deal.", "verified": true, "helpfulness": "0/0", "author": "Rawrrbot"}]