[{"rating": 5.0, "review": "Awesome product liked it very much, Of good use to me will recommend the same to my friends as well", "verified": true, "helpfulness": "0/0", "author": "Senthilkumar Balakrishnan"}, {"rating": 5.0, "review": "They need more apps, but they'll come. It works great for Hulu, Netflix, etc. I just wish there was a player that played from a network drive and casted. Android's default player casts fine but doesn't stream from a network source. Once that's possible (likely through another player that uses Chromecast that some other developer will need to build, I don't think Google will), then this thing will be a big time win and replacement for HTPCs.", "verified": true, "helpfulness": "0/0", "author": "T"}, {"rating": 5.0, "review": "Their ability to update the software and create new native streaming apps makes a 5 star review easy to give.", "verified": true, "helpfulness": "0/0", "author": "tboatcap"}, {"rating": 5.0, "review": "I hooked this to a tv in my bedroom that I do not have a satelite box for. Very easy to configure and works great with my android phone.Ive only used it for pandora, netflix, and youtube. Its hard to tell by the description but the usb cord comes with the device approx 24\" And if your tv doesnt have a usb hub it has a wall adaptor instead.", "verified": true, "helpfulness": "0/0", "author": "Craig Burk"}, {"rating": 4.0, "review": "Get it! This purchase will decrease your need for cable or any of the other options. It provides access to all the programming (free) needs I have. I may not be able to watch a program on the day it is broadcast but free + a day later certainly is worth it.", "verified": true, "helpfulness": "0/0", "author": "Dr C"}, {"rating": 4.0, "review": "Pros:Very affordableCan use with Apple and Android devicesEasy to useSimilar selection of Apps available to cast as Apple TV (Netflix, HBOGo, Hulu Plus, Pandora...)Cons:if you're casting videos from your browser from any random website the audio and video doesn't sync up sometimes.", "verified": true, "helpfulness": "0/0", "author": "Eden"}, {"rating": 3.0, "review": "Chromecast is not a bad device, but I do feel that it needs more service. The setup was sort of difficult as I tried using my laptop and desktop to have the HDMI dongle to connect to my wireless. I end up downloading the Chromecast app for my android device and was able to connect Chromecast to my wifi - what I found out is that is the device temporarily disconnects you from the internet which is the reason why I was unable to use my desktop and laptop. Using my phone was much easier as when my wireless was dropped from the android, I still had connectivity, my 4G.As far as the apps goes, Google did provide more apps to this device since my initial purchase back in November which are:  VEVO, Red Bull.TV, Songza, PostTV, Viki, Revision 3, RealPlayer Clound, Plex, Avia, and BeyondPod. Some of these applications require subscription to the services. With all the apps that are compatible to Chromecast, one major dislike was the fact that in order to view what's on my screen, I have to download the application to my device whether that be my phone or tablet and stream them. I'm used to the Roku way where all of its built-in apps are on the device itself, I may have to download it from Roku's store but it's on Roku's device and not mines.Google Cast - I haven't truthfully used it, but when I did it was horrible video streaming to the point it would disconnect and maybe it was because of bad network connectivity in the house. I am just now starting to use the \"Index of C:\\users\" (file:///C:/users) or as they say, anything in the folder you can stream to your Chromecast. There is also some lagging issues with this dongle as well.", "verified": true, "helpfulness": "0/0", "author": "C. Brown"}, {"rating": 4.0, "review": "I gave this 4/5 stars because it cannot do Amazon streaming. That really bothers me because that is the one thing it is missing. Other than that I love this thing. Very affordable, plays Netflix - i'm done.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I couldn't wait to get one and I just Love it!!!!But when I use my phone it had to be close to connect", "verified": true, "helpfulness": "0/0", "author": "nitra"}, {"rating": 5.0, "review": "The apps are coming! So far I use this mainly for Netflix and HBO Go- works very well for the price. Let's not kid ourselves- for the price it lacks a remote, power supply etc, but this is the best device for it's price to stream to TV.", "verified": true, "helpfulness": "0/0", "author": "Tim"}]