[{"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "mmac"}, {"rating": 5.0, "review": "Incredible,just so many movies and tv shows to choose from.Should have done it sooner", "verified": true, "helpfulness": "0/0", "author": "Jeffrey B \"Jeffrey Bilodeau\""}, {"rating": 1.0, "review": "Remote eats up batteries.  I spend way more time trying to get the d@mn thing to work than I do using it.  It's on its way to the UPS store so it can return from whence it came.  Very disappointing.", "verified": false, "helpfulness": "2/5", "author": "KC"}, {"rating": 4.0, "review": "Not as much free content as I expected, but the system was easy to set up.  We were online and viewing videos within 15 minutes.  Not sure why they don't include a HDMI cable with the system - fortunately we had one.", "verified": true, "helpfulness": "0/0", "author": "Duffy \"luvfiction\""}, {"rating": 5.0, "review": "Great little device smaller than an apple tv 2/3, would definitely recommend. You can even do airplay if you have an iPhone with an app, has much more features than the Apple TV. I especially like that I can play tv shows and movies from my amazon Prime Member account. If you want to buy this don't give it a second thought really recommend the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Joab Vazquez"}, {"rating": 5.0, "review": "Great movies, hook up is easy, bought my son in law a Roku for Christmas so I decided to try the Fire TV and it's great, I think I got the best deal.", "verified": true, "helpfulness": "0/0", "author": "Gary B."}, {"rating": 4.0, "review": "I love my new Fire TV. It's fast, works well, and has lots of apps I enjoy. I would give it 5 stars except for one major flaw- the Hulu app does not work very well. The commercials play fine, but then once the show starts, the video and audio will be there, and then all of sudden, the video cuts out while the audio keeps playing. I know this is likely a Hulu problem, but its a major issue since Hulu and Netflix are probably the 2 most used apps on this device. All other apps work really well.Overall, I think its a really simple to set up and use device that even most tech averse folks would enjoy. Do make sure you buy an HDMI cable though- my brother bought a fire tv thinking the HDMI cable came with it, but it does not.", "verified": true, "helpfulness": "0/0", "author": "C. Nicole Trevino"}, {"rating": 4.0, "review": "Very simple setup and use.  A little confusing to sort out what is \"free\" with Prime and what isn't but very easy use and played immediately.  Happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "RexZee"}, {"rating": 5.0, "review": "Fantastic product, easy to install. Able to watch Netflix or Prime shows within minutes, shopping, music etc...Between Apple TV or Amazon Fire TV I would go Amazon Fire TV due to the cost & Prime capability alone, purchasing Amazon products while streaming Pandora all on the surround sound from my TV is awesome. In addition, the programming is much more intuitive to understand & user friendly.", "verified": true, "helpfulness": "0/0", "author": "Matthew Ryan Drew"}, {"rating": 5.0, "review": "Very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Shawn W. Heinle"}]