[{"rating": 5.0, "review": "love this product.  I refuse to get cable but this allows me to indulge in my guilty pleasure of trash tv.", "verified": true, "helpfulness": "0/0", "author": "linda lemon"}, {"rating": 1.0, "review": "WOULD NOT WORK WITH MY APPLE I PAD", "verified": true, "helpfulness": "0/1", "author": "ccmunson"}, {"rating": 1.0, "review": "I've spent my entire morning trying to set this thing up.  I have trouble shot my modem, my router, I have started and restarted the chromecast device, nothing helps.  I'm done, I will be returning as soon as possible.  BTW, I built my own media room, my own wireless home audio system, I access multiple computers across the country via multiple vpn's, I am very IT savvy, I can't imagine most of the people I know being able to run the types of troubleshooting I've been asked to do to get this device to work.  I love you Google, but you can keep the chromecast, my experience was an epic fail.", "verified": true, "helpfulness": "0/0", "author": "Curt R."}, {"rating": 5.0, "review": "Really great for watch the best shows you missed. Just don't have games on it for the kids. But I loved it cause you can watch it on any device and more than one show at a time.", "verified": true, "helpfulness": "0/0", "author": "krystal"}, {"rating": 5.0, "review": "This works great on my laptop but not at all on my tablet.", "verified": true, "helpfulness": "0/0", "author": "Charlie \"Charlie\""}, {"rating": 5.0, "review": "Wonderful product for the price. Streams with my MotoG & iPod. Great quality picture. Pleased with this purchase. Works well with Netflix & You Tube.", "verified": false, "helpfulness": "0/0", "author": "moriel73"}, {"rating": 5.0, "review": "Can't really express how much I love this device.", "verified": true, "helpfulness": "0/0", "author": "Brian Horakh"}, {"rating": 5.0, "review": "very very nice! like a lot...i hope more apps will be compatible.", "verified": true, "helpfulness": "0/0", "author": "Radhames Carrasco"}, {"rating": 5.0, "review": "It works flawless with android devices, the clone or cast view option makes the possibility of play device games on TV an also all media or software available including online movies and so. I use it sometimes to check the security cameras on real time. Same thing with the option of Google Chrome web browser all screen view, (on laptop or PC with windows 7 and above) make possible to share for example, PowerPoint media, movies, etc. and also games, but easy ones that not demand heavy hardware use, otherwise the lag make it impossible to play. The YouTube party option is other nice thing making the moment more enjoyable. The possibilities of use of this device make it one of the most versatile gadgets of the market because it goes beyond the normal stuff; I have it connected on one Smart TV because it takes too long to connect to other PCs or devices on the wifi network with the onboard smart tools. The device is so good that make me buy other one to connect on other TV. I buy some others to send as a gift to family members.", "verified": true, "helpfulness": "0/0", "author": "Javier Salazar"}, {"rating": 1.0, "review": "You've got to download an assortment of apps onto your phone, iPAD, and PC for the various things you want to stream, but there are no apps for Windows phones (last I tried).The pause and play functions are too slow--so you miss the points you want to pause, try to back up, but go too far, try again, and miss again, etc. A real waste of time.It was tricky trying to start a Netflix movie. You've got to watch for the secret button and tap it at the right moment to get it to go to your TV. If you miss it, then you've got to retry, but the secret button doesn't always show up.Works okay with youtube.I couldn't get my PC to cast to my TV. (Just use an HDMI cable instead. So you've got a cable going across the floor, but it works instantly and flawlessly!)I replaced my Chromecast with a Roku stick and a real remote control. The pause/play response is still slow compared to a regular Roku, but it's much better than Chromecast and it streams everything Roku streams, simply and efficiently, without all the crazy apps.", "verified": true, "helpfulness": "0/0", "author": "manlius"}]