[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent product. I have been it form the time I received the Cromecast.", "verified": true, "helpfulness": "0/0", "author": "Roger Dougherty"}, {"rating": 5.0, "review": "Great addition to tv!", "verified": true, "helpfulness": "0/0", "author": "Clayton C. Duffin"}, {"rating": 2.0, "review": "This device constantly freezes my computer and lags when watching videos. Roku and Apple TV are muchhhhhhh better products.", "verified": true, "helpfulness": "0/0", "author": "Jordan Brown"}, {"rating": 5.0, "review": "Works just fine", "verified": true, "helpfulness": "0/0", "author": "Renee Huffman"}, {"rating": 1.0, "review": "I have had all sorts of trouble getting this thing to work. Sometimes it powers on, but most of the time I get an error message on the screen. I hear from my friends that I must have a defective unit, but after having all this trouble I lost interest in this device altogether.", "verified": true, "helpfulness": "0/0", "author": "Bryant Sombke"}, {"rating": 2.0, "review": "My Chromecast worked fine for 6 months, Suddenly it stopped displaying () with the message no signal but I was able to access the device over the network. I raised a request with Cromecast Support, they are so pathetic look in to the issue, every time when call them they asking me to repeat the same old steps. I have been waiting for more than 15 days to some solution, there is no proper reply even its over call or mail. I suggest not buy this product, they are having horrible product support.", "verified": true, "helpfulness": "1/1", "author": "Subramaniam Srinivasa"}, {"rating": 3.0, "review": "I did not know that it would only work with a specific browser.  that should be made clear", "verified": true, "helpfulness": "0/0", "author": "Rick Starkweather"}, {"rating": 5.0, "review": "Easy to set up and it works great.", "verified": true, "helpfulness": "0/0", "author": "Allenboy"}, {"rating": 5.0, "review": "works great, easy to install", "verified": true, "helpfulness": "0/0", "author": "T. White \"tool fool\""}]