[{"rating": 2.0, "review": "Would of given a better review but I was charged 99.99 for the free trail. Besides that it's great.", "verified": false, "helpfulness": "0/6", "author": "James Schooley"}, {"rating": 5.0, "review": "easy to setup and operate", "verified": true, "helpfulness": "0/1", "author": "Henry W. Rodgers \"william\""}, {"rating": 5.0, "review": "I had no problem understanding how to use the Amazon Fire TV.  I enjoy the movies that it offers. I do recommend it.", "verified": true, "helpfulness": "0/1", "author": "shadiamond"}, {"rating": 5.0, "review": "I'm testing this device. Sometimes, unexpectedly, the Fire TV do not recognize the voice search sent from the remote. Everything else works excellent.", "verified": true, "helpfulness": "0/1", "author": "Luis Guevara"}, {"rating": 4.0, "review": "This is not a review but a question to users before I decide to buy.  Usually there is a way to ask questions but I cannot find it for this product.Every product that I have seen for streaming music and movies require you to have your own ISP.  Other than cable, Dish and a few Ethernet connections, data usage is exorbitant.  I have a Verizon Hotspot and it costs $10 per Gb of data usage.  So, Hulu, Netflix, Amazon, who offer really low monthly access to volumes of programming sounds like a great deal until you realize what your broadband service provider is going to charge you.If you go to the Hulu website, they estimate one Gb of data usage per hour of standard  quality viewing and up to 3 Gb per hour if viewing high definition, high quality programming.  So, if I watched one hour per night of Hulu content, I would end up paying Verizon for 30 Gbs of streaming data or $300 - HDTV would be $900 for the same 30 hours per month.Am I missing something?  No one seems to be including the cost of your data streaming.  One article estimated the average cable user consumed 300 Gbs of data streaming ($3000 with my Verizon ISP).  Even many of the services and interactive features on Dish satellite expects a customer to use their own broadband - internet connection.If someone knows where an internet provider is charging significantly less for their data usage, please let me know.  (The few that are trying to provide much more data are bundling it in family plans which don’t help individual users very much).Can anyone explain to me why this 500 lb. gorilla is not discussed?", "verified": false, "helpfulness": "0/8", "author": "Mitch"}, {"rating": 4.0, "review": "Love my fire tv. Crazy fast and the voice search work perfectly. Only complaint (and its almost a deal breaker) is the lack of Comcast support for HBO GO and Showtime Anytime. Come on Amazon! Put the pressure on Comcast. Your hometown is Comcast territory.Also need Tennis Channel support.", "verified": true, "helpfulness": "1/3", "author": "Ryan Boone"}, {"rating": 5.0, "review": "I love it. I could watch anything I want with only low cost.", "verified": true, "helpfulness": "1/3", "author": "sincere"}, {"rating": 5.0, "review": "Very easy setup, seamless streaming, fun extras. Can sync with phone to display photos and video. Menus are easy to navigate and intuitive. Game selection is limited for freebies.", "verified": true, "helpfulness": "1/2", "author": "Michael Roller"}, {"rating": 2.0, "review": "Not at all that impressed.  I can get the same thing from my PS4, it gives me pretty much the same options as the fire tv.", "verified": true, "helpfulness": "2/3", "author": "Nikki"}, {"rating": 5.0, "review": "Finally...love being able to watch on my tv.  Didn't even need to get help hooking up.", "verified": true, "helpfulness": "1/2", "author": "CCS \"Tatoo Lady\""}]