[{"rating": 1.0, "review": "its junk and it works poorly, screws up my internet, the audio follows the video when it DOES work, I went back to a hdmi cable, save your money", "verified": true, "helpfulness": "0/3", "author": "fred flintstone \"Bountyhunter\""}, {"rating": 2.0, "review": "This was a gift for my sister, after installation her remote would work with device. So she can not use it.", "verified": true, "helpfulness": "0/2", "author": "kiki"}, {"rating": 5.0, "review": "easy to set up and works great", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Best thing ever! Love it. Easy to use with Android devices and is super affordable.", "verified": true, "helpfulness": "0/0", "author": "Kristel Yee Mon"}, {"rating": 4.0, "review": "Easy to set up and use, works very well. I would give it five stars if the mobile chrome browser could cast to it", "verified": true, "helpfulness": "0/0", "author": "DaNJeR"}, {"rating": 5.0, "review": "LOve it", "verified": true, "helpfulness": "0/0", "author": "edee bolognesi"}, {"rating": 5.0, "review": "Chromecast has one of the simplest setup interfaces for any kind of electronic device I've ever used. At 30 bucks, I can't believe I hadn't ordered one before. If a non-Google company had built something like this first and tried to sell it through Best Buy, it'd be at least $100, but Google comes to the rescue again. If you use tablets, your smartphone, or your laptop to watch Netflix, HBO Go, Showtime, YouTube, or even to stream Spotify or Pandora, coupling that up to a Chromecast gives you instant wireless connection to your home entertainment system. Highly, highly recommended.", "verified": true, "helpfulness": "1/2", "author": "Dan"}, {"rating": 5.0, "review": "!All perfect!", "verified": true, "helpfulness": "0/0", "author": "Fernando Ramirez"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Roylan Alvarez"}, {"rating": 5.0, "review": "The best thing I bought myself in a while. The setup is easy and there are new apps being added regularly. This tiny device does a lot and I love it.", "verified": true, "helpfulness": "0/0", "author": "Jazmin N. Lewis"}]