[{"rating": 5.0, "review": "Everything was OK.", "verified": true, "helpfulness": "0/0", "author": "Soledad Pawlyna"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I use this chromecast on a weekly basis. It is great to be able to beam to your TV instead of having to watch it on your small phone/tablet. It is also cool at parties when you and your friends can queue up different music videos on youtube so everyone can listen to the different kinds of music that they like.My only qualm is that occasionally when Youtube pushes out an update it causes some frustration as it some times breaks the playlist function making it annoying to queue up videos however that is in no way the products fault.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 5.0, "review": "Love it thank you", "verified": true, "helpfulness": "0/0", "author": "Jennifer Fellows"}, {"rating": 1.0, "review": "Sucks.....", "verified": true, "helpfulness": "0/0", "author": "JHS \"Joelb\""}, {"rating": 4.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "phuoc p thach"}, {"rating": 5.0, "review": "I have FiOS and love on demand but when I decided to use TiVo DVR\"s I lost my ability to do on demand for some of my favorites channels. At first this unit did not support as many apps but as of today it casts on the following apps.HBO, STATZ, SHOWTIME, EPIX, ENCORE, FX NOW, VUDU, Disney, Travel Channel to name a few.....Overall this is great I open my iPad or iPhone log in though TV provider once and cast away. It's great quick and inexpensive.Only one caveat which I had to address if your wifi connection is not strong where you plan on casting you will see plenty of buffering. I had to add a range extender in order to alleviate this besides that issue I strongly recommend it if your looking for the big on demand content for movies & TV series.", "verified": true, "helpfulness": "0/0", "author": "Isaac"}, {"rating": 4.0, "review": "The chrome cast is great but the reason why I give it a four star is because I have a note 3, I usually mirror my screen to my tv but sometimes it looses connection. The MHL adapter is better", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Manol"}, {"rating": 5.0, "review": "However was not compatible with my Sony Bravia so had to return.", "verified": true, "helpfulness": "0/0", "author": "jssell"}]