[{"rating": 4.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "K"}, {"rating": 3.0, "review": "Goggle Chromecast is not what it is cracked up to be.  I was looking for something with a real easy setup and interface, but this is not it.  In order to obtain some network broadcasts, you have to login to your cable provider, which is what I want to get away from.If you want TV, then try Roku.  If you want movies and such and have an Amazon account, then try Amazon's firestick.", "verified": true, "helpfulness": "0/0", "author": "StuckNCorona"}, {"rating": 5.0, "review": "bought this for my very un-tech savvy in-laws and they love it! They were able to set it up and use it all on their own and asked me to take it back because they weren't getting anything else done around the house ;)", "verified": true, "helpfulness": "0/0", "author": "Barrel Racing Momma, RN."}, {"rating": 5.0, "review": "Using it everyday", "verified": true, "helpfulness": "0/0", "author": "Derek Scott"}, {"rating": 2.0, "review": "When Chromecast works, it's great. Sadly, it is incredibly inconsistent and I no longer use it. My primary intended use was to stream Netflix, but I have gone back to using my Wii despite all the things I have to hook up and connect that take up a lot of space.THE GOOD: Inexpensive, very slim, transportable, great concept, very cool and easy navigation via your smartphone/tablet, friends can use it too on guest mode, can scroll through your pictures as a backdropTHE BAD: Oh sweet thing...you are so unreliable. It works more often in my living room (router nearby!) but much less often in my basement. However, all other WiFi products work just fine in all areas of my house. For this reason I would argue it would work better where there is a very very very strong WiFi signal...however, even 15 feet from my router, Chromecast **DOES NOT ALWAYS WORK*** I cannot ever count on it. Sometimes it will connect and I will start a movie, then when I want to pause it later, my smartphone and tablet act like I'm not connected to Chromecast anymore.I made an important realization. First I thought my WiFi could be the issue, HOWEVER, Netflix proved me wrong. As I write this review I am sitting in my basement, and when I open my Netflix app on my smartphone, I can stream to a smart tv in my house that is literally SOOO freaking far away that it is basically in another neighborhood. Okay but really it is two levels up and on the other side od the house. However, where is Chromecast to be found? Apparently, I have 100% luck streaming to a smart tv from across the house, but like 65% luck casting with Chromecast to a tv 3 feet away from me.BOTTOM LINE: Disappointed. If you have a very strong WiFi signal maybe you will have better luck than me, but it seems this is harder to work with than other comparable technologies that involve HD media. Do not use this for anything important like a college presentation as it will not help you there!", "verified": true, "helpfulness": "0/0", "author": "Joe Welch"}, {"rating": 1.0, "review": "I can stream things to the tv fine, but it's usually impossible to stop them playing. Chromecast will time out from your device, and it becomes impossible for it to stop playing. I have cut off the internet, shut off the device, but it still plays. It's impossible to pause/change any video. Great when it works, but you basically need to unplug it to stop.", "verified": false, "helpfulness": "0/0", "author": "noel navar"}, {"rating": 2.0, "review": "It's great when it works, but it consistently loses connectivity and has to restart and reconnect. I have a very robust WiFi network in my house, and this was right across the hall from my router. I really wish it worked better, because it's a really good idea.", "verified": true, "helpfulness": "0/0", "author": "Tony Greco"}, {"rating": 5.0, "review": "Very convenient and simple to use.", "verified": true, "helpfulness": "0/0", "author": "Acspartan12"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Sunderll"}, {"rating": 5.0, "review": "Cool product!", "verified": true, "helpfulness": "0/0", "author": "Eduardo Castaneda"}]