[{"rating": 5.0, "review": "This is perfect for my family. UI is good, UX is good and it's easy to understand how to use. Usability of remote is also good. Everything is perfect to use.", "verified": true, "helpfulness": "0/0", "author": "Takuya Watanabe"}, {"rating": 5.0, "review": "Way beer than apple TV.", "verified": true, "helpfulness": "0/0", "author": "Jaysters"}, {"rating": 5.0, "review": "Best purchase I have made in a long time. Thanks to this product I am saving $50.00 a month off of cable", "verified": true, "helpfulness": "0/0", "author": "Brenda Meeks"}, {"rating": 5.0, "review": "Excellent choice.", "verified": true, "helpfulness": "0/0", "author": "Denver"}, {"rating": 1.0, "review": "I don't feel I would have access to many movies if I didn't sign up for Amazon Prime.  Also, It seems it would be easy for any family member watching Amazon to order something without my permission.  It seems that everything cost money and I am sorry I bought it.", "verified": true, "helpfulness": "1/3", "author": "Davenport"}, {"rating": 5.0, "review": "My only Internet.  Is my phone..How or what do i need to get this to work on my nonconnetted tv", "verified": false, "helpfulness": "0/0", "author": "Paul e. turner"}, {"rating": 4.0, "review": "works great just what i needed", "verified": true, "helpfulness": "0/0", "author": "Mark Covey"}, {"rating": 5.0, "review": "It's just amazing.  I'm at a lost of words.  I put this in my bedroom so I could watch internet TV.  The wifi works amazing well I have no problems at all.  I can watch all my prime movies and TV shows.  Best of all the box came pre-loaded with my account so when I turned it on all my Prime movies and TV shows were already for me to us.  And to my surprise all of my digital music that purchased is also available.  So i have the choice of watching TV or listening to my music library.  I'm telling you it is amazing.  This is a very small box but what it provides is just the best.  I can't imagine watching TV without this box that is how good it is.  If you are considering getting this box it is well worth the money.  If you don't have a prime membership then you should get one to enjoy the full benefits of the box.", "verified": true, "helpfulness": "1/1", "author": "Susan Duffy"}, {"rating": 3.0, "review": "It works fine but I feel like the March madness app that is \"compatible\" with it was a bit deceiving. I don't have a fire but need one to make that work", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 3.0, "review": "Pros:Menus are well laid out and intuitive to navigate.Head unit responds quickly to commands from the remote.Voice search works great.Glad to be rid of the ROKU box.Connects to my wired network instead of WiFi.Cons:Can not control Fire with my Harmony One universal remote.Small remote, easy to lose.Did I mention that I can't control the Fire with my Harmony One? Wish I had known that before. I would never have bought it. Now I'm forced to have two remotes with me.Can not turn the Fire off, has to time out and go into sleep mode. Just what I need, more electronics in sleep mode. Updates and downloads content while in sleep mode. Really? In this world today they're crying about burning coal and going to LED lighting to save 5 cents a month and they allow electronics to go into sleep mode? (secretly only turning off the display while the box is active on the network).Conclusion:I like the Fire despite the cons. Movies aren't any more clear, sound is still Dolby D but.. to rid myself of that confound ROKU. I'm happy.Thought the voice search would be a gimmick but it's actually very handy. The Fire itself seems to be well made, solid and smaller than I thought it would be. Fits right under the edge of my TV and blends in nicely.", "verified": true, "helpfulness": "0/0", "author": "James D. Holbrook \"James H.\""}]