[{"rating": 5.0, "review": "Great product! Very easy to install and use, especially for Amazon programs, but also fine with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Connie McNeill"}, {"rating": 5.0, "review": "Best investment ever. Great movie quality,  lots of options to choose from. Kids love the games and the game remote is awesome. The speak to search is also a great feature. Since my youngest can't spell very well its a great way for them to search for favorite shows and movies", "verified": true, "helpfulness": "0/0", "author": "jason morris"}, {"rating": 5.0, "review": "I've been using an Apple TV for streaming for several years, and getting this Fire TV has been a revelation.  This machine has all of the same apps as the Apple product, but has a true advantage in hardware and is much smoother in operation.Pros:- Load times are shorter than the Apple TV- Default apps are comparable to Apple TV and movie selection is great- 1080 streaming works flawlessly.- Other apps are available without any jailbreaking/rooting...things like that.  You can enable developer controls and install other apps from the app store any time.  This is a HUGE bonus as you dont have to wait for people to develop FireTV specific apps.  If it's available in the Google Play store, you can load it.Cons:- No HDMI cable included.  You will need to buy one of those.", "verified": true, "helpfulness": "0/0", "author": "Nathan Lucas"}, {"rating": 4.0, "review": "I bought this for my parents so they could stop paying so much money for DVDs of the shows they like and it's been a god send.  My parents are extremely computer illiterate, but they had no trouble adapting to this device.  It's setup very intuitively and the remote is large enough and clear enough that they don't have any problem losing it or not understanding what the buttons mean.I have experience using both the Chromecast and Roku boxes - I now have a smartTV myself - but my parents would have been too confused with these items.  Maybe not the Roku, but I still think the Fire TV's layout is much more intuitive and functional for their needs than the Roku.", "verified": true, "helpfulness": "1/1", "author": "bekki"}, {"rating": 5.0, "review": "Absolutely the best media box on the market.  Amazon has hit a home run with this device.I'm getting one for every tv in the house.", "verified": true, "helpfulness": "1/1", "author": "Kevin Jensen"}, {"rating": 3.0, "review": "Meets expectations. User interface, particularly search function needs to be more user friendly. Search is the biggest pain point.", "verified": true, "helpfulness": "0/0", "author": "Dwaraka Karanam"}, {"rating": 1.0, "review": "Big disappointment.  I don't understand why key amazon streaming features like Music Unlimited for PAYING SUBSCRIBERS aren't even supported on Amazon's own streaming media player.And the rest of the apps offering for the fire TV are disappointingly few in comparison to the rest of the amazon app store (much less in comparison to the regular Google play store...)Honestly, I'd recommend just getting a Roku box.", "verified": false, "helpfulness": "1/1", "author": "AK"}, {"rating": 5.0, "review": "Purchased for kids and they love it.  Surprised how fast it loads videos and been working great!", "verified": true, "helpfulness": "0/0", "author": "gjek737"}, {"rating": 1.0, "review": "Can't watch a movie without buffering.", "verified": true, "helpfulness": "1/4", "author": "Allan D."}, {"rating": 5.0, "review": "it sure did :)I cant start describing how great it is , Im speechless", "verified": true, "helpfulness": "1/2", "author": "Yousef Mohammad Asiri"}]