[{"rating": 4.0, "review": "Works as advertised, good for Netflix and youtube as well. Makes it easy to buy from amazon and seems geared toward doing so, as in anything I search for brings up an amazon item. So geared towards buying from amazon that it is sort of a negative for me, so minus one star. The device sets up easily, remote works well, if you are a big amazon customer, buy a lot from them you will like it. A lot of shows you might want to watch on prime might be the first season free, then you have to buy the next season, or pay per episode.", "verified": true, "helpfulness": "1/1", "author": "R. Griffin \"R. Griffin\""}, {"rating": 4.0, "review": "Why do I have to pay for anything I wanna watch on Amazon Prime? Netfix is much better!!!!", "verified": true, "helpfulness": "0/1", "author": "Robert A. Gentry \"Music, Movies ,My Besrfriends\""}, {"rating": 1.0, "review": "I set it up fairly easily, but found out the content I wanted was not available--most importantly to me, the PBS programing.  When I contacted Amazon Fire number about when/if the content would be available including issues with HBO (it was not available at the time although it had been announced it was) I was told they didn't have that information.  An email was sent instead, telling me to call the Fire number. I called again--I bought it early, and they just weren't ready.  So maybe it is better now--but I returned it and bought a ROKU Plus instead.", "verified": false, "helpfulness": "3/6", "author": "Judy K M"}, {"rating": 1.0, "review": "Great idea but most movies do not have sound.  Tech support speaks poor English and no resolution.  Good luck trying to get it replaced.", "verified": true, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love my Amazon Fire TV.  I use it all the time and am getting to watch several series of shows that were on a cable channel that I do not get.  I no longer have to get frustrated when there is nothing decent to watch.  I just switch over to my Fire TV and there is always something good on!", "verified": true, "helpfulness": "0/0", "author": "Gayle D. Austin"}, {"rating": 5.0, "review": "An amazing experience. Easy to navigate. Huge library. Love Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Shawn Hezar"}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "Maxine Daniels"}, {"rating": 5.0, "review": "The Fire TV was easy to set up and has been a joy to use. The box is small and sleek and has three ports - one for power, one for an ethernet cable, and one for HDMI.Once you power it on, you'll get a brief tutorial about how to use it and then you're ready to go. No need to log into Amazon, either. Just turn it on and go.The box is fast and responsive and the voice search works perfectly nearly every time. They also have a ton of apps and accessing them is pretty intuitive. We used to have a Sony Blu-Ray streaming player, but it was so and unreliable. It also cost us nearly 20 dollars more. Do yourself a favor and avoid that road altogether.The video quality is amazing, but the Amazon app needs some work. Primarily, they should add the ability to filter by Prime.Some caveats:The remote is very simple (and small) but it's actually very functional. There is an annoying tendency to lose it in the couch cushions, so it would be nice if it was slightly larger. Also, if there was a way to control volume, video source, and power for your television that would be awesome.Still, they aren't trying to do everything with this and I have to admire how tightly focused Amazon's design for the unit as a whole is proving to be.", "verified": true, "helpfulness": "0/0", "author": "William C. Anderson"}, {"rating": 1.0, "review": "Most of the shows I wanted to watch on hulu said they are only available on the computer. I can hook my computer up to the tv and do the exact same thing this does.", "verified": true, "helpfulness": "4/8", "author": "travis stroud"}, {"rating": 5.0, "review": "The interface is very smooth and clean, really easy to use and set up is a breeze when you already have a Prime account - connect it to the TV, plug it in and go.  Makes a great addition to the Roku box we already have on another TV.", "verified": true, "helpfulness": "0/0", "author": "R. Whiteheart"}]