[{"rating": 5.0, "review": "This is a fabulous tool, but I'm still learning how it works", "verified": true, "helpfulness": "0/0", "author": "Sherril A. Bennett"}, {"rating": 2.0, "review": "not for me", "verified": true, "helpfulness": "0/0", "author": "kmarshal"}, {"rating": 5.0, "review": "I wish I had this long ago. I love watching my Youtube videos and Netflix, but sometimes my computer screen just isn't big enough and I'm not a fan of going through my PS4. This is awesome. Using my TVs HDMI control setting, I just hit the little alternate screen icon and my TV changes to the Chromecast input. Either my computer or smartphone works well. The video quality is great and the number of compatible apps is plenty for me.I can also throw up photos or videos I've take if I want to share them with others instead of passing around my phone. I don't really have a need for that, but it's nice to know that it's there.I would definitely recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Brian Zak"}, {"rating": 5.0, "review": "Cheap and allows Chrome browser to be cast to the TV. I use it primarily to play youtube videos on the TV while controlling the playlist from my iphone or mac.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Didn't care for another power cord, bought a smart TV instead.", "verified": true, "helpfulness": "0/1", "author": "Armand"}, {"rating": 1.0, "review": "This device sucks.  I gave it to my son to watch Netflix on and it keeps dropping the connection and reloading or just pausing in the middle of movies.  It's a pain to watch.  I have  D-Link streaming device that works perfectly, and eventually I bought one for my son too.", "verified": true, "helpfulness": "0/0", "author": "Steve DeWitt \"Soundcurrentrider\""}, {"rating": 5.0, "review": "Already loved it, but love it even more once I realized Chrome opens and plays my movies. I was having an impossible time syncing my xbox with the windows pc (the irony). Chromecast fixes that because I just play movies in Chrome now and cast to the TV. Love the screen saver pictures the display on the TV when not in use. Just beautiful on our 60\".", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I wish this had an actual remote, but otherwise works great.", "verified": true, "helpfulness": "0/0", "author": "Colleen Walker"}, {"rating": 5.0, "review": "Great item, easy to install. Plan on buying a second one for my entertainment room.", "verified": false, "helpfulness": "0/0", "author": "Willie Mae Davis"}, {"rating": 1.0, "review": "You know they say, \"You get what you pay for!\" If you buy a $35 dollar piece of crap, you get a $35 dollar piece of crap. Spend extra money and get Roku or Amazon Fie TV!Device gets really hot and will stop and start. Constantly having to restart movies. Plex and Netflex will stop and start. Very aggravating when you are watching a movie.", "verified": true, "helpfulness": "0/0", "author": "LeJeune \"Kathy\""}]