[{"rating": 5.0, "review": "Use this almost every day now", "verified": true, "helpfulness": "0/0", "author": "Right Said Fred"}, {"rating": 5.0, "review": "FIXED YAY... customer service sent an e-mail giving more precise steps to resolve issue: Go to settings select manage apps..select Amazon video...select force stop.....select clear data....select clear data when asked....unplug fire tv....plug in and FIXED......The on screen prompt just says clear data.....hope this helps...Thanks customer service....Now 5 stars..Stopped working....will not stream anything....just keeps displaying unable to stream try again later ...contacted customer service but have heard ncothing.....", "verified": true, "helpfulness": "2/5", "author": "MELANIE D. MERCER"}, {"rating": 5.0, "review": "Great box. Works great as design, a streaming box with the installed apps.Other uses are limited:- USB won't connect to external hard drives to play movies- NAS movie playback is not great- XBMC runs great after unlocking it  - Some artifacts after 6 hours of useOverall, a great buy for anyone uses it as intended. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Cez Mancio \"Cez\""}, {"rating": 5.0, "review": "Can't say more than, I Love It! And very easy to install and use the system, and the voice search is a great addition for this type of service.", "verified": true, "helpfulness": "0/0", "author": "M. Brandon"}, {"rating": 3.0, "review": "This is equal parts wonderful and maddening.  When it plays, it's wonderful.  When it stops mid-episode and takes 1-15 minutes to re-load, you pretty much want to punt it through the nearest window.  Sometimes you can get through a full hour-long tv episode with not stopping, other times it will stop multiple times.  I keep it in the same room as the router, with only my husband & myself sitting in the love seat blocking it's path.", "verified": true, "helpfulness": "1/1", "author": "CB"}, {"rating": 5.0, "review": "Love it! Easy to use.", "verified": true, "helpfulness": "0/0", "author": "TheGiftmaxStore"}, {"rating": 4.0, "review": "it was easy to setup.  I only use it for Netflix and it works fine for that.", "verified": true, "helpfulness": "0/0", "author": "Michael V. Webb"}, {"rating": 5.0, "review": "excellent product easy to use", "verified": true, "helpfulness": "0/0", "author": "Guindalina Price"}, {"rating": 5.0, "review": "We're Prime customs so there is a vast array of movies and TV shows. The voice prompts is very good. The playback is in HD and since is used our Wi-Fi, we thought we'd get some interruptions, but they playback is never interrupted.", "verified": true, "helpfulness": "2/2", "author": "wkt"}, {"rating": 5.0, "review": "We love our amazon fire TV.  We have spotty interconnection between our TV and wireless router.Rarely do we have to sit through the dreaded \"Reloading......\" screen.", "verified": true, "helpfulness": "1/1", "author": "Karen Halliday"}]