[{"rating": 4.0, "review": "I love the concept of my Chromecast, and I cringe a little that I have to be honest and only give it 4 stars.. I would give it 4.5... but that's not an option, literally.  I love being able to stream Chrome from my devices (in Beta).... the only issue I have is the lag.  The setup was pretty easy, and this device is truly flexible.  The only regret I have is that I didn't buy it sooner.  I chose Chromecast vs. other devices for it's direct browser projection capability.  I <3 Chromecast :) Sorry for the missing star... maybe connection issues will be improved in the very near future.", "verified": true, "helpfulness": "0/0", "author": "Noneyabusiness"}, {"rating": 5.0, "review": "Love this product!", "verified": true, "helpfulness": "0/0", "author": "Midge Hunt"}, {"rating": 5.0, "review": "Works perfect with Youtube and Netflix! The best electronic purchase I've made.", "verified": true, "helpfulness": "0/0", "author": "Roxana Rahmanian"}, {"rating": 5.0, "review": "Great for making any tv smart o just wish they had more games", "verified": true, "helpfulness": "0/0", "author": "V. Brooks \"brooksaceb\""}, {"rating": 5.0, "review": "great!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Julio  Galindo"}, {"rating": 2.0, "review": "Temperamental.", "verified": true, "helpfulness": "0/0", "author": "SC"}, {"rating": 5.0, "review": "I like it so much I bought another one as a gift.  actually the first one was a gift but I kept it for myself.  This gizmo allows any TV to stream netflix and HBO go, so long as the tv has HDMI input.  not a big deal connecting the chromecast to a power source.  they should include the power cable in the picture to avoid confusion, they make it look like the tv powers chrome cast but it doesn't.synchronizing with my smart phone was effortless.", "verified": true, "helpfulness": "0/0", "author": "piles.n.smiles"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Angela Miller"}, {"rating": 5.0, "review": "this purchase got rid of the HDMI cable across the room,,, use Chromecast all the time", "verified": true, "helpfulness": "0/0", "author": "David Reves"}, {"rating": 5.0, "review": "I love this product. My \"smart\" TV is a few years old and not that \"smart\". This little device enables me to watch HULU, HBO, lots of other apps, and I can watch any video that I can load onto my laptop. I give this 5 Stars!", "verified": true, "helpfulness": "0/0", "author": "David Weiner"}]