[{"rating": 5.0, "review": "very cool,.i just wish they have more updates on apps", "verified": true, "helpfulness": "0/0", "author": "Sherry T."}, {"rating": 4.0, "review": "Works great with applications designed specifically for this device. Only I would like to be able to display more content stored on the device itself and not through an application. To view streaming content is very good.", "verified": true, "helpfulness": "0/0", "author": "Fernando"}, {"rating": 2.0, "review": "Causes interference with the TV at times when we watch programming through the set-top box (it messes the image fully).Bought it to stream BBC iPlayer and it only streams live content!We have a smart tv that is already capable to connect to most of the other sites. So it's pretty useless to me.", "verified": true, "helpfulness": "0/0", "author": "CrisM"}, {"rating": 5.0, "review": "I have this dongle for months , It's works but not working correctly for my Ipad.", "verified": true, "helpfulness": "0/0", "author": "Harry DBH"}, {"rating": 2.0, "review": "Pain in the butt to set up. Now my expression \"is that it?!\" I'm not please with it at all.I really should give it one star but I like YouTube and I sometimes use the device for it.", "verified": false, "helpfulness": "0/1", "author": "K. M."}, {"rating": 5.0, "review": "this thing is great, easy to move around, fast, no issues with connectivity.  Super easy to use.", "verified": true, "helpfulness": "0/0", "author": "Cody"}, {"rating": 4.0, "review": "It's a great prodcut. Is very simple to stream something.", "verified": true, "helpfulness": "0/0", "author": "Juan Carlos Vazquez"}, {"rating": 4.0, "review": "This is a good idea, but i'm really looking forward to amazon's.  You NEED a remote and a gui, the whole headless device just did not fit our family.  The casting device (my fire tablet) kept going to sleep and then we have to wait for it to wake up, get back on the network, just so we can pause.  Sounds trivial but you get a room full of people and it starts to get old quick.  I'm sure we are an edge case here so I'll give it 4 stars, its a fine product doing exactly what it advertised to do, just needs a hardware remote IMHO.", "verified": true, "helpfulness": "1/1", "author": "Ryan D. Couch"}, {"rating": 5.0, "review": "Freaking love this little thing.", "verified": true, "helpfulness": "0/0", "author": "SS"}, {"rating": 5.0, "review": "Great Product. Works Perfectly.", "verified": true, "helpfulness": "0/0", "author": "Idan"}]