[{"rating": 3.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 4.0, "review": "Works just like it says", "verified": true, "helpfulness": "0/0", "author": "Robert Hughes \"Bob Hughes\""}, {"rating": 4.0, "review": "It works well", "verified": true, "helpfulness": "0/0", "author": "Wtrman \"ocman\""}, {"rating": 5.0, "review": "goooood ....", "verified": true, "helpfulness": "0/0", "author": "333hmd"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Mario Becerra"}, {"rating": 1.0, "review": "Used to be a happy owner of a Chromecast , but for a month it has been unusable. The problem seems to be derived from firmware update 22062 and produces constant \"Brain freeze\" crashes. Unfortunately I'm not alone and google seems to be aware of the problem . https://productforums.google.com/forum/m/#!category-topic/chromecast/8JEKfuu71ck", "verified": true, "helpfulness": "1/2", "author": "Arturo Valencia Milian"}, {"rating": 4.0, "review": "great product with limitations.  when you watch the commercial you think awesome a gadget that can take what i have on my other devices and display them on the TV, cool.  what they dont say is it only does this with associated apps in there list.  so if what your want to project is not in there list then you cannot use this to do it. half of why i bought this for is not supported.  i will say the other half is great looking and functions great.  before you buy look up the apps supported on your device so you know what you can and cannot do with the Chromecast, if it has what you want then it will be good  i like mine despite its limitations", "verified": true, "helpfulness": "0/0", "author": "Justsumguy47"}, {"rating": 1.0, "review": "Don't bother, the thing doesn't work! Very disappointed  :(", "verified": true, "helpfulness": "0/0", "author": "mel.jackson.07"}, {"rating": 1.0, "review": "Worked great for 3 months, rolled out new version and nothing works and no way to fix it. Gave up and bought a Roku, SO MUCH BETTER!!!", "verified": false, "helpfulness": "1/1", "author": "Josey"}, {"rating": 5.0, "review": "Easy to connect.  Works well.  I can control everything with my phone or tablet.  For the money, you can't beat it.", "verified": true, "helpfulness": "0/0", "author": "GBall"}]