[{"rating": 4.0, "review": "I find it works better/more responsive than the built in miracast feature on some tvs.  Will be even better when it supports more apps.  For the price you can't really complain plus it's portable, should be able to use in hotel rooms.", "verified": true, "helpfulness": "0/0", "author": "Avid Fan"}, {"rating": 4.0, "review": "It does exactly as advertised at a fraction of the cost.  Since I'm an avid Netflix subscriber, this works great.  However, Google has still not released many apps in support of the player.  I'm sure it's coming, it just hasn't yet.", "verified": true, "helpfulness": "0/0", "author": "Dave Jenkins"}, {"rating": 3.0, "review": "the quality of the picture when using this device is not good.  It is bad enough that I resorted back to hard wiring my TV to the computer with the HDMI cable.  Also I have to keep my computer on while casting to TV and the delay time is so obvious that it is completely distracting. Also doesn't work with my IPAD (I have the old version of IPAD).  Unfortunately it was a waste of money for me, but a slick idea.  maybe once they perfect it?", "verified": true, "helpfulness": "0/0", "author": "lzj"}, {"rating": 3.0, "review": "There was a lot of hype for the Chrome and for $35 we decided to try it.  Its cheaper than a roku or other device, but really has limited use at this point.  So far there are just a few services that you can use to project onto your TV:  (1)  Netflix streaming, which has very limited programs (2) Pandora, which can be steamed to a tablet or other device (as you don't watch it); (3) hulu (we don't have this) and (4)  google play (where you need to buy the movies). You can also show your chrome browser on your TV, BUT, this can only be done from a laptop, not a tablet.  I tried to watch movies in Amazon Prime through the chrome browser using Chromcast, but it always kicks out errors.  If there was an Amazon Prime app for Chromecast, It would be amazing-- but without that it really just provides another way to view the internet or a means to watch very limited program or use apps that aren't great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"PHK\""}, {"rating": 4.0, "review": "Does very little, but does it very well!If you want netflix on a TV without using other devices this is it! Will also mirror a web browser for presentations.", "verified": true, "helpfulness": "0/0", "author": "Gene N \"Photographer\""}, {"rating": 2.0, "review": "It did not work on my system, maybe my wi-fi is not great for this chromecast to work at my house", "verified": true, "helpfulness": "0/0", "author": "Yanira Reyes-Lopez"}, {"rating": 5.0, "review": "Pretty cool to use when friends are over or when watching a series online. It does not work with any movie sites that use microsoft  silverlight.I love being able to stream music and video from the phone but i mainly use it for the browser support. Cheapest wireless receiver possible.Pro's:Easy SetupBeautiful pictureSimple to useCons:I was under the impression it was powered through tv silly me. It needs power connection that connects to it while plugged into hdmi. Nothing to bad I just had to make room on power strip.There is a little light on the back of it that glows. At night i notice it with the tv in my bedroom. I covered it with a small piece of black tape.", "verified": true, "helpfulness": "0/0", "author": "Marcus R Dortch"}, {"rating": 5.0, "review": "Chromecast was VERY easy to set up. Allows me to \"cast\" tv shows, movies, even web pages and Youtube to my TV. Great for group settings or if you do not have cable service.", "verified": true, "helpfulness": "0/0", "author": "Jessica Spencer"}, {"rating": 5.0, "review": "Easy to install  and works perfectly. A definite step towards helping unplug from cable. Looking forward to more available apps.", "verified": true, "helpfulness": "0/0", "author": "Frank G"}, {"rating": 2.0, "review": "My new samsung S4 did not work completely. I thought of returning it, but my son said he will try to see if he could make it work the way it said. But....oh well...glad the price is not sky high. I actually tried to call Google, but got a recording. Thought they had a good customer service center, but guess not huh.", "verified": true, "helpfulness": "0/0", "author": "Tyler Chan"}]