[{"rating": 3.0, "review": "basically this is a green banana when it comes to network streaming. Doesn't support your own media files, which is a big drawback. No very many apps, give it some time and maybe it will turn yellow.", "verified": true, "helpfulness": "0/1", "author": "cybermil"}, {"rating": 2.0, "review": "Really great idea but needs more ap support from Google!  Basically just netflix and youtube at this point.  Would like to see cable company apps from DirectTV or Comcast etc...", "verified": true, "helpfulness": "0/1", "author": "TPW"}, {"rating": 4.0, "review": "Great way to watch Youtube videos on my TV.  I wish I could cast Amazon Instant videos too though.  Ta da.", "verified": true, "helpfulness": "0/0", "author": "Mr Frugality \"Mr. Frugality\""}, {"rating": 1.0, "review": "Is not easily compatible with Apple extreme router.  There is a work around, but much too complicated to make it worth it.", "verified": true, "helpfulness": "1/2", "author": "Eugene H. MIller"}, {"rating": 4.0, "review": "The chrome tab projection doesn't work as well as I'd hoped (it sends sound perfectly fine, but has trouble sending images... when watching video, it only sends one frame every few minutes), but it plays netflix much faster when compared to our blu-ray with wifi - plus, it takes up a lot less room.", "verified": true, "helpfulness": "0/0", "author": "James Martz \"Uncreativescreenname\""}, {"rating": 1.0, "review": "The same youtube videos sometimes give the sharing icon sometimes they don't (running them from chrome youtube app).Troubleshooting ?No, the device is going back...", "verified": false, "helpfulness": "1/3", "author": "uzevla"}, {"rating": 1.0, "review": "It worked for about an hour and then quit.  No matter what we tried it would no longer boot up.  Unfortunately, I waited a couple of months to install it and by the time i did and found it had a problem, it was too late to return it.", "verified": true, "helpfulness": "0/4", "author": "DianeS"}, {"rating": 5.0, "review": "Have not used ours yet but have seen friends use theirs and the like it. Good deal too when I got it.", "verified": true, "helpfulness": "0/0", "author": "C*"}, {"rating": 5.0, "review": "This has been wonderful.  Granted, you have to play around with it to understand it, but once you do, it's great.  If you watch online content, this is for you.  Primarily used with Netflix and YouTube, you can see regular websites as well with its casting feature.  However, the speed of the video might take a hit.  If casting from a desktop, you should get better results.", "verified": true, "helpfulness": "2/3", "author": "Alexis Salas"}, {"rating": 3.0, "review": "Pros: can stream very easily and setup was a breezeCon's: only available to stream like 4 applications. Can't even stream movie files.", "verified": true, "helpfulness": "2/3", "author": "Tengtou Xiong"}]