[{"rating": 1.0, "review": "I made the mistake of thinking this was going to stream everything from my iPad to my TV.  I was hoping, for example, that I would be able to stream HBOGo.  So far it has not been useful at all.", "verified": true, "helpfulness": "2/7", "author": "Patrick Ontiveros"}, {"rating": 5.0, "review": "This one of the best products in a looooonnnnnggggg time that actually lived up to the hype.  Quick and easy to install!  Absolutely the product I've been searching for the past 2 years to get off the cable rip off wagon!!  Thanks Google!!!", "verified": true, "helpfulness": "0/0", "author": "Cynthia R."}, {"rating": 3.0, "review": "5 STARS for the potential and price point of this device. 1 STAR for its buggy performance and non-intuitive feel.I thought I had a multimedia powerhouse on my hands pairing this with the HP Chromebook 14. Chromecast tab casting is not worth your time and aggrivation, however a software update is supposedly in the works to alleviate this.My honest opinion? Spend an extra few bucks and spring for a FAR SUPERIOR Roku unit of your choosing.", "verified": true, "helpfulness": "0/0", "author": "Joshua Grden"}, {"rating": 1.0, "review": "I'm not sure what all the hype is about this item. I see it's potential, but I didn't buy a product for it's potential, I bought it so that it would work. This product is slow and has a severe delay when mirroring your desktop. The youtube function is great, but I have xbox 360 for that and also my samsung products already link to my Samsung TV, and much much faster over my wifi network. Also, if I want to see my movies in HD I'll attach a HDMI cable to my computer, which gives me great clarity. Chromecast quality was terrible and not \"HD\" at all. 720HD is low to begin with and the higher the resolution, the slower the video, which by the way was choppy and stuttered.I'm returning mine to best buy today.I think if you want a full multimedia experience and connectivity to your peripherals I would suggest looking into items that were a little more expensive but give you better flexibility, speed, performance and storage.", "verified": false, "helpfulness": "1/2", "author": "Stephen D. Ruggieri"}, {"rating": 2.0, "review": "My experience was that video appeared like a slide show.... perhaps 1 frame a second.  It is a great product for non-video use such as sharing photos or listening to music.  It appears th PC, phone, or tablet has to process the video as it plays on that device, and then send it to chrome cast... not a good solution for small processors.I was using the chrome browser in this review.  Not Netflix or YouTube app.", "verified": true, "helpfulness": "1/1", "author": "jon"}, {"rating": 5.0, "review": "Although there are limited apps for the device, I've been very impressed by the easy set up and easy use of the device.  A great device idea to use with your laptop, tables, and phones.", "verified": true, "helpfulness": "0/0", "author": "Night Hunter \"Night Hunter\""}, {"rating": 5.0, "review": "I love this so much, it helps out with the baby when she wants to watch something and google movies I can take every where and even better with this chromecast", "verified": true, "helpfulness": "0/0", "author": "Antonio Diaz"}, {"rating": 5.0, "review": "I have one on every one of my TVs and one for travel and have had one since they were first offered and they are awesome!They do operate best with native apps like Google Music and Movies and Netflix, but you can cast webpages as well. I like the fact that my phone becomes a remote, controlling the content and the volume. Last night I couldn't sleep so just cast one of my favorite Netflix shows to the bedroom TV and I was set!A good wireless connection is required; I had to put a repeater in for my TV farthest from my Netgear AC1750 but once your phone and Chrome cast are on your network, set up is easy. If you have multiples like me, give them good descriptive names so you don't end up casting to the wrong one! I'd recommend setting it up from the desktop  app (if you have a desktop)...it seems to be easier that way, to me at least.They do blink when they are receiving updates; if you wake up in the middle of the night and the back of your TV is blinking, that's what it is. I'd like the option of turning that off.I'm looking forward to more apps!", "verified": true, "helpfulness": "0/1", "author": "Mrs Raven"}, {"rating": 2.0, "review": "Very disappointed.I bought the device with big hopes of streaming content from my Android table to the Chromecast. Temporarily, this was even working, with an app called AirCast, but Google has clamped down on such apps and has not released the API for public use yet. This after the device has been released for so many months.But even the features that the device have seem to be deteriorating. I use it a lot for Youtube for my daughter, playing nursery rhymes and other kids shows for her. When I initially got the device, it worked perfectly. But lately, it has started stuttering on some videos, and other videos it will even completely hang. I think a software update by Google must have broken it, since it used to work find, and it only happens for certain videos. The one nice things I still use it for is streaming flash video from my laptop to the TV, but the quality is only so-so.Finally, additional apps for the device have been slow to come. Only Hulu and Pandora were added to the selection of apps since the launch. Still waiting on HBO2GO and a decent app to stream media from my local network.Overall, I thin you are better off with a Roku box, if you can live with the lack of Youtube on the Roku.", "verified": false, "helpfulness": "3/4", "author": "S. Konrad"}, {"rating": 5.0, "review": "Use it all the time. Cheap and works great! Amazing clarity and volume when watching youtube or Netflix. Highly recommended", "verified": true, "helpfulness": "0/1", "author": "K. Rao"}]