[{"rating": 5.0, "review": "We are not a tech savvy family and I ordered two of these.  I ordered one for our main TV and one for my son for graduation.  They were simple to set up, and SO easy to operate.  We are PRIME members and I loved the fact that everything was already loaded from our library.  My 81 year old  father was over to my home and is legally blind.  I showed him the remote and the voice activated button and had him practice using it.  Although the button is small is it all by itself at the top of the remote.  After a few attempts he was able to do it.  He and my mother were thrilled because he pulled up old Andy Griffith episodes and said although he couldn't see much of the TV, he could remember the episodes.  My dad is getting one from me for Father's Day.  Great job Amazon!", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This device gives us easy access to lots of new movies.  The speaking part of the remote is great.  My grandchildren love it as it has expanded the movie choices they have while spending the night.  I recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Robin Rodger"}, {"rating": 5.0, "review": "It turns off by it's self, great little thing, the picture quality is great, very fast down load to.i wish they had more newer movies.", "verified": true, "helpfulness": "0/0", "author": "nothing"}, {"rating": 3.0, "review": "It buffers very frequently great features good resolution but if your Internet is not at least 8th be then round is the better choice", "verified": true, "helpfulness": "0/3", "author": "brian emmanuel"}, {"rating": 4.0, "review": "nice unit, easy to use, but for the subscription rate, you should not have to pay extra for anything but new release movies", "verified": true, "helpfulness": "0/2", "author": "Travel-Guru"}, {"rating": 3.0, "review": "The voice search feature is excellent, really works well, however, it only works on the Amazon Prime content. It's not yet supported by other apps such as Netflix. The other gripe is that it doesn't currently play music from Amazon's Cloud Player, which puts it well behind Apple which integrates the music player very well. As to content, Prime is very limited, most of the stuff is very old or not free. Which means you'll want to be using Netflix, but as stated above, it's not as smooth to use with voice search, and there's no remote phone app to help as with Apple TV. It's a good start, a little like the Kindle Fire in its initial version, with some nice features, but it needs several more iterations before it will really be worth it.", "verified": true, "helpfulness": "0/0", "author": "A. J. Lee \"andi_j_lee\""}, {"rating": 5.0, "review": "My family has gotten me to finally watch movies by installing this great Fire on the TV.  It is so simple and it works!!!!  Would hate to live without it!  Thank you amazon!", "verified": true, "helpfulness": "1/1", "author": "Pink Grandma"}, {"rating": 3.0, "review": "I bought this device over the weekend and I'm probably going to return it...I have an old laptop that I have connected to my TV, so I watch Amazon Prime, HBO, AMC, NBC etc already on my TV. The reason for this purchase was to make watching these shows easier....not quite what happened.1. TMI...I don't really care what's on pay for service movies like netfix, hulu + etc. I should be able to filter them out of my searches.2. They do have have may TV programs (like AMC, ABC, NBC etc) but these are FREE on the the web, but you have to pay on Amazon Fire TV.  So if you missed an episode of madmen.. you can watch it for free on your PC, but you have top pay on Amazon Fire TV.Oh well...I guess I expected more from Amazon.", "verified": true, "helpfulness": "0/1", "author": "IFixPCs"}, {"rating": 5.0, "review": "I must say I was not sure about the Fire TV when I first purchased it.  I do have a Roku and loved it.  After a week or so of using my doubts were put away.  This is a solid device.  It is responsive and has worked without any issue so far.The only con is the apps available.  The lack of Vudu is really not good.  Also the Plex App cost on here when it is free on the Roku.", "verified": true, "helpfulness": "1/1", "author": "ken"}, {"rating": 5.0, "review": "This box was very easy to setup and use.  The programming is great for kids and for parents.  We use Hulu plus and Amazon Prime on it and are able to move through the menus easily.", "verified": true, "helpfulness": "0/0", "author": "B. Bock \"Respect the electronics\""}]