[{"rating": 5.0, "review": "This gadget rocks, its easy to setup and use, it just works flawlesly. You can use it with your PC, MAC, iphone, Android phone etc. Netflix and youtube work as espected no lag or anything. Im on 6mb internet and I dont have to wait for videos to buffer, so if you have a better connection than that then dont worry for lags.NOTE: The first time you set it up it could take a while for it to start due to a firmware update, but after that first update it takes just seconds to boot and be readyGreat product, highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Allan Orozco"}, {"rating": 5.0, "review": "I was worried it would be difficult to set it up with my router because I filter IP addresses, but it was easy to set up.  While I wouldn't see the point in getting a chromecast if you only possess smart tvs (as my primary tv is a smart tv), it comes in handy for a tv with hdmi ports that does not have internet access.  Very easy to use and nice to be able to go to sleep to pandora.", "verified": true, "helpfulness": "0/0", "author": "Lesley A. Hoenig \"LAH\""}, {"rating": 1.0, "review": "Even for the price not a very cost effective product.  Functions okay and if you watch a lot of Youtube ... I mean only youtube it might be good for you.  But for the same price you can pick up a BlueRay DVD player with built in WiFI.  Which has all the functionality you will ever need with and Much Much More. Browse the internet game netflix etc....Dont waist your time and money on this productExample that would be a much better buy.  At this price range you can be a full BlueRay WIFI in many brands.  i.e. http://www.amazon.com/gp/offer-listing/B00BD7UVO4/ref=sr_1_3_olp?s=electronics&ie;=UTF8&qid;=1393223313&sr;=1-3&keywords;=dvd+player+blu+ray+with+wifi  $41 buck free shipping.", "verified": true, "helpfulness": "2/3", "author": "Maykou Noh"}, {"rating": 3.0, "review": "Great cheap device to stream material to the TV. For iPhone users, Apple TV may have more utility. There is much potential to this item; however, until developers incorporate chromecast into their apps, I will still to Apple TV.", "verified": true, "helpfulness": "0/0", "author": "J. Chang"}, {"rating": 4.0, "review": "at first we had issues and want to say up front - if you have issues, be sure to question your router!  we replaced our old router and it eliminated the flakiness of the Chromecast icon on our mobile devices!the YouTube video queue makes a video party awesome.  casting a desktop Chrome tab definitely adds possibilities (but still requires a separate machine).so this review won't be 5 stars until it demonstrates more use than an Apple TV- at the very least, add a screensaver that runs of our family's G+ photos (yes, multiple accounts if anyone on the Chromecast team is listening!)as I'm not returning the unit (it's really convenient to carry in your backpack it's so small!) - look forward to more Chromecast enabled apps!", "verified": true, "helpfulness": "0/0", "author": "Chinarut"}, {"rating": 5.0, "review": "I purchased this to be able to watch YouTube on my non-smart tv and it works great! I love the ability to be able to setup playlists of videos on my iPhone and they just play wirelessly to this Chromecast. It's definitely not as feature packed as an AppleTV, but for the price, its a great item. Thumbs up!", "verified": true, "helpfulness": "0/0", "author": "CMG"}, {"rating": 5.0, "review": "Bought this for the Plex App. Everything streams perfectly and I can use it as my remote.The Cast Tab for Google Chrome lags a little, from what you see on the Laptop or Desktop.However, the sound matches with the video on the TV.In my opinion this is one of the best devices I have in my home.For around $35 you push almost all media to your TV.Lastly, download AllCast in Google Play, if it still available!", "verified": true, "helpfulness": "0/0", "author": "Andrew Thomas"}, {"rating": 5.0, "review": "I wish there were more than browser apps, but we have four in the house, and when we need to push up a browser to show a clip, or watch a video (game, Hulu, etc), it's a perfect fit.", "verified": true, "helpfulness": "0/0", "author": "JMH"}, {"rating": 4.0, "review": "I got this to \"cast\" netflix from a tablet or a pc to my tv.It was supposed to come with a couple of free months of Netflix - and DIDN'T. I'm a little annoyed about that. The promotion ended just as I placed my order, I guess.It works flawlessly with casting nexflix and youtube from my older ipad and android phone to my tv. It makes my XP box and my chrome box work a little harder. Runs beautifully in the background on my iPad.I was really hoping it would work with more things- but I guess they are still developing applications for more features. I'm looking forward to that.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 1.0, "review": "I paid for it but never received it.  I now understand that if you buy something that is shown on amazon you are not always buying it from amazon. Sometimes It comes from a third party. AMAZON DOES NOT STAND BEHIND IT they just take a % of it. IF the turd party goes belly up and does not send you the product AMAZON STILL TAKES YOUR MONEY. So for your movies and all your entertainment needs go to NETFLIX. That's what I did. At least you get what you pay for. I'm only $30 dollars but that will  be the last of what they get from me.", "verified": true, "helpfulness": "0/0", "author": "Arch E Vanbelle"}]