[{"rating": 5.0, "review": "Wow- I love IT!  Great way to watch movies.", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 4.0, "review": "I got this as a gift for my husband for Christmas. Shipping was fast, and I wrapped it in the Amazon box to put under the tree. It took about 10 minutes to do all the updates and stuff it needed to do, we entered the email info for the Amazon Prime account (I also bought him a one year Prime membership, since I didn't want to give a gift he'd have to pay to use), and the little box picked it right up! The box is very small and portable, so we can move it from room to room if we choose, but at the price we may just buy more! There is a huge selection of tv shows and movies that are free for Prime members, and the quality is great! He was obsessed with the voice feature on the remote, and was searching for everything he could think of to confuse it, but it didn't happen. He was very happy with his FireTV box, therefor, so am I. We look forward to binge-watching some shows we've missed. Waiting for the stick to be released next year! He rated it at four stars because you have to pay for stuff that isn't on Prime. Other than that, it's a great purchase! Very pleased!", "verified": false, "helpfulness": "1/1", "author": "Shortcake"}, {"rating": 4.0, "review": "Easy to set up, easy to use. I have a smart TV and didn't use all of the features because it was a real pain to get through all the steps. Amazon Fire TV is simple and quick. The voice control makes it so much easier. We're still going through a discovery process with all of the features and options but so far we enjoy!", "verified": true, "helpfulness": "0/0", "author": "Terry Cornwell"}, {"rating": 5.0, "review": "we love it and use regularly on our 'non-smart' TV.", "verified": true, "helpfulness": "0/0", "author": "R. Black"}, {"rating": 2.0, "review": "Chromecast is better. I have both.", "verified": false, "helpfulness": "0/4", "author": "Long Pham"}, {"rating": 4.0, "review": "Hard to learn to navigate. Voice request doesnot always yield a proper response.Picture quality, sound are excellent. Selection is good.  It's still a keeper.", "verified": false, "helpfulness": "0/0", "author": "Janice Martin"}, {"rating": 5.0, "review": "Had finally do a factory reset on 12-26-14 for the first time. This thing works great.", "verified": true, "helpfulness": "0/1", "author": "Darren R. Pierce"}, {"rating": 4.0, "review": "I received my Amazon Fire TV for Christmas from my son.  Absolutely love it. The only reason I did not give it a Five Star rating is that the unit doesn't come with the required-to-use HDMI cable.  Fortunately, my son had an extra one he wasn't using.", "verified": true, "helpfulness": "0/3", "author": "Larry E. Tomlinson, Sr."}, {"rating": 2.0, "review": "I don't have internet or cable would this work on my smart tv", "verified": false, "helpfulness": "1/11", "author": "Lisa Surles"}, {"rating": 4.0, "review": "I was so excited to get this! I had been waiting for it for awhile. When I got it for Christmas, my son set it up. You WILL NEED and HDMI cable for this to work. It does not come with one. When we first set it up, it had not synced with my Prime account and was telling me the only way to watch my fav shows was to pay for them. I had planned to return it. However, the next time I turned it on, it gave me the option to watch the show \"included with Prime\".  We are now enjoying the TV episodes of our favorite shows that we had missed. This is very cool and the sound and picture are excellent! We can also watch Netflix and are planning on getting Hulu Plus so that we can watch everything we could possibly think of. We got this on sale for $75 before Christmas, so you may want to wait till it is on sale. Amazon often goes down to $84 and then back up to $99.99. It is so worth the cost. Buy it and enjoy!", "verified": true, "helpfulness": "1/1", "author": "imjoshsmom \"Laura M.\""}]