[{"rating": 5.0, "review": "As part of my job as a technology evaluator and purchaser for my school, I am often asked to choose between Apple products and PC/Microsoft/Google products. Personally, I have owned or currently own all. My school is even a mixed environment. I mention my background with technology only to show that I have experience with different types of technology and don't normally endorse one operating system/company over another. It is all a personal preference. However, when presented with the option to buy a Chromecast for my personal use at home, I was hesitant since I hadn't tested it or read much literature. I took a leap of faith. After all, the price was fantastic. I have to admit, that I am more than pleased with my purchase. It was very easy to install. Make sure that your TV has an HDMI connection. It connects from my Android phone, iPhone, MacBook and Chromebook. It does work better with my Chromebook and Moto X phone which are Google products. One common misconception about this product is that some believe that this turns your TV into an auxiliary computer screen. It 'casts' the current screen onto your TV but does not turn your TV into a LCD computer monitor per se. There is lag time if casting your computer screen. If you move from tab to tab, you have to close one tab and cast the next  one. For this product to work at its best, you must have a good wireless router and high speed internet connection. I use my Chromecast to stream YouTube videos, Netflix and Google movies.", "verified": true, "helpfulness": "0/0", "author": "GusMom"}, {"rating": 4.0, "review": "The product is great to play through Google Chrome , Netflix, HULU.....Waiting for few more addons that needs to be put on this ...... Google bring addons on this ......", "verified": true, "helpfulness": "0/0", "author": "Gowtham"}, {"rating": 4.0, "review": "It works well- hoping they will figure out how to add the ability to \"cast\" everything from laptop to television.", "verified": true, "helpfulness": "0/0", "author": "A Robinson"}, {"rating": 5.0, "review": "Will be purchasing 3 more and with added external HD antenna, I'll be reducing set top box charges from monthly cable bill in preparation of cutting the cord completely. Need to get the wife on board but the kids are all for it. These will pay for themselves in 3 months with what I save on the boxes alone. The going to basic HD for wife to wean her down to ultimate goal: broadcast HD and internet only (choir sings here).Now for the product; installation was as easy as could be and no issues with streaming quality. Picture in HD as if I was watching FIOS. Not a fan of the power cord but I'll hide that soon enough. For my home office, I use regular HULU to start but will get HULU-Plus so my kids can use their gadgets to stream. YouTube works perfect, which they love and I plug my Kindle HK directly into one of the other HDMI slots to use my Prime account since this is NOT compatible with Amazon. There is a side-loading workaround which I used to install Chrome but it's much easier just to plug it in as I keep the Kindle HDMI cord plugged into one of the other open slots.Life is good.", "verified": true, "helpfulness": "0/0", "author": "Amazon Lover \"John\""}, {"rating": 5.0, "review": "recommend it...heck it got hijacked when my friends came over one evening it was hilarious..they brought there smart phonesIpods and other devices with them as they always do,  when I  started to show off what the Chromecast could do they pouncedon it one at a time with their devices...if I knew this would be a hit I could of used the chromecast as a stocking stuffers...evenGram loves it. its  a snap to use just plug and play....a great device grab one while u still can seriously", "verified": true, "helpfulness": "0/0", "author": "gramp"}, {"rating": 4.0, "review": "Took a while to get it going first timeFirst switch on it took a long while to come up with message.Then it locked on to neighbours WIFI.The delay for WPS (push button password) is too short and I had to race to router to get there in time.When I sorted WiFi. It worked as advertised. Very eay to use.", "verified": true, "helpfulness": "0/0", "author": "ahw"}, {"rating": 5.0, "review": "I bought 6 of these!  One for myself, and 5 for Christmas gifts.  Everyone, I mean everyone I gave these to are so excited to get them.  I was a hit this year because of these little devices.  Easy to install and works with most televisions (make sure your television has a working hdmi port) and an excellent product.", "verified": true, "helpfulness": "0/0", "author": "Evamarie A. Ferrebee"}, {"rating": 5.0, "review": "I wish i got this sooner. works great! Will get another for the basement tv. so easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "Minkypoo"}, {"rating": 5.0, "review": "It was the hit of the Christmas presents for both of my sons. One is finishing upcollege and the other one will be going.They loved it, it was easy to set up to their computers. For the one son who doesn'tget cable he couldn't be more appreciative.", "verified": true, "helpfulness": "0/0", "author": "KM53"}, {"rating": 5.0, "review": "We really like this, works great. Can't wait for more apps for windows 8. Hulu plus works with our tablet but not Windows 8.", "verified": true, "helpfulness": "0/0", "author": "Gary Hill"}]