[{"rating": 2.0, "review": "Processing speed is good, but video streaming through Plex is awful.  That very well may be due to the Plex app and not the Fire TV.  I've gone back to using my Roku 3 exclusively because of that, though.", "verified": true, "helpfulness": "3/3", "author": "kidcosmo"}, {"rating": 5.0, "review": "great", "verified": false, "helpfulness": "0/1", "author": "Renee Kaefer"}, {"rating": 5.0, "review": "Amazon Fire is really an excellent purchase.  It was easy to install, so my son said. I can now watch all of the the Amazon shows and movies.  This is the best purchase ever.  I'm like, why do I have an apple TV box?  Because my son bought it for me, but now that I have an Amazon Fire, I want this on every TV.  Very easy to operate, I do use it, and it's so small and thin, it takes no room at all.This is excellent technology!", "verified": true, "helpfulness": "1/1", "author": "Lola! Love \"The Real Deal\""}, {"rating": 5.0, "review": "Nice product. MOVIE QUALITY is good with no buffering. Meets my expectations.", "verified": true, "helpfulness": "1/1", "author": "margaretmorin"}, {"rating": 4.0, "review": "I hate that you can't separate pay titles from a search...Very user friendly and voice search is awesome...", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I watch Netflix and Amazon Prime. I cut cable a year ago. This is the perfect level for me. I skip the pay apps \"free\" trial stuff and games. I love the aPrime selection. It's vast. Coupled with Netflix? Match made in heaven. I really like the build quality, the voice command, and the cat5 / Ethernet option to connect to the router. In my apartment, skip giving wifi hackers a chance. Except for chump apps like ESPN or NFL or Hulu which all buffer like 1995 AOL in the Caribbean? Netflix and Amazon shows / movies are SEAMLESS and awesome with flow and HD when available. I love it and Amazon Customer Service for helping me through a Snafu that landed me in the position to consider and ultimately commit to Fire TV over the stick.", "verified": true, "helpfulness": "0/0", "author": "modbantam"}, {"rating": 4.0, "review": "I love it, I am not the most tech savy and it was easy to was super easy to set up. I just wish the remote control had more options for game playing. Overall I am very happy with the fire TV.", "verified": true, "helpfulness": "0/0", "author": "aprildiva"}, {"rating": 1.0, "review": "i wish i could return this POS. Bought it hoping to customize it but the Nazi's Amazon folks locked the devices from being rooted after a firmware up. No I can't do the things I bought the device to do.", "verified": true, "helpfulness": "3/17", "author": "huyz"}, {"rating": 1.0, "review": "I need google app-strore or do not make it hard to root.I already paid enough money to watch prime service, then play store or rooting capacity is not enemy of Amazon.com.Once you sold it, Give everything to Users.", "verified": false, "helpfulness": "1/10", "author": "Minseob Lim"}, {"rating": 4.0, "review": "Does it works in Saudi Arabia?", "verified": false, "helpfulness": "0/0", "author": "Mohamed"}]