[{"rating": 1.0, "review": "I got this mostly to cast Netflix, but was under the impression that other apps would cast too.  Alas, no.  But since my primary interest was Netflix, that is OK.  But, that is not the major difficulty here.Chromecast does NOT work with all routers.  Even if your router is on the approved list, sometimes some very technical work must be done for your router to work.  Even if your router is formatted to work with Chromecast, it may not work all of the time.  I must get behind my 58 in screen every time and reset the Chromecast, Get behind my entertainment center to unplug my router, and turn my ipad off and then on EVERY TIME THAT I use Chromecast.  That is quite a frustrating experience.  Apple would never make something so inconsistent and SHODDY as this.", "verified": true, "helpfulness": "0/0", "author": "E. Blanck"}, {"rating": 5.0, "review": "This was a gift to a friend at Christmas.  He reports that it works amazingly well--with no particular bother to install.", "verified": true, "helpfulness": "0/0", "author": "Malcolm C. Hamilton \"Retired Harvard librarian\""}, {"rating": 5.0, "review": "Loving everything about it, easy to use, fast shipping, great value, easy to order and the best of all - it is a great item to have", "verified": true, "helpfulness": "0/0", "author": "Lissette"}, {"rating": 2.0, "review": "google with this device offers playback of files from any computer to phone and tv, and it turns out that only plays youtube, netflix and products they feels like, totally a fraud so far. I do not recommend it to anyone until google release the SDK for application development for this device.", "verified": true, "helpfulness": "0/0", "author": "Angel Gabriel Duque"}, {"rating": 5.0, "review": "Turned my Playstation Tv into a smart TV. My son, let me have his playstation TV, but it does not come with a way to put cable on it so bought this thing for it. It is better and faster than my Samsung Smart TV. It shows movies in full 1080p for HBO, NETFLIX, and YouTube. That is all I needed. I now can stream my exercise videos from YouTube on my TV in my room. It works great and does not run my phones or tablets battery down at all and can even use my android phone or tablet as a remote with my Chormcast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Setup went flawlessly. Love being able to stream my Netflix to the bigscreen. Kids like watching Youtube on the TV too. Wish there was a good way to do a picture slideshow, but that appears to be a google software weakness at this time. Compromised by letting Youtube create the slide show and then streamed that.", "verified": true, "helpfulness": "0/0", "author": "mark a johnson"}, {"rating": 3.0, "review": "It find that it plays older shows fine most of the time, but if we want to watch something new / popular it skips/pauses so much (the process of transmitting it from our slow internet to the tv?) that we often end up just watching on our computer again anyway. Talking about watching on Hulu, by the way.", "verified": true, "helpfulness": "0/0", "author": "Naomi Farr"}, {"rating": 4.0, "review": "Setup was quick and painless. The Youtube app and Chrome on the desktop performed well casting to it, though it may be slow at times.Currently, the number of applications that support this Chromecast protocol number in the tens (worse if you are based outside of the US), so I would only recommend if the app you use supports it (check first!).I mostly cast Chrome (desktop) for my movies (tip: Ctrl + O, select your movie file). Frame rate is slower than on my notebook but still watchable.Chromecast will become more useful once there is wider support for it, and option to mirror my Android device. Fingers crossed.", "verified": true, "helpfulness": "0/0", "author": "Lionel"}, {"rating": 5.0, "review": "I set up the device last night and it took me a little less than 10 mins. As soon as you plug it in there are instructions that go step by step both on the TV and on your device (my laptop). I'm electronically challenged and I did it without asking my electronic savvy room mates.you plug in to back of TVlog on to websitedownload appset up WI FI passwordname your device (opt)log on to Netflix (or whatever)play movieSo COOL!!! Best $35 spent!", "verified": true, "helpfulness": "0/0", "author": "Anna Plummer"}, {"rating": 5.0, "review": "At first I thought all I can watch is youtube and Netflix (which I don't have).  If you're using your phone or tablet, I suppose this is true, but I wanted to stream shows from my computer.  A friend of mine did some research and we found that as long as I use the Chrome browser (which is the only thing I use anyway) to stream my videos, I can stream it directly to my TV.  For instance, I can watch movies/shows from Amazon by opening up my Chrome browser, installing the \"Chromecast\" extension, and playing the media.  This can also be done with Netflix, ABC, CBS, Vimeo, Hulu (yes, regular hulu, no need for a hulu plus account), etc.I have not experienced any lag between audio/video/subtitles either.  I can finally watch anime on a big screen!!", "verified": true, "helpfulness": "1/1", "author": "Stepherz"}]