[{"rating": 2.0, "review": "Be sure to check the compatibility checklist associated with this. It doesn't work well with certain Verizon Fios Wireless routers. Too bad for me because it has functions that others don't like baing able to access your local PC for movies.", "verified": true, "helpfulness": "0/0", "author": "paypay"}, {"rating": 5.0, "review": "we bought a new LG flat screen tv although it wasnt a smart tv and capable of internet access but this makes it sooooo easy to access netflix etc.. I LOVE IT!! easy to install too!!", "verified": true, "helpfulness": "0/0", "author": "Tamara L. Gray"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Don C"}, {"rating": 1.0, "review": "It turns out that if you have a Hi Def. TV that is not a flat screen with an HDMI connector, you cannot use Google Chromecast.My Toshisba 36\" Flat Screen is not compatible with streaming so I ended up sending it back. The setup is also quite nightmarish,a major PIA, so I would not recommend it till they get their act together.", "verified": true, "helpfulness": "0/1", "author": "David Farhi"}, {"rating": 5.0, "review": "awesome!", "verified": true, "helpfulness": "0/0", "author": "V. Pongpitag"}, {"rating": 5.0, "review": "I love it! Every thing is perfectly integrated. Perfect for a party or just having company!", "verified": true, "helpfulness": "0/0", "author": "Steve Spokane"}, {"rating": 4.0, "review": "Great for the on the go person. Easy to setup. **DOES NEED TO BE PLUGGED INTO A POWER SOURCE!!! *** This is not shown very well on the advertisement. Good device to be able to pick up and take with you.", "verified": true, "helpfulness": "0/0", "author": "ChereeK"}, {"rating": 5.0, "review": "This thing is awesome. I am able to mirror my phone to my tv with pictures and videos also stream netflix and hulu with a perfect picture.  Only thing bad is I found the power has to be plugged in. The usb power cord isn't enough.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Leveta Goad"}, {"rating": 5.0, "review": "Needed one so bad works great", "verified": true, "helpfulness": "0/0", "author": "Syeda Syed"}]