[{"rating": 5.0, "review": "One of the best Attachments you can add to your TV.....", "verified": true, "helpfulness": "0/0", "author": "SSTRIKER"}, {"rating": 5.0, "review": "Gotta have a Chrome if you don't have a truly smart TV. Netflix, Youtube, easy stream from Android phone of local and network media", "verified": true, "helpfulness": "0/0", "author": "Mebobbob"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "basilio"}, {"rating": 1.0, "review": "The chromecast I have (given as a gift to me) constantly disconnects and has to be unplugged and re-plugged in to be detected.  I find that a simple HDMI cord does just as good a job as this device.  I am severely disappointed with this device.", "verified": false, "helpfulness": "0/1", "author": "DWillWest \"Utah Buckeye\""}, {"rating": 2.0, "review": "Pros:-Size & portabilityCons:-Needs a WiFi connection to work-Doesn't have a built-in media player. All playback is app dependent. The Chromecast app is only used for syncing.-Significant lag. Even viewing a picture slideshow (which you need to find an app to do) is a chore because of the lag.-You need to find/buy another app to play content on your device.-Most hotels block HDMI input now as a \"security measure\". I hoped to use it while travelling and have no been able to.I basically use it as a last-resort media player. When I'm somewhere with good Wifi and no other way to watch video and doesn't block HDMI input. I rarely use this thing.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "C. Hidanovic"}, {"rating": 5.0, "review": "This was a gift for my husband.  He uses it all the time and loves it.  He had no trouble installing it and learning how it works.  I want one for our other TV now.", "verified": true, "helpfulness": "0/0", "author": "Font Fanatic"}, {"rating": 4.0, "review": "Need more apps", "verified": true, "helpfulness": "0/0", "author": "Jon Forsberg"}, {"rating": 4.0, "review": "Works great but switched over to Amazon Fire TV stick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "great product for streaming from smart phone", "verified": true, "helpfulness": "0/0", "author": "Christopher M. Adams \"forest ranger 913\""}]