[{"rating": 5.0, "review": "LOVE IT!  So many things you can do from your PHONE and the cost is reasonable --it's amazing technology.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this thing. So easy. I didn't realize it didn't have a remote, only your phone is used for that but that is just fine. Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "BV \"BVO\""}, {"rating": 4.0, "review": "Pretty much what it claims to be: Streams various content to your HD TV. I've been extensively (12+ hours/day) using it for 3 days and the only complaint I have is that when using your phone with it, the command part disconnects after a few minutes so you have to manually reconnect to pause the video/adjust volume etc. The same problem does not occur when streaming through the Chrome extension on PC. But hey - it's only 35$.", "verified": true, "helpfulness": "0/0", "author": "Bora Basaran"}, {"rating": 5.0, "review": "EXCELENT!", "verified": true, "helpfulness": "0/0", "author": "David Antonio Segovia"}, {"rating": 4.0, "review": "easy to set up. :)", "verified": true, "helpfulness": "0/0", "author": "Bolla Zsuzsanna"}, {"rating": 5.0, "review": "I LOVE IT!!! it works seamlessly, easy to connect, fast, reliable. Lot's of fun for our kids to sing on karakoke by just finding the right music tubes with lyrics. I also love those HD videos of fireplaces or aquarium, it can be so relaxing.I have bought a second one for the other tv as well! highly recommended", "verified": true, "helpfulness": "0/0", "author": "Andrea Gallo"}, {"rating": 4.0, "review": "The only thing I'd like to add to the feature list is a support for more media formats. For the rest it's unbeatable. Exceptionally great device!", "verified": true, "helpfulness": "0/0", "author": "Sergey Zozulya"}, {"rating": 5.0, "review": "While casting web pages from anything but a chromebook is choppy, the netflix works fantastic and I love being able to use my phone as a remote and guide.", "verified": true, "helpfulness": "0/0", "author": "J. Anderson \"J\""}, {"rating": 5.0, "review": "My daughter got one for Christmas last year so we had to get my husband one shortly after.  We just plug in the back of our tv and use with our iphone or IPad and we can watch our Netflix shows or movies on the big TV now.  No more going through our Wii system.  Very easy to use and we use it most every day.  My husband loves watching U Tube videos and it has opened up a whole new world watching this on the big screen tv now.  It is a great price as well for a product that can do so much!", "verified": true, "helpfulness": "0/0", "author": "EJ"}, {"rating": 5.0, "review": "Thank you received the order in excellent condition", "verified": true, "helpfulness": "0/0", "author": "HAMEED YOUSEF M. TILEB"}]