[{"rating": 1.0, "review": "Only work through Crome.", "verified": true, "helpfulness": "0/0", "author": "R. Sloniker \"baladilady\""}, {"rating": 5.0, "review": "Excellent Product!", "verified": true, "helpfulness": "0/0", "author": "Gabriel S."}, {"rating": 5.0, "review": "This is small, easy, and works MOST of the time!", "verified": true, "helpfulness": "0/0", "author": "Marsha"}, {"rating": 5.0, "review": "I love being able to stream movies from my Nexus 7 to my 4k TV.", "verified": true, "helpfulness": "0/0", "author": "LT \"Luke Thornberry\""}, {"rating": 5.0, "review": "Delivery at time, original chromcast from Google.", "verified": true, "helpfulness": "0/0", "author": "Luisa Restrepo"}, {"rating": 1.0, "review": "OMG...  This this is awful.  There is an old saying that \"You get what you pay for.\"  This is a perfect example.  You'll be better off buying a device that connects wireless from you computer to your tv.  They cost around 100 bucks.  I had one that failed after a 1 1/2 so I tried one of these, thinking anything from the guys at Google cannot be all that bad.  Boy was I wrong.  All the software was labeled \"beta\".  They should be paying be to be a beta tester instead of me paying to be a guinea pig.  It did everything that was advertised, but badly.  Keep away until all the bugs have been worked out.  I'm sorry I cannot put \"0\" stars.", "verified": false, "helpfulness": "0/0", "author": "ez2laf"}, {"rating": 1.0, "review": "Tried this last winter 2013I don't know what the problem was but I tried it on both TVs would not work maybe because I have direct TV or the in line network system we use though the electric lines. . I even ordered a second one because I was excited but no luck. Great Concept", "verified": true, "helpfulness": "0/0", "author": "Love it or Leave it"}, {"rating": 4.0, "review": "I struggle with it a bit, more likely because of my overloaded wi-fi than the device.  I also have it attached to a tv that is far away from the modem.  But when it works, it is excellent.", "verified": true, "helpfulness": "0/0", "author": "M. Ponder"}, {"rating": 3.0, "review": "I bought 2 of these for my kids' rooms.  They don't like them because they have to use their tablets as a remote.  I love my Roku, which comes with a remote.", "verified": true, "helpfulness": "1/1", "author": "Mary C. Chaplin"}, {"rating": 4.0, "review": "The Chromecast is a nice little product, just about the cheapest way you can smarten up a dumb tv.  I'm an Apple guy, so I like the Apple TV better, but if you're on the Android/Google Play system, or don't want to spend a bit more money for the Apple TV, this is a pretty good substitute. I got a bunch of them and installed them on all my dumb tv's just so I could stream netflix and other media from my phone.  It would be great if the Chromecast had Amazon Prime, though.", "verified": true, "helpfulness": "0/0", "author": "J. Rand"}]