[{"rating": 5.0, "review": "I own two Chromcast devices. It is awesome to be able to cast Netflix, Hulu, and various apps like Daily Burn. The one negative would be against Amazon for not having Prime Video compatibility; however since I have a relatively new Android tablet running 4.4.2 I can mirror with Sound which is nice. Chromecast is a very easy install, and simple concept to master. We have an iPad and Andriod Phones and tablet, all which work very well with the chromecast. For the newer users: chromecast is like cable box for online apps. Your phone / device act like a remote, and simply point the chromecast to the right 'channel' being a web address. This is perfect for all age groups, as long as high speed wireless internet is available. Also, save money over a smart TV and simply plug this in. We don't have cable, so this has been an integral part of out TV experience. Even with a 7 Mpbs connection, we can stream HD. I have used a PS3, a sony smart dvd player, smart tvs, phillips smart dvd player, and Amazon Firestick. So far this has been my favorite. Also the screensaver pics when not in use are very nice, but can be pointed to a personal library. Happy Casting!", "verified": true, "helpfulness": "0/0", "author": "Matt F."}, {"rating": 4.0, "review": "Love my Chrome very easy to install watch Netflix all the time", "verified": true, "helpfulness": "0/0", "author": "Suzette C."}, {"rating": 2.0, "review": "i expected more from this little stick. i basically use it to screen cast from phone,pics,videos of kids and the regular movie from an app that i dont have on my smart tv. i have a new high speed router,1t business dsl,so im rigged up for speed.this lil guy always skips and says that it lost connection. so far every time i have used it,chromecast skips. very annoying when you have to restart on every movie or picture show.waiting for an update i guess. would wait till all the bugs are worked out.friend has the amazon stick and says he doesnt have that problem.guy at work has chromecast and says his does it too.buy at your own risk", "verified": true, "helpfulness": "2/2", "author": "jonathan scott lemley"}, {"rating": 5.0, "review": "Love 😀", "verified": true, "helpfulness": "0/1", "author": "Shanon"}, {"rating": 5.0, "review": "I've bought 4 of them (2 as gifts) since this came out.Google continues to support and upgrade services to use Chromecast.", "verified": true, "helpfulness": "0/0", "author": "M. Zanetti"}, {"rating": 5.0, "review": "Satisfactory delivery and item was as advertised.", "verified": true, "helpfulness": "0/1", "author": "Charles M. Caruth \"C. M. Caruth\""}, {"rating": 5.0, "review": "Sweet toy I take to to my friends houses use it for Netflix", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 4.0, "review": "In general I have really like the chromecast.  The only complaint I have is that it is not as easy as it could be to switch the network it is using.  This only becomes a big deal if you use it with a projector like I do and you are using it at different locations (like at my brother or sisters house).  Maybe I'm just doing something wrong, but I have to go through the setup process again each time I change networks (only a couple minutes, but still).  But it is a great product at a killer price and I would definitely buy it again.", "verified": true, "helpfulness": "0/0", "author": "Michael S. \"Engineer\""}, {"rating": 5.0, "review": "Works as advertized", "verified": true, "helpfulness": "0/0", "author": "Joseph Hummer"}, {"rating": 3.0, "review": "I don't like that you must use a device in order to do whatever you whant", "verified": true, "helpfulness": "1/1", "author": "Pablo Colombo"}]