[{"rating": 5.0, "review": "wow what a joy!! i can now watch  videos on the big screen instead if my loony tune phone ...it is easy to set up  (wireless)..i direct wired it to my modem before i realized there was no need this..i can even watch new and past pbs series that i missed in hd .....you can fast forward ,pause and reverse like a dvr ..no need to save the programs now, to watch later ..just rerun at leisure ....many free prime movies but  not as varied as i like, and  some with a fee seem a bit steep..but that being said there is enough to choose from.... has a voice option like Google.. press the button speak the title of the film or tv show and there it is  .", "verified": true, "helpfulness": "0/0", "author": "BROADWAYGYPSY"}, {"rating": 5.0, "review": "Amazing!!! Way better than the Apple TV it's simple easy and fun to use definitely a great purchase I don't regret.", "verified": true, "helpfulness": "1/1", "author": "Misty McClary"}, {"rating": 4.0, "review": "Easy to set upWorks great. Very clear picture. Love that I can watch all my movies on one machine", "verified": true, "helpfulness": "1/1", "author": "Blizzard"}, {"rating": 2.0, "review": "I purchased this Amazon Fire TV from a local retailer. At the time of purchase, the retailer told me that many of the sales since its release date were being returned, but i wanted to try it anyway. I subscribe to Amazon Prime Instant Video, which is a great service when they actually keep adding new content but not taking even more away as they add it. I have a ROKU 3 player but i thought i would upgrade because of the reports of this Fire TV box being faster and having  better picture. It is a wee bit faster..but is seriously not noticeable compared to the ROKU 3 and my 40MB Fiber broadband internet connection. The apps do include the basic most popular ones including Netflix, Hulu Plus, Crackle, Vevo, Youtube and of course their own Amazon content. It does not have VUDU, a Wal-Mart company that most people have chosen for their digital HD copies. Flixster has the copies also but the picture is not clear HD and poor quality. One app called Classic TV is a serious joke with barely a dozen tv shows with only 2 being actual popular classic tv. No HBO Go and no religious channels at all to choose from like TBN. The ROKU 3 can keep up with this device and has thousands of channels to choose from. Returning this back to the store today.", "verified": true, "helpfulness": "1/4", "author": "irishjdf"}, {"rating": 4.0, "review": "Amazon Fire TV is pretty cool, but can only give it 4-stars because I still find it difficult to find Amazon Prime Free content.  Once this feature is improved upon, it is definitely worth buying.", "verified": true, "helpfulness": "0/0", "author": "Boje"}, {"rating": 5.0, "review": "First let me start off by saying that I love this device.I have a Google Chrome, Roku's, Kindle and Blue Ray to stream through but the Amazon Fire TV stream really fast. I love the feature that you can say what your looking for and it finds it. The games are really fun on the big screen that my grandson won't move from in front of the TV. LOL...... Now that's the good and now for the bad.The updates when you first turn it on is really slow and the company said in it's launch video that when you buy this device that it will be loaded with all your apps. But I find that to not be the case. I had to go through and re-download the apps that I had. The remote is very sensitive when it fell on the floor it turn on the device. I'm a little upset that it does not have HBO-To-Go app on there so I have to stream through the other devices I have which kind of suck. But all and all I still love it!!!!!!!", "verified": true, "helpfulness": "1/1", "author": "Sandra Youdontwanttoknow"}, {"rating": 5.0, "review": "I have a (ROKU 2) an i think this is beter an it has just as much as ROKU2 has but more an it's so easy to set up an you can talk on it so much faster to find what you want to watch who need cable if you just have internet that all you need to watch TV there so much out there on the net you don't need cable.", "verified": true, "helpfulness": "1/1", "author": "Marcus"}, {"rating": 5.0, "review": "VERY EASY TO HOOK UP AND USE.  MY KIDS LOVE TO USE IT. THEY GET ALL THE SHOWS THEY LOVE", "verified": true, "helpfulness": "2/2", "author": "Karin Brown"}, {"rating": 3.0, "review": "Still its fun to own! If the choice of free Movies improves and IF an APP to listen to your music is forthcoming (as \"promised\") it will be a genuine addition to your home media. Right now I use my Tablet (Fire HD) to develop my watchlist. Its cool to watch the HD stuff on a HD TV..and as  a slideshow for your HD I phone/android phone photo's it cool.In any case for $ 99 its a BARGAIN!", "verified": true, "helpfulness": "3/4", "author": "Richard \"Ultimate Audible=Stephen King reading Stephen King!\""}, {"rating": 5.0, "review": "Best TV set top on the market so far, love voice search, easy to navigate and bluetooth remote (no line of sight) needed", "verified": true, "helpfulness": "1/1", "author": "Toan D Nguyen"}]