[{"rating": 5.0, "review": "All I really use the product for is watching Netflix, and that has been flawless so far. It does kind of limit the gadget that it must be plugged to a power source at all times. Hopefully in the future the product is expanded to have Pandora as well as other features. I am not really sure what use the device would be besides just watching Netflix and YouTube videos on the television.", "verified": false, "helpfulness": "0/0", "author": "Jones102"}, {"rating": 4.0, "review": "Worked great I just wish I could cast my whole desktop. Right now it's only your phone and approved applications / browsers. I want it all Google!", "verified": true, "helpfulness": "0/0", "author": "Pierce Colman \"P\""}, {"rating": 4.0, "review": "Excellent device. Easy to install and setup.  Would be rated 5 stars but it needs more apps that can access it.", "verified": true, "helpfulness": "0/0", "author": "D. Njaa"}, {"rating": 5.0, "review": "Completely satisfied with this google product.I use it for watching youtube videos and netflix movies with very good hd quality.", "verified": true, "helpfulness": "0/0", "author": "MARCELO"}, {"rating": 5.0, "review": "goooood is the best buy where I do in my entire live, solo conecta el chromecast y listo para ver tus videos favoritos", "verified": true, "helpfulness": "0/0", "author": "Ovidio sanchez"}, {"rating": 5.0, "review": "I received my Chromecast about a month ago and just love it.  I've used it mostly for Netflix and I'm totally enjoying being able to stream to my flat screen from my tablet without tying up my computer or running wires.  Picture quality is outstanding.  Installation was a breeze.  I've found I can also watch videos from my iTunes collection by just dropping the file into an open Chrome tab. All in all it's everything I had hoped for and will only get better as they add support for more apps.", "verified": true, "helpfulness": "1/1", "author": "Robert Munley"}, {"rating": 4.0, "review": "Just a great device to turn a non smart tv or monitor with HDMI into a streaming media viewing device. I look forward to more than Netflix, Hulu and Pandora streaming. I hope to see the ability to stream pictures as a slide show and the streaming of apps like Showtime, HBO or Dish Anywhere. I'm sure that the unit will see more features in the near future. Till then its worth the 35.00 to send netflix easily to a non smart tv.", "verified": true, "helpfulness": "0/0", "author": "G. Jones"}, {"rating": 2.0, "review": "My phone and tablet are Android devices.  Android users can't use Chromecast as Adobe Flash Player is required for Amazon Videos and Adobe no longer plays nice with new Android  devices.  Netflix streaming never materializes as Chromecast times-out when you attempting to stream from your device to your TV.So promising, so disappointing!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I didn't give this a full five stars because I don't like that it doesn't stay charged very long being connected to the t.v. and doesn't come with a cord that reaches to a wall outlet, just a plug to connect it to a wall outlet once you find a cord for it (we use our ipad cord). It walks you through the whole process which is pretty easy and only takes about 15 minutes which is great.Youtube comes in perfectly and netflix works really well. I've heard hulu+ is going to be allowing chromecast access soon as well although you can still get on the website and cast it, it's just not as clear since you're not streaming as directly as you can with netflix right now.If you use chrome browser you can cast pretty much everything you can think of onto your t.v. We use a great movie site and have been able to watch all the movies we want on our t.v. instead of having to huddle around our small computer screen. It's great for traveling too. All you have to worry about is the dongle and the cord so they pack nicely.Honestly for a 35$ flat fee this just can't be beat. It's brand new too so you know it can only get better. It's definitely worth the money in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Lauren Cantino"}, {"rating": 5.0, "review": "This product is awesome.  I have to say that when using it from my computer, it's less effective and tends to buffer a little more often.  I think that's because the WiFi is using more bandwidth through my computer than it is through the tablet or phone.  That said, when I use my phone or tablet to stream, it's PERFECTION.  Perfect picture, I can still use the tablet for phone for whatever I want to use it for even if I'm watching a show on Netflix or something.  I highly recommend this product to anyone who is searching for an easy, quick-set-up device for streaming to your TV.", "verified": true, "helpfulness": "0/0", "author": "McLee"}]