[{"rating": 4.0, "review": "I'm really surprised how well this little device streams Netflix.  I being able to control the device with my phone.  Can't beat the price!", "verified": true, "helpfulness": "0/0", "author": "Corbett Stubbert"}, {"rating": 5.0, "review": "This is great. You plug it into your tv and you can stream Netflix and other apps onto your screen. I absolutely love it. I open the Netflix app on my phone pick a movie and stream it to my tv. Its so simple and convenient.", "verified": true, "helpfulness": "0/0", "author": "Tabitha Melanie"}, {"rating": 4.0, "review": "Setting it up was a lesson in frustration. I followed the instructions, no go. Googled how to set it up, followed several people's suggestions, no go. No matter what I did at the very last it would tell me that it could not find the network. Finally figured it out. During the install, your wireless device, I was using a laptop, will be connected to the Chromecast as if it's a network. You have to go in and connect back to your \"home\" network. After that it worked like a champ, with some limitations. If you are using one of the support sites, like Netflix and Google Chrome it works great. But, if you try and cast a video playing in Chrome (I download a lot of videos, all legally of course) it's very hit or miss. Another little bugaboo, once you start casting, it actually no longer uses the device, like a laptop, it connects straight to your wireless router. You could turn your laptop off and it would keep playing the video. And that's the problem. It's hard, to the point of ridiculous, to control the playback. One night we simply could not get control and had to boot the router to get it to stop. If you leave the laptop open and the video playing, it's okay, but it seems silly to have it playing on your monitor and TV.", "verified": true, "helpfulness": "0/0", "author": "Kristi K. Potts"}, {"rating": 5.0, "review": "I have canceled cable and now only \"cast.\"  By cancelling cable I save >$100.00 each month. Very happy.ThanksTony", "verified": true, "helpfulness": "0/0", "author": "a landrum"}, {"rating": 4.0, "review": "This is not going to compete with the Roku 3 or the Amazon Fire TV.  However it does the same stuff essentially and the portability is amazing.  It just doesn't have the power that you get from the new set top boxes.  But if you have netflix or hulu or you just want to show a you tube video on your tv this thing is great", "verified": true, "helpfulness": "0/0", "author": "brian"}, {"rating": 5.0, "review": "I love being able to watch some of my favorite YouTube videos on the big screen.  I just wish that I could watch anything on the internet as well as my own personal videos as well.  This item is well worth the cost and more.", "verified": true, "helpfulness": "0/0", "author": "StephanieR Whitt"}, {"rating": 5.0, "review": "At first i thought it would be a waste of money but I was completely wrong. This Chromecast is great, I now can watch netflix and youtube on my tv (:", "verified": true, "helpfulness": "0/0", "author": "JohnMcCain"}, {"rating": 2.0, "review": "I did enjoy this unit while it was working despite not being able to take advantage of Amazon Prime. But it had a hard time switching controllers. I would have to reset the unit every time I tried to switch between which phone or tablet we were controlling it with. Finally the thing just quite working all together around 2-3 months in. I haven't replaced it I think I'll pay the extra for a more capable and reliable device.", "verified": true, "helpfulness": "1/1", "author": "Clintonics"}, {"rating": 2.0, "review": "I wanted this device to mirror my laptop to my tv. it works, but it works like tv worked in 1950. the video is herky jerky and the sound doesn't match the action on the screen. I'll probably send it back.", "verified": true, "helpfulness": "1/1", "author": "Stephen L Workman"}, {"rating": 5.0, "review": "Love this device, it is a little slow to start netflix and youtube videos but it isn't unreasonably slow.Can cast my chrome tab through which I can watch amazon prime videos. When casting chrome tabs with my old laptop , the video and audio lags, but no issues when I do it from my new laptop.", "verified": true, "helpfulness": "0/0", "author": "desihorn"}]