[{"rating": 5.0, "review": "we LOVE this!!! this is so much fun bc the ppl i live with are not on FaceBook or the internet really and this way I can share things on youtube or whatever and we can all laugh and enjoy it at the same time on the *big* screen not all hovered over a computer. it's fantastic to log onto youtube hit your favorites and let them all roll through!!!! FANTASTIC!!!", "verified": true, "helpfulness": "0/0", "author": "Wheels"}, {"rating": 3.0, "review": "we have ATT uverse, using this wirelessly is very slow...works mainly with youtube..keeps buffering, pretty much useless for us...had to return.", "verified": true, "helpfulness": "0/0", "author": "jadegal"}, {"rating": 3.0, "review": "Even though it's connected, sometimes it says it isn't and it is quite a challenge to get it reset.  This happens fairly frequently.  However, when it does work, it is really great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Living the dream in paradise\""}, {"rating": 2.0, "review": "Before you buy this product, its extremely important to understand what the Chromecast is and is not.  The marketing for this device is VERY misleading.  Most promotional material and retailers advertise the Chromecast as a way to \"Stream videos and media from your smartphone, tablet, or laptop wireless to your HDTV.\"  A more accurate description would be \"Stream videos and media from the Internet to your HDTV, and use your smartphone, tablet, or laptop as a media remote.\"  If you're looking for a screen mirroring device, DO NOT BUY THIS.The way the device works is that, during setup, it can make a direct connection with your smartphone or tablet so that you can set up a connection to your Wi-Fi home network (a requirement to use it).  After that, everything Chromecast plays on your TV streams directly from the Internet.  You can use your phone or tablet to control apps designed to work with it, such as Netflix, YouTube, Hulu, or anything else Google has so kindly decided to partner with.  However, your phone controls the service through the Internet, then the service controls the Chromecast.  You cannot directly stream media from your device to the Chromecast out of the box, which is more of a Google limitation than a hardware limitation since you can directly connect to the hardware during setup.What this device is designed to do, it does very well.  Basically you can turn any HDTV into a SmartTV, adding easy access to online media streaming services.  Streaming from these services is mostly just as smooth as if the apps were built directly into the TV, with the added convenience of using your phone, tablet, or laptop to control them.  If you already have a SmartTV with Netflix, YouTube, etc. then THIS DEVICE WILL SERVE NO PURPOSE FOR YOU.There are a couple of services you can use to try to stream media you have on your PC or other device to the Chromecast (i.e. Plex), but they have a myriad of problems such as lower screen resolution, playback freezing, sound sync issues, etc.  I spent hours trying to get it to work before I finally just returned the Chromecast for a refund.Your best bet is to hold out for a Miracast compatible dongle.  Some of these products are priced about the same, if not less than the Chromecast.  The only drawback to them is your phone, tablet, or PC must play the media and stream it directly, which will use your mobile device's battery power (an easy fix by plugging it in).  However, with Miracast you can display anything on your HDTV that displays on your mobile device.  The Chromecast is fine if you just want SmartTV app functionality, but its just too limited and useless if you already have a SmartTV.", "verified": false, "helpfulness": "2/4", "author": "Majoraslayer"}, {"rating": 5.0, "review": "I simple spend my whole first weekend with this Chromecast just watching movies on Netflix and videos from Youtube. Best tech toy of the year!!!", "verified": true, "helpfulness": "0/0", "author": "Alejo"}, {"rating": 5.0, "review": "I had to returned the first one because I felt it was defective. But the customer service was just awesome to deal with and they send me another one. I received the second one yesterday and it works!! Yay! Over the years Amazon is still number one in my book because of excellent service. Definitely give them thumbs up!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Netflix and YouTube work fantastically on this. No streaming issues at all. Tis great. Should go get one right now", "verified": true, "helpfulness": "0/0", "author": "cperry865"}, {"rating": 5.0, "review": "Gives our family real freedom in our viewing choices. We don't have the expense of paying for shows that we don't use.", "verified": true, "helpfulness": "0/0", "author": "Terri Mcfaddin"}, {"rating": 4.0, "review": "Beware, this is not the device for you if you live in a townhome/apartment community. If you have multiple overlapping WIFI signals inside your home expect that this product will get lost in the fray. if you have a good strong WIFI signal it works great.", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Love it!!! Very inexpensive way to turn your high definition plasma/lcd/led tv into a smart tv. Good buy! I have 3.", "verified": true, "helpfulness": "0/1", "author": "LaRwan McClaine"}]