[{"rating": 5.0, "review": "I won't go into major detail on how it works. I can say this:-It's easy to setup-Its easy to use-its cheap in comparison to other options out thereFew complaints:-Google is starting to limit what you can do with it.  Locally hosted videos are not super easy to use, if you can open them in Google Chrome  you can stream it but you can't just stream from a video player.-Amazon video is not easy to use with it.Buy one!  $35 and it does a lot", "verified": true, "helpfulness": "0/0", "author": "C. L. Trujillo \"Lane\""}, {"rating": 2.0, "review": "Ok, after all that hype I got it.  It works great, its easy to use, but it only has two apps: Netfix and Hulu.... I only use Netflix.Anyone one if this product is going to develop?", "verified": true, "helpfulness": "0/0", "author": "Richard A. Muirragui"}, {"rating": 4.0, "review": "When it works it works fine. However it drops out occasionally - probably more to do with the internet connection than the device.I recommend it.", "verified": false, "helpfulness": "0/0", "author": "Howard Friedlander"}, {"rating": 5.0, "review": "Bought it the day it was released. I was hoping it would be a replacement for a miracast adapter (i thought it had the same functions). To my amusement, the product is very limited function wise. You cant mirror what your doing with your android phone nor tablet (I own the nexus 4 phone and the nexus 7 tablet). I gave it to my parents and they love watching netflix on their tv.", "verified": true, "helpfulness": "0/0", "author": "Oscar A. Fernandez \"Oscar Fernandez\""}, {"rating": 4.0, "review": "It is easy to set up. It works very good. However, it needs more options.  It is the cheapest and the best that I found.", "verified": true, "helpfulness": "0/1", "author": "Deb Bonnerjee"}, {"rating": 3.0, "review": "I like the concept but it gets 3 stars for the following reasons: It took nearly 2 months to arrive and I know it was a new (and much-hyped) product when I ordered but still, I expected better from a company the size of Google. I can't fault Amazon because they kept me informed every step of the way. Secondly, although it works well with Google sites like youtube and with the Netflix app, I would be more impressed if it worked with everything. By that I mean the Chromecast is locked into the Google Chrome browser so if it can't be watched in a browser window then it doesn't work. That may not be a problem for most people but if you have digital copies of movies that you want to watch then it just won't work.", "verified": true, "helpfulness": "0/1", "author": "T.C. Doust"}, {"rating": 4.0, "review": "There are obvious reasons why anybody should love having one of these babies, but it does have it's downsides.Pros:CheapWorks with pretty much any phone or tabletPortable-ishVideo seems to be fast and without lagCons:Needs to be plugged into the wall (or USB?) for power, so it's not as portable as they would have you think...Limited number of apps, but growingSeems to be slow to react (play, pause), possibly from lack of computing powerOverall, good value, and does what it is supposed to", "verified": true, "helpfulness": "1/1", "author": "Jay C. Lloyd"}, {"rating": 5.0, "review": "Excellent product, good connectivity and easy to install.For a few dollars makes a great function. Nice, Easy, Small and Cheap.", "verified": true, "helpfulness": "1/1", "author": "John"}, {"rating": 3.0, "review": "I like it but some vids i pull off youtube come out really fuzzy and others off internet the chromecast doesn't keep up with", "verified": true, "helpfulness": "0/1", "author": "nikki"}, {"rating": 5.0, "review": "this is an awesome product.  i am completely satisfied.  I love the fact that i can stream my ideos using my phone.  Totally dont have to hook up my computer to the tv anymore.", "verified": true, "helpfulness": "1/1", "author": "B. Amin"}]