[{"rating": 5.0, "review": "Chromecast is a great product if you want to take what you are watching on your phone or tablet and moving it to the tv. I did find that there were some restrictions on what apps and internet you can use it with. I had to find another app for my android to be able to watch shows from another source other than the supported apps and it works well with it too.Product is exactly what I thought it was going to be and came in the exact time frame of estimated delivery.I would recommend this to anyone who wants to have that versatility between their devices and the tv.", "verified": true, "helpfulness": "0/0", "author": "PNW '64 Impala"}, {"rating": 1.0, "review": "This is less than a 1 star product until Google implements MiriCast or an app that EASILY allows you to share your desktop and ANY application that is running on your desktop. I own 2, 1 at work that sits in a drawer and 1 at home that is now in a drawer since my smart TV has all the apps that Chromecast supports.", "verified": false, "helpfulness": "0/0", "author": "OTazMan"}, {"rating": 1.0, "review": "Everything was fine with the product until after three months of use no longer worked more, this no longer gave more signal and did not respond.", "verified": true, "helpfulness": "0/0", "author": "Herfox"}, {"rating": 5.0, "review": "Very easy installation, works smoothly.", "verified": true, "helpfulness": "0/0", "author": "Shimon Solodkin"}, {"rating": 2.0, "review": "Could not get it to work. ...", "verified": true, "helpfulness": "0/0", "author": "1122 \"R'Z\""}, {"rating": 5.0, "review": "My new favorite household gadget. I use it all the time.", "verified": true, "helpfulness": "0/0", "author": "B. Skup"}, {"rating": 5.0, "review": "Awesome! My go to entertainment when there's nothing on television to watch.", "verified": true, "helpfulness": "0/0", "author": "great game"}, {"rating": 3.0, "review": "Works ok", "verified": true, "helpfulness": "0/0", "author": "AH"}, {"rating": 5.0, "review": "The future of TV is here. The only downside I've seen is that sometimes it disconnects from the WiFi, and I have to reset it.", "verified": true, "helpfulness": "0/0", "author": "Chris A."}, {"rating": 4.0, "review": "It's the 😎 thing ever", "verified": true, "helpfulness": "0/0", "author": "lashaun smith"}]