[{"rating": 5.0, "review": "Purchase the Chromecast a couple months ago. I'm very happy with the product. I use the Chromecast on my phone,tablet, and computer. Works really well if you want to stream movies or music from your devices.If you are considering ditching the tv company and just using netflixs and amazon prime then I would totally recommend this product.The software and hardware are really simple to use.", "verified": true, "helpfulness": "0/0", "author": "Sudden"}, {"rating": 4.0, "review": "Works fine....does what it is suppose to.  I am not a expert on these kinds of things but I have had no problems.", "verified": true, "helpfulness": "0/0", "author": "Angele R."}, {"rating": 5.0, "review": "We ordered  this device so we wouldn't have to get another cable box, and have had a very easy time using netflix, and Amazon instant video. It is a cheap easy way to stream from your apple device.", "verified": true, "helpfulness": "0/0", "author": "Caitlin  Granville"}, {"rating": 4.0, "review": "During set-up i get an error message and it quits installing.  doesn't work and i can't find anyone to help me from tech supportThe \"simple\" directions I hate.  During a snow day i started fooling with it again.  i downloaded the free app to a device (Nook) and it works perfectly now.  they should have taken a little more time writing the directions.", "verified": true, "helpfulness": "1/2", "author": "Matthew Marzec"}, {"rating": 5.0, "review": "Chromecast works great. Installation and configuration were easy. I can wirelessly, from across the room, stream anything showing on Google Chrome. YouTube has its own app that automatically took over when I streamed a movie from YouTube.I initially loaded it on a small 11.6\" laptop with an AMD A6-1450 processor & 8 GB Ram, passmark of about 1640. Performance was so-so. Some sites streamed well and some were very choppy. I prefer this small laptop over android tablets ... much better browsing and just as portable.After loading the Chromecast app on a full sized laptop with 8 GB Ram and a Sandy Bridge i3 processor, passmark of about 3300, all choppiness disappeared. Sound lipsynched perfectly and sounded great both on the TV speakers and the sound system the TV outputs to. The image on TV was crystal clear.I much prefer this over a Roku, which I once owned but returned when I found out it was not DLNA capable. My DVD player supports my DLNA needs. The Chromecast is for internet streaming only.", "verified": true, "helpfulness": "0/0", "author": "CPA Tech Geek"}, {"rating": 5.0, "review": "I have two chromecasts now and I absolutely love them.  I use them everyday.  I recently discovered that the TV you are going to be casting to does not need to be on to start loading your cast.", "verified": true, "helpfulness": "0/0", "author": "freeflyingbam"}, {"rating": 5.0, "review": "I bought this for my husband for Christmas and he really likes it.  I was a little concerned because he is not the most technical person, but the manual that comes with it is very easy to follow and my husband was connected with ease.  I completely recommend this item!", "verified": true, "helpfulness": "0/0", "author": "Lora Thompson"}, {"rating": 3.0, "review": "This product is easy to use and cheap to buy, but functionality is a question.  There are not a lot of videos I have found that will work with it.  Maybe I'm not tech savvy enough.", "verified": true, "helpfulness": "0/0", "author": "Stephany \"in Iowa\""}, {"rating": 5.0, "review": "Easy to get going, no problems at all. Works every time. Enjoy watching on the television without putting any drain on my cell battery. Best money I have spent in a while. Looking forward to more apps.", "verified": true, "helpfulness": "0/0", "author": "doug a"}, {"rating": 5.0, "review": "Amazing speed -no loading time and picture is crystal clear.  So easy to use from all devices.  Great price!  Highly recommend this item for all who like to watch shows from internet or just use your tv as a computer(or other device) monitor.  Sometimes we just let pictures scroll through on the tv, its really cool!  I love easy technology!", "verified": true, "helpfulness": "0/0", "author": "Quality Thrifty Shopper"}]