[{"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Don Sullivan"}, {"rating": 5.0, "review": "I love it! I like how the heart turns red when its full and green when its dead. Its so cute and very good loud sound to me when I connect it to my laptop and gives ultra clear sound and stands up on its own or lay it down to sleep while charging. There is a key holder included. I have to lower it sometimes because im afraid to blow the speakers. lol My friends came over and asked where did you get that? They went and each bought a few from this company as well as I did. :)", "verified": true, "helpfulness": "0/0", "author": "Jacquelyn"}, {"rating": 5.0, "review": "it has changed my life, i love it", "verified": true, "helpfulness": "0/0", "author": "Angela Fabiana"}, {"rating": 4.0, "review": "Works, was hoping it would cast everything from the phone, like the FIOS app, but not Chrome Cast's fault...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have an iPhone so it works pretty well with chrome cast. Apple TV is much better for iPhone but u pay more. I like how you can display your google chrome internet browser to it.", "verified": true, "helpfulness": "0/0", "author": "Ryan Keen"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Gajeel Redfox"}, {"rating": 5.0, "review": "I got this from Target for $35, but it came with a $10 gift card. I love this little thing. I had some issues setting it up initially, but I think that was my fault. If this happens to you, restart the chromecast and the wifi router. I love that I can cast with my laptop screen shut--no battery use at all. I have nothing negative to say about it, actually--hence the 5 stars :)", "verified": false, "helpfulness": "0/0", "author": "Bissey"}, {"rating": 5.0, "review": "The best!", "verified": true, "helpfulness": "0/0", "author": "Julius"}, {"rating": 5.0, "review": "Great just make sure you have decent wifi where you put it. That can obviously cause issues. Aside for that great price for a great streaming device.", "verified": true, "helpfulness": "0/0", "author": "tcneuen"}, {"rating": 5.0, "review": "We have 5 of these, Love Chromecast. Super nice to have around.Take one on vacation with you so if you get stuck in your hotel room you can watch what you want.", "verified": true, "helpfulness": "0/0", "author": "Dan"}]