[{"rating": 1.0, "review": "For those of you that would be mislead by the \"supported\" formats understand this:  This device supports \"fixed\" content provider streaming only.  Have a library of your own video files you want to watch?  This won;t do it unless you install an app like Plex - which is fine except there are already hundreds of other devices out there that do that.This is yet another \"Me Too!\" device.Going back for a refund.", "verified": true, "helpfulness": "25/55", "author": "J. Borregoresner"}, {"rating": 2.0, "review": "Voice search is kind of a neat feature otherwise I found the interface clunky, the software buggy, and the interaction left me wanting. I'd stick with the AppleTV for at least another revision. There is hope here but the first attempt missed the mark.", "verified": true, "helpfulness": "6/17", "author": "RamblerMan"}, {"rating": 5.0, "review": "Love this device. Its lightening fast to navigate. Menu system is easy to use - no convoluted sorting. Voice search works surprisingly well. For $100, its a no brainer.", "verified": true, "helpfulness": "2/4", "author": "glassmj"}, {"rating": 4.0, "review": "Overall, I am very happy with this device.  It is extremely fast...much faster than my already fast Roku3.  The only key misses I see are the lack of the search ability to return results from the NetFlix app and the lack of support for IR remotes.  I would give up the voice search for the ability to use my Harmony.  Maybe Amazon will create their own universal remote controls...hint, hint.Packaging:I knew the device would be small, but I was shocked when I got this tiny little box.  The FireTV device is much smaller than I expected...about the size of two decks of cards sitting side-by-side.  The box contains the Amazon FireTV, Remote, 2 Amazon Basic AAA batteries for the remote, the AC Adapter and a small Getting Started guide.Hardware:The box is as unassuming as you could ask for.  Very small, as noted above.  Easy to hide in your entertainment center or velcro to the back of your TV.  The remote range seems to be good as my FireTV is in the equipment room about 20 feet from where I watch TV in my bedroom with a wall in between.  No issues with signal range for me and I doubt anyone else will have reason to complain.Setup:Setup could not be any easier.  Plug in the HDMI and network cables and then provide power.  After an initial device Update (took about 4 minutes on my network connection), you are up and running.  The FireTV is already configured for your Amazon.com account, which was a nice surprise.  Any videos you've already purchased or photos in your cloud drive show up immediately.Usage:The interface design is professional and plan.  A menu on the side lets you navigate between the various sections of the UI (Movies, TV, Photos, My Videos, etc.).  On the right are thumbnails of the available items to view.  Navigation in the UI is very quick and most videos start almost immediately.  My guess is that Amazon starts pre-downloading the video it thinks you will need so it has started buffering before you click to start the movie.The Netflix app works well and matches the new standard NetFlix UI on most other devices.I have not played with the games yet since I will not have the controller until next week.Overall, I would highly recommend this device for anyone already in the Amazon ecosystem with Prime or the Kindle devices.  The speed alone makes it worth the additional price of a Roku3 device.  Just carefully review the available channels as the Roku has many more than Amazon right now.  Until Amazon expands their library significantly. you may find the FireTV does not have the channel you want.", "verified": true, "helpfulness": "7/8", "author": "Shan A. Greer"}, {"rating": 3.0, "review": "Well I ordered this device after much love for my apple TV and HBO Go support.  I have been looking for a device that would give me excellent access to my amazon prime content and Showtime on demand.  So this seemed like a great deal.It works very much like Apple TV and if you like apple TV you are probably going to enjoy this device.  It paired quickly with the network and updated itself.  It works seamlessly with amazon prime content and your watchlist.  So I very much like it for that.But showtime was a bust!!!!!!!!!! Ugh, I have COMCAST, not a small cable operator and there is no support for them and showtime.  They did support ATT, Verizon, Optima..... So hopefully comcast will be in an update soon.And play games on this.....ahhhh, probably no one would do that.", "verified": true, "helpfulness": "7/9", "author": "DB"}, {"rating": 4.0, "review": "I'll preface this by saying that I have a Kindle Fire HDX (7\" screen), and the first feature of the Fire TV that interested me was Second Screen. At the moment, there is only one device verified working for Second Screen. It is basically a wireless HMDI router which costs half the price of the Fire TV, about $50. For $100 I get more heaps more functionality out of the Fire TV than otherwise.Out of the box the Fire TV was a no-brainer to set up. It does not come with an HDMI cable, so you will need one. Just something to keep in mind. Once I stole the HDMI cable from my Wii U and plugged it in, it took about 5 minutes to install updates.The remote is very tiny, but nicely so. I had no problems navigating menus and stuff.Once it finally finished installing updates a tutorial video automatically started, which I was not able to escape out of. Once that was done, I found that the Fire TV was already pre-configured for my Amazon Prime account. My watchlist and library was all ready to go.First thing I did was to check Second Screen, which was enabled by default, so I set my Kindle Fire HDX to mirror. It does take a noticeable amount of time for the HDX screen to appear on the TV. This does not appear to be a one-time delay; each time I disable and re-enable display mirroring, it takes the same amount of time. Once my Kindle Fire HDX display finally appeared on my TV screen, I started a non-Amazon video app and watched about 60 minutes of streaming content. I noticed no lag at all.After that, I watched some videos from Amazon Instant Video. Again no lag, and the navigation and presentation felt pretty natural to me. Skipping forward or backwards was quick. I tried a few voice searches, but since I had no issues with it hearing my NJ accent, I really have nothing to say other than it seems to work as advertised.I have no interest in HBO content, so the lack of the HBO app has no affect on me. I'm a big anime fan, and Amazon's Instant Video library doesn't wow me very much. Hopefully Crunchyroll will have a Fire TV app; and if not, I will just use Second Screen.Happy with the video aspects of this all, I checked out the apps, and downloaded YouTube. The search bar in YouTube is not fun. A ribbon of the alphabet appears at the top, and you have to cursor around like you were playing an old arcade game trying to enter your name into the high-score screen. Well, it works, and that's about all I can say. I haven't looked at the games yet, and I'm not sure I will. I'm an old-school console person, and so far, Android gaming (which the Fire TV is member of) doesn't grab me, and I don't see it ever replacing my 3DS.All said-n-done, I am quite pleased, and feel no buyers remorse. The only reason I give 4 stars is there is I feel there is a bit of room for improvement. Since the device is less than a week old as of this review, I'm sure there will be more updates, and I hope for more apps and such. Who knows, maybe they'll release a game that'll make me change my mind.", "verified": true, "helpfulness": "3/3", "author": "azog"}, {"rating": 4.0, "review": "Best Feature : Voice SearchI hope they expand upon this within apps as I would love to search within Youtube or Plex, currently it only brings up Amazon features from what I can tell.First Glitch : Could not see what key I was on while typing on the remote keyboard in Netflix after installing, had to restart unit. Would be AMAZING if you could talk/type instead of keyboards.Audio : Optic out is VERY nice and sounds great though I miss my headphone jack on the Roku 3 remote.Perhaps when this is more refined and voice is integrated better and they offer more channels I will like Fire TV better than Roku. They really need to add Spotify.", "verified": true, "helpfulness": "2/4", "author": "NA"}, {"rating": 4.0, "review": "Pros:Streams excellently on Netflix, Amazon and others EZ setup -Connects without any major issues on both ethernet and wifiIs much faster than any other streamer I have used, fastest way to connect and stream netflix I have used.Works with manual network setup (unlike chromecast)A few games are free and a few can be played with just the included remoteVoice search recognized everything I threw at itThe specs and speed are the best I have used. Downloaded lots of apps and just was quick to run, quick to start.Cons:Not many apps and games yetDoes NOT stream local media except with Plex app (hopefully this will be fixed in the future)Doesn't stream local media via UPnP, DNLAThe interface is not the greatest for Browsing Amazon Prime movies, no way to only show prime moviesI thought several included prime movies and shows because they had a price listed, I had to pay for, this should be clearer.Remote is wifi based so you cannot program access into your universal remote.1st update is huge, almost a gigabyte so takes awhile to download.Voice search only searches thru Amazon apps and movies/tv shows.What it needs to be 5 star:Local streaming of network and USB contentA better format for browsing Amazon Prime content, voice search works great but browsing is far from easyMore apps and gamesVoice search to integrate across the systemThe ability to easily identify prime content and restrict searches to prime content. I get that Amazon wants you to see that they have it and you can see it on their box, even if you have to pay, but there is better ways to do this then the current interface.Ability to add an IR input so you can use your universal remote. And possibly an ip remote which some other devices haveAll of these are easy fixes and Amazon has lots of feedback to work on them. This device would be a better value at79 instead of 99, but frankly, it works quick enough and hopefully the future updates will make it 5 star. I think I am keeping mine for the long haul and I for sure am using it to stream netflix and Amazon prime movies,This is a pretty good box. I have played with all the streaming boxes and toys (Roku, Sony, Briteview, Chromecast) and this is the fastest, clearest for what I have seen, but it has lots of limitations at launch. Still I will be keeping it because usually Amazon fixes this stuff and it does lots of things I want. To see amazon prime on your tv, Its this or Roku. This is faster than Roku and the voice search is great, but it is a bit more confusing. I hope they make it so you can play local media natively, as that would make this the 5 star box it should be.I plan on updating this list as I play with it more and Amazon updates it in the future", "verified": true, "helpfulness": "5/6", "author": "Jonathan Ryan"}, {"rating": 5.0, "review": "It arrived today and was so easy to hook up & install the updates /apps. The streaming is great & better than my blue ray. The box is about the size of a cd case. So far the only thing I don't like is the bright led light, but I don't like them on any of my equipment. Isn't electrical tape wonderful-?!  Lol", "verified": true, "helpfulness": "3/4", "author": "bubblechamp"}, {"rating": 5.0, "review": "I have used Apple TV,Roku, Vizio, raspberry pi running Xbian even windows and Linux media desktops. They all failed in one way or another either too closed ecosystems, unpolished and left unsupported or too noisy and unreliable.  So far this device has a lot of content and apps for a day one device everything I stream is instant the UI is very polished better than most XBMC builds I've used. In fact its running android at its base so running XBMC is a possibility in the near future. The games have all played well and I expect emulation apps in the app store soon. The OS is very polished and the app store if like the kindle fire will grow rapidly.  The build quality is great and simple it compares to my apple tv in texture and color its somewhat larger but omits no noise and runs cool. Its basically what I've come to expect from all Amazon basic goods.  Overall this is a great buy it already has great content and is easy to use but if you like to tinker with devices the future is bright for emulation and XBMC. If you need a streaming device this is the best out there for both content and expendability. Ill update with more as I use it and hopefully get some new apps.", "verified": true, "helpfulness": "2/3", "author": "Airforcekid"}]