[{"rating": 4.0, "review": "Can I watch Dish world programs and fios tv", "verified": false, "helpfulness": "0/0", "author": "John M Rodrigues"}, {"rating": 4.0, "review": "perfect device but with low space and a lot or critical warning about the space i think this is the main bad think in the device", "verified": true, "helpfulness": "0/0", "author": "arkan suliman"}, {"rating": 4.0, "review": "I liked my Logitech, Google TV better. Sorry Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Hi i am going to travel to the united states the next week . The thing is i live in mexico city if i connect amazon fire tv will i have the same conection than in usa ???? Is there any problem if i use it outside of us ?? Thanks", "verified": false, "helpfulness": "0/1", "author": "Jacobo"}, {"rating": 5.0, "review": "This is great ,easy to use .works well !!!!  Fast", "verified": true, "helpfulness": "0/0", "author": "Tj Kropp"}, {"rating": 1.0, "review": "Not sure this happens a lot, but my unit worked for one night and then died (it just went dark and stopped sending any signal to the tv).  Guess it was junk out of the box.  The one night I did use it I found the voice search feature pretty good, but did not much care for the interface.  It's not horrible, but I prefer the Roku 3.  Didn't seem that much faster than the Roku 3, but was a bit quicker to process the initial load of a movie.Maybe if it hadn't died I would have become used to the interface.  I'm not giving another unit a try.  Not enough difference between the Roku 3 to take the chance on another piece of junk that will die prematurely.  But as always, Amazon great on returns.", "verified": true, "helpfulness": "0/3", "author": "J. Yerian"}, {"rating": 2.0, "review": "I was really hoping to love this item so I was very disappointed by the small number of channels available. I am a prime member and love being able to stream my television shows and movies, but I also have other subscriptions to other channels that were not available on the Fire so I had to send it back.", "verified": true, "helpfulness": "2/3", "author": "T Griffiths"}, {"rating": 5.0, "review": "I was amazed by the size of the box and remote and that anything could be so simple to set up. I have been enjoying streaming to my TV now, using the Amazon Fire TV, although I had already enjoyed watching old TV runs on my Kindle Fire HD. I used the voice activation to recognize all of the Prime selections.  So glad I made this purchase.", "verified": true, "helpfulness": "1/1", "author": "Joyce M Johnson"}, {"rating": 5.0, "review": "Great product very responsive and easy to use. The build quality is strong, with plenty of processing power to view movies or stream media.", "verified": true, "helpfulness": "0/0", "author": "Jeff Dean"}, {"rating": 4.0, "review": "Purchased this for its Spotify Connect function only and for the most part it works well. Using it without a TV connected was however a source of difficulty. It appears that the unit will not work without a TV connected for whatever reason. The solution was to find a HDMI converter box that would fool it into thinking a TV was connected. This is of no concern to most users but if you want it for for a stand-alone Spotify connect interface to your audio system just be aware.", "verified": true, "helpfulness": "1/1", "author": "Bob"}]