[{"rating": 3.0, "review": "Like the title says....does what it says when streaming Netflix from IOS devices.  Completely unwatchable when casting from the chrome web browser.  Tried this with ESPN3, which is AWFUL and even something simply like desktop mirror, which was laggy at best", "verified": true, "helpfulness": "0/0", "author": "Matt B."}, {"rating": 5.0, "review": "Not really sure how it works, he seems happy with it.  Good gift for a techie gadget freak.  Good value.", "verified": true, "helpfulness": "0/1", "author": "Larry Jenkins"}, {"rating": 4.0, "review": "Once more apps allow you to cast, it will be absolutely amazing.  The potential is unreal. This is too cheap to pass up.", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 5.0, "review": "The Chromecast works great for what it is.It's a way to easily and wirelessly get what's on your PC browser or Android Phone/Tablet to the big TV screen.It really doesn't do anything more than that.  But for the cheap price, it doesn't need too.  It's always worked really well for me.It's come in very handy while the wife and I are house shopping.  I can use the laptop and look at house while she looks at what I have on my screen on the TV.", "verified": true, "helpfulness": "0/0", "author": "captainstormy"}, {"rating": 1.0, "review": "I purchased the chromecast first than signing up for Amazon prime, couldn't get it to work. After reading the reviews afterwood finding most chomecastt was incompatible unless your a computer technician. Sent it back and replace with Roku, no problem now. Still waiting for reimbursement to my Amazon account that over 30 days. There must be a business conflict between, Comcast chrome and Amazon.", "verified": true, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 5.0, "review": "So glad this works as expected!  We love it!  So convenient not to have to watch everything from one tv.", "verified": true, "helpfulness": "0/0", "author": "CoachB"}, {"rating": 5.0, "review": "The best purchase I ever made better than netflix cause it plays more than Netflix you can even steam your own media", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "It is amaizing,just what I expected! I can watch my favorites programs and movies from my apps to my tv instantly.", "verified": true, "helpfulness": "0/0", "author": "Ukiay"}, {"rating": 5.0, "review": "To make my TV a smart TV and it works great. The item came in a short period of time and I am very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Don Kresker"}, {"rating": 5.0, "review": "The Chromecast is easy to set up and delivers amazing results. Such a seamless way to view internet, netflix, photos whatever you can access on your phone, tablet or laptop can be viewed on your TV ! What's not tolive?!", "verified": true, "helpfulness": "0/0", "author": "Denise Mary Sunshine"}]