[{"rating": 3.0, "review": "I had reset the device twice already in this little time, and also another new one, still could not get it to work, router is within a feet from the TV.", "verified": true, "helpfulness": "0/0", "author": "MOHAMMAD HASSAN"}, {"rating": 2.0, "review": "This is a tough product to review well.  Just out of the box, plugged in upstairs in my game room, it struggled MIGHTILY to load even the YouTube App in its entirety.I'm not sure if it's internet connection, network issues, or just a poorly designed product, but when it loads YouTube after I've synced to broadcast from the app on my phone, it takes literally 3-4 minutes to load the app on Chromecast.  The loading screen picture even comes in in pieces like with a 56K modem connection.  Constant freezing of YouTube videos, and low quality most of the time.  This is all on a business class Cable connection and network.I couldn't even CONNECT to Netflix!  The message I got continuously was \"Hmmm....we can't seem to connect to Netflix\" - and then the app would go into a 10 second countdown on the screen before it finally booted me out of Netflix.  This happened 5-6 times.  Ultimately in the end, my frustration got the best of my, and I just went ahead and put the good old television back on because watching choppy videos that constantly stop, or not even being able to LOAD a video onto my television was just too disappointing.My devices flourish on my WiFi connection, at top speeds, but it seems that the Chromecast just can't keep up with the speed that I expected.  It's very slow, very unresponsive, and doesn't even come close to what my old Roku HD from 2012 can do - in terms of fluidity, speed, and usability.  The Chromecast is a great idea, but user experience will definitely vary, as I was extremely unsatisfied and disappointed with my purchase.  i see many reviews of people that are quite happy with Chromecast (which is why I purchased it in the first place), but for me, I couldn't even get the device to establish a solid Sync, let alone utilize the apps - a total and complete failure.  This will be a return for me unfortunately - I hate that the best part of my Chromecast experience was the beautiful screensaver photos it put on my TV screen when it was idle.Purchased from Amazon, used on Panasonic 720P Plasma HDMI port - powered with wall adapter.  Control device is new Nexus 5 running 4.4.2.", "verified": true, "helpfulness": "1/2", "author": "Medium Tex \"Alan\""}, {"rating": 5.0, "review": "Love the product but did take some research on getting it to work, plus had to mess with it many times until Chromecast finally downloaded an update, then it worked perfectly.  Had to research the difference using on android and windows and not to use mirrowing (tab) while using Netflix (not compatible with Silverlight using tab (Chrome app).  Research on how it works before trying to use.", "verified": true, "helpfulness": "1/1", "author": "MissouriTechGrannie"}, {"rating": 5.0, "review": "I use this way more often than the Apple TV. Thinking of buying a few more as Christmas gifts! Love it.", "verified": true, "helpfulness": "0/0", "author": "J. Nguyen"}, {"rating": 4.0, "review": "I would have given the Chromecast 5 stars but I don't feel like there are enough apps that work with it yet. Or enough devices that the app to use it can be installed on. I wish it was easier to use without having to go into the app and THEN clicking on Netflix. If you don't do that and just go straight to the Netflix app, the chromcast option isn't available to use. As of the moment, it only works with Youtube and Netflix on my iPhone. I was under the impression I could use the HBOGo and Showtime Anywhere apps, but there is no casting option!", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "I am not going to list the things that Chromecast doesn't do, but simply state that its really handy for casting Netflix and YouTube from your smart phone or iPad.Sure you can plug your computer into an HDMI jack instead, but for $35 Chromecast is tidier and pretty slick.", "verified": true, "helpfulness": "1/1", "author": "Dahlia \"D\""}, {"rating": 3.0, "review": "Could not use my Windows 8 laptop to install, had to use my Android phone.  After installation, I can \"cast\" Chrome tabs from the Windows 8 laptop, but quite often the audio is not in sync with the video.  The Netflix and Pandora Chomecast apps work well on my Android phone and Android tablet.  Hopefully, there will be additional apps coming, perhaps firmware upgrades, etc.  For me, it's worth the price paid, but I can't give it more than 3 stars - yet.", "verified": true, "helpfulness": "0/0", "author": "DJ O'Bourke \"DJ\""}, {"rating": 5.0, "review": "Everything google promises with this product is accomplished.Also the chromecast apps are growing.I am very happy with this product.", "verified": true, "helpfulness": "1/1", "author": "juanesra2"}, {"rating": 3.0, "review": "So I keep hearing how Google is working with other vendors to enable their apps to work with Chromecast, but it sure does seem to be taking a long time! It works very well with Chrome and Youtube", "verified": true, "helpfulness": "0/0", "author": "SweetwaterFox \"sweetwater fox\""}, {"rating": 4.0, "review": "We use this for a smaller TV we have in the bedroom. Set up was fast and straightforward. It works great with Youtube or Netflix and fills a void b/c it's not a \"smart\" TV. Streaming is clear with no lag or buffering. I was hoping the beta casting through Chrome browser would be equally as good. Unfortunately the buffering and audio video lags make video unwatchable through the casting feature in the Chrome browser. Hopefully this can be improved. For $30-$35 this is still a good value.", "verified": true, "helpfulness": "0/0", "author": "J. Scott"}]