[{"rating": 5.0, "review": "Getting rid of my apple TVs.. Chromecast does it all and more,, much faster", "verified": false, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "google chrome cast is one the finest devices i have found..", "verified": true, "helpfulness": "0/0", "author": "RAJESH SINGH THAKUR"}, {"rating": 2.0, "review": "This works fine to see YouTubes so I know it works. But it's not clear until you do the setup that functionality is very limited. Supposed to be controlled from the smartphone and connect to the 'net. But I can't \"cast\" Amazon Prime movies (why i got it) or show any Web page from my (Google-owned!) Droid Maxx with (Google-created!) Android. In other words, before buying check carefully that the devices and programs you want to use it with are compatible.", "verified": true, "helpfulness": "0/0", "author": "Susan B"}, {"rating": 5.0, "review": "Great stuff from Google again! Works very well, and is fairly easy to set up.Got this for my parents and they love it. It saves having to get an HDMI cable run from the computer to the TV.You can run everything your web browser on to this.The down side is that it doesn't play DVD's or video files off of your computer. Yet.", "verified": true, "helpfulness": "0/0", "author": "EzE"}, {"rating": 5.0, "review": "Works as advertised and really enjoying it on various systems.  Would highly recommend it to anyone.  Easy to install with no problems whatsoever.  Highly satisified.", "verified": true, "helpfulness": "0/0", "author": "Computer Doctor"}, {"rating": 3.0, "review": "Doesn't connect easily. Disappointed", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works as described.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "Works perfect. Great for watching Netflix on TV", "verified": true, "helpfulness": "0/0", "author": "L. Jones"}, {"rating": 3.0, "review": "These \"work\" but the i pads and phones struggle to communicate with the chrome cast sometimes and end up frustrating me! However when it is working smoothly, its awesome.", "verified": true, "helpfulness": "0/0", "author": "KERI GONZALEZ"}, {"rating": 5.0, "review": "love it. easy set up in 5 min and start to cast from my iPad. The app like netflix from ipad is much faster than launched from the smart tv.", "verified": true, "helpfulness": "0/0", "author": "Z. Xue \"tony\""}]