[{"rating": 4.0, "review": "Its an awesome devise. Works perfectly with phone. But i am not able to handle it from laptop i.e. through chrome browser", "verified": true, "helpfulness": "0/0", "author": "santhosh"}, {"rating": 4.0, "review": "It works fine as a streaming interphase with my LG Nexus 5 smartphone and also with an iPad 4. I'd like it better if it had embedded apps to stream movies such as HBO and stuff like that so I don't need to rely on a 2nd device to make it work.", "verified": false, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "This is my first of many chromecasts. This is a wonderful invention, works perfectly and there are so many apps for it. So easy to set up and boots up so fast.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Inzano"}, {"rating": 1.0, "review": "This doesn't work with My Samsung Series 7 TV.  The USB connection interrupts with the other sources and any other HDMI connection is lost.  It also doesn't work with older tablets very well.  You need to have a tablet with 4.2 or better.  Apple IOS is also a little off.  It did work seamlessly with my Samsung S5 though.  If it weren't for the TV issue, I would love the product.  For now though it's sitting in a box collecting dust.", "verified": true, "helpfulness": "0/0", "author": "Scott Longazel"}, {"rating": 4.0, "review": "Four stars, only because when cable company changed my router I had a dickens of a time figuring how to get Chrome to recognize the new router and password.  Went online and got some tips and actually was able to rectify problem....it took awhile and the answer to my problem was trial and error.", "verified": true, "helpfulness": "0/0", "author": "tkit"}, {"rating": 5.0, "review": "It was an awesome gift.  I played with it some too, very very nifty!", "verified": true, "helpfulness": "0/0", "author": "Edward Lynn"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Dave"}, {"rating": 5.0, "review": "Love it!! was an awesome price too!!! Works great.", "verified": true, "helpfulness": "0/0", "author": "Spain Family"}, {"rating": 5.0, "review": "I love this thing.  Works well with Hulu (which any Roku user knows can be troublesome...)  I just wish Amazon would get on board and let us Chromecast Amazon videos.  Then I can finally toss my old Roku...", "verified": true, "helpfulness": "0/0", "author": "T. Hanson"}, {"rating": 5.0, "review": "best of the best only amazon fire can maybe compete with it hopefully google chromecast gets amazon on there too.", "verified": true, "helpfulness": "0/0", "author": "Ruben"}]