[{"rating": 4.0, "review": "Works fine for what I needed.  Limited due to needing apps.", "verified": true, "helpfulness": "0/0", "author": "Robert Bailey"}, {"rating": 4.0, "review": "This is a great way to stream content from your phone, computer or tablet to your TV. I use mine on a regular basis, that being said, I sometimes have problems with it connecting to the wifi. I don't think it is on my end as my other devices will connect to the internet, but overall it works great!", "verified": true, "helpfulness": "0/0", "author": "Bryant Taylor"}, {"rating": 3.0, "review": "It does exactly what it says, but I don't care for the interface or software.  Lags a lot and constantly loses connectivity even when the connected device is within a couple feet of the receiver.", "verified": true, "helpfulness": "0/0", "author": "ehill2233"}, {"rating": 3.0, "review": "Surprisingly not that happy with Chromecast. Too many issues:- Overheating. This one surprised me A LOT. After watching video for a while the device will get hot to the touch and the audio will start cutting out. Nothing to do but let it cool down for a while. My TV does not get hot and the Chromecast sticks out perpendicular to the TV. The TV is not against the wall--it's probably about 3 feet from it. Bad passive cooling.- General issues with the youtube software. You're supposed to be able to have multiple people connected and they can add videos to the queue. In my experience, when you want to add a video to the queue and you're not already connected, connecting will force the last video played on your device to cast to the screen. Every time. This has been very frustrating. Youtube should allow you to JOIN a running TV Queue without forcing your video to play instantly. If there is a specific method for this, do let me know.- No 4K playback- Screensaver constantly triggers my TV to switch to the Chromecast input automatically (when no other signals). This is good and bad depending on what I'm trying to use. Can I disable the Chromecast screensaver?I give it 3 stars because of the overheating issue alone and I think that's fair. Software can improve over time. It has a home in my living room until a better Chromecast comes out, then it's going into the garage.", "verified": true, "helpfulness": "0/0", "author": "Max"}, {"rating": 5.0, "review": "I am a bit technologically challenged, but my grandchildren love this. If they say it is great, then I guess it truly isl", "verified": true, "helpfulness": "0/0", "author": "Junepat \"June Patterson\""}, {"rating": 1.0, "review": "Sound works intermittently, hard to connect, just buggy compared to roku box.  Worst, it's a product of a company that also sells content and other services, so things are geared towards getting the consumer to use them rather than giving the consumer the best experience.  As an example, you can't stream local content from google play music to the chromecast.  it's technologically possible, and you can do it with other software to a roku box. but with the chromecast, you have to put your music on the cloud, where incidentally they can mine and sell your data, or use their streaming service.", "verified": true, "helpfulness": "0/1", "author": "ShoreDame"}, {"rating": 4.0, "review": "Works well but it is pretty annoying to use your phone to control apps. I would go with the Fire Stick now instead.", "verified": true, "helpfulness": "0/0", "author": "TwinDad"}, {"rating": 5.0, "review": "Easy to use.  Use it everyday at work on lunch break.  Awesome to watch movie and other stuff on a tv screen versus a cell phone screen.", "verified": true, "helpfulness": "0/0", "author": "John D'Addona"}, {"rating": 4.0, "review": "This is a fairly nice device, but it hasn't quite grown to be as useful as I had hoped it would be.I think partly its google's fault for not doing more, but also because a bunch of the other major guys decided to make their own instead of just adopting a standard.In general, this would be a MUCH more useful device if it would have been a pass-through switch instead of a separate device.If you could just start it, or maybe even have it do its own picture in picture, I think it would have been a much more used device.  As is, I usually forget I have it.A bonus though:  the deals you can get through it has made it a pretty good deal, even if it didn't get as much use as I had hoped.", "verified": true, "helpfulness": "0/0", "author": "Chris H"}, {"rating": 5.0, "review": "So easy to install. Go to YouTube for a quick video. Great product and affordable. Thanks Google!", "verified": true, "helpfulness": "0/0", "author": "The Gamecock"}]