[{"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "jenny luz martin"}, {"rating": 5.0, "review": "Item arrived on time and is as pictured and described.  It was easy to install and provides us with other watching options.  Have installed additional apps very easy since the original purchase. We are happy with the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jeane"}, {"rating": 4.0, "review": "I chose this over Roku. It's replacing a Roku. I find it to be very responsive and, yes, it's HD, great quality for sure. I mainly use it for NetFlix but Youtube and Vudu seem to be good options as well. The only thing that I found strange and odd to get used to is not having a remote control leaving everything to be done with your phone.There seem to be a handful of apps for casting. However. I'm still trying figure that out and which would be best for me. I have a NAS (Network Attached Storage) that I use mainly for streaming. I moved my DVD files to the NAS. but because I decided not to convert them to MP4 or AVI, they are still .VOB. I have yet to find a 'cast' app that supports .VOB files. only a player that will let me play them on my phone. So, the search for that continues.For the price the Chromecast goes for, it's well worth the money even if to just try it out and resell it on Craigslist some months down the road. I'm keeping it. Though there are only a few apps that I use on it, I am exited to really start digging into this thing.", "verified": true, "helpfulness": "0/0", "author": "FuDogDad"}, {"rating": 5.0, "review": "The only thing I don't like is that some sites are not compatible when playing videos in full screen mode. Otherwise, it's great and super easy to use!", "verified": false, "helpfulness": "0/0", "author": "Meg"}, {"rating": 4.0, "review": "So far so good.  Does what it claims to.  Wish we could stream anything from the internet, but we mostly watch Youtube and Netflix with this.  My boys sometimes listen to Pandora with it.  I'm sure one day this will look quite prehistoric.  Only 4 stars because it's limited on what it will stream.UPDATE: When our router went out and we had to replace it, we could not get Chromecast to hook up with the new router.  Doing more research indicates too many problems for me to try to solve.  The new router was on the list of those compatible, but it wasn't happening.  Rather than keep trying to replace the router with something that would work, I bought a Roku 3.  Chromecast is a great idea, and was great while it lasted. Perhaps they'll make it more compatible in the future.", "verified": true, "helpfulness": "0/0", "author": "M. Bouwhuis \"barrister\""}, {"rating": 4.0, "review": "I purchased this device because Hulu Plus decided my smart TV (Vizio XVT423SV) was too old to keep supporting. Thus far, and with multiple calls to and from Hulu tech support, I have been unable to make it work with Hulu Plus via any mobile device. I think the problem is my router, but I'm too lazy (cheap) to replace it. ON THE OTHER HAND, the device works FLAWLESSLY with every other app I've tested it with (PLEX, Netflix, YouTube, Casting Tabs, etc.) If you don't have a smart TV, this is definitely worth the price. Included in the box:-1 Chromecast unit-1 Male-Female HDMI extension cable (to resolve an awkward fit)-1 USB power cable (in case your TV's built in USB ports don't supply enough power)-1 AC power adapter with single USB plug (see above)-1 pamphlet of warranty infoSetup is simple and quick. Plug the device into your TV, select the appropriate Input Source, make sure you see the Chromecast screen, then follow the instructions. Any software updates are done automatically and the most complicated thing you may ever have to do with the device itself is hold the reset button if something goes goofy.UPDATE 12/25/2014: Hulu works with my TV! I replaced my ancient router (and I suspect some updates may have helped) but I can see this device is only going to get better as more functional software/apps are developed for it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I don't know how I ever got along without my Chromecast. Perfect, I just hope more apps sign on to be able to cast!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "BEST PRODUCT! It was a little tricky to set up, but once its plugged in and working it is the most convenient product ever.", "verified": true, "helpfulness": "0/0", "author": "mirko akrap"}, {"rating": 3.0, "review": "Wouldn't work in the hotel room because the wifi requires a password.  Had to return because that was the only reason I was buyint it.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "good quality", "verified": true, "helpfulness": "0/0", "author": "Leon Kubis"}]