[{"rating": 4.0, "review": "It is epic. But its needs kindle fire compatibility. Seriously Amazon get off high horse and allow easy access to the google play store without the user having to hack the system.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 4.0, "review": "title says it all. He forgot that his tv didn't have an hdmi port though, so he had to get an adapter. But se la tech.", "verified": true, "helpfulness": "0/0", "author": "Christopher Alan Hekman \"Crystufer\""}, {"rating": 4.0, "review": "Easy to connect tv & all gadgets, laptops.simple to play everything from chrome browser.Nothing to dislike here.Great product", "verified": true, "helpfulness": "0/0", "author": "sreekumar velupula"}, {"rating": 3.0, "review": "I got this thing thinking I could use it to stream movies from my phone or tablet to the tv when I am away from (Motel, Friends Home, Etc.) but Unless I misunderstood something you can only stream on your network. and its limited to only a certain amount of apps that take advantage of it. I could mirror my desktop monitor to my TV but I could not mirror my tablet (Which was the reason for the Chromecast)... Its a good product but its not what I was hoping for..", "verified": true, "helpfulness": "1/2", "author": "Mike"}, {"rating": 5.0, "review": "I have a Logitech Revue box in the Living Room and it requires its own full size keyboard.  The Chromecast allows the same access to anything I pull up in a browser from any pc or tablet already in the room.", "verified": true, "helpfulness": "1/1", "author": "John P. Werner, Jr"}, {"rating": 1.0, "review": "We'll this might be cool if the amazon prime that I have as a free trial is not compatible w chrome cast. This was the official reason I bought chromecasst  What a bust. Wasted money", "verified": true, "helpfulness": "1/3", "author": "Mark twain \"LIFE COACH Vett\""}, {"rating": 4.0, "review": "Lived up to ads. Will be nicer when more apps get developed for it. But it is great for what it does.", "verified": true, "helpfulness": "0/0", "author": "jerry"}, {"rating": 4.0, "review": "This unit is easy to use and has a good connection.  It is as advertised.  Used from our laptop and Nexus.", "verified": true, "helpfulness": "0/0", "author": "Tom Myers"}, {"rating": 2.0, "review": "Is not the thing that I need that I want.Work good but I need to see all my phone or notebook in the tv, not only the things that you can share with the chrome cast.", "verified": true, "helpfulness": "1/2", "author": "Benjamin LagosH."}, {"rating": 5.0, "review": "I love the low prices for movies available for purchase on Google Play store (Korea). Watched a bunch of HD movies for $3 or less. I am going to buy many more HD movies not offered on Netflix in the Google Play store. It's a super deal.", "verified": true, "helpfulness": "0/0", "author": "Seiho Park"}]