[{"rating": 1.0, "review": "I have WiFi provided in my home by my office and they use the Cyberoam device firewall which requires users to log in. This device has no capacity to do that hence I cannot use this at home or in the office.Warning to anyone that uses Cyberoam and I would suspect any similar device.", "verified": true, "helpfulness": "1/3", "author": "Regular Amazon Customer"}, {"rating": 5.0, "review": "it is straight forward to install and has a really good pic quality, sometimes it is not the fastest response but acceptable", "verified": true, "helpfulness": "0/0", "author": "Kovacs Zoltan Attila"}, {"rating": 5.0, "review": "Great product to own. Great image but a bit slow on live browsing, even with high speed connectivity. this is the way to go if you don't want to spent too much money on a new \"smart TV\".", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 5.0, "review": "I purchased this device a few weeks ago and it's great! I can use YouTube to watch my own video clips or any other clip I want to see on YouTube. On my PC I can view my browser pages when using Google Chrome (this does not work with any other browser), and when using this for the Internet (using Google Chrome) I can view videos, photos, etc. Google has recently added HBO GO to its service, so if you have a device (smartphone, tablet, etc) and have an HBO GO app you can watch movies on your TV using Google ChromeCast. I don't subscribe to Netflix myself,l but that's another service you can use with this device. Currently there are several applications that can be used with Google ChromeCast and from what I've read, Google is working on adding more and more services. Just do a Google search for ChromeCast and you will find a list of all services that can currently be used with ChromeCast. This device is definitely worth the low cost.", "verified": true, "helpfulness": "0/0", "author": "Maureen Lynn \"Hummingbirds by Maureen\""}, {"rating": 5.0, "review": "Lets be realistic - any product like this is going to have its limitations and this one does. However, for what it does and the price point this is one heck of a product.  Works as advertised - maybe a little quirky and definitely an engineered by Google for a Google world product.  Simple to use.", "verified": true, "helpfulness": "0/0", "author": "yellowpixels"}, {"rating": 5.0, "review": "Works really well. Makes our tv a smart tv. We can stream netflix ; youtube from our phones or laptops !  Great product .", "verified": true, "helpfulness": "0/0", "author": "R. Ortiz"}, {"rating": 1.0, "review": "NOT plug and play.  All setup steps work until network password is input and then it fails.  The password is correct.  The Google website indicates I should check with Linksys.  Apparently, I need to find the exact settings in the router so it will work.  Every other device I ever connected to this router just works.", "verified": false, "helpfulness": "2/3", "author": "Karen Dowling"}, {"rating": 4.0, "review": "When it works, it's phenomenal, but it has a habit of randomly cutting out which is frustrating. Screw Flanders. Screw Flanders.", "verified": true, "helpfulness": "0/0", "author": "Lilycameron1"}, {"rating": 4.0, "review": "It is worth the price. Got a tablet for Christmas, should have read all of the specs on this. Can only use a few apps with this. Was thinking that I could see everything that I do on my tablet on the TV.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Roku or Google Chrome?  $99 vs $39?  Easily for the price and performance differences Chromcast is the winner.  Got it stuck it into the USB socket in the TV, pair it with your device and you are in business. Anything that you can stream on your device can be streamed to your TV with the same quality.  If the original video is HD, it will play HD on your TV.  Simple, works great.", "verified": true, "helpfulness": "0/0", "author": "Szoo2"}]