[{"rating": 3.0, "review": "It won't work on my land line phone and it keeps losing WiFi signal.", "verified": true, "helpfulness": "0/1", "author": "Jim Byers"}, {"rating": 5.0, "review": "Nice! Now I can watch the programs at my leisure!", "verified": true, "helpfulness": "0/0", "author": "Kenneth"}, {"rating": 3.0, "review": "nice product.  Apple TV is not the only one.", "verified": true, "helpfulness": "0/1", "author": "Leonardo Peterssen"}, {"rating": 5.0, "review": "I'm in love with Amazon Fire TV!! Set up was a breeze (less than 5 minutes) and the voice activated search works extremely well. As an Amazon Prime member, the access to free streaming of over 10,000 movies and TV episodes (like Downton Abbey and many HBO series) is impressive. I was able to access all 4 seasons of Dowton Abbey for free!!.....and that savings more than covered the cost of the Amazon Fire TV unit! I highly recommend Amazon Fire TV to all my friends and family :-)", "verified": true, "helpfulness": "0/0", "author": "TeeTee"}, {"rating": 5.0, "review": "i use this thing all the time just get it you wont be disappointed", "verified": true, "helpfulness": "0/0", "author": "Andrew Dominguez"}, {"rating": 2.0, "review": "Skips and jumps in loading programs.  Voice search is a sham which only finds programs you have to pay for.  Does not perform as promised.On the other hand, I really liked the box and packaging.  If only the product was as nice as the box.  Back to the drawing board Amazon.", "verified": true, "helpfulness": "0/1", "author": "JOHN S LAYMAN \"John L\""}, {"rating": 5.0, "review": "Love it. Easy to hook up. Works great as long as my internet stays working. Haven't tried voice control yet.", "verified": true, "helpfulness": "0/0", "author": "Dolores E."}, {"rating": 2.0, "review": "Amazon really needs to play catch up on the variety of channels (apps) available when compared to Roku. Have also noticed that movies that I can watch on Netflix through Roku are not available with Amazon Fire TV. The voice search feature is nice and seems to be pretty accurate. I was hoping the Amazon Fire TV would be at least comparable to Roku 3, and one day it might, but I'm thinking about going back to Roku at this point.", "verified": true, "helpfulness": "0/0", "author": "dodger51 \"dodger51\""}, {"rating": 3.0, "review": "It works great. I give it three stars as I have had a hard time registering my netflix account for a complete setup.Love the avaliablility of all the programs without having to use the xbox all the time.", "verified": true, "helpfulness": "0/0", "author": "Kimberly A. Moore"}, {"rating": 5.0, "review": "Wow.  Intuitive and easy to access your Netflix, Pandora, etc.  And cheap!", "verified": true, "helpfulness": "0/0", "author": "Lynn"}]