[{"rating": 5.0, "review": "A great device!  Well worth the $35!", "verified": true, "helpfulness": "0/0", "author": "Kent Montgomery"}, {"rating": 2.0, "review": "I was extremely excited to pick this product up having seen it in action with a few of my friends and colleagues.  For the first several days it was brilliant.  Very easy to set up and it was great to be able to broadcast to the TV from several different devices.After the novelty wore off, several inconveniences started to become more of a nuisance.  The most important is that you have to control the playback from another device (laptop, phone, tablet).  So you can't set that device aside once you've begun broadcasting or else it's difficult to pause, stop, etc.  This was expected and really brings it back only one star at most.The real reason I'm disappointed is that the connectivity is sketchy at best.  Typically kicking off from PLEX, HBO GO, or Netflix there is some buffering, freezing, etc.  After it seems to catch up, then I would have problems with the Chromecast simply disconnecting from the network.  The device I started the media from would not see the Chromecast any longer and then after a minute or two, it would show up on the network again.  Laptops, phones, and tablets don't have the same problem and even after turning the quality down to 480, the same problems exist.  I can stream content to my computer, wirelessly in 1080p without skipping a beat.  So it's not the network, not the content, it all comes back to the Chromecast.To further investigate, I unplugged the Chromecast and noticed that it was very hot.  After unplugging it and giving it a chance to cool down, it seemed to be more reliable.  In either case, it's not the reliable \"plug and forget\" device I was hoping it would be.  Next stop, Roku 3.", "verified": true, "helpfulness": "0/0", "author": "Kevin Allen Lee"}, {"rating": 2.0, "review": "Spend the extra $60 and buy the appleTV. AppleTV is more simple to use and streams faster with higher quality. As long as you have an iphone/iPad/iMac, you will be able to do AirPlay/screen mirroring so you can stream whatever is on your phone to the TV. Unlike the Apple TV I was not able to easily stream games on BTN2GO app or the NBC sports live extra", "verified": false, "helpfulness": "0/0", "author": "Michael William Berres"}, {"rating": 3.0, "review": "I bought this after buying a roku and was disappointed.  There is just no comparison.  I think it is better to pay a few more dollars and buy a roku, especially since you can get a roku 2 for around $50, only $15 more than this.", "verified": true, "helpfulness": "0/0", "author": "TrixyEE"}, {"rating": 5.0, "review": "I love this item!  Thinking of giving up cable all together to save money!!  Thanks Amazon and Google!!!", "verified": true, "helpfulness": "0/0", "author": "Terri L Miller"}, {"rating": 5.0, "review": "Chromecast is pretty much the best thing ever for the price.  Seeing as I always have a phone or laptop near me it doesn't bother me that this device isn't operable without either of those two things.  For $35 I can turn any TV into a SmartTV and Netflix away!  I wouldn't recommend this for people who have a hard time working a cell phone, but if you can work that you can run this.", "verified": true, "helpfulness": "0/0", "author": "SirGabo"}, {"rating": 5.0, "review": "One of the best $30 spent ever.", "verified": true, "helpfulness": "0/0", "author": "Rafael"}, {"rating": 5.0, "review": "Unexpensive way to have any watch youtube, Netflix, and hulu on your TV", "verified": true, "helpfulness": "0/0", "author": "Mauricio Alatorre"}, {"rating": 5.0, "review": "love it. Knew i would. It works great. My only thing that is not quite as nice is that there needs to be more apps with chromecast support. that will come in time", "verified": true, "helpfulness": "0/0", "author": "Kelvin Smith"}, {"rating": 5.0, "review": "Bought these for my kids and they love them! Way better than spending $100 per kid on Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Lafe"}]