[{"rating": 1.0, "review": "I received this item yesterday and it is going back today. Should have read the reviews closer, I would have found that if you use Comcast as your cable provider HBO Go will not work with Fire TV, at this time.", "verified": true, "helpfulness": "4/8", "author": "Big Jake"}, {"rating": 5.0, "review": "How does the stick differ from the fire TV is simple.  The Fire TV is a beast in a little box and not bad as a cable box replacement.  The Fire TV is much faster and powerful enough that it can locate a broader range of  wireless connections than the stick for example you can be a few floors down and still get good connectivity.  The Fire TV actually comes with more in reference to software you can download than the Fire TV stick.  I wasn't aware that the unit was also a gaming system with the separate controller.  Also remember that they TV has more downloaded content than the stick. The remote control is voice activated which is cool.  Voice activation really works best with amazon prime account so you can call an actors name and get all the films he stared in.  For other features as Netflix, you can only ask for Netflix to bring the app up.  It's definitely worth the money in reference to the range of the device.  Also going to need to buy a separate HDMI cable so keep that in mind.", "verified": true, "helpfulness": "3/3", "author": "Gift Card \"New Godzilla\""}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 3.0, "review": "It's great aside from the, \"HEY HAVE YOU LOOKED AT THIS AMAZON GARBAGE?!?!\" Banner ads at the top of the page...and cluttered throughout the other video offerings.  Also the on screen keyboard is in abc layout and not qwerty.  Mildly infuriating to type on.", "verified": true, "helpfulness": "0/0", "author": "Kamokazi"}, {"rating": 4.0, "review": "Very nice little box! Even without root, I'm able to use it fully with emulators, Kodi and the like. To make it perfect, Amazon only needs to allow for USB external storage to be installed.", "verified": true, "helpfulness": "0/0", "author": "João Deiró \"JLD-RJ\""}, {"rating": 5.0, "review": "I am very pleased with the fire TV. I personally think it is the way to go--preferable to the fire stick. I got it at a good price .", "verified": true, "helpfulness": "0/0", "author": "William Hipkiss"}, {"rating": 5.0, "review": "I am in love with my Amazon Fire TV! All of the reviews about the set up being super easy were 100% true!", "verified": true, "helpfulness": "0/0", "author": "kckarla \"kckarla\""}, {"rating": 5.0, "review": "Easy set up only took a couple of minutes. Quick tutorial was helpful to get started. Everything streams great no buffering great image and sound. Very pleased with it overall and would recommend it highly.", "verified": true, "helpfulness": "0/0", "author": "W. J. Millard \"lakeman\""}, {"rating": 4.0, "review": "every one should  buy one of these lots of fun watching all the shows great little box", "verified": true, "helpfulness": "0/0", "author": "John B."}, {"rating": 5.0, "review": "Exceptional value!", "verified": true, "helpfulness": "0/0", "author": "richard Learn"}]