[{"rating": 1.0, "review": "When I got this, I could play my home movies and such. Now, Google has done something and I cannot do it anymore!! I guess I will have to return the Google Cast units I bought for me and for xmas and return them. Buy Apple TV instead as they do not limit playing your home movies. REALLY SUCKS!!!!!!!!!", "verified": true, "helpfulness": "1/6", "author": "Ranger"}, {"rating": 5.0, "review": "I have tested this product now on several networks with several TVs, streaming from several services from my Galaxy S3, Galaxy Tab, and Windows 8 desktop over Chrome. With the latter I easily casted Netflix, Amazon Prime Video, Hulu free, and MLB.tv in fullscreen HD. For $35, there is nothing better out there. It won't replace my full on HTPC, but it wasn't designed to. It was invaluable when I took it to a cabin in the mountains last weekend. Great little gadget.", "verified": false, "helpfulness": "0/0", "author": "Seth Andrew Martin"}, {"rating": 5.0, "review": "The Chromecast is perfect for a second TV where full cable not needed. Will only get better as more services are included.", "verified": true, "helpfulness": "1/1", "author": "Jeff McCormick"}, {"rating": 2.0, "review": "Google has locked it down so tight at the moment that it just isn't very useful.  Google really wants one to use things like Netflix or Youtube and then stream/cast them not from your tablet or laptop but directly from the internet.  That is ok.  They took away the ability to use sideloaded music (ie music not on google's system or from their store) and took away the ability to cast/stream video from your laptop to the chrome device.  I have Netflix on my devices, I really got Chromecast because it was cheap and for the ability to cast music and video to my television.  Really disappointed, though there is a work around.  If you use the Chrome browser, you can get the google cast extension and simply drag your media to a tap on Google Chrome and hit Cast.  Ok for long local video/movies, not so good as I haven't figured out how to do a play list for music (ie one song at a time is all I can cast).  Also, if you think you can Cast Hulu or Redbox...that won't happen using the work around...google disables casting of stuff that has silverlight and of course there is no Chromecast apps for these and most other services.  Ultimately, it could be a neat thing if Google decides to unlock its potential and/or more apps come out.  Now, it is only 30 bucks but unless you lack the ability to get Netflix any other way or you are a huge user of the Google store for Google Music or Video...I might wait a bit.  The fact I can't cast my itunes or amazon content just turned into a bit of a downer for me.  In addition to no hulu, redbox and other types of movie support.UPDATE - Using google play if I delete all the songs off of my Kindle from the amazon store and then upload them to google play (their cloud) I can then cast them without a problem.  Failing to delete them I get an error (can't play side loaded content).  It kind of stinks that I have to erase the songs from the device for amazon to do this, can't help but think google did this on purpose.Also, someone commented about uninstalling Silverlight.  I will definitely give that a try and see if Hulu and maybe redbox will then cast using flash as opposed to Silverlight.  I would much prefer Hulu and Redbox simply have a cast icon like Netflix and I have heard rumors that this might be coming.  The device really has a lot of potential though I feel like I am being pushed more to the google store and away from the Amazon kindle type store in order to use it.", "verified": true, "helpfulness": "1/2", "author": "James D Yowell Jr."}, {"rating": 5.0, "review": "Great product.  WE use it to get Netflix on a non-smart TV in our bedroom.  Casting movies from other streaming sites is ok, yet from what little testing I've done the quality has been bad.  Yet I don't care because I spent $35 to get Netflix on our bedroom TV....", "verified": true, "helpfulness": "0/0", "author": "Mr Litz"}, {"rating": 4.0, "review": "I'm fairly surprised at all of the gushing reviews.  I mean, I like it, but it's very limited in what it can do.  You can stream YouTube and Netflix and Google Play and sometimes videos from your browser (if they don't use Silverlight) but it's not a \"screen mirroring\" type functionality that can just cast whatever is on your screen to your TV.  You can't stream a powerpoint presentation or hook it up to Hulu.So basically it's a Roku that costs less and does less.BUT...it's portable.  It fits in your pocket.  It fits in your change pocket, even.  It's not much bigger than a bluetooth earpiece.  I like it because I can stick it in my pocket, go to work and plug it into the TV so we can all watch some YouTube videos or something on Netflix while we eat lunch.  I imagine if I took it with me on a trip it would be an easy way to get my Netflix account streaming on the hotel TV (if they have open HDMI ports anyway).Setup is very easy.  You just need a good wifi connection that can be shared with your casting device (your phone or your laptop, etc) and start the app and follow the steps.It works great; it does what it says it does; it's cheap; it's portable; but it doesn't do as much as you're probably hoping.", "verified": true, "helpfulness": "0/0", "author": "Pecos Bill"}, {"rating": 4.0, "review": "It took forever to get it on back order.  It does what it says.  It would be five stars if I could cast local media from my tablet chrome browser & I could get more apps.  I specifically wish there was an AMAZON PRIME app.", "verified": true, "helpfulness": "0/0", "author": "William Lickel"}, {"rating": 5.0, "review": "What a great value. Streaming Netflix, YouTube, Google Play Movies, Music, etc. Even Chromecasting tabs within Chrome browser on a Mac/PC. I LOVE THIS THING.", "verified": true, "helpfulness": "0/0", "author": "derek duncan"}, {"rating": 5.0, "review": "I wanted to upgrade from the USB WIFI setup that came with my TV. It was useless to me, couldn't go 10 minutes without a interruption. Chomecast was easy to setup, and works great with my Nexus 7 tablet. The picture quality is real nice, Leave it to Beaver never looked so good!!!! For $35.00 you cannot beat it. I got mine at @#@& Buy for that price. Some stores have it in stock.", "verified": false, "helpfulness": "0/0", "author": "Timothy J Smith"}, {"rating": 4.0, "review": "can only stream youtube and netflex using iOS device and chrome brower from PCit is a good device, but need app to broaden the application.", "verified": true, "helpfulness": "0/0", "author": "Ming Liu"}]