[{"rating": 5.0, "review": "I'll start with my one complaint (and it's a big one for me):  The remote.All other things being equal, the remote is really cool.  It works well, has good range, has good functionality, and it even has a mic for voice controls.  That's great if all other things really are equal, but they never are.  In my case, I have a universal remote that I'm very happy with and I would prefer not to add another remote to our environment.  Sadly though, the Fire TV remote uses Bluetooth technology (which is great if the Fire is your only peripheral device).  The Bluetooth works just fine for the Fire TV, but there's no way to use a universal IR remote to control the Fire.  My wife hates this.With that out of the way, let me tell you how much I love this box.  We have an Xbox downstairs that we use for consuming so many \"alternative\" (non-cable or non-satellite) programming streams.  We use it for Amazon Prime Videos, Netflix, and Hulu.  We probably consume about 40-50% of our programming via streaming apps on the Xbox.  Upstairs we have a Blu-ray player that also has a Netflix app.  This has caused some frustration for my dear wife who wants to start a program downstairs and then finish it upstairs in bed.  \"Sorry dear, we don't get Amazon or Hulu upstairs.\"  So this Fire TV box is the perfect solution.We also don't use the Netflix app on the Blu-ray player that much because it takes forever to launch the app.  You have to turn on the Blu-ray, wait for it to boot up, select the Netflix app, wait for it to load, wait for it to process the library, and on and on and on.  The Netflix app on the Blu-ray is generally more trouble than it's worth.  Not so for the Fire TV though.  The Fire TV is really snappy and we hardly have to wait for anything to launch.I love the fact that it has a small form factor and sits unobtrusively on the mantel behind a fake plant instead of adding another device to the stack of entertainment equipment.  I love the fact that although it is very integrated with my Amazon account, it is also agnostic enough to play nicely with other services.  And since these are all software apps, they can be easily changed and upgraded over time.  This is so much simpler than the nagging firmware upgrades on my so-called \"smart\" Blu-ray player.  I also have an Apple TV that we rarely ever used because it was so tightly coupled with iTunes.I don't have wired Ethernet in my bedroom upstairs.  It wouldn't be impossible to run the cabling up there, but it would require running conduit on the wall outside and then a trip into the attic to finish the drop.  So my first choice was to give it a try via Wi-Fi.  I expected it to be OK, but not great.  Wrong.  Streaming to this Fire TV via Wi-Fi has been just fine.  We haven't had any trouble with the connection unless someone else is streaming a program in another room.Bottom line:  I don't like the fact that I can't control this device with the same universal remote that controls the rest of my system, but I'll get over it.  Other than that, this player does everything I need it to do.  My wife is happy that we can watch our Amazon Prime Videos, Netflix, and Hulu.  Well done, Amazon.", "verified": true, "helpfulness": "6/6", "author": "Dave Edmiston"}, {"rating": 5.0, "review": "I own a lot of gadgets and I like them all for different reasons,  Apple TV has a nice simple interface, GoogleTV is rough around the edges but the amount of options and flexibility it gives me trumps most others, Roku with it's ton of choices.  I've found it hard to completely break free of any one of those devices until the FireTV came along.  It's tiny, it's blisteringly fast, it's smooth, easy to use and has all of the apps I use (hoping to see more appstore apps make their way to this such as Avia in the future to round it out to perfection).Everything about it is smooth and flawless,  I've managed to sideload a few things to fill in anything needs that were lacking (but the authors of those apps said they have already submitted them to Amazon for approval so they are coming to all).Have not tried the gaming yet but once the gamepad does I can't wait to dive in..", "verified": true, "helpfulness": "2/2", "author": "Jason C. Kessler \"Misfit410\""}, {"rating": 5.0, "review": "The Amazon Fire TV is the quintessential media streaming device. It is small, unobtrusive, and very well-constructed. In addition, it has a powerful and capable processor, as well as a generous amount of memory and storage. It provides exceptional access to a wide variety of entertainment modalities. The Amazon Fire TV is absolutely outstanding, and I give it my very highest recommendation.", "verified": true, "helpfulness": "1/1", "author": "KRMD"}, {"rating": 5.0, "review": "This is WONDERFUL, AMAZING!  Purchased Google but had problems with it connecting to the wireless Internet at times. This is GREAT!! My boyfriend says no one could have designed a better product than this! Thank you, Amazon!", "verified": true, "helpfulness": "2/3", "author": "Cisco J. \"Cisco J.\""}, {"rating": 5.0, "review": "For the price - this is an excellent value.  So easy to set up right out of the box - i did not need to call up my son for assistance.  Literally 3 steps and it is ready to go.  It already came loaded with my entire video library of purchases.  It is great to be able to access Netflix, Hulu Plus and my video library on one device - I love being able to switch between ER from my video library, Grey's Anatomy on Netflix and St Elsewhere on Hulu.  So convenient and super fast.", "verified": true, "helpfulness": "1/1", "author": "Shoe Mom"}, {"rating": 2.0, "review": "I purchased the Fire TV at Best Buy (where they had at least 50 in stock, yet they are backordered on Amazon). I am extremely acquainted with the streaming ecosystem and already own a last generation Roku, as well as a smart bluray player, and game consoles.Fire TV only has one thing going for it... Interface speed.  As far as components go, Amazon did everything right.  I don't need to be the 1000th person to say that the box is ridiculously skewed only towards Amazon-sold content, but I would like to add this important note: Amazon has no clue how to organize that content. I rent or watch digital content from Amazon, VuDu, iTunes, and Netflix... Amazon usually has everything available to rent IF you can find it. As a user of their Roku app, I was hoping Amazon would get their act together for the Fire TV, but their organization is still abysmal. The new release section is limited to only the absolute most popular films. There is no way to search by release date or browse genres by release date. Going to the \"horror\" genre pulls up Psycho, The Shining, and Stephen King's IT on the first page. It's the kind of random selection you'd expect if Amazon was giving preference to Prime eligible movies, but these are regular rentals displayed with no rhyme or reason. Who browses for classic or old films?  We want to see new content we don't know about!  When I want to pay to rent Psycho, you'll bet I'll be searching for it.This extends to all video content. First page of their documentary section includes Captain Phillips and Schindler's List... Um, what?!  There are only a few sections you can even browse on the Fire TV and nobody at Amazon has even noticed that their documentary section is filled with drama films?  There are probably 20 new docs available to rent on Amazon every week, but you'll never find them as Amazon is promoting old and mislabeled content. Even The Act of Killing (nominated for this year's best documentary Oscar) is #40... Films 1 through 39 include 16 docs that are 2010 or older (usually MUCH older) and 5 drama films that don't even belong in the category.Amazon's content organization for paid rentals feels exactly like flipping through Netflix Instant where we are accepting of old and lackluster content... On Amazon it's a hodge podge of old films promoted for no reason.  In Drama you'll find 2006's The Departed to rent for $4 right up front, but have to scroll through 100 more films to get to 2014's The Broken Circle Breakdown (free on Amazon Prime).Fire TV is a consumption machine with absolutely no care as to what you are consuming as long as Amazon is getting their cut. If you have any interest in movies at all, you'll have to research new content on the web and search for it manually... When THAT works. Today I searched for David Gordon Green's new film Joe starring Nicholas Cage. It was released for rent today and won film festivals around the world. Searching the title \"Joe\" brought back 100 results that weren't the film. Searching \"David Gordon Green\" finally found the movie as the 16th result, after all of Green's older movies and several movies that have nothing to do with David Gordon Green.  I almost gave up trying to find it at all, but in contrast, Joe is the first movie listed on iTunes and listed with giant banners in multiple places.For a device that practically hides other apps to shove square after square of Amazon content in your face, Amazon has a LONG way to go at making that content somewhat relevant and timely. I'm kind of surprised content creators aren't giving up on Amazon. I'm sure Morgan Spurlock is happy that Amazon has had Super Size Me on the front page of documentaries for over 3 years, but how about telling me what came out this week, or even this decade?  It's very strange, because I've had no issues with the organization of the Kindle store.", "verified": true, "helpfulness": "12/20", "author": "Christian Stella \"author\""}, {"rating": 3.0, "review": "I will have to now use my game controller and hope it works for everything. Never had a remote go out before the first battery change before... I also can't search Vimeo on this like I can on my Sony. The voice feature may wow some people, but do I want Amazon having a voice profile on me and my kids?...No, not in this era of privacy encroachment. They claim the more you use it the more they refine it. Guess that means that over time they could reverse the process and sound just like me?  Maybe for a fee they will one day make my unpleasant phone calls?Add to this the fact that it has almost NO memory 8G...So forget about having many games. You have to remove them to add new ones.Update:I've had to reboot the system once to fix an error message that said it could not load videos and one of my programs. I've started cutting power to it when not in use and haven't seen the issue again.I use the Fire with a projector upstairs and the fact that Fire only has one HDMI out means that I can't channel audio separately and must use the projector speaker since most projectors assume the device controller has the audio out. I still have my Sony Blu ray Wifi downstairs and like it better because I can also hit the net and play actual DVD's.And oh yeah....my remote died..", "verified": true, "helpfulness": "1/7", "author": "bunnyrabbit4"}, {"rating": 3.0, "review": "I liked it, but returned it when I realized it won't run HBO GO.  When they work out the politics, I'll re-purchase at that time.", "verified": true, "helpfulness": "2/15", "author": "FM Tech"}, {"rating": 5.0, "review": "To start off with I have owned a variety of streaming devices over the years including blue-ray players, smart tv's, chromecast, roku a dedicated computer, and gaming devices.I currently use primarily my Roku 2, 3 and Chromecast. Figured I would give the Amazon device a try. On my primary TV I have now just been using the Fire TV. I have Comcast so HBOGo doesn't work on the Roku's so that isn't a big deal to me. I primarily use Netflix and Amazon Prime for my streaming. With my use it seems like the loading speed is faster than the Roku 3. It also seems like the Menu is a bit I guess snappier.I guess overall the reason I gave this 5 stars is that it, for the week I have had it, hasreplaced my Roku 3 which up to now has been my favorite streaming device.", "verified": true, "helpfulness": "1/1", "author": "Josh"}, {"rating": 5.0, "review": "It came fast. So easy to get started.  Voice activation feature works perfectly.  I feel like it enhances my Prime membership.  My only complaint is I wish there were better movies for free on Prime.", "verified": true, "helpfulness": "2/2", "author": "JJ11110"}]