[{"rating": 3.0, "review": "The biggest problem: working with Amazon streaming movies. There are many discussions of this on the web, but the bottom line is there is some incompatibility between this device and Amazon streaming movies. I wish the two companies could get together on this, because it works great for most other applications. It is especially nice for watching youtube videos, which you can send to your big screen TV in hi-res. Very inexpensive for what it does.", "verified": true, "helpfulness": "0/0", "author": "J. Hargrove \"The Other Jim Hargrove\""}, {"rating": 5.0, "review": "Great devoce.. Food price", "verified": true, "helpfulness": "0/0", "author": "Ingrid"}, {"rating": 5.0, "review": "This is a very lovely product for those who doesn't have a smart TV but has a HDMI TV. I am able to use lots of Apps through this. I tried to cast from Google Chrome web brower using my iPhone but couldn't do that. When I tried with an Andriod device, I am able to cast using the Google Chrome web brower. I love this product.", "verified": true, "helpfulness": "0/0", "author": "Deb"}, {"rating": 5.0, "review": "Netflix and this tiny tech are all you need. Supported apps are easy to quickly display from your phone. Any other media service can be pumped through Google Chrome. Works great in Hotel rooms as long as the hotel doesn't have a special login screen after you connect to the wifi.", "verified": true, "helpfulness": "0/0", "author": "Alex Vastartis"}, {"rating": 5.0, "review": "Well worth the $30.  Starts up fast and streams without any lags.  I do miss the remote cuz having to use my phone all the time can get a little tiring.  Maybe I'll use an old phone just as a remote.", "verified": true, "helpfulness": "0/0", "author": "Arvinder"}, {"rating": 5.0, "review": "I must admit.  I felt pretty cool when I was able to broadcast Netflix from my phone to my TV.  I had this hooked up in my bedroom for several months with no problems.  I recently moved it to my TV on the back patio and it isn't working so good.  I keep losing the connection and I have to reboot everything.", "verified": true, "helpfulness": "0/0", "author": "Michelle Cunningham"}, {"rating": 3.0, "review": "The Chromecast is a convenience product that serves it's purpose adequately; however, do not confuse this as a wireless hdmi cable", "verified": true, "helpfulness": "0/0", "author": "william"}, {"rating": 3.0, "review": "I bought it with high hopes that more content would come out to support this. For a bit more money, you can buy an apple TV or a roku with built in apps.", "verified": true, "helpfulness": "0/0", "author": "M. Quijano"}, {"rating": 4.0, "review": "The reason I bought this was I was under the impression it already was capable of doing complete phone screen mirroring but that is a future feature and it may not even work with my particular phone.  But it is cool the way it works with the apps on my big screen.  Hopefully mirroring will actually work with my phone, if so, I would give 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 4.0, "review": "I have this connected to my Onkyo TX-NR605 receiver and love playing music with Google Play Music All Access.  I also use the Plex Android App to stream movies from my Plex Media Server.  It works okay but the bottleneck is my computer which can't keep up with 1080p transcoding.2 gripes are lack of 5 GHz and chromecasting from my desktop Google Chrome browser tab yields 1-2 second lag and fuzzy text.", "verified": true, "helpfulness": "0/0", "author": "T. Mah"}]