[{"rating": 4.0, "review": "I came from using a old Roku box (I think HD not even 1) and found a lot of things to like about this. Our internet speed is terrible here because we live backed up to the forest, so the extra processing power, especially when we use AMZ prime, or other AMZ movies seems to have a lot less waiting time. I wish this was true for Netflix as well, but we don't see the improvement there.I very much like the speaking function to find things, though we find it really only is attuned adult voices, by 6 years grandchild get a little frustrated asking for things, it just doesn't get what her little voice says.The included remote (which I have to say feels really good in your hands) did not work with the games that we tried to play so we ended up buying the AMZ one, it seems OK but as a 57 year old grandma I was not much of a \"gamer\" the grandkids (4&6) have no trouble making it work.Biggest reason why 4 stars and not 5, there should be a listing for PRIME, with everything in it, not just the latest additions to it. It's no fun when the kids find a movie to find that it's $5.99 to rent, and we don't because, well their attention span means it will get watched for 10 mins and then they are on the next thing.On my old Roku box, I could just look at FREE Prime content and not have to sort through a bunch of paid options to find what we wanted, this really should be fixed with a firmware upgrade of some kind!", "verified": true, "helpfulness": "3/3", "author": "SedonaGal"}, {"rating": 5.0, "review": "All good!", "verified": true, "helpfulness": "0/0", "author": "Andrew W. Harris"}, {"rating": 5.0, "review": "Easy to set up and install. I lovethe remote and the voice search. The quality  and speed of the picture it great. No more waiting to down load the program or movie. It's outstanding.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's great! Never takes time to load and it saved me a ton of money by not having to buy a smart tv", "verified": true, "helpfulness": "1/1", "author": "katie cowell"}, {"rating": 5.0, "review": "Simple to hook up straight out of the box. Great picture quality. Streams beautifully, no pauses or buffering. The remote even turns my TV on & off, which means one less remote I have to keep up with. It fast-forwards, rewinds & pauses just like a DVD player.  If its paused for a short time-the screen saver automatically comes on. The voice search really does work; thought my accent would throw it off, but it doesn't. I can access my watch list from the TV screen and remove programs or save them to watch later. I read other reviews complaining they had to specifically search for prime movies-not sure why as there is a category on the home screen for \"prime movies\", \"prime TV\", etc.  I definitely recommend it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is amazing device and amazing in every way: very compact both, the device and the remote; extremely powerful (about 30 times faster then WD TV Live - actually incomparable); lots of apps and videos and games.If you live outside US forget about almost all of the services, but there are \"rooting\" gurus out there who managed to let the Fire TV enjoy external USB storage, etc. which makes this device international attraction.In short - you'll enjoy every single penny you spent on this.Highly recommended!P.S. The only minor drawback I found is that the remote buttons are a bit noisy, but not a big deal...", "verified": true, "helpfulness": "1/1", "author": "TaG \"TaG\""}, {"rating": 5.0, "review": "It is a great product.  The voice command feature is excellent, however, it only works with Amazon content.  Wish it would work with Hulu and Netflix but cannot complain.  Streaming is very smooth.", "verified": true, "helpfulness": "0/0", "author": "Amer Ghul"}, {"rating": 5.0, "review": "Connects easily, great sound quality, video works flawlessly, but be ready to pay an extra annual $100 for prime time membership. You need and internet connection, either with a cable or wifi. I recommend connecting your tv to your sound system, or run a direct feed (includes an optic output jack) directly to an input on your stereo system.  That extra $100 annually does not get you every movie but the Prime Membership Movies are categorized and easy to find, plus you get free music offers,  and free two day shipping on some of your purchases in the Amazon Shop. It has some great apps like Pandora, Iheart Radio, and easy access to your Amazon Music Subscription. The Amazon Music interface is smooth, includes pics, and all your playlist.  Showtime and HBO access is allowed as long as you pay for them through you cable provider, and many more options are available with the Fire TV then you even get on your cable box. Thumbs Way Up for the Fire TV. In my opinion, Amazon Fire TV is a better choice then Chromecast, I have them both. I have not tried to stream from my laptop to the Fire Box, like I do with Chromecast, but when I do, I will update this review. Neither Iheart Radio or Amamzon Music Interface is available on Chromecat! If that works Fire Tv will have provided more then I expected!", "verified": true, "helpfulness": "0/0", "author": "Stephan Pawl"}, {"rating": 5.0, "review": "Very easy to use.  Kids love it!", "verified": true, "helpfulness": "0/0", "author": "Karen A Schmidt"}, {"rating": 5.0, "review": "I purchased my Fire TV as soon as it came out and I am very glad I did.  The programming is instantaneously accessible, it is easy to use, and the programs seemingly endless.  This is one of the best purchases I have made all year!", "verified": true, "helpfulness": "0/0", "author": "Kathaleen Midcalf"}]