[{"rating": 3.0, "review": "I had access to Amazon Prime which made it kind of nice.  My big problem was the inability to get the Amazon Fire TV to work with our receiver to enable my husband to continue using his head set for hearing.  It was becoming much too complicated to achieve that - had to return it.", "verified": true, "helpfulness": "1/1", "author": "Media Diva"}, {"rating": 5.0, "review": "Love this item. It works smoothly and has a great picture. Easy to work and get connected. I like the navigation, very easy to use", "verified": true, "helpfulness": "0/0", "author": "Michelle Skillin"}, {"rating": 3.0, "review": "Okay yes this device is snappy and has a pretty interface. But why Amazon, why do you think I want to use 2 remote controls again!?!I had this thing a month and only tried out the voice search a couple times.. end result = yes it works...but I don't use it. I'd much rather have IR support and one universal remote (that cost me 100's) than voice search.I have a roku3 now, it's not as fast and the interface looks like something designed for the wii... but there is more content and I'm back to 1 single remote control.Last thing, and Jeff I'm looking at you here buddy. when did amazon start acting like apple? Why are you trying to TELL US what we want instead of listening and giving us what WE ASK FOR???I really wanted to like this device...", "verified": true, "helpfulness": "1/1", "author": "DS"}, {"rating": 5.0, "review": "This slim unit is a nice robust small package. We have used it for 5 days now and are very impressed with the ease of use since the voice recognition is spot on. Search function seems to nicely uncover topic titles very well. As an example if I say \"wine\" in the voice search it will bring back all selections I might be interested in that pertain to wine or vineyards. Our use of FireTV is specifically for quick access to Prime video selections. I can't speak to other functionality at this time and I'm not an HBO user so I don't miss an HBO application. This is a nice companion that compliments  AppleTV and it's video content. Worth the dollars if you are a Prime member.", "verified": true, "helpfulness": "0/0", "author": "Haoleguy"}, {"rating": 4.0, "review": "Very easy to set up, it does what I thought it would do. I wish it had more apps available. I bought it so I had access to the Amazon Prime movies that we get on our smart tv that is located in another room, and works great for that.", "verified": true, "helpfulness": "0/0", "author": "Robert Graham"}, {"rating": 5.0, "review": "What a fantastic system, and we haven't even really explored its full capacity yet. We have played games, & watched the latest movies . Last night I watched episodes from a tv series I never have time for; this morning I'll choose from several great work-out selections to start my day. The voice control is super; this product far exceeds any expectations!", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 5.0, "review": "Amazon TV is a great product. I don't buy first editions of electronic gadgets because they always have a bug or something missing. But as a TV viewer for 50 years Amazon TV delivers right out of the gate. They hit a home run.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 1.0, "review": "Pic quality isn't that good & I like shows like ncis,criminal minds,shows like that there on ion but you don't offer them I was trying to get rid of cable completely to save $ but I have three tvs so I would need to by three fire boxes is there any suggestions you can do for me as far as my shows & pic quality do I need to have three boxes or do u sell.  Something else for other tvs?", "verified": true, "helpfulness": "2/8", "author": "darrell winquist"}, {"rating": 3.0, "review": "Okay, so it is a hair faster than my Roku 3 & the games are better (I suggest buying the game controller...more $). Other than that I am partial to the Roku 3 & I am a HUGE supporter of Amazon products. But the layout is horrible. It's a carousel like on the Kindle Fire. BUT this isn't so great when you have 172 shows in your list. It doesn't allow you to filter or unmix the order they are in. And if you use the voice search while in your library.....you get everything not just in your library.  You get much more than what you are looking for leaving more sorting to do. It also mixes your movies with your tv shows making it harder again to find what you want. All in all, we will keep the Fire TV (because I sold a 1 Roku 3 when this arrived) but the Roku 3 offers so many more channels. I really like Paranormal TV channel.....not on Fire TV. We just experienced an issue with the Fire TV telling us nothing was available try again later......told my husband to reboot it, it did fix it but you shouldn't have to do this. He is disabled & getting to the tv stand where the box is isn't always easy for him (If I would have been home I would have done this for him)....So all & all I would call it an equal to Roku 3 not really better. That is unless you have no game system, then you may enjoy the Fire TV a bit more.", "verified": true, "helpfulness": "1/1", "author": "Journey \"Journey\""}, {"rating": 4.0, "review": "So far the box has been great.  Setup was super easy, plug and play.  I used a hard wired internet connection so I can't speak to wireless set up.  But it took like 3 minutes from box to ready to go.The voice recognition was spot on for the videos we searched for.  My only complaint was that I set up a parental pin to keep my kids from being able to buy things, so you have to enter the pin for every episode.  For example, my kids wanted to watch Spongebob, I had to enter the pin for every episode and I didn't see an option to play the series or multiple episodes or anything.  I was also a little confused in that the search shows prices for each episode, I'm a prime subscriber so I would have appreciated it if there was something noting that my account would not be charged.  The fact that I entered my pin made me even more worried.  It's been about a week and I haven't been charged for the shows they watched so I guess they must have been included in my prime membership.I would also like to see HBO go included, just about every other box out there has it, so I don't know why amazon wouldn't.Playback was flawless and fast.  We really liked it.I did 4 stars just because of the lack of HBO, the confusion in what was videos from the search were included in my prime membership, and having to enter my pin for every episode of the series.Even so, I'm very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Melissa C"}]