[{"rating": 5.0, "review": "This is the best tv dingle out there. EspecI ally for the price makes it 10 tInes better. If you have a android device at home this is the missing piece to an amazing home theater. The best setup is get the chromecast, any android device running on kit kat, and download allcast and showbox and you are set.", "verified": false, "helpfulness": "0/0", "author": "Howard Tong"}, {"rating": 5.0, "review": "Works exactly as described.  Truly an amazing invention.  I have a Samsung S4 which I use to control youtube videos.  So amazing.", "verified": true, "helpfulness": "0/0", "author": "Brandon M."}, {"rating": 1.0, "review": "it would't work on windows xp----needs windows 7 or higher", "verified": true, "helpfulness": "0/4", "author": "HANK LOWENSTEIN"}, {"rating": 5.0, "review": "in home this the only thing we use in our TV. i dont use any thing else to watch anything on TV. durable and very nice product.", "verified": true, "helpfulness": "0/0", "author": "Wasim Raza"}, {"rating": 5.0, "review": "CHROME CAST=LOVE", "verified": true, "helpfulness": "0/0", "author": "Jared"}, {"rating": 4.0, "review": "It's a little wonky. The Amazon Fire works better, IMO.", "verified": true, "helpfulness": "0/1", "author": "CaliberCable \"Signature\""}, {"rating": 5.0, "review": "This product is seriously amazing why lie. A work of genius at an impulse price point kudos to you google.", "verified": true, "helpfulness": "0/0", "author": "jamesc"}, {"rating": 5.0, "review": "I don't watch normal TV anymore. I just stream from my computer. Sorry Dish.", "verified": true, "helpfulness": "0/0", "author": "Riley Spear"}, {"rating": 5.0, "review": "The best", "verified": true, "helpfulness": "0/0", "author": "pete"}, {"rating": 5.0, "review": "JUST to GIVE EVERYONE AN EARLY HOLIDAY GIFT....chromecast is NOT LIMITED to just the apps provided.....any MOVIE/VIDEO/MUSIC you have downloaded or video you have on computer (as long as MP4 format) can be played without any app on chromecast....SIMPLE STEPS......open a chrome browser..............open your videos..........drag and drop any SONG/VIDEO/MOVIE (MP3, MP4) into the chrome browser address/URL bar. HIT THE CAST ICON......Your done, Chrome browser has its own media player and no one uses it.Also for those of you that have MKV or AVI files...............download the FREE program....HANDBRAKE....this allows you simply turn AVI or MKV's into MP4's and make all your MOVIES/VIDEOS able to be played through the chrome browser and hence..........chromecast to your TV.", "verified": false, "helpfulness": "0/0", "author": "Joseph"}]