[{"rating": 5.0, "review": "I bought this as a gift for my boyfriend, who was using his guitar amp for volume to stream shows from his computer (which was obviously very annoying).  The Chromecast was the perfect solution for him! We use the Chromecast constantly - it is so easy to use. We also LOVE all of the photos displayed as the screensaver when nothing is streaming! The only downside is that it can be difficult to connect to wifi when you first get it, but it was definitely worth the 15 minutes of trouble.  The Chromecast is an amazing product that we use multiple times a week!", "verified": true, "helpfulness": "0/0", "author": "Stacey"}, {"rating": 5.0, "review": "I have four of these through out my home, very useful and easy to install and setup", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Changed our lives", "verified": true, "helpfulness": "0/0", "author": "Aaron Webb"}, {"rating": 5.0, "review": "greattttt", "verified": true, "helpfulness": "0/0", "author": "MOHAMAD C."}, {"rating": 4.0, "review": "Pretty cool little device. It has it flaws, but for 35 bucks I'd say it was worth it. It still has alot of potential", "verified": true, "helpfulness": "0/0", "author": "Chadd Dexter"}, {"rating": 5.0, "review": "Love my chromecast.  And now android has the \"screen cast\" feature available so you can cast everything exactly as it appears on your phone.  So now you can cast EVERYTHING!  It can't be beat!", "verified": true, "helpfulness": "0/0", "author": "Brian Koichi Mizushima"}, {"rating": 5.0, "review": "You just have to get the Cromecast connected to the TV and set it up and you can cast what ever that's on your Google Chrome tab (with the cromecast plugin)Keep the kids entertained and you know what they are watching on TV", "verified": true, "helpfulness": "0/0", "author": "Pasan P."}, {"rating": 5.0, "review": "great item", "verified": true, "helpfulness": "0/0", "author": "aliandro"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Jessi Lozano"}, {"rating": 4.0, "review": "works like it's supposed to.", "verified": true, "helpfulness": "0/0", "author": "Denis Johns"}]