[{"rating": 4.0, "review": "It's cool, but it can't really do all that much.", "verified": true, "helpfulness": "0/0", "author": "Johnny Stark"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Gerald Haug"}, {"rating": 5.0, "review": "one word..AWSOME!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "icyflyyslRG"}, {"rating": 1.0, "review": "This is a super-duper amazing device, but if something goes wrong with it, don't expect Google to replace it.  From switching ports, something went wrong with with the copper connector and it would no longer communicate with the phones/computers. I had received it as a gift,  so I logged into my wife's Amazon account, but they wouldn't accept it because it was over a month from purchase. No problem, my wife had amazingly purchased a coverage plan.  So I logged into Square Trade, and they said they wouldn't accept it because it was still covered under the manufacturers warranty (Google).  Ok, so I look at the warranty, and it says to contact HERE, and it brings you to a trouble shooting page with no contact info.  Eventually it tells you that you have to return it to the Googleplay store, but when you go there it wants your order number, so if you bought it anywhere but their store they can't help you online. No phone # anywhere; dead end. That's bad customer service. Finally I found googleplay's number through a web forum and called them. I was at work, so they couldn't help me because I couldn't troubleshoot it on my TV.  Called from home, we tried resetting it and it didn't work.  They said I needed to powercycle the TV, internet, phone, and chromecast and took my email address to keep track of what we had done so far. Called them back (nice part is that they have a very short wait time) and they had no record of our conversation on my account. So we started over and spent 45 minutes trying different ports, channels, connections, etc., until they had me get the unused HDMI extender from the box and try that, and the copper connector pulled off the unit and stuck in the extender. So now it was officially \"broken\", actually in two. So the representative, who's English was not primary and had a hard time repeating my email address as I slowly spelled it out, says that I will receive two emails shortly that explain how to return my item.  They never arrived.So today I called again AND THEY HAD NO RECORD OF ME EVERY CALLING!!!  But the guy was nice and understood that it was officially broken and after only 5 minutes of more questions sent me the first email which requires a response and said after they receive that response email they would immediately send me the second email which would tell me how I would receive a replacement.  I had to take an actual phone picture of the broken unit with the tiny serial number visible and ask my wife for the receipt of sale.  For a christmas present.  These I attached in reply to the email and sent it off....and I never received the second email!  In the first email, they referred that somehow my \"google wallet\" would have a hold on it as part of the replacement process, but never clarified how that would work.So as of now, three days and a couple hours of waiting, troubleshooting, typing, taking pictures, searching forums and files, I still have no idea when or even if it will be replaced.You'll have better luck renting from carrental9.com, getting a refund from a pawnshop, or convincing the IRS you don't owe them money than trying to get a REPLACEMENT FOR A $35 DEVICE!  From many great experiences with Google, this is a glaring black eye.", "verified": false, "helpfulness": "0/1", "author": "TDB"}, {"rating": 5.0, "review": "I like it, easy to set up and I use my iPhone to control it", "verified": true, "helpfulness": "0/0", "author": "Ksea"}, {"rating": 5.0, "review": "Great little device.It let me project pbs shows and sporting events that I watch online on a big screen TV.", "verified": true, "helpfulness": "0/0", "author": "Slava Midwest"}, {"rating": 4.0, "review": "20% of the time it is not registered by my phone or other apps as being active, however, this is a great device!", "verified": true, "helpfulness": "0/0", "author": "nitric"}, {"rating": 5.0, "review": "I've had it for two days and I'm ordering another one for another room and for traveling. This thing is awesome!", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Randomly shuts off for no reason. Otherwise it's good.", "verified": true, "helpfulness": "0/0", "author": "Vicky Haskell"}, {"rating": 5.0, "review": "They Chromecast stick works very well with my TV I've had no problems with it so far.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]