[{"rating": 5.0, "review": "AWESOME", "verified": true, "helpfulness": "0/0", "author": "AMAZONIAN SHOP'AHOLIC \"ASA\""}, {"rating": 5.0, "review": "Chromecast is the future. You will not be disappointed. The flexibility with this product is astounding. You don't need hdmi cables anymore. You don't need a DVD player. You just need chromecast, and your laptop/tablet/phone. Don't have a laptop but have a pc? BOOM, wireless keyboard and mouse. Chromecast makes everything better.Having a party? Turn your chromecast into a jukebox with music videos (Stream youtube). They even have a function of allowing guests to cast without giving out wifi passwords.Just about every video streaming service has compatibility: Hulu, Netflix, Youtube, Pandora, TED, crunchyroll, PlutoTV, FoxNow, Twitch, Dailymotion, Crackle, etc. the list goes on and on. This means for ANY device you can set these up flawlessly. Easily.With a laptop or pc you can use Google Chrome web browser to cast any page (for those sketchy video streaming sites you use like SolarMovie, vodlocker, etc.) They even have a beta service in Chrome browsers which allows you to cast OTHER WINDOWS or your DESKTOP from your laptop to your tv. You could play DVDs on your laptop and cast to your TV. (This is why you potentially don't need hdmi anymore, certainly not DVD players).When chromecast is idle it displays beautiful photography photos (I rarely see one I recognize, I'm sure there are hundreds if not thousands that randomly cycle. And also is customizable with your own photos and pictures, taking over the role of a digital picture frame.The bottom line is chromecast synthesizes many different consumer electronic appliances into one beautiful, affordable, and easy to use device.It's way too good to pass up for 30 dollars.Oh and buy the mini usb cable. It makes the whole setup more slick.Chromecast is here. Raise your dongle.", "verified": true, "helpfulness": "1/1", "author": "D O"}, {"rating": 1.0, "review": "I was disappointed it didn't work well with Amazon Instant video. I also thought I would be able to send my laptop screen to my TV, so I could watch movies, I have on my computer, on my TV. I can only send Chrome browser tabs to the TV. It seems pretty worthless.", "verified": true, "helpfulness": "0/0", "author": "J. Huntley"}, {"rating": 1.0, "review": "I bought a chromecast from Google and it worked great. Then I let my brother use it and keep it with his TV so I bought another for myself from Amazon. I had to reboot this one multiple times (every other time I would use it). Finally it has stopped working after about 6 months. Don't buy this from Amazon.", "verified": true, "helpfulness": "1/2", "author": "Zach Daniel"}, {"rating": 5.0, "review": "this was one of the best purchases that i have made in a long time!!!for basically 30.00 i have free tv for ever now and am not locked into a contract thats going to cost me $100+ every month.yeah you have to pay for netflix and hulu but even then you are saving alot of money!!!the setup was easy-10 minutes.picture quality was very good as well-depending on what you are watching.i cast youtube and i was impressed!needless  to say i would recommend this product", "verified": true, "helpfulness": "0/0", "author": "david king"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Julissa Tejada"}, {"rating": 5.0, "review": "Hard to beat for 30 bucks.  Easy to configure and it works great.", "verified": true, "helpfulness": "0/0", "author": "Chris W."}, {"rating": 4.0, "review": "Great tech but I wish it was more universally compatible with other streaming systems.  Its works nearly seamlessly with youtube it's intended target.", "verified": true, "helpfulness": "0/0", "author": "efrain Gonzalez"}, {"rating": 4.0, "review": "After some ups and downs because of the android version of the tablets that I tried to connect being not suitable. It is now working correctly with my tablet, Desktop PC and my 2 Tablets. Till now I would recommend this product above any other clone. I Bought also an EZCAST, but I received an ANYCAST and this is a piece of nothing. It can't connect to the Wi-Fi Router and it jams and it only comes back after you Reset it. I would strongly recommend to stay away from the clones, but I will come back with updates, because I will try to get an original EZCAST to test it out. I have seen great things on you tube with this clone.Again some minor problems at the beginning but the chromecast is now working as a breeze.", "verified": true, "helpfulness": "0/0", "author": "Carlos Jardim"}, {"rating": 1.0, "review": "Blows. Constantly pauses and buffers despite strong signal and fast connection. Very frustrating.", "verified": true, "helpfulness": "0/0", "author": "Jim"}]