[{"rating": 5.0, "review": "Fantastic product, I wanted something simple to replace my Apple TV and this was a fantastic option. I think this is 10x better in almost every way except that most if not all of the applications I have used do not have auto play and that gets very frustrating when I want to have Netflix on in the background while I am doing work. But I guess that's not the chrome casts fault but the developers.", "verified": true, "helpfulness": "0/0", "author": "Nitzan Levi"}, {"rating": 5.0, "review": "excelente producto", "verified": true, "helpfulness": "0/0", "author": "Elias Chicas"}, {"rating": 4.0, "review": "Does what it supposed to.  Occasionally runs hot.", "verified": true, "helpfulness": "0/0", "author": "mrins740"}, {"rating": 5.0, "review": "Great! I love it", "verified": true, "helpfulness": "0/0", "author": "Folake"}, {"rating": 5.0, "review": "Love them!  We have 2 in our primary home and one at the cottage. We can stream from our computers, or tablets.", "verified": true, "helpfulness": "0/0", "author": "David Jon \"music dewd\""}, {"rating": 1.0, "review": "Very feeble USB connection, device damaged so quickly. Attached pictures", "verified": true, "helpfulness": "0/0", "author": "suresh"}, {"rating": 5.0, "review": "I don't know how I lived before Chromecast. It takes entertainment ease, and lazy-American stereotypes, to a new level.", "verified": true, "helpfulness": "0/0", "author": "DTM"}, {"rating": 5.0, "review": "Could not be happier! I am absolutely blown away by the fascinating pictures the Chromcast displays as a slideshow when in idle mode. It not just transforming our TV into a smart TV, but also into a object of beauty.", "verified": true, "helpfulness": "0/0", "author": "onfaith"}, {"rating": 5.0, "review": "Great.. I don't have any problem.", "verified": true, "helpfulness": "0/0", "author": "Misael Andrey Albañil"}, {"rating": 5.0, "review": "These are my favorite devices. I bought 2. I use them all the time. I don't know why you don't have one yet.", "verified": true, "helpfulness": "0/0", "author": "John H"}]