[{"rating": 1.0, "review": "This is a poor product. My tv has a conflict with the device. It is an HDTV flatscreen VIZIO.Dont buy this if you have a VIZIO!", "verified": true, "helpfulness": "1/1", "author": "Bob cummings"}, {"rating": 5.0, "review": "I love the cordless access to content, and the fact that I can get around the problem of my phone not having an HDMI output.  Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Lael Beckwith \"Gadget Mom\""}, {"rating": 5.0, "review": "Great product. So far so good. I have no complaints thus far. Sometimes the signal gets lost, but I think that's because of my internet connection.", "verified": true, "helpfulness": "0/0", "author": "James D."}, {"rating": 5.0, "review": "We are going to get rid of our cable and only use our chromecast to watch and stream videos. Its great. We have 4 apps downloaded now that we use now and hopefully we can continue to add more. Its a great product and I believe it will save us lots of money once we cancel cable. Love it!", "verified": true, "helpfulness": "0/0", "author": "Mary Allen"}, {"rating": 5.0, "review": "I now own three of these for various televisions in my home.  I would recommend to anyone. I use it with both my phone and my tablet. Works great!", "verified": true, "helpfulness": "0/0", "author": "Beth McCann"}, {"rating": 5.0, "review": "Wow. This little piece of equipment is amazing! I was going to buy a smart TV but this pretty much does the exact same thing! I saved a ton of money just buying a standard LED and adding the Chromecast vs buying a smart TV. I love that when I \"cast\" something it automatically switches my TV to the correct input! If you can get it on your chrome browser you can put it on your TV. If you are on the fence about this.. its worth the $35!", "verified": true, "helpfulness": "0/0", "author": "AmazonFreak"}, {"rating": 5.0, "review": "Ease to use and does need ac power on my particular set. Netflx picture quality is very good and audio quality as well.", "verified": true, "helpfulness": "0/0", "author": "Ricky V"}, {"rating": 5.0, "review": "I got this for my sister and my wife for Christmas. Wow what a cool little unit. My wife actually set it up without much help from me. Shorty after we realized what it could provide we also ordered Netflix , Hulu Plus and Vudu so now for about $20 A MONTH we cut $90 off the cable bill. I just subscribe to basic cable $30 again it only took 20 years to get back to the basics....LOL.", "verified": true, "helpfulness": "0/0", "author": "stephen7777"}, {"rating": 2.0, "review": "This device is not thee way to go for Internet TV, unless you have a spare Laptop, or Tablet, hanging around that no one uses. A Laptop, or equivalent, is required to make this device work. And, it must be at Windows 7, or higher. I was not aware of this when I purchased it. I became aware shortly after I received it. I had to borrow my wife's Laptop to check it out. It does work,  and it provides a fine image, but it requires a bunch of apps, (which you can download from Google). And it pretty much ties up that Laptop, etc., for constant use, to which my wife said, \"Not my Laptop!'. So that's that!I'll bet it would work just fine if I bought a Tablet, for around $300. But I can get a Roku, or Apple TV, for a lot less. And, my purpose in getting this device was not to buy a Tablet. I intended to use it with my Netbook (which is XP oriented and can't be upgraded to W7).Also, I noticed that some funny things started to happen to my Desktop, ie: I started getting a lot more Spam and Pop-ups when this device was connected to my TV, even though it was not being used at the time. I removed it from the HDMI port, and those things went away. Don't know if there is a connection there, but thought I should make you aware.I'm going to keep it, so when I do (someday) get that Tablet (or whatever), and Time Warner starts being halfway decent and makes it's use feasible by adjusting their rates, I can maybe take advantage of the great stuff available on the Internet.All-in-all, if you have the equipment available to support it (extra PC), it will probably provide you with a decent connection for Internet TV. Hopefully, the other stuff I mentioned, will not occur.", "verified": true, "helpfulness": "0/0", "author": "Btyabear"}, {"rating": 5.0, "review": "This does a good job of what it's designed to do.  Please people, read up first.  there are limitations, as the software and device is essentially a beta.  More and more features with added compatibility will be added.I use this regularly for netflix in my bedroom, and for $35, it makes a great convenient device for this.", "verified": true, "helpfulness": "0/0", "author": "Adam M."}]