[{"rating": 5.0, "review": "I love my Chromecast. It was was very easy to set up the product and have it ready to cast and stream videos. Google Chrome makes it so easy. The price of the product is not bad either. You cannot get any of the other similar products like Roku or Apple TV anywhere close to this price. However, the downside is that it does not support all the streaming websites that those other products do. But I believe that Google is working to improve this product and make it even better. It needs time, I guess.", "verified": true, "helpfulness": "0/1", "author": "H07"}, {"rating": 5.0, "review": "So easy to install.  It took less than 10 minutes and now I can truly watch my movies anywhere.  And I can use it on any TV in my house.", "verified": true, "helpfulness": "0/0", "author": "Working Mom of Twins \"Working Mom of Twins\""}, {"rating": 5.0, "review": "Amazing is an understatement .....I'm what they call a cable cutter.  Disconnected from comcast tv, but utilize internet, saving about 80 bucks a month!  Anyway, wanted to continue watching netflix and youtube on my tv instead of the ipad .....and didn't want the big hdmil cable to deal with.....This thing is fast, smooth, with awesome picture quality on my Led tv.....I can see why it's the number one seller.  I'm buying a second one for my bedroom tv.", "verified": true, "helpfulness": "1/1", "author": "Steve"}, {"rating": 5.0, "review": "Wow, for that price! What else can you ask for?!Great product - I hope they will add more functionality to it soon but as it is now it is also good.", "verified": true, "helpfulness": "0/0", "author": "LKTG"}, {"rating": 5.0, "review": "It does everything that it promised to do! It makes life super easy and I feel like I would be willing to pay way more than $35 for it! I love it!", "verified": true, "helpfulness": "0/0", "author": "ktslaughing"}, {"rating": 3.0, "review": "Good effort from GoogleWorks quite well with my phoneIts a little hard to work with - connecting to my laptop via chromehave trouble with connections - also breaks up quite a bitProbably best to wait a while after it matures into a full productFeels a little more like a prototype item like google glass", "verified": true, "helpfulness": "0/0", "author": "Antho \"Tony\""}, {"rating": 5.0, "review": "Love this thing, I'll probably get more now for my other TV's. Works flawlessly, no lag with videos, no audio out of sync with the video.", "verified": true, "helpfulness": "1/1", "author": "Blake Ramsden"}, {"rating": 5.0, "review": "As of today I am finally ready to give the Chromecast 5 stars.Being able to use your phone as a controller is a rather neat idea and since almost everyone has smart phones it works out quite well. Set up is quick and easy, and using it with the apps on your phone is also easy.Up until today there was a severe lack of apps that could be used with it, which basically limited you to using netflix or hulu. But with the introduction of plex support, the chromecast has finally gotten to where I think it needs to be and you can finally stream local content. There are still quite a few more streaming services that need to be added (amazon instant video for one) but it is definitely getting better every day and is probably only a matter of time.For the price, and the features it now supports you really can't go wrong, and I honestly can't see myself purchasing any other streaming box anytime soon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This has to be the easiest way to watch Netflix (and hopefully Hulu Plus soon) that is possible.  We are getting one for each TV, because it's much cheaper than buying a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Rosa"}, {"rating": 1.0, "review": "IMPORTANT....  The Chromecast HDMI Media player is not compatible with the Kindle Fire HD...Confirmed by both Google and now Amazon...  The add for this device is deceptive given that itclearly states that it is compatible with Android devices...  More information in the add would behelpful...", "verified": true, "helpfulness": "2/3", "author": "Dave"}]