[{"rating": 5.0, "review": "Best decision I  have made in a long time was to purchase this (and downsize my cable subscription).  This is totally the way I like to see TV -- what I want to see without costing an arm and a leg.  Very easy to install and use.  A real winner.", "verified": true, "helpfulness": "1/1", "author": "Dasher"}, {"rating": 5.0, "review": "this is one of the best technical devices I have ever owned. It really does work with the voice command. anyone can use the voice command. it is very simple to install. within less than 3 minutes It was up and working, with a animated walk through tutorial, beautifully done. if you forget how to do anything you can go back to instructional video and relearn or learn something new. Love it, It is great for watching movies,TV shows, and playing games, which most are free. or 99 cents. I like the fact that most games can be played with the remote that comes with it. I did order the controllers and added even more fun and entertainment.  The Packaging is even fun to open, it is so neat and sleek design, can not believe that it is as small and lightweight as it is and has so much to offer and keeps giving more daily. I find something new all the time to watch or do, Love it, Love it, Love it! and you and your family will too!", "verified": true, "helpfulness": "1/1", "author": "annie, TN"}, {"rating": 3.0, "review": "It was easy to set up. I am not totally satisfied with choice of free movies with prime. My children use it all the time for games and tv shows. I do not own any similar products such as apple tv, so I am unable to compare it to what else is out there.", "verified": true, "helpfulness": "1/2", "author": "Peg"}, {"rating": 4.0, "review": "With the new update, there is now a category for Prime Video as well as the Music category.  I was disappointed when I first setup my device because I couldn't find the Amazon Cloud MP3 player and it showed up as not compatible in the app store.  But I looked around under settings until I could find the place to update the firmware.  Now there are quite a few more options from the home menu and I can listen to my music that I had saved to my account as well as my music purchases.  Prime Music is not supported right now, but I have to believe there will be an update to add the use of Prime Music as well.  It does seem somewhat strange that this is an amazon device and it doesn't support Prime Music but it's available for all of my android devices and my iPad.  I gave this a 4 star rating because it doesn't have all of the channels of the Roku 3, which has many more music channels and movie channels.  The voice control seems to pick up what I am saying about 75% of the time.  The Roku app for the Amazon MP3 player also doesn't support Prime music, so I had created playlists to play my songs on the Roku, so those same playlists are usable on the Amazon Fire TV when playing music.", "verified": true, "helpfulness": "0/1", "author": "EZShopper"}, {"rating": 5.0, "review": "Love it. Only improvement needed is seperation of Prime content from non Prime content, otherwise this product is fantastic.", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 5.0, "review": "We don't need cable any more, are bills are cut in half because of this little box.", "verified": true, "helpfulness": "0/0", "author": "April Welch"}, {"rating": 5.0, "review": "The interface will look familiar to anyone that’s used a Kindle Fire tablet: it’s a basic grid with categories on the left and content on the right. Unlike the Roku 3’s bright and colorful themes, the Fire TV’s interface is mostly dark and understated. It’s easy to navigate and responsive thanks to the Fire TV’s powerful hardware, and most importantly, it’s easy to read from my couch. Needless to say, it’s a much better interface than anything a cable box has ever offered.In addition to all things Amazon, the Fire TV has apps for Netflix, Hulu Plus, Watch ESPN, Crackle, and many others. The apps are very similar to their Apple TV or Roku counterparts, and Amazon says that each provider is responsible for their app’s interface — it’s not dictating a particular look. Most of the apps are perfectly okay now, but that might not be the case for every app in the future.Curiously missing are HBO Go and Aereo, though Amazon tells me it is working with HBO on an app for the Fire TV. There are no options that I can find to watch live content. And it’s likely that the Fire TV will never have the ability to access content purchased from Google Play or iTunes. As with the Kindle Fire tablets, if you already live in Amazon’s world of cloud storage services, the Fire TV offers quite a bit. If you don’t, don’t expect to see much in the way of photos or music on the Fire TV.The Fire TV’s best experience is with content purchased or streamed from Amazon itself. Amazon does a lot of background processing to anticipate what I’m going to watch next and preload it for instant gratification when I hit the play button — the Fire TV has effectively eliminated loading for Amazon’s content. The interface is snappy as well: scrolling and paging through the menus is a lot easier and a lot less frustrating than on other media boxes.You control everything with a basic wireless remote that talks to the box over Bluetooth. It’s not much different than the remotes that come with the Roku 3 or Apple TV: it has a four way controller and basic buttons for play / pause, fast-forward, rewind, menu, back, and home. There’s also a button at the top of the remote to activate Amazon’s new universal voice-search function.Universal search is impressive, and it’s even better when I use the voice search to call up whatever I want. I push and hold the remote’s button and say \"Scarlett Johansson\" and boom, all of her movies are there right in front of me. I can do the same for whatever I’m looking for: actors, games, TV shows, music, directors, the list goes on. Fast and usually accurate, it might be the best voice search utility I’ve ever used — even better than Google Now on Android. Keying in searches with the remote is a major pain on any set top box, so it’s great that Amazon is offering an alternative.But once I’m inside an app, I can’t use the voice search. And Amazon’s \"universal\" search is limited to its own content and Hulu right now. That means that every time I look up something to watch on Netflix, I’m back to pecking away at letters with the little remote. That’s no better than an Apple TV or Roku box. Amazon says it plans to integrate more services into universal search in the future, but that requires cooperation from those services — and Amazon isn’t saying exactly when that will happen.While much of the media experience on the Fire TV is the same as I’ve seen before, the big differentiator is the fact that it can play games. Amazon is selling an optional Bluetooth game controller to go along with the Fire TV. It’s $39.99 and is styled like most third-party Xbox controllers: there are two joysticks, a d-pad, some buttons on the front, and triggers on the rear. The controller is rather generic-looking, and the buttons are a little mushy, but it’s more than adequate for the types of games that the Fire TV offers.Unlike the Roku’s simplistic games, the Fire TV’s games have depth, complexity, and in some cases rather impressive graphics. There are games developed in-house by Amazon, such as the Halo clone Sev Zero, as well as a number of popular Android games, such as Asphalt 8 and Badlands. Load times for larger games can be a bit tedious, but for the most part, performance is impressive. Frame rates are consistent and smooth, and while the Fire TV won’t give the Xbox One or PlayStation 4 a run for their money, I had more fun gaming on it than I expected. It almost goes without saying, but if you’ve been considering an Ouya or other Android gaming platform, you should probably just pick up the Fire TV instead.", "verified": false, "helpfulness": "0/0", "author": "SunYehoshua"}, {"rating": 4.0, "review": "The fire TV is really great......and I love the ease of use.  My only disapointment is  the limmited programs that can be watched now...many of the things I would like to see aren't available yet?  I don't know whay,  I assume it is has somthing to do with rights.These arn't new movies and shows.....They are popular ones thoug.I do like it and what is available is great....Just get disapointed when I can put it on my watch list but can't wach it.", "verified": true, "helpfulness": "0/0", "author": "Anne E. Reardon"}, {"rating": 5.0, "review": "At last a product that works for me better then I thought it would. Ruko, AppleTv, Vidon.me, Black box, Mid-night, Mini Mac's you name it I done it. I got the Fire TV so I can play around and see it's limits. As it comes it's a good product right out of the box. Remote, video output and user interface well done........ Ok done with that. Lets talk XBMC. Yes you can install it and run it. Easy to do and many \"How too's\" on the web. Just ordered another for the family room. Thank you Amazon, this is way you get my business.", "verified": true, "helpfulness": "3/3", "author": "P. Rodriguez Jr. The Mechanic \"Peterod\""}, {"rating": 5.0, "review": "Love this box, make getting tv better. Talked my son into buying one too. He loves his too. Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "james r coughlin"}]