[{"rating": 5.0, "review": "Love the fire tv. I recommended it to my friend who also loves it. Neither of us are techie so if we can work it anyone can.It is the absolute best.", "verified": true, "helpfulness": "0/0", "author": "LAH"}, {"rating": 1.0, "review": "It did not meet my expectations miss understood what I was buying I thought it was going to satellite dish trips life TV not rerun shows and I have to pay for movies aren't movies not what I was looking for.", "verified": true, "helpfulness": "1/3", "author": "Severin"}, {"rating": 2.0, "review": "I could have bought a Samsung blue ray player for for less money", "verified": true, "helpfulness": "0/2", "author": "Ben Schweickert"}, {"rating": 5.0, "review": "Great streamer, super fast and really decent gaming console.", "verified": true, "helpfulness": "0/1", "author": "Netboyatl \"Andrew Latham\""}, {"rating": 1.0, "review": "This is simply a terrible device.  Unlike Apple TV and streaming from my computer or phone, the Fire TV constantly pauses itself, sometimes literally 3 or 4 times per minute.  We give up and continue watching from the computer and it works perfectly, so it is not our internet connection.  I tested by streaming Netflix on both Apple TV and Fire one right after the other -- Apple TV was fine and Fire kept pausing.  Very disappointing, and a waste of money.", "verified": true, "helpfulness": "5/6", "author": "Robert L. Plotz \"Robert\""}, {"rating": 4.0, "review": "Fire TV is a polished and powerful streaming solution.  I have both a Fire and an Apple TV and in my experience the Fire is a superior device:Fast:  The UI responds quickly and content loads as lightning speed with ASAP.  I am using Fire over Wi-Fi and have no content quality issues or load time issues.  Works perfectly.Voice Search:  Voice Search is great and highly accurate.  It recognizes input the first time and in my use has been quite accurate.  I have not tested it with a lot of background noise but so far this voice recognition system is the best I've used.Prime:  If you have Prime this device is a no brainer.  Get access to tons of content (audio and video) at no additional charge.Easy to use:  While the Apple TV still has the upper hand here, I found it quite simple to add \"channels\" that I want.I would have given it a confident 5 stars but there are a few components missing:HBO Go:  I understand this is in the works but until it arrives it will be missing key content that I can get and use frequently on my Apple TV.iOS Control App:  While this is less important to me, it would be great to have the same options that Fire Phone and Android users have.Bottom line - If you are looking for a streaming device and you are already in or want to get into the Amazon ecosystem this device won't let you down.", "verified": true, "helpfulness": "0/0", "author": "phitauford"}, {"rating": 5.0, "review": "It's a change from Directv.  We like it although I was expecting to find much older movies.  The HD picture clarity is much enhanced vs. Directv.", "verified": true, "helpfulness": "0/0", "author": "Phyllis Irvin"}, {"rating": 5.0, "review": "Exceeded my expectations in every way.  Setup could not be simpler.  It's done before you get it.  Just connect it to your TV and internet and go.  I used an Ethernet cable so it was super easy.  Video resolution of movies and TV shows is outstanding.  I could not be happier.", "verified": true, "helpfulness": "0/0", "author": "Nasty Habits"}, {"rating": 5.0, "review": "Has been working perfectly for the past few months.I'm loving it.", "verified": true, "helpfulness": "0/0", "author": "HK"}, {"rating": 2.0, "review": "2 stars for the fact that you can't put the fire tv to sleep manually.", "verified": true, "helpfulness": "0/0", "author": "C. J. Scott"}]