[{"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Jordan L"}, {"rating": 5.0, "review": "It may not have all the features of the fire stick or Roku, but if you get it at the right price, it is well worth it. It's so easy to set up, your grandma can do it! She just needs to be able to read, download chrome and use the internet.It works flawlessly, and does not lag. I do have a good ISP and a good router, but really, you should be using this if your router or isp is not so good. Very simple interface and fast setup. I got this for my dad's birthday and he is very happy, streaming movies from his laptop.", "verified": true, "helpfulness": "0/0", "author": "NEET"}, {"rating": 5.0, "review": "Awesome!!! I use it all the time.", "verified": false, "helpfulness": "0/0", "author": "Elvis Castillo"}, {"rating": 5.0, "review": "I love this little device!!", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 4.0, "review": "It would be even better if Google included an HDMI splitter cable for this with older TV's that only have one HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Michael Weiner"}, {"rating": 5.0, "review": "Great product.No remotes which some might view as a negative is actually a positive for me. That's one less remote that I will lose or add to the remote graveyard on the coffee table. The downside is when you cast from your phone, when your phone rings there is no way to pause your show. So, it would be best to cast from your tablet.When I bought this I had a Roku stick previous but Comcast wouldn't allow HBO GO or Showtime casting there was no problem though with this nifty device. Also, I can cast whatever is on my phone or tablet with the new screen cast to my TV which is very cool. My favorite thing is that I can upload files from Google Drive and look at them on my TV and that includes video. Oh, I forgot to mention just because you cast from your phone or tablet doesn't mean you can't continue to use the device, your device just starts the app which the Chromecast streams from the cloud and not your device.In short, I believe all these sticks like Fire and Roku are great products. I chose Chromecast because of the Comcast situation, price and it has a lot more usefulness, especially, if you're already deep into the Android ecosystem.", "verified": true, "helpfulness": "0/0", "author": "Cedrick E. Wilson"}, {"rating": 5.0, "review": "I purchased the Google Chromecast HDMI Streaming media player about a month ago.  I am extreamly happy with my purchase.  The installation process was fast and easy.  I don't know how something so small can work so well - but it does.  The sound and image quality are astounding. Chromecast has turned my LED TV into a smart tv.  I primarily use my to stream netflix and you tube videos but it can do so much more.  I am very happy with my purchase.", "verified": true, "helpfulness": "0/1", "author": "T. Murray"}, {"rating": 2.0, "review": "Lately I've not been able to cast Netflix. When I called Google said they knew there was a problem but its been weeks now. I'm seriously considering returning it. It's pointless without Netflix.", "verified": true, "helpfulness": "0/0", "author": "J. Farrell"}, {"rating": 3.0, "review": "A lot of problems with installation.  My equipment does not appear to be compadable with player.", "verified": true, "helpfulness": "0/0", "author": "F L \"KKL\""}, {"rating": 2.0, "review": "Was super excited to get this to use for playing videos out of the browser on my laptop... Well it doesn't work worth a damn with a computer... had to reconfigure my PC and my router to get it to work. Tried to watch videos via the tab cast and it's worthless... google play music, same deal nothing but glitchy fragments. Works fine going back to just laptop speakers. None of the windows 8.1 dedicated apps for streaming services appear to have the cast button (though I could just use my ps3 for this purpose). I don't have any tablets or phones to test it with because my kids break the charge ports quicker than I can buy them so I haven't tested on an android device. Really I just wanted the browser cast for doing the stuff that my other devices that stream won't but it's a seriously lacking feature. Maybe after some more software updates and after tab casting comes out of Beta it won't suck. Overall I'm extremely dissatisfied but for $30 I guess I got what I paid for. Fix the tab cast so it actually works and it would be worth the money spent.", "verified": true, "helpfulness": "0/0", "author": "John/Cue\\Publik"}]