[{"rating": 5.0, "review": "Worked exactly as expected. Quick setup and can switch between multiple devices at a time (iPhone, computer, etc). Services like Netflix and YouTube stream directly from your WiFi router to your TV,  so your computer's processing power is bypassed for the most part.I've heard it doesn't work on college WiFi networks,  so be warned!", "verified": true, "helpfulness": "0/0", "author": "Jake \"coolstudent\""}, {"rating": 5.0, "review": "Works great. Easy to use. Took just a few minutes to set up, I recommend them to everyone u know.", "verified": true, "helpfulness": "0/0", "author": "andre betito"}, {"rating": 5.0, "review": "Works fantastic.  I wish the device supported 5GHz 802.11n but overall it still works remarkably well.  I use it mostly with YouTube and Netflix but also a couple times with Google Play Movies.", "verified": true, "helpfulness": "0/0", "author": "Kyle Erickson"}, {"rating": 1.0, "review": "This product just has not worked for me.  I may try to modify how I have it set up another time but have lost my enthusiasm.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Everything about the device works really well. You can cast any tab from the PC version of the Chrome browser. But apps on android need to have specific support for it. Spotify, for instance, doesn't have Chromecast support. That means you can stream from a laptop running spotify through your browser, but you can't stream through your phone, yet.", "verified": true, "helpfulness": "0/0", "author": "Jonathan C Perry"}, {"rating": 5.0, "review": "Worked just as described! Plugged it in, followed the easy-to-follow setup and was watching movies within minutes!I just might order another for the \"man-cave\".", "verified": true, "helpfulness": "0/0", "author": "IndyJohn \"JAM\""}, {"rating": 5.0, "review": "This product does what it says it can do, and I can't be any more satisfied with it. It streams my media perfectly (and this depends on your internet connection, but considering I don't have that much speed, it's pretty good). Using my mobile phone as a remote control is so ingenious and I love it.If you wish a low cost media streaming device with a handful of applications to stream said media, this is your device.", "verified": true, "helpfulness": "0/0", "author": "Carlos J Lopez Melero"}, {"rating": 1.0, "review": "Inadequate instructions made this impossible to connect. I spent half a day trying to connect and it kept telling me I needed a password.", "verified": true, "helpfulness": "1/2", "author": "dtellstarr \"Diana\""}, {"rating": 5.0, "review": "This is such a great inexpensive streaming tool to have. We bought a second one because we like it so much!", "verified": true, "helpfulness": "0/0", "author": "Kathryn Walenty"}, {"rating": 2.0, "review": "When I first purchased it, I was excited by the commercials that suggested that my iPad Chrome browser could send web pages to my TV. So that, for example I could read my email on my TV screen, or surf the web on my TV. It turns out, that that many of the features do not work with the iPad app, but, only with a laptop/desktop computer. Hopefully, this can be fixed with a future APP for the ipad/ipod. The small size is a plus, and at least it still works with Netflix, and a few other services....", "verified": true, "helpfulness": "0/0", "author": "Don"}]