[{"rating": 5.0, "review": "Am enjoying the Amazon Fire TV. It is easy to install and easy to use. I would recommend it!", "verified": true, "helpfulness": "0/0", "author": "Cherie \"Cherie\""}, {"rating": 5.0, "review": "Awesome and simple to use.", "verified": true, "helpfulness": "0/0", "author": "scott thompson"}, {"rating": 5.0, "review": "I like it so much that I'm afraid I now watch too much TV. The picture is very good and I love being able to watch Amazon Prime on my tv. It's very easy to use and the remote works well.", "verified": true, "helpfulness": "0/0", "author": "H. Carole Reinstadtler"}, {"rating": 5.0, "review": "I love these.  I'm a big Apple fan but like these a little more.  This one you can side load very easy so I was able to add Kodi and other apps to make it what I want it to be and do.  Slowly getting more as gifts.  They are great!  I enjoy the fact that I can now watch Amazon Prime, Kodi, YouTube, etc. Possibilities are endless.  I have Apple TV, Google Logitech and now Fire TV.  Fire is my favorite.", "verified": true, "helpfulness": "0/0", "author": "dream4more(Carol)"}, {"rating": 5.0, "review": "I have not had mine for very long.  It was easy hook-up and set-up, as well.  The first movie I watched displayed one of the best pictures I have seen on my TV!  It is quite small and takes up very little space.  The voice command is fun to use and works well!", "verified": true, "helpfulness": "0/0", "author": "Karen T \"Southern Lady\""}, {"rating": 2.0, "review": "Most everything then is pay as you go, unless the word prime is in front of it, your going to pay extra to view it.My box black out quite often for few seconds at a time and returns again, it maybe paused so you half to hitplay to get it working again. Will say voice call out part is nice.But really save your money and just hook your pc to your TV, that's what I finally did, you can see everythingprime has to offer that and save the cost of the box.", "verified": true, "helpfulness": "0/1", "author": "bigfoot584"}, {"rating": 5.0, "review": "Good device fast and easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great when you have Prime. It is so easy to select from the thousands of tv shows and movies. I started downloading the fire TV games and it was great playing them on the big screen tv. I was able to use our xbox 360 controller with the games. Love the Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "bobd"}, {"rating": 5.0, "review": "Great addition to our TV, went to an antenna a couple years ago because we were unhappy with the ever increasing price of our satellite service.", "verified": true, "helpfulness": "0/0", "author": "Christine P"}, {"rating": 1.0, "review": "I love Amazon, however the Amazon Fire TV was a huge disappointment.  Not enough Apps & it only had 3 of the apps I use... Netflix, Prime & Hulu.  I took the Amazon Fire back & bought another Roku, it has All my apps.  Hopefully Amazon Fire improves.  Whenever it gets better I will buy it but until then I'll just keep both of my Roku's.", "verified": true, "helpfulness": "1/2", "author": "S. Moore"}]