[{"rating": 5.0, "review": "Excellent product- ditch cable!", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 1.0, "review": "I received it as a gift.  I'm sending it back.  It doesn't work with Google's own products.  Yes, it and stream Netflix and YouTube, but that's about it.  I have it on my laptop and on my ipad.  First, it doesn't work well (or at all) with Google Hangouts.  If you are Chromecasting and someone calls you on a Hangout, that opens in a new window which doesn't have the Chromecast extension button on it.  I found a post online that said you could set up (from the Hangouts page -- NOT from the Hangout icon), then, once you've set that up, you copy that url into a tab on your chrome browser then make the Hangout call.  That's a lot of extra work to go through just to do a Google Hangout.  When I did this, the sound from the party I was calling didn't work (even though it did work when I called them through a regular Google Hangout window).On the iPad, it's worse.  I downloaded Chrome for the iPad, but the Google extension doesn't go to the Chrome Browser on the iPad.  The only thing I can get it to work with on the iPad is YouTube.  Google Hangouts on the iPad don't work with it either.Why would Google make a product that doesn't work with its own products and app?  I don't see what everyone is so excited about.  It is hugely disappointing and limited.", "verified": false, "helpfulness": "0/1", "author": "S Patterson"}, {"rating": 5.0, "review": "The best web for TV", "verified": true, "helpfulness": "0/0", "author": "José Diniz Gonçalves"}, {"rating": 5.0, "review": "Worth it!", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 4.0, "review": "It works flawlessly for things that explicitly support it like Netflix. So-so for everything else.", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 3.0, "review": "I can't get this to work", "verified": true, "helpfulness": "0/0", "author": "RBR"}, {"rating": 2.0, "review": "Very difficult to use. The USB port does not see to do anything. There are better products out there", "verified": true, "helpfulness": "0/0", "author": "Walter Prochorenko"}, {"rating": 2.0, "review": "There is a reason this thing is cheap. The quality is very poor when blown up on a projector. On a small TV not so noticeable but on my projector the colors look just terrible. I have had both the roku box and the apple TV and they looked great on the same equipment.I wanted something to cast videos from my computer aka \"google cast\". This was the only reason I purchased this product since I could already access netfilx and amazon on my Playstation. (Gave my Roku and Apple TV to my parents). When I tried to play something using the google cast on chrome browser, it would play for a second or two then stop and go. Very slow, and then the video would just stop and only sound coming out. I thought maybe wifi is not fast enough so I connected my computer via an Ethernet cable. This didn't make anything better. Did a quick google search and apparently everyone is having this problem and its not just me or my device.I usually stay away from apple products but they have done a great job with the apple tv. I can use any IOS device to cast anything playing in the ipad or iphone without any issues. This has been out for years now so nothing new.I would rather pay more money and get a device that actually functions.", "verified": true, "helpfulness": "0/0", "author": "Artin64"}, {"rating": 3.0, "review": "I want to like this more than I do. The quality of the cast is poor. No other way to put it.", "verified": true, "helpfulness": "0/0", "author": "Bobby Stephens"}, {"rating": 5.0, "review": "Excellent product and price!!!", "verified": true, "helpfulness": "0/0", "author": "kevin choi"}]