[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Iván Falletti"}, {"rating": 5.0, "review": "Love this - me and my son can watch Netflix on the TV without moving the xbox - can cast movies, photos, music from tablets or phones with no issue.The native Chromecast program is probably the worst app for it (AllCast and LocalCast are better imho) but great technology.", "verified": true, "helpfulness": "0/0", "author": "Paligap"}, {"rating": 4.0, "review": "This works great and we can take it with us or move it from TV to TV in the home.", "verified": true, "helpfulness": "1/1", "author": "Dennis Ayer"}, {"rating": 3.0, "review": "Does what it ment to do. Nothing beyond that.There are better options around, like Roku Player", "verified": true, "helpfulness": "1/1", "author": "SamambaMan"}, {"rating": 5.0, "review": "Love this. We watch Netflix a lot using this device. I also love the new \"cast your screen\" feature for my Samsung Galaxy S5. A nice way to show your pics or play games on you phone while casting them to your TV.", "verified": true, "helpfulness": "1/1", "author": "graywolf201"}, {"rating": 1.0, "review": "Chromecast would be awesome if it actually worked with anything I wanted to use it with. It doesn't support iTunes movies or amazon prime instant video. I know this isn't Google's fault, but it makes chromecast completely useless to me.", "verified": false, "helpfulness": "1/1", "author": "Luke Utterback"}, {"rating": 2.0, "review": "I \"cut the cord\" with cable subscription years ago, and since then I watch everything at my PC.  I have Hulu Plus, Amazon Instant Video, Youtube subscriptions, and a collection of old movies and archived shows on my PC.So, when I decided to move things back into the living room and buy a new HDTV, I didn't have to think twice about buying a Chromecast -- it's cheap, small, and I can stream anything on my Chrome browser right to it.  But after a long struggle with extreme video choppiness, and after trying solutions one after another, I'm giving up.The Hulu app isn't supported on my (admittedly very old) smartphone, so my only option to get Hulu Plus to the Chromecast was with the \"cast this tab\" feature.  Google is very upfront about the Chrome browser tab feature being \"BETA\" so I expected some hiccups.  But setup was a breeze, Chrome extensions were easy to install, and the very first stream of a Hulu video through the \"cast this tab\" feature worked great.My next cast, a couple hours later, wasn't so great.  After enduring a minute of poor video quality, the cast stopped entirely for a few seconds, caught up, then did it again, never to recover.  I lowered the casting quality, rebooted my PC, and no change.  I rebooted the TV and the Chromecast device.  I tried watching different videos on other sites and encountered the same problem.  I fiddled with more settings, ran my trusty task killer program (an old version of GameBooster) to optimize streaming, but there was still no vast improvement in quality.Be aware, a VERY small number of video apps are supported to cast through the device at 1080p (YouTube, Netflix, Google Play).  The Chromecast handles these streams itself, taking the load off your CPU.  The YouTube app worked fine for me here, though the quality wasn't great, but in comparison to the un-watchable Chrome browser casting it was much better.  So, the Chromecast is getting good WiFi signal and the router is doing its job.  I'm left to assume that my PC just isn't capable of streaming video to the Chromecast, even at low quality.  Casting a tab requires a massive amount of processing power, and while my computer is quite old, its specs can still beat some newer mid-tier laptops.So, I don't really know about this Chromecast hype.  It didn't really work for me.  I wanted it for YouTube, Hulu Plus, and Amazon Instant video -- pretty basic stuff, right?  But it has poor app support, and Chrome browser casting hasn't come out of BETA since launch last year.  If you have all the latest tech and like to fiddle around for hours, connecting devices and trying out new apps, it might be worth the price.  To those with older PCs and devices, go for an all-in-one streaming box with a dedicated remote, like the Roku 3.  Just to avoid the hassle with this device, the Roku will be worth the higher price tag.", "verified": false, "helpfulness": "1/1", "author": "William G."}, {"rating": 5.0, "review": "Love this simple device!  HD wireless stream audio and video from phone, tablet, or computer! Amazing! Use this so much! Great buy, well worth $35! Get it and love it too!", "verified": true, "helpfulness": "1/1", "author": "WanderingK1ng \"A 21st century nomad\""}, {"rating": 5.0, "review": "LOVE this. I use chromecast all the time! I mostly use it for streaming pandora through my tv. Love, love, love it.", "verified": true, "helpfulness": "1/1", "author": "ashnicole"}, {"rating": 5.0, "review": "Got it for my husband for x-mas. We love it! Works reliably if you use it with the apps.", "verified": true, "helpfulness": "1/1", "author": "Dog Mommy"}]