[{"rating": 5.0, "review": "I subscribe to Netflix and watch a lot of contents from Youtube.  Great gadget and great technology at a great price.", "verified": true, "helpfulness": "0/0", "author": "John Mei"}, {"rating": 5.0, "review": "Good buy", "verified": true, "helpfulness": "0/0", "author": "trouble"}, {"rating": 5.0, "review": "I LOVE CHROMECAST. If you're questioning about buying this, just get it. You won't regret it.", "verified": false, "helpfulness": "0/0", "author": "Erin C. Kadzis"}, {"rating": 4.0, "review": "Great product! Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jason Blonigen"}, {"rating": 1.0, "review": "Does not keep up! Thought maybe it was my phone, nope does it on the iPad and laptop! Haven't been able to use it! I like catching up on shoes and instead of watching them from my laptop I was excited to be able to just watch on my TV. They just stutter or slow down and barley play smoothly! Bummer!", "verified": true, "helpfulness": "0/2", "author": "Alexander A. White"}, {"rating": 5.0, "review": "This is the nicest little toy i have bought in a long time!  It is easy to install, comes with it's own antennae for extended reach, and has a tiny reset button if Comcast glitches.  Its programming is easy to install, quite small and quick, and the instructions come with diagrams.  I have been very happy with it!  It does require an outlet, preferably on a surge protector.", "verified": true, "helpfulness": "0/0", "author": "happy camper"}, {"rating": 5.0, "review": "This thing is great. You can stream video to your TV from a bunch of different apps on your Android phone or tablet, iPhone and iPad as well. You don't really need it if you already have a Roku box or Apple TV since they basically stream the same content. The biggest benefit of the Chromecast that the Roku and Apple TV can't do is stream anything from a chrome browser on your computer. Download the Chromecast extension to your Chrome browser and you can stream any tab to your TV. Sound is trasferred as well", "verified": true, "helpfulness": "0/0", "author": "Eduardo Hidalgo \"Bolon 50\""}, {"rating": 5.0, "review": "Works great and a good value.", "verified": true, "helpfulness": "0/0", "author": "John Scott"}, {"rating": 2.0, "review": "Very poor quality picture and sound. Wish I had done more research before I purchased.", "verified": false, "helpfulness": "0/0", "author": "MatterOfFact"}, {"rating": 5.0, "review": "ok good", "verified": true, "helpfulness": "0/0", "author": "Jamal Said \"Joel\""}]