[{"rating": 1.0, "review": "I had some problems setting it up and the Google support staff was not helpful.  I eventually figured it out myself.", "verified": true, "helpfulness": "1/3", "author": "Joel Kolko"}, {"rating": 1.0, "review": "Save your money and buy a roko!I thought this would just pick up the wifi in my house. Very in convenient.", "verified": true, "helpfulness": "1/3", "author": "Gregory Chetwynd"}, {"rating": 5.0, "review": "I gave two of these for Christmas gifts. Both were well received and appreciated. They are both going to be well used.", "verified": true, "helpfulness": "0/0", "author": "Addicted Online Shopper \"alwaysbrowsing\""}, {"rating": 3.0, "review": "I don't regret purchasing Chromecast because you can't beat the price, but I was expecting better quality from a Google product. I can get it to work after a little bit of playing around with the HDMI channels (sometimes upwards of 10 minutes of fiddling), however I expected it to be easy to use out of the package. I'm sure this is partially due to my older router, but that was the point of buying it, to work on a non-smart tv. Once it does work though, it's great, satisfied my House of Cards binge watching.", "verified": true, "helpfulness": "0/1", "author": "Marissa"}, {"rating": 2.0, "review": "i didn't know how to let it work its complicated it run what you see in chrome browser only  i didn't like it", "verified": true, "helpfulness": "0/0", "author": "SHAIKHA alraqem"}, {"rating": 5.0, "review": "We had an off brand Roku-like-but-not setup on the kitchen TV.  While the CHROMECAST doesn't pull as many services (Amazon Instant, in  particular, is a glaring omission), for Netflix (my primary use), it is great.  Works without fail.  So cheap.", "verified": true, "helpfulness": "0/1", "author": "Charlie V"}, {"rating": 1.0, "review": "I purchased this item from Amazon based on the reviews.  This item was a total waste of money.  It never operated properly.  A new router was purchased and my internet service was upgraded.  I even downloaded the Chromecast software update.  The gadget always failed to be located.  It often would switch my HDMI to Chromecast in the middle of television shows that I was watching.  The chromecast would appear on visitors  smartphones as a wireless option uninvited.  A major concern for privacy to others.  The worst money ever spent.  I no longer trust Google and have uninstalled all of it's features from my computer.  I have even had a couple of my \"computer geek\" friends come to check out the problem.  All have agreed...it is a total piece of JUNK!  Buyer beware!!", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer \"Night time reader\""}, {"rating": 5.0, "review": "This thing is AWESOME!!! It works on my tv and my sons .. He is in love with thing I am thinking of buying another one!!", "verified": true, "helpfulness": "1/1", "author": "KJ_OH"}, {"rating": 5.0, "review": "5 stars means perfection, there's work to be done to improve this device but I'm happy to be along for the ride as the technology advances. Sending Netflix from my phone to my tv and the quality being so great is mind blowing, I love this things?", "verified": true, "helpfulness": "0/0", "author": "Ryan McClintock"}, {"rating": 1.0, "review": "Wouldn't a much more effective way to connect a computer to your TV be PLUGGING YOU COMPUTER INTO THE TV VIA HDMI?? Why the hell do we have to \"Cast\"or as I like to call it, stream wirelessly? Plug in the Computer to the TV via HDMI and you can \"stream\" all you want for about the cost of an HDMI cord. But you probably already have a few of those lying around.", "verified": false, "helpfulness": "0/3", "author": "Justin Kesner"}]