[{"rating": 5.0, "review": "That's good and bad. I like the Apple TV because I can stream directly off my iPad. I realize, though, that these are two competing operating systems. And this is less than 1/2 the cost of the Apple TV. Great item! I have two in my house along with the Apple TV and use these more. Plus it compensates for my smart TV's actually being a very stupid TV. Nothing ever works well with that feature. What gives?", "verified": true, "helpfulness": "0/0", "author": "Brian Richardson"}, {"rating": 5.0, "review": "Bought it for my husband for Christmas and he loved it , so bought 3 more as gifts! I'm sure they will like it also", "verified": true, "helpfulness": "0/0", "author": "J. Frey"}, {"rating": 1.0, "review": "This product is limited, slow and a waste of your money....do not get it. We bought this because using YouTube on our TV was a drag; clicking and clicking search info was a drag. The Chromecast seemed like a good idea but trying to watch a film from YouTube was extremely frustrating: it was slow, kept cutting out, the communication between the device and the laptop kept cutting out. The set-up was also difficult. There are no real instructions for getting the device up and running. Its too frustrating to even write about it, just forget it and look at other options. Its just a quick way for Google or who ever is making it, to make a quick buck on something you may use once or twice before tossing out or giving away. We are very unhappy with this purchase.", "verified": true, "helpfulness": "2/3", "author": "KimmerO"}, {"rating": 5.0, "review": "can stream all your media to the tv with no problems. easy set up easy to use. best way to stream to tv", "verified": true, "helpfulness": "0/0", "author": "brad anderson"}, {"rating": 2.0, "review": "Videos are jerky... I have 10 mps dsl and netgear DGN3500 wireless modem router...works great to make your TV a monitor for net surfing... streaming video, not so much...", "verified": true, "helpfulness": "0/0", "author": "david m. sherbula"}, {"rating": 2.0, "review": "Ad says just plug it into your TV. Need a second device to stream Netflix or others to the TV and not just from WIFI", "verified": true, "helpfulness": "0/0", "author": "Stephen Baxter"}, {"rating": 5.0, "review": "I highly recommend Chromecsst for anyone that does not have a game system or other device to watch Netflix. Overall a great buy for so cheap.", "verified": true, "helpfulness": "0/0", "author": "Bobby Rose"}, {"rating": 5.0, "review": "When you want to watch or share a video or app from your smart phone or tablet, this device allows you to do it on a large format TV so you can see more detail or enjoy it with others.  A little cumbersome to get connected, but once done, you take the device with you and plug in to any HDMI port for large screen display of your content.  Excellent product for a low price.", "verified": true, "helpfulness": "0/0", "author": "murcus"}, {"rating": 4.0, "review": "There is a lot of potential with the chromecast, There are some rough edges though that need to be fixed before it's becomes a go to device.", "verified": true, "helpfulness": "0/0", "author": "Kent"}, {"rating": 4.0, "review": "I'm loving Netflix so far. I'm not very techy, but hopefully Chromecast will have more variety for it's users soon.", "verified": true, "helpfulness": "0/0", "author": "Tyffany"}]