[{"rating": 5.0, "review": "Very good piece of electronic equipment  very fast", "verified": true, "helpfulness": "0/0", "author": "J. F. Thompson"}, {"rating": 4.0, "review": "Even though I'm a power user when it comes to PCs and electronic gadgets, I've really only been regularly streaming shows since last summer.  It seems like there's been an explosion of real shows just recently getting released on unusual distribution methods.  For example, the NBC show Community was canceled after last season...and Yahoo of all things picked it up for another season!  Netflix has a ton of shows, many of them well regarded, and has a whole deal with Marvel for several connected shows.  Amazon, Hulu, and Crackle have original shows too.  The show 'Powers' just debuted on the Playstation Network...the online service for Playstation consoles, and this was a show originally being produced for the cable network FX!  For the first time ever, I've also had trouble grabbing all the broadcast shows I want even between my two Tivos, so I've been stuck regularly supplementing my Tivos with Hulu service (which specializes in first run shows from (especially) the major TV networks, plus other content).Point being, while I haven't used this stuff regularly until last year, it seems like it's really exploding in terms of real content available, and the ease of actually accessing it.There are a lot of ways to stream content, including game systems and some newer TVs that have built in \"app\" support.  I'm not really a fan of having this stuff built in to the TV, given that this is so new and is being updated constantly-tying it to a device you'll hopefully use for years doesn't seem useful to me.  From everything I've read, the \"apps\" built in to TVs just tend to be flakier and slower than what you can do in a stand alone device.The game systems obviously have the power to run this kind of thing well, but I ended up buying a separate box both because that way I can have a game running and switch over to a show without having to find a save spot in the game, and also because they use a lot less power.I started with buying a Roku 1.  My main problem with it is it just isn't stable...It seems like it would lock up on me every roughly 2 hours worth of video.  From what I've read, the Roku 3 is also unstable, though I haven't personally used one.  The Roku 1 and 2 are also a bit slow on some video services (Roku 3's hardware is higher end than 1 and 2).Roku has one big thing going for it-the absolute most comprehensive list of supported video services.  Fire TV has a lot, but is still missing some.  Like the aforementioned Community needs the \"Yahoo Screen\" app...which isn't available for Fire TV, at least not yet.  (I hope that changes soon as I really do want to watch that show...)  Impressively though that new SlingTV service has been available on both Roku and FireTV from day one.The Roku 1 and 2 also have at least some limited analog output support, though unfortunately only in SD...they might be appropriate for an older SD TV though.Apple's Apple TV might make sense for some people super tied in to Apple's ecosystem, but IMO it's a non-starter.  I think the basic three video services you'd better support if you're making a box like this are Netflix, Hulu, and Amazon Prime (Crackle too, as while it's not as comprehensive as those, it's no joke, completely free, and is starting to have more and more original content too).Game systems have all those, Roku has all those, and FireTV has all those...but AppleTV is missing Amazon Prime, which is just completely unacceptable to me.Google's \"Chromecast\" is just ridiculous, as it has very few channels it supports, and it has no interface at all, and no remote-it's impossible to use except in conjunction with a supported tablet or phone.  The idea of a device like this with no menu interface and no remote control support is just ludicrous to me.  These boxes are small anyway, and I'm not a fan of the \"stick\"  versions where the whole device plugs in to an HDMI port, but if you must have a \"stick\" device, get Amazon or Roku's models (though I'd still say buy the more full featured \"box\" models instead...but at least the Amazon/Roku sticks are more full featured than a Chromecast!)FireTV doesn't have as comprehensive support for various video services as Roku, but it's still pretty comprehensive.  For myself personally right now, Yahoo Screen is the only thing it's missing (as of April 2015).  It's worth mentioning that while it has Youtube support, I'm unclear on who's actually providing it.  The app LOOKS like official (same interface as on my Roku and Playstation 3), and is even listed on Amazon's FireTV page as though it's an official app, but it doesn't seem to actually be made by Google.  As such I've vaguely nervous about it, and while I have it paired with my iPad so I can find stuff on the iPad and then switch to playing it on the TV, I haven't ever entered my Google credentials, just in case...  I'm guessing it's Amazon providing basically a link to a specialized Youtube web page, but I'm not sure.Everything else I've used though seems official.So...about the FireTV.  One of its marketing points is that it's the most powerful streaming box.  The hardware is basically like a high-end Android phone circa two years ago (slightly less powerful than today's high end phones).  As such it massively outclasses both the Roku units (including the 3) and the AppleTV, and probably all streaming stuff built in to TVs.  It's got 4x the RAM that other boxes typically have, and 8x more than some of them do.  It's got way more CPU and GPU than other boxes do.  It's still wimpy next to a 10 year old Xbox 360, but still, I appreciate that unlike everyone else, Amazon is actually trying to put some solid hardware in here.And the better hardware is noticeable.  Like on Roku, some \"apps\" run noticeably slow.  On FireTV they run full speed, same as on my Playstation 3.  It's able to present things more pleasantly too, with transparencies, more elegant transitions, etc.  At least with Amazon Prime content, it does a good job using the extra RAM to leave video in its cache so you can jump backwards further.  On every other device I've tried, you can maybe jump back once before it has to load video.  On FireTV (with Prime content), I can usually jump back multiple times before it has to reload.  That's something I do quite a bit, if I missed a bit of dialog or a detail or whatever, so I really appreciate it.Unfortunately other than running the apps at full speed, other video services don't seem to benefit as much from the higher specs, like Hulu and Crackle still have to recache when you jump backwards...but still, they work well, and unlike some other boxes, you can scroll through their interfaces quickly.Reviews usually point out that the FireTV is Amazon-centric...that's true, but probably less annoying than that sounds.  Like if you do a search through Amazon's menu system, the content it shows you is from Amazon, but impressively the search results also show you if it's available on other services...I'm not sure how many other services are included with that, but after installing Hulu and Crackle, the first choice for watching a show will actually be for Hulu or Crackle of those have it free while it's a paid option through Amazon.  Given obviously Amazon would like to rent you the show, I'm really impressed that they'd show you that it's free through another service.  Click that, and it'll (for example) launch Hulu and load up the screen for the show.Normally though when using something other than Amazon Prime, you'd first load the 'app' for the video service you want-Hulu, Crackle, Netflix, whatever.  From that point you're in their interface like normal until you hit home and go back to the main Amazon interface.  Programs like Hulu show up in your \"recent\" list just like Amazon prime content does (maybe a little weird, but it works well enough).Voice search (available with the more expensive remote included with the FireTV box but not stick) actually works very reliably and I do use it from time to time.  I have found that sometimes it just won't launch, and I have to reboot the box to get it back (hold down the center button + Play to reboot...and it boots much faster than my Roku too, which is another advantage to fast hardware).When playing Amazon content the remote works very well.  Unlike Roku (and my Tivo) it lacks a dedicated \"jump back\" button, which sounds lame, except that it actually uses the normal rewind button as jump back.  You have to hold it down to start rewinding instead.  That's great, given I use jump back all the time.  As mentioned, with Amazon content jump back works WAY better than other streaming devices I've used.  I don't remember how many times you can jump back without it recaching, but I'd say maybe as much as a half minute?  Maybe more?The interface is straight forward, and while it apparently didn't launch last year with this, the interface now lets you separate out free Prime content from paid content.  I.e. you can see lists of \"recently added Prime shows/recently added Prime movies\".  (And while it's far from comprehensive, Prime does have a heck of a lot of great content...I've watched several movies from 2014 and 2013 that I had actually wanted to see in the theater.)  It might be easy however to accidentally pay money for content as a show may for example say \"Watch now with Amazon Prime, Watch now with Hulu, buy for $2.99\"...I could see maybe less technical users or kids or something getting confused and accidentally spending money.  I mean the interface is straight forward and it tells you what you're doing, but still it might be confusing that pay options are available too on all the prime content.A minor complaint with Prime video is it has a tendency both when I watch it through a browser on my PC, and on the FireTV to start out with a low quality version of the stream, and take maybe 30-60 seconds to decide to bump up to full quality.  I'd personally rather it just cached longer.Amazon talks about a FireTV feature where it supposedly knows what you're going to watch and precaches stuff...not exactly sure how that works, but for example when I start a new episode of The Good Wife, it starts instantly in HD, then tends to drop down to a lower quality stream, then tends to hit HD again after a minute.  It just seems to be a quirk with Amazon's video services, but still it mostly looks very good, and from what I've read Amazon uses higher bit rates than most other video streaming services.So, this isn't the FireTV's fault, but one annoyance is that all of these different streaming services have different interfaces, which can be at least a bit confusing...and I don't really see how Amazon or anyone else could get around that, as long as the different services work differently.Like I use Hulu a lot, and while I think both Prime content and the Hulu app are straight forward, they don't work completely the same way.  The menus and how you put shows in your queue to watch later are different.  Even basic things while watching a show aren't identical.  Tapping the rewind button in prime content makes it jump back, but to do that in Hulu you have to instead press the back button, and then hit the center button.  (My Roku handled this a bit better, as it's explicit \"jump back\" button also seemed to work in other video services.)  Some video services the center button might pause the video, others it may bring up more information.  I've occasionally screwed up and had to load back into a video after pressing the button that would work in a different video service, but does something totally different in the one I'm in.But again, all of that is mostly just a function of trying to get one box to handle a bunch of completely separate services, and not  Amazon's fault.  Mostly the FireTV handles everything it does well.Last thing I'll mention...games.  As a side effect of having better hardware, the FireTV is also in the best position to run games, and Amazon promotes that, and even has a specific controller available for it.  I got the bundle that includes that controller, and I actually think the controller is pretty good, and I appreciate that it uses standard batteries, nothing proprietary, nothing sealed.Compared to what Roku or Apple have, this is a great game system...most of what they have is garbage, but there's actually some real games mixed in there too.  Some older games from Sega, some modern Telltale games, etc.  That said, you can only download them, and both the hardware and available games are just terrible compared to a PC or dedicated game system.  The Xbox 360/Playstation 3 from 2005/2006 are still much more powerful (much less the Playstation 3/Xbox One from 2013!), and have vastly bigger, better libraries (that you can actually own on disc too).  So...by streaming box standards it's an awesome game system.  If I was forced to, I could absolutely find at least a handful of games on it.  BUT I'd really recommend just buying a dedicated game system or playing on PC and skipping that feature...though still, if it's the difference between someone buying Telltale's The Walking Dead on a FireTV, or not playing it at all, hey, I'm glad more people might be exposed to games through this!I didn't mention this previously-the remotes use Bluetooth rather than IR to connect.  I was a little iffy about that, but battery life still seems to be good, and they seem to \"wake up\" pretty fast, and hopefully we're not all going to die from all these RF radios in everything :)  At least Bluetooth seems to make a lot  more sense than using Wifi for a remote like the Roku 3 does, since Bluetooth is lower powered than Wifi, and Bluetooth still provides WAY more bandwidth than a remote needs.  (Roku 1 uses IR exclusively, Roku 2 can use IR or Wifi remotes, if I'm remembering right.  Roku 2 and 3 let you plug a headphone into a wifi remote, though FireTV recently added the ability to use Bluetooth headphones)So...I guess my main complaint with the FireTV is just that its list of video services, while growing and while it includes the main ones, still isn't as comprehensive as Roku.  Otherwise FireTV's hardware is good compared to other streaming boxes, the interface(s) are good.  The remote's pretty good, and the software's pretty stable/bug free (if not quite 100% so).From what I've used/read, I think FireTV is a safe choice if you're looking in to streaming...I really think it's probably the best \"default\" choice right now, or at least one of the two main ones you should look at, along with Roku's products.", "verified": true, "helpfulness": "4/5", "author": "WolfPup"}, {"rating": 3.0, "review": "Needs more selections of movies and TV shows", "verified": true, "helpfulness": "0/0", "author": "David Willrodt"}, {"rating": 1.0, "review": "It is constantly freezing during shows/movies. I do not have this issue with my roku", "verified": true, "helpfulness": "2/3", "author": "Christine Cox"}, {"rating": 5.0, "review": "Seriously haven't watched traditional TV much at all since I got my Amazon TV. It's everything a streaming media device should be...fast to setup, easy to use, and backed by Amazon and their amazing customer service. Paired with my prime membership, this is a 10!", "verified": false, "helpfulness": "0/0", "author": "Dorothy Elliott"}, {"rating": 5.0, "review": "I love it😊", "verified": true, "helpfulness": "0/0", "author": "DAVIS"}, {"rating": 5.0, "review": "I was hesitant to buy this because I have a chromecast. But there was a great deal on slingTV which allows me to watch HGTV and the Food Network and it came with a great deal on the FireTV. I have to say I LOVE this product. It very easy to use and navigate. Will all the free Amazon Prime movies, tv and music it makes it a pretty power little device. I highly recommend it. I have just ordered the gaming remote because there are some fun easy time killing games I am eager to try out.", "verified": true, "helpfulness": "1/1", "author": "JennyZink"}, {"rating": 5.0, "review": "Better than my Apple TV", "verified": true, "helpfulness": "0/0", "author": "NCWA"}, {"rating": 5.0, "review": "Works just like new.", "verified": true, "helpfulness": "0/0", "author": "James Pond"}, {"rating": 5.0, "review": "We are extremely happy with our purchase! The only regret is that we didn't purchase it when it was on sale :( But it's the BEST little viewer out there ... I love our Amazon Fire TV, and the 'voice search' feature rocks!", "verified": true, "helpfulness": "0/0", "author": "Reiki Nurse"}]