[{"rating": 5.0, "review": "Awesome sums it up!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jason W. Moore \"mor25us\""}, {"rating": 2.0, "review": "Wack", "verified": true, "helpfulness": "0/5", "author": "Aisat I. Olarinde"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "openender"}, {"rating": 5.0, "review": "Certainly one of the nicest Christmas Gifts we have received.  This gives us a great deal of pleasure in the evening.", "verified": true, "helpfulness": "0/0", "author": "margaret melnick"}, {"rating": 4.0, "review": "Love the Amazon TV!!the only thing holding me back from 5/5 stars is the search function.  I may be old-fashioned, but I miss being able to type in letters and have suggestions populate a scroll down bar.  The voice search is very close to making me not miss the 'keyboard' function though - it is very cool.", "verified": true, "helpfulness": "0/0", "author": "Keri Dowling"}, {"rating": 2.0, "review": "USB Port is useless, I was told with updates you would gain function like playing videos, but that was 6 months ago and I'm still unable to play my personal videos on my Fire Tv.  I know updates have been released since then and this function has not been enabled. I had to reconnect my old WD media player back so now I have two connected to my TV. I'm very unhappy about this and the delay and don't see the point of having this box.The box has been very disappointing. I purchased the video game controller thinking I could play games on it but since I can increase the very limited memory on it. 2 gigs sounds like a lot but after you do basic setup your capacity is almost full. All the games I purchased to play can't even be downloaded unless I erase all current content and who wants to do that??? I'm going to look into returning it since I don't see any further development of the product. I may have purchased this product too soon in development stage. I won't make the same mistake with the echo purchase invite I received today.", "verified": true, "helpfulness": "0/2", "author": "Power-On-PC"}, {"rating": 5.0, "review": "Has worked great so far. For the most part the Fire TV is a great product. Nice watching HD movies and TV on TV instead of on a tablet. I love how each TV show plays one after the other, for the most part. Sometimes for no reason I can figure the playback stops and does not continue on to the next episode but that has happened only a couple of times, it beats having to select each episode to start after the last one was done.Some of the apps are good but some are annoying having to register them to get them to work, unlike on a tablet where there is no need to register to get it to work. I did have some apps that seemed to buffer often, that is a problem with the app and not the Fire TV and those apps I deleted immediately. As long as you have a fast internet connection you will be fine. If there is a problem with buffering it could well be the app and not the internet connection or the Fire TV, if only one app buffers a lot then most likely the app is to blame.Downside:The game controller is expensive. It would be nice to have an easier way to connect more third party bluetooth controllers like the PS3 controller instead of using the Amazon controller, or Xbox controller.There needs to be an easier way to select what songs are available in the library that are available on the Fire TV. The instructions on the website are not correct and the only way I could get some songs I didn't want on my Fire TV was to delete them from my library, which permanently removed them so I could not download them again if I wanted too. Would be nice to be able to select and adjust the songs directly on the Fire TV but that is not possible at this moment, you have to on your amazon account, even then I could not find a way to select the songs even following the instructions.No HDMI cable included which would be nice considering the cost of the Fire TV, but one can be bought for cheap, that is if a person doesn't have one available.", "verified": true, "helpfulness": "0/0", "author": "Book Reader"}, {"rating": 5.0, "review": "Low price...access to everything (Netflix,hula plus etc).  Great movies  , games, great everything free through Amazon prime.  Cannot ask for more. I do not seem to be able to get off it. Recommend highly.", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 5.0, "review": "Everything I expected and more \" LOVE IT\"", "verified": true, "helpfulness": "0/0", "author": "j napieracz"}, {"rating": 5.0, "review": "We bought this unit to install on our older 2006 Sony 50\" Plasma (which had 1 HDMI port) and it worked perfectly. The Fire TV box requires an a/c outlet for 110v (regular wall outlet) and a HDMI cable that plugs into your TV. (I can't remember if the Fire TV came with a HDMI cable or not) This Fire box has opened a whole new viewing experience for my wife & I and we have since cancelled our Direct TV subscription. The controller that comes with the Fire TV ONLY controls the Fire TV box and is only needed to initially setup up your Fire TV to your TV, setup your online acc'ts etc. Once that initial setup is complete, you WILL only need either a Harmony controller (which is what we have) or your original controller that came with your TV to navigate your TV through all the new different programs you have. Of course you need a good internet connection and a good WIFI hub to send the signal to the Fire TV box or you can hardwired it with ethernet cable. We choose WIFI. There's a lot of additional info on the web on how to hook this type of system up. BTW...I also recommend you buy a exterior TV antenna, mount it outside, then run coaxial cable up through the attic and down to your TV and you'll have all your local channels for FREE and in beautiful HD that is twice the resolution that you get from Cable companies. This is the way TV viewing is headed in droves and once you cut your cable company that has been robbing us for years and forcing us into contracts, you'll wish you had done this long ago.", "verified": true, "helpfulness": "0/0", "author": "M. Jordan"}]