[{"rating": 5.0, "review": "Amazed at the processor smoothness. Also ease to find movies or programs with voice over the remote control. Absolutely love that little box. Thx Amazon for your invention.", "verified": true, "helpfulness": "0/0", "author": "Oscar O Guerrero"}, {"rating": 4.0, "review": "It seems to perform well but there were no instructions for set up when you have a surround sound system ( and I think there are lots of users out there who do).  It took several hours of muddling around and a whole other cable the instructions don't addresss to make it work. If only there were more detailed instructions out there either on paper or on a website I would have been willing to give it five stars. As it is we almost gave up and sent it back before lucking up on the right combo of connections by trial and error. Really?  How hard would it be to put more info out there?", "verified": true, "helpfulness": "0/0", "author": "Grayson Cannon"}, {"rating": 5.0, "review": "I have no idea how we lived without it", "verified": true, "helpfulness": "0/0", "author": "REGINA M ALICEA"}, {"rating": 5.0, "review": "So much fun. Easy to use. Great nights of entertainment!", "verified": true, "helpfulness": "0/0", "author": "eve sindelar"}, {"rating": 5.0, "review": "Awesome love it", "verified": true, "helpfulness": "0/0", "author": "Penny K. Bower \"sky dancer\""}, {"rating": 5.0, "review": "By far the best device on the market. So user friendly and the voice search is amazing.", "verified": true, "helpfulness": "0/0", "author": "Ruben A Gomez"}, {"rating": 4.0, "review": "Have had some connectivity issues but customer service was excellent and the problem was resolved. I LOVE the ability to just say the name of what I want to watch and not have to mess around through several sights to get there.", "verified": true, "helpfulness": "0/0", "author": "Melanie Peterson"}, {"rating": 5.0, "review": "So fast.  Had chRome stick and this is a cheetah compared to the chrome dome.", "verified": true, "helpfulness": "0/0", "author": "CaptainCaribbean"}, {"rating": 5.0, "review": "I gave this to my son for Christmas,he loves it and I can now look some movies I didn't get to see in the movies and don't have to leave my home.It's great!!!!", "verified": true, "helpfulness": "0/0", "author": "Joan Welch"}, {"rating": 4.0, "review": "Love it....", "verified": true, "helpfulness": "0/0", "author": "Michael Gallagher"}]