[{"rating": 5.0, "review": "I love this thing.  Works well with Hulu (which any Roku user knows can be troublesome...)  I just wish Amazon would get on board and let us Chromecast Amazon videos.  Then I can finally toss my old Roku...", "verified": true, "helpfulness": "0/0", "author": "T. Hanson"}, {"rating": 5.0, "review": "best of the best only amazon fire can maybe compete with it hopefully google chromecast gets amazon on there too.", "verified": true, "helpfulness": "0/0", "author": "Ruben"}, {"rating": 5.0, "review": "I can't express how much I love this thing. It allows me to watch Netflix in my workout room which has put an end to treadmill boredom. There are lots of other apps you can use with this too. It's super easy to install-just plug it in!", "verified": false, "helpfulness": "0/0", "author": "Purple Violin"}, {"rating": 3.0, "review": "Great buy", "verified": true, "helpfulness": "0/0", "author": "Jimmy Green"}, {"rating": 4.0, "review": "I cast using my iPhone, and it is very convenient. I don't have to worry about a remote, and it is simple to search for what I want to watch. The only complaint I have is that sometimes it takes a while for my phone to find the Chromecast on my WiFi, so pausing can be problematic. I often have to reboot an app in order to pause. For the price, I am extremely satisfied. I only wish there were a more streamlined way to pause/play what I am watching. Also, as of now there is no support for Amazon Instant video. It would be a fantastic improvement if that were added.", "verified": true, "helpfulness": "0/0", "author": "Luffy"}, {"rating": 2.0, "review": "Worked good at first now mine and my dad's buffer ALOT....and I got 105 mbps download speed. Get it together google, a little less spying and a little more quality.", "verified": false, "helpfulness": "0/0", "author": "el Hulko increible"}, {"rating": 4.0, "review": "great but does have hiccups sometimes", "verified": true, "helpfulness": "1/1", "author": "Matt"}, {"rating": 5.0, "review": "If you don't have a Chromecast yet, you are missing out on a fantastically efficient, effort free world of entertainment.", "verified": false, "helpfulness": "0/0", "author": "AmazonBuyer"}, {"rating": 1.0, "review": "Didn't like it.  Purchased it for my wife who uses her Ipad to watch old episodes of various shows.  The video stream kept buffering making it frustrating to watch her shows on the tv.  She went back to watching them only on her Ipad and had no problems there.  Keep your money and wait for the next evolution.  Hopefully they'll iron out the remaining wrinkles.", "verified": true, "helpfulness": "0/0", "author": "Monkin"}, {"rating": 5.0, "review": "We own two chromecasts and an Amazon Fire TV....cant complain one bit! Setup is easy with your PC or smartphone.", "verified": true, "helpfulness": "0/0", "author": "V. Delia"}]