[{"rating": 3.0, "review": "I've had this thing for only a week to 10 days and for some reason it just froze up and there was no way for any apps to load. Called customer service and they said to unplug the unit and it will reset itself. Well it did. Now it seems during the viewing of a program it has to constantly buffer. Very annoying.", "verified": true, "helpfulness": "0/1", "author": "Spencer Towns"}, {"rating": 5.0, "review": "I love it, l love it!!", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "We use this daily. Its a little slow on the games. Wish it had a confirm btton for purchases.", "verified": true, "helpfulness": "1/1", "author": "Fred Holmen"}, {"rating": 3.0, "review": "I got this to replace a Roku because I thought it would be easier to use.  It had some power issues and working with Customer Service was a nightmare.  I had to do it twice and the problem was finally solved when I suggested the solution (faulty power cord).  I used email first which was worthless for this (shouldn't have been an option), then called and talked to someone that I couldn't understand who sent me a new Fire TV device.  That wasn't any better, so did a chat to see if I could get it corrected, (after I did all the troubleshooting from the website). That person kept telling me to do the same troubleshooting things I kept telling him or her (the name was Dimples), until I finally suggested they send me a new power cord.  I got it and now it works fine.", "verified": true, "helpfulness": "0/0", "author": "David Mitchell"}, {"rating": 5.0, "review": "Love it, did think there would be more movies available for free.", "verified": true, "helpfulness": "0/0", "author": "Buffy Brown"}, {"rating": 4.0, "review": "love it. the voice search function is amazing. The amazon prime filter is convenient.", "verified": true, "helpfulness": "0/0", "author": "doug"}, {"rating": 5.0, "review": "Over", "verified": false, "helpfulness": "0/0", "author": "Karla Staring"}, {"rating": 5.0, "review": "Pretty much just use this thing for Netflix but it's fast and ready to go when you are. Very compact and small. The best part, mechanically, about this product is that you don't have to aim the remote at the receive and hope that it got the signal... works on one push of a button!", "verified": true, "helpfulness": "0/0", "author": "Nate"}, {"rating": 5.0, "review": "So I finally made the decision to do away with cable and high prices. I was nervous and glad I made the switch. This is the first time I own such a product and therefore can't say I compared its use with others (Apple TV, Roku).I am happy with my choice of Amazon Fire TV. Amazon makes it possible through Amazon prime to see so many great shows and movies. It's capabilities seem without limit. I was surprised to see so many apps available too. The quality of the images are great! The voice feature makes it very easy to use. The initial setup was painless and self-explanatory. I haven't tried using the game part yet but looking forward to it.So this is what I have going on in my house. I have a great internet speed/connection, I use Amazon Fire TV, and complement it with Netflix. I can take it even further if I wanted to and pay for Hulu. Through Amazon I downloaded an app to use my Apple iPad, iPhone and laptop to transmit directly what I am watching to my television through Amazon Fire TV. Once again, great images and sound.I believe this is the future of TV (Smart TV's). I definitely recommend this product if you want to avoid contracts, high cable prices, save money, or if you are a person that doesn't spend most of your time watching the television. Be aware that many live casting programs will not be available as live but you can see them later. As a news junkie my concern was to be able to watch the news. This is no longer an issue to worry about.", "verified": true, "helpfulness": "0/0", "author": "G.R."}, {"rating": 5.0, "review": "Simple to set up and use.  Lots of selections....love it!", "verified": true, "helpfulness": "0/0", "author": "Scott Salino"}]