[{"rating": 4.0, "review": "Good streaming device with a lot of apps.", "verified": true, "helpfulness": "0/0", "author": "Paul S"}, {"rating": 5.0, "review": "Love it so much!!", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 5.0, "review": "I do enjoy this dongle.  My mother enjoyed it so much when she visited that she bought one as well.  It does suck the wifi out of the room though.  I'm positive that it doesn't actually do that, but it does seem to slow down everything else.", "verified": true, "helpfulness": "0/0", "author": "Heidi Jenkins"}, {"rating": 5.0, "review": "Love it ! Setup was a breeze. Streaming from tablet to TV is awesome.Glad I made this purchase !", "verified": true, "helpfulness": "0/0", "author": "Oscar Hammerberg"}, {"rating": 5.0, "review": "My Chromecast is one of my most used gadgets that I own. I no longer have to use my PS3 as a streaming device! Oh Glorious Days. The future hath arrived in the form of a dongle.", "verified": true, "helpfulness": "0/0", "author": "Sheens"}, {"rating": 4.0, "review": "Transfers streaming video from phone to TV very well. The app only works when using Chrome and YouTube app though. I hope it works more universally.", "verified": true, "helpfulness": "0/0", "author": "Min"}, {"rating": 5.0, "review": "Works great and view all devices on it", "verified": true, "helpfulness": "0/0", "author": "David Higgins"}, {"rating": 5.0, "review": "You use it and love it. You can download plenty of apps compatible to broadcast from iphone/ipad.", "verified": true, "helpfulness": "0/0", "author": "D. Crespin"}, {"rating": 2.0, "review": "I got this to use with the TV in my bedroom. I have a SMART TV in the living room. I will save up to buy another smart TV. This runs much slower, I have to go to each individual site, i.e., Netflix, hulu, etc... and then hit Google cast. It is not as user friendly as I thought it would be nor as fast. Disappointed with my purchase.", "verified": true, "helpfulness": "0/0", "author": "shamu27"}, {"rating": 5.0, "review": "everything okay", "verified": true, "helpfulness": "0/0", "author": "Vadim"}]