[{"rating": 5.0, "review": "I have only used this for Netflix streaming, so I can't comment on it's other possible uses.  However, for that single purpose, I cannot think of anything to improve.  For the price, this kind of performance & convenience are hard to beat.Installation took ~10 minutes from start to finish, and required the download of the \"Chromecast\" app; once the device is installed, you can delete the Chromecast app.  After installation, you can use whatever device you normally use for Netflix (laptop or smartphone) to stream through Chromecast, after selecting it as your output device.  I use the Netflix iPhone app, and have not experienced any issues; content is streamed at resolutions up to 1080p, depending on your connection speed.When no content is being sent to the Chromecast, your TV will display a welcome screen.  The background is a slideshow of beautiful landscapes pulled from Google's image search.  Obviously this isn't a reason to buy a Chromecast, but it's a nice little feature while I'm choosing what to watch.I would highly recommend this to anyone in search of a simple and self-contained solution for streaming internet content to your television.", "verified": true, "helpfulness": "0/0", "author": "Luke"}, {"rating": 1.0, "review": "It's great idea, but I think Chromecast is still in Beta mode for now.  I returned the product and will wait until it's perfected to buy again.  I have a fast wireless router but still the picture quality is low, and it drops connection every few minutes.  I did troubleshoot it with lower resolution, better hdmi cable etc. to no avail.", "verified": true, "helpfulness": "0/1", "author": "Mikhail Tsibulevskiy"}, {"rating": 5.0, "review": "The Google Chromecast is extremely easy to use and get set up.  As a computer novice I found the set-up extremely easy and was able to watch videos immediately.  Well worth the price to get my Netflix and Youtube videos on my big screen tv.", "verified": true, "helpfulness": "0/0", "author": "startingover"}, {"rating": 4.0, "review": "We tried the Roku 3 and this replacing media servers and Xbox 360 for apps access.  This works well most of the time.  It occasionally stutters since it can only use wireless and seems to have small buffers.  It is an awesome device for the money though.  No more fixing PCs.", "verified": true, "helpfulness": "0/0", "author": "Mr H"}, {"rating": 5.0, "review": "For all devices, it's not the most practical at times, since it only does browsers but with the Beta being able to do full screen sharing, the usefulness only goes up.  Watch this item, it's worth the $35 and will be doing amazing things in the future.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "If you're a fan of Google Play, then this is a great item to have. After a very minimal setup, it allows you to use your smart phone or tablet as a remote and stream your movies or music from your Google Play account. It also supports some of the other streaming apps if you don't already get them on your gaming console or smart DVD/Blueray player.", "verified": true, "helpfulness": "0/0", "author": "HopSing"}, {"rating": 5.0, "review": "I watch Netflix and YouTube with the Chromecast.  Also play Pandora in the bedroom while getting dressed in the morning.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this little device. Setup was super easy. I have set up 5 different devices from iPhones to Android phones, tablets and laptops. All work great. For the price you can't beat it. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "BadBrad"}, {"rating": 5.0, "review": "Quick shipment, item was in good order and ready to use when received.  Plan on getting good use out of it.", "verified": true, "helpfulness": "0/0", "author": "Brian E. Martin"}, {"rating": 5.0, "review": "If you don't have one of these yet, you're doing it wrong. Get one....or two, or three. I have one for every TV in our home, including the TV I purchased to go with one of them.... Yes, I got the 3rd Chromecast before the TV. That's how amazing these are. Bring them home in boxes. Bring them home in cases. Hook one up to your dishwasher, your fridge, your shoes! You can never have too many Chromecasts!", "verified": true, "helpfulness": "0/0", "author": "Daniel Panichelli"}]