[{"rating": 4.0, "review": "great hS  hd easy to install easy to use but not enough apps. also needs pId apls ro watch more media", "verified": true, "helpfulness": "0/0", "author": "avi lowenheim"}, {"rating": 4.0, "review": "Works well, but was looking for more out of Netflix options. Also more installation instructions would be helpful for those of who can read.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Horn"}, {"rating": 4.0, "review": "Device obviates need for WIRED  connection from your laptop [or other internet connected device] so you can, in theory, stream wirelessly from your device to your TV.  Swell idea!Pros: Gorgeous packaging; easy wireless setup; background photos gorgeous; immediately able to cast youtube [so can now more easily watch watercolor demos on our tv].Cons:unable to cast AmazonPrime [not supported?]; initially, unable to cast from Netflix; above average tech savy; tried many work arounds, uninstalled/reinstalled Chrome, Starlight, restarts, reboots, blah blah; Google help uninformative and Apple no interest in getting this to work.unfortunately, cannot describe what DID work, but suddenly we are able to cast Netflix and it works fine.Still keeping old school wired Roku; less finicky.  Jus' sayin' dude....Chromecast device is still in Beta [or maybe junior high], but it may work fine for your needs. Troubleshooting lingo relies heavily on slang which is, at first blush, almost endearing; but gets old fast as frustrations mount and tends to exclude at least one third of USA population. Jus' sayin' dude ...ps this device [Chromecast] requires download and installation of Google's Chrome [Chromecast is not designed to work with Safari nor with Firefox].  A sudden shudder of massive-data-mining-paranoia caused us immediately to uninstall Chrome from our most-used computer and instead install the required Chrome on a less frequently used laptop which contains no 'data'.  During installation of Chrome, it was not crystal clear how reliable the privacy settings are/were/may be some day.  Naive, I know.  Jus' sayin' dude.....", "verified": true, "helpfulness": "0/0", "author": "Moysey"}, {"rating": 3.0, "review": "It is very easy to use, very convienent, pull and plug in to another tv with ease. The drawbacks I'm currently experiencing is netflix will fail to load and freeze up when I try and start a show. Sometimes it will do this with both hulu and Netflix to where I can't just back out and restart it to fix the problem, I will actually have to hold down the reset button on the chromecast and go through the setup process again, which only takes about 3min. So to sum it up, I love this thing and e idea of its convienence, but they do have a ways to come which is understandable. Oh, and give me amazon prime!!!", "verified": false, "helpfulness": "0/0", "author": "Howardair"}, {"rating": 5.0, "review": "gets better everyday as support is expanded.  Works great with my phone and my computers.  Android Netflix App works great.  Only drawback is Amazon Instant Video does not work with it as of yet.", "verified": false, "helpfulness": "0/0", "author": "silent reviewer"}, {"rating": 4.0, "review": "Simple, easy to set up and worth the $30 we paid.  If I had a complaint it would be that I wish there were more apps that I could stream via the Chromecast.", "verified": false, "helpfulness": "0/0", "author": "mary"}, {"rating": 5.0, "review": "All that received this as a Christmas gift are thoroughly enjoying. At a great price, too! We did run into a snag trying to sync with an older iPad. Apparently you need to be able to update to the latest OS to use with this.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "In the Beginning it was hard to set it up since video was not displaying HD quality as expected. It just needed to be reseted to get the quality, now it is ok. I also own an Apple TV and now starting to compare. The best idea is the video queue with Youtube, that, is so convenient. I'm still looking for a way to display my pictures and video from my andrid device, that is easy with apple TV but I still cannot with my tablet.", "verified": true, "helpfulness": "0/0", "author": "Javier Masini"}, {"rating": 5.0, "review": "For now,  this is the greatest product on earth.  So  many uses!  I take it with me when I travel and use it on hotel  TV's to  watch whatever I want.  Love it!  Great market disrupter.", "verified": true, "helpfulness": "0/0", "author": "W. Cogdill \"cogs\""}, {"rating": 5.0, "review": "Anyone who hasn't been living under a rock for the past few years probably owns a smartphone by now. And anyone who owns a home or rents, and owns a smartphone, probably has WIFI by now, too. The Chromecast plugs into an HDTV via HDMI and works in conjunction with your smartphone and a WIFI network.So, instead of spending hundreds of dollars more on an HDTV that has some built-in Smart TV capabilities like Netflix Streaming or DLNA support, just forego those and get yourself a cheaper DUMB TV and a Google CHROMECAST instead. And if you already have a dumb TV with an HDMI input, a smartphone and WIFI, then the Chromecast is the cheapest streaming device out there. Heck, you could turn a large PC monitor that has HDMI into a smart TV, if you were so inclined.It was a bit of a pain to setup, but after an hour and a few  router reconfigurations later, I had everything running smoothly.It works beautifully. No interface lag whatsoever. HBO GO and Netflix look outstanding. Highly Recommended!------If there is only one complaint that I have, it's this:GOOGLE, PLEASE ALLOW PEOPLE TO CONFIGURE THE NETWORK SETTINGS. I WOULD LIKE TO BE ABLE TO SET A STATIC IP ADDRESS FOR MY CHROMECAST.", "verified": true, "helpfulness": "0/0", "author": "drp103"}]