[{"rating": 5.0, "review": "excellent, very easy to set up and to use", "verified": true, "helpfulness": "0/0", "author": "Bette L. Johnson"}, {"rating": 5.0, "review": "Love It.  Great performance.  Whether you subscribe to Prime or not.  Watch Netflix, or sideload Kodi and stream music and video sources.  I have 3 Fire TV's and an antenna and do not miss no longer having Cable.", "verified": true, "helpfulness": "0/0", "author": "william boelke"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Bryant Vo"}, {"rating": 5.0, "review": "Marvelous!", "verified": true, "helpfulness": "0/0", "author": "Fernando P."}, {"rating": 4.0, "review": "You have to pay for extra episodes.", "verified": true, "helpfulness": "0/0", "author": "eileen"}, {"rating": 5.0, "review": "FANTASTIC...no need to subscribe any longer to overrated high services!", "verified": true, "helpfulness": "0/0", "author": "robin robertson"}, {"rating": 4.0, "review": "I love it however, the showtime app has a lag every 2 minuites.", "verified": true, "helpfulness": "0/0", "author": "Keith Tucker"}, {"rating": 4.0, "review": "At first I was skeptical about how much better this would be than my existing smart TV's or blu-ray players, but it really is. It's fast, has a simple remote, and makes it convenient to watch Amazon Prime, Netflix, ShowtimeNow, and YouTube. I really like the Plex client for streaming from my HTPC, too, though I did have to pay $5 for it. (At least it's doesn't require a subscription to PlexPass, unlike my smart TV's Plex app, or the PS3's Plex app.) I don't have a Roku, so I can't compare it to that. My only regret on this is that it doesn't have a Vudu app, so I can't watch my Ultraviolet movie collection in HD with the fireTV. It does have a Flixster app, but that only supports streaming Ultraviolet movies in SD.Update:I thought of one other thing my blu-ray's Netflix app has over fireTV's:  support for 3-D content. Netflix has 3D movies that I can stream from my 3D-supporting blu-ray player. FireTV apparently does not, because it doesn't give me the option when I pick a movie known to have 3D on Netflix.", "verified": true, "helpfulness": "0/0", "author": "TWG"}, {"rating": 5.0, "review": "This is a great idea it is linked into my amazon library and prime Norwich makes tv watching a lot easier", "verified": true, "helpfulness": "0/0", "author": "Richard Bodas"}, {"rating": 5.0, "review": "I knew I'd love it...seen lots of good Amazon Prime movies of late", "verified": true, "helpfulness": "0/0", "author": "Debra T."}]