[{"rating": 1.0, "review": "Movies will  start playing run for a few minutes and then shut off. Every time. I do not use it.", "verified": true, "helpfulness": "0/1", "author": "Mike Farr"}, {"rating": 2.0, "review": "It works but not matter what network I am connected too it never a constantly smooth connection.  It disconnects often, but it's is innovative.", "verified": true, "helpfulness": "0/0", "author": "Vharo"}, {"rating": 5.0, "review": "This is a great way to stream movies from android or iOS to any HDTV. Easy to install and setup!", "verified": true, "helpfulness": "0/0", "author": "Douglas"}, {"rating": 4.0, "review": "I didn't consider owning a smart streaming TV device until I heard that Google's Chromecast had launched its \"Google Cast\" extension on google chrome browser, which allows the user to stream anything on any tab (video or website) onto their TV screen. Although it's still in beta, it works perfectly fine with my computer and TV. All one needs to do is make sure your graphics card is at least mid-level and your wifi is strong enough (20Mbps and up).The usability on Google's chromecast is nice and simple. I can use my phone to control it through chromecast supported apps, or I can easily broadcast from my laptop and desktop using the google cast extension or even easier through websites of apps (post tv, netflix, etc).For the price I don't think you can go wrong, and you get directly what is advertised. An affordable streaming option that is sure to get even better as it continues to be developed and more companies make apps for the device (which is now even easier since google made its code public).The only qualms I have for the device is that it is hard to set up if your router or modem is not on the supported list (available on their website). Mine wasn't, but I still managed to get mine set up. The fact that it is only guaranteed to work with certain ones needs to be fixed.Also, currently chromecast only streams 720p with the cast extension - in a 1080p age this should be the standard!. It could also use more stock supported apps, which I'm sure will come in time.Otherwise this device would be a 5star product.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Martin"}, {"rating": 3.0, "review": "The description lists that you can use it to stream audio and video to your television from your phone.  It goes on to list several pay video sources as being compatible. What they do not say it that these sites are the only sources that work with this player.  If the ability to stream more sources becomes available, then it will really be something good.", "verified": true, "helpfulness": "0/0", "author": "Mike C."}, {"rating": 5.0, "review": "Fantastic and so helpful! This \"dongle\" is a fantastic addition to my media and makes it so easy to stream anything on my laptop table or phone right to my tv. We are loving this!", "verified": true, "helpfulness": "0/0", "author": "Mandi Cross"}, {"rating": 2.0, "review": "Seems like they released a Beta product with this Chrome cast. I know it will eventually get better, but needed MUCH more work before an \"Official\" release... Made to be a bad present with lagging, plain not working and overall disappointing for everyone", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 3.0, "review": "I bought it as a di-rect reaction to the TV commercials. It receives Netflix and YouTube. Big deal.Setup is easy; it plugs right into an HDMI input on my TV. Now what?", "verified": true, "helpfulness": "0/0", "author": "Shikantaza \"Shikantaza\""}, {"rating": 1.0, "review": "I bought this mid last year and basically wrote off $35 that I spent for it. I might have used it for 10 minutes to just to get it to work and that too it worked only with youtube. If I try to stream chrome from laptop, it buffers and does not work well unless I turn the quality setting to 360 which gets me really bad picture on the TV. Overall a bad product at its current state.", "verified": true, "helpfulness": "0/1", "author": "G. Mathias"}, {"rating": 5.0, "review": "i was concerned after i got this because some people said you can't use a Chromecast on Windows XP, but it works no problem. Love this little thing.", "verified": true, "helpfulness": "0/0", "author": "K. Davenport"}]