[{"rating": 5.0, "review": "Our family signed up for Netflix a few months ago and was connecting a laptop to the TV. I read a few stories about the Chromecast and was very interested in the wireless capabilities. We have had it for a month now and it is an outstanding product. The installation was super easy, just plug it into the TV and follow the directions. We downloaded the Chromecast app to 3 different phones (2 iPhones, 1 android), as well as 2 laptops. The whole experience was very easy. I really love the app on my android phone, it is very easy to use and the picture quality from broadcasting from my phone is top notch. We use it primarily for Netflix to watch TV shows, and it is so easy to use and navigate through a whole season of a show. (Finished House of Cards in about 5 days). I have explored some of the other functions besides Netflix, even found a way to broadcast the desktop of a laptop. With so much media being available online, Chromecast is a high quality product that is very easy to use and the potential to do much more as more content becomes available online.", "verified": true, "helpfulness": "0/0", "author": "jeff snyder"}, {"rating": 5.0, "review": "Works very good!", "verified": true, "helpfulness": "0/0", "author": "Melissa Goetz"}, {"rating": 4.0, "review": "Dislike having to activate with a smart phone.", "verified": true, "helpfulness": "0/0", "author": "alan Wubenhorst"}, {"rating": 4.0, "review": "Great product, more and more apps every day, only knocking a star off as it has no 5GHz support and i see over 25 wireless networks at my apt that are on the 2.4ghz band.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 4.0, "review": "It needs more apps.", "verified": true, "helpfulness": "0/0", "author": "Nicole Carabetta"}, {"rating": 2.0, "review": "I was not Happy with it. Keep having trouble getting it on to watch a show. The plug broke after a couple months. I bought a Roku 3 player that works much better. I got the player app on my iPhone to use the remote that's pretty cool.", "verified": false, "helpfulness": "0/0", "author": "TA"}, {"rating": 5.0, "review": "Works perfectly.If your PC is connected via ethernet cable to your wifi router, beware you need your PC or phone wifi enabled and download the software to make first install.After that note that the Chromecast downloads and installs some updates. After that you try again and it works.", "verified": true, "helpfulness": "0/0", "author": "Rodolfo"}, {"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "Ireadmore"}, {"rating": 4.0, "review": "Really great for a tv in my craft room. I'm not lame I do cool crafts like woodworking and making models. Not like I'm making doilies or something lame. But I'm able to use my tablet and/or phone to cast Hulu, Netflix, HBO and others and is easy to setup and cast stuff to it. I would not recommend for someone like my father in law, he's not too good with tech. But for anyone else it is super easy.", "verified": true, "helpfulness": "0/0", "author": "sam grein"}, {"rating": 5.0, "review": "works perfectly", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]