[{"rating": 5.0, "review": "works great with my Samsung S4 phone and from my laptop as well.  great for web sites and videos shared to my TV", "verified": true, "helpfulness": "0/0", "author": "Kurt Hoffmeister"}, {"rating": 5.0, "review": "I don't know how I could have lived without this little miracle :) Works perfectly without any issues. Very easy to use", "verified": true, "helpfulness": "0/1", "author": "Mantas"}, {"rating": 5.0, "review": "Yet another great product from Google. I just wish this product had teh capability of direct mirroring of my devices", "verified": true, "helpfulness": "0/1", "author": "Vinicius Sapateiro"}, {"rating": 3.0, "review": "Think very carefully before you buy. It works like advertised, but after a couple weeks of use, not very impressed. I suggest people wait to see how things pan out for this device, before buying. Though the price is hard to beat, I think that $35 could go to buying something that offers more. If the Roku offered YouTube, I'd get that instead. I have a Roku, but in another rm. Got Chromecast for bedroom. No dedicated remote and no continuous streaming takes a little getting used to. But that just could be me.This is good for those who are deep into the Google lifestyle. Music on Google services works well. Pandora works good. YouTube looks great, but devices limitations may be it's failure in the future. I'm getting that Logitech review failure vibe. I use Samsung GN2, and GN10.1, which work great for casting media. I have fios, and router is on same floor, so responsiveness is quick. I really don't regret buying this thing as it is for bedroom and I do get my $35 worth. Hopefully there will be future add-on of more services, that don't hinder the hardware's performance to the point where its useless.", "verified": true, "helpfulness": "0/1", "author": "B. Malloy \"mass effect\""}, {"rating": 1.0, "review": "This does not work the way it is supposed to.  I tried to watch a movie on my TV with it after buying on Google Play, and the service was so spotty, I had to shut it off and buy via On Demand.  This is a total waste of money.", "verified": true, "helpfulness": "0/3", "author": "Lauren Shanks"}, {"rating": 4.0, "review": "Does what is says on the box!Needs support from more apps tough.Spotify, Svt-play and other more local tv-stations.", "verified": true, "helpfulness": "0/1", "author": "Linus Söderlind"}, {"rating": 4.0, "review": "works great, but needs a way to display laptop desktop on TV. The audio and video quality is very good.", "verified": true, "helpfulness": "0/1", "author": "Richard"}, {"rating": 4.0, "review": "Pretty easy to use and it is nice to watch youtube videos, though I wish there was a browser on android connectivity and the online stuff to connect a chrome browser on an older Windows OS (Xp) was messed up, but I got the URL off of a newer Windows host (a Windows 7 desktop) and used that on the older laptop and it worked there.I think this is the kind of product where there is greater support coming, but what it is now is fine, I just can't wait for it to be outstanding.", "verified": true, "helpfulness": "0/0", "author": "C. Zimmerman \"train nut, shutter bug, computer nerd\""}, {"rating": 5.0, "review": "A+ Product  from Google . I like it that very useful . One of the most product useful form google", "verified": true, "helpfulness": "0/1", "author": "Abdulrahman Al Nuaimi"}, {"rating": 4.0, "review": "Works as expected and was easy to install. Haven't experienced any problems. Only bad thing relates to playing local content, as chrome does not support great many codecs and formats. However that is a software issue related to chrome, not chromecast itself.", "verified": true, "helpfulness": "0/0", "author": "Seppo Tiilikainen"}]