[{"rating": 3.0, "review": "That's pretty much it, not a general use plug. There are ways to jump over your head with Chrome browser to make it show more, but why bother? No other streaming services either.", "verified": true, "helpfulness": "0/1", "author": "tellman"}, {"rating": 4.0, "review": "Works as advertised, good product.  Netflix, YouTube, Hulu+ and Pandora all work great!  Self updates and Google is adding new applications that will work as well.For Ipad and Iphone5-Does not work out of the box with some routers, had to make 1 minor adjustment to my wireless router settings to make it work, No big deal.  Instructions give basic tips for tweeks, web addresses and phone numbers for router companies as well as  a list of wireless routers that have been verified for use out of the box.The only reason I did not give 5 stars- Chrome  App ( which you would think would be the first application they would have perfected) does not work on the Ipad or Iphone with Chromecast as of yet.  They are working on it...", "verified": false, "helpfulness": "0/0", "author": "David C. Sweet"}, {"rating": 3.0, "review": "I have a Roku box which works far better than the Chromecast box does for Netflix streaming.  The Chromecast unit had video freezes and lip sync issues.  Not impressed with that part of it.  I do like the ability to extend my Chrome browser to the Chromecast unit but I wish it all worked better.", "verified": true, "helpfulness": "0/0", "author": "A. Fred"}, {"rating": 4.0, "review": "I love it, but i am having difficulty streaming netflix from more than one tablet. Utube is not a problem.", "verified": true, "helpfulness": "0/0", "author": "Linette Carty"}, {"rating": 5.0, "review": "Exactly as advertised. This is perfect for anyone who loves or frequently uses any combination of Netflix, Youbtube, or Hulu. The smartphone photo/video features are great, too.", "verified": true, "helpfulness": "0/0", "author": "Matthew A Foreman"}, {"rating": 5.0, "review": "It works perfectly and quickly. It suffers from what all mirroring devices suffer from and that is lag, but they seem to handle how it lags much better. It makes sure that the audio and the video line up on the screen you are watching which is nice.", "verified": true, "helpfulness": "0/0", "author": "A. Gordon"}, {"rating": 5.0, "review": "Great for wirelessly putting everything on your PC onto your TV screen.  It has been designed to work with any YouTube or Netflix video on my iPhone, and in addition, it works with anything in a Chrome Browser window.  It also can send your entire PC screen to the TV (and that is noted to be a \"beta\" capability at present).  With that full-screen capability, the sound doesn't transfer, but I imagine they will work that out too.  I have noticed that the speed of your PC and/or home network will determine how smooth video will look on the TV.", "verified": true, "helpfulness": "0/0", "author": "Barry"}, {"rating": 4.0, "review": "Great technology. Easy transfer from small devices to Larger screens. Great user interface as well. It definitely met my expectations.", "verified": true, "helpfulness": "0/0", "author": "John Vanderzell"}, {"rating": 5.0, "review": "Great value and keeps getting better as they add more apps.  We use it all the time and it performs flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Geoff Garton"}, {"rating": 5.0, "review": "Love it .looking forward to getting more Apps .  Really nice way to view YouTube reviews on my big screen in HD.", "verified": true, "helpfulness": "0/0", "author": "CJess   \"gadget guy\""}]