[{"rating": 5.0, "review": "Cut the cord, get this and your phone or computer is your remote/cablebox.  just cast your apps or project free tv and bam you got everything you need. say goodbye cable co", "verified": true, "helpfulness": "0/0", "author": "Andrew Glinski"}, {"rating": 5.0, "review": "Chromecast is easy to use and offers nice streaming capabilities.  Hulu Pro announced today and more to come.  Still waiting for device mirroring though.. Hopefully soon...", "verified": true, "helpfulness": "0/0", "author": "Brett Kowal \"guitarguy!\""}, {"rating": 5.0, "review": "This thing is awesome!  Just plug it into the TV then get on any computer on the network and start up Chrome to set it up.  Very simple, anyone can do it.  Some reviews complain that the video freezes up, but even using my laptop that doesn't play video very well it works fine.When you're on netflix or youtube just make sure that you start \"casting\" using the cast icon displayed on the video menu with the play/pause options (as opposed to the cast icon on the browser).  Casting from the browser displays everything that is happening on the browser - and playing video on your computer AND the TV makes it freeze so bad it's basically useless, at least with my equipment.Wish you could display anything from your computer screen on the TV (like saved movies, video games, etc.), but youtube and netflix pretty much covers everything you might want.  For this price and easy functionality it's an incredible value.  I think this tilts the scale enough that I can completely ditch cable.", "verified": true, "helpfulness": "1/1", "author": "Earnestly Alive"}, {"rating": 5.0, "review": "Never though I need it. But man, it is amazing1- you can used it at any operation. Mac, Windows or whatever, if it is used Chrome.2- easy to use.3- easy to Set up.4- I love it.", "verified": true, "helpfulness": "0/1", "author": "Mohammed Zainuddin"}, {"rating": 2.0, "review": "First, do count on the three months of netflix.  that expired quietly months ago.  Second, it's slow and choppy.  Or at least it was on my system (which I have not had problems in the past).  Anyway, this just does not really do anything that several other devices don't already do.  Might be worth it if it actually played videos from your computer like appleTV.Gave it two stars because it at least sets up easy.", "verified": true, "helpfulness": "0/1", "author": "Andy"}, {"rating": 5.0, "review": "Ok, when you can stream Top Gear in 1080p to a 42\" flatpanel TV, from youtube, over a DSL fed wireless network and the picture is mostly perfectly clear, you know you have a fantastic product.  Love this thing.  After that initial testing with Top Gear I set it up for a friend so she could cast some foreign shows to her TV (that are not available on things like the Roku). She was near in tears with happiness that she and her mom could now watch shows on their big TV and not just on the small computer monitor (90 year old mom never even bothered with the computer).  Will order one for me to have around just in case.  Additionally, I was also able to cast documents, .mp3 and .mp4 to my TV by entering the file path in Chrome's address bar.  So, it's not just limited to the internet.", "verified": true, "helpfulness": "0/0", "author": "TypicalBuyer"}, {"rating": 5.0, "review": "My only complaint is my Kindle fire HD does not work well with Chromecast.  My Galaxy s4 and MacBook and Windows 7 laptop work great with it.", "verified": true, "helpfulness": "0/0", "author": "JenniferZ"}, {"rating": 3.0, "review": "Ordered the chromecast, had to wait 3 weeks for it to arrive. Ordered it for the ability to play local content. Before I even received it Google went and broke the ability to play movies off of a local server. I received the chromecast, used it once and haven't used it again. It is a good device for the money but has so few content options that it's not for me. It could become a great device give time or it could become one of Googles many unrealized dreams. I hope it works out but for now I use a Roku3 with PLEX. Roku3 cost 3 time what I paid for the Chromecast but has 10 times the options.", "verified": true, "helpfulness": "0/0", "author": "Ed W."}, {"rating": 4.0, "review": "I do love this device, it helps me with cartoons for my LO  and the quality is great, but it dose lose connection occasionally which is very annoying. It has nothing to do with our network as nothing else is affected. still, its opens up great viewing potential and I am getting one for my dad.", "verified": true, "helpfulness": "0/0", "author": "Alexandra Ostrov"}, {"rating": 2.0, "review": "I got this thing today. It was easy to install, I had it up and running in about two minutes, then I started to find the shortcomings. I originally installed it on my TV, but then I realized that the sound wouldn't come out of my surround speakers, so I tried to install it directly onto my A/V receiver. That didn't work at all, no picture and the light on the Chromecast dongle flashed red. So I switched back to the TV and I thought all was well. I specifically bought this thing so that I could watch shows and movies on The Dare Wall, but this was a complete fail - no sound through the TV, so I had to keep the laptop nearby for sound; and when I went to full screen on the laptop, the images on the TV screen froze up completely.  So, I am sending the thing back, maybe I'll try again in a year or so and hope Google gets the bugs worked out.", "verified": true, "helpfulness": "0/2", "author": "Joel E. Bruner"}]