[{"rating": 1.0, "review": "I had high hopes for this bad boy! Turns out it is nothing like Roku (which I have) or Smart TV (which I have.) It is really not worth it.", "verified": true, "helpfulness": "0/1", "author": "Daniel M. Andrews"}, {"rating": 4.0, "review": "Not sure how I could use this product but newer TV works best. Buy a TV after 2012 models for this product to work best.", "verified": true, "helpfulness": "0/0", "author": "wolfie"}, {"rating": 5.0, "review": "Most folks don't see the point of the Chromecast.  I was one of these until I ordered one on a lark.  After using it for 10 minutes, I ordered 4 more - it is awesome.* No extra boxes and their controllers to worry about - just use your phone or tablet, which you are likely carrying around anyway.* The phone/tablet doesn't actually stream to the Chromecast - it tells the Chromecast what to go get (Netflix, YouTube, Plex, etc)* If your TV has a USB port, you can install the Chromecast to the back of the TV and have no cables coming out from behind it.  This is really nice for wall-mounted sets.Most complaints about the Chromecast are around the tab-casting feature, which admittedly is disappointing.  But that isn't the point of the Chromecast - it is a streaming endpoint that can be controlled remotely.  If you don't expect it to perfectly mirror your computer's screen, then you're fine - use the supporting apps (tons there, more coming all the time) and enjoy having your media truly portable!", "verified": true, "helpfulness": "0/0", "author": "Benrama"}, {"rating": 5.0, "review": "I can use my Nexus 7 to locate what I want to watch using voice input, then switch it over to view on the TV,  WAY better than trying to spell things out using my TV remote.  I bought two of these as Christmas gifts in addition to the one for myself.  The recipients said it was the best gift of the holiday season!", "verified": true, "helpfulness": "0/0", "author": "CharleyChicago"}, {"rating": 5.0, "review": "I use mine with Netflix and it functions great. I wish I would have bought one sooner. A cheap alternative. Love it !!", "verified": true, "helpfulness": "0/0", "author": "dan phillips"}, {"rating": 5.0, "review": "This small, cheap device literally replaced my boxee box, and my roku hd player, as well as my PC media center. Now that the SDK has been released and more third party app developers are getting on board there is no reason to hold back on getting this if you were on the fence. It's extremely simple to set up and looks awesome when you are surfing for what you want to watch on your phone or tablet and just play your media straight from there. For me it just means one less remote to carry. I always have my phone on me and am usually doing something while watching TV. Now this is just as simple as picking what I want to watch \"flinging\" it to my chromecast and going about my other app business on my phone.For those of you who are concerned about battery usage on your phone or tablet, unless the media is local, (IE, a video on your phone, or music on your phone, NOT internet based) the chromecast uses minimal power from your device. For example, if you are looking through your netflix or hulu on your phone and find something to watch, you send it to chromecast, that's the extend of what your phone needs to do for sending the media, after that the chromecast itself pulls the data from the netflix/hulu servers.For those with extensive movie collections plex is invaluable and very sexy on a tablet/phone. Recently plex made it free for chromecast users to be able to send their collection to their devices. (It used to require a plexpass monthly subscription).When your chromecast isn't playing media it shows beautiful photos in the background. Bottom line is this device is too cheap, and does too much, to not pick it up. If you don't like it you can always return it to amazon, so take the plunge, and if this review helped please let me know, thanks.", "verified": true, "helpfulness": "0/0", "author": "Michael Conte"}, {"rating": 5.0, "review": "This little device is almost not there. It sits behind my TV and waits for me to tell it to do things with my phone. I pull up an app, push a button, and it plays - usually with great visuals and minimal lag - on the TV. Seamlessly switches between apps and videos. Accessible from multiple devices. This little dongle has changed the way my family watches TV. We have two. I recommend it to anyone with a TV.", "verified": false, "helpfulness": "0/0", "author": "John Hogg"}, {"rating": 5.0, "review": "Chromecast is great, love the concept, love the price. We've had some issues with our Wifi, but I think that's our router, not the Chromecast device.", "verified": true, "helpfulness": "0/0", "author": "Bekktek"}, {"rating": 1.0, "review": "We bought this device and got it to work once or twice. Being busy we didn't have time to research possible solutions until a month had passed and we could not return to Amazon. So we contacted Google Chromecast. Our device would cast the program to our TV but only with a frozen image or only with video and no audio. ARRRGGH.We called Google Chromecast and they helped us over the phone. About a 45 minute phone call to finally decide our item is a dud.Since it is still under warranty from Google you would think…ah, easy to return. NO WAY. They expected us to create some Google  Wallet account -giving our credit card info AND temporarily charging us 35 dollars to send it BACK? What?I tried and tried to ask them why I had to divulge my private credit card info to a site I didn't ever intend to use but they kept saying I had to do it. I would have paid to send back my stupid little device and all they had to do was send me a new one.BUT NOOOOOOO.Horrible customer service to expect me to pay for an item and then add a second (although temporary) charge to my credit card. I use Amazon because I trust them.I am going to try another device like Roku or Apple TV. Google Chromecast can go pound sand. Jerks.", "verified": true, "helpfulness": "0/2", "author": "Me in Wisconsin"}, {"rating": 5.0, "review": "I use this daily to \"cast\" music or video from YouTube or Netflix.  Absolutely easy to use and awesome to use.  My TV is connected to my surroundsound via an optical cable and never before has the unit driving the audio been able to change the volume level when using optical.  But with the Chromecast, I can change the volume of the music/movie/video via my phone.  I LOVE IT!Because of this device, I've cancelled my cable TV and only use web-based media and news.  Saved me a lot of money.I think this may very well be the least expensive tech device I've ever purchased that I've gotten SO MUCH quality use!", "verified": true, "helpfulness": "0/0", "author": "Dr. Marty \"mwhdvm\""}]