[{"rating": 5.0, "review": "This is the best thing ever! My husband and I have to take turns on who gets to play with it. Movies, Netflix and games! I put it on my flat screen in my bedroom so that way we have so many options for movies we can both agree on!", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Switched from Roku.  With Fire TV, unit goes to sleep overnight and when you go to use it, comes up with a screen that is out of whack with TV.  Only solution is to unplug it and reboot, then works fine - until the next day.", "verified": true, "helpfulness": "3/5", "author": "Larry A"}, {"rating": 5.0, "review": "Not loading as well now...seems to lag a bit", "verified": true, "helpfulness": "0/1", "author": "Dan \"Dan Chapman\""}, {"rating": 5.0, "review": "Why? this journey started when network issues surfaced, eventually leading to a discovery that Roku had pushed a BETA screen casting bit of code to each device unsolicited. Way out of bounds-Roku...you are fired. It's not OK to skip Opt-In for Beta code in a desperate bid to keep an old product development relevant.The next day Amazon Fire TV's were ordered. What an amazing difference in speed, visual quality (screen scaling optimization), audio quality, content presentation, speed, setup (Automatic account verification and setup with PIN security using Prime), and also advanced game features from a trusted source for technology-Amazon.com!It's like driving a Ferrari by comparison.Replaced Roku 3's - falling by way of the hammer-strike, just for fun. Dumping invasive tech companies...Netflix get your act together.", "verified": true, "helpfulness": "1/2", "author": "Amazon Shopper"}, {"rating": 3.0, "review": "I think that more things should be available with amazon prime since I pay $99 a year for it. Pretty comparable to netflix in that manner. I do love the voice search", "verified": true, "helpfulness": "0/0", "author": "Meg Johnson"}, {"rating": 1.0, "review": "It worked fine for three day.  Then it just froze on home page.  I bought it for my second bedroom.  After trouble shooting with my wi fi provider(warner cable), I purchased a network router.  It still didnt work.  I sent it back for a refund.  It really would've been nice to be able to stream upstairs.  Will look for other options.", "verified": true, "helpfulness": "1/2", "author": "Ricky honorable"}, {"rating": 5.0, "review": "kids love it too !!!", "verified": true, "helpfulness": "1/2", "author": "Mar Vic B. Mesa"}, {"rating": 5.0, "review": "So I have been using the Fire TV for a while now and I love it.  The applications are fast compared to apps on blu-ray players and I really like the search features.  I debated between this and the Roku but Amazon ran a price special on the fire and I couldn't pass on the deal to try.  this is my first streaming device so I can't really compare to chromecast and roku but I do recommend the fire to anyone who is already using amazon services.", "verified": true, "helpfulness": "1/2", "author": "JFG"}, {"rating": 5.0, "review": "Great product. The voice recognition software by remote is the best feature. No more having to spell your search. Way to go Amazon!!", "verified": true, "helpfulness": "1/2", "author": "Chad T"}, {"rating": 1.0, "review": "This device is designed for you to spend more money. First of all you get no where without an amazon account and an active credit card. Every app has purchase on it even the ones that are free. My Netflix for which I am a subscriber I can't access because I have to purchase the app. By the way their apps suck. Roku has far more apps than amazon fire and you don't have to pay for every bloody thing. The connectivity sucks. My iPad mini can stream when the great amazon fire is struggling to stay connected to the wifi. One good thing though if you are a nature lover there are great screen savers that you can look on. I have been looking on these cause I can't watch anything else on this piece of junk. Sorry my 15 days expired to return this device to bestbuy.", "verified": true, "helpfulness": "1/8", "author": "Trevanne"}]