[{"rating": 4.0, "review": "I really like the responsiveness of the remote control on the Fire TV, and the voice recognition seems to be very good. The quality of streamed video is good, and the device is easy to use. The one thing I don't like is that it doesn't seem to go to sleep by itself, and putting it into standby mode requires going to the home menu, then to settings, then to System, where you can finally select Sleep.", "verified": true, "helpfulness": "1/1", "author": "D. Leany"}, {"rating": 4.0, "review": "Useful but the HBO app doesn't work if you have charter while the roku does.", "verified": true, "helpfulness": "0/1", "author": "Patrick"}, {"rating": 5.0, "review": "I bought this for my husband for Christmas. He is very happy with it. I may never seen him again.", "verified": true, "helpfulness": "2/2", "author": "Sheridan C"}, {"rating": 3.0, "review": "Very easy set up.  But I was disappointed that I would be paying extra for almost everything. Monthly Netfix charges, annual Amazon Prime charges, individual charges for many movies & TV.  No local news.  Sending it back.", "verified": true, "helpfulness": "0/3", "author": "thayer"}, {"rating": 5.0, "review": "The Fire TV was easy to set up and works fine!", "verified": true, "helpfulness": "1/1", "author": "Frank Falcone"}, {"rating": 5.0, "review": "Easy to set up (5 minutes for me); easy to use; love the talk to fire tv to find the latest movie or work from a partucular actor.  Well worth it!", "verified": true, "helpfulness": "1/1", "author": "paula evans"}, {"rating": 5.0, "review": "Awesome!  Easy to use!", "verified": true, "helpfulness": "1/1", "author": "BRENDA CLOSE"}, {"rating": 5.0, "review": "5 stars in terms of quality/content, UI, aesthetics, everything else! 3 stars for only 8GB of storage :( [EDIT: increased rating to 4 stars, explanation below]. [EDIT2: The last major update mostly fixed the storage issue]It's fast, slick interface, works great, was ridiculously fast and easy to setup, remote is simple and wonderful. Got the games bundle which included two games and a console-type controller. My kids love the games. They look great--as good as Android games can be now, which is pretty spectacular.The usual complaints that I've read don't phase me, that search is biased towards Amazon streaming, blah blah, I don't really care about any of that...But only 8GB of storage, where only 5GB is free is just pure sillyness, especially when some nice modern games want to dl 2.5GB of data! After the two games that came with the bundle, Life and Sev Zero, and then installing three more games, we're already getting warnings about low storage! This was the SECOND day after we got the device. We're already having to uninstall games so that we can try out new ones. We love Minecraft, but can't install it now because we're still playing the other games...First off, why in the bloody heck couldn't it have come with at least 64GB of storage? Has Amazon looked at the SDHC cards that they sell and how SMALL they are? They couldn't have increased the internal storage any?And/or, why not come with an SDHC card slot? Or two? or 4?Ok, forget more internal storage--they want to keep hardware costs down, I can see that. No SD slot, same thing, small form-factor, limited space, ok.But it comes with a USB slot...How hard would it have been to add support for a USB stick/external HDD? Not hard at all, since Android, which this is based on, already does! They could have included a fat USB stick in the bundle we bought and charged a little more...When/if they allow use of the USB port for external storage for apps and games, I'll give an enthusiastic 5 stars. As it is now, this is a  -=serious=-  handicap. Honestly, this seriously short-circuits the games-appeal of this device. A selling point over the Roku is that this supports more games...But, given the limited storage, a ROKU would have been just as good, and cheaper (at least when I purchased my Fire TV, now the price is lower at $79).I mean, the  -=second day=-  after my kids opened this gift and started playing it, it's already out of storage...it's just unthinkable...no one foresaw this issue?? You, Amazon, don't want to make money on app purchases?***Above is my first review. I wanted to give 5 stars but withheld and gave 3 for lack of storage. I've now upped it to 4 for two reasons. First, the number of games available has shot up. When I first looked at getting this, games were said to be over 100. Now they are close to 600. This is great. 5 stars will come when an option for increased storage becomes available, because I can still only have a small handful of those 600 games at any time... ;(Reason 2 is the ability to sideload XBMC. This is a -=killer feature=- that surpasses Roku. For those who have libraries of videos, tv shows or music accumulated over years sitting on a network share drive on a PC, neither (FireTV/Roku) comes with an easy way to get this content to the device. I was going to go the Plex route, where Plex running on a PC can serve up said content, but with XBMC, I can play these files directly on the FireTV. Roku can't do this. I applaud Amazon for allowing this, though it would be easier for most if they just allowed XBMC to be installed through the FireTV store ;) But no rooting is required (yey!), though it does take some extra steps. Those who know about this topic, and who have considered Plex now have another option. *applause*, Google \"XBMC on FireTV\". IMO, many (with a few exceptions) of the official channels on FireTV surpass those that come with XBMC because they are officially supported by their content makers (PBS, Pandora, etc), but the ability to reach out to network drives makes XBMC worth having.Note to Amazon: this \"feature\" alone makes this product jump way ahead of most third-party XBMC specific devices out there, many of which you sell, and with the growing games library, there is no longer any competition. Congrats.Edit2: I've moved it up to 5 stars. The number of apps and games continues to increase. The storage issue has been resolved almost to the best that Amazon can do/has control over. Fixed, for the most part! USB storage is accessible now. I've moved most apps and games to a USB stick (most games allow this) which I bought just for this reason and even with GTA: San Andreas installed once again (which doesn't allow itself to be moved to external storage!), I still have over a gig free on the fireTV itself. This is great. Now I have a nice games library ready to go, no more uninstalling and reinstalling games to play different ones. KODI still works, which is a requirement for me. It can still be side-loaded. It was in the official store for a while but was removed which is silly, Amazon ;)", "verified": true, "helpfulness": "1/1", "author": "Hiavatch"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "1/1", "author": "Lisa Hall"}, {"rating": 5.0, "review": "Very easy to use", "verified": true, "helpfulness": "1/1", "author": "Heather Aeder"}]