[{"rating": 4.0, "review": "I will upgrade to 5 stars when the Android version of Chrome can cast to it.  Otherwise it works great.", "verified": true, "helpfulness": "0/0", "author": "Luc Archambault"}, {"rating": 5.0, "review": "Item received intact and on time. Very excited to put it through the paces as there is a lot of promise of coming developments.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Charles"}, {"rating": 5.0, "review": "Now my TV is as smart as my phone!  I loved how easy it was to set up. And it's much better to stream Netflix through the Chromecast than through the WiiU.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"webchyck\""}, {"rating": 5.0, "review": "Maybe I just got lucky, because my friends can't get theirs to connect to any of their devices, but I had this up and running in no time! Haven't used it much yet, but I was finally able to use HBO GO on my big TV and not my tablet! Follow the directions and it only took five minutes.I even got it set up on my new Harmony remote! It's not in the database but if you create a command to watch what is on the HDMI port you plug this in to, you're good to go!", "verified": true, "helpfulness": "1/1", "author": "S. Scheide \"S.R.S.\""}, {"rating": 5.0, "review": "the person the I Gave it to told me that it works really great.They just plugged it in and it worked", "verified": true, "helpfulness": "0/0", "author": "bill \"bigskee\""}, {"rating": 2.0, "review": "For 35 dollars it's okay. I had a $20 bluetooth audio receiver that I upgraded with this. Pretty much just adds YouTube and hulu. You also need your tv on to stream music(even to a receiver) because this device uses hdmi.The final blow is the lack of apps for it is troubling and at this point all rests on Google to open up the chromecast app store to any developer.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Setup couldn't be simpler! Three step instructions and worked like a charm first time. We have used the Netflix, Hulu and YouTube apps with Chromecast so far and are very happy with its performance. I also tried tabcasting from Chrome on my laptop. If there is a weak point, tabcasting is it. It works, but it's clunky and jerky.Two observations so far -1. Chromecast seems to really toast the battery of the device you're casting from. Not a big deal, just something to be aware of.2. Now that my son knows he can watch YouTube videos on the TV, we may never get to watch regular TV again. =)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "One of the most if not the most significant innovative piece of technology to hit the consumer market in decades bravo Google bravo...", "verified": true, "helpfulness": "0/0", "author": "Robert Wilson"}, {"rating": 4.0, "review": "It's great that i can picture and you tube videos wirelessly to my big screen. I can even browse my phone while its showing youtube videos on the big screen.However for videos and movies streaming from phone, it can only supports a certain kind of format. It doesnt support flv, mkv and etc.", "verified": true, "helpfulness": "0/0", "author": "Md Firdaus Nordin"}, {"rating": 5.0, "review": "What can I say - Google Chromecast is great.  It has been the device that has caused me to watch a lot less TV and more of what I want to watch that is available out on the Internet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"SJO\""}]