[{"rating": 5.0, "review": "Nothing more to say but awesome!  Amazon delivery is best in business too.  You can't go wrong with this purchase.", "verified": true, "helpfulness": "0/1", "author": "Daniel D. \"Daniel D.\""}, {"rating": 1.0, "review": "If to want to cast video from your google device to this device. It doesnt work. Save your money. It's crap", "verified": true, "helpfulness": "2/10", "author": "Lynn Gonzalez"}, {"rating": 1.0, "review": "For me, it's been a piece of crap. Very unstable. I have several laptops, desktops, Roku, and even DVD wi-fi players, and none of them, except this Chromcast device, have trouble connecting up. And it is every time I use it. I have to reboot several times, cross my fingers, and toss coins into the fountain to get it to sync up with my laptop to stream. It is much easier to just use my 25 foot HDMI cable from my laptop to the TV, and be done with it. A waste of money...", "verified": true, "helpfulness": "4/7", "author": "Wayne in Indy"}, {"rating": 5.0, "review": "Easy to install. Net Flix looks great. $30.00  is a steal. My home entertainment system has arrived. I love it!", "verified": true, "helpfulness": "0/1", "author": "George F. Dirienzo"}, {"rating": 4.0, "review": "The product is working fine for me until now. After 3-4 hours it is becoming hot and casting is hanging some times. Otherwise the product was very good.", "verified": true, "helpfulness": "0/1", "author": "swarup ravi"}, {"rating": 5.0, "review": "Bought two of the Chromecast and was fortunate to get the Netflix credits for each.  Wish I bought a third.  Great inexpensive device to use with our Android devices.", "verified": true, "helpfulness": "0/1", "author": "Jason"}, {"rating": 3.0, "review": "I have tried for two days now to get this to operate. No luck on my smart phone or my laptop. I cant seem to get them to connect to the final step. I guess I need to watch more you tube videos on this.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "After placing and waiting 3 weeks for this to come in, I finally received the Chromecast and began my streaming journey.First of all, the instructions were fool proof.. Once you plug the device into your HDMI port (I had to use (included) extension cable) the TV turns on and displays what to do.  I used my iPhone to visit the website displayed and downloaded the Chromecast app.  The app opened and requested access to my Wifi, from then the Chromecast connected to my Wifi and it was all set up.I used Netflix to test out the unit's functionality utilizing my iPhone as a \"remote control\" and albeit there was a 2-4 second delay for \"processing\" the show which appeared on the TV was in beautiful HD and the sound was clear and crisp.  I even enabled the closed captioning and it worked flawlessly.My one and only gripe is that I could not send the sound to my receiver (not sure why) and was forced to use the internal TV speakers.Although at the moment the 'thingy' only supports Netflix and YouTube, it is so very well worth it.  $35 well spent.", "verified": true, "helpfulness": "0/1", "author": "Litmus"}, {"rating": 2.0, "review": "The main reason I bought this product was to be able to stream Amazon movies that I get free as an Amazon Prime member. When I try to start the Chromecast streaming, the screen goes blank. It seems that MS-Silver-light, which is required to play the movies, is not compatible with Chromecast. Is there a workaround for this problem? Will Google provide compatibility in the near future? I already get HBO Go through my Direct TV and I can get Netflix through my Blue Ray player, so I do not need Chromecast for that. I am tempted to return Chromecast unless you make Amazon Movies compatible.", "verified": true, "helpfulness": "2/3", "author": "Henk"}, {"rating": 3.0, "review": "Maybe I didn't research well enough and/or read the description wrong but I was under the impression the chromecast will work using a cell phone's 3G/4G but it will NOT.  You need a secure WiFi connection and the WiFi at most hotels won't work either.  The appeal, for me, of the chromecast is that it is smaller than a ROKU which would make it better for traveling but since it won't work with 3G/4G or hotel WiFi the travel option is out.  It is more difficult to set up then the ROKU, offers less options, has reception issues because it plugs in behind the TV and it's only $15 less than the ROKU 2.  If, like me, you were looking for something to use while traveling do some research before purchasing because the chromecast is not the answer.", "verified": true, "helpfulness": "0/3", "author": "KP"}]