[{"rating": 5.0, "review": "This is nice, easy to use.  Similar to the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "M. Burniston \"MJB\""}, {"rating": 5.0, "review": "My Roku bit the dust after several years, so after comparing Roku 3 and Fire TV I went with Fire. Pretty easy to connect and no problem using Wi Fi. The voice feature works good for Prime only.I have one question, why does Amazon charge so much to rent videos. Anything over one dollar is Too Much.", "verified": true, "helpfulness": "0/0", "author": "kwhartford"}, {"rating": 3.0, "review": "It is ok - Not a lot of new movie available with Prime and they charge for all other shows or movies not on PRIME.  The cost is too high when you rent a movie cheaper.  With a PRIME customer it should be cheaper to rent not $6.00 .", "verified": true, "helpfulness": "0/0", "author": "MICHELLE DOSS"}, {"rating": 5.0, "review": "I hooked this up to an older tv and was amazed at the quality of the picture.", "verified": true, "helpfulness": "0/0", "author": "retiredcg"}, {"rating": 5.0, "review": "Fantastic and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Beautiful, sleek, easy, perfect for me! I love the remote! I love the clarity!", "verified": true, "helpfulness": "0/0", "author": "Drew#&"}, {"rating": 2.0, "review": "I have been using my Fire TV for about two or three weeks now trying to get the feel for it.  I still can't get use to it and always catch myself going back to my Roku even though I have the same tv apps (Crackle, Popcorn flix, etc..).  I mainly bought the Fire TV to play games with anyways but that didn't work out to well since there is a limited selection and not enough storage memory to store more than two games.  There doesn't seem to be a resume when downloading games either.  I have been trying to get GTA vice city on my device for two days now and the download keeps freezing.The side scrolling menu system that the Fire TV has is really frustrating.  Almost all the tv and android device that I have, use a tile menu system.  I can see why now.  It is hard going from a somewhat organized menu to an unorganized one.The search feature is really poor also.  It only searches amazon videos and not apps or anything else, causing you to have to scroll through each item on their unorganized menu looking for what you want to install or watch.The Fire TV is tied to you amazon account and there is no way to block one click purchases either.  Which doesn't matter long as you are the only one going to use this device but the chances of that are probably near to none.  Ive noticed this same problem using their amazon app for the android.  It is probably part of their marketing strategy and appears to be the only company I know that works that way.Now to my likes of this device.  The gaming controller is really good quality and the batteries seem to last really well.  I'm still on the same set when I first started messing with it.I do like the fact that you can install android games on this device and I do believe the selection will get better and better.  You can even side load games pretty easy the only problem I have seen with side-loading is they do not show up on the menu and you have to run them from the application settings.  I have side loaded XBMC and it works perfect.I hope amazon can get a few of these bugs worked out.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer \"uSeR 35o07\""}, {"rating": 4.0, "review": "Bought this several months ago. Setup was painless it already knew who I was which is a little freaky....video quality is good sound is good, remote performs great, just needs a keyboard to be able to use when you aren't searching for a movie. I actually added XBMC to it and works well. One con is if it loses internet connectivity it has to be reset this is just the amazon programming because the XBMC still works fine. I wonder why they haven't added the store access to it, seems like a no brainer to me. Also one pet peeve is having the first episode of a series free but you have to buy the rest....I thought I was paying for a Prime membership Hmmmm.I would recommend it to people.  It is incredibly fast I have a Roku 3 it is as good but not better.", "verified": true, "helpfulness": "0/0", "author": "masterofnone"}, {"rating": 5.0, "review": "Excellent unit, easy to install, easy to use, great compliment to TV.  I have a smart TV with Amazon, and other features built in.  However, the Amazon Fire TV is even easier to use than the smart TV.  I am very impressed with this unit.Cost of the unit is reasonable, small so it not conspicuous.", "verified": true, "helpfulness": "0/0", "author": "Donald E. Fellows"}, {"rating": 2.0, "review": "if you like games but don't want to invest the money in a computer or a console then this is perfect for you. But if you want to watch movies and TV channels and your favorite shows there is no real need to get this. There is really no added benefit over getting an apple tv or a roku, and with the limited app selection and weird compatibility issue I've had. aside from the voice search there is no real advantage to just getting the amazon prime app on the other devices. it even has a USB but you cant play media from it.Was really disappointed to buy it and given what i know now i would recommend something else for the price. given the state of amazon media i dont even think they have the pull to get the apps made that i want and the fact that most of the good media apps that are already on kindle, you cant even get i personally don't see the point", "verified": true, "helpfulness": "2/3", "author": "Delagi87 \"Desmond Gillespie\""}]