[{"rating": 4.0, "review": "This is a really cool little device, it was voted one of the top ten devices of the year by Wired.com .And I must agree with the Wired review, the chromecast has a lot of potential. Yes, there are some teething-problems still going on.Supposedly it's an entry point for hackers - makes your system susceptible to attack etc.It doesn't work with all devices - I can't get it to work with my Acer beamer. But this may be a problem with the power supply. The mini-usb hub on the back of my beamer might not be providing enough juice to power the chromecast. This means running an extra long cable to my chromecast from another power source, but this defeats the purpose -- I want to go wireless to my beamer.Despite the small discrepancies above, this is still a great device, I took over my girlfriends TV with it and beam whatever Youtube video I want into her TV now - fun! This device can only get better. The only 2 weak points as previously mentioned: 1.) possible hacker paradise, and 2.) The power supply must be just right.", "verified": true, "helpfulness": "0/0", "author": "Eric Z"}, {"rating": 5.0, "review": "I've had this item for about 6 months,bought it off of Amazon. Not only did it arrive at my home at the speed of light ,I have not had one problem yet,knock on wood,with the Chromecast. It's very easy to install and the Apps played on it are really good. I haven't even had any problems with buffering.", "verified": true, "helpfulness": "0/0", "author": "Monica Mangreum"}, {"rating": 4.0, "review": "hooked it up, went through set up, but haven't used it yet seems okay on my Sony.", "verified": true, "helpfulness": "0/0", "author": "Les Ungerleider"}, {"rating": 5.0, "review": "Works great!  Technology thing!", "verified": true, "helpfulness": "0/0", "author": "Thomas A. Rieger \"Vol Nation\""}, {"rating": 5.0, "review": "Works 100% as advertised.....only a minor learning curve for the slightly electronically inclined computer technician", "verified": true, "helpfulness": "0/0", "author": "beacon"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Carlos Brea"}, {"rating": 5.0, "review": "This is an awesome invention. Been waiting for this a long time.", "verified": false, "helpfulness": "0/0", "author": "Mary J McIntyre"}, {"rating": 5.0, "review": "very good product.connects easily with smartphone ,laptop or ipad.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Not workimg well with my wi-fi or TV. All time I had to reset my router before using it. Makes my laptop not able to connect to the wi fi.", "verified": true, "helpfulness": "1/1", "author": "Vahid"}, {"rating": 5.0, "review": "Simply easy to use and great function. Now I can watch all of my movies, pictures, comics on big screen tv through iPad, laptop and Galaxy S3 and even on-line videos. There are apps that enable your mobile devices to cast online videos to chromecast even though your devices don't support mirroing function.", "verified": true, "helpfulness": "0/0", "author": "Heung K."}]