[{"rating": 5.0, "review": "Received this as a Christmas gift!  Love it! The voice search feature worked better than anticipated.Since I 'cut the cord', I depend on Amazon Prime TV for movies and series.  Added benefit is listening to Prime Music while my Cloud photos roll through. Still learning all it can do.  Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Lisa Fairchild \"Lisa\""}, {"rating": 5.0, "review": "Works as intended.  Apps are great, but I do recommend running a line to the router to avoid overloading home wifi.  Showtime app is limited to service.  I find I watch it more than our Direct TV.", "verified": true, "helpfulness": "0/0", "author": "Nic Roewert"}, {"rating": 4.0, "review": "Easy to set up.Great picture Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Richard Thomas"}, {"rating": 5.0, "review": "Perfect...", "verified": true, "helpfulness": "0/0", "author": "Ray"}, {"rating": 5.0, "review": "It was a gift & I love it, saying goodbye to my cable Bill is great", "verified": true, "helpfulness": "0/0", "author": "Lisa Birkes"}, {"rating": 2.0, "review": "Need to be able to simply view and access the highly promoted free to prime programming. I am extremely disappointed!!", "verified": false, "helpfulness": "0/1", "author": "Gregg Stewart"}, {"rating": 3.0, "review": "The Netflix app isn't very user friendly and the layout/formatting isn't as straightforward as the Appletv. However it's got more variety and it's still easy enough to use.", "verified": true, "helpfulness": "0/0", "author": "Cailey"}, {"rating": 5.0, "review": "The Best!!!!!!!!!!!  Had over 20 streaming boxes over the years Popcorn,Gbox,Micca,Mede8er,Pi, you name it i had it. Just add X*** and your good to go FAST!!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "bobwire"}, {"rating": 5.0, "review": "The Amazon Fire TV is a great remote controlled interface for your TV.  If you have 'Prime\" membership with Amazon it becomes even more valuable  It will provide you access to Movies and TV shows without any additional cost. Even without Prime Coverage, the cost for entertainment will be less than anywhere; that I know about  You should buy one!", "verified": true, "helpfulness": "0/0", "author": "Philip Coulson"}, {"rating": 5.0, "review": "Shows load very fast and it's nice to have such a good menu. The box is small and the voice commands really work.The only downside is the selection of free movies on Prime.  I ended up getting a Netflix subscription.", "verified": true, "helpfulness": "0/0", "author": "Etta Williams"}]