[{"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/2", "author": "Jay H. Ross"}, {"rating": 5.0, "review": "I love it!  It's more than I expected.  :)", "verified": true, "helpfulness": "0/2", "author": "Jennifer"}, {"rating": 4.0, "review": "There are probably enough reviews of Amazon Fire TV to help you make your decision.  But let me add to the chatter...This is a fine offering from Amazon.  I have disconnected my Apple TV and Roku 2 devices and now only use this.  I liked Apple TV for its interface.  I liked Roku because it streamed Amazon Prime.  But Amazon Fire TV bridges the gap between these devices.  It has a fine interface, is extremely peppy, and of course easily accesses Amazon Prime offerings.As for the voice control: I was afraid it was just a gimmick, but I find myself using it all the time.  I just wish that I could use voice search to look for shows and movies on Netflix and Hulu.  For now, it still only searches Amazon's own content.  If they can fix this shortcoming, then this would be a perfect device for me.  This is my one and only reason for giving a 4- rather than a 5-star reviewWell done Amazon!", "verified": true, "helpfulness": "0/0", "author": "N. Krumpe"}, {"rating": 1.0, "review": "I'm an Amazon Prime member for many years...I purchased Amazon Fire TV to replace my Apple TV (which was recently fried by lightning), mainly because Amazon kept nagging me to do so...Shipped it airfreight (not cheap), paid duty on it(even less cheap)...Kids are all excited about all the cool stuff we can do....We all wasted our time setting it up, watching the tutorial,and browsing through all available content...BUT nothing will play because we're out of the US.Amazon should have mentioned this up front.Apple TV and several other similar devices work fine overseas but Amazon Fire does not!!", "verified": false, "helpfulness": "2/8", "author": "Kevin R Geiger"}, {"rating": 5.0, "review": "This small bluetooth device is GREAtIt looks great and is bluetooth unlike apple tv's can play video games and has every thing I need in a tiny little box.", "verified": false, "helpfulness": "0/0", "author": "Xander Broadus"}, {"rating": 3.0, "review": "Comcast Xfinity does not allow Showtime Anytime to work on this device (as is the case with Roku).  So, if you have Comcast as your provider using Showtime, you're out of luck.  Otherwise, the device is snappy and excellent.  Unfortunately, I'll be returning it, since Comcast isn't allowing Showtime to be used on the Fire TV.  I fear the same will be the case with HBOGO, when that comes out (since that is the case with Roku as well).  If HBOGO and Showtime both worked properly through comcast, then this would be the best streaming device out there.", "verified": false, "helpfulness": "0/4", "author": "K. Russell \"amazonlover75\""}, {"rating": 4.0, "review": "Not as robust as Roku, but a very good option for streaming.", "verified": true, "helpfulness": "0/1", "author": "Zahid"}, {"rating": 5.0, "review": "Editing this review because my question was answered, I received my Amazon Fire TV unit and it works great. I got an 3 plug HDMI extender, plugged my ATT DVR into one, the Fire TV into another, and had an extra one for laptop mirroring.I do not have perfect wifi reception at the TV in the family room, as it's quite a distance from my router, but it's still coming in pretty clear. Very satisfied:).", "verified": true, "helpfulness": "0/3", "author": "Alice"}, {"rating": 5.0, "review": "I love this thing netflix,amazon,hulu,crackle my photos my music even games how could anyone complain unless your just one of those type of people that gripes about everything but in my humble opinion i LOVE IT !!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Mchenry Bolden"}, {"rating": 5.0, "review": "Love it. Very small. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Kim Willis"}]