[{"rating": 3.0, "review": "I wish everything was in 1080 p but other than that it is a cool little gadget .", "verified": true, "helpfulness": "0/0", "author": "Travis"}, {"rating": 5.0, "review": "I love the Chromecast. I use it every single day and I have no complaints!Pros:Stream single tabs and fullscreen videos using chrome on any desktop.Stream videos out of chrome app on Android and iPhone.Stream Google Music, Netflix, YouTube, and dozens of other apps from your phone.I really like just having it turned on to see the interesting pictures. It makes for a very nice background on my when I am not using it.It will continue to stream music/videos if your phone turns off or dies! This is really convenient when I want to watch a video, but my phone is about to die. I do not have to worry about it!If plugged into the wall, chromecast icon will always be there and you can turn on certain TV's by just connecting to it.IT MAKES A FREAKING GREAT GIFT! I bought 4 of these, 3 to give away to friends because it is so affordable and such a great product!There are so many other pros about it!Cons:I noticed that if I plugged the power source of the Chromecast into the TV itself, whenever I streamed tabs from my desktop there was a severe lag to a point where it was not working at all. After plugging it into the wall, there was absolutely no lag at all! I think it is just that my tv usb output is very low in amperage, so it just was not getting enough power. Most TVs should be fine, but if you have this problem, try plugging it into the wall with the provided usb power brick they give you.", "verified": true, "helpfulness": "0/0", "author": "Jeff B"}, {"rating": 1.0, "review": "Had this working in my living room. Decided to move it to the TV in my bedroom. The thing became very intermittent. Couldn't connect to the network. And even when connected, none of my smart phones and tablets could see it. Spent a couple of hours doing factory reset and went through the setup process multiple times. Finally gave up and took it back to the living room. Guess what? It worked again. What does that mean? Well, my bedroom is somewhat further away from the WiFi router. My labtop, my PC and all my smartphones and tablets have no problem in my bed room, but not this stupid thing. Apparently it has a very limited WiFi range. Maybe those morons at Google will start selling external antennae?", "verified": false, "helpfulness": "1/1", "author": "Ming"}, {"rating": 5.0, "review": "Get it fast and work amazing", "verified": true, "helpfulness": "0/0", "author": "osher"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Hash Patel"}, {"rating": 5.0, "review": "My youtube, dailymotion and Netflix life is much easier.Roku is now gone from my bedroom.Love the very reasonable price, too!", "verified": true, "helpfulness": "0/0", "author": "Lei"}, {"rating": 3.0, "review": "Pretty much what most of the reviews say.  It generally keeps losing reception.  When it works, in's nice.  But, seems to be spotty at best.  Nowhere near as good as apple TV, but for the price it's OK.", "verified": true, "helpfulness": "0/0", "author": "Charles Miller"}, {"rating": 5.0, "review": "Love! Love! Love it! We have basic cable without a DVR. This has made it so we can watch OnDemand and not on a tiny laptop. Plus my husband can share his YouTube finds.", "verified": true, "helpfulness": "0/0", "author": "Tami M. Hawes \"tamikat\""}, {"rating": 4.0, "review": "First review: Stuck at 0% software update. Hasn't finish the set-up. Could not use it at all. Looking for a replacement. Also, called google for help desk.Second review: Based on web forum knowledge, I have decided to take the chromecast product to a friend that uses a different ISP. It completed the update, and finished up the set-up.Google was not that knowledgeable about the issue either. Had to call them few times and every time I got a different answer. It seems the call center didnt' have the right process in place to deal with this issue. Once my ticket got escalated to the engineering team I got an email saying that they are working with my ISP to find a fix.Anyway, in the mean time I have ordered a replacement from Amazon. I am shocked to find out that Amazon is selling different versions of chrome cast. The second one updated fine and finished up the set-up within minutes.Now, I have two units, first updated over my friend's network, and second one, the replacement. Both are working fine. I am thinking to keep them both.Pros: I enjoy the fact that I can share video, pictures, chrome tabs, screens, and more directly to my TV within seconds (there is a lag as chromecast need 30 seconds wake-up time).Cons: The Android phone is not a true remote. There is a lagging on syncing up the android to the image on TV. Also, once you lost the Netflix screen on your android, you cannot turn off the netflix signal going to your TV.Overall, great deal for what it does.", "verified": true, "helpfulness": "0/0", "author": "Mihaela S."}, {"rating": 1.0, "review": "Useless. Always loosing signal and can't stream your own videos. I'm just using Roku now.", "verified": true, "helpfulness": "0/0", "author": "Aude"}]