[{"rating": 4.0, "review": "Works great.  We have three phones and an iPad linked to it.  It has no problems.  I had some initial issues with YouTube..  But I think that might have been an issue with YouTube it's self not the chromcast.", "verified": true, "helpfulness": "0/0", "author": "Jcm800"}, {"rating": 1.0, "review": "The Crome Will not connect properly to the tv. It is Very complicated. Will not work right. It's a waist of money", "verified": true, "helpfulness": "1/7", "author": "Jayymmee"}, {"rating": 5.0, "review": "This would be perfect if I could just stream my laptop screen the entire time.Then again for the cheap price it is amazing.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "i tried and tired to get it to work,says internet not connected,which is wrong.i wont recomend this product to anyone.i bougth a rocu 3 works great.", "verified": true, "helpfulness": "1/4", "author": "James E. Hall"}, {"rating": 4.0, "review": "I bought the chromecast right as Google released the source code for it..translation... Instead of just a small amount of usefulness and functionality it is poised to expload in all areas of interest I'm happy with the purchase nothing else out there has the potential and price point", "verified": true, "helpfulness": "0/0", "author": "andy"}, {"rating": 3.0, "review": "Quite a nifty little gadget. Works well. The setup was easy. Can't wait for more apps to be compatible with this device.", "verified": true, "helpfulness": "0/0", "author": "Lucian"}, {"rating": 5.0, "review": "This is one way to stream video to your tv.  You install it and then pull up something on your computer, click and you are watching Netflix or HBO Go or whatever on your tv.It works off your wireless network.  A lot less than Apple TV and works off your computer as well.  Cool", "verified": true, "helpfulness": "0/0", "author": "Flats Man"}, {"rating": 3.0, "review": "I had this for a month and got it from Best Buy. I found it to be pretty useless. The only things you can stream to the TV were if they are in a Google Crome broswer, Youtube, Hulu, or Netflix. I am rather better off with just connecting my desktop to the TV directly though an HDMI cable. In addition, the devices that stream drain quickly trying to keep up a signal going to cromecast. I suggest only buying this if you plan on just using it to stream content from google crome or youtube. It can't do anything else!", "verified": false, "helpfulness": "1/2", "author": "Raj Kaye \"Peace\""}, {"rating": 5.0, "review": "Bought it as a gift and they loved it!  Came in great packaging and was brand new as described.  The product is great and is really handy.  Ended up buying another one for myself.  The possibilities are endless with the chromecast.", "verified": true, "helpfulness": "0/0", "author": "Paul Glazener"}, {"rating": 5.0, "review": "I have both and am an Apple fan,  unfortunately this is awesome and a surpior product to Apple TV. The ability to start a show with your device and then being able to turn that devicd off is a really awesome feature that has come in handy.", "verified": true, "helpfulness": "0/0", "author": "W. Design"}]