[{"rating": 4.0, "review": "I am glad I made the move from Apple TV.  I have found the Prime selection much better, the device is easier to use and the games feature puts it over the top.", "verified": true, "helpfulness": "0/0", "author": "Michael Waide"}, {"rating": 5.0, "review": "It is great!  I have enjoyed watching all the movies - some new, some old!", "verified": true, "helpfulness": "0/0", "author": "Q"}, {"rating": 5.0, "review": "It's provided every avenue it said it would. My experience is exactly what it's meant to be. I love it.", "verified": true, "helpfulness": "0/0", "author": "Marika Blaze"}, {"rating": 3.0, "review": "The good:- Extremely snappy- The remote is OK- It runs XBMC/Kodi really, really well.  1080p output, plays anything you throw at it.The bad:- No Youtube support -- the 3rd party youtube app is completely worthless.The ugly:- Launching XBMC/Kodi requires digging into a special menu", "verified": true, "helpfulness": "0/0", "author": "Andrew Jones"}, {"rating": 5.0, "review": "Set up was ridiculously easy. The only glitch was with my Sony HT-XT1 sound bar. The  Fire TV device needs to plug into the sound bar next to the blu-ray to get sound from the sound bar.The user interface works great and is as intuitive as anything I have ever used. Haven't used the voice activation yet.Overall I am thrilled and love the device.", "verified": true, "helpfulness": "0/0", "author": "Mark Braidhill"}, {"rating": 5.0, "review": "Fire TV came registered and was easy to install and navigate.  We LOVE the microphone feature!  Being from New York City I often have to put on my \"radio voice\" when utilizing voice commands but not with Amazon Fire Voice remote!  As a Prime member this is a HUGE value to the membership with so many free TV and movie choices.  I was reluctant to renew my Prime membership but now it pays!  Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "NYJetBaby \"Maria D.\""}, {"rating": 5.0, "review": "have used iit to watch three movies and i an very pleased. easy to use", "verified": true, "helpfulness": "0/0", "author": "jean lafurney"}, {"rating": 5.0, "review": "working great,i keep finding more great programs", "verified": true, "helpfulness": "0/0", "author": "Theodore Pelto"}, {"rating": 4.0, "review": "Although I haven't had time to explore all the functions available, what I have used worked perfectly. Quick loading and very nice picture.", "verified": true, "helpfulness": "0/0", "author": "nelson goodman"}, {"rating": 5.0, "review": "I must say i haven't had another media player, but i had a very good idea of what i was looking for, and this is it!. A powerfull tiny box that allow me to play video games and streaming apps, for the price i think is a excellent product!, my kid loves it. The only one thing i think  they could improve it's the internal space for apps (only 5.5 Gb) but this depends of your use.", "verified": true, "helpfulness": "0/0", "author": "Ivan Santana"}]