[{"rating": 2.0, "review": "I was disappointed that the hardware only streams Google content. I have NetFlix and TouTube on all my TVs. Returned device.", "verified": true, "helpfulness": "3/4", "author": "Brazil 2014"}, {"rating": 5.0, "review": "Now i can use my tv as a smart tv and even on my monitor is it as a tv and with the 3 months of Netflix the cost was more than cheap,I gave it 5 stars and my recommendation", "verified": true, "helpfulness": "0/0", "author": "Alan"}, {"rating": 4.0, "review": "This was very easy to hook up. App for my iPad and off to the races. Biggest issue is that it really just works with YouTube and Netflix. So it does not transmit everything from your tablet or smart phone to the TV.", "verified": true, "helpfulness": "0/0", "author": "A"}, {"rating": 5.0, "review": "Couldn't be happier with how easy it is to use or how well it works. If you have an HDTV with HDMI jack, wi-fi, and an ordinary Win7 or newer netbook/laptop or equiv you are ready to go in 5 min from opening the package. All you do is install and use the Chrome browser and cast the active tab (with Netflix, YouTube, or whatever) to your TV. Great quality. It just eliminates the need for a cable to your TV. There are lots of other tips from reviewers here on ways to stream other audio and video. For $35 it is such a bargain. I cannot understand those who are gripping about it, but I guess there are always some of those. Get it and enjoy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This product was easy to use and set up can't wait for more content to arrive.  WiFi set up a cinch.", "verified": true, "helpfulness": "0/0", "author": "asyoulikeit"}, {"rating": 3.0, "review": "I don't know of many households that doesn't already have at least one way to get Netflix or YouTube onto their television.  Between gaming consoles, Blu-Ray players, smart TV's, etc., most people can already watch these services from their couches.  And because of this, I only had one hope for the Chromecast, and that was to be able to watch internet video in a browser on the television.  With all of the network and cable channels posting shows you may have missed the night before, it seems like a great convenience to be able to do this.  Enter the Chromecast.How Do You Control Chromecast: There are many reviews as to how easy Chromecast is to set up, and it is! But what wasn't clear to me was how to control Chromecast.  I knew it could be controlled from your smartphone, but didn't realize it would make a difference which one.  I have an iPhone and iPad, both of which can control Chromecast.  Much to my disappointment, you can only broadcast Netflix and YouTube to your TV when using an iPhone / iPad product.  I know I purchased this solely to want browser video, but it would have been nice to get more than two apps (of which I have 5 other ways to already play on my TV).  If you have an Android phone, you can add Google Play to the list of apps.  Wow!  Very disappointing for two of the biggest smartphone platforms.  Oh, and neither will broadcast through an internet browser.That's where your laptop / desktop comes in.  I only have a PC running Windows 7, so I can't speak for Apple products.  But there is a plugin for Google Chrome to allow it to broadcast to the TV.  The key to this is that the PC / Laptop MUST be on your wireless network.  It will not work if your only connected to a wired network.  My PC is connected to my network via CAT 5 cable.  Fortunately I had an old wireless card laying around so I didn't have to invest any more money.The biggest problem with using a PC is that it is usually in the other room.  This means you have to run to that room every time you want to pause, FF, REW, etc.  So, the convenience of a laptop is better.My bottom line......Netflix, YouTube and Google Play are not even close to enough apps to premier this item.  And broadcasting Chrome only from a PC / Laptop is too limited.  I would have given this two stars for all this, but then you have to consider the $35 price tag.  That bumped it to 3 stars.Someday, this Chromecast can be amazing if Google gives it the support it needs.", "verified": true, "helpfulness": "0/1", "author": "PatMc007"}, {"rating": 5.0, "review": "So If you have an Xbox and a cell phone / tablet it does the same thing. I can push YouTube to my Xbox over a wifi connectionIf you have a Computer that is connected to wifi you can push YouTube to this and control any YouTube with several remotes found on an Android Phone or Tablet.Don't waste your money and purchase this when you can ALWAYS do the same thing different ways.", "verified": false, "helpfulness": "1/2", "author": "Noah Williams"}, {"rating": 4.0, "review": "Works well and easy to install, but limited on apps - YouTube and Netflix.  You can broadcast web browser from a standard laptop.", "verified": true, "helpfulness": "0/1", "author": "Ronald Brocious"}, {"rating": 5.0, "review": "Does what a lot of other devices can do but does it flawlessly and seamlessly. Great price and incredibly slick looking.", "verified": false, "helpfulness": "0/0", "author": "M. R. Greer"}, {"rating": 2.0, "review": "I love google. I have a nexus 7, a nexus 4, and a chromebook; I use google drive for everything and since they released quick-office I have sworn off of owning a traditional windows PC ever again. I really, really, really wanted this to work (and expected it to). When they released this I thought it was too good to be true, and - in one very important area - it is. I couldn't connect the thing to my wireless network, which obviously renders it useless. I followed all of the troubleshooting recommendations, resent my router, tweaked the settings, tried connecting it repeatedly, and nothing.Now, I know that this is technology, and as someone who is tech-savvy, I understand that hiccups are to be expected; but something that I love about google devices (pure google devices - Nexus devices and chromebooks) is that THEY JUST WORK. I'm sure that if I had spent hours trying to correct this issue, I'd eventually have found a way to connect the chromecast and all would be well, but I expect better from google because they have provided me better. If I can connect a dozen devices to my wifi with no trouble at all, I should be able to connect this to it as well. I envisioned a plug, connect, and stream process that was seamless - or at least relatively seamless and painless. If my expectations had been met this would be a 5 star review and I'd have bought two more for every monitor in my home.As a concept, I'm certain that this model is going to revolutionize how we stream media; being able to carry around something the size of a usb-stick, plug into any HDMI enabled monitor as long as you have a wireless connection, and then streaming all of your personal content from a smartphone, tablet, or PC...It is an awesome concept which I'm sure will be perfected by someone soon, it just isn't there yet.", "verified": true, "helpfulness": "1/2", "author": "Jacquelyn Harvey"}]