[{"rating": 5.0, "review": "this product works great and not a hassle to get up and play movies in minutes, thanks thank you, thanks", "verified": true, "helpfulness": "0/0", "author": "dave d"}, {"rating": 5.0, "review": "The Chromecast is a great way to instantly upgrade your \"dumb\" TV into a smart TV. While the apps are still limited, it does a great job of allowing you to select the content you want to watch from your phone instead of having to squint and read the fine print on your TV from 12 feet away. I would recommend buying one for every room in the house (that has a TV of course).", "verified": true, "helpfulness": "0/0", "author": "PETER MCDERMOTT \"Peter\""}, {"rating": 5.0, "review": "I wan recommend this to anyone who is tired of being forced to pay the high cost of cable on demand programming or people who want to view their you tube videos on the big screen.  It is faultess.", "verified": true, "helpfulness": "0/0", "author": "James V. Bellanca, Jr."}, {"rating": 2.0, "review": "Limited to what you can do and only good if you don't have a tv that displays netflix and all other major apps.", "verified": true, "helpfulness": "1/2", "author": "Manu singh"}, {"rating": 5.0, "review": "Love the Chromecast. I can stream just about anything from the PC wirelessly. More apps coming soon I think. Thanks Google.", "verified": true, "helpfulness": "0/0", "author": "AJ Snook \"AJ\""}, {"rating": 3.0, "review": "Not well satisfied as it frequently disrupts streaming even if the streaming device is in couple of feet away. Could be an issue with this chrome cast.", "verified": true, "helpfulness": "0/0", "author": "MrRam"}, {"rating": 5.0, "review": "Excellent product, really worth for the money spent. Actually it's dam cheap when you compare with it's peers.Works fine without any problems, no buffering, no interruptions. Works smoothly.", "verified": true, "helpfulness": "0/0", "author": "Senthil kumaran"}, {"rating": 3.0, "review": "For some reason I thought the quality and speed of the content would be as good as having an HDMI cable hooked up to my computer, but it wasn't.  I love the convenience of being able to stream via tablet, but with the computer the speed isn't that great to be honest.", "verified": true, "helpfulness": "0/0", "author": "Carlo Lata"}, {"rating": 1.0, "review": "did not like it,always crashing and had to connect again and again,is a good idea but for what i needed it videos and movies it sucked.", "verified": true, "helpfulness": "1/1", "author": "javier reyes"}, {"rating": 5.0, "review": "I love it! I just wish I had more time to use it. I love watching my Netflix on it.", "verified": true, "helpfulness": "0/0", "author": "S. Nagel"}]