[{"rating": 5.0, "review": "Love this thing so much... Wish I bought it sooner.", "verified": true, "helpfulness": "0/0", "author": "Emerson"}, {"rating": 5.0, "review": "It is so simple and straight forward and easy to use.  The only issue with it is that there are not nearly as many apps as there are with Apple TV but that is changing.  But the apps that are there work well.  I would recommend it, especially at the price.", "verified": true, "helpfulness": "0/0", "author": "Dwight D Burchak"}, {"rating": 5.0, "review": "all as expected, thanks", "verified": true, "helpfulness": "0/0", "author": "isadore fist \"issy\""}, {"rating": 4.0, "review": "Very good doesn't work with win surface 2", "verified": true, "helpfulness": "0/0", "author": "GERARDO VAZQUEZ"}, {"rating": 5.0, "review": "Excllent!!!", "verified": false, "helpfulness": "0/0", "author": "Ramiro Card"}, {"rating": 1.0, "review": "I bought for use in my RV while out in the woods, far away from the internet.  I have a wireless router (WiFi) establishing a LAN for my NAS and other networked devices. I am unable to stream content from my NAS to the Chromecast via WiFi without an internet connection.", "verified": true, "helpfulness": "0/3", "author": "SkiBumBob"}, {"rating": 3.0, "review": "it can cast all android device in your tv but not windows......So eventually its not what i wanted....It only can cast Chrome browser(only one tab at a time) from the windows PC  or Tablet", "verified": true, "helpfulness": "0/1", "author": "KAZI ASIKUZZAMAN"}, {"rating": 5.0, "review": "Love my chrome cast! I've been wanting one for a while, and I finally got it. So happy. I use it every day! They're always coming out with new apps that are compatible. Awesome.", "verified": true, "helpfulness": "0/0", "author": "Aly Sherman"}, {"rating": 4.0, "review": "Pretty awesome alternative to not having cable. You can stream from your phone and saves a ton of money on not have a cable bill..You can stream, Netflix, Hulu, YouTube and basically anything that you can watch on your phone.", "verified": true, "helpfulness": "0/0", "author": "Jesus Princess"}, {"rating": 3.0, "review": "I purchased the Chromecast to use with my Nextbook computer running Android 5.0. I get horrible performnance streaming videos.", "verified": true, "helpfulness": "0/0", "author": "Ronald D. Trcalek"}]