[{"rating": 5.0, "review": "Very good. The hook up was easy", "verified": true, "helpfulness": "0/0", "author": "Helen"}, {"rating": 4.0, "review": "I found the Amazon Fire TV very easy to connect all by myself. It was just amazing. The searches for things to watch were laid out very smartly. Being able to put items on my wish list is very helpful. AndBut what was I expecting . . .it's Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"mystery/suspense diva\""}, {"rating": 2.0, "review": "We purchased the Amazon Fire Tv last night and signed up for amazon prime. The box was $100 and Amazon prime was$99.99/year. We werent expecting to have to pay for every episode of any decent TV shows or movies in addition. Anyone else have a thought??", "verified": true, "helpfulness": "0/4", "author": "Harland Hafter"}, {"rating": 5.0, "review": "One of the best purchases we've ever made to enhance our digital life at home. Now that I have my FIRE, I do not need to rely on using my PS3 to watch Netflix, Instant Video or Hulu.The unit is very fast and is able to switch between applications without hesitation. Besides performance, the Amazon FIRE looks great in our living room.", "verified": true, "helpfulness": "0/0", "author": "Interalejo \"A. Gonzalez Urquia\""}, {"rating": 5.0, "review": "Love, love, love this! Best purchase ever. I can binge watch just about any series either on Prime or Netflix. Plus you can rent movies with one click and without getting off the couch. It took me about 3-4 minutes to set it up and have had no problems.", "verified": true, "helpfulness": "0/0", "author": "Coppermom"}, {"rating": 5.0, "review": "Great way to view old (like me) television from \"back in the day\"", "verified": true, "helpfulness": "0/0", "author": "Jo Shafer"}, {"rating": 5.0, "review": "Works great - matter of fact I got my father-in -law and my daughter to buy one. Only disappointment was I paid $99.00 for it and 2 days later it went on sale for $79.00. My relatives got the sale price.", "verified": true, "helpfulness": "0/0", "author": "Richard V. Pilukaitis"}, {"rating": 3.0, "review": "It works well and easy to set up.  Just wish there were an SD option for TV and movies as we have very slow DSL and that would help with too frequent buffering.", "verified": true, "helpfulness": "0/1", "author": "Kimberly M Tollers"}, {"rating": 3.0, "review": "The unit did not work properly screen content showed as a slide show from start up thru all options called customer service very sympathetic and that's where it ended. Finally a week later I found someone who understood and sent out a new unit so far so good", "verified": true, "helpfulness": "0/0", "author": "William \"Bill\""}, {"rating": 5.0, "review": "Amazing ! I'm so glad I kept purring off buying the Downtown Abbey series. Seasons 1-4 are on here. I had missed several programs in all the series so I sat down and started with Season 1 and watched every show in seasons 1-4.I got rid of cable 2 years ago , and now I can cancel Hulo and Netflix. That's an $18.00 savings. It's absolutely the best.", "verified": true, "helpfulness": "0/0", "author": "Brigetta"}]