[{"rating": 5.0, "review": "Great product fast shipping .", "verified": true, "helpfulness": "0/0", "author": "Anthony Russell"}, {"rating": 5.0, "review": "WORK GREAT", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "For the price, it is a pretty cool device.  Not as good as my Apple TV, but not the same price point.  Would be nice to have it's own controller for the most popular items.  It's clearly stated that it doesn't, so I can't complain.  I'm able to sync my Apple TV controller to my universal remote, so it makes for not having to use multiple remotes (sure the same can be said of any streaming device with controller).  Even my 5 year old can use.  This one is a bit more complex, with using the remote and device, but 8 year old can easily do.  I do like the idea of queuing up multiple Youtube episodes, which keeps my 5 year old happy and not tying up both the TV and iPad.", "verified": true, "helpfulness": "0/0", "author": "Porktown"}, {"rating": 5.0, "review": "I have bought 2 of these, and 2 as gifts. They are great,  as there are still little quirks in the programming, it is usually whatever app I am using to blame and not the actual chromecast software.", "verified": true, "helpfulness": "0/0", "author": "Austin S."}, {"rating": 5.0, "review": "Excellent Product :-)", "verified": true, "helpfulness": "0/0", "author": "Eduard Finkel"}, {"rating": 5.0, "review": "great device, easy to set up. Arrived early", "verified": true, "helpfulness": "0/0", "author": "ladyjane"}, {"rating": 5.0, "review": "I love this product! Works perfectly with my Galaxy S4 and Galaxy Tab 2.", "verified": true, "helpfulness": "0/0", "author": "Carlos Peralta"}, {"rating": 5.0, "review": "fast delivery, great product", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "ED"}, {"rating": 3.0, "review": "The only problem with this is that the volume will go up and down throughout the entire stream.  Youtube connects perfectly but apps like CBS don't stream real well.", "verified": true, "helpfulness": "0/0", "author": "Alisa Owen Stuwe"}]