[{"rating": 5.0, "review": "Bought this because I have Prime and was not utilizing the videos to the fullest. It arrived yesterday and I've been unable to stop watching. What a joy! Why didn't I do this long ago?", "verified": true, "helpfulness": "1/1", "author": "freshwater conch"}, {"rating": 5.0, "review": "First off, I have a 42\" LG 120hz in my bedroom with Samsung 5.1 BluRay/Home Theater combo (all-in-one unit).  I had a Chromecast for about an hour (returned due to compatibility issue with my wireless AP) and Roku 3 for about half a day (My BluRay combo doesn't decode DD Plus via HDMI, so I had Stereo or nothing).  This Fire TV does it all...Optical Out, HDMI, Ethernet, Wifi...works great and is incredibly quick.  I finally have 5.1 and the quality HD video I was looking for...I'm using it for Netflix, Prime Videos, Hulu, Crackle, Pandora and TuneIn...I could not be happier.  All these items and more in one location on one input.  The optical goes to my BluRay combo, and HDMI to my tv direct...I've spent more time infront of the TV since I got this than ever before.  You will not be disappointed, the value here is amazing.  I can't say I have a single con to post.", "verified": true, "helpfulness": "2/2", "author": "Michael"}, {"rating": 2.0, "review": "I was excited to get the Amazon Fire TV because we had an old Roku that was beginning to glitch.  It was easy to set up, and streamed great the first day.  The trick to the first day was no one else was using their computers, tablets or streaming. By the next day, no one could do anything else on the Internet if someone was using the Fire TV, or if they tried, the Fire TV would slow down and load for 5-10 minutes every minute or so.  This went on for a couple of days and I didn't make the connection to the Fire TV, I thought it was our ISP.  I called and complained and they sent out a tech to check our signal, modem and router.  All worked perfect, but they told me there was something that had been added recently that was messing up our WiFi.I finally started testing things and discovered that everything worked when the Fire TV wasn't hooked up and even our old Roku streamed faster than the Fire TV.  I called an Amazon Tech who had me try a couple things and then told me that he could see our streaming kept varying between 1-3 Mbps and that the Fire TV uses 3 Mbps when it is streaming, it works best with Internet service of 5 Mbps or more.  His suggestion was that we either increase our Internet service speed or return the Fire TV.We have a Sony streaming device and our old Roku, several tablets and our computers that stream just fine with what we have now, granted, the picture quality on the Fire TV is higher on than the Roku, but I would rather have the streaming working than the best possible picture quality. I feel that Amazon does not clearly state that you need more than 3 Mbps to adequately use the Fire TV.  I now have a bill to pay our ISP for sending out a tech to try to solve the problem caused by the Fire TV. Amazon agreed to refund my $6.98 for return shipping on the Fire TV. Sadly disappointed in it because I love my Kindle Fire HDX.", "verified": true, "helpfulness": "5/9", "author": "Jennifer J. Smith \"Efficiency Watch Dog\""}, {"rating": 5.0, "review": "Purchased this for my parents.  They are pleased, I'm pleased.  Thought about purchasing one for myself, but I already have a media center solution.  If I ever need anything like this in the future this box will be the top of my list.", "verified": true, "helpfulness": "1/1", "author": "Aaron Jarrett"}, {"rating": 5.0, "review": "AFT is packed with hundreds of options. If you have Amazon Prime it saves you money because many movies and series are free. And when my Amazon MP3 library is available I'll be even happier.One thing to watch out for is navigating toward the \"Watch with Amazon Prime\" button. It is set up to easily click the wrong place and order the movie or TV show using a paid option or worse yet to buy a whole season. Be careful navigating!UPDATE! I finally got the music update and that completes my happiness with Fire TV. Anything more is gravy.", "verified": true, "helpfulness": "3/3", "author": "SteveinEugene \"Max\""}, {"rating": 3.0, "review": "I had early frustration with my first unit.  There was an incessant buzzing over all the audio.  The replacement unit worked fine.  The amount of content available with my Prime membership is growing, but much of what I go looking for requires purchase.  Rates for content seem competitive for the most part.  I have not used this as much as I imagined that I would (defaulting to my cable's ppv - out of convenience - or netflix).  This is a revision of an earlier review that was more negative, so I do believe that there is a place for Fire TV and as Prime content grows, it will get better and better.", "verified": true, "helpfulness": "4/6", "author": "Christopher D. Orear \"cdorear\""}, {"rating": 3.0, "review": "The streaming is excellent and everything is available through Amazon Fire. The biggest disappointment is that you have to pay for almost everything whether it's movies or tv. Nothing is said in any of the advertisements about that and we are all under the impression that more is available free.", "verified": true, "helpfulness": "4/6", "author": "literate"}, {"rating": 4.0, "review": "I really enjoy amazon TV it allows me to centralize all my media needs and desires into one location, and the Voice ability is awesome!!But the voice has a tendency to misunderstand what I am saying , maybe it's my Boston accent I don't know but would be nice not to have it come up with a list that has nothing to do with what I really wanted. another problem is that it has very limited apps for the device this I am sure will be remedied as more companies and games jump aboard, the other problem is the apps you do have seem to have a high rate of degrading I don't know how many times I have had to delete and download it again over and over Netflix but it is getting old fast hopefully there will be a fix for this in future updates.If you buy it you have to be an amazon prime member if your not it's just an expensive storage unit for apps. hopefully amazon will enlarge their prime movie offerings so the 100 dollars a year ya pay for prime is a better value.That being said and if you are a prime member I think the product is great for what it does do right and well worth the 100 bucks I paid to get it", "verified": true, "helpfulness": "1/1", "author": "william stlouis"}, {"rating": 4.0, "review": "I think this is the best, everything in one place.The voice search doesn't work  very well.Not that easy to set up, keeps crashing.", "verified": true, "helpfulness": "1/1", "author": "Roxie"}, {"rating": 5.0, "review": "With an antenna on the roof and Fire TV I get all of the shows that I want to watch.  The setup is simple.  The voice commands are easy to use.  And Fire TV makes is simple to subscribe to the services I wanted.  I was concerned that my internet was too slow because they said it was only 1 meg.  And I have had some buffering at certain times of the week.  But I can deal with that.", "verified": true, "helpfulness": "1/2", "author": "S. Stier \"US average guy\""}]