[{"rating": 5.0, "review": "Simple set up -- just follow the directions included in the box. I've been switching between the Roku and Chromecast. Available apps typically stream really well via the Chromecast; sometimes they are glitchy and seem more like beta versions. The tablet and smartphone touchscreen interfaces are definitely much more convenient than the Roku's remote control-operated interface. I hope that developers will crank out more apps and the existing apps will become more stable as the product matures. Definitely lots of potential with this little stick.", "verified": true, "helpfulness": "1/1", "author": "ML"}, {"rating": 5.0, "review": "Setup was a 1 minute job (plus 2 more while it updated the software and rebooted once). Once installed, I sent streams from Plex and also from Youtube from an iPhone and a Note 10.1 - all worked just perfect. Amazing Google product.", "verified": true, "helpfulness": "0/0", "author": "Dragos GROSU"}, {"rating": 5.0, "review": "Learned a few tricks that make using Chromecast pretty great. Hoping I can be able to use my aAndroid browser as well as my PC Chrome browser", "verified": true, "helpfulness": "0/0", "author": "Keith Kirlew"}, {"rating": 5.0, "review": "The functionality is great, it's simple to use, and - maybe most importantly - my wife loves it :-)She came home from work last weekend and I had Thuy Nga 109 streaming on our TV in 1080p from YouTube. She asked me how I did that, and I said, \"Magic, baby!\" After a little while, I told her how it was really done, and she likes it so much that I'm going to get one for our other TV, as well.I often find stuff on YouTube that I want to show to our kids b/c it's cool and/or educational. Today, it was sand bubbler crabs. Much nicer on the big screen with home theater sound. The Chromecast does more than just YouTube, but even if that's all you use it for, it's a bargain at the price.The only slight fly in the ointment is that - at least on Linux - the Chrome plugin that allows casting to the Chromecast works rather poorly, with the framerate cut by 50% or more. That's a pretty minor use case for me, though, to the point that I didn't even take off a star for it.", "verified": true, "helpfulness": "0/0", "author": "SpamFreeOrDie"}, {"rating": 4.0, "review": "The Chrome cast was easy to install, works great, but we found it very limited in what could actually be \"cast\" from the web.", "verified": true, "helpfulness": "0/0", "author": "Sundownr"}, {"rating": 4.0, "review": "Good buy, fast deliveries as promised.....The prodect is in good condition. This is the cheapest solution to watch online video if you don't havw smart tv.", "verified": true, "helpfulness": "0/0", "author": "elaine"}, {"rating": 2.0, "review": "I was very excited to use this device and it works only at times. Most of the times the lag in streamed content, uneven buffering, or just plain \"unable to cast\" error has kept me wishing that I should have never bought this device. I would advice everyone to explore other options.", "verified": true, "helpfulness": "2/2", "author": "S. Deshpande \"Leher80\""}, {"rating": 5.0, "review": "Love using this thing to stream to my TV from a plethora of Internet connected devices.  Can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Christopher Z."}, {"rating": 5.0, "review": "Works great as advertised.  Will stream from my Samsung G3, Nexus 7, and Chrome browser.  Highly recommend to anyone wanting to stream wirelessly to their TV.", "verified": true, "helpfulness": "0/0", "author": "nizmister"}, {"rating": 5.0, "review": "Love this device, easy to install and use, to projct your Youtube, Netflix and Amazon prime videos ..... Excellent gift for someone who does not have an smart tv.", "verified": true, "helpfulness": "0/0", "author": "gromero"}]