[{"rating": 5.0, "review": "Wow this makes my TV so much better and only costs 35 bucks!!  I can't believe it! I can't wait to have it! I'm gonna but maybe 2 more after testing it!!", "verified": true, "helpfulness": "3/108", "author": "L.J."}, {"rating": 5.0, "review": "I love this simple little device. Really what I wanted was a cheap solution to stream google play music all access through my receiver and have the ability to control with my phone. ( was thinking about getting one of those Android micro computer dongles for $50- $100) I have the Chromecast hooked into the back of my Onkyo TX-NR509 receiver.The receiver is networked and has the ability to play pandora and Spotify ( and couple others services) but the Onkyo phone app works half of the time and I don't have a Spotify account. The interface was pretty crappy as well. The Chromecast fixes this and makes playing my music simple and seamless. I use my Galaxy note 2 mostly with the Chromecast although I have used my wife's iPad, her iPhone 4, and even an old iPhone 3GS has worked streaming youtube. I can also use my Macbook pro to stream from the Chrome browser. I have not had any issues using the chrome browser to stream. One thing I noticed on moonlight media is that the lip sync was not spot on but that was because of the site. When I used ABC to stream Modern Family everything was spot on with lip sync. My wife and I had fun streaming videos of our daughter from youtube onto our Plasma. It is also cool if you see something you like on youtube you can just cast straight to the TV without any effort really. The nexflix interface is pretty sweet. Better than the Roku or Xbox 360 I have.When you hook up your Chromecast to a receiver make sure that everything is turned off so you don't get any HDMI handshake issues.  One of the benefits of hooking up to your receiver is you can turn your TV off and listen to your music without having the TV on. When you are watching TV it still works to change inputs to Chromecast when casting but you can't change back to the original source without your remote ( not yet anyways, would be a cool feature but oh well).New apps I would like to see are:-Google + integration so you can sling pictures and videos to the TV ( Seems like this is a no brainer) Even if they (Google) don't want to you to be able to send local files to the TV a good compromise would be using google + to do this.- HBO GO- Facebook integration could be cool as well. One thing cool already is that if someone shares a Facebook link to a youtube video you can just sling it right to the TV to watch instead of your phone or computer.- Vine or Instagram integration would also be sweet.- maybe a game could be developed where multiple people could use their phone to play on one TV for when you have people over. (jeopardy, Catchphrase, are you smarter than a 5th grader ext....", "verified": true, "helpfulness": "1/1", "author": "kingmb"}, {"rating": 5.0, "review": "I had some hands on time with the chromecast today at the event and I can say that it is almost flawless. Everything connected super quickly and google's solution to TV video streaming is perfect. Even the laptop chrome tab viewing (which is in beta) worked without a hitch. You also do not need the power cord if your HDMI port is relatively current (I think it's HDMI 1.4 and up?). Additionally, because it is totally cross platform, it makes it useful to anyone. At the 35 dollar pricepoint, I can't fathom why someone wouldn't want this device.", "verified": false, "helpfulness": "134/213", "author": "Aragorn"}, {"rating": 5.0, "review": "I first posted this 18 months ago from Amazon the day it first came out.  Didn't use it much at first.  Now may use it almost daily.  I just raised my rating from 3 to 5 stars.  Actually, it is now a 5 star device - IF you have one of about 20 diff. Android phones bcause it will quickly cast ANYthing that shows on the phone screen.  IF you can get a picture or video or app to display and run on the phone screen, it will cast to the TV.  If you are stuck in the Apple herd, at least for now, no Apple devices have this great new feature.  We can now run XfinityGo, ESPN, HBO, SHO etc. apps along with the usual Neflix, youtube etc. In our 2nd home.  This means we can cut way back on our cable bill there.  Can even cast CNN and MSNBC and other news via the Xfinity app.18 month old review is below:Just got it today from Amazon.Set up on Android phone and tablet was easy.  Wouldn't go on ipad 1.  (at least for us)  Did go on Win7 laptop.  Major disappointment was Netflix.  Send instruction from phone to start playing BBC Sherlock Holmes from Netflix.  Pic quality was barely SD.  Then replayed those first five minutes and rest of program on Netflix from the built in Netflix app on our Panny plasma.  HD quality.  We also get HD like streaming from Netflix from our Sony BD player's Netflix app.  Since this is a work in progress - will just give it an \"average\" rating for now and come back in a month or two.  This product could be a major \"life\" changer.  I am surprised that there is no Amazon app since they were one of only two outlets (BBuy being the other) to carry the product.  Am glad I got it.", "verified": true, "helpfulness": "0/0", "author": "M. Thaler"}, {"rating": 1.0, "review": "Nice try, but this thing rarely works ad advertised. The streaming video constantly drops frames, making it choppier than Android. Also it requires power, no MHL HDMI support here. The ROKU stick is worth it. I guess you get what you pay for.", "verified": false, "helpfulness": "31/606", "author": "Mystic \"Maven\""}, {"rating": 5.0, "review": "Listen I'm a college student who is very very very very broke, somthing like this I can't pass up because I am only limited to what's on campus. Go google you bought me out, plus I use netflix constantly works for me", "verified": false, "helpfulness": "9/121", "author": "CollegekidpA"}, {"rating": 3.0, "review": "Look, all the functions it can provide are exactly the same as many similar products, i.e. an Android TV stick, like MK808 Dual Core Android 4.1 TV BOX etc.This Chromecast does not release its spec, we wonder what are the processor and memory?You wont know until it is physically released.Look at the price, very similar to its competitors. I am sure it is manufactured in China, lol !We would like to trust Google's product, and it just costs around one third of an Apple TV, go for it!!!", "verified": false, "helpfulness": "4/232", "author": "T. Wu"}, {"rating": 1.0, "review": "If you want to watch YouTube on your TV this may be the device for you.  However the Roku or Apple TV are both much better options with more content options.", "verified": false, "helpfulness": "27/742", "author": "K. Stanchfield"}, {"rating": 4.0, "review": "Regarding the power, the description specifically informs that a USB power cable is included with the item.  People who believe in the impossible: read the fine print, do your research!I have apps on my TV, too, but they are difficult to use, and I can only use my game controller on one tv at a time.  This way I can easily move from TV to TV.  I can't wait to try it!Four stars because I have to buy it...", "verified": false, "helpfulness": "6/147", "author": "Amazon Customer \"Bookworm\""}, {"rating": 5.0, "review": "Sure its only a few hours old. Nobody has this in possession yet. But the idea of this is amazing. Being an Apple Tech, I applaud Google and the products announced today. Its nice to see that some company is being innovative and cheap. Bravo. I'm sure when I have this I'll be a happy nerd.", "verified": true, "helpfulness": "8/134", "author": "digitalwolf7"}]