[{"rating": 1.0, "review": "Seems to be temperamental with when it wants to stream quality video. Often lags even on a secure high speed connection. Would be more useful if it also streamed everything else on computer screen and not just video. I am sticking with the old fashioned VGA cable and wireless mouse for now.", "verified": true, "helpfulness": "1/2", "author": "Leea V Allen"}, {"rating": 5.0, "review": "I got tired of being screwed by direct tv so now I streaming Netflix from my smart phone and I wont look back", "verified": true, "helpfulness": "0/0", "author": "greg carter"}, {"rating": 1.0, "review": "Overheats and drops sound. Must constantly cycle power and reattach. Not happy. Thank god I only purchased one of thiese.", "verified": true, "helpfulness": "0/1", "author": "Ed J"}, {"rating": 4.0, "review": "I bought this to use aboard my sailboat.  It was easy to set up and works great with my android phone.  Now in the evening at the dock, I can watch Netflix movies via WiFi from the club house.  When I set it up at home, to test it, I had some minor difficulties but those seem to have disappeared.", "verified": true, "helpfulness": "0/0", "author": "Paul Dale"}, {"rating": 3.0, "review": "The price was good but AppleTV way much better for streaming your to your TV so the chromecast sits on the TV stand.", "verified": true, "helpfulness": "0/1", "author": "zuri"}, {"rating": 5.0, "review": "This device is so cool! I love the functionality of Chromecast. Haven't had any problems at all with it. Love it!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "Pretty great device.  I even have it plugged it to a \"smart\" TV.  But now accessing Youtube is so convenient and somehow the picture looks better too.  I am always impressed by how quickly it reacts when I press the \"cast\" button on my device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I wanted a smart tv but for a 29\" it would cost the same as a regular 40\". So I bought that. When I got the chromcast I also naught a tablet so I was kinda changing it with 2 devices. The chromcast was easy to set up and to give you", "verified": true, "helpfulness": "0/1", "author": "Gunner"}, {"rating": 5.0, "review": "I bought the Chromecast a few days ago after the price lowered to 30 bucks.  I have to say, I could not be happier.  I have been a user of Apple TV and although I still prefer to use Apple TV because it is smoother and more compatible with the devices I stream from (iPhone, iPad) I still find Chromecast very useful.  Chromecast is now not only good for Youtube and Netflix streaming but also Hulu, VEVO, realplayer cloud and Pandora.  I find myself playing VEVO music videos or Pandora during parties from my iPhone because it is just so easy and fun to watch.  Also, with realplayer cloud (a great app) I am now able to stream videos I have taken straight to my TV.  If you are looking for a cheap alternative to Apple TV, Roku or Amazon Fire TV or just want to complement one of those systems I highly recommend purchasing Chromecast.  I am at a loss why anyone has rated it below 4 stars, it's cheap, very easy to use and setup and works well with a variety of devices and apps.  You will love it!", "verified": true, "helpfulness": "1/1", "author": "Joseph S. Madonia \"Average Joe\""}, {"rating": 4.0, "review": "It is good, but I was expecting something great from google.I use it with my mac and my hd tv. works great.", "verified": true, "helpfulness": "0/1", "author": "ajaz"}]