[{"rating": 5.0, "review": "I love the Chromecast. I have Hulu+ and Netflix, and this thing makes it so much easier when I'm streaming video from them.It's awesome, especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Michael T. Stephens"}, {"rating": 5.0, "review": "For $35, this is a steal. Pairing it with Netflix and saving a bundle on premium cable. Easy to set up and it also streams YouTube (and probably other stuff I don't know about).", "verified": true, "helpfulness": "1/1", "author": "Lawrence J. Demaria"}, {"rating": 5.0, "review": "I really only use Google Chrome for Netflix pairing it with my iPhone.  It works great for this purpose.  Am excited that they've opened up their SDK so that more third party apps can develop for Chrome.  I think that will open up a whole new world of apps.  The price is right and the installation is quick and easy.  Definitely worth buying one to try it out for yourself.", "verified": true, "helpfulness": "0/0", "author": "BP"}, {"rating": 3.0, "review": "If I could have paired it with my system it would have been great...could not use it. Uverse couldn't even help", "verified": true, "helpfulness": "0/1", "author": "cathy mcleod"}, {"rating": 5.0, "review": "Great device, make your TV a Smart TV in the ways you want it to be. Easy to set up too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The concept is very cool and it operates as expected.  I just wish you didn't have to plug in the USB or Power plug and I want to see more apps available that work with it.  NetFlicks, Chrome, and YouTube seem to be all I can get working.  I have only tried with iPhone and iPad so far though.  Maybe better luck with MacBook.", "verified": true, "helpfulness": "0/0", "author": "Al Del Degan"}, {"rating": 1.0, "review": "Streaming works with selective roter and security setting， the network dependancy was notDocumentef at all， need to try several routers to find a working one.", "verified": true, "helpfulness": "0/0", "author": "Speak the truth \"Lonestar\""}, {"rating": 4.0, "review": "This is great for viewing Netflix and YouTube from a phone/tablet/laptop.  I don't use Hulu, so I don't know about it.  I would love for it to support more video providers.  I would especially like for it to support Amazon Instant Video.Note: Your TV needs a USB port for power or you need to have an adapter to plug it in to a power source.  I've heard of a few TVs that will power this through the HDMI port, but that didn't work on the models of TVs I have in my house.", "verified": true, "helpfulness": "0/0", "author": "David Walker"}, {"rating": 5.0, "review": "I was waiting for a friend to get this so I could hear a personal review and now that I have heard one and now own this item, it has not disappointed.  Very easy to install and works great with all my electronics.", "verified": true, "helpfulness": "0/0", "author": "laura"}, {"rating": 5.0, "review": "I got this for my mother in law.  I had to play with it first before teaching her how to use it.  Incredibly easy to setup.  Probably the easiest piece of technology I have ever setup period and I'm an IT Professional of over 15 years experience.If you want something simple to stream Netflix without having to hookup your computer with an HDMI cable, this is it.", "verified": true, "helpfulness": "0/0", "author": "Hunter Bonner"}]