[{"rating": 1.0, "review": "It connect to my WIFI network but no browser can find it on iPad or google Tablet (even using chrome browser) What a waste of my time.", "verified": true, "helpfulness": "0/5", "author": "Sport lover"}, {"rating": 4.0, "review": "If your thinking about buying Chromecast stop procrastinating and just buy it. It's responsive and quick to mirror your tablet or device.", "verified": true, "helpfulness": "0/0", "author": "Ted B. Jamin"}, {"rating": 5.0, "review": "I like this product very much and I can stream youtube videos from all types of devices Android and iOS.", "verified": true, "helpfulness": "0/0", "author": "Dhana Prakash Muddineti"}, {"rating": 5.0, "review": "I bought this for my sister and it has transformed how we watch online shows.  We watch a lot of shows on viki.com and those stream nicely.  You can read the info to show which websites work.  Some don't.  But most do.  There have been a few (random sites) we tried and they audio lags a bit.  But the ones we bought it for work perfectly.  So amazing!  Highly recommend if you spend time watching shows on your computer.", "verified": true, "helpfulness": "0/0", "author": "R. Dean \"Mom, teacher, smart shopper\""}, {"rating": 5.0, "review": "After setting it up and now seeing that google has opened up the SDK for developers im even more excited about my purchase. Makes it a lot easier for my less tech savvy wife to stream shows we watch when she is on her own.", "verified": true, "helpfulness": "0/2", "author": "Aleksandar Ristoski \"MAC\""}, {"rating": 5.0, "review": "Incredibly easy to get up and running. It has changed our viewing habits and preferences.  I don't know why I waited so long to get one!!!", "verified": true, "helpfulness": "0/0", "author": "BCW \"Barbara Wolcott\""}, {"rating": 5.0, "review": "I bought this to try and was hoping to play local files but still not yet, it is great but wish it can play local file. hopefully  in the near future.", "verified": true, "helpfulness": "0/0", "author": "Hussain A."}, {"rating": 5.0, "review": "I bought this to convert my 50\" HDTV into a 'Smart' TV. I was really excited about this device because it had all the apps that I normally use on my laptop: Netflix, Youtube, Hulu Plus, & Pandora, and I would finally be able to watch them on my TV. It does not disappoint. The set-up is a piece of cake and in under 5 minutes of plugging it in to your TV you have morphed your regular television into a \"Smart\" television. The apps that it originally came out with has now doubled. As of today (2/16/14) the apps the Chromecast have added include: Vevo, Red Bull TV, Songza, Plex, Viki, RealPlayer Cloud, Avia, Revision3, & BeyondPod. Google use announced that they have opened the floodgates to developers that want to add the \"Chromecast button\" to their applications, this means that we could soon be seeing thousands of apps be supported on Chromecast. Imagine playing Real Racing 3 from your tablet or phone onto your TV? The Chromecast is worth well over it's asking price and is IMO the steal of the century.", "verified": true, "helpfulness": "0/0", "author": "Aaron Ray"}, {"rating": 3.0, "review": "I expected this device to basically be a wireless hdmi input to view whatever you have on your computer screen on your TV.  It was only kinda like that.  When viewing videos other than youtube online it lags and the mouths don't match up to the sound.  Youtube works pretty flawlessly through it.  It's pretty easy to set up overall if you know how to use a computer.  If you are clueless with computers it may be difficult and you may need to watch a how-to video.  Chromecast was not what I expected, I feel like I would have been better off just getting a 20 foot long hdmi cable, but it still does a few cool things I guess.", "verified": false, "helpfulness": "0/0", "author": "Reno Preston"}, {"rating": 3.0, "review": "My main concern before buying was the very limited functionality and the chromecast extent nada me believe that I see as streaming for websites on my tv. In fact, even though I have 300mb router and my tv is next to the router and  my pc is connected to the router with cable, the streaming (even in as, not the prommised 720p) is jumpy and unpleasant. So all you get is great Netflix and hulu player, and hope for better support - that's it. Plex and the other apps require in-app purchase for cast support.", "verified": true, "helpfulness": "0/0", "author": "Simon Mier Yakov"}]