[{"rating": 5.0, "review": "I love it so easy to find things", "verified": true, "helpfulness": "0/0", "author": "REVA K HURST"}, {"rating": 4.0, "review": "Excellent.  Easy to use.  Voice control really works.", "verified": true, "helpfulness": "0/0", "author": "Daniel Marrello"}, {"rating": 5.0, "review": "Make any TV a smart TV.  I have had this product for over two months and it works great. Glad I made the purchase.", "verified": true, "helpfulness": "0/0", "author": "Richard Daughtry"}, {"rating": 5.0, "review": "I've been waiting a long time for a tv box that 'does it all'.  I wanted one that could stream from services like Netflix and Amazon Prime Video as well as one that could stream anything from my computer or network hard drive.  This one can just about do it with everything that is built in or available from the app store.  However, the best part of this box is that it allows for side loading of apps and you can put XBMC on it with no issues.  This can do everything I need and more.  I have emulators running, XBMC, and a few games from the app store itself.", "verified": true, "helpfulness": "0/0", "author": "R. Pettinato"}, {"rating": 4.0, "review": "I ordered this device because Amazon was offering a 30-day free trial. I was interested to see if Fire TV had any features that I wasn't already enjoying with my Apple TV. As it turns out, the only two differences were 1. voice search; and 2. Amazon Instant Video. The voice search, by the way, appeared to only turn up results from Amazon Instant Video; it did not include selections from within apps, like Netflix for instance. We were pleased with the layout and navigation of Fire TV, and the voice search was helpful, but ultimately we decided to stick with Apple TV, as it already had our favorite services (Netflix, Hulu, etc.), plus ready access to our digital movie and music library. We ultimately returned the Fire TV, but still feel that it's worth the four stars.", "verified": true, "helpfulness": "2/3", "author": "Mike Suchcicki"}, {"rating": 3.0, "review": "Returned it before I used it. I learned that you can get Amazon Instant Video on PS3 or XBox 360, of which I had both.", "verified": true, "helpfulness": "0/1", "author": "spaz"}, {"rating": 5.0, "review": "I love it~! I use Netflix and Hulu and got tired of watching it on a tablet screen so I got this, mostly because it was in my price range and my router doesn't work with Chromecast (one of the few routers, by the way, lucky me) so I bought it recently and so far I love it! It's so much easier to watch socially with other people on a TV than a tablet and it loads super fast which is nice. Haven't had a buffering problem yet (though I usually don't, it's usually just me and one other person streaming on my internet) I love how I have access to prime because before I could only watch it on the computer which was a big downside for me, but now I'm actually using it and they actually have a great collection of things to watch. I'll definitely be keeping prime even with the price hike. It's worth it now. I didn't get the game controller, but I have played some games with the remote, it's probably worth getting the controller. I plan on buying it soon.I've already convinced my best friend to buy one and her's is coming tomorrow.The only downside so far is that there's no Crunchyroll app on here, but that's not Amazon's fault, that's crunchyroll's. Add that and it would be perfect for me.", "verified": true, "helpfulness": "0/0", "author": "MasaRyou"}, {"rating": 5.0, "review": "Love the convenience, and the range of prime titles is good too.", "verified": true, "helpfulness": "0/1", "author": "Anna McMillan"}, {"rating": 5.0, "review": "AWESOME -  this is the best.  I use it everyday for Netflix and Amazon Prime.  Really nice.  Saved me from replacing a perfectly good 27\" Flatscreen as we wanted a smart TV.  HIGHLY HIGHLY recommend.", "verified": true, "helpfulness": "0/0", "author": "MB"}, {"rating": 4.0, "review": "Really handy but not all features of prime as through play station.  Also hard to turn off", "verified": true, "helpfulness": "0/1", "author": "katie"}]