[{"rating": 5.0, "review": "amazing!", "verified": true, "helpfulness": "0/0", "author": "rafael bittencourt reis"}, {"rating": 5.0, "review": "We love this feature!", "verified": true, "helpfulness": "0/0", "author": "Christopher Henderson"}, {"rating": 5.0, "review": "Absolutely awesome.  I was looking for something that would display full screen on my tv.Chromecast does that and so much more. Easy to hook, setup, and use.You basically just hit a button on your phone and BAM! there it is on your tv big as life.Great for the money", "verified": true, "helpfulness": "0/0", "author": "C. McAuliffe"}, {"rating": 3.0, "review": "Bought this thing because my brother said it was great. I have no idea where it is now.  We lost it somewhere in the house.  I haven't heard much buzz about this thing so I wonder if it will be useful once we find it.", "verified": true, "helpfulness": "0/2", "author": "Mr. Practical"}, {"rating": 5.0, "review": "This is everything I expected it to be. I had a little trouble getting it to connect to my wi-fi but all I had to do was change a setting on my router and it worked perfectly!", "verified": true, "helpfulness": "0/0", "author": "Katelyn163"}, {"rating": 5.0, "review": "We use our Chromecast's regularly to watch Google Play movies and TV shows. For this purpose it works pretty much flawlessly. It is a computer so you do have to restart it occasionally but I am not upset about that. One thing to watch out for though is if you plugged in all the time and it is left on you will sometimes have to restart it before it will work correctly. We have 2 and the one on our older TV is powered by the supplied cable so if I forget unplug it it is left on all the time. The one on our newer TV is plugged into the TV so only has power when the TV is on, I like this set up much better and this unit works better because it is not on all the time.So long story made short if you have a USB on your TV to power this unit use it and not the separate power supply.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Brown"}, {"rating": 4.0, "review": "very good app. recommended", "verified": true, "helpfulness": "0/0", "author": "internation2"}, {"rating": 5.0, "review": "I didn't think we would use this as much as we do, but now we have one on every tv. Streaming movies from Netflix makes it totally worth it, not to mention free great classic YouTube rock videos.", "verified": true, "helpfulness": "0/0", "author": "HeyJude.Oregon"}, {"rating": 3.0, "review": "Too limited ... U can't stream some document", "verified": true, "helpfulness": "0/0", "author": "Pascarol"}, {"rating": 5.0, "review": "This thing makes watching streaming TV on your TV super, super easy. As in, my parents can do it. Plus it's fun for parties, anybody can take over as DJ or VJ. What's even better is that it will work with services that other devices won't currently. For example, Comcast won't allow the PS3 or Roku to authenticate for HBO GO right now; Chromecast doesn't have this limitation. What's also nice is that when it goes idle, it displays a slideshow of really beautiful pictures. I've caught myself just leaving my TV on for the artwork. My TV has a USB port that supplies power, so I don't have to plug it in to a cell phone charger (it comes with one, just in case you need it). This means that when I turn my TV on and off, the Chromecast loses power and reboots. It boots remarkably quickly; in the length of time I've had it, there have been software updates that have made it boot even faster. It's at the point that in the amount of time it takes my TV to come on, the Chromecast has booted. Only thing I've found to be an issue (which I won't mark a star off for, since other devices don't even connect to all the services this thing does) is that it doesn't push Dolby Digital audio, just stereo.", "verified": true, "helpfulness": "0/0", "author": "C. Chamberlain \"Nerd\""}]