[{"rating": 5.0, "review": "The Google Chromecast HDMI Streaming Media Player it is a really great device i already have 2 in my house and i used them all the times to shared all my content of my phone or a web site from my computer.", "verified": true, "helpfulness": "0/0", "author": "Guillermo Lene"}, {"rating": 5.0, "review": "I LOVE THIS DEVICE! ! ! !Great streaming device and I can't believe that they are only $30. I've recommended that all my family and friends get one of these.", "verified": true, "helpfulness": "0/0", "author": "Dhindtjr23"}, {"rating": 4.0, "review": "Its a great device for what it does, pretty much turn tv to an all in one media consumer for streaming content. We mainly use it for Netflix and Plex even though we already had an xbox360 and ps3 already plugged into our tv. There's simply nothing better for Plex.Mine only gripe is that for some apps, like Netflix and Plex, (and it's probably their fault rather than Chromecast's) is that it doesn't play the next episode automatically which is a hassle when you're trying to catch up with the last season of your favorite series.", "verified": true, "helpfulness": "0/0", "author": "Andrew W"}, {"rating": 5.0, "review": "The device is pretty slick.  It definitely has the limitations and we can't get things like amazon instant video to work with it, but that's a different issue", "verified": true, "helpfulness": "0/0", "author": "Jay O"}, {"rating": 4.0, "review": "Video is lagging when using laptop. Some apps in streaming player not works fine if chromecast is also on the same wifi network. I had to switch off chromecast when I use those apps in my streaming player neo tv. It's not very useful for videos and watching movies.", "verified": true, "helpfulness": "0/0", "author": "Radhakrishnan"}, {"rating": 5.0, "review": "can be trick to set it up. but only the first time. in less then 5 minutes and 1 reset, i could make working, the other 3 were really fast setup!", "verified": true, "helpfulness": "0/0", "author": "CDealencar \"CDeA\""}, {"rating": 4.0, "review": "Even if this is due to slow internet speeds (which it should not be as I have very fast internet), the chromecast should buffer for longer. It does not work well with casting from chrome browser, so really at the moment I am limited to hboGo, netflix and youtube. I wish there were more apps like xfinityTV, but I guess this is not up to google.", "verified": true, "helpfulness": "0/0", "author": "Richard E. Baron \"Richard\""}, {"rating": 1.0, "review": "I PURCHASED THIS WITH POSITIVE ANTICIPATION.  AFTER A COUPLE OF WEEKS OF CONTINUALLY TRYING TO GET IT TO STAY ON LINE I HAD TO JUST GIVE UP AND CALL IT QUITS.  I HAVE TO SAY DON'T BOTHER UNLESS YOU ENJOY BEATING YOUR HEAD UP AGAINST A BRICK WALL.  NOT TRYING TO BE SARCASTIC HOWEVER, MY FRUSTRATION WAS BROUGHT ON BY MYSELF BECAUSE I REALLY DID NOT WANT TO GIVE UP TRYING.  YOU GOT TO KNOW WHEN TO CALL IT QUITS.", "verified": false, "helpfulness": "0/1", "author": "S. Ponder"}, {"rating": 5.0, "review": "I was a little skeptical that such a small device would work so well but it really does.  We use it in the bedroom and we don't get great wifi reception in there and it works perfectly.  We use it mainly to watch Netflix and listen to Pandora radio.  I'm going to get rid of the cable box in my kids playroom and replace it with this.  My 6 and 3 year old know how to use Netflix on the Ipad so they will have no trouble working this device.  They will be able to pick whatever they want on Netflix to watch on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Veronica's Mommy"}, {"rating": 4.0, "review": "This little dongle has a whole of potential and is very affordable.  Works great with netflix, HBO go from my phone.Unfortunately, it hasn't been greatly adopted by 3rd party apps yet, but that may change in the future.The cons of this dongle is that it is a little slow when mirroring video from the chrome browser.  This may be due to the fact that you have two separate streams running at the same time: one on the chromecast and one on the laptop.  It would be nice if you had the option to just send the video to the chromecast like you do from your phone rather than just mirroring.Cool little toy with a lot of potential", "verified": true, "helpfulness": "0/0", "author": "nohrice4yooh"}]