[{"rating": 5.0, "review": "When I rec'd the special offer to try Amazon Fire TV free for 30 days I figured I had nothing to loose so went for it.  I am soooooo glad that I did!!!!  The installation was a breeze and using it is so simple it's fun to do!!!  The down side is you may want to watch more TV/movies than you really should!  The voice search feature brings up very accurate results no matter who in the house is speaking the command.  I highly recommend Fire TV to everyone!", "verified": true, "helpfulness": "1/2", "author": "Melissa"}, {"rating": 3.0, "review": "I'd give it a 4 or 5 but the Fire REALLY needs a way to filter the catalog to show only prime eligible content.  Also, the user interface is dated.  I do however really like the fact it will run apps.  Using it as my plex server for all my personal content allowing me to eliminate a dedicated media pc.  Slick!  Now just add the prime filtering...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I had been debating on whether or not to purchase a Roku streaming box, but settled on Amazon's Fire TV due to the fantastic customer service I had received in the past. Installation is a breeze, less than a minute in my case and I was ready to enjoy some of my favorite programs. The app is okay, not fantastic, but I expect this to change soon. The voice search is as great as advertised, as long as you're using  Prime and the game controller I purchased works flawlessly. I have been extremely pleased with this product.", "verified": true, "helpfulness": "1/1", "author": "David McGhee Jr."}, {"rating": 3.0, "review": "I owned a Roku and genuinely liked it.  When I read the Amazon Fire TV reviews, I figured I would give it a shot.  I should have stayed put with the Roku.Here are my major gripes:-No Cloud Music Player function---HOLY COW, I can't even play my own Amazon bought music on my Fire TV (Apparently they will have an app sometime in the spring--not encouraging since Roku has had it from day one).-App selection is very VERY limited.  Don't let the ad fool you, they don't have 1/10 of the apps that the average user would use on Roku.-Its difficult to know what is Prime and what isn't...Roku makes it apparent.  Its almost as if they want you to get to \"shop\" on Amazon in the hopes that you'll capitulate and buy what you want to watch.  Jeff Bezos, you're better than that!As a loyal Amazon buyer, I'm disappointed.  I'm switching back to my Roku---where I can get the most out of my Amazon experience!", "verified": true, "helpfulness": "1/1", "author": "Brian53"}, {"rating": 3.0, "review": "I'm not sure who's \"fault\" it is, but I bought this little device the first day it was available.  I was/am impressed with it's overall performance, and how quick it feels.  I also have this in the basement and the remote works upstairs in the great room. I have issues with Roku 3's \"wifi direct\" remote making the distance.The main issue revolves around the lack of full audio (surround) support in the Plex application.  If you browse the forums, some people blame Amazon, others blame plex.  I honestly don't car, I'm just very sad that this thing is SO close to being a great box, but without quality audio I'm forced to use my old trusty Boxee Box for home movies.I really want to love this box, but in its current form I just can't.  If/when the audio gets fixed my review will go up drastically but until then the best I can do is hand out 3 stars.", "verified": true, "helpfulness": "0/1", "author": "Dallace Marable \"Dmtalon\""}, {"rating": 5.0, "review": "Purchased for my father who is not tech savy and he figured it out with ease. Looks just like the Kindle and love it.. Wish there was a way for both of us (we both have kindles and PRIME accounts) to use it. Would love the ease of that idea. Also need more explanation how to fling. Figured it out but could have used some help!  All in all wonderful value.", "verified": true, "helpfulness": "0/0", "author": "greenmolyduck \"Molly\""}, {"rating": 5.0, "review": "I've been an avid Apple TV fan but this blew me away.  The voice command option is very convenient and the ability to easily scroll through to find movies, apps and games is fun.  Very happy I switched to Amazon T.V.  Now if they get ACORN Online, I will be a happy camper.", "verified": true, "helpfulness": "0/0", "author": "Grace Curbelo"}, {"rating": 4.0, "review": "This little device is fast for a device in it's class.  I don't use all of the features but the onesI do use works great (PLEX, NETFLIX)..", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 5.0, "review": "The Fire TV is very powerful, but comes in a tiny package. The remote is user-friendly and very easy to use. It is the only source for my tv, and does the job well.", "verified": true, "helpfulness": "0/0", "author": "Kayak Jay"}, {"rating": 5.0, "review": "A great product.  The voice activation is really effective and in your normal speaking voice.  You don't have to enunciate like a grade school English teacher.", "verified": true, "helpfulness": "0/0", "author": "madden2012"}]