[{"rating": 4.0, "review": "Great product, voice control is very easy to use and it actually works.....none of my other voice controlled products understand me.  Am a little disappointed that very few of 2014's academy awards nominate  movies are available, so I still need to go to red box.", "verified": true, "helpfulness": "0/1", "author": "Carol S. Cooper"}, {"rating": 4.0, "review": "Fast machine...but you don't get the full 8gb storage as promised. The storage is not enough to store app data. Also the external USB can NOT store data, only the app itself.", "verified": true, "helpfulness": "1/2", "author": "topsales15"}, {"rating": 3.0, "review": "Had trouble setting this up..I returned it and bought the ROKU brand.", "verified": true, "helpfulness": "0/2", "author": "Leon & Linda Wakefield"}, {"rating": 5.0, "review": "As expected..", "verified": true, "helpfulness": "0/2", "author": "Marc Sheppard"}, {"rating": 5.0, "review": "works fine, as described.", "verified": true, "helpfulness": "0/1", "author": "es1753"}, {"rating": 5.0, "review": "I can't imagine not owning these now. For my son especially they are a godsend. He's two and we use it almost exclusively to give him the odd show to watch. Hour or so a day in early AM and before bed but with all the options like Sesame Street or Daniel Tiger to youtube,etc...just awesome. Smooth, responsive interface...voice search is absurdly accurate even with background noise. I've owned many of these types of devices and this one is heads above the rest (eg. Apple TV,etc)...remote is small but not obnoxious. The ability to use smart phone to do youtube search,etc and then sling video to it makes for quicker use as well...5 star all the way.", "verified": true, "helpfulness": "1/2", "author": "Revo CT"}, {"rating": 5.0, "review": "Very easy to use and set up. Amazing how it works", "verified": true, "helpfulness": "0/1", "author": "Martin Sillen"}, {"rating": 2.0, "review": "Remote eats batteries. Uses batteries about every two days. Contacted amazon with no results. I would not buy again.", "verified": true, "helpfulness": "0/1", "author": "kenneth"}, {"rating": 5.0, "review": "Fantastic system. Remote with voice recognition is amazing. Good selection of movies and TV", "verified": true, "helpfulness": "0/1", "author": "Jonathan Freed"}, {"rating": 3.0, "review": "For Netflix and Amazon Prime and some other streaming services, this product works fine - but I have a Synology 1814+ NAS server and the FireTV, using PLEX, chokes (either stutters or stops for seconds at a time or crashes altogether) on any video file over about 3 - 4 gb in size, even when hard wired with Cat5.My Samsung Smart TV with less one-half the processing power and RAM, with PLEX loaded, will play everything, via WIFI with no problem as will my IPAD, Samsung Galaxy, and my Macbook pro.  I've tried every configuration possible - thinking it was a transcoding issue, but with no improvement.  What I did discover is that if the subtitles are turned on, the problem is worse.I bought this specifically for my home theater, to use instead of my HTPC - I like the interface and it's good for some things - just not what I bought it for.", "verified": true, "helpfulness": "0/1", "author": "HarborLights"}]