[{"rating": 5.0, "review": "I am loving it", "verified": true, "helpfulness": "0/0", "author": "SkyGabe"}, {"rating": 5.0, "review": "Absolutely amazing! Way better than Apple TV. What is truly phenomenal is the speed at which it processes all of the commands. Videos load up incredibly quick and navigating through it couldn't be simpler. Also, all of my family pictures and videos are available on the big TV. Yes, I know a lot of other hardware can do that, but none that easily and quickly. The Voice Control on the remote is...well, you just have to try it to see for yourself. Accurate, fast, convenient. I already ordered the Gaming Controller and can't wait to make it work even better. Get yourself one. And no, I am not being paid by Amazon to say this. It is also the very first review I have ever posted. It just deserved it, that's all.", "verified": true, "helpfulness": "0/0", "author": "Robert Nicotra"}, {"rating": 4.0, "review": "We like it--I hope that we will get more of the newer movies as we continue using it.", "verified": true, "helpfulness": "0/0", "author": "Nanacrystal"}, {"rating": 5.0, "review": "Uncomplicated and visually appealing, Amazon Fire TV makes watching television exciting again.  Gone are the endless advertisements of products I neither need nor care about.  I have the choice of naming specific programming and films or browsing through the library and taking my chances.  I have caught up on many missed films and revisited some classics.  I highly recommend Amazon Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Linda Puckett"}, {"rating": 5.0, "review": "LOVE THIS ITEM!!!!", "verified": true, "helpfulness": "0/0", "author": "Antoinette Grant"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "William Blanchard"}, {"rating": 5.0, "review": "Works like a champ! Just plug it in and your done! There is not as many free TV and movies on prime as I thought, but overall it's very worth it.", "verified": true, "helpfulness": "0/0", "author": "Thomas Ferguson"}, {"rating": 5.0, "review": "I love the amazon frire tv box i love not having to watch netfilx on my computer or kindle", "verified": true, "helpfulness": "0/0", "author": "Kelli Welter"}, {"rating": 5.0, "review": "Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Terry Pulli"}, {"rating": 4.0, "review": "Love it! Great design in this product. Just needs to keep subscription prices reasonable. Got it as a gift, Which will keep on giving. Found out today the system will over heat and will shut done. Notice also that when you return to home, unit seems now not shuting down as it did when a I first got it. Heats up to a Temp and then shuts down. Also another draw back, Amazon does not offer Vudu to it's customers. Sad, finding this out. Upgrades needed and new software to cover heating problem. Best to pull outlet out of back at night for fire safety.", "verified": true, "helpfulness": "0/0", "author": "Ronald K. Williams Sr."}]