[{"rating": 3.0, "review": "Nice little device but needs to be rebooted at least once a day as it appears to be connected but devices can't find it.", "verified": true, "helpfulness": "0/0", "author": "Glen"}, {"rating": 5.0, "review": "Can move from living room to bedroom.  We watch movies and clips on netflix or youtube and can stream from either phone or iPad with the app installed.  My sister will come over and she can easily use this as well. Only has to have the app and be connected to the wifi to play what she wants.", "verified": true, "helpfulness": "0/0", "author": "Dakota"}, {"rating": 2.0, "review": "did not like", "verified": true, "helpfulness": "0/0", "author": "AHMAD NOBANI"}, {"rating": 5.0, "review": "I picked one of these up locally to compare it to the Fire TV stick I purchased which did not meet my needsInitially I had removed this device from my list of choices because it was dependent on a phone, tablet or laptop and I thought I wanted something that was stand alone.Once I tried to use the Fire Stick I realized that what I wanted most was to be able to cast to my television, as I watch some livesteam television feeds and shows from web pages rather than supported “apps”  I could not do it from my Windows laptop, nor from my Andriod phone for longer than 30 seconds at a time.  Even Hulu was problematic as it skips and often stalls after advertisements run.I brought the Chromecast home, plugged it in and was up and running right away.  No annoying video targeted for 8 year olds to be forced to sit through and no content I was not interested in cluttering up my screen.  I just downloaded the app on my laptop, opened up a show I wanted to watch in my Chrome browser, hit the cast icon and boom.I often write, work or browse the internet whilst watching television, so it was great that the cast tab could run in the background while I did other things on the laptop.The connection to my wifi network is way better than the Fire Stick and I haven't had any issues with the signal being dropped.I am extremely happy with my purchase.If casting to your television is what you want a media stick for; this one is for you.", "verified": false, "helpfulness": "1/1", "author": "Wild Celtic Rose"}, {"rating": 5.0, "review": "Chromecast is awesome", "verified": true, "helpfulness": "0/0", "author": "doodle"}, {"rating": 3.0, "review": "This works well from a laptop but if you are hoping to cast from an iPad with any service other than Netflix - like Amazon Prime - forget it. Very dissapointing.", "verified": true, "helpfulness": "0/0", "author": "quilter"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "1/1", "author": "lyon chang"}, {"rating": 5.0, "review": "I got this after I'd had an Amazon Fire Stick for a few months. I like the fire stick but I kept longing for the capability to \"cast\" from my laptop. Here are the  pros and cons as I see it.Fire Stick Pros:+ Easy to setup and install+ Comes with a remote+ Price. $39 regularly (Got on sale for $24)Cons:- Can't stream from laptop, phone, or iPad- Apps freeze sometimes- Really only useful if you have an Amazon Prime accountChromecast Pros:+ Ability to \"cast\" from laptop, phone, or iPad. No more wires needed to connect your media device to the TV!+ Easy to setup and install+ Streaming quality is very crisp when using play store+ Price. $30 plus incentives from Google ($20 play store credit right now)+ No accounts or subscriptions necessary to enjoy benefits (although Netflix/Prime are good investments)Cons:- No Amazon streaming app (Workaround is to cast Amazon through the chrome browser)- No remote (unless you count your laptop, phone, or iPad)- Must be in close proximity to wireless signal (Mine is around 30 feet away and works fine)Overall, I'm glad I have both the stick and chromecast since I do have a prime account. If I did not have an account and could only choose one, I would choose hands down the chromecast.I was also worried these would not be compatible with my Denon receiver that has HDMI inputs, but they both work beautifully with no issues.Google has done it right with the chromecast, which is why it's the best selling media device on the market right now. Get one and you will not be dissapointed.", "verified": true, "helpfulness": "0/0", "author": "normaldude"}, {"rating": 5.0, "review": "as described", "verified": true, "helpfulness": "0/0", "author": "WildBill"}, {"rating": 4.0, "review": "Can use to surf net", "verified": true, "helpfulness": "0/0", "author": "D. Feng"}]