[{"rating": 1.0, "review": "I never do this but felt compelled because I've been so irritated. When it does work, it only works with netflix and youtube app. But it doesn't work. Good luck finding its wireless signal. I'm a network infrastructure technician and I can tell you this product is complete garbage. Don't waste your time, money, and effort. Just get a usb extension and hdmi adapter for your device. Amazon mobile is obviously crap too. I wanted to give ZERO stars", "verified": false, "helpfulness": "0/0", "author": "doug bennett"}, {"rating": 5.0, "review": "All as expected.", "verified": true, "helpfulness": "0/0", "author": "Gerald E. Johnson"}, {"rating": 5.0, "review": "This is my second Chromecast and I love it.  I have a smart TV but I usually end up watching most of my content through my Chromecast expect for 4K contents.  As far as I know, Chromecast does not have the ability to stream 4K videos, but its okay because there aren't too many 4K contents to stream at the moment anyways.  As mentioned this is my second Chromecast.  I lost my first one moving furniture around, but without hesitation ordered a second one after 1 hour of searching.  If I ever find my first, that'll be fine too as I have more TVs around the house.  Also, Google has couple of offers for people that own a Chromecast.  I got three months of Hulu, three months of Google Play Music, 2 free movie rentals from Google Play, some Google Play Store credit, and much more. And one more thing, SOME offers are able to be stacked, as in owning more than one Chromecast can get you some of Google's offers twice. It has definitely paid for itself.  I recommend this product 100%.", "verified": true, "helpfulness": "0/0", "author": "Ben S."}, {"rating": 4.0, "review": "I use it to stream YouTube to my TV and it works almost perfectly. Lives up to the $35 price tag.", "verified": true, "helpfulness": "0/0", "author": "Android"}, {"rating": 5.0, "review": "Use it almost every day. I've had it for more then a year now.", "verified": true, "helpfulness": "0/0", "author": "Ink D."}, {"rating": 4.0, "review": "only bummer is it dont play avi files. Otherwise it is excellent. use it every day", "verified": true, "helpfulness": "0/0", "author": "Muhammed"}, {"rating": 4.0, "review": "Thing is a great item to add to the TV.  Makes it like a smart TV.  Very easy setup.", "verified": true, "helpfulness": "0/0", "author": "Virgilio P. Cinco"}, {"rating": 3.0, "review": "Once I bought and netgear extender and It always shows this message.Now this expensive router show it again.What is the problem with netgear ?", "verified": true, "helpfulness": "3/3", "author": "Elkin Grimaldos"}, {"rating": 5.0, "review": "Used it extensively. Great product.", "verified": true, "helpfulness": "0/0", "author": "BOR"}, {"rating": 3.0, "review": "Very glitchy, barely using it since getting a fire tv, which I can cast youtube videos to, and that's pretty much what I got the chromecast for.  Once in a while I will use the cast screen feature to watch other content from my phone or laptop on the TV, but that doesn't always work properly.  Sometimes it will not even show up when searching for chromecasts.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]