[{"rating": 5.0, "review": "my 2nd. couldn't pry the 1st one long enough from my son. easy to install and use. I like chromecasting videos from facebook onto my tv.", "verified": true, "helpfulness": "0/0", "author": "L. Carp"}, {"rating": 3.0, "review": "Roku is better.", "verified": true, "helpfulness": "0/0", "author": "brandon"}, {"rating": 4.0, "review": "Cuts out every once in a while and will drop the tab I'm casting.  Also my devices won't always recognize it even when it's plugged in and going just fine.  These events are few and far between though, and overall it is a great buy for anybody, especially if they want to stream something from their computer over to their TV.  I don't know about you guys but watching a movie or sporting event on my computer just doesn't do it justice, and this $30 gizmo more than pays for itself after the first few events I've watch with it.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "Awesome so far. Before I could only get online using the apps available on the smart tv, but now I can stream shows from more websites.", "verified": true, "helpfulness": "0/0", "author": "Sal"}, {"rating": 5.0, "review": "best 35 dollars ever, i use it instead of cable. even live cable sports with watchespn app", "verified": true, "helpfulness": "0/0", "author": "betatron"}, {"rating": 1.0, "review": "Was able to intermittently get the Chromecast to connect to my wifi. However when I turned the TV off and then came back later I'd have to completely reboot and reset the Chromecast to have it recognized on my TV. Like most of Google's pet projects I find that this one is half baked, half finished and not worth the investment.", "verified": false, "helpfulness": "1/1", "author": "Wayne Schulz"}, {"rating": 4.0, "review": "Having problem working with our Verizon router.", "verified": true, "helpfulness": "0/0", "author": "David P."}, {"rating": 4.0, "review": "The only drawback is that the resolution is only as good as your phone.  It doesn't translate to Crystal high def when you put it on your 50inch plasma.", "verified": true, "helpfulness": "0/0", "author": "FatBoy"}, {"rating": 5.0, "review": "The is beautiful little piece of equipment that works using the wifi signal from you router with no effort on your part.Download the software from Play Store, install it by plugging it into the HDMI on the intended receiving device.Example:  The installed software on your tablet will send the signal to this device, and soon whatever you have on your tablet/phone/lap top will also be on your TV screen.  The instruction are a bit light weight, but after a few tries you will get it.", "verified": true, "helpfulness": "0/0", "author": "Joe C."}, {"rating": 5.0, "review": "Works excellent to get Netflix from iPad to TV", "verified": true, "helpfulness": "0/0", "author": "M Rose"}]