[{"rating": 1.0, "review": "cant stream hbo go", "verified": true, "helpfulness": "1/3", "author": "Erik Jensen"}, {"rating": 5.0, "review": "I love it .", "verified": true, "helpfulness": "0/0", "author": "luis betancourt"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Tim H. Grimes"}, {"rating": 2.0, "review": "You have to pay a subscription to prime, pay another to hula, pay another to ESPN, pay another to Netflix, Pay another too......You get the idea.  Then Netflix does not stream the same library as the DVD library. Not nearly as many picks and nothing very current.You need to browse on your computer for titles to put onto your TV.", "verified": true, "helpfulness": "1/3", "author": "geoff vansickle"}, {"rating": 4.0, "review": "this is my second fire tv, purchased for my downstairs tv. I like the fire features, wish I could get some answers from a live person once in awhile. wondering when nexflix app is going to have voice response like the amazon prime. looks like amazon is starting to coordinate the other amazon prime features; ie. pictures, cloud, music in addition to video. i'm a prime member and will continue as long as amazon progresses in it's offerings. wish customer service was USA and not over seas. had problem with pairing my fire game controller and had to call customer service. problem speaking English and understanding my problem. came back an said I needed to unpair my controller from the first fire tv box and pair to second. not true, figured it out myself. very disappointing experience. all in all the product is great.", "verified": true, "helpfulness": "0/0", "author": "pookaman49"}, {"rating": 4.0, "review": "WAS ABLE TO GET NETFLIX, STILL WORKING ON DETAILS FOR AMAZON MOVIES ETC., MUST DETERMINE IF I WANT AMAZON PRIME.", "verified": false, "helpfulness": "0/1", "author": "anthony oliva"}, {"rating": 5.0, "review": "This is a great device. Much easier to use than those \"other\" internet connect services.Ivan", "verified": true, "helpfulness": "0/0", "author": "Ivan C. Harner"}, {"rating": 5.0, "review": "Pretty cool. I bought this as a gift for my husband for Christmas. You need an HDMI cable if you buy it. I didn't realize that so the hubby had to go get one. He really seems to like it and has been watching Netflix on it!", "verified": true, "helpfulness": "0/0", "author": "Natalie Jacqueline Elizabeth Mussell"}, {"rating": 5.0, "review": "Love everything about it! Voice activation is great. It was easy to hook up and watch right away.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "Provides a picture as good as hdtv and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]