[{"rating": 1.0, "review": "I am not sure why this product received all the hype that it generated. All it offered was the ability to show my Chrome browser on the TV screen, and even then the resolution was poor. So for $35 a better alternative is just use an HDMI cable and see your PC screen on the TV. I would suggest a Roku, Apple TV (my choice) or save your money and buy a web enabled TV.", "verified": true, "helpfulness": "2/2", "author": "Perry T Lockhart"}, {"rating": 4.0, "review": "Its just an awesome gadget for the price!!! To give it a perfect score i found two issues on Christmas night i had it working for hours and 3 of us were adding songs to the youtube tvque when suddenly just crashed and didnt work properly... i guess it got too hot or something.... also i understad that the future is endless for what you can do with it but now its just too limited to you tube and hulu.... if you could send the browser internet from your cell that would be awesome for now its just from the laptop.... its just amazing!!!!", "verified": true, "helpfulness": "0/0", "author": "German Osorio"}, {"rating": 3.0, "review": "I really don't like controlling the device with my tablet or phone. A bit cumbersome to setup. I ended up returning it, I'll stay with Roku - much more channels, although I do like having YouTube on Chromecast", "verified": true, "helpfulness": "0/0", "author": "agent_cant_name"}, {"rating": 5.0, "review": "Pros- works as advertised- easy to set up- easy to move around to different TVs if neededCons- need to use you computer or laptop", "verified": true, "helpfulness": "0/0", "author": "Carl Cherry"}, {"rating": 1.0, "review": "I cannot get the chromecast to link to my wifi, very fusterating!  Would like to use it but no link", "verified": true, "helpfulness": "1/1", "author": "Jim Emiley"}, {"rating": 5.0, "review": "Best $35 I've ever spent.  Casting from your computer or phone couldn't be easier, and now I can finally get away from using my smart TVs clunky interface for Netflix and Youtube.  It's worth it for Youtube alone!  If your TV allows the ports to switch themselves, Chromecast will do it.", "verified": true, "helpfulness": "0/0", "author": "Michael John Kory"}, {"rating": 4.0, "review": "Easy setup and worked as described in the advertisement.  I would recommend the google chromcast to people looking to cast netflix.", "verified": true, "helpfulness": "0/0", "author": "mitch"}, {"rating": 5.0, "review": "This device does just what it says--streams video, audio, and a few other applications. Setup is a breeze. The price is great, and it has tremendous future possibilities as the manufacturer adds allowed apps to use it for streaming.So glad I bought 3 of these for my family.", "verified": true, "helpfulness": "0/0", "author": "M. Cisd \"KB\""}, {"rating": 2.0, "review": "sometimes very hard to connect have to use their browser not so great, not so sure I would recommend it", "verified": true, "helpfulness": "0/1", "author": "Ernie Gaboury Quidnessett Baptist"}, {"rating": 2.0, "review": "Unboxed it and set it up and everything worked OK.But it seems to be up and down. As best as I can tell, it's very temperamental about network settings (and maybe available bandwidth).Replaced it with a Roku that works more consistently.", "verified": true, "helpfulness": "0/0", "author": "David M. Snyderman"}]