[{"rating": 5.0, "review": "This is by far the best streaming device, I have the Roku 3 and and Chromecast and while these are very good the Amazon fireTV beat both hands down.", "verified": true, "helpfulness": "3/3", "author": "randal spiller"}, {"rating": 4.0, "review": "This product is good as it is advertised. easy to install and very convenient and affordable. Highly recommended to all.", "verified": true, "helpfulness": "0/1", "author": "Jake Ramos"}, {"rating": 5.0, "review": "I just got it today and the setup was so stinking easy!  I already have Pandora and Netflix setup plus my Amazon watchlist was right there.  I am loving the voice search option!  I haven't gone into the gaming option because I mainly got it for TV and movies but I may investigate that further later.  But for what I wanted it for.....nothing but love!  Yippee!!!", "verified": true, "helpfulness": "3/3", "author": "L. LeNoir"}, {"rating": 3.0, "review": "WHEN WE MADE BUY /IT STATED 2 NEW AAA BATTERY,S INCLUDED /NOT IN MY BOX WHEN DELIVERED?  WHY  NO BATTERYS", "verified": true, "helpfulness": "0/9", "author": "Corey E. Marcheck \"CANOE247\""}, {"rating": 2.0, "review": "I ordered this expecting a couple of things that weren't there.1) USB support2) Infrared remote capabilityThe Roku 3 is slightly cheaper and has both of the above.Also I did not like the Amazon centric search.On the plus side. It is amazingly fast. Fix the above and I may re-order.", "verified": true, "helpfulness": "3/5", "author": "Amazon Customer \"Dave\""}, {"rating": 1.0, "review": "I already wrote one review about the system.  Eventually I did get Netflix after removing/reinstalling it 3 times to come up and work.  In the end Roku, Netflix, YouTube are on the device.  You can use the voice  command in a app to find a movie or actor.  You cannot go between apps using the voice you have to go home and to the device.  Would have been nice to switch between apps using voice command.The second screen.  I was looking forward to being able to remotely view this on a tablet.  NOPE.  It has to be a supported device which is only a Samsung TV or a Kindle.  Not alot of options there...  basically that functionality is useless.Another nuance of this device which you can get on other streaming devices is the ability to search the internet.  This does not allow that functionality.  You have the apps they support and that's it.So bottom line you have a ROKU or for that matter a wii works as well for the same amount as this but this has the voice search which is nice.  That's all that makes these two devices different.  I have to say I'm disappointed.  THis could have been a really cool device if it added voice to switching between apps, allowed you to use voice to enter username/pwd, turn on/off.  Second if the second screen support worked on any android or PC for remote viewing.", "verified": true, "helpfulness": "4/13", "author": "Kevin Geraghty"}, {"rating": 4.0, "review": "Definately worth the money!! Amazon Fire TV is great with the movie rental capabilites, amazon prime instant video and netflix. There is a great free fitness app avalible as well as ESPN for those of you who want to keep up with sports. It took me less than 5 minutes to set it up at home and the remote is very simple to use. The only thing I look forward to Amazon improving upon is the varitey of apps availible on Fire TV. It would be nice if we were able to stream major movie networks by simply paying a monthly subscription directly through the Fire TV; Like Showtime Anytime can only be used if you have a password from your cable provider:( The whole point of getting the Fire TV was so I could get rid of cable completely)- And unfortunately the BBC app is not availible for use in the US which was a HUGE disappointment for me. I hope they are able to change that soon because I really miss my BBC. It is great device overall. I give it 4 stars because I am leaving room for the improvements and additional Apps that they will add to Fire TV as they get feed back from customers.", "verified": true, "helpfulness": "2/2", "author": "Ryan:)"}, {"rating": 5.0, "review": "I had the roku for a year it's was a good cable replacement. I decided to try the fire tv for a different room. Once I hooked it up and added my apps this device is super fast and even faster with voice search. Plus its a game system for my speed.The only Cons I have was that the game controller didn't ship with the system because back order should be here next week.", "verified": true, "helpfulness": "1/1", "author": "Greg S."}, {"rating": 4.0, "review": "Only had it for a couple weeks but very impressed so far. The design and function of the remote was more than expected. Very easy to get up and running. Much better than the internet enabled blue-ray player I purchased last year.", "verified": true, "helpfulness": "0/0", "author": "Randall Forsha"}, {"rating": 1.0, "review": "It has a nice clean design, but it does not function as well as you might expect.  The voice functionality doesn't work well at all and continually misses much of the content.  It also seems to have a lot of lag time trying to load certain apps. Very disappointed overall.", "verified": false, "helpfulness": "8/13", "author": "lisa~"}]