[{"rating": 5.0, "review": "Upon receiving my system It set nearly set itself up (very simple). At first I didn't realize all the apps and thought the programming was rather limited. After a bit of navigating and downloading most of the apps I was very pleased with the programming. If this had live news casts I would cancel my dish network. Two days later my puppy got hold of the remote control and ate the battery cover :( .Fortunately the remote wasn't rendered usless although I have not found a link to purchase parts for the Fire TV. Very happy I purchased this system. It is probably the best of its competition.", "verified": true, "helpfulness": "1/1", "author": "easy"}, {"rating": 5.0, "review": "Excellent Choice. Ms. D and I each got one! It provides the freedom of choice. Each can watch our fav movies from whichever venue we choose. Likewise for music streaming and game playing. The Amazon Fire TV is like finding a Treasure Chest on your backyard everyday! Ms. D rated it as Awesome! This gadget is the total package! It arrived after four days of placing the order, well packaged, and with easy to set up instructions. The Amazon Fire TV has revolutionized home entertainment. Good bye greedy Cable and Satellite companies, as soon as my contract is up: to the curb side. With Amazon Fire TV I have all I need and want for the whole family. We can even have a slide show of our family vacations pics. It is the whole package!", "verified": true, "helpfulness": "0/0", "author": "SGT AB"}, {"rating": 5.0, "review": "The best so far content is great speed is outstanding well done  voice commands is the best I've seen so far. its search capability is excellent. high definition is exceptional surrond sound you will hear the difference .Now what's missing is acess to the full app store, and a browers for web searching and acess to our phone data for small productivy purpose email print etc etc overall pretty good device.", "verified": true, "helpfulness": "0/0", "author": "dabill"}, {"rating": 1.0, "review": "Even though I stream on my old Xbox 360, I got this so my wife could access steaming easier.  Unfortunately, it was D.O.A.  When a company sends me a product, they've got one chance to impress me, and Amazon didn't. Virtually no help or troubleshooting online. And no, I wasn't about to see who Amazon might have contracted to manage their \"help\" phone lines. It's just like AFTV is a beta issue and Amazon wants their guinea pig customers to help them figure out the bugs. So, anyway Amazon issued a UPS pick up order that went without a hitch. After UPS ground took about six days to return the AFTV to Amazon, Amazon then took seven days, (after their warehouse rec'd their product), to refund my bank card. Amazon could learn a lesson from Walmart on refunds, my last one from Walmart took two days. Oh, and after the fact, I learn that the \"highly touted\" Voice Search only works on searching Amazon Prime. Boy howdy, Amazon - guessing you just decided to really tick off a large part of your consumer base with this one. If I could I'd give it a Big Old Zero !  Doesn't deserve the one star...", "verified": true, "helpfulness": "4/20", "author": "Mountain Man"}, {"rating": 5.0, "review": "I have an Apple TV.  But I cannot streaming Amazon prime movies.  I watch the movies on my Amazon Kindle Fire HDX.  I like the movies.  So when there is Amazon Fire TV, I got one in order to watch Amazon prime movie.I love it.  It is fast.  I can watch Netflix too.  I like it better than the Apple TV.  I am rarely touch the Apple TV now.  I like the voice search.  It works.  It is very convenient than typing the word in Apple TV.  I will definitely recommend to friends.  I think this is a most for people with Amazon prime.  People without Amazon prime could not watch the Amazon prime movie, so it is less vital to get it.  If people without a streaming device and are looking for one in the market, I would definitely recommend Amazon Fire TV.  It is faster and easier to use.  It also has lots of games.", "verified": true, "helpfulness": "0/1", "author": "C. Wu"}, {"rating": 5.0, "review": "Love it.  System has been rock solid stable, interface is intuitive, voice control has been very reliable and predictive video feature has been excellent.  Highly recommended. I had been using Amazon through my Smart TV (a Sony), but the Fire TV is head and shoulders above that interface.", "verified": true, "helpfulness": "0/0", "author": "Mr. Michael J. Loeffler"}, {"rating": 5.0, "review": "We have had it for a week and although we don't watch a lot of TV during the week, we fired it up and love how well it works. Easy to set up, easy to sync with my Amazon Prime and easy enough to move around through Amazon Prime movies vs HulaPlus. Excellent product so far!", "verified": true, "helpfulness": "0/0", "author": "Camai"}, {"rating": 4.0, "review": "First off, I own 2 Google Chromecasts and 1 Amazon Fire TV along with Comcast digital cable. We first bought our Chromecast's and for $35 it was a bargain to say the least. I don't think the Fire TV is a Chromecast replacement, but rather a different type of experience altogether.The Good=1. The Fire TV's menu is almost instantaneous. There is nearly no delay when flipping through apps and games.2. Games. Yes you get games on the Fire TV, you can play demos for free, some of which are very fun, or you can buy full games such as \"You don't know Jack\" for $6.99. Also, we like to have 4 people play \"You don't know Jack\" or \"Fibbage\" at the same time. You're able to do this by downloading the game's app and then everyone uses their cellphone as a controller for the game!3. Amazon Prime. Yes, if you're a prime member like I am, you finally can use amazon prime with a decent app. I used to have to use my computer or my Vizio TV which was VERY slow. The fire is very quick.The Bad=1. The apps are sometimes confusing. I don't completely blame Amazon for this, but I've always hated using netflix through an app. The fact that they make it too hard to just go to a section like \"Horror\" or \"Comedy\" is pretty ridiculous. Amazon Prime is similar, and it can be hard to find free vs. pay videos.2. Everyone's aware of this by now, but the voice search feature. It's seriously amazing, it works nearly perfect. However, it only searches through Amazon Prime and a couple other apps at this point. For instance, if you search for something that you want to watch for free on Netflix, it'll just take you to where you can purchase the movie through amazon.The bottom line=Amazon Fire TV is much better than I'd expected. It's not anything groundbreaking, but Amazon is trying to compete with Google and Apple, so they need to keep up as much as possible. I don't have experience with Apple TV, but I would absolutely recommend the Fire TV for anyone. It's more for fun and entertainment (we use it for parties a lot). Whereas the Chromecast isn't much more than an app provider for people without smart TV's. Do your research and go with what your requirements are. They're 2 different products, but I'm VERY happy with my Fire TV!P.S. if you haven't heard. HBO Go will be available on Fire TV by the end of the year!", "verified": true, "helpfulness": "0/0", "author": "Eric P"}, {"rating": 4.0, "review": "I'd like to see the voice commands work for all the apps. There should be some kind of deals on renting or purchasing movies or shows. Buy one get one half off or free or different specials because you can get movies at red box for $1.20 per movie.", "verified": true, "helpfulness": "0/0", "author": "mesha"}, {"rating": 3.0, "review": "I just received my Fire TV, I ve been playing and downloading games for my children, in that sense its great! But the huge problem is that when I tryed to access Amazon Instant Video I receive a message telling me that it has geographical restrictions (Im outside US), so I can download movies and shows only from Netflix, and have no access to You Tube, (it should be possible, since there is a lot of content in You Tube to entertain. So basically I can only buy and download games. watch crackle (that I dont know why only offer me 13 movies to watch when I connect trough Fire TV, and a lot if I use my home computer). I will keep it hoping to get something more in the future but, Im dissapointed because Im not able to use Prime in my location.", "verified": true, "helpfulness": "1/2", "author": "Gustavo Castañaza"}]