[{"rating": 3.0, "review": "too many pay to view movies, with the exception of Netflix it is not what I expected", "verified": true, "helpfulness": "0/0", "author": "Gene Lapura"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "A. Navarro \"lisalupner\""}, {"rating": 5.0, "review": "I really like using this device the whole family uses itto watch quite a variety of movies.", "verified": true, "helpfulness": "0/0", "author": "Peter Hadeler"}, {"rating": 1.0, "review": "Doesn't work. They never tell you can't watch outside the US. I have Amazon Prime and both a fire stick. Connected in the US while in vacation and works fine. When I attempted connecting in Mexico it doesn' t work!!! You don't have that problem with Apple TV!! Apple TV allows you to watch content anywhere in the world regardless where you connect it. I strongly recommend you buy Apple TV if you live outside the US and get ready to think that the only thing Amazon Prime will give you will be the two day delivery!!!! Mean while I will grab a lighter and set fire to my stick, looks like that is the only way I will be able to call it fire TV!!", "verified": false, "helpfulness": "2/5", "author": "Rafael R."}, {"rating": 4.0, "review": "Very fast and very responsive. It's great for Amazon content. I wish you could pin app favs to the top for easier app start.", "verified": false, "helpfulness": "0/1", "author": "matt"}, {"rating": 5.0, "review": "Enjoying TV more and all the movies and catching up on missed TV series.", "verified": true, "helpfulness": "0/0", "author": "Kathryn S. Moreno"}, {"rating": 5.0, "review": "Fast streaming. very Impressed.", "verified": true, "helpfulness": "0/0", "author": "Todd Pollock"}, {"rating": 5.0, "review": "Very east to attach and configure for my accounts.  Took about 20 minutes.", "verified": true, "helpfulness": "0/0", "author": "Skyhawk"}, {"rating": 4.0, "review": "Good needs more free prime programs.", "verified": true, "helpfulness": "0/0", "author": "dawezil"}, {"rating": 5.0, "review": "Good stuff", "verified": true, "helpfulness": "0/0", "author": "Patty Gesmondi"}]