[{"rating": 5.0, "review": "I live out in the middle of no where USA so the only option I had was high dollar satelliet or just what ever you can pick up on a set of rabbit ears but with this it runs through the internet and I have a great selection movies with a picture perfect. I'm happy.", "verified": true, "helpfulness": "1/1", "author": "Phillip D. Criqui"}, {"rating": 5.0, "review": "Quck set-up.  Had to manually install updates to get Neflix to download.  Still getting used to the interface and will download a few games today.  Noticeable difference in speed compared to the first generation Roku with no network drops.  Glad I purchased.", "verified": true, "helpfulness": "1/1", "author": "Jennifer Simpson"}, {"rating": 5.0, "review": "I had no problem getting it synced to the HD Smart TV.  I did encounter a problem syncing it to an older HD TV that was about 6 years old.", "verified": true, "helpfulness": "0/0", "author": "Dolores C. Duncan"}, {"rating": 5.0, "review": "I'm an apple guy but the Fire TV out performs my Apple TV hands down.Apple better bring their A game with the Apple TV 4.", "verified": true, "helpfulness": "1/1", "author": "Smith R. Poston II"}, {"rating": 3.0, "review": "Love the versatility and apps, but needs mores storage or ability to expand with USB drive.", "verified": true, "helpfulness": "1/1", "author": "Christopher K Brown"}, {"rating": 4.0, "review": "Fine", "verified": true, "helpfulness": "0/0", "author": "paraavis"}, {"rating": 1.0, "review": "Great product but the worst customer service experience ever, and it's not even over yet.So I purchase this for my son as a gift. Whenever I purchase for somebody close i dont even think about mentioning it's going to be a gift, in this case it made a huge mess.If you purchase this and for instance game controller comes with some free games, the games will automatically be loaded to the amazon account the unit was purchased with, needless to say my son is not using my amazon account. After starting the chat to figure out how to move the games to my sons account i was transferred 4 times to different service reps. Then at the end was told they cant help me and firetv rep will call me. Finally after 2 hours on the chat and call I was told the only way to do this was to cancel my order and repurchase it as a gift. Well I did that, when the system came i wrapped it and waited till Christmas. After opening the unit and setting everything up, syncing content no trace of the free games. When I contacted the customer service. Asking them that I'm not sure where the games are and what should i do? They kept repeating the same thing basically description of game controller. that I can browse content, play, pause, as fast forward. Sent them the link to the page stating that it comes with free content and explained again just to be disconnected. When I got somebody else on chat after 30 min I was told they need to contact different department and hey will contact me in 1 to 2 days. Well I'm waiting this is about 3+ hours now, This is insane AMAZON WHATS GOING ON WITH YOUR CUSTOMER SERVICE!!!!!!!", "verified": false, "helpfulness": "4/8", "author": "Pete S"}, {"rating": 5.0, "review": "Bought two and gave one to my daughter. Easy to use and a fairly decent selection.  Not a monthly charge, buy once and use forever. You do need to buy a HDMI cord to go from the box to the TV.  Pause, skip forward or fast forward (or reverse) and the speak command works great even with a Southern accent", "verified": true, "helpfulness": "0/0", "author": "Leonard Griffin \"Paw Paw\""}, {"rating": 5.0, "review": "The voice search makes it easy for my family to find things to watch. Amazon Instant Video has almost everything I want to watch while Netflix has almost nothing. I love it!", "verified": true, "helpfulness": "0/0", "author": "jggonz \"jg\""}, {"rating": 5.0, "review": "Fire TV is a nice product. I use it to replace the computer connected to TV.  The remote control is a useful tool to search movies and TV shows. If you have a prime account, the fire TV is a bargain item to watch TV online.", "verified": true, "helpfulness": "0/0", "author": "ZIQIANG ZHOU"}]