[{"rating": 3.0, "review": "Would have loved to be able to use other audio - speakers. If there is a solution please share. Thanks!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works very well for what it does but don't think it is a cheaper version of Apple TV.  It will stream web content but that's it and the applicable apps are still sparse. Look forward to new apps to come out to make worthwhile.", "verified": true, "helpfulness": "0/0", "author": "Caleb Bryant"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Nikhil Shah"}, {"rating": 4.0, "review": "it cool product and hop to see more new software updates but it rally worth buying it that all .", "verified": true, "helpfulness": "0/0", "author": "Ali Naser"}, {"rating": 4.0, "review": "I like it so far, not a lot of apps work with it yet, but the potential is great. hopefull.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Very limited app selection. Pretty much just Netflix and HBO.  Works well, but needs a better library of apps to use.", "verified": false, "helpfulness": "0/0", "author": "Kimberly Gosnell"}, {"rating": 1.0, "review": "just use Netflix...  It's easier.  I thought it would also be like apple TV.  it's not.  don't waste your t", "verified": true, "helpfulness": "1/2", "author": "Steven T Stefanik"}, {"rating": 1.0, "review": "not compatible with our ISP. I was on the phone for 3 hours. our TV went out, had to buy a new one, thank you very much!", "verified": true, "helpfulness": "0/1", "author": "pam goucher"}, {"rating": 4.0, "review": "Although slightly miffed none of the images or commericial show the USB power tether that connects to the actual player, the player works very well. So far I have only connected my laptop to watch CBS shows, and they come through with little delay or other problems.  Set up is pretty slick. Plug in the player in the HDMI port, then plug in the connect USB to a power source, and the device automatically starts up, showing a code and a URL link to enter on your laptop or other device. Just go to that URL, enter the code, download the app and it adds a little icon in the right corner of your brower. Click it and you are connected.  Pretty easy. Obviously you need a subscription to Hulu plus / Netflix subscription to take full advantage of the player", "verified": true, "helpfulness": "0/0", "author": "Tom & Marilyn"}, {"rating": 1.0, "review": "I plugged the device to one of the HDMI Input socket of my Samsung Led TV and set it up according to the given instructions. It connected to my home network and I can see Chromecast on the TV Screen. The screen covered with a photo and it changes after awhile with a different photo. It says in the instructions that you have to use your smartphone or your laptop to download the Google TV Application which is called \"Chromecast Apps\". I did it first with my Iphone 5s and during the connection process to the Chromecast on the TV it said \"Sorry we do not support this device yet\". I tried it secondly with a LG Android Phone, this time it did not connect also saying \"No Chromecast device is found to be connected\". I tried this operation several times changing the HDMI ports etc. After the continuous failures I decided to try my son's Macbook Pro to download the Chromecast Apps and to connect to the TV but the same result. It says \"No Chromecast device is found to be connected\".I am trying to reach to the relevant section of Google for some help, sending feedback but not a single help yet. Probably I will return this Item to Amazon after some more tries!", "verified": true, "helpfulness": "1/2", "author": "N.Ugurel \"Necdet\""}]