[{"rating": 5.0, "review": "Device and interaction with this wifi smart device, as well as plethora of apps is very good.  However, I am frustrated that I can not easily broadcast iOS content in both music & video through Chromecast.  Everything else => Awesome!", "verified": true, "helpfulness": "0/0", "author": "Wade A Tennant"}, {"rating": 4.0, "review": "needs more options", "verified": true, "helpfulness": "0/0", "author": "A. P."}, {"rating": 3.0, "review": "I bought this for another person, but now i own it. I am confused as to its usage. Does this do the same as my ROKU player? do i plug it into my desktop computer? does the computer need to be on for it to work? I, lost", "verified": true, "helpfulness": "0/0", "author": "marguerite paduano"}, {"rating": 4.0, "review": "I think it is a good product for streaming only", "verified": true, "helpfulness": "0/0", "author": "pablo jimenez \"Picado3\""}, {"rating": 3.0, "review": "I was very excited to receive the Chromecast enabling me to watch Netflix and a few other channels on my upstairs TV.  Sadly, it's still not connected due to the fact my popular router (Motorola Surfboard) which is a primary router provided by Comcast is not on their list of approved routers.  It is not plug/play and I haven't gone back to work through all the details to potentially get it operational I was very disappointed this was not highlighted in the information more.  I gave it 3 stars due to the fact several friends have had no issue with connection as well as a friend I sent one too.", "verified": true, "helpfulness": "0/0", "author": "Bourbon Girl"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Scotty Hobby"}, {"rating": 4.0, "review": "Does everything advertised.  Anything you can bring up in your chrome browser can be cast to your TV with just a click.  No need to pay those high cable/sat bills anymore.", "verified": true, "helpfulness": "0/0", "author": "Paul R. Wickboldt"}, {"rating": 5.0, "review": "Good value for the money!", "verified": true, "helpfulness": "0/0", "author": "MARCO"}, {"rating": 4.0, "review": "sometimes can be a bit glitchy, but as long as you are ok turning your apps on and off again, this product is great", "verified": true, "helpfulness": "0/0", "author": "Nate G"}, {"rating": 5.0, "review": "Love it, I have an extra TV I didn't really use oftenonly to play video games,  but since I got the Chromecast I leave my big TV on the cable and use the smaller one to watch Netflix,  VUDU, Start, HBO and a lot more it's great, should've bought a long time ago.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]