[{"rating": 5.0, "review": "Great product!!!  Instantly streams videos and incredibly easy to install.  Works with Iphone, Ipad and my Chromebook.  Love, love, love!!", "verified": true, "helpfulness": "0/0", "author": "Pam Groves"}, {"rating": 5.0, "review": "Great great great product.Love it. I fell sorry for all the streamers around, It's a great streaming device that works right with your phone or tablet..", "verified": true, "helpfulness": "0/0", "author": "valen kam"}, {"rating": 5.0, "review": "Very easy to use, amazing price, brings new features too old TV sets, changes the way of watch youtube and Netflix!", "verified": true, "helpfulness": "0/0", "author": "William de Castro e Silva"}, {"rating": 5.0, "review": "The setup is very easy. The dongle does well what it is supposed to do! :) a great product. Very happy with it", "verified": true, "helpfulness": "0/0", "author": "Artur Cabarrão"}, {"rating": 5.0, "review": "Easy hdmi and network installation, perfect and bright display of content, simple usage for Youtube, Netflix and audio only content.", "verified": true, "helpfulness": "0/0", "author": "Vladimir Kerkhoff"}, {"rating": 4.0, "review": "Very happy with this product, can't wait for more services to be added but does what it does very well.", "verified": true, "helpfulness": "0/0", "author": "R. Tousignant"}, {"rating": 4.0, "review": "We ordered this from the US and its well worth the £32 we paid for it.It's really nice to be able to pick a movie on Netflix on my ipad or android phone and just send it to the TV; it overcomes the clunky TV interface and makes it much more usable.You can also use the mobile device as a remote.Shame I can't mirror the Chrome browser from my ipad, although it seems to work from a google laptop, but that's a minor thing and is probably more of a problem caused by Apple than Google.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Even in Canada, this is working wonders. I wish I could get another, as it's unfortunately unavailable in Canada at the moment.", "verified": true, "helpfulness": "0/0", "author": "Matthew Cunningham"}, {"rating": 5.0, "review": "Fantastic idea. It will only get better over time. I've noticed that sometimes it slows down playback. At first I thought it was because was using the USB port on my TV set to power it. But it still happens using a normal electric outlet. But even with that been said I still give this product a 5 star. Because I do believe this is software related and with the proper time it will be fixed.", "verified": true, "helpfulness": "0/0", "author": "Hebert Bernardo"}, {"rating": 3.0, "review": "Its ok , but limited to few applications like Youtube etc. Tab view only on google chrome and not full HD :(", "verified": true, "helpfulness": "0/0", "author": "Eno Kapo"}]