[{"rating": 5.0, "review": "I love this thing. So much. Casting from any device is incredibly easy and setup is a breeze.I got so caught up with how much I appreciated this little device one time that I started kissing it, and my lady friend caught me. I had to tell her I spilled BBQ sauce on it and was licking it off. She makes me wear a bib now. I recommend you not kiss your Chromecast.Whenever we have friends over I can make them gather 'round the tv and cast HBO GO, Netflix, Hulu, Pandora right from my phone. But really I just bring up Youtube and make them rewatch Miley Cyrus videos with me. Not many people come over any more.So, you should get a Chromecast. I'll just be here watching Party in the USA in my bib and loving life.", "verified": true, "helpfulness": "0/0", "author": "Augustine"}, {"rating": 5.0, "review": "I need another one for my room. I bought this as a gift for my sister. I am so jealy! She can play Pandora, Netflix, YouTube or even mirror whatever she's doing on her tablet or computer all on her TV screen. This is a brilliant product and you can't beat the price!", "verified": true, "helpfulness": "0/0", "author": "Valery"}, {"rating": 5.0, "review": "I finally started using the Google Chromecast device after having it for three weeks and wow, it is so cool. I am able to stream from my iMac, iPhone and iPad to the big screen TV without any issues or cables running everywhere. Just a small cable that pluggs into electric plug and then into the device. It is easy to use if you watch a couple of the utube how to's first. That's for us older folks. I'm able to view movies, music , anything I have on my computer I have been able to drag n drop into the browser. Handy device to have.", "verified": true, "helpfulness": "0/0", "author": "Calop"}, {"rating": 1.0, "review": "I bought the chromecast device to try to watch my shows from my pc to my tv.I have a top of the line gaming PC with all the bells and whistles.I have very fast internet speeds.This thing is so laggy,I couldn't bear to watch it.I sent it back the same day as I received it.I just took my monster pc and ran HDMI cable from it to the tv.Now I can play and watch everything on a 50' tv.It may not look pretty because of all the wires and what not,but at least it didn't lag!", "verified": true, "helpfulness": "0/0", "author": "KissimmeeDisney"}, {"rating": 5.0, "review": "Should've gotten this instead of solely her crap I got that I can't even remember the name off the top of my head right now... I can stream straight off my phone with this. Love it!", "verified": true, "helpfulness": "0/0", "author": "Liz Lovo"}, {"rating": 4.0, "review": "The chromecast is super easy to configure, in just a few minutes it's already working. Don't let any \"frequently bought together\"  message fool you, it contains everything you need to set it up.Just keep in mind that not all applications will be compatible, so if you're buying it mainly to use it with one app, make sure you check compatibility first. Also, displaying your device's screen on the TV will ONLY work if the device is running Android 4.4+", "verified": true, "helpfulness": "0/0", "author": "Freddy Salazar"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Domingos Barbatti Barcellos"}, {"rating": 5.0, "review": "Great idea.  Installs easily and woks great.  The fast shipping is also appreiciated.", "verified": true, "helpfulness": "0/0", "author": "Oly E Sys \"Oly E Sys\""}, {"rating": 5.0, "review": "Great device...works easily with all our devices.  Need faster Wi Fi to really enjoy the playback with no buffering.", "verified": true, "helpfulness": "0/0", "author": "RRR"}, {"rating": 1.0, "review": "CANNOT USE IT! IT IS NOT ABLE TO WORK WITH THE CABLE SYSTEM WIFI IN MY APARTMENT BUILDING.", "verified": true, "helpfulness": "0/0", "author": "DIANE & DANNYBOY \"DIANE CHAPMAN\""}]