[{"rating": 5.0, "review": "This Google Chromecast works well for my needs, casting YouTube and Netflix from my iPhone 5 to our portable projector. We occasionally hold a \"movie\" night and had previously hook the projector up to a laptop, but this handy device makes it much easier!Setup was a little tricky and it took two attempts with a full reset to make it work, but it has been rock steady stable for weeks now.The interface is fairly intuitive and works fine from my Chrome browser on the PC and from the iPhone app!Highly Recommended!CFH", "verified": true, "helpfulness": "0/0", "author": "C. Hill \"CFH\""}, {"rating": 1.0, "review": "POOR POOR video performance. Motion blur extraordinaire. Get something better like a Tolu which not only works properly but as advertised", "verified": true, "helpfulness": "1/3", "author": "GREGORY GORDON"}, {"rating": 3.0, "review": "still waiting for connection on android phone, tablet to chromecast in browser other thancommercial sites ---- it is what I purchased it for", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bought this item for my Son and it works great with his Samsung Tablet, it does all that it says!!!!!", "verified": true, "helpfulness": "1/1", "author": "Kamanie Manderson"}, {"rating": 1.0, "review": "Doesn't work in hotels or college dorm rooms.  Stupid product, waste of $35.  It should be more clear of where it should actually work.  Thanks Obama", "verified": true, "helpfulness": "2/20", "author": "Chris"}, {"rating": 3.0, "review": "The dongle works great, the interface is easy to use but there is a lack of application to use with it !", "verified": true, "helpfulness": "0/0", "author": "Gas"}, {"rating": 3.0, "review": "Main reason I bought it was to play my iTunes video library and google stopped it. A big disappointment on google", "verified": true, "helpfulness": "1/3", "author": "wilton Rodriguez"}, {"rating": 2.0, "review": "Very limited.  Not at all what I expected.  Luckily I was able to sell it on craigslist and get my full purchase price back.Get an AppleTV instead.", "verified": true, "helpfulness": "0/4", "author": "chone253"}, {"rating": 5.0, "review": "Great device for the money. Awesome Youtube playback device, thought make sure your Wifi Signal is strong for good sound and picture quality. For $35 bucks you can't really complain.", "verified": true, "helpfulness": "0/0", "author": "James Yang"}, {"rating": 4.0, "review": "Easy set up, just some playback issues occasionally, probably the internet connection.It's a low cost way to turn your TV into a smart TV, be a lot better when there is more available content.", "verified": true, "helpfulness": "0/0", "author": "Imerys Minerals Ltd C M Bean"}]