[{"rating": 5.0, "review": "Only one issue if your HDMI is older than 2012 you will have to use the mini-usb plug in for a power source.", "verified": true, "helpfulness": "0/0", "author": "Samuel Langhorne Clemens \"The Read Reader\""}, {"rating": 5.0, "review": "I was worried that it would be difficult to get it to work with my tv.  It was so easy to install, and I was watching youtube videos on my tv in 5 minutes.  I would recommend this to anyone that wants to stream movies.  It has a great price and really works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Cindy Howarth"}, {"rating": 5.0, "review": "works well and a super simple set-up. we bought one for another room and liked it so much we replaced our roku box with another.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Caywood"}, {"rating": 1.0, "review": "There was so much hype over this thing when it was announced but it falls short of the mark in my opinion. It's very limited capability soon saw it relegated to the bottom drawer, never to be used again. I heard someone had successfully rooted it or unlocked it, which may change the game completely, but as it is, it's a VERY niche product.", "verified": true, "helpfulness": "1/1", "author": "Gary"}, {"rating": 1.0, "review": "I bought Chromecast after seeing advertisements on television. \"This,\" said I, \"is what we need.  No more HDMI cables hanging from the TV. No more embarrassing I-have-to-hook-up-the-laptop-to-watch-internet-content.  I MUST HAVE IT!\"  I imagined a TV infomercial where in the before picture, a television had a virtual nest of cables hanging down, some of them arcing electricity and smoke coming from the whole thing.  \"Do you have trouble hooking your television up to watch internet?\" they'd ask in a voiceover.  Then a scene of someone trying to plug in an HDMI cable and continuously fumbling it, then injuring their thumb and looking very cross, as the voiceover continues, \"Tired of plugging things in and injuring yourself?\" Oh, this was a made-for-tv commercial if I ever saw one.\"What's that, hon?\" said my wife.Well, once I described it to her, she said, \"let's get it.\"It arrived in a little white and silver box, and inside was nestled a big, matte black HDMI Chromecast.  It had a power connection, and I plugged it into the HDMI port on my television.  I was able to download the app to run the thing and quickly configured it.  I named it \"Igor,\" because it was similar in function to that worthy from the Young Frankenstein. \"Eeegor\", not \"eye-gor,\" of course.  And I noted that I could run it from any device which was using my dlink router, including my PC (a cable connection), or laptop.  I began to go down the list of stuff we could watch on it:1. youtube.  Hurrah!  Of course, I can watch youtube from my DVD player.  So... it's not really useful for that.2. Netflix!  Well, here's something.  But wait! I can also watch netflix from my DVD player.3. Um.... Hulu plus!!! Having recently kicked out the cable company, we subscribed to hulu plus.  Now we could watch it on the television using chromecast.[cue needle across record noise, which nobody under 30 really understands the meaning any more.]I pull up hulu plus, and there's no little tab thing to send it to Chromecast.  I hunt around for an answer.  Obviously, it's just another doodad app I need to download, right?Nope.It seems there IS a function for running Hulu plus from your smart phone.  But what if I don't have a smart phone, or want to stream it from my computer?  Did you guess where this was going, reader?  Yes.  It's true.  It couldn't do the ONE thing I wanted it to do.  Now, you can \"cast\" a tab of Google, but as some other wise 1 star review pointed out, this is a kludge solution and it isn't the kind of quality I desire.  The idea is to use the devices I currently own to supplant the cost of having cable.I tried to make it work.  I looked around and haunted all the app developer places.  In fact, the app developers began to shout and stamp their feet when they'd see me about, sometimes they'd throw a beer bottle at me. \"Get out of here! We don't have your Chrome apps!\"  they'd yell, and I'd cower behind a fire escape and wonder why I'd bought the Chromecast in the first place.  Oh yeah... for Hulu Plus.So, I'm lighter the $6.00 Amazon return fee, and that'll teach me to read much, much more carefully.So, if you're the type who has a smart phone, and you want to cast from that, why, this might be the very product you were looking for.Me, I bought a ROKU.  Guess what it's doing right now? Did you say \"streaming hulu plus in glorious splashes of color\"? 'Cause you'd be right. And what else does it have? A remote.  A remote with joker purple buttons.  And a button for Amazon instant video, and so on and so forth.  (Did I mention that Chromecast can't stream Amazon instant video? I didn't? Well, it can't.) But I digress. The point is, for $19 more, the Roku has much better functionality.Farewell Chromecast. It wasn't meant to be.", "verified": true, "helpfulness": "3/4", "author": "Matt Bowes"}, {"rating": 4.0, "review": "If you want to watch Netflix on your tv but don't want to spend a bunch of money on a smart tv or smart dvd player then this is the device for you. It's a tiny device, the size of your finger, that plugs into the hdmi port of your tv and is powered using a usb device. I have mine plugged into my tv so it's only on when the tv is on. Setting up the device takes 30 seconds max. All you need to do is power on the device and visit the specified website with your computer or mobile device to set it up. Music is easily streamed using googles music app which is useful if all you have is a tv nearby to play some music. Video's from Netflix play flawlessly when the cast option in the Netflix app actually shows. Must of the time I have to go through the trouble of resetting my router, phone and chrome cast to have the cast button show up. Casting from the actually chrome browser is very sluggish. scrolling is not smooth at all and if you want to watch a video forget it. There are some great apps slowly appearing due to the sdk being available but it is still going to take some time for many apps to start appearing. One useful one called video stream was a savior which allowed to stream movies and photos flawlessly which is why I'm giving it 4 stars rather than 3. My biggest disappointment was when i found out that amazon prime video was not compatible with the chrome cast.Currently the chrome cast is useful for those wanting an easy way to watch netflix, play music, stream videos and pictures as well as play a couple of games. At the current price of $35 i would recommend it although it has gone down to $30 at some point and students receive an extra $5 off (not sure if the promotion is still running) which can lower it to as much as $25. At that price it is worth it just to have one around, especially with all the new apps which we should hopefully start seeing to appear soon", "verified": true, "helpfulness": "0/0", "author": "allen"}, {"rating": 5.0, "review": "Very good product,The connection with my nexus 4 is wonderful!But you don't have Enough application that interfaced with the chromecast, but I think that in the future it will be better.", "verified": true, "helpfulness": "0/0", "author": "or bardugo"}, {"rating": 5.0, "review": "I basically use three non-cable services: netflix, HBOgo, and amazon streaming (in that order). I wanted a way to easily watch HBO shows without having to link up my computer via hdmi, since netflix already works via my wii/bluray player. I was debating between the Chromecast and Roku, but what sealed it for me was that HBOgo doesn't work for comcast subscribers on Roku (which is ridiculous, but whatever). I also don't need, or have the time to sort through, a ton of extra channels.The chromecast is a BREEZE to set up and has worked without any issues for me. I set one up at my parents' house as well, and they haven't had any trouble using it either. While I wish there were more app options (looking at you, amazon streaming) it works really well for what it does. I may eventually decide to go for a Roku and cut the cable cord, but I'm not there yet.In sum: for what it does (supplementing cable with a limited, but reliable, range of options), it's GREAT. You can't beat the price, either. However, be sure to do your research on what it does, and doesn't, do, or you may be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Elle \"Elle\""}, {"rating": 1.0, "review": "Bought this from bestbuy and was very excited with the prospect. Right away I ran in to problems. After a lot of searching I found a 24/7 Google helpline. The guy offered a few tricks to get my chromecast to work. my router is compatible so we tried turning it and the chromecast off to reset them. That didn't help so we tried something else that also did not work. My assistor was ready to give up so he sent me some email he thought would do the trick. It was a bunch of crap I had already tried off the website. Stuff like making sure my router was compatible and getting the chromecast within twenty feet of the router. The easiest thing about it was taking it back. This thing is a piece of dirty crap . I'm sure it will work with a lot of people, but it seems to me as if Google should stick with search engines.", "verified": false, "helpfulness": "0/0", "author": "Travis Lampton"}, {"rating": 5.0, "review": "Easy to setup.  Works great.  Wish Iheart radio app was available.  No complaints.  Mainly use it to watch Hulu and there is no lag", "verified": true, "helpfulness": "0/0", "author": "Jefe'"}]