[{"rating": 5.0, "review": "I bought this as a gift for my 2 grandchildren.  They really like the games available as well as Netflix.  I was not aware of at the time is that in the games they cannot play against each other which deflated it a bit.  I had bought 2 controllers and I only needed 1 due to this.  Also I was not aware that it required a smart TV.  I do not remember this being disclosed either.  Overall I think it is a hit but wished I had known this prior to purchase.", "verified": true, "helpfulness": "0/0", "author": "teresa hurley"}, {"rating": 5.0, "review": "This sure expands our TV choices!", "verified": true, "helpfulness": "0/0", "author": "Fritz Anzivino"}, {"rating": 5.0, "review": "I usually do not write reviews, but I was truly amazed at how simple this was to set up and use. I was able to set up and watch Fire TV in less than 5 minutes. It is very user friendly.", "verified": true, "helpfulness": "2/2", "author": "K. Daulton"}, {"rating": 5.0, "review": "This is the best and fast wi-fi", "verified": true, "helpfulness": "2/2", "author": "Dennis OToole"}, {"rating": 4.0, "review": "Looks great! I would seriously consider buying it, if you could get Disney Channel onboard for my kids.", "verified": false, "helpfulness": "0/0", "author": "Linda L. Reel"}, {"rating": 4.0, "review": "Great unit.  Very happy with this purchase.  I'd give 5 stars but my wife is binge watching The Good Wife while I write this.", "verified": true, "helpfulness": "0/0", "author": "john kenny"}, {"rating": 5.0, "review": "Love it!!! And really love the voice command remote and search!", "verified": true, "helpfulness": "0/0", "author": "Doris J. Hunter \"stray momma\""}, {"rating": 4.0, "review": "Excellent streaming device. My daughter loves the PBS for kids content. I also love the movie programming for prime members. The remote is fantastic for voice recognition, the only flaw or I should say \"tedious process\" is turning the device off.  There isn't seem to be an on and off switch anywhere on the device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to use, voice recognition works well.", "verified": true, "helpfulness": "0/0", "author": "Jerome Landesman \"longide\""}, {"rating": 5.0, "review": "Great Item", "verified": true, "helpfulness": "0/0", "author": "Michael A. Ruiz"}]