[{"rating": 4.0, "review": "I want to rate it a 5 but the product get way too hot and although I read its common for it to get hot and that its encased in what some say is a heat sink there is no way for it to cool it down since its encased in a hard plastic. So its rather warm to hot to the touch. I used the adapter and it appears to have help since its not direct with the tv which the HDMI ports also produce heat from a HDTV that is on for the most part of the day which adds ups causing the chromecast to become hotter. Other than the heat issue it works great for me. I am able to view youtube and viki videos which is what I bought it for. Video quality although its 480p on viki it is still really good. Youtube videos do play in HD I have yet to test Hulu and the other apps but I expect them to also play HD. I noticed that it cleans up the image compared to how it looks on computer so 480p looks much better than the norm. I am satisfied with it the only thing that worries me is the lifespan of this device do to how hot it runs.", "verified": true, "helpfulness": "1/1", "author": "Edgar Amaya"}, {"rating": 3.0, "review": "It's a great deal for the price. It's a little glitchy, though. The support for it also needs to be expanded. There are only a few things you can do with it right now. The sky should be the limit with what it is really capable of doing, though.", "verified": true, "helpfulness": "0/0", "author": "Jeff Bryant"}, {"rating": 3.0, "review": "we are still trying to figure out how to use it!we are still trying to figure out how to use it! trying to figure it out. Doesn't help with no directions.", "verified": true, "helpfulness": "0/1", "author": "lynda garcia-gomez"}, {"rating": 5.0, "review": "There are a lot of 1 star reviews on here so lets get some things straight. 1) It does exactly what it says it does: Streams with netflix, hulu plus, youtube, google music, and a few other apps. 2) You can stream local content but at a reduced quality unless you pay for plex. 3) It really is simple. You plug it in, and read the words that show up on your television. Some people gave it one star because it was difficult to setup but as long as you have the ability to read, this will not be a problem for you. Also, amazon instant videos is not on this. They do not have apps on android for this either (at least not on my devices). It is amazons fault that they haven't done so, not google.Summary: read what it does before you purchase it and I am sure you will give it at least 4 stars.", "verified": false, "helpfulness": "0/0", "author": "J3nnaB33"}, {"rating": 4.0, "review": "I bought this as a Christmas gift  for my parents, they loved being able to stream Netflix but It does Eat up allot of my internet bandwith to use.", "verified": true, "helpfulness": "0/0", "author": "Dean"}, {"rating": 5.0, "review": "For the price, you won't get anything comparable. It syncs to multiple devices, making it really convinent. It comes with an adapter for a strong internet connection, so that even if the TV you are using it with doesn't have a router very close, you will still get an excelent connection. Very very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 2.0, "review": "Chromecast is not compatible with my current NetGear/Verizon (non-FiOS) router.  It is sitting in the box unused until I can purchase a new router which is compatible with both.  This potential problem was not indicated by Google/Amazon when the purchase was made.  It may well end up costing another $100+ to get it working.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I mainly use it for YouTube and Netflix. You need a phone in order to control it so if you don't have a smart phone don't get it, it's not like the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Austin Godfrey"}, {"rating": 1.0, "review": "This is nothing but a local wifi screen connector that only works with Netflix. You still need a wifi network for this to work and content streamed comes though your wifi network NOT your cellular network. Google got it WRONG again!!Someone needs to make a version of this that allows the content streaming to come from you mobile device so it extends you mobile screen to your TV.", "verified": true, "helpfulness": "0/5", "author": "Rog"}, {"rating": 5.0, "review": "I wish this would work on dvds from your pc as well... I really do love this, one of the best purchases I have made... just add more things we can use with it.", "verified": true, "helpfulness": "0/1", "author": "Nora A."}]