[{"rating": 5.0, "review": "Love this device.  I upgraded my internet speed with my provider to help with loading issues.  I own an Apple TV, too.  I find this a much better buy because it includes Amazon Prime and Pandora.", "verified": true, "helpfulness": "0/0", "author": "S. LeCompte \"All children can learn\""}, {"rating": 5.0, "review": "Supper application and very competitive with Apple.....  so many things to watch and enjoy.", "verified": true, "helpfulness": "1/1", "author": "Ron Golfnut"}, {"rating": 5.0, "review": "Great little box, love it.", "verified": true, "helpfulness": "1/1", "author": "Mike Hill"}, {"rating": 4.0, "review": "So far I'm loving it and am very impressed with it. Installation and setup was easy and it is very responsive. This thing runs circles around our other media streamer (WD TV Live). We are not Prime members, but we love the Plex app and use it to stream our personal media through our home network. The young grandkids love playing games, the hubs likes steaming Netflix on it and I am a big You Tube watcher. Western Digital needs to take notes from Amazon, because they have hit it out of the ballpark with this fast and user friendly streamer. The only thing that I have been disappointed in so far is that I can't do a voice search of Netflix or of the media on my home network. We retired one WD TV Live player and will more than likely be replacing the second one before the end of the year.", "verified": true, "helpfulness": "1/1", "author": "J. Booth"}, {"rating": 5.0, "review": "Definitely a nice little android device for $100, I bought it so I could run the Android version of XBMC on it and it works very well for that. XBMC as a whole runs quite smoothly, I can stream my XBMC library to it and play files from an external hard drive and it streams and plays local high definition media relatively fine. It's also nice being able to control XBMC with the FTV remote.It's also proving to be a pretty good fit with traditional android apps/games and video game emulators with controller support, I love playing games like Super Hexagon and GTA on it with my 360 controller and you can connect a USB hub if you want to use more devices.With a little tweaking you can even set XBMC as the home launcher and launch all your other apps from there, and for that reason this is a perfect media center device for me and a steal for the price.", "verified": true, "helpfulness": "0/0", "author": "Author Unknown"}, {"rating": 5.0, "review": "Easiest set up I've ever experienced!  Super easy to use, navigate, voice command, search....wow!  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "s the quilter"}, {"rating": 4.0, "review": "Best feature on this is the voice recognition.  The unit is easy to use & makes finding a movie or favorite actor a snap!  Only complaint is that you have to order a cable cord for it, which isn't included & should be for the price.  Prime members have more choices for renting movies & get better price breaks.", "verified": true, "helpfulness": "0/0", "author": "Grandma of Five Toddlers"}, {"rating": 3.0, "review": "Delivery on time and set-up easy. First device we've had like this still getting use to it.", "verified": true, "helpfulness": "0/0", "author": "Denny"}, {"rating": 5.0, "review": "If your like many of us tring vidicate your monthly cable bill along with its crazy fee's and costs that are 17 times greater than that of inflation you no longer have to. Did you know that out of the 180+ channels that the average user pays for only 17 are watched; 17! Great, Ill just call up my local cable provider and pay for what I use; yeah right let me know how that turns out for ya. It a shame, they get you every way they can; Mr Smith wants to reduce his cable to basic - Sure they can do that for you, but expect your internet charges to go up 10-15 dollars because you are no longer a premium member....rrrrright. So like many with the help of a recent Cosumer Report story called \"Cut the Cables\" I made the switch to what I call \"User Based Programing\"Economic Pro's:1) I'm saving $70.00 a month.2) I pay for what I want to pay for.3) With Amazon Prime a significant amount of what I would pay for is free.4) For 7.99 a month what I can not find on Amazon TV I can find on HULU. (With a lot less comercials)Amazon TV Pros:1) Voice search works Great (Have fun with it just to see what it comes up with).2) Amazon has recently added a Prime section so you can see whats free vs a fee.3) Children programing is abundant and comercial free. Plenty of education TV.4) Parental Timed Controls.5) Good menu system6) Seemless switching between menus7) Good suggestions system.8) Resonable prices on rentals and movie purchases9) Games if your into that but dont expect it to compete with PS4.10) Small unabtrusive box.Cons:1) Your gonna have to get use to programing your content. I was never a big TV watcher but even I said to my wife: What the HELL do I like to watch. Apparently after 2 weeks its documentaries, nature shows, history shows (all free mind you)2) Your favorite shows arrive one day later on HULU. So Monday night RAW becomes Tuesday Night RAW (or any hour RAW after Monday).3) Menu could be better or at least more customizable.4) Amazon TV is cloud based so if you have a slow connection it may drop below HD quality or lag.5) The controler is small, like itty bitty, like you'ld never see this dude using a public shower kind of small, like....ok I guess you get it.Hope this helped...Sounds", "verified": true, "helpfulness": "5/5", "author": "Sounds"}, {"rating": 5.0, "review": "This thing is totally awesome! It blows my Blu-ray DVD player away with its connection speed and the stuff it can do.  Who knew that you could flip a movie from your Kindle Fire HD to the TV and keep on watching.  I cannot say enough about how easy it was to connect this sucker to my wireless network...I think my cat could do it with one paw behind her back.", "verified": true, "helpfulness": "0/0", "author": "Daniela Iniguez \"chyna4\""}]