[{"rating": 5.0, "review": "This is the best thing I've purchased for my TV since the TV itself. We opted NOT to get the smart TV as it was a few hundred dollars in savings by just having a 'dumb' TV. When I heard about this I had to get one considering the price and the majority of the media I watch comes from the applications this already supports! I can't wait to see how far they push this little device!", "verified": true, "helpfulness": "1/1", "author": "edward depaola"}, {"rating": 2.0, "review": "Although I am android/google fan, I don't like this product because:- of the restrictions it places on the usage. There are limited number of apps. Yes, you can use the chrome browser to stream a tab or the whole screen, but it is a hit and miss. The whole screen is experimental, so it is not clear it will always be there.- The support in the apps needs more work. Once you start a stream, it is going through the chromecast directly. First, it has to rebuffer what had already started in the app (no way to start it the first time directly on the chromecast). Second, if the connection is slow, the rebuffering takes time (they could have transferred the queue from the computer to the chromecast, though I know this is harder than it sounds).- I took this to a hotel, where they have a good wireless network and they didn't block this service. Maybe the computer and the chromecast were picking different access points, but, it took once 30 minutes to re-establish the connection to the chromecast from a PC and/or from an ipad.In sum, I don't like the restrictions and it is half baked. For the price I could have kept it, but, I would like to show my dislike of the restrictions, and I will return it. I do have an apple TV which has the same restrictions, and I don't need another restrictive product.Next time, I will just get a long hdmi cable along the PC, and that is good enough.", "verified": true, "helpfulness": "1/1", "author": "Oz"}, {"rating": 5.0, "review": "I did want to have this beautiful gadget from the day it was on sale. Lo mejor de lo mejor!!", "verified": false, "helpfulness": "1/1", "author": "Griselda Osoria"}, {"rating": 5.0, "review": "This is an awesome easy to use piece of hardware. I totally recommend it if you want to stream hulu or something ON your TV while being able to play on your computer. It is slower than if you actually connect your computer using an HDMI cord, but I recommend it. Price is great too.", "verified": true, "helpfulness": "1/1", "author": "SF"}, {"rating": 2.0, "review": "This little gadget from google it's ok if you have an old TV.  Newer TV comes with Apps for Netflix, Hulu, etc., so it didn't do anything for me.", "verified": true, "helpfulness": "0/2", "author": "Jose A. Cedeno \"joeyula\""}, {"rating": 5.0, "review": "Simple set up, simple to use. So much more convenient than using our PS3 to stream Netflix and music, and so affordable. Ready to buy a second one.", "verified": true, "helpfulness": "1/1", "author": "Ashley"}, {"rating": 1.0, "review": "It does not live up to the hype and expectations fell very short. I would not recommend it. Piece of .....How can I rate it 0 stars ???", "verified": false, "helpfulness": "0/6", "author": "DanArt"}, {"rating": 4.0, "review": "Makes watching Netflix a breeze.  I wish it would allow me to stream any online video I wanted as it is very specific to what it will allow (Netflix, Hulu, YouTube), but if you watch Netflix as much as I do it's very nice.  Switches seamlessly between my husband's and my phones as remotes.  I like it better than the Wii and Motorola tablet we previously used for Netflix.  I'll probably get another one for the bedroom.  Price can't be beat!  I'd give it 5 stars if it worked with more streaming applications!Pros: Use phone as remote  Ease of use with NetflixCons: Limited applications", "verified": true, "helpfulness": "1/1", "author": "Sonja"}, {"rating": 5.0, "review": "Super easy set up.  Portable for trips.  Works flawlessly.  Better picture quality than my Blueray. Anticipating more options.  Price point Rocks.  User interface is beautiful.", "verified": true, "helpfulness": "1/1", "author": "Cliffmyster"}, {"rating": 5.0, "review": "It took me about seven to ten minutes to get the Chromecast hooked up to my wifi.  It works perfectly, exactly as described and makes any tv with an HDMI port a Smart tv.  Now my grandchildren can watch Netflix in their room!  I bought a second one for them to take home and now my daughter uses it as much as they do.  For the price, I'm thinking about buying one or two more for stocking stuffers for Christmas!", "verified": true, "helpfulness": "2/3", "author": "Veronica Carson"}]