[{"rating": 4.0, "review": "It made our tv relevant again! The set up and directions could have been better, but it was easy enough to figure out.", "verified": true, "helpfulness": "0/0", "author": "WindyCity"}, {"rating": 5.0, "review": "For me Chromecast is having an invisible HDMI cable magically connected from my TV to all my computers.And the photographs Chromecast displays while idle are breathtaking.Thank You Google.", "verified": true, "helpfulness": "0/0", "author": "Don B"}, {"rating": 5.0, "review": "Great device. Streams perfectly. In TV Heaven with Netflix HBO GO and YouTube. Excellent. Would highly recommend to anyone with smartphone and wi Fi", "verified": true, "helpfulness": "0/0", "author": "Richard S."}, {"rating": 5.0, "review": "this device is very good, has exceeded expectations since I use my tv as a monitor for my laptop, I can also watch my favorite programs on my tv you yube. It is a great invention!", "verified": true, "helpfulness": "0/0", "author": "Oscar A. Blanco \"oblanco\""}, {"rating": 5.0, "review": "I love my Google chrome and use it all the time.  Google also continues to be compatible with more apps and programs.  This is definitely the best bang for your buck!", "verified": true, "helpfulness": "1/1", "author": "Travis M. Parsons \"TP\""}, {"rating": 5.0, "review": "This product was very useful and helpful when we wanted to watch YouTube videos and Hulu videosand I hope they update the product more.", "verified": true, "helpfulness": "1/1", "author": "Ricardo Kelly"}, {"rating": 5.0, "review": "Very easy to set up and it works perfectly. Streams from my laptop and my i phoneJose A. B", "verified": true, "helpfulness": "1/1", "author": "jose alejandro bernate"}, {"rating": 4.0, "review": "Giving four stars as I have yet to figure out how to make it work with my iPhone. Otherwise it is great from my computer!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I was very excited to finally buy one of these little gadgets and it was very easy to set up. I do enjoy the ability to stream YouTube to my television.  In fact, sometimes I'll find a playlist and just let it stream through.  I just don't seem to have more of a use for it than that. I usually default to my Roku. If you don't have another streaming device, this is a good start. Otherwise, I'd save your money.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 4.0, "review": "Awesome product. Easy to install and set up. Looking forward to seeing more outlets to stream from (Showtime, iTunes, amazon).", "verified": true, "helpfulness": "0/0", "author": "Jenbos512"}]