[{"rating": 5.0, "review": "It was one of the most awesome gifts I could have bought! I bought two. One for the my husband' cave and one for the rec room. It is a gift that keeps giving!", "verified": true, "helpfulness": "3/3", "author": "Patricia Nulls"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "2/3", "author": "Gene"}, {"rating": 4.0, "review": "I like it. It works as advertised", "verified": true, "helpfulness": "1/2", "author": "Michael J. Hanson"}, {"rating": 5.0, "review": "Excellent product. Very easy to configure. US channels of course cant be seen in countries like India or Middle East. But otherwise, setting it up was a breeze, and available channels were very good in quality.", "verified": true, "helpfulness": "2/2", "author": "DR RAVI MATHAI"}, {"rating": 5.0, "review": "Purchased as a gift. Required contacting Amazon Customer Service via chat! Rayan was most helpful in getting the complimentary apps transferred to the recipient! Awesome customer service!", "verified": true, "helpfulness": "1/1", "author": "Karen C. Wiehoff \"Mert\""}, {"rating": 5.0, "review": "Let me start by saying before I purchase any new item I take the time to read the reviews and did so with this device. While the reviews were mixed I went ahead and purchased this for my parents. Now my parents are absolutely clueless when it comes to technology. This was easy as 1, 2, 3 to setup and my father was using it like a pro in less than five minuets. The voice command is amazing and makes searching for a particular show much easier for someone who has never searched with a remote. I have Amazon and Netflix and must say this is easier than both of them. A great device and very easy to use.", "verified": true, "helpfulness": "2/2", "author": "sheila rossin"}, {"rating": 5.0, "review": "Still getting to know my new Fire Tv but so far I like it.", "verified": true, "helpfulness": "2/2", "author": "Lea A. Demetrulias \"reapsow\""}, {"rating": 5.0, "review": "I love my Fire TV!  I've used the fireplace app a lot over Christmas but there is a lot to unwrap in this little black box.  Instant access to my Netflix and my music and videos...there is so much here.  I was able to grab one on the sale after Thanksgiving and it was a great deal. The remote works great.  I also downloaded the app for my Samsung Note 3 phone and that works perfectly as well.  And, to my utter surprise, the voice search feature worked flawlessly the first time.  They put a lot of thought into this and it's set up very well and is very intuitive.  For set up, I just followed the three step instructions, pull it out of the box, plug it in, and then watch it go.  It was already set for me since I am a Prime member, which is totally worth it.  If you've been considering Fire TV I highly recommend it.", "verified": true, "helpfulness": "3/3", "author": "S.A. \"S.A.\""}, {"rating": 1.0, "review": "The best I can say about this is that it's better than the Fire TV Stick, most of the time.The worst problem is that it routinely (every few hours) tells me that it needs an Internet connection, despite our connection being just fine.  The ONLY thing that gets it working is powering it off and on.The video quality for HD is low.  Splotchy and blocky.  Lots and lots and lots of \"buffering\"-type problems, and this on a commercial-class connection.The quality problem extend to Netflix, despite Netflix running without any problems on the much older Logitech Revue sitting next to it.Give this a year and let's see if they get the software straightened out.", "verified": true, "helpfulness": "0/4", "author": "Lynne Whitehorn-Umphres \"-Lynne W-U\""}, {"rating": 1.0, "review": "A total waste of money.  Could not get it to open Netflix which was the main reason I bought it.  Kept telling me that the app would open in a moment...never did.  So much for a Merry Christmas.  There must be a streaming device that actually works!", "verified": true, "helpfulness": "1/7", "author": "ERIC"}]