[{"rating": 1.0, "review": "Cant get it to work with my internet", "verified": true, "helpfulness": "0/0", "author": "Sue Kolundzic"}, {"rating": 5.0, "review": "Best gadget i've seen in a long time - you plug it in, follow the easy instructions, and you're \"Casting\" your Google Chrome screen on the PC, directly to your TV.  I use it mostly for Netflix, but the latest version allows you to broadcast entire web pages if you're using the Chrome Browser (which is better than I.E. anyway !", "verified": true, "helpfulness": "0/0", "author": "David Harris"}, {"rating": 3.0, "review": "After a few hours use it can overheat. Does not deal well with broken movie encoding. I copy stuff from OTA antennas and transcode to chromecast format. Ocassionally it gets stuck. I suspect it is where my antenna had reception issues.", "verified": true, "helpfulness": "0/0", "author": "Bullphourg"}, {"rating": 5.0, "review": "Love it great deal", "verified": true, "helpfulness": "0/0", "author": "angel c"}, {"rating": 5.0, "review": "Great and fast delivery !", "verified": true, "helpfulness": "0/0", "author": "Noe Reyes"}, {"rating": 4.0, "review": "It's a great little media player and comes with lots of awesome offers. Wifi can be a bit spotty though.", "verified": true, "helpfulness": "0/0", "author": "Caleb Moore"}, {"rating": 5.0, "review": "I've been trying to get everyone I know to buy one. It is one of the smartest investments I have ever made.", "verified": true, "helpfulness": "0/0", "author": "Mohsin ahmed"}, {"rating": 5.0, "review": "amazing how much value these provide.  finally cut the cord after trying it out.", "verified": true, "helpfulness": "0/0", "author": "B"}, {"rating": 4.0, "review": "I had some challenges setting it up but it works great and a lot of fun watching Utube videos on a big screen.", "verified": true, "helpfulness": "1/1", "author": "A Car Guy"}, {"rating": 5.0, "review": "Best purchase i could have ever made. Getting one for every tv!!", "verified": true, "helpfulness": "0/0", "author": "Andrew Bushman"}]