[{"rating": 5.0, "review": "Great product! I don't have a TV enable with LAN/WLAN connection and neither a bluray device with YouTube or something else. I bought Chromecast in order to send Youtube Videos to my TV. Chromecast works perfectly capturing the sound and the video of the Youtube Video and playing it in my TV.Also I downloaded an extension to my Chrome Browser (Laptop) to cast my tabs (only once per time) to my TV.I think soon will be more apps for ChromeCast, now you cannot cast videos from VLC, Quicktime or any of those types of apps.", "verified": true, "helpfulness": "0/0", "author": "Francisco Pecorella"}, {"rating": 4.0, "review": "I could reiterate all the positive things from all the other reviews but I'm sure everyone already knows them.  My only caveats are 1) no Amazon Prime Video - Google seriously needs to work this out with amazon....and 2) it doesn't remember how to connect to multiple networks.  So if you should take it with you to another house and plug it in, you'll have to enter the WiFi code on your android device for the new network.  And it will FORGET your old network entirely.  Sadly, it also doesn't allow your android device to TELL the Chromecast what the new WiFi key is.  You'll still have to type it in separately for the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Randall S. Magruder \"rmagruder\""}, {"rating": 2.0, "review": "We love the several of the Google products / services - docs, drive, gmail, calendar.  Very disappointed in Crhomecast. Have tried a couple of times to get this to work with our TV - just plain doesn't work. Have tried finding help online - fail. Had high hopes - epic fail.", "verified": true, "helpfulness": "0/2", "author": "Gashm \"Gashm\""}, {"rating": 5.0, "review": "Can't get any better then this. Watching any and all media from my phone and tablet. Best ever! BUY IT !", "verified": true, "helpfulness": "0/0", "author": "Bryan Owens"}, {"rating": 5.0, "review": "works very well and does what it says its suppose to. we are probably going to get a couple more for gifts", "verified": true, "helpfulness": "0/0", "author": "happy"}, {"rating": 3.0, "review": "I like it but the functionality is far too limited. If you're in an Android world, then it will seem pretty cool. However, I'm a Blackberry on a PC. Altho, I can run Android apps on my phone, it's not really worth it.It would have more value, to me, if I could stream my desktop altogether.. a true or full wifi+hdmi solution.As of now, I'd give it away but don't know anyone who would want it. So many people are technologically SLOW and I hate having to be tech support b/c i'm not.", "verified": true, "helpfulness": "0/0", "author": "Phat Boy Elite \"Signature?\""}, {"rating": 5.0, "review": "Amazingly affordable. I love it.  I saved me from the failure of my TIVO device to get NETFLIX.Thank you Google!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "This was a cinch to hook up and worked right out of the box.  I'm going to try taking it with me on vacation so that I can watch netflix in my hotel room.  I'll try to remember to come back hear to tell whether that works or not (I'm hoping yes!)", "verified": true, "helpfulness": "0/0", "author": "Kathy Fila"}, {"rating": 5.0, "review": "This simple little device projects things from your phone to the t.v. magically with just a few minutes of setup!  Wasn't so long ago we had to own expensive game consoles to watch Netflix.  Not anymore!  $35.00 and your set!", "verified": false, "helpfulness": "0/0", "author": "Steve Magee"}, {"rating": 5.0, "review": "Why ? I can't and don't want to read them all. Wow, to think that there are those many people like me, with nothing to do all day but write and read reviews on amazon!", "verified": false, "helpfulness": "0/1", "author": "Reidh Beallagh \"Reidh\""}]