[{"rating": 1.0, "review": "I am not happy with my player.  The screen flickers and fails often... resulting in several times where I had to unplug and restart it.  It eventually returns to it's normal flickering self.  My ROKU has no such struggles.", "verified": true, "helpfulness": "0/0", "author": "Bryan L Walker"}, {"rating": 3.0, "review": "I could see this being excellent for the office or a professional setting. I have a few friends that use this in their offices and it streamlines everything. I used this at home. Wasn't great. Didn't hold a candle to Roku or any other streaming devices like Xbox. I bought it to try it out. It didn't do better than my original roku so I returned it. Google will make this product better, I know it. But right now it isn't quite there with the rest of the market.", "verified": true, "helpfulness": "0/0", "author": "Zach"}, {"rating": 5.0, "review": "easy to use with my ipone, works seamlessly, just search youtube or netflix video and play on big screen with one click.", "verified": true, "helpfulness": "0/0", "author": "Margarita"}, {"rating": 1.0, "review": "It was difficult to install, only a few available apps to display content you can already send with other devices much better. You have to use google chrome web browser.", "verified": true, "helpfulness": "0/1", "author": "J. Molina"}, {"rating": 4.0, "review": "Easy set-up, works well but also crashes often.  Improve reliability of software and this will be big hit among consumers", "verified": true, "helpfulness": "0/0", "author": "Mittal Bhiogade \"Philly Boy\""}, {"rating": 5.0, "review": "I just purchased this item a couple of weeks ago and I love it.  I am able to stream more things to my big screen TV using it.  The only problem I have noticed; (and it may be more on my end, not really sure yet), is that when streaming music, there are occasional gaps in the song being streamed.  May also be a way to deter anyone from wanting to copy the music; I don't know.", "verified": true, "helpfulness": "0/0", "author": "Ben \"Benny\""}, {"rating": 5.0, "review": "We love it so much we ordered another and it works so well that when our contract is up we will cancel our cable subscription. We use it all the time!!", "verified": true, "helpfulness": "0/0", "author": "Mary Jo Saenz"}, {"rating": 5.0, "review": "Soooo Cool.  I have been using it for 6 months and love it.  Good job Google.  Works great with my iphone.", "verified": true, "helpfulness": "0/0", "author": "Mark Behrens"}, {"rating": 5.0, "review": "Awesome, works great with Netflix and YouTube.  Just plug in, follow the instructions and bang! You are up and running in less than five minutes", "verified": true, "helpfulness": "0/0", "author": "BykJnky"}, {"rating": 4.0, "review": "I love my chromecast. It was easy to install on my tv and set up. It plays movies on my TV and for the first time I can relax in my bedroom and watch things. However, the device only allows Netflix, HBO Go, Hulu, Pandora, Youtube and I can play all my pictures and movies on the TV. I am VERY DISAPPOINTED that I cannot play my Amazon Prime movies. I really don't understand this. I am paying to get Prime and part of the reason was to watch their movies. I will take this into account when it comes time to renew Prime, especially since Prime membership is going up in price.", "verified": false, "helpfulness": "0/0", "author": "M. Hartman"}]