[{"rating": 3.0, "review": "The selection of netflix movies for Latin America is very limited and the amount of services compatible with chromecast is very narrowed for now", "verified": true, "helpfulness": "0/0", "author": "Jose Briceno"}, {"rating": 5.0, "review": "I set this up using my phone in under 5 minutes.  The hardest part was getting the box open.  My daughter and I had so much fun watching YouTube videos on the big screen. The video quality is great.  I love how the video keeps playing even if my phone is not nearby or if I switch to a different application.", "verified": true, "helpfulness": "1/1", "author": "E. Covalla \"happyhouston\""}, {"rating": 4.0, "review": "It was a gift and it was ok to set up...  It was sorta a challenge to install but finally it worked...", "verified": true, "helpfulness": "0/0", "author": "Thomas E. Love"}, {"rating": 5.0, "review": "Worked exactly as expected. Download the app on your phone and it sets itself up instantly. Just plug in to  the HDMI port on yourtv.", "verified": true, "helpfulness": "0/0", "author": "Mary Kelsey"}, {"rating": 1.0, "review": "I bought it for all the reasons advertised as to the things it would allow me to do.  My IT person came to \"install\" and explain its operation to me and said it really wasn't geared for my iPhone IOS system, and more so for other operating systems such as with the Android.  He said I wouldn't be able to watch videos or view pictures on my phone as I thought, as well as a few other things you led me to believe I'd be able to do.  So, I sent it back.  I was very disappointed.", "verified": true, "helpfulness": "1/2", "author": "William Peysson"}, {"rating": 4.0, "review": "Best device out there for the price. I made my TV smart for just $35 instead of a $2500 smart TV! Streaming just got easier. The only cons are that there isn't enough apps only a select few. I hope they will include more apps in the future", "verified": true, "helpfulness": "0/0", "author": "Ttown2013"}, {"rating": 1.0, "review": "Product not working after one week of use. The device connects perfecly to the Tv but dosen't stream any video", "verified": true, "helpfulness": "0/0", "author": "eiran"}, {"rating": 1.0, "review": "Piece a s***. Don't works in windows 8 and the solution planted by google doesn't works eather. I throw away to the garbage. Thieves", "verified": true, "helpfulness": "0/0", "author": "Santiago Sierra"}, {"rating": 2.0, "review": "The amount of websites you can use this on is limited. I am glad that I only spent $35 on it.", "verified": true, "helpfulness": "0/0", "author": "piwhite1990"}, {"rating": 5.0, "review": "Cannot tell you how much I love this little piece of tech. It's always in use. Only real issues I had with it is sometimes gets too warm. I have to unplug and cool off, then it will pick up requests again.", "verified": true, "helpfulness": "0/0", "author": "Songfeather \"Angie m muller\""}]