[{"rating": 5.0, "review": "I simply love it, best investment I think I have made in years. I think anyone without any cable service would love to get this.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I love it, should of got a long time ago, if your thinking, do it your love it", "verified": true, "helpfulness": "0/0", "author": "larry"}, {"rating": 5.0, "review": "What a great device.  After you have one, you can't live without it. Very fast and great picture.  Five stars plus, all the way!  Very easy to install.", "verified": true, "helpfulness": "0/0", "author": "terry ellefson"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "scott abendroth"}, {"rating": 5.0, "review": "We had been running our content through our Wii for years, and when it finally conked, we went with Fire TV.  It's compact, silent and user friendly. The remote is extra nice, with the option of voice search.  We use it for Prime Video, Netflix and HBO Go.  No problems to report.", "verified": true, "helpfulness": "0/0", "author": "Wende D. Reynolds"}, {"rating": 2.0, "review": "***Update (changing from 4 star to 2 star)I've had the Fire TV for several months now, using it on almost a daily basis to watch Netflix, HBO Go, and Amazon content. I loved this little box so much that I even purchased one as a gift for my brother, but lately my outlook on the Fire TV has changed dramatically.My first issue is with playback of primarily HBO Go content, which I know HBO Go is not the best for streaming, but of all the devices I've done it on, this is the worse. For instance, I've been watching The Leftovers and in an hour episode, it probably buffered 6 times or so. I'm using WiFi, but none of my other devices like Roku boxes or Chromecasts are having issues.My second issue is with a bug, that I know Amazon is aware of and working on, according to forums I've been reading. When turning on the Fire TV the TV just shows a solid blue screen. Nothing makes it display the content of the Fire TV, until pulling the power on the box and plugging it back in. From what I've read this is again, a known issue, but it has been going on for weeks now.My third issue is with some of the apps like ESPN and HBO Go. When navigating it takes several seconds to move around to select content. Almost like there is a delay, which is strange with the specs they say this box has. Using the Roku box is much faster with navigating and loading of content in my opinion.My forth issue is something that I knew going into getting this device, but not having Google Pay is rough. With as much content that they have and having the ability to use gift cards and such, it is a store that is missing.My fifth issue is the lack of universal search, which the Roku has and the new version of the Apple TV is also suppose to have. If you do a search it only looks up Amazon content and HBO Go from what I can see. I love how the Roku looks up across all apps, provides prices, and so on. Makes looking up content easier.My sixth and final issue, once again is the UI. It is pretty much complete garbage. They layout does not make much since and getting to apps takes lots of clicks. You also can't organize the layout, unlike the Roku.As of right now I've moved this to a TV I don't use often and switched back to the Roku box, which has been a relief. If your looking for a streaming box, I would recommend not getting this and going with a Roku. Yes, it might not have the best specs, but it will get the job done and you will be happier with the experience.*********************************************************************************I would say that my family is made up of several heavy streamers. We get most of our content from Netflix, HBO, and some stuff on Amazon. We went through a phase where we had Apple TVs on every TV we own, but slowly phased those out for Roku 3 and Chromecasts. We needed another streaming device for our living room TV and I thought I would do some research on the Fire TV, as I saw a Fire TV Stick over Christmas and was impressed with the speed of the device. After comparing apps we use on a daily basis, specs, and a few other factors, I decided to give the Amazon Fire TV a try.My first impressions of the device out of the box were very positive. The box has a very sharp look it, unlike the hockey puck designs we have typically had. The remote has a great feeling in your hand and does not seem cheap, like the Roku.The device as a whole only take up a small piece of the shelf and has one single light on the front to show it is on. The unit also appears to shut off when not in use, unlike the Roku,which I like from a power usage standpoint. I would have to say that it is the nicest looking streamer on the market with the best remote, even like it more than Apple TV remote, as it feels better in your hand.As far as actual applications go, I don't feel any of the major players are missing. HBO was missing at launch, but is now available and works great. Biggest apps we use are Netflix, Amazon Prime, HBO, Showtime, and Pandora. The only app I wish they had was Google Video, as Roku just got it and it is nice for streaming shows and movies, but Amazon does the same thing of course. I have yet to download and play any games, however I would say Amazon has done a nice job making sure the key players part of their echo system.The specs for the Amazon Fire TV are the best on the market and you can feel them when using the box. There is hardly any lag when opening apps or starting videos, which is great. Amazon pushes the ASAP technology, where the device tries to predict what you might watch and have it ready, so there is absolutely no buffering. I have yet to really experience this, as I believe it most likely only works with Amazon video. I also believe the box supports multi tasking to an extent, as I've gone to the home screen played around in another app and when I've got back into the first app, it knows where I was. I read some other reviews, where people were listening to music and it keeps playing even when not in the app, which is like nothing I've ever seen.Now comes my problem with this box. I've never been a huge fan of Amazon's UI on any device, like the Kindle, Kindle Tablet, or their new Fire TVs. The UI works, but compared to the competition, just seems clunky and not intuitive. My main gripe with the Fire TV is how it lays out content and how it really pushes Amazon's content. It not only does this with the UI, but also with the voice search. Voice search allows you to search for apps, video, and audio content. However, this service only searches Amazon's info, not any of the other apps you have installed. This is one features that I hope improves, but for now Roku is the clear winner on, as it can search across all applications and show prices. I'm also not a huge fan of not being able to organize where apps are located, it orders them by what you used last.This device also supports being able to push video from your phone's apps, like YouTube and Netflix video which is nice.Below I will summarize the biggest pros and cons to this device:Pros:- Great looking device with an amazing remote control- Quality phone application, which does everything the physical remotes does and acts as a keyboard (similar to Roku's)- Speed of the device is like nothing I've ever experienced- Amazon has support from all the major players in terms of applicationsCons:- UI needs some improvements to make it more user friendly- As it is a box from Amazon, it is to be expected, but the voice and ASAP technology appear to be only Amazon specific- Would be nice if it had better support from Spotify, Google Music, and Google Play (but I don't expect this to ever come)In summary, this is right now one of the priciest boxes on the market as all the competition has not had a major refresh yet, so their prices have fallen to the $70 range. Even though it is one of the most expensive boxes, it in my opinion might be one of the best in terms of hardware, performance, and overall use. If you purchase a lot of content, you may need to start switching your echo system more to Amazon video if you use other services through Apple or Google, but if you primarily use Netflix, HBO, and other services it won't matter to much. Overall, I would highly recommend this device and it has made me want to purchase additional ones and possibly try their streaming stick on a few of our smaller TV's with Chromecasts.", "verified": true, "helpfulness": "0/0", "author": "Aaron Mills \"VWHSRocket\""}, {"rating": 3.0, "review": "Pretty darn good; too bad it is $30 more than the Apple TV.  The only thing this gadget has going for it for the $30 bucks more is that you can load other apps to it.Update: It is acting up now....it doesn't shut down after 30 minutes.", "verified": true, "helpfulness": "0/0", "author": "mobius \"mobiuspowershred\""}, {"rating": 4.0, "review": "I am really, really impressed with the Fire TV.  At this point my only complaints are that the interface is just not quite there.  I have not tried any of the games that require the controller - as I do not have the controller.", "verified": true, "helpfulness": "0/0", "author": "Jason L"}, {"rating": 2.0, "review": "I got this to watch shows the day after they air on Hulu.  It freezes up a lot, and you have to play with the forward & reverse to get it to unfreeze sometimes, but normally I have exit all the way out and start again.  I can't get CBS access which would be a big plus.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer \"scrapmom\""}, {"rating": 5.0, "review": "helped us to get Netflix on our new TV", "verified": true, "helpfulness": "0/0", "author": "Larry \"Buff\""}]