[{"rating": 5.0, "review": "It works like a charm. Set-up was fairly easy.", "verified": false, "helpfulness": "0/0", "author": "Russell E Christensen"}, {"rating": 5.0, "review": "LOVE IT!No more to say, just an amazing product.", "verified": true, "helpfulness": "0/0", "author": "eduardovitalino"}, {"rating": 4.0, "review": "I love this, but be warned that this is for private wifi connections. This worked at my house, but once I moved to school this stopped working due to the type of connections needed to hook up to the public wifi. Otherwise I love this and would prefer if there was an option to encrypt this with a password that only certain users can use this.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Kye \"John\""}, {"rating": 5.0, "review": "I love it. I even google cast my pc chrome tab,and surf the internet in my 42\" screen TV, while lying in my bed.", "verified": true, "helpfulness": "0/0", "author": "Mercedes"}, {"rating": 5.0, "review": "I use this primarily for playing media from my phone.  Works great.  Image and sound quality are not affected at all.  Connects every time.  Can't beat the price. Will only get better with time as more aps are integrated.", "verified": true, "helpfulness": "0/0", "author": "John Burmeister"}, {"rating": 5.0, "review": "Love it.  With the screen mirroring enabled recently, I'm able to mirror my tablet screen and its very convenient.  My only gripe is I'm not able to view amazon prime movies since flash is not enabled on android tablets.  When i bought it, it came with 3 months of netflix and i didn't have to think much about buying it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"MM\""}, {"rating": 5.0, "review": "I'm so happy with Google Chromecast. I realy love it!!", "verified": true, "helpfulness": "0/0", "author": "Adao Silva Pereira"}, {"rating": 4.0, "review": "Got a Pretty Amazing Deal and with free shipping it costs me $25. I would have bought an apple tv if it was that cheap as I needed it for basically mirroring purposes. Although it needs refinement, it's a great cheap alternative to apple tv. I'll wait for the next apple tv  to come and till then see if this improves or not. Streaming through casting is nice although tab casting lags most of the time even though I have 60/30 mbps internet connection and the latest gigabit ac router.Also my internet was 20/5 before and it lagged so much but after upgrading my internet, which costs me only $5 extra, it works quite fine with 480p direct tab casting and streaming is perfect and smooth. 720p still needs work as sometimes the frames get slow.Basically your computer uploads the tab on the internet and then chromecast downloads it from google's servers. There is no actual mirroring going on like apple tv does, so the router doesn't matter but the internet speed does.", "verified": true, "helpfulness": "0/0", "author": "Sarang Mulchandani"}, {"rating": 5.0, "review": "Product works exactly as advertised!!  I purchased it for a Toshiba 720p 32\" LED TV.  I had read some reviews that they might  not work on 720p displays so I called Amazon to get some feedback.  And, as always, Amazon was able to answer each and every question I had regarding this Google product.  The Amazon rep had a Chromecast and a 720 p tv and they interacted without issue for him.  (one of the many reasons I love Amazon.com)  Highly recommend the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Brady L. Gentry"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Chelsea Campbell"}]