[{"rating": 4.0, "review": "I don't use it much but it fills the bill for our non-smart TVs or the ones not connected via Roku. It's compact and easy to use and set up. Great for Netflix subscribers who heretofore were unable to stream video.", "verified": true, "helpfulness": "0/0", "author": "G. Cushing-murray"}, {"rating": 5.0, "review": "works smooth and easy to install, not only can u stream web pages to your HD tv you can also drag a movie into the browser and just stream it from there if u dont want to use flash drive or anything else.", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 4.0, "review": "It's pretty jumpy until you use an android app, if your using a chrome browser to look at video, the browser is going to transcode (compress and degrade the quality)the file and then send it over the wifi back to the chromecast, and that makes it very jumpy. Using an app to watch netfilx and youtube is very easy, but they need the iPhone app soon! I personally would not have launched with out it, but google probably turned the lack of an iOS app into an advantage, might of sold some additional Android based things doing so. It was easy to setup and it is easy to use esp from the proper app, but without it, it's jumpy even of an 802.11-N wifi network.", "verified": true, "helpfulness": "0/0", "author": "Not William Gates"}, {"rating": 3.0, "review": "This little gizmo has provided good connectivity and a pleasant surprise for how easy it is to set up it is allowed us to stream YouTube videos very easily and Netflix movies in high definition very well it this device is only going to get better with updates its good now and will be better with some improvements", "verified": true, "helpfulness": "0/0", "author": "T. woods"}, {"rating": 5.0, "review": "Extremely easy to set up and use. Streaming videos from all my devices is simple and easy, Best purchase I've made in decades. I've recommended it to all my friends.", "verified": true, "helpfulness": "0/0", "author": "Leon F. Washington"}, {"rating": 5.0, "review": "I love this thing.  It is so smart, so small, so fast.Setup was quick and easy and I find that I make very regular use of mine every day.  Far more than I thought I would.I can think of so many uses for this device and I am excited to see more and more services added to it.  I'm considering buying a bunch of them as gifts to other people considering how cheap they are.  They more than pay for themselves.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "This will change the way media is consumed off of the internet.Great as an addition to a bedroom or family room.", "verified": true, "helpfulness": "0/0", "author": "Trevor Craven"}, {"rating": 5.0, "review": "Finally enabled us to cut the cable. Good riddance to Comcast. Cut$100 off our monthly bills. Even got the free Netflix promo.", "verified": true, "helpfulness": "0/1", "author": "Ed Ditto \"GratefulEd\""}, {"rating": 3.0, "review": "netflix, youtube work great.  need hbogo, etc.chromecast beta streaming tabs...performance is not acceptable.  Once these shortcomings are ironed out, chromecast will rule the world!", "verified": true, "helpfulness": "0/0", "author": "Nelson K. Bond"}, {"rating": 4.0, "review": "Installation is an easy, short process.  Using the iPad or smartphone to control Netflix selection and volume makes a simplication on number of remote controls laying around.  Light weight to carry around on travel - like a memory stick.", "verified": true, "helpfulness": "0/0", "author": "Roberto"}]