[{"rating": 5.0, "review": "It is AWESOME!!! I'm addicted :)", "verified": true, "helpfulness": "0/0", "author": "nancy gregson"}, {"rating": 5.0, "review": "Simple setup, easy to operate and fast performance the Fire TV delivers everything it claims. If I could use my apple devices with it to display my screens it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "John A. Bantz"}, {"rating": 4.0, "review": "This is a very good product for the money.  It is very easy to install and you can watch the entertainment provided in 10min or less.I would like to be able to pick from the genre on the movies and TV selections like action adventure or comedy rather that just movies and TV recent and new. I do like that Prime is clearly marked, As some of them are not offered without having to pay more money. Over all this is a good product and I would recommend it to my friends", "verified": true, "helpfulness": "0/1", "author": "Garnet1"}, {"rating": 5.0, "review": "I was really exited that so many of my favorites in one place.I suggest that some sport packages like Nbc extra or fox be included", "verified": true, "helpfulness": "0/1", "author": "Simon Gift Card \"ABIY TEZAZU\""}, {"rating": 5.0, "review": "Loved it so much I bought a second one for my bedroom.", "verified": true, "helpfulness": "1/2", "author": "Jeremy"}, {"rating": 5.0, "review": "Easy setup, no lag when stream videos. A little bit expensive but worth it.", "verified": true, "helpfulness": "1/2", "author": "Letian Wang"}, {"rating": 5.0, "review": "ROKU is out, Amazon Fire TV is in! No more intermittent or stalled play. Problem never was my WiFi system and I knew it!! I should have known when I first went streaming TV that Amazon would be king!", "verified": true, "helpfulness": "1/2", "author": "Bee Keeper \"Original Audible member since before the Amazon buyout, and that is ok with me. I enjoy all things Amazon. Audio books make the day fly by.\""}, {"rating": 5.0, "review": "This is the most under-reported TV device available to the public.  easy to operate and the selection of movies, TV shows, and applications is hard to believe.  and when you consider the low price; I could not be happier with my selection.", "verified": true, "helpfulness": "1/2", "author": "Michael Stephens CEO"}, {"rating": 3.0, "review": "It's ok. I like all the apps you can use with it but I was a little disappointed with the selection t h at comes free with prime and the fact that you can't categorize by what's free.", "verified": false, "helpfulness": "1/2", "author": "alexandra leigh monaco"}, {"rating": 2.0, "review": "I received this for a gift and was excited to use it.  I thought I could see movies for free but that is not the case.  You have to be a member of Prime for free movies.  Basically I have used it twice and am very disappointed.", "verified": true, "helpfulness": "1/5", "author": "John Scalogna"}]