[{"rating": 2.0, "review": "At this time, I can't recommend Chromecast to other buyers.Chromecast is not ready for prime time. It works well for what it does, but doesn't do much.  You have to subscribe to premium services or buy content to use it.  Your only free choices are casting YouTube or a Chrome tab.  But Chrome tab content casting only works on laptops and desktops.  It does not integrate with Chrome for Android!!!  If you want to buy it to use with your Android smart phone --- DON'T because for the most part, you won't!  You can't cast any of the pictures or videos you took unless you upload them to YouTube first.  Wait until there are many 3rd party apps available that actually work.  Or maybe wait until Chrome for Android is able to cast.  That will give you some minimal functionality that's reasonably convenient.  Otherwise, you will have to set your laptop up in your TV room.Some have dubbed Chromecast the \"Chromecasket.\"  That's a good name.", "verified": true, "helpfulness": "0/0", "author": "Stan \"Tells it like it is.\""}, {"rating": 3.0, "review": "it jumps of quite frequently. and I'm only 5 feet away from the device. Luckily i don't use it very often, probably about 5 times out of the week.", "verified": true, "helpfulness": "0/0", "author": "adrian"}, {"rating": 5.0, "review": "Excellent product. Ease of use. If you're looking for easy setup, no hassle, this is the product for you, I bought product because I wanted to watch Neflix  ON MY  TV without transporting my WII AND XBOX from room to room in my home. This prouduct went beyond my expectations.  I love it !!!", "verified": true, "helpfulness": "0/0", "author": "Vicki Wood"}, {"rating": 5.0, "review": "One of the best devices I've ever purchased and I use it all the time. From casting my Chrome Browser over to the TV to MP4 files on my local system. Super Easy to set up as well.....", "verified": true, "helpfulness": "0/0", "author": "Jason M Bodi"}, {"rating": 5.0, "review": "Works great right out of the box.  Easy to install. Working for me within a few minutes of receiving the delivery. No problems so far.", "verified": true, "helpfulness": "0/0", "author": "Dr. Gerald F. Snelson"}, {"rating": 2.0, "review": "It is extreamly limited, performance was not bad, it needs to have capibilities expanded to become useful.  Google Chrome is much better than this and I am suprised they released this item way to early.", "verified": true, "helpfulness": "0/0", "author": "Jesse Goens"}, {"rating": 1.0, "review": "Really buggy product! I can't get it to play sound from my computer. It seems to work ok from an iphone 5S.I bought this as an easy to store Apple TV, it is not close. Real Crap!!!!", "verified": true, "helpfulness": "0/0", "author": "Steven F. De Mar \"IPhoneguy\""}, {"rating": 3.0, "review": "It has potential, but is too limited at this time for what you can stream. It only supports a single window at a time to cast. As more and more apps are supported, it will be a go-to device. Right now, it does pretty much the same thing as my DVD player.", "verified": true, "helpfulness": "1/1", "author": "Steve Marlin"}, {"rating": 5.0, "review": "Great product, excellent delivery time.  Easily installed, video quality is first rate.  There needs to be an interface with the disc drive  on a computer, but I understand that will come in time.", "verified": true, "helpfulness": "0/0", "author": "Young Brothers General Merchandise"}, {"rating": 2.0, "review": "I couldn't connect to one system in one of my homes (Even Google help couldn't assist me) and tried it on another house in another state.  It worked on the second system but kept freezing.  Not worth it until they get the bugs out", "verified": true, "helpfulness": "1/1", "author": "Frank Towers \"bronxguy\""}]