[{"rating": 5.0, "review": "The Chromecast allows me to view any web content on my 47\" TV with no wires,I can control it from my laptop,tablet and smartphone.The price and wireless makes it a no brainer.There are many products to stream web content to TV,but they are bulky,not as dependable and priced well over $100.00.I even cancelled cable because I can send any show to my TV with this and control it via multiple devices FREE.I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Sweeperguy"}, {"rating": 5.0, "review": "I bought this to stream HBO GO from my tablet to my television. It does that very well. I was afraid the TV was too far from the router to get a good signal. The Chromecast works flawlessly -- never rebuffers or stutters. The viewing experience is quite good quality. You do have to plug in the power or USB to power the device. That makes it slightly less portable than it looks, however I switch it between televisions quite regularly with little effort. It's limited in what is supported at the moment. I'm banking that will change as it catches on. Currently you cannot cast a Google Chrome browser tab from an Android tablet. That seems strange to me, but it is the case. Casting from your PC performance depends on how fast your PC is.", "verified": true, "helpfulness": "0/0", "author": "Brian \"Brian\""}, {"rating": 5.0, "review": "Gave this to my husband for Christmas.  He uses it all the time to show off his stuff on facebook from his laptop onto the big screen TV set.  The teenagers are also able to show their stuff from their mobile devices onto the TV set as well.  And it is all done wireless!", "verified": true, "helpfulness": "0/0", "author": "toobusyworking"}, {"rating": 4.0, "review": "no clear directions to activate netflix, in fact the road to netflix was horrendous until i connected with a netflix tech.", "verified": true, "helpfulness": "0/0", "author": "Charlie Bennetts"}, {"rating": 1.0, "review": "Google \"No cast device found\" and you will see this is a huge problem It stinks and I am returning this POS.", "verified": true, "helpfulness": "0/2", "author": "SunnyDay"}, {"rating": 4.0, "review": "i forgot to write a review for this back when i got it, so lets go ahead and do that nowthis device is a wonderful cheap piece of equipment, when i first got it all it can really do is use youtube and netflix, but since the sdk for it has been released there has been some great apps and usecases for this.. unless the file is actually on ur device it is not streaming from it so that saves battery powerknocked off one star due to there isnt many supporting codecs, though i assume that has to do with the price anyways..when local playback is necessary i use the allcast app, but as said before codecs, it will have to be for full support an mp4 file.. there is some luck with mkv and koush with his allcast app is working hard on coming up with ways for more supportrealplayer cloud is a good idea too since with that u can upload a file, it converts it from the cloud and playback from the cloudlastly im thinking of grabbing another one for my stereo, so obviously audio only, and i will talk more about that when that is doneEDIT: Got another one for my stereo, using an adapter.. very useful!", "verified": true, "helpfulness": "0/0", "author": "Sean Donovan"}, {"rating": 5.0, "review": "This was easy to install and works great for playing You Tube from our phone or tablet onto the TV.", "verified": true, "helpfulness": "0/0", "author": "Todd Burns"}, {"rating": 4.0, "review": "We have enjoyed using our Chromecast. It's worth the money. The problem that we have is that it doesn't play well with Amazon streaming video. It will only stream in a minimized screen with sound. Maximize the screen and the sound goes away.It doesn't work at all with any videos we have through iTunes. I understand that is more likely because of Apple than Google. After all, they don't want the Apple TV replaced, right?We do like the ability to stream directly from our web browser for most other sites, in that it performs it's function well, which is the entire reason I purchased this as a gift for my husband.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this!  It is so easy to set up and so easy to use!  I saw it in an article about best new \"things\" and thought  \"Why not!\".  I have been recommending this to everyone.  It is wonderful!", "verified": true, "helpfulness": "0/0", "author": "Nan"}, {"rating": 4.0, "review": "It just doesn't support enough apps, it supports YouTube, I can watch music videos on my TV, and it supports Netflixs but I don't subscribe to Netflixs. So other then using it for YouTube music videos I don't know what else to use it for. I was hoping to watch tv programs that I missed, but until more apps are supported this won't happen.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Paul"}]