[{"rating": 1.0, "review": "My Chromecaset will connect to my WIFI, but not to the Internet.  I am researching router settings to overcome this, but so far without success.", "verified": true, "helpfulness": "0/0", "author": "Robert Moody"}, {"rating": 4.0, "review": "The Google Chromecast device is growing on me. I bought this with the hopes I would be able to play my android games on the T.V. I was disappointed and to be honest, I am still not clear on why this is not a feature with this device or why it connects to both my phone and tablet when I start streaming from one device. But what I am loving about this is the streaming of Google Play Music, BeyondPod Podcast, and Netflix to my bedroom television. The PS4 is in the living room and is my primary source of Netflix. But now I can watch it in my room. I will continue to use this device.", "verified": true, "helpfulness": "0/0", "author": "Murdic3k"}, {"rating": 5.0, "review": "This thing is blazingly fast! It I easy to set up and very easy to use from your cell. It actually works faster than smart TV apps.", "verified": true, "helpfulness": "0/0", "author": "Abraham Perez"}, {"rating": 5.0, "review": "Great product you can watch Netflix in your TV while controlling it from your I- Phone. Best $35 ever spent.", "verified": true, "helpfulness": "0/0", "author": "Daniel V."}, {"rating": 5.0, "review": "Chrome was insanely easy to setup and allows me to stream 1080p movies from all sources. It also allows me to control it with just my smart phone.  Other similar products don't have IR support or a solution that does not involve a wireless keyboard/mouse. Highly  recommended for everyone!", "verified": true, "helpfulness": "0/0", "author": "G. Choy"}, {"rating": 5.0, "review": "So worth the money people!  It's like I never lost cable service. I use netflix and hulu and crackle which the last of is free it keeps me in more entertainment than I can watch and movies too so you can't lose, do it!", "verified": true, "helpfulness": "0/0", "author": "Rudy R. Reyes"}, {"rating": 4.0, "review": "its as expected", "verified": true, "helpfulness": "0/0", "author": "kutaiba"}, {"rating": 5.0, "review": "Bought this for my mom, (and for me as well!) this thing is pretty nifty, We dont have any devise downstairs that we can stream netflix on our bigscreen tv, so this solved our problem. Great buy", "verified": true, "helpfulness": "0/0", "author": "Daniel ravelero"}, {"rating": 1.0, "review": "I bought this back in February to give as a gift for graduation, so it was not used for the first time until very recently. Unfortunately, it turns out that the Chromecast does not work at all, and when it is plugged in, there is no menu that appears but instead, a black bar shows up on screen (we have used a Chromecast before, so we know how it should work). Since it was purchased awhile ago, it is no longer eligible to be returned or exchanged, so now I just have a product that does nothing. Maybe I just got a defective product, but it's unfortunate that there is no warranty on it.", "verified": true, "helpfulness": "0/0", "author": "Madeline"}, {"rating": 5.0, "review": "It works just great! The best entertainment device / media streamer at its finest.You get a ton of streaming options, far more than you can watch, at a very small price.Best option at the moment, as it is the only one to allow streaming content from Google Play sources (Movies, Music etc.).", "verified": true, "helpfulness": "0/0", "author": "Cristian Teodoridis"}]