[{"rating": 5.0, "review": "Easy setup, now all my iPads and PCs can stream to the TV. Plus there is a mirroring option in the PC chrome extension that makes it easy to mirror your PC screens to TV wirelessly. Meaning now you can do presentations and such! Powerpoints works! No more cabling. :)", "verified": true, "helpfulness": "2/3", "author": "Johnny Wu"}, {"rating": 5.0, "review": "Got it in 2 days - AWESOME product!!! Nice work...worth the extra fee rather than waiting...have I said it's AWESOME!?!", "verified": true, "helpfulness": "0/0", "author": "Jon Silber"}, {"rating": 5.0, "review": "We purchased the chromecast the week it was released. It was simple, came with the device and a power cord. Was surprisingly easy to setup and use. We have used it on multiple televisions, including in hotels where it's often difficulty to find things to watch.Iniitally,I had concerns about the quality if the video since I was running it through the Netflix on iPhone 5. I decided for the price it was well worth a try. Amazingly good quality video. Iuse it through iphone, ipad, and android phone. I have been able to watch through my iPad shows  often blocked for video out (SHO, HBO, TBS, NBC) through the in screen Chrome feature with little to no complications.This is an excellent buy, and turns any tv with HDMI input into a smart TV. I would definitely recommend purchasing, and even purchased an additional device to permanently use in the kids room.", "verified": false, "helpfulness": "1/2", "author": "Krista Schaefer"}, {"rating": 1.0, "review": "I was skeptical that I'd find the Chromecast very useful, but for $35, I thought it was worth a try. It took over a month for my order to finally ship, and now that it is here and I've had a chance to use it, I can give a confident review:It sucks.On the upside, the packaging is nice. Installation and configuration was relatively quick and easy, but that's about all that is good about it.I tried casting a browser tab, just some HTML and images, no video, and the lag until it actually displayed on the TV was multiple seconds. When I scroll the page, the casted version is similarly slow to respond, if it responds at all. More than once it dropped back to the splash screen for no obvious reason.Google's Chromecast page boasts of a growing number of apps that support Chromecast, but they only list four, the same four that they've had from the beginning.Bottom line, this is like a cheaper, much less useful version of the AppleTV for Android and Chrome users that doesn't work as well.", "verified": true, "helpfulness": "4/14", "author": "Erik S"}, {"rating": 5.0, "review": "Being a rugby addict I love the chromecast - it allows me to catch up on games not broadcast on free to air tv.It was relatively easy to set up - took a bit of mucking around but once away it is going no problems!", "verified": true, "helpfulness": "0/0", "author": "GLAJMA"}, {"rating": 4.0, "review": "These sold quick and it was hard to get one.  It is a great device for the price paid for it.  However, it often seems limited, but still something to have.", "verified": true, "helpfulness": "0/1", "author": "Alec"}, {"rating": 4.0, "review": "This is my second streaming device that I have tried and this one is not too bad. It works with my laptop, my android phone and android tablet without any problems. I use it for Netflix movies, I tried to stream from internet sites that have videos and some worked and some did not. I tried to watch The Big Bang Theory on the CBS site but for some reason the quality from laptop to TV was bad and the voice was delayed. My android tablet is a Coby so it does not allow the chromecast app, but no problem there is another app that works very well called aircast. All in all, with hopes for futures enhancements very much worth the $35.", "verified": false, "helpfulness": "0/0", "author": "Texas Greg"}, {"rating": 4.0, "review": "The purpose of this dongle is to stream videos, YouTube, music and more to your TV while you can use your PC, smartphone or tablet as the controller. The hardware that comes with Chromecast is outstanding and to install it was fast and easy. I installed it on my Samsung 60 inch LCD TV and I used my iPad 3 to do it.What's in the Box?* A HDMI to HDMI short extension cable to help plug in the Chromecast dongle into tight places* The Chromecast dongle* The AC wall power supply (I didn't use this as I powered the Chromecast dongle with the included USB cable and plugged it into my TV's USB port to hide the wiring.)* The USB power cable that is 60 inches long.* A brief set of instructionsThis is an excellent product and the installation and set up only took a few minutes. I have a Roku and I thought that the set up was faster and easier than setting up the Roku. The Chrome hardware is excellent quality and the pricing is very good. The Chrome product sells for $35, the Apple TV box sells for $99 and the Roku sells for $49.99 to $99.99 depending on the model that you are buying. Just this week Google released the Chromecast App on the iTunes store to allow you to more easily interface with this product using your Apple iPhone or iPad.To install the device on my TV I plugged in the Chromecast Dongle into an open HDMI port on the TV, plugged in the Micro USB cable into the dongle, and plugged the USB end of the cable into the TV's USB port. I then switched the TV source to show the Chromecast device. The TV screen said Set ME Up and I simply followed the instructions. Within a minute I could stream YouTube, Netflix and Google Play to my TV and I used my iPad as the controller. The transmission of the video was done quickly and the quality of the video was excellent and when the item I was looking at was HD quality the picture was perfect without any glitches or scrambled video.As far as the hardware goes I give the product a 5 star review. It is an excellent concept and it is priced properly. Now the issues regarding video content. You have Apple, Amazon and Google fighting over the ability to stream video and other entertainment items to your TV. You can also throw in Roku as it has the ability to steam many different entertainment media app sources including Amazon Prime and Netflix. Google is behind in the game in providing a lot of content. In addition the Roku and the Apple TV comes with a wireless remote control while Chromecast will use your smart Android or Apple tablet or smartphone. (I hope my battery hold up trying to control my TV.)Once someone has the hardware and is signed up with a video streaming service/system, what is the motivation to change?* Ease of use* Better entertainment content* Lower prices for video content* The ability to stream local TV in HD* The ability to watch your favorite sports events.* Lower prices for hardwareChromecast's weakness it that right now it can only really provide content from Netflix, YouTube and Google. Meanwhile the Roku and Apple systems have a much broader base of entertainment apps and systems to stream from. Right now Amazon and Apple have not shared entertainment apps with Chromecast and this is a major issue for the future of the product. Where and how will Google get more movies, TV shows, news, and sports casts to support their system?While I love the hardware and rate it as a 5 star product the depth of the entertainment available is a 3 star or slightly below. Chromecast has to convince more people to buy into the system and provide a better deal to get more subscribers to their system. There is a lot of innovation in the Chromecast system and perhaps we will see more changes in the streaming entertainment business as it seems to be a major money maker and perhaps an end to the dominance of the cable TV suppliers. We can only hope. I personally am tired of the cable suppliers and their local monopoly and hope that a suitable replacement will be ready soon. Whoever gets the best entertainment in movies, local and national TV and sports will win this battle.Overall the product is at best a four until more apps are available on Chromecast to make it a more enticing option to select for your entertainment.I received a sample product for evaluation and I promised to provide a fair and honest review.", "verified": false, "helpfulness": "0/0", "author": "JJCEO"}, {"rating": 5.0, "review": "Got this little tool from amazon. shipping took couple of weeks. well worth the time.this device is amazing. from one side it operates like roku, apple tv, etc. it is a streaming device.amazing thing about this little gadget is that you can stream from your laptop chrome browser straight to your hdtv.roku and other devices only allow you to use one of their apps to stream.this device allows you to stream anything using either neflix and other supported apps or google chrome web browser via available plugin.i download movies from the web and open them with chrome web browser and cast this video to my hdtv.Amazing!", "verified": true, "helpfulness": "1/2", "author": "JosefGasim \"JosefGasim\""}, {"rating": 1.0, "review": "After 3 days trying to return this device, I have had 3 e-mails they are consulting their own staff about my return. This device did not work with my Apple Airport Express and the troubleshooting guide was zero help. Only after I decided to return the item, did I actually get a PHONE number to call for help from Google. Too late for me, I'm moving on to Apple TV. Still waiting on how to return this for a refund.I sure wished I had bought this through Amazon, as this review would have never happened. Beware of returning the Chromecast. Followed their instructions to the letter, no refund twenty days after it was received at their Fremont, ca location,  no response to any e- mails. RIP OFF", "verified": false, "helpfulness": "3/13", "author": "Frank"}]