[{"rating": 5.0, "review": "Great investment!  Now we can watch Netflix AND Amazon on our 60\" LED TV.  Easy setup and voice search works great.", "verified": true, "helpfulness": "0/0", "author": "John C. Mills"}, {"rating": 1.0, "review": "Huge disappointment. Wish we could send it back and get our money back. Seems that in order to get anything you have to spend more. Do not know what the $99.00 was for. Bought an antena and get more and are not nickeled and dimed to death.", "verified": true, "helpfulness": "0/3", "author": "John P. Hehn"}, {"rating": 5.0, "review": "The fire TV easily met my expectations.  A very useful device.", "verified": true, "helpfulness": "0/0", "author": "Gary  Steven Sammelmann"}, {"rating": 5.0, "review": "what a great way to save money on cable TV....it takes some getting used to streaming tv but with buying this i can save $800 a year!No regrets , just have to work with it some and learn more about it.", "verified": true, "helpfulness": "0/0", "author": "Rebecca McCord"}, {"rating": 5.0, "review": "I am very pleased with my Fire TV. I'm not into gaming or anything complicated, we just use it mostly for renting movies on Amazon, watching our Prime shows, or viewing Netflix and Hulu Plus.The box is tiny, the remote is simple and easy to use, and I really enjoy having all my Amazon music available to listen to with a click of the remote. The interface is very fluid, the menus are tidy and pleasing to look at, and so far, I've had no problems with navigation or streaming. (It has frozen one time in three months, but once it was restarted, it was fine.) I also like the voice search option on the remote, but I wish it worked for Netflix, Hulu, and other apps instead of just the Amazon selections. It's also nice that a nature slideshow pops up when the TV has been sitting idle for too long. Overall, I find Fire TV a pleasure to use and would recommend it to anyone who enjoys simplicity and reliability because that's what it has offered us.", "verified": true, "helpfulness": "1/1", "author": "SouthPaw"}, {"rating": 3.0, "review": "Got this mostly for Plex. It just wont play smoothly. Stutters and skips all the way though. Doesn't matter how large or small the file is. Unit is hard wired Cat6.", "verified": true, "helpfulness": "0/0", "author": "Dimitri C."}, {"rating": 4.0, "review": "As good as it's name \"FIRE TV\"", "verified": true, "helpfulness": "0/0", "author": "Ampofo Bediako"}, {"rating": 5.0, "review": "It's way better than any streaming devise I have ever used , love it", "verified": true, "helpfulness": "0/0", "author": "rafee fatoohi"}, {"rating": 5.0, "review": "Awesome present.", "verified": true, "helpfulness": "0/0", "author": "A.R.Alvelo"}, {"rating": 5.0, "review": "I own 3 fire tv boxes now and it really is a great product. Keep the content coming and goodbye cable tv!", "verified": true, "helpfulness": "1/1", "author": "Ralph"}]