[{"rating": 5.0, "review": "I'll get to my review of the Chromecast in a minute, but first, I want to describe a Chromecast issue that I *just* experienced, and share how I resolved it:After several months of working *flawlessly*, both of the Chromecasts in my house completely stopped working. When I say \"stopped working\", I mean that they were displaying the photo slideshow on screen as usual, but none of the devices in my house could \"find\" either Chromecast on the WiFi network.  When I tried resetting both, and then configuring each from scratch, I wasn't able to complete the setup process. I was baffled, so I turned to Google's support forums.The answer? RESET YOUR WIRELESS ROUTER. (In my case, this meant unplugging it for about 30 seconds or so, and then plugging it back in.) As soon as I did that? *BOOM* Problem fixed. All of my devices now recognize both Chromecasts!I'm still not sure if the issue was the result of a Chromecast update or a router update (pushed out by my ISP), but resetting it by cutting the power for a few seconds completely fixed the issue. So, if you're having similar issues, maybe try that first.------------------------------------------------------------------------------------------------------------Alright, so here's my Chromecast REVIEW, which I'll gear toward total BEGINNERS:---So what is this thing?---The Chromecast is a USB dongle - created by Google - that plugs into the back of your TV.  Its purpose is to allow audio or video content (TV shows, music, movies, YouTube videos, lectures, etc.) to be streamed via your wireless Internet connection (wifi), from the Internet, into the Chromecast. The Chromecast then displays the content via your TV and/or its speakers.---How do you control it? Does it come with a remote?---Nope. There's no remote. Basically, what you do is this: You navigate to the thing you want to watch or listen to using a device in your house (usually a device that's on the same wireless network as the Chromecast).  So, for example:* You might browse to a YouTube video using the YouTube app on your smartphone.  Then, if you want to watch that video on your TV, you tap a little icon in your YouTube app, and the phone then hands the video off to the Chromecast, which proceeds to start showing the same YouTube video on the screen. If you want to pause, fast-forward, or rewind the video as it's playing on the TV, you use controls which will appear on your smartphone.  Another example:* Let's say you normally watch a particular show on Hulu Plus or Netflix right on your laptop, but you'd rather watch it on the TV. To do this, you'd start the video on your laptop like usual, and then - when you want to watch it on your TV - you'd click a little Chromecast icon on your monitor, which will hand off the show to the Chromecast, which will then cause the show to appear on your TV. Again, if you want to pause, fast-forward, or rewind the video, while it's playing on the TV, you'd use the controls that would appear on-screen on your laptop.---So hold on... I need another device to control the Chromecast?---Yup. To control the content that you display on the Chromecast, you'd need a wifi-enabled laptop, smartphone, or tablet. Preferably, your laptop, smartphone, or tablet would be connected to the same wifi network as your Chromecast (your home wifi / wireless internet connection, for instance).---What kind of stuff can I watch?---Lots. Apparently, it's pretty easy for a software developer to add Chromecast compatibility (which is what adds the little Chromecast icon I talked about above) to their application, so lots of things are Chromecast-compatible.  Unfortunately, Amazon Prime video streaming isn't yet, but Netflix, Hulu Plus, HBO Go, YouTube, Pandora, and a bunch more are all already compatible.  This means that if you have a device that can play any of those things natively (on the device itself), then you can probably use that device to \"cast\" (i.e. hand things off to) the Chromecast, and watch / listen to that content via your TV... provided you have a Chromecast plugged into the back of it.  So yeah... Google maintains a list of all of the services that are compatible, so I suggest checking to see if your preferred services are supported.(Link: https://www.google.com/chrome/devices/chromecast/apps.html )---So how does this thing compare to the Roku or Fire TV?---The Roku (including the Roku Streaming Stick) and Fire TV (including the Fire TV Stick ) can do many of the same things as the Chromecast, but in reality - because they don't require the use of external devices - and because they come with their own remotes - the Roku and Fire TV really are different animals. In some regards, they are better than the Chromecast, but in some regards, the Chromecast is better.How the Chromecast is better:* PRICE - Obviously, the Chromecast is one of the cheapest - if not THE cheapest options, so that's a huge advantage of the Chromecast.* PORTABILITY - If you wanted, you could easily unplug the Chromecast and bring it with you to a vacation house or a relative's house (assuming said house has wireless internet), and it would almost be plug and play.* EASY SHARING - Let's say you're sitting in a living room, and you find a YouTube video on your laptop, and want to show your spouse / kids / sibling / friend. With the Chromecast, you can just send that content directly to the TV, without having to look it up (i.e. browse for the video again) via a separate app. Oh... and did I mention that this also works with websites?  That's right - if you're using the Google Chrome browser on your computer, you can \"cast\" a web browser tab right to the TV. This is perfect for those \"Oh! Let me show you this article\" moments.How the Roku or Fire TV are better:* CONTROLS - As described above, the Chromecast requires you to use one of your existing devices - your smartphone, tablet, or computer - as the \"remote\" for the Chromecast. In contrast, the Roku and Fire TV have their own remotes, which many people will prefer - especially in situations where a smartphone, tablet, etc. are unavailable.* LEAN BACK EXPERIENCE - This one is a bit more difficult to describe - and is kind of tied to the \"controls\" item above, so bear with me here. In addition to having their own dedicated remotes, the Roku and Fire TV just feel a bit more immersive. In other words, because you can just set your phone / laptop / tablet aside while you watch (because you don't need to use it to control the show / movie / music / whatever), you might find consuming content via the Roku or Fire TV a bit less complex. Both the Roku and Fire TV have pretty decent interfaces, so both make browsing for content and navigating from app to app pretty easy, compared to the experience of controlling content via a second screen (e.g. YouTube app on your smartphone).", "verified": true, "helpfulness": "17/17", "author": "Hey Vin"}, {"rating": 5.0, "review": "love my Chromecast. Apps work very well including the content streaming apps. I play HD video over my network perfectly. After having this for over a year I finally had a (minor) problem. I was using the HDMI extendor and was periodically getting a snowy screen and would need to hard reboot the Chromecast. The work around was to ditch the extend or cable and plug directly into the t.v.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Tiesha Corbin"}, {"rating": 5.0, "review": "I have 2 chromecasts  and I love them!  They stream easily and the quality is beautiful. Can't beat them for the price!", "verified": true, "helpfulness": "0/0", "author": "Floridareviewgirl"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Andy Goldberg"}, {"rating": 5.0, "review": "Great for streaming YouTube or other Chromecast-friendly apps with Chromecast.  Screencast will not stream video.  I've also looked for an app that will stream your own videos and can;t find one that actually streams smoothly without buffering.", "verified": true, "helpfulness": "0/0", "author": "Jeff \"gramgeek\""}, {"rating": 5.0, "review": "Excellent! Easy to set up,  and works great!", "verified": true, "helpfulness": "0/0", "author": "Karene V Beavers"}, {"rating": 5.0, "review": "It all started when I wanted to watch Mad Men in my bedroom but we can only get Netflix on the family room television. I don't know how it works but my husband set it up and I am delighted to watch any movie or tv show in my room in peace and quiet. I'm very happy!", "verified": true, "helpfulness": "0/0", "author": "Maggie Spence \"Maggie\""}, {"rating": 5.0, "review": "Chromecast is wonderful", "verified": true, "helpfulness": "0/0", "author": "Paula Robertson"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "jose ortiz"}]