[{"rating": 2.0, "review": "I was excited to get the Fire TV, but was severely disappointed. First I will say what is good about it. The user interface works extremely well. It was very smooth without hang ups or glitches. It's obvious Amazon put a lot of work into it. The voice interface is exceptional. I find it hard to believe how well the unit works. Now for the bad. There is no way to officially install a web browser on the device. I know a lot about android devices having two other TV PCs, an android phone, and a tablet. I could easily root the device and install what I want. But I choose not to put that much work into it and want to keep everything official.I watch TV by using sidereel.com to keep up with shows. Clicking a link there launces Hulu, Netflix, Amazon Instant Video, CBS, etc., then the video will play within whichever app. Since no web browser is available, I can't go to sidereel.com to manage my shows and launch them.A limited number of apps are available in the Amazon App Store for the Fire TV. The hardware has sufficient power to do anything. I know, because I have two android TV PCs. It is unfortunate Amazon choose to restrict the device in this way.", "verified": true, "helpfulness": "0/1", "author": "David G. McDivitt \"dgm\""}, {"rating": 5.0, "review": "Works great!  Voice recognition app is very handy!", "verified": true, "helpfulness": "0/0", "author": "James M. Krall"}, {"rating": 3.0, "review": "The product is great. BUT HBO GO DOES NOT WORK WITH XFINITY ON AMAZON FIRE TV. I bought this specifically because they announced it had HBO Go. Xfinity is not supported which I did not realize. It is on Roku and Apple TV, I checked.", "verified": true, "helpfulness": "0/0", "author": "lmd4990"}, {"rating": 3.0, "review": "I couldn't decide between a 3 and 4 stars.  Ultimately, I ended up with a 3.  I have a Roku 3 also, and I have to say I like it much better.  The Fire TV constantly \"loses\" my Netflix credentials and I have to keep signing in over and over.  It gets old.  Also, I don't like that the voice search ONLY searches Amazon content and you can't use it in Netflix, Hulu, etc.  Also, the Roku has a feature on the home screen to search and it will search across all of your apps.  I still use the Fire TV a lot as I have the two devises in different rooms.  The Fire TV is in my bedroom, so I use it at night before bed.  I sort of wish I'd gotten a 2nd Roku, but in the long run, I do get use out of the Fire TV.  It's not bad, just not great.", "verified": true, "helpfulness": "0/0", "author": "MamaC"}, {"rating": 5.0, "review": "I'm surprised at how much we use this instead of flipping channels and getting depressed by the news!  I was surprised by how many movies are on Amazon.  I have also enjoyed some of the series.  We chose Fire TV because we do not use a cable provider, we have just used an antenna for several years now. With that being said, I'm sure someone who has 300 channels may not appreciate this as much as we do.  (I still miss having HGTV!)", "verified": true, "helpfulness": "1/1", "author": "Deb \"Travlingirl\""}, {"rating": 5.0, "review": "Excellent for android gaming, music and video for any prime member.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer \"Gamer\""}, {"rating": 2.0, "review": "So far, not as good as ruku", "verified": true, "helpfulness": "0/2", "author": "gracie"}, {"rating": 4.0, "review": "This is part review and part question. Review, easiest tech gadget I've bought to set up, just like it says, nice simple remote, voice search WORKS!So I have Prime membership and the FireTV and I get cable/wifi with ATT Uverse.So what do I have to pay EXTRA for with Prime? New releases? HBO? Showtime? HD versions of content? What specifically & how much?Can/should I go to a lower level of Uverse? I don't want to pay 2x for the same shows.Anyone who has had it for a while know? I just set it up today.", "verified": true, "helpfulness": "0/1", "author": "froggy47 \"froggy47\""}, {"rating": 3.0, "review": "Impressive packaging (almost as nice as Apple), very easy set-up, voice control remote works flawless. That's all the good....as far as the bad; extremely poor user interface, and very confusing offering. As a Prime Customer I could be ignorant enough to think that all listed Prime-Movies are available for viewing. No such thing, 75% of the movies in the Prime-Movies section is NOT available for viewing (add to watch list).I know Amazon could do a LOT better with the user interface, managing world's best e-commerce site.Happy I bought it with the Xmas $20 discount.", "verified": true, "helpfulness": "0/0", "author": "D. Post \"DPOST\""}, {"rating": 4.0, "review": "Amazon Fire TV is great! not only do I get prime, netflix, TV shows, movies and more. I also get flixster so now I can watch my own movies. The only thing is you must buy a HDMI cable. The set up was very easy with in a few minutes I was watching a movie.", "verified": true, "helpfulness": "0/0", "author": "AuntieL"}]