[{"rating": 5.0, "review": "This was a gift for my husband.  My husband and son both have a blast playing things from there phones on the big screen. It is a smash at our house.", "verified": true, "helpfulness": "0/0", "author": "Rena"}, {"rating": 5.0, "review": "This is probably the best $35 I've spent on a media device. If you're like me and opt-out when it comes to smart-tv's, then this thing is a must have! Really impressed and can't wait as more and more apps and features are added every few months.", "verified": true, "helpfulness": "0/0", "author": "RenegadeJr"}, {"rating": 5.0, "review": "Had never heard of such a thing but when our son told us what it did,I bought one for all the families on my list.We all are really enjoying everything it does for us. Especially streaming to the large screen for movies so all can see.", "verified": true, "helpfulness": "0/0", "author": "Debhill"}, {"rating": 5.0, "review": "Have one for myself and loved it so much I bought another as a gift for my family makes things easier when you have access to all your shows on the go we take it with us when we travel since we have two children we like to keep entertained.", "verified": true, "helpfulness": "0/0", "author": "Britotheknee"}, {"rating": 5.0, "review": "Works right out of the box. Easy to set-up if you follow the directions. Allows you to sit across the room instead of at the end of an RGB or HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "DoggieDebbie"}, {"rating": 5.0, "review": "Works great!  Easy to set up and use.  Using this instead of a cable TV package - a much better option.", "verified": true, "helpfulness": "0/0", "author": "Yella"}, {"rating": 5.0, "review": "Casting movies and shows from your smartphone to the big screen tv is so cool.I did have issues finding the device via my laptop, but I believe that is an issue on the computer and nothing wrong with the device itself. It always works from my phone.", "verified": true, "helpfulness": "0/0", "author": "Melvin Sebastian \"MSebastian\""}, {"rating": 4.0, "review": "I haven't ran into any real problems to date.  So I do not have any more to say about that.", "verified": true, "helpfulness": "0/0", "author": "Tim G."}, {"rating": 5.0, "review": "It was simple to use and easy to install. Once I figured out how to set up the tv, it was smooth sailing", "verified": true, "helpfulness": "0/0", "author": "F. Smith \"BBQ Crazy\""}, {"rating": 5.0, "review": "Chromecast is one of the best products of 2013.  It is very affordable, incredibly easy to setup and use and provides a wealth of services only found on more expensive devices.  Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Ryan OLeary"}]