[{"rating": 5.0, "review": "Possibly the best TV item ever invented! :)Works best if you have a Google device (phone, tablet, etc).  However it's pretty awesome from a PC with Chrome too.", "verified": true, "helpfulness": "0/0", "author": "Sklar"}, {"rating": 5.0, "review": "All ok, the chromecast arrived without problem and it's working well, thanks", "verified": true, "helpfulness": "0/0", "author": "Alexander"}, {"rating": 2.0, "review": "Doesn't work ... Freezes allot. When deside to return was to late. Consider waste of money. Don't use any more.", "verified": true, "helpfulness": "0/0", "author": "Lesya"}, {"rating": 5.0, "review": "Good s***", "verified": true, "helpfulness": "0/0", "author": "brian"}, {"rating": 5.0, "review": "Very cool! Works great!", "verified": true, "helpfulness": "0/0", "author": "budfreak"}, {"rating": 5.0, "review": "The best thing to happen to television since HD, call it exaggerating, but that's what I think. So far, every random App or website that plays videos that I've come across can cast, and as a result, I actually get to use my TV. I love that we are not limited to a set of applications that come pre-installed on the device, and I can control it with my smart phone. I know what I'll be giving out as Christmas presents this year!!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works awesome only thing is that it always needs updates", "verified": true, "helpfulness": "0/0", "author": "Maria Garcia"}, {"rating": 5.0, "review": "This was recommended to me by my landlord and thus far I am loving it. My studio does not have very good reception but I've only an issue with the item twice since the purchase.", "verified": true, "helpfulness": "0/0", "author": "Ludecea Nunis"}, {"rating": 2.0, "review": "I only gave it two stars, because sometimes it works spectacularly, though rarely.It's terribly glichy and not the simplest to use. After a while, my phone/tablet/computer will forget it's controlling my chromecast altogether and it's a process to get everything sorted out. Can't pause, fast foward, etc. An actual remote probably would have solved this problem. Worst of all, after only 4 months of infrequent use, I've had to order (beg for) a replacement because it stopped loading any apps whatsoever. Haven't tested the new one enough to know if it's as glitchy.", "verified": true, "helpfulness": "0/0", "author": "Meghann J."}, {"rating": 5.0, "review": "Have been using it for several months with my Android phone and Plasma TV. Simply love it.", "verified": true, "helpfulness": "0/0", "author": "Ramesh Garg \"Lightbay\""}]