[{"rating": 5.0, "review": "I have a Kindle Fire and I've been a member of Amazon Prime for 2 years. Having this device is awesome! Easy to set up and easy to use. Purchases can be made easily as well. Voice command is fantastic. Amazon is the best!", "verified": true, "helpfulness": "1/1", "author": "STEVE V \"TRAFFIC\""}, {"rating": 3.0, "review": "This is a really neat way to view movies. The down side to it is you have to pay for all the movies and most of them are old viewings.", "verified": true, "helpfulness": "0/2", "author": "Bobbi P."}, {"rating": 3.0, "review": "I purchased as I do use Amazon Prime a lot and the purported technology that improved Amazon Prime streaming appealed to me.I did not see a difference. Plus Amazon has not signed up a lot of other content providers I like.The remove is small and not back lit as many are not these days even though you media room is dark.These \"3rd Party\" streamers are something I really see no use for. My LG TV in my Master Bedroom has it built in and controls all my other components and streaming options (including Amazon Prime) but again the remote is not back lit!My old TV Samsung which is now in the family room runs via a Sony Blue Ray.Me, I put my money into higher technology modems and routers and upgraded speed from my cable provider. Doesn't cost much to get TVs with built in streaming these days. Almost the standard.", "verified": true, "helpfulness": "0/3", "author": "P. Meyer"}, {"rating": 5.0, "review": "I purchased the fire TV for the main tv.  i have it hooked up to my onkyo surround sound, LG 3D TV.  The unit works great, the unit has HDMI, optical hook ups.  It came setup from amazon (which i expected), works great with surround sound, tv setup.  Using it with HD quality shows, Dolby Digital Plus it takes about 5Mbps from my ISP... therefore in order to watch tv and use the internet for other stuff you probably need at least 10Mbps/ but for just the Amazon Fire TV 5 Mbps should be ok (i have tested it a little more and different app have different needs, a few example HULU needed about 3Mbps to stream in HD, HBO go was about the same a little higher maybe 4-5Mbps, Crackle was about 4-5Mbps but Amazon with dobly digital Plus was about 10-14 Mbps i'm not sure why it is so high it is not \"much\"better quality then netflix which was only 7Mbps max).  The unit has ok support from third party, i love the espn app/ and a few others.  one knock is the fact that it is an amazon product they tend to push you to their stuff first (ie amazon prime vs netflix etc) and they amazon prime has a weird way of what is free and what is what you had to pay for ie my daughter love sponge bob show, season one is free, season two you pay for, season three is free etc  I know this is more of an amazon prime problem but still is part of the Fire TV....Pros: works very well, is OK on price (not cheap but not expensive either)Cons: see abovethe real question is would i buy it again?  the long and short answer is yes in a second.... actually im probably buy another one in a few weeks as a gift for my kid.Update 6/2/2014: The unit is working just like it did day one.  I think the use of bandwidth is a bit high for the on part of stream for amazon prime video.  I checked other apps on the ps4 and the bandwidth was much lower for the same movie with same setup and same picture/audio quality.  So basically the amazon box is a bandwidth hog for what reason i'm not sure.  This is not a problem for me since my max bandwith is high enough to not notice the hog but for some this may be a huge problem.  The roku was much lower bandwidth for similar quality so may be better to go with them until broadband speeds increase.  hope the update helps some of you who want to know about the loading of the apps.", "verified": true, "helpfulness": "2/2", "author": "Empiror22"}, {"rating": 4.0, "review": "The reviews were right it was easy to hook up. We did experience  a terrible time getting the remote to connect we even went as far as to buy new batteries when we finally got it to connect it was easy to learn how to use it. this is going to be so much fun and am sure ewe will enjoy . i would have given it 5 stars if not for the battery issue.", "verified": true, "helpfulness": "0/0", "author": "Cindi LeGrand"}, {"rating": 4.0, "review": "So I have a Roku 3 and now the Amazon Fire TV.  I like the interfaces for the Fire TV better than the Roku, but it is lacking on the application side still.  I believe that will not be the case forever.  It has the core group to make the experience entertaining.  The remote does not have a headphone jack like the Roku does.  The games are entertaining for the kids.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Ebersohl"}, {"rating": 3.0, "review": "I like it. The kids love it. I give it a 4 because I personally haven't used it that much yet after 1 month, and I think Amazon will definitely add more features. Then it will be a 5.Update 6/6/2014:After using this for a month, I'm disappointed in how the Prime offerings seem to work. For example, my wife was excited to find the Mystery Science Theater 3000 series available for viewing with our Prime membership. After she watched half a dozen or so episodes, ALL episodes are now pay to view. Not really surprising. For a while I've noticed amazon jacks the price on stuff I want to purchase when shopping on their site if I view it enough times before deciding to purchase. Hoping that the stuff available to prime customers is cyclic so the previously free MST3K movies will be free again sometime. Otherwise I'm sure my wife will insist on me purchasing some of them which is, I'm sure, part of Amazons game plan. As a stock holder, it makes sense business wise, from a customer perspective, it stinks.", "verified": true, "helpfulness": "0/0", "author": "Milt"}, {"rating": 1.0, "review": "OK, this geek cannot get the batteries installed in the remote.  I have weak hands so will someone please tell me what to do?It came today and I have been having trouble with opening the battery compartment.  And they have nothing about it online or in the box.", "verified": true, "helpfulness": "2/11", "author": "S. Williams"}, {"rating": 5.0, "review": "Very well designed.  Helps you get your money's worth from Prime.  Great user interface.  Soon they promised an update so you can search only among movies you get for no additional charge (other than paying your Prime membership).", "verified": true, "helpfulness": "0/0", "author": "PrimeRocks!"}, {"rating": 2.0, "review": "This is my first venture into streaming TV. The  Amazon Fire TV device is easy to use and works well. My intention was to use it for amazon Prime. I thought I researched it we'll before purchasing but, I didn't realize that all of the Amazon Prime information stating it gave you \"access\" to thousands of movies meant you would strictly have access, not free viewing. Most movies ( at least the ones I want to see) are an additional charge, over and above the membership fee. What BS!At least I can use it to join Netflix. At least there are no additional fees there. I will be canceling my free trial membership to Amazon Prime ASAP.I would recommend the Amazon Fire TV as a streaming device. I would recommend against Amazon Prime as a provider of streaming movies, shows, etc.", "verified": true, "helpfulness": "4/8", "author": "Lisa Larson"}]