[{"rating": 5.0, "review": "I have this and the fire stick. I like both for different reasons. If I could only have one, i'd have the Chromecast", "verified": true, "helpfulness": "0/0", "author": "t bird"}, {"rating": 5.0, "review": "Wife and I were surprised to see how much clearer our Netflix picture was than with anything else we used to stream before!", "verified": true, "helpfulness": "0/0", "author": "R. Lange \"Barn Cat\""}, {"rating": 4.0, "review": "It's a powerful device, but have some limitations.The cost x benefits are good.", "verified": true, "helpfulness": "0/0", "author": "Renato Fialho"}, {"rating": 4.0, "review": "Simple love it", "verified": true, "helpfulness": "0/0", "author": "LorettaÃÂ Nedd"}, {"rating": 4.0, "review": "I've owned a Roku and 3 different gaming consoles, which offer similar streaming capabilities. Google Chromecast is by far the easiest to use, and the least expensive option.It's almost perfect, but there's a few things that need to be improved1) Video can sometimes appear a little grainy when compared to the source. It's not terrible, but I noticed it the other day when I was streaming the NCAA tournament from my laptop to the Chromecast.2) More app/browser integrations. Chromecast works perfectly in the Google ecosystem, but if you want to stream something from iTunes or Amazon you're out of luck.I'm hoping the product continues to improve.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Palmer"}, {"rating": 4.0, "review": "It does not work in conjunction with ALL android products. Find this limiting.", "verified": true, "helpfulness": "0/0", "author": "Adrian Lepeltier"}, {"rating": 3.0, "review": "I don't use anywhere near as much as I expected. We often have trouble getting it to start streaming. Once it does, it works as expected. It's just easier to hook up an HDMI cable from TV to computer because we always have to fight with the Chromecast to get it started.", "verified": true, "helpfulness": "1/1", "author": "Amanda"}, {"rating": 5.0, "review": "I have had this for over a year and I love it. I use it to stream movies from anything I want including game apps to my TV. I do this by a app called chrome cast the only thing is it only works with some android phones I use a galaxy s5 active and it works wonderful also used a nexus 4 with it. Any of Google phones such as the nexus line you should be able to do this with. I am not sure what other phones you can do this with it is only 35 dollars so give it a shot I say and if don't work send it back. Yes you need a hdmi port on your TV for this to work as well as a USB port or a plugin close by where you can plug in the micro USB cable to power this at. As well if you don't have a USB port on the TV you will need a convertor that converts USB to 2 prog plug.", "verified": false, "helpfulness": "0/1", "author": "Joshua Tyrell"}, {"rating": 5.0, "review": "Bought it as a stocking stuffer her for my girlfriend on Christmas turned out to be one of her favorite presents", "verified": true, "helpfulness": "0/0", "author": "Leo Lowe"}, {"rating": 1.0, "review": "It is great in theory and for the 2 minutes that it works. It consistently disconnects and  rarely make it through 2 minutes before it disconnects. It is frustrating and so not worth wasting your money on. In fact it really makes me think twice about ordering any streaming devices now.", "verified": false, "helpfulness": "1/1", "author": "Rachel"}]