[{"rating": 2.0, "review": "Update:Using the Chromecast for however long it has been out now, I like it. However, I kind of wish I invested in a good HDMI for my laptop instead.  I never cast YouTube or Netflix from my iPad or my phone, which leaves using it exclusively for my laptop.  I hear the tab-casting is still in beta mode, but I wish it was better. Netflix and YouTube are not the movie/film-viewing sites that I often use, and any other sites would experience delay/lagging/disconnection with the tab casting via the Chrome browser.  I've seen my sister use her phone to cast Netflix onto your family TV and it works superbly (you can even leave the house or your phone can die and it will still play).  The tab casting, I feel, relies on good reliable internet.  If you don't have a good connection, don't have any hopes of watching anything on the TV.  However, even with the best connection (which I have), you WILL experience technical difficulties.  It's still a good product, but there are still major improvements that need to be made.  Not worth the price for where it is, developmentally speaking.//I initially ordered a Chromecast from the Google website and it just came in last night. Although I haven't had it for too long, I'm sure I know of how well or poorly it works.The dongle itself is great, it saves the hassle of having to connect a Thunderbolt to HDMI cable to watch something on the big screen. My TV actually has a USB port, so an external source of power was not necessary. The dongle powers up by itself after the TV is turned on, and the input is selected (depending on where you inserted the Chromecast). I initially had trouble, I couldn't get the set up screen to come up. I only had a black screen with a few white dots at 480p. After going online to learn how to trouble shoot it, it turns out all I needed to do was unplug it, click the reset button a couple of times (to make sure it wasn't jammed), and then plug it back in. The set up was easy. Downloaded and installed Chromecast on all of my devices (both Android and IOS) in no time.For the longest time, I've been using my TV as an external monitor, more for movies than anything. The fact that I am unable to see documents on the big screen (like I ever did that anyways) is tad disheartening, but I got over it. It takes a little while for something to be cast on to the TV, and at times, the connection can fail (I had it happen once so far).  The Youtube app had to be cast and then loaded before what I was watching was on the screen. Having something casted isn't as instantaneous as I had hoped, but I'm willing to work with it.I don't often use Netflix or Amazon for movies. I'm more preferential toward third-party sites for my movies. I was worried that the movies wouldn't cast on my Macbook, but it did. But when it did, I was worried I'd have to watch it small-screen with the Google Chrome browser clearly evident. However, I noticed that after I clicked the full-screen button, the movie expanded on both my Macbook and the TV, but, you can still multi-task due to the multiple desktop function of the Macbook (which is a lifesaver)! Simply swipe to another desktop to start/continue working on something else.I'm still in the process of looking for an extension or app of Google Chrome that would allow me to play music from my Itunes, which would make the Chromecast amazing in all aspects. But so far, my searches have come up empty-handed.For a small, convenient dongle that allows you to cast and watch movies from electronic devices to the big screen, the price is great. A decent Thunderbolt to HDMI cable would cost as much, and wouldn't allow you to connect your devices to the TV. For $35, it's a good buy. I'm hoping that there will be more updates to improve the 'syncing' and smooth playing of the movies and media. Other than that, I see no problem with it. I'm actually ordering another one from Amazon for my parents (it costs less than Google because of the shipping).Easy to use.Convenient.Try it!", "verified": true, "helpfulness": "1/1", "author": "Wtran"}, {"rating": 4.0, "review": "Chromecast was easy to set up and work. My only complaint probably isn't Chromecast's fault. Sometimes the sound isn't synced with the picture. Perhaps my WIFI isn't up to snuff.", "verified": true, "helpfulness": "0/0", "author": "Stealthvette"}, {"rating": 3.0, "review": "If you like Youtube and Netflix that's all it's good for. I use XBMC on my AppleTV. It's so much better.XBMC is 10 years ahead of this thing. And it's free!!", "verified": true, "helpfulness": "0/4", "author": "Rob"}, {"rating": 4.0, "review": "I bought two of these as soon as they were announced (with the Netflix promo codes), one for my mother and one for my father, in hopes that they would leech off my Netflix account and embark in their newfound source of entertainment. To date, both Chromecasts have been used no more than a dozen times, and a vast majority of which by me.It's hard to make old dogs learn new tricks, I suppose. Nevertheless if Chromecast allowed wireless display mirroring (so my mother could play her games on her TV, or my dad could better see the ESPN app) or, better yet, be installed in between a cable box (or whatever is in the primary HDMI input) and the TV and override that input when in use (so you didn't have to manually switch inputs, which neither of my parents seem to be able to do without great difficulty) then maybe my parents would get more use out of it.For me, I have an Xbox 360 and PC hooked up to my TV. The Chromecast doesn't really make my TV any smarter, or in any way more connected to the services I use or to my Android devices. And that's a shame.I'd love to play games on my TV (wirelessly) using my Android tablet and wireless PS3 controller, for example, but I do understand we are a bit away from that happening. Meantime, I still think this is an amazing product because it's the cheapest way to turn dumb TVs into smart TVs, and I look forward to the greatness that will inevitably come from it.", "verified": true, "helpfulness": "0/0", "author": "Kristophe M. Perovic"}, {"rating": 5.0, "review": "It came in the mail, I plugged it into an HDMI port on my flat screen, plugged in the power cord, downloaded the appropriate apps through my iPhone and voila! Wow! The Chromecast installed very easily with info from it's website and on line prompts. I found that it works perfectly with both Utube videos and Netflix movies that, on the large flat screen tv, are excellent. It's WiFi, no cables, wow.I made a point of playing some Disney videos from Utube, for my granddaughter, and movies from Netflix, too. This Google Chromecast HDMI Streaming Media Player performed perfectly. Very useful for me viewing instructionals, too. And can't wait to see what else I'll be able to use it with.An Incredibly useful device, and for $35., it can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Bill Oterson"}, {"rating": 4.0, "review": "Google's Chromecast is, for the most part, a good cheap alternative to the Roku, Apple TV, and Google TV. However, it also has limited functionality for now, as the only apps it natively supports are YouTube, Google Movies, Netflix, and Google Music. Apps like HBO GO are currently not natively supported, though there have been unofficial efforts from Android developers to expand its functionality to other apps (which were subsequently disabled by Google due to concern over QC). Anyway, the apps that it supports work very well with it; once you install the Chromecast app on your Android device and have all the relevant apps updated, as long as you're on your WIFI network you'll see a little streaming television icon at the top (phones) or bottom (tablets) of your screen. Just click it and then it'll begin streaming to your Chromecast.Setup is very easy. Just plug into an HDMI slot on your television and then if your television also has USB ports, plug it in with the included USB cable. If not, it also comes with a wall adapter. If your television is far from your router, the Chromecast also comes with a small WIFI extender. Then just turn on your television and run through the setup program, which basically just consists of having it recognize and connect to your home network. Have a computer or mobile device at hand for this part of it. You'll have to do a similar setup on your mobile device once you've installed the Chromecast app.Once it's running, the Chromecast takes no effort to run. It automatically turns on when you switch to the appropriate television input, and it slowly goes through a slideshow of beautiful scenery and backgrounds. It is actually nice just to see these beautiful pictures displayed on your television if you've got a big screen HDTV. Then, again, just use one of the apps mentioned above and begin streaming. You can also stream webpages from Google Chrome on your computer once you install the Chromecast extension. There is supposed to be support for iOS but that hasn't happened yet. Hopefully Google will get support from other companies as well besides Netflix (HBO, Amazon, etc.).One of the biggest pluses is that once it connects to your mobile device, it takes the load off and streams over your router. What this means is that it doesn't result in any noticeable battery drain over what you already have normally. I can watch a 22-minute show on Netflix and my (almost) two-year old battery in my Galaxy Nexus will go down 2%. Your mobile device essentially just turns into a remote once the Chromecast begins streaming. It also awesomely allows you to use your device normally while streaming. That means that you aren't tied down to the \"remote\" functionality while streaming. You can let it run in the background (still available from your status/notification bar) and go on texting, emailing, etc. if you want. These two features alone, the extremely low battery drain and the ability to keep using your mobile device normally while streaming, are fantastic.Basically my only gripe with the Chromecast besides the relatively low amount of compatibility as of writing is that I seem to have an occasional issue where, when I turn on my television and it goes to the Chromecast splash screen, the screen flickers a bit. Then on occasion when I am playing video the audio will cut out and I'll have to rewind. I have tried unplugging the Chromecast, resetting my router, etc. and don't know why it does this. The router is literally six inches from the Chromecast so it's not a connectivity issue. Hopefully it will get ironed out soon.Google, please keep working to bring other companies into this. I would guess that lack of HBO GO is a big sore spot for many users. It would also be great if Amazon would develop some video apps already and stop trying to be proprietary to its Kindle line (at least they have an app for Roku and for my LG smart TV). For now, should you buy this? If you don't care about HBO GO and don't use Amazon Prime, then yes. Do not hesitate. It's only $35. If either of those is really important to you and you don't want to sign up for Netflix or make purchases over Google Movies, then you may want to wait until this has some better functionality. All in all, though, this thing is amazing and amazingly priced.Edit: As I was reminded in the comments section, you can still stream \"unsupported\" programs through Chrome on your computer, these are just not supported by actual built-in app compatibility.", "verified": false, "helpfulness": "1/1", "author": "Ryan Winkleman"}, {"rating": 2.0, "review": "I have a higher-end wireless router than the average person at home, a Cisco 881w. Chromecast will not work with it because UPnP support is required, but Cisco routers do not support it.Be aware if you have an old router or a more business-class router that Chromecast will only work if it supports UPnP, check it out before you buy one if you are unsure.", "verified": true, "helpfulness": "0/2", "author": "JacobC"}, {"rating": 1.0, "review": "Had this thing working for about 30 minutes. I hate it. Waste of time and money but it was pretty cheap. Ok I tried it some more after a couple of months. All this thing is for is cast youtube. What? How many people need to cast Netflix? Likely none if that many! So why is casting youtube worth anything? Hey if that is what you want to do this thing is perfect. If you want to do anything else with it, forget about it. It doesn't work.", "verified": true, "helpfulness": "0/7", "author": "DelCerro"}, {"rating": 5.0, "review": "Got this for a new small 1080 hdtv in the guest room, so that the grown up kids can tune in Netflix with their smart phones when they're here.  I  opened the box at 6pm and was watching Emergency on Netflix by 6:15.  No buffering. Here's what I had to do:  1) Plug in the Chromecast dongle into an HDMI port on the TV; plug USB cord into back of dongle and into USB on TV (if you don't have one, you can get the power from an electrical outlet, cord is long enough), change input source on TV to the HDMI where you have the Chromecast plugged in (although mine went there automatically); a web address is given to do the chromecast setup (google.com/chromecast/setup).  If you don't have chrome on your laptop, you will need to download it.  This is where Chromecast dongle gets sync'd up with your wireless network.  Then it will tell you you're read to cast.At this point I was a little puzzled, but here's what I had to do.  I had to go to the Google store and download the Netflix app for Chromecast to my laptop, or to my google cloud in the google store, I'm not sure.  I've checked and you can't use just Netflix.com; you have to get the specific Netflix app for Chromecast because it has the little \"cast\" icon in the right hand corner of the Netflix selection.  Now I had to sign into Google to get access to the store.  YouTube was already there, and I added the Netflix.  I imagine I will have to get the kids to download the Netflix app to their phone.  This is all one-time set-up stuff.  I clicked on the new Netflix app in the Google store and it looked just like regular Netflix, found my show, and accessed my show.  Once the show was ready on my laptop with the usual Netflix loading delays, I clicked on the \"cast\" icon and it appeared on my TV.  I then minimized and did some other stuff while the show was on.  You can't close it out as that definitely shuts it down.You have to have a wireless network, you have to have a Netflix subscription, you have to have a TV with an HDMI port (a USB makes it a little neater).  This isn't taking the place of my WII, but it is allowing me to view Netflix from my basement TV or guest room TVs.  Tomorrow I'm going to try it on my basement TV.  It looks like it will be pretty portable.Update 9/16:  Moved it to my basement tv, and it works perfectly, using the same name on the network.  Basement tv doesn't have the correct USB port, so I just used the plug supplied to get power from the electrical outlet.  I also tried browsing in hulu and cbs.com thru the google chrome browser and was able to cast the screen content over ...", "verified": true, "helpfulness": "0/0", "author": "Pam B"}, {"rating": 3.0, "review": "I finally received my Google Chromecast from Amazon yesterday.My verdict?  Mixed...Pros:The device hooks up easily.  All you need is a free HDMI and USB port on the back of your TV.  The USB is needed to provide the power to run the device.  You do get a AC to USB adapter in the box if your TV doesn't have any USB ports.You are directed to a Google site to setup the device.  You have to setup from a computer/tablet/phone that is currently on the same WiFi network as the one you wish to setup the Chromecast.  I mistakenly tried to setup the Chromecast from my ethernet-connected desktop PC and it failed to run the setup.Cons:The Google Chromecast is a device that really should be considered a 'beta' version.  So far, the device only supports Netflix and Youtube, and will only 'broadcast' web pages in Google Chrome (no surprise there).  The big deficiency is that it does not support Silverlight which for me meant I could not broadcast my Amazon Prime videos over the Chromecast.Granted the Chromecast only costs $35, however don't throw out your Roku if you have one.  It is a superior product.  I'm hoping that Google is not done with development and has further enhancements coming soon.", "verified": true, "helpfulness": "0/0", "author": "Darin L. Kerr \"DarinK\""}]