[{"rating": 5.0, "review": "Chromecast is the future. You will love it. From Youtube to HBOGO and beyond, the uses never stop. Would and have recommended this to all of my friends and family.", "verified": true, "helpfulness": "0/0", "author": "Zachary Sampsel"}, {"rating": 2.0, "review": "I do have to say that because it plugs right into the TV it is convenient.  But there's a delay in relaying options like play / pause & rewind /fast forward to where you want is practically impossible. And it takes forever to get the choice of movie / show loaded (I get most of mine through Netflix, I don't know about other services). Also, I thought it would have a remote like the Roku box, with an option to control through your phone or iPad but it doesn't. But even after that the delay alone is driving me crazy. I'm going to send mine back.", "verified": false, "helpfulness": "0/0", "author": "Jessy Johnson \"bk crzed\""}, {"rating": 3.0, "review": "I have a Dell Venue 8 Pro tablet that is Windows 8 based.  I was excited to get the Chromecast so I could stop hauling a computer near the TV to watch my Amazon Prime streaming movies.  I could not get the Dell to recognize the Chromecast upon setup.  So my son used his iPod to set up a Chromecast and then the Dell was able to link to it after being set up.  The quality of the playback is worse than using an HDMI cable with the computer, and the transmission was \"jerky.\"  Whenever a scene pans the picture jumps.  It's just not a fast connection.  Maybe it's my internet speed, but the computer played the movies fine.  Also, Amazon wants you to use MS Silverlight on windows based PC's.  I used that with the computer, but Chromecast doesn't work with Silverlight, so I had to change to Flash which probably added to the degradation.  There were a couple of pauses that never happened with the computer and Silverlight.  So overall it works, but not a very pleasing picture on a 55\" screen.", "verified": true, "helpfulness": "0/0", "author": "J. Currier"}, {"rating": 4.0, "review": "Amazon prime doesn't stream on a google product? I can't get it to work, maybe it is just me, I don't know.", "verified": true, "helpfulness": "0/0", "author": "Ryan M. Rocha"}, {"rating": 4.0, "review": "The only reason I did not give this 5 stars is because of some connectivity issues. I use my Moto X with Play Music to play music through the TV along with my iPad to play YouTube videos and Nextflix. When playing music, either with the iPad or Moto X, the Chromecast just stops playing the playlist for no reason and everything needs to be restarted. I have never had issues with YouTube or Netflix. I also cast from time to time from my PC with Chrome with no problems. Could be the Play Music app, no idea. Just kind of a pain at times. First world problems.", "verified": true, "helpfulness": "0/0", "author": "ManWithaGun"}, {"rating": 4.0, "review": "When I saw this product promoted it seemed to be saying that if you had access to something on a portable device (laptop, tablet, phone), you could simply stream it to your TV, easily and at a very, very low price. Their marketing line is, \"Everything you love, now on your TV.\" But once I received it, I discovered that you can only stream content from a limited number of providers, a fact that wasn't made clear in the marketing, For example, you can stream HBOGO, but not Showtime or Cinemax. You can stream Netflix and Hulu Plus, but not Amazon Prime. Bottom line, it does work well  if you want to see something from their list, but you definitely can't see \"Everything you love\", at least not yet. Look at the list of what works with the device on their website, and then judge for yourself.", "verified": true, "helpfulness": "0/0", "author": "Brian Olesky"}, {"rating": 1.0, "review": "Skip this product and go for the Roku .. at first we thought the Chromecast would be just the thing, but we had so many problems.  Went to an electronics store and the salesperson called it \"ChromeCrap\" and suggested the Roku to us.  We bought the $100 model and it has been awesome .. no problems with it at all.", "verified": true, "helpfulness": "0/1", "author": "Marcy Brust"}, {"rating": 5.0, "review": "i first had one for the living room and a laptop in the bedroom, but chose to switch out the laptop for another one of these.  i have a plex home media server (free web streaming) and it works great with this, i can watch all my home media without having to do all that much.", "verified": true, "helpfulness": "0/0", "author": "Matthew Ruddell"}, {"rating": 3.0, "review": "Chrome has a lot of faults and restrictions. It does not work as advertised. Its use is very limited to both the device that can use it and the videos that can be played from it.", "verified": true, "helpfulness": "0/0", "author": "bernard lyons \"Bernard Lyons\""}, {"rating": 2.0, "review": "I'm really disappointed at the reliability of this thing. Always drops from the network and my devices rarely find it.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Mitchell"}]