[{"rating": 5.0, "review": "The Chromecast handles all of my streaming needs. I use it for Netflix, Youtube, Revision3, Songza, Pandora, And Play Music which are my major media apps. Looks great on TV and using your phone as the remote is easy and natural.", "verified": true, "helpfulness": "0/0", "author": "Jared K"}, {"rating": 3.0, "review": "Ti bad this only worked the first couple of times and then just stopped. It was a great I dea but now it is just frustrating. I cannot get it to actually stream anything. All I get is one error messahe after another and both errors are different! Waste of time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I really love this device. I don't have \"Smart\" TV's and this little device enables my TV to be not a genius but close enough. I runs most of the apps I love and now with VUDU included I am in heaven. I bought 2. One originally - gave that to the Mother-in-law (who loves it too) and another to replace the first one we gave to the mother-in-law. Want to buy a third one to give to the granddaughter for her Netflix movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I give it 3 stars because it probably will work well for you.  But one should not assume that, because set-up is depicted in 3 simple pictographs, that set-up will be simple.  I can assure you there are help forum pages devoted to those of us who could not get our router to recognize it. So A) get one, it will probably work as 'plug'n'play.'  But  B) be careful -- you might be sending it back,  And C) be patient and scour the internet for set-up advice.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "I really, really wanted this product to do well - it's small, portable, and packed with what I needed... or so I thought.Setup was easy.  It took less than 5 minutes to get the entire system rolling, and to learn how to \"stream\" to the TV.  Unfortunately, there's just not that much content.  We also own an Apple TV, which has so many more features, so we decided to sell the Chromecast.-1 star: Poor content support.  The amount of \"apps\" available is just so minimal.  Maybe in the future Google will develop more content and this product will be much better?  Maybe not - I don't want to take the chance of waiting around.I'd recommend an Apple TV, Roku, or another streaming product to my friends over this.", "verified": true, "helpfulness": "0/0", "author": "David Galipp \"David G\""}, {"rating": 3.0, "review": "not impressed with the quality of the transmission. grainy picture sometimes. Hogs the Wi Fi signal from other items in the house.", "verified": true, "helpfulness": "0/0", "author": "David Hay"}, {"rating": 3.0, "review": "We don't.It's jsut not that big of a deal... It does what it says it will do... but what it will do just ain't all that.Put it away and it's gathering dust.", "verified": true, "helpfulness": "0/0", "author": "Kage87z"}, {"rating": 1.0, "review": "When I bought this thing I basically only wanted to use it for one thing: streaming youtube.  It did stream youtube videos. However, it happened that often times, it could't play videos longer than 30mins without an error and stopped.  The same video played well on my computer, phone, or even tablet using the same network.  This is really frustrating.", "verified": true, "helpfulness": "1/2", "author": "penpal"}, {"rating": 5.0, "review": "Can't say enough about the Chromecast.  Cheap, Easy to Use, and Gaining More Apps Daily.  One of Google's best products.", "verified": true, "helpfulness": "0/0", "author": "Sports_guy"}, {"rating": 5.0, "review": "I really am pleased with this product.  I did a lot of reasch before I bought this product.  I read the customer reviews and it worried me a bit but I took the chance and I must say I was surprised with this product.  I dont think people where giving it a good review because it was a little confusing setting it up. It was easy putting it together.  However i had a hard time figuring out how to get it on line. The only thing I think you need to say bring your tablet or phone to the room put it in front of the tv you have it install these two programs and it will do the rest.  Other than that it its a wonderful product. You dont have to redownload the programs like hulu and netflix. You just have to touch the little wifi button it will ask you tablet or bedroom.  Then you choose what you want. It also has a volume control too for ur tv its really neat. I have only had it for a couple of days and im very happy with my purchase. I have brighthouse 60. It takes a minute to download the program the it plays as long my itnernet is up it works great no lagging buffering nothing!! Works like ur watching regular tv. My hubby loves it cause he use to stay up till 2 in the morning watching netflix in the living room. Now I can get him to bed sooner. My computer is in the living room chromecast is in the bedroom.  I can set up a movie on my tablet anywhere in the house and it will still load on the tv in the bedroom. Then I can continue to play my games or whatever I want to do on my tablet while the movie is still play. The only thing i wish they would do is when ur watcing a series is to make it play the next episode so I dont have to click on it maybe they will figure out how to do that! If you need a wifi for ur tv this is the one to get,  but u must have a smart phone or tablet to operate the product. Maybe one day theyll figure out how to control it from the puter or make a remote for it? Who knows anything is possible. Great product....WONT BE SORRY FOR YOUR PURCHASE...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]