[{"rating": 4.0, "review": "This is great device. very stable and work smoothly. the only issue is that many of the apps and content are not available for international users.", "verified": true, "helpfulness": "2/2", "author": "Aliza Vogel"}, {"rating": 5.0, "review": "awesome, huge selection of amazon prime videos in particular.also many entertaining games, I think games will become the killer app for this STB soon", "verified": true, "helpfulness": "1/1", "author": "Matthew Feinstein"}, {"rating": 4.0, "review": "This is not a dvd player. Excellent large movie Playing screen so you can sit across the room and read what a movieis about. Yes you can play netflix on it.", "verified": true, "helpfulness": "1/2", "author": "Christina"}, {"rating": 3.0, "review": "Not impressed... the \"free\" Prime stuff, with a few exceptions, are the same old movies and tv series you get with Netflix. Yes, there are other movie watching options... once you download their apps and PAY a monthly fee to EACH ONE for their services. I have had it hooked up 3 days and have already watched or seen before anything I'm interested in watching. Very disappointed....", "verified": true, "helpfulness": "2/6", "author": "Reba"}, {"rating": 5.0, "review": "I have been using the Amazon Fire TV for about a month and am very satisfied. Easily connects to TV via HDMI and network via Ethernet. I didn't use Wireless as my router is only a few feet away. I have used to watch Netflix and WWE Network along with several MLB games. There have been a few streaming issues mostly with Netflix but I believe it's not a Fire TV issue.  The remote is a little small as I have large hands but easy enough to operate. It works even from another room or pointing in opposite direction of unit. I don't use the voice option too much but it does work without issue.  It doesn't have an on/off switch but it's not needed as the unit turns itself off appx 30 minutes of no use. Press any button to turn back on when ready.  Overall I am very satisfied with this and along with subscriptions I already have, it is awesome. Very glad I made this purchase.", "verified": true, "helpfulness": "0/0", "author": "JBF31643"}, {"rating": 5.0, "review": "Love it so far. Fast and slick. I like the games too.", "verified": true, "helpfulness": "0/0", "author": "John Little \"SeriousSteve\""}, {"rating": 4.0, "review": "Just started using it much better graphics than Roku but not the flexibility didn't buy game controller seems to expensive should come with it", "verified": true, "helpfulness": "0/0", "author": "stephen \"Listing on the fly\""}, {"rating": 4.0, "review": "Most of the stuff we want to watch costs on Amazon. But, the Hulu+ and Netflix Apps are no charge. Works great and easy to use. Fast access and great 1080 and sound. Very easy to setup. Looking forward to learning more about it.", "verified": true, "helpfulness": "1/1", "author": "David Butler"}, {"rating": 4.0, "review": "I love it!  Great streaming device. Love the voice command!", "verified": true, "helpfulness": "0/0", "author": "Ladonna holtzclaw"}, {"rating": 3.0, "review": "It's a good buy to watch more movies but there is a lot of movies that is not on prime and cost more then you can go buy it on DVD ..", "verified": true, "helpfulness": "0/1", "author": "jeffrey cotton"}]