[{"rating": 1.0, "review": "this device was created for some purpose ,but I haven't figured out why yet,it is the most limited useless piece of hardware I have ever seen ,it does not cast anything,useless", "verified": true, "helpfulness": "0/3", "author": "ozzy"}, {"rating": 1.0, "review": "I bought the Chromecast with HDMI extender but the standard Chromecast already includes the HDMI extender. No additional value in this product.  I recommend buying the standard for $35.", "verified": true, "helpfulness": "0/2", "author": "cipocop"}, {"rating": 5.0, "review": "I could NOT be happier! I know my way around the computer, but I am no wizard. This was SO simple! I told one of my co-workers about Chrome, ordered one for her and she LOVES it! On the advertisement it shows a little girl setting it up - well, that is what happened with my co-worker, her 7 year old helped. I would HIGHLY recommend this if you don't want to pay for the extra channels with a cable provider! You can download Netflix, Hulu, and other things to be able to watch movies or catch up on shows. Netflix is only 8.00 a months and so is Hulu. Way cheaper!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Will not work on netflix as advertised do not bother if you want netflix to work wait for Roku Streaming player", "verified": false, "helpfulness": "0/4", "author": "michael f. callahan"}, {"rating": 5.0, "review": "If you use netflix or hulu this is a no brainer. Now that the API is opened up new apps are coming in and making this item even better value", "verified": true, "helpfulness": "0/0", "author": "Matthew Simmers"}, {"rating": 5.0, "review": "When we first received it, it seemed good. Over time, it has become a dream come true! We don't have cable (don't need it when we have Hulu and Netflix) so it's pretty amazing that we can just plug in the tv, attach the Chromecast and watch whatever we want from our HuluPlus or Netflix accounts without needing any more cords or components attached. Big fan!", "verified": true, "helpfulness": "0/0", "author": "Dana Schrader"}, {"rating": 4.0, "review": "Really nice. Very convenient. Depends on internet at home and so sometimes it takes long to load. But at least it is commercial free and has breath-taking screen savers. Like it, like it, like it!", "verified": true, "helpfulness": "0/0", "author": "NJA"}, {"rating": 3.0, "review": "It does everything it say it should but when you use google chrome and display your laptop screen it lags a lot and words don't match the video...other than that glitch it is great when you use the programs it is compatible with!", "verified": true, "helpfulness": "0/0", "author": "Komal"}, {"rating": 5.0, "review": "i dont know if its a good thing but since getting this device im actually watching my tv more often. my friends and family are amazed at how i load a movie from play store from my phone ( HTC One ) and send it to my 40 inch TV. now all microsoft needs to do is make one for windows media player to stream to tv too and my world will be much more complete.", "verified": true, "helpfulness": "0/0", "author": "M. irving"}, {"rating": 5.0, "review": "You really cannot beat this solution at the $35 price tag. Super easy to set up and use. I have purchased this for multiple people as gifts and every one of them thanks me on a weekly basis. Everyone should own one of these.", "verified": true, "helpfulness": "0/0", "author": "Lovepinke"}]