[{"rating": 5.0, "review": "This is an Awesome Product why have cable when you can have the Fire Box !", "verified": true, "helpfulness": "0/0", "author": "Christopher Bevins"}, {"rating": 5.0, "review": "Simply fabulous!  Anyone that has prime should get this. I purchased the fire TV and the fire stick. I gave the fire stick to my daughter for Christmas. The cool thing is I can control both of them with my Kindle, which I got for Christmas last year.  With the FireTV app I can see what my daughters watching and I can control it which means while she's watching TV I can change fast-forward reinput all that different shows in the middle of what she's watching.  Also with the voice command I can put little messages on the TV in the middle of her show and for someone who is 14 and believes in ghosts well it makes for quite a comical experience. The controls the set up no buffering time the amount of apps and programming that you can use through this device is awesome I have had no problems with it whatsoever Pickanax every time and it does exactly what I ask it to do I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Nuclear Pharoah"}, {"rating": 5.0, "review": "Indistinguishable from new. Works perfectly and is enjoyed greatly.", "verified": true, "helpfulness": "1/1", "author": "JES"}, {"rating": 5.0, "review": "I purchased the Amazon prime box because I wanted to save money on cable but I wasn't sure on how it work I'm very impressed it work great remote control work great clear picture I Purchased  another box that's how happy I was with the prime Amazon...I was trying to save some money and I purchase a ROKU stick and I was so disappointed I rate the ROKU a 0 stars it was difficult to set it up after working with Roku Tech suppor support for 2 hours it still was not connected and they asked me to call my cable company I change my daughters Amazon Prime box to the TV that I was working with the Roku and it works right away I will not recommend anybody to Purchased the Roku stick.", "verified": true, "helpfulness": "0/0", "author": "Blanca"}, {"rating": 2.0, "review": "Its awesome. BUT there is a major lack in security. There needs to be a pw or pin setting for purchases made on the FireTV otherwise anyone could \"accidentally\" click buy on ANYTHING.", "verified": false, "helpfulness": "1/3", "author": "shop smart"}, {"rating": 5.0, "review": "I love this! Amazing HD and great selections! Great work Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Robert Day \"Robertus Invictus Maximus\""}, {"rating": 5.0, "review": "Best thing I've gotten in a long time. Love it.", "verified": true, "helpfulness": "0/0", "author": "Timothy A. Adams"}, {"rating": 5.0, "review": "Bought this as a gift for my parents.  Love it!!", "verified": true, "helpfulness": "0/0", "author": "don"}, {"rating": 4.0, "review": "Only have had this a few days but so far it has been spectacular far above my expectations. Only problem is that prime movies and pay movies are all combined you don't know if they are free or pay till your about to play them than you have to search again to try to find a prime movie. There should be separate lists to search in.", "verified": true, "helpfulness": "1/2", "author": "bksalt"}, {"rating": 5.0, "review": "It was an easy set up and worked well out of the box. I do think there are confusing parts of the operational system that need to be improved. Like making it easy to review and pick prime movie and TV selections. On a computer it is much simpler to review the movies and read the brief descriptive. Don't know why it can't be similar. It is a great product and like everything will improve.", "verified": true, "helpfulness": "0/0", "author": "MAP"}]