[{"rating": 5.0, "review": "This thing is great!", "verified": true, "helpfulness": "1/1", "author": "Armon R."}, {"rating": 1.0, "review": "I have two of these units and since the last update they have been unable to connect to my network or they disconnect from it. I have a million of electronic devices that work flawlessly on this network, so the problem are the devices. Check on the forums for \"chromecast brain freeze\" before buying it and you'll see. This problem has been an ongoing thing for over 2 months and Google didn't fix it, so keep in mind that that's the kind of \"support\" you will receive from them. They were great before the update ....", "verified": false, "helpfulness": "0/0", "author": "Tomiviser"}, {"rating": 4.0, "review": "Loved it for a year and usb cord got damaged so ordered new one, now it doesn't work period", "verified": true, "helpfulness": "0/0", "author": "Pat in FL"}, {"rating": 5.0, "review": "I love this gadget. Able to play all the content from my cellphone right to my TV with no problems. This is my second one, i broke the original PINS my bad. Overall great great product.Received 2 day ahead of schedule... AWESOME>>> SWEET", "verified": true, "helpfulness": "1/1", "author": "Ronald Daniel"}, {"rating": 5.0, "review": "A neat product with a wonderful interface. I especially enjoy the constantly revised background photos that cycle on the background while the device is idle. I well polished product.", "verified": true, "helpfulness": "0/0", "author": "Luke Jackson"}, {"rating": 5.0, "review": "Google Chromecast is the best thing next to the Apple TV. It's super affordable and works great. Sometimes it does act up if the wifi isn't that great but overall I have had the product for months now and I use it everyday.", "verified": true, "helpfulness": "0/0", "author": "KALPANA PATEL"}, {"rating": 2.0, "review": "We have Apple TV, Roku, Fire, and Slingbox. We bought this because it was on sale and we wanted to work with a different interface. Roku and Apple TV work equally well for us so it depends on your brand of equipment and preference. Both have discrete remotes. Fire has a discrete remote but is very limited in apps and seems mainly another effort by Amazon to sell their content. Slingbox is for a different purpose although there are apps for it on most of these devices (recently Fire added one). I am not sure what the Chromecast (no remote) does that would make it stand out. It is boxed up and I'll give it to one of my kids.", "verified": true, "helpfulness": "0/1", "author": "RGG2ND"}, {"rating": 5.0, "review": "Very useful. Great to take on vacation so that we can use Netflix and stuff on other TV sets. Very happy with this purchase.", "verified": true, "helpfulness": "0/1", "author": "Cameron Sacke"}, {"rating": 2.0, "review": "Setup was somewhat more time-consuming than it should have been.... but the real problem is that Amazon Prime is not supported, nor is Acorn. These movies won't even mirror from your PC (although youtube videos will), even tho the unit includes that function in its marketing materials.We'll give it two more days to burn in, and will return it if it doesn't come around.", "verified": false, "helpfulness": "0/0", "author": "Virginia Mom"}, {"rating": 4.0, "review": "If this supported Amazon Prime streaming, it would be fantastic. Otherwise, it is great and I recommend it. Made our \"dumb\" TV into a smart TV", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]