[{"rating": 3.0, "review": "The only things you can use this for is Youtube, Netflix and Hulu, it would be amazing if I could pull up a web browser and put it on my computer. Also would like to be able to stream my online movies to a tv. Its a great idea but not adapted into real life yet.", "verified": true, "helpfulness": "0/0", "author": "Michael Manns"}, {"rating": 5.0, "review": "Gotta love the guys at Google.  Think of this as a USB Thumb Drive only as an HDMI device.  You plug this into an HDMI port on your TV and plug in it's power cable (which is a mini-usb port).  Then, the device creates an ad-hoc wifi network that you connect to either with your laptop/mobile device.  The Chromecast app on your laptop/mobile then automatically detects the widget and allows you to connect it to your preferred wifi network.  Once that is complete, all of the devices on the network see the Chromecast and can control it.Watch Netflix, Hulu, Google Music, Google Video, or stream a Chrome browser tab to your TV.  Super slick, easy, small, etc.I love using it in hotels, though that setup is a bit more complex as I travel with an airport express that I setup in my hotel room, connected to the hotel wired internet (if there isn't a wired connection, the setup doesn't work).  I can then plug in my Chromecast and it connects to the airport express and I'm set to watch whatever I want in my hotel room on demand.  Sweet!", "verified": true, "helpfulness": "1/1", "author": "Sators \"Sators\""}, {"rating": 4.0, "review": "we basically plugged and played. it took a bit to figure out how to cast from our hard drives, but the casting from the internet was no problem. we finally got it all set up to cast from our hard drive and now really enjoy that aspect of it.", "verified": true, "helpfulness": "0/0", "author": "Todd Frederickson"}, {"rating": 3.0, "review": "When this came out, I was so excited by the product, that I signed up for a wait list.  I thought this would revolutionize tv watching ( from someone that is actively trying to ditch cable).So when I got this, it was as easy to set up as everyone said. plug and play.However, one thing I felt that many people failed to mention was the lack of usage of this product through Aps.  At least with the apple Ap for the chromecast, there are ONLY TWO sites you can play content from ( you tube, and Netflix I beleive).  I don't know if the android aps are any better, but from my perspective, if I can only play stuff from two sites through the ap - what's the point??  I expected to be able to load free episodes of network tv on there, link to video streaming sites, and basically use this to watch any video content i would find online.  Of course you can go get your laptop, boot it up, go to the regular webpage, and play video content from there that streams to your tv through the chromecast.  but if i'm going through all that trouble, I would have just connected the laptop to the tv via hdmi cables??I suspect the ap and usability will improve, so i'm still keeping the product - I just am not really wow'd by it now.", "verified": false, "helpfulness": "0/0", "author": "Up In the air"}, {"rating": 2.0, "review": "i believe that other streamer will do the job better.ok .i know.its only 35 dollar.but google dont let other android developer to have a app on google play.before buying look in google in few forum about it.there is a big disappointment  about this issue.", "verified": true, "helpfulness": "0/0", "author": "boozy"}, {"rating": 5.0, "review": "Works with both my ipad and macbook pro.  does a good job at streaming and allows me to continue to use my device for something else.", "verified": true, "helpfulness": "0/0", "author": "Edward Zimmermann"}, {"rating": 5.0, "review": "Best $35 I ever spent on an entertainment device. It actually plays Netflix at a higher quality than any of the existing players I had, makes Youtube an awesome source of entertainment for everyone, makes Hulu worthwhile, and even plays HBO Go via a Chrome tab at better quality than plugging my Samsung Chromebook in directly via HDMI. I have no complaints.", "verified": true, "helpfulness": "0/0", "author": "Christopher M Best"}, {"rating": 4.0, "review": "Great little device. Netflix and youtube streaming are high quality and easy to use. Can't wait until more functionality is added.", "verified": true, "helpfulness": "0/0", "author": "Jean Pierre Zurbrugg"}, {"rating": 3.0, "review": "Little disappointed that I can not use with my laptop but it works well with my tablet and droid smartphone.", "verified": true, "helpfulness": "0/0", "author": "Ronnie E. Weston \"Ron\""}, {"rating": 4.0, "review": "Intresting product with a good price.If you want something to look videos y your Lcd by HDMI buy this!", "verified": true, "helpfulness": "0/0", "author": "FERNANDO LACHAGA \"F LACHAGA\""}]