[{"rating": 1.0, "review": "This ^%$%^$ thing has absorbed days of my time without success - and if it does not work on it's own, there is nothign to do !  No support, no help.  My problem is trying to set up to show Netflix from my Samsung Galaxy Tab 3.0 tablet - I get error 16003 ... and that's it.  Have searched web, found a lot of similar complaints.  I have (as various sites recommended) reset, reinstalled, rebooted over and over, reset wireless modem - all without success.UPDATE:  I have now spent three full days getting this to work.  Netflix blames Samsung, Samsung blames Google, Google blames Verizon.  Verizon convinced me to install a new router ($99) - which took hours to install, and get the WiFi repeater working, and reset every tablet, laptop, desktop and Chromecast in the house ... still not worked.  Netflix says their engineers will call me back ...  Trying to talk with Google is like sending a note to Santa Clause - and Samsung said they have never heard of the problem. Netflix has heard of the problem, but if you cannot set the Date / Time settings on automatic, no idea what to do.So, what finally worked ?  I noted that my Samsung tablet internal time was off by 3 minutes.  I manually set the time to the time displayed on my Verizon DVR - and it all started to work.  So, three days of my time would have cost my clients ... well, a lot - and all that was needed was to set the time correctly on my WiFi only Galaxy Tab.I am going to leave this a \"1\".  It cost me $35 and thousands of dollars of my time.  I do wish I had never bought it.NEXT UPDATE: So, worked for awhile ... not now.  Bottom Line: Chromecast will not work reliably to cast Netflix from a Samsung Galaxy Tab 3.  So, I have spent now $170 on modems, repeaters, and Chromecast - and it wont work.", "verified": true, "helpfulness": "1/2", "author": "WTD"}, {"rating": 3.0, "review": "I was under the impression from the commercials that you just needed to stick the Chromecast into an HDMI port and that's it. This is not true. You have to have the Chromecast powered either through a USB (on TV) or into the wall. We use the USB port so you don't see the wires, but I was very displeased with this misrepresentation because we have a Roku which needs this kind of plug arrangement and I thought the Chromecast would be simpler. You also need to have your iPhone/iPad/Computer playing the content you want to stream on your TV which is clunky and sometimes suffers from buffering. The functionality is good and I really enjoy how you can cast HBO GO from your smartphone to the TV, but overall this is a lot of steps to accomplish a simple task. I would suggest comparing Chromecast to a Roku since you need the same power source, but Roku does not need to be tethered to a smartphone/computer.", "verified": true, "helpfulness": "0/1", "author": "kruggs \"kruggs\""}, {"rating": 1.0, "review": "Save your money and get Apple TV. Fails downloading often. Too Restrictive. Can't stream from any apple device.  Waste of money.", "verified": true, "helpfulness": "0/0", "author": "Thomas O'Neil"}, {"rating": 5.0, "review": "I bought this for my broke sister that is in med school at UW-Madison.  She cannot afford cable and she uses all of my accounts on this.  Netflix, Hulu plus, HBO go, etc.", "verified": true, "helpfulness": "1/1", "author": "Ryan Miller"}, {"rating": 2.0, "review": "A ps3 works betteR. Would be much better I'd you could use over local connections...a good start, but I'm waiting on something else.", "verified": true, "helpfulness": "0/1", "author": "Ray John"}, {"rating": 5.0, "review": "At first I was expecting something different... some TV menu maybe. As soon as I connected it I realize all the actions are done in your phone/tablet while the TV shows preloaded pics as a wallpaper!I mostly use it to stream from netflix and my local DLNA devices", "verified": true, "helpfulness": "1/1", "author": "Sergio Díaz \"Sergio\""}, {"rating": 5.0, "review": "No issues at all, can cast whatever I want. If you google for it you can find all kinds of different ways to use this.. cheap price, excellent results!", "verified": true, "helpfulness": "0/0", "author": "Dean Powell"}, {"rating": 1.0, "review": "Not what i expected. I dont find it useful at all. Very limited apps. Should have done more research about it. Very disappointed", "verified": true, "helpfulness": "0/0", "author": "Maria C Amaya"}, {"rating": 5.0, "review": "The quality of the video seems enriched casted via chromecast. I am very much relaxed and watching the videos by selecting them through handheld devices.", "verified": true, "helpfulness": "0/0", "author": "Sai Krishna Puli"}, {"rating": 1.0, "review": "The advertising doesn't tell you need usb for power so you have cables if your TV dosen’t have usb you have to use your computer.I send my back", "verified": true, "helpfulness": "0/0", "author": "tocuro"}]