[{"rating": 4.0, "review": "I bought this Fire TV mostly for movies and to replace the Direct TV (which is all commercials for the basic package). Overall, it was nice and the voice reconigtion for searching for movies was awesome. There were lots of free movies and lots of movies you had to buy. I found that simple movies that should be free you had to buy. The speed was very fast on this box. I had no problem hooking it up and getting started. However, there is no on/off button so the thing stays on the whole time. We'll, about 2 days it died and wouldn't boot up. Systems folks were very helpful.  I sent it back and a new one arrive within days from Amazon. I also purchased the controllers. I had a little diffuculty getting them to log in, once I worked at it I got it. Batteries were included and the games were very kid friendly & simple to play (for dad and kids). However, mine was using the router to communicate and locked up occasionally. Never, had a problem with the movies locking up but the games did. Remote is very friendly and work fine(includes batteries). My biggest problem was the separation of the movies & games from the one that cost and the one that are free. Like I said before, it seem like most cost money to play or watch. For example, I download the pinball game free, but found out that you have to buy the boards. A little hidden! Anyway, worked well overall, but needed more free stuff in my view. It seem like you had to buy everything although you didn't if that makes since. I found that we weren't watching it enough to keep it. I tried the 30day trial. Amazon, refunded everything with no problems (as expected). On a tank game, the sound kept going out for some reason. Never did figure that out. I assume it was the wi-fi (router) causing this. Not sure, but if you watch a lot of movies and don't mind paying for them, it's a nice system. Once you download them their yours as long as you have memory. I recommend connecting the box to the router with HDMI cable. I think it will work better.", "verified": true, "helpfulness": "0/0", "author": "COUNTRY BOY"}, {"rating": 5.0, "review": "Love, love, love this. It was packed with minimal full and EASY to install. Started watching The Good Wife - Season 1, right away.", "verified": true, "helpfulness": "0/0", "author": "Marsha Nelson Carr"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "super good quality and we enjoy prime movie everyday.", "verified": true, "helpfulness": "0/0", "author": "Dahua Huang"}, {"rating": 5.0, "review": "Purchased as test device to use in place of cable TV.  Unable to get local networks but much superior to \"smart\" DVD player or Smart TV formats.  Quick and easy set-up, Seems to download streamed content with less buffering time than other devices currently in use within my household.Remote design minimalist but intuitive to use.  Tiny - will fit almost anywhere.", "verified": true, "helpfulness": "1/1", "author": "breyedgrl"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Katie Vache"}, {"rating": 5.0, "review": "Love being able to watch HBO content from the Amazon library and using Sling TV!", "verified": true, "helpfulness": "0/0", "author": "Chris Miskowiec"}, {"rating": 5.0, "review": "even tho it doesn't come with all needed to hook right up, we are satisfied with it so far, only had it for a short while", "verified": false, "helpfulness": "0/0", "author": "Janice"}, {"rating": 5.0, "review": "Super simple to install and get started. I love the ability to voice search. Small and compact box. And if you already have Amazon Prime its set up for you to start watching your tv shows and movies.  My internet is a bit spotty but I bet if i plugged in my Ethernet cable it'd be great. I'm really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Calireader"}, {"rating": 3.0, "review": "I installed my Fire TV on a Smart Sharp LED with Smart applications including Netflix streaming. The same TV has an LG BD player with Smart Applications including Netflix streaming. This enabled comparing all three which are wireless streaming devices on the same LED TV using the same wireless router and same cable source.  I find that the Fire TV delays & hangs when streaming but the built in Sharp LED TV streaming and  the LG BD player streaming applications do not delay or hang when streaming.  I purchased the Fre TV because I was not happy with the ROKU streaming performance which was rebuffering too often.  The ROKU did rebuffer during prime time during the evenings but it never hung or delayed the picture.  The performance of the Fire TV was suppose to be superior because of its faster more powerful processor but something is missing in either its internal video buffer size or how it buffers video that is causing the video delays and freezing. The performance is less then acceptable and for the hype and advertising, it is very disappointing.  I can't recommend the Amazon Fire TV. Don't purchase this product unless you want to accept choppy video and hanging video as part of your streaming experience.", "verified": true, "helpfulness": "0/0", "author": "Steve G \"Tech Guy\""}]