[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "rocky"}, {"rating": 5.0, "review": "It turned our HD TV into a smart tv.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Debbie"}, {"rating": 4.0, "review": "Good streaming stick. Works better with certain computers, but once you get it going it usually runs well", "verified": true, "helpfulness": "0/0", "author": "Jake"}, {"rating": 5.0, "review": "Best little streaming device out there. The only thing that can be considered better than this is its older brother, the Nexus Player.", "verified": true, "helpfulness": "0/0", "author": "fedecape"}, {"rating": 5.0, "review": "If you don't have it....get it!", "verified": true, "helpfulness": "0/0", "author": "Linda Sayan"}, {"rating": 5.0, "review": "excellet product, it has now become my TV tuner in a way, my kids love watching Youtube on TV, and you can also cast using XBMC, KODI, showbox, All Cast, which is amazing.", "verified": true, "helpfulness": "0/0", "author": "Bhavin Gandhi"}, {"rating": 2.0, "review": "The Chromecast is an OK piece of equipment. I did not like streaming things like Netflix. It was really buggy and clunky and had issues. The price point is great and in theory it's a great product but execution was lacking. If you want to share photos on a large screen from your computer or something like that then you might like this. Running it from a phone was not fun. I love Google and pretty much everything they create but this one a a bit of a miss.", "verified": true, "helpfulness": "0/0", "author": "JeronimoHIllam"}, {"rating": 4.0, "review": "Pretty Good Device", "verified": true, "helpfulness": "0/0", "author": "David Ricardo Moreno"}, {"rating": 1.0, "review": "I have a Vizio TV and I cannot get it to connect and if it does connect it will not stream from my phone a note 3 galaxy this product is not what I expected it to be if I could give less than 1 star I would from my experience not worth wasting your money", "verified": true, "helpfulness": "0/0", "author": "Hector Martinez"}, {"rating": 5.0, "review": "Great, I love it", "verified": true, "helpfulness": "0/0", "author": "Matthew"}]