[{"rating": 4.0, "review": "This is a good innovation from Google and I hope that they can also input more features/apps into this product.", "verified": true, "helpfulness": "0/2", "author": "Olubiyi"}, {"rating": 5.0, "review": "My son-in-law pointed this media player out to me.  He loves it as you can broadcast to more than one TV/computer.  So decided to get my son one.  He loves it.", "verified": true, "helpfulness": "0/0", "author": "Vicki Ware"}, {"rating": 5.0, "review": "I love it so far. I just wish it worked with the amazon prime instant video app. I recommend it to everyone.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very useful device but there's not really any customer support. Also you can only use the apps provided. Sometimes it randomly stops working.", "verified": true, "helpfulness": "0/0", "author": "Dejan Knight"}, {"rating": 5.0, "review": "This is a perfect solution for me. I love watching youtube and hbo go on my TV and this is exactly what the chromecast is designed for.I used to stream from my xbox but it constantly had to stop and buffer and seemed very laggy, despite having good internet service. But now I can do all the same things, controlling it with my phone or ipad without all the frustration I had before. It takes only a few minutes to set up but once you get through that it feels very seemless. I was worried that there would be compatibility issues with my apple devices (which wouldn't have surprised me, those corporate ******) but I'm happy to say they all work together nicely.There are more options out there but for the money this is the best option for me. I'm usually hard-to-please and persnickety when it comes to electronics so this is saying a lot.Perfect gift for anyone with a TV and a smartphone and/or tablet.", "verified": true, "helpfulness": "0/0", "author": "T. Alfonso \"TyroneAlfonso\""}, {"rating": 5.0, "review": "Love watch movies and videos (Youtube, Netflix and Viki) from all my Samsung devices (Sansung Galaxy S3, Samsung Galaxy Tab 8.9 and Samsung Galaxy Tab 3 7\").It took  7 minutes to installed and sincronized the Google Chromecast with my TV and my devices. Easy and works great!. While I'm use my device to see movies, my device battery is not discharged easily.The important thing is, if you have a great speed internet coneccion you won't have problems watching videos.You have to have a wireless connection to connect your Google Chromecast.I connected to my HDMI's TV, then I connected to the energy power, on my device I looked at yhe WiFi connections and appeared the name of your Chromecast, you select it and wait to sincronize. Easy!Still there are not many applications, but for what I need, it works perfectly.", "verified": false, "helpfulness": "0/0", "author": "Krisstyro"}, {"rating": 5.0, "review": "I find it rather annoying that people will give this 1 star because, for example, Chromecast does not support Amazon Instant Video yet.Seriously? Did it claim to support Amazon Instant Video when you bought it?? There are many critical and unfair reviews for this product, in my opinion.What you get is a product that can (and will in time) stream media that is currently being viewed on your mobile device or Chrome Browser and allow that media to be played through your TV by casting it to your Chromecast. Plain and simple.Setup went fine.When using supported apps such as Netflix, Pandora, and Google Music, it worked seamlessly and flawlessly. The media arrived on my TV screen within ample time and the quality was excellent. The tab-casting is a little slow, but works. Streaming media off of your computer with the RealPlayer cloud was a good solution, but would not stream full HD 1080 videos from my computer, sadly.In between streams, the Chromecast has a lovely idle screen with scenic views and the current time displaying.You are also buying an ever-evolving product which will have more compatibility with more services in the future.In all, for $25-$35 you are getting a device that is capable of what most $50-$100 similar devices do. It is a little limited in that it does not have the 100's of worthless 'channels' provided by Roku, but It's worth skipping the silly Roku controller and using your smartphone or tablet as the controller. Roku has an app for this, apparently, but Chromecast gives you the flexibility of controlling and browsing for what you want while in the Native app environment in the app created by the content provider.And...It's only about $30.When you consider the price-point AND YOU UNDERSTAND WHAT THE DEVICE DOES AND DOES NOT DO WHEN YOU BUY IT, it's a great product.", "verified": true, "helpfulness": "1/2", "author": "Dustin"}, {"rating": 5.0, "review": "This is one of my more useful purchases. The Chromecast is easy to install and to use. If you are tired of looking at Videos and Movies on your laptop or Mobile Phone. Then you should definitely pick one of these up. No subscriptions needed and if you have Netflix or Hulu then you can play them from you laptop and eliminate the need for cable if you don't watch a lot of TV.", "verified": true, "helpfulness": "0/0", "author": "William Bowman"}, {"rating": 4.0, "review": "its amazing it works perfectly the only bad thing I have found is that it works mediocre when I want to project my laptop desktop in my TV.for example if I have a downloaded series in my computer, then when projected it looks a bit slow and Audio is not synched. But for use with the web (YouTube , Netflix etc) it is a 10! Good buy for the price without any doubt", "verified": true, "helpfulness": "0/0", "author": "Pedro Esteban Sanchez Jimenez"}, {"rating": 2.0, "review": "Well we bought this. Only has Netflix, and YouTube. Freezes Netflix on the iPad. IPhone works OK. Cannot load on the Kindle f  're. Cannot load on my Nokia Windows phone either My Nintendo  had allot more apps loaded on it. Maybe the Apple TV will be better.", "verified": true, "helpfulness": "1/1", "author": "Howard Buckalew"}]