[{"rating": 5.0, "review": "I can watch net Felix,shows amazon,play gamessearch tv shows moviescan be moved to other tvs pcMuch have", "verified": true, "helpfulness": "0/0", "author": "Debby lathrop"}, {"rating": 5.0, "review": "Very easy to set up.  LOVE being able to watch series from the first episode to the last. Easy to find the shows/movies I'm looking for.", "verified": true, "helpfulness": "0/0", "author": "Cynthia"}, {"rating": 4.0, "review": "Love my Fire TV. Only a couple things I don't like... You have to use hdmi. My projector has VGA, RCA and S video input jacks.. You CAN NOT use a adapter to to convert from hdmi to  anything else. Another downside is the voice search. It is strictly for amazon. If you are watching Netflix, YouTube or any other, and you use the voice search, it takes you back to amazon. Don't let these \"cons\" discourage you!!! If you are using an HDMI capable tv, you are going to love fire tv. For such a tiny box, it does big things!!!", "verified": true, "helpfulness": "0/0", "author": "Earl"}, {"rating": 5.0, "review": "Works better than Rocu. The voice search is a time saver. The videos streaming is great.If you like games, the android gaming is really the best function. You must to get one of the controllers. Not a lot of selections at first but more have been added. The games are not expensive.", "verified": true, "helpfulness": "1/1", "author": "John Barden"}, {"rating": 4.0, "review": "First I must state that I own everything Apple including two Apple TV's (3rd gen), with that said I purchased the Fire TV for one reason and that's because the Amazon app on my Samsung TV sucks, the sound kept going out.I found the Fire TV very easy to setup (5 min) I'm not using the Wi-Fi I'm using a hard connection, with my experience Wi-Fi won’t give you a true streaming experience with the possibilities of interference.  Compared to my Apple TV's the Fire TV loads very quickly and is easy to navigate I like the voice search very much and I like the fact that I can download apps.I am pleased with the quality of service, but one thing that would be a big help is if Amazon would separate the Prime movies and TV shows from those that you rent.  I have a Netflix account also and I guess since I'm so used to the Apple TV I like that layout better but I won’t let that stop me from using the Fire TV for Netflix when I have it on.The one problem I am having with the Fire TV is the Dolby Digital Plus surround sound, when I have it on with HDMI selected for the output I lose all sound for movies and tv shows, it worked on one show then went out I still had sound for the interface, I had to change it back to the default normal sound settings so I could hear what I was watching.All in all I would recommend the Fire TV, I still like my Apple TV and will get a new one when that comes out but for everything Amazon I am enjoying the Fire TV being a Prime member makes it worth it.", "verified": true, "helpfulness": "2/2", "author": "Chad Geiser"}, {"rating": 5.0, "review": "Goodbye Direct TV and $110.00 plus a month bill and Netflix too..... HELLO AFTV !Fire TV is so easy to use, fast, excellent pic quality and clean Audio. Its TV when you want, how you want and if you want - its like you're your own TV Station manager !And commercials ? Whats that? ????Best Bang for the Buck in a very Long Time !", "verified": true, "helpfulness": "2/2", "author": "Mark Padilla"}, {"rating": 5.0, "review": "I love this!  Far better than any other in its class.  CRUSHES the Roku!!The voice search is incredible!  Worth every penny!", "verified": true, "helpfulness": "1/2", "author": "J. Petner"}, {"rating": 3.0, "review": "We bought the Fire TV to more easily watch Amazon content on our HDTV.  Until now, we've been hooking up our laptop to the TV and suffering with clunky cords, lousy volume control, forgetting to shut off the laptop screensaver, etc.  The Fire TV makes watching streaming videos from Amazon a breeze.  We definitely enjoy the voice-search technology and it works very well.  Navigating the Fire TV device overall is very intuitive.  Set-up was a snap.On the downside, the content is somewhat lacking; we are looking forward to the HBO offerings at the end of this month. My kids are disappointed that the games they have on their Kindle Fires cannot be played on the TV without purchasing the extra game controller.  The streaming music feature and photo-viewing is nothing fancy; I've been able to do that perfectly well on our laptop, phones and tablets.Overall, it makes additional content available to us for viewing on our TV -- as opposed to a smaller screen -- which is nice when we want it.  I believe in the three weeks we've owned the Fire TV we've used it twice.", "verified": true, "helpfulness": "1/2", "author": "Mrs. ReesesPieces"}, {"rating": 5.0, "review": "I have been a fan of streaming boxes for a while and have tried them all.  Google TV, Apple TV, Roku, Fire TV, and even sideloaded apps to make my OUYA Stream...  With all the new Amazon Prime content announcements I wanted something to do amazon instant video a little better (While able to stream my netflix)How does the fire TV rate?  EXCELLENT!  Fire TV has a great Google TV feel about it but a much easier to use interface.You can tell the box is designed around amazon instant video, but it streams netflix and the others great.  I purchased the box though because my google TV could not do instant video except through the web browser.  With Amazons new agreement with HBO and with their new line of original series (Alpha House Season 2 and The After) coming out soon I wanted a device that worked great for Amazon Instant video!  THIS IS IT!!!  on the Roku Amazon feels very outdated (It works great however), and the same for the wiiu.Now that I have purchased the amazon fire TV the roku has moved to my bedroom.  The google TV has been unplugged (Mine hasn't been updated in years), the wii U is now jsut for games and the Fire TV is my main streaming box in my living room!For those using it for netflix, a lot of reviews for the netflix app says the app is outdated.  I can assure you that it is the same app on my google TV which is old! It works great however so don't let the old app fool you!  It is very easy to use and streams great!!!!GAMES:  I haven't tried games yet, The fire TV did pair great with my OUYA controllers.  And they work fine!  I will be ordering an amazon controller, or at least a bluetooth controller with the xayb buttons in the near future (Makes it easier to play when the controls show on the screen.  OUYA buttons are labeled OUYA)Overall I would highly recommend the fire TV.  Amazon Prime has some great things planned!!UPDATE 1:After a full day of use I can say I really like the firetv.  Overall, Amazon seems to be making my favorite tablets and now streaming box!  The kindle fire tablets are great!  and I sold my ipad and my samsung tablet shortly after I purchased my fire a year or so ago.  I can see the same happening for my rokus!  This amazon fireTV box really works and is great!I can say however, if you are not a prime user or don't use Amazon Instant video for anything you might want to look elsewhere for a media box.  Yes, the fire TV is very open and you can sideload apps, it has a native netflix app, and everything else BUT the home screen focuses very heavily on prime and instant video.  Prime has everything I need though and I have never really built my prime \"Watchlist\".  I went through my netflix watch list today and found almost everything on it, on prime and added it to my prime list!!  I would cancel my netflix subscription if it wasn't for their original programming!  Prime seems to have almost all I watch.  I highly doubt I will be using netflix much on my fireTV.Lastly, I have always rented my on demand movies from Amazon so again another plus for the firetv for meUpdate 2: Almost 6 months later and I use this everyday!!  Its still my favorite streamer!! and I have owned apple tv, roku, PS4, Wii U, and tvs with apps.. this is still the best", "verified": true, "helpfulness": "2/2", "author": "Devin Stephens (I Review, email in Profile)"}, {"rating": 4.0, "review": "I've enjoyed the Fire and would recommend it to my friends.  It's easy to use and has worked very well..", "verified": true, "helpfulness": "1/1", "author": "g.burr"}]