[{"rating": 5.0, "review": "Amazing! I love this product!", "verified": true, "helpfulness": "0/0", "author": "Amnova"}, {"rating": 5.0, "review": "This little device is pretty awesome.  Just be sure to check out the more than just the 'featured' apps on the chrome site.", "verified": true, "helpfulness": "0/0", "author": "Jonal T Coleman"}, {"rating": 4.0, "review": "Pros:1. Relatively inexpensive ($35) compared to other options (Roku, Apple TV,...)2. Easy to setup (takes only 5 min)3. Can control using multiple devices (smartphone, PC, tablet) on multiple platforms (iOS, Android, Windows)4. Can stream anything on the Chrome browser (duplicating what's on screen)5. Can cue up multiple play items6. Doesn't consume battery on the smartphone (initiate streaming and move on to do other things or even put the phone in suspension mode7. 3rd party apps will continue to make this device more useful and will eventually allow streaming of anything on the PC or phone to the TV8. Tiny footprint that can easily hide away in the back of TV (if the TV has a USB port, then the device can be powered by a USB cable without a power supply connected to the wall outlet)9. Can connect it to an audio device/receiver and stream Spotify or Pandora continuously without turning on the TV- this is a very good feature!10. No additional service fee or subscription fee other than services that you choose to pay for (such as Netflix or Google Play)Cons:1. Doesn't support any local storage media directly (you can connect the storage media to your PC/laptop or smartphone and stream from there if necessary, though)2. No remote controller (you can use your PC/smartphone as a remote, though)3. ... can't think of any more cons!", "verified": true, "helpfulness": "0/0", "author": "Louie Meader"}, {"rating": 5.0, "review": "Wow, very very good product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"rubenx\""}, {"rating": 3.0, "review": "the product isnt fully realized yet and cast time is laggy to say the least", "verified": true, "helpfulness": "0/0", "author": "jada sharp"}, {"rating": 5.0, "review": "Perfect for streaming YouTube and Netflix. I own 3 now and plan to buy more!", "verified": true, "helpfulness": "0/0", "author": "Kyle griffin"}, {"rating": 3.0, "review": "I was expecting more: it is not very fast and produces a lot of heat even when I do not use it.", "verified": true, "helpfulness": "0/0", "author": "pasquale Mazzotta"}, {"rating": 1.0, "review": "Totally sucks, stick with Roku or Apple TV", "verified": true, "helpfulness": "1/1", "author": "justacustomer"}, {"rating": 3.0, "review": "Okay for the price. When I preordered it, google said it would show photos on the tv, but they changed it. It's ok for what it is, but I'm disappointed. We also cancelled netflix after we installed this, and it won't work with amazon prime. I guess we'll have to get a roku.", "verified": true, "helpfulness": "0/0", "author": "Sbmargo"}, {"rating": 5.0, "review": "Fast service and love this product! Thanks", "verified": true, "helpfulness": "0/0", "author": "Dawn"}]