[{"rating": 2.0, "review": "I have a kindle Fire and the Chrome Cast is NOT compatible with that. I had to make shift a work to get it to work from my Kindle. Very disappointed especially after seeing what the Apple TV had to offer... If you want to stream Netflix and Hulu Chrome cast is fine. Any more that Chrome cast just won't do it!", "verified": true, "helpfulness": "1/1", "author": "stvbrtn"}, {"rating": 4.0, "review": "My husband wanted this and it works well with Netflicks and YouTube.  We had an issue when it was updated, but we used the settings to get us back to factory settings while they fix the glitch.  The one thing that is not as good is broadcasting from the browser, not an app, is often shaky.  Hopefully this will work out as more people have it and the updates come through.  All in all, the hubby is happy and we are having fun catching up on movies and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Colleen E. Cunningham"}, {"rating": 5.0, "review": "I love this little dongle.  I use it along with a Nexus 7 to play Netflix and Youtube videos on the TV, and it works seamlessly. I've been using a Roku box for quite a while but I prefer using the tablet as a remote controller, and would use the Chromecast exclusively if only Amazon Prime would play nice with Google. In the meantime, the Roku box is still plugged in along side the Chromecast for a more extensive selection of streaming video options.", "verified": true, "helpfulness": "0/0", "author": "A. Arthur \"Al the webmaster\""}, {"rating": 5.0, "review": "Works like it promises to work! Very cool. And easy to set up. I liked it so much that I bought 3 more as Xmas presents.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It was almost as easy to setup as their adds.Not enough free, compatible sites available yet, just netflix & youtube.I don't plan to use it until the former is expanded.", "verified": true, "helpfulness": "0/2", "author": "Mauri Luci \"Ickey\""}, {"rating": 5.0, "review": "It's very cool, I like it. Bought two one for me and my son. He likes it a lot too.", "verified": true, "helpfulness": "0/0", "author": "Durk L."}, {"rating": 4.0, "review": "Very easy to setup, no more messy cable connecting pc/laptop to TV.Only downside is limited support of apps. I am a iphone user. Thus limited choice. Also the place I live doesn't have Netflix. I only make good use of the youtube apps.", "verified": true, "helpfulness": "0/0", "author": "Dessie \"middle way\""}, {"rating": 1.0, "review": "Wouldnt set -up with my Cisco router, very disappointed. tried  it 3 different ways,,with my laptop.ipad.iphone.will return today asap", "verified": true, "helpfulness": "0/1", "author": "SL \"TV MAVEN\""}, {"rating": 5.0, "review": "Google Chrome cast is easy to use and loaded with cool stuff I believe everybody will want one once they had a chance to see all the features and all you can stream to your tv", "verified": true, "helpfulness": "0/0", "author": "Patrick Greene"}, {"rating": 3.0, "review": "easy to set up --- works with Youtube only in India. They need to add more contents sites.May be next year model!", "verified": true, "helpfulness": "0/0", "author": "Manohar Arora"}]