[{"rating": 5.0, "review": "An amazing device, and now many android apps support it - super useful!", "verified": true, "helpfulness": "0/0", "author": "Randy Baker"}, {"rating": 5.0, "review": "Love ut", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Stop working in just 2 months..it was working great but now I can't connect..invalid format error", "verified": true, "helpfulness": "0/0", "author": "pranav patel"}, {"rating": 5.0, "review": "The only streaming stick I'll ever need. All of the major providers are on here, but I only use Netflix, pretty much, so this little stick has me covered. This is a great streaming media player and is compatible with almost any of the modern TV's.", "verified": false, "helpfulness": "0/0", "author": "Ed Norton"}, {"rating": 4.0, "review": "i have 2 roku3s i like much better, plus a roku stick i like better. roku just has more choices. im sure google will catch up, but they need to hurry", "verified": true, "helpfulness": "0/0", "author": "steven lapham"}, {"rating": 1.0, "review": "I bought this on a lark.  I don't like it.  We have used it to watch a few movies, but the user interface and lack of features just seems awful to me.I did learn that I don't like having to pull out my iPhone or iPad, start the app, wait for it to sync with the Chromecast just to pause a movie.Lesson learned for when they try to sell me a light switch interface on my iPhone.  It does play netflix as advertised.  But again, not in a way that I really enjoy.", "verified": true, "helpfulness": "0/0", "author": "dpg \"tiercel3\""}, {"rating": 1.0, "review": "Sadly, this device did not work. Plugged it in and set it up. Problem was it would not display the home screen. Eventually got it to play audio, but no video. Tried updating TV software, but then TV stopped recognizing the device. Tried several Google support solutions, but nothing worked.", "verified": true, "helpfulness": "0/0", "author": "darksilence"}, {"rating": 4.0, "review": "Very good product , good quality", "verified": true, "helpfulness": "0/0", "author": "fer"}, {"rating": 5.0, "review": "The chromecast is the best value!The amount of things I can do on this little dongle is amazing!I love casting my phone, computer, Hulu, Netflix, and Plex to my TV. Why spend hundreds more on a smart TV when this makes your dumb TV more intelligent than ever.When my wife goes to the neighbor's house to watch True Blood, all she has to do is take this little dongle, plug it into their TV and the rest is done from her phone! It is very quick and easy to take the shows and movies you love to any screen.The biggest downside to the chromecast is no option for a password. My wife and I went to a resort and took this along so we didn't have to pay extra to watch movies in our hotel room. Everyone there at the resort were inadvertently casting their youtube videos to our chromecast. It got very annoying and it wasn't worth it until all the little kids went to bed.", "verified": true, "helpfulness": "0/0", "author": "Jeffy"}, {"rating": 5.0, "review": "Simple, effective.", "verified": true, "helpfulness": "0/0", "author": "jwf"}]