[{"rating": 5.0, "review": "So far I'm loving the Chromecast. I plug it in to the HDMI Out port of my Logitech Google TV. Works great when streaming from my laptop for Amazon Prime and the paid Hulu service. It doesn't work so well when trying to stream from my Droid X2. Hulu says their app works on Android but even after contacting Hulu support they have not provided a solution, only promises (at the time of this writing it's been over a month since requesting support from Hulu. I'm not holding my breath).We often watch TV in the bed room which, for me it's inconvenient to carry my laptop back and forth, so it would be nicer if I could stream everything from my smart phone rather than the laptop.", "verified": true, "helpfulness": "0/0", "author": "Leonard Parker"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Jerrod"}, {"rating": 4.0, "review": "It's so easy and helpful, but the applications which works with it, not enough", "verified": true, "helpfulness": "0/0", "author": "Majed"}, {"rating": 1.0, "review": "Not at all what I thought it was.", "verified": true, "helpfulness": "0/3", "author": "dan may"}, {"rating": 5.0, "review": "excellent value  Easy to use and set up.", "verified": true, "helpfulness": "0/0", "author": "David Stox"}, {"rating": 4.0, "review": "works well enough. i like it best with nexflix. have recommended it to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Michael Hall"}, {"rating": 5.0, "review": "very usefull", "verified": true, "helpfulness": "0/0", "author": "shuki"}, {"rating": 5.0, "review": "Got it as a gift for my brother last year and it work wonderfully. It is easy to use and sync very well with other devices.", "verified": true, "helpfulness": "0/0", "author": "BLAUJ"}, {"rating": 5.0, "review": "This product worked fine until a upgrade on my apple router and now will not work. Worked fine before.", "verified": true, "helpfulness": "0/0", "author": "Robert and Claire"}, {"rating": 5.0, "review": "i wish it would be more optimize with overall capturing your screen and having more apps it can be relevant with, but only time can tell it can progressively get better. it is a google product overall im going off to college next year and it will be a great tool and i will use it all the time.", "verified": true, "helpfulness": "0/0", "author": "dangelo acevedo"}]