[{"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Ricardo Sanchez"}, {"rating": 4.0, "review": "Only negative - W/O a wirekess repeater, I cant find out how this may be used in a hotel.... Besides that, this is the sort of product that just works.  This makes the idea of \"Plug and Play\" a reality.", "verified": true, "helpfulness": "1/2", "author": "Michael Wolenetz"}, {"rating": 4.0, "review": "It works fine but where it has to be in a different \"channel\" than the surround sound system you can't use both at the same time...bummer!", "verified": true, "helpfulness": "0/0", "author": "Perla Hernandez"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Hussain"}, {"rating": 5.0, "review": "Great as anything ever invented from Google! Extremely happy with it!", "verified": true, "helpfulness": "0/0", "author": "Eduardo A Martinez"}, {"rating": 5.0, "review": "I bought 2 of these, and gifted one. The more I learn about it, the more I like it. I currently own an iPad, and can cast some apps directly to my television, but I think my next phone / device will be Android. I like the open environment and customization options, plus an Android phone or tablet can stream its screen to the TV using the chromecast.  Very cool.  I see more of these in my future as I slowly begin to 'cut the cord'. Thanks Google.", "verified": true, "helpfulness": "0/0", "author": "Bob G."}, {"rating": 1.0, "review": "Waste of money it's not really what i expected from HDMI streamer. your computer has to have a WiFi adapter into it so i had to use my laptop witch i was ok with but didnt have as much videos as my desktop. I had to have google chrome installed included with their wifi program.. but even though the video were streaming they were very choppy and limited to 720p even though the video was 1080p and the built in apps were just apps i never want to use....waste of time and money :/ I would just buy a Wireless HDMI Video Transmitter...witch by the way work for consoles and any PC.", "verified": true, "helpfulness": "1/4", "author": "Danny Guerra"}, {"rating": 5.0, "review": "Works per spec. Got a USB cable and power outlet.", "verified": true, "helpfulness": "0/1", "author": "Tal Eretz-Kdocha"}, {"rating": 5.0, "review": "Need more things tho but it good", "verified": true, "helpfulness": "0/0", "author": "Justin Martinez"}, {"rating": 5.0, "review": "Love, love, love this!!  Very simple to install - plug and play.  Getting Pandora on my TV is great.  Also, it cycles through my pictures on my phone and puts it on the TV as wallpaper.  And, of course, I don't need to mention steaming Netflix and Hulu movies straight to the TV.  Best buy ever!", "verified": true, "helpfulness": "1/1", "author": "Suzanne Sheath"}]