[{"rating": 5.0, "review": "Amazing product!", "verified": false, "helpfulness": "0/0", "author": "Darwin J."}, {"rating": 5.0, "review": "Turned my dumb tv into a smart tv. Cool features for a good price", "verified": true, "helpfulness": "0/0", "author": "brian flynn"}, {"rating": 5.0, "review": "This is the most amazing invention ever, I love it!", "verified": true, "helpfulness": "0/0", "author": "Amalik"}, {"rating": 4.0, "review": "The device is a little complicated to install but has worked great ever since. Much easier than going try the X. Box.", "verified": true, "helpfulness": "0/0", "author": "G. Lalli"}, {"rating": 5.0, "review": "Very good!", "verified": true, "helpfulness": "0/0", "author": "Priscila harder Ferreira f de campos"}, {"rating": 4.0, "review": "I use this device to stream home videos,  tv serials,  movies and travel photos.That's it. I Don't use it for youtube / gaming, or the myriad things this device is capable of doing.And IMHOSound quality needs improvent. streaming / buffering falters sometimes if a human briefly walks in between the transmitting phone and the receiving tv.But make no mistake.  For the price,  this is a product worth buying.If u need more functionality  and superior performance  then spend more and buy the nexus Tv instead", "verified": true, "helpfulness": "1/1", "author": "It's me."}, {"rating": 3.0, "review": "Hulu plus now required for streaming that app - not windows phone friendly.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 1.0, "review": "could not install required altering channels waste of time and money.", "verified": true, "helpfulness": "0/0", "author": "L. Dunn"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Teri Davis"}, {"rating": 1.0, "review": "totally useless. was only able to connect with my android and would only connect to YOU TUBE and nothing else. its to much trouble to return so I'll take my losses of $35.00 dollars . amazon should take it off their site and save their reputation for handling quality products. this junk.", "verified": true, "helpfulness": "0/0", "author": "mikie v \"wingin it\""}]