[{"rating": 3.0, "review": "My only problem with the fire tv is that had I known that being under prime thru my brother in law I wouldn't have acess to the prime movies I probably wouldn't have purchased", "verified": true, "helpfulness": "0/0", "author": "Bridget I. Mcsweeney \"Lovestoread\""}, {"rating": 5.0, "review": "This is a great product other then the voice part has not worked but everything is great.", "verified": true, "helpfulness": "0/0", "author": "MRROB"}, {"rating": 5.0, "review": "Awesome, easy to use!  Lots more viewing choices than cable cos.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 5.0, "review": "this is great.", "verified": true, "helpfulness": "0/0", "author": "Judy F."}, {"rating": 1.0, "review": "I bought this July, 2014.  Worked great for a few months.  Now it's a paperweight, when I turn it on all I get is a bright green screen, which goes to black after a few seconds.  That's it.  No menus, no way to navigate anything.  It doesn't work.  I've unplugged it, plugged it back in, tried pressing and holding back and fast forward buttons on remote for a few seconds, thinking that might reset the unit.  That didn't help either.  It simply doesn't work.  Waste of money and time.", "verified": true, "helpfulness": "2/5", "author": "O"}, {"rating": 5.0, "review": "This handy device has removed the need for a cable box and added the convenience of Amazon instant vid., netflix, Hulu Plus, apps and more. The parental controls are great for supervising what my kids watch when i am not around.", "verified": true, "helpfulness": "0/0", "author": "Peter McGuinness \"DIY'er\""}, {"rating": 5.0, "review": "Wonderful and easy to set up.  Really enjoying it.", "verified": true, "helpfulness": "0/0", "author": "HippieChick"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Carlos Uribe"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "KYEONGHOON JIN"}, {"rating": 5.0, "review": "Need one for every TV in the house. Awesome.", "verified": true, "helpfulness": "0/0", "author": "Dadelous"}]