[{"rating": 3.0, "review": "I purchased this produced so I could watch videos from my laptop.it seems the quality of viewing is not as good as viewing directly from the laptop.  The viewing was somewhat choppy and sometimes the action was ahead of the lips moving.I haven't used a whole lot so I will continue using to see if perhaps it was just my internet connection (which is always exceptionally fast) or if it is this product.", "verified": true, "helpfulness": "0/0", "author": "relm"}, {"rating": 5.0, "review": "I love this device, the picture quality is superb.  There is no buffering (stopping, starting) during my streaming movies.  The price at $35 is awesome!  My old Sony Blu-ray was driving me nuts whenever I was watching Netflix or Amazon Instant, sometimes having constant loading issues.  My chromecast works perfectly and I'm so glad I bought it!", "verified": true, "helpfulness": "0/0", "author": "L. Purvis \"Mom in Virginia\""}, {"rating": 4.0, "review": "I love what it does. Got rid of cable/sat tv and just use hulu, netflix, plex now. 5 minute easy setup. Easy use. Rarely needs a reset. Minor drawback is that it requires additional power if you mounted your tv and not sure if it can use 5GHz band on my router. Overall its a solid 95 out of 100.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Google Chromecaat is just what I needed to be able to watch on line shows like Netflix and You Tube on my tv.", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "I have found the mobility of this is great for RV camping.......... not mention it's full time use at home.", "verified": true, "helpfulness": "0/0", "author": "promuf"}, {"rating": 5.0, "review": "For the price, this cannot be beat.  One in each room with a compatible TV.  Hooked up to Plex media server.  Wonderful.", "verified": true, "helpfulness": "0/0", "author": "Daniel Kerwood \"Daniel\""}, {"rating": 5.0, "review": "Great product. I bought 4 of them and they are all working great.So much better than Apple TV,Sony Streamer,Roku, etc.", "verified": true, "helpfulness": "0/0", "author": "Jose Perez"}, {"rating": 5.0, "review": "This is our second chromecast. We love it. Makes watching netflix so easy. Can't wait for them to add more apps with the ability to cast to tv! Very happy with this purchase. For $35 we basically have a smart tv!", "verified": true, "helpfulness": "0/0", "author": "Lauren"}, {"rating": 5.0, "review": "Its really helpful specially for those who wants to make their computer manager other functions. Product design is just fine, it can be improved.", "verified": true, "helpfulness": "0/0", "author": "Pakalapatty Raju"}, {"rating": 5.0, "review": "Google Chromecast is the wave of the future. Amazing Amazing and AmazingI own four of them . We hardly watch cable TV anymore  . It's a must .....", "verified": true, "helpfulness": "0/1", "author": "Aarron S"}]