[{"rating": 5.0, "review": "EXCELLENT", "verified": true, "helpfulness": "0/0", "author": "Juan Sebastian Cura"}, {"rating": 5.0, "review": "I use this every day to watch Netflix.  Would be nice if Amazon Video supported Chromecast (hint, hint).  You can still watch Amazon video, but you have to cast the entire tablet (Android) which is some times glitchy compared to casting directly from the application.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Easy peasy lemon squeezy! It was easy to set up and works like a charm. the only problems I've had were once (but only once) in the last month, it stopped syncing with my phone mid movie, but it was because my internet was on the fritz. Also, I have this in my room and a Roku stick in the living room and I do miss having a remote when I use this. It's just annoying when I want to pause or switch movies to unlock my phone. Lazy person's problem, but something to consider.", "verified": true, "helpfulness": "0/0", "author": "Lucy Momoh"}, {"rating": 3.0, "review": "I'm disappointed in the Google Chrome.  I found that you cant connect to the Amazon site to watch movies!!  I also own a Roku which has so much more to offer.  I bought the Chrome hoping to stream movies from my desktop to the TV, only to find its not possible.  At least with my setup.  Seriously considering returning it.", "verified": true, "helpfulness": "0/1", "author": "Sassy"}, {"rating": 5.0, "review": "This is a great device. Very happy.", "verified": true, "helpfulness": "0/0", "author": "UTPAL DATTA"}, {"rating": 5.0, "review": "So nice when on line there's an icon that cues you to link to your tv. You can also access HBO GO and SHOWTIME", "verified": true, "helpfulness": "0/0", "author": "Strengthguy"}, {"rating": 5.0, "review": "It is inexpensive and does what it says. It sends anything in Chrome to your TV. Don't confuse it with something that does anything else. If this is your expectation, you will be pleased.", "verified": false, "helpfulness": "0/0", "author": "Josh Hunt \"Author, Good Questions Have Groups Talking\""}, {"rating": 5.0, "review": "Best device ever.", "verified": true, "helpfulness": "0/0", "author": "Clayton Bellam \"WeirdMan\""}, {"rating": 3.0, "review": "OK", "verified": true, "helpfulness": "0/1", "author": "john garman"}, {"rating": 5.0, "review": "I love this chromecast! This is awesome! We can watch any movies from my tab to our tv. It shipped on time, I never had problem with this chrome. Thank u amazon!", "verified": true, "helpfulness": "0/0", "author": "D Jason Traudt \"D Traudt\""}]