[{"rating": 5.0, "review": "great it is like to have your google tv", "verified": true, "helpfulness": "0/0", "author": "andres"}, {"rating": 3.0, "review": "It's just okay. Streaming from your browser (Amazon Prime Video or something like that)? Full screen not available. Apps are plentiful, but are not any that I don't already have on my Smart TV.  An HDMI cable is more useful.", "verified": true, "helpfulness": "0/0", "author": "D. Jones"}, {"rating": 5.0, "review": "I never enjoyed watching TV more! This small and inexpensive device gives me FREEDOM to watch all I want, on my own TV, without needing a computer. Perfect for watching YouTube movies.", "verified": true, "helpfulness": "0/0", "author": "Aleksandr Treyger"}, {"rating": 4.0, "review": "I use it daily and love it, but it doesn't work on everything, like Hulu.", "verified": true, "helpfulness": "0/0", "author": "jim harris"}, {"rating": 5.0, "review": "Best product ever. Simple to setup, works seamlessly across all devices and I have recommended this to tons of my friends and never heard a complaint.It was little buggy on other devices initially but with the various updates it's much better.Wish they could keep the price to be 25$.", "verified": true, "helpfulness": "0/0", "author": "Pavan Kulkarni"}, {"rating": 5.0, "review": "This is a great device.  Use it to watch on your tv anything you can bring up on the google chrome web browser.  Use it to watch you tube and vevo and netflix and hbo and a variety of other things.  Control it from your phone or tablet or computer.  A great way to modernize your (or your smart phone literate parents) tv.  Also good for making your semi-smart tv a fully smart tv.Easy to use, easy to set up, just plug into your tv's hdmi port (also has to be plugged into a power source with the ac adapter unless your tv has a power providing hdmi port which most lack).Great for travel too.  Just plug it in and show movies to your friends and boring relatives.  Use at hotels.  Fun for amazing folks who have no understanding of technology.  (\"But where's the movie coming from?\")The one flaw, which I think google will fix eventually, is that you can accidentally (or purposely) log on to other chrome casts.  So if you have several of them in your house you can change other people's movies while they're watching.  (Was I ever annoyed when my roommate turned off the game of thrones season finale) You can also do the same to your neighbors.  But google is smart and the google cast gets operating system updates.", "verified": true, "helpfulness": "0/1", "author": "Pollyessster"}, {"rating": 5.0, "review": "I was a complete skeptic. Works wonderfully even with 2 mbps service. I'm sure it would be even better if I was on at least 6 or 7.", "verified": true, "helpfulness": "0/0", "author": "Tommy D \"TD\""}, {"rating": 5.0, "review": "This device is amazing.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "I love the Chromecast, its a great and cheap gadget", "verified": true, "helpfulness": "0/0", "author": "Nestor"}, {"rating": 2.0, "review": "I guess I didn't read throughly or something.  I was hoping that I could use it to share what is on my monitor/tablet, with the TV screen.  That's not the case.  So, although the product was very reasonably priced and somewhat easy to set up, it's very limited on what you can connect from your source to the screen.  Once connected it's pretty cool, but it's not what I thought I was purchasing.", "verified": true, "helpfulness": "0/0", "author": "Bethilda"}]