[{"rating": 5.0, "review": "This thing is great! I have a Sony Google TV box (Paid over $300 for it 2 years ago) and this thing can do a lot of what it does. I use it with my mac to make my TV my computer screen. Its great with watching videos too. This is a must buy!", "verified": true, "helpfulness": "0/0", "author": "RobSegura82"}, {"rating": 1.0, "review": "Chromecast seemed like it was going to be an AWESOME gizmo to play and share videos easily from your mobile devices and computers.Google seems pretty determined to make sure that isn't going to happen.We're about two hours into troubleshooting it, and thus far:* Youtube and Netflix work really well out of the box.  No Setup required* Our home videos won't play* Audio won't work on .mkv movies via torrents* Amazon Video (ie, Silverlight) is not supported* There were several players indie developers made to fix the above problems (like Fling and others), but Google has blocked themChromecast is an under-functioning, quirky, finicky gizmo. It won't play any local videos.  It does well with Netflix and Youtube.  But my Blu-Ray player, Wii, WiiU, and PS4 all do Netflix really well.  So really what we have here is a $40 Youtube machine.", "verified": true, "helpfulness": "2/4", "author": "Steak"}, {"rating": 5.0, "review": "This may be what Google and Apple need to get into the living room because people dont want another box and another controller but people are already using cell phones and tablets to do everything, why not control your TV content.  Anything on Chrome web browser can be sent to this unit, or on You Tube, NetFlix and the apps continue to grow.  Great job Google!", "verified": true, "helpfulness": "1/2", "author": "Jonathan Coker"}, {"rating": 2.0, "review": "I just don't see the value in having it.  Not yet at least.  It just doesn't seem to offer much if anything.  It's far from even touching my Roku and don't ever really seeing it doing much other then emulating my laptop or mobile devices screen.  Yeah it must be me because I just don't sees the point.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wish I got it sooner.  It's great using it to watch youtube and viki directly on my tv.  Would be great if amazon instant stream would work with it.  Easy to use.  Considering getting more for my other rooms in the house.", "verified": true, "helpfulness": "0/0", "author": "minimint83"}, {"rating": 1.0, "review": "The reception on this device is terrible even with the dongle.  We have a 100  Mb/s internet link so I know that wasn't the problem.  While playing a Netflix movie it would pause and download every 5 min.  The chromecast app only worked on our two Android tablets intermittently.  I want a refund.  Shame on you Google.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Good concept but will not work with Air Express which we use as our router so... $35 poorly spent in this case.", "verified": false, "helpfulness": "0/0", "author": "James H. Long Jr. \"JHL\""}, {"rating": 2.0, "review": "As several users have already noted, this product is very frustrating since it easily stops working.  Using an undocked laptop, the  Chromecast installed well and worked great for a short while.  Then I docked the laptop, and the Chromecast dropped out.  No matter that my network connections were all still intact and my laptop was functioning perfectly.  The Chromecast application couldn't find the device on my wireless network, even though my TV was displaying the Chromecast screen which said that it was on my home wi-fi network and ready to cast.After half an hour of retracing my original steps to install the device, it started working again.  Only to fail again when I moved the laptop a little too far from the Chromecast.  I moved the laptop back near the Chromecast, but that didn't help at all.  Another 20 minutes of reinstalling, re-connecting to the network, and magic incantations, and the stupid device started working again.Performance is good when the Chromecast is working, but since you can't rely on it to keep working, it's not worth the headaches.", "verified": false, "helpfulness": "0/0", "author": "D. Schultz"}, {"rating": 4.0, "review": "I have read so many mixed reviews and thought for something that costs less than lunch, I would put it on my Christmas list.It's worth 4 stars simply because it works with Plex, no issues whatsoever. Plus Netflix looked great and both streamed in HD with no issues whatsoever.Judging this on it's Chrome browser function is not really fair as the developers fully admit that it's still in Beta. I was able to stream Chrome from my computer, with video and sound, but it was choppy and the audio was slightly out of sync.I own Roku, Boxee and Google TV,  compared to these Chromecast cannot be beat price wise , if you want a simple Plex, You Tube and. Netflix streamer this is for you....if you want more bells and whistles, go with the Roku 3, but be prepared to fork out more than twice the price of Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Andrew I. Munro Sr."}, {"rating": 5.0, "review": "Got this for my husband and well us really.  LOVE IT.  Wished I would have known first it is not compatible with Apple products.  It is also not compatible with Amazon videos.  Works great with netflix though.....", "verified": true, "helpfulness": "0/0", "author": "Amber Klein"}]