[{"rating": 5.0, "review": "I love this product so much, that I have purchased three of them! My Time Warner Cable bill was getting outrageous. So after much research (took a year to decide) I dropped cable and chose the Amazon Fire. This is great! I can choose what I want to watch, when I want to watch it and access to 10,000s different choices. I'm really not a big tv watcher. But when I do I want it to suit me, not be by dictation of someone else. It's opened my world to so many different concepts. I now see a huge variety of documentaries, music, indie films, more choices for my grandchildren, recipes, exercise programs, real time views of the world; I could go on and on! And it's a piece of cake to set up.There are a few down sides; current CBS shows are not available. I do believe that CBS is being greedy. If you stream them through your phone, computer or tablet you know have to pay a fee for the app. And that's not on Amazon Fire as of yet. But the few other primetime shows I do watch, I watch through HuluPlus. So I purchased an HD antenna for my tv and have no problem getting local channels and network tv. So I watch the two CBS shows I enjoy when they air.Another down side, not being able to watch sports live. Now I am not in any way a huge sports fan, but I do enjoy my Ohio State Buckeyes! Luckily this season, ABC has carried most of their games, but not all. But I'm sure in time, streamed TV will find a way to bring us live sports.There are three apps I have chosen to pay a monthly fee for: HuluPlus, Netflix and Gaiamtv. That takes my tv watching bill down to just under $30 a month. Saving me more than $125+ a month I was spending on cable! I am a Prime member which has benefits much further than the streaming! That really adds up. There are a few cable shows that I know people enjoy, such as Pawn Stars and American Pickers that you can't get the current episodes. But I do believe you can on your computer. I truly believe that this is the direction that tv watching will be taking in the future. I think cable should be shaking in their boots. Once we are able to affordably stream live sports , there will be no stopping this industry. After all did you ever think you would see Blockbuster disappear?", "verified": true, "helpfulness": "0/0", "author": "Tersa Morris"}, {"rating": 5.0, "review": "Works very smooth. The is very nice as well", "verified": true, "helpfulness": "0/0", "author": "ken"}, {"rating": 5.0, "review": "Easy set up.  Really enjoying Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Paula"}, {"rating": 5.0, "review": "Great. Easy to install and use. Voice search works very well. Looked at Apple TV and Roku but glad we made this choice.", "verified": true, "helpfulness": "0/0", "author": "Jimmy Trimble"}, {"rating": 5.0, "review": "THE BEST!!  So easy to set up and maneuver.", "verified": true, "helpfulness": "0/0", "author": "Craeshe"}, {"rating": 5.0, "review": "Good", "verified": false, "helpfulness": "0/0", "author": "yick man wong"}, {"rating": 2.0, "review": "the fire tv is slick and superfast. what it does not offer is competition to the appletv or roku. Both of those have thousands of apps and programs. firetv has less than 700. i bought it for the namesake (AMAZON) and thinking that they would quickly make up for the lack of programming and apps that they had. That has not been the case. I have had it for six months and have seen no tangible increase in apps. I'm disappointed. Mr Bezos- get back to work.", "verified": true, "helpfulness": "2/5", "author": "Amazon Customer \"flyingboujanero\""}, {"rating": 4.0, "review": "After returning the first one we received, the second one still did not work right out of the box. My wife spent a good bit of time on the phone with tech support, who were great - even though they didn't get it working either. Tech thought our tv might not be compatible with the Fire TV. My wife went through some additional troubleshooting after she finished with support - connected to an HDCP-compliant monitor, then was able to run the set up there - had to connect w/ ethernet cable to get an update, then set up WiFi (ours is encrypted), and finally was able to get it connected to the tv and working. Love it, but wish more documentation was included, and tips for troubleshooting.Note: if your TV is not HDCP-compliant, it will not work with the Fire TV. Also, if your WiFi is encrypted, try the setup with an ethernet cable first, to get any updates. My TV is HDCP-compliant, it just took some finagling to get it working.", "verified": true, "helpfulness": "0/0", "author": "Nathan Loveless"}, {"rating": 5.0, "review": "I am very happy with my FireTV. I did sideload xbmc but did not root. It is fast and responsive and is so much more crisp than my chromecasts.The only issue I have experienced is with the watchespn app (and I am pretty sure it is on espn's end and not amazon's) - I almost always have to reboot the firetv due to espn video staying with the buffering circle showing on screen.", "verified": true, "helpfulness": "0/0", "author": "karthwyne"}, {"rating": 1.0, "review": "What a pile of junk. Constantly buffering, had to unplug three times. Tried both bands on my wifi with same results. My sony media player.... no issues. Plugged it right back in to continue to watch a movie with no problems. You can have this damn thing back.", "verified": true, "helpfulness": "1/4", "author": "Marc W DeLano"}]