[{"rating": 5.0, "review": "I had one question buying this...  Can I stream video from the chrome browser?  YES!So those pesky Hulu shows that are website only?  Bam!  Casted!Those shows that are on SyFy and Spike that are website only?  Bam Casted!The quality is good, not great, but good enough for casual watching.Very Happy!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I got this on a whim when it was released for the reasons many have stated, like low price and streaming capabilities. Sadly I had to wait almost a month for it to arrive. One has to wonder why big companies come out with something that is supposed to be revolutionary and then don't build inventory before the initial release.Anyway. I got it and plugged it into my fairly new LG 55 inch TV only to find that I need to use the power adapter, apparently my 2 year old $2000 TV doesn't have the powered HDMI ports. Oh well no big deal, once I plugged in the power cord to the device and mains it was recognized and I set my TV to that input. It instructs you to log in on your computer or device to set everything up. That is when I found out that my main desktop computer that I use 99% of the time at home will not work with this device because I connect to my home network with a network cable instead of Wifi. I do have Wifi but mainly use it for my smartphone, tablet the occasional times I use my laptop at home. So I powered up the laptop only to realize I don't have Chrome installed as I use Firefox. Downloaded Chrome and waited for my slow laptop to do all of the Windows updates as I hadn't switched it on in awhile. Finally logged into the Chromecast setup site using the Chrome browser only to find that Windows Vista is not a supported OS! This kind of sucks!So I power up my Asus Transformer tablet and go to the Google storefront and download the Android App. Finally I open the app and do the setup and log into the Chromecast device on my TV. Wow, I am finally connected after just 45 minutes :(So, I try to figure out what I can do. Maybe I will listen to some music from my collection. I open Google Play and try to play some albums only to find it the device does not stream music from my tablet but only from the few things I have in the cloud.I had hoped that this device would me to stream from my main computer to the TV, looks like it will not do that.Next I opened my YouTube app on the tablet and was able to stream some videos from their to the TV. Not bad if the YouTube video you want to watch is of a high enough quality to look good on a 55 inch TV screen but if not it will look rather blurry.I don't have a Neflix account and  my TV already has streaming capabilities for that and VUDU built in.I can see some uses for this device but I am really glad I did not shell out any more then I did.UPDATED REVIEW 9/21/2013Well to my surprise Amazon sent me the Neflix free 3 month offer so I did get something not expected. I ended up moving it to one of the HDMI ports on my new Onkyo stereo system and that seems better than when it was just in the TV input. Now I can easily listen to music I have since added to my Cloud space. I think this would be a plus if I travel.In reassessing my initial review I have raised my rating to 4 stars.", "verified": true, "helpfulness": "3/7", "author": "ChrispyCreamy"}, {"rating": 5.0, "review": "I just got this (surprisingly, because it was out of stock) and I love it!  It was easy to set up.  We tested taking control of the system with several phones and computers.  Netflix worked great.  Finally we can show each other youtube videos without hovering around someone's phone.  The only thing that was a bit glitching was casting a website and watching a video on it through Google Chrome.  But otherwise, youtube looked great and netflix looked great.  I cannot wait for them to add Amazon Prime.Oh and no more remotes that can die or get lost either.I'm more than happy with it!  By the way, I also own two roku devices and would say that this device while lacking in channels has the potential to make the rokus unnecessary.", "verified": true, "helpfulness": "0/1", "author": "Heather Reid"}, {"rating": 5.0, "review": "This is was what I have been looking for. I can now use Netflix on any TV in my house and control it with an android device. Works great sending anything from your chrome browser to your TV.", "verified": true, "helpfulness": "0/1", "author": "pdidly34"}, {"rating": 5.0, "review": "I have had a Chromecast since they first came out.  It does what it is intended to do very well and works best from the supported App's on my N7 & N4.As mentioned, casting tabs or screens from your PC will, for now, be dependent on the horsepower of your PC and wireless network (internal).  Be sure to install the Beta Chrome Browser for best results.  There have already been a couple of firmware updates so be sure to allow some time for those to update when you first get it.I think one reason you see such varied reviews is about expectations.  If you have only one TV and want as much content as possible get a Roku.  If you like the idea of throwing content to several TV's and enjoy tinkering a bit then this is really great.  I have several Rokus, Android phone and tablet so it makes much more sense.Can't wait to see what the developers do with this. Fun stuff.", "verified": true, "helpfulness": "2/3", "author": "Mountain Hobbit"}, {"rating": 1.0, "review": "Should have read the specs little closer.I was able to connect with my Nexus 7 okay after changing a setting on my router.However, this will not:Broadcast Amazon Prime content.Play sideloaded content.View games on the TV that I play on my Nexus.After those 3 strikes I gave up on the thing.It also requires a wireless network to connect to.When I removed it from my TV it was almost too hot to handle.Will be sending it back for a refund.Very dissappointed in what looked like a promising piece of technology.", "verified": true, "helpfulness": "6/21", "author": "Jim D \"Jim D\""}, {"rating": 1.0, "review": "The idea of this product is terrific, however, it doesn't work at all as easily as promised.  First off, I couldn't get it to stream my browser.  There were \"no cast devices found\" even though it was set up on my tv and said ready to cast.  Apparently, there is some issue with firewalls on routers, if you have one.  Google's tech support was ZERO help...they were certainly friendly, but had no more knowledge than the average person!  Quite surprising to be sure.  They promise to email you back within 24hrs....that ended up being more like 4 days...and all of their suggestions were things I'd already done or the other tech person told me to do.  All in all, a good idea that needs improvement.  Oh another thing, THERE IS NO CAST OPTION ON NETFLIX, IT EVEN TELLS ME CHROME IS NOT A SUPPORTED BROWSER...WTF??!Pluses:  Very well made, low pricedMinuses:  Really lags down wireless when casting browser, can't cast full screen...which makes the browser casting kinda worthless, can't use it with Netflix(isn't that the point???!)I no longer have it plugged in, I've used the free 3 months to Netflix and went back to streaming via my PS3.", "verified": true, "helpfulness": "6/12", "author": "Minnreviewer"}, {"rating": 3.0, "review": "Install was easy and fast. i was able to hook it up within 10 min. of product registration. It's great if you want to stream YouTube videos or Netflix, but other than that its pretty limited. The Chrome browser streaming capability is terrible. -- don't bother with it -- at least not right now.Though I do see this being a powerful device once they bring on more content providers on their platform.I'll update my review when that happens.", "verified": true, "helpfulness": "0/0", "author": "C. Abe"}, {"rating": 2.0, "review": "I just installed my ChromecastIt doesn't work with my I-Pad 2, and don't get me wrong I'm not a Apple fan at all.I do have Logitech Revue-Google TV , and the Google TV kills the Chromecast and it well worth the extra dollars .Chromecast just lacks features, and with the GTV I have a nice keyboard to use too .Google should go ahead and just invest the time and effort into GTV.The Chromecast stick is pretty weak, and there are USB Android drives you can get that have more features.Also just use your laptop you have now and a wireless keyboard and you can save $ 35 bucks.The media has hyped this one up. It's not that good, maybe a year from now, but as we all know Google is the ADHD kids in the tech world and I doubt we will see any major updates.", "verified": true, "helpfulness": "2/4", "author": "KayakWesty"}, {"rating": 3.0, "review": "I live outside the US so I had to do a workaround to get the Android App installed on my phone and tablet. After that Netflix and Youtube work great.From my Windows 7 laptop it's a different story. Video and navigation are slow, out of sync and have about 1 second lag. Other than that, great device!", "verified": true, "helpfulness": "0/0", "author": "M. Fallas"}]