[{"rating": 4.0, "review": "So far so good.  It's better than $125 a month.  However I would like to be able to see newer episodes.  Hulu has some but not all.  I think if I was able to download networks apps like USA or FX that would be great.  And even with the prime membership shows and movies cost money, perhaps Amazon could give out free credits with the membership.  Overall I am satisfied just miss some shows.", "verified": true, "helpfulness": "0/0", "author": "William Tufo"}, {"rating": 5.0, "review": "I like the way it work for write know but would like to see more app for what it can do I would like to talk to some one about this let me know", "verified": true, "helpfulness": "0/0", "author": "jon caffale"}, {"rating": 1.0, "review": "Bought it do I could use plex but it buffer to bad  .i tried for two days and put my roku back in place . Foku is the king.", "verified": true, "helpfulness": "2/20", "author": "will lambert"}, {"rating": 1.0, "review": "I have (and use) both an Apple TV and a Roku 3.I'm a HUGE fan of Amazon, and everything they do.I'm 27, and extremely tech-savvy, so I'm not just someone who 'doesn't get it'.So they release this uninspired device, which, after Apple and Roku, they can learn from the mistakes the other companies made, and make this device more user friendly, smarter, and cheaper.  Well, it's the same price as the other two. For 99$, you get a device that is on par with other 99$ devices that have been out for years.  So why was this even released? This would've been a cool product in 2010.The interface is extremely annoying-- you have to navigate through several windows, lots of scrolling, etc, just to get to content.  And I had to search for Netflix, Hulu Plus, etc, and download them to the device.  Really? You can't make a plug-and-play device like your competitors?  The Amazon Prime selection also doesn't have a Prime vs Pay filter-- so when you are looking for content, some is free, some is not.  You can't browse Prime eligible free streaming content.  Really, Amazon? It's not like my Prime membership is free.  Give me the perks I pay for.Lastly, there are a LOT of connection issues I've had-- the device thought I was in the UK (I live in Los Angeles), and after fixing that, I was unable to rent a movie (\"error\").  I'm sure I could go onto amazon.com and figure out what settings I'd have to change, but this is technology, it's 2014, and I shouldn't have to manually do all the things that an Apple TV or Roku would intuitively already have finished.Bottom line: It's as if the Fire TV was designed by Congress.  I'll be returning this product.  The software and layout interface needs to be completely redesigned.", "verified": true, "helpfulness": "11/24", "author": "Brian"}, {"rating": 5.0, "review": "I love Fire TV.  The voice search for movies and TV shows is fast and flawless.  Setup is quick and easy. The game graphics are excellent.  I ordered a second Fire TV and I might be ordering a 3rd one.  Fire TV will make excellent Christmas gifts for my three grown sons.", "verified": true, "helpfulness": "1/1", "author": "Gordon"}, {"rating": 3.0, "review": "Easy to set up initially (plug it in and go), but I immediatetely received a message saying I needed a software update. It started downloading slowly, thenafter 10 mins  it told me it couldn't find the download and I should unplug & plug in the power cord. Unbelievable.  After another 15 mins it said my internet connection was slow (it's not). I plugged the box in to my ethernet cord and software took another 30 mins to download. I was just about ready to start the process for returning the box when it finally finished downloading. After starting and stopping several times I got it to work. Then I had to downlload Netflix, etc. Maybe I've been spoiled with the ease of the AppleTV but this seemed like a long and clunky start process. I was able to watch a show on huluplus without any issues, we'll see how it continues to work.", "verified": true, "helpfulness": "2/4", "author": "RJS"}, {"rating": 3.0, "review": "While the Amazon Fire TV is smart and easy to set up and use I gave it a three star because while it does do many things, and probably very well at that, it does not deliver the only two things that I wanted to the degree that I wanted it too.  We recently gave up our cable subscription and thought this would be helpful in watching our amazon prime instant video.  Yes, we can watch amazon prime instant video, and no, not everything on Prime Instant video is free, but now it seems that all the shows we watched for free now come with a charge even though we can watch them for free on the internet.  What's up with that?  The other feature we were excited about was the ability to watch ESPN.  Yes there is an app for ESPN but our internet provider (EPBFI) is not on the list of providers which would have been nice to know ahead of time.  We are not into gaming, and didn't buy this to store our pictures or to listen to music and if we had I would have given it a five star rating.  We were ONLY wanting to watch our favorite rerun shows for free but our favorites are not free anymore.  It's sad but amazon prime was a big factor on driving  down this rating.", "verified": true, "helpfulness": "3/3", "author": "Jenn"}, {"rating": 1.0, "review": "I bought this so I could watch TV on a bigger screen than my MAC while traveling.  I plugged it in and it went to connect to wi-fi but wouldn't allow me to put in a password.  The password screen just zips past so fast you can't even type one letter.  After 15 minutes of troubleshooting, and looking at Amazon's \"help\" page, I had to call tech support.  The IT tech was smug and snotty.  He said that Amazon is aware of this problem, but didn't bother advertising this was a limitation.  I went to \"advance set up in wi-fi\" and asked the tech if he knew how to find a gateway IP address, he giggled and said no.  He didn't offer any further assistance, just was silent on the phone. Then he hung up.  Poor service for the first time with Amazon, hence this review.  I bought this due to traveling constantly.  I don't recommend it for the traveling business person on the go.  Save your money and get the slower Roku instead, it doesn't have these problems.", "verified": true, "helpfulness": "7/21", "author": "Artgirls3 \"Nikki\""}, {"rating": 4.0, "review": "Have only had this for about a week, and it looks very good, but I think you should make the trailers available at the top level for each movie.  Right now, I have to select the film, and the trailer is only one of many purchasing/viewing choices.  We like to check out the trailers before making our choice.", "verified": true, "helpfulness": "0/0", "author": "Ann Onimus"}, {"rating": 1.0, "review": "I'm sure this device will be fantastic in the future but it will always be 2nd best as long as Apple TV has HBOgo.", "verified": false, "helpfulness": "3/25", "author": "Mike Pinson"}]