[{"rating": 5.0, "review": "I am very happy with it so far. I dropped my cable and bought this with sling tv which gives you $50 off.  The Fire tv streams my Netflix, Sling, and my kids have found some games they like on it.  I will be getting a Fire Stick to use on other televisions in the house, but a little nervous about the speed since we get a small amount of hesitation with our 15 Mbps cable internet service.  We will be saving hundreds of dollars each year by cutting cable, so we may increase internet speed.", "verified": true, "helpfulness": "1/2", "author": "Kari S."}, {"rating": 5.0, "review": "Not as many stations as roku, but do you really need them.  This so much faster than roku stick or roku 2 that I have.  Also, put my Samsung 55 inch 3d smart tv to shame.  The voice feature is nice, just needs to be able access more with it, but still is so cool.", "verified": true, "helpfulness": "0/0", "author": "M Johnson"}, {"rating": 5.0, "review": "My family just love it and so am I", "verified": true, "helpfulness": "0/0", "author": "Neri Aroche"}, {"rating": 5.0, "review": "Very Good", "verified": true, "helpfulness": "0/0", "author": "Calvin Robinson"}, {"rating": 3.0, "review": "technically nice, but the offerings are misleading.  You only get ACCESS to a lot of things. Then there is an extra charge for most.  I make this complaint even though I have Prime, too.  If you want to view the FIRST SEASON of 'Game of Thrones' for free, well, then you will be fine.  After that, you pay.  But it allows them to say you get 'Game of Thrones' with the Fire.  Same follows for many of the other programs they tout.  Early (read 'old' ) material is free.  The rest you pay through the nose for.  Marketing people are worse than politicians.  And later seasons of GOT are not available at all unless you have cable with HBO and have an HBO GO subscription.  Then Fire gives you HBO GO.  But you could get HBO GO on any device.  HBO GO is something I never understood the logic of, because when you have cable you have access to the older material for the most part on 'HBO on Demand'.  So caveat emptor.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer \"Rik D\""}, {"rating": 5.0, "review": "Works exactly as described. Easy to install.  No problems whatsoever.  I'd recommend it to anyone who wants to view Amazon Prime Video, Netflix and the many other possibilities.", "verified": true, "helpfulness": "0/0", "author": "J. Moore"}, {"rating": 4.0, "review": "I enjoy this", "verified": true, "helpfulness": "0/1", "author": "DeShana White"}, {"rating": 5.0, "review": "I totally love it!", "verified": true, "helpfulness": "0/1", "author": "Peter"}, {"rating": 5.0, "review": "Works perfectly right out of the box. Minutes to set up and use. Another solid Amazon product. Nice to be able to access my Prime TV. I wish it were also able to allow online connection for checking email, etc. but what is does, it does very well. I did do a lot of research and by far this is the best way to go.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I ditched my satellite :) Very easy to set up and with any problems ( I had to reboot) the  friendly people from help line are there all the time . Also very easy to go through the home page to find the prime movies/tv shows.Saving a lot of money !!!!", "verified": true, "helpfulness": "0/0", "author": "Stella"}]