[{"rating": 5.0, "review": "Absolutely love the fire tv. Controller is a bit expensive, but legit. Wish there was more support for split screen multiplayer. Must have if you are a prime member", "verified": true, "helpfulness": "0/0", "author": "James F"}, {"rating": 5.0, "review": "We also love our fire stick and have no problems with set up or use  BUT are we the only ones who are having trouble with using so many gigabits with Verizon?  Our plan gave us our usual 10 gigabits and we increased them to 20, but after watching four movies we were at our limited use.  Is there any thing we can buy allow us to use this great device?", "verified": false, "helpfulness": "0/0", "author": "Patricia R."}, {"rating": 3.0, "review": "The Amazon Fire HD does NOT come with several of the apps that make their competitor's models more value for the investment.  I would have gone with the Chrome one if I had known what I know now.  Perhaps the other apps will be introduced in the near future but it's a disappointment not to have them right now.  It's nice having the FREE movies from being a Prime Member but a lot of the ones I personally want to see, there is a rental charge.  Smoot marketing, Amazon", "verified": true, "helpfulness": "0/0", "author": "thynson"}, {"rating": 5.0, "review": "My hubs and I bought this as our xmas gift to each other - what a great purchase! I already had a Prime membership (and have for years), so this seemed like a no-brainer for getting quality programming without paying cable company prices. Amazon Fire TV with Prime membership offers most of the our cable company's \"2nd tier\" programming, as well as several premium cable series for free. After we played with this for a week or so, we told our cable company to cut us back to basic cable - and as a result we are saving about 300 dollars a year. Installs in about 5 minutes. My hubs wanted the voice search - I use the text search; both work well. My only complaint is that after a month of daily use I've noticed that the controller is sticking a bit. That may be because my husband uses it to play Amazon Prime free video games and that's probably hard on it; so if you want to use the Five TV to play video games, get the game controller (I now wish that I had done so). Easy to link your prime account to the device, but be mindful of one-click purchases: add a pin number when you register, to prevent accidental or \"guest\" charges to your account. I wound up paying for about 30 dollars worth of programs that would not have occurred if a pin number had been required before finalizing the purchase.", "verified": true, "helpfulness": "2/2", "author": "Ernie Mudd"}, {"rating": 5.0, "review": "very easy to set up, fairly good selection of included movies and tv series, looking forward to trying out other features", "verified": true, "helpfulness": "0/0", "author": "Joanne Gallagher"}, {"rating": 1.0, "review": "Bought the refurb thinking I'd save $20...I should have read the ratings on the refurbs...I see what they mean....bad right out of the box! I decided to give it another try, but this time I ponied up the extra 20 and went new....DELIGHTED !!!! THIS THING IS AWESOME!", "verified": true, "helpfulness": "2/4", "author": "Tom Romano"}, {"rating": 5.0, "review": "Lots of services in a small, simple (appearance) device.  Voice search is impressive.", "verified": true, "helpfulness": "1/1", "author": "Willie \"Willie\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "RM \"dogbeach\""}, {"rating": 3.0, "review": "We purchased Amazon Fire and have enjoyed the ease to set it up and watch movies.  My only complaint is that we were hoping to cancel/replace our Netflix subscription, but so many of the movies require an additional charge, and you can't tell which movies/shows are free and which have charges until you push \"play\".", "verified": true, "helpfulness": "1/1", "author": "Hill House \"hill house\""}, {"rating": 4.0, "review": "Love it! I really do not give 5 stars, 4 is as close as it gets. But we really do love this. We side load and this is really cool for that. I am sure there are many things I can do that I do not know how yet. Some software and apps are not easy to access that is a downer. But they are there. I also have the Logitech Revue and the KFTV knocks it out of the park. Thanks Amazon. Keep up the good work :)", "verified": true, "helpfulness": "0/0", "author": "Paul"}]