[{"rating": 5.0, "review": "Simple to set up and use. Works great! I'm hoping more casting sources come on board, but Netflix is providing hours of terrific entertainment for the time being.", "verified": true, "helpfulness": "0/0", "author": "Artist"}, {"rating": 5.0, "review": "I bought this for my 18 year old daughter.  She has Netflix, but has to watch it on her phone.  She was very happy to receive the Google Chromecast and that made me happy as well.  Not knowing about things like this I wasn't sure if she needed anything else, like another cord.  She called to tell me she just plugged it in and it worked great.", "verified": true, "helpfulness": "0/0", "author": "J. Lias"}, {"rating": 5.0, "review": "I purchased this device because I got sick of moving my laptop between my bedroom and living room and hooking it up to the TV to watch HBOGO.  The device works great with the HBOGO app on my android.  The quality is great and I no longer have to worry about putting the screen to \"full screen\".The only thing I find odd is that I bought this device through Amazon, yet it does not support Amazon instant video.  Other than that, the devices offers the apps I use most and works quite well.", "verified": true, "helpfulness": "0/0", "author": "Ivy Quihuis \"captain ivysaur\""}, {"rating": 4.0, "review": "Another great product from Google. Arrived fast and on time. The only problems it works only for Netflix and Youtube, very easy use.", "verified": true, "helpfulness": "0/0", "author": "NGR"}, {"rating": 5.0, "review": "We are enjoying chrome cast. It has met and exceeded our expectations. We look forward to seeing what other apps will become compatible with this device.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "This thing is cool! Plays your Netflix, YouTube, etc to a tv and does so in full 1080 resolution. Looks amazing. Easy to set up. Does NOT mirror your phone...don't expect that from this cheaply priced device. Google is always making updates and bettering the OS. Love it.", "verified": true, "helpfulness": "0/0", "author": "HealthyJoe \"Amazon Hussy\""}, {"rating": 3.0, "review": "I bought both a Chromecast and an Apple TV this Christmas.  These were impulse buys at Best Buy, not from Amazon.  After getting everything to work, I tried watching Youtube videos using both devices.  With Chromecast, most videos froze after a minute or less.  With Apple TV, it just works.  In addition, I was able to authorize my Apple TV for the HBO Go app, which means I am now able to watch anything in HBO's library without having to watch the Comcast schedule.I was surprised that Youtube videos wouldn't stream properly.  I have fiber to the home, at 300 Mbps, specifically to support streaming.  My Apple TV plugs directly into the router, which plugs directly into the fiber box on the wall.  My Chromecast connects to the router via wifi, but the TV set is right next to the router, so this should be very fast.  My analysis is, you want some type of buffered device in conjunction with Chromecast.  Plex sounds like the right idea.I'll probably just move the Chromecast device to my upstairs TV.  It's better than nothing!", "verified": true, "helpfulness": "0/0", "author": "David M. Thompson"}, {"rating": 5.0, "review": "Good Chrome was very easy to install and operate. This was a gift for my mother. She really loves it.", "verified": true, "helpfulness": "0/0", "author": "Ashley Vallone"}, {"rating": 1.0, "review": "I tried EVERYTHING!  This would not work.  No $35 item is with the hours of changing settings, talking to customer service, and rebooting I went through.  Spend the extra money and get Apple TV or Roku.", "verified": true, "helpfulness": "0/2", "author": "Scott R Weigand"}, {"rating": 4.0, "review": "Great for watching YouTube and Netflix...needs to have an app to watch movie saved on my laptop...But still work great", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]