[{"rating": 5.0, "review": "Exactly what I was looking for", "verified": true, "helpfulness": "0/0", "author": "Liz Bojtos"}, {"rating": 5.0, "review": "works like i expected", "verified": true, "helpfulness": "0/0", "author": "jr"}, {"rating": 4.0, "review": "Works well most of the time, sometimes there are a few hitches with connectivity.", "verified": true, "helpfulness": "0/0", "author": "Lillie"}, {"rating": 1.0, "review": "no luck at all. TV picture flickered whenever I used it.  Unfortunately help is unobtainable. No phone line, no chat. sent it back", "verified": true, "helpfulness": "0/0", "author": "Jonathan B. Sands \"JS\""}, {"rating": 5.0, "review": "Great little product.  I love being able to stream everything from my PC and Ipad to my TV.  Its really helped out when entertaining nieces and nephew.  Simple to set up and easy to place.  There's a few more apps that need to gain compatibility and it will be perfect.", "verified": true, "helpfulness": "0/0", "author": "Brian R."}, {"rating": 4.0, "review": "not many apps available, but the ones that are great. absolutely one of my favorite streamers because of mobile compatibility.  it works best with android. my wife has i6 vs my note 4. more setting available on android such as sound control", "verified": true, "helpfulness": "0/0", "author": "Raphael"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Claudio Pezatto Neto"}, {"rating": 5.0, "review": "I have this Chromecast as well a Roku (2XS).  They both have advantages and I love my Roku, but I this will work great for most users.Long story short if you don't wish to go into pros/cons:  Check to see if the service you use (Netflix, Hulu etc) support Chromecast. If you have no issues with the Wi-Fi in your home and if you don't need a remote control, then this should suffice.Pros1. It's easy and works with your tablet or phone.  If you're watching Netflix or YouTube, just tap the 'cast' button and now it's on your TV.  Tap it again to disconnect.  And, you can still use your phone/tablet for other functions while it streams.2.3. It's small.  Just plug it into the TV and give it power.  Newer TV's can power it from the built in USB port in the TV (check your TV manual for functionality)4. It's $35.  I don't think it gets cheaper.5. Expanded support for a lot of apps now.  more apps are being supported all the time.6. No remote control, since you control everything from your phone/tabletCons1. No remote control.  I find older users aren't comfortable with this.2. All Wi-fi, no wired options.  This is fine for most with today's routers, but I seem to have occasional wi-fi signal issues that I think is due to interference.  So once in a while, my stream is low-res or choppy, but this is not the fault of Chromecast", "verified": true, "helpfulness": "0/0", "author": "Jason Lew"}, {"rating": 5.0, "review": "keeps getting better!", "verified": true, "helpfulness": "0/0", "author": "jennifer schoon"}, {"rating": 5.0, "review": "Small and efficient.  Software kinks have been worked out.  Can be powered directly from TVs USB port, though it's not powered in most cases when the TV is turned off.  Other reviewers cover why this device is great.", "verified": true, "helpfulness": "0/0", "author": "MacGyver"}]