[{"rating": 1.0, "review": "This device is a waste of money and I will have to return it. It has problems connecting wirelessly and even so drops connection often.", "verified": true, "helpfulness": "7/7", "author": "Crystal Andalcio-O'Neil"}, {"rating": 2.0, "review": "The lack of universal voice search for all apps hinders this device.  You can only search for amazon content that cost insane amount of money.  Voice search should work with key programs such as netflix and youtube.  Also this device is not a good media streamer for local content.", "verified": true, "helpfulness": "2/2", "author": "Adelson Jules"}, {"rating": 5.0, "review": "I love it and use it all the time especially for the kids all the episodes.of.blues clues are a . morning of peace and quiet.....great for date nights in as well....worth every penny and then some", "verified": true, "helpfulness": "0/0", "author": "Rotundo"}, {"rating": 5.0, "review": "It.is a maising", "verified": true, "helpfulness": "0/0", "author": "Fernando Guerrero \"F.G\""}, {"rating": 5.0, "review": "it's just great", "verified": true, "helpfulness": "0/0", "author": "David Barinholtz"}, {"rating": 5.0, "review": "Great games and smooth control, worth the price. For other digital content, the purchase process is simple and easy.", "verified": true, "helpfulness": "0/0", "author": "hz"}, {"rating": 4.0, "review": "I would like to see more movies with the prime rating. Even if the yearly fee was increased a little more..  The movie selection would be better be better and the sight would be easier to  navigate.", "verified": true, "helpfulness": "0/0", "author": "charles B."}, {"rating": 5.0, "review": "I love my fire tv! Best streaming device I have ever used! (only one also)The voice search works great!", "verified": true, "helpfulness": "0/0", "author": "PhilipW@AWS \"Philip W\""}, {"rating": 4.0, "review": "Really good version 1. Snappy UI. Buckets of content and apps. Great hardware.If I was to have any gripes (or more like things that can easily be fixed with the existing hardware) on the current version as it stands: - The bluetooth remote can be slow to connect - There needs to be a phone app that can be used as a remote to bypass the given one (handy with children) - Voice Search needs to be extended out to all apps and their content - Manual DNS settings should be allowed in WiFi connection - Pre-fetching content should be a choice (for people with data caps)", "verified": true, "helpfulness": "0/0", "author": "Jerome Curtin"}, {"rating": 4.0, "review": "Great evolution in mobile Television. Once it adds HBOGO and fixes the \"streaming-eating\" mosaic mode, it will be a nearly perfect machine. If joined with the Kindle Fire, it brings it to a whole new level.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}]