[{"rating": 3.0, "review": "Amazon should have done something special for Prime members with Fire TV. Should have been more clear about what else would be needed for set up. Initial set up instructions are a bit lacking. Used the one HDMI connection on my TV and disconnected my Google Chromecast to do it. NOW my TV has no sound on the cable source. I had to use the one HDMI connection for my cable box in order to watch linear TV with sound. So now I have no Fire TV and no Chromecast because Fire TV upset the balance and limits my source connections. But initially it worked great including voice (although using the remote for typing is a chore). Looks like I need to start all over to figure this out. Should have waited for a few more folks to vet this out first. Excited about this but... Chromecast was easier and didn't upset the ecosystem of my entertainment sources.", "verified": true, "helpfulness": "0/7", "author": "Not a reviewer"}, {"rating": 5.0, "review": "Our Fire TV showed up today and I hooked it up.  It immediately downloaded a firmware update, installed it, and then switched to a little orientation message (just a couple of minutes) where it gives you a basic overview of how the controls work.  This is a small, elegant device and the remote is very nice as well.The voice commands actually work as advertised.  I told the Amazon Fire TV that I wanted to watch \"The Americans\" and up it came as a selection.  Thus I was up and running and enjoying content within minutes of hooking up the device.If you are are an Amazon Prime member (and who isn't?) you have to have one of these hooked up to your TV.  The fidelity is outstanding and the menus are very easy to navigate, especially with the voice command feature.The Fire TV does not come with HDMI cables so you will want to order these separately.  The Amazon HDMI cables, which are among the least expensive, work fine.I hooked up our first Fire TV up to the garage workshop TV, which is the furthest from our network wireless hub.  Some devices have struggled with signal strength at this location, but the Fire TV acquired the network and streamed content effortlessly.The menus are very easy to use here and the voice command feature is really a game changer.  At $99 this is a howling bargain.  Highly recommended.  RJB.", "verified": true, "helpfulness": "10/11", "author": "Roger J. Buffington"}, {"rating": 2.0, "review": "It does not have The Blaze, so, no thank you. I'll stick with the Roku where I can get The Blaze TV.", "verified": false, "helpfulness": "8/27", "author": "S. Harris"}, {"rating": 1.0, "review": "Just read this folks...Amusing Ourselves to Death: Public Discourse in the Age of Show Business...and you'll see why this gets one star.Don't we have enough \"entertainment\" as it is in this post-modern electronic age?", "verified": false, "helpfulness": "7/87", "author": "slant6guy \"slant6guy\""}, {"rating": 2.0, "review": "The world already has Apple TV.  Yeah it gives different options; but still it is a copy cat of the Apple TV.", "verified": false, "helpfulness": "3/38", "author": "Aaron"}, {"rating": 5.0, "review": "Absolutely love it.  Am going to buy one for my father in law.  He's 89 and the voice activation will really help him join the 21st century.", "verified": true, "helpfulness": "1/6", "author": "B. Pena"}, {"rating": 4.0, "review": "As a satisfied owner of three Apple TVs, there are a couple of things that it is lacking.  First, there's no Amazon Video app.  Second, there's no way (without jailbreaking or resorting to some hacks that may or may not work forever) to stream content from my computer outside of what's available through iTunes.  I have many files that are not compatible with iTunes and I don't intend to convert them all to mp4, so I needed an alternative.My hope was that the Fire TV would solve both of these problems since out of the box it supports both Amazon Video (obviously) and Plex.  Mostly it does, but it's not a perfect experience.The first thing you will notice upon starting up the Fire TV is that it is VERY fast navigating through the menus.  It feels significantly more responsive than the Apple TV, although that could be due to not having the same style of transitions.  The first thing I did was a voice search for Gary Busey, because hey... you gotta search for Gary Busey.  That worked as expected.  Then I tried Joss Whedon, but it kept coming up with Joss Weeden.  A manual hunt and peck search on a QWERTY layout keyboard worked properly.Mostly the voice control did function, although it only works with Amazon content and in a roundabout way Hulu Plus content.  You can forget about searching for anything else such as Netflix or Flixter (both available as free downloads).  I hope that Amazon will add unified search capabilities.While on the subject of Netflix, the app works fine on the Fire TV but it's obvious that it's not really made for it.  It simply a scaled up version of the tablet software.  It loads a little more quickly than Netflix on Apple TV, but not very much so.  In fact, at the beginning of all content you get a low quality stream until it gradually changes the quality to match your bandwidth.  On the Apple TV, while it takes longer to load, it starts up in the highest quality.Also of note is that the keyboard in Netflix and many other apps is not QWERTY, but alphabetical unlike the Fire TV itself which is QWERTY.  These are the types of things that set it apart from the Apple TV where everything looks the same from app to app.  Another example is that there doesn't seem to be any good way to sort your apps.  Amazon's content is up front and then everything else is sort of just jumbled together including games.  It would be nice to be able to move things where you want them for quick access.As for Amazon content, it's blazingly fast.  It absolutely destroys my Panasonic Plasma and Blu-ray players' Amazon apps.  I've never used a Roku so I don't know how it compares to that, but it really works well on the Fire TV.The next thing I tried was Plex and this was a mixed bag.  Yes, it does work.  It looks a little funky, with a couple of radio buttons on the screen that have no text attached to them so I don't know what they do.  Also the initial screen setup had me stretch the image until there were no white bars on the edges, but when I actually played content there were still grey bars on one side.  I had to keep going back and forth to fix it while not overdoing it and losing data off the edge of the screen.  But the biggest problem by far with Plex was that even though there are options for AC3, Dolby Digital, and DTS, none of them work.  If you select them, you get no sound.  If they are not selected, it down mixes to stereo.  Since this also appears to be just the tablet app running on a new device, hopefully the Plex developers will find a way to at least support DD+ which is supported perfectly by the Fire TV in Amazon and Netflix.I have not received my controller yet so I cannot speak for the games.  I'm looking forward to trying them, but my biggest worry is that the 8GB of storage will not be nearly enough.  There's a USB port on the Fire TV, but it doesn't seem to be capable of much beyond a keyboard.  I couldn't see a way to add extra storage through a flash drive or external USB hard drive.The remote is nice although currently unsupported by my Logitech Harmony.  I'm not sure that it will ever be fully supported since it's a bluetooth device with a built-in microphone for voice search capability.  At the very least, voice search isn't going to work.All in all, I'm not unhappy that I bought the Fire TV.  It will be great to finally have easy access to my Amazon Prime content and probably Plex will work better someday.  If Amazon unifies the interface elements, unifies voice search, and gives users a little more control over the layout of home page icons, this could be one seriously fast and great streaming device.  We're not there yet, but there is a lot of potential.  I will definitely be keeping mine and my Apple TVs will now have some Android-based company.Update 4/8/14 :Received my controller today and had a blast playing games with it.  This feature really sets the device apart from the Apple TV and it's a shame the latter device hasn't included it yet, although I expect they will if only to play catch up.  Meanwhile, I have had loads of fun playing Reaper.  The free game that was included for buying the controller was also pretty fun.  If you're not a hardcore gamer looking for an Xbox One or PS4 experience (maybe you play a lot of tablet or phone games) then this is a pretty great feature.", "verified": true, "helpfulness": "7/9", "author": "Paul Beasi"}, {"rating": 5.0, "review": "I have used the Amazon Fire TV every night since receiving it a few days ago, and so far I love it.  It starts movies nearly instantly, has great sound and picture quality, and a nice remote.  I would recommend to others.", "verified": true, "helpfulness": "3/5", "author": "Paul H."}, {"rating": 4.0, "review": "Voice search works with my accent. Amazon content plays nicely. Hulu plus video quality is noticeably worse than on Apple TV . Games acuattly are enjoyable", "verified": true, "helpfulness": "0/3", "author": "Mike Ponomarenko"}, {"rating": 3.0, "review": "Disappointed. It comes late in the day, I have the evening to myself, and after plugging it and getting it ready I find the remote doesn't have any batteries and I don't have any batteries of that type. It doesn't work without the remote. For $99 it seems like that should have been included.", "verified": true, "helpfulness": "0/19", "author": "audiodude"}]