[{"rating": 5.0, "review": "Amazing product. Love it. This is the product that cable companies hate. Totally ready to cut the cord", "verified": true, "helpfulness": "0/0", "author": "William Dennison"}, {"rating": 5.0, "review": "Love it watched movies with grand daughters all weekend and played games at no extra expense very entertaining best purchased I ever made byby exspensive direct tv look forward to more add ons from Amazon", "verified": true, "helpfulness": "0/0", "author": "Chrissy Graves"}, {"rating": 5.0, "review": "The Xbox streams Hulu, Netflix and Prime in the living room and the prime is in the bedroom, it runs circles around the Xbox. It buffers faster and the voice control for Amazon is amazingly accurate (they need to hire the engineers to work on the Kinect voice commands, seriously). Even at a whisper it normally gets your request right.The only additional is would be able to plug into the remote for volume less TV if you wasn't wanting to disturb someone else, or just wanted stereo quality.", "verified": true, "helpfulness": "0/0", "author": "TinaBoBina"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "marvin ortiz"}, {"rating": 5.0, "review": "I love my box. We cancelled our cable services and only kept internet. Awesome investment.", "verified": true, "helpfulness": "0/0", "author": "nisa2west"}, {"rating": 5.0, "review": "Amazon Fire TV has opened up a whole new world of entertainment for us! We absolutely LOVE it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"guangximom\""}, {"rating": 5.0, "review": "If I buy I have to be suscriber in the amazon prime to watch the movies ? Or I have too buy the subscription separately ?", "verified": false, "helpfulness": "0/2", "author": "Kelvin Perez"}, {"rating": 5.0, "review": "Love Fire TV! Remote easy to use, and the voice command element works flawlessly. Great buy!", "verified": true, "helpfulness": "0/0", "author": "jkfontes"}, {"rating": 4.0, "review": "Best streaming i,ve seen does everything i expected and the voice  command is absolutely perfect.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 5.0, "review": "this thing is AMAZING !  I am buying one for every tv in the house", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]