[{"rating": 5.0, "review": "From the minute I opened the package this screamed quality.  I have had the Roku 1 and 2 and both failed after about a year of use.  This is much faster to move through the menus compared to the Roku's.  Very easy to setup.  I can't wait to order and try the game controller.  Great feeling remote.  I am extremely pleased.  This is leaps and bounds ahead of Roku.", "verified": true, "helpfulness": "0/0", "author": "SirParks"}, {"rating": 5.0, "review": "Very easy to use and install. Was using within 15 minutes of delivery. Down loaded Netflix and Hulu Plu apps. Along with our Amazon Prime we have almost unlimited movie and TV available for us.Now the voice command takes some time to master. The first time we used it I asked for Prime Movies and Prime Boobies come up. My wife would not let me push the button to see what would have shown up. With games and all the other apps available this is a fine investment.", "verified": true, "helpfulness": "0/0", "author": "r kulin"}, {"rating": 5.0, "review": "Works as promised. Son had it earlier this year in CA where I got to use it. Just say the name of the actor or movie and it brings it to the screen. Absolutely amazing and well worth the money.", "verified": true, "helpfulness": "0/0", "author": "barbara \"Jim\""}, {"rating": 5.0, "review": "Works Great. Much better than having my laptop connected to my television.  Everything is controlled with the remote and having other streaming service apps is great also. The voice prompt works great as well. The convenience of not having to deal with the laptop is well worth it.", "verified": true, "helpfulness": "0/0", "author": "J. Lawrence \"J. Lawrence\""}, {"rating": 5.0, "review": "Great.  I do notice a difference in picture quality, to the better, for programs streamed from Netflix versus other devices I've used.  A very nice picture indeed.  Voice activation is as advertised...easy and accurate, though not surprisingly it talks you to Amazon video for everything if you specify a show or movie.  You can, as I do, say '''Netflix'' once you set up and it'll go to Netflix and then you can navigate to the show you want in your list (the system doesn't got there by just giving the shows name.....it goes to Amazon video.  You're shocked,....really?  Personally, I'd like the remote to be a bit bigger, but that's picky.  The navigation arrows are super sensitive....don't be heavy fingered or you zip waaaayyyyyy past your desired destination.  You get used to it, but be forewarned.", "verified": true, "helpfulness": "0/0", "author": "KEITH E CROSSMAN"}, {"rating": 5.0, "review": "greatest invention since the wheel. i ordered 2 more for my sister and mom", "verified": true, "helpfulness": "0/0", "author": "tez miller"}, {"rating": 5.0, "review": "I love it. Can't wait till I can afford amazon prime. We have Netflix and 9.00 a month is so much better than 140.00 for cable and reruns.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A great complement to FiOS", "verified": true, "helpfulness": "0/0", "author": "Tom Miesner"}, {"rating": 4.0, "review": "Finding a way to apply the code # to obtain PBS was a pain.....(Didn't work on PC but did on IPad)Not enough easy access to free shows....The limited access to Amazon Prime was a good peek at what Amazon Fire can provide....We loved the remote features, especially the voice activation....", "verified": true, "helpfulness": "0/0", "author": "R-SHILO"}, {"rating": 3.0, "review": "Must get a fix for the screen saver because it kills the data plan being used which cause the programing to buffer. Once all the apps start buffering it appears to product is not of the same quality.", "verified": true, "helpfulness": "0/0", "author": "d.mor"}]