[{"rating": 5.0, "review": "Netflix has better quality and plays smoother on Chromecast when compared my PS3 or Vizio Smart TV app, must be Google streaming MAGIC! I was about to cancel Netflix, but Chromecast saved their butt. Hey Netflix, a residual check should be in order :-)This is the most innovative product I have seen in a long time. You can control it with your phone for most apps like Netflix and YouTube, but there is no app yet for Amazon video. Then I found out about the Chrome (browser) extension \"Google Cast\", where you can send any browser tab to this device. This allowed me to view videos on Amazon (and anywhere else for that matter) to this state of the art device. I simply love it so far. I am thinking of getting a 2nd one.", "verified": true, "helpfulness": "0/0", "author": "A_Friend247"}, {"rating": 4.0, "review": "it works really good on old TV's w/out apps.I would recommend it to any body who don't have newer tvs.", "verified": true, "helpfulness": "0/0", "author": "Francisco Mora"}, {"rating": 5.0, "review": "Since making the decision to ditch cable and stream online only, we have been huddled around our laptops.  When we got chromecast we could finally sit back and watch in the big screen. I was so pleased that I went out and bought a chromebook.", "verified": true, "helpfulness": "0/0", "author": "Melanie"}, {"rating": 3.0, "review": "Note: I got mine free as a gift, so even though I'm not over the moon about this thing, I've lost no money personally.There isn't much to say about this little toy that many haven't said already, but it bears repeating: this doesn't work on its own.  Those of us who thought we were buying a wireless streaming device that would practically solve quantum sums on its own are, of course, disappointed. Pretty much anything you want to cast from your computer requires the Chrome browser which, if you don't use it normally (like myself) means installing yet another effin' browser to add to the list.  (Which, in my case, is now Firefox, Chrome, and that piece of crap IE that Windows no longer lets us uninstall.)  You can't extend your monitor as you can with an HDMI cord, so you can't fullscreen videos on Chrome if you want to actually use your computer whilst playing videos in the background.Well then, just use your phone or tablet, right?  Obviously the main thrust of this thing was to use one of these other gadgets to cast video and such from it.  So now, you, like me, have your phone perpetually docked, trying to watch Hulu. And since I have a Note 2, I have to keep flicking the screen back on and off, because I sincerely do not need burn in, and apps like Hulu will keep the sodding thing running even as it's not actually playing video.  Can't comment on streaming personally pictures, because I have no interest in doing so, so I don't care.The apps list is still pretty poor.  That goes without saying right now.  About the only thing I'm happy about is that Hulu works, because the Hulu app on my LG blu-ray has problems handling commercials, while it seems to stream just fine on my phone.  No Amazon video, though.So, for $35 you have a bit of a gimmicky device that actually costs quite a bit more when you think about it: the thing is useless without a phone, tablet, or computer to cast *from.*  On the other hand, something like a Roku (or the $49 upcoming Roku stick) doesn't require anything extra, has a bunch of apps already installed, and doesn't frustrate you by requiring you to jump through Googley hoops to make it work.  Frankly, I'm thinking about buying one of those instead.  $49 for a stick that works on its own out of the box, versus a $35 stick that requires an expensive second piece of equipment to work....", "verified": false, "helpfulness": "1/1", "author": "Sokudo Ningyou \"Devious Lark\""}, {"rating": 3.0, "review": "If you're like me, you saw the price on this and are thinking \"why not?\".  Well, there isn't a tremendous amount of applications available that utilize it, so the novelty is short lived.  Google promises more in the future, but for now it's hard to recommend.", "verified": true, "helpfulness": "0/0", "author": "Alexandre L M Boffi"}, {"rating": 5.0, "review": "I love my Chromecast!  It works with Netflex, HBO Go, Vevo, my movies I purchased or rented on Google Play, Google Play Music, YouTube, Hulu, content from my Chrome browser, and others.  It plugs into the HDMI port of the TV and will charge using the USB port so there is no cord going to the wall. (I did not know that the USB port supplied power until now.)  If there is not a USB port you can plug into the wall with the included plug.Once you install the Chromcast app on your phone you can \"cast\" from apps directly - Netflix, Hula, or YouTube, Google Music, Google Play, etc.  So easy!  It will also \"cast\" content from your Chrome browser but is sometimes sluggish with streaming content.It is super simple to move to different TVs but at $35 it is affordable enough to have one for each room needed.", "verified": false, "helpfulness": "0/0", "author": "lovemyned"}, {"rating": 5.0, "review": "So my wife told me about this little device and I did my homework and decided to purchased, as I had just purchased a new flat screen. Setup was so simple my 3 year old granddaughter could have done it. I put the app on all my devices (PC,Phone,IPAD etc.) and then pulled up ny netflix account. Its really great watching movies on the new big flat screen as opposed to the computer monitor in which I have a couple of very large ones. I only use it to watch movies using Hulu and Netflix and it works like a charm. It was well worth the investment.", "verified": true, "helpfulness": "0/0", "author": "Micon \"mtnmanmike\""}, {"rating": 5.0, "review": "This is my second Chromecast. I bought it for a TV that is already a smart TV because it simply works better. I much prefer using an iPad or iPhone as a remote because it is easier to see selections. It works with many different platforms (Netflix, Pandora, Amazon, etc.). It also is small enough to travel with. If you go someplace with a TV and wireless you can watch everything...", "verified": true, "helpfulness": "0/0", "author": "John Adams"}, {"rating": 4.0, "review": "I bought a chromecast and a roku at the same time.  Overall I am more impressed with the chromcast then the roku (my 360 can already do most of what the roku can do) But chromecast it is something different and so far the games have been fun and using your phone as the remote is interesting.  easy to use and setup. would recommend.", "verified": true, "helpfulness": "0/0", "author": "d_kes"}, {"rating": 5.0, "review": "work pretty good, seems that there is a bit of lag form my Mac to tV but all in all it does it for me.", "verified": false, "helpfulness": "0/0", "author": "Andrew Schober"}]