[{"rating": 5.0, "review": "First, the con:It has a limited selection of apps.  I cannot watch my Dish Anywhere DVR recordings through Chromecast.The awesomeness:Set up is ridiculously easy.  The instructions are ridiculously easy to follow.  Everything is pretty much plug-and-play.Once it's set up, the Chromecast does everything for you.  You don't even have to change inputs - as soon as Chromecast detects your device it boots up and switches your input for you.  The only thing you have to do is hit the power button on your tv and open the Chromecast app on your device.  After that, you can use YouTube and Netflix and whatever to your heart's content.I really look forward to seeing more compatibility with other programs and apps.I love this thing.  Too often I have to hunt down the remote to change the channel while watching tv, but since I always keep my phone in my pocket I can play, pause or rewind no matter what I'm doing.Best 35 dollars I've ever spent.", "verified": true, "helpfulness": "0/0", "author": "C. Seachord"}, {"rating": 5.0, "review": "I had seen this out for awhile before deciding to get one, and when I did, it was gone, everywhere. So on back order, and then it came in. Great for streaming You tube videos to my TV. Portability factor is 10, Apps, need more than just 6, albeit it is a new device, and development is slow. But it is worth the 35 bucks to wait.", "verified": true, "helpfulness": "0/0", "author": "Zandango"}, {"rating": 5.0, "review": "Chromecast works great. I'm looking forward to more content and apps being added. Would definitely recommend to anyone looking for streaming capabilities.", "verified": true, "helpfulness": "0/0", "author": "M. Rion \"mrion\""}, {"rating": 5.0, "review": "Replaces my Roku. I can't wait for more apps, but so far it has the two biggies. Clear picture, doesn't lag... Perfection.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 5.0, "review": "I was hesitant at first to invest in this chromecast technology because I own a Playstation 3 and my parents use a roku, I have been pleasantly surprised at how much I use it. I own an iPad and I really like the convenience of simply opening my Netflix app and streaming it to my TV while I lay in bed on facebook, reading for class, etc... I also like to put pandora up on my TV, or to show my roommate a webpage when we're studying for class in our living room (We own multiple). I would suggest this over using a roku, or other streaming devices simply because of cost. More than likely you own a computer, laptop, and/or tablet and all you need is to install the chrome browser and the chromecast add-on and you're all set!", "verified": true, "helpfulness": "0/0", "author": "Brandon Petersen"}, {"rating": 4.0, "review": "Works pretty well with Chrome.  I don't have netflix and mainly use it for Hulu so I'm hoping they will work on that.  Can lag a little sometimes, but as I said that is when I am using Hulu on Chrome.  Overall I am happy with it!", "verified": true, "helpfulness": "0/0", "author": "Brandilyn Ford"}, {"rating": 5.0, "review": "Aunque muchos se quejen de que sólo funciona con Youtube y Netflix, yo creo que es lo que más usamos de lejos y por el precio me parece una maravilla, además es muy práctico y cómodo, y sé que dentro de poco habrán muchas aplicaciones compatibles.Although many complain that only works with Youtube and Netflix, I think that is what most use by far and the price seems great, it is also very practical and comfortable, and I know that soon there will be many compatible applications.", "verified": true, "helpfulness": "0/0", "author": "Daniel Martínez"}, {"rating": 5.0, "review": "This little gadget has had a lot of praise and I will add mine to it. It's small and powerful.  I haven't had success in getting Amazon movies to work with chromecast but am hopeful Amazon will coordinate with them to make it work", "verified": true, "helpfulness": "0/0", "author": "sunsetmalm"}, {"rating": 3.0, "review": "The quality of this device is dependent on your cell phone and internet provider.  Response times seem to be slow with Comcast plus my IPhone4, and with only Netflix - assuming you have a subscription - and You-Tube participating, you're not getting much. But then, you're not paying much. Slick packaging.", "verified": true, "helpfulness": "0/0", "author": "Euell Gophar"}, {"rating": 2.0, "review": "It is a good product but im not completely satisfied with the purchase.  It bought it because I thought it was web browsing capable", "verified": true, "helpfulness": "0/0", "author": "Marcus"}]