[{"rating": 5.0, "review": "Greatvdevice", "verified": true, "helpfulness": "0/0", "author": "Peter Trangata"}, {"rating": 4.0, "review": "Fire TV is fabulous. It has essentially any movie you would want for purchase or rent available. I'm not giving it 5 stars because with my Prime Membership, I wish it has more movies available for free viewing.", "verified": true, "helpfulness": "0/0", "author": "John J. Cahill"}, {"rating": 5.0, "review": "I bought the Fire TV initially to try and take advantage of more of my Prime account benefits. I finally have a nice and extremely fast way to access all the Movie, TV and Music content besides my Kindle tablet. What I ended up with is far beyond that. The Fire TV has amazing specs which make it one of the fastest units to load a generic media player app on. I ended up side-loading Kodi onto mine and am just amazed with the device now. Sure I use it for Prime content but it's nice to be able to play the backups I've made of my DVD library right off my computer too. Amazon, please don't change a THING! Well.. if you are please make Kodi an approved app to be installed a listed with the rest of the apps. Having to go custom start it from the settings menu gets kind of old.", "verified": true, "helpfulness": "0/0", "author": "JoshF"}, {"rating": 5.0, "review": "Great Netflix, prime, and best of all the music", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it!  So glad to be getting rid of cable.", "verified": true, "helpfulness": "0/0", "author": "Christine Repischak"}, {"rating": 5.0, "review": "I have been viewing my Amazon Prime material on my Blu Ray player, but was continually frustrated with all the time outs.  The Amazon Fire TV gets connected with my wifi with no problem.  I haven't seen the spinning circle once since I hooked it up.", "verified": true, "helpfulness": "0/0", "author": "Korlei Cantwell"}, {"rating": 5.0, "review": "I was given this for Christmas, well everyone else is enjoying this and having a good time watching movies. I ordered a controller for my granddaughter and after she starts playing everyone else will have to wait to get their turn.", "verified": true, "helpfulness": "0/0", "author": "Miriam Mendoza \"m and m\""}, {"rating": 5.0, "review": "Seamless integration into my TV watching. With a flick of a switch on the remote I have a universe of viewing options including Amazon Prime, Hulu Plus and Netflix.  Love it.Really easy set up too.", "verified": true, "helpfulness": "0/0", "author": "Glamvid"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "FAST!", "verified": true, "helpfulness": "0/0", "author": "bmark01"}]