[{"rating": 1.0, "review": "Having a problem keeping connected, goes in and out watching a movie,very frustrating runs very hot, might be a bad one.  Not sure of the warranty and how long.", "verified": true, "helpfulness": "0/0", "author": "Sal gambe"}, {"rating": 5.0, "review": "Very easy to set up. If your TV has a USB port, I'd suggest plugging the Chromecast in there instead of a power outlet. That way, it's not on all the time. The only downside is that it might try to install updates when you'd want to use it.I've already bought several of these because family and friends wanted one, but don't want to go through the trouble of creating an Amazon account. They have been happy with their purchase.", "verified": true, "helpfulness": "0/0", "author": "Minh"}, {"rating": 5.0, "review": "Such a great and easy way to stream movies, etc. to my television.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 4.0, "review": "Had a few problems getting it to work but was a simple fix and is working just fine now. The price was a steal since I got it on a Thanksgiving day special.", "verified": true, "helpfulness": "0/0", "author": "JSmith \"Jean\""}, {"rating": 3.0, "review": "it does not work with my Kindle fire; otherwise, it works fine.", "verified": true, "helpfulness": "0/0", "author": "theodore elton manis"}, {"rating": 5.0, "review": "This project is great! Works better than expected. Occasionally I have a problem where the chromecast can't be found but after reseting the device I haven't had a problem. Great product. I love using it with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Justin Shultz \"JShultz89\""}, {"rating": 1.0, "review": "I bought this item about a year ago and loved it!  but then in like the last 3 months it started to Brain Freeze.  7-9 minutes into a streaming movie on netflix or hbo go and brain freeze.  I tried everything to get it to stop.  so....dummy me, I bought another one - $35 ...disposable price right?...so that one did exactly the same thing.  There is a google product form with lots of folks having the same issue, and what has google done to fix it....ABOSOUTELY NOTHING.  So I bought a Roku 3 and love it even more.  DO NOT BUY THIS PRODUCT!!!!!!.  I only gave it one star because you have to give it a rating.", "verified": true, "helpfulness": "0/1", "author": "Dianna"}, {"rating": 1.0, "review": "I was looking for a device that I could use to watch Netflix SEPERATLY from using my computer I was disappointed.Now, when I want to learn how to use the thing, I'm insulted to find such information available only for a price. THANKS A LOT!", "verified": true, "helpfulness": "0/1", "author": "NEALTHE3"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Mark Williamson"}, {"rating": 1.0, "review": "Poor qualityI had high expectations for a product put out by Google as most everything else they do is top notch.Bad signalUndependable connectionI have has nothing but problems with this product. I spent two hours on my own doing research and another hour on the phone with customer support (before the disconnected me) to try to connect it to my router and the only resolution they could offer that there can't be any walls in the way of the path from the router to the Chromecast, for 50 feet!Tech support is almost impossible to reach (only way I reached them was to say I was returning something) then they disconnect you when you pull them from their beloved flow chart they follow.Do yourself a favor and avoid this product unless your router is directly next to your TV", "verified": true, "helpfulness": "0/1", "author": "J. Perkins"}]