[{"rating": 4.0, "review": "we haven't really used it that much yet but we did go through the setup process. It works very well and the graphics are very nice.", "verified": true, "helpfulness": "0/0", "author": "jill"}, {"rating": 4.0, "review": "This is an excellent addition to my older HDTV that does not have media apps built in.  I have an HTPC attached to the TV, but it is a bit cumbersome to switch between different media applications (HBO-GO, Netflix, Plex, Youtube).  The Chromecast makes playing media a lot easier by just letting me switch between apps on my phone instead. It's also nice being able to let other people make selections from their own devices/media accounts. My TV also takes advantage of CEC capability which means I can start \"casting\" at any time as long as my TV is on without having to select input from remote.I've been using the Chromecast for about 2 weeks now and have had few problems.  Setup was simple: Install Chromecast app on phone, hook up Chromecast, setup wireless network on Chromecast, click \"cast\" button on compatible app.  The streaming quality is very good (takes a few seconds start stream and a few more to get to 1080p).  I've got all my personal media on my HTPC, but I've hardly touched it since Plex can send it all to the Chromecast.There are a few glitches in the app controls (Netflix doesn't always disconnect properly, but doesn't affect switching apps) and I would love to see more apps with compatibility, but otherwise it's really nice.  I don't think it would be much good to someone with Roku or a nice Smart TV, but for the price it's a nice upgrade for a regular TV.", "verified": true, "helpfulness": "0/0", "author": "malachi"}, {"rating": 3.0, "review": "Although I like this for what it does, it doesn't go nearly far enough.From all the hype about this product it falls short!  Installation did not go well and had to work through the process 3 times before successfully getting it working.  Then found out it doesn't work for Chrome running on an iPad, the main vehicle I had intended to use.  Then I found it doesn't work on Chrome running on Microsoft Surface machine... another bummer.  Apparently you need what they call \"a real computer\" running Chrome to use this... my wife just got a Google Nexus and will try using it next week; keeping fingers crossed.Unlike a hdmi connection to your computer (I do this with my iPad... I wanted the wireless ability) you only see what the browser or specific program puts up.  It does not let you see everything on your computer as I had been led to believe from the ads for the product.Big plus however is that it only cost me $35; not much more than a good hdmi cable!", "verified": true, "helpfulness": "0/0", "author": "C. Collier \"Clint Collier\""}, {"rating": 3.0, "review": "I thought that this was an inexpensive Roku replacement; its not.  It is totally dependent on you phone or pad to stream content then it in turn projects it onto the TV.  It will extend what you view on your pad or phone onto a HD screen.  What it does, it does well, but you definitely get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "Craig H Casey"}, {"rating": 5.0, "review": "Easy to connect and works very well as described! I will purchase another one for other family members to use.", "verified": true, "helpfulness": "0/0", "author": "JVM928"}, {"rating": 3.0, "review": "I just don't use it enough. Probably because my TV doesn't have enough HDMI connections. And more apps would be great too.", "verified": true, "helpfulness": "0/0", "author": "tony"}, {"rating": 5.0, "review": "I love it! I no longer have to run an HDMI from my Mac to the TV!!! Well worth the money!!", "verified": true, "helpfulness": "0/0", "author": "rachel oakes"}, {"rating": 2.0, "review": "made viewing a program streaming from my laptop impossible...haven't used it since.  was only $35 so not going to bother returning it, but pretty disappointed.", "verified": true, "helpfulness": "0/0", "author": "ak83"}, {"rating": 4.0, "review": "I got the Chromecast primarily to stream videos from my browser window - YouTube, Vimeo, Hulu free, and other sites with embedded video (we have a PS3 for other services, like Netflix). For our purpose, this was the perfect little tool, and I'm pretty satisfied with how it works. There have been a handful of instances where the audio and video get out of sync, but it isn't very common. We live in a tiny one-bedroom apartment, so the computer, TV and wifi router are all in the same room all the time.", "verified": true, "helpfulness": "0/0", "author": "A.E."}, {"rating": 1.0, "review": "This was a waste of money. If your looking to stream video from the PC to the TV get a Roku.", "verified": true, "helpfulness": "0/0", "author": "Steve Rossi \"Steve R.\""}]