[{"rating": 5.0, "review": "First of all, I haven't tried the alternatives to this.However, I don't feel like I need to! I absolutely love my Fire TV. It responds quickly, even if the remote is under a bunch of blankets, upside-down, and facing away. I bought a mount for it, so it's out of the way on the back of my tv, but the box is so small you could put it anywhere.It doesn't come with an HDMI cable, but they're fairly inexpensive. Also, this is fairly obvious, but it doesn't come with a Netflix, Hulu Plus, or Amazon Prime membership, but you do have access to free trials of each. Thankfully, I already had them so we were watching shows within 20 minutes of receiving the package!I love that I can use my phone to find YouTube videos and play them on the tv with virtually no wait time. The games I downloaded on my Kindle last year appeared quickly and can be played without any trouble (no lagging).I would definitely recommend this to everyone I know!!", "verified": true, "helpfulness": "1/1", "author": "Zombiegz"}, {"rating": 5.0, "review": "As an Amazon Prime member I occasionally watch Prime content on my iPad while exercising.  After learnig about Amazon Fire TV I could not resist giving it a try.  The product arrives well-packaged in frustration-free Amazon packaging.  The Fire TV device itself is quite small and is not a whole lot bigger than  a deck of playing cards.  It comes with a USB power cord (with an AC adapter) but requires a separate HDMI cable (not included).  I bought mine on sale, and the Amazon HDMI cable I purchased (Medialink) still amounted to less than the recommended sale price.The Fire TV comes pretty much pre-configured.  I plugged mine into my Yamaha stereo receiver at home (which has HDMI inputs to interface with my TV), and plugged the included AC adapter into an AC outlet.  I turned on my TV and the Fire TV product instantly brought up a brief tutorial to show me how to use it and allowed me to configure it to access my home Wi-Fi router.  Everything was quick and easy to configure, and I was browsing free Prime video content in no time at all.  It was easy to stream free Prime videos and view them on my TV.If you are an Amazon Prime subscriber, Amazon Fire TV is a no-brainer.  It is a very low-cost way to stream TV and movies that are free with your Prime membership right through your home TV set.  The content streams smoothly, and the included remote control is easy to use.  It is a great bargain.  Buy it and you won't regret it.", "verified": true, "helpfulness": "1/1", "author": "Terry R. Nye"}, {"rating": 2.0, "review": "We had been led to believe that we could call up TV shows individually and play them on the TV.  Then we find out that we have to pay for each episode.  That is a real bummer because when you select an episode you cannot always tell if you have seen that one until you have already purchased it.", "verified": true, "helpfulness": "1/2", "author": "Gary Cheatum"}, {"rating": 5.0, "review": "tied into my netgear when roku would not", "verified": true, "helpfulness": "0/2", "author": "Furman Bryant"}, {"rating": 5.0, "review": "This is very good.  Just like advertised.  As to movie and program selection, not to much to my tastes.  Voice search seem to bring up mostly for pay not Prime free stuff.  Still, would buy again.", "verified": true, "helpfulness": "1/2", "author": "Chris A. Lund \"NoKaboom\""}, {"rating": 3.0, "review": "If I lost this device I would replace it with another Roku.", "verified": true, "helpfulness": "0/1", "author": "G. Spendlove \"Az Nephi\""}, {"rating": 4.0, "review": "I returned since Amazon Prime TV offered the same.", "verified": true, "helpfulness": "0/0", "author": "Charles F. Foley"}, {"rating": 5.0, "review": "so far so good", "verified": true, "helpfulness": "0/0", "author": "Brenda Tyler"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "still working with it, but neat so far.  Must have direct tv or dish to make most apps work so they don't work if you get rid of your satellite service.", "verified": true, "helpfulness": "0/0", "author": "Aspen Incashola"}]