[{"rating": 5.0, "review": "Love it!  Great little streaming box!", "verified": true, "helpfulness": "0/0", "author": "mary mendez"}, {"rating": 5.0, "review": "It's pretty amazing", "verified": true, "helpfulness": "0/0", "author": "michael d wagner"}, {"rating": 4.0, "review": "Working good", "verified": true, "helpfulness": "0/0", "author": "Yassine Ghozzi"}, {"rating": 5.0, "review": "I'm using it as a network player with Kodi and all works as expected.", "verified": true, "helpfulness": "1/1", "author": "Adrian Nicolae"}, {"rating": 4.0, "review": "Super fast. Just wish they would update movies faster. Prime is the best!", "verified": true, "helpfulness": "0/0", "author": "kevin"}, {"rating": 5.0, "review": "I had a roku stick that constantly gave me issues and most of the time would only partially connect (therefore not work).  After a frustrating back and forth with roku, a friend recommended the fire box. I was optimistic after I compared them online but was amazed once I received and hooked it up. The picture and overall functionality are far superior to roku, my connection issues are a thing of the past and the voice remote is a really neat feature.  The HBO GO option and that it auto populates the Prime free options is very convenient.  Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Julie Gardner"}, {"rating": 4.0, "review": "My cable company is Charter and your system doesn't work with it", "verified": true, "helpfulness": "0/0", "author": "Becky Eibl"}, {"rating": 5.0, "review": "I want to say this is awesome. We love it so much we cancelled the att tv. My husband is not good with technology and in no time he was finding his way around. No network issues. We love the YouTube app and netflix with sling tv. Thank you for making my life simple yet up to date", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Fannie Ngekia\""}, {"rating": 5.0, "review": "Amazing! This is the best set top I've ever used! Turned in my Roku 3 because this thing blew it out of the water!", "verified": true, "helpfulness": "0/0", "author": "G3TG0T"}, {"rating": 5.0, "review": "Works perfectly. We cut the cord and this is everything my family needs.", "verified": true, "helpfulness": "0/0", "author": "Charles Jackson"}]