[{"rating": 5.0, "review": "Super easy to setup and use. I went from in the box to casting my netflix in about 2-3 minutes. Download and install your chromecast app and extensions after you order so you can get going as soon as it arrives!The only thing to note is that it is a bit more difficult to setup on hotel wifi if you plan on travelling. It can still be done but will need to have either a) a laptop/device that can share the wifi connection or b) use a travel router. Problem is the chromecast cannot login to hotel wifi as they usually require a name and password/room number instead of utilizing wifi passwords.", "verified": true, "helpfulness": "0/0", "author": "Kenny Chan"}, {"rating": 4.0, "review": "Because not everything can be visually transferred from Google Chrome.... (i.e. NBA League Pass Broadband), it\"s not worthy of 5 stars.", "verified": true, "helpfulness": "0/1", "author": "R. Gordon \"Flash Gordon\""}, {"rating": 2.0, "review": "I thought I could stream any video I want, but seems only YouTube videos work :-(  not as what the advertisement says.", "verified": true, "helpfulness": "1/1", "author": "Ezzedeen A. Khayyat"}, {"rating": 3.0, "review": "It's a great product and have been using it everyday. The problem is that the advertisement of the product makes you think that everything can be displayed on a TV for example; in reality, you can only view for example HBO GO, Nextflix, YouTube and a few others.  But if you have Crackle or Showtime or want to show your pictures to the view on your TV, it doesn't work.I would have still bought it even if I knew all of the streaming it could do or may I say limited; I still have a chance to watch some good movies in another room without going to the main room to watch it.What would make it a 5 start?  Much more selections with variety.", "verified": true, "helpfulness": "0/1", "author": "Carol"}, {"rating": 5.0, "review": "This small little inexpensive device can add so much more to your Television screen. I totally love it. Though, some of the services/ apps which it supports are not yet available in India. But still, it is a great buy.", "verified": true, "helpfulness": "0/1", "author": "Vaibhav Bakhshi"}, {"rating": 4.0, "review": "When I pluged and accessed it by my computer. The instalation wizard said that recommended way was using the android app to configure Chromecast, I tryied, but the app didn't work. In final step Chromecast found my router but was unable to find internet.I canceled everything and started again, now using my computer and the instalation was a success.Works with netflix, but don't work with other apps (like VLC) and official SDK was not release yet.", "verified": true, "helpfulness": "1/1", "author": "Marco"}, {"rating": 5.0, "review": "Google does it again.  Exceptional technology at minimal cost. It turns any TV into a smart TV that is controlled by your phone or tablet.", "verified": true, "helpfulness": "0/1", "author": "zachary dumont"}, {"rating": 1.0, "review": "Theoretically, it is supposed to let you see things on the computer on a big TV screen. But it is cumbersome and complicated to operate, and you have to pay for most of the content.", "verified": true, "helpfulness": "4/5", "author": "Elisabeth Glaser \"Historian\""}, {"rating": 2.0, "review": "I bought this mainly for casting chrome browser to my tv. but is slow, chrome freeze at times, lag in video.I'm using twonky beam free android app which works a bit better.at $35, it may pose worthy but doesnt help much for an useful casting.", "verified": true, "helpfulness": "1/1", "author": "NP \"-np-\""}, {"rating": 2.0, "review": "Sometimes stop working when I use Youtube and I need to restart the TV also I hope that they will have more apps I can use in the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "3boosh"}]