[{"rating": 5.0, "review": "I have a nexus 7 HD and this is a great combo to have with it. I have all my music and movies through Google play so it is nice to be able to rent a movie and surf the internet.Buy an extra for other TV, moving it from TV to TV is not ideal.", "verified": true, "helpfulness": "0/1", "author": "Garrett Rice"}, {"rating": 2.0, "review": "It seems to be a hit and miss when trying to connect to devices on the network.  After EACH viewing, I find myself having to disconnect the Chromecast, wait a few seconds, then plug it back in for it to show up as ready to cast.  it's not the worst thing that could happen but it's definitely not as easy and convenient as I had anticipated.  At this point. I am seriously considering trading the teenager for the Roku 2 that lived in our room before the Chromecast,", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "After having waited months for it to be in stock again, I bought this.  I just think there are better options out there for streaming onto a TV.", "verified": true, "helpfulness": "0/0", "author": "Hoonie Kang"}, {"rating": 5.0, "review": "While there is not a lot of apps for Win 8 right now that can utilize Chromecast, what's available works great.  I'm sure that more will come.  Chromecast does not work like Apple airplay, so don't think everything on your Win 8 device will play to the TV or you will be disappointed. Only certain Win 8 apps such as Netflix, Hulu, etc., will play at the present time.", "verified": true, "helpfulness": "0/0", "author": "jfhnhh \"jfhnhh\""}, {"rating": 5.0, "review": "Very convenient little device! Easy to set up and easy to use, it makes a simple chore out of watching Hulu, Netflix or listening to music. And new apps are being added all the time.All we need is an Amazon Prime app (which probably will never happen due to Amazon Fire TV).", "verified": true, "helpfulness": "0/1", "author": "Giuseppe Baldi-Castro"}, {"rating": 5.0, "review": "I don't know why I have to do a hard reset every once in a while.  I also found through trial and error that I had to set my WiFi AP to be G-only to get it to work (not B+G).  Also, if you're thinking of using it on the road in hotels, forget it.  Hotel WiFis require a login via web page or at least accept their terms.  There's no easy way to do this without a browser.  There are forums that talk about it, but I haven't been able to make a workaround succeed.  I may try using a laptop to spoof its MAC address.", "verified": true, "helpfulness": "0/1", "author": "Koset"}, {"rating": 5.0, "review": "Pros - stream music and video from phones and tablets. Tablet and phone supported apps are flawless and stream just like a smart TV or better. Quick and no lag on my network. Setup was simple.Cons - Limited apps are supporting it (SDKs released so now anyone can write apps for Chromecast ---> expect many more) . Desktop Chrome Browser to TV is laggy (I dont use it anyway just tried it out - it sucked).  No screen mirror from tablet to TV.", "verified": true, "helpfulness": "0/1", "author": "*BSSD*"}, {"rating": 1.0, "review": "I use a hotspot on my 4G mobile to broadcast and the audio is OK but the picture is delayed.", "verified": true, "helpfulness": "0/1", "author": "Drew R."}, {"rating": 5.0, "review": "I don't think it can be compared to the apple tv or devices like that, but the ease of quickly popping a youtube vid or Pandora from my device to the TV is unparalleled.  It really is a nice device to use with an android based phone or tablet.I do hope they expand out the apps available and continue to develop for it so there is a wider range of capabilities for it, but I knew the capabilities when i bought it and it beats the tar out of using a TV remote to move around a letter grid to locate a youtube vid.  I also LOVE the pictures that the device cycles through on the TV when the device is not in use.", "verified": true, "helpfulness": "0/1", "author": "Jeffrey A Spink"}, {"rating": 5.0, "review": "Very good product. Nice stream for any kind of entertainment. Google play and Netflix work very good also in HD.", "verified": true, "helpfulness": "0/0", "author": "J. F. AVELLANEDA"}]