[{"rating": 5.0, "review": "Easy to install! Easy to use!", "verified": true, "helpfulness": "0/0", "author": "Linda  Beechener"}, {"rating": 3.0, "review": "it's good. Disappointed that every movie that I request is unavailable and, yes, I was requesting older movies as in 2013. Sorry that I had purchased berfore the \"stick\" came out. Would love to get rid of the extra \"box\".", "verified": true, "helpfulness": "0/1", "author": "Jlty45"}, {"rating": 2.0, "review": "It was quite easy to set up and use, but I was disappointed with what I could get on Amazon fire.  One of the original series never was available and others I can just get on cable.  So the jury is out on whether this is really a useful purchase.", "verified": true, "helpfulness": "0/1", "author": "Brian D. Woodruff"}, {"rating": 3.0, "review": "It's relatively easy to use.  However,  I still can't use the mic.  I'm not clear about how to use it.  I can find my watch list and prime movies and tv shows, but I think I should be able to get more use from it.", "verified": true, "helpfulness": "0/0", "author": "Cheyenne Long \"Cheyenne\""}, {"rating": 1.0, "review": "This is a piece of junk , most of the apps crashes or doesn't work though the processor is pretty fast and the movies you rent doesn't play at all it gives errors like windows 98. Very disappointed with the way it works . Cannot recommend .", "verified": true, "helpfulness": "1/4", "author": "kondal"}, {"rating": 5.0, "review": "Excellent product for the Price", "verified": true, "helpfulness": "0/0", "author": "Stevie H"}, {"rating": 3.0, "review": "OK FOR WATCHING NETFLIX. I WISH i HAD REALIZED THAT ALMOST ALL CONTENT IS GEOLIMITED", "verified": true, "helpfulness": "0/1", "author": "Raymond C."}, {"rating": 3.0, "review": "This is a nicely packaged little gadget - not unlike the many other options out there (Apple TV, Roku, etc..). I also have two Apple TV's and wanted to see how the Amazon Fire TV compared.As many reviews have noted, it's super easy and quick to set up and connect so that you're ready to go.After watching the tutorial guide I wanted to see what was available.This is where the major disappointment came in: I am not a PRIME member so it doesn't take long to realize that you have to pay for EVERYTHING.The remote is pretty well designed and easy to learn.The voice recognition feature seemed to work well - but I didn't try it extensively.Then I tried watching a trailer  - second disappointment: the dreaded \"buffer wheel\" made me exit out after two minutes. If I can't even watch a trailer without interruption, then I shudder to think what a movie would be like.Finally, I am not a gamer and no kids - so a LOT of content is of no interest for me.If I'm going to pay for content then I might as well stay with DISH and get PPV or VOD movies with a lot less hassle.If Amazon and others are touting this as the \"future\" and for cable and satellite cutters, I think the future is a long way off. If you have to pay for everything you very quickly reach the same cost as cable or satellite.I'm glad I got the refurb and saved a few bucks...I may still send it back for a refund.", "verified": true, "helpfulness": "0/1", "author": "F. Dumanoir \"vintage hifi-geek\""}, {"rating": 5.0, "review": "I'm loving this amazon fire TV!", "verified": true, "helpfulness": "0/0", "author": "Todd J. Cecil \"Floridian\""}, {"rating": 3.0, "review": "The concept is very good but the choices are very limited.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]