[{"rating": 5.0, "review": "Best value around. Just use your phone or tablet as a remote to control it. Take it anywhere with you. Now, with my LG G2, I can mirror the screen to any TV.", "verified": true, "helpfulness": "0/0", "author": "D. rainey \"dar\""}, {"rating": 4.0, "review": "The chrome cast was easy to set up and use. I would recommend this product especially for ppl who are not techies like me.", "verified": true, "helpfulness": "0/0", "author": "Heidi Miller-Marchand"}, {"rating": 3.0, "review": "It's okay, not great... was expecting something way better.... certainly does lag behind the video on a PC when you send it to the TV. Picture clarity is OK, thought it might be better. A big plus: this is so easy to set up, on screen promps walked you through the whole process.. To some it might be worth the $26 ...... but I would just buy a long HDMI cord.", "verified": true, "helpfulness": "0/0", "author": "crackerssouth"}, {"rating": 5.0, "review": "Best Google product ever.", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 3.0, "review": "It's working out great for my phone but I am disappointed that it is not compatible with my Kindle fire HD.I record my Instructors from both lec and lab and it would have been nice to have them on a big screen through chrome!!!! Oohhh!!!!!Well!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Tanya Lafayette"}, {"rating": 5.0, "review": "Works as advertised. Wish it supported a few more apps like Amazon.", "verified": true, "helpfulness": "0/0", "author": "Labrat0116"}, {"rating": 5.0, "review": "I have been enjoying with this itemI can see movies easily with a big screen without tired", "verified": true, "helpfulness": "0/0", "author": "Amirah aljaghthami"}, {"rating": 1.0, "review": "Lame quality and speed", "verified": true, "helpfulness": "0/1", "author": "Yaniv Nisim Siso"}, {"rating": 4.0, "review": "Wish it had more apps but overall it's great", "verified": true, "helpfulness": "0/0", "author": "Michael Obergfell"}, {"rating": 4.0, "review": "Works great with Chrome and Android as well as certain apps that you find on iOS.My only issue with it is that it does not support 5ghz wifi.", "verified": true, "helpfulness": "0/0", "author": "William no"}]