[{"rating": 5.0, "review": "Couldn't be happier with this little thing. I love being able to share with others the things I do on my computer.", "verified": true, "helpfulness": "0/0", "author": "Darlene Clark \"book worm\""}, {"rating": 5.0, "review": "Simple setup, easy to use, fun for exploring the different functionality.", "verified": true, "helpfulness": "0/0", "author": "Joshua S."}, {"rating": 5.0, "review": "This can replace your cable or satellite provider.", "verified": true, "helpfulness": "0/0", "author": "Hans Struzyna"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "robert"}, {"rating": 3.0, "review": "Still can't find a way to project simple non-\"app\" applications like MS Excel to the screen.  I have a Surface Pro 3 linking to a brand new Samsung 60\" LED 3D Smart TV.  Neither Chromecast nor Samsung's app work to truly mirror the screen wirelessly.Video playback (e.g. via netflix, Youtube or Chrome / IE / Firefox) is very laggy (much more so than watching directly on the device).", "verified": true, "helpfulness": "0/0", "author": "Michael Lawrence"}, {"rating": 4.0, "review": "Perfect state, thanks", "verified": true, "helpfulness": "0/0", "author": "Jenn Aragon"}, {"rating": 5.0, "review": "The Chromecast is great. I recently bought myself a Vizio and wanted a chromecast instead of a smart tv. It's way worth it for the money. It is capable of doing anything a smart tv can do.  Definitely would recommend it!", "verified": true, "helpfulness": "0/0", "author": "Kristyn"}, {"rating": 5.0, "review": "Recommend it to everyone", "verified": true, "helpfulness": "0/0", "author": "Haitham R. Khanji"}, {"rating": 4.0, "review": "All is ok, it works well with android last version.", "verified": true, "helpfulness": "0/0", "author": "Jorge S."}, {"rating": 5.0, "review": "This is possibly the best thing ever invented. The only way it is hard to set up is if you can't read. Wait, scratch that, the directions on the inside of the box (there are three steps) are written out in pictures. This thing is amazing. What I love the most is that it is super portable. I've used it for everything from the usuall stuff like TV shows, streaming YouTube and Comcast to some other stuff like a projector replacesment - I just cast my powerpoints from my smartphone!Buy this. Buy one for every TV you have. Do it now.", "verified": false, "helpfulness": "8/8", "author": "Del Belcher"}]