[{"rating": 4.0, "review": "Great box to own, works well and user friendly for all!", "verified": true, "helpfulness": "0/0", "author": "Goodnews"}, {"rating": 2.0, "review": "Like the ability to navigate content, but it just seems like everything is \"for sale\", which is off-putting.", "verified": true, "helpfulness": "0/2", "author": "Alan Smithee"}, {"rating": 4.0, "review": "I'm really liking the set up of Amazon Fire compared to Apple TV, which we had (and still do) for a long time. We'll probably continue to go back and forth between both, for different reasons. The only reason I won't give Amazon Fire 5 stars is because they make a point of making fun of other boxes, like Apple TV, with the search set up using a keypad you have to move the cursor around. That's what the voice search option is supposed to cover, right? Well, only if you're searching for apps on the Fire, or for movies/shows on Amazon. If you're within an app, it doesn't work. You still have to use a keypad. :) I wouldn't mind so much, if Amazon hadn't made such a point of making their Fire sound so superior because of the voice search. Operationally, though, I love it.", "verified": true, "helpfulness": "0/0", "author": "T. Stone"}, {"rating": 5.0, "review": "I normally watch movies and shows from Amazon or netflix on my blue ray players wifi, which was ridiculously slow. I always that it was slow because my internet want keeping up. I got Amazon fire for Christmas and I'm very impressed. It's a lot faster thumbing through the browser and my video never has to spend time loading. The voice search is nice, the games are ok. If you play games on a console or pc I wouldn't waste the money on a controller for this.", "verified": true, "helpfulness": "0/0", "author": "Jeremy"}, {"rating": 5.0, "review": "I bought this with the game controller and I really like it. I already had Amazon prime and a Kindle Fire so I'm able to do a lot with it.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "my internet did not support it, unfortunately", "verified": false, "helpfulness": "0/0", "author": "susan e fletcher"}, {"rating": 5.0, "review": "Amazon TV is awesome. We all love it", "verified": true, "helpfulness": "0/0", "author": "Carroll Dortch"}, {"rating": 5.0, "review": "Love it.....", "verified": true, "helpfulness": "0/0", "author": "Stacie Knight"}, {"rating": 5.0, "review": "So far is great!  Love the small size. Easy to hook up with my subscriptions. Love the Amazon streaming!", "verified": true, "helpfulness": "0/0", "author": "Colo Camper Mom \"colocampermom\""}, {"rating": 5.0, "review": "Loving it!", "verified": true, "helpfulness": "0/0", "author": "Scratpaws"}]