[{"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "donald brown jr"}, {"rating": 5.0, "review": "kids like watching certain show and easy to find once they have been watched", "verified": true, "helpfulness": "0/0", "author": "JOANNE PROFFIT"}, {"rating": 5.0, "review": "We love Prime.  It is just what we want in a television service.", "verified": true, "helpfulness": "0/0", "author": "Dottie Thompson"}, {"rating": 5.0, "review": "The Best!", "verified": true, "helpfulness": "0/0", "author": "Batmon-ey"}, {"rating": 5.0, "review": "This is a great product, but the clincher has been Sling TV and HBO Now.  We can get all the shows we want now without being at the mercy of the  cable providers.  Telling the cable company to cancel my subscription was immensely satisfying.  =)", "verified": true, "helpfulness": "0/0", "author": "Lawrence Dickinson \"LJD\""}, {"rating": 5.0, "review": "Its just great I really enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Marie Roesing"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Robert D Slay"}, {"rating": 5.0, "review": "Absolutely love our Fire TV. Easy set up and operation with a TON of things to watch. We loved it so much, we bought one for our kids playroom so they could watch what they wanted in their without hogging our tv. My 6 yo and 2 yo know how to operate the remove and find shows they want. The parental controls leave a little to be desired. It seems it is EVERYTHING IS LOCKED DOWN or NOTHING IS LOCKED DOWN.  Id like to be able to have more control of how it locks down and what it does. But, I really am please with this device and I suggest them to everyone. We actually got rid of cable and just have Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 3.0, "review": "I did not really know what to expect. It is ok but I do not use it that much.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 3.0, "review": "Hardware is good enough. Operating system sucks. But that's Amazon", "verified": true, "helpfulness": "0/0", "author": "Var"}]