[{"rating": 5.0, "review": "i love this! if you love movies a must get imo", "verified": true, "helpfulness": "0/0", "author": "Carlo"}, {"rating": 5.0, "review": "I wanted this for my bedroom TV.  I have a wi-ifi Blu Ray player in my living room, but I wanted to be able to watch Netflix in my bedroom.  This was on sale and I decided to try it.  You do not need a Cablebox to use it.  It works well and the customer service is excellent.  I do have a flat screen TV in my bedroom.  Well worth the price.  Streams from my iPad.  My niece has three of these in her three homes.", "verified": true, "helpfulness": "0/0", "author": "L. Wolke \"Lenore from Jersey\""}, {"rating": 5.0, "review": "Love this device!! Works perfectly with my Plex Server. i love the ability to take this on the road and plug into a hotel TV and watch my content. Very Cool!", "verified": true, "helpfulness": "0/0", "author": "Doug Christen"}, {"rating": 5.0, "review": "THANKS", "verified": true, "helpfulness": "0/0", "author": "DJ.in the house"}, {"rating": 5.0, "review": "love my Chrome it was easy to set up", "verified": true, "helpfulness": "0/0", "author": "Lida"}, {"rating": 5.0, "review": "Excellent for the price!!!", "verified": true, "helpfulness": "0/0", "author": "Shelby Roberts"}, {"rating": 5.0, "review": "The only thing I don't like is that I can't watch any Amazon movies on my tv with my prime membership because evidently Amazon has them blocked somehow from Chromecast", "verified": true, "helpfulness": "0/0", "author": "microsoftfree"}, {"rating": 4.0, "review": "Great device...  streamed from my Ipad, laptop, and Android phone (Note 4).", "verified": true, "helpfulness": "0/1", "author": "Michael Wyman"}, {"rating": 5.0, "review": "Love the Chromecast. It's a must if you have any movies/shows on Google Play. I've haven't tried the Fire Stick (which is roughly the same price) but this is wonderful except that it doesn't have Amazon Instant Video on it, yet. They're adding more apps every day, though!", "verified": true, "helpfulness": "1/1", "author": "buhfly"}, {"rating": 5.0, "review": "I love it! I use it everyday!", "verified": true, "helpfulness": "0/0", "author": "dburgs21"}]