[{"rating": 5.0, "review": "I can cast my freaking Note 3's Screen onto my TV!!!! I can even watch home videos of me and the girlfriend or her friend or whatever right in the living room!!! If this came with a box of tissues I would have ordered two!!!!", "verified": true, "helpfulness": "0/0", "author": "Jason K."}, {"rating": 5.0, "review": "Liked it so much, had to get a second one! You won't be disappointed :)", "verified": true, "helpfulness": "0/0", "author": "Ricardo Baladron"}, {"rating": 5.0, "review": "Once your figure it out.... It's AWESOME :-)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great and loads quickly with a fast internet connection.", "verified": true, "helpfulness": "0/1", "author": "Renato Rodriguez"}, {"rating": 5.0, "review": "We've used our PS3 to stream everything. However upon recently trying to get HBO Go to work we discovered our cable provider (Starts with C for crud) blocks the PS3 from streaming. Luckily my husband is an IT guy and quickly found a wonderful solution to the absurdity our cable provider created. We have no issue streaming HBO Go with chromcast. In fact we love how easily you can switch between youtube and netflix that we only flip back over to the PS3 for Amazon prime. Super happy we got this!", "verified": true, "helpfulness": "0/0", "author": "Diana"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Greg L"}, {"rating": 5.0, "review": "Great product and great price", "verified": true, "helpfulness": "0/0", "author": "Ronald Rojas"}, {"rating": 5.0, "review": "I'll start by saying that I'm not using this unit as intended. I have a Fire TV which is, hands down, best in this class of devices. However, the Fire TV is just a little too big to take with me on trips. I use a Plex server for my movies and TV shows. I have Plex clients on all my mobile devices and sync various videos before a trip. Sometimes it's nice to see a video on a big screen, even if your tablet is technically better. So I plug this into the HDMI of a hotel TV, connect the USB power, seemingly also always present on flatscreens, and screencast my synced Plex material right to the screen with full quality audio/video. There is no compression involved unless you chose to transcode during Plex sync to save space, but that happens before the casting.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this", "verified": true, "helpfulness": "0/0", "author": "kimmy"}, {"rating": 4.0, "review": "This does allow us to see many movies.  The quality of the movies is not always great but at least we get the gist.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}]