[{"rating": 3.0, "review": "its fine i spend half the time trying to find a decent movie or show they have a lot of trash and when you find a decent show you have to pay for it i don't think its right to pay for a service then have to pay again to use it", "verified": true, "helpfulness": "0/0", "author": "T."}, {"rating": 5.0, "review": "Everything about it is so neat....compact and easy to set up and use.  A nice option is if you like a certain actor/actress, all you need to do is speak their name into the mic and presto  their movies appear.  Then, just select the ones you want to watch.  Perfect addition for the TV", "verified": true, "helpfulness": "0/0", "author": "Persona"}, {"rating": 5.0, "review": "Best thing we ever bought. Love being able to watch prime on the big screen!", "verified": true, "helpfulness": "0/0", "author": "Sheree L. Britt \"Boo's veg-a-nut\""}, {"rating": 5.0, "review": "Awsome product, my kids love it", "verified": true, "helpfulness": "0/0", "author": "LeoNev"}, {"rating": 5.0, "review": "I really made a good buy with this purchase. The only thing I don't like is I don't get to watch my sports live and some news programs, but all in all, IT'S GREAT!!!!", "verified": true, "helpfulness": "0/0", "author": "AC Thompson III"}, {"rating": 5.0, "review": "The amazon fire tv is great.  Lots of movies to choose from on prime and  movies downloads fast.  Only one thing that I found is that every once in a while, the device has to be reset, but that is very easy.  Over all it is a great investment.", "verified": true, "helpfulness": "0/0", "author": "Gail Ruth"}, {"rating": 3.0, "review": "Decent streaming... still looking for more content as a Prime member.", "verified": true, "helpfulness": "0/0", "author": "Michael G"}, {"rating": 5.0, "review": "No hiccups or pixelating!! I have several different devices including web ready television and Chromecast. This by far is the better product, it would be nice to be able to watch more televisions shows LIVE!! through the device, or have a web browser built in.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"randymir\""}, {"rating": 5.0, "review": "its been an awesome experience to stay home and watch movies. great little box", "verified": true, "helpfulness": "0/0", "author": "H"}, {"rating": 5.0, "review": "Best buy ever", "verified": true, "helpfulness": "0/0", "author": "roiber"}]