[{"rating": 5.0, "review": "I'm very pleased with amazon fire. So easy to use, great interface. Only bummer is that it doesn't have vudu capability.  Otherwise, it's fast and a must if you have amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Annie Okazaki \"Annie O\""}, {"rating": 5.0, "review": "Streaming is fast, picture is great.  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Dori"}, {"rating": 5.0, "review": "LOVE this --this helped us dump our cable!!!", "verified": true, "helpfulness": "0/0", "author": "Dr. S."}, {"rating": 3.0, "review": "Been having performance issues over the first month we have had this unit.  Shows freeze and some buffering issues.  It is not the internet speed because another product I use runs flawlessly on our internet.", "verified": true, "helpfulness": "0/0", "author": "Matthew Brabant"}, {"rating": 4.0, "review": "I really like the Amazon Fire TV. It is more than I expected. I did not like Amazon holding it a week before shipping it. I also do not like that I can not use my Amazon card or Amazon gift card to purchase Amazon Prime. I must use a separate charge card that is not Amazon. Why is this.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 3.0, "review": "I bought this because the amazon app on my TV was running slow.  The TV is older and just doesn't have the horsepower required.  the video is better and it's a lot easier to find stuff to watch.One frustrating problem was when I plugged it in to my TV it screwed up the Sync/Arc connection (tv talking to the stereo receiver over hdmi).the fix is to set the display setting to fixed from auto.  yes the display 1080p 60hz", "verified": true, "helpfulness": "0/0", "author": "Alfred"}, {"rating": 4.0, "review": "It has preformed exactly as I expected. Does a great job!", "verified": true, "helpfulness": "0/0", "author": "shawn delatte"}, {"rating": 5.0, "review": "Pretty fantastic for what I need it for.", "verified": true, "helpfulness": "0/0", "author": "kelly"}, {"rating": 5.0, "review": "I like this much better than the ROKU player. I have both units Ethernet wired to the router on a 100 mbps modem and line.The ROKU freezes, stutters, and drags while loading channels and videos intermittently. There have been occasions when I've had to unplug the ROKU for a minute, plug it back in, and wait for the reset to finish. For this reason I looked for an alternative and found the Fire TV.So far, I have not experienced any of the above issues with the Fire TV. And, I have HDMI wired the Fire TV through my home theater system. Channels and programs come up almost instantaneously. I am, however, leaving the ROKU hooked up to one of the TVs - the one not used that often.One feature I love about the Fire TV is that you can put it to sleep. The ROKU is always on from the day I bought it. There is no on/off or real sleep. The unit is always on.Setting up music and playlists took a little getting used to as you have to go into your Prime account to perform the setups. Other than that, it's pretty simple.Cons:The carrousel sucks. You can only go one direction - left to right. When you get to the end you have to pan back through the channel/program carrousel, hit the back button, or home. The carrousel should be set up to loop back to the beginning when the last channel/album/program is reached.Same issue with the main menu on the left. Get to the bottom and you have to scroll back up or press the \"home\" button. I can live with these two very minor issues - they are not a deal breaker at all.Bottom line is that I do believe, from experience, this is a much better product than ROKU.", "verified": true, "helpfulness": "0/1", "author": "Gomez Cooley \"Climber\""}, {"rating": 5.0, "review": "We had a Panasonic Lan which was very slow. Upon extensively researching all systems, we decided on the Amazon Fire TV and ordered threefor our household.  One to test and then two more that week.  Shipping was  very fast and they were so easy to set up.  We have a top of the line Netgear router and have no buffering on any of the movies or programs, even on the second floor. They all run as wireless units.This is a huge benefit when you can't run any cable wires to some bedrooms due to location and totally finished rooms.We also love the automatic updates and the new programs.  You've done everything right.Congrats Amazon!", "verified": true, "helpfulness": "0/0", "author": "com1 \"carolm5\""}]