[{"rating": 5.0, "review": "The voice search feature sets this device far apart from the \"on demand\" feature from my cable provider. The time spent from beginning to search to watching content is negligible. I have yet to experience any buffering or loss of content while streaming. I am using this in a device wireless configuration and my home bandwidth is in the mid-range as far as download speeds go. The remote is simple and intuitive to use. Another plus is that you can mount it on the rear of the TV, so there isn't yet another device cluttering the entertainment center. I bought it on Amazon.com and there was literally zero set up. It automatically synced up with my Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "Nick Blady Jr"}, {"rating": 5.0, "review": "I LOVE THIS! So easy to set up and we now have a great selection of free movies with Amazon Prime. I have to purchase another one for the den TV. Hubby and I don't always agree on what to watch. This will pay for itself with movie rental charges now out the window!", "verified": true, "helpfulness": "0/0", "author": "PattyCake"}, {"rating": 5.0, "review": "Love, love, love!  The only thing that is a bit of a bummer is the fact that ShowTime Anytime doesn't work because it's not compatible with our cable provider (Comcast).", "verified": true, "helpfulness": "0/0", "author": "Collie"}, {"rating": 4.0, "review": "I got rid of cable TV and the big cost of it.  Now I have Netflix, and recently I added Amazon Prime. We don't feel we are missing much.  Fire TV is a slick system for getting to shows. You can voice search or button search, both work flawlessly.  The Prime movies and shows are similar to Netflix but between the two we always have something to watch when we want. Having Prime also speeds my shipping from Amazon on Prime items and speeds returns if I need that. The only reason Fire TV gets 4 stars and not 5 is for the Prime TV content. Like Netflix it's not a first rate, first run movie and TV experience, it's predated.", "verified": true, "helpfulness": "0/0", "author": "I. M. Listening \"The Listener\""}, {"rating": 5.0, "review": "This is so amazing! Love it! Easy to set up and use and you have all the apps right at your fingertips from Pandora to Netflix and who could forget Amazon Prime with so many free movies and shows.", "verified": true, "helpfulness": "0/0", "author": "Angelfish729"}, {"rating": 5.0, "review": "Easy to set up & Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lisa Z."}, {"rating": 5.0, "review": "super cool product.", "verified": true, "helpfulness": "0/0", "author": "Kat Stevenson"}, {"rating": 5.0, "review": "This is great--we can watch almost everything we'd ever want to.Thanks so much.", "verified": true, "helpfulness": "0/0", "author": "Lois A. Kitto"}, {"rating": 5.0, "review": "Absolutely love it.. totally more than expected... TOTALLY AWESOME", "verified": true, "helpfulness": "0/1", "author": "Pearl"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Angela Lopez"}]