[{"rating": 5.0, "review": "The cheapest streaming device I bought and the one I use the most", "verified": true, "helpfulness": "0/0", "author": "G. Zastrow"}, {"rating": 5.0, "review": "Love it!  As more and more apps appear the chromecast gets better and better!  What a bargain and with some of the \"aftermarket\" apps that are out there the chromecast is a must have.  I have mine connected to my tablet and our cell phone and it even works with out laptops.I recently found that you can take it and connect it to multiple networks without having to do the reconnect procedure when you bring it back home.  This makes for a great birthday present and it is really easy to use so even the non-techie can figure it out.", "verified": true, "helpfulness": "0/0", "author": "mrPHOTO"}, {"rating": 1.0, "review": "This doesn't do anything my roku couldn't do and it's much more of a pain to use. Yes you can use a laptop or smart phone to queue it but then that device is also playing the show at the same time. Honestly don't understand all of the marketing hype about this.", "verified": true, "helpfulness": "1/2", "author": "SuperMom"}, {"rating": 5.0, "review": "Google", "verified": true, "helpfulness": "0/0", "author": "Erick Bonilla"}, {"rating": 4.0, "review": "It is great plugs straight into your hdmi port and needs to be plugged into a USB port for a power source and it streams from your device", "verified": true, "helpfulness": "0/1", "author": "Chess Anderson"}, {"rating": 1.0, "review": "Didn't work as well as advertised.", "verified": true, "helpfulness": "0/1", "author": "Kenneth W. Brubaker"}, {"rating": 5.0, "review": "Love Chomecast.Awesome for streaming the items my TV software doesn't have built in.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Blankenship"}, {"rating": 3.0, "review": "I'm disappointed that they haven't released a unit with 5GHZ wifi and it doesn't handle 1080P really well.", "verified": true, "helpfulness": "0/1", "author": "BryanOPs"}, {"rating": 5.0, "review": "Probably the biggest tech bargain ever!  I love this thing so much that I bought one for every TV in my house.  I love being able to stream content from my phone, laptop, and tablet.  The resolution is perfect.  Did I mention that I love Chromecast?", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Cubfan\""}, {"rating": 5.0, "review": "Stream movies to TV on your cell phone. More and more content becoming available. Google is taking over the world.", "verified": true, "helpfulness": "0/0", "author": "K. Simpkins"}]