[{"rating": 5.0, "review": "Bought this to replace a Roku unit.  The Fire is superior to the Roku inMy estimation.  The build quality and design is impressive even down to the packaging.  The operation of the device is smooth and user friendly.  Hats off to Amazon on the voice search feature also.  You hit this one out of the park!", "verified": true, "helpfulness": "1/2", "author": "SCOTT LOTTRIDGE"}, {"rating": 3.0, "review": "Fast processor, great menu speed but have had lots of restarts due to freezing or other! Swapped this for my Roku.", "verified": true, "helpfulness": "0/1", "author": "Billgon \"billgon\""}, {"rating": 4.0, "review": "works very well and has large selection to choose from", "verified": true, "helpfulness": "0/1", "author": "Vivian Hall"}, {"rating": 5.0, "review": "Love this! A great addition for anyone who likes quality entertainment. AAA+", "verified": true, "helpfulness": "0/1", "author": "Martin"}, {"rating": 5.0, "review": "Great little device.Works great with amazon prime TV and shows, netflix and hulu.Little slow on the youtube app. Syncs beautifully with other screen sharing devices.Highly recommended.(tried the roku and apple TV, and this is by far superior)", "verified": true, "helpfulness": "0/1", "author": "James Dowter"}, {"rating": 5.0, "review": "Fire TV awesome. I bought a TV during Black Friday for $100. 55\" and had no WiFi. This Fire TV has made a big difference in my TV viewing.", "verified": true, "helpfulness": "0/1", "author": "S. Sadowski"}, {"rating": 4.0, "review": "Still getting use to it, slow for a 78 year old", "verified": true, "helpfulness": "0/1", "author": "Judith Meibaum"}, {"rating": 3.0, "review": "I haven't figured out how to stream local news channels. Was disappointed that there was not many free shows as was implied.", "verified": true, "helpfulness": "0/1", "author": "Erika Rosenbusch"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "1/2", "author": "Rodolfo"}, {"rating": 3.0, "review": "I got Fire TV JUNE 3 2015 looked around on the home page that day. Watched a few movies and tv shows seemed to work ok, then in July the remote stopped working. Amazon then send me a new remote thought everything would be ok again, but NOT! The new remote stopped working in about a half an hour! Again Amazon is going to send another new remote, will see how long the new remote works! I feel like throwing everything out the window! Whats Up. I would not have rated this three stars, but Fire is ok when it works. I would have liked it more if fire TV had live TV.", "verified": true, "helpfulness": "0/1", "author": "rich"}]