[{"rating": 5.0, "review": "Great device. Really like the choice and convenience of this product.", "verified": true, "helpfulness": "0/0", "author": "douglas miller"}, {"rating": 5.0, "review": "I love it. It work perfect and respond quickly!", "verified": true, "helpfulness": "0/0", "author": "miguel torres"}, {"rating": 5.0, "review": "Very cool! The remote is really small and slippery though.", "verified": true, "helpfulness": "0/0", "author": "Noelleinaz"}, {"rating": 1.0, "review": "its not that i dislike the item, it's the fact that when the remote stopped working i tried to chat with customer service to find out if i could have the item replaced, was told i had to call. first call was taken by a person with a heavy accent, after giving all my info was put on hold then hung up on. figured it was an accident so i called back. same thing happened.", "verified": true, "helpfulness": "0/2", "author": "Doug"}, {"rating": 5.0, "review": "It just doesn't get any better then Amazon Fire TV! Pretty much has it all! Amazon you nailed it with this digital media!", "verified": true, "helpfulness": "0/0", "author": "bill spitzer"}, {"rating": 5.0, "review": "If you have Prime, this is the way to go. Voice search is really nice. May be the way to go even if you don't have Prime.", "verified": true, "helpfulness": "0/0", "author": "Harold D Thrasher"}, {"rating": 3.0, "review": "Great for what it is, but not enough customization for my tastes. With Kodi installed there is a bit more freedom, but the lack of Google play store is a no-go.One other major annoyance, you can only have one amazon account linked at a time. My girlfriend and I use different apps and have different games, it's a real hassle to switch accounts.Giving the nexus player a try next.", "verified": false, "helpfulness": "0/0", "author": "G Walker"}, {"rating": 5.0, "review": "Excellent.  No more cable.  Wonderful product.  I love the flexibility and diverse programs offered with minimum to no commercials.", "verified": true, "helpfulness": "0/0", "author": "Sweet Mud"}, {"rating": 5.0, "review": "Meets or Exceeds all my expectations.  Plays HD video with no problems and it's games and video selections are a hit with my grandkids.", "verified": true, "helpfulness": "0/0", "author": "Edmund Pieret"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Jay"}]