[{"rating": 4.0, "review": "I like it.", "verified": true, "helpfulness": "1/1", "author": "John Teixido"}, {"rating": 4.0, "review": "Bought it as a gift for Dad.  He likes it.", "verified": true, "helpfulness": "0/0", "author": "Fernando"}, {"rating": 1.0, "review": "I bought one 2 months ago and am incredibly dissatisfied with this product. I typically use this to watch media (netflix, hulu, hbogo, etc) and the chromechast 1) takes forever to load a video 2) completely sucks at controlling the video once it is playing and 3) makes you recast every single time. I much prefer my amazon fire stick and have bought a second one for my other tv. If you are buying this to watch streaming shoes AVOID IT.", "verified": true, "helpfulness": "0/1", "author": "Aaron Hernandez"}, {"rating": 5.0, "review": "Is wonderful", "verified": true, "helpfulness": "0/1", "author": "Guillermo Pujol"}, {"rating": 5.0, "review": "Good :)", "verified": true, "helpfulness": "0/0", "author": "seoyoung na"}, {"rating": 3.0, "review": "Can't beat the price for a network streaming device.  But I'm starting to wish I'd purchased a Roku or Fire TV stick instead since they both include easy to use remotes.  Using my iPhone or iPad to control video sources works fine but it's a little awkward and not all Chromecase compatible apps behave the same.", "verified": true, "helpfulness": "1/1", "author": "S Rock"}, {"rating": 3.0, "review": "You have to re-cast 3 to 4 times usually, never casts first time.", "verified": true, "helpfulness": "0/0", "author": "dodie"}, {"rating": 5.0, "review": "Super easy to setup and works great.  I tried a couple different devices which are supposed to do what this does and NONE work even close to as well.", "verified": true, "helpfulness": "0/0", "author": "James O Burke IV"}, {"rating": 1.0, "review": "Not sure why I even bothered to buy this but it's been a complete disappointment. First Google didn't include the MAC address of the WiFi card so I had to use an iOS app to get that info before I could update my wireless router and then when I thought everything was OK, it was unable to connect to my laptop running Win 8.1. Moreover it corrupted my wifi settings on my laptop which I had to fix as well. Way to go Google! Should have bought another Apple TV instead of this junk.", "verified": true, "helpfulness": "0/1", "author": "Artun \"maverick79sf\""}, {"rating": 5.0, "review": "This is a great product and very easy to set up for use. Picture quality is excellent. I use very few of the available apps but find the U-tube channel gives me hours of good history documentaries, along with several national and international news programs. I find normal television programming devoid of any meaningful value these days. I particularly like to watch Bill Moyers, nature programs, and the PBS shows. This product brings back the excitement of great programming. It's especially nice to make a selection, turn off the computer to save battery life, and watch a two hour program without commercials and interruptions. The product is well worth the money I paid for it.", "verified": true, "helpfulness": "0/0", "author": "John Smithson"}]