[{"rating": 5.0, "review": "This thing, I knew I wanted a TV, this chromecast stick drive and some other things like router, modem, high speed internet, computer, streaming accounts, etc. Anyway, I digress, this thing is off the hook! Stream anything and everything onto my HDTV, including YouTube videos of bunnies!", "verified": true, "helpfulness": "0/0", "author": "Marisol Esquivel"}, {"rating": 2.0, "review": "it was not a stand alone item ,  had to incorporate a  smartphone or laptop to opperate this unit .  I just did not like that idea ,  went on to buy the Amazon Fire TV ,  a much better unit for what i wanted .", "verified": true, "helpfulness": "0/0", "author": "Jerold Larkin"}, {"rating": 5.0, "review": "Sincerely an excellent product. It has helped a lot to follow OCW course from MIT. You fell like being in class, if you are watching this courses from YOUTUBE. Being a near sighted person it really has made the experience of projecting from my computer to a large screen an extremely enjoyable experience.", "verified": true, "helpfulness": "0/0", "author": "zeraus"}, {"rating": 2.0, "review": "It's a great little guy, but only good for Netflix. It isn't compatible with Instant Video, which makes absolutely no sense to me. In fact, maybe it's Amazon Instant Video that's really the problem....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It only works with a handful of apps. Will not work with Amazon Prime video app, Xfinity TV app, nor a thousand other streaming apps. Only six apps that I could find that it works with. Also, the resolution is horrible and grainy. Google could have done so much better!", "verified": true, "helpfulness": "0/0", "author": "FarmBoy"}, {"rating": 4.0, "review": "Its working good.The only problem is that the movies and live events on playing good.However, its working fine!!!", "verified": true, "helpfulness": "0/1", "author": "Anastasios Kiskoridis"}, {"rating": 5.0, "review": "Until now, I was using my laptop and an HDMI cable to watch Netflix on my living room tv.The problem with that was that to pause the show I'd have to get up and go over to the laptop (HDMI cable only 6 feet).I love being able to control my pause and play from my cell phone (and it's not streaming from my phone so isn't using much battery at all).I also like being able to still use my phone any way I like and it doesn't affect the casting.Haven't yet been able to figure out how to use it with other programs.I would love for JetFlicks to add a Chromecast ability.", "verified": true, "helpfulness": "0/0", "author": "Laura Bracken"}, {"rating": 5.0, "review": "This thing is pretty slick... it's not the best streaming device out there, but it's certainly the best for the money. I love how small it is, because the last thing I need is more doodads sticking out of the TV or things that need to be plugged in. My LG LED was able to power this device without the optional power cord (which is included, by the way). Some TVs, like mine, are able to power it simply by plugging it into the USB port.Set up was very easy, and I love how quickly it got me going and watching Netflix. I use this in my exercise room, so speedy loading is a necessity, because I don't want to be doing cardio and staring at a blank screen (cardio is boring enough as it is!). The only drawback is that I have to use my phone as the remote (I would rather have a separate remote), but even this is handled pretty cool, because the Chromecast uses the EXISTING Netflix app on my phone, so I didn't have to install or manage any additional apps.And let's not forget the price... I returned the Roku stick, which cost me $50 (and was ridiculously slow) and got this device for $29 on Amazon. That's about what it costs for two tickets to the movies nowadays!", "verified": true, "helpfulness": "0/0", "author": "Gabe"}, {"rating": 5.0, "review": "This is actually my first streaming device I've ever owned other than gaming consoles or my PC and I must say it is fantastic. The instructions are very well written and if you follow them you will not fail. After getting this setup it is a breeze to use. I primarily use it with my Nexus 5 Android phone and it basically turns my phone into a remote for a plethora of apps that can broadcast to the Chromecast.Some might be mistaken and believe that you are streaming from your phone to the Chromecast but that is not the case. Like I said before your phone (or your PC) is basically just a remote that tells the Chromecast to access Netflix, Youtube, Chrome and then the Chromecast does it on it's own.The price being $35 doesn't hurt either. A great product with a fantastic price to boot. Must buy for anyone wanting to stream content!", "verified": true, "helpfulness": "0/0", "author": "Evan Albright \"Evan Albright\""}, {"rating": 1.0, "review": "I've had the Roku for a couple of years now and absolutely love it. I decided to try Chromecast for the tv in our bedroom, however, and was quite excited about getting it in the mail. I could not have been more disappointed. It works terribly - we tried to beam some CBS shows from my phone, tablet, and laptop onto the television, since CBS shows are only streamed on their website, and it was just painful. The amount of buffering made it frustrating, and on top of that, there was a serious lag between the sound and the picture. I do not recommend the Chromecast, and would highly recommend you pay $20-30 more to get a Roku instead (which has so many more channels & features anyway).", "verified": true, "helpfulness": "0/0", "author": "Michelle Fadeley \"sillyrabbittrix\""}]