[{"rating": 5.0, "review": "I was able to do away with my media PC as I can now use Chrome cast to stream movies on my NAS to TV. Small enough to move from room to room, but also affordable enough to buy one for each TV!", "verified": true, "helpfulness": "0/0", "author": "Brian Kim"}, {"rating": 4.0, "review": "I had hoped that the device would allow me to cast anything from my PC but that was not the case, It does cast youtube (from my phone and PC) and nearly anything I do from Chrome as well as casting various other applications. Very neat device if they keep developing for it.", "verified": true, "helpfulness": "0/0", "author": "Scrib132"}, {"rating": 1.0, "review": "I decided I would not pay Comcast's $33/mo increase, so I had the TV service disconnected and kept the phone and internet and began to ask and look around for a suitable substitute.  Chromecast is what I ended up with.Got as far as \"ready to cast\" on the TV but could go no further and could not find any help sites (or any that I could understand) to help me move on.  I finally called the 800#; from the tech instructions there is no way I could have figured out the rest of the installation.  Never did I have info about the necessity of using Google Play.  Never did I have info about the costs which are lower than cable, but the point here is that there are costs using Google Play.  I am not speaking of $1.99 videos but of the fact that nowhere did I see anything about having to buy/rent videos.  My intent was to go to some sort of list to choose from and then watch without having to figure out if I wanted to pay for videos.  That was never made clear.  The ad for this device is extremely misleading.The tech helped me get it the rest of the way but he spoke as only as a tech can and left me to wonder just what it is he said.  The sites are just as bad.  There are many, all of which have proliferated to an intimidating number, with the same sort of \"tech speak.\"  The installation was a nightmare, and I have not watched TV since and have no plans to do so.  I have ordered a TV antenna and will make do with that.This has been one of the worst experiences I have ever had.", "verified": true, "helpfulness": "1/6", "author": "NoeNam"}, {"rating": 5.0, "review": "This product is revolutionary.  The command path - aka the remote control - being your PC (via the Chrome Browser and an extension) or any app on Apple ios or Android with Chromecast support.  The Chromecast discretely listens to your commands and streams the content independently of your ios/android device.  Streaming HBOGo/Netflix/Youtube/Hulu/Vudu/etc. via your chromecast is significantly superior to any experience I've had with other similar devices (Roku/GoogleTV/AppleTV/etc.).  I would caution that the feature of streaming your Chrome tabs and/or desktop from a PC has limitations based on the quality of your PC (as a host) and the local network you are streaming with.  Whereas, when you're commanding the cast from your phone and/or tablet you are not relying on the same weaknesses.", "verified": true, "helpfulness": "0/0", "author": "Coderorg"}, {"rating": 3.0, "review": "it was working good before but now its not working so good on my tv i don't know what to say  thx!", "verified": true, "helpfulness": "0/0", "author": "Khushi nagpal"}, {"rating": 1.0, "review": "Only works with Netflix and other things already connected to my TV through Tivo... does NOT work well with videos on normal websites", "verified": true, "helpfulness": "0/1", "author": "Marty L"}, {"rating": 5.0, "review": "I got this in several days after my order. It is so fast to get and am excited to use it.", "verified": true, "helpfulness": "0/1", "author": "Wonsang Kim"}, {"rating": 5.0, "review": "I've been streaming music basically nonstop since I got this. Absolutely love it. I don't even own a tv, just have plugged into a big monitor.", "verified": true, "helpfulness": "0/0", "author": "Cristina"}, {"rating": 5.0, "review": "I use it a lot with my iPad.  Allows me to watch one video while reading emails or playing a game at the same time.  Works very well, but WARNING on iPad it will only work with your youtube app and not with the chrome viewer.  This limits what you can cast to just youtube.  I believe it also works with a limited number of other iPad apps, but the fact you can't cast out of chrome GREATLY limits how you can use it on iPAD", "verified": true, "helpfulness": "0/0", "author": "D. Kaplan"}, {"rating": 5.0, "review": "I must've been living like a caveman without this bad boy cause once I hooked it up I was going 99 mph into the future. Netflix, Youtube, Facebook, Hell, it's got it all. You want to watch some PornHub on that nifty 55\" flat screen? I got you right here bro. Forget whatever sad set up you got going on right now and pick up one of these chromecasts. You won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}]