[{"rating": 4.0, "review": "A small wireless streaming device that turns any TV with HDMI ports into a SmartTV.I purchased this last year for my mom to allow her to easily stream Netflix to her living room television. The television does not have built in wifi. The television is also a Sony from a few eyars ago, so it required a very specific Sony wifi adapter, which was not in production anymore. This elft me with 3 options:1) Go out and overpay for a device no longer in production2) Drill some more holes in her walls and run some cable3) Find an input device that has its own wifi connectionBecause I value my time, money, and sanity, I went with option 3. The Chromecast had recently come out and was receiving good reviews. Being somewhat a Google fanboy, I gave it a shot. The $35 price tag was also an incentive, The most comparable device, the Roku streaming stick, was $50.I showed my mom how to stream from her laptop and iPhone and even played a movie off my Android phone. The only issue I have is that it is still somewhat tedious to stream to it, since it does not have its own controls. You are reliant on whatever app or service you are trying to use to be compatible. This was an issue early on, but has vastly improved. However, Amazon Streaming Video is still not available (gee, I wonder why). Also, mirroring is not very well supported, requing Windows 8.1 or an Android device. Even if you meet one of those requirements, it is not as seemless as some other options. Chromecast also lacks a convenient way to control it, meaning you eithe rneed to keep unlocking your smartdevice or computer to use a \"remote\". It still surpasses most \"Smart\" TV interfaces I've seen, though.If you are looking for a way to extend your computer or smart device to a larger screen, there are better options. However, Google is working on ways to better utilize Chromecast and there are plenty of new apps and extensions coming out for it.If you are looking for an affordable and relatively easy way to stream most of the major services and some of your own media files, the Chromecast is a great choice.", "verified": true, "helpfulness": "0/0", "author": "Urban Techie"}, {"rating": 5.0, "review": "Very nice product.", "verified": true, "helpfulness": "0/0", "author": "Buyer"}, {"rating": 5.0, "review": "Really makes streaming content to my non-Smart TV easy. Much better than running cables from my laptop across the room to the TV. Very easy to install and setup. Many people complain about the fact that you have to plug it into an outlet if your TV doesn't have powered HDMI inputs. I didn't find that to be a problem since I already had a power strip near the TV for all my other electronic devices.", "verified": true, "helpfulness": "0/0", "author": "Matt K"}, {"rating": 3.0, "review": "I had difficulties using it", "verified": true, "helpfulness": "0/0", "author": "David Munyua"}, {"rating": 5.0, "review": "I have one on every tv in my house.", "verified": true, "helpfulness": "0/0", "author": "luly"}, {"rating": 5.0, "review": "So easy to use once you get it setup, love this!", "verified": true, "helpfulness": "0/0", "author": "LJ"}, {"rating": 5.0, "review": "Very nice gadget :)", "verified": true, "helpfulness": "0/0", "author": "NanoBot"}, {"rating": 5.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Manuel Ortiz"}, {"rating": 5.0, "review": "Great way to eliminate the cable TV subscription. Casts Netflix, YouTube, and Hulu plus, among others.", "verified": true, "helpfulness": "0/0", "author": "Jared W."}, {"rating": 5.0, "review": "Simple, Neat, Easy way to stream media to a TV.", "verified": false, "helpfulness": "0/0", "author": "stephany Eloy"}]