[{"rating": 5.0, "review": "Love this product. Works great from all my devices. Just waiting for more apps to work with it. Simply amazing.", "verified": true, "helpfulness": "0/0", "author": "Alain \"Alain Perez\""}, {"rating": 5.0, "review": "It works for me really well. My friends refereed me this product to cast videos from laptop to tv.Thanks", "verified": true, "helpfulness": "0/0", "author": "srinivas gampa"}, {"rating": 5.0, "review": "I have only used this for Netflix and Youtube but it's great.  Even with a 1Mbps connection, the Chromecast is connected to my Kindlefire HD and it streams perfectly.  It's very easy to set up my 11 year old daughter and my 8 year old son set theirs up no problem.  In a world of expensive devices that let you down this is an inexpensive device that goes beyond what I expected.  With more features in the works it can only get better.", "verified": true, "helpfulness": "0/0", "author": "I.M. \"Hiroak\""}, {"rating": 1.0, "review": "Followed all the directions several times. It failed each time.Be carefull before you buy. Its $35 dollars down the drain.", "verified": true, "helpfulness": "1/5", "author": "rboring"}, {"rating": 5.0, "review": "While I'm eagerly waiting for 3rd parties to expand Chromecast's functionality, the Netflix integration alone has made it worth it.  The device couldn't be simpler to use.  Well worth the money for Netflix alone, and with the recent addition of Hulu and more to follow it will only get better.", "verified": true, "helpfulness": "0/0", "author": "Dan W"}, {"rating": 5.0, "review": "Streaming any page of the browser to big screen, for $35 only, what? I was waiting it for several years!It's easy to configure, just plug and use (chromecast software should be installed before).", "verified": true, "helpfulness": "0/1", "author": "Eugene Horohorin"}, {"rating": 5.0, "review": "I watch a lot of videos online and I was getting annoyed with all of the wires.  Thanks to Google Chromecast HDMI Streaming Media Player, I do not have to worry about any more wires!", "verified": true, "helpfulness": "0/1", "author": "Anthony Hoang Vo"}, {"rating": 5.0, "review": "Didn't get one when they first cam out, then had to wait on the price gouging to end and now I have one and it was worth the wait.Between my Computer, Iphone or my wifes Android, we never have a problem casting whatever we want to watch to the tv, but now i need to buy another one and a TV so we don't have to fight over who gets to use it haha. Good problem to have.Build quality is top notch and it does exactly what its suppose to.", "verified": true, "helpfulness": "0/0", "author": "J. Bentley \"Jarrod\""}, {"rating": 4.0, "review": "east to installbut no as function as apple tv yetmany apps can not use on chromecastbest wish", "verified": true, "helpfulness": "1/1", "author": "Oskar"}, {"rating": 4.0, "review": "I can watch Netflix with it on my TV without stuttering that is evident from my LG Bluray player with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Vette Driver"}]