[{"rating": 3.0, "review": "It works ok. I sometimes have issues controlling it with my tablet - loses connection when my tablet sleeps. It needs more apps. I was hoping it would work similar to google tv - I have a Logitech revue. The revue works better, even though it is no longer supported by Logitech.", "verified": true, "helpfulness": "0/0", "author": "JamesW"}, {"rating": 3.0, "review": "Cool in concept and price however unreliable in execution.  With Netflix, it frequently crashes on playback, though usually after a couple false starts, it eventually with play through your selection without further problems.  However, select another movie, the cycle often repeats itself.  Yo bad, since it otherwise is a neat device.", "verified": true, "helpfulness": "0/0", "author": "The Wise Fool"}, {"rating": 2.0, "review": "It can only be used with Youtube and Neflix. Not very useful. Of course it does not cost that much either", "verified": true, "helpfulness": "0/0", "author": "Howard Tang"}, {"rating": 5.0, "review": "Absolutely love this thing so much I got a 2nd later. Worth the buy and hopefully Google pushes more apps soon!", "verified": true, "helpfulness": "0/0", "author": "Gregory Rice"}, {"rating": 5.0, "review": "Outstanding and is everything it claims to be.  I just wish it was supported by more apps (e.g. mobile chrome, skype, hangouts, etc!).", "verified": false, "helpfulness": "0/0", "author": "Watson"}, {"rating": 4.0, "review": "It's good but it only works with Netflix, YouTube, Google Play and one more I can't remember right now... I thought I would be able to see any content from my computer on TV, but it doesn't work that way...", "verified": true, "helpfulness": "0/0", "author": "Chris K."}, {"rating": 5.0, "review": "This is fantastic. I had some idea what I was getting, but I'll admit I wasn't entirely sure (which is something that should be fixed by both Google and Amazon). If you leave it plugged in, it will overheat. That said, it's amazing. Being able to stream that well from almost anything is great. Here's to hoping more programs, apps and services add Chromecast compatibility going forward.", "verified": true, "helpfulness": "0/0", "author": "Dylan Jenkins"}, {"rating": 1.0, "review": "When it worked, it was great. Then it would not update and is stuck in an update. Google provides ZERO support on how to correct the problem or ways to ask for help. Now I own a $35 piece of plastic.", "verified": true, "helpfulness": "1/2", "author": "Brett E. Gilleo"}, {"rating": 4.0, "review": "Works as advertised.  Pretty easy setup.  Not at all obtrusive (can't even see it once installed).  Using the iPhone as a remote control is quirky.  Works much better with a PC.  Excellent picture, good sound.  Every now and then the sound gets out of sync with the picture while streaming.  This could have something to do with bandwith.  But definitely worth the $35.", "verified": true, "helpfulness": "0/0", "author": "J. D. Crowe"}, {"rating": 1.0, "review": "It doesn't work. I it hooked up to the HDMI and USP sockets a Smart TV. I get the message ready for CAST. I click the cast icon on my laptop. The icon displaying my WI FI connection is shown however the cast never completes!", "verified": true, "helpfulness": "0/0", "author": "W. F. MacLeod"}]