[{"rating": 5.0, "review": "fast easy and easy to navigate info!", "verified": true, "helpfulness": "0/0", "author": "sn2000"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "marco"}, {"rating": 4.0, "review": "I am enjoying my Amazon Fire TV.  Only wished you had apps. for the major TV networks that would work with the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Ronald Humes Jr."}, {"rating": 5.0, "review": "So easy to use and set up!  We use it at our retail store to stream radio on iHeart Radio and the screen saver plays images that we upload to create an immersive store experience with our customers!  So awesome!", "verified": true, "helpfulness": "0/0", "author": "D. Eastham"}, {"rating": 3.0, "review": "For the most part I have really like the Fire TV. The issue I am having is that when watching netflix the picture will freeze and jitter  every 10 seconds or so. This seems to go away if I use it under the WiFi connection rather than the Ethernet connection. Now I know to most that wouldn't be an issue but I am starting to install these for my customers who are using control systems and we control this device with IP commands so the Ethernet connection is a more reliable.I have tested this on multiple different Fire TV and we have the same issue with different network topology. We don't have this issue with AppleTV or WD Live TV or any smart blu-rays.", "verified": true, "helpfulness": "0/0", "author": "Christie"}, {"rating": 3.0, "review": "works pretty decent, Hulu has bugs, always close for some reason or get system error", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Best little gadget for expanding your home networks streaming capabilities.", "verified": true, "helpfulness": "0/0", "author": "Dennis E Butler"}, {"rating": 5.0, "review": "Great product and easy to tie into my aTV and Internet", "verified": true, "helpfulness": "0/0", "author": "James Eddy PhD"}, {"rating": 5.0, "review": "Exceeded expectations. Very easy to use and much faster than my Smart TV with built in wi fi connectivity.", "verified": true, "helpfulness": "0/0", "author": "H. Wolfer"}, {"rating": 4.0, "review": "Works great! I got this to replace an Apple TV because Apple didn't support Amazon movies and nothing else I have supported Amazon either. There are two things I don't like about Fire TV:1. The power cord has a wall wart adapter on it. Not huge, but enough to be troublesome. Unlike the Apple TV which has a plain cord and fits anywhere.2. The voice search feature isn't very good. It can understand you well enough and it WILL find what you ask for, but it will search only the Amazon titles and will NOT search titles on say, Netflix. That is to say, you can have Netflix launched and then use the voice search and it will get you out of Netflix and only show Amazon choices. To top it off, it will search ALL Amazon titles, whether they are included with Prime or not. Not a huge problem for me personally, but when family is over, they don't pay attention to whether the movie has to be paid for or not. There should be some preference settings in the menu to have the voice search just what I want, not what Amazon wants.Lastly, one pet peeve, there is no way to turn it off. You just have to redirect the input on your TV and then Fire TV will, after a while, sense that it isn't being watched anymore and turn itself off. Turning itself off is great, but they should allow the user to turn it off if they want to do so.", "verified": true, "helpfulness": "0/1", "author": "Timthetoolman"}]