[{"rating": 5.0, "review": "This has been wonderful.  Granted, you have to play around with it to understand it, but once you do, it's great.  If you watch online content, this is for you.  Primarily used with Netflix and YouTube, you can see regular websites as well with its casting feature.  However, the speed of the video might take a hit.  If casting from a desktop, you should get better results.", "verified": true, "helpfulness": "2/3", "author": "Alexis Salas"}, {"rating": 3.0, "review": "Pros: can stream very easily and setup was a breezeCon's: only available to stream like 4 applications. Can't even stream movie files.", "verified": true, "helpfulness": "2/3", "author": "Tengtou Xiong"}, {"rating": 5.0, "review": "Great!  Easy setup, easy to use.  I bought three and even put one into my smart TV so I could control it from my iPhone or iPad.", "verified": true, "helpfulness": "0/0", "author": "LL"}, {"rating": 5.0, "review": "This is one of the best devices that was ever invented to cast videos from chrome to TV. I use it every day!", "verified": true, "helpfulness": "0/0", "author": "Vi"}, {"rating": 3.0, "review": "The idea is awesome.  The price is great.  That said, it wasn't as easy to set-up as the follow along directions make it seem (things just weren't doing what they were supposed to do until the 10th or so attempt at doing the same thing).  Also, when watching Netflix, the video keeps having to buffer throughout the movie.  This could be blamed on network connection but I do have a great high speed Apple router and very rarely experience problems.  In my opinion, Apple TV works better at this point.  Maybe the next generation of ChromeCast will be better", "verified": true, "helpfulness": "0/1", "author": "joseph mancuso"}, {"rating": 4.0, "review": "The packaging and was excellent and the device works as advertised... No complaints (there's always room for improvement, so I never give 5 stars)", "verified": true, "helpfulness": "0/1", "author": "Chad"}, {"rating": 3.0, "review": "I bought this without a purpose. I live in Israel and we do not have Netflix. Just for You Tube it is not worth it. Add more money and get Apple TV or Roku if you hate Apple...:)", "verified": true, "helpfulness": "0/2", "author": "Yuval Golan \"ygolan\""}, {"rating": 5.0, "review": "Transforms a normal TV in a Smart TVWorks excellent with YouTube, Netflix and Chrome.Works excellent without mayor configuration with Smartphone, tablet and Notebook.", "verified": true, "helpfulness": "0/1", "author": "Pedro Molaguero Fernande"}, {"rating": 1.0, "review": "I was expecting this device to make watching programs from my laptop better. What I learned was this seemed to do no more than what you get when connecting via an HDMI cable, which is what I had been doing.Set up was confusing on my set. Device had a hard time finding my very (very high speed) network. No help or support available expect for long, tedious and very \"general\" help pages.In the end, I'm no longer even sure what benefits this device claims to offer overy what you can already get with network ready TV, an Xbox or an HDMI cable. If anyone can provide that piece of the puzzle for me I'd appreciate it.I did return the device as it seemed more complicated than just using the HDMI cable.", "verified": true, "helpfulness": "5/8", "author": "Diane K"}, {"rating": 5.0, "review": "after debating alot with myself abt either to get roku, other streaming devices or chromecast.. decided to get this.. its simply awesome. it worked seamlessly with my vixio and samsung tv's and I was worried that my bad internet connection would be issue.. but worked far better then I had expected.", "verified": true, "helpfulness": "1/1", "author": "Sameer Maharjan"}]