[{"rating": 5.0, "review": "Fantastic for college students without a DVD player. I love Google and Netflix, so this review might be a bit biased, but overall I don't have too many issues with Chromecast. One issue is the slow response time of just casting a tab from your browser. It's about a second off so you can't really watch video just from sites like projectfreetv because the audio will be out of sync. It connects fast, it is great with apps for playing music, etc. And I LOVE the backgrounds. They constantly update and you get a new beautiful background on your television whenever you're not casting. I give it 5 stars because it's the best way to stream my favorite shows on my actual hi-def television.", "verified": false, "helpfulness": "0/0", "author": "bunchamullark"}, {"rating": 4.0, "review": "This item pretty much makes your tv smart. It's plug and play, just use a few apps on your phone or PC and your off to the races. It's kind of hard to get a few things working, and you have to jump through a few hoops to make things work. Outside that works like a charm.", "verified": true, "helpfulness": "0/1", "author": "Randy Gordon"}, {"rating": 5.0, "review": "I bought it mainly to use with the PLEX app on my android devices.It works very well, didn't have a single problem.", "verified": true, "helpfulness": "0/0", "author": "SK"}, {"rating": 5.0, "review": "This is a very nice product and I like its portability. Contrary to some reviews I read, it works great with my first generation Nexus 7. I use it with my iPad Air too and while it doesn't access as much as my Apple TV box does, it travels great and most of what I watch is on Netflix and You Tube anyway. Great price great product.", "verified": true, "helpfulness": "0/0", "author": "Judy L."}, {"rating": 3.0, "review": "Connects and disconnects at 25 ft away from wireless router. That's a real impediment to committing to watching a movie.", "verified": true, "helpfulness": "0/0", "author": "Microapplications Inc. \"bbakermai\""}, {"rating": 5.0, "review": "Great idea and price.  Will be even better when you can stream more apps to the TV.  Works as designed", "verified": true, "helpfulness": "0/0", "author": "Michelle"}, {"rating": 3.0, "review": "I thought this was going to be a really awesome device. It only works sometimes streaming from my computer. I cannot get it to stream at all from my Nexus tablet. I really wanted this product to work but it seems it still has a few bugs for them to work out. I hope they work it out soon.", "verified": true, "helpfulness": "0/0", "author": "brendeebrew"}, {"rating": 3.0, "review": "I am giving it three star.Pros:The product is useful only if u want to see videos that u can remotely control from mobile or tablet.Cons:1) The product some times doesn't work. And to fix the issue, I have to reset my router (there is no issue with my router, as I have lots of things which are connected to router without any issue).2) It does not work as Internet Adapter. You can only use it to control APPS that have chromecast plugins.3)  Too much battery consumption of mobile/tablet when you using videos to be displayed on TV.Why u need to spend 35$ for device which is limited usage for only google products? You can buy internet adaptor for TV at same price and can be used for everything/anything...", "verified": true, "helpfulness": "0/0", "author": "Shahit"}, {"rating": 2.0, "review": "i have a great router w. good speeds but it needs to be right next to this thing or chromecast doesn't work..very choppy downloadschange to 2 stars", "verified": true, "helpfulness": "0/0", "author": "Joseph A. Vazquez"}, {"rating": 1.0, "review": "I bought Apple TV and Google Chromecast at the same time for 2 different TV sets.Google TV really disappoints me.Sometimes on my smartphone when I hit Cast button, it simply freezes. It absolutely doesn't respond. Sometimes, it shows \"This Phone\" and \"Apple TV\" with no choice of \"Google TV\". Other times, it does show Google. It seems to be completely random.When I do get lucky to get in and enjoy my show, It frequently shows loading symbol and freezes. This can go on every few minutes, to the point that I simply can't watch the show. Sometimes it will just completely time out and stop.I know this is a Chromecast issue because my Apple TV never had this problem and I also have a smart TV that I can always watch movies flawlessly.  If it is not the content provider, not my networking bandwidth, then it has to be the device.The lack of Google support is another problem. Google is a technology company. They do all kinds of cool things, but they never have the notion of \"customer service\". There is nobody to call and no where to write to about all of my issues. All I can do is just Google to find my own answers which also failed.So far the product seems to be totally unusable to me.Stay away from a product that the manufacturer does not stand behind to support it!", "verified": true, "helpfulness": "0/0", "author": "bchorng"}]