[{"rating": 1.0, "review": "Really good when it works, but cuts out for 5-20 seconds every 5-10 minutes.  Also doesn't work when I have a wireless extender turned on (as nothing can see it on the network).  With the extender turned off I get great pictures via Youtube or any Chrome tab, but it freezes intermittently.  Another downside is that it doesn't stream sound with Silverlight, only the image - if I play the sound from my PC when casting the tab with silverlight in, the sound is out of sync with the picture, unsurprisingly - I bought this hoping to use it with the BT Sport website, but that's not really an option due to the above issue.All of the above means I probably won't use this - hopefully there will be an update that resolves at least the freezing issue... Google?", "verified": true, "helpfulness": "14/17", "author": "MarkD"}, {"rating": 5.0, "review": "I needed a new streaming media player for my tv and I decided to try out the Google Chromecast media player.  It works out great with Netflix and Hulu Plus.  It does not stream all the videos from your computer yet but it may in the future.  The great thing about this item is that I do not have to plug it in to my outlets, the usbs withing my tv just keep it charged.  If I need another streaming device, i'll just purchase another one of these.", "verified": true, "helpfulness": "0/0", "author": "Lorrin Nahinu"}, {"rating": 5.0, "review": "Great little product from google! I was'nt expecting much because of the price but I thought why not. It may not be up to everyones standards but if you dont have any other means of streaming media and you happen to have a smartphone and are tired of watching it on a small screen then this will work. Works for android and apple devices although im not a big fan of casting the browser it still needs a bit of workonand your mac or pc. One thing that i dont like but does not effect me giving it 5 stars is that you do need an outlet for the chromecast unless you have an usb input on your tv", "verified": true, "helpfulness": "0/0", "author": "David Barron"}, {"rating": 5.0, "review": "I purchased this because lightning fried my Ruko box. I wanted to get aplple tv but now is not the best time as the lighting also took with it a tv, router, 2 DVR's and more. Chromecast was my savior. We have been streaming on RoKu for 5 yrs and I missed it so much. The set up was very easy. The ability to control from our iPads and phones is awesome! My 5 yr old is now able to play his YouTube and Netflix on the big tv all by himself straight from his iPad. This is great, I agree with others that it can not totally replace my RoKu's features but I believe they will add more options soon. In the mean time I am thrilled that for $35 I am now able to watch my netflix, and hulu again. I will be adding a streamer in the future with more features but I believe that this product has its own little niche in the market. We will continue to use it.  I can now watch my stuff at the out of town visits to moms. Thank you Google from your biggest fan.", "verified": false, "helpfulness": "0/0", "author": "Bobbyejo"}, {"rating": 1.0, "review": "Piece of junk. Another piece of privacy and freedom of choice disrespecting crap from the new evil on the block called Google. Forces you to install google chrome. Does not support internet explorer although it supports safari. Collects an unknown amount of information including usage, etc. That is if you are able to use it, say, to connect and play Netflix movies. I am not able to do that more than a couple of times for very short periods of time, and ended up dropping connections, unable to play movies. Nothing but youtube works reliably. Not only waste of your $35 but the time that you spend trying to set it up, etc. There are better options to do much more than this garbage with similar costs.", "verified": true, "helpfulness": "2/8", "author": "Baris Yazici"}, {"rating": 5.0, "review": "Super fantastic, the best things since sliced bread. That means a lot coming from someone that REALLY LIKES toast. I do wish more apps would come out (HBO GO and so on). Otherwise a perfect complement to the traditional chord cutters life.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It works really well, but I wish Google would hurry up and allow more apps access to the Chromecast ecosystem.", "verified": true, "helpfulness": "0/0", "author": "Skeeterfood"}, {"rating": 4.0, "review": "This unit is a solid performer, worked as advertised. Looking forward to further software updates and increased functionality. Set up was fairly easy but not simple.", "verified": true, "helpfulness": "0/0", "author": "Fallen0ne"}, {"rating": 4.0, "review": "This Product is great i gave it to my partner for his birthday. We do not use it with a phone we use it to stream from our laptop with the google cast app for computers.", "verified": true, "helpfulness": "1/1", "author": "eduardo d muro"}, {"rating": 1.0, "review": "A lot of content is not supported on this technologyHulu videos  and youtube videos are choppy. They run smooth on my laptop but it hangs up on the TV all the time.  Audio is fine but video sucks. Terrible to watch. So disappointed- what a waste of 35 bucks It's useless.", "verified": true, "helpfulness": "0/1", "author": "Data Virtualization Guru"}]