[{"rating": 4.0, "review": "I love my Chromecast. Bought it months ago when it was only able to work with Netflix, You Tube, and Chrome Browser.Pros :Small and fits perfectlyCan't beat priceEasy to installWorks with what is programmed for it.Easy to installOnce on Wifi updates itself direct from Googleand more...Cons: mostly info you need to know before purchase-Needs Wifi access.-Need to be aware it needs power via micro USB cord. There aec2 in the package. 1 short so if you have a HDMI port close to USB port in back of TV you are good to go. If not the longer one  with a plug. If powered by USB on TV one TV is off so is Chromecast. If plugged into outlet be aware to unplug it (it may overheat over time of left power on over time)-Google has not opened this up to developers to make their own apps to work worth it.", "verified": true, "helpfulness": "0/0", "author": "Rx Gadget \"RxGadget\""}, {"rating": 5.0, "review": "I bought this for my father (age: 65) who regularly uses his iPad and iPhone to surf the web, pay bills, etc. He was interested in scaling back some of his cable channels and supplementing with some sort of streaming service. From sealed box to watching YouTube and Netflix, I think it took about 20 minutes. It's a great product; easy to install and intuitive to use. I think he would have been a bit intimidated to install it on his own and he still sometimes has trouble finding the \"send to Chromecast\" button on his apps, but it's a much better form factor than a Roku box (which I own) because there are no new remotes to learn the buttons on and no new menus to learn how to use.", "verified": true, "helpfulness": "0/0", "author": "J. Losh"}, {"rating": 4.0, "review": "What a clever and simple device. Simple to setup and use. in fact since getting this for Christmas my kids have been watching more netflix and youtube on the tv then before (so probably the bad part of it :-). Getting control back now that winter break is over. The one drawback is if you have multiple devices connected to the chromecast, such as three of your children were casting youtume and netflix content from their smartphones and forget the stop casting to the chromecast you don't have a way to over-ride it and reset all. They need to be stopped (or you need to unplug and then replug in the chromecast power).", "verified": true, "helpfulness": "0/0", "author": "bblew"}, {"rating": 5.0, "review": "The ease in media connectivity this device provides is outstanding! Great design and portability. Great quality playback and great compatibility!", "verified": true, "helpfulness": "0/0", "author": "David Cornejo"}, {"rating": 2.0, "review": "Spent a good portion of the weekend trying to run Chromecast from my wife's kindle fire to our HD TV. Got the Chromecast screen to appear, but that's where it continually ended. The TV would not recognize the kindle fire.Followed all sorts of instructions and tips--youtube tutorials, amazon reviews/tips, etc., all to no avail. One thing I noticed - that I saw on an instructional video - was the Chromecast icon in the upper-right of the tablet's screen, while in the app being sent to the Chromecast/TV. That icon never appeared on the kindle's screen.I'm no IT tech whiz, but I am pretty good with these kinds of things. So clearly this chromecast has got a lot of bugs to work out. I'm sure this gizmo is brilliant to SOME out there. But I see no point in releasing these things to the public before they are 100% compatible with all android devices, and not just some.Added 1/18: We bought a Roku to replace the Chromecast. Hook-up and activation was as easy as one-two-three! I recommend the Roku to anyone having trouble with Chromecast!", "verified": false, "helpfulness": "1/1", "author": "J.Clarke"}, {"rating": 1.0, "review": "I see potential in the future for this device, but right now it needs some work. The device crashed a lot and I had to go through the setup every day I used it. I will be returning it and trying out the Roku product.", "verified": true, "helpfulness": "1/1", "author": "Greg C"}, {"rating": 5.0, "review": "It's great to be able to watch just about anything I want on my big screen TV -- easy to set up and easy to use -- can't think of anything bad to say about it yet, so I'm quite happy with my purchase :-)", "verified": true, "helpfulness": "0/0", "author": "Chance1122"}, {"rating": 2.0, "review": "Setup was ez. But page sync too slow and page freeze up and watching movie was impossible. But has great background pictures", "verified": true, "helpfulness": "0/0", "author": "TS"}, {"rating": 4.0, "review": "This could be a function of my browser (Chrome) and certain websites like Netflix (which uses Microsoft technology) not being fully compatible. If you are looking to use this to stream from a website not specifically optimized for this, you'll run into choppy, unreliable playback. There is a beta option to cast from, but frankly, it's too unreliable and I don't care enough to figure it out yet. I like having this over Roku and my Wii to cast from, since it's a much cheaper alternative overall.", "verified": true, "helpfulness": "0/0", "author": "Psy D"}, {"rating": 4.0, "review": "I'm really happy that I bought the Google Chromecast! It works as expected and it turned my non-smart tv into a internet tv. I can now stream wirelessly from my computer, tablet, and phone. I give it 4 stars, not 5 only because my tv is somewhat far from my wireless router and sometimes I have streaming issues and the picture quality is not that great. Also I wish the chromecast was compatible with more sites and apps that offer streaming. Super fast shipping!", "verified": true, "helpfulness": "0/0", "author": "Jewel M."}]