[{"rating": 1.0, "review": "This item is way over billed.  Yes, it is only $35.  You basically get access to 2 services, Netflix and YouTube (and any other thing you can display via the browser), which provide absolutely horrible picture quality.  I can already get both Netflix and YouTube straight through my Tivo box.  Also, t'he Chromecast iOS app I installed on my iPad to set this up and use it could be one of the least robust apps I have ever seen.  It truly does nothing but tell you what version you are running and what devices are available.  So disappointing.  If you want something like this, go with AppleTV. It is a WAY better deal at $99, even if you don't buy Apple content (it has everything Chromecast has, plus a lot more...HBO Go, Hulu and many others.  I am no Apple fan, believe me, but this product is just not comparable, even for $35.  Pay the extra $65 and get AppleTV (Which also comes with a remote, unlike CC)", "verified": true, "helpfulness": "4/11", "author": "Levi45 \"levi\""}, {"rating": 3.0, "review": "I like the idea and it was easy to set up and use on both my iPad and MacBook. I already have Netflix thru my TiVo. Don't watch much YouTube. The only thing we use it for is watching TV shows we have missed via a browser on my laptop.  Maybe someday they will expand the functionality.  That said, it does everything they say it does, just not a compelling gadget. with a low price, I can justify it for the 4 or 5 times a year I use it.  Still, an interesting concept that can have more content in the future. Hopefully.", "verified": true, "helpfulness": "0/2", "author": "Tom 5778 \"Tom M\""}, {"rating": 1.0, "review": "I have had Chromecast for about a week and for the most part it was working great. Suddenly today I can't cast any google products on GOOGLE's own Chromecast.  I can cast Youtube and Netflix, but I can't cast the TV shows I purchased from google using their own Chromecast device.  I will be returning the two I bought and saying good buy to purchasing google products in the future.", "verified": false, "helpfulness": "8/12", "author": "Michael Vorndran"}, {"rating": 1.0, "review": "Well, this doesn't work at all. I set it all up and every time I try to cast a video to my TV I get a message saying \"an unexpected error has a occurred.\" Since nothing on the help site was of any use to me, I figured I'd just give them a call. Well, there's nobody to call! I can't get this thing to work and google has no customer support that I can call for help. Waste of money, will try to return item.", "verified": true, "helpfulness": "111/145", "author": "Christina Swan"}, {"rating": 4.0, "review": "Easy setup and it just works, cant beat the price either 35 bucks is a good deal thinking about buying another one.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 4.0, "review": "pretty good device and really cheap compared to its competition however the only thing keeping it from 5 stars is its limited ability to stream only certain videos i wish they had pandora support and maybe a mirroring function for your phone! but still a really new product so there is still hope they will improve it", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "I love it. It was a great Price and it is great to watch u tube on my tv. Very easy to set up. You can watch Netflix too.", "verified": true, "helpfulness": "0/0", "author": "Carolann Hubbard"}, {"rating": 5.0, "review": "easy set up.  plug and play and enjoy.  can't beat it for the price.  get it before their all gone.", "verified": true, "helpfulness": "0/0", "author": "Antfelici"}, {"rating": 5.0, "review": "This product does what it says it does -- with the following qualifications.  On my Nexus 7, Netflix will not stream.  Not sure if this is a Nexus 7, android Netflix app, or Chromecast thing.  All works fine on my first generation iPad.  Have not tested on my phone.  Recommended.", "verified": true, "helpfulness": "0/0", "author": "Scott A. Frangos \"Book Lover & Seeker\""}, {"rating": 3.0, "review": "easy to setup and usegood concept - but disappointed that it only works with Nertflix, YouTube and a few otherwant it also to support other commonly used applications - eg HBO, MetOpera, etc", "verified": true, "helpfulness": "0/1", "author": "Poul C Andersen"}]