[{"rating": 2.0, "review": "Having bought 2 of the Roku 3 and I am a little spoiled. The Fire has very few or limited, outdated apps. (Mostly Amazon Apps) No HBO Go, No PBS, No TargetTicket,  Showtime Anytime is out of date, (Does not list DirecTV as provider) No VUDU??  It does have Flixster but it loads very slow. The USB port is useless! Why is even there?? What a let down! Sending mine back! Not worth $99", "verified": true, "helpfulness": "3/8", "author": "M. Howard \"tek54\""}, {"rating": 3.0, "review": "I got this as a gift for my wife she has a kindle fire hd and a reg. kindle and loves them. I have a kindle fire and I love it.  so I got this for her women cave so she could watch the wwe network which she has on her kindle I assumed that it was available for fire tv I am very disappointed rite now (may 1,2014) they tell me it is coming soon. I am going to wait and hope that the reason I got this will become available .the roko we have was half the price and has a lot more apps available rite now .hopping this was not a mistake I have made for mothers day. it does seam to be very easy set up and has nice picture and remote is kinda neat with the voice search. we like that much of it just going to wait and see if network show up in apps", "verified": true, "helpfulness": "2/4", "author": "David Hammond"}, {"rating": 5.0, "review": "I purchased this as a gift for my parents who are Prime members. This is an excellent addition to one of their TV's which was not a \"smart\" TV. The installation was very easy and took maybe 10 minutes, which includes the time for the Fire TV to download & install it's software updates as well as linking my parents Prime account. Once everything was set up and the automatic tutorial finished,  the main / home screen appears. It seems like a simple and basic screen which is easy to navigate. In our application, the Fire TV will be mainly used to watch Prime movies and listen to Pandora radio. As of now there have been absolutely no problems using either of these. The voice search is amazingly accurate when searching for Prime movies or TV shows. I have heard that the voice search doesn't work with other Apps such as Netflix. Since the other Apps won't likely be used by my parents that's really not a problem here, but I imagine for others interested in those Apps other than Prime this could be an inconvenience. I am toying with the idea of purchasing the Fire TV gaming controller to see how the games are on this.Overall, I think this was a great product by Amazon and it also makes for a nice gift. My parents were very happy. I have given it 5 stars because it works perfectly for what they will be using it for. I am pleased with my purchase and wouldn't hesitate recommending to others.", "verified": true, "helpfulness": "3/3", "author": "Eric"}, {"rating": 5.0, "review": "I have owned most of the set top boxes out there, and am pretty impressed with this so far. The Amazon Prime streaming is great, and the content get's better every month. I'm amazed at the speed at which the movie or show starts playing after hitting play - there's no buffering for me - less than a second from button press to opening credits. I run a Plex server at the house and the Plex app is great on the Fire TV (although I was disappointed it wasn't free since I have the paid Plex subscription). The interface if much nicer than the WDTV's I have, and I can quickly page through content.", "verified": true, "helpfulness": "0/0", "author": "Mr Nice Guy"}, {"rating": 5.0, "review": "A great, all inclusive, full featured entertainment device. Extremely happy with my purchase. In my opinion this introduces features that should have been available to apple tv users years ago. BTW, we are still waiting. Thank you amazon!", "verified": true, "helpfulness": "0/0", "author": "Casey Pickett"}, {"rating": 5.0, "review": "Nice apps for starting, I'm sure they will increase with time. Beats Roku, and Apple TV and other media players", "verified": true, "helpfulness": "0/1", "author": "Earthclan"}, {"rating": 3.0, "review": "Just received my Fire TV and set it up! Totally shocked, I own 3 Roku boxes and an Apple TV, don't use the Apple TV anymore since I have no access to Amazon stuff but lo and behold I'm very surprised there are more amazon services available on the Roku. The Roku has an Amazon Cloud app so I can listen to my music and videos I store on the Amazon cloud but I don't have access with the Amazon produced Fire TV. Lame! Second issue is the way Amazon doesn't make it easy to sort Amazon prime stuff, The Roku does. I'm debating whether to just ship this back and get a Roku 3, more Amazon features available and more Apps overall.", "verified": true, "helpfulness": "2/3", "author": "Oldthor \"bluemax\""}, {"rating": 5.0, "review": "I am very pleased with my purchase. If you are an Amazon Prime member, that alone will make it well worth the price. Easy to use, easy to set up. You will also need an HDMI, which is not included.My only reservation: if all your TVs are \"smart\", this might have enough overlap to make you think twice.", "verified": true, "helpfulness": "1/1", "author": "VMommyL"}, {"rating": 1.0, "review": "I am hearing so many great things about \"Fire\" however I feel that the paid subscription to Prime deserves to be respected just a bit. I understand Amazon is a for profit business and I truly am in support of that but they are built on a foundation of convenience and this concept of mixing the free and for pay products together without a \"convenient\" way of identifying goes against the basic reason of there success. Please Amazon I employ you to rethink this and make this product as friendly as it should be. It certainly is possible to do, and can be converted into this format I would think very easily. I promise we will find plenty of your movies and games  to buy or rent. Just keep being user friendly and your customers will reciprocate in a positive way.", "verified": false, "helpfulness": "3/25", "author": "RICKY S, GREEN"}, {"rating": 4.0, "review": "Fantastic device. What would make it perfect for me? Simple; add capability to steam MLB.TV (as many of their competitors have this capability) and lastly, the ability to stream all of your music that is in your Amazon MP3 or Cloud Player. Then it is the perfect device, the one to beat them all!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"photo freak\""}]