[{"rating": 5.0, "review": "Great hardware and an overall nice device.  Interface is very straightforward and the voice search exactly the way you would hope it would.  Performance is very nice and audio and picture are excellent.", "verified": true, "helpfulness": "0/0", "author": "Chris Mehnert"}, {"rating": 5.0, "review": "Purchased the Fire TV / Sling TV discount promotion.  Great product combination. Was planning to run it concurrently with my cable subscription, but It took less than an hour to see that Fire/Sling offers better content for one quarter the cost.  Goodbye cable!", "verified": true, "helpfulness": "0/0", "author": "San Antonio"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Jennifer feliz"}, {"rating": 5.0, "review": "Two words....Daredevil. Netflix.You're welcome.", "verified": true, "helpfulness": "0/0", "author": "Don In Fremont"}, {"rating": 5.0, "review": "I LOVE IT", "verified": true, "helpfulness": "0/0", "author": "michael"}, {"rating": 5.0, "review": "I absolutely love this thing, and I'm mad that I waited so long to buy it! I am a cord cutter who streams all of my tv. I had been streaming through my smart tv, and the fire tv is substantially faster. I use netflix and sling tv, and both work great. I highly recommend fire tv and would purchase again.", "verified": true, "helpfulness": "0/0", "author": "JennStokes"}, {"rating": 5.0, "review": "Best media device out there! I have two Fire TVs and two Fire TV Sticks in addition to Apple TV, ChromeCast and a Roku. I have not used any of the others since I purchased my first Fire TV device. The Fire TV is responsive and the voice control works perfectly.", "verified": true, "helpfulness": "0/0", "author": "James M Sorrels"}, {"rating": 3.0, "review": "Minimal buffering", "verified": true, "helpfulness": "0/1", "author": "Rick Ziegler \"zagman2\""}, {"rating": 3.0, "review": "Great, but full of bugs.  Have to restart it too often to give 4 stars.", "verified": true, "helpfulness": "1/1", "author": "Daniel Conner"}, {"rating": 5.0, "review": "I purchased this as an alternative to our current TV provider and my family absolutely loves the selections of programs and movies so far.  My kids love the kids series that they can now watch entire seasons, plus kid shows they they never knew about.  Fire TV with Prime was well worth the money and entertainment included.", "verified": true, "helpfulness": "0/0", "author": "Joseph A Mastriana"}]