[{"rating": 5.0, "review": "I have this Chromecast as well a Roku (2XS).  They both have advantages and I love my Roku, but I this will work great for most users.Long story short if you don't wish to go into pros/cons:  Check to see if the service you use (Netflix, Hulu etc) support Chromecast. If you have no issues with the Wi-Fi in your home and if you don't need a remote control, then this should suffice.Pros1. It's easy and works with your tablet or phone.  If you're watching Netflix or YouTube, just tap the 'cast' button and now it's on your TV.  Tap it again to disconnect.  And, you can still use your phone/tablet for other functions while it streams.2.3. It's small.  Just plug it into the TV and give it power.  Newer TV's can power it from the built in USB port in the TV (check your TV manual for functionality)4. It's $35.  I don't think it gets cheaper.5. Expanded support for a lot of apps now.  more apps are being supported all the time.6. No remote control, since you control everything from your phone/tabletCons1. No remote control.  I find older users aren't comfortable with this.2. All Wi-fi, no wired options.  This is fine for most with today's routers, but I seem to have occasional wi-fi signal issues that I think is due to interference.  So once in a while, my stream is low-res or choppy, but this is not the fault of Chromecast", "verified": true, "helpfulness": "0/0", "author": "Jason Lew"}, {"rating": 5.0, "review": "keeps getting better!", "verified": true, "helpfulness": "0/0", "author": "jennifer schoon"}, {"rating": 5.0, "review": "Small and efficient.  Software kinks have been worked out.  Can be powered directly from TVs USB port, though it's not powered in most cases when the TV is turned off.  Other reviewers cover why this device is great.", "verified": true, "helpfulness": "0/0", "author": "MacGyver"}, {"rating": 5.0, "review": "works well!", "verified": true, "helpfulness": "0/0", "author": "Yun Zhan"}, {"rating": 5.0, "review": "Unfortunately I returned item after not finding short USB power cord (as pictured) in the box.I then bought locally and learned USB & 110V power use same (long) cord - just unplug wall adapter to expose USB. I needed USB power and item description did not explain. Sorry I returned item to Amazon because they had the best price and free shipping. Anyway CHROMECAST works.... Great!", "verified": true, "helpfulness": "0/0", "author": "John Tome"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "Danilo"}, {"rating": 3.0, "review": "I use it with my phone and I find it frustrating that I need to reset the devise by removing it from the back of my TV nearly every time I use it.. I am sure working it with the computer is ultimate , but I bought it to use in bed with my phone..", "verified": true, "helpfulness": "1/1", "author": "Pamela"}, {"rating": 5.0, "review": "Easy to install and use. Great product!", "verified": true, "helpfulness": "0/0", "author": "Sun seeker"}, {"rating": 5.0, "review": "Works great thanks for asking", "verified": true, "helpfulness": "0/0", "author": "Robert Marsiglia"}, {"rating": 5.0, "review": "I have been amazed at the functionality of the device, Netflix, Youtube, other online videos, music, all pushes very well to the device.", "verified": true, "helpfulness": "0/0", "author": "T. Shepard"}]