[{"rating": 5.0, "review": "I own a Roku, Apple TV and a PS3 all connected for streaming but Amazon Fire TV bests all of them. Easy navigation and a more user friendly interface. The remote search feature comes in handy...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "this is a great tool to watch your netflix and hulu, but be cautioned that you have to pretty much pay for Amazon tv shows. The box does not mean you get shows, even with Prime, the selection is limited.", "verified": true, "helpfulness": "0/1", "author": "chari rubin"}, {"rating": 5.0, "review": "Having slow DSL (1.5mbs) was a hindrance to getting set up. Needed to hookup ethernet cable instead of wireless signal. After that it was pretty much straight forward. Voice activation for search is a plus and easy. To early to tell how buffering of movies will degrade the experience.", "verified": true, "helpfulness": "1/1", "author": "Fillerup"}, {"rating": 5.0, "review": "Great product, for great price.  Remote is awesome !!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I bought a Roku 3 so I could cut the cable or my satellite dish. At first the Roku worked like a charm. After a week it crapped out. I bought (2) units, one for each TV I have. The first Roku unit went out after a week, the remote quit working. The second Roku didn't at all. So, Roku replaced them both, no problem. The replacements didn't work either. I had already cut my cable service so getting a working system was important to me. After the 3rd Roku failed, I gave up and Amazon refunded my purchase without a hitch. Way to go Amazon!I bought a Amazon Fire TV to replace the Roku's units. I only bought one unit this time and after it arrived and I hooked it up, it didn't work either. By this time I'm starting to think that Streaming TV isn't ready for Prime Time, there are some bugs that need to be worked out before they put these on the market. The remotes with the Roku or the Amazon Fire didn't work. The Amazon replacement arrived and worked great right from the start.While I was checking out Amazon fire TV, I noticed a site called XBMC. They have instructions online that will show you how to connect your Amazon Fire TV to XBMC. It was a little beyond my ability to do that, but I found a site that will install XBMC on a Amazon Fire TV. They charge a little too much, but it was worth it. With XBMC I can watch movies that are still being played at the local theaters for free.  So far I've seen Interstellar, Nightcrawler, Fury, Maze Runner and just about every other movie that's now being played. Also, I'm a Law & Order fan, with XBMC I have access to every episode of Law & Order that been filmed. You'll be able to watch your favorite programs as well as all the live sports you want.  XBMC is amazing. With a Amazon Fire TV with XBMC installed, I've cut the cable and have something the Cable companies can't even begin to compete with. So, if you want to cut the cable, get a fire TV or any other device that will allow to Stream and install XBMC you'll be happy. I was paying $140 for cable, now all I pay is $29 for my internet service.Bottom line, yeah it works, it could be better. I'm happy I cut the cable even with the problems I'm having. The main issue to me is, getting a good connection. When you go to watch a movie you have a choice of servers to use, Hugefiles, Billionuploads, Moviereel to mention a few. When it works its great, and most of the time it does. But when a movie cuts off in the middle or close to the end, it gets frustrating when the same problems happens again and again and finally you give up on watching that movie. I've found a lot of times I can go to another site and see the movie without a problem.So, for the most, there is more good about XBMC then there is bad. One good example, as I stated, I'm a Law & Order fan, but it hard to get through an entire episode without crashing at least 3 or 4 times. On the other hand, I can watch movie after movie, even do a search for one I haven't seen in years (The Cross of Iron) 1980, no problem at all", "verified": true, "helpfulness": "0/1", "author": "Ervin W. Armstrong"}, {"rating": 5.0, "review": "Awesome choices. And fast searches.", "verified": true, "helpfulness": "1/1", "author": "Scott walker"}, {"rating": 5.0, "review": "small and easy to use.", "verified": true, "helpfulness": "0/0", "author": "JJ"}, {"rating": 5.0, "review": "I have owned Fire TV for about 4 months. I just love it. I have cut my Verizon Fios to the lowest basic aservice nd use Fire combined with my Amazon Prime to watch movies and TV series I have missed. It was truly a plug and installation (yea!) I have been an Amazon customer since its inception love love love!", "verified": true, "helpfulness": "0/0", "author": "Rabid Reader \"Lady Engr\""}, {"rating": 5.0, "review": "I usually don't post comment, but this lttle produce is amazing. Easy, fast installation. I saw and heard that before, so that concerned me. Nope, just a few minuets. Works Great, Fast, Voice commands work amazingly well. More than worth it!", "verified": true, "helpfulness": "0/0", "author": "Mike Waters"}, {"rating": 5.0, "review": "What can I say?  I bought it as an upgrade to the Chromecast and I love it!", "verified": true, "helpfulness": "0/0", "author": "Mark Conley"}]