[{"rating": 5.0, "review": "we are really enjoying the series just started using it a couple of weeks ago", "verified": true, "helpfulness": "0/0", "author": "smokeydogfishing"}, {"rating": 5.0, "review": "Addicted 2 it!", "verified": true, "helpfulness": "0/0", "author": "dave"}, {"rating": 4.0, "review": "I really have not used it much...but so for it performs as expected...after all it is amazonKeith", "verified": true, "helpfulness": "0/0", "author": "Keith Lawhon"}, {"rating": 5.0, "review": "Great having so many movies to choose from", "verified": true, "helpfulness": "0/0", "author": "glenda douglas"}, {"rating": 4.0, "review": "We like the search and speed of the device but wish there were more current movies as part of the Prime membership.  I'd be willing to pay monthly to avoid the $3.99 per movie rental fee.  Red-box DVDs are half that price.", "verified": false, "helpfulness": "2/2", "author": "peter b nowikow"}, {"rating": 5.0, "review": "What can I say? Perfect and easy set up.", "verified": true, "helpfulness": "0/0", "author": "Jazzy Grandma"}, {"rating": 2.0, "review": "Skips my wii does not have this problem.  Issue on Netflix and amazon prime. Wifi not the issue. Seems the apps have issues. Would not purchase again.", "verified": true, "helpfulness": "0/2", "author": "Martha"}, {"rating": 5.0, "review": "Way better than Roku or Google Chromecast. Love all the different apps. We love our Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Linsey DeVries"}, {"rating": 5.0, "review": "I have enjoyed this gift.  I use the prime membership to be able to see some old tv shows that I really enjoy watching.", "verified": true, "helpfulness": "0/0", "author": "JohnB"}, {"rating": 5.0, "review": "Best thing ever! My daughter-in-law and son got it for us for Christmas and hooked it up.  Before then I had only used Prime for free shipping.  We love the Amazon series Mozart in the Jungle and Alpha House.  Also love to see whole seasons of shows as well as movies for us and grandkids.", "verified": true, "helpfulness": "0/0", "author": "G.G."}]