[{"rating": 5.0, "review": "The next best thing to wireless internet. Streams flawlessly. Highly recommended for the non smart TV owner.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "I change lives with this thing.", "verified": true, "helpfulness": "0/0", "author": "INSURGENCYmusic"}, {"rating": 4.0, "review": "Great !", "verified": true, "helpfulness": "0/0", "author": "JoAnn Williams"}, {"rating": 5.0, "review": "The best Streaming Media Player for less money! its awesome, google products are the best!!", "verified": true, "helpfulness": "0/0", "author": "Ricardo Avila"}, {"rating": 5.0, "review": "Bought 1 as a gift, and ended up buying 2 for me!", "verified": true, "helpfulness": "0/0", "author": "Liesl Wynter"}, {"rating": 3.0, "review": "I'm using an Android Tablet. This works for apps such as Youtube, but not to cast browser tabs. I have the latest Chrome browser and installed the Chromecast App. To cast a tab you need the \"Cast Extension.\" In the Play store it's not listed as downloadable, it just has a button that says, \"Available on Chrome.\" Well, I'm already using the latest version of Chrome, and it's not there. After 3 hours of scouring the Net for solutions, I'm returning this. Once they get things straightened out I might try again.", "verified": false, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "trevor Fenlon"}, {"rating": 1.0, "review": "This is THE worst product I've ever bought in my entire life. I threw out the receipt thinking how could you possibly screw up such a simple device. Well google managed to. This thing is lucky to hold an internet connection for 35 seconds with the access point 10ft away. It was once able to play a YouTube video for about 45 seconds. I just threw $30 and half a day of my life in the trash. Do yourself a favor, buy an Apple TV or Roku or whatever.", "verified": false, "helpfulness": "0/0", "author": "That one guy."}, {"rating": 5.0, "review": "This is s fun toy, My spouse is thinks it is really cool and she hates computer stuff  :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just amazing.  I can stream from my PC to TV and my kids can watch a different movie on my PC at the same time!  Audio from the streaming movie goes only to the TV!You MUST HAVE a wirelessly connected device to set this up to a wired PC.  Not a big deal for me but could be for others.", "verified": true, "helpfulness": "0/0", "author": "half"}]