[{"rating": 4.0, "review": "Finally replaced my 2-year+ Roku with Amazon's Fire TV. What a difference in display, performance and usability! I love that since I am \"Prime\" member, I did not have to register. The reason I rated 4 versus 5 stars is beause of the problem loading Netfilx. I tried several times without sucess, could not find information in Help. So, I finally googled the issue and found a forum that instructed me to Settings and download update. It seems like a better way to handle this known issue, versus having customers clog Amazon help desk or seek outside, Internet forums. Otherwise, I am jazzed about this product!", "verified": true, "helpfulness": "0/0", "author": "Greenie"}, {"rating": 5.0, "review": "This s a great thing, we had an easy time setting it up and it has lots to offer. controller is easy.", "verified": true, "helpfulness": "0/0", "author": "Silvia"}, {"rating": 4.0, "review": "The UI needs some work, but it is a decently fast device.", "verified": true, "helpfulness": "0/0", "author": "Daniel Miller"}, {"rating": 5.0, "review": "Very happy with Fire TV. I also have netflicks on my system. It was hard at first to use the controller but work that out with trial and error. Love the voice commands, it really saves time.", "verified": true, "helpfulness": "0/0", "author": "Michael Manthey"}, {"rating": 4.0, "review": "I like it.  Nice user interface.  Great way to watch my Amazon prime movies and shows,  But I wish it had an internet app.", "verified": true, "helpfulness": "0/0", "author": "LanceDr"}, {"rating": 5.0, "review": "So far it's been great.  The only thing I don't care for is that it doesn't have a power switch on it.  I don't like wasting the energy when it isn't in use and unplugging it is kind of a pain.  I think Amazon's intent is for you to keep it on all the time, but that's not what I prefer.", "verified": true, "helpfulness": "0/0", "author": "Richard A. Rude \"rarude\""}, {"rating": 5.0, "review": "Christmas present for my wife, she loves it", "verified": true, "helpfulness": "0/0", "author": "wewdesert"}, {"rating": 5.0, "review": "good stuff!", "verified": true, "helpfulness": "0/0", "author": "Qing Xu \"verysmallfoot\""}, {"rating": 4.0, "review": "I purchased this as a gift for my wife and she was very happy with the device.  No complaints from the Mrs.", "verified": true, "helpfulness": "0/0", "author": "James Barron"}, {"rating": 5.0, "review": "Very fast and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Julie"}]