[{"rating": 4.0, "review": "this works well. if it crashes , which happens sometimes just restart it.so far played anything i throwed at it. no staggeing issues.. i use dual band router with 300 Mbps.", "verified": true, "helpfulness": "0/0", "author": "umanath"}, {"rating": 3.0, "review": "I have a severa problem with this device, no function with Android on nexus 4, in my country Colombia I don't download here, in the description no say this problem, now I have this product without service...", "verified": true, "helpfulness": "0/1", "author": "Willy Suarez"}, {"rating": 5.0, "review": "Excellent commodityThank you", "verified": true, "helpfulness": "0/0", "author": "aslm"}, {"rating": 4.0, "review": "I like the Google ChromeCast, I would have given a five star, but the product itself has some glitches with syncing", "verified": true, "helpfulness": "0/0", "author": "Bradley Coppick"}, {"rating": 1.0, "review": "I was thinking that I could finally stop carrying around 5 different cables to connect my various devices to a TV.  Chromecast was the perfect solution!  No more wires, lots of devices connecting to 1 connector, HDMI quality even.  But Google decided to take a page from the iTunes book, and only allow you to \"cast\" certain things from certain apps.  YouTube?  no problem.  Pay for something from google play?  excellent!  Have a video you shot with your phone you want to show on a tv?  nope - you're out of luck.", "verified": true, "helpfulness": "3/10", "author": "Kimberly Jordan"}, {"rating": 2.0, "review": "While you can control your Chromecast with a desktop computer, you won't be able to set it up with one. You will need either a laptop, or an Android phone.Why? Well, when you first power-up the Chromecast, and plug it into your TV's HDMI jack, the Chromecast creates it's own wireless network. You need to connect to that network (instead of your home router's network) to set-up the Chromecast, and you can't do that with a desktop computer that doesn't have WiFi itself.If you're thinking ahead, you're probably thinking that maybe you can change your router's settings so it'll connect to the Chromecast... but even if you overcome that hurdle, the last step is to connect the Chromecast to your home router's network, and if you've already changed the router's settings, the Chromecast won't be able to connect to it.So you will need a laptop (with its own WiFi), or an Android phone. (Sorry, no iPhones.)Once you get it set-up, you will use an extension to your Google Chrome browser to send content (\"cast to\") the Chromecast. There are two ways to cast to it.First, for Netflix, Hulu+ (not Hulu, Hulu+), and YouTube, you can cast directly to the Chromecast. That is, once you direct the content to the Chromecast, the Chromecast downloads it directly from the internet. You could, theoretically, shut-down your computer, and just let the Chromecast run.The second way you can cast is to send a tab from the Google Chrome browser to display on your TV. Essentially, your Chrome browser is downloading the content to your computer, and then is resending it to the Chromecast. This allows you to watch video from any website.Note that most of the videos you can get online, especially the free stuff, is going to look really bad on a big TV set. So to really take advantage of the big screen, you will need to have either a Netflix or Hulu+ paid subscription to get good, high-def video that can go directly to the Chromecast (as opposed to just re-casting a tab in your browser.) Otherwise, Chromecast is just a cheap trick that'll get a low-rez browser tab playing on your nice TV set instead of on your computer monitor.Update: Okay, I signed-up for the free trial of Hulu Plus, something I've been considering for a long time. I thought that now with the Chromecast it would be worth it. However, even from Hulu Plus, you can't, from your PC (desktop or laptop), cast directly to the Chromecast. You still need to cast the the tab.There are apps so you can use iPads, but not iPods or iPhones, and certain Android devices to directly cast Hulu to the Chromecast, but my Android phone is not supported, and I'm not going to buy a new phone just to cast Hulu.Since it's the start of the TV season, and I have plenty of new things to watch, I'm not going to check Netflix at this time, but I have to say that I am now quite disappointed with Chromecast. It was pitched as if it was a way to turn any TV with an available HDMI port into a way to watch streaming video on your non-Internet TV, but it doesn't play well with PC's at all.If you don't have a fairly new Android phone, the Chromecast is really just a toy that allows you to watch Youtube videos on your big screen. It certainly isn't the greatest thing since sliced bread like it was hyped to be when it was released.", "verified": true, "helpfulness": "2/2", "author": "Warren Holzem"}, {"rating": 4.0, "review": "Do not have very many apps and not enough to match Apple TV . Just Internet connection to TV is enoughCan not use very much", "verified": true, "helpfulness": "0/1", "author": "Sulata Sarkar"}, {"rating": 3.0, "review": "I did not find it as Plug n play as advertised.  Set up is reasonably simple, but the USB needs a power source and micro cable AC adapter (now I have even more plugs in the AV system).  It also took awhile to get Chrome browser updates and app downloads to work.Not surprisingly, Google services like YouTube work fine (but they work on my AppleTV too.  It does replicate any browsing on the Chrome browser, but several streaming websites are not fully supported, such as Amazon on Demand and any Silverlight streaming service.  There is a work around, but the volume won't go through.It's inexpensive, that much is true.", "verified": true, "helpfulness": "0/0", "author": "Kevin Foote \"kevinrfoote\""}, {"rating": 4.0, "review": "its great product hoping to have more options in future updates might make it a better product i hope so", "verified": true, "helpfulness": "0/0", "author": "raj"}, {"rating": 3.0, "review": "I wish that there are apps that is compatible with cheomecast. Currently its too limited to be really useful, hopefully there will be some available soon.", "verified": true, "helpfulness": "0/0", "author": "weRsweeties"}]