[{"rating": 5.0, "review": "The Amazon Fire is truly amazing. The voice recognition feature allows me to access movies efficiency and actually. Movie and TV selections are outstanding and very current.Keep up the great job Amazon!", "verified": true, "helpfulness": "0/0", "author": "David Kiehn"}, {"rating": 5.0, "review": "it is a good product but you make it to where you have to have amazon prime on a lot of it. it should be set up different  than how you have it set up. I don't like the set up of the menu. but other than that it is a good product to buy.", "verified": true, "helpfulness": "0/0", "author": "tammy smallwood"}, {"rating": 5.0, "review": "From package to first tv show was about twenty minutes.  No glitches, no buffering, and set up was a breeze.  Easy to navigate, find your shows, and purchase more programs.", "verified": true, "helpfulness": "0/0", "author": "Matt Schmidt"}, {"rating": 5.0, "review": "After much consideration of the Amazon Fire TV and other streaming video products, we are so glad we went with this. Easy set-up, great choices of programming and movies, and the voice search works great.", "verified": true, "helpfulness": "0/0", "author": "Scott A. Reboletti"}, {"rating": 5.0, "review": "Have only had it 1 week so far it is working out great. and picture is real clear .I love how the scenery shows during the time you have it paused.Have had no problems as of today.Julia jones", "verified": true, "helpfulness": "0/0", "author": "julia  e. jones"}, {"rating": 5.0, "review": "Does everything it is supposed to do.  Thanks Amazon for bringing the Prime experience to the living room with ease.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bye bye cable plenty to watch at better price and no commercials. Easy hook up, small footprint,great value.Money well spent", "verified": true, "helpfulness": "0/0", "author": "DAVID W SMYTH"}, {"rating": 5.0, "review": "Already having the prime membership allows me to watch many movies and TV shows that I like to watch. Also allows to buy or rent new release movies right through the unit at a cheaper cost then going to the movie rental store. Allows me to use it for Netflix and Youtube accounts. I don't need to pay for cable with this thing. I love it!!", "verified": true, "helpfulness": "0/0", "author": "Brian Oldenkamp"}, {"rating": 5.0, "review": "We received the product, easy packaging and setup instructions, video overview and software updates as system was loading.  An amazing system and very easy to use and move through selections and reviews of various movies, programs and features.", "verified": true, "helpfulness": "0/0", "author": "Michael L. Pettegrew"}, {"rating": 5.0, "review": "I have tried everything, roku, chromecast, etc. This is the easiest streaming I have ever do e. I am 55, although on my day I loved hooking in gadget and such, I no longer get such a thrill getting on my broken knees to. Hook up the latest and coolest. This was great, better than great, plug and play,  since it is new I can only see the programming getting even better and better. Great job, Amazon", "verified": true, "helpfulness": "0/0", "author": "nana84046"}]