[{"rating": 5.0, "review": "Very satisfied it this product, It works well and a little better than what I expected. I recommend its use", "verified": true, "helpfulness": "0/0", "author": "Melvin Coleman"}, {"rating": 5.0, "review": "Easy installation.Easy to use. ( via mobilephone and tablet)Tested also with Chrome browser.  ( worked well)Planning to buy one more.  ( for 2nd tv)", "verified": true, "helpfulness": "0/0", "author": "Tomzah"}, {"rating": 1.0, "review": "The only wireless device that consistently drops the signal.  Never get more than 15 minutes of streaming before I get the message, \"This device is not online, please run the app.\"  CAN NOT watch Amazon Prime movies on the full TV screen...Netflix freezes when it starts streaming through Chrome Cast.  Easy setup, oh yeah, the first 15 minutes are wonderful until it shuts down again and again and again...STAY AWAY FROM THIS product.  STAY AWAY...", "verified": false, "helpfulness": "0/2", "author": "John J Shea"}, {"rating": 5.0, "review": "It's amazing price, amazing quality. I watch netflix and youtube with my tablet and amaze my friends with Chromecast features!", "verified": true, "helpfulness": "0/0", "author": "P. H. Nguyen"}, {"rating": 2.0, "review": "Primarily used for playing netflix cast from iPhone  4s.Starting to play a video took longer, since first it needed to start on iPhone, then you can cast it, which has a second buffer delay for starting video on chromecast.But the worst part is once it starts and you put phone away, most of the time, the pause button doesn't work from the iPhone when you go back to netflix.  Even just leaving iPhone on counter, once it times out, normally cannot pause the video.I was also hoping to use device from hotel room, but it will not work on most hotel's wifi security.It is a neat device for the price and able to power directly from USB is a nice feature.An optional remote for pausing would make this device more usable. Or may be better suited with Android.Would not recommend if using iPhone", "verified": false, "helpfulness": "1/2", "author": "Samuel Jackson"}, {"rating": 5.0, "review": "Love this.  Netflix, hulu plus goes to tv. Love. Had no problem connecting to wi-fi. Will recommend to anyone for pc, tablet or phone.", "verified": true, "helpfulness": "0/0", "author": "Beth"}, {"rating": 1.0, "review": "Netflix doesnt work after update. It worked forma about a month and everyone' s that I know stopped working. Hopefully an update will come soon. Will update review ir anything changes", "verified": true, "helpfulness": "0/0", "author": "MIA"}, {"rating": 2.0, "review": "I was disappointed with the this product since in addition to the limited number of apps that support it and complicated installation it would not stream online from some websites (etvnet.com for example) even when I use Chrome browser from a PC (that's supposed to be supported). For some websites flinging doesn't work at all, for some only video works leaving audio playing on the PC. The fact that Chrome+PC is the only browser+platform supported for flinging online content to TV is another big surprise (you can't send content you see on your smart phone onto TV). I guess you get what you pay for.I'm ordering FireTV to check it out.", "verified": false, "helpfulness": "1/1", "author": "Suren Baghdasaryan"}, {"rating": 5.0, "review": "This item is very interesting.I am going to suggest it to my friends.I also like the system for collect the item.Thanks", "verified": true, "helpfulness": "0/0", "author": "sara"}, {"rating": 5.0, "review": "I've tried Miracast, Apple TV, PS3, various DLNA players. This beats them all, hands down.Once you pair it with Plex so you can stream local media, it becomes a fantastic addition to the TV, without any of the ugly set top box nonsense.", "verified": true, "helpfulness": "0/0", "author": "R. Horn"}]