[{"rating": 4.0, "review": "Have had this just over a week.  I like it pretty good so far.  Just one problem,Netflix is not working anymore.Overall it it easy to setup and use right away.", "verified": true, "helpfulness": "0/0", "author": "George Miros"}, {"rating": 5.0, "review": "This is my baby! I Bought two!", "verified": true, "helpfulness": "0/0", "author": "DJ Glover"}, {"rating": 1.0, "review": "It worked great for about 2 days. Now it's extremely slow. The bluray player sitting right next to it is on the same wireless network and it works fine for netflix. The Fire TV just sits there buffering for an hour while it stutters through about 3 or 4 frames per minute.", "verified": true, "helpfulness": "2/3", "author": "Jon B. Loder"}, {"rating": 3.0, "review": "The concept is great.  I am very upset that there are very few free movies, even though I have Amazon Prime.  Most of the time, lately, the sound will cut off and I will have to either try changing my TV input several times or reset the Fire box to factory settings to get the sound to come back on. I don't know if I just got a lemon or if it is an ongoing problem with these boxes.UPDATE: Just added another star for customer service. After two months of resetting the box I emailed Amazon and they are sending a replacement box to me immediately.  I have to say, the customer service with Amazon is excellent.  I will update again letting you know if the sound is good with the new box.", "verified": true, "helpfulness": "0/1", "author": "Christa"}, {"rating": 4.0, "review": "We decided to upgrade from gaming console to an actual streaming device just recently. After much research and debating, the Amazon Fire TV appeared to meet our needs more than say a Chromecast or Roku. So far, it has met our needs and we are enjoying it. The amount of apps and display quality is outstanding! We primarily use Netflix and HuluPlus. They have both worked well. I would give it 5 stars, except for three key things:1. When we received it, the upgrade to load everything took multiple tries and took well into two hours. Our internet connection is not huge, 2M, but it has no problems streaming for the most part (slight buffering from time to time). However, this upgrade was quite frustrating. We initially thought we might have to return it... I do not look forward to any future updates we will need.2. I have yet to figure out how to power it off without unplugging it. Call me frugal, but when I am done using the unit, I do not want to continue the electricity... It does go to a screen saver and eventually turns off on its own, but I would rather be able to do so myself.3. Lastly, the prime content is always on the main screen. Realizing this is an Amazon product so they want their content first and foremost, I would much rather it be an app like the other options we use. This is purely personal preference though.Overall a very cool device and I think we will be purchasing a few more in the near future for bedrooms etc.", "verified": true, "helpfulness": "0/0", "author": "Jenn"}, {"rating": 5.0, "review": "A grand slam.", "verified": true, "helpfulness": "0/0", "author": "Francisco Heredia Cortes"}, {"rating": 3.0, "review": "Bought this item and can't use it because I live in Canada.  Even though I am in the US everyday and live on the border you can't get any of the programming that you pay for.  Easy to set up and use but would have like to know that it doesn't work outside of US.  Can't even use my Amazon Prime membership for movies either.", "verified": true, "helpfulness": "0/0", "author": "Christina L Coulbeck"}, {"rating": 5.0, "review": "Oh, I am just in Love with my Amazon Fire Box and Fire TV!  My cord cutting experience has exceeded my wildest dreams!  I have had much more to watch -- new stuff -- than I ever imagined and, other than HBO, not only am I NOT missing anything, the selection and quality of what is now available to me is staggering.  The box works great.  Love the voice search and operation of the unit is simplicity itself.  I must admit, I didn't set it up.  I also bought a Tivo Roamio and new speaker, receiver, etc. so the Geek Squad did it all, but it operates perfectly and I'm delighted I made this decision over the Roku 3.  Highly recommend Amazon Fire TV!  HBO will stream in 2015, so I can wait.", "verified": true, "helpfulness": "0/0", "author": "Jesse828 \"Jesse Parraine\""}, {"rating": 4.0, "review": "UPDATE:  I can now use Netfliz successfully. This is a very intuitive device now that I have gotten the hang of it. I use it 3-4 times a week or more. Very satisfied.Let me get this out of the way first-I can not get Netflix to work! I have read all of the forums and tried all of the tips and tracks, but all I get is that Netflix is already installed. But it is not. I have checked and so have others.Otherwise, installation was a breeze. I think the idea is great, but Roku just seemed easier to use. Sorting Prime should be intuitive, not seek and find.I asked for this for a Christams gift and received it early due to it being on sale. I hate to say it but I guess it will have to be returned.", "verified": true, "helpfulness": "0/1", "author": "Shawn P. Tully"}, {"rating": 2.0, "review": "I have to power cycle it every other time I want to watch Netflix or hulu. Support for this has been horrible. XBMC works great though. UI is hard to get around and needs work.", "verified": true, "helpfulness": "0/0", "author": "David Wheelen"}]