[{"rating": 3.0, "review": "Chromecast glitches sometimes.  If you play with the settings you can get it to work. Although I'm not 100 percent satisfied with it I still give it 3 stars.", "verified": true, "helpfulness": "0/0", "author": "David F. Shaw"}, {"rating": 5.0, "review": "I love my chromecast!Prior to getting the chromecast, I already had 3 streaming devices (computer, xbox, wii) hooked up to my TV and my network set up for media sharing through those, plus I don't use Chrome as my primary browser, so I doubted I was going to use the chromecast very much. Simply put, I was wrong. The ease of streaming things through chromecast has changed how I use my TV to stream content.For video, instead of starting up my media center on the TV, browsing through to my network share(s), and finding content, I can simply open it up on the desktop hosting the content and be streaming it to the TV within seconds, in higher quality and with fewer buffering issues than I've experienced with VLC. I use the VideoStream app for chrome, which includes a remote app. I don't subscribe to cable, so I've also used it to stream live events, such as the State of the Union, via Youtube and this was absolutely seamless.The biggest use case in my house is actually to play music - I already stored my music collection on Google Play, and it takes a few seconds upon getting home to click 'cast' in the music app and have my music playing through my media center while I cook.As a passive device, the Chromecast displays art, weather, and photography on the TV when I'm not using it, all of which is tasteful, making a nice addition to the room and helping me feel like my TV is useful for things other than sitting down and watching things/gaming.One other thing to mention is how much this device has improved since I first purchased it. Updates to the Chromecast firmware/OS have made it much more stable (I haven't had a single issue, disconnect, or restart for months). Furthermore, developers are starting to release some great apps that extend the use cases beyond streaming video content. Take for instance CardCast - it allows up to 10 players to play Cards Against Humanity (with custom decks) on a chromecast if they download the (free) app. The app is well-designed, easy to use, and most importantly functional, and really demonstrates the potential of Chromecast perfectly. I hosted a party last weekend with over 70 attendees and had Cardcast running on our TV, it was a huge hit!A final bonus - the google Play credit(s) you get when buying a chromecast make up for most, if not all of the original purchase price, making it essentially free, especially if you have one or more android devices and plan to use that credit anyway for apps etc. Make sure you go to 'check offers' once you set up your chromecast to redeem these.All in all, a great device, and definitely worth the price!", "verified": true, "helpfulness": "0/0", "author": "Tim Johnstone \"Avid Prime member\""}, {"rating": 5.0, "review": "Great price for this must-have device. How did I ever get by without these? I can't believe the prices other vendors are asking.", "verified": true, "helpfulness": "0/0", "author": "Gary Stone"}, {"rating": 5.0, "review": "love this product", "verified": true, "helpfulness": "0/0", "author": "Elisa"}, {"rating": 3.0, "review": "Lots of steps to setup.", "verified": true, "helpfulness": "0/0", "author": "E. Sheppard \"Da Shepster\""}, {"rating": 5.0, "review": "Love it. Great quality picture and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Mark C. Pine"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jose Ortega"}, {"rating": 5.0, "review": "Hooking it up was a breeze. I'm a tech geek and I can't do everything on it. 1080 no but looks danm good. Buy it you won't spend 35 bucks any better on a tech product.", "verified": false, "helpfulness": "0/0", "author": "gregory wynne"}, {"rating": 5.0, "review": "it froze sometimes does not have some native apps to cast you have to use third party apps but it does generally what it suppose to do", "verified": true, "helpfulness": "0/0", "author": "Xsthian"}, {"rating": 5.0, "review": "Wish I knew about this handy device sooner.", "verified": true, "helpfulness": "0/0", "author": "Amber Demus"}]