[{"rating": 4.0, "review": "I have this product and I have used it many times for Netflix and Hulu. I personally like this product because it's easy to move from tv to tv. I prefer boxes like the Apple TV or the Roku but this is a great product for the price and a nice gift for someone that doesn't have a smart tv", "verified": false, "helpfulness": "0/0", "author": "Benjamin"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Maximiliano Coll"}, {"rating": 3.0, "review": "Slows internet transmission speed when transferring movies from laptop to TV screen. Great for surfing the web, looking at Ebay, Amazon, Pictures, etc.,  but not for online movies.  On movies, there is \"still frame\" jitter.  Useless there. Disappointed.", "verified": true, "helpfulness": "0/0", "author": "d. Benyo"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Rebecca R."}, {"rating": 4.0, "review": "Easy to install and works fine but I still prefer my old Roku so I don't have to tie up my laptop.  I also have to watch the TV shows at reduced quality or the sound is not clear.", "verified": true, "helpfulness": "0/0", "author": "Photomurage \"GrandpaG\""}, {"rating": 5.0, "review": "Its easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Forget about cables, you can use your phone whit it.", "verified": true, "helpfulness": "0/0", "author": "Sergio A. Nunez V."}, {"rating": 5.0, "review": "Anyone who has used one of these can't argue with how freaking amazing it is.  I have two and I would never get rid of them.  My ex tried to take mine and I wouldn't let her.  This is too good (she immediately bought another, because they're THAT GOOD).", "verified": true, "helpfulness": "0/0", "author": "Jeff B."}, {"rating": 5.0, "review": "We love it!  We  use especially to stream youtube videos for our 2 yr old. Very easy to install.  It does work outside of the USA but there is always issues streaming content outside of the US so be aware.  Good value for money.", "verified": true, "helpfulness": "0/0", "author": "Nicole C"}, {"rating": 3.0, "review": "The OS of chrome is buggy and stalls streaming at times! The video-audio sync is also off in some cases.", "verified": true, "helpfulness": "0/0", "author": "Chetan Kumar"}]