[{"rating": 4.0, "review": "I was pleased with the ease of start up. I was surprised to find that I needed additional software to cast photos to my TV but it was easily and cheaply available on the internet.", "verified": true, "helpfulness": "0/0", "author": "S. C. Fisher"}, {"rating": 3.0, "review": "Pretty cool for streaming Pandora at parties and watching movies and shows rented from the Play store, but casting a pure webpage from Chrome is pretty mediocre.  Other devices around the house perform its other current capabilities much better (PS3)?.", "verified": true, "helpfulness": "0/0", "author": "Simon S. Dietsch"}, {"rating": 5.0, "review": "I tried one and then brought 2 more for our other TV's.What can I say, nice product, great price, and works well.", "verified": true, "helpfulness": "0/0", "author": "John Buttner"}, {"rating": 5.0, "review": "I bought this as a Christmas gift for my techie husband and I've ended up loving it just as much as he has! You can stream just about anything to it, not just Netflix or YouTube. I pull my Google Play account up and stream my music through it as I clean. I can watch television shows on network websites, etc., and cast it to the big screen in the living room. This is EASILY the best gift I bought this Christmas!", "verified": true, "helpfulness": "0/0", "author": "Carla Hinson \"Doligurl\""}, {"rating": 3.0, "review": "Update 4/7/2015 !!I just got the Amazon Fire Stick which comes with a Remote.  I take it with me to hotels and stream my Amazon prime movies to the Hotel room TV.... works really nice.  It seems, one can't live life with only just one media player, so be prepared to by several Media players like I did. In the end, it's a lot cheaper tan taking the family out to $100 a night at the movie theater. My Chromecast is plugged in behind one of my TV's and i don't even know it's there......  it's that forgettable compared to the rest.  : )  I'm just sayingI bought 3 of these Chromecasts thinking it would be the answer to all my TV watching Dreams.I thought, stream hulu, Netflix, Amazon Prime, HBO go, MAX go, Pandora, Spotify, Steam from my PC, stream from my ipod and iPhone..  : )Boy was I woken up fast!So here's the thing.  I own, Apple TV, Roku and now Chromecast. and at the end of the day, NONE of these will do everything you need. Oh and I'll talk about my Xbox 360 and my PS3 as well.Here's what I found from the 3 devices:Chromecast:1. I have to find my iPad in order to use this device. God forbid if the battery is low. God forbid one of the kids are using it. : (2. So i'll just use my PC to stream. God forbid I have dual displays, as it comes out so tiny on the TV, I can't see anything at a respectable size. So I just remove one LCD and whoa, it does not match my TV resolution so I get black bars all around.  : (3. OMG. the sound only goes through the TV set and not my Stereo. Oh yeah, that's because the streams don't actually come from my iPad. : (4. Resolution and sound are bad, really bad compared to my Apple TV and Roku.Apple TV:1. Wow, can you please just add Amazon Prime already? and maybe MAX go and Spotify so I don't have to buy Google Chromecast and find out it doesn't do much?Roku:1. I wish you was an Apple TV so you could work with my iphone2. Plays Amazon prime, HBO go, Max go, Pandora..  no Spotify : (3. Oh my Onkyo Stereo plays Spotify .. go figure.PS 3:1. Waiting for you to boot up is taking way too long.2. Must you tell me when ever my kids friends go online? It interrupts my movie!3. Not a bad solution as you can play Blu-Ray, DVD and do Amazon prime, but you can't work with my iPhone.Xbox.:1. Do you really need me to join Xbox Live to watch HBO GO?  I mean really?2. You can't even play Blu-Rays...  I'm so disappointed in you I banished you to the basement.So in the end............Roku would be the best DO EVRYTHING choice if it had iPhone streaming, and a Bluray\\DVD player built in.So if you had to pick just one...  just buy the Roku, you'll be real happy.But then again..  each of our needs are different... so..  see what's important to you and if you want it all, then you will need to buy a Roku, Apple TV, PS3 and Chromecast like I did.", "verified": false, "helpfulness": "1/2", "author": "A. Aguilar \"TAPC\""}, {"rating": 5.0, "review": "Chromecast is essentially Google's version of AirPlay, except it works much better than AirPlay does with an AppleTV (I'm an Apple fan and I can admit it). I use the beta Chromecast extension in Chrome to stream video to my TV from various sites (NBA League Pass, YouTube, etc.) with no problems. And if you want to stream local video you can use RealPlayer Cloud!", "verified": true, "helpfulness": "0/0", "author": "Garett Southerton"}, {"rating": 5.0, "review": "I use this to stream Netflix and YouTube onto my TV. The bottom line is that is \"just works\". It is easy to set up. It is simple to \"cast\" my programs to the TV. And it much cheaper than other streaming devices.", "verified": true, "helpfulness": "0/0", "author": "John McKown \"Linux user\""}, {"rating": 4.0, "review": "Only works for a few apps and several you have to pay for. It needs more functionality with chrome on mobile devices and other streaming apps like Audible.  Besides that, its useful especially if you don't have a current way to stream Netflix or Hulu.", "verified": true, "helpfulness": "0/0", "author": "Conor McLean"}, {"rating": 4.0, "review": "Love it... would really have given it 5 stars had there been a greater number of \"partners\" to provide streaming content. I think in the long run, through Google's tests of Google Fiber that they are going to make a run on television via fiber... so that will lend great advantage to this product. I just streamed all of season 1-3 Homeland and watched them all nearly every night awesome series - o connection issues seamless set-up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "When the chromecast is powered on the ports keep changing to the chromecast input, even when on a different input.", "verified": false, "helpfulness": "0/0", "author": "Billy Bateman"}]