[{"rating": 1.0, "review": "Bad", "verified": true, "helpfulness": "0/2", "author": "ABBAS There alhabfoosh"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Jhonny Mojica"}, {"rating": 4.0, "review": "It is a great device but lack of functionality.The screen casting lags and there is no easy way to access locally stored files on the home network.Furthermore the communication between the phone and the device is done through the home wireless network and not WiFi direct.", "verified": true, "helpfulness": "0/0", "author": "Leo"}, {"rating": 5.0, "review": "Love Google Chrome! Such an amazing deal!", "verified": true, "helpfulness": "0/0", "author": "Ilovemesomeboots"}, {"rating": 2.0, "review": "Very Choppy! Unless you really are interested in extending the display of your computer for surfing the web or showing pictures I would recommend spending the extra money on a roku or comparable device", "verified": true, "helpfulness": "0/0", "author": "Silky Smooth"}, {"rating": 3.0, "review": "I chose to purchase the Google Chromecast after reading several great reviews. Unfortunately, this product only worked as it should for about 3 months. We constantly lose the Chromecast connection -- it was so aggravating that we just went and bought the $50 HDMI adapter for our iPhone. We have done the manufacturer hard reset, the soft button reset on the actual Chromecast and have had our internet connection increased to the fastest speed with a new router to ensure that wasn't the issue. So now we are in the process of waiting for a Google rep to contact us pertaining to the replacement of the product. Honestly, I would just save the money and buy the HDMI adapter for your phone and call it a day. The hassle of the product doesn't outweigh the benefit!", "verified": true, "helpfulness": "0/0", "author": "Jenna Marie"}, {"rating": 4.0, "review": "It's ok", "verified": true, "helpfulness": "0/0", "author": "John Edward East \"Mrgj\""}, {"rating": 5.0, "review": "i liked its functioning", "verified": true, "helpfulness": "0/0", "author": "KONDALA S."}, {"rating": 5.0, "review": "This is a great tool for playing video through your smart phone, iPad, etc. on your TV. Setup is easy and the quality is good.", "verified": true, "helpfulness": "0/0", "author": "JulzGaye \"julzgaye\""}, {"rating": 2.0, "review": "Streaming from my compute( Mac) was not smooth .. Ended up with Roku stick..", "verified": true, "helpfulness": "0/0", "author": "Chandar"}]