[{"rating": 5.0, "review": "Great device despite not being able to connect to a hidden wifi network.", "verified": true, "helpfulness": "0/0", "author": "Derrick L. Houston"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Fabian Canosa"}, {"rating": 5.0, "review": "Works great streaming Netflix, Hulu, Youtube, and more to TV", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 1.0, "review": "works well from my desktop mac, but not at all from my HP laptop. I rarely use it, but since it was 35 bucks, its not a big loss.", "verified": true, "helpfulness": "0/1", "author": "J. Donald"}, {"rating": 5.0, "review": "gift for daughter", "verified": true, "helpfulness": "0/1", "author": "Tom Dunham"}, {"rating": 4.0, "review": "Very good product. Too bad that you cannot use this in hotels, since you can't use it where wifi requries some user input", "verified": true, "helpfulness": "1/2", "author": "Rodrigo Possemolina \"*RPM\""}, {"rating": 5.0, "review": "Google is a great company and this is a great device. Download the app for your device and send anything you want to the associated tv. Youtube, netflix, mirror your computer. Other options are being put in as well. BUY SEVERAL OF THESE!", "verified": true, "helpfulness": "0/0", "author": "Patrick Doyle"}, {"rating": 5.0, "review": "This is simply just magic! which is what my mom said.  this little thumdrive sized gizmo plugs into your HDMI slot on your TV and then a micoUSB for power, download the app on your phone and youre ready to go.  music?  put it on the big screen. cat videos on youtube? put it on the big screen. that netflix show? put it on the big screen.  buy a movie from Google Play? put it on the big screen.  you can eve download the chrome extension and mirror your browser, however that one does have a little lag.  but all in all, and especially since i cut the cable 5 years ago, this has changed the way i watch TV.", "verified": true, "helpfulness": "0/0", "author": "James Chen \"Yu Chen\""}, {"rating": 5.0, "review": "Great Media Player.  Better than the ones over $100", "verified": true, "helpfulness": "0/0", "author": "kevin sweet"}, {"rating": 3.0, "review": "Needs a better interface with Netflix!", "verified": true, "helpfulness": "0/0", "author": "Jeanette C. Czmyr"}]