[{"rating": 1.0, "review": "Bought this for one reason - to use with my Plex media server. Unfortunately playback keeps freezing. Apparently this problem isn't isolated to my unit -- a lot of Plex users are complaining about same problems in the Plex forums. If you're buying this to watch Amazon Prime Video or Netflix, I'm sure it's a good product, but if you're looking to use it with Plex, save yourself the aggravation (luckily I returned it before throwing the Fire TV box into the Intracoastal).", "verified": true, "helpfulness": "0/2", "author": "Brian Styles"}, {"rating": 1.0, "review": "I have used Roku for years and was looking forward to the Apple Fire Stick. When it arrive - a bummer - Livestream is not available as an app on Fire Stick. It is on all forms of Roku. This is an important public service app and should be on Fire Stick. I am considering returning the product.", "verified": false, "helpfulness": "0/2", "author": "DesertDweller"}, {"rating": 3.0, "review": "Pretty cool interface.  Picture quality is not that great compared to other streaming players.  Lots of issues with optical audio out, works ok with HDMI audio.", "verified": true, "helpfulness": "0/0", "author": "Danial Shimiaei"}, {"rating": 5.0, "review": "great product.  No longer have cable TV.  Don't need it.", "verified": true, "helpfulness": "0/0", "author": "W. G. Hand"}, {"rating": 1.0, "review": "ORDERED TWO , DIDNT WORK. I AM DONE", "verified": true, "helpfulness": "0/3", "author": "anna m lonero"}, {"rating": 5.0, "review": "We love our new fire tv. Easy installation", "verified": true, "helpfulness": "0/0", "author": "LM"}, {"rating": 5.0, "review": "Easy to install and set up.  It couldn't have taken more than five minutes to get it ready, connected to the internet and my tv.  Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Ellsmore Vence \"Bird Lover\""}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "KATHLEEN A SULLIVAN"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "gene funkhouser"}, {"rating": 5.0, "review": "It is much better than ROKU, I have two of them and they are very responsive.", "verified": true, "helpfulness": "0/0", "author": "William H. Carroll"}]