[{"rating": 5.0, "review": "works perfectly! very easy to sep up (almost plug and play) and receives wifi signal quite smoothly! i see HD youtube videos without any delay", "verified": true, "helpfulness": "2/3", "author": "Alejandro Marti-Garro"}, {"rating": 4.0, "review": "I've been pleased with my Google Chromecast so far. Set up was a breeze and took less than 5 minutes. My TV has the HDMI and USB ports right next to each other, so I use the USB port to power it rather than add another plug into my surge protector.The casting works excellent with Netflix and YouTube. These apps send the video right to the TV without delay and with great audio and video quality. Casting Chrome pages doesn't always work as well. To show my kids something last night I tried casting a page from Nickelodeon, whose video player wasn't YouTube. It froze at first and then only played audio. This is an area that could stand improvement.Another glitch it that my little girl has accidentally beamed her cartoons from Netflix on the iPad onto the main TV where my older boys are watching their shows. The boys didn't appreciate that it automatically changed the input, but they could change it right back to their input.I'm looking forward to taking this to hotels and using it with HDTV's and Netflix instead of the crappy in-hotel selection. It is so small it is easy to transport, and again the set-up was so simple. I wonder if a hotel's Wi-fi signal will be enough for a smooth use.Overall, for the price it is a great value and I'm using it so far. I hope it gains further functionality in the future.", "verified": false, "helpfulness": "3/3", "author": "Jason Joyner \"On the journey\""}, {"rating": 4.0, "review": "This is a brand new product, so it will take some time to get it perfect.The setup is painless, but you need to be connected to the same wifi as the chromecast for it to work.Casting a tab from chrome is imperfect - to make it better, lower the resolution of your screen to match your display.Netflix works fantastically, as does youtube.  I'm looking forward to apps that allow me to stream Plex and/or local content.", "verified": true, "helpfulness": "2/2", "author": "Dipul Patel"}, {"rating": 5.0, "review": "Easy to set up and easy to use, love the youtube queuing feature but definetely needs more applications and support. Looking forware to the future.", "verified": true, "helpfulness": "2/3", "author": "Q"}, {"rating": 5.0, "review": "Does exactly what it advertises for $35.I wanted a way to easily stream YouTube videos to my entertainment system and Chromecast does that.  When friends come over they always want to show some song or video to everyone and hooking up a laptop with an ugly hdmi cable to the TV was out of the question.  A media center PC was an option, but costs a decent amount of money.  I have a roku for netflix (only way to watch netflix) so I don't need it for that.First night I set it up I had 3 friends come over.  At first everyone was using my tablet to show a new song or a funny video, but soon enough they were all casting it from their own android phones (they had access to my wifi).  Worked perfectly and was easy for everyone to figure out.The only thing I had trouble with was that to cast a stream from Chrome on the PC, you need to install the Chromecast extension.  That was not mentioned in any of the instrunctions.", "verified": true, "helpfulness": "6/8", "author": "Adam Dewing"}, {"rating": 1.0, "review": "This thing is not even a beta product.First and foremost, the device does not connect to \"N\" networks. Devices you stream from can be on n, but not the Chromecast, it only supports b/g wi-fi connectivity. I was shocked by this myself, but after digging through the support page I finally found the unadvertised truth.This will limit the bandwidth to a ~2.75 MB (not megabit) per second. So be very aware that all transcoding and processing is being done on your laptop/desktop/mobile device/etc.So I excitedly plug the thing in, get it powered up, suffer through the wi-fi pairing dance, and start casting from chrome.The introduction video play back is stuttered, laggy, low res, and unwatchable. If this were a tv show I would lose my mind.The Chromecast tab in my browser starts to complain about poor performance and that my device should be on a \"N\" network if available. Due to the wi-fi pairing dance it wasn't. So I switch it over and start again. Video is a little better, but audio is sluuurrrrrrrrrrrrddddddddd. Audio and video quickly get out of sync. Again if this were a TV show it would be unwatchable. Mouths and voices need to sync up, it's not a \"nice to have\" feature, it's a \"must do\" requirement of any video streaming product.Yet again the chrome tab is complaining about \"optimal performance\".Fine, lets look at the settings. 720p is the MAXIMUM setting. The solution for poor performance is to set the resolution down to 480p. That's right kids, just downgrade to SD resolution and things will be fine...I decide to try it at 480p. Blocky, laggy, pixelated, hell.Fine, maybe its my source device. I startup my newer work laptop. Same problem. Fine, lets try my iPhone. Same. iPad (3rd gen) same.One of my co-workers brought his into the office thinking we could use it for screen sharing during meetings. Same kinds of issues. So its not a problem with my hardware, or my network. Three of my very tech savvy co-workers bought this thing thinking it was going to be AWESOME.  We have all since sold our devices at a profit through 3rd party sites, which is really a shame.People are overpaying for garbage. Do not buy this product until at least the next revision.", "verified": false, "helpfulness": "9/33", "author": "Jeremy Kowalski \"Just Jeremy\""}, {"rating": 5.0, "review": "The Google Chromecast was announced, and I immediately bought it with intentions of replacing my Apple tv or Roku boxes that we currently we use at my home.  I got it the next day somehow and immediately started setting it up.  It took all of about 10 minutes to unhook my old Roku and hook this up.  Super easy and the setup instructions are great to.This just worked perfectly with my Iphone and my Android devices right out of the box.  I really REALLY like being able to control the volume right from my device.  To do this I usually set the tv volume to slightly higher than I normally do, but that gives me the control from my phone to turn up a quiet video, or turn down a loud video from youtube right away instead of fumbling for the remote on the other side of the couch.  The Included AC adapter is a huge plus.  I am very satisfied with the fact that they include it for the price point of 35 bucks!  I expected to have to provide my own for the price.++  I was able to log into XFinity TV, and stream Dexter to this in my bedroom pretty flawlessly through the chrome browser on my computer.  The apps for the phones don't have a cast button in them, and I don't think they will honestly, but if you have a good wireless network signal, I don't see any reason why you won't be able to do this.  Also the Cast plugin for Chrome is currently said to be experimental, which I can say is true when casting simple web browsing, but for some reason the video streaming was flawless.  I really really like this.++  I also carried this to California for some personal travel and was able to stream my Netflix right to it on the LED TV in the room!!!++  Youtube and Netflix are flawless in my experience so far.-- One note as of 8/10/2013 I occasionally have issues when setting it up to my hidden SSID.  I have connected to it about 10 times now and out of those 10 times, 3 simply would not connect no matter what I did.  I had to broadcast my SSID, have it connect, then I was able to hide it again and it worked.  Most people I'm assuming wont bring these all over and travel as much, so it shouldn't be a problem.", "verified": true, "helpfulness": "2/2", "author": "Brian McL"}, {"rating": 5.0, "review": "The most amazing $35 tech item in the history of the world. I am enjoying mine and while it isnt an absolute media center replacement yet, for $35 it is pretty awesome.", "verified": true, "helpfulness": "1/1", "author": "txaggies07"}, {"rating": 5.0, "review": "Soon you will be able to cast ALMOST ANYTHING to your display, local media included with no Plex server in the way, it's already working, as soon as Google finalizes the Chromecast SDK it will be released by CyanogenMod.[...]I was able to get in on the first batch and after having it a while I have to say this thing is quite amazing, especially for the price.  It's simplistic, small, and has different methods for providing power to the device (plug in to regular outlet, USB, and through HDMI by itself is your TV/display supports it so NO cords at all).  With just the supported apps right now it's amazing.  I had given up on Netflix about two years ago and was able to get the 3 months free deal.  It's amazing how simple the phone/tablet interface is and how setting it up and casting is so easy.  Dolby Digital Plus HD Video that looks great.  Next I jumped over to YouTube and played some different files, one that I use a lot as a good benchmarks is a Samsung 1080p demo.  It looked amazing through my Samsung S3, my year old Nexus 7, and casting from a Chrome tab itself inside Windows.", "verified": false, "helpfulness": "5/7", "author": "Josh Fisher \"diggumsmax\""}, {"rating": 4.0, "review": "So far I am disappointed with this device.  It has limited functionality, does not work with chrome on my tablet and while I received an email from amazon stating that I will receive my netflix code 5 days after shipping of the device, I have not yet received it.  So...until there is more functionality developed for this, I am keeping it in its box.Update 8/22/13:  After contacting Amazon Customer service, the code was sent to me within 24 hours.  Netflix functionality and good customer service is worth a move from 3 to 4 stars.", "verified": true, "helpfulness": "0/4", "author": "Dennis Grey"}]