[{"rating": 1.0, "review": "Worthless piece of junk!  Does not work with samsung s3 mini, so does not work with most android devices won't mirror screen. The chromecast app does recognize the device and does connect, But a \"beta testing\" warning pops up and says all functions may not work, however nothing works, just errors and no casting, making this device useless.  Will not work with linux. Very frustrating to use. I am very disappointed as I like Google and it's products.I bought this thinking that it would work as well as the youtube cast button when using the youtube smart tv app which does work well.", "verified": false, "helpfulness": "0/2", "author": "David"}, {"rating": 1.0, "review": "I'm techie. After hours of trial and error, I was able to get it to work once. Then a few weeks later, couldn't get it to work. And I am fairly techie. It is far from plug and play. I wish it just worked.", "verified": true, "helpfulness": "0/0", "author": "Frank Frank \"Frank\""}, {"rating": 4.0, "review": "Quick, easy set-up. Streaming from You Tube within 10-mins, however disappointed to find we will not be able to use this to watch Game of Thrones on Sunday. The new HBO Now app does not recognize the Chromecast. Guess I will be going back to my cable company 😔", "verified": true, "helpfulness": "0/0", "author": "Brit in the US! \"Wend\""}, {"rating": 5.0, "review": "item as advertised, fast shipping", "verified": true, "helpfulness": "0/0", "author": "ono4711"}, {"rating": 5.0, "review": "Works exactly as described. I love it!", "verified": true, "helpfulness": "0/0", "author": "ramon sundquist"}, {"rating": 5.0, "review": "Completely improved Dad's TV experience after buying him one of these for Christmas. In a world where Over the Top TV is becoming the new normal, turn any TV into a smart TV if it has a spare HDMI port. Makes a great gift.", "verified": true, "helpfulness": "0/0", "author": "Joey Thimian"}, {"rating": 5.0, "review": "One of the most elegant technological innovations to date. I had my doubts when I purchased Chromecast to replace my HDMI connection to the Living Room TV. I have never been so happy to be wrong. With my old setup, I had to keep a laptop connected to the TV via HDMI. While the HDMI Cord works, it is not ideal. There are serious restrictions with range and my chromebook was having some audio issues when playing movies from my external HDD. Now, I plug Chromecast into the television and after setup with a wireless device I am able to cast any application from any device anywhere in my house!I was taken aback the first time I used Chromecast. The video quality is incredible for apps like Amazon Prime Video, HBOGO, and Netflix. I usually have better quality video while Chromecasting from my desktop in the other room than using the apps on my \"Smart\" TV. Another very important note is that Chromecast essentially transforms any TV with an HDMI port into a Smart TV. You have access to all of your TV's old applications and more. You can save a lot of money by purchasing a regular television and Chromecast rather than purchasing the smart version of your flat-screen TV.Note: I did not know before purchasing, but Chromecast can cast any videos from your hard drive if you are able to play them from your browser. How do you play a video file from your browser? Just drag the file into an empty tab and then cast it to your TV.Pros:-Excellent picture quality-Long wireless range-Lots of apps-Plays movies from hard driveCons:-Can't conduct setup from a wired Ethernet PC (You can still use the wired PC, you just need to setup Chromecast on any wireless device)-It doesn't make you breakfast in the morning.", "verified": true, "helpfulness": "2/2", "author": "John"}, {"rating": 5.0, "review": "This product is great. Since I only watch streaming television, it is great to be able to watch it on the television screen, and not just the computer screen.", "verified": true, "helpfulness": "0/0", "author": "Love2Learn"}, {"rating": 5.0, "review": "I love my Google Chromecast! I only wish more programs were compatible. Maybe in time apps will be available for every program.", "verified": true, "helpfulness": "0/0", "author": "aCrazyCowgirl \"aCrazyCowgirl\""}, {"rating": 5.0, "review": "Don't pay extra for a smart tv-just get this!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}]