[{"rating": 4.0, "review": "I'm not going to repeat what every other reviews have already said but in my experience it does what it says it will do. In addition to youtube and netflix if you are interesting in casting tabs from chrome you will need to use the power adapter for the chromecast to perform without any hiccups. Initially i had the chromecast powered using the USB on the TV which made the tab casting really a pain..only after using the power adapter i was able to actually stream videos on chrome browser tab without any issues.", "verified": true, "helpfulness": "0/0", "author": "F. Mathew"}, {"rating": 4.0, "review": "Great product ..easy to use.. always seems to crash first time you try to load a movie. after that it works great.", "verified": true, "helpfulness": "0/0", "author": "michal l cole"}, {"rating": 3.0, "review": "Setup was very easy but staying connected to it was another issue. I hope they add more choices in the near future because there isn't much outside of Netflix & Hulu. I was also very dissapointed to find that it doesn't support Amazon Prime video. Too bad", "verified": true, "helpfulness": "0/0", "author": "Jason A. Jinks \"WebJinks\""}, {"rating": 4.0, "review": "Have a Roku, smart TV and now a Chromecast.  If you are uncomfortable with using a PC, iPhone or iPad as the \"controller\" for this device then buy one of the other products that offer the same, different or more capabilities.  It does offer some things that are unique to this type device, such as the ability to use Google Play via the Chromecast as well as displaying your stored pictures and videos on your PC.  Again it is a more tech savvy device for all its capabilities that some of the other devices, but with a little guidance it is a very cost effective tool.", "verified": true, "helpfulness": "0/0", "author": "Ken \"Pop\""}, {"rating": 4.0, "review": "Pretty happy with this over all. Comparing a Netflix stream on this to one on a Roku, the quality of the image doesn't seem to be as good on the Chromecast, but still fine, especially for the price. The one thing I miss is not having a remote, and having to use my phone to control it.", "verified": true, "helpfulness": "0/0", "author": "Ian Bartholomew"}, {"rating": 5.0, "review": "Works great, love to have. Super quick delivery and the product was incredibly easy to install. I bought this as a gift, and now I plan to buy another for myself.", "verified": true, "helpfulness": "0/0", "author": "grdsb"}, {"rating": 5.0, "review": "If you don't have one, buy one today. I love this product. I have one for both of my TVs - these make GREAT gifts!", "verified": true, "helpfulness": "0/0", "author": "Mari"}, {"rating": 5.0, "review": "A family member told me how I could wirelessly project the movies and TV series from my Netflix or Amazon Prime account from my computer onto my large screen television so I had to order one.The price of the Google Chromecast is certainly affordable, and the instructions were so easy to follow, even for someone like me, who is not techno-savvy. Now, whenever I want to watch one of my favorite movies/tv series from one my subscriptions like Amazon Prime, I simple pull up the movies from my account onto my laptop, change the source from cable to Chromecast, and it immediately streams onto my tv.I was somewhat dismayed to learn that the Kindle Fire tablet i received for Christmas would not stream wirelessly from tablet onto Chromeast; however, until the technology improves to accommodate my tablet I'm happy to stream from my laptop. Love this device!", "verified": true, "helpfulness": "0/0", "author": "ncg12218"}, {"rating": 5.0, "review": "I've been running a laptop via HDMI to my TV for years but for $30 bones I thought I would try out Chromecast for fun. It's been awesome. It definitely lacks some functionality for a lack of apps but when the SDK gets finally released this thing will be the best thing to happen to TV's. Currently rocking out to Pandora via the chromecast and loving it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Chromecast is very easy to setup and Use right of the box.  Occasionally chrome browser tab mirroring will suffer a lag. Hopefully these Issues week be sorted out in successive software updates.  Need to see a few more chromecast apps on Google play store this year to justify This product.", "verified": true, "helpfulness": "0/0", "author": "V. Priyadarshi"}]