[{"rating": 1.0, "review": "Period. If it sounds too easy to be true.....it is! I guess you need to be a techie to work it. Far from the \"123\" instructions they make you believe. I'll be returning it. I spent enough time on it already. Plug and play? NOT!", "verified": true, "helpfulness": "1/4", "author": "Rick Brenner"}, {"rating": 5.0, "review": "Wow. What firepower and utility packed within a HDMI sized usb key. This marvel of extra-ordinary technology perfects the TV, making any flatscreen into a Smart TV packed with apps, and controlled by the lowly smartphone. It is said that even the Caped Crusader himself, yes, Batman carries one with him on his utility belt. All my years of using Google have finally paid off with this, the crown jewel of all AV gizmos.", "verified": true, "helpfulness": "0/0", "author": "Lee Crigger"}, {"rating": 2.0, "review": "Setup was not to difficult but it was not seamlessly either. The dongle requires a power source either usb or outlet, so you don't just plug it into an hdmi port.The biggest problems with this is the lack of apps for it,reliability,latency and performance.In regards to the lack of apps you can use the chromecast extension on a PC with the chrome web browser , but that is not up to par. The extension is in beta and acts like its in beta. The sound and video can lag when casting from your pc web browsser tab and can be out of sync at times as well. The other beta option with the extension is to mirror your pc which also lags but doesn't provide sound. So that basically nulls using the extension as a reliable and non annoying work around to the lack of apps.It has huge potential but as of now its not worth even the 35 bucks unless you want to stream netflix and youtube from a device with no other means to do it.", "verified": false, "helpfulness": "4/6", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I was excited to get this but disappointed.It was easy to set up.However, it doesn't work to stream the net from my Android devices. It only works with Netflix, YouTube and Play. There was an app which you could use to stream the internet or local content from Android but this was sabotaged by the latest update to the device.It does work (kind-of) from the Chrome browser on PCs but I found that it didn't work very well, frequently stopped and stuttered (yes, my LAN is reliable for everything else.)My impression is that this is very much a \"beta\" device. Maybe in the future it will be better but not really ready for prime time.", "verified": true, "helpfulness": "0/1", "author": "Mark Spohr"}, {"rating": 5.0, "review": "Works great, but has to be plugged to a power source at all times. Love it! I'll never pay for cable again!", "verified": true, "helpfulness": "0/0", "author": "jeannene saville"}, {"rating": 5.0, "review": "I was astonished when I saw the picture quality. Its easy to set-up, though I needed the included power supply( I guess my LCD Samsung and its HDMI input is older than I thought). The IPad has a Google chrome app which facilitates the setup process and appears in the Netflix app to allow you to stream your content to the TV or keep it on the IPad.. As others have mentioned there is no drain on the IPad battery.", "verified": true, "helpfulness": "0/0", "author": "Troop"}, {"rating": 5.0, "review": "If you spend any significant time using Youtube this is an awesome must have. Its easy to set up and really easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jonathan David Ellis \"Gamer\""}, {"rating": 5.0, "review": "I have found the Google dongle is great for traveling and keeping nieces and nephews occupied.  I also found this is a cheap alternative for my niece who cannot afford Apple TV or Roku.  Easy to set up and use.  As advertised, this dongle does not have the variety of channels that Apple TV or Roku have, but is excellent for Netflix subscribers.", "verified": true, "helpfulness": "0/0", "author": "Good Old Aunt P"}, {"rating": 5.0, "review": "This is a great product.  Set up easily, works with my phone, computer and iPad flawlessly.  Google really knows what they're doing.  I can't wait until they add more native apps to the line up.  Youtube is phenomenal.", "verified": true, "helpfulness": "0/0", "author": "Luke Gustafson"}, {"rating": 1.0, "review": "Products sets up very fast and easy to my network, as soon as you try to use the chromecast app on a youtube or similar video it freezes the TV, loads for 45sec and then plays 10s of the video.. loads for another 45sec and so on. Did not deliver on what it was advertised to do so i'm giving it 1 star and hoping they figure it out next time.I have a degree in networking so it's not my setup or hardware, it just isn't able to receive the amount of data in real time when streaming from the web.", "verified": true, "helpfulness": "24/31", "author": "richard j. gillis"}]