[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Ozzie Cruz"}, {"rating": 2.0, "review": "I don't know if it was my original tv that I had when I first got my Chromecast but it wouldn't stay connected to save it's life, and would constantly lose the device I was using. But only when I would try to cast Netflix and Hulu. Free channels such as Crackle and YouTube would run fine though. Both accts are current for Netflix and Hulu. Now that I've had to purchase a new tv the quality of Chromecast has improved drastically. I'm able to cast all apps that are castable now.", "verified": true, "helpfulness": "0/0", "author": "Samantha"}, {"rating": 1.0, "review": "Doesn't work with my current router (D-Link DIR 628), so I'm unable to use the Chromecast and am currently looking to replace the router.  Amazonz's technical information should have given some indication of this problem.  Do you have any suggestions regarding routers that do work well with Chromecast?", "verified": true, "helpfulness": "1/1", "author": "/bob"}, {"rating": 5.0, "review": "all my tv's have one to stream netflicks, youtube or pandora to.  Even casts chrome screen to your tv.  A must for inexpensive marrying of high definition tv with your internet entertainment needs.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I don't use it as much as I should, but it works pretty well,streaming off of my phone works pretty well.", "verified": true, "helpfulness": "0/0", "author": "William F. Mollencupp"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Julieta \"MN Reader\""}, {"rating": 5.0, "review": "If you dont have one of this, then buy one now. This little dongle makes your tv even better than a smart tv, I use it all the time for netflix and other movies apps, youtube and even browsing, its amazing, works great and its cheap.", "verified": true, "helpfulness": "0/0", "author": "Carlos Aguirre"}, {"rating": 5.0, "review": "Wow. This little dongle works better than anything Microsoft or Apple have ever done. I have an Android phone, and already used Chrome, so full disclosure: I don't know if it plays nice with Windows or Apple products. That said, the setup was easy. Crazy easy. Wi-Fi connection was simple, and the Netflix and Youtube apps work exactly like you would expect, which covers about 80% of the use. If you do have an android phone, you can cast seamlessly from the Google Play Music app, which for me covers the rest of the use. One note: Use the chromecast buttons inside the Youtube/Netflix players. You can cast a Chrome tab, but it's in Beta and pretty disappointingly slow to play video. That said, you should be fine casting just about anything else. So, yes. Best $31 you can spend on any electronic device right now.", "verified": false, "helpfulness": "0/0", "author": "Patrick French"}, {"rating": 5.0, "review": "Its a nifty little device, but have not found much use for it. It comes in handy when wanting to play a movie via Plex.", "verified": true, "helpfulness": "0/0", "author": "M.B"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "YILDIRIM"}]