[{"rating": 5.0, "review": "My family and I really enjoy it, easy to use and convenient! Even if my phone dies the video continues.", "verified": true, "helpfulness": "0/0", "author": "Yes"}, {"rating": 5.0, "review": "I already have game consoles that can use streaming video apps, so that wasn't useful to me. However, Chromecast has proven itself to be the easiest way for me to connect the music I own from Google Music on my phone to my TV and stereo system. Instead of having to fiddle with plugs, buttons and leaving my phone on the stereo, I just use the app and can keep my phone on me.", "verified": false, "helpfulness": "0/0", "author": "M. Bosch"}, {"rating": 5.0, "review": "The chrome cast was easy to set up as well as easy to use.  The streams are very clear and watching videos is very easy.  You can control YouTube and Netflix from your phone or stream  videos from your Internet browser which is awesome.  Support for HBOGo is coming as well as other apps.  For $35 it's a no brainer,  and will only get better over time.", "verified": true, "helpfulness": "0/0", "author": "Mitchell L"}, {"rating": 5.0, "review": "The power of this device has no limit and is the best way to stream on TV, apart from being so cheap.", "verified": true, "helpfulness": "0/0", "author": "Maximiliano Civiello"}, {"rating": 5.0, "review": "Great product fast shipping The show takes place in Los Angeles, California, where Ray Donovan (Liev Schreiber), who is originally from South Boston, is a \"fixer\" for the powerful law firm Goldman & Drexler that represents the rich and famous. Ray experiences his own problems when his father, Mickey Donovan (Jon Voight), is unexpectedly released from prison and FBI agents try to bring down Ray and his associates.", "verified": true, "helpfulness": "0/3", "author": "anthony"}, {"rating": 4.0, "review": "I rate the chromecast device a 4 instead of a 5 only because when I cast to the tv from my pc and then turn  my pc off it stops casting. It should cast with pc off but it dont. However if I disconnect from the internet before I shut the  pc off it keeps castingI find this strange butt have no clue why it would do this. Other than that the chromecast device works great.", "verified": true, "helpfulness": "0/0", "author": "harry"}, {"rating": 5.0, "review": "I've wanted to plan Pandora through my surround sound system forever.  PS3, no Pandora.  XBox, no Pandora.  Chromecast... got Pandora!  I have to play it through a laptop or desktop (for now), but it works brilliantly.  Love the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I travel a lot and carry an Apple TV.  The Chromecast has the same issue as the Apple TV, you can not log into the Hotel internet due to no active browser in the unit.  You can get past this if you have the IP address which is easy with an apple TV but you would have to write down the Chromecast.  Once at the hotel, call the hotels Internet Provider help line and let them you what you have and they will connect it via the IP address.  This was the whole reason to buy the Chromecast as you were supposed to connect via your cell phone and the reviews misled me in thinking I could sign into the hotels network via my phone for the Chromecast.  this simply isnt true.  I hope this helps other business travelers.  the unit is great for the house though and takes up no room and uses a usb from your TV (if you have one) to power it up.  You control it via apps from your phone.  Good but not 5 yet.", "verified": true, "helpfulness": "0/0", "author": "abyars"}, {"rating": 5.0, "review": "Its fast easy and works very well , the streaming quality is good. ability to export all Chrome Browser is what i liked the most.Though Had issues with playing my side loaded songs in Googe Play Music, i am not using chrome cast to listen to songs.Wish they had many other apps except Neflix and Google Play Music / Video.Bought it mainly for Chrome Browser Streaming.", "verified": true, "helpfulness": "0/0", "author": "Foxie"}, {"rating": 4.0, "review": "Even this old lady could do it. However, even my techie daughter can't get my Galaxy tablet to get web content through it. Works great with YouTube.", "verified": true, "helpfulness": "0/0", "author": "Edith M Wollin"}]