[{"rating": 4.0, "review": "Amazing product, very easy to set-up. Four stars because it's limited to viewing YouTube and Netflix only so far. Cannot use with your browser (for iPhone), etc...", "verified": true, "helpfulness": "0/0", "author": "Al Al"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "marcelina"}, {"rating": 5.0, "review": "Super, very good product, the seller fulfills the conditions and product quality", "verified": false, "helpfulness": "0/0", "author": "Gustavo Bautista"}, {"rating": 5.0, "review": "Works great, can't beat the price. Got rid of my cable TV service, kept internet only saved over a $100 in first month even with cost of Chromecast. Using Amazon prime and Netflix and over the air stations by antenna and I will save over a $1000 a year.", "verified": true, "helpfulness": "0/0", "author": "DR \"CEP\""}, {"rating": 3.0, "review": "For the price it can not be beat but it has its limitations.  you can't do things like you can with Apple TV or Ruku.  You need a computer and I don't find it as user friendly as the other two. If you are going off price then pick this one. If you can afford a little extra I recommend getting the Apple TV or Ruku.... or better yet check out Amazon's new one.", "verified": true, "helpfulness": "0/0", "author": "Shopbills"}, {"rating": 5.0, "review": "Easy to install, easy to use. I can now watch my .mp4 files on my large high definition TV using Google chrome.", "verified": true, "helpfulness": "0/0", "author": "Keeley C. Schneider"}, {"rating": 5.0, "review": "I love this simple little device! Aside from the obvious benefits of streaming Netflix, HBO GO, etc., we have been very impressed with the beautiful photographs that the device displays when not streaming. Sometimes, we put on music and just enjoy the pictures! No complaints here! Easy set up, great performance!", "verified": true, "helpfulness": "0/0", "author": "Megan"}, {"rating": 2.0, "review": "Don't know ..no one told me you had to have windows 7 or higher to operate.  I am on a fixed income and can not aford to upgrade my operating system and it will not recognize my Kindle Fire's operating system either.", "verified": true, "helpfulness": "0/0", "author": "Allen M."}, {"rating": 5.0, "review": "We use this all the time.  We got rid of Cable service almost a year ago and haven't looked back.  We love the Chromecast!", "verified": false, "helpfulness": "0/0", "author": "Cami Ludlow"}, {"rating": 5.0, "review": "Great connections for streaming.  A pleasure to use with my iPad. Netflix never looked so good. I wish Amazon would work with Google on this one.", "verified": true, "helpfulness": "0/0", "author": "Pompano Larry"}]