[{"rating": 5.0, "review": "Love the Chromecast. Wish I had one of the phones that can mirror there screen to it, but it's not been that big of a deal. Pair the Chromecast with some all's and you can get all your media on the TV. I use it in combination with a Plex server and it's beautiful. Have some media on my phone, use Allcast or Localcast. I used the WatchESPN app to stream the World Cup live, in HD (my TV cable provider was terrible quality). Use Google Play or Pandora for music. Cast some funny YouTube clips and show family photos from our most recent travels. More apps continue to support Chromecast and updates for Chromecast continue as well. Love this little thing.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "Excelent! Does what it says, turns your TV on a SmarTV.", "verified": true, "helpfulness": "0/0", "author": "Jônatas David Hübner"}, {"rating": 1.0, "review": "Did not like it, very hard to set up unimpressed.", "verified": true, "helpfulness": "0/0", "author": "Matt Engebretson"}, {"rating": 2.0, "review": "This product worked for about 2 weeks. We can't seem to figure out what is wrong now! We've called tech support and they can't even help us. I plan to return this product which is a total shame since we liked it initially and we finally able to stream from our devices. But not anymore. It's not our internet speed either since we even upgraded that as advised by tech. So now we have a higher internet bill and still not streaming.", "verified": true, "helpfulness": "0/0", "author": "Cheryl"}, {"rating": 5.0, "review": "Is awesome, before buying the chromecast I was analyzing the option of buying the Apple TV wich is at a prize of $100 but instead I buy the chromecast just to try it was more cheaper than the Apple but I think is much better than I expected.", "verified": true, "helpfulness": "0/0", "author": "jennifer"}, {"rating": 4.0, "review": "I was originally told that my TV would not work with Cromecast.  This product is great.  I am able to watch programs that I usually miss.  My roommate and I will recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "James J Fazio"}, {"rating": 2.0, "review": "I am actually pretty disappointed with this product. It sometimes has a really significant audio lag when playing Netflix, HBO Go, or Plex. Also, I recently bought a new router (Netgear R6300v2), and the Chromecast is incompatible with it. I've never heard of a device being incompatible with a specific router. I live with 2 roommates and we all have a lot of Wi-Fi devices and they all work fine. Phones, tablets, laptops, desktops, my TV, etc... EVERYTHING works with my new router...except the Chromecast. I guess I'm only out $35, which isn't so bad. The audio lag is bad enough, now it has compatibility issues? No thank you. I'm going to get a Roku or something else.", "verified": true, "helpfulness": "0/0", "author": "Justin Toman"}, {"rating": 5.0, "review": "This is an indispensable product that I use everyday. You cannot beat the price to performance ratio. I have 2.", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 1.0, "review": "Won't play movies stored on my Google Nexus 10 to my Google Chromecast.. Lame!", "verified": false, "helpfulness": "0/1", "author": "John B."}, {"rating": 5.0, "review": "this is a winner of a product from google. love the fact that i can stream directly to my tv.", "verified": true, "helpfulness": "0/0", "author": "K P"}]