[{"rating": 3.0, "review": "the product I was hoping to get would be a lot more savvy; it seems to be really unstable. It does not allow me to get asa many channels as my current set up with the Roku XS; or I haven't quite figured it out yet.I will keep trying to work with it. If no joy after a week, will stick to my Roku!I ordered the an additional Roku, stick, at the same time and that is amazing. The clarity; the stations I love!I will not be discouraged for the price, i was expecting a little more.", "verified": true, "helpfulness": "0/3", "author": "CrossTrainLive \"CrossTraining Live\""}, {"rating": 3.0, "review": "I was excited about the idea of having easy access to amazon prime videos.  However - I don't like having to pay $2.99 just to watch one episode of a tv show. It seemed everything I search for was not free with the prime membership.  The voice search function is great, except it only works with amazon and not Netflix.  The product connected easy and was working great until the next day as there is no power button on the product the sound would not work on my surround sound system, I could hear the chime if I tried to search.  I did check the settings and had it set correctly to push the sound through the HDMI cord. I tried unplugging and turning everything off...and I got frustrated and returned this product.", "verified": true, "helpfulness": "2/7", "author": "Jolene Marsh"}, {"rating": 5.0, "review": "I have been a long term Roku fan and was pretty happy with my Roku 3 until this came along. Great device for myself and my little one with Freetime and games.", "verified": true, "helpfulness": "2/3", "author": "Canuck"}, {"rating": 2.0, "review": "Packaging some of the best I have seen, if not the best.  The voice remote only takes you to Amazon content and cannot be used with others such as Netflix.  No ability to load USTVNOW like with the Roku units.  If you want you world limited to Amazon content this is a great way to go.", "verified": true, "helpfulness": "7/9", "author": "Jeffrey Lindgren"}, {"rating": 1.0, "review": "If you are outside US, please check PRIME content availability at your country BEFORE buying this item.Due to local contracts with other providers (cable, netflix, etc), it DOES NOT work everywhere.i.e. @ARGENTINE it does NOT work. Not one movie or TV episode for Prime membersAlso, no DLNA support, nor LOCAL USB storage.Cloud content it's what makes this work. If you cant access it, LOOK for other product.I hope Amazon reviews its international policy for international buyers and PRIME. Im giving up my prime subscription.And do some firmware update to allow local USB and DLNA.Good luck!. (Traducción al Español disponible)", "verified": false, "helpfulness": "7/36", "author": "Ezequiel Alvarez \"Sports & Tech Fan\""}, {"rating": 5.0, "review": "I'm not a Amazon fanboy here but I got the Fire TV quickly, used my home network and was running, viewing streaming video shows in minutes, no kidding.  The interface performance of the Fire TV actually makes sense and the voice searches work well for me.Good Job AMAZON!PS.  The packaging looks very much like the Samsung SSD drive I installed in a PC sometime back.  I wonder if Samsung is involved in this packaging/hardware?  Nice packaging nonetheless and a great product.", "verified": true, "helpfulness": "2/2", "author": "PrimeVideoWatcher \"LeeBrownUSA\""}, {"rating": 5.0, "review": "It was super easy to install.  There's no 20 page manual of technical stuff.  It really is just the three steps.  The only extra you need is an HDMI cable.  Not only is the installation easy but the home screen and navigation is clean and simple to use.  I got it to optimize my Prime membership as far as streaming goes and couldn't be happier.", "verified": true, "helpfulness": "3/3", "author": "Kim Venatries \"There are few things better than a good story well told!\""}, {"rating": 5.0, "review": "I've been using this for the last few days in place of a Roku player for that I have owned for the last 2 years. I've become accustom to the buffering that happens when you try to watch a movie or TV show using the Roku.  The difference in internet speed is night and day.  Videos load instantly, no buffering.  It also has free games that my kids really enjoy playing.  Another great feature is the Bluetooth remote make it so I don't have point at the little box to change apps or movies I can point anywhere.  Also, no more long searches that require you to slowly type out the movie title with the remote.  The Fire TV remote has a voice search ability and from the many times I have used it over the last few day it is very accurate.  I am very pleased with this device and thinking of buying a couple more for the other TV's in my house that don't have the app capabilities.", "verified": true, "helpfulness": "10/11", "author": "J. Carvell"}, {"rating": 4.0, "review": "I  have just received my FireTV and I am happy with it so far, the choice of channels is good, the interface is excellent and fast and the voice control search is a great improvement on other boxes.The only thing that irritated me when I received the box and hooked it up was the requirement to download a software update immediately. I think the least Amazon could do with a brand new product is supply it with a software package so you can use it straight out of the box.", "verified": true, "helpfulness": "2/2", "author": "Adrian Balls"}, {"rating": 5.0, "review": "I tried google chrome cast last week.  It is in the box ready to be returned.  It just would not stay connected over wifi.  Each day I had to unplug it, then reboot my access point, then plug the chromecast back in.  Of all the devices on the wireless network, three kindles, two iphones, an ipad, a printer, the chromecast was the only one that would not stay connectd.I decided to replace the Chromecast with the fire.  Connected and reamined connected, much more versatile, good picture and sound.  I think it is worth the price.", "verified": true, "helpfulness": "4/6", "author": "J. Barton"}]