[{"rating": 5.0, "review": "Amazing device. I use this more than my roku. Thats probably bc I have android phone", "verified": true, "helpfulness": "0/0", "author": "IluvTofu"}, {"rating": 1.0, "review": "Works fine for 2.4 GHz wireless, but will not work for 5.3 GHz. When I upgraded my router this product became completely useless for me. Make sure you have an older router.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "My last one completely quick after 14 months. Called, Goggle. Warranty was 12 months. Had to buy a new one.", "verified": true, "helpfulness": "0/0", "author": "John C. Balcom"}, {"rating": 5.0, "review": "Love this thing. Makes watching TV another enjoyable experience (especially if you're a cord cutter). Can stream from phone, tablet, laptop, desktop you name it! Traveling to hotels, beach homes, and cabins becomes easier with the kids when you have this little piece of magic.", "verified": true, "helpfulness": "0/0", "author": "Bill Lancaster"}, {"rating": 5.0, "review": "cant say enough!", "verified": true, "helpfulness": "0/0", "author": "Wesley Slaybaugh"}, {"rating": 5.0, "review": "Great player. Don't think replacing it with a cheaper alternative. Not worth", "verified": true, "helpfulness": "0/0", "author": "Manuel Aparicio Guzman"}, {"rating": 5.0, "review": "Best purchase I have made, It's really easy to use and very practical.", "verified": true, "helpfulness": "0/0", "author": "José Carlos González"}, {"rating": 1.0, "review": "This is basically a glorified Netflix and Youtube player. Cant cast from the Chrome browser on my iphone or ipad. Connection is laggy at best. Tried to return the item and i have to pay 12 dollars to return it.  Thats half of what i paid for it. Basically its a 25 dollar paper weight now.  Would not buy!", "verified": true, "helpfulness": "0/0", "author": "Jeremy Puglisi"}, {"rating": 5.0, "review": "Ordered for family members and they love it! Dropped their cable service", "verified": true, "helpfulness": "0/0", "author": "Alice Horrell"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Mariano"}]