[{"rating": 5.0, "review": "Love, love, love it. Not a single complaint", "verified": true, "helpfulness": "0/0", "author": "colleen"}, {"rating": 5.0, "review": "Very pleased. Looking forward to more apps. Super fast compared to running though existing blu-ray. Hard wired to the internet. I am an Amazon prime member and the integration with existing prime benefits is outstanding.", "verified": true, "helpfulness": "0/0", "author": "ATM"}, {"rating": 2.0, "review": "After using the Amazon Fire for a couple of months I am going back and purchase a Roku 3 (I used Roku for several years and do not know why I succumbed to the hype for the Fire).  I do not like the way the Fire lists channels...Netflix especially.  I use Netflix a lot and have to keep hunting and pecking to view the movies there.  Also, the way Amazon lists the available prime member movies...here you must again hunt and peck to find the prime membership free movies. For me it is now worth the $90 to have Roku back!!!  Anyone want a slightly used Amazon Fire????", "verified": true, "helpfulness": "0/1", "author": "Linda McLaughlin"}, {"rating": 5.0, "review": "Does everything plug and play, still playing with the functions and gaming features.", "verified": true, "helpfulness": "0/0", "author": "ericincognito"}, {"rating": 5.0, "review": "works perfectly and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Giuseppe Mazzeo"}, {"rating": 5.0, "review": "After Netflix increased their prices and I cancelled my subscription I didn't think I would get back into watching streaming videos. Back when I had Netflix the streaming was always interrupted and loaded slowly despite my fast internet connection. With Amazon's streaming video service included with Prime, I don't have those annoying lag times that used to discourage me from watching. This new Fire TV is the perfect way to watch all kinds of streaming content on your TV, from the Amazon Prime video collection and apps like YouTube and PBS. I haven't needed to subscribe to Netflix again as I find Amazon's offerings sufficient to keep me entertained. As far as the unit itself, the contstruction and build quality are impressive. I like the minimalist design that isn't garishly cheap looking like some of the other units (Roku). The design fits in with my entertainment system, and the processor is quite adequate with a much better layout and faster navigation than on my PS3. The voice command remote works great and is a convenient smaller size. I am highly satisfied with my Fire TV, and I highly recommend this unit to anybody who enjoys Amazon's Prime movie offerings.", "verified": true, "helpfulness": "0/0", "author": "LanceLink"}, {"rating": 1.0, "review": "hello reaching out.New to all this.can someone please tell me what type of service do you need to have to be able to use the Amazon Fire TV?  I see that you that everyone is saying how easy it is to install but  no one  is talking about the type of  service you need to run it, and once you purchase the box do you need to purchase a different service  to make it run?reaching out", "verified": false, "helpfulness": "1/9", "author": "cookie"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Juan Escobar"}, {"rating": 4.0, "review": "The fire stick works as advertised. Set up was easy, and it was very easy to use.HOWEVER ...When you connect to a network, it must be a open network, or a WPA accessible network. You cannot access it via a web based login, such as you would see at hotels.It worked fine on my home network, but when I came to a resort and plugged it into TV, it works fine except that it could not connect to the resorts network, as it has a web based login, not a WPA based login.So, it is a functionally useless device for most hotels, as it cannot support a web-based login.", "verified": false, "helpfulness": "2/3", "author": "Jeff DeMello"}, {"rating": 5.0, "review": "I will not get into details but this is the best box around, I have an Apple TV, Roku 3 and Chromecast, at the beginnig I was not sure if it was going to do the job, now I have three Fire TV and I'm going to buy another one.  This box is a beast!", "verified": true, "helpfulness": "1/2", "author": "Juan Carlos Ceballos"}]