[{"rating": 1.0, "review": "Chromecast, is a total waste of 40.00 dollars. A total piece of s***! Google should take it out of circulation, and refund all the money back to the buyers.", "verified": false, "helpfulness": "0/1", "author": "Marcellines"}, {"rating": 4.0, "review": "Good streaming, easy setup. Sometimes acts weird - do not know my wireless router or this one.", "verified": true, "helpfulness": "0/0", "author": "G. Holagunda \"GH\""}, {"rating": 5.0, "review": "Love this thing! I named my 'Your Face'. So whenever I cast anything, it displays, \"Now casting to Your Face\". Good times. Once you get one, you'll question how you ever lived without it. I like the photography screensaver. I use it as a nightlight.", "verified": true, "helpfulness": "0/0", "author": "lisa Hale"}, {"rating": 5.0, "review": "Works fine, just as advertised.", "verified": true, "helpfulness": "0/0", "author": "M. Goldstein \"Excelsior731\""}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "So far so good, though occasionally it's disconnected.  It could be a network issue.", "verified": true, "helpfulness": "0/0", "author": "K. Chiu \"kknet\""}, {"rating": 5.0, "review": "Arrived 2 days after I placed the order, I will be enjoying using this!", "verified": true, "helpfulness": "0/0", "author": "pcolburn"}, {"rating": 5.0, "review": "Awesome product. Easy to use. My wife loves it!", "verified": true, "helpfulness": "0/0", "author": "Rachel Lee Otto"}, {"rating": 1.0, "review": "Order when it was on sale and  got $6 bonus to use on google play movies.  That was the good.When I tried to chromecast and stream movies I had problems.  It would break up and stall on most applications.When I went to use on google play movies it crapped out (technical term) there also.I pulled out my hp 14 4meg ram chromebook and played the movie using that and it worked fine.  Same tv, wifi network, etc.I can only assumed this device is underpowered and not really up to the task it was designed for in most cases.Now and then it would cast the chromebook desktop to the tv for awhile, but periodically it would break up and stall there also.I did update the chromecast device for firmware updates.  No help from this action.On top of that the device ran extremely hot to the touch.  I would not want to leave the device running when I wasaway from the tv.Generally, I have always like google stuff, chromebooks, android phones, search, gmail, etc.This item to me was big fail and tarnished google's brand.  If it had cost more I would try and gotmy money back.", "verified": true, "helpfulness": "0/0", "author": "tomg"}, {"rating": 2.0, "review": "Way too much lagging when streaming videos.", "verified": true, "helpfulness": "0/0", "author": "Beatriz"}]