[{"rating": 3.0, "review": "Very disappointed that I can not use it for more applications than youtube and Netflix! Literally a waste of money without more uses.", "verified": true, "helpfulness": "0/1", "author": "Scott Wolff"}, {"rating": 2.0, "review": "While it seems like a great deal you can't stream much and the darn thing was ridiculous to install. Unless you want to watch utube on your big flat screen skip this, my DVR and old Wii have better streaming options. Don't buy if you don't have the latest and greatest computer because my 3 year old computer would not support the requirements.", "verified": true, "helpfulness": "0/0", "author": "Sandra Carlson"}, {"rating": 3.0, "review": "It has a lot of potential, but supported apps are still a little few and far between.  I realize it is intended for web media but I would be nice if it had some software for additional support of local content (the \"tab/desktop cast feature just don't cut it).", "verified": true, "helpfulness": "0/0", "author": "Ano223"}, {"rating": 5.0, "review": "For $35,you can turn your regular HDTV into a smart TV. Compact, upgradeable, no additional cables to buy. This is unbeatable.", "verified": true, "helpfulness": "0/0", "author": "Leonidas"}, {"rating": 5.0, "review": "It is OK for a TV without embedded WiFi support. More streaming support is a mustwaiting for the mirroring support", "verified": true, "helpfulness": "0/0", "author": "Jamil Nour"}, {"rating": 5.0, "review": "This is an awesome product from Google. I can't wait for them to update and upgrade it into something even better! I just wish it had 5 Ghz wireless capability already. Streaming is smooth. I use it primarily for Netflix in my bedroom. You can even go away from whatever you are streaming and do whatever else you want on your laptop, tablet, etc. It's great and very affordable.", "verified": true, "helpfulness": "0/0", "author": "HockeyMike12"}, {"rating": 4.0, "review": "Love this thing.  Can't wait for more apps to be compatible with it, though.  It was REAL easy to set up and got it streaming in minutes.", "verified": true, "helpfulness": "0/0", "author": "J. K."}, {"rating": 4.0, "review": "Works very well as i expected. however i only can used it with my phone and ipad. I find it difficult installing the software on my PC. Arrival time after purchase was great too.", "verified": true, "helpfulness": "0/0", "author": "Chinwe T. Omuna-Amadi"}, {"rating": 5.0, "review": "My son thinks it's GREAT!  He can watch his Netflix,  listen to his music and pretend he's a rock star!", "verified": true, "helpfulness": "0/0", "author": "Karen A Stump"}, {"rating": 5.0, "review": "Very good little TV stick.I like it and it can connect all my devices including my iphone, my laptop and my nexus 10.anyway,it's really a fantastic device.", "verified": true, "helpfulness": "0/0", "author": "MacArthur Sun"}]