[{"rating": 4.0, "review": "I was under the impression that I would be able to veiw more programs.. In order to veiw more you must pay your 99.00 for Fire Tv and also for some programs you must pay a separate price for each episode,or the whole series. So all in all you don't get what you think you are going to get.But what I have seen has been good.", "verified": true, "helpfulness": "1/1", "author": "Jacqueline Celestine"}, {"rating": 4.0, "review": "Only had this for a few weeks now but already thoroughly enjoying it.  I'm watching a few TV series using Prime and Netflix and it is seemless..  Great interface and menu set up.  I'm looking forward to trying out more apps.  I'll probably stay away ftom the games, they won't beat the XBOX.  Good bye Satellite TV you're becoming ancient history.", "verified": true, "helpfulness": "1/1", "author": "Anthony F Sponaugle"}, {"rating": 2.0, "review": "The downfall to the Amazon TV is that xfinity Comcast is not compatible so I can not watch hbo go or Showtime", "verified": true, "helpfulness": "0/1", "author": "nyviana colon"}, {"rating": 5.0, "review": "love this", "verified": true, "helpfulness": "0/1", "author": "Elsa Yang \"elsa\""}, {"rating": 5.0, "review": "It's time for the HBO and expensive cable tv to go. I don't need the anymore. I love my Fire tv and I love all of the free stuff movies and apps. Way to go Amazon and thanks", "verified": true, "helpfulness": "1/1", "author": "Paul Derek Johnson"}, {"rating": 5.0, "review": "Great product.  Would love to cut the cord to the monopolistic telephone cable company.  Great programming with my Amazon Prime account for free.  Would wish this controller could be used for both the Fire TV unit and the Fire TV Stick unit, but I downloaded the Fire TV app to my smartphone, so that works well.  I do wish that there would be a way to put the prime members free option on the top of the choice.  Often you have to go to the submenu past the opportunity to rent or buy.  Makes no sense other than trying to sell products.  Have not tried gaming with it yet.", "verified": true, "helpfulness": "1/1", "author": "WhatAboutBob \"BlueJayWay\""}, {"rating": 5.0, "review": "Meets all expectations and more. Large selection of movies and shows. Love the talk search option. No download wait time.", "verified": true, "helpfulness": "1/1", "author": "rebekah"}, {"rating": 2.0, "review": "The Fire TV started off great but as time went on during the course of a week or so many bugs started to show up.", "verified": true, "helpfulness": "1/2", "author": "Jeff"}, {"rating": 3.0, "review": "No all too impressed with this product. The interface and the options aren't it's strong points.I'm considering switching to Roku.", "verified": true, "helpfulness": "1/2", "author": "Oberyn Martell"}, {"rating": 5.0, "review": "I've had another type of model and Amazon Fire blows it away!!! So happy I bought this device.", "verified": true, "helpfulness": "0/0", "author": "Jane"}]