[{"rating": 5.0, "review": "best thing EVER. I will make it so simple to under stand, since this is how it was told to me. 1: get an interior antenna ( amazon sell them) 2:  get the Fire TV  again amazon sells them ( HAHA)  3 hook it up.. so easy it scared me. 3:  disconnect the cable and enjoy the savings.  call the cable co,  to downgrade to just internet. Dont let them talk you into a high speed, if the fire works, you dont need to spend more. thats it. its so easy..... ENJOY", "verified": false, "helpfulness": "0/0", "author": "L. Becker"}, {"rating": 5.0, "review": "My teenagers love this !! I haven't had much of a chance to use it as they have taken it over!! A winner in our home! Great price, no shipping with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Cheryl"}, {"rating": 4.0, "review": "Good product, setting up is difficult", "verified": false, "helpfulness": "0/2", "author": "Esther Estrada"}, {"rating": 5.0, "review": "My family does not have cable, so we almost exclusively watch TV trough our Fire TV. After two months of owning it, we have not had one problem watching Netflix or Amazon prime shows.", "verified": true, "helpfulness": "1/1", "author": "cmitchell312"}, {"rating": 5.0, "review": "As an amazon prime member how could I not get Fire TV? tons of choices of TV shows, movies, TV series, you name it, chances are it's here. And with Prime, many are free plus I can listen to my amazon music. And it knows what I am saying when I speak. That's huge, my phone can't figure out what I am saying but Fire TV talks my language. Now all I need is for Amazon to get in the satellite radio business and I'll be first in line.", "verified": true, "helpfulness": "0/0", "author": "Barbara Layton"}, {"rating": 4.0, "review": "Easy to operate with good selection of TV and movies.", "verified": true, "helpfulness": "0/0", "author": "DanaPapa \"DanaPapa\""}, {"rating": 4.0, "review": "If you are an Amazon Prime member, you should check out the Amazon fireTV streaming device.Set up is a snap.  When the fireTV arrives, it comes preregistered to your Amazon Prime account.  Plug in the power cord, and connect your HDMI cable and you are ready to go.  The device leads you through the set up with your home network.  Then there is a nice animated tutorial.Soon you will be searching for content.  The voice search is a nice feature.  Just say the name of an actor, or the title of a movie, and the fireTV will deliver your desired content.All of the Amazon Prime Instant video can be viewed free, without commercials.  Also, there is plenty of quality video which can be purchased.Through the fireTV, you can also set up a Netflix and Hulu account.  I have enjoyed all of the great TV programming I've watched through my Hulu account.The biggest drawback for me is the music feature.  The fireTV will connect you to streaming music through Pandora and iHeartRadio.  The  fireTV will connect you to your Amazon Music library but, as of this writing, it will only play music which you own.  It will not play any of your favorite Amazon Music streaming playlists.So, if you are into music more than videos, I'd stick with an Amazon Fire tablet.Since the fireTV did not ship with a printed manual I downloaded a copy onto my laptop.  I found it to be very handy in answering a few FAQ type questions.I've had the fireTV for a few weeks.  It's been fun to use and I am glad I bought it.", "verified": true, "helpfulness": "0/0", "author": "Michael S. Kraus"}, {"rating": 4.0, "review": "the amazon fire tv has worked for me very well. It has problems but not enough for me to care. It feels so good to click a video and it instantly plays.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Excellent. However, does not work with NetFlix, which appears to be a problem with the NetFlix app.", "verified": true, "helpfulness": "0/0", "author": "GlennArms"}, {"rating": 5.0, "review": "Fantastic purchase - with this device and the apps I was able to disconnect cable and it's wonderful.  I'm saving a ton of $$ each month and not missing a thing I was paying so much for in the past.", "verified": true, "helpfulness": "0/0", "author": "Jerry Blackstock"}]