[{"rating": 5.0, "review": "It works wonderfully.", "verified": true, "helpfulness": "0/0", "author": "Rachel"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "david guzman"}, {"rating": 4.0, "review": "I love it. So many options and easy to use", "verified": true, "helpfulness": "1/1", "author": "Bambi Rodriguez"}, {"rating": 5.0, "review": "Got it, connected it, works great!", "verified": true, "helpfulness": "0/0", "author": "Mark Cotton"}, {"rating": 5.0, "review": "Operates fast and smoothly.", "verified": true, "helpfulness": "0/0", "author": "Jmay17"}, {"rating": 5.0, "review": "Since I'm a huge Amazon fan, I love that the Amazon Fire TV opens with Amazon Prime already connected. The image quality is excellent. I wasn't sure about the voice commands, but it is fun. It took me a little while to figure out that the voice commands only search Amazon. However, if you want to open Netflix or Hulu, you can press the microphone button and say the name to open them. I bought this to replace an old Roku and because of the comparison charts that are on Amazon. The Fire TV won the comparison.By the way, set up is incredibly easy!", "verified": true, "helpfulness": "0/0", "author": "Sherry"}, {"rating": 5.0, "review": "Great buy. Loving the prime, netflix and sling. So long cable.", "verified": true, "helpfulness": "0/0", "author": "kegvol \"kegvol\""}, {"rating": 3.0, "review": "Great interface. I don't like that the search only brings up movies and tv shows on Prime & not any of the apps. Also, I've been having problemswith voice search. Sometimes the sound on movies & songs will just stop working & I gave to unplug because there's no power button.", "verified": true, "helpfulness": "0/1", "author": "Trenity"}, {"rating": 5.0, "review": "Excellent player.  I have the Apple Tv 2 also and this operates ao much nicer than that not to mention I can have access to Netflix, Amazon Prime, & Hulu all on the same box.  Home run for mr.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 3.0, "review": "like it but arrow buttons are sensitive.  It took longer than needed to log in to my Netflex, Hulu because I'd push over once and it would jump three or four places. clearity and channel selection good.  I also with the voice worked like roku search and gives you other providers instead of just amazon", "verified": true, "helpfulness": "0/0", "author": "Ashley Jones"}]