[{"rating": 5.0, "review": "It took about 45 minutes and several tries to get it to connect to our home wireless network.  The change I'd made was to take the USB power for the Chromecast from the Television set instead of a wall outlet.  Once set up, it has worked as advertised.  It also has beautiful background photographs if no signal is being sent to it.", "verified": true, "helpfulness": "0/0", "author": "John H."}, {"rating": 5.0, "review": "See above, because the notebook did not perform as expected I didn't have the need to open the packaging and install this item.", "verified": true, "helpfulness": "0/1", "author": "Robert Miller"}, {"rating": 5.0, "review": "i love this product and i can say as a tech savvy person that this product has a lot of potential if google and third party developer work together .", "verified": true, "helpfulness": "0/0", "author": "tokunbo"}, {"rating": 5.0, "review": "We were amazed the this little thing could bring us YouTube and Netflix videos using our smartphone.  It's probably the best $35 we ever spent.  Installation was a little difficult, but the problems were pretty easily solved.  What's even better is that there's a strong possibility that this fantastic little gadget will get even more useful as time goes on.", "verified": true, "helpfulness": "0/0", "author": "Ronald P. Tatus"}, {"rating": 4.0, "review": "the chormecast works great. We have our tablet synced to it and enjoy hours of uninterrupted entertainment using the apps available.We use it with youtube, netflix mostly.It has not worked well with our laptop...(it claims to work extremely well with that...) i wonder what the problem is..all in all i would recommend this to ppl who dont have a smart tv and plan of buying one...get the chromecast...it works well with your phones/tablets.", "verified": true, "helpfulness": "0/0", "author": "RD \"archtist\""}, {"rating": 5.0, "review": "Works great! Lots of fun! Easy to use! Better than watching it on the computer you can watch it on the TV.", "verified": true, "helpfulness": "0/0", "author": "Gina"}, {"rating": 2.0, "review": "Intended on using my laptop to control the unit.  I had trouble trying to \"cast\" Netflix to this device.  Was finally told by Google that laptop connections were still in beta testing.  Returned it to Amazon and bought a Roku box instead.", "verified": true, "helpfulness": "0/0", "author": "Frank A. Terry Jr."}, {"rating": 4.0, "review": "Chromecast works great with compatible websites like Netflix and YouTube (you have to add the Netflix app to your Chrome homepage).  It doesn't work so well when watching video from different websites, such as pbs.org.  The video is jerky and hard to watch.  I tried closing all other open tabs and programs, but nothing really worked to improve the video quality.  Since I mostly use Chromecast to watch Netflix, this isn't often an issue for me.  Netflix is a clear, beautiful video and I like that I can close my laptop while the video keeps playing.  Or, I can multi-task and browse the web while the video plays.  The quality of audio and video is much better than when using an HDMI cord from my laptop to my TV.  Plus, it's not bulky and inconvenient like the cord is.Something else I learned is that sometimes I have my Netflix page \"casted\" to the Chromecast, but the video plays on my computer, not my TV.  I learned that sometimes I have to \"cast\" the video itself to the Chromecast, not just the web page.  (There's an option for \"casting\" on Netflix and YouTube videos).Overall, I'm glad I bought Chromecast.  It makes watching Netflix a pleasure!", "verified": true, "helpfulness": "0/0", "author": "C. Lynne \"booklover\""}, {"rating": 5.0, "review": "Small, straight-forward, simple, and superior. Much easier and better than my boyfriend's $150 wireless receptor. My only notes of complaint are that they haven't developed an Amazon app (to play movies from my Prime account) and that Google hasn't developed tabcasting for tablets yet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It worked as it should. I love it!. The only thing down is something about the netflix app, which have nothing to do with chromecast I think, is that it doesn't play episodes continuously, you have to \"play\" it after you have finished watching one.", "verified": true, "helpfulness": "0/0", "author": "Diego Anzoategui"}]