[{"rating": 1.0, "review": "Doesn't work with Comcast as advertised", "verified": true, "helpfulness": "0/0", "author": "Geo"}, {"rating": 5.0, "review": "I like this small device, easy to install. Working well pair wih my iPad and Windows laptop", "verified": true, "helpfulness": "0/0", "author": "ronni"}, {"rating": 2.0, "review": "Lack of range, drops signal, doesn't always connect. Mostly unimpressed when compared to Kindle Fire Stick, AppleTV or smart app TV's. Don't waste your money.", "verified": true, "helpfulness": "0/0", "author": "conscientious shopper"}, {"rating": 5.0, "review": "Very functional.", "verified": true, "helpfulness": "0/0", "author": "Walter Mesquita"}, {"rating": 2.0, "review": "Roku or Kindle TV are much more useful.  I gave my Chromecast away.", "verified": true, "helpfulness": "0/0", "author": "rfportilla"}, {"rating": 4.0, "review": "I love the Chromecast.  The only issue is that it has to be plugged in, so it's not wire free.  I like a wire free clean look so that's unfortunate but the Chromecast works great and is easy to use.", "verified": true, "helpfulness": "0/0", "author": "Danielle Evans"}, {"rating": 5.0, "review": "Easy set up and works great. My girlfriend loves it so I'm happy (naturally).", "verified": true, "helpfulness": "0/0", "author": "Christopher James"}, {"rating": 5.0, "review": "Have one in every room of the house. I don't know how we ever lived without one.", "verified": true, "helpfulness": "0/0", "author": "SweeneyFamily \"Sweeney Family\""}, {"rating": 5.0, "review": "If you're looking for a way to save money on your TV program bills, here's your answer.  I purchased the Chromcast and installed it on our TV.  We followed the instructions given on the website and then signed up for a free trial of Netflix. Love it!  There is perfect clarity on the TV.  I highly recommend that you buy Chromcast if you have the USB port on your TV.  My first bill from my cable provider will pay for the cost of the Chromcast.  I was able to save about $100.00 per month!  Now I can watch what I want, when I want to and can pause if needed.  Stop wasting money on cable, Directv or Dish TV.", "verified": true, "helpfulness": "0/0", "author": "Georgia Peach \"Joni Eareckson Tada fan\""}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "HOUSAM AL-DEEN AL-HINDI"}]