[{"rating": 5.0, "review": "Absolutely love the Fire TV, it was super easy to set up and it works without any problems. The quality of the streaming is excellent, definitely the best one out there, we also own a Apple TV, but like the Fire TV better. I would advise to go for the Fire TV rather than the Fire Stick, it is just a better deal even if the price is much higher.", "verified": true, "helpfulness": "0/0", "author": "Cirrias"}, {"rating": 4.0, "review": "We bought as an upgrade from our Roku 2 a little over a year ago and as I never really write many reviews when it would be helpful for me to write them, I thought I'd come back to this a year later. Overall, it's a fantastic streaming box. Coupled with Plex Media Server, it does absolutely everything I want it to do and it's been very reliable. We have actually used it for gaming a lot more than I expected to. Our boys can play minecraft pe on it and the phone and tablet at the same time to play together, which is pretty darned cool. And then, after they go to bed, I can play old classics like KOTOR.I'm not sure it's really any better than a Roku 3 if you're down to the choice between them. I really dislike Amazon's advertising of shows and new apps on the home screen when I start it up, but that's always going to be what Amazon does I suppose. Even my damned kindle advertises at me nonstop.", "verified": true, "helpfulness": "0/0", "author": "R. Mattingly \"Slim\""}, {"rating": 5.0, "review": "I love it !!!!! Great features and apps.", "verified": true, "helpfulness": "0/0", "author": "vinetta"}, {"rating": 5.0, "review": "This quickly became my favorite device. Awesome controls, fast response time,  tons of content with prime. Only gripe is the voice search only works with prime content.", "verified": true, "helpfulness": "0/0", "author": "Jay Roberts"}, {"rating": 5.0, "review": "Perfect for an HDTV without built-in internet access. It is compatible with AmazonPrime and the simplistic controller is very easy to use and still totally functional. It would be perfect with a volume control.", "verified": true, "helpfulness": "0/0", "author": "Keith A. Stevens"}, {"rating": 5.0, "review": "I have owned many other video streaming devices but this is the one I enjoy.  It is much faster to respond and is user friendly.  I do use the voice search command when I am viewing anything on amazon and it respond accurately about 98% of the time.", "verified": true, "helpfulness": "0/0", "author": "Joseph B"}, {"rating": 4.0, "review": "I'm a cord-cutter who has largely survived via Chromecast in the past, but I feel like the Fire TV is a great addition to my living room. I still use my Chromecast, but not as often as I use the Fire TV. Here's a quick rundown:HARDWAREEverything feels solidly built. The remote feels good in hand and is not unsubstantial. Buttons are clicky and responsive. The Fire TV itself has a tiny footprint and disappears on the back of my TV.SOFTWAREThe software is well layed out and makes sense. Everything is visible and easily accessible. There is zero learning curve here - no clunky menus to hide important information or difficulty in navigation. The voice-recognition feature seems to recognize words and phrases accurately, but only brings up results for a select few applications. This is not a feature that I use a lot, but I could see where some would find it useful.EXPERIENCEThis, for me, is why I chose the Fire TV over the Fire TV Stick. The Fire TV has really great specs for its intended purpose, and it blazes through everything onscreen with zero lag. Everything is extremely snappy and responsive. This translates to a great TV experience - no annoying hangups or waiting times to pull you out of your entertainment. Most people won't prioritize this in their product search, but in my opinion this is a huge selling point for the Fire TV. All of the processing fades to the background and is unnoticed, leaving a simply enjoyable user experience.GAMINGThe Fire TV won't replace your dedicated console or gaming PC, but it does offer some potential as a casual gaming box, especially for younger kids. My four-year-old enjoys playing games on it immensely. Paired with a gamepad, it's a low cost gaming option for him. This is another area where the Fire TV's specs allow for good potential in the future.All in all, I had concerns going in. But after using it for a few weeks, I feel like the Amazon Fire TV has a place in my living room, for good.", "verified": true, "helpfulness": "1/1", "author": "Lee Traylor"}, {"rating": 2.0, "review": "The Fire is a start to watching online content.  If you just want to watch a few things on Prime or Amazon, you are going to like this product.My unit has two fatal flaws, that drop it three stars.  Both are fixable with a firmware update, but it doesn't appear Amazon is working on the fixes.1) Can not search PRIME only content.  I've been a Prime member since 2005 and buy nearly 100% of my non-perishable items via Amazon.  When I want to find a kids movie, why can I not see ALL rated G movies that are PRIME?2) Once in a while, after voice searching or fast forwarding, I lose sound.  The fix is to unplug the Fire.  This NEVER happens in the same setup with the PS4, so the issue is not with my Yamaha RX-V677 receiver.I will up my rating to 5 stars if they fix both issues.  Hopefully before I move onto another product.", "verified": true, "helpfulness": "2/3", "author": "C. D PAPAS"}, {"rating": 3.0, "review": "Pros: Good product, easy to use, great navigation.Cons:1. Only in high definition, therefore uses tons of data, if you have a service provider that caps your monthly data this will eat through the cap in a little over 3 weeks with normal usage of 2 to 3 hours a day. Resolution was forced into a lower resolution using a certain key input on the remote, however it was found that the device only changes the resolution sent to the tv yet still downloads the highest resolution available.2. Search function only searches within Amazon programming, providing an option to purchase a series or movie that may be available from other sources such as Netflix.", "verified": true, "helpfulness": "0/1", "author": "Aesur"}, {"rating": 4.0, "review": "No need for cable", "verified": true, "helpfulness": "0/0", "author": "ppt"}]