[{"rating": 2.0, "review": "I wanted this device to mirror my laptop to my tv. it works, but it works like tv worked in 1950. the video is herky jerky and the sound doesn't match the action on the screen. I'll probably send it back.", "verified": true, "helpfulness": "1/1", "author": "Stephen L Workman"}, {"rating": 5.0, "review": "Love this device, it is a little slow to start netflix and youtube videos but it isn't unreasonably slow.Can cast my chrome tab through which I can watch amazon prime videos. When casting chrome tabs with my old laptop , the video and audio lags, but no issues when I do it from my new laptop.", "verified": true, "helpfulness": "0/0", "author": "desihorn"}, {"rating": 4.0, "review": "The unit is so small so you can hide it bebing the TV which is a plus.  It is also very easy to install and use.  I wish it could provide better applications so we can run verything from ipad through it on TV without paying the fees.", "verified": true, "helpfulness": "0/0", "author": "QC"}, {"rating": 5.0, "review": "I really like Chromecast. it is very easy to stream Netflix from my iPad and Chrome from my Laptop. I have already purchased 4 of these for friends.", "verified": true, "helpfulness": "0/0", "author": "Ronald S Oates"}, {"rating": 4.0, "review": "product works pretty well, some load time issues especially when casting from certain devices (laptops specifically).  Very fair price, hope to see more apps for this device in the near future", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 1.0, "review": "this product was not compatable to the router that we have and there wasn't information on the site to let me know so I had to send it back.  Since there was no info re: this, I had to go online and research why it wasn't working. Very disappointing.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I didn't choose it or install it.  But it works well and I am working in the world of the present and future.", "verified": true, "helpfulness": "0/1", "author": "Beach woman"}, {"rating": 1.0, "review": "It does not work as well as a direct HDMI via old fashion way of hard wire in that I was unable to play certain programs that I can get TOFW", "verified": true, "helpfulness": "0/0", "author": "Michael Dussault"}, {"rating": 5.0, "review": "Chromecast is awesome! It's so nice to be able use our phone as a remote and use our HBOGO ap to finally watch the shows we love on tv.", "verified": true, "helpfulness": "0/0", "author": "Lindswago"}, {"rating": 1.0, "review": "Chromecast doesn't work if you try to cast the whole screen from your iphone or ipad. It will work only with youtube and Netflix. My TV has the capabiilty to do the same. Waste of Money..", "verified": true, "helpfulness": "0/2", "author": "Balaji Krishnan"}]