[{"rating": 5.0, "review": "I use it daily, mostly for youtube videos but it also works seamlessly with Netflix, Pandora & Hulu. I have used this with a Galaxy S3, Galaxy S4, a dell laptop, Chromebook (Samsung model), a nexus 7 (2013 version) and an iPad. There have been no issues at all with my setup - AT&T; U-Verse internet with an average of 15.5 Mbps downstream. Comparing it to my friend's Apple TV, it definitely is more basic and simple with less features but I believe that makes it even better. He always has a few hiccups in the stream using his apple tv and I've only experienced stalls/interruptions twice.It's not perfect but It's so simple and works great. Definitely worth at at this price. $35 at this time.I have since purchased one for my cousin's tv and she says she uses it daily for streaming netflix cartoons for her kids in the morning.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "I love the Google Chromecast! No more Verizon FIOS TV! Or the hefty cost! I saved $120 a month. I use Hulu Plus, Amazon, YouTube, and Netflix, etc. instead.", "verified": true, "helpfulness": "0/0", "author": "Karen Raymond-Hart"}, {"rating": 5.0, "review": "Does all I need and more, happy with the purchase as it works effortless. Thanks Google for making this little device :-)", "verified": true, "helpfulness": "0/0", "author": "Fabrice Reynaud"}, {"rating": 3.0, "review": "This product is nice but it's not what I expected. it's very limited in the mobile apps it works with. as I live outside the US I am practically limited to YouTube. however, it does works nicely with my laptop based chrome, from which I can cast practically anything that is on the web.", "verified": true, "helpfulness": "0/0", "author": "S. Dotan"}, {"rating": 4.0, "review": "A good innovation that really changed my use of smartphone on a big screen. Every home needs it although couldn't stream my pictures or does it.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 3.0, "review": "Does not work with VPN. If you are outside the United States, you will be able to open only YouTube and chrome browser from the PC", "verified": true, "helpfulness": "0/0", "author": "Ali \"KSA Future\""}, {"rating": 2.0, "review": "This product was promptly delivered, nicely packaged and the setup was a whiz. The provision of a power cord to power the adapter is a good idea as many older HDTVs lack a USB port. But this product falls way short of my expectations. For instance this does not allow one to chrome cast any content on your laptop or iphone/ipad, but only those apps that are supported by chromecast or Chrome browser.  For instance I cannot just play any video or image or music file and expect to have the same broadcast to my big screen TV. In short this is not an application that would let you broadcast any local file from your sources (ipad/iphone/desktop/laptop) unless you figure out a way to have the same opened within Google Chrome(need to download Google cast extension) or is one of the 6-8 supported and/or Google-owned apps like YouTube etc.Bottomline: This is a waste of money as I can pretty much access all of the current supported content using either Roku box, or Wii or PS3 consoles or my TV net options(why pay another $35 to get something that only does what you already have...?)Did not do my research enough and made an impulsive buy as the cost is pretty low, but very disappointed with this joke. I was expecting to see an APP that would let me broadcast any file (live or stored from my source systems to the big screen, but we are not there yet..)  Still toying with the idea of going through the hassle of returning the same or writing off this $35 to Google Inc", "verified": true, "helpfulness": "0/3", "author": "vajra"}, {"rating": 5.0, "review": "As Netflix users, I think this is a must have product. We were previously watching Netflix through our Blu-Ray player and were often frustrated with it freezing up. With Chromecast we can now cast from our phones or tablets. It is convenient and easy to set up. We also cast you tube videos to our tv and can't wait for Amazon Prime to be added to the list! For the price, you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Happy Mom \"Jamie D\""}, {"rating": 5.0, "review": "easy to use and works very very well.  It is a nice way to bring my Netflix to my tv without having to purchase a new dvd player, xbox etc.  Many friends have seen this at my house and have purchased it.  Has allowed me to get rid of cable and not miss it.", "verified": true, "helpfulness": "0/0", "author": "Zenofwater"}, {"rating": 3.0, "review": "It works ok. I sometimes have issues controlling it with my tablet - loses connection when my tablet sleeps. It needs more apps. I was hoping it would work similar to google tv - I have a Logitech revue. The revue works better, even though it is no longer supported by Logitech.", "verified": true, "helpfulness": "0/0", "author": "JamesW"}]