[{"rating": 5.0, "review": "Simple & great", "verified": true, "helpfulness": "0/0", "author": "lior halifa"}, {"rating": 3.0, "review": "It ok, the software is a little quirky and the control by the iPhone crashes pretty much every time it's used. I moved this to a little used tv and installed Roku's everywhere else. Roku works much better in my experience.", "verified": false, "helpfulness": "0/0", "author": "ANDREW WALL"}, {"rating": 5.0, "review": "Just what we needed to wacth Netflix on our tv.", "verified": true, "helpfulness": "0/0", "author": "labrinaj"}, {"rating": 5.0, "review": "This is a great idea.  I had cables, but they're so awkward.  Now, I just turn on the Chromecast and \"cast\" whatever I want to the TV.", "verified": true, "helpfulness": "0/0", "author": "Shari Farrar"}, {"rating": 5.0, "review": "I use several Chromecasts in my home because they are easy to install and a reliable connection. Great price, too!", "verified": true, "helpfulness": "0/0", "author": "S. Mills"}, {"rating": 3.0, "review": "Loved my Chromecast especially when streaming YouTube and Netflix videos. However, hate that there are only very few apps you can you use with it.", "verified": true, "helpfulness": "0/0", "author": "Kristelle Jarabelo"}, {"rating": 3.0, "review": "Fast delivery, works as advertised... Although windows type interface better than android.....", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 4.0, "review": "I really like this product.  Its a bit hard to handle sometimes but I am able to cast Netflix on my TV and watch movies. I used to rent a lot of movies from video on demand and I was spending way too much money. This gadget has saved me a lot of money and the installation was very easy and quick.", "verified": true, "helpfulness": "0/0", "author": "Tiger Lady \"Tiger\""}, {"rating": 1.0, "review": "I cannot get it to work! We're extremely disappointed, especially as we are on a budget (had to cancel $$$$$ cable).We were assured \"no problem\" as this was supposed to take the place of cable.Don't  know what else to do. Just feel so ripped off.", "verified": false, "helpfulness": "0/1", "author": "Tamara Moon-James \"NavajoMoonPie\""}, {"rating": 5.0, "review": "Perfect", "verified": false, "helpfulness": "0/0", "author": "ibrahim alohali"}]