[{"rating": 1.0, "review": "Ease of use great. Able to connect to Netflix...horrible. I bought this after my Roku broke with the idea of getting a Prime membership too. I'm wondering if Amazon doesn't want me to be able to use my Netflix account? I've had it for a week and still no Netflix, and yes I've gone thtogj the steps of trying to fix it. I even talked to Amazon about it. Their answer, \"Oh, were having problems with Netflix. Give it 24 hours.\" Well I have and still nothing. I'm giving them one more week then I'm sending it back it Netflix still doesn't work on it.", "verified": true, "helpfulness": "0/3", "author": "Jessica Andres"}, {"rating": 2.0, "review": "nothing free to watch with student prime", "verified": true, "helpfulness": "0/4", "author": "Jessica Friedman"}, {"rating": 5.0, "review": "Perfect! It is so much more than I hoped. What was unexpected was how many games we have been playing on the Fire. The voice search is very accurate, easy interface. I love it, could not be happier. So much better than Roku.", "verified": true, "helpfulness": "0/0", "author": "LovelyMissKitty"}, {"rating": 4.0, "review": "So far am pleased with the fire tv- I has hoped that I would be able to access the xfinity app (like I can on my kindle).", "verified": true, "helpfulness": "0/0", "author": "Leslie R-"}, {"rating": 5.0, "review": "Works as advertised.", "verified": true, "helpfulness": "1/1", "author": "L. V. Tran"}, {"rating": 2.0, "review": "Worked well for a while but now Netflix has stopped working for over a week and customer support has been completely useless.  They tell me the tech team is working on it and ill be contacted in 2 days, that was five days ago.  I have two rokus in the same house chugging along nicely and wish now i had bought a 3rd over this as i now have no netflix on my main tv.  Since the customer service has not attempted to help i have tried many things on my own such as uninstalls and app data erasing to no avail", "verified": true, "helpfulness": "1/2", "author": "Joe H. \"codplayer\""}, {"rating": 2.0, "review": "Let me start by stating I love Amazon.  That being said, as much as I want to purchase this item, I can't bring myself to do it for the simple reason that it does not play well with others. I have terabytes of digital media that this media player won't play. It's simply isn't enough to have streaming choices, there must be better options for local media. Don't get me wrong Amazon your Cloud is awesome, I just wish you felt the same way about my personal cloud.To be fair, if I didn't have an inordinate amount of personal media, and only wanted streaming, this device is pretty badass. But if I'm going to spend any money on a media player, I simply feel that it should play any and all media, or why would I pay any money for it?Amazon, you got the universal wishlist right, you got prime right, you got the phone wrong, and you only got this half right.", "verified": false, "helpfulness": "1/5", "author": "j0hnnya"}, {"rating": 4.0, "review": "Great box.  Not perfect.  Sound went out a couple of times on all video but Amazon Prime.  Some unplugging and replugging fixed it and it hasn't happened again.  Even so... great little box.", "verified": true, "helpfulness": "1/1", "author": "Mike R"}, {"rating": 5.0, "review": "Love it so far! Easy set up and loads quickly. Excited to be able to access Amazon Prime!", "verified": true, "helpfulness": "1/1", "author": "mholland"}, {"rating": 4.0, "review": "ok", "verified": true, "helpfulness": "1/1", "author": "Jason"}]