[{"rating": 5.0, "review": "I have a media server in my home and do a lot of local streaming.  From the start I have had a lot of Roku devices since they were really the only thing available and capable of doing what I needed.  As time went on these newer devices started to come out.  Until the fire I had not considered switching, I purchased a Fire TV from the Bestbuy in my area because I was to impatient to wait for the two day shipping.  Anyhow I got the device plugged it in and set it up, I noticed right off that it was much faster than all of my roku devices including the Roku 3 that I had gotten not to long before.  It is very responsive and works well with different apps.  I do have an amazon prime account and it works great for streaming content from the web, I use Plex to stream content in the house and the Fire did this much faster than the Roku.  There are no load times at the beginning of the movies like I had with the Roku, among many other aspects.  If I had the money I would get rid of all my Roku devices and replace them with the Amazon Fire TV.  I am not saying this to bash on Roku, they have great products.  But in the end the Fire TV beat all of their products that I had in my home.", "verified": true, "helpfulness": "1/1", "author": "Landin"}, {"rating": 5.0, "review": "Its awesome, My only complaint is the remote is not as responsive as it should be, the one for my firetv stick works much better overall though neither are great. The FireTV itself is great for watching Netflix, WatchESPN, Plex etc....", "verified": true, "helpfulness": "0/0", "author": "Dominic Nanni"}, {"rating": 5.0, "review": "Super bad.", "verified": true, "helpfulness": "0/0", "author": "Curlis M."}, {"rating": 5.0, "review": "Me and my husband love it!! We canceled our charter tv service and got fire tv. So many movies to choose from and lots of shows!!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Amazon Fire TV is excellent not a problem with it or getting what you want to watch.We in Bermuda have a problem only with the prime movie streaming because of location, because it is not possible to use but overall love it.I would recommend this to friends & family.", "verified": true, "helpfulness": "0/0", "author": "Olivette Armstrong"}, {"rating": 5.0, "review": "First, I got one and it didn't work.  Amazon had one to me within 48 hours and made it right.  The new one is phenomenal.  So much that is free and ties into my other accounts.  Thinking seriously about getting rid of my TV service.  Need some real news aps and then it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "RAKJ"}, {"rating": 3.0, "review": "Only works in USA! If I travel with it... can barely do anything... even Netflix seems to have problems", "verified": true, "helpfulness": "0/0", "author": "Juan Diaz Ubilla \"JuanK\""}, {"rating": 5.0, "review": "I love this device its the best searches are so easy with the voice commands option I recommend everyone has this device in their homes", "verified": true, "helpfulness": "0/1", "author": "d.miller"}, {"rating": 5.0, "review": "I love use all the time", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I really like the Amazon Music features and the Voice Search.  However, I have had some issues with connectivity and have had to reboot the system numerous times since I got it.  It is not my wireless streaming, as my Roku works just fine.", "verified": true, "helpfulness": "0/0", "author": "Angie"}]