[{"rating": 5.0, "review": "Wonderful Christmas gift!  Great product.", "verified": true, "helpfulness": "0/0", "author": "Robin Belperain"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Katelyn Dyer"}, {"rating": 5.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "A. R. Hicks"}, {"rating": 5.0, "review": "Best ever for streaming!!", "verified": true, "helpfulness": "0/0", "author": "S. Beber \"JEEPER\""}, {"rating": 5.0, "review": "What an amazing system--so much easier to use than cable or satellite DVRs.", "verified": true, "helpfulness": "0/0", "author": "Chuck Downs"}, {"rating": 5.0, "review": "Best thing ever! The only thing is Plex app does not passes DD or DTS sound through and I don't know if it's Plex fault or Amazon. Hopefully the successor can output the new hevc and 4k.", "verified": true, "helpfulness": "0/0", "author": "Juan M."}, {"rating": 5.0, "review": "Works better than I expected. Great HD. Set up was really easy.", "verified": true, "helpfulness": "0/0", "author": "Thomas R. Tratar"}, {"rating": 4.0, "review": "Goodbye cable and satellite!  This is the best purchase you can possibly make if you are tired of paying $120 a month for what is now 90% of worthless programming and trash (reality TV shows) that you will never watch.  I pay $40 a month for high speed internet and that's it! I do not miss TV commercials at all! I have Netflix, Hulu, Pandora, YOUTube, CBS News, ESPN, and so many other apps.  The voice activation feature is awesome, but it does not work on Netflix, so you still have to type in the search.  I will say that Amazon is misleading about \"1000's\" of free movies.  They are not free unless they were made before 1980.  They charge a fee of $2.99 to $3.99 to rent most movies, even ones that are not remotely new, which I think is ridiculous personally.  Hence my reason for 4 stars instead of 5.  You can watch Game of Thrones and many other HBO/Showtime series beginning with the first season on Amazon TV for about $2.99 an episode, which can really add up.  I am too cheap to pay for that stuff, so I just wait until popular series like Breaking Bad and Dexter come out on Netflix a year or two later and enjoy Netflix original series.  Amazon even charges you per episode for their ORIGINAL series, so don't think it comes with your PRIME membership because it doesn't.  Therefore I do not watch any of them.IMPORTANT TIP:  If you still want to get free local channels like CBS, ABC, NBC, and FOX, you can buy a LEAF on amazon for about $35, which is an HD antenna, and get those channels.  It looks like a laminated piece of 8 x 11 paper and fits into the same outlet you would connect a cable box to.  Sometimes you have to adjust the position of the LEAF (kind of like rabbit ears) to get the channels you want, but they do come in crystal clear if you are in a somewhat urban area.  You do need a TV that is new enough that has an HDMI cable outlet for all of this.  That is what I did, and I could not be more thrilled!  Thank you Amazon.  Also, I believe the Fire USB stick now works for everything except gaming.  That was not available when I purchased it about a year ago, so I have the box.  It is super tiny though, about 4x4\".  The other thing I purchased was a decent sound bar to play Pandora through my TV.", "verified": true, "helpfulness": "1/1", "author": "LaniD"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "Maureen Pulster"}, {"rating": 5.0, "review": "Great device, good apps, spotify sync perfertly with my iphone. I just wish I could play cod on it!", "verified": true, "helpfulness": "0/0", "author": "edgar munoz"}]