[{"rating": 4.0, "review": "Amazing technology for the price... When are they going to add an I-pad app?  Stopping and reversing what you've cast is a bit cumbersome if you're multitasking.", "verified": true, "helpfulness": "0/0", "author": "Al R"}, {"rating": 4.0, "review": "Took me a few to figure it out... (Actually had to watch a youtube video to figure it out)  but I will say it is nice to be able to send videos on youtube from my computer to the TV in the bedroom.  I was very surprised how many shows and movies are on youtube :)  Wish you could play amazon movies on it but have Roku for that :)", "verified": false, "helpfulness": "0/0", "author": "alana"}, {"rating": 4.0, "review": "The Chromecast is great for the simple device it is, streaming the web and streaming video from your device or computer to the television.  The issue is that it will not allow casting through a VPN, reason for 4 stars rather than 5.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 4.0, "review": "Google Chromecast HDMI Streaming Media Player has helped to avoid connecting the laptop to my Smart TV using a HDMI cable, using this I'm able to steam videos directly from internet. As Google adds more app's i hope I'll be able to use it more.", "verified": true, "helpfulness": "0/0", "author": "MKE"}, {"rating": 4.0, "review": "Would of given it 5 stars if more apps were compatible. Overall very pleased it my secondary streaming device .", "verified": true, "helpfulness": "0/0", "author": "Rich S \"Wreckone\""}, {"rating": 5.0, "review": "Easy to setup, price is crazy good ($35) and the format makes it easy to bring everywhere (friends, vacation house, cottage, hotel, etc.)Do not miss this item, best media player out there... It streams any opened Chrome tab on your desktop, laptop or mobile device, not just the \"official\" Chromecaster sites.Trust me, you'll love it.", "verified": true, "helpfulness": "0/0", "author": "HugMart"}, {"rating": 5.0, "review": "Chromecast has made watching movies via Netflex from my iPad very convenient. Makes pandora from my iPhone readily available as well. Highly recommended. Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Gina Platt"}, {"rating": 4.0, "review": "Chromecast needs to make more apps available to utilize this devise. I see a lot of potential in this device, hopefully soon.", "verified": true, "helpfulness": "0/0", "author": "Elvira Watkins \"Hairdresser\""}, {"rating": 5.0, "review": "This thing gets used all the time at my house. My family and I love it. We cast Netflix and Youtube to it. It also works well with other music apps but we don't do as much with that. I recommend this to anyone that doesn't have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Adono"}, {"rating": 4.0, "review": "Update:I have kept my old review at the bottom so you can understand where I am coming from with this update. I thought the Chromecast was pretty good before with my Iphone, but since my last review I switched to an android phone (galaxy s5), and I had no idea what I was missing.  Even some apps that aren't necessarily on the list of chromecast apps work. For example I have the comedy central app to watch their TV shows and it gives me the option to cast it. I can now cast/mirror my phone screen through the chromecast app no problem. On the Iphone I was having issues when navigating my phone while casting youtube or netflix. Some how the connection would be reset and I could not pause or play. On the new phone, I never have these problems.Long story short. I thought the device was pretty good when I had my iPhone. For some reason there seems to be much better support on my new android phone (mirroring the screen is what I really wanted for apps that don't support casting). Now, I am completely happy, but still wondering why chromecast doesn't provide the same quality of service/supported apps for iPhone. So I still give the 4 stars instead of 5.Original Review:They like to advertise the tab browsing and say that you can pretty much mirror your webpage to your TV. This is true, but only from your computer! Google chrome on the phones do nothing with chromecast. So if you are using your phone the ONLY casting you will be doing will be from supported apps. Having said that, the product is much cheaper than the roku/apple tv alternatives, so even for those few apps it is a pretty good buy and works great. However, I feel like they should hurry up and offer a little more.", "verified": true, "helpfulness": "0/0", "author": "Trevor"}]