[{"rating": 2.0, "review": "This dongle has hardcoded DNS addresses, so in case you are overseas, expecting to bypass those annoying IP filters in Netflix, Hulu, youtube, etc...think again!!", "verified": true, "helpfulness": "0/0", "author": "W. S. Flores"}, {"rating": 5.0, "review": "Very nice product. I highly recommend this product if you like to watch media, such as netflix on your computer.", "verified": true, "helpfulness": "0/0", "author": "McHenry Diaz"}, {"rating": 4.0, "review": "I bought two of these.  One of them is setup at home, and the other one was supposed to be setup in a college dorm.  The one at home works just as advertised.However...If you are on a shared network that you have to subscribe to I.E. a free college campus wifi internet, this will NOT work.  I attempted to bridge a connection with my wifi printer that emits is own wifi to make it act as the router and It flagged me on the schools internet.  Anyways, you need your own wifi to get this working.", "verified": true, "helpfulness": "0/0", "author": "Zeke"}, {"rating": 4.0, "review": "Wish you could play games using it but the delay caused by the signal being sent through the router causes that to be an issue.  Watching videos and streams it works very well for though!", "verified": true, "helpfulness": "0/0", "author": "Meri Beth"}, {"rating": 5.0, "review": "So far it's done everything I've asked it to. Have used it from Ipad and Android but the AVIA app on android really is a great addition to the apps. I expect more and more app makers to get on board (HBOgo but no Showtime Anywhere yet). Amazon Videos would be great too.CEC works great on my TV to switch inputs and even turn TV on if it's off.", "verified": true, "helpfulness": "1/1", "author": "LarryR"}, {"rating": 3.0, "review": "Bought this because I am. Bit of a gadget freak.  Does it's job, connecting my phones and iPad to the HD Television.  The limited apps are a bit of a disappointment.  Nothing I can't already get through Apple TV, my PS3, or the TV itself.  Granted, I haven't experimented with Chrome browser via the laptop yet, to see about streaming via web services.  But well worth the price if you don't have any of these devices, but do have a smart phone.", "verified": true, "helpfulness": "1/1", "author": "Dan Lawrence"}, {"rating": 2.0, "review": "So I've been hearing a bit of buzz about the Chromecast and wanted to see for myself.  For some background, I have a variety of PCs, Android (phone and table), iPhone (4s and 5c) and iPads (4 and Air) and two Apple TVs; while I like the features iTunes gives me to share media across devices I myself don't really like the iPhones/iPads (the wife and kids do) so the idea of having something non-Apple for my TV in my office was appealing.Problem #1 - the AC Adapter included was DOA and wouldn't power on the device.  As they are simply AC-to-USB blocks, I found one from an old cell phone and used it to get the device working.Problem #2 - I went through the setup for the Chromecast using one of the iPads, it all seemed easy enough but as soon as the Chromecast restarted it downloaded an update.  Once the update was loaded the iPad could not find the Chromecast on the network.  I had to do a hardware reset on the Chromecast and re-do the setup (which now did not need the update) to get things working.Problem #3 - I called Google support to get the AC Adapter replaced.  Dealing with their support was VERY easy.  They gave you the estimated hold time and then gave the option to have someone call me when they were available.  The call back came within a minute or two of the originally stated estimate.  The support person was very professional and spoke native English.  Unfortunately he informed me the only way they could replace the AC Adapter was to replace the entire device.  So after I did the troubleshooting and still got my device working they want me to send the whole thing back?  I told him I wasn't interested and left feedback that I expected more from Google.As for the device - once you get it working, the quality is very good; though the experience is somewhat lacking in that you can really only \"cast\" from within Chrome on the PC or specific apps that support Chromecast on Android/iOS devices.  I believe there may be some other apps (not supported necessarily) which allow you to do more from the PC.  Given the bad Adapter and the lack of features from the PC (which is how I was planning on using this one most of the time) I will likely return this to Amazon.", "verified": true, "helpfulness": "1/1", "author": "N. S. MUSSER \"ImNorm\""}, {"rating": 5.0, "review": "I got this as soon as it came out. I have bought 3 more for family!! this is as easy as 123, donload the app. sync to you device and it broadcast tv, movies, and awsome music. it does not work on windows RT. everything else its golden....buy this", "verified": true, "helpfulness": "0/1", "author": "phillip smith"}, {"rating": 4.0, "review": "For the price it's a clever and versatile content streaming tool. It was easy to setup and update in a short period period of time.", "verified": true, "helpfulness": "0/0", "author": "Vern Cotman"}, {"rating": 1.0, "review": "I purchased this with high expectations, but it wouldn't even recognize my wifi network, so I returned it. Save your money!", "verified": true, "helpfulness": "1/2", "author": "Ken \"imkennyg2\""}]