[{"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "aaron hochberg"}, {"rating": 1.0, "review": "Need Internet for it to work.Though it was already activated with wifi for the trial period..It only stream videos from u tube. Videos freezes don't play through....frustrating...waste of money!", "verified": true, "helpfulness": "0/1", "author": "SHARON BOSTON"}, {"rating": 3.0, "review": "It is a great solution if you only want to use Netflix or a few other channels but if you also want to play content you already own then you are out of luck because this only works with streaming content. For me this is just a $35 Netflix player.", "verified": true, "helpfulness": "0/1", "author": "Michael"}, {"rating": 5.0, "review": "Holy molly, I can't believe I wasn't using it before! It is such a steal for the price and the functionality it brings.I use it with my Samsung UN60H6350 60-Inch TV, to cast from my Acer C720 Chromebook, but it can work with any other computer that has Google Chrome web browser installed and the Wi-Fi in the house.I use it primarily in these modes:1. For YouTube, to cast right from the video itself. In that case the laptop can be closed and the video will play by itself. And the quality you'll get is awesome. (Well, provided your WiFi and the Internet connection speed doesn't suck :) and, well, if the video was recorded with a high enough resolution.)2. I also cast the whole Chrome browser window. This way you can cast any web site, or an online app/game. For instance, my favorite is to cast soundcloud site, and play it via the stereo system attached to my TV. The quality is awesome!3. You can cast the whole computer screen. I don't use it much, but it's available.4. Oh yeah, if you have a smartphone or a tablet, you can also cast from those as well. I use these less often because I have a laptop handy, which is way more easy to operate. But if you're a smartphone or a table buff, you can use them as well. Apple or Android or whatever else you may have there.So the bottom line, this little device totally annihilated the dinosaurish and clunky Comcast DVR that looks and acts like it was made circa 1995. And best of all, it doesn't come with a $100+ monthly charge!!! In other words, this little device made me a \"cord cutter.\" So good buy Comcast... Good riddance too!!!", "verified": true, "helpfulness": "0/0", "author": "DC"}, {"rating": 5.0, "review": "Great value per money", "verified": true, "helpfulness": "0/0", "author": "Eli Taari"}, {"rating": 3.0, "review": "As of now, youtube is the only useful app that i can use to cast from my phone. Screen casting doesn't work for all phones and in Samsung Note 2, where it works, the experience was not good at all. I also can't understand why the chrome browser casting is not supported in phones (supported only on laptops and tablets)", "verified": true, "helpfulness": "0/0", "author": "Rajavardhan Gundi"}, {"rating": 5.0, "review": "Works as advertised and has a lot of features for the price. We haven't fully explored all the options available but we have used it to stream webpages and videos from a laptop and mobile phone which worked quite well. No complaints so far.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 4.0, "review": "Love casting to my TV this is a great product soo glad I made the purchase.", "verified": true, "helpfulness": "0/0", "author": "Lori Williams"}, {"rating": 5.0, "review": "great, thank you so much", "verified": true, "helpfulness": "0/0", "author": "J. Huaco \"alf\""}, {"rating": 5.0, "review": "Amazon gave me a great deal on this, and it has performed great!", "verified": true, "helpfulness": "0/0", "author": "Gregory S Elston"}]