[{"rating": 4.0, "review": "received with thanks", "verified": true, "helpfulness": "0/0", "author": "RA"}, {"rating": 5.0, "review": "thannk yougoood:)", "verified": true, "helpfulness": "0/0", "author": "Abdulrahman alfaisa"}, {"rating": 5.0, "review": "Yes.", "verified": true, "helpfulness": "0/0", "author": "Musicman132"}, {"rating": 5.0, "review": "This product is a must have if you don't have a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Jose Jimenez"}, {"rating": 4.0, "review": "It's a good item for have what you looking for", "verified": true, "helpfulness": "1/1", "author": "Antonio"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Chris Marsolais"}, {"rating": 5.0, "review": "I'm in love with it.", "verified": true, "helpfulness": "0/0", "author": "Clovis \"Clovis Camilien\""}, {"rating": 5.0, "review": "I was nervous about this product at first. I have always used a screen mirroring device prior. The Chromecast is 10x better. It saves the battery on your device since it isnt being played directly on it. It isn't widely know or marketed that multiple of these devices can EASILY be controlled from 1 device! I purchased 1 and loved it so much that I ordered 2 more. I would also like to get 2 more again. (I have 4 kids) I will never buy another smart TV. This blows my Visio smart TV out of the water!", "verified": true, "helpfulness": "0/0", "author": "Douglas"}, {"rating": 5.0, "review": "Love it!  Use it a lot actually.  I love scrolling pics from my Picasa (sorry...stupid Google+).  The audio/video syn can get a little off when watching videos through Chrome and not the YouTube app.  Also, videos through Chrome are very laggy.  Other than that, it works great.  Spend less money on the packaging and charge customers less!", "verified": true, "helpfulness": "0/0", "author": "stratocaster1422"}, {"rating": 5.0, "review": "This is my 3rd Chromecast for the house.  As a chord cutter I can't recommend a better addition to my viewing experience.I am not an Apple lover.  I have my reasons.  I use Google services and their Android operating system.  This device extends the Android experience to your TV.", "verified": true, "helpfulness": "0/1", "author": "Alexander Churin \"achurin\""}]