[{"rating": 5.0, "review": "Easy to install even for a 53 year old with little knowledge of electronics. Does exactly what it says it does. Just follow directions and enjoy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I enjoy this device i use it nightly. I mostly watch netfix..youtub and hulu. However you can use it more than one way.", "verified": true, "helpfulness": "0/0", "author": "jason jones"}, {"rating": 4.0, "review": "I have set it up and play around with it. Put really have not used it. But when I do I believe it well be worth it. And I will order another one.", "verified": true, "helpfulness": "0/0", "author": "Nathan Harrid"}, {"rating": 2.0, "review": "I had high hopes for the Chromecast, but it ended up being disappointing. The installation was easy, and it's cool that you can \"transmit\" just a video to your tv screen and still be doing something else on that device. However, the quality of the video just wasn't good. It wasn't smooth, and it frequently stopped and started.", "verified": true, "helpfulness": "0/0", "author": "KT1600"}, {"rating": 2.0, "review": "I really wanted to love Chromecast because of the price and the supposed functionality that Google promised with it, but it just fell short.  The only thing that Chromecast is really good for is streaming YouTube and Netflix, and even then it's spotty.  About 30% of the time, playback will freeze and Chromecast will have to be removed from the TV completely to make it work again (this is true on both my smart phone and computer).  I have the fastest internet speed that my ISP provides, so I know that is not the problem.If you're thinking that you will be able to cast video from your computer screen onto your TV with Chromecast, don't hold your breath.  Yes, it does cast, but the video quality is awful and the picture lags behind the sound terribly, rendering this feature frustratingly useless.Besides YouTube and Netflix, I have yet to find any worthwhile supporting apps for Chromecast, which is ultimately Google's fault.  Honestly, I think that they should have worked on perfecting this a little longer before they rushed to release it for the 2013 holiday shopping season.  Hopefully in the near future, Google will improve the functionality of Chromecast so that it actually does all that it says it will.  When/if that happens, I'll be happy to change my review.", "verified": true, "helpfulness": "0/0", "author": "Ashley"}, {"rating": 5.0, "review": "Great product. Tried a friends at their house before realizing I HAD to have one. Just wish it would expand to my amazon prime video account. Couldn't ask for better ease of use, quality of the stream is always top notch.", "verified": true, "helpfulness": "0/0", "author": "Ted"}, {"rating": 5.0, "review": "It gets a 5 frome me.  I saw it on a add on my phone, And I liked how little it was, and sure would be out of the way, if it would just work, So I ordered 1, and it works great, it did such a great job and streams, what I think is everything. I liked it so much that I ordered me one more. I would recommend chromecast to everyone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I cannot get this product to work after hours of trying.  There are other devices that are far less hassle and do the same thing.", "verified": true, "helpfulness": "3/3", "author": "will"}, {"rating": 3.0, "review": "The good is that the integration is great with apps on web (Google  chrome) and Android but where it fails is the rendering web browser on the tv. Whether it is a simple page or a page with images or videos there is so much lag that it renders it useless and since the apps are limited it kind of makes it very limiting.", "verified": true, "helpfulness": "0/0", "author": "Kashyap Shah"}, {"rating": 5.0, "review": "Love it! and my in-laws Love it!I am a pretty big google fan, and overall tech fan. I looked in to this for quite sometime before purchasing it.At first I was hesitant due to having a samsung smart tv and thought it would be pointless. However, you can push your browser on to your tv screen as it is still in BETA, but it still works. Overall for the price, its a must-have for the household.", "verified": true, "helpfulness": "0/0", "author": "PrimeAddiction"}]