[{"rating": 5.0, "review": "Got this for myself since I recently installed a TV in my room. Easy to install and use!! Highly recommend!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Okay, Save your money for now...I have Roku and AppleTV, so what's next, hey lets buy Google Chromecast!WRONG...Concept is there, but that's all...My Favorite is Roku by far, AppleTV a VERY distant 2nd.Anything you can do on Google Chromecast, Roku can do better.What you want to do on AppleTV, you cannot so switch over to HDMI 1 where I have my Roku so I can...Sorry guys, that's my opinion and I have all three of these devices and know by first hand experience what shows and what blows.", "verified": true, "helpfulness": "3/5", "author": "Daniel J"}, {"rating": 5.0, "review": "I saw the commercials for this product on television and did research on their website.  It was very easy to install and configure to my home network and very easy to use with YouTube and Netflix.  I don't have Hulu but I think it would be as easy to connect as it was to the other 2 sites.I still haven't figured out how to cast with Amazon streaming.  I also thought you could cast your personal videos taken on your phone but I haven't figured out how.I bought 2 for my house and 3 as gifts.  If I could get my family using these more to view their favorite shows, I may be able to save money on my cable bill.  I would highly recommend this device to any one who wants better television options than just cable or Dish.", "verified": true, "helpfulness": "0/2", "author": "Victoria Loria"}, {"rating": 3.0, "review": "For the Price of it, the product is ok.It helps to make your TV from Non Smart to Smart TV.Need to improve more on the apps", "verified": true, "helpfulness": "0/2", "author": "Ferryandi Chai"}, {"rating": 5.0, "review": "this is the coolest piece of hardware I've seen to work with an Android phone the picture looks awesome on my 52 inch Sony XBR", "verified": true, "helpfulness": "0/2", "author": "Tracy Johnson"}, {"rating": 4.0, "review": "Very cool to use took longer than hoped to hook up but was worth it, be sure to connect to wifi", "verified": true, "helpfulness": "0/2", "author": "brandon muller"}, {"rating": 1.0, "review": "The item malfunctioned from the beginning. Online trouble shooting was worthless. I plan to immediately return it and get another Apple TV.", "verified": true, "helpfulness": "2/2", "author": "Christopher Gregory \"D. Locke\""}, {"rating": 4.0, "review": "Streams perfectly, almost without a hiccup. It needs mirroring support which Android I'm sure will come around to. needs more apps", "verified": true, "helpfulness": "0/2", "author": "craig kApOWe"}, {"rating": 1.0, "review": "I don't recommend this product at all.  It keeps losing its connection with the WIFI system in the house.  You virtually need to keep \"re-installing\" it from scratch each time.  Very poorly designed and very unreliable.  I would explore anything else but a \"Chromecast\" which fails to \"cast\" anything!", "verified": true, "helpfulness": "2/2", "author": "Jed"}, {"rating": 5.0, "review": "So worth the money. Bought for Christmas. Would recommend buying due to it being so convenient and a neat way to show others your videos, pictures or watch tv from a tablet.", "verified": true, "helpfulness": "0/1", "author": "Kay"}]