[{"rating": 3.0, "review": "You cannot reliably find the Chromecast \"Cast\" icon on the Chrome browser on Nexus 7 in order to cast to your TV.  I've found myself playing youtube videos on the Nexus 7, then wanted to \"Cast\" to my TV through the Chromecast device, but fail to find the \"Cast\" icon on the browser or in the youtube video window.  I've had to reset the device several times and reconfigure it, but I'd think for $35 I'm getting what I paid for.  Would I recommend it to others?  Perhaps! If someone wants a 100% reliable device, then this one is not for them. If they like to tinker and don't mind connecting their laptop to TV via HDMI wire as a last resort, then it is another toy that you might soon forget you ever had.", "verified": true, "helpfulness": "0/0", "author": "Fred"}, {"rating": 3.0, "review": "Due to every app that will play local content costing some kind of subscription fee to use chromcasting, Plex, RealPlayer Cloud and Avia media player.  Going to putt it away to avoid all the charges for stuff that works with no charge on the Roku box. Hopefully in six months the app environment will get less micro charge happy, and I will try again. Had I known how slow toget out of beta and expensive this thing was going to be with subscription fees never would have wasted 35 bucks on it.", "verified": false, "helpfulness": "0/0", "author": "Erik Henderson"}, {"rating": 4.0, "review": "I have been watching Netflix on my TV, ever since getting rid of phone line, I have not been able to watch Netflix on anything but my computer and tablet. I haven't ventured to other sites such as YouTube or any other streaming, but when I venture out of Netflix I am pretty confident that it will be as easy. So far \"Love It\".", "verified": true, "helpfulness": "0/0", "author": "Carolyn Newton"}, {"rating": 4.0, "review": "The Google Chromecast is cool device and a great price point, but you really need an 802.11n network with great signal for it to work well.  Hoping that more apps start supporting Chromecast soon.  Currently have 2 Chromecast devices in place and strongly considering dropping cable TV.", "verified": true, "helpfulness": "0/0", "author": "Casey C."}, {"rating": 4.0, "review": "everything works as advertised. The only issue i have is that it need to be carged. should charge from the television", "verified": true, "helpfulness": "0/0", "author": "John Pauley"}, {"rating": 5.0, "review": "The Chrome cast is a simple, useful device. Perfect for what I needed with my Android phone. And it is so cheap, it was so hard to pass up.", "verified": true, "helpfulness": "0/0", "author": "Taylor"}, {"rating": 4.0, "review": "I bought this knowing i can play my plex library on it but unfortunately there you must be a plex pass user. I didnt purchase a plexpass because im having issues with plex not playing sounds on videos with DTS 5.1 sound. So chromecast will stay on my drawer till then. Or maybe wait for the xbmc to put their app on it.", "verified": true, "helpfulness": "0/0", "author": "iceman600"}, {"rating": 2.0, "review": "I purchased this item as I often have to connect my computer to the tv for streaming and thought this would make it easier. It arrived very quickly but when I went to install it it would not identify my internet. I looked up the help pages and found numerous \"patches\" that are required for a variety of routers. I, however, have an open mesh system and the patch was not present. I sent it to my son who is enjoying it.", "verified": false, "helpfulness": "0/0", "author": "lakris"}, {"rating": 1.0, "review": "I really liked the Chromecast even though it really only works for Netflix and Youtube videos.  I originally plugged the Chromecast into my LG 55\" tv and it worked great.  I went to unplug it and put it in the back of my Denon receiver and when I carefully unplugged it the gold metal tip of the HDMI connector got stuck in the TV.  i.e. the Chromecast came out and the hdmi metal covering was left behind inside the tv.I had to unplug the TV and pull out the metal HDMI cover with a pair of pliers.  After doing so, there was no way to reattach it to the Chromecast.  The Chromecast would boot up but would no longer display anything on the TV.So the HDMI connection was broken from simply unplugging the device one time.Maybe i just got a dud, so i called Google.  Their warranty only covers software/firmware.  I asked if I could send it to a repair facility to have it fixed for $10-15 and was told since it's only a $30 device they don't have a repair facility and it would just be 'cheaper' to buy a new one.... no thanks.Long time Google Fanboy (Galaxy Nexus phone, Nexus 7, Nexus 10, and Chromecast)... maybe I will have to start looking at Apple Products.", "verified": false, "helpfulness": "2/3", "author": "Satchmo"}, {"rating": 4.0, "review": "I've set up many chromecasts and there's a couple of things many overlook. Firstly, it may have connectivity issues with your router. If you have an old router, or your router connections is not rock solid you may have some problems with the casting per se. As in the ad-hoc network. Once the cast url is received it works wonderfully, but you may intermittent connectivity issues.The Chromecast is pretty glitchy still, and apps still prove to be clunky whilst interacting. For example: You do not have the option to keep playing, or even make playlists on the netflix app, the play movies cast is unstable, to say the least and pandora is a nightmare. Youtube, on the other hand is excellent and behaves as all the other apps should.Overall this device still has immense potential, but after six months I'm starting to believe it will stay as it is, and if it does get more apps as it has, I would not expect further support or updates after the initial deployment.", "verified": true, "helpfulness": "0/0", "author": "Nestor Caban"}]