[{"rating": 1.0, "review": "It works great with youtube, netflix and basic web browsing, but not Amazon. Nor is it compatible with the Kindle Fire HD.", "verified": true, "helpfulness": "0/0", "author": "KC"}, {"rating": 5.0, "review": "I purchased this for my boyfriend for Christmas not really knowing what it was, but now we use it all the time. Not only does it let us stream from our computers anything from a Chrome browser, but also things like Netflix, YouTube, and Pandora. For us, the best part about it is the ability to stream Pandora from your phone because the TV's speakers are by far the best in the house. We have used it for background music during family dinners, to pump us up while cleaning, or just to have some music. A pretty awesome little gadget.", "verified": true, "helpfulness": "0/0", "author": "Ashtyn"}, {"rating": 2.0, "review": "This is Chromecast number two for our household, the first one worked every now and again, the second worked great for two days and now it will not connect.  Not going to waste anymore time trying to see if another one works, I'm switching to something else. For $15 extra you can buy a Roku, save yourself the frustration of a faulty product.", "verified": false, "helpfulness": "0/0", "author": "Ronnie Nuanez"}, {"rating": 5.0, "review": "This is a great innovation, very inexpensive and easily installed on my HDMI TV.  Supplements or replaces Netflix! Now we have Movies in the bedroom!", "verified": true, "helpfulness": "0/0", "author": "Assegai \"Avid book worm.\""}, {"rating": 4.0, "review": "I have an older led tv with out apps like Netflix and they wont be made available through updates according to the manufacture. I bought this as a work around since my dvd player does not have apps either and I don't have a game counsel. it lets me stream net flix to the tv so I don't have to watch them on the computer. works just as advertised", "verified": true, "helpfulness": "0/0", "author": "andy"}, {"rating": 4.0, "review": "This thing is Amazing as long as you are using applications that work with chromecast i.e. You Tube or Hulu Plus.  The very first day that I had mine, I was able to chromecast anything - PORN - Web Pages etc. - Anything but the second time I used chromecast from my computer or phone or tablet - I could only view the applications made for chromecast i.e. Hulu Plus so its pretty cool but it could  be better if it worked for everything like PORN", "verified": true, "helpfulness": "0/0", "author": "Travis Linkous"}, {"rating": 5.0, "review": "I'm not a big fan of cable TV. In my opinion, it is overpriced. I invested in this Chromecast for alternative entertainment. It works great! I ordered this on a Thursday and received it on a Tuesday, five days later. I had a few settings I had to alter on my router to get it to connect but overall I am very satisfied with it. It is a great device for alternative television.", "verified": true, "helpfulness": "0/0", "author": "Manda McCormick"}, {"rating": 5.0, "review": "When I first bought the device I was at first spectacle; so I waited 3 months before writing a 5 star review, to basically test the device. So far there aren't any problems with the device, as everyday I use it, it impresses me even more. I surely recommend the Google Chromecast to everyone who is looking for an easier way to watch TV with in the control of their smartphone.", "verified": true, "helpfulness": "0/0", "author": "salah"}, {"rating": 3.0, "review": "You have to make sure that your router is supported. I thought it would mirror my tablet.  It doesn't.  What is does do is grab supported apps and launches them from your device.  The piece then locks on to that app which allows your table to be freed up.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Considering other options out there, this device is not good.  I wanted to upgrade my iPad and decided to go with a Samsung tablet along with replacing AppleTV with Chromecast.  Bad move...I returned both the Samsung tablet and Chromecast within days and bought a new iPad air instead, staying with AppleTV.The issues...With Chromecast, only select apps on your phone can be displayed on your TV...the Chromecast capability is not native to Android like Airplay is native to iOS.  In order to cast stuff from your screen, you have lug out your laptop and add a browser extension to Chrome, which then only allows you to cast stuff from your browser.  What's that you say? You can't cast anything you want from your Android tablet or phone, which is usually sitting right next to you on your couch when you're watching TV?  Unfortunately, that is correct.Unlike iOS and AopleTV, which allows you to extend ANYTHING from your iOS phone or table on your TV...Chromecast only allows you to cast a very limited number of apps and does not allow you to cast anything you want, just the specific apps that are Chromecast enabled which doesn't even include Chrome for Android or iOS (only Chrome for Windows or Mac).If you don't have any Apple products, I guess this is one of your few options.", "verified": true, "helpfulness": "0/0", "author": "D B"}]