[{"rating": 5.0, "review": "We are huge fans of chromecast in our house. The kids enjoy putting youtube on the big screen and my hubby and I play Netflix or any other movie app that we can download onto our smartphones, tablet, or pc. You can completely eliminate cable with this bad boy!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Cool device for displaying on a big screen. Everyone I show this to, says they have to get one.", "verified": true, "helpfulness": "0/0", "author": "JeCr \"green hornet\""}, {"rating": 1.0, "review": "Make sure you have CHROME on any of your devices before you purchase. I purchased it and couldn't download the Chrome App on any of my smart phones. \"Not Compatible\" 😒  waste of money", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 1.0, "review": "Product no longer works, tv no longer recognizes product. Chromecast will not reset either.", "verified": true, "helpfulness": "0/0", "author": "William Babine"}, {"rating": 5.0, "review": "Love it. Ditched cable for this, HBO, and Netflix", "verified": true, "helpfulness": "0/0", "author": "Wade Oler"}, {"rating": 5.0, "review": "A wonderfull invention.Works very well.recommended", "verified": true, "helpfulness": "0/0", "author": "Neville J. Thomas"}, {"rating": 5.0, "review": "This thing is awesome if only my Internet was better to transmit audio. Can't hold that against the chromecast.", "verified": true, "helpfulness": "0/0", "author": "ryan"}, {"rating": 3.0, "review": "no big problems", "verified": true, "helpfulness": "0/0", "author": "Dwight"}, {"rating": 5.0, "review": "Can be glitchy, but the pros outweigh the cons. Love being able to stream anything on my device while also using it for other things. Great for multitasking. Can't wait for Spotify to be integrated.", "verified": true, "helpfulness": "0/0", "author": "Honest Review"}, {"rating": 5.0, "review": "Chromecast is great.  So much value for the price and so convenient to control your media from your phone or laptop.", "verified": true, "helpfulness": "0/0", "author": "Brian Perry Mcnamara"}]