[{"rating": 5.0, "review": "The Chromecast works perfectly when you comcasting the movies in netflix or youtube. It can also comcast the online stream if you have installed a chrome browser in your laptop and also some plug-ins. It's wireless only if your chromecast has connected to the same network as your laptop..it's cheap and awesome!", "verified": true, "helpfulness": "0/0", "author": "leo ma"}, {"rating": 5.0, "review": "The more apps gets available on this the more useful it becomes. But all the apps that I stream it for are now all available and its all I need for my tv.", "verified": true, "helpfulness": "0/0", "author": "Faisal"}, {"rating": 4.0, "review": "There is no doubt in my mind when I say GOOGLE CHROME IS WELL WORTH THE PRICE! If you are looking for a device that has capabilities you cannot find with Roku or other set top style media streaming devices, this is that device. We are able to stream from our chrome browser to our tv with no problems. Occasionally there is a lag, but that is probably more of a isp issue any anything. Along with being able to stream anything from your chrome browser, you can also do just about all the other TV services you'd want, ie. Hulu, Netflix and hbogo. If you're on the fence, it's only $35, skip one dinner out and you've more than paid for it!", "verified": false, "helpfulness": "0/0", "author": "sarahjim"}, {"rating": 5.0, "review": "My father in law got one for Christmas, and after setting his up, I decided to try it. Works great if you use video streaming services a lot and want to watch them on the TV!", "verified": true, "helpfulness": "0/0", "author": "Madison Lage \"Maddie\""}, {"rating": 4.0, "review": "I really like the Google Chromecast for sharing websites on my Television. The video streaming is good for what Chromecast was built upon, do not expect to watch high resolution boxing matches or football games. This replaced my small desktop I had setup as I only shared websites, videos and such stream much better from the built in smart TV apps.Note: AllCast for sharing your phones videos works very well without the need of wires.", "verified": true, "helpfulness": "0/0", "author": "Itfrancisco"}, {"rating": 2.0, "review": "It work slow . I had watched  a movie in my pc well but it shows in TV slower by chromecast .", "verified": true, "helpfulness": "1/2", "author": "Best Bazar \"Best Bazar\""}, {"rating": 5.0, "review": "I am very glad that I decided to buy this item.  It is very easy to use and we are enjoying it.", "verified": true, "helpfulness": "0/0", "author": "xxxxx"}, {"rating": 4.0, "review": "it is good for streaming videos and audios from apps that are in agreement with the google-It doesn't have many of them though, Pandora, Netflix, YouTube and some few others", "verified": true, "helpfulness": "0/0", "author": "Daniel Mutinda"}, {"rating": 5.0, "review": "Works well and easy to set up. More content becoming available all the time. If you are looking for a cheap media player then this could be the one for you.", "verified": true, "helpfulness": "0/0", "author": "Cynthia A. Nunley"}, {"rating": 1.0, "review": "I received one of these as a gift and it works with my boyfriend's phone but it doesn't work with any of my handheld devices although the description says \"Chromecast works with devices you already own, including Android tablets and smartphones, iPhones, iPads, Mac and Windows laptops, and Chromebooks.\"The app for the android phone isn't compatible with my LG Android phone, there isn't an app for my new Nokia Lumia 1020 phone, and of course it doesn't work with my Kindle Fire HD. This thing is completely useless to me since it doesn't work with all 3 of my handheld devices!I just ordered a Fire TV. Thanks for nothing, Google.", "verified": false, "helpfulness": "1/2", "author": "Amie M \"Amie\""}]