[{"rating": 4.0, "review": "It works as described. I just thought I would be using it more. I thought I would be able to us it with the Xfinity Apps.", "verified": true, "helpfulness": "0/0", "author": "Harry&Pam"}, {"rating": 5.0, "review": "Very goo", "verified": true, "helpfulness": "0/0", "author": "Chen Jain Wei"}, {"rating": 2.0, "review": "NOT EASY. LIMITED CONTENT.Chromecast may work well if you have exactly the right configuration of device, TV and internet service and you only want to broadcast a few of the many internet content sites available. The problem is that it is advertised as capable of playing ANYTHING. Not true. Make sure you check out the full requirements before buying at https://support.google.com/chromecast/?hl=en#topic=3447927.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is great. Now I can watch my movies on my Tv that I have downloaded on my tablet. Watch You Tube videos. Pretty cool device.", "verified": true, "helpfulness": "0/0", "author": "Linda Fredian"}, {"rating": 5.0, "review": "what more is there to say about this product?  it is awesome!!  And so cheap!!  It works easily and does everything it says.  after my first purchase, I immediately bought another for my bedroom tv cause I was tired of transferring it back and forth from my living room tv.  Then I ordered another for a friends housewarming gift.  You won't be disappointed with this.  I still cant believe how cheap it is and how convenient it is to use.  I use it to watch Netflix and Hulu the most.", "verified": true, "helpfulness": "0/0", "author": "adam b christianson"}, {"rating": 2.0, "review": "I purchased this expecting it to work well, but it does not work with iphones or ipads. only apple products it works with is  laptops or desktops.", "verified": true, "helpfulness": "1/2", "author": "Chris C."}, {"rating": 4.0, "review": "It makes easy work of adding the internet and netflix and other apps to non-smart tv's. I have a nice 42\" panasonic plasma in my bedroom and its great now that it is \"smart\" However the user interface is not as nice as a smart tv but like I said it does work and its nice to have the net connected to a non smart tv.Its nice not to have second remote but you do sorta have a second remote because you can only control the programming with your phone but the volume and other tv controls have to be controlled with your tv remote.Easy to hook up and set up and I got it for $23 total and shipped fast. All other devices on the market (Roku, Amazon, Apple, etc) are all $80-$100. So although the Chromecast has a few quirks I dont like (the other brands probably do as well) its an amazing value for what you get and it does what its supposed to in that it makes your non smart tv into a smart tv. I would recommend this to anyone!", "verified": true, "helpfulness": "0/0", "author": "MitchH"}, {"rating": 1.0, "review": "You have to have a app to get your netfelx.  Pay another 39.00 for the app", "verified": true, "helpfulness": "0/5", "author": "pAT42"}, {"rating": 5.0, "review": "good produced and it compliments the ROKU is some respects.", "verified": true, "helpfulness": "0/0", "author": "alexander peterson"}, {"rating": 5.0, "review": "Nice and cheap", "verified": true, "helpfulness": "0/0", "author": "S. Reineke \"Rhino\""}]