[{"rating": 5.0, "review": "I love this product. It works very well with my smart T.V", "verified": true, "helpfulness": "0/0", "author": "Neetae"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "A. Wright \"AmpsVoltsWatts\""}, {"rating": 4.0, "review": "Haven't used it much. But what i have seen is quite nice.", "verified": true, "helpfulness": "0/0", "author": "Steve R. Ferrier"}, {"rating": 4.0, "review": "It was easy too install and worked perfect.", "verified": true, "helpfulness": "0/0", "author": "Betty Hyde"}, {"rating": 5.0, "review": "Amazingly, the Chromecast allows you to stream from your smart phone to the TV (if the TV set has a USB slot). I sit there looking stuff up on YouTube and stream the most amazing programs. What fun.", "verified": true, "helpfulness": "0/0", "author": "Hopefully Helpful"}, {"rating": 5.0, "review": "Great product and easy to install", "verified": true, "helpfulness": "0/0", "author": "Gary Yan"}, {"rating": 5.0, "review": "It's just too easy to use.  Fantastic and for the right price.", "verified": true, "helpfulness": "0/0", "author": "L. Scott"}, {"rating": 5.0, "review": "I bought my Chromecast at launch in July 2013, and it's still going strong 2 years later.I mostly use it for Netflix and YouTube. The list of supported apps keeps growing.The genius of this device is its simplicity. Since it's basically a dumb, cheap dongle, it's very flexible. Software developers are adding support for new apps all the time. In addition, you can mirror the screen of some recent Android phones to your TV -- this works very well with my Galaxy Note 4 and Lollipop.", "verified": true, "helpfulness": "0/0", "author": "bevorules77"}, {"rating": 5.0, "review": "Do not use as much as I thought I would.", "verified": true, "helpfulness": "0/0", "author": "Al Moon"}, {"rating": 2.0, "review": "I read good reviews about it, i was able to install app on my laptop and iPad, but i never got this to work.  I looked and read more articles about, i did everything right still wont diplay on TV. I have ATT Uverse, maybe its not strong enough, so after several days of trying i gave up. Likely it wasnt so expensive, good, quick delievery. Because its not working i gave for an idea and easy install only 2 stars.", "verified": true, "helpfulness": "0/0", "author": "Chris"}]