[{"rating": 1.0, "review": "Okay, I guess it does what it's supposed to do. I didn't know until a friend of mine asked me to help setup his new Chromecast...I thought it would be similar to a Roku stick or Fire Stick. Not even close! You have to have some other streaming device to use Chromecast. So, really, all it does is mirror some other device.Second day of use and it freezes on YouTube then states connected without internet. I try my tablet and it's also knocked off the internet. This the first time in over a year and only the second time using Chromecast. I think too coincidental. After resetting the modem and router, I was able to mirror (the only thing Chromecast can actual do) Hulu. I haven't tried YouTube again yet. I have read other reviews that YouTube seems to be a problem with Chromecast.Also, the only browser I found to work is Chrome where you have to add a browser extension anyway.Overall, for the $19.99 paid for this device, it is not worth it!", "verified": false, "helpfulness": "0/2", "author": "Richard La Barca"}, {"rating": 1.0, "review": "Here is what I don't get. In order to watch such things as ESPN, HBO or NETFLIX via chromecast,  you have to have cable and/or be paying for HBO OR NETFLIX to begin with. So what is the point of chromecast? I really am asking. I Received it as a gift and I don't see it how it is useful. With smart TV and DVD players who really needs  chromecast to stream? I have Comcast, so Virtually  everything is available On Demand anyway. You can get a smart DVD player now for $50. You can use that to stream Netflix.I guess chromecast might make sense if you don't have cable, but if you don't  have cable then you cant watch HBO or espn or other such networks anyway, because they ask you to log in to your cable net work provider.All in all. I dont see what it offers that you can't get through a smart tv or DVD player with Wifi.", "verified": false, "helpfulness": "2/3", "author": "History Buff"}, {"rating": 5.0, "review": "Great buy", "verified": true, "helpfulness": "0/0", "author": "Silvia Munoz"}, {"rating": 2.0, "review": "I have 2 of these and I was really disappointed tonight. I use these to stream movies from my Synology DS214 NAS and they have been working ok. Tonight I had a 5hr cable outage so I went to my NAS to stream a movie and I could not do it because Chromecast did not have access to the Internet, they would not allow a connection. To me, this is unexceptable. I looking for replacements.", "verified": true, "helpfulness": "0/1", "author": "Dominick"}, {"rating": 5.0, "review": "It streams great but for some reason Century Link wifi routers don't cooperate with this.", "verified": true, "helpfulness": "0/0", "author": "Monique Becenti"}, {"rating": 2.0, "review": "I love the Chromecast. However, when I bought it, it was advertised as coming with $20 of Google Play credit, which I never received. Everything else worked as advertised.", "verified": true, "helpfulness": "1/1", "author": "Julzg"}, {"rating": 3.0, "review": "A chromecast is not very useful if you own a set top box, smart TV, or HDMI stick...You can only use it to mirror your pc or phone on TV, and even though that's what it is intended for you will realize you will use less than what you originally thought.Quality can be very if streaming video, even on fast network.Set top boxes, or HDMI sticks are better options.", "verified": true, "helpfulness": "0/1", "author": "Rafael"}, {"rating": 1.0, "review": "Garbage.  The software is so poorly written that the set up just locks into an endless loop.Buy a ROKU stick instead - those actually work, easy set up, and they get Amazon video and Netflix.", "verified": false, "helpfulness": "0/1", "author": "Joseph Bisesi \"Joseph Bisesi\""}, {"rating": 3.0, "review": "Very great idea, but could use a bit more processing power. I especially love being able to cast videos from Google chrome browsers as not every content provider will have a dedicated chromecast app. However, sometimes the device just doesn't work and it gives you no indication on where the disconnect is whether it's the website you are casting from, or perhaps a slow wifi connection, or even a problem with the device itself. I think version 2 will definitely be something to look forward to. Also, some kind of menu system would have been nice as I found that Google Chrome browser just doesn't give enough control over the device.", "verified": true, "helpfulness": "0/0", "author": "KL"}, {"rating": 4.0, "review": "Meh. Can't cast device media, can't connect without Internet or at hotels, can't play purchased content from Amazon and iTunes. But then again none of the competition can either.", "verified": true, "helpfulness": "0/0", "author": "Nik Malenovic"}]