[{"rating": 2.0, "review": "Using Apple products now, the Chromecast doesn't work on iOS (iPad & iPhone), presently. I am not sure why when \"casting\" movies the video stops \"casting\" but the computer continues to show the movie.  It works well \"casting\" YouTube videos, but my main need is from my computer, so it didn't meet my expectations, and is a bit harder to use than Apple TV at times, but has more flexibility than Apple TV. It also is smaller and easier to install than Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Bruce L. Crumley"}, {"rating": 5.0, "review": "Love it, I have bought already one for every TV and have an extra one for when I go on trips or to a friends house. Easy to use, great speed and quality of images.", "verified": true, "helpfulness": "0/0", "author": "Gustavo"}, {"rating": 1.0, "review": "I was really excited about this when I first purchased it in December '13. I bought one for myself as well as one for my parents. It was great! Easy to set up and it was really convenient to be able to stream apps like netflix straight from my phone. Streaming from Chrome on my laptop never worked very well. Randomly, my chrome cast just stopped working. Then my parents stopped working as well. We tried manually resetting it as well as waiting for an update. It's been about 3 months now that it hasn't been working and the tech support is useless. It's a great product in theory, if only it kept working!", "verified": true, "helpfulness": "0/0", "author": "mamafry"}, {"rating": 5.0, "review": "I love this.  Turned off regular cable.  Saving a ton of money and the family enjoys it on the big tv", "verified": true, "helpfulness": "0/0", "author": "Brenda Graff"}, {"rating": 5.0, "review": "This was so easy to install and use...even for someone \"not so tech savvy\" like me. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Rae White"}, {"rating": 5.0, "review": "love this product it works great and all the apps I can use it on! I hope google makes more apps for chrome cast!", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "I love being able to stream video to my TV, and it was so simple to use. Plug and play! I mostly use it to play you tube videos on my TV, I originally bought it to use at work to play safety videos in our shop office, but our WiFi signal is not strong enough in the area where I needed it most.", "verified": true, "helpfulness": "0/0", "author": "william wilson"}, {"rating": 5.0, "review": "Saw this advertised and quite frankly didn't expect it to work so easily!  Extremely east set up - basically plug into wall socket and insert in HDMI port in tv.  Easily stream from Netflix, Google Media or YouTube both from lap top or smart phone.  Portable so you can travel with it and have movies on the go!  Liked it so much bought each of our kids one for Christmas and they are all enjoying it!  One daughter even eliminated her cable and watches all her shows using Netflix and Hulu Plus thus saving $$$ on monthly cable fees.  Works great with Pandora radio as well.  One thing we were not sure of when we ordered though is you have to have Internet - won't work off smart phone without wifi in the location.", "verified": true, "helpfulness": "0/0", "author": "C. Williquette"}, {"rating": 4.0, "review": "I am impressed. and this seems to be a good price too, my kids watch Net flicks, but I wish we could watch amazon prime time too.", "verified": true, "helpfulness": "0/0", "author": "Purple star"}, {"rating": 3.0, "review": "Besides its very limited abilities and support, the unit works decently.  When you first set it up, allow yourself some time.  Its going to take a bit for this thing to update and restart a bunch.  Afterwords, any time you are using a phone, tablet, whatever on the network and are on Youtube, Netflix, Amazon Prime, you have the option of just hitting a button at the top of the screen and selecting the chromecast device and you are watching it on your tv.  Pretty simple to set up and use, nothing too hard.  Like I said, the biggest negative point is the lack of support.", "verified": true, "helpfulness": "0/0", "author": "Grayson Gilman"}]