[{"rating": 5.0, "review": "Love it! It's all I expected and the price is very reasonable, also its easy to carry around so I can take it everywhere.", "verified": true, "helpfulness": "0/0", "author": "Natalia Cunningham"}, {"rating": 4.0, "review": "I did not know what to expect, but for only $30 I was willing to gamble with it. I am not the most tech savvy person, but that being said the instructions on how to set this up and use it were easy. I was watching steaming digitaltv within a short period of time.My only reservation is that I would like more streaming options on it. Netflix, and Hulu+ are the primary streaming options, both of which require paid accounts. There are many free legal streaming media outlets that Google could tap into.", "verified": true, "helpfulness": "0/0", "author": "AllTheSh0pping"}, {"rating": 4.0, "review": "We recently discontinued our cable services with comcast as we were tired of the high prices and poor customer service. With google Chrome, we don't even miss it!", "verified": true, "helpfulness": "0/0", "author": "Amanda Arrant"}, {"rating": 5.0, "review": "The Chromecast is very easy to setup and use. I have given to several people who are not technically adept and they have had no problems setting it up and using it.", "verified": true, "helpfulness": "0/0", "author": "Tom Gorton"}, {"rating": 5.0, "review": "There are more apps for your android to make this work great. acutally turning off cable. Makes it easy to stream from internet.", "verified": true, "helpfulness": "0/0", "author": "joel ramirez"}, {"rating": 5.0, "review": "Amazing.I never thought that we could watch youtube into tv, like a tv.Congratulations Google! I want 4 pieces! kkk", "verified": true, "helpfulness": "0/0", "author": "Fábio Neves Cibulski"}, {"rating": 1.0, "review": "Apart from getting very hot connected to the TV you have to download App's from every provider to your device which is tedious. You are better off using your own device and save your money buying the Chromecast.", "verified": true, "helpfulness": "2/3", "author": "PC"}, {"rating": 5.0, "review": "All the other screens in my house could talk to each other... this brought my TV into the 21st century....", "verified": true, "helpfulness": "0/0", "author": "Andrea W"}, {"rating": 5.0, "review": "Yeah, there's better media players out there.  Apple TV is better, Roku is better, building an HTPC is the best, etc...  but all of those are way, WAY more expensive.  For only $35, the Chromecast is exactly what we needed in the world to convert people into cable-cutters!  And with more and more apps supporting it, this is probably one of the best cost:quality ratio items I've ever bought.  Just pick one up and see for yourself!", "verified": true, "helpfulness": "0/0", "author": "K. Marrotte"}, {"rating": 5.0, "review": "This little device is the best one you can get for the price,Google updates, and developers make new compatible apps everyday so it gets better everyday.", "verified": true, "helpfulness": "0/0", "author": "Maite"}]