[{"rating": 4.0, "review": "Minus one star for the need of a Wifi network setup in the house to use it. Does as described and is perfect for those using slightly older laptops/Budget laptops with out HDMI ports.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 5.0, "review": "Couldn't be more happy with my Google Chromecast, it has worked near flawlessly since I received it two months ago. No wires, no hassle, and the easiest of setup's! Looking forward to more apps that are compatible!", "verified": true, "helpfulness": "0/0", "author": "Kristopher"}, {"rating": 5.0, "review": "This was very easy to set up and it was working within 5 minutes of its arrival. Would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Cardoso"}, {"rating": 1.0, "review": "Did not connect, does not pick up signal, would not work on my device, i don't recommend it to anyone, waste of my money", "verified": true, "helpfulness": "1/1", "author": "Samer"}, {"rating": 4.0, "review": "when I first bought this I thought I could remote control the apps already put into the thing with a mobile device, and that I could download more apps if I wished. This is not the case.What it actually does is essentially broadcasts a select few of apps downloaded from a mobile device and/or computer onto the TV.Although, nothing to complain about since it does what I originally thought it would, just in a different manner.", "verified": true, "helpfulness": "0/0", "author": "lafcadio_21"}, {"rating": 5.0, "review": "Watching movies, Netflix and Hulu.  Works great.  Turning the TV off and on fixes any issues.  A little learning curve but just keep read and using it; I was using it the first day and most days since.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I found it useful for my parents, because it is easy to use, but only have netflix and youtube, expect more applications", "verified": true, "helpfulness": "0/0", "author": "Eugenio Segura"}, {"rating": 4.0, "review": "I bought this when it was first released by Google. It is a neat little device that streams high quality video on my 47\" LCD TV. Having to plug it in is a annoying, but I don't have a brand new model TV that supports powering it via HDMI. It's relatively easy to setup, even with an iOS device, and it is recognized by the apps that support it right away. I wish it could handle local media streaming a little bit better, but with Plex capability, that resolves a lot of the issues I had originally.Being able to stream from a Chrome tab is nice as well. I wish Android had the ability to do a screen mirror like the AppleTV does, but Google hasn't built that sort of functionality just yet. Since they opened the API a lot more people are taking advantage of the device, but it's still pretty new yet.", "verified": true, "helpfulness": "0/0", "author": "D. Villella \"gadget geek\""}, {"rating": 5.0, "review": "We love this! You can watch from multi tablets/phones to your TV. We really use ours a lot and got a 2nd one for another TV.", "verified": true, "helpfulness": "0/0", "author": "T. Specht"}, {"rating": 5.0, "review": "we debated on getting a roku box or the chrome cast. deciding that the chrome cast was cheaper we went with it first (thinking it would be easy enough to resell if we did not like it) and ever since we got it we never even thought about getting a roku. Our smart TV has always been dropping connection to the internet etc, but not our chrome cast. Our HDTV has never looked this good streaming!! we love it. It works with all of our devices, macbook,iPad,iPhone. The best controller is via the iPhone though!", "verified": true, "helpfulness": "0/0", "author": "R.C."}]