[{"rating": 5.0, "review": "For the price we paid, this thing is awesome. It drives another stake into subscription cable by making youtube, Chrome browsed sites, and netflix at our fingertips.  Just awesome!", "verified": true, "helpfulness": "0/0", "author": "Andrew Igl"}, {"rating": 4.0, "review": "Love it. Very easy set up and it is great to use.. buuut does not stream amazon prime. Kind of annoying.", "verified": true, "helpfulness": "0/0", "author": "srtreview"}, {"rating": 5.0, "review": "This is a great little gadget!  Easy to set up and so easy to use! And the price is crazy good!", "verified": false, "helpfulness": "0/0", "author": "L. Brown"}, {"rating": 3.0, "review": "It's not brilliant but it is good value for money and does what it says, which is cast to the tele a Chrome tab browser, or from a limited number of apps on Android/iOS devices and with the release of the SDK can only mean more will be coming, making this more useful.Out of the box, there was the Chromecast, a micro USB cable and a plug adaptor to power the device (though I plugged the USB cable straight into the service port on my Mitsubishi tele and works fine) and a HDMI extension.Set up was simple, plugged the device into a HDMI port and set the tele to that input and it has instructions to guide you through, which is connect a wireless device to the Chromecast as it creates a wifi network of it's own. When connected, you can input your home network settings and the Chromecast then connects to the home network and for me, did a update which took a minute to download and a few mins to install before it restarted and was good to go.Installed the chromecast plugin to my browser on my desktop and netbook and they found it instantly, clicking the box icon on the tab you want to cast and away it goes, which for most things I have tried works pretty well.What doesn't work is Amazon Instant. Silverlight just doesn't work and changing the setting to use Flash, for me, I get either when using the inbuilt Chrome pepper Flash a notice saying you need to update it or is using the latest Adobe Flash version getting a message saying that the number of users of the service account has been reached and to disconnect a user first. To get to the settings for your info, type into the address bar: about://plugins and hit the + Details if you want to switch between the Flash versions.Anyway, that not working was expected but it is a shame.As a side note, I got the Portta PET0301S 3x1 HDMI switcher so I could plug this and my Samsung C500 DVD player into another input  as I had run out on my tele and was able to set up my Logitech Harmony 700 remote to work with this really well, but the auto switching also seems to work.One issue I had with this though, it would not feed the Chromecast to the tele unless the DVD player was switched on, which is a little annoying and perhaps maybe needing the external power supply, but it's only a small annoyance and other wise works well and it's certainly a cheap and easy option to get more HDMI inputs if you run out on your tele.", "verified": true, "helpfulness": "0/0", "author": "@A_Random_Bloke"}, {"rating": 1.0, "review": "I don't recommend this device because it only worked for 1 day. I have read that Verizon has issues with it? How would it work only once?", "verified": true, "helpfulness": "0/1", "author": "Jim Millman"}, {"rating": 5.0, "review": "Its a awesome small device.I just love it.....I bought it around $20 so well worth the money ... $25 should be a good bet too", "verified": true, "helpfulness": "0/0", "author": "Bhavikkumar D."}, {"rating": 4.0, "review": "The Chrome Cast is a very cool little piece of technology. Easy to set up and use. Just make sure you have Windows 7.1 or higher, It does not work with Windows XP which I still love.", "verified": true, "helpfulness": "0/0", "author": "T. Mains \"t-shot\""}, {"rating": 1.0, "review": "Buy a roku instead. You need a powerful computer to mirror most content and does not support silverlight / amazon prime properly.If all you want to do is watch youtube videos its fine.", "verified": true, "helpfulness": "0/1", "author": "andrew"}, {"rating": 5.0, "review": "Not too long ago I finally bought a patch cord to hook up my laptop to our TV for watching videos, NetFlix, etc. but it was always a pain to get up to pause it when the phone rang, the doorbell rang, or when nature called. Anyway, using Google Chromecast is a breeze, it works fantastically, and you can control everything from your laptop ... which as the name would have it, is often right in your lap.Buy it - you'll love it.", "verified": true, "helpfulness": "0/0", "author": "JohnT"}, {"rating": 5.0, "review": "I was able to watch am international event that was streaming online right from my television. I'm looking forward to more moments like that.", "verified": true, "helpfulness": "0/0", "author": "Shawn Smith"}]