[{"rating": 5.0, "review": "I brought this for one thing and that was to stream content from my laptop to the TV. It works perfectly... Some review has said it's choppy but its probably more with what they have under the hood of their laptop. I have a 2nd gen core i5 w/ 8gb of ram. Stream from chrome like a champ. The only thing I notice that can't be stream are content that stream with the extension .rmvb the chrome browser can play this if you have the codec but chromecast can't stream this on the tv... Their probably other file extension that chromecast can not stream but with time... I'm sure this wont be a problem.  Chrome browser on the iPad and iPhone doesn't work with chromecast... Hopefully this will change soon. If anybody is having 2nd thought.... Don't!!! For 35 buck... It's a no brainier... And I'm am no android fan or google fan as most of what I own are apple product...", "verified": true, "helpfulness": "2/3", "author": "J. Le"}, {"rating": 5.0, "review": "This device is a must have if you use Android. It works with ios apps also.I own Nexus and few other Android devices. Its really easy to cast youtube video and netflix videos.It really is simple to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "My Chromecast device arrived today.  I had it plugged into my LG i(SmartTV) in minute and TV configured for my WiFi network.  From then on it was downhill.  The required Chromecast app I downloaded per instructions on my TV screen did not work on an old XP laptop.  Well, maybe that was to be expected.  Then, the app would not work on a new Windows 8, Dell laptop either.  I tried about a million settings just to be sure it was not my settings.  The Chromecast app started fine but never completed a necessary search for compatible things to run -- it just searched endlessly.  It is suppose to run from Google Chrome browser, but the extension (add-on) did not show any indication of working within Chrome.  Next, I put the Chromcast app on my iPad, and it worked -- but only with Netflix.  My TV came with Netflix.  I tried to \"throw\" Youtube on the TV, but that application said I needed updates of some sort. In spite of all this, the concept seems solid enough if it worked. It does not, as far as I can tell, with the one exception -- Netflix. If you only have a Smartphone and have no other way to see larger images, maybe this will work for you.  Disappointing that Google didn't or couldn't do better with this. I think 2-stars is generous.", "verified": true, "helpfulness": "3/6", "author": "R. SMITH \"RwS\""}, {"rating": 1.0, "review": "After waiting 6 weeks for delivery I find that it will not stream Amazon Prime videos - they are the people that sold it to me and it is the reason that I bought it - so after that MAJOR disappointment - I was pretty much forced to join Netflix to find something to stream - and then would you believe - the damn thing won't work on my Kindle Fire - I am mystified why they sell this product when it is incompatible with every product of theirs I own that I have tried to use it with - Major disappointment.", "verified": true, "helpfulness": "3/10", "author": "Cotten"}, {"rating": 1.0, "review": "Tried several times to configure the device but was unable to get it to work.Seems like a waste of money", "verified": true, "helpfulness": "3/11", "author": "donaldobi"}, {"rating": 5.0, "review": "I use this all day.  Makes Google play movies and music even better. My roku is collecting dust at this point.", "verified": true, "helpfulness": "0/0", "author": "Dana Foote"}, {"rating": 4.0, "review": "Very easy set up using IPad even before the (useless) chromecast app became avilable.YouTube casting works great.Netflix casting works greatChrome, with extension, casting works from Mac and PCNo extension yet available for Chrome on IPad or Android so no casting from browser for IPad or android phone. I don't know if there is a good technical reason for this continuing omission.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I don't understand why there are so many mixed reviews. People either love it or hate it. Let me make this clear for all those contemplating on whatever to spend the $35 to buy the chromecast or not.This device is a streaming device for your HDTV and currently can only play content that you can normally watch from a web browser. In this case you have to be able to pull up the content on Google Chrome. Oh and I forgot to mention even though you already have a Chrome browser you would still need to download an extension. To do that just simply perform a search from your Chrome browser and search for \"chromecast extension\" and it will pull up the extension you need to download. Download it then you'll have a new icon that looks like a wifi signal at the bottom left corner inside a rectangle. At this point any videos you can watch on Google Chrome you can watch on your HDTV.Before buying ask yourself what you're looking for? Don't buy it because its the newest streamer out on the market. What kinds of content are you looking to play on your HDTV?Again, lets be clear, it won't play your iTunes movies right now but it may in the future. It won't play Hulu, or at least from what I know, which isn't too much since I just got mine via google play yesterday. I did not have to wait 2 or 3 months like it says on amazon. What it can do is play all your videos you watch on Chrome.Lets be honest, its 1/4 of the cost of an Apple TV, do you really think that you can replace the Apple TV? It can play a lot as it is right now because you can find nearly every movie or show on the web these days. For example I have dish network and I have hbo go. I can log into hbo go and watch any movie or series on that app. That is enought for me. It serves mine purpose. However there are a lot of movie you can purchase from google play and stream it to the chromecast hence the name chrome-cast. It can act as a mirror of your computer so if you're on a browser and you want a blown up version then run it in chrome and connect to chromecast.I give it 5 stars because it does everything I want it to do. I wished it played directly from my iTunes collection but I'm not mad that it does YET, which I'm sure it may change in the future. I can say this with all honesty that it well worth the $35 and the wait if your patient enough to wait for it or buy it from google play and you'll get it in a couple weeks. I think mine can within 2 weeks which isn't bad considering. I love how small it is because I can hide it behind my TV be thankfully my TV has a USB port and an hdmi port so the TV powers the chromecast.Just get the darn thing, its only $35 and setup is easy. You can set it up like you did with your Apple TV or your airport express or extreme. You can set it up right from you iPhone, ipad, iOS, or windows.", "verified": false, "helpfulness": "4/6", "author": "daReviewer"}, {"rating": 3.0, "review": "its nice but needs more features. specifically being able to cast pictures from the phone or mirror the phone display.", "verified": true, "helpfulness": "0/0", "author": "Mr. G"}, {"rating": 5.0, "review": "Every week (typically on a Thursday) our local Best Buy gets 35 deliveries of the Chrome Cast. The trick is to get them before they stock them on the floor -- which means calling them to find out if they received a delivery of the item and then visiting sometime between 3 - 9:00 PM.  I snagged six of them when they had them in stock and everyone in the family loves it.", "verified": false, "helpfulness": "0/0", "author": "excitingtechnology"}]