[{"rating": 3.0, "review": "This device is ok.  I imagine it will improve with software updates.I use this to stream videos from a university and to attend virtual conferences like blizzcon.Most of my use has been chromecasting from a browser tab.It needs to be restarted sometimes to clear up problems.  (video is choppy, does not match audio etc).Streaming from windows devices works better than with linux.  Linux devices with plenty of CPU are choppy.  You have to fiddle with firewall rules for it to work with Linux desktops/laptops.  As an admin, i don't understand the network broadcasting rationale.It needs a lot of bandwidth.  I have a low end wireless router.  You'll need fast wireless to push video to the device from a laptop.  In the end, i used wired connections for my devices to push video.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great product. When wifi source is far, delaies in cast shows.Offsinc appears when casting in 1080p and sometimes at 720.", "verified": true, "helpfulness": "0/0", "author": "Nir Tzoreff"}, {"rating": 5.0, "review": "Bought to play Google Music All-Access through my receiver, so it works perfectly for that. Daughter can play Netflix from her iPhone-5 through it, so that's another plus.For $10/month (I got in while it was $8), Google All-access lets me listen to brand-new just-released music, as well as stuff going back decades. I can store the tracks on my device locally, so when my cell phone has no data, or my tablet has no WiFi, I can still listen to anything I want.With the Chromecast, I can then stream that music through my receiver and listen to it as great quality.The ONLY thing this won't do is stream music you have \"sideloaded\" onto your device. It'll only play what it can stream directly from Google's servers. I think this means that you would have to upload your \"owned\" music to Google Music, and then listen to it from there.This is only necessary with groups like Led Zeppelin, who do not seem to be available from Google All Access. Yet. But I did upload my Led Zep to Google Music, and I was able to play it from there, so... no biggee...The ONE thing it won't do well is play music or audio directly from Google Chrome on my laptop. It breaks up like a bad Bluetooth connection, or speeds up and skips.It also won't play 1080p type video directly from my laptop through Chrome, saturating the poor little thing with bandwidth. Not sure if it's the Chromecast, Chrome on the laptop, or my WiFi, but at 300Mbps on Wifi, I can't see that as the reason.Plays Netflix great at 1080p. Go figure.Does OK streaming the Chrome browser to the TV with a bit of lag, but it's nice to display web sites to the TV - or maybe even a projector in a conference room. Be aware that for corporate or other business use, DHCP would have to be available, and whatever you are streaming from would have to be on the same subnet.Can't say enough good about this, for $35, it's cheaper than a Bluetooth adapter for my receiver, and it does SO much more.", "verified": true, "helpfulness": "0/0", "author": "Art K. \"Art K.\""}, {"rating": 3.0, "review": "Going in, I knew this thing was going to be of limited use because of the lack of supporting apps. After thinking about what I use to consume the majority of my content, I realized that mostly it all comes from Netflix, so this dongle replaced a bulky HTPC sitting next to my TV in the bedroom. Sure, the lack of an ability to play local network content is a real bummer, but it does play Netflix and YouTube content really well. Also, app support is slowly trickling in, so it is only going to get better from here. Overall, for the price it is just barely worth it.", "verified": true, "helpfulness": "0/0", "author": "dragonmc77"}, {"rating": 2.0, "review": "Not Ready For Prime Time.  I installed chrome cast on a laptop I keep in my home office.  The wifi router is in the same room. It worked fine with the TV set in my daughters room which is about 20 feet away.  I then moved the Chromecast to another TV set in a downstairs bedroom.  The distance from the Chromecast device to the router is now maybe 35 feet.  I got marginal. Sometimes it would connect and other times it wouldn't.  I had zero results when trying to run it from the laptop downstairs. It did work somewhat from my iPad and my iPhone.  The other problem I had is that there was a lot of re-buffering required which is not usual when I'm running movies from my laptop.  Like I said above it is not ready for prime time yet.", "verified": true, "helpfulness": "0/1", "author": "John"}, {"rating": 2.0, "review": "First, I never received the code for Netflix that I am sure was stated I would receive when ordering.(yes, I see the offer seemed to have expired three days before I ordered, but I am sure it was still listed on the device page.)  Second, with the cord required to power the device, the design is stupid.  Why not make a presentable looking box that can be hidden or displayed on a shelf.  Third, it has issues.  It took three tries to get a Netflix TV show to play on it last week.  It would start and then stop saying it couldn't play on this TV after I had just watched a different show.Waste of money without the Netflix offer.", "verified": true, "helpfulness": "0/1", "author": "Jarred J. Authement"}, {"rating": 4.0, "review": "Limited broadcast distance; should be good for 50 ft; only good for 20 ft.Recommend wireless extender (Actiontec) Actiontec WCB3000N IEEE 802.11n 300 Mbps Wireless Range Extender", "verified": true, "helpfulness": "0/0", "author": "Joel"}, {"rating": 5.0, "review": "This is one of the coolest gadgets ever. I liked the first one so much I just got my second and I'm thinking I might need one for my TV at work too. Please don't tell my boss.", "verified": true, "helpfulness": "0/0", "author": "West TN IT Guy"}, {"rating": 5.0, "review": "All I wanted and expected from this little gizmo was a way to access Netflix on my bedroom TV.  That is exactly what I got!  My only negative comment is that I had to wrap the dongle in electrical tape because the little bright white light emanating from it lit up the bedroom once the lights and TV were turned off.  Simple fix.", "verified": true, "helpfulness": "0/0", "author": "M. Fredendall"}, {"rating": 5.0, "review": "Easy to install (simple plug-in to your TV HDMI USB) and fairly easy set up for untech types like myself. You must download the Google browser for it to work.  Love the choices I have now to stream onto our HD TV.", "verified": true, "helpfulness": "1/1", "author": "R. Keegan \"pyrobug\""}]