[{"rating": 5.0, "review": "I bought this to prevent my PS3 from being on constantly to simply stream video. My wife loves this device and uses it daily and loves how convenient it makes streaming to the TV. You can pick your video on the phone (android) tell it to play to the TV and it will turn on the TV and adjust the input to display the video with one simple click. Our only complaint is with the audio function. It currently defaults to max volume which catches us by surprise almost every time. Hopefully a future software patch will remedy this or make it optional to default to max, another set level, or last set level.The device has been selling itself at my house. Over the holidays 3 family members and friends have left my house to get their own chromecast after seeing how simple and useful it is.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I just got another of these for xmas (and gave some away as presents), I've had my first for half a year now... and the only thing I can say is that it's an incredible value at $35 (and if you got one at $29 even better).Basically there are two modes that it operates in...The first, you use your phone, tablet, computer as a remote control to tell the Chromecast to fetch content directly from the (inter)net...The second, you transmit what you have in a Chrome tab (or full screen) on your device.The first most works exceptionally well (provided you have adequate bandwidth -- which you probably do); the second mode works OK, but that's the mode you're most likely to have issues with (turn the sound down/off on the computer your're Chromecasting from and avoid an annoying \"echo\" from the slight lag).Support for the Chromecast is only going to grow, so unless you're planning on a TV with built in streaming (or got one for xmas), this is great.Oh, and lots of people don't realize you can use this for music too.... works great with Google Play Music.", "verified": true, "helpfulness": "0/0", "author": "Buddy \"Buddy\""}, {"rating": 4.0, "review": "This is super easy to use, and since we watch most of our tv on the internet it is super handy. Now we can easily put it up on the big screen (instead of having the computer linked to the tv by an HDMI cable and having to switch the computer screen to the tv, which was a hassle).My main disappointment is that amazon prime video won't stream to the chromecast so I can't get rid of the HDMI cable just yet... Hopefully it will be compatible soon.", "verified": true, "helpfulness": "0/0", "author": "Natalie Orphan"}, {"rating": 4.0, "review": "For the price, it does what it meant for.I really want google to support all videos from Chrome browser not just the one natively supported.I also hope eventually I will be able to cast any videos from any browser.", "verified": true, "helpfulness": "0/0", "author": "Sasi"}, {"rating": 1.0, "review": "We bought the Chromecast to use on the road and we stay at different Resorts. Most have ATTWiFi service and the routers must have client isolation so the devices can not talk to each other. I can't find away around this and that makes the Chromecast of no value to us. It works fine at home but we don’t need it there. This is very disappointing", "verified": true, "helpfulness": "1/2", "author": "Jerry W. Preston \"BarefootPop\""}, {"rating": 1.0, "review": "I was really excited about, and subsequently disappointed with this product.  For one, it was inexplicably incompatible with the television I'd intended it for - an issue that a cursory Google search would suggest is fairly common. I called tech support and they were unaware of the issue and completely clueless about how to fix it. On the television I could get it to work on, the connection was painfully slow at best - even on sites like Netflix which are supposedly \"cast friendly.\" Hopefully they will figure out a way to improve on the functionality of this product - but for $35, you truly get what you pay for.", "verified": true, "helpfulness": "0/0", "author": "J. Laughlin"}, {"rating": 4.0, "review": "I saw this on amazon last month it was very easy to install. All you need is to plug it in your flat screen television high definition plug. Install the app from Chromecast. Turn your television input to HDMI 1 or 2. Turn your Wi-Fi on your computer on. Watch the set-up screen and let it update. I would give it 5 stars but they need to add more apps for customers can have more choices.", "verified": true, "helpfulness": "0/0", "author": "Cinnamon Brown \"Suger\""}, {"rating": 5.0, "review": "My husband loves his Chromecast to relax after work with a netflix movie.  He uses his phone as a remote!", "verified": true, "helpfulness": "0/0", "author": "Maryann R.  Lombardi"}, {"rating": 1.0, "review": "False advertising, it's not just a dongle. I should have known that HDMI doesn't transfer power.  Basically it still requires a power source from either an ac adaptor or a usb plug into the TV.Having said that, what bothered me most is the fact that it didn't really do what I thought it would.  It really only casted content from a chrome tab.  What I had wanted was the ability to play media files I have in my media library that are pretty big in size, up to GBs.  I didn't realize that it didn't actually have a software player that can pull files in the local area network.  I was able to try two things.  Playing my media file in a chrome tab or doing the Beta full screen cast.  Both of these approaches resulted in laggy and pixelated video playback and just was not the experience I envisioned having from a device produced by a reputable company like Google.  I'm thoroughly disappointed with this purchase but am too busy to actually return it.  In all fairness, I would have been able to save myself the headache if I had read more reviews on this device.  I think what I'm looking for is a Roku because it does do that.  Anyway, I'm hoping someone who is considering this purchase to read my read my review so THEY can save themselves the trouble I went through.  Maybe one day, perhaps the next version of Chromecast, I'll get what I'm looking for.", "verified": true, "helpfulness": "0/1", "author": "Paul I-Lung Lin"}, {"rating": 1.0, "review": "this product will not connect to my DIR-655 routeri have an iphone, android phone, samsung tv, laptop (windows 7), 2 touchpads and a printer connected wireless to the router, but this piece of crap will not connectgoogle needs to stop selling this inferior product", "verified": true, "helpfulness": "1/2", "author": "Unionman76"}]