[{"rating": 1.0, "review": "1. It supports casting from only 2 apps (youtube & netflix) from my iphone2. Tried to cast from my laptop from chrome browser, the chromecast keeps resetting.3. I wonder how google released it in its current state.", "verified": true, "helpfulness": "0/2", "author": "Ravi"}, {"rating": 2.0, "review": "I thought chromecast would be good for travel to watch netflix etc in a hotel room. Nope.Apparently public networks are typically configured to stop two devices from talking to each other (\"AP isolation\", I think).Another reason why I wish that chromecast was really just a receiver for whatever is on my iphone screen (i.e. a wireless hdmi cable for my iphone). Sigh.", "verified": true, "helpfulness": "1/1", "author": "T. Scheifler"}, {"rating": 4.0, "review": "The Chromecast works just as advertised - finds the wireless network and sets itself up just great. The included apps work well but I took a star off simply because there are so few choices of content. The ability to cast from a Chrome tab on a Windows PC is perhaps the most remarkable thing but it isn't available yet from Chrome on my Asus tablet. When the apps finally appear it will be hard to beat!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I suppose it works OK as YouTube and Netflix video player, apart from that it really doesn't do anything. There are no other apps  for this device.", "verified": true, "helpfulness": "1/2", "author": "CallMeSal"}, {"rating": 3.0, "review": "But it's not bad.Once Google opens it up a bit, I'm sure I'll enjoy it more. They are limiting it's functionality presently, which is it's biggest flaw.", "verified": true, "helpfulness": "0/0", "author": "S. Picton"}, {"rating": 4.0, "review": "First of all, I knew going into this that it probably wouldn't work in Canada. But for the price and a little VPN it's a pretty good buy.", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 5.0, "review": "I was able to beam content from my web browser on my PC as well as Netflix from my phone.  The only problem was Wi-Fi reception isn't the greatest, but I just set up an extended network router closer to the TV and I haven't had a problem since.", "verified": true, "helpfulness": "1/1", "author": "Jake Peterson"}, {"rating": 5.0, "review": "To be able to \"cast\" things right to my TV from my phone or tablet for a mere $35 is amazing.  The picture quality in Netflix is fantastic.  I seriously expected \"something\" to be wrong, grainy, etc.  So far, no issues or problems other than it took 3 weeks to get my Chromecast since of the high demand.Easy to use and just have to wait for more apps to take advantage.  I've used it with Google Play, Netflix, and YouTube from my phone and tablet with no issues.For $35, its a bargain.", "verified": true, "helpfulness": "0/0", "author": "Mike \"Super Genius\""}, {"rating": 5.0, "review": "this is a great and affordable device.  great for a cable alternative. easy to use and set up. Thank you!", "verified": true, "helpfulness": "0/0", "author": "A. Donovan"}, {"rating": 5.0, "review": "Sweet baby jesus this thing works like a DREAM. Worth ever penny ..I use it for Netlfix, Youtube, Chrome and even Hulu. The software is still being developed, but as is it, it's awesome.", "verified": true, "helpfulness": "0/0", "author": "Rastacola"}]