[{"rating": 4.0, "review": "I liked this device after my husband made some tweaks to our old vista operating system to get it to function properly. He found that it worked much better on our daughters tablets running the android operating system, but we had some concerns letting them use this openly and without any parental guidelines. We had planned to try Amazon prime for 30 days instead. We may buy another onedown the road!!!!", "verified": true, "helpfulness": "0/0", "author": "Janna Farmer"}, {"rating": 5.0, "review": "Google Chromecast is the best... Enjoy using it to watch online and offline videos... Well worth the price... Kudos Google!!!", "verified": true, "helpfulness": "0/0", "author": "Cloyd"}, {"rating": 1.0, "review": "Hard to install, and not all that valuable once its working.  Yeah, its nice to play YouTube videos on the tv.  But Roku beats Chromecast in every other area.  I USE Roku.  I never use Chromecast.  Sure, I save $15 with Chromecast, but for what?", "verified": true, "helpfulness": "0/1", "author": "leo reilly"}, {"rating": 2.0, "review": "First, you'll need a USB port or power adapter to power the Chromecast HDMI Streaming Media Player in order to use it. I opted for the USB port in the back of a Sony Blu Ray for power, but that causes the Sony to fail with a message that the Chromecast is not valid memory, so I had to go with an AC Adapter and yet another outlet tied up with more wires to the back of the TV. You also need a computer so you can configure the Chromecast then you'll need an HDMI port to plug it into to show on the TV.After getting it setup and configured, I was somewhat disappointed at how slow the Chromecast is. What I mean by this is, iPad using Apple TV and using Chromecast, I can switch to Apple TV for Youtube, quickly starts playing.  Switching to Chromecast I waited a bit longer, sometimes wondering what Chromecast was doing, and found Chromecast not quite the \"gadget\" I was hoping for.I unfortunately I had purchased 4 Chromecasts to give as gifts, now discovering Chromecast's upgrade disabled a preferred app,  so I think it no surprise to find that those gift Chromecasts aren't being used now, as most everyone went back to using their Apples, Xboxes, or Androids.Why release a product then upgrade it so it supports less? Possibly to block competitive apps?Anyway, it seemed like it would be a cool gift, and I'm sure for those that aren't picky about their tech toys, you'll like it.  I will add that it's too bad that Chromecast doesn't currently support Amazon Prime Video, but then again, Google wants you to watch movies from the Play store, not Amazon.", "verified": true, "helpfulness": "0/1", "author": "MissingNoFingers"}, {"rating": 5.0, "review": "I love my chromecast and I'm glad I finally decided to buy one. It works well with any device running a chrome browser. I just wish it had more functionality with my iphone......but I guess that's what I get for having an Iphone.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 4.0, "review": "I put the Chromecast on my list on more of a whim than as something I really wanted.  I ended up getting it as a gift from my in-laws and I am quite please with it so far.Once you plug it into the HDMI port of your TV and then connect the USB cable from the back of the device to a USB port on your TV (or using the power cord to an outlet) your TV should automatically recognize the device.  Then you can use your computer, tablet or other networked device to complete the setup.  I used my tablet, went to the Chromecast setup URL and downloaded the Chromecast app.  Setup was very easy....Since installing it I have used it to cast Youtube videos to my TV, downloaded Plex to cast personal photos and videos from my computer (which you can start on your tablet and then cast to the TV) and used HBO Go on my tablet as well to cast movies (this requires an HBO account with a service provider).  The only reason I haven't given it 4 starts is I don't believe you can use it to browse the web.  I can cast a tab from Chrome on my computer to the TV, but I haven't figured out a way to cast realtime to the TV (this could just be my lack of knowledge though).The good news is they are still creating new apps to work with Chromecast, for example and existing apps like Netflix and other movie providers are also supported....if only it supported Amazon instant video!!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey W. A."}, {"rating": 5.0, "review": "great deal, stream quality is great, would def reccomend, hoping they will add more apps in the near future to make an even better product", "verified": true, "helpfulness": "0/0", "author": "Christopher Holmes"}, {"rating": 5.0, "review": "what a great affordable, portable product, I have one in each room because it's cheap enough for me to be lazy, streams from Kindle, Iphone, laptops, you name it.", "verified": true, "helpfulness": "0/0", "author": "Craig Soubliere Host Of Arm Wrestling Nation Radio"}, {"rating": 5.0, "review": "Very nice , I thought I would have problems hooking it up , Nope !. The instructions were perfert.  I get netfix and tv programs controled right from my tablet. Nice additive toward the man cave . And the grandkids love it, they get more control of there movie chioces and less time to do it. So you can see it's not just for us , old guys , thanks ROCCO", "verified": true, "helpfulness": "0/0", "author": "Rocriz58"}, {"rating": 4.0, "review": "I bought two of these Chromecasts, one as a gift and the other for myself. My dad was able to set this up and configure it with ease. I also had no problem. You plug it in and it walks you through step by step how to set it up. It turns on easily, can be powered by a USB cable and is quite small with good range. So far I am happy. The price is very reasonable too.I wish there were more apps available for it. I typically use my iPad or iPhone around the house and do not want to pull out my laptop to stream content to the screen. It would also be nice to be able to share images directly from my device so I could provide a slideshow on my TV of pictures on my phone for family and friends.", "verified": true, "helpfulness": "1/1", "author": "Peter Kobliska"}]