[{"rating": 5.0, "review": "This replaced a sony. Love it. Gives me plenty of options. I use it for Netflixs as well as Prime. Small and precise. The only thing is I don't see a way to shut down the service except for moving on.", "verified": true, "helpfulness": "0/0", "author": "Kev from Iowa"}, {"rating": 5.0, "review": "Awesome product! Works well with very little setup required.  Not only is the video great, but it seems to me, that the audio stream (over optical input) sounds better than anything else I've connected to my home theater system.  The voice search button works as advertised.  I would recommend this to anyone.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the speed at which the processor can handle its tasks, this is an awesome product!", "verified": true, "helpfulness": "0/0", "author": "Hector Portillo"}, {"rating": 1.0, "review": "No NHL Center Ice package is a deal breaker.  You can get the NHL package on both the Roku and the Apple TV.", "verified": false, "helpfulness": "2/8", "author": "Scott"}, {"rating": 5.0, "review": "Love love love ease of use. Entertainment hub layout. Email notifications of shows I may like.", "verified": true, "helpfulness": "0/0", "author": "R. Roberts"}, {"rating": 5.0, "review": "user friendly.  Voice activated search option is wonderful.", "verified": true, "helpfulness": "0/0", "author": "Sherry"}, {"rating": 5.0, "review": "Faster than roku easier to use nicer remote.  Great system like the option for game remote for apps!", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 4.0, "review": "Super small.  Decent amount of free programming.  I owned it for about three months.  I've had to reset it three times.  The remote had to be reset once.  I wish there was a software reboot option in lieu of getting up to unplug it.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "Easy hookup, I was able to do it myself. However, the jury is still out on the Amazon Prime program itself. I tried to get a couple of movies that have been out for over a year and the only option I had was to buy the DVDs.", "verified": true, "helpfulness": "0/0", "author": "Linda Giordano"}, {"rating": 3.0, "review": "The overall unit is slick and easy to setup. There are a couple things I wish would be improved. #1 Netflix App needs an update!!! Please Amazon, if you change this I feel more people would buy the unit to replace other streamers. I use both Amazon Prime and Netflix, but find myself going to other devices for Netflix as the experience is better. I don't think you want this, if people start to favour another device then they will not be using Fire Tv as much, and therefore you have less potential to sell them on Prime or Instant Video purchases.Don't be afraid of the competition, update this and add the IOS support for controlling you promised. This would make Fire Tv the ultimate Streamer, with the best Online content from Amazon and Netflix, its the Best of both Worlds on one device!The other improvement I'd like to see is more customizable menu options. In a new Firmware , you should add the ability to change the Home screen. For example Show only Prime Instant video thats free with Prime subscription! I am already paying for Netflix monthly and Prime yearly, so I am sorry Amazon but I am not going to purchase additional Movies. I will watch either service or use my Plex app!I see so much potential with this unit, I just hope it gets a few more improvements before it ends up in a Fire Sale, like your Fire Phone  ;) .", "verified": true, "helpfulness": "2/2", "author": "Scott McDonnell"}]