[{"rating": 5.0, "review": "I have officially canceled my cable tv after trying this out for a few months.  The chromecast does a great job streaming from the computer to the tv.  I am now $80 richer every month since I have purchased this.", "verified": true, "helpfulness": "1/1", "author": "Meghan Hubcap"}, {"rating": 4.0, "review": "Wonderful!!!, need I say more?", "verified": true, "helpfulness": "0/0", "author": "Jess McMaster"}, {"rating": 5.0, "review": "I recently got a Chromecast for Christmas (2013). I hooked it up to an older Panasonic Plasma in the bedroom that didn't have the smart TV apps. I immediately fell in love. This tiny little gadget breathed new life into my old TV.But it wasn't until I started using Plex media server, that it really started to shine. Chromecast + Plex Media server will out preform any smart TV on the marked. I loved it so much I bought a 2nd Chromecast for my new LG TV that even had all of the smart TV stuff.The other Chromecast apps are nice too (Netflix, HBO Go), as well as just tab casting. I've never experienced any of the lag that some other reviews mention.", "verified": true, "helpfulness": "1/1", "author": "Dave"}, {"rating": 5.0, "review": "Before buying a Playstation 4, I had read that they were doing away with DLNA streaming so I needed to find something to replace that functionality. When I heard that chromecast supported Plex media server, I ordered one of these with my PS4. It's not as convenient as having the functionality of a game console with dlna functionality built in, but it works great. I can control it from my phone, tablet, or pc, and I've never had any problems with it. I've used it with youtube, plex, and pandora and have had no issues whatsoever, and the price is amazing for what you get. (I understand that chromecast does not support dlna streaming, but the fact that plex apps work with it provides me with the functionality I need)ALSO: Here is a HUGE question I think a lot of people have with this device that don't own it.Before I bought this, I went to worst purchase and asked a computer sales associate, if I casted a movie on netflix from my phone or tablet, would I be able to hit the home button on said phone or tablet and run other apps  while the movie was playing on my tv, or would the movie stop as soon as I hit the home button.Long story short, the guy knew nothing about chromecast, tried to lie to me with an answer containing processor specs expecting me to be intimidated and confused, instead it made me angry, so I called him out, ordered the chromecast and found out you CAN in fact, hit the home button, do other things on your phone or tablet while media streams to your chromecast in the background of your device and there will be several functions (rewind, fast forward, play, pause, stop) in your notifications area on your device.I hope this helps a lot of people make their choice in buying this product. I definitely recommend the Google Chromecast.", "verified": true, "helpfulness": "4/4", "author": "JW"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "mohammed"}, {"rating": 5.0, "review": "Excellent!!! Easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Jersey Guy"}, {"rating": 4.0, "review": "Nice product, just needs to stream Amazon Prime video!", "verified": true, "helpfulness": "0/0", "author": "LilWiz"}, {"rating": 5.0, "review": "Works good.", "verified": false, "helpfulness": "0/1", "author": "thomas woodard"}, {"rating": 4.0, "review": "Easy and works as advertised.  In my short experience in using Google Chromecast (GCC), you really need an Android based device to take full advantage of Apps that display to GCC.  To display web content via a browser on a Mac to GCC, you really need to use Chrome. (Not a bad thing, just pointing out what I have experienced.)  The Google ESPN Watch app works really well on GCC.", "verified": true, "helpfulness": "0/0", "author": "tigersteve"}, {"rating": 3.0, "review": "With the last update AllCast sharing local content is not working. In the product forum their are working to solve this problem but i can only see online content in my chromecast!", "verified": true, "helpfulness": "0/0", "author": "Pablo Castellucci"}]