[{"rating": 5.0, "review": "Not too long ago I finally bought a patch cord to hook up my laptop to our TV for watching videos, NetFlix, etc. but it was always a pain to get up to pause it when the phone rang, the doorbell rang, or when nature called. Anyway, using Google Chromecast is a breeze, it works fantastically, and you can control everything from your laptop ... which as the name would have it, is often right in your lap.Buy it - you'll love it.", "verified": true, "helpfulness": "0/0", "author": "JohnT"}, {"rating": 5.0, "review": "I was able to watch am international event that was streaming online right from my television. I'm looking forward to more moments like that.", "verified": true, "helpfulness": "0/0", "author": "Shawn Smith"}, {"rating": 5.0, "review": "I ordered this for myself.  My son has the Apple TV, but I wanted something smaller for my room.  This has worked absolutely great!  I truly recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Such an awesome little device! It streams from most major providers and, with the API finally open and available. from our own devices as well!", "verified": true, "helpfulness": "0/0", "author": "anfrey"}, {"rating": 4.0, "review": "Enjoyed ring able to watch complete Netflix series without having to buying individual seasons at Walmart or having to buy a Smart TV.  Really easy to set up from my iPhone.", "verified": true, "helpfulness": "0/0", "author": "Markisha"}, {"rating": 5.0, "review": "What else can I say...It works. That is a good thing. It'd be nice if it opened access to a few channels, like the Roku does, but still, it's great.", "verified": true, "helpfulness": "0/0", "author": "Richard C. Monaghan"}, {"rating": 1.0, "review": "Still cant hook this thing up properly.. I have several devices, so I'm not exactly a newbie..Wasted my cash..", "verified": true, "helpfulness": "0/1", "author": "MauiDan"}, {"rating": 5.0, "review": "I WATCH ALL MY MOVIES FROM MY ROOM WITH GOOGLE CHROME AND I LOVE IT! THE ONLY BAD IS THAT YOU HAVE TO SUBSCRIBE TO NETFLIX OR HULUPLUS", "verified": true, "helpfulness": "0/0", "author": "Heriberto Guevara Rivero \"Heriberto\""}, {"rating": 5.0, "review": "a brilliant idea.  A good way to turn your old TV into a smart TV with minimal money.  I love this product", "verified": true, "helpfulness": "0/0", "author": "Ramin Amirnovin"}, {"rating": 5.0, "review": "Great picture quality, better than our old Roku and more convenient.  Wish you could view web pages though...but otherwise it's really awesome.", "verified": true, "helpfulness": "0/1", "author": "stubborncricket \"Heidi\""}]