[{"rating": 3.0, "review": "I have had this device for 6 months, so I really have given it a shot.  I have had it replaced once, it still resets itself back to the home screen, for no apparent reason, right in the middle of a movie.  This device is great if you only want to live on Amazon.  I haven't been able to watch a Netflix movie since the upgrade.  HULU is slow, buffers, doesn't load.  Now, If this was the only device in my house, I would say, get a better router, but I have the cheapest ROKU player you can buy, the thing is in the basement, the router is upstairs, (Netgear N600, its only a year old.)  It never falters, it never gives up, (like the terminator) it doesn't buffer, it doesn't tell me to check my connection, it just plays.I love Amazon, I'm a Prime member, Kindle unlimited member, I have Prime music, which always plays great from the Fire TV. I have the First Gen Kindle as well as the latest, so it is very hard for me to ding this.  Please just fix it.  Netflix was fine until the upgrade, HULU not so much.", "verified": true, "helpfulness": "2/3", "author": "LP"}, {"rating": 5.0, "review": "I purchased Fire Tv mainly for the ability to stream video quickly. From my research, Fire Tv was the fastest at streaming and so far it has lived up to expectations. 2nd reason  was the availability of Amazon Prime. There are other Smart Tv's that have Prime, but every review I read said that streaming was slow compared to Fire Tv. What closed the deal was the voice search which cuts through the awkward screen typing interface which has not advanced since the first Dvr's went on the market. Add Apps and you have a pretty perfect streaming box.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good deal", "verified": true, "helpfulness": "0/0", "author": "jerry smith"}, {"rating": 5.0, "review": "love the fire thanks", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"packjack\""}, {"rating": 5.0, "review": "Very cool", "verified": true, "helpfulness": "0/0", "author": "j brooks champlin"}, {"rating": 4.0, "review": "Great product and easy to navigate. It seems like there's a lot of extras you have to pay for.  Content could be better organized. It's hard to tell what I can get for free and what I have to pay for. Should separate it better.", "verified": true, "helpfulness": "0/0", "author": "Edward A Legare"}, {"rating": 5.0, "review": "Works great offers a lot of entertainment", "verified": true, "helpfulness": "0/0", "author": "Bob Utterback"}, {"rating": 5.0, "review": "amazing. i love this item its always on in my house so much you can do and its faster than any other media player ive used. only downfall is you cant search amazon prime music. still awesome enough for 5 stars", "verified": true, "helpfulness": "0/0", "author": "Jesse Hendrickson"}, {"rating": 5.0, "review": "Pretty doggone awesome. No video lag receiving wifi from a sketchy <i>high speed</i> internet service.", "verified": true, "helpfulness": "0/0", "author": "rmdingler"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Steve T"}]