[{"rating": 3.0, "review": "Plays videos, but the exchange between browser and tv is still un-seemless.  Without a standalone remote, it still feels manual.", "verified": true, "helpfulness": "1/2", "author": "Pat"}, {"rating": 4.0, "review": "Liked the nice sleek product a little misleading as to all that you can watch off of a iPad. Somewhat difficult to get it to connect and a little slow once you want to watch", "verified": true, "helpfulness": "0/1", "author": "Ron Bagley"}, {"rating": 3.0, "review": "I thought I would be able to stream anything I could see on my portable device to my projector.  However, Chromecast only works when connected to a few apps.", "verified": true, "helpfulness": "0/1", "author": "Michael Hanley"}, {"rating": 1.0, "review": "Initially hubby purchased to go with my kindle fire hd.  Guess what, not compatible.  But figured we'd use it with the laptop, save having to connect that directly to the tv for watching hbo go.  Picture quality was not good and streaming was jerky.  Good old HDMI cable has much better quality picture.  Will be returning.", "verified": true, "helpfulness": "2/3", "author": "Melissa"}, {"rating": 3.0, "review": "Could be better if it would simply support screen sharing rather than limited app functionality. I'd like to see a little more versatility than casting a couple apps.", "verified": true, "helpfulness": "0/1", "author": "Malcolm Swarms"}, {"rating": 5.0, "review": "this is amazing for those that dont have smart tvs just yet and its a quick way to look from your phone to your tv", "verified": true, "helpfulness": "0/0", "author": "maya"}, {"rating": 5.0, "review": "This has given us a great addon to our viewing, allows us to view almost anything in our Flat Screen TV", "verified": true, "helpfulness": "0/0", "author": "Adriano"}, {"rating": 4.0, "review": "Liked it, gifted one too.useful, need more new things.small and portable device and an excellent choice of gift. Came quick and in good condition", "verified": true, "helpfulness": "0/0", "author": "Karan"}, {"rating": 3.0, "review": "this works fine for Netflix but will not work for Amazon prime.  WHY ???  it is very easy to use once you set up your phone or laptop to connect to your device to the Chromecast.  i have used it to play Pandora and Netflix on to my TV and it is great. amazon needs to allow me to connect my prime account to the Chromecast  device  (that they sell ) and this would be a 5 star product.  Google and amazon need to get this major problem straightened out.", "verified": true, "helpfulness": "2/3", "author": "danielle davidsen"}, {"rating": 1.0, "review": "I watched the official google ads about chromecast before buying, which assured me I can watch videos from my hard drive on my computer. A friend confirmed this use of the device and recommended it as the wireless seamless way to connect my laptop to my new Vizio Smart TV. Turns out that this is NO longer possible. It was but google firmwired an update so it doesn't work with video players any more! I downloaded the Chrome browser extension for Chromecast after more research but streaming a video from my computer via the browser tends to be slow - the video is choppy and impossible to watch. The browser streaming icon turned orange and suggested I move the tv closer to the wifi but they are 6 feet apart in the same room as is my laptop, i don't see that really being a problem. The second reason I bought chromecast is because of the promise I can play any web content - well - that's not true either. It depends on the player a website is using... For example gaiamtv.com is not supported, which was the only thing I wanted to watch that I could not get directly from my TV.So far, chromecast is really good at streaming youtube videos (also a google product) - but I already have that on my tv - making it useless for me.The one star I give it is for the unexpected beautiful photos that double as screensavers for my tv when in that input and not streaming anything. That was a nice surprise. But I remain disappointed as I cannot use it for the two reasons I bought it for. I thought that in today's tech age companies will keep adding, not take away features of their devices... I have little taste for corporate policies devices on the golf course!I have not decided if I will return it yet. I will keep digging online to find some use for it... if not it will have to go...", "verified": true, "helpfulness": "1/2", "author": "PS"}]