[{"rating": 4.0, "review": "I really like the features. Could be happier if the device had more storage and headphone capability like Roku.", "verified": true, "helpfulness": "1/1", "author": "Dipu"}, {"rating": 4.0, "review": "Works as expected but haven't figured out if I can turn unit off without unplugging it.", "verified": true, "helpfulness": "0/1", "author": "G. Dyer"}, {"rating": 5.0, "review": "I got this so I could stream Sling.  It's a nice platform for amazon prime streaming as well.  Netflix, Hulu work well too.  Everything has been great and easy to use.  Love the simplicity of the remote.", "verified": true, "helpfulness": "0/0", "author": "l17h"}, {"rating": 5.0, "review": "It is everything and more that it said it was. I would make sure you have the prime movies too. Voice search is the best.", "verified": true, "helpfulness": "0/0", "author": "Barbara Edens"}, {"rating": 5.0, "review": "Fantastic product. Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Payton Rentmeister"}, {"rating": 5.0, "review": "Amazon Fire TV is a great addition to any cord cutters arsenal of weapons.  If you want to get away from the costly monthly bills of dish or cable pick up one of these boxes with a prime membership and you are good to go.", "verified": true, "helpfulness": "1/1", "author": "Chad Harris"}, {"rating": 5.0, "review": "Could not be easier to set up or use. It seems to have better video than the att/uverse DVR that is the primary input on the tv, although I can't figure out how that happens.  Amazon prime programming is extensive.  The remote is slick, small and fast. I love this little box!", "verified": true, "helpfulness": "0/0", "author": "william c howell"}, {"rating": 4.0, "review": "So far, it's a wonderful device. What made my decision final in purchase was that it gave me the ability to listen to my Amazon Prime music!", "verified": true, "helpfulness": "1/1", "author": "Will Torres"}, {"rating": 4.0, "review": "It is great if you don't want to pay tv service.", "verified": true, "helpfulness": "0/0", "author": "maria mejia"}, {"rating": 5.0, "review": "This is a nice device, we got this for the workout room because the android we use to have was not working properly; Amazon fire overpass the expectations, some how is faster than the android and in some cases if feels even faster than the PS3 especially accessing to the video apps. I definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Jezy L \"Jezy\""}]