[{"rating": 2.0, "review": "I really did not like this product.  Seemed laggy and the navigation was not what I was expecting.  I opted for the Roku 3 after trying this and various others.  I am much happier than I was with the the Amazon Fire TV.", "verified": true, "helpfulness": "0/1", "author": "N. \"Nick\""}, {"rating": 4.0, "review": "I like the device, though it seems to me all the new or well sought after programs are for rent or sale...", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super fast interface. great selection of apps.BUT be warned!!!If you have Comcast, a number of the apps will not stream. Showtime, HBO-Go, A&E; and PBS are all a no go. Thankfully ESPN works.Netflix of course works great!", "verified": true, "helpfulness": "0/0", "author": "Everyman"}, {"rating": 5.0, "review": "Love my Fire TV. Easy to use and lots of great stuff to watch on Prime Video. I love the ESPN App for watching tennis since it lets me pick the match I want to watch at the Slams.", "verified": true, "helpfulness": "1/1", "author": "WitchLitChick"}, {"rating": 5.0, "review": "i love amazon; and all the movies, music, and tv shows i have access too with prime; the device is awesome; it takes no space; the remote understands my accent; great selection of absolutely everything i could want;", "verified": true, "helpfulness": "2/2", "author": "anonimous"}, {"rating": 1.0, "review": "Would not recommend. The system freezes up often. Many times the screen goes black and the system has to be reset or we have to exit out of the show we are watching. The voice search does not always work. We have other systems in the house besides this one and have not had any issues with them.", "verified": true, "helpfulness": "5/6", "author": "Maureen Hopkins"}, {"rating": 5.0, "review": "Easy to set up.  Great to see Netflix and Amazon Prime shows on my big screen!", "verified": true, "helpfulness": "0/0", "author": "Storage Queen"}, {"rating": 5.0, "review": "I love my Amazon TV. It only gets better with updates. Fast, amazing HD quality.  Just glad I got one. It look so cute right beside my TV. Heehee", "verified": true, "helpfulness": "0/0", "author": "Jean Richard"}, {"rating": 3.0, "review": "I am currently still reviewing my recent purchase of the Amazon fire tv system. It was very easy to set up, the instruction video was very informative. Some of the app's I had to download online, for some reason they did not load on to fire tv. But after rebooting the apps showed up.Netflix streaming is a little choppy at times, but it could be an issue with our wireless router. The only negative issue is an off button on the remote or the fire tv box. To power down the unit you have to either unplug the power or put it to sleep through the settings. I don't understand that feature.", "verified": true, "helpfulness": "1/1", "author": "Paige Morris"}, {"rating": 3.0, "review": "The FireTV is much faster then the AppleTV or WDTV Live.  It seems to work better too.  Unfortunately, my unit is glitchy and I need to return it and get another one as it sometimes flashes and then shuts off when playing videos.  Not too often, but when it does it annoys me.  The included Amazon Basics batteries DIED in the remote after less then a month... Really Amazon?  I like the fact that it can do apps, the Vudu app is awesome and provides many hours of enjoyment.  Netflix and Amazon as well, but unfortunately the content providers are holding them both back, so that still requires me to get stuff from \"other sources\" - and in that area, the FireTV doesn't do much out of the box, but if you \"side load\" the XBMC app you can play content directly from the NAS on your network and it works pretty well.  The Plex app works ok too but sometimes disconnects from my computer and have a difficult time re-establishing connection.  It still seems like I spend a lot of time messing with the technology and less time watching TV - unless it's on Amazon or Netflix.  The voice remote is cool but come on Amazon, they had to know that most of us would use netflix.  The remote will only search for titles on Amazon's own service.  RUDE.I'm updating my review, I have discovered the glitchy video is either a defective HDMI cable or a bad input on my receiver.  I moved the Amazon TV to another input on a different cable and it seems to be working.  Hoping this holds up, as the glitchy video play back was ruining my relaxing evenings.", "verified": true, "helpfulness": "2/2", "author": "Robert Klaproth"}]