[{"rating": 4.0, "review": "I love my Amazon Fire TV. I don't love how it's locked down. Most of the decent Prime content requires an additional payment I'd be a lot more likely to use it is it was all-you-can-eat like Hulu and Netflix. As it stands,  I've installed a 3rdnparty launcher designed for the AFTV and use Hulu Plus,  Netflix,  xbmc and other apps on a regular basis and I'm reasonably satisfied. I do wish I could connect a mic and usb webcam to use video chat in Skype or Hangouts.", "verified": true, "helpfulness": "1/1", "author": "Joseph H."}, {"rating": 4.0, "review": "Seems to work great", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "My Fire TV was not working and while I could not see anything on the TV I apparently pushed buttons in the right combination to order a video I did not intend to.  There is no way that I can find to cancel the order and no customer service number I can see.  I am going to set up a pin number so I don't have this happen again.  Too bad there is not a real person to talk to about this stuff.  If the device keeps acting up I will have to send it back under warranty.  How can such a large company have such bad service?", "verified": true, "helpfulness": "3/8", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I can not believe the in house fighting over different types of streaming devices. Some of you knuckle draggers  need to give it a rest!This thing is really SLICK! Once again Amazon lands in the Brilliant column!", "verified": true, "helpfulness": "0/1", "author": "KP Jandt"}, {"rating": 1.0, "review": "We got one of these with the Try It Free For 30 Days deal, intending to replace our first-generation Roku. The specs seem very nice, the features look good, but it suffered from a fatal problem - it refused to recognize our TV as an HD unit, and would only display in 480-line mode. We have a Wii U and the Roku plugged into it (in 720P mode) and they both work fine, but no amount of messing with the settings on the Amazon would convince it to change resolution.Very disappointing. We're returning it.", "verified": true, "helpfulness": "5/7", "author": "Ms. Carey P. Booth"}, {"rating": 5.0, "review": "Voice activated feature works great. Fast processor.", "verified": true, "helpfulness": "0/0", "author": "LPV"}, {"rating": 5.0, "review": "I have 2 Amazon Fires and they both work great. I use Plex to stream the stuff from my computer and sideloading apps like Vudu or Wisiwig was super simple. I use it a lot and love them both.**UPDATE*****I have been using these FireTV's for over a year now. And i can say that i am not disappointed. We are now using Netflix, HULU, Plex, History Channel and HBO GO all the time. My not very computer literate husband even watches it and uses it for the TuneIN radio app to listed to his favorite station from Canada. I have been able to take it on vacation and even my sister bought one for her family. I can say that without Plex streaming my own movies it wouldnt be as good, but would still be 5 star worthy.Pros:Streams about all formats of video  (the best audio format for this is AAC, some others wont work but video always works)Apps are good and most work with no issuesAbility to sideload apps and use a mouse if no controller supportCons:Sound codecs really need to be updated or a pass though ability had so that my receiver can do the processinggigabit network would have been awesomehard rebooting the FireTV should be easier the soft reboot dosen't always work", "verified": true, "helpfulness": "0/0", "author": "Kenneth Presler"}, {"rating": 3.0, "review": "I really want to love this box, but there are a couple of things I just can't seem to look past unfortunately. The biggest gripe I have is that if you have a lot of purchased movies and tv from Amazon, you are likely to be disappointed with the way your library is displayed on this box. Prime content and videos that are available for rent or purchase are displayed and organized with the greatest care and style. The way your library is displayed though is clearly an afterthought. Everything is displayed in a single straight line organized by date of purchase with no way to change or customize anything. Movies and TV shows aren't even separated.  This may not seem like a huge deal, but if you are or were planning on becoming invested in the Amazon ecosystem, then this is certainly cause to reconsider.", "verified": true, "helpfulness": "6/6", "author": "Daniel Dearmond"}, {"rating": 5.0, "review": "Had problems with some updates. Customer service is wonderful had a replacement in no time. This thing works wonders for streaming movies and shows. Have not tried music, pictures or the games yet.", "verified": true, "helpfulness": "0/0", "author": "Rafael Palasol"}, {"rating": 5.0, "review": "much better than Apple TV.", "verified": false, "helpfulness": "0/0", "author": "Mark H Benson"}]