[{"rating": 4.0, "review": "goood !!", "verified": true, "helpfulness": "0/0", "author": "Dario"}, {"rating": 1.0, "review": "I really want to like the Chromecast but I just can't. I can't get one full episode of a show I'm watching to stream from my Chromebook to my Chromecast without it dropping the connection. And that's with the Chromebook, Chromecast, and router all in the same room within 9 feet of each other. My guess is it needs a better wifi antenna. Too bad I can't stream to my Roku.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Young daughter loves it - casting her tablet to TV for YouTube videos. We also have Amazon Prime and use that more for Netflix and Chromecast for casting.", "verified": true, "helpfulness": "0/0", "author": "Iowa Family"}, {"rating": 1.0, "review": "It keeps on disconnecting from iPad, phone, computer, etc. then u have to set it up all over again for it to work for a few hours & then start again", "verified": false, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "pete neubauer"}, {"rating": 5.0, "review": "every day I use this and I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Daniela Bassi"}, {"rating": 4.0, "review": "Everything worked out great once I figured it out having no directions. I was about ready to return it, when I finally figured it out. I was really frustrated. I only wish I am able to play my movies on my computer to the Chromecast without lag time. It is still experimental, so hopefully someday it will be smoother. I will just use my HDMI cable for now.", "verified": false, "helpfulness": "0/0", "author": "Nate W."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "John D Forte"}, {"rating": 5.0, "review": "I just love chromecast. This is the second unit I have purchased. Excellent way to convert a standard TV into wifi. Thank you for an awesome product. I always recommend to friends who don't have the funds to purchase a whole new smart TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "favorite purchase in a while!! play movies on tv from pc and clone your browser to tv so everyone can see.", "verified": true, "helpfulness": "0/0", "author": "Rhonda M Allen"}]