[{"rating": 5.0, "review": "It works great. I use it every day.and recommend it to anyone who likes to view movies on their TV.", "verified": true, "helpfulness": "0/0", "author": "Carl R. Feller"}, {"rating": 5.0, "review": "Really easy to hook up. I was surprised it worked on more than 1 device. I hooked it up on my laptop and it work on the ipad and other laptops as well. Really good deal for a device with so many features.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 4.0, "review": "I'm a little disappointed with gcast but it's worth for presentations and work! It's a cheap way to cast everything from all devices but for me it has not often use...", "verified": true, "helpfulness": "0/0", "author": "Bart"}, {"rating": 5.0, "review": "Great product,  amazing performance,  easy to install and very reliable.  Instead other similar products this one bring you awesome features for low cost", "verified": true, "helpfulness": "0/0", "author": "fernando"}, {"rating": 4.0, "review": "The device does a good job in redirecting the stream from a connected device (my wife uses a laptop from which to rebroadcast).  The instructions were not as user friendly as I expected, and initially we kept losing the connection.  It is worth the small investment if you want to see Netflix movies and YouTube videos on a larger screen.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great product for those who need it.I intended to use it for streaming downloaded movie files from my Nexus 5 android to my TV.Chromecast hooked up to my WiFi network flawlessly and was set up in less than 5 minutes.It was said that it would only work if I connected to the same WiFi network as my phone, but it works even when connected to a different WiFi emited by the same router.Works wll for music on google music, Youtube and googleplay movies.The problem is I can not find a suitable app to stream all video formats I need straight from the phone, I wish there was an official google app. That's why only 4 stars.As for streaming online content - it is a perfect solution.", "verified": true, "helpfulness": "0/0", "author": "Cyril"}, {"rating": 4.0, "review": "It was very easy to set up and it works great! Picture quality is good. I have no regrets. My TV is now smart!", "verified": true, "helpfulness": "0/1", "author": "suzie"}, {"rating": 5.0, "review": "The Chromecast is a great gadget.  I use it often.  I can watch video on my HDTV which is better than a laptop screen.", "verified": true, "helpfulness": "0/0", "author": "Moonman"}, {"rating": 5.0, "review": "though there is room for improvement. It works really well as it is currently designed. I would recommend you really read into the specs before you buy it as you may not fully understand it's limits. The primary limit at this time is wireless router compatibility. I got lucky because my primary router was on the list. However, in a secondary location I cannot use it.But, I can use it on my Android. So, there are a few conventions you need to understand.", "verified": true, "helpfulness": "0/0", "author": "Michael Smith"}, {"rating": 1.0, "review": "Usually I like Google products so I was hugely disappointed. All I want to do is watch Netflix on this TV. The connectivity issues are insane. Even once the setup was finally finished and it was hooked up to my wifi, the loading and buffering time was unbearable. My Wii used to be able to play Netflix on this exact same TV with no problems, so why can't Chromecast?If you do get it to work, there is no way to pause, rewind, fastforward, etc. You're supposed to be able to do it from your phone or Chrome browser. Neither worked for me.It completely froze a week into owning it, so I tried the trusty unplug-replug and now I can't get it to reconnect to my wifi network. I'm returning it and will get a Roku or Fire TV or something.", "verified": true, "helpfulness": "2/2", "author": "Melissa"}]