[{"rating": 5.0, "review": "The Amazon Fire TV that I received today was so easy to hook up.  I am usually very challenged with these electronic devices but the directions that was sent were precise and easy, so thank you for that.  I can now watch Prime Movies, TV shows or whatever on my TV.Thanks Amazon for making it so easy.", "verified": true, "helpfulness": "0/0", "author": "s. sugar"}, {"rating": 5.0, "review": "I love the Amazon Fire TV! I no longer have to watch my prime movies on my computer. I don't have a smart TV, so the Amazon Fire TV is an amazing option. My boyfriend has the Roku, but the Amazon Fire TV has a more conservative and sleek look. It does not get hot with long use, like some consoles.It has the Showtime app and Youtube. I wish it had HBO to go, but I'm sure that will come eventually. Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is awesome, it is ready to go right out of the box if you have an Amazon account and the picture quality is great too.  The shows or movies that you watch on Amazon Prime load up right away and the voice search.works very well and it is a lot easier than typing in what you want to watch.  The customer service is.also great I mean I went to the help menu when I set up the Fire TV and the contacted me on my cell within about 5 seconds.  The only thing I think some people might find troubling is that there is no power button on the remote or the system itself and that I why I had to.talk to someone from their customer service.  They told me that when the system is idle for a certain amount of time it goes into sleep mode and that is how it shuts off, and by doing it that way they can send constant updates to the Fire TV.  I would recommend anyone I know to buy the Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Eric R Hallada"}, {"rating": 5.0, "review": "This product is amazing. I use it all the time instead of constantly using consoles to access netflix, amazon prime, and hulu. I recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Satisfied Customer"}, {"rating": 5.0, "review": "Other devices owned used for steaming video and/or games: Roku (1&3), Chromecast, Wii/PS3/Xbox 360 Arcade (which I traded into Amazon for a Gift card that I used to buy the Fire TV)Review for Amazon Fire TV:(PROS)Easy to set up, unlike all the videos online, updates were finished within seconds of plugging inBought the controller - great ease of use, good battery life, plays like a Xbox/PS3 hybrid (not so touch sensitive, but for the games at hand more than capable.Full, classic games are cheap, easily installed in seconds, and load instantly.The design is sleek, modern, and minimalist (you hardly know it's there until you turn it on, then everyone starts asking about the quite little box with so many features)The voice search feature is quite possibly the best invention everThe UI (User Interface) - Simple, straight forward, but still a little cluttered and hard to separate your content from the massive selection Amazon offersAs a Prime Member, owning  Fire HDX and Fire HD (current gen), the Fire TV was the logical choice.(CONS)Not being able to add a hard drive worry free is a little bothersome (can be done, but I'm not a techie)The fact Amazon dropped the price on me a week or two after my purchase (Still would have paid more)I am an avid gamer, but as of late (not sure if I'm getting old or becoming too busy at 28) I have not had the time to dedicate to video games that most games require.I love the fact the PS3 doubles as a blu-ray player and have a tremendous back log of games (not even thinking of a PS4 anytime soon).Roku helped me cut the cord, but really, the Roku 1 met my needs for ease of use and functions. I have this in the guest room on a 32\" and it works well enough.I had an Xbox Slim Arcade with USB drives in almost every port, Xbox Live (which is a scam), and a few current games. Nothing made me more irritated than buying a game, and taking 2-3 hours to download content so I could start playing. The system became an expensive media center, allowing me to watch cable in HD (one box in the house, this one made it two via HDMI and a TWC/ESPN App).I had the Chromecast to play with, and an android phone to use as a controller, but found the overall uses cumbersome and generally very simple. While the market comparability with other devices is amazing, I use a windows phone (Lumina 520) and Kindle Fire HDX tablets. Simple is just a word that continues to come to mind.The Fire TV allows the use of everything essential between the aforementioned products. Netflix, Amazon Prime, Games (arcade, classics, and some originals) at the best price point yet.If you're in the Amazon Prime world, this is a no brainer. If you're not in the World of Prime, you must enjoy spending more and getting less.", "verified": true, "helpfulness": "3/3", "author": "James Burke"}, {"rating": 2.0, "review": "expected to be able to watch local tv channels current, not previous episodes,it wasn't for us,the movies were nice,picture was good,but needed to watch local also", "verified": true, "helpfulness": "1/9", "author": "vad"}, {"rating": 5.0, "review": "I love my Amazon Fire TV BUT I need more sports apps.  I'm thrilled to have WatchESPN but really need the Big Ten and SEC Networks too.  Wish there was a place we could place our \"requests\" with Amazon.  Looking forward to HBO GO coming.  Keep adding content Amazon.  This is an excellent device.", "verified": true, "helpfulness": "0/0", "author": "avidreader"}, {"rating": 5.0, "review": "Performs as advertised", "verified": true, "helpfulness": "0/1", "author": "Alvin Barksdale"}, {"rating": 4.0, "review": "I didn't think that all of the movies would cost what they do.  and it isn't as portable as I had hoped, tried taking it to my timeshare and it would not sync up.", "verified": true, "helpfulness": "2/3", "author": "Darrell Sarrazin \"ocnetman\""}, {"rating": 5.0, "review": "Its awesome. Fast, sleek and delivers.I have had many different types of streamers (Roku,Chromecast,WDSmart,Raspberri Pi with different Media OSes',Android MK808, ect...) and by far this is the best.The User Interface is sleek and simple, and the voice command works great. Paired up with my Amazon Prime and its a recipe for success.I have installed XBMC on it. Nuff said.The only thing, ONLY THING is that since its android (albeit with Amazon's custom skin) I should not have to spend extra on games (and apps that I don't know of yet). Since the Play Store doesn't exist on it, I have to pay to have the apps I already purchased, again. Me no likey. There is a way to put Google Play Store on it (and I did it already) but its not meant for the Fire, so the apps can be incompatible.Other then the aforementioned its a spectacular device.", "verified": true, "helpfulness": "1/1", "author": "John peralta"}]