[{"rating": 3.0, "review": "It's a chromecast....I prefer my Roku's, but on occasion it is neat to cast something on a tablet or laptop to my TV. I would like to see much more functionality out of this device however. It left me kind of ho-hum about it overall.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 4.0, "review": "Easy install for tech junkies, and for folks with common sense. Follow the directions and your install will go smoothly. If you have wifi built into the television that you are using this product for, or if you have a gaming console with wifi capabilities hooked to it--you do not need to purchase this product.", "verified": true, "helpfulness": "0/0", "author": "CloakedTrigger"}, {"rating": 5.0, "review": "I can't say that it has change my TV watching experience.", "verified": true, "helpfulness": "0/0", "author": "LearningCurve101"}, {"rating": 5.0, "review": "Great Product!!!", "verified": true, "helpfulness": "0/0", "author": "Jolysa Connor"}, {"rating": 2.0, "review": "The product did not work. Worked in the beginning and stopped working. I received a no video message.", "verified": true, "helpfulness": "0/0", "author": "Paul Pluda"}, {"rating": 5.0, "review": "Great device at a great price!", "verified": true, "helpfulness": "0/0", "author": "Skip"}, {"rating": 1.0, "review": "was not what I expected and not what he said box", "verified": true, "helpfulness": "0/0", "author": "kim"}, {"rating": 3.0, "review": "Can't usually get the screen casting to work (main reason I bought one) but the apps that have it built in work great.", "verified": true, "helpfulness": "0/0", "author": "cooncat"}, {"rating": 1.0, "review": "NO....doesn't work with any tv I have...is there a cable that will adjust this to fit all TV's??? very disappointed....also did not know you needed wifi with password...as I spend most of my time on the road and wanted this device to watch movies in hotels.....", "verified": true, "helpfulness": "0/0", "author": "brenda pomeroy"}, {"rating": 5.0, "review": "Very convenient and extremely easy to set up.  Can stream from Netflix or any website. Also was easy to stream from my Android phone. Reasonable on price and found worth the money.", "verified": true, "helpfulness": "0/0", "author": "Brenda L Valentin"}]