[{"rating": 3.0, "review": "Why there is no DLNA player as my Blu-Ray and Roku boxes have baffles me. The specs are better but the Roku 3 is a better product all day long.", "verified": true, "helpfulness": "1/2", "author": "Timothy W. Williams"}, {"rating": 5.0, "review": "I am enjoying this.", "verified": true, "helpfulness": "0/0", "author": "laura"}, {"rating": 5.0, "review": "This is the box to get to stream tv. Easy to install and easy to use. I have had for a month now and use it all the time. No problems.", "verified": true, "helpfulness": "1/1", "author": "terry bailey"}, {"rating": 5.0, "review": "What can I say that others haven't?  I cut the cord a few years back, using an Apple TV.  Later I got one of these for a second tv, and a little later I bought another one and gave my daughter the Apple TV.The biggest difference between this and the Apple TV (Ignoring the voice search, which is gimmicky in my opinion), is that unlike the Apple TV, the Amazon Fire TV has it's own subscribe-able premium content that comes with Prime membership.  If you're a Prime member, you'd be foolish to go with anything that doesn't offer Amazon Prime content.  I think Apple TV is the only device out there that doesn't.Very snappy UI also.  This seems minor, but for anyone who's used anything else with a laggy UI, it becomes a bigger and bigger issue each day.", "verified": true, "helpfulness": "1/1", "author": "Brent L. Bordelon"}, {"rating": 5.0, "review": "as advertised", "verified": true, "helpfulness": "0/0", "author": "RDP"}, {"rating": 5.0, "review": "The Fire TV box is very small and will fit anywhere. Remote is very comfortable and has good ergonomics. Both items seem very durable and of good quality", "verified": true, "helpfulness": "1/1", "author": "AB"}, {"rating": 5.0, "review": "had it for months, it's not perfect but I'm loving it!", "verified": true, "helpfulness": "1/1", "author": "J. Mayer"}, {"rating": 1.0, "review": "We have had nothing but problems with the Amazon Fire TV! I would recommend the Roku. We love our Roku but wanted to try the Amazon Fire Tv for our bedroom. Bad choice. It always freezes, very slow to load, always have problems with movies that we pay money for (Amazon has been wonderful with giving our money back for these movies atleast thank you). The visual and look of this product is very slick and nice. But the quality is terrible. Again I recommend the Roku. Have never had a problem with it.", "verified": true, "helpfulness": "1/1", "author": "samantha carlson"}, {"rating": 5.0, "review": "Since I'm not a tech. person I did need someone to help me install it, but if I had the patience I could of probably done it myself.  maybe?  Love the ease of this product and now I can stream all my DVD's from the workout companies I use.  I no longer will have to fear that my DVD will get damaged.", "verified": true, "helpfulness": "1/1", "author": "Sophia Putnam"}, {"rating": 1.0, "review": "have had 2 of these and both went bad after about a week.apple tv more reliable!!!!", "verified": true, "helpfulness": "0/4", "author": "viper"}]