[{"rating": 2.0, "review": "I am not a fan of anything Google...and I know this is entirely different than email, etc. HOWEVER, I think the feeling is mutual because I cannot get this thing to work for the life of me!! My boyfriend has one at work, LOVES it. We HAD to have one. I got one, and since the night before Thanksgiving (almost a month now), it's worked an entire two times. When it works...it's amazing. But it doesn't tend to work. My boyfriend keeps blaming it on our router...maybe he's right. But I'm not convinced.", "verified": true, "helpfulness": "0/2", "author": "Mom Addicted to Target"}, {"rating": 5.0, "review": "Works as advertised.  Easy to install & Set up.  Works with Netflix just fine.  I would recommend friends & family.", "verified": true, "helpfulness": "0/0", "author": "Pennster"}, {"rating": 4.0, "review": "Good value for the money. Only con is the limited number of devices you can stream from. Over all, a good product.", "verified": true, "helpfulness": "1/1", "author": "Carl Hutcherson"}, {"rating": 5.0, "review": "Not much more to say.  For $35 it's a deal!!  Works just like Google says it should.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Richard N DeLiberty"}, {"rating": 5.0, "review": "I was able to setup except I did not get the TV code and called Niccole at the Google HELP desk.  She was very patient and calm and she walked me through it.  Turned out to be a non-issueI am able to simply cast  Netflix, HULU+, YouTube from 3 pcs (2 XP, Win8.1.), a Kindle Fire, and a NEXUS 10.  All work great.  No issues what so ever.This is a great product and I hope I get more applications, like CNN News", "verified": true, "helpfulness": "0/0", "author": "Ray Bellotti"}, {"rating": 4.0, "review": "I got the chromecast to put some of my son's cartoons on TV at different times.  We also enjoy watching programs from Hulu Plus.  From my iPhone (and with the apps) Chromecast works great.  We hardly notice any quality difference and very little buffering.  Google says you can cast from the Chrome browser on a PC... absolutely not.  My laptop is high quality and our high speed internet is great, but casting from the PC doesn't work at all.  No biggie.  I hope Google adds Vudu and a few others to their service soon.", "verified": true, "helpfulness": "1/1", "author": "D. J. Klein \"jtown11\""}, {"rating": 2.0, "review": "This device has not yet reach adulthood. Go get the Roku 3 instead. I only bought this thing to stream youtube videos on my TV because at the time Roku didn't have a youtube channel for that. Of course after I buy this crap you can now watch Youtube videos on Roku. Sheesh.First I had problems installing. It wouldn't see my wifi connection from my laptap. And my wifi is not hidden. After trying numerous times I finally googled the problem. Found out others were having the same issue but they were able to install with their android tablet. I opened my nexus 7 and finally got it working. Oddly it worked fine on my laptop after installing from my tablet.So it works and its slow. Streaming chrome explorer or youtube vids works fine but netflix is too slow. Having to use your tablet or laptop is awkward, compared to using a remote.Just get a Roku. I heard the Apple TV is good too, but I have no experience with it. Basically if you buy from Itunes you might prefer the Apple TV - or a Roku if you get your media from Amazon. Hope this helps.", "verified": true, "helpfulness": "2/3", "author": "C. Davis"}, {"rating": 3.0, "review": "Doesn't work with my 1 year old Samsung TV, but worked fine on my 2 year old Panasonic.  On my Samsung (which is within a few feet of my wireless router) it would like it was initializing for a few seconds, then i see the google chrome icon flash for a fraction of a second, then the signal goes away (black screen).  Haven't decided if I'm going to return it yet.", "verified": true, "helpfulness": "1/1", "author": "Don Best"}, {"rating": 3.0, "review": "Netflix works ok.Youtube has bugs were it freezes very often.Needs more Apps.It's a bummer I can't use it with my VPN. It uses google's DNS severs.", "verified": true, "helpfulness": "1/2", "author": "Alfredo Chapela"}, {"rating": 5.0, "review": "This product chromecast is very useful because you can movie in you tv through streaming media player, very good item.", "verified": true, "helpfulness": "1/2", "author": "josehp"}]