[{"rating": 3.0, "review": "If you are only using this device for Amazon prime tv than it is great.  If you are looking for a universal set top media box that works equally well with Netflix, Hulu and Prime as well as other streaming services I would suggest the Roku 3 which has a much better interface for crossing multiple platforms.", "verified": true, "helpfulness": "0/1", "author": "David kenney"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "Frank Griffin"}, {"rating": 5.0, "review": "better than a pc. faster' EASY, MORE FUN", "verified": true, "helpfulness": "0/0", "author": "gary willard"}, {"rating": 4.0, "review": "Now I really do like this product. But.... I did run into some issues. Such as if you are using an older hdtv that uses dvi then you won't be able to get past the instructional video and it's pretty much just a $99 square at that point. Thankfully I have an abundance of hdtvs that use hdmi . So after I passed the instructional video and set it up I then hooked it back up to my dvi tv and it worked perfectly fine. If it worked from the start I'd give it a 5 star. I'd recommend this over a Roku or Apple TV, and especially Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Konnor Ross"}, {"rating": 2.0, "review": "Didn't do any more than the free Amazon movies.", "verified": true, "helpfulness": "1/6", "author": "cindy"}, {"rating": 3.0, "review": "The size of the unit is nice . Although apps are limited to the pre-installed ones. Would be better if you could add/delete to your own likings...  amazon prime n instant video is ok. ...", "verified": true, "helpfulness": "0/1", "author": "Doug V"}, {"rating": 4.0, "review": "I love this little box.  I have had several different devices.  This is one of my favorites easy to set up easy to use.  And customer support is GREAT.  You really need the prime membership to get the best experience.  The only problems I have is there is no separation from prime movies,  rental movies or purchase movies.  There should be a purchase section prime section and a rental section for faster and easier selections.  I love the voice search several family and friends tried it and it worked perfectly every time.", "verified": true, "helpfulness": "0/0", "author": "William S Walker"}, {"rating": 5.0, "review": "We love the Amazon Fire TV!  The only down side to it is when you voice search it almost always brings up movies you would have to pay to rent instead of movies that are free off your Netflix or Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "Joy shelton"}, {"rating": 4.0, "review": "I like the Amazon Fire TV. It's a cool little console with more of the better Android games available compared to other Android consoles.", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 4.0, "review": "Amazon FireTV is a great product.  Easy to use and hookup.  The wireless feature is nice.  I already have 3 devices that will do streaming (Blu-Ray, Tivo & ChromeCast)HOWEVER...Do NOT let Amazon tempt you with the 30 free trial of this.  I got an email and signed up for a 30 day trial of the product.  Used my 30 days and returned it as directed.  Amazon still decided to bill me the $99, even though I returned to them within time.  I have spoke with 4 representatives in the past week trying to clear up their $99 charge that was billed to my Amazon.com Store account.  They've tried to do the refund in various methods except a straight credit back to the card.  One week later, and I'm still $82 short of a full credit on the account.", "verified": true, "helpfulness": "2/2", "author": "Michael Hetrick"}]