[{"rating": 3.0, "review": "I did not have the right device to get results from the Chromecast:  My notebook computer would not recognize it.", "verified": true, "helpfulness": "0/0", "author": "Sheila Sparks"}, {"rating": 5.0, "review": "Its like a remote control without one! We have netflix so we use the google chromecast to see series one auor tv screen! Wer recieved the product on time!", "verified": true, "helpfulness": "0/0", "author": "Josefina Peire"}, {"rating": 5.0, "review": "I read many reviews before purchasing this.  My advise is the same as others -- READ THE INSTRUCTIONS and you'll be watching movies in about 5 minutes.  Works great every time.  I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "maryp"}, {"rating": 2.0, "review": "Was not overly impressed with the functionality of the Google Chromecast. Also, beware that is it not compatible with all video streaming applications. Do like that it works with Nefflix, however would give it a higher review if it could stream from the Amazon Prime Video App.", "verified": true, "helpfulness": "0/0", "author": "Doodle"}, {"rating": 5.0, "review": "Does exactly what it says it'll do.  Now I can have my computer back.  Netflix and youtube on the bigscreen.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I wanted to see if I could figure out how to watch the shows I want to watch and not pay the cable company for all the channels I never watch (and the ones that are only there to sell me something!)  Bingo!  I love this option.  I have Netflix, HuluPlus, Amazon Prime, and a few other streaming options and can watch pretty much whatever I want to when I want to watch it.  I'll be ordering one of these devices for my other rooms with TVs and turning off cable permanently.  I can get all the local information I want & need online and everything else streams.  Excellent!", "verified": true, "helpfulness": "0/0", "author": "Robin J \"howmuchwillitcost\""}, {"rating": 5.0, "review": "If you were like me, MTV music videos was a HUGE part of my childhood.  So, when you pair the ChromeCast with YouTube Playlist made up of music videos, it's PERFECT!  YouTube Playlist example below!!I have used this with Plex with mixed results as well.  I often have the videos buffer/stop randomly.  I'm assuming this is growing pains of the device.  Most of the issues look to be associated with audio with AC3 5.1.But, outside of Plex, perfect.  YouTube, Google Music, Netflix, Chrome Browser Casting.  All great!<-----VH1 - 100 Greatest Songs of the '90s----->[...]", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "Works well with my TV. Picture is good. Allows me to watch TV shows I don't get on basic cable.", "verified": true, "helpfulness": "0/0", "author": "E. Hagan"}, {"rating": 4.0, "review": "would be perfect if it were compatible with more appsI  heard they were opening their operating  code up,  but I haven't seen any new apps.And,  the Google play music app won't let you play sings you have already downloaded from Amazon mp3.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Product worked just as described, no issues whatsoever, only wish it had more things to do with it instead of just Netflix and YouTube.  Hopefully there will be an upgrade to the device in the near future to add more programs.", "verified": true, "helpfulness": "0/0", "author": "JimmyG"}]