[{"rating": 5.0, "review": "Was having a problem with quality of picture from local TV cable provider. The Chromecast gets around that issue while providing content not available under my cable plan. Am extremely pleased with both price and value.", "verified": true, "helpfulness": "0/0", "author": "Robert L."}, {"rating": 5.0, "review": "I love being able to cast my browser tab or youtube video, or Google Play Movie to my 55\" Plasma.", "verified": true, "helpfulness": "0/0", "author": "Jorge A. Contreras"}, {"rating": 1.0, "review": "the cast worked from my laptop one day and since has failed to do anythingI cannot access netflix at all with my iphone 5 so I can do nothing useful with this thinga total failureno success trying to find solutions", "verified": true, "helpfulness": "2/5", "author": "Art Denzau"}, {"rating": 5.0, "review": "As I said its an awesome little dongle for a rock bottom price. A win for google. The beta browser is great as well.", "verified": false, "helpfulness": "0/0", "author": "R.Johnson"}, {"rating": 5.0, "review": "Simply awesome dongle, we use it in the office for music, videos, conferences, ALL WIRELESS! :D It replaced HDMI Cable and increased our interaction betweet the team!", "verified": true, "helpfulness": "0/0", "author": "Josue Basurto"}, {"rating": 4.0, "review": "This is a cool little piece of hardware. It will be better yet when more applications and video sources are supported. But it is very cool to select a movie or show from Netflix on my phone, then use the phone to tell Netflix to send the stream directly to the TV without and further use of phone resources.", "verified": true, "helpfulness": "0/0", "author": "jmax"}, {"rating": 4.0, "review": "The Google Chromecast does what it is suppose to do.  I am able to view Netflix on my non-Wifi TV along with a few other Google apps and Chrome.  Chrome can be used via a desktop or laptop.  It is great.  I can not compare it to a streaming device because it does not have as many apps but it will do for now.  Hulu Plus has currently been added so this is a plus!!I highly recommend this item. I really love the fact that I have received 3 months free of Netflix service.I am very pleased with my purchase.  Make sure you update your Chromecast when it is available to keep the app running smoothly.", "verified": true, "helpfulness": "0/0", "author": "Pbrk \"I enjoy reading and listening to books.  I am always looking for something great to read.\""}, {"rating": 5.0, "review": "Ho brah. Dis one mean buggah. I watch choke tv. Shootz googles. I go stream mean shows and my aunties and uncles think its da kine.", "verified": true, "helpfulness": "0/2", "author": "Hamid"}, {"rating": 5.0, "review": "Works as advertised, excellent quality video, had to wait a couple of weeks for delivery due to high demand for this device.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Gregory Jr"}, {"rating": 5.0, "review": "It's only $35 and it works on my Android phone & tablet, it even works on my iPhone 4 as well! I just need to cast a YouTube video clip onto my \"dumb\" TV (which was bought about 5 years ago), then I can do other things on my iPhone. Amazing.", "verified": true, "helpfulness": "0/0", "author": "L. Vu"}]