[{"rating": 5.0, "review": "Please w/ the product and purchase.", "verified": true, "helpfulness": "0/0", "author": "Kailash Gangar"}, {"rating": 5.0, "review": "LOOOOVE it!", "verified": true, "helpfulness": "0/0", "author": "alex ivaschenko"}, {"rating": 4.0, "review": "These work well.  It's nice since our older \"smart\" tv's are getting a little slow and buggy in their OS's.  The Chromecast lets us bypass them.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 5.0, "review": "This has to be one of the best little thingies around, especially if you use Android devices. Even if for casting alone, I would give 5 stars - assuming that your mobile devices support all the functionality. Casting from my desktop, phone, or tablet is awesome.Regardless, easy way to get NetFlix, YouTube, and other popular content on your big screen.", "verified": true, "helpfulness": "1/1", "author": "bl3h"}, {"rating": 1.0, "review": "Not really worth it. Connection via WiFi constantly drops off. A definite lag in video speed with audio. If your WiFi router is literally next to your television then this may work properly. Simply using a microwave oven while you're streaming a movie the Chromecast gets knocked out.", "verified": false, "helpfulness": "3/6", "author": "T. Sal \"T. Sal\""}, {"rating": 5.0, "review": "Easy to hook up and use to watch Netflix from my tablet.", "verified": true, "helpfulness": "1/2", "author": "ilovetoshop \"ilovetoshop\""}, {"rating": 5.0, "review": "Very nice product. Simple to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Randall Washenesky"}, {"rating": 5.0, "review": "I don't know what to say. It is amazing...With my nexus 9, I can cast screen to the TV so no matter which app support chomrcast or not, I can cast what I want on the tablet to HDMI screen! And the price is so cheap.", "verified": true, "helpfulness": "0/0", "author": "Jacob Chai"}, {"rating": 5.0, "review": "Love this thing! I have a very nice TV, but it unfortunately is not smart. So I got this to make it seem much smarter. Great value when you consider the difference between the price of a standard flat screen TV and the price of a smart TV. I love being able to sit back with my phone or tablet and send programs to my TV. If your TV is like mine, pretty but dumb, this is the thing to buy. It will make your dumb TV seem very smart.", "verified": true, "helpfulness": "0/0", "author": "Christoph J."}, {"rating": 4.0, "review": "Love it but I think/it only reads mp4 formats", "verified": true, "helpfulness": "0/0", "author": "heather  griego"}]