[{"rating": 4.0, "review": "I love it and it is very useful", "verified": true, "helpfulness": "0/0", "author": "fida barakat"}, {"rating": 4.0, "review": "Only gripe I have is when I cast screen the sound doesn't match up to the picture.", "verified": true, "helpfulness": "0/0", "author": "Christina"}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "Tommy Freasier"}, {"rating": 5.0, "review": "Love this little guy.  Takes me where I want to go and opens up a world without these crazy cable bills.", "verified": true, "helpfulness": "0/0", "author": "D. S. Poe"}, {"rating": 5.0, "review": "Some kinks here and there, but works amazing.", "verified": true, "helpfulness": "0/0", "author": "Saul Rodriguez"}, {"rating": 5.0, "review": "Works great! Paired with my Samsung tablet and my wifi router easily. Comes with the USB power cord and has the AC/DC plug as well, no need to purchase one. The cord is plenty long if your outlet is within 3 feet or so (my tv doesn't have a USB so I have to use the AC/DC adapter) I actually like this way better than my roku that I have in the other room of my house, I highly recommend over roku unless you have cable that gives you the sign ins to use the better channels like history, syfy, discovery etc, if your main use will be Netflix, pandora, screen mirroring this is perfect! You can also put you tablet or phone to sleep while using chromecast so it's not draining your battery!", "verified": true, "helpfulness": "0/0", "author": "SwensonG"}, {"rating": 5.0, "review": "Excelente.", "verified": true, "helpfulness": "0/0", "author": "Martin G."}, {"rating": 5.0, "review": "start up was a mess.  need better visuals as to how get started", "verified": true, "helpfulness": "0/0", "author": "Lawrence Carter Sr. \"L. Carter Sr\""}, {"rating": 5.0, "review": "must have product, like it.", "verified": true, "helpfulness": "0/0", "author": "moien"}, {"rating": 5.0, "review": "If you don't already have one of these you should buy it now. We used to use my ps3 for Netflix and YouTube but since we picked this up I never need to turn my ps3 on anymore. It's super easy to use from our phones and I have coonected Google to a) of my pictures as well so I can pull up almost anything on my TV now. This is a fantastic buy", "verified": true, "helpfulness": "1/1", "author": "Sean H"}]