[{"rating": 5.0, "review": "Google really surprised everyone when it came out with the Chromecast. Although it is marketed toward college students, it really doesn't work well with networks that require login/password combos.Pros:Works beautifully with the approved apps: Netflix, YouTube, HBO Go, etc.Can be run by almost any device in your house (phone, tablet, computer)Seamlessly allows anyone on the same network to send videos (great for parties)Cons:The pulsing light is REALLY BRIGHTStill a short list of apps that are approved to work with itA more seamless way to play videos that are downloaded would be appreciatedFor the price, you won't find anything that compares and works with so many other devices. Keep it up Google!", "verified": true, "helpfulness": "0/0", "author": "RBrandon \"Grimm147\""}, {"rating": 2.0, "review": "Google keeps nuking any app that allows local file streaming from a tablet or computer to the chromecast. If you plan to root it, do it before you allow it to update, otherwise, it won't work.Otherwise a nice product, but the lack of streaming ability makes it much less useful. I think I'll probably just buy a roku.", "verified": true, "helpfulness": "0/0", "author": "AlvinTheNerd"}, {"rating": 5.0, "review": "This is a wonderful device set at a price that is easily affordable. Without question, Google has come up with something which represents the wave of the future.", "verified": true, "helpfulness": "0/0", "author": "joker"}, {"rating": 5.0, "review": "I actually purchased this item as a gift to a friend of mine, and he is so happy with this item!!", "verified": true, "helpfulness": "0/0", "author": "Shigetada N."}, {"rating": 2.0, "review": "Limited capabilities compared with Xbox 360, Roku and Apple TV.Would not work reliably with HB0 Go or Netflix, however it did work well for casting Youtube videos.", "verified": true, "helpfulness": "0/0", "author": "J. Gunter"}, {"rating": 5.0, "review": "Chromecast is amazing,  actually all Google items are amazing. So buy it,  don't try it. Google is better than the others.", "verified": true, "helpfulness": "0/0", "author": "DANUT RUGINA \"cocosatu\""}, {"rating": 4.0, "review": "LOVE IT!THERE IS A DRAWBACK, IT CAN ONLY CAST A FEW APPS.I CAN'T EVEN USE IT WITH MY PRIME MEMBERSHIP..... COME ON GOOGLE UPDATE IT BEFORE I GO OUT AND BY APPLE TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It streams Netflix and YouTube and also chrome tabs from a computer but it cannot stream my camera videos from my nexus 4?This needs to be fixed!", "verified": true, "helpfulness": "0/0", "author": "Westley Paynter"}, {"rating": 5.0, "review": "We use this almost everyday.  Was GREAT for the Christmas party.  Everyone could share there pictures and videos.If you don't have one.- GET ONE", "verified": true, "helpfulness": "0/0", "author": "Jacki A Farrier"}, {"rating": 5.0, "review": "Inexpensive, does what it says it will do, easy to use. Not much else of importance to say about it.", "verified": true, "helpfulness": "0/0", "author": "Peter K . Loeb, Jr."}]