[{"rating": 4.0, "review": "Works well.", "verified": true, "helpfulness": "0/0", "author": "Hanouds"}, {"rating": 5.0, "review": "Works perfectly on android and PC alike. The only trouble I had with set up was a feature of my router that makes each device invisible to each other. 5 minutes of googling and fixed!", "verified": false, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Ray W."}, {"rating": 5.0, "review": "I didn't buy it on Amazon but instead went to Wal-Mart to buy it. I wanted to try it as soon as possible and I'm in love!!! The setup is easy and it works like a charm. It has a beta mode that allows you to cast your phone screen onto your tv and now I can play games and let others watch me. Also I can now use some apps that aren't capable with the chromecast because of the cast screen mode. I highly recommend this and for under $40( 30 dollars on Amazon, 35 in stores) it is the most amazing thing out there. I don't own the roku or Amazon tv or the Apple tv, but I do own a chromecast and I'm happy that I got this instead of the other ones.", "verified": false, "helpfulness": "1/1", "author": "Francisco A."}, {"rating": 5.0, "review": "Great product. Very easy instalation!", "verified": true, "helpfulness": "0/0", "author": "Barbara S. Siegfried"}, {"rating": 5.0, "review": "We love our new Chromecast! This is the first streaming device we used. Tried it and a Roku on our tvs. Didn't like the Roku and sent it back. But, we love this Chromecast! Makes streaming so nice & easy!", "verified": true, "helpfulness": "0/0", "author": "Rebecca"}, {"rating": 4.0, "review": "Plug it in and watch, that simple. Samsung Galaxy S5.", "verified": true, "helpfulness": "0/0", "author": "AMK \"TK\""}, {"rating": 5.0, "review": "Didn't want to run a cable for a TV in the kitchen area, and this solved everything. Amazon Prime, YouTube, Netflix, if you can stream it, you can play it. My phone has a bit of pixelation, but from the Tablet or PC it's amazing.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "0/0", "author": "KENELLIS"}, {"rating": 4.0, "review": "Works great, miss the remote feature.", "verified": true, "helpfulness": "0/0", "author": "L. Schreiner"}]