[{"rating": 5.0, "review": "For everybody that has written a review for what the product is not, I wish to counter them with what the product is.  But let me first start by saying: no, it isn't a Roku.  If you are wanting a Roku, buy a Roku.  What Google claims the Chromcast does, it does well, especially for the price, and I can't wait to see what things it will do next.  I have tried all the features on it and I am pleasantly surprised that everything worked just fine.  Netflix, Youtube, Movies, and Music all worked just fine.Setting up the device was slick.  I used my Nexus Galaxy phone and it connected right up with our home network.  I haven't had one problem with connectivity on my phone, my wife's IPhone, or our IPad.Future apps look promising and it is only going to get better.  One app that I would love to support for but won't happen any time soon is Amazon VOD.Some people will say that you can get a Raspberry Pi for the same price or a Beagle Bone Black for $10 more and it will do everything this does and they are right.  But there is a learning curve associated with the process and it doesn't run as smooth as this does.  So unless you are a geek and don't tend to get frustrated when you can't figure something out with electronics, get the Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Blaine A. Edwards \"Blaine Edwards\""}, {"rating": 4.0, "review": "Works Great.  Cant wait for more programs to work  with it!  easy to hook up! love watching netflix, you tube, hbogo(with chrome on my pc), etc.  it reallly works well.", "verified": true, "helpfulness": "0/0", "author": "cbaker"}, {"rating": 4.0, "review": "I like this and it comes in handy when you want to watch long videos on YouTube. It takes a little bit of time to start short videos which makes it a waste of time.", "verified": true, "helpfulness": "0/0", "author": "lalov1"}, {"rating": 4.0, "review": "At least for now, Google Chromecast has solved our frustrating issues with Netflix Instant.  We have been using a particular Sony Blu-Ray player for Netflix which has received lots of negative reviews for Netflix streaming.  Netflix programming constantly stopped and buffered, and picture quality was horrible at times.  Tried contacting our cable company, Netflix and Sony - everyone blamed each other.So when this little device arrived I bought it, really just for using our HDTV as a monitor.  But the Netflix streaming has been flawless so far, and the picture far better.  Granted I've never tried Roku, Xbox, etc. but it certainly blows away the Sony Blu-Ray and has saved me a lot of aggravation!Since I'm now using my iPad/iPhone for Netflix the interface needs some improvement (on Netflix's end).  But so far, I'm a happy customer.", "verified": false, "helpfulness": "0/0", "author": "Craig F. Dominey \"cdominey\""}, {"rating": 5.0, "review": "Just got this in yesterday and I was surprised at how brief the instructions were, it actually worried me a bit. Turns out there was no need to worry, you basically plug it in, download the app and hit OK. It was literally that easy. The only downside is that there aren't many apps that support it yet, but I'm sure it won't take long before everyone adds a Chromecast button. I'm playing Netflix on a TV now that doesn't even have a cable connection, so smooth, all technology should be this easy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Dennerman\""}, {"rating": 5.0, "review": "I was excited to hear about the Chromecast,but, I wasn't sure if it would be compatible with our electronics; it was EASY to order, EASY to figure out and even EASIER to use. I can't wait to see what will be added in the future!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I was very excited about the chromecast, it was certainly easy to install, but the delay, and buffering, i couldn't legitimately watch anything. With program updates, this will be a great item, and at a great price point", "verified": true, "helpfulness": "0/2", "author": "MHoppy \"Margaret\""}, {"rating": 2.0, "review": "I hate to throw a towel on all the wonderful reviews on this item, but I found it to be a dud as far as I am concerned. I have a very strong internet connect with high speed cable. I managed to get through the setup with no real problems, but when I tried a YouTube video it hung up and just did the typical spinning wheel in the middle of my TV. Then I tried a Netflex movie....same issue. I really don't see the big attraction so far with the Chromecast as my Apple TV performs just great on the same network. I get NetFlix and YouTube. I found the Apple TV to be much more stable than even the Roku players. Roku does support Amazon Prime movies. The Chromecast is really limited and even the $35 cost seems low, but not worth it to me if I had to return it. There are probably many people waiting for my return so it can get back into the stock of back ordered media players. I do really appreciate Amazons returns policy if the customer does not find the product to be operational or defective.", "verified": true, "helpfulness": "1/1", "author": "Thomas N. Gilmore"}, {"rating": 1.0, "review": "My recent purchase of this item is a great disappointment! After many tries it finally loaded to my computer and to the TV. Now it says it is ready to \"cast\". Not only does it not tell me what casting is but there is absolutely no one to ask. It is now hanging off the back of my TV - unusable.  Horrible customer service as well as a junk product.", "verified": true, "helpfulness": "2/9", "author": "Mark Sauer"}, {"rating": 5.0, "review": "Chromecast makes it possible to pause a YouTube video on your TV from the lockscreen of your 2+ year old smartphone.", "verified": true, "helpfulness": "0/0", "author": "Brandon S Wilson"}]