[{"rating": 5.0, "review": "Chromecast is awesome! Makes it really easy to stream stuff on your big screen. Hooked one up at my Parent's place and it's easy enough for them to use as well.", "verified": true, "helpfulness": "1/1", "author": "Steven P."}, {"rating": 5.0, "review": "Simple and quick setup. Works great and my router is two floors above where I am using it! I would recommend to anyone trying to get more out of their smartphone (I'm using Chromecast on my iPhone). I've used it with YouTube, Pandora and Netflix so far", "verified": true, "helpfulness": "1/1", "author": "Vincent Melapioni"}, {"rating": 3.0, "review": "I've used this unit for awhile now and it's just OK. The product is not as seamless as the advertising would lead you to believe. Unless your TV has a USB connecter built in, you will need a power source nearby for this unit to work. The advertising shows you just plug it into your TV, which is misleading. You also need the Chrome browser to \"cast\" your video, although I have come across some applications that also allow you to cast a video from the application itself. My biggest disappointment is although I have a very strong WiFi signal, the video cast can take some time to load and I do have drop-outs during play. Upon playing the video in a different browser, it played seamlessly, so I know it's not a \"caching\" issue, it has to be the signal from the WiFi to the Chromecast unit. When it works, its great, when it doesn't, its frustrating. The caveat is, if the website you cast from is slow, or has frequent pauses in play, that is what you will receive in the Chromecast unit too so that is not the fault of Chromecast (that is why I made sure the problems I experienced were not the fault of the Internet or my WiFi). The packaging is very well done,instructions are well laid out, my shipping took a little longer than anticipated. 3-Stars", "verified": true, "helpfulness": "0/1", "author": "Stevedude"}, {"rating": 4.0, "review": "Cool - older TV now smart", "verified": true, "helpfulness": "0/1", "author": "Ryan Maurer"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/1", "author": "Sasho Tanevski"}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/1", "author": "Mario"}, {"rating": 5.0, "review": "Excelente produto recomendo a todos.", "verified": true, "helpfulness": "0/1", "author": "Robson Cesar Mioto"}, {"rating": 5.0, "review": "I watch what I want! Very good!", "verified": true, "helpfulness": "0/1", "author": "Carlos Alberto Rey \"drcarlosrey\""}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/1", "author": "ilya"}, {"rating": 5.0, "review": "Incredible", "verified": true, "helpfulness": "0/1", "author": "Thiago Wunder"}]