[{"rating": 3.0, "review": "Seems like it has to reboot and has issues connecting to the WiFi. When it is connected works fine.", "verified": true, "helpfulness": "0/0", "author": "Erin R Glock"}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "guido mendoza"}, {"rating": 5.0, "review": "Great item. Very user friendly, so easy to setup. Very convenient tool to have. Watch online content like Youtube, Netflix, Hulu, or  just browse the web from on your laptop, tablet, or phone on your bed, futon or whatever. Sooo convenient and easy. Good stuff google.", "verified": true, "helpfulness": "0/0", "author": "Javier"}, {"rating": 5.0, "review": "We use Chrome for livingroom dance parties via YouTube and to watch shows, reviews, docs, ect. Use it almost daily", "verified": true, "helpfulness": "0/0", "author": "Charles Arthur"}, {"rating": 4.0, "review": "It needs a STRONG wifi signal...had to buy a booster, but yeah, I dig it.", "verified": true, "helpfulness": "0/0", "author": "Wayne H. Swan \"Obi-Swan\""}, {"rating": 3.0, "review": "I purchased this with one purpose only, be able to stream from my tablet to my tv and this don't work as expected, just be aware of it", "verified": true, "helpfulness": "0/1", "author": "Tatiana C. Machado"}, {"rating": 5.0, "review": "Chromecast is amazing. So many apps now support chrome cast, and with a PC you can pretty much cast anything from your PC. It's more than worth the 35 bucks it costs.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Very few formats it can play and link between my cell phone and the chromecast very slow", "verified": true, "helpfulness": "0/0", "author": "kenkendsm"}, {"rating": 5.0, "review": "We love it!  Works awesome!  We put some in our guest rooms where there is no cable!", "verified": true, "helpfulness": "8/14", "author": "Tim Talley"}, {"rating": 5.0, "review": "I love it! So much so that I am buying 2 more.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]