[{"rating": 4.0, "review": "I just received my fire TV and was eager to give it a try. The initial setup was very simple and it started right up with a video with instructions. It needed to download a software update at first and because I selected a wireless network that was not working (it automatically prompted me to select one) it stalled and there was no way to skip that step using the remote control to go back and select the correct network (there are no controls on the unit itself). I unplugged the unit and than plugged in a wired connection and plugged the power cord back in (there is no \"off\" switch, you have to unplug it to turn it off!!). After a couple of tries it detected the new connection and downloaded the software update that took several minutes.  The startup instructions are minimal and direct you to the support website (no tech support number given to call).That's when I noticed my internet speed had crawled to a stop on my home computer connected to my dsl wireless network. I tried to download a tv show and it gave me an error message that my connection speed needed to be at least 800 kbps to stream shows without pausing. That surprised me because my connection speed is usually above 2000. When I ran a speed test on my computer it basically would not run or gave me a speed of under 200 kbps! After power cycling my modem and routers twice it still was dead slow, so I unplugged the fire TV (remember no off switch?) and tested my speed again. Sure enough it jumped back up to over 2500 kbps. There is no note in any of the fire TV instructions or website about this issue. I left the fire TV on overnight hoping that the connection speed issues were temporary as it had to download content during the initialization. When I checked it the next morning the fire TV had turned itself off but then I had to unplug it and plug it back in to turn it back on! At least the connection speed on my computer was back to normal so be ready for that during its initialization. The lack of a power switch is mind boggling, especially if it powers itself off for power saving mode! I haven't had a chance to watch a movie yet so I will post updates as I use the device more.Follow up:  My initial rating was 2 stars but I have increased it to four stars based on further use of the device. I discovered that simply pressing any remote button \"wakes up\" the device. Also, the broadband issues resolved themselves by the following morning so that must have been an initialization issue. So far the device has worked well. I've only used a PS3 hooked up to the TV for streaming so that's all I can compare it to. So far it has been very easy to use although the voice feature doesn't always work well.", "verified": true, "helpfulness": "4/7", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I own two Roku 3's but picked this up right when it was announced, because I was looking for a better Plex client.  The box is extremely quick compared to the Roku and gives me everything that I need with the exception of HBO Go (which I'm sure will be coming soon).  The one drawback to the box is that there is no IR sensor so that you can use a Logitech Harmony remote or another universal remote.  There is a workaround to this however.Buy the Ortek VRC-1100 http://www.amazon.com/Ortek-Windows-Infrared-Receiver-Ultimate/dp/B00224ZDFY/ plugin the USB IR sensor to the Fire TVs USB port, and you have IR functionality with your Fire TV.  The only button that isn't available is the \"Options\" and \"Voice Search\" button.I'm still hoping that Amazon comes out with their own IR dongle, but in the meantime this works well, and makes the box a suitable replacement for the Roku 3 for me.", "verified": true, "helpfulness": "2/2", "author": "KB Creek"}, {"rating": 5.0, "review": "Nothing better at this price point. Have owned a few roku and a chrome cast nothing else comes close for the money.", "verified": true, "helpfulness": "0/1", "author": "Tom"}, {"rating": 5.0, "review": "I am coming from a Boxee Box which has been abandon. So pretty much there is no support for this box anymore. The main function for my Boxee Box was to play my \"local content\" such as MKV files over my network. My Boxee Box played all my \"local content\" flawlessly. Also since I subscribe to Netflix and MLB.TV, this was great box for its time. However with the lack of support, and MLB.TV not being supported on my Boxee Box anymore, I needed a new internet streaming box that had MLB.TV.I was close to buying a Roku 3 until this was announced. The superior specs is what first drew me in since my friend's Roku 2 seemed clunky and slow. Only thing that made me hesitate was the fact that the Roku at the time of this review, has more apps selections even the one I want MLB.TV which is not on Fire TV yet but coming. At the end what made this choice a slam dunk was the fact that XBMC runs flawlessly on this device. It plays 1080p MKV files without a hitch. XBMC alone is a reason enough to upgrade including Netflix Super HD which my Boxee Box does not have. Combine this with XBMC, Netflix coupled with Unblock.us makes living as a \"cord cutter\" enjoyable.Pros-Fast responsive UI-XBMC streams local content-Hardware best value for $100-\"Network Effect\" Meaning popularity/future community development-Lowest cost HTPC $100 (Cannot find any HTPC that competes at $100)-Amazon backed/supportCons-MLB.TV (Reason I bought but it's coming)-Voice search only for Amazon content-No hardware or software power button(Yes - no way to turn off unless you plug out the power cord)It would be irrational to purchase any other internet streaming device but the Fire TV. The fact it can run XBMC which can play all your \"local content\" and also stream other \"add-on\" video, makes this already the best hardware device of 2014 given its $100 price.", "verified": true, "helpfulness": "10/12", "author": "Buyer 2033"}, {"rating": 1.0, "review": "stuck in software update loop, after 12 hours of it connected to my network still won't get past software update....will return tomorrow", "verified": true, "helpfulness": "20/30", "author": "DANIEL BAUER"}, {"rating": 1.0, "review": "Roku2 has HBOgo and the best part is you can connect headphones to the remote control. A feature that Amazon Fire doesn't. My husband loves to watch TV in our bedroom till late hours and I just love that he can just plug in his headphones and I can sleep in peace. A total marriage saver!!!!", "verified": false, "helpfulness": "4/40", "author": "Ana Burton"}, {"rating": 1.0, "review": "I disappointed with this purchase and would be returning tomorrow. Don't waste your money ! More capable devices are in market both in terms of technology and content", "verified": false, "helpfulness": "4/42", "author": "Sachin"}, {"rating": 2.0, "review": "Very clunky interface. If not using the voice search, you must navigate mostly along one long horizontal menu. Get used to using the back button. No cross app search like my google tv is the killer, and no voice search support outside of the home screen. Searches from the home screen only net you amazon results, with no filter for prime.", "verified": true, "helpfulness": "6/10", "author": "Plim Forte"}, {"rating": 5.0, "review": "Prime interface rules.Remote is excellent quality.Never had the voice recognition not workperfectly.S*** is magic, definitely a good replacement for my roku 3", "verified": true, "helpfulness": "2/2", "author": "Alex"}, {"rating": 5.0, "review": "I was going to buy a smart TV but with this device you don't need a smart TV because this turns your TV into a smart TV BEST THING I EVER BOUGHT....A+++++ DEVICE EVER!!!!", "verified": true, "helpfulness": "3/4", "author": "Dawn"}]