[{"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Gunnut"}, {"rating": 5.0, "review": "Work's Great", "verified": true, "helpfulness": "0/0", "author": "George L Parry Jr"}, {"rating": 3.0, "review": "Works on the HDMI port of my Samsung TV with Netflix and Youtube although at times I do get frequent interruptions in the program reception. I believe that these interruptions are caused by Chromecast rather than my Internet Service Provider due to the fact that I seldom experience them when watching Netflix diredtly on my Dell Inspiron laptop computer.", "verified": true, "helpfulness": "0/0", "author": "George Free"}, {"rating": 4.0, "review": "I had to reset it because it wasn't properly detecting my wireless, but after that it started working fine. I don't really have much to say about it. After I reset it, I plugged it in, set it all up, and was able to stream from my computer/iPhone without any further hassle. There are some issues with streaming from other places beyond YouTube, or even streaming from local video files, but I know how to find addons or troubleshoot solutions to circumvent that problem, but it would be nice if there was a reliable catch-all program or addon that could cast from ChromeCast. Regardless, I'm content with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Grim Meteor \"SoldierMorty\""}, {"rating": 1.0, "review": "You get what you pay for.  Returned it, spent more money on a Roku 3, which is much better.", "verified": true, "helpfulness": "0/1", "author": "Stormville Cooker"}, {"rating": 5.0, "review": "Good deal, works as expected", "verified": true, "helpfulness": "0/0", "author": "Dave D"}, {"rating": 4.0, "review": "Easy to setup!  & Easy to use!  No Problems at all!", "verified": true, "helpfulness": "0/0", "author": "Edward G."}, {"rating": 5.0, "review": "Excellent product as expected", "verified": true, "helpfulness": "0/0", "author": "lxherrer"}, {"rating": 5.0, "review": "Fantastic product, a must have for any household that streams.", "verified": true, "helpfulness": "0/0", "author": "John Luckenbach"}, {"rating": 5.0, "review": "Very happy with my purchase.. It is a usefull and cool gadget!", "verified": true, "helpfulness": "0/0", "author": "SARA ALVAREZ"}]