[{"rating": 1.0, "review": "Its too difficult to use with Apple products, perhaps impossible.", "verified": true, "helpfulness": "0/1", "author": "Dennis J Omeara"}, {"rating": 3.0, "review": "Product arrived on time. Disappointed because it disable itself and I have to connect it to the wifi.", "verified": true, "helpfulness": "0/0", "author": "Eno N."}, {"rating": 5.0, "review": "Works well great service.", "verified": true, "helpfulness": "0/0", "author": "pcw"}, {"rating": 5.0, "review": "Very easy to setup only takes a minute. Cast your phone laptop or tablets screen onto your tv. Make sure you have WiFi!!!!", "verified": true, "helpfulness": "0/0", "author": "Crystal"}, {"rating": 5.0, "review": "I'm very pleased with my product thank you", "verified": true, "helpfulness": "0/0", "author": "Mrs Sheba \"Queenob1\""}, {"rating": 5.0, "review": "Exceeded my expectation. I use it for slideshow presentation as well as Webcasting. This device will only work through Google Chrome browser on my Windows 7 OS. ScreenCast from my Android Device. Google Extensions allow me to cast to two separate Chromecasts simultaneously (not tested yet).", "verified": true, "helpfulness": "0/0", "author": "Paul L."}, {"rating": 5.0, "review": "perfect. Everything we wanted. Only wish we could stream Amazon prime, but I guess you win some you lose some.", "verified": true, "helpfulness": "0/0", "author": "RBGT"}, {"rating": 5.0, "review": "I Don't know how I survived with out it! I'ts great for viewing streaming video and showing slideshows from my computer. Now everyone can watch it on the TV instead of crowding around the computer.", "verified": true, "helpfulness": "0/0", "author": "Redhead"}, {"rating": 3.0, "review": "It's not fair to compare this to Roku or Apple TV without putting the most significant feature on the comparison chart. Roku and Apple TV don't need a 3rd device to function. Chromecast is worthless without another internet device to connect to.Having said that, it has it's advantages. Being able to browse your device for the next cast while a cast is still playing full screen is a nice feature. I would give it four or five stars if it stood on what's truly unique about it and didn't compare itself to Roku or Apple TV.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We have owned it for nearly a year and we use it everyday. We love it, because we watch our favorite shows on tv and we also listen to music from our tv. The good thing is that the number of applications that connect to tv using chromecast is increasing.", "verified": true, "helpfulness": "0/0", "author": "Anna M"}]