[{"rating": 4.0, "review": "All are very well", "verified": true, "helpfulness": "0/0", "author": "M. Elbassir \"N. Elbassir\""}, {"rating": 5.0, "review": "Love my chromecast... since Christmas 2013 I have gotten 4 or 5 of these to give away or put on my tv. I use the mirroring function with Chrome on my chromebook. I try to tell everyone I know to get this instead of Apple TV because it's budget friendly and does pretty much everything an Apple TV could do. I don't have a large online collection of my own videos, mostly streaming off Youtube or Netflix. Also good for casting tv shows on TV without subscribing to cable. Honestly for $35 you have nothing to lose. One of them has broken but not really its fault... I had it bent so the hdmi connector fell off so I got another one. I'm a heavy user.", "verified": true, "helpfulness": "0/0", "author": "Katniss \"K\""}, {"rating": 5.0, "review": "Works great! My only complain is that I didn't buy it sooner.", "verified": true, "helpfulness": "0/0", "author": "Jose Encarnacion"}, {"rating": 4.0, "review": "Does the job.", "verified": true, "helpfulness": "0/0", "author": "Malcolm Campbell"}, {"rating": 5.0, "review": "I love it .thanks", "verified": true, "helpfulness": "0/0", "author": "aji"}, {"rating": 5.0, "review": "simply plug it and you tv is now a smart tv", "verified": true, "helpfulness": "0/0", "author": "A. VELASQUEZ"}, {"rating": 5.0, "review": "Great product, just slight lag.  Wish you could listen in with headphones", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "It's a great device! It makes watching all my Netflix and YouTube so much easier! I love it! Plus it shipped faster than I thought!", "verified": true, "helpfulness": "0/0", "author": "Edson"}, {"rating": 4.0, "review": "Works great.  Sometimes controlling it with your phone kind of sucks and you wish it just had a remote.  Other than that great invention I bought two!", "verified": true, "helpfulness": "0/0", "author": "Michael S"}, {"rating": 5.0, "review": "Best 20 some odd bucks I have spent in a long time.  This thing is great.  I can stream from my computer, android phone, and even an iphone.  This thing works great and takes up minimal space in an already cluttered entertainment center.  Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Pablo M. Cabrera"}]