[{"rating": 3.0, "review": "I tried setting this up on my desktop which doesn't have Wifi--fair enough.  I went to my laptop to set it up, but it doesn't support Linux.  I finally used my wife's computer with Windows to set it up using the downloadable app instead of the Web UI.  I have a Netgear 3700 wifi router that supports 2.4Ghz and 5Ghz.  Both are turned on with the same ssid and both have the same password.  Chromecast does not support 5Ghz, but when I configured it, it properly talked to the wifi signal from the laptop and I configured the correct parameters for it to talk to my wifi router.  It refused to talk to my wifi router.  I went through all the support posts including wifi opitons, client isolation, vpn and proxy settings, UPnP settings, IGMP, etc.  No luck.  My next step is to turn off the 5Ghz network altogether, run through the setup and hope it connects, and then turn the 5Ghz back on with a different password after it's configured.", "verified": true, "helpfulness": "1/1", "author": "Dr. Gregory A. Bolcer"}, {"rating": 2.0, "review": "Unless you travel a lot, I don't see the point of this. My Roku 3 loads much faster, has a friendly user interface, and free local content support. I sent the Chromecast back.", "verified": true, "helpfulness": "0/0", "author": "MLB"}, {"rating": 2.0, "review": "In many instances (especially with Amazon instant videos), the video is lagging or needs to switch to lower definitions. I often just switch back to watching the video on my laptop instead, out of frustration.", "verified": true, "helpfulness": "0/0", "author": "Jerome Helfft"}, {"rating": 5.0, "review": "FYI, box comes with HDMI extender (about 4in), power cord, USB outlet, and Chromecast.Functions great, easy setup, they are expanding the number of apps that work with Chromecast.  Recommend the best way to enjoy a smart(er) TV.Cheap, easy to operate, everyone can pitch in.", "verified": true, "helpfulness": "0/0", "author": "Arla McBeth"}, {"rating": 1.0, "review": "Installation instructions poor, when attempting to install on my laptop, I received many unrelated software notification that confuse the installation. As a result, I  spend much time unistalling the junk that is initiated by my attempt to install...Chromecast. So, there it sits connected to my tv unused", "verified": true, "helpfulness": "0/1", "author": "IRVING m PINCUS"}, {"rating": 5.0, "review": "The Chromecast is a wonderful device that just works out of the box. It's Google's answer to AppleTV. This device lets you \"cast\" media from your Android/iOS device, PC, or Chromebook to your HDMI display. You can cast YouTube videos, music, NetFlix/Hulu and more. Apps from the play store let you cast local media from your tablet or phone. There is also a Chrome plugin that lets you cast a tab or your whole screen from a PC or ChromeBook. Google also recently released the development software for this device which allows for all sorts of new things to enhance what this thing will do in the future. It comes with a power supply. It was very easy to setup. You'll be up and running in 5 minutes so long as you remember your WiFi password.", "verified": true, "helpfulness": "0/0", "author": "DanF"}, {"rating": 5.0, "review": "Love it, makes viewing online lectures so much easier. No more having to pull out the hdmi and move the whole computer and set it up by the tv just to watch a movie from the computer to the tv. The instant streaming works like a dream.", "verified": true, "helpfulness": "0/0", "author": "amber"}, {"rating": 3.0, "review": "It's an okay product. I think it had  been too hyped up for me. It does what it supposed to. Only issue was connecting it to WiFi , mine would kick it out and then the cast could not find it.  Looked for ways to solve the issue--which apparently happened to other users-- Google customer service was not helpful. Had to use the \"community\" to solve the issue. Since then it does what it's meant to do.", "verified": true, "helpfulness": "2/2", "author": "flormcubed"}, {"rating": 3.0, "review": "I got a Chromecast a couple months ago. It was easy to install, the software went on my HTC One phone and my iPad. I set it up first with the iPad, and it worked the first time. I have a newer TV with several HDMI ports so just plugged it in to one of them. Chromecast can turn on the TV and switch the input automatically and start playing what I have selected. I have a middle of the road cable internet plan, and only rarely has the broadcast slowed on me, it works perfectly 99% of the time.My only issues with it are what it seems to do to my regular cable. If I am watching cable, and not using the Chromecast, it seems to cause interference to the cable signal. It can be every 10 seconds or so, a spurt of distortion to the cable signal will occur. it scatters the pixels on the screen and sometimes even the audio gets scrambled too. It can be very annoying. The only way to stop it is to disconnect the Chromecast and unplug it from the power. When I do that, the cable clears up, with just a very rare scramble, which I figure is from the cable signal itself. I think I have used it long enough and experimented with it to be sure its being caused by the Chromecast.For the price, I think its worth it, and I just have to keep plugging it in when I want to use it. Hopefully they will work this bug out of it, and not cause problems.  I don't know if its just me, I have read a few comments on other websites where people were getting similar issues with it.", "verified": true, "helpfulness": "1/1", "author": "bppy"}, {"rating": 5.0, "review": "I like having the ability to stream HBO GO and Netflix from my phone straight to my TV with perfect clarity. I would definitely recommend to a friend.", "verified": true, "helpfulness": "0/0", "author": "K. morgan"}]