[{"rating": 5.0, "review": "great for old guy movie lovers!", "verified": true, "helpfulness": "0/0", "author": "vitamint"}, {"rating": 5.0, "review": "It's so nice to have some choices on what to watch on TV...without paying an arm and a leg to the cable company!I haven't played around with it much yet, but I see that Amazon is offering many, many options for my viewing pleasure.I think I've made a good investment!OOPS...Maybe not. Every time I want to use the Fire TV, I have to plug & unplug the box for it to work. It tells me it isn't \"connected\", yet I've changed nothing from one time to the next.Also, I signed up for Netflix, and my understanding was that I could view their \"stuff\" for free.  When I pulled up Orange is the New Black, it showed a variety of formats and their prices.  What's up with that?", "verified": true, "helpfulness": "0/0", "author": "ilovebooks"}, {"rating": 5.0, "review": "Worked great, minimal problem recognizing my wireless connection, but bypassed with ethernet.  Found many items we will watch, and the quality is very good on our TV.  Would recommend it.", "verified": true, "helpfulness": "0/0", "author": "D. Clum"}, {"rating": 1.0, "review": "Doesn't work at all. Returning it!!!!", "verified": true, "helpfulness": "1/6", "author": "joe lackey"}, {"rating": 5.0, "review": "Happy with it. Use it mostly with overseas Slingbox, after sideloading Slingplayer for Phones.", "verified": true, "helpfulness": "0/0", "author": "Daniel Ionescu"}, {"rating": 4.0, "review": "Fire TV rocks!  Wish there were more Prime shows,  though.", "verified": true, "helpfulness": "0/0", "author": "Bluejedi1970"}, {"rating": 5.0, "review": "Love the Fire TV it allows for HD Streaming even on slower home cable internet with speeds that max out at 2 Mbps over WiFi I would highly recommend this over other streaming boxes. I especially like the hardware specifications, it's overpowered in some respects which gives it room to handle future software and firmware updates for a long while and its very well priced. I don't see needing a new streaming device for a long time unless the 4K format becomes standardized and widely supported and used by everyone.", "verified": true, "helpfulness": "0/0", "author": "jimmy"}, {"rating": 2.0, "review": "I am not completely satisfied with Fire TV.  Some times I miss all the shortcuts and easy access of my Apple TV.  I hate that the device does not turn off if there is no response after a show (I some times fall a sleep while watching tv), I don't like that many of the apps only show previews of what can be seen on the specific channel, I was expecting to have access to shows like on Netflix.  Going through the PRIME movie selections takes forever.  It is not organized and it's always recommending movies I'm not particularly interested in.  The voice activation must have a problem with a southern accent because it rarely comes close to what I've said.  It was a big disappointment.  There is no real app selection.  I feel I can't say this enough, it is a big disappointment.", "verified": true, "helpfulness": "1/3", "author": "PortCityDeDe \"I am living my life in such a way that when my feet hit the floor in the morning, satan shudders and says, 'O crap, she's awake!'\""}, {"rating": 5.0, "review": "BETTER THAN NETFLIX", "verified": true, "helpfulness": "0/0", "author": "DOUG FINN"}, {"rating": 2.0, "review": "Even with amazon prime, there aren't enough movies. The movies that are available are either old movies or movies no one is interested in. The one positive side is that Netflix is conveniently available on the unit. Would I recommend it? Absolutely not!!!", "verified": true, "helpfulness": "0/3", "author": "SalsaPower1 \"B.B.B.\""}]