[{"rating": 5.0, "review": "Works awesome.  Hooked up my Android Galaxy to this guy and streamed no problem.  Even the screen mirror feature works great.Only thing to be concerned about would be Google collecting my data, but hell, they already do that anyways.", "verified": true, "helpfulness": "0/0", "author": "Mary Leonard"}, {"rating": 5.0, "review": "Works like a charm. Better bang for your buck while not trying to sell you anything!", "verified": true, "helpfulness": "0/0", "author": "Mcneri"}, {"rating": 5.0, "review": "Sends everything from my tablet to my tv.  Works great as long as wifi is working. Very easy setup, all you need to know is your wifi password.  Have had some connection and buffering problems, but that may be either my wifi or the channel I am using (Netflix, Hulu, Crackle, etc)  Now it has \"screen cast\" so I can see anything that is on my tablet, phone, or pc on the tv.  What more can you ask for?  With Chromecast you use your phone, tablet or pc as a remote.  If you want a separate remote (who needs another one ?!) you get one with Fire Stick and Roku Stick, but they are more expensive.  The other thing is that with a separate remote, you get the menu on the TV screen.  Sometimes with guests over, I don't necessarily need them watching where I'm navigating to, especially when I'm casting personal pictures or videos.  With the Chromecast, only you see where you are going on your tablet, phone or pc.  Came with a usb cable to power up from your tv, and a plug in power cord if you want to power up with your house electricity.  Also came with an extension in case your tv doesn't have a lot of space for it to plug in.  I purchased a second one for the bedroom tv, after researching Fire Stick and Roku.", "verified": true, "helpfulness": "0/0", "author": "Honestly..."}, {"rating": 4.0, "review": "sometimes it does not connect with ipad", "verified": true, "helpfulness": "0/0", "author": "raul"}, {"rating": 4.0, "review": "We have been having trouble playing Netflix on the TV with our BluRay player. I got tired of the frustration of the constant loading that we didn't experience with our computers, so I got the Chromecast.It is a piece of cake to install and set up on your computer or tablet. It is pretty cool that when I click on the icon on my computer or tablet, theTV goes on. The ultimate remote!...except you can't turn the TV off when you shut down Chromecasting. Can't have everything I guess. We no longer get the spiral of death as the movie \"loads\", or the message that the film is not available for streaming, or that our internet service is inadequate. All of these problems were regular occurrences in the past. No regrets.", "verified": true, "helpfulness": "0/0", "author": "Painter Judy"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Holy cow what have I been missing. Love this chrome cast. My wife loves putting her picks of the Grand baby on the TV screen and show them off she does. Awesome !!!!", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 4.0, "review": "GOOD PRODUCT", "verified": true, "helpfulness": "0/0", "author": "Vlamir"}, {"rating": 5.0, "review": "This thing realy helping me to teach students", "verified": true, "helpfulness": "0/0", "author": "Igor"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Beatriz Gutierrez"}]