[{"rating": 1.0, "review": "I purchased this a few weeks ago on impulse after reading a lot of hype on how great this device is.  Had I done the research I typically do before making an electronics purchase, I would have saved about an hour of setup and trying to figure out how to share videos I'd taken on my phone.  Instead, based on the description I read, I was led to believe that Google came out with a media player that gives you the ability to stream photos and music from your phone or computer. \"Genius!\" I thought.  I bought it believing it would be much easier than having to connect my phone to the TV if I want to show off my video footage on a larger screen for house guests!  Nope.  Apparently, Chromecast only allows a certain number of applications to work with the device.  Tonight, after actually doing the extensive research I should have done initially, I found that it is possible to stream local videos IF I upload them to youtube first.  But that, to me, is a PITA.  To add insult to injury, I found that there was a way to stream local media through an app called Allcast, but Google blocked it from streaming to Chromecast.With Chromecast's restrictions paired with the limited application support, I can't see any good reason to use this for anybody who has a WDTV Live, Roku or any other streaming device.  Because fortunately, Allcast (and likely other apps) does stream local media to these devices without having to jump through a bunch of Google's hoops, rendering the Chromecast useless and a waste of money.", "verified": true, "helpfulness": "0/0", "author": "JM"}, {"rating": 1.0, "review": "Bought ours from Walmart. Took it home and tried over an hour to get it to work. Followed instructions (not much info provided with the item so I had to surf the Web for actual answers), made sure all cords were plugged in, lights were blinking, and still it never came up on our TV. Returned it to Walmart the next day. Very disappointed.", "verified": false, "helpfulness": "0/1", "author": "Ignacio Blade"}, {"rating": 2.0, "review": "can only stream online media.cant (or can, but it cost money) to stream local media from your own computer.", "verified": true, "helpfulness": "0/0", "author": "noam"}, {"rating": 5.0, "review": "chromecast is easy to set-up and works great.netflix works great,i can get all the movies & shows i like & no commercials.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is undoubtedly the niftiest little gadget I've purchased in years.  It does everything that was promised with no drama and very little delay.  It was simplicity itself to install and set up, and my TV now doubles as my personal movie theatre.  What's not to like?", "verified": true, "helpfulness": "0/0", "author": "frank smith"}, {"rating": 5.0, "review": "they're geniuses at google. just need more apps and sometimes it disconnects and i have to restart my laptop (and all my tabs) to get it started again. but those are small inconveniences compared to what it offers. i can't even remove 1 star coz for $35, it's really a great value.", "verified": true, "helpfulness": "0/0", "author": "irsh"}, {"rating": 5.0, "review": "I bought this for my girlfriend and she adores it! I was joking with her because of all of the things that I bought her for Christmas, this is her favorite toy:) It's like when you go to the pet store and buy your pets $100 worth of toys and they still want to play with your socks and underwear! Lol.", "verified": true, "helpfulness": "0/0", "author": "Kristy C. \"Kristy\""}, {"rating": 5.0, "review": "One of the best investments I ever made. 35 dollars it's definetly worth it. Buy it don't hesitate. Worth it", "verified": true, "helpfulness": "1/1", "author": "kejdi sulaj"}, {"rating": 5.0, "review": "This was the best buy of 2013 bar none, and it works even better than I expected.....Get it when you get the chance.", "verified": true, "helpfulness": "0/0", "author": "Gregory Reed"}, {"rating": 1.0, "review": "It drops connection to the tv often. I got caught up in the price but am still disappointed in the ability to play my screen and the native app available.", "verified": true, "helpfulness": "0/1", "author": "Cameron Watson"}]