[{"rating": 4.0, "review": "Although slightly miffed none of the images or commericial show the USB power tether that connects to the actual player, the player works very well. So far I have only connected my laptop to watch CBS shows, and they come through with little delay or other problems.  Set up is pretty slick. Plug in the player in the HDMI port, then plug in the connect USB to a power source, and the device automatically starts up, showing a code and a URL link to enter on your laptop or other device. Just go to that URL, enter the code, download the app and it adds a little icon in the right corner of your brower. Click it and you are connected.  Pretty easy. Obviously you need a subscription to Hulu plus / Netflix subscription to take full advantage of the player", "verified": true, "helpfulness": "0/0", "author": "Tom & Marilyn"}, {"rating": 1.0, "review": "I plugged the device to one of the HDMI Input socket of my Samsung Led TV and set it up according to the given instructions. It connected to my home network and I can see Chromecast on the TV Screen. The screen covered with a photo and it changes after awhile with a different photo. It says in the instructions that you have to use your smartphone or your laptop to download the Google TV Application which is called \"Chromecast Apps\". I did it first with my Iphone 5s and during the connection process to the Chromecast on the TV it said \"Sorry we do not support this device yet\". I tried it secondly with a LG Android Phone, this time it did not connect also saying \"No Chromecast device is found to be connected\". I tried this operation several times changing the HDMI ports etc. After the continuous failures I decided to try my son's Macbook Pro to download the Chromecast Apps and to connect to the TV but the same result. It says \"No Chromecast device is found to be connected\".I am trying to reach to the relevant section of Google for some help, sending feedback but not a single help yet. Probably I will return this Item to Amazon after some more tries!", "verified": true, "helpfulness": "1/2", "author": "N.Ugurel \"Necdet\""}, {"rating": 5.0, "review": "I needed something to stream video and tv from my iPad.  I purchased Apple TV for $100.00 and then found out about Chromecast.  I'm glad I didn't open the Apple box because I returned it right away.  Chromecast works great for what I need at 1/3 the price.  It will be even better when they add more apps.", "verified": true, "helpfulness": "0/0", "author": "Reviewer \"golf and go\""}, {"rating": 3.0, "review": "Product installation seemed to be progressing well, but failed to mention that it also needed Chromecast extensions. seemed to add on superfluous software.", "verified": true, "helpfulness": "0/0", "author": "Robert Vos"}, {"rating": 5.0, "review": "I love this gadget . I just ordered another one . It took less than 5 minutes to set up and I was casting a tab to my tv while doing something else on another page. .Its  better than using an HDMI cable which limits mobility in this wireless age.. I stream all of my tv content from the internet ,which is the new way to watch tv,therefore eliminating cable. GET THIS GADGET. YOU WILL NOT REGRET IT.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Hoping to have few more apps support for the. Extendable cable is not working as expected but overall its good.", "verified": true, "helpfulness": "0/0", "author": "kiran"}, {"rating": 2.0, "review": "Only streams specific apps, big let down. Apple TV is better definitely going to get that instead it can make your tv a second screen.", "verified": true, "helpfulness": "0/0", "author": "Christopher Folck"}, {"rating": 5.0, "review": "Works flawlessly! Using my galaxy s4 and the Netflix app i can stream 1080p to my flat-screen without any interrupts. All the apps work great with no audio/video sync issues.  Local/ downloaded content was tricky but i found a few ways that currently work pretty well! Using the avia app on galaxy s4 + windows media center you can stream any supported format like .mp4 or .avi to the chrome cast with no issues just like with netflix!  Now for unsupported formats you need Google chrome browser + an extension called Google cast. It lets you mirror anything inside your browser tab onto the chrome cast! Knowing this, with the browser open hit ctrl+o to open almost any file(EVEN .MKV!!!) into the browser an play it! (subtitles work!!! yayayay anime!!) It will then be mirrored over to your tv an it can send sound too not just video! This is slightly lower quality at 720p by default an it can vary depending on your network speed, but you can always lower the quality to 480p in the settings of the Google cast extension to make it all run smooth. I experienced a ever so slight (like .1 sec) audio/video sync issue with this method so stick to the other if you can.  This is great for media junkies like myself who just want to watch their anime/tv shows on the big screen while gaming or browsing the internet!Any questions/setup issues id be glad to help just send me a email at kotasflame@gmail.com", "verified": true, "helpfulness": "0/0", "author": "mark brisch"}, {"rating": 5.0, "review": "I saw this on YouTube and I was very doubtful to it's validity. So I ordered it. Then I had an issue and it was lost in transit. I called customer service and this very sweet CSR named Marie helped me right away. It was sent overnight and I put it in my daughter's room so she could cast things from her laptop or smartphone and well things are absolutely perfect. Thank you so much to Google Chrome for this new product and thank you to CSR Marie for your help. I am completely impressed with this whole thing and I actually bought another one for my TV so when it comes I will be definitely having fun with that one. Way to go R&D; Google Techs...", "verified": true, "helpfulness": "0/0", "author": "Johnny Austin \"Big Daddy 505\""}, {"rating": 4.0, "review": "This is a very inexpensive device to give new capabilities to your old dumb-tv.App support is still very limited, should have and active Netflix and Google Music subscription to get the best from it.Expecting more app support in following weeks/months.I've experienced some minor bugs, hope future updates fix this.", "verified": true, "helpfulness": "0/0", "author": "Axel Vazquez"}]