[{"rating": 1.0, "review": "I think they meant well , but this device works fair at best. I am an A+ certified tech and very good with gadgets. I average about 30mbps. This device just isn`t usable. Skips, lags , freezes, and often times just says unable to cast. Companies are in such a hurry to make a buck they do not explain to the end user that there router must be \"perfectly set up\". A call to customer care simply told me to change a half dozen settings in my router interface. I did. Still no better. Most people would not even be able to make those changes. This thing was not ready to be released, and Google did not seem interested in refunding me or even exchanging it. Now it`s in a box in my shed with a bunch of extra wires.Wasted my money. However my Roku 3 works great ... as does my smart DVD player and my smart tv.", "verified": false, "helpfulness": "0/1", "author": "Norm Brooks"}, {"rating": 4.0, "review": "Good device. Does exactly what you think it does. It's very convenient to have it load video's and such from it's wireless connection rather than relying on my phone/computer/laptop. I occasional have a problem of it not being detected, but I think that's more of a problem with my wireless than it. Using a Plex server with this makes it a dream come true and I'd recommend it to most people.", "verified": true, "helpfulness": "0/0", "author": "Justin Osborne"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "M. Nestor"}, {"rating": 3.0, "review": "After 3 tries I finally got it to work on my smart phone. This isn't my first rodeo with Chromecast. My first one over heated and no longer works. I'm still trying to get the thing to work on my tablet.", "verified": true, "helpfulness": "0/1", "author": "herbert logan"}, {"rating": 5.0, "review": "Works great,  love it", "verified": true, "helpfulness": "0/0", "author": "M. Assad"}, {"rating": 2.0, "review": "Cool toy to try out, but there are many better ways to display the Internet on your TV.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Love this item.  I don't miss cable at all.  Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Holly Henning"}, {"rating": 5.0, "review": "It is such a useful device! Now I just need one for every TV!", "verified": true, "helpfulness": "0/0", "author": "Nicholas Hendrickson"}, {"rating": 4.0, "review": "Love it! I use it for my 60 inch screen. Better than having to buy a new smart t.v.! Great job!", "verified": true, "helpfulness": "0/0", "author": "chris brown"}, {"rating": 5.0, "review": "At first I wasn't so sure I would use it.  Since it was inexpensive, I decided to try it out.  About the same time I got the Chromecast I also went to the dark side going from iPhone to Android.  I find myself going to the YouTube app and casting Hi Def concerts to my TV from my phone.  My TV has a solid Bose sound system and the concerts are really enjoyable.  Since my TV is a smart TV I'm sure I could bypass the phone and Chromecast but I really like controlling content from the phone better than the TV remote and the UI on the TV.  The setup was a breeze.  Again, the Chromecast is so inexpensive I suggest giving it a shot and trying it out for yourself.", "verified": true, "helpfulness": "1/1", "author": "TJ-2020"}]