[{"rating": 2.0, "review": "Does not work unless you have password to wi-fi or internet!", "verified": true, "helpfulness": "0/0", "author": "richard a. williams"}, {"rating": 5.0, "review": "We love being able to watch You Tube from our cell phone onto our TV!", "verified": true, "helpfulness": "0/0", "author": "lslama"}, {"rating": 5.0, "review": "Just as advertised", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "Rafael"}, {"rating": 5.0, "review": "My guests are amused and matching this with my plex server, we have hours of stuff we can watch anytime!Installation is a no-brainer and everyone can even queue their own stuff to watch. Really worth the money!", "verified": true, "helpfulness": "0/0", "author": "Maricris N \"Seasoned RoR developer\""}, {"rating": 2.0, "review": "practically useless..", "verified": true, "helpfulness": "0/0", "author": "John H. Wells \"JHW\""}, {"rating": 1.0, "review": "I purchased this device in the hopes that I would be able to enjoy media on a personal TV in college; unfortunately, I was majorly let down. This device is not compatible with the internet security systems for my (and, it seems, many other school's) college and it was a waste of time. To get this thing to work requires more work and money than it's worth, and I'd rather just buy a device that supports WPA2 Enterprise internet. Sadly, I will be returning my Chromecast and looking for other options.", "verified": false, "helpfulness": "0/0", "author": "Alison Bemis"}, {"rating": 3.0, "review": "Works with Netflix, HBO Go, You Tube and Pandora.  I can't use it with Chrome as casting from a mobile device is not supported.  The quality is just okay.  It's definitely not great, but I suppose for $35, it's not bad.  I probably should have spent a little more money and bought the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "D. Elrod \"Elrod\""}, {"rating": 5.0, "review": "love chromecasts!!!!!", "verified": true, "helpfulness": "0/0", "author": "shaheenAustin"}, {"rating": 5.0, "review": "Can't beat the price with a 1080 resolution...purchased 3 of these for every TV in the house. Work flawlessly and more apps are created weekly to improve compatibility", "verified": true, "helpfulness": "0/0", "author": "Mr. Feedback"}]