[{"rating": 4.0, "review": "Works well 90% or more of the time, but very frustrating when it won't (mostly when streaming from Chrome). If you don't have an extremely speedy connection, the picture really suffers in those scenarios. Great for Netflix and YouTube, though.", "verified": true, "helpfulness": "0/0", "author": "Jenna H Walker"}, {"rating": 5.0, "review": "I used to use my PS3 for streaming youtube and netflix, but this has completely replaced it and is much easy to interface with.  Very impressed, especially with MLB.TV coming on board.", "verified": true, "helpfulness": "0/0", "author": "Andy E."}, {"rating": 5.0, "review": "Products are very delicate, practical, when you use it, and TV link, broadcast quality video is also very good, sound quality is also good. But there can only look at youtube.", "verified": true, "helpfulness": "0/0", "author": "Jackson"}, {"rating": 5.0, "review": "My favorite electronic in my home. Could not live without it. It will never pay for cable again. I have a chromecast in every room of the house", "verified": true, "helpfulness": "0/0", "author": "Daniel Krause"}, {"rating": 2.0, "review": "I didn't like the fact that you had to stay connected to the internet through your laptop or PC in order to use YouTube! I went with NeoTV instead! It's better and not as costly!", "verified": true, "helpfulness": "1/3", "author": "patshg"}, {"rating": 5.0, "review": "Very useful, Handy and worth the money I spent. I don't need to run watch my program through my iphone or iPad any more............", "verified": true, "helpfulness": "0/0", "author": "mkarim"}, {"rating": 5.0, "review": "Chromecast is awesome. I ditched cable for good a couple of years ago before Chromecast came out, and that was fine, but Chromecast has really made my life even more awesome. Works beautifully, easy to set up, no problems so far.", "verified": true, "helpfulness": "0/0", "author": "Vanessa"}, {"rating": 5.0, "review": "It is a smart easy-setup gadget.Performance is awesome. Either using native apps ou casting from a chrome browser tab.I liked specially YouTube and Netflix apps and how the local application on iPhone in my case, turns just into a remote control", "verified": true, "helpfulness": "0/0", "author": "Murilo Alves"}, {"rating": 5.0, "review": "It works like its supposed to, Easy to install, i wouldnt even say install more like plug in, its perfect", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "I use hulu plus and netflix for my television sources and avoid the costs of cable. This is perfect. I can choose programming on my phone or laptop and watch it on a regular sized television. It's awesome.", "verified": true, "helpfulness": "0/0", "author": "SmilinJenE \"SmilinJenE\""}]