[{"rating": 4.0, "review": "I really like this device, but there is obviously a bug somewhere. It messes up sometimes when I try to cast from the Google browser. When it messes up it shows up very discolored and playback is slow. I've read about other's who have encountered the problem as well and I couldn't find a solution. It does, however, work well in an app that uses Chromecast, like HBOGo or YouTube. It was worth it for me because I really just wanted it to watch HBOGo from my computer to a TV.", "verified": true, "helpfulness": "0/0", "author": "Key2014"}, {"rating": 5.0, "review": "I use it mostly to watch YouTube music & movies on my big screen tv.  It was easy to set up on wifi and offers HQ picture and sound.", "verified": true, "helpfulness": "0/0", "author": "Dennis P Randall"}, {"rating": 5.0, "review": "If you are on the fence about one of these, get it. I have a Roku player as well and the Chromecast easily gets more use. Performance can vary from app to app, but the ones I use most (Netflix, Pandora and Youtube) are solid. Hulu leaves a little to be desired, but the same can be said for the Roku version of Hulu. The non-official apps add to the functionality as well. Great product that keeps getting better with updates.", "verified": true, "helpfulness": "0/0", "author": "Mike N."}, {"rating": 5.0, "review": "I had a TV a bit old and not much use in my day-to-day. Everything changed after purchase ChromeCast. NetFlix, YouTube ... a new world of possibilities opened up to me for a very, very low.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "arrived on time and works great! it interfaces better with my phone than with my la[top, though - I hope google works that kink out.", "verified": true, "helpfulness": "0/0", "author": "Devi C. Glick \"gobluewolverines\""}, {"rating": 1.0, "review": "After spending countless hours trying to use this device for netflix, I finally contacted ATT Uverse and they sent out a tech. He couldn't get it going either, so I sent it back. Too bad, it seems like a good idea.", "verified": true, "helpfulness": "0/0", "author": "Vicki Colburn"}, {"rating": 3.0, "review": "There is nothing wrong with this product, I guess we just misunderstood what we could do with it.  That is our fault for not doing more research, but we though we heard enough about it and read the basics.  We thought you could connect and play from your phone, using your phone service, but you have to have wifi, so we can't use it as often as we'd like.  Also, I would like to connect to the tv from more television networks! It is more convenient than having to lug a laptop around to watch tv all the time though.", "verified": true, "helpfulness": "0/1", "author": "Traci Hochhalter \"Traci\""}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "isaac"}, {"rating": 3.0, "review": "It works just like it should. Just plug in the tv HDMI input and USB port, then it runs perfectly, BUT for now it just works with a low number of apps. Basically it works perfectly to watch YouTube videos and Netflix. I hope to see a lot of another apps using it to stream anything for the TV soon.", "verified": true, "helpfulness": "0/0", "author": "Fernando Lima"}, {"rating": 1.0, "review": "Kindle Fire was used as the tablet, since I do not own a Smartphone.  Could not always connect using KindleFire.  I returned Chromecast and am now using Amazon Fire Tv.", "verified": true, "helpfulness": "0/0", "author": "Galen R. Frysinger"}]