[{"rating": 5.0, "review": "the beast :)", "verified": true, "helpfulness": "0/0", "author": "angel hernandez"}, {"rating": 4.0, "review": "Great Product!", "verified": true, "helpfulness": "0/0", "author": "hector villalobos"}, {"rating": 5.0, "review": "Just as expected", "verified": true, "helpfulness": "0/0", "author": "Fareed Ali"}, {"rating": 5.0, "review": "Was really surprised how great the item worked.  Especially on Vizio HD LED TV.  It was easy to install and setup for use.", "verified": true, "helpfulness": "0/0", "author": "Robert Levine Jr"}, {"rating": 4.0, "review": "Google chormcast change my LED T.V to smart T.V.Just one thing if it has space for storage for example 10 GBIt will be perfect '", "verified": true, "helpfulness": "0/0", "author": "Adil Yaqoob"}, {"rating": 5.0, "review": "Very nice item! I love it!!", "verified": true, "helpfulness": "0/0", "author": "Sergey"}, {"rating": 4.0, "review": "This is a great product. My only qualms with it is that it doesn't stream in 1080. I hope the Beta version is improved so that you can stream directly from your computer to a TV without having to open movies/videos in your Chrome browser. It is definitely worth the money and the benefit it bootylicious.", "verified": true, "helpfulness": "0/0", "author": "Lou E Perella"}, {"rating": 1.0, "review": "After discovering my Roku's beta screen casting functionality, I kind of caught the \"screen casting bug\".  The Roku handled my Android's local video playback very well, but then after disconnecting, I couldn't seem to connect again.  I chalked up the flakiness to the beta status of the Roku feature.  But since I was now excited about the casting functionality, I looked to the Chromecast device as a way to complement our Roku workhorse, which has been great in almost every other way (local file viewing on other devices being a weakness...\"Play on Roku\" is not quite ready for prime time).I figured that since Google was involved, casting from my Android would be more seamless, stable, and \"nailed down\".Wrong.Local videos played in a \"clipping\", choppy way, as if wifi bandwidth was being bogged down.  Big disappointment.  I also didn't see any notable or interesting content options that distinguished it from the Roku.  And I also noticed that the device stayed hot to the touch, even when\" idle\".Moments later, I was able to get the Roku casting working again.  No choppiness at all - high picture quality.  I verified the Chromecast playback issue again, just to make sure...again, unwatchable video clipping.  Clearly, to my surprise, the execution of the Roku casting from my ztemax to TV  was far superior.Unfortunately, I no longer see a purpose for this device, as it adds nothing to the palette.", "verified": true, "helpfulness": "2/3", "author": "Reviewer"}, {"rating": 4.0, "review": "He is exactly as advertised, and the delivery was on time.", "verified": true, "helpfulness": "0/0", "author": "Rafael Garibotti"}, {"rating": 5.0, "review": "The device works great", "verified": true, "helpfulness": "0/0", "author": "farris white"}]