[{"rating": 3.0, "review": "For the most part i will say this is a great streaming box. The only weak component is the remote control . Great design, however mine keeps getting disconnected from the box. Having the pull batteries in & out to get it to work again. Other than that is a perfect media streaming box for your house.", "verified": true, "helpfulness": "0/0", "author": "Cesar Ordonez"}, {"rating": 4.0, "review": "A wonderfully simple device that would be so much better if the programs were better designed. Too much is crowded into one page resulting in difficult to read information on a videos content. Lots of room for improvement in this aspect. The concept is excellent and easy to use. Now make it easier to read.", "verified": true, "helpfulness": "0/0", "author": "Bluenose"}, {"rating": 4.0, "review": "Really like it and already had Amazon Prime so it's a great solution.  We had hoped to cut the cord on our Verizon Fios TV, but we're unable to since the local channels and many premium channels aren't yet available on any of the streaming solutions.  Also, it does hang up a bit and each App has it's own features you have to get use to.  Overall we are pleased with it and even though we are paying more by keeping our cable tv provider we are enjoying the streaming services.", "verified": true, "helpfulness": "0/0", "author": "Chad Statham"}, {"rating": 5.0, "review": "I would like to see the movie prices just a touch lower, by say a dollar... that alone would encourage me to rent more movies that are outside of my Amazon prime membership. Right now seeing movies that are still in the theater is cheaper with Comcast by a dollar... And I'd rather give my money to Amazon over Comcast. Fire TV is constantly evolving and you should really give it a try, it is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 5.0, "review": "love it  makes watching movies so easy and easy hook  up for we older people.", "verified": true, "helpfulness": "0/0", "author": "KirbyGourmetHound"}, {"rating": 5.0, "review": "This unit is fantastic. Setup is a breeze and it works flawlessly. The voice search is probably the most useful feature and as of yet has not missed a word. I do recommend that anyone wishing to purchase this unit to seriously consider getting Amazon Prime. It works out to be about the same as Hulu or Netflix per month and you just pay the whole year upfront. I don't have the fastest internet connection and this thing starts everything as soon as the start button is pressed. Streaming is flawless and it has yet to buffer for even a second. Two thumbs up guys.", "verified": true, "helpfulness": "0/0", "author": "THE CANUCK ABROAD FISHING \"Brent A Holtner\""}, {"rating": 5.0, "review": "It is awesome!! I love it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install and works well, good programming.  One of the more intuitive interfaces I've seen.  Really like the search by voice function. Picture is good.  First box had power issues after about a half hour.  Spent some time on the phone with tech, then finally got return authorization. Replacement is good. We're  enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 4.0, "review": "Love it! Easy to navigate!", "verified": true, "helpfulness": "0/0", "author": "Cynthia"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Dawn Harry"}]