[{"rating": 5.0, "review": "love it...", "verified": true, "helpfulness": "0/0", "author": "ricky grammer"}, {"rating": 5.0, "review": "This thing is great. I have other streaming devies in the house, but this is my favorite. I don't play many games on the other units, but there are some great ones available for free on the FireTV -- for both big time gamers as well as people like myself that prefer bowling, pinball, etc. Another feature that's awesome on here is the voice search. The voice search is always accurate and saves a lot of time and frustration not having to type in search items, etc.", "verified": true, "helpfulness": "2/2", "author": "Michelle Watson"}, {"rating": 4.0, "review": "We like the fire TV, however, be aware that there may be issues between fire TV and Netflix and Hulu. We've had to call several times to Netflix because they would appear to want to charge for content. We have monthly subscriptions to all actually, if you count Amazon Prime.Netflix informed me there could sometimes be issues between Netflix and amazon fire or iTunes???  Anyway, Netflix was able to manually add TV program to my daughter's TV and it wouldn't charge us for the program.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "Had to be returned because it did not work in the geographic zone where my country is located, Uruguay.", "verified": true, "helpfulness": "3/10", "author": "Augusto César Sartori"}, {"rating": 4.0, "review": "It's nice but internet connection is a little slow at times", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it.  Just ordered the Fire Stick for the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was really easy to set up. And it was fast and much better than I expected. I use it to watch movies and shows since I am a Prime member, and so I love having access to so many free movies, documentaries, and seasons of shows. I haven't tried the voice search yet, so I will update after I get to it. It was well worth the chunk of change to me.", "verified": true, "helpfulness": "0/0", "author": "C. G."}, {"rating": 4.0, "review": "Great device, voice recognition is the best I have used, beats Xbox one in that area.", "verified": true, "helpfulness": "0/0", "author": "Aluvion"}, {"rating": 1.0, "review": "Trying to watch Amazon fire but every few minutes it has to load again gets stuck at 25% then 66% but really tedious and if this continues this is only the 2 programme it's going back. 5 times through the opening credits, boring.", "verified": true, "helpfulness": "1/3", "author": "Anon \"Ronnie\""}, {"rating": 5.0, "review": "Excellent operation with nice features.", "verified": true, "helpfulness": "0/0", "author": "Gnorth"}]