[{"rating": 5.0, "review": "Works well, I love to use it when I'm binge youtubing.Set up was easy and the video quality adjusts to look good on a large TV.", "verified": true, "helpfulness": "0/0", "author": "Remington Churchill"}, {"rating": 5.0, "review": "I was a little hesitant to buy this after reading some reviews, but since I realized the negative ones were probably because the people were novices, or frankly, expecting more than they should, I decided to take a chance.  So glad I did!  My main purpose for a Chromecast, was the ability to watch Netflix on my TV, and it does this very well.  I cast Netflix from my Samsung Galaxy Note II smartphone, and it works as it should.  It was very easy to set up, and connect with my home network.  Now I'm even happier with it, since Google has added more applications to work with Chromecast.  For the money you just can't beat it!", "verified": true, "helpfulness": "0/0", "author": "B. Foster \"tech lover\""}, {"rating": 5.0, "review": "Great technology for those that don't want to have to connect another horde of wires or transfer their files to other media to watch on their television.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Critik"}, {"rating": 2.0, "review": "I bought this product to watch videos, movies, Youtube, etc...on my flatscreen tv using my Samsung III mobile hotspot as my remote since I do not subscribe to internet wifi in my home.  Initially, After set up with this product, it worked great, but then I did not use it for a couple of weeks.  When trying to use it again, it had a pop up on my tv saying that I need to update thru wifi.  It would not work thru my phone any longer and after several emails of corespondence with google chromecast, there was no explanation why it had changed and it does not work thru mobile hotspots.  Very frustrating that they do not even acknowledge the change they made and I do not have the cool product I originally purchased.", "verified": true, "helpfulness": "0/2", "author": "Shawn Mitchell"}, {"rating": 4.0, "review": "The gizmo works well from my laptop, venue pro 8 tablet, and iPhone.  But there are a few gotcha's.  First, it is very sensitive to the USB power source  it is happy with its own USB adapter and an iPhone 5 apple adapter, but not a couple of others I have (no name generics).  It will hang with the whoops message on the generic USB adapters.Secondly, hotel WiFi's are a problem since you can't login  I use a myfi style WiFi source and that gets around it.But it is really nice to watch Netflix on a big screen when I travel.  now if they would stream apps like PowerPoint or better anything on the desktop it would be great for work.", "verified": true, "helpfulness": "1/1", "author": "Gregory Roody"}, {"rating": 5.0, "review": "Bought this for my husband because he loves to watch Netflix and Hulu shows.  Now my teenagers argue with him over it and they want ones of their own for Christmas.  We have tried to stream movies from 'other' websites (not hulu or netflix) but have not had much luck.  It streams for a moment or two but then loses connection, or gets out of sync with sound, or skips.  As long as you're happy with just Hulu, Netflix and Amazon video, you're good.  Super easy to use with a pc or a smart phone.  My grandmother could operate it,", "verified": true, "helpfulness": "1/1", "author": "Angel Wintrode"}, {"rating": 5.0, "review": "I HAVE NO PROBLEM USING IT. YOU TUBE , PANDORA AND HULU WORK FINE. GET IT IT WORKS FINE WITH MY SANSUNG", "verified": true, "helpfulness": "0/1", "author": "Rafy Manso"}, {"rating": 1.0, "review": "Would have liked this better if I could use it to stream media from my PC to my TV, but its is designed more for just web browsing and youtube at this point in the game. Hopefully they will make it more useful in the future.", "verified": true, "helpfulness": "1/4", "author": "Brian"}, {"rating": 5.0, "review": "Already an Internet video household, the Chromecast makes it so much simplier and slick. The services supported all work great with it (varying degrees of polish depending on what you're using) and the fact it does not tie up the device being used is a great plus. The expandability of it is genius and we look forward to doing even more with it as more services make use of it. This particular purchase was a gift (it was one of the few \"day one\" purchases I've made) and I'm pretty sure we've sold a few others by demo, word of mouth, etc. For what it does, it does it extremely well and the cost can't be beat. This will turn any modern TV into a streaming powerhouse without the need for poorly laid out custom software on TVs or set top boxes. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Samas \"This guy\""}, {"rating": 3.0, "review": "I rely heavily on this as I only use my iPad to broadcast netflix to my TV. There are all sorts of minor glitches, having to close and reopen the program, completely shutting down and turning back on at times, falls off the wifi network...etcOnly Youtube and Netflix work on it.But when it works its great.", "verified": true, "helpfulness": "0/0", "author": "J. Baker"}]