[{"rating": 4.0, "review": "As a media streaming device, I like it. As an Android game console, my kids like it. A good 1st effort but it's lacking in several areas that need to be addressed in order to become excellent:- Menu navigation is good at best.  I do like the voice search.- 8GB storage is soon depleted. Need the ability to add storage.- USB port is not utilized. Really need this for added storage.- Clash of Clans has to be included in the game selection in order to be competitive. Kids love the super-size Minecraft.  These two games alone would make this worthwhile.- Cost of the Game Controller is high considering the quality of the competition like PS4, X-Box and Wii U.  Amazon should include a $25.00 any game coupon to sweeten the deal.Overall, I am pleased and have ordered the Fire TV Stick to expand the experience.  I look forward to the much needed enhancements.", "verified": true, "helpfulness": "0/0", "author": "HowzitUSA"}, {"rating": 5.0, "review": "best system I have ever purchased recommended this to my family and friends worth it at 10x the price", "verified": true, "helpfulness": "0/1", "author": "jerry hyatt \"irish40\""}, {"rating": 3.0, "review": "The only downside to this, is the missing power button, it stays on, so you have to Literally unplug the device every time.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am SOOO happy I bought this Fire TV!  It's so nice to watch my streaming videos on my large screen TV rather than my tablet or computer monitor.  It took me 5 minutes to hook up the unit, connect to my wireless, and start watching.  I've had it for about a week now, and I don't know how I lived without it!  This is must for anyone tired of the crap that's shown on cable and network TV repeatedly.  I love having access to British drama, great movies, etc.", "verified": true, "helpfulness": "1/2", "author": "Mary E. Kmitch \"princess\""}, {"rating": 4.0, "review": "Bought this to replace my WDTV Live. I knew the the FireTV doesn't natively stream local content out of the box, but I also knew that I could side-load XBMC to get that functionality. And via XBMC it streams music and movie files very well. This device is FAST, much faster than the WDTV, the responsiveness between the two devices is like night and day. The native on-board apps are fine also. Some could use some more attention (Hulu, Netflix) but definitely no show-stoppers that I've seen so far.Why this is a 4-star review instead of a 5-star:- CODEC support: movies that have DTS-HD dumb down to just DTS. The higher end Dolby audo streams convert to regular stereo. I understand why that is (it's a licensing thing) and I hope it's something Amazon will address in the future.- stuck at 60fps output: and that's fine for games, but for movies, not so much. Without getting too technical, taking a source recorded at 29.97i (DVD) or 23.976p (Blu-Ray) and outputting that at 60p forces 3:2 pulldown - that's extra work for your TV/receiver and depending on the quality of your system, you'll see blurs/tearing in the video.- no native local media streaming capability: if it weren't for XBMC, I wouldn't have bought the FireTV.", "verified": true, "helpfulness": "2/3", "author": "Keith F. Simpson \"Keith\""}, {"rating": 1.0, "review": "waste of money", "verified": true, "helpfulness": "1/12", "author": "Samuel"}, {"rating": 1.0, "review": "Removing my previous review due to software updates since I've purchased the device:First I want to say that I pre-ordered this device and absolutely loved it until recently.Amazon did a software update and it completely broke the Hulu app.> The app icon (for Hulu) no longer displays (not a huge deal, but annoying)> The picture goes out while trying to stream content (black picture - only sound plays)I've done some troubleshooting to verify the issue is with the device:> I've tried streaming through my DVD player, Apple TV, and Roku 2, PC, Gaming Console(s) - all play without issue> Plug the Amazon Fire back in and I can't watch one episode without disruptionI have 2 other friends that purchased the Fire TV and Fire Stick based off my recommendation, they are having the same issues. The issue is not internet related. I've run speed tests, checked servers for packet loss, etc. The Prime content is nice - and definitely getting better, but I use this thing for Plex, Hulu, and Netflix primarily. Since it fails at Hulu, I am going back to a Roku today.Amazon, please resolve the issues with Hulu.", "verified": true, "helpfulness": "0/1", "author": "jason"}, {"rating": 4.0, "review": "Amazon Fire is great.  Put it in my office instead of cable.  Great reception, picture, download and I'm watching different stuff than on regular tv.  Great purchase...Can't wait to have more video options.", "verified": true, "helpfulness": "0/1", "author": "Jimbo"}, {"rating": 5.0, "review": "Best thing ever. Such a great device. Don't know how we watched tv without it!", "verified": true, "helpfulness": "0/1", "author": "Audrey Jordan"}, {"rating": 4.0, "review": "good product price was  a little high", "verified": true, "helpfulness": "0/1", "author": "Edward"}]