[{"rating": 3.0, "review": "not very clear on app and programs as advertised hard to find some app and programs", "verified": true, "helpfulness": "1/4", "author": "Robert Griffin"}, {"rating": 5.0, "review": "Just like magic so easy to hook up and use", "verified": true, "helpfulness": "1/1", "author": "Mrs. Will"}, {"rating": 1.0, "review": "I purchased an Amazon Fire TV to replace an aging Roku box.  I was attracted to the breath of content and the blazing fast processor.  It sounds like the best game in town and if I could watch it on my TV, I'd probably be giving it a very good review. I own a Samsung UN40D6300SF LED set.  The set is around 18 months old and still for sale. The Samsung set recognizes everything else I've put in its HDMI inputs -- the Roku, the Apple TV, a Chromecast Dongle, countless notebooks and more.  It won't recognize the Fire TV and I've been through the original and a replacement.  I've used multiple HDMI cables, upgraded the firmware on my set, tried to upgrade the firmware on the Fire TV, swapped ports, changed HDMI settings inside the Samsung.  I even attached the Fire TV to a cheap Chinese set I had (which it works with) and tried to adjust its options and then swap it back to the Samsung. The Samsung TV doesn't recognize it.I've spent time with Amazon's tech support and they ran me through all the basic stuff, but had no answer for this.  They swapped the unit out for me, but the new one behaves exactly the same.  If you have a similar set to my TV, I would avoid the device until Amazon sorts out this compatibility problem with Samsung.", "verified": true, "helpfulness": "10/13", "author": "S. Friedman"}, {"rating": 5.0, "review": "This is a great product", "verified": true, "helpfulness": "0/1", "author": "Jesse"}, {"rating": 2.0, "review": "At first I really liked this, and I ordered 3 of them. Of course that's the point it went on sale so I overpaid $45. The ability to watch Amazon Prime shows is great, but using the Netflix app on here is painfully slow. It stops my show at least 3-4 times to load. I don't have this problem with my Apple TV. So now I'm using my Apple TV to watch Netflix and the Amazon Fire for Amazon Prime. This is just such a waste. So until this product can actually play the other apps like Hulu Plus and Netflix without delays, I would pass.", "verified": true, "helpfulness": "2/5", "author": "Sam Ellingson"}, {"rating": 5.0, "review": "Fantastic is all I can say.", "verified": true, "helpfulness": "0/2", "author": "David Gilchrist"}, {"rating": 5.0, "review": "I watched this DVD quite a few years ago and it was very well done, but I have not yet watched this new issue as yeet.  More info later!", "verified": true, "helpfulness": "0/9", "author": "Fern Elizabeth Watts-Horn \"Fern E. Horn\""}, {"rating": 5.0, "review": "I wasn't sure what to think about this device when Gary Busey was the spokesperson.  But man am I glad I bought this thing.  I can watch Netflix, Ted Talks, YouTube, and all sorts of stuff.  I don't use the voice function too much because I can't search within YouTube or Netflix, it pulls up results anywhere.  Hopefully amazon fixes this.  I did buy the game controller and am enjoying playing the games that are free, so that's a bonus.  Yup, my Roku box is in a box somewhere in my garage collecting dust now lol", "verified": true, "helpfulness": "1/1", "author": "Jsherm76"}, {"rating": 5.0, "review": "Being an avid Apple fan, I thought I would give this Fire TV a chance instead of Apple TV. First off, the simplicity and quickness of putting this together was enough to convince me already. Amazon always makes life easier and once the Fire TV was set up, I was satisfied. This has all the features as promised, Televion shows, movies and music, and game apps and lots of space to add pictures. I won't go into details on that stuff since its been posted on item description. Rest assure all works well. I got this item for my spouse who is stuck home due to an operation and figured this would give her a lot of options to keep occupied. She's satisfied with tons of free Prime movies and adding a ton of pics to show off to her friends on the TV.Thank you Amazon for such a great product. The sleek look and size makes me want to purchase another for my other room.", "verified": true, "helpfulness": "0/0", "author": "veteran"}, {"rating": 3.0, "review": "I used it at a friends house, it's alright... but for the $99 yearly prime fee it should be sold for under $29 (maybe even free). $99? I think not.Roku 3, here I come!", "verified": false, "helpfulness": "1/11", "author": "Rubi-dub-dub"}]