[{"rating": 5.0, "review": "Fantastic device. Easy to set up, foolproof operation, what the Q should have been.  Loads of potential hoping for an expanded range of supported apps.", "verified": true, "helpfulness": "0/0", "author": "Robin Martin"}, {"rating": 5.0, "review": "Great device, easy to set up and get working with apps such as Netfix, YouTube and Chrome across a variety of devices such as IPhones, Mac, Ubuntu and my Nexus 7. Much more convenient to use than apps on my Smart TV. Cant wait for other apps to support this", "verified": true, "helpfulness": "0/0", "author": "Mr. R. Patel"}, {"rating": 5.0, "review": "It just works. Plug it in download the app to your device. Config was a breeze. And just start casting YouTube and other video services.", "verified": true, "helpfulness": "0/0", "author": "Chris Rafferty"}, {"rating": 5.0, "review": "Fast shipping. The item works well in Italy too, but only with YouTube through smartphone. On PC works with Google Cast, so you can view a Google Chrome page on TV.", "verified": true, "helpfulness": "0/0", "author": "LoComproPerTe"}, {"rating": 4.0, "review": "Great, a promising future, I look forward applications because I live in France and the store is not very rich", "verified": true, "helpfulness": "0/0", "author": "Kevin Guilloteaux"}, {"rating": 3.0, "review": "American power adapter iso belgian version.Sometimes troubles with the WiFi connection although both in same room.If everything is allright, then available functionality works great!", "verified": true, "helpfulness": "0/0", "author": "Koen Van Loo"}, {"rating": 4.0, "review": "I like the idea and as far as YouTube or Chrome Tabs are concerned, this device does what it is supposed to do. I'm living in Germany, and despite having a Netflix account and being able to route my internet traffic through the U.S., you cannot get it playing nicely with this setup out of the box without hacking your router. After a lot of internet research I found out it has to to tiwth the fact that Google is routing any Chromcast traffic across its own DNS servers (8.8.8.8 and 8.8.4.4.) and the user has no option to change that.For now, I am happy with my Chromecast being a \"YouTube stick\" only - that's much less painless than starting YouTube on my Multimedia PC which is attached to the TV set, although I am not shure if it's worth its price, then.If it could replace the Multimedia PC, though, it would be perfect. That is: Playing local media, Spotify, Netflix outside the U.S. etc.", "verified": true, "helpfulness": "0/0", "author": "Titus"}, {"rating": 4.0, "review": "There needs to be more apps that works with the Chromecast. But it works perfectly with the few apps that is supported.", "verified": true, "helpfulness": "0/0", "author": "Jesper Thorius"}, {"rating": 4.0, "review": "Works flawlessly. With more support it would have got a 5.Wish it would just work with windows media player.", "verified": true, "helpfulness": "0/0", "author": "kodlum"}, {"rating": 5.0, "review": "Works perfectly well with PC, Tablet and smartphone Android. Installation is a peace of cake. This is real value for money. I am happy with it and I can recommand it to others.", "verified": true, "helpfulness": "0/0", "author": "Edwin Vervaet"}]