[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "jiwon"}, {"rating": 3.0, "review": "I had a lot of connectivity issues and the media player when compared to roku- I would rather use Roku than have to take up memory on my cell phone to use the control", "verified": true, "helpfulness": "0/0", "author": "A Gutierrez Martinez"}, {"rating": 5.0, "review": "Wow it really works great!!-", "verified": true, "helpfulness": "0/0", "author": "Beverly Knight"}, {"rating": 4.0, "review": "It need more freatures", "verified": true, "helpfulness": "0/0", "author": "Luis S."}, {"rating": 4.0, "review": "My girlfriend and I like to watch HBO, Netflix, and Starz.  Before I got this, I had to bring my laptop over and plug the hdmi cable into her TV. Not anymore! This thing is a great companion to and hand held device. You can cast many apps, and more are always coming. All  TVs should have this built in.  One bad thing is that it's very hot to the touch.  I unplug the power to it when not using it, I don't trust its safety.", "verified": false, "helpfulness": "0/0", "author": "Tommysmallss"}, {"rating": 4.0, "review": "I bought the Chromecast in replacement of my Apple TV. It works great and for only $40!! I only gave it 4 stars because the connection shuts off periodically when I cast my phone screen. FYI: It also needs to be plugged in to an outlet.", "verified": true, "helpfulness": "0/0", "author": "Andrew V Marin"}, {"rating": 5.0, "review": "The best $30 dollars invested, I got a large DVD collection that was suffering the overuse of my 2 little boys, now they can rest peacefully", "verified": true, "helpfulness": "0/0", "author": "Carlos Alberto Amaya Zavaleta"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Dale"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Jayson"}, {"rating": 5.0, "review": "I am loving our Chromecast! There are rare glitches. Very rare. We have had a time or two where it couldn't connect. I hit retry and or restarted my phone and problem solved. 5 stars for a wonderful product with minimal and easy glitches! Buying another one for the other tv.", "verified": false, "helpfulness": "0/0", "author": "Karla S."}]