[{"rating": 2.0, "review": "I would not order this again.  I rarely use it, cause the chrome/google will not let you stream any content from your phone/computer to your tv.  They have blocked any content other than their own or netflix.  Sad to see google having restrictions on their stuff, but I think the apple/google age will die soon if they keep this going.", "verified": true, "helpfulness": "2/3", "author": "mark"}, {"rating": 5.0, "review": "This thing is fantastic, super easy to set up. My grand kids love it. It keeps them entertained for hours playing funny video clips on utube. Really hope in the future it will be able to play family videos.", "verified": true, "helpfulness": "0/0", "author": "Al"}, {"rating": 5.0, "review": "Plugged it in, set it up, been playing Youtube and music on it ever since. Only issue is that it sometimes loses connection to my Wi-Fi network. It quickly resolves itself but still it can be frustrating.", "verified": false, "helpfulness": "0/0", "author": "Michael Pagano"}, {"rating": 4.0, "review": "Awesome little device!  Would love for Google to add more features in the near future (via firmware update).  Can't go wrong at this price.", "verified": true, "helpfulness": "0/0", "author": "TK"}, {"rating": 5.0, "review": "Awesome. If you are a Google fan you will love this. Good HD quality and you can take it wherever you go. Cheapest way to turn your TV into a SmartTv.", "verified": true, "helpfulness": "0/0", "author": "Angel Francini"}, {"rating": 5.0, "review": "It works as Goodle said it would, magnificently. Since it is so new, look forward to it's being capable of streaming other applications from tablet to the big screen in the coming months as technology advances even more. George McLain, Salisbury, Maryland.", "verified": true, "helpfulness": "0/0", "author": "George .g McLain"}, {"rating": 4.0, "review": "I recently purchased Chromecast due to a favorable review from a friend. It works quite well when I cast Netflix or Youtube videos from my iPhone. However, HuluPlus and Amazon Instant Video are not currently supported (I would give it 5 stars if they were). I haven't seen any significant drainage to my phone battery when using it to cast and I love that I can still check emails/facebook/etc while streaming.The one other complaint that I have is that when casting from by Chrome browser, it tends to be a bit choppy. The audio and video do not always sync perfectly.All in all, if they offer Amazon video and Hulu casting, this will be one of my favorite products out there.", "verified": true, "helpfulness": "0/0", "author": "Felicia Adams \"Book lover\""}, {"rating": 1.0, "review": "Couldn't get to work from desktop due to audio from Bluetooth speaker. Doesn't work to my 50'' TV due to lack of software update for it. Can only use from phone to smaller TV and disappointed.", "verified": true, "helpfulness": "0/0", "author": "Bill Pilcher"}, {"rating": 3.0, "review": "HEADLINE!Expected it to facilitate bringing video from computer files to television set - You Tube nice, but not enough. What headline?", "verified": true, "helpfulness": "0/0", "author": "Gno"}, {"rating": 3.0, "review": "It would be nice if it works works with VLC player or other outlets.  Otherwise it's very easy to use", "verified": true, "helpfulness": "0/0", "author": "Fady Yousif"}]