[{"rating": 5.0, "review": "I bought it for need eliminate the HDMI cable and any type of cable. It work great for tv with HDMI input and can be use anywhere as long have mobile device with chromecast apps. Just need 3rd party or apps for allow to use local content file such as home video and display streaming from any device with built in wireless.", "verified": true, "helpfulness": "0/1", "author": "Xao X"}, {"rating": 5.0, "review": "i was thinking about getting this for my 52\" 120hz 1080p LCD but i dont need it when i already have a Windows 7 PC, Nintendo Wii-U, Cable Box, Set Top Box, standalone Blu-Ray player, and coming soon to the room will be a PS4. All connected with HDMI 1.4 cables which support 3D, ethernet and audio return, i dont even use netdix i download my hd quality tv shows and blu ray rips and music using utorrent and jdownloader why would i need to waste my last hdmi port for this device when i already have enuff of what it offers already, no thank you i dont even like google chrome its a gay browser better than internet explorer tho but will never be greater than firefox..my devices all run through the 5 GHz band on my dual band network. But I changed my mind I am going to probably by one for others to use their netflix on my tv through this and wifi which will be close to 100% since i have a 2 range extenders in this room. Also for the smart phone and tablet streaming etc.", "verified": false, "helpfulness": "0/12", "author": "Raj \"Raj\""}, {"rating": 5.0, "review": "Easy installation, great performance, superb image and sound: all for less than $10.00 after rebates and free Netflix 3-month subscription!", "verified": true, "helpfulness": "0/1", "author": "S. I. H. \"neko8\""}, {"rating": 4.0, "review": "Way too many reviews out there to go on about this- it's simple, easy to use, cheap, and lets you stream browser, netflix and youtube to your TV. It will make any tv with an HDMI port a \"smart tv\".Only complaint is that it took amazon forever to get it to me. But it was new and hot at the time.", "verified": true, "helpfulness": "0/1", "author": "Rex Stetson \"Rex\""}, {"rating": 5.0, "review": "If you have a TV without WiFi this a great product, easy to install even for a novice, ordering another one.", "verified": true, "helpfulness": "0/1", "author": "Edwin Guzman"}, {"rating": 1.0, "review": "It worked on my very powerful Dell Inspiron 9400 laptop, once.  I could cast all screens to my Sony HD.  I did not put it to full use until a month later.  Google changed their specs.  I can only get full HD on their \"approved \" providers, and only on my gaming desktop.  It will not work on Amazon Prime, or any device with the Android operating system. It is totally controlled by Chrome operating system and their software that Google may change at will.  I will not accept my content to be censored by Google for any reason.  There are much better ways to display streaming content on the HD TV of your choice.", "verified": true, "helpfulness": "3/8", "author": "Robert L. Sitze \"Bob\""}, {"rating": 3.0, "review": "Needs at least hulu to be useful. Good concept but no follow through. Gets stuck while playing youtube video sometimes.", "verified": true, "helpfulness": "1/3", "author": "$%^"}, {"rating": 5.0, "review": "I love this thing.  I don't use it all that much but when I do, it's sooooo convenient to have.  I had trouble connecting to my wifi the first time but it eventually caught on and connected.  I hear the more recent updates that Google has pushed out should correct those problems.", "verified": true, "helpfulness": "0/1", "author": "Doomstang"}, {"rating": 4.0, "review": "Although it does not have all the bells and whistles of some of the other streaming adaptors, it is in expensive and simple to use.  I bought a second one so my grandson can stream to the TV in his room.  Hopefully Google will open it up to more applications.", "verified": true, "helpfulness": "1/2", "author": "Richard C. Troscianecki"}, {"rating": 3.0, "review": "I bought this little device so I could \"cast\" my Chrome browser tabs onto my TV screen from my tablet & phone (Transformer Infinity tablet).  Based on the documentation, casting Chrome tabs was one of the main selling points and it says it fully supports Android & Chrome.  However, what they don't mention is that you can only cast browser tabs from the \"desktop\" version of Chrome.There is currently no Chromecast extension for the mobile version of Chrome...  which basically means you can't cast Chrome tabs from your tablet or phone.From a desktop/laptop computer you CAN cast Chrome tabs (since this isn't the mobile version of Chrome).  This seemed to work good.  However, tablet casting was my main intention and in this category it's very limit (from tablet, you can only use Netflix, Youtube, and Google Play/Music.... that's it...)I guess I'll just have to wait until Chrome mobile support is added...", "verified": true, "helpfulness": "10/10", "author": "AmazonZig"}]