[{"rating": 3.0, "review": "just work with another router and another internt, i can not use the internet from my mobile phone.", "verified": true, "helpfulness": "1/1", "author": "Gilly"}, {"rating": 5.0, "review": "This is my second purchase as a gift. Simple to use and good integration with YouTube and NetFlix. Despite its limited Apps, I am still giving this 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Power User"}, {"rating": 5.0, "review": "Easy to install. Easy to use. Such fun to own.", "verified": true, "helpfulness": "0/0", "author": "Mrs_M"}, {"rating": 4.0, "review": "Great device, I use it for casting tabs in Chrome for web session as well as a target for youtube. Its also compatible with my Synology NAS so I can stream Video and music to it directly.Just waiting for a bit more functionality, being able to create personalised screens or rotating widgets would be awesome.. I can only assume (or hope) they will come in future updates.", "verified": true, "helpfulness": "0/0", "author": "Nathan Alberti"}, {"rating": 5.0, "review": "So easy set up and get started on my favorite movies, videos and TV shows...Best buy eva", "verified": false, "helpfulness": "0/0", "author": "GGirl67"}, {"rating": 5.0, "review": "We love this not only for streaming video but for displaying our pictures for our family members who have vision difficulties. We used the Chromecast to show my mother-in-law pictures of her new grandsons because we were able to cast them onto our flat screen, she was able to walk up to the television and really see their faces. We have tried to show them to her on our computers and other devices but nothing was able to show her their faces like the chromecast. We also showed her videos of the rest of the family members. It was really an incredible experience for everyone.", "verified": true, "helpfulness": "0/0", "author": "Joanne Grant"}, {"rating": 5.0, "review": "I can understand the complaints that there are not enough apps that support Chromecast but for us it is actually perfect. We have children with flat screens and laptops and the urge to play YouTube videos on their TV's is the big thing. With an inexpensive Chromecast device they can do that without wires running from the TV to laptop. I prefer that for safety reasons. For the adults in the home, we use Netflix and any website that I can access with Chrome. It's cheap and effective and most importantly, it works. It charges on the TV so still no wires running a power outlet. Great price, good convenience and highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "wish it would cast everything from my Nexus - best to read the specs before you purchase so you are clear on what it does.  Works ad \"advertised\".", "verified": true, "helpfulness": "0/0", "author": "P. Thomas \"Bags\""}, {"rating": 2.0, "review": "It works well if you’re good with technology. However I bought this for my parents and it was a little bit beyond their capability.", "verified": true, "helpfulness": "0/1", "author": "Russell K Root III"}, {"rating": 1.0, "review": "The TV will stream internet TV without interruption.  With this device, the playback starts/ stops/ skips.  It is too slow to work well.", "verified": true, "helpfulness": "2/3", "author": "RonS \"rssteelman\""}]