[{"rating": 5.0, "review": "I love this.Easy to install", "verified": true, "helpfulness": "0/0", "author": "Mahesh Dadi \"mahesh dadi\""}, {"rating": 5.0, "review": "What I wanted at a good price", "verified": true, "helpfulness": "0/0", "author": "Russell L. Lamb"}, {"rating": 1.0, "review": "NOT AS DISCRIBED! No mention  of Internet  access  required other than cell phone to use this item! Absolutely  worthless item and of no use even if you had the required  type of Internet it needs  to operate.", "verified": true, "helpfulness": "0/0", "author": "Donna Burgess"}, {"rating": 5.0, "review": "This device is an absolute gamechanger. I can stream my entire movie and tv show collection right to my TV from the palm of my hand, or on my tablet or computer. It does have bugs at times and crashes but I don't hold it against it. It has saved me from pulling out old cables to plug into my TV, which was such an absolute hassle. I also love that I can stream a ton of apps to this like HBO/SHOWTIME/STARZ/CINEMAX/etc. BUY THIS TODAY!", "verified": true, "helpfulness": "1/1", "author": "Steve"}, {"rating": 1.0, "review": "I am not impressed at all with my chromecast. Every time I try to watch a movie it plays really slow and always stalls. And it always disconnects while I am trying to watch something. I would not recommend this at all.. I actually regret it and wish I would have went with Amazon fire tv instead. This is a disappointment.. Don't waste your money or time on this product.", "verified": true, "helpfulness": "1/2", "author": "Sheri M Styniski"}, {"rating": 5.0, "review": "Simple, easy to use, and compatible with my phone, tablet, computer, and laptop - it just works, and works well!", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 4.0, "review": "The device itself works well, however, the software is not perfect — sometimes there are glitches or the Chromecast plugin crashes in my browser.But 95% of the time it runs great.", "verified": true, "helpfulness": "0/0", "author": "Alexander Bekhterev \"AB\""}, {"rating": 3.0, "review": "It's okay, nothing to write home about. Can do the same thing faster with my computer.", "verified": true, "helpfulness": "0/0", "author": "Fred Sharpe"}, {"rating": 3.0, "review": "Be careful with this unit... the kids bent this within a week of setting it up.", "verified": true, "helpfulness": "0/0", "author": "Skooter"}, {"rating": 5.0, "review": "Love my chrome cast. perfect for Netflix. Thinking about getting a Firestick for the other room though.", "verified": true, "helpfulness": "0/0", "author": "M. Porcaro"}]