[{"rating": 3.0, "review": "still need to become familiar.... but not really impressed with resets that happen during hgtv", "verified": true, "helpfulness": "0/1", "author": "Jody  S. Brown"}, {"rating": 5.0, "review": "Very happy with it!", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 2.0, "review": "need more apps fox now and others,that you can get with roku.", "verified": true, "helpfulness": "0/1", "author": "Paul J. Walters"}, {"rating": 5.0, "review": "Works great right out of the box, easy to use!", "verified": true, "helpfulness": "0/0", "author": "95 Black Vet"}, {"rating": 5.0, "review": "WOW...this was easy, perfect and I LOVE the voice control!!!!!", "verified": true, "helpfulness": "0/0", "author": "Kareen Farmer"}, {"rating": 3.0, "review": "I really do like the speed of the device, but there are a couple of things that caused me to knock a couple of stars off of the device.  For starters I have a large collection (about 200 movies) that I can watch via VUDU and since the it is currently not an amazon app, I cannot watch any of these movies on this device (I hear that I can watch most of them via the flixter app, but they are in SD and also not all movies will show up).  Granted I did know this going into the purchase, so if you don't care about VUDU, think of this as a 4-star review. The other issue that I have is that the Sling TV app seems to not work as well as I was hoping.  I was planning on watching last nights episode of the walking dead, but apparently it would not authorize the device.  I lowered my cable package for this device and Sling TV, but will now have to pay for an episode to be able to see last nights episode.  Hopefully I can figure out why I was having issues with the SlingTV app.", "verified": true, "helpfulness": "0/0", "author": "cbusch"}, {"rating": 3.0, "review": "I was really excited about this product because I was hoping to transform my TV into a lookalike SMART TV. It's ok but wish that they had more options for apps. Maybe an android port similar to blackberry. Overall it's fine.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Awesome even thinking of canceling cable", "verified": true, "helpfulness": "0/0", "author": "MARIA RAMIREZ"}, {"rating": 5.0, "review": "I went ahead and bought this during their Cyber Monday sale, as it was $69 rather than the regular price of $99. I love it, and can be entertained for hours. If I wasn't a Prime member, however, I don't think it would be as worthwhile. I do like the fact that there isn't a monthly subscription attached, but I am paying for Netflix, which I access on my Fire TV, and again, it might not be something I would use as much without that.", "verified": true, "helpfulness": "0/0", "author": "A. McCullah"}, {"rating": 5.0, "review": "I could do the same stuff with my xbox one,  but now I don't have to worry about the family using my console for watching tv.  The only thing is the remote that comes with Fire TV is somewhat limited in the games you can play...but what do you expect,  and if you really want you can buy a gaming control.", "verified": true, "helpfulness": "0/0", "author": "Robert Hartwell"}]