[{"rating": 5.0, "review": "awesome neighbor wanted to by for his wife for present she loves it its small and a happy wife happy life", "verified": true, "helpfulness": "0/0", "author": "nova73"}, {"rating": 5.0, "review": "When you can transfer movies from your pad or i-phone to your television, it's just amazing. My wife and I watch movies from Netflix on a daily basis using comcast to transfer them to our TV.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Simple and quick install, great picture.  And I love the use of my Android smartphone as the controller--way cool.  Got the Blackrockaudio extractor so I can run the audio through my stereo plus listen to Pandora without turning the flat screen on. Wonderful, inexpensive technology.  (and I'm not a young techno freak, I'm 71)", "verified": true, "helpfulness": "0/0", "author": "GliderGuider"}, {"rating": 5.0, "review": "Runs Nice and smooth. Netfliix and Youtube are the mostly supportive apps. Waiting for more apps to support Google chromecast.", "verified": true, "helpfulness": "0/0", "author": "Manuel"}, {"rating": 5.0, "review": "As far as streaming devices goes, the Chromecast is the best bang for buck. Have one of these for each television I own.", "verified": true, "helpfulness": "0/0", "author": "HilliusE"}, {"rating": 5.0, "review": "Awesome Product , I'm loving it :) , Everybody should try this :PLooking forward to buy more and more Google productsQuick Delivery in Good condition Thanks :D", "verified": true, "helpfulness": "0/0", "author": "Mihindu Karunarathne"}, {"rating": 5.0, "review": "I love this Chromecast. It's so simple to use and fast/easy to connect your phone and/or laptop. Never any lag. Plus this allows you to multitask while your video or music is still playing. I would highly recommend this to anyone that wants flawless wireless streaming from device to TV.", "verified": true, "helpfulness": "0/0", "author": "Nate J"}, {"rating": 4.0, "review": "The user interface is great, the device works flawlessly. This is a cool toy for the price. Great job Google", "verified": true, "helpfulness": "0/0", "author": "Michel Charest"}, {"rating": 5.0, "review": "Came on time. connected easily. no problems to get the movies streamed. Too little contents other than You-tube or Netflix though...", "verified": true, "helpfulness": "0/0", "author": "Isaac"}, {"rating": 3.0, "review": "....I cant stream videos I got on my hard drive. I don't know what it is about the format of these video files but roku and chromecast cannot display the video.This is great if you want to play videos off of youtube, but it doesn't work so good with other sites.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]