[{"rating": 4.0, "review": "The only thing i don't like is that you can not rate the movie at the end like you can with netflix..", "verified": true, "helpfulness": "0/3", "author": "Brian Kimber"}, {"rating": 4.0, "review": "The Fire TV is awesome, it's fast, has a somewhat clean UI, and one amazing remote! It has all the basic applications or \"channels\" that is included on an Apple TV, Roku, and/or Google Nexus TV. However, all this being said I feel a little trapped within Amazon's ecosystem (detailed below). Granted I am coming from an all exclusive Apple universe. If you are invested with Amazon then this unit will be perfect for you!Overal, I do enjoy the Amazon Fire TV. The non-IR remote is seriously awesome. You can point that sucker anywhere and it works! Not to mention that the voice dictation was surprising accurate. Hopefully, later on it will be extended to more uses (i.e. Searching YouTube). My only gripe, which is why I say I feel trapped in Amazon's ecosystem, is that it is not cast-able. On an Apple TV, if I am viewing something on an iPhone, iPad, or even Mac I can select a menu option and whatever I was viewing is now on my TV. Same applies towards a Nexus TV, which has chromecast built-in.My review might sound negative and non-fitting with the four stars I gave. But I gave the four stars because the Fire TV as-is, is wonderful. It works like a charm and I can't stress how fast this thing is. My gripes come from what the unit doesn't include (casting), but it's possible that this can be built in down the line.", "verified": true, "helpfulness": "2/3", "author": "Michael Whicker"}, {"rating": 1.0, "review": "Unless you are a member of Prime Membership, this is absolutely useless! The MAJORITY of the MOVIES and TV SHOWS and GAMES all require payment and are not free!!  When I got ready to send this back, I am now being charged a return fee of almost $10.00 to return, if I return to a UPS facility (no choice for USPS, which is local....I have to drive over 60 miles round trip for a UPS facility).I am so done with Amazon and misleading advertisements.", "verified": false, "helpfulness": "2/8", "author": "DJ's Treasures"}, {"rating": 5.0, "review": "great product, nicely designed, easy to use from the start. Very good content choice.", "verified": true, "helpfulness": "0/0", "author": "DAI"}, {"rating": 5.0, "review": "After having both apple TV and Roku devices already I was a little skeptical what else the amazon fire tv could offer, even after reading about it, so after another \"tv\" related purchase amazon offered 15$ off the fire TV so I figured I'd give it a try. To make a long story short it is awesome, amazon even personalized it with my amazon prime info before It arrived so when I took it out of the box it was already setup, games are really cool on it (I got a gamepad as well), my kids (7 & 5) love playing the games on it, as the games are also easy to browse on the device to download more. What might be even cooler is if your looking in the app store on amazon.com and decided to buy a game, you can have it auto installed right to your fire tv, as they link it to your amazon account. So you can sit on the couch and browse games, when you buy one and it starts downloading and installing on the device in the other room. I thought this alone was really cool. It's not an xbox or ps4, but for younger kids the games are a little easier and more familiar (same as what's on their iPad's but now on the TV!). Movies and TV are great as well, Only concern would be the internal 8GB storage limit, I haven't got close to filling it up yet but I could see that getting in the way some day. That said there is a USB port on the device that amazon has said may be used for storage expansion in the future, so hopefully they will enable external storage on the device before I run out of space.", "verified": true, "helpfulness": "1/1", "author": "Akl95"}, {"rating": 5.0, "review": "gonna buy the stick now for the kitchen", "verified": true, "helpfulness": "0/1", "author": "D. Drake"}, {"rating": 5.0, "review": "This was everything I expected it to be. Had a little trouble navigating to the Netflix App because it's listed in Featured Apps but you actually need to access it from the \"APPS\" section. The streaming video was flawless on my local wireless network and I have a simple network router connected to my COMCAST broadband router. I have Amazon Prime and was impressed with visual quality even though I didn't buy any HD movies, just the standard free ones. Setup was a breeze and although the remote took a little getting used to.. (use only back button and right, left, up, down arrows to navigate) it was not long before I was able to quickly navigate. Don't search inside Netflix because it will take you to content outside of Netflix (like the series ARROW which is available to purchase from Amazon or view for free in Netflix for example). The speed of navigating around and loading movie streams etc is far superior to the game consoles I have used for this in the past. I can't speak to the games because I haven't purchased a wireless controller yet. Maybe cyber Monday will fix that.", "verified": true, "helpfulness": "1/1", "author": "Dan E. Horsefield \"dhorsefield2\""}, {"rating": 5.0, "review": "So far I am loving it. I bought it from a local retailer because I had a gift card. So although I am not a Verified Buyer I have had the Fire TV for a week.The initial setup is easy. More detailed info isn't included once you have it operating, but it wasn't hard.Pros-Easy to setup with 5ghz compatible Wifi. I love this because my Router is dual band and the bandwidth is just better on 5ghz.-Apps available instantly-30 days of Free Prime(Tho we already have it)-Fast system, browsing applications is Flawless. Although I haven't dabbled in the gaming area because to me it is like PS2.-Prime Added to the system. The free content has been separated from Amazon Instant Video. This feature being missing almost made me go with a different brand, but I heard it was coming.-Second ScreenCons-No HBO go, but honestly It is probably just a matter of time. Personally I am cutting the cable, so I am SOL on that anyway.And also this can somewhat be bypassed if you have HBO Go and you fling it to the Amazon Fire TV-Mirroring was somewhat iffy at first because I never did it before. Those instructions aren't included. Kinda a Con for me, but  a little research and I was getting the right App. I like that I can mirror more than just Amazon products.-The Remote is small, and their is no power button. I can see it being lost, and unless I am mistaken their is no easy way to shut the Fire TV off other than going to settings and Sleeping it. If anyone has a Shortcut to putting it to sleep that would be usefulHonestly I am stretching for the Cons. After a week it is a pretty awesome box no bigger than a Sandwich.I hope it doesn't burn out on me for using it constantly.My internet is Fast. And the 5ghz adapter on this thing makes it perfect. I haven't Buffered once noticeable by my eye. I buffer on my PS3 sometimes because it is 2.4ghz.I think I am going to be happy with this device as long as it doesn't go defective on me, but as I didn't buy it via Amazon but through Best Buy. If it does I have a replacement plan and will walk in and walk out. I think it will be well worth the 12 dollars. I hate return shipping.PS. I don't review often. So I may not be very concise. But I am rating it a 5 star. Every device can have a defect here or there. The device itself and what it has to offer is 5 star. When they come out with a more powerful one. I will totally get that. It beats streaming from a Slow app bundled in a TV or Slow stick, or even my gaming console. I don't want my gaming consoles to run 24/7 like a cable box.And if you have any Issues when you first get it with Netflix. Just give it time. I let mine run overnight while not streaming. because it told me Netflix was already downloaded even though it wasn't installed yet. Netflix just updated its App, and Amazon updated its software from the state it was in out of the box. I started streaming it immediately, and noticed Netflix was missing hours later. As soon as I stopped streaming and gave the box some time I noticed my whole Amazon menu changed, and Netflix was back with the New App design. It was probably delayed because I was watching crackle videos.Given more time, I bet they will continue to improve the options in settings or the remote. How about people give feedback instead of complaints. Amazon is a great platform for giving us (Its people) what they want. Vs other brands.Update 1/28/15Everything still runs great.The best way to run movies from the PC is using PLEX app available for free to use a media server through your PC.However, maybe I am kind of old school but the USB on the back of Amazon Fire not for the purpose of playing any content is ridiculous.But Amazon is no different than other companies who love to limit our Freedom of options. Other than PLEX, they want you to rent or buy downloads.No thanks. Plex has been a good service for me.", "verified": true, "helpfulness": "1/1", "author": "Tiff J \"Twisted little sister\""}, {"rating": 3.0, "review": "It can freeze sometimes, and some of the apps such as Hulu and Netflix can run a little funny (glitchy) sometimes, but I have been very happy with this product vs using my PS3, plus having a tiny remote is so nice!", "verified": true, "helpfulness": "0/0", "author": "Shane L."}, {"rating": 2.0, "review": "The interface is fairly slick and the voice search feature works reasonably well for searching Amazon VOD content.  The full screen screensaver which provides a slideshow of some of the most gorgeous landscape photography I've seen is a nice bones.As a Prime member I also have access to the Prime Music.  This is similar to Spotify where you can setup your own playlists of songs from an ever expanding music library.  With the FireTV you can access these playlists.  The problem is that you can't actually create or edit the playlists from the FireTV, you need to use a computer for that. This seems like an unnecessary hassle to me and something that Amazon should look to remedy. I haven't explored other feature like FreeTime (provides kid friendly content) or Photo streaming (which automatically syncs photos from Cloud Drive to the FireTV).  And I don't particularly pay much attention to the gamesIf I didn't have any problems with this box, then I'd happily give it 4-5 stars, but there are two major issues with my unit:1) The HDMI video output will flicker and sometimes cutout altogether from time to time.  This happens while streaming video content or just flipping through the UI.  I'm fairly certain that this is not a problem with the stereo system that the FireTV is connected to, as this problem does not exist with other devices connected to the same input.2) On other occasion, the FireTV has reset itself in the middle of watching a movie.When you add on top of that the often poor performance of the Netlfix app (which often needs to pause video to buffer the content) and the lack of an HBO Go app you end up with a unreliable content delivery system that bested by other offerings out there like Roku.", "verified": true, "helpfulness": "0/2", "author": "Bryan"}]