[{"rating": 4.0, "review": "Not enough apps yet. Does what it is suppose to do.", "verified": true, "helpfulness": "0/1", "author": "oskarito \"oskarango\""}, {"rating": 5.0, "review": "Works great.  I have three (one per TV)", "verified": true, "helpfulness": "1/1", "author": "M. Nafziger"}, {"rating": 5.0, "review": "The original $35 media stick continues to get better and provide expanded usability in my interconnected media home. Very good device. Highly recommended.", "verified": true, "helpfulness": "1/2", "author": "Carlos"}, {"rating": 5.0, "review": "My son bought this for me for Christmas as I wanted to watch Coursera lectures on a big screen.  Coursera is offering an Introduction to Classical Music by a Yale professor for free in January 2015 and thought it would be more fun to watch on a big screen than small screen.  There have been many times I've had some content accessible on my laptop which I wanted to watch on a big screen.It's also great for Youtube, Netflix, Hulu, but not Amazon Prime.  I also used it to look at my pinterest account.  It was fairly easy to download - there are instructions online to which they direct you.  Takes about 10 minutes.Other features to like about it per the company:*Stream online video, music, photos and more to your TV using your smartphone, tablet, or laptop*Supports a growing number of apps including Netflix, YouTube, HBO Go, Hulu Plus, Pandora, ESPN, MLB.TV, Google Play Movies and Music, Plex, MLS, crackle, Vevo, Rdio. Allows to cast a Chrome browser tab.*Box includes Chromecast, HDMI extender, USB power cable, and power adapter. No remote needed.*Easy setup: Plug into any HDTV and connect to your home WiFi network*Works with Android phones and tablets, iPhone, iPad, Mac, Windows, and Chromebooks", "verified": false, "helpfulness": "2/2", "author": "L. M. Keefer"}, {"rating": 3.0, "review": "Chromecasts aren't a;; they are cracked up to be. Limited usefulness", "verified": true, "helpfulness": "0/2", "author": "Robert J. Buechel \"sokratees\""}, {"rating": 1.0, "review": "Could never get it to work.  End up buying another product instead.", "verified": true, "helpfulness": "0/1", "author": "WWW \"Fun in the sun\""}, {"rating": 5.0, "review": "pretty easy to use and setup", "verified": true, "helpfulness": "0/1", "author": "tre691"}, {"rating": 5.0, "review": "Great product for those that use Google Services.  It works fantastic with youtube and some other services.", "verified": true, "helpfulness": "0/0", "author": "cool jones"}, {"rating": 5.0, "review": "About time!", "verified": true, "helpfulness": "0/2", "author": "Sandra \"Sandra\""}, {"rating": 5.0, "review": "I love this product, it does exactly what it states. I love it now I enjoy watching my T.V. Thanks Google and Android.", "verified": false, "helpfulness": "0/1", "author": "Nikki's reviews"}]