[{"rating": 1.0, "review": "I have owned two Chromecasts for over five months and I have been very disappointed in the performance of the device.  I also own several Rokus, have used the Roku since it first became available, and in comparison the current Roku is a much more dependable device. The Chromecast has a tendency to lose its connection, especially when casting the Chrome browser from my PC. It also freezes regularly, forcing us to restart the browser & on occassion reboot the computer, and the quality of the picture is also undependable.  All in all the Chromecast is not worth the money...yet.  The early Roku devices had a lot of issues - some that took years to fix.  One hopes that eventually the Chromecast will improve as well.", "verified": true, "helpfulness": "1/1", "author": "Bob in Florida \"bookworm dad\""}, {"rating": 5.0, "review": "Oh my gosh! This makes watching my  TV/Movie/Music/Mobile Apps and paid subscriptions so easy and convenient to stream!  It is so easy to install and set up that anyone can do it! The Google Chromecast price is great too!", "verified": true, "helpfulness": "0/0", "author": "Septima"}, {"rating": 4.0, "review": "A little slow when loading but overall works great.", "verified": true, "helpfulness": "0/0", "author": "Jer"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Carlos Borrego"}, {"rating": 5.0, "review": "I've owned this product for several months now, it's my only source on TV entertainment.  I have subscriptions to both Hulu Plus and Netflix which i watch daily.  In the beginning I had a few hiccups, I almost returned it.  Some of the issues included not casting, freezing, and kicking me out of full screen while casting from laptop.  All of the issues resolved on there own. At this point I am very satisfied with this purchase. I have recommended this product to several friends and gifted it to my boyfriend.", "verified": false, "helpfulness": "0/0", "author": "Austyn Cole"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "linden bryan"}, {"rating": 3.0, "review": "cannot get audio to play through the receiver but works fine on the TV", "verified": true, "helpfulness": "0/0", "author": "Brian Ermeling"}, {"rating": 4.0, "review": "My husband loves it, he's a movie junkie and to be able to view his movies on tv was the best", "verified": true, "helpfulness": "0/0", "author": "sanders Royal"}, {"rating": 2.0, "review": "The product did not meet my expectations. Perhaps this was my fault in the research that I did before purchasing the Chromecast. I thought that all I was going to have to do was to plug and play. Not so. It had to be powered up (the cords were included so this was no problem), and then only certain apps would work to \"cast\" the images. FaceBook is not one of them. I guess if I had played with it a little more I would have found it useful, but being so limited I sent it back for a refund.", "verified": true, "helpfulness": "0/0", "author": "Robert Edwards"}, {"rating": 5.0, "review": "perfect for our needs", "verified": true, "helpfulness": "0/0", "author": "margaret carter"}]