[{"rating": 4.0, "review": "If Google can update this to stream any player on any device's, then this product would be unmatched.  Right now it's pretty much limited to netflix, youtube and a few of other online video streaming sites.", "verified": true, "helpfulness": "1/1", "author": "Brandon Gaynier"}, {"rating": 1.0, "review": "one third the cost of Apple TV with 1/20th of it's function. Could not get it into full screen mode. Come on Google, you can do better than this.", "verified": true, "helpfulness": "2/7", "author": "Burt R. Mann"}, {"rating": 3.0, "review": "Chromecast is nice as it provides the ease of using Youtube and netflix. However, rendering from a chrome tab is not good.Also, the problem that disappointed me that even I got a mail for 3 months of Netflix (supposed to get a promotion code after 5 days of shipment), I haven't got the promotion code yet. Also, when I go to amazon, I don't see any button available to contact the seller or to report the issue.", "verified": true, "helpfulness": "0/0", "author": "Nadeem"}, {"rating": 3.0, "review": "Couldn't get it to START setup. Coordinated with Chromecast tech support and after several tries to get setup to initiate, the technician said the Chromecast was designed to be used with TV's newer than 3 years old. Mine's 5. So I'm sending it back. This should be included in the description. I gave it three stars because I don't think it's right to give it less than that because my tv is technically not capatable. I'm sure it's a good product.", "verified": true, "helpfulness": "1/1", "author": "fogerty"}, {"rating": 1.0, "review": "It is good if you can tolarate the slow and dropping connection. All you can do is watch only YouTube and NetFlix on your tv from your smart phone. You can not stream any other thing from your computer/latptop/phone. It could have been a great product. Google just spoilt it. My suggestion - just try to find other similar product which can do more than just streaming youtube and netflilx.", "verified": false, "helpfulness": "2/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Purchased solely for being able to watch YouTube without an HDMI cable and way better than the free YouTube remote app. The set up is a bit different but works well and I like the option of being able to move to other windows, checking email, etc while watching videos. There's a small learning curve which doesn't take long to get through. Well worth the purchase.", "verified": false, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Never have to use the hdmi cable to my laptop again! Great for casting streaming sports or other shows that won't work on the standard Google TV. Best feature is that the Chrome tab you're casting from doesn't even have to be on top, so I can keep working on my laptop while streaming from it. Perfect for traveling, as I can take Netflix, etc. with me without bringing a laptop and cable.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 4.0, "review": "The Chromecast is easy to set up and use.Pros: - Easy - Handy - Very small foot printCons: - The faster your home wifi the better - The faster your home internet the betterThat said, I will be buying 2 more when they come back in stock because It think they would be great for my in-laws who we've already set up with Nexus tablets and they have Verizon FIOS.", "verified": true, "helpfulness": "0/0", "author": "Buys Too Much"}, {"rating": 5.0, "review": "For the price, you get more than you pay for.  Simple to use, easy to understand, and you get Netflix or HBOGO on your TV.", "verified": true, "helpfulness": "0/0", "author": "Shirasdad"}, {"rating": 1.0, "review": "I have rarely been so ticked off at a product. Too bad Amazon doesn't have negative stars. Google is totally incapable of supporting this buggy, largely incompatible device. Unless you like gambling - stay away until this thing works in most home network environments.Having tested two of them, one from Google and one from Amazon, I can attest a 100% failure rate over 1 week of effort. There is an excellent chance it will not work with your router, or any particular router. Google cannot say which routers it works with, likely because it doesn't work with most. Google has zero technical support dedicated to this device, the escalation team is near useless to non-existent.I get exactly the same (and only) pattern using four different routers and four different clients with each of the two Chromecast units: 1 x ASUS N53 router, or 1 X Netgear N600 WNDR3700 router, or 2 x Buffalo G54 DD-WRT 24, with Windows 7 64bit Pro, Windows 7 64bit Home Premium, HTC One V Andriod 4.0, and Sansei Phablet Andriod 4.1 as \"sending devices\" (clients). BTW, don't keep pushing the reset bottom, which is very flaky, or re-install the app as the reps in the Google call center reading scripts tell you to do. It makes zero difference but wastes lots of time. Also be warned the device runs hot (as in toasty).The Chromecast app will find both the Chromecast broadcasting on its own 2.4Ghz network, then prompt for the SSID and password of the local WLAN in order to connect to the local 2.4Ghz network. [Chromecast does not use 5Ghz channels]. The app will get the Chromecast to join the local (WLAN) network as shown by the DHCP address being handed out to the Chromecast MAC address and the device becoming pingable. DD-WRT shows Chromecast requesting 140 connection that simply fade away. Windows shows the app switching rapidly between the Chromecast private network and the WLAN. The app reports failure and the TV has the message that Chromecast connected to the WLAN but it did not have Internet connection which of course is false. Google hints that IGMP is involved but has zero documentation what the device is actually trying to do. Obviously it is failing to shake hands with Google's Chromecast servers. The Chromecast is a stripped Android device controlled via URLS, but there is no way to query the Chromecasst to ask for its status. Google doesn't want that.I don't know what Google is doing but it obviously overtaxes many home routers in service. Likely they are exploiting rarely used protocols which push consumer grade routers beyond their capabilities or at least into poorly tested buggy territory. Google should document this and at least they could provide a list of working routers. I can attest from first hand experience that the list of ones with which Chromecast does not work appears to be extensive. Frankly I would recommend against wasting time on this thing until Google cleans up its act and come clean on which routers it works on. Be grateful Amazon is backlogged, perhaps by the time you get yours, Google will have learned what it means to deliver a consumer device directly to customers. If Google thinks this is the future of direct consumer sales, then it doesn't have one.", "verified": true, "helpfulness": "4/11", "author": "Pinetree \"Cone\""}]