[{"rating": 5.0, "review": "Can be glitchy, but the pros outweigh the cons. Love being able to stream anything on my device while also using it for other things. Great for multitasking. Can't wait for Spotify to be integrated.", "verified": true, "helpfulness": "0/0", "author": "Honest Review"}, {"rating": 5.0, "review": "Chromecast is great.  So much value for the price and so convenient to control your media from your phone or laptop.", "verified": true, "helpfulness": "0/0", "author": "Brian Perry Mcnamara"}, {"rating": 4.0, "review": "I enjoy streaming my movies from my iPad /desktop to my HDTV. It's a must have when you have kids wanting to watch different shows/movies all at once.", "verified": true, "helpfulness": "0/0", "author": "David A. Synakorn"}, {"rating": 5.0, "review": "Great product, great price. Use it all the time.", "verified": true, "helpfulness": "0/0", "author": "Dan Wills"}, {"rating": 5.0, "review": "Best product I ve bought in a long time, it was all I wanted, small size, has an excellent signal, cast with every device, dosn t crash. Just excellent!The shipping was also on time, had no problems at all!", "verified": false, "helpfulness": "0/0", "author": "Johnna Johnston"}, {"rating": 5.0, "review": "Easy to set up and use. We love it!", "verified": true, "helpfulness": "0/0", "author": "J. Spiker"}, {"rating": 4.0, "review": "Works with YouTube very well.", "verified": true, "helpfulness": "0/0", "author": "L. D."}, {"rating": 5.0, "review": "It's lived up to my expectations. The only thing I didn't like was that it can't play videos saved to storage and played through the device media player but I'm sure there's a work around out there.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "my daughters love this for cartoon watching from youtube. i think i will have to buy another one for netflix watching on my tv.. arrived on time with prime shipping. easy to install and love the product..", "verified": true, "helpfulness": "0/0", "author": "Valerii"}, {"rating": 1.0, "review": "I hope the unit I received was defective. I say this because I have returned it and ordered another one. The unit I received stalled and stuttered the the picture and sound so I was not able to watch anything. The unit is only five feet from the router with nothing the block the signal and nothing else connected. When I went to unplug it, it was almost red hot. I don't know if this is normal.", "verified": true, "helpfulness": "0/0", "author": "RAUS"}]