[{"rating": 1.0, "review": "I think this is a great idea, BUT  it appears to me that google is in bed with Netflix... as they make a direct app for streaming Netflix and Youtube.... But they don't for Amazon prime streaming.  If you do some research you will see they say you can't stream Amazon, then they say you CAN stream with some tricking....  Well I find it funny that it will show the whole amazon screen for shopping.. but won't show the video on a streaming movie.  This product could simply emulate the screen of my laptop, just like it does when you hook a HDMI cords...  BUT no Google apparently wants to control what and who can stream through this product.IF Google would simply stream everything to the screen (a very simple process, that it is already capable of if they would let other services use it to) just like a simple HDMI cord does then I would give this 5 stars..  BUT I simply don't have a use for this for using Netflix and Youtube.  I love amazon prime streaming.. so this product is useless to me.  Returning", "verified": true, "helpfulness": "0/1", "author": "Maui Scott"}, {"rating": 5.0, "review": "For some reason, it's not well-known but you can use Chromecast to watch videos off your local or network drives. True, Chromecast has no media-server support as such, but it's easy to get around this. All you have to do is open a video file in Chrome with the command \"Control-O.\" Since Chrome can natively play AVI, MP4, M4V, MPEG, OGV, and WEBM videos, you can then watch you own videos on your TV with no fuss or muss.", "verified": false, "helpfulness": "0/0", "author": "D. Wright \"talltexan\""}, {"rating": 5.0, "review": "Very easy and fast to set up.  Works great to send content from my laptop (Chromebook) and tablet (Nexus 7) to the TV screen.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Brock Middlebrook"}, {"rating": 3.0, "review": "The one thing I didn't like is that Chrome pushes all audio from your streaming device to the Chromecast.  This means, if you digest video/audio content through a Chromecast, your TV will need to have audio out jacks to your sound system or there is no way (I have found using a Chromebook and a MacBook Pro) to play audio through any other channel than your TV.So I was disappointed in that regard.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "Edited on 1/07/2014: After 2 weeks of this device working correctly it stopped working and I could not get any of my devices to connect to the Chromecast so I had some problems getting this item to work with my Linksys E3000 router until I did some research and found out that I needed to make a few changes to my router settings.(see  [...] ). Also, this product only works on 2.4 GHz, so on a Dual-band router you will need to use a different SSID for each Band. One for the 5 GHz and a different one for the 2.4 GHz band. Be sure and save any changes you make to your router. Next, make sure your casting device (PC, Tablet, Phone, etc) is using the SSID for the 2.4 GHz band. Once I made these changes it started working properly again.  (original post)This product works as advertised and you can use with your smart phone, tablet or PC. Works great for watching Netflix on any TV with an open HDMI port and a wireless network. It does require Google Chrome (which is free) to use. Very satisfied with the ease-of-use (once I made the necessary changes to my router settings, see above) and performance of product. No extra cables required, everything you need to make it work is supplied in the box. Well worth the price and does not require a credit card to set up an account like the ROKU products do.", "verified": false, "helpfulness": "0/0", "author": "DS \"DS\""}, {"rating": 1.0, "review": "How ironic that Amazon sells this thing. When I bought it, there was no mention that it didn't stream Amazon Prime in any way, shape or form (it now does say that). The TV commercials are also misleading. How awful that Google left that functionality off. I'm glad I have a smart TV in another room.", "verified": true, "helpfulness": "0/0", "author": "Andrea Rainey \"Knitting Book Maven\""}, {"rating": 5.0, "review": "I bought this for my Son's Christmas.  He sent me the link, I ordered it.  What amazed me was that he hooked this into a derelict TV in our guest bedroom, fooled around with his smart-phone a bit, and suddenly he was watching movies on this TV.  To my eye it was as good as I needed.  As for long term; I don't know.  He and this device went back home and the derelict TV is dark again.", "verified": true, "helpfulness": "0/0", "author": "soundman"}, {"rating": 3.0, "review": "The price can't be beat.... but this leaves a lot to be desired in channel selection.  Let's face it, Chromecast is a bit late to the game. Apple TV and Roku have been around for a while and dominating the market. If you want to enter the market you better \"Come Heavy\" and Google didn't.  For the size of their company and the resources they have there is no reason for this thing not to hit market with at least what everyone else is offering.... and hopefully something more. No Amazon Prime? come on.... Plex only recently added? Should have been there from the beginning.The interface of controlling through a computer basically eliminates a large population of users from using this device. \"Parents\" who have their kids set up a device for them will want a remote. Using their computer and having to stream from Hulu.com or Netflix etc... is going to be too complicated.I know this is a lot to ask for a $35 device... but it is entering a mature market and falls short of the baseline of what is available already. Its only point of competition is its price and I don't think that is enough yet.  Maybe when they put some channels out there they will stand a chance. Even restrictive Apple has over 30 channel selections.....Hopefully they improve this device enough to give it some more stars later.", "verified": true, "helpfulness": "0/0", "author": "Marty"}, {"rating": 5.0, "review": "I knew what limitations it had when I got it and I was fine with that so I give it a 5 because it does those great. I expect that in the future it will have more features which is a bonus. I was able to connect with my tablet with no problem and my wireless with no problem and even set up one of my computers to stream but I had to add a little wireless dongle. Now I see they are even cheaper so I would buy another but I only have one TV and with two TV's I would have no life.", "verified": true, "helpfulness": "0/0", "author": "nickmarine \"nickmarine\""}, {"rating": 4.0, "review": "It has all your favorites Apps and they've recently added a few more. I still haven't found a way to surf online which I thought was an option.", "verified": true, "helpfulness": "0/0", "author": "Abraham J Haynes"}]