[{"rating": 5.0, "review": "Works great! Fun to use! Changes the imput automaticly and almost every app can use it! The future of this is going to be bright!", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "BEST GIFT EVER! WE USE IT DAILY, AND EVERYONE IN THE HOUSE HAS THERE OWN ACCOUNT. I'M ORDERING MORE, FOR EACH ROOM!", "verified": true, "helpfulness": "0/0", "author": "Pilar"}, {"rating": 5.0, "review": "I bought this purposely to view youtube movies on my big screen television and it hasn't disappointed. Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "pkb"}, {"rating": 4.0, "review": "I found this item to be the most cost effective way of streaming data. I would suggest that it come with a remote of it's ownHaving said that, AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Rockey Gurley"}, {"rating": 5.0, "review": "I didn't get Cromecast from Amazon, but I have bought enough here that I don't think they will mind. Download this, \"television fanatic dot com\" just put it into your search engine, they wont let me copy and paste the exact address. It's one hundered percent free and works on Mac too. Thats what I'm using it on. You can get Live TV including sports and over 100 channels. No ESPN but hey, without your cable password. Because of this, I am cancelling cable TV and using chromecast, netflix, hulu, and television fanatic plus an air antenna. Other than ESPN everything else is on there. No, I have nothing to do with them. Just letting the people know HERE IS THE ALTERNATIVE. Amazon Prime is on this!! Go to Watch Movies Tab, and there it is. After a little more looking from suggestions it TF does have Ad-Ware. It's not virus. You however can bring Prime or any other stream up in your Chrome Browser and go to the top right and click the Chomecast source button to TV network, whatever you named it at installation. I'm leaving TF on since I'm on a Mac I don't have the problems before mentioned and I use Safari to surf not Chrome.", "verified": false, "helpfulness": "0/0", "author": "Rex"}, {"rating": 1.0, "review": "Because of very tempting advertisements, I ordered this device, and inpatiently waited to receive it. Much to my disappointment from very beginning I found it extremely user unfriendly. I went through hell to instal it, and it was very inefficient to use. Using it with I pad was out of question as well. I ended up returning it. Thanks to Amazon's great return policy I didn't soffer any longer. I think if you just get a $5.00 cable, and hard wire your laptop to your TV you are much better off.Best Regards, Razi", "verified": true, "helpfulness": "2/3", "author": "Razi Sharafieh"}, {"rating": 4.0, "review": "Great product, dissappointed they took some initial features away a little bit after releasing. More chromecast friendly apps are popping up and more support outside of google is coming for those who can't leave anything alone with the stock firmware/software.", "verified": true, "helpfulness": "0/0", "author": "J D!zzle"}, {"rating": 5.0, "review": "Of course the apple tv is better, because it has other features, but this is a must-have for anyone who likes netflix, youtube, and has more than 1 t.v.Also i liked that it is so small and you only need the usb cable and the chromecast (that is really small), so you can go with it anywhere. I hate to unplug the hdmi and power cord of the apple tv every time i go on travel.", "verified": true, "helpfulness": "0/0", "author": "Victor del Busto"}, {"rating": 3.0, "review": "Price is great.Playing supported apps is great.Want to see something from the web that isn't associated with an app?  You can mirror what is on your screen.....well, only if you use chrome browser.  Oh, and not if you are trying to do it with an iPad or iPhone. Oh, and if you do it from your desktop and your chrome browser; the sound will be out of sync. ( they really need to fix that)However, we have used it everyday to watch netflix and YouTube. Love sonza.Still waiting for someone to make a device that will mirror anything on my iPad and ancient iPhone.Overall it's my bad for not doing more research on its limitations.", "verified": true, "helpfulness": "1/1", "author": "T. Leonard"}, {"rating": 5.0, "review": "Got two of these, one for my college senior and one for high school senior.  They both said it was the best present for Christmas, and they got really cool stuff other than this!", "verified": true, "helpfulness": "0/0", "author": "JB"}]