[{"rating": 4.0, "review": "The device works well, but it's dependent on a smartphone, tablet, or pc to make it work. You can use a Chrome browser plugin on a pc to display what's in your browser window only, or apps for a smartphone or tablet that choose to embed chromecasts code. To be honest, there are quite a few options out there, but mainly it's use is broadcasting netflix, hulu, watch espn, music, and movies to a TV. You can purchase hdmi devices with android loded on them that display all of this and more that are not dependent on pc's, tablets, or smartphones.", "verified": true, "helpfulness": "0/1", "author": "BWG"}, {"rating": 5.0, "review": "Excellent way to stream to the TV from smartphone or tablet. Great picture quality. We use it mostly with netflix and youtube, but that's all we've really needed it for.", "verified": true, "helpfulness": "0/0", "author": "Jennifer McCord"}, {"rating": 5.0, "review": "Excellent purchase. Great product.", "verified": true, "helpfulness": "0/0", "author": "Francisco"}, {"rating": 5.0, "review": "ChromeCast is awesome. I do not know why you would buy anything other than this. It works by plugging into your HDMI on your tv and can be charged by the usb port on your tv as well. I use this a lot to watch youtube videos and netflix on my tv via my smartphone.", "verified": true, "helpfulness": "0/0", "author": "Daniel Huskey"}, {"rating": 2.0, "review": "There are much better options out there.  The main drawback is the lack of a remote and very limited apps that support it.  35$, but Roku stick is 39$ and comes with a remote.", "verified": true, "helpfulness": "0/1", "author": "AFB"}, {"rating": 5.0, "review": "It has simplified my TV watching immensely.", "verified": true, "helpfulness": "0/1", "author": "Ketul Sutaria"}, {"rating": 4.0, "review": "Some difficulty setting up but I am a below average tech-ie.", "verified": true, "helpfulness": "0/0", "author": "Kevin Wright"}, {"rating": 5.0, "review": "Love love love it!  Will be buying more!", "verified": true, "helpfulness": "0/0", "author": "Magda Lujan \"WyoMags\""}, {"rating": 5.0, "review": "I had to toy with it a little, but it really does work.  Movies, for instance on youtube, do not show the entire web page -- Only the movie appears on the tv.  (The old tv episodes available for free are generally better than what's on.)", "verified": true, "helpfulness": "0/0", "author": "J. King"}, {"rating": 4.0, "review": "As expected", "verified": true, "helpfulness": "0/0", "author": "W. Spears \"bidbid\""}]