[{"rating": 5.0, "review": "Great device.  No issues whatsoever.  There are several apps that use it, and more coming it seems. Buy one for yourself or a friend.  Great gift..", "verified": true, "helpfulness": "0/0", "author": "Hunter Lundquist"}, {"rating": 2.0, "review": "I had high hopes for Chromecast given that I use Android tablets and phone, but that hope has been dashed.The built in wifi is 2.4Ghz only which is disappointing, and the device was just too slow to be useful.I have a great dual band router and very vast broadband -  get 50mbps down, 12mpbs up on N devices, but still a Netflix video took 20-30 seconds to begin playing, and then was very pixelated and useless.Was able to cast from Chrome browser, again slow and painful process.Tried for two days now it just sits.", "verified": true, "helpfulness": "0/0", "author": "Matt G"}, {"rating": 5.0, "review": "A much cheaper alternative to other streaming media options, the compatability with phone apps is a wonder and truly surprised me.", "verified": true, "helpfulness": "0/0", "author": "Joshua Martinez"}, {"rating": 4.0, "review": "I have to work out some audio bugs related to my television connected to my surround sound system receiver through a satellite receiver, but I am confident I will have these settings resolved and I am very impressed with the capability of my little Chromecast in allowing my phone or laptop to easily communicate with my TV.", "verified": true, "helpfulness": "0/0", "author": "Lilnaji"}, {"rating": 5.0, "review": "This little gadget is awesome!  It was easy to set up, and it works as advertised.  It allows me to \"cast\" my laptop (using Chrome browser) and my phone/tablet to my TV. It's great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Works for me with Hulu, Vevo, Viki, Real Player, Netflix and Youtube. Crackle or broadcasting from Chrome browser is not supported in iOS. I could connect my laptop and then broadcast using Chrome... but I rather not.Hope they add more services soon.", "verified": true, "helpfulness": "0/0", "author": "zap.nin"}, {"rating": 2.0, "review": "This product is over hyped and very limited.The Ads on TV let you think you can stream any content on the ipad or laptop to the TV, this is not the case.You can stream stuff from youtube to your TV or share a web page (only from a PC, not from ipad), and this is where it ends.I got it to try and stream Amazon Prime movies via Chrome and it just didn't work (with our without Silverlight). I endede up buying Roku and using the Amazon app on it.Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "SH"}, {"rating": 5.0, "review": "Extremely simple to set up and just as easy to use.  I ordered my first one a few months ago for my bedroom and for the price I just had to have another one for the tv in my home office.  I love watching commercial free netflix, hbogo, youtube videos and more.  If not for sports and the news I do not think I would need cable anymore.One issue... it is not compatible with my microsoft surface tablet.  So I use my smart phone which is just as easy, but I would have liked to have the option.  And that one issue is really microsoft's issue, not google's... So all in all it is a great little device and I would refer anyone to go out and buy one.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "Very easy to set up and use.  From opening the box to watching whatever I wanted on my TV was less than 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "SSmith88"}, {"rating": 5.0, "review": "i was soo surprised on how this works and it has brought youtube tot he tv , its awesome , i can play netflix on my ty...", "verified": true, "helpfulness": "0/0", "author": "Ben Sanders"}]