[{"rating": 5.0, "review": "Use your amazon fire tv and start saving money.you can watch free movies, listen to free movies and do this anytime you want.", "verified": true, "helpfulness": "0/0", "author": "Helene Ballard"}, {"rating": 5.0, "review": "Love this! Compact, easy to install and voice recognition works very well. Only does voice navigation for Amazon compatible apps; would be nice if voice control worked within Netflix app to navigate through items. HD picture display is very vivid and clear and quick. I take this tin place of my tablet for movies traveling and hooks up to any HDTV with internet access.", "verified": true, "helpfulness": "1/1", "author": "NicoBella"}, {"rating": 5.0, "review": "I recently bought the Roku3 for extended family and they loved it but I held out for this and I am not disappointed.  It is solid and powerful in design and has the look, feel, and output that I can find no fault with at this time.  I know they are developing more apps and improvements for the system to come and it is only going to get better and I can say it is already above the best I've seen up to now and that was the ROKU3.  Don't be afraid go for it,", "verified": true, "helpfulness": "2/2", "author": "Ron Dusenberry"}, {"rating": 3.0, "review": "I'm giving this three stars overall but based on capabilities in 2 categories as I've defined them. If you only care about one category or the other, this may be the perfect device for you---or not.Category 1) Five Stars for ease of use, Amazon integration, speed of play/function and scope of general content/services. This device is like roku on steroids. Has the simplicity of roku, but is much quicker and easier to use and brings great integration with existing Amazon content. If you have one Amazon account, one Kindle Fire, and one user account for other services like Netflix, this may be your perfect device. BUT - if you have multiple Amazon accounts, more than one Kindle, and multiple accounts for other services, you will be very disappointed in Amazon's monolithic approach to Fire TV. What's the big deal? Read on.Category 2  One star for Account integration, utility with other home media network content. Why one star? We have four Kindle Hds in our household. Each family member has their own account, preferences, etc. Same with Netflix and other premium services. There is no way to use the Fire HD on one tv to accommodate our separate profiles, other than deregistering the device and reregistering  it, with all the problems that entails. So effectively each Fire TV box is locked to a specifc tv in your house. Why is this an issue? My wife and kids have very different usage and viewing habits on their respective Kindles. All are different from mine. When you set up your device, only one profile is going to be registered, so which one are you going to pick? Once you make you choice, anyone using FIre TV will also be able to add, change, fiddle with your selections, effectively altering your preferences not only on Fire TV but your Kindle as well. Fire TV in my opinion MUST HAVE THE ABILITY TO RECOGNIZE, REGISTER AND DISCRETELY INTEGRATE MULTIPLE AMAZON ACCOUNT PROFILES. It makes no sense not to be able to logon with whichever Amazon user account you want and manage your viewing/sleections accordingly. Big fail there in this iteration of the box, in my opinion. For the hardcore iPad users, who are used to having their kids screw up their files/content because their tablets can't handle separate profiles, this may be something you are used to living with and you don't care. Or, if you have a generic family account profile, this may not matter to you. But for Windows users who take discrete multi-user locked down profiles for granted, this failing, which is typical of android devices, will be hard to stomach. I suspect Amazon doesn't like its devices to handle multiple accounts because its easier for them to ask people to buy two devices at $200 each rather than allow one device to accept multiple profiles. Even if you are willing to accept this business practice with Kindle, it makes no sense to structure Fire TV, which is basically a set top box, the same way. I suspect at some point Fire TV Server will be released to do just that, (with a commensurate price point). Until that happens, I can't give the current release more than 3 stars.The other miss is there is no integration with other network media devices. If you already have a media server and hoped Fire TV would find that and pull in your media for you, you are again out of luck. What Amazon wants you to do is store everything with them in their cloud, but with only 5gb of free storage, good luck with that for any serious media storage. Many of us have terabytes of local home storage. 5gb is a couple of HD movies worth (with compression).Summary Overall - Three stars. Pros. It does what it says it will do, quickly easily and with great integration to a single Amazon account/device/profile. If that's all you need, go for it. Cons. Needs multi-profile/account support. Should have the ability to recognize and pull content from you existing media servers as well.", "verified": true, "helpfulness": "4/6", "author": "Potonjeri"}, {"rating": 1.0, "review": "Paid more for TV repair men then I did for this stuipid thing; buy a ROKU. it doesnet talk back to you like this thing does but it WORKS 100% of the time.  Stay away from this junk.", "verified": true, "helpfulness": "4/28", "author": "Steven Zisk"}, {"rating": 4.0, "review": "This review is as of 4/23/14 though I've had mine from day 3 - I'll begin with what needs improvement so Amazon can hopefully address it.Amazon Fire TV's interface pushes you towards buying content even if you already own it or it is FREE in the Prime store.When you find an item you want to watch, the first options are, \"Watch in HD $x.xx, Watch in SD $y.yy, Other ways to watch\"NOTE That nowhere there was PRIME or FREE or Click for Prime. Once you click other ways to watch, you are taken to a submenu that then shows PRIME as an option.After you select PRIME, you are prompted for your buying PIN....even though you are not buying anything...This is do-able but not ideal. C'mon Amazon, you can fix this and I know you will.It does not have an App for the Amazon Music Store or Amazon Cloud Player. That would be great to have to stream your Amazon music.That's the negative portion of this review.Everything else about this device is great.It is fast with it's quad-core CPU.The channel selection is respectable, though AppleTV's is longer, I feel that Amazon will win out in the content war.I hope this review has been helpful!", "verified": true, "helpfulness": "5/5", "author": "Howard C. Trumbull \"They Call Me Rev\""}, {"rating": 3.0, "review": "I needed a replacement for my aging Roku XDS. I thought I would give Fire TV a try. The box was easy to set up and get onto my network. I'm not really an ala carte movie renter. I prefer to pay a monthly fee and get access to a lot of content. As such, I prefer Netflix and Amazon Prime videos to Amazon Instant Videos. So I didn't really get a lot of benefit from always being in the Amazon Instant Video \"App\" because I was always having to load up the Netflix app.The voice search was nice and fairly accurate, but it seemed to only search Amazon for movies. Case in point; I searched for \"Breaking Bad\", something I knew to be on both Amazon and Netflix. I expected to be told that it was on both. Instead, I was directed to the pay-per-episode on Amazon even though the entire series was on Netflix.The Roku 3, which I purchased when I sent back the Fire TV will report hits on both Amazon and Netflix.", "verified": true, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Seems like you have to buy everything. Netflix? - must subscribe. Amazon Prime Videos - must subscribe. Popular Movies or TV - must buy individual episodes. So I'm spending $99 for the box to get the right to spend more money is the way I see it. I'm oytta here.", "verified": true, "helpfulness": "7/42", "author": "Donald Aguiar"}, {"rating": 4.0, "review": "Just received my Fire TV yesterday. It arrived on time as guaranteed by Amazon. I don't have much experiences withe set top boxes like the roku, or apple tv, however I was never interested in those just for the lack of the dolby digital 5.1.  After reading all of the information on the Fire tv, I decided to go ahead and give it a try, as I've been paying for Amazon Prime for about 3 years now and was never able to watch any prive videos due to my mediocre clear wimax wifi. After reading about the ASAP feature of the Fire tv and the ability of the dolby 5.1, I ordered it. Like I said earlier, my wifi isn't that strong, but i have been using the fire tv for about a day and a half and am completely satisfied. There is very little buffering, mostly at the begining of the video. The Box has one year warranty. So, Once again, with the limited use of this product, in my opinion, the Fire tv is an Excellent Product.", "verified": true, "helpfulness": "2/2", "author": "Michael Kimbro"}, {"rating": 5.0, "review": "What's up with all the haters?  Amazon Fire TV is awesome.  Most people will just watch streaming movies, etc. with this device. I upgraded from a blu-ray player used for streaming.  That device was slow and regularly paused and dropped connections.  Amazon Fire TV is blazing fast.  The movie starts the minute you click on it.  I've had it a week and watched several movies and not one disruption in streaming.  Also produces incredible sound quality.  99% of people will probably love this device.  I did not even care about the voice search, but it works incredibly well and is a great bonus.", "verified": true, "helpfulness": "3/3", "author": "Jeff B. Spears \"Texas Lake House\""}]