[{"rating": 4.0, "review": "Great buy, had it streaming to my TV in just a few minutes.  You're getting a lot of cool features for small price tag.  The potential for future app's is great, looking forward to see whats next.", "verified": true, "helpfulness": "0/0", "author": "McGoo"}, {"rating": 1.0, "review": "The setup screen came up right away but then would not connect to the router and the google chromecast website advised me to contact netgear. I had no idea this would be so difficult to set up. It's going back! What a waste. I'm not a computer geek who sits around reconfiguring my router. But I am quite savvy and resourceful. This was beyond the amount of time and energy I'm prepared to spend on it for the very little that this product will do.", "verified": false, "helpfulness": "2/5", "author": "just_do_it_28 \"just_do_it_28\""}, {"rating": 3.0, "review": "For now it seems like the google chromecast is very limited to what you can do with it. I hope there will be more apps you can use with it. I was hoping that I could use anything that was on my phone with the chromecast, but that is not the case, unless I just don't know how to use this thing.", "verified": true, "helpfulness": "0/0", "author": "Milton Rodriguez"}, {"rating": 3.0, "review": "It is slick, cool and very easy to setup and use. Streams without any issues and the quality of video and audio is impressive.Cons: Doesn't support a few popular apps like huluplus.com, vudu or amazon video.Worth the money I guess. I use it for streaming youtube, netflix and hulu from my iphone and those work seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Santosh Prakash Kumar"}, {"rating": 5.0, "review": "If you are looking for an easy and cheap way to watch Netflix on your TV then look no further. The Chromecast is a very simple \"plug-and-play\" solution for anybody with an Android, iPhone or PC (will probably work with others I just have not tested). The only requirement is you have a HDTV (with an open HDMI slot). Love this product.", "verified": true, "helpfulness": "0/0", "author": "Stephen Meriwether"}, {"rating": 5.0, "review": "Got this for my parents - had to set it up for them, but when I got it working they were ecstatic! the only way they watch Netflix now", "verified": true, "helpfulness": "1/1", "author": "Michael R Hutchinson"}, {"rating": 5.0, "review": "The interface is simple  ,the setup even simpler (just hook it up to the tv really) its a good price and is barely noticeable.", "verified": true, "helpfulness": "0/0", "author": "Alizia"}, {"rating": 5.0, "review": "Whether receiving or giving, it's well worth it. And it's so reasonably priced, there's no excuse for everyone not to own one.", "verified": true, "helpfulness": "0/0", "author": "Afolabi  O Oyelowo"}, {"rating": 5.0, "review": "Hi all,Well got my Chromecast device and got the app installed on my Samsung Galaxy 10.1 tablet and am quite happy with how it's all working now. It was a bit glitchy in the beginning but after retrying I'm watching episode after episode of \"Being Human\" via Netflix.Little history as to why I'm so pleased. I bought a Sony Blu-ray player well over 2 years ago. It was a mess from day one. It worked well playing DVD's and Blu-ray disks but connectivity was always a glitchy at best! While other wireless devices ran fine in the living room the players built in WiFi was just not up to snuff. Then the entire player took a dump the other day and that was that. It's being replaced with a more updated Panasonic Blu-ray player that should be here any time now. In the mean time, same order, I got the Chromecast device and it arrived yesterday. I decided to hook it up this AM. Not one delay, picture is totally awesome and pixels are tight and fluid (the Sony Blu-ray player, when it would connect, gave me horrible issues with grainy and pixelation, hated it) so this is a total step up in quality for such an affordable price.1) You do NEED to have a TV with an available HDMI port.2) You do NEED to have either a USB port or an extra outlet plug (for using the USB to Wall Outlet converter that's included, either works fine)3) You do NEED a compatible device like a phone, tablet or laptop that can run either Chrome browser or install the Chromecast app. I got mine via Google Play store for my tablet.4) You do NEED to take a few minutes looking over how to navigate. While most of it is easy to figure out there are a couple of sticky areas that you will familiarize yourself with, like navigation (example: from wanting to switch to a different movie or show)!I think there are a couple of things that need to be looked at though.1) A proper remote with a screen that's specially made for Chromecast. I don't like having to drag out my tablet to control it. I'm sure I'm in the minority here but yea, don't like that.2) Adding in Amazon's Instant Video is essential. I mean really, this is sold at Amazon but Amazon and Google haven't yet gotten together to add the needed code into the device. It's kinda sad but admittedly I use NetFlix mostly anyways.Thanks Google for this brilliant device. Keep developing it!", "verified": true, "helpfulness": "0/0", "author": "R. A. Mccormick \"---Wolff On The Prowl---\""}, {"rating": 2.0, "review": "We wanted to love the Google Chromecast, which we purchased to use with our wall-mounted television above our treadmill (running indoors can be less than interesting without something good to watch). Unfortunately, the Chromecast worked intermittently -- was difficult for my husband to set up -- and didn't hold the settings well. We returned this item within one week and replaced with AppleTV.", "verified": true, "helpfulness": "0/0", "author": "Janine Krantz Fugate"}]