[{"rating": 5.0, "review": "Simple, effective.", "verified": true, "helpfulness": "0/0", "author": "jwf"}, {"rating": 5.0, "review": "I watch Netflix on my regular flat screen. Why get a smart TV!?", "verified": true, "helpfulness": "0/0", "author": "Santi's Account"}, {"rating": 1.0, "review": "It worked exceptionally well at first, three-month later, I can't even connect it to the same TV I have been using it on! Trash, very frustrated!", "verified": false, "helpfulness": "5/8", "author": "Madonna"}, {"rating": 4.0, "review": "This is the easiest way I've found to send my computer screen to my tv. It is super easy to set up. It just works! Now that Google has opened up and is allowing anyone to write programs to use it its even more useful because I can send almost any media to to it. I'm going to buy a 2nd for our bedroom tv.", "verified": true, "helpfulness": "0/0", "author": "Ed Beauchemin \"Ed B\""}, {"rating": 3.0, "review": "It's great, only it's finicky. It doesn't always work perfectly. It sometimes lags from the computer to the TV. When it's working it's amazing. Which is 90% of the time. But I really don't think anything from google should work any less than 100% of the time.", "verified": true, "helpfulness": "0/0", "author": "jesse alexander"}, {"rating": 1.0, "review": "Very unreliable.  Just stops \"casting\".  Many resets on \"plug\" and router, firmware updates, and calls to tech support.  But it's great when it works.", "verified": false, "helpfulness": "0/0", "author": "arnoldripkin"}, {"rating": 5.0, "review": "Everything I hoped...will buy a 2nd", "verified": true, "helpfulness": "0/0", "author": "DaleG"}, {"rating": 5.0, "review": "Loving it, my son wanted one of these for Christmas now every TV in the house has one. So anytime any one wants to share its easy to do. Easy technology to use since I am not tech savvy I was able to do this on my own.", "verified": true, "helpfulness": "1/1", "author": "Beatrice Sarver"}, {"rating": 4.0, "review": "Great, but could use better support for Apple products. I understand the OS rivalry, but I don't want Android to be able to make full use of the Chromecast.Biggest flaw is that it only uses 2.4GHz band.", "verified": true, "helpfulness": "0/0", "author": "Owen S."}, {"rating": 5.0, "review": "I love my Chromecast. It is very easy to use, especially with my Chromebook I have. I not only use this to stream movies and videos for my daughters I use it with my kindle unlimited as a teaching tool. I home school my children and it is so much easier to stream whats on my screen then to have them crowded around the computer screen. It was very easy to set up .", "verified": false, "helpfulness": "1/1", "author": "mommyof2armybrats"}]