[{"rating": 5.0, "review": "So easy to set up and works flawlessly.  Best part (if you're an Android user) is that all charging cords work with this product.", "verified": true, "helpfulness": "0/0", "author": "Dale B."}, {"rating": 5.0, "review": "I've had one for a year + and got this for another TV. There is no better streaming device on the market for the money....sorry Amazon Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "jhutson"}, {"rating": 5.0, "review": "Just what I'd expected and more!", "verified": true, "helpfulness": "0/0", "author": "NeedstoLaugh"}, {"rating": 5.0, "review": "Gooooood", "verified": true, "helpfulness": "0/0", "author": "NAWAL h alenazi"}, {"rating": 5.0, "review": "The best device I've purchased in years!  Works beautifully with both my phone and my Chromebook.", "verified": true, "helpfulness": "0/0", "author": "Leslie Nelson"}, {"rating": 4.0, "review": "Wish it was connected to more tv apps.", "verified": true, "helpfulness": "0/0", "author": "Colleen"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "Patricio Reggi"}, {"rating": 4.0, "review": "I have two of these in my house and they serve their purpose very well.  I keep most of my media on my computer or NAS drives and feed it to my chromecasts via Plex Media Server(free).  Chromecast is lacking apps that AppleTV has, but I have both and they both serve different purposes in my house.  Neither device can do everything.  First one their wins, but then again, do they really want to.....I still own both which is good for everyone.  Chromecast gets better slowly, and hopefully more streams will become available, but for the price point, its tough to beat. Only thing preventing 5 stars is the that not everything can stream to it, but what can, works great.  Enjoy!", "verified": true, "helpfulness": "0/0", "author": "Tech Junkie \"Tech Junkie\""}, {"rating": 1.0, "review": "Horrible little device because:-I can't stream videos from my laptop or pc except .avi.-when it streams the videos it freezes and stops working- can't use Netflix outside usa- can't be used in hotels- can't be used without Internet (purposely done so so that Google can save your watching habits", "verified": true, "helpfulness": "0/1", "author": "John S"}, {"rating": 5.0, "review": "Works great.  Attached to an extra HDMI port on my TV, I can cast my Android phone screens to the TV, or any webpage from my chrome book.  Most apps have an icon that permits the phone app to be cast to the TV; however, there are a few apps that block the casting of video, such as nfl mobil.  It is great for viewing your  own photos and videos on full screen HD TV, or You Tube videos, etc.  If you do not have the Amazon TV App on your TV, then you can cast downloaded movies to the TV from your smart phone with no loss of fidelity.", "verified": true, "helpfulness": "0/0", "author": "F. Futch"}]