[{"rating": 4.0, "review": "HAVEN'T USED IT YET BUT I EXPECT AT LEAST 3-4 STARS. I BOUGHT 3 AND WILL BE GIVING THESE OUT AS GIFTS. I'VE READ ALL ABOUT THE CHROMECAST AND I HOPE IT TURNS OUT AS GOOD AS ADVERTISED.", "verified": true, "helpfulness": "0/1", "author": "HAPPY SOMETIMES"}, {"rating": 5.0, "review": "They knocked this one out of the park.  It was a snap to install.  It hooked into my wireless network easily -- something some other streaming devices still struggle with -- and the integration with the other devices in my house (from laptops to Android phones) was immediate and seamless.  I mean that, really.  We got it in, and suddenly both my phone and my wife's were able to send YouTube videos to the TV, and it even managed the conflict between the two of us by establishing a \"Stream to TV\" Queue.It used to be that the \"Watch it Later\" button on YouTube was a way for me to express interest in a video but tacitly acknowledge that I was never going to take the time to watch it.  There are better things to do at my desktop.  But chilling out in the bedroom.  Sure, I'll queue up half a dozen little videos and catch up every few days.So yeah, this one worked so well that it was practically indistinguishable from magic.", "verified": true, "helpfulness": "0/0", "author": "D. Thompson \"Mr. Hippo\""}, {"rating": 5.0, "review": "THIS IS AWESOME. I HOPE THAT MORE WEBSITES WILL BE AVAILABLE IN CANADA TO USE IT.ALSO A MORE USER FRIENDLY SOFTWARE TO ALLOW THE PLAYING OF STORED MOVIES", "verified": true, "helpfulness": "0/0", "author": "D A W ANDERSEN"}, {"rating": 5.0, "review": "Works great. Setup is a little cumbersome but once installed, it works perfect. Have seen a few online automatic updates since buying it on opening day. I like it so much I bought a second one to give as a gift.I bought with the expectation that it will become more versatile as more vendors take advantage of it and Google expands its capability.Before buying this my Netflix app was only on my Samsung Blu-Ray player which meant I could only watch Netflix material on the computer to which it is connected. Now I can move the Chromecast dongle to any HDMI capable TV and watch Netflix there.Thumbs up! Assuming Google enhances its firmware and versatility in the future.", "verified": true, "helpfulness": "0/0", "author": "rickko"}, {"rating": 4.0, "review": "Casting streamings other than YouTube faces some difficulty and not smooth. However for Youtube stuff, it is great and so easy.", "verified": true, "helpfulness": "0/0", "author": "Omar"}, {"rating": 2.0, "review": "I have to say that i was so exciting about a good brand streaming for 35$, but it isnt as good as i expect, first only works on youtube and netflix (this works great on ios 7.02) but a have a galaxy tab 2 updated both android and nexflix app but there isnt very estable on it, continuosly have to restart the app it stops or stuck buffering.no plex, none of video media player...only 2 stars, i hope that more app become compatible with it or iam going to sell it and buy another apple tv.", "verified": true, "helpfulness": "0/1", "author": "Gilbert \"sound and tech...\""}, {"rating": 5.0, "review": "Long waited shortcut to view favorite videos via tv. very cheap, according to performance. Included all you need in beautiful package. Bought two more for my son and son-in law. Great present", "verified": true, "helpfulness": "0/0", "author": "pool boy"}, {"rating": 2.0, "review": "Way to limited. Cannot get Chrome on my Kindle. There are many more streaming boxes out there that are easier to use and stream more content.", "verified": true, "helpfulness": "0/1", "author": "Gypsy Jack"}, {"rating": 4.0, "review": "I love the Chromecast, but ...  The problem is with Chrome (the browser) for Android.  My android phone AND my android tablet CANNOT cast a tab to the Chromecast device at all, as it is NOT supported.  You can only cast a tab using a Chrome browser installed on a PC or Mac, and never on an android phone or tablet as the modified android Chrome browser does not support casting.That sucks.I suggest EVERYONE email and write Google to add Chromecast support to the android Chrome browser.  THEN this little gadget would be PERFECT and everyone should have one.  Until then, it only gets 4 out of 5 stars.", "verified": true, "helpfulness": "1/1", "author": "Chris L Lemke"}, {"rating": 2.0, "review": "Chromecast is a neat idea but at this time that is all it is.  Without support for more apps it has extremely limited use.  You might as well pay the extra money and buy a Roku or Apple TV which have a full feature set.  The only reason i'm giving two stars is that the device itself is neat and works decently from a technical perspective.", "verified": true, "helpfulness": "0/0", "author": "Jesse N."}]