[{"rating": 2.0, "review": "Works but only with certain sites. It is not like Google airplay.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Chromecast, does not need to add anything - WORKS GREAT", "verified": true, "helpfulness": "0/0", "author": "Guy Granit"}, {"rating": 5.0, "review": "We have Netflix but didn't want to have to purchase a compatible blu-ray player or game system to watch it in the bedroom.  This google chromecast is so easy to set up.  You plug it into a HDMI spot on the tv, download the app and follow the directions.  The instructions are very easy.  The only thing I don't like about it is the fat that you have to have it plugged into the wall the whole time it is in use.  It picks up the signal well though and you can watch Netflix and the other apps the same way you can on the game systems and blu ray players.  I was given one as a present and then had to purchase one for my dad as well.", "verified": true, "helpfulness": "0/0", "author": "Barbara G."}, {"rating": 5.0, "review": "Love this thing.  Cheap and does what I need it to do.  I borrowed my friend's Apple TV and I gave it back to them because this worked way better.", "verified": true, "helpfulness": "0/0", "author": "Gerjoriz Ricafrente"}, {"rating": 2.0, "review": "Second time buying this and second time finding out it didn't support The app I bought it for.", "verified": true, "helpfulness": "0/0", "author": "mayara"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/0", "author": "Edith Hopson"}, {"rating": 5.0, "review": "This was a great buy! I use it to cast my powerpoint presentations so now I do not have to use my laptop!  Very easy to use and setup!", "verified": true, "helpfulness": "0/0", "author": "Derek Higgs"}, {"rating": 5.0, "review": "Very cheap but very cool gadget!", "verified": true, "helpfulness": "0/0", "author": "Rafferty"}, {"rating": 1.0, "review": "I am a google fan. I love Android fan. This device is not what I would expect a company like Google to put their name on. Updates constantly break things. It is not standard HDMI compatible, I ended up replacing it with a ROKU Streaming stick and all is good.", "verified": true, "helpfulness": "0/0", "author": "Miggo"}, {"rating": 5.0, "review": "This device is fantastic, it allows me to show videos and various entertainment sources from my tablet and my phone.", "verified": true, "helpfulness": "0/0", "author": "Ralph Clark"}]