[{"rating": 3.0, "review": "Unless Amazon and Kindle gets the international region limits removed having Prime Instant Video is a Zero benefit to you, even certain apps advertised carry same limitations so as a buyer by cautious about this. Therefore I myself didn't invest in having one the product looks good, I wish all the US users a thumbs up and say too you enjoy.", "verified": false, "helpfulness": "2/5", "author": "EVAN"}, {"rating": 4.0, "review": "The fire tv box is very quick, make a selection and it's loaded instantly, the picture and sound quality is excellent, and the voice search is the best I've ever used. Fire TV will need to add more content before it can challenge the Roku offering, and I would like to be able to pin and arrange my installed apps on the home screen. over all the Fire TV box is technically superior to it's competitors,but for now the limited channel and apps is it's only drawback. For it's quality and future potential I would recommend it", "verified": true, "helpfulness": "0/0", "author": "Patrick Ifill"}, {"rating": 5.0, "review": "Awesome.  Buy this now.  Best set top box out there.  Games. Apps movies oh my.  Super good.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "The unit works great as far as I can tell, Tried to watch a movie the other night and it would not work. Tried to watch a television program and it still would not play.Havn't tried since. The movie and television selections seem to be limited unless you purchase or rent each movie or episode. Will be testing Netflix and Google next", "verified": true, "helpfulness": "1/3", "author": "Alvin Bailey"}, {"rating": 5.0, "review": "My Roku sometimes had a slight latency problem: not enough to be really bothersome, but noticeable. Having used the Fire TV for a week or so, I notice no problems at all, and the voice command feature is wonderful.", "verified": true, "helpfulness": "1/1", "author": "Robin Osborne \"Robin\""}, {"rating": 4.0, "review": "I expected more programs from amazon prime. Don't count my words.  If I had more to say it would come out.", "verified": true, "helpfulness": "0/0", "author": "David Majors"}, {"rating": 4.0, "review": "I really have enjoyed the FireTV. I am dis appointed that unless you have cable some of the apps will not work such as the ESPN app. This is not mentioned in the product and is very misleading.", "verified": true, "helpfulness": "1/1", "author": "Mrs. Wilm \"JOC\""}, {"rating": 1.0, "review": "Bloomberg Live T.V. does not work in spite of numerous complaints to Amazon.  Maybe this is a Bloomberg problem - that's what Amazon says, but nevertheless, my Fire T.V. won't stream live Bloomberg t.v.  Major disappointment.", "verified": true, "helpfulness": "1/9", "author": "lawyer friend"}, {"rating": 5.0, "review": "It's everything I expected!  I ordered this the day it came out, not knowing that it was even coming out, I just happened to catch a news article of its release.  Since I spend a LOT of time watching Prime Instant, I took a chance and went for it.  It's a lot easier for us than hauling our laptop into the living room, hooking it up to the TV, and trying to make it work correctly.If possible, the picture on our 54\" HD is CLEARER using Amazon Fire TV than the picture that comes from our cable HD channels.  Very little loading time, and no buffering time - quite awesome, considering that our cable provider has crap service, and I almost always have loading time and generally at least one buffering point when I watch Amazon on my computer.However, Amazon Fire TV *really* needs more apps.  Games are fine, music is fine, but let's get some content!  And I'm not talking about content like ESPN or Showtime, where I have to have a cable subscription (either a cable package, or a channel subscription) to use them.  I want to CUT the cord, not supplement it!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Dillon"}, {"rating": 5.0, "review": "There is no clear leader in the set top box market yet.  Fire TV has real chance of becoming a leader.  The broader range of content and video games will be key drivers for this device.", "verified": true, "helpfulness": "0/0", "author": "Geronimo"}]