[{"rating": 4.0, "review": "I've been using Chromecast at home to stream from Netflix and Amazon Prime.  My internet tends to be unreliable in the area I use the device, and I've had some trouble with connectivity.  I purchased a few Chromecast devices for teachers in my school this year and so far it's gotten great reviews.  It's easy to set up and to use.  The teachers love the ability to wirelessly connect to their projectors.  Teachers have been connecting to Chromecast with MacBook Airs and Samsung Chromebooks.  The range is about 10 feet.  I see a lot of promise for students presenting work wirelessly as well.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 5.0, "review": "LOVE MY CHROMECAST!!!!!", "verified": true, "helpfulness": "0/0", "author": "Lynnette Southwood"}, {"rating": 5.0, "review": "Works as advertised, very happy with product !!!", "verified": true, "helpfulness": "0/0", "author": "rrmode"}, {"rating": 3.0, "review": "I wish you could do a little more besides some limitations of using chrome and such but this is pretty cool", "verified": true, "helpfulness": "0/0", "author": "Allen"}, {"rating": 5.0, "review": "Google has done it again. They are gonna own the world in a few years. Take any HDMI capable computer and turn it into a Smart Tv. This has given me hours of reliable streaming from my Phone and Computers (I have a Mac, my siblings use PC). Wirelessly, fast, clean, HD image, and basically plug and play. Would definitely recommend!", "verified": false, "helpfulness": "0/0", "author": "Luis Decamps"}, {"rating": 5.0, "review": "It does what it says it does and it works great! I especially love the screensavers, they're beautiful. The only thing I wish it could also do is stream your actually device on the TV. But for what it costs I can watch Netflix on any TV in the house!", "verified": true, "helpfulness": "0/0", "author": "X"}, {"rating": 5.0, "review": "Great product. It works well on my computer and my iPad. It is great for my tablet because I can take my shows whoever I go.", "verified": true, "helpfulness": "0/0", "author": "Deborah Trainer \"crystaldust\""}, {"rating": 5.0, "review": "Its Great! I use it to watch Youtube videos, Crackle and Hulu. Its fast about 2-5 sec to load, good price, good apps for it and easy set up.", "verified": true, "helpfulness": "0/0", "author": "Jay Elstun"}, {"rating": 1.0, "review": "Cant get it to work!  My husband and I have spent ours", "verified": true, "helpfulness": "0/2", "author": "Kristina O'Brien"}, {"rating": 5.0, "review": "I love it. It had met all my expectations and this is why I love Google.", "verified": true, "helpfulness": "0/0", "author": "Lindell Tulloch"}]