[{"rating": 5.0, "review": "Have this device now going on 5 weeks.  So far, no issues.  I love it.  Faster than the Roku I have in my bedroom.  Have not had to \"unplug\" and plug in to \"dump\" memory/data.  Fast.  Love the voice feature for quicker searching.", "verified": true, "helpfulness": "1/1", "author": "Shawn"}, {"rating": 5.0, "review": "Easy to use, love being able to use apps w/the touch of a button.  Very small piece of equipment, but tons of uses.", "verified": true, "helpfulness": "0/0", "author": "Patricia Petit \"Patricia\""}, {"rating": 5.0, "review": "Very easy to use.  Hook up was easy. Endless movies.  We are somewhat electronically challenged so this was a good fit. And also was a great price.", "verified": true, "helpfulness": "0/0", "author": "Donna Eakin"}, {"rating": 5.0, "review": "We love it. Easy to install & set up. Vast array of selections available under Amazon Prime. We have changed our satellite TV plan to \"basic\", saving $50 a month.", "verified": true, "helpfulness": "0/0", "author": "Patricia A Byrne"}, {"rating": 4.0, "review": "I would love to see Prime Music added.", "verified": true, "helpfulness": "0/0", "author": "David L Kropff"}, {"rating": 2.0, "review": "I tried to like it but it just doesn't compete with Apple TV. The interface is annoying and the voice control doesn't work at all. I wish I could return it but I'm past my 30 days. I'll have to sell it on eBay to get my money back.", "verified": true, "helpfulness": "1/4", "author": "walt h"}, {"rating": 1.0, "review": "I don't like it google tv is alt betterThe web search is real bad", "verified": true, "helpfulness": "2/10", "author": "nadia"}, {"rating": 5.0, "review": "At first I thought it would be difficult to give up satellite  TV, but we have really enjoyed our Fire TV, and haven't missed it a bit!", "verified": true, "helpfulness": "0/1", "author": "LovesBooks"}, {"rating": 4.0, "review": "The quality of the streaming is excellent in 1080p . it is easy to use with the voice search  \"amazing\" . it really lacks in APPS however , there is not a wide variety , this could be because it is fairly new. I have noticed however that they have a Huffington post APP but no Newsmax APP ,that makes me wonder  :-[ ?  in the end I would give it 5 stars if it had more APPS", "verified": true, "helpfulness": "0/0", "author": "Charles E. Brown"}, {"rating": 5.0, "review": "So easy to use and install!", "verified": true, "helpfulness": "0/0", "author": "vfkpfk"}]