[{"rating": 3.0, "review": "Cannot stream local videos. Google blocked this aability just after I made the purchase. I bought it specifically for watching my personal videos on the TV.", "verified": true, "helpfulness": "0/0", "author": "Edward E. Hagins"}, {"rating": 5.0, "review": "For the money this is good buy. The technology is a good option to have if you don't have smart TV. In my opinion it is better than its competition currently in the market. Expand the apps and it will be great!", "verified": true, "helpfulness": "0/0", "author": "Joshua C. Ostergard"}, {"rating": 3.0, "review": "It was very easy to setup (I have IT experience).  I connected it to my iphone and was a little disapointed that there seems to be limits apps for it at this time (from the iphone) to youtube and netflix only.", "verified": true, "helpfulness": "0/1", "author": "Steve"}, {"rating": 5.0, "review": "This is such a great item to buy if you find yourself watching Netflix and you tube a lot. Perfect for the whole family and great for parties because you can use Pandora.", "verified": true, "helpfulness": "0/0", "author": "jeflores62"}, {"rating": 5.0, "review": "So easy to set up and use. Love the convenience of being able to stream to my TV from my phone/computer without having to hook up cables. I am hoping to be able to use Chromecast for more than Netflix streaming, etc.", "verified": true, "helpfulness": "0/0", "author": "sindy cantor"}, {"rating": 5.0, "review": "SUCH A GREAT PRODUCT I LOVE HOW IT PROJECTS WHAT'S ON MY LAPTOP OR TABLET OR PHONE, ONTO MY TV IS JUST SO AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Zack Liber"}, {"rating": 2.0, "review": "Please be aware that wifi hotspots will not work with the setup. It takes out the complete internet while setup and if you are using your laptop as a wifi hotspot, then this will not work.", "verified": true, "helpfulness": "0/0", "author": "user1"}, {"rating": 5.0, "review": "Simple, easy, and awesome!  I was watching NetFlix in minutes!  This simple device delivers on its promise of making it easy and intuitive to watch YouTube and NetFlix content whenever I want.  The integration into smartphone apps makes it a no brainer - no more looking for and suffering with an infrared remote.", "verified": true, "helpfulness": "0/0", "author": "BEN MEDVITZ"}, {"rating": 4.0, "review": "Great device and easy to use.  The google play option is nice with the first 3 months free.  The product is well built and thought out for most streaming uses.", "verified": true, "helpfulness": "0/0", "author": "troy groetken"}, {"rating": 4.0, "review": "I purchased ChromeCast for use with Aereo as a small experiment. I just recently got a new apartment and was trying to save money by using Aereo as my go to Television source and using Chromecast to Cast my video. The idea is a fairly common one but it is not officially supported by Google as of yet. So while you are in fact able to do this by watching TV from Chrome using Aereo and then casting a tab it does not work perfectly. However, when using Chromecast supported apps the Chromecast works wonderfully. Netflix and Youtube are easy to use and controlling either from a pc, tablet, or smartphone is easy peasy. For $35 I think this is an absolute steal!", "verified": true, "helpfulness": "0/0", "author": "M. Norton"}]