[{"rating": 5.0, "review": "Wireless would not connect initially because of long password. Connected to wifi with shorter password and was able to do an update which allowed me to connect to wifi with long password.", "verified": true, "helpfulness": "0/0", "author": "Shanna"}, {"rating": 4.0, "review": "Hard to believe something so small can do so much. Of course it makes me want for it to do more, so PLEASE add more \"apps\" for us!  Especially Amazon Streaming!!! Frankly, the 5th star is because I can't use it (easily) with Amazon...", "verified": true, "helpfulness": "1/1", "author": "JeremyG \"JeremyG\""}, {"rating": 5.0, "review": "Chromecast is easy to install (just plug into an HD TV) and use (download a Chrome browser add-on or mobile app) from any electronic with Chrome browser. The Google Chromecast website lists the music and video sites/apps that work with Chromecast, which are popular sites that I use all the time. Keep in mind that you can only cast from a Chrome browser or Chrome-based apps. It doesn't work with iTunes right now.  You only need: HD TV (with HDMI port), wireless internet, and Chrome on an electronic device (computer, smartphone, tablet).", "verified": true, "helpfulness": "0/0", "author": "Brittany"}, {"rating": 2.0, "review": "I've tried over and over to connect to my wireless network, and it won't do it.  I know what I'm doing - I have connected several laptops, Roku, Sony DVD/streamer, iPhone, etc.  The only guidance Chromecast provides is \"contact Linksys for assistance.\"  No, I'm not going through that.  Chromecast should connect to my network, just like every other hardware I have.  I'm very disappointed in it.  Lame wireless connection capability.*****I did some research and learned that the problem with the Linksys router is that the Chrome does not like its n band. n band is standard now, it's not \"new\" any more, so this is still pretty lame, but if you know how to split the bands and you link to the g band from the router instead of dual/n, it can work. The signal is much weaker on g (thus n band wifi...), and the quality is not as good as I expected, it cuts out frequently, but now it works. Upgrading my rating to two stars since at least it works, and it streams content from the Google Chrome browser which I had to plug a HDMI cable into my computer to do previously.", "verified": false, "helpfulness": "0/0", "author": "Scott C. Brown"}, {"rating": 5.0, "review": "Sorry Google, your device doesn't work as well for me as the hardwire hdmi cable for a lot less cost.", "verified": true, "helpfulness": "0/1", "author": "John S. Pieri \"Lay history buff\""}, {"rating": 5.0, "review": "I like the chromecast because it gives you the ability to cast from your laptop or cellphone paid programs like Netflix, Hulu plus movies and shows on a flat screen that does not have apps installed. if you have a tv that does not have app pre installed then the Google chromecast is for you; its simple to install and you can watch your favorite movies and shows in minutes, I like it so much that I'm going to order one for my sister.", "verified": true, "helpfulness": "0/0", "author": "Mustangfire2017"}, {"rating": 3.0, "review": "I really wish it worked for Amazon Prime :-(  I love Prime, I don't want to have to use Netflix or another service.", "verified": true, "helpfulness": "0/0", "author": "Melanie"}, {"rating": 2.0, "review": "My smart TV does more then this ...really nothing stands out to much I returned it to the store 3 days later", "verified": false, "helpfulness": "0/1", "author": "Defvon1"}, {"rating": 5.0, "review": "I love this Chromecast. Once I got the hang of how to intstall and set up to stream, I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Ms Pamela Lee White"}, {"rating": 5.0, "review": "Its great to watch on TV what your tablet plays.  Its not set up to work very good with apple products, i have to turn off ipad every time to get the chromecast icon to appear where as the galaxy tab works all the time.", "verified": true, "helpfulness": "0/0", "author": "William"}]