[{"rating": 1.0, "review": "What a waste...  Tried to cast video from my laptop (HP Envy I7 core) to my LG LED, and could not get a video to show even at 480P.  When I attempted to go to full screen, the screen simply blacked out.  The audio seemed fine, so if you want to listen to a movie, I guess it would be a good buy.", "verified": false, "helpfulness": "5/5", "author": "Rich"}, {"rating": 1.0, "review": "This device is not compatible with kindle fire HDX. It is frustrating and extremely disappointing that chromecast does not offer an app for kindle!", "verified": true, "helpfulness": "3/3", "author": "Stella Nawrocka"}, {"rating": 5.0, "review": "I have been enjoying this Chromecast from day 1! It does the job as advertised from Google. Installation was seamless! All you need is to give access to your wireless network and Chromecast does the rest. Anybody with almost zero technical expertise can use it! Uses your wireless network to send signal from your mobile devices or computer/laptop so you can be in any room and cast your screen  in your television. If you install Google chrome in your computer and install Chromecast plugin for Google Chrome browser, you can share your computer screen via Chromecast to television. If you have mobile devices such as smart phone or tablets, you can send your media via YouTube, Google Video, Hulu, Netflix etc. only as advertised in Google Chromecast website.Enjoy Chromecasting!", "verified": true, "helpfulness": "1/2", "author": "K. Acharya \"Reading Bug\""}, {"rating": 4.0, "review": "Could only love it more if it worked with Amazon.com. Works fantastic with Netflix & Google Play. Hangs a bit with YouTube.  Worth the price.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline A. Kaufmann \"Kindler\""}, {"rating": 1.0, "review": "I bought this thing because Google advertised \"..send anything on the web to your TV from your smartphone, etc.\" and \"Works with Android, etc.\"  I can watch Netflix and You Tube but NOT the web because, believe it or not, to do that you need a Chrome browser extension that is not available (NOT YET, says Google, try later!) for my Galaxy S3 (that uses the Android OS) but is only available for Windows, etc., NOT for an Android smartphone. Another disappointment from what was once a dazzling company.", "verified": false, "helpfulness": "2/4", "author": "Patrick L"}, {"rating": 1.0, "review": "Very difficult to install had to use Google to use it, with there tool bars and add ons. Was so disappointed.", "verified": true, "helpfulness": "3/4", "author": "Luis E. Dessus"}, {"rating": 5.0, "review": "Great device.  Easy to use and gets rid of a remote since I get to use my smart phone instead.", "verified": true, "helpfulness": "0/0", "author": "TeeCee"}, {"rating": 5.0, "review": "I'm glad I waited for some more apps to get released. It is super easy to use and I regularly use HBOGo, Netflix, and Youtube with it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Hans\""}, {"rating": 1.0, "review": "Ok, I don't know why people are raving about this product because it doesnt do much of what people on You Tube as saying and the reviews as well.  This product doesn't do anything it only takes us back to the \"gilda years\" in 90's when Microsoft Web TV was a flop and 3D has failed. Here is why...1) Why would you buy this product when you already have NEW TV's that have \"internet application\" already which are \"smart TV\" with NetFlex, YouTube, and a browser?  Really, all you should already2) Plus you CANNOT use your Tablet to mirror off on your TV because Google Play Store does not support Google Chrome.  You HAVE to go to Google Store to play games there to mirror off your tablet or laptop.Note: I bought this product thinking that you can use your Tablet that already google playstore purchased apps to play off on the TV from the Chromecast Device....IT DOES NOT!!!  (find another device on Amazon that you can do that)3)  I wanted this product so that I can use my laptop to work off my desktop and use it for Excel, Work and (see my laptop) on the TV screen...IT DOES NOT!!! If you want to search the web, email and other stuff, you must be on the Google Browser to see ONLY what on the Google Browser and NOT on Explorer, Firefox, etc.  (you got it?)Note: Its a really dumb device because it ONLY does what google wants it do ONLY.  Google does NOT support Windows and Windows does NOT support Google (The want to keep it a competition and a monopoly) until they are willing to together as a unit or company and make each product compitable to work on each other software platform, but I doubt that for know, because both of them are too greedy and needs to do it for the people or consumer.Note: When I hooked up this device and saw my Google browser, I noticed that my Bluetooth Mouse Did NOT appear it was invisible, but you can click on images, type, but you won't see your Mouse Pointer or taskbar on top, because remember, Microsoft owns that taskbar or pointer on their Window platform...you understand?This happens to be a really dumb product and I don't why the everybody is \"raving\" about it when Microsoft made a similar product called the WebTV and that FAILED! So will this product.  I know I know everybody is saying that is still in its infantcy stage but that what they said about WebTV and it was (paid sucription) and didn't go nowhere.Everybody wait when they come out with a TV with a computer hard drive right next to the TV so that you can access your TV as a computer while your on your bed or lounge to do your work.  I will be waiting for that, if there is a smart brain out there who is listening.So, I experienced this product and it really didn't nothing for me, because if I wanted a bigger TV for Netflix, YouTube, or Google, then I would buy a BIGGER TV WITH ALL THE FEATURES without buying a small device.", "verified": true, "helpfulness": "2/9", "author": "Norma Cano"}, {"rating": 5.0, "review": "I got this as a christmast presant for my brother, He just loves it. Comes out of work and starts sreeming.", "verified": true, "helpfulness": "0/0", "author": "Nelson Rosario"}]