[{"rating": 2.0, "review": "No HBO Go = No Amazon Fire - Only streaming appliance that doesn't have HBO Go!", "verified": false, "helpfulness": "2/7", "author": "JoshT"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Charles F. Mcmaster"}, {"rating": 2.0, "review": "Have no idea how to use or install it and will return it.", "verified": true, "helpfulness": "0/10", "author": "Jim Cooney"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE it!", "verified": true, "helpfulness": "0/0", "author": "M. Natale"}, {"rating": 1.0, "review": "This unit has not worked properly since I purchased it 6 months ago.  Despite all efforts it will not connect to my wireless network.  I have set, reset and rereset it many times.  I have manually verified the IP address, etc. to no avail.  After 5 calls to Amazon customer service I still have no resolution.  According to Amazon the problem is my wireless network however every other piece of equipment I try connects to the network with no problem (including an Apple TV unit).  They are unsure of what to do.  Every call they say they will have someone with more tech support experience contact me and I have yet to receive a call.  I find it extremely difficult to believe that I am the only person in the world that has encountered this problem yet Amazon claims they have never received a ticket with this type of issue.As a result, I spent $99 on a piece of equipment that works only if I am lucky enough to pirate free internet from a neighbor's unsecured network.  Which means in 6 months I have used it for a total of about 10 hours of continuously interrupted television.Looks like I will be switching to Apple TV.I am extremely disappointed with this product's performance and Amazon's customer service response.", "verified": true, "helpfulness": "2/9", "author": "Rew"}, {"rating": 5.0, "review": "EXCELLENT*********", "verified": true, "helpfulness": "2/2", "author": "Francis Hung"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "1/1", "author": "antonio kuraica"}, {"rating": 5.0, "review": "plug it in and go. awesome", "verified": true, "helpfulness": "1/1", "author": "Gemsbarb \"Aspie Mom\""}, {"rating": 2.0, "review": "Do not buy if you plan to connect to the internet via a hot spot. It will go through your data plan very quickly. Amazon makes no mention of this limitation in their product profile.", "verified": true, "helpfulness": "1/6", "author": "Elizabeth Nyhan \"beth\""}]