[{"rating": 3.0, "review": "I bought it for my mkv/m2ts collection only. I have WDTV Live, which is mostly reliable, but has older hardware, so I wanted something snappier.I tried Fire TV with XBMC and Plex. Unfortunately, XBMC staggers with files over 30 Mbps, and crashes completely with some of my m2ts while my older WDTV Live plays them much smoother. I can't blame Fire TV for this directly. This must be an XBMC issue, which maybe will be fixed in the future updates. I also must add that XBMC with standard settings was borderline unusable. I spent several days researching and trying different things before I was able to reduce stutter to manageable level. And this is just for smaller files.Plex was a complete joke. Basically it didn't work with high quality files at all.For this reason I'm leaving this product 3 stars. It is most definitely a great piece of hardware with Android OS, but unfortunately the current solutions for blu ray quality files are lacking. I'm keeping my WDTV live and returning Fire TV.", "verified": true, "helpfulness": "5/6", "author": "Internet is for shopping"}, {"rating": 5.0, "review": "It was great thanks.", "verified": true, "helpfulness": "0/0", "author": "John J. Birks"}, {"rating": 5.0, "review": "My family has been cable free for over 4 years thanks to Roku, Plex, Hulu, Prime and Netflix! But the Roku box had so many things that kept it from being great!  I have owned all the Roku boxes made! I also have at work an Apple TV and Chromecast just to let you know some of my history. Then comes the Fire TV! I didn't plan on keeping it when I brought it but thought it look cool and wanted to test it out. First the box itself has a solid feel and some weight to it YES! I hate how they keep making these boxes lighter and lighter to the point they can't even hold down a solid made HDMI cable! Even the remote has a nice solid feel to it and I like the built in Mic.The software is where it stands out the most! It super-fast and love that it has DDPlus! I’ve been watching some of movies off my network with Plex and they never looked or sounded better! Even my wife is impressed with it and she never sees a difference with my upgrades. The last and also one of my family’s favorite things about the Fire is the Free Time; it’s Amazon verse of Parent Controls which is simply a amazing. I also love that they give you Netflix Kids! For the life of me I don’t understand why Roku doesn’t have Parent Controls or Netflix Kids yet!As of right now, we have replaced 3 out 5 Rokus with the Fire TV’s and couldn’t be happier.", "verified": true, "helpfulness": "2/2", "author": "O. Torres"}, {"rating": 5.0, "review": "Love it  Easy to use 👍👍👍", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "When I first heard of this,I was excited. As soon as it was available to buy,I bought it. Amazon Prime,Netflix,and games also all on one device. Unfortunately,I should have waited,although the movie and tv selections stream really well,the game part of Fire tv lacks. There is not enough memory to have more than a few games on your device at once. Telltale games had a few games I was interested enough to buy,Walking Dead season one and two. Luckily,Season one was complete when I bought and paid for the entire season. But season two has been quite a different story. We have been waiting for episode four on Season two for way too long. All other devices have had their download and we are stuck reading about what happens and in effect,spoiling the outcome. In the meantime,if you want to download other games,you will have to uninstall the game that you have been patiently waiting for the new episode. It takes quite a while to install a game so you really hate to have to uninstall it just to play some other game,and then have to reload the whole thing,if and when it finally becomes available. I think their definitely needs to be more memory available if it wants to call itself a gaming device. Really disappointed.", "verified": true, "helpfulness": "2/2", "author": "kpiner"}, {"rating": 5.0, "review": "We really enjoy using it but are having a hard time using it on Amazon Prime with Deadwood.  We don't know if the problems stems from the internet modem we have that has started to have problems or if it is something to do with the amazon Fire TV itself or with the amazon prime movies.", "verified": true, "helpfulness": "0/0", "author": "Lee Roberts"}, {"rating": 5.0, "review": "I purchased a Fire TV for myself and loved it so much I ended up buying 3 more to give as gifts to my parents, sister, and cousin.Not only does the Fire TV give me a huge list of movies and television shows to watch at the click of a button, but it has also enabled me to cancel my cable television subscription. In other words, this $99 purchase has already more than  paid for itself because I got to keep the 120 bucks that I normally gave to my old cable TV provider.Here's a tip: If you want to get even more out of this tiny little box, look into installing XBMC. Thanks to Amazon for making the Fire TV very developer friendly, the possibilities are almost endless.No-brainer 5 star rating!", "verified": true, "helpfulness": "0/0", "author": "Jason Stepp"}, {"rating": 4.0, "review": "If you have a complete built- in television and sound system, I would advise you to contact your local Entertainment Specialist to install the Amazon FIre TV box instead of trying to install it yourself-  too many wire and switches!!!", "verified": true, "helpfulness": "0/1", "author": "Gene Noble"}, {"rating": 3.0, "review": "Uses an outdated Netflix app with the old layout.If your a big Netflix user, I recommend the Roku instead.", "verified": false, "helpfulness": "1/2", "author": "J. Olson"}, {"rating": 4.0, "review": "Four stars because of one HUGE flaw.Lets start by saying we love our Fire TV. It's fast, easy to use and the selection of children programming is fantastic. The device has crash about 10 times since we have purchased it about 3 months ago but as with all electric devices we expect a crash now and then.I actually could go on about all the features and how we use the device but there are so many reviews telling you exactly how amazing it is that my review would be redundant.Instead let me tell you when I will give it that 5th star.The Fire TV kills my family internet bandwidth from COX right now at 250GB around the 13 day of the month!! That's not only insane it costly and frustrating to get repeated emails from COX letting me know how much more we continue to use.We have never had a monthly total over 158GB before, however since the Fire TV we have maxed out our service every month.We went from somewhere around 135-150GB per month to 425-680GB.The Fire TV is an amazing device don't get me wrong but something needs to be done for us to continue using it. We will have no choice to discontinue its use because one device among 10 in our family cannot coop all our internet usage.", "verified": true, "helpfulness": "3/4", "author": "Stephen Mclean \"Stephen\""}]