[{"rating": 2.0, "review": "I actually really like this idea, and the device is very clean and tiny. I am only giving it a low review because of the fact that I was allowed to download youtube on the fire app \"store\", but after loading it, I find out that youtube doesnt support fire tv yet (at least for any purchased videos).This is very annoying, and I did open a ticket with the youtube developers. I would suggest that you, amazon, fire tv, please inform your customers about this glitch with youtube.", "verified": true, "helpfulness": "0/2", "author": "mindmodem"}, {"rating": 5.0, "review": "Very quick and responsive. It goes to instant on when I hit the power button. I also like the variety of apps including my personal favorite, HIGH SCHOOL CUBE. HSC needs to update their app some for better usability, but it sure beats having to AirPlay it with an iPad and Apple TV.By comparison, my gen1 Apple TV is a buggy disappointment and the constant restarts it requires to communicate with my cable modem makes me love the Fire TV all the more. The added bonus of the remote being larger and more useful than that of Apple's is yet another win. Apple TV has been relegated to the bedroom TV now.", "verified": true, "helpfulness": "1/1", "author": "jmerc \"Maybe I've got too many books, and maybe the moon is made of cheese.\""}, {"rating": 5.0, "review": "The blurb said it would be easy. I did not believe this. I WAS WRONG. THIS IS TOTALLY SIMPLE. The voice commands worked the very first time. This is an absolutely magical device. The only drawback was when I tried to watch a second movie and was \"throttled\" by my satellite internet service provider system, which punished me for exceeding my montly download allowance by slowing down my computer!!! (This country needs better rules to ensure net neutrality!) If you want to use this frequently, you need to understand your access and download \"allowance\" and be ready either to pay up, record/watch movies in the middle of the night, or find a different provider!", "verified": true, "helpfulness": "1/1", "author": "Cynthia Wainright \"Cynthia\""}, {"rating": 5.0, "review": "Awesome! Pick from existing and often added to Prime movies and TV. Rent or buy movies that are not Prime. Take advantage of the many, many freebies. We LOVE the NFL highlights. Listening music from Amazon.The TV series' such as Pickers, The Good Wife, Pawn Stars, '24' etc. etc. etc. At Christmas we had the Fireplace with music on our TV. It was SO cozy and romantic for the Holiday.We love Amazon Fire TV. It's a keeper.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"pambitious1\""}, {"rating": 5.0, "review": "I had bought Chromecast, but this unit is the most awesome streaming device ever. You can read all the details, so I don't need to go into it. The best part is bypassing the computer with only wi-fi. The picture is better, the voice control is amazing, I highly recommend. I love watching a movie with a remote instead of a mouse!", "verified": true, "helpfulness": "1/1", "author": "Brent Barber"}, {"rating": 2.0, "review": "This thing is not as user friendly as it could or should be. Bought this for my boyfriend who loves watching Netflix, Prime so we got it for the bedroom.  So far we can't get Netflix to give us a sign in option. I guess time will only tell if it's worth it.", "verified": true, "helpfulness": "0/2", "author": "Jamkee"}, {"rating": 5.0, "review": "Just Wonderful! My son set it up --- very quick and easy right out of the box. Browsing is great. The control and box are small, simple and classy. Very enjoyable to use!", "verified": true, "helpfulness": "1/1", "author": "Elizabeth Roberts"}, {"rating": 3.0, "review": "Setup required buying a switch to enable both fire TV and cable as my TV had only one HDMI connector. This was notmade clear in ad. Program choices and picture quality are good. Would buy it again.", "verified": true, "helpfulness": "0/1", "author": "G. McGonigle \"Mac the Bookie\""}, {"rating": 5.0, "review": "Made my plasma a smart tv", "verified": true, "helpfulness": "1/1", "author": "Andrew Bringuel"}, {"rating": 3.0, "review": "Pricing of new \"Prime\" movies is high - higher than competitor sites such as OnDemand. The device itself works fine.", "verified": true, "helpfulness": "1/1", "author": "John D Rumisek"}]