[{"rating": 5.0, "review": "We received this today, and we just love it. We have already been streaming Amazon video for months through our Sony BluRay players, so we are already familiar with the fun of Amazon Prime vids, renting premium vids, and so forth.This little FireTV is so tiny it's worth installing even on the smallest TV in the house (in this case, our bedroom). It could readily pick up several neighborhood wireless networks, even without a visible antenna, so the wireless connection to our router was a cinch.It arrived already registered to my Amazon account, so all I had to do was enter in the wireless network key. The voice activated search is great. So far, I intend to keep my Sony Blu Ray players at the other TVs for streaming, but the Amazon Fire TV will be a great option if the Sonys give out. I certainly do like having the same watchlist on all the TVs.", "verified": true, "helpfulness": "2/3", "author": "J. Perona"}, {"rating": 4.0, "review": "I usually don't waste my team to leave reviews but today I will.*Picture - after changing settings it appears to be roughly as good as Roku 3, probably not any better*Netflix - has issues with captions having to be turned off each time and picture quality does not look that good. I could not find settings to change captions globally so I have to turn off each time. If Netflix app has hidden settings then this might be the issue.*Plex - locked up several times initially but then started working flawlessly. Now zero issues with Plex. Move covers appear fast. Interface is very fast. FF and RW are pretty quick. Initially Plex defaulted to low bit rate and poor picture, when you turn up the settings everything gets much better. If looking for Plex player then is ok device, on par with Roku but MUCH FASTER. Again much faster on covers and I have huge library f all MP4 AAC files.*Overall Menu structure is beautiful but maybe a little too busy for some. Not sure the complexity helps or adds anything. Roku interface is easier to use. It is however acceptable.*Remote is great! Would be a little better if it had headphone jack. Voice control is interesting. One negative is the voice control just supports Amazon content, movies, TV shows, and Apps. It will not index Plex content.*I did not see or find any type of web browser.*Joystick is great! Actually easy to use a remote as well. Pairing was not possible the first time (device could not find joystick) but after removing batteries and trying again it finally worked. Future uses of joystick have been flawless.*Games - game playback is ok. Does not seem like it is overpowered but lag in the games is acceptable. Much better than Roku!!! Probably not on par with original Wii but if more games are released it might could be.*Storage - 8GB of storage is way too small!!! I have had the device for 2 days and I am right at completely full. This is sad as there are not that many games or apps yet. Just wait until the selection becomes larger. The back has USB port so I have to hope that Amazon soon will energize the USB port via firmware.*If you just want to watch movies then I recommend Roku 3. If you have to have AirPlay then another option to also watch movies is AppleTV, it does not natively support PLEX but iTunes can play local content and does so very fast but content organization is pretty poor. I have all 3 devices. AppleTV does have equal or the best picture of the 3, but picture aside I still like the Roku and the Amazon Fire TV better. If you want to watch movies and play some occasional games then definitely recommend the Amazon Fire TV. If you want a device to play with that has some WOW Factor to it then get the Amazon Fire TV. Plus this is initial release firmware, with this hardware Amazon can certainly make this device much better as it matures.", "verified": true, "helpfulness": "4/5", "author": "nabila"}, {"rating": 5.0, "review": "Ok, wow, let me start by saying that I have three Apple TVs, 4 iPads, 4 iPhones, and 3 Apple Computers (MacBook, iMac, and Mac Mini), and also have a PS4 and PS3 and 2 Roku 3s. Why did I say all that, because I am very impressed by this box, the FireTV, and I think it offers a lot for very little money. I am not going to bash other products, I am simply going to say that given what this box costs, it is an outstanding value, it is very, VERY fast compared to my other systems, and the interface feels very polished.The games run very fast, it has a lot of space, the remote feels very solid in your hand, and has a really nice texture, and for $99 you can avoid paying cable and purchasing an expensive game system, and have it all in one.", "verified": true, "helpfulness": "4/4", "author": "Joe E. \"Joe\""}, {"rating": 2.0, "review": "No VUDU® app! For me, this is one of the 'Big 3', with regard to movie content (the other 2 being Netflix® and Amazon Instant Video®. With regard to FIRE'S® MIMO antenna, I see no improvement in signal reception, compared to ROKU® 1 and 3. With regard to content streaming, it does the job as well as other streaming hardware devices. However, the omission of the VUDU® application will be the reason I'm returning it and going back to ROKU® 3. From my perspective, the omission of VUDU® is a serious gaffe by the FIRE® developers. (Sorry Amazon®... but FLIXTER® doesn't cut-it).", "verified": true, "helpfulness": "10/16", "author": "kpharmd1985"}, {"rating": 5.0, "review": "I bought this to stream Amazon Prime and Netflix. I absolutely love it! It was a breeze to setup and the speed is so fast! I haven't experienced any of the buffering/freezing I sometimes get when I watch on my PC. I tested the voice search and it worked great on everything I tried. I do wish it had more apps like HBO GO and I'd like to be able to watch CBS and NBC shows on it. I am sure more apps will be added as time goes on. Even tho it has limited apps right now I think it is worth the 5 stars for the ease of use, speed, and future possibilities. Amazon does it again!", "verified": true, "helpfulness": "1/1", "author": "Michelle Z"}, {"rating": 5.0, "review": "[UPDATE 8/23/2015]I'm happier with this than I was initially.  I use it most of the time for commercial free TV shows.  Most of my viewing is on the Netflix app for Fire TV.  Maybe 10% is used for Amazon Prime videos.  Upgraded the review to 5 stars.[ORIGINAL REVIEW: 4/4/2014]This thing was released on Tuesday.  I ordered it on Wednesday and received it on Thursday.  I plugged it into the TV on Friday evening, connected it to my WIFI network and the first thing it wanted to do is download an update.  Say what?  Right out of the box, 4 days after its release, I have to update it to use it.But of course, the update fails to download with a message about the performance of my Internet connection.  My Internet connection isn't a 30Mbps connection, but its fast enough to stream movies to my laptop.  But apparently its not fast enough to download the update.  After 2 attempts, it doesn't work.I guess I'll have to wait until another day.  I should have bought a Roku.  At least I could have watched a movie tonight with that.Not up to the same quality that I expect from Amazon.[UPDATE: 4/23/2014]After several more attempts to download the update, it worked.  Once the Fire TV device was up and running, it worked pretty good.  It pauses a lot more frequently than Netflix does when streamed to my smartphone (over WIFI) or to my laptop.  But I dumped my DSL Internet and upgraded to a 30Mbps Charter Internet connection and now the Fire TV never pauses during streaming.The voice search feature only works with the Amazon videos.  It doesn't work in any of the apps.If it had worked right out of the box, and voice search worked for all searching, I might have been inclined to upgrade my review to 5 stars.[Update: 4/30/2015]Been using this device for a year now.  I mostly use it to access Netflix.  I like Fire TV better than Google's Chromecast.  I'll upgrade my review to 4 stars because for the most part, I'm happy with it.  Just about my only complaints are:1) I've had to reset the device to factory specs and reconfigure it twice because it stopped working.  This is annoying.  It loses the progress on any installed game apps.  So I don't use it to play games.2) The Fire TV Controller is too sensitive.  At least 4 times a week, I'll accidentally turn the TV and Fire TV on when I bump the remote.  I hate it when I wake up in the night, reach over to the nightstand for a drink of water or check the time or whatever, bump the Fire TV controller and the blasted TV turns on, Fire TV turns on, and wakes everybody in the room.  It would be nice if there was a way to turn the the controller off.3) There still isn't anything on TV.  Almost always, the movie I want to watch -- even those that have been on commercial TV for years -- is only available for $$$ rental.  This is true of Amazon Instant Video and Netflix.", "verified": true, "helpfulness": "6/8", "author": "P. Swarthout \"Computer Junkie\""}, {"rating": 3.0, "review": "Had to try more than one monitor before it worked.  After downloading and updating the firmware, it goes into this insanely annoying video that you cannot skip through you have to sit through.  Once the box has been through that video once then it worked on other monitors but not before.User interface is a bit blah compared to the competition.  You have to pay for channels that would be free on a roku for example.  Also you have to search for channels they advertise as being supported rather than just have a list of them to choose from.  It has more processing power than the competition but they chose to waste that power on dancing baloney in the UI.So far it simply isnt a roku.  Should get my game controller in the next few days will see if using it for games makes up for its shortcomings...", "verified": true, "helpfulness": "2/4", "author": "DAVID W."}, {"rating": 5.0, "review": "For a first attempt its a great product. Interesting to see how the gaming pans out. Crazy taxi sure brings back some memories.", "verified": true, "helpfulness": "1/2", "author": "Emily Chorley"}, {"rating": 1.0, "review": "Really disappointing.  Poor selection of movies on prime and no way to sort movies that are part of prime.  Caching is poor and video quality is not nearly as good as the chromecast quality.  I am sending it back.", "verified": true, "helpfulness": "15/44", "author": "JKemper"}, {"rating": 1.0, "review": "Fire TV was a replacement for my Roku 3 and Samsung Smart TV PLEX clients.  You have to purchase the PLEX app on the Fire, something you don't have to do with other platforms, but I was happy to throw down a buck to support the PLEX developers.  Bad news, movies and shows on the Fire TV look horrible via PLEX.  Even after bumping the quality settings way up, video on the Fire TV looks dull and less crisp than on the Roku 3 and Samsung Smart TV PLEX apps.  Colors seem washed out, and the playback seems less fluid.  Major audio issues are also apparent - the app won't function at all with some high-end audio selections, and 5.1 doesn't work.  I really wanted this to work, as I am always looking for a PLEX client with a little more to offer.  Unfortunately, Fire TV isn't it.", "verified": true, "helpfulness": "18/40", "author": "Deschutes"}]