[{"rating": 1.0, "review": "dose not work on galecy 2 phone or nextbook tablet works on newer phones so it did not solve my needs so I gave it away", "verified": true, "helpfulness": "0/1", "author": "basicdad"}, {"rating": 5.0, "review": "I love it. I have always wanted to stream online content without wires running all over the place. Kudos! Now if I can justfigure out how to do without sattellite and cable, it would be a big win.William McLeod", "verified": true, "helpfulness": "0/0", "author": "william mcleod"}, {"rating": 2.0, "review": "This thing kinda blows! Thought because Google was behind it, it would rock.Very slow to transition to chromecast, cant control the movies very well at all (pause, rewind...) thought I had turned it off once and found my tablet was playing movies all night long.", "verified": true, "helpfulness": "1/1", "author": "Joseph Tucker"}, {"rating": 1.0, "review": "Very disappointing, I thought i can play anything from my computer and it will projected on TV. Evertime I play something on internet that is live it gets really missey", "verified": true, "helpfulness": "0/1", "author": "Haitham"}, {"rating": 5.0, "review": "Plugged this into our TV and we haven't stopped casting videos and audio files since.  Love that you can cast a video to the device and it will turn on your TV for you.  I ended up moving this to an open HDMI plug in my entertainment/Blue Ray player (Sony) so that we can enjoy the 5.1 audio as well as the video.  It works with the entertainment system to turn it on, switch to the correct video port, and turn the TV (Sony) on as well for a seamless integration.  We primarily use it to watch YouTube videos or listen to Pandora stations and drive the device from our smartphones (Samsung and Apple devices).  We even tend to leave it on when nothing is casting because the photos that Google displays when it is inactive are stunning.", "verified": true, "helpfulness": "0/0", "author": "RMPrime"}, {"rating": 3.0, "review": "I love when my Chromecast works, but my devices have difficulty finding it sometimes.  It's easy and convenient and a great way to watch my Netflix.", "verified": true, "helpfulness": "0/0", "author": "Carla M Sensing"}, {"rating": 5.0, "review": "Awesome device great for use with streaming content. Does not play mp3 files even if they are legally purchased and sideloaded.", "verified": true, "helpfulness": "0/0", "author": "Krishna Naidu"}, {"rating": 4.0, "review": "There are just not many channels.  Roku has many more channels and seems better. IN My Opinion.  It does have YouTube.", "verified": true, "helpfulness": "0/0", "author": "J. King"}, {"rating": 5.0, "review": "Wish there were more apps available but works great! Easy installation and great price is a major plus to this product", "verified": true, "helpfulness": "0/0", "author": "Charles N."}, {"rating": 5.0, "review": "For the price, you just can't beat the Chromecast.  Sure it's a bit limited with it's apps, but it has 2 of the biggest players in Netflix and Hulu Plus, and I'm sure more will be added in the future. This little gizmo has made cutting the cable cord virtually unnoticeable.", "verified": true, "helpfulness": "0/0", "author": "-J-"}]