[{"rating": 3.0, "review": "It's alright. Wouldn't exactly say its worth 100$ tho", "verified": true, "helpfulness": "0/0", "author": "Marsalis Lesure"}, {"rating": 3.0, "review": "Please add USB drive support. The installed memory is just not enough if you install many apps, mine is now full.  I should not have to root this to add a USB hard drive. Android supports this with no issues.Otherwise the Fire TV is a great little device and beats the pants off of Apple TV, Roku or Google stick.Will change to 5 stars after USB drive support is added.", "verified": true, "helpfulness": "2/2", "author": "Jeffrey"}, {"rating": 5.0, "review": "Technology and user interface is amazing. We have Apple TV as well and AMAZON TV Puts it to shame. Voice recognition is so fast and easy to use!!", "verified": true, "helpfulness": "0/0", "author": "Monty2112"}, {"rating": 3.0, "review": "I've had fire tv for about 1 week.  So far it has performed well.  I gave it 3 stars because I can't comment on the long term performance.  I've had 2 previous ROKU units that were extremely poor.  They didn't pick up the wi-fi signal from my modem well and lasted only a few months.  So far, the fire tv unit is recognizing the wi-fi signal quite well and streams well.Technology makes me crazy.  I don't understand it very well and don't want to.  The fire tv connected easily.  I only use it for Netflix so far.  Probably that's all I ever will use it for.", "verified": true, "helpfulness": "0/0", "author": "OG"}, {"rating": 1.0, "review": "l really thought that AMAZON FIRE TV would let me see contemporary TV over wireless networks.  NO!!  I get only OLDER TV shows and movies.  OK, I can live with that, but not being able to see UP TO DATE versions of CSI or CASTLE or whatever --- NOT what I expected.  AND I thought with PRIME that everything was FREE!!  NOT!!  Old CSI is free, but the most recent -- even with PRIME -- there is a charge after the first episode on the most recent.  Well I bought it, I will keep it.  But who misled me -- friends or ads?", "verified": true, "helpfulness": "4/12", "author": "FredPM"}, {"rating": 5.0, "review": "I love the Amazon Fire TV. It just works. I do not rate products very much, but I've had the Fire TV for over 6 months now and it simply works.", "verified": true, "helpfulness": "0/0", "author": "Calvin Cheng \"Calvin\""}, {"rating": 1.0, "review": "Difficult to get to free TV/ Netlix series despite paid membership. Update screwed up series and necessitated two lengthy phone calls with tech support... I'll try to keep an open mind going forward... But it should be asker and more intuitive than it is.", "verified": true, "helpfulness": "0/3", "author": "Kerry"}, {"rating": 5.0, "review": "It's cool", "verified": true, "helpfulness": "1/1", "author": "Vittorio Valenti"}, {"rating": 4.0, "review": "Love it! It's was everything I expected and more. Such an easy set up and very easy to use. I just wish there was a play all so you didn't have to go episode to episode.", "verified": true, "helpfulness": "0/0", "author": "nikpat918"}, {"rating": 4.0, "review": "Amazon Fire TV is a great product. Easy to install and easy to use. My only complaint is there aren't as many updated movies to watch as there is on Netflix. I think you should update more movies if you want netflix customers to switch over to Amazon prime as the price is very comparable", "verified": true, "helpfulness": "0/0", "author": "dtipper"}]