[{"rating": 5.0, "review": "I am so happy that I purchased the Amazon Fire TV box.  So many options to choose from.  Enjoying the wide range of movies I can pick from.  Thank you.", "verified": true, "helpfulness": "0/0", "author": "Linda Letsom"}, {"rating": 5.0, "review": "It is an awesome addition to our home.  Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Tyra Van Engen"}, {"rating": 3.0, "review": "I was hoping to make this a five start review but there are some cons or questions that have yet to be answered. Note, I am coming from a WD TV Live Media Player (with Netflix) to this device.Note I am an Amazon Prime member for many years and figured Prime Videos was worth checking out.Pros:- FAST, Easy to setup, already was configured with my account- Kids found games and other programming right away- slim box and ergonomic remoteCONS:- Can't play movies from the USB port (if so tell me how and I will update this review)- Can't find my DLNA/UPNP devices on my network- example I have a WD NAS with 100s of movies and this device can't see it :(- Can't play MKV format/Container.  this is a very common container for content.  yet Xbox One, WD, and other devices support it.- Amazon Prime Video - Hmmm.  explain to me the 40,000 videos I can watch?  it seems that every TV series I need to purchase even if its not current, albeit some older not so popular stuff is free but I can't get Modern Family for example without paying for it on top of my Prime membership.- can't configure my apps from my PC.  setting up Netflix, and other apps from a PC would be nice.- no iPhone Remote app like WD or Plex  have- My Windows 8/8.1/10 computers can't \"send\" (think Mirrorcast/glass) to the device.  so I need to (a) make the format match and (b) put it up on Amazon cloud (Hello I am a OneDrive/GDrive - I don't need another drive or stream of the cloud).I will wait about a week then return if I can't find answers to these.  right now an XBOX One to replace my 360 and my WD HD TV Live box are all better (IMO)", "verified": true, "helpfulness": "1/1", "author": "@LonestarCanuck"}, {"rating": 4.0, "review": "Great!!  Love the access to movies", "verified": true, "helpfulness": "0/0", "author": "Linda Cuellar"}, {"rating": 4.0, "review": "liking it pretty good so far there are a few games for free that are pretty good. haven't purchased any games yet. game controller is working good time will tell how well it holds up only had the system about a month.so far definitely worth the money", "verified": true, "helpfulness": "0/0", "author": "Troy Martens"}, {"rating": 5.0, "review": "Absolutely wonderful! I love it. So many apps and all the shows j could ever hope to watch", "verified": true, "helpfulness": "0/0", "author": "michael trumbo"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I just got mine today and I love it. Tired of paying high price cable bills for movies.. I can access channels, my prime and Hulu.. Easy to hook up, I have a home theatre set up through my pioneer received so just hooked up through it. Plays awesome and on my 65 inch tv the picture is beautiful. I am so pleased! I bought the holder and just placed it on top to vent and it's so small..", "verified": true, "helpfulness": "0/0", "author": "kathy Jaskulski"}, {"rating": 5.0, "review": "Super easy to set up and use. Small and perfect for my house.,", "verified": true, "helpfulness": "0/0", "author": "Sally Coleman"}, {"rating": 5.0, "review": "It is everything I was looking for", "verified": true, "helpfulness": "0/0", "author": "Tamunosiki M."}]