[{"rating": 1.0, "review": "My 10yr old PS3 is more reliable and streams without buffering unlike the Amazon FireTV streaming device. I was disappointed that the voice remote only allows you to access Amazon Prime programming, and most of what you do find ends up being movies or shows which, if recent, you must pay to rent or buy. Big disappointment. The voice feature ONLY accesses Amazon's programming, not Netflix,  HULU,  or HBO, etc. I have a fast wifi 24mb download service which has only been buffering since using FireTV. I should, in all fairness, mention that my FireTV is accessing wifi and is not ethernet cable connected. Nevertheless the wifi modem is in the next room separated by 12ft and one interior wall distance. My Roku device is connected further away and does not buffer. If I could return it I would, but I've been patient and have had mine for 6months now.", "verified": true, "helpfulness": "3/5", "author": "Diego Luna \"Diego\""}, {"rating": 5.0, "review": "Incredibly easy to set-up and use!  Pair this with Prime Instant Video, and it's a home run.  I love how clean the design is, and fun to use.  The voice recognition works surprisingly well.", "verified": true, "helpfulness": "1/2", "author": "seattleerin"}, {"rating": 3.0, "review": "I bought the amazon fire tv to replace my google chromecast because the fire tv can stream my amazon prime videos and netflix. It was very easy to set up and everything works great EXCEPT I cannot get netflix to work.  I have tried all the troubleshooting tips I found on the help forums and chatted with a customer service person, nothing has worked.  I was supposed to get an email from the tech support department after not being able to fix it while chatting with the customer service person but so far I have not gotten an email. I could easily give this box 5 stars if netflix worked since that is what I really wanted to use this for.  I did end up signing up for hulu plus because I can watch some of the same things that netflix has but I would really like to get netflix working.", "verified": true, "helpfulness": "2/2", "author": "libraryluv87"}, {"rating": 5.0, "review": "I love my Amazon Fire TV!!! I bought one and it was so easy for me to hook up and start streaming my shows. I'm an Amazon prime member, also have Netflix. It's the best $99.00 I've spent in a long time. One remote watch all your shows.FYI: Il'm a mid fifty year old female not a techie and it was so easy I bought a second one for my bedroom TV. Love it, no more buffing mid stream when your watching a show.", "verified": true, "helpfulness": "2/2", "author": "Mary"}, {"rating": 5.0, "review": "This just arrived. It is epic.I am so happy that I chose this over the apple tv, which my mother has, I can't even tell you.I get to watch all my prime content, and all the Netflix content and its super fast. The voice recognition works perfect.If you are comparison shopping between any of the systems. I can tell you now, after doing the comparison shopping for hours and really racking my brain in worries that I wouldn't pick the right one, I know I made the right choice. Great job amazon.", "verified": true, "helpfulness": "2/3", "author": "Zeno"}, {"rating": 3.0, "review": "I will be traveling abroad for a few weeks. Can I use it outside US? Will it work?I have Amazon Prime and the last time I tried to watch a movie outside US it did not work due to geographic restrictions.Thanks for your comments.", "verified": false, "helpfulness": "0/2", "author": "MANUEL PASTOR SANCHEZ"}, {"rating": 4.0, "review": "Great replacement for video and music streaming when the PlayStation moved up stairs.  The gaming novelty wore off quick, but the ability to add apps is great.  Came in handy during the world cup with the ESPN app that expands my cable subscription.  We also brought it on vacation.  I'm curious when Prime Music will be available.", "verified": true, "helpfulness": "1/1", "author": "Fujimoto San"}, {"rating": 5.0, "review": "I researched for weeks trying to decide what to do about my Amazon Prime. Since the price went up and I was only getting the benefit of free shipping, it hardy seemed beneficial for me to spend so much without a benefit of some substance. I don't have a Kindle. I don't have a smart TV or blue ray player. So the only options for me was to get an HDMI for my computer to plug into my TV and use it as a medium or an Apple TV, a RoKu or the Amazon Fire. After reading many reviews, the Apple TV was out. Having my computer sitting next to my TV to play a movie or show seemed cumbersome. That left the RoKu or Amazon Fire. To make it comparable, I had to look at the Roku3 with the Amazon fire. Because the R3 was the only one that was the same speed. But I'm not a gamer so the extra advantage of the R3 seemed too much. The only sensible option left was the Amazon Fire. And I'm so glad I picked it! It is super fast! It streams right away and the quality is great! There are a lot of Prime options. Which is great for me because I'm not looking to spend more money. I just wanted some perks for my Prime membership. I haven't looked into the apps yet but there are many to choose from that look good and that I would use. I noticed with other customers, they have even got rid of their sattelite or cable. I'm hoping that will be a option for me at some point. The Amazon Fire will give me that opportunity.", "verified": true, "helpfulness": "5/6", "author": "L. Eder"}, {"rating": 2.0, "review": "When I first purchased this was very excited, I had no issues for amonth or so....thennnn I started having trouble with Netflix,huluplus, and a few others, the only thing that would load was crackle which is very limited. I tried calling amazon to get technical help, by the way it is not my internet connection, I was on hold for a half hour, finally when I did get through I spoke with someone that I could not understand, he was extremely rude because I kept telling him I could not understand what he was saying and could I please speak with someone that did not have such a thick accent, he hung up on me. well I have had my amazon fire tv for 3 months now and still have not been able to resolve what the issue is? Very disappointed in customer service and that it just will not work.", "verified": true, "helpfulness": "5/6", "author": "Phyllis Lockwood"}, {"rating": 4.0, "review": "Download times annoying but it is streaming media...", "verified": true, "helpfulness": "1/1", "author": "Matthew A Cole"}]