[{"rating": 5.0, "review": "Oh my stars!!!! Everything says 'easy to install\" and then I find myself frustrated, and I'm usually very generous with negative reviews when warranted. This, however, truly IS super easy to install. You actually just plug it in and follow on screen instructions to connect to your WiFi. I was dancing for joy when it actually worked that quickly and easily.And the Fire TV itself?? AMAZING!!! I can seamlessly move from Amazon TV to Netflix to HULU, etc., with one remote and the Voice Command makes it \"over the top\" awesome. You just say an actor's name and, viola! You have multiple shows/movies to select from. Or, say the name of a movie or TV show. BAM! Your choices are listed. There aren't enough adjectives to describe how pleased we are with this.  I did purchase the TotalMount System and the Belkin HDMI to HDMI Cable as recommended when I purchased this Amazon Fire TV. Couldn't be happier. From start to finish, the setup took less than five minutes, which included the mounting system, then straight to watching TV.", "verified": true, "helpfulness": "0/0", "author": "Beth in KG \"Beth\""}, {"rating": 5.0, "review": "This is an awesome invention to give up cable bills and stuff that you don't want . We simply love because of all the channels, and movies we can watch.", "verified": true, "helpfulness": "1/1", "author": "Fanny Rice"}, {"rating": 1.0, "review": "very difficult to navigate, no user friendly and does not connect with my wi-fi", "verified": true, "helpfulness": "0/2", "author": "Charalambos Antoniades"}, {"rating": 4.0, "review": "I've had Fire TV  (box, not usb stick) for a few days now.  It is easy to use, and offers many more content options than my previous BluRay player offered. My observations:1. Video quality is quite good, and I've had only 4 signal drops in two days.  That's about half as many as before.2. I'm a \"cut the cord\" kind of a guy, working about 10 to 11 hour days and I don't like to pay for something I'm not using. I had hoped to use HBO Go to avoid paying for full cable, but it appears that a person must have cable TV to use HBO Go via Fire TV so I guess I'm out of luck there.3. The Fire TV game controller seems a bit expensive, but I'll likely buy one anyway.  I prefer larger controllers, so I hope this one is a decent size in my hands.4. The main page is easy to navigate, but the icons are a bit large. A slightly smaller set of content icons would allow more on each page, with less clicks and less remote battery use.5. The voice search works wonderfully.  I've used it twice, and both times had no issues. I bet it can even find content including Gary Busey.6.  I found it hard to determine how to turn off Music that was currently playing.  A person sort of has to fiddle with various buttons to get it to stop playing.  This should be addressed.7.  There is no \"off\" button, at least not one that I can find. The box shuts off eventually, but for an energy conscious world that may not be soon enough.  I'd add an 'off' button, in a future software update.8. Crossy Road is a hoot!  I already had my second glass of red wine when I fired it up.  My first death was by eagle.  My second death was by eagle.  My third death was by slow moving car.  Oh my.9. I'm hoping one of the content apps will provide me access to my local digital broadcast channels - my next goal for hunting in Fire TV.I give it an early 4 out of 5.  Quality visual, improved downloading, easy to use, lots of new options (at least for me.)  I'll try to come back and update again soon.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "enjpy it every day", "verified": true, "helpfulness": "0/0", "author": "raymond kirkland"}, {"rating": 4.0, "review": "I love my fire stick! Do I need to order a stick for each TV or is there a way to have one set up for all tv's?", "verified": false, "helpfulness": "0/0", "author": "Monica Laurents"}, {"rating": 5.0, "review": "Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Spencer Wright"}, {"rating": 5.0, "review": "Easy to set up.  Quickly let me into prime and Netflix.  Voice works much better than expected.  Great product", "verified": true, "helpfulness": "0/0", "author": "xyz45"}, {"rating": 3.0, "review": "I didn't realize I would have to buy episodes of regular TV.  If that doesn't bother you, then go for it.  It has everything and you can watch when you want.  I am old school and miss the news and talk shows through the day.  I did buy Hulu, too, but same thing, you can't see current episodes of \"favorites\".", "verified": true, "helpfulness": "0/1", "author": "Linda"}, {"rating": 3.0, "review": "Works great, but small movie selection", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]