[{"rating": 5.0, "review": "amazing :D it works perfect xD", "verified": true, "helpfulness": "0/0", "author": "Benjamin Blanco"}, {"rating": 5.0, "review": "Excellent!! Works perfectly!!", "verified": true, "helpfulness": "0/0", "author": "Hai T. Nguyen"}, {"rating": 5.0, "review": "Easy to install and use.  Got it for my mom  christmas and she likes it. I wish I had one.", "verified": true, "helpfulness": "0/0", "author": "Darrell Gunter"}, {"rating": 1.0, "review": "Booo waste of our money.", "verified": true, "helpfulness": "0/2", "author": "Elissa"}, {"rating": 5.0, "review": "Exactly as expected, delivered early", "verified": true, "helpfulness": "0/0", "author": "Moydow"}, {"rating": 1.0, "review": "This thing does work for a week, then it would not recognize or connect to anything waste off money sucks bad", "verified": false, "helpfulness": "0/1", "author": "Rafael C."}, {"rating": 4.0, "review": "Setup was easy, it met my expectation to use as a video and audio player for pandora, netflix and mlb for my TV. Would give it 5 stars if it mirrored my ipad and had more video and audio players options, but I will live with that set back and take the huge cost savings in comparision to apple TV.", "verified": true, "helpfulness": "0/0", "author": "Tom Reynoldson"}, {"rating": 4.0, "review": "Love this! I use it a lot, I fried my first one in a year though, but it's so cheap. I definitely got my money's worth. I have 3, 1 died, but i think it was a refurbished one from groupon.you can mirror you android screen (Check if you phone can support the latest version of chromecast first)  and if you install a chrome extension to your browser, you can mirror your one browser tab. It's Amazing. Forget Apple TV.I use it to watch online tv, like LOGO TV. once you sync that tab to the TV, you can open another tab and do your other work. A MAZING!!!", "verified": true, "helpfulness": "0/0", "author": "Danny \"Graphc Desgner\""}, {"rating": 5.0, "review": "Awesome device", "verified": true, "helpfulness": "0/0", "author": "Javier Rengel-Parrish"}, {"rating": 4.0, "review": "Works mostly fine, but I always seem to have to resync it to our wifi, a little inconvenient.", "verified": true, "helpfulness": "0/0", "author": "RyanK"}]