[{"rating": 4.0, "review": "Works great with youtube, however with Plex it's not great.  Constantly stutters and freezes up.  Needs more apps to make it worth while.  Maybe a better revision next year?", "verified": true, "helpfulness": "0/0", "author": "S. Scarfo"}, {"rating": 3.0, "review": "The fact that there are only 13 apps that are supported is disappointing.  The extension for chrome on your desktop is 3rd party resulting in less than mediocre quality streaming videos.  Should add the xfinity app for better TV options and google drive or google+ so sharing photos on screen is possible.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Would buy one for everyone in my family if not for 3 things:1. Whenever the chromecast sleep, it loses ability to sync and must be reset at the chromecast (annoying for TV and very annoying for projector)2. Streaming videos from my hardrive does not work. I am fairly technical and lazy. Setting up an FTP server and accessing a specific IP address would likely work. Simply casting a movie or kids books onto a big screen does not.3. Apps, Google need not try to be apple and create a universe that doesn't play well with others. If Google made it easier to cast they would more chromecasts, vs making you use their apps or the non-existent ones they keep promising.Overall, this has amazing potential of expanding the possibilities of the home stream and reducing the foot print. This is the first Google product that has not delivered on it's promises (not counting every cheap Android phone). I have spent a lifetime debating Apple users that Google can provide quality solutions for less. Apple users counter with assurance of quality and customer service. Don't make a liar out me Google...please.", "verified": true, "helpfulness": "1/1", "author": "Nicholas Graff"}, {"rating": 5.0, "review": "This thing is awesome. I have been watching Netflix, Hulu. and YouTube videos. It casts great from my Nexus 7 but my laptop is an Hp and I have Kubuntu installed on it with Google Chrome browser. It will cast from the laptop, but plays on the laptop and TV too. This causes a delay effect with buffering. Such is life with linux, eventually someone will fix it.", "verified": true, "helpfulness": "0/0", "author": "W. Chapman"}, {"rating": 5.0, "review": "A lot of reviews on here seem to think that this device is for general streaming from stored video to your TV.That's not what it's for.It's for streaming internet video onto your TV.  Youtube, Netflix, and the like.  And for that, it works great.  Yes, this functionality exists in other devices, but I've never found one that's nearly as easy to set up or use as the Chromecast, and you aren't hampered by the absolutely terrible interfaces that are on most of the other device-based Netflix and YouTube players.I have also found that it does in fact work reasonably well to stream material from my desktop computer, through the Chrome browser plugin. A trick that I've found to work well on Linux is to, instead of opening from a regular file, open a named pipe (mkfifo test.avi) and then have VLC transcode to that file. This lets you play files with soft subtitles and so on, though it does require a bit of setup.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Does great. You tube Netflix hbo go all work seamlessly. Would give five stars if streaming movies was easier to do. You have to cut and paste in browser to accomplish this.", "verified": true, "helpfulness": "0/0", "author": "greg pangburn"}, {"rating": 5.0, "review": "I purchased 2 Chromcast' for a Christmas gift for my sons who I noticed are always streaming; videos, games and YouTube content. They love it! They use it all the time and have posted and shared pictures of it with their friends on their FaceBook and social media sites.What's interesting is my colleagues (IT Professionals) and my kids friend had not heard of the device...I love that it made me look like the cool mom, for a very affordable price...I know at least 5 people who immediately purchased the device as a result of our purchase.", "verified": true, "helpfulness": "0/0", "author": "Tonya L. Ware"}, {"rating": 5.0, "review": "I own 3 Chromecasts and gifted 2 more. Everyone should own a Chromecast. If someone has a TV and has a smartphone- the choice is obvious.So about the Chromecast, it's a solid little dongle that plugs to the back of your HDTV (with an additional USB power connection also for most TV's). Setup is really basic- I gifted my parents one, and they are least familiar with technology in the whole family... They were able to get it setup by themselves by just following the on-screen and paper instructions.Uses for the Chromecast are mostly:For parties- My friends are already logged on my wifi when they come for parties, and there is no setup for them to control my HDTV with their Android or iOS phones. We basically drink and watch random Youtubes. If not, I let it stream Pandora in the background since my sound system is linked to my HDTV.For parents- My parents watch a ton of foreign movies and shows, so they take advantage of the PC to Chromecast tab in Google Chrome (they figured it out themselves, which I was surprised). Also they cast Viki which has thousands of new foreign shows.For roommates- When you share an apartment/dorm with a friend- Chromecast is a great tool to stream movies to from either person's desktop or laptop. Make sure you have a strong wifi connection though- it hogs a ton of bandwidth.I can't stress enough how much use I get out of my Chromecast and how little people actually ever use the \"built-in Smart TV\" function of their Samsung, LG, Sony, etc. branded SMART TV's... Bottom line- EVERYONE can use a Chromecast & NO ONE can learn how to use 2395643654723948798 different SMART TVs.", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 5.0, "review": "I just plug it in and download Chromecast app to one of my mobile device and voila, I can select anything from YouTube from my device and it shows on my TV. It's magic.", "verified": true, "helpfulness": "0/0", "author": "Tom Tham"}, {"rating": 4.0, "review": "Nice picture quality. Easy setup. Good value at this price point.  Requires WiFi network and cloud files. It would be great if it could cast all my computer files on my laptop as well.", "verified": true, "helpfulness": "0/0", "author": "Robin Talley"}]