[{"rating": 3.0, "review": "Wow, the picture clarity is great!  WARNING TO NETFLIX USERS -- Use the devices back button to exit Netflix or it will NOT work the next time you want to watch Netflix.Gaming is pretty good, but I am VERY DISAPPOINTED that the games will NOT WORK if you are not connected to the internet.  Even though the games are completely downloaded and installed, they will not work without an internet connection!  Amazon, please fix this!", "verified": true, "helpfulness": "0/2", "author": "ga"}, {"rating": 5.0, "review": "Outstanding, quick response, no wait for movie to que and play. Outstanding selection of movies old and new. If you liked Apple TV or chrome, TV you  will love this . Best I have used! Voice recognition is excellent!", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "I like that it is easy to use.Voice command is a wonderful feature.I would recommend this to all my friends.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We've had Amazon Fire TV for a few weeks now and the entire family loves it. It's great for quick access to movies, TV shows, music, apps, and our Amazon Cloud files.  Voice control is amazing!!! Definitely recommend...especially if you've got Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "E Wayt"}, {"rating": 5.0, "review": "We went to an HD aerial antenna over a year ago. We supplement with Hulu Plus, Amazon Prime, and VUDU. Prior to buying the Amazon Fire TV i was running everything through my iPhone 4S with an HDMI output adapter to my TV's. It wasn't terrible, but certainly not ideal. Most shows didn't come through completely in HD and weren't usually full screen. This was particularly true when using the Amazon Instant Video app. With the Amazon Fire TV, everything comes through crystal clear. Sons of Anarchy has never looked so good.The voice rec seems to work really well and the menus are easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "JT"}, {"rating": 4.0, "review": "If you have use a Roku  or Apple TV, this does the same thing as those. The search by voice feature is a big plus and I really like the interface. The remote control is genius as it functions well as a game controller for most game and has all the functionality of a remote control. The streaming is fast and high quality. my only complaint is that the voice search function only works for Amazon Prime movies and shows, I would guess they will implement this into Netflix and the other services soon. If not it's a horrible decision.Overview: If your looking for a dedicated streaming box this is the one you want.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Very easy to use and great selection of apps and Prime items. Voice search works as promised, remote auto-detects easily.", "verified": true, "helpfulness": "0/0", "author": "jeremy diederich"}, {"rating": 4.0, "review": "Our quest was to get rid of our $130 cable bill and this is definitely going to help. Have had this unit now for a little over two weeks and it is very nice. Our first foray into this type of thing and I think we made the right choice. While there aren't a lot of channels or apps to choose from right now I'm sure that this will be quick to change.Unit installed very quickly and easily. No setup, quick learning curve. The voice search works great.", "verified": true, "helpfulness": "0/0", "author": "Sean McDaniel"}, {"rating": 5.0, "review": "The sound quality is great.I love it I'm thinking about getting another one for another section of our home....movies music family games...great stuff amazon!", "verified": true, "helpfulness": "0/0", "author": "John Hall"}, {"rating": 5.0, "review": "I'm so happy I don't have to use my Apple TV. I hate the Apple TV remote! Fire is a winner!", "verified": true, "helpfulness": "0/1", "author": "Joel Samaha"}]