[{"rating": 5.0, "review": "Great product, they just opened several more applications that this works with, once it allows me to stream everything of my laptop it will be awesome.", "verified": true, "helpfulness": "0/0", "author": "jdub"}, {"rating": 5.0, "review": "... and it will only get better over time as more apps make use of it.  Well worth the cost of admission.", "verified": true, "helpfulness": "0/0", "author": "James L Parrish"}, {"rating": 5.0, "review": "I can't say enough about this product. The ability to turn your tv into a smart tv without breaking the bank. Need I say more?", "verified": true, "helpfulness": "0/0", "author": "Emmanuel Anderson"}, {"rating": 4.0, "review": "Excellent device. Setup was very simple, casting any video from YouTube or Netflix (from iPhone or iPad) is very easy but slow respond when you cast any video from chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Jeevan Anjna"}, {"rating": 3.0, "review": "The heading says it all - the Chromecast is useless unless I can get Time Warner to readjust the settings on their router, and getting TW to do anything is not easy.", "verified": true, "helpfulness": "0/0", "author": "Billzyz"}, {"rating": 5.0, "review": "Use it all the time, can't wait till they support more websites!This is an excellent product! So glad I bought this!", "verified": true, "helpfulness": "0/0", "author": "nifter"}, {"rating": 5.0, "review": "Setup was exceptionally simple and I am able to watch all of my streaming services (Netflix, HBO GO, Hulu Plus, YouTube, etc.) in lovely hd instantly (I use my Nexus 7 tablet and Galaxy S4, but my roommates are also able to use their iPhones and iPads).  If this is what you are purchasing this product for, you will not be disappointed.  I also take advantage of streaming Google Music through the tv when friends are over.  It's a fantastic device at a fantastic price and I am absolutely thrilled with it.", "verified": true, "helpfulness": "0/0", "author": "R. L. Dunn"}, {"rating": 5.0, "review": "This is an Excellent devise. It is Very useful and convenient. We now enjoy computer on big TV screen. Works very well.", "verified": true, "helpfulness": "0/0", "author": "Haren Gupta"}, {"rating": 5.0, "review": "very sweet never seen any thing like it so cheep and more stuff added all  the time screan saver also sweet", "verified": true, "helpfulness": "0/0", "author": "Gabrielle Lewis"}, {"rating": 5.0, "review": "Works great, I wish it would do more, I think Google will get it opened up to more eventually, but it is a great product. Especially for as cheap as it is", "verified": true, "helpfulness": "0/0", "author": "Gator"}]