[{"rating": 5.0, "review": "For only a little more than thirty dollars, it is possible to view movies on the television provided the movies are downloaded from the internet.  The clarity is excellent.  The set up is simple.  I heartily recommend this product if you have preference for watching movies on your television rather than watching the movies from your computer monitor.", "verified": true, "helpfulness": "0/0", "author": "Traveler2014"}, {"rating": 1.0, "review": "I spent hours and hours troubleshooting this stupid thing. My internet in every other way worked completely fine on all other devices (laptop, phone, tablet, AppleTV, Roku). But the Chromecast was firmly committed to not be connected to the internet.I've tried every solution I can find in several different forum threads, and nothing has worked.MAYBE yours will work fine... But It's hardly worth the risk. Life is short, don't waste it on crappy products that don't work.", "verified": false, "helpfulness": "0/0", "author": "Drew Allen"}, {"rating": 5.0, "review": "Small, lightweight and portable. Lots of uses for this little streamer. Can be used at different locations when you travel and the fact that the SDK is released, more apps would be created for this gadget and more uses can be added to the list of pros that it has.", "verified": true, "helpfulness": "0/0", "author": "Arnie Posadas"}, {"rating": 3.0, "review": "This device only does three things well:  1) Cast Netflix from another device to you TV, 2) cast Youtube from another device to your tv, and 3) Cast Hulu+ from another device to your tv.  Amazon Prime is not supported nor are any other common streaming services.  And the potentially biggest selling point, being able to cast from the chrome browser to you tv, doesn't work well.  Even at the lowest-quality (480p) it's choppy with the audio periodically going out or sync. If they could get this working the device would be awesome.  As it currently stands, I would recommend spending $15 more to get a Roku; they do so much more and operate independently of other devices.", "verified": true, "helpfulness": "1/1", "author": "dssonic"}, {"rating": 3.0, "review": "it is a good product, easy to install and use. Only draw back is the limited choices of services, Netfix is the only major player to use.", "verified": true, "helpfulness": "0/0", "author": "bc1"}, {"rating": 5.0, "review": "I already have a roku box in another room but this is easy and movable.  Once you figure out how to use it, it is easy.  The instructions are not very clear.", "verified": true, "helpfulness": "0/0", "author": "Screamer \"Su'z Beaman\""}, {"rating": 3.0, "review": "I was very excited to get my hands on the Google Chrome Cast. I have been playing with AppleTV since it's first generation but I was looking for a more universal solution to wirelessly transmit my computer screen (Smart Phone, Tablet, etc) to the TV. This looked to be the answer (for the price) so I jumped on it. Install of the CC was very easy. It works with my MacBook Pro, iPad and iPhone. However, it doesn't work well. 80% of the time I cannot cast my Mac to the device. I see it on my network but Chrome does not see the device and will not play. I have issues playing netflix from my iPad to the tv as well. When it works it works great but it is a 20/80 performance -- 20 being the working end and 80 being the part where I just give up perplexed at why it won't play. I might add I work in the computer industry so it's not user issues - it's the device in this case.If you're not ready to shell out $100 for an AppleTV or you have one of the \"other\" devices you might want to give Chrome Cast a try. Otherwise I'd say keep looking for a solution.", "verified": true, "helpfulness": "0/0", "author": "RobbieRob"}, {"rating": 5.0, "review": "This is one wacky little device but it is so cool. You just plug it in and set it up (just a couple of minutes) and go. You can stream anything you can pull up in Chrome. At first I wasn't so sure about it but then I realized that sites that are optimized for it stream much better if you click the stream button on the website and not on the toolbar. Once I started doing it that way the streaming was smoother and the picture was better. We have this and a Roku box and I'm pleased with both of them!", "verified": true, "helpfulness": "0/0", "author": "A. Hayes"}, {"rating": 4.0, "review": "I purchased this device to stream Netflix to a tv not on our Dish receiver.  The device was easy to set up.  I was streaming Netflix and Youtube in minutes.  I have used this several times in the first week and it works well.  I wish it could stream videos made on my Samsung Note tablet but it does not.  It would also be great to be able to show web browsers (I'd accept even if Chrome worked).  But, it does not.  It serves my primary purpose for purchasing it so 4 stars.", "verified": true, "helpfulness": "0/0", "author": "Cincy"}, {"rating": 3.0, "review": "i was under the impression that you could play the videos right from the phone without the need of wifi. still havent set it up since i dont have wifi at home", "verified": true, "helpfulness": "0/0", "author": "salvador marquez"}]