[{"rating": 5.0, "review": "Great little gadget - easy set up, it plays -  Now we just need more compatible apps - LIKE HBOnordic-", "verified": true, "helpfulness": "0/0", "author": "Kristian Klevin"}, {"rating": 5.0, "review": "works great but the set up wasn't that easy because of my router settings and it took me a while to solve it.", "verified": true, "helpfulness": "0/0", "author": "Roykosh"}, {"rating": 5.0, "review": "It is easy to use.  It was inexpensive. I am waiting for it to have access to more channels like Roku.", "verified": true, "helpfulness": "0/0", "author": "Pamela F. Fubler"}, {"rating": 2.0, "review": "The chromcast work only in us.  In Saudi Arabia only work with youtuop.  And that really depressed.  Any way I bought 6 prices and all of it useless .", "verified": true, "helpfulness": "0/1", "author": "Ahmad"}, {"rating": 5.0, "review": "Great device, got it before the projected delivery date, so thanks for that. Not a day goes by when I don't use the chromecast ever since I got it.", "verified": true, "helpfulness": "0/0", "author": "Nandish"}, {"rating": 5.0, "review": "This device is totally AMAZING! The set up was easier than expected (and I expect a lot from Google). Within 5 minutes of plugging the device into my TV, we were up and running and watching a show on Netflix. The picture was much better than the same show being played thru my BlueRay device. I am gobsmacked. I'm now closer to \"slinging\" all my shows from my devices (iPad, iPhone, Nexis 7, and various laptops). Shortly I will be able to cancel my AT&T; Uverse account! (And, I'll be saving over a thousand dollars a year.) For the money, this device is well worth the price!", "verified": true, "helpfulness": "0/1", "author": "Chey Cobb"}, {"rating": 5.0, "review": "This is such a simple solution to steam video to your TV.  We watch shows on Netflix, HBO Go (there's no \"ap,\" but if you open it in chrome, it works just fine.)  The only thing I haven't been able to \"cast\" is amazon prime.  I love the ease of casting things from my phone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ck\""}, {"rating": 3.0, "review": "Meh......... Ok if you only really want to do netflix and YouTube  I'm sure it will get better once google developes more apps", "verified": true, "helpfulness": "0/0", "author": "Zukimarauder"}, {"rating": 3.0, "review": "A big downfall of the chromecast to me is that google took away the ability to stream local content. This makes this device almost useless for me in particular now so if you’re looking for that you should probably look somewhere else. For what it does do it does it well (netflix/youtube/etc). But it seems google is restricting a lot of developers from making this product a great TV/phone/laptop interface.", "verified": true, "helpfulness": "0/0", "author": "D. Riehl"}, {"rating": 3.0, "review": "Install took a customer service call. At highest resolution it loses connection frequently. At lower res it works OK. Not bad for release 0.0.", "verified": true, "helpfulness": "0/0", "author": "L. Groner \"Reader\""}]