[{"rating": 2.0, "review": "Nice and snappy but way too many shortcomings for the way I had hoped to use it, here's a list:1. USB is not enabled, and even when they do do that, it wont play files from an external hard drive.  But Roku will, so switching to that.2. If you don't password protect against accidental purchases, like if your kids are going to use this, then guess what, accidental purchases will ensue.  If you do password protect, then your kid can't use it, which is a drag.3. If netflix has a show you can watch for \"free\" (I realize it's not actually free, but you know what I mean) but Amazon has the show for a price, and you use voice command to summon said show, guess which one they will serve you?  Yep, their version that costs.  Can't blame them, but that just seems slimy.", "verified": true, "helpfulness": "2/3", "author": "Phillip C. Cornish"}, {"rating": 5.0, "review": "Awesome if you have Amazon prime or if you want to watch Netflix on your tv. I was hooking my Kindle up to the TV to watch Netflix but this is so much easier.", "verified": true, "helpfulness": "0/0", "author": "Branana"}, {"rating": 5.0, "review": "Great deal for a great price turn an older tv into a smart tv. Get you fans from Netflix hulu and amazon prime. Works great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Tossup... Amazon Fire TV or Ruko 3. Not an even tossup. Amazon Fire TV wins hands down and it has opened a world of streaming digital for our family.  Highly recommend it.  And, as always, Amazon shipped it pronto.  Our Amazon Prime Membership is one of the best bargains we make every year.", "verified": true, "helpfulness": "0/0", "author": "DanHarvard"}, {"rating": 5.0, "review": "works great only wish it had more apps and came with the game remote.", "verified": true, "helpfulness": "0/0", "author": "cody w schreyer"}, {"rating": 5.0, "review": "Excellent product.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "rhodaw"}, {"rating": 5.0, "review": "Loving it so far", "verified": true, "helpfulness": "0/1", "author": "Itaska Goodwin"}, {"rating": 1.0, "review": "Broke after the warranty period.  Go with a Roku.", "verified": true, "helpfulness": "1/4", "author": "Hewitt"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "CATHERINE"}, {"rating": 5.0, "review": "excellent product/service... it takes a little time out of your day to figure out the many option but worth every second.", "verified": true, "helpfulness": "0/0", "author": "Lolita Coasey"}]