[{"rating": 5.0, "review": "One the best devices Google has produced, and knocks other streaming devices out of the park. This is Google's town now, and they rocked it.", "verified": true, "helpfulness": "0/0", "author": "Jason Parent"}, {"rating": 4.0, "review": "- Easy to setup- Responds quicklyI hope it will soon have DLNA capabilitly to stream even pics and videos from laptop / mobile and the Chrome Browser cast will improve its performance.", "verified": true, "helpfulness": "0/0", "author": "furhor"}, {"rating": 5.0, "review": "Here's my take on this little wonder.  Think of it as a small smartphone, with the screen and all the other non-essentials ripped out.  What's left is a small System on a Chip that Google has managed to value engineer as an affordable add-on to your TV to make it \"Smart\".  I see it as Google TV version 2, with a much better value proposition.I now own two of these things, one in the living room and one in the bedroom.  Nowadays, when the adults or the kids browse through Youtube Video and find a longer video that they'd like to view on the big screen, they just cast it to the TV of their choice.  It wakes on the TV's on its own, and off it goes.Now that Google has opened up the Chromecast API, more and more streaming services are becoming available.  This is not a big deal to me, since the video game consoles also have these.  The biggest deal for me is the possibility with apps like AllCast, and the many others that are bound to follow suit - being able to easily choose and play anything you want to the screen of your choice.  This greatly simplifies the flow of your media browsing (now done on your personal screen of choice) - regardless of where your media may be stored, locally, on the network, or in the cloud.  Find it, play it wherever you have one of these plugged in.The concept isn't new and the device isn't flawless - I wish it was a bit faster in queuing media and playback, as there is a small 4-5 second delay from the moment of push to actual playback, but consider the price of entry, it is well worth it (At least compared to Apple's Airplay solution).Conclusion:Pro - Affordable/Low price of entry, rapidly expanding in features and value.Con: Can be a bit slow at times, no gigabit ethernet option as WiFi N 2.4ghz only can be limiting for 1080p, and just nitpicking here as I know this is a necessary evil: unless you have room behind your TV, the mess of cables (USB charging cable, HDMI extension cable) can be hard to hide behind a wall mounted TV.", "verified": true, "helpfulness": "0/0", "author": "AmazonAddict"}, {"rating": 5.0, "review": "I love the new youtube app where at a party anyone that has my wifi password can queue up music videos without any setup.Hulu, netflix, and the chrome browser app.  It's in open development so I hope we will see some more uses for this inexpensive streaming toy.", "verified": true, "helpfulness": "0/0", "author": "Dan Oldenkamp"}, {"rating": 5.0, "review": "I would definitely recommend this product. It it very easy to set up and it eliminates the use of a lot of other devices to stream movies and programs.", "verified": true, "helpfulness": "0/0", "author": "GURU \"GURU\""}, {"rating": 5.0, "review": "I have a television in my room without a cable jack.  This has allowed me to link up Netflix, YouTube, Time Warner's cable app, Google Play's music system, and all sorts of other things.  It's perfect.The ability to control it from a computer, tablet, or cell phone makes it perfect for laziness and lounging if you want to turn something on randomly.I liked it so much that I've purchased one for my mom--she's figured out how to use it!--and for my cousin and her husband when they moved into their new house.  I've heard nothing but good things from them, so hopefully you enjoy it as much as all of us.", "verified": true, "helpfulness": "0/0", "author": "William E Keeler"}, {"rating": 1.0, "review": "Even the iphone did not want to accept it.  Finally set up through Chrome on desktop.  Waste of money Don't buy!!!!", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 1.0, "review": "Does not work with FIOS if you have the Actiontec router.  The iphone/ipad cannot see or control the Chromecast. This incompatibility is clearly posted on the Google support pages, and a call to the google customer support made it clear that they view this as an incompatibility and not something they will fix.  I tried a bunch of suggested fixes (router settings) found on the internet related to uPnP and other parameters.  Sometimes, they seem to fix the problem for a few minutes, but the connection issues keep coming back.  My router is very close to the chromecast, so distance is not the issue.I have Apple TV and the new ROKU Streaming Stick, and they both seem to work fine with the FIOS ActionTec router.", "verified": true, "helpfulness": "1/1", "author": "Eric"}, {"rating": 1.0, "review": "I've tried calling the shipping company, e-mails, everything, but I can't get a handle on literally any single person who can help me. I ordered this thing well over six months ago, the company shipped it someone somewhere according to the tracking information, and I - as stated in the title - never got the merchandise. Ever. No returned money, either. Easily the worst online shopping experience I have ever had.", "verified": true, "helpfulness": "0/1", "author": "Thomas Wahrlich"}, {"rating": 4.0, "review": "in spite of the fact that the supported content library for this device is limited (no amazon instant video, no native local network sourcing), the simplicity and convenience of this device is unmatched.  setup is very quick, and can immediately be controlled by a smartphone.  it supports the tv power-on/switch input commands with compatible tvs, which is great for not needing to control the tv as well.a couple of bugs still remain with multiple sources queuing content, such as with youtube.  also, the device doesn't support 5GHz wireless, and can be flaky with non-broadcast wireless SSIDs.  but for the price, very convenient.", "verified": true, "helpfulness": "0/0", "author": "barfhead"}]