[{"rating": 5.0, "review": "Small & unobtrusive, Operation is mostly intuitive and easy. Since I often don't recall titles accurately, I like the way I can search for a movie by the actors. Creating a Watch List was easy and saves time finding what I want quickly whenever I get the chance to take a break.", "verified": true, "helpfulness": "0/1", "author": "Barbara B. Smith"}, {"rating": 4.0, "review": "At first I had a unit that caused problems and the screen would freeze up.  I arranged with one of your people to receivea new unit and it works great!  I am very happy with the device!  As I get into it, I can see that it has great possibilities.Thanks you very much for your interest.Jack Huebner", "verified": true, "helpfulness": "0/2", "author": "Jack L.Huebner"}, {"rating": 5.0, "review": "I love the ease of use, the speed, the quality, and the selections. This is sooo much better than the hassles I had trying to stream through Chromecast.", "verified": true, "helpfulness": "0/1", "author": "ss"}, {"rating": 4.0, "review": "I find the audible search a great feature however it does not work with Netflix but where it does work - it is great.  I still prefer the Apple TV but will keep using the fire as they add features.", "verified": true, "helpfulness": "1/1", "author": "Ed Kramar"}, {"rating": 5.0, "review": "I purchased this to replace the direct tv in my living room. My grandkids absolutely love it. Everytime they come over they play the games on it and everyone has to voice search Gary Busey! I don't like that it doesn't have Vudu and alot of shows that I would like to see on it. But with it being new, that's to be expected. Continue adding new programs, it's a great buy!", "verified": true, "helpfulness": "0/0", "author": "Renee"}, {"rating": 5.0, "review": "My treadmill has built-in HDTV but I don't have tv cable service ; I only have wifi so I bought this Amazon Fire TV. Now ,I am enjoying my treadmill exercise more while watching my Amazon Prime free movies. It is so convenient that I just do the movie switching through the voice search option while I continue running on the treadmill. Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Rory Lion"}, {"rating": 4.0, "review": "We got Amazon Fire TV mostly because I had Amazon Prime, and I was in the middle of watching some of the series that were offered through the streaming service.  But it's been awesome since we got it.  We're watching both Amazon Prime and Netflix and the kids play video games.The only reason I didn't give it 5 stars is because I can't get the box to work on the ethernet only on wireless.  We made multiple calls to get it fixed, but it never does, and I don't have all the time in the world to sit on the phone while we try to make it work.", "verified": true, "helpfulness": "0/0", "author": "Kathryn Knight"}, {"rating": 5.0, "review": "When I purchased a BluRay DVD player a year ago, I made sure that it supported Amazon Instant Video.  However, the application on the device was clunky and slow.  The FireTV fixes those issues.  My kids are the ultimate judges of such things and they love it.  They say it is a lot faster and easier to use.  They really like the Voice Search capability.  It allows them to find the stuff they are looking for.  Before Fire TV, they would bring me the remote and ask me to find something for them.  This is because the search feature required you to spell out stuff with the 10-key pad on the remote.  YIKES!  My younger children found this incredibly intimidating.  Now, they just speak into the remote and find it.", "verified": true, "helpfulness": "0/0", "author": "Ulthanash"}, {"rating": 4.0, "review": "A great addition to the prime offering. Great at streaming content without gaps and a smooth clear picture. It is a good investment.", "verified": true, "helpfulness": "0/0", "author": "Richard K."}, {"rating": 3.0, "review": "Hoped there would be more construction truck kid oriented video on prime.  Mega machines would be nice or the John Deere line of video.", "verified": true, "helpfulness": "1/3", "author": "John"}]