[{"rating": 5.0, "review": "I had been considering a Roku or Apple TV for some time, but had heard the Amazon FireTV was coming out and decided to wait. I ordered it the second day after launch and received it the next day (without paying for 1-day shipping I might add!). I had it setup and ready to go within 5 minutes. It was super easy to hook up to my TV, the voice activated remote works awesome, and I've been watching it every night since. I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Wendy H"}, {"rating": 5.0, "review": "Installed this yesterday. Installation went like a breeze save for a brief glitch with updating. The main thing I notice is that the resolution on this appears to better than Apple TV and is definitely better than Roku. It's a nice addition to the smart-box lineup.", "verified": true, "helpfulness": "2/2", "author": "LGL"}, {"rating": 5.0, "review": "This is the future Amazon Fire TV I'll am now learding about this system soul is very good for everyone to have this next step into the future.", "verified": true, "helpfulness": "1/1", "author": "Eddieharper"}, {"rating": 5.0, "review": "I've had the Fire TV for close to a week and my husband loves it already. I've found quite a few things on Prime video that I wanted to watch in the past but didn't have time or didn't want to start in the middle of a series. Now I can start with Season One, Episode One of most of them.My husband is not much of a techie but it's simple enough even for him to maneuver. We've discovered ourselves nearly fighting over it a couple of times. I happen to think it's a very simple little device, and I am also impressed with the ability to do Netflix or HuluPlus on it as well. I have it positioned about 5 feet from my WiFi router and have not had any lag or skips so far. I have not yet tried it in another room. It's fast, easy, and even the non-techie in our family can use it, so I'm happy with my purchase.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My son gave this to me for my birthday. It is so easy to use. The how to use tour is excellent. The picture quality is fantastic. Best birthday gift ever!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Amazon Fire TV appears to be a superior set top box. However, Amazon instant video as advertised is somewhat a misleading representation of free instant watch video---much of which is actually pay per view.", "verified": true, "helpfulness": "2/2", "author": "Thomas G Parker"}, {"rating": 4.0, "review": "And as more apps become available for it I'm sure I'll use it more. We already have one smart Tv and as it goes I can see us loosing this one also to the kids with the games they can play and the library of available apps", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Not as good as the Ruko 3, nothing but a money pit and a cash cow for amazon, slower than Ruko 3 I had, not as many apps, it would be nice if there was a free movie app. you have to go thru many selections to find free movies and then selections are rather limited. also no internet browser. At least the Google Chromcast could stream my laptop to TV which made it easy to watch my home movies. All-in-all the amazon Fire TV is not as good as the Ruko 3, the Microphone function worked great, But I don't use it that much, easier to scroll thru the apps with the remote", "verified": true, "helpfulness": "1/3", "author": "JIM LASCARIS"}, {"rating": 3.0, "review": "Nice design and easy set up... ButVoice control is only for Amazon Stuff,,, Don't expect it to work with Netflix for example.If you are out of the US then you might wanna think to get this unit twice as Amazon Prime stuff (plus a lot others) won't work. Geographical issues apparently.Seems like you can buy and rent movies but haven't tried this yet.It's a nice this to have but not a game changer as for now... maybe with in time with updates and geographical fix.", "verified": true, "helpfulness": "1/1", "author": "Christopher Yow \"FreyGod\""}, {"rating": 4.0, "review": "Pros:Fastest and most legal way to watch TV,Movies onlineQuad Core Processor and Dedicated GPU make animations and gameplay buttery smoothGreat Starter App and Game SelectionDebug Mode is Still There!!Prime Instant Video Collection is growing everydayCasual and midcore games selection are very engagingCons:Can't Shop from Amazon (yet)Lack of Third Party Voice Search *Edit it is there for Vimeo but that's not saying much*Limited App SelectionApps Purchased online don't always make it to the FireTVEven Less Limited Game SelectionNo remote control apps on Android and iOSKeyboard Layout should be QWERTY and not 1-9 A-Z it makes it really hard to typeKeyboard Carousel should resume at the last letter and not start over at ASuggestions:Support True Miracast Receiver Abilities from all Miracast Capable SendersTweak Mojito ever to slightly.  The app installer uses entirely too many resources in the background and interrupt foreground.Work  on a DLNA AppInstall to device from the web*Edit: Discovers this now works on my tv *HDMI-CEC.  Pressing home on the remote/controller.  Power on the tv if it's offWhat's on tv based on your zip code to spur tv purchasesQuestions:  Why are you guys using Akamai for CDN services?I would recommend this product to everyone. The interface and layout are simple enough that my mom could use it.", "verified": true, "helpfulness": "2/2", "author": "Noah Swint"}]