[{"rating": 2.0, "review": "Would not work with my Router and not finding support on a machine it actually shows up on. I'm sure it works well for supported routers but I have to find a friend that wants it or throw it away. It's easier just to eat the $35. loss.", "verified": true, "helpfulness": "1/2", "author": "Wade Sprague"}, {"rating": 3.0, "review": "The main reason I bought this was to be able to connect my Chrome browser on my iPad to the TV. I felt that I did my research before purchasing it and did not see anywhere that this would not work. It was not until I set it up that it told me that Chrome is not compatible on the iPad. I'm hoping that there will be an update at some point so that I have use for it.", "verified": false, "helpfulness": "0/0", "author": "WTR2170"}, {"rating": 3.0, "review": "I have a number of devices already hooked up to my tv - and my tv itself - that get Netflix, YouTube, etc. I got this mostly to stream HBO Go.", "verified": true, "helpfulness": "0/0", "author": "J. Wardein"}, {"rating": 1.0, "review": "could not make it work. Instrutions are very limited.  Suggest sending better instructions so everyone can follow them not just computer experts.", "verified": true, "helpfulness": "0/1", "author": "Barbara Hart"}, {"rating": 3.0, "review": "Works great for the HBO, YouTube, and Netflicks, but needs more apps. We're trying to weed down our large TV bill and this is a good start, but needs more gusto!", "verified": true, "helpfulness": "0/0", "author": "Jakob C. Froisland \"electroman\""}, {"rating": 5.0, "review": "It works just like it supposed to. We are now watching Netflex movies right on our tv. So nice not to need to send back and forth thru the mail.", "verified": true, "helpfulness": "0/0", "author": "Karen S Weihrauch"}, {"rating": 4.0, "review": "This works pretty much exactly as expected.  As more apps come on board to support this it will be even better.  YouTube, Google Play, and Netflix all work well.", "verified": true, "helpfulness": "1/1", "author": "Jeff Mick"}, {"rating": 5.0, "review": "love itevery home should have a few of these.  its cost effective and convienent.  I reccometn researching all its functions.", "verified": true, "helpfulness": "0/0", "author": "Carl baloney"}, {"rating": 4.0, "review": "performs as advertised. nice product at a reasonable price. saved me the cost of purchasing an expensive integrated internet tv because this turns my tv INTO an internet tv without the additional cost.", "verified": true, "helpfulness": "0/0", "author": "keaka"}, {"rating": 5.0, "review": "Google Chromecast HDMI Streaming Media Player we just love the media player. I recommend this product to others it work fine.", "verified": true, "helpfulness": "0/0", "author": "reva bochner"}]