[{"rating": 5.0, "review": "I will never be able to sleep again because the choice of movies, tv, etc through this device is amazing!!  How cool to sit on the couch with phone as your remote. Also using at work to chrome cast our web-based software onto 2nd screen.  Can't WAIT until this supports VLC player. Just a pointer- you CANNOT cast web pages from and android or IOS tablets or phones. So far all I've found that will cast browser is Dell Venue 8 pro 7\" table (about $275) and The new Surface (about $800). All laptops and desktops will cast just fine.", "verified": true, "helpfulness": "0/0", "author": "Rachelle Crews"}, {"rating": 3.0, "review": "The number of programs/apps that the chromecast is compatible with is rather lacking.  I only chromecast compatible programs regularly use are netflix and youtube.  Unfortunately, both also are available as apps for my TV, so the chromecast is pretty redundant.  If they were able to add more compatibility from sites that stream, the utility would skyrocket.  As of now though, it's just a novelty item to be able take a youtube video from my phone and move it to my TV.", "verified": true, "helpfulness": "0/0", "author": "1Bed_1Bath_Apt"}, {"rating": 4.0, "review": "Very impressed with the performance of Netflix.  Definitely HD quality and flawless motion.  Very impressed overall.  The ease of staring a Netflix or Youtube video on the chromecast is super easy and my kids are having a lot of fun with it, showing me all their favorite videos. However, I wanted to travel with it and I don't believe it has a way to answer connection pages from hotel internet. For the price it can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Brent A. Moulds"}, {"rating": 5.0, "review": "The Chromecast is an absolute steal.  For 35 dollars you can essentially turn any TV with an hdmi port into a smart tv.  The Chromecast allows you to stream from virtually any device (android/apple phones & tablets, any computer with google chrome).  For most modern TVs the chromecast will power itself by plugging into a USB on the back of the TV for power.  If your TV doesn't have a USB port then you can still easily plug it into the wall for power.  It's extremely easy to setup and I had mine up and running in under five minutes.We use it all the time for everything from watching movies on netflix, renting movies from google, listening to music on pandora and watching videos on youtube.  I never realized how much we would use the youtube feature, but we have a young son and my wife loves being able to play educational videos and songs for him easily on youtube.  The chromecast is also great for parties because i'm easily able to play songs and videos from my phone anywhere in the house without having to mess around with the TV. One of my favorite features is how it will automatically switch inputs to the chromecast as soon as you start casting from your device without needing to manually switch the input on the TV. If I'm sitting at the computer and I want to play a video for my son I can simply cast it from the computer and the TV will switch the input to the chromecast without me having to get up.The chromecast already supports a lot of great apps and with the recent release of the SDK it is now available for all developers to implement into their apps.  I expect most of the major apps to have chromecast implemented in the near future which will give it even more function and use.  I would highly recommend this device.", "verified": true, "helpfulness": "0/0", "author": "C10layman"}, {"rating": 1.0, "review": "Really, don't need to watch youtube on my tv.  all 'smart' tvs already allow you to do this. The only reason people would want this is if they buy google videos.I just tried this device on my tv and would like my money back.  I don't know when I will ever use it again.", "verified": false, "helpfulness": "0/1", "author": "Ron \"unltd5\""}, {"rating": 5.0, "review": "ALTHOUGH IT WAS A GIFT FOR MY SON, HE REPORTS THAT HE IS VERY HAPPY WITH IT AND HAS ZERO COMPLAINTS", "verified": true, "helpfulness": "0/0", "author": "Shopper54"}, {"rating": 3.0, "review": "Google still needs to open this up for customization. At this time of this review, they are limiting it so you can mainly do the preset streaming of Hulu, Netflix, etc. Sure, I can cast the browser content on my laptop to our TVs but it doesn't stream nearly as well as the standard apps of Hulu, etc.There was a workaround by at least one developer and then with updates that loophole was closed.", "verified": true, "helpfulness": "0/0", "author": "Micmac"}, {"rating": 4.0, "review": "Great device for streaming the basics but I would like to see more connectivity to other applications.  I like that it is concealed and out of sight too!", "verified": true, "helpfulness": "0/0", "author": "Evan R. Sanders"}, {"rating": 5.0, "review": "Pretty cool little device.  impressive device.  Because of this thing, I can finally see considering giving up my cable company.", "verified": true, "helpfulness": "0/0", "author": "rnldtippitt"}, {"rating": 5.0, "review": "I bought this during the holidays to play Dirty Santa and stole it back from the person who picked it.Netflix & Hulu Plus does not autoplay with chromecast but whatever. I still love it.", "verified": true, "helpfulness": "0/0", "author": "TuVy V Nguyen"}]