[{"rating": 4.0, "review": "ProsFairly pricedConsdoesn't stream from own home network and serverCauses my youtube app to crash on nexus 4. Anyone else have freezing issues?", "verified": true, "helpfulness": "0/0", "author": "Love.Live.Life \"-Andrew\""}, {"rating": 3.0, "review": "Most every household has an apple iPad or iPhone and please note that you can't install chrome extension onChrome Browser..  So there is no casting from your chrome Browser from iPAD to your TV.You are pretty much stuck with YouTube and NetFlix on iPAD and that's all I see from my chromecast app.No chrome webstore on iPhone or IPAD.Also installed chromecast on my applie MAC and casting from chrome browser works and you can go tochrome webstore and download appsHence I have given 3 starts..  But the installation and getting it to work is a snap.Hope Google addresses this issue.  I am sure people would have posted this to goggleand I am thinking of returning it back to AmazonRam", "verified": true, "helpfulness": "0/0", "author": "R. Kannan \"RK\""}, {"rating": 5.0, "review": "I have one of these myself and love it. Completely replaced Roku for me. I got some tablets for people for christmas and chromecast and they all love them as well. This is one of the best value items out there.", "verified": true, "helpfulness": "0/0", "author": "T-me"}, {"rating": 1.0, "review": "Thought Chromecast had more potential than Roku, but most of the sound and video quality was HORRIBLE.  Tried to watch 'The Young and the Restless' and the lip syncing was like a bad Godzilla movie, with rough, poor quality sound.  Big disappointment.  Back to using Roku.", "verified": true, "helpfulness": "1/1", "author": "Jim"}, {"rating": 5.0, "review": "easy install and i love it! no need to spend the extra money on roku or any of the other products out there!", "verified": true, "helpfulness": "0/0", "author": "Jackson Jeans"}, {"rating": 2.0, "review": "I can't get it to connect. I guess something needs to be changed on my router but I don't know what to do about it. I'm sure I would love it if I had a decent wireless connection. So no fault of the Google Chrome cast but am still dissappointed.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is the best $35 you can spend on tv.  I pay too much for cable.  Bye, bye Comcast. I am going to save a grand every year.", "verified": true, "helpfulness": "0/0", "author": "Old and in the way"}, {"rating": 4.0, "review": "Gift for my 71 year old mom, so user friendly she installed it herself and has been binge watching everything she can stream!", "verified": true, "helpfulness": "0/0", "author": "Valerie Eppel"}, {"rating": 5.0, "review": "Would prefer much more support from more apps but it's worth what you pay for it.It works without any issues and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "vaivab"}, {"rating": 5.0, "review": "Hey, for $35.00 and you can find it on sale at times for $29.99.....it works great.....very convenient.....very portable.....goes where you go.....get Plex installed on a server and use this remotely wherever you go! Awesome product!", "verified": true, "helpfulness": "0/0", "author": "TroyAR"}]