[{"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Oneyda Salazar"}, {"rating": 1.0, "review": "Device was not what I expected, the apps offered for this device are crappy", "verified": true, "helpfulness": "0/0", "author": "Alfredo Valdez"}, {"rating": 5.0, "review": "Great for apps not yet on Xbox one or ps4 and at such a low price its totaly worth it!", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Dori"}, {"rating": 5.0, "review": "Good product, does what it is suppose to do.", "verified": true, "helpfulness": "0/0", "author": "George Coleman \"The Leader\""}, {"rating": 5.0, "review": "Just what I was lookin' for!", "verified": true, "helpfulness": "0/0", "author": "jack harmond"}, {"rating": 5.0, "review": "Easy setup, beautiful pictures on the \"screen saver\" and it works just as hoped/expected.Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Diane Taylor"}, {"rating": 5.0, "review": "This has better quality and faster picture rendering than streaming to my PC!", "verified": true, "helpfulness": "0/0", "author": "R. Mozingo"}, {"rating": 4.0, "review": "Great product! Just make sure to check your router compatibility! It does become a pain when your router is not fully compatible as you have to dive into the settings inside your router to make it suitable for CC.Another thing to note is that if you have a low end router, this thing HOGS A TON of your bandwidth, so you end up having devices disconnected. For example, my phone disconnected as i was watching netflix through my CC on my laptop and then i noticed my WIRED router to pc connection stopped working. A restart fixed it all but weird things tend to happen at times when Chromecast is connected.Long story short, make sure your router is top notch and compatible or weird things happen!", "verified": true, "helpfulness": "0/0", "author": "Armagan Sezer"}, {"rating": 5.0, "review": "It does what its supposed to do. I can now easily stream Netflix on my TV and I'm able to stream content from the web on TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]