[{"rating": 5.0, "review": "I have used Apple TV for years and my daughter got me a Chromecast for my birthday. I was skeptical at first. But this is so easy to use, just as easy as Apple TV. I like it so much that I got one for my girlfriend and a second for myself. I cast from my Google Nexus tablet, my iPad, and my iMac, my daughters Google Nexus phone. Using a tablet with Netflix or HBO Go is so much easier than the way I used to access these services using a remote control and no keyboard. It is so easy to find shows, resume shows. The control of the play/pause/resume from a tablet or PC is instantaneous. I play my music using Google Music (since iTunes does not work with Chromecast)  in the same way I use Airplay from Mac or iPad or iPod. There could be more apps, but right now it meets my requirements and I am very satisfied.", "verified": true, "helpfulness": "1/1", "author": "Ian"}, {"rating": 1.0, "review": "You can only \"Cast\" from Iphone or Ipad from apps offered by Google.  I even installed Google Chrome on my Iphone 4 but I still couldn't cast  programs to my TV offered on the web.  I feel misled because that is not stated.  Shame on Google... how much $ do you need?  Is being deceptive really worth it???", "verified": true, "helpfulness": "1/2", "author": "Joe Giordano"}, {"rating": 5.0, "review": "Google Chromecast is byfar one of the most useful products that I have ever invested my money into. It's a simple, fun, and easy to stream media to your TV of choice. For it's affordable price, it fights well on the market for media streaming players.PROS:-affordable price (comparatively)-simple setup-can stream youtube, netflix, etc.-allows for simple web browsing-no subscription fee-small and easily movable productCONS:-does not come with any sorts of remote-does not work with my HDMI switch (this was a huge bummer for me)Worth the purchase? Google Chromecast is a perfectly functional product that allows for media streaming extremely easily. YES!", "verified": true, "helpfulness": "1/1", "author": "EleidranTV"}, {"rating": 1.0, "review": "it still doesn't do as much as the Apple TV. The only good thing about it is that its small compared to other devices.", "verified": true, "helpfulness": "1/2", "author": "Marissa"}, {"rating": 3.0, "review": "Can't ask much more for the price. It does the job!It would be cool if it could support more features and apps already installed on it.I've had it for around 8 months now and works like a champ.", "verified": true, "helpfulness": "0/0", "author": "Martin Endara Crespo \"yourdudeness\""}, {"rating": 3.0, "review": "the apple tv is much better.  this is cheaper though.  works great for netflix and youtube, but that's it.  it doesn't stream anything else.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 2.0, "review": "Random disconnects/connects in a home wifi network.I was not happy hence returned itPlease fix the issues before release to market.", "verified": true, "helpfulness": "0/0", "author": "Ramana Reddy Polaka"}, {"rating": 5.0, "review": "If you have a portable and a large screen TV,  as well as WiFi in your house, this device can help with video presentations as well as stream many types of online videos from your Google Chrome browser. Works well for the price.", "verified": true, "helpfulness": "0/0", "author": "Frank S"}, {"rating": 1.0, "review": "I bought this for the purpose of using my ipad 2 to stream Netflix to my TV.  Interestingly, YouTube (a Google product) works perfectly from the ipad.  But I did not pay $35 to watch youtube.  So as it stands this device does not do what it says it will do, and I am using the latest version of iOS including all of the updates.  Also interestingly, my Android (also a Google product) phone will stream Netflix to the TV just fine.  So what they should say is that this Google product is designed to work with other Google products, and anything else is a complete gamble.  Had I known that, I would not have bought it.", "verified": true, "helpfulness": "1/1", "author": "Toypalace"}, {"rating": 4.0, "review": "I like the player itself, but still haven't figured out how to cast from the Kindle Fire. Waiting for a tech savy person to help me. In the meantime, casting from my Android phone and very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Margaret"}]