[{"rating": 4.0, "review": "So far so good and it does get a little hot so I suggest turning it off when it is not in use", "verified": true, "helpfulness": "0/0", "author": "OneTechGenius"}, {"rating": 5.0, "review": "Love it! Crystal clear streaming!! Better than my cable company:)", "verified": true, "helpfulness": "0/0", "author": "drfitmindandbody"}, {"rating": 5.0, "review": "I am absolutely completely pleased with this purchase", "verified": true, "helpfulness": "0/0", "author": "K. Marceau"}, {"rating": 4.0, "review": "Loads fast, needs to add vudu channel. Love that you can side load apps.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Love love loveExcellent wifi rangeEasy set up", "verified": true, "helpfulness": "0/0", "author": "Chad Schell"}, {"rating": 1.0, "review": "To .much interference with weather hard to follow a program. Sad I bought this equipment.  Wish you wold have stated the possible interference. Wish we wood nav e stayed with Comcast,but could not afford the cost.", "verified": true, "helpfulness": "0/6", "author": "Arlo A Marsh"}, {"rating": 4.0, "review": "Great picture and variety of channels. Reason I only gave it four stars is because movies freeze sometimes, buffering takes too long.Still a better choice than cable, more channels and much lower price. I got tired of the cost of cable TV.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Clingan"}, {"rating": 5.0, "review": "I think you put out some amazing prigrams.  Right now binging on O&B.;  Quality, gut wrenching.  Damn Good.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Herbes"}, {"rating": 4.0, "review": "The only reason I bought the Amazon Fire TV was because I saw that it had the NBA Game Time app. I have subscribed to the League Pass for years and I was hoping this was my gateway to the games. I was wrong. It only shows clips and stats. My problem with this was that the logo for the NBA League pass advertised was the wrong one. Anyways. Other than that, this little box is the real deal. Its powerful and I can watch a lot of channels online with my provider subscription..I hope one day they will bring the NBA Game Time for watching full games for League pass subscribers..That would be awesome", "verified": true, "helpfulness": "0/0", "author": "weemo"}, {"rating": 2.0, "review": "Had it for a little over a year.  I thought it was great at first.  It used to work great, now, not so much.  Wont stream from PLEX anymore and Netflix and Amazon are hit or miss, mostly miss.  Have an older Roku that is farther away from the router which still performs better.", "verified": true, "helpfulness": "0/1", "author": "adam cummings"}]