[{"rating": 3.0, "review": "A little bit of false advertising on Google's part with regards to streaming from a smartphone.  The commercials make it look like you can stream anything from an iPhone but this is not the case.  The iPhone app only allows streaming of, wait for it, Netflix and YouTube.  Yay!  Yet another way to stream content to your TV from those two apps, just in case you don't have a Roku, Apple TV, Smart TV, Smart DVD player, or any one of the huge number of devices which already exist for these two services.I have an iMac and this does allow streaming of content from the Chrome browser.  For example, I'm able to stream foreign television which is kind of cool and I can watch Monday Night Football by streaming.I'm disappointed that I have to use an old fashioned computer to stream from a browser but hopefully Google will add the ability to stream from an iPhone or Android browser in the near future.", "verified": false, "helpfulness": "1/2", "author": "Neil bey"}, {"rating": 4.0, "review": "Installs easily,  works well love using my tablet or phone as my remote. Use HBO to go,  hulu and Netflix with no problems.  Streams videos from my desk top chrome browser no problem.  Have yet to stream a movie from the play store, but I imagine that'll work great too.Minus 1 star due to lack of apps,  but I understand that Google is releasing development tools now, so that should change soon.", "verified": true, "helpfulness": "1/1", "author": "Scoo"}, {"rating": 2.0, "review": "Not as flexible as you might think and they have disabled some of the original ways to use it at home.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It is a good buy. I really came to know the use of this device once it arrived in mail. It is good gadget to have in everyone's house.", "verified": true, "helpfulness": "0/0", "author": "Alok Kumar"}, {"rating": 1.0, "review": "It doesnt work on netflix, just a fill movies, do not worth the price. I dont recomend that device. garbage.", "verified": false, "helpfulness": "1/10", "author": "Sidney I. F. Lima"}, {"rating": 5.0, "review": "This device works like a charm. I can now watch my you-tube videos on my big screen. The only complaint I have is that sometimes the picture stalls / stops casting mid-stream. But it does not happen often enough for me to care.", "verified": true, "helpfulness": "3/4", "author": "Miss S"}, {"rating": 4.0, "review": "good quality while streaming from Netflix and Youtube, but there are two few apps support chormecast now, and it doesn't work well with desktop chrome, which is quite disappointed. Still, $35 price tag makes it a very good buy.", "verified": false, "helpfulness": "1/1", "author": "Tom D"}, {"rating": 2.0, "review": "Like Google Drive Sync, Google has released another product that is not ready for prime time. The Chrome plug-in worked for approximately 15 minutes before stopping.  After that, I could not even mirror google.com.  Prior to that, I tried to mirror Amazon. Cast does not support Silverlight of QuickTime.  The Chrome plug-in also caused the Chrome Browser to cover my task bar.  Yes,their own plug-in broke their own product.  Google support is terrible.  They seem to think users want to search forums and submit logs to improve the bugs in their products.  Official support provides mostly useless basics. I give 2 stars only because it was 35.00 and if you need for Netflix or Hulu it will work.", "verified": true, "helpfulness": "0/2", "author": "mtw"}, {"rating": 2.0, "review": "Notice that with the exception of youtube ... ALL THAT IT WILL PLAY IS PAID FOR CONTENT..... if you intend to spend money every time you want to watch something then this is for you ... i don't even get the point of it , you use your phone to buy content that you could buy from a store or rent from a store or right from your cable provider and it beams it to your TV ... THIS IS A COMPLETE WASTE OF MONEY . when i bought it i had the impression that i would be able to bean content from my phone to my tv , that IS NOT the case .... i wish i had waited longer for reviews to start coming in before ju,ping on this pre release .... I threw mine in the garbage", "verified": true, "helpfulness": "1/7", "author": "H4xor66"}, {"rating": 5.0, "review": "It is very easy to use with TV!It work with computer in Chrome browser.Need to have more apps.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}]