[{"rating": 2.0, "review": "I admit it, I got caught up in the hype of this thing. I also know its still a work in progress as more apps are still being developed, but out of the box all I'm able to do is stream YouTube videos.  I spent quite a bit of time trying to get Netflix working with my MacBook, iPhone, and iPad. I have not been able to play a single movie through the Netflix and chromecast combo. I've looked for answers on both Netflix and google (through feedback) and haven't had any luck. I'm surprised that everyone else was able to get it up and running so quickly, I must be missing something", "verified": true, "helpfulness": "9/25", "author": "James D"}, {"rating": 5.0, "review": "This is a thorough review of Chromecast paired with:- Nexus 4 running 4.2.2 Jelly Bean- Windows 7 64bit PCI will review Chromecast based on the aforementioned devices running Netflix, Youtube, Google Play (supported apps per 07/26/2013), and several webpages.1) Installation: [5/5]Nexus 4: Install Chromecast app from google play: [...]PC: Require Google Chrome Browser and Google Cast Web Extension: [...] (not needed for Netflix and Youtube).Chromecast (TV): Other than inserting your wifi password, there is no other installation.2) Netflix (the best app so far): [5/5]Both Netflix app (on Nexus 4) and Netflix website (PC) has a native \"Cast\" icon build in. If you are connected to the similar wireless network to your Chromecast, both Netflix app and website will recognize it. As soon as you click the icon, the TV will turn on (if the TV was off) and it takes about 3-5 seconds for the video to start. So you do not even need to pick up your TV's remote to turn on the TV.On Android: when a video is playing, there are Play/Pause, Stop, Repeat icons on your notification bar and also on your Lock screen acting like a controller to your TV. You can also control the volume from your phone. Even if you completely close the Netflix app, the video is still running, while the controller remain on the notification bar. The next time you open Netflix app, it will automatically recognize the connectivity and you can either choose another video or go to controller page.On PC: pretty much similar experience with Netflix app on Android phone. You can close your chrome browser tab, and it will not disturb the video. Next time you open Netflix tab, you can control the video.3) Youtube: [5/5]Everything is pretty much similar to Netflix. The only thing that the Android's Youtube app lacks in comparison with Netflix is that there is no Play/Pause, Stop, etc. control on the notification bar nor at the Lock Screen. However, when a video is playing, there is a still notification that will open the Youtube app.Other thought on Netflix and Youtube apps: I am very impressed with the 'switch-ability' between PC to Android and vice versa even between these two apps/website (Youtube and Netflix). No matter which app I opened first from either device (PC or Android), it is smart enough to \"read\" each other, in a way that there is almost no dis-connectivity at all between apps and devices.4) Google Play: [4/5]On Android: there is the native \"Cast\" icon on both Google Play Music and Google Play TV & Movies. It only plays online content, not the local content.On PC: Unlike Netflix and Youtube website, (as per today 07/26/2013) there is no native \"Cast\" icon on Google Play Music and on Google Play Video (which actually opens an embedded Youtube player but without \"Cast\" icon). However, the \"Google Cast\" chrome browser extension will be able to do the job for these two websites. See next discussion for more details about this extension.5) Mirroring from Chrome Browser \"Google Cast\" Extension (Beta): [4/5]First of all, the mirroring is NOT similar to \"duplicate screen\". You can only cast a single Google Chrome's browser tab. So technically, you cannot use your TV as your alternative monitor screen, because you can't see your mouse hovering on your TV. It will only display exactly everything inside your Chrome tab. I am casting this page as I am typing, and I notice 1-2 seconds lag between my typing and what it shows on TV. As long as the cast tab is not closed, you can continue use your PC for something else.I tested several websites that has a video feature and I have concluded that Chromecast video mirroring works on every websites that utilize Adobe Flash to run the audio/video; that includes:- Google Play Music (play.google.com/music/listen) and TV&Movies; (play.google.com/movies?hl=en)- Pandora.com- Play.Spotify.com- Vimeo.com- TheVerge.com- ESPN.go.com- etc.Unfortunately, Amazon Instant Video is the only video website that doesn't work. I assume that Silverlight is not supported at this moment.Additional note: Because there is no extension feature on Android Chrome Browser, I do not find a way to cast from Android Chrome browser.[Update 07/28/2013]:Local content that is supported by Chrome browser/OS can be played/cast to TV just by dragging the icon file into the active-cast Chrome tab (credit: CAC1031 and MaestroT - thank you). Here is the list of supported files: [...] While the music/video is cast to the TV via a Chrome tab, you still can watch another video or listening to another music on your PC.Final Thought: If there are more websites and apps that are as integrated as Netflix, this small little device can be ridiculously convenient. It works almost flawlessly between apps, across different devices. When I saw the launch demo, I found it hard to grasp how the inter-connectivity works - for they tend to use \"marketing\" language in this kind of demo. But lo and behold, it just works. Even though there are some imperfection on the chrome browser mirroring (beta) and inability to play local content (at least currently), I don't think it justifies a star reduction. For what it does, at this price, I would still give Chromecast 5/5.Thank you,WP", "verified": false, "helpfulness": "30/39", "author": "wpramono"}, {"rating": 5.0, "review": "I have been looking for a portable dongle that I can use to stream Netflix into my television from my MS Surface Pro tablet. I am glad that I stumbled upon this product yesterday through CNET. The price is truly the deal maker and the features are just what I wanted. Now, I am enjoying Netflix through my TV flawlessly. I am looking forward to seeing more apps that will support Google Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Mary"}, {"rating": 5.0, "review": "I received my Chromecast today (bought two of them).This device is amazing. Waaay better than Apple TV, Nexus Q, Xbox 360, PS3 (streaming) Roku or even an HTPC.While people have complained that the chrome browser extension is in Beta and choppy, they are totally wrong! I am running a mid-2010 MBP and have no issues. You can stream directly from ANY website! HBO, Amazon, ESPN, NHL Gamecenter, anything that you can possibly thing of (even some of those illegal streaming websites, which I don't use).All I can say is...wow!", "verified": true, "helpfulness": "3/4", "author": "Michael Golden"}, {"rating": 5.0, "review": "Chromecast can stream all local content using Plex Media server.What all you need to get this to work:Windows 7/8 machinePlex media server - (Free software you can use to stream)ChromecastTelevision with HDMIPlex Media server allows you to play all media files through your browser. That then enables you to cast in full screen whatever movie you have stored on your Hard drive. It took me about 20 minutes total to get it working. For 35 bucks it is great to use and the fact that i finally have everything streaming through it helps out tremendously. Thanks.", "verified": true, "helpfulness": "1/2", "author": "Adrian Dorsey"}, {"rating": 5.0, "review": "I picked up 2 Chromecasts from a local big box retailer (you know the one...I was able to still get my free 3 months of Netflix that way), and Google has a sure-fire hit on their hands. I'm going to take some time to both review the product, and to fully explain the pros and cons.Before you purchase one, please make sure you have either: an Android phone or tablet (running 2.3 Gingerbread or higher), Windows PC (running Windows 7 or higher), or a Mac (running OS X 10.7 Lion or higher), or a Chromebook Pixel (running Chrome 28 or higher). You will need this to setup the device. That device will ALSO need to have access to the same WiFi network the Chromecast will be connecting to. This means you can't do the initial setup from a PC or Mac that only has an ethernet connection. While the device can currently be operated by an iOS device, there currently isn't a setup app available for iOS devices. Expect Google to remedy this very soon.The dongle has two ports: one in the front to plug into an HDMI port on your tv, and one in the rear for microUSB power. Yes, the Chromecast needs to be powered (like any other streaming device). On newer tv's that FULLY implement the HDMI 1.4 spec, the port will power the Chromecast by itself. On tv's that don't, you will need to use the USB cable. If your tv has a USB port (the port MUST be labeled USB or have the USB logo...ones that say \"service\" are not powered ports) then simply connect the cord to that to power the device. If not, Google still has you covered: they include a pretty standard 850mA USB power adapter to plug into a wall socket. Also included is an HDMI extender cable. This may be useful to you if your tv is wall mounted or very close to it, and the HDMI port sticks straight out towards it.The setup program is straightforward and simple....very easy to use regardless of platform. You turn on your tv, and tune to the input source it's connected to. Your tv will display a \"set me up\" screen with the WiFi name of the Chromecast dongle. You go to Google's website (listed on the screen and on the packaging), download the setup app, and follow the instructions. I would hazard a VERY educated guess that the reason iOS doesn't have a setup app yet is because the process for iOS would break this very simple process, since Apple won't allow downloading apps from Chrome. The app would have to be approved by Apple, and hosted in the iOS App Store. Follow the few steps, let the program find the Chromecast (if you have more than one it will find them all at one time!), verify your codes on your tv's, and voila! You are done....well, almost. If you are using a PC or Mac, you will also be prompted to add the Google Cast extension to Chrome, which will allow you to cast any open tab to the device.It may be impossible to make a streaming device that is easier to use than this...PERIOD. There essentially IS NO UI. After initial setup, anytime you are in an app that supports casting AND on the same WiFi network, you will see a square icon (with a small WiFi icon in the corner of it) appear. That's the \"Casts\" icon, and all you have to do is click it to send the video or audio (or Chrome tab on a PC/Mac) to any Chromecast dongle on that same home network. A menu will appear asking you which device you want to send it to. Select which device, wait a second or two, and you are streaming. It's literally that simple. After the dongle starts streaming the device you used to start the cast can be used as a remote to control the cast. 2 great things about this compared to other alternative products: 1) no remotes to lose or learn in addition to the many remotes you already have. 2) the remote control functionality is separate from the streaming. The Chromecast streams for itself over your WiFi internet connection, NOT FROM YOUR PHONE/TABLET/PC/MAC. You can minimize the remote control window, use that device to do other things, etc. and it will have no impact on the video or music being streamed.The Chromecast will automatically stream at the native resolution of the display it's connected to, so if your tv is 1080p you had better make sure you have a fast enough internet connection. Folks with 6-10Mbps connections who think their connections are \"fast\" will be in for a rude awakening. My 50Mbps connection allows flawless 1080p streaming even with other devices downloading on the network at the same time, but 20Mbps should work just fine in that scenario as well. If your connection is too slow, get ready to deal with buffering and stuttering.I am currently using the device for Netflix, Google All Access Music, YouTube, and tabs in Chrome. There currently aren't many services compatible yet, but due to Google publishing all of the APIs so companies can make their apps compatible I'd expect many of them to get on the bandwagon very soon. HBOGo and Pandora should be on deck very shortly. Services that currently aren't can always be streamed from a tab (hint), but some of them still don't work well (Silverlight) since when the video is maximized it essentially is in a tab different than the one you selected to cast from.All in all, this device is a steal. There are devices that can do more, and devices that support more services (for now), but there is no device on the market as simple to use and as inexpensive as the Chromecast. The phenomenal video quality (and the free 3 months of Netflix if you bought one quickly enough) is just the icing on the cake. At $35, there literally is little reason NOT to buy one...or more!", "verified": false, "helpfulness": "4/8", "author": "Diskoman"}, {"rating": 3.0, "review": "Going to keep it short and quick.Setup: Easy from my macbook pro.  They thought of everything from what I can see to make the start of this relationship smooth.Graphics: Fantastic, Google Music PoorStreaming: Started out ok, but HD video it struggles. I have a 30mbs internet via my ISP.  Also my routher is a Factory Refurbished Cisco Linksys E2500 Advanced Simultaneous Dual-Band Wireless-N Router.  TV and  Mac are 10ft away from both.  It's not usuable right now.  I will play with my settings to see if that helps but its choking up all streams.Final verdict. It doesn't work well enough for me.  But if theres one thing that Google is, is a team of programmers.  It will get better, for now I'm breaking up and going back to my old GF appletv.", "verified": true, "helpfulness": "18/26", "author": "Dhan \"Mostly Meh\""}, {"rating": 4.0, "review": "I was lucky enough to get an order in before they sold out and I'm glad my knee jerk decision didn't turn out to be a bad one. My TV streaming tool of choice up until today has been my XBOX 360. So I'll be making my comparisons with it. I am fully aware that the 360 and Chromecast are in two vastly different price ranges, so I'm not saying you should choose one over the other, I'm merely comparing it to an experience that I imagine a lot of people have access to already.I'll quickly touch on setup. Plug it in and connect the USB cable to either the wall or a USB port. I plugged the USB into the back of my 360 and it worked perfectly. I set mine up via the Chromecast app on my Android phone. Basically just name it and put in your Wi-Fi password. Took about thirty seconds before I was able to start using it.I imagine most people are interested in sharing from your computer screen. Sharing your Chrome tab via Chromecast is great, but if the only reason you're thinking about buying Chromecast is to stream internet videos to your TV, you're probably going to be disappointed. I tested with 2 computers, an older laptop and a decent gaming desktop. From the laptop it was unwatchable, at least a 2 second video/audio lag even at the lowest resolution setting. From the desktop there was still a noticeable lag, but it was small enough that I would be able to watch the video at least. So buyer beware, it seems this functionality is pretty dependent on the specs of your source. It's also worth noting that tab sharing is listed as a BETA feature and will likely be improved in the future. Sharing your entire screen is also possible via Chrome, but it is listed as \"Experimental\" and not even BETA status yet, so in its current form its uses are fairly limited. I was happy to see though that it does not limit the sharing to Desktop Mode of Windows 8, it will continue sharing your screen even if you switch to a native Win 8 application. Do not purchase Chromecast if you plan to use it to play games from a PC on your TV, it's just plain never gonna happen, and there are much better options for that.YouTube is an almost identical experience with the 360. If you've shared YouTube with a device in the past you're not looking at anything new. I tested Chromecast both from my Android phone's YouTube app and my laptop via the browser and it's essentially the same. Both worked great with no buffering issues at all. The main downside is that if you close your browser/app and want to control the video, you have to relaunch it to control it (it will continue playing if you navigate away from it). As glitchy as the 360 YouTube app can be I could give this one to the Chomecast based on that alone.Google Play Music is probably the feature I like the most so far. I listen to Play Music often and am a subscriber of All Access. Streaming to the TV works flawlessly just as if you were streaming to bluetooth speakers from your phone. Once you select the cast option you just use the app to control your music normally. My only complaint is that the visualization could use some work, it simply bounces around the album art and track info. I'd like to see more on the screen, otherwise there's really no benefit of casting to your TV rather than speakers. I've yet to find a way to stream Play Music via my 360, so Chromecast wins by default.Netflix loaded up quickly and seems to work fine. To be fair, Netflix works fine on basically everything these days, so I wasn't expecting anything out of the ordinary. Since the search functionality on the 360 is pretty horrible I'd rather use Chromecast, but it's not so much better that I would feel the need to turn off my 360 and switch to the Chromecast if I already have the 360 on. One thing I do like better about the 360 app is that it will jump to the next episode for you. With Chromecast it stops after the current episode ends. Casting Netflix from my laptop browser worked exactly the same as Youtube. Note: Closed Caption settings do transfer to your TV.Overall, it's not the best possible device for all of your streaming needs, but at $35 it definitely meets the needs of an average user. If/when they improve the PC sharing capabilities this will easily be a 5 star product. I'm looking forward to more supported applications, but even if they never update it again (which is very unlikely) I still wouldn't feel like my $35 was a waste.", "verified": true, "helpfulness": "1/2", "author": "James P"}, {"rating": 5.0, "review": "For only $35, you can stream videos on your tv from almost any device. It is very easy to set up, and to use.", "verified": true, "helpfulness": "1/2", "author": "Lac Long"}, {"rating": 4.0, "review": "WIll this work in Baja CA? I was told that a Roku will not, is that true? I would like to get a Roku also, so if anyone could answer my questions, it be great.  Thanks", "verified": false, "helpfulness": "0/3", "author": "mikeran"}]