[{"rating": 5.0, "review": "Love being able to cast videos from my phone to my TV.  Great invention!", "verified": true, "helpfulness": "0/0", "author": "Fat Dog"}, {"rating": 5.0, "review": "Love it Best Toy For the house yet!!!!", "verified": false, "helpfulness": "0/0", "author": "Allen"}, {"rating": 1.0, "review": "When I saw chromecast advertised, I thought it looked like a cool product; however, when I tried to use it, it didn't work. The reason being is that isn't compatible with my router. The router I have is an apple router, by no means a cheap router, and when I looked at the issues involved with chromecast, there is a huge list of routers that aren't compatible. This product is disappointing, and the fact that not all routers can be used should have been stated prior to my purchase of this product.", "verified": false, "helpfulness": "0/0", "author": "spencer cate"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Padma kattel"}, {"rating": 5.0, "review": "Best device ever!", "verified": true, "helpfulness": "0/0", "author": "Leetenant \"Lee Scollo\""}, {"rating": 5.0, "review": "This is amazing wish i would have bought it sooner. The only thing i wish amazon prime movie could be used with it. But overall its amazing.", "verified": true, "helpfulness": "0/0", "author": "idaly serrano"}, {"rating": 2.0, "review": "This item doesn't work well at all. We have only been able to get it working twice, and even then it freezes a lot. It's cheap, but you're better off with an Apple tv.", "verified": true, "helpfulness": "0/1", "author": "Katherine C Artibee"}, {"rating": 2.0, "review": "Only thing I can get this to do on my galaxy s4 Active is cast you tube, no cast in options, ive read this is a big problem, means I cant cast video or pictures, not tried the netflix ect, limited data, wouldn't buy again", "verified": true, "helpfulness": "0/0", "author": "Karen T. Evans"}, {"rating": 4.0, "review": "works as expected", "verified": true, "helpfulness": "0/0", "author": "Kurt KC"}, {"rating": 5.0, "review": "Need more play time with chromecast, I love throwing videos from my iPad.", "verified": true, "helpfulness": "0/0", "author": "Mark"}]