[{"rating": 4.0, "review": "4 stars because Chromecast should be able to display subtitles function whether you're watching videos or movies in any app.", "verified": true, "helpfulness": "0/0", "author": "Antonio S."}, {"rating": 5.0, "review": "Loves this addition for simply watching you tube and showing off my pictures on the big screen.  I've also had not issue with renting movies with Google Play.", "verified": true, "helpfulness": "0/0", "author": "JC \"Jennifer\""}, {"rating": 4.0, "review": "Awesome device to watch anything. However Netflix is a bit slow on loading. Websites and stuff works fast", "verified": true, "helpfulness": "0/0", "author": "Kevin Ye"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Bill Huynh"}, {"rating": 5.0, "review": "I bought this product to show youtube to my kids. I think this is better than show small smart phone screen.It came much faster than estimated.And it was easy to set up.Just plug in chromecast to tv and  download chromecast app and select wifi.That's it!My kids love to watch yoytube on big screen . And one more goodthing is you can control what to show.", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Shaunte Tinner \"From fire\""}, {"rating": 2.0, "review": "So bummed about this. I bought it because in the advertisement I saw it showed many shows that I like but am not currently getting via cable (HGTV shows). But when I hooked it up, I discovered that the ad was a bit of a bait & switch maneuver and the shows that I wanted to watch were not, in fact available via Chromecast. Also, I expected that I would be able to 'Chromecas' my Google Chrome window directly to my TV. That also doesn't work. Overall disappointed.", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 5.0, "review": "love it have one in both living room and bedroom!!!", "verified": true, "helpfulness": "0/0", "author": "Mrs. Julia A. Bond \"peachy seed\""}, {"rating": 5.0, "review": "Are you kidding? Chromecast is one of the best devices on the market. Great idea! It works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Eric D. Hunter"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Michael Servant"}]