[{"rating": 5.0, "review": "If you have a smart TV or DVD/Bluray, you really don't need it.  Having said that I got one anyway.  I'm not real impressed with my smart Bluray's connectivity and its slow reaction to commands.  This little thing streams YouTube and Nextflix effortlessly. The only draw back, it's support by a very limited number of content providers.  It will stream much of what you have in your Chrome browser window, but places like Comcast have prevented me from streaming from my computer to my TV.  Yes, of course I already have Comcast on my TV, but I tried it to see if it would work.  It's new, so it will have issues and shortcomings, but I think it's great.", "verified": true, "helpfulness": "1/1", "author": "The Tall Paul"}, {"rating": 4.0, "review": "This is the product that will do it for you. Plug it into an HDMI port on your TV and download the app/extension to your device and you are set.", "verified": true, "helpfulness": "0/0", "author": "techguysmtx \"Solution Software\""}, {"rating": 5.0, "review": "We got one first to test it out and loved.  When my parents came to stay with us, we got one for for the guest room and the Family room TV.", "verified": true, "helpfulness": "0/0", "author": "Marguerite Ye"}, {"rating": 5.0, "review": "Does exactly what is advertised.  Simple to use.  My only wish is they would roll out other apps faster than they are.  There are only a few big names in the list.  Amazon, I'm looking at you and your video service.  Would be great to stream to the chromecast.Given time I'm sure all of the major services will be offered.  For thirty bucks, you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Stephen B."}, {"rating": 5.0, "review": "I just installed it (super easy) and am watching youtube vids on my huge tv right now!  I have always hated watching movies and vids on my computer or other devices unless I'm out somewhere and it's my only option, because it's so small.  I realize it doesn't do what everyone wants it to but I am sure lots of things will be added eventually and for the price it is totally worth just what it does right now.  Love it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "for what it can do, it's absolutely perfect. anything on a browser now can be on your tv.  I love it so far, no complaints here.", "verified": true, "helpfulness": "0/0", "author": "Springdreams22"}, {"rating": 5.0, "review": "I like so much this one!!! It was in the way that i imagine I use and I watch all my movies", "verified": true, "helpfulness": "0/0", "author": "Vicky"}, {"rating": 5.0, "review": "I had been waiting to get a streaming device after using an HDMI cable to connect my laptop and was considering Roku and others.  My phone & tablet are both Android products and I use the Chrome Browser so this is extremely easy to setup and use and can be easily switched between TV sets without additional setup.  The only improvement I'd like is to be able to \"Cast\" from my tablet's Chrome Browser", "verified": true, "helpfulness": "0/0", "author": "Brian Sharlach"}, {"rating": 5.0, "review": "Why would you not get this product. I have purchase 4 of these for my friends and they all love them. It is a very inexpensive way to stream things to your TV", "verified": true, "helpfulness": "0/0", "author": "Kyle Yee"}, {"rating": 2.0, "review": "It was very limited in the offerings and controlling it with my Android smartphone was not that precise or easy. I set it aside and haven't used it in awhile. I will have to go back and revisit it to see if there is any improvement. The price is worth the curiosity though.", "verified": true, "helpfulness": "0/0", "author": "Allan S. Greenberg"}]