[{"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Barbara Sajewski"}, {"rating": 5.0, "review": "I love this thing.  It works great.", "verified": true, "helpfulness": "0/0", "author": "Richard A. Mcjunkins"}, {"rating": 5.0, "review": "Best purchase of 2015. I love the Amazon fire tv.  So easy to setup and now I can catch up on American Horror Story on Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "CB"}, {"rating": 5.0, "review": "Super easy to use and a very intuitive UX. The voice activation on the remote took a while to get used to but is very easy to use. I've recommended it to friends and will continue to do so.", "verified": true, "helpfulness": "0/0", "author": "CW"}, {"rating": 5.0, "review": "I love it!  Very affordable, easy to set up, and a lot of great features.  I purchased two of them, one for me and the other for the family recreation room.", "verified": true, "helpfulness": "0/0", "author": "RSH"}, {"rating": 5.0, "review": "We really like it! The kids enjoy the games!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Is this the death of the smart TV?We bought a smart TV several years ago and it's OK.  It came with MLB.TV preloaded.  I made sure of that before we bought it.  How else will a Tennessean keep up with his Red Sox?  It also had the best known apps on it including Amazon Prime, Netflix, and Hulu Plus.  But that was it.  There was no way to select and add more apps that you wanted.  Pretty dumb for a smart TV, eh?If you are thinking about buying a smart TV, don't.  Instead by the very best dumb TV you can afford...best picture quality and other bells and whistles you may want...but also get the Amazon Fire TV for less than $100.  Then you will have the smartest TV on the block and you'll feel pretty smart too.", "verified": true, "helpfulness": "0/0", "author": "A. Nonny Mouse \"Anonymous\""}, {"rating": 5.0, "review": "Wonderful product. finally we can watch Amazon Prime andour NETFLIX on our TV. This was easy to install and it works great. i highly reommend it. Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "PatriotEd"}, {"rating": 4.0, "review": "Why didn't sales rep tell me not to buy both Fire box and Fire Stick - as you can only access content with one TV at a time.  This is a major disappointment", "verified": true, "helpfulness": "0/0", "author": "Brent Hebert"}, {"rating": 2.0, "review": "No Vudu, We have way to many Vudu movies not to be able to use this. I regret buying it.", "verified": true, "helpfulness": "0/1", "author": "Hank3"}]