[{"rating": 5.0, "review": "I used to pull up Netflix or Pandora on my Roku, but since I've had the chromecast I haven't had to use the Roku at all so I gave it to a family member. Chromecast has amazing potential, I can't wait to see what it can do!", "verified": false, "helpfulness": "0/0", "author": "Dylan Pollard"}, {"rating": 5.0, "review": "Chromecast fills the Gap where Roku 3 is lacking.  I own a Roku 3 and love it.  However, I purchased Chromecast for one reason and one reason only.  I wanted to be able to go back and watch CBS Elementary full episodes 8-11 season 2 on my 46\" HDTV for FREE.  These episodes are not available on Netflix or Hulu.  But now that I have Chromecast I can use Google Chrome and cast them over WIFI.  So for me the $30 is very well spent.Chromecast is also a good investment because it's a Google product.  I expect in 2014 to see many more apps developed on the market for this device.", "verified": true, "helpfulness": "0/0", "author": "Mr Stark"}, {"rating": 5.0, "review": "My boyfriend has one of these and it is awesome! My sister had mentioned this and I told her all about it since my boyfriend has one and we use it all the time! It is so small and so easy to use! I LOVE IT!!! I bought this one for my sister for Christmas and I know she will love it just as much as me! It also it very affordable! Roku costs much more than this and even if you hate it (which you wont) $35 is nothing!!! (You will love it)", "verified": true, "helpfulness": "0/0", "author": "Anna Martens"}, {"rating": 5.0, "review": "We love the Google Chromecast and can't wait for google to augment some of its features. It has been steadily increasing the apps that work with its cast capability. When we first purchased it, only YouTube, Netflix, Hulu, and Pandora casted successfully. HBO Go and Google Play Music also work now! The Chrome browser does cast and allow for browsing, but video streaming does not quite work yet. This was our biggest disappointment and we have high hopes that Google will fix this!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Dunn"}, {"rating": 4.0, "review": "I bought this to use with my android phone, but it's not as useful as I thought. I pretty much solely use it for the youtube app since I don't have netflix or hulu. I would think Google would push out an update that allows me to stream my personal recorded pictures/videos onto the TV (like the way Apple TV works with iPhones), but it just doesn't have that functionality yet.Other than that, it works as it should. Great if you have Netflix, but not very useful for me since I can only stream Youtube.", "verified": true, "helpfulness": "0/0", "author": "Y. Zhou"}, {"rating": 4.0, "review": "It is a very good product for the money. Netflix works great and YouTube as well. Will recommend to others.", "verified": true, "helpfulness": "0/0", "author": "JH"}, {"rating": 3.0, "review": "This is probably just the first generation. Worth a try for the price and 3 months of neflix thrown in.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This chrome cast is only good at one thing, creating metadata for google to track..I am a major tech geek and after 2 hours of dealing with this thing I have yet to be able to stream local files.. \"I can see the replies now\" and that is because Chromecast is only meant to stream things like Netflix, Youtube, and other types of media services that you have to log into so they can track and profit from.There is a workaround for broadcasting files on your computer and even that is limited and requires you to install Google Chrome. So the problem for me being a Tech Geek is I spent a crap ton of cash for my Television that already does all of this without even getting of the couch or putting down the tv remote.Chromecast is such a massive disappointment and after the Youtube /Google Plus merger, I fully believe that Google should just take their narrow minded Nazi style business elsewhere! I will no longer purchase any device or service with Google behind it!!!!Do they really expect me to install Google Chrome on my computer just to use this crappy device, not a chance in hell. I will not let them stick Conduit on my computer. That thing is a beast to remove!!!!If you do not know what conduit is, I recommend never buying this device or expect to take your computer to the shop to have it repaired because it will slow it down massively.DO NOT BUY THIS DEVICE ------ It does not do a damn thing worth having!!! This is like buying a car with the most advanced handling in the world just to drive it on railroad tracks!", "verified": true, "helpfulness": "1/7", "author": "Famous Artist Music \"OneManArmy\""}, {"rating": 5.0, "review": "the picture over this wireless conenction is much better that the wired connection from my pc to the tv.  i love being able to control from a tablet anywhere in the house.  once some dev goes on, we'll have a real hot piece on our hands", "verified": true, "helpfulness": "0/1", "author": "B. Reese"}, {"rating": 1.0, "review": "The promise is great and some reviews rave about how easy it is to use.  I'll admit, setup was easy and it started streaming in very little time, however there are some major setbacks.  First of all I'm using this on a Core2Duo Sony Windows 7 Pro 64-bit laptop with 8GB of RAM which has no problem streaming HD video over the HDMI cabled connection which I do all the time.  The Chromecast seemed like the perfect way to avoid having a cable suspended across the living room --- wrong.  The video quality is high-definition-ish, but jumpy and jittery as well as being constantly out of sync with the audio with every video I tried.  I tried several different videos and sites (YouTube, NBC, LFDH, Netflix, etc.) to be sure it wasn't just one site that was having an issue, but it was all due to the Chromecast.  Whether it is the dongle, itself or the software, I don't know, but that's another issue.  You MUST use Google Chrome to stream to the Chromecast (hence the name, I suppose) and it can only stream from within that browser; it can't be used to stream PowerPoint presentations or anything outside the Chrome browser window which is disappointing.", "verified": false, "helpfulness": "0/2", "author": "Joseph R. Vining"}]