[{"rating": 5.0, "review": "This is a great little device; it does what is advertises. The sync (cast) to the I-Pad went smoothly, and I was able to watch Netflix right away. I only paid $30.00 on Amazon; very good deal.", "verified": true, "helpfulness": "0/0", "author": "Guy Evans"}, {"rating": 5.0, "review": "This thing rocks...we have cheap-o Direct TV that loves to kick out on us.  We just start casting from the Ipad, without getting up or fumbling with remotes, whenever this happens...it  is sweet!", "verified": true, "helpfulness": "0/0", "author": "(a)bioticdesign"}, {"rating": 1.0, "review": "I was sold on the TV commercials.  Gave it a shot, had it working, but then I stood there holding my iPhone in my living room asking myself what now?  What video do I have to broadcast?  Couldn't do anything with it, couldn't broadcast videos from my phone, needed to be an App or something that supported this puppy.I'll stick with watching my small screen.", "verified": true, "helpfulness": "0/4", "author": "R. Borman"}, {"rating": 4.0, "review": "Works really good but there's not many application for chromecast and I can't reproduce my pics and videos in the cell phone trougth the chromecast. :(", "verified": true, "helpfulness": "0/0", "author": "Jorge"}, {"rating": 3.0, "review": "Only work for youtube on iphone/ipad. Not so helpful especially if you want to watch other videos such as espn, etc.", "verified": true, "helpfulness": "0/0", "author": "Chess"}, {"rating": 4.0, "review": "This was easy to set-up, however I haven't used it as much as I anticipated. I initially purchased the Chromecast to watch Amazon Prime movies on my TV.  I discovered that the picture doesn't fit the entire tv screen when you maximize because you open a web browser rather than playing directly from an app. The video was delayed and \"froze\" a few times when I was chromecasting. I'm not sure if that was due to my internet connection speed or the device. For now, it's easier to watch Amazon Prime videos on my iPad or laptop. If you subscribe to netflix, huluplus or watch a lot of youtube, videos, you will love this device.", "verified": true, "helpfulness": "0/0", "author": "nzmarnz"}, {"rating": 5.0, "review": "I have Sony devices for streaming media.  I almost exclusively used these for streaming Netflix and YouTube and have been less than thrilled with the experience.  My Chromecast experience has been wonderful.  Definition has been top notch and love controlling from my iPad.  Hope that other apps will soon be \"castable\" but well worth the investment just for Netflix and YouTube.", "verified": true, "helpfulness": "0/0", "author": "Kennymac"}, {"rating": 5.0, "review": "I have a lot of streaming devices in my house. We mainly use XBMC which is installed on a Pivos and I have a few Raspberry Pis  set up.When the Chromecast came out I ordered one right away. I love this little device for when I am traveling and such. I am able to watch movies and such as long as the TV has a HDMI port. I also use it a home when I want to show pictures on the TV.As more and more apps become compatible I can see it being used more often.", "verified": true, "helpfulness": "0/0", "author": "Anthony P. Brown \"A.Brown\""}, {"rating": 5.0, "review": "great for casting youtube, hbo, netflix to your big screen and I believe it's the cheapest dongle out there, just needs more apps though.", "verified": true, "helpfulness": "0/0", "author": "Joshua Chang"}, {"rating": 5.0, "review": "love it easy to install and use.i can watch from my laptop or cell.great picture and sound would recommend to all", "verified": true, "helpfulness": "0/0", "author": "Dennis"}]