[{"rating": 5.0, "review": "I love this thing.  Purchased with Prime and SlingTV.  Prime music... yeah, bye Pandora.  I was so close to buying an AppleTV, and researched and waited, and waited some more.  Finally purchase 3 months of SlingTV and got $50 off Amazon Fire TV = SOLD.  If you're on the fence, you won't regret this purchase.  Prime, Fire TV, and SlingTV is a great entertainment combo for much less than cable.", "verified": true, "helpfulness": "0/0", "author": "Mike Mercil"}, {"rating": 5.0, "review": "The user interface on this device is polished and efficient.  It is also a complete beast when it comes to file handling and light gaming.  XBOX 360 and other wired controllers work out of the box with it as well.  very cool!", "verified": true, "helpfulness": "1/1", "author": "bearitphoto"}, {"rating": 1.0, "review": "doesn't work for me.", "verified": true, "helpfulness": "1/5", "author": "Robert Blum Sr."}, {"rating": 2.0, "review": "I don't think I can even adequately express how disappointed, frustrated, and sad I am.  This purchase is the biggest regret purchase I've had to date in my life.  As a single mom with limited income, I am careful about what I buy and do a lot of research first.  Sadly, the information I needed was not available when I researched.  :-(I bought this firstly because I am a Prime member and figured why keep paying netflix when there's so much to watch on Prime for free (well not free since I pay for Prime membership, but at least for no additional monthly fee).  I also read about this great Freetime thing for kids that I could set up so my little guy can only watch what I have approved--my one main complaint about netflix is that they don't allow parents to block content they don't want their kids watching.  So, with the better system for kids, I decided it was worth it...an improvement on what we were already doing (netflix).Unfortunately, Freetime is USELESS to me because it doesn't allow Prime Videos.  At least I think that's the case, I've searched all over the help and FAQ sections trying to figure out why I can't add videos to my son's Freetime account.  That's my best guess.  So, unable to use Freetime, one of the main reasons I purchased this, I decided to try letting my son pick from the watchlist, which I had loaded with lots of kids shows.  I had also downloaded some free games.  Unfortunately, the games combine play \"coins\" and real money purchases in ways I don't even follow, let alone my 4 year old.  So, after him purchasing some thing in a game that cost me real money, I  had to turn on the password system, which IDIOTICALLY doesn't have an option to only need entering before a purchase is made but must be set up so that before anything is purchased AND before every video is played, everybody has to enter a password.  I'll set my son up watching a kid show and go to do housework.  Every five minutes he's coming to me to enter the password because he wanted a new video or accidentally hit the back button or wanted to start the video over from the beginning or whatever.  It's completely annoying and makes the system useless for what I wanted...something my son could navigate to watch the kid shows I approve of for the amount of time I approve of every day without me having to hover over him the whole time.The device itself has trouble handling our internet speed and does not handle streaming quite as well as our Wii could stream netflix.  It's not awful, but it does have to pause from time to time.  It had an annoying announcement that it had trouble with our internet that used to pop up and send my son running to me, but I was able to at least turn that off.Being expected to pay $40 more for a game controller seems excessive to me, too.  (I mean, a Wii comes with controllers and the ability to play games and watch netflix and youtube with no extra cost.  There are free games--with no ingame purchases! and free shows and a game/show controller right in the box.)The device does not come with instructions or manuals, and the help sections and videos on amazon are a joke.  They say, do this, then this, then this, but have no explanation of how to do it or what to do if it doesn't work.  For instance, on freetime, it says to click Videos, then click to add the videos you want.  Simple, right?  Except I click \"Videos\" and get a blank screen.  How do I add videos?  What do I click?  Do I need to wait?  Is the screen blank because there's something else I need to do?  Is the screen blank because something is wrong with the device?  Do I need to randomly push all the buttons on the remote to make something happen?  What is going on?  If you have detailed questions like that or any problems, there's no answers and no help.Oh, but I've seen that you can BUY manuals for it.  That's ridiculous.  The information needed to use the device should come with the device.On the plus side, I like the styling of the remote and box and cord.The voice search feature is super-cool.  Playing around with it is fun.  I wouldn't pay $99 for a few minutes of playing with a voice search, though.I NEVER would have purchased this if I had known what I know now.  It doesn't work for us at all.  I wasted almost a hundred dollars on something that is nothing but a hassle.  It gets two stars for the cool styling and the cool voice search feature.", "verified": true, "helpfulness": "1/5", "author": "Andrea B."}, {"rating": 5.0, "review": "I love it.  I am able to catch up with all my season episodes that I have missed. Less ads that cable or satellite. I actually returned my dish equipment and supplies.  I just love it.... now I am setting up all my TVs up on amazon fire...", "verified": true, "helpfulness": "0/0", "author": "tammy s."}, {"rating": 4.0, "review": "The next generation of Fire TV should include an OTA tuner and an optional USB External HDD used as a DVR. Now you’ve got the complete cord cutting device. Seamless integration with Echo would be nice too.", "verified": false, "helpfulness": "0/0", "author": "Mark L Wingrove"}, {"rating": 2.0, "review": "The idea is ahead of the technology for amazon. I bundled this slide TV and love all things amazon so I opted for the fire TV  over other streaming providers. For some reason for the second I hooked it up it has issues staying connected the WiFi at my house even though the router is literally 2 ft away. So I decided to get the roku stick to see if it was my WiFi or just the fire TV. Well long story short roku stick streams great and has 0 lag and has yet to buffer mid movie\\show. Roku stick is on the opposite side of the house btw and works great. I'm now sending the fire TV back for the roku3.", "verified": true, "helpfulness": "1/4", "author": "Michael Overton"}, {"rating": 4.0, "review": "NEED volume control on the remote to control tv and soundbars...I feel like I went back 10yrs on technology by the absence of this. Back to 2 remotes I guess. I know people will say just get a universal but it defeats the purpose when they have cool features like voice search", "verified": true, "helpfulness": "0/2", "author": "Steve H."}, {"rating": 5.0, "review": "Wasn't sure if it would meet my expectation. Exceeded my expectation by a long shot. Love this little black box.", "verified": true, "helpfulness": "0/1", "author": "Willieetta Robinson"}, {"rating": 5.0, "review": "Best device I've owned for streaming movies etc. I definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Yawn"}]