[{"rating": 4.0, "review": "more news channels are needed, of course this is a personal preference but i like to watch news more so than reading about it online", "verified": true, "helpfulness": "0/0", "author": "A. Garcia"}, {"rating": 5.0, "review": "Wonderful product.  It works great", "verified": true, "helpfulness": "0/0", "author": "RLM"}, {"rating": 5.0, "review": "I love this remote.its very comfortable to hold and very easy to control..Thanks.lets see how long it survives.my previous one was roku3 but failed to signal in 8 months. so i got this one to try.", "verified": true, "helpfulness": "0/0", "author": "Unnamed"}, {"rating": 4.0, "review": "Much nicer than using my smart tv!  My tv would lose internet connectivity mid program or would stop and buffer; fire tv has no problems and it starts quickly. The voice search is nice and works well. I recommend fire tv to anyone who needs a streaming device. My only complaint is I wish more apps were available.", "verified": true, "helpfulness": "0/0", "author": "L. Sokoll"}, {"rating": 2.0, "review": "I love the Fire TV. Bought it as a replacement for the Yahoo Apps on my Vizio Smart TV. They were just tedious to search through and for $100 I can get a gaming stations too.We have been enjoying the heck out of our Fire TV, except that when we play a movie or TV show, about every 20-30 minutes the TV comes up blank and the Vizio says \"No Signal\" then a few seconds later, the Video we were watching comes up paused. We hit the play button and it continues. It is almost like there is a built in screen saver that times out the signal. I would say this is a Vizio thing, except it has worked fine with other streaming boxes.I googled the heck out of my problem and see nothing posted. I'd love to get it fixed, then this would be a 5-star for sure!", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This device (unlike the dongle version) is fantastic. Quick boot up, great functionality and excellent picture quality.", "verified": true, "helpfulness": "0/0", "author": "Daniel R Leclerc"}, {"rating": 5.0, "review": "we love it", "verified": true, "helpfulness": "0/0", "author": "mike grosschmidt"}, {"rating": 5.0, "review": "great system mneeds more of the classics", "verified": true, "helpfulness": "0/0", "author": "ESV09"}, {"rating": 5.0, "review": "Excellent product. Love the voice command search option.", "verified": true, "helpfulness": "0/0", "author": "Rosie"}, {"rating": 1.0, "review": "I wish I could give it zero stars. No way to search for \"free movies and TV\" I paid for with a Prime membership. Amazon dropped the ball on this one!", "verified": true, "helpfulness": "1/5", "author": "Robert Healey"}]