[{"rating": 3.0, "review": "Doesn't work well with IBM compatible laptop!  Other than the incompatibility issue, it's great!", "verified": true, "helpfulness": "0/0", "author": "Ghost Man"}, {"rating": 1.0, "review": "COMPREI DUAS UNIDADES E RECEBI APENAS UMA", "verified": true, "helpfulness": "0/2", "author": "Agenor"}, {"rating": 3.0, "review": "the unit had intermediate survice.", "verified": true, "helpfulness": "0/1", "author": "John D Naden"}, {"rating": 5.0, "review": "I live in the country and can only get fm internet which is low speed. The chromecast slows the movie speed to match our internet speed so we can view it with out  a lot of loading interruptions and sometimes no interruptions.", "verified": true, "helpfulness": "1/1", "author": "Roy moulder"}, {"rating": 2.0, "review": "Lots of issues casting from my *GOOGLE* nexus 7. Not living up to google expectations. Particular problems with watch-espn app.", "verified": true, "helpfulness": "0/0", "author": "MMI"}, {"rating": 5.0, "review": "Its just awesome !", "verified": true, "helpfulness": "0/0", "author": "Abdullah Mannan"}, {"rating": 2.0, "review": "Two issues with this device make me give it a poor review:1) cannot be used in a hotelThis is because most hotels use security systems that will not let you set it up.  I've run into this at many hotels.  Once they had a tech support department that was helpful and manually added the MAC address in their system and then I could use it.  But that's beyond most hotel's tech support departments2) when I did get it to work, it did not stream all the sites I wanted to stream.  Maybe they'll fix this and include more sites, but don't assume you can use a chromecast to stream any video you want - you cannot.", "verified": false, "helpfulness": "0/2", "author": "Mark in Houston"}, {"rating": 5.0, "review": "Great purchase! I love being able to watch Netflix on the tv!", "verified": true, "helpfulness": "0/0", "author": "Christina M Davis"}, {"rating": 3.0, "review": "had issues with multipal sources had to reset a couple of times but seems to be working now...i would recomend with the advisory that there may be issues but depending on your tech savy you may be able to resolve with little effort...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I am really disappointed that you would sell a device without good instructions. It is rather a bate and switch when you now have to buy a book too to learn how to use the thing and what it can do.", "verified": true, "helpfulness": "0/0", "author": "Terry S. Johnson"}]