[{"rating": 2.0, "review": "I thought this would be something great, but i guess im wrong.  If you already have a PlayStation or Apple TV then what is the benefit of this device?  I dont use NetFlix and if i did i would use it on my PS3, or even my TV (it has the app built in).Once you plug the dongle in the TV you MUST also plug the other end into USB or DC power.  I was under the impression you could just put it on the back of your TV.  Many of my TV's are new and none of them have a USB port on back so the only option was to run the separate power cable.So now i can beam YouTube over to my TV set, well, yay i guess, if i really want to see YouTube content, for that I typically just sit on my computer.I guess this would be great for a dorm room or tiny one bedroom apartment or someone with no cable etc... but for the average user with a computer and other media devices like Apple TV or PS3 i don't see the use for this.I guess if i had a video of some sort on my device that i wanted to send to my TV instead of just showing the person directly i could do that but ive never had the need to do that.I dunno, i used it once tonight when i got it, probably won't use it again.  Good thing its so cheaply priced or i would probably return it.", "verified": true, "helpfulness": "0/6", "author": "Tommy"}, {"rating": 3.0, "review": "I bought this for one reason and that's to access my Google Play movies on the big screen. It does a good job but i don't get the same quality picture as i would if viewing through my PS3 or Roku. Setup was super easy. would i recommend this device...yes and no. For $35 it's perfect. But chances are you probably own a XBOX or PS3 and they have netflix and youtube available on them, with better layouts. Netflix comes on everything already. Google Play is the only app that's not already out there other than on your computer.  So is Google play worth $35 to you? That's the question!", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Well it is interesting. The power adapter looks exactly like the one for my phone. Which I kind of neat. I guess if I loose one I should be able to use the other but I have it plugged into the usb port on my blueray player. Which works fine. When I stream from my computer the audio does not go through my surround sound but when I stream through my ipad it does. Which I find extremely odd. Before I tried the ipad I thought my surround sound was not even working. I kept turning up the volume until I decided to try switching the tv to the Dish hopper. The sound was so loud I had to quickly switch back and keep trying down the volume. After that is when I tried the ipad and the chromecast was able to send the audio through the surround sound. I then went back to the computer and again no audio through the surround sound. No matter if I tried a youtube video or a netflix video or even a amazon prime video with silver light uninstalled. It does work though. I would just love it to work through the surround sound when using the computer with it.", "verified": true, "helpfulness": "3/4", "author": "bunny \"e3mr\""}, {"rating": 2.0, "review": "The limitations in what you can actually stream, even though this claims it can stream anything in a tab.. is very disappointing.Why no Amazon Instant Video?  That is a fair assumption that I should be able to watch any video I can see in a Chrome Browser, cast to my tv.Is this ridiculous turf battles? or is the tech just not up to snuff?thanks for opening my eyes to streaming dongles, but Chromecast is certainly not going to last in my house.", "verified": true, "helpfulness": "1/5", "author": "Luciana M. Galindo"}, {"rating": 4.0, "review": "I have set this connected to the TV in the main room of my condo for my roommates and I to use. It's a great low-profile, cheap way to make any TV a \"smart\" TV. If you've ever used the PS3's versions of Youtube or Netflix apps, they are essentially identical. The advantage the Chromecast has over other settop boxes is that it's always on and listening for requests to play videos. So as long as you have it plugged in (via USB to your TV or via wall adapter), your mobile device will detect and connect to the dongle.Google has cleverly used HDMI-CEC to allow the Chromecast to turn on and switch input so as soon as you select a video to play, it is on your screen. It's difficult to understate the difference this makes for your streaming experience. With the PS3/XBox, you have to turn on the box, turn on the TV, sign in, open the netflix app, and pick the video to play. With Chromecast you just open the app, select the video, and set it to play on your TV.The value of this device is greatly increased if you're a subscriber to Google Play Music All Access, which I am. Then you can also sling any song on the subscription service to play on your TV's speakers. Eventually, more services will pop up, like Pandora, Hulu+, Revision3, Vimeo, and hopefully Spotify. Right now Google is stubbornly sitting on its hands and refusing to open access to the final Chromecast API, holding all of these apps back.There are some downsides. There is another streaming option that allows you to mirror the content of any Chrome tab on your screen, including any websites with flash or HTML5 content (legal or not ;) ). I hoped this would enable me to watch more...grey area content on my TV, but unfortunately the Chrome extension is still very beta. Quality is not the greatest even at the highest settings. Connecting a PC to your TV via HDMI is still better in this case.The dongle itself doesn't have the greatest wifi reception either. When I first plugged it in it was behind the TV and was not able to connect, but I moved it to a side HDMI port and used the included extender to get it to peek around the side of the TV, which solved the problem. Your mileage may vary.Overall, at this price it is an instinct buy IMO. When the Chromecast API opens more developers will enable their apps to use the service and it will quickly surpass game consoles as a streaming solution.", "verified": true, "helpfulness": "3/3", "author": "Dan The Man"}, {"rating": 5.0, "review": "The Chromecast is easily the best bang for the buck when it comes to home entertainment.  There are only a few apps at this time that work with the Chromcast but they work flawlessly and when more apps come out this is going to be, hands down, the device to go to.  Setup is dummy proof and involves plugging it in to your open HDMI port (they even include an extention dongle if your confines are a bit tight), downloading an app and setting it up.  The app auto-recognizes the Chromecast and you follow the prompts.  2 minutes later you are flawlessly streaming Netflix, YouTube, or Google Play music or movies.The Chromecast has proven itself to be reliable and is instantly on whenever I fire up the TV.  It sends HD quality streaming to the screen and looks fantastic on a 65\" LED TV and it also sends 5.1 digital sound to my receiver.  Really the only thing that you can ask for are more apps but Google has released the SDK (software development kit) out to app devs in beta and once they finalize it get ready for an onslaught of compatible apps.  For $35 I am willing to wait a bit for that.", "verified": true, "helpfulness": "3/4", "author": "nrcooled"}, {"rating": 1.0, "review": "Google limited the usability.  I got it today and returning it.  Don't waste your time at present.  Let google make more app or let others to make app that work.", "verified": true, "helpfulness": "2/9", "author": "John Samuel \"Punalur Man\""}, {"rating": 4.0, "review": "Not a lot of content available. I don't have netflix and they haven't signed up anyone yet. I'd say don't expect ROKU performance or features. I'm hoping more becomes available before i throw it in a drawer and buy the new ROKU.", "verified": true, "helpfulness": "0/0", "author": "J. Owens"}, {"rating": 5.0, "review": "Streaming from my android device is a breeze and the quality of the video is pretty good. The setup is relatively easy and takes only a little time. I think google scored on this one.", "verified": true, "helpfulness": "0/0", "author": "Shibu M. Lekshman"}, {"rating": 3.0, "review": "I purchased one early on - but have not found the content I expected on Netflix or Hulu.  I was pleased (for a day) when a third party product allowed me to stream from own computer - alas, Google shut that off quickly.  Still waiting for additional providers - still not there.  With Amazon selling the product, I can only hope that they will allow their video content to be streamed to the Chromecast.", "verified": false, "helpfulness": "1/2", "author": "Upstate New York Reader"}]