[{"rating": 1.0, "review": "How the item is presented vs. how it actually functions is contradictory. It currently does not use the Google Chrome browser to play any media. It currently only recognizes media from a handful of sources, Netflix being the only 'mainstream' site. Even at that, it appears to load the media, but then 'hangs' not letting you actually play the media. I have not totally given up on it, but will need to call tech support again to get this sorted out.", "verified": true, "helpfulness": "0/0", "author": "annette85"}, {"rating": 2.0, "review": "I faithfully followed the installation instructions contained in the box, so it was installed correctly.I connected to my HuluPlus account and within five minutes the variance between the video and the audio was intolerable.  It DID run my computer screen on the TV and when I minimized the computer view, the variance in video and audio became even more marked.  When I attempted to close the Chrome window and use the computer on IE, the Hulu conection with the TV also closed, so the computer HAS to remain on to control the TV presentation.  Had I been on my laptop, the TV presentation could have been only as long as my battery life.  It in NO WAY operates independent of the controlling computer.All that said, my Dell XPS Gen4 was already more capable than the capabilitiess afforded by the ChromeCast device when cabled to the TV via an HDMI/DVI connection and I can minimize the computer display without affecting the quality of the TV display in order to do something else on the computer.  The only thing that the ChromeCast added to the mix was audio from the TV, not the computer speakers.  My $160 video card has an HDMI output that I don't normally use because it has to be switched to (and switched back in order to view computer functions on a standard VGA monitor), so if I want HDMI to the TV, I already had it prior to the ChromeCast purchase.Anybody wanna buy a ChromeCast adapter with six hours use on it?  $35 plus shipping.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased the Chromecast streaming media player because I use a lot of streaming media in my household and it is been wonderful. Netflix, YouTube, Google Play and radio work almost flawlessly with this device. It was easy to set up it works with my laptop, iPad and an Android device. I would recommend it for anybody who uses this type of media.", "verified": true, "helpfulness": "0/0", "author": "Tom Reese"}, {"rating": 5.0, "review": "Playing any online videos right up on the big screen whats not to love. Does require usb access on the Tv or thought the provided power plug. 2 thumbs up!", "verified": true, "helpfulness": "0/0", "author": "Cody Bisping"}, {"rating": 3.0, "review": "It works great but I wish it worked with more apps.  I only use Netflix right now.  Maybe Google should have a \"How to.../What's new...\" channel on their Google search engine.", "verified": true, "helpfulness": "0/0", "author": "Morton Graham"}, {"rating": 5.0, "review": "I've used my Chromecast for a month now and have had no problems at all. The setup was simple. I chose to use the usb port on my tv for the required power, but if you use the transformer to power it and your TV senses activity it will also turn on your TV for you. Since I use the TV power I can't do that. I just chose not to have yet another transformer eating power. I use it with Netflix and occasionally YouTube controlling it from my Nexus 7 tablet. It can also be controlled from your phone or your computer. Since it uses your in-house wi-fi, any of your devices using the same wi-fi can control it.It is a very inexpensive streaming controller that does not require any space except your HDMI port. There is no battery drain on your input device since whatever is being viewed does NOT come through your device. It comes through your wi-fi and directly to the chromecast. Once started you can power off your device with no negative impact on your viewing. I'll probably be buying another for my bedroom tv. As you actually name each installation, multiple Chromecasts will not be an issue. Definitely a good buy.,", "verified": true, "helpfulness": "0/0", "author": "H Oas"}, {"rating": 3.0, "review": "I know it is early still, and the price makes it hard to argue, but... my chromecast constantly makes me work to connect to the wifi, retrying over and over again each use until it finally finds it. Also, limited uses and browser streaming of video is terrible. But, it does what it does mostly well (streaming of approved content), however what it does is still limited.", "verified": true, "helpfulness": "0/0", "author": "Charles Watson"}, {"rating": 3.0, "review": "got it for Christmas. Only used it two times so far, because we have roku 3. Tried it once and Prime movies Amazon said it did not support it. Not sure why, since it was opened on Chrome. So we were a little disappointed. It's really good for working or searching net if that's what you do and you need to see it bigger on your TV (we have 60\")...but we don't much. I think we'll use it more in the future. But other websites worked fine.", "verified": true, "helpfulness": "0/1", "author": "Lenka Kooch"}, {"rating": 5.0, "review": "I've had this for a couple months now and I use it quite frequently.  I plugged it into my surround sound and plugged the USB charger that it comes with into the back of my TV.  All I have to do is switch the input on my TV to the chromecast device and it works without much effort.  I have the app installed on my Galaxy, iPad, and iPhone and they all work with no issues.  I've used it to play Pandora for a few parties and loved it.", "verified": true, "helpfulness": "0/0", "author": "Jonathan F"}, {"rating": 3.0, "review": "Had a hard time getting this to work in the way it was supposed to.  Price was right, but the access limited, for me, only to Netflix.  Like my Roku much, much better, so should have bought another one of those.", "verified": true, "helpfulness": "1/2", "author": "Kolya"}]