[{"rating": 5.0, "review": "I have it on my daughter's non-intelligent TV, She loves being able to watch netflix- I hope it evolves with more apps", "verified": true, "helpfulness": "0/0", "author": "Gclan \"Dali\""}, {"rating": 4.0, "review": "Works great and does what I need it to. I got this primarily to watch Netflix and HBO Go on my TV. Unfortunately you can't cast Amazon Prime so I'll probably cancel my Prime membership once it is up unless they start cooperating with Google. I already bought this, not going to buy their casting device too. You can't watch video you purchased from Amazon either. So buy your videos through the Play store, Vudu, Flixster or Ultraviolet. Pretty much anywhere but Amazon. New apps are added all the time and you can even cast your phone/tablet screen to your TV.", "verified": true, "helpfulness": "0/0", "author": "Stacey A Klempner"}, {"rating": 5.0, "review": "Especially since it has added HBOGO. Its awesome to have with you when your traveling as well. The web browser is still in beta and definitely has some kinks to work out, but the apps on this bad boy work perfect. For 35 bucks, you would be insane not to buy this.", "verified": true, "helpfulness": "0/0", "author": "Jediwithoutacause"}, {"rating": 4.0, "review": "You can also stream your full PC screen to TV, including PPT, movies, etc. Just need to install the Chrome plug in and connect the \"beta\" screen cast feature.", "verified": true, "helpfulness": "0/0", "author": "LC Franco \"Luis Franco\""}, {"rating": 5.0, "review": "The chromecast works great. I finally have a use for my tv. Chromecast works fine with Android, Mac, and Chromebook.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Before you get this .. check and MAKE SURE it works on your TV. I have a relatively new vizio and it wouldn't work. I was told to call them and ask for a firmware update. Of course the TV I have doesn't have one. So it doesn't work on the TV we needed it to :( But it's a great product! Just check to make sure it will work on your style number first!", "verified": true, "helpfulness": "0/1", "author": "Stacy"}, {"rating": 5.0, "review": "Turns your TV into a smart TV.  Have been using this product for 6 months, and have had no problems.  Works great with Netflix, Hulu, and YouTube.  I really like the ability to make a YouTube playlist, sit back, and enjoy the videos!", "verified": true, "helpfulness": "0/0", "author": "Doscher"}, {"rating": 1.0, "review": "The device quit working after couple of months.  We try to troubleshoot and follow Google Chromecast help online and no positive results.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Why choose this over other streaming products? Price, features, and portability.It is easy to move to other tvs, and streaming is very simple off both android and iOS smartphones. No clunky remote required! Use your more intuitive touch screen smartphone instead!Until a Chrome box comes out with as much ease of use, a low price, and lets you load your entire Play Store library and games onto it, this is the streaming device to get.", "verified": true, "helpfulness": "0/0", "author": "Vincent Cherubino - Bhazard"}, {"rating": 5.0, "review": "I've had a Sony WiFi box for a couple of years and it was very reliable for watching Netflix Streaming until about 6 or 7 months ago, then there was constant stopping and buffering to the point that I called Netflix to see if anyone could explain to me why Amazon Prime streaming was 30 times faster than Netflix streaming.  The customer service representative told me it must be my equipment, but couldn't explain why my equipment worked just fine for Amazon Prime streaming.  I had read that Comcast and a couple of other companies were throttling back the streaming speeds unless they were paid a very large fee for the extra speed and that Netflix had refused to pay it.  I've read since that Netflix developed their own system...it still doesn't stream well through my Sony WiFi box.An Internet friend posted on Facebook that her computer whiz son had told her of the Google Chromecast device.  On her testimony that the Chromecast device solved her Netflix streaming problems, I purchased one.  The good news--it works great!!!It does not have it's own tuner or remote control, but rather, a smart phone or tablet with the Chromecast app. and the Netflix app. is used as the tuner and remote control.  Once the program is chosen (i.e. Netflix, YouTube, etc.) the device you use to select the programing can be used for other apps or turned off for that matter and the program continues to play on your television without using your phone data or battery.Setup is easy!  I have not experienced any occasion of loss of streaming or slow up from buffering other than the initial buffering of about 3-5 seconds.", "verified": true, "helpfulness": "0/0", "author": "William L. Benedict"}]