[{"rating": 5.0, "review": "So far I love my Chromecast.I think once 3rd party developers are able to create apps for the device, it will really take off.", "verified": true, "helpfulness": "0/0", "author": "Bekah Eavenson"}, {"rating": 2.0, "review": "I was expecting a more powerful gadget. It doesn't allow to display most of the apps from iPad including the own chrome.", "verified": true, "helpfulness": "0/0", "author": "Julio Syrio"}, {"rating": 5.0, "review": "As I said, It does what it says it does but unfortunately people judge it by what they want it to do.First off, for the price nothing comes close to delivering what this does. It is now up to 10+ supported apps, but to be clear this device streams the content from the internet (not from your phone), so if your looking for screen mirroring from your phone its not there (atleast not yet). What buyers should also be aware of is that some of the apps it streams from require a subscription to work.Setup was quick, plug it in download the app and basicly hit next a couple of times. Launch your supporting app from your phone and then just hit the chromecast button.So far I've tested it with Pandora, Netflix, You tube and Google Music all of which worked flawlessly. But there was a snag with tabcasting, I was under the impression that you can open the tab from any chrome browser but it appears you can do so from the Android Chrome version.", "verified": false, "helpfulness": "0/0", "author": "Calvin"}, {"rating": 5.0, "review": "I got the Chromecast because it offers HDMI Streaming of media between an android device and my HDMI TV but, I quickly found out that only specific applications will allow you to stream.  The Amazon Kindle Fire HD which is based on a proprietary Android OS, does not allow you to stream videos from your PRIME account over the chromecast device.I would hope that Amazon considers jumping on the support band wagon so that this device is also supported on their applications.Other applications that were downloaded to the Kindle though alternative means do work such as the YouTube app, and HBO GO app work well.", "verified": true, "helpfulness": "0/0", "author": "MrWildStarr"}, {"rating": 5.0, "review": "I was able to redirect from multiple sources without any problems. So easy that now my kids even do this...", "verified": true, "helpfulness": "0/0", "author": "Dilip"}, {"rating": 5.0, "review": "Nice concept. It works as expected. Able to stream you tube, Netflix and Chrome browser from my Tablet and Phone.The only thing which can be improved is an app or ability to Stream my Local computer Videos.", "verified": true, "helpfulness": "0/0", "author": "Imran I. Khan"}, {"rating": 5.0, "review": "My husband love the Google Chromecast! He can control the TV from his phone.... turn it on and off, control the volume, select shows. Great buy!", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "ok so I have owned Boxee, Roku, XBMC , apple TV , heck i even have a raspberry Pi with a media center on it. But chromecast has met all expectation. It is small, easy to carry and I have been playing my friends video through plex anywhere I want. It doesnt have the baggage of creating another system for you to look at, which is awesome.browser cast can definitely improve. I am looking for a way to display the complete device screen ( let it be phone or tablet or computer), that will kill all competition whatsoever", "verified": true, "helpfulness": "0/0", "author": "Abdullah choudhury"}, {"rating": 5.0, "review": "Awesome product liked it very much, Of good use to me will recommend the same to my friends as well", "verified": true, "helpfulness": "0/0", "author": "Senthilkumar Balakrishnan"}, {"rating": 5.0, "review": "They need more apps, but they'll come. It works great for Hulu, Netflix, etc. I just wish there was a player that played from a network drive and casted. Android's default player casts fine but doesn't stream from a network source. Once that's possible (likely through another player that uses Chromecast that some other developer will need to build, I don't think Google will), then this thing will be a big time win and replacement for HTPCs.", "verified": true, "helpfulness": "0/0", "author": "T"}]