[{"rating": 4.0, "review": "Very easy to setup and use. Though, I wished Google would get on the ball and fix some of the bugs. Casting from PC to this just isn't worth it. The video quality is horrible. Also, I don't like that the only way to cast to the Chormecast is via WiFi. I can't cast from a PC that's on CAT5. If casting from an Android devise, it works perfectly. I took one star because of the bug, and WiFi limitation isn't that big of a deal to me. Maybe all of this will be fixed through a patch or something.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Gift for my boyfriend and after learning how to work it, a definite plus to the television experience.", "verified": true, "helpfulness": "0/0", "author": "Danielle A"}, {"rating": 2.0, "review": "I don't know how good it works.  I couldn't get it to connect to my wi-fi.  I could set it up but my router was not compatible.  Do yourself a big favor.  Go to google support for chromecast and see if your existing router is compatible.  It will save you a lot of headaches.", "verified": true, "helpfulness": "2/2", "author": "cheryl ansel"}, {"rating": 2.0, "review": "I can't get it to work, but that could my fault", "verified": true, "helpfulness": "0/0", "author": "Rene Carter"}, {"rating": 5.0, "review": "This is my third Chrome, I've bought the previous two for me and this is a gift. So far I've find it super easy to use, haven't had any problems of connectivity, the image and sound are great, very easy to use and plug. For the price and the functionality I doubt you can find a better deal.", "verified": true, "helpfulness": "0/0", "author": "Luis Ocaranza"}, {"rating": 5.0, "review": "very satisfied with the product, price, service and timing", "verified": true, "helpfulness": "0/0", "author": "Ros \"rosrod@improco.com\""}, {"rating": 5.0, "review": "Perfect for it purposes.", "verified": true, "helpfulness": "0/0", "author": "Chapisco"}, {"rating": 5.0, "review": "I love Chromecast!! Saved my TV watching life!", "verified": true, "helpfulness": "0/0", "author": "Allison"}, {"rating": 5.0, "review": "Love this product.  Easy directions download the app and cast your shows on tv.  I also bought all cast that lets you cast just about anything on the device.", "verified": true, "helpfulness": "0/0", "author": "Vishal Singh"}, {"rating": 5.0, "review": "Works perfectly and was the right price.", "verified": true, "helpfulness": "0/0", "author": "Matt Bailey"}]