[{"rating": 5.0, "review": "I really recommend you get one of these neat devices, there's so freaking amazing one of the major pluses is that it let's you cast videos over your devices but one of the things that they need to update it with is you can watch videos and pictures through your Google drive!! but other magnificent", "verified": true, "helpfulness": "0/0", "author": "Jose Bahena"}, {"rating": 4.0, "review": "Another great idea by Google and it is really affordable. However, there are not many apps for this device yet and hopefully in the near future that will change.", "verified": true, "helpfulness": "0/0", "author": "mch1brg"}, {"rating": 5.0, "review": "When I first heard about Chromecast, I sarcastically said \"So it's an incredibly complicated remote?\" I have happily eaten my words, and I'm smitten. My phone, which I already have in my hand most of the time, can select a show and play it while my other hand holds my newborn or keeps one of my toddlers from getting into something. I love it, and can't wait for more apps to be supported, like Google+.", "verified": true, "helpfulness": "0/0", "author": "Jennifer S."}, {"rating": 2.0, "review": "I got to try out Comcast today. Let me start with that I have HTPC and I also own Asus Wicast (wireless HDMI)It seems that installation could be much easier, since it does not have user interface you don't get many error messages if something goes wrong.  One of my cellphones was not able to connect, it just stuck on connecting. Second cellphone actually gave me an error saying to check router. I checked router to make sure it's compatible with Chromecast, and it is. After configuring my router, for another 20 minutes, it actually connected after 5th try.I could not play all youtube videos, some of them were giving me an errors.I tried mirroring Chrome on my Laptop and latency was about 2 seconds. Asus Wicast has almost no latency between screens, you can even play some games with it.Range could be better as well. Also if you don't have router somewhere not far away from TV I would recommend you to move it somewhere closer to it.Bottom line is IT NEEDS WORK, lots of work. Since I already bought it, I'm not going to return it, but I would recommend rest of you to wait for a few more months,  since most features are still in beta testing and there are many bugs present.", "verified": false, "helpfulness": "0/0", "author": "Roman"}, {"rating": 4.0, "review": "First, I really do like the Chromecast Streaming Media Player. It has allowed me to watch movies from Netflix from my tablet (Samsung Galaxy Tab 2 7.0) onto my television, and for $29 you couldn't ask for more. Sure Apple TV and the others are \"better\" because they are compatible with more apps but for me, I wasn't looking for \"bells and whistles\" just something to make it more enjoyable to watch movies from Netflix. This little piece of technology certainly does that. The set up was easy, had to down load Chrome unto my lab top first, from there I think it was a total of may be 10 to 15 minutes for the complete set up. Once set up was complete, I opened the Netflix app on my tablet, started the movie/show/documentary that I wanted to watch, clicked on the cast icon and the video started playing onto my television. The only draw back and the reason for four stars is that it takes me two to three tries to get the video to start playing onto my television. By that I mean that I have to hit the \"back\" arrow on my tablet and then hit the \"play\" button on the video before the video loads and starts to stream onto the television (have to do this a couple of times) could be because of the Wi-fi connection. But once it starts to stream, just sit back, relax and enjoy the show. You can control the video (start, stop, pause, play, volume)  from the tablet and it if the video is in high definition, it will stream as such. Is it better than a $100 or more unit? yes. Is it as good as one that cost $100 or more, no; but it does what it is designed to do and nothing more. From what I read about the Chromecast, it is still a work in progress and I am sure that it will only get better. I am very satisfied with my purchase and will get another for my second television.", "verified": true, "helpfulness": "0/0", "author": "Joshua M. Schmidt"}, {"rating": 5.0, "review": "Works as described , hook up was fast and simple , have not had any problems since I installed it", "verified": true, "helpfulness": "0/0", "author": "John M. Praskey \"johnp3350\""}, {"rating": 4.0, "review": "I bought it for a friend to use on her tv. She loved it, took less than 10 minutes to plug in and setup on her wireless. Wished it works with amazon prime instant app.", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 1.0, "review": "Google continues to advertise that with the Chromecast  you can:\"With Chromecast, you can easily enjoy your favorite online entertainment on your HDTV--movies, TV shows, music, and more\".\"Browse for what to watch, control playback, and adjust volume using your device. You won't have to learn anything new\".That is blatantly a lie and fraudulent. I cannot watch Amazon Instant Video. I cannot watch websites that stream video online but that are not in the short list of what is available for Chromecast.You also cannot Browse the internet. You cannot use Firefox, Chrome or Internet Explorer. Yet all the hype surrounding Chromecast led me to believe I could. Read the hype and you will be inclined to believe the same. I really did not expect Google to be this deceptive with its advertising.If you only want Hulu or Netflix or Youtube then great device and cheap but I don't use any of them, I use Amazon for Streaming and this doesn't work with Amazon. I also hoped that I could watch a few of the websites that stream only online but I cannot. Sure there are all kinds of workarounds and other software but that is not what I expected to have to do.I am returning the Chromecast and really disappointed with Google, did not expect this kind of overhype from them.", "verified": false, "helpfulness": "4/5", "author": "S. A. ROBBINS \"shirley_rw\""}, {"rating": 5.0, "review": "This is worth every penny best way to turn my tv into a smart tv. its easy and so simple to use a MUST BUY.", "verified": true, "helpfulness": "0/0", "author": "Brennan"}, {"rating": 1.0, "review": "This product could be great however the difficulty of getting it into a secure networking environment is not worth the hassle. I'm not a super networking guy, but my skill set is slightly above average.It would not connect to an ATT Uverse modem no matter how many settings I changed, it could not get through the firewall. Once I connected it to my Linksys router (unsecured guest network), it would work, however it will not link to a non broadcasting SSID. You also have to enable multicast with no wireless isolation, etc etc etc....Bought a Roku, connected it to the non broadcasting network SSID and BAM! Done!.....Much more mature, easy product to configure, easy to use and gets prime amazon along with 700+ channels. Only bad Roku input so far is user interface kind of stinks, but its tolerable.Goodbye cable company! Hello Roku!", "verified": true, "helpfulness": "1/2", "author": "Nugget"}]