[{"rating": 5.0, "review": "Chromecast is awesome. I ditched cable for good a couple of years ago before Chromecast came out, and that was fine, but Chromecast has really made my life even more awesome. Works beautifully, easy to set up, no problems so far.", "verified": true, "helpfulness": "0/0", "author": "Vanessa"}, {"rating": 5.0, "review": "It is a smart easy-setup gadget.Performance is awesome. Either using native apps ou casting from a chrome browser tab.I liked specially YouTube and Netflix apps and how the local application on iPhone in my case, turns just into a remote control", "verified": true, "helpfulness": "0/0", "author": "Murilo Alves"}, {"rating": 5.0, "review": "It works like its supposed to, Easy to install, i wouldnt even say install more like plug in, its perfect", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "I use hulu plus and netflix for my television sources and avoid the costs of cable. This is perfect. I can choose programming on my phone or laptop and watch it on a regular sized television. It's awesome.", "verified": true, "helpfulness": "0/0", "author": "SmilinJenE \"SmilinJenE\""}, {"rating": 5.0, "review": "Love my google chrome. It's a good thing I got two of them. I haven't stopped using them. Needs more compatible apps though. That don't matter cause eventually there will be. If u do t got one you need one cause they are very affordable and great other products are $100's and are used for the same purpose. Highly recommended for anyone.", "verified": true, "helpfulness": "0/0", "author": "Candelario Martinez"}, {"rating": 5.0, "review": "The fastest way to make a non smart tv into a smart tv... I use my Nexus 7 to control it and stream Netflix and Pandora to it all the time...", "verified": true, "helpfulness": "0/0", "author": "DKH \"dhom81\""}, {"rating": 5.0, "review": "This is a great alternative to a Roku or Apple TV.  It's so inexpensive but incredibly functional.  Amazing quality and service!", "verified": true, "helpfulness": "0/0", "author": "TA"}, {"rating": 2.0, "review": "The support is still limited and in my house - potentially due to wireless coverage - the resolution was not 1080p; made for a poor viewing experience.  But this has promise.", "verified": true, "helpfulness": "1/2", "author": "Sunil Bhargava"}, {"rating": 4.0, "review": "This little devise is amazing. Now we can watch movies on our RV TV screen anytime we can get wifi in campground.", "verified": true, "helpfulness": "0/0", "author": "Richard A Sheldon"}, {"rating": 5.0, "review": "Love thishave 1 on every TVI have bought more as giftsThe all love itTry it out", "verified": true, "helpfulness": "0/0", "author": "waldofrog"}]