[{"rating": 5.0, "review": "This is a great addition to a home entertainment system (especially if you have Amazon Prime). I am not a huge fan of the main menu but the fact that the Fire TV allows you to side-load apps such as firestarter (a new menu system) I will give it 5 stars.  I give Amazon a lot of credit allowing there users to side-load apps giving the user options outside of the Amazon app store.With the Fire TV I purchased these with the Amazon Game Controller and have been very happy with it.  I have played several Android and emulator games on my Fire TV and really like the feel.  I have purchased three of these so far and would suggest these to a friend.My only note to Amazon is I think they should put Kodi (media center) back on the app store.  It seems they are eliminating the competition by removing it and I don’t think that is fair.", "verified": true, "helpfulness": "0/0", "author": "DJohnson"}, {"rating": 1.0, "review": "I would have give 5 stars if has Web browser capabilities. It kind of freeze every once in a while. I thought it would perform better than the fire stick but it is not. The only advantage of fire tv to stick is the voice search. But have no use for the voice search.  Therefore, I would prefer the stick. It is more economical sense.", "verified": true, "helpfulness": "0/1", "author": "Nathan Vue"}, {"rating": 5.0, "review": "WOW!!!!  I Love this device and I've only had it for a day. I have read some of the reviews that gave it 1 or 2 stars. The only reason I can possibly imagine anyone giving this less than five stars is that they haven't hooked it up yet. I read about having to wait for an update immediately upon hooking it up. That may have been true earlier, but not my experience, it started up at once, and performed as advertised. I'm blown away. The capabilities of this little box are amazing.I've read the reviews complaining about the lack of free content, and I have to disagree. I too would like to see more free PRIME, but, hey, where you gonna get what's available for the price of your PRIME membership anywhere else?If I had any complaints, it would be the free series available, but usually not all of the seasons. I really hate getting in to a series and then find out I have to pay if I want to watch the last season.My advice, BUY IT!!!  It's amazing.  I can't write any more about it right now, because this is holding me up from watching TV with my AMAZON FIRE. I feel the addiction starting already.", "verified": true, "helpfulness": "0/0", "author": "G.Rice"}, {"rating": 3.0, "review": "The fireTv Is good but could be better. App sometimes would crash or would not run properly, example: Netflix. FireTv should have more live tv options like the TWC TV app available on the Roku box to make it a full cable TV killer.", "verified": true, "helpfulness": "0/0", "author": "Manuel Bueno"}, {"rating": 5.0, "review": "This is awesome. . Being able to have more control over what you watch and how much you spend for it. .", "verified": true, "helpfulness": "0/0", "author": "Sherman A. Stebbins \"Sherm\""}, {"rating": 5.0, "review": "Love it, very easy to install and use.", "verified": true, "helpfulness": "0/1", "author": "Charmell Jones"}, {"rating": 5.0, "review": "I am hard of hearing, so I rely on closed caption.  When I went to Netflix or Amazon for a movie I could not get closed caption even though I have it on my TV.  So a friend suggested to buy Amazon Fire TV.  Now I can have closed caption with the movie.  Just wished it would work with my blue tooth device.  I have hearing aids and they are not enough.  But at least now I can enjoy a movie.", "verified": true, "helpfulness": "0/0", "author": "BJP"}, {"rating": 2.0, "review": "It was not a bad streaming device....but, Apple TV's navigation is much much better.", "verified": true, "helpfulness": "0/0", "author": "Juan Rivera"}, {"rating": 4.0, "review": "The best picture and sound of any video streaming device I've used, and the voice search is nice--when it works, which it doesn't on most services.  The menu system is not nearly up to the Roku standards and the available services are quite limited in comparison to Roku.", "verified": true, "helpfulness": "0/0", "author": "TWM"}, {"rating": 5.0, "review": "if you have Amazon prime or not this is the best in streaming and it will provide 3d movies if you tv will support it and your connection can support hd as well as full video games with some of the most revolutionary game makers fps, platformers, and games like no others a first-person shooter/defense game the likes of which I've never seen before and even a way to store your movies tv shows and others to usb storage for on the go viewing and if you think this is to pricey there is a cheaper alternative fire tv stick (only app and watching functions) too busy to watch the news use one of the free apps that allow you to choose your broadcast like watch up or espn sports and if you have kids put a parental block to control what your kids watch and keep them from purchasing without your consent", "verified": true, "helpfulness": "0/0", "author": "william peterson"}]