[{"rating": 5.0, "review": "I love this!!! I am a senior citizen and this was simple for me to connect and start to use right away.", "verified": true, "helpfulness": "0/0", "author": "Corrine Willhite"}, {"rating": 5.0, "review": "I love the device.  I will like for the voice search to be integrated with other major apps like neflix and Hulu.  So far I am happy.", "verified": true, "helpfulness": "0/0", "author": "Winston Hernandez"}, {"rating": 4.0, "review": "I bought this on sale $30 off on cyber Monday. I love my new toy. I had a roku stick but was not able to use it at my university due to it not having an Ethernet capability. I love the speed and abilities of amazing fire TV!", "verified": true, "helpfulness": "0/0", "author": "Taylor Royse"}, {"rating": 5.0, "review": "I am very pleased with the Fire TV, it is easy to hook up and easy to use, I use it mostly for Amazon Prime, other than being limited to older titles it is very good.  Movies I have ordered and paid for seem to be a little over priced but I guess that is the price for the convenience of the device.  I would recommend the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Tom McCoy \"Photo Tom\""}, {"rating": 5.0, "review": "This Amazon Fire TV is just great, I highly recommend it, easy to use is just plug and play, I love it", "verified": true, "helpfulness": "0/0", "author": "Jose L. Salazar"}, {"rating": 5.0, "review": "Awesome seller, awesome product, super fast shipping AAA+++", "verified": true, "helpfulness": "0/0", "author": "Andre Maltais"}, {"rating": 3.0, "review": "I've had three generations of Apple TV, Ruku, WD, and now FireTV.  Fire TV is a great first effort.  The amazon prime content is nice.  Its lack of built in video streaming from an iTunes library, or from a DLNA or other disk based library of video is limiting.  There is a 3rd party app that does this, but its UI is 'techie' and not smooth like the apple TV or XBMC.  All of the streaming media players, apple included, are limited by  one thing...  they don't allow people to 'cut the cord'.  Now that content providers, like CBS, are allowing people to subscribe  to their content directly, devices like FireTV could take off if they could offer a tiVo like interface for streamed TV.  Like many cord cutters, I'd rather pay for the content I want, than a bundle I pay lots of $$ for but only watch a couple of channels.  If anyone from amazon reads these, that's what the market needs.  A streaming device that can replace cable/satellite.  Maybe Amazon can pull that off.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "is it possible to stream directly from mobile devices to the fire tv, such as with Apple TV or chromecast?", "verified": false, "helpfulness": "0/0", "author": "Drayk Hendry"}, {"rating": 1.0, "review": "Don't know if it is worth the money", "verified": true, "helpfulness": "0/9", "author": "karl bawden"}]