[{"rating": 5.0, "review": "Basically the same price as a Roku but with more functionality and much faster. You can play a lot of android games from the Amazon Store but you need to buy the controller if you want to use it for games because only a limited selection of games work without the gamepad controller. When browsing the apps and games it shows you which apps need the controller with a little icon, so you don't purchase or download an app that you can't use.", "verified": true, "helpfulness": "0/0", "author": "Michael S. Urvan"}, {"rating": 5.0, "review": "I have owned my Fire TV for a little over a month, and I have been very pleased. Until now, I have been a Roku fanboy, but recently have been infuriated by the slow response time, buffering, and connection issues from both of my Roku's. I was planning on purchasing an Apple TV, but was concerned with Apple's limited support for their \"hobby\" set top box.I have been extremely pleased with the Fire TV. So pleased, that I purchased a second one when it was on sale the other week! I am still getting used to pressing a button on the remote, and the set top box responds instantly (a luxury that I never had with Roku's slow interface and weak processor). Application and show load quickly and I have only had minor instances of buffering (to be expected).The hardware is excellent and the interface is decent. I wish voice search worked within all applications (Netflix & Hulu), rather than just Prime instant. Oh well, not a big deal for me.This set top box is the only logical choice at this time. It's competition can't even come close to the speed it has to offer, which is the most important thing for me.", "verified": true, "helpfulness": "1/1", "author": "Death Metal Till Death"}, {"rating": 5.0, "review": "Just what I wanted!Easy setup, well laid out, easy to navigate, and it included YouTube.The only problem I've had is the search feature. I've had mediocre luck with the voice search,and the typed search is sorta tedious compared to the Roku device it replaced.", "verified": true, "helpfulness": "4/4", "author": "Wilbur B."}, {"rating": 5.0, "review": "EASY to set up; really truly plug and play; was worried about proximity to wireless, but linked without issue even though opposite ends of house (better range than our i-phones); Netflix app in fire was easy to set up, but if you miss the screen for an existing account and it jumps to new account set up page, you will have to delete the Netflix app and reinstall, but took all of two minutes to recover", "verified": true, "helpfulness": "1/1", "author": "Raleigh"}, {"rating": 1.0, "review": "Thought it would eliminate TV charges. It does not. But I do save on shipping cost.", "verified": true, "helpfulness": "1/15", "author": "Richard Stack \"old guy\""}, {"rating": 3.0, "review": "So Close to perfect.Pro:It streams Prime and Netflix perfect.  Very fast and the wireless lets me put it in a closet and still use the remote.Con:Can't play media from an external Hard drive.  If it could do this then all my media would work and it would be awesome.  Please add it Amazon.Three stars because they could have done it but didn't so they could make more money when this feature isn't present.", "verified": true, "helpfulness": "0/3", "author": "Crowe"}, {"rating": 2.0, "review": "No different than my Apple TV", "verified": true, "helpfulness": "0/6", "author": "Roger Williamson"}, {"rating": 5.0, "review": "I have tried out many different smart TV adapters and as of right now Fire TV takes the win!  Apple TV... I never thought anything could be better than Apple TV...The UI is clean, neat, and easy to navigate, plus the device just functioned reliably.  Then I decided for the other TV in my house to try something new, so I went for the Sony Google TV...what a mistake, from day one that piece never worked properly.  There were so many glitches in the software that would leave you hanging waiting desperately for something to load, and it wasn't an issue with my ISP because all my other devices were very speedy.  I quickly abandoned the Sony Google TV to maintain my sanity.  After a few months went by I decided to try the Amazon Fire TV...BEST DAY EVER!  This device is lightening fast! Thanks to all the ram, quad core processor and dual band wifi it never leaves you hanging.  Now, when I go back and use my Apple TV, I am astonished with the load times and slowness (albeit it is not a slow device).  Amazon Fire TV loads media in an instant and is just ready to go all the time.  The voice search, at first, seemed a bit gimmicky, it's not!  Super intuitive, accurate, fast, and easy. I use it frequently.  The only negative about this device is application store, which could be better organized.  Thank you Amazon for making, in my opinion, the best Smart TV adapter around.", "verified": true, "helpfulness": "3/3", "author": "Joseph J."}, {"rating": 3.0, "review": "This was very easy to set up and picture is very good. The bad thing is your can not find all the prime movies. I believe if you are going to advertise your 40,000 free prime shows you need to list them where you are able to find them. Other wise it seems like false advertising to me. My husband finally gave up and went back to Netflix on hiss Xbox One.", "verified": true, "helpfulness": "1/4", "author": "Connie L."}, {"rating": 5.0, "review": "Lovelovelovelove it! Voice recognition is superb!", "verified": true, "helpfulness": "0/0", "author": "cyndia"}]