[{"rating": 5.0, "review": "I think this product is soo good that I'm ordering 2 more ,I can enjoy my movies in my room now.Thanks", "verified": true, "helpfulness": "0/0", "author": "Eileen"}, {"rating": 5.0, "review": "This product gives the ability to project on a tv without a drect connection. I have wanted a way to project browser based content to a tv over my wireless system. This does what I want.", "verified": true, "helpfulness": "0/0", "author": "RayS"}, {"rating": 5.0, "review": "I have had this for over a week now and I love it. I use it for watching YouTube on a 40\" LED TV. It works seamlessly with my iPad and a Windows 7 laptop running Chrome. Setup was pretty easy as well.There are not a lot of Apps that you can use this with at the moment. I have two Roku boxes that don't support Youtube. Instead of dropping $99 for a new Roku3 box, I chose to get this for less than a third of the price.If you don't have a streaming box, this is a great (and cheaper) alternative for watching Youtube, Netflix and Hulu Plus on your HDTV.", "verified": true, "helpfulness": "0/0", "author": "DenverGuy \"DenverGuy\""}, {"rating": 5.0, "review": "We have been wanting a smart tv, but love our current tv and really don't want to dish out the money for a new tv right now. I have always wanted Apple TV, but didn't want to spend the money for that either and was skeptical it was worth it.We love chromecast. It was extremely easy to set up and use, and we use it the time from our Laptop, iPhones, and tablet/iPad. We were amazed at the quality and how fun Netflix is now.We are hoping to be able to pull up movies and other websites other than just the available apps right now, I've heard it is possible, I just have to figure out how. If you are looking to play music, YouTube, and netflix....this is so worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Grace Olesak-Irby"}, {"rating": 5.0, "review": "Everything's fine. I would like to wait more apps after the SDK has been released to public.You should have this awesome kit in your home!!", "verified": true, "helpfulness": "0/0", "author": "BO GAO"}, {"rating": 5.0, "review": "Does the job, my TV's usb port does not supply power but it's also a dirt cheap tv from black friday. So I use the AC wall plug and it's great because I can turn my tv on with my phone.", "verified": true, "helpfulness": "0/0", "author": "Bombe"}, {"rating": 1.0, "review": "I WOULD NOT RECOMEND IT TO NO ONE I KNOW,I WONT EVEN GIVE IT TO SOMEONE IS NOT WHAT I THOUGHT IT WOULD BE", "verified": true, "helpfulness": "1/6", "author": "David CHAPMAN"}, {"rating": 1.0, "review": "Disconnects frequently and lags tremendously. Waste of money. I guess im gonna have to go back to connecting my laptop via cable.", "verified": true, "helpfulness": "1/6", "author": "kevin choe"}, {"rating": 5.0, "review": "This is my second Chromecast.  Having one on our main television, we added a second to our bedroom TV.  They are so easy to set up and even easier to use.", "verified": true, "helpfulness": "0/0", "author": "Edward J Potts"}, {"rating": 5.0, "review": "I really enjoy it when I use it, youtube stuff etc. Easy to use simple to setup. Pretty cool to use.", "verified": true, "helpfulness": "0/0", "author": "Gerald A. Hernandez"}]