[{"rating": 5.0, "review": "$35 gets you a smart home entertainment device. You will find yourself looking more into the technology and expanding your test in entertainment and technology", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It set up quickly and I use it with the Google Music player all the time.  I'm looking forward to more apps integrating the Chromecast features.", "verified": true, "helpfulness": "0/0", "author": "Stephen George"}, {"rating": 5.0, "review": "I bought this mainly to stream online videos.  I didn't think I needed it for Netflix or Amazon Prime because I had my Xbox 360 to do that for me.  However, the quality difference between chromecast and Xbox 360 is very noticeable.  Not only does Google Chromecast seem like it is of better quality, it is much brighter as well.  I now use Chromecast for everything from Netflix to Amazon Prime Movies and other online streaming.", "verified": true, "helpfulness": "0/0", "author": "Jaron"}, {"rating": 4.0, "review": "I really like this product but it is very limited at this point. While it streams Netflix and Hulu beautifully they also are limited in content. Looking forward to Amazon Instant Video to become available on the device. For the price it is great and for us whom are hearing impaired it supports CC.", "verified": true, "helpfulness": "0/0", "author": "Pastor Dick"}, {"rating": 3.0, "review": "I bought this so that I could send my ipad's display to my big TV. Now I understand perfectly well that not all ipad apps will have the Chromecast plugin, but not the ipad Chrome browser itself? How friggin' lame!", "verified": true, "helpfulness": "0/0", "author": "Mr. V."}, {"rating": 5.0, "review": "NOT A TECH SAVVY PERSON AND IT WAS EASY TO HOOK UP. I WOULD RECOMMEND THIS TO ANYONE LIKES TO STEAM", "verified": true, "helpfulness": "0/0", "author": "VA'SROYALHIGHNESS \"FAULCON ALSTON JR\""}, {"rating": 4.0, "review": "I bought the Chromecast to dip my toe into the world of digital movies and tv shows. Now, I only purchase digital content. With the Chromecast, I no longer have to buy disks to watch what I want when I want on the big screen. I highly recommend you get this thing; you won't regret it.", "verified": false, "helpfulness": "0/0", "author": "Cody Keisler"}, {"rating": 1.0, "review": "I enjoy trying devices out to see what works well.  Though this price is cheap, the product is not plug & play as advertised on TV.  It was the HDMI but I still had to power it and not very functional (remote, etc).  I'm much happier with the functionality of a Roku or Apple TV.", "verified": true, "helpfulness": "0/1", "author": "Live Church Solutions"}, {"rating": 5.0, "review": "Couldn't be easier to setup or use. As with most items from Google, I'm very pleased with this excellent product!", "verified": true, "helpfulness": "0/0", "author": "Brian B. \"NC_Bandit\""}, {"rating": 2.0, "review": "I bought this based on the star ratings and i am really disappointed at the limitations of this thing, It feels as though it is underdeveloped and not ready for public use just yet, google needs to take this one back to R&D; and finish it, It has a lot of potential if they can get it to function correctly.My first problem with this was the initial set up, It would not see my network at all, so setting it up on my computer was not going to happen, so I downloaded the android app and finally got it set up and working through the app then I was able to set up my pc to use it.Everything that I casted from my browser was just terribly laggy. At first i assumed that my network was the problem but after doing some tests on my network I found that it was just the Chromecast having issues, Everything that runs wirelessly through my network worked flawlessly. The chromecast was only 10 feet away with no obstructions like walls or anything. The picture quality was pixelated and skipped a lot, which made everything unwatchable.I finally gave up on the pc and just tried out my phone and casted youtube and it was ok casting video and audio with out any problems I then tried other apps and everything seemed just fine when casting from the approved apps from my phone. My pc has a six core processor with 16gb of ram (64bit system) this is more than enough for the chromecast to work. my router is aAsus RT-N56U, perfect for streaming.I was able to cast my desktop which was pretty good but then got laggy when i tried to play a video, also since i have two monitors it casted both onto my tv which i expected it to do, I just do not plan on disconnecting a monitor every time I want to cast my desktop, so I will most likely not use this feature.All in all, I have decided that everything that the Chromecast is capable of doing I can accomplish with my ps3 but with better picture/audio quality, right now I have no need for the chromecast so I will be returning it.One more thing, When i tried playing movies from my own digital library the chrome browser would not play any video that was not in MP4 format, I have no desire to convert all of my videos to that format, I just dont have the time to do that, besides even if i did, im pretty sure it would be unwatchable any ways. for now i will just keep using my ps3 where I have access to all of my own video library as well as netflix and hulu plus.", "verified": true, "helpfulness": "0/0", "author": "Mcolon"}]