[{"rating": 5.0, "review": "Wow, how easy is that to use and watch Netflix on our television!Amazon went above and beyond the call when we ordered this item as it was not only shipped right away, but arrived the day before we were expecting it.When we plugged in the device it immediately began its setup procedure and just was so easy to use.Thank you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "My living room TV setup has a smart tv with GoogleTV as well as other internet content streaming devices like PS4, however my bedroom TV was just a regular \"dumbTV\" (not internet connected). I didn't want to spend a whole lot of money to be able to get good content on that TV and this turned out to be a perfect solution!The Chromecast comes with the Chromecast unit, a USB cable, a wall power adapter, and an HDMI extender cable. Setup was a breeze. You plug in the Chromecast unit into an HDMI port on your TV or receiver, you then plug the usb cable into the Chromecast and the other end into the TV (only if the USB port on the TV says \"USB\" or has the USB symbol, if it says \"service\" it won't power the device). If your TV does not have a proper USB port you can use the power adapter and plug it into the wall. Once I plugged it in the TV immediately showed the Chromecast setup screen and asked me to go to [...] . There you can connect it to your network and after about 3 minutes of downloading updates, the Chromecast was ready to use (almost).I did the setup using my android tablet (Samsung Galaxy Note 10.1) and I first needed to download the Chromecast app from Google Play store. After I downloaded the app I then had to download apps for the content providers, namely Netflix and HuluPlus (I already had Youtube, HBOgo and Pandora). When you launch one of those apps there is a little icon you can click to stream to the Chromecast. Important to note that the Chromecast DOES NOT mirror your screen! If your in HBOgo and you click the chromecast icon, your TV then shows the HBO logo until you press play on a movie/TV show. Your scrolling through menus does not show up on the TV. Also during play the movie only shows up on the TV while you are free to use the tablet or computer for other things!Using a computer you can sortof do a screen mirror using tab casting. Its not quite screen mirroring since you can only cast a  tab in a Google chrome browser (assuming you downloaded the chrome extension). I prefer to use my tablet since the native apps like HBOgo and Netflix work better than streaming on my laptop for some reason. My laptop streams come through choppy (not a fault of the Chromecast, its just always been that way on my laptop).The streaming video came in great, no choppyness at all. The audio sound good too.The reason I only gave this 4 stars is because:1) There is no Amazon Instant Video app and I have purchased a few movies on Amazon over the years and there are a few things on Prime I'd like to be able to watch.2)Showtime Anytime app is not supported. HBOgo is supported but not Showtime Anytime? Showtime has some great original programming and since I do not have a cablebox in my bedroom I would like to be able to watch Showtime via the Chromecast. As of right now this is only possible via tabcasting3)Tabcasting is not supported on Android tablets or phones. My tablet uses a Chrome browser, why can't I download a chrome extension for Chromecast? Its ridiculous that a tablet with an Android operating system (created by Google), that uses a Chrome browser (created by Google), isn't fully functional with the Chromecast (created by Google).Hopefully these things are fixed in future updates. If and when they are I will update my review/ratingAt the end of the day, this only costs $35. The low cost makes this a great buy even with the limitations", "verified": false, "helpfulness": "0/0", "author": "Banquero"}, {"rating": 5.0, "review": "We set up 3 devices to control Chromecast  - Acer Chromebook, macbook, and iPad. Streamed from YouTube - better than ps3!", "verified": true, "helpfulness": "0/0", "author": "TC"}, {"rating": 5.0, "review": "Installation was quick and easy. Took about 8 minutes to initialize and name the device. Once set up, it moves easily to other TVs. I was able to watch Netflix and YouTube, and listen to Pandora on an ipad mini, ASUS tablet, Samsung Galaxy phone, Windows laptop, and Windows PC- all without issues. The picture quality and sound were all good. I am hoping that more apps are added to the device soon such as picture viewer and imovies.", "verified": false, "helpfulness": "0/0", "author": "lr"}, {"rating": 4.0, "review": "Great useful tool.  Only thing I wasn't expecting was the device actually needs to be plugged in to either outlet or USB port from the HDMI device.  This adds an extra step but other than that... easy to use.", "verified": true, "helpfulness": "0/0", "author": "-Amabuy-"}, {"rating": 5.0, "review": "I bought this on an impulse and i have to say i am glad i did. This is the kind of item that you may not use super often, but when you do your glad you have it!", "verified": true, "helpfulness": "0/1", "author": "Dustin Negron"}, {"rating": 5.0, "review": "I bought this for my Mom so she could cancel her cable. I have her signed in to Netflix and Hulu+ and between the two she has all the movies and TV shows she wants. There is also an option to see other compatible apps for your phone or tablet so we found a lot of other avenues to check out as well. I have a Roku but for $35 I wouldn't mind buying another one of these for my home.", "verified": true, "helpfulness": "0/0", "author": "Allison P Stateler"}, {"rating": 1.0, "review": "Should have read more. The only supported apps I use, Netflix and YouTube, my TV already plays them. I need to broadcast ANY app from iPad.", "verified": true, "helpfulness": "0/1", "author": "Steve Morgan"}, {"rating": 4.0, "review": "It's very easy to set up and use with supported web apps, but in general it doesn't work well with other videos.  Trying to watch a streaming sports cast or movie that's not Netflix or Hulu tends to lag and eventually crash the connection.  Definitely useful for the supported apps though!!", "verified": true, "helpfulness": "0/0", "author": "Peter S Mertz"}, {"rating": 5.0, "review": "This was so easy to install!  I plugged it into an HDMI port and a USB port on the TV.  I downloaded the Chromecast app onto my smart phone and viola!  A few easy steps and the device was connected to my wireless internet and to my phone.  I elected to start a Netflix account ($7.99/mo) and watch movies all of the time.  They stream beautifully!  I have tried another internet movie service and that one kept stopping to load more movie.  I ultimately had to download the movie rather than stream it.  I would recommend this to anyone who is not keen to add on to their cable or dish service and wants more control over what is available.", "verified": true, "helpfulness": "0/0", "author": "A. M. Wright"}]