[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Tiago"}, {"rating": 4.0, "review": "Very nice little device for when my niece and nephew come over and want to YouTube it or watch Netflix, Vudu, etc. Took a while for me to set up because it didn't pick up a strong Wi-Fi signal, but it eventually got it and works great.", "verified": true, "helpfulness": "0/0", "author": "RickW"}, {"rating": 5.0, "review": "It's easy to set up and use, and has very smooth streaming. Love it", "verified": true, "helpfulness": "0/0", "author": "Britton Clay"}, {"rating": 1.0, "review": "BUYER BEWARE CHROMECAST IS TOTAL JUNK AMAZON NOT HELP OUT, BAD OUT OF BOX.", "verified": true, "helpfulness": "0/2", "author": "Louis G."}, {"rating": 5.0, "review": "Chromecast is awesome - very simple to use, and for very little $$$ you can open up the options for what you watch on TV to include tons of online content like HBO GO.", "verified": true, "helpfulness": "0/0", "author": "Keith Sparkjoy"}, {"rating": 5.0, "review": "Works excellent and is the way most comfortable to watch a film in netflix", "verified": true, "helpfulness": "0/0", "author": "cecilia sala"}, {"rating": 4.0, "review": "Work fine but I don't like the video quality", "verified": true, "helpfulness": "0/0", "author": "winor"}, {"rating": 3.0, "review": "its ok. netflix is the best app that works, streaming from chrome browser is very choppy no matter how close you are to chromecast or wireless router", "verified": true, "helpfulness": "0/0", "author": "izzy o"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "ERic WIlliams"}, {"rating": 3.0, "review": "I bought this device basically to cast Netflix movies to my TV.  The picture is casted very nicely and clearly but the sound is not.  The music part of the movie is way louder than the conversation and I have to adjust the sound continuously as I am watching a movie.  I tried the sound options of my TV including \"clear voice\"  but have the same problem.  I also tried to cast the videos I have in my laptop but the picture, however clear, moves as slow motion and not continuously!  I hope that Google makes some improvements when this software part of the device is no longer a \"beta\"", "verified": true, "helpfulness": "0/0", "author": "Jammy"}]