[{"rating": 3.0, "review": "Nice toy to broadcast some videos and news onto my 60\" TV but wish that I can broadcast by entire tablet screen.", "verified": false, "helpfulness": "0/0", "author": "PY \"pywl\""}, {"rating": 3.0, "review": "i think the Chromcast at this point in time is still a bit too overrated. maybe if you have an ideal setup ie. ipad + apple tv + tv things will work out ideally for you. if you have a iphone/PC + TV. but outside of those usual suspects, you're on your own in no man's land.so far there's still no way to stream movies from an HTPC through your phone/tablet to a TV that's in a remote room. you're only left with the default options of Netflix and a handful of apps that work with Chromecast through your tablet and phone. if you want to stream movies from your HTPC using VLC streamer and upstream those movies in real-time to your TV in a different room that's plugged in with a chromecast, you're out of luck. with an apple TV you could accomplish this, but with a price. alas a used apple tv can be had for around $50 nowadays.hopefully google will open up its codes to developers so more apps can work with the chromecast. but at this point in time, be prepared, the usage will be very limited.", "verified": true, "helpfulness": "0/0", "author": "howie"}, {"rating": 5.0, "review": "This is awesome !", "verified": false, "helpfulness": "0/0", "author": "G. Monge \"G. M. de Villegas\""}, {"rating": 4.0, "review": "Easy to install and setup. Now I can cast anything to my tv...Excellent", "verified": true, "helpfulness": "0/0", "author": "Joseph Dsouza"}, {"rating": 4.0, "review": "Totally worth it", "verified": true, "helpfulness": "0/0", "author": "zachary a wessel"}, {"rating": 1.0, "review": "This was a fairly useless device that I ended up sending back.  However, it does everything it claims, so my complaint is not really that it is a bad product, just that I didn't understand you always had to have something running that could cast to the device, and it didn't work with my Kindle, so I didn't always have something.", "verified": false, "helpfulness": "0/0", "author": "Jo Anne Johnson"}, {"rating": 5.0, "review": "It's Google, what else can I say.  Great device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works as advertised, easy setup1. Plug chrome cast into usb2. Plug usb and chromecast hdmi in3. Connect chromecast to internet and update then reboot voila done!  Keep apps coming developers!", "verified": false, "helpfulness": "0/0", "author": "Unlimited_Worm"}, {"rating": 5.0, "review": "Who could ask for anything more.  You need Chromecast in your life.  I cast netflix to my TV---- which is smart BUT for some reason refuses to connect to the home network.  Forgetaboutit!  Chromecast has you covered.  #cantlivewithoutit", "verified": true, "helpfulness": "0/0", "author": "Momille"}, {"rating": 5.0, "review": "Good product and fast shipping. Thanks.", "verified": true, "helpfulness": "0/0", "author": "Jung Yeol Kim"}]