[{"rating": 2.0, "review": "Unfortunately not a single help or set up document accompanied my chromecast and I have unable to use it so I have to give this only 2 stars. Online support is nonexistent as is any time of manufacturers help line or tech support. I'm not giving this 1 star because I'm sure my own lack of high level technical knowledge is adding to the difficulty. That being said, I would think that there would be some type of user-friendly docs or support somewhere but I have not been able to locate anything to help... at least that I can understand. I cannot recommend this to anyone.", "verified": true, "helpfulness": "0/1", "author": "Bob L \"Leo Roberts\""}, {"rating": 5.0, "review": "Chromecast is wonderful and keeps getting better. It seems to heat up a bit, so leave it space for venting, but its never been a problem for us. Its incredible how easy it is to stream on our tv. It keeps getting better, now that you can stream almost anything from your computer if you're using Chrome. They'll have to work on lag a bit for things like gaming, but its an amazing value for the cost.", "verified": true, "helpfulness": "0/0", "author": "Steve R Ford"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "GnarCal"}, {"rating": 4.0, "review": "With the websites Chromecast is compatible with, it works great!  It is perfect for YouTube!  And so easy to you - after you set it up, just hit the button on the corner of the website while viewing on your phone, ipad, etc. and it shows up on your TV.  So cool!  I just wish it worked with more sites/apps.  Installation was SO easy.  And, the price was great.  Overall, this product is worth the money.", "verified": true, "helpfulness": "0/0", "author": "Elo"}, {"rating": 5.0, "review": "We love it!", "verified": true, "helpfulness": "0/0", "author": "June (Pop Lit Divas)"}, {"rating": 5.0, "review": "Absolutely love this.i can cast from my cell and watch neflix all day. It connects right away. Love it", "verified": true, "helpfulness": "0/0", "author": "mamy28 \"marilyn\""}, {"rating": 2.0, "review": "This is not a useful product!", "verified": true, "helpfulness": "0/1", "author": "David W."}, {"rating": 5.0, "review": "I love my google chromecast so much I bought 2 more. Setup was extremely easy for me. Some people I know did think it was complicated. Excellent device with great features.", "verified": true, "helpfulness": "0/0", "author": "Big Poppa"}, {"rating": 1.0, "review": "If you want to watch hulu or YouTube, this would work great. Otherwise there are only a handful of apps it works with. Look for this cheap on ebay because I have no use for it.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 3.0, "review": "When I ordered this item for my father for Christmas, I was told that it'd come with  \"$20 Google Play Credit and 90 Days Free of Google Play Music.\" The only thing it had was the Chromecast. The Chromecast works fine, but it is extremely disappointing to be missing $50 worth of value that was suppose to come with it.", "verified": true, "helpfulness": "0/0", "author": "RP Hatten \"P. Hatten\""}]