[{"rating": 4.0, "review": "This device is begining to come into its own as more companies and products add support.  Overall a good buy for Youtube, netflix, and local media (via Plex) on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Craig Toncic"}, {"rating": 5.0, "review": "Our Wii, which we used to get Netflix on our TV, just died.  Some friends gave us a Chromecast, and it works great!  Not only is it easy to operate, but the picture quality is MUCH better than before!", "verified": false, "helpfulness": "1/1", "author": "William"}, {"rating": 5.0, "review": "This is an amazing piece of tech which works perfectly and is very inexpensive. Easy to set up. No complaints.", "verified": true, "helpfulness": "0/0", "author": "ByG"}, {"rating": 4.0, "review": "The most important thing to making your chromecast succeed is your wireless router. It has a major thing to do with connecting and mirroring what is on your google chrome tab to the screen. I find it often that it disconnects and says, \"Sorry connection lost with your router.\" etc. The distance of your wireless router from your TV/chromecast does matter because it needs to have a good connection to mirror your content without lagging or disconnecting. Currently I'm using the xfinity wireless modem/router that is an all in one device and it's horrible. No matter what router I buy out there or modem it doesn't seem to get it right. Preferably if I could I would get a better modem and a separate wireless router for the house.", "verified": true, "helpfulness": "0/0", "author": "Dave Tesh"}, {"rating": 5.0, "review": "A must have life changer.  Cut the cord.  I did.  No more cable/satellite for me.  I can still watch live games or news via broadcast antenna in full HD, then for shows, there are more shows on NetFlix streaming than I could ever hope for.  NetFlix just added a bunch from Discovery and Animal Planet as well.  It is very easy to setup.  Great for parties where anyone can share a clip on the TV.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "I have two of these so far and love everything about them. I primarily use them to watch Netflix and Youtube and they do that perfectly. With the new UI refresh I turn it on sometimes just to have nice pictures and a clock in the background as I do other things. Streaming from my laptop also works great. The full screen beta is also a nice thing to have for miscellaneous things that don't require sound.My only complaint is that sometimes my phone \"disconnects\" from the chromecast and I loose control of playback. Everything on the chromecast continues to play correctly I just can't pause, start, stop, etc. It's not a huge deal, I just reconnect my phone and all is well in the world.All in all this is a great product. I would really like a way to play music across multiple chromecasts simultaneously, simile to Sonos.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "Plug and play easy! I had to update the chromecast after installing Hulu plus but once that occurred no more problems. I love it!", "verified": true, "helpfulness": "0/0", "author": "Karla Sinclair"}, {"rating": 5.0, "review": "This is such a cool product. I highly recommend this device to anyone who is looking for a wireless solution. Google hit a home run with this device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Been looking for a reasonable way to untether our family TV from our older rather dated xBox with netflix app. Sure, we all watch on our respective computers, tablets and occasionally one of our droid phones but, there's nothing like sitting down together in the living room as a family unit and digging Ferris Bueller's Day Off out of the Netflix archive. While the xBox does display 1080p (what about that COX? 1080i's the best you offer??? That's only 540p non-interlaced! Fool me once.So, anyway the chromecast came in last week in a cute little box with the smallest instructions I've received, ever. Folded it weighed in at 4 pages an inch wide by 3 inches tall? Didn't really need them as it's basically plug-n-play. Stick it in an available USB port, tether it with the supplied DVI cable into a Hdmi port, fire up the TV, grab the code and enter it into your tablet/Netflix App.", "verified": true, "helpfulness": "0/2", "author": "kevin murray"}, {"rating": 4.0, "review": "Setup was a breeze as is streaming video to your HDTV.  Only major drawback is a lack of apps.  If your library is limited to Netflix, Playstore, YouTube and HBO Go, you'll love this device.It would be much simpler if Google simply imbedded their Chrome browser on this device.  This way, you have a lot more viewing options.", "verified": true, "helpfulness": "0/0", "author": "Roger A. Yocham"}]