[{"rating": 2.0, "review": "So I bought this device thinking it would work with more apps on my iPad then I expected.  It didn't.  So now I want to return it.To be clear, I bought this through Google Play and NOT through Amazon.I love Google, but now I'm completely rethinking this given the following return process:1) Take 10 minutes searching about how to return the item.  On Google...2) Finally find a phone number, call it, and then wait 10 minutes until a rep answers the phone due to \"high volume\".  That's right, in 2013 when you want to return a Google Chromecast, your only option is to pick up the phone and CALL THEM.  No chat, no email, no page to return my stuff, not even from the original confirmation or Google Wallet that can I find.  What?!?!?!3) I then get a hold of a rep, but she's not in the returns department.  So she sends my request over to that department.4)  Wait another 24-48 hours before I get an email with an RMA and shipping label to return this thing.5) Then I apparently, finally, get to go through all the normal fun of returning an item.Oh, and their return policy is 15 days from the day you get the item.  How customer friendly.And yes, this is all when you purchase from GOOGLE, arguably the greatest technology company at the moment, in the year 2013.  WHAT?!?!  Those of you that ordered from someone that understands eCommerce (Yeah Amazon) where you can actually return stuff at the click of a button (literally), and after 5 years of hundreds of orders only call their customer service department once, consider yourselves lucky.And lastly, Google, I hope that you're searching this Amazon page.  Otherwise there's no way you're fixing this problem.  Because when I told the sales rep that finding how to return an item was the hardest I've experienced from an online retailer, maybe ever, she flat out ignored me.", "verified": false, "helpfulness": "1/13", "author": "Honest Reviewer"}, {"rating": 2.0, "review": "This cute device is capable of displaying Netflix and YouTube videos. That's it. So do most contemporary TVs. Do yourself a favor add $10 and buy one of cheap M808  boxes. You'll get much more bang for the buck.", "verified": true, "helpfulness": "1/7", "author": "Papa Carlo"}, {"rating": 5.0, "review": "Within minutes of receiving this product we up and running streaming you tube and Netflix in the bedroom what at the back of the house", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Hopefully more apps will start including it so the base will grow.I was hoping to be able to transmit anything on my laptop or table to the tv, but only what is opened with the Chrome browser (or specific app written for it on table).", "verified": true, "helpfulness": "0/0", "author": "Thomas Miller"}, {"rating": 5.0, "review": "3 months free on netflix, all you need is hdmi port. it works and its pretty fast. at least no lag when watchn netflix or youtube. get it.", "verified": true, "helpfulness": "0/0", "author": "Woo H. Choi \"Decap\""}, {"rating": 5.0, "review": "Does a better picture then my long hdmi cable accross living room from laptop.My only concern is privacy, does google use it to datamine me.Given the price I assume google has big plans for it", "verified": true, "helpfulness": "0/0", "author": "xyz55"}, {"rating": 5.0, "review": "Now that I understand how it works, it was seamlessly with Netflix and YouTube.  Looking forward to further updates... its an awesome product!", "verified": true, "helpfulness": "0/0", "author": "Peg Hetlage \"Peg\""}, {"rating": 4.0, "review": "I connected the Chromecast without too much trouble. It works Very well with my Samsung tablet 8\" but not with my IPad3,. Downloaded the app, to no avail. Maybe somebody can figure it out.  Great concept that I think will gain traction when more apps come. I wanted Amazon Prime Video and being able to watch my own videos using the iPad. I don't have Netflix, so the use is limited .  Until then, I will keep using Roku.", "verified": true, "helpfulness": "0/0", "author": "E.Barroso"}, {"rating": 4.0, "review": "As the title says, I really like the chromecast.I have heard some people have had troubles with setup, I didn't have any problems using my  S4 phone, and it works with  my nexus 7 tablet also. It did take me a little googling to find out how it works with a wired computer.I've heard about people having the screen go black while playing, so far it has been fine for me.  .The only thing that it really needs are more apps. I have a roku ( a really old one) and got this as a backup as the roku box isgetting, shall we say past it's prime.  As I mainly watch netflix I put the roku away. I do hope apps come quickly as for me that is the biggest disadvantage to the chromecast.With more apps this would be a 5 star for me.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was showed off playing YouTube and Netflix, and it does those things great.  Casting a Chrome tab doesn't work so great, but a lot of that is because of the WiFi in my house.  I can't wait to see what else this will be able to do in the future.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]