[{"rating": 5.0, "review": "Great for youtube.It does what you expect in a simple way.Unfortunately it seems not to many App support it yet.", "verified": true, "helpfulness": "0/0", "author": "Andrea"}, {"rating": 4.0, "review": "Installed easy enoughand priced right. What you can watch using Chromecast is somewhat limited at this point and that's why I gave it 4 stars. But, since I got it primarily for NETFLIX, I'm pleased with how it functions. Looks great on my 55 inch Samsung. Rare streaming jitters, not a big deal. Not into playing video games, so this sure beats buying some sort of game box to get Netflix and no clutter since the dongle is hidden behind the TV.", "verified": true, "helpfulness": "0/0", "author": "Ronald L. Antill"}, {"rating": 4.0, "review": "It is as advertized and was delivered in a timely fashion. We are very happy with it. Now if only we could get more TV shows and more recent movies but that is not the fault of Chromecast. Enjoy!", "verified": true, "helpfulness": "0/0", "author": "Douglas Fairbanks \"Doug\""}, {"rating": 5.0, "review": "Love this electronic tool!!!! I have Netflix on my computer and ipads so can watch movies on my TVs now...", "verified": true, "helpfulness": "0/0", "author": "Judy Knight"}, {"rating": 5.0, "review": "Good way to cast Pandora and netflix on to our high resolution flat screen TV. It is easy to operate without getting the tV remotes.", "verified": true, "helpfulness": "0/0", "author": "Dr. George C. Ruben"}, {"rating": 5.0, "review": "The best of tools for people looking to ditch cable/satellite TV. More and more apps are starting to work with chrome and, if nothing else, just run it from your browser! It's super easy, always on, and talks through wifi to your phone, tablets and computer. Very very worth it.", "verified": true, "helpfulness": "0/0", "author": "Nicole Talucci"}, {"rating": 4.0, "review": "its pretty good, does what it says its suppose to do. However It does not support kindle fire HD :(", "verified": true, "helpfulness": "0/0", "author": "Cgc"}, {"rating": 5.0, "review": "By far the easiest and most reliable Netflix device for your tv. Every thing else is just a nice bonus.", "verified": true, "helpfulness": "0/0", "author": "george basiewicz"}, {"rating": 5.0, "review": "Instead of purchasing an expensive, smart dvd player, you can buy this $35 gadget and watch netflix, hulu and youtube videos (and more) on your tv in hd quality.  My grandson even has the app on his phone and easily \"casts\".", "verified": true, "helpfulness": "0/0", "author": "McKenzie-Amazon lifer!"}, {"rating": 5.0, "review": "I would not change my Chromecast for anything in the world. The only thing that could make it better would be if like the Roku it would bring programming included with it. But you really can't ask for much more for just $30-$35!", "verified": true, "helpfulness": "0/0", "author": "Joe \"Jose Iribarren\""}]