[{"rating": 4.0, "review": "The Amazon Fire TV is probably the best investment I have made online! The use of this streaming player is purely entertainment driven, video on demand from Netflix, Hulu Plus, Amazon Prime and Amazon instant videos. You will need to install the 3rd party apps like Netflix and Hulu but as long as you have good internet that will not be an issue.Vemo is perfect for when you have guests over and you want ambient music playing sweet nothings in the back ground.Internet is key. If you have a connection that is slower that 3mbps, such as dial up or something from the 90's then stop here and move to Kansas.Can I play video's and music from my hard drive? Nee, Jo, Voch', Niet or NO. Unless Amazon release an APP that will allow you to use the USB port on the player. Other players use their USB ports to play MKV , Avi, Mov video files so why not FireTV? I guess it all down to the bottom line. Spend your 5 dollars for the latest movie. Or PLEX through your home network or use the Amazon cloud service if you want to view your photos or videos. But what kind of videos you are allowed to upload onto such a service remains to be seen.YouTube app. Cant find it, but I haven't used the voice search which only works for Amazon services, like prime and instant videos. You will start using the voice search to kill moments of boredom that might come from time to time.Put a password on the Amazon instant video if you have linked your card to the amazon service. You don't want a \"moron\" buying an entire season of a random series you will never watch. It will hurt if it happens. Real bad!Video demand is the future of all entertainment, with bigger home theater systems and curved tv.", "verified": true, "helpfulness": "0/0", "author": "Victor Murithi"}, {"rating": 2.0, "review": "I own an Apple TV, Roku, and also use a PS3 for streaming. I was really hoping for more from Amazon, but this box can barely keep up with doing even the most simple of tasks... When scrolling through Hulu, it lags.. Like, very noticeably. This won't bother Android users, as they're used to it. But after using my Apple TV primarily for about a year, I couldn't stand it. Esspecially when I wanted to do AirPlay, just to remember the Fire TV Can't. Every time I tried using it, I needed up just switching over to the Apple TV, or PS3. My guess is Amazon was hoping this would be a bribe to purchase Prime, therefore not putting much enphasis into third party apps. Anyways. I would not recommend this box to anyone. If you own Apple Products already, get the Apple TV. It's a great companion to all Apple Devices. If you don't, get a Roku. They're cheaper, smaller, and even have a larger App Store.", "verified": true, "helpfulness": "1/4", "author": "Electricurrent"}, {"rating": 1.0, "review": "It's fair to say I have every device that competes directly with the Fire TV.  Every last one of them has an obvious means by which a backlit remote can speak with it.  Amazon was a little too arrogant.  In sacrificing universal remote compatibility, they leave me with two choices - memorize the locations of the buttons on their remote, or only use Fire TV in broad daylight, when I can see the buttons.I don't particularly want to speak with my remote control.  I don't think it's unreasonable of me to want to watch TV in a darkened room.  It also does not seem unreasonable to want to connect these set-top boxes to my Xantech IR remote system, and use my Harmony One remotes with them.  Whoever designed this thing thought it more important to make me sit through that ridiculous introductory video than to give me a way to work with this box as I do with every other.Amazon's FAQ doesn't cover this.  Their tech support was very prompt to answer the phone, and completely clueless - could not even tell me definitely whether the device has an IR pickup in it.", "verified": true, "helpfulness": "7/9", "author": "Ben Stein"}, {"rating": 2.0, "review": "love it but you mix everything come on ! Very ____ when looking all seem to be pay like 90 % of the time what good is to me a member?Same waste of time surfing that I hate YOU found what looks good and NO cost you when they said free  LOL", "verified": true, "helpfulness": "1/1", "author": "menjr57"}, {"rating": 5.0, "review": "This is probably the best device in this genre.  This device enables you to use all the features of a Amazon Prime user.  You can even surf the web with side loaded apps.  Highly recommend to anyone looking for a device that gives them most of their Amazon Prime membership.  This device also enables one to use a Kindle Fire as a mirror device or use the X-Ray ability to learn more about the subject TV show or Movie.", "verified": true, "helpfulness": "0/0", "author": "Chris Quarles"}, {"rating": 4.0, "review": "I have thoroughly enjoyed my Fire TV it works well. I only wish the talk to search feature would work within apps as well, hopefully as these apps develop for Fire TV they will include this functionality. Also, the amazon content isn't categorized really well in my opinion. Overall it's awesome for me!", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "It is nice to not have to watch instant videos on my computer anymore. I love this little box. Voice search is so perfect for us people who have typing with a remote.You can still type search too if you want, but why would you. When I set up the box on my tv, it already had my account information so that was an extra set up step that I did not have to deal with. Don't get the hdmi add on that they suggest because it doesn't work. I was just glad I had another hdmi cord laying around so I was just able to plug in a use it. Nice to play netflix on there as well. I definitely recommend this if you are done with cable tv like I am.", "verified": true, "helpfulness": "1/1", "author": "Shari \"Shari D\""}, {"rating": 5.0, "review": "Being a Mac person, I was about to buy Apple TV when I discovered Amazon Fire TV. After exhaustive comparisons, I decided on Amazon and I am delighted. The device came quickly, was preregistered and all I had to do was plug it in and connect the HDMI cable. Great product.", "verified": true, "helpfulness": "0/0", "author": "joe matthews"}, {"rating": 5.0, "review": "This is the best investment I have made in a long time, it's awesome! Easy set-up, love the voice search, access to all those movie providers and then some!", "verified": true, "helpfulness": "0/0", "author": "Uptoss \"frozeninak\""}, {"rating": 3.0, "review": "no miracast support for devices other than amazon fire pad. I want to cast from my nexus 5 and windows 8 pc", "verified": true, "helpfulness": "0/1", "author": "jianhuiz"}]