[{"rating": 5.0, "review": "This device makes it so easy to watch all of my streaming video. Netflix, Hulu, Amazon Prime, etc. all at the click of the button. I particularly love the voice search for shows. That makes it so easy to find a show or actor - no more typing on an awkward keyboard on the screen if I don't feel like it. My recommendation? Buy one soon - you won't regret it.", "verified": true, "helpfulness": "1/2", "author": "Techno geek"}, {"rating": 1.0, "review": "It works pretty well, but I have lots of apps and its harder to find their content than on my other streaming devices that don't always try to default to prime's content.  I wish I had bought another of what I had already.", "verified": false, "helpfulness": "3/16", "author": "Jordan"}, {"rating": 4.0, "review": "Nice product that works like advertised. Small, fast, easy to use and works great right out of the box. We are very happy with it.", "verified": true, "helpfulness": "1/2", "author": "rt I like the new board layout."}, {"rating": 5.0, "review": "Good:Voice search is incredible.  \"The Americans\"... BAM... \"Sailing movies\"... BAM... \"Summer Glau\"... BAMRF remote means you don't have to point it at the TV.Interface is very quick.  Makes the Apple TV feel slow.  (Did I mention that it's really quick?)\"Home button\" on the remote alleviates the Apple-TV problem of having to hit \"Menu\" a thousand times.Mediocre:The games all feel like they were developed for a phone. (because they were).None of the games really seem to stand out.Menu's will confusingly show you the price to rent movies, when they are actually free with your Amazon Prime account.Bad:Amazon has invented their own currency (Amazon Coins) to buy apps and game add-ons.  This is obnoxious.  Even Microsoft moved away from \"Microsoft Points\".The racing game annoyingly tries to get you to upgrade your cars by spending real money.  I'm not a fan of paid DLC.  (Have kids? Be careful.)Ars Technica did an excellent review, and I agree with all of their points.Why did I give it 5 stars?  Even with all these shortcomings, it feels like a *huge* upgrade over the alternatives I have tried (Apple TV + Xbox 360).", "verified": true, "helpfulness": "2/4", "author": "Patrick Kelley"}, {"rating": 5.0, "review": "I never cared to write a review for any product, but this piece of hardware compelled me to write oneAn awesome pice of s*** I say-Highlights* Fluid screen - this is like lively river flowing, so vibrant and lively (very crisp)* Blue tooth remote- An abundant energy bundled into small piece of stick. I'm loving to hate that \"I'm not able to live without this remote\"* Cloud drive integration - I waste enough time to project my pictures/videos on big screen for friends and relatives. This must have gadget solved it once for all.Not Highlights (rather feature requests)* Voice search for all apps* Increase apps selection", "verified": true, "helpfulness": "1/2", "author": "Naveen Kumar"}, {"rating": 5.0, "review": "I purchased this product on its first day of availability because I'd been having problems with my 1-year-old Apple TV constantly dropping signal and requiring me to unplug it for a reset.While Apple TV offers video and audio through iTunes, I primarily use Netflix and subscribe to Amazon Prime.  It seemed natural to try the Amazon Fire TV.  Here are my first impressions:1.  LAG AND CONTINUITY OF SERVICE (5/5):There is little to no lag.  My old Apple TV would frequently pause to buffer (despite its robust, Gigabit, hardwired broadband Internet connection) only to return with fuzzy video quality.  The Fire TV is always crisp and clear, and I have it hooked up on WiFi for now.2.  SERVICES OFFERED (5/5):The ability for me to combine Amazon Prime video services with Netflix is perfect for me.  I love having a great alternative to Netflix.  Both services work equally well.  The downside is no iTunes (if you're into that), but for me that's not an issue.  You could, however, use both an Apple TV and a Fire TV if your TV or AV receiver has the appropriate HDMI inputs.3.  INTERFACE (4/5):The interface initially made my wife dizzy while browsing, a side effect not experienced with Apple TV.  While Apple TV's browser is two-dimensional (horizontal and vertical), the Fire TV only allows you to scroll horizontally.  Moreover, when you scroll over an item it becomes magnified a bit.  This results in things just popping up one at a time, making it more difficult to see numerous choices at once.  Because of that, it takes longer to find what you want.  I believe they will change this with software updates over time--I doubt I'm the only one with that feedback.  It would be really nice to be able to see MORE.  However, after a couple weeks I have gotten accustomed to this browsing and believe it's not a huge deal, but the Apple TV interface is better for accommodating more on-screen options.4.  VALUE (5/5):I would gladly pay $199 and be almost as happy for this product.  While I feel similarly about the Apple TV, I believe the Fire TV is a superior product.  Its video quality and reliability seem superior.  I have recommended this product to all my coworkers, who are just as obsessed with A/V as I am.5.  SETUP (5/5):It took about five minutes to unbox the unit, plug it into my receiver, follow the on-screen instructions, connect with my network, and begin using the Fire TV.  It doesn't get much easier.", "verified": true, "helpfulness": "2/3", "author": "Evlded8503"}, {"rating": 3.0, "review": "I recently purchased the Amazon fire TV to replace my Logitech Google TV. I am unimpressed. The system works OK much like other units out there, roku, DVD players, smart TVs and the like. Don't think that a lot of thought was given to the unit to be complete solution.I ordered a game controller and will see if it is worth it as a gaming system.My advice is not to buy it yet. Wait to see what kind of apps are developed for it and if amazon will additional features such as a keyboard and webcam.", "verified": true, "helpfulness": "1/2", "author": "Rey \"rremente\""}, {"rating": 2.0, "review": "I purchased the Fire TV mostly for the improved closed captioning over my older roku.  In that respect it was a decent improvement.  However, I had no idea the app selection would be so poor.  No mlb?  Also has problems skipping now and then when streaming with Netflix.  No problem with Prime, and speed is very good.  For the price, one should expect more from Amazon.", "verified": true, "helpfulness": "2/4", "author": "N W"}, {"rating": 5.0, "review": "Very easy setup and great features can't wait to see what's next, the live streaming is awesome and like the sharing option with kindle fire HDX.", "verified": true, "helpfulness": "1/1", "author": "Jdar"}, {"rating": 5.0, "review": "The voice activation feature for the Amazon Fire TV makes this product worth every penny. My husband often fights with our multiple controllers and doing searches can be painful to say the least. With the new voice search he's on cloud nine. Thanks so much!", "verified": true, "helpfulness": "1/1", "author": "dubois317"}]