[{"rating": 5.0, "review": "Good and easy to use", "verified": true, "helpfulness": "0/0", "author": "Kevin oai Luu"}, {"rating": 5.0, "review": "Amazon fire tv is awesome. Got it for a vacation home and it does everything and more!!!!  All the apps from Hulu plus to Netflix are fabulous. I recommend this to everyone! It will not disappoint!", "verified": true, "helpfulness": "0/0", "author": "Logsalt"}, {"rating": 5.0, "review": "I am not a techie and did not know what I was truly buying but I knew I had Amazon Prime. However, thankfully I did purchase Amazon Fire TV just to see what it would do. My husband and I also have Time Warner cable for all of our movie and TV needs. Wow we were so pleasantly surprised when we installed with ease and starting using the Amazon Fire TV. It has so much to offer and we can immediately see all the shows and movies available that is part of the prime free viewings.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Bailey"}, {"rating": 5.0, "review": "Great product. I have slow Internet and works good.", "verified": true, "helpfulness": "0/0", "author": "Jeffery Timpa"}, {"rating": 3.0, "review": "Can't use the FIRE TV - don't have Internet on my home. Please return the $178.04 charged.", "verified": true, "helpfulness": "0/1", "author": "Jean Miller"}, {"rating": 5.0, "review": "Love it. I have the slowest/cheapest internet possible and it works like a champ!", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 4.0, "review": "It's great. The only thing is all the good movies and shows you have to pay for.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm very excited about the huge variety of programming now at my fingertips.  I didn't think I'd like it, but the voice command thingy is terrific.  How great to be able to simply say \"documentaries\" and an enormous array of choices pops up.  There are hundreds of free selections and even the rentals and purchases are very reasonable.  I'm hooked!", "verified": true, "helpfulness": "0/0", "author": "Andrea Lithgow \"movie lover\""}, {"rating": 5.0, "review": "Best Tv box out. Great remote and user freindley menu. I was very suprised by the fire box. Great picture quality and sound.", "verified": true, "helpfulness": "0/0", "author": "Samuel Bond"}, {"rating": 1.0, "review": "Having constant problems with Netflix.  Tried the threads to resolve issues,  nonemail of Them worked. Truly a terrible waste of my money.", "verified": true, "helpfulness": "1/1", "author": "James E Haney Jr"}]