[{"rating": 5.0, "review": "Sick!", "verified": false, "helpfulness": "0/0", "author": "stephen rivas"}, {"rating": 5.0, "review": "Best thing that i bought this year.Very useful.", "verified": true, "helpfulness": "0/0", "author": "Matheus de Almeida Alejandro"}, {"rating": 5.0, "review": "I love this thing. It is so easy to set up and use, if you have a flat screen and a smart phone or tablet, you should definitely get one. I find myself watching a lot more YouTube videos than I ever thought I would. The only issue I've had is that it randomly stopped finding my wireless but I think that is more an issue with my router than the chromecast.", "verified": true, "helpfulness": "0/0", "author": "Tammy"}, {"rating": 5.0, "review": "The product and the supplier are very good.", "verified": false, "helpfulness": "1/1", "author": "Ivan dos Santos Ferreira Mendes"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "great device.im glad to choose that.its better and faster to use than original smart tvs.", "verified": true, "helpfulness": "0/0", "author": "FERZAN ÜNLÜ"}, {"rating": 4.0, "review": "Works as advertised. I mostly use with youtube controlled by ifone. Sometimes the chromecast prefers to connect with ipad or laptop and ignore the iphone but it 'd be ok the next day.", "verified": true, "helpfulness": "0/0", "author": "Vector Tủn"}, {"rating": 5.0, "review": "I dont even watch cable anymore", "verified": false, "helpfulness": "0/0", "author": "Starla"}, {"rating": 2.0, "review": "I'm hugely disappointed with the Google Chrome and ChromeCast application! I use a Google (Samsung) Nexus 10 tablet and a Samsung Galaxy S 4 phone - on BOTH devices I use the YouTube application to cast videos to my TV. Half the time the ChromeCast application cannot find the physical ChromeCast device even though I am standing less than 5 feet away from it and my wireless signal is at full bars (close to 100%). When I finally do make a connection and try to cast a YouTube video it will work sometimes, but mostly (about 80% of the time) it will fail with a Brain Freeze error and then I have to reset everything to get it working again...! I have changed out the physical ChromeCast device with 2 other devices yet I still get the same error. Very DISAPPOINTED!!!", "verified": true, "helpfulness": "0/0", "author": "Cameron Ninham"}, {"rating": 4.0, "review": "The only reason i bought it is for screen cast. It works but its buggy.", "verified": true, "helpfulness": "0/0", "author": "Jayce A. Brinkman"}]