[{"rating": 3.0, "review": "Unfortunately not too many services support this technology yet. I hope many more in the future or this was pretty much a waste of money and natural resources.", "verified": true, "helpfulness": "0/1", "author": "Markus Ruottu"}, {"rating": 5.0, "review": "One of the best media related purchases I've ever made and at a $35 price point, it's hard to beat. I'm considering getting more of them to give out for Christmas.It's really easy to set up and use. It currently supports Netflix, Hulu, Google Video, and recently HBOgo. I only wish it supported Amazon Prime.If you're like me and don't own an xbox or some other method of getting Netflix and HBOgo on your tv then get one.", "verified": true, "helpfulness": "1/1", "author": "Daniel Ortiz"}, {"rating": 2.0, "review": "Worked perfectly ...after 7 days of digging on the internet and talking to dozens of people from Google Chromecast and Actiontec (my Modem/Wi-Fi home DSL network adapter) about the Google dongle and PK5000 (WI-Fi modem). None had a clue on how to make this combo work. It seems like many Chromecast dongles would be returned because of this reason. Also no where did I find a list of DSL modems this WOULD work with.If you have an older modem that the Chromecast refuses to work (and your software and hardware can support it).  I'd recommend this fix. Get a inexpensive Wi-Fi USB dongle like the Cisco AM10 Valet Connector USB Wireless Adapter. And install it. It's about 10 bucks with shipping. All the people I talked with, none had this soultion other than Actiontec wanting me to buy another Wi-Fi modem for 100 bucks.After installing this 10 dollar Wi-Fi dongle onto my system's (Windows 7 home, PC) USB port and then finding the dongle along with the network's name, put in the password and BINGO it worked and it works well for streaming video to my 65 inch Flat screen.I don't know how many people have returned this Chromecast dongle because they didn't know this simple fix or nor did the service departments but it must be many.I'm finally happy.", "verified": true, "helpfulness": "1/2", "author": "Shell"}, {"rating": 5.0, "review": "Google Chromecast was easy to install, widens the capabilities of my TV, and is very inexpensive for what it does.", "verified": true, "helpfulness": "1/1", "author": "Jan Reimers"}, {"rating": 4.0, "review": "The price is too inviting, then the performance is spot on. Have used it almost daily since it arrived. It does require power cord, so not as slick as pictured. But hey...you can't see it anyway.", "verified": true, "helpfulness": "1/1", "author": "Benton G. Hall III"}, {"rating": 3.0, "review": "It does work, outside the distribution countries as well. Integration with YouTube is excellent, however casting from the Chrome browser itself seems very dependant on your device specs.For example, from YouTube you have a dedicated casting icon in the video controls. This disables the video on your device, and streams it full screen to your tv. Works well.In the Chrome browser you also have a casting icon, however this effectively casts a mirror of your browsing window (you can still full screen the video). In my case, running an early Acer Chromebook, trying to cast an avi movie from Chrome to my tv is unwatchable.That said, the Chromecast is open for development. Hope to see some solutions soon.", "verified": true, "helpfulness": "0/1", "author": "Adam"}, {"rating": 5.0, "review": "meets expectations, it saves cables, is very comfortable to use and quick to learn to program it is also extremely easy installation", "verified": true, "helpfulness": "0/0", "author": "eduardo"}, {"rating": 5.0, "review": "If you are an Android enthusiast you NEED this! It is so simple and fast. Just pick your show and throw it to your TV. I've had it for about a month and it has already been used more than our Apple TV has been used in the last year. Great gift idea.", "verified": true, "helpfulness": "0/0", "author": "T. Roberts"}, {"rating": 4.0, "review": "It does what it promises. But I feel very much the lack of desktop streaming and better local video files streaming support.But for Youtube and Netflix, it is perfect!", "verified": true, "helpfulness": "1/1", "author": "Walther Maciel"}, {"rating": 2.0, "review": "Why no airport support :-( too sad !I hope it would be updated to support more application and services", "verified": true, "helpfulness": "1/2", "author": "Julien Calvet"}]