[{"rating": 4.0, "review": "Needs 5g support.", "verified": true, "helpfulness": "0/0", "author": "David H."}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Amy Hammann"}, {"rating": 5.0, "review": "WORKS GREAT!!!...", "verified": true, "helpfulness": "0/0", "author": "Katie L."}, {"rating": 2.0, "review": "Ok !", "verified": true, "helpfulness": "0/0", "author": "Jose Robles"}, {"rating": 1.0, "review": "Defective, won't  work. Need to return but don't know how.", "verified": true, "helpfulness": "0/2", "author": "maxi"}, {"rating": 4.0, "review": "Easy to install and use. The power supply gets very hot and draws current even when I'm not around to use it.", "verified": true, "helpfulness": "0/0", "author": "Ed Brooks"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "BRIAN BLACK"}, {"rating": 4.0, "review": "I like the chromecast a lot.  I use quite often and stream from computer.  There are new available partners everyday.  I just wish there were more. great product.", "verified": true, "helpfulness": "0/0", "author": "Jason T"}, {"rating": 5.0, "review": "I love this thing. I have diving videos that I've compiled using Vegas and wanted to show the family without having to be huddled around my PC in my office or on FB. This thing works GREAT. I now have to recompile my videos to higher resolution - I had to \"dumb down\" the resolution so they would play on FB. I can share some of my underwater adventures now!The Chrome extension part is a bit screwy though. There is a piece that you need that will allow you to share whatever Chrome window that I never did get completely working, the website is bloated with advertisements. The Chromecast software itself simply allows you to share whatever is on your screen to your TV/device.", "verified": true, "helpfulness": "0/0", "author": "2nd_Amend_D"}, {"rating": 5.0, "review": "This product works really well either from your phone or your computer. The days of plugging your computer into your TV to view something are long gone now.", "verified": true, "helpfulness": "1/1", "author": "Scott M."}]