[{"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Alan Weintraub"}, {"rating": 4.0, "review": "Liked it so much I purchased a second.. except now they're almost useless to me, as Netflix seems to have taken a dump and no longer works on chromecast,.", "verified": true, "helpfulness": "0/0", "author": "A5"}, {"rating": 5.0, "review": "Great, worth it", "verified": true, "helpfulness": "0/0", "author": "Ln48"}, {"rating": 5.0, "review": "great!  easy to set up and allows all media to be shown on my tv", "verified": true, "helpfulness": "1/1", "author": "J. Beck"}, {"rating": 5.0, "review": "These are awesome. buy one and you wont be sad", "verified": true, "helpfulness": "0/0", "author": "mfjumani"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "K. Hamdan"}, {"rating": 1.0, "review": "Very buggy. Hire more TE than SETs google ,  to test your products. Shame on your products.  I had nexus 5 before & I was disappointed that native apps were crashing for me everyday. Now same thing with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "gagan"}, {"rating": 5.0, "review": "Love the device, but wish there were more apps available to use with it...", "verified": false, "helpfulness": "0/0", "author": "keitherton"}, {"rating": 5.0, "review": "Somewhat impulsively, I hurried up and bought the Chromecast while I had the company training license to view some online educational videos. I wanted to watch the videos on my TV while sitting on the sofa at home, rather than at my desk. I do have VGA and HDMI cables to connect my laptop to the TV, but they're a bit of a nuisance. Instead, I plugged in the Chromecast, set it up in a few seconds, started a video, and set the laptop on the coffee table. The setup was simple, the instructions clear, and the interface with the Chrome browser is seamless.An added plus: When I needed a break from training, I found some dog videos on YouTube to entertain me and my cocker spaniel.Life can be beautiful!", "verified": true, "helpfulness": "0/0", "author": "D. WILSON"}, {"rating": 1.0, "review": "Drops Netflix control constantly. Pictures don't stream properly from G+. Hardly works.  Save your money. Avoid", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]