[{"rating": 5.0, "review": "This product works well with the non smart TV. It needs a separate power adapter with my Visio so I could not hide the extra cord. This was the only downfall.", "verified": true, "helpfulness": "0/0", "author": "Virginia Mark"}, {"rating": 5.0, "review": "easy to setup - just plug and play, def. recommend! it arrived just in a few days and enjoying watching TV in any area of my house", "verified": true, "helpfulness": "0/0", "author": "Antenor Rambal"}, {"rating": 3.0, "review": "After 3 weeks it went dead. No signal and the power light was out, and no trouble shooting revealed what the problem was. Amazon is sending a replacement, so, hopefully that will take care of it.", "verified": true, "helpfulness": "0/0", "author": "Harold G. Wears"}, {"rating": 5.0, "review": "I would say that I use this 2 - 4 hours a day since I have received it. The setup was extremely easy in my opinion and required very little involvement after it is setup. The device sits on one of your HDMI ports and just waits for you to connect. It has a very nice standby screen that displays pictures, the time, and the name of the device while nothing is going on. Bringing up your phone and connecting to the device takes approx 10 seconds and then you can stream any movie from your phone.Some of the applications like HBO Go seem to be a little buggy at the moment but Netflix and the Google Play store have been working flawlessly for me.I have purchased one of these for every television in my house. I can be watching a movie in my office or den, pause it and then connect to the television in my bedroom and continue right where I left off. This was the big seller for me - especially when that whole process takes less than 20 seconds to swap from TV to TV.", "verified": true, "helpfulness": "0/0", "author": "Chris Gibson"}, {"rating": 5.0, "review": "We like it. It was received quickly. The Chromecast is easy to install, easy to set up and has been working flawlessly.", "verified": true, "helpfulness": "0/0", "author": "dsilbert"}, {"rating": 4.0, "review": "Really easy to stream your tab from mac. Haven't tried streaming using third party apps, but i think it would be easy too.", "verified": true, "helpfulness": "0/0", "author": "Ostap"}, {"rating": 3.0, "review": "The Wi-Fi is surprisingly weak and inconsistent.  It doesn't have an app for Amazon prime videos. Its great for Netflix though if you can't get the Wifi to work, and cool for beaming your browser onto the big screen", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "At first I felt that Chromecast was somewhat limited in usage--I would use it for YouTube, for Netflix, and Songza, but not much else. After getting used to it though, I realized the convenience of controlling everything from your phone and having it stream to your TV. AND when you go on vacation, you can take your chromecast along and connect it to any hotel TV and watch Netflix from your phone! Bonus: cheap!", "verified": true, "helpfulness": "0/0", "author": "foodie"}, {"rating": 5.0, "review": "Great google gadget. Nice clean crisp imaging every time and a must have if your tv doesn't have Netflix ,Pandora , Hulu or YouTube apps but your portable devices do. Bottom line ,its worth the money.", "verified": true, "helpfulness": "0/0", "author": "marinis89"}, {"rating": 5.0, "review": "Just does what it is supposed to.  We love the ease of streaming stuff from any device to the TV.  For $30 I would say it's perfect.", "verified": true, "helpfulness": "0/0", "author": "CaptainBasic"}]