[{"rating": 4.0, "review": "It only works with very few apps... So I've not used it as much as I would like. Wish it worked with Amazon Prime and not just Netflix which I don't subscribe to", "verified": true, "helpfulness": "0/0", "author": "TB"}, {"rating": 4.0, "review": "It works grate have a lot of fun with my phone good to watch you tube on the tv with just a pushed of one butten", "verified": true, "helpfulness": "0/0", "author": "Daniel Palmer"}, {"rating": 5.0, "review": "Awesome device. Its nice to not have my laptop hooked up to an hdmi cable.NegativeIt does make my computer run hot.", "verified": true, "helpfulness": "0/0", "author": "Jassie Fresh \"J.H.\""}, {"rating": 4.0, "review": "Easy to setup, no audio/video sync issues on my 802.11g Wi-Fi network (up to 54Mbps, nothing fancy). Nice feature is Chromecast automatically turns on my Samsung TV when I start casting. I don't even need to turn on TV :)YouTube app on Nexus 7 tablet is buggy, and ability to pause video on tablet sometimes stops working.", "verified": true, "helpfulness": "0/0", "author": "JT"}, {"rating": 5.0, "review": "I bought this so that I can stream whats on my macbook to my TV, video and audio. It works. I haven't had any problems with unsynchronized audio and video at all. I would recommend this product to anybody!", "verified": true, "helpfulness": "0/0", "author": "Paul C."}, {"rating": 3.0, "review": "Only certain things can be sent to it.  The computer and chromecast have to be on the same wi-fi (what if the machine you want to chat from isn't on wifi at all?), and getting the casted thing to go full screen is problematic.  Also syncing audio and video sometimes has problems. Disappointed.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Use this everyday. Doesn't have the best Wi-Fi reception. Works like magic. Would highly recommend this amazing product. Love how it works with google play music", "verified": false, "helpfulness": "0/1", "author": "Ethan Irving"}, {"rating": 5.0, "review": "Works Awesome. We can now watch netflix without having to get up and change the selection on the computer. I highly recommend it for anyone who uses Netflix and Youtube.", "verified": true, "helpfulness": "0/0", "author": "Richard Humphries"}, {"rating": 1.0, "review": "The audio and video are almost never in sync when I use this device. I've never experienced this issue with the Roku, which I've had for years. I would put up with a slight lack of sync, but this is radically out of sync -- by several seconds. I've researched what to do about this and have followed the suggestions to cast at standard resolution and keep all devices close to the router -- it hasn't helped. Personally I find this device too frustrating to be useful. I end up buying shows that I could have cast. I think it's a great idea but the technology doesn't seem to be there yet.", "verified": true, "helpfulness": "0/1", "author": "Robin"}, {"rating": 5.0, "review": "Small and powerful. Works great with netflix, pandora, hulu, and other websites. I can work it with my phone or computer.", "verified": true, "helpfulness": "0/0", "author": "Justin Kempson"}]