[{"rating": 5.0, "review": "very good buy thanks", "verified": true, "helpfulness": "0/0", "author": "ariel arturo valdezamirez"}, {"rating": 5.0, "review": "So cheap and simple, I don't know how anyone would live without one of these plugged on every TV. Yes, it doesn't have a UI or a remote. But that's its strength. You browse with your phone/tablet/PC, and queue media on the TV. Simple, fast, an easy.This, alongside with YouTube, Netflix and Plex makes it the most useful gadget I've purchased last year!", "verified": true, "helpfulness": "0/0", "author": "Martín Paoloni"}, {"rating": 5.0, "review": "Easy setup and use", "verified": true, "helpfulness": "0/0", "author": "Fried"}, {"rating": 5.0, "review": "Easy to get up and running, small and stays out of sight. Never have any issues with it streaming.", "verified": true, "helpfulness": "0/0", "author": "SDouglas"}, {"rating": 1.0, "review": "Did not make any different sorry", "verified": true, "helpfulness": "0/2", "author": "Majid Manion"}, {"rating": 5.0, "review": "Works great with Google's Chrome browser, not so good with Firefox.", "verified": true, "helpfulness": "0/0", "author": "Unhappy Amazon Customer"}, {"rating": 5.0, "review": "My family loves this! Perfect for those nights when there's nothing good on tv. Can't believe I waited so long to get it.", "verified": false, "helpfulness": "0/0", "author": "T. Mcmanus \"Theresa\""}, {"rating": 3.0, "review": "As nice is this is, I thought it would allow me to stream any media I played from any device that can connect to the Chromcast. But, for the apps that do work with this, its very good.", "verified": true, "helpfulness": "0/0", "author": "Nicky L."}, {"rating": 5.0, "review": "Absolutely love it !", "verified": true, "helpfulness": "0/0", "author": "Preps2"}, {"rating": 3.0, "review": "Not sure that this is the best product out there. I like it and it was cheap. It essentially enables me to cut cables from my tablet or phone to my TV when I want to stream a movie from something like Plex. It's easy to set up and the interface is fine.  I do like being able to Cast browser pages from my laptop, too. It's nice for projects or vacation planning so that that whole family doesn't have to crown around the laptop to see something. I haven't been able to cast web pages from my phone and I can't cast from my family's Kindles. If those issues were resolved, I'd likely rate this much higher.", "verified": true, "helpfulness": "0/0", "author": "Brettcw"}]