[{"rating": 2.0, "review": "It didn't live up to the hype sadly.  It is very twitchy and doesn't work or kicks me off even when I am in our home network.  Disappointed but we have a blue ray so maybe am spoiled.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "all in all it's not that bad however IT DOES NOT SUPPORT AMAZON PRIME VIDEOS i got this for my prime account to see my movies on main tv. i dont want to pay for netflix that there line up is really old stuff or that stupid hulu pluse that even though you pay you still get commercials I AM ALREADY PAYING FOR PRIME and now its going up to $99 so the only thing i am using it for is to watch some youtube webcast and listen to music on tv...so you pay $35 then $8 for netflixs and another $8 for hulu pluse you know what get the ROKU youll get alot more for your buck", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Total Nut\""}, {"rating": 5.0, "review": "Simple to set up and works with all my devices including my Class6ix app which I love to watch. The price is great too!", "verified": true, "helpfulness": "0/0", "author": "Joseph M. Cannelongo"}, {"rating": 3.0, "review": "Gives the little extra to make limited smart TV allowing netflix and Crome also many things you do with your chrome browser, you can show on TV. Learning new things here and there. For the cost, I think it is worth it. Wish they would allow the amazon prime to stream on it.", "verified": true, "helpfulness": "0/0", "author": "wolfsblood"}, {"rating": 5.0, "review": "We gave up on satellite tv several years ago. Too much money, too many annoying commercials. We've rented movies since then and watched some things on the internet on our desktop monitor but that was not very comfortable or convenient. This is great. We can watch anything on you tube on our television now by \"casting\" from our desktop. We may pick up Netflix also and have unlimited movies for $9.00/mo.. And I think there are many more possibilities that we've yet to look into because, for now, we're just tickled to watch Miss Marple or Sherlock Holmes or Midsomer Murders (We like the British mysteries) etc for free with no commercials. Love it.", "verified": true, "helpfulness": "0/0", "author": "Steven J Larson"}, {"rating": 3.0, "review": "Much appreciative of the added apps, such as Hulu and especially HBOGO, but this item is still very glitchy. i have (somewhat reluctantly) purchased 5 of these for use herre, and also my parents home, and have had issues with all 5. Sometimes the usage of the USB does not provide enough power, and even when plugged directly into an electrical outlet, the device can become extremely warm and stop streaming. I learned this while attempting to watch Gravity one night. I know it wasn't just that device, or tv as i used multiple devices on 3 separate and different branded televisions. also, pairing the device can be a pain at times and takes several reboots and unplugging before it is recognized and allowed to be streamed to. I love love love the concept of the device, and the price is definitely on point, I just wish google would fix these glitches, and send out an OTA update to all of us owners that are stuck with.", "verified": true, "helpfulness": "0/0", "author": "mbones2"}, {"rating": 5.0, "review": "Sold my Apple TV and Bought Two Chromecast's . Just as good if not better than an Apple TV. Love it", "verified": true, "helpfulness": "1/1", "author": "Hasan Faizan"}, {"rating": 1.0, "review": "Can not use it because I have a laptop with windows Vista and I need a newer laptop in order to use this or a gaming box...not willing to buy either item just yet, so was a total waste of money for me...wish I would of known this before I ordered it.", "verified": true, "helpfulness": "0/0", "author": "Carolyn Kumm"}, {"rating": 5.0, "review": "Love this, Given this to my friends and family. Requires common sense to install and set up; after that just pure enjoyment. Superb", "verified": true, "helpfulness": "0/0", "author": "Brjann S."}, {"rating": 1.0, "review": "useless... you cant beat the Apple TV, wish i knew how limited this thing is... forget it.. move on !!!!", "verified": true, "helpfulness": "0/1", "author": "Johann Sebastian Mastropiero \"mastropiero_que_nunca\""}]