[{"rating": 3.0, "review": "It's okay. I would like this much better if the apps were installed to the device and I didn't have to stream everything from my phone/tablet. It adds an extra step that's unnecessary with devices like the Apple TV, Fire TV or Roku on the market. The only real nice feature is the ability to screencast from Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Tim B."}, {"rating": 5.0, "review": "very good thks", "verified": true, "helpfulness": "0/0", "author": "roberta vinas"}, {"rating": 1.0, "review": "I only can connect the Chromecast to my wifi at the beginning couple times. Then it can't connect it to the wifi no more. I tried it again to day, still not work.Disappointed, I wish I can return it.", "verified": true, "helpfulness": "0/0", "author": "Joyce L."}, {"rating": 4.0, "review": "Make sure that the streaming service you use connects with Chromecast - not all do.  Works well for us.", "verified": true, "helpfulness": "0/0", "author": "Matt04ca"}, {"rating": 3.0, "review": "This item is behind technology times.First let me explain, it is only compatible with a select set of routers, check the compatibility listI mean really, this is unheard of.  This is not the 80's technology times is it?We had an approved router.Chrome cast FORCES update soon as you plug it in, no other options.  Freezes, never goes past 0%.  Forget all the Google research.Tried it on an OLDER incompatible router, a better router, and the update works great!  SUCCESS.But now Chrome cast doesn't work because the router is incompatible.I go back to the original  COMPATIBLE router, and now Chrome cast works good and as expected.My point, is beware, and have plenty of routers to play with unless you are using a router that you KNOW it works with.The original router we used was a TP-Link 1043ND (won't update Chrome cast)Dlink 825 router the update works on product, but product now doesn't WORK with this router.We go back to the original router, the TP-Link 1043ND (the one we want it to work with) and Chrome cast works perfectly.So beware.Google needs to get over what router is being used and make it work with all routers.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "When this device works, it is great. Great picture quality, great sound.  But it works like 50% of the time.  About every 5-10 minutes it freezes up and has to be rebooted, or you have to disconnect the cast from your device and reconnect it.  Super annoying.  Ok beta product but clearly has a ton of flaws.", "verified": true, "helpfulness": "0/0", "author": "TrueBlue"}, {"rating": 5.0, "review": "Very easy setup.  Plug it in to an HDMI port, plug in the power adapter, and launch set up on a compatible device. A few minutes and its set up.Streams and casts the screen from my second generation Nexus 7 with no problems.  I already had Netflix and Hulu subscriptions.  I downloaded those free apps and they work perfectly with the Chromecast.Easy set up and it does everything its supposed to do in a very intuative way.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I feel like the packaging was misleading.  It says \"send anything on the web to your TV\", but this only works if the web site has a cast button, and not all web sites have this.  I bought this specifically to watch football and basketball games on ESPN3 / WatchESPN app and it doesn't work for those, so now I will have to go and buy something else.", "verified": false, "helpfulness": "0/0", "author": "AB"}, {"rating": 5.0, "review": "Ver y useful if you have a tv that is not a smart tv", "verified": true, "helpfulness": "0/0", "author": "manuel"}, {"rating": 5.0, "review": "The Chromecast is a great way to watch content from my PC on my TV, but I knew from reading other reviews and info about the device that there were limits. It is designed to work with the Chrome browse and not other browsers but that is by design as they are both Google products. There will be niche \"sticks\" for various content providers coming and some already exist. Amazon's stick will be available to play Amazon videos, Hulu, etc. Again, these were known before I bought the Chromecast. The device has worked flawless for me so far and have not experienced any delays in the data moving from my PC to the TV, but even if it happens on occasion, for the price of the Chromecast and the functionality it brings, I am willing to endure momentary hickups. Setup was easy regarding having the TV and PC recognize the stick.The issue I had with setting it up was with the security settings on my wireless router. I have an extra level of security by listing only specific mac addresses as being able to use my network.  Neither on the box nor on the stick itself is the mac address listed so I had to do a bit of extra to find out the stick's mac address and then configure my security settings to permit it to connect to my network.  Though it was a need of my wireless router, it would have made it easier for me if he mac address was printed on the stick itself.", "verified": true, "helpfulness": "0/0", "author": "Fremont California Amazon customer"}]