[{"rating": 5.0, "review": "I got one of these for myself and one of these for my father, who is not so good with computers.  He had an Apple TV and was frustrated that the device he had spent so much money on didn't work as well as he had hoped so I showed him how to use Chromecast.  He regrets ever buying the Apple TV.  It works well with any of the supported apps (Netflix, Hulu, Amazon etc.) but does not do personal media streaming as well as I'd hoped, but this is more so the speed of one's network (wireless routers can be slow) than it is the device.  Using any device to stream video is great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Inexpensive item plugs into HDMI slot on TV other end plugs into USB slot on tv. I saw other mention of it as getting hot. It does get hot, when not streaming I unplug the USB end from the tv. Great application for Netflix use. There are other applications that interface with Chromecast like HBO Go an Hulu Plus. Its great that you can direct Netflix movies from your smart phone to the tv and it has no effect on smart phone battery usage or data usage.", "verified": true, "helpfulness": "0/0", "author": "Bertram Halbert"}, {"rating": 1.0, "review": "Can't use it because it needs to be up graded and the up grade cost money to do. very disappointments", "verified": true, "helpfulness": "1/5", "author": "james malone"}, {"rating": 5.0, "review": "Bought it for my daughter who loves being able to stream YouTube and downloads to her flatscreen from her tablet.", "verified": true, "helpfulness": "0/0", "author": "Lucas123 \"Lucas\""}, {"rating": 5.0, "review": "This is the coolest device and such a great deal for in home entertainment! I enjoy having it, especially when I can't find anything to watch even with cable.", "verified": true, "helpfulness": "0/0", "author": "Lisa L. Marino \"Lisa M\""}, {"rating": 4.0, "review": "Fantastic as a Youtube player.  HBO GO interface is nice too.  Works good for netflix however no autoplay.  Having a tablet interface for the tv is really nice.  I hope this product continues to receive new features.  Sure wish it had Amazon Instant Video!", "verified": true, "helpfulness": "0/0", "author": "Jon Bon \"JonBon\""}, {"rating": 4.0, "review": "It is nice little useful product. However, it has space to improve in its performance and usability. I would recommend this product to my friends.", "verified": true, "helpfulness": "0/0", "author": "Arun Upadhyay"}, {"rating": 5.0, "review": "Nearly Perfect but deserves a 5 star review. Very easy to install. Plus into an HDMI connector. Requires power. Either plug the other end into a USB or a wall outlet. Casts from the browser. Google Play and Youtube work 100%. Other sources are coming online but not so much. You can also use it to cast Powerpoints and Office Docs during presentations. Much more eco than a projector.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"LABMONKEY\""}, {"rating": 5.0, "review": "Very nice device, turn any TV into a smart TV controlled by any smartphone, tablet or wifi computer. Not only would I purchase one again, I've bought 4 for various family members. Others who have seen my chromecast in action have purchased their own. For 35 dollars it really sells itself!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The concept is great, I love streaming internet to my tv - especially for youtube stuff.  The issue is that every time you restart your computer the chrome browser forgets you have this installed, so I have had to run setup every time.  Really more of a pain than it was worth.  It gets 3 stars since the product was good though.  I wish firefox would come out with something like this.", "verified": true, "helpfulness": "1/1", "author": "Travis Rausch"}]