[{"rating": 2.0, "review": "This was the single coolest piece of technology in our home until recently. After about a week of use, our aps started closing, videos on amazon and netflix won't play or stops playing at any point. After contacting customer service we were given a list of things to try. All work, at first. We do soft resets (unplugging for 30 second or longer), force close aps, clear the data and the cache on every ap, and finally do a complete system restart (reset it to factory settings), and resetting our internet connection. We now do all of these DAILY. if amazon does not fix this promptly, we're sending it back. HIGHLY disappointed.", "verified": true, "helpfulness": "1/1", "author": "Amber"}, {"rating": 2.0, "review": "I was so excited to get this but EXTREMELY disappointed when I got it. Great box and built well. Works great and easy to set up. My main issue is that the free and paid programs are all mixed together and then the ones that are free are slim and shows that no one wants to watch anyways. Very disappointed in amazon!!!!!", "verified": true, "helpfulness": "1/2", "author": "jenniferg"}, {"rating": 5.0, "review": "too bad you can't call a video from Netflix.  other than that,  an awesome piece of work.  much faster than and looks and sounds better than the \"smart\" Sony Blu Ray player that i had been using", "verified": true, "helpfulness": "0/2", "author": "3 boojums"}, {"rating": 5.0, "review": "OK that title is just a little misleading.  Yes the screensaver is fantastic.  But setup is a snap and the voice search is soooooo much easier then trying to enter keys.  There appears to be a lot of free content to Prime subscribers (you'll see the Prime banner).  Really, shame on Apple for not having done this.  And of course it makes great business sense for Amazon.  A great product.  We've had it for two months and it works like a charm.  Well done Amazon!I haven't checked out the games yet so will update this at some point, but really, just buy it, great device.  Streaming in instantaneous.", "verified": true, "helpfulness": "1/1", "author": "Joe Danville"}, {"rating": 3.0, "review": "It is not always clear when a program I select is going to cost money.  There should be a pop-up verifying that I want to spent the money.I like the voice recognition.  It seems to work well.  Lots of  movies/programs to choose from.", "verified": true, "helpfulness": "1/1", "author": "mottster"}, {"rating": 2.0, "review": "I just received my package in the mail and I am disappointed that I won't be able to use it until I go out and buy a part that is essential for function. This is the only electronic device I have ever purchased that didn't come with the necessary parts for use. Directions say that you simply plug it in and you're good to go but that's only the case if you've purchased the cable that is not included. I wish Amazon would have made in clear that the cable necessary for function is not included and that you must purchase separately.", "verified": true, "helpfulness": "0/2", "author": "Kindle Customer"}, {"rating": 1.0, "review": "We have difficulty getting the fire to work correctly. It often wont stream netflix but if we stream netflix on our laptop or ipad we don't have any problems. Also, since we got the fire our home network has been acting up. I don't know how it would be related but nothing else has changed.  We were successfully able to watch one show with the fire.  I unplugged it today and have no intention of using it again.  I am very disappointed and wish I never purchased this.  It was a waste of money", "verified": true, "helpfulness": "3/7", "author": "Sarah A. Ballard"}, {"rating": 5.0, "review": "Just received it and have tried it out on a few movies on Prime. I simply plugged it up and turned it on and its ready to go. Right off I noticed no delay like is common with other product from a different vendor. I'm using an amazon hdmi cable to connect the box to the tv and the box connects to my encrypted wireless network. All without issue.  Now if amazon continues to offer good content this product looks like it will be a no brainer for anyone looking for a internet tv device.  I would buy again without issue.", "verified": true, "helpfulness": "0/1", "author": "EC"}, {"rating": 5.0, "review": "This is great; it is startlingly good!  It arrived promptly, was easy to set up, and works beautifully. Plus, the device itself is tiny.", "verified": true, "helpfulness": "0/0", "author": "V. McCrady \"Writer\""}, {"rating": 5.0, "review": "I love fire-tv.I have only had it a short time but im just cratching the surface of what is available to me I know.All in good time but so far I am enjoying it immensely.I am a movie and good tv show junkie so just exploringthat right now.", "verified": true, "helpfulness": "0/0", "author": "Leo L. Burns \"blood red\""}]