[{"rating": 5.0, "review": "It's perfect and I love the price. It should just get better and better with upgrades. Worked flawlessly out of the box.", "verified": true, "helpfulness": "0/1", "author": "A. Helfrich"}, {"rating": 3.0, "review": "The concept and its functionality is excellent, but this device has no meaning at all if there's no integration with other apps. Video streaming it's way more than Youtube and Netflix... I'm starting to feel that Google's promises of more integration are not coming to reality!", "verified": true, "helpfulness": "0/0", "author": "Santiago Zapata"}, {"rating": 2.0, "review": "Having a LOT of setup issues. My tablet won't connect so i had to buy a dongle for my PC despite my wireless router. Too simplified for my tastes and i hear it doesn't support a lot to watch atm. The silky packaging kept my from using it for a while, so attractive, nice accessories and lucky i have a USB port to power it (barely mentioned before purchase).", "verified": true, "helpfulness": "0/1", "author": "John"}, {"rating": 4.0, "review": "I would love it but for one problem.  It interferes with other electronics.  In this case it interferes with television cable reception and playback of my DVR.  Clearly this device was not tested by the FCC or truly tested by Google.", "verified": true, "helpfulness": "0/0", "author": "Johnnie"}, {"rating": 1.0, "review": "The image quality is excellent, but it fell behind my expectation when I compared with Samsung all share cast. It works just with You tube and Netflix, but it's  very poor working with google extension and other apps.", "verified": true, "helpfulness": "0/1", "author": "Gaston Jimenez"}, {"rating": 5.0, "review": "I bought 2 of them, used them every day. I no longer use the 35' HDMI cable to connect the PC and the Big Screen TV. Even better I can use my smart phone to control the youtube and watch the youtube videos on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Raymond"}, {"rating": 5.0, "review": "Give us more apps. And think worwidely. We love it but we need more from the device. And say to the Netflix people to improve their app to watch series continuosly", "verified": true, "helpfulness": "0/0", "author": "felipe binimelis"}, {"rating": 5.0, "review": "Fantastic quality, really easy to use interface and outstanding installation process. really happy about the quality/price relation. You won't regret", "verified": true, "helpfulness": "0/0", "author": "Matias Alberto Paterlini"}, {"rating": 3.0, "review": "This is coming from the view of a mac user, so it will be different for pc users.So i picked this up to take with me when i travel so i can push media to what ever tv i am using and for this it works great. Its very portable but i own a newer tv (about a year old) and it met the requirement for being able to power the chromecast without using the usb but i lucked out and it still needs the usb power supply, no big deal. This is a great buy for $35 and i've read many reviews that compared it to an apple tv (which i also own) but after using it for a few days i can't see how this is comparable. People compare \"casting\" to \"airplay\" and the two aren't the same.  When you \"cast\" something it only displays whats in the tab and when you go full screen (for a video thats not netflix or youtube) it can't do anything else since the full screen, well... fills the screen and it only mirrors at 720. For \"airplay\" when you want to display something you just extend the screen drag it over and when you go full screen it still allows you to use your mac and it will be in the same resolution as your tv (assuming your not using a 4k tv). Also airplay makes the phone into a controller for certain iphone games. So to compare the two seems silly to me. Also the apple tv has the apps built in and has a better interface than any phone. Yet for the price i love the chromecast, its cheap, simple and very portable but its definitely not going to replace my apple tv.I gave it 3 stars since i can't go full screen without losing the ability to do anything else on my mac and since it only mirrors at 720 but again i only bought it to use for traveling and maybe on the bedroom tv. Google is a great company so i'm sure that these issues will go away with time and when they do i will change my review but as of now it is what it is.", "verified": false, "helpfulness": "0/0", "author": "C.Strawn"}, {"rating": 5.0, "review": "I have used it for a couple of weeks now. It works perfectly. And I didn't even need the extension that came with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "JTK"}]