[{"rating": 5.0, "review": "For a inexpensive product the Chromecast earns its value almost immediately. I own an LG SmartTV that does not have HBO Go as an available app so the Chromecast was able to correct that problem for me. I purchased two of them so that I can stream shows in my bedroom which doesnt isn't smart tv enabled. Thanks Google.", "verified": true, "helpfulness": "0/0", "author": "Craig S Davis"}, {"rating": 5.0, "review": "A great perchase with such bang for the buck. The only downside is that there is not too many apps for it yet but what I hear is there are more coming soon.", "verified": true, "helpfulness": "0/0", "author": "DelDaOutdoorsman"}, {"rating": 5.0, "review": "at first, its no great, but stream from internet and control it from your cel is better than it sounds. A cool toy.", "verified": true, "helpfulness": "0/0", "author": "Rocco Gallo Citera"}, {"rating": 5.0, "review": "Absolutely love it. Everyone in the house finds it very useful. Easy to install and in some cases automatically syncs your devices.", "verified": true, "helpfulness": "0/0", "author": "jamie perry"}, {"rating": 3.0, "review": "I was so excited to get this at Christmas, and was kind of disappointed, but I can't be for sure if it's my internet or the actual product.  The connectivity is slow and has a lot of errors.", "verified": true, "helpfulness": "0/0", "author": "Gwinna \"gwinna\""}, {"rating": 5.0, "review": "Works great and easy to use!  Would recommend to anyone wanting to stream easily.  Works great on our outdoor tv that has no cable box to it.", "verified": true, "helpfulness": "0/0", "author": "Amanda Fanson"}, {"rating": 4.0, "review": "Love the chromecast! Works great with netflix, you tube, etc... only wish you could play any video from other sources.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"ML\""}, {"rating": 5.0, "review": "I got this because my son try before, and his recommended for my grandson because they got more choice for get more movie or cartoons in tv", "verified": false, "helpfulness": "0/0", "author": "Carmen Alcantara"}, {"rating": 4.0, "review": "Good price and useful, but even a very nerdy guy helping me had difficulty getting this to work.  But once it works, it works fine.", "verified": true, "helpfulness": "0/0", "author": "Tums"}, {"rating": 5.0, "review": "Excelent device, competes with items many times its price and it does what it is supposed to very well. Very easy to use!", "verified": true, "helpfulness": "0/0", "author": "filip"}]