[{"rating": 5.0, "review": "The best streaming media player on the market!", "verified": true, "helpfulness": "0/0", "author": "Sean A. Hill \"SeanMaster\""}, {"rating": 4.0, "review": "Works great as a media streaming box, with a few caveats:1. Netflix still has no voice search capability, so its rough to search for things without a keyboard. But you can attach a keyboard, so, not a massive negative.2. I like that you can sideload android apps via ADB, but its kinda lame that they don't show up in recent apps unless they are \"Amazon approved\" apps. There are ways around this (use Llama to launch a non-approved app when an approved app is launched) which make it not a massive negative either. I would also like to see a task manager or task switcher, but I guess it's asking a lot.3. No hardware decode support for some older codecs, but this is a small negative as well since there isn't a huge amount of content out there in VC-1. At some times, video playback on XBMC is a bit laggy, especially older formats (vc-1, wmv, or flv video) but mostly everything in h.264 plays back smooth as butter, so that's great.This has basically replaced my HTPC in my bedroom, and does pretty much everything I need it to do. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "DJ Zeratul"}, {"rating": 5.0, "review": "i love this little box.This thing is fast,but when i look up a prime move it sometimes takes me to the ones that i have to buy. I dont wont to buy a movie that why i have this,  If amazon could fix that it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 5.0, "review": "It's fast simple great apps to download it's a whole entertainment system it's like why do I need cable spending hundred dollars a month when I can spend hundred dollars a year", "verified": false, "helpfulness": "0/0", "author": "Janessa R."}, {"rating": 5.0, "review": "Works great - can use it with HDhomerun (silicon dust) to watch TV using a small app - not possible on other streamers", "verified": true, "helpfulness": "0/0", "author": "COE \"COE\""}, {"rating": 3.0, "review": "The Fire TV is a good streaming box, but it has alot of shortcomings.-No Comcast Support for HBOGO or Showtime.  The Roku does.-The Fire TV is a data hog.  It will consume alot of data over the internet.  Beware if your internet provider has data caps.- The Fire Tv screen gives priority to the Amazon Store and Prime.  Netflix and other video services are buried and not easy to access without several clicks.-No USB or. DONA supprot for media files.  The Roku does.I like the FIRE TV, it still needs alot of work.", "verified": true, "helpfulness": "2/2", "author": "B-Brewer"}, {"rating": 5.0, "review": "It is such a easy set up, Love Love LOVE the remote...so easy to use.  It seems very nice to navigate as well.  I would like though just a simply Q&A;  section.  easy to find info...I had to do search on how to turn off, FYI it automatically turns is self off.  I would have liked to know that, not spent 20 mins looking for it.  Set up great easy as pie, yes but after that your kinda left hanging...Did not care for that.I will say this going through all the selections that Fire TV has and I am loving it.  I love that there are Trailers to watch if you want.  It makes it AWESOME!I had to do some searching to find out that you can just find Prime movies and TV.I am sure the more I use it the more Pro's and Con's But as of Right now....Love it, it Rocks", "verified": true, "helpfulness": "0/0", "author": "Big Amy"}, {"rating": 5.0, "review": "Love my new toy.", "verified": true, "helpfulness": "0/0", "author": "Weldon Forde"}, {"rating": 5.0, "review": "Great way to watch movies and TV. I also like the ability to turn on subtitles.", "verified": true, "helpfulness": "1/1", "author": "GP"}, {"rating": 5.0, "review": "I took a chance with the Amazon Fire TV.  I really like it for the following reasons:Much quicker than my \"smart\" blue-ray player,  more, channels on the Amazon Fire, easier to use, wireless & wired network connections and new channels that have been added since I purchased the Fire TV.One of my better purchases this holiday season.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]