[{"rating": 4.0, "review": "I'm actually quite pleased with the Amazon Fire TV. Its compact unit allows for easy display and setup was simple and quick. No longer having to steam through my laptop frees me up to do my work for my job on the computer  while directly streaming movies and tv episodes to my television. The remote control with voice command is a wonderful feature that helps weed through excess  programming when I have an idea of what I want to view or listen to immediately.  The one and only reason I did not give this device five stars is because it requires a power source to work. I've become a lot more conscious of the environment and more frugal on utility expenses and because of this, I would have preferred the necessary connections not to have required an additional pull of electricity. However, it is still recommendable.", "verified": true, "helpfulness": "1/2", "author": "Zelly"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "Thomas R. McKnight"}, {"rating": 4.0, "review": "Has performed as expected with one glitch, it lost its Internet connection on prime movies while other apps continued to work normally", "verified": true, "helpfulness": "0/0", "author": "fourDs"}, {"rating": 5.0, "review": "Easy to set up and instantly turned my non smart TV into a smart one. Love the Amazon choices and the large icons.", "verified": true, "helpfulness": "0/0", "author": "Sandor Stern"}, {"rating": 5.0, "review": "Much more than expected, fantastic. Easy connection, wonderful selections.", "verified": true, "helpfulness": "0/0", "author": "Ronald C Lewis"}, {"rating": 5.0, "review": "Starts up quickly, has worked pretty much flawlessly since we got it.  Much better than the \"Smart TV\" function on my Samsung TV.  Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Jim Crawford"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Mallik"}, {"rating": 2.0, "review": "Only two stars due to the device being crippled via the eFuse bomb.", "verified": true, "helpfulness": "0/2", "author": "Joe"}, {"rating": 5.0, "review": "I absolutely LOVE my Amazon Fire TV.  It is so awesome.  I used to have Apple TV; no longer.  The Amazon Fire TV is much,much better and the remote is easier to use.  With Amazon FIRE TV there are no delays in streaming ever.  Movies, Music...everything is available.  I rarely ever use the Cable channels anymore!!!", "verified": true, "helpfulness": "1/1", "author": "Dot1of9"}, {"rating": 5.0, "review": "This thing rocks! I got it for PLEX and its great.", "verified": true, "helpfulness": "0/0", "author": "P. Barkett"}]