[{"rating": 4.0, "review": "Chrome cast is almost perfect, turning my big dumb TV into a Netflix showcase.  I just wish more apps supported it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Google's Chromecast HDMI Streaming media player currently falls short of my expectations as the capabilities are severely and possibly intentionally lobotomized by Google. The hardware design is very well capable of doing more but the software currently limits these capabilities. This is otherwise a very innovative product.All you get currently is the ability to cast YouTube, Pandora, Google Play music, Google Play Movies, Huluplus, Netflix, HBO Go, Vevo, Redbull TV, Songza, Plex, Post TV and host of other apps that might get added in the future. Casting is possible only with Google chrome browser on desktop PC running windows 7 & Mac but also requires 'chrome' extension app known as GoogleCast.There is an 'experimental' feature that adds the capability to cast the whole desktop which is very useful. The video and picture quality is 'average' at best. There is some noticeable lag and certain video quality are seen to be severely hampered depending on how fast your wireless network runs at. Having said, casting the whole desktop can be useful at times and might justify the purchase. You cannot cast anything yet from Android phones & tablets (Other than some limited apps like YouTube).The limited choice of apps (Which again might cost you money for streaming services) that this device supports currently does make this an ideal streaming media player. There are many more capable streaming media players in the market that costs a fraction more but does much more than this chromecast device from Google. If Google ever opens this device up for 'Wi-Fi' direct file transfer for display of local media from Android tablets & phone also make it 'DLNA' complaint to allow for local media streaming may be I will reconsider this purchase.", "verified": true, "helpfulness": "0/0", "author": "rbhatta \"A Dinosaur you can trust!\""}, {"rating": 3.0, "review": "not happy with picture and sound -- jittery picture and delayed voice - not sure how to fix it yet.", "verified": true, "helpfulness": "1/1", "author": "RoxanaRose \"Britcom addict\""}, {"rating": 5.0, "review": "Google nails it again. Setup is easy. Easy to use. Connection doesn't go in & out as you might expect with this product.", "verified": true, "helpfulness": "0/1", "author": "Bill_Felix"}, {"rating": 1.0, "review": "I bought this primarily to cast the content from the chrome browser. I am very disappointed that it did not work properly. The connection keeps dropping or freezing. This is a bad product design.  I did not try the other apps becasue I already have them on my connected TV device. I have returned it and will not recommend it to any one.", "verified": true, "helpfulness": "11/14", "author": "N. Shahi"}, {"rating": 4.0, "review": "I gave it 4 stars because although Chromecast does the job it was advertised to do very well, it cannot cast everything to the TV.  Google makes it clear that Netflix, YouTube, Hulu+, Google Play Movies and Music, Pandora, and the Chromecast extension on its Chrome browser are supported.  It would have gotten all 5 stars had more streaming services been supported at the outset.  I'm confident more services will be supported now that Chromecast's popularity has soared.Many reviews already discuss the technical issues in depth.  I was curious to see what all the buzz was about since I don't like to watch movies on a computer monitor. I've never used a Roku, Apple TV, or any other video streaming device.  Setup was quick and painless. It's connected to one of the HDMI inputs on my home theater A/V receiver (rather than to the TV itself). I've been using this for a month.  There were a few hiccups in the video output in the first days of watching Netflix.  The company, however, updated their Android app.  Now the occasional video stuttering is a thing of the past and I can only attribute it to the app update and not to Chromecast itself.For Netflix and YouTube shows that are in HD, video quality is excellent.  I raved about this to my friends.  So guess what.  Now 4 of them got Chromecasts to watch Netflix and YouTube on their big screens because they too had no desire to watch videos on their computer monitors.  For something that works so well that is so inexpensive, there is real value in this small device.  And for only $35, where can you go wrong?", "verified": true, "helpfulness": "0/0", "author": "DChang"}, {"rating": 1.0, "review": "Product description leaves a lot to be desired. The unit will only work with a wireless signal using the Chrome web browser from a laptop with Wi-Fi or a cell phone app routed thru your wireless router, not IE or Firefox on a PC with a LAN connection. That in  and of itself boggles the mind. And even if you use Chrome, there is further detailed programming that needs to be enabled to get it to work. While I don't doubt it works, I gave up after 2 tries working with Google tech support because of my impatience with the product. I am a former communications tech with NEC who worked with VOIP the last 7 years of my employment before retirement and this is not user friendly when it comes to implementation. The dongle is not self-powered but needs to be connected to not only your TV's HDMI port but also to an attached transformer with a short power cord. Do yourself a favor and spend another $70 and get a Roku unit if your TV/DBD player doesn't have a streaming video feature.", "verified": true, "helpfulness": "3/5", "author": "Vito Colletti"}, {"rating": 1.0, "review": "Terrible. Lag when streaming from PC. Some websites it does not even show video so what's the point of this device? Returned.", "verified": true, "helpfulness": "1/2", "author": "H. Do"}, {"rating": 4.0, "review": "Pretty cool device. I like that I can now stream things to a TV that doesn't have internet capabilities with this. I also don't need a computer or anything like that. It works pretty well and I like that it works with different devices.", "verified": true, "helpfulness": "0/0", "author": "Cesar Reyes"}, {"rating": 5.0, "review": "Seamless setup. Works as promised. Would like to see more applications available and integrating \"cast\" functionality, but even with Netflix, Play Movies, and Chrome it is worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Andrew Crichton"}]