[{"rating": 5.0, "review": "I needed one for the bedroom tv too. Tried to buy from other unsatisfied customers but they changed their minds. Just waiting for more apps to become available", "verified": true, "helpfulness": "0/0", "author": "Dreaded1"}, {"rating": 4.0, "review": "After several weeks of owning this item I have found it easy to set up and use with good transfer of video quality. Didn't give it 5 stars because sometimes the play/pause button doesn't seem to work.", "verified": true, "helpfulness": "0/0", "author": "MGD"}, {"rating": 3.0, "review": "Not so easy to use as it says.  Had some trouble access the google chrome from my laptop.  Would only suggest use for presentations or by more advanced professionals.", "verified": true, "helpfulness": "0/0", "author": "Theresa M."}, {"rating": 4.0, "review": "GOOD ITEM!INSTRUCTIONS WERE NOT CLEAR AS A RESULT OF NOT HAVING A GENERAL ROUTER LISTED!ONCE RESOLVED WITH GOOGLE SUPPORT STAFF, IT WORKS FINE. GOD BE WILLING IT WILL CONTINUE TO WORK.", "verified": true, "helpfulness": "0/0", "author": "keith Snyder"}, {"rating": 3.0, "review": "This is a well designed product.  Getting it connected to the TV and my network was very easy.  At this point the only included apps are Netflix and Youtube.  You can cast from your portable devices / laptops though only certain content can be used.  This is a nice product with a ton of potential but is somewhat limited at this point by the lack of content.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 2.0, "review": "I am still trying to get it to work...the set up seems easy but I have been having a difficult time connecting.", "verified": true, "helpfulness": "0/0", "author": "Amber Lane"}, {"rating": 3.0, "review": "Needs more apps to make it a must have device. But for now I'm pleased with it. It's inexpensive toy", "verified": true, "helpfulness": "0/0", "author": "Vasi"}, {"rating": 5.0, "review": "they like it cuz there are no wires.  they use it with their nexus 7 tablet and like the convenience of it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Youtube keeps disconnecting in the middle of the video play when controlled with my GS4? However Netflix works great! I still like the product though.", "verified": true, "helpfulness": "0/0", "author": "Raul"}, {"rating": 5.0, "review": "This is an awesome device; for the price, everyone should own one even if you already have a \"smart\" TV.", "verified": true, "helpfulness": "0/0", "author": "Matthew Klaus"}]