[{"rating": 5.0, "review": "We love our Amazon Fire TV! I am not particularly tech-savvy, so the ease of set-up and use exceeded my expectations. I had to use the factory reset once when I changed my Amazon password, but everything else has been great! It's very clear which programs & movies are included in my Prime membership. I like how small and unobtrusive the device is, and my young son and I love the voice command! Thank you for making a simple but effective device that lets me make full use of my Prime!", "verified": true, "helpfulness": "0/0", "author": "Kelly W. Mendez"}, {"rating": 3.0, "review": "Yes it's fast when you want to watch a movie. I was hoping for a feature where you can use airplay to stream apps from your iphone to the tv. Hope Amazon can make this happen soon !", "verified": true, "helpfulness": "0/1", "author": "Marissa Tudtud"}, {"rating": 5.0, "review": "Love this thing!!!! Works flawlessly. Exceeds expectations!", "verified": true, "helpfulness": "0/0", "author": "Bethanie"}, {"rating": 3.0, "review": "Was told when I bought it that there was a bunch of movies free but there was not most of them u have to rent for 5 dollars for every 24 hours not happy", "verified": true, "helpfulness": "0/2", "author": "Jc Tuttle"}, {"rating": 5.0, "review": "We LOVE our Amazon Fire TV!  We are going to discontinue our TV service we currently pay for since we can never find anything on the channels worth watching. The voice search is excellent and the system is easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "sandy73625"}, {"rating": 5.0, "review": "Easy setup, great sound on my 7.2 home theater.", "verified": true, "helpfulness": "0/0", "author": "Jack K. \"XMfan\""}, {"rating": 5.0, "review": "loved it", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "This is a cool device. It interprets voice commands as well or better than anything out there. Combined with Prime and Netflix, it gives you just about as much \"free\" viewing as you could want. And best of all (assuming the marketing pitch is reasonably close to honest - big assumption, I know), it will learn and get better. I'm certainly satisfied. I'm not blown away, mind you. But I'm not about to knock off stars for missing expectations.", "verified": true, "helpfulness": "0/0", "author": "tdbach"}, {"rating": 5.0, "review": "Easy to use and so far I'm hooked on 'The Americans', and nothing is getting done around here!", "verified": true, "helpfulness": "0/0", "author": "Carol Ryan \"Right Now Is Perfect\""}, {"rating": 1.0, "review": "I'm still exploring. So far I am absolutely thrilled with all the availability.", "verified": true, "helpfulness": "1/7", "author": "W. Richards"}]