[{"rating": 5.0, "review": "Wish was a audio solution....come on Google an easy add here..... ok Google (wait my smartwatch just woke up ... if your TV has audio out - mine has digital optic out - it streams audio just fine. You have to have your TV on but I quite often use music stations on my cable TV. Hooked into the back of my audio reciever I now can stream audio throughout my house and my phone is now my remote. Now 5 stars! Much easier to set up than Rocki which is supposed to do the same thing but is just so painful to set up.", "verified": false, "helpfulness": "1/1", "author": "P. Nicholson"}, {"rating": 1.0, "review": "It kept dropping off the network and I couldn't reconnect to it because it would not show up to cast. Did a factory reset on it like 3 times and would still do this. I ended up returning it for a refund. Would not recommend it to anyone especially college students living in residence halls.", "verified": true, "helpfulness": "1/1", "author": "Sonia Moreno"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Ender Salas \"Dreck\""}, {"rating": 4.0, "review": "Nice", "verified": true, "helpfulness": "0/0", "author": "Wilbert"}, {"rating": 5.0, "review": "is nice and very cool", "verified": true, "helpfulness": "0/0", "author": "daniel aldaz casanova"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Micaha"}, {"rating": 4.0, "review": "Can get pretty much anything up on screen but not quite all.", "verified": true, "helpfulness": "0/0", "author": "Michael Heath"}, {"rating": 2.0, "review": "A little background, we are an Apple family. All Mac computers, tablets, and phones. We even have Apple TV in our bedroom and living rooms. However, our four year old has a small TV/DVD combo in his room that was intended to just play videos. Lately however, he has been asking to Netflix, pbs kids, disney channel content on his TV. Not wanting to drop another $100 on an Apple TV, I thought this would be a great solution. I will admit, setup was okay. Not totally intuitive (at least not for me) but I managed my way through it fairly easily. Upon set up, I've only gotten the device to stream video once. After that, it continues to say \"unable to connect\". I should state, we have a lightening speed internet connection due to the number of devices we use. Often times, nothing else is streaming while the chrome cast is running. I'm not sure the point of the device now if we can't get it to connect. Aside from that, the device doesn't really make concessions for wall mounted TV's that have USB/HDMI outlets behind the TV. The adapter that comes with it helps but does not allow the TV to sit flush against the wall any longer. Kind of a bummer all around. We will likely return it and spend a little extra for something that we know works.", "verified": true, "helpfulness": "0/2", "author": "Jaime"}, {"rating": 5.0, "review": "easy setup, great technology and fun to use. I only wish my 2 year old flatscreen had 8 HDMI ports instead of the 4 it came with. I use an HDMI switching box now to expand the number of inputs but thats kind of a pain.", "verified": true, "helpfulness": "0/0", "author": "WD \"WD\""}, {"rating": 5.0, "review": "Everything I thought it does", "verified": true, "helpfulness": "0/0", "author": "Malcolm Banks"}]