[{"rating": 5.0, "review": "Easy to setup and never had an issue with it", "verified": true, "helpfulness": "0/0", "author": "ElectroniCali"}, {"rating": 5.0, "review": "so far we are enjoying watching tv with it", "verified": true, "helpfulness": "0/0", "author": "mariluli"}, {"rating": 5.0, "review": "Easy set up. Works great", "verified": true, "helpfulness": "0/0", "author": "Ion"}, {"rating": 5.0, "review": "Getting more useful all the time!  Does a great job from both my phone and tablet.  Elegant solution.", "verified": true, "helpfulness": "0/0", "author": "rob"}, {"rating": 3.0, "review": "Hard to connect sometimes", "verified": true, "helpfulness": "0/0", "author": "Brinie13"}, {"rating": 2.0, "review": "Did NOT work with my router!! I have NEVER before had any problems with devices connceting to my router but this device is very picky and only works with a limited number of routers. The product description should make this clear. Very disappointed! Needless to say i returned it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very usefull little gadget, with very good build quality. It's easy to stream things from the notebook browser, yet easy to use with your Android phone or Apple iPhone. Would like more streaming options for the iPhone: you can stream your camera roll or videos directly with the Chromecast app. There are third party apps to do that, but the workflow is not so good.", "verified": true, "helpfulness": "0/0", "author": "Fernando Melo Faraco"}, {"rating": 4.0, "review": "Enables you to cast to your TV what you see in your Smartphone, Tablet or PC. Simple to setup, Netflix, Pandora, ESPN etc access. Can control from your Tablet or Android phone. Small, fully portable and priced just right.", "verified": true, "helpfulness": "0/0", "author": "CC"}, {"rating": 5.0, "review": "I love this thing. Simple setup - simple controls. Noticed it has some issues with Ubiquti routers (what I have) and had to do some forum digging about a config change and since then - smooth sailing. I cut my cable cord and switched to the internet world and this works wonders.", "verified": true, "helpfulness": "0/0", "author": "Noah B. Ross"}, {"rating": 5.0, "review": "casting is so much easier with this device.  I love that you can continue to use your laptop at the same time it's casting.  Can't beat that and It's easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Celeste Biegen"}]