[{"rating": 5.0, "review": "love this thing. works well. great way to get things from you computer to the tv. good price", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "Simple but awesome gadget, I don{t even need to pay for a monthly cable fee cause all I do is watch netflix and youtube. There's plenty of interesting apps for the chrome cast like Crackle to watch free movies and Jamo to play a kinect-style dance game.", "verified": true, "helpfulness": "0/0", "author": "Juan Camilo Jiménez"}, {"rating": 1.0, "review": "What a worthless P.O.S.Shame on me for not reading the full description before I jumped, but I did not realize there was no remote, and I had to use an iphone, ipad, tablet or other Android devise to control it (I have none of these)  NO support for Windows phone.I could drag out the laptop, but why bother, but when I did, it would not \"cast\" to my TV. (YES, I installed Chromecast)I am returning this and spending the extra $60 for a Roku 3. I am very highly disappointed.", "verified": true, "helpfulness": "0/0", "author": "ROBERT D. HUIZINGA"}, {"rating": 5.0, "review": "I think it's genius. Perfect at home or in a hotel where there's wifi.", "verified": true, "helpfulness": "0/0", "author": "Christy Anne"}, {"rating": 2.0, "review": "I don't like it at all , My apple tv works much better and even it has more features", "verified": true, "helpfulness": "0/0", "author": "Doniyorbek Tohirov"}, {"rating": 5.0, "review": "Very easy to setup and use. I was surprised by how simple it was to search for a video on youtube and then cast it to the chromecast. The only apps I have really used are the youtube and screen mirroring apps. There is an app called videostream for the chrome browser on your PC that allow you to stream local content (must be .mp4 based) to the chromecast. This was very handy. I would have used allcast on my phone, by I didn't want to pay for the app at the time, video stream appears to be a great alternative.I personally have no gripes about this device. Any shortcoming are typically the result of the software attempting to cast to the device.", "verified": true, "helpfulness": "0/0", "author": "Matt M"}, {"rating": 5.0, "review": "Chromecast is a life saver if you don't have a smart tv.  I have several older model televisions that only have an HDMI port and aren't \"Smart\".  So it was hard for me to connect to Netflix, Amazon Prime, Youtube, or Hulu plus etc..  Long story short, this device saved me from having to go out and purchase another tv.I am really satisfied with this device, I particularly enjoy being able to pick my movies out from an IPAD, Iphone, or android device.  Add the ability to que your content and this thing is spectacular.  Easily one of the best products for your TV ever made.", "verified": false, "helpfulness": "0/0", "author": "Dale Bowling"}, {"rating": 5.0, "review": "Great for the price. Turn a regular TV into a smart TV.", "verified": true, "helpfulness": "0/0", "author": "James Howard"}, {"rating": 5.0, "review": "Second purchase.  Used for Netflix mostly.  No problems.", "verified": true, "helpfulness": "0/0", "author": "Terrence M Goodale"}, {"rating": 5.0, "review": "It's good. I am using it.", "verified": true, "helpfulness": "0/0", "author": "Murali Pothireddy"}]