[{"rating": 5.0, "review": "Gotta love this little thing.  Can stream all kinds of stuff from any of my home devices (laptop, phone, tablet, etc...) and it is awesome.  I use Plex Media Server on my PC that has a lot of stored media and then I use Plex App on my tablet and phone to cast to Chromecast and let me tell you, this setup is AMAZING.  Plex and Chromecast is an epic win and makes playing my media throughout my house an incredibly pleasant experience.  Chromecast alone is pretty darn cool, well priced and it's tiny and easy to set up. Love it, recommended 100%!", "verified": true, "helpfulness": "0/0", "author": "don"}, {"rating": 2.0, "review": "I used it mainly to watch Netflix and Youtube, and was pretty happy with it for a few weeks, but |I have two of those, and they both stopped working after a month:(", "verified": true, "helpfulness": "0/0", "author": "Naji"}, {"rating": 5.0, "review": "great product. I like to chromecast. In the future i would like that it supports more apps and will have more functions.", "verified": true, "helpfulness": "0/0", "author": "Caleb Ortega"}, {"rating": 4.0, "review": "I have two LED tvs (which aren't Smart Tvs) and with the Chromecast I can turn my tv into a smart tv with much more capability.I used it for Netflix most of all but also to stream some photos and videos from my smartphone or tablet (Nexus 7).I like that it's not necessarily a predetermine system (iOS, Android, etc), I can connect more than one device to it to stream pictures, with the right app installed you can also use your tv screen as a drawing paper and much more to come.The only downside is that it can't show you your tablet screen on the tv screen and it can stream some predetermine apps, for instance if you want to stream a Youtube video or Netflix movie you can do it very easy, but if you want to stream a picture you have to download an app that lets you stream pictres from your device, otherwise you can't.Great in price - quality relation.", "verified": true, "helpfulness": "0/0", "author": "Armando"}, {"rating": 5.0, "review": "Bought this for my mom for mother's day. She watches a lot of movies and videos on youtube with your iPad so I'd thought it would be a great idea to hook it up to a TV so she wouldn't have to keep watching videos on a small screen. She absolutely loves it and has been using it since I got it for her. Set up took a bit with all the updating and syncing but once you're set up, it's easy to just connect any device and watch anything on your tv.", "verified": true, "helpfulness": "0/0", "author": "CuriousEggroll"}, {"rating": 5.0, "review": "This is the way to watch TV. We use it all the time and I love that you get to use your smart shone like a remote control for your television!", "verified": true, "helpfulness": "0/0", "author": "Lori Nunn"}, {"rating": 2.0, "review": "First thing to do: check the Chromecast Router Compatibility. I didn't and it can't work (only through a workaround) with my Apple base WIFI. The manufacturer should have emphasized this issue.", "verified": true, "helpfulness": "0/0", "author": "Carlos Eduardo G. R. Alves"}, {"rating": 5.0, "review": "This is a very useful to view movies from the internet and photo slides from my ipad or computer on the tv.", "verified": true, "helpfulness": "0/0", "author": "Mary P"}, {"rating": 5.0, "review": "For $30 you can't beat this device. It works perfect with HBO, Netflix and Hulu from my Nexus 7 and Nexus 10 Tablet. Love that fact that it gets powered on with your TV USB port, so the ac plug isn't required (This option isn't available for all tv's.)", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 2.0, "review": "I was happy with streaming after I first set it up. I bought it for MLB TV. Worked great. Next several days I could not get it to reconnect. I tried everything. I returned it to Amazon. Actually the refund hit my account the same day I took the package to the UPS store with the Amazon shipping label. My low rating is for the Chromecast  product, not Amazon.", "verified": true, "helpfulness": "0/0", "author": "C. J."}]