[{"rating": 5.0, "review": "This little thing is totally awesome!", "verified": true, "helpfulness": "0/0", "author": "E. Gutesman \"gutes\""}, {"rating": 5.0, "review": "Very interesting and useful!! Recommend for all!", "verified": false, "helpfulness": "0/0", "author": "Estevao Alves"}, {"rating": 4.0, "review": "pretty convenient and powerful little tool, though it does NOT support amazon prime yet unless you use the desktop google chrome casting feature.  Liked using it with netflix because you could do everything from your phone/tablet and didn't have to get out a laptop.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "for the price is an excellent articulo.yo think that if they raise their characteristics and maintains good price could better compete with apple tv and roku", "verified": true, "helpfulness": "0/0", "author": "carlosmatos"}, {"rating": 1.0, "review": "Product itself is a good idea. I never use it because connection of wifi is horrible.", "verified": true, "helpfulness": "0/0", "author": "scott castillo"}, {"rating": 4.0, "review": "It arrived on time and was appropriately package.  Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Judith M. Smith"}, {"rating": 5.0, "review": "The more time I have this the more apps I can use with it. Just gets better and better.", "verified": true, "helpfulness": "0/0", "author": "greekman34"}, {"rating": 4.0, "review": "works good", "verified": true, "helpfulness": "0/0", "author": "Chalice Stout"}, {"rating": 2.0, "review": "I bought this for my apartment at college to watch Netflix and things on. I was really hoping tv apps like CBS, ABC family, TNT and etc would work on it and none do. The apps that work with cromecast are VERY LIMITED! Basically it's only good for Netflix n YouTube. It says you can strem from Google Crome browser but it lags so bad and doesn't work at all. Also my cromecast is always having problems connecting to a device. I have to constantly unplug it and reconnect to the wifi on the device and on the cromecast and it's a pain. I'd rather just use my wii or play station to watch Netflix and stuff", "verified": true, "helpfulness": "0/0", "author": "K.Wallace"}, {"rating": 5.0, "review": "Simple, replaced a $200 Samsung blue ray player/media player. This is only $35 and have my media through Plex. Unreal. Also great for watching \"adult\" movies straight off your phone.", "verified": true, "helpfulness": "0/0", "author": "anointed_alien \"Tarzan\""}]