[{"rating": 1.0, "review": "This Media Player did not work for me because I did not have a laptop or a Tablet.  If I did I am sure that it would of worked fine.  I sent mine back to amazon.", "verified": true, "helpfulness": "0/4", "author": "William J. Colgan"}, {"rating": 5.0, "review": "I wasn't sure exactly what the device did, it is very hard to explain, seeing in action is best way to test. At 35 bucks I knew if I didn't like it reselling would not be an issue, I still have it connected with no intention of selling.", "verified": true, "helpfulness": "0/0", "author": "phil"}, {"rating": 5.0, "review": "Works great with my phone and tablet. It is easy and fast to set up too. I should have gotten two.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "i love how you can cast anything google based to your tv! i think it was worth the money to me", "verified": true, "helpfulness": "0/0", "author": "sheila faulk"}, {"rating": 5.0, "review": "This is the best bang for your buck. I have been looking for a non-complicated way to mirror my screen on my Mac without spending an arm and a leg and well this is it.- 1. You can simply mirror you screen- 2. Other wise for Youtube, Netflix, and just about all of the popular video sited allow a special viewing as if your Chromecast I'd the hub running the apps and you control it with your cell, tablet, computer, etc.- 3. ITS $35......I mean come on if you are like me and Judy want a simple screen mirroring system and not all that, it's not compatible crap, this is it.Try it you will be pleasantly surprised", "verified": true, "helpfulness": "0/0", "author": "Joshua J"}, {"rating": 5.0, "review": "Allows you to stream Google content such as YouTube  from your PC, tablet, or phone, and also has some new apps arriving over time. Just remember this is no substitute for a Roku or Apple TV.", "verified": true, "helpfulness": "0/0", "author": "John Ferguson"}, {"rating": 5.0, "review": "I am amazed by this product. It's a perfect package. So easy to install. Cast to your device from any device, including chrome browser on a pc, and apps on your iphone. You can cast the browser session onto the device, which is nice. However the animation has a delay. So playing videos isn't the best experience. However for apps like netflix, you can open netflix on the chrome browser and cast the video to the device. There are many apps now that can be cast to your device which is really nice. With chromecast, you don't need to keep the video playing or the app on the foreground on your control device. I have a samsung smart tv and I have been frustrated with how difficult it has been to use the apps on the smarthub. For example netflix keeps deactivating and netflix customer support said that they are actively working with samsung to resolve this issue and they haven't fixed it for an year now. Installing other apps on samsung smarthub is also cumbersome and time consuming. Opening smarthub takes 30 seconds each time and opening netflix app takes another 30 seconds. Now with chromecast, I am never using smarthub again. With Chromecast, I can cast video and music from apps like netflix, pandora, hulu and songza. Some of the apps allow you do cast videos on your iphone to your device. Some people here have written reviews that they couldn't cast videos on the device to chromecast. But there are apps to do that. Overall I love the product and hope for more cool apps that support chromecast.", "verified": false, "helpfulness": "2/3", "author": "Rajesh Konda"}, {"rating": 5.0, "review": "My dad has been watching Netflix on his Bluray Player for a few months, but he loves watching HBO, so this device was the perfect Christmas present. Using his phone (Galaxy Note 2), he can effortlessly stream episodes of Curb Your Enthusiasm straight to the TV. Set up required basic laptop profiency (which I handled) and took about 3 minutes.Once the chromecast has been set up, streaming content is very easy on android. The button that allows for streaming to the chromecast automatically pops up when playing videos in compatible apps (HBO Go, Netflix, Youtube, etc.). Pretty effortless and minimal learning curve. Google did a great job on this one", "verified": true, "helpfulness": "0/0", "author": "David T"}, {"rating": 5.0, "review": "This doesn't replace an Apple TV, but since we only have a Wii on the living room TV, we weren't able to HD Netflix to the living room. Now we are able to, just run it from your phone, and you're set.Setting up is a snap! I take it with me to my friends house where they don't have Netflix, and bam, free HD Netflix on any TV anywhere.Quality product.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "The interface is simple and easy to use. Apps are currently a little limited, but Google is likely to expand what's available over time.", "verified": true, "helpfulness": "0/0", "author": "Jessica"}]