[{"rating": 1.0, "review": "I've spent hours trying to get this thing to connect to my home wi-fi network.  I've tried with 3 different brands of wifi routers all of which work fine with my other devices (laptops and cell phones).  It worked slowly for a few minutes at one point... but even after a hardware reset I have been unable to get it working again. I like the concept, but for me it was a complete waste of time.  If you're only trying to do something that can be done on a Roku (i.e. Netflix, Amazon Prime, etc) save yourself some headaches and just get the Roku, it actually works.", "verified": true, "helpfulness": "32/41", "author": "Salt Miner"}, {"rating": 4.0, "review": "More content would make it an ever greater value. To use the smart phone or tablet as the remote is so convenient.More content providers will pile on over time. For now, it is limited to Netflix, Google Play and YouTube.", "verified": true, "helpfulness": "0/1", "author": "John Meyer \"gas passer\""}, {"rating": 5.0, "review": "The Chromecast is super easy to use. I can watch YouTube, Netflix, Google Play Movies, Google Music, and most anything I can watch on my pc. You use either your smartphone, tablet, or pc to control the device.The setup process is really easy. That said, I had trouble getting it to connect to my router. The problem turned out to be a setting on my router.Best $35 I've spent.", "verified": true, "helpfulness": "1/3", "author": "pveoq"}, {"rating": 1.0, "review": "I just spent three frustrating hours trying to connect the Chromecast device to my router. I discovered that Chromecast does not work with my Netgear 600 router. I will send it back tomorrow.", "verified": true, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Many more products like this, and much of the pay-for-view TV business will be out of work!  Besides, they overcharge, and this product works!", "verified": true, "helpfulness": "0/3", "author": "RiverWisdom"}, {"rating": 2.0, "review": "you can stream netflix, you tube videos, and project anything in your chrome browser to your TV. My wii will too. I can connect my laptop to my TV do the same thing. So until Google gets off their high horse and allows fling and allcast and other apps and devices to work with their device its no better then any of the rest.", "verified": true, "helpfulness": "3/5", "author": "tammy"}, {"rating": 3.0, "review": "I got carried away with the hype on this. Potentially it will be a winner. But right now, the number of sources you can download videos from is limited (mainly Netflix and You Tube). Others will probably show up down the road. But not for now.Oh, and you can't stream your own content. Sigh.", "verified": true, "helpfulness": "3/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you don't have the latest smart television but it has a spare HDMI port, get yourself one of these and you will be watching Youtube videos in seconds. These would make great holiday gifts! Most people I know, don't have the latest TV, but they have a either a smart phone or a tablet that can cast to this through their home network. Extremely simply to setup!", "verified": true, "helpfulness": "1/2", "author": "Jack Smythe"}, {"rating": 3.0, "review": "I was planning on using this device to stream sports events from the internet but it does not allow me to enlarge the streaming event to full screen on the HD TV screen. My guess is that Google will fix this issue over time; mine is the first release of the Chromecast device.  It does stream youtube vids so that is fun. I just wish it did what I had hoped for.", "verified": true, "helpfulness": "2/4", "author": "Alwayswise"}, {"rating": 1.0, "review": "I spoke to Google about the Chromecast.  The Chromecast specialist confirmed that the item was defective.  He (Keith) also assured me that a new one would be mailed to me within receipt by e-mail of certain information including proof of purchase.  I sent that information 3 days ago.  I sent an email to Google yesterday about it.  No one from Google has contacted me to date.  Hey Google, are you listening.", "verified": true, "helpfulness": "8/12", "author": "NFrishberg"}]