[{"rating": 4.0, "review": "I am still in the testing phase.  I replaced an old Roku thinking it would be a much better picture but it is not any better than the old Roku.  So I guess it comes down to what you want", "verified": true, "helpfulness": "0/0", "author": "In the PEN"}, {"rating": 5.0, "review": "I love my new Fire Tv!  I had cut the satellite last November & went old school over-the-air, but missed some of my old channels.  I signed up with Sling TV & used the $50 coupon to buy a Fire TV.  The voice app works great!  Between Amazon Prime, Netflix & Hulu Plus, I can watch just about any show I want & I'm saving about $60-$65 a month over satellite!  BTW, if you can read, you can set up Fire TV by yourself.  I'm not great with technology, but it was very simple even for me!", "verified": true, "helpfulness": "2/2", "author": "Denise T."}, {"rating": 5.0, "review": "Arrived when promised and easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Nannapeg"}, {"rating": 5.0, "review": "THIS WORKS GREAT.  SAVES US OVER $1000 A YEAR CABLE TV BILL!  EVEN WITH HULUPLUS AND NETFLIX!  WE HAVE AN ANTENNA ALSO FOR LOCAL CHANNELS.  PLUS WE GET TO WATCH WHAT WE WANT AND NOT WHAT IS FORCED.FOUND SOME REALLY COOL OLD TV SHOWS I.E. ( UFO, TIME TUNNEL)  AND NEWER SHOWS ON PRIME AND THE NEXT DAY ON HULU PLUS.  NEED NETFLIX FOR RERUNS OF CHUCK AND THE GOOD GUYS.", "verified": true, "helpfulness": "0/0", "author": "Loretta"}, {"rating": 5.0, "review": "Ok.  I have spent about a month with Fire TV.  We cancelled our cable once they started charging for data over 300 GB.  Now we only have internet and are using over the air antenna, netflix, sling tv, and prime to make up the difference.  We have not looked back.  I love the quick response from Fire TV.  The voice search is nice.  It can be a little hit and miss as it will not or seems to not open apps.  The games are actually fun.  It is so much like a mini game system, that I am considering purchasing the optional game controller.  The remote is small, simple, and well designed.  If you do not have Amazon Prime, get it.  It is as good as Netflix and you get FREE SHIPPING folks.", "verified": true, "helpfulness": "0/0", "author": "Amazonian Mike"}, {"rating": 5.0, "review": "Great set top box. I side-loaded it with XBMC/Kodi  to watch local network content as well as stream from XBMC/Kodi streams.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 3.0, "review": "When I got this I knew I was going to love it.  I gave my Roku 3 to my Mom.I should have waited.  First I took off 1 star because it will not play Hulu Plus correctly.  It will be playing just fine, then the video freezes but the sound keeps playing. Does this many times during a show.  I pause it then reload Hulu, then it will play for a few minutes then same thing again.I have cleared data, uninstalled reinstalled, many times.  No luck.  I don't know if this is a Amazon Fire TV problem or a Hulu Plus app problem.  Either way both should be getting it fixed.  I am ready to send back the Fire TV and cancel Hulu Plus.  Looking at other reviews this is a problem many have been having for a long time. It should be fixed by now.I took off the other star because of the remote.  It is made to fit a 4-year-olds hands.  The button layout is crazy and too close together.", "verified": true, "helpfulness": "1/1", "author": "Skane"}, {"rating": 5.0, "review": "best little device. small and easy to hide.", "verified": true, "helpfulness": "0/0", "author": "Gina"}, {"rating": 1.0, "review": "Very disappointed , stop all the time, not only new movies , but olso from ten years ago... Sham !If it stops lets say on the half time of the movie, then it is impossible to moov forwerd , just not function, very disappoint tool, sorry I have it .", "verified": true, "helpfulness": "0/4", "author": "Ruth Raviv"}, {"rating": 1.0, "review": "There is a BIG issue with this device*******The parental control *************There IS no age restriction on the parental control of the amazon fire Tv or Stickthe only option is ON or OFFIf you turn it ON you have to enter the PIN each and every time your child is playing a videoIF you turn it OFF your child will be exposed to Adult content  !!!!!-------------------The funny thing that The parental control with age restriction in only available on an non amazon devices such as and Ipad or a pc", "verified": true, "helpfulness": "0/2", "author": "jawaher"}]