[{"rating": 5.0, "review": "I love doing everything that I do on my laptop now I do right on my TV!I'm listening to music and watching youtube favorats anytime on me set.Get your Goole Chromecast Now!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Went to all the troubles to buy it , installed it, to find  that It does not work in Canada.Will post it on ebay.", "verified": true, "helpfulness": "0/1", "author": "steve kotarscak"}, {"rating": 5.0, "review": "Love the feature and at such price it is a device well worth it. it will be even better if more media content are supported on the device", "verified": true, "helpfulness": "0/0", "author": "Alvin Lin"}, {"rating": 1.0, "review": "I'd just purchase the chromecast and one I installed the software on my computer I was ready to cast into my TV. Everything was fine  but then after 20 seconds of casting it stopped all of a sudden.I reviewed the chromecast page and they say that they are aware of this issue and they still are working on it. They shouldn't sell it until they fix this problem.I have everything updated in my laptop and in my TV... so they are the problem.", "verified": true, "helpfulness": "1/2", "author": "Jose Pablo Lopez"}, {"rating": 5.0, "review": "A great product for $35. Works as advertised. It is also very easy to set up and use. Would recommend to anybody looking for a streaming player compatible with almost any device.", "verified": true, "helpfulness": "0/0", "author": "Max Schumacher"}, {"rating": 5.0, "review": "I use the Chromecast to stream YouTube and NetFlix video from my iPhone to my TV.  The set-up didn't work the first time I installed it.  It sat for a day and I tried again and it worked seamlessly.I wish it had some more apps that it worked with but you can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "John H. \"John\""}, {"rating": 5.0, "review": "Just as advertised , great to show our travel pics, and transfers movies from my iPad and can't beat the price", "verified": true, "helpfulness": "0/0", "author": "Gregg"}, {"rating": 5.0, "review": "No more having to connect up an HDMI cable or something else irritating. I love how convenient it is just being able to select whatever content I want and have it switch over instantly. I can't wait for more applications to support it.", "verified": true, "helpfulness": "0/0", "author": "Castlevaniac"}, {"rating": 4.0, "review": "We've become addicted to this hickey which, briefly described, turns our 'dumb' HD TV into a 'smart' TV and turns our iPads and iPhone into remotes.  Seamlessly installed, and provides HD television without pauses or hangups even on our 3 MPBS WiFi signal that comes from a DSL ISP.The only very minor glitch (without which would have moved it from 4 stars to 5) is that often there is a confusing delay of  few seconds between when you input a command (like 'play') and the response is seen on the TV, but once you recognize that it can happen it's easy to compensate for.", "verified": true, "helpfulness": "0/0", "author": "James C. Kellett"}, {"rating": 4.0, "review": "I used this Dongle in India & yes it works. It is amazing. The reason i gave 4 stars is coz it doesn't allow us to cast the local contents on Tab or Laptop...", "verified": true, "helpfulness": "0/0", "author": "Keshava Belur Ramaprasad"}]