[{"rating": 3.0, "review": "I only gave 3 stars because it worked with my Dell Laptop but it didn't work with my Apple products. I read Chromecast forums with other buyers experience the same difficulty when using a ARRIS TG862 modem from Comcast/Xfinity. The Chromecast also needs to be about 10-12 feet from your modem. It works but not as I expected. The Netflix, Pandora, Crackle, etc., Apps work well once installed on the laptop. Easy steps to connect/hook-up the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "elira"}, {"rating": 5.0, "review": "We love it", "verified": true, "helpfulness": "0/0", "author": "NELLY"}, {"rating": 4.0, "review": "I like to watch movies/tv shows while I work on my computer.  Before chromecast, I would play Netflix or Xfinity Go in a tiny window in the corner of my screen.  Constantly adjusting and moving around the tiny window so I could see my work and/or the show.  With chromecast,  I launch the chrome browser load up my Netflix show, hit the chromecast icon in the upper right of the browser.  Now the show is on my TV!  I minimize that browser window on my computer and work away.  I totally forget that my computer is even running the image on my TV.I didn't give 5 stars because1.  I couldn't use xfinity go with chromecast on my tablet.  It does work with my laptop, but I wanted to use my tablet so that the source would be totally unobtrusive.2.  It can be skippy.  By this I mean the image hesitates occasionally. It might be my wifi.  I am going to look into getting a range booster.3.  There isn't security on the chromecast.  I believe you have to be connected to the same network to push to it.  But anybody in the house could push anything to the tv.  I think there should be some kind of password possible.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "works very well.", "verified": true, "helpfulness": "0/0", "author": "Harry Upton"}, {"rating": 5.0, "review": "Love it. Don't know why we waited so long.", "verified": true, "helpfulness": "0/1", "author": "Norma Whiteley"}, {"rating": 5.0, "review": "GAVE IT AS A GIFT,THEY LOVE IT", "verified": true, "helpfulness": "0/1", "author": "FRED INGA"}, {"rating": 5.0, "review": "easy simple and a great value", "verified": true, "helpfulness": "0/0", "author": "Willis Leung"}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Daniel Torres"}, {"rating": 2.0, "review": "I had to reset internet every use and reset the chrome cast every use.works but difficult to use.", "verified": true, "helpfulness": "0/0", "author": "jeffery austin moore"}, {"rating": 5.0, "review": "LOVE IT", "verified": true, "helpfulness": "0/0", "author": "david London"}]