[{"rating": 5.0, "review": "It was very easy to setup up and works very well.  We cast stuff from our iphones, android phones and laptops without any trouble.", "verified": true, "helpfulness": "0/0", "author": "J. Hart"}, {"rating": 3.0, "review": "I have a couple of BlueRay players with apps, and a ROKU that I use for streaming over the internet and from my Media Player.  One of these days, I'm going to cut the cord.", "verified": true, "helpfulness": "0/0", "author": "Jean Turpin"}, {"rating": 4.0, "review": "This is pretty awesome if u don't have a smart tv or a wifi blu ray - or if u even just want the ease of use afforded by ur handheld devices. I use it to watch Netflix and YouTube and it works well. Sometimes my iPad doesn't connect but that is usually solved by rebooting the iPad - turning it off and on again. My iPhone has no issues with connecting to it.", "verified": true, "helpfulness": "0/0", "author": "Kristal"}, {"rating": 5.0, "review": "I love being able to take this to a hotel with me on a trip, and sharing pic's, videos, netflix for when we're going to bed, and youtube.", "verified": true, "helpfulness": "0/0", "author": "Ghost187"}, {"rating": 5.0, "review": "I can't express how helpful it is for me, it gives you more space between your tv and your devices, now I can stream movies and videos I like wherever in the room and the resolution is awsome enough to play 720p.  I hope this common is helpful for buyers like me. Go for it! Even for the price of this device, it is worth to just give it a try!", "verified": true, "helpfulness": "0/0", "author": "Yuan Miao"}, {"rating": 4.0, "review": "I completely got rid of cable about a year ago, and during my search for a good set-top streaming device, I found this little gadget.  It's not as robust or feature rich as some of the other streaming doodads, but its simplicity is what makes it stand out.Deducted one star simply because you still get the occasional hangup or glitch during playback, but that's par for the course with most similar devices.  Google is constantly updating and improving the device through firmware updates, so I'm pretty confident that it'll get worked out over time.", "verified": true, "helpfulness": "0/0", "author": "Anthony V. Mirabella"}, {"rating": 5.0, "review": "I purchased two Google ChromeCast and it has been by far the best purchase. I have one in the living room and one in the bed room and I can control both with my cell phone and use both at the same time. When ever i go to a friends house I take it so we can watch movies or binge watch Netflix.", "verified": true, "helpfulness": "0/0", "author": "Sandra Vanessa Partida"}, {"rating": 5.0, "review": "The processing speed of our smart tv is not that great. Chromecast + Note 3 = SWEET!!!! Buy it!!!!! You will love using it. Once you beam to the TV you can continue using your phone or computer!", "verified": true, "helpfulness": "0/0", "author": "Christina Page"}, {"rating": 5.0, "review": "I ordered this when it was announced and have used it almost every day since then.  It had some software problems at first and I did notice some burn in but that has been fixed.  I use it mostly to broadcast YouTube videos to the TV, but I also use it on pages with embedded flash.  There is a little lag between the computer and TV when you do that so you want to make sure you go to another tab or close the computer.The setup works flawlessly and once you tell it to cast it automatically switches the TV over to the correct HDMI input.  You then have to manually change the input back when you are done.One thing I really like about the Chromecast is the artwork that it displays if nothing is being cast to it.  I often switch the TV input to the chromecast if I know I'm going to be using the TV later but there is nothing on at the time.  It cycles through some really good photographs and has fixed the burn in issues by moving text around the screen (slowly so you don't notice it).", "verified": true, "helpfulness": "0/0", "author": "Eric Grant"}, {"rating": 3.0, "review": "We actually bought this not really knowing what it was.  We thought it could play all phone videos on the TV, but it was actually a youtube video streamer, which of course means you need wifi in the house (something we don't have.)  But for the price, it's a good deal for what it can do.", "verified": true, "helpfulness": "0/0", "author": "Sandi Han"}]