[{"rating": 1.0, "review": "another update:  use my iPhone w/ Netflix to play a movie... then the Netflix app hangs (due to chromecast?) ... then had to hard close Netflix.  & restart Netflix, but app cannot control chromecast anymore... only after 1 minute or so, it the Netflix app can control again.... quality is poor.use case for this seems very limited when all it can do is to show selective video apps (and photos).Airplay Mirror can redirect full iOS screens.  Miracast is one similar direction for Android... but here comes Chromecast.Thought the Chrome and Android teams have merged and  can create a better user experience product versus such limited capability.  Computer is required to set up chromecast... that's going to be a limitation moving forward as well.... guess that's what you get since it's a cheap dongle.  if it (or AppleTV) can run Splashtop, that will be awesome... then, you can redirect your PC/MAC screen (all your apps and data) redirected to TV.... play your PC 3D games on your TVs...  unfortunately, this is just a cheap dongle with limited capability....", "verified": true, "helpfulness": "1/15", "author": "Gadget Tester \"Gadget Tester\""}, {"rating": 5.0, "review": "UPDATE: I bought a second one and development is really good on this device. Updated to 5 stars.So the jury is still out on this device. It is perfect for watching YouTube on the big screen, but I prefer my TV's built in Netflix app. Originally, it looked like streaming media from a local device was going to be working like a charm, but Google broke that functionality. They did issue a non-committal response saying that local content could be brought back and that the current SDK is a work-in-progress so other things might break or come back.Overall though, for $35 plus three free months of Netflix, I can't really argue with buying one.", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 5.0, "review": "This is really fabulous product by Chrome! Just love it. Connectivity, picture and sound quality is outstanding. Seamlessly work with laptop,iPhone and iPad etc.", "verified": true, "helpfulness": "0/0", "author": "M. Pradhan"}, {"rating": 4.0, "review": "I just got my Chromecast yesterday, it is very easy to set up and works very well.Comparing to my Samsung SmartTV interface it is much, much, much easier to use. My TV has HMDI 1.4 port, so I just need to select the content and stream to the TV that it turns on the content automatically.Comparing to my Apple TV, it is very limited compared to Apple TV because it doesn't have an interface with multiple content and it also dependent on using your smartphone, tablet, or computer to command the content.I hope Google can enable more content faster, current just Google Play, Netflix and Youtube, but you can stream your PC screen so it is a good alternative if you want to watch Hulu streaming from your computer.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Shiroma"}, {"rating": 5.0, "review": "It's been great and so easy to use so far. I'll be buying more for all my family soon!It's just so hard to get them being on back order for so long now.", "verified": true, "helpfulness": "0/0", "author": "Jonathan.Hobbs"}, {"rating": 2.0, "review": "It drops off line too much. Very broken digital on a large screen tv.I rarely try to use it. Too bad", "verified": true, "helpfulness": "1/2", "author": "Donald King"}, {"rating": 5.0, "review": "I am very happy with my ChromcastWorked greatRight out of the boxVery simple installation and gooed functionality", "verified": true, "helpfulness": "0/0", "author": "Jan-Willem Heerink"}, {"rating": 5.0, "review": "great product, with promising future. It will only get better over time with open source development support. As more applications become available.Thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Victor"}, {"rating": 5.0, "review": "Quick,easy setup for a device. Works as advertised, espeiclaly with youtube. Adds value to any HDMI ready TV. Excited about future features.", "verified": true, "helpfulness": "0/0", "author": "Anthony F. Cerella \"Tony Cerella\""}, {"rating": 2.0, "review": "Limited formats supported. Its pretty closed system , unfriendly to developers with Google unilaterally deciding what is allowed to be streamed.", "verified": true, "helpfulness": "1/2", "author": "Case ByCase"}]