[{"rating": 5.0, "review": "Does exactly what it is suppose to do. I use it to tabcast from my computer and plan on getting rid of the satellite bill.", "verified": true, "helpfulness": "0/1", "author": "Demeter"}, {"rating": 2.0, "review": "This generation Chromecast doesn't do much. I expect great things in the coming year but right now it basically let's one play YouTube videos on the home TV.", "verified": true, "helpfulness": "0/2", "author": "Saint Mary"}, {"rating": 5.0, "review": "Awesome! if you like to use Netflix, YouTube or Pandora this is a must have.  I cant wait until they add more apps.", "verified": true, "helpfulness": "0/1", "author": "Matthew R. Pino"}, {"rating": 4.0, "review": "Only tried it briefly and then put it away. My daughter purchased a new 32 inch TV and wanted to try it and she's had it ever sense and likes it. May have to order another one so that I can try it out more extensively. Maybe I will sometime after I hear about more content being added.", "verified": true, "helpfulness": "0/1", "author": "Mark \"It's not about guns, It's about freedom\""}, {"rating": 3.0, "review": "This works ok on Netlfix and Youtube but Roku performs better with more channels to choose from.  If you are buying this to cast from your chrome browser - don't.  The video lags the audio and freezes then jumps to catch up.  It feels like you are watching an old godzilla movie dubbed in bad english that jumps all over the place. Maybe higher download speeds would help - I don't know.For now this is a poor man's roku - I'd spend twice as much to buy that instead. If they add more channels it might be more useful.", "verified": true, "helpfulness": "1/3", "author": "Mrmr"}, {"rating": 5.0, "review": "Love love love my chromecast! I have recommended it to several people and a few of them have purchased their own.", "verified": true, "helpfulness": "0/2", "author": "LaShanta Deruise"}, {"rating": 4.0, "review": "Recently purchased 2 of these, the first one was connected to my Samsung Surround Sound system, I love it because when the system notices that Chromecast is beginning to stream, it automatically switches to the correct input.  No issues with lagging, I stream movies Via Google Chrome to my Chromecast all the time.Now the 2nd one, i'm not sure what the issue is.  It hardly ever works, i'm lucky if my Chrome Browser even notices that this thing is connected to my network.  if i'm lucky enough to get them to connect, there's constant lag and stuttering and disconnects.  This 2nd Chromecast is the extact same distance away from my Router as the first one I purchase.  Not sure what the problem is, it's currently back in it's box not being used, may do some more testing later to see what the deal is.  I took 1 star off because of this.", "verified": true, "helpfulness": "0/0", "author": "Blake C. Louviere \"Support our Right to Bare arms!\""}, {"rating": 5.0, "review": "I absolutely love this thing. I always wanted to watch netflix on the television but I have never found the need to buy an apple TV or a gaming console to use this feature. For 30 dollars you get to stream youtube and netflix with a click of a button. After learning how to set the device up, which is fairly easy thanks to the helpful google instructions I finally get to see this thing in action.PRO:The picture when streamed to your TV is in clear 1080. Im not sure if this applies to everyone but I think the picture is absolutely amazing. It's above and beyond my fios cable service in HD. Picture is crystal clear and I have yet to see any lag or pauses among the video at all.CON: The load time on some of the things you stream like netflix can be quite slow. I casted a video over to netflix which took about 15-30 seconds of buffering. Sometimes after you hit the stream button on your ipad or phone your not sure if it worked. It's not the most annoying thing in the world but I do hope that it does get fixed.", "verified": true, "helpfulness": "0/1", "author": "Cellar"}, {"rating": 4.0, "review": "Very easy to use but when i stream HBO-Go the voice/picture aren't in sync. Sometimes that happens with Netflix streaming but clears up after a short while. I love being able to stream onto the TV instead of just my small laptop!", "verified": true, "helpfulness": "0/0", "author": "weimiegirl \"Debo\""}, {"rating": 2.0, "review": "So much has potential. But it doesn't do anything that my TV doesn't. Unless they start allowing mirroring from your phone or allow more video or at least pics from your phone then it is useless. Google, please work on this!", "verified": true, "helpfulness": "0/0", "author": "Jesse R."}]