[{"rating": 5.0, "review": "I love my chromecast, use it every, for some reason it works better over wireless than any of the other devices in the house. It also looks gorgeous on my 1080p LCD panel. It's really never stuttered once playback begins when playing youtube or netflix, which is all I've tried thus far. PRAYING amazon decides to support chromecast somewhere in the near future. I can't wait to see what apps will be supported in the future.", "verified": true, "helpfulness": "0/0", "author": "Sean Bourg-Genser"}, {"rating": 5.0, "review": "Works awesome thanks for google n amazon for making this new method to share our thaught n stuffs across the technology", "verified": true, "helpfulness": "0/0", "author": "jack"}, {"rating": 5.0, "review": "It was so easy to use with all the help you receive installing it. For the price you can't help but buy it and enjoy.It's", "verified": true, "helpfulness": "0/0", "author": "Jane Cotton"}, {"rating": 5.0, "review": "This is better than I expected.  My dad loves to watch youtube videos on the tv without spending much money!", "verified": true, "helpfulness": "0/0", "author": "John Thirlwall"}, {"rating": 5.0, "review": "Easy to use, quick and smooth..just waiting for more apps. I'm sure they're in route. other then that its outstanding. Also perfect for travel", "verified": true, "helpfulness": "0/0", "author": "Steven Mallet"}, {"rating": 5.0, "review": "All three TV's in our house have one Chromecast permanently plugged in it. It is just that good. Price is great also! Recommended!", "verified": true, "helpfulness": "0/0", "author": "J. Hasik"}, {"rating": 4.0, "review": "I guess if my Amazon Prime worked with this Chromecast I would be much happier but I guess I will use Netflix and see what happens..", "verified": true, "helpfulness": "0/0", "author": "NJ MOM \"njmom\""}, {"rating": 5.0, "review": "This product replaced my XBOX 360 as our media streaming device. It shows a beautiful picture and works great most of the time. I have only had issues using this on netflix, the other apps appear to load quite well. Sometimes Netflix will not work and I have to start Youtube or Hulu plus up then switch back to netflix to get it to work. I'm not sure if that's a Netflix App issue or a Chromecast issue. Otherwise it works great. Great value too. Used with an iphone, ipad, and Nexus 7 Android tablet.", "verified": true, "helpfulness": "0/0", "author": "Clint"}, {"rating": 5.0, "review": "It does what I expected of it. See Netflix, youtube and other media from your cell to the TV never hasn't been easier than this. Easy to install and use, so you wont regret it.", "verified": true, "helpfulness": "0/0", "author": "jadlrn51"}, {"rating": 5.0, "review": "Dont buy a samsung smart tv.Just prepare a this small usb toolkit.Fully enough to enjoy internet materials.Samsungs are too slow to navigate and annoying processes to play it. Sign in, log in....If you arw using a smart phone, everything are already prepared to play. Sign in...log in...Just play it. That is a single process what you need.", "verified": true, "helpfulness": "0/0", "author": "Junyoung Kim"}]