[{"rating": 5.0, "review": "So far, so good. The box is super slim and tiny so it doesn't take up space like my old 360 did. But, if you aren't interested in the games, I think the Fire stick is where you should look, unless you cannot wait for HBO GO.", "verified": true, "helpfulness": "0/0", "author": "Jayson2112"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/1", "author": "spider"}, {"rating": 5.0, "review": "Works great!  Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "mmk"}, {"rating": 5.0, "review": "it links to my account and also lets me use my netflix account.  works great", "verified": true, "helpfulness": "0/0", "author": "Susan Pilkton"}, {"rating": 4.0, "review": "It works well and does exactly what was stated it could do. I couldn't give it a full 5 star review because it doesn't allow for customization on the Home screen. The Fire Tv simply promotes Amazon Prime content but doesn't allow you to customize the apps you use most or want to access quickly.", "verified": true, "helpfulness": "0/0", "author": "Matthew DiStasio"}, {"rating": 5.0, "review": "Couldn't be happier with the Fire TV.  Does everything it advertised it would do.", "verified": true, "helpfulness": "0/0", "author": "Greg McComsey"}, {"rating": 3.0, "review": "It's extremely to easy for to purchase stuff that use your TV. If they don't know to only look in the 'Prime' category. No password needed or anything to confirm your purchase.  And I absolutely hated that my Fire TV  came with my amazon login and password already signed in. Way to careless on Amazons part. Anyone that would steal this package would have access to my account.", "verified": true, "helpfulness": "0/1", "author": "Joseph Seiss"}, {"rating": 5.0, "review": "Super easy to install and use, I love it", "verified": true, "helpfulness": "0/0", "author": "Anne Allain"}, {"rating": 5.0, "review": "This device brought my 2009 240Hz Samsung TV up to today's capabilities.  Now I can stream Internet material directly to the TV.  It saved me having to buy a new TV.", "verified": true, "helpfulness": "0/0", "author": "William A. Sery"}, {"rating": 5.0, "review": "Love being able to watch seasons of shows", "verified": true, "helpfulness": "0/0", "author": "Venus"}]