[{"rating": 5.0, "review": "I have made the move from cable to streaming.  Previously, I streamed via my laptop.  The quality of the stream is so much better.  It is extremely easy to set up and use.  I have saved a substantial amount of money by dumping cable.", "verified": true, "helpfulness": "1/1", "author": "Scalvin"}, {"rating": 5.0, "review": "I love this little box. Wow, so much faster, movies clearer then Roku.  I was hesitant switching, but Roku 2 XS (have 2) continuously stutters, freezes and restart.  So far Amazon Fire TV no problems. EXCELLENT product.  Will purchase another to replace another Roku. Now, if they could just get a channel called PubDHub. Awesome old movies with new ones every week. :)", "verified": true, "helpfulness": "1/1", "author": "PF"}, {"rating": 4.0, "review": "I had a bad hdmi cable and once replaced worked fine", "verified": true, "helpfulness": "2/5", "author": "Howard Spellman"}, {"rating": 5.0, "review": "Fire TV is so simple to install and record programs. Just what I was looking for. Combined with Amazon Prime, it's the solution for me.", "verified": true, "helpfulness": "1/1", "author": "Stiletto \"Judi626\""}, {"rating": 5.0, "review": "It is an amazing product.  Fast, reliable and easy to use.  I have taking it with me on several trips, and it allows me to take all of the shows I enjoy on the road.", "verified": true, "helpfulness": "1/1", "author": "steadysqueeze"}, {"rating": 5.0, "review": "I don't have much to compare it to, but love it.  Netflix and Prime load and respond very quickly, as if I were watching cable.  Using Netflix through a PS3 was painful, and through a Sony DVD player, extremely painful.  Loading, rewinding, fast forwarding, were ridiculously slow on my Sony products.  Fire TV handles this with ease.  The Prime interface on this is also excellent.The buttons on the remote are intuitive, although I wish it was larger.  I expect to lose it in the chair cushions at some point.  Also, the curved back on such a small remote tends to allow it to rotate in my hand when fast forwarding, something I do a lot.  Perhaps my hands are large, and I have gotten used to it.The best feature to me is the 10 second instant skip forward or backwards.  I previously often annoyed my wife by rewinding to see something again, a real problem on my previous Sony products. With Fire TV, it is instantaneous - might even escape the attention of another viewer!  Ten seconds seems to be about right. Doing many 10 second forwards can also speed up viewing when needed (e.g., you don't have to watch a character walking to a door - 10 seconds puts them there without missing anything).I had hoped to stream video files from my computer over the network.  I understand the Plex app does this, but it didn't work for me. I haven't made a serious attempt to figure out why so there is still hope.I would also like to put in a plug for Prime.  For what I get with free shipping, the video is essentially a free bonus.  Amazon has also increased the content on Prime since launching Fire TV. No one should complain about Netflix for what one gets for the price.  However, if not available for free on Prime, Amazon has lots of content available for rent and/or purchase.  I like that it is in a unified platform.  I watched the first season of Boardwalk Empire as part of Prime, but subsequent seasons have to be rented or purchased, even though a couple of years old.  Bating into renting is probably a money maker for Amazon and/or HBO.  I wouldn't accuse either of being stupid.", "verified": true, "helpfulness": "0/0", "author": "Steve C."}, {"rating": 5.0, "review": "Love Amazon Fire TV!  We currently have \"free\" TV, giving up satillite over 4 years ago.  This has helped us reconnect with some of the shows, plus seamlessly watch movies on our TV.  Easy to use, plus the hands-free, search option is wonderful to use.  This pairs so nicely with our Amazon Prime account.", "verified": true, "helpfulness": "0/0", "author": "Jan S Hornberger"}, {"rating": 4.0, "review": "Not sure why but I haven't yet installed this item.  I have a smart TV and can watch my amazon stuff through that.  Not sure what other functions this would give me.", "verified": true, "helpfulness": "0/3", "author": "Luz Gonzalez"}, {"rating": 5.0, "review": "Cant say enough good things about the fire tv. Just wish it had a browser. Otherwise its great.", "verified": true, "helpfulness": "0/0", "author": "proactivens"}, {"rating": 4.0, "review": "I have heard the negative backlash for this as being a \"poor mans\" Roku, but the truth is: it's quite good. Now I will admit this particular one was a replacement (first one conked out after three months) but Kudos to Amazon for sending me out a new one in no time flat, with no fuss or any issues what so ever. The dedicated remote is great, but the voice commands are kind of pointless (only works from the main hub and not any of the apps) I want to give it a 5, but see, everyone and their grandmother supports HBO go....and Fire doesn't. Get that and I give you that extra star!", "verified": true, "helpfulness": "0/1", "author": "Justin Passaro"}]