[{"rating": 5.0, "review": "This device is excellent. It will be even better if we can cast browser from mobile phones.Overall I find this device awesome. My parents who are not tech savvy are quick to pick up the simple operations of casting youtube videos.Singapore play store and Apple app store do not host the chromecast extension app. For Android phone, I used a VPN to access US play store to download the app. For iphone, you will need a US app store account.This region lock for chromecast app is disappointing. Google ought to know that they have fans all around the world, especially for such a fantastic product.", "verified": true, "helpfulness": "0/0", "author": "Meng Keong Lim"}, {"rating": 5.0, "review": "I love this product. Thanks to Google for making such an amazing hardware . I guess there is more to come from Google on this hardware. Streaming online videos from my Mac, nexus 4 or for that matter any mobile device is just seamless. The setup process is also very simple and automatic. Makes any display device having an HDMI port ready for WiFi streaming .", "verified": true, "helpfulness": "0/0", "author": "Abhishek Srivastava"}, {"rating": 1.0, "review": "This is such a great product when it works. Streams well, is easy to install, and the UI is great.Problem is, it really does not work at all, It's buggy, it stalls SO often as to make it useless. Many Xs I've had to simply UNPLUG it in order to get control of the stream: The control from the laptop will simply stop working and if you want to stop the stream it's necessary to pull the dongle out of of the TV.Come on, that is crazy. This is a half-baked, non-tested dongle that simply does not work consistently.", "verified": true, "helpfulness": "2/4", "author": "Chickenfog"}, {"rating": 5.0, "review": "This a kind of a hard review to write, I own a Roku HD which has rarely been touched. I wanted a internet media device which I have for the past 6 months been relying on my Wii U to preform. I like being able to watch Twitch videos, youtube, Hulu plus and Netflix videos on my tv. The Wii U has been my go to device here recently however the 35 dollar chrome cast has been a interesting replacement. For Netflix and Hulu integration, this device works great. It has no menu of its own so you must connect with it from another device. I use a Nexus 4 and a iPad for this and it works nicely, the quickest start up out of any device I have used so far. If that is important to you great but I am somewhat used to the 20 sec load up time where the quicker start up is nice but not really something I was looking for. The youtube integration is the best selling point so far, and in my world this has been a life saver. The Wii U has made youtube videos watchable but there has always been a few hangups. If you want to watch a live youtube broadcast you must share your tab on full screen as the device will not stream it. Not a big deal as I just hide the tab behind my browser. Twitch support would be the best point I wish to bring up. If you watch Twitch videos I love source media, its quicker and not converted as its other formats and the Wii U and every other device outside of my computer would not have this as a option. I need to do the same thing as a Youtube live stream when trying to watch a Twitch stream but it is so nice to watch this on my TV.I have yet to find a reason to stream a webpage but it is available. If I felt like watching a flash animation from Newgrounds this would be the only real reason but if you wish to stream a webpage then here you go.The options available to change are limited which I guess is a good thing however there are times where I would like to change the way the video is displayed. Sometimes it looks like my TV clips the corners only so slightly but it may be my angle. You can change the video quality and the devices name and if you wish, you can even factory reset the device.For what this device does it works for my needs and replaces my need for the Wii U which saves a few headaches in changing settings to get the best picture for my live streams. The price makes this very attractive to me and my Roku device is now in another room as I try and figure out what to do with it.My only issue that I can think of that might cause some one to have a negative view would be stream lag, if you stream a twitch video for example the tv and computer will have a 1 sec delay, I just put the tab behind another tab to ignore that but some may find the non real time view annoying, I honestly don't but to each there own. I would buy this again and if I ever figure out a reason for a 2nd one I will swipe one up.", "verified": true, "helpfulness": "0/0", "author": "M. R. Galde"}, {"rating": 3.0, "review": "Set up was simple, works slowly with Netflix and You tube, does not work with Amazon Prime movies, which was why I bought it.", "verified": true, "helpfulness": "0/3", "author": "Robert A. Johnson"}, {"rating": 4.0, "review": "Seemed to be relatively simple but set off a series of problems with connectivity with my NetGear router and I had to pay tho get the NetGear people to go back over all the settings. I have it synced to my PC, iPad and Internet TV but not to my iPhone. Now that it is set up it works quite well, but it did seem to precipitate some router problems.", "verified": true, "helpfulness": "0/0", "author": "Peter Olson"}, {"rating": 5.0, "review": "Chromecast works as described. Best $ 35 I've ever spent. I recommend Chromecast for anyone who has a HD TV and likes to watch content from the Internet.", "verified": true, "helpfulness": "1/1", "author": "M. A. McCready"}, {"rating": 5.0, "review": "good product for shar your youtube and your files and you like to watch from TV ,  i will buy againThank you Amazon", "verified": true, "helpfulness": "1/1", "author": "Mussa Alsubhi"}, {"rating": 2.0, "review": "Perhaps it was my fault that I did not inform myself a bit more about the features of Chromecast before purchase, I needed a affordable media player that will primarily cast media stored on my HDD.  Besides, I looked for media player that would cast streaming video such as live sports events onto a TV screen.  Unfortunately, for both of my expectations, Chormecast did not deliver.  When casting from the above mentioned sources, the connection between Chromecast and internet often breaks and it is impossible to have a minute of stream and cast onto the TV without interruption.  I tested it on Youtube and this thing works fine, but for now, in my opinion this is not enough and it is not worth the hype that this gadget received.", "verified": true, "helpfulness": "0/1", "author": "Adnan Ovcina"}, {"rating": 5.0, "review": "I have it plugged in to the back of my receiver, which does HDMI switching to the TV.  Streaming quality is great, supports Dolby digital, buffers quickly, and no hiccups during playback.  Nexus 7 interface for Netflix and Google Play is a pleasure to use.  Great companion for Google Play Music.", "verified": true, "helpfulness": "1/1", "author": "Joe"}]