[{"rating": 1.0, "review": "Constantly disconnects and looses audio. I have to reset it, quit and reopen and try unplugging multiple times and even then it's a crap shoot to see if it going to connect or not.  And if you don't have fast a network where you use it you can forget about it.  Works great for the first few minutes or sometimes halfway through a movie if you're lucky... unfortunately I have yet to watch a whole movie without it disconnecting on me.  Finally got fed up after about 5 weeks of troubleshooting and I lost the return window. To top that off, the rate of disconnecting is becoming more frequent. If you decide to test it out, be sure to return it before it's too late.", "verified": true, "helpfulness": "0/1", "author": "Mechanic Mike"}, {"rating": 3.0, "review": "Great unit for what you want it for limited  application available now, but it works", "verified": true, "helpfulness": "0/0", "author": "RALPH SANTIAGO"}, {"rating": 4.0, "review": "I'm finally taking advantage of my Netflix account and enjoying many other apps on my TV.  Sometimes I lose control of it so I have to reboot it but in general it works great.", "verified": true, "helpfulness": "0/0", "author": "Foreign buyer"}, {"rating": 5.0, "review": "Best dongle in my house.", "verified": true, "helpfulness": "0/0", "author": "Stinkfish"}, {"rating": 5.0, "review": "Works perfect for Netflix with link to computer", "verified": true, "helpfulness": "0/0", "author": "Penny Davis"}, {"rating": 1.0, "review": "I made this purchase specifically to be able to stream my AMAZON Prime Instant Videos but Amazon doesn't support Chromecast.It would have been nice to have had this disclosed prior to my purchase...disappointed with Amazon:-(", "verified": true, "helpfulness": "0/1", "author": "kimmer"}, {"rating": 5.0, "review": "This was a great solution for my TV. Had no problems connecting to a Sanyo TV and streaming is working great. Yeah, you are stuck using Chrome for internet stuff, but several apps now are compatible with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "hoytpr"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Fiume Alejandro Vicini Camilo"}, {"rating": 1.0, "review": "I'm very disappointed that the package was messed up. I was given an used item with a broken seal. A BIG \"reconnect me and 'jeepher WiFi not available\" popped out on the TV once it was connected. For sure the chromecast was own by another person before. That really got into trouble as I bought it on behalf of my boss. My boss thought I sold him my used chromecast on full value. Now I got to rush to get a new, a really new, chromecast and refund all the money to my boss to proof my innocent. All thanks to Amazon.", "verified": true, "helpfulness": "16/18", "author": "yan teck koh"}, {"rating": 5.0, "review": "I bought chromecast for the screen casting feature. So far it works great casting from my laptop. I'm still experimenting using it with my ipad and android phone but it duplicates picture and sound from my laptop perfectly.", "verified": true, "helpfulness": "0/0", "author": "James D.W. Hogg, D.C."}]