[{"rating": 5.0, "review": "so far I like it  does what it said and more apps coming really like using my smart phone to work it", "verified": true, "helpfulness": "0/2", "author": "volfan"}, {"rating": 1.0, "review": "I it worked just fine until they did an automatic update. After that I couldn't get it to work properly again no matter what I tried. After many emails back and forth with the google tech support I decided to return the device. Very disappointing.", "verified": true, "helpfulness": "1/3", "author": "omiel \"omiel\""}, {"rating": 5.0, "review": "I'm so happy I ordered this and the price is right!  Would highly recommend it to family and friends.  I can't wait to get it.", "verified": true, "helpfulness": "0/2", "author": "Ruth Sanchez"}, {"rating": 3.0, "review": "Like the easy setup.Currently only subscribe to NetflixImproved load times vs. Apple TVSurf internet - great for demonstrations or other data you want to shareTV Episodes that load & play fine on laptop fail to load or are slow to load on Chromecast/NetflixMultiple pauses during playback to load data - seems to be related to time of day", "verified": true, "helpfulness": "0/0", "author": "John Gustafson"}, {"rating": 4.0, "review": "This thing is worth every penny and more. I couldn't quite give it five stars because it won't let you play your own content on tv, which was one of the things I was looking forward to. Other than that the device is just amazing, fast, and extremely easy to use. No need for a smart tv. :3", "verified": true, "helpfulness": "1/2", "author": "Ian A Menendez Diaz"}, {"rating": 5.0, "review": "Works great and really easy set up. Now I can enjoy Netflix and YouTube on my tv streaming from my tablet and phone", "verified": true, "helpfulness": "0/1", "author": "Wilson G."}, {"rating": 5.0, "review": "This works for exactly what I needed it for, which is watching shows/movies from my browser, and I don't have to use my Ps3 to watch Netflix or Hulu. However, I wish that there was an option that allowed the episodes to keep playing, like they do when you watch online or on the Ps3. Other than that, I really enjoy using Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Gladys"}, {"rating": 5.0, "review": "Works great. I love this thing. Does exactly what it says, you can even stream podcasts from beyondpod which I already have.", "verified": true, "helpfulness": "0/1", "author": "larry"}, {"rating": 5.0, "review": "I can't stop telling friends and coworkers about how much I love my Chromecast. It is extremely easy to set up, and since buying it, I have used my Chromecast more than my cable and my Xbox 360 combined.", "verified": true, "helpfulness": "0/1", "author": "Will"}, {"rating": 5.0, "review": "I bought this to stream stuff from the office computer to the TV in our living room, only about 10 feet away. works great.", "verified": true, "helpfulness": "0/1", "author": "James Maleski"}]