[{"rating": 5.0, "review": "Works with YouTube and Netflix (but so does my TV,  did, dvr) even with dsl.  Waiting for the sdk and seeing use on Chrome", "verified": false, "helpfulness": "0/0", "author": "Kenneth C Nitz"}, {"rating": 5.0, "review": "Setup was easy. Was casting a webpage from Chrome within minutes. Took me longer to find the extension for Chrome than anything else. Looking forward to additional capabilities.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Cooker\""}, {"rating": 3.0, "review": "It's usefulness is limited. Works fine on supported  apps but if you try to use on just the chrome browser has a lot of lag, blanks and just doesn't even work in any way that is  useful. Also if you don't click stop casting it continues to cast forever using  up available bandwidth. If you just want it for youtube  it works good  . Netflix only soso voice and picture don't seem to be in sync. also can't seem to get it to work on youtube if the feed is live.", "verified": true, "helpfulness": "0/0", "author": "David Livesay"}, {"rating": 5.0, "review": "might seem limited at first glance, but the more you start using the more you end up thinking \"how haven't I thought of this idea before myself\"", "verified": true, "helpfulness": "0/0", "author": "ruslanoid"}, {"rating": 5.0, "review": "I'm excited to see how Google adds features to this over time. It's just so easy to use!Way to go Google!", "verified": true, "helpfulness": "0/0", "author": "Trevor Carpenter"}, {"rating": 5.0, "review": "I can't explain how easy this was to set up. I bought one...set it up at work to try it out...and when I left and took it home, coworkers were sad to see it go since it was easy for all of us in the office to control.Once I used it at home, and given the price, this is really made for each TV you have in your house. So get 3 if you have that many TV's.Cons: Some of my favorite apps do not support it YET! But I know that will come if they want us customers to keep using their service(I'm looking at you Hulu). Also having to plug a power source into this device just makes the unit less pleasing to the eye...but what can you do?", "verified": true, "helpfulness": "0/0", "author": "Daniel Hart"}, {"rating": 1.0, "review": "Iphone compatibility is awful. No app yet for iphone? I want to return this as of right now it's a total waste of time and money.", "verified": true, "helpfulness": "1/3", "author": "Johnny boy"}, {"rating": 5.0, "review": "Arrived, plugged into television and started using our Galaxy MP3 player to watch shows without any problems.  Very pleased with the purchase and use of Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Kats"}, {"rating": 4.0, "review": "this is a nice little device. mainly because it is pretty inexpensive. the only flaw is that there is not much support for it yet, meaning that the gallery app and video player etc. on an android device do not have a cast button so you cannot cast random videos and photos that you took on your device directly to your tv. on the upside there is a lot of hype about this and with it beind a product of google I expect there to be updates and increasing support for it pretty soon.", "verified": true, "helpfulness": "0/0", "author": "John Smith \"JS\""}, {"rating": 5.0, "review": "The most amazing features to cost ratio product Google has ever made. Works with no issues and only going to get more features as time goes on.", "verified": true, "helpfulness": "0/0", "author": "Wesley Smith"}]