[{"rating": 5.0, "review": "Works well to provide innovation when viewing TV! Love this product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Most useful gadget I have ever owned, without exaggeration. This thing has replaced almost every streaming media in my home!", "verified": true, "helpfulness": "0/0", "author": "noland"}, {"rating": 4.0, "review": "have issues to connect to the network, I bought two and both has the same problem, they are good but sometimes they just get disconnected and is a pain to set them up again. It saved us a lot of money though, since we don't pay cable anymore, just a very fast internet connection and you are set.", "verified": true, "helpfulness": "0/0", "author": "juan luque"}, {"rating": 4.0, "review": "Cool device overall.  You MUST use it with google chrome or a smart phone.  I hate chrome.  With the smart phone, if you don't close the app that was using it (in my case pandora), it sometimes gets 'locked up' and you have to restart the smart phone or use the computer to disconnect it from the phone.", "verified": true, "helpfulness": "0/0", "author": "Give It To Mikey \"Michael\""}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Francisco Arguelles"}, {"rating": 5.0, "review": "¡Excelente!", "verified": true, "helpfulness": "0/0", "author": "Susana Rebon"}, {"rating": 5.0, "review": "Life changing. Got the chromecast got rid of my cable and haven't looked back. You do need to pay for Netflix and Hulu I guess, but still better than overpriced channels I never watch.", "verified": true, "helpfulness": "0/0", "author": "Den"}, {"rating": 5.0, "review": "Bought as an Xmas present for a friend. Guy loves it. Easy to use, easy to setup. Old Nickels", "verified": true, "helpfulness": "0/0", "author": "Nic"}, {"rating": 5.0, "review": "I love love love this device and I will never EVER get cable again. COMMERCIALS SUCK! And everything is easily accessible on my chromecast😍😍😍 I love it for my shows and my nephew loves to watch Curious George and Caillou! And I can control all of it from my iPad or my phone!", "verified": false, "helpfulness": "3/3", "author": "Aaliyah Minor"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "P. Warfield"}]