[{"rating": 5.0, "review": "The Chromecast is an amazing little device. It comes in an easy to open box, and itself is easy to set up. It comes with the Chromecast, a USB wall charger, and an HDMI extender. The HDMI extender is for when your HDMI port is downfiring or flush against the wall. Its' flexible and thus allows you to move it around and is about 4 inches long. The USB wall charger is about 3 feet long. The chromecast itself is about 2 1/2 inches long and an inch wide. It comes with an LED indicator and a reset button.To setup, you simply plug the chromecast into an HDMI port, and then the micro USB into the end of the Chromecast. It will turn itself on when you plug in the micro USB. You will be greeted with a screen that asks you to use your pc, tablet, or smartphone to set up the chromecast. You use your device to set up wifi access to the Chromecast. Generally it will connect, and then update itself. If you're having a hard time connecting it to wifi for the first time, you can try hard resetting it. Hold down the reset button for 15 seconds and the screen will go black and it will reset itself. It will then have a new code and you can retry.The features of the Chromecast have come a long way since it was first introduced. You use your device to throw content from your device to the chromecast, which then accesses what you want it to do so your phone isn't constantly streaming it. So, say, when you watch YouTube, you tell it to play a video and then it will access YouTube and play that video, leaving you to do whatever you want with your device, since it doesn't have to constantly stream from your device to the Chromecast.One of my absolute favorite features is the ability to screen mirror. This means you can duplicate the screen from your phone or pc to your tv through the chromecast. Its very fast and fluid, and there is little degredation of quality or lag when using it. I have found it faster and more fluid than using the built in screen mirror on my LG 42LB6300. Screen mirroring allows you to be able to do just about anything you do on your phone or pc on your tv. This feature is not to be overlooked.Overall I would recommend this device to friends and family. It is extremely affordable and lets you easily access anything on your smartphone or pc.", "verified": true, "helpfulness": "2/2", "author": "Wolfix"}, {"rating": 4.0, "review": "Before purchasing this item, it is very important to understand the difference between a mirroring device and a streaming device.  This is a mirroring device, and although I don't care for it, it does exactly what it's supposed to do and does it well.  Since we've gotten into the world of streaming earlier this year, I've since learned that I simply prefer streaming devices over mirroring devices.We bought this mainly for the kids to use, and in order to do so they need an iPad, iPhone, etc.  It cannot work as a stand alone device.  It's become an issue because inevitably they want to watch something using the Chromecast when we're trying to charge our phones or iPads.  I also don't like that I have to load all the apps that I wish to watch on the Chromecast on every single device that I wish to use with the Chromecast.  So every iPhone and iPad in our house has to have Netflix, showtime, ESPN, etc. because they all have been used to operate the Chromecast at one time or another.Another issue with the Chromecast is that you cannot use it to watch Amazon Prime.  There used to be a way to disable silverlight and mirror Google chrome to the device to watch Amazon prime content, but that loophole doesn't seem to work anymore as Amazon is now requiring silverlight to play any of their content in a browser window.I can't give the Chromecast a bad rating because it does exactly what it's supposed to.  It would be unfair to judge it poorly because I prefer streaming over mirroring.  However, I strongly urge you to understand the difference between the two before making a choice between Chromecast, Fire TV, Roku, etc.  If I had possessed a better understanding of the difference between the streaming vs. mirroring, I don't believe I would have purchased the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Mom \"Professional Mom\""}, {"rating": 5.0, "review": "excelente", "verified": true, "helpfulness": "0/0", "author": "Deibis A."}, {"rating": 5.0, "review": "This turns out to be a great addition to our video streaming.  If you have HBO on cable, then you have access to HBOGO.COM and their selection of videos to stream...for just a few dollars!", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 3.0, "review": "After reading the reviews, I decided to give this a try. First,....let me say,.....they fixed the remote control issue by NOT giving you one any longer. The package now comes with The Chromecast dongle. An flexible, short HDMI extension. This is so, should there be any trouble getting the dongle into an HDMI port,.....you can plug the extension into the HDMI port,.....then the dongle into the extension. There is also an A/C power cord to micro USB to power the Chromecast. Once I got everything hooked up,.....I had trouble with my iMac casting the video to my Samsung HDTV. I would get sound,....but only a green screen. I called Google and they told me that they had issues with IOS 7 and above. But he had me uncheck hardware acceleration,...and the video started working. The product does now work,.....but not as smoothly as it should. (Could be due to me using an iMac.) It is a good ideal,...but in my case,.....and after seeing more reviews,.....Amazon has a product out that might be a better solution for myself. Albeit Amazon's product will not cast from your hard drive at this time.", "verified": true, "helpfulness": "0/0", "author": "Melvin Al Farris"}, {"rating": 3.0, "review": "Doesn't work for AMAZON PRIME!!!. Works great for Netflix but I need something for Prime", "verified": true, "helpfulness": "0/0", "author": "Ralph"}, {"rating": 5.0, "review": "This is working just great.  I really enjoy watching a lot of the content on the internet.", "verified": true, "helpfulness": "0/0", "author": "JBuddy"}, {"rating": 4.0, "review": "Awesome, I am glad i bought this", "verified": true, "helpfulness": "0/0", "author": "Lenard"}, {"rating": 5.0, "review": "i bought this for the \"dumb\" TV in my 3 yo daughter so she can watch all her favorite cartoons in netflix and youtube, and it worked like a charm, and that is without getting the full of this little dongle, because of geographic location (not the US) so i cant get all off the content.", "verified": true, "helpfulness": "0/0", "author": "Marcio Suazo"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Nina Nguyen"}]