[{"rating": 5.0, "review": "This really is the best product of its kind, 100% recommended, highly functional and high quality, do not hesitate to buy it", "verified": true, "helpfulness": "0/0", "author": "Pablo Ghiggo"}, {"rating": 4.0, "review": "The Chromecast dongle worked well. I only wish that it supported more applications, such as the video player and music player on my phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "Cashmere Kin"}, {"rating": 5.0, "review": "Very Simple to install and use once you have it installed! enjoy watching Netflix whenever we care! going to order one other for our guest bebroom!", "verified": true, "helpfulness": "0/0", "author": "FLATLANDER"}, {"rating": 4.0, "review": "This is the third in a series of four.The first two were great.  This one is good but not as.I will read the fourth", "verified": true, "helpfulness": "0/0", "author": "HEWC"}, {"rating": 3.0, "review": "It does what it says.  However, there is a limited listed of applications that are currently compatible with this device.", "verified": true, "helpfulness": "1/1", "author": "A. ALJUNAIDI \"ANJ\""}, {"rating": 5.0, "review": "First impression: The packaging was neat and not messy. The chrome came with easy instructions with all the required items to power the dongle. Very easy to set up using any web browser. Fortunately for me I've done my research and came across neat \"tricks\" for this device.....(Just google Chromecast tricks).Friends' impression: Very awesome to have the \"que\" technology. This way everyone can enjoy their vids in order using each individual's phone/tablet.Cons: Has some stability issues when streaming an entire tab on google chrome, the video does not flow very well since it is streaming an entire tab.- Took a while to get used to because it has 2 abilities of casting the actual video and casting a web browser's tab.- No security or matching device option to play on the Chromecast. What I meant is that anyone can play on the Chromecast without restrictions except for being in the same network. Hence, if you have more than 1 Chromecast in the house, you can prank and play random videos on the other Chromecast.", "verified": true, "helpfulness": "0/0", "author": "SkittlesOverMnM"}, {"rating": 4.0, "review": "works exactly as discribed in the overview and streams smoothly. if it could stream my prime account movies and shows it would be worth another star(5)", "verified": true, "helpfulness": "0/0", "author": "Brian Walker"}, {"rating": 5.0, "review": "This is a killer device and is a great wireless HDMI solution.I still have to test it deeply, but the initial results are great.Extremely easy to setup, streams very well, even HD streams well.For the price there is nothing near which works so well", "verified": true, "helpfulness": "0/0", "author": "Dhaval S."}, {"rating": 5.0, "review": "Netflix, You Tube and streaming home movies.Very nice and quick setup with a great picture.  I was going to go with Apple TV but many said that Chromecast was the future.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Super easy to use, does the job. I like it better than my Apple TV, and it goes for a lot less money.", "verified": true, "helpfulness": "0/0", "author": "Fernando Herrera"}]