[{"rating": 5.0, "review": "This is a really useful product that allows you to very simply plug into the back of your TV, and stream HD video, movies etc... from your computer, laptop, tablet or phone. right to your HDMI TV. It comes with everything you need to get started. The only thing you will need to do prior to getting started is to download the Chromecast app on the device you wish to stream from; then just plug in the Chromecast and your ready to go!Remember: download the app first!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased this for my husband for Christmas.  It was highly recommended to us.  It is a really neat gift for someone that likes gadgets….and my husband loved it!  I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "A. Freeman"}, {"rating": 5.0, "review": "I really love my Google Chromecast, super easy to install & works great.  I can look at pictures from snapfish on my TV using this.  As long as you use Googlechrome whatever is on your screeen will play on your TV.  Another good feature is when i watch movies I can still use my computer to look at other webpages while the movie is playing.  I use to use my Wii for netflix but this is much easier to use.", "verified": true, "helpfulness": "0/0", "author": "C. Taylor"}, {"rating": 1.0, "review": "pros:small and easy to installworks only with YouTubecons:my mobile is android  and i cant cast pictures or private clips.", "verified": true, "helpfulness": "0/2", "author": "imr2k"}, {"rating": 4.0, "review": "I now own three of these throughout my house and they are very useful and inexpensive. My only complaint is that they do not have enough apps as of today 1/17/2014. They say they are working on more for the Chromecast so I am looking forward to that. Very easy to use all you have to do is change the channel on your tv and you can instantly stream from your device. It's as easy as that.", "verified": true, "helpfulness": "0/0", "author": "GunGuru"}, {"rating": 5.0, "review": "I Love my Google Chromecast, easy to setup and it works great , and I don't have to connect my laptop to my Tv anymore !!!!", "verified": true, "helpfulness": "0/0", "author": "Carlos L."}, {"rating": 3.0, "review": "It does okay the streaming of Youtube and Netflix stuff from ipad or iphone, as promised. It mirrors a screen generated by Chrome navigator on the TV, without any processing to adapt the content to the TV projection.There is no solution for picture or video clip series locally stored to be streamed as a continuous. Not convincing, limits are too evident.", "verified": true, "helpfulness": "1/2", "author": "Waldo Valderrama \"WVR\""}, {"rating": 3.0, "review": "While this device works mostly, it advertised that I could run anything on my computer to my TV. This was not exactly true. Only services that have contracted with Google can run on your TV. Flixster does not work, my private recordings do not work, but Netflix does.", "verified": true, "helpfulness": "0/1", "author": "Danny V"}, {"rating": 1.0, "review": "Compared to Roku: The Roku:You get a range of video providers that is exponentially greater in variety than Chromecast.You don't have to have your phone/tablet on hand and charged.You don't have to have to turn on your phone/tablet.You don't have to swipe to start.You don't have to download from google store.You don't have to find and click on the app.You don't have to deal with google when you have a problem.So you pay $75 or so, instead on $35 or so.I don't get why anyone would go for the Chromecast instead of Roku (or perhaps some other streaming players).", "verified": false, "helpfulness": "0/2", "author": "Youbetcha"}, {"rating": 2.0, "review": "Hello fellow buyers,I purchased ChromeCast hoping that it would be a step up from My Xbox and Smart TV. Although it is good for the price, there are a few things I should note (Caveat Emptor).-It may cause internet connection problems since it is its own WiFi-It does not play ALL YouTube videos (most Music videos in fact will NOT play)-A lot of other types of Media you can stream through your computer... does not work on ChromeCast. (it is selective)-I still end up using my computer for the same things I thought I would use on ChromeCastOther then those issues, its great!", "verified": true, "helpfulness": "0/1", "author": "Mac"}]