[{"rating": 4.0, "review": "Beware, this is not the device for you if you live in a townhome/apartment community. If you have multiple overlapping WIFI signals inside your home expect that this product will get lost in the fray. if you have a good strong WIFI signal it works great.", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Love it!!! Very inexpensive way to turn your high definition plasma/lcd/led tv into a smart tv. Good buy! I have 3.", "verified": true, "helpfulness": "0/1", "author": "LaRwan McClaine"}, {"rating": 5.0, "review": "Now have purchased 4 of these, 2 for my family and as gifts for others. I swear by these little things. Especially once you add in Plex.", "verified": true, "helpfulness": "0/1", "author": "John Hebert"}, {"rating": 5.0, "review": "Chromecast rules supreme. There are many reviews from people who have not experienced the true power of this little device.it has quickly replaced my Roku as my streaming device of choice. If you are an international user, dont hesitate , just buy it. I love viewing movies and tv shows  from Netflix and Amazon, but this device has opened other avenues. Obviously i am not telling all i know, just buy it and do the research, read the forums , figure it out, you will be soooo happy that you did.", "verified": true, "helpfulness": "1/2", "author": "chemist"}, {"rating": 3.0, "review": "This isn't some miracle device.  Really, all it does is allow you to stream video from your phone or laptop ONLY IF it is via Netflix or one of the other VERY FEW apps that work with it.  I was told any video you bring up under the Google Chrome browser will work, but I have not seen that as an option when using Google Chrome on my iphone.  If this had the capability to use Amazon Prime video as well, I'd give it another star. But right now, it's halfway there.  I don't use it often because my other devices (Roku box, Blu Ray player) already have the same capability, and they're already plugged into my TV.  This just takes up another HDMI spot.  Nice try, google!", "verified": true, "helpfulness": "1/1", "author": "Steve K \"Steve K\""}, {"rating": 5.0, "review": "This is a no-brainer. It's not trying to compete with the Apple TV, Google TV, or Roku--it's attempting to forge its own class of products, and by doing so is making them seem obtuse. My Google TV has fallen into disuse over this dongle, and I can't imagine anyone buying an Apple TV for any reason other than being a brand whore.Recommended apps: Rocket Player, BeyondPod, AllCast, Plex, Rdio", "verified": true, "helpfulness": "3/3", "author": "Sampson Simpson"}, {"rating": 4.0, "review": "My husband has an app on his Android phone that allows him to stream movies for free. He has been wanting this for some time, so when the price dropped from $36 to $29, I decided he was worth it. It will only work on TVs that can get wifi connection. I don't know why, but I just expected the USB to be able to do everything. The reason I gave it 4 stars is because you have to charge the actual chromecast. The battery lasts a while, but it's still a pain. I assumed that being inserted into the TV, it would run off of that electricity. Over all, it's great, and my hubby loves it.", "verified": true, "helpfulness": "1/1", "author": "Stephanie Smith \"StephLee\""}, {"rating": 4.0, "review": "It works...Its just not really enough things I can stream using the chrome device yet... so I'll give it more time.", "verified": true, "helpfulness": "0/1", "author": "Malik W."}, {"rating": 2.0, "review": "I was very excited to get this. I maybe didn't read into it enough. This unit requires AC power to be plugged into it to work. This makes it not as convenient as it appeared. It seems to only stream certain apps from the IPad rather than display the screen content of whatever is on the IPad. I think that for the price it is a fun gadget to purchase. But it cant compare to the many other devices out there that are made to stream internet apps.", "verified": true, "helpfulness": "2/3", "author": "Chris H."}, {"rating": 2.0, "review": "I really really really wanted this to work.  It does work ok when I am just using chromecast, but when I am surfing the web anywhere else in the house, the wireless is totally screwed up now on my home network.  I have to reboot my laptop every time I want to surf the web if the chromecast is plugged in, and most times I have to reset my wireless router.  Kind of a joke if you ask me.", "verified": true, "helpfulness": "1/2", "author": "Dallin Holland"}]