[{"rating": 4.0, "review": "We set this up on a friend's router and took the device home and it now is powered through our mobile devices. Which we were not expecting due to the extensive reviews we read and phone call we made to Chromecast. We were told it wouldn't work on our phones by someone at the company, but she must not have known what she was talking about because one of the advertisements says you can use it with your mobile device in hotels and whatnot when there isn't great connectivity to the internet, so we just dug until we figured it out on our own.It does have a few bugs with how I am using it, which I am sure isn't the norm for other users. The only thing I don't like much about it is that it tends to lose the network here and there in between videos or pauses. The only thing that I have found to work when this happens is unplugging it from the tv and rebooting the internet as well and then for some reason I have to go through the chromecast app on the computer and set it up to recognize my password protected internet, but I can't complain since it is only $35.", "verified": true, "helpfulness": "0/0", "author": "Carissa Keeler"}, {"rating": 4.0, "review": "...I set it up and tried it out.  It is rather limited in the sources (YouTube, Google Play, etc.) you can use, but I don't expect that to last for long.  There is a slight delay when you initiate the streaming, but once it started I had no stuttering, pauses while buffering, etc.  The resulting video was in HD and looked completely fine.I only wish I could display my own pictures and whatnot via this device without jumping through hoops to do it.", "verified": true, "helpfulness": "0/0", "author": "Docdra"}, {"rating": 2.0, "review": "it will not stream content other than netflix and youtube and hulu+.  it will NOT EVEN stream my AMAZON PRIME!", "verified": true, "helpfulness": "0/0", "author": "Ed Green"}, {"rating": 5.0, "review": "Awesome product, super easy to use.  Really cool addition to the living room.  Also gave out as client gifts and they were super well-received.", "verified": true, "helpfulness": "0/0", "author": "morgan"}, {"rating": 3.0, "review": "In theory this should be a five star review. The device is simple, very easy to use and set up, it has support on a lot of devices and it even supports the Chrome browser as well. The price is also too good to be true. I remove two stars because of Google. Why haven't they opened up this device for other content providers to work with it? I see no reason why every video or audio app couldn't have access to the device. It is very unfortunate that you have to resort to hacks and such tactics to be able to use it more widely. Hopefully Google will see reason and open up their API for all content providers to use.", "verified": true, "helpfulness": "0/0", "author": "David Thorarinsson"}, {"rating": 4.0, "review": "My kids and I are easy-to-please users.  We aren't doing anything particularly demanding, so keep that in mind as I ooze enthusiastic about Chromecast.LIKES--price.  Low price and it solves a lot of our demands.  We have more televisions than we need, and we now want to use them watch ChuggaConroy and other LPs; or Michelle Phan.  The Chromecast lets us do this from every laptop.--easy to install.  Okay, the hardware is super easy to install.  The software is bit stupid and doesn't have great directions, but even stumbling around like I did, it didn't take more than 10 minutes to set up.--once you have the Chromecast software downloaded, you can easily cast videos or whatever using the Chrome browser.--works on MACs, works on PCs.--LOVE, LOVE, LOVE that I can set something to cast to the TV, and it is possible to turn off the sound and action on the PC so I can continue to blow up jewels and/or piggies.DISLIKES--I wish the instructions had been a little clearer, but I think Google spends so much time making sure that no one can understand their SEO policies that they've forgotten how to write concisely.--doesn't support 'locally' stored mediaWe have simple needs and thus are VERY PLEASED with this inexpensive toy.Pam T~mom/fur-mom", "verified": false, "helpfulness": "1/1", "author": "Pam - because someone has to be persnickety"}, {"rating": 5.0, "review": "very good product, good quality and appearance, easy to install and configure, good price and good alternative to more expensive products", "verified": true, "helpfulness": "0/0", "author": "juanh"}, {"rating": 4.0, "review": "love this chromecast , only one big draw back is there are not enough appsgoogle  said they are coming then i'd would give it the fifth star.", "verified": true, "helpfulness": "0/0", "author": "Allie H. Shaheen"}, {"rating": 5.0, "review": "All I can say is AWESOME! For $35 bucks, this little guy packs some great features. I love the ease of watching a movie. Just buy it on your phone and throw it up in all its HD glory on your TV. It doesn't restrict you from doing anything else on your phone. Throw up a movie on your screen then go out to a party, make phone calls, surf the web, play a game. DOESN'T MATTER! Your video will continue to play uninterrupted!", "verified": true, "helpfulness": "0/0", "author": "Steven Sheffey"}, {"rating": 5.0, "review": "I'm giving Chromecast 5 stars for 3 reasons:(1) It installed easily, using the adapter to fit in my TV's tight spot;(2) It set up and worked on the first try, seamlessly accepting my wi-fi; and(3) after weeks of use it's still working great, on the first try, every time I switch from TV mode to use it.This product is worth the $35 cost.You do need to be (somewhat) wi-fi literate because you need to get the Chromecast to \"talk\" to your wi-fi.All of this and Amazon also delivered it in just 3 days even when I selected free (longest) shipping.", "verified": true, "helpfulness": "0/0", "author": "Adam Daley Wilson"}]