[{"rating": 5.0, "review": "Fast, looks great. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have really enjoyed watching older TV series.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good tv", "verified": true, "helpfulness": "0/1", "author": "Scott Johnson \"The Painter\""}, {"rating": 5.0, "review": "Had a little issue figuring out how to add the Netflix app, but that is now solved and the Amazon Fire TV box far surpasses the Netgear box I have been using.  I can now watch Amazon Prime and Netflix on my tv.  May decide to get a second one for the other tv that still has the Netgear box.Well worth the investment.", "verified": true, "helpfulness": "1/2", "author": "C. ANDERSON"}, {"rating": 4.0, "review": "Pretty cool so far. This is the long awaited upgrade to both our Vizio Costar Google tv and our apple TV.  Streaming from prime is decent, streaming from the DLNA server in the basement is good, too. Voice search works really well. Say what you will about some of Amazon's house brand products, but I think when it comes to voice recognition, they're the leader.Hoping to see better apps and additional media sources for Fire TV as time goes on. Really appreciate the CPU and memory bump over competing products.", "verified": true, "helpfulness": "0/0", "author": "Bob Perye - Rogue Estate BBQ"}, {"rating": 2.0, "review": "Not good for us. We are BIG Netflix users and I was unable to link my Netflix account password to the Amazon Fire TV. The online help wasn't much good either. I spent about 2 hrs trying to figure it out and then gave up. I did like the voice command function though, very nice.", "verified": true, "helpfulness": "0/1", "author": "Copyboy41"}, {"rating": 4.0, "review": "Great!!! Love the wireless feature!", "verified": true, "helpfulness": "0/0", "author": "Anissa Levesque"}, {"rating": 4.0, "review": "We've had an Apple TV for a few years and bought the Amazon Fire TV to use on another TV in the house, and to provide access to Prime shows. Nice looking interface and the remote allows you to make voice commands (works well!)A few things could be improved to make this a five star product:1. It seems like every month the unit makes me type in the e-mail address and password for Netflix - a major inconvenience since it has to be done via the remote2. When selecting Netflix, you have to select whether adults or children are going to be watching - every time3. It seems that most of the Prime shows are provided at a charge - it would be nice to see the free content organized more clearly so you don't spend time browsing shows, only to learn later they're going to cost", "verified": false, "helpfulness": "1/1", "author": "George Roark \"www.TheGardenHound.com\""}, {"rating": 3.0, "review": "Not easy or obvious how to connect to NetFlix", "verified": true, "helpfulness": "0/0", "author": "Belle Cat \"old lady\""}, {"rating": 5.0, "review": "Great media player. Got it when amazon was running the student discount, and pick it up for around $70. I'm sure it is very similar to Apple TV and the Roku 3, but since I had prime, I went with the Fire TV. I love how responsive the remote is, as well as the no line of sight usage. I must say that I was really impressed with how accurate the voice function was, but I have one gripe. It only works on prime movies. For instance:If I say \"Skyfall on netflix.\" It will find Skyfall on amazon prime, but not for netflix. I really wish the voice function brought up netflix options as well as prime. Not a big deal since this is an amazon product and I'm sure it was purposeful in that it makes more people use their prime app for watching movies, but still would like that option.", "verified": true, "helpfulness": "0/1", "author": "Jfilms"}]