[{"rating": 4.0, "review": "I like it very simple to operate but limited functionality. Good for watching You Tube on non smart TV . May buy couple of more.", "verified": true, "helpfulness": "0/0", "author": "zwaliany"}, {"rating": 5.0, "review": "Can't beat the price and it works as advertised. Our only complaint is that screen definition suffers when the internet signal is poor.", "verified": true, "helpfulness": "0/0", "author": "Gavin Leslie"}, {"rating": 5.0, "review": "Lots of apps, easy to use from my phone, easy to switch from one chromecast to another.  Setup is a snap, although it took awhile to find my router.", "verified": true, "helpfulness": "0/0", "author": "Lisa C. Bueno \"LB\""}, {"rating": 5.0, "review": "For the price, it really can't be beat. I have one for each of my TVs and they all work great!", "verified": true, "helpfulness": "0/0", "author": "Lucus Allen"}, {"rating": 5.0, "review": "Met my expectations ad beyond.  Now i can view netflix on the big screen TV without havingy computer or phone locked on the netflix screen. Love it!", "verified": true, "helpfulness": "0/0", "author": "Brian Horton"}, {"rating": 1.0, "review": "I tried to get this to work many times and it worked once for a day.  I tried another day and it could not find my network.  I've given up.", "verified": true, "helpfulness": "0/0", "author": "Beth A Williamson"}, {"rating": 1.0, "review": "After I bought it to use on my Kindle Fire HD I found out that it would not work with it.", "verified": true, "helpfulness": "0/0", "author": "Edward J. geiser"}, {"rating": 1.0, "review": "I have to continuously reboot this to get it to work.  The connection gets lost all of the time.  It is super annoying", "verified": true, "helpfulness": "0/0", "author": "Ash"}, {"rating": 4.0, "review": "It's not bad thought there might be more free content in the internet that one could view not so much", "verified": true, "helpfulness": "0/0", "author": "Mike Mullett"}, {"rating": 5.0, "review": "I have had this for awhile and I am still enjoying it immensely. In my attempt to save money, I opted not to get cable and sign up for HuluPlus in addition to my Netflix subscription. Since I don't own a computer, I was watching all of my shows on my tablet; enter Google Chromecast. All of my Netflix movies and show, without the sore elbows (from being propped up in bed)=Priceless. The set up was very quick, and I was casting before I knew it. Though I love it, the only flaw I have encountered is that sometimes shows will say \"loading\" and never load. When that happens, I unplug the Chromecast from my TV and let it rest. I plug it in later and I am good to go.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Queen of Bookdom\""}]