[{"rating": 4.0, "review": "I like this little widget, which helped me cast video and webs from my laptop to TV. Save me from connecting a lot of wires between them.One bad thing is, the web cast eats a lot of CPU, which makes the whole computer very slow. Performance improvement is expected.", "verified": true, "helpfulness": "0/0", "author": "Michael Sun"}, {"rating": 5.0, "review": "This is literally the best thing ever. Works perfectly and is used daily. Have not ran into any problems. Want to order a second one as a gift!", "verified": true, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 3.0, "review": "this item is very easy to set upwork as descripprice is okfunction limitedgoing to give away as gift.", "verified": true, "helpfulness": "0/0", "author": "Andy Chen"}, {"rating": 1.0, "review": "ok there are a couple of things  that a 'non-computer»  person should probably know,  one-  if you have an android device such as mine's a kindle fire'  chromecast will no be supported on this device.  two-  it will tie up any device that supports chromecast, the mirroring aspect of it.  which means that you can't use your tv controls but the mirrored device, ie phone, computer or kindle. three-there are limited apps that support the chromecast amazon prime streaming is not one of them.  it was not what i expected which was to be able to use my tv controls and the select apps available could not be used without tying my phone which because I have an older computer and kindle fire, was the only device I would be able to use with chromecast.  this was my experience and am sending it back and don't forget there will be a $5.00 restocking fee.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I made a few adjustments on my Google page and it works great with my HTC One and my laptop.", "verified": true, "helpfulness": "0/0", "author": "Roderick Pullen"}, {"rating": 3.0, "review": "First, I was going to write a \"flaming\" review of this item when I tried using it using a newer desktop (Wireless and Windows 8).  Simply stated, I thought it was junk.  Skippy video and audio.Then, I tried it using a tablet (Google Nexus).  The darn thing works great when I use the tablet.  Both the desktop and tablet were in the same room and distance from the TV.My conclusion...  I decided Windows 8 pretty much stinks a long time ago and it doesn't surprise me that it makes this thing not work well either.  With the tablet, it's sweet.", "verified": true, "helpfulness": "0/0", "author": "Jeepers"}, {"rating": 5.0, "review": "I'm just waiting for more worldwide apps, not just for USA, but with the current apps I can cast my music/photo/video library into the Tv.", "verified": true, "helpfulness": "0/0", "author": "Otto Gamboa"}, {"rating": 5.0, "review": "Love this product, everything I expected and more. Just plug in and go, so easy to use totally worth it.", "verified": true, "helpfulness": "0/0", "author": "michelle taylor"}, {"rating": 2.0, "review": "I bought this few month ago, at the beginning it was all happiness , well , not anymore; The buffering is to often now; When I'm watching Netflix it drops the broadcast continuously, I would not recommend it. I know Google can do better...", "verified": true, "helpfulness": "1/2", "author": "Maria Sanchez"}, {"rating": 4.0, "review": "I owned a Roku3 before I purchased this for a secondary television. It took me several tries to get it working correctly. I have a router extender, and it doesn't work well with one. I finally got it to work with my original router, but I think there will be delays in the projection because of the distance to my router. Anyway, the app works well. I am not sure if the Chromcast has as much content available. I haven't used it a lot, so I can't say for sure. I bought it because I am about to ditch cable and wanted another option for my televisions.", "verified": true, "helpfulness": "0/0", "author": "D. Harris \"prazdancr\""}]