[{"rating": 4.0, "review": "Really like it.  Opened the package, made connections, plugged it in and Bingo started watching old TV programs and movies.Great product.", "verified": true, "helpfulness": "0/0", "author": "Walter J. Dudek Jr. \"Poppop\""}, {"rating": 5.0, "review": "EAZY TO USE AND I LOVE THE GAME MY FIRE TV CAME WITH SEV ZERO!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We love this product!", "verified": true, "helpfulness": "0/0", "author": "dannyb"}, {"rating": 5.0, "review": "With YouTube dropping my older Sony player, this was a good option for me.", "verified": true, "helpfulness": "0/0", "author": "sheri poland \"missypop\""}, {"rating": 5.0, "review": "Have been very happy with this little device.  Installed in our bedroom, this is better and faster than many of the other steaming options we currently use, or have used in the past.Load times on programs and videos are very fast and I have had no issue with crashing programs like on some other devices.  In addition I like that the controller is bluetooth and that I can use it without having to have line of sight.  This means my fire tv is tucked behind the tv itself on the wall mount.I have gamed a little on this, but I like that I can use almost any bluetooth controller, and am not limited to only Amazon's.  Also the device seems to be fairly friendly to side loading apps and games which really can expand its usage.For the price, I have been really happy with this purchase.  I was initially hesitant because I didn't want to be limited to amazon, but that has not been the case.  Only wish is that the voice search (which is also great btw) would work in some other apps like the Netflix or YouTube app.  Probably incompatibility in the apps themselves but I would love to see Amazon work this out.  Would really increase the utility of the device.", "verified": true, "helpfulness": "0/0", "author": "kinderdm"}, {"rating": 4.0, "review": "I like the fire box very much! It serves it's purpose well", "verified": true, "helpfulness": "0/0", "author": "godshelper"}, {"rating": 2.0, "review": "The device generally works ok. Navigation is a bit clunky, and the \"voice search\" has so far proven to be an unhelpful gimmick. However, the truly unforgivable detail is that this thing lacks on \"OFF!\" switch! Yes, it's possible to put the device to sleep with the right combination of keys. But tonight I came home to see the \"ON\" LED blazing away, and I had to turn on my TV just so I could get the on-screen prompts necessary to turn the stupid thing \"OFF!\"Amazon, you need to fix this. An \"Always On\" device is unforgiveable.", "verified": true, "helpfulness": "2/3", "author": "J P"}, {"rating": 4.0, "review": "I got Amazon Fire TV through the offer via Sling TV (pre-pay for 3 months and get $50 off the device). I was looking for an alternative to high-priced cable that didn't include connecting my computer to my TV (more on that below).The device itself is small, unobtrusive, and looks good. And for those who aren't very tech-savvy, it is easy to set up. Wireless connections in my house are challenging, so mine is a wired hook up, which involved three cables: ethernet (not provided), power and HDMI (not provided). The on-screen menu is easy to follow and in the short time I've had it  -- less than 10 days -- Amazon has made recent changes to improve the interface. Those who are not digital natives may find the use of apps a little challenging, but given the fact that there are only 6 buttons on the remote, the choices are limited. With practice, even my 82-year mother can navigate the system.The quality of audio and video are excellent (I do have \"basic\" internet service through Time Warner Cable and have had no issues). I've enjoyed viewing many videos/series through the limited selection of \"newer\" episodes made available through Amazon Prime (via a free 30-day trial period). I do have a Netflix account, so I'm able to view my watchlist via the device too. The Sling app and the Amazon Prime content are decent, but if you currently have cable or Direct TV, your viewing choices are very limited. You can install additional apps, but only those available via Amazon (i.e., YouTube, History Channel, A&E; channel, Lifetime Channel, TedTV, Pluto TV, Crackle, CBS News, BBC News, etc); and, many are subscriber-based (e.g., Netflix, HBOGo, FoxGo, SHO Anytime, HULU Plus).Amazon TV is an Android-based product, but - as mentioned above - the catalog of apps that are Amazon Fire TV ready are limited. Personally, I would like to to add local TV stations and other services, but the only way to do that is via my computer connection. \"Side-loading\" apps is not easy and many will not work.I'm not a big \"gamer\", but Amazon does offer some game apps as well. I did get the gaming remote (as attempting to play any game with the Amazon TV remote would be challenging), and found the Bluetooth connection great. The handful of game apps I've tried have been OK, but many decent gaming apps cost extra (nominally from $0.99 to $6.99), which isn't a lot of money compared to games purchased for gaming consoles. Again, choices are limited and \"mainstream\" games (i.e., Walking Dead and Grand Theft Auto series) are large; given the amount of RAM available you have to choose wisely.All in all, I like Amazon Fire TV. If you would like to access local TV stations, you will need to consider a TV antenna. If you would like to connect to other apps, you will have to connect a computer or consider making your own box via XMBC/Kodi. Hopefully Amazon considers such upgrades in the future.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Thomas"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Nilysha"}, {"rating": 5.0, "review": "Amazon has done it again!", "verified": true, "helpfulness": "0/0", "author": "cmrocksj"}]