[{"rating": 4.0, "review": "Still going to buy a Roku. But love how this works. Gotta give Google props on this.", "verified": true, "helpfulness": "0/0", "author": "brandon huiras"}, {"rating": 4.0, "review": "Got it for Netflix but its good for a lot more.", "verified": true, "helpfulness": "0/0", "author": "A Santiesteban"}, {"rating": 5.0, "review": "Excellent Condition!!!!!", "verified": true, "helpfulness": "0/0", "author": "Akellia Wiley"}, {"rating": 5.0, "review": "Me encantó !", "verified": true, "helpfulness": "0/0", "author": "RoCío C."}, {"rating": 5.0, "review": "The best entertainment product by Google.", "verified": true, "helpfulness": "0/0", "author": "Janmarco Rojas \"jrojas\""}, {"rating": 5.0, "review": "Wonderful device at a low cost. I now have one on each TV in my home. Also great to take with you on vacation or travel to access Netflix and other great apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have a LG smart TV but this little device works so much better that after testing one I went out and bought one for all our TVs. As it uses phone/tablet as the controller it beats having to enter data using the TV remote. It also have more apps available than what LG provides to stream content (i.e. the typical Youtube, NetFlix, Crackle, and Hulu services ) on the Smart TV. There are more and more apps available on Google Play store every day. In Canada, CTV Go (free) was the first broadcaster to provide support for ChromeCast so you can now binge watch on missed episodes.But the BEST movie watching app by far is Web Video Caster (free) which can stream most movie or tv streaming sites without needing to use Chrome Browser as it has its own built in browser. Type in the URL in the address box, select the movie, and play it in whatever resolution including HD, then tap on the Chromecast icon and it will stream to the TV. I have had no lags issues at all watching HD content that some reviewers complain about. Get out the popcorn it's showtime anytime.", "verified": false, "helpfulness": "0/0", "author": "WestCoastGuy"}, {"rating": 3.0, "review": "It is not easy to stream your videos to the tv", "verified": true, "helpfulness": "0/0", "author": "Hugo Hormazabal"}, {"rating": 5.0, "review": "You can not miss it", "verified": true, "helpfulness": "0/0", "author": "Esperanza Castiblanco"}, {"rating": 5.0, "review": "Works as described. Constantly being updated and works every time.", "verified": true, "helpfulness": "0/0", "author": "Sally A. Wise"}]