[{"rating": 5.0, "review": "Awesome easy to use and no cable needed, hulu plus and Netflix and you tube is all you need!Best gadget ever !!", "verified": true, "helpfulness": "0/0", "author": "Janis Lee"}, {"rating": 5.0, "review": "The Chromecast works Fantastic and we really enjoy using it. My only complaint / suggestion would go to Google to have it work with more apps. The apps it does work with (Google advertises) it works perfectly, however, there are some other places to get streaming media and I wish it would work with them all.", "verified": true, "helpfulness": "0/0", "author": "Matt Lunsford"}, {"rating": 5.0, "review": "Everything was great, from the product to customer relations and delivering, it was all good. I recomend the store to anyone.", "verified": true, "helpfulness": "0/0", "author": "guilherme s muradas"}, {"rating": 5.0, "review": "We were initially using an HDMI output from our laptop to stream shows from ABC or FOX (just as an example).  After downloading the chrome app, we're able to just cast the browser tab directly to the tv.  There is an occasional issue where the sound doesn't sync with the picture, but usually the issue resolves itself before the next commercial.", "verified": true, "helpfulness": "0/0", "author": "Michael LaFleur"}, {"rating": 5.0, "review": "Really like this unit.  Easy to set up and use. I use it for HBOGo mostly since crazycomcast does not allow Roku to use that app.  Very limited menu, really only Netflix and HBOGo for me.UPDATE:  MLB app is a disaster this year on Roku.  A known big time failure of MLB after adobe changes and inept MLB customer care.  Chromecast works better and I am happy I own one in time for the MLB streaming fiasco.", "verified": true, "helpfulness": "0/0", "author": "brewster lewster \"brewsterlewster\""}, {"rating": 5.0, "review": "It works fine, but I seem to have a bit of trouble using my Android to control it.  A suggestion I have is that they find a way to allow connection to videos or photos on the controlling device to show them on  the TV.  I like it fine and for the money it is a good investment.", "verified": true, "helpfulness": "0/0", "author": "John F. Schad"}, {"rating": 4.0, "review": "Showing youtube on my TV has been solved 6 ways from Sunday. I'm looking forward to the.Casting a tab from desktop is really neat if you want to watch videos from a website like on-demand episodes from AMC that aren't available on TV.", "verified": true, "helpfulness": "0/0", "author": "David Engfer"}, {"rating": 1.0, "review": "The commercial that aired made it seem that whatever you pulled upon the screen of your laptop or other laptop device could be made to apprear on your tv screen.  That was not the case at all.  Only certain services such as Netflix which I already have on my smart tv work.  I gave it to my son-in-law who's a computer geek and he agreed that it was not what was advertised.  Total waste of money in my estimation.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this product... It allows you to stream Netflix, YouTube, Vevo and others to your television in crystal clear quality. Perfect for when you have people over and want to entertain.", "verified": true, "helpfulness": "0/0", "author": "Andrew Moran"}, {"rating": 5.0, "review": "Chromecast works great for Netflix and even streaming videos from websites in full screen.  I bought one for myself and my parents for Christmas and everyone has been happy so far.The only issue I've had was setting it up initially with my phone (Samsung Galaxy S4) that didn't work.  But once I used my laptop it setup just fine.  It's a great $35 purchase!", "verified": true, "helpfulness": "0/0", "author": "Z.Holle"}]