[{"rating": 5.0, "review": "great little gadget", "verified": true, "helpfulness": "0/0", "author": "demi56"}, {"rating": 3.0, "review": "It is usually pretty good at starting videos, but often fails to stop, pause, and rewind videos.  It can get pretty frustrating because sometimes the only way to stop a video from playing is to unplug the chromecast device.  It is still better than plugging my computer into the HDMI input on my TV.", "verified": true, "helpfulness": "0/0", "author": "J. Dobbs"}, {"rating": 5.0, "review": "Super easy to set up and makes streaming media from our phones/tablets/computers super easy! There are also games that have come out that you can view on the tv and use your phone as a controller.  Well worth the $30.", "verified": true, "helpfulness": "0/0", "author": "J. Bowring"}, {"rating": 4.0, "review": "I Like Google products. Wish this had more potential.", "verified": true, "helpfulness": "0/0", "author": "rich"}, {"rating": 5.0, "review": "I only wish it did more, because what it does... it does it perfectly! Very intuitive and 100% successful.", "verified": false, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "Chromecast is awesome! Especially good if you want to watch TV/movies with friends but do not have cable. The only downside is its success heavily depends on the quality of your wifi. Also, I can't figure out how to cast a movie that I am watching from a video... but if I looked into it I could probably figure it out.", "verified": true, "helpfulness": "0/0", "author": "Katie Lowell"}, {"rating": 5.0, "review": "Initially bought this to use BubbleUPNP on my home network. For that purpose (and everything else I've tried with it), it excels. Setup is rather simple (Just had to download an app to my Android phone for configuration) and it \"just works\". Streaming youtube to the TV is rather effortless (There's an additional button on my  phone's UI to stream to Chromecast), and it has had little to no problems displaying the stream from BubbleUPNP.The only single downside i can think of is that you *MUST* be connected to the internet to use the Chromecast at all. Even if you have media hosted on your home network, you (as far as I can tell) can't stream anything to the Chromecast without an active internet connection when you start. (I've had the internet cut out after an in-home stream started and it continued with no problems.) While this shouldn't be an issue for most users or buyers, it means that you can't use the Chromecast as a network streaming solution without an internet connection present. This was a little annoying, but not enough to dock a star. (Especially considering the value you're otherwise getting in this device)", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "Works great!  Great price.", "verified": true, "helpfulness": "0/0", "author": "SonikBlue"}, {"rating": 5.0, "review": "great product and price", "verified": true, "helpfulness": "0/0", "author": "Lee Braswell \"Lee\""}, {"rating": 5.0, "review": "What is there to say, this is a wonderful product.", "verified": true, "helpfulness": "0/0", "author": "NYeast"}]