[{"rating": 4.0, "review": "performs as advertised. nice product at a reasonable price. saved me the cost of purchasing an expensive integrated internet tv because this turns my tv INTO an internet tv without the additional cost.", "verified": true, "helpfulness": "0/0", "author": "keaka"}, {"rating": 5.0, "review": "Google Chromecast HDMI Streaming Media Player we just love the media player. I recommend this product to others it work fine.", "verified": true, "helpfulness": "0/0", "author": "reva bochner"}, {"rating": 2.0, "review": "Its a great alternative to 'cable free'. However, I think more developement can be done on the options available. I have a Galaxy 4s and have a number of apps on my phone that I'd like to watch on my Samsung Smart TV. ie: CW, A&E;, Food Network. I thought this device would give me the option to do that. Also, I had no idea what channels the device offered until after I got it. Add more channels!!!", "verified": true, "helpfulness": "1/1", "author": "Dereka Hendon"}, {"rating": 5.0, "review": "Before my purchase, there was confusion between Chromecast and the Roku streaming stick. I already have a Sony Blu-ray player for Netflix and Hulu. I chose chromecast because of its ability to cast Chrome browser tabs and mirror desktop screens- a feature I use quite often and one which Roku and the Sony blu-ray players lack. In my tests, the tab mirroring worked perfectly without any lags or buffering issues. Chromecast, being a google product, promises to introduce new apps on a regular basis. Hulu, Netflix and Youtube work perfectly regadless of whether you are using an ipad, android tablet or laptop. Setting chromecast up was breeze. Overall a great product for everyone.", "verified": true, "helpfulness": "0/0", "author": "Shrue"}, {"rating": 4.0, "review": "Works perfectly, very smooth and size is great.Should be integrated onto more apps though, but hopefully it will come with the time.", "verified": true, "helpfulness": "0/0", "author": "Victor Torres"}, {"rating": 5.0, "review": "Thanks google for taking some more of my money, to be able to watch my movies from you on my big tv, without using the anyoing remote to set them up. So easy to use. Plug it in, get you password or so and connect it to your google device. Love it.", "verified": true, "helpfulness": "0/0", "author": "T"}, {"rating": 5.0, "review": "Great item. I am impressed about the quality of this little gadget.The quality of the image is impressive. I broadcast from my phone, to a 46 inches TV, and the image quality is superb. I would have never imagined that I could actually see my YouTube videos on my TV with such superior quality.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I ordered this for a gift.  Its just what she wanted.  It allows her to view movies ona larger screen than the IPAD", "verified": true, "helpfulness": "0/0", "author": "susan currin"}, {"rating": 4.0, "review": "It works well with linksys but not quite as well on my netgear router.  Has been a lot of fun to have!", "verified": true, "helpfulness": "0/0", "author": "Paul Tirone"}, {"rating": 5.0, "review": "This cheap simple device makes it super easy to send video from super popular devices to your TV.  The second screen experience is fantastic and easy to use.  This is the first streaming device that we have that my wife instantly got and is able to use easily without issue.", "verified": true, "helpfulness": "0/0", "author": "John Yeager"}]