[{"rating": 5.0, "review": "Its working without any problem so far.", "verified": true, "helpfulness": "0/1", "author": "Raja Sekhara Reddy Kota"}, {"rating": 5.0, "review": "After living with it for six months it's really proven itself quite capable. We already had a Netflix enabled DVD player, but the Chrome cast is much more user friendly and it's been great streaming all of my apps like Pandora, Plex etc.", "verified": false, "helpfulness": "0/0", "author": "J. Kuster"}, {"rating": 5.0, "review": "Hey all,This product is simply amazing! I've had it for a month now and it has lived up-to everything I expected.Pros of Chromecast:- Anyone on your Wifi network will be able to access the Chromecast and send things to share to- I set this up using my PC, but was able to use a Macbook Air, an iMac and Android and iPhones all on the networkAfter unpacking the box, you plug the Chromecast into an HDMI port on your TV/device (the package also contains an HDMI port extender if needed) and the USB wire for power (comes with an AC Wall Charger Adapter),You'll need the Google Chromecast software installed on your computer (https://cast.google.com/chromecast/setup/) and Google Chrome if you want to use the option to cast tabs.Pros of this method:- Quick easy way to share pictures, email tabs, Google Drive files, etc.Cons of this method:- I do not recommend sharing videos or streaming them through the Tab Casting on Google Chrome.The Chromecast is also optimized for certain apps such as Netflix, Plex, etc. You can find these apps at this link (http://www.google.com/intl/en_us/chrome/devices/chromecast/apps.html) For these, you have the option of sending the video or show you are streaming to the Chromecast, which then loads the video onto it's own software; this means you can turn off the device that started the stream (the iPhone, Laptop, etc).Pros of this method:- You can have HD Quality video streams without any lagging- You can turn off the device which started the stream- You can pick up the stream from another device in certain apps (such as Plex)Cons of this method:- You need access to an app which has the feature to send video to ChromecastOverall, I definitely recommend this product.Pair this with an app such as Plex (which I use to share my video files) or Netflix and you'll be able to access the Chromecast on multiple devices.Let me know if you have any questions and best of luck with your purchase!Best,Sadik", "verified": true, "helpfulness": "0/0", "author": "Sadik"}, {"rating": 1.0, "review": "didn't work on my computer.", "verified": true, "helpfulness": "0/3", "author": "Alan Simmons"}, {"rating": 5.0, "review": "Great tool for video streaming", "verified": true, "helpfulness": "0/0", "author": "Lee M Lannert \"Lee\""}, {"rating": 5.0, "review": "They need to get twitch on this.", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "C'mon, everyone knows about the Chromecast at this point. Simple, cheap, and it just works for wirelessly displaying all your favorite web steaming to your TV. The one kink was using it with my Apple Time Capsule. Make sure to make the wireless network name a single word without spaces. Had a problem connecting before I made that change.", "verified": true, "helpfulness": "0/0", "author": "John the Trailblazer fan"}, {"rating": 5.0, "review": "We've got two of these now and we just might give up television as we know it. Just stream Netflix and other programs from your tablet or iPhone to your TV and there you go!", "verified": true, "helpfulness": "0/0", "author": "WestM \"westm\""}, {"rating": 4.0, "review": "Worth it for those who do not  want to fork out monthly fees to Verizon/ Comcast (o even r TIVO)  to stream content to a lone HD TV that might not be worth it to  you to get full time cable server or TVIO this is good solution- I use it on my basement 720P Hannaspree cheap Costco floor model to watch HBO Go or Netflix via Chromecast (Or Youtube)--have not used in little bit but hoping to see SHO ANYTIME on here-can not for life of me figure out why TIVO can not get HBO GO so I connect my PS3 as alterntive-if you own a PS3 or APPLE TV you might not find you need a CHromecast yet but for price its worth it-also for college kids with no cable service or antenna and ala carte movie renter from the Google chain guess its decent as you can not likely argue that you get more with full cable at least on movie  channels...original programming is only reason to keep premium channels on cable..time will tell if this becomes truly great device or just a nice stop gap for couple years..", "verified": true, "helpfulness": "0/0", "author": "BCP \"BCP\""}, {"rating": 5.0, "review": "amazing product, fast service", "verified": true, "helpfulness": "0/1", "author": "Aman"}]