[{"rating": 4.0, "review": "wish the voice search worked a little better, cant get it to understand silent letters. like Knight instead of Night. only Night comes up", "verified": true, "helpfulness": "0/1", "author": "B. . Swanson"}, {"rating": 2.0, "review": "I don't recommend this if you have kids and need parental controls.  The parental controls are a waste of time.  You cannot set the level of what you allow your kids to watch like you can with all of the other devices.  Once you turn on the parental controls you then have to type in the pin for every movie and tv show watched, regardless of the level you set on your Amazon Prime account.  You are better off sticking with ROKU until they get this thing fixed.I gave this two stars because I was expecting better from Amazon.  I was hoping to be able to finally cut the cable cord but until they fix the parental controls on this thing it is useless.If you do not have need of parental controls I am sure the device will work fine for you.", "verified": true, "helpfulness": "0/0", "author": "old guy"}, {"rating": 5.0, "review": "Much better than AppleTV. Quicker load times. Lots of options makes just about any TV a smart Tv.Wish previously viewed history was better across all platforms.", "verified": true, "helpfulness": "0/0", "author": "BigAlHurl"}, {"rating": 5.0, "review": "I think that this product is amazing. The Fire TV works better for me then my Apple TV and my Roku 3. I guess it has 3x the CPU/memory? Whatever it is I really enjoy it. Just some advice try to 'hard wire' the device. All devices seem to work better 'hard wired'. I have fast DSL copper coming to me from the phone company. I just pulled out all my Cat 5e and replaced it with Cat 6a Ethernet cable. I also replaced the DSL phone line from the wall to the modem with a very thick 15' shielded Belkin DSL Phone cord. I cannot believe the speed and performance increase I have gotten. My Fire TV never pauses to cache anymore. All the shows so far play straight through. Good Luck !", "verified": true, "helpfulness": "0/0", "author": "Jason Dude"}, {"rating": 3.0, "review": "Streaming is sometimes a chore  a lot of pausing", "verified": true, "helpfulness": "0/3", "author": "John byrne"}, {"rating": 4.0, "review": "This is a very fast compact box. I would give it 5 stars except for it not running one of amazon's own application. That application being amazon prime music. I find it crazy that they would release this software to run on so many platforms before making it run on their own hardware. I hope it is available soon. I tried launching some movies on Crackle and Flickster and they never complete and tell me to call customer support. I have yet to do that and plan to soon. Amazon prime movies run flawlessly and fast as can be. Once all the bugs are worked out, I plan on buying one of these units for each of my TV's in the house.Also, I ended up buying an Ipazzport KP-810-19R to control the fire tv, as the keyboard makes life a lot easier.", "verified": true, "helpfulness": "0/0", "author": "Brad V"}, {"rating": 5.0, "review": "I watch it when there are not to much on cable.", "verified": true, "helpfulness": "0/1", "author": "Doris Rucker"}, {"rating": 5.0, "review": "Great buy", "verified": true, "helpfulness": "0/1", "author": "samuel claxton"}, {"rating": 5.0, "review": "I haven't tested this yet, although I am  sure I will love thjis.", "verified": true, "helpfulness": "0/4", "author": "Ari"}, {"rating": 5.0, "review": "I am happy we got this. When our DVD player stopped picking up the internet I knew it was time to upgrade to something else. I had been toying with the idea of getting Fire TV and when it went on the 5 payment plan I ordered it. I signed up for the free 30 day trial of Prime so my two day shipping was free. It arrived as scheduled and set up was fairly easy. We had trouble getting Net Flix and Hulu Plus to play. A call to customer service and a helpful tech talked us through the problem and we were up and running in a few minutes. Movies load super fast. I have not tried the voice command feature yet. (You know? Find Gary Busey, from the TV commercial). We just scroll with the supplied remote. Amazon even includes batteries.I am not sure if I am going to continue with Amazon Prime after the free 30 day trial. Most of the a Video content is offered by Netflix and Hulu Plus. I don't like having to pay the entire $99 yearly fee at once. All in all I am happy with it and what I can do with it.", "verified": true, "helpfulness": "0/0", "author": "Jule Kijek"}]