[{"rating": 5.0, "review": "Its excelent", "verified": true, "helpfulness": "0/0", "author": "Amilton Santana da Silva"}, {"rating": 5.0, "review": "Its wooow", "verified": true, "helpfulness": "0/0", "author": "Mrs. D"}, {"rating": 5.0, "review": "Awesome product, perfect for streaming media from your phone or tablet to a tv, a definite must buy!", "verified": true, "helpfulness": "0/0", "author": "Eva olivas"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Park Jongryul"}, {"rating": 5.0, "review": "Did perfectly well.i have been able to see alot of movies,shows and lots of kids programs so that means my phone is free from my kids.Good products. Thanks", "verified": true, "helpfulness": "0/0", "author": "Bankole Adeosun"}, {"rating": 3.0, "review": "This adapter works but it is very slow.", "verified": true, "helpfulness": "1/1", "author": "Steve"}, {"rating": 4.0, "review": "Does what it needs to do. Kind of a novel idea really, if you think about. Was on the fence about acquiring something to make my television \"SMART\" for the longest time (even almost bought a ROKU). I don't have NETFLIX. I don't have AMAZON PRIME. I don't watch HULU PLUS. I hardly ever even watch TV. But the thing is, this device isn't just for you (or for me). It's for the whole family, and the room mate, and the best friend, and whatever ...you get the point. Everyone's got a(n) HDTV nowadays. It's just, some people have SMART HDTVs and others have the basic HDTV. The Google Chromecast is going to only keep getting better. I am hearing stuff about dual-core processing etc etc stuff happening sometime soon. I dunno. Basically, I can take whatever is on my laptop or my phone or my tablet and have it pop up on the television screen. That's it. Plain and simple. Think Youtube, Netflix, VImeo, etc. Sure beats spending $100+ for a dedicated player. And this, for the moment, will do just fine. <$50? Count me in!!!", "verified": false, "helpfulness": "0/0", "author": "mikedoeseverything"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Adau Tyub"}, {"rating": 1.0, "review": "Like many users, my unit is experiencing the brain freeze error that renders it useless.  I spoke to Google and they said it is a lonh known issue with no ETA on a fix.  Waste of money", "verified": true, "helpfulness": "1/1", "author": "rdnskrs \"rdsnkrs\""}, {"rating": 4.0, "review": "It lags a little sometimes - that is the biggest thing keeping it from getting 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Collins"}]