[{"rating": 5.0, "review": "Product was very easy to follow directions and set up and understand the installation! I would definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "AMJ"}, {"rating": 5.0, "review": "Phenomenal product. Sets up easy. Works better than well. While current content is \"small\" there is more than enough to slake every thirst.", "verified": true, "helpfulness": "0/0", "author": "C. Lance Barnett \"Dancing Man\""}, {"rating": 5.0, "review": "Excellent product. Does exactly what it says, and does it well. My son plays his minecraft youtube videos to our big tv while we are watching our own tv which is a bit annoying. There is no protection on the chromecast, so anyone who is on your network can \"cast\" to it via DIAL. But still it is an excellent product for the price. Can't wait for more compatible apps to come now that the SDK is released. I primarily use it for Netflix and YT. Would like to see BBC iplayer, Ted, and more apps able to cast.", "verified": true, "helpfulness": "0/0", "author": "mitchd"}, {"rating": 5.0, "review": "I love this, I am currently on a budge, and borrow my neighbors Wi-fi.  This beautiful piece of technology allows me to stream music and movies (via my Netflix account) with a click of a button from my Android phone.  No subscriptions required, one time purchase.  I have moved it between my house and my girlfriends, works great!", "verified": true, "helpfulness": "0/0", "author": "Shannon Cordero"}, {"rating": 3.0, "review": "Bought this for use with HD TV and apple products and found its function to be very limited. Few apps support streaming to chromecast at this time. However, for HBO GO, Netflix and YouTube it works great", "verified": true, "helpfulness": "0/0", "author": "Tom Kramer"}, {"rating": 5.0, "review": "it was so cool I bought another for my son. He was always hunched over his iPhone watching YouTube videos. I thought that if he was watching it on his TV it was better than being hunched over with his earphones blaring possibly damaging his hearing. The other bonus is that we can watch Netflix on it instead of on the Xbox.", "verified": true, "helpfulness": "1/1", "author": "Doc"}, {"rating": 5.0, "review": "i dont watch tv anymore, i use neflix and my chromecast, i watch everything. buy it and you are going to enjoy it", "verified": true, "helpfulness": "0/0", "author": "Leandro"}, {"rating": 4.0, "review": "Its amazing. I can't connect almost any device to the chromecast with the apps it supports. I can't wait until screen mirroring is introduced.", "verified": false, "helpfulness": "0/0", "author": "Zach Fulp"}, {"rating": 5.0, "review": "Exactly as described. Fast Shipping! Cant beat it for the price. Will follow up after a few months of use. The people that have setup up issues are because they have a guest network setup. If you do not have your wireless configured for \"Guest\" this is a pretty much a plug n play device.", "verified": true, "helpfulness": "0/1", "author": "SPG900T"}, {"rating": 5.0, "review": "I definitely recommend it to anyone who like to watch videos on the big screen like July Plus, Netflix, YouTube. Is easy to set up and fast the installing.", "verified": true, "helpfulness": "0/0", "author": "Jenova"}]