[{"rating": 1.0, "review": "Other than watching YouTube videos on your TV, this device is worthless. I have heard Chromecast compared to Apple TV. Not even close. This is my fault for not doing enough research.", "verified": true, "helpfulness": "1/3", "author": "Shawn"}, {"rating": 5.0, "review": "This is a great invention. I bought it for a guest Ron tv that isn't on our dish system. It works great. Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Glenda Hockersmith \"Glenda Hockersmith\""}, {"rating": 5.0, "review": "Does exactly what it is supposed to. Easily streams from pc to computer with very little trouble. Very happy with purchase.", "verified": true, "helpfulness": "0/0", "author": "Nathan Singhal"}, {"rating": 4.0, "review": "This little gadget does all it claims to do. The only reason I didn't,t give it 5 stars--I would like to see more apps that shake hands with it. Recommend to all that don't want to spend the bucks for apple m.m.", "verified": true, "helpfulness": "0/0", "author": "Michael Maddison"}, {"rating": 5.0, "review": "I was somewhat skeptical when I ordered this, I had a hard time believing something at this price would really let us watch Netflix & Hulu + on our TV and still be high quality.I have been very pleasantly surprised.  The picture quality looks just as good as any show or movie we watch on regular DVDs or TV.  It was very easy to set up (took about 5 minutes).  Works for Netflix & Hulu+ so we can watch the majority of TV shows.Extremely low price.  It wouldn't have surprised me at all to see this cost triple what it retails at, and I probably would have bought it even then.Occasionally has issues where the sync isn't quite working but turning off the app and restarting it fixed that issue.My only complaint is it doesn't really work with anything else beyond Netflix & Hulu+.  My wife has a number of tv station apps (like Lifetime and ABC) that she likes to watch to catch up on shows.  Occasionally there will be shows on those apps that are not on Hulu+ or Netflix so she will be unable to watch them on the TV (we are ditching our higher tv package).", "verified": true, "helpfulness": "0/0", "author": "Kyle Shanahan"}, {"rating": 4.0, "review": "Had to deduct a star for the ease of set up. Watch a You Tube video if you want the best instructions. Product works great with iPhone and Galaxy tablet apps. So far I have used this with Netflix, Hulu, and You Tube. All pretty simple.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 4.0, "review": "Works as expected...has limits. Needs others to join in besides YouTube and Netflix and hulu. If to worked like they say on tv, it would be awesome.", "verified": true, "helpfulness": "0/0", "author": "KEVIN A PARKE"}, {"rating": 4.0, "review": "I love streaming to the big screen but after a while of watching it will freeze up. Don't know if it is because it gets hot but my kids would use this hours on end to do Pandora, Youtube videos but after a little while it no longer works.", "verified": true, "helpfulness": "0/0", "author": "Sandra L. Wilson"}, {"rating": 5.0, "review": "Love it , simple to install and easy to use great product at a great price would recommend it to anyone", "verified": true, "helpfulness": "0/0", "author": "Douglas E. Hinkle"}, {"rating": 1.0, "review": "the product description was poor to the point that I purchased it thinking,instead of knowing it was not right for me.I have high speed broadband.Wrong uses WIFI. I have 3G wifi.Too slow.buffffffering", "verified": true, "helpfulness": "1/3", "author": "dennisjcorbin"}]