[{"rating": 5.0, "review": "Fan-tiddly-tastic. One thing I did not realize (that doesn't really matter to me, but might matter to you depending on your needs) is that it will NOT cast the Chrome browser off your phone or tablet, just computer. Via phone/tablet you can cast apps like Netflix, youtube, pandora, songza, and others.", "verified": true, "helpfulness": "0/0", "author": "Rajiv Nathan"}, {"rating": 4.0, "review": "I love being able to watch my streaming shows on our TV now!  Love this!  I've noticed it works better using my Macbook Pro vs my husband's old macbook.  FYI", "verified": true, "helpfulness": "0/0", "author": "Swedetria"}, {"rating": 4.0, "review": "it does what it was designed for, easy to install and setup. I was amazed that I was able to set it up so easily. You download the companion app on your device and it does all the work.The only thing I do not like is the lag. it has enough lag to make internet surfing annoying.", "verified": true, "helpfulness": "1/1", "author": "James"}, {"rating": 5.0, "review": "so easy a baby could do it!!! just download the app to your advices have your wireless password on hand and HELLOOOOO CHROMECAST stream media!!!! got it for my parents and for my husband and i we love love love it!", "verified": true, "helpfulness": "1/1", "author": "Fallyn Thomas"}, {"rating": 4.0, "review": "$35 vs performance is good. I have apple TV but I like this chromecast better.Reason is easy to control and comfortable. It is good quality", "verified": true, "helpfulness": "1/1", "author": "DavidCho"}, {"rating": 4.0, "review": "I am happy with the purchase it does just what is advertised. Now I use my big screen as a monitor for my laptop. Very easy to install.", "verified": true, "helpfulness": "1/1", "author": "Joseph P. Toepp"}, {"rating": 5.0, "review": "Great condition, works perfect!! very happy with product purchased. i would gladly get another one from this site.  Thanks a lot!!", "verified": true, "helpfulness": "0/0", "author": "Lkesdel"}, {"rating": 5.0, "review": "It doesn't always work properly, and it takes some tinkering to be used to its full potential, but you can't beat the price.  The chromecast has changed the way I interact with essentially everything in my house that is connected to my network.  If everything worked perfectly, I would pay over $100 for a device that does everything that this does.  At $30, I can easily overlook the glitches.", "verified": true, "helpfulness": "0/0", "author": "aoneal"}, {"rating": 5.0, "review": "I like this product so much that I have now bought one for each of my televisions, including one with no cable.", "verified": true, "helpfulness": "0/0", "author": "D. Fugate \"sunnydf\""}, {"rating": 5.0, "review": "I got this for my husband as a Christmas gift and our whole family loves it! We watch mostly Netflix, Hulu Plus and HBOgo for our source of entertainment rather than anything that's on TV/cable (and we eliminated the big package cable deals which often has 1000+ of channels with nothing to watch, ever). Often times though for movie nights we would squish together and try to watch it on the iPad or even a smartphone... Due to a big move that we are still unpacking from and having our \"entertainment gadgets\" still boxed up, that was our only option... We no longer need to squeeze together to stare at a small screen and that's a HUGE relief. This was so easy to set up and SO easy to connect to! I am truly satisfied with my purchase! I honestly do not write reviews often... Once in awhile I might to warn other consumers against a certain product or a seeker... But if you are considering it and you already watch a lot of streaming videos, this is a great little gadget!", "verified": true, "helpfulness": "0/0", "author": "Danbi Farnam"}]