[{"rating": 1.0, "review": "You can't hardly use it for anything...very disappointed...wanted to use with Google Earth on ipad or to project a web browser on the TV.  Will only allow streaming of YouTube.  Great idea, but not worth the money with its current limitations.", "verified": true, "helpfulness": "1/3", "author": "Tony DiBlasi"}, {"rating": 2.0, "review": "Seriously underwhelmed with this.  Glad I only spent $35 on it.  Only sporadically works with YouTube and you'd think of all the apps, one that Google owns would be well integrated.  Hangs periodically.  Limited apps.  Not a well thought out device and app roll out strategy.  Google fail.", "verified": true, "helpfulness": "0/1", "author": "Shawn B. Wikle \"wik\""}, {"rating": 5.0, "review": "This thing is awesome.  I might get rid of Cox cable now.  It took less than a minute to install.", "verified": true, "helpfulness": "0/1", "author": "Scott"}, {"rating": 5.0, "review": "I love my Google Chromecast and was watching it within hours of it coming NEXT DAY courtesy of Amazon Prime!  So easy to hook up, little to no explanation needed and I'm watching Netflix!!  The great thing is as they add more applications you won't need to buy another Chromecast.  Some of the other competitors have you buying new hardware every year.  Thanks Google!", "verified": true, "helpfulness": "0/0", "author": "Toloma"}, {"rating": 5.0, "review": "Goodbye cable!  This is all I need with netflix and huluplus!  Easy to set up and worked well even in room a good distance from router.  Yay!", "verified": true, "helpfulness": "0/0", "author": "Suzanne E Wallace"}, {"rating": 3.0, "review": "Kudos to Google for turning a concept into reality, its a first gen device so of course it is not going to work perfectly. After using it for a few weeks I have a few observations.1. Your wifi needs to be top tier in order for this device to be effective.2. It will work on older high def sets but will work better on a newer set. (that seems like an obvious statement)I have it, don't use it much.", "verified": true, "helpfulness": "0/0", "author": "Manuil J. Chavez"}, {"rating": 5.0, "review": "Google is up to it again.  Good plug and play technology but you will \"share\" your Wifi password with Mr. Google to do so.  I configured this device on my Nexus 7 and everything worked fine.  It asked for my Wifi Password during setup.  Then I downloaded the Chromecast app to my aging IPod.  Guess what?  No configuration required (we know who you are and we know your password already).", "verified": true, "helpfulness": "1/1", "author": "cloud2013"}, {"rating": 5.0, "review": "I bought this for my father as an alternative to cable-tv in his man-cave. I will be buying one for myself in 2014!The setup wasn't nearly as easy as google advertised.... But it was worth the half dozen setup misfires to finally get the thing working. It really does work!", "verified": true, "helpfulness": "0/0", "author": "Skip"}, {"rating": 3.0, "review": "It doesn't come with real instructions .When used with more than one deviceI have a difficult time getting it to communicate.", "verified": true, "helpfulness": "0/2", "author": "George Vota"}, {"rating": 4.0, "review": "have used it for pandora and netflix.  need to try hbo go and learn what others can be transmitted.  i originally thought i could send anything from my pc or smart phone", "verified": true, "helpfulness": "0/1", "author": "Bradley F. Keller"}]