[{"rating": 3.0, "review": "This is a good device to stream netflix, pandora, hulu plus and Google play music to your TV. But Google really needs to add more apps. it's great to have for the price but I'm hoping more apps down the road gets added to the chromecast .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The Chromecast is brilliant in that it understands how we consume content.  Rather than creating a separate set-top device, Chromecast understands that we typically consume content from second-screens (laptops, tablets, phones) while watching TV.  With that in mind, Chromecast turns your second screen into a remote for your first-screen (your TV).  By doing so Chromecast simplifies watching content from any device.It is important to understand, however, that it's a new technology that's still being developed.  It works very well with the limited set of apps .  It's also important to note that some apps are supported better on Android than in Chrome (on your laptop) and vice-versa.  As of now that's roughly Hulu+, Netflix, Google Play Movies/Music, HBO Go & Youtube.  For these apps you get a near flawless streaming experience.  see the wikipedia page for currently supported apps: [...]The other major feature is the ability to stream any Chrome Browser tab onto your TV.  In this case the quality wasn't that great.  Videos streamed in this way were grainy and stuttered.So what it comes down to is this.  If you are the type of person who uses your laptop, tablet or phone while watching TV, and want a simple way to send content to your TV, this is a great device.  Just make sure that the bulk of your content is in a supported app (see the wikipedia page).About the setup process,  I did have some setup problems when I first tried using my Chromebook.  I instead ran the setup from my android phone which triggered a software update on the Chromecast.  After the software update, my Chromebook had no problems connecting to the Chromecast.  So if you have problems detecting the Chromecast, try another device.  If things go really wonky you can hard-reset the Chromecast by pushing the tiny button on the dongle itself for 15sec (it's near the usb port on the dongle).", "verified": false, "helpfulness": "0/0", "author": "Tony M."}, {"rating": 5.0, "review": "This little guy started out with its fair share of problems (it kept on kicking out of the program being watched) however it seems there has been an update that has fixed this and I LOVE it now.", "verified": true, "helpfulness": "0/1", "author": "Matt"}, {"rating": 5.0, "review": "It came in on Saturday, have used it for 4 days now watching Supernatural via Netflix and I love it.  Haven't used the other options yet, but we are heavy Netflix users so for the price I wouldn't care if they didn't work as well!  Extremely easy set up!", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer \"ladystone67\""}, {"rating": 5.0, "review": "Great dangle for fun.Easy to configure, and watch anything from your iphone to show up on big LED TV is fun.", "verified": true, "helpfulness": "0/1", "author": "Tom"}, {"rating": 4.0, "review": "I am impressed with the tab casting abilitiy. Setup is easy if your workstation is on the same wireless network (Otherwise just use your phone to configure the device).Once I can get Chrome to play local media in a tab properly and I can cast it then I'd go 5 stars.Youtube and Netflix work flawlessly out of the box.", "verified": true, "helpfulness": "0/0", "author": "FreePhoenix"}, {"rating": 5.0, "review": "Can connect your phone, tablet, or computer to it one at a time and watch anything you want. This is an awesome product.thanks", "verified": true, "helpfulness": "0/1", "author": "Mohamed Zreiba"}, {"rating": 2.0, "review": "Altjhough Chromecast does give me the freedom to watch a few things my Roku box doesn't, such as ShowtimeAnytime, it is highly unreliable, often jamming or skipping AND 100% OF THE TIME THERE IS A LAG BETWEEN AUDIO AND VIDEO....it's like watching a poorly dubbed foreign language to english translated movie. I have a very fast internet connection and router and my router and chromecast are close to each other as recommended. I would seriously advise anyone considering this purchase to spend the extra money for Apple TV, Roku, etc. Chromecast is a total disappointment.", "verified": true, "helpfulness": "0/0", "author": "Doug Desenberg \"Doug D\""}, {"rating": 4.0, "review": "Works very well as it is described to do. I would love to see more apps being compatible as well as Android Mobile Chrome Browser having the capability to cast as well.", "verified": true, "helpfulness": "0/0", "author": "Brad M Warner"}, {"rating": 3.0, "review": "I bought this thinking it would be pretty neat.  Maybe it's my wireless AP but I can't get good quality streaming video out of it.  The video is choppy and it lags pretty bad. I have a good wireless signal with a newer DLINK wireless AP, but just can't seem to get it to work very well.  It was cheap so I'm not all that dissapointed, but I thought it would work better.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}]