[{"rating": 5.0, "review": "The best 35$ I ever spent", "verified": true, "helpfulness": "0/0", "author": "amazillian"}, {"rating": 5.0, "review": "The chromecast is very versatile VERY versatile........finding new features all the time", "verified": true, "helpfulness": "0/0", "author": "John G \"John G\""}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "manuel22h"}, {"rating": 5.0, "review": "YouTube and Netflix is all I need. Visual clarity is so much better with the Chromecast than with my Xbox slim. I got slow ADSL( about 500 kbps, 70 kBps) and yet it plays flawlessly, that is if no one else is on my router.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is way better than just having Netflix... Why pay for cable. So easy to set up from my Android. LOVE, Love, love Chromecast Love it, lovin' it... Right now! Absolutely wonderful!!", "verified": true, "helpfulness": "0/0", "author": "Jessicah Taylor"}, {"rating": 3.0, "review": "don't know how many stars I should give it. I think if it does work it's a great product. However, it seems to have problem updating itself. If you happen to be unlucky like me, got a firmware 12940 then it's an useless product. Amazon does provide good exchange service. Hopefully I can get one with the latest version two days from now", "verified": true, "helpfulness": "0/0", "author": "Hana Lee"}, {"rating": 5.0, "review": "Love this product!  Can use my phone,  Tablet, or laptop to watch shows or movies on the tv.", "verified": true, "helpfulness": "0/0", "author": "dwar"}, {"rating": 4.0, "review": "I dig this...the only thing that I wish I could change is when I'm traveling in a hotel.  I want to watch something from my computer on my tv, so easy...just click the Chromecast button in Chrome (and turn the tv on).  It's so easy and seamless.I love the multi-tasking aspect...I can keep using my computer (I'm watching a youtube video on my tv while I'm typing this right now!) while watching.  Makes it all so easy.I wish it was easier to attach the chromecast device to a hotel wi-fi network.  If that could easily be fixed I will change my review to five stars.", "verified": false, "helpfulness": "0/0", "author": "Doreen \"massage therapist\""}, {"rating": 4.0, "review": "Pretty nifty!", "verified": true, "helpfulness": "0/0", "author": "Tallladytx"}, {"rating": 5.0, "review": "As expected", "verified": true, "helpfulness": "0/0", "author": "aishwarya ala"}]