[{"rating": 2.0, "review": "I bought this to cast Netflix and when it first arrived everything was writing great. Google pushed out a new version of the software and Netflix hasn't been working for a few weeks. Not sure start kind of priority thus has at Google but seems fairly low pub on food chain. If this hadn't happened it would have likely gotten 5 stars.", "verified": true, "helpfulness": "0/1", "author": "James Jaeschke"}, {"rating": 5.0, "review": "All their apps are very good, movies (netflix, crackle), tv series and I can navigate with google chrome on my LED tv.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Jimenez Marin"}, {"rating": 4.0, "review": "Happy with this.  Good deal for $30.  I did have to get quite close to it (less than 3 feet away) for the original configuration of the product to work properly, but it has been pretty solid.Casting to this thing does drain the battery on my Samsung Galaxy Note 3 and my Nexus 7 faster, but for $30 it can't be beat", "verified": true, "helpfulness": "0/0", "author": "Irvin Wells"}, {"rating": 5.0, "review": "I love itIs very simple to useThe best part is that you can watch YouTube Netflix on your tv while you text or call your friend and fam.Awesome!!!!", "verified": true, "helpfulness": "0/0", "author": "luz perez"}, {"rating": 5.0, "review": "I can stream anywhere from the house. It is the best thing I had to use for streaming. I use my tablet, S3 phone and laptop. it works great. I have no complaint.", "verified": true, "helpfulness": "0/0", "author": "FRITZ M."}, {"rating": 5.0, "review": "what a clean device.no issues what so ever,google has always been give us clean ui. with no lag.keep it up", "verified": true, "helpfulness": "0/0", "author": "Asha"}, {"rating": 5.0, "review": "We love our Google Chrome and use it almost exclusively to watch TV, perfect for watching Netflix, Google Play, etc.", "verified": true, "helpfulness": "0/0", "author": "AshleyR"}, {"rating": 3.0, "review": "Easy to setup and use. Just works with YouTube.  Be nice if it works with all videos on the device.", "verified": true, "helpfulness": "0/0", "author": "karim abdelbasset"}, {"rating": 2.0, "review": "I was expecting more than Roku. I was disappointed that the Chromecast would only mirror my laptop, so in order to have full screen on TV I could not touch my laptop. So... I returned Chromecast and I just put my old desktop behind my flat screen. So now I can stream directly at full screen. Total cost? Zero dollars. If Chromecast had a website with a list of channels to stream perhaps I'd have kept it.", "verified": true, "helpfulness": "0/0", "author": "D. Macena \"projectchrome\""}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Juan Xavier Jalon"}]