[{"rating": 5.0, "review": "Works great. No loading problems. You will get your money's worth.", "verified": true, "helpfulness": "0/0", "author": "Cinnamon"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "dave"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Julian Swain"}, {"rating": 5.0, "review": "It is so easy to use and I am a person that has so much fun with electronics.  Thank you for making it easy to use.", "verified": true, "helpfulness": "0/0", "author": "Sherry Allen"}, {"rating": 5.0, "review": "The absolute best player on the market.  With the addition of the plex player, streaming content is to easy.  Seriously this device is a must purchase if you are looking to cut the cable cord.  Currently me and my family spend less than $20 a month for all the stuff we watched on cable for over $150 a month.  This is the way to go, especially with all the great shows coming out for Amazon that are prime only and Netflix original shows.  Also there is rumor that HBO will finally let the reigns go on its service.  It will start on apple, but will quickly move over to devices like amazon fire tv.  The only thing I will miss is channels like redzone or nfl network, but I am sure eventually these services will jump on board as people continue to move this way.  Buy it today, you won't be disappointed.  ^ says the guy that runs a tech blog.", "verified": true, "helpfulness": "0/0", "author": "devprocb"}, {"rating": 5.0, "review": "It works as expected.", "verified": true, "helpfulness": "0/0", "author": "AM"}, {"rating": 5.0, "review": "Best way to cut the cable cord and stream.  Amazon fire streams very well and offers many app options.", "verified": true, "helpfulness": "0/0", "author": "RAUL GOMEZ"}, {"rating": 5.0, "review": "first one I purchased did not work but the second one that was sent works great. I am totally satisfied.", "verified": true, "helpfulness": "0/0", "author": "charles breitenbach"}, {"rating": 3.0, "review": "There is no way to secure the optical audio cable on this unit and it is constantly popping out. Not a well thought out cable interface.Good picture quality and sound. Simple to navigate.", "verified": true, "helpfulness": "0/0", "author": "Ken Y"}, {"rating": 5.0, "review": "this is amazing, so many wonderful shows and movies to watch. Unfortunately Comcast does not support HBO GO otherwise I would get rid of more stations like that on my cable bill. My Fire TV router is wired, no more buffering when I watch Netflix !", "verified": true, "helpfulness": "1/1", "author": "Dee"}]