[{"rating": 5.0, "review": "What are you waiting for? This is a must have media player for your TV if you don't have SmartTV built in. For $35, the price is unbelievable cheap for the content you receive. This thing is a lot cheaper than Roku or Amazon Fire. If you want to just watch youtube or Netflix, this will work perfectly fine.  Setup is also very easy and you won't have an extra player setup underneath the TV. Overall, I highly recommend the Chromecast and is a must have as long your TV supports HDMI.", "verified": true, "helpfulness": "0/0", "author": "George Hanks"}, {"rating": 5.0, "review": "Best stream device I have used. I like it better than any other.", "verified": true, "helpfulness": "0/0", "author": "Casey Doolittle"}, {"rating": 5.0, "review": "For the money it's great!  My kids and I spend a lot of time using it to share YouTube Videos.  They especially like all of the movie previews!", "verified": true, "helpfulness": "0/0", "author": "R. Weavver \"rocketchicken\""}, {"rating": 5.0, "review": "Great addition to my plasma tv. Easy to install and operate. Works extremely good.", "verified": true, "helpfulness": "0/0", "author": "dand"}, {"rating": 5.0, "review": "With the chromcast attached to my TV, I am able to push content from both my browser via the chrome extension, and also with my android device. As far as quality goes, it seems rather sound, and if your wireless router/access point is either N or AC, you shouldn't have an issue delivering HD content to it from your devices.", "verified": true, "helpfulness": "0/0", "author": "Garrett"}, {"rating": 3.0, "review": "..)", "verified": false, "helpfulness": "0/0", "author": "Joe Yammarino"}, {"rating": 1.0, "review": "Haven't got it to work with iphone . Very poor", "verified": true, "helpfulness": "0/3", "author": "nathan watson"}, {"rating": 5.0, "review": "I have officially canceled my cable tv after trying this out for a few months.  The chromecast does a great job streaming from the computer to the tv.  I am now $80 richer every month since I have purchased this.", "verified": true, "helpfulness": "1/1", "author": "Meghan Hubcap"}, {"rating": 4.0, "review": "Wonderful!!!, need I say more?", "verified": true, "helpfulness": "0/0", "author": "Jess McMaster"}, {"rating": 5.0, "review": "I recently got a Chromecast for Christmas (2013). I hooked it up to an older Panasonic Plasma in the bedroom that didn't have the smart TV apps. I immediately fell in love. This tiny little gadget breathed new life into my old TV.But it wasn't until I started using Plex media server, that it really started to shine. Chromecast + Plex Media server will out preform any smart TV on the marked. I loved it so much I bought a 2nd Chromecast for my new LG TV that even had all of the smart TV stuff.The other Chromecast apps are nice too (Netflix, HBO Go), as well as just tab casting. I've never experienced any of the lag that some other reviews mention.", "verified": true, "helpfulness": "1/1", "author": "Dave"}]