[{"rating": 1.0, "review": "Bought it at Best Buy on sale $29. They make you think what ever you are watching on your computer will nBe on the tv. Not so. Only hbo.go. and Netflix. Did not return it as I am hopeful that more content will be available soon. Also worked poorly on my 4 yr old laptop. Worked much better on my wife's ipad. If you are hooked on you tube I guess it's ok.", "verified": false, "helpfulness": "0/0", "author": "RenoRon"}, {"rating": 3.0, "review": "Awesome device if u have good wifi had to lower my setting because there was too many ppl taking up my bandwidth but  it stream fine after that", "verified": true, "helpfulness": "0/0", "author": "Sou Saetern"}, {"rating": 5.0, "review": "Haven't missed the $70+ monthly bill from Direct TV since I installed this - went to Netflix and haven't looked back once.", "verified": true, "helpfulness": "0/0", "author": "Cathy J. Zimmerman"}, {"rating": 1.0, "review": "Only positive is it lets you put your pics and videos on tv screen. Despite the commercials that indicate you can put anything from your computer to your TV, you cannot. In addition, mine is cutting off the right side of all pictures. I hate it and wish I had not wasted my money. I think it is being deceptively advertised.", "verified": true, "helpfulness": "2/18", "author": "Jules J. Mermelstein"}, {"rating": 1.0, "review": "I wish I did my research before buying!Only 16 apps supported, half of which are useless.This is great for YouTube and maybe Hulu. Netflix runs pretty slow. Way easier to use the Netflix apps on a Smart TV, Xbox or PlayStation.This device has so much more potential. If screen casting was available, then we'd be talking. I really thought that this was capable of that. Oh well, there will be another gadget that does it right!", "verified": true, "helpfulness": "0/0", "author": "BennyRuffSecs"}, {"rating": 3.0, "review": "Its OK I guess, was expecting more from it. Was an impulse buy, if you have a PS3/4 or Xbox 360/One, you don't really need this. wish it had more apps for it, maybe even the WWE Network app (instead of having to mirror it from Google Chrome). Would I buy it again? I doubt it. I would recommend it to someone who has an old flat screen with HDMI, but again if you have a gaming console, I really don't see a use for it.", "verified": true, "helpfulness": "0/0", "author": "Moises C"}, {"rating": 4.0, "review": "There have been a few software glitches, but overall it works well with my RCA TV's.  Google will continue to improve this I feel. Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Lee Scott"}, {"rating": 2.0, "review": "The streaming video part of it is fine. A good option if you have no access to a set-top streaming player of some kind. The background screen images are pretty.The biggest negative for me is that once your phone/laptop/tablet goes into sleep mode, power saving mode, or otherwise goes dark, you can no longer control the player or the video (no pause, rewind, etc.).  The only way to stop the streaming and regain control is to unplug Chromecast and start over.  In the sales pitch, Google doesn't mention it. They save that tidbit for the support forum, after you've purchased it: \"Playback controls can't be used after the video player has been closed,\" as when your device auto-locks or auto-sleeps.  I suppose you could plugin your device and keep it from going to sleep...but if you're going to plug something in, it may as well be a set-top player.", "verified": true, "helpfulness": "1/1", "author": "Duke M"}, {"rating": 1.0, "review": "I definitely don't recommend. It requires third wi-fi point which connects chromecast to the cell phone. I don't understand why it is not able to directly set up a link with phone.", "verified": true, "helpfulness": "0/1", "author": "NURI"}, {"rating": 3.0, "review": "I like how it connects my laptop and tv. however , if the wifi is not stable enough or maybe some other issue will cause video freeze quite often.", "verified": true, "helpfulness": "0/0", "author": "Misha"}]