[{"rating": 3.0, "review": "It is good. But the day I brought this My TV stooped working, but Chrome cast worked good on my friends TV.", "verified": true, "helpfulness": "0/1", "author": "saroj"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Phillip Call"}, {"rating": 5.0, "review": "Buy it.", "verified": true, "helpfulness": "0/0", "author": "MajesticKiwi"}, {"rating": 1.0, "review": "If you are an Apple User, DO NOT GET THIS PRODUCT. It does not do what you hope it will. Unless you are an android user, this is worthless.  Don't waste your money or time.  Buy an Apple TV instead.  I am now quickly approaching the hour mark on hold to talk to someone at Google.  The customer service is non-existent. At this point, I'm simply wondering just how long it will actually take to tell them I am taking this piece of dreck back.  It does not work as advertised with apple products.Almost no documentation, multiple apps must be used to even put your pictures or videos on the TV. Very frustrated, it is apparent that Google has no idea of customer service or how to make things that even work.Will post actual wait time once I get to talk with someone.Well, it's been over a hour and a half, no answer and I have had to switch phones as my battery was nearly drained.If I knew before buying this how Google seems to treat its customers, I would never have even considered it.I will now NEVER buy anything by Google.  I am deleting Chrome from my iDevices as I sit here listening to the lovely music provided by Google.GOOGLE SHOULD BE STOPPED AT ALL COSTS.  IT IS A TERRIBLE COMPANY AND TREATS ITS CUSTOMERS WITH NO RESPECT.Well, after two hours on hold, I finally gave up. I am now going to return the unit. It will never do what Google tries to say it does.", "verified": false, "helpfulness": "0/1", "author": "Dr. John"}, {"rating": 1.0, "review": "Sorry I gave it away.  Not as expected.  Directions not easy to understand.  I not a techie person.", "verified": true, "helpfulness": "0/0", "author": "Rippedoff"}, {"rating": 1.0, "review": "Dont buy Chromecast if you want to use it in any other room of your house other than the room with your router. It will not work. Strangely enough, Google, one of the most powerful and innovative companies in the world somehow released a streaming device that doesn't function further than 10-15 feet from a wireless router. Are you kidding me? I was trying to use the thing in my room, directly below the router. My first generation Kindle Fire has perfect wifi reception down there, and first generation Kindle Fire's are F^#*%}g awful devices! Come on Google!I guess that's what I get for trying something other than Apple TV (as fanboy as that sounds)Seriously, I'm about to buy another Apple TV, and honestly I think anyone reading this should do the same.CHROMECAST WILL DISAPPOINT.", "verified": false, "helpfulness": "1/1", "author": "Keel"}, {"rating": 5.0, "review": "Good as always", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"aquacop\""}, {"rating": 5.0, "review": "We love using our Chromecast", "verified": true, "helpfulness": "0/0", "author": "Richard C. Harp"}, {"rating": 4.0, "review": "its okay but make sure the person you buy it for is tech savy or else they may not use it.", "verified": true, "helpfulness": "0/0", "author": "Marco A. MacIas \"Pandastic95\""}, {"rating": 5.0, "review": "Little difficult to", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]