[{"rating": 5.0, "review": "Great streaming device and Amazon Prime Instant Video is awesome!", "verified": true, "helpfulness": "1/1", "author": "kristin McArthur"}, {"rating": 4.0, "review": "The device works very well.  The seach/voice feature works perfectly for Amazon only...which is to be expected.  I use it even more than cable.", "verified": true, "helpfulness": "1/1", "author": "RCA \"Richard C. Amo\""}, {"rating": 3.0, "review": "Was looking for something that would do what my Roku 3 does with a little more gaming aspect to it. It does what I expected with the gaming being a casual but fun experience but as for the TV aspect of it it does have many apps and once you are in an app they seem to work fine and a decent job on the picture and sound but I find the menu system to be very unintutive. I keep thinking I am missing something but have asked several other owners and they say this is just the way it is.  I found the Roku 3 menu layout to be way more intuitive though their idea of gaming is very poor.", "verified": true, "helpfulness": "1/1", "author": "Max J Yokell"}, {"rating": 1.0, "review": "I never use it anymore since it is always buffering and I could never get to Netflix.  I just go through Samsung and my Blue-Ray player right to Netflix and have no problems.  Not worth the money or time hooking it up.", "verified": true, "helpfulness": "1/4", "author": "A. Cowper"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "1/1", "author": "Miamifunworshiper"}, {"rating": 5.0, "review": "I am highly satisfied with my purchase of the  Amazon Fire TV. I have had the Kindle Fire since its arrival on the  market and I considered it to be one of my best entertainment  purchases I have made.", "verified": true, "helpfulness": "1/1", "author": "Frankl"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "1/1", "author": "Laurie Rogers \"Laurie Rogers\""}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "1/1", "author": "settar"}, {"rating": 5.0, "review": "Love it so far & better quality than Google stick ! Also less buffering ! Whole family likes it ! Me & my boys like the fun free games too & can't wait to receive the back ordered controller so we can check out more games !", "verified": true, "helpfulness": "1/1", "author": "Scott C Douglas"}, {"rating": 4.0, "review": "Like it, and use it primarily for accessing YouTube. We don't really watch movies, or play games.", "verified": true, "helpfulness": "1/1", "author": "John Warren"}]