[{"rating": 5.0, "review": "Lots of viewing pleasure.", "verified": true, "helpfulness": "0/0", "author": "Alleygl \"backstreet\""}, {"rating": 5.0, "review": "Awsome!!! You're not not just limited to certain apps anymore, just open app and \"cast screen\" and voila you're mirroring your phone screen, therefore you can open any app, video, picture etc.", "verified": true, "helpfulness": "0/0", "author": "Pmar"}, {"rating": 4.0, "review": "Works well with other devices..could be my PC", "verified": true, "helpfulness": "0/0", "author": "William Higgins"}, {"rating": 5.0, "review": "Its just better than I thought!", "verified": true, "helpfulness": "0/0", "author": "CruZ!"}, {"rating": 5.0, "review": "I love this", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This device is suprisingly awesome. I didn't expect much from a USB dongle that plugs into my TV USB Port but I have owned one for about 6 months now and I couldn't be happier with my purchase.Basically, you plug it in to your HDMI connection in the back of your TV. Then you have to plug the power cord into a USB Port either on the TV or into the wall. Then, download the app on your device which walks you through everything you need to do. Took me less than 5 minutes. After all that, you will be able to cast anything that supports Chormecast. I mainly only use Netflix and YouTube.What I like most about this device is that it is always ready. Anytime that I want to watch YouTube or Netflix on my TV, I open the app, change the input on the tv and cast the video. With other devices like XBOX or Playstation, I have to power it up and select the applicaton from a field of useless pre-loaded crap. Speed and efficiency are traits I look for in devices and this has it.What I don't like about the Chromecast is that I would really like to cast my browser or my desktop to the TV. You can cast your tab in google chrome however your pointer on the TV disappears. I'm not sure how hard it is to put out a patch that will correct this error but it must really be a brain buster.Overall, I love the Chromecast. I use it about every day and have never had a technical issue. I cast from my laptop, Ipad, and iphone without a problem. Also, I purchased one for my parents who will probably only use it for netflix but since it is so easy to set up it is perfect for literally anyone.", "verified": false, "helpfulness": "1/1", "author": "Nate Miklebost"}, {"rating": 5.0, "review": "I watch all the tv from the internets now.", "verified": true, "helpfulness": "0/0", "author": "RabidShopper \"-Heather\""}, {"rating": 5.0, "review": "Makes streaming easy. Love it", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 3.0, "review": "I've had the chromecast for 2 months now and really only use it to stream UFC fight pass events. So for its been nothing but a head ache, the stream cuts out every 3-5 min and it couldn't be more frustrating. Streaming Netflix is a little more reliable but so far I wish I would have bought something else.", "verified": true, "helpfulness": "0/0", "author": "Diego"}, {"rating": 3.0, "review": "Good product! Streams very good. The quality is not HD, looks fuzzy at times.", "verified": true, "helpfulness": "0/0", "author": "D. Click"}]