[{"rating": 1.0, "review": "Doesn't work with my old ass MacBook. :(", "verified": true, "helpfulness": "0/0", "author": "Justin M."}, {"rating": 5.0, "review": "This and Hulu or Netlix and you are good to go! (or Youtube or any other app)", "verified": true, "helpfulness": "0/0", "author": "Jerry Prince"}, {"rating": 5.0, "review": "Amazing Product!!! I Love It", "verified": true, "helpfulness": "0/0", "author": "Manuel A. Galvez C"}, {"rating": 5.0, "review": "Great product, excellent delivery time", "verified": true, "helpfulness": "0/0", "author": "Rui Rosado"}, {"rating": 1.0, "review": "Made my computer slow as molasses...", "verified": true, "helpfulness": "0/0", "author": "Dusty"}, {"rating": 5.0, "review": "With 20,000 reviews already in place, pretty sure the good, the bad, and the ugly has already been noted.  As for my experience, installed in under 5 minutes, video quality and connection has been excellent.  The only concern was how hot the unit gets.  A quick check on the chromecast site confirmed that this is normal operation.  If you want a review with more of what it will do and what it won't I am sure you can find one quickly above or below this one.", "verified": false, "helpfulness": "0/0", "author": "Lobstha"}, {"rating": 2.0, "review": "It's pretty much useless with subscriptions to pay content providers. Streaming video from a computer or phone stutters and is useless as well.Despite that, it's very easy to setup.", "verified": true, "helpfulness": "0/0", "author": "brian d foy"}, {"rating": 5.0, "review": "Great!!!", "verified": true, "helpfulness": "0/0", "author": "Pedro Javier Sorrentino"}, {"rating": 5.0, "review": "Great deal, fast shipping!", "verified": true, "helpfulness": "0/0", "author": "Mia Rucevic"}, {"rating": 1.0, "review": "I am very disappointed in this product.  It is not compatible with our wireless router unless we return the router to default settings and deactivate all security settings on the router.  Something that we are not willing to do.  I found out after a bit of research about the compatibility issue which should have been pointed in the product information.", "verified": true, "helpfulness": "0/1", "author": "William"}]