[{"rating": 4.0, "review": "I have used my new Google Chromecast HDMI streaming media player with excellent results on my Kindle Fire HD streaming Netflix to my TV. The best part of this is that for streaming the Netflix app it does not actually stream from the Fire HD using battery life, etc. Once the connection is made to the TV on the Chromecast device the Chromecast itself goes out the the Netflix site to stream the movie and the Fire HD has only a a small connection to the Google device to control volume, pause or stop.At $35 this is a great deal if you have the Fire HD and want to watch Netflix videos, or YouTube, on a bedroom, den or guest room TV that has an available HDMI port and good WiFi connection.", "verified": false, "helpfulness": "19/23", "author": "TruckeeRon \"TruckeeRon\""}, {"rating": 2.0, "review": "I spent some time playing with mine, and it took a long while to get set up. If you can go roku or Apple TV, do.", "verified": true, "helpfulness": "1/22", "author": "Derek A. Reiff"}, {"rating": 5.0, "review": "I just received it yesterday and hooked it up. Very easy to setup, you have 2 options for its power source. One through USB and the other through a power outlet (i like the USB because the HDMI and USB are right next to each other on my T.V.) Once you plug it in, you need to download the app on either your smart phone, tablet or laptop and it connects really easy, just follow the directions (it only took me about maybe 2 to 3 mins before i was using it) You also need WiFi for it to work. So far you can use it for Netflix, Youtube, Google Movie, and Google music. Hopefully later on there will be more apps that Chromecast will support. But for now it's great, i don't need to watch my netflix on a small screen anymore. I would recommend it.", "verified": true, "helpfulness": "1/2", "author": "Shaun C Lawton"}, {"rating": 1.0, "review": "Not worth the $35...It is very hard to set up and not friendly with dual band routers.  Roku is much better and easier to use.", "verified": false, "helpfulness": "3/47", "author": "Brian P"}, {"rating": 5.0, "review": "I Love this product!  It is cross platform so your android and iphone friends can come over and share videos or music with you easily.  Its simple, small and powerful.  The quality of the streaming netflix video via wifi is better than my xbox 360 plugged into the router.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up, easy to use. Quality is great and it just works with all of my phones and iPad.", "verified": true, "helpfulness": "0/1", "author": "Oversteer325"}, {"rating": 5.0, "review": "Awesome little device that casts to my tv. Now I don't have to be stuck watching on smaller screens. I got great high speed internet so everything is very smooth. Can't wait for developers to increase the apps that will be able to use it. Chrome browser cast works great for viewing web pages and content on my computer also. For the price this ROCKS! I also got the netflix bonus!!!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you're reading this to help you decide to buy it, you've unfortunately missed out on the 3 free months of Netflix promotion which really made this purchase a no brainer. Even without that, $35 for an easy to use device (very easy) with such potential is still an easy decision. At launch it only supports YouTube, Netflix and Google's Play services (video and music). I already have a blu-ray player with apps like Netflix, YouTube and Amazon Instant Video so this adds nothing for me at the moment in terms of streaming video, though using your smartphone as a youtube or netflix remote is FAR superior to trudging through the horrible \"smart tv\" or \"smart player\" interfaces. The music function is something I think folks aren't considering enough. You can add songs to the cue from your smartphone, and friends can add theirs as well, making for a \"party play\" functionality like the Nexus Q was going to have. This is a huge feature for when you have people over for a party. Everyone can share their music together through the Chromecast and it will just play out like a jukebox. Awesome. Pick one up!", "verified": true, "helpfulness": "1/1", "author": "dnmrosen"}, {"rating": 5.0, "review": "I've had the Chromecast for a a few days now.  I was one of the lucky ones to purchase it from Amazon before the 3-month Netflix subscription cutoff time.  It's great for streaming content from a mobile device to TV.  I have a iPhone, iPad, Samsung Galaxy S4, and Nexus 7 in my household and every device works flawlessly.  I know the SDK was just released and will take some time before more developers adopt this into their apps.  But as a developer, you'd be smart to adapt this asap since the Chromecast is flying off the shelves.  It beats the Apple TV and Roku by price at this point.  Once more apps hop on board, it might be a game-changer for this niche market.I have it connected via USB-powered through the HDMI port on my Panasonic Plasma.  I could care less about the auto-turn feature when connected via power adapter or HDMI 1.4 port.  All I care for is content on my TV without connecting multiple devices.  Hopefully, this is the future for all streaming media.", "verified": true, "helpfulness": "2/3", "author": "Hot_Foz"}, {"rating": 5.0, "review": "Very simple to use and works great with my Nexus 4. Playback video of YouTube, Netflix, and Google Movies works noticeably better than the airplay we use through apple TV.  Definitely recommended!", "verified": false, "helpfulness": "1/2", "author": "Jeff"}]