[{"rating": 5.0, "review": "My old man in his late seventies was missing all things video like YouTube in the information age.  The tablet he has come to e familiar with couldn't play loud enough to be of use.In comes chromecast.  Walla, he is in the youtube age.  He is used to seeing things on the television, (with a big volume control.)No this doesn't allow you to easily play all media from all sources, though the savy can trick it a bit.But for $35 dollars this fits the niche for those just looking to get a bit more out of their living room television.", "verified": true, "helpfulness": "1/1", "author": "phiscribe"}, {"rating": 5.0, "review": "It's perfect for what I need it for  YouTube, pandora, netflix, the works. I'm looking fwd to more apps being added as time goes along", "verified": true, "helpfulness": "1/1", "author": "Turi Cooke"}, {"rating": 4.0, "review": "I was expecting to be able to launch more apps onto the TV... unfortunately YouTube seems to be the only free app...", "verified": true, "helpfulness": "1/1", "author": "Ethan"}, {"rating": 3.0, "review": "The Chromecast works great if you have found your content in Netflix or are using the Chrome browser, but there are plenty of apps that do not support the Chromecast API.  I understand that Goggle is working on this issue, but for now the functionality is limited.", "verified": true, "helpfulness": "1/1", "author": "Business Reader"}, {"rating": 1.0, "review": "dont expect a remote media sharing, just usefull to see media staremaing on the web not for see your own media on you tv", "verified": false, "helpfulness": "2/4", "author": "Victor Espinoza"}, {"rating": 5.0, "review": "This came quickly and works great and I am considering getting more of them. Also It was a great price on it.", "verified": true, "helpfulness": "0/0", "author": "Emily Smith"}, {"rating": 4.0, "review": "I'm using this for living room TV, which is mounted on the wall. I got this for four primary reasons.1. Very low cost compared to apple TV and bly-ray players2. Low profile, would not take floor space. It hides behind TV.3. It's from Google. So expecting more out of this in future.4. It's cross platform, unlike apple TV. Works with most smart phones, laptops and tablets.I was able to setup using iPhone 5 using Chromecast app in less than 15 minutes. Steps are very simple. Much of this 15 minutes was taken by firmware update.Currently I'm using this from iPhone 4 & 5, Kindle Fire and Windows 7 laptop. Works as promised. But still I would not recommend for non-techies.a. This is not mirroring iPhone/tablet screen and currently only few apps works with this. You cannot even play music stored on the phone. Because of these its hard to grasp the concept how it works.b. Amazon app store does not have Chromecast app that you need to setup this device. That may not be huge issue as you can do the setup using another device, even laptop. Most annoying thing is amazon app store even does not have youtube app that works with it.c. Some apps those do work this are buggy. For ex. I was trying Vevo music video app (on 12/30/2013) and it was crashing again and again. But I'm sure those apps will stabilize soon.In sprite of all these cons, I would still recommend for most of you those are interested in trying new technologies with promising future with little cost. If you are non-techie, but can get someone to set it up and show you how it works, then I would recommend it for you too.", "verified": true, "helpfulness": "1/1", "author": "Debabrata Sadhukhan \"Deb\""}, {"rating": 5.0, "review": "Great item for great price. You can't go wrong with this unit. After setting up I've used every day and enjoy.", "verified": true, "helpfulness": "0/0", "author": "George M. Clark"}, {"rating": 4.0, "review": "I've only used it for streaming Netflix & Youtube, and it works very well.  Wish that Youtube videos embedded in a webpage were able to cast, and not just videos on Youtube itself.", "verified": true, "helpfulness": "0/0", "author": "T. Ford"}, {"rating": 4.0, "review": "It is good, and makes my TV Smart TV,  The only update I would need it is, Google Chrome should be compatible with IPAD so that we can cast the Chrome....  also not all video types are supported in Chrome presently...  In All Device is good", "verified": false, "helpfulness": "0/0", "author": "Fandu Ritesh"}]