[{"rating": 5.0, "review": "My Amazon Prime movies come in crystal clear and fast.The Voice Search really WORKS very wellMy Netflix resolution is excellent, much better than what the Netflix app on my LG flatscreen TV delivers.The Plex app delivers excellent video (I haven't tried the music yet).Having used this for a little over a week now my next step is to buy two more for each TV in the house and give away my Apple TV.  It simply does everything so much better.Most Satisfied! Highly recommend!I will post an update if I have anything further to add but I will say this:  Go get One - Really Worth The Price!", "verified": true, "helpfulness": "1/1", "author": "Paul L. Thwaites"}, {"rating": 4.0, "review": "It was a snap to set up and get a going. Movies and T.V. A delight to watch. Themusic comes clear and while playing just love those graphics. Another winner as faras I'm concerned.", "verified": true, "helpfulness": "2/2", "author": "Dendraspis"}, {"rating": 5.0, "review": "I collect these streaming boxes, anything from Google Chromecast to Dlink Boxee Box, Boxee TV etc. This Amazon Fire TV has been my go to device since it arrived.The menu could use some work, but it's most likely because I'm used to Apple TV and my iOS environment.The responsiveness is top notch. My favorite feature is the voice control, built right into the remote.I would only ask for one additional feature, the ability to plug headphones into the remote and listen silently.", "verified": true, "helpfulness": "1/1", "author": "Meddle"}, {"rating": 2.0, "review": "Amazon Fire is misleading. I recommend staying with an Apple TV. The device is very fast and the instant play is one of a kind. The voice search is unmatched by anything on the market. The only problem with the voice search and instant play is it only works for Amazon Prime videos. That is a disclaimer that should be noted somewhere. At least in small print.", "verified": true, "helpfulness": "2/4", "author": "Amazon Customer \"sarahstorrs\""}, {"rating": 4.0, "review": "As an owner of various models of Roku and Apple TVs, I didn't really need yet another streaming device,  But, I decided to give it a try. It works great.  I do like the voice search feature.  We tried watching some of our favorites like \"Midsommer Murders\".  All of the seasons and episodes showed up which was nice.  But only a few of the earlier seasons were watchable for free, and a few of the more recent were available for $5.99,  but most were \"unavailable\".  That happened to several other BBC series that we tried to watch.  However, the movies we have watched streamed without a hitch with good picture and sound.", "verified": true, "helpfulness": "1/1", "author": "Daniel L. McShan"}, {"rating": 5.0, "review": "ok, i'm not going to lie, this thing as the fastest setup. i thought i was seeing things when i turned it on for the first time. apparently this device is connected to your amazon prime account so once you turn it on, it automatically literally goes straight to your prime account without signing in. i seriously had to call customer service because i was really creeped out on if i signed in or not. anyway, this thing is way better than the roku. though i do wish they had a iphone app for it because the remote is so small and i tend to lose it alot. its pretty much the same formate on the roku when it comes to Netflix and Hulu. it goes to the next episode atomically like samsung smart tv and the roku but i guess its a common thing but amazon prime you have to select the next episode itself. i seem to see this in a lot of other streaming devices.", "verified": true, "helpfulness": "0/0", "author": "Jadeada"}, {"rating": 5.0, "review": "The reason this is the 2nd best purchase, is because my Kindle Fire HD is 1st...  This has been a great purchase and has so many options available when connected with Amazon Prime.  I have never been a big TV Watcher in the last few years, but I am back to it a bit with this device coupled with Amazon Prime.  I watch Movies and TV Shows with my wife and it is great.  If you spend much time in front of the TV, then I would say this is a must have and I love it almost as much as my Kindle Fire HD..", "verified": true, "helpfulness": "2/2", "author": "Ted Coombs"}, {"rating": 4.0, "review": "I thought you would get more with Fire TV box. I figured there would be more available through Prime. I like the functionality and we never have issues with it. I was just hoping for a little more.", "verified": true, "helpfulness": "0/2", "author": "Audrey"}, {"rating": 5.0, "review": "I am so impressed with this, Love all the options that are available to us. My husband is bed bound for the majority of the day after having a stroke a year ago. Having the choices offered with the Amazon Fire TV is wonderful for him, and I am loving the ease with which I can operate and choose \"what next\"  I had a Netflix membership but could only access on my computer now movies, games etc on the larger screen make it more enjoyable. We have watched movies offered through the Amazon Prime membership also, and haven't' experience a glich with either Netflix nor APrime, lots more for me to experience too.", "verified": true, "helpfulness": "2/2", "author": "cancun gram \"cancun gram\""}, {"rating": 5.0, "review": "I also had a ROKU 3, which I thought was really the best in its class until this Amazon Fire TV came along. Just to be brief, here're some comparisions between Amazon Fire and Roku 3:Pros:_ Speed:  Beat Roku 3 by a mile. It's very fast, just like advertised._ Voice Feature:  Works just like advertised. Roku 3 does not have this feature._ Sound:  Optical audio output to connect directly to surround sound system..something Roku 3 does not have._ Youtube:  Another important application that Roku 3 does not have either.Cons:_ No earphone/headphone jack on remote control. I found this to be Roku 3's  excellent and necessary feature,  especially if you have this in the bedroom. This is one single reason why I would still go with Roku 3 for the bedrooms in the house. If Amazon Fire could have this feature added, it would be perfect!_ Voice search does not work with Youtube and a lot other applications.  Another miss which could be addressed in the next upgrade ?Overall, this Amazon Fire TV rocks. Everything works as advertised, and that's rare for these days. So far I have not encountered any problems with this device. Would recommend.", "verified": true, "helpfulness": "1/1", "author": "ScreenRX"}]