[{"rating": 1.0, "review": "After several phone calls to Verizon (my internet provider) and the Google help line, I finally was able to confirm that the Chromecast device IS NOT compatible w/ the Verizon Actiontec router.  No where is this written but there are many online comments about this issue.", "verified": true, "helpfulness": "1/2", "author": "Nancy Fisher"}, {"rating": 5.0, "review": "Excellent product!  Does exactly what it says easily and smoothly.  I own 3 of these currently and am getting more for family and friends.", "verified": true, "helpfulness": "0/0", "author": "Matthew Wilkinson"}, {"rating": 5.0, "review": "I love how simple this is.  Out of the box and working in less than 5 minutes.  I've used this from my phone and my tablet. Being able to play movies that I've purchased thru Google Play is great.  There's no real technical expertise required here.  Once you download the needed app this works like a charm.  They seem to be adding new content that will play thru the Chromecast so I couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "DB"}, {"rating": 2.0, "review": "I returned this item.Reasons:- I am living on-campus and it was really difficult to register and setup the chrome cast.- It is very limited.- It is 720 p.Instead I bought an apple tv. It is much much faster to setup. You can project anything (from any apple device) to your tv. it is 1080 p. The cons are:  1) it only works with apple products (which is not an issue for me). 2) it is more expensive 90$. But, it worth the extra cost.", "verified": true, "helpfulness": "0/1", "author": "ars"}, {"rating": 4.0, "review": "Love this item. The reason for missing a star is that i cant play DVDs on my computer and stream to the chromecast. If there is a way, i have yet to figure it out. Other than that, its great to watch netflicks with.", "verified": true, "helpfulness": "0/0", "author": "Napa"}, {"rating": 5.0, "review": "The device works flawlessly with an Android controlling it -- I use both a Nexus tablet and a Galaxy S4. It truly is a plug-and-play device, no fuss, no muss. Right now I would say this is an exceptionally great option for streaming Google Music, if you have your music stored there (and why wouldn't you? Free cloud storage, people) as well as Google Play video content and YouTube. It's the first simple and good solution I've seen to watch YouTube on a normal TV.It's also possible to control the Chromecast with several different devices that have different libraries. It seems simple to switch among devices. The streaming happens from the cloud to the Chromecast dongle via Wi-Fi, not through your Android device, so it doesn't hog up your tablet's or phone's brain power. My understanding is that any computer or device connected to the same Wi-Fi can control the Chromecast.It is also a much cheaper option to stream Netflix and HBO GO than a Roku player; this bad boy is just $35. The other difference is that the Roku is controlled by a remote control, and the Chromecast is controlled only by an Android or iOS device. The advantage of the Roku is that using the Roku app, the Roku box can stream \"local\" content (photos and music etc. on your phone or tablet). I don't see a way to do that with the Chromecast yet, although presumably someone will create an app to do that at some point. Also the Roku has a lot more streaming services than the Chromecast right now, but for the basics, and especially Google Play Music and Video, it's the absolute best option.", "verified": true, "helpfulness": "1/1", "author": "Dagmar"}, {"rating": 3.0, "review": "Great gadget, great price. If you have an Android device or use Chrome this is a great way to get the most out of your content. Hopefully more apps and services start using this clever way to broadcast to your TV.Updated after a year with the Chromecast.  A ton more content will stream to the Chromecast now, but I really don't use mine much any more. Roku added casting and began filling in missing content and my Roku 3 is the device of choice for me. Yes, it is much more expensive than the Chromecast, but it really does more without needing another screen beside your TV.I still love the idea of the Chromecast, it just isn't as practical as I hoped it would be.  It is now third on my streaming list behind Roku and the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "Matt Griffith"}, {"rating": 3.0, "review": "I tried to set it up with my phone and after several frustrating minutes,  I used a laptop.  Even then it did not go as smoothly as advertised.  A friend purchased one and said it set up easily for him with an ipad.  I don't subscribe to hulu so its only function is for netflix.  It doesn't take forever to load up a show but it is not instantaneous either.  The picture is good and steady.  It does lag a bit when using an ipad or phone as a remote.  Would I buy again? Probably not. Google hasn't made a lot of content accessible. Like amazon prime.  There are so many other devices out there that stream netflix and more, I would just update my bluray or video console.", "verified": false, "helpfulness": "0/0", "author": "james lucke"}, {"rating": 5.0, "review": "i am loving it. Chromecase released their beta chrome browser casting of tabs and it works like a magician and its fantastic. a 5 star product at a dirt cheap price. I am loving it", "verified": true, "helpfulness": "0/0", "author": "Chirag Shah"}, {"rating": 4.0, "review": "Video quality is not HD.  Good for a basic picture.Works great to send your Android Google Play music to the TV and play out on your surround sound.", "verified": true, "helpfulness": "0/0", "author": "Robert T. Dennison"}]