[{"rating": 5.0, "review": "I really do love this product. I did my research prior to buying, I know that it has some significant limitations, but it is a great device for getting quick access to Netflix, I also have HBOGo, so it brings that up without a problem.  I have a few tv's that don't have cable access so it is helpful to bring in something to be able to view in the rooms where they are located.You do have to lower the resolution when you are projecting from a Chrome Webpage, otherwise it is just too jumpy.  I use it to view a lot of UFC fights from my computer.  I also like it because I can use it in conjunction with my Xfinity through my browser, not a specific application.", "verified": true, "helpfulness": "1/1", "author": "CollegeStealth"}, {"rating": 3.0, "review": "Needs more apps to watch videos from my iPad. Too many apps to download..Google should explain what is needed without having to go research for it", "verified": true, "helpfulness": "0/0", "author": "Rick Escobar"}, {"rating": 5.0, "review": "I purchased this device for use with my Barnes & Noble Nook HD+ tablet.  I was extremely pleased with the device.  It works great with my Nook HD+.  Easy to install the hardware on my TV and easy to install the setup app on my tablet.  The Netflix and YouTube apps cast without issue.  I did have to reposition my wireless router for best performance, but it was well worth it!  If you own a Nook tablet, the Google Chromecast will work great.  If you want to read more about my use of the Chromecast with the Nook HD tablet check out my article at [...]  Enjoy!", "verified": false, "helpfulness": "0/0", "author": "Randy A. Cook"}, {"rating": 3.0, "review": "It's just okay. Works great with YouTube, but it's terribly laggy with any video via Chrome. If you want this for YouTube and presumably Google Play it's probably great, but for anything else - eh.", "verified": true, "helpfulness": "0/0", "author": "Charles Babb"}, {"rating": 2.0, "review": "I'm a huge fan of Google, so I really wanted this to blow me away.  It didn't.  When you get right down to it, this device isn't much more than a wireless HDMI cable.  Sure there are other features, but nothing that makes me think this is a device worth having.  It's a little clumsy to use--nowhere near as intuitive as a Roku.  You also MUST HAVE an Android or iOS tablet or smartphone.By way of comparison, I have a Roku 2 and WD Live TV, and both of them blow the Chromecast out of the water.I do travel from time to time, and I'm hoping this will be useful then, but I'm not holding my breath.To be honest, I'd like to return it, but I got it for a super deal before the holidays, and by the time I pay return shipping, I'd be getting very little back.  Might as well keep it for those few dollars and see what Google does with it, especially since I still have my Roku and WD devices.If you have no devices for doing Netflix, etc., skip the Chromecast and get a Roku.  It's just a few dollars more, and you will be far happier.", "verified": true, "helpfulness": "1/1", "author": "Ernie Beckley \"Quality will be remembered long after price is forgotten.\""}, {"rating": 5.0, "review": "Setup was very easy using the app on my iPad.  Works as expected.  Very good picture when using Netflix and Hulu Plus.", "verified": false, "helpfulness": "0/0", "author": "dw"}, {"rating": 4.0, "review": "I love this little gadget. So much so, that I originally only bought one dongle, but I moved it around from room to room so much that I ended up purchasing another unit. I may even, eventually, buy one more for the kids play room (heck, these things are only 35 bucks). I love the fact that chromecast is so portable but I love, even more, that the device(s) is easily accessible through, both, apps on my iOS devices and my android devices. And I don't know if anyone else thinks that this is a plus, but if your are watching television and then suddenly enable a chromecast supported app, chromecast automatically change the input on your television to the corresponding chromecast input. I gave this a 4 because nothing is perfect. I would have loved to have seen more app support, cough, cough, VLC player... I would have also welcomed DLNA/desktop/streaming support (natively, not through a any sort of hack). Eventually, Google will release development kits, so I'm sure that my dream will to fruition at some point in the near future.", "verified": true, "helpfulness": "0/0", "author": "D. Carson \"Some Random Reviewer\""}, {"rating": 2.0, "review": "I purchased this for an I pad, For what it does I wasnt happy spent the extra money and got a Apply TV, my suggestion do either Apple TV or get an HDMI cable for your i pad", "verified": true, "helpfulness": "0/2", "author": "tom k"}, {"rating": 1.0, "review": "Save your money. This thing aint all it's advertised as. It's slow to load and having to use another device to run it is a P.I.T.A.  You would get more enjoyment buying yourself a good Cigar and setting the 35 bucks, that this thing cost, to light the Cigar.", "verified": true, "helpfulness": "1/4", "author": "Curtis Schulze"}, {"rating": 4.0, "review": "I really like the promise of Chromecast, but it's not fully baked. Your can cast YouTube, Netflix, and some google play media, that that's it. Over time,I'm sure Google will work out agreements with other content providers, and that's when Chromecast should really take off.", "verified": true, "helpfulness": "0/0", "author": "ray marcano"}]