[{"rating": 5.0, "review": "indeed I love this little wonder.", "verified": true, "helpfulness": "0/0", "author": "Shad Z"}, {"rating": 4.0, "review": "Great!!!", "verified": true, "helpfulness": "0/0", "author": "ï¿½ngel Josuï¿½ Vidal Acosta"}, {"rating": 2.0, "review": "This still has a long way to go.  Streaming doesn't work with all devices that well.  It has some lag, and latency issues.  Picture quality goes in and out, and the dongle is prone to overheating and breaking.  This technology needed a lot more testing before it was released.  It's a cool idea, and when it works, it's nice, but it will hopefully be actually useable in a year or so.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "I got this so I could stop hooking my computer to my tv to watch my shows. So far I am very satisfied! Occasionally it won't connect,but I think my wireless is to blame.", "verified": true, "helpfulness": "0/0", "author": "Olly the grey"}, {"rating": 5.0, "review": "It is awesome and convenient.  The device is small and works like magic.  It is the most inexpensive streaming device and to be honest, the best in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 1.0, "review": "Productos nevera arrived", "verified": true, "helpfulness": "0/0", "author": "Francisco Lau Lay \"Tecas\""}, {"rating": 5.0, "review": "My Playon server power supply failed so I used this as an excuse to purchase a Chromecast, So far I've been very pleased with it and the ability to cast from my phone is great too. When I want to share something with the family we don't have to huddle around phone anymore.", "verified": true, "helpfulness": "0/0", "author": "Aspazatak"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Angel A. Urena \"AU\""}, {"rating": 5.0, "review": "YES YES YES! This little critter has changed my life. I have a new Samsung LED TV and setup was simple.Reasons I particularly like it:1) Netflix streaming is flawless. Easy to stream from smartphone (I have an Samsung S5) or casting from chromebook.2) With my Chromebook I can cast tabs so I can get Amazon Prime and all the other streaming sites I use on the screen. If the quality is choppy - go under the settings for the Chromecast and change them to Standard. This should work for anyone who uses Chrome browser3) Shared YouTube TV queue! This has been particularly fun when friends are over and you want to share YouTube videos. Each person can add videos to the queue from their smart phone (have any tried with Android smart phones - not sure about others) as they are playing on the TV. I can also imagine this would be fun at a party where people can add music videos. There is also an app where you can play a song queue for parties - if one person has google play subscription then everyone can add to the list.", "verified": true, "helpfulness": "0/0", "author": "T. J. Doty"}, {"rating": 5.0, "review": "Brought as a gift. Great deal. Works well. Product arrived as described.", "verified": true, "helpfulness": "0/0", "author": "Katrina Walker"}]