[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "husband&father; \"Paul Mitchell\""}, {"rating": 5.0, "review": "easy set up .. easy to use.", "verified": true, "helpfulness": "0/0", "author": "Allen C. Briard"}, {"rating": 5.0, "review": "it does exactly what its supposed to do , very easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "johnomara@comcast.net"}, {"rating": 5.0, "review": "If you are an amazon prime member then the Amazon Fire box really takes your subscription to the next level.  The set up was super easy and quick!  You will need to buy and HDMI cable if you don't have one already to view anything in HD.  I actually like this better than streaming through my smart player because I don't get the same issues like start up delays and streaming interruptions.I like the simplicity of the remote.  If I wan't to search for something I can just push the voice button on the top of the remote and it brings whatever I'm looking for up.  No need to hassle with scrolling back and forth with your remote trying to type in a search. If its not on Amazon prime it tells you where it is on another service such as Hulu or a free app like crackle.  If its available there you just choose which option you want to watch it from and the fire tv does a direct connection with no hassle, no need to manually switch back and forth. So far I am just using Hulu and Amazon prime as my pay services.  If there was one thing its missing it would be the option to pay for channels individually.  As of now the popular cable channels  won't allow you to stream though the fire box without a verified cable subscription.  I'm not sure if there is a way around that but I haven't figured it out in the last two months I've owned this box yet.  All in all I'm extremely satisfied with my purchase.  Best thing I've bought for my entertainment since we bought the ol' big screen!!", "verified": true, "helpfulness": "0/0", "author": "bdm11480"}, {"rating": 4.0, "review": "My son picked up the Amazon fire TV so we could hook Our tv up to Netflix so far it's been a great product easy to understand easy to install and works great", "verified": true, "helpfulness": "0/0", "author": "Frances Young"}, {"rating": 5.0, "review": "Love it.  Exceeds my expectations. So many movies and shows available.  All I need now is more time to watch.", "verified": true, "helpfulness": "0/0", "author": "Cindy Maniaci"}, {"rating": 5.0, "review": "I've now owned the Kindle Fire tv for a few months and have formed a solid opinion. I think this is the best streaming device you can get--IF you are already ensconced in the Amazon ecosystem. Set up is a breeze, the remote control is easy to use, and voice search really works. (FYI, voice search only offers results from the Amazon library. You cannot use it to search within Netflix, for instance.)A dumb little thing that I actually love is the screensaver mode that starts after a few minutes--stunning photos from around the world, Mac style.The App Store seems to be growing at a fast pace (HBOGO recently added.) If you have Comcast Xfinity cable service, you'll still be blocked from using HBOGO on the Fire tv--Completely annoying. For this reason, we purchased a Roku Stick--one of the few devices that Comcast \"allows\" to stream HBOGO.The difference in quality and function are stunning--in Amazon's favor. The Roku would not complete set up in our room of choice, as it was too far away from our router. The Roku is the only device with which I have experienced this trouble. It immediately made me appreciate how ridiculously simple and smooth the Fire set up was. The remote for the Roku is cumbersome in comparison and not as responsive.I've compared this to a couple other devices through casual use only, so my opinions about why the Fire is a better choice are basic in nature:Chromecast requires using your phone as a remote. That can be a pro or con depending on if you want to have to keep your phone around.As far as I know, Apple TV doesn't have Amazon app, so you're missing out on Prime options.Amazon Fire would be better with continued app expansion. Aside from that quibble (which has more to do with cable providers, really,) I am completely satisfied.", "verified": true, "helpfulness": "0/0", "author": "Rebecca B"}, {"rating": 5.0, "review": "I received this as a gift and i love it. I don't have a smart tv in my bedroom so the fire tv has made it so easy to stream movies and TV shows. My only disappointment is that it doesn'thave an app for VUDU...but I'm still giving it 5 stars because it has amazon and netflix. It's so much better than having to connect my laptop or iPad to stream shows. I recommend this product to anyone who doesn't have a smart tv and likes to stream movies. It's awesome!", "verified": true, "helpfulness": "0/0", "author": "KK"}, {"rating": 5.0, "review": "LOVE my Fire TV!! It loads fast, has tons of shows to watch (all included with Prime) and some great kid's content too! We have Apple Tv also, and this one is MUCH user friendly! Even my 65 year old mom can use it! The talk to search option works great, even with background noise! So far, I can't find anything negative to say!", "verified": true, "helpfulness": "0/0", "author": "msm1379"}, {"rating": 4.0, "review": "Super zippy, crisp clear pic, easy setup. My only complaint is that the search feature only works within amazon. If you have netflix it will not display search results from Netflix even if the show you want is available for free on netflix and rental on amazon. You will only get the rental result.  Oh yeah, disney is NOT yet supported. You can download their apps but you can't activate them with disney.", "verified": true, "helpfulness": "0/0", "author": "C. Davis"}]