[{"rating": 5.0, "review": "Very easy to use. Set-up was a breeze. I use it more than I even thought I would. Definitely worth it. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "K.Will"}, {"rating": 4.0, "review": "Easy to use, hooks up quickly, content for viewing is outstanding and the voice activation feature is incredible.  Don't hesitate.", "verified": true, "helpfulness": "1/1", "author": "moeinmex"}, {"rating": 5.0, "review": "Took me 20 mins to have it up and running and no lag with 1080P!!! (Deleted all the pay with credit card crap)", "verified": false, "helpfulness": "0/0", "author": "Jake"}, {"rating": 1.0, "review": "Yeah right......opted for the 30 day trial after purchasing the fire tv box. There is not a single free item on my tv screen.its buy or rent WTF ?", "verified": true, "helpfulness": "5/9", "author": "bryan smethwick"}, {"rating": 4.0, "review": "Most of the offerings from this Amazon product are wonderful, except that the consumer has to pay for every video, movie, TV show, etc. That is a bit inconvenient for me. Fortunately, I have a Netflix subscription and this device enables me to watch many programs that my previous Samsung Blu-Ray player (with Netflix and other programs) would not. The technology was poor, so the Amazon Fire TV was a good purchase, in that regard.", "verified": true, "helpfulness": "2/2", "author": "Judy Page"}, {"rating": 3.0, "review": "I am getting ready to move for school. Will Amazon Fire TV work in Malta?Thanks for the assistance and advice in advance!", "verified": false, "helpfulness": "0/2", "author": "J.B."}, {"rating": 5.0, "review": "This is an awesome device!  Very easy to use and the voice command is great.  Almost unbelievable the amount of content available for free with Prime.", "verified": true, "helpfulness": "0/0", "author": "R. Alleman \"ralleman\""}, {"rating": 3.0, "review": "I bought this item and use it outside US (in south america) and it really isn't thaaaaat cool if you are not in usa. I would love to change system language to spanish and have much more content.Anyway, i can use netflix ok (like in a pc) and with some tricks you can get usa content working (but dont expect it to be in spanish).", "verified": true, "helpfulness": "0/0", "author": "Alexis"}, {"rating": 4.0, "review": "I purchased the on fire TV when I came home from college recently, having been living with a roommate who had an Apple TV and I was \"addicted\" to streaming shows. I decided to go with the Amazon Fire instead because it offered a few different fun features (voice search, amazon prime videos, etc) but mostly because it also had games! I looked at the games library and saw titles that I used to own on xbox, and thought they would be fun to have on my streaming device. I downloaded and played one of the grand theft autos, and it played very well, surprisingly good graphics. The downfall- there isn't enough memory in the device for large games! Without downloading any other apps or games, I got a pop up message saying I needed to delete some memory in order to continue streaming anything. I can still play the games, but have to clear the memory every time you stop playing, and then re-download the next time you want to (over 2.5gb, every time...). I'm waiting for there to be more help available for this product, or an option to increase its memory!Overall I love it, I just wish I knew before purchasing the controller that it wouldn't get much use due to memory issues.", "verified": true, "helpfulness": "3/3", "author": "Jordan T Morton"}, {"rating": 5.0, "review": "Just what I wanted.  I have an apple tv as well but this has more options and I love the voice feature.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]