[{"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "Benjamin Kuntz"}, {"rating": 2.0, "review": "Its a bummer that it does not work with the Kindle systems.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Frazier"}, {"rating": 5.0, "review": "As others have mentioned, this is not to mirror everything from your device to the tv, this is to play certain channels and apps, such as YouTube, by connecting your tv to your wifi.  It works well and it's simple to use.", "verified": true, "helpfulness": "0/0", "author": "X. L. Pham"}, {"rating": 5.0, "review": "its what i ordered works great brand new", "verified": true, "helpfulness": "0/0", "author": "Robert Figueroa"}, {"rating": 5.0, "review": "This little awesome device is a big pleasure!", "verified": true, "helpfulness": "0/0", "author": "edap"}, {"rating": 4.0, "review": "This item is very convenient for internet use.  We have a large limestone fireplace that can block the internet signal to the TV. We can stream video or whatever to the laptop and it shows up on the TV. Works great.", "verified": true, "helpfulness": "0/0", "author": "Lynnea Lane"}, {"rating": 3.0, "review": "We loved this for the time that it worked.  It stopped working after 4 weeks.  We went through all the tech support processes to try to reset the devise with no positive effect. So miss it!", "verified": true, "helpfulness": "0/0", "author": "K Parker"}, {"rating": 4.0, "review": "Great! Does everything I need it to do aaaaand it's portable! I can take it to my friends house and use it there or wherever I want! I use the hotspot on my phone as the wifi router, then I can cast from my phone to any TV without having to run the setup wizard again every time I want to connect to a new (preferred network). I guess that's one of the only downsides for me. The Chromecast only saves one wireless network at a time. If you want to connect to a different wifi network, you'll have to run the setup either from the app on your phone, app on a Chrome browser, or using the installed app on PC -- every time.Here's another big downside to using a Chromecast. It HAS to be connected to the internet to do anything. It works by being connected to a wireless network using your gmail sign-in. When you're connected to the same wifi network as a Chromecast device, cast-enable apps will show their \"cast\" icon and when pressed, launches the app *on* the Chromecast, signing in with your credentials for that app. The stick itself pulls no data from your casting device (phone, tablet, browser). It's all done over the network through a relay service and pulled from whatever ISP your wifi is connected to -- while updating the casting device with what's going on like current place in a song or Netflix video.  You don't have to worry about it running up your mobile data allotment unless your phone is the actual hotspot your Chromecast is connected to (or unless you have root and...you know ^_-  ).If you have offline media you want to cast to Chromecast, it STILL has to be connected to the internet. You can't do any frikkin thing offline. If you have permanent ISP service at home, this is the device for you. It's great, really. Just very dependent on connectivity for entertainment.However, I do like that developers are making apps for it every day. The market for casting apps is getting much bigger and it excites me. Can't wait til Spotify releases an official app (Spoticast is aight but missing features crucial to my music experience). The workaround in the meantime is to just cast your entire Android screen (but it slightly reduces audio quality).You can turn the screen off on the casting device to save its power and it will still keep streaming (be sure your wifi options allow this sleep-functionality).I also love the offers that came with it. Between this and my Chromebook, Google has given me quite a lot these past couple months.Fellas, if you're really wondering whether you should get one or not... just think about this: Porn on the big screen without any traces :)", "verified": true, "helpfulness": "1/2", "author": "Angel"}, {"rating": 5.0, "review": "Love my ChromeCast! This little device works great for streaming anything from the Chrome Browser and the BETA full screen mode works well for just streaming the regular pc screen. We were recently away for two weeks and missed my Wife's Downton Abbey episodes. Luckily they were on the PBS website and I easily streamed them to my tv using the ChromeCast. A hard to beat device for the price.", "verified": true, "helpfulness": "0/0", "author": "Bruce Kriebel"}, {"rating": 5.0, "review": "LOve it", "verified": true, "helpfulness": "0/0", "author": "Jerzey Joe \"Jerzey Joe\""}]