[{"rating": 5.0, "review": "Perfect to watch amazon movies (you need a prime account) and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Good purchase, meets current expectations cannot wait until Prime Music is added to its functionality", "verified": true, "helpfulness": "0/0", "author": "Geoff"}, {"rating": 5.0, "review": "I absolutely love my Fire TV. It has been better than I imagined. The content is growing and the hardware is the best on the market by far. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Gil Farmer \"Gilbert Farmer\""}, {"rating": 4.0, "review": "Awesome. Ilove it, but I have to pay.", "verified": true, "helpfulness": "0/0", "author": "Jaeho Jung"}, {"rating": 3.0, "review": "Not quite what I was expecting.  Getting use to it and figuring out the ins and outs takes some time.", "verified": true, "helpfulness": "0/0", "author": "Kelly J. Albers"}, {"rating": 5.0, "review": "This is the BEST thing ever. I have a Kindle Fire HDX and whenever I am watching something on it and decide to change to my TV, all I have to do is click on the setting and it instantly turns my TV on and there it is. It is so easy to use. I would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Jana J Rutledge"}, {"rating": 4.0, "review": "wish it had local channels", "verified": true, "helpfulness": "0/0", "author": "LL \"star111\""}, {"rating": 3.0, "review": "Buffering isn't as great as advertised.  Periodically freezes and Netflix sound doesn't always play.", "verified": true, "helpfulness": "0/0", "author": "Dale Hopkins"}, {"rating": 5.0, "review": "I cannot be more happy with my amazon fire tv.One thing that I love about this device is that it can detect my wireless N router signal.  My PS3 does not have the wireless card that can detect N signals and is very poor at doing wireless streaming.  However, Amazon's fire tv outperforms even my old laptop.I was lucky to get the Halloween deal and got it for just $84.I have recommend it to friends and one of them told he bought it from Staples at the same price I did.  To be fair, I think is worth the $99 price tag.", "verified": true, "helpfulness": "0/0", "author": "Citlali"}, {"rating": 5.0, "review": "What's not to love? It works perfectly.", "verified": true, "helpfulness": "0/0", "author": "pickwickfirestorm"}]