[{"rating": 5.0, "review": "At this price point, I saw no problem getting two of these (one for the basement, one for the bedroom). Very happy with it in terms or reliability, ease of use, and visual quality. If not for a couple of shows we pull in over cable, I'd cut our TV cable service in a heartbeat.Big con right now is the lack of customization (services either support Chromecast or they don't; supported services are currently listed under a Google search for \"Chromecast apps\". You can cast a web page, but generally, quality of video playing through the web page cast is poor.If you watch a lot of YouTube videos, Netflix, etc., highly recommended.", "verified": false, "helpfulness": "0/0", "author": "Mark T Tomczak"}, {"rating": 4.0, "review": "The Chromecast is simple to set up and isn't bulky, so you don't have to make a space for it on the entertainment center.It's a little quirky every now and then, but it's nothing that the occasional reset won't fix.The streaming is good as long as you have a good internet connection.My only real complaints are the lack of apps available at this time and the occasional quirky moments. Can't beat the price either.", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 4.0, "review": "Does not work on all apps but it does work well especially with Netflix. I have not been able to get it to work with Amazon Prime app yet.", "verified": true, "helpfulness": "0/0", "author": "Zachery Gray"}, {"rating": 1.0, "review": "I purchased my first chromecast (CC) from Amazon 3 weeks ago and have been up and running smoothly alternating the chromecast between the living room HDMI receiver and the bedroom LED TV. Enjoyed the product so much I ordered another.Problems began immediately. I was unable to configure the newest CC and unable to find it from any device. Google's help pages are useless - and unfortunately so is the internet which is why I am writing this review.  The iPad Air, the sammie S3, and the Win7 laptop can no longer see either CC which are  all on the same network. Most painfully, when I plugged the newest CC into my Onkyo home theater receiver, it \"burned out\" the HDMI port which no longer recognizes either the Playstation or Roku 3 box. The receiver flashes \"Resolution Error\" across its LCD display, something I've never seen before.Thanks Google for 1) a product that doesn't play well with its own kind, 2) providing null support, and 3) selling cheap equipment that ruins much more expensive equipment. I hope this is not a sign of things to come from the people at Don’t Be Evil.RMAs went in for both today.", "verified": true, "helpfulness": "0/0", "author": "zimmazam \"zimmazam\""}, {"rating": 5.0, "review": "I am a youtube junkie so this is perfect.  Also a netflix user so it is really good for that as well.  If you want to use your own local media you can always use the plex app or have a file management extension on your chrome browser that allows you to stream whatever it is on your current tab to your tv.  So far I like it for what I use it for.  I love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Prod:Works great, had apps for Hulu, Netflix and everything I neededCon:read other posts for detailed cons I loved it", "verified": true, "helpfulness": "0/0", "author": "Juice Man"}, {"rating": 5.0, "review": "This is a great product, as it enriches my multimedia life, gives a better way of enjoying YouTube, pictures and movies on a bigger screen.", "verified": true, "helpfulness": "0/0", "author": "Ola-Mike"}, {"rating": 5.0, "review": "Love google products and this one is great! It works really well with Netflix and Youtube. Hopefully in the near future there will be a chromecast button in every player.", "verified": true, "helpfulness": "0/0", "author": "BJarrett"}, {"rating": 5.0, "review": "Basically the chromecast is invisible, no need for media console real estate. No remote needed, just your phone, which you are using it anyway. We bought 2 for two TVs in the house. And the affordable price really helps.", "verified": true, "helpfulness": "0/0", "author": "Terrence"}, {"rating": 5.0, "review": "Easy to setup and use. Has all the apps I wanted to use. I would recommend it's purchase. Love it!", "verified": true, "helpfulness": "0/0", "author": "Maria Zuniga"}]