[{"rating": 1.0, "review": "If you only want to stream Youtube and Netflix videos, this is a good buy. However, if you want stream other online videos, the videos are never watchable whereas they are smoothly played on the computer.", "verified": true, "helpfulness": "1/1", "author": "GW"}, {"rating": 5.0, "review": "I purchased this as a gift so I haven't actually used it but my daughter tells me it works great.", "verified": true, "helpfulness": "0/0", "author": "LuAnne Hosette"}, {"rating": 5.0, "review": "My main reason for getting a Chromecast was to get HBO Go on my TV, the Xbox One app is apparently dragging its feet and I put the 360 away.  To this end it works very well, the Xbox has the necessary close USB ports to power it and I don't have to take up another HDMI port on my home theatre system.  Looking forward to more support fo this thing.", "verified": true, "helpfulness": "1/1", "author": "M. Pfaff"}, {"rating": 1.0, "review": "The product does not what do what they lead you to believe it does.#1--It DOES NOT mirror your ipad.#2-Google chrome on the iPad does not mirror  to the TV.#3-Most of the apps on the Ipad are not compatible with the device. ( eg Amazon Prime does not work )It does mirror your browser. ONLY ON A PC, not an Ipad or Iphone.If you are looking for a device that will mirror the Ipad or android, look at EZCAST. Have not bought one yet so I cannot tell you if it works or not. But they claim to be able to do all the things Chromecast does and everything else you want it to do.  Good luck", "verified": true, "helpfulness": "0/0", "author": "davidg"}, {"rating": 4.0, "review": "Price point, coupled with no monthly fee and the functionality with all the big streaming services makes for an awesome value.", "verified": true, "helpfulness": "0/0", "author": "Jason Heichel"}, {"rating": 3.0, "review": "Nothing wrong with the product.  I just did not have the HDMI connector that I thought was on the TV.", "verified": true, "helpfulness": "0/0", "author": "Dave G. Wynne \"triguy50\""}, {"rating": 3.0, "review": "Hopefully more apps will be developed and made available.  It will display whatever you can view using the Chrome Browser, but the Chrome browser does not have a video player that can play the popular video formats like .wmv or.avi.", "verified": true, "helpfulness": "0/0", "author": "Albieweiss"}, {"rating": 2.0, "review": "Not a bad idea, but I was very disappointed I could not access Amazon Prime.  Maybe I'll try again at a later date.", "verified": true, "helpfulness": "0/0", "author": "judy reader \"judy\""}, {"rating": 1.0, "review": "One of the big reasons I purchased this was to stream content from any of my Android devices chrome browser's as opposed to just using my home computer(because anyone can plug in an HDMI cord to their tv for internet content). However, it seems that is only the case for a few apps, and the mobile chrome browser isn't supported at all currently... Until Google decides to actually support Chrome for Chromecast, this device is just a gimmick.", "verified": true, "helpfulness": "0/0", "author": "Cameron Ezell"}, {"rating": 4.0, "review": "But it isn't a ROKU replacement. As there is only a few apps that sling to another device on your house WIFI.", "verified": true, "helpfulness": "0/0", "author": "S. Grayban"}]