[{"rating": 5.0, "review": "Easy to set up and use.  I love the voice activated remote.", "verified": true, "helpfulness": "0/0", "author": "Bryan Gibson"}, {"rating": 3.0, "review": "I just got the Fire TV  for Christmas but am so disappointed that I can't get netflix it shows on your box and it is listed but it will not open up for me", "verified": false, "helpfulness": "0/0", "author": "Christine"}, {"rating": 5.0, "review": "very pleased with the fast processor performance.some youtube videos hd are very nice.netflix opens fast and the hd is also excellent .will definitely recommend to a friend. thanks amazon.", "verified": true, "helpfulness": "0/0", "author": "el-mostafa ezzireg"}, {"rating": 3.0, "review": "It's pretty nice. Wish it had features Roku has with headphone jack and more channels.", "verified": true, "helpfulness": "0/1", "author": "Woody"}, {"rating": 4.0, "review": "I like the voice operated system", "verified": true, "helpfulness": "0/0", "author": "Jerry A Taylor"}, {"rating": 5.0, "review": "We had a Roku 3 and upgraded. This is much faster when it comes to opening items, browsing and for some reason Hulu used to crash all the time on the Roku and we haven't had this problem as of yet with the Fire Tv. One thing I really like is that the Netflix on this allows you to create profiles and switch between them easily. The other cool options are screen savers with your own pics that you can upload via the Amazon cloud. The voice command is also great and generally understands what you say.", "verified": true, "helpfulness": "1/1", "author": "JennyfromBoston"}, {"rating": 2.0, "review": "No web browser?  On an internet device?Fire TV is ok.  I don't love the need to switch TV inputs, though I understand why.  Nevertheless, it is cumbersome, and for me requires another remote, bringing the total to 3 remotes to operate the TV.  Or, I can walk to the TV and use the buttons.Amazon content is no different than on the computer, so you could view this box as eliminating the need for an HDMI cable.  Overall, the content is ok, but always seems to be missing what I happen to dream up.  Free Prime content is a nice feature, but unsearchable (prime only) making it mostly inaccessible/unfindable.It adds some other content, but nothing much.  Inexplicably, there is no web browser which is the one thing that would make it worthwhile.Youtube has an app, and again, you can do that by connecting any computer via HDMI.There are some games, but the free ones are terrible and I'm not into buying elaborate games.  Some might be more impressed.The apps, like Pandora, are the best part, but again, only bring what you already have to the TV which isn't always the most logical place to use them.The remote is small and black, making it easy to lose (daily).  I love the voice search, but that only works with Amazon content.Overall, even though it seems cheap it is actually overpriced.  I would give it 5 stars at $25 or less.", "verified": true, "helpfulness": "0/5", "author": "Z8"}, {"rating": 5.0, "review": "The absolutely the best thing I ever bought on line.  Outstanding entertainment for the whole family.", "verified": true, "helpfulness": "0/0", "author": "Popum"}, {"rating": 5.0, "review": "This the buy i have done in along time. It does everything that they says, my 5 year old grandson love the games. I will be purchasing the fire stick for my other tv. By the way you have to get the Amazon Prime membership you will not regret it", "verified": true, "helpfulness": "0/0", "author": "Outlaw1"}, {"rating": 5.0, "review": "I have Roku, and it's great.  This went on sale and I decided to try it.  I love it!  The only thing stopping me before was that HBO Go wasn't on the Fire tv.  It is now!  I've only watched Prime and Netflix so far, but it's just as good as Roku.  A real plus for me are all the Ambient apps.  Nothing like having a roaring fire on your TV to help you sleep and make you feel warm.", "verified": true, "helpfulness": "0/0", "author": "judyannemt \"dejavideo\""}]