[{"rating": 5.0, "review": "Got it for my son and it works great.  He liked it so well I got him another one for another tv.", "verified": true, "helpfulness": "0/0", "author": "cathy downs"}, {"rating": 1.0, "review": "only basic netflix and youtube apps work and casting chrome browser video does not work at all. 1080P youtube videos don't work. I have 25-30 MBPS Internet Speed. Wireless Router is about 10 feet away from the chromecast device.", "verified": true, "helpfulness": "0/2", "author": "Anil Kumar Ramavtar"}, {"rating": 1.0, "review": "If you're looking to stream movies off your iPad, etc..forget it.  This thing is limited to a handful of things you may subscribe too.  I was hoping to stream off my pc...it doesn't do it.", "verified": true, "helpfulness": "0/2", "author": "DJ Buddy - Bud Fleisher \"DJ Buddy\""}, {"rating": 5.0, "review": "Beyond waiting for this to come back into stock, chromecast has been a pretty nice experience. Obviously google needs to speed up their apps white listing process, but the basics (PLEX support!) are there. Now if only it could convert my 4/3 CRT TV into a 16/9 LCD...", "verified": true, "helpfulness": "0/0", "author": "Joel"}, {"rating": 5.0, "review": "My husband loves his Christmas present. It works great and it's very easy to install. I recommend it to everyone!", "verified": true, "helpfulness": "0/0", "author": "nokuhtula msubo"}, {"rating": 5.0, "review": "It was easy to set up and I have moved it to different TV's within the house and have not had to reconfigure it.  Great way to watch your favorite Youtube videos on a larger screen.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey B."}, {"rating": 4.0, "review": "works as promised, i use it for netflix, but it does get hot and i wonder if it will catch fire.", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 4.0, "review": "It is wonderful and easy to use, of course I am looking forward for more apps and I think it will be.Mirroring the desktop is in beta and I hope it will be done soonIf you do not want to use many set boxes to connect to your tv have it and for the price it is very worth", "verified": true, "helpfulness": "0/0", "author": "louanchi"}, {"rating": 5.0, "review": "Easy to set up and use.  We do not have cable or Wii, so it is a great way to view our Netflix account using the galaxy phone or laptop as a navigator.  What a deal!", "verified": true, "helpfulness": "0/0", "author": "Amy Seigler"}, {"rating": 4.0, "review": "Really easy to use, and portable.  I wish it supported 5Ghz wireless, but otherwise it works faithfully.  It's really handy to have.", "verified": true, "helpfulness": "0/0", "author": "stansongman"}]