[{"rating": 4.0, "review": "Google Chromecast is a very good option for someone who doesn't have a Smart TV and is not willing to pay a lot for an Apple Tv, Roku, or any other similar devices. I like it more than I thought I would.It does limit you a lot on what you can do with it. Everything needs to be displayed via Google Chrome, or an app that shows the Chromecast button, but there are some ways to \"cheat\" and have other things displayed on the TV, like a movie or picture that is stored in your computer.PROSIt is very easy to install it on your home network and tv.You can leave it on, so when you want to display something on the tv you can just change it to the HDMI channel.Works perfectly with Netflix, the video and audio quality are very good.CONSSometimes it takes a while to load and buffer the video, and there is always a delay.The network gets stuck and you need to restart the Chromecast for everything to work again.You can only use Google Chrome to display very few kinds of video, and the pairing with the TV still needs a lot o improvement.", "verified": true, "helpfulness": "0/0", "author": "Jullianna"}, {"rating": 5.0, "review": "Best Impulse buy of all time of the 21st Century. $30 .. Really?!", "verified": true, "helpfulness": "0/0", "author": "Carmine"}, {"rating": 3.0, "review": "I was really excited about this, mostly because of the cost.  I've gotten it to stream well, but had serious problems with everyday use.The good: Setup was really, really simple, and worked even though my router was supposedly not supported.  Streaming YouTube or Netflix from my laptop or Android phone works flawlessly.The bad: When streaming a tab directly, rather than something that works with one of the onboard apps (e.g., Hulu or any other non-app video source) it's easy to mess up the video sync.  The Chromecast is never in sync with the computer video, but usually adjusts the audio accordingly, so that what you watch on the TV is synced properly.  However, if you look at it funny, the audio gets out of sync and you have to reload the tab.  This is kind of annoying.The ugly: It is extremely difficult to get the Chromecast to wake up.  This issue is so annoying, and occurs so frequently, that it's really the only reason I gave it 3 stars instead of 5.  If I'm lucky, I can wake it up by starting a video in a tab and then cycling through the inputs on my TV until it decides to wake up.  If I'm not, I have to unplug it, restart it, and then start a video and cycle through continuously until it decides to cast.  Some research shows me that many, many users are having this problem, and the official line appears to be \"check your router, reset, do a factory reset\".  The fact that so many people are having this issue suggests that this is not a problem with my router, but since my router is not supported, it is possible that that's the root cause.  Still, I'm not encourage by the fact that this is such a widespread issue and doesn't seem to have been adequately address by product support.", "verified": false, "helpfulness": "2/2", "author": "Ryan Denzer-King"}, {"rating": 5.0, "review": "Chrome rocks!", "verified": true, "helpfulness": "0/0", "author": "levi geiger"}, {"rating": 5.0, "review": "Its very nice, same as google shopping. Genuine", "verified": true, "helpfulness": "0/0", "author": "Santhosh Kumar"}, {"rating": 1.0, "review": "The Chromecast was not compatible with AT&T; U-Verse modem.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This beautiful device has revolutionized our entertainment center. Netflix, Pandora, YouTube, HBO Go ... All of it streams flawlessly to my TV. It is one of the cheaper options out there for connectivity. Also, the Chromecast app for Chrome fills in the gaps when it comes to integration. Xfinity does not have Chromecast integration, but I can just full-screen my Xfinity on-demand stream, then cast my browser window to the TV. Boom! Workaround.If you still don't have a streaming device attached to your TV or built into it, pick this baby up!", "verified": true, "helpfulness": "0/0", "author": "ssteussy \"steussys\""}, {"rating": 2.0, "review": "We're pretty disappointed with our Google Chromecast. We bought it with the intention of using it to stream video from our iPads to our TV -- and we could only get it to stream through the Netflix app. Maybe I'm missing something, but we're both pretty intelligent people. If you CAN stream video from your iPad - I'd love to know ... and I'll update my review. So far, it's been sitting in a drawer and has been a waste of money for us.", "verified": true, "helpfulness": "0/0", "author": "blondecurve \"blondecurve\""}, {"rating": 5.0, "review": "Excellent product works great", "verified": true, "helpfulness": "0/0", "author": "HDHR4"}, {"rating": 5.0, "review": "Goood", "verified": true, "helpfulness": "0/0", "author": "Tran tai"}]