[{"rating": 5.0, "review": "I use a Wii to watch my Netflix movies and YouTube.But since I've tried Amazon fire stick I had become a loyal and satisfied customer of it.It's  the best thing since Dexter! the serial killer series.", "verified": false, "helpfulness": "0/0", "author": "zoe"}, {"rating": 5.0, "review": "L would love to have", "verified": false, "helpfulness": "0/0", "author": "harry fleck"}, {"rating": 5.0, "review": "Best box for streaming video. Setup and navigation is easy. Streaming video from Amazon is almost instantaneous. Video quality is better than the \"SmartTV\" applications within my TV.  (Turns out my Samsung TV isn't very smart, and the video is processed through glitchy Samsung servers.)", "verified": true, "helpfulness": "0/0", "author": "LeRoy Jackson"}, {"rating": 5.0, "review": "Traded up to this from my old Logitech Revue. I am used to getting most of my media content from Amazon anyway so this was a natural choice. Easy set up, great remote, lightning fast; I couldn't ask for a better set up.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Works as advertised", "verified": true, "helpfulness": "0/0", "author": "Richard L. Jones"}, {"rating": 5.0, "review": "This item was as described and has worked very well.", "verified": true, "helpfulness": "0/0", "author": "danman2004"}, {"rating": 5.0, "review": "awesome media player", "verified": true, "helpfulness": "0/0", "author": "argyygd"}, {"rating": 2.0, "review": "When I first got this I was excited and expected all quirks to eventually be smoothed out. NOPE.The Fire TV has gotten worse since I've owned it, and no apparent improvements.1. Remote's battery life is terrible, and it is not rechargeable so you will need to buy two AAA batteries a month just to use the thing.2. The device itself is buggy. My most annoying example is every single time the Fire TV 'wakes up', as in the first time I turn it on each day, it can not connect to the internet. This is absurd. It knows how to connect to my wifi, but chooses not to unless I unplug and then plug in again the power source.3. I have connected my Fire TV to en ethernet cable because the false no-internet was getting very irritating. But, surprise, it does it for ethernet too. So now I have to unplug then plug back in the ethernet cable every single time I want to use the Fire TV once it has entered sleep/idle.Now for the most annoying issue for the Fire TV:4. Customer support for the Fire TV is the worst I have ever had from Amazon. It pains me to say this since I have never had any notable issue on my decade and counting with Amazon. But trying to give feedback on features, and later the bug feedback, has proven to be impossible. Amazon support basically sent me a link to itself every time I tried, but never with any way to discuss the Fire TV. Also, there has never been any response from the other methods Amazon support supplied. This has left a sour taste in my mouth, which I should have remembered before trying the Echo device.5. The interface is spammy. There is very little useful content in the Fire TV's UI. It strong arms you towards renting and buying content, from Amazon (duh). It tried to keep Netflix off the main page, and does not allow any sort of content sharing from other services, like Netflix. They are confined to their app, which as I mentioned, is continuously pushed out of site by Amazon.6. The video can not always keep up with the play speed so the frames will stutter or freeze, then suddenly play as if in fast-forward mode all the while sound plays as if normal.7. The voice search is literally useless. I mean, it has no functional use, unless you want to buy something irrelevant from... Amazon.", "verified": true, "helpfulness": "2/4", "author": "Neopassive"}, {"rating": 4.0, "review": "Add VUDU and you'll have a ROKU convert for life.  The hardware is well equipped for future add ons and updates...Also,  the search function worked way better than expected!", "verified": true, "helpfulness": "1/1", "author": "JOHN CRUTCHFIELD"}, {"rating": 2.0, "review": "When I first got this I was really happy with it.  It seemed faster, smoother than apple TV and easier than Google.  But now the Hulu plus just sucks.  I had to connect my Google to the same tv to watch Huluplus.  But netflix and Amazon work great but I don't want to have to manage two different syatems.", "verified": true, "helpfulness": "0/1", "author": "Tim H. Shepherd"}]