[{"rating": 5.0, "review": "It works for Youtube as expected, and a beautiful screen saver when not doing anything with it. Haven't tried it with many other apps (there aren't that many apps which have the \"Send to Chrome\" feature.... yet).", "verified": true, "helpfulness": "0/1", "author": "Alan Kerrigan"}, {"rating": 5.0, "review": "Dude it's awesome <3 I really like it...and it's the best thing ever...I use it all the time and scare my sister with it...I get awesome entrance music when I come home...I fell like Tony Friggin Stark :D", "verified": true, "helpfulness": "0/0", "author": "mark"}, {"rating": 5.0, "review": "Bought this to replace connecting laptops and other things to the living room TV. Now everyone can control the Chromecast from their phones and tablets, iOS and Android alike, with ease. Makes sharing videos and family movie nights super simple and fun. Love it, and already considering getting another and have been telling all my friends about it.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey M"}, {"rating": 1.0, "review": "THE UNIT WOULD NOT SET UP ON MY SONY . TRIED EVERYTHING THE DIRECTIONS SAID. STILL NOTHING. SENT IT BACK.", "verified": true, "helpfulness": "1/1", "author": "JAMES MCDONALL \"Richard M. Bird\""}, {"rating": 4.0, "review": "It took a while to get this to work properly.  It wouldn't configure from my desktop, from my laptop, nor a Kindle Fire running CM.  What I ended up doing was using my wife's Nexus 7 (unmodified) to get it configured to talk to my WLAN.  That worked fine and simple and after it downloaded new firmware on it's own, I sat down to watch a movie from Netflix through it.  I tend to keep it unplugged when not in use as it does have it's own wifi access point built in for configuration outside of the WLAN connection.  Just find it prudent not to have it always available like that.", "verified": true, "helpfulness": "0/0", "author": "R. Sanders"}, {"rating": 5.0, "review": "I have one of these in my living room. I wanted the media I stream to go through my sound system so I plugged it into my surround sound tuner rather than directly into the TV. It works great this way too. Originally, this device was specifically designed to stream media from the Internet via Netflix or other such services. However, now that the official SDK is out for app developers, there are already some apps that can stream content that is stored on your devices. AllCast for Android is one example of an app that can stream your own media files. I hope to see a lot of other apps get Chromecast support in the future too. One app that has been announced to have support soon is the Vudu movie streaming service.The real advantage to the Chromecast, which I think makes it better than other media streaming devices, is that it doesn't actually sign into any user account at all. This makes it a great way to share media with friends and family because any device that connects to Chromecast can cast to it no matter what account the device itself is signed into. So, if a friend of mine rents or buys a movie on the Google Play Store with their phone on their account and then stops by my house and wants to watch it with me, all they have to do is connect their phone to my wifi network and they can send it to the Chromecast. I don't have to sign out of my account on my devices, and they aren't asked to associate my Chromecast with their accounts. It's the cloud equivalent of a friend bringing their Blu-ray disk over and playing it in my Blu-ray player.With traditional media streaming devices, like Roku or a Blu-ray player, the apps are stored on those devices and require each app to be signed into an account, at which point that device is associate to each of those accounts. There isn't any easy way to share other people's media with those kinds of devices. Airplay for the Apple TV is the closest thing but that's limited to Apple devices. Chromecast works with both Android and Apple devices.I don't have HBO but I watched a movie from HBO with my friend on my Chromecast because he has HBO and the HBO Go app on his iPhone. I also missed the pilot for the new Braingames show but played it in Chrome on my computer from ABC's web site. With the Chromecast extension for Chrome, I was able to cast it to my TV and watched it on the big screen rather than my computer monitor. These are a couple other examples of how useful the Chromecast can be.", "verified": false, "helpfulness": "0/0", "author": "Quasar"}, {"rating": 5.0, "review": "I went into my Chromecast purchase not expecting much and ended up being completely in love with how easy to use and well functioning this thing is. Ask my friends and family, I cannot shut up about how cool and easy the Chromecast is. I have sold people on them at Best Buy because they overheard me telling someone how easy and versatile this is. At the price they make great gifts and very easily make old not-so-smart TV look snappy and intelligent. The Google commercials for this are crap and don't do it justice. Easily stream YouTube videos, Netflix, Hulu and Google Movies to your TV with this. No special versions of these video apps required. If you have the latest version of the Youtube app, you can already use Chromecast. Even if your using an iPhone. If someone is on the same wifi as your Chromecast, they can cast to it. No complicated setup, no password hassles, just awesome video casting. I have used this so many times hanging out with friends and family to watch video after video on Youtube. Chromecast even goes home with me on the holidays and was the highlight of my teenaged sister-in-law's slumber party as the girls sat around taking turns casting goofy videos from the devices they usually have their noses buried in.In short, just buy it.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 3.0, "review": "This is a really great product! All the reviews are true and this is one of the greatest recreational investments I've made so far this year, however, they weren't kidding when they spoke about the glitches and kinks. If you're on a college campus, and have no choice but to use campus WiFi, you're going to run into some serious problems because of security network protocols. There's a looooong explanation I was given by the Google customer care rep, and since I'm not a techie, I'd have difficulty re-explaining it, but long story-short: You would have to go to your school's IT department and have them set up a DMZ host on your computer so that your computer can be the source of your WiFi connection to Chromecast. It's a very tedious process, so I wouldn't recommend buying it until Google irons out those kinks. However, if you plan to use it at home, everything should be fine and it should work really well for you!", "verified": true, "helpfulness": "0/0", "author": "Brittany-Marie Aarons"}, {"rating": 1.0, "review": "i had to call google to set it up which took an hour only to find out that there are serious issues associated with streaming from a windows 8 laptop.", "verified": true, "helpfulness": "1/1", "author": "Einat Ronen"}, {"rating": 5.0, "review": "This works really well and was extremely easy to set up. The chromecast is quick and works from almost any device that I have!", "verified": true, "helpfulness": "0/0", "author": "Daniel P"}]