[{"rating": 5.0, "review": "Stream shows all the time. Better than most cable premium channels.", "verified": false, "helpfulness": "1/1", "author": "paul0351"}, {"rating": 5.0, "review": "arrived on time as promised. good quality. will do business again. nice job. thank you", "verified": true, "helpfulness": "0/0", "author": "Mandu"}, {"rating": 4.0, "review": "getting better with age as more apps interact with it, but still not quite roku's total equal.", "verified": true, "helpfulness": "1/2", "author": "MW"}, {"rating": 5.0, "review": "Excellent gadget, I love it.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "I bought two of those as gifts. Both my friend and my girlfriend are delighted with the Chromecast. They absolutely love it.", "verified": true, "helpfulness": "0/0", "author": "David Hernández"}, {"rating": 1.0, "review": "And the Roku is much better...Roku has much better video quality and it operates at a higher frequency than the Chromcast, 5K, not 2.5K.  I live near the water.  I already got the fact that the Chromecast \"stutters\" with the microwave on, but it also \"stutters\" because of local use of marine band radios.  Everything that can be cast to the Chromecast via the Google Browser's \"cast\" downloadable option, can be cast to a Roku.  Long as it's on the same Wi-fi, it works.  Roku, because of the frequency, never responds badly to the microwave or this marine radio traffic.  I bought the Chromecast, never having used Google Chrome (happy with Firefox).  I was frustrated about casting BookTV and other video sources that don't have Roku channels.  But, just the browser was all I needed, which is free,  it can cast to streaming devices, and you don't need a Chromecast to do it.", "verified": false, "helpfulness": "0/2", "author": "Starboard Home"}, {"rating": 3.0, "review": "Works ok, but beta version of Chrome PC to chromecast is still definitely beta.", "verified": true, "helpfulness": "0/0", "author": "Kelly Gene Kimmitt"}, {"rating": 2.0, "review": "doesnt work that well", "verified": true, "helpfulness": "0/2", "author": "jim"}, {"rating": 5.0, "review": "Very good!", "verified": true, "helpfulness": "0/0", "author": "Masachika Terashima Junior"}, {"rating": 5.0, "review": "Works awesome,  but really Amazon?  No streaming from you?", "verified": true, "helpfulness": "0/0", "author": "Justin Frodsham"}]