[{"rating": 1.0, "review": "did not work with uverse cable box.  useless for me, freebie for the guy who spent 2 hours trying to figure out a work around. bleeding edge of technology :&(", "verified": true, "helpfulness": "0/3", "author": "Abbe Herbert Moss"}, {"rating": 4.0, "review": "I have a more expensive apple TV, and I found it very limited if you do not use any pay services like Netflix and Hull plus. The Chrome cast works with all my devices (not just apple). I am disappointed that it can not cast chrome browser content from my galaxy phone or iPad yet, but it does work with individual supported apps like youtube. My apple TV only works with my ipad.", "verified": true, "helpfulness": "0/0", "author": "Ian Jeffrey Raloff"}, {"rating": 5.0, "review": "This device is pretty awesome. Want to make your TV into a smart TV but don't want to spend too much for a Roku or Apple TV? This could be the gizmo for you. Plug it in, and use your smartphone, tablet or laptop as a remote control.I am very happy with this purchase. Though I do have an Xbox 360 and a smart Blu-ray player, it is nice to use the Chromecast instead of bringing the Xbox to the TVs in my house to watch Netflix or Hulu. If your HDMI port doesn't provide power, the box comes with an USB cord and a plug adapter if you need it (though if the USB port in your television is a 'service port' the Chromecast can't get power from it, you'll need to plug it into your wall). Another word of caution (kind of), if you want to use your laptop/pc to control your streaming you need to have Windows 7 or higher. This isn't a huge problem but my office computer runs with Windows Vista, so I wasn't able to test how it works beyond my smartphone. Another plus is since you're not running the app on your device, just using it as a remote control, that saves a lot of battery power.If you do your research and this device fits your entertainment needs/lifestyle then it is definitely worth the purchase. And at $35, this is practically a steal. Though the roster of apps is small at the moment, I'm sure there'll be more on the way", "verified": true, "helpfulness": "0/0", "author": "Trevor S."}, {"rating": 5.0, "review": "Very easy to set up and use! Will purchase  several more for the other tv's in the home. Awesome product.", "verified": true, "helpfulness": "1/1", "author": "cesar concepcion"}, {"rating": 5.0, "review": "10-minute set up.  I bought it to share youtube videos with my husband, who is computer illiterate and has no intention of changing that mindset.  It works well.  I'm hoping this latest toy will slowly lead to his curiosity and skill level to the point of actually using a computer.  He learned Roku with ease, this is the next step.  I just do not have the time to continually look things up on the web for him when he's capable of learning to do it himself.  Also, we cut the cable cord earlier this year and it gives us unlimited, on-demand choices.  Fast shipping with Prime, as usual.", "verified": true, "helpfulness": "0/0", "author": "Candace"}, {"rating": 4.0, "review": "It works OK for my NEXUS 7 Tablet. But My laptop PC (Aspire 5740, Window 7) cannot find the Chromecast device, it doesn't work as claimed.", "verified": true, "helpfulness": "1/1", "author": "huashan"}, {"rating": 5.0, "review": "Love it. Can't live without it now lol. Can't wait.for more apps for it! I have actually bought 2 of these.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I bought Chromecast to be able to watch Netflix on my television.  I began the installation process. It said to use Chrome as a browser. I did. I installed. It said that a little icon would appear on the website I wanted to cast, for easy casting. I went to Netflix. There was the icon. I clicked on the program I wanted to watch. And a message appeared stating that Netflix was not supported by Chrome, and recommending I use Windows or Safari. Which is perhaps why the video was cast, but not the sound.All the work and money that went into developing and marketing Chromecast, and they didn't expend the energy ahead of time to work out coordination with Netflix?I returned it.", "verified": false, "helpfulness": "1/4", "author": "Boodicca"}, {"rating": 5.0, "review": "Wow, just works. It's awesome. Works well with HDMI Projectors! Windows 7 Pro x64 .This is the way to go.", "verified": true, "helpfulness": "1/2", "author": "bsharpe"}, {"rating": 2.0, "review": "I would not order this again.  I rarely use it, cause the chrome/google will not let you stream any content from your phone/computer to your tv.  They have blocked any content other than their own or netflix.  Sad to see google having restrictions on their stuff, but I think the apple/google age will die soon if they keep this going.", "verified": true, "helpfulness": "2/3", "author": "mark"}]