[{"rating": 5.0, "review": "I really cannot stress how absolutely ingenious this is and how simple it is to set up and use.Cool tip:  Your streaming capabilities are nearly endless with this cool trick.  Say you have a movie stored on your computer that you want to watch, but you can only stream chrome tabs.  If you just open a new chrome window and click+drag the movie/icon into the window, you can play it through chrome (and therefore watch it on chromecast).  I use this literally every single day and have hooked several family members and friends on to it.", "verified": true, "helpfulness": "0/0", "author": "Dylan H."}, {"rating": 5.0, "review": "I purchased this and didnt use it for a month.  Finally started using it for the World Cup and its a pretty amazing little device.  Now that Google is going to be adding more functionality its going to become very handy.", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 5.0, "review": "its very helpful and works great on wifi", "verified": true, "helpfulness": "0/0", "author": "AP"}, {"rating": 5.0, "review": "Couldn't get any easier! Love this small device, does everything I wanted a roku for but much cheaper! I might just buy another one!", "verified": true, "helpfulness": "0/0", "author": "Travis"}, {"rating": 5.0, "review": "So easy, works great!", "verified": true, "helpfulness": "0/0", "author": "Michele Kvikstad"}, {"rating": 3.0, "review": "This is a great device hobbled by lack of software. Easy to use and great picture quality but ultimately it is really limited. It's especially sad and ironic that it's the #1 Best Seller in Electronics on Amazon, yet there's no Prime compatibility. I guess Amazon expects you to buy their Fire streaming device as well. Lame.", "verified": true, "helpfulness": "0/0", "author": "JG"}, {"rating": 4.0, "review": "Despite the occasional hiccup, Chromecast is a great addition to our apartment's entertainment system.  We've ditched cable TV entirely and I couldn't be happier.The \"cast this tab\" sometimes trips up but it's almost always fixable.", "verified": true, "helpfulness": "0/0", "author": "Nina"}, {"rating": 3.0, "review": "Not mentioned is the requirement for a second HDMI port or 120 volt AC power.", "verified": true, "helpfulness": "0/1", "author": "Copterpilot"}, {"rating": 1.0, "review": "This product have a lot connection issues, the first time worked fine, but in few weeks later the ipad or the computer can't find it the chromecast, you have to turn off and turn on, reboot the wireless and pray too. I Think this product is not ready for sale, is just a beta product.", "verified": false, "helpfulness": "0/1", "author": "Carlos \"Carlos Zamora\""}, {"rating": 5.0, "review": "Really usefull device! Simple to use, fast, and growing market. I think is super cheap for all that you can do with it!", "verified": true, "helpfulness": "0/0", "author": "Walter"}]