[{"rating": 5.0, "review": "Very user friendly.  Works wonderfully. Small, but powerful.  I would definitely recommend this product to anyone.  You won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Ray P"}, {"rating": 5.0, "review": "One of my best friends told me about this and I was really interested.  So I went ahead and purchased it and am so glad that I did!  It did not work immediately for me but once I improved my wireless router, I found that I love to use this!", "verified": true, "helpfulness": "0/0", "author": "Davlynn"}, {"rating": 3.0, "review": "For $30 this is a neat gadget that allows you to stream video from your laptop to the TV. As of now it only seems to work with Google applications, HULU, Netflix, maybe a couple others. Works great with those applications but not so well with anything else.", "verified": true, "helpfulness": "0/0", "author": "Dan Rumore"}, {"rating": 4.0, "review": "It has a good image quality and works really nice. But the ruge diference from Apple TV is that streems only online videos, no pictures or videos on the device are showed on tv", "verified": true, "helpfulness": "0/0", "author": "Fernando Silva"}, {"rating": 5.0, "review": "Good product. Easy to setup easy to use. Looking forward to more apps joining Chromecast. Blah, blah, blah, blah, blah", "verified": true, "helpfulness": "0/0", "author": "John Bras"}, {"rating": 2.0, "review": "It's not as expected thought it would do more !  If you have net flix don't buy this to me it useless unless they come up with more apps", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I find this very helpful. My one big disappointment is that it does not yet support Amazon Prime instant video.", "verified": true, "helpfulness": "0/0", "author": "World History Teacher \"worldhistoryteacher\""}, {"rating": 5.0, "review": "What a great product!  My kids love watching youtube videos of golden retriever puppies.  We also love watching movies on HBO to go.", "verified": true, "helpfulness": "0/0", "author": "Lori Porco"}, {"rating": 1.0, "review": "What a piece of c_ _ p - not plug and play, doesn't work, too good to be true! Caused my pc to crash! Spent two evenings dealing with this, finally got my system restored. Positive reviews false? Google Chrome at work doesn't function either. Still looking for a viable option to the cable tv ripoff .....", "verified": false, "helpfulness": "0/0", "author": "Jmbomr2"}, {"rating": 5.0, "review": "Quick, easy set up, and we were able to \"cast\" content onto our TV within seconds. If you stream a lot of content on your iPad, iPhone or Android devices but want to see it on a bigger screen, this device is definitely worth the investment. Not only do I watch Hulu and Netflix on it, we also stream Pandora for music on our TV now. Great buy!", "verified": true, "helpfulness": "0/0", "author": "Andy Liang"}]