[{"rating": 5.0, "review": "This is great!  I can watch Netflix on my tv using my phone and I can still text.  I bought 3 of them.", "verified": true, "helpfulness": "0/0", "author": "Marie Dompierre"}, {"rating": 5.0, "review": "No hassle setup, show off your teck skills and gift it!", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Venkatakrishna Pabbareddy"}, {"rating": 5.0, "review": "Best thing ever. For about 30 bucks I was able to turn my TV into a semi-smart tv. As google gets more apps with casting, this thing will get better than ever. My only complaint is a very minor one, the fact that it isn't password protected. My roommate will prank me sometimes by connecting to the chromecast and sending some music video or something at like, 3 am. Harmless fun, just wonder what it would be like in a dorm situation or something where you might not like your roommate. All in all, very good device.", "verified": true, "helpfulness": "0/0", "author": "RJ"}, {"rating": 5.0, "review": "he loves this product! I think I need to purchase one for myself. My daughter has one too, the enjoy streaming to the Comcast from there phones to share YouTube videos with a group of people.", "verified": true, "helpfulness": "0/0", "author": "Teri W."}, {"rating": 4.0, "review": "Thank you", "verified": true, "helpfulness": "0/0", "author": "Maria Torres"}, {"rating": 5.0, "review": "Had this for over a year now. a bit glitchy at first, got better with several updates, but the backdrop functionality still doesn't work very well, too bad cuz it was one of my favorite function.", "verified": true, "helpfulness": "0/0", "author": "Qian Li"}, {"rating": 5.0, "review": "Best tool to stream everything to an HDTV.  Highly recommend specially if trying to stream non traditional web channels ie. direct from tennis channel etc through PC Chrome browser.  Otherwise pretty much various tools can stream youtube amazon just as well.", "verified": true, "helpfulness": "0/0", "author": "Luis A Mancilla"}, {"rating": 5.0, "review": "I didn't know what all the hype was about...Now I know! This thing turns almost [my 2005 DLP doesn't display anything besides Chrome loading after a soft reboot] anything into smart T.V. My wife can't cast her iPhone 6 screen but hey, she wanted an iPhone. Music, TV, my screen literally anything can be sent to the T.V. If only I can get voice commands to work... :)", "verified": true, "helpfulness": "0/0", "author": "francisco dinunzio"}, {"rating": 5.0, "review": "Good price compared to", "verified": true, "helpfulness": "0/0", "author": "YOUNGBEOM,CHOI"}]