[{"rating": 4.0, "review": "Works well but the price is kind of high", "verified": true, "helpfulness": "0/0", "author": "Book buyer"}, {"rating": 1.0, "review": "My husband and I have a Roku but we purchased the Amazon Fire TV as a gift for my mother and stepfather since they were new to Amazon Prime and wanted to maximize their subscription. Well, we wish we had just gotten them the Roku. You can use the Amazon app on Roku anyway, and the negatives to the Amazon Fire TV far outweigh the positives.Worse Than Roku:- No universal search. If you search using voice or text from the main screen, it only takes you to results from Amazon (not Netflix, Hulu, etc). That means that you have to search each app individually to find a movie. It also means that you might be told you have to pay for content (because Amazon doesn't have it on Prime) when you could watch it for free on another app.  This has cost my poor mother some money that she didn't need to spend.- Design layout prioritizes Amazon for everything, meaning you don't see as many shows or movies from other apps and you're not told if they are available for free or cheaper on other apps without searching each one individually.Better than Roku:- Voice Recognition (EXCEPT that voice will only search Amazon, not other apps like Netflix or Hulu)Other than that the platforms are pretty similar, but these issues greatly impact the usability of the product.  My mom has gone back to using regular TV because she's convinced she has to pay for everything on Amazon (even though a lot of her shows and movies could be found for free on other apps through the Amazon Fire, she's just not going to spend the time \"shopping for the best deal\" through her tv when she just wants to watch a show after dinner).  So I feel like I wasted a bunch of money on this product. What's worse is that I probably won't be able to get her to try Roku now because she's been so soured by Amazon Fire TV that she thinks all streaming platforms will be as bad as this one, and she'd rather just go back to using traditional cable even though it costs way more every month.  That may seem pennywise and poundfoolish, but that's the way it goes.  If you want ease and efficiency, go Roku. Don't waste your time or your money on this device. It's basically just one giant Amazon advertisement and god help you if you want to use any other apps.", "verified": true, "helpfulness": "4/5", "author": "Violet Rebellion"}, {"rating": 5.0, "review": "We love our Amazon fire TV as there was nothing on TV worth watching so we cancelled our cable to get this so we could find something decent to watch and it paid off very soon!! Glad we purchased it!!!", "verified": true, "helpfulness": "0/1", "author": "Pat L. Dulin"}, {"rating": 4.0, "review": "its awesome not just with giving me Netflix and possible the only game system ill ever need in the future but more. however I have a few criticisms with the games 1. the game I downloaded gta vice city seems easier than the ps2 version and after awhile it would stop making the soun forcing me to uninstall it then reinstall it and have to start all over again. 2. I think its stupid having games like tic tac toe and flappy bird for this when you can play those any mobile device. 3. I hate that you have to scroll through a list  in order to find a game you may want to play and does allow you to search by typing the game in. 4. my final criticism is that there aren't that many games on it put games like the batman arham series or the kingdom hearts games and sales would skyrocket that and plus I don't want to spend like 500 dollars on a game system I may have to replace in a few years its getting ridiculous. but other than the gaming I have no problems with this", "verified": false, "helpfulness": "0/0", "author": "Michael Nally"}, {"rating": 2.0, "review": "Not happy. In the description, they should list the cable companies that can be used by this device. I found out, after I hooked it up and tried to use it on HBOGo and ShowtimeAnytime that, although the icons show up on the screen, when you go to activate it, it is not available from Charter. I called Charter and they blame Amazon. I call Amazon and they act like they have no idea what I am talking about. So it works fine for their stuff but not the cable channels.", "verified": false, "helpfulness": "1/1", "author": "JLnSTL"}, {"rating": 5.0, "review": "Yes, my life is changing and I am trying a new thing in my old age.  One I get this all hooked up I hope to be thrilled with everything available.  I also did not want to have to stream through my old laptop so I got the whole set.  Best thing yet my points covered the costs.", "verified": true, "helpfulness": "0/0", "author": "DONA"}, {"rating": 5.0, "review": "A fantastic little yet powerful device!", "verified": true, "helpfulness": "0/0", "author": "S Blecher"}, {"rating": 4.0, "review": "I am really enjoying Amazon Fire TV.  I particularly love the access to movies through this, as well as the Prime music.  I recommend that if people purchase the Fire TV, they spend the money to get Prime--it is worth it!  I wish some of the latest movies did not require a rental fee, and the game apps often allow you to play a level or two then make you purchase additional levels (yes, just like phone apps).  I also recommend getting a Fire TV game controller.  The basic controller is nice, particularly for the voice command but it is useless for many game apps, and it is so small that it is easily misplaced.", "verified": true, "helpfulness": "0/0", "author": "John L. Griffis"}, {"rating": 5.0, "review": "Great product with a vast array of apps.  However, the best feature is the ease in installing and syncing the Amazon Fire TV.  Honestly, it almost installs itself and allows you to control what and when you watch TV instead of the networks.", "verified": true, "helpfulness": "0/0", "author": "Mike M"}, {"rating": 5.0, "review": "Fast delivery.  Easy set up and love it.", "verified": true, "helpfulness": "0/0", "author": "S. Keith \"Sandy\""}]