[{"rating": 5.0, "review": "It works so much better than I thought it would. I love it", "verified": true, "helpfulness": "0/0", "author": "brielle1259"}, {"rating": 2.0, "review": "I have not been able to get consistent playback while using this device. the technology cannot outperform the flawless playback of blu ray or DVD.", "verified": false, "helpfulness": "0/0", "author": "Benjamin T Wahl"}, {"rating": 5.0, "review": "Easy set up and easy to use. Couldn't ask for a better product for my anti-tech parents!", "verified": true, "helpfulness": "0/0", "author": "ACY89"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Aldrin"}, {"rating": 5.0, "review": "It ( in most cases) replaces the old H.D.M.I. Cables. The only downfall is that it only works on some sites and not all of them!", "verified": false, "helpfulness": "0/0", "author": "Eric Dahlquist"}, {"rating": 5.0, "review": "By far one of the most amazing products I've bought yet. This thing is amazing! I've bought 5 of these so far, and they make great gifts for family and friends. Not only is it extremely easy to setup and use, but developers are constantly adding support for Chromecast. The beta feature in Google Chrome lets you cast your Chrome browser to your TV. The lag is easy to overlook, but I'm sure this will be improved in later software updates. I do hope Spotify will support Chromecast so I will not have to use their web player, the volume tends to swing. There are minor bugs with this device but the price makes up for it. With later hardware updates to come, this is definitely the future of streaming.", "verified": false, "helpfulness": "0/0", "author": "Jakob L."}, {"rating": 5.0, "review": "I love this inexpensive but elegant Chromecast from Google.  I set it up in 5 minutes, it took 20 minutes to update itself, and I was streaming movies 5 minutes after that.  Almost no lag between selection and appearance on my TV screen, with excellent clarity of picture.  What a bargain!", "verified": true, "helpfulness": "0/0", "author": "Rick Boys"}, {"rating": 3.0, "review": "I like that I can plug it in to any hdmi port and that setup was pretty easy. Also picture quality is pretty decent.What I don't like is how it's only compatible with certain apps. It would be nice if I could use it to display any content I wanted from my mobile device or even display screen mirroring.", "verified": false, "helpfulness": "1/1", "author": "David Tarantelli"}, {"rating": 4.0, "review": "Not quite as easy as advertised but, once it's hooked up, it works well.  I recommend patience and a nearby lap top for reference.", "verified": true, "helpfulness": "0/0", "author": "smcdiniowa"}, {"rating": 3.0, "review": "I bought this to travel with me for use in hotels and at friends houses. Its very nice to be able to watch what I want when I want. CONS: very limited app support at the time..", "verified": true, "helpfulness": "0/0", "author": "Peter V."}]