[{"rating": 1.0, "review": "I was looking to watch TV shows that were on that day at the time it was scheduled. we live way out and hard to get TV.", "verified": true, "helpfulness": "2/6", "author": "Brenda"}, {"rating": 2.0, "review": "My husband and I had been contemplating updating our 10+ year old a/v set up, but had been putting it off due to the fact that our SD 27\" CRT worked just fine, thank you. We streamed Netflix through our Wii, listened to music by plugging in a mostly defunct laptop to the receiver and called it a day. Then HD & digital TV became the norm. We had to upgrade our directv box. Then there were the small kids beating on the television. It was time to upgrade and one of the things that pushed was the idea of speaking our choices for tv as our 4yo isn't quite the speller yet. The idea of her watching MLP without waking us up on a Saturday morning danced in our heads. Then Amazon dangled the free trial, and we were sold.The weekend before, we finally bit the bullet and upgraded our system - new Smart TV, new bluray player and receiver were all set up when the FireTV box arrived. We plugged it in and tested the voice commands. It worked! It brought up the Amazon Prime listing we were looking for - huzzah! But wait---this show is free on Netflix. Maybe we need to have that logged in for the search to pull that option as well. But that didn't work. The voice search only searches Amazon's selections and not everything that can be accessed via the box. Our dreams are crushed. We check our bluray & television and both can get the Amazon Instant Video and the television even has the new cloud music player. The FireTV goes back in the box and back to Amazon.The ease of use is stellar, the choices are clean and clear and the voice recognition is about par with the one on my car / phone / Siri. If you do not have a Smart TV or app-enabled bluray player, this may be a great solution for you to get your Amazon fix and other apps.In the event that Amazon launches version 2.0 that has the voice search for all the apps, I may be the first in line. Until then, it's a pretty box that makes Amazon stuff easier and that isn't quite enough yet for me.", "verified": true, "helpfulness": "2/5", "author": "Rae"}, {"rating": 1.0, "review": "I was fortunate to be offered a unit to try free for 30 days - unfortunately the unit - which arrived very quickly, and looked to be of good quality, did not work.The returns process does not allow a replacement to be provided, but a credit given on the return of the faulty unit - and I was too lazy to go through the process again!", "verified": true, "helpfulness": "1/3", "author": "NickH"}, {"rating": 5.0, "review": "This is a great product...the kids love it too.  Looking forward to more apps being added and also the kids mode feuture that will be released.", "verified": true, "helpfulness": "0/0", "author": "Sara Roboubi"}, {"rating": 3.0, "review": "It's a cool product, but I already have a smart tv and a ps4. Just a little too late Amazon...", "verified": true, "helpfulness": "0/0", "author": "roy"}, {"rating": 2.0, "review": "I was very disappointed in the performance of this device, it is a watered down version of the apple tv device, you have to download all the apps you want to use such as hbo,shotime, and some the streaming apps require you so have cable tv service with companies that do not provide cable or internet service in my area. I am glad the device was free, and i did not pay for otherwise id feel ripped off. I would not recommend this device to anyone.", "verified": true, "helpfulness": "1/2", "author": "Miguel Rua"}, {"rating": 2.0, "review": "From day one I've had issue with it and seriously contemplating a return as much as I would love to tell the remote to Find Gary Busey,  I think I will tell it to ship itself back!!!", "verified": true, "helpfulness": "0/3", "author": "james carter"}, {"rating": 5.0, "review": "I'm an Apple person first, and though I love my Fire Tv, I still mostly use my Apple Tv -- strictly because I have an iPad and I can use airplay. However, whenever I use my Fire Tv, I love it, and I have a royal blast. It works great, streams super-fast, and I think it runs smoother than Apple Tv.The Game Apps are a big bonus, and I just ordered the controller for extra performance. I'm glad I took a dip, and since Amazon is always my secondary choice after Apple, I'm thrilled to now have the best of both worlds!!!", "verified": true, "helpfulness": "0/0", "author": "Mark Bickham \"Dillannj\""}, {"rating": 1.0, "review": "Pretty much useless if you already have a ps3 or system that lets you watch Netflix and hulu. Sure, it listens to you when you say something, but Thai feature is not worth the amount of money you have to pay. Everything requires you to spend more money to watch it.", "verified": true, "helpfulness": "3/7", "author": "Abel Abrego"}, {"rating": 5.0, "review": "I chose to rank Amazon Fire TV as excellent as my family and myself are \"over the top\" pleased with it.", "verified": true, "helpfulness": "0/0", "author": "George Matus"}]