[{"rating": 4.0, "review": "It works great but there is a limited availability of apps that support the device. May improve in functionality over time.", "verified": true, "helpfulness": "0/0", "author": "Erica"}, {"rating": 5.0, "review": "While the Chromecast has its limitations, it still does a great job delivering in terms of what it is supposed to do. For its very reasonable price, I couldn't ask for more.If you have a TV without wireless internet capabilities and you want to stream Netflix and YouTube, etc. to your TV, this is probably the best value around. As long as you have an HDMI port on your TV, you will be able to use this. It even comes with a USB cord and a standard electrical outlet plug adapter if you need to power it that way. Not to mention it also comes with an HDMI extender to make sure that you don't have to worry about whether you have room to plug the Chromecast into your TV.I would certainly recommend this to anyone who feels they could benefit from the advertised features of the Chromecast. It delivers as promised.", "verified": true, "helpfulness": "0/0", "author": "Lyncoln A. Delporte \"Lync\""}, {"rating": 4.0, "review": "I love this device, i can take it from t.v to t.v. The only downer it is not compatible with amazon prime movies", "verified": true, "helpfulness": "0/0", "author": "Claudette McCallum"}, {"rating": 4.0, "review": "Received the unit within 2 days.  Had problems configuring the Ipad to operate with it.  Never got that working.  But it worked perfectly with the Android phone.", "verified": true, "helpfulness": "0/0", "author": "Tommie Green"}, {"rating": 5.0, "review": "finally able to get video on my tv without all the cables.Now I have a set iof cables for sale.uu", "verified": true, "helpfulness": "0/0", "author": "B Jak \"\"Bdeye\"\""}, {"rating": 5.0, "review": "Once Google gets off their ass and opens the development and approval for new apps freely - the streaming and cable tv world will be upside down because of this little device..Get one now - you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "The Chromecast is a nice device which is capable of doing exactly what it is advertised to do...nothing more. Unlike the Roku devices, you will need a PC/laptop/tablet or smartphone to stream movies. Once you have the movie streaming, you can even turn off the device you used to start the stream. For example, I initiated a stream on my phone and then turned off the phone. The movie continued streaming on the TV. The Chromecast is an excellent device for Google Play movies/music. I didn't try any of the other compatible services (Hulu, HBO, etc.) It is not compatible with Amazon videos as it is with Google Play BUT you can still stream an Amazon Movie from your laptop using the Google Chrome browser. What you'll see is your actual laptop's display being streamed. Doing that requires the laptop to remain on. You can pretty much stream anything in a Chrome browser tab as long as you have the Chromecast extension addon.For $35, it's a nice little device that does what it says it will do...very easy to setup.", "verified": true, "helpfulness": "1/1", "author": "GWT"}, {"rating": 5.0, "review": "I ordered this so I could watch Hulu on my TV. When I saw videos of it, it didn't mention the setting up factor. I've had it a few weeks now, and it remains in it's box. Unfortunately, I'm not very technically minded, and I found it impossible to set up. Very disappointed.**UPDATE**I'm smilling now, someone told me about a website that gave you instructions on how to get chromecast working on the TV. It wasn't as difficult as I expected, I am now watching Hulu Plus from my tablet, on the television.I have the website on my tablet (I'm on the computer) so cannot let you know it now, but if anyone wants to know the website, let me know and I'll look it up", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"sunshine\""}, {"rating": 5.0, "review": "This product makes media streaming to the home so easy and it's price point cannot be argued with. And a great shopping experience withAmazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Watch anything you can open in the Chrome Browser as well as Netfilx and more. Control yourTV from your smart phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "Mitch Kruger"}]