[{"rating": 5.0, "review": "excellent overall experience", "verified": true, "helpfulness": "0/0", "author": "Marco Cutolo"}, {"rating": 1.0, "review": "It said on the description that it can be used with a laptop,well google couldn't even get it to work,they said it should work with vista,well it didn't.", "verified": true, "helpfulness": "0/0", "author": "Christine Boles"}, {"rating": 4.0, "review": "Everything works great, you just have to be aware that an older laptop/not the best specs might have a tough time. When I chromecast from my older laptop the video will lag and the CPU usage might go to 100%. (has also crashed before). Apart from that chromecast works as advertised.", "verified": true, "helpfulness": "0/1", "author": "NBK \"Bücherwurm2\""}, {"rating": 2.0, "review": "I don't like this device. It messed up my home network while setting it up. My other devices wouldn't connect to my router. I had disconnect the Chromecast and reset set my router in order to connect other devices. I followed the set up instructions.", "verified": true, "helpfulness": "0/1", "author": "oneofmany"}, {"rating": 5.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "droidrev71"}, {"rating": 4.0, "review": "Fantastic and just as I expected! The first one I got was defective. It frequently used to shut down and had to unplug and plug couple of times for it to work again. After trying direct power and USB couple of times, I returned the product. But I loved it so much when it was working that I ordered another replacement. Google recommended to use direct power source instead of USB if you can, as it gives constant source of power. The replacement has been working pretty well. Regarding the product itself, it is just as I desired. I am able to cast Netflix, espngo, youtube effortlessly. The quality is just amazing too. Would have given it 5 but for that initial glitch I had.", "verified": true, "helpfulness": "0/0", "author": "Pav"}, {"rating": 4.0, "review": "Need to add more streaming sites to be competitive with Apple TV, Fire, or Roku.  But it is great for watching netflix and at only $35 it's worth the cost.", "verified": true, "helpfulness": "0/0", "author": "Terry D. Moore \"Tmo78759\""}, {"rating": 5.0, "review": "Works as intended, and a fun feature they came out with later with at least the iOS YouTube app, is to have a \"TV Queue\" where you and family / friends can sit around the TV and queue up YouTube videos to play one after the other.Note: Your WiFi network can't have a period in the name. (Or at least it couldn't when I first set this product up when it first came out). I used to have my network be called \"NoAgendaStream.com\" and had to change it to \"NoAgendaStream\"", "verified": true, "helpfulness": "0/0", "author": "M. Comer"}, {"rating": 4.0, "review": "Usually works really good. Will every once and a while fall of off my cell phone. I usually have to turn my wifi off one the phone then back on and it will pick it up again. Overall very good.", "verified": true, "helpfulness": "0/0", "author": "Bryan Bradshaw"}, {"rating": 5.0, "review": "Coolest product ever. We can \"cast\" shows and videos from all of our devices.", "verified": true, "helpfulness": "0/0", "author": "A. Merwin"}]