[{"rating": 5.0, "review": "After having trouble with my first Fire TV (got stuck in cycle of failing to download Software Update from Amazon) -- Amazon's great customer service was quick to send me a new one with free overnight shipping -- I was able to give the device a fairly good testing.Pros: - User interface is very responsive (compared to Directv, Google TV, and PS3, response is very fast) - Search worked (although I only used it once to find \"Plex\" app) - For adventurous / technically-savvy, \"sideloading\" applications like HBO Go and XBMC is easy (Amazon even provides documentation on side-loading) -- note: for HBO Go, I just TitaniumBackup to copy from my Android phone - my USB keyboard/mouse combo works w/out any additional setup - paired with Amazon's great customer service - already seeing a strong developer/hacker community (e.g. XBMC and XDA-Developers forums)Cons: - lack of *initial* HBO Go and Spotify apps (I suspect we'll see these soon enough, but I could be wrong) - no *initial* easy Logitech Harmony remote support (**unless** using Flirc, a USB dongle that works well w/ Harmony remotes; but then USB keyboard port being used.. maybe a USB hub would address this) - no *initial* external hard drive support (at least according to users on above-mentioned forums)I'll update if any other pros/cons come to mind", "verified": true, "helpfulness": "4/4", "author": "D. Antenucci"}, {"rating": 3.0, "review": "Please add acorn and ear plugs, before I can buy. Then will definitely purchase as I'm always happy with amazon purchases", "verified": false, "helpfulness": "1/9", "author": "Barbara Shoemaker \"Barbara\""}, {"rating": 2.0, "review": "The hardware is well designed and fast, but it's let down by the software...1. The voice recognition sucks, just getting it to recognize something simple like \"Star Trek\" was an exercise in frustration2. Amazon doesn't make it at all clear in the UI whether the content is part of the free content available to Prime subscribers or notI'll persevere with it in the hope that Amazon will produce software worthy of what is a very good piece of hardware", "verified": true, "helpfulness": "5/9", "author": "Nicholas Simpson"}, {"rating": 5.0, "review": "I didn't know what to do about streaming and what equipment to buy and then last week  there was Amazon Fire TV. It is so easy to setup and having the Kindle Fire with WiFi so that helped set it up. The box and remote are small and easy to handle.It's fun to use the microphone. I had a few questions and got great help from Amazon and got the answers I needed.", "verified": true, "helpfulness": "0/0", "author": "Linda Harper \"Book Happy\""}, {"rating": 3.0, "review": "I liked the speed and if you usually buy Amazon content then it's a no brainer it's awesome. I personally dont want to limit myself to Amazon only and if amazon continues to nickel and dime you on tv shows I will just not watch as much tv.  I prefer the Roku because it gives you a better way to display other channels. the Fire seems like it only wants prime members and pay per view content.", "verified": false, "helpfulness": "1/4", "author": "Timothy Norton \"tnorton32\""}, {"rating": 5.0, "review": "Why is there not an off/on switch??? Easy to use.  Set up was easy.  Menu location somewhat confusing at first.  Love the Amazon cloud photo app.  /works great and slide show is excellent.  Netflix works fine on this device.  Voice is a nice feature and works to locate anything.  Purchased this device instead of other devices  and other than the off/on switch it is a great streaming unit and would purchase again. After reviewing why there is no off/on switch I know now why not.  The Fire TV goes into sleep mode and is ready to go by mere touch of button.  No new loading. Better than on /off switch.", "verified": true, "helpfulness": "1/1", "author": "teddy"}, {"rating": 5.0, "review": "I really like this product just wish it included Redbox streaming videos. I really like the games and the voice command features. Its a real winner.", "verified": true, "helpfulness": "2/4", "author": "Joseph"}, {"rating": 5.0, "review": "I'm very happy with my Fire TV purchase.  I've been using it for almost a week now, and it has met or exceeded all of my expectations.I appreciate the high quality hardware:With a Qualcomm quad-core 1.7 Ghz processor, a Qualcomm Adreno 320 graphics processing unit, 8 GB of storage, and 2 GB of memory, I figured Fire TV would be fast, and it is.  There is no hesitation or lag time when I navigate through menus, and a movie or TV show starts playing almost instantly instead of hesitating while buffering.  It's so nice to push a button and have an instant result rather than the delays and hesitation I get with my Roku.There are plenty of other things to like about Fire TV too:There is a ton of great content.  It was very easy to set up, and it's very easy to use. Voice search works really well, and I find myself using it a lot more than I thought I would.  And Fire TV is beautifully integrated with other Amazon products and services, like their tablets, cloud drive, and Prime.And a surprise bonus...gaming:The gaming is *way* better than I expected for a device in this price range. (I have played some games on my Roku but the lower hardware specs made it a pretty poor gaming experience.)  I did not buy Fire TV for the gaming, but because of the great hardware and some very good games, I'm having a lot of fun.  I've now ordered a game controller to take full advantage of Fire TV's gaming capabilities.Fire TV is a great product. I think Amazon did a really nice job with this one.", "verified": true, "helpfulness": "3/3", "author": "AnAverageCustomer"}, {"rating": 4.0, "review": "I got the Fire TV as streaming on my PS3 was struggling. Content from AIV was buffering every two minutes and Netflix would freeze up. Streaming worked great on my PC so I knew it wasn't a bandwidth issue. Chose the FireTV over Chromecast because I wanted a stand alone device and I am a Prime Member. Chose it over the Roku because it looked like it had superior specs that could be software upgraded easily for a couple of years without having to buy new hardware.First one arrived DOA (no power at all) but Amazon overnighted a new box that worked great (Amazon service was another reason I chose the FireTV). Setup was easy, video quality is great, and no more buffering/freezing!!!!!If the voice search worked with all apps, I would likely give it 5 stars. I would guess that is coming soon based on the number of similar requests i've seen. Seems like an easy software upgrade either for Amazon or the app providers and a great differentiator for them.", "verified": true, "helpfulness": "1/1", "author": "J.S."}, {"rating": 5.0, "review": "I love this thing.  I am an Apple Fan Boy and I have to admit that this blows the AppleTV away.  It is very fast.  Responds when you press the buttons instead of a lag.  The voice search works great for me.  I usually have a problem with even the best voice recognition because of my strong southern accent.  This things even works for me.  I am incredibility impressed to say the least.  Some of the apps need to be rewritten because they do not work as well but I am sure this will happen.  I hate the android Netflix app but that is not limited to the Fire TV.  I just know Amazon will press for better written apps.", "verified": true, "helpfulness": "3/3", "author": "Bamacab"}]