[{"rating": 5.0, "review": "It's awesome, you don't have to worry about turning on this device or that device so that you can watch Netflix, you can also cast YouTube videos and what not.  If you pair it with Allcast (android app) you can cast most any video, picture, or music from your phone to the Chromecast.  Pretty useful device for it's price.  Super portable so you can bring it to someone's house and sync it up with their wifi in a minute or two and poof you're set to use the device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a highly portable, reliable, and convenient media player. Everywhere you go there is a usb ready device to plug chrome cast into. I own a Galaxy Note II and it is a great pair to use for slideshows and more. If you are considering a device enhancer that will allow you to beam images and video like apple tv, this is your best value.", "verified": true, "helpfulness": "0/0", "author": "Hitims"}, {"rating": 5.0, "review": "Works without flaws!  Quick and easy to use! I can use it with my smartphone or my tablet once the app is installed!Excellent!", "verified": true, "helpfulness": "0/0", "author": "Denny Arevalo"}, {"rating": 5.0, "review": "Great product the best for really low priceExtra easy to useYou wont buy a smart TV ever again", "verified": true, "helpfulness": "0/0", "author": "Elciario Naranjo"}, {"rating": 5.0, "review": "This amazing little product is great. You just plug it into your TV's HDMI and USB port (it comes with a separate USB to regular socket coverter, in case your TV doesn't have USB ports), breeze through the setup (you can do it from your phone/tablet or computer) and you're good to go. Right now you can use it mostly for Netflix and Youtube, but with the fast increase in support from various other companies, everything looks very promising. I personally use it whenever I'm browsing on my phone and come upon a Youtube video, I just turn on the TV (the device turns itself on automatically with your TV if you have it plugged in to your TV's USB port, but if you connect it to a wall socket, it will always stay on I think), change the input, and in a few seconds I am watching the video on the TV instead of my phone. Very convenient. Also, once the initial setup is done, you can plug it into any other TV's in your house and it will work. Amazing!I have tested it with Android and iOS phones and tablets and it works on both. Whenever I have people over, anyone can stream content to it by just logging into my local network and downloading the free app on their phones, so if someone is all \"Have you seen this video on Youtube?\", they can easily show it to everyone on the TV. It's extremely easy; if someone is streaming something and another person wants to stream something else, they just do, without having to manually stop the first stream or log on to anything or whatever (as long as they are on your local wireless network). Like I said, right now you can use it for Youtube, Netflix, Google Play Music and whatever you can open on a Chrome tab on your computer, but every day there is more support and new apps compatible with this device.The best part: THE PRICE!", "verified": true, "helpfulness": "0/0", "author": "Arturo Castro Molina"}, {"rating": 3.0, "review": "Make sure to check the router compatibility.  I have the largest internet provider and their most common router...it was not compatible and the fixes involve port forwarding or getting a new router.  In addition, I have the router close by but it's one floor up.  I only get 2 of 5 bars so it doesn't work.  The mirroring is useful and it's great for sharing things in groups as most people can easily connect if your signal is strong enough.  The price point is unbeatable.  Find someone who has cable and use their sign in info to fully utilize any streaming device.", "verified": false, "helpfulness": "0/0", "author": "A"}, {"rating": 5.0, "review": "I wish that it would work with more programs.  No more internet interruptions in movies.  I love it with Netflix and HBOTOGO.  Can't wait for more programs to work with this.  Best thing since sliced bread!", "verified": true, "helpfulness": "0/0", "author": "KVBcarter"}, {"rating": 1.0, "review": "I would only work every once in a while. Wasn't worth the money or the aggrevation of tiring to get it to work. I sent it back", "verified": true, "helpfulness": "0/0", "author": "Lori E. Cline"}, {"rating": 5.0, "review": "definitely i recommend!very easy and quick to install!now my netflix get much more interesting!very ni ce purchase", "verified": true, "helpfulness": "0/0", "author": "Raquel Lundgren"}, {"rating": 4.0, "review": "For people who want nothing more than to watch movies on Netflix every so often, the Chromecast is perfect.  It's small and the streaming quality is excellent.  For binge watching (autoplay and the like), It's tough not to recommend dedicated streaming boxes as they come with more features for power users.  I also had a few issues connecting to my network and sometimes the Netflix app would lose contact with it.  But overall, this is a very solid product.", "verified": true, "helpfulness": "0/0", "author": "Nerd Ferguson"}]