[{"rating": 5.0, "review": "Great, very easy to use. Does everything it says it does. Recommended it to all  my friends. Well worth the price.", "verified": true, "helpfulness": "0/0", "author": "ERIC PERSSON"}, {"rating": 3.0, "review": "I like having the ability to view YouTube on the TV, but have had some issues with playlists not syncing, or syncing but taking away my ability to pause and play.  I would like it if other video players incorporated a Chromecast button.  It is worth the money, but I think it needs a bit more work to be more 2014.", "verified": true, "helpfulness": "0/0", "author": "V. J. Miyagi"}, {"rating": 4.0, "review": "A genius idea, a little skimpy on the offerings of programming but does its job and was way cheaper than our Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Aaron J Shepherd"}, {"rating": 5.0, "review": "I love this. LOVE IT. Hoping it is on the front end of newness, and that other software picks it up for compatibility. But for Netflix and YouTube, it's simply awesome1", "verified": true, "helpfulness": "0/0", "author": "Matthew Johnson"}, {"rating": 5.0, "review": "I mostly use it for streaming Netflix, with the tab-casting being in beta testing, but so far so good. All the streaming apps come in crystal clear in HD, and the setup was a breeze. The only troubles I've come across is that it gets a little choppy with the tab-casting, but that's not a huge issue, and it doesn't impede anything I was planning on doing with the device.", "verified": true, "helpfulness": "0/0", "author": "Bob Kibble"}, {"rating": 5.0, "review": "I really like the product. I stream Netflix alot and really smooth no lag time. I really recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "Thank you so much for making this so easy to use.  I was waiting for this invention! Again, thank you!", "verified": true, "helpfulness": "0/0", "author": "Rene"}, {"rating": 1.0, "review": "This purchase has been a real disappointment. Apparently it doesn't work well with all routers. We have a Belkin router and have had to call google support and Beklin support to make adjustments to our wireless router settings to get Chromecast to work, and when it does, it craps out before we even finish what we're trying to stream. At this point we've given up on trying to troubleshoot it.", "verified": true, "helpfulness": "1/1", "author": "A. Kretz"}, {"rating": 5.0, "review": "Although I had some trouble getting it set up (it was a fussy with my wireless router) - it has worked like a charm since.  It should be noted that you need a wireless network andif you go to its webpage you can make sure your router has been tested with it to avoid potential connection problems.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So easy to watch Netflix and YouTube! I love being able to share from my phone instead of having to turn on my computer every time. Wish more programs were included  - like Vudu.", "verified": true, "helpfulness": "0/0", "author": "Natalie"}]