[{"rating": 5.0, "review": "At first we just felt so so about it but after a few days, we really like it.We can watch our Prime TV on the 42\" TV and not on iPads and KindleFire with a lot less distraction/disconnecting etc, or taking up a laptop's use.The big plus is the ability to play old games like Sonic the Hedgehog and other games on the cheap and the kids love it.We do have FruitTV and take turns with this and they both serve their purposes.", "verified": true, "helpfulness": "1/1", "author": "Jennylou \"People do business with people they know and like; so, be known and be likeable.\""}, {"rating": 5.0, "review": "I own the Google, the Apple TV and the Roku systems -- all purchased to make smart TV easy.  Fire is by far the best of the lot.  It is inexpensive, easy to install (very easy), the choices of media are superior and the voice control is (so far) flawless.  After seeing this device in action on my television three friends ordered Fire.  Again, the voice control is superb -- far better than on my iPhone 5.", "verified": true, "helpfulness": "2/2", "author": "Pat Choate"}, {"rating": 2.0, "review": "I like my ROKU since it was $50 dollars cheaper and I was able to get BYUtv and other stations which are not available with Amazon Fire TVMake sure and check all the channels available on BOTH before you buy!!!", "verified": false, "helpfulness": "2/8", "author": "J. Stokes \"Country Girl\""}, {"rating": 2.0, "review": "I have two ROKUs and one WD liveTV 1080P. The Amazon fire TV does nothing special compared to other streaming devices out there. I expected a lot more from Amazon than what it actually is. So, I will straight get into pro and cons.Cons:• The usage of USB port is a mystery! It is just there for show. Lets just be honest, no one is going to hook up their mobiles and game controllers to be charged (usb port is in the back of the device). If a streaming device has a USB port, the expectation is that you will be able to hook up an external storage device to access personal photos and videos. Looks like Amazon just added a USB port and got confused. So, they left it at that! WD live TV does a better job in connecting external storage and sharing over the network.• It does not work with old HDMI (Monster) cables. I had to swap out my old cable with a newly bought “Amazon” HDMI cable.• Not much App support. If you are an Amazon prime member then there is really no need of apps like Neflix, Holu plus, Crackle and such. So, you really are using Amazon content ONLY! Roku does a better job in terms of Apps supported. It has far too many.Pros:• Looks and feels solid. Does not feel like those plastic boxes• ScreensaverBottom line: This is NOT a full-fledged streaming device. If you are new to Internet streaming  , you will just be fine with this box.", "verified": true, "helpfulness": "1/8", "author": "Tingru Tangu"}, {"rating": 3.0, "review": "compared to the roku it doesn't have nearly enough options. If you haven't been exposed to roku then you will like fire tv if you have the roku you will be a little disappointed in fire tv, but I am going to keep my fire tv b/c I know amazon and it will only get better!!!!", "verified": true, "helpfulness": "2/3", "author": "kassie"}, {"rating": 5.0, "review": "It is a great product. it is very easy to use and set up. I love the remote, it is very cool.", "verified": true, "helpfulness": "1/1", "author": "manny shahidi"}, {"rating": 5.0, "review": "As a prime member I can't think of a better way to get my content onto my tv.  The addition of HBOtogo, netflix and Hulu plus makes this almost completely capable of replacing my cable.  The games included through amazon are just a bonus.  Maybe I'll stop buying xbox games too!", "verified": true, "helpfulness": "0/0", "author": "David Wallick"}, {"rating": 5.0, "review": "I have Apple TV but was intrigue by Amazon Fire. It was a great purchase and I highly recommend due to quality of the programming available, price of game apps (waiting on my game controller), ability to watch immediately without long downloads and overall well though out User Experience.Voice search is perfect so far. This shocked me how well voice search works.  The remote is intuitive and includes all functions I expect - much more so than the Apple TV.I really hope that Amazon does a better job with organizing Apps, videos, etc. more like the apple store - that is my only complaint.", "verified": true, "helpfulness": "1/1", "author": "Tammi Kay George"}, {"rating": 5.0, "review": "Its the perfect solution to the surprisingly ancient solution on most streaming sites.add thewords yourself, very stupid. jerks", "verified": true, "helpfulness": "1/4", "author": "CurtDeF"}, {"rating": 3.0, "review": "My wife wanted this for the voice search feature. Turns out the voice search only works on Amazon. If you're in Netflix, for example, and conduct a voice search, you're redirected to Amazon. However, it's a huge improvement for searching compared to the normal Amazon search function, which is poor. I haven't done any objective testing, but subjectively, the streaming function does seem to work better through this device than through the blu-ray players we've been using for streaming video: it seemed smoother and faster (based on the consistently high resolution stream).", "verified": true, "helpfulness": "1/2", "author": "Hermes Ten"}]