[{"rating": 2.0, "review": "Doesn't work with the latest firmware for the first generation AirPort Extreme.  Need to go back to an earlier version", "verified": true, "helpfulness": "1/2", "author": "Donovan A Langford"}, {"rating": 4.0, "review": "Overall I have to say that I am very pleased with product, even though it works consistenly only with Android tablet and phone and not the laptop. Other issue is the Netflix app for my Droid Bionic phone and Samsung galaxy tab 2 does not have the ability to cast yet, they say it will be corrected soon. So my experience is only based on using Youtube.The installation was supposed to be easy but it took me three tries, there is not much help in the google site either. Ensure both Chromecast dongle and the Laptop/Hone/Tablet are on the same wifi and this can make installation smooth.Once connected, watching Youtube video's is a breeze, all you need to do is download the chromecast app to the phone/tablet and this will ensure that youtube app will have a button to cast the video. So basically select the video on phone/tab then press the cast icon, then you can start watching the video on the TV. After this you are basically free to use the phone/tablet to whatever you want...you can even shut the app down the video continues to play. The phone is basically used to pause/play. The quality and the speed of the streaming is pretty good. Will recommend this product for the price.", "verified": true, "helpfulness": "0/0", "author": "S. Vijay I.T Andrew"}, {"rating": 5.0, "review": "The Setup was easy and took less than 5 minutes.  Despite it's looks it still allows room for other hdmi connections.  I had a couple buffering moments but it wasn't on a major site like netflix or hulu and I am in the country with a 3 meg DSL connection.  All said and done this is easily worth $35", "verified": true, "helpfulness": "0/1", "author": "Brian Krafka"}, {"rating": 1.0, "review": "This device would not connect or work with either my computer or my Android smartphone.  The mechanical installation was easy enough.  I just plugged it into an HDMI port and powered it with the USB connection on my TV.  This device also came with a separate plug-in AC power supply that I could have used, but it would not have turned on and off with the TV.  Unfortunately, after spending more than an hour downloading software and an Android app, and making repeated attempts to connect the Chromecast to my Wi-Fi network, I was not successful.  If you already own a smart TV and/or a DVD player that has a built-in Web browser you should be able to do just about everything with them that this gadget is purported to do.Although I was disappointed that I could not make this device work in my home, Amazon allowed me to return it for credit.", "verified": true, "helpfulness": "6/16", "author": "Lewis A Edge Jr \"Happy Traveler\""}, {"rating": 5.0, "review": "Looks promising for the price and many friends have talked only well about it. Lets you connect your laptop, ipad, etc.. screen to the tv screen anywhere there is internet", "verified": true, "helpfulness": "0/1", "author": "Nickster"}, {"rating": 5.0, "review": "Works exactly the way it's been advertised. Plug it into the TV. Super easy setup without any problems. \"Cast\" netflix from my ipad to the device without any trouble.", "verified": true, "helpfulness": "0/1", "author": "Ronny F."}, {"rating": 5.0, "review": "Set up was easy and it works effortlessly. NOW!  Bring on the additional apps Google! Great gadget at a price that everyone can afford. Very happy with this purchase. Well done Google!", "verified": true, "helpfulness": "1/2", "author": "Ronh"}, {"rating": 1.0, "review": "I was real excited to finally get this...now that it won't work with my Verizon FIOS network not so excited....done everything they asked...now to get this thing to work I will need to spend the hours on the phone to get it setup.  Although I have to say I'm not confident it will ever work.Save the cash and frustration get yourself a big monitor and a wireless mouse and don't buy this beta product.", "verified": true, "helpfulness": "3/12", "author": "A Consumer"}, {"rating": 5.0, "review": "Look, there's already a bunch of reviews from professional geeks that will give people all the techy-savvy info.I love this thing because one reason.My wife can have something already playing on the TV while I embark on my mandatory \"1-hour\" search on Netflix for \"the perfect movie\".I'm a simple guy, I don't need this thing to revolutionize my life.  But I definitely take my sweet time when picking something on Netflix. So now with this thing, my wife can watch her favorite Ryan Gosling movie while I spend the next 60 to 90 minutes looking for the that documentary on jellyfishes that can juggle albino mole rats.And when it's time to switch to my movie, I don't have to get up, I don't have to unplug or replug anything, I don't even have to deal with two separate browser windows on a laptop, I just need my phone.No device or smart TV allowed me to do this for $35 in the past.People are already hacking and programming more functionality for this device.  I can only see the possibilities of this device growing.", "verified": true, "helpfulness": "0/0", "author": "P. Liu"}, {"rating": 5.0, "review": "What can you expect for $35?  Well, I'm impressed.  While I've only had it for a week, here is what I've found:- Setup is easy.  Only took a few minutes.  Just plugged the ChomeCast dongle into the TV's HDMI port and plugged-in it's power cord, then fired-up my laptop and it was working in less than 5 mins.  My home WiFi network (provided by an old Linksys router) was all that was needed to connect it to the network.- If you stream Netflix or YouTube, you can even turn off the laptop or tablet after the video begins.  Evidently, the ChromeCast dongle (plugged into the TV's HDMI port) gets the video directly from the network!  Very nice.  Of course you lose the remote control function of the laptop or tablet if you turn it off.  This is a great piece of engineering for $35.  While I've had a Netflix streaming subscription for something like a year, I've used it more in the past week than in the past year.- If you stream from the Chrome browser (using the new little button in the top right corner of the browser that the ChromeCast browser plug-in displays) then the laptop receives the media from the server and forwards it on to the ChomeCast dongle plugged into the TV's HDMI port.  This works well, and both the sound and picture come thru the TV.While I'd like to see Amazon media streaming enabled as per YouTube and Netflix, I'm very impressed at what this thing does, and for only $35.", "verified": true, "helpfulness": "2/3", "author": "J. Christensen \"Jim C\""}]