[{"rating": 5.0, "review": "I actually have not tried it but I will trust it to be great!", "verified": true, "helpfulness": "0/1", "author": "Kathryn Budd"}, {"rating": 5.0, "review": "Changed the way I consume content. TV much more streamlined with my online life.", "verified": true, "helpfulness": "0/0", "author": "Jonathon Mauser"}, {"rating": 5.0, "review": "Wasn't sure how much I was going to use this back when I ordered it, but it was cheap and I was curious. Turns out to have been a really good investment. I can stream from most video services one way or another, and it makes Youtube a lot more fun. One thing I wasn't expecting was its ability to turn my TV set on when I start casting to it. Nice bonus. Set up was easy enough - if you get stuck, just Google the problem and you'll almost certainly find the answer. The only glitch was its need to be within 15 feet of my cable company's wi-fi modem. TWC has since upgraded the modem so I suspect it would now work from twice that distance, at least.", "verified": true, "helpfulness": "0/0", "author": "W. Ivey"}, {"rating": 3.0, "review": "This product did not work properly out of the box for me. Kept getting the \"brain freeze\" error after about 10 minutes, then it would keep getting the error every minute or less after. It was overheating, bad. Plus, amazon videos won't officially stream through it (although some folks have been able to disable silverlight and use flash player in chrome browser as a work-around).My fix to the overheating was to void any kind of warranty, pop off the plastic cover, and wrap an old cheap thin metal chain-necklace around it many times as a makeshift passive heatsink. Lo and behold it works now.I've read forums reporting this brain-freeze error, and the customers sending it back and getting a new one without errors. All I can imagine is there must have been a bad batch?It works great when it is functioning properly (minus not streaming amazon easily).Also, google's store finally has an app that will stream local media on your harddrive straight to the chromecast, its called \"videostream for google chromecast\" and works great, easy to use....even streams mkv files! with subtitles!", "verified": true, "helpfulness": "0/0", "author": "Chibikabra"}, {"rating": 5.0, "review": "Excelente producto!", "verified": true, "helpfulness": "0/0", "author": "olizano"}, {"rating": 5.0, "review": "AMAZING little gadget.  Bought one for my daughter and one for a son-in-law.  Both LOVE it.  Easy to use and worked well for them.", "verified": true, "helpfulness": "0/0", "author": "J. Brown \"Willie\""}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "zuhair abdullah al adi"}, {"rating": 4.0, "review": "Amazing technology for the price. Crisp video transfer", "verified": true, "helpfulness": "0/0", "author": "arthefart \"Michael G\""}, {"rating": 5.0, "review": "If you can't afford a smart tv this is the answer and more.Ok so out of the box I was a bit disappointed. On a galaxy s3 it wasn`t great. A few apps later and its all singing all dancing. I doubt this will be great with Apple products but it works great on Androi, I would research it first.. I`m not going to write a long essay on how to get this to work, just do a bit of internet and app searching for chromecast compatible apps and you wont be disappointed.I can watch movies from my phone, not all formats are compatible but a lot are. I`m currently streaming Xmen to my tv in 1080p seamlessly as I write this. It took about 10 minutes to set up and I'm no genius.Google have packed a lot of technology in a powerful unit. I wanted a £500 Samsung smart tv but this was like giving my T.V steroids. Its also very transportable and can be used on any tv with a hdmi around the house.The only thing I cant get it to do very effectively on an S3 is screen mirroring.. It is available on the chromecast app for Galaxy S4 onwards and other phones ie Nexus and other top spec phones. Although I've not researched other phones thoroughly. I`m babbling now. £18 pounds paid in a Comet sale by my partner and the best xmas present I've had for years...", "verified": false, "helpfulness": "0/0", "author": "J. D. Rennie"}, {"rating": 4.0, "review": "Worth every dime... I think for its price and size its a great means of media.", "verified": true, "helpfulness": "0/0", "author": "Tina"}]