[{"rating": 5.0, "review": "Nice, this is a great device, now support my Note3 screen display, only drawback in some apps does not send audio to the TV when use Screen Cast. but it said it's betta, hope will fixed soon.", "verified": true, "helpfulness": "0/0", "author": "joefox"}, {"rating": 4.0, "review": "Very Usefull!", "verified": true, "helpfulness": "0/0", "author": "Winston \"wasp00\""}, {"rating": 5.0, "review": "Chromecast works exactly as advertised. High def video streamed right to your tv. I use it with my Nexus 7 & have not had any problems. I have 1 chromecast for the living room and 1 for the master bedroom. Easy set-up and operation. Well worth the money.", "verified": false, "helpfulness": "0/0", "author": "John Hagan"}, {"rating": 1.0, "review": "bad reception, hard to connect", "verified": true, "helpfulness": "0/2", "author": "foot3ch"}, {"rating": 3.0, "review": "I had some difficulty.  When you receive the dongle, you get instructions on how to plug it in. At that point you really have nothing.  What is missing is the booklet that tells you how to add it to your wireless system and what you do after that.  I should make it Very Clear that if you do not have a wireless system you are out of luck. ( Or, go spend $100.00 or more to get a wireless router and set it up.)  You now need to buy a booklet, offered by Amazon, that gives you the information that you should have received with the device!  That is another $7.00 to $10.00 expense. Once it works you have to decide which programing service you want to subscribe if you want the greatest variety of programs and movies.  How about chunking in another $8.00 to $35.00 per month.  Sure, there are free services, but how long are you going to be happy with that?  Is all this (and the frustration of setting it up) worth the effort and cost. Only you can decide.  If cable and satellite services keep raising there rates you may find that this is a money saver.", "verified": true, "helpfulness": "2/2", "author": "wagonmaster"}, {"rating": 5.0, "review": "Already had one, and wanted more for the rest of TV set at home and to carry.", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Rios"}, {"rating": 5.0, "review": "As describe", "verified": true, "helpfulness": "0/0", "author": "Eligio Ventura"}, {"rating": 5.0, "review": "does what it meant todo", "verified": true, "helpfulness": "0/0", "author": "Marcelo Rossi \"cheluskis\""}, {"rating": 5.0, "review": "Chromecast is awesome. Most video apps or websites will let you cast to the TV.I also use one at work for our Demo screen. I can cast my whole screen or a web page to run through demos for clients. Works great.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "Deal! Buy it!", "verified": true, "helpfulness": "0/0", "author": "Dan Boyce"}]