[{"rating": 5.0, "review": "HDGreat Picturedoesnt offer amazon instant videobut other than that it greati bought 3 for every room in the house and now i only pay 20 for netflix and hulu+  and other channels it offers so no need for cable", "verified": true, "helpfulness": "0/0", "author": "Emanuel Guerrero"}, {"rating": 4.0, "review": "The major players are willing to dis each other at the expense of their users. I hate that, I will say that the thing works great with netflix, but I'm studying up on a streaming media player for AMAZON PRIME.", "verified": true, "helpfulness": "1/1", "author": "Ed M \"Pops\""}, {"rating": 5.0, "review": "I don't know how we survived without this.  Yes, that's way dramatic, but I don't care.  No longer must I deal with simply watching things on a 17\" screen, oh no...it goes up on the big TV now.  Yes, my Smart TV already has a Netflix app and a YouTube app, but this is exponentially faster.  Being able to cast something up from the phone, the tablet, the computer, is just awesome.We've put Chromecasts in three rooms, so now when I'm on the computer, and I want to show my wife something, she just has to turn on the TV and I can send it right over.  No more of this tedious walking across the room business....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It does what I want and then some.  Only thing I am concerned about is that the item gets really hot plugged in all times.  So time to time I unplug to make sure it's doesn't damage things with TV or something else.", "verified": true, "helpfulness": "0/0", "author": "Byung Petersen"}, {"rating": 1.0, "review": "looking at some of the picture for this product I thought it allows phone mirroring like apple tv box. I tested it and I could not figure out how to phone mirror. I took back to store and rep who had told me he loves this and use this for some time told me it lack that. It does not allow you to phone mirror.you can not stream any thing from chrome on your android device. Rep told me I can stream from chrome on computer but no it is not streaming from chrome browser of any android device.it has very few app registered. like youtube, Hulu, netflix which I already have on my tv.I guess you get what you pay for....Just cheap product of no use.", "verified": false, "helpfulness": "0/0", "author": "C. Shah \"Nokia Lover\""}, {"rating": 1.0, "review": "This was a complete disappointment. I bought this because Google advertised this as a unit that could broadcast baseball games from your computer to your TV. I hooked the unit up and to my TV. Then I opened up my subscription to MLB (Major League Baseball) waited for my favorite team to start the game. I proceeded to get MLB going on my TV, when I tried to get the actual game stared it would not access the live action. I tried every way to get it from the menu, but each time I clicked on to the action it would jump away. Then I put a request in to the Google browser, \"How do I get  the games on MLB from my Google Chromecast\" Then I arrived at a  page where everyone was complaining about the same issue not being able to access baseball from the Chromecast unit. I am returning mine to Amazon today!", "verified": true, "helpfulness": "1/1", "author": "Seymour Blau"}, {"rating": 5.0, "review": "a good deal for its cost, I highly recommend it as an alternative to Roku or for those who wish to enjoy media on a larger screen.", "verified": true, "helpfulness": "0/0", "author": "LutherCorp"}, {"rating": 1.0, "review": "More trouble than it's worth!  Took five attempts just to get it set up, then it started crashing my entire home network.  Now that I've finally got it \"working\" the vids drop & freeze constantly.  Aweful…I'll just run a long HDMI cord from my laptop to my TV!", "verified": false, "helpfulness": "1/2", "author": "O.P.T. \"O.P.T.\""}, {"rating": 1.0, "review": "I choose this on the advice of my daughter and son who has used this item for approx 6 months.I have a Kindle Fire and I can not get it to work.I down loaded the app and had my daughter try to get it to work over 2 weekends and NO LUCK !!VERY DISSAPOINTED !!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "verified": true, "helpfulness": "1/1", "author": "Sandy & Jarry Hails"}, {"rating": 5.0, "review": "One of the best electronics purchases ever! The ability to just plug this thing in and be able to watch Netflix/Youtube while using my phone as a remote control is almost magical, and this is coming from a tech guy. Mirroring almost any tab from Chrome is also a really neat feature if you want to watch a video from a website that is not supported natively by ChromeCast, such as Amazon or Vimeo.I wish more applications supported ChromeCast but hopefully the situation will continue improving in the future. Still for $35 I would give this product 6 stars if I could.", "verified": true, "helpfulness": "0/0", "author": "Mike K"}]