[{"rating": 5.0, "review": "If you have Amazon Prime, you must have this amazon Fire TV...absolutely would not do without after experiencing the ease and control Amazon has put into this player.", "verified": true, "helpfulness": "1/1", "author": "Tom"}, {"rating": 4.0, "review": "I like the system.  It is nice that my son can play a game.  I took off the parental controls because it became very annoying how many times you had to enter the code.  When I bought a movie, my son could see the code on the screen.  Now, I noticed that there was a purchase that I didn't know about.  It can easily be bought.  Now I have the controls back on.  I am out $6.99 that I didn't want.I like the movies but have a few buffering issues with movies.", "verified": true, "helpfulness": "0/1", "author": "Leeann Moore"}, {"rating": 5.0, "review": "I was trying to figure out if I wanted to go to another Apple TV or the Amazon Fire TV.  I like the voice search, which Apple doesn't have.  Since I'm an Amazon Prime member and watch a lot of video from Amazon, and Apple doesn't support that, I chose this one.  I haven't even really touched on the functionality of it, but am very pleased.", "verified": true, "helpfulness": "2/2", "author": "Name withheld because stalkers Google me and I find it annoying"}, {"rating": 2.0, "review": "I've bought Amazon Fire TV so I can mostly use it with my Netflix subscription.I'm using Netflix with my iPads and Computers and the streaming quality is good (even when I force standard resolution).But on the Amazon Fire TV the picture is pixelated on the 55 inch TV ;(But Amazon Prime content quality is really good.My conclusion - Netflix App on Amazon Fire TV sucks (The App implementation on Amazon Fire TV specifically).Amazon should work with Netflix to make it work properly to make it a great product!", "verified": true, "helpfulness": "3/5", "author": "Leo"}, {"rating": 5.0, "review": "This device is great.  It's perfect for someone with Prime.  We've watched a lot of  Prime Movies and shows since we've gotten it.  It's really fast.  It doesn't lag like other devices we tried.  We love the device.  My husband added Spark to FireTV.  He read about it on FireTV news and then loaded  Spark have apps for Mac & Windows that allow you to mirror your desktop.  Love it. Keep up the good work!", "verified": true, "helpfulness": "1/1", "author": "lyl"}, {"rating": 5.0, "review": "I love this product! The minute I got it and plugged it in my apple tv has become just a dust collector and paper weight. This is way better and because I'm a prime member it's a definitely plus. I love my shows and the movies provided. I also use my kindle for books. I'm 100% for amazon products and services. Works better than apple tv and has a better selection than netflix for sure. The setup up is easy and works much faster streaming.", "verified": true, "helpfulness": "1/1", "author": "L. Mendez"}, {"rating": 1.0, "review": "The device gets the job done: you can watch Netflix and Amazon video, but the layout and interface are extremely uninspired and can be difficult/confusing to use.Originally I wasn't going to leave a product review because I liked the device just fine, but there is a HUGE flaw with it. I had my device connected via wireless in my living room, and I recently got a new network router. When trying to connect it to the new home network, it is IMPOSSIBLE. When I go into network settings, it asks me for the parent controls pin. I enter the pin, and it brings me back to the pin screen saying that it needs an internet connection to verify it. So in order to change my network settings, I need to be connected to a network to begin with? Who thought that this was a good idea? I understand that the pin authentication is probably done through the internet, but seriously? I can't even reset to factory defaults to attempt to change my network settings that way because of the pin issue.", "verified": true, "helpfulness": "6/11", "author": "Richard Krause"}, {"rating": 5.0, "review": "Like it, great for the money, Amazon has lots of videos, better than satalite TV, More to be able to watch", "verified": true, "helpfulness": "1/1", "author": "tomh"}, {"rating": 5.0, "review": "The Amazon Fire TV is very easy to use and very affordable. I was able to link my Iphone to the Amazon Fire and play certain videos from my phone on my tv. I am not a tech person and I found the Fire tv device easy to use. I did read the directions from the Amazon site on my computer after I got it hooked up. Makes watching movies and Youtube simple.", "verified": true, "helpfulness": "2/2", "author": "KBowman \"jglford\""}, {"rating": 5.0, "review": "I was leery of another set top streaming box having trying several other brands but gave Amazon Fire TV a chance! OMG I should have bought this when it first came out!Set up is a breeze for the TV Fire box.The remote control access was a bit funky as there was no illustrative description in the box but the video on the Amazon page made it clear.I streamed a Prime movie. No glitches, no dropped signal. Easy to stop, pause and replay. So much better than than my streaming attempts in the past without an Amazon box.The feature that blew me away was how fast I could set up the Amazon photo streaming app on my iPad Air and even more amazing was how fast hundreds of my photos got loaded into the cloud and played on my big screen smart TV!I can't wait for the surprise on my sons face when he tries playing games. I got the optional game controller and HDMI cable.The icing in the cake is the monthly installment plan Amazon offered with the dealFinally, a streaming box even I could set up, wow!Thanks Amazon for making this so easy to get up and going on my TV!If you were thinking about getting this, don't hesitate like me!", "verified": true, "helpfulness": "1/1", "author": "FD Firefighter 121 \"Remember the 343\""}]