[{"rating": 5.0, "review": "Great product I love watching movies on my showbox app and sending it to my TV", "verified": true, "helpfulness": "0/0", "author": "Isaac osazee"}, {"rating": 4.0, "review": "Chromecast worked for me at my house but when I took it to my friends house to stream to her TV from my iPad I couldn't get it to recognize her wifi.  Oh well.  I will use it at my house on a TV where I don't have Roku or YouTube.  Good price.  I would also consider the Fire Stick from Amazon.  I might get that one too just in case it works at her house.  Not a big investment.", "verified": true, "helpfulness": "0/0", "author": "Gardendea \"czechcollector\""}, {"rating": 4.0, "review": "I absolutely love Chromecast. My favorite thing to use it for is streaming Amazon instant videos. YouTube integration is okay, not excellent. The Chromecast app itself needs updating to be more appealing. Overall good product", "verified": true, "helpfulness": "0/0", "author": "wesley"}, {"rating": 4.0, "review": "Bought it 2 years ago and still satisfied", "verified": true, "helpfulness": "0/0", "author": "Mac D"}, {"rating": 5.0, "review": "I love Google Chromecast!  I had been watching lots of movies at my friends house and love the convenience of being able to watch newer movies and any other programs I want.  I finally had to get one for me and my girlfriend for our house.  Connection is great and now me and my girl can stay at home instead of going out so often.  We pop some popcorn and snuggle up in bed having date nights at home.  We pick new movies never having to fight over what to watch with so many selections its easy to find something we both can agree on.  Great product!", "verified": true, "helpfulness": "1/1", "author": "5 Stars all day, Review Master!"}, {"rating": 1.0, "review": "Not compatible with the modem/router combo that Comcast Xfinity ships with. Cisco DPC 3939. Would have been great to know this before spending 2 hours trying to get it working.", "verified": true, "helpfulness": "0/1", "author": "E. Olsen \"Calloused thumbs\""}, {"rating": 5.0, "review": "Nice product", "verified": true, "helpfulness": "0/0", "author": "david teasdale"}, {"rating": 1.0, "review": "bought one and discovered it wouldn't work on my equipment.  The propoganda  conceals these restrictions and limitations.  Read the fine print twice, this is a ripoff operation in my opinion and now a pain in the neck to send back.", "verified": true, "helpfulness": "0/0", "author": "dennis stampe"}, {"rating": 5.0, "review": "very good... just very good", "verified": true, "helpfulness": "0/0", "author": "michael lin"}, {"rating": 5.0, "review": "Works great with my Galaxy devices", "verified": true, "helpfulness": "0/0", "author": "Darien"}]