[{"rating": 3.0, "review": "It's a good start and I love the seamless integration with my prime account but the lack of apps and even fewer channels offered makes it clear that Amazon has a long way to go to make themselves stand out in this field. I'm excited for updates to come along.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is exactly what I have been waiting for! Amazon Fire TV is the best! And my kid loves it too!", "verified": true, "helpfulness": "0/0", "author": "Sergio Ochoa"}, {"rating": 1.0, "review": "The first Amazon Fire TV I purchased worked for about a week.  Its deterioration was incremental until finally it didn't respond to button presses at all.  I sent it back, as requested, and was sent a replacement.  This one worked well for almost a month.  Yesterday it started giving me an error message whenever I tried to stream a video.  It gave me a message that I needed to contact customer support.  Now I can no longer watch videos at all.  I emailed customer support, and they responded with an email full of rainbows and unicorns.  The upshot was that tech support will work to resolve my problem and get back to me.  If I've received two problematic units, there's no way that this can't be happening on a large scale.  Buyer beware!", "verified": true, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I just love !!!  my Amazon Fire T.V. I am a prime member and have taken advantage of all the free shows and movies available that I can watch. It is so easy to navigate the menu to find just what you are looking for. Also having a remote you just talk into couldn't be easier.  I also purchased an amazon gift card to have on hand to use when I find a show that isn't free with my prime membership. Believe me you will not be Disapointed.", "verified": true, "helpfulness": "0/1", "author": "Lori L. Stabile \"Lori S.\""}, {"rating": 4.0, "review": "This is the first streaming system I have owned. It works, that's all that can be really said. It has Netflix, Hulu, Amazon Prime and other videos and movies you can purchase. The box and remote seem to be of great quality, very sturdy, sleek and modern design. Most of these bad reviews on the product is from peoples unwillingness to have any imagination on how things work. Its a very straight forward system, it prompts you if something has errors and tells you how to fix it. People saying it doesn't turn off, well if they read the information book on it before assuming things, they would have found that it turns off by itself after 30 minutes of inactivity. Come on people, read your information and know how something works before you publicly bash it.", "verified": true, "helpfulness": "0/0", "author": "Riley Smith"}, {"rating": 5.0, "review": "Amazon Fire TV is an amazing device that rivals or beats Apple TV. I've got multiple Apple devices and Apple TV's but also a member of Amazon Prime. I could only get the great Amazon Prime original programming and other tv shows through a smart tv at a weekend home. Apps and Kindle Fire HD brought me programming but I was looking for something to view Netflix AND Amazon Prime and Hulu Plus from the same device. I'm trying to cut cable bill so I gave Amazon Fire TV a try and it is great. Still have Apple TV on another tv, but Amazon Fire Tv gives me more options for tv viewing that I want from one device. It's a winner!", "verified": true, "helpfulness": "0/0", "author": "Mike Sizemore"}, {"rating": 5.0, "review": "I'm still getting used to it, and I'm sure that there's much more I can \"do\" with the device, but for what I've done, I love it.  Easy to install (even for this senior citizen), easy to use.  Make a mistake, and it's forgiving. Not much you can do wrong! Once I use it more, it will compile a 'recommended' list which matches my interests.  Browsing for now does just fine.  I've seen documentaries and movies I've wanted to see but missed at the theater.  Now I will have to pry myself off the couch to get to my favorite rivers!", "verified": true, "helpfulness": "0/0", "author": "river rafter"}, {"rating": 5.0, "review": "Combined with our Amazon Prime membership we have become dedicated tv viewers in a short time. Amazon Fire Tv is an excellent device, and well worth the investment.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 1.0, "review": "Nome of the the shows or movies work even after a hard hard reset of of the firebox.  Cannot find support.", "verified": true, "helpfulness": "3/6", "author": "Laurent Chemla"}, {"rating": 5.0, "review": "Bought for my mother for her B-day. She loves it. But she did have to increase her internet speed so she could watch her movies without them stalling out", "verified": true, "helpfulness": "2/3", "author": "JP"}]