[{"rating": 3.0, "review": "Disconnect from internet too often!", "verified": true, "helpfulness": "1/1", "author": "Glue Stick"}, {"rating": 5.0, "review": "Can't go wrong with the Chromecast.  We usually use it for Netflix or YouTube, but recently I got Plex and have been watching local content.  Also using Showbox (not officially supported) and Avia I don't even have to DL stuff to watch locally.  Easy to use, easy to set up, never crashes.  New apps are added every month or so, so this thing is just going to keep getting better.", "verified": true, "helpfulness": "0/0", "author": "Timothy"}, {"rating": 4.0, "review": "Works very well on supported apps, but the number of apps that is supported is still limited. I prefer this over my Apple TV because it doesn't have the constant painful update issues that I struggle with on the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Jens Gramschap"}, {"rating": 5.0, "review": "I connected this to my Vizio TV in my living room and it just works. At the price, you cannot beat what it offers. I will be watch YouTube videos on it all the time streamed from my Google Nexus 10 tablet or my Motorola Razr M phone or my Dell laptop. I also cast Pandora to it from all the above devices. I have even cast my local video files (.mp4 format) from my laptop to the TV via Chrome.", "verified": true, "helpfulness": "0/0", "author": "champion_hunter"}, {"rating": 5.0, "review": "Prefect for myself n family. Use it every day", "verified": true, "helpfulness": "0/0", "author": "Christina Ford"}, {"rating": 5.0, "review": "Works very well.", "verified": false, "helpfulness": "0/0", "author": "Willy Arnaez Serrano \"WAS\""}, {"rating": 5.0, "review": "excelente", "verified": true, "helpfulness": "0/0", "author": "samuel jose alzate duque"}, {"rating": 5.0, "review": "Good", "verified": false, "helpfulness": "0/0", "author": "tom"}, {"rating": 2.0, "review": "hope upgrade software supports more than Youtube and Netfix", "verified": true, "helpfulness": "0/0", "author": "M. Rao \"raolin\""}, {"rating": 5.0, "review": "Works awesome, control your TV watching MLB, Netflix or Youtube right from your table or phone.  You can also share you browser window which is a little glitchy and not as nice as the built in app support.  This thing puts the smart in your TV!", "verified": true, "helpfulness": "0/0", "author": "Matthew P Rausch"}]