[{"rating": 5.0, "review": "I loved the product. There was a very big problem though. Dish satellite is to slow and continually buffed or buffered. I had to send the product back but have seriously been considering giving up Dish satellite and going to something else. If I do change, I will order Fire TV again.", "verified": true, "helpfulness": "0/0", "author": "Danny W"}, {"rating": 4.0, "review": "Love it! I came from an Apple TV; the Fire TV is hands-down, better. I am giving it 4 stars because I would like to see the voice search work throughout all the apps instead of just from the amazon offerings.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Great interface.  Voice recognition is excellent. Picture quality is great.", "verified": true, "helpfulness": "0/0", "author": "Paul Chamberlain."}, {"rating": 5.0, "review": "Excellent product!! Simple to set up and navigate.", "verified": true, "helpfulness": "0/0", "author": "cj"}, {"rating": 3.0, "review": "I would have rated it higher if it had come with an HDMI cable included.  Seems a little cheap to make the customer go out and buy this simple but necessary accessory.", "verified": true, "helpfulness": "0/1", "author": "Mike Wilson"}, {"rating": 5.0, "review": "I bought this Fire TV  for streaming YUPPTV. But, YUPPTV is just one of the hundreds of Apps provided by Fire TV", "verified": true, "helpfulness": "0/0", "author": "Venkata Gudladona"}, {"rating": 5.0, "review": "Great content", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best thing we have ever purchased thanks Santa", "verified": true, "helpfulness": "0/1", "author": "Susan Klockow"}, {"rating": 4.0, "review": "Easy to setup and use. I have already enjoyed some really great movies.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Very easy to use. Does everything it's supposed to.", "verified": true, "helpfulness": "0/0", "author": "venus parton"}]