[{"rating": 4.0, "review": "Easy to use and easy to install.  The services offered are limited but I am sure there will be more in the future.  And the price was right!!", "verified": true, "helpfulness": "0/0", "author": "Snowbird"}, {"rating": 5.0, "review": "This thing is miraculous.  I can't even believe this tiny little thing streams from Wi-Fi, has onboard memory, and renders video in stunning, flawless 1080p, and is so darned cheap.A great alternative to streaming through the PS3, which had a super-noisy fan.  This thing is quiet as a mouse.", "verified": false, "helpfulness": "0/0", "author": "Donald A. Pflaster \"Don\""}, {"rating": 5.0, "review": "It's really changed the way we watch TV. If I had more than one TV with HDMI (which I don't), I'd have one in each room. I've never had cable, but now I can actually watch streaming videos easier than even through my Bluray player or Wii! Well worth $35!", "verified": true, "helpfulness": "0/0", "author": "TiredinPittsburgh"}, {"rating": 5.0, "review": "This thing is awesome.  I only wish Google had a way for you to stream music you play on your phone but then I guess that would be in direct competition with the Apple TV device.  I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Ken Oliver"}, {"rating": 1.0, "review": "We have great wireless signal throughout our house and Netflix etc. work great through our blu-ray and smart TV.  With this the the picture stutters or goes black and leaves audio only.", "verified": true, "helpfulness": "3/5", "author": "J. Montgomery \"modest_expectations\""}, {"rating": 5.0, "review": "This little thing is amazing!  The picture quality is great and I love how it really does work differently than  other things like this.  You can go on You Tube on your phone and once you start a video, you don't have to leave your phone on or leave your phone on the video playing on the chromecast. You only use your phone or computer to get it started and then your device is free to go on to something else.  I had a wireless HDMI sender, that I have sold because this lets me do the same thing so effortlessly.", "verified": true, "helpfulness": "0/0", "author": "Steven Pendleton"}, {"rating": 4.0, "review": "If you plan to use this device using a VPN connection while outside of the USA, it will not work.  I am presently in Morocco, North Africa, and have to use a VPN to stream Netflix, Hulu and Amazon Instant Videos.  The device installs very easily, and were it to work for me, it would have been a delight.  However, because I am using a VPN, it will not work.  I contacted Google Chromecast support and was immediately told that they do not support its use overseas,  No attempt was made to try to solve the problem.  It will work abroad IF you can connect to Netflix, Hulu et al through your regular internet connection, but unfortunately for me, none of the mentioned providers work in Morocco.  I have noted that Netflix serves the entire American continent and part of Europe, but not where I am, so I had to return the device to Amazon.  Having said all that, I think it is an excellent item for those who can use it", "verified": true, "helpfulness": "1/1", "author": "Dantes"}, {"rating": 2.0, "review": "You need to have good internet connection or there will be delays between the vedio and audio. Vedio quality is not that great often times.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "It works really well streaming from my Chromium browser in Ubuntu on my laptop and from Youtube, Netflix, and Hulu apps on my android phone and an iPad. My computer/phone/iPad sometimes can't find the Chromecast, but it always works eventually if I restart my computer/phone/iPad. It doesn't work at all with Amazon Kindles or with Amazon instant streaming apps on the iPad. The video and sound quality is very good. It's a bit redundant if you already have a smart TV, Apple TV, smart blu-ray player, Roku, X-box, or other devices that let you stream video to your TV. Being able to stream from a Chrome or Chromium browser is the main feature that the the other devices lack, which is cool but not really essential. It is also cheaper than other video streaming devices, so it is an amazing deal if you don't own one already.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I barely use this...but nice to have to stream from PC laptops....I am a mac based house and its redundant of my Apple TV's", "verified": true, "helpfulness": "0/1", "author": "Steve Antenucci"}]