[{"rating": 5.0, "review": "and, it's a no brainer for simple streaming.  I bought directly from google when it was initially announced, and it worked right out of the box.  I find it more useful for local content stored such as home videos:  To access files hosted on the computer and play them on a Chromecast-enabled TV, a Chrome user simply needs to access their file directory by hitting Ctrl+O (or Command+O on a Mac) and select the desired video file. Voila! Playback., but youtube is just as easy.  For Netflix, get yourself a current gen device (bluray, receiver, etc.) that supports Super HD (for netflix) and you'll be much happier.  The beauty of this little device resides in it's quick streaming function from a tablet or phone, and if you happen to be on your laptop.  Trying to use it as an external monitor for browsing leaves a lot to be desired, so don't plan on that.  Roku is great, but much more expensive..", "verified": false, "helpfulness": "1/1", "author": "R. B. Rivers \"Teamrivers\""}, {"rating": 5.0, "review": "This actually plays Netflix from my iPad better than my wired-to-Sony-TV connection. Can't say if my network connection is bad in some way or not. Seems to work fine otherwise.", "verified": true, "helpfulness": "0/0", "author": "Max B. Sawicky \"Max B. Sawicky\""}, {"rating": 5.0, "review": "It was the first time a electronic device set us quick and easy for me.  I HOPE WE CA WATCH OUR PRIME VIDEOS WITH IT SOON.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 3.0, "review": "Via google chrome browser on a mobile device don't buy this! It does not work that way although no one ever tells you this!", "verified": true, "helpfulness": "0/0", "author": "donaldo \"dsimas\""}, {"rating": 5.0, "review": "Love this thing.  Use it to consume content from my Nexus 7 using Netflix and other applications.  I am glad to see that Google is continuing to develop this product and am excited to see what is next.  I would highly recommend this to anyone interested in managing content from their mobile device.  I have seen no issues with streaming over our wireless.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "IT IS WHAT THEY SAY IT DOES,, PLUS MORE MORE MORE...... WORK'S WITH EVERYTHING, IT SAY'S...YOUTUBE IS THE BEST WITH PRODUCT........", "verified": true, "helpfulness": "0/0", "author": "enrique gonzalez"}, {"rating": 4.0, "review": "This is a great concept and good product.  It looses connection with the phone/internet every once in a while.  I love being able to put something on for my son and still have access to my phone.  This opens up to a lot more movie possibilities and is WAY better than watching Netflix via the WII.", "verified": true, "helpfulness": "0/0", "author": "J's Mom"}, {"rating": 3.0, "review": "With the price of $35, it is ok.The best thing about chromecast is all about youtube, casting youtube is extremely good.Other than that,- casting a tab on chrome browser is too slow.- still cannot cast the whole screenneed to use other casting application like AllCastI hope there will be more apps coming.", "verified": true, "helpfulness": "0/0", "author": "Nguyen Hien Lam"}, {"rating": 4.0, "review": "I like this product for it portability, it is easy to use. The kids move it from room to room and are able to connect themselves without issues.", "verified": true, "helpfulness": "0/0", "author": "Bobbie R."}, {"rating": 5.0, "review": "Make any TV a smart TV.  I have cut the cord and the cromecast has made it easy to stream video from various sources.  Easy to install and setup.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}]