[{"rating": 4.0, "review": "Works great, but I had difficult with the setup on the computer. Had to do the initial setup on the Iphone in the end. Windows 7 would not connect till I set up on the Iphone. I also had to connect to Chromecast WiFi first to get it to setup and connect with the program. Instructions don't tell you that. In the end once programmed and set up it worked fine.", "verified": true, "helpfulness": "0/0", "author": "Kevin S"}, {"rating": 1.0, "review": "Never been able to get it to work. I have a netgear router  that is not custom configured st all. Have called Google support, they tell me to call netgear which has no idea what to do to make it work. Plus it now it does less than my ps3. Not needed.", "verified": false, "helpfulness": "0/0", "author": "Matt Sample \"ST-PCs\""}, {"rating": 5.0, "review": "The installation instructions were a little confusing, and it took more effort to get it working than it should.  Just be aware that the Google Chrome extension is a critical component that must be on your computer or tablet. Once it was installed with the necessary software, we are able to download Netflix movies and TV shows on an iPad and watch them on our big screen TV.  Very happy with the product and the price is reasonable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Chromecast does what it says it does. I wish it did more, but it accomplishes exactly what it claims on their website. I'm getting of XBOX live in favor of casting Netflix to my Chromecast. I cannot wait for more development.", "verified": true, "helpfulness": "0/0", "author": "Rob Morton"}, {"rating": 3.0, "review": "Although it works well with google chrome and other google apps, it doesn't work at all with apps such as windows media player that come up as an embedded app in chrome.  The picture is good and the installation is easy.  Just make sure that you know what you're going to use it for", "verified": true, "helpfulness": "0/0", "author": "mab7828"}, {"rating": 4.0, "review": "Is doing what it should. But not all apps supported. Like chrome browsing from tablet on tv. Would be great", "verified": true, "helpfulness": "0/0", "author": "Antonio Licata"}, {"rating": 5.0, "review": "Leave it connected to our TV all the time. We'll worth the modest price. Thinking about buying another one for my office TV.", "verified": true, "helpfulness": "0/0", "author": "Richard C Harris Jr"}, {"rating": 5.0, "review": "Ordered it within minutes of launch.Pros: SleeknessUSB PoweredCons: Not many apps supported.Update: Netflix and Pandora have joined ChromeCast appEven without apps, love the YouTube screencast functionality. Totally worth $35", "verified": true, "helpfulness": "1/1", "author": "NameLess"}, {"rating": 5.0, "review": "Incredibly easy to set up - We LOVE our Chromecast!! After a year with a Belkin Screencast that ALWAYS had problems (and NO customer service), we couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "L. Robertson"}, {"rating": 5.0, "review": "I bought this product the instant Google announced that it was available. I already have an Xbox and a Playstation 3, so I'm already able to easily watch Netflix on my tv, but this product is still extremely useful!! When I'm hanging out with friends at home and a youtube video comes up in conversation, it's so easy to turn on my laptop, open up youtube, and throw it onto my tv using the Chromecast. It works just as seamlessly with my phone and my tablet!The streaming through the Chrome browser is what interested me most about this product -- it's still a little laggy and sometimes the audio and video are off, but it works 75-80% of the time. I'm sure this is something that Google will improve with software updates though, and they already have in the short time since this product became available!Set up is pretty quick -- it did have some trouble finding the network a few times, but eventually I got it to work, and there were step by step instructions along the way. All in all, this is already a great product, with even greater potential!! Everyone out there who doesn't have a Roku or Xbox or Smart TV should definitely buy this -- especially when it comes at such a great price!", "verified": true, "helpfulness": "0/0", "author": "Arjun Aggarwal"}]