[{"rating": 5.0, "review": "This is the simplest solution to getting Netflix on your TV. No remote, no box, no hassle. Just plug it in, set it up, and use your phone, tablet, or computer as a remote.", "verified": true, "helpfulness": "0/0", "author": "Diossley R."}, {"rating": 5.0, "review": "This product tooked time for coming but  and soon I setup very easy and Im enjoy now for see internet. I loved", "verified": true, "helpfulness": "0/1", "author": "Eduardo L. Rincon \"Happy buyer\""}, {"rating": 5.0, "review": "Being able to use this gadget on pretty much anything with a HDMI from my computer or android device, It has pretty much replaced my cable TV.  I love the computer version better because you can use it on tons more stuff but the android keeps getting updated and better.TO MAKE THINGS CLEARIt requires you plug it into a usb or plug for power.From android you have only a handful of apps available right now.If you do it from a computer it's through a extension in Chrome, so anything inside a browser can be streamed.I am running it over a wireless-N network with no issuesIf they added a screen function to android, I would get rid of my cable boxes haha", "verified": true, "helpfulness": "0/0", "author": "C. Behrends \"New Age Geek\""}, {"rating": 5.0, "review": "setting this up was so easy. Works great. Using youtube and netflix is super fun and easy.doing the cast from chrome takes care of pretty much everything else.great device for everyone.", "verified": true, "helpfulness": "0/0", "author": "agnelo dcosta"}, {"rating": 3.0, "review": "I got this item so that my wife could watch some of streaming videos of shows posted by the network web sites. The intent was to cast from the browser tab. It is very laggy when you try this though. It is fine with youtube because the content is not being served by your computer but rather from the origin server. Tab casting basically mirrors the tab and you need 1) a fast machine and 2) a fast WiFi connection. My wife's laptop is not that slow, an Intel i5 CPU but I need to connect it to the 100Gb ethernet and that helps a little. The Google docs do warn about these limitations but I hope this will improve at some point because it is pretty useless at the moment for browser tab casting.", "verified": true, "helpfulness": "0/0", "author": "Luciano Chavez"}, {"rating": 1.0, "review": "Tried very hard to stream local video files Google tech support must havethought I was having a problem with Chrome NOT Chromecast andlisted files that coud open needless to say they were useless After dloadFile app it still would not work on wmv mov files. Finally tried it with theBeta version of the screen cast and it did Work, Quite frankly I am amazedat the Poor support google has for it's products. HAd to return 2 chromecasts", "verified": true, "helpfulness": "0/0", "author": "Edward Miller \"The Ed Council\""}, {"rating": 5.0, "review": "Cheap, setup is a few easy steps.  I'm not completely sure it's going to change the world, or even my living room, but for the price this gives you some nice wireless options for sharing the things on your small screens when you gather around the large screen with the people you care about.", "verified": true, "helpfulness": "0/0", "author": "Brick Pollitt"}, {"rating": 3.0, "review": "It's an interesting device for sure, but if you have a smart TV already it offers nothing for you. If you don't it only adds Netflix, YouTube, Hulu, and Google TV/Movies to your TV and you have to control it all with a smartphone. That means there is a TON of lag...hit pause on your phone and it takes a second or two before it pauses. Doesn't sound bad but really annoying.It's also crashed netflix on my phone (Galaxy S3) a lot since it added the ChromeCast update to Netflix (yes, it uses your existing apps, just updates them).The price is right and it's nice and tiny so fits behind a wall mounted flat screen nicely but I'd suggest a Roku instead.", "verified": true, "helpfulness": "0/0", "author": "Matt Anderson"}, {"rating": 1.0, "review": "C'mon guys.... really.Plug and Play my _ss!  They're calling for registry edits and and code level modifications to get it to be recognized.Very disappointed in Google for this not ready for prime time gadget. I guess they're too busy spying on everyone!", "verified": true, "helpfulness": "1/3", "author": "Coach"}, {"rating": 5.0, "review": "This is a great device! Easy to setup and easy to use! So easy in fact that I can move it around the apartment, from TV to TV, without any difficulty. Right now it's limited to Netflix and what you get from Google Play store but apps for Hulu and HBOGo (and more) are in the works.Also, you can mirror your Chrome browser through it - so anything you can play in Chrome, you can play on your TV. Sometimes there are glitches (for us, Amazon Prime doesn't play sound) but for the most part, this works like a charm!", "verified": true, "helpfulness": "0/0", "author": "ZenLikeMe"}]