[{"rating": 2.0, "review": "would have been ok if it had a remote.  I dont mind using my computer as a remote but then if i shut down my computer i also shut off this device.  Wish you could just use remote and routte it directly to tv rather than via phone/computer.  Also wish it supported hulu - all it was good for was netflix.  We now use a dvd player that has wifi and it works better and doesn't freeze up like chromecaast did", "verified": true, "helpfulness": "1/1", "author": "julia"}, {"rating": 5.0, "review": "What a great device!  We are using it to try to cut the ties to Cable, as there never seems to be anything on despite the fact that we have 1000 channels!", "verified": true, "helpfulness": "0/0", "author": "Diane Smith"}, {"rating": 5.0, "review": "I bought one at BestBuy July 25 when they were first available. It installed easily on my Panasonic TV using my Samsung Galaxy tablet and has worked flawlessly for 2 ½ months now. My AT&T; Wi-Fi internet service has never been a problem. There are 2 things I particularly like about my Chromecast:1. It streams Netflix without pauses. My WDTV Live box and the app built into my TV often pause to rebuffer. The Chromecast has never had a hiccup.2. The Android app for Netflix on my tablet has a feature that I haven't seen on other Netflix apps: it has a slider at the bottom of the screen to tell where you are in a video and you can move it left or right to instantly go forward or back in the video. There is no hesitation like when using the fast forward or rewind buttons on a remote control.One thing should be emphasized: you must have Wi-Fi (wireless internet) for Chromecast to work. It does not have an Ethernet port for an internet connection. And you must be able to find your Wi-Fi password. If you haven't changed it, it is probably printed on your wireless router or in the paperwork that came with it. On my AT&T; Gateway (2Wire wireless router) it's called the \"Wireless Network Key\".I don't understand why so many negative reviews complain about the limited number of applications that work with Chromecast. The specs clearly state, \"Supports Netflix, YouTube, Hulu Plus, and Google Play Movies and Music mobile apps as well as SELECT (my caps) content through Chrome browser\". Why would anyone expect it to do more than this? Don't they read the specs? Or worse, do they read the specs and expect it to do more? The Chromecast does exactly what it claims and does these things extremely well.If you have any problems, search YouTube on your computer for \"Chromecast\" where you will find lots of videos on setup and use of the device.I love Chromecast and have just ordered another one (from Amazon this time) for a second TV.", "verified": true, "helpfulness": "1/2", "author": "R. Waller"}, {"rating": 5.0, "review": "So easy to plug and play - worked really well.  Initially was worried when iPad wasn't communicating with my TV, but after rebooting iPad it all worked GREAT!!  I've used it every day.", "verified": true, "helpfulness": "0/0", "author": "S. Dawn Rotellini"}, {"rating": 4.0, "review": "Actual uses are limited. The streaming from a computer can be going great for a while, but then slows down a lot. I figured out that by turning off my phone's wifi, it speeds up again. Maybe my router is just bad, but even with it working smoothly, it still has a few issues here and there.", "verified": true, "helpfulness": "0/0", "author": "Happycollegekid"}, {"rating": 4.0, "review": "My only downside is that I had to get the chromecast software \"somewhere\" out of google play store because they only support united states, I understand the reasons, but either way it is not non-us frienly yet.", "verified": true, "helpfulness": "0/0", "author": "Algis Neblett"}, {"rating": 4.0, "review": "I like the size, features, easy install, \"the whole Idea\". My only criticism is that more app support it. Not really a negative towards Google, just really looking forward to other apps. Happy I bought it though, very inexpensive.", "verified": true, "helpfulness": "0/0", "author": "Eddie"}, {"rating": 5.0, "review": "I installed this dongle a few days ago and I am using it a lot. I've watched all my \"Favorites\" and \"Watch Later\" videos on Youtube.It's awesome to control everything from my phone/tablet/laptop no matter where I am in my house.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Bopp"}, {"rating": 3.0, "review": "The Chromecast was fairly easy to setup on my laptop and Droid 4 smartphone.  Had real problems setting it up on our Amazon Kindle Fire, and even after I got it working, it caused a crash (had to reset Fire to factory defaults to get all our books back).  Also, I was not expecting that the Chromecast would need to be plugged in (ac power) to work.The intent was to make streaming from Netflix to our TV easier than it currently is, using the laptop + HDMI cable plugged into the wall-mounted flat screen.......but in the end, this is just as complicated, and looks just as unsightly, since there's now another cord to deal with.Also - tried to stream from Amazon Prime Video, and it was choppy.  Poor quality.  I'd only get this if you stream most of your content (as opposed to having satellite or cable) AND you don't mind having another power cable to deal with.", "verified": true, "helpfulness": "1/1", "author": "J. Squire"}, {"rating": 5.0, "review": "The set up was really easy and it plays youtube videos perfectly. Adding the videos to the queue and playing all the videos from playlist was really easy. And you could share your playlist with others as well. If you start playing video using one device (ex your smartphone), it can be controlled by using other devices on the same wifi network.I know there are many complains about not having more apps. But for me, i bought it just to watch youtube videos and netflix and it served that purpose. You can't go wrong with this device.", "verified": false, "helpfulness": "0/0", "author": "GP"}]