[{"rating": 4.0, "review": "I'm choosing this rating because it makes it easy. I think you should make vudu to stream. Keep up the good work.", "verified": true, "helpfulness": "0/0", "author": "Luis Dueñas"}, {"rating": 5.0, "review": "This  is a great product to connect net to TV, it takes about 5 mins to set up and works very well. Good buy", "verified": true, "helpfulness": "0/0", "author": "Reetesh Shukla"}, {"rating": 5.0, "review": "Easy to set up. Easy to use. Great quality. Worth every penny. I'd recommend anyone buying one for every tv in your house.", "verified": true, "helpfulness": "0/0", "author": "Chad Oliver"}, {"rating": 4.0, "review": "I was really excited to get this in because I thought that I can watch movies from my phone on my tv since I don't have Wifi at home. Unfortunately, you will need either wifi or a mobile hotspot for this to work. That being said.. i tried it out at my sisters house. It worked great! Picture quality exceeded my expectations. I really liked this little gadget but couldn't use it but my sister was very happy to use it for me. I would definitely recommend to anyone who has wifi at home.", "verified": true, "helpfulness": "0/0", "author": "jean vong"}, {"rating": 5.0, "review": "With this 1 Dongle, i don't longer need to connect hdmi to my pc in order to watch youtube or netflix! just awesome!", "verified": true, "helpfulness": "0/0", "author": "Moises"}, {"rating": 4.0, "review": "It would be nice if I could cast my browser and actually use it on my TV and it would be nice if I could cast the Google browser from my phone. I can cast any video from my computer to my TV since I can cast the browser itself but from my phone I'm limited to YouTube videos and a limited few other compliant sites. This just means that I have to go into the other room to hit pause, play, rewind...etc. If you have a laptop or a computer in the same room as your TV this is a non-issue. It does what it says it will do and it does it well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For the price you pay for the Google Chrome it met my every expectation.  I can't wait until it can stream other internet media.  It would also be nice if it could stream ABC, NBC, CBS, CWTV, ABC FAMILY, etc., hint hint.  👍", "verified": true, "helpfulness": "0/0", "author": "Tanya Whorley"}, {"rating": 5.0, "review": "The Chromecast is so easy to use and works great. Everyone who streams videos should get one of these! We even use them at work to project our computers to the conference room monitor.", "verified": true, "helpfulness": "0/0", "author": "Stephen P. Redeker"}, {"rating": 5.0, "review": "I bought this when we gave up cable TV.  It allows streaming of Netflix and Hulu, amongst others.  I can call up a movie on my Nexus and transfer what I'm watching to the television screen with just a tap. My wife says that I'm just a gadget nut.", "verified": true, "helpfulness": "0/0", "author": "John S. Yarbrough"}, {"rating": 2.0, "review": "Seems like showing photos on your device is a pretty fundamental use for this.  I don't care about streaming Netflix from my phone to my TV, I already have devices to do that.  Also makes my Sony Bravia refresh every 30 seconds (go blank briefly).  It's a good idea, but like lots of Google ideas, it's still in beta.  For now it sits in a drawer.", "verified": true, "helpfulness": "0/1", "author": "Matt"}]