[{"rating": 5.0, "review": "An excellent product with a very intuitive user interface. The search speech is impeccable and the number of apps makes cutting the cord with cable/satellite a reality. We mostly use this watch TV and movies on Amazon Instant Video and Netflix, and also to listen to Prime music.The reason I selected this over Roku or AppleTV was because I am tired of using a 9 digit remote to type in wifi passwords and search terms. The speech recognition search feature (using the included remote) is great. But after purchasing I found that I could use the companion app on my smartphone for voice search or even the phone's QWERTY keyboard to type. For that reason, I would suggest the Amazon Fire stick. I know the Fire TV has more better computer specs (processor, RAM, etc) but so far I haven't used any features I would expect to need that horsepower (like gaming). But - full disclosure - I've never used the Fire Stick so I can't comment on what tasks it's lesser specs can or cannot handle.", "verified": true, "helpfulness": "0/0", "author": "Joey B"}, {"rating": 5.0, "review": "I have a Sony Blu Ray player that also streams Amazon and other \"channels\". The Amazon Tv clearly blows it out of the water. The memory allows for smoother browsing of titles. Little to no buffering issues. A fantastic purchase for the price.", "verified": true, "helpfulness": "0/0", "author": "Eric Wood"}, {"rating": 5.0, "review": "Awesome!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazing,  my family is happy with Amazon Fire TV we love all the apps.  It will also save us a lot of money in the long run.", "verified": true, "helpfulness": "0/0", "author": "michelle schmidt"}, {"rating": 5.0, "review": "This is a great device.  I especially enjoy the instant play of Prime Videos.  Once Comcast finally lets HBO GO stream on this device, I will not need any other.", "verified": true, "helpfulness": "0/0", "author": "kurt"}, {"rating": 5.0, "review": "Great Love Fire TV over Directv and Cable..Thanks, Amazon :-)", "verified": true, "helpfulness": "0/0", "author": "Jacks Daddy from  N.C"}, {"rating": 1.0, "review": "Hello I just ones to ask if I need Internet connection on my TV to use this product.  Tks", "verified": false, "helpfulness": "1/9", "author": "Proviliz"}, {"rating": 1.0, "review": "I bought the fire tv with the understanding that I would be able to mirror my kindle device to my tv. After spending an hour with customer service they told me I would not be able to do it on ANY OF MY THREE KINDLES because none of them is an hdx. That was the main reason I bought the fire tv. I have been an exclusive user of amazon an kindle devices for years , but this has surely put a bitter taste in my mouth", "verified": true, "helpfulness": "3/6", "author": "T. C. B"}, {"rating": 5.0, "review": "I bought my Fire TV in January after doing close to a month of research comparing similar products (Apple TV, Roku, etc.).  While I'm usually an Apple loyalist I decided to go with Fire TV since it was the only option that offered Amazon Prime.  Now, after having used my Fire TV for two months I have to say that I really like it and I'm glad I chose it.  While the interface isn't quite as simple as Apple TV's it's really easy to get used to.  All of my favorite apps are offered from Hulu to Netflix to PBS and Youtube.  The only unfortunate thing is Apps like A&E; and Lifetime require that you go through an extra step through your cable provider in order to see their programming.  I use Comcast and that's not an option so I am unable to watch those programs (although I don't believe this is an issue with only Fire TV, I beleive the other players have the same problem).One aspect with Fire TV that I really like is the voice search.  Similar to a siri or cortana on your cell phone, by pressing the voice search button you say the name of the movie or TV show you want and it will search for you (only within the Amazon catalog though, not with other Apps like netflix).  When I'm feeling particularly lazy this is a handy tool.  Just make sure you notice the difference between shows/movies included in prime and ones you have to pay for.  Sometimes it can be easy to accidentally pay for something you didn't mean to when you're not paying close enough attention.", "verified": true, "helpfulness": "0/0", "author": "Amanda Dorough \"Manda\""}, {"rating": 5.0, "review": "happy so far still learning to use it", "verified": true, "helpfulness": "1/1", "author": "Harry Lee Drake"}]