[{"rating": 3.0, "review": "Amazon put an 8GB hard drive on board this device. That's good, but the best set top boxes of the future will need to have some sort of DVR aspect in order to be really competitive with cable company offerings. If you could pause the show you were watching, or record one while watching another one, these aspects of a \"streaming video player\" would be more useful, almost to the point of essential. By omitting these features, Amazon put its Fire TV in a class with Roku and Chromecast, whereas they could have been in a class of their own.  Even if FireTV is found to be the best in its class, it won't be long before Roku or Chromecast comes out with its own nuances that rival or are better than this device.In other words, what would make me want to ditch my Roku investment for another Roku-like model? The voice activation is not enough in and of itself, for me. The faster processing is a necessary component, but not sufficient to make me ditch my roku.", "verified": false, "helpfulness": "4/17", "author": "boston austin"}, {"rating": 1.0, "review": "Sorry Amazon, but this thing needs to be priced at $50, way to many streamers out there for the same price or less. And no HDMI cable included? Listen these days a TV mount comes with an HDMI cable. Way to expensive for something that  well... everyone else already has. So $50 I MIGHT buy it, but at $100 this will never catch on. Look at Chomecast $35 everyone is buying one just to have one, why? because of the price and size of it. Sorry but you guys are 3 years to late i think. Lower the price and people may buy it, but anything higher than $50 is not going to happen. Fix the price.", "verified": false, "helpfulness": "19/108", "author": "Joe"}, {"rating": 5.0, "review": "I have been a roku and apple TV owner for years.  The apple TV is junk and only used it a couple of times.  The Roku however has been a mainstay in our house.  I've even purchased them for extended family members over the years.The hardware of the FireTV is so much better, faster, stronger than the Roku that you can't even compare.The ability to add android apps in the future will make this a game changer.5 stars for the hardware, the quality of the User Interface (speed), and the potential to make this a console replacement and a roku replacement.", "verified": true, "helpfulness": "5/6", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Is it a gaming system? No... so I won't review it as such. I feel this device is catching a lot of flack for its inclusion of games but the point is it is not a dedicated gaming system and should be reviewed as such. It is a streaming box that lets you happen to play games on it... THERE IS A DIFFERENCE!VOICE SEARCH/SEARCH:At first, my experience with it was a bit frustrating, especially the highly-touted voice search! I thought I was using it as instructed but it either would keep telling me to try again or would be \"Thinking\" without me saying anything! However, after giving up and downloading a few apps and trying them out, I attempted to use it again and low and behold... it worked. Generally, voice search/search is pretty good if you want to get stuff from Amazon.Searching by typing in what your looking for can be a pain in the butt, but isn't anything new for anyone who has used a similar device without a dedicated keyboard. I haven't tried it yet, but I wonder if a Bluetooth keyboard could work with this?I know (think) there is some IMDb integration in the search but it seems to only search the higher-billed actors for what it's worth... I tested it trying to search for an actress that is a friend and had a bit part in a movie and is listed on IMDb for her work, but it didn't find her. However, when searching for the title of her movie, there it was. My only other issue was that I wish it could search within apps. How awesome would it be to search \"Star Trek\" (or whatever) and it pull up all the places you could watch; show you \"Star Trek\" in Amazon Prime, Netflix, etc., and you could pick whichever one you wanted based upon your subscriptions. Probably just wishful thinking since I know Amazon will want you to buy from them rather than watch it somewhere else.CONTENT:Personally, I feel content is one of those double-edge swords: sure you have a zillion options, but how many do you actually use/want to flip through? The voice search is a great help with this, though as I said above, I wish it would search within the streaming apps. The streaming apps are the heart of this section: while I'm sure the number will grow, I wish that EVERYTHING were available now so I could have the exact ones I want (HBO Go?). Despite this, I saw something in the settings that had me pretty excited - a developer mode. Though I haven't tried it yet, it does allow you to install apps from other sources than Amazon if you have the files. I think it might be possible to copy a standard Android .apk onto a USB stick and install it from the USB port on the back. I'll have to try later (I only got it late last night!). FLEX is available too if you want to stream locally-stored content from your computer.GAMES:Say it with me: \"This isn't a game console. This isn't a game console. This isn't a game console.\" Sure, it won't hold a candle to your Xbox or Playstation, but it does play games and those games are pretty fun. My wife saw you could play the original Sonic the Hedgehog on it and got pretty excited about it. I tried the Sev Zero game too, and while by no means does it have the graphical complexity of some of the new first-person shooter games on Xbox or Playstation (current generation or last generation), I had fun playing it... which I'm pretty sure is the point of playing a game. It is very early in the device's life and I'm excited to see what comes later, especially with as much announced support.HARDWARE:To be honest, I thought the WiFi would be a bit more capable, with the MIMO antenna. However, it works fine when plugged into an Ethernet cable. Otherwise, no complaints.", "verified": true, "helpfulness": "2/2", "author": "James L Mersereau"}, {"rating": 2.0, "review": "I'm docking it a star for the price.  I think they could throw the optical cable out and price it based on what it will cost in a year, getting it down to at least $80.When I was a kid, we had a voice activated TV.  We had three channels and our parents would say- \"Turn it to channel 5.\" or \"Turn it to channel 9.\"Then came cable w/ 100 channels, but luckily we had a remote.Then came on demand.  Right- Right- Right- Down- Down- ENTER.  Left- Left- Up- Enter.  Oh darn.  Down- Down- Backspace/Enter UP-UP Left-Enter.  Well, 15 minutes later your \"On demand command\" was in there and *THEN* you instantly got your program.  This voice activation rocks.The apps seem a bit light, but it's a very nice piece of h/w.  I'm sure the apps will build out.<Several weeks later>I just docked it 2 more stars and unplugged it.  My Roku has the content-apps I need.  So does my Kindle Fire HDx for that matter.  This doesn't have content.  I'll consider increasing the stars when it has :ABC/NBC/Colbert/Fox/Fox Biz, etc like Hulu and HDx.  Roku is up and Stossel is back!", "verified": true, "helpfulness": "2/4", "author": "Mehri Kaufman \"Mimish\""}, {"rating": 1.0, "review": "Does not play ANYTHING anymore.  I called Amazon, only to be put on the phone with multiple people with accents so thick, that I had no idea what they were saying.  After reaching Fire TV 'specialists,' I was told to clear my cache and data etc from the amazon apps and unplug the unit and restart.  I tried dozens of times, IT WILL NOT PLAY ANY CONTENT.  NONE.  No Netflix, no prime videos.This is typical 'Droid' crap.  My Apple TV works flawlessly, and has for several YEARS now without a hiccup.  Amazon can't even make their product work for a month or two.JUNK.  AVOID at all costs.", "verified": true, "helpfulness": "4/5", "author": "WD"}, {"rating": 1.0, "review": "stuck in an endless upgrade loop. screeen displays \"go to firetv support\" no way to get help, endless videos and stuff no assistance\"Contact Us\" is missing during launch.... bad thing", "verified": true, "helpfulness": "13/41", "author": "Greg"}, {"rating": 5.0, "review": "Just received my Fire TV set top box. I was easy to get set up and start watching movies etc. I'm still checking out all the functions so I will update this review again as time goes by. The one thing I thought this box did was allow you to play your amazon purchased  MP3's from the cloud. Maybe I just need to dig a little further or I might have misunderstood what capabilities this box has at the moment. Firmware updates may add goodie like that in the future. So far I'm very pleased with the operation of this little guy.Will update again...", "verified": true, "helpfulness": "1/1", "author": "jerry"}, {"rating": 5.0, "review": "For a first release, Amazon has really done an amazing job. Videos start blazingly fast, navigation is very intuitive, and the voice search works surprisingly well. The app selection isn't as full as on more established platforms, but I'm writing this only a few days after the Fire TV was released so I think it's safe to say more apps should be on the way. I can hardly wait to see what interesting new features Amazon adds to this box in the future.", "verified": true, "helpfulness": "2/2", "author": "Doug in ATL"}, {"rating": 4.0, "review": "HI it seems to be an awesome device but many device are not able to be activated for Ecuador (latin america) does the device features are able to be activated here? netflix youtube ,etc", "verified": false, "helpfulness": "1/9", "author": "Gregory"}]