[{"rating": 5.0, "review": "Love it almost as much as roku. Takes a little getting use to but a great product", "verified": true, "helpfulness": "0/0", "author": "brandy antonelli"}, {"rating": 5.0, "review": "This is awesome", "verified": true, "helpfulness": "0/0", "author": "Sergio Marron"}, {"rating": 5.0, "review": "Love this! Able to cast Netflix and u tube to tv so everyone to view!", "verified": true, "helpfulness": "0/0", "author": "Loraine B."}, {"rating": 3.0, "review": "Really not satisfied at all. Thought it was gonna be different. Just unhappy", "verified": true, "helpfulness": "0/1", "author": "Heather Britton"}, {"rating": 4.0, "review": "Works perfect ... sometimes ! Not bad for the money.", "verified": true, "helpfulness": "0/0", "author": "Fernando Giovagnoli"}, {"rating": 5.0, "review": "Love this thing.  I have 5 of them.", "verified": true, "helpfulness": "0/0", "author": "Donald Torrez"}, {"rating": 5.0, "review": "Love It", "verified": true, "helpfulness": "0/0", "author": "John Bender \"jcbender\""}, {"rating": 5.0, "review": "$32!  We are a cable free household, and having chromecast makes streaming videos so much easier than our smart tv.  It is definitely worth the price.  The only thing I would add as a buyer beware with any of the casting-like devices is to make sure your wireless router can handle the bandwidth.  We had a couple year old Belkin router, and the increase bandwidth the chromecast needed led us to buying a new wireless router.  That said, it was not the fault of the Chromecast.  Also, if you need a great router to handle the load check out the ASUS RT-N12.  Super cheap and worked great for a house full of wireless devices", "verified": true, "helpfulness": "1/1", "author": "ongestUsernameThatICanMakeOnAmazonsPublicProfileNameMaybeNotThisSiteAllowsForAReallyLongUsernameWow!"}, {"rating": 2.0, "review": "Unfortunately not a single help or set up document accompanied my chromecast and I have unable to use it so I have to give this only 2 stars. Online support is nonexistent as is any time of manufacturers help line or tech support. I'm not giving this 1 star because I'm sure my own lack of high level technical knowledge is adding to the difficulty. That being said, I would think that there would be some type of user-friendly docs or support somewhere but I have not been able to locate anything to help... at least that I can understand. I cannot recommend this to anyone.", "verified": true, "helpfulness": "0/1", "author": "Bob L \"Leo Roberts\""}, {"rating": 5.0, "review": "Chromecast is wonderful and keeps getting better. It seems to heat up a bit, so leave it space for venting, but its never been a problem for us. Its incredible how easy it is to stream on our tv. It keeps getting better, now that you can stream almost anything from your computer if you're using Chrome. They'll have to work on lag a bit for things like gaming, but its an amazing value for the cost.", "verified": true, "helpfulness": "0/0", "author": "Steve R Ford"}]