[{"rating": 5.0, "review": "The Chromecast is easy to set up and delivers amazing results. Such a seamless way to view internet, netflix, photos whatever you can access on your phone, tablet or laptop can be viewed on your TV ! What's not tolive?!", "verified": true, "helpfulness": "0/0", "author": "Denise Mary Sunshine"}, {"rating": 5.0, "review": "Awesome product.. works beautifully on my 50\" TV.. no more trouble with wires to contact to my phone. Thanks Chromecast..", "verified": true, "helpfulness": "0/0", "author": "haresh"}, {"rating": 5.0, "review": "it's limit but to much application coming out, but for me I like how it's easy setup and cast from youtube.", "verified": true, "helpfulness": "0/0", "author": "Ammar"}, {"rating": 3.0, "review": "First, understand this does not allow you to use your TV like a mirrored monitor for your phone, tablet, or laptop and only plays the streaming video or audio from them.  Not counting YouTube or Vevo because the quality of video for those two are extremely inconsistent and mostly not worth displaying on a TV, the only apps the Chromecast will stream video with at this time are Hulu Plus, Netflix and HBO GO; I tested the last two.  Though the video quality is uneven when it first starts, it does smooth out and is pretty good considering the source though I only tested it on a 24\" TV.  However, with so few apps this device has extremely limited use and most people would be happier with a Roku.  For myself, I am extremely disappointed it does not work with Amazon instant videos playing in Google Chrome on my laptop though it does so with Netflix.  It would be nice if Amazon would provide an Android app for instant videos with Chromecast support but I do not expect that to ever happen.  I could see the Chromecast device being more useful if your phone will allow you to create a mobile hotspot and use it alone for streaming to your TV and possibly dump your cable provider altogether if that suits your needs.  Unfortunately, my T-mobile pre-paid account won't let me try that out.  At this point I will probably just stick with connecting my notebook to the TV and using Unified Remote on my phone as a remote control, anyone want to buy a barely used Chromecast?", "verified": false, "helpfulness": "0/0", "author": "Mr. Jones"}, {"rating": 1.0, "review": "This thing worked reasonable well for about a month. Not great. Then it started to loose its WiFi connection. It'd connect, then after a minute or so, it'd disconnect. Lots of people seem to be having this problem with no advice nor fix from google. Buy a Roku and aSave yourself some grief.", "verified": true, "helpfulness": "0/0", "author": "Drew Murphy"}, {"rating": 2.0, "review": "I have owned and used several streaming devices and this is by far my least favorite. It is nearly useless in my opinion. Yes it does work, but the lack of a true on-screen interface makes it extremely awkward. I didn't think not having a dedicated remote would be a big deal, but it is. Using a phone/tablet to control everything just doesn't cut it for me. It can take a little effort just to do simple things like pause and that alone makes it annoying to use. I have a couple of Rokus and there is simply no comparison between the two devices. The Roku feels like a solid and well-designed product whereas the Chromecast just comes off more like a high school experiment. I am a google fan, but my biggest complaint has always been their simplistic yet often confusing user interfaces. Anyone that has used the gmail web interface would probably understand what I'm talking about here. This is just another example of them missing the mark again. With all that money they should invest in some better interface designers.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The general functionality of the unit -- it works great. I have used it with my Mac, my iPhone, my Android, my mom's PC -- different wi-fi networks, TVs -- no problem. Great for all of those scenarios.At home, I pretty much stopped watching regular television all together and used Chromecast all the time. I could easily watch streaming content sent from my laptop to my TV and still do other basic computing in other windows. On my TV, it was really easy because the HDMI and USB ports are really close together, so I just left it plugged in all the time.... And then I took it with me to Australia. The TV I had access to didn't have HDMI and USB close together so the unit had to be plugged into the wall outlet, and the wall outlets in Australia are different configuration and a higher voltage than in the US.After about the third time I used it, I started having connection issues. Sound with no video, video with no sound, or the unit resetting to the home screen. When I would go to hard reset or unplug it, the Chromecast would be too hot to touch to where I was scared to use it because I didn't want to break it, the TV, or the fry the HDMI outlet.[update] I brought it back to the US and it worked fine. I was relieved that there wasn't anything broken - and suspect the performance was affected by operating conditions. I took it on a trip to Canada, and it worked fine there, too. It worked so well that I left it with my hosts as a gift. I think it's still the best dongle for traveling purposes since it can stream most content regardless of your location (which can't be said about a lot if not all the content on Amazon Fire stick or Roku). But I would definitely be more mindful about voltage and other variables before plugging it abroad again.", "verified": true, "helpfulness": "0/0", "author": "J."}, {"rating": 4.0, "review": "Great little adapter, and very easy to set up and use.  I only wish it was adaptable with my main internet provider (Foxfire) instead of  just with Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Thomas Legge"}, {"rating": 1.0, "review": "This isn't like a roku that hooks up to the wifi in your home, it streams directly from another device, and poorly.", "verified": true, "helpfulness": "0/0", "author": "Janie S Lyons"}, {"rating": 1.0, "review": "Chromecast is difficult to set up and difficult to keep working.  The technical help line wasn't much help.  I don't recommend this product.  If you want to stream NetFlix from your iPad, I recommend an HDMI cable from the Apple Store.", "verified": true, "helpfulness": "0/0", "author": "David Beck"}]