[{"rating": 5.0, "review": "We love this!  It is everything it advertises and more.  It is lightening fast and the speech recognition is AWESOME!  It is most definitely $100 well spent.  Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "Cynthia J. White"}, {"rating": 4.0, "review": "The menu and remote are quite simple to use.  The installation, on my \"smart\" TV was basically plug in and play.This unit has resolved any issues and interruptions due to my WiFi signal.  The small size easily fits close to the TV.I know that I will enjoy the ease and convenience of the unit....a good purchase.", "verified": true, "helpfulness": "0/0", "author": "Anthony J. Sikich"}, {"rating": 5.0, "review": "I love how easy it was to set up basically all I did was plug it in turn it on put in my security code to wireless and it was done. my account was already in and ready. thank you amazon easiest install ever", "verified": true, "helpfulness": "0/0", "author": "D. Seybert \"D SEYBERT\""}, {"rating": 5.0, "review": "Cool. Fast. Voice search work like a charm. If you are an Amazon Prime member it only makes sense to have one because of the thousands of movies that you can stream for free. I also understand that in the near future Amazon may be starting a streaming music service that will also be included for free.", "verified": true, "helpfulness": "0/0", "author": "Edwin B. Campbell"}, {"rating": 3.0, "review": "The little buttons hard to figure out but familiarity clues you in on remote. Seems to work great as long as you know how to operate.", "verified": true, "helpfulness": "0/2", "author": "Leonard A. Reneau \"goatman\""}, {"rating": 5.0, "review": "I'm very happy with the purchase. Simple to work and much less intense than going through the myriad of options available through the internet choices on your tv. I would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "LiteraryLady"}, {"rating": 5.0, "review": "We've cancelled our satellite and are just loving this little thing.We have a bit of trouble with the Hulu app, stalling out, but perhaps it's just our slow internet.", "verified": true, "helpfulness": "0/0", "author": "Littleboyzblue"}, {"rating": 5.0, "review": "I also have an Apple TV, but I wanted to see what Amazon had to offer.  I was not disappointed.  The video quality is excellent, and the apps are numerous.  I especially like that I can watch Prime movies on it, as I can't on the Apple TV.  The remote is excellent, I don't have to point it at the unit, as it's a wi-fi remote (I think).  The extra thing the Fire TV does that the Apple TV doesn't is play games.  I'm not an avid gamer, but my son is, and he loves it.  One thing I'm missing on it is an HBO GO app, but perhaps soon, Amazon or HBO will add one.  As a programmer, I'm happy that I can develop apps for the Fire TV with my favorite development tool, Embarcadero Delphi and C++Builder.  In all, a very good buy.  Love it.", "verified": true, "helpfulness": "0/0", "author": "P. Woon \"Longren\""}, {"rating": 4.0, "review": "The Amazon Fire TV was a big step-up from both the roku and apple tv.Pros:Voice Search- This really takes time out of your day when its significantly easier to get to the movie that you want. Plus 90% of the time it gets you to what you asked for.Surround Sound- Surprisingly, with all of these gadgets to watch a movie with, all except the fire tv, you cant listen to the movie the way it was supposed to be heard. This box is the ONLY one out there that lets you do that. (requires surround sound speakers/headphones)Processor- This is a quad-core processor! (expected with gaming) This is significantly better than roku/apple allowing for smoother game play and movie watching.Memory- This has 2GB of memory. I would like to see expandable memory soon because for gaming, many will find this to be too low.Made for games- Has many games (over 100s) and has game controller (not included)Cons:Needed updated remote- With voice search, this remote is good. However it is missing some features that other controllers  have. Such as the roku headphone jack. Not everyone uses this but it still can be nice to have.HBO Go not available at release- Yes, I know that it will be coming soon, however, HBO is huge for movies and people love this service. It should have been here since the beginning.Memory- 2GB is a lot compared to other streaming devices. However, they are trying to be more into gaming. With big memory clogging apps such as nba 2k14, memory should be bigger. I game on my xbox one and PS4 all the time. For a gamer like me, this does not come near those expectations. NEEDED EXPANDABLE MEMORY.The Fire TV is a great streaming box overall. For its first generation, it exceeds expectations. As a long time gamer, I will love to see this update and improve to be GREAT for gaming.Thank YOU for reading my review.", "verified": true, "helpfulness": "0/0", "author": "Joey"}, {"rating": 5.0, "review": "This is a gotta have for Prime members. Easy install that my wife could do it. Menu navigation very easy. Good job Amazon.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]