[{"rating": 1.0, "review": "The product was shipped quickly. however i could not get it to work. it would not connect to my laptop. i called google and what not and still i couldn't get it going. i ended up giving it away. i wasted my money for nothing. this company did nothing wrong. it just wasnt't meant to be i guess.", "verified": true, "helpfulness": "0/0", "author": "Bear"}, {"rating": 5.0, "review": "Not compatible with the Kindle Fire HD. My rating is based solely on having seen it in use on my son's Nexus 7. I was so impressed I ordered one for the Kindle Fire we purchased for Christmas. Unfortunately I am having to return the Chromecast but have hopes maybe one day Amazon will get it together and allow it to be compatible with the Kindle Fire.", "verified": true, "helpfulness": "1/1", "author": "KtWeav"}, {"rating": 5.0, "review": "After a bad experience with Apple TV (did not work, since my 50\" plasma TV did not have the HDCP security protocol, which most TV's before 2010 or so do not seem to have.  It only worked on my 2 newest TV's that both have Wifi and internet TV built-in already.  Kinda defeats the purpose of buying Apple TV doesn't it...), I tried the Google Chromecast device.  Plugged it in the HDMI port, used the USB port of the TV to power the Chromecast device and 2 minutes later, I was up and running.  Works great as long as you only use one device to transmit video to it (I was using my Iphone 5 and it worked great).  When I also tried streaming with my HP laptop, the device got confused and I had to power it down.  After that it worked great.  If you know this and don't use 2 devices at the same time to try to stream video to the Chromecast, it works wonderfully.  For the low price, I would recommend it to anyone!  I bought 3 of them to get the TV's that don't have internet capability in our house yet, connected to the WWW.", "verified": true, "helpfulness": "0/0", "author": "Gerrit Oonk"}, {"rating": 5.0, "review": "Really happy with Chromecast.  Wish it had more apps though (namely Amazon instant video)I feel it beats other streamers because of it's portability and integration with google.", "verified": true, "helpfulness": "0/0", "author": "Musa Hussain"}, {"rating": 4.0, "review": "Awesome device made my tv into a smart tv pretty much the only problem I have is I dont understand why It wont work with google chrome I mean I seems like if it plays netflix this would be a option however the there is no web Brower hopefully soon they will add it", "verified": true, "helpfulness": "0/1", "author": "jon"}, {"rating": 5.0, "review": "I have been waiting for Google to come out with a product similar to AppleTV for Android devices. I have owned this product for a short time and 3 or 4 more apps have already become compatible with it. I am looking forward to seeing more apps being added.", "verified": true, "helpfulness": "0/0", "author": "J. James"}, {"rating": 5.0, "review": "A few months ago, my boyfriend saw a commercial for this and he commented it that it looks pretty neat. I thought it was pretty stupid personally because we have tv's, dvd/bueray players, game consoles, tablets, computers, etc. But as he is a hard person to shop for, I decided to order it. I got it on sale with Black Friday for about $5 cheaper than regular price and it was a good choice. He loved it and was the first thing he \"played\" with after opening presents. Seemed to work to his standards and he loves the fact that whatever you're streaming off of can be in another room. So he was playing a movie off the tablet (Samsung Galaxy 4) on Netflix and the tablet was able to be in another room and someone else was playing with it and he was still able to watch a movie.", "verified": true, "helpfulness": "0/0", "author": "Anon"}, {"rating": 5.0, "review": "This was perfect.  The price was great and I have one happy young man at my house.  He's been wanting one of these.", "verified": true, "helpfulness": "0/0", "author": "Julie T. English"}, {"rating": 5.0, "review": "If you would like a way to play your movies on the tv wirelessly,  this is the way to go.  Great price Great picture.  Can use tablet to pause.  Can still use tablet to simultaneously run other apps or surf internet", "verified": true, "helpfulness": "0/0", "author": "TIMOTHY A DOMIN"}, {"rating": 2.0, "review": "The initial instructions were simple enough but I couldn't get the connection to work. I spoke with a tech from Comcast and was told that I would have to go physically go to my local Comcast store and have them swap out my gateway for a new one. I wasn't going to go down that road.", "verified": true, "helpfulness": "0/0", "author": "Jimmy Z"}]