[{"rating": 2.0, "review": "What a waste of money. We already have almost everything this thing offers on our blue-ray player at the same subscription fees. What we don't have there can just be streamed through a laptop by logging in to amazon.com. Everything requires a cable service on top of that!Very disappointing....", "verified": false, "helpfulness": "0/1", "author": "nereida ritz"}, {"rating": 3.0, "review": "This device locks up A LOT. I bought it with the sling promotion and sometimes it just exits sling with no warning or error message. I wish I could give it a better review because I live Amazon as a whole. It's okay. Chrome at is better. Sorry Amazon. :-(", "verified": true, "helpfulness": "0/0", "author": "Monica S."}, {"rating": 5.0, "review": "I considered this purchase for a very long time, as I often watch Amazon videos, but put it off for fear that this product would work as poorly as Amazon's app on my smart TV. I'm glad this works perfectly, but I'm left wondering why the app on my smart TV is useless.", "verified": true, "helpfulness": "0/0", "author": "Colin"}, {"rating": 3.0, "review": "expected to be able to watch ESPN and Sec network. I do not have a cable tv provider. so I am still out of luck. They need to let us pay a subscription fee for these.", "verified": true, "helpfulness": "0/1", "author": "Haywood Wilson"}, {"rating": 5.0, "review": "I love Fire TV! Second best gift I've ever received. Great clarity, easy to use, and an enormous selection (some free, some not).My wife can have the DVR. I'll keep my Fire TV.", "verified": true, "helpfulness": "0/0", "author": "J. Grady"}, {"rating": 5.0, "review": "I absolutely love Amazon Fire TV.  It's so easy and when TV is boring, I go to the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Jelly"}, {"rating": 4.0, "review": "Works well. Interface is pretty good without a keyboard! I watch it all the time.", "verified": true, "helpfulness": "0/0", "author": "Bryan Nahrwold"}, {"rating": 5.0, "review": "Yes", "verified": true, "helpfulness": "0/0", "author": "robert bronson"}, {"rating": 5.0, "review": "I love the fire TV! We have been able to cancel our cable service & stream TV from the Amazon Fire TV. The picture is so clear & we haven't had any issues with streaming.", "verified": true, "helpfulness": "0/0", "author": "Tamara Battle"}, {"rating": 5.0, "review": "Love it! Simple to install, works perfectly.", "verified": true, "helpfulness": "0/0", "author": "J. Eddie \"CanMan\""}]