[{"rating": 3.0, "review": "It was easy to install. I'm still working on the setup. The Amazon Prime videos are useless, as there nothing new updated for free. There are however tons of fee content. The Prime TV as well. For movies I use Netflix, and for shows I use Hulu Plus. The kids still have all their shows, so they're happy...I also bought an HDMI antenna to get live TV... Still figuring that out. All in all, I'm glad I did it, I was sick of paying for cable. The video quality is MUCH better than I had with my cable. But, because of my internet speeds, I do get some lagging. Is not a deal breaker for me, it is irritating though. But that has nothing to do with Amazon Prime or their service.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is by far the BEST set top box ever!  Very responsive!  Totally blows Apple out of the water!  The UI is more polished.  I so like the integration of my Prime music and videos and soon to be photos!  This is the way to go!  You won't  be disappointed", "verified": true, "helpfulness": "1/1", "author": "cryptofreq"}, {"rating": 5.0, "review": "Excellent entertainment equipment.", "verified": true, "helpfulness": "0/0", "author": "lu dinh"}, {"rating": 5.0, "review": "Wonderful!!!!!", "verified": false, "helpfulness": "0/0", "author": "Richelle wycoff"}, {"rating": 1.0, "review": "I got this as a gift from work and I am glad I didn't pay for this because if I had I would have been hot hot hot. First off they charge you $100 then you have to spend another $30 for chords to hook it up only to find out they charge you for anything worth watching, you get charged for EVERYTHING! So not worth the money, the whole device is a marketing ploy, you're better off getting a subscription to Netflix and paying their monthly fee and get unlimited streaming verses $1.99 an episode! Are you frickn kidding me Amazon!", "verified": true, "helpfulness": "1/5", "author": "adam"}, {"rating": 5.0, "review": "Does it wok outside USA?", "verified": false, "helpfulness": "0/0", "author": "zurimari"}, {"rating": 2.0, "review": "I have a JVC television from the late '90s that was one of the first with an HDMI port.  It still works like a champ.  The reason I write that is because you should beware that in a non-Amazon forum I found that the Fire TV will not work effectively and consistently regarding sound if you have such a \"wise and experienced\" television.  My experience matches that assessment.Positives:  I liked the navigation and how quickly applications downloaded.  Navigating settings was easy too.  Organization of all the content on Prime Instant Video was easy and helpful.Negatives:  Despite using the exact same setup with my Blu-Ray DVD player and video working there with minimal problems, video will not stream on the Fire TV and the audio doesn't come through no matter how much I adjusted the Dolby Digital settings (I tried every option).  I have been on numerous forums through Amazon and other places and neither video nor audio works.  It is NOT my internet connection.  As I said, the EXACT same setup on the same TV but with by BD player works fine.  It had slowed down just with Hulu Plus so I was trying another solution in the Fire TV but this is many times worse.I missed the return window by a day before I had a chance to try it.  I had bought an early gift for my family member and she did not even open the box until today.  I get to take responsibility for that and I hope that perhaps I can reset everything to factory settings and give it to someone for whom it will actually work.If you have an older TV (say >5 years old), try it immediately upon receiving it in case you have to return it.  Use the Amazon forums not if, but when, you have problems.  They are very helpful.  Best of luck to all!", "verified": true, "helpfulness": "0/1", "author": "T. Davis"}, {"rating": 2.0, "review": "Amazon TV is a good item however, there are additional fees, as a Amazon Prime member I thought I would get more bang for the buck but that's not true, I still have to pay for movies and games top of my $100 membership,  I thought is would be different, in the end it's still a money pit just like cable tv.", "verified": true, "helpfulness": "0/0", "author": "Stacey"}, {"rating": 5.0, "review": "Loving life without cable TV. My world's on \"Fire\"!", "verified": true, "helpfulness": "0/0", "author": "Patricia L. Ross"}, {"rating": 5.0, "review": "Better than I thought it would be!", "verified": true, "helpfulness": "0/0", "author": "louis"}]