[{"rating": 5.0, "review": "The main reason I bought this was to have access to youtube videos since my DirecTV receiver no longer could play them after youtube made some changes to their platform. Amazon is always my first place to see what is available. I am on my 3rd kindle and like the Echo pretty well. I thought I would try the Fire TV. There is lots more than just youtube available and I did not know what I was missing. With a wifi connection you are set to watch almost any videos out there. Of course, many of them cost something but that is my choice if I want to spend the money. Fire TV works perfectly and I have had no issues since getting it a couple of months ago. As of today, I have not fully used all of its features, but I love the ones I have used. Those include youtube, Prime TV, NetFlix, TuneIn and putting my pictures and videos from my computer to my TV. I have not tried the alternatives that are out there but I can't see how anyone could be disappointed with the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Wesley H. Brown Jr. \"WBJr\""}, {"rating": 4.0, "review": "The one downside of this purchase is that there is no instruction book for navigatingthe system.  We are an older couple, 60's, and not as tech savvy as is required forunderstanding how this works. Good old trial and error is how we are learning.Perhaps a tutorial within the play system would insure the purchaser maximizes allthat Amazon Fire TV has to offer.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Ruise"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Karin Marquardt"}, {"rating": 5.0, "review": "We live in a rural area with a small cable company.  Nothing but returns and 50 year old shows.  I love my fires TV and will definately upgrade my free trial!", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Hoan Le"}, {"rating": 4.0, "review": "It is an interesting item.  I am still exploring, and I like what I have found thus far.", "verified": true, "helpfulness": "0/0", "author": "Mechelle Martinez Amor"}, {"rating": 5.0, "review": "It does everything I need and very fast.. Prompt constant updates from Amazon. I recommend.", "verified": true, "helpfulness": "0/0", "author": "Yamil Cabrera"}, {"rating": 5.0, "review": "Love the Fire TV", "verified": true, "helpfulness": "0/0", "author": "RGPrime"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "SHERRI"}, {"rating": 5.0, "review": "This thing is great.  Easy to set up and easy to use.  Great addition to basic cable service.", "verified": true, "helpfulness": "0/0", "author": "James Goff"}]