[{"rating": 3.0, "review": "So I received my new Fire TV yesterday afternoon and was excited to start using a streaming box. I own a Panasonic Plasma HDTV with the Viera Smart Apps, a PS3 & and Xbox360. I also use an AppleTV at the office that I'm signed in with using all my streaming services and I've also played around with a Roku (which I really like).  Although streaming content is relatively simple with all these devices, I feel it leaves a lot more to be desired besides pumping out streaming content. Enter the Amazon Fire TV. Here's where the Fire TV stands out from the rest that I liked and that's the Voice Search capabilities. It's also the single most feature that needs improvement as well. I really enjoyed searching for content using my voice as apposed to entering it in with text. It's simple and effective. I even had my kids give it a run and it recognized what they were looking for too. If Amazon is trying to go up against Apple TV and their supposed \"walled garden\" then they need to open up the voice search capabilities similar in functionality to a Roku. Allow the user to search for content across ALL apps including Netflix and not just Prime content. Perhaps this was a business decision and a poor one in my opinion. Also, no HBO Go out the gate? You do know that Games of Thrones Season 4 is about to begin do you Amazon? I'm sure not everyone is an HBO subscriber but there are plenty of people out there borrowing their buddies logins to watch HBO programming. Come on Amazon, you guys get onboard with this please? Playing games on the Fire TV seems like an interesting concept that I'm sure will mature over time. I had my son playing the Minion Rush game which was fun on the big screen. He's 5 and got the hand of using the remote as a controller pretty quickly. Eventually I'll probably shell out for the game controller down the road as more games become available but for now I'm more than content with my PS3/Xbox360 gaming investment. The design of the box is pretty clean and simple, I like it as well as it having built-in LAN capabilities. I always plug in using wired ethernet. I've got the Fire TV connected directly into my home theater receiver via HDMI for 5.1 surround sound audio which is then going HDMI out directly to my plasma. If the Fire TV is going to be GREAT then I feel two things need to be added. First, allow the voice search to work with all the apps like Netflix & Hulu Plus and second, GET HBO GO!!! Hopefully Amazon will listen to its faithful customers and get this in an update soon enough.", "verified": true, "helpfulness": "3/7", "author": "shaolinkaz"}, {"rating": 5.0, "review": "I dont know anything about Roku or Chrome or Apple beyond the research I did but this box is perfect for a guy and his wife who wants a minimal hardware, minimal hassle and just an easy way to watch shows---without skipping or long loading times (I read Roku has this issue)  The voice search on the remote is awesome.  It understands everything i am looking for and never comes back NO SEARCH RESULTS.  I have loaded my Netlfix account and Amazon.com prime account on the box and I am all set to catch up on all the shows---BREAKING BAD, HOUSE OF CARDS, WALKING DEAD, ORANGE IS THE NEW BLACK, UNDER THE DOME,  DOWNTON ABBEY, AND OTHERS.  Yes I wish this box had HBO GO---its the only thing it lacks.  But you can pay $3.99 per episode of any HBO show you want on this box if you are that much in need of the show.  I want to watch GAME OF THRONES as my wife is hooked on it and i havent seen it but at $3.99 an episode i will stick to watching it on my kindle fire 8\" screen.  So the only CON is that I have to watch GAME OF THRONES on my 8\" Kindle Fire or pay $3.99 per episode---and that truly is not that big of deal.  This review is truly from a person who knows nothing about techie talk or gaming---just a guy and his wife who like to watch shows on their BIGGER TV.Highly recommend for anyone like myself.", "verified": true, "helpfulness": "6/7", "author": "PRETTYBIGDEAL"}, {"rating": 5.0, "review": "Just as music albums are loosing sales because people are tired of paying for songs they don't like, to get a few they DO want, TV will soon be primarily a media where we are able to \"cherry pick\" only the channels we want. It was just a matter of time before someone took this existing technology to a more refined level. You can get rid of your cable or dish TV subscriptions, and receive thousands of movie and TV programs for a yearly cost of less than you pay now, per month. You only need internet access with broad band Wi-Fi. You can still get local stations with an antenna converter. I've been doing this for awhile, but Amazon is taking this to a new level!! With Amazon backing and promoting this technology, this is going to change the way people watch and pay (less) for their televised entertainment. Thanks Amazon!!", "verified": false, "helpfulness": "3/4", "author": "Jeff Moore"}, {"rating": 5.0, "review": "I, for one, love it. It does exactly what I need it to do - mainly streamline the process of watching iPad related stuff on my tv. No more messing around with hooking my iPad up every time I want to watch something and having to stop watching stuff when my iPad battery dies, etc. This was easy to hook up and now it's done and it barely takes up a speck of space under the tv.Also, I usually use Netflix through my TiVo interface but the Netflix app on the Fire is SO SO SO MUCH faster to load and stream for me AND is programmed MUCH better overall, in that it starts the next episode on it's own, skips the opening credits for you, etc. I'm never using the TiVo Netflix option again. (It's even better than the Netflix app I have on my Samsung products, which I also use here and there.)I get the complaints I see about it but FOR ME, this thing is utterly perfect. I don't have gaming consoles and am not interested in gaming, I don't mind sorting my programs on the computer where it's easier (I do most of my Amazon shopping on a 'real' computer anyway) - I wanted an easier way to watch Amazon stuff off my iPad and this does it, quickly and easily, so I'm happy. The unexpected Netflix quality bump is just a bonus.(If they can add the HBOGo at some point, that would be great but I don't use that all that much so if they can't, it's no biggie for me.)", "verified": true, "helpfulness": "3/3", "author": "mellusions"}, {"rating": 5.0, "review": "I am using my Fire TV as I type this. I will start with I wish I knew this was coming out at Christmas time before I bought my Roku 3. I bought it for the use of my Amazon Prime Video. I do not have Netflix or HULU. I connected the unit to the TV that I had connected my Kindle HD to watch my movies. Must say, loving so far. I bought the game controller for the games, love having it! The remote control fits comfortably in my hand. I tried the voice access and it worked well for the two searches I did.The one thing that I still like on the Roku is that I can plug headphones in the remote control.", "verified": true, "helpfulness": "6/6", "author": "Kindle Customer"}, {"rating": 4.0, "review": "below the line was my initial review. there are still alot of problems amazon needs to work out with the interface and software compatibility.they are trying to integrate their kindle eco system with fire tv and i think its fantastic but premature in terms of current software state. it needs further development.i just go my controller today and my little brother loves it. the gaming quality was amazing. i was not expecting console level gaming from this tiny box. being a techy i have no problem coming up with workarounds for FireTv's shortcomings. but they really need to work on the user interface and content accessibility for the end user.All in all its the best in its league when compared to roku, vizio star, or chromesticks. definitely kicks the crap out of apple tv.FireTV platform is restricted but when you compare it to any of Apple devices its blows them out of water.-----------------------------------------Netflix keeps crashing with white screen.None of the amazon prime shows stream in HDCan't tell whether the PIN request is to buy an episode or buypass parental controls.Every show whether adult or for children is on the recent, videos, etc lists (even though parental controls are enabled)Lied about parents ability to put time limits. (no such option)The settings menu is horrible with absolutely 0 customization.The Microphone search is only for amazon services. not supported in Youtube (which is the no1 reason i bought this)No support for books for text to speech.The Plex media server is completely incompatible even though they advertise it to be officially supported.Typical amazon s***. 1 click ordering and buy buy buy options for everything. I can't seem to stop it from displaying content that is not prime. i dont wanna buy any of ur s***** e-content.", "verified": true, "helpfulness": "21/48", "author": "Danish Khattak \"danish\""}, {"rating": 5.0, "review": "Amazon has done it again.  The Kindle Fire HD was my first purchase.  A winner.  Now, I have the Fire TV.  Easy to set-up, easy to operate.  Consolidates Prime, Netflix, Games, Videos, Music (Pandora) all-in-one place just to name a few.  This is another winner. Be patient.  You know that Amazon will deliver more and more as time goes on.", "verified": true, "helpfulness": "6/6", "author": "Greco"}, {"rating": 5.0, "review": "All I can say is, this is the best steaming device I've seen.  Amazon will continue to improve it as they always do, and this will create a new standard for media consumption. All the gripes I've seen are minor and nit picking.  I give it five stars because it's a solid hardware platform that will only get better with future updates.", "verified": true, "helpfulness": "6/6", "author": "borsman"}, {"rating": 1.0, "review": "Device did not work on setup. Called support. Rebooted as directed, successfully registered, but screen went dark after registration.  Called support again, and they are shipping a new unit, but very disappointed.Turns out this device only works with 1080p HDMI displays.  I have Sony 1080I/720p.  I changed settings on Fire TV to 720p by attaching to a computer display then reattached to my Sony.  Voila- now picture works, but no content plays.  I use Apple TV in same environment and it works fine.  This device is just not fully compatible with TV's.  Sending everything back.", "verified": true, "helpfulness": "15/34", "author": "H. Satterthwaite"}, {"rating": 5.0, "review": "I give this device 5 stars even though it deserves 10 stars! This thing Rocks!I ABSOLUTELY recommend Amazon Fire TV! Perfect companion for media and gaming. ILOVE IT! once again Amazon is ahead of their time. I am still learning all it's capabilities,  like mirroring, so I'll get another review out to you again. Amazon?? ROCK ON! :-)Now, Amazon please add HBO GO to your apps!Peace Profound. :-)update: You can only mirror an HDX Kindle tablet with this streaming device. That disappoints me. Amazon, update to mirrorandroid tablets, and also get HBO GO in your apps please!", "verified": true, "helpfulness": "4/8", "author": "Seahorse \"Seahorse\""}]