[{"rating": 2.0, "review": "I have been using a Roku player 3 for several years now.  I have an account with VUDU for my movies.  You can not get VUDU with the Amazon Fire TV!!  I don't understand why not but it is not available.  I am returning the Fire TV.", "verified": true, "helpfulness": "1/2", "author": "Donald Vaughan"}, {"rating": 4.0, "review": "It's okay, would be better if I can get the local channels...", "verified": true, "helpfulness": "1/2", "author": "Marjorie Hayfield"}, {"rating": 5.0, "review": "I just installed my Fire TV.  Took all of 10 minutes - most of which was unboxing the components.  Plugged cables in, plugged power supply in and started using it.  Wish other things were as simple.  I played around with voice input and am pleasantly surprised at how well it works.  This stuff is becoming easier and easier to use (I'm from the \"get up to change channel age\").  Because of a recently deceased Smart TV I'm using a (non) Smart box.  No problem.  I'm using a hard-wired 'Net connection and will update this when I go to WI-FI if there are any issues.I really like the ability to switch between Fire and Cable just by changing the input source of the TV (HDMI 1 to HDMI 2).  No time lag at all.", "verified": true, "helpfulness": "1/1", "author": "J. Pryvarski \"John P.\""}, {"rating": 5.0, "review": "This is the best streaming device I have owned. It's substantially faster and easier to navigate than my apple TV. I have been recommending it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Jen"}, {"rating": 5.0, "review": "Wonderful, innovative piece of equipment", "verified": true, "helpfulness": "0/0", "author": "Catherine M. Kelly"}, {"rating": 5.0, "review": "superb streamer I ever use !! I hope it aprove more with update", "verified": true, "helpfulness": "0/0", "author": "avi maman"}, {"rating": 5.0, "review": "I love it ! It was very easy to install and instructions we're clear. Reccomend!", "verified": true, "helpfulness": "0/0", "author": "Lisney Vargas"}, {"rating": 5.0, "review": "Awesomeness..... better than apple TV and Ouya for your Kodi needs", "verified": true, "helpfulness": "0/0", "author": "Joel S."}, {"rating": 5.0, "review": "Very good! Easy to choose programs! Lots of variety in programming.", "verified": true, "helpfulness": "0/0", "author": "Denita Sue Germaine"}, {"rating": 5.0, "review": "Excellent product. Very easy setup for non-tech savvy individuals", "verified": true, "helpfulness": "0/0", "author": "Nicole Gruntorad"}]