[{"rating": 2.0, "review": "A lot of the content I'd want is subscription based...I haven't found myself using it much in the month or so that I've had it.", "verified": true, "helpfulness": "2/3", "author": "theaccountant \"cpa5oh\""}, {"rating": 5.0, "review": "HAD UNIT FOR ABOUT 9 MONTHS, TOOK IT TO ARIZONA FOR 2-WKS DID USE RETURNED TO CALIF. PLUGGED IN GOT PICTURE , NEXT DAY ONLY THE BOX LIGHT CAME ON, NO PICTURE TRIED ALL OF THE RE-BOOT ,& SET UP FORUM BUT THE UNIT WONT RE-BOOT, IS IT DEAD ? OR CAN A CUSTOMER GIVE ME A PHONE # TO WARRANTY ,I DID PURCHASE THEWARRANTY.---BILL---------RECIEVED THE REPLACEMENT UNIT BY MAIL  TODAY UNBOXED , PLUGGED IN POWER CORD HDMI CABLE FRON T V --THE BOX CAME ON PILOT LIGHT WAS A AMBER RE-BOOTED SAME NO PICTURE NO SOUND.. WHAT IS THE PROBLEM.???????", "verified": true, "helpfulness": "1/2", "author": "WILLIAM GREEN"}, {"rating": 1.0, "review": "First one lasted less than a year. Replacement has a bad remote. The programs are great, the equipment is costly to keep replacing.", "verified": true, "helpfulness": "2/3", "author": "Madeline Bach"}, {"rating": 2.0, "review": "Needs a lot better directions, it's only okay. If you had  better directions, it probably will be 5 ratting.", "verified": true, "helpfulness": "0/2", "author": "Andrew"}, {"rating": 5.0, "review": "I've had an apple fire tv for about a year now, it has shows to watch, good games to play ,and you can also install a xbmc on it. This is the best product amazon  came up with and I have no plans of reselling this item.", "verified": true, "helpfulness": "0/0", "author": "Ricardo"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "NANCY BAGSIC"}, {"rating": 5.0, "review": "Fire TV has worked out get so far. Lots of free movies and shows. However I was surprised at the number of movies and shows that I was asked to pay for. There are some movies that I wanted to watch that are (10) or more years old and are not free yet.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Fast responsive and fast", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The Amazon Prime Video Idea:So as a Secondary Prime Member (Family member from another Household) and not a Full Prime Member I didn't realize that I would not have access to the Prime Video viewing features for free.  After all, I could see those options on my PC and could view movies without a problem.  However that same ability doesn't transfer apparently to the Fire TV.  It wasn't until  today did I realize that I have been billed the $99.00 dollars for a years subscription.  Have to be honest, I feel duped.  Had I known all that in advance, I wouldn't have gotten the Fire TV, I would have just purchased a PS4 or PS3 and got NetFlix if I wanted to view movies  (Fire TV - 99.00 + 99.00 Prime Subscription = New PS3 and maybe a used game - ie - not saving anything).The Setup/Playback Experience:As for the experience of setting up the unit and the quality of the playback, worked well.  The on-screen menus are simple to navigate and the remote is responsive.  I am a tech savvy guy so I thought the menu/content was straightforward; However, if you're not comfortable navigating a web app/android-like environment, it might be a little difficult but something that you'd pick up right away.  Surprised at the quality of the playback and believe it to be pretty close to 1080p.  Didn't seem to have any real streaming issues unless of course you are trying to fast forward through something then the loading screen seems to lag a bit.The Amazon Offerings and Service Overall:What does seem to be a let-down however is the lack of real quality movie selections from the Instant Prime Video (Free) perspective.  Amazon Prime Video is a haven for B rated movies from all cinematic genres. It's actually surprising how limited their selections are when it comes to the sci-fi, horror etc when you are looking for big name films.  And in most cases those are films that you have to pay to rent.  Unlike Netflix which also requires a subscription and whose movies are all inclusive to rent for free, the Amazon model is definitely different.  You gotta pay to play even though  you are forking over 100 bucks a year basically.  Granted yes, you are getting  free shipping, access to their music streaming services, cloud storage, pay-to-play games and the substandard movie selection, just not entirely sure it's worth the money.I understand I could drop the Amazon Prime and go for the NetFlix, but the whole reason I bought the unit was because I \"thought\" I had a full Prime membership and was eligible for the movies.  If you are not a Full Prime Member or not located in the same Household as the Primary Prime Member and don't have access to their payment information then you won't be able to utilize this service.", "verified": true, "helpfulness": "2/3", "author": "O. Chambers"}, {"rating": 5.0, "review": "LOVE LOVE LOVE....we got rid of cable and dish...best investment for our home.", "verified": true, "helpfulness": "0/0", "author": "Nicole"}]