[{"rating": 5.0, "review": "Amazing product.  Easy to install and works great every time,  can't think of a better way to watch programs from your Ipad", "verified": true, "helpfulness": "0/0", "author": "Francis L Mosler"}, {"rating": 5.0, "review": "I love this thing.  I use it on my TV by my treadmill.  Works great.  Best part is it doesn't drain the battery on my iPhone.", "verified": true, "helpfulness": "0/0", "author": "J. H. Wakelin"}, {"rating": 5.0, "review": "I had originally purchased one of these for work where we now use it to drive a large 50\" monitor in our lobby as a welcoming display.  It worked so well that I decided to get one for my home.  Plus I'm a gadget freak and couldn't pass it up for the price.There seems to be a lot of confusion about what this does and doesn't do.  Let me try to help the cause a bit here.  You connect this to one of your tv's HDMI inputs.  [To note, at home I have this connected through my Onkyo media system].  The device also requires power...here you have two options: 1) use the included power adapter and plug that into a standard 110v household outlet, 2) use one of the USB ports on your television (if so equipped) to power the unit.  The cable included with the Chromecast serves both options.Once connected and powered on, you switch your television's HMDI input to the one that has the Chromecast inserted.  You are guided through a series of very simple steps to configure the Chromecast to use your home WiFi and apply any updates that may be available.  Once configured, the device goes into a default mode which displays beautiful and interesting photographs from around the world some of which are quite breathtaking.  But of course, you're not buying one of these just to look at pretty pictures (or maybe you are :) )OK, so here's the long and the short of it: the Chromecast is a WiFi signal RECEIVER to which you SEND a signal from any device capable of running either Chrome browser or Chrome OS (read: Chromebook).  This includes tablets, phablets, phones, Windows laptops, etc etc etc.  There is a Chrome extension (or app depending on your device) that allows you to broadcast either the current Chrome tab OR your entire device's screen.If you can see and hear it on your device...you can see and hear it on the Chromecast (vis a vis your television).Overall, I have found the performance to be very good both at home and the one at work.  Depending on the speed/performance of your TRANSMITTING device, any WiFi issues, and the quality of the video/audio being sent to the Chromecast you may experience some stuttering or hesitation at times.  I have not found this to be a major drawback.So what are the uses?  Well, here's just a couple of examples from my experience.  As mentioned, at work it drives a customizable graphic display in our lobby (like you see in banks) which shows a series of slides about the company and any specific welcoming messages we may have for special guests.  At home, we use it to watch catch up's of our favorite TV shows that are available online.  I use (and love) my Chromebook [yes, using it now] and \"broadcast\" the tv show from the site on my Chromebook to our 60\" television via the Chromecast connected through our Onkyo media system.  I am also able to use this configuration as an \"external monitor\" for my Chromebook such as when I'm doing research on ancestory.com.  By broadcasting to the 60\" screen I am able to actually READ the fineprint of documents that are available online.Simply put, you can use it for just about anything.  More and more sites/apps are providing built-in support for the Chromecast (e.g. Netflix, youtube) which display the Chromecast icon which you just click on to begin broadcasting.For it's low cost and what I anticipate to be continual upgrades and improvements from Google, you really can't go wrong with this purchase.  Enjoy.", "verified": true, "helpfulness": "0/0", "author": "Russ Griggs"}, {"rating": 1.0, "review": "Having heard the glowing reviews on this product I didn't hesitate making my purchase. I had been having problems with Netflix streaming (via Tivo) and thought this might \"bridge the gap\".I unpacked it, hooked it up exactly as instructed, got the little light acknowledging that it was ready to go ..........Didn't stream a thing. Didn't work at all.", "verified": true, "helpfulness": "0/0", "author": "Stephen C. Lee"}, {"rating": 5.0, "review": "I love my Google Chromecast it travels with me, and once it is synced up you are ready to go in no time.  I am not tech saavy, and had no problem getting this gadget set up.  I can use my laptop, cell phone or IPad to play content on my TV.", "verified": true, "helpfulness": "0/0", "author": "MichelleS \"shopping artist\""}, {"rating": 4.0, "review": "Chromecast is today a technological tool to improve the service offered by SmartTVs.Chromecast converts a common  Display (or TV) in something better than a Smart TVChromecast works great with youtube using a simple click and connectThe Youtube videos play very fluid even those that are Full HD, I've tried on Android and IOS 7.1 and both works fineStreaming local content is not so fluid but works wellWith the help of Apks present in the Play Store and App Store Chromecast reaches the streaming of many things even documents.That are the good things.The projection from a laptop via Chrome browser tabs is very slow and unstableBut the biggest limitation of  today, is the lack of a suitable application for doing Mirroring via  Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Eliseo Niño"}, {"rating": 4.0, "review": "Hi Alan, Thanks for your speedy responds to my queries.The item works well, simple plug and play and no connected cables require.Will follow up with other items at your store and definitely recommend it to my friendsCheersWilliam", "verified": true, "helpfulness": "0/0", "author": "Lee William"}, {"rating": 5.0, "review": "So far I have not one issue with this product. I have had to reset it once in past five months. Fair trade for the price from the high dollar boxes", "verified": true, "helpfulness": "0/0", "author": "William Steede"}, {"rating": 1.0, "review": "The concept is great however there was too much buffering and limitations to this. Using this dongle your stuck with Googles limitations. As in limited to certain streaming websites. There is also no remote so you have to have your host device next to you, laptop, desktop, phone, whatever, to use it as a remote. This dongle also does not support all popular video formats so good luck streaming your local media. I would lose connection all the time with my SGS4 using the Chrome Cast app. Overall it was just a poor experience, very buggy and very laggy.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 2.0, "review": "I regret that I did not test the product before ordering.It does not support ipad, so if you are thinking to connect with iPad, it wont work. It inform you it is not ready YET. I do not know when it is going to be available.Second, it is slow. Connects slow and sometimes lose the connection. '", "verified": true, "helpfulness": "0/0", "author": "Christina"}]