[{"rating": 3.0, "review": "not enough free movies, too many movies for purchase, movies for rent cost more than on directv. i would recommend this product to people who dont have cable! i do like the size of the product,you can take it anywhere.", "verified": true, "helpfulness": "1/1", "author": "tracey thomas"}, {"rating": 5.0, "review": "We are still learning the System, but so far it is fabulous.  We have already reduced Satellite Services by $125.00 per month and will probably be removing additional services.  All the additional Aps are also great.", "verified": true, "helpfulness": "0/0", "author": "Jerry Sonier"}, {"rating": 5.0, "review": "Easy set up. Home page flows well from one  app to another.Using an Ethernet cable for modem connection to internet.This makes the Amazon Prime service  even better then wireless to the LG smart TV.Updates are hassle free.", "verified": true, "helpfulness": "0/1", "author": "Edward L. Richards"}, {"rating": 5.0, "review": "It took a little time to figure out because the instructions are not very good.  However, once I figured out how to use it, it works great and I'm enjoying watching old shows and movies.", "verified": true, "helpfulness": "0/1", "author": "MB"}, {"rating": 5.0, "review": "This is a great addition to my Roku (which I'm using less and less these days).  Love the voice recognition feature.  Prime has come through again.", "verified": true, "helpfulness": "0/1", "author": "S. Knudsen"}, {"rating": 5.0, "review": "Didn't know how much we needed it, and now we have it....would NOT want to be without it!To give you an example of how good the voice recognition interface is, 'it can tell the difference between my requesting 'Midsummer' and 'midsomer'.....heck i can hardly hear the change in my own voice. It does! V. Pleased!", "verified": true, "helpfulness": "1/2", "author": "AllAmericanAlienBoy"}, {"rating": 5.0, "review": "I bought this as a gift for my parents who are in thier 70s and they love it! Very user friendly. They love the fact that all they have to do is talk into the remote to find what they want!", "verified": true, "helpfulness": "1/2", "author": "K"}, {"rating": 5.0, "review": "I love this product!  Setup was easy.  Works great with wifi.  I am very pleased.  Also allows me to do a youtube search with my ipad or phone.", "verified": true, "helpfulness": "0/1", "author": "Edna"}, {"rating": 1.0, "review": "Bought this thinking may be able to watch tv on my time but without prime nothing I mean nothing is available so I will be returning and getting another system", "verified": true, "helpfulness": "5/15", "author": "scott"}, {"rating": 4.0, "review": "I have had the fire TV for about a month now and you do like it overall. I guess most of all I like the 1080 quality of some of the programming which I have seen. Having difficulties with hand coordination I do find that the remote is sometimes a little touchy and difficult for me to use. I am therefore hoping that some kind of Bluetooth keyboard arrangement might become available to use with the device. If it does, I will surely buy one.", "verified": true, "helpfulness": "1/2", "author": "Tim Berkes"}]