[{"rating": 5.0, "review": "can't add any more to what others have said", "verified": true, "helpfulness": "0/0", "author": "rhonda"}, {"rating": 4.0, "review": "Had the Chromecast and this is so much better.  Pleased!", "verified": true, "helpfulness": "0/0", "author": "M. Wallman"}, {"rating": 2.0, "review": "It doesn't work", "verified": true, "helpfulness": "0/1", "author": "Jose B."}, {"rating": 5.0, "review": "The best..", "verified": true, "helpfulness": "0/0", "author": "Carlos F Concepcion"}, {"rating": 5.0, "review": "Easy, quick, a pleadure", "verified": true, "helpfulness": "0/0", "author": "Sandy Lieberman"}, {"rating": 4.0, "review": "I love the fact that I can access Fire TV through my Kindle and I love the voice access. I was disappointed that there weren't more free movies that were current.", "verified": true, "helpfulness": "0/0", "author": "lee a. martin"}, {"rating": 5.0, "review": "Delivers Amazon Prime's shows easily and with good quality.  Seldom stops for buffering on my wifi system.", "verified": true, "helpfulness": "0/0", "author": "E. Leuenberger"}, {"rating": 5.0, "review": "I really like this.  I am actually debating getting free from Comcast Cable TV and Internet.  Go to FIOS on Frontier and cut my bill in half with Sling TV with HBO.  I really only watch HBO and Netfix.  Then I am addicted to some of the CBS shows like GoodWife and Madam Secretary.  Hook up an Amazon antenna for local shows.  They say the downside is not being able to record shows, then bring back your VCR?  Well, if that is a problem then subscribe for an additional 5/month to CBS.  What I liked is the streaming of Netflix.  Through my TV app, it would stop between episodes, this will tee up the next one.  How nice.  The remote is nice and portable.  Now, if I could just program my TV and Audio system to it too, no more extra remotes.", "verified": true, "helpfulness": "0/0", "author": "Thrifty Shopper"}, {"rating": 5.0, "review": "Great!! I get to watch movies and programs which I pick out at my leisure. It's taking me awhile to learn everything it is capable of because I'm busy with work", "verified": true, "helpfulness": "0/0", "author": "sleuth watcher"}, {"rating": 3.0, "review": "I'm getting charged Over Wwe Networkand a bowling game and I believe a movie.!! I did not order prime to give me a 30 Day free trial use..!!!!MY son is handicapped and we haven't even had a chance to even go through any of the Fire Tv.. The day it got hooked up I got charged for things I never even seen..Just to look forward to a great thing to look forward to use.. But I may have to return it since it works even though we have only stopped on a movie to Read its contents about it.. I NEED TO HAVE THESE BILLING CHARGES TAKEN OFF MY CREDIT.!!  I even got an email about earning a dollar for something which made me completely confused..l DID NOT ORDER PRIME OFF AMAZON FIRE TV. PLEASE NOTIFY ME OF THIS ISSUE TO TAKE CARE OF IT!!! THANK YOU JAMMICE MCFALL.", "verified": true, "helpfulness": "1/2", "author": "jammice mcfall"}]