[{"rating": 5.0, "review": "Great box, very fast in browsing and solid streams", "verified": true, "helpfulness": "0/0", "author": "Darek Bialasz"}, {"rating": 5.0, "review": "Awesome device. Good Price", "verified": true, "helpfulness": "0/0", "author": "good"}, {"rating": 1.0, "review": "I liked the way the remote worked. The program was real easy to navigate. I was dissapointed because there are so many movies that you have to rent or buy. I was under the impression that there were more movies included for free. Plenty of TV reruns to watch. The good news is that Amazon was very good about taking it back and refunding my money, love Amazon.", "verified": true, "helpfulness": "1/3", "author": "Larry Hawkins"}, {"rating": 5.0, "review": "I have been very happy with this device so far. It's hard to believe so much comes from a box not much bigger than the palm of my hand. Probably what we use it for most is Netflix, and the interface is identical to the one on the XBox 360, which is the best one I have seen so far on any device -- better than our smart TV's app, better than Wii by far, better than Kindle or phone for the screen size alone. I am looking forward to exploring Amazon's Prime service more now that they seem to have made that interface much better than any of its past iterations.The games are very diverse and fun. They won't rival the offerings of a gaming console and therefore probably won't satisfy hardcore gamers, but for the rest of us, it's all we'll need for a long time and the price of the games alone -- $1-5 versus $65 for a console game -- makes it much more interesting to me.", "verified": true, "helpfulness": "0/0", "author": "Mat"}, {"rating": 3.0, "review": "It is a great system, however it's offering is so similar to other things.  I found out that I had to purchase a blu ray player and have discovered that most of them now do the same thing that the fire does... and it plays blu rays.The only other thing that I find mildly frustrating is that the amazon voice feature is constrained to Prime/Instant Video selections, it would be great to have it be able to voice control things like \"Play Netflix\" or \"Play Hulu\" even if you can't find stuff inside it.", "verified": true, "helpfulness": "0/0", "author": "Christopher J. Williams"}, {"rating": 5.0, "review": "Found the installation and use of this product easy.", "verified": true, "helpfulness": "0/0", "author": "Steve Plemons"}, {"rating": 5.0, "review": "Awesome and easy. I bought as a gift and my mom and sister love it.", "verified": true, "helpfulness": "0/0", "author": "Spidey"}, {"rating": 5.0, "review": "My first experience with streaming video, very easy to set up, make sure you have an HDMI port open somewhere.", "verified": true, "helpfulness": "0/0", "author": "Richard Mason \"Dragondawg\""}, {"rating": 4.0, "review": "The Amazon Fire TV box works really good, fast and reliable.The only detail I believe should be considered is a turn off bottom or switch, I did not find any.Thanks", "verified": true, "helpfulness": "0/0", "author": "rjjdsanchez"}, {"rating": 5.0, "review": "Would recomend to anyone. It's awesome!!", "verified": true, "helpfulness": "0/0", "author": "Irishkid"}]