[{"rating": 3.0, "review": "I like the overall idea and ease of use is moderately friendly.  Disappointing to see some of the heavy pricing on many of the respectable titles of interest.  Seems to fall short on Prime member content.  Can't even get \"The Simpson's\" episodes with being a Prime member!  I believe it is $2.99 an episode last I checked...which is a little steep for something that has been on free TV for so many years!  Overall content available seems adequate enough...but certainly comes at a premium price (on top of Prime membership as it is).", "verified": true, "helpfulness": "1/1", "author": "John P."}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Quang"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "Teresa Watford"}, {"rating": 5.0, "review": "This thing is literally a Magic Box! I was surfing craigslist one day and heard about this as a cable alternative, when it's side-loaded with certain programs. Figured I would give it a try. First off, Amazon Primes streaming service works better then Netflix or Hulu. That may seem like a suck up exaggeration to Amazon, but it's entirely true. The load time for videos on Prime is easily twice as fast, and the content is more pertinent to me. The ability to modify this device is unparalleled and Amazon provides the necessary application files/guides in order to tweak the box to your liking. The ability to play games off of it, most of them free to play, is another plus. The minimalist design of the remote is a long ways off of the average TV remote which almost needs a map to read. Most importantly all the applications I side-loaded onto it did indeed replace my cable, I bought 3 of these to cover my house and have bought one for all my friends and family.", "verified": true, "helpfulness": "0/1", "author": "Chagrins Cos"}, {"rating": 4.0, "review": "I'm still getting used to the switch from cable. But so far it's been great.", "verified": true, "helpfulness": "0/1", "author": "kimberly"}, {"rating": 5.0, "review": "It was a snap to install and it was working right out of the box.  I'm using it on an old HDTV and functionality is just what it needed.", "verified": true, "helpfulness": "0/1", "author": "Orlando Garcia"}, {"rating": 5.0, "review": "I can not believe how very easy it was to set up! I had my son (in his 20's) right by me in case I needed help.I DIDN'T, can you believe it? I really like being able to access all my music, movies, tv shows from Amazon.I primarily wanted the Amazon access because they have so much to offer I don't feel as though I need theother things like Netflix, Hulu, etc. It has been great. I bought another one as a Christmas present and can'twait to share.", "verified": true, "helpfulness": "0/1", "author": "Mish"}, {"rating": 5.0, "review": "This thing is incredibly powerful - it out preforms my HTPC (home theatre PC) on a regular basis. Side load Kodi, and get a fully customized media experience!", "verified": true, "helpfulness": "0/1", "author": "Diablo666l"}, {"rating": 4.0, "review": "works well", "verified": true, "helpfulness": "0/1", "author": "Thomas Walker"}, {"rating": 5.0, "review": "How did I not know how simple this could make my tv veiwing! Love this,  so easy to set up, plug and go! And now I can voice search and no more lengthy typing out title only to accidently bypassing with controller. This is excellent! No more blue ray players just to have Web tv!", "verified": true, "helpfulness": "0/1", "author": "Johnnie B. Chesser \"Johnnie B\""}]