[{"rating": 1.0, "review": "First off, when I \"casted\" anything my TV would change mode to DVD. This was annoying but I learned to just change it back to the correct setting. Today I watched 2 hours of YouTube then my screen went pink. When I got up thinking I needed to cycle the power I was amazed to see the dongle had MELTED and was hanging at a 45 degree angle off the HDMI (I plug into a Yamaha receiver video controller.This thing is buggy at best and a fire hazard at worst. I will be reporting it to [...] in hopes to get it recalled.", "verified": false, "helpfulness": "0/1", "author": "Earth bound misfit"}, {"rating": 5.0, "review": "Love it. No longer need to log on to XBOX Live to watch Netflix. Cheap. Easy to install. You can't beat the price for what it does.", "verified": true, "helpfulness": "0/1", "author": "Scott \"...I Review Stuff...\""}, {"rating": 5.0, "review": "I don't need all the extras that Roku offers, especially the music channels (I have a Sonos for that). Most of my online TV/Movie watching is Netflix and HBO Go, so this works great.", "verified": true, "helpfulness": "0/1", "author": "sazhazman"}, {"rating": 3.0, "review": "Works as advertised but be warned, if you have 5GHz WiFi that you want to use it with it doesn't work.  I actually have to downgrade my phone/tablet/PC speed to use.  If Google adds this feature I'll try it again but for now I'm not wasting my time.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have a couple laptops and Cell Phones connected to this device and they all work great.  I've watched a few movies streaming from a laptop. So far only one would stall for a second here and there simalar to buffing.  Overall, awesome product.  Turns any TV into a smart TV.", "verified": true, "helpfulness": "0/1", "author": "Jasdav1"}, {"rating": 3.0, "review": "It will not work while streaming from a wireless device on the same router. I don't know what type of router other use, but this didn't work for streaming from my iPad to the Chrome device. If you use your wireless router for everything in the house, and you try to stream with an iPad to this thing, good luck. You better have an excellent wireless router for this use. I stream from my PC which is physically plugged to my switch and then use the wireless to stream to the Chrome device, that's the only way this will work on my network. Oh, and I've been in IT for 25 Years, K.", "verified": true, "helpfulness": "1/2", "author": "Jenna"}, {"rating": 4.0, "review": "This device comes nicely packaged with all the necessary parts and then some.  As long as know your wi-fi's password it will be easy to set up.  But if you think you're going to be able to stream TV shows which you've downloaded from iTunes on to your iPhone - think again.  You can only stream from apps on your phone (or laptop) and I am still in the process of trying to figure out how to get the TV show into an app so I can see it.  I am going to keep it as it may come in useful in the future but I'm a bit disappointed I can't see the TV show I downloaded from iTunes now.Ok - I'm back again.  I downloaded the Netflix app to my iPhone and lo and behold I was able to watch movies from Netflix on my TV.  Kinda dazzling.  I wish I had had this when I had to watch \"Orange is the New Black\" on my Kindle.  I hope they do improve it where you can watch TV shows you've downloaded from iTunes onto your computer or iPhone.", "verified": true, "helpfulness": "0/0", "author": "M. James \"Crow Passion\""}, {"rating": 4.0, "review": "It's pretty good, you need to have a decently fast internet connection for it to work great. There is a little bit of a delay when switching songs or videos. There aren't too many apps out to support it. It is a little bit difficult to start and stop using it while trying to switch between videos or music.", "verified": true, "helpfulness": "0/0", "author": "Dmack"}, {"rating": 5.0, "review": "Awesome buy for anyone that is a tech person. Able to broadcast your Chrome Browser to TVAlso small FYI To buyers: They are further developing this it will only get BETTER so buy it now while it's cheap", "verified": true, "helpfulness": "0/1", "author": "c0nker TM"}, {"rating": 5.0, "review": "Easy setup, easy to use. Device looks great, and packaging for the device itself was top notch. I will SO be getting another for my next tv.", "verified": true, "helpfulness": "0/1", "author": "Andrew David Christensen Daniels"}]