[{"rating": 5.0, "review": "Came very fast! Love it, easy to install and use  So many shows to see, can't say enough good about it!!", "verified": true, "helpfulness": "0/0", "author": "Debra Shea"}, {"rating": 5.0, "review": "Best purchase this year!  So much easier than streaming thru Blu-Ray player. Only regret is not being able to use voice control anywhere except Amazon Prime. Great being able to use closed captioning that was not available thru DVD", "verified": true, "helpfulness": "0/0", "author": "psreview"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Keith McDaniel"}, {"rating": 5.0, "review": "I already have 2 Rokus but needed another for a new TV that did not have Amazon on the \"smart list.\" This was a great choice over the Roku. So much faster than the Rokus response wise. I haven't used the voice command yet. I always forget it's there. Hopefully the Amazon Echo will control it since I placed them in the same room.", "verified": true, "helpfulness": "0/0", "author": "Judo"}, {"rating": 3.0, "review": "Amazon compares Fire TV to Netflix but I have found cost wise per movie to not be as good for movies as Netflix.  Also Amazon needs to isolate the free stuff from the paid stuff on Fire TV.  I do like the verbal search feature on the remote because it saves the frustration of having to type in a search on remote which is not designed well this purpose.", "verified": true, "helpfulness": "0/0", "author": "Thomas Bobo"}, {"rating": 1.0, "review": "We did not like it. Was not what we expected. We returned it to best buy", "verified": true, "helpfulness": "1/4", "author": "SUE A FOUTS"}, {"rating": 5.0, "review": "Best little box out in the market..Thumbs Up!!", "verified": false, "helpfulness": "0/0", "author": "JuanCarlos Urrego"}, {"rating": 5.0, "review": "This box is amazing.  I have two of them.  Everything about it is user friendly.  When my contract with comcast is up, I'm ending cable.", "verified": true, "helpfulness": "0/0", "author": "James A. Gill"}, {"rating": 5.0, "review": "Absolutely wonderful! Extremely user friendly!", "verified": true, "helpfulness": "0/0", "author": "Megan Elizabeth Kirby"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Monique"}]