[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "randy cave"}, {"rating": 5.0, "review": "It is perfect for pairing with YouTube specially if you have a pretty old LCD TV.", "verified": true, "helpfulness": "0/0", "author": "Hassan Radwan"}, {"rating": 2.0, "review": "I am unable to use this as the public wifi at the nursing home I reside at does not work reliably with this device, I get a notice that I am connected but no internet available, yet my iMac sitting 2 feet away is connected to that same wifi. I had to give the device to someone to use at their home.", "verified": true, "helpfulness": "0/3", "author": "Scott W. Porter"}, {"rating": 4.0, "review": "The one issue we had was some static cross talk some of the time whe casting the Windows machines, but this may have had to do with the 10 devices implemented on one network.", "verified": true, "helpfulness": "0/0", "author": "edevic"}, {"rating": 5.0, "review": "works great to cast phones to work tv", "verified": true, "helpfulness": "0/1", "author": "zao cor"}, {"rating": 1.0, "review": "Does not work on public wi-fi", "verified": false, "helpfulness": "0/4", "author": "Darryl Feth"}, {"rating": 5.0, "review": "Great way to mirror any of your portable Wi-Fi devices directly to your television.", "verified": true, "helpfulness": "1/2", "author": "JohnnyU2"}, {"rating": 5.0, "review": "Great Product !!!", "verified": true, "helpfulness": "1/2", "author": "Alejandro Fenzi"}, {"rating": 5.0, "review": "Great I do not have to pay for cable", "verified": true, "helpfulness": "0/0", "author": "Orlando Hutchinson"}, {"rating": 5.0, "review": "This has been a very good edition to my collection. With this piece I am now able to stream the contents of my computer to my TV.As of yet, I've not had a single problem with the Chromecast unit. That's not to say I haven't had problems with various parts that work with Chromecast, just not the unit itself. I would recommend this to anyone who wants to be able to stream content from their computer to their TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]