[{"rating": 5.0, "review": "I love this thing. I use this over my PlayStation to watch Netflix and Google Play movies.", "verified": true, "helpfulness": "0/0", "author": "Wade Wilson"}, {"rating": 5.0, "review": "Got it for my boyfriend and he loves it! Can stream anything from your phone to your TV! I need to get one for myself too.", "verified": true, "helpfulness": "0/0", "author": "rabia hasani"}, {"rating": 5.0, "review": "Boss as always.", "verified": true, "helpfulness": "0/0", "author": "Jordan Wean"}, {"rating": 4.0, "review": "We use this quite a bit. The only problem is sometimes its a bit slow and laggy.Nothing that can't be fixed by restarting some stuff.", "verified": true, "helpfulness": "0/0", "author": "Jesse M"}, {"rating": 5.0, "review": "Brand new and works great", "verified": true, "helpfulness": "0/0", "author": "Corey Clark \"Corey Clark\""}, {"rating": 4.0, "review": "Sometimes i cant pick the chrome cast up on any network have to reset it a couple of times til it works.", "verified": true, "helpfulness": "0/0", "author": "jason allen absher jr"}, {"rating": 2.0, "review": "Chromecast sometimes works, and when it does, it's great.But it often doesn't. I bought it specifically so I could use it to stream videos from my computer browser - I've got a DVD player and a PS3, which takes care of netflix, hulu, youtube, etc. However, as often as not, when I try to use the chrome cast, I get horrible lags that make what I'm trying to watch essentially unwatchable, even when I've set it to standard rather than high. It's fine on my laptop, so that's not the problem. The lagging is incredibly frustrating, and because of it, I really wouldn't recommend chromecast - we have definitely not gotten our money's worth.", "verified": true, "helpfulness": "0/0", "author": "Jane S"}, {"rating": 5.0, "review": "Love it. I can cast anything on my browser to the TV. I wish it allowed me to cast anything from computer (not only browser) to the TV", "verified": true, "helpfulness": "0/0", "author": "Ankit"}, {"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/0", "author": "Sonia García"}, {"rating": 5.0, "review": "Excellent choice", "verified": true, "helpfulness": "0/0", "author": "Juan Carlos R"}]