[{"rating": 2.0, "review": "I'm not overly impressed with this product. Right now all it broadcasts is Youtube and Netflix despite saying it will broadcast other sites such as hulu.com.  It would nice to be able to pause/play with a remote and not from the actual netflix website. I guess it's nice to use to watch on TV rather than laptop but that's it's only positive right now.", "verified": true, "helpfulness": "1/1", "author": "Jeanne Ronemous"}, {"rating": 5.0, "review": "If you don't have a Smart TV you HAVE to have this.  Even though it's very portable I bought one for both of my TV's.  Does not come with the cords so check into that first cause you'll want to use it the first night you get it.  Can control from your smart phone, ipad or kindle.  AWESOME!!", "verified": true, "helpfulness": "0/0", "author": "melissa halvorson"}, {"rating": 5.0, "review": "This is a very neat little gadget, It came with easy instruction to follow to install the chrome cast. Its amazing what you can watch with it.", "verified": true, "helpfulness": "0/0", "author": "Dawn Ferris"}, {"rating": 5.0, "review": "Before i buy this product i know that it will give me the best of watching experience. I have a different streaming device but can not playback YouTube videos so this one is perfect for me. Setup is very easy, just plug and input wifi password then you're in.", "verified": true, "helpfulness": "0/0", "author": "ARL"}, {"rating": 4.0, "review": "I purchased so that I could use it with my laptop and netflix.  I was not disappointed with the quality and it streams really well.  Like all google products, you need to use the Chrome browser.  I can stream Youtube videos to my TV but it stays in browser mode and it just looks like a giant computer screen.", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 4.0, "review": "Great for streaming Netflix, Youtube or Google Apps.  Streams other apps such as Amazon Prime, ABC.com, etc, poorly with interruptions in streaming.", "verified": true, "helpfulness": "0/0", "author": "Diane G"}, {"rating": 1.0, "review": "Update- I gave up on this and dropped it to one star. After several software updates, it has just become unusable. I don't know if it is the fault of Google's iOS apps or the devices themselves, but I just can't get it to work consistently. We stopped using the one commercially a few days after we started because we couldn't get it to work for more than an hour or two at a time and got tired of resetting it. The one I was using at home won't stream most of the time, and when I can actually get something to play on it, the stream usually dies before it can even get through a half-hour episode on Netflix. AppleTV, and now a FireTV Stick work perfectly well in the same location over the same WiFi connection. If it works for you, especially with Android devices- great! If you are new to streamers and don't have an Android tablet or smartphone- you may be disappointed. Check out stand-alone streamers like AppleTV, FireTV, or Roku.I left my old review for reference only...First- I have two of these. One is used in a guest room at home, while the other is used in a commercial environment to drive a HDTV used for internal announcements (for now).I only use Apple products (iOS and OS X) at home. At work- we currently use a PC with the Chrome Chromecast plugin.I'll start with the home environment:When it works, it is great. I've had recurring issues connecting to it though, and re-connecting after locking a device. I mostly just use it in the Netflix app, so I suppose the blame could be pointed at them, but since this was a \"flagship\" app- I expect better. After the Chromecast starts- it often takes a couple of re-starts of the Netflix app to get it to show up. It rarely shows up when I first launch the Netflix app. I've also occasionally had to restart the Chromecast to get it to show up as an option as-well. I've also had problems re-connecting to control the Chromecast after playback has started but the device goes to sleep. Just to try to illustrate this...I will wait until the Chromecast shows it's online (in its screen-saver).I'll start Netflix on my iPad or iPhone, and start playing a movie or TV show. More often than not- the Chromecast icon won't show up.I'll have to force-quite Netflix, start it again. I may have to repeat this a couple of times.Eventually- the Chromecast icon will show up and I can play the show via it on the HDTV, controlling it on the device.Now, eventually my device will go to sleep/lock to save power. The show will continue playing on the Chromecast. (This is good.)If I open up Netflix on my device again- there seems to be about a 50% chance that it won't show the Chromecast controls or even acknowledge that the Chromecast is there again.Sometimes- I can restart the app and reconnect to the Chromecast. Often the only way to actually shut down the show streaming via the Chromecast is to power it off.I believe all of this is due to poor Wifi management stability on the Chromecast.I've used it on an iPhone and two different iPads, all have the same stability issues.Similarly- we have problems with the one used commercially as-well. It frequently disconnects from the WiFi network, or from the Chrome browser we show the content in. The Chromecast itself is line-of-sight to a commercial WiFi hotspot and less than 10' away from it. So- the display we are trying to drive more-often-than-not shows the Chromecast screen saver, and not the browser content. The browser content is on a dedicated PC with no power management or even screen-saver turned on. It is on the same WiFi network.On a related note- we found the Chromecast plug-in for Chrome on Mac to be completely worthless. It will often not even show the Chromecast, and when it does- it disconnects within a minute every time. We can't get anything to stream to it from a Mac for more than a few seconds. iPads and iPhones work fine, except they have the same stability problems for the initial connection and control interface as the home unit does. Streaming from the Chrome browser on iDevices is currently not supported, so that isn't an option.I'm sure it probably works flawlessly on a newer Android device, but if you have Apple products- you are better off with an Apple TV, and I can't recommend it if you want to stream from a PC Web browser. This is a relatively new product, and I'm sure they will introduce stability enhancements over-time. You can't beat it for the price, obviously, which is why I am still giving it three stars. When it is actually streaming- the video quality seems to be on-par with other streaming media players. At this point- it is definitely not a substitute for more-advanced streamers like AppleTV or Roku. That may change, and if I notice an improvement- I'll update this review. As of now- we are pulling it from the commercial install and switching to a long HDMI cable. (We were trying to minimize cables, and though the Chromecast would be a great solution.) At home- I will continue to use it, and just deal with the disconnects for now. If I used that room more often- I would swap it out for an AppleTV or Roku.", "verified": true, "helpfulness": "0/0", "author": "Wolf I. Butler"}, {"rating": 5.0, "review": "excellent this product. recomended! Chrome cast for home, and excellent for youtube and netflix.  it's better that apple tv jejeje", "verified": true, "helpfulness": "0/0", "author": "Jan Garcia"}, {"rating": 5.0, "review": "The first thing I have to say is that it is your responsibility to learn about the product and understand what it does and doesn't support. That being said our tech genius friends across the internet have found several workarounds and the Chromecast SDK just recently went public (aka the manual for app developers to use to program in Chromecast support), so we can expect full support for many apps in the coming months.I use it for mostly Pandora and Netflix and love that I can just grab my phone off the table and have full access to my various libraries to pick and choose while whatever it is keeps playing on the screen.To the college students: this thing is awesome for parties! Unsecure your wifi network for the night then create and share a public playlist for anyone to add to. With this I can have music videos playing on the TV while my A/V system bumps (and people aren't always stopping the music to switch phones).", "verified": false, "helpfulness": "0/0", "author": "Coggeshall"}, {"rating": 5.0, "review": "The Chromecast is a high quality streaming product, realize though it doesn't stream FROM your device, but from the \"Cloud\" or just the internet if you want to think of it that way. Works really well with Plex Media Server and the Plex App!", "verified": true, "helpfulness": "0/0", "author": "Fabian B."}]