[{"rating": 1.0, "review": "Didn't do Amazon prime.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this as a gift for my girlfriend, and she absolutely adores it. It was easy to set up, and worked well right out of the box. With some extensions in your web browser, you can easily cast local files on your computer as well as online streaming media. The feature to cast your Chrome browser page is also neat, although it needs a little tune up. Overall, great deal and I would suggest this over and over again.", "verified": true, "helpfulness": "0/0", "author": "Cody Swaney"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Michael J Ramos"}, {"rating": 2.0, "review": "Roku updates channels... Chromecast doesn't...", "verified": true, "helpfulness": "0/0", "author": "PATRICK W OBRIEN"}, {"rating": 2.0, "review": "It freezes a lot when using Netflix when other devices I use to play Netflix don't. Very frustrating.", "verified": true, "helpfulness": "0/0", "author": "Gregory D Reed"}, {"rating": 5.0, "review": "They have hot dogs on a stick, Snickers bars on a stick, and bananas on a stick, but none you will love more than a Google Chromecast HDMI stick.  This thing is incredibly awesome.  It hooks up your T.V. to anything that is online and I mean anything! Plug it into your T.V. download the Chromecast app to your computer, tablet, phone, etc. register your chromecast and your app and you are all set.  Really simple setup that took 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "Jason M. Eiting"}, {"rating": 5.0, "review": "I have three Chromecasts. My router is not on the list of approved routers but works fine. It could not be easier to set up. Plug it in, open the Chromecast app on your phone/tablet or laptop. Enter your wifi password and the Chromecast will show up. I would vote for Chromecast to be the product of the year.", "verified": false, "helpfulness": "11/12", "author": "W. Lozano \"Tech Kayaker\""}, {"rating": 5.0, "review": "Amazing product, easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Ahmad Daoudi"}, {"rating": 1.0, "review": "Probably the biggest piece of shiot device I ever bought from google!  Its a sucky device at best! It is constantly disconnecting and needs to be reconfigured including the entire setup process!I would definitely suggest waiting for an update or trying something different like the Amazon stick.", "verified": true, "helpfulness": "0/1", "author": "Thomas A. Brown"}, {"rating": 5.0, "review": "We use this several times a week to cast either from an iphone or a computer. Love it. Only once has there been some YouTube content which did not allow for remote playback - which is a youtube restriction.", "verified": true, "helpfulness": "0/0", "author": "K. Reynolds"}]