[{"rating": 5.0, "review": "Meets all expectations.  Terrific clearness of pictures and it is much faster that my previous model.  I shall be using this unit for a long time.", "verified": true, "helpfulness": "0/0", "author": "John C. Jordan"}, {"rating": 5.0, "review": "We love the Amazon Fire TV!  I bought three more for Christmas presents & they love it as well!  Definitely worth buying.", "verified": true, "helpfulness": "0/0", "author": "abilenegirl"}, {"rating": 5.0, "review": "All tech aspects were great. I would like to know if more channels will be available. PBS and FoxNews in particular.", "verified": true, "helpfulness": "0/0", "author": "Kevin Lynn"}, {"rating": 4.0, "review": "When I first received it, Netflix was crashing frequently if I left it open. Recent updates seem to have eliminated or at least greatly reduced this. On occasion I'll still get a \"can't connect to Netflix\" error, but closing the app and reopening usually seems to make it go away.", "verified": true, "helpfulness": "0/0", "author": "dragon788"}, {"rating": 5.0, "review": "Great!  Couldn't be happier and much better than a cable bill each month. Thanks.", "verified": true, "helpfulness": "0/0", "author": "jd"}, {"rating": 5.0, "review": "Great product overall. Small yet very powerful. Mainly used to run XBMC / Kodi and it works extremely well with even the more intensive themes. The remote is great; simple but very functional. I love the fact that they opted for a Bluetooth remote instead of an IR. Being able to just hit pause without the need to point at the device is very convenient. Would be even better if I ever decided to get Amazon Prime. The fact that it uses a Bluetooth remote allows you to place it somewhere out of view.I've never noticed it getting hot under utilization which also helps with its placement if you want it out of sight. With that said, the Fire TV is so small and easy on the eyes that you could easily have it out in view and its barely noticeable. The only thing you can notice most of the time is the small dim white light that lets you know when the device is on.", "verified": true, "helpfulness": "0/0", "author": "Daniel Lucas"}, {"rating": 3.0, "review": "The movies that are \"free\" are generally pretty old.  It's nice to have the option, but  Xfinity with Comcast, which we already have, is pretty much the same.", "verified": true, "helpfulness": "0/0", "author": "J. White"}, {"rating": 5.0, "review": "Very Easy to set up and I am not technical.  Connected within 5 minutes of opening. Plugged into my flat screen TV with no problems. The Amazon Fire TV picked up my wireless internet quickly.  I am a Prime Member and was able to start watching movies on Amazon.  I also have a Netflix account which I was able to have access to instantly. Pandora is great for music (I haven't tried to use the Amazon music yet)  I also ordered HULU plus- but don't use it much- so will probably be cancelling.  The remote control is very easy to operate... a little small...but user friendly.  I also love the voice command - I say what I want and the Amazon Fire TV finds it.. You see the icons for HBO and ESPN which are not accessible unless you have an account with a cable company- which Direct TV is NOT one of the ones on the long list ( I did recently hear that you may be able to purchase HBO go on an individual basis in a few months)...I purchased this because I will be cancelling my DIRECT TV after the Super Bowl (want to be able to pause and rewind ) and wanted to get a feel for it.  On a side note I also purchased a inexpensive RCA antenna here on Amazon for about 15.00 and all my TV's now get great local TV with a wonderful picture.  So Amazon Fire with a pair of \"rabbit ears\" will save my over 100.00 a month...", "verified": true, "helpfulness": "1/1", "author": "michelle majano"}, {"rating": 5.0, "review": "iT'S THE BEST THING EVER!  WE LOVE IT! 5 STARS", "verified": true, "helpfulness": "0/0", "author": "Ellen M Holmes"}, {"rating": 5.0, "review": "So happy with performance...", "verified": true, "helpfulness": "0/0", "author": "Kenneth M. Bowen"}]