[{"rating": 2.0, "review": "This device is incompatible with the 5 Ghz band of the ASUS Dual Band RT-N56U router, despite Google's listing of this router as compatible.  They conveniently fail to mention some details.  The standard advice available from Google and other Internet comments (Disable AP [or Client] Isolation, Enable UPNP, and other more esoteric router settings) did not solve the problem.  While it is true this router will connect at the slower 2.4 GHz band, using that band requires the device controlling the Chromecast to also be set to this slower speed.  I choose to not set my brand new Galaxy 10.1 2014 to this slower speed just so I can use this Google device, so, for me, it's unusable.  Next stop, Roku 3.", "verified": true, "helpfulness": "0/1", "author": "Ron"}, {"rating": 4.0, "review": "I love it for everything, but why do AVI files have to be such a pain? I am an engineer/IT/nerd and it drove me insane trying to figure out some workarounds for AVIs. It should have AVI support inherently IMO. Netflix and Hulu do work great though.", "verified": true, "helpfulness": "0/0", "author": "Michelle H."}, {"rating": 1.0, "review": "So mad at myself for being duped by Google. \"You can only play music uploaded to Google Play Music\"That doesn't work for 95% of the adults in this country who had tons of music before there was a cloud.So upset at myself for falling for this hype. Google, quickly turning into Apple (which is NOT a compliment)", "verified": true, "helpfulness": "5/7", "author": "Ronald L. Gibson"}, {"rating": 5.0, "review": "This is a great product although sometimes it lags i have really good internet so i'm assuming is the chromacast overall the item is great", "verified": true, "helpfulness": "0/0", "author": "Felix A. Cadena"}, {"rating": 1.0, "review": "I wish I had known first.Before purchasing go to the google chromecast setup website and see if you can initiate the set-up process.  It does not support all Android smartphones! (contrary to the advertising blurb)BTY, this is a good reason to support our valued supplier Amazon by purchasing electronics through them whenever possible to have the security of their return policy.I am not paid by or affiliated with any party to this transaction.Regards, Bob", "verified": true, "helpfulness": "3/4", "author": "Robert M."}, {"rating": 5.0, "review": "This is a cheap well thought out way to get Youtube and Netflix onto your HDTV.  It is very easy to set up and works well with the iPad and Macbook Pro", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For only 30 dollars, ChromeCast packs quite the punch! youtube, netflix, etc...so much cheaper than a Roku and HD Stream Capable!! Love this!", "verified": true, "helpfulness": "1/1", "author": "Akg2016"}, {"rating": 1.0, "review": "Does not work with 3g or 4g. Only with a dedicated connection. Make sure you check the connection type first", "verified": true, "helpfulness": "2/3", "author": "dj"}, {"rating": 5.0, "review": "It is a very cool items. Easy to set up on iphone, ipad and computers. Fun to play video and Netflex.", "verified": true, "helpfulness": "0/0", "author": "jelart"}, {"rating": 3.0, "review": "This is a case where the product comes no where close to the hype. If you want to see your Chrome browser on your TV screen - then this is the product for you - though you then have to get really close to the TV screen to read much. If you want to display you PC pictures and other content on your TV and not through your browser - then you may want to reconsider. It is possible to display your screen on the TV using this application but it is less obvious (you click a pull down in the Chromecast icon in your browser but there isn't any real instructions on that) . Also it is all in beta.The net is that it does work - just not as well as you'd think and only if you have the Chrome browser.", "verified": true, "helpfulness": "0/0", "author": "alt"}]