[{"rating": 5.0, "review": "So far we love it. Very easy to use and very fast.  Highly recommend this unit.", "verified": true, "helpfulness": "0/0", "author": "mark fallquist"}, {"rating": 5.0, "review": "Simple to install..even for a dummy. Nice and small..very compact. Love the voice search feature..highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Yoli"}, {"rating": 5.0, "review": "Amazing device, Amazing UI, Amazing software development team.I am very impressed!", "verified": true, "helpfulness": "0/0", "author": "Online Overhaul LLC"}, {"rating": 5.0, "review": "Great product.  Out of the box setup was about as easy as it gets.  Have already enjoyed a few movies  and episodes of some favoriteTV series.  Amazon Prime selections coupled with HULU Plus will save me lots of $s going forward.  Finally: home TV that makes sense...watch what you want and no more paying for programming that is not wanted / watched.A former TimeWarner and DIRECTV customer", "verified": true, "helpfulness": "0/0", "author": "B. Franklin"}, {"rating": 2.0, "review": "The remote worked one day.  I tried the 30 day free Prime membership only to find that 80% of the movies I wanted to watch weren't available.  Older movies like Top Gun, A Few Good Men, and Red October.  Lots of old stuff available that you wouldn't want to watch though.", "verified": true, "helpfulness": "1/2", "author": "Jetlag"}, {"rating": 4.0, "review": "Great performance for a reasonable price..", "verified": true, "helpfulness": "0/0", "author": "gene"}, {"rating": 5.0, "review": "The fire blows the Apple TV out of the water. It's super fast and easy to use.  Wish. I would've got one sooner.", "verified": true, "helpfulness": "0/0", "author": "Victor Lopez"}, {"rating": 5.0, "review": "Best investment ever, saving me over a grand a year over my cable bill.  My daughter only wants to watch Dora and Diego anyway so my Prime subscription with this device has us covered.  The box is much faster than the fire stick btw, so if that matters, go with the box.  The remote is also really nice, better than the stick remote, and not just because of the voice search feature, the button pushes are smoother.  I have the stick for my bedroom and travel, but I am happy we have the full box in the main tv.", "verified": true, "helpfulness": "0/0", "author": "Brian F"}, {"rating": 5.0, "review": "We are very happy with the Amazon Fire TV.  Nice to navigate with a voice command.  Easy to learn and to hook up to our TV.  Had to buy an HDMI cable and should have ordered it with the product.", "verified": true, "helpfulness": "0/0", "author": "Bobbie Ryan"}, {"rating": 3.0, "review": "It's a great gadget but I don't like that you still have to purchase whatever you want to watch", "verified": true, "helpfulness": "0/2", "author": "Enrique Meza"}]