[{"rating": 5.0, "review": "Perfect for XBMC", "verified": true, "helpfulness": "0/0", "author": "Jack T Cohen"}, {"rating": 3.0, "review": "graphics are awesome.  As a standalone it is hard to navigate - not very intuitive. I didn't use the audible nav because there is too much noise going on around our home.  A menu screen at the start that isn't as graphically laden may be less confusing.  Just a thought....", "verified": true, "helpfulness": "0/0", "author": "R. Joe Zeidner"}, {"rating": 5.0, "review": "Exactly as advertised. No games it works great..", "verified": true, "helpfulness": "0/0", "author": "dan"}, {"rating": 1.0, "review": "Everything has a price I though it was free😞", "verified": true, "helpfulness": "1/6", "author": "arturo I coral"}, {"rating": 5.0, "review": "Very easy to set up and use. Also voice search works well.", "verified": true, "helpfulness": "1/1", "author": "Critical User \"KL\""}, {"rating": 4.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Tom L. Pierce Jr"}, {"rating": 5.0, "review": "Awesome technology, blows-away my old Apple TV.  The voice activation is terrific and works every time!", "verified": true, "helpfulness": "0/0", "author": "Keitho 51 \"Captain Video\""}, {"rating": 5.0, "review": "Fantastic product! I'm dropping my regular cable and moving to just this.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I gotta say, I've had the product for under a month and while I certainly see it's charms, I'm afraid at this time and point it does not measure up for me.  Too many of the shows were maybe one or two episodes free and the then 2.99 per from there which is crazy, many of the movies were in a similar boat.  I certainly didn't mind the pricing when it came to renting movies and such, I can understand that but for TV shows I felt it fell short.  Overall the selection felt smaller than I cared for, especially in terms of what just amazon had to offer to stream.  Often times I had to get netflix or some other service to compensate for a lack of options.  A great product for sure that may have greater potential in the future but at this time, I feel it's more limited than all encompassing", "verified": true, "helpfulness": "0/0", "author": "Mikel Adurino"}, {"rating": 5.0, "review": "It is great", "verified": true, "helpfulness": "0/0", "author": "John DeCrescenzo"}]