[{"rating": 1.0, "review": "Ok", "verified": true, "helpfulness": "0/1", "author": "Terry Barrett \"Terry Barrett\""}, {"rating": 5.0, "review": "We love it!!", "verified": true, "helpfulness": "0/0", "author": "Bruce Ebersbacher"}, {"rating": 1.0, "review": "This is just an FYI post of my experience with the Amazon Fire T V box that cost me $99.00 less than a year ago. The device no longer works. All of the icons are not on the tv screen. The only thing tha appears is a blue screen. I've removed the cords from my initial set up and reversed them. I replaced the batteries in the remote. I've held down every button on the remote for s long period of time and I still end up with a blue screen or a gray screen with a notice telling me that there is no signal. I'm very unhappy about this product taking a big dump in less than a year. Oh, I forgot, I did seek out tech support and it would cost me $35.00 of the problem was fixed. I have not done this yet. Also, I haven't been able to find an 800 phone number for Amazon.Calvin James Everly", "verified": true, "helpfulness": "1/2", "author": "Calvin Everly"}, {"rating": 5.0, "review": "I like this", "verified": true, "helpfulness": "0/0", "author": "Jacqueline B."}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Tim Cejka"}, {"rating": 5.0, "review": "this is soo much better than Apple TV.  The Apple is a pan to use", "verified": true, "helpfulness": "0/0", "author": "gremlin"}, {"rating": 1.0, "review": "I'm very disappointed in this product! It's difficult to use and has no easy function to access the free stuff... that, by the way, isn't much!! I got this to avoid getting pay cable service but, after seeing how much everything I wanted to use cost and how often...its DEFINITELY NOT a cheaper alternative!! Several of the \"FREE\" apps require a pay cable service to even use them so, what's the point??!!?? I'm taking my Fire TV box back to BestBuy for a REFUND and getting AT&T; U-verse installed. If you watch a lot of TV and like watching current release movies, DONT BUY FIRE TV SERVICE...it's NOT a BARGAIN!!!! WORST OF ALL...I paid $100.00 bucks for the box, $10.00 a month for Prime membership and I \"STILL!\" have to watch mind numbing commercials between clips on FREE channels!! REALLY??!!?? STUPID...STUPID... STUPID!!!!!!", "verified": true, "helpfulness": "1/4", "author": "Allan Todd atkinson"}, {"rating": 4.0, "review": "It a perfect little unit , the only thing is I bought app from Amazon store but it is not compatibleBeside that , every thing is good", "verified": true, "helpfulness": "0/0", "author": "dung kim thai"}, {"rating": 5.0, "review": "Very Nice", "verified": true, "helpfulness": "0/0", "author": "William J. O'Donnell"}, {"rating": 5.0, "review": "use this in my living room every day! love it!!!", "verified": true, "helpfulness": "0/0", "author": "MrMaC757"}]