[{"rating": 2.0, "review": "It shows up on my laptop and smartphone setup screen, but failed to complete setup 14 times on 3 different TV's.  My wifi works fine, but Chromecast doesn't have good wifi reception.  Also, be aware that you need to use the supplied HDMI extension cable because it can't even be seen without it.  You should also know that it sticks straight out over 7\" from your TV's HDMI port when you use the short stiff HDMI extension cable.", "verified": true, "helpfulness": "21/24", "author": "Bruce Hill"}, {"rating": 1.0, "review": "Pretty useless.  Wanted to watch Amazon Prime content.  My experience is that it won't connect unless the Chromecast and the device you are streaming from are very close to the router.  Got excited when it was seen by a wired pc but chrome tab casting never showed a readable screen.  I have had much better luck with a blu ray player.  Fire Stick or Roku will be next try.  A remote would be handy.", "verified": true, "helpfulness": "0/2", "author": "Pat O \"Pat\""}, {"rating": 5.0, "review": "It was Delivered Fast And It Came Good And Everything Works Perfect I Love it", "verified": true, "helpfulness": "0/0", "author": "Malvin"}, {"rating": 3.0, "review": "For screencasting, Google supports a limited number of Android devices. Make sure your smartphone/tablet device is Android 4.4.2+ compatible and is on this list (click on the Supported Android Devices button):https://support.google.com/chromecast/answer/6059461?hl=enWhen it comes to iPad support, forget it. Its a waste of money. Google support for iPad versus Android devices is not the same. You cannot screencast from your iPad to your LCD TV. You cannot tab stream either. You can only stream from Google Chromecast apps available in iTunes.I bought this to use my iPad as a remote control and screencast device for websites. It fails in this regard.I have a 2nd Gen Moto X smartphone that works flawlessly with screen casting. But its not very useful to me as the user agent rendering is mobile specific defeating the purpose of displaying a desktop web page view onto a large screen. You can download the Opera browser onto your Android smartphone and then set the user agent from mobile to desktop. That will get you a desktop web page instead of a limited mobile looking web page on your LCD. Also a disadvantage of using a smart phone is that typing in a tiny virtual keyboard is error prone. This is why I preferred to use an iPad with a larger screen surface and bigger virtual keyboard because its easier to input and click on page links in tightly designed navigation menus.Attempting to get another Android tablet to work was sproradic. Screen casting was unreliable even with the Display | Casting | Enable wireless device set. When it did work when launching Chromecast apps, there is quite a bit of fuzzy rendering and laggy performance. This, with my wireless router being just 10 feet away. Based on this, I would not recommend using Chromecast outside those screencast supported Android devices listed above.Chrome tabbing works well from a Windows PC. I am able to screen cast to it without a problem.Outside of screen casting, regardless of actual h/w device, there is heavy reliance on the existence of Google Chromecast apps. There's a good selection here - https://www.google.com/chrome/devices/chromecast/apps.htmlFor $35, its a good deal but only if you have the right supported Android device.", "verified": false, "helpfulness": "0/0", "author": "Kerry Kobashi"}, {"rating": 5.0, "review": "Works great. Slight quality loss, but streamed everything from pc so far. Add surround sound and enjoy a million movies.", "verified": true, "helpfulness": "0/0", "author": "DP"}, {"rating": 5.0, "review": "Absolutely love this gadget.  I have had mine since they were first announced by Google and have never even once regretted it.  With the chromecast app installed on your phone and computer you can watch videos w/o a hitch.  Netflix and Hulu apps have native support and chrome will let you cast tabs or even your entire screen directly to the TV.  It's absolutely awesome.  I use several 3rd party streaming sites on my phone and have no problem at all using the chrome tab app to toss them to the TV from the phone which lets me use it like a remote control to pause, rewind, fast forward, etc.The world is my DVR with this.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer \"Kevin\""}, {"rating": 3.0, "review": "Spotty performance resulting in having to reboot on occasion.", "verified": true, "helpfulness": "0/0", "author": "Michael R Schaedler"}, {"rating": 2.0, "review": "We were very excited about using this in the house. Our children stream Netflix all the time so this was perfect idea for them to watch old rerun cartoons on our TV. The device worked great for about 4 months then it kept having to be reset. The chromecast icon appears maybe 25% of the time when viewing on our iPad or iPhone and when it does appear it just searches and searches for signal to cast barely ever playing what we selected to stream. We have spent more time resetting this, refreshing our netflix apps and phones then we have spent time actually watching/streaming movies. I thought the price of this was great but clearly we got what we paid for. Its basically a flash drive that plugs into our TV and does nothing. Would not recommend", "verified": false, "helpfulness": "0/0", "author": "WWeber"}, {"rating": 1.0, "review": "Had a very hard time making it work with my netgear wireless modem.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "ease of setup, great quality", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]