[{"rating": 5.0, "review": "very fast. interface is a little cluttered.", "verified": true, "helpfulness": "0/0", "author": "Michael M."}, {"rating": 5.0, "review": "Awesome!!  Buy it!", "verified": true, "helpfulness": "0/0", "author": "Bumblebee Tuna"}, {"rating": 5.0, "review": "enjoying very much", "verified": true, "helpfulness": "0/0", "author": "bill bochow"}, {"rating": 4.0, "review": "I have an apple tv, two rukus and just purchased the amazon fire tv.  This one is good.  I like the voice feature which the other two do not have.  The Ruku 3 has a feature that allows you to hook ear buds to the remote to listen to the tv silently.  I love that feature and wish that the amazon had that feature.  If it did, that would make the amazon my favorite of all three.", "verified": true, "helpfulness": "0/0", "author": "K. Evans \"kevans2bb\""}, {"rating": 5.0, "review": "I've had my Fire TV for six months and I must say I'm very happy with it. I use it almost every day.It's small size makes it very unobtrusive and with the Bluetooth remote it can even be placed out of sight if desired.I've been a Prime subscriber much longer than I've had the Fire TV. I watched Prime content through my TV's Internet connection and I was increasingly having problems with lag, especially during high traffic times like weekend evenings. Sometimes it was so bad I couldn't watch it. Since getting the Fire TV I very rarely have lag issues and when it happens it's limited to a small 'jerk' in the video. Almost not even worth mentioning. A vast improvement over streaming through the TV.Once in a great while when I turn the unit on it doesn't seem to work right and what I've selected won't play. I think this is more an Internet connection issue than anything else and powering the unit off and on, i.e., rebooting always clears the problem up. The user interface is well designed and easy to use. One thing I don't like about the user interface is that the textual search is very klunky and inadequate. I guess Amazon figures everyone will want to use the voice search so didn't put much effort into the text search. I, for one, don't like talking into the remote or having what I say stored in the cloud - call me paranoid. What about people who have strong accents, or don't speak English well, or have a speech related handicap? It's a minor distraction for most people but I think Amazon could have come up with a more useful text search with a minimum of effort. On the other hand, one can always go to Amazon online and do all the searching they want and then simply add anything of interest to their watchlist.I must seem conflicted, right? I've given the Fire TV five stars, yet I've written more about cons than pros. I can honestly say that the pros I've not mentioned overwhelming outnumber the cons and the cons I've found are indeed very minor. I would heartily recommend Fire TV over other streaming devices on the market - especially for Prime subscribers.", "verified": true, "helpfulness": "0/0", "author": "Just Me"}, {"rating": 3.0, "review": "Buy the stick", "verified": true, "helpfulness": "0/1", "author": "A. Vens"}, {"rating": 5.0, "review": "Love this thing. I haven't played games on it yet, but I have been watching movies like there's no tomorrow. (Old and new) Absolutely love the Prime access to movies, books, and games. I want to try flicking something from my Kindle to my tv, just to do it. It is much faster than my smart tv. Picture is great,  as well as the sound.I will probably grab up a fire stick, just for portability. Grab one, you won't regret it.", "verified": true, "helpfulness": "1/2", "author": "Marjorie Bauer"}, {"rating": 5.0, "review": "New world for us", "verified": true, "helpfulness": "1/2", "author": "Robert B. Tallman"}, {"rating": 5.0, "review": "This is one of the best gifts that I've received! 👍", "verified": true, "helpfulness": "1/2", "author": "Shirilvin Hodges"}, {"rating": 5.0, "review": "I love both Google and Amazon. Yet, need those Google apps. The frustration with Amazon is its proprietary nature of its own Appstore and that it does not fully have integrated Google Play. However, in the case of the Amazon Fire TV it has not been a draw back whatsoever. As a Prime customer and someone who wanted uses it quite often. Fire TV gives me all the streaming I need and apps I would use, plus gives a nice array of games for play with the game controllers ( which are very good ). It is simple to operate and its been very good. I almost Got the Nexus Player, but with the extra 1 gig of Ram with the Fire TV. Well, that sold me over. Overall great fun.", "verified": true, "helpfulness": "1/1", "author": "Patrick"}]