[{"rating": 5.0, "review": "Bought it for myself, but can't get it away from the wife! Have to by another one now! Anyway, easy set up and works like a charm. Waiting for Google to update it in order to have the ability to mirror.", "verified": true, "helpfulness": "0/0", "author": "Gabe Butler"}, {"rating": 4.0, "review": "I purchased the Chromecast because I wanted to cast videos (e.g., Netflix, Hulu, PBS, YouTube, etc.) from my computer’s browser and mobile devices to my TV.Here’s what I found:1. From my PC (Windows 7) this works perfectly when using my Chrome browser. The problem, of course, that controlling the action (pause, stop, change video) with my desktop is rather inconvenient. With my laptop, I need to keep the PC nearby (or on my lap) to control the action.2. Using my mobile devices (iPod Touch, Nexus 7) this task is much easier. However the problem is that, as far as I can tell, casting from the Chrome browser is not possible. Casting must be done directly from mobile apps on the device. Unfortunately, very few apps show the Chromecast icon which allows casting.  The PBS, Smithsonian, and others apps do not. Also even working apps have minor bugs. I find it difficult to disconnect with my Netflix app.I also have Roku boxes which work fine with the available channels. But, of course, you cannot stream from a browser with a Roku.", "verified": true, "helpfulness": "0/0", "author": "Prof W"}, {"rating": 2.0, "review": "I was really excited when Chromecast was announced, I thought it was an awesome idea and would make it way easier to stream things to my TV. When my Chromecast works correctly, it's mostly what I expected, but there are some major drawbacks:1) Mine doesn't work correctly for long. It seems like every time I'm ready to play another episode (through netflix or hulu, using my iPhone or iPad Mini as a remote) I have to reboot my Chromecast by unplugging the power because the Chromecast thinks it's still connected, but the remote thinks Chromecast dropped off the network. No app-side changes resolve the issue -- I always have to restart Chromecast.2) If you want to play video from your computer, good luck. The video quality is terrible when streaming from a computer. You HAVE to use a smartphone or tablet to connect to Chromecast directly through an app to get a framerate that won't look choppy.3) The device gets really HOT, enough that I'm not comfortable leaving it plugged in all the time, so you have a cord to manage, when it's not plugged in.4) The shape of the dongle means that you'd better plug it in last, or you'll have trouble plugging other things in. (I know, this one is nitpicky. It's a very minor issue.)5) If you have Amazon Prime, you can't access your prime content from Chromecast without streaming from a computer.For under $10 more you can get the Amazon Fire TV stick, which comes with its own remote, doesn't freeze up on you, doesn't run hot, and lets you access all your Amazon content. The only thing about Chromecast that's really better than the Amazon Fire TV stick is the location of the power jack. It's on the back of the dongle, where it's out of the way, while the one on the Amazon Fire TV stick is on the side, leading to wire clutter.", "verified": true, "helpfulness": "0/0", "author": "Julia W \"Julia\""}, {"rating": 2.0, "review": "This is far more effort than you would think it could be for being such a cute little device!", "verified": true, "helpfulness": "0/0", "author": "Cathy"}, {"rating": 2.0, "review": "Cool when it works. Easy to set up and use...until i discovered i couldn't hear some of the videos.When I listened to Netflix I could not hear it. I couldn't find a solution on Google's site, but the good people on reddit solved my problem. http://www.reddit.com/r/Chromecast/comments/2hy4gq/netflix_volume_too_low/You set the volume way too high on YouTube then stop casting, then start casting Netflix.So, i will give it another star, but this is not the way to create a media platform!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"xmlDave\""}, {"rating": 5.0, "review": "I Love this product, it Works very well, and is easy to install.", "verified": true, "helpfulness": "0/0", "author": "Alicia Restrepo"}, {"rating": 5.0, "review": "Best cheap streaming solution on the market, makes nerdy party time fun when everyone can toss up their own youtube from their phones.", "verified": true, "helpfulness": "0/0", "author": "Matt E Rhea"}, {"rating": 3.0, "review": "Buyer Beware!! I am very disappointed in the chromecast. It is my own fault, I should have done more research before purchasing, but I assumed that anything I wanted to stream could be streamed. That is not the case. Chromecast doesn't work with many websites that I watch things on - even if I download the chromecast casting add-ons for my browser. If I am using my ipad, there are only certain apps such as hulu plus, youtube, or netflix that work. Other apps just don't work (such as acorn). I wish I had bought Roku. Would have been worth the extra money and frustration spent on trying to figure out why I couldn't cast everything I want to watch. Shame on you google for making something that is not universal!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "MM"}, {"rating": 5.0, "review": "this is the most exciting streaming box happening since years. get  one now, you won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Alessandro"}, {"rating": 2.0, "review": "I bought this with the intention of using it instead of connecting my laptop to the TV to stream Netflix, Hulu, etc. This product does not come with a remote, which I think is the biggest complaint about it. It's a headache getting it to connect with your phone or laptop, it takes a lot more time getting your devices to find the Chromecast and it doesn't stay connected for long. As far as streaming content, it's great. With a great wifi connection, preferably one in the same room, the streaming is great. It looks way better than it does when I connect my laptop to the screen and I've gotten a lot of great compliments about the quality. I dislike that it doesn't have an actual home screen with apps and it depends solely on your device. Because if your device is low on battery, it will keep streaming but you won't be able to control it. If you can look past that, you'll be fine. It does the job and it's cheaper than buying other products. It also comes with the added bonus of two free months of Hulu Plus, and 90 days of Google Play Music. But if you're looking for something to use everyday, you might want to invest in the Amazon Fire TV Stick.Also, a fact you may want to know about this is that it does NOT connect with networks that require a splash page, like Optimum Wifi, or any networks you need to sign in. So if you rely on these networks, don't buy it because you won't be able to use it.", "verified": false, "helpfulness": "0/0", "author": "Mary"}]