[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/1", "author": "Evan Thigpen"}, {"rating": 5.0, "review": "Always connects and like the free shows for Amazon Prime members... many of the shows I have not seen before.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "nedjorg"}, {"rating": 5.0, "review": "Works better than the competitor . Get one!", "verified": true, "helpfulness": "0/2", "author": "Stree2011"}, {"rating": 2.0, "review": "Not for me as I am much to practical for this product.", "verified": true, "helpfulness": "0/8", "author": "marvin holder"}, {"rating": 4.0, "review": "I own Roku 3 and the spead of the fire and audio quality is so much better,. My daughter loves playing games on it, I recommend this over all the streaming devices out there!", "verified": true, "helpfulness": "0/1", "author": "Leroy Beaulier II"}, {"rating": 2.0, "review": "past my return date by about 45 days, now the unit not working! started with it getting hot, and freezing up. I would have to unplug it and \"re-boot\". Now it just wont work. the applications come up but when I try to select a show it just freezes. I sure hope the warranty works!", "verified": true, "helpfulness": "0/2", "author": "Kathleen Overman"}, {"rating": 3.0, "review": "The Amazon Fire is a good system.  I previously owned a Roku but am an Amazon Prime member.  I thought that when one purchased the Amazon Fire one received a free year of Prime.  That apparently was not the case.  I am having difficulty separating prime shows from pay ones.  This was not an issue on the Roku.  I am still learning the Fire's features and hope this will be one area that will get easier to use. I do enjoy the voice search feature.", "verified": true, "helpfulness": "0/0", "author": "Kathy S. Hall"}, {"rating": 4.0, "review": "Setup was a breeze. THE VOICE CONTROL MAKES EVERYTHING SO FAST AND SIMPLE. !", "verified": true, "helpfulness": "0/0", "author": "james patrick withey"}, {"rating": 4.0, "review": "We are using this with a fiber optic connection.  The movies and TV shows work great.  No pauses or blips.  Music videos not so much.  I was actually looking for music streaming and could only get the videos, even when I asked for \"Christmas Music\" it came up with only videos.  I found the music one day and the next day, only videos.  Looked for it in the same way.  Since we do not have cable or satellite, this box is awesome.  I bought the game controller, only 1 and it is not as accurate as some, but it works great with the games that are available.  So far, I have just checked out the \"free\" stuff that comes with prime.  For the price, it is a good investment if you have fast internet.", "verified": true, "helpfulness": "1/1", "author": "Big Lake"}, {"rating": 4.0, "review": "Excellent except it buffers some time and needs reboot fro. Time to time.", "verified": true, "helpfulness": "0/0", "author": "John q mezzles"}]