[{"rating": 5.0, "review": "I have a blue ray in the living room that allows us to stream Netflix and other video apps but I didn't want to buy a blue ray for every room. Well this is the best solution for that. I can stream netflix, youtube and my movies off of vudu on this very inexpensive device plus I can move it from room to room if I want to. I love it and it's easy to use.", "verified": true, "helpfulness": "0/0", "author": "Catherine Brewer"}, {"rating": 4.0, "review": "Wished they have more apps that supports the system for usage with the smartphone. Overall great, one less cable now running from my laptop to my television.", "verified": true, "helpfulness": "0/0", "author": "alex leong"}, {"rating": 5.0, "review": "Limited apps to cast with but still worth it because of the price. I bought one for the home and one for the office.", "verified": true, "helpfulness": "0/0", "author": "Dr. Cassone"}, {"rating": 5.0, "review": "Greatest product in the history of google. Thank you for making something so awesome. Can watch TV all over the house now <3.", "verified": true, "helpfulness": "0/0", "author": "Jonathan"}, {"rating": 5.0, "review": "You can think of this as an stripped down android of sorts, just like Apple TV is iOS base, this thing is a 1ghz processor with a 512 mb ram, it has limited rom.  Google is helping to add more apps everyday, easy to configure with almost any android.  Remember Plex is a great transcoding player, and very easy to configure.  Doggcatchers is almost finished developing Chromecast support.", "verified": true, "helpfulness": "0/0", "author": "Michael Chang"}, {"rating": 5.0, "review": "Its an amazing product from Google, especially for those who want to make their non smart TV a \"SMART TV\"I use it to stream movies, music and basically my entire media from my IPad, pcs, laptops and mobiles.Its a bang for the buck!", "verified": true, "helpfulness": "0/0", "author": "JOHN S."}, {"rating": 5.0, "review": "Love Google Chromecast HDMI Streaming Media Player - best product everyou can play what you want in your tv", "verified": true, "helpfulness": "0/0", "author": "Ali AlManqur"}, {"rating": 2.0, "review": "Works well for what it \"can\" do, but I'm disappointed it cannot mirror iPad or iPhone operating systems.  I hope Google does something about this soon.", "verified": true, "helpfulness": "1/1", "author": "HowardG"}, {"rating": 5.0, "review": "Good value. Works really well with all our devices and tv. Wish there were more apps. But so far, it has been very cool to have", "verified": true, "helpfulness": "0/0", "author": "vend"}, {"rating": 1.0, "review": "I expected more from Google. The company started to decline a while ago. This is a scam, it just doesn't work. Horrible picture quality, impossible to stream from Amazon Prime or Hulu. Stick to your Roku or try the new Amazon Fire TV. So dissapointed!", "verified": true, "helpfulness": "1/2", "author": "zealep"}]