[{"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 3.0, "review": "It works fine, but I was expecting a little more from it.It is great for sending videos from the phone, iPad or computer to the TV, but I expected it to be able to receive information as well, like share screens or present ppts.So, it works great for what it is made for, but it could have been made for a couple of more things.", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Kelsey Chandler"}, {"rating": 5.0, "review": "just what I wanted", "verified": true, "helpfulness": "0/0", "author": "Linde2"}, {"rating": 4.0, "review": "I like the Chromecast very much and it will get it's 5th star when more channels are added. So far only HBOGo is available and I would like to see all of my pay channels through the cast. There are some rather random music/video/sports channels on it now, but I am a movie watcher, and prefer to watch something without interruption.The best part is I have gotten rid of a cable box....Woo-Hoo!!", "verified": true, "helpfulness": "0/0", "author": "Sondra Haskins"}, {"rating": 4.0, "review": "Works great with netflix but having buffering issues with hulu+.. overall it was a great product and worthy purchase..", "verified": true, "helpfulness": "0/0", "author": "tortfeasor"}, {"rating": 5.0, "review": "simple and useful.", "verified": true, "helpfulness": "0/0", "author": "Julian Blomberg"}, {"rating": 5.0, "review": "Very good.", "verified": true, "helpfulness": "0/0", "author": "Lauro Rebouças de Oliveira Neto"}, {"rating": 2.0, "review": "Didn't work with Comcast Xfinity. Comcast wasn't very helpful. I'm not very good with getting new gaggets to work. I just put it on a shelf to hopefully use later.", "verified": false, "helpfulness": "0/0", "author": "S. Caff"}, {"rating": 3.0, "review": "Got this to replace an Apple TV.  Not terribly impressed so far. Probably going to.have to break down and get Amazon's version.  With my Prime membership, all I want to do is stream movies on my tv", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]