[{"rating": 1.0, "review": "not as easy to navigate as I would have thought. should have a short instruction pamphlet with it. Also it seems there are an awful lot of little charges in it to view certain things", "verified": true, "helpfulness": "0/2", "author": "paul"}, {"rating": 5.0, "review": "i love it!", "verified": true, "helpfulness": "0/0", "author": "gina cepeda"}, {"rating": 3.0, "review": "So far so good. Programs start almost instantly, great picture and sound. Routed through my Sony receiver via Hdmi and have had no issues. Didn't take long to get used to the Ui, voice search works very well on Amazon only for me. Only other streaming service I use is Netflix and within that app voice always searches Amazon. My one gripe is with Hbogo, comcast does not support FireTV, no real surprise there.Update: It uses way to much data. I don't use a screen saver so that's not the issue. Used over 3gb while I was asleep! Have resorted to unplugging while not in use. I'm guessing it's the predictive feature, can find no way to turn this off.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "I love this  compared to Apple TV, Sonny and WD's. I have them all.", "verified": true, "helpfulness": "0/0", "author": "Rouben Simonian"}, {"rating": 4.0, "review": "Nice really Nice", "verified": true, "helpfulness": "0/0", "author": "solid"}, {"rating": 1.0, "review": "This unit was bad. Called and was connected to Amazon's electronic tech. Said the problem was my Vizio VP-422 was incompatible with Fire TV. You would think if this were true (which it isn't) a list would be needed of compatible TVs. More than likely they knew that the unit was bad and just wanted to get me off the phone. The only thing required on TVs is an HDMI port. That's it. Went to Walmart purchased a Roku and it was bad. It wouldn't take my passwords. Returned it and took home the Chromecast. Being $15 dollars less than the Roku and having to use your phone for a remote left me wary. I was wrong. No problems whatsoever. It turns out that the best part about the Chromecast is being able to use your phone or tablet for a remote. No hunt-and-peck type of input like on the Roku remote. It doesn't tie up your device. It worked the best for my needs. So if it were me, and to do it all over again I would definitely stay away from refurbished.", "verified": true, "helpfulness": "0/1", "author": "R. Bodkin"}, {"rating": 5.0, "review": "+ Nothing else is this fast. While Roku 3 impressed the world, this raises the bar dramatically. With a quad core processor and 4 times the memory of any other streaming product, it speeds through menus, boots quicker, starts videos quicker and honestly has the muscle to not struggle with higher end resolutions and surround sound like other boxes can do at times. The best way I can explain it, you will have extra hours at the end of the year because this box is THAT much faster.", "verified": false, "helpfulness": "0/0", "author": "Tasha M"}, {"rating": 4.0, "review": "Great device, unfortunately you really need a prime account to get the most out of it", "verified": true, "helpfulness": "0/0", "author": "Horobi"}, {"rating": 2.0, "review": "I can't figure out how to use it.  There were no instructions with it.", "verified": true, "helpfulness": "0/1", "author": "Dr.D \"Donna Kocim\""}, {"rating": 1.0, "review": "It was flawed  and now I have to get a new one. I couildn't get Netflicks films and the voice selection no longer works. Where was this made? China?", "verified": true, "helpfulness": "1/4", "author": "B. C. Barker \"ms.mystery\""}]