[{"rating": 1.0, "review": "This was a complete waste for me as I could not activate the unit. Two thirds the way through the process I am told that I cannot use this product in my area so at this point it is back in the packaging gathering dust on a shelf of the space saver that the TV is on. None of the information listed in the ads for this product says that there are some locations in the world where this cannot be used. If it is there, I am yet to find it!", "verified": true, "helpfulness": "0/0", "author": "Roger Corbie"}, {"rating": 2.0, "review": "well the idea of this item is cool.  I have Hulu and Netflix streaming now.  I was really hoping to use this on my IPAD which is not currently suported.  It does work and it is nice to use on my laptop.  But realistically it is not that great of a device.  I know they say Ipad use coming soon.  But the item is ok and we do use some..We might use more if we did not already have a roku device.  But overall it is cool. But still some kinks to work out!!", "verified": true, "helpfulness": "0/0", "author": "James M. Wilson"}, {"rating": 5.0, "review": "Works great.  Easy set up.  Limited services so far (Netflix, Google, Youtube), but more will be added.  This technology is advancing quickly and in case it needs to be upgraded, the low cost limits the risk.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "Hard to beat for the price. Has done everything it promised. Easy to use and fairly easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Chowman"}, {"rating": 4.0, "review": "Works great sound & picture, easy to set up and get it working. The only drawback is, it only works on few apps, does nor work on any third party apps not even to see your pictures from your on tablet or phone. I hope google will realize that and get it open to third party developers so you can use it on live streams and web pages other than Netflix, you tube  and few more apps.", "verified": true, "helpfulness": "0/0", "author": "Walid Hamdan"}, {"rating": 5.0, "review": "Just Excelent waiting for google to include more apps like MLB or make it open to xbmc or something like that.", "verified": true, "helpfulness": "0/0", "author": "Jairo Sosa"}, {"rating": 3.0, "review": "It only streams Netflix as YouTube. If you already have that in your tv or Blu ray player, this item is unneeded. That it streams anything in Chrome is an exaggeration.I'm hoping more distribution companies like Netflix make deals and all our Chromecast software is updated to show and handle that.", "verified": true, "helpfulness": "0/0", "author": "Alan Fine"}, {"rating": 1.0, "review": "Most people don't need this device.  If you have a Smart TV, DVD Player, A/V receiver.......then you don\"t need this.  ALL \"Smart\" devices connect to your WI=FI and do all this already, (That is what \"Smart\" means)  so why do you need another device that does what you can already do?  Worthless.", "verified": false, "helpfulness": "0/3", "author": "Chris"}, {"rating": 5.0, "review": "I didn't get this product because of all it can do right now, but what I hope it will do in the future. Netflix, Youtube, Play Music, Play movies and Hulu plus is about all it does. I expect support for Plex in the future and alot of other things. If you don't have a Roku or apple tv, this is perfect for you. Until they support more apps, you might wait on buying one if you can get your netflix somewhere else.", "verified": true, "helpfulness": "0/0", "author": "James Thompson"}, {"rating": 5.0, "review": "Does what it says flawlessly. Just needs a few more apps like HBO Go. Works great with my android phone. Highly recommend it to anyone that is looking for an inexpensive and very movie piece of electronics.", "verified": true, "helpfulness": "0/0", "author": "ParcellSF"}]