[{"rating": 5.0, "review": "I love this.  It was easy to set up; set up in moments.  Easy to use.  It works flawlessly with Netflix but not Amazon Prime.  Most videos playing in the browser will display on the chromecast selected TV.  The technical through-put is excellent.  Playback does NOT stutter.  This is SO much easier than using the Wii to control netflix . . . . and I can work in another browser window without lag . . . marvelous thing.  I'd like a few more around . . .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"vyarberry\""}, {"rating": 4.0, "review": "It works fine. Easy to install, just follow directions. I wish I could use it to transmit as an extra screen for my laptop. Otherwise no problem.", "verified": true, "helpfulness": "0/0", "author": "GeoMass \"GeoMass\""}, {"rating": 5.0, "review": "As I figured it works as planned.  I glad I decided to give it a try and hope updates gives the device even more usefulness. It worked out of the box as noted.", "verified": true, "helpfulness": "0/0", "author": "William Friedmann"}, {"rating": 5.0, "review": "Beast device ever for streaming for taplet and smart phonesVideo and audio quality are excellent and good price for the product", "verified": true, "helpfulness": "0/0", "author": "aiman alali"}, {"rating": 5.0, "review": "This thing is a gem.  I can travel with it and my son loves that I can play lots of his UTube favorites from his phone directly to the TV!", "verified": true, "helpfulness": "0/0", "author": "Douglas Stowell"}, {"rating": 5.0, "review": "It works wonderful, it's and excellent option if you have an HDTV but doesn't  want to buy an expensive smart TV. The streaming is really good, even if you have a slow connection.Works perfect, both with Android and iOs, easy to install and set up. The biggest issue I found is the lack of apps to used it from a Smartphone or tablet, but it is easy to resolve if you install Google chrome and the extension for your PC/Mac.", "verified": true, "helpfulness": "0/0", "author": "Alonso"}, {"rating": 5.0, "review": "This item was purchased as a gift and the recipient is thrilled with how well it works.  Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Susan Tryforos"}, {"rating": 4.0, "review": "Great Value for MoneyEasy SetupOnly Challenge is the HDMI extender cable is a bit too short, could've worked with longer extender.Chrome however does not play your regular videos from the computer ... so need to figure that out.", "verified": true, "helpfulness": "0/0", "author": "Shrirang Bapat"}, {"rating": 5.0, "review": "I have other ways to stream media in my home, so I have actually only used it in some unusual situations (at friends' homes to demonstrate its functions), but I am very impressed so far. You cannot beat the value for the price, and it is very easy to set up and use. Google, please expand the capabilities of this device.", "verified": true, "helpfulness": "0/0", "author": "San Man \"SanMan\""}, {"rating": 4.0, "review": "I love using google chrome cast for Netflix and YouTube!!! It's easy and you can't beat the price! I love finding an excuse to use my iPhone as much as possible. My one complaint is that I can't watch more things using this device... I wish pandora radio would hop on board. It would also we nice to watch any video on the Internet.", "verified": false, "helpfulness": "0/0", "author": "niksoren \"niksoren\""}]