[{"rating": 4.0, "review": "Product works great.", "verified": true, "helpfulness": "0/0", "author": "D. C. Wylie \"fisherman\""}, {"rating": 4.0, "review": "This thing rocks, I use it for streaming movies from my chromebook and galaxy s3. As long as you have a decent WIFI connection, this thing will please you.", "verified": true, "helpfulness": "1/1", "author": "subiedoobie"}, {"rating": 1.0, "review": "Can't get it functioning yet", "verified": true, "helpfulness": "0/0", "author": "kent w  small"}, {"rating": 5.0, "review": "I really don't know how I lived without one of these for as long as I have . lol.. I love watching movies from the Google play store and netfilx and this made it so much better with streaming to my TV.. I would say this is a must especially I'd you want a smart phone experience without having to spend a whole bunch more money for the same capabilities.. One thing I think is really cool is when its on stand by it scrolls through various pics from artists and even your own albums if you'd like even shows the time and the local weather.. The cast ability is pretty amazing and could be used for various apps from YouTube to even Google+ .. Like I said if you're looking to buy a new TV and don't feel like going all out for a smart TV this is a great alternative that works great with your mobile Android devices..", "verified": true, "helpfulness": "1/1", "author": "Jason Harvey"}, {"rating": 5.0, "review": "Awesome product. Works on ant tv with an HDMI hookup", "verified": true, "helpfulness": "0/1", "author": "Kurt N. Margaret Clevenger"}, {"rating": 5.0, "review": "Best $35 you can spend, and they update apps and functionality frequently.", "verified": true, "helpfulness": "0/0", "author": "N. Wolf"}, {"rating": 4.0, "review": "Very nice invention. I need the 2.0 version though. Since, the source of stream, such as your cellphone or laptop have to be within the room for the motion picture to work continuously.", "verified": true, "helpfulness": "0/0", "author": "Maika Le"}, {"rating": 3.0, "review": "Streamed content does not match up to the audio.", "verified": true, "helpfulness": "1/2", "author": "K"}, {"rating": 4.0, "review": "Works well with iOS and Android phones/devices. Just wish I could stream more of my own content.", "verified": true, "helpfulness": "0/0", "author": "Solomon Rosenthal \"See you on the road\""}, {"rating": 5.0, "review": "I wanted an app that would allow me to mirror my phone screen. To be able to watch non Chromcast Apps. This is great. Great picture and great sound. Would buy again.", "verified": true, "helpfulness": "0/0", "author": "jesse f"}]