[{"rating": 1.0, "review": "I thought I was buying a usb,i don't know what this is,i don't even know how to use it,and I don't want it,plus it is to high,my daughter,told me it was a usb,so I have to send it back", "verified": true, "helpfulness": "0/15", "author": "olivia smith"}, {"rating": 5.0, "review": "My son asked for this for Christmas. I wasn't very familiar with its function at the time. We've had a great time watching Netflix shows and Youtube videos through this device. It was simple to set up and is simple to use. It's a nice addition to your entertainment options.", "verified": true, "helpfulness": "0/0", "author": "Dawn Weisman"}, {"rating": 4.0, "review": "I own three Chromecasts, so I am obviously a fan. But they do have a few glitches and they do need a little more functionality. Below is a summary of what I expect in the future:Glitches:1. Sometimes the Chromecast cannot connect to a wireless network. I have no idea why, we're talking a basic wireless network and WPA password. I move my Chromecasts fairly regularly between houses, offices, hotels, etc. and twice I've been unable to get it to connect to the wireless network at the location.2. At my home we have 4 tablets and 2 cell phones that we \"cast\" things from. Very often if we cast something from Device A, within a couple minutes it was appear on Device B as being cast from it and Device B can now control the casting. This is very annoying is Device B is doing something, say listening to music or watching a show as it will turn off whatever Device B is doing when that device takes over casting.3. When casting music through Google Music, if the cell phone casting the music gets a phone call it will turn off the music playing. Aggravating as usually I'm casting music for my children in a different part of the house and I'd like to be able to use my phone to make calls without shutting their music off.Wishlist:1. I wish you could cast to different Chromecasts at the same time from the same device. For example, cast a Netflix show to Chromecast A from Device A, then cast Hulu Show to Chromecast B from Device A. Currently we have to use cast to each Chromecast from a different Device and this is a pain sometimes when there are not enough devices in the house but multiple things need casted.2. Ability to cast an app and then still use that app locally. For example, I wish I could cast a Netflix show to a TV, and then watch a different Netflix show my cellphone at the same time.3. Ability to see and control all content currently being casted on all Chromecasts from all Devices. I know it sounds stupid, but sometimes I just can't figure out which of the tablets or cellphones in the house is controlling a Chromecast. I'd love a \"master control\" app that showed: All ChromeCasts in the house, what they were casting, and either the ability to control the Chromecast right there or at least tell me which device had control of the \"cast\"", "verified": true, "helpfulness": "0/2", "author": "Adam from Middletown \"adamwlewis\""}, {"rating": 5.0, "review": "I cut down on my TV satellite service bill since I can now watch some of my old favorite movies and TV showson Netflix and Youtube on my television", "verified": true, "helpfulness": "1/1", "author": "D. P. MURPHY"}, {"rating": 5.0, "review": "Every household needs one of these.  Makes watching anything online so easy to watch thru you HDTV.  Works great with Netflix", "verified": true, "helpfulness": "1/1", "author": "Cliff Diamond"}, {"rating": 2.0, "review": "I trusted Google products. This does not work. The programing available does not operate like I am watching a TV program. It constantly flutters and audio is not understandable. Is there a secret to getting it to operate.", "verified": true, "helpfulness": "0/0", "author": "C. P. Davis"}, {"rating": 3.0, "review": "Easy to use and setup.  I have two on two different TVs.  On both TVs I've found it works well with Netflix and YouTube, but it is too slow for HuluPlus and HBOgo.  With both the latter the program frequently halts for buffering.  Tried them using cellphone apps and Chrome browser from a laptop.  From the browser, I get jerky sound and video rather than buffering pauses, but neither one is satisfactory.  Hulu site says 3 Mbps or higher is adequate.  I'm getting around 3.8 both direct and wifi so that doesn't seem to be the problem.  Going to try Roku or similar when my birthday money comes.  Have not tried it with sound only services such as Pandora.", "verified": true, "helpfulness": "0/0", "author": "Chrles J. Kelly Jr."}, {"rating": 5.0, "review": "If you use ChromeOS or Google chrome as your main browser, I highly suggest this product. Also it works very well with Android phones.", "verified": true, "helpfulness": "0/0", "author": "Jacob"}, {"rating": 5.0, "review": "Ever watch one of those procedural police shows where the IT guy can 'throw it up on the big screen' when the Chief wants 'enchance'? Feel that power in your own home by throwing that youtube video or song up on the big screen yourself.  Works exactly as advertised. Never had a problem with it.But s***macklemore.jpgIt was only 35 bucks", "verified": true, "helpfulness": "0/0", "author": "Stuart Shaffer"}, {"rating": 3.0, "review": "Ok I have the new nexus 7 and the galaxy Nexus. And I was really looking forward to this. When I got it and started to use I wasn't impressed. They need more apps and besides chrome books there should be a way you can look at your web browser threw the nexus 7. honestly I can live without it.", "verified": true, "helpfulness": "0/0", "author": "Ace Mute"}]