[{"rating": 5.0, "review": "Best $23 I've ever spent. Love this little gadget! Extremely satisfied with the product, price, and shipping speed!", "verified": true, "helpfulness": "0/0", "author": "Jaime"}, {"rating": 5.0, "review": "Chromecast is an extensive review that I dont have time to make.Excellent product, excellent applications, some minor bugs to be worked out by manufacturers but a solid 5 star device!If you dont have a smart TV- trust me this is worth the $35! it will take your viewing experiences to the next level by letting you connect to the internet through your TV. Streaming has never been so painless!", "verified": true, "helpfulness": "0/0", "author": "sarah cruz"}, {"rating": 5.0, "review": "Can't live without it .. must have toy", "verified": true, "helpfulness": "0/0", "author": "Rakesh"}, {"rating": 1.0, "review": "Why doesn't anyone tell us this stuff? Chromecast will not access my network (Comcast Business), neither will it access my backup MiFi network. Apparently it has problems with numerous routers and networks. Google help is none existent. Once you own one of these you find the forums are full of similarly disappointed customers. Who has the time to waste?My 2 Rokus work just fine and I hope my new Amazon Fire dongle works well when I get it. But this Chromecast was a distinct shock to the system. I truly thought technology had moved on from this sort of experience. Simply awful. And very disappointing. I really wanted it to work!I am not returning it - I learnt from the forums that it will work with Verizon Fios (fingers crossed) - I do have someone in mind -  a surprise present for Christmas!LATEST FROM COMCAST, JUST FOUND IT:Re: Chromecast with Cisco DPC3939B Router‎08-19-2014 10:51 AMAt this time the Cisco 3939B is not compatible with Chromecast. Our senior engineering team is working with Cisco to resolved this issue, and a fix will be in place with the next firmware update. We will post an update once the new firmware is released.Sorry for any incovenience at this time.", "verified": true, "helpfulness": "0/0", "author": "Peter Bailey (PEX)"}, {"rating": 4.0, "review": "not support Samsung Note2(", "verified": true, "helpfulness": "0/0", "author": "Rustam Ismaylov"}, {"rating": 1.0, "review": "Extremely poor.  Weak reception.  New Moto X.  New Chromecast.  Router on compatibility list.  Followed router recommended selections.  I was much better off with an HDMI to micro-HDMI on my old droid Razr Maxx HD.", "verified": false, "helpfulness": "0/0", "author": "Flymehome"}, {"rating": 4.0, "review": "Could use some new apps as it's very limited but as a device to cast from PC/Mac using Chrome Web Browser (doesn't support other browsers) to the TV, it's quite nice! You can even use your mobile phone to cast youtube videos to your television.", "verified": true, "helpfulness": "0/0", "author": "UbuntuJohn"}, {"rating": 3.0, "review": "When I first saw the Chromecast I thought, WOW, Google has done it again! A tiny portable wireless interface between devices and TVs, amazing! Then I read that it needs its own power source, so it's really not as portable as they make it look. Then I read that it only supports a small number of services and apps. So it's just a really small Roku with fewer options. I thought, I'll just stick with my PS3 for Netflix and my HDMI cable and laptop for everything else. Then I forgot about Chromecast.Then one day, I got frustrated trying to put on cartoons for my kid through my PC. With the way all these companies now are trying to funnel everything through their apps instead of their websites, sometimes it easier to get content on a tablet or phone. That's when I sucked it up and got the Chromecast. It actually really impressed me. It interfaces really well with my android devices (not so much with PC) and it generates a great picture. I started to fall in love with the Chromecast in spite of it's limitations, but then I realized the extent of those limitations.This could easily be a 5 star product and really change the way our devices interact. But it isn't and it doesn't. It only supports a very limited amount of services and apps. When it is supported it works really well. But at this point all you get is Netflix, HBO, and ESPN, assuming you have subscriptions to all of those. It is great for Netflix actually, okay for ESPN (but you get all kinds of weird device restrictions). Luckily for me all I really watch is Netflix, HBO and ESPN so I'm in good shape. You can kind of get it to work with the Chrome browser, but its still not a very satisfying experience.Also, my last phone was an obscure model and was never updated by the manufacturer so as often happens with Android it didn't get along well with a lot of apps, including the chromecast app. Keep this in mind if you want to try it.It will make a good Christmas gift because it's a cool toy that doesn't cost too much, but if you're buying for yourself check your expectations. It still can't do very much.An interesting note, this device is actually a small android computer. I thought my phone was streaming content to the device, as if it were like a wireless router for video, but that isn't the case. In fact, once you have video streaming on it you can turn off your phone and it will keep going. Once it was streaming ESPN all night and I didn't even realize it. I had to turn my phone on, connect, and tell it to stop streaming. Kind of weird and not good as it was wasting a chunk of bandwidth, beware of that.", "verified": true, "helpfulness": "0/0", "author": "IMFM"}, {"rating": 5.0, "review": "I just bought a second Chromecast as a present for a friend which should be an indication as to how much I like this product. Since I originally bought it, it's become our go to device for entertainment in my house. I will say the best use anyone can get out of their Chromecast is to download the Plex Media Server and use it stream your local media to your Chromecast. Since doing this we rarely watch Netflix these days.A quick rundown of the device, The Chromecast plugs into the HDMI port on your TV and uses your TV's USB port to power the device. Don't have a USB port? no problem it comes with an AC plug for those occasions. The Chromecast in itself doesn't actually stream media, it instead seeks out what you cast and play it itself. This free you up to do other things and doesn't make you have to keep a tab open so that it can continue to play. This means you can start a Youtube video then close your computer completely and it won't affect the Video.All in all the Chromecast is a great device for a great price and even if you end up not using it everyday the investment cost of this item is so low that it's hard to be upset if you didn't end up enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Xzeno"}, {"rating": 1.0, "review": "I'm giving this one star because I can't rate it zero stars! This thing is useless! I can't stream video from my phone unless I'm using WiFi. If i knew that I never would have wasted my money. I'm rarely home so I THOUGHT this would be a great way to watch what I want through my phone to my tv and cancel my cable service. Nope! I can't use my phone internet to watch a movie. Thx for nothing Google!", "verified": true, "helpfulness": "0/10", "author": "Jason"}]