[{"rating": 5.0, "review": "Works great, especially since all of my devices are android based.  Very convenient.  I purchased a second one after owning this one for a few weeks.  I recommend independently powering it from the wall rather than the TV if you are looking to take advantage of its ability to turn the TV on (only works on newer TVs)  If you are not looking to use that feature most TVs have a usb port that you can use to power the device reducing the amount of wires coming down from the TV.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Good!", "verified": true, "helpfulness": "0/0", "author": "Jeanete Michiko N. Ferraz"}, {"rating": 5.0, "review": "Excellent", "verified": false, "helpfulness": "0/0", "author": "GeSi"}, {"rating": 5.0, "review": "Excellent Product! It was very nice and easy to setup. I have mine plugged into and AV Receiver that has a USB input on the back. So if you don't have room to plug it in like I do, you can just simply connect it to that and it powers it just fine. It also comes with an AC adapter so you can plug it into an outlet if you want. The Chromecast app works very well. It takes you through the steps on how to get everything setup. Once you are done, you are able to stream several types of media through many apps. It is also very easy to move around the house wherever you want to use it. If you are looking for something to stream media from apps on a mobile device, than this is the streaming player for you!", "verified": true, "helpfulness": "0/0", "author": "Electronics Guru"}, {"rating": 5.0, "review": "Excenlent all ok", "verified": true, "helpfulness": "0/0", "author": "Leonel Pirotto"}, {"rating": 2.0, "review": "Screen cast constantly crashes! !!", "verified": true, "helpfulness": "0/1", "author": "Christopher H brown"}, {"rating": 4.0, "review": "The main purpose in my case was to cast ESPN from computer to TV. This review may be a bit too tech, but I decided to share just in case someone else has the same issue.SETUP: I have windows x64 8.1 wireless connected to my A*us router - this was pretty easy, but during the process I lost connectivity and it wasn't restored w/o my intervention. Then the setup process stumbled and I had to try again, 2-nd time was a charm. I automatically installed google chrome in the process (no I did not have it :-)) I prefer to use slimjet portable instead of chrome, but for the purpose of this I used only chrome. Computer is about 25 feet away from my router but chromecast it is right beside router. My wireless network was setup a couple of months back and it is running strong, I get disconnected only during thunderstorms :) My adapter (USB connected) shows 5 bars at all times and it is connected at 270Mbps.It is weird, but in my case I can watch ESPN only on computer, not on tablet or phone (yet, my provider is working on this...)PURPOSE: After initial setup I fired ESPN on chrome and start casting. It was working fine (HD) but I did not let it run for too long.First thing I noticed: sport actions and HD is a bit lagging on my 55\" sammy, I can notice it but it is not that bad and I can live with it.Another thing is that I thought once cast started you can save energy, put your computer to sleep!?! :) Well, that's not the case with my setup, I need to keep my computer up and running with ESPN the whole time I'm casting.Two days later I wanted to watch a live event, so i fired it up and after 10 minutes it froze and then lost connection; checked computer, it was true, repair connection and back on with the cast. Guess what? Happened again, restored and happened again. My live event was ruined so I started investigating and I found in the event viewer that \"A timeout occurred while waiting for the EHCI host controller Interrupt on Async Advance Doorbell response.\" or \"Name resolution for the name espn3mlbam.espn.go.com timed out after none of the configured DNS servers responded.\", it was happening one or the other one. Investigating further I found out that first error may happen with Windows 8.1 (not Win 7!) and there is no known solution (USB ports are blocked during high traffic) at this time, just a \"shy work around\" to disable windows firewall? I tried that, it looked like it fixed it, but still happened after a while.In the end I was thinking to return the device, but I tried one more thing: I moved my wireless adapter to an USB3 port and I was able to watch the match between Federer and Monfils entirely w/o interruptions!Pros: small, relatively easy setup, hdmi, powered from TV's usb (in my case), HD (720p)Cons: must keep my computer running when casting, very limited options from google cast add-on", "verified": true, "helpfulness": "0/0", "author": "GeorgeFromRo"}, {"rating": 5.0, "review": "Works as advertised and easy to setup.  Tremendous value too!", "verified": true, "helpfulness": "0/0", "author": "Ross Dueber"}, {"rating": 5.0, "review": "Yes I have two of these now and they really work very well! Using them I can cast using Google Chrome on each of my laptop computers and my Samsung Galaxy S4 Zoom Android smart phone! Sometimes I leave one of them on in the rec room and let the pictures play on their own.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 1.0, "review": "Had no instructions on how to set up", "verified": false, "helpfulness": "0/1", "author": "Benjamin L. Ladd"}]