[{"rating": 5.0, "review": "So easy to set up, 5 stars. Works great!", "verified": true, "helpfulness": "0/0", "author": "sjk"}, {"rating": 5.0, "review": "Picture quality is great, no lag and voice search works great.", "verified": true, "helpfulness": "0/0", "author": "etm"}, {"rating": 5.0, "review": "Had purchased google \"Chrome\" and never could get it working.  It took all of about 5-10 minutes and Amazon Fire TV was working.  Love it!!", "verified": true, "helpfulness": "0/0", "author": "W.L. Pierce"}, {"rating": 5.0, "review": "Not only has Amazon Fire TV met my expectations, but is exceeding them by a large margin! I also took advantage of the special for the Fire Stick and it's great too.A word to the wise; don't pair your Fire TV remote with the Fire Stick...it'll pair, but won't work with your Fire TV any longer until it's unpaired and that took some doing for me.All in all, great enjoyment!", "verified": true, "helpfulness": "0/0", "author": "deusXango"}, {"rating": 5.0, "review": "Still learning the features, etc., as the instruction book is pretty sketchy.  Otherwise the unit is working \"as advertised\" and we're very happy with it, as well as Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "JiminGA"}, {"rating": 3.0, "review": "Easy to set up, easy to use. I'd estimate that about 10% of Amazons offerings are available through this device. Yes you use your Prime account to watch videos, and listen to music (the lyrics scroll on the tv).  Once some developers open up their apps/games for the device,  it will be a phenomenal streaming device.  Until then its just ok. Like a giant kindle that you view on your TV.", "verified": true, "helpfulness": "0/0", "author": "Gurubone"}, {"rating": 5.0, "review": "Works good , easy to use....", "verified": true, "helpfulness": "0/0", "author": "Steve Titus"}, {"rating": 4.0, "review": "The Amazon Fire TV box and remote (and I have the game controller too) are all excellent products - the design and build quality of each component is exceptional. The box is incredibly small for what it can do. It will fit anywhere there is a tiny bit of space around the TV. -- Setting it up wirelessly or wired is very-easy and the set-up instructions are clear and easy to follow. -- It gives you instant access to so much entertainment, I couldn't list it all here, and if you're an Amazon Prime member, there's a lot of current movies available for free too. ---  With the game controller, you have access to several included games, and others you can download, which are surprisingly good action games, and are quite challenging.  It doesn't appear to be meant to directly compete with Xbox or PS2, etc, but it isn't shabby either by any means. -- I really enjoy the games and don't see any need for having an Xbox or PS2 anymore.I had to hold one star off the rating, because there are no instructions on how to get the box to recognize the wireless game controller.  After trying everything I could think of, I finally had to go online to Amazon Fire help and there I found you have to ping the controller from your Amazon account, which I did and the box recognized the game controller and all was fine from there. -- But I wasted a lot of time in the process of discovering all that, which could have been avoided if there was documentation providing the proper instructions for setting up the controller, which cost the rating here one star. - One other thing: the Amazon Fire remote doesn't have a headphone jack like the Roku 3 does, and going from the Roku to the Amazon fire, that feature is sorely missed - hint, hint...Other thoughts: The only thing that would make it better would be for Amazon to have all the network TV channels available via Amazon Fire, and it would be great if they could garner contracts with HBO, Cinemax, Showtime, and other channels like the premium sports channels, and then offer memberships to these channels through Amazon Prime. (Cable companies should not be allowed to have a monopoly on contracts with those channels.) - Also, I think a lot of customers would be overjoyed if Amazon bought rights to old Nintendo games, like Super Mario Brothers, Icarus, etc - Amazon could just buy out Nintendo and make all of their games available on Amazon Fire.  The gaming part of Amazon Fire is that good - all it needs is a broader selection of quality games.", "verified": true, "helpfulness": "0/0", "author": "A. Dobrynin \"Aloysius\""}, {"rating": 5.0, "review": "This is a great gadget. If you are an Amazon Prime member-( I get free shipping  ) lots of free music and discounts on books with prime-your prime membership gives you access to an enormous # of free movies. The ones that are not prime eligible ( free ) are a cheap price compared to paying On Demand or Net flix. If you have uploaded your photos and music to the Amazon Cloud App-you can listen to your music on the Fire TV-all my music is on my Kindle Fire-it plays well but any tablet is a battery hog. Now I can let my music run on the TV-and if I want to, let my photos run  as a slide show at the same time. It is an easy 123 hook up-you don't have to have tech skills. Did funble around a little till I found the place where it says \" Synch all Amazon content\". Found that-it talked to the mother ship and all my photos and music appeared. Tiny little box-maybe 4 inches square so if you don't mount it -it is easy to sit beside the TV. I only wonder why I missed this thing and just recently found out about it..Went online with the cable company and dropped the movie channels ( so now bill will be less ). Here is the best part of this thing. Once you pay for it there is no monthly charge to watch movies unless you decide to pay for one that is not Prime eligible. There are also some older movies there ( the kind you watch again and again ) I wish Amazon would back track and add some of the classic war movies like Midway and Pearl Harbor and We Were Soldiers. I am surprised at how easy it was. You only have to know your wifi password-if you have no wifi - but have a modem-you will need to buy an ethernet cable to do a direct hook up to the modem. Live alone and don't like reality TV-so this gives a lot of bang for the $ 99 dollars in entertainment value.", "verified": true, "helpfulness": "0/0", "author": "Merri L Dodson"}, {"rating": 2.0, "review": "This is my \"first impression\"  of this offering.  The first concern is that it is highly hyped with little meat in the ads.  I  and others I have spoken to have the same impression.  There was little or no way to actual find out what was the free content.  Even when we installed it you have to get to \"Prime\" to even see what it's truly about.  I've been pretty happy with Hulu Plus and the remote control thru our Samsung \"Smart TV\".  When connected through Fire TV there are lags and buffering pauses that we don't get with our current configuration.  We're travelling in a day or two so we'll wait until we return to try the 30 day free Prime offer.They spent way too much on the slick packaging, and I can't imagine the free content through prime to be much, especially when coupled to free prime delivery.  They have to make money somewhere, so my expectations at this point aren't very high.  The best thing I can say is the controller is very good and the voice command works well.  More later.", "verified": true, "helpfulness": "0/0", "author": "toledotom"}]