[{"rating": 5.0, "review": "Super Duper!", "verified": true, "helpfulness": "0/0", "author": "Camping Connoisseur"}, {"rating": 5.0, "review": "I love my Chromecast. It works really well with all of my products (android phone, iPad, Mac, etc). No complaints.", "verified": true, "helpfulness": "0/0", "author": "Jinger Crump"}, {"rating": 4.0, "review": "I only give it a 4 because I hate that I can't cast my desktop to my tv, like you can with a regular hdmi cable.", "verified": true, "helpfulness": "0/1", "author": "Amy Levine"}, {"rating": 3.0, "review": "not using it", "verified": true, "helpfulness": "0/1", "author": "John M Dias"}, {"rating": 1.0, "review": "Sent it back because it doesn't have a remote and doesn't allow Amazon streaming.", "verified": true, "helpfulness": "0/1", "author": "Valerie"}, {"rating": 2.0, "review": "The mirror cast form your phone to tv loses sound and freezes at times.", "verified": true, "helpfulness": "0/1", "author": "Michael oles"}, {"rating": 3.0, "review": "The product works but not with Amazon Video as Amazon has its own streaming media player.... Check reviews on line and look into Roku which works for most video channels included the amazon video.  I will keep it for my husband's tablette but will have to look into another one.", "verified": true, "helpfulness": "1/1", "author": "Mrs. Valerie Dachary-bru"}, {"rating": 3.0, "review": "Works but I have to reset it up everytime I want to use it.", "verified": true, "helpfulness": "0/1", "author": "Taylor Braithwaite"}, {"rating": 5.0, "review": "Not for the brain dead plug and play folks, but I've been very happy with it.  My only complaint is actually against amazon for not allowing on demand streaming from any non amazon android tablet.", "verified": true, "helpfulness": "0/0", "author": "John G Wasson"}, {"rating": 1.0, "review": "Chromecast could not deal with my WiFi setup I guess, so it did not work in my home wifi net. Also, the setup process is horrible. I mean, the setup software creates an ad-hoc network without even asking your permission for it!!!! I had other connections/downloads running at the same", "verified": true, "helpfulness": "0/1", "author": "Marcelo"}]