[{"rating": 4.0, "review": "This device is fantastic for the price. Alas, it's not perfect. Whilst my friend had a simple/flawless installation, I did not (n.b., we both know how to solder and have decades of computer/programming/infrastructure experience).  I had to change my router (despite being \"supported\").  It's not well-documented that your router must support uPnP traffic (multicast).  Despite having a \"supported\" router (with uPnP enabled), I had to swap-out the router (I luckily have several laying around).  I contacted tech support... to little effect (they were courteous, fast, and... well, not terribly helpful).  For the money, it's a good deal.  It's mostly reliable (although in the past few weeks I've had to \"cold start\" (unplug completely) the thing twice to get it to resume responding/functioning properly.  Again, it's a fine product for thirty bucks.", "verified": true, "helpfulness": "0/0", "author": "Mersault"}, {"rating": 5.0, "review": "Great, A+++....the beginning to the end of paying for cable.  Perfectly shipped.  Easy to install and liked the optional USB or plug in power sources", "verified": true, "helpfulness": "0/0", "author": "D Sena"}, {"rating": 5.0, "review": "I have used this quit a bit and just love it.  I find it works best with Netflix and YouTube they have a icon built into their windows that helps with the quality of the videos.  It will work with other pages with an icon on the browser tool bar, great for regular browsing but i find using that using the browser icon with movies is a bit choppy.", "verified": true, "helpfulness": "0/0", "author": "E. Foster"}, {"rating": 2.0, "review": "I don't know if it's a problem with my router or the Chromecast, but in order to get it to be found by the streaming device (cell phone, I Pad, etc.), I have to turn off and on my router.  Perhaps there's a simple solution, but for me, it isn't working well out of the box.", "verified": true, "helpfulness": "0/0", "author": "Scott J. Bauer"}, {"rating": 5.0, "review": "Awesome little device, Can't wait until they develop more apps for it and I can use it to watch more stuff", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 1.0, "review": "If you only watch Hulu, You Tube or Netflix, you'll love it.  Otherwise it is useless.  If it could mirror it would be the poo.", "verified": true, "helpfulness": "0/1", "author": "Cheryl Dunlap"}, {"rating": 4.0, "review": "I'm a fan of all things cord-cutter-related. I love that innovation is pushing us toward a more mobile and on-demand format for media. That's sweet.Google tried it with Google TV, but it went the way of Google Wave. Cool idea, but implemented poorly.They finally came up with a Roku-esque solution in the Chromecast. And it works (mostly) brilliantly.The selection of Chromecast-compatible apps is a little lacking, but it's a new technology. Give 'em time. The apps that do work, though, are fantastic. YouTube streams extremely well, Netflix works great, and Google's native Play Music store is my most-used function.Here's where it gets dicey, though.Chrome mirroring from a computer is glitchy. It almost seems like an afterthought. Apple's AirPlay is able to perfectly mirror screens and devices with little latency, but for whatever reason, the Chromecast mirroring is slow, buggy, and prone to drop the connection.I realize it's a new tech and first-gen hardware, but it seems like they should have worked out some of the kinks. Oh well.It's still a lot of fun. Google's hardware game is finally stepping up.", "verified": true, "helpfulness": "0/0", "author": "Caleb Sommerville"}, {"rating": 5.0, "review": "Plug in, change tv, wait for download, use mobile app to complete set up.  Liked the fact that Netflix makes it easy.  Loved the part where I could still use my phone in another room while casting.", "verified": true, "helpfulness": "0/0", "author": "Anita M Castillo"}, {"rating": 1.0, "review": "Purchased this virtually useless device with high expectations.  Google screwed the pooch on this release as it doesn't even have Chrome extention support for Android OS devices (e.g. Samsung Galaxy S4 or Samsung Galaxy Tab 2/3).  When I contacted Google support re: the matter they told me.to buy an app called Plex.  Why should I be forced to purchase a third party app for a product that should work natively with it's creator's other products??? I'm returning it today,  less than 24 hours after purchase.  Disgusted at the waste of time/effort.", "verified": false, "helpfulness": "0/1", "author": "L. Santiago"}, {"rating": 4.0, "review": "is the picture quality perfect?  not always, depends on the video vendor and what kind of camera was used (i.e. many \"HD\" videos on youtube).if you have a good internet connection with good wireless strength, you will enjoy it.  I have watched all of season 1 breaking bad, streaming Netflix directly from my phone and it looks great.I think it will be much better once there are more vendors.for example, you cannot use Amazon Prime video streaming, and stream the video from your Chrome browser, it is not supported, even though Chrome says you can broadcast your browser window.", "verified": true, "helpfulness": "0/0", "author": "Luke M. Tolbert \"Lukas T\""}]