[{"rating": 5.0, "review": "Just Terrific!", "verified": true, "helpfulness": "0/0", "author": "Eleanor C Healey"}, {"rating": 5.0, "review": "This is the coolist tech device> Works great. The games are lacking but I've got a computer for those.", "verified": true, "helpfulness": "0/0", "author": "Dennis strim"}, {"rating": 5.0, "review": "A good deal!", "verified": true, "helpfulness": "0/0", "author": "CMN"}, {"rating": 5.0, "review": "I usually need one of the kids to help with the installing of any new electronics. Not with the Amazon Fire, it was very simple.", "verified": true, "helpfulness": "0/0", "author": "Marilyn Matheson"}, {"rating": 5.0, "review": "Just awesomeness", "verified": true, "helpfulness": "0/0", "author": "Polar Bear"}, {"rating": 5.0, "review": "Works great. Does everything I need.", "verified": true, "helpfulness": "0/0", "author": "cody"}, {"rating": 5.0, "review": "The unit responds very quickly to commands. Sound is great and while the selections are good you can get them via TiVo or APPLE TV also. The performance makes Fire TV my preference.", "verified": false, "helpfulness": "0/0", "author": "Thomas Fortune"}, {"rating": 4.0, "review": "The Fire TV is a nice little snappy device and exceeded most of my expectations. Boot up is quick and navigating the UI is pretty intuitive for the most part. I opted for the game controller and have already loaded a few emulators to play games from the past. If the app you are looking for is not available in the Amazon appstore you do have the ability to side load but take note that not everything will work properly if loaded this way.There are a few things where it does fall short. Even though it is an Android device, it is heavily customized and therefore has no ties into Google Play (for obvious reasons). Because of that you lose out on anything that requires Google Play Services (Hangouts, games that save progress such as Clash of Clans, and many other news/weather apps). At this time there doesn't appear to be any support for USB webcams so you won't be able to use Skype. It's missing a virtual mouse so if you need that then you either need to purchase a third party app or connect a wired/wireless mouse to the USB port. There's a semi-decent amount of games available however again since there is no Google Play a lot of the mainstream games are missing and need to be rewritten for the Amazon platform. Probably my only other gripe is the stock amount of flash memory, 8 GB is not enough for a box like this (even though external storage is now supported via USB). Half of that memory goes to the OS and its customizations.Other than that I've had it for almost 2 weeks now and have been enjoying my Prime benefits. I'm heavily considering either getting a second unit or buying the stick for my bedroom. I give the FTV 4 stars at its current offering, if my gripes get addressed I will happily bump it to 5.", "verified": true, "helpfulness": "0/0", "author": "Anthony Cosgrove"}, {"rating": 5.0, "review": "Love it!! I use it everyday!!", "verified": true, "helpfulness": "0/0", "author": "Myra"}, {"rating": 5.0, "review": "I ordered this, it was already set up with my account information so it was easy to get started. I set up other apps including HBOGo, Showtime Anytime, Spotify, Rhapsody, Netflix. All were really easy to connect, setting up the device was easy. The streaming works great and the games are an added bonus. Love it!", "verified": true, "helpfulness": "0/0", "author": "Angela"}]