[{"rating": 5.0, "review": "Kicks Apple TV's booty!!!", "verified": true, "helpfulness": "0/1", "author": "Kris"}, {"rating": 5.0, "review": "Love it! The options for uploading apps is excellent.", "verified": true, "helpfulness": "0/0", "author": "Amber"}, {"rating": 5.0, "review": "This is a cool little device... it does everything a playstation or xbox does.  you can even buy controllers for it and play games... it's very responsive as far as the voice recognition goes...I enjoy this thing!", "verified": true, "helpfulness": "0/0", "author": "Zachary Samuels \"Zachary Samuels\""}, {"rating": 5.0, "review": "its amazon made enough said %100 great working and usable product great for setting up parents or grand parnts up with unlimited movies through $99 prime member amazon,netflix $7.99,hulu plus $9.99 and crackle free just watch ads during and before movie", "verified": true, "helpfulness": "0/0", "author": "josh morris"}, {"rating": 1.0, "review": "BIGGEST WASTE OF MONEY  MOVIES WILL NOT DOWN LOAD!!! IT TAKES ALMOST 10-15 MINUTES BEFORE YOU FINALLY SEE YOUR PROGRAM .YOU NEED TO PAY REGULAR FEES SAME AS RED BOX NETFLIX YOU JUST DO NOT HAVE TO RETURN EVEN BEING PRIME YOU PAY FOR JUST ABOUT EVERYTHING THEY HAVE (WHAT IS THE SENSE OF HAVING $99 A YEAR SUBSCRIPTION AND PAY FOR THIS THEN STILL PAY TO WATCH A MOVIE DO NOT RECOMMEND", "verified": true, "helpfulness": "2/6", "author": "debbie montero"}, {"rating": 5.0, "review": "I am enjoying Fire TV so far. I love the second screen capability and the mirroring of my Kindle. Picture and sound are excellent. Hoping to see some of my favorite tv apps added in the future, such as WatchABC, ABCFamily, TBS, etc.", "verified": true, "helpfulness": "0/0", "author": "Penny Tunnell"}, {"rating": 5.0, "review": "Great stuff", "verified": true, "helpfulness": "0/1", "author": "long time Amazon user"}, {"rating": 4.0, "review": "I bought this product as I was heading overseas so I could keep up with the movies and tv shows I would be missing.  I soon found out that this would not work outside the United States. They have since corrected this with so I can now access all the media and  now they have added the music so it it is like having a theatre, gaming sytem and stereo all in one. My only disappointment is that it has a usb port that has no function. I was hoping I could connect my hard drive to view and play my media. Hopefully this will be active in a future upgrade.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I really wanted the Amazon Fire TV. I tried three times with the help of your tech assistance and vizio tech support.  We all could not get the sound to work on my model tv. So sad!!!", "verified": true, "helpfulness": "3/6", "author": "Michele Dancel"}, {"rating": 3.0, "review": "I mostly use the Fire now to watch Netflix as all the shows that Amazon offers are expensive. They cost more than watching them on Comcast. Comcast has a feature where I can list free movies. I have not found a way through voice command or menu option to find free movies easily. Also I have connected a CAT-6 cable as movies freeze/pause with the wireless option.", "verified": true, "helpfulness": "0/1", "author": "Bob Jasionowski"}]