[{"rating": 5.0, "review": "Absolutely love this thing. Was a gift for my husband for Christmas and he said it was very easy to hook up. Only complaint is that it's a pain to use with Hulu, but I think that's Hulu rather than Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Jennifer E. Flint MacLean"}, {"rating": 3.0, "review": "The Chromecast does the job with respect to picture quality and works pretty well on the wifi in my home. However, I tried to use it in a NYC hotel and it would not access the wifi that was available. Also, it works with hulu, netflix, amazon and other streaming sites but does not offer other options for photos and other websites.", "verified": true, "helpfulness": "0/1", "author": "Ron the reader"}, {"rating": 1.0, "review": "I was online and on the phone with Google Chromecast support for over 5 hours trying to get this to even work. It found and recognized my WiFi, but refused to be linked to any of my devices, including our iPad 3, Nook HD and LG Android phone.Google's advice to me after going through the setup process almost a dozen times? Try buying ANOTHER device, \"it may work then...\" I returned it the next day. Got a new Blu-ray player instead for $30 bucks more. That machine's WiFi worked immediately and I had a lot more online content choices available.", "verified": true, "helpfulness": "2/3", "author": "chicagorob"}, {"rating": 5.0, "review": "Works as advertised, simple to set up, simple as that.  Just ordered a 2nd one!  Using IOS devices. Now if only Amazon Instant Video would add it!", "verified": true, "helpfulness": "0/1", "author": "Jessica"}, {"rating": 4.0, "review": "Awesome product, love it. The instructions were almost non-existent but I was able to find what I needed online without any problems.", "verified": true, "helpfulness": "0/1", "author": "Scott"}, {"rating": 2.0, "review": "i got a different design than i expected! it was not like what was in the picture! and smaller than i expected too", "verified": true, "helpfulness": "0/3", "author": "Duran"}, {"rating": 5.0, "review": "Come on. How can you go wrong at $35?I was going to buy a smart TV as I wanted to watch Netflix on my TV, since my laptop is down but opted for this instead (for now..still need a bigger screen).This is a great device. Easy to setup and casting from your phone is simple and probably better than having to search using your remote.I'm having fun just making a TV playlist on YouTube and leaving it to play.I'd recommend to anyone.", "verified": true, "helpfulness": "0/1", "author": "UltraMario"}, {"rating": 5.0, "review": "It does everything that it promised! I bought this for my father for Christmas, and since then he has watched a movie every night after work. I think its worth the price I paid to give my parents a nice distraction from all the BS they are going through.", "verified": true, "helpfulness": "0/0", "author": "R. L. Sylvester"}, {"rating": 5.0, "review": "was a gift for my daughters however I've been using it everyday since christmas.  Love it.  Plus more apps are being created now, however i used it for Netflix and Hulu and youtube the most.", "verified": true, "helpfulness": "0/0", "author": "Steven Mills"}, {"rating": 3.0, "review": "it does work only with limited Iphone and Ipad numbers of applications (Netflix and Youtube).However, for PC and MAS computer users it is good", "verified": true, "helpfulness": "0/0", "author": "Val Kudry"}]