[{"rating": 5.0, "review": "This unit is GREAT! I have a TV with internet connection support however, what do I do, run a line or buy a wireless dongle?Neither!  With the CHROMECAST device, I was able to easily connect to my network. What is special about that, it was only $35 investment.When I use the Chrome browser from my phone or laptop, I can CAST to the CHROMECAST device, thus displaying the browser display to the TV.I also have a NAS so any media that I have on it can be played on the TV.Only a couple of apps to download to both the computer and phone.The CHROMECAST plugs into the HDMI port on the TV, and requires power. The power is connected through a miniUSB port on the device and if you TV has a USB port, the cable will connect there. If the TV's USB port doesn't supply enough power don't worry. The CHROMECAST comes with a AC power unit which plugs into your house power and just plug the USB cable into the port on the power unit.Don't forget to select the HDMI input on the TV to connect to the CHROMECAST.WHAT A DEAL!", "verified": true, "helpfulness": "0/0", "author": "William R. Mchugh \"Mr Bill\""}, {"rating": 3.0, "review": "I purchased this to take on travel with me and use it in the hotel rooms. I thought it would be portable and convenient for this purpose. Unfortunately, it does not work in most hotels due to the wifi factor. The chrome cast is not set up for that. There is no option on the chrome cast to overpass the security or put in a password that the hotel wifi uses. There is limited use with the device, but is fine for at home viewing for only Netflix and you tube. Do your research before you purchase. I usually do, but not thoroughly this time and now I will barely use this item, so I may just give it away since I already have Apple TV. Good product otherwise, but not for travel purposes.", "verified": false, "helpfulness": "0/0", "author": "Dawn Harmon \"riznsun\""}, {"rating": 4.0, "review": "Very good device.I just dindn't find yet how to play movies and fotos recorded by my celular using the defaut Android software.", "verified": true, "helpfulness": "0/0", "author": "Alcides A."}, {"rating": 5.0, "review": "I can't believe how clear the picture is with this thing. i use it to stream HBO go and the picture is straight up HD and looks great, really easy to use. All in all love it and recommended it to everyone I know.", "verified": true, "helpfulness": "0/0", "author": "Christopher Ahern"}, {"rating": 5.0, "review": "Excelent device, Netflix works very good.I hope i can use Moviecity Play, Fox Play and HBO Go at Latinamerica soon.Thanks.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Ferri"}, {"rating": 1.0, "review": "You want us to buy your products but you don't want to work together. Like children.This product will not work with Amazon Instant Video.", "verified": false, "helpfulness": "1/2", "author": "steve_o_tx \"steve_o_tx\""}, {"rating": 1.0, "review": "Admittedly have not spent any more time with it, but it did not work as advertised.  Plugged it in and got no indication that it was interacting with the television at all.", "verified": true, "helpfulness": "0/1", "author": "tskelton1"}, {"rating": 5.0, "review": "I would recommend this product to anyone. The instructions for setup were clear and easy to follow. My family and I have used this device almost every day since we purchased it and it has not given us any issues.", "verified": true, "helpfulness": "0/0", "author": "Alicia Bentley"}, {"rating": 5.0, "review": "It is not perfect but is very friendly to use and works perfect with Netflix and Youtube also with Redbull TV", "verified": true, "helpfulness": "0/0", "author": "Roberto Escalante"}, {"rating": 1.0, "review": "Too hard to install. I'm not able to use it mi made my internet crash. Bought Apple TV and no problem", "verified": true, "helpfulness": "0/0", "author": "patricia waffenschmidt"}]