[{"rating": 1.0, "review": "This device has great potential if they provide instructions that a normal person can understand.  They only send simple instructions but when they don't work, you get a reference to an error code that requires a phd in IT. Now, i have to figure out how to return it.", "verified": true, "helpfulness": "0/1", "author": "Gary L. Kennedy"}, {"rating": 5.0, "review": "love this product its very easy to install and it works great very easy. takes any non smart TV to another level.", "verified": true, "helpfulness": "0/0", "author": "carlos aquino"}, {"rating": 5.0, "review": "Is a very good item,  works perfectly, speed, definition are great.  Smart tv is now very easy to get in any TV", "verified": true, "helpfulness": "0/0", "author": "Andres A Bolanos Arturo"}, {"rating": 5.0, "review": "Excellent product concept! To view digital content from your device on a big screen and share it is great. Setup is simple and in a few minutes you are ready to go.", "verified": true, "helpfulness": "0/0", "author": "Robin Y. Greenlee"}, {"rating": 4.0, "review": "Works well for what it is designed to do and works for the apps for which I have primary interest.  If you don't have a TV with the ability to connect directly to the Internet, this is a very good alternative for viewing online content on your TV.", "verified": true, "helpfulness": "0/0", "author": "Ted S"}, {"rating": 5.0, "review": "Got one for my dad and also for my husband this Christmas. My husband was able to sync up my laptop and his ipad to the TV with no issues, and my dad was also able to get it working on his laptop with no problem at all. Highly recommend for those trying to eliminate the need to have a long enough HDMI cord or for those with a device that does not have an HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Lisa"}, {"rating": 1.0, "review": "Chose this item to enable me to watch Netflix.  Have done everything according to the instructions;  receive signal from router, shows Chromecast on TV screen, but cannot get the CAST icon to show up properly, either on Netflix or my computer.Wasted $35.00.Downloaded extension too many times also.", "verified": true, "helpfulness": "0/2", "author": "annie"}, {"rating": 5.0, "review": "Great product, easy install, great options. If you don't have a smart tv..you need this ! Vendor exc , too.", "verified": true, "helpfulness": "0/0", "author": "IR Forever"}, {"rating": 1.0, "review": "Had to disable UPnP on my router in order to install.  (No tech support to do this).- Once installed, the broadcast quality, transmission speed, was very poor.- Had to change setting to \"Poor Quality\" in order to \"cast,\" but the \"casting\" kept disconnecting.  I tried multiple times.- Nothing else was running over my network, so there was no interference either.  I pay for high-broadband speeds on Comcast, so I know it's not my router.- Could not display other things from my laptop either (like pics, videos, etc.) b/c it kept disconnecting.Very disappointed in this.", "verified": true, "helpfulness": "1/2", "author": "Tony B."}, {"rating": 5.0, "review": "The chromecast did exactly what it advertised and what I needed to do. Extremely satisfied and everyone loves it. I've used it in 4 different homes. I have no drawbacks and just expect it to get better!", "verified": true, "helpfulness": "0/0", "author": "Shelomythe Nelson"}]