[{"rating": 4.0, "review": "I had an issue with the device not being able to reconnect after the initial setup,  but it turned out to be my wifi access point blocking it.  Once I switched out the wifi AP everything has been working great.  Awesome buy for the price.", "verified": true, "helpfulness": "0/0", "author": "J. Adams \"jaadfoo\""}, {"rating": 5.0, "review": "Keep It Stupid SimpleChromecast is a huge step towards keeping it stupid simple to kick content from you portable device to your big screen. This device is easy to plug in, install and start using.My only wish was that it had optional MHL support for those that can use it so the USB cord is optional", "verified": true, "helpfulness": "0/0", "author": "Rob W."}, {"rating": 4.0, "review": "Setup was easy and work fine for the price. I was watching a youtube and netflix on my TV, the quality is very good. I playing music from my Google Play music app too and sounded great. With last apps additions Plex is the best, i use my Windows PC to play any personal video or my DVD TV Series Collections.It's clearly a good solution for a low price.", "verified": true, "helpfulness": "0/0", "author": "eQ"}, {"rating": 5.0, "review": "I bought this to try out because i was on the fence as to whether I wanted to replace my 60\" TV With a new Smart TV. I am glad that I decided to do this first. I watch a lot of stuff on Netflix, Hulu, and Youtube. It is by far the best way to get these on my non-smart TV. The box comes with everything you need to get started. If your TV does not have a USB port it even comes with a adapter so you can plug it into a wall socket. The set up was quick and easy, and took less than 5 minutes. It works wirelessly so there is no need to have Ethernet cable to my TV. You can also stream your music from google play or pandora as well. I just ordered two more devices for my other home TV's this way no matter what room I'm in, or my family can watch one thing in one room on Netflix and I can watch a different movie on another TV. Another benefit is that anything I can bring up in my Chrome browser I can put on the TV. So I can show people my pictures or bring up a web page for all to see. I have even done my gmail with it. I would recommend this product to all my friends. For $35 this is by far the best value out there.", "verified": true, "helpfulness": "1/1", "author": "Steve \"Steve\""}, {"rating": 2.0, "review": "Set up is fairly annoying. Can be very frustrating. Support doesnt seem to be built in as well as it should be.Once you get it working it is really nice.Note: you can't use it as a second screen when you aren't watching netflix, youtube etc", "verified": true, "helpfulness": "0/0", "author": "Carol Pendleton"}, {"rating": 2.0, "review": "well, it has potential ... but since i live outside US the is still very little to do ... it has the potential to become something really worth it .. but for now it is simply not there yet !also the screen mirror from PC has alot of lag .. and the video / audio does not sync ! (it is still in beta, so hopefully this will be solved )", "verified": true, "helpfulness": "0/0", "author": "Libano-Barcelonais"}, {"rating": 2.0, "review": "This device will not stream your desktop or anything from your computer.The original was capable but after an update this is no longer possible.2 stars Google why must you try to control us?  better off buying a used $50 laptop Dedicated to streaming rather than purchasing one of these devices.  All Roku, apple TV, Rasberry Pie, Chromecast;  type devices are not technically mature enough yet for the price.  Chromecast is close, if you only watch netflix and youtube.", "verified": true, "helpfulness": "0/2", "author": "Chris"}, {"rating": 4.0, "review": "I have an older flat screen tv in my sewing studio.  It does not have wifi and I wanted the chromecast player installed permanently to watch YouTube videos with my Ipad.  It works quite well for this purpose.  It is a different concept from the Roku,  I feel it is well worth the cost.  The lack of good instructions keeps this a four star rating.", "verified": true, "helpfulness": "0/0", "author": "Marijean Johnson \"MJJ Johnson\""}, {"rating": 5.0, "review": "This works great. If you have a Netflix account and a smartphone you need this. its faster than any other method of watching I've seen. its fast and simple to setup and the only problem I have is with the actual Netflix app. amazing product.", "verified": true, "helpfulness": "0/0", "author": "Zachary Barry"}, {"rating": 5.0, "review": "Bought three, gave one as a gift. Hooked it up, plugged in, turned on, went to URL registered. BAM! Working!Simply awesome. I am very, very happy with my purchase. Sad, I just bought I huge LG smart TV, Money wasted.Great buy, Great Product", "verified": true, "helpfulness": "0/0", "author": "Pamela the great \"pw\""}]