[{"rating": 4.0, "review": "Sometimes a bit quirky to get it ti work.", "verified": true, "helpfulness": "0/0", "author": "Dave C."}, {"rating": 2.0, "review": "It worked for about two weeks, then suddenly stopped. I've tried everything to get it working again, to no avail. I do not recommend this device, as going online has shown me this is a common problem. Basically I now have a flash drive full of really nice photographs that doesn't perform any other function.", "verified": false, "helpfulness": "0/0", "author": "xiaolong"}, {"rating": 5.0, "review": "This is the best thing you can buy to upgrade a dumb tv on a budget.", "verified": true, "helpfulness": "0/0", "author": "C. Church \"PRO SKATER\""}, {"rating": 2.0, "review": "seems to have stopped working on my upgraded windows 8.1.. don't know if its my windows system, or the Fios network, or the unit itself is malfunctioning.  Not using it anymore.. tried to get to customer support.. but that was no help..", "verified": true, "helpfulness": "0/1", "author": "nadia"}, {"rating": 4.0, "review": "Works well, easy to use and setup.  Things broadcast well from Chrome even if not supported by an app.  I did not realize that it needs to be plugged in before I purchased it, but luckily I have a nearby outlet.  Only concern is that it never turns off.", "verified": true, "helpfulness": "0/0", "author": "Denis"}, {"rating": 5.0, "review": "Excelent!", "verified": true, "helpfulness": "0/0", "author": "Víctor Espino"}, {"rating": 3.0, "review": "YouTube and Netflix work great but for some reason you can't watch Amazon instant video. Huge disappointment. Update your app Amazon!", "verified": false, "helpfulness": "0/0", "author": "rutgersdude"}, {"rating": 3.0, "review": "Chromecast is not what you think? Dependency on a laptop or mobile device. Chromecast is cheap because you must use a laptop or mobile device to \"chromecast\" or stream your content to your TV, meaning without something to stream from, chromecast will have no content.Chromecast has support for Netflix, Hulu and HBOGO, but again you must have you iPad logged into HBOGO and set to chromecast/stream to watch. This is great when your SmartTV does not offer HBOGO and you are in a different location.If you are in need of a standalone unit which offers Netflix, Hulu and HBOGO, then Roku 3 or Apple TV are your alternatives.Chromecast is great for stream content from your iPad or laptop to your TV over Wifi, but then again the mobile app must support chromecast streaming.I was looking for a Smart TV enhancement for my regular Dumb HDTV, chromecast is a good choice keeping in mind that you must use an iPhone or iPad in conjunction with the streaming.", "verified": false, "helpfulness": "0/0", "author": "PHK Corporation"}, {"rating": 2.0, "review": "First, it great for Android, full stop!  But anything else, it's not ready.  Only supported function in the iOS world is sending static pictures or WEB based content.  Windows world, nothing but headaches.  Some video bus functions (Internal to the laptop) can handle this.  But majority of computers I have used to streaming video files, constant hanging.  Not so much the device, but the software on the windows platform.  Being stuck with the \"Chrome Browser\" doesn't help the situation because several sites don't play well in Chrome.  Even casting local media files will cause the dreaded image freeze.  I can then change the resolution and back again and the image starts moving again.  You should look at the Chrome \"Extension\" is still marked as Beta.  That should be a clue it's not ready for prime time.Update: to use Windows based systems, I found that this device requires a isolated  wireless access point.  Or private wireless with internet access and one casting device.  Any other traffic in the wireless network will cause freezing.  The data stream packets don't have an end stop bit or any way to tell the receiver restart stream.  You can manually send one by changing resolution.  Also because for the lack of stop and start packets for the device, any RF noise can and will freeze the image.  Cell phone too close or anything that sparks or even another wifi close to your wifi will cause freezing.", "verified": false, "helpfulness": "1/1", "author": "David"}, {"rating": 5.0, "review": "It arrived on time, great packaging, easy setup, quickly updated itself, and has really good video quality. Previously I was watching Netflix on my (not particularly smart) Panasonic TV with a wireless dongle connected to my wifi. Well that connecting would always have to be reestablished, buffered a lot, and was often of poor video quality.The Chromecast just works as advertised.", "verified": true, "helpfulness": "0/0", "author": "bsoten"}]