[{"rating": 5.0, "review": "I was waiting for the madness to subside before I ordered one of these. It was easy to set up and very easy to use. Have used it off my laptop and my phone... no problem.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "What do I mean by hiccups as well as the positives?1. Setup - Requires another wireless device to set it up. I couldn't set it up from a device/computer hardwired to my router....the setup device MUST also be a router connected wireless device.2. Setup - To set up chromecast using a MS Windows wireless device, the device CAN'T be an Win XP device (at least I couldn't get it setup with my Win XP netbook). I only had a XP wireless netbook so I had to borrow my wireless laptop from work which runs Win 7. If you run iOS/android/Win 7 wireless devices you can set up no problem. Heck I even have a Chromebook and couldn't set it up with that. But when I was able to final do the setup, it was very quick...less than 2 minutes.3. The good - AFTER I setup my Chromecast with my the Win 7 laptop I borrowed from work, my Win XP netbook worked fine as far as casting youtube videos from Chromecast (haven't tried Google Play or Netflix yet). So it seems that only setup requires a Win 7 device (or iOS/Android). I haven't tried my Chromebook yet but I believe it will work since the main issue I had was the correct wireless device needed to do the actual setup process. Also not sure about my wired desktop...but the chrome browser and youtube shows that I do have a \"cast\" icon.4. The good -  You do NOT need to have a USB port on your TV. You MUST have a free HDMI port on your TV. Chromecast simply uses USB to power the device. Chromecast comes with a USB cord PLUS a USB power outlet adapter plug. So if you don't have a USB on your TV, you can just plug the USB into the power adapter which then plugs into a standard electrical wall outlet.It was a bit frustrating that I couldn't set up the Chromecast with a Win XP device or a hardwired (non-wireless device directly connected to my router). I had to wait to set up my Chromecast until the next evening when I brought my work Win 7 wireless laptop home. Not sure what's up with that, but that is the way it goes I guess.Anyway, after the Chromecast was finally set up it has worked flawlessly to cast youtube videos. And the videos are crisp without any stutter. I do own a Roku and mainly want to be able to cast youtube, which Roku has completely failed to implement for some strange reason. I also love the fact that I can use a freaking keyboard (using my little old netbook) - another thing that Roku has completely failed to incorporating into their product - which I am in complete disbelief of (the search method with their remote it truly cumbersome, slow, and down right annoying. But as a caveat, I love the freedom from cable that Roku brings to TV).I do hope other streaming organizations support Chromecast. I particularly want Vimeo to support chromecast. Roku has it...but again without a keyboard, searching for video's is beyond terrible IMO. It is Sept 21st and the last real report back on July 31st indicated Vimeo and Redbox would support Chromecast. Not sure why it is taking them so long to implement casting through Chromecast.Anyway, for $35 bucks this little thing can't be beat for youtube, play, and netflix. Just make sure you have access to an appropriate wireless device on your network that you can use to setup the Chromecast.", "verified": true, "helpfulness": "1/2", "author": "Dean R"}, {"rating": 3.0, "review": "I bought chromecast about two weeks ago from Google play. I have the device and test it thoroughly in my home network system. In my idea if you have any other device which supports Netflix and YouTube the only main feature you might look into for chromecast is its capability of casting from your chrome browser to TV.I have Asus RT-AC66u as router which supports the 1.3 GB bandwidth over my wireless network and connected my PC to it through 1 GB port. This trick helps me to transfer the data close to 1 GB/S without having an Ac Wireless adapter over my wireless network. SO I can communicate with my chromecast well over the N standard speed which chromecast supports. It is good idea to use the HDMI extension cable provided with Chromecast since it acts like an antenna per what it says in manual.Unfortunately still there is a lots of lag between my PC and Chromecast. I can not say I'm disappointed however it is not what I was expecting. so if you are looking for just casting the videos from your PC to TV this device still needs more improvement and based on my experience it will not satisfy you.Please in comment section let me know if you have any other solution our experience to improve the chromecast network performance.", "verified": false, "helpfulness": "2/3", "author": "Ali"}, {"rating": 4.0, "review": "Google updated the device and got rid of the hack. the hack allowed you to view anything you wanted on the device not just netflix and chrome", "verified": true, "helpfulness": "2/3", "author": "rah"}, {"rating": 5.0, "review": "I'm probably a little biased as I love basically anything google makes but I like it so much that I went out and bought another one for our bedroom, its really hand and works really well. I would recommend that anyone that gets one of these though would also use the web player with plex.", "verified": true, "helpfulness": "3/3", "author": "Reuben Devries"}, {"rating": 1.0, "review": "Set up is not easy, does not work with Netflix, and no customer support. I have been spoiled by Apple products that work as intended out of the box. This product truly a disappointment", "verified": true, "helpfulness": "3/14", "author": "Sandwich maker"}, {"rating": 2.0, "review": "First, it gets +1 star for coolness. Put what's on your phone onto the TV, wirelessly, after just a few minutes of setup, for only 35 dollars. Yes, that's cool.What it does, it does well.What it doesn't do is why I returned it.It doesn't do anything, except for coolness.And except for Netflix and YouTube, both of which are available in better resolution via the computer that's plugged into my TV. Netflix and YouTube are the only things from my iPhone that I can display via Chromecast on my TV. I was going to rig the iPad to display via Chromecast, too, but that will work no better than the iPhone according to the Chromecast online help.I had expected to display a much wider range of things, like a PowerPoint presentation, or http://LeMonde.fr, or my FaceTime conversation with my girlfriend.Maybe I'll try the AppleTV/Airplay ($$!) option. My neighbor's teenage kid had rigged that up at their house, playing recorded music on the TV while the screen gave a slideshow of various photos. That was cool, of course. See first paragraph. My old Windows XP computer, with Winamp and Picasa Screensaver, has spent most of every day doing the same thing since 2010 on the attached monitor and stereo speakers. It can wirefully do the same thing as the AirTV/AirPlay demo, if I plug the computer into the TV.Maybe in two or three years the technology will have expanded my choices, or leapfrogged the issue entirely, and I'll look into it again.", "verified": true, "helpfulness": "1/4", "author": "Daniel Brockman"}, {"rating": 5.0, "review": "I love Chromecast. This device is great for my Android tablets and phones. I don't have to worry about getting other cables to connect to my TV.Hopefully, Google will come with an update to mirror the phone to output on the TV/monitor like Apple TV.", "verified": true, "helpfulness": "0/1", "author": "A-Tan"}, {"rating": 4.0, "review": "It works great for what it is. My only disappointment was I ordered during the 3 months free of netflix. My order was back ordered and when I finally got it. I didn't get the 3 free months of netflix.", "verified": true, "helpfulness": "1/2", "author": "Kathryn J. MccUtcheon \"kattie mom\""}, {"rating": 4.0, "review": "Update 3/10/2014  The rating is upgraded to 4 stars with Allcast now compatible with Chromecast.I had high hope for Chromecast connecting my Nexus 7 2013 to HDTV wirelessly.  After trying it for a week and gaining a full understanding of its current limited capability, I can only recommend 3 stars.I returned my Chromecast. The deal breaker is Apple's not allowing AirCast (also known as AllCast), a 3rd party android app, to cast local content of my Nexus 7 2013.", "verified": false, "helpfulness": "2/3", "author": "Just Another Reviewer"}]