[{"rating": 4.0, "review": "Works fine.  On my HD television screen it is not a sharp as image as my cable programs.", "verified": true, "helpfulness": "0/1", "author": "Carl in Tampa"}, {"rating": 2.0, "review": "You need a another device (notebook, ipad, etc) to operate this piece. There are better products on the market. So far, nothing beats Roku.", "verified": false, "helpfulness": "0/2", "author": "Faisal Towfik \"Malasay\""}, {"rating": 5.0, "review": "I freaking live it!!!!!!!  It's the best thing ever invented!!!", "verified": true, "helpfulness": "0/1", "author": "Dee Cresina"}, {"rating": 5.0, "review": "Wow, nice piece of tech!... I use it every night. The cleanless image is awesome, something that I can not describe. Just buy with eyes shut!.", "verified": true, "helpfulness": "0/1", "author": "E. J. Mitter \"Geek Looking Good\""}, {"rating": 5.0, "review": "I was hesitant at first to purchase this, as we already have an xbox player. But I use this more than the xbox. Super simple to use and quick too. I have one on every TV in my house.", "verified": true, "helpfulness": "1/1", "author": "sbpfit51"}, {"rating": 3.0, "review": "works ok but have had to reboot sometimes when it looses connections to our devices. also a pain that it will not work with Windows RT, or Windows Phone. also could not set it up with a desktop computer, only a laptop, because it needed Wi-Fi on the device use during setup.", "verified": false, "helpfulness": "1/1", "author": "J. Tyler Lehman"}, {"rating": 2.0, "review": "It worked great for the first couple of months but now it only works intermittently. Going to buy a blue ray player instead.", "verified": true, "helpfulness": "0/1", "author": "Shani L Quintela"}, {"rating": 4.0, "review": "Great product, I own two of them. The downside is you have to have a device connected to work, and that one device cannot power two chromecasts at the same time. I recently pre-purchased the Amazon FireStick so we will see how that goes!", "verified": true, "helpfulness": "0/1", "author": "J. \"frost110\""}, {"rating": 5.0, "review": "Chromecast is awesome! Makes it really easy to stream stuff on your big screen. Hooked one up at my Parent's place and it's easy enough for them to use as well.", "verified": true, "helpfulness": "1/1", "author": "Steven P."}, {"rating": 5.0, "review": "Simple and quick setup. Works great and my router is two floors above where I am using it! I would recommend to anyone trying to get more out of their smartphone (I'm using Chromecast on my iPhone). I've used it with YouTube, Pandora and Netflix so far", "verified": true, "helpfulness": "1/1", "author": "Vincent Melapioni"}]