[{"rating": 5.0, "review": "Its a Google product.. how could it go wrong... Excellent product and extremely easy to setup.  I have a smart TV (samsung) and the stock apps are boringly slow and hence i decided to get this one. It works extremely well with my Iphone, Ipad, Dell laptop and Samsung S3.  I would definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "PR_Mystuff"}, {"rating": 5.0, "review": "If you don't have one get one! I use my everyday since I bought it! who needs a remote when you always have your phone!", "verified": true, "helpfulness": "0/0", "author": "Joshua Birge"}, {"rating": 1.0, "review": "Will not work with windows on a desktop", "verified": true, "helpfulness": "0/1", "author": "Michael Alan Dekle"}, {"rating": 1.0, "review": "I really wanted this to work but all I ever got was a solid white light and the loading page on my tv. Unfortunately I waited to long to try it out (I had to buy a converter because my tv didn't have a HDMI) and now I can't return it.  I tried it on a tv with a HDMI slot and it didn't work there either.  Even my techi friend couldn't make it work. I must have gotten a bad one.", "verified": true, "helpfulness": "0/0", "author": "Debbie Parker"}, {"rating": 5.0, "review": "I figured it out! works great with my acer c720.", "verified": true, "helpfulness": "0/0", "author": "David C."}, {"rating": 5.0, "review": "Works great for watching Youtube videos on my TV.  Easy to install, but you'll need a free HDMI port on your TV, a good wifi connection and a Google account to use it.  It's not powered by the HDMI port.  I had to use the included USB cable and plug it into the USB port on my TV to get power.  It also includes a plug-in AC power adapter, in case your TV doesn't have a USB port.  You gotta have an HDMI port on your TV to use it.  If your TV doesn't have an HDMI port, it's probably time to buy a new TV anyway.You need to download Chromecast and Google Play apps to use it.  At first I installed the apps on an iPad.  The kids were always using the iPad, so switched and installed the apps on my iPod Touch instead.  The iPod Touch makes a great 'remote control' for watching Youtube videos without tying up the iPad.  I didn't try installing these apps on an Android device or PC.", "verified": true, "helpfulness": "0/0", "author": "The Penguin \"Techno Geek\""}, {"rating": 3.0, "review": "Make sure your t.v. has HDMI, older tv's do not. Check the sides of your t.v. for one before ordering this. They don't sell special adapters for this that have both sound and picture.  Otherwise this is an awesome product. I couldn't stream it in my living room because our flat screen is about 11 years old.", "verified": true, "helpfulness": "0/1", "author": "Maria Leo"}, {"rating": 3.0, "review": "I give this a three star because I returned it.  When I bought it was stated as for being for \"streaming\".  I thought it would put everything on my PC screen on to the TV screen without the HDMI cable.  It didn't, so I returned it.  Typical Amazon. Returned with no problem and my card credited very quickly.", "verified": true, "helpfulness": "1/2", "author": "Nikon user."}, {"rating": 5.0, "review": "Why pay for HBO when you can get movies for free.  I know nothing about electronics but this was easy to install and my cell phone is my remote. I love this product because I have no wires hanging from my TV.", "verified": true, "helpfulness": "0/0", "author": "terry w"}, {"rating": 3.0, "review": "I haven't been able to figure this out but if it's Google it must be good", "verified": false, "helpfulness": "0/2", "author": "Paul Knowles"}]