[{"rating": 2.0, "review": "This device does NOT enable you to stream Internet content from the Google Chrome browser on an iPad or iPhone.  You can only stream Internet content from Google Chrome on a PC or laptop.  Google's advertising (quoting directly from Google's Amazon site from which I made the purchase) says, \"Allows to cast a Chrome browser tab\" and \"works with Android phones and tablets, iPhone, iPad…\"  I purchased Comcast so that I could stream content such as archived PBS Masterpiece Mystery series, the PBS website has more than you can get on Netflix or cable's \"on demand.\"  Same thing with Comedy Central, to watch full episodes of Daily Show or Colbert  Report (extra music or extended interviews, etc.).  We have a \"smart TV,\" but it is not really so \"smart.\"  Typing and surfing Panasonic's Internet browser feels like chiseling the first wheel.  So all I really wanted was something that could allow me to stream from an iPad  chrome browser to the TV, something like the Apple TV/air play.Chromecast does not do what the Apple TV can do.  It is regrettable that Google leads you to believe that it can, all the way through to the last step of the setup process which is to download the \"extension\" which would then appear as an icon in the Google browser just to the right of the address box and function just like the Apple airplay (without mirroring).  When you tap \"click here\" to download the extension, you get a new webpage with lots of information but no new icon in your browser.  Nor does there seem to be any way, in help, technical support, FAQ, etc., to find out why it does not work and what to do.  I called Google support, they verified that their product does not work in their browser in an iPad or iPhone.  It apparently does work with a laptop or PC (the wheel having surpassed the Stone Age).  So, the product goes back, Google wasted a lot of my time, it wasted some of its own time, I will spend more and get the Apple TV.  If you are using an iPad or iPhone, chromecast would be okay for Netflix or YouTube.", "verified": true, "helpfulness": "0/0", "author": "Michael W. Gendler"}, {"rating": 5.0, "review": "Good Product", "verified": true, "helpfulness": "0/0", "author": "Simon Shmatnik"}, {"rating": 2.0, "review": "the picture is ok but the sound is not good at all", "verified": true, "helpfulness": "0/0", "author": "ISSAOU TCHASSAMA"}, {"rating": 1.0, "review": "The GoogleChrome cast is without a doubt one of the worst things created created by Google.First of all understand Google Chrome cast has no customer support I repeat no customer support.Number two since the mandatory upgrade you can't log on to Netflix or Hulu and HBO threw some phones.If you purchased this you might as well just send $35 into Google as a donation. It is a waste of money, it will not work and google has no customer support to help you make it work causing unnecessary frustration.", "verified": true, "helpfulness": "0/0", "author": "MMMLAR"}, {"rating": 5.0, "review": "It works very well. Perfect design ,easy to use and no problem.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works fine if the wifi router allows", "verified": true, "helpfulness": "0/0", "author": "Lewis R. Poley"}, {"rating": 5.0, "review": "Oh man! I love this thing! For those of you who love to stream using Netflix and were using the WII previously you will be so glad to bought this and can now use your phone as a remote instead of the annoying wii remote.", "verified": true, "helpfulness": "0/0", "author": "Katy"}, {"rating": 5.0, "review": "Works great to view videos from computer, laptop or Android phone. Very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Stevenson"}, {"rating": 1.0, "review": "Was not able to cast everything from you computer... Only able to cast app (Hulu/YouTube etc) or Google chrome cast related stuff.. Kinda weak ..", "verified": true, "helpfulness": "0/0", "author": "Phothong Sourivanh"}, {"rating": 5.0, "review": "Works as intended", "verified": true, "helpfulness": "0/0", "author": "Steve Bradley"}]