[{"rating": 3.0, "review": "Bought it purely because of the 2GB RAM statistic, and that I was in the market for a digital TV content box.  However, there are some major issues I've discovered with my 9 months of using the device.Best Features:1. Speed: It works amazing on my internet connection with only a few glitches.2. Access to Amazon Content: I can access anything on Amazon available for purchase very easily.  The Prime tab is what I use most often where the featured Prime content is.  See Search issues below for more details on this topic.3. Inconspicuous: There's no goofy branding. Not on the device, not in a startup logo show, nothing.  Just opens right up to access content, directly from the home screen too--very little additional clicks, except with outside service providers (see Apps below).Problems:1. It doesn't sync/update well.2. Along with #1, Prime Music on Fire TV is TERRIBLE. Impossible to access or sift through, and does. not. update. Which is the most important part, especially for syncing my music on other devices with my TV.  It only works consistently with music I've bought through Amazon.  Prime Music has tons of great content, but I can't access it on Fire TV in a useful way.3. Accessing other content providers can be difficult due to the layout of the Apps tab being so far away.4. Now, they do ads for Amazon Studios content.  They're rare but they intrude on my paying for this device and a membership already, I shouldn't have any ads at this point.", "verified": true, "helpfulness": "0/0", "author": "Sam L."}, {"rating": 5.0, "review": "Love the fire TV! have 2 Fire TV's and 4 fire sticks.  Waiting.... for the new fire tv version to come out!", "verified": true, "helpfulness": "0/0", "author": "cookies and cake pops how cool"}, {"rating": 5.0, "review": "I love my Fire TV.  It is easy to use and has all of the apps I need/want.  The interface is very user friendly.  I love everything about it.  I am so glad I purchased it.", "verified": true, "helpfulness": "0/0", "author": "Mom of 3 Boys"}, {"rating": 3.0, "review": "I change my internet provider and the amazon fire refuse to work with the new provider (suddenlink) I have tried all the troubleshooting techniques and nothing works, please advise", "verified": true, "helpfulness": "0/0", "author": "Denny Romero"}, {"rating": 5.0, "review": "Love this Fire TV!  Works great!", "verified": true, "helpfulness": "0/0", "author": "norma sigmund"}, {"rating": 4.0, "review": "great product, works fast and very well.", "verified": true, "helpfulness": "0/0", "author": "Bobby Rana"}, {"rating": 5.0, "review": "I can't believe how much faster the FireTV is, than the AppleTV. I'm very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Dave Stevens"}, {"rating": 5.0, "review": "This is the future for television watching.  It is easy to setup and use and voice search feature is a huge bonus. Good luck trying to find one. #CuttheCord!!!", "verified": true, "helpfulness": "0/0", "author": "Manny"}, {"rating": 5.0, "review": "Terrific….very fast….love it!", "verified": true, "helpfulness": "0/0", "author": "Stanley Strauss \"\"stosh\"\""}, {"rating": 5.0, "review": "Works perfectly, does everything for us and was pre-programed for us as we are Prime members", "verified": true, "helpfulness": "0/0", "author": "margaret san souci"}]