[{"rating": 5.0, "review": "Just works and is so simple to use and set up. Now I can stream Youtube vids from my laptop with a click of my mouse. Wonderful.", "verified": true, "helpfulness": "0/0", "author": "David Schulpius \"Dave S.\""}, {"rating": 5.0, "review": "Satisfied", "verified": true, "helpfulness": "0/0", "author": "abreland"}, {"rating": 3.0, "review": "I still haven't used it for anything. I stream from Netflix either thru smart tv or BlueRay Dvr or use AVI files from win tablet", "verified": true, "helpfulness": "0/0", "author": "Pauls ddd3 \"Paulsddd3\""}, {"rating": 5.0, "review": "Very easy to use, and work as expected....", "verified": true, "helpfulness": "0/0", "author": "Mauricio"}, {"rating": 4.0, "review": "This thing is great! Easy to use!  You can bring it anywhere to share your movies, TV shows and videos! You can even cast videos from your phone, take videos of family, friends, or anything and play them on your big screen tv! The only downside is that you can not use this item with all websites, for example you can not readily cast all YouTube videos.  That small issue does in no way take away from how amazing this device is! Highly recommend!!!", "verified": true, "helpfulness": "0/0", "author": "Jesse Hudia"}, {"rating": 5.0, "review": "Love my music and videos and movies and I got say this is the best thing I ever bought for streaming media off my phone love it to death and plan to buy another one for the tv in the bedroom and I highly recommend it if your looking at a streaming device for you android phone", "verified": true, "helpfulness": "0/0", "author": "William Chadwick"}, {"rating": 3.0, "review": "Sometimes internet connection is not good even though wifi is okay...anyway I like it", "verified": true, "helpfulness": "0/0", "author": "Jean Lee"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Henry Cintron Lamboy"}, {"rating": 2.0, "review": "I don't know if this even deserves two stars. I am into the Apple ecosystem, but wanted to use it with Chrome and Windows. Compared to a Roku stick or AppleTV, this is pure garbage.", "verified": true, "helpfulness": "1/2", "author": "David H."}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "jose vargas"}]