[{"rating": 5.0, "review": "Absolutely love it, Fire tv allows installations of third party apps. Netflix app works in Canada. The Amazon cloud photos is amazing. Listening to Pandora is great. Would highly recommend to anyone who wants a quality built Android streamer from a reputable company like Amazon.", "verified": true, "helpfulness": "0/0", "author": "Edwin Yeow"}, {"rating": 5.0, "review": "Great device. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Abdullah Balbaid"}, {"rating": 5.0, "review": "It works great but the remote battery doesn't  last 2 days. I assume I have a bad remote I haven't contacted amazon I'm sure they will send a new one other then that it works very fast", "verified": true, "helpfulness": "0/0", "author": "R2"}, {"rating": 5.0, "review": "best money I have spent. Works wonderful.  Why waste money on a smart tv. Just buy a high quality TV and this amazing box.I have never been disappointed with Amazon productsThank You", "verified": true, "helpfulness": "0/0", "author": "mark justus"}, {"rating": 5.0, "review": "Great Technology ... and a great alternative to premium cable channels.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best bang for buck and android app rules. Period", "verified": true, "helpfulness": "0/0", "author": "Richard Simo \"Richard\""}, {"rating": 5.0, "review": "GREAT SYSTEM!", "verified": true, "helpfulness": "0/0", "author": "MICHAEL WHALEN"}, {"rating": 4.0, "review": "Family loves it!", "verified": true, "helpfulness": "0/0", "author": "Chad from Georgia"}, {"rating": 4.0, "review": "So far it's good. We've only had it two weeks, but it is responding well. We did use an Ethernet cable to the Century Link , just to strengthen the signal. The only drawback is we can't figure how to hook up our wireless earphones. There is a splitter that we found but it was very unclear if it would work on the Amazon Fire. But the transition between Netflix and Amazon Prime is effortless. it's a good product.", "verified": true, "helpfulness": "0/0", "author": "Chris Aneiros \"Wyoming person\""}, {"rating": 1.0, "review": "disapointed", "verified": true, "helpfulness": "1/9", "author": "Mark"}]