[{"rating": 5.0, "review": "Setup is very quick and painless, you plug it into your tv and power it by usb, you turn your tv to the hdmi it's plugged into, then you use your laptop/phone to set it up, it tells you exactly what to do. took literally 2 minutes because of internet being slow...hahaHighly recommend!ALSO, mine shipped in less than 16 hours...thanks AMAZON!", "verified": true, "helpfulness": "3/8", "author": "Soas"}, {"rating": 5.0, "review": "Finally got my hands on one. My first impression- \"This is exactly what I didn't know I had been searching for!\" I have tried many other device-to-tv streaming services, but most have failed to impress. All of them seemed to be unreasonably priced for the limited amount of things they could do, and the cheap ones like the Android Smart TV Sticks just never ran as smoothly as I had hoped.The Chromecast is as easy to use as it looks. On the inside of the box, there is a 3-step process: 1) Plug it in, 2) Switch input, and 3) Set it up. Within minutes, I had fired up Arrested Development on my Galaxy S4, and was able to pause it from my iPad. Beautiful.I love how Chromecast streams from the cloud rather than the device, so it frees you up to use your device while still watching video.I tried out the Chrome Browser as well. Google is still currently working on getting this to run smoother, but as is, it's a little laggy with video a little choppy. Not quite as smooth as Netflix or Youtube, but still doable. I'd imagine the fact that it's still in beta has something to do with it...Currently we can only stream content from Youtube, Netflix, Chrome (beta), and Google Play. However, from the remarks made in the conference, I have confidence we are going to see many more amazing things that this little, affordable device will be able to offer us.Bottom line: Unbeatable Price for an Unbeatable ProductUpdate: I have now used it with my MacBook, iPad, and Galaxy S4, and it runs very smoothly with each of these devices. I was curious, so I tried it on a couple of different TV's and also with my computer monitor. I found that I only had to set it up once on my network, and after that, all I had to do was plug it in and hit play on my device! When unplugging it from the monitor, I didn't hit pause on my phone just to see how the dongle could handle it. Netflix instantly paused. When I plugged it back into the TV, all I had to do was hit play, and it resumed where I had left off. Brilliant.", "verified": false, "helpfulness": "58/81", "author": "Kusaiashi"}, {"rating": 5.0, "review": "Why people write review about the idea, not about the actual product? Is Amazon product review the right place for that?I am giving it 5 star, simply because it sounds so brilliant on paper? I am so in love with the product I don't even have yet, and I highly recommend it to the world. nuff said.", "verified": true, "helpfulness": "4/107", "author": "OOS \"oos\""}, {"rating": 3.0, "review": "Thought this sounded like a great idea, but how does this directly compete with the Apple TV or Roku? You must use your own device to stream everything on your TV. Both Apple TV and Roku have everything built in and require zero alternative devices to work. I can see the fun factor selling many of these initially but don't believe this will catch on to significantly effect the streaming market shares.", "verified": false, "helpfulness": "8/135", "author": "Texas"}, {"rating": 5.0, "review": "I will be getting this not because I can stream from Netflix,Pandora,YouTube, or Google Play but because this is effectively allowing the ChromeOS experience to be integrated on any tv. As you know if you have the Chrome Browser it has an app system set up in place and until now it was not used very extensively but thanks to this product this would no longer be an issue you could just use the apps on the Chrome Browser to improve the product even more. The one question is how do you interact with your browser with no set up control system well you can do that with apps like Kainy to use them as your virtual desktop mouse and keyboard on any mobile device and bingo a working cloud OS for your Tv.", "verified": false, "helpfulness": "5/50", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Looks like a piece of junk that I will toss after playing with it for a couple of days.-You can only watch so many youtube video's before it gets old.-You can probably stream 1/2 a NetFlix movie before your phone dies. Even if your device acts as a controller for this, it is still junk.Junk.--Update--I think people are upset at all the 1 star reviews because we have not officially reviewed the product. Also because it is \"bringing down the ratings\".But how about the 25, 5 star reviews that are bringing up the ratings from people who did not officially review this product?", "verified": false, "helpfulness": "27/1", "author": "hashtechie"}, {"rating": 5.0, "review": "Update 08/16/2013Okay - now I have this on 2 TVs and a Projector.  These are the two key points I wanted to know about when I bought the product:* Why a power cord?  With my TVs, I don't need to plug the power cord into a wall outlet... this was confusing me, why they had this.  BUT, I finally realized the \"big deal\" - if my TV is off, I just go to my content on my phone, tablet, or Chromebook Pixel (the computer google pays you to buy, get it, it's awesome), and then I click the button to start a \"cast\" on whatever app/webpage, and my TVs turn on automatically, turn to the right input, and everything is done.  It is truly amazing to me... no more remote.  I'm kicking myself that I just bought a $300 Logitech remote... which is now completely, 100% obsolete.  Replaced by a $35 thingy for my TV.* Simple, simple, simple... I was going to film it, but it goes like this: doorman gave me the package, I had the chromecast out of the box by the time I got up the elevator and walked in my front door, then I plugged it into the back of the TV, connected the power cord, turned it on, ran the chromecast app on my Nexus 7 tablet (which I love as well, and I'm a former Apple fanboy... hard-core Apple fanboy dating back to 1983, that's how hard-core, and I could care less about Apple now), and it was working.  The entire process, including the opening of the amazon box and packaging, took less than three minutes.* Bonus: content is great... LOVE how you can be using your phone/computer/tablet as a controller, and even walk away, close the app, etc and it still continues to broadcast the content for the person who's still in your house... in my case, my boyfriend, who can then continue on with his iphone (I'll get him to change... his screen is cracked and delicate-as-an-egg glass back is all shattered, whomever designed that iphone sure wasn't thinking about usability when it came to the physical design!).* I'm really hoping future TVs will just be \"monitors\", no built-in tuners or wi-fi or anything.  Even with the limited apps on chromecast, I'm 100% planning on getting rid of cable tv in the next few months... $158/mo for 5 TVs to have cable TV with showtime and HBO is foolish... and embarrassing.  For that price, I could take two trips to hawaii each year...Original ReviewThis is the best device I've seen yet... watch the looooong 3-part 75 minute long demo of this product, and you'll start to get it... for most stuff, it sends an instruction to get the content from the cloud, not from your phone, so it's not draining your battery as much...Google Play Music at $9.99/mo is the best thing yet too... combines your library, pandora-like radio stations based on anything you type in, and spotify-like music on demand... you'll never buy music again.... the Chromecast works for this too.Now, what I want to see is TVs that come out without any tuners, without any built-in apps or wifi, just an HDMI port with this... because I bet it'd really help drop the prices of TVs...And finally... the best thing this is for, at least to me... is PROJECTORS... I have a projector connected to a Sony 3D Blu-Ray connected to Netflix, Hulu, Vudu, etc., etc... this will allow me to get rid of that extra piece of equipment.I'm sure they'll have hulu, vudu, etc. soon... and many, many more applications...I bought three.", "verified": true, "helpfulness": "19/75", "author": "Benjamin M. Bethel \"Owner/General Manager - The Clarendon Hotel\""}, {"rating": 5.0, "review": "I just got it today, Friday.  Amazon delivery has been great!It's true, I was able to setup in less than 5 minutes from my Android Phone.Wifi proximity determines how 'choppy' your performance will be. (But mostly for the BETA Chrome tab casting).The kind of device you use affects performance and features, too.My phone has no Chrome browser casting, so it was the most limiting.My slow Apple laptop was slow at browser casting.My PC i5 laptop- everything was golden.My Ipad has no casting for it other than Youtube.The \"apps\" are limited to 3: Netflix, Youtube, and Google Play.Although, any Chrome laptop browser can stream almost anything through one tab.Of course the better your connection, the better the streaming.On one TV I have downstairs, the Wifi is only 30%, but fast enough to stream Youtube directly to the Chromecast, but Chrome browser tab casting was awful.On another TV upstairs that has 90% Wifi, everything was smooth.  There is slight lag when scrolling, but it's a solid streamer.Be sure to use the HDMI extension- it improves Wifi reception a hair.  And the Chromestick has a big butt which can get in the way of other cables.So, a few apps, but apparently many more to come (do Picasa, and all the video apps and everyone will be happy).You can view local files by dragging the file to the web address line.  It views most anything.It seems limited until you realize it can do almost any type of entertainment you normally do on your TV.Some thoughts: It really feels simple, almost too simple, like having an HDMI cable attached to my laptop.I really don't want to use my laptop to control it because that feels so arcane right now.If I could use my phone or Ipad to fully control it that would be nice.Also, an app to share photos and videos without using a browser would be great.====================================================================================================Older pre-review:Ok, I haven't got mine yet, but it says by Friday.I have them all: PS3, Roku, Sony Media Player, Apple TV3, Vizio Costar, Android TV Stick.If you want to web browse, then only the PS3 and Google TV (Vizio Costar) have it.  Only the Costar can play flash.If you want Amazon Instant, Apple TV doesn't have it.If you want Youtube, the Roku doesn't have it (well, no officially).If you don't want to hack, then the Android TV stick and Apple TV2 are out.If you want to stream your MKV, DIVX, whatever then only the DLNA players can stream/play it: PS3, SMP, Costar.The Sony Media Player is discontinued.So, out of that bunch, only the Vizio Costar can do everything, but it is only the best of the worst and it is infinitely more capable because of the Chrome browser.But you might not like learning a new OS.Google got it right- you can use whatever you already use to control it.  Simple.  And, the big deal, it will handle the streaming, your device only controls it, meaning little lag.  I'm guessing the chrome browser mirroring will be slower.And, heck, if you want one for work and home and the room downstairs, you can get 3 for about $100.  EVERYONE has been waiting for this simple device.You don't need a giant Apple Television to do this.  This is the next big thing that everyone wants.  Here comes a new wave of couch potatoing.", "verified": true, "helpfulness": "68/188", "author": "mousepotato"}, {"rating": 5.0, "review": "Great product. Enables casting videos from chrome including from the websites that do not (and likely never will) have an app for more traditional streaming devices.", "verified": true, "helpfulness": "10/68", "author": "invincible2010"}, {"rating": 5.0, "review": "I love that it is out of stock already a few hours after release.  Good thing I got mine.  I can't wait to plug it in and stream freely.", "verified": true, "helpfulness": "2/107", "author": "Keith"}]