[{"rating": 3.0, "review": "Voice search only works for Amazon store. No google store ability. So close to be being perfect but falls short by being overly vain with the Amazon services only.  Great only if your digital life is centered on Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Dustin Minor"}, {"rating": 5.0, "review": "Great box", "verified": true, "helpfulness": "0/0", "author": "Miguel A Spadaro"}, {"rating": 5.0, "review": "Love it, more free TV than I could watch in a lifetime.", "verified": true, "helpfulness": "0/0", "author": "Dennis R. Ballam"}, {"rating": 3.0, "review": "Voice search only works for Amazon stuff. DOES NOT WORK FOR NETFLIX. Real bummer.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "Love it better than cable!", "verified": true, "helpfulness": "0/0", "author": "Veronica Evans"}, {"rating": 5.0, "review": "I can't believe I waited this long to get this. I love it.", "verified": true, "helpfulness": "0/0", "author": "Jane"}, {"rating": 2.0, "review": "I'm really disappointed in the quality of this product.  The interface is as glitchy as it is clunky. The miracast feature doesn't work with my Nexus phone.  The device keeps the HDMI line hot even in sleep mode so my monitor never goes completely off.  The voice search seems to hang in listen mode well after I've completed my request.The selection offered by prime video has improved but this set-top box is not the way to watch the service.  I think I was happier casting from my iPad to the appleTV. (I never thought I'd compare that to anything in a favorable light; but there you have it.)I still love you Amazon, but you need to fix this shrap.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Was told when I bought fire TV since I was a prime card holder ALL the movies were FREE what a JOKE", "verified": true, "helpfulness": "0/4", "author": "ron"}, {"rating": 4.0, "review": "Small, unobtrusive, easy to use.  Only complaint is that the batteries for the remote die very quickly, and we're using good batteries.  Solved that problem by downloading the app to control it from our cell phones and tablets.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Apps stop working after some time. VLC player stopped working and now it is not compatible with fire Tv,when called customer support they don't help you and just hangup. you can get best devices for cheaper prices like roku,apple tv than this fire tv.", "verified": true, "helpfulness": "0/1", "author": "Dheeraj"}]