[{"rating": 3.0, "review": "Sucks that the remote doesn't state if it's RF or IR and why didn't you include an earphone jack on the remote??? Like ROKU3. Furthermore \"quad core\" processors mean NOTHING if the firmware/software/hardware doesn't use it! (in FACT, slower) ALSO from ACTUAL users, sounds like the $ 10 Rabbit TV is actually a better deal...just as mixed up with paid and free movies NOT sorted with YOUR firmware/software = HORRIBLE!Consider DISH -cheaper and easier! Electronics Engineer 40+ years -LEHenson@msn.com", "verified": false, "helpfulness": "0/3", "author": "Larry"}, {"rating": 5.0, "review": "Easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Larissa M. Flynn"}, {"rating": 1.0, "review": "Amazon Fire TV gives you a low quality experience that people who are entertained easily will be entertained for a little bit. Other reviews consist of problems with the power-cord which is low-tech! The standard power-cord, HDMI, and USB have been here forever! By looking at the remote and the box on the side of writing this review, this is low-tech, not-advanced, and not thought through. Because there is a month until the major announcements of the future-today tech, Amazon \"Prime\" time to attack Apple, along with Google &/or Samsung, is in August.Basic Boxed TV with low-tech everything: should be $9.99 a month, for 1 year.I believe Amazon is stepping into grounds that I shouldn't of had. Amazon is trying to be \"all-that\" by getting into the news, selling some before Apple, than repeat with low-tech features Apple should've had.", "verified": false, "helpfulness": "3/18", "author": "Blake C"}, {"rating": 5.0, "review": "For the price a superb investment.  And if you have the Fire Phone, they communicate, so you can watch a movie or TV show on Amazon Prime on Fire TV and have the X-Ray features displayed on your Fire Phone!", "verified": true, "helpfulness": "1/1", "author": "Walter Thompson \"Rider of a Turbulent Sea\""}, {"rating": 4.0, "review": "I like the fire tv. Im hoping that more apps will come out for it. HBO go hopefully will make its way on there. what is there is good though", "verified": true, "helpfulness": "1/1", "author": "Matthew Mason"}, {"rating": 3.0, "review": "Nice movie experience for what I have seen so far.  The Prime hype (as the intro movie said) about accessing 40,000 titles as part of the Prime membership is overstated.  This machine will only list 100 titles and after going through them, there are no other choices.  Were are these 40k titles?  There should be a web page that lists all Prime movies/TV shows.  This was the main reason I got this device.  The Amazon video on my Vizio only showed about 15 movies. For both my TV and the Fire, it was up to me to hunt around for movies that are \"free\" to me with my prime membership.Here is another big one.  I was surprised to see pics from my computer displayed on the Fire.  I thought I had more security on my machine but apparently Amazon has a way to gain access to my computer without a login and extract information from my machine.  Disturbing?  Yes.Overall, I have some alternative to Apple.  I like this appliance and plan to see how it works overall in my Apple environment.  I would give five stars if the hype about movie access was implemented.  This may be another instance of sales hype that didn't get any follow-through.  It is a nice product to have for the Amazon ecosystem of movies, shows and music.", "verified": true, "helpfulness": "1/2", "author": "Amazon Fan"}, {"rating": 4.0, "review": "Two words: Voice searchWhen I use the instant video app on my dad's ps3, and I have to type using the controls, I want to cry. The voice recognition is really good and I've never had to repeat something more than the occasional once.This device isn't for browsing their entire selection, although I find the \"customers also watched\" nice to browse with.", "verified": true, "helpfulness": "0/0", "author": "Novel Living"}, {"rating": 5.0, "review": "really solid device.  i have a roku and an apple tv.  the navigation isn't as good as either, but the processor is better.  the syncing is better.  the audio activation/search is great.  all in, this is just as good and maybe better as its competitors (roku and appletv).  i love it.", "verified": true, "helpfulness": "0/0", "author": "veritas"}, {"rating": 5.0, "review": "Love itSo far so good. Very fast remote and voice recognition works well!!!", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 2.0, "review": "i just bought a fire tv, choosing it over roku 3. Big mistake! The screen mirroring is pretty much unusable. Videos stutter all the time and would sometimes get stuck while the kindle hdx keeps on playing. Their much publicized \"mayday\" feature also doesn't help much. I was on the phone with 3 different \"experts\" or specialists, and boy, what a waste of time. I love my kindle hdx, but the fire tv is going back. Lastly, they need a whole bunch more apps so that you don't have to rely on the mirroring feature which really doesn't work", "verified": true, "helpfulness": "0/3", "author": "Enzo C."}]