[{"rating": 5.0, "review": "The Chromecast does everything it says it will. You can cast the free Hulu with it, whereas with the Roku you can't. (Unless someone has discovered something I haven't.) Basically any video you can pull up on your web browser, you can cast to your TV. You can also stream videos and movies from your computer. With all that said, I do actually prefer the Roku. The Roku is easier for me to operate and work with, not that the Chromecast is that difficult. The Roku may be a tad more limited in what you can watch from the Internet, but the majority of what you will find with Chromecast can be found on at least one of the Roku channels. For the price, about half what a month's cable costs, you could buy both and not loose any sleep. You probably don't really need both though. Being an old movie and television nut, I can find plenty of movies and old television series on YouTube. YouTube is about all I use my Chromecast or Roku for, so I actually would be happy with either one.", "verified": true, "helpfulness": "0/0", "author": "T. Barnard \"magnum7\""}, {"rating": 4.0, "review": "Would be better if I had realized that Chromecast literally meant it casts from Google chrome. Mistake on my part as I was expecting more of a roku type device. The video and sound quality is superb. Feels kind of bulky digitally for streaming video off of a PC in another room, getting the pc up opening chrome starting the stream then controlling it from my phone, but still performs better than what I had befor (some icraig thing)", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "I've worked closely with this product for a long time and I can assure you that it is the best wireless option to view your videos. We have two, one for the living room and one for the bedroom and they work great. No need to unplug and move the PS3 around.Tip: if your Google Play Video isn't playing correctly try YouTube. You will find an option that says purchases under the left-hand menu. YouTube is owned by Google and it 99% of the time will work just fine. Google is just a little new to the video player game and it's still working out the kinks.", "verified": true, "helpfulness": "0/0", "author": "Kayley Ellis"}, {"rating": 5.0, "review": "Though there were challenges setting up the device in the Philippines, it worked as expected. Hoping to have more compatible apps.", "verified": true, "helpfulness": "0/0", "author": "Joebel Canlas"}, {"rating": 2.0, "review": "This item sucks after awhile it lags and now I find that roku3 is better I bought 2 of these things thinking I would get a different result they suck", "verified": true, "helpfulness": "0/0", "author": "Joel hunt"}, {"rating": 2.0, "review": "The Chrome software app on my smart phone is very sluggish.  The selection of useful sites beyond NetFlix is just so much TV junk, wasted space.  I did watch some YouTube videos with it and it worked okay.  Using the beta feature of being able to view normal websites using the Chrome browser is extremely slow to the point of being useless.  I'll be trying Amazon's Fire TV next.", "verified": true, "helpfulness": "0/0", "author": "watson"}, {"rating": 4.0, "review": "I love this thing this is my second one great thing is you can cast to several TVs using several chrome casts and one device. Overall Google did well with this little device!", "verified": true, "helpfulness": "0/0", "author": "Mr.Bubbi"}, {"rating": 5.0, "review": "Love it!What an incredibly awesome device.Absolutely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Matt S."}, {"rating": 5.0, "review": "I wish I had bought this when I was in college and just wanted to watch stuff on my pretty. Alas, it's pretty amazing and works really well.", "verified": true, "helpfulness": "0/0", "author": "Melissa Krug"}, {"rating": 4.0, "review": "Worked well until it died after almost exactly 2 years. Having said that, the $35.00 I paid was money well spent.", "verified": true, "helpfulness": "0/0", "author": "Matthew A Phillips"}]