[{"rating": 5.0, "review": "The unit performed as expected. Setup was easy an affordable way to get media and web wirelessly to tv. For the price brilliant.", "verified": true, "helpfulness": "0/0", "author": "ntx757"}, {"rating": 5.0, "review": "I bought two of these hours after they were announced, and the preorder shipped them with Prime on August 30h.  It takes a bit of tech savviness to get these configured and running with your TV, PC and iPhone, but once the configuration routines completed across devices, watching youtube on the PC and streaming to the TV was amazing.", "verified": true, "helpfulness": "0/0", "author": "Techie in Seattle"}, {"rating": 4.0, "review": "It's still in beta. Won't work for iOS chrome just yet. Waiting for a few more apps to pair up with it.", "verified": true, "helpfulness": "0/0", "author": "Andrew Calvi"}, {"rating": 5.0, "review": "This is very simple to setup.  HD, of picture is outstanding.  Now for additional apps for it, which I hope will come soon.", "verified": true, "helpfulness": "0/0", "author": "Charles Van Eeckhout"}, {"rating": 4.0, "review": "When used with native apps, such as Netflix or YouTube, it performs flawlessly. Even the screen share option - although a bit laggy, is still great for wireless presentations or class work. Streaming video outside of the native apps is not recommended.Definitely a great buy, too at only $35!", "verified": true, "helpfulness": "0/0", "author": "Kristopher Rowberry"}, {"rating": 4.0, "review": "This is a great gadget which increases your options for watching films and videos. If I were forced to find flaws with it, I would mention two: 1) you can only use the 2.4 GHz band and not the newer 5 GHz and 2) you cannot play YouTube videos that are labelled \"Private\": they must be \"Plubic\".", "verified": true, "helpfulness": "0/0", "author": "barcy"}, {"rating": 3.0, "review": "For $35 this thing does exactly what it needs to. There's appreciable lag when casting from Chrome. Video and audio quality otherwise, especially from YouTube and Netflix, is solid.I bought it to see what it would do mostly from a curiosity standpoint. This is no replacement for a Roku or Apple TV. For an extra $40-70, I would recommend either these over the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Chris Wise"}, {"rating": 2.0, "review": "Google I normally love their stuff. Chromecast left me wondering why a great company like Google would produce a product with so little in the way a capabilities", "verified": true, "helpfulness": "1/1", "author": "David Larson"}, {"rating": 3.0, "review": "I was excited to get this product.  I've used it once (the night I opened the box) and it's sat idle ever since.  It just doesn't provide any advantage over my PS3, which I use to stream video.  It's  not a bad product, it's just not terribly useful.", "verified": true, "helpfulness": "0/0", "author": "KyleK"}, {"rating": 5.0, "review": "This is the future of video watching. Easy setup, excellent video quality. As more services are added the device will be even more powerful.", "verified": true, "helpfulness": "0/0", "author": "Michael Crowley"}]