[{"rating": 5.0, "review": "Absolutely love this product! Love the fact the words of the songs appear on the screen.", "verified": true, "helpfulness": "0/0", "author": "Daniel W Baker"}, {"rating": 5.0, "review": "Easy to install and use, even for the non-techie types.", "verified": true, "helpfulness": "0/0", "author": "Leticia Minkoff"}, {"rating": 5.0, "review": "Love it.  Really leverages my Prime Instant Video capability", "verified": true, "helpfulness": "0/0", "author": "Michael Hritz"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Edwin Polanco"}, {"rating": 2.0, "review": "When it works, I'd rate it four stars--but I don't think a week has gone by that there isn't some issue that gets in the way of accessing what I want to watch.  I suppose the plus side is it generally resolves itself and if I come back in a few hours--or the next day--its okay.  The most recent issue was that between everything I was watching I had to log out of Netflix, unplug the device for 30 seconds, plug it back in, and re-sign in... every time.  That lasted about two days, then fine again.  Sometimes it just doesn't let me in at all; I go away for awhile, and then it's fine again.  Given what I've read in other reviews, I don't know, maybe I just got a dud.", "verified": true, "helpfulness": "0/1", "author": "Mishka Zakharin \"Mishka Zakharin\""}, {"rating": 4.0, "review": "We have only had it in operations since Sunday and so far everything is fine. It will take us a while to become familiar with all of its features, but as I said so far it has met our expectations.", "verified": true, "helpfulness": "0/0", "author": "Virginia McDougall"}, {"rating": 4.0, "review": "Completely satisfied!  Purchased a 2nd Fire TV Box for another TV in home>", "verified": true, "helpfulness": "0/0", "author": "Michael Desmond"}, {"rating": 5.0, "review": "It work great and rivals Apple", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Use it daily and am quite pleased with it. Just now branching out to using some of the apps.", "verified": true, "helpfulness": "0/0", "author": "Mary E. Cody \"Codycats\""}, {"rating": 5.0, "review": "We like it a lot.  We are old and low-tech, so we were pleasantly surprised at how easy it is to set up.  We love the voice command feature.  It really works.  I have been a little disappointed because most of the movies are NOT free, even though I have Amazon prime, and thought that would make a difference.  Other than having to pay small amounts for almost everything, it's a really cool device.", "verified": true, "helpfulness": "0/0", "author": "Ratchford \"Pensacola Rocker\""}]