[{"rating": 5.0, "review": "Video quality is fantastic. It is easy to connect your phone to the Chromecast after you watch a tutorial.Seems to automatically shift bitrates to minimize buffering. Sound quality is also good.The only drawback is casting frome Chrome browser on PC to Chromcast. The video and sound is great quality, but not able to go fullscreen unless the PC is fullscreen also. Kind of defeats the purpose of casting a tab. Basically it acts like a second monitor, needs work.Would buy again.", "verified": true, "helpfulness": "0/0", "author": "AK"}, {"rating": 3.0, "review": "While I own 7 devices that will stream Netflix, I bought the Chromecast because I don't own any other streaming device that supports Amazon Instant and HBOGO.  I knew that both Amazon and HBOGO were not available at launch, but HBOGO is pending and I'm hoping Amazon will follow.My workaround in the meantime?  The Chromecast \"Cast from Chrome\" feature - if you can stream it in Chrome, you can transfer the video to the Chromecast.Sounds great in theory, but be forewarned: your streaming experience is fully dependent on the specs of the machine that is running the chrome browser.Case in point: My wife is watching GoT on HBOGO at the moment.  She really wanted to watch on our HDTV, so I showed he how to do so on her MacBook Pro and Chrome.  The problem? It's an older MacBook Pro, and while the streaming is flawless in Chrome itself, the moment she chose to \"cast\" it to Chromecast, the video became really choppy - unwatchable.To see if the real problem was the fact that both her laptop and the Chromecast were on the network via wi-fi, I turned off the wi-fi on her laptop and hard-wired it to my gigabit network - same result.Then, to see if it was HBOGO itself or her laptop, I went upstairs to my desktop (overclocked quad-core 4GHz with 12GB RAM and a GeForce 275) and \"cast\" HBOGO from there - absolutely flawless HD on Chromecast.  But it's upstairs... how do I use it as a remote control when I'm not even in the same room?The takeaway:  Chromecast works best when streaming directly from the cloud (via a \"native\" app), or if you have a *beefy* laptop/desktop nearby running Chrome.  If you want to stream your favorite videos often watched on your phone or tablet, or if you have older/cheap hardware at home, wait until there are more \"native\" apps...... Until then, this is just the 8th device for me to watch Netflix.Pros:- Three stars for ease of use and setup.  Really painless- The Netflix content streams HD with no stuttering.- *Beefy* machines can also stream HD with no stuttering via Chrome-to-ChromecastCons:- It really needs more apps.  Will add a star for HBOGO/MAXGO/etc. \"native\" apps.  Will add a star for Amazon Instant app.- Chrome-to-Chromecast experience is not top-notch (see above)- Audio streamed from Chrome to Chromecast is significantly lower in decibels than the \"native\" apps.  Again, it may be based on the audio card on the machine running Chrome.", "verified": true, "helpfulness": "0/0", "author": "Count Rugen"}, {"rating": 1.0, "review": "The instructions that come with Chromecast are three little pictures and that's it. Easy enough, if they work. For me, I got connection errors over and over. I spent hours fussing with network settings before I was able to make a connection. I'll never get those hours of my life back.Google gives the impression this device will make your TV an extension of your Laptop, PC, iPhone, etc, for streaming video and other stuff. Yeah, that's not the case. From my PC, it only streams video from YouTube.com and supposedly Netflix.com, and for the iPhone it will stream from the YouTube/Netflix apps. (Google Play Movies & Music is supposedly an option if you have an Android phone). I don't have an Android phone, and I don't have Netflix, so basically this is a $35 device to stream YouTube to my TV. What a waste. I was hoping I'd be able to watch Amazon Prime videos, but that is not the case.I was so disappointed, I didn't even bother to check the streaming quality. If you have Netflix, maybe it'll be awesome for  you. If you don't, you benefit only if you have the urge to watch terrible quality YouTube videos on the \"big screen\" - remember, they're streaming from your phone, so the compression will likely be garbage.", "verified": true, "helpfulness": "0/7", "author": "Tristan Chaika \"Web Designer & Filmmaker\""}, {"rating": 1.0, "review": "ChromeCast does not cast from Chrome on an iPad.  It does show Netflix and Youtube.  That's it.  Completely misleading name and advertising.  Waste of time and money.", "verified": true, "helpfulness": "2/4", "author": "Marty"}, {"rating": 4.0, "review": "This thing is cheaper than a Roku box, and finally I can get YouTube videos on my TV. The device has trouble with my router some days, but it works pretty good most of the time. It's easy to set up, and sends a strong signal to my TV. I wish it was a little smaller so it didn't stick out from the side of my TV, but I imagine they will be building them into future televisions. I hope they add more functionality soon.", "verified": true, "helpfulness": "1/1", "author": "Peter"}, {"rating": 1.0, "review": "This started out as a miracle product. It not worth 10 cents. It will not show anything on you base computer unless it is actively being downloaded live from the internet as you are using it (so no computer file pictures or movies that are stored on your computer will appear on your TV). When you try to stream a movie live onto your TV, from your computer, it tell you it is doing this on a \"BETA TESTING APPLICATION\" and only \"Chugs\" the picture, a few seconds at a time. When I disconnect it and attach my old fashion 25 ' HD cable, from my laptop to the TV....Bingo ! I'm back to perfect reception again, with no chugging at all.  This product \"may\" be useful down the road, when they gets it out of the BETA stage of actual use, but for now, don't waste your money. Why Google released this unfinished product onto the market early is beyond me.  I had ordered a second one of these, on the release hype, before I found out what a POS they really are,  as there was a waiting line period. I canceled the my second order, I'm very glad there was a waiting period.", "verified": true, "helpfulness": "1/5", "author": "John Morley"}, {"rating": 5.0, "review": "Terrific!OK, I can't submit this with just one word, even if it's the right word.  It works well and it sets up easily.  I am buying two more right now. One as a gift and the other for my other TV.  Netflix and YouTube work far better with this than with the TV's built-in browser.  I'll say it again - terrific!", "verified": true, "helpfulness": "0/0", "author": "markbblu"}, {"rating": 5.0, "review": "I am so used to stuff like this not working when I buy it.  Roku was horrible, this gave me awesome quality HD signals on my big-screen TV.  And it apparently works with iPads and iPhones as well as other tablets.  I would HIGHLY reccomend this product.  Didn't have to provide a credit card or anything...works with anything that can download an App or which can run Chrome!  This things worked like it said it would on a 2.5 year old television...that is saying a LOT.  You will not be dissapointed.", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "This is an awesome piece of 35 bucks. I loved the initial setup process. Very slick. I will be probably buying a few for my work place to chome cast our project planning.", "verified": false, "helpfulness": "0/0", "author": "KrisS"}, {"rating": 3.0, "review": "the chromecast app installed nicely on my Nexus 7, not so much on my Win7 laptop.  I set it up with the tablet and cast a couple youtube videos to my TV.  I still can't get my laptop to work with it.  Also, it gets pretty hot, probably not a problem, but something to think about.Hopefully there will be steady improvement with new apps and functionality over time.", "verified": true, "helpfulness": "0/0", "author": "J. Faust"}]