[{"rating": 5.0, "review": "It's everything and more", "verified": true, "helpfulness": "0/2", "author": "aleata barbour"}, {"rating": 5.0, "review": "Easy to set up and to use. Combine it with Prime and Hulu Plus and you have enough movies, TV series and music for a lifetime. No need for cable.", "verified": true, "helpfulness": "3/3", "author": "JOHN MAT"}, {"rating": 1.0, "review": "It is advertising that it plays music that you purchase but it does not.", "verified": true, "helpfulness": "2/6", "author": "dee \"sheena830\""}, {"rating": 3.0, "review": "Very disappointing to say the least.. Can't get Netflix to work and have to pay for pretty much anything you want to watch. Very deceiving hype before you buy it. Voice search works very well.  Easy to install.", "verified": true, "helpfulness": "1/2", "author": "Jon Hall"}, {"rating": 2.0, "review": "Not nearly the number of free programming I hoped for from prime.", "verified": true, "helpfulness": "3/6", "author": "Keith W Gundling"}, {"rating": 5.0, "review": "Just received it as a Christmas present today!!!! Easy to use and install!!! I'm in love!!!!", "verified": false, "helpfulness": "0/0", "author": "KathyS"}, {"rating": 1.0, "review": "A total rip off. Was bought as a gift for someone who lives outside the US and there is no license to stream movies. Why isn't this stated or why are persons without a US credit card able to purchase. A total waste of my money. And I bought it just before the price was dropped to $79. I have been an amazon customer for years and has spent a lot of money on this site. Totally dissatisfied Amazon.", "verified": true, "helpfulness": "1/5", "author": "Je-Anne Borneo"}, {"rating": 5.0, "review": "Have recommended this to my family! I have a Apple TV  and I seem to use the Amazon more.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Schueth"}, {"rating": 5.0, "review": "Easy to use and pretty quick download speeds. I use it just about every day.", "verified": true, "helpfulness": "0/1", "author": "sergio lopez"}, {"rating": 3.0, "review": "****Updated 12-27-14 - I have been using my FireTV for about a week now and I have made some more discoveries.  I will let my 3 star review stand until some of the issues that I have discovered are resolved.Pros:1-It is fast.  You will probably not find a faster device for this price anywhere.  Menus are very smooth with little waiting for anything.  This thing is so fast that I can flip back and forth between XBMC and the Amazon home screen instantly.2-Menus are designed well and content is easy to find.3-The remote is simple to use and works well.4-Ouya controllers can be paired to this device.  Mine have worked well with the exception of one game.5-Fantastic Netflix app.6-Voice control works really well.7-Nice screensaver with really beautiful pictures.The cons are irritating to me because the FireTV runs on a modified version of Android that already has native support for them but were probably removed to require less support by Amazon.  This really cripples a box that could have been an easy five star product.Cons:1-No support for external USB storage.  When you fill up the device with games and apps you will have to uninstall something to make more room for something else. The USB port is only for connecting peripherals such as keyboards, mice, controllers.  If I had known this I probably wouldn't have purchased this unit.2-No support for bluetooth headphones or speakers.3-No web browser.4-Not rootable.5-No access to the Google Play store.6-Side-loaded apps are buried in the menu system and there is no simple way to create shortcuts to them.7-If you lose your Internet connection or take your FireTV somewhere without Internet service then all of the menus become useless.  An error message says that the Amazon service can't be reached.  Even for apps and games that were previously installed on the unit.  As a workaround you can drill down through many levels in the settings and start some of the apps there but even some of them aren't listed or won't function without Internet access and I am not just talking about the ones that obviously need Internet like streaming channels.8-No XBMC app in the Amazon store.  XBMC can be sideloaded and works great on this unit but it is not a simple task for the inexperienced. If you want a unit that is almost as fast as the FireTV and the manufacturer supports XBMC then I would suggest getting an Ouya gaming system for $99. The downside to the Ouya is that you would lose the great interface to the Amazon Prime content that the FireTV offers and the exceptional Netflix app. that the FireTV offers. The Ouya does not come with a regular remote so you would have to use the game controller to navigate menus which really isn't that bad or set up an IR remote with something like a Flirc. The Ouya doesn't have any of the cons of the FireTV except for #5 unless you root it and then you will have access to the play store.9-This one REALLY annoys me.  If you set up parental controls so that other users can't purchase content without a pin number, the FireTV will ask you for the pin number for every show or app every time you access it!  Even if it is content that comes with Prime!  This sucks!", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer \"Blaine the Mono\""}]