[{"rating": 5.0, "review": "It is a wonderful thing to have. We are all able to control it from our own devices to watch what we want on the tv. Sure beats watching everything on a phone.", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 5.0, "review": "Out of all the gifts I gave my husband last Christmas, this was his favorite! And quite honestly, we love it too...and now he has to hunt for it all over the house because everyone keeps stealing it!! Super easy to set up and just so great! Will buy more for other TVs in the house this year--can you give a gift to a television? We will!", "verified": true, "helpfulness": "0/0", "author": "Eleanore Macnish"}, {"rating": 5.0, "review": "The best dont i dont need to buy smartv", "verified": true, "helpfulness": "0/0", "author": "Josip"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "LEONIDAS SION"}, {"rating": 5.0, "review": "Easy to install, easy to use, works like a charm, all at a great price!  I bought two more to add one to all the tv's in my house.  All three combined is still cheaper that the alternatives.  Can'f figure out why anyone would spend more for the others.  Only downside is that I can't stream Amazon through it because Amazon won't allow it (a competitor). Too bad.", "verified": true, "helpfulness": "0/0", "author": "T. L. Clark"}, {"rating": 5.0, "review": "one of the greatest inventions for tv ever.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 4.0, "review": "best thing ever ,  I would just like to be able to browse a little better , if anybody knows of an app please let me know.", "verified": false, "helpfulness": "0/0", "author": "Mariano Urrutia"}, {"rating": 2.0, "review": "The Chromecast may be significantly cheaper than the Apple TV, but if you''re mainly using it with an i-device, please save yourself a lot of headache and spend the extra money on the better product. Our Chromecast continually freezes and refuses to play YouTube videos from our devices, and I'm about ready to throw it in the trash!", "verified": true, "helpfulness": "1/1", "author": "Rebecca C"}, {"rating": 5.0, "review": "Works perfectly, I am surprised that more people don't know about this amazing device.", "verified": false, "helpfulness": "0/0", "author": "Maria \"Maria\""}, {"rating": 3.0, "review": "Bought this for the purpose of streaming our high school sports events to our TV when we are unable to go to the games.  I send the streaming video to the Chromecast from my desktop PC using the Chrome browser.  My desktop is wired to the router with gigabit speeds.  The first away football game my PC kept crashing and the video stuttered quite a bit.  I recently had to change my router and now it doesn't stutter and the computer doesn't crash.  For this purpose I am quite happy with my $35 purpose.I have tested out the other features and if it didn't work for my previously stated needs I would return it.  I don't like that nothing is really installed on the device and I need to use my Android tablet to make it work.  It is just kind of clunky.  Half the time I used Netflix I couldn't pause or even stop the video.  I had to unplug the power in order to get it to stop.  On top of it all I can't believe that even the Google Slides app doesn't cast to the Chromecast for giving presentations.  Seriously.If you are considering this device for watching Netflix get a Roku stick or if you want the fancy remote with a headphone jack get the Roku 3.  For watching Netflix, Hulu, or other streaming channels you are much better off with a Roku.  The Roku stick is definitely worth the extra $15.", "verified": false, "helpfulness": "0/0", "author": "Jedi Batman"}]