[{"rating": 3.0, "review": "Its ok if you want to use the supported apps. If you want to cast screen or tabs for watching movies or tv on sites other then youtube, this thing lags! If you don't have a smart tv and want support for netflix this is the cheapest solution. If you want more apps just get a bluray player,roku or hook your computer to your tv with hdmi cable or wireless hdmi (hp wireless tv connect). Its cool gadget but needs better latency for mirroring.", "verified": true, "helpfulness": "0/0", "author": "dave"}, {"rating": 5.0, "review": "I have had two of these for a few months now and must say- Google did a nice job with this. It was kind of buggy at first but with firmware updates, it seems to be pretty reliable now. I rarely have issues with it freezing or not connecting to my WiFi. I must say, the fact that you are limited to only the apps that support it is kind of a downer. But if you are using a computer and running Chrome, you can cast any tab with ease. This is the fastest and easiest way I have found so far to play internet videos on the TV.", "verified": false, "helpfulness": "1/1", "author": "maxwellag"}, {"rating": 5.0, "review": "In case my title wasn't enough to sell you on this product. I've had this for a good amount of time so far and I love it. Plug it in, use the app to connect it with your devices and forget it. No maintenance, no need to update, unplug or reconnect, even if you pull the power. I use this mostly with my iPhone to give my Mac a break. I stream Netflix and Youtube mostly from my iPhone and there is no lag, image qualify is fantastic and I love how easy it is to sync to it from the Youtube/Netflix apps and start watching. Best part is I can use my phone and let the movie/videos play. Be aware however that the Netflix app glitches sometime and you will need to restart the app, this will sometimes also restart or pause the video but unless you need to use the app to pause the movie every 15 min, this won't be a problem. The are more apps and uses for it than just Youtube and Netflix but honestly these will be the bulk of your use. For 35$, why haven't you bought this already.", "verified": true, "helpfulness": "0/0", "author": "Jon \"J.Cartagena\""}, {"rating": 5.0, "review": "As expected.", "verified": true, "helpfulness": "0/0", "author": "Loren Parker"}, {"rating": 5.0, "review": "Excellent product, I highly recommend this for anyone with any android device. I mostly use this with my phone and my Nexus 2nd gen tablet to watch Netflix, videos on youtube, and to stream music. I also use it to play videos off my computer by dragging movies into chrome. It's super simple and easy to set up and only requires you to switch the input and connect every time you want to use it after that. For the price it is a MUST have.", "verified": false, "helpfulness": "0/0", "author": "Nicole L."}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Jose Vallejos"}, {"rating": 4.0, "review": "My initial expectations for the Chromecast was low. I have a second home that is wireless only and I had to install the wireless router in the basement due to the way the home is built. I planned on placing the Chromecast at the furthest point from my router 2 floors above.To my surprise, Chromecast got a good signal and played Netflix perfectly for weeks.I then decided that I was going to finally ditch the last Apple products I own, which are Apple TV's. I have a VERY large media library and have been using iTunes as the hub even after getting rid of iPhones and iPads I once had.I found an app called Plex and decided to give to a try and to my surprise. the Chormecast was able to stream high bandwidth movies from my personal library with ease.I now have 4 Chromecast units in my mountain home working wonderfully.I recently purchased a 5th to use in my main home on a remote TV and unfortunately, it arrived defective. Thanks to Amazon's great return policy and speedy service I was only without it for 2 days.One star taken off for no Ethernet port. My main home is fully wired with Gig Ethernet and would be nice to have the extra bandwidth. If I have 3 Chromecasts running in my second home I get some stuttering. I turned down the streaming settings and can now get 3 working fine at once but quality suffers when using a lower bit rate. I get that the device would be larger but it would be a price I was willing to pay to get wired GigE. I have a family that enjoys streaming movies/shows even as background so I use a lot of bandwidth. I understand this may not be an issue for the large majority of households using the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Mike S. \"-Mike\""}, {"rating": 5.0, "review": "Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Gabor Kukucska"}, {"rating": 1.0, "review": "I am running an approved router, Windows 8, did everything tech said to set this thing up and it still does not connect to my network. Every device I own connects easily. Even tried another approved router to no avail. I could spend hours every night trying to get tech help on the line so I'm past my window of opportunity to return it. I would NOT recommend this gadget there are better ways to connect your devices to your tv.", "verified": true, "helpfulness": "0/0", "author": "SoCal"}, {"rating": 4.0, "review": "It's great, can use to see videos and movies in my LCD TV.", "verified": true, "helpfulness": "0/0", "author": "Edgar Mancipe"}]