[{"rating": 4.0, "review": "I absolutely love this device!!!! I've called my mom and thanked her 3 times for this Christmas gift.  I just wish I could access Facebook.", "verified": true, "helpfulness": "0/0", "author": "Ajeenah R. Hopes"}, {"rating": 5.0, "review": "It is great and for the price you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "james"}, {"rating": 1.0, "review": "Waste of time.  Too expensive and outdated", "verified": false, "helpfulness": "0/2", "author": "chad"}, {"rating": 3.0, "review": "It looks good, works fine but if you're doing anything other than watching Amazon prime content, the interface makes you go through so much more effort than the equivalent Roku. For example, to go Netflix you have to go to the mason menu, press down a whole bunch of times to get to Apps, then scroll along till you get to Netflix.If this process was faster and easier then I would give a better review (note: \"recent\" list doesn't count because you never know if what you want is on that list).Our original plan to move an older roku to the basement and use this in our living room has actually been reversed - the old Roku is still front and center and this is on the tiny screen in the basement :(", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love the Amazon Fire TV.. best move, I am addicted", "verified": true, "helpfulness": "0/0", "author": "kim brent"}, {"rating": 5.0, "review": "Great! Faster than any of the Blu ray players with built in", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "really enjoy having everything in one place", "verified": true, "helpfulness": "0/0", "author": "cindy lowery"}, {"rating": 5.0, "review": "Great gizmo to have. It does everything as advertised along with some really cool things that are not.", "verified": true, "helpfulness": "0/0", "author": "J. Hoover \"The Hoov -\""}, {"rating": 1.0, "review": "As a Prime member, I was very excited to receive this unit. It was advertised as being easy to set up---in minutes! After an hour and a half, and working with two different Amazon techs, I gave up. I returned the unit, and was charged shipping and handling for a product that didn't work. Needless to say, I am not happy about paying that shipping charge!! have since read other reviews and learned that numerous other customers had the same issue. Not very good advertising for a product that was supposed to be set up with ease. I was able to set up a previously-purchased Chrome Cast in a few minutes.........", "verified": true, "helpfulness": "0/1", "author": "B. Clifton"}, {"rating": 4.0, "review": "Works great, but got charged 2.99 because my husband didn't under stand if u select a movie you will be charged. He did not watch it", "verified": true, "helpfulness": "0/0", "author": "Pam"}]