[{"rating": 5.0, "review": "I have several of these (one on every TV in my house) and I can't stop raving.I find that I use online services now even more than Cable due to the fact that all of my TV's have access to on-demand programming now.For like 30 bucks, you can't beat it.", "verified": true, "helpfulness": "0/0", "author": "jeff hollis"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "YnfanteMota"}, {"rating": 5.0, "review": "I love this little device. We now have a couple of these, their great little devices. They plug right into the HDMI port of your TV and can either use the USB port on the TV or use the 110v power adapter and plug it into a wall socket. This device allows you to get Netflix, Pandora, Hulu, etc very easily on you TV. Plus you can \"cast\" whatever is on you handheld device or computer to your TV. Most devices have apps our add-ons for example, the Chrome browser has a cast extension that adds a little icon to the top of the browser.This is great for viewing your pictures or something from YouTube on you browser. My son had originally bought one and we took it with us on vacation to Florida. In the morning and evenings when we were relaxing around the house we would use this to either watch YouTube music videos or Netflix and watch movies. I thought this was so neat I decided I would pick one up for myself. I works great and is easy to setup on you home wireless network.I would highly recommend this to everyone.Pros:Price, it's a very reasonable priceSize, just a small dongleVersatilityNumber of appsConstantly adding more featuresCons:Can't think of any", "verified": true, "helpfulness": "0/0", "author": "Sean Edmonds"}, {"rating": 5.0, "review": "I bought this as a gift for my daughter in law. She tells me that it is awesome!", "verified": true, "helpfulness": "0/0", "author": "J. M. O'Neill \"Jim O\""}, {"rating": 4.0, "review": "Tis good", "verified": true, "helpfulness": "0/0", "author": "Anthony Austin"}, {"rating": 5.0, "review": "Very content with the product. Thank you.", "verified": true, "helpfulness": "3/10", "author": "Andres Rodriguez"}, {"rating": 5.0, "review": "Great devise.", "verified": true, "helpfulness": "0/0", "author": "Glenda"}, {"rating": 5.0, "review": "Super easy to use and set up!", "verified": true, "helpfulness": "0/0", "author": "Cory Kirchner"}, {"rating": 2.0, "review": "Spent a bit of time trying to set it up. Will not play with Amazon Instant Video even though I disabled Silverlight and went with Adobe Flash Player. It does not mirror your PC or phone. I have an iPhone 6. It does work well with Netflix, but that's about it. I don't have Hulu Plus. Didn't think it was worth the money for just Netflix. My whole reason behind using it was to not have to set up my HDMI cables to the TV. They have some really nice systems out there, but they run up in the $300 range. Don't think that its worth it. I tried the ibyone wireless device and that was even more frustrating as it worked off and on and the set up was torturing. I was able to get it to work, but the connection kept dropping. Only hooks up to the device, not the network like Google Chromecast.  I'll stick with the cables until I find something out there that is more convincing. Seriously think about purchasing this. You may just have to try it first. I've heard good and bad feedback. It just didn't work for me.", "verified": true, "helpfulness": "0/0", "author": "JV-Man"}, {"rating": 5.0, "review": "I was amazed when I set this up, It works perfectly", "verified": true, "helpfulness": "0/0", "author": "leslie turner"}]