[{"rating": 4.0, "review": "Makes it very quick and easy to watch Prime, Hulu Plus, Netflix, etc. and play music. The controller is exceptional, menus very easy to navigate, but with Prime (as with Netflix) the same titles are listed over and over in different categories, so you soon realize there isn't near as much available as you might think at first. The selection of \"included with Prime\" shows are limited. A LOT of what you may want to see costs extra. (Unlike Netflix where every title you see is included - a great many titles on Prime are NOT included, it is just listed there in hope you will pay extra to see it.) Netflix runs somewhat poorly through the Fire TV box - the video jerks and freezes at times. It runs smoothly when using the computer, so the issue is with the Fire TV box..", "verified": true, "helpfulness": "0/0", "author": "Ken"}, {"rating": 5.0, "review": "Works flawlessly!  Love it!", "verified": true, "helpfulness": "0/0", "author": "Rob Reep"}, {"rating": 5.0, "review": "I'm enjoying my hair was on fire I'm just having a little trouble putting a couple of my apps on the fire once I figure it out it'll be just great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Amazing product, good interface and the usual unbeatable Amazon service. I only thing that keep me from the 5 star rating is that when you voice search a title, the results do not seem to include titles that you might have access on your non-prime subscription. For example I have netflix and I wish that when I voice search for a title it showed what I could watch with Prime first, with Netflix second and then the pay per view items.", "verified": true, "helpfulness": "0/0", "author": "Maximiliano J. Correa F."}, {"rating": 5.0, "review": "This tool has been easy to use by my whole family.  My children as young as 5-years-old can use the voice feature as well as the buttons on the machine to find their apps and television viewing tools.  I haven't played with the many features as much as I'd like but every one I have used has gone very well.  This has been a great way to access Amazon Prime, Netflix, and Hulu from our non-smart television.  For what I spent on the Amazon Fire TV and those discounted entertainment options, I have still spent far less than I did with cable.  And I have the added bonus of the apps to be playable on the television!  My kids love that and on bad weather days, that's been the biggest hit.", "verified": true, "helpfulness": "0/0", "author": "Midwest Mom \"Honeybee's Mommy\""}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "Marilyn A Smith"}, {"rating": 5.0, "review": "This is the best little device.  So much I sometimes don't know where to start so I usually default to more Downton Abbey!", "verified": true, "helpfulness": "0/0", "author": "Teresa L. Foust"}, {"rating": 4.0, "review": "Deben permitir acceso a latino américa", "verified": true, "helpfulness": "0/0", "author": "RODOLFO BRENES BONILLA"}, {"rating": 3.0, "review": "Very nice and responsive TV device.  Will suit my needs, but buyer should know that it's VERY Amazon-centric; the UI from top to bottom is designed to search/browse Amazon's own content.  The fancy voice search will not search Netflix, for example.Also will not display pictures stored on a local network drive (you'll need to upload to Amazon's cloud, and then the pictures will stream from there, which just seems like a big waste of bandwidth for both Amazon and me).  Will not stream local video content.It's a shame, the hardware is very nice, but it's crippled such that the user will want to buy Amazon's content.  Which I understand, but still I don't have to rate it highly because of it ;)", "verified": true, "helpfulness": "1/1", "author": "Daniel G. Hyams"}, {"rating": 5.0, "review": "Simply amazing", "verified": true, "helpfulness": "0/0", "author": "Lindsey"}]