[{"rating": 5.0, "review": "I was watching Google's announcement for the new Chromecast and quickly ordered one direct from Google and a second from Amazon.  Before adding the Chromecasts to my two HD sets, streaming Netflix or YouTube from the apps built-in to my Bluray player was very difficult.  Now I just pick up my phone or tablet, use the native apps and play it on my TV.  Awesome!", "verified": true, "helpfulness": "1/2", "author": "Tender \"moose\""}, {"rating": 4.0, "review": "I bought this mainly because my Roku does not support airplay and I wanted a cheap alternative. Sadly, iOS does not support casting from a tab on chrome. I need to use my notebook or desktop in order to do that and that defeats the purpose of casting from my iPad. I was able to purchase it when they had the free three months of Netflix and you can't beat the price.Update: I wanted to clarify why I reduced my to 4 stars. I think some people are unfairly judging my review. If the device works differently on iOS been other operating systems why should I give it five stars? Some people think that I should give it five stars just because it's made by Apple. I do not think that is a unbiased review.The Chrome casting and the Wi-Fi password seems to be saved to the cloud. I typed in my Wi-Fi password incorrectly and hit submit. It then show me an error message that the password was incorrect, but since the network was saved I could not change the password field.[...]From what I have read, the password seems to be saved to the cloud. I am very  computer literate. I tried everything from clearing saved passwords on Google Chrome, cache, history etc. was cleared. Luckily, I had advice telling me that the chrome device could be installed on a notebook and all devices including my iPad work. I thought that every device had to be paired to the chroI also read that the settings are not in the browser on iOS and they had to be accessed from a different webpage. I do not know if this is true since I never actually was able to install it directly on my iPad. I hope this clears up why I deducted a stars.", "verified": false, "helpfulness": "2/4", "author": "Victor"}, {"rating": 4.0, "review": "Google's Chromecast:1. While the picture shows a nice, little self-contained device, you will need to plug it in via a USB cord to provide power. That should not be surprising, but I do wish it was more evident. It is in one of the promo pics, but that assumes you've got a USB port right by your HDMI port. Which I don't. One more cord in the mass isn't a problem until I move the TV.2. Setup was a breeze. I used an Android Tablet (Sony Experia Z) to do the setup.3. I was easily able to add \"Casting\" to my computer, which sits in the other room, and display tabs from Google's Chrome Browser on the screen. I'm not a fan of the fact that I then can't see what I'm doing with that tab on the screen in the room I'm in, but that's the way the cookie crumbles.4. As a side note on that, you may or may not be able to use Tab-casting to watch web-video on your TV. A few Internet video sites kicked back that \"Chrome's Incognito Mode\" is not compatible with their website, so it would not transfer. Netflix, Youtube are no problem. I couldn't use it to work around Hulu or ESPN, though.5. Netflix and Youtube streaming are great with this, though I'm mainly using Youtube. I've got a Netflix compatible device already setup, so I just use it. Youtube, though, is awesome with it.6. I would love to see Google and Amazon show a little more love and let this work with AIV streaming.7. I would also like to see this develop where I can screen cast my Android tablet, whatever I'm doing. I know there are some copyright issues there, but that would be a marvelous bonus.8. There is a very low power drain with this, so it's not been a problem leaving it plugged in.9. Tabcasting is a shade slower than app-based (Netflix, Youtube) casting. This is clear in the documentation.10. Trying to use a Chromecast revealed an issue I was not aware of: I cannot play through the Cast feature on Google Play Music the music I have bought elsewhere, like here at Amazon. Only native-purchased content can be played.For the low price, it's handy--easy to set up. I'll be taking mine with me for family travel, because we can use it to show Youtube clips on the big screen at family gatherings instead of everyone crowding 'round the tablet. It's easy enough to set and use that way.", "verified": true, "helpfulness": "13/16", "author": "Doug Hibbard \"Doug Hibbard\""}, {"rating": 1.0, "review": "Very disappointed in this. Amazon just emailed me that I can expect delivery at the end of October for this order which was placed in July. Ridiculous. I can see Google underestimating the demand for this product, but a 3 month wait???? No thanks.Someone else will come up with something better in that time-frame now that the ice has been broken... Google is certainly going to lose their momentum (and their market advantage) with this kind of delivery schedule.Why is Google so hell-bent on sabotaging itself? The Revue, Google TV, now Chromecast, and I'm sure there were a couple of other \"mistakes\" in there as well... seems the \"Peter Principle\" can apply to big corporations as easily as it applies to individuals.", "verified": false, "helpfulness": "8/50", "author": "Neil Tarvin \"ntarvin\""}, {"rating": 1.0, "review": "Video displayed only 7 colored dots.  Called Chrome support at Google and they determined item was defective.  They said they would get back to me with RMA/replacement instructions (Call Ref: 0-6435000001396) within 48 hrs.  They never did!  I emailed them back and this was their response: \"Thank you for contacting Google Play. My name is Felicia and i will be assisting you further while Stephanie is out of the office. From what I understand you are waiting to receive an RMA for your Chromecast device. My records do not show that your case was consulted and I do apologize for any confusion.\"  They obviously do not have their act together and I do not trust them with a replacement item; therefore, I am returning it to Amazon for credit to my account.", "verified": true, "helpfulness": "12/40", "author": "Fernando Doval"}, {"rating": 4.0, "review": "So this little bad boy just came in the mail today, and I was all kinds of excited. I took it out of the box, plugged it in, and five minutes later I'm watching music videos from YouTube in HD on the Screen. It looks great, and was super easy to set up. Unfortunately I do not have a Netflix account, and the free three months doesn't come for another 5 days per Amazon's e-mail notifications, so right now, all I can do video wise is watch YouTube. Funny cats, and people falling down are funny and all, and Ted Talks are interesting, but sometimes you just need a long movie to cuddle up to. Then I get this great idea. I have an Amazon Prime account, and I can watch movies on my computer, why not try and Chromecast it! I am a genius! Thousands of movies streaming to my TV and I don't have to wait for Netflix! I'm even more excited now, so I figure out I have to get a little Chrome add on called Google Cast, and I get ready to watch the first movie that pops up on the screen, The Hunger Games.Too bad it doesn't work, or at least it doesn't yet. The screen on the TV pops up, but the video doesn't play, just a black bar, and it just continues to play on the computer.I really hope that Amazon gets on this. I've been refusing to pay for X-Box Live account to watch my Prime movies on my TV for quite a while now. I shouldn't have to pay Microsoft to access the internet when I already have the internet, you know what I'm saying? I know you PS3 owners do. Anyway, Amazon needs to step up, and jump on this bandwagon like they have with X-Box, and eventually Playstation 3. It would be a huge value added to me, a loyal Prime customer for going on 3 years now, and will definitely keep me from cancelling my beloved free shipping to get some movies in my room on a decent sized television for less than $100 a year.The Chromecast gets 5 stars for the ease of setup, and how great the video actually looks, but gets 3 stars on launch titles/ products. The whole thing feels kind of Beta, which makes me swell with nerdy pride, but I'm 30 now, and really just want as much value for my dollar, rather than the latest greatest thing to come out of a tech company.", "verified": true, "helpfulness": "274/350", "author": "Kyle in CA"}, {"rating": 2.0, "review": "Just a streaming device dependent on Computer, smart phone or tablet. Not an independent device. Need power thru usb adaptor.", "verified": true, "helpfulness": "3/24", "author": "Narinder"}, {"rating": 5.0, "review": "I just received my Chromecast Media Player and I must say the setup was very easy. Just download the setup app and it walks you through the setup in less the 5 minutes. My wife and I played a video directly from a website and it streamed flawlessly, with no buffering. I thought a 24 minute video might have some issues, but to my delight, no issues were encountered at all.Google explains on their website that they plan to build onto the media player.  I look forward to being able to stream my own pictures and videos straight from my device. I realize there may already be other devices that allow you to do so, however, I like the portability of this device, not just for use within my home, but also when I travel to my mother in laws or any other family member. I look forward to seeing how Google builds on an already well thought out device.I did also like the very attractive and sturdy packaging chosen by Google. The device itself, although plastic, does not feel cheap. Actually, for its size, I thought it was hefty. The HDMI/USB extension included in the box connects to the dongle very snug.I would and already have recommended this to others. As it is, it works very well, and I am confident that Google will continue building on this first streaming dongle, and it will only get better.", "verified": true, "helpfulness": "1/2", "author": "Henry Mena"}, {"rating": 5.0, "review": "A few quick taps on your phone and you are watching Netflix or YouTube on the big screen.Doesn't get much easier than this.", "verified": true, "helpfulness": "1/2", "author": "AP"}, {"rating": 4.0, "review": "I've used it for a little while, mostly from my iPad, and it does what it says it does and VERY EASILY!  Set up was a total breeze, so much so, it'll set a new standard.  But it's a little glitchy in that when I push pause on my iPad, it sometimes takes awhile to actually pause.  Also tonight I couldn't get it to connect, but it had a software update to do, which didn't actually help it.  I'd love to give this 5 stars, but there are still too many kinks, but I figure these will be worked out and this little cheap device will be the gold standard!  Worked much easier than my Roku and the picture quality was excellent and I was using is on a small flatscreen in my kitchen.  Good work Google!!", "verified": true, "helpfulness": "1/1", "author": "Just the man"}]