[{"rating": 5.0, "review": "It was an easy hookup process. It does wOrk as it is advertised. Worked so well purchased another one for the family", "verified": true, "helpfulness": "0/0", "author": "Jose Tigeleiro \"iamtig\""}, {"rating": 3.0, "review": "I was excited about the Chromecast and managed to get it set up easily enough.We wanted it for our spare TV in the garage so could get Netflix and broadcast Youtube content easily.This is easily done and does an adequate job, but does that and little else for me.Personally much prefer the Amazon Fire TV as has more interaction options and has the added bonus of Kindle video and games.", "verified": true, "helpfulness": "1/1", "author": "Pippen148"}, {"rating": 5.0, "review": "Like very much this item.  Chrome was limited with service products but a recent update made this a wonderful unit.Hope that they consider adding more especially, BYU! THANKS!", "verified": true, "helpfulness": "0/0", "author": "Ralph"}, {"rating": 5.0, "review": "Great device. Able to view Netflix, YouTube, Twitch.TV and files off my computer. Excited to see what apps come out for it over time as well!", "verified": true, "helpfulness": "0/0", "author": "Chris Ryce"}, {"rating": 1.0, "review": "Plug it in and it works?? Not hardly, anything advertised as being easy usually isn't and this is most definitely one of those products.", "verified": true, "helpfulness": "0/2", "author": "Frequent Buyer \"Sherrill McGee\""}, {"rating": 5.0, "review": "what I like is that I can take it anywhere with me. to be able to take it to other countries you only need to change the mac and IP address and you are done! pretty cool item.", "verified": true, "helpfulness": "0/0", "author": "Taz"}, {"rating": 3.0, "review": "It would probably be better with a better internet service but our Verizon is just too slow to make this device very useful for us. I look forward to trying it out when we change services later this year.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love this little contraption.  like everyone else I wish there were more supported apps but i'm sure more are on the way.  If you have netflix or if you like to watch a lot of youtube videos then this is a must have.  Just make sure you have a HDMI port and a USB on the TV makes it much easier also.  I suggest you disconnect it when not used if you don't have a USB port on the TV cause it gets warm.", "verified": true, "helpfulness": "0/0", "author": "Oliver R. Torres"}, {"rating": 5.0, "review": "I was Insist to to buy chrome cast from long being, all of sudden i got interest to buy this product after i seen it my friends place. Buying the product from Amazon is always safe and secure and on top of that More easy. it came in 2 days to my addr without prime shipping. I Loved the product and felt an amazing experience when i started watching it on my VIZIO 60 inches TV, casting from My (I PAD,Samsung Galaxy II PHONE).I will update my comments and TIPs soon i started watching more aggressively starting from the next weekend. Stay Tuned.", "verified": true, "helpfulness": "0/0", "author": "Padma"}, {"rating": 5.0, "review": "LOVE LOVE LOVE my Chromecast. I canceled my Xbox Live account because buying this covered all my needs and only cost me three months of my Xbox membership! Would definitely recommend as a gift for anyone who loves media, music, movies, or just cutting edge technology.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel"}]