[{"rating": 5.0, "review": "Amazing. Just amazing. Quality is better that my wii with Netflix and YouTube. Completely worth $35. Never regretted it, good job Google.", "verified": true, "helpfulness": "0/0", "author": "Canaan gonzalez \"Canaan Gonzalez\""}, {"rating": 4.0, "review": "Got this around Christmas (wait for their semi-regular $30 sales) expressly for casting video from my laptop to my TV. Don't use it that often between the Smart TV I upgraded to and my Roku, but for those times when it's just not possible to find THAT ONE VIDEO on a legal streaming service, Chromecast is there to get the job done.", "verified": true, "helpfulness": "0/0", "author": "D. Zucker"}, {"rating": 4.0, "review": "We have a second generation apple tv, and it works better than this device hands down.  Using a brand new moto x as a remote, the commands lag when pausing and playing.  The quality on netflix is not as good as the 2nd gen apple tv either.BUT35$For a third of the price, you get slightly lower quality and free up a small amount of shelf space.Your call of course.", "verified": true, "helpfulness": "0/0", "author": "matthew t ellish"}, {"rating": 5.0, "review": "Easy and quick set up. Pretty decent price, as well.I highly recommend this product for those who want to stream photos/videos to a larger screen.", "verified": true, "helpfulness": "0/0", "author": "Caroline Cukier"}, {"rating": 5.0, "review": "I have both an apple TV and this chromecast.  I did find the Apple TV to be very easy to install and I have a PC not a MAC.  I also installed the google chromecast.  I had difficulty with it working with my Netgear router but finally got it working.  Then I tried to stream Amazon movies and found that it wouldn't work initially - as some of the reviews have stated.  However, upon further research ,I got it to work when I followed a suggestion listed on the internet. I had to uninstall Microsoft Silverlight from the Control panel on my laptop (PC). Then I went back to Google chrome browser - then logged into amazon and started a movie.A prompt appeared that stated  I should install \"Microsoft Silverlight\" or I could continue using Adobe Flash. I chose using Adobe Flash. Video streaming now as I am typing this answer! Sweet!", "verified": true, "helpfulness": "1/1", "author": "Michele Kelly \"Loving life and family,\""}, {"rating": 5.0, "review": "as it should be, very good, enjoy in different tv's and still working fine, excellent with my internet connection.", "verified": true, "helpfulness": "0/0", "author": "Fernando Farfan \"ebiz56\""}, {"rating": 5.0, "review": "This  product meets what it is advertised..I purchased three of them and use them on my three TV's daily and it meets all expectations..", "verified": true, "helpfulness": "0/0", "author": "Jim Moss"}, {"rating": 5.0, "review": "I use this all the time. I'm looking forward to Amazon Prime video capabilities but for now YouTube and Netflix are easily watched with this. There are other apps for it as well.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "Right now the abilities of Chromecast are limited. However, more apps are becoming available to cast and I see more and more becoming compatible in the future. Even with the limited apps now, Chromecast is well worth your $35 to cast Netflix, Pandora, or you can even cast your computer's desktop using an addon to Google Chrome.", "verified": true, "helpfulness": "0/0", "author": "Peter Nancarrow"}, {"rating": 4.0, "review": "Works well with youtube and netflix.Does not seem to work very well with Comedy Central or NBC.com full episode shows?", "verified": true, "helpfulness": "0/0", "author": "Robocop"}]