[{"rating": 5.0, "review": "I have had the Roku box, Apple TV and now Amazon Fire TV box.. The Amazon Fire TV Box works better than the other two. What I really like about it is the Voice activated search! This is a very valuable tool that I use to find shows or Movies on with out using the silly keyboard.. Movie cashing works well too..", "verified": true, "helpfulness": "0/0", "author": "Gordon V Rose"}, {"rating": 2.0, "review": "All of the apps work fine, but prime tries to milk more money from you, thet list movies and programs that cost to watch. not like netflix that what you see you can watch. not happy with prime", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "as advertised", "verified": true, "helpfulness": "0/0", "author": "S. Parker \"lueur\""}, {"rating": 5.0, "review": "Love my fire tv!!", "verified": true, "helpfulness": "0/0", "author": "Pearl Padilla Brown"}, {"rating": 5.0, "review": "Very happy with my new fire TV and game controller. Can now play some games in my bedroom!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "So far I really love this.  Its easy to set up and use.  The voice search works very well.  I wish there was a little more \"free\" content through Prime and that there was an easier way to set it up so it only displays the free stuff in the search.  My kids get disappointed when they search for Dora the Explorer and then find that everything except for season 1 episodes cost extra. It would be nice to be able to ONLY search free content.", "verified": true, "helpfulness": "0/0", "author": "arylith"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "BB"}, {"rating": 5.0, "review": "I was very pleased with it.  Works really well.", "verified": true, "helpfulness": "0/0", "author": "Mary C. Clarke \"Grandma of three\""}, {"rating": 5.0, "review": "Very easy to install.  Superb packaging and resources to find all features.", "verified": true, "helpfulness": "0/0", "author": "Joseph Eric Krull"}, {"rating": 5.0, "review": "Very intuitive, we were set up in less than 5 minutes...Now we have a \"smart\" tv without having to spend a fortune on a new tv!", "verified": true, "helpfulness": "0/0", "author": "Ray Scarabosio"}]