[{"rating": 5.0, "review": "it is great so very nice to have . thank all of you at Amazon", "verified": true, "helpfulness": "1/2", "author": "Sharon l childers"}, {"rating": 5.0, "review": "This device has been a god-send...goodbye cable/satellite. Between Prime and netflix we have watched more quality programming as a family in the last month than ever. It felt great turning in our cable boxes and we haven't looked back. The ease of setup and use is unparalled and the small footprint a welcome respite from the ugly receivers we coped with...we subscribed to all the big names over the years from cable to satellite to fiber...good riddance. Just bought one for my parents and am sure they'll soon kiss their satellite subscription goodbye.", "verified": true, "helpfulness": "1/2", "author": "Gerhayr Djahani"}, {"rating": 2.0, "review": "I've had the Amazon Fire for 7 months now. The Amazon Prime shows work great. The other apps it supposedly supports do no work. We have to unplug it daily for it to work as it should. I wouldn't purchase this again.", "verified": true, "helpfulness": "0/3", "author": "Hannah Newberry"}, {"rating": 1.0, "review": "returned", "verified": true, "helpfulness": "1/14", "author": "Edgardo Alicea"}, {"rating": 5.0, "review": "Product is amazing but the mandatory tutorial video is ridiculous.", "verified": true, "helpfulness": "0/1", "author": "D"}, {"rating": 2.0, "review": "Why doesn't amazon have a package like netflix for maybe 100 dollars a year for free movies. I can't afford 2.98 a movie when I got a redbox across the street for 1.00 a movie. I love amazon but what gives?", "verified": true, "helpfulness": "0/6", "author": "Albert C."}, {"rating": 1.0, "review": "I kind of hate that they use this as a way to get you to purchase or rent other movies. It really pisses me off. Apple TV is Better with Netflix.", "verified": true, "helpfulness": "1/11", "author": "fred"}, {"rating": 5.0, "review": "I absolutely love this fire TV", "verified": true, "helpfulness": "0/1", "author": "philip geyer"}, {"rating": 5.0, "review": "We use it on our primary TV. I sold my Roku's because I liked the interface better on the Fire TV's. I prefer this over the stick because you do get the better performance and remote.", "verified": true, "helpfulness": "1/2", "author": "Dina"}, {"rating": 5.0, "review": "Works like a charm.  Very easy setup.", "verified": true, "helpfulness": "1/2", "author": "Roberta H. Barnett"}]