[{"rating": 5.0, "review": "Good item, easy to use", "verified": true, "helpfulness": "0/1", "author": "BORIS"}, {"rating": 5.0, "review": "works for everything i use, side loaded crunchy roll... AMAZING, i dont use my apple t.v. or roku anymore.", "verified": true, "helpfulness": "0/0", "author": "Jason W Gibson"}, {"rating": 1.0, "review": "It was not at all what I wanted,  hoped for, or expected.I hate writing this review after buying (2) two complete sets and an extra controler.This is my first not positive review of an Amazon product and I hate doing it but I feel this product is more hype th a n good.SORRY.", "verified": true, "helpfulness": "2/18", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We live way out in the country and a fast internet is not one of the benefits, 1 megabit/sec. I was not to sure about buying this device because we tried another movie service and it was a dismal failure. So, enter the Amazon Fire TV, simply, we just love it. With Prime, the shows and movies available are great. Add your own music line up to listen to music YOU like. Amazon Fire TV definitely a thumbs up for anyone living out of the regular provider area.", "verified": true, "helpfulness": "2/2", "author": "The Saints \"Les\""}, {"rating": 1.0, "review": "This product doesn't let me access live TV and won't work after a week.", "verified": true, "helpfulness": "3/18", "author": "Kimberly E. Lightfoot \"Kim-E\""}, {"rating": 3.0, "review": "I love fire tv. Only thing is mine worked for less than a month. I am getting a replacement so I'm happy about that.", "verified": true, "helpfulness": "0/3", "author": "Charmaine Kokichi"}, {"rating": 1.0, "review": "Humm nit a good stuff", "verified": true, "helpfulness": "1/23", "author": "Gustavo"}, {"rating": 5.0, "review": "It works as expected. It is nice to have a voice search feature.", "verified": true, "helpfulness": "0/1", "author": "JOSEPH W MESSIER \"Joe Messier\""}, {"rating": 5.0, "review": "I'm loving it!  The quality is much better than I expected. It is easy to set up and very intuitive to use.  I love the way it works with my iPad for YouTube videos, and I am enjoying the content provided by Amazon Prime. Overall, a very good investment.", "verified": true, "helpfulness": "0/0", "author": "Alan in Sacramento"}, {"rating": 5.0, "review": "I love  the fire tv but they should  make the basic  channel  free and the remote  that came with it didn't  work good  at all it kill my battery  so had to buy a new one and it work better", "verified": true, "helpfulness": "0/2", "author": "oman martin"}]