[{"rating": 5.0, "review": "very easy to connect", "verified": true, "helpfulness": "0/0", "author": "Laura Comella"}, {"rating": 5.0, "review": "second one that I purchased for college. Be aware that private networks like those in dorms may restrict use of this device. I'm using it in a private residence", "verified": true, "helpfulness": "0/0", "author": "drtjyen"}, {"rating": 3.0, "review": "When I originally received the Chromecast I loved it. After having to move to a different apartment, I found out that it only works when you have a super strong internet connection. Since my move, I haven't really been able to us it. It keeps cutting out on the signal and having terrible picture quality.I am keeping the product because it would possibly work depending on what TV i choose to use it on, other than that I am kinda disappointed after seeing my sisters Amazon Fire Stick. That is worth the money, compared to this.One feature that was really cool was the the screen sharing you could do on a laptop through Google Chrome.", "verified": false, "helpfulness": "0/0", "author": "Melanie"}, {"rating": 5.0, "review": "GOOD DEAL!", "verified": true, "helpfulness": "0/0", "author": "ROMEO"}, {"rating": 4.0, "review": "works perfectly. i've actually purchased 3 in total for myself and for friends as gifts. does exactly what it says it does. i love using it to access hulu and netflix, just wish it could use the feature where you stream from the lap top or phone (non chromecast apps) better, that part doesn't work so great.", "verified": true, "helpfulness": "0/0", "author": "shewantscontrol"}, {"rating": 5.0, "review": "great produce and easy to set up", "verified": true, "helpfulness": "0/0", "author": "richard n otani"}, {"rating": 1.0, "review": "The Google Chromecast is unreliable.", "verified": true, "helpfulness": "0/0", "author": "Erica Weber"}, {"rating": 5.0, "review": "Always need it for casting", "verified": true, "helpfulness": "0/0", "author": "Khoa Nguyen"}, {"rating": 5.0, "review": "Best streaming device on the market.", "verified": true, "helpfulness": "0/0", "author": "patrickgebhart@gmail.com"}, {"rating": 4.0, "review": "Doesn't work in Hotels with tablets or phones but nice when working", "verified": true, "helpfulness": "0/0", "author": "MIchael McIntyre"}]