[{"rating": 2.0, "review": "The Roku I bought from Target is so much better and more reliable. I junked this one.", "verified": true, "helpfulness": "0/1", "author": "Greg Coltrin"}, {"rating": 5.0, "review": "I have a few other products like this and the Chromecast is by far the best! Its speed it great compared to the other.  It is great quality smooth picture not a lot of buffering like the others.", "verified": false, "helpfulness": "1/1", "author": "Jeffery"}, {"rating": 5.0, "review": "3rd chromecast that I've bought, we just love having these in each TV and for family members. Biggest usage apps for us are Netflix and Hulu Plus (we are cord cutters) and having these inexpensive low power devices are wonderful.", "verified": true, "helpfulness": "0/0", "author": "Dabo"}, {"rating": 3.0, "review": "Installs easily. Cannot get it synchronized with my network. Need to call \"the guy\".", "verified": true, "helpfulness": "0/0", "author": "Tom Fraser"}, {"rating": 5.0, "review": "Big fan of the Chromecast, we use it in the bedroom were we do not have a \"smart TV\" and I love how easy it is to travel with in case we want to use it while on the road. Super easy to use and I love that they keep adding services.", "verified": true, "helpfulness": "1/1", "author": "Sam"}, {"rating": 5.0, "review": "Very easy to install. Works great.", "verified": true, "helpfulness": "1/1", "author": "Sally Weismann"}, {"rating": 4.0, "review": "it is ok!!, more apps are needed", "verified": true, "helpfulness": "0/0", "author": "Santiago Del Bono"}, {"rating": 5.0, "review": "This article is excellent , I recommend", "verified": true, "helpfulness": "0/1", "author": "CHRISTIAN CANDANEDO"}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/1", "author": "william whiteford"}, {"rating": 5.0, "review": "I love my Chromecast, especially when I use my phone as a remote. I have a Chromebook and (ironically) the Chromecast seems to have trouble switching episodes seamlessly when casting from my chromebook. My iPhone, however, works much better - the episodes play back to back and I can still send texts and browse the internet on my phone.", "verified": true, "helpfulness": "1/1", "author": "Alex Twice"}]