[{"rating": 5.0, "review": "Excelent product!!", "verified": true, "helpfulness": "0/0", "author": "francis Nunez"}, {"rating": 4.0, "review": "Excellent device, use to watch the movies in my library (I use Plex Server) and occasionally see videos on YouTube. Easy to configure. The only weak point is the mandatory use of the Internet even when the media are accessed locally.", "verified": true, "helpfulness": "0/0", "author": "Manuel Canchica \"Mizzar\""}, {"rating": 5.0, "review": "Still playing around with it, but noticed it does not have an internal battery, you have to use it plugged in to an usb or the power supply. Only works with chrome tabs, would be perfect if it mirrored the screen.", "verified": true, "helpfulness": "0/0", "author": "Tarcisio"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Mohammed Al Salubi"}, {"rating": 3.0, "review": "Not what I thought it would be. Replaced it with a Sony Blue Ray player with wireless access.", "verified": true, "helpfulness": "0/0", "author": "Charlie L. Taylor Jr."}, {"rating": 3.0, "review": "Need a lot of updates but great product", "verified": true, "helpfulness": "0/0", "author": "Saud"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Yossi"}, {"rating": 5.0, "review": "Screen casting is now supported. I'll get an occasional bug where Chromecast seems to lose sync with my controlling device while I'm making changes to the playlist. Hopefully, those bugs will get worked out. For $35, this is an amazing value.", "verified": true, "helpfulness": "0/0", "author": "TITAN"}, {"rating": 5.0, "review": "Come on and buy it already!  I would have paid double and probably triple the price of this thing.  The biggest negative is on Amazon.  COME ON AND MAKE AN APP FOR THIS THING ALREADY!  Regardless, using the chrome browser you can cast your prime videos, and I was surprised to find out that when casting a tab with video, the sound plays on the TV!  I was under the assumption that the video would play on the TV but the sound through the computer.  NOPE... So that made it even better!", "verified": true, "helpfulness": "0/0", "author": "Heath"}, {"rating": 2.0, "review": "I find this device to be of very limited use. It essentially turns your TV into a smart TV but with some major restrictions.You control it with either the Chrome browser on a PC, an iPhone, or an Android phone. My wife has an iPhone but I have a Window's phone. I cannot Chromecast from my phone. As for Chromecasting from a PC I have to wonder what the point is - I get better results with an HDMI cable. Furthermore, it doesn't even work when I Chromecast from my old Dell Inspiron - I get a black screen. It's not uncommon for the device not to work at all and it can take several attempts to actually watch something.So we have two controllers: my wife's iPhone and my XPS computer upstairs. My wife is fed up with me borrowing her iPhone to use as a remote.It's an interesting idea, but for us it simply doesn't satisfy our needs. I'm waiting for one of our TVs to break so I can replace it with a smart TV. I think that's a better solution for us.", "verified": true, "helpfulness": "0/0", "author": "Math Addict"}]