[{"rating": 2.0, "review": "When I first connected it using an ethernet cable to my router, it went to the \"Amazon\" screen on my TV and then went to a blank screen. After plugging and unplugging the power several times, it finally made it to the home screen. Everything worked fine--very fast and easy to use interface and even connected fast to Netflix--until I unplugged it from the wall and plugged it into my surge protector outlet cord. After many repeated attempts to get back to the home screen, but only getting to a blank screen, I finally gave up. I will be returning it to Amazon. My Roku works fine so I will stick with it even though it isn't as fast as the Fire TV when it works.  UPDATE: I forgot to mention that the audio was peculiar. People speaking on both live action and animated shows had voices that came across with a slight hissing or lisping to them. Most likely I just happened to get a defective device.", "verified": true, "helpfulness": "5/9", "author": "Orlando J. Alaniz"}, {"rating": 5.0, "review": "I should preface this by saying that I am an Apple guy who loves his Apple TV.  That said, I also have a Roku 2 XD that I use to watch Amazon Prime with.  I also received a Google Chromecast as a holiday gift, and while it's a fun, little gadget - it is the most limiting of all the devices, albeit the cheapest.Upon opening the Amazon Fire TV I received last night, I have to admit that it was reminiscent of opening an Apple device.  I knew the specs ahead of time- the limited number of TV apps (no HBO GO, etc.) and games, as well as all the touted highlights such as voice search, fast buffering, and flash space.Right away it was linked to my account and after the quick setup and video tutorial, I was ready to go.  My current internet speed is 20mbs, which was fast enough to watch HD movies on Netflix and Hulu through AppleTV- both without any hiccups.  Unfortunately the Roku device I was using was unreasonably slow.  Most of the time it would take a while to buffer, then pause several times at the beginning before finally getting underway.  Honestly, it was often frustrating and I knew it was the Roku device because Amazon Prime would run smoothly on my iPad.  I have not tried Roku 3, which I understand is faster so I'm afraid I can't comment or compare.The Amazon Fire TV is exactly what it claims to be- nothing less, nothing more.  It performs smoothly and effortlessly, and I have to admit that I use it now for Netflix, Hulu, and Prime.  Eventually I'm sure it will add other shows like PBS, Smithsonian, HBO, etc.  But the interface is extremely fast, and both Netflix and Prime have very little initial buffering (less than 3 seconds).  I still use my Apple TV and feel that the menu interface is still the best of all, but the Amazon Fire is a close second.  It's very solidly made, the menu screens are quick and easy to navigate through, and the remote design is simple yet elegant.My advice to others considering this is:  Buy the device that suits your needs.  There is no perfect interface out there.  Let's face it, they all have areas to improve.  If you're simply looking for something to play Netflix, Amazon videos, and Hulu - then this is the most advanced in terms of specs.  Hopefully other TV apps will be added soon.  After thoroughly using it with a lot of enjoyment- it is very difficult to not admit that the Amazon Fire is the current leader- with lots of room to improve as far as TV apps.A note about the gaming--I have only tried the few free games, but they have all worked flawlessly and smoothly.  Nothing special, particularly since I'm only using the stick.  But I do look forward to the controller to have a little arcade fun.  This isn't a gamer machine obviously, but it's a cheaper alternative to playing app games on your TV.", "verified": true, "helpfulness": "4/6", "author": "Kurt Doerr \"Frequent Amazonian\""}, {"rating": 3.0, "review": "UPDATE 1820 April 5:  I'll leave my full review here in chronological order for comedy's sake:The unit downloaded and installed all the latest software, ran the expected updates, then rebooted to the \"Amazon Fire TV\" splash screen.(\"press play to continue\")press play, and for two seconds, get a \"checking for updates\" screen, which then flickers and goes to a blank, black screen.Repeat 20 times.  No better result.I get that this is a new device, and there will be hiccups.  However, the \"support\" provided online assumes the device is working and there is something wrong with you, your wifi, or your TV.  Nothing about what to do if the device is defective.So you have to begin to *return* the item on amazon.com, where at some point, you're instructed to call a phone number.  This gets you to tech support for Kindle.  The guy at that desk was totally confused, and put me on hold while he found the \"right department\" and transferred me.The \"right department\" turned out to be the group that historically has supported technical issues with streaming content.  The woman I spoke with was helpful, but unfamiliar with the process for replacing defective hardware.Amazon needs to get their house in order before they release a new electronic product that's bound to have issues upon its release.My biggest disappointment is that I was pretty stoked to check this thing out, so for the first time ever, paid the extra $3.99 on my Prime to get it the same day.  The replacement unit won't be here until tomorrow, even though i called in the issue with plenty of time to get it to me today.  That just \"wasn't an option\" that was available to the person who handled the call.That's kind of broke.UPDATE April 5-Second unit arrived today, failed in exactly the same manner.  Thought maybe it was the fact that I was connected to my router via ethernet cable, so tried connecting via wifi, no difference.  Amazon support guy is speculating that it might just have been a bad batch of units at whatever distribution center is shipping to me.  Whatever.  We'll see how long it takes the THIRD unit to get here.  What a disappointment.SECOND UPDATE April 5-Got another call from Amazon support, and NOW they tell me that the problem is the HDMI to DVI cable that I was using to connect the Fire TV to my 10-year old 55-inch Mitsubishi rear projector CRT TV.  Ha!  I guess they never suspected that someone would try to use the Fire TV with a dinosaur like my TV, but I hate the thought of parting with it (mostly because it means getting rid of a TV that works fine...AND moving the 270-pound behemoth out of my house!Would have been nice to have that info somewhere on the specs about the device, and the guy in support said they were working on it.  I guess it shuts you down because it assumes you're trying to record the streaming content or something.  Digital Rights Management is making my old TV obsolete!  So sad.", "verified": true, "helpfulness": "51/66", "author": "Christopher Diersen"}, {"rating": 5.0, "review": "I was a little hesitant in ordering this because I didn't know if I would be able to install myself, I'm nearly 62 and not real good with all the electronics let alone install it myself. well, I did it in about half an hour (others will be quicker I'm sure) and I am so amazed how easy it was... I went ahead and programed my stuff/apps. I ABSOLUTELY LOVE IT!!To the older folks like me, don't be afraid, just follow easy instructions...Thanks Amazon!", "verified": true, "helpfulness": "5/6", "author": "kim"}, {"rating": 2.0, "review": "Ouch amazon, failed to mention that the shows for prime only is a small portion of the show is free. I could deal with that, but when I try to watch these selections, it just goes to the prime advertisement screen. I have a prime account and am logged in, but unable to watch anything. Had it for only a couple of hours, and I'm already regretting this decision to waste my money. I am now scared to see what else I got ripped off on. At least the screen saver is cool, and gives me something to look at while I write this reveiw of disappointment.", "verified": true, "helpfulness": "5/13", "author": "Bossman"}, {"rating": 5.0, "review": "Good things come in small packages and this is a great device!  I love it and it doesn't take up much space", "verified": true, "helpfulness": "0/1", "author": "Billy STORMES \"BILLY STORMES\""}, {"rating": 4.0, "review": "I think the Fire TV is great! After hooking it up, it took about 10 minutes to download the software and install. There is no way around the annoying tutorial video. It's long and needs to have an option to skip. DO NOT hit the back button because it will make you watch the whole thing over again...no fast forwarding allowed! My amazon account was already pre-programmed in so I didn't have to enter any usernames, passwords, or the 5 digit prime pin #.Once you make it through the video, it loads fast. I normally watch prime videos through the PS3 or have a bulky 25ft hdmi hooked up from my laptop to the TV in our bedroom. The load time never seemed long but after using the Fire TV, the Fire TV loads at least 2 times faster. The picture looks great. The box is tiny!The only reason why I'm not giving it 5 stars is because of the tutorial video and the search. The voice search is great when it comes to recognizing what I'm saying. It hasn't mistaken what I've said yet. It's just some of the results seem wrong or unorganized. I tried different searches- more vague or more detailed - of the same show (Dr Who, Season 7, Part 1). When I was specific and said exactly what it is named on Amazon, I ended up not even getting Dr Who as a search result. After messing with it for 10-15 minutes, it was just easier to go on my computer and add the season to my watch list so I could select it.Overall, I'm very happy with it and would recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Travis"}, {"rating": 4.0, "review": "Ok, so I have Roku boxes, Apple TV, Chromecast and some older Google TV boxes. This Amazon Fire came in today, setup was a piece of cake, it connected to wifi and like others mentioned it downloaded some updates, resetting a few times during the process.Then a quick cartoonish video intro tells you about the device, then its ready.Pros. Fast in every way.. you can have this running a netflix of huluplus movie, if you unplug it and plug it back in it boots and is ready for a selection in 30 secs flat.It remembers the last app you ran so its ready for you to launch it again if you wish.Fast at everything, running Netflix, Hulu, Amazon, Youtube, it has basically no lag.Cons: Ok so the voice search only finds movies on Amazon right now, but I think they will improve that down the road, but you can instead of looking for Netflix Youtube or other app, just push the button on the remote and say Netflix or Youtube and the app will popup ready for you to select it, so its a nice feature.Of course like most of these devices its a pain signing into the various services, Netflix, You tube, Hulu etc...So basically it does not really offer any earth shattering features, not a lot of channels, and its pricey. But if you want a device that functions Fast, searches fast, launches apps fast .. then like me you may find it a pretty decent device. I'm keeping mine.", "verified": true, "helpfulness": "8/8", "author": "TripMaker"}, {"rating": 5.0, "review": "The features have all been reviewed here before, so I'll talk about the out-of-box experience. Just like buying a Kindle, this couldn't be easier and more straightforward. In a phrase, \"it just works\"!First, I was pleasantly surprised at the very small size of this device - it's tiny compared to some of the others out there. The Fire TV doesn't take up any space at all in your media center. It's so small that you can conveniently place it in any spare spot - I put it under one end of our flat-screen. The power supply is separate from the unit, and likewise it's tiny, in fact it's the same small power supply that is used for the Kindle Fire.I unpacked it and plugged it in with an HDMI cable. Then there is the remote - it's also very small but not so small as to be unusable. It's far smaller than the typical television remote and it has very many fewer buttons. So few as to be self-explainable.When you first power up the Fire TV it will download a software update if one is available. That only takes a few minutes to download and install. What's happening is very clear on the screen. If this is the first time you've used the unit, it will go immediately to a short and straightforward tutorial. I recommend that you view this, but again it's so straightforward you hardly need it.Then it's on to the home screen and your choice of hundreds of thousands of movies, TV shows, games, and more. To get to this point was so easy that anybody who can plug in the HDMI cable and the network cable (or follow the easy screens to select and access a wireless network) should be able to do this.", "verified": true, "helpfulness": "1/2", "author": "JW"}, {"rating": 5.0, "review": "Absolutely AWESOME. if you don't like this product, you should demand your money back so you'll have the money to pay for a SHRINK!", "verified": true, "helpfulness": "3/5", "author": "Karen"}]