[{"rating": 5.0, "review": "Works great.I was able to cast video from my Galaxy Note 4 and my Galaxy Tab S 10.5 tablet.", "verified": true, "helpfulness": "0/0", "author": "Brad M. Moreau"}, {"rating": 4.0, "review": "Awesome tiny device. Bought 6 and all are still working well. The only downside is that wifi isn't that powerful.Since it requires another device (ios, android or pc) to be used, maybe I'd get an Amazon Fire Stick next time.", "verified": true, "helpfulness": "0/0", "author": "Victor M."}, {"rating": 5.0, "review": "I bought it use on our 80in TV but I never attached it.", "verified": true, "helpfulness": "0/0", "author": "Robert Patterson \"Super Scouter\""}, {"rating": 5.0, "review": "works great, easy to setup, love it", "verified": true, "helpfulness": "0/0", "author": "Davina Elaine Campbell"}, {"rating": 4.0, "review": "Had the dreaded \"pink screen\" problem but switched to another hdmi port and it cleared right up.", "verified": true, "helpfulness": "0/0", "author": "David Bossi \"Dave\""}, {"rating": 5.0, "review": "I love how easy to use this is, how small it is, how affordable it is, and the quality of the streaming.  Would buy again!  But hopefully will never need to.", "verified": true, "helpfulness": "0/0", "author": "Larysa Vdovychenko"}, {"rating": 3.0, "review": "Pro's1-Small2-Easy to install3-Works well on Galaxy S5 and Galaxy Note 4Cons1-Interface needs a LOT of work.2- VERY slow vs full size streaming device. Would NOT recommend unless install demands it3-Streamed phone content looks HORRIBLE even on my high powered Note 4 when send to even a small 40\" tv.Overall i would say that unless a full size roku or amazon tv or apple tv is not a possibility for the install avoid ALL sticks that includes the roku stick. They are slow as molasses and finicky. They are necessity items only and not in anyway shape or form replacements for their big brothers.", "verified": true, "helpfulness": "0/0", "author": "Robert Kirkpatrick"}, {"rating": 5.0, "review": "good good item", "verified": true, "helpfulness": "0/0", "author": "Hung"}, {"rating": 5.0, "review": "My sister loved it I have one she saw mine and wanted one so I got her for Christmas", "verified": true, "helpfulness": "0/0", "author": "Karen Halus \"OLDSCOTTY\""}, {"rating": 5.0, "review": "Love it!  Very easy to set up, have to say I haven't used it other than to watch season 1 to 4 of Game of Thrones but it was so worth the purchase just for that - cheaper than buying the DVDs - I'm not one to watch things more than once.", "verified": true, "helpfulness": "0/0", "author": "Bitey'sMom"}]