[{"rating": 5.0, "review": "Well that's it best media player ever or best media player I have used so far. The streaming is amazing Netflix is just wow. The remote is amazing and works from so far its ridiculous. The WiFi reception is great the ethernet connection is really fast. The only issue an I mean only issue is there is no volume button on the remote. The fire tv stick is what drove me to get the fire tv box and the fire tv stick is no push over.Edit: if you are like me and own a play jam gamestick there is no need to order the fire tv game controller just pair the gamestick controller to your fire tv and you are good to go this save me having to buy a next controller and yes my device is still streaming fast and smooth", "verified": true, "helpfulness": "0/0", "author": "deangelo bonimy"}, {"rating": 1.0, "review": "Bought one and can't get it to hook up to the internet. Even had my internet provider come install a booster still no luck. So far not good. If I can get this to work I'll give new review.", "verified": true, "helpfulness": "2/9", "author": "Big Mike"}, {"rating": 5.0, "review": "I must admit upfront that I love Apple products, but Amazon Fire TV beats the pants off my Apple TV 2nd generation.  I picked my Amazon Fire TV from a big box retailer during the 2014 holiday season for $75.00 and use it in the bedroom with a 42 inch Sony LCD TV, Comcast cable box, and a Harmony Hub.I'm addicted to BBQing, and watch YouTube videos in my free time.  The YouTube app for AppleTV just outright sucks.  You can't view any of the YouTube channels that you subscribe to on AppleTV.  Amazon Fire TV does this and a lot more with no issues!", "verified": true, "helpfulness": "1/3", "author": "Derrick"}, {"rating": 4.0, "review": "Great system.  The video game Sev Zero is fantastic when played with the tablet in Co-OP mode.  There are a lot of options for apps and the usual video rental sites.  The only drawback is the very very very low amount of memory and that the apps are still in the development phase.", "verified": true, "helpfulness": "0/0", "author": "DC \"joe consumer\""}, {"rating": 5.0, "review": "Love, Love Love!I admit, I have a problem. I use and abuse Amazon on an almost daily basis. But they always give back!I'm switching to the Fire TV from my awesome, super duper does everything and you pay for it 3d wifi blu-ray player. We also have Roku, which I'll get to in a minute.I've used Fire TV nearly daily for months now and feel like I can give an honest review.I know people here have technically reviewed the Fire TV out the wazoo, so I won't even try. I'm technically adequate but no expert. I can't tell you exactly what the specs are without looking them up, Googling and comparing, and then having my husband interpret the data into real world scenarios. I'm all about usability. So here goes.Buy Fire box. Wait for delivery of Fire box. Plug in Fire box to the wall. Plug in Fire box to TV using an HDMI cable (single cord, flat plug, looks like a platypus bill on both sides.) Put the included batteries in the included remote. Press the big button on the remote to turn it on. Turn on TV to correct input. Cheer! Go through the short tutorial for those who haven't yet moved beyond checking email on their computer. Yes, you heard the man. It really is that simple :)The first thing you can do: if you use Netflix, Hulu, Pandora, HBOgo, etc- it immediately has you load your apps. Super easy. Confirm your subscription and you now have a one stop shop. You can always add them later as well, but doing it all at once allows for a smoother time overall. No need to confirm your Amazon account- it's preloaded.The box itself is small and black and looks just fine next to my gaming console and dvd player. It's the size of a stack of 4 mini floppy discs. I barely notice it, except for the blue light that lets me know it's awake. Which leads me to that small irritation-It doesn't turn off. If you pause in the middle of an episode to go snuggle with someone, it'll still be waiting for you in the middle of that episode in the morning. Just turn on your TV and push play. I prefer to hit the Home button when I leave so that the box can sleep at night. Yes, I know it's not really off, but when the blue light goes away I don't feel like I'm wasting energy. My parents always taught me to turn the lights off when I leave a room and I guess the lesson stuck. If it bothers you, you can always unplug it. Or plug it into an outlet that connects to a wall switch and flip the switch as needed. You won't mess anything up. It'll turn right back on on the home screen whenever you're ready.It's fast. My super duper expensive blu ray player has lag time (that pause after you hit the button to when the action is carried through on the screen.) My Fire TV is so speedy there are times I think it predicts the future and makes selections for me. But that's crazy, right? Right?! Yeah, that face you're making? So not helping the paranoia. Thanks anyway. pfftThe menu is better organized and more user friendly than Playstation, Wii, XBox, or any of our other consoles/ players. Fewer buttons need to be pushed, the options are easier to find (closed captions, etc) and the kids can watch their shows while mommy plays Bioshock 2. Or whatever you're into. I don't judge.Anyone who has Netflix knows the eyerolling irritation of that red screen. The one you have to wait for. Sometimes as long as 2 or 3 minutes while Netflix decides if you're worthy of service that day. Yes, it's the perfect length of time to grab a beer and pop some popcorn. But what if it's your spouse's turn to do the cooking? What are you gonna do for 3 minutes by yourself on the couch? Wait, don't answer that. Your spouse will be happy to know that with the Fire TV, you won't have to wait more than 5 seconds. You can now binge watch Orange is the New Black without yelling at the screen between episodes.Also, if you have Hulu Plus. And by the way Amazon, this is the Best. Feature. Ever. If you're watching past seasons of a show using Amazon (Arrow, Once Upon a Time, etc) and you get to a current season that Hulu Plus has, it AUTOMATICALLY switches to Hulu. No need to go searching, no need to load Hulu yourself (assuming you already have the app.) It just rolls right into the next episode of the newest season. How awesome is that? That 'more ways to watch' feature was a stroke of genius. I hope someone got a Mercedes-Benz for that.You can also game on the Fire TV. Honestly? I haven't even tried that yet. My Amazon games are played well enough on my laptop or my Kindle Fire (Plague Inc, I'm looking at you) that I haven't felt the need. I might one day. I consider it a bonus feature, though. I don't feel I'll have wasted money if I don't use it. The Fire TV is awesome all on it's own.In short, my blu ray player does do one thing better than the Fire TV. It plays discs. Yes, that's it. It is now a (insert ridiculous amount of money here) paperweight. Seriously, who watches discs these days?Ok, Roku. Our house has a projector system. It's antiquated and annoying and finds new ways to be inconvenient every freakin' day. We recently discovered that some part of it is incompatible with the Fire TV. It still uses that tri-colored cord. You know, the one that came with the Super Nintendo? Because it's that old. We bought an HDMI box converter thingy to use the XBox with it, but the Fire TV has a bit of protected software that means it's never going to work. So we have a Roku. It was desperation, not choice. I really wanted Walking Dead on that theater screen.And the very best thing about the Fire TV? Amazon. Their customer service. Awesome. Above and Beyond. Returns, refunds, fixes, warranties, updates. You name it, they'll try to help. And they actually READ our reviews! They look for ways to improve. They take suggestions and implement them. It's more than lip service. Want a category for Prime movies and Prime shows? They added that. Want better control over what our kids watch and how much they watch? New update! It might not be immediate, but you would be surprised by just how much planning and design and coding and testing a company has to go through before releasing new software. It's insane. They're working on it. As long as you tell them what you want.PS- I want the newest Kindle for my birthday.", "verified": true, "helpfulness": "4/4", "author": "Elizabeth S"}, {"rating": 4.0, "review": "I wanted to give this 5 stars but i just cant.  I have 2 Chromecast units as well.Pros : small size for what it is, ethernet port so it can be hard wired vs wireless, audio optical out if you want it.  the general layout is pretty decent but it could be upgraded i think.  pretty decent layout within the apps.  i have mine hardwired to my router and it connected right away.  you have to download the apps (hulu, netflix etc) rather than being auto loaded but its not so bad.Cons : Voice search.  although it works nice & detects what you are saying very well and you do not need to hold the remote close, the search defaults to amazon instant videos.  if you open an app (say hulu, netflix or youtube) and use the voice search within them it still just defaults to amazon instant videos.  i cannot get it to work within the apps only.  this is a major flaw in my opinion.granted i may be doing something wrong but i cannot find a way to change this.at the top of the screen it shows your most recent but the apps are clear at the bottom.  i kind of wish it was more customizable so you can place your favorites somewhere", "verified": true, "helpfulness": "1/1", "author": "neil taylor"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "moneydoesntgrowontrees"}, {"rating": 5.0, "review": "Whoa!!! I ordered this last night and got it this morning!!!! Seriously, like at 9:30 am.", "verified": true, "helpfulness": "0/0", "author": "Frankie"}, {"rating": 5.0, "review": "It's amazing", "verified": true, "helpfulness": "0/0", "author": "James R \"rasmann\""}, {"rating": 5.0, "review": "This is one amazing piece of technology. Love it. I am replacing my sony google player with this and loving it.", "verified": true, "helpfulness": "1/1", "author": "SHAN KUMAR"}]