[{"rating": 5.0, "review": "I work some evenings, so I miss my favorite shows. I use Chromecast and my subscription to Hulu+ and the app on my tablet to watch the shows on my tv. It works well and the shows are in HD. I recommend Chromecast.", "verified": true, "helpfulness": "0/0", "author": "tsm"}, {"rating": 1.0, "review": "Just amazing... I buy it off of Amazon to play the Amazon Prime videos (Prime price just went up) and Chromecast does not even play these videos. When will it play these videos? If I need to configure it so that it does play the Amazon videos please tell me how. Looks nice but looking nice and displaying the Amazon website does not play the Amazon videos.Come on techies... you can do better than this.", "verified": true, "helpfulness": "0/1", "author": "Paul Ruez \"Pruez\""}, {"rating": 5.0, "review": "Got it. Plugged it in and it works great! We enjoy the flexibility of home entertainment  it provides for such a affordable price.", "verified": true, "helpfulness": "0/0", "author": "David Soens"}, {"rating": 5.0, "review": "Easy setup. Easy to use. Works brilliantly!!! Makes watching Youtube videos a much better experience. High res and high quality audio. Would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Hollington Lee"}, {"rating": 3.0, "review": "Apps are lacking, not very versatile unless you subscribe to the over priced steaming vendors. Easy to setup and what's there works fine though.", "verified": true, "helpfulness": "0/0", "author": "S. Lampe"}, {"rating": 4.0, "review": "Works as expected, although its a bit slow!!! Was easy to setup and start using.Could do well with more content!!", "verified": true, "helpfulness": "0/0", "author": "Evroy J."}, {"rating": 5.0, "review": "I love my Chromecast,  Very easy to set up and use. I prefer to use it to stream my Netflix over my blu ray player, it just seems to run smoother.Many ppeople still don't know about this product or what it can do, Google should do a better job promoting it. Great price on top of that.", "verified": true, "helpfulness": "0/0", "author": "M. Whitfield"}, {"rating": 5.0, "review": "There are so much things that I can do with it than a thought. I am really enjoying it.Besides youtube and netflix you can see videos or photos on your laptop just installing the chrome's add-in", "verified": true, "helpfulness": "0/0", "author": "Leticia"}, {"rating": 4.0, "review": "I like that you can watch a video on YouTube and Netflix and still used your iPad's other apps. To", "verified": true, "helpfulness": "1/1", "author": "Glenroy Laing"}, {"rating": 5.0, "review": "Love the Youtube functionality for sharing videos with company. We have Netflix streaming and that works great too. Totally simple product that works exactly as it is supposed to. Thirty five bucks well spent.", "verified": true, "helpfulness": "0/0", "author": "Cheech \"Chicago_Cheech\""}]