[{"rating": 3.0, "review": "Awesome technology! I think it will be amazing when  you can stream Amazon Prime, Pandora, and your iPad screen to the TV... until then, it's okay.", "verified": true, "helpfulness": "0/0", "author": "Henry F. Featherly III \"trey featherly\""}, {"rating": 5.0, "review": "Great ideaIt was so fast and easy to set up. The picture quality is the best, go out and get one fast", "verified": true, "helpfulness": "0/0", "author": "Sidney Skinner"}, {"rating": 4.0, "review": "This device works well. Easy to use. I hope more applications utilize it in the near future. I definitely recommend.  Cheap way to turn your hdtv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Jason N."}, {"rating": 3.0, "review": "I ordered 2 of them.  The first one worked great, but the second would not boot.  Amazon immediately did the RMA thing and replaced it in 3 days, so no complaint there.  However, I'm a little nervous about Google's quality control.  When they work, they work great.  Great way to add Netflix to the kitchen TV.", "verified": true, "helpfulness": "0/0", "author": "Shawn"}, {"rating": 4.0, "review": "This is a handy device if you don't have a streaming device already. It's really simple. You pick what you want to watch on Netflix/ YouTube/ google play and direct it to play via the chromecast. I run it from my IPad and which I can turn off to conserve power with no hitch it stream. It's also really simple to set up as well. I only wish it was Amazon friendly.", "verified": true, "helpfulness": "0/0", "author": "Jowa"}, {"rating": 1.0, "review": "We thought it sounded like a good idea. We have a Netflix subscription and were able to hook it up and watch a couple of movies but we had a hard time adjusting the sound quality. During normal dialog, you could barely make out what they were saying, then an action scene would suddenly arise with music so loud you have to turn down the volume. We could never get adjusted. We were too frustrated to enjoy the movies. We don't have that problem watching TV movies normally. Also, we noticed on several occasions that the device had changed the settings on our TV, so we had to get out a different remote that came with the TV and re-adjust things back to the way we liked. I unplugged the device yesterday and filed it away under M for mistakes.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Its perfect! Recomended 100%Love it!Really usefull for people who watch a lot tv/videos/series/internet full users!My best decision.", "verified": true, "helpfulness": "0/0", "author": "Florencia Koch"}, {"rating": 5.0, "review": "I'm definitely getting another.  Being able to get streaming content from my google chrome browser is EXCELLENT.Setting this up only took a few minutes and is very easy.  The directions are clear and easy to understand.", "verified": true, "helpfulness": "0/0", "author": "dwcfastrice"}, {"rating": 5.0, "review": "Very nice device. Will give it as a Christmas present. It is a nice addition to a non-smart TV, expanding its viewing capacity.", "verified": true, "helpfulness": "0/0", "author": "CPB \"Retired Army\""}, {"rating": 3.0, "review": "Works with limited apps. It would be nice if the device worked for more apps. Also I have noticed lag in video output", "verified": true, "helpfulness": "0/0", "author": "Uma Maheswar Kalluru \"umajava\""}]