[{"rating": 3.0, "review": "Great, fast, streaming box, however, the lack of some apps, non bigger than HBO GO, makes this player inferior.", "verified": true, "helpfulness": "0/6", "author": "Fernando Alvarez Jr"}, {"rating": 5.0, "review": "I was so excited about all the options the Amazon Fire TV has to offer. I am not sure if you want to get rid of regular TV but if you do, you surely will be satisfied.", "verified": true, "helpfulness": "0/0", "author": "Clifton"}, {"rating": 5.0, "review": "Love it. Simple set up,  I am an amazon prime member so have been using it for movies, tv shows.....endless amount of choices.  Ordered the new kindle fire hdx; can't wait to get it to see how it will work with fire tv.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Very well made device however I found the wireless internet reception poor.  If the internet reception were better I would have given it five stars.  Of course if you plug it into the router/modem I'm sure it works fine.  I've got it sitting right next to my Apple TV.  The Amazon Fire TV doesn't receive the wireless signal near as well.", "verified": true, "helpfulness": "0/7", "author": "Paul B. Phillippe"}, {"rating": 5.0, "review": "love this so much", "verified": true, "helpfulness": "0/0", "author": "tomatogirl99 \"Katie\""}, {"rating": 3.0, "review": "I like the performance on it but it has VERY LITTLE storage for apps and games. Amazon we need usb access to be able to use usb storage for games.", "verified": true, "helpfulness": "1/4", "author": "John"}, {"rating": 5.0, "review": "This is my first streaming device.  I am an Apple bigot (iPhone, iPads, iMac) so this was a hard choice to go outside the Apple product line.  With that said I am extremely happy with the Fire TV.  It is easy to set up, operationally very fast (no or little wait times) and voice search is incredible (although limited in cross app searches - but getting better).  It covers my main subscriptions of Netflix, Hulu Plus, Amazon Prime and Pandora (with a little HBO thrown in) and there are enough other steaming apps to keep you busy.  I am not a gamer, but bought the game controller as well and it works very well.  So far I have set up 6 games and they all play and respond very well (even the 1st party shooters).  The controller is solid and works well.  The Fire TV controller is a solid device, responsive and feels great in your hand.  The base unit is very well made and feels solid, with a great form factor.As an Apple user my big fear was not having Airplay to stream photos, videos and music from my iPhone, iPad and iMac to my TV.  Another issue I had is that my wife uses the Samsung S4 and also has a bunch of photos she takes that I would like to integrate as well (Apple doesn't do that).  I also had another problem, my iMac (2009 build) did not support Airplay, so the trick was how to get this all working with my Fire TV.....to my surprise Amazon has solved that problem.  Here is what I did:I solved my problem by installing the following:1) Installed two applications on the Fire TV - AirPinCast and the Plex Media app.  (total of about $10 in software). The AirPinCast app allows for the existing Airplay to work on the iPhone and iPad to the Fire TV2) installed AirPinCast on my wife's Samsung Phone (free) provides \"Airplay\" like functionality from the Samsung phone to the Fire TV)3) Installed the Plex Media Server software on my iMac (free) - this connected to iTunes, videos and movies (content can be anywhere on the iMac..not just in iTunes).  I have about 10,000 photos (50GB) and 340GB of music in a common Plex server...that can be streamed to the Fire TV. (remember, my iMac is too old to support Airplay)4) Installed Amazon's Cloud Drive app on my iPhone, iPad and Samsung phone (this runs in the background)  - this app automatically saves photos to the Amazon cloud drive and uniquely merges photo's from my iPhone and my wife's Samsung phone to a common server.  Currently we have about 2,000 photos on the Amazon Cloud Drive (I keep the last 12 months of photos uploaded from my iPhone) and it automatically uploads any new pictures either my wife or I take regardless of device type (Apple doesn't do that).  The cool thing is that the upload is very fast and almost instant, meaning I can use the Fire TV to show any photos taken within about a minute of taking the photo (or I can do an Airplay as well).  Also any photos on the Cloud Drive are used as screen savers on the Fire TV...a very cool feature you set up in the Settings panel.So with my Fire TV I can stream content from my iMac, iPhone, iPad and Samsung phone.  It all works very well together and has solved the problem of integrating an older iMac as well asmy wife's Android phone.The Fire TV is a very good streaming device that will only get better with future releases.  My biggest want is to have voice search across all supported apps on the Fire TV...that would be a great competitive advantage as well as to grow the selection of media available (like Roku).", "verified": true, "helpfulness": "8/8", "author": "Keith Phillips"}, {"rating": 3.0, "review": "I was offered a free 30 trial, with the option of shipping this back for free. While the product is great, I was charged to ship this back.", "verified": true, "helpfulness": "0/6", "author": "Abe Feder"}, {"rating": 3.0, "review": "I was very disappointed in the amount of content.  Roku offers do much more.  Very easy to set up and operate.  I like the voice search.  If they add more content I think it will be good.", "verified": true, "helpfulness": "0/2", "author": "Diane Bechteler"}, {"rating": 5.0, "review": "Works magnificently, I recommend It, great addition to my other Amazon related products.", "verified": true, "helpfulness": "0/0", "author": "Richard Fowler"}]