[{"rating": 3.0, "review": "I enjoy the Chromecast but.....I did not know it ONLY works with a FEW apps. I am sure it will gain more support but until then I will stay with my Roku 2 XS", "verified": true, "helpfulness": "0/0", "author": "William Melton"}, {"rating": 4.0, "review": "I have a Roku and I have to say I like it better but this is great for watching Netflix if you are traveling. No watching Amazon Instant on this device.", "verified": true, "helpfulness": "0/0", "author": "W. Land"}, {"rating": 5.0, "review": "My husband and I live in a 1 bedroom apartment, and we have 2 Chromecasts.  They are just too stinkin convenient!  We have one in the bedroom and one in the living room.  This has helped us love cleaning day!  We each take our device and can jam out to our own music, and meet in the middle :)", "verified": true, "helpfulness": "0/0", "author": "Breanne"}, {"rating": 5.0, "review": "My honest review, I bought this device when it was first announced. The first thing I tested was casting my chrome tab. Watching hulu is perfect. Some lags but I feel that is due to my wireless network.Fast forward to today, I use it for youtube, pandora, and hulu has support now. Thing works flawlessly. We need support for more apps!", "verified": true, "helpfulness": "0/0", "author": "+heyyyouuu"}, {"rating": 4.0, "review": "Since plugging this in to our TV, life has been more fun. I especially love playing Pandora on it! Hope it gets upgraded with other services and technology soon.", "verified": true, "helpfulness": "0/0", "author": "fafiha"}, {"rating": 5.0, "review": "Chromecast works really well and once connected to your flatscreen, you can use your cell or tablet to watch shows, youtube, etc. as easily as watching on your cell or tablet. I love the technology and for $35, you cannot beat that...  A good buy and kids will enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Den Andy"}, {"rating": 5.0, "review": "Very cool product, it is very easy to set up. If you can not set up this easy product then watch some videos on how, I made a video on how to install it, type in \"daveyburr chromecast setup\" in you tube and you'll see it. It lets your steam things from your phone, computer, and tablets. Even when they are on sleep mode. It plugs into an HDMI cable and It has a connector that powers it through a usb on your tv or you have the option to put it into an outlet.", "verified": false, "helpfulness": "0/0", "author": "Davey"}, {"rating": 5.0, "review": "Love this. It's easy to set up and works great.  We have used it with smart phone tablets and lap tops without a problem.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We've had chromecast for over 2 months now, it's been fantastic.Loved it because I could stream Youtube videos from my phone to the TV (even queue up a bunch at a time and they play through automatically, same with Plex (for Plexpass Users) and Netflix (Sadly the Netflix app isn't the best it could be, I can't just queue up a whole season of a show, or anything for that matter). Set-Up was really simple.We have a Roku but since joining Plexpass we now no longer need the Roku at all. Chromecast is less money for even better functionality.", "verified": true, "helpfulness": "0/0", "author": "Mariel A."}, {"rating": 5.0, "review": "It speaks for itself,  works well and Google tech support is able to resolve any issues. This was a good buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]