[{"rating": 3.0, "review": "Its ok, I thought when it came out they would expand the things you could use it for, but not much more now then when it first came out. If Google expands it then I would rate it higher. Hopefully Google is not spying on us with this thing too!", "verified": true, "helpfulness": "0/0", "author": "Valkyrie Rider \"Dave\""}, {"rating": 5.0, "review": "My brother has this elaborate video system at his house that has a huge remote, takes him 5 min to figure out what he wants to do and the system is very slow. I would assume it cost him thousands of dollars. As long as you use chrome, the chromecast does all the same things for $35. LOL.If you use chrome on your phone or your laptop/desktop and have an extra HTMI port open on your TV, this is a must have. Don't think about it buy it. So simple to use and so simple to set up! I gave them away as gifts for xmass and everyone is raving about how awesome they are.", "verified": true, "helpfulness": "0/0", "author": "KetelOne"}, {"rating": 5.0, "review": "Works great. Connects to my home wireless network and can cast from my PC or android phone to my Theater projector.  I only wish there were more apps available that can \"cast\".  Better yet a way to cast your entire screen like Apple AirPlay.  I hear that is coming, but haven't seen it yet...", "verified": true, "helpfulness": "0/0", "author": "Eric W."}, {"rating": 5.0, "review": "Chromecast is easy to set up and does everything it is supposed to do.  Works great going from the Ipad to the TV", "verified": true, "helpfulness": "0/0", "author": "L. Kelly"}, {"rating": 3.0, "review": "Its good for putting your computer screen on the TV but movies seem to lag. As far as the aps, they work good but you can get the same aps on most electronics(tv's,DVD's,Roku,ect.) and these other products have more to choose from. Kinda late into the game of streaming media players. Would advise other products unless want to use Google and Android.", "verified": true, "helpfulness": "0/0", "author": "Roger Sullivan"}, {"rating": 5.0, "review": "It works great. Everything they said it was.nice to have my computer back to being wireless and not setting b y the tv connected.", "verified": true, "helpfulness": "0/0", "author": "magoo"}, {"rating": 5.0, "review": "I have purchased several chromecast and this really is an awesome deal for just $30-35.  I love being able to control it from my phone and not having to go through some of the clunky UI's on other streamers.  Its as simple as loading up the app on your phone and pressing the chromecast button.  Its awesome and works well.", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 5.0, "review": "I have always had cable.. But I am about to drop it.  This device is awesome.  You must have a good internet connection.  I have 7mbps download at home and stream content from my computer to my living room TV and the google Chromecast.  What can I say, I am streaming in High Definition and the picture is just as good as cable.  I can stream form Netflix, Amazon Prime, or form a networks website.  The CW is my favorite channel and I cant stream all my favorite shows to my TV.  Now that I am unemployed and have to cut back (a lot) ... I can still keep my entertainment and lose the big bill.  I highly recommend this device... just remember.  You must have a good, reliable internet connection and Router.  Spend the money with your cable company on the internet service and drop the cable TV portion.", "verified": true, "helpfulness": "0/0", "author": "\"By_George\""}, {"rating": 4.0, "review": "The product was ordered to be used for an upcoming trip.  By the time I received it I was already on my trip.  I was somewhat disappointed in the time it to receive this product.", "verified": true, "helpfulness": "0/0", "author": "Larry J. Presnall"}, {"rating": 5.0, "review": "This item is pretty neat. It works treat when using an IPhone but kind of intermittent when using a laptop. I would buy this product again.", "verified": true, "helpfulness": "0/0", "author": "michael Kushner"}]