[{"rating": 5.0, "review": "Very satisfied", "verified": true, "helpfulness": "0/0", "author": "Enrique Rodriguez"}, {"rating": 5.0, "review": "Everyone should have at least one of these, if you like to watch Netflix or YouTube. The video quality is better than streaming through a Playstation 3.", "verified": true, "helpfulness": "0/0", "author": "Shawn R \"ruby\""}, {"rating": 1.0, "review": "NO TECH HELP NUMBER. If you have a glitch with set up and you can't find your exact specific issue mentioned in a user blog or one of the standard FAQs then you are screwed and you just bought a $35 bobble for your key ring. Useless if you can't complete the set up. They have your money, can't be bothered with your petty problems.", "verified": false, "helpfulness": "0/0", "author": "dzip"}, {"rating": 1.0, "review": "It's advertised as the easiest way to watch online content but it's not. Apple products work out of the box the first time. This thing took several hours to configure..then you have to download new apps for it to work. Better stand right next to your wifi connection or it won't find your internet. Sending Back!!.. Just gonna stick with Apple products. Google PC stuff is always a hassle", "verified": true, "helpfulness": "0/0", "author": "George H."}, {"rating": 5.0, "review": "i used it on my living room, and make its work good", "verified": true, "helpfulness": "0/0", "author": "Gabriel D. Vasquez N \"Gabriel D Vasquez N\""}, {"rating": 5.0, "review": "Works well but would be great if Amazon Prime Video's would come to generic Android and use Chromecast. Also not as fast as latest RoKu's but much more portable. Grandchildren like casting Youtube videos to TV from their iPhones and Android devices.", "verified": true, "helpfulness": "0/0", "author": "Keith Karnafel"}, {"rating": 4.0, "review": "Works on windows 7 , Blackberry Z30 Phone. Cast to any tv around my house.Set up was easy, updates took a couple minute.Download the necessary extension on laptop and your ready to watch you-tube videos and other support video programs.or their is always the cheaper option by buying a HDMI cable and connect to laptop but always connected by a wire.", "verified": true, "helpfulness": "0/0", "author": "Andy L"}, {"rating": 5.0, "review": "Does what people say it does. Love being able to control my tv from my Galaxy Tab.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Disappointed.  It only seems to work on Youtube.  Will not stream TV at my download speed of 3 Mbps.  Nowhere in the online info is this mentioned.  I would not have wasted my money if I had known I needed 6-7 Mbps.", "verified": true, "helpfulness": "0/0", "author": "SL"}, {"rating": 1.0, "review": "Plugged it in, took ages and had to reset several times before anything even showed up on my TV.HDMI ports are fine because I tried them with other devices. Finally got this thing working but by the time I got in from work again, I couldn't get anything showing on the screen. Tried to go through setup again but still nothing showing on my screen no matter how many times I reset it. More hassle than it's worth. Awful.", "verified": false, "helpfulness": "1/1", "author": "pd293"}]