[{"rating": 5.0, "review": "Easy setup and the connections are stable.  Full screen sharing needs higher version of Android OS.  Extensively used for YouTube video playing and Smugmug photo showing from smart phone apps.  The “connect” from smart phone actually triggers powering on TV, which I thought is pretty convenient.", "verified": true, "helpfulness": "0/0", "author": "yunhai7y"}, {"rating": 5.0, "review": "I use it often, so easy.", "verified": true, "helpfulness": "0/1", "author": "Aetoss"}, {"rating": 5.0, "review": "This is a no-brainer to stream computer to TV.", "verified": true, "helpfulness": "0/0", "author": "PJ"}, {"rating": 5.0, "review": "I love the Chromecast.  I can stream just about anything to my TV from my android tablet or my windows 7 PC.  not a lot of options for OTHER services.  I also have a SONY Media Player, and on that i can stream netflix, huku, pandora, Amazon Prime and a whole bunch more.  The Chromesast isnt like that.  it is the STREAMER part of things - doesnt do anything with content you dont send it from another device.  It opens up your other devices to stream to your TV, but doesnt let you hit content by itself like a SONY or apple TV, etc.", "verified": true, "helpfulness": "1/1", "author": "Darkhorse85"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "jackie johnson"}, {"rating": 5.0, "review": "Reliable and fast. I connect to Netflix through Chromecast because it has no buffering issues. Connecting to Netflix via my Sony Blueray DVD player, I experienced serious buffering issues.", "verified": true, "helpfulness": "1/1", "author": "Bryce Letterman"}, {"rating": 5.0, "review": "Amazing piece of gear,  so much fun and easy to setup.And in this price it is a steal.The best part is the fact that every day new apps coming out.So much possibilities.", "verified": true, "helpfulness": "0/0", "author": "yaniv yadin"}, {"rating": 5.0, "review": "loved it and will recommend to friends.", "verified": true, "helpfulness": "0/0", "author": "JOHN FOSTER"}, {"rating": 5.0, "review": "This is the second time I have ordered this as a gift.  Came in quickly and in perfect condition both times.  I would order again.  Easy to use and perfect for yourself or as a gift.", "verified": true, "helpfulness": "0/0", "author": "Callie"}, {"rating": 3.0, "review": "Does not have amazon prime video. Keeps losing connectivity with the phone, so you need to keep installing and synchronizing.", "verified": true, "helpfulness": "0/0", "author": "dan"}]