[{"rating": 1.0, "review": "I was so excited to get this as I heard nothing but good news about. However, as easy as set up seems to be, it shows up with an error message \" Chromcast is connected to WIFI, but has no internet access. I have been fumbling with it for hours in yet I still get the same message on my TV screen. If I am unable to get it to work I will send it back, and find something else that will work.", "verified": false, "helpfulness": "0/2", "author": "Mathew"}, {"rating": 5.0, "review": "Only addition I think would be fantastic would be ability to play local media", "verified": true, "helpfulness": "0/0", "author": "SK97531"}, {"rating": 4.0, "review": "Really like the Chromecast. Really wish the Amazon Video app was compatible.", "verified": true, "helpfulness": "0/0", "author": "Scott Abbott"}, {"rating": 4.0, "review": "Great product when you have a cell phone to stream video. The Kindle doesn't seem to work with it though.", "verified": true, "helpfulness": "0/0", "author": "Air Force Vet \"Silenced\""}, {"rating": 4.0, "review": "I bought this for my GF she says \" 80% of the time is awesome but 20% of the time there are some kinks that she has to resolve then it works fine.\"", "verified": true, "helpfulness": "0/1", "author": "Craig C"}, {"rating": 5.0, "review": "Existing within the Google ecosystem, this is an especially excellent product for getting content onto your TV.Leveraging the Plex Media Server, companion application and the Chromecast has made consuming my media collection a simple, fast and seamless experience.Pros: - Ability to cast whatever is being consumed on your laptop [assuming you are using chrome] to your TV - Ability to cast whatever is being displayed on your phone/tablet [assuming you are using Android] to your TV - Clean interface and pleasing idle desktop displayCons: - Not really a con but a design feature to be aware of: without a phone, laptop or tablet the device cannot be controlled - USB power supply cord plugs into the end of the dongle making the device, functionally, longer than it needs to be - Lack of Ethernet port means that you might experience some chop while playing larger items from your media collection", "verified": true, "helpfulness": "1/1", "author": "Zenzo Wysocki"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "elmer"}, {"rating": 5.0, "review": "lo0ve love love ;ove this thing!", "verified": true, "helpfulness": "0/0", "author": "Pebby N. Distefano"}, {"rating": 1.0, "review": "does not work.", "verified": false, "helpfulness": "0/5", "author": "Julius"}, {"rating": 5.0, "review": "If you have a smart phone, a TV, and an internet connection buy this. It is great and if you have any issues the google customer service people are extremely helpful.", "verified": true, "helpfulness": "2/4", "author": "William D Bender"}]