[{"rating": 5.0, "review": "Received  this as a gift.  Easy to set up. Does everything I expected it to.", "verified": true, "helpfulness": "0/0", "author": "Jinky"}, {"rating": 5.0, "review": "Great streaming device!Super fast and easy to use and set up.Would recommend it for sure.I'm glad I cut the satalite and now just stream and an antena for local channels.", "verified": true, "helpfulness": "0/0", "author": "E. lydon"}, {"rating": 3.0, "review": "Would have expected more hate the fact that I can't connect my iPhone to it and I have to buy an app if I want to it's doesn't work via Bluetooth either but still a good product over all especially if you plan on having Amazon prime", "verified": true, "helpfulness": "0/0", "author": "Manuel Zameza"}, {"rating": 5.0, "review": "Love the built in microphone that let's me search amazon instant video.", "verified": true, "helpfulness": "0/0", "author": "lester"}, {"rating": 5.0, "review": "I've been using Amazon Fire TV at our beach cabin for a month or so, and we are very pleased with the system.  Because we use our cabin on occasional weekends, we didn't want full-blown cable TV, but wanted more than just playing Blu-ray movies or listening to the radio.  This is the perfect all-in-one entertainment package.  It's simple to set up, activate and use.  As Prime members, we can watch practically any movie we want at no charge, listen to our Pandora stations, or use the gaming features.  Amazon TV was recommended to us, and we're very glad we finally did it!", "verified": true, "helpfulness": "0/0", "author": "Streetdog"}, {"rating": 5.0, "review": "Exceeded my expectations!!! I use it for Amazon prime and slingTV. Works great.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Arredondo"}, {"rating": 3.0, "review": "Amazon Fire TV seems to work great but it does not interact well with Comcast at all!!!  We can't get HBO Go, History channel, etc  None of these apps work!  I am very frustrated!!", "verified": true, "helpfulness": "0/3", "author": "Jocelyn McIntire"}, {"rating": 5.0, "review": "After trying two Fire Sticks and being disappointed we decided to try the Amazon Fire TV box and it works GREAT. We love it. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Lynn Trousdale"}, {"rating": 4.0, "review": "Probably one of the best units on the market right now.  Roku is good but this is a bit better since you can load Kodi on it as well.  fast and plenty of storage.", "verified": true, "helpfulness": "0/0", "author": "Bruce \"Bruce\""}, {"rating": 5.0, "review": "Luv it", "verified": true, "helpfulness": "0/0", "author": "Dave R."}]