[{"rating": 5.0, "review": "No more looking on the laptop at movies.", "verified": true, "helpfulness": "1/1", "author": "Kim Mealing"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "1/1", "author": "oleg"}, {"rating": 5.0, "review": "....it's worth it", "verified": true, "helpfulness": "1/1", "author": "N.Rubio"}, {"rating": 4.0, "review": "Is what it says it is. Only wish it would work with ALL the apps out there... I know picky, but still. Overall, easy to install, easy to work with. Does the exact job I need.", "verified": true, "helpfulness": "1/1", "author": "Mark Esch"}, {"rating": 1.0, "review": "so i get my chrome cast today and im excited to try it out after waiting.. and i plug it in to my TV and i do everything it asks of me but then, it doesnt work. i read the  instructions again. it says your tv has to show the code on the right hand corner of the screen (just like the one given on the instructions) to keep going with the setup. i try it on another tv. the code shows but the WIFI (that has strong signal) does not connect to the chrome. -_______-  problems after problems. then the app that is supposed to help you control the tv and chrome kept crashing and having problems finding the chromecast. im returning this today. spent a good 3 hours trying to fix the problem but i cant anymore", "verified": true, "helpfulness": "1/1", "author": "geovanna"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "map"}, {"rating": 5.0, "review": "Even though many of the apps are beta for Chomecast, this little device is really versatile.", "verified": true, "helpfulness": "1/1", "author": "CletoWyo"}, {"rating": 4.0, "review": "Can't beat it for the price. I used to have problems with my Android phone (Moto Razr), but my iPhone works seamlessly. I skip casting webpages from my computer. That function is still very slow and not very high resolution in my opinion. For Hulu, Netflix, YouTube, this product is fantastic. And the fact that it is playing through the Chromecast instead of your phone saves a ton of battery life. I'd definitely recommend this.", "verified": true, "helpfulness": "2/2", "author": "Cody \"cody_mac\""}, {"rating": 5.0, "review": "We don't have cable, but we do have amazing internet. The Chromecast allowed my roommates and I to comfortably view films and other content as a group. The Chromecast apps store on android has a lot of neat stuff, but nothing truly outstanding.", "verified": true, "helpfulness": "0/0", "author": "Noah Matlock"}, {"rating": 5.0, "review": "Please w/ the product and purchase.", "verified": true, "helpfulness": "0/0", "author": "Kailash Gangar"}]