[{"rating": 5.0, "review": "I LOVE this device! Its very easy to send Netflix and YouTube from my phone to the Chromecast. If one person casted a video from their phone, you can pause and stop it from yours! Both YouTube and Netflix stream in a very high quality even though I have a slow internet connection (Comcast). For $35 the value is incredible!", "verified": true, "helpfulness": "0/0", "author": "Lenny"}, {"rating": 1.0, "review": "Very disappointed with this unit.  It doesn't come with a remote like all of the Roku units.  The picture quality is decent  but trying to figure out the controls is confusing.  These systems are the wave of the future.", "verified": true, "helpfulness": "0/2", "author": "John Howard \"John E. Howard\""}, {"rating": 5.0, "review": "Easy to install and operate. Great access to movie and television options. Highly recommended. Easier to use than Apple TV", "verified": true, "helpfulness": "0/0", "author": "ballroller"}, {"rating": 5.0, "review": "This is fairly easy to do and we now have been watching some movies, but less time.  We had our son help get us up and running.So far so good.", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 4.0, "review": "Wish there was an Amazon Prime app.  I'm mostly using it for Pandora and YouTube right now (because I'm lazy).", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Very easy to 'install', idiot proof.  Works well.  I was up and running within minutes watching youtube and Netflix videos on my TV.", "verified": true, "helpfulness": "0/0", "author": "NYreviewer"}, {"rating": 5.0, "review": "Absolutely best product  ever, the wireless range is fantastic, no buffering  and streaming between 2 separate TV's is perfect. My second TV is on the 3rd floor!", "verified": true, "helpfulness": "0/0", "author": "Jessica Q \"Jessica\""}, {"rating": 5.0, "review": "Don't bother buying a TV with built-in web connectivity.  Their firmware will be out of date soon and you will have paid more for the web interface than for one of these.  The WiFi signal capture is better than the one in most laptops.", "verified": true, "helpfulness": "0/0", "author": "dvfagan"}, {"rating": 5.0, "review": "A little quirky the first time couple of times I tried to use it, but now works great and anyone who is in the house can use their device.", "verified": true, "helpfulness": "0/0", "author": "GMac \"Expat\""}, {"rating": 5.0, "review": "I use Chromecast everyday! Makes watching netflix so easy! Very portable and easy setup. I bought one for my whole family! Great product!", "verified": true, "helpfulness": "1/1", "author": "Chad"}]