[{"rating": 5.0, "review": "Great alternative to the other add ons out there. I love being able to watch movies and shows from my phone on the TV.", "verified": true, "helpfulness": "0/0", "author": "nolimit06"}, {"rating": 5.0, "review": "Streams netflix movies from my nexus 4 to my HDTV flawlessly.However had some buffering issues while streaming videos from chrome browser( on mac air) to HDTV in some-cases .", "verified": true, "helpfulness": "0/0", "author": "vishal shukla"}, {"rating": 4.0, "review": "I love this product, just hope Google keeps updating its sources. Very limited video suppliers at this time. They say they are working on it.", "verified": true, "helpfulness": "0/0", "author": "macbosch"}, {"rating": 5.0, "review": "What in the world did we ever do without the chromecast?  The best product purchase of my year. Which included a Nexus 7 and 5.  I bought 2 and highly recommend you do the same.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "We have 5 Chromecasts in our home and we use them ALL the time. You can't beat the value and quality.", "verified": true, "helpfulness": "0/0", "author": "JAllen"}, {"rating": 1.0, "review": "I bought Chromecast for the ability to cast web browser video content onto a TV and not to use subscription services like Netflix or Youtube (which works fine). The result is totally unusable as the video and audio are not in Sync, the system often freezes and of late one can not expand t full screen view and the mouse arrow has disppeared. I wanted to use it for such things as casting BBC iplayer and clearly the device, at least the one I have is useless. Back to cables and the Chromecast goes to the trash.", "verified": false, "helpfulness": "1/3", "author": "Amazon Customer \"Ariodante\""}, {"rating": 1.0, "review": "This item is not worth even the $35 cost.  Very limited use about all you can use it for are Netflix and YouTube", "verified": true, "helpfulness": "0/3", "author": "GLENDA E. CLASQUIN"}, {"rating": 1.0, "review": "\"How bad could it be for $35?\" I asked myself before ordering the Chromecast. The answer: pretty much worthless. I live in a small house (less than 900 square feet). The wireless router is 22 feet from the TV. The Samsung laptop is 8 feet from the TV. Yet the Chromecast regularly loses contact with the signal. After dozens of tries, I'm simply not able to stream in its entirety an hour-length TV show from sites such as ABC.com or CBS.com. Similarly, I've never been able to view an entire Netflix movie without losing the connection. When the connection is there, the video is either extremely pixelated, or the video is jump, with multi-second pauses between screen refreshes.", "verified": true, "helpfulness": "0/2", "author": "RussK"}, {"rating": 3.0, "review": "Works as great as it promises. Easy to set up, easy to use, very simple. The only problem is the lack of apps to use. In Brazil you can only use Netflix and Youtube.", "verified": true, "helpfulness": "0/0", "author": "Pedro Galoppini"}, {"rating": 3.0, "review": "An innovative product. Price is ok. Strictly a novelty for geek.Currently u can't tweak the software, so the most useful app is the youtube app which work flawlessly.If you are using ios devices, the Apple tv is more than enough.This is more of a hobbyist product by Google.", "verified": true, "helpfulness": "0/1", "author": "Shavy Goh"}]