[{"rating": 5.0, "review": "My husband loves this", "verified": true, "helpfulness": "0/1", "author": "Susu"}, {"rating": 5.0, "review": "This is awesome!!", "verified": true, "helpfulness": "0/1", "author": "Janie"}, {"rating": 2.0, "review": "It would only work with an Ethernet wire.  I tried all the suggestions listed  but could not get it to recognize my modem for the Wi-Fi use.  I returned it for a refund.", "verified": true, "helpfulness": "2/3", "author": "Janie D"}, {"rating": 4.0, "review": "good/has some probs", "verified": true, "helpfulness": "0/5", "author": "Erik"}, {"rating": 4.0, "review": "It is what is advertised.", "verified": true, "helpfulness": "0/4", "author": "Allen Eichacker"}, {"rating": 5.0, "review": "I am an Apple nut-Apple TV, iPhone, iPad, MAC, MacBook Pro. BUT, I must say that I like my new Amazon Fire TV BETTER than our Apple TV. Overall, a better product!!", "verified": true, "helpfulness": "1/2", "author": "B. Nunes"}, {"rating": 2.0, "review": "Maybe I'm repeating myself but after using it a while, this is how I feel:I wish the Amazon Fire TV interface was a little more \"clean/neat\" for example, the watchlist section it be better if it had 2 tabs one for movies and one for TV, becaus if we have so many things in our list carrusel scrolling makes you dissy... Yes we have voice search but some times you add things and forget, so looking thru your watchlist is the only way... If it displayed the titles in our watchlist as mosaic it be more neat and easier to see what he have in our list.The Home sections should be customizable. We should be able to decide which \"favorite\" apps have to always be there in the home section. Not give us just randome content... That suxs!! I prefer if it displayed the apps in list or Mosaic but only the ones we always want there, and maybe recently used section can stay. Also when We go to apps and/or games, again the carrousel view is fine but once you click more, the carrusel suxs, is not a good way to search content when is too much content becaus it takes longer, it makes you dissy if you scroll fast, and the big icon/pictures sometimes are so unappealing. It's a good solid device, fast and all BUT there biggest problem is user experience!! THEY NEED SOMEONE A GOOD DESIGNER TO DO SOME MODIFICATIONS TO THEIR INTERFACE, Even searching their app/video store is very unappealing, their website, heck their Amazon iOS apps for video/music are much more good looking, than their own Fire TV.Come On Amazon!-----------------It's a good device, it's able to compete with the other similar devices. I own an Apple TV and I love it, and now I got this one mainly because I have prime.Things that need to improve:1. The watchlist would be better if it had a decision for TV and Movies and maybe more the just 1 endless long strip showing us what we have added. It simply doesn't look good. It looks better how it is in the iOS devices and even on the kindle.  It's better to display them in several rows and/or columns!!2.Home section would be better if we could customize what we want to see there. We already have a list on the left for everything so I don't need to see on \"home\" the top games, the feature movies, feature apps, the HBO collection on prime I mean all those options we already have them on the left menu in movies, tv, apps, etc. why just not show us our Apps, maybe recent , or let us choose the sections we think we need to see in home for quick access?3.Prime Video section, for example I like that there are different options and each option shows us a little preview of what it contains, but again once we click on that option for example the top movies on prime, why show us the long strip of titles?!?! Why not display the titles in that section in several rows instead of an endless one. It's so unattractive, and hard to see many titles displayed at a time. And that's goes for everything, each section of movies, tv apps, games, etc... Display the items in many rows not an endless 1 long row.4. About the apps and games sections. To be honest seeing the huge app icons looks really really really bad, I think maybe displaying them in lists or several rows and columns, not too big will be much better for sure.5. The photos section, you know on the iPad the cloud app displays the photos so beautifully, across the screen and also on the kindle so why again the long endless one row/strip?!?! I don't understand why can't you display several items to almost fill the screen. I doesn't even make me want to see my photos.Lastly,6. The music section? It been loading my library for a couple of hours now and it still hasn't showed me my music. But now I'm afraid that you will display all my albums again in one long row...I like the device is fast and it has a good display but once you select an option, IT SUXS to have to go thru a carousel basically to see the titles, or apps, or photos in that selected section. Why couldn't you make it more like your amazon apps for other devices like the iOS or your kindles?!? I DONT GET IT... it sometimes looks like it lacks simplicity and organization.I hope you have you designer engineers working on this issues because right now again is a good device hardware wise but not so good software wise. You want to display to us the feature titles and so on, make it prettier like the scrolling big squares at the top when you launch your amazon instant video app for iPad...Hope you guys take into account our reviews, once I see an update I might give it the 5 stars for now.Good hardware, not so good looking display of the interface.", "verified": true, "helpfulness": "2/3", "author": "Stefanie Rizzi \"stefanieRibarra\""}, {"rating": 3.0, "review": "As a Prime subscriber, I bought this for my wife for her birthday. There are so many things to like about it if you are Prime already. I am posting this review without going in to all of the things we like and only focus on the one thing that we are not pleased with. Honestly, if it were not for this, I would probably rate this 4-5 stars. This is also focused on those of us that live overseas and use a VPN (limited audience, I know). If you have a slower internet connection - and VPN's slow it down - then you will notice that the cache does not do what it advertises. If we watch over computer or xbox one, then we can see the \"bar\" and the fact that the cache is loading ahead of the video we are watching. But while on Fire TV, we don't see this happening, and when internet is slower, we often get the yellow circle spinning in the middle of the screen over and over again. Very irritating. I think that most folks stateside should not have this issue?", "verified": true, "helpfulness": "0/0", "author": "J. Hunt"}, {"rating": 5.0, "review": "Amazon Fire TV is wonderful,but I am wondering if the Remote will hold up with constant usage.some times it does not (the light) turn off.I am glad that I have insurance on it.", "verified": true, "helpfulness": "1/1", "author": "MIG"}, {"rating": 1.0, "review": "I read all of the posted literature on the Fire Tv. One small sentence mentions some movies for $2.99 and up. Everything else mentions Free Prime everything, Prime tv, Prime movies, Prime kids content. I got the unit and bought the unincluded hdmi cable. Install was easy. Then I learned that almost everything is for rental or full price purchase. This is not a good deal for me. I want my money back!", "verified": true, "helpfulness": "5/16", "author": "Bob Marshall"}]