[{"rating": 1.0, "review": "Just got my Amazon Fire today.  After the initial update and the annoying, mandatory, product  introduction I selected a generic movie, Spaceballs, to test it out.  I have verizon fios quantum 150/75 service.  The movie is continuously pausing with the circular \"updating\" icon.  Can not watch 1 minute continuously without it happening.  HORRIBLE INTRODUCTION AMAZON!  If you want to play with the big boys you need to come in brining it, instead this shows it was rushed to get it out there vs being ready for prime time.  BIG TIME DISAPPOINTMENT!", "verified": true, "helpfulness": "6/29", "author": "ST"}, {"rating": 5.0, "review": "Following the quick start instructions exactly, I powered up the box before installing the supplied AAA batteries in the remote.  By then the box was flashing orange, and the remote would not pair with the box.  The screen instructions for non-pairing had no effect.  I changed the Chinese batteries for Duracell AAA batteries -- did not help.  I finally cycled the power to the box, i.e., rebooted the box.  The box and the remote paired instantly, and everything worked perfectly thereafter.  We are very pleased with unit.Suggest the quick start instructions call for installation of  the remote batteries before powering up the box.", "verified": true, "helpfulness": "4/6", "author": "R. E. Kendall"}, {"rating": 5.0, "review": "I do not write many reviews, but I have to say this is beautiful. I do not have or watch regular television. So this makes getting what I want to watch so much easier. This gives me so many option, so many ways to watch. I have only had it a week, if things change I will be back to let you know.April 9, 2014", "verified": true, "helpfulness": "2/2", "author": "Tony R. Jackson \"Tony R Jackson\""}, {"rating": 5.0, "review": "Does the world really need another streaming box? The answer is a resounding YES!Having just purchased the Amazon Fire TV and having tried many other streaming devices — including the Roku, Wii, XBOX, Apple TV, Chromecast, TiVo, Slingbox, Belkin TV, and smart TVs — I can say that the Fire TV is a must have for any value-oriented TV watcher.To understand why, it’s first important to remember what the Fire TV and other streaming devices are competing against.The simplicity of watching TV is has helped to make it a habit in most homes — turn on the TV and video begins playing right away. No need to change inputs, no need to wait for the TV to load (usually) and generally no network latency issues. Occasionally, you have to suffer through a grid to find something to watch, or channel surf using your remote control, but it has been brain-dead simple for many years.  DVR usage has also become more prevalent, and when there is nothing to watch on TV, it’ll just take a few more taps on your remote to start watching your DVR. If there is nothing to watch there, you’ll spend a few more taps yet again to tap into Video on Demand offered by your cable provider. Therein lies the opportunity and challenge — while it’s easy to just turn on something to watch on live TV, it takes a few more brain cells to and some patience to find something to watch on DVR and VOD.Each second (or partial second) waiting for streams to load significantly reduces the consumer’s desire to stream content to their TVs, even if it’s free.  We’re creatures of habit. We’re at home at 8 p.m. wanting to watch a compelling TV show and the extra time it takes to change inputs, wait for the box to turn on, find the show, and then wait for the video stream to see it on TV is frankly too much work for most TV watchers.This is one of the ways that Amazon’s foray into the streaming box market has nailed it for the consumer. Amazon has made streaming significantly easier with an ultrafast box, plus voice search on your remote control.In my tests, the voice search worked really well — even with ambient noise in the background. For On Demand viewing, this is much faster than any current set-up that I have, including my cable set top box, smart TVs and other streaming devices, including Chromecast. Amazon preloads content so that it immediately begins streaming instead of having to wait several seconds to start playing the content. The responsiveness of the box, the voice search, and the no-wait streaming are the best you’ll find out there.Using the Fire TV immediately after opening the box is impressive. I was up and running in less than 5 minutes. No logins required. They already shipped with my Amazon Prime and no setup was required other than wifi. (Yes, I was a little surprised there wasn’t an HDMI cable.) I know cold starts on many of the other boxes were either overwhelmingly long or way too technical for the mass market. Amazon set the bar very high with their cold start.For Amazon Instant Prime subscribers, this was far and away the best way to stream Amazon content to the TV. Unfortunately, the other streaming boxes that stream Amazon Prime require just a few more steps than I’d like to see. I have to find the app, launch it, then wait for the app to load and then select my content and then wait again to start playing.Fire TV is “instant on” to the Amazon Prime Instant Video catalog and with a short voice search, you’re watching content immediately.There are quite a few things that are lacking, but given Amazon’s reputation and business model, I expect that the box will be future-proof for a while with additional software updates. One of the biggest areas where I believe Amazon will innovate is Universal Search. The current search mechanism only searches across Amazon’s library. So, if you search for “Orange is the New Black” you’ll get a bunch of non-sensical titles.I believe that Amazon will extend this to be a truly universal video search, similar to how their e-commerce website treats third-party sellers. If you want to purchase an item on the internet, Amazon’s goal is to get you to always start with Amazon first. If you choose to purchase from a third party, that’s fine as long as you started with them first. This also happens with product reviews: Users may search Amazon first and then choose to buy elsewhere.  By ensuring universal search across all video sources, Amazon will create more utility for users and build the trust necessary to always start with Amazon first. I expect that they will do this soon.The second area for improvement is in apps. Most people don’t know what they want to watch when they sit down to watch TV — the challenge then is that consumers will have to navigate Amazon’s menu using up/down/left/right on the remote to find something to watch or find another video app to open and attempt to find something then.Amazon has launched a companion application on the Kindle Fire, but there is no support for iOS, Android, or Windows yet. The smartphone or tablet is one of the best ways to find content because you can use gestures and navigate quickly while the TV may be tuned to another program. I expect that Amazon will expose their catalog and all the 3rd party catalogs in a companion experience on multiple platforms to make it easier for people to find, discover, and launch programs on the Fire TV.Amazon will turn smartphones and tablets into a software based remote that will allow for voice search, driving users to consume content on the Fire TV. It wouldn’t surprise me if later users could use the soft remote to launch pay TV programming as well. This would deliver a “wow “experience for consumers.The video ecosystem is very confusing for consumers — programming windows, TV Everywhere, On Demand, Streaming, DIAL, Smart TVs, etc. Fire TV is reducing a lot of complexity by making one catalog very user friendly and fast. It’s worth buying just for that reason.However, the future is even brighter for Fire TV as the hardware is designed for next-generation TV experiences (and perhaps to a greater extent, gaming experiences) that will change the way we interact with and consume TV in the future, for the better.", "verified": true, "helpfulness": "2/2", "author": "Andy Liu"}, {"rating": 3.0, "review": "I won't purchase this without access to HBO Go.  All the other units have that option.  I use HBO Go quite a bit and would love to be able to stream it to my TV.  Amazon needs to work this out.", "verified": false, "helpfulness": "2/12", "author": "Musicgal"}, {"rating": 3.0, "review": "First off, the batteries that came with it were dead. Secondly, the system had to update when it first stated up. Thirdly, Amazon Prime has so little free material it's ridiculous. So many popular shows and movies cost to watch it's ridiculous.That all being said, the picture quality is leaps and bounds above the Wii my family was using for Amazon Prime. Having other apps is nice as well, but without more free content Amazon Prime and $99 for this device is rather steep.", "verified": true, "helpfulness": "2/7", "author": "Ambrose Valkore"}, {"rating": 3.0, "review": "I found the Firetv easy to install and use and great for searching with the voice search but I thought more movies would be available for free for prime members that were several months old.  I was surprised that some movies that were 10 years old or older were not free but required a fee to watch them.  All the movies that I wanted to watch were available for $4.99 and many were 6 months old or older.  I guess I will continue to use Redbox to see current movies for $1.30.  I hope Amazon will offer more current movies for less money in the future.", "verified": true, "helpfulness": "4/8", "author": "robert kost"}, {"rating": 1.0, "review": "I wanted the Fire for only one reason - to use at the hotel when I travel every week. As everyone knows hotel WIFI requires you to open their screen and login as a guest or whatever. When you hook up the Fire to their TV there is no capability to login. It tries to go directly to Amazon.com which of course you can not because you have not logged in yet. A complete disappointment.", "verified": true, "helpfulness": "2/20", "author": "DCB"}, {"rating": 5.0, "review": "Love It! i had absolutely no problem setting it up or with the initial download. videos stream immediately and have no lad issues at all with streaming. it is super tiny which is great!", "verified": true, "helpfulness": "1/1", "author": "Estevan Tarango"}, {"rating": 4.0, "review": "so keep it out of reach of little ones.It's a nice unit and will make an OK 2nd source for my use - it won't be replacing my Win7 Media Center though, which I had  hoped for.I guess I expected pretty much what it gives, except for the remote features.  The fast-forward and rewind have some weird function that stops the video while it moves in either direction, so it's more like a skip forward or skip back, and they don't move very fast in either direction either.  Besides being kind of small, the remote has a very nice rubbery coating to make it easier to hang onto and avoid finger prints.  It's just the wrong size for my hands - no matter what I'm doing with it, my thumb positions are in the wrong place when I hold it.  The voice search seems to work nicely though.  I haven't used it much yet, but so far it has been very accurate.  (my American English speech has no kind of accent or inflection and I've been told it's very clear normally anyway.)In comparison to my old Roku (very old model N1000) it's much better.  I haven't used any of the newer Rokus yet so can't compare to them.Oh, the remote's Bluetooth pairing is a bit of a problem if you want to use the remote with any other devices.  When the Fire-TV goes to sleep and the remote isn't paired, you have to unplug the Fire-TV and redo the manual pairing again.  It's a pain, but the remote unit works great with my tablets.  But, if you just leave the remote paired with the Fire-TV as normal, it restarts quickly.  MUCH more quickly than the old N1000 Roku.  But that thing is VERY old - though still works OK for the old tube-TV in one of the bedrooms.If you're on the fence, I'd recommend giving or getting the Fire-TV first.  I don't think you'd be disappointed.  Besides, this thing is actually brand new, already works great - and the Amazon functionality is only going to get better.  There will likely be a LOT more 3rd parties jumping on really soon, too.  The developer environment looks very inviting - even for the tech hobbiest.Updated 2/24/15 - just a quick note about the remote batteries - my remote came with Amazon Basics batteries, and died in less than 10 months.  My other remotes generally tend to last between 18 to 24 months.  I've replaced the supplied batteries with Amazon 1100mah rechargeables.  I'm hoping these will last longer.", "verified": true, "helpfulness": "1/1", "author": "Neo, the renaissance man \"s/w designer in a h/w world\""}]