[{"rating": 5.0, "review": "I bought chromecast for the screen casting feature. So far it works great casting from my laptop. I'm still experimenting using it with my ipad and android phone but it duplicates picture and sound from my laptop perfectly.", "verified": true, "helpfulness": "0/0", "author": "James D.W. Hogg, D.C."}, {"rating": 1.0, "review": "On the second hour of use it burned out.", "verified": true, "helpfulness": "0/0", "author": "looneytuner"}, {"rating": 5.0, "review": "Its perfect", "verified": true, "helpfulness": "0/0", "author": "Martin benitez"}, {"rating": 1.0, "review": "Waste of money. It worked fine for Youtube. The moment I tried different videos through chrome, it started buffering within 3-4 minutes. Why should I buy a product for streaming if it only works for youtube. I have my smart TV for that. Useless product. Returning it.", "verified": true, "helpfulness": "0/0", "author": "T. Ghosh \"Decfive00\""}, {"rating": 5.0, "review": "Bought this for my Dad for Christmas. Was so easy to set up that he did himself while I was sleeping. He is 69, that is a massive accomplishment for him and Google. Works very well and with multiple products, not just google chrome any more. I'm considering purchasing another one for my self now. Great product.", "verified": true, "helpfulness": "0/0", "author": "Michael Kidd"}, {"rating": 5.0, "review": "Totally enjoying Casting!!! Eliminates the wires.", "verified": true, "helpfulness": "0/0", "author": "TSamba"}, {"rating": 5.0, "review": "Great love it..", "verified": true, "helpfulness": "0/0", "author": "francisco"}, {"rating": 5.0, "review": "Such a great device for the money. Can't beat it", "verified": true, "helpfulness": "0/0", "author": "ITDesktopEng78"}, {"rating": 5.0, "review": "Love this tool for watching movies on ipad", "verified": true, "helpfulness": "0/0", "author": "Dxp"}, {"rating": 5.0, "review": "I had been streaming Netflix to my 2 TVs (neither of which had the app built in) with a Playstation 3, which meant I had to move the PS3 between the TVs. For the low price of a Chromecast, it was more than worth it to not have to move the PS3 anymore. Plus I love being able to cast YouTube videos or web content from my phone or computer to the TV, which I've done a fair amount of. Very cool.I've been using it for 2 months and haven't had any issues. There is a bit of a lag between the time you click the cast button for it to show up on your TV, but it's not bad. I haven't had any buffering slowness. Love it!", "verified": true, "helpfulness": "0/0", "author": "John"}]