[{"rating": 2.0, "review": "I was expecting the world...this one stopped short of my expectations.  First, it does not allow chromecast from your chrome browser on android or ios, only from PC. Second, it was pretty slow and bufferred a lot, though other streaming etc works well on my current wifi.", "verified": true, "helpfulness": "0/0", "author": "Ramkumar Sathya"}, {"rating": 4.0, "review": "Now that we have speedy internet this is awesome for an hd tv where there is no receiver. Get one before its gone", "verified": true, "helpfulness": "0/0", "author": "Jeff Howe"}, {"rating": 5.0, "review": "For 35 bucks this little device is more than worth it... And the way google is slowly rolling out supporting apps, it's actually increasing in its value.", "verified": true, "helpfulness": "0/0", "author": "cam_user123"}, {"rating": 4.0, "review": "Great little video presentation device! More apps compatibility needed, but still worth the money! Great cost effective option for enabling \"dumb\" TVs ...", "verified": true, "helpfulness": "0/0", "author": "Kolade Nurse"}, {"rating": 3.0, "review": "I was hoping to stream videos other than Netflix, Hulu, ect.  I would like to be able to stream pictures and home videos.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great addition for a TV without SMART-features. Configuring is easy and once installed you can fully manage it with your smartphone or a PC using Google Chrome.Also the quality of the received streams is high.Just hoping for more applications to support the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"C-C-B\""}, {"rating": 5.0, "review": "Works really well, Using it all the time to stream music. Can't wait for the apito be free to see what's going to happen.", "verified": true, "helpfulness": "0/0", "author": "Gerdo Lammers"}, {"rating": 5.0, "review": "It works like a charm for my appliances. The only issue in the installation was I have to reset the Chromecast to get it setuped.But after that, everything works fine.", "verified": true, "helpfulness": "0/0", "author": "Gordon Lau"}, {"rating": 4.0, "review": "Love this product. When it is compatible with more apps I will give it five stars. For the price you cannot beat it.", "verified": true, "helpfulness": "0/0", "author": "Bryce"}, {"rating": 4.0, "review": "Google Chromecast Streams YouTube and Netflix flawlessly! Easy setup. Even a caveman can do it.  I can't wait until they add more services.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]