[{"rating": 4.0, "review": "Everything works just fine and flawless. I wish they'd come out sooner with screen mirroring for all mobiles.", "verified": true, "helpfulness": "0/0", "author": "Nitin Sareen"}, {"rating": 2.0, "review": "Buyer Beware - This device WILL NOT show your personal videos or photos on your TV. It will only show Google chromecast supported apps like youtube, google play movies, etc.,  The description is misleading and does NOT call out this important point. Why would I buy a product that wont show my personal videos and photos?!", "verified": true, "helpfulness": "2/2", "author": "J. George"}, {"rating": 4.0, "review": "Chromecast is really nice product. HD video streaming is very satisfying. The only thing I don't like is incompatibility with iOS devices. 3rd party apps do not work properly. But PC and android apps work very well.", "verified": true, "helpfulness": "0/0", "author": "Emre Karabacak"}, {"rating": 2.0, "review": "Google's open-ness of being able to set simple DNS settings on a device of this nature is absolutely ridiculous.It is still worth having; but give the owner the ability to do with the device what they want!", "verified": true, "helpfulness": "1/1", "author": "Adriaan Allers"}, {"rating": 5.0, "review": "Best investment ever. By dumb TV have just been upgraded to the Smart TV age, with a dead simple to use interface as well.", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 5.0, "review": "Bought this as my second one and use both of mine daily (living room and bedroom). Had an issue and looked online not long after purchasing:If you're having issues with these not picking up from other devices and randomly rebooting constantly:*Unplug it from power.*Unplug it from the TV.*Plug back into power, wait for a few seconds until it boots*Hold down the small reset button (next to the rear LED) until it starts flashing*Wait 10 seconds then plug back into TV or device and resume usageThis saved me having to return this and has worked flawlessly since", "verified": true, "helpfulness": "0/0", "author": "Austin Sullivan"}, {"rating": 4.0, "review": "O aparelho é muito bom, mas poderia ser melhor, só necessita um pouco mais de engajamento dos desenvolvedores em deixar seus aplicativos compatíveis com o chormecast.", "verified": true, "helpfulness": "0/0", "author": "Marcos Paulo de Oliveira Ribeiro"}, {"rating": 3.0, "review": "Well, the thing is, the Chromecast can't do much by itself save been used as an screensaver;it relies on your PC and/or Android to do anything, and besides some \"free\" functionality offered by google (e.g. Youtube) this means that you will pony up $$$ for some apps or services (PLEX, HULU, Google Music),Apps need to have chromecast support built in, e.g. my favorite video player \"MX Player\" doesnt, so I have to use something else.", "verified": true, "helpfulness": "0/0", "author": "GSC"}, {"rating": 2.0, "review": "Great to directly case from your mobile, but if you're looking for a broader range of viewing options, Roku is the way to go. Chromecast doesn't directly support Amazon Prime streaming, and has no single native place to organize all of your channels or viewing apps like the Roku does.", "verified": true, "helpfulness": "1/1", "author": "Westm_"}, {"rating": 5.0, "review": "It's incredible, excelent", "verified": true, "helpfulness": "0/0", "author": "Nestor Freytes"}]