[{"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/1", "author": "Maria Gracia"}, {"rating": 3.0, "review": "Kinda of disappointing that you offer some apps and then don't put in your advertisement that in order to receive these you have to pay a premium price.", "verified": true, "helpfulness": "0/1", "author": "Lori E. Hyatt"}, {"rating": 5.0, "review": "We absolutely love our Amazon Fire TV. We bought it for ourselves for Christmas 2014, and have been watching movies, TV Series, etc. ever since.We also use it for all of our TV viewing, along with a special small window antenna that you purchase. We even recently bought a 2nd Fire TV for our bedroom television. It is so nice to be able to watch what you want when you want. All of the positive reviews on this device are accurate. We would highly recommend purchasing this to anyone considering it. Another great feature is the fact that it is voice activated. It couldn't get any easier.", "verified": true, "helpfulness": "0/1", "author": "Jody Benge"}, {"rating": 5.0, "review": "Best decision we have made is to get rid of cable and go to the Amazon Fire! It is fast and easy to use. My four year old can use it. Don't get the fire stick. It is slow and useless compare to the Fire TV. This beats Apple by a long shot.", "verified": true, "helpfulness": "0/1", "author": "Robin"}, {"rating": 5.0, "review": "My family loves Amazon Fire TV, to the point that this one is to replace the one that my daughter had to have for her family. :)", "verified": true, "helpfulness": "0/1", "author": "Blue"}, {"rating": 3.0, "review": "Bought this for my husband for Christmas, now if I could juatmget him to use it. As with any digital product, it does freeze up sometimes, but over all, its a good prodict, better than chromecast (my daughter says differently)", "verified": true, "helpfulness": "0/1", "author": "Rebecca Lambert"}, {"rating": 5.0, "review": "Like it more and more the more we use it.", "verified": true, "helpfulness": "0/1", "author": "D. Miller"}, {"rating": 4.0, "review": "Why does the NBC app keep skipping like every 10 seconds. Its annyoying trying to watch the nightly news. Someone please fix it.", "verified": false, "helpfulness": "0/2", "author": "erin"}, {"rating": 5.0, "review": "I love it, what else can I say. The only thing about it is the SO limited storage space, I have to keep on deleting things and the one single usb port. other than that this is great.", "verified": true, "helpfulness": "0/1", "author": "Ray"}, {"rating": 4.0, "review": "Still getting used to it.", "verified": true, "helpfulness": "0/2", "author": "ANN RIDINGER"}]