[{"rating": 5.0, "review": "works great and i use it daily.  small and powerful and does everything i need.  i will and have recommended this to friends and relatives.", "verified": true, "helpfulness": "0/0", "author": "black and blue"}, {"rating": 5.0, "review": "This is incredible.  I bought it as a gift for my husband for Father's Day and he has been using it non stop.  So many things to do with it and so many options of what to watch.  Only problem is I think I've been replaced by Fire TV.", "verified": true, "helpfulness": "0/0", "author": "kathleen"}, {"rating": 5.0, "review": "Great device. Works flawlessly, just like stated in the box.Love the second screen functionality integration with my kindle.Buy now!", "verified": true, "helpfulness": "0/0", "author": "Nuno+aiv testaccount"}, {"rating": 5.0, "review": "Amazing, simply amazing. By far the best tv streaming device on the market. It's very fast, has a great selection of apps, and has a much more usable user interface than the other device options out there.", "verified": true, "helpfulness": "0/0", "author": "Edward I."}, {"rating": 1.0, "review": "Even though I really liked the fire TV, I will be returning it. Because it would not work with my current internet soeed. However acceasing amazon stream works fine uaing my blu ray. Dissapointed but until next time I guess.", "verified": true, "helpfulness": "3/5", "author": "shirley cannon"}, {"rating": 5.0, "review": "Loved the item but unfortunately the price on the item is too high at this time. enjoyed the 30 day free trial but until the price is lower I will have to wait on purchasing ti", "verified": true, "helpfulness": "0/0", "author": "Angelia \"A single mom that loves to read but doesn't have much free time.\""}, {"rating": 5.0, "review": "I got it for my husband for a father's day gift and he absolutely loves it! Be sure to buy a cord for connection.", "verified": true, "helpfulness": "0/0", "author": "Nandi A. Jones"}, {"rating": 5.0, "review": "This product is built like an Apple product - or better.  It's FAST compared to a typical network TV, in fact its so much faster and easier to use that we put the TV's into brain dead mode and use these on our smart TV's.  Wireless connection works great and the digital audio output drives the surround sound directly.  Nice.  The voice command is a nice gadget, but not that useful in general.  It works only with Amazon digital TV products, and we watch Netflix and Hulu Plus more often.There's one major improvement Amazon could make to this device and they'd control the world, but I'm not telling them here!", "verified": true, "helpfulness": "0/0", "author": "Len Umina \"Len\""}, {"rating": 5.0, "review": "I really like this very much.  It was so easy to set up and easy to use.  I also have a Roku which I like but this was much easier to set up and use  The Roku was not difficult to set up but the Amazon Fire was easier.  I recommend  it if you like movies and music plus news etc.", "verified": true, "helpfulness": "0/0", "author": "Joann N. Robinson"}, {"rating": 5.0, "review": "We ordered both of these devices and tried them both.  We LOVE the Fire TV device.  Better video quality, faster processing and menu selection and the remote is much more user friendly.  Yes the channel selection is much larger with the Roku but are confident that Amazon will add more channels as time passes.  At the end of the day, you pay for a service that allows the user to stream older release movies and TV shows...whether its Netflix or Hulu or Amazon Prime or one of the other channels available.  If you're already a PRIME  member its a no brainer.  We added Netflix basic service because you can get more TV series episodes without paying additional fees to view each episode via PRIME.If you're trying to decide between Roku 3 and Fire TV, our vote is for the Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "Pure gold"}]