[{"rating": 5.0, "review": "This is the best product I've purchased in a long time! Easy setup, and perfect for watching netflix or hulu plus on the tv without finding cords or changing settings.  Plus I can still surf the internet while I'm watching my shows!", "verified": true, "helpfulness": "0/0", "author": "Jessica Pope"}, {"rating": 5.0, "review": "I chose this streamer for my son's bedroom because of it's portability and size. My other streamers require an HDMI cable and is not portable. My son is able to watch his shows on his tv, tablet or computer using the Chromecast. He is happy and so am I!", "verified": true, "helpfulness": "1/1", "author": "Annette Decuir"}, {"rating": 4.0, "review": "I have a pretty fast internet connection but the streaming still lags on some websites like hulu. It really is made for youtube, no lagging there", "verified": true, "helpfulness": "0/0", "author": "licensedbylaw@hotmail.com"}, {"rating": 4.0, "review": "I love the \"Chromecast,\" I do however, have a qualm that prevents me from doling out a five star rating.  For reasons unbeknownst to myself, \"Google,\" has also chosen to restrict your viewing/casting options, based upon their perceived morals.  In short, not all content can be streamed, as the manufacturer felt it necessary to restrict some content from being streamed on the device you & I purchase.  A moral condition subsequent, that the Bloomberg's, of the world would surely condone.  It's a good thing that the large tech. companies know what is best suited for me, lest my moral compass be led askew, irrevocably.", "verified": true, "helpfulness": "0/0", "author": "B. Anderson"}, {"rating": 4.0, "review": "The Chromecast works right outa the box!! Works especially well with Google products.. My Nexus 5 worked flawlessly with it. My Nexus 7 also works with out a single problem. My other non Google products work just fine also... but connectivity some times can be bothersome. I would have to reset the Chromecast (power down, power up).. or I'm watching a show on Netflix and I need to pause, and low and behold my phone  can not HTC One can not find the Chromecast to pause the video!!Other then that I wish I could play content off the phone simpler. I have not had a chance to test out the Real player app yet.. Lets hope this works with out a hitch! Otherwise I recommend this product simply because its tiny, out of the way, works on multi-platforms, and is a breeze to use!!", "verified": true, "helpfulness": "0/0", "author": "A. Ong \"Macadamia Nut\""}, {"rating": 5.0, "review": "I use this device on a daily. In fact, it turned my TV into a SmartTV, now I don't have to spend $2,000 on a new one. Does ALMOST everything, but there are some apps I'd really like to see on it (IE: TwitchTV).", "verified": true, "helpfulness": "1/1", "author": "J. Smith"}, {"rating": 4.0, "review": "works well, i thought i would be able to stream a lot more sites and private apps. but over all content with the product", "verified": true, "helpfulness": "0/0", "author": "moises"}, {"rating": 5.0, "review": "I bring this handy device on work trips and vacation to bring any entertainment I have with me.  Perfect to listen to music if those channels aren't available where you stay.", "verified": true, "helpfulness": "0/0", "author": "Ryan Joseph Wiese"}, {"rating": 5.0, "review": "Its nice, fast the best streaming exist, really really really usefull, I recomend to everybody using this good and brilliant dispositive...", "verified": true, "helpfulness": "0/0", "author": "Wilfran Hiciano"}, {"rating": 4.0, "review": "Is a really good choise to buy, the only thing is that is possible to have only one chrome tab at a time.", "verified": true, "helpfulness": "0/0", "author": "Maria Angelica Rivas"}]