[{"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "scshellM43"}, {"rating": 4.0, "review": "In general, this is awesome, but the pictures of it just being a fob are misleading. There's a plug-in cord to it. Doesn't make it work less or anything, was just surprised to find that in the package.", "verified": true, "helpfulness": "0/0", "author": "lesomers"}, {"rating": 2.0, "review": "You need good wifi", "verified": true, "helpfulness": "0/0", "author": "abdullah"}, {"rating": 5.0, "review": "I have a Chromecast on every TV in my house (7 in all). It is such a low priced and versatile device that only gets better. This week Google updated the firmware to allow you to control your Chromecast with your TV remote by using old HDMI-CEC technology. This just adds convenience over using your phone, tablet, or computer to exclusively control it.", "verified": true, "helpfulness": "0/0", "author": "boonboonpow"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Monica Cagney"}, {"rating": 5.0, "review": "One of the best additions to my current entertainment setup.  Love being able to \"throw\" videos from my tablet or smartphone quickly onto my HDTV.  As I add new monitors in my home, this is a necessary addition to each of them.", "verified": true, "helpfulness": "0/0", "author": "Shivs"}, {"rating": 1.0, "review": "Doesn't work.  Cannot connect via comcast.  What a joke.", "verified": true, "helpfulness": "0/1", "author": "Casey Hedberg"}, {"rating": 5.0, "review": "This thing is great..", "verified": true, "helpfulness": "0/0", "author": "Jeff Vance"}, {"rating": 5.0, "review": "Great item prompt shipping!", "verified": true, "helpfulness": "0/0", "author": "louie a."}, {"rating": 4.0, "review": "When it works, it's great. The (huge) problem is finding iPad apps that work with it. So far, YouTube works 100% of the time, Comedy Central works about 1% of the time. Casting the iPad screen? Forget it! This seems to be much more versatile on an Android platform.", "verified": true, "helpfulness": "0/0", "author": "CosmicBob"}]