[{"rating": 5.0, "review": "great seller! phenomenal item!!! definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Muzikant"}, {"rating": 5.0, "review": "nice\\", "verified": true, "helpfulness": "0/0", "author": "pochol081"}, {"rating": 3.0, "review": "Gives me more issues than I care to discuss, but when it works it works.", "verified": true, "helpfulness": "0/0", "author": "Charge"}, {"rating": 5.0, "review": "The Best Streaming device at this time. 2014 Roku Streaming stick is probably my next buy though.", "verified": true, "helpfulness": "0/0", "author": "John P. Soriano"}, {"rating": 1.0, "review": "Extremely limited in its capabilities. I suppose it's great if you're a big netflix, youtube and Hulu user but it really doesn't do much else besides those three and, besides being able to (or is it being forced to) control it with my phone, I haven't found anything it does that xbox360 and PS3 don't already do.If you're a big user of Netflix or Hulu I can see its appeal. I prefer to get free shipping with my 10 month old movies and decade old direct to DVD movies so I use amazon prime (supplemented by redbox movies for a buck) instead of netflix. Chromecast doesn't support amazon instant video and likely never will as it's a competitor to google.I want to be a huge fan of Hulu as it's a great step towards internet TV and ending the cable company monopoly but with their extremely limited TV library it simply doesn't make sense. After getting chromecast I signed up for Huluplus and spent some time going through their programming. On my DVR I have 103 series recordings set up. Of my 103 shows I watch, Hulu had 35 of them (that's under 34% of the shows I watch). Of that 35, 10 of the shows were what I would call \"filler TV\" that I really just have to have something on in the background while working on something else. I'm not talking about obscure TV for what's missing either. Hulu has only a small handful of programming from CBS, Comedy Central, AMC, TBS, TNT. And they're missing major titles from networks they claim they support. Walking Dead? Nope. Tosh.0. Not there. Bizarre Foods? The list goes on and on. It also bugs me you're forced to watch their commercials. Even for less than ten bucks a month for Hulu I'd still rather pony up the cash for a DVR through cable instead.Youtube is fun but watching 3 minute videos on a 60\" TV gets old pretty quickly. When I feel like youtube on a big screen my 25' HDMI cable works instantly and 100% of the time. Needless to say, the HDMI cable also perfectly mirrors everything on my computer from pictures and home video to smooth HD video on the web without stumbling through clunky indie produced apps.Besides Netflix, Hulu and Youtube there are a handful of other supported services. For instance, if for some reason you want to listen to a podcast through your TV your podcast app is likely supported. Casting from the chrome web browser is a frustrating experience. Video played from the browser is extremely choppy, looks very low resolution and has severe audio sync issues even with 802.11n and 300mbps router. Some pages also didn't display properly and the several second lag between the computer and the TV rendered a wireless mouse and keyboard useless.If you already have an xbox360 or PS3 hooked up to your TV there's essentially nothing chromecast does that those two systems don't already do.I highly suggest an $8 25' HDMI cable (or a short HDMI cable and a wireless keyboard) over chromecast. As has been said many times before. There are lots of devices trying to bring your computer and web browser to your TV, unfortunately, none of them work nearly as well as an actual computer.All of the tech experts keep saying \"It's GOING to be great once a few more apps become available and those apps are coming soon now that the SDK for developers is available!\" It's been over a year and we're still waiting.Luckily I bought chromecast from a big box store so the return was easy. If it ever GETS great, I can always buy it again.", "verified": false, "helpfulness": "1/2", "author": "Steve K."}, {"rating": 5.0, "review": "I have had this for few months now. Enjoy it and hoping for more apps to use with. Also wishing more content.", "verified": true, "helpfulness": "0/0", "author": "TO9 \"TLO\""}, {"rating": 5.0, "review": "The best 30 dollars I had ever spent", "verified": true, "helpfulness": "0/0", "author": "jarrett"}, {"rating": 5.0, "review": "Only works on older tv's, computers & tablets. Will not work with Kindle Fire HDX. Otherwise, does an excellent job. Read closely the requirements for the Kindle HDX to purchase an HDMI doggle that works.", "verified": true, "helpfulness": "0/0", "author": "Mythos99"}, {"rating": 5.0, "review": "Easy to set up and a great price for a great product !! Recommend to all", "verified": true, "helpfulness": "0/0", "author": "fabio"}, {"rating": 3.0, "review": "It is an ok device given the price. The lack of  wireless security standards is rather limiting though.", "verified": true, "helpfulness": "0/0", "author": "Mattias S."}]