[{"rating": 3.0, "review": "I am sure this gadget will work. Even after purchasing a book of instructions I have yet to make it work. I am sure it is something I am doing wrong or not doing. Got aggravated and have not tried to make it work in months. Hey I am getting old, wearing out with little patience what can I say.", "verified": true, "helpfulness": "0/0", "author": "Owen C"}, {"rating": 5.0, "review": "Conforme", "verified": true, "helpfulness": "0/0", "author": "pedro mancilla"}, {"rating": 5.0, "review": "My younger brother uses it along with Twitch.tv all the time!", "verified": true, "helpfulness": "0/0", "author": "alogen"}, {"rating": 5.0, "review": "PERFECT!  Exactly what my nephew wanted for Christmas.It is really a great gadget to have especially if you do not have cable.Just the internet and you are all set.", "verified": true, "helpfulness": "0/0", "author": "Leese"}, {"rating": 4.0, "review": "Lasted a little over a year and a half of flawless operation. Then just quit connecting to the internet for some reason, had to manually reconnect which was a pita. And sometimes it still couldn't connect. Had to hard reset multiple times. But when it was working, it was awesome. Can't complain for 35$", "verified": true, "helpfulness": "0/0", "author": "Alexander Aguirre"}, {"rating": 3.0, "review": "It's alright. I purchased this with the intent to stream movies from my pc/laptop to my TV. They make it seem like you can do this without a problem BUT there is a problem. In order to stream really anything from anywhere you need to use the app that goes with the Chromecast. So streaming movies from your computer to your tv you have to use the Chromecast web browser extension/addon in order for it to cast to the TV it's connected to. Which means you have to open any movie or file that you want from your computer in a browser in order for this to work. I've run into sound issues when doing this so it hasn't been that successful. Quality of the video seems great though, now only if the sound was on par.Now when it comes to streaming app related media then it's fine, but my main goal was to stream from my pc to my tv, which I can do, just with some issues that I'm still trying to work around.", "verified": true, "helpfulness": "0/0", "author": "Carey H"}, {"rating": 4.0, "review": "Works great overall, but can overheat now and then.", "verified": true, "helpfulness": "0/0", "author": "GR"}, {"rating": 4.0, "review": "Great little tool but it's by no means a tv replacement unit.  has some great fun features like computer mirroring and youtube broadcasting but that's it", "verified": true, "helpfulness": "0/0", "author": "Phong Trinh"}, {"rating": 5.0, "review": "User friendly.", "verified": true, "helpfulness": "0/0", "author": "lixinyao"}, {"rating": 3.0, "review": "I haven't determined all that I can do with this unit, but it does allow streaming data from my laptop computer to be \"cast\" to my TV.  You need to read the fine print about what devices it will work with.  You need an Android tablet or Apple tablet.  I have an Amazon FireHD which is an Android, but it wont work because the operating system is too slow - some HDX will work.  Also, you need to be running Google Chrome - my tablet has a different browser. They say it will work with Windows, but when I tried to install it using my computer running Vista, it responded that the operating system had to be either Windows 7 or 8.  Thus, none of my devices would work with Chromecast.  I was about to return it when I thought I'd call Google and tell them how disappointed I was, and I did.  But in doing so, I learned that I only needed the Windows 7 or 8 to INSTALL Chromecast and that once installed, it would work with Vista.  I borrowed a computer with Windows 7, installed Chromecast, and tried it with Vista, and it worked.  I havent used it much as yet, but I've had a bunch of buffering, so likely Vista is not fully adequate.  Also, I don't think the quality of the streaming is as good as Roku or the best one, Amazon FireTV.  But I still have to read about how to use Chromecast in the tutorial, so I may change this opinion later.  At the moment I probably will not be using Chromecast to cast video from my laptop running Vista; I can get the same material to my TV by connecting my tablet to that TV directly.  Slightly more trouble, but it does the job.  Part of my rating is how the device works with my setup, but part is the need to read very carefully what devices Chromecast will work with.", "verified": true, "helpfulness": "0/0", "author": "chuckssite"}]