[{"rating": 3.0, "review": "There are some things I really love about the Fire TV. First of all, it is very fast, smooth, and powerful. It boots up quick (on the rare occasion you need to) plays videos fast and quickly on my Wi-Fi, and the games I've tried ran really well.As far as watching things on Prime, that is improving, Amazon is changing the Gui more to separate and show the Prime stuff more, and purchasing and watching pay content is really easy.Now for the gripesA minor gripe I have which likely will be fixed in the near future is, like many others have observed, third party content doesn't take advantage of the voice search, and in my opinion the apps for Netflix and Youtube are pretty bad in terms of how the app functions and how easy (or not) it is to search for content. ( I can see some of this is getting better now)One thing that is a major disability that I hope can be fixed with a future update (and the main reason for my 3 star rating) is the lack of being able to use flash storage like a USB thumb drive to either store apps or media to play locally on. The Fire TV only has 8gb of memory, or about 5.5gb of usable storage with the system on the drive, so it is really easy to fill it up. Large games around 1gb (bard's Tale, all the GTA games) will fill an 8th of the drive space by themselves, besides all the storage apps need and the beginnings of shows Amazon thinks I'll watch sitting on there as well (I noticed the Amazon video app keeps ~350mb of data on my device).Surely Amazon wants me to continue to buy apps and games throughout the time I have the Fire TV, so I assume they will fix the low app/storage ceiling it has now, preferably by setting up some storage device drivers in the USB port and allowing us to store apps and local media on it and not by just releasing a larger capacity version in the future. I really don't personally like plesk, I already share through SMB and Subsonic media on our local network.I know I can use Plesk to watch the media on my computer, but I don't want to have to install Plesk and have it shared a third time for this specific purpose.All in all, I do really like it and I think it has a lot of potential, however, if Amazon want's me to spend a lot of money through it, they are going to have to open it up a bit more and let me play local media files and store all the apps I want to purchase on flash media.", "verified": true, "helpfulness": "4/6", "author": "Lt. Zombie"}, {"rating": 5.0, "review": "The product was easy to set up and worked just as described, went automatically to my Amazon Prime account.  We have been very happy with the product.", "verified": true, "helpfulness": "0/0", "author": "R canada"}, {"rating": 5.0, "review": "I really like this unit.Easy to install and to operate.A great selection of content.The packaging of all Amazon products is a \"thing of beauty\".Good work.", "verified": true, "helpfulness": "0/0", "author": "Daniel E. Carr"}, {"rating": 5.0, "review": "I already had  Amazon Prime instant video.  The Amazon Fire Tv was a perfect companion.  It was easy to set up and offers ease in accessing  everything that is available.  The help feature explained to me that I did have to turn it off that it timed out after 30 minutes.  I m looking forward to new and recently picked up original Amazon shows.", "verified": true, "helpfulness": "0/0", "author": "S. L. WILSON"}, {"rating": 5.0, "review": "Awesome easy to use and operate. Needs more apps but all in all great product. Best internet receiver easy hookup", "verified": true, "helpfulness": "0/0", "author": "danham2003"}, {"rating": 4.0, "review": "I was excited about the Fire TV when I saw the commercials and knew my 72 yr old husband would be able to find movies by using the voice feature. And it worked for him.But, before purchasing, I called CS and asked specifically if the voice command would work with other movie sites such as Netflix, etc. I was told \"absolutely\" However, the rep that told me that obviously didn't know what they were talking about. The voice command only works for preloaded movies on Amazon and Amazon Prime.", "verified": true, "helpfulness": "3/3", "author": "Myrt Smith"}, {"rating": 5.0, "review": "This is one of the best things that I have bought in the last couple of years. I absolutely love it. I love being able to watch what I want when I want. The apps are great, as well are the games. The voice search works perfectly. I would recommend this to anyone.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "My only problem is how it works with game controller...It doesn't seem to work  or I don't know how to use it....very bad info given on quick setup", "verified": true, "helpfulness": "0/2", "author": "ujl"}, {"rating": 5.0, "review": "I purchased this is go in my basement workout area. I am so happy I did. I love it! It's nice to be able to either watch tv or listen to the \"radio\" while working out in an area in my house that doesn't have cable hooked up!!!! This is awesome!", "verified": true, "helpfulness": "2/2", "author": "Kim"}, {"rating": 3.0, "review": "After owning several Roku's and enjoying the freedom to play video from Vudu, HBOgo, Netflix, Amazon Instant video to name a few; I miss this type of freedom on the Fire TV. That's not to say that in the future Amazon will probably support Vudu, HBOgo and other video content apps its just they are sorely missed upon purchase of this unique system. Which is one reason I deducted a star.The other reason I deducted a star is expandibilty. I don't know maybe its because Amazon streams a lot of copyright media content that they can't put a MicroSD card slot or allow you to plug a hard drive into the USB slot or maybe its something else. They give this stream box a quad core CPU, its own GPU, a pretty good BT gaming controller and show off how great it is at gaming BUT put only 8gb of memory with 5 usable to the customer!! How could they??Asphalt 8 takes up 1.5gigs- I understand trying to keep it under a 100.00. Imagine if Amazon sold their loyal customers versions of the Fire TV to those who enjoy low-moderate gaming with 16gb or 32gbs for 125.00 or 140.00 and the 8gb of course those who really don't game at all. . .Makes to much sense. Or why not just put a microsd slot and allow those customers the choice to maximize their gaming, video and music content. Why marginalize the customer? I am one of those customers who of paid more either a microsd or 32gb of memory.So does speedier content and a cool gaming experience out pace the Roku? Not exactly. What it does is force geeks like myself to hack and jailbreak the OS to give me exactly what I want, exactly what most customers want, a streaming box that fully takes the place of those secondary media options found on most blue ray, along with a push2TV similar to what Netgear has and the freedom to access DLNA systems in your home with the added feature of enjoying average level gaming. That's the ultimate experience.", "verified": true, "helpfulness": "2/4", "author": "J. Henderson \"John 'M\""}]