[{"rating": 4.0, "review": "Good Product", "verified": true, "helpfulness": "0/0", "author": "Devanand"}, {"rating": 5.0, "review": "Great device!It enables me to use my Ipad to watch TV in my bedroom using Netflix and other TV aps that won't play otherwise.  I'm not a big fan of smart TVs.  My inlaws have issues with their apps being out of date and not being able to update them so I didn't want one.  In comes Chromecast and it was perfect to solve my problems of wanting to watch my apps on TV without it having to be a smart TV.Plugged in, updated, synced to my Ipad and it has worked great since.  Occasionally, it doesn't work right, but it's usually a problem with the Ipad and once I restart the Ipad it connects right up and everything is great.  So it's a small price to pay to be able to use my TV as a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Ziare"}, {"rating": 1.0, "review": "Not compatible with any equipment used by the ISPs available in our area. We've been through several router replacements at great cost, only ever getting this to work for about a month.", "verified": false, "helpfulness": "0/0", "author": "Helen Eilert"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Alberto Apablaza Noé"}, {"rating": 5.0, "review": "Great tool.  Works simply and efficiently.", "verified": true, "helpfulness": "0/0", "author": "Jeff Ginsberg"}, {"rating": 4.0, "review": "Works well, just not in hotel rooms.", "verified": true, "helpfulness": "0/0", "author": "Alex S."}, {"rating": 5.0, "review": "Great!!", "verified": true, "helpfulness": "0/0", "author": "KJ"}, {"rating": 5.0, "review": "I've used a Roku stick and I own an Amazon FireTV Stick. The Chormecast is still the best TV interface option, but it depends on what you like.The Roku and FireTV stick act more like multimedia centers. They have unique user interfaces, you see the various options on the screen and navigate to your media using the device itself. Both offer remotes for your phone, but they are just that, remotes. The real interaction is happening on the TV.Chromecast is different, its just a bridge, and this is a much, much better design if you are a smartphone user. Everything happens on the phone. You find the show or clip (on anything from Netflix, YouTube, Plex, etc), on your phone, hit play, then look up at the TV. No back-and-forth, everything happens on the phone until it is time to watch it, then it appears on the TV. The native apps for content like Netflix and YouTube are better designed and easier to navigate on a phone than they are on the Roku and FireTV Stick, so Chromecast gets to take advantage of that.It sounds odd to claim that the option with fewer Bells and Whistles is the best, but for this particular use, it's true. If I didn't have a smart phone it would be a different story.", "verified": true, "helpfulness": "0/0", "author": "Seth A. Ratner"}, {"rating": 1.0, "review": "Waste of money does not work with Android phone loses signal every 10 minutes phone was in close proximity less than 12 inches away phone also have good signal and will continue to play on the phone but not a chromecast I don't even use it anymore totally unplugged it and threw it in a drawer biggest waste of money I ever spent", "verified": false, "helpfulness": "0/0", "author": "Jane E Hulse"}, {"rating": 5.0, "review": "Real good", "verified": true, "helpfulness": "0/0", "author": "Carlos C."}]