[{"rating": 5.0, "review": "This has improved my TV watching experience significantly. I have a Samsung \"smart\" TV and have had a frustrating experience with the native content player. The Chromecast was easy to install, easy to use, and loads video much faster than my TV did.", "verified": true, "helpfulness": "0/0", "author": "Chesterzilla"}, {"rating": 5.0, "review": "i'ts the greatest thing !! very useful and reasonably priced", "verified": true, "helpfulness": "0/0", "author": "juan pablo"}, {"rating": 5.0, "review": "Excellent Product, if you use applications such as Netflix or if you want to mirror your cell phone or computer.", "verified": true, "helpfulness": "0/0", "author": "Pablo Estrada"}, {"rating": 4.0, "review": "Look, this thing is really cool. However, I hardly ever use it.", "verified": true, "helpfulness": "0/0", "author": "Stewart Hines"}, {"rating": 5.0, "review": "Got this as a gift really underestimating what it can do.I have an old 720p Sony TV. Not thinking that it would be useful and functionable in any way, but it had all the ports for HDMI and USB power and once I got it fired up, I never touch any buttons on my TV again.With just the use of my iPhone, I'm able to watch YouTube and Netflix seamlessly. I love it. I also have my 2.1 speakers connected to my TV so whatever is playing through, plays through them and the sound is phenomenal.If you're looking at these reviews for a Chromecast, go get one already. Applications are growing day by day and they work amazing.10/10...Great product.", "verified": false, "helpfulness": "0/0", "author": "Jenson G."}, {"rating": 5.0, "review": "I absolutely love this product. For a meager amount of money, I have effectively turned my dumb tv into a smart tv. I find myself hardly ever using my cable box these days as the option to watch nearly any streaming service wins out at all times.Setup is quick and easy and I had netflix streaming inside of ten minutes. After showing my wife the ropes, she's benefiting as well.Not to exaggerate but you could conceivably save hundreds of bucks on special cable packages by using this and a little internet savvy instead.", "verified": true, "helpfulness": "0/0", "author": "Matthew Taheri \"Matt\""}, {"rating": 5.0, "review": "FAST SHIPPING, GREAT VALUABLE ITEM, AWESOME DEAL", "verified": true, "helpfulness": "0/0", "author": "Mariusz"}, {"rating": 1.0, "review": "Did not work for me , did not do what I wanted. I was not happy with the divice.", "verified": true, "helpfulness": "0/1", "author": "Nathaniel Chavez"}, {"rating": 5.0, "review": "Wonderful!!", "verified": true, "helpfulness": "0/0", "author": "Itzhak Das"}, {"rating": 1.0, "review": "Crappy video quality with tons of unnecessary ads, which is the summary of my Chromecast experience. I think I simply wasted ~30 bucks for a dream that was sold to me", "verified": false, "helpfulness": "1/3", "author": "Ufuk Kilic \"U.KILIC\""}]