[{"rating": 3.0, "review": "I wanted to like this more than I actually did.  I was expecting this to be faster than the other brand we already had.  We have both hooked up on separate tv's and still prefer the other brand.", "verified": true, "helpfulness": "0/0", "author": "Krissi441"}, {"rating": 5.0, "review": "If you are looking for an easy solution for adding smart-TV capabilities to a TV that doesn't have them, this is a great purchase. Even if your TV has applications, you can't go wrong with this device. It's much more powerful than an Apple TV or Roku and even has a voice-enabled remote to simply say what you are searching for.Pros:* Voice remote works perfectly. I've had no issues with the device processing my words and returning relevant results* Device turns on my TV (TV must have the power-on HDMI feature) when I press a remote button* Can stream content from my Android phone to my Fire TV* Has wide selection of Prime Video content to enjoy (for Prime subscribers)* Many top selling apps to choose from (Netflix, Plex, many others)* Has one USB port to connect a controller for games* Very small form factor that doesn't draw attention to itself* Auto updatesCons:* Remote is small enough to lose in couch cushions", "verified": true, "helpfulness": "3/3", "author": "Tundrok"}, {"rating": 5.0, "review": "Really like it! Wish I knew the stick was coming out however.", "verified": true, "helpfulness": "0/0", "author": "tedski"}, {"rating": 1.0, "review": "Horrible product.  Audio only works half of the time.  Would be great if Amazon made their videos available via Chromecast, as that product actually works.", "verified": true, "helpfulness": "1/7", "author": "Matt Boehlke"}, {"rating": 5.0, "review": "Love the easy navigation &  voice recognition.Well worth the money. Just ordered the 'Stick' to test it out...", "verified": true, "helpfulness": "0/0", "author": "Stephan Henze"}, {"rating": 1.0, "review": "INSTRUCTIONS are written by an extraterrestrial.  Yeeeee gods!  I had to take a pair of hedge cutters just to get into their \"Certified Frustration Free\" Box.  The first line of their instructions when I actually got the box open reads: Connect one end of the HDMI cable (not included).Dudes! Come on!Number 2 and 3 are written by a maniac.Number k4 says \"Insert the included batteries into the remote?\" Are they kidding?  It is IMPOSSIBLE to figure out how to open the remote to insert the batteries.I finally found a You Tube video showing that you must use----wait for it-----a SCREW DRIVER to open it.  Do the Amazon Fire Instructionsmention this?  No.I am ready to pull out what is left of my hair!", "verified": true, "helpfulness": "2/12", "author": "E. Jean Carroll"}, {"rating": 5.0, "review": "works much more quickly than apple tv or chromecast (i own both, havent used a roku), as a prime member its nice to have access to its content", "verified": true, "helpfulness": "0/0", "author": "Maximus Frischhertz \"Danger\""}, {"rating": 5.0, "review": "Better than I expected. Installation could not be easier and the box is fast. Streaming is excellent. Voice search is cool though I don't use it very much myself. Recommend it.", "verified": true, "helpfulness": "0/0", "author": "schirminator"}, {"rating": 5.0, "review": "We cannot be any more pleased to finally own Fire TV. The extensive viewing platform is out of this world. Want to discover Amazon in a new light? Try Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Felix Hernandez"}, {"rating": 5.0, "review": "Very happy with it easy to work easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Loy"}]