[{"rating": 5.0, "review": "I started out looking for a DVD player that would let me access things like Crackle, Amazon and other things my Samsung DVD player would allow me to view.  I actually stumbled across this little magic box in my search and what a find!  I ordered it from Amazon via my Prime account and got it in short order.  The connection to my TV and Qwest internet was a no-brainer to get all hooked up.  It took me longer to download the latest software than to do the very simple hook up.  Everything about this magic box is intuitive .  I am amazed at all the features and functions along with viewing options I never dreamed were out there.  I really like the voice command option and the speed this Fire TV device has.  All you have to do is give it a voice command and no more spelling out searches via a cumbersome key pad.  You too will love Amazon Fire TV.update July 15, 2015.. I have had this wondrous little gizmo and continue to be amazed at all the things that can be found using this TV tool.  The best thing is the voice command search tool.  You don't have to deal with trying to enter a search my hand anymore.  Just press and hold the little microphone button and call out what you want to see.  All manner of options will appear and you can easily drill through all of them in short order.  If ever there was a winner product developed for tech Luddites like me this is it.  I have had no tech issues since my purchase of this wonderful device.  You deserve to treat yourself and this is it.", "verified": true, "helpfulness": "0/0", "author": "Paul 1946 \"Paul46\""}, {"rating": 3.0, "review": "As far as I could tell, it would probably work fine; however, my internet is apparently too slow for it to be of much use.  Out here in the country, if we want really fast internet, we have to pay a fortune for it, and I'm not going to do that.", "verified": true, "helpfulness": "0/0", "author": "Glen"}, {"rating": 5.0, "review": "easy to use, great selection of programs.  The help desk is also helpful!", "verified": true, "helpfulness": "0/0", "author": "Amazon reader \"julie of AZ\""}, {"rating": 2.0, "review": "I rate it a five for watching movies  because they have no commercials or interruptions, but one when I try to watch a television program ex Sanford & son, I had to download something called crackle which forces you to watch numerous commercials before and during  which was very annoying", "verified": true, "helpfulness": "0/1", "author": "A V"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "marilyn sopina"}, {"rating": 5.0, "review": "FANTASTIC Device!  Goodbye Satellite TV! Now I am the one to choose what I watch. And no commercials either!FREEDOM from high monthly fees for crap program packages. A life changing piece of hardware.", "verified": true, "helpfulness": "0/0", "author": "Positron \"VintageMicros\""}, {"rating": 4.0, "review": "Great device. Needs to work more  seamlessly  with non amazon apps  such as Verizon  Fios app.", "verified": true, "helpfulness": "0/0", "author": "ONaughton"}, {"rating": 5.0, "review": "absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good inexpensive XBMC/Kodi box, with the processing power to emulate older consoles, what's there to complain about", "verified": true, "helpfulness": "0/0", "author": "Alden Wilson"}, {"rating": 5.0, "review": "Works very well!Lot's of access - particularly with Prime!", "verified": true, "helpfulness": "0/0", "author": "Debora M."}]