[{"rating": 5.0, "review": "Easy set up. Can't wait for more features and apps to come on board. This Device is made well, and has a great UI.", "verified": true, "helpfulness": "0/0", "author": "Chris J. Miller"}, {"rating": 3.0, "review": "In traditional Google style, Chromecast is an unfinished product but without the the Beta label this time. It works but is buggy. For example, one day it would not get discovered by the devices so I had to reset the Wifi router and the Chromecast. I use it for Netflix and from iphone/ipad its \"remote\" responds only half the time. I am hoping these issues can be fixed by new firmware.The lack of a dedicated remote is a usability issue. I prefer a remote to using my iphone/ipad (coz I have to unlock it, find the netflix or youtube app, activate the app and then play/pause). This cannot be fixed by new software though.", "verified": true, "helpfulness": "0/0", "author": "Twine"}, {"rating": 3.0, "review": "I thought that there would be more things that I could cast from my device to my TV screen. Perhaps I imagined some of the things (other applications) like where I could show pictures on my Ipad and cast them to the TV as be an example.", "verified": true, "helpfulness": "0/0", "author": "Doug4650"}, {"rating": 4.0, "review": "Thing I loved:* Really make a smart tv out of your not so smart tv* Netflix and Youtube casting work great in high resolution and not frame drops. The way your phone functions as the remote is great.* Small compact solution* GREAT - price point. Even better if you managed to snag the 3 months of free NetflixThings I wish to see improved:* Tab casting - the real feature I got this device for, is not very good at casting streaming videos - tremendous lag and frame drops. I hear this can be improved by lowering the frame rate but I haven't tried this myself.* Cannot tab case from Android at this time, only your laptop.* Initial load time is a little longer than optimal for loading netflix/youtube videos but its tolerable for now* There need to be more apps that support casting. In fact, android should just come with a global 'cast' button that casts the display of your phone to your TV.I'm positive that most of the things in the needs improvement list are going to be addressed soon enough. This device has great potential.", "verified": true, "helpfulness": "0/0", "author": "Nikneo"}, {"rating": 5.0, "review": "Does what it's ment to well. Can't beat the price with the Netflix offer. What more do you want?  It's Google", "verified": false, "helpfulness": "0/0", "author": "Isaac"}, {"rating": 3.0, "review": "Was excited initially.  Doesnt stream continously and hopefully Google will comeup with more upgrages to make it successful.  Though HDMI pic quality is not great.", "verified": true, "helpfulness": "0/0", "author": "Shashikanth Korimilli"}, {"rating": 3.0, "review": "The device works just fine.  The problem is for the most part it is a way of selling Netflix or other internet services without a gaming device.I don't think that it has any other purpose right now but it could lead to a better use of content, if free, over the internet.We are not there yet.", "verified": true, "helpfulness": "0/0", "author": "T. Russo \"cat man\""}, {"rating": 5.0, "review": "As an owner of a Roku 3 my standards are high and for the price of the Google Chomecast I was more than intrigued by the fact that you could also share web pages from your computer.  I go backpacking a lot and using this to stream maps from my computer onto my television is pretty darned sweet.  Knowing too that Google will continue to add other applications beside their google play store, netflix and youtube only boosts the value of this awesome streaming dongle.", "verified": true, "helpfulness": "0/0", "author": "Carlos Flores \"werd\""}, {"rating": 4.0, "review": "I have to say for $30 how can you not want to buy this?Pros -1) My wife is able to move items to the TV a lot easier than she was with our Windows Media Center setup.2) Setup was SOO easy3) Small and out of the wayCons -1) I expected more features, like screen sharing for presentations etc2) No support for Windows 8/Office. I would like to have been able to play my PowerPoints through it. If it had that, I can assure you my company would have bought 50 of these.", "verified": true, "helpfulness": "0/0", "author": "D. Wilson"}, {"rating": 5.0, "review": "The video and stream quality is super. I was a bit skeptical in the beginning since I have tried before some Chinese models. Two thumbs up!", "verified": true, "helpfulness": "0/0", "author": "Frets Olivares"}]