[{"rating": 5.0, "review": "Worked great when I took on a family trip. Convenient, for sure.  Since you stream from your smartphone or tablet, make sure you are able to keep it plugged in while streaming.  Currently use it at home as well in one of the bedrooms, instead of playing from gaming console, so that is really convenient.If you do not have a SmartTV, or need something to access streaming services while travelling, this is very nice to have.No, I do not work for Google, but am willing to work for them .... ;)", "verified": true, "helpfulness": "0/0", "author": "Ali"}, {"rating": 5.0, "review": "Absolutely love this thing! It's so slick and so easy to set up and go. Literally with 5 minutes I was streaming Netflix from my tablet. I've got really good internet so I don't know if there is any lag versus a direct cable but so far I've had literally no lag issues using it.Pros:Streaming interface is slick, easy to install and use.No more cables!Other people's devices can use it as well, no switching inputs or cables.Potential Issues they head off at the pass:Chromecast can't fit in the hdmi space >> Comes with an hdmi extender.Needs a power source >> can plug into wall socket OR USB in your tv.Only real \"CON\":Chromecast has to use wifi to work. So if your laptop or desktop is getting it's internet from a cable, you can't stream to the chromecast. That's the only real \"problem.\"", "verified": true, "helpfulness": "0/0", "author": "amazonshopper"}, {"rating": 4.0, "review": "Didn't know what this result on use is as it is used in rural Alabama. Signal issues possibly", "verified": true, "helpfulness": "0/0", "author": "Baron Buskell"}, {"rating": 5.0, "review": "Makes any tv a smart one", "verified": true, "helpfulness": "0/0", "author": "Serena Ryan"}, {"rating": 1.0, "review": "Didn't work - after hours on the phone with customer service at Google, they couldn't figure out how to make the sound work.  Returned it.", "verified": true, "helpfulness": "0/0", "author": "Still seeking aqua!"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "David Materne \"DM\""}, {"rating": 3.0, "review": "wifi too weak", "verified": true, "helpfulness": "0/0", "author": "Oscar H."}, {"rating": 1.0, "review": "Can't get it to work. I want to return it.", "verified": true, "helpfulness": "0/0", "author": "John Dimare"}, {"rating": 5.0, "review": "Works as designed.", "verified": true, "helpfulness": "0/0", "author": "Rick R."}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Suresh Babu"}]