[{"rating": 3.0, "review": "I don't like it. I plan on returning it, many many videos that I want to watch have to be purchased or rented and I simply don't want to pay for that. If you already have a system/device that plays things such as an internet TV or Xbox One and etc. this is essentially useless.", "verified": true, "helpfulness": "1/4", "author": "Koa"}, {"rating": 5.0, "review": "Great product especially if you have a prime membership.Update: Still works fine. Have had it for about 4 months now. It has acted up a bit. I had to restart the fire TV twice within two months of each other and let me tell you it is a long and tedious process. But once it restarts it works the same. My housemate added his netflix account so now we have twice the viewing options.", "verified": true, "helpfulness": "0/0", "author": "Geo \"O. Giovanni Lopez\""}, {"rating": 3.0, "review": "Amazon Fire TVI thought that Amazon had made deal with HBO but still NO HBO Go", "verified": true, "helpfulness": "0/1", "author": "William B."}, {"rating": 4.0, "review": "We have had Fire TV for about 3 months and love it overall. One major complaint: Voice command does not command at all. Huge downfall for advertising.. This unit does freeze once in awhile but not enough to rate negative.", "verified": true, "helpfulness": "0/0", "author": "Dawn W."}, {"rating": 4.0, "review": "A great product!  Very easy to use, even for my kids.  I used to use our Wii for Netflix but its interface required you to be very exact with pointing and clicking.  The Amazon buttons are so much easier and the device is tiny but packed with power.  The one reason I didn't give it five stars is the voice search, which is awesome and very accurate by the way, only searches Amazon content--not apps like Netflix (even when you're within the Netflix app).  Obviously that's competition for Amazon Prime streaming service so I understand why they didn't try to make it integrate, but that's a glaring issue for me.  I rarely use the voice search because of it, and Prime's streaming service doesn't have enough content (at least not yet) for me to switch to it wholesale.", "verified": true, "helpfulness": "0/0", "author": "T. Franklin"}, {"rating": 5.0, "review": "This is a great product.  It comes custom with my information pre loaded.  Easy to find the movies, games or music I'm looking for.  I would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "I. Rizer \"Still Rizen\""}, {"rating": 3.0, "review": "I have some problem with the resolution. In some TVs do not work", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Pérez"}, {"rating": 1.0, "review": "So far not that impressed. It says showtime anytime but a bunch hoops and at the end does not work with comcast. Also the xfinity comcast app is also not working. I had high hopes this could use the kindle fire apps and just work but so far it does not. Read the fine print before buying. Odds are you will find out the functionality you thought you were getting is simply not there.", "verified": true, "helpfulness": "2/6", "author": "Travis H. Hutchings"}, {"rating": 5.0, "review": "I've got an Apple TV, Roku, smart DVD/Blueray players and smart TVs which all allow me to stream content.  This Fire TV is far better and easier to use than my other options.  The interface is very quick and the voice search works really well.", "verified": true, "helpfulness": "0/0", "author": "Blackbag52 \"Old Geek\""}, {"rating": 1.0, "review": "tricia_kreitz@yahoo.com  I WAS CHARGED FOR 2 OF THESE AND DID NOT ORDER THEM THAT IS OVER 200.00 I NEED MY ACCOUNT REFUND4EDWHEN AM I GOING TO GET MY REFUND ON THE 2 AMAZON FIRE THAT I DID NOT ORDER!!!!!!!", "verified": true, "helpfulness": "1/12", "author": "greg kreitz"}]