[{"rating": 1.0, "review": "Constantly has to buffer even on the lowest quality setting and restarted computer right next to laptop and restarted modem with 40mb download and 5 upload speed.", "verified": true, "helpfulness": "0/0", "author": "Casey Hamilton"}, {"rating": 5.0, "review": "Finally I'm able to stream from my laptop to tv! This was my third purchase trying to connect my laptop via hdmi. My first two purchases were cords that never worked. This is even better because it connects wirelessly, so you can be on your computer while also streaming something to the tv. Love it!", "verified": true, "helpfulness": "0/0", "author": "Jillian"}, {"rating": 5.0, "review": "perfect device for TV. love being able to control Netflix and hulu right from my phone.", "verified": false, "helpfulness": "0/0", "author": "Joseph Rivera"}, {"rating": 5.0, "review": "Works great. Shipment arrived ahead of time!", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "It's awesome. Easy to setup and manage.", "verified": true, "helpfulness": "0/0", "author": "Ignace"}, {"rating": 1.0, "review": "Connection is on and off.  I have to reconnect it so often.", "verified": true, "helpfulness": "0/0", "author": "S. D. Lee \"azumma\""}, {"rating": 5.0, "review": "The cast works perfectly I chose 2 day shipping and it cam on time but when it got here my dog chewed the package because he's kinda dumb but the box was ripped a little bit but the cast was fine, thank god! Otherwise a 5 star product!!!!", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 3.0, "review": "I misunderstood what this thing does. It doesn't make your TV pick up directly from your wifi like a smart tv. It receives from a device like an iPad or laptop.", "verified": true, "helpfulness": "0/0", "author": "W. Tanner"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Yuriy"}, {"rating": 5.0, "review": "I love this. I have a plex media server set up and I stream it to my chromecast. It does an amazing job and I would 100/10 (yes I meant 100) recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Daniel Prescott"}]