[{"rating": 5.0, "review": "We are really enjoying Netflix on our tv through Chromecast. The picture is good and clear with great clarity. It was very easy to set up too!  Our son is thrilled that he doesn't have to share his XBox with us just so we can watxh a movie or some other feature. We recomend this device.", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 3.0, "review": "little use  in Israel", "verified": true, "helpfulness": "0/1", "author": "elbaz eliezer"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/1", "author": "emma c. helbert"}, {"rating": 5.0, "review": "Great product! Streams my media from my phone without any trouble!👐 it only takes a few seconds then boom it's on your tv. I definitely recommend this to anyone, worth it's price.", "verified": true, "helpfulness": "0/0", "author": "xXx_AlmightySosa_xXx \"GloNation101\""}, {"rating": 5.0, "review": "We love it, so easy to use and works very reliably. Great alternative to having a smart tv.", "verified": true, "helpfulness": "0/0", "author": "supatwinmom"}, {"rating": 4.0, "review": "I'm very interested but have not had time to examine this product. I will check it out soon very interested", "verified": true, "helpfulness": "0/1", "author": "Cboullt"}, {"rating": 3.0, "review": "Did not understand well how to use with an iPad. Lots of discussion about android.", "verified": true, "helpfulness": "0/0", "author": "Richard Sale"}, {"rating": 5.0, "review": "The chrome cast is awesome! I have an iPhone and it works extremely well with that as well. The chrome cast takes being lazy to a whole new level!! I literally go on my phone. Put on Netflix and still text and even watch YouTube videos while Netflix plays. Also when your chrome cast is idle it displays such beautiful pictures. I honestly use the tv and chrome cast as a picture frame when I am not using it. And it doesn't come off tacky at all! I think it's the next must have!", "verified": true, "helpfulness": "0/0", "author": "Jeffery Hou"}, {"rating": 5.0, "review": "Bought my first Chromecast in July 2013, it just works and keeps getting better as new features are added.", "verified": true, "helpfulness": "0/0", "author": "Raymond Smith"}, {"rating": 5.0, "review": "I love this little gadget", "verified": true, "helpfulness": "0/0", "author": "Debra Flores"}]