[{"rating": 4.0, "review": "It's a great product and price, but there are very few apps available currently. More apps will come, but you need to be patient and aware before buying.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 4.0, "review": "I enjoy my Google Chromecast. I wish it worked with my Amazon Prime Movies. Right now it is very limited, YouTube and Netflix. I hope there is more support soon. The one thing I noticed is it gets pretty warm for it's size. Because of this I got out my trusty Kill A Watt (TM) device and measured the power consumption. When it's power cube is connected the Chromecast consumes 4 watts of power. This is true whether it is connected to your television or not. If you unplug it from the power cable, the power cube shows no power consumption. Because this device will get limited use for now, I will be unplugging it except when I want to use it. It only takes a few seconds to start up when power is applied.I also have a Roku box and it's power consumption is 6 watts. As with the Chormecast, there is no power switch so it is consuming power whether you are watching on it or not.There is so much great programming on YouTube I feel my money was well spent. The video quality is excellent. I have no complaints with the product so far. With more support, I would give it five stars.", "verified": true, "helpfulness": "0/0", "author": "WA8UOC"}, {"rating": 4.0, "review": "It's not very trivial to set it up but once it's up it works great. Google's instruction did not say that when it's first powered on, the Chromecast runs as its own wifi network that I had to change my laptop's wifi to connect to its network SSID in order to set up my home network on the chromecast itself. After it's done then I had to change my laptop back to my home network.", "verified": true, "helpfulness": "1/1", "author": "M. Lang"}, {"rating": 5.0, "review": "good for play all the device that can play laptop. I recomend every one don't want spending too much money.", "verified": true, "helpfulness": "0/0", "author": "Michael nguyen"}, {"rating": 4.0, "review": "I was initially favorably impressed with the relatively easy setup and the playback of a number of YouTube videos. This device handles the older simpler videos on YouTube quite capably. However, when I tried to play the official YouTube video for When In Rome, \"The Promise\", the Chromecast device simply did not have the adequate horsepower to launch the video after the advertisement.As a test, I then switched to my Chromebox, which is hooked up to my TV on another HDMI slot, and played the When In Rome video FLAWLESSLY. Well, you can't really compare a $35 Chromecast with a $400 Chromebox, as there obviously is a whole order of magnitude difference between these two platforms both on a technical and price dimension.I will take this device with me when on travel, and try it out on the TVs in the hotel rooms just to see how successful I am with the free Wifi that comes with the room. It's a cool gadget. I don't know how well it works with the Netflix and Hulu Plus apps, so you will have to read the other reviews for these options. Perhaps there will be a software upgrade in the future that will mitigate the specific issue I had with it.", "verified": true, "helpfulness": "1/1", "author": "Bruce E. Reynolds \"Excel Expert\""}, {"rating": 1.0, "review": "Requires you to play sound thru tv speakers.  Bummer for folks that have a decent stereo.  No mention made in description.  Very dissapointed.", "verified": true, "helpfulness": "1/3", "author": "anon"}, {"rating": 5.0, "review": "Usually I don't write reviews but I see a lot of bad reviews on this from people that are not using it as intended it does what google advertises it will do, it's working fine for me playing you tube, hulu plus, netflix even amazon prime on chrome browser, at 35.00 it's a steal the cheapest way to cut the cord!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Ok its my fault but I glossed over the fact that you cant cast from android browser tabs....besides that, once you start casting a youtube video from android (tab 3) you cant stop it. I am sure that these issues will be resolved, but right now CC is just a novelty if you want to use it with your tablet in hotel rooms.", "verified": true, "helpfulness": "0/0", "author": "svetlana"}, {"rating": 5.0, "review": "I've used this for almost a month now, and I absolutely love being able to stream Netflix and YouTube from my tablet. This is a step up from streaming on Xbox since I don't have to pay for Live. Also, it's great to use to fall asleep to Netflix since I don't have to let the Xbox run and can just have my tablet on (which is quieter).", "verified": true, "helpfulness": "0/0", "author": "BrandonArt"}, {"rating": 5.0, "review": "This is great for streaming content.  Works seemlessly with Youtube from laptops or mobile devices, great integration to Netflix (again mobile device experience is great).Very neat that any device in the house can launch content on the chromecast.", "verified": false, "helpfulness": "0/0", "author": "Julie (TriGirl) & David"}]