[{"rating": 5.0, "review": "This is a great device to view YouTube and a few other streaming video services, but the best part is that when my grand kids are arguing over who gets to watch what on the tablet then I can stream it to the TV and they all can watch something and take turns", "verified": true, "helpfulness": "0/0", "author": "Robert Agostinho \"Forever Student\""}, {"rating": 2.0, "review": "I'm disappointed with this product, this is not even near to Apple TV.It is not worth to keep so I will return this product soon", "verified": true, "helpfulness": "0/0", "author": "Satish"}, {"rating": 3.0, "review": "When it works it works well, but I have had several times when it just sits there thinking and then it makes me think it has a while to go until it can replace cable which never lets me down. How come Amazon Video doesn't support it yet?", "verified": true, "helpfulness": "0/0", "author": "R. Dimeo \"Readr\""}, {"rating": 4.0, "review": "The product and shipping time is a 5, but I took off a star because the item was used when I thought it was going to be new.  It works fine but I had to erase previous user settings.", "verified": true, "helpfulness": "0/0", "author": "Kirk Shelton"}, {"rating": 5.0, "review": "Love this device!! I only have one smart tv in my apartment so at night when I'm in my room I can stream from netflix on my tablet right to my tv!! Definitely gets 5 stars from me fast and reliable all around great tech!!", "verified": true, "helpfulness": "3/7", "author": "Jackson"}, {"rating": 4.0, "review": "I really only bought the chromecast because I like my gadgets and it was crazy cheap; so I figured I would give it a go. I was really impressed with just how easy it is to set-up (particularly if you plug it directly into a power supply as opposed to a USB connection, as it recommends anyway).The user interface isn't as aesthetic as the apple TV system, that's for sure. But the playability is there. I've been able to connect all of my systems (laptop, tablet, phone, games system) easily and stream from varying sources (internet, hard drives, USBs...). It is also compatible with apple products although I  haven't fully tested to what extent yet.Overall: Not many gadgets this useful out there for $35. Why wouldn't you buy it?!", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "More apps are promised everyday, yet today you can enjoy YouTube, Netflix, Pandora, and stream local media from you phone with Plex.Super simple to connect.  Just follow the instructions and add the device to your wifi.Suddenly, a new icon appears on Chromecast compatible apps in your phone.  This allows you to simple connect and stream whatever content to your TV.  That's it,  other than adding an attachment to your Chrome browser so you can stream from the desktop.Though in beta, you can stream the entire desktop to your TV.  Nice for me as a photographer who likes to see how an edited image appears on a different monitor.", "verified": true, "helpfulness": "0/0", "author": "Spencer"}, {"rating": 5.0, "review": "this is a awesome product and I am sure that Google knows how rockin it is. I haven't had a issue playing any kind of file on it from my computer, android phone or tablet. Great clarity and sooo easy to hook up.", "verified": true, "helpfulness": "0/0", "author": "Tricia Szakmeister"}, {"rating": 5.0, "review": "It works better than watching netflix thru my dvd player. I don't know if it use more bandwidth or not. It looks better than that off the netflix device.", "verified": true, "helpfulness": "0/0", "author": "Stephen"}, {"rating": 2.0, "review": "This device could be the coolest thing ever, but when it supposed to work my laptop and android device can often not find it.  We are on the same wifi and have followed the plethora of tips, reset the device, etc. and this thing likes to play hide and seek.  When it works, it is the coolest thing since sliced bread.  There are hiccups occasionally, but has a lot of promise.  I hope it improves.", "verified": true, "helpfulness": "0/0", "author": "mpinch"}]