[{"rating": 5.0, "review": "Created a presentation and it played on a loop without error. I was the talk of the trade show In visual representation.", "verified": true, "helpfulness": "0/0", "author": "Don Wallace \"Fabweb\""}, {"rating": 5.0, "review": "This device is awesome. The setup was very simple. I am able to enjoy seamless HD streaming, making full use of my Netflix and HULU memberships.", "verified": true, "helpfulness": "0/0", "author": "Dion King"}, {"rating": 5.0, "review": "This is very cool and nice i really like it, it gives another meaning for youtube and other multimedia apps. Thank you Google.", "verified": true, "helpfulness": "0/0", "author": "Suhaim"}, {"rating": 4.0, "review": "Pro - Easy to use once set upCon - Difficult to set up on some devices.  Works great on my Nexus 7 and Apple laptop.  Can not get it to work on my Windows 8.1 laptop.", "verified": true, "helpfulness": "0/0", "author": "James F. Danielson"}, {"rating": 3.0, "review": "I gave this review due to the following reasons:1. Only Youtube app is worth casting outside US. To use Netflix or Hulu services outside US one needs VPN in their ISP itself which a common user wouldn't know to setup.2. Local video file casting is limited to mp4 only.Pros:1. Able to use my PC while casting koreanovela for my wife, cartoons for my kids or NBA games2. Damn affordable3. Cast pretty much any video streams online which is greatAlso Casting quality really depends on Wifi traffic so if a lot of people is connected and using your wifi connection where Chromecast is connected casting disconnects occasionally or you will not be able to cast at all.", "verified": true, "helpfulness": "0/0", "author": "Jel"}, {"rating": 5.0, "review": "When I bought this thing I was not sure exactly how it worked or what it does. I figured for $35.00 it was worth the gamble. What it does is allows one to access online videos with your smart phone, computer, netbook, or laptop from the likes of You tube, Netflix, Hulu and others. You can than send the videos via WiFi to the Chromecast player which plays them on your TV. It works well! It does not replace one's satelite or cable tv as it is advertised, but it does add some additional viewing options.", "verified": true, "helpfulness": "0/0", "author": "Gilbert C. Spray"}, {"rating": 5.0, "review": "It had been recommended highly, and works perfectly. As long as you have a tablet (I use an iPad), it's easy.", "verified": true, "helpfulness": "0/0", "author": "Mark Seymour \"Writer & publisher\""}, {"rating": 5.0, "review": "Using native apps, broadcasts video and audio. When using Audio receiver, Limitations with silverlight player prevent audio, so don't use netflix with browser, instead use iOS or android netflix app, for example. Or else put it in tv directly.", "verified": true, "helpfulness": "0/0", "author": "Timothy B Nichols"}, {"rating": 5.0, "review": "Chromecast installs in minutes.  Its simple design makes it a must have for watching Netflix, Youtube, etc. on your TV.", "verified": true, "helpfulness": "0/0", "author": "Robert F. Canini"}, {"rating": 5.0, "review": "I have one for each TV in my home.  I do not have cable and this has been a great alternative!  Only down fall is not being able to cast Quicktime and Silverlight videos with volume coming from TV rather than source..", "verified": true, "helpfulness": "0/0", "author": "Tanya hopeau"}]