[{"rating": 4.0, "review": "No 5Ghz connection and no 1080p.  Those are the big disappointments, but it's all good because of the price.  720p \"extreme\" setting can sometimes get choppy from frame drops.  Really hoping they have an update of the hardware to allow the things it is missing.", "verified": true, "helpfulness": "0/0", "author": "tfunk02"}, {"rating": 5.0, "review": "Chromecast has expanded my options for TV and secured my total abandonment of paid providers  is cable OE satellite.  I live in an area of VT with 1 NH PBS station and 1VT PBS station and only NBC over the air.  So streaming via free apps or low cost apps like acorn TV for the British shows I prefer is a real plus.  For Acorn TV I added the web video caster app and have all the programming I choose without the mind-numbing junk ballooned on paid providers.  Thanks a bunch Google.  I ended up buying another Chromecast for the bedroom.  I really appreciate the fact that my tablet or laptop can power off or be used for other applications once the Chromecast video begins.My only concern is that some TVs do not disable the USB port when the TV is turned off.  That means the Chromecast is always powered on (and warm to the touch.). So for the TV that keeps power to the USB port, I simply unplug the Chromecast from that USB port while keeping the device attached to the HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Rev. Cheryl D. Heater"}, {"rating": 5.0, "review": "best invention", "verified": true, "helpfulness": "0/0", "author": "Michael Parrinello"}, {"rating": 5.0, "review": "Excelente!!!", "verified": true, "helpfulness": "0/0", "author": "Oscar L."}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Wuaoo, nice HDMI easy to use very good product and I recommend, including excellent photos IN THE BACK ground.", "verified": true, "helpfulness": "0/0", "author": "jesus"}, {"rating": 5.0, "review": "We find that we can't live without our Google Chrome. I watch a lot of YouTube tutorials, my husband watches his online streaming content from the racing world and my kids grab it for Netflix and Hulu. An all around excellent purchase that I can definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Mommagamerz"}, {"rating": 5.0, "review": "It is a wonderful thing to have. We are all able to control it from our own devices to watch what we want on the tv. Sure beats watching everything on a phone.", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 5.0, "review": "Out of all the gifts I gave my husband last Christmas, this was his favorite! And quite honestly, we love it too...and now he has to hunt for it all over the house because everyone keeps stealing it!! Super easy to set up and just so great! Will buy more for other TVs in the house this year--can you give a gift to a television? We will!", "verified": true, "helpfulness": "0/0", "author": "Eleanore Macnish"}, {"rating": 5.0, "review": "The best dont i dont need to buy smartv", "verified": true, "helpfulness": "0/0", "author": "Josip"}]