[{"rating": 4.0, "review": "Sometime it hange", "verified": true, "helpfulness": "0/0", "author": "Mohamed"}, {"rating": 5.0, "review": "This is a great product. Cheap and easy to set up (5 minutes). I stream Netflix, hbo go, espn, crackle, and more. It's very useful for me because I don't have a cable jack in my bedroom so I use the chromecast for my entertainment needs.", "verified": false, "helpfulness": "0/0", "author": "Kyle Cruz"}, {"rating": 2.0, "review": "Want to cast videos that you paid for and downloaded to your Nexus from Google Play?  Forget about it.  Chromecast will not do it!  They insist that you first must DELETE the movie from the Nexus before you can watch it.  This means streaming the movie from the net, not watching it play from the Nexus.For anyone in rural areas that do not have city bandwidth, don't waste your money.  Buy an 1st generation Apple TV.  You can actually download and watch movies.One would think a technology giant like Google would have SW Engineers that know how to secure a pipe to the Chromecast device, and lock viewing on the Nexus once viewing has started on through Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Business Colleague"}, {"rating": 5.0, "review": "Netflix works better on the Chromecast over wireless than it does on my wired TiVo. It is also easier to control than Netflix on the PS3. Also Chromecast supports: ESPN, Netflix, Youtube, Pandora, and much more. It also makes for a great demo from your computer. Plug it in to a monitor or TV, hook it up to the wireless, and show off your Chrome from your computer.", "verified": true, "helpfulness": "0/0", "author": "Jesus M. Rodriguez"}, {"rating": 5.0, "review": "This is a gift. I loved my sons chromecast. My wife wanted one. Her birthday is coming up. We shall see how it works for us.", "verified": false, "helpfulness": "0/0", "author": "R. Washington"}, {"rating": 1.0, "review": "REALLY REALLY SLOW STREAMING.  Roku makes a much better product with many more app options.", "verified": true, "helpfulness": "0/0", "author": "AAW"}, {"rating": 5.0, "review": "excellent product and seller", "verified": true, "helpfulness": "0/0", "author": "WUNAR"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Richard Proctor"}, {"rating": 4.0, "review": "This is a very good product, however I don't know how to make possible to just view the screen and other applications which are not supported yet on the TV. It would be wonderful if internet explorer, office programs, and just the desktop itself could be projected to the TV screen.", "verified": false, "helpfulness": "0/0", "author": "Bostonian \"Bostonian\""}, {"rating": 1.0, "review": "Did not work with my tv and would not accept return.", "verified": true, "helpfulness": "0/0", "author": "judy baker"}]