[{"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Roylan Alvarez"}, {"rating": 5.0, "review": "The best thing I bought myself in a while. The setup is easy and there are new apps being added regularly. This tiny device does a lot and I love it.", "verified": true, "helpfulness": "0/0", "author": "Jazmin N. Lewis"}, {"rating": 5.0, "review": "Already have  one like so much  giving  as a gift  so others can Enjoy  the Ease Of Use  great Product  as wellThanks for another quality  product", "verified": false, "helpfulness": "0/0", "author": "thomas"}, {"rating": 4.0, "review": "Works great!!", "verified": false, "helpfulness": "0/0", "author": "Kevin A James"}, {"rating": 5.0, "review": "Awesome product!  My kids love that they now can stream YouTube on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Angel Reyes"}, {"rating": 5.0, "review": "Best buy I had made this year! I love the dive. The streaming is clean and beautiful worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Angela Aybar"}, {"rating": 5.0, "review": "Nice product...should have bought one when i first heard of it.", "verified": true, "helpfulness": "0/0", "author": "Lakesta \"G\""}, {"rating": 2.0, "review": "The functionality is nice but I wanted to stream Amazon prime, no can do.  That's on the Fire stick.  Sorry Google, I mean Amazon but but I'm having a tough time separating out your business...  Regretfully the whole thing is too cheap to go through the hassle of returning it.  Guess I'll be the happy (not so) owner of both.", "verified": true, "helpfulness": "0/0", "author": "JP Nesbit"}, {"rating": 3.0, "review": "When functioning, I really like the Google Chromecast.  However, I have had a lot of problems with this device.  I am still in the troubleshooting phase and I am making adjustments to my access point to see if that helps.  I find it most ironic that the things I have the most problems with casting are items I am trying to cast from my Google video/music libraries.I would not buy this again.", "verified": false, "helpfulness": "0/0", "author": "Amanda Hoehn"}, {"rating": 2.0, "review": "It shows up on my laptop and smartphone setup screen, but failed to complete setup 14 times on 3 different TV's.  My wifi works fine, but Chromecast doesn't have good wifi reception.  Also, be aware that you need to use the supplied HDMI extension cable because it can't even be seen without it.  You should also know that it sticks straight out over 7\" from your TV's HDMI port when you use the short stiff HDMI extension cable.", "verified": true, "helpfulness": "21/24", "author": "Bruce Hill"}]