[{"rating": 5.0, "review": "This item delivered as promised and allows us to watch netflix on all of the devices in our home.  Two thumbs up!", "verified": true, "helpfulness": "0/0", "author": "Alexis"}, {"rating": 4.0, "review": "Once I figured it out, it just worked.  So far, I've only used it with YouTube and the picture on my 42\" plasma is great.  I had some technical difficulties at first.  I was not able to get the Chromecast activated through my laptop, that is, I had trouble finding the Chromecast on my network.  I was able to use my HTC One to complete the setup.There are not many choices of media to support Chromecast yet and you have to use the Chrome browser.  Other than that, it was a good purchase.  I gave it 4 stars because of the difficulty I ran into on start-up.  Others may have no problems.", "verified": true, "helpfulness": "0/0", "author": "Mike Kirkwood"}, {"rating": 5.0, "review": "Great product! Couldn't get it to work from my iPhone but it does work using the computer. Shipped fast and great quality, very pleased overall", "verified": true, "helpfulness": "0/0", "author": "Stacy F."}, {"rating": 4.0, "review": "You can only use it with netflix or google chrome.  Does not work with hbogo, showtime anytime, Hulu, or amazon prime apps.", "verified": true, "helpfulness": "0/0", "author": "Ashish P."}, {"rating": 2.0, "review": "ORIGINAL REVIEW: It is inexpensive and quality built. It performs exactly as advertised. I realize that it is brand new, but I hope to see more choices of viewing for it. I would recommend it to everyone.UPDATE: 11/13/2014 After having this since it came out, I have to now say, it is not very useful, practical, or cutting edge. It is far out done by the Roku 3 for one. I thought it was cheap at $39 when I purchased it, but now I think I wasted the money. To have been out for as long as it has, there are still not near enough channels or uses for it.", "verified": true, "helpfulness": "0/0", "author": "Doug Lowe"}, {"rating": 4.0, "review": "Needs screen settings and more 3rd party support, otherwise great device. I also wish the device was more open to moding.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 5.0, "review": "This really works when streaming movies and television.  Our Samsung SmartTV was supposed to do this but for reasons not clear to me it did not.  Great device.  I am looking forward to cancelling the cable TV soon as this provides alternate programming.  Hopefully, Google will enhance and expand the capabilities of this Chromecast device.  Rate high on buy!", "verified": true, "helpfulness": "0/0", "author": "ray6279"}, {"rating": 3.0, "review": "The downside is that few apps so far support it. And it doesn't cast local media.  More work is needed to catch up with other similar products.", "verified": true, "helpfulness": "0/0", "author": "Genius"}, {"rating": 5.0, "review": "I've had this for only a few days and don't know how I got by without it. I've been wanting one for a while. I do a ton of research before I buy anything. After I was convinced I could do what I wanted to do with it I ordered it \"From Amazon\" of course. I got it in two days. I plugged it in, connected to it in \"2 seconds\" really it's that fast.Chromecast is by far the easiest to setup and use.DON'T let the lack of APPS deter you from buying one, you can cast anything you can see on your device that uses Google Chrome as a browser. Very cool device this is a MUST have", "verified": true, "helpfulness": "0/0", "author": "Rfmsr2 \"if it's not here, it's not me\""}, {"rating": 2.0, "review": "Its OK but I can see why its cheap. Only YouTube and netflix. It is No Apple TV or Roku. Save your money and go for Apple TV if you have IOS device", "verified": true, "helpfulness": "0/0", "author": "tkept"}]