[{"rating": 4.0, "review": "If it also had conection with applications like Ustream, will be perfect", "verified": true, "helpfulness": "0/0", "author": "Orlando"}, {"rating": 4.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Bill Dixon"}, {"rating": 5.0, "review": "Works great. I use it for my TV in my living room and it's incredibly helpful.", "verified": true, "helpfulness": "0/0", "author": "Supaluigi62"}, {"rating": 5.0, "review": "Almost gave it one star but found out it was my wifi network. A quick restart and I was in business.Great to show off pictures and video from your phone.The family quickly switch from Android phones to a windows laptop to a Macbook Pro.Exactly what I wanted.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Did not work with the operating system on my Android tablet", "verified": true, "helpfulness": "0/0", "author": "Barbara W. Haas"}, {"rating": 5.0, "review": "This is literally my favorite purchase of 2014.  We don't have cable and used to have a Roku player.  This is SO much better than the Roku player.  Your iPhone becomes your remote.  I was worried that the resolution wouldn't be that great, but it is superb (I'm sure that depends on your internet connection speed, though).  It is fast, easy to use, very intuitive, and reasonably priced.  It's certainly the best option out there for people who don't have cable TV.  And the price certainly beats Roku or Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Dillon"}, {"rating": 5.0, "review": "Easy to install and have great premium video options...", "verified": true, "helpfulness": "0/1", "author": "Garland Collins"}, {"rating": 5.0, "review": "Excellent and handy tech gadget to have in any home. We can stream from our phones and iPad to the TV when using Netflix, Pandora, and HBO. We have had ours a while now and never encountered any problems with it. We have introduced many friends to this and they love it, plus it makes a great gift too!", "verified": true, "helpfulness": "0/0", "author": "Sharflyster"}, {"rating": 5.0, "review": "Works perfectly?!", "verified": true, "helpfulness": "0/0", "author": "S. head"}, {"rating": 5.0, "review": "Works well. arrived as described . No issues", "verified": true, "helpfulness": "0/0", "author": "Raffi"}]