[{"rating": 5.0, "review": "While some may say that the ability to buy steaming video this easy is a curse, if your responsible about it. . .well, you still may spend a lot.  Couple this ease with all of the free prime stuff (as a prime member)......after three weeks I must say it is worth it.  Just a fantastic product, works flawlessly.", "verified": true, "helpfulness": "1/1", "author": "Jeffrey C Devlin"}, {"rating": 2.0, "review": "I love the idea of a stronger and faster box, obviously. It's not worth this clunky, ugly interface. I have a Hulu, Prime, and Netflix account, but every time I turn this box on, I'm being sold movies that I don't have. Amazon, have I not spent enough money with you?Amazon doesn't segment its prime videos from the ones for purchase and rent, so watching movies is a crapshoot. The voice search would be cool, but it does't search Netflix or Hulu, just Amazon. Get over yourself. To access the movies I already own, I had to spend extra money for a Plex App that works only when it wants to.The final straw: even though Showtime Anytime is available online through DirecTV, the Amazon app just gives like 5 cable providers to choose from (of course DirecTV was not one of them).", "verified": true, "helpfulness": "0/0", "author": "Eran Hazary"}, {"rating": 2.0, "review": "When it worked I really liked it.  If you watched it for very long the box would click and then go off.  I called tech assistance and they told me to unplug and it did work for awhile.  I didn't watch it much for a week or so but when I watched it for a long period one day it did the same thing.  I returned the box for a refund.  If something doesn't work when it's new I don't want it.  I had to return it for a refund, they would not replace it. I haven't decided whether to buy it again.", "verified": true, "helpfulness": "0/0", "author": "Pam"}, {"rating": 4.0, "review": "Once they fully integrate Netflix in the voice search, and add MLB.TV and Vudu - THEN it will be perfect!  I love the instant start feature of Amazon Instant Video", "verified": true, "helpfulness": "0/0", "author": "Dan Galbraith"}, {"rating": 5.0, "review": "I bought it because I read a review in Consumers Report and it is everything they said. Love speaking what you want, it takes you direct to it. Highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Carol Raposa"}, {"rating": 3.0, "review": "I want to tell you that I am a big fan of Amazon and buy quite a bit for my Kindle, am a Prime Member and always shop the Amazon site first when I want to buy something. This review is not exactly a good one - but it is true - and hopefully someone in management will read it and consider what I'm saying. I am pretty savvy with tech stuff, but this device required help and if there had been written instructions that came with it, my initial experience with Fire TV would have been easier and happier.First, once you've decided to purchase this device, it is almost impossible to figure out what you need to buy WITH it. I finally discovered that I would need an HDMI cable, but that was buried somewhere and I only found the info by chance.Second, when I got it, there was no manual. The device isn't exactly plug and play. I did not understand how my current cable box and now this new device could be used on the same TV. I had to call support and although the tech was very nice and patient, if there had been written directions about multiple input ports and how to choose a secondary input and then find the secondary input to plug the Fire into and then how to go back and forth between different inputs, it would have been much easier and I wouldn't have had to bother the technical people.Third, when you try to use the voice commands, nowhere are you told to push the button. Maybe this is obvious to some people but not to me. Then when I finally got it to respond, every time I answered YES, the machine would ask, \"Did you say ASS?\". It was very frustrating. And then there is no manual to tell you how to select what film/video you want to watch once you get the voice to finally find what you are seeking. It just keeps repeating that it is thinking and there is no SELECT command.Fourth, trying to make the captioning work is a nightmare. It keeps turning itself off as you re-set what kind of captions you want and what size and color. The captions should become the default and stay on permanently,as frankly, if the user sets the captions for one show, they are going to want to see the captions during every film.Finally, the really startling and aggravating thing happened this morning when Amazon offered to SELL me a manual for the Fire TV. A written manual or atleast a really good FREE online manual should be made available. The color pictures and marketing pages about the Fire TV do not give constructive help. I was really disappointed when Amazon tried to sell me a guide for their own device. Thanks. .", "verified": true, "helpfulness": "0/1", "author": "B. Star"}, {"rating": 5.0, "review": "I was very impressed with the Fire TV, I have been putting off getting an Apple TV for some time and after a review by #GeekBeat I decided to order one and I was as impressed as they where from the package opening to the connection it was flawless.", "verified": true, "helpfulness": "0/0", "author": "Frank Leo"}, {"rating": 4.0, "review": "bought this so i could use XBMC on it and it works like a charm! i imagine many will come looking for something that can run it and be skepticall about buying these type of boxes (roku, apple tv, etc) but trust me this thing works!i havent used many of the things this box is really meant to do but have tried streaming amazon video on it also and its great!wish the voice recognition worked with more then amazon content but i imagine this would be hard to implement....the remote is sleek and small, i love it... very easy to use. the unit is small which you can conceal very easy. i will be getting more of these eventually when i decide what tv to purchase for my room...", "verified": true, "helpfulness": "0/0", "author": "HENDRID P."}, {"rating": 5.0, "review": "I am very impressed with Amazon Fire TV! Installing was very easy. Using it is very easy.  I am impressed with how simple this is to set up and use.One reason we decided to get this is to have some alternative to over-the-air television.  We don't have any subscription TV service and sometimes it's nice to find something different to watch.  We found some great movies to watch.  Some are new to us and others are older ones we've forgotten about.  The variety offered is good and we can always find something to watch.Set up was simple.  Plug it in, turn it on, follow the prompts.  I'm usually \"challenged\" with installations and set-ups, but this was no problem whatsoever.  I had this going in just minutes.  One thing I did do was take the time to learn how it all works before watching anything.  It's simple and I don't need my grandchildren to help me!This is a good deal, especially with Prime.  There are a lot of movies and shows that are included with Prime.  I haven't rented or bought anything yet, but in browsing, the prices seem reasonable.  There is a good variety of movies and TV shows so it shouldn't be difficult to find something that interests everyone.  I like the British shows and I have found some I have never seen.The voice search is awesome!  While I haven't had this for very long, the voice search has worked perfectly every time I have used it.  Most voice-controlled gizmos have problems, but this has come up with exactly what I say every single time.  Fire TV can be searched by typing in what you're looking for, which works well, but the voice search is so much easier especially because of it's accuracy.  The \"typing\" process on the remote is okay, but the voice search is so much better.  Amazon took the time to make sure Fire TV is a very good product.Yes, I would highly recommend this!  You buy the \"box\", set it up and go. You can buy/rent various movies and shows, but with Prime membership, there is a lot available at no extra cost.", "verified": true, "helpfulness": "0/0", "author": "Irish Eyes"}, {"rating": 3.0, "review": "I like the Fire, my wife isn't quite as enthusiastic.It is sometimes difficult to find a show to watch, it is very slick if you know exactly what you are looking for, not so much if you are just browsing.The television ads are EXTREMELY misleading - I am a prime member (have been for years) and my wife saw the ad that talked about all the movies/shows that are available for prime members - the inaccurate implication being that they are included with your prime membership - NOT true.A SMALL subset of the movies/shows are included/free with your annual membership, the vast majority are rather high cost rentals.  Sad to say, if you are interested in watching a couple of movies per month, there is a very good chance that a Netflix subscription is going to be a better deal.", "verified": true, "helpfulness": "0/0", "author": "Armando Menendez III"}]