[{"rating": 3.0, "review": "I'm about done with this thing. When it works, it works great. But OFTEN it just doesn't show up in my Netflix app. I have to restart my Nexus, the chromecast or both. Or it loses connection so that trying to pause becomes extremely frustrating. For my purposes, just casually watching a movie, it turns in to a thirty minute frustration. Roku boxes in our house never have these issues.", "verified": true, "helpfulness": "0/0", "author": "Anonymouse Amazon Customer"}, {"rating": 3.0, "review": "The device works alright most of the time when casting, but sometimes we pause on our device app and the video continues to play on the television. Also, it isn't unusual for the Chromecast app to show that there are no Chromecasts available, so we have to unplug the device and plug it in again to refresh. It's a bit frustrating. I thought I could use the Chrome browser app and cast from it, but either I'm wrong or I just can't get it to work. Too bad....it was a great concept aside from the fact that I have to use my mobile device.", "verified": true, "helpfulness": "0/0", "author": "LegsDiamond"}, {"rating": 5.0, "review": "You can do alot with this little device! And there is a work around to watch Amazon videos (although this may change in the future where you will not need a work around) this can do a lot with little effort, and it looks great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Murlo\""}, {"rating": 5.0, "review": "This thing works really well. Getting it set up with the wireless router was really simple, and I've not had any problems with it, in the 6 or so months I've been using it. With more sites adding Chromecast compatibility, it keeps getting better.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Phillips"}, {"rating": 5.0, "review": "I fricking love this little thing! I used to watch Netflix/Hulu+ on my PS3, but it was just SO noisy. Trying to hear the TV over the noise of the Playstation was a pain. This is so much easier and quicker, I just turn on the TV, look for what I want on my phone and go! It's also nice that I can easily take it and move it to another room/TV if need be. I would recommend DEFINITELY plugging it into the external power source using the included plug, rather than plugging the USB directly into the TV, because one of my TV's shorted out and wouldn't come back on for several minutes!", "verified": true, "helpfulness": "0/0", "author": "Emily McIntosh \"M.\""}, {"rating": 5.0, "review": "For $35, you can't afford NOT to buy one.  It just makes everything easy.  We send the chrome browser tab to the TV when we all want to see a webpage, or send a play store movie when it's time for a rental.  Works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Nathan Smith"}, {"rating": 5.0, "review": "I bought one for myself and one for my mom, too.  She actually hooked it up by herself and she is 69 years old.  Of course, my mom is probably more tech savy than yours, but I am just filling you in on the ease of installation!", "verified": true, "helpfulness": "0/0", "author": "MADARCHITECT"}, {"rating": 4.0, "review": "I bought this because it was supposed to be able to cast Netflix and I didn't want to buy another Roku 3 which I have now ended up doing since I couldn't cast Netflix.  I searched online for possible solutions for the first two days that I had it, tried them but none worked.  I searched online again tonight and I found one which stated that you must make sure that both the chromecast time and the tablet time were exactly the same.  I reset the time on my Samsung Galaxy Note 8 to the exact same time as shown on the chromecast, and tried Netflix again and it now works!  However, I found that if I wanted to pause the video, unlike Youtube, I had to stop casting to the chromecast and set it to show on the tablet.I had a hard time setting up my laptop to cast as well - laptop would not see it at first, then had to setup my router to allow multicast and then it did (you don't get these instructions either).  Now that I've got it to work it works well, but it's a pity that such a simple thing should cause so many problems.  You can't turn it off either or you will have to set it up all over again.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This item is great, you can mirror many things from your PC and play videos from phone or tablet (any brand) can say works better that apple tv with lower cost, the only thing is you need other like pc, iphone, android... to make it work", "verified": true, "helpfulness": "0/0", "author": "Luis Garavito"}, {"rating": 2.0, "review": "There are some features about the Chromecast that need refining.If you do not have a dedicated wifi connection, you cannot simply useyour personal 4G hotspot. You must have two 4G or similar devices and\"rob Peter to pay Paul,\" that is, you must connect one device to the other.It is too complex and barely worth the effort.  The Chromecast also creates a faux wifi network signal in the household that is confusing to guests whomay wish to connect to your network. It also gets quite hot, and I feel like I need to unplug it to be safe. It is inconvenient.", "verified": true, "helpfulness": "1/1", "author": "Miss K."}]