[{"rating": 5.0, "review": "Awesome, prefer over roku.  It helps that I have an ipad.", "verified": true, "helpfulness": "0/0", "author": "Randal Glaser"}, {"rating": 5.0, "review": "Work as it should... great item", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "S. Joseph \"S Joseph\""}, {"rating": 5.0, "review": "If you stream content to your TV this is a must have device.  In my experience it actually shows the movies/content better than using a native app on a smart TV.  This little device allows you to turn any TV with an HDMI input into a smart TV.Apps that I use regularly:  HBO GO, Neflix, Hulu Plus, MLB.TV, Googe Play Movies, Google Photos (to show off photos on the big screen).Apps that are Missing:  AMAZON PRIME MOVIES.", "verified": true, "helpfulness": "0/0", "author": "jbecu"}, {"rating": 5.0, "review": "fast, no problems", "verified": true, "helpfulness": "0/0", "author": "Joaquin Encinas"}, {"rating": 5.0, "review": "This device has basically changed my life. It's now the most used item in my home. I use it to stream Netflix, HBO, Hulu, my personal media collection, music, etc. I can even use it to watch Twitch using an app on my phone. Anyone that watches a lot of Netflix and has a smartphone should invest in one.", "verified": true, "helpfulness": "0/0", "author": "Cameron Bates"}, {"rating": 5.0, "review": "We mainly use it to broadcast stuff from our computer to our tv and we love it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Picture is very sub satisfactory", "verified": true, "helpfulness": "0/0", "author": "Bob Wade"}, {"rating": 2.0, "review": "I must be doing something wrong.  I can't use Chromecast with my Verizon VZ manager and can't find a work around.  I'm given messages to uninstall my VZ access to use the chromecast, but without VZ, I don't have internet.  Turned out to be a waste of money for me.", "verified": true, "helpfulness": "0/0", "author": "M. Delgado \"MellyMae\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Lisa Fate"}]