[{"rating": 3.0, "review": "If you primarily watch or listen to Amazon content it's not a bad unit and works fine. Trying to watch Netflix is a chore and you can forget about watching or listening to anything you have on Google Play, (apparently Amazon doesn't want you using Google).The ROKU is much more user friendly and also supports Google Play, Amazon and hundreds of other content.", "verified": true, "helpfulness": "1/2", "author": "M.A. Smith"}, {"rating": 5.0, "review": "Used a friends. Really liked.", "verified": true, "helpfulness": "0/0", "author": "Liz Whelan"}, {"rating": 5.0, "review": "The Amazon Fire Tv is definitely our families favorite electronic device! We love being able to watch all of the free movies for Prime Members and also the PBS Kids app!  It is super fast and we haven't had any problems using it to watch Netflix almost daily for about 6 months.", "verified": true, "helpfulness": "0/0", "author": "J. Feinberg"}, {"rating": 3.0, "review": "Amazon deceptively posts different video formats you can view on this device, but there is no way to view them. They have disable the USB port, and there is no chance of accessing any media files over your home network.  Some people have posted about \"rooting\" their device to expand it's functionality (hey, I paid for it, I should be able to do what I want with it), but Amazon has actually written into the latest firmware, if you try to downgrade the firmware or root the device, it will brick it, meaning you'll have a $100 paper weight.  If you are looking for a basic Netflix viewer, than this is your device, but if you are looking for anything else, look for a different device.Update: If you use the Plex app with a Plex server, it adds much more functionality to this device.", "verified": true, "helpfulness": "7/9", "author": "DAVID JAMES OHMANN"}, {"rating": 5.0, "review": "If there's a good reason and an option for cord cutters, this is it. Netflix and now amazon have provided streaming TV for those of us that hate cable and the unwanted useless channels being forced upon us that only do we pay for, but we also are forced to watch commercials on those unwanted pay channels that WE PAY FOR.But here's one fundamental problem : internet service providers driven by greed have decided to imposed usage cap limits and usage-based billing on all internet users. ISPs claim that network congestion has made networks strained and traffic during peak hours is high that this is needed. The reality is that since the United States has either duopolies or monopolies either Comcast, AT&T;, Verizon, or Time Warner, there is really no real competition and no incentive by these companies to invest in more broadband deployment everywhere. Instead, these corporations driven by greed are trying to milk and dime for using the internet.AT&T; for example, has a monthly cap on their DSL which is 150 gigabytes charging an additional $10 for every 50 gigs you go over. Now I don't have a problem with this but keep in mind that for a 6MB speed connection, I pay $45 a month. Explain to me how this is good.The Amazon Fire is a great unit but because the video quality is delivered very good or high, however, if your ISP network is congested with many users, your connection can be throttled at anytime unknown to you which can degrade video quality.I will say though that if anyone can change the video home entertainment and TV landscape, Netflix, Amazon and Google are leading the way. HBO, CBS, and other networks will soon join the roster. Cable TV unfortunately is a dinosaur that needs to go away. Cord cutting is making that happen and its about time too.The other thing you all need to know about this device is that it NEVER shuts down. It is always on, always running, and always downloading or updating itself and it's library 24 hours a day. This may not be an issue for those of you that do not have a metered broadband cap in place, but those of us who do, the constant downloading does add up.Amazon needs to add the software option on this device to be able to shut it down.For now, I highly recommend unplugging the unit to conserve your bandwidth.", "verified": false, "helpfulness": "0/0", "author": "L. J. Nova"}, {"rating": 5.0, "review": "Quick easy setup...does what it says...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bought this to replace cable TV, and love it!  There are apps for local channels, plus hulu, netflix, crackle, and others.  My husband was skeptical at first, but he loves being able to watch our favorite shows at our convenience without long commercial breaks every few minutes.  The unit was very easy to install (literally a power cord and an HDMI cord- not included) in minutes.  The picture is true HD quality, and the box has no problem picking up the wireless signal from the other end of the house.  I would highly recommend this product for people who love the convenience of streaming TV shows at their convenience.", "verified": true, "helpfulness": "0/0", "author": "J. McMahon"}, {"rating": 5.0, "review": "This thing is great!  Like other reviewers, I've owned other streaming boxes which were ok, until I got this one. Amazingly fast - how it SHOULD be. Great product.", "verified": true, "helpfulness": "0/0", "author": "Kaz"}, {"rating": 2.0, "review": "I am unable to download the netflix app, which is 50% of why i bought this. And the voice feature does not work within apps such as hulu. It is probably the fault of the app developers, but I think i will send it back. My PS3 does a better job with TV.", "verified": true, "helpfulness": "0/0", "author": "anurafan"}, {"rating": 1.0, "review": "I would like to know the difference between the stick and the box...", "verified": false, "helpfulness": "1/10", "author": "yamira"}]