[{"rating": 5.0, "review": "I used it in conjunction with running the Netflix app to stream content.  Very easy to configure and get up and running.", "verified": true, "helpfulness": "0/1", "author": "Matthew Ralston"}, {"rating": 4.0, "review": "Do the job for youtube, netflix , would be great if we can tansmit via the wifi router -tablet photo, video ect.", "verified": true, "helpfulness": "0/1", "author": "Claude Lafleche"}, {"rating": 5.0, "review": "I gave two of these to my mother and father; they love them! Streaming through this little gadget is much faster and more pleasant than through the old blu-ray players. It's really a treat to play with... no wonder they're always sold out at Best Buy!", "verified": true, "helpfulness": "0/0", "author": "RYAN W STAGG"}, {"rating": 1.0, "review": "Cheap product, so no big loss, but this thing is worthless.  I should have read the functionality closer.  I use ipads and iphones, and while it does a few apps, not many useful, and nothing works unless it is playing on the ipad/iphone first.  Can't even do photos?  Really?", "verified": true, "helpfulness": "1/2", "author": "P. Ward"}, {"rating": 3.0, "review": "Did not work w/Android tablet - worked fine w/IPhone 4 and Galaxy S4. Limited content - but a 1--time purchase of $35 made it worthwhile. Bought to add Wireless to an older HDTV so that in laws could watch Netflix.", "verified": true, "helpfulness": "0/0", "author": "marttski"}, {"rating": 5.0, "review": "works seamlessly with youtube and Google music. such easy setup and perfect performance. plug in and enjoy! anybody can use.", "verified": true, "helpfulness": "0/0", "author": "Brad"}, {"rating": 5.0, "review": "For $35 this purchase is a no brainer. I ordered this the day it was announced, received it 2 days later with prime shipping and have used it every day since then with absolutely no problems.  When the device was first introduced it worked with only certain Google Apps and Netflix, but now its compatibility has expanded to many other services like HBOgo, HuluPlus, Pandora, Plex, Avia, ReadyPlayer, and many more.  It's easy enough to set up, that I take it with me when i go to friends houses or on vacation, and honestly use it more than I watch cable TV anymore.  If I had more than one TV in my apartment I'd buy one for each TV I would own,  Do yourself a favor an go ahead and place this order, you wont regret it!", "verified": true, "helpfulness": "0/0", "author": "K. Youngs"}, {"rating": 5.0, "review": "After I plugged it in I was able to stream from the Utube app and the Netflix app directly without any problems and with great video image in less than 5 minutes.  The delay is due to the Chromecast updating its software.  I have it plugged into a Yamaha V-671 amp so I can switch from cable to DVD to Chromecast using the Yamaha remote, which I use anyway to control sound (or the Yamaha app).  Connection is through our wireless network.  The router is in a different room, without line of sight, but this does not seem to affect the quality of the video or sound.  No buffering issues at all.  The installation instructions appeared on the TV once I chose the right HDMI input on the Yamaha amp.  I cast from an ipad (without cellular connection) and a Droid Maxx phone, both worked equally well.  Given the negative comments I read last year about limited performace, I am very pleasantly surprised.  This little gadget does what it should, and it does it well.  Cudos to Google.", "verified": true, "helpfulness": "0/1", "author": "Roadmap"}, {"rating": 5.0, "review": "Does exactly what it's supposed to do, and streaming videos from my computer through my Chrome Browser is the nicest touch of all!Side note to all Verizon Fios customer: If FIOS is your internet service provider you will need to change your WIFI settings in order for Chromecast to properly connect to your network. You can find the fix here: [...]", "verified": false, "helpfulness": "0/0", "author": "Jess V."}, {"rating": 5.0, "review": "This little gadget is a must have item.. yes you can buy a smart TV but hey some people actually have a regular HDTV along with their smart TV. Its cheap, easy to use, easy to setup, and I control this this with so many devices. I can be anywhere in the house and be connecting to this thing. I'll be buying a few more for testing purposes.", "verified": true, "helpfulness": "0/0", "author": "norestone"}]