[{"rating": 3.0, "review": "It's a nice idea, but I'm not too crazy about it. There's no smart phone app like there is for WDTV, Roku, Apple TV etc... and the UI can feel a bit awkward at first. I'd suggest just going with a Chromecast, unless you really want the Amazon video service, in which case get a WDTV or a Roku.", "verified": true, "helpfulness": "0/0", "author": "rtz2rbbl"}, {"rating": 5.0, "review": "seems to be excellent....lots and lots of movies and TV series we never watched as some were on the pay channels we did not subscribe...I bought one for my son and the game controller.", "verified": true, "helpfulness": "0/0", "author": "craigS"}, {"rating": 4.0, "review": "lacks some channel apps I have on my competing device.  I hope they get added soon.Interesting difference between the Amazon Fire TV app for ESPN and Roku.", "verified": true, "helpfulness": "0/0", "author": "Tony Kay"}, {"rating": 4.0, "review": "Love this product. Only 4 stars because I still have to use Dish for network and certain other channels. As Amazon makes deals I can see me becoming more dependant on this and less on satellite. Product is very easy and intuitive. Even a cave man can do it! I am using the optical port for sound (into my surround system) and HDMI for picture (into my TV). I do that because all of my HDMI in ports on my surround system are already taken up with other items.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Great device but until Amazon puts the play store in it even my kids wont play with it very long. Needs more games.", "verified": true, "helpfulness": "0/1", "author": "luca88"}, {"rating": 1.0, "review": "My most worst experience with Amazon Prime!  I was offered Amazon Fire TV as a Prime member on a free 30 day trial, but was immediately charged the full price.  In trying to resolve I got the run around via off shore call centers with no resolution.  Very disappointing Amazon!", "verified": true, "helpfulness": "2/13", "author": "JAK"}, {"rating": 5.0, "review": "I will start off as i am not a tv guy. I watch hockey and on dvr for that matter as i dont sit idle well but i find myself becoming a couch potato. My family and i have essentially stopped watching cable and have been running on prime and youtube for 3 weeks. Never have connection issues and system remembers wifi addy even after power outtages. Another reviewer mentioned that you cant tell what is prime, well there must have been an update bc the movies ahve the HD and Prime banners in the upper left hand corners.This product is great but i have to buy another one as 4 year old girls and 6 year old boys do not want to watch the same programs.", "verified": true, "helpfulness": "0/0", "author": "gino"}, {"rating": 3.0, "review": "Cons: It's constantly resting its self It freeze's in the middle of movies some times The battery's in the remote die quickly Sometimes it wont even turn on I have to unplug it and plug it back in to reset it and make it start.No VUDU app at all.Pros:Easy to hook upGreat high quality HD 1080iEasy to use softwarekids love the games.", "verified": true, "helpfulness": "3/3", "author": "Swauss"}, {"rating": 5.0, "review": "Excellent, excellent, excellent!  Responsive, fast, great, great audio and high def video, bottomless, endless movies to watch for free.", "verified": true, "helpfulness": "0/0", "author": "Professor Davenport"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/1", "author": "Aguedo R."}]