[{"rating": 5.0, "review": "Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"joey nguyen\""}, {"rating": 5.0, "review": "I'm an old fart so streaming in new to me and this thing has opened up that world and doesn't seem to push any particular product down your throat.  Sets up easy as pie.  Works great and if any issues, like all things electric nowadays, unplug the power and then power it back up.", "verified": true, "helpfulness": "0/0", "author": "Robbothehut"}, {"rating": 5.0, "review": "Freezes sometimes. Rarely. Otherwise gr8.", "verified": true, "helpfulness": "0/0", "author": "regular_reviews"}, {"rating": 3.0, "review": "I'm not really impressed by this.  Sure you \"cast\" things from your Google devices to your TV, but everything has to be done from another device, it doesn't do really anything on its own.  I would suggest the Kindle Fire TV, or Roku versus this product.", "verified": true, "helpfulness": "0/0", "author": "Geoff P \"-Geoff\""}, {"rating": 5.0, "review": "works great  no instructions  get them on  u-tube", "verified": true, "helpfulness": "0/0", "author": "louis testa"}, {"rating": 5.0, "review": "We are enjoying the Chromecast. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Robert Lucas"}, {"rating": 4.0, "review": "This is really good for something simple to cast from phone or laptop, so far when it works it works great, but it often disconnects from netflix on my phone and has to be restarted.", "verified": true, "helpfulness": "0/0", "author": "Kate D."}, {"rating": 5.0, "review": "Me an My family love it! Thnks", "verified": true, "helpfulness": "0/0", "author": "Rashunn Lewis"}, {"rating": 4.0, "review": "The Chromecast is a lot of fun when I'm entertaining people, and we all want to share online videos.  When it comes to general streaming (Netflix, Amazon Prime, etc,) I stick with my PS3, or just watch from my laptop.  Certainly worth the $35!", "verified": true, "helpfulness": "0/0", "author": "From Detroit"}, {"rating": 4.0, "review": "Would give it a 5star were it not for the  rebooting and the casting lags.", "verified": true, "helpfulness": "0/0", "author": "Maynard"}]