[{"rating": 2.0, "review": "So I have had the Amazon Fire TV for about three weeks now and at first it was amazing and ran like a dream. As of late, it has slowed way down and gets horrible jitters when I am in the Netflix App. I really wanted to love it because we already have Apple TV and weren't very impressed with the interface. As far as the interface and look, Amazon Fire takes the cake but as far as performance Apple TV still seems to be number one our household. Then again, I have always been disappointed with Android based technology because it works beautifully for a little while and than takes a huge dump. Maybe an update would help, who knows. Review updates after a few months.", "verified": true, "helpfulness": "1/2", "author": "gabbyj"}, {"rating": 2.0, "review": "the unit died out  1 month after the warranty  period has expired.a call to amazon customer service for fire tv did not resolve the issue, they said they would call me back and never did.what can one expect to do if the unit is not functioning anymore??  amazon service was not up to par in this case,.it seems like there is nothing one can do if the unit is not functioning....", "verified": true, "helpfulness": "0/0", "author": "robreview"}, {"rating": 4.0, "review": "Streaming startup is fast, sound quality is great, and remote is easy to use. If VUDU app was included, I would give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "MC"}, {"rating": 5.0, "review": "Super awesome easy to use! Tons of great shows n movies! I have one on all of my tv's :)", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 4.0, "review": "So far it's up to my expectations,  there are so many options I haven't had time to experiment on all the items and features.  But it seems to be something that I would be very happy with", "verified": true, "helpfulness": "0/0", "author": "Dave Grimm"}, {"rating": 5.0, "review": "i give it 3 stars cause the last fw update broke usb port not working anymore....... 6-7 months it's working perfect before the last update.... wait and see how they're going to fix it.... i have 3-4 months on my warranty left..... it's the shame the best device in the market until they(dev) screw up.update..... after read more at aftv forum web site to turn off usb debugger mode..... everything work again so it's 5 star for me.", "verified": true, "helpfulness": "0/1", "author": "V. Nopachinda"}, {"rating": 5.0, "review": "great option", "verified": true, "helpfulness": "0/0", "author": "bigdon_52"}, {"rating": 5.0, "review": "It works well as expected.", "verified": true, "helpfulness": "0/0", "author": "Emmanuel Agboola"}, {"rating": 1.0, "review": "Bought is as add on to use mostly for the gaming part. Games did not work. Constant spinning screen.", "verified": true, "helpfulness": "0/1", "author": "bryan"}, {"rating": 1.0, "review": "After 3 months the remote stopped working, changed the batteries but to no avail.", "verified": true, "helpfulness": "0/1", "author": "Rosalind Williams"}]