[{"rating": 4.0, "review": "The product itself is great. But I think it is a bit over priced. I will weigh the pros and cons.Pros: It quickly streams apps like Netflix, Hulu Plus, Watch ESPN, etc.  All of these apps can be saved onto the Fire TV itself, so you don't have to waste space on your phone or tablet by downloading all these different apps to watch.  Switching from app to app is ridiculously fast and smooth.Cons: You have to have an Amazon phone or tablet if you want to fling things to the Fire TV other than the apps that are already loaded onto the Fire TV.  I own an iPhone and an iPad! And I cannot fling regular websites content to the Fire TV.  This is compared to the Google Chromecast in which you can fling anything from any website or app except for Amazon content.  Also, the voice search only searches from the Amazon content.  Even if you are in your Netflix app and you search a movie, it only shows you results from Amazon Prime.  Lastly, it is a bit over priced.If I had to choose between the Fire TV or Google Chromecast, I would pick the Chromecast without hesitation because it is nearly a third of the price, and it does most of the same things.", "verified": false, "helpfulness": "1/1", "author": "Daniel"}, {"rating": 4.0, "review": "Pretty decent device. Seems to have some trouble with first time setup when connections via ethernet and wireless are both available. Disconnecting the ethernet cable resolved the problem though.", "verified": true, "helpfulness": "1/1", "author": "Julio"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Debbie Hunsaker"}, {"rating": 5.0, "review": "Love this tiny little box!", "verified": true, "helpfulness": "0/0", "author": "Gerry"}, {"rating": 5.0, "review": "Love it and great streaming device.  Clear picutes and easy to use", "verified": true, "helpfulness": "0/0", "author": "Dennis W. Pagel II"}, {"rating": 1.0, "review": "So I bought this for Christmas and I had the idea to cancel my Direct tv service, it looked great. When Christmas came around and I got my next months satellite bill I called and cancelled it. I set this up and it seemed to work okay. But then every show on Netflix we would have to get up and remove the HDMI cable, and reinsert it. EVERY SHOW. Hulu plus was a JOKE! It would do one of two things, it would stay on a picture with the voice going or the screen would go black with the voice. So after reading all the reviews and checking troubleshooting, it said to reset it, so I did and no luck, then it said to change HDMI cable, so I did that,  no help, (it shouldn't have trouble with the wifi it is in the living room with it maybe 20 feet away from the router.) I tried it on other tv's in the house (we have the stick which works flawlessly) and it did the same thing. What a headache! It would also throw off the internet. Anyhow I chatted with Amazon and they finally agreed to send another i was hoping it would work. NO LUCK what so ever. Right from the start netflix needed to be reset with the hdmi cable and hulu plus was a joke. I had seen other people say they had a Roku and it worked flawlessly compare to this. So I ordered one. I received it today and couldn't be happier, you can watch local channels, and it feels funny not getting up to take out the HDMI cable and reinsert it every 22 minutes. It has so many more channels including Horoscopes. It is fun and excited and now I will not miss my satellite service again. If you are having that problem please get a Roku and if you are one of the lucky ones that this works great for, good luck.", "verified": true, "helpfulness": "15/15", "author": "Kindle Lover \"Mom of 4\""}, {"rating": 5.0, "review": "So in love with this. The best 99 dollars you will spend.", "verified": true, "helpfulness": "0/0", "author": "Mike Snedegar"}, {"rating": 5.0, "review": "Love the amount of Prime eligible movies and T.V. shows.  Great interface and the bluetooth remote is magic!  Hooked this in through my receiver then to the T.V. for great sound.  We have HBO so the HBO interface is great to see content from there directly from this.  Only wish my internet was more stable as it stumbles on occasion but I think that Verizon is the issue not the unit.  Uploaded photos to Amazon cloud and we can look at our favorite pictures on the big screen or use it as a slide show.  We haven't used any of the games or apps, hopefully the library Amazon has will be consistently getting larger so that is something to look forward to.", "verified": true, "helpfulness": "0/0", "author": "WayneO"}, {"rating": 1.0, "review": "Really like the firetv at first. I've had mine since October 2014. Back then it worked perfectly. Now, I'm having issues steaming Netflix and Hulu. The firetv will load up, then stop at 99%...then a pop up message will say that it is unable to play the selected video. Only time I really use it is when I use Kodi, other streaming services I use my smart tv.", "verified": true, "helpfulness": "2/3", "author": "jball63"}, {"rating": 5.0, "review": "Love this thing.  Best money we ever spent.", "verified": true, "helpfulness": "0/0", "author": "Toni C. Steedly"}]