[{"rating": 5.0, "review": "Works Perfect!!!!!", "verified": true, "helpfulness": "0/0", "author": "Robert Monroe \"Rob\""}, {"rating": 5.0, "review": "Works great", "verified": false, "helpfulness": "0/0", "author": "Funfun11"}, {"rating": 5.0, "review": "Best thing ever", "verified": true, "helpfulness": "0/0", "author": "Jess"}, {"rating": 2.0, "review": "Casting from a video on a Chrome page sucks. Even fully buffered and with great wi-fi in your house, the video from the browser apparently has to go half way around the world (to Google) and back before showing up on your TV. Predictably, this results in so much stuttering, lag, and image freezing, as to make things unwatchable.For apps specifically Chromcast-enabled (but not the Chrome web browser), it works ok. My guess is that those apps can avoid putting the entire internet between your PC and TV.", "verified": true, "helpfulness": "0/1", "author": "Runnergirl \"Magic book mom\""}, {"rating": 1.0, "review": "Signal drops constantly. I have to unplug it and plug it back in to get the casting icon on any of my devices (ipad, iphone, Macbook and  Android tablet, all have same problem).  Not at all convenient. Spend the extra $20 and get a Roku. I am returning mine.", "verified": false, "helpfulness": "1/2", "author": "Crane"}, {"rating": 2.0, "review": "Pretty poor performer. Serious lag when trying to cast anything with a chromebook. Not good for much except still pictures or text.", "verified": true, "helpfulness": "0/0", "author": "jefflang"}, {"rating": 5.0, "review": "I have had this for almost a year and we use it 16 hours of the day every single day. We use this instead of cable. We can watch full episodes from the channel's website and cast the episode to the TV from Chrome browser. A $35 item has saved us $150 a month. I would recommend this to anyone.", "verified": false, "helpfulness": "0/0", "author": "Amanda McCormick"}, {"rating": 3.0, "review": "Utilitywise Chromecast is more of a miss than a hit. But price wise it is a hit. I have a Blueray player to compare this chromecast with for online streaming. Both the blue ray player and Chromecast are connected with the same wifi with a router 2 feet away. Chromecast streaming stops every now and then for youtube (sometimes have to restart 3-4 times to watch 1 hour video) and Netflix streaming  (used android phone) where as Blueray player has smooth streaming (has never stopped while streaming). Also, my RCA tv's usb power port gets very hot when powering Chromecast. For that reason, I used provided wall charger, in which case I have to unplug every time I am done using Chromecast. Yes, I can leave Chromecast on but Chromecast does not have sleep function when TV is off and I am concerned because Chromecast gets really hot. So for me Chromecast is neat concept with a lot of improvement needed to be done (especially streaming stuttering is very frustrating).", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great for using in rooms where cable box is not present & for ESPN 3 during March Madness!!", "verified": true, "helpfulness": "1/1", "author": "Jacquelyn N Hutchings"}, {"rating": 4.0, "review": "Only wish Amazon instant video had the option to Chromecast.", "verified": true, "helpfulness": "1/1", "author": "steven garcia"}]