[{"rating": 5.0, "review": "Fire TV is terrific. If I had known about it, I would not have gotten Direct TV.", "verified": true, "helpfulness": "0/0", "author": "Lee Elowe"}, {"rating": 5.0, "review": "I love my Fire TV. I have to say I don't get to use as much as I'd like to but my husband and son like racing cars. The games are cool. My son is 4 and thinks it's fun to wreck. I do wish there were more free games but there are so many games already. Still trying to figure out if I'm getting rid of cable or not or just buy more Fire boxes.", "verified": true, "helpfulness": "0/0", "author": "Tonya Chubb"}, {"rating": 5.0, "review": "Simply the best! Better than all the rest", "verified": true, "helpfulness": "0/0", "author": "ben"}, {"rating": 1.0, "review": "I was disappointed that most of the shows I want to watch need further payment even though I am an amazon prime member.", "verified": true, "helpfulness": "0/3", "author": "Marybeth Frantz"}, {"rating": 5.0, "review": "I didn't realize it didn't come with an HDMI cord, but that was probably my fault. love it!", "verified": true, "helpfulness": "0/0", "author": "nadya spice"}, {"rating": 5.0, "review": "Coll!", "verified": true, "helpfulness": "0/0", "author": "J. MCKIBBEN \"aka joshtinpowers\""}, {"rating": 5.0, "review": "I'm obsessed with my Fire TV. Unfortunately, all of my friends can testify to my obsession because I talk about it all the time", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "Excellent device", "verified": true, "helpfulness": "0/0", "author": "arturo"}, {"rating": 4.0, "review": "I like it, but some of the third party apps are so, so. This is really only great for Prime stuff.", "verified": true, "helpfulness": "0/0", "author": "Kyle Lyon"}, {"rating": 5.0, "review": "An excellent replacement for my AppleTV. The only thing missing is a dedicated app for streaming from my Synology NAS, but that's not Amazon's fault, it's Synology's.", "verified": true, "helpfulness": "0/0", "author": "C. Ezell"}]