[{"rating": 5.0, "review": "This was a great idea. I watch netflix, hulu, and youtube, and this has all that plus pandora. Even though I have all that built into my TV, I hate to use them because they are so slow. The chromecast is very quick and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Richard Sugg"}, {"rating": 1.0, "review": "First off, I am a recent cord cutter.  I purchased a Roku 3 and we use that for most of our TV viewing which replaced our Xbox 360.  After using the Roku for about a week and discovering that we were not able to stream many of the shows that say they are free(sorry, free means no money, not a 1 week or month trial before you have to pay), I decided to get this so we could actually stream videos from the web.I get this and install the app and plugin on my phone/tablet/laptops and start streaming.1.  Streaming from any Chromecast supported app is great!2.  Streaming from a web browser is HORRIBLE!  We got maybe 480 at best, no where near HD and it stuttered constantly and I ended up using an HDMI cable on my laptop to stream instead.I have decided to keep this even thought it doesn't perform as well as expected in anticipation of more apps getting added to their support app list and I can still stream wirelessly from a browser.  If you watch one of the 8-10 apps that are supported, this is a great device.  Sadly, I can stream all of them via my Roku that are supported by Chromecast.Basically, if you want to stream video wirelessly from your laptop, this will do it but not very well.  If you want to get great picture, step up to a Roku, even at triple the price, you get so much more for your money.", "verified": true, "helpfulness": "0/0", "author": "Doug W \"fisduki\""}, {"rating": 5.0, "review": "Awesome product... Very simple to setup and use. Can now watch Youtube, Netflix etc..Best $35 I've ever spent... Great job Google!", "verified": true, "helpfulness": "0/0", "author": "Khaled"}, {"rating": 3.0, "review": "When I received this as a Christmas gift this year, I was very excited to have something cheaper than an Apple TV box that allowed me to do much of the same content consumption. What I've found out over the last 4 months is that it is basically useless for my devices and content. The app to setup the device works great on an iPad, but you can't play movies or videos from you iTunes library. It doesn't have support for casting from the Amazon Prime video player. It rarely works with Netflix. So basically I can stream music from Pandora or watch YouTube via their associated iPad Apps, but that's about it. Right now I'll have to rate it as ... Meh. I'm a gadget guy and an Electrical Engineer. This device is ok, but it's not great. If your content is all on Google Play, and you use Android devices you'll probably be much more satisfied than Apple users. If you like things to work out of the box seamlessly and you have Apple devices, Apple TV should be your choice.", "verified": false, "helpfulness": "0/0", "author": "Banjo Bobby \"brotherbobby\""}, {"rating": 5.0, "review": "For $35 you can't go wrong. It will broadcast just about anything from Chrome or directly from YouTube and other apps. I'm sure the number of apps will increase dramatically.", "verified": true, "helpfulness": "0/0", "author": "USNA 70"}, {"rating": 5.0, "review": "This is the ONLY way I watch TV now. LOVE using my phone as the remove for Hulu, Netflix, and YouTube.", "verified": true, "helpfulness": "0/0", "author": "Scott Foust"}, {"rating": 3.0, "review": "I am not very fond of this item as it is difficult to navigate. It is hard to shut it down, and it definately a pain when your phone is set to auto lock after a short time period. I would buy a Roku in the future. I am actually considering selling this and going with the Roku as it is very frustrating.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Use with IPAD! works great easy to set up. Compatable with netflix and any other program to my knowledge. Get the PIC on the TV/monitor screen for full size viewing.", "verified": true, "helpfulness": "0/0", "author": "steves"}, {"rating": 5.0, "review": "i bought the chromecast with the specific intention of using it to stream from my nas media library. i waited until recently to get one because i wanted to make sure the android apps were available to meet my needs. as it turns out, i found two apps to do this perfectly: NAS Cast ($1.67) and LocalCast (free with paid ad removal). now i can stream all my local content without having to fire up the ps3!as an added bonus, i received my chromecast on the first day of the coachella music festival, which was streamed live all weekend on youtube. using my chromebook, i cast the youtube live feed to the chromecast and enjoyed free, live music all weekend!ok, bottom line. everyone interested in a chromecast has a pretty good idea of what it can do. with the potential of this device, the price tag makes it an easy choice over roku, wd live, or appletv. i'm considering adding one of these to every tv in my house! the cost of a couple more is about the same as i used to pay every month for cable tv, and with the ever-increasing compatibility of the chromecast with media sites and services, this thing could very easily become the main media delivery device in my home.", "verified": true, "helpfulness": "1/1", "author": "Tim Wachter"}, {"rating": 5.0, "review": "I love this thing, doesn't fall short in any way. any IOS device can cast videos to this and with apps like Plex I'm able to send videos to any tv. The best part is that I don't have to navigate with a remote and type in my password with one of those awful d-pads. I stay signed on my phone and I can send it to the tv. I can cast music from google play music (music I uploaded to google servers (no monthly fee)) pandora or any other app to the tv within seconds. It's so freaking simple I'M IN LOVE WITH IT! This sends the url of the media to the device and the chromecast pulls it from the internet. So If you want to watch a youtube video you found on your phone you can start it then turn off your phone. The video runs as smoothly and clearly as you internet connection allows. It isn't choppy and blurry like you would see with an apple tv. set up takes no time at all and it's so simple to use. Couldn't imagine how this thing could be improved. All sorts of apps are coming out with chromecast support. This KILLS all other media devices.Keep in mind if you plug the usb in with the designated power adapter (so that the chromecast is constantly recieving power) (and if your tv is compatible with this feature) when you connect to the chromecast (tv off) on whatever device, the chromecast won't only turn on the tv but change to the correct video input.Anyone that gives this a bad rating has their own issues.I recommend this to absolutely anyone!", "verified": true, "helpfulness": "0/0", "author": "Bryce"}]