[{"rating": 5.0, "review": "I love the Chromecast! It's quite awesome. I've told my entire family about it and they have purchased multiple ones for them.", "verified": true, "helpfulness": "0/0", "author": "Platinum"}, {"rating": 5.0, "review": "If you don't have a smart TV this will bring you to the 21st century! It was easy to set up, and I can stream Netflix to my TV with no flaws. Works amazing, I bought more for my relatives.", "verified": true, "helpfulness": "0/0", "author": "Shakanaka"}, {"rating": 2.0, "review": "This device sets up easily enough but then once you have it installed it is very very limited in what you can stream.  No ESPN, Fox Sports 1 and other live sports apps.  No Amazon Prime streaming which is very disappointing.  They say they are going to add apps.  I would make sure you can stream what you like before purchase  Apple TV is much better.", "verified": true, "helpfulness": "0/0", "author": "Tom Donahue"}, {"rating": 3.0, "review": "I know I probably sound like a hater, but believe me, I have over 60 Android figurines, so this is not an anti-Google type of thing. It's just not as awesome as everyone says. I have a Roku 3 for my Netflix and Amazon, but dumb Comcast won't let you use HBOGO on Roku. I wanted this for that. I can't multi-task on my computer with this - the window for HBOGO has to take up the full screen or it gets weird. People say that they can multi-task with it, but I haven't had any luck. Maybe Netflix or Hulu works better. Keeping it b/c it's so cheap and Google is building more features in around it, but not the great multi-tasker I was hoping for.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "This is a great product for playing youtube video's; although i wish you could stream local media to it. Hopefully Google will re-enable local media so that it can truly compete with Apple AirPlay", "verified": true, "helpfulness": "0/0", "author": "VaShadow \"Kayle\""}, {"rating": 5.0, "review": "Excellent product, works very well playing videos from the iPad. I hope they keep getting more applications compatible with this device.", "verified": true, "helpfulness": "0/0", "author": "mpimienta"}, {"rating": 5.0, "review": "love the chromecast. glad it shipped quickly and if needed ill buy again thought it was powered internally but who cares", "verified": true, "helpfulness": "0/0", "author": "G. solar"}, {"rating": 4.0, "review": "Works as described. Was a little disappointed to find out that Amazon Prime  was not among the apps available.  But that was more of a lack if research on my part.Really enjoying the TV queue feature on Youtube especially being able to search on my phone/tablet while the video continues to play in full screen on the TV.Startup is slightly slower than on my Roku but there doesn't seem to be the low quality video that happens with Roku in the first minute or so. Once the videos start they are high resolution start to finish.Price was also a huge benefit.  One third the cost compared to other devices is great.  Of course it requires a phone or tablet but most people looking for this type of product already have those.", "verified": true, "helpfulness": "0/0", "author": "Joshua W McCarrel"}, {"rating": 4.0, "review": "I was hesitant to purchase a Chromecast since I own a Roku 3 and run Plex media servers, but I was pleasantly surprised.The Chromecast was amazingly easy to setup, supports Plex media, and turned one of my no named plain televisions into a smart internet TV.", "verified": true, "helpfulness": "0/0", "author": "Robert E. Holiday \"Bob Holiday\""}, {"rating": 4.0, "review": "The setup was easy and went without a hitch. I have the device connected to my A/V receiver.I installed the Chromecast app on my Samsung - streaming Netflix and Youtube worked well. I purchased this device specifically for Netflix - I was using a streaming DVD player but the remote control was slow and cumbersome - so this worked as I had hoped.My laptop runs Linux and I was hoping to be able to stream my Chrome browser tab to the Chromecast - this does not work - I have not dedicated much time to debugging it at this point - it lost a star for this.", "verified": true, "helpfulness": "0/0", "author": "C J Habasinski"}]