[{"rating": 1.0, "review": "The only thing that streams with no problem are the YouTube videos which I can already watch on my Google TV. Everything else streams slow and keeps buffering. Garbage I don't like it as it won't work as well as you want it to. Go for the Roku you won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Luis Melendez \"LUMEL\""}, {"rating": 3.0, "review": "Great when it works.Using the chromecast extension between multiple devices is very irritating. It is difficult to disconnect or stop a video from playing even when the application is closed, and the connection is not easily established for some video providers (like amazon instant video).", "verified": true, "helpfulness": "0/0", "author": "Mv. Danj"}, {"rating": 5.0, "review": "I have 3 of these now.", "verified": true, "helpfulness": "0/0", "author": "Dave dives deep"}, {"rating": 4.0, "review": "Pretty cool!", "verified": true, "helpfulness": "0/0", "author": "P. Kelly Rhoads \"Kelly\""}, {"rating": 5.0, "review": "Great buy. Only wish I could mirror my cell phones browser on to my tv (for free). One can buy a program.", "verified": true, "helpfulness": "0/0", "author": "COWMANWILD"}, {"rating": 5.0, "review": "Excellent value. Though facing issues in casting desktop and sometime chrome tabs. Though these features are in beta, google should officially release then very soon in a robust version. Netflix and Hulu works great.", "verified": true, "helpfulness": "0/0", "author": "Sudhanshu"}, {"rating": 5.0, "review": "Super easy to install & set up.", "verified": false, "helpfulness": "0/0", "author": "Jarvis Luke Schuckman"}, {"rating": 5.0, "review": "Get this.Download Videostream.Stream everything including your own downloaded movies.Flawless.", "verified": true, "helpfulness": "0/0", "author": "M. Acker"}, {"rating": 4.0, "review": "Dose not work with all HDMI portedTV's. I have a 6 year old Vizio HD TV that it will not work in. Does great with my LG TV.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 1.0, "review": "It's not an easy setup if you are stupid. I am stupid in technology. Very very dumb. I don't know what a ton of stuff does and couldn't even explain terms like hard drive very thoroughly or accurately. But still I can get it done if I spend the time and on this I did. Loved the concept. This worked on one of 6 tvs in my house. I toyed with all settings and configurations in the faqs and tutorials as made siure I set up right and know that I was because of the one I had success on, which was the last one I tried. That sucks because it showed me how it should work and I could of saved my time with all of the bs tinkering. It wasn't even the newest TV that we haveso it's not like that's why it's just going to be random.  I don't know I'm an average person and one for six out of all the TVs just seems a little weak for Google.", "verified": true, "helpfulness": "1/2", "author": "Trell Snap"}]