[{"rating": 5.0, "review": "I was looking for device that can play web video from various sites. Chromecast  tab casting was interesting but it lags. Later I found several apps on android and  PC (plugins for chrome browser) which seamlessly cast any video.  This is the best option for web videos.", "verified": true, "helpfulness": "1/1", "author": "Raj S"}, {"rating": 5.0, "review": "Great product!  If you don't have a Smart TV this will allow you to use go to Netflix or other similar sites without plugging the computer up to your TV.  Even if you have a Smart TV (like we do) it is very useful.  We have movies saved to our hard drive and used to have to plug the TV up to the computer to play them.  Then if we wanted to pause or rewind we would have to go over to the computer and then the popups were a whole other problem.  This allows us to remotely play the movies from our tablet, computer, or phone.  Love it!  The price is great too.  Similar items like the Roku are much more expensive.", "verified": true, "helpfulness": "0/0", "author": "Angela Smith"}, {"rating": 1.0, "review": "too slow", "verified": true, "helpfulness": "0/1", "author": "Renato Reis de Macedo"}, {"rating": 5.0, "review": "One of my best purchases ever!", "verified": false, "helpfulness": "0/1", "author": "Randy Gonzalez"}, {"rating": 3.0, "review": "It is ok. Sometimes even in the same wife, my phone can't reconnect automatically.", "verified": true, "helpfulness": "0/0", "author": "One shock"}, {"rating": 5.0, "review": "I use the Chromecast at least once a day, would recommend for everyone.", "verified": true, "helpfulness": "0/0", "author": "Ryan McCallum"}, {"rating": 5.0, "review": "A change for my life!! a really good change!! love it lots!!! :0) Tks!1", "verified": true, "helpfulness": "0/0", "author": "silvia"}, {"rating": 5.0, "review": "Bought this for my son.  He loves it.  I chose this over Fire Stick because of my own unhappy experience with the closed-universe of content on my Kindle Fire.", "verified": true, "helpfulness": "1/1", "author": "dbroper"}, {"rating": 5.0, "review": "Also a good all also delivery goodsHas been re-purchase", "verified": true, "helpfulness": "0/1", "author": "ISAMU SETO \"勢渡　勇\""}, {"rating": 2.0, "review": "Terrible device. Too slow when doing anything.", "verified": true, "helpfulness": "0/1", "author": "Chila"}]