[{"rating": 3.0, "review": "Still needs work.  Streams great from HuluPlus but....  a series of 2 or 3 commercials run every 5 minutes  and for a reason I cant figure out the show streams well yet the commercials stream extremely choppy making one commercial seem to last forever.  very annoying.", "verified": true, "helpfulness": "0/0", "author": "Peg Meyers"}, {"rating": 4.0, "review": "Works great, a little pokey sometimes and only does 2.4GHz but it's a good little gadget. Sometimes makes me regret spending the money on a Roku 3.That is until you look at all the extra stuff and content the Roku 3 brings.For the money though it's a great little device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This device is easy to set up and use!  I can stream Netflix movies and shows from my iPhone to our HDTV with no problems.  Picture is sharp and sound is excellent!  We are very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "J. Peterson \"Cyber Shopper\""}, {"rating": 5.0, "review": "inexpensive and upgrades non smart tv into a smart tv and i didnt have to buy a whole new tv or more expensive streaming playergreat for watching what my kids r watching on you tubei tell them the have to watch it on the tv in front of us", "verified": true, "helpfulness": "0/0", "author": "Anthony Carlson"}, {"rating": 4.0, "review": "I like it. But you have to reboot the router to locate the dongle sometimes. It is not bad generally.", "verified": true, "helpfulness": "0/0", "author": "Min He"}, {"rating": 2.0, "review": "working good only as youtube player for tv, netflix only work on US territory, can see the brower but in low quality...", "verified": true, "helpfulness": "0/1", "author": "Roberto Minaya"}, {"rating": 2.0, "review": "Not many apps support chromecast unless you are using youtube and paid content provider apps. Think about Apple TV if you are an Apple fan.", "verified": true, "helpfulness": "1/4", "author": "DN"}, {"rating": 5.0, "review": "Does what it says it will and now even more services are coming online with it. I got in at the right time and had it early with one for each HDTV.", "verified": true, "helpfulness": "0/0", "author": "Avid Reader"}, {"rating": 5.0, "review": "THis item works very well, a little odd, that the movie actually palsy via the I[ad and image is then sent to tv using the CHromcast,but once installed works great.Little slow to boot up but then plays with out interruption", "verified": true, "helpfulness": "0/0", "author": "jerry w abney"}, {"rating": 5.0, "review": "I love being able to control Netflix and You Tube on my high def televisions using my phone or tablet.  Easier than doing it through game consoles.  VERY easy to set up and use.  Great picure quality.  I have bought 2 of them and will soon be buying 2 more.", "verified": true, "helpfulness": "0/0", "author": "Mir"}]