[{"rating": 5.0, "review": "love it!!", "verified": true, "helpfulness": "0/0", "author": "M. Raphael \"manatee mama\""}, {"rating": 5.0, "review": "Its a great device that works well.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "I love the fire tv.  it was easy to hook up and the voice commands work fairly well I recommend it to every one", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It's hard to argue the Apple T.V. is the king at this game. If you live in the Apple eco system you will not have the seamless integration with all your IOS devices. Podcasts, iCloud integration, Airplay, etc. I can Airplay from Android devices to the Apple TV.  However this box does offer some nice features not found over in the other camp, namely the games. Nice touch for the youngsters. Interesting deployment of apps, rather than hand them all out, you \"Install\" them, in the same way you would a smartphone. I found it has to often catch up while streaming Netflix, Apple T.V. never does that.", "verified": true, "helpfulness": "1/2", "author": "Chris Kentrus \"Navistar\""}, {"rating": 2.0, "review": "Easy to set up, BUT!  Touted as being fast with a lot of ram, but Netflix playback jitters and shudders with pauses of up to 1.5 seconds and no HD playback.  Also buffers a lot and will occasionally shut down playback.  Amazon playback hasn't produced an HD quality image yet.  Images look like a pirated VHS tape. (Yeah, I'm that old).  My Roku 2 XD buffered Netflix some and down graded the image quality some, but never this bad.  Tested the Wi Fi strength and it was a bit weak.  Thinking this was the problem (Fire is upstairs and router is downstairs) I installed a Netgear AC750 WiFi range extender within 6 feet of the fire.  Signal strength is now excellent, but the fire failed to take advantage of it.  Same problems.  The extender has an Ethernet port so I hard wired the fire.  No change.  All in all, I'm pretty disappointed.  I plan to reinstall the Roku and put the fire in a box in the closet, with the rest of the junk.  Just can't watch TV like that.", "verified": true, "helpfulness": "2/7", "author": "Rick Watson"}, {"rating": 5.0, "review": "This one time purchased replaced my $120/mo. cable bill... Its simple 12 * 120 or 1* 120 (plus movies and content)... No brainer!!", "verified": true, "helpfulness": "1/1", "author": "Aaron"}, {"rating": 4.0, "review": "ok", "verified": true, "helpfulness": "0/4", "author": "Enrico"}, {"rating": 5.0, "review": "This Amazon Fire TV media streaming device is AMAZING for several reasons:  One , ease of setup including connecting to my house wifi was less than 5 minutes!  I went through and uploaded 3 or 4 of the apps I use most and found the keyboard on the remote to be pretty easy to use and for those who prefer a traditional keyboard, you can always buy a wireless keyboard through Amazon.  Two, the back of my house is notorious for not having a strong wifi connection which is why I usually had to run a 150' Ethernet cord to my laptop for a strong enough connection.  The Amazon Fire TV had no problem connecting with my setup and the signal is very strong!  I am already an Amazon Prime member and the item had already been registered to my account since I'd bought it through my Amazon account.  I love that I now have my Netflix and Prime, not to mention some other cool apps that I use on a regular basis all self-contained in this little box (about the size of a DVD).  I already owned a Roku 2 that's set up in my living room, but after doing some research on the Amazon Fire TV, felt this would be an optimal choice for my bedroom TV at the back of the house.  I know that they (Amazon) are still adding apps on a regular basis but I'm absolutely thrilled with my purchase.  I did already have an HDMI cable on-hand so did not have to purchase one, but you will need to have an HDMI cable to connect to your TV and the device.", "verified": true, "helpfulness": "2/2", "author": "Karen Lee"}, {"rating": 5.0, "review": "This is our first day with Fire TV.  First impressions are great.  The interface and set up are very easy to use.  The talk to search function is amazing.  The picture is of great quality.  Only downside that I see as of yet is the lack of a feature to easily determine or search for Prime content.  We bought this product hoping to break free from the monthly cable bills.  We were going to buy one of the other products like this on the market, but heard that Amazon was coming out with this product.  We decided to wait for this product and so far we are very impressed.  It is very intimidating to break away from cable but with this box and the amount of content available to a user I can see the transition being a smooth one.", "verified": true, "helpfulness": "2/2", "author": "L. S."}, {"rating": 1.0, "review": "Amazon Fire TV is horrible. I had high hopes for this and was planning on purchasing a Kindle to go along with it. So glad I held off on the kindle. I spent over 3 hours trying to set this thing up! I was on the phone with customer service for over an hour. They could not answer my questions and did not return my call in a timely manner. It's extremely slow and took over an hour to receive updates when I turned it on. After talking to customer service, I had to update it again. After all that, it still took forever to load anything. The parental controls are confusing, you cannot block certain kids shows for age groups and the kids can see the password as you type it in. Kinda pointless! I returned it the same day that I received it! Customer service was not helpful and all they told me was that the feedback I was giving them on their product was helpful. Very disappointing! Back to Apple I go and don't plan on purchasing any Amazon electronics again!!", "verified": true, "helpfulness": "3/11", "author": "J"}]