[{"rating": 5.0, "review": "My favorite part about using the Chromecast is being able to instantly throw whatever is on my browser screen up to the main TV. This has been great to show friends and family photos off Facebook, Google+, Shutterfly, or anything else!", "verified": true, "helpfulness": "0/0", "author": "Lindsey"}, {"rating": 5.0, "review": "We use Netflix ALL THE TIME. We had to purchase a second one of these so we didn't have to keep taking it from room to room. Well worth the price if you're a Netflix user tired of watching on a small screen, or are sick of cords.", "verified": true, "helpfulness": "0/0", "author": "AhhmayzingClaire"}, {"rating": 5.0, "review": "Streaming movies through my computer and playing them on my TV is super easy with this device. All of the streaming services work with this player.", "verified": true, "helpfulness": "0/0", "author": "Cecelia"}, {"rating": 3.0, "review": "(as a pre-review, I'm an IT that likes to mod my hardware)Bought the product on a recommendation, the products serial number was a ChromeCast that still had a vulnerable bootloader.After a good solid 2 days of trying to tinker with it, I just decided to plug it in and see whats up.It had someone else's WiFi connection listed and name. Yeah, I'm a little pissed I was sold a used (and patched) product.", "verified": true, "helpfulness": "0/2", "author": "Kwazzy"}, {"rating": 5.0, "review": "At $50 this would be a 4 star product, but at $30 it provides great value. We had an old 30\" Samsung flatscreen that was collecting dust since we did not want to pay for an extra cable box. The Chromecast allows us to stream from both Netflix and HBO Go which is what we watch a majority of the time. The picture quality is excellent, almost surprisingly so. It can still be flaky here and there with connecting, but mostly works without a hitch.I'm looking forward to more Tier I apps (hello Amazon?) but for $30 it's hard to go wrong.", "verified": true, "helpfulness": "0/0", "author": "James Sherhart"}, {"rating": 1.0, "review": "Setup took an hour since it requires network updates to accept the new device. I have been using this device for two months now and it's great when it works but it's only worked a few times. My TV does not detect the device regardless of how many times I go through the setup process. Sometimes resetting the wireless router works, now it doesn't. I have a 8yr old wii that never fails in streaming and I have gone back to using that device. Waste of $30 and I'm less likely to try new google hardware roll outs in the future.", "verified": true, "helpfulness": "0/0", "author": "N. Zhang \"Sports Lover\""}, {"rating": 4.0, "review": "I guess I should have done more research, but it just wasn't a product I really needed. Other than that it's OK.", "verified": true, "helpfulness": "0/1", "author": "Darrell Jennings"}, {"rating": 3.0, "review": "It's working mostly as advertised, I suppose — I'm just disappointed with the amount of wireless bandwidth that is evidently necessary to use it without issues. While streaming on what I had thought to be a fairly decent 35mbps down / 7mbps up network, we continually have issues with quality, lag, and stopping. Still, I guess it's better than paying for cable.", "verified": true, "helpfulness": "1/1", "author": "Shan C"}, {"rating": 5.0, "review": "so far so good, people complain about apps limitations, well u know which apps will run on this beforehand, runs smoothly, precisely, no lag.", "verified": true, "helpfulness": "0/0", "author": "Israel Inzunza"}, {"rating": 5.0, "review": "Works the way we expected, enjoying it. Started using it with old tv w/o any cable connection. Really good product.", "verified": true, "helpfulness": "0/0", "author": "dhiren shah"}]