[{"rating": 3.0, "review": "I've been using the Amazon Fire TV since day one. I've been noticing the \"Buffering error\" message during playback while watching from the Prime Video Service. You have to go back into the previously played section to continue where it ended. I've sideloaded various apk's including XBMC . Some work well depending on the controls. But there is another critical problem with the AFTv , memory. Only 4gb available and  no usb support for adding more. This could possibly kill an otherwise good media streamer. So if the Amazon software engineers would update the software to fix the error message, usb support, and media playback the Amazon Fire TV would then be a BEAST!", "verified": true, "helpfulness": "0/1", "author": "masterblaster"}, {"rating": 5.0, "review": "Having come from an Apple TV 3rd Generation, and dealing with nagging problems using my XBOX 360 and Playstation 3 and DLNA I was looking into purchasing the components for an HTPC when Amazon released the FireTV.With a quad-core processor and 2GB of RAM for < $100 I was sold - provided I could use it for the streaming purposes I have.The process of downloading the Android SDK and side-loading the latest stable version of SBMC took about 10 minutes. Once I got everything installed, I hooked up to my NAS and started streaming both SD and HD content.The menus are blazing fast, and the loading of content is extremely quick. I highly recommend if you are wanting a cheap HTPC box and are somewhat technically savvy.For the purposes of this review, I have focused primarily on the media extender features (which aren't built-in by default), because it is a review that I found lacking here as most have extolled the virtues and drawbacks of the standard features of the Fire TV. Rest assured, it is as capable as any other (Roku, Chromecast, Apple TV) and a bit more so with the voice search features and ability to play games.If you wish to purchase one of the leading boxes to use as a media extender, this is the clear choice.If you wish to purchase one of the leading boxes, the Fire TV is a bit faster at processing the content than the others.", "verified": true, "helpfulness": "2/2", "author": "Michael D. Cooper"}, {"rating": 4.0, "review": "This system offers another way to access movies/videos. It works about the same as any other system. We use it infrequently.", "verified": true, "helpfulness": "0/1", "author": "C. Waskiewicz"}, {"rating": 4.0, "review": "I ordered this so I can watch Prime and Netflix without having to connect my laptop to my TV all the time; especially when I'm watching a \"Marathon\" of any show, such as Stargate SG-1. Then there's the added bonus of YouTube, so I am satisfied. There are also other apps such as WatchESPN and others I'm not interested in.When downloading YouTube app from Fire TV you will have to use your computer or tablet to complete it if you want to sync it to your TV. I download the WatchESPN app from Fire TV, but since I have a crappy internet service (AT&T; U-verse), I was not \"authorized\" to watch Miami beat up Brooklyn Nets yesterday. AT&T; said I needed the cable service also, but I did not have that problem when I was with Comcast, but I have now digress... sorry.It was easy to install and 2 to 3 minutes later you are all set to play with your new toy.You can watch \"Prime\" shows in peace without the jittery, stuttering thingy it would do sometimes.I do not have the \"buffering\" problem that I had when using my laptop, so just buy it to save wear and tear on your computer.P.S. Miami won yesterday. Yay!", "verified": true, "helpfulness": "1/1", "author": "E. Ali"}, {"rating": 5.0, "review": "i have been using it and i love it. I want to buy one for a freind in the Philippines. will it also work there?", "verified": false, "helpfulness": "0/3", "author": "Dulcisima de Guzman"}, {"rating": 2.0, "review": "Awsome but I refuse to give it 5 stars till I can watch AP movies on my Samsung Note Pro 12.2 that I bought on Amazon and I can listen to my music I purchased on Amazon, when that happens I will give it 5 stars", "verified": true, "helpfulness": "2/11", "author": "LeeU"}, {"rating": 4.0, "review": "Great and powerful little streamer.  My Plex server doesn't even have to transcode much, as Fire TV does most of the heavy lifting.  It has completely displaced my aging first-gen Google TV box, and the Chromecast is getting jealous.  The absence of IR receiver makes it a real pain to use with universal remote controls.  I also wish Amazon would allow more apps to use their built-in voice search. Right now it's limited to Amazon Instant Video, and I tend to use Netflix more.  This means fumbling with difficult to use on-screen keyboard.  You could always use one of those cheap RF mini-keyboards, but that means more clutter on the coffee table.", "verified": true, "helpfulness": "3/4", "author": "Dmitriy Briskin \"DB\""}, {"rating": 5.0, "review": "Exactly what it was supposed to be! Fast, easy to use, great way to use my Prime membership and watch movies and TV. Set up and use is a breeze.", "verified": true, "helpfulness": "0/2", "author": "Alison D"}, {"rating": 4.0, "review": "I love the fast interface and the voice lookup.  It is very good at voice recognition and the remote is easy to use.  That being said, I am in agreement with several others who have left feedback.  When I am searching, it need to be easy to separate the \"Prime\" videos verses the ones you have to pay for.  They are all mixed up together and this makes it somewhat frustrating when I am trying to figure out what to watch.  I only find out if it is free or pay when I drill down to the detail.  This is why I gave it four stars instead of five.  The picture is awesome and so is the surround sound.  I definite improvement over the Roku 3 in my bedroom.Pros-Super sharp graphics and picture-Really good surround sound-Lots of choices and lots of apps and games-Super easy search function, whether using the voice or keys-Extremely easy setup - mine already knew my Amazon account information when I turned it on.Cons-Hard to tell if a video is included in Prime or one I need to rent until the very last step in the drill-downBTW - If you are a gamer buy the controller also.  It will be harder playing games with the remote.In summary, I would buy it again.  It is better than my Roku and I have used the heck out of that over the last few years, so I am pleased with the purchase.", "verified": true, "helpfulness": "4/5", "author": "Russell Petry \"rpetry\""}, {"rating": 4.0, "review": "We recently purchased the  Amazon Fire TV in conjunction with Amazon Prime and for the most part have been very satisfied.  It is very easy to set up and use, the voice feature is definitely a plus.  The only reservation I have is that without Prime membership the choices are a little limited.  Even with it, I was surprised how many movies and apps you needed to pay for.  Overall, I would rate it as a very good product.", "verified": true, "helpfulness": "5/5", "author": "denny burns"}]