[{"rating": 5.0, "review": "Amazing good, so quick to find movies", "verified": true, "helpfulness": "0/0", "author": "MEFPC \"mef7377\""}, {"rating": 4.0, "review": "I have been keeping up with reviews (and the price) for this device for a little while. I managed to scoop one up while it was on sale. When it arrived, it was packaged up very nicely. Make sure you purchase the HDMI cable as it is NOT included with the device itself. I was able to hook up and start using the device very quickly. I was hoping to use the apps/games that were on my Kindle Fire, but it looks like there are specific apps/games just for the Fire TV. You can use the remote that comes with the device fairly easy, but many games require the use of a wireless bluetooth controller (also purchased separately and fairly pricey). I have only had the device for a few days, but seemingly enjoying it so far. I rate it 4 stars due to having to purchase so many items separately and not being able to utilize all of my Kindle Fire games/apps(or at least, haven't quite figured that out just yet). This is my first streaming device, other than the Kindle Fire, and was very happy when this device was announced. Amazon and Kindle make it so easy to use and that's a huge plus!", "verified": true, "helpfulness": "0/0", "author": "Lisa B"}, {"rating": 2.0, "review": "It looks good except for one major problem.  It won't allow me to surf the internet. I guess I'll stick with my Logitech Revue until someone at Amazon or Apple wakes up and incorporates what should be a no brainner function!  I get all the major functionality listed from by DVD player.", "verified": false, "helpfulness": "0/2", "author": "K. C. Lieder"}, {"rating": 4.0, "review": "I do not own this, let me say 1st of all but I'm thinking if buying SEVERAL for all of our tvs and maybe replacing comcast cable. I couldn't find anywhere to specifically ask questions of you fabulous reviewers so here goes...Is there a way to get actually live tv, for example your local news stations? Here in the Detroit area I watch the local Fox channel every morning for news, weather, traffic while I get ready for work. I know I'd really miss that. Is there an ability to add apps to this for example the local news app like on a smart phone?The content you save on Amazon cloud, such as the instant music when you purchase either the cd or the online only version (sorry if I'm not wording this correctly)? Also the pictures saved through cloud. And the movies you buy from Amazon, not the instant video but the actual dvd or blu-rays, are they accessible through the Amazon features? Yes we still buy the discs. I know most now come with either an ultra violet or other digital form but you still have to load those to a vudu our other similar service. I but most all movies from Amazon so do they include a way to upload or watch those on Amazon stream?If you have more than 1 with comcast high speed, does it slow down noticeably when there are several users steaming at once? We are a family of 6 where there'd be atleast 3 different people steaming at once.Thank you if you're able to answer these questions. Also I'd love emailed feed back on this post to truelyred2@Hotmail.com", "verified": false, "helpfulness": "0/4", "author": "Danielle Buchowski"}, {"rating": 4.0, "review": "I wish more current TV shows were included. If their is a recent show, it costs $. For $99 a year, it is not too bad. I use over the air signal for local and network channels. The $99 a year sure beats the $2,172 a year cable was costing me. Here's the kicker. Cable and Satellite (and I assume Fire TV) are compressed signals. Over the air is NOT compressed. The picture is way brighter. I had to readjust the picture. I do miss the recording function, but their is always a TiVo type device if I want.", "verified": true, "helpfulness": "0/0", "author": "Christopher Peterson"}, {"rating": 5.0, "review": "I made an excellent choice in selecting this item. It is very easy to use, compact in size, and the voice feature works great.A  previous reviewer had said he didn't like having the for rent videos mixed with the free ones. Either he was wrong or it was recently changed, because there is now a seperation. You can select \"prime movies\" for the rental ones, or \"movies\" for the free ones. I would definitely purchase this item again.", "verified": true, "helpfulness": "1/2", "author": "John Clark \"Beach Bum\""}, {"rating": 2.0, "review": "it is to much hang in YouTube.", "verified": true, "helpfulness": "2/7", "author": "Taher"}, {"rating": 5.0, "review": "I ordered this several months ago and am happy with it; however, occasionally the program resets and has to reload.  It does return to the spot where it stopped; however this is annoying.  I would like to order another at the 84.00 price; however i would like to have a response to this complaint first.  Thank you.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Not ready for \"Prime Time\". There is so much content, so many Apps that we enjoyed watching on our Roku that is just not available for the Fire TV. This is pretty much an Amazon Prime content viewer. I miss the Roku. As nice technically as the Fire TV is, it does not qualify as a reason to cut the cable.BTW, we have been off of cable for over six years. That is a savings of over $100 per month for more than $7000 in total savings. The best savings is getting out of the habit of watching so much television! By not watching TV we have the time to really enjoy life! Try reading!", "verified": true, "helpfulness": "2/3", "author": "Ralph Zazula"}, {"rating": 5.0, "review": "I was pleasantly surprised at the ease of set-up, and I am enjoying the programming.", "verified": true, "helpfulness": "0/1", "author": "Beverly Wilkerson"}]