[{"rating": 5.0, "review": "Bought it as a gift and they loved it!  Came in great packaging and was brand new as described.  The product is great and is really handy.  Ended up buying another one for myself.  The possibilities are endless with the chromecast.", "verified": true, "helpfulness": "0/0", "author": "Paul Glazener"}, {"rating": 5.0, "review": "I have both and am an Apple fan,  unfortunately this is awesome and a surpior product to Apple TV. The ability to start a show with your device and then being able to turn that devicd off is a really awesome feature that has come in handy.", "verified": true, "helpfulness": "0/0", "author": "W. Design"}, {"rating": 4.0, "review": "As the headline states, the Chromecast is easy to setup, and works as expected. So what it does, it does well. The only drawback is that it doesn't have a wide variety of apps yet.", "verified": true, "helpfulness": "0/0", "author": "The_Stout_One"}, {"rating": 5.0, "review": "Easy to setup, easy to use. Can't beat the price (wish it wasn't inexplicably sold so expensive in Canada). Perfect HD wireless HDMI connection, with great apps.", "verified": true, "helpfulness": "0/1", "author": "Andrew W."}, {"rating": 2.0, "review": "unless you watch youtube all day or netflix it's really useless. broadcasting the internet to tv was poor quality. needs to be able to use amazon prime videos then it would be worthwhile", "verified": true, "helpfulness": "0/0", "author": "delofter99 \"delofter99\""}, {"rating": 5.0, "review": "Since I purchased this I've been streaming Netflix, Hulu and Youtube almost every day on my TV!Not even a single problem so far.I really wish It supporter Crunchyroll thou.I got it on sale for $25, but even at $35 is an excellent buy.", "verified": true, "helpfulness": "0/0", "author": "najib"}, {"rating": 4.0, "review": "After seeing a friend use the chrome cast for streaming things like Netflix and YouTube videos I decided I would have to have one. Up until this device I was using the built in Netflix player on my Samsung Blue-ray player.Using the interface on your phone/tablet to play videos is light years ahead of the built in ones on smart TV's or smart blue ray players. Currently there are limited apps that support it but most of the major players are on board (Hulu, Netflix, YouTube) and provide what most people want.Set up of the device is super simple. Plug in, set up the wireless, and it is up and away. Getting your phone on the same Wifi network allows you to play with no further set up (great for having people over control from their phone with no additional set up).The only issue I have had with the device is that it doesn't seem to operate as well via the 5Ghz. It has a tendency to drop and not allow me to connect to it with my phone on occasion. I don't seem to have this issue when I am on 2.4ghz (although this could be unique to my device/router).I would highly recommend this device for anyone who wants to stream to a TV with a very easy to use interface and simple setup! Great device for a great price!", "verified": true, "helpfulness": "0/0", "author": "Lee Yarbrough"}, {"rating": 3.0, "review": "It was very good, except that the signal lagged behind the signal that came from the computer, making the tones wavering.", "verified": true, "helpfulness": "0/0", "author": "Wayne Field"}, {"rating": 5.0, "review": "My husband and I used to watch our favorite Netflix shows and movies on the laptop or larger monitor desktop. Neither was convenient. This little, inexpensive device allows us to stream Netflix right to our tv...a much more comfortable way to enjoy our shows. It took about 8 minutes to set up the device from my Samsung tablet. We can take the tablet and Chromecast with us when we're away from home too. Very good value.", "verified": true, "helpfulness": "0/0", "author": "CDG \"CDG\""}, {"rating": 2.0, "review": "I bought our first Chromecast in January and it worked fine until February when it stopped connecting to my WiFi. Luckily Amazon took it back and sent another. In the meantime, I did more research and discovered (via many forums) that Chromecast was a troublesome product for many users.So rather than fuss any more with trying to make Chromecast work or wonder when the 2nd device would fail, I decided to return the replacement device. It was easier/simpler to buy a DP-HDMI adapter, a switcher, and HDMI cables to connect our desktop/laptop to the TV. Amazon had all these products, so now we watch streaming shows problem-free.I would not recommend Chromecast at this stage in its development. The price is right, but the effort to make it work consistently is too much.Update. BTW - be advised that when I returned the replacement Chromecast device because I discovered how awful it was from reading other reviews, I was charged $6 to restock this annoying, useless product. (Please don't hate me when your Chromecast device doesn't work.) So, be smart do some in-depth research upfront because Amazon will charge you at least $6 for the experience.Cheers,", "verified": true, "helpfulness": "0/1", "author": "Jamowa \"Jamowa\""}]