[{"rating": 1.0, "review": "Bought one of these, set up is easy and pretty fast. Seemed to work pretty good to begin with, a few bugs here and there. Then they ran an update.... Now the stupid thing is practically worthless. It works one time before I have to unplug it to reset. I returned it for a new one thinking it may be defective, same thing. Once I cast something, it runs, but I loose all control after several minutes. It says that the unit is not on the same network as my iPad.  If I allow the video to play to completion, I then again have control over all remote functions, play, pause, FF etc.....", "verified": false, "helpfulness": "1/2", "author": "DT"}, {"rating": 2.0, "review": "I'm a big Plex user.  The software update to Chromecast messed up my Plex transmission.  I wish I would have known this before I purchased it.", "verified": true, "helpfulness": "1/3", "author": "Craig Toyama"}, {"rating": 3.0, "review": "I think the future capabilities of this device will make the small purchase price very worth while in the very near future.", "verified": true, "helpfulness": "0/0", "author": "C.P.B."}, {"rating": 5.0, "review": "This thing is cheap. It's easy to set up, works on both Android and iOS, and it's only just started. I bought it on launch day and there were only a few apps that supported it. Then a few more were added. Then 10 more a few days before I wrote this. And, Google hasn't even opened this up for all developers to use yet.A lot of people have said they wish it would mirror like Apple's AirPlay or Miracast, and in the latest Android code (4.4.2) it looks like that is coming too.Buy it for what it is today, because it works great (by far the best way to get YouTube on a big screen), but know that you will get far more from it in the end.", "verified": true, "helpfulness": "1/1", "author": "W. Anderson \"bigbill25\""}, {"rating": 4.0, "review": "I needed something to hook up in my daughters room since I not at in a point in our remodel to run cable to her room.  This keeps her happy with being able to watch Hulu and YouTube on it.  Does everything I expect it to and some and for far less than other comparable devices.", "verified": true, "helpfulness": "0/0", "author": "Brian M Keys"}, {"rating": 1.0, "review": "UNDER NO condition Buy this device. BAD Engineering , BAD operational method. Could never get it even connected to the internet (Router Yes)  !!!!!. I should have read the reviews more closely. DON'T be Fooled . I have been at this \"business\" for 30 years and I have never seen such a poor device. U would think the google could do better!!!! Caveat emptor ! (Let the Buyer beware)!!!!", "verified": true, "helpfulness": "0/6", "author": "A. McCollough \"Auggie\""}, {"rating": 3.0, "review": "Other that that, for the price,  it's a great device to use to watch Netflix, on your tv.  If it had a basic  cheap remote instead of forcing you to use a device, that'd be much better. Also if you want to stream local content from your wifi network there's a few hoops to jump through. Especially if your files are large (MKV, etc)", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 3.0, "review": "I love Google and their products but if you already have another streaming capable device i.e. the Wii or any other gaming console it's not really worth it. Sure you can now stream in HD where you couldn't with the Wii but you end up leaving the device on 24/7 connected to the TV and the functionality of it now isn't worth it.YouTube, however, is GREAT. I love that there is finally a feature for queuing videos with your friends. Hopefully you will be able to use different applications with Chromecast, but as of right now not entirely worth it.", "verified": true, "helpfulness": "0/0", "author": "Aaron Morelli"}, {"rating": 5.0, "review": "Easy to install and use. Need more app support to give Apple airplay run for it's money. I bought two, you do need one on each TV.", "verified": true, "helpfulness": "0/1", "author": "G. Khanna"}, {"rating": 3.0, "review": "This works great on my ipad and nexus tablet, but we haven't yet figured out how to get it to work from a laptop.  The website takes for granted that we are all computer geniuses.  It took a lot of patience on my part and from my younger mates as well to get it working with the ipad and nexus, but overall I am very pleased with the product.", "verified": true, "helpfulness": "0/0", "author": "DuncanMacKenzie"}]