[{"rating": 2.0, "review": "Based on product descriptions and other reviews, I expected Chromecast to stream any content through a Chrome browser. I purposely bought it to make better use of my Amazon Prime membership by streaming Prime Instant Videos by to my TV. However, Prime Videos are not supported by this device. The other content I attempted to stream (YouTube videos) experienced a lag. Therefore, I am returning this product.", "verified": true, "helpfulness": "4/7", "author": "Kelly G"}, {"rating": 2.0, "review": "If you want to view your Youtube, Netflix or Google Play Services on the TV, this seems to do a good job and was easy to setup.  I was able to play Youtube 1080p videos from my tablet app or from their web site on my laptop's Chrome browser and the streaming quality was good.  Chromecast power from USB port on TV is convenient.  For other websites however, it can only send Chrome tab content from a desktop or laptop. In this case, streaming from my laptop stalled often to the point it was not watchable.  Tablet versions of the Chrome browser are not compatible with Chromecast.  I decided to return it due to its limited capabilities.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer \"Bill\""}, {"rating": 1.0, "review": "Unless you travel and stay at hotels frequently, I encourage you to wait for the next generation.  This first release does not give you anything your HD TV or Blu-Ray disc player doesn't already provide.", "verified": true, "helpfulness": "95/127", "author": "Peter Sawyer"}, {"rating": 4.0, "review": "I hear about complaints that you cannot stream what you want, but, alas, you can with your wireless notebook. Stream what you like from a Google Chrome browser and for movies, just drag and drop what ye desire into a google chrome browser and enjoy ;)", "verified": true, "helpfulness": "2/3", "author": "AJS \"Take it or leave it. The choice is yours\""}, {"rating": 5.0, "review": "I think that the headline I provided says it all.  It turned my nice \"dumb\" VIZIO TV into my nice Smart VIZIO TV.  Who needs to pay thousands for a smart TV when you can order a Google Chromecast for under $50 and transform your existing set?  Would make a wonderful Christmas gift so--just do it!", "verified": true, "helpfulness": "0/1", "author": "Stephanie W. Palmer"}, {"rating": 3.0, "review": "expected to be at least at a TV stick level... too bad it only can be controlled from another device (PC, tablet or  phone)...", "verified": true, "helpfulness": "1/3", "author": "Decebal Cheldiu \"Dutchy\""}, {"rating": 5.0, "review": "Easiest way to stream content to TV. Once google gets more apps it'll be even better. 5 stars oh yeah", "verified": true, "helpfulness": "0/2", "author": "Kipp Woxland"}, {"rating": 4.0, "review": "I purchased the chromecast after reading about the service. It seemed to good to be true. Intermittently it works great. When I first set it up, it streamed Netflix and You tube from my Mac laptop without any issues. However, the story goes bad after the first use.The next time I tried to use it, it only streamed video, not audio? I rebooted both the chromecast and the computer - no change - still video only for Netflix, but You Tube streamed video and audio fine. I searched for solutions and other than finding a lot of folks with similar problems, I can't seemed to find a solution.However, it does work with my iphone - audio and video streaming netflix - no problem.  I took a gamble as it was only $35 vs. $94 for Apple TV. I think it may be going back next week.Updated - raised to 4 stars. It now works better with my Mac Air but still a little clunky. Will keep.", "verified": true, "helpfulness": "4/6", "author": "S. Williams"}, {"rating": 5.0, "review": "A fantastic device at $35 (even without the Netflix promotion). It has changed the way I enjoy youtube, and Netflix works great! Needs more app support and improved tab casting quality from Chrome... hopefully that is on the way soon", "verified": true, "helpfulness": "0/1", "author": "Damien Garbett"}, {"rating": 4.0, "review": "Still trying to get use to how the phone displays the device and the options to use certain apps. Overall the item has been functioning pretty well for Netflix and Youtube videos. I would like to see other apps being compatible for streaming via the Chromecast.", "verified": true, "helpfulness": "0/1", "author": "John"}]