[{"rating": 5.0, "review": "We Love our Apple TV and being able to turn our General HDTV in Smart TV's... being able to Stream Netflix and Online Content is great, my wife wanted another one for our bedroom, but I didn't want to spend another $100.00 so when I heard of the Chromecast I thought I'd give it a try. And it works great!We use Netflix, YouTube & Pandora all the time! We have little toddlers and they could care less about cartoons and tv shows, but love playing around the house and creating madness, so my wife just turns on music videos or pandora radio stations and has something playing in the background of all the chaos! hahaWe have used the \"Cast Tab\" feature from our chrome browser on our MacBook's and it works great, sometimes streaming online video from other websites work and sometimes there is a lag, not a huge deal, because I understand that it is in beta and so new that they are still working on perfecting it.We actually ordered our 1st a month ago, and I just got a 2nd for our Family Room to compliment the Apple TV. and my wife loves it so much I'm going to get a 3rd to connect to a 28\" monitor that I've built a Vintage Picture Frame that will close it in and mount on the wall in our bathroom next to her Vanity and in View of our Jetted Soaking Tub so that we can watch all our Netflix Shows!What can I say, We Love It!", "verified": true, "helpfulness": "0/0", "author": "Matthew Francis"}, {"rating": 1.0, "review": "Not a good choice if u want to use Chrome browser with Chromecast plugin. The plugin crashes every 5 mins", "verified": true, "helpfulness": "1/2", "author": "Ravishankar Jayaraman"}, {"rating": 4.0, "review": "Being a heavy Google user for many years, I very simply purchased this because it was cheap and I wanted to see what the commercials were all about for myself.Setup is going to different for every person and TV setup but for me, I simply plugged it into a port on my HDMI switch, connected power, and went through the Chromecast app to configure WiFi. I didn't have an accessible power port for the included wall wort, so I actually used the USB port from my cable box (FIOS HD DVR) one shelf up to power the Chromecast which surprisingly works just fine.WiFi was disappointing that it doesn't work with 5Ghz Wireless N, but I broadcast both bands, that wouldn't be a deal breaker for the Chromecast, however any device that needs to communicate with the Chromecast  has to be on the same WiFi network (not just the same router) so now my 5Ghz band is useless for most of my devices. Considering this is a streaming device and WiFi is the weakest link in the network, it's just disappointing. Yeah, you could say the WiFi is still faster than most home internet connections based on \"nameplate\" ratings, but that's not true in the real world and may not be true if you access local media in the future.All the streaming apps work great as well they should since they're so limited in selection. Look up the currently available ones at [...] to see what you can use. This is something that's probably going to explode (in a good way) when they open it up to 3rd parties. Casting a Chrome tab to the Chromecast is still very sketchy from my testing and more of a gimmick at this point.After playing with everything for maybe an hour, I started to wonder who this product was targeted for. Personally, the TV I use the Chromecast on is a smart TV with all sorts of apps built in including the major players on the Chromecast. I also use a Harmony Smart Hub to control everything, so getting to use your phone or tablet as a remote isn't benefiting me either. In my world, I could only think of it being useful to take to family/friend's to bypass whatever setup they have and show them a video on Youtube or watch Netflix with your account. Maybe your the tech person in your social group and that makes sense. Maybe not.All in all, for the price of it, I'm happy to be an early adopter and invest an HDMI port into Google building upon it in the future and it becoming something more than it is now. I also do like navigating Netflix on the Chromecast versus my TV's built in app. It's another fun gadget to have that I probably wouldn't have purchased if it were priced at Apple TV level and that, I think, is the whole point.", "verified": false, "helpfulness": "0/0", "author": "MC"}, {"rating": 5.0, "review": "If you don't have a smart tv and want an easy interface for streaming movies look no further. great gift", "verified": true, "helpfulness": "0/0", "author": "Zach"}, {"rating": 3.0, "review": "very glitchy, i find myself closing and restarting the chromecast and netflix apps constantly on my iphone before i can get it up and running smoothly. very difficult to pause a show since there is major lag between the chromecast and my apps.no amazon prime connectivity is a major con.", "verified": true, "helpfulness": "0/0", "author": "HHC"}, {"rating": 5.0, "review": "My ROKU device (2nd one) crapped out in 2 months so I pretty much gave up on it and will try to get a return. So in the interim I thought I would try a Chromecast. With discounts it was about $25 with free shipping. Ordered it Tuesday, got or Wednesday! Setup from my iPad was a snap though I had to hunt for the MAC address because I use MAC address security. You will see it during setup. Within 15 minutes I was watching the new Lillehammer episodes on Netflix on my TV. Then flipped over to a few YouTube videos. Only problem is wondering if I should leave the device on all the time. With the ROKU two of them burned out doing that. We will see.", "verified": true, "helpfulness": "0/1", "author": "Fhteacher \"Fga4\""}, {"rating": 1.0, "review": "terrible image quality, if you are lucky to be able to stream something... From a PC : Windows Media player does not stream to this device. Embeded WMV videos  or streamed WMV videos will not play on this device. So there is an \"experimental\" stream your desktop option, well, that doesn't stream sound with it...  I was able to stream a local video by browsing the file system with chrome, the video will stop every 30 seconds to \"Cache\", how can anyone watch a movie like that.From an android tablet, the chrome browser does not stream to this device common video players do not stream to this device, except for Plex, but you need to be a register plex user... I could still return this thing to google, I just feel insulted that I had to put so much effort for such a piece of junk...so thank you google and enjoy my $35... merry christhmas...", "verified": true, "helpfulness": "2/3", "author": "V. Campos"}, {"rating": 4.0, "review": "The set-up was quick and easy, and has worked flawlessly in the couple of weeks that I've had it. The main reason I bought it was to stream HBO Go to my TV as I don't have it in my own personal cable package, but my mom does. To this purpose, it succeeds on all fronts.What will make this the ultimate product, however, will be the eventual 3rd-party app support. If it supported VLC, this would be 2013's best consumer electronic.", "verified": true, "helpfulness": "0/0", "author": "Anthony Pace"}, {"rating": 5.0, "review": "I got rid of cable and use an Apple TV in my living room, but I have this in my guest rooms and bedroom. I love it. It's easy to set up, easy to use, and affordable. No complaints.", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 3.0, "review": "Good features...but connectivity issues are constantly frustrating.  Needs to be debugged to fix issues.  Other than that, a great device.", "verified": true, "helpfulness": "0/0", "author": "Andrew Warner Childers"}]