[{"rating": 4.0, "review": "Nice. I love that we can play music, do apps, games, movies, and see all our pictures/videos from the cloud. Every once in a while it is glitchy and sound is not always great, but most of the time  it works great. Love the parental controls. My kids prefer to get on Amazon fire tv instead of our normal cable! Could it improve? Probably, but it meets our needs just fine. From what I've read about other similar products- Apple tv, Roku, Google chrome, etc. this one is ahead of the pack because of all that it offers.  Probably could improve on the caliber of apps and games available, but  the concept is right on......", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I can watch tv I enjoy now", "verified": true, "helpfulness": "0/0", "author": "mark olson"}, {"rating": 5.0, "review": "I bought this to replace my Matricom GBox which started acting strange after a lightning strike. All the built-in apps work great but I'm a dyed in the wool Kodi (was XBMC) user. It takes a little work to install Kodi but it's well worth it. Kodi runs beautifully. The video quality is outstanding. The controller is very nice. It's smaller than I expected but has a nice nubby feel and works well. There's no button you can use for \"stop\" but you can live without it. If you've a bit adventurous you can remap the keyboard. All in all, I'm very happy indeed.What a bargain!", "verified": true, "helpfulness": "0/0", "author": "John D. Hatch"}, {"rating": 5.0, "review": "The Fire TV is awesome just as Gary Busey advertised.  It is easy to set-up and to use and enjoy especially paired with Amazon Prime.  The Fire TV is easier to use than my Blu-Ray player to watch Netflix, etc.  I strongly recommend it.", "verified": true, "helpfulness": "0/0", "author": "McBruno"}, {"rating": 5.0, "review": "This was for Mom. She loves it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I really enjoy being able to source and view tv shows that are free of charge...often ones I've never heard of before.", "verified": true, "helpfulness": "0/0", "author": "MURIEL NORMAN \"MURIEL NORMAN\""}, {"rating": 5.0, "review": "LOVE, LOVE, LOVE!!!! I've given my Roku away and changed my household to Amazon products.  Thank you, Amazon, for being our tech solution!", "verified": true, "helpfulness": "0/0", "author": "Kalyn"}, {"rating": 2.0, "review": "Hardware works great. So far only used Amazon Prime. Not happy with the fact that for $100 / year for prime, very very many things, movies, cost money. I hate that an old movie that I have seen on TV ten years ago cost $4.95 to view. Prime is sucky!", "verified": true, "helpfulness": "0/1", "author": "George Gallia"}, {"rating": 5.0, "review": "I have three.  Wouldn't consider not having Amazon Fire TV with each TV in the house.  It's basically all I watch.  Love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is a good purchase although my remote doesn't always work, it's cheaply built. Luckily I have the game controller which operates as a remote or else I'd be turning in the old one for replacement.I like Amazon fire, the prime membership is most recommended, I've been able to get movies and things I've wished for!It's hard to beat the Fire TV.. :)  Other than the remote issue: Mine acts like the batteries are low even when I put new ones in. That's the onlyreal disappointment.", "verified": true, "helpfulness": "0/0", "author": "Dean Kaitschuck"}]