[{"rating": 5.0, "review": "If you are a Amazon Prime member and own a Kindle Fire or 2.......then this is the next member of the family you MUST have. All of my \"Fire\" devices are awesome, this just made owning them way more fun. Can control the Fire TV with any of our Fire Tablets which means no more \"lost\" remotes. Like i said, if your a \"Fire\" fan then you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "Addie_and_Shane Openshaw \":-D\""}, {"rating": 5.0, "review": "Christmas gift for my husband. He loves, loves, loves this. He uses it daily. You get a great variety of shows on prime. It you have prime, there is a huge selection of movies and tv shows that are free. The remote control,also is voice control for looking for shows/movies, tv shows. All you have to do is talk into the controller, and say for instant, \"red\", any show/movie that has the word red in the title  or show, shows up in your search. It's very easy to use and user friendly.The box, itself is small and easy to store and use. Does not take up a lot of room. Worth every penny!!", "verified": true, "helpfulness": "1/1", "author": "sharon spellman"}, {"rating": 5.0, "review": "It delivered all that it promised. Best box in the market in the given price-range.", "verified": true, "helpfulness": "1/1", "author": "Andy04"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "1/1", "author": "WILLIAM HAYES"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "1/1", "author": "Paul B"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "1/1", "author": "darrel bertling"}, {"rating": 3.0, "review": "Not as simplistic UI as Roku.I have both. I likes the Roku more.One +point for fire tv is, it plays 5.1 sound for netflix movies. Roku plays only stereo.", "verified": true, "helpfulness": "0/2", "author": "Abhijit Banerjee"}, {"rating": 5.0, "review": "Very easy to setup.", "verified": true, "helpfulness": "1/1", "author": "Deborah Jan Tillison"}, {"rating": 5.0, "review": "Love my Amazon Fire TV!  I mainly watch Netflix, Hulu and HBO Go on it, some Amazon Prime stuff too.  Also works good with hooking up a USB drive with other MP4/MKV video files to watch on it.I also bought the TotalMount Amazon Fire TV mounting system to put it on the back of my TV - it's a good mount but the sticky strips they sent with it didn't hold - buy the 3M Command strips, they hold great and are removable if you ever want to take it off.Along with a one foot HDMI cable, it's completely hidden behind my TV which is mounted on the wall.  The remote works great - doesn't need line of sight.", "verified": true, "helpfulness": "1/1", "author": "texas critter"}, {"rating": 5.0, "review": "I love the Amazon TV, much better than the Logitech review we used to have. My only complain is that the remote clicks make a sound on the TV so you hear the button press and the the TV makes a clicking sound. It is so annoying and you can't turn it off. I'm posting the reviews in hopes someone from Amazon will read this and send us an update so we can turn off this sound!", "verified": true, "helpfulness": "0/0", "author": "sm"}]