[{"rating": 4.0, "review": "Good, Sometimes you have to use the Chromecast app to disconnect from other apps but besides that its good!", "verified": true, "helpfulness": "0/0", "author": "Jhon Carlos Reyes"}, {"rating": 5.0, "review": "I have one for every tv in the house. Need I say more?", "verified": true, "helpfulness": "0/0", "author": "Yazeed Al Harthi"}, {"rating": 1.0, "review": "I bought this because I thought it would work in hotel rooms.  It does not.", "verified": true, "helpfulness": "0/0", "author": "Thomas \"Margaret really\""}, {"rating": 5.0, "review": "Perfect.", "verified": true, "helpfulness": "0/0", "author": "Davi Souza"}, {"rating": 5.0, "review": "Allows me to see amazing stuff on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Clay M."}, {"rating": 1.0, "review": "Worked at first but then Google pushed out an update.  The update was successfully downloaded but the install failed every time at 20%.  Then the required reboot failed as well.  It's now stuck in this loop of trying to install the update, failing on the install, and rebooting fails.  Do NOT buy this product.  Google provides no support for this problem they created with their update.  Yes, I did a \"Factory Reset\" several times. The reset works but then immediately tries to install the update and back to the failed cycle again.  Horrible product and even worse support by Google. Do NOT buy!UPDATE: This is my first interaction with Google phone support.  HORRIBLE!  First, very difficult to understand non-native English speaking support person.  Second, they REQUIRED a photo of the device AND a Google Wallet account to get a replacement.  No exceptions to the photo requirement or the Google Wallet account.  This will be my last Google product for the rest of my life.  Do not support Google products.  Horrible product and even worse support.", "verified": true, "helpfulness": "1/1", "author": "Ken"}, {"rating": 5.0, "review": "Works like a charm as always and stream everything instantaneously. Perfect wireless streaming device..!", "verified": true, "helpfulness": "0/0", "author": "SaiPh"}, {"rating": 4.0, "review": "I have both Chromecast and Fire sticks. Unfortunately, each has a key feature the other lacks, so I have to use both. (If I could cast Amazon video and music, I'd give up Fire in a heartbeat.) I really wish either device, preferably Chromecast, would allow me to listen to Audible via my TV.This device is easy to use. It is simply an extension of your mobile device. Being able to cast Netflix and YouTube is great. Being able to cast video from Chrome is amazing.The picture is fine. No problems with audio and video syncing. If you own any type of Android device, you'll love this.", "verified": true, "helpfulness": "0/0", "author": "NuJoi \"Create with me\""}, {"rating": 5.0, "review": "Pretty cool", "verified": true, "helpfulness": "0/0", "author": "Carlos P Sanchez"}, {"rating": 5.0, "review": "Amazing. A trend setter. This is the forefront of technology. It's cheap, fast, and good. Prepare to have the entertainment landscape changed drastically.", "verified": false, "helpfulness": "0/0", "author": "R. Escobedo \"RAEB\""}]