[{"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Bilal S."}, {"rating": 3.0, "review": "Really good accessory to have when bored and nothing on TV. However when you spend $100.00, you'd expect to receive a better quality of options!", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Just perfectTried the fire stick but it kept freezing over and overJust as good as the Roku but a little cheaperIt is also easier to set up than the rokuJust plug and play", "verified": true, "helpfulness": "0/0", "author": "Xman"}, {"rating": 5.0, "review": "Amazing...get it...lol seriously though its great to have and seems to stream well and better then most of my devices aside from my actual PC.", "verified": true, "helpfulness": "0/0", "author": "Albert Esquivel"}, {"rating": 5.0, "review": "Love. Love. Love this!!! I was looking for an alternative to watching my favorite TV shows as my cable provider had increased my monthly rate to $149.94/month. Which I find outrageous for a single woman who follows the occasional show and likes to browse the internet. Amazon Fire TV was on sale for $84 when I bought it, a deal if you ask me. Buying into Amazon Prime for another $99 gives you quite a bit more features as well as the free shipping from purchases on the website, which if you ask me pays for itself. Numerous freebies as well as pay as you go options. Apps available such as Hulu and Netflix if you subscribe to watch even more for monthly fees. Set up was a breeze. The remote with the voice control is fantastic. All in all I would highly recommend this to anyone and everyone. Actually I have. Trying to get my parents and sibling to cancel their cable provider and switch to this. Best decision I've made in a while.", "verified": true, "helpfulness": "0/0", "author": "Amanda S Friedburg"}, {"rating": 1.0, "review": "First off you need the ethernet cable, and then the HDMI, and then, if you want to use the TV and the internet at the same time, wi-fi.  The hits just kept on coming.  I've had this since middle December and it it STILL not working,  I have never been so frustrated with Amazon as I am now.  I think once all issues (and who knows how many others there are) are fixed, it will work fine, but for the time being, Amazon sucks.", "verified": true, "helpfulness": "3/4", "author": "Debra L Casey"}, {"rating": 5.0, "review": "Amazing product", "verified": true, "helpfulness": "0/0", "author": "Christina Bronne"}, {"rating": 5.0, "review": "Many options.  Ease to use.", "verified": true, "helpfulness": "0/0", "author": "Ivan Mok"}, {"rating": 5.0, "review": "Great product.Highly recommended", "verified": true, "helpfulness": "0/0", "author": "Vlad Dracula"}, {"rating": 5.0, "review": "Our family is amazed at the value of the Fire TV purchase. Do the free trial.. Once you try Prime, you won't go back.. You can access movies, music. TV, streaming services at I additional cost. And free 2-day shipping is included in your membership. The best gift we have bought this year, bar none! We enjoy it every day in multiple ways. The voice navigation lets you speak the name of an artist, album, show or movie; you get the search response in less than a minute LOVE this system.: I am never going to use ITunes again👍❤️", "verified": true, "helpfulness": "0/0", "author": "Rita Marcocci \"Rimac925\""}]