[{"rating": 5.0, "review": "Works as promised. . . I need to find an instruction manual to find out all that I'm able to access with this baby. Right now I'm stuck on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Sandra Bishop"}, {"rating": 5.0, "review": "Oh how we love our Chromecast!We actually owned our Chromecast for over a year before we were able to use it as our laptop could not send quality pictures to our television. If we were even able to cast from the computer, it was choppy and could not keep up.As soon as we replaced the computer we immediately tried our Chromecast. It worked perfectly!We immediately cancelled our cable. I was scared to not have a DVR, thinking that I would miss it. I have never once missed my DVR!We are able to watch every television we were watching on cable! We have a subscription to Netflix and are contemplating a subscription to Hulu Plus. But as of yet we have not found a television show that we wanted but were unable to watch.If you have a computer with a good processor, buy a Chromecast! We love it more everyday!", "verified": true, "helpfulness": "0/0", "author": "AAA Niagara Books"}, {"rating": 1.0, "review": "Lame.", "verified": true, "helpfulness": "1/2", "author": "Matthew"}, {"rating": 5.0, "review": "I watch videos of people jumping off s*** on my big screen now instead of my phone. Pretty cool", "verified": true, "helpfulness": "0/0", "author": "Thomas P. Levy"}, {"rating": 5.0, "review": "Google chromecast is the perfect device for showing smart content on any TV (with HDMI).Google is always updating these (recently with a guest mode), so you will be able to keep using this long into the future!", "verified": true, "helpfulness": "0/0", "author": "Daniel W"}, {"rating": 1.0, "review": "Do not waste your money.", "verified": true, "helpfulness": "1/2", "author": "Joy Moore"}, {"rating": 5.0, "review": "Happy with delivery and device", "verified": true, "helpfulness": "0/0", "author": "Rosmarie Van Doren"}, {"rating": 4.0, "review": "Its good, I thought I would be able to use it with more apps I should have researched the product better before purchasing it.", "verified": true, "helpfulness": "0/0", "author": "Anjelika"}, {"rating": 5.0, "review": "The best price I could find and super fast shipping!  I love it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "The Chromecast does what it claims to do - allows very simple streaming of content from all my devices. I have a 46\" monitor on my office wall, and I use the chromecast for meetings. While sitting at my desk, I can just 'cast' a tab from my Chrome browser up onto the screen for a presentation, or to collaborate with others. I wanted to use it for digital signage also, but the downside is that the host device or computer must be actively streaming. It would be really nice if I could set it to stream directly from a website, so that the computer wouldn't have to be on. But... no one ever promised me that functionality, so although I'm a little disappointed, it does do what it claims, and does it well", "verified": true, "helpfulness": "0/0", "author": "Brad Clayton"}]