[{"rating": 4.0, "review": "I refuse to pay for cable, b/c I hate commercials and s*** TV. I rely on the interwebs for all my watching - on my terms!!!  A guy in the IT department at work says that people like me are called \"cord cutters\".  Sounds cool.  Anyway, I'm also rather low-fi in my tiny house.  We have one laptop and wheel out an AV cart when it's time to curl up to some boobtube.  So, the chrome-cast was a blessing. I can control the TV from my phone or PC, and yet still use the device for simultaneously Instragramming and writing verbose reviews on Amazon.  All while I watch endless series that are a season behind the \"corded\" world.My one complaint - when you watch a series on Netflix, chromecast does not automatically start the next episode. A minor complaint, but seems like something they could fix??", "verified": true, "helpfulness": "0/1", "author": "MissJB"}, {"rating": 5.0, "review": "i have roku and now chromecast to see the differences both have its disadvantages and advantages so i will compare over time :)", "verified": true, "helpfulness": "0/0", "author": "Saul perez"}, {"rating": 5.0, "review": "It's not as full featured as an Apple TV or Roku, but who cares.  It is 1/3 the price!  If you are looking for a simple/ cheap way to stream Netflix, Hulu, YouTube, or Google Play Music to your television than this is for you.", "verified": true, "helpfulness": "0/0", "author": "Chris White"}, {"rating": 4.0, "review": "Use mostly for music video and youtube. Have apps that can stream local content. Worked perfect with \"Allcast\" from the app store.", "verified": true, "helpfulness": "0/0", "author": "Amazon User 504"}, {"rating": 2.0, "review": "it must be good I am sure but we are living in a hotel and cannot go past the sign in page so frustrating sorry to say", "verified": true, "helpfulness": "0/0", "author": "gareth"}, {"rating": 2.0, "review": "I got one of these so I could stream photos from my phone or computer to the TV but this product does not do that.", "verified": true, "helpfulness": "0/0", "author": "Hammertat"}, {"rating": 5.0, "review": "Listening to music on Pandora is wonderful.  Now that Plex allows non-monthly subscribers cast content that is on their media server to Chromecast, you could send any of your movies that you have in the Plex Media Server to Chromecast.  You do still need to pay for the Plex app. It is $5 so it is fairly inexpensive for the convenience of watching your media.  It would be nice if they integrated the Chromecast feature onto the server.  This way you would not have to go to your smartphone all of the time just to play your content.I am sure more apps will integrate with Chromecast, so the fun has only just begun.", "verified": true, "helpfulness": "0/0", "author": "Marcia Boivin"}, {"rating": 5.0, "review": "Nice alternative to cable and we are able to watch in any television.  Great value also.  Glad we purchased after seeing the commercial", "verified": true, "helpfulness": "0/0", "author": "Lucy"}, {"rating": 3.0, "review": "I was a little disappointed.Only transmits Netflix and You Tube.  Probably my fault for not reading more thoroughly. I hoped it was more robust -", "verified": true, "helpfulness": "0/0", "author": "Michael Leeds"}, {"rating": 5.0, "review": "I wach tyt and other youtube videos every day, and i rent movies from google paly, good with My Ipad but better with my galaxy s4 because i can use google play. I can cast from my pc but there is not need for me", "verified": true, "helpfulness": "0/0", "author": "Pblo"}]