[{"rating": 5.0, "review": "I love this simple to install, simple to use product. I plugged it in. I programmed it to my cell phone and computer and it worked great. Netflix, You tube and about any other web programming available, I am now able to use.", "verified": true, "helpfulness": "0/0", "author": "Bill"}, {"rating": 4.0, "review": "Chromecast works seamlessly with all my laptops but not with my Kindle Fire HDX.  Go figure; why is Amazon selling it?", "verified": true, "helpfulness": "3/3", "author": "Shudbefishin"}, {"rating": 4.0, "review": "First off I have to say I couldn't believe how easy this product was to install and setup with my home network, Less than ten minutes from the time I took it out of the package!  It has frozen a couple of times but not a big issue. So far I mostly used it with youtube and vevo. My only criticism, and truthfully probably on my lack of researching the product, is the limited availability of apps for my iPhone 5. I realize this is an Android based product but figure they would have had more apps and access to the webstore. Other than that this is a great product!", "verified": true, "helpfulness": "1/1", "author": "G. Alicea"}, {"rating": 5.0, "review": "works great in HD, easy to install. surprisingly cool. would recommend to anyone, anytime. We love the changing photographs in the background of the home screen. a very nice touch!", "verified": true, "helpfulness": "0/0", "author": "Alexandra Medovaja"}, {"rating": 5.0, "review": "I bought this as a gift for my daughter for her relatively new TV.  She didn't want to replace a relatively new DVD player in order to stream Netflix, HULU or Pandora etc.  This little device turned her TV into a SMART TV and she loves it!!  She has recommended it to friends and saved them money by not having to buy additional devices to stream movies or listen to Apps.", "verified": true, "helpfulness": "1/1", "author": "W R Allen"}, {"rating": 3.0, "review": "It functions exactly as it says it should, but the requirements are vague and the supported app list is small. The device can output in 480i and 720P but it forces a resolution of 1080p after testing the other two on startup and my main TV does not support 1080p. Of course there isn't a current way to toggle into a different resolution and Google's customer service will resolve the issue as a TV older than four years and thus does not meet requirements of device. Also tab casting only works from the Google Chrome browser on a desktop/laptop computer, not from android, and there are a significant number of apps on the Google play store that claim to support Chromecast but list Chromecast support as to be enabled in a future update once Google allows the feature to be open to all third-party developers instead of just their chosen few.", "verified": true, "helpfulness": "0/0", "author": "Joshua M. Schaener \"TheAngelsKeeper\""}, {"rating": 4.0, "review": "This is something that I use periodically. It has turned my 55\" TV into a \"smart TV\" by allowing me to surf and broadcast shows from my pad to the tv.", "verified": true, "helpfulness": "1/1", "author": "K. Lott \"Skier\""}, {"rating": 5.0, "review": "Great for netflix, hbogo, hulu plus, and other apps. But they do need to add more apps! Like *cough* amazon prime video.", "verified": true, "helpfulness": "2/3", "author": "Corey"}, {"rating": 5.0, "review": "This is a must have.  You just have to buy this to know how great this device is.  Buy one for yourself and one as a gift for someoneYou won't regret it..", "verified": true, "helpfulness": "1/1", "author": "Brenda Sharpe"}, {"rating": 5.0, "review": "Has completed my abandonment of cable/satellite television.  Though lacking apps for iPhone/iPad I am extremely satisfied with this product.  It is almost scary how simple it is to connect.  It took longer for me to get it out of the packaging than to get it live and operative.Highly recommended and will be purchasing them for birthday gifts in 2014.", "verified": true, "helpfulness": "1/1", "author": "JC Polk"}]