[{"rating": 1.0, "review": "My kindle's wire connection was damaged so I ordered this in order to play movies. Guess what? It's not compatible with my kindle fire HD so its useless. Worst experience.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "I have one and I've given them as gifts to my son and brother. For the price, it's a pretty clever gadget that comes in handy.", "verified": true, "helpfulness": "0/0", "author": "B. Stockwell \"Mr. SelfDestruct\""}, {"rating": 5.0, "review": "Works as advertisingthank you", "verified": true, "helpfulness": "0/0", "author": "Andrew Branch"}, {"rating": 5.0, "review": "Does what it is supposed to do.  What more can you ask?", "verified": true, "helpfulness": "0/0", "author": "H. B. Calder"}, {"rating": 5.0, "review": "What can I say about chromecast? It is such a luxury! Say goodbye to plugging HDMI cords to your laptop to your tv to watch movies or even owning a tv that's a smart tv or game console if you only care about netflix or hulu. For the price it's amazing and is growing more and more compatible with everything from your phone apps including twtich and songza.", "verified": true, "helpfulness": "0/0", "author": "Paige Downs"}, {"rating": 5.0, "review": "I decided to try this Chromecast at home. Received it quickly, as always, Prime. Very easy to set up and use. Just plug it into the HDMI port on your TV and power it up with the included adapter. You need the Chromecast app, I downloaded it from the internet from Google, to set up the Chomecast on your network. The app did not work on my Lenovo laptop, (Windows 8) it would see the Chromecast and the ID number but would not set it up on the network. I downloaded the app to my Droid turbo and the setup was a snap. It even shares my pic's from my phone on the screen and a backdrop. With it configured on the network all you need is the Chomecast extension, again a free download. That is fast. It will put an icon into the toolbar. Click on it and it will show you the Chromecast that you have set up on the network. You can name them so you know where you are streaming to. Very easy and fun. No glitches. (If you have more than one they all will be seen here) It will even stream the entire desktop but they don't tell you that. There is a dropdown that you can chose that from. Works great. everything I do on my laptop will stream to the TV. No more cables.", "verified": true, "helpfulness": "0/0", "author": "Rick \"Azul\""}, {"rating": 5.0, "review": "Excellent product, Easy to set up XD", "verified": true, "helpfulness": "0/0", "author": "Daniel Ehrlich"}, {"rating": 4.0, "review": "Great (when it works)", "verified": true, "helpfulness": "0/0", "author": "My Comment"}, {"rating": 4.0, "review": "If you know what you are doing within Android, this is a solid purchase. May be outside the technical skills of a novice. Google still has a way to go.", "verified": true, "helpfulness": "0/0", "author": "Brad Humphrey"}, {"rating": 5.0, "review": "AMAZING!  The CHROMCAST uses the iPhone 6 to act as the controller or browser but even though the iPhone 6 (not plus) has a screen that is less than 1080 this device seems to stream to the TV in 1080 from that phone.  In fact I have found from use that most of the data runs directly off the WIFI of the house to the CHROMCAST and this device seems to use the phone only as a traffic director from the house WIFI since the actual gigs used for watching movies \"through\" the phone with CHROMCAST is less than watching it directly on the phone.  So for example I have a TV connected only to a SONY PS3 that I use to watch netflix and Amazon streaming but the Sony PS3 is a hassle for internet surfing but this CHROMCAST makes it easy.  I can watch a free episode of Modern Family on my TV from the ABC app on the iPhone 6 and it plays in high definition on the big screen TV.  AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Kyle D."}]