[{"rating": 3.0, "review": "I like the idea quite a bit, and it is a vast improvement on the Fire Stick, but there are far too many errors and video failures with audio only  or green screen and no audio. You need to work on it ..a lot! Roku is much better at this than Amazon for now, but I am rooting for you, as I am a fan.", "verified": true, "helpfulness": "2/4", "author": "N. Green"}, {"rating": 2.0, "review": "Diverse had a problem with data throughput will be November 2015',  on good note amazon fire tv tech support was excellent.", "verified": true, "helpfulness": "0/1", "author": "Jim and Kathy Schutt"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Peggy R. Osborn"}, {"rating": 5.0, "review": "The fire tv worked very well, as expected", "verified": true, "helpfulness": "0/0", "author": "Erskine Gordon"}, {"rating": 5.0, "review": "I absolutely love the fire tv unit. It's very responsive, and doesn't lag at all.", "verified": true, "helpfulness": "0/0", "author": "Chuck Holt Jr."}, {"rating": 5.0, "review": "I have purchased 3 Amazon Fire TV and thrown all my apple tv away because this device can do so much more than Apple TV.  I'm able to install KODI and stream my personal media.", "verified": true, "helpfulness": "0/0", "author": "jay"}, {"rating": 2.0, "review": "There's really nothing about this box that isn't done better with alternatives.  I bought this when it was on sale, and I replaced my chromecast with it (the intention of moving the chromecast to a less-used TV).  The main advantage for this device was the remote.  The build quality and feel of the remote (and device) are good, and I have no complaints there.  However, other issues can be a bit infuriating.  The one thing that this box can do that my chromecast cannot, is connect to amazon's movies & tv.  But to be perfectly honest, I never find myself using it due to it's clunky feeling and annoying overlap between it's 'prime' (which I am looking for) and it's 'pay per item' (which I wish I could just filter out) items.I have Comcast with HBO, and thus can use HBO Go.  I had no problems loading HBO Go on my phone and then casting it to my chromecast.  Amazon Fire TV has an HBO Go app, so I expected there to be no issues with doing the equivalent; signing into the app and watching the latest episodes of Game of Thrones.  Imagine my dismay when, trying to activate it as a device, I discover there apparently is no agreement between HBO and Comcast to allow me access on this particular device (again I remind you, I had no problems casting to Chromecast from my android phone).  Why does a problem like this even exist?Second, while there are situations that I appreciate having the remote, I have found that I am not always happy that is the case.  There is an app in the Google Play store for firetv to simulate a remote, but I found it to be clunky.  I've also had an issue with apps sometimes not working right.  I use the device to watch a lot of Netflix, and occasionally it will attempt to load a video and get to 99% and sit there.  The only solution I have found is to reboot the device via the settings menu.Third, I also don't appreciate the odd integration of Amazon Movies and TV with the device.  While Netflix and other various apps are contained, it feels strange to me that individual movies from prime or instant video will appear in my recents tab, and the search function via the remote will only search movies on Amazon's list.Also, some of the apps feel really under-developed.  I tried the Twitch App but quickly found that there is no function to search.  At all.  Nothing.  Good luck finding anything other than the absolutely most watched videos.  No issues finding a plethora of twitch-type apps on Google play that I can cast to my chromecast with though.So basically, the underlying opinion here is that everything this device does can be done cheaper and better with the exception of amazon prime movies & tv, a move I'm sure was intentional on amazon's behalf.  But I can definitely live without that.", "verified": true, "helpfulness": "0/1", "author": "Timothy"}, {"rating": 5.0, "review": "This is a great product. Easy to install, easy to use, and great to watch! Has lots of selections and easy to chose what you want. Wish I had one earlier!", "verified": true, "helpfulness": "0/0", "author": "Sheila Ditto"}, {"rating": 5.0, "review": "Good little box", "verified": true, "helpfulness": "0/0", "author": "Orlando Izaguirre"}, {"rating": 5.0, "review": "I am upgrading from a Roku 2.  Definitely faster and nice to have a full Netflix GUI.", "verified": true, "helpfulness": "0/0", "author": "Mike Herrera"}]