[{"rating": 3.0, "review": "streaming is  not seamless and smooth as it should be.", "verified": true, "helpfulness": "1/1", "author": "Shawn Sukhu"}, {"rating": 3.0, "review": "I give it 3 stars only because the USB port is not operable. Cannot be used to stream my own videos from my external HD.", "verified": true, "helpfulness": "1/1", "author": "Carlos Marrero"}, {"rating": 5.0, "review": "I love Amazon Fire TV.  Glad to cut the cord to cable.  There's a lot of channels to choose from, wide variety but you have to really spend time exploring.  Amazon could do better with providing an available channel list.  I got it with Amazon Prime but I must admit I am underwhelmed with Prime - they advertise their movie selection but in actuality it's quite a sparse movie selection.  If you're into movies, there's other selections for movies.  But if you want TV shows, documentaries and exercise then Prime is a good choice.", "verified": true, "helpfulness": "1/1", "author": "Beth"}, {"rating": 5.0, "review": "Awesome, could use a few more current prime movies, but overall love it", "verified": true, "helpfulness": "0/1", "author": "rob stromek"}, {"rating": 5.0, "review": "I have 3 of them.  I replaced my cable boxes and now use antennas to watch tv.  You are supposed to get $15 free movie credit when you buy each one.  I've only received the credit for two of them.  No phone # to call to talk to an actual person about it.  My grand kids like the games, too.  I've had cable for 30 years.  I finally broke free.", "verified": true, "helpfulness": "0/1", "author": "Mel  Woolf"}, {"rating": 5.0, "review": "It is great for streaming movies, and was very simple to set up with Wi-Fi. As a Prime Member, you get many movies at no charge. I would highly recommend it for watching movies on your TV.", "verified": true, "helpfulness": "0/1", "author": "Geogolf007 \"GeoGolf\""}, {"rating": 4.0, "review": "Easy to set up and easy to access Netflix, Prime, etc.  That's what you want in electronics.", "verified": true, "helpfulness": "0/1", "author": "fool4fish \"radmathman\""}, {"rating": 4.0, "review": "Its a great product for people that do not have complete cable packages. Lots of programs that need to be paid for or are not available even with subscriptions.", "verified": true, "helpfulness": "1/1", "author": "Michael Rushby"}, {"rating": 4.0, "review": "Wish there was a way to group the events that are not free with my prime  or make all free with prime membership", "verified": true, "helpfulness": "0/1", "author": "ohiopw"}, {"rating": 5.0, "review": "I  am amazed everytime I use it just gets better. I always had trouble with Hulu now no buffering on anything I watch", "verified": true, "helpfulness": "0/1", "author": "Mike"}]