[{"rating": 2.0, "review": "It's interface is cumbersome and many of the apps that require a subscription is either missing or not supported by DTV.  Apps that are free else where require a fee.  Twit is an example.", "verified": true, "helpfulness": "0/1", "author": "Thouwlin"}, {"rating": 2.0, "review": "You advertise that it has a ton of free content , but anything you really want to view you have to pay for. You have movies from 1990 that you have to buy, all the free stuff are \"B\" movies.", "verified": true, "helpfulness": "4/5", "author": "Ralph"}, {"rating": 5.0, "review": "this item is really amazing, it is absolutely fast and reliable TV box... thank you amazon I really enjoy this device and appreciate your efforts.", "verified": true, "helpfulness": "1/1", "author": "Kawsar Abdi"}, {"rating": 5.0, "review": "Works great. Lots of media contents to choose.", "verified": true, "helpfulness": "1/2", "author": "CORMAC R."}, {"rating": 5.0, "review": "Definitely enjoying this. So far it's been the easiest of these types of boxes for us. The voice selection feature works really well, the controls are simple and, of course, it's designed to work well with our Amazon Prime account (and it does!). Using it has eliminated all the streaming problems we've had with our other devices. We had Apple TV but we get much more use out of the Amazon Fire. Glad we got it.", "verified": true, "helpfulness": "1/1", "author": "willworkforchange"}, {"rating": 3.0, "review": "ok.....needs more content", "verified": true, "helpfulness": "0/1", "author": "M  M"}, {"rating": 5.0, "review": "It's awesome...pure and simple!", "verified": true, "helpfulness": "1/2", "author": "Larry Lay"}, {"rating": 5.0, "review": "This is the best gift I ever received; it helped me through a dark part of my life. Seven weeks of isolation made enjoyable with non-stop entertainment. Thank you!!!", "verified": true, "helpfulness": "1/1", "author": "Leone Arlene Drexler"}, {"rating": 5.0, "review": "The future is here and now , also love Gary B.", "verified": true, "helpfulness": "0/1", "author": "joseph rodriquez"}, {"rating": 5.0, "review": "Nothing to complain. Works as advertised.", "verified": true, "helpfulness": "1/1", "author": "Ankur"}]