[{"rating": 4.0, "review": "I wanted to try Chromecast out because I didn't want to buy Apple TV. It works great with my Google Nexus. The only issue I've seen it the long buffering time when loading Youtube videos. I'm pleased with it.", "verified": true, "helpfulness": "0/0", "author": "Huelle \"Draftman\""}, {"rating": 3.0, "review": "Reading the literature, the impression was given that anything on your compatible computer would be presented on the TV screen if you want it to.  In reality, less than 1/2 can be put up on the TV and that must go through Google.  The product itself works fine, after 5+ hours of trying to get it to work, reading downloads, etc.  It just didn't meet expectations.", "verified": true, "helpfulness": "0/0", "author": "Lynn Tanner"}, {"rating": 2.0, "review": "it was a little goofy to set up and is very slow in it's response, as it turns out because it is so clunky and slow I don't use it at all.", "verified": true, "helpfulness": "0/0", "author": "LouCigar"}, {"rating": 3.0, "review": "The Google Chromecast, arrived perfectly timed, as expected, in a sleep 4x4 box. Instructions clearly printed, and easy to follow.Attach Chromecast to tele, HDMI port, plug in Cast with provided USB charger. Install app on Laptop/Computer/Phone/Tablet to provide connection to cast and sync.While super easy to download, connect and operate. The fun stops here.Google Chromecast is still in \"Beta\" phase, or so Ive read. Meaning there are still a few bugs to squash out.While connected, I tried stream Netflix from my laptop to my TV. It would work seamlessly for about 1 episode, and then suddenly lose connection. I would try to re-sync, but find it almost impossible unless I exit the program, and re-connect chromecast to my laptop and try again.I have yet to get through 2 consecutive episodes on Netflix.Eventually it will work out, but for now, I will stay tied down to my 25ft HDMI cord and watch Netflix/Pandora/ETC until a new update arrives.", "verified": true, "helpfulness": "0/0", "author": "Leandra Clifton"}, {"rating": 3.0, "review": "Some things work, some things don't. Choppy audio on one of our televisions, choppy video with some apps. It's really hit or miss. I suspect it will get better as time goes on.One surprise: Google Play movies were terrible on this. Netflix is great, but when I got this it came with a free movie rental with Google Play and so I tried it out and utterly unplayable. I'm a Google apologist to the core, but the fact that Google Play streaming doesn't work with Google's Chromecast is surprising.", "verified": true, "helpfulness": "0/0", "author": "Aaron Stein"}, {"rating": 5.0, "review": "Easy setup, works great and now with local media compatibility it is even better.  I also use it to listen to live streaming shows online through the TV, it's a great buy, and for the price you can't afford not to have it.", "verified": true, "helpfulness": "0/0", "author": "DrFlimFlam"}, {"rating": 4.0, "review": "It's nice when it works properly, but we keep having problems with prolonged use with Youtube videos.  We don't have any problems with Netflix.  I think it works great with a tablet, like the Google Nexus (not sure if it is compatible with others), but I get frustrated when using it with my laptop for very long.  My little brother likes to use it for watching Youtube videos, and we always watch a lot of them when we get together.  After about an hour, we end up having problems, like we can't get the audio to work through the TV anymore, or it simply won't sync up with the computer at all.  We haven't had these problems when using it for Netlfix or with our tablet, but we have not used it for very long for Youtube on the Nexus.", "verified": true, "helpfulness": "0/0", "author": "Dewey McGruff"}, {"rating": 5.0, "review": "Love it it is great for me to watch netflixProbs, it does cast netflix from my tablet so work that out", "verified": true, "helpfulness": "0/0", "author": "tyler"}, {"rating": 5.0, "review": "Pretty easy set up... Wish it worked with amazon prime... Works well with netflix though...going to get another for my other tv!", "verified": true, "helpfulness": "0/0", "author": "Bekah1210"}, {"rating": 5.0, "review": "We use this in all the TVs in the house. It is so easy to set up and start using. Everyone in the house loves it.", "verified": true, "helpfulness": "0/0", "author": "Nic cloud"}]