[{"rating": 5.0, "review": "except for my roku 2 xs, this is a great streamer used with a windows7-based PC for entertainment with online browser-accessible sites like netflix, huluplus, youtube, and facebook.  still have to try on android and ipad platforms but am greatly pleased with the windows-platform programs with wireless broadcasting to the chromecast player.", "verified": true, "helpfulness": "0/0", "author": "Robert Holdcraft"}, {"rating": 5.0, "review": "Pros:• It took about 3 minutes to set up out of the box.• It automatically switches my television over to the Chromecast whenever I stream something to it.• Easy to use and I can play just about anything I want on it, from either my computer, phone or iPad.• Multiple people can play things in turn, from different devices.  Good for family time.Cons:The app support is still limited but that will change in time and this will not be an issue.All in all this is a great device and I feel that the industry is moving in this general direction.", "verified": true, "helpfulness": "0/0", "author": "Chris S"}, {"rating": 4.0, "review": "when I first received this device, it worked great with my IPAD without a hitch.  But a few months later  Google or to be fair Apple, or whatever power that be provided \"upgrades\"  that makes this device unrecognizable by my network causing me to reset it every once in a while.  Too bad because when it works, the picture is fantastic and it works with no lag.  It is a wonderful device.  But to be fair, it is cheap and well worth the small aggravation.", "verified": true, "helpfulness": "0/0", "author": "TheGrillCritic"}, {"rating": 5.0, "review": "This was a Christmas gift to my husband from a family member. We really weren't sure what it was until we set it up, but soon realized what all the hoopla is about. This was very easy to install and activate. We were watching videos within minutes on our living room TV, and loving it!! We loved it so much that we bought one for the bedroom TV! This would be a great gift for anyone and everyone!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I was one of the first to order and receive the Chromecast when Google released it, and was lucky enough to score their promotional price through Amazon of about $15 as a surprise during checkout.This thing is just great. Just get it. For $35, what this does is a steal. It's simple to use, quick, and makes watching Netflix, HBOGO, Hulu Plus, YouTube, and Google Play sweet when it's casted over to your HDTV. I would easily pay up to $50 for this product without flinching. Google has made an excellent piece of hardware.The only thing that isn't readily apparent from all the pictures of it is that it requires a source of power. It comes with a USB cord that attaches, and most modern HDTVs and stereo systems have a USB port to plug in for power. Just be aware of that in case you have an older HDTV and may not have a USB nearby.", "verified": true, "helpfulness": "0/0", "author": "Acachia S."}, {"rating": 5.0, "review": "I like the way the media player interacts with our HDTV.  I wish it was a little more versatile with other applications besides Youtube and Netfllix.", "verified": true, "helpfulness": "0/0", "author": "Mark D. Deschner"}, {"rating": 5.0, "review": "I received this for Christmas, and it has lived up to being an amazing stocking stuffer.  I have an old Dell Latitude laptop, and when I attempted to download the app I was told to consider another device.  I moved on and downloaded on my smartphone an older Samsung Galaxy 2 android.  I downloaded netflix, and have been \"casting\" netflix movies onto a 32\" Vizio Flat Screen mounted on my Master Bedroom wall.  Folks, I have fallen in love with TV again.  I'm watching Dexter, and movies from Discovery and BBC all via Netflix onto my TV all thanks to this little app.  I am not a blazing star when it comes to all the tech. details, and initially I had a few hiccups trying to get things onto the TV.  However, a few google searches on my old Dell Latitude got me the answers I needed.  I had attempted a call into Google Chrome Customer Support, but while on hold I found the answers online.  The portability will be amazing, and I intend to take the little device when I travel on vacation and business.  Hands Down, this is nearly idiot proof.  I haven't used it with youtube or any others such as of yet.  So wish Amazon Prime could be casted onto my TV, and maybe in time I can, but right now I believe not.  If anyone knows a very simplistic way of doing so please drop me a line.  Happy New Year everyone!", "verified": true, "helpfulness": "0/0", "author": "Logic101"}, {"rating": 2.0, "review": "I set this up and the error I kept getting was the HTTP proxy willnot allow this to work on my TV... Which makes no sense, I have the latest WiFi by Net Gear... but it still does not work", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 1.0, "review": "Could not get it set up on my VIZO. Spent way too much time on this thing and never was working right even after it said it was.", "verified": true, "helpfulness": "1/3", "author": "no name"}, {"rating": 1.0, "review": "I had to return it.  It was definitely not user friendly to connect and I could never make it work.  There wasn't enough information about it up front to know it would not work from my Kindle Fire (needs Google Play) and it wouldn't work from my desktop without some sort of work around which I didn't understand.", "verified": true, "helpfulness": "1/4", "author": "patricia wilson"}]