[{"rating": 5.0, "review": "Excelent!!!", "verified": true, "helpfulness": "0/0", "author": "Mario Alejanrdro Herrera"}, {"rating": 1.0, "review": "Might work for you but didn't for me.  Could never get to a selection screen for Netflix or any other program.  Good luck.", "verified": true, "helpfulness": "0/1", "author": "Gina"}, {"rating": 3.0, "review": "Works fine except it doesn't  get Yahoo Screen directly. The reason I got it was to watch Community on my TV. You can do it but you have to get in a special app and then stream it  through your phone or iPad . All the other channels like Netflix. You Tube and Hulu  I get through my TV anyway.", "verified": true, "helpfulness": "0/0", "author": "Myron Rreynolds"}, {"rating": 5.0, "review": "Worked as advertised,glad I bought it, easy to kayak and run", "verified": true, "helpfulness": "0/0", "author": "Joseph Bruno"}, {"rating": 5.0, "review": "Ever since I bought this, my TV usage has increased tenfold. I cancelled my cable service and upgraded my internet connection. Best decision I've made in years. Using a chromecast with Plex to play my local files is awesome. The Chromecast throughput is exceptional and I notice no degradation of quality in the media. BUY THIS.", "verified": true, "helpfulness": "1/1", "author": "Twitch"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Marcelo Soares da Silva \"Tattos\""}, {"rating": 1.0, "review": "My family has bought three of them, none of which work. Terrible product, do not waste your time or money. Its really disappointing coming from a company like Google.", "verified": false, "helpfulness": "0/1", "author": "jenny"}, {"rating": 2.0, "review": "This product is incredibly glitchy. It's great when it works, but I bought it for my parents and had to end up buying them an Apple TV because that's much more reliable.", "verified": true, "helpfulness": "1/1", "author": "Ogechi Wadibia"}, {"rating": 5.0, "review": "as advertised", "verified": true, "helpfulness": "0/0", "author": "Grant L."}, {"rating": 3.0, "review": "Have been using it for a month now. Great tool, but not very effective. youtube hangs up every time i comnect it to chromecast. Buffering problem too. Huge disadvantage is that it is not very effective with ipad as cast extension not available for apple devices", "verified": true, "helpfulness": "1/1", "author": "srividhya"}]