[{"rating": 4.0, "review": "WOrks great, and easy install.. However, the chrome browser on my galaxy S4 does NOT yet work with it.. It works great on my laptop, and I can cast anything in my browser (google earth, etc)..  But on my galaxy, it is nearly useless, because the only practical thing I can do right now is cast my Youtube videos.. Its ok, but will be SOO much better when they catch up the mobile version!!", "verified": true, "helpfulness": "0/0", "author": "Maurice Musilli"}, {"rating": 4.0, "review": "Got the cast for watching Netflix mainly, as my TV lacks a client for that. It does a great job at that and has replaced the other options (Wii and/or laptop).  The youtube client is nice too in that it allows for queuing clips on your \"watch on tv\" list, and those play in sequence.Only reason it does not get a five star rating is that the netflix app (in iOS at least) is a bit slow to respond when the phone is locked and you awake it: as soon as you unlock the phone, even if Netflix is loaded and showing, it takes a few seconds for it to \"re-sync\" with the cast and start sending commands again.  So if you want to quickly reach \"pause\", forget it, you'll wait for it to come back, hit pause, and then hit \"go back 10s\" once you are ready to watch again :-)It would be better if one could use at least play/pause from the TV remote on the chrome cast.", "verified": true, "helpfulness": "0/0", "author": "Claudio Andre Heckler"}, {"rating": 5.0, "review": "Great product very easy to install, use the internet guide covers everything you need plus provides tips for advanced users.", "verified": true, "helpfulness": "0/0", "author": "Pet"}, {"rating": 5.0, "review": "Easy to install and very good price, considering what you get from it! I use it mostly for netflix, still waiting for more apps to be supported!", "verified": true, "helpfulness": "0/0", "author": "Daniel Jodin"}, {"rating": 4.0, "review": "The device is awesome but has limitations like mkv videos without sound and the number of apps available. But the device is incredible!", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Dantas Chaves"}, {"rating": 1.0, "review": "This product is so overrated.  The use is so limited, it is not worth the free the shipping.  Don't buy it.", "verified": true, "helpfulness": "0/2", "author": "James"}, {"rating": 1.0, "review": "what they don't tell you is that to run it from your PC, your router has to be extremely close to the television it is hooked to. Worked well with my smartphone, but I still sent it back because of the PC issue.", "verified": true, "helpfulness": "0/1", "author": "chadda gomez"}, {"rating": 5.0, "review": "I love how easy it is to use and hope that it becomes a standard so that anything you have on your computer/pad can be seen on tv and not just certain programs..", "verified": true, "helpfulness": "0/0", "author": "D. Hein \"Heinsite\""}, {"rating": 5.0, "review": "I finally hooked this up to my tv, which was extremely simple, and in no time I was watching my favorite YouTube music videos!!  Great little device!!  And it updates itself so it will always be \"relevant\"!  Can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Victoria D."}, {"rating": 5.0, "review": "It works .... not as good as want, but that probably me. When try streaming anything to television in living room on 1st floor from desktop in bedroom on 2nd floor it breaks up and lags. The video jumps n audio isn't synced with video. As said probably me, will try figure out what doing wrong n fine tune it.", "verified": true, "helpfulness": "0/0", "author": "Thomas Cowen"}]