[{"rating": 5.0, "review": "Wow, this thing is amazing! And with 3 months of Netflix (promotion is over), the Chromecast is a steal at $35! It does more than I thought it would and even projects a tab from Chrome directly on to the TV (and updates real-time <- the question that we all want answered?). Honestly, there's no reason to buy a Smart TV now (it's all a gimmick anyway) so save yourself a couple hundred bucks with this dongle!The only thing I regret from this purchase is buying it through the Google Play store and not on here since I could have utilized my prime shipping... I really hope that we'll be able to cast directly from our smart phones in the future!", "verified": false, "helpfulness": "0/0", "author": "JHK"}, {"rating": 5.0, "review": "I was wondering which way to go as far as purchasing online movies.  I just purchased a new smart TV for my basement but there was no way to get the movies from Google play easily.  Sure I could move the Google TV I have in my living room to the basement but Google TV on top of a smart TV is a bit redundant.  I could go through Amazon but there is no way to easily view that content on my phone.  Nothing quiets a kid in a restraunt like a movie.  This is the answer, A simple way to stream Google play content and Netflix (and I'm sure much more in the future) striaght to the brand new TV.  And it's portable, If I want to finish a movie in the bedroom no problem, just unplug from the basement and plug into the bedroom.  It will pick up right where I left off.  I think I will be purchasing more in the future so I don't need to move them though....$35 bucks is kind of a no brainer.  Anyway...Great move Google, exactly what we needed, nothing more.", "verified": true, "helpfulness": "0/0", "author": "John B"}, {"rating": 5.0, "review": "I finally received this item yesterday and was able to set it up within 10 min. I tested the streaming video quality (both Netflix and YouTube) via. desktop, iPad and iPhone. The results were pretty darn amazing, and I have a standard internet package with Time Warner, the internet speed is 15 Mbps.", "verified": true, "helpfulness": "3/4", "author": "Jason"}, {"rating": 5.0, "review": "I'll make this short and sweet. I'm not here to leave any detailed tech information, as there are tons of sites already doing that.First, the price. Amazing. Yes, I was one of the early ones, so I did get a Netflix code for 3 months free; but I believe since I am also a new customer, I have a one month free trial, which could potentially give me up to 4 months of free Netflix! In terms of value alone, I'm getting a $32 deal with Netflix, which means for the device itself I paid $3. Even without the promotion, $35 is a bargain for what this product could potentially do.Second, the actual product. I would say I am a bit on the tech-geek side, so setting up was a breeze. Plug, connect, and play. It's that simple. I used my S4 to connect the device to my home WiFi network (FiOS). YouTube and Play Music have been seamless thus far, no lag for me. My WiFi is pretty strong, though it's not anything comparable to 100Mbps speed or Google Fiber. If your WiFi is better than mine, there should rarely be any lag or stutter.It's already been discussed that the cons include the lack of apps compatible for now. Chrome tab-casting has mixed results and is, technically, in beta stage at the moment. But if this is the beginning, then I have to say I'm excited in the coming weeks and months. Already apps are being tested, so patience is key.I'm sure there are more detailed and thoughtful reviews than mine, but I thought I'd leave my review on this immensely popular device. For such a cheap price, there can't be enough hype. I hope the people who leave the negative reviews understand that, or perhaps should have read more carefully on what this product can actually do. It can't be compared to a Roku or Apple TV, because it's not the same. Sometimes different is good for the competition, for the evolution of the product.", "verified": true, "helpfulness": "3/4", "author": "Jay-T"}, {"rating": 3.0, "review": "I agree with most of the other posts, but will add a few details I have not seen covered elsewhere.Agree with others that Netflix works great, as does youtube.  However, I have other ways to do this and was buying for the googlecast feature (sending any video straight from Chrmoe browser).  Good news is this works with password-protected web sites much better than playon and is easier to use (higher spouse - not wife - acceptance factor ;)  Unfortunately, it is unwatchable.  Audio/video are way out of sync and stuttering.  From an ethernet-connected htpc it is iffy but watchable, but over wifi from my laptop not at all.  My network wifi and same laptop can support live tv streaming from my hdhomerun via windows media center, so it is not a weak network issue.I bought mine a few minutes after the announcement and had not thought through one obvious drawback.  If you don't have HDMI pass-through on you stereo receiver, think through your audio setup.  You may need an adapter or have to send audio through your TV, maybe have to change your universal remote settings, etc.  If you have a new-ish tv this is not such a headache for Netflix from your phone, as it uses hdmi control and can adjust the tv's volume from there.  This does not work with googlecast, but you can leave tv volume up and adjust the video's volume on screen, just as if you were watching it on computer.  Also I cannot say whether this works with hdmi passthrough as I don't have it to test.  It does work through a rocketfish wifi wireless sender.  I hooked mine up to that and used usb from my xbox to power it (powers even when xbox is off).All the marketing and demos say you have to be on the same \"wifi network\" as the chromecast to use it.  You just have to be on the same network and subnet, not connected through the same access point.  Might only matter for a few readers, but I can use this from devices attached to the network via the same access point, a different one on the same network, ethernet or MOCA bridge.Set up is easy, but changing your setup is not.  It has no setup utility or access web page.  If you need to change your wifi password, put it on another wifi access point, etc. factory reset button and re-running the setup prograam was the only way I found.  If you have to do this, make the second setup from an android phone instead of pc if possble.  Gets into your registry settings the first time through and it is hard to make it try again from the pc.Bottom line - if you want to be an early adopter and wait for features and upgrades, get one of these.  I am not sending it back, but would if it had cost more.  If you are looking for a device for netflix, this is easy to use and very small/unobtrusive.  If you want Netflix and other content, you might want a roku or similar device, use playon with a device you already have, or get this and wait for the development to catch up.  Once it does, this might become a really neat gadget.", "verified": false, "helpfulness": "2/5", "author": "Becky R."}, {"rating": 5.0, "review": "I ordered my Chromecast on the last day of the Netflix promotion, and I received it 7/29.  I used a PC Laptop to set it up.  As all the other users have noted, setup is SIMPLE and direct.  Yes, you need to use either the USB adapter or the Power Adapter to give the unit power!  From my iPad and iPhone, casting from Netflix and YouTube was great.  From my laptop, casting from YouTube and Netflix was good, but casting video or audio from other websites using the Google Chrome Browser Cast plugin was terrible.  HOWEVER, turns out that my laptop is old and slow.  Using my desktop, casting video and audio from websites using the cast button in Chrome worked wonderfully - just a slight delay initially, then smooth as silk, and in full 720p.  I received my Netflix code today, and it worked perfectly - the email with the code has a \"learn more\" link; follow that link to get directions to redeem your code.  BUT even if you don't get the Netflix code, for $35 this product is amazing!  I have 4+ year old 1080p HDTV without WiFi, away from my router and cable box, and now it's instantly a wireless TV to which I can broadcast YouTube and Netflix - perfect!", "verified": true, "helpfulness": "2/3", "author": "Rixator"}, {"rating": 3.0, "review": "Was very excited about this unit when I purchased it. Couldn't wait for it to arrive in my mail box.Positives:Very easy to set up - 5 starsNetflix and youtube runs perfect from my android phone/macbook - 5 starFree 3 months of Netflix - 5 starBetter than Apple TV if you have an Android phoneNeutral:Only Netflix, Google Play and Youtube are supported right now. Hopefully support for other apps will show up soon.Negatives:Laptop mirroring was terrible. The mirrored screen from my MBA on my TV was extremely poor in quality, pretty much un-readable.The mirroring was also very slow. There's about a 1-2 second lag time from what you see on the laptop to what you see on your TV screen.I was mostl excited about the mirroring feature on my Chromecast. But I was extremely disappointed in the results.Overall, disappointing mirroring performance. However, it's still well worth the $35 price tag, especially with the 3 month Netflix deal.I will be buying more of these as Christmas presents for friends and Family.", "verified": true, "helpfulness": "20/24", "author": "xinger"}, {"rating": 4.0, "review": "Hey everyone, I'm here looking for ANOTHER Chromecast as I've really enjoyed using the initial one I ordered from Google so far. Suffice it to say it's a solid streaming device and an amazing value at $35. However, you can watch my video review at this YouTube address and enter to win one for free that I'm giving away if you'd like. Good luck and have an awesome day everyone :)[...]", "verified": false, "helpfulness": "1/2", "author": "Joshua"}, {"rating": 1.0, "review": "I was really excited for the Chromecast and chose this instead of buying the Roku which turned out to be a mistake. The streaming is limited to just Youtube and Netflix.While you can just cast the Chrome tab for any other site if it is streaming video realize that both your computer and TV will be streaming two different streams at the same time which means it is very likely you will have bandwidth issues.  There are other issues as well which indicate this was a rushed product. For example there is no audio when the desktop is cast and the separate audio streaming does not seem to work. Also you will not see the mouse pointer on the TV so you always have to look at your laptop to navigate rather than the TV.So if you want a streaming product that works seamlessly and supports plenty of channels get a Roku. If you want a wireless display device for your PC then get a wireless HDMI device. If you just want to tinker around then get the Chromecast.------------------------------Update 8/1After a few days of use I can no longer justify even a 3 star rating for this. First the Chromecast randomly turns my TV on when plugged even when HDMI-CEC (Toshiba Regza link) is completely disabled. Note that my laptop is fully shutdown at this point and no casting going on but if I leave the Chromecast plugged in on any port the TV will turn on within a few minutes.Second but more importantly the device becomes too hot and starts freezing constantly when left plugged in for a while. Right now the screen went blank while I was watching Netflix and after I rebooted it did the new update and the screen was still blank after finishing. Now I rebooted again and it is still blank!!", "verified": true, "helpfulness": "19/58", "author": "JK"}, {"rating": 4.0, "review": "I already have a smart TV, and PS3. I prefer to use PS3 for Youtube because my smart TV apps for Youtube is laggy. Netflix app on my TV is flawless.At $35 I didn't think it was worth it. But with Netflix deal, it would cost me only $11. I already have Netflix, so it is not like I am adding a new service.I received it yesterday. I spent at least an hour trying to set it up. The problem was not easy to diagnose. Chromecast's help said that I probably have Ip/Client Isolation enabled. I logged into FIOS modem, but didn't see any setting that remotely resembled IP/Client Isolation. After a while I found the answer online. I had to disable IGMP Proxy under advanced settings. After disabling it, it just worked.I was able to use my old old cellphone HTC Evo and Chromebook. Watching Youtube was better experience, especially searching for the videos. Another use was browsing Facebook photos. In past, we would usually connect our laptop to TV and then browse to photos folder and start a slideshow. But now can just open our Chromebook (which is always on our coffee table) and start Facebook or Flickr.I would recommend this to anyone without smart TV/PS3/360/other streaming devices and perhaps also for displaying personal photos when friends and family comes over.", "verified": true, "helpfulness": "1/1", "author": "Amer"}]