[{"rating": 4.0, "review": "This is a great product. There are some things that I would change about this, but  for it's price SO worth it.It works great with my upstairs TV when I stream through my iPhone 4s, possibly because I'm close to the router. It doesn't seem to work as well on the TV downstairs, but that's OK because I have the Wii set up with Netflx, Hulu+ and Amazon Prime. Neither TV is a \"smart\" TV, one is from 2006 42\" Sharp and 32\" Panasonic upstairs is from 2008).I noticed that when trying to stream a TV show from Netflix from my phone that I can't select an episode. For example, my husband and I wanted to watch Star Trek, but it automatically started from the beginning rather that being able to select an specific episode. Small complaint.Streaming downstairs. I first set it up here and it took a little work, and the streaming was slow. The router isn't too far away. Not sure why it was giving me so many problems. It wasn't detecting the device and there was significant lag from my computer to TV.I can stream from my Chrome browser as well and that is very cool! Amazon Prime, or any browser tab, such as Facebook.I would love to see some additional apps, but for now, it's perfect.", "verified": true, "helpfulness": "0/0", "author": "Kristi C."}, {"rating": 3.0, "review": "This works okay, but I was disappointed to learn what it cannot do. So I recommend you read a lot of reviews to see what it can and cannot do. For what it does, it is really cool. Certain video streams go fairly smoothly. Most of the negative reviews have it correct, however. Google search the product for reviews and make your own conclusion. It is limited. You have to plug it up with a power cord that is often now shown in the marketing programs. I plan on using it in the exercise room to stream workout videos. It works great for that. Buy with caution, you may be disappointed in what it can't do.", "verified": true, "helpfulness": "0/0", "author": "Dbaucom82"}, {"rating": 5.0, "review": "My only complaint is that it only really does 720p, and streaming is very delayed and uses a ton of processor power. Other than that, it is a magnificent step in the area of home media. Simple to set up, simple to use and is completely fool proof other than the times it sort of messes up (but that just comes with technology).", "verified": true, "helpfulness": "0/0", "author": "Tectix"}, {"rating": 1.0, "review": "It's a cool idea, but Content is King and having Netflix stream from my tablet is not cool.  Can't stream websites, can't view what is on your tablet or phone, just the content Google has... which ain't much.  Save your $$$ until it's improved.", "verified": true, "helpfulness": "2/3", "author": "Etechhy"}, {"rating": 4.0, "review": "After some trouble with my wi-fi reception and after my cable company changed the router. the stremer connected right of way, been enjoying some movie channels, etc. Quick delivery as well", "verified": true, "helpfulness": "0/0", "author": "&#34;Pepin&#34;"}, {"rating": 3.0, "review": "The setup is extremely easy.  However, my product lacked any advice on how to actually use the product.  The concept seems to be point-and-play, but the device often seems to hang-up if, say, we try to cancel one wireless stream and send another instead.  More detailed information may be available on line, but the address, if any, for that was certainly not prominently displayed.", "verified": true, "helpfulness": "0/0", "author": "Michael Strother"}, {"rating": 2.0, "review": "the reason for the poor rating is because it will not work for my wifi network. nor does it operate on a buddies wifi network. its a lil embarassing to brag about something that doesnt work. probably be better if it was bluetooth instead of wifi.", "verified": true, "helpfulness": "0/0", "author": "Cleo nehemiah"}, {"rating": 2.0, "review": "This was not easy to set up.  DId not synch or work with UVerse.  Needed to buy a different router and then find someone who could hook it all up.  It works now but was not easy.  And does not work with as many options as Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Lamartine Simons"}, {"rating": 4.0, "review": "It does exactly what it says it will do.  I wish it would work on many more Programs.  I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Connects to your HDMI port on your TV. I'm using it with an older Philips TV and multiple nexus tablets.  For $35 it's great.  More app support would be awesome.  Tabcasting from a tablet would be awesome. Still to come?", "verified": true, "helpfulness": "0/0", "author": "Joe W"}]