[{"rating": 4.0, "review": "Just an update. The Chrome cast app,  when run on the latest android version 4.4 allows directly casting the screen to your TV. Nice new feature.Hard to beat for the price.", "verified": false, "helpfulness": "0/0", "author": "Ken M \"kmoffat\""}, {"rating": 5.0, "review": "Excelente!!", "verified": true, "helpfulness": "0/0", "author": "Francisco Alberto Batista"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "NYEverything"}, {"rating": 5.0, "review": "Got exactly what I wanted! Perfect!", "verified": true, "helpfulness": "0/0", "author": "Kenneth Barnes"}, {"rating": 4.0, "review": "Yet another inexplicable gadget to play with.  Works flawlessly once you figure out the setup.  Perfect for Netflix accounts and anytime you want to \"cast\" from your wireless device to a large screen display.  Great substitute for cable TV!", "verified": true, "helpfulness": "0/0", "author": "Dave C"}, {"rating": 4.0, "review": "I love chromecast! best investment I ever made for an AMAZING price. I no longer pay for cable because of this product! The only problem I have experienced is it is kind of \"laggy\" with an ipad. When I use it with an android tablet/ android phone it works much better. It also does not always work well with google chrome which is ironic. Again, it lags a bit when you try to stream a video by using chrome but I have found that if you do not make it very large it works better. It will be behind from the video on the computer screen but the voice and video still match up. Could be worse! I still love this product and use it primarily for netflix, hulu plus, and HBO go. It works perfectly with those apps as well as pandora and youtube which I have tried. Only drawback I guess is using an ipad and trying to cast something from google chrome from my macbook pro.", "verified": true, "helpfulness": "0/0", "author": "SM"}, {"rating": 5.0, "review": "Awesome!!! We have a great picture and we don't even miss dish tv that much. :)", "verified": true, "helpfulness": "0/0", "author": "Lori"}, {"rating": 5.0, "review": "Me and my wife have loved this gadget since the moment we plugged it in! We've never seen Netflix so clear and sharp. I'm a YouTube junkie and the Chromecast has made it so easy to watch and share videos on the big screen TV. We are thinking about buying more for our other TVs, although it's easy and seamless to unplug from one and plug in the next room's.", "verified": false, "helpfulness": "0/0", "author": "Juan E."}, {"rating": 2.0, "review": "The range to connect to my internet seems very weak.Had to research what the problem was and finally found that it was a weak signal.  My route is about 40 feet and one wall away.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 5.0, "review": "Awesome device, easy to install and good value for the price. Works very well with all tablets and smart phones.", "verified": true, "helpfulness": "0/0", "author": "moshtari"}]