[{"rating": 1.0, "review": "Tried setting it up on three different networks, always returned message could not find any chromecasts. Just missed the deadline to return to amazon.", "verified": true, "helpfulness": "0/0", "author": "nick alfonso"}, {"rating": 3.0, "review": "It doesn't work very well. Quite laggy and slow :(", "verified": false, "helpfulness": "0/0", "author": "Daniel Spence"}, {"rating": 5.0, "review": "I bought this specifically to stream Netflix, on our older LCD TV and it works like a charm.  My fiance likes that he can use it to seamlessly stream youtube videos, and that he can display the desktop or any open window of his tablet on our TV, to show videos or photos to friend and family. I also enjoy that i can use my tablet to stream a movie onto my from netflix for my niece and still play on facebook or check my email on the same device.  One of our other TV's is a SmartTV, and this works better and faster than the Smart connection.  He plans to buy one for that TV as well.My only complaint, is that it doesn't work as well with the Chrome websites as I'd like it runs slower and is glitchy when you try to web surf with it, but I rarely try to use this for anything other than netflix.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have a roku and plex server, so this isn't as useful to me as it could be. It took me forever to realize that once you start the stream, you can close your laptop or tablet and it will continue to play.", "verified": true, "helpfulness": "0/0", "author": "Matthew Steinberg"}, {"rating": 5.0, "review": "The great thing about the Chromecast unit is that it's so portable. Took it with me to a family vacation in the Outer Banks. We had grandchildren and their parents along. Luckily we had new large screen TV's and plenty of HDMI space. It seems that bringing DVD's is now passé. I would recommend this unit to anyone who travels and has an iPad,iPhone etc. just have a Netflix account. Am thinking about getting another unit for my bedroom TV.", "verified": true, "helpfulness": "0/0", "author": "Heinz M"}, {"rating": 3.0, "review": "ONLY A FEW SITES CAN USE THIS...MAYBE AFTER MORE SITES STATRT USING THEN IT WOULD GET 5 STARS!", "verified": true, "helpfulness": "0/1", "author": "WOODY GREGOIRE"}, {"rating": 5.0, "review": "use it all the time", "verified": true, "helpfulness": "0/0", "author": "Kathleen Appelhans"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Darren"}, {"rating": 2.0, "review": "Unless you have Hulu plus or Netflix, this is a waste of money", "verified": true, "helpfulness": "0/0", "author": "Stephane"}, {"rating": 2.0, "review": "Returned. It does work for live TVs", "verified": true, "helpfulness": "0/1", "author": "Panditaradhya V."}]