[{"rating": 4.0, "review": "From a technology standpoint I'd probably rate this 3 stars, but it fits perfectly into how I wanted to use. If you're looking to stream everything from your mobile devices then you're probably not going to be entirely happy. If you're looking to stream YouTube on your TV from your phone then you'll really enjoy it. It works pretty well with the supported applications and formats, but don't expect any other magical compatibility.", "verified": true, "helpfulness": "0/0", "author": "Joshua McFarland"}, {"rating": 5.0, "review": "One of the thing you should have at home.Very easy to connect and mobile.Would recommend to everyone to get one for their old folks as well.", "verified": true, "helpfulness": "1/1", "author": "Mogan Govindasamy"}, {"rating": 4.0, "review": "Very frustrating getting this to work consistently ours was overheating vey quickly. I wish I would have read the reviews that streaming amazon is not compatible with this unit. Otherwise it works great when it works!", "verified": true, "helpfulness": "0/0", "author": "meg168218"}, {"rating": 1.0, "review": "I give it one star because it is easy to use. I only give it one star because it doesn't work well. During a 90 minute movie it will stop as many as 5 times for several minutes each time to reload. On few occasions it would take several tries to get it to start the movie. I would recommend it only because of the low cost.", "verified": true, "helpfulness": "0/3", "author": "mred"}, {"rating": 5.0, "review": "Set this thing up in less than a minute.  Does everything as advertised.  Even has a nice pictures as a screensaver.  Does seem to get a bit finicky once in a while when we switch between devices..wife's s3 or my iphone 5, but works fantasically with both.  Probably going to get another 2 more for our other TVs.  Now, if Amazon Prime and Chromecast could just come to a business deal, it would be perfect and wink, wink, I could drop Netflix....", "verified": true, "helpfulness": "0/1", "author": "Frank"}, {"rating": 5.0, "review": "I found Chromecast HDMI Streaming Media Player a very practical, simple and inexpensive product. It has been a month and I can say that I am really satisfied.", "verified": true, "helpfulness": "0/0", "author": "KORKUT OZUYENER"}, {"rating": 2.0, "review": "Consistency is important. It trumps innovation, style, fun, or any other adjective used to describe technology. I really wanted to like this. I'm an IT professional, who started my career cutting my teeth on DOS, motherboards, and device drivers. Therefore, I felt undaunted by the task of getting Chromecast to work well. I gave up. First, it wouldn't connect to my network because I was using a repeater. After, flashing the device with DD-WRT and reconfiguring it, I got the Chromecast to connect and it worked well with all devices. Until it didn't. Sometimes it would work. Other times it wouldn't. Reboot after reboot after factory reset ameliorated the issues temporarily. At one point, it worked with every app, except the one I really wanted - Netflix (it had worked with it before). At first I thought it was a defective unit, until I saw a whole lot of people having similar issues with the only answers being - reboot and factory reset.I guess I'm just getting too old. It's not entertaining anymore to fiddle endlessly with settings. I'm returning it and getting something that works - perhaps a Roku or Apple TV", "verified": true, "helpfulness": "5/5", "author": "Manuel Castaneda"}, {"rating": 5.0, "review": "So easy to set up and use, very seamless transition from tablet to TV, then back to tablet or smartphone. Qualty of audio & video good. The only thing I don't like about it, very limited Apps, there's only a couple that are known, never heard of most of them.", "verified": true, "helpfulness": "0/0", "author": "Frank"}, {"rating": 1.0, "review": "Movies will  start playing run for a few minutes and then shut off. Every time. I do not use it.", "verified": true, "helpfulness": "0/1", "author": "Mike Farr"}, {"rating": 2.0, "review": "It works but not matter what network I am connected too it never a constantly smooth connection.  It disconnects often, but it's is innovative.", "verified": true, "helpfulness": "0/0", "author": "Vharo"}]