[{"rating": 4.0, "review": "I enjoy this product very much.  Works well from my computer and from my Android.  Two issues:  1. There seems to be a problem with the Android interface as every once in a while, when not in use, the android app will hang up and gives a \"cannot receive data\" message.  At this point the only way I know to resolve the issue is to reboot my phone.  2. Be sure to check the system requirements so you know what to expect.  I could not get mine to cast videos from a tab.  I finally think I  have located the problem and it was because my computer was too old.  You can use this link to check for your system.[...]Other than that I would give it 5 stars.", "verified": false, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Bought this a while ago and thought the concept was cool but the lack of functionality was a serious hindrance. With the new update, and the support of more systems (HBO Go, Pandora, Etc) it is extremely useful. Now if only it could naively stream networked files it would be almost perfect.And yes I do know there are several apps that do this, but I wish I could just point it at something and have it run that", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is an ok device. It works pretty well for the things I've used it for (Pandora, Netflix, Google Music, YouTube). Set up at my house was a breeze but I took it to a friend's house and we had some trouble getting it connected to his wireless network. I would probably give it 5 stars if I could access and stream content from my phone or local media server. I don't think it adds much to my digital experience, but then again it didn't cost that much either.", "verified": true, "helpfulness": "0/0", "author": "IntoxicatingIguana"}, {"rating": 5.0, "review": "Amazing quality. Very easy and comfortable to use. In constant development with more apps compatible everyday. All that for just 35 bucks. Best purchase ever! Thank you Google :)", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It would be nice if there were more applications that would run from my iphone.  It runs too slow when I cast from my computer.  You tube videos work great.", "verified": true, "helpfulness": "1/1", "author": "MJ"}, {"rating": 5.0, "review": "Nothing is better than a product for $35 (or $30 on sale) that works like charm. Period.Google continues to improve on this little miracle and I can't wait to see it happen!", "verified": true, "helpfulness": "0/0", "author": "Peter Babel"}, {"rating": 1.0, "review": "Just setup a PC or Laptop - Use an HDMI cable and stream internet direct to your large screen.  Get a wireless keyboard and you are in business.", "verified": false, "helpfulness": "2/6", "author": "David Carlin"}, {"rating": 4.0, "review": "Plugged in and installed and found my wifi and entered password and worked just fine.It has limited use as you will always need another device to use it. So far limited APPS to use but for a price (and flexibiity you can take it to vacation or family gathering during holidays) it is great.", "verified": true, "helpfulness": "1/2", "author": "K. DESAI"}, {"rating": 1.0, "review": "If you want to watch Netflix, Hulu Plus, etc. I recommend a Roku player, which gives a smooth viewing experience.  The Chromecast dropped the signal or played in a choppy manner.  Controlling it is a pain because you have to use your other device as a remote.  So even though you can move to another screen on your device and do other things, you still have to keep popping back to the other screen to control what you are viewing on the tv.  This might not be a problem for some, but after experiencing the difference between viewing via chromecast and a Roku, there was no question for me.I might add that I have a couple \"smart\" blu-ray players as well and the viewing and connection is still no where near as smooth as with a Roku.", "verified": true, "helpfulness": "3/4", "author": "Massachusetts Mom"}, {"rating": 3.0, "review": "1.  It interferes with my existing WIFI network and connection drop has started.2.  No way to disable SSID name broadcast3. Some time, it plays only audio but video freezes.4. Have concern on security. There is not a way to configure for securing this device.", "verified": true, "helpfulness": "1/1", "author": "R. Joshi \"R. Joshi\""}]