[{"rating": 2.0, "review": "This thing only works well for youtube. It skips a lot when using pandora. When using netflix and just stops working all the time. NOt a good purchase.", "verified": true, "helpfulness": "0/0", "author": "Kay Fort"}, {"rating": 1.0, "review": "this was a piece of junk couldn't stream Netflix movies if Hollywood was in my backyard what else should I expect Amazon sold it", "verified": true, "helpfulness": "3/9", "author": "richard sparks"}, {"rating": 5.0, "review": "Exceptional! Google has a amazing knack of executing simple concepts to perfection. It is so easy to set it up and use. When I saw the quality of the video on my 40 inch screen, I was blown away!!Only issue is lack of support for chrome based casting from Android phones/tablets. Reason is that chrome web store is not supported for Android Phones/Tablets", "verified": true, "helpfulness": "0/0", "author": "HappyGoLucky"}, {"rating": 3.0, "review": "I just won this chromecast on a contest.  I received it and hooked it up, set up was going well and then it would not connect to my router.  It gives you directions on how to adjust a setting on your router to get around this. I spent a few hours trying to figure it out, and then I seen a link that said not all routers are compatible.  I click that and checked and mine was not it gives me directions on how to contact the router company, but I have not got a hold of them yet.  My router is a Actiontec PK5000,  I still might get it to work but not real hopeful.If you now how to help me please feel free,  thank you!!!!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "That pretty much sums it up.  I bought this primarily because I wanted to be able to switch from DVD Netflix to online Netflix.  Thus far, it works like a charm.  Obviously, if your internet has too big of a hiccup, you're hosed.  But, that's only happened once.  We use it primarily with our iPad as the controller.  I've used Pandora a few times as well, which works well too.  Wish it had a few more apps that were compatible.  (Spotify would be awesome...) But, definitely $35 well spent.", "verified": true, "helpfulness": "1/1", "author": "Sean R. Wise \"Turtle441\""}, {"rating": 5.0, "review": "Inexpensive way to stream content from a PC or laptop to your TV (provided you have a free HDMI input).  Set up on my laptop with no problems but, for some reason, didn't want to complete installation on my wife's laptop until I deleted Chrome and re-installed it.  Very happy not to have HMDI cable stretching across the living room for someone to trip on.", "verified": true, "helpfulness": "0/0", "author": "Robert C. Sawyer"}, {"rating": 5.0, "review": "It was easy to set up and casting with it is a breeze. Hit that cast button and within second or so, what you want to watch is right on your screen. I was a little wary when I got it, because I heard that some routers were not compatible, or that you needed to have a strong wifi connection for it to work reliably, but I didn't experience any of those problems. I haven't had any problems with it all being slow, dropping connections or anything. Even tab casting with it has been pretty enjoyable experience. This bad boy is definitely worth the $30 spent on it. I would strongly recommend this to anyone, especially if they like to stream movies or tv shows but have no easily accessible way to get them onto their tv, except through hdmi cords and adapters, which can be a hassle.", "verified": true, "helpfulness": "0/0", "author": "H. Parker"}, {"rating": 3.0, "review": "I hoped the Google Chromcast HDMI would allow me to watch shows from Netflix on my TV using my Kindle Fire, but Amazon has stopped this function as far as I can tell.", "verified": true, "helpfulness": "0/1", "author": "Shirley R. Bennett"}, {"rating": 5.0, "review": "I love my Google Chromecast! I have no cable TV and I monitor everything my children watch. With Chromecast I can pull up what ever I want my children to watch. My children even know Captin Kangroo!", "verified": true, "helpfulness": "0/1", "author": "Mome"}, {"rating": 5.0, "review": "Two words : Buy ItIt is so easy to use and you can cast from netflix, pandora, your computer, etc. It basically turns your TV into one of those digital TVs for only $25 !", "verified": true, "helpfulness": "0/0", "author": "Jigna P."}]