[{"rating": 5.0, "review": "Pros:1. Casts videos, photos, movies, music from your phone/devices to TV easily.2. Works with android and apple devices (even Mac/PC with Chrome Browser) , and transfers to any TV with HDMI.3. Compact, easy to set up and travel with.4. Cast onto TV, then use phone/device as a remote. Can even exit casting screen and do other tasks on devices.5. Great value, mostly for android w/ Google Play usersCons:1. Limited compatibility, you have to use apps that support chromecast, such as Youtube, Netflix, Hulu, Pandora, Crackle, etc.2. Must be charging while use, but they include a charger and extension adapter so no problems3. \"Cast Screen is still in beta at the moment on Apple devices, so my iPad could not 'mirror' but works fine with my android devices.4. It transfers a signal from your remote device to your TV through wifi, and will not work well without a steady wifi connection.5. It's a Google product, so they want you to use Google apps and products to use it to its full potential.Overall, if you're looking for a way to play Google Play/Youtube/Netflix/streaming services movies from your small screen devices to your TV, this little thumb drive sized dongle will be of use to you. If you are more of an apple user you may be limited to only using Chromecast compatible apps and services. Try it, won't be disappointed!", "verified": true, "helpfulness": "1/1", "author": "angela"}, {"rating": 5.0, "review": "Probably the best product i've ever purchased. My complaint was that the free 3 months of hulu plus didn't happen. They charged my credit card $7.99 for 1 month. I canceled any other hulu but want that $7.99 credit.", "verified": true, "helpfulness": "0/0", "author": "dennis manion"}, {"rating": 5.0, "review": "excellent!!!", "verified": true, "helpfulness": "0/0", "author": "ERICK E. TAPIA HERRERA"}, {"rating": 5.0, "review": "Great for watching youtube and casting your web browser!", "verified": true, "helpfulness": "0/0", "author": "Nick Ross"}, {"rating": 5.0, "review": "Best dongle out there. isnt compatible with amazon instant but supports screen mirroring from an android device so you can mirror instant to your tv. So easy to use.", "verified": false, "helpfulness": "0/0", "author": "keith"}, {"rating": 4.0, "review": "Chromecast has worked well.  It is better than Roku in my opinion.  The only issue I have with it, is that you need to have your wireless router set just right, or you will not be able to communicate with it.  I was able to see it fine during setup, and the first two times I used it, then I couldn't connect no matter what.  I read that I need to have my router set a certain way, the only thing I didn't had enabled was UPnP, after that it has worked flawless.  I wish it was more robust to various wireless router settings.  I plan to buy a new router soon since mine is about 10 years old, I hope the issues are minimal.", "verified": true, "helpfulness": "0/0", "author": "BananaBaby"}, {"rating": 5.0, "review": "I am happy with this purchase. Tks.", "verified": true, "helpfulness": "0/0", "author": "Mario S."}, {"rating": 5.0, "review": "thanks seller...Excellent", "verified": true, "helpfulness": "0/1", "author": "Ez"}, {"rating": 4.0, "review": "Works very well, need more time to discover all capabilities. User guide information is very limited, have to go to second tier websites to access more information. Google should provide more detailed info about Chromecast with the product.", "verified": true, "helpfulness": "1/1", "author": "CCaribou"}, {"rating": 5.0, "review": "Bought is when it first came out in 2013. Was on the waitlist to get it. Great product; did just what we wanted which was to allow me to watch movies and shows streaming from our computer to our TV, and at the same time someone else could use the computer to game or surf. For $25 (that was the launch price) it was like getting another computer to HDMI device!Resale value was great too. Last year we made some changes and didn't need it anymore and I quickly sold it on Craigslist for my full purchase price.", "verified": true, "helpfulness": "0/0", "author": "GaLady31"}]