[{"rating": 5.0, "review": "Really  it's the best one out there...and the voice feature is something that makes it worth the money you pay.  It needs Skype though.", "verified": true, "helpfulness": "0/0", "author": "John Mickens"}, {"rating": 5.0, "review": "I bought this device when it first came out and I have been pleasantly surprised at how nice a device it is.  It is an ultra small device.  I like the overall experience with the voice command and the interface for finding movies and getting into other apps such as Netflix.  Parental controls are also very good to prevent my little kids from getting into movies beyond their age or buying apps.", "verified": true, "helpfulness": "0/0", "author": "Nate Pohlman"}, {"rating": 4.0, "review": "I'm having trouble getting sound on some movies, Alpha House is one.  I keep getting continuous dot sound almost like the letter E in morse code.  There are a few more that I can't recall names of movies.", "verified": true, "helpfulness": "0/0", "author": "George G Taylor"}, {"rating": 5.0, "review": "Finally, a box that's easy to use and open to many inputs. ALMOST as beautiful as the Apple product and speech recognition is very good.", "verified": true, "helpfulness": "0/0", "author": "James I. Cochrane"}, {"rating": 2.0, "review": "I have been using a Roku 2 for a couple years now, I have always wanted an easier way to search for content. The commercials show people searching for content simply by talking into the controller. This feature works, but only for content on Amazon NOT Netflix or other apps on the device, so this simplification only applies to Amazon content. Shows I can watch for free on Netflix cost $1.99 an episode on Amazon, and since Amazon 'talk search' only finds Amazon content I feel this product misleads consumers by inconvenience for a potential sale and seems a sort of dishonest. I recommend Amazon fix the feature to search through all applications for search requests. It is a great feature executed poorly. My second issue was a series of audio issues. Out of the box the Amazon TV is set for surround sound and without going into settings to make corrections the device had a high pitch 'feed-back' to the audio. I was able to fix this by changing the audio settings to HDMI, there is also an option to place the device on optical audio. My second audio issue was using Netflix on this device, some shows had audio while others did not. The fix is to uninstall and reinstall Netflix or to 'empty the cache' both are unnecessary steps that are time consuming. The device had this issue every time I used it and as a consumer I expect this product to require no technical support on my part. Lastly, Amazon TV has less applications than other media players, my biggest quirk is the absence of and inability to add additional news applications, oddly seems like a sort of censorship that a media player should not be imposing on the consumer. I have returned my Amazon Fire TV for a refund and would consider this product in the future once they correct the issues noted, other players on the market function better (less problems, more content) for the same price.", "verified": true, "helpfulness": "4/7", "author": "TW"}, {"rating": 4.0, "review": "Love it. Would give 5 stars if it could pull in local channels and eliminate cable/sat TV altogether.  At least work an on demand deal with the major networks..", "verified": true, "helpfulness": "0/0", "author": "A. Fish"}, {"rating": 4.0, "review": "I decided to upgrade from my Apple TV (I am a huge Apple fan) to the Amazon Fire TV...What a huge difference. When you decide what you want to watch and press play its starts instantly with NO wait period at all.My apple tv would think for a couple of minutes and sometimes it would just stop playing because it could not keep up.The voice control WORKS... Just say what you are looking for and it pulls it up. It is the first voice control I have ever used that works.Why 4 stars instead of 5. The remote works great but feels cheap in your hand compared to Apple but for me it was well worth the buy especially being a Prime Member. Netflix and Hulu Plus work well through this system as well...", "verified": true, "helpfulness": "0/0", "author": "Brian Whitley"}, {"rating": 4.0, "review": "While it is a little confusing at times once learned it works good. Large amount of content for viewing.Font size for descriptions could be better(larger) so the words on screen are easier to read.Better then Blockbuster app.", "verified": true, "helpfulness": "0/0", "author": "DONALD J FREEDMAN"}, {"rating": 5.0, "review": "It's the SPEED of downloading and streaming!  That is what you can't compare to any other player or device.  That is what is so much better about this streamer.From the time you click Watch Now, till the time it starts playing, it's almost instantaneous.It's like going from a 28.8 Baud Rate Dial Up Connection to Broadband, okay, now do you get it.... so who cares what it looks and \"feels\" like, it is fast, there is no buffering, no locking up.Anyway, don't get hung up on what this thing doesn't have, those other players are Turtles in a Rabbit's World!The voice controller is very cool.The game controller is very cool.I just wish it had......... an internet browser interface or app built into to it.  (maybe one exists, I'm not sure). I replaced my Logitech Google TV device and keyboard, with this, and the ONLY thing I miss is the ability to access the internet directly via the device.My Logitech Google TV would overheat, lock up and need to be cooled, and rebooted.  On Google TV, the Amazon On Demand App would lock up, or have buffering issues while watching programs after a few hours of use.The only negative I can find, (and this may only be a issue with my Sony A\\V Receiver (Sony STR-DN840 7.2 Channel 1050-Watt A/V Receiver,)  is that it seems the signal to the projector flashes on and off, as if the HDMI cable is lose, but it isn't.  I can fix this by playing it a bit,(re=selecting and\\or switching the HDMI source, or powering the receiver on and off, but it is annoying.  I don't know what the cause may be, because once it works, it stays working, very strange.", "verified": true, "helpfulness": "0/1", "author": "BAMBAM1"}, {"rating": 5.0, "review": "As I began looking for a replacement for an overpriced cable system, I received an email advertising the Amazon Fire TV.  I read Amazon's pages about how easy it was to set up and use and the superiority of their product, I was, of course, skeptical.  However, I ordered two of the units.  When I received them, two days after ordering, thank you Prime, I connected them and was watching streaming TV in about 10 minutes.  Amazon delivered what they promised, an easy, 1, 2, 3, connection and I was watching TV.  The responsiveness of the system and delivery of entertainment is something that cable and satellite companies only dream about.  Because I have Amazon Prime, the units were already registered with Amazon for streaming their Prime service and installing and setting up Netflix was very simple.  I have recommended Fire TV to my friends and I know at least one of them is also leaving their cable behind.  Thanks Amazon - a great product.", "verified": true, "helpfulness": "2/4", "author": "Patrick Root"}]