[{"rating": 3.0, "review": "Good but not great. To many regular TV shows that you must pay for. Better than Hulu but not by much.", "verified": true, "helpfulness": "0/0", "author": "willie martin"}, {"rating": 4.0, "review": "Great for the whole family. Any chance we can start rating content like app, shows movies while browsing?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I am having a very difficult figuring it out and what I want to watch most of the movies I have to purchase I even bought amazon prime. Help!Sincerely Victoria Bromley", "verified": true, "helpfulness": "0/1", "author": "Purple"}, {"rating": 5.0, "review": "Great product. I bought this so my daughter could watch her cartoons in another room. It works great, hd picture quality, no speed issues. I've actually had better luck with the fire tv than I've had with my vizio smart tv. And you can take it with you when you travel and enjoy Amazon prime and Netflix in your hotel room. The voice control works good and picks up voice commands correctly.", "verified": true, "helpfulness": "1/1", "author": "Craig F"}, {"rating": 3.0, "review": "Good for movies. Realtime tv, if you like being there on time on schedule only 2 watch, its fair. If you are used to a DVR, it sucks unless you buy series after series. Sling TV gives you the networks (25$ a month), but no \"watch on demand\".  And FORGET FAST FORWARDIND THROUGH COMERCIALS!  Not a total replacement to satellite  unless you live in front of a TV and like commercials. :-(", "verified": true, "helpfulness": "0/1", "author": "cz"}, {"rating": 5.0, "review": "It gets 5 stars because screw AppleTV. Works great. I bought one for every TV in the house. I HATE the smart TV interface built into my TV. I love this one...and the voice search works surprisingly well.", "verified": true, "helpfulness": "1/1", "author": "Just Some Dude Who Buys Stuff on Amazon. A lot."}, {"rating": 4.0, "review": "I use the system often.  Easy to use and movies are recent and most are entertaining. I have not watched many specials or TV shows but there is a good selection.", "verified": true, "helpfulness": "0/0", "author": "David F."}, {"rating": 5.0, "review": "Simple to install, use.  Good buy for the services available through it.", "verified": true, "helpfulness": "1/1", "author": "Harry Chase"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "KM"}, {"rating": 5.0, "review": "This device is a nice addition to TV... everyone should have one...", "verified": true, "helpfulness": "0/0", "author": "timothy smith"}]