[{"rating": 5.0, "review": "Met every aspect of what was advertized.", "verified": true, "helpfulness": "0/1", "author": "Charles L. Still"}, {"rating": 1.0, "review": "Completely unacceptable.  NO FREE PRIME.  Spent four hours transferring around India call centers to get absolutely nothing.  This experience leaves me with no choice than to cancel my account.  Good for you Amazon.  Outsourcing works wonders.", "verified": true, "helpfulness": "1/9", "author": "Gsweater \"gsweater\""}, {"rating": 5.0, "review": "Fast and easy to use", "verified": true, "helpfulness": "0/1", "author": "Matt"}, {"rating": 4.0, "review": "Expectations were surpassed with this device. Had read reviews and overall folks are mixed on looking at the fire TV. Hardware wise, this device is one of the best out there with quad core and 2 gigs of ram. Can play high definition videos just fine.Pros: fast device; Wi-Fi is dual band and supports wireless n technology (I'm currently getting 110 Mbps download rate on the 5ghz frequency); side loading apps is possible which enables you to get apps from play store on your device- I side loaded my drop box app, and have been able to download directly from this app; once the device is on your network, you can use a PC as a server and also use the storage on the PC as well so as to make the small 5gb storage on the device a mute point.Cons: the device only has 5gb of storage... If you are a gamer, this does not allow you to download many apps- although they do allow for quick recovery of your Amazon purchased apps through their cloud; the USB port only allows for a USB keyboard/mouse add-on which is a must if you plan to side load non Amazon apps as the remote is not really functional for those; any side loaded apps will not show on your home page and you will have to take extra steps to access them; although I didn't root the device, it is possible if you know how to do it in advance... It automatically updated on startup; network card is only 10/100 Mbps... Better off going wireless.Overall very happy with the device. Plan to get a second unit for a second tv in the house. Have been able to side load the time Warner app and this unit will serve as a box for a second room... Unit will pay for itself by saving the rental fee of another cable box.Hope this review helped a few of you that were on the fence for purchasing it.", "verified": true, "helpfulness": "0/0", "author": "Richie P."}, {"rating": 5.0, "review": "I could not love this more!", "verified": true, "helpfulness": "0/1", "author": "Kathryn Beaupre \"~katie~\""}, {"rating": 3.0, "review": "There is no capability in this device to stream from either my PC or my MAC - it also does not come with a HDMI cable which must be purchased separately !", "verified": true, "helpfulness": "0/3", "author": "Donald E Zavodnik"}, {"rating": 5.0, "review": "It is everything I hoped it would be thank you so much", "verified": true, "helpfulness": "0/1", "author": "judy hoskins"}, {"rating": 5.0, "review": "Amazon Fire TV is great we Cant answer now enjoy all the perks of Prime plus all the apps like Netflix, YouTube, HULU+ just to mention a few. My husband and I gave each other Amazon Fire TV for Christmas what a great gift that keeps on giving!", "verified": true, "helpfulness": "0/0", "author": "Aliqat \"A Good Fairy\""}, {"rating": 5.0, "review": "Very happy with product", "verified": true, "helpfulness": "0/1", "author": "Kevin Robert"}, {"rating": 5.0, "review": "Everything about AMAZON FIRE TV is great.The hook up was less than a minute,it took about five minutes for it to ACTIVATE.Its much better than cable or satellite tv.THANKS AMAZON", "verified": true, "helpfulness": "0/0", "author": "Lewis Rose"}]