[{"rating": 5.0, "review": "Even though it isn't a box that goes on your set top, It does everything that I want it to do except podcasts, I'm sure that this functionality is coming soon.", "verified": true, "helpfulness": "0/0", "author": "Tim Foy"}, {"rating": 5.0, "review": "Plug in Chromecast, fire up your Nexus 7 and watch just about anything.  Just remember you'll be streamikng through apps from Netflix, Hulu+, etc., and not your browser.  Easy Peasy.", "verified": true, "helpfulness": "0/0", "author": "mvdljca"}, {"rating": 3.0, "review": "easy to install, convenient for slide shows, not very good for streaming thougheven w wifi signal strength maxed out, it LAGS", "verified": true, "helpfulness": "0/0", "author": "Robert Button"}, {"rating": 5.0, "review": "This is one of the best products I have ever brought. I like watch my Netflix and Hulu Plus on my 55\" TV.", "verified": true, "helpfulness": "1/1", "author": "Julius Brown"}, {"rating": 5.0, "review": "Very easy set-up and control using a smartphone. Only caveat is that there are only very few apps to use with.", "verified": true, "helpfulness": "0/0", "author": "Sree Govindan"}, {"rating": 5.0, "review": "What a great gadget!  Easy to install and set up.  Had it working in less than 15 minutes.  Love it!", "verified": true, "helpfulness": "0/0", "author": "infinite \"stld22\""}, {"rating": 5.0, "review": "This is the coolest device. I can watch things directly on my TV. It shipped right away, it installed easily and It is easy to use. I hope they make more apps that can be used on it.", "verified": true, "helpfulness": "0/0", "author": "James E. Lyon"}, {"rating": 4.0, "review": "Great with you tube and netflix. When I watch you tube, sometime the video stays still. Only fix I found is to reboot chromecast. Otherwise I'd give 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Yan"}, {"rating": 2.0, "review": "I am slightly disappointed that there aren't more apps available at this time. I thought by now it would have more apps and internet browser availability.", "verified": true, "helpfulness": "0/0", "author": "Ronald Roy"}, {"rating": 1.0, "review": "Be sure you have a VERY strong WIFI signal in the room where you want to use ChromeCast. I ONLY have a strong signal, but it kept dropping the connection. I never did get any video to stream.The actual content that you can stream is still too small. It's not fully compatible with enough devices. Apple TV or Roku are much better devices. I'll be getting one of those instead!", "verified": false, "helpfulness": "0/1", "author": "danmusician"}]