[{"rating": 3.0, "review": "Like so many other aspiring supervillains, I too dreamed of seamlessly uniting my laptop, mobile and living room content on one HDMI-equipped screen. I dreamed big; show off my plans for the Fart Ray to the League of Evil, play that episode of Pokemon that causes seizures for a room full of people and enjoy my collection of Windows 95 screensavers on the big screen.Casting Tabs:Here's the deal: if you want to use Chromecast to 'Cast' Google Chrome tabs to your TV, you're going to need a relatively new wireless router if that means watching Putlocker or other Flash videos. It does, however, perform excellently with static pages.Travel:Chromecast's portability is only useful if you plan on taking the device from one room to another - or if you're going to be taking it to a friend's house - but hotel and public WiFi are out. You'll need a router which supports multicast, which public networks will not, and you can't create an Ad Hoc connection to stream directly from your device to the Chromecast.Desktop Casting:Google stresses that this feature is still very much in the 'BETA' stage. The capitalization is no doubt for emphasis! It's buggy, crashes frequently and is by no means a practical alternative to using a wired connection to bring your PC/Mac desktop into the living room. Keep an eye out for future updates from Google which may make this feature more reliable.Netflix & YouTube Casting:In my testing, Netflix would crash or end up locked in a continuous loading screen when casting from my Samsung Galaxy Tab,  Samsung Galaxy S III and iPod Touch (5th Generation). READ CAREFULLY - When the Chromecast encounters an error of this type, it broadcasts its own SSID (network signal name) and totally disconnects all other devices on your network. You will need to unplug the Chromecast and wait for your devices to reconnect. On the plus side, the Chromecast is totally badass at disrupting the WiFi connection of everything on your network, which is great if your roommate likes to stream Happy Feet really loudly.YouTube, however, works flawlessly. Since the Chromecast doesn't actually stream video from your device directly, you can feel free to take a call, play a game or do whatever you like with your mobile device or computer while YouTube is playing your content.Multiple Devices:Switching between your phone, tablet, iPod or computer is seamless; just cast the content from whatever device you want to use and it will start playing.Be aware that anybody connected to your wireless network can also control the Chromecast - no password, user account or security verification required. If you plan on using the Chromecast in a public place or at a party, don't. Anyone can download the Chromecast app and start streaming Desperate House Husbands 2: The Dickening at your next house party or business conference with the League of Evil.Pros:-Small form factor-Still cheaper than descending into a life of supervillainy and crack addiction-Receives updated functionality from Google via updates-Doesn't require your mobile devices to maintain a WiFi connection-The Android and iOS software makes it very easy to cast from inside compatible appsCons:-Not truly portable-Netflix and YouTube are really the only 'Apps' available; developers are still waiting to see if this catches on-Tab casting video content is buggy; video quality does not adjust automatically-Netflix casting can disconnect all of the devices on your network-Extremely easy for random strangers to 'Cast' porn onto your TV", "verified": true, "helpfulness": "3/3", "author": "Reid"}, {"rating": 5.0, "review": "I got this for my girlfriend as a gift and she loves it.She uses it frequently to stream Netflix movies, play music and watch YouTube videos. She set it up all by herself (I'm the geek not her) and she had no problems, I wasn't even around when she set it up!", "verified": true, "helpfulness": "0/0", "author": "RJ Fischer"}, {"rating": 1.0, "review": "If you are into putting you chrome browser on the TV them go for it. That is the only good thing you can do with it. What's missing is screen casting or also called multi screen. From you android device this is complete and utterly useless. The best you could do is share you YouTube video with TV. If you are use to dlna or airplay streaming then this device is like going back 60 years. Google why can't you have your fetchers work together.", "verified": true, "helpfulness": "0/2", "author": "O. Almoayed"}, {"rating": 5.0, "review": "I was a little concerned because others have complained that the chromecast either does not work with ATT U-verse or requires that UPNP be turned on. I had no such problem. It worked right out the box. I hooked it up to my TV and used my U-verse cable box to provide power through the USB plug. Both Netflix and Youtube worked perfectly. The Cromecast does get quite warm but the instructions tell you it does and that apparently is normal.I might buy another Chromecast so I can have one on each of my TV's.", "verified": true, "helpfulness": "0/0", "author": "Delta"}, {"rating": 5.0, "review": "For some reason, my laptop when hooked up to my TV via a HDMI never got the picture to look right. With Chromecast, I can now watch Netflix on my TV!", "verified": true, "helpfulness": "0/0", "author": "Thanura Jayawardena"}, {"rating": 5.0, "review": "I am very happy with Chromecast.  It took awhile to get it and I didn't get the three free months of Netflix, but I got over that.  We're enjoying Youtube videos on our TV and casting movies from other websites.  Some people have complained that the video and audio are not synchronized, but I haven't had any problems with that.I'm seriously considering terminating my satellite TV subscription since between Chromecast and Roku, I have more content than I could probably watch in a lifetime and, of course, both keep getting new content.  I'm also tired of paying through the nose for over 200 channels of satellite TV when I only watch about 15 channels regularly.  I've heard that apps for Chromecast are in the pipeline and I'm really looking forward to them becoming available.  It's a great deal at just $35.  I highly recommend Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Beau Shawn"}, {"rating": 3.0, "review": "This does not mirror the whole display to the TV.  It only displays the content on the TV that is designated by the app using it like You tube.  But the number of apps are limited and I kept finding that what I really want is for it to mirror the entire display so I can do things like email.  If they allow a future version where you also have the choice to mirror the display this would be perfect.One note to be aware of, if the display doesn't have a USB port to power it you will need to plug in to an outlet.  But the USB port is pretty convenient if the display or TV supports it.", "verified": true, "helpfulness": "0/0", "author": "TBD"}, {"rating": 5.0, "review": "At $35 this is impulse buy territory. Takes less than 3 minutes to set up, and instantly give you the ability to stream youtube, netflix, and any open tab you have on your Chrome web browser. It's worth it as it stands today, let alone the fact that they'll keep improving it and adding support for new apps (Hulu plus was added like a week prior to my typing this).", "verified": true, "helpfulness": "0/0", "author": "Rick Anthony Rodriguez"}, {"rating": 4.0, "review": "If used with an android phone you're (stock) limited to Netflix, Hulu, and the Google Suite. Hopefully Google will integrate full device mirroring as a dual screen setup which would make this perfect.Laptops are easier as Chrome will let you broadcast directly to Chromecast and have a pseudo dual screen setup. (Also beats out many of the other $100+ products out there like Samsung's AllShare)", "verified": true, "helpfulness": "0/0", "author": "CJ"}, {"rating": 2.0, "review": "As an Amazon Prime customer I was very excited when I saw the advertisements for the Google Chromecast device.  I bought it and received it today and immediately hooked it up and tried to watch an episode of \"The Good Wife\" which is an Amazon Instant Video (AIV) TV series.  Needless to say I was very disappointed when I received the message that the AIV format wasn't currently supported. I bought this device specifically to watch AIV's on my HDTV. Hopefully, Google and/or Amazon will develop this capability in the near future.", "verified": true, "helpfulness": "1/2", "author": "TomDel"}]