[{"rating": 5.0, "review": "Love it!!!  Was going to buy another Playstation but since we're really not gamers. This was an EXCELLENT choice!  Came highly recommended.  Five stars!", "verified": true, "helpfulness": "0/0", "author": "Debi"}, {"rating": 1.0, "review": "Don't.  Given the nickel and diming nature of Prime and the fact that other similar devices (roku) allow you to easily access real free content (HGTV, Cartoon network, nat geo to name a few) why would I want to pay prime or jump through flaming hoops like a trained poodle?  I do understand that there are work arounds BUT using it as intended it would cost me more to access the current content that I have access using this device then it would to have time warner come and reinstall cable.  Install was easy, product support is terrible.", "verified": true, "helpfulness": "3/6", "author": "Frank P Lee"}, {"rating": 5.0, "review": "I just bought a Fire TV device and it has been great so far.Technically I did not need this, as I have a smart tv and a game console, both of which provide the same online viewing options. However I have been disappointed with their performance to date, I am running the latest software on each device and have them configured correctly, however performance has been frustrating to say the least. I even upgraded my Internet connection and routers to see if this would help, alas, no.So, I purchased a Fire Tv. I have been impressed with this device out of the box. it is the size of a double cd case, small and compact. Came pre configured from amazon with my account info, so I was up and running in less than 2 minutes. Viewing has been great, as it should be. This devise is easy to use, and the voice commands actually work.No issues so far, this is now the default device we turn to for all of our online viewingI highly,recommend buying one, you will not be disappointed", "verified": true, "helpfulness": "0/0", "author": "Johann"}, {"rating": 5.0, "review": "This was a great buy, ... we love it so far.  It had a flawless setup and it has had great performance.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "LEM"}, {"rating": 5.0, "review": "I have all (3) Apple TV, roku and now amazon fire.  They each have their place, but I have removed the roku from my main setup and replaced with amazon fire.  It is fast, great for amazon prime.Each unit has its pros and cons, but I would rate the fire as very near the top ( I am still a big Apple TV fan).", "verified": true, "helpfulness": "0/0", "author": "Sbagdan"}, {"rating": 3.0, "review": "I had hoped this unit would be so simple that my wife would regularly use it to access Netflix, but the whole process of running it (including switching the video input on the TV) is just a bit much for her to master.  But, the device works, and in some ways is even easier for me to use than trying to do a Netflix search on the small qwerty keyboard that works with our Sony smart TV in the living room.", "verified": true, "helpfulness": "1/1", "author": "newburydave04"}, {"rating": 4.0, "review": "Fair amount of apps hopefully there will be more choices. would like to see more movies on prime since the price is going up.", "verified": true, "helpfulness": "0/1", "author": "Wayne"}, {"rating": 5.0, "review": "I've had this for about a month now.  I must say, I'm really impressed with it.  I bought the kindle fire hdx bundled with the fire tv.  The ability to toss a video onto my TV from the kindle is really cool.  X-ray is... frankly it is amazing.If you're on the fence about buying this, I recommend pulling the trigger and doing it, especially if you're a prime member.", "verified": true, "helpfulness": "0/0", "author": "Warranted"}, {"rating": 5.0, "review": "The Amazon Fire TV is a fabulous piece of equipment for anyone who likes movies. It is easy to set up and so small that it is almost invisible. I have Apple TV and this blows the doors off that unit! Too bad Apple you really missed the boat on this one!", "verified": true, "helpfulness": "0/0", "author": "KNIGHT CRUSADER"}, {"rating": 4.0, "review": "One big gripe. As far as I can tell, there's no way to limit the list of movies and tv shows to what is available for Amazon Prime members. This makes it very inconvenient to find things that are free to watch.Voice recognition is not a helpful feature if it does not list prime member free acces showsThere are some categories that are limited to Prime (Most Popular on Prime, For Kids on Prime) I want to be able to just see what's available for Prime or at least be able to see by category what's available for Prime. I'm sure this isn't an oversight. I suspect Amazon wants to force us to look at everything and be tempted to buy/rent things but if they really want to compete with Netflix, they'll understand that we pay for our Prime membership to be able to watch free movies conveniently. Also need to be able to find a link and access to the online manual much more easily. A workaround is to do your searching on the web and then search specifically on the device. Even with these drawbacks I am satisfied with the product and do recommend it", "verified": true, "helpfulness": "0/0", "author": "Careful shopper"}]