[{"rating": 3.0, "review": "Bought this since I switched from iPhone to android and already had an apple TV. I was dissapointed thought it would do a lot more and I couldn't get it to register with my Note 3 I actually needed my iPhone to set it up! Makes no since that Google works best with iOS maybe they need to pull there heads out down in silicone valley!", "verified": true, "helpfulness": "0/0", "author": "Smoothdigit"}, {"rating": 5.0, "review": "Awesome product.  I'm excited to see in the near future more comparable applications. Worth the price paid for. I can stream from iPad and android device with no problem.", "verified": true, "helpfulness": "0/0", "author": "E. Rosado"}, {"rating": 4.0, "review": "Exactly what the headline says. It is cheap, easy to install and get running but it unfortunately needs more apps. The apps seem like they are slowly coming. This greatly increased the value we get out of the cheap TV we own.On occasion Netflix's app would fail when using an iPad or iPhone but it was rare. Restarting the app or phone/tablet would sometimes help.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 1.0, "review": "If you have an Android, mentally change my rating 25 stars and go have fun! I don't have an Android so I'm not having much fun with my Chromecast. Setting it out was no fun at all. It took me three tries. Then I realized the Chromecast app that I downloaded for my iPad to set it up does really do anything. Maybe I'm not doing it right? But, hey, \"making the user do it right\" is so IBM PC 1990s.Contrast this with my experience with the Apple TV. It was relatively easy setup and when it was finished, dozens of access points appear on my TV screen. Netflix, YouTube, etc. I could even look at my own pictures and my own videos. Friends, see the other reviews complaining about not being able to see videos that they made it home.If the Chromecast is Google's way of improving their sales of the android operating system, they have succeeded. Otherwise this is a failure.", "verified": false, "helpfulness": "2/2", "author": "Donal B. Botkin \"View[ + ]Finder\""}, {"rating": 5.0, "review": "I picked one of these up so I could use a flat panel in the back bedroom that doesn't have a cable jack. A cable jack would have been an easier solution but I hope to convince the family that cable TV is a terrible waste of time and money and get rid of it entirely. This device was easy to setup on my Android smart phone and an Android tablet. The programming options are somewhat limited but Netflix and YouTube suit my needs since I don't spend much TV time in the bedroom. I like that I was able to power it from a USB jack on the TV instead of using the AC adapter.", "verified": true, "helpfulness": "0/0", "author": "Ricomalo"}, {"rating": 5.0, "review": "I love this so much and planning to order for other TVs too. The cool thing is I can control the content from all my devices.", "verified": true, "helpfulness": "1/1", "author": "Parameswara R. Arrepu \"Params\""}, {"rating": 5.0, "review": "If you're a big netflix watcher, this is a must have gadget! It's a portion of the price of a Apple TV and does just as good.I watch Netflix regularly and this was easy to set up, connect and I will actually be buying an extra one for my living room TV and one for my mom.", "verified": true, "helpfulness": "0/0", "author": "Napoleon"}, {"rating": 3.0, "review": "Pros: I can stream my desktop to my TV wirelessly, and easily.Cons: The feature I use to do this is \"in beta\", and while it works, it has framerate issues. I have an engenius commercial router, so that is definitely not the bottleneck.There are apparently apps that you can use to stream stuff from various devices, but I needed it as a desktop projector to which those bugs haven't been worked out.3 out of 5 stars because I was using an auxiliary function, but it's a function no less and shouldn't be sold to consumers \"in beta\".", "verified": true, "helpfulness": "0/0", "author": "Gary Hatch"}, {"rating": 5.0, "review": "Great device.  No issues whatsoever.  There are several apps that use it, and more coming it seems. Buy one for yourself or a friend.  Great gift..", "verified": true, "helpfulness": "0/0", "author": "Hunter Lundquist"}, {"rating": 2.0, "review": "I had high hopes for Chromecast given that I use Android tablets and phone, but that hope has been dashed.The built in wifi is 2.4Ghz only which is disappointing, and the device was just too slow to be useful.I have a great dual band router and very vast broadband -  get 50mbps down, 12mpbs up on N devices, but still a Netflix video took 20-30 seconds to begin playing, and then was very pixelated and useless.Was able to cast from Chrome browser, again slow and painful process.Tried for two days now it just sits.", "verified": true, "helpfulness": "0/0", "author": "Matt G"}]