[{"rating": 5.0, "review": "If the Roku 3 and Fire TV were to get into a fight?  Who would win.Short answer: Fire TV TKO's the ROKU in the first round.Amazon has perfected the online shopping game by being one of the first companies to make online shopping a breeze in conjunction with meta data that tailored  shopping experience and suggestions to each user profile while also offering endless products.  Then they perfected the shipping game; with fast and affordable packing plants and hubs.  Supplement that with exceptional customer service, Amazon quickly became a mammoth.Just when you thought Amazon couldn't get better, they came out with Prime.  A way for loyal users to pay an annual subscription for expedited (free) shipping and to get a massive library (namely books, movies, shows) at their disposal.  Amazon prime members rejoiced (me included).Like Apple, Amazon was a tech company that sought perfection and put the user first.  But not just by merely listening to their consumers but also by innovating and constantly pushing the edge.  It's true, 99.8% of the money Amazon makes goes back into production, improvements, innovation and research.This same perfection and dedication to their consumers is evident here in the Amazon Fire TV.  Where to start?  It's hard to choose because it's all superbly done.To date, Amazon Fire TV offers the fastest streaming device on the market.  Bar none.  Why?  Because it sports a quad-core processor--Qualcomm Krait 300, quad-core 1.7 Ghz-- (the only amongst its competitors to do so).  This is the type of processor you would expect to find only in a serious gaming console (perhaps previous gen), high-end tablet or smartphone.  To get the most of the responsiveness of the menu and true HD performance and Dolby Surround Sound in Video and Gaming, Amazon recognizes that a strong engine is required to do so.  Amazon claims this processor is 3x the processing of Roku 3 and Apple TV and it certainly shows.  That wouldn't be enough for Amazon, it also sports 2 whopping Gigs of RAM for serious multitasking allowing it to have a faster trigger than John Wayne (and make it so that you can see every pore on John Wayne's forehead).  Every one else in the streaming game only has 512KB.  Ouch for the other guys.What's more is that it has a dedicated video card. The Qualcomm Adreno 320 is a monster video engine you might find in a high-end smart phone.  This video card is more than worthy of supplementing HD quality video streaming but it also emulates a high-end tablet for gaming and apps on your big HDTV screen. Though gaming is not the precedence here, it's really sweet that Fire TV has opened up nearly the entire Amazon Apps library for Games and Apps. The Roku 3 has so-called Games but outside of Angry Birds, its library really pales in comparison to a true marketplace like Amazon's.  The only pitfall for the Fire TV, in regards to gaming, is that it requires the $40 Fire TV game controller.  However this game controller comes with $16 worth of Amazon credit ($6 of way of a rather good game of any console standard--Sev Zero and $10 worth of Amazon coins--1000 coins for your Amazon purse).  Also note that the Fire TV supports any bluetooth game controller and people have successfully used their Xbox 360 controllers with the Fire TV via the Xbox 360 Wireless Gaming Receiver. Also, I noticed that certain PC game controllers work with the Fire TV via its USB port (with some hiccups i.e. certain buttons do not function or are mis-assigned).Fire TV has just emerged and its already making its competitors look like dinosaurs.  Since when did Amazon become a hardware beast?  Since Amazon wanted it to.So I realize specs aren't enough.  Just because you have a mean engine, doesn't mean you have a nice car. Putting a supercharged small block in a Dodge Omni (if that's even possible) doesn't make it any less crappy.  So, what else makes the Fire TV so special and stand out amongst its competitors?  Well--for starters, it's the only real streaming device that contains a true game and apps marketplace.  Thanks to Amazon's App marketplace, the Fire TV apps library will always be an endless venture and one that will always be improved upon.But let's get back to the basics.  It's a streaming device, with that you need 1) a solid, responsive and easy-to-navigate menu with a remote to match  2) quality HD video and true surround sound 3) seamless network connectivity either via WiFi or wired ethernet 4) loads of apps support for the backbone.  5) simple installation.1) Menu:  What I like--  It's simple, well-designed and, more importantly, uber-responsive.  There are no hiccups, delays or stuttering like you sometimes experience on the Roku or Apple TV.  Some say the menu is not as \"warm\" as the Roku but what it lacks in thrills or warmth, it makes up for in being straight-forward, intuitive and responsive.  Though, what I do find warm is it's ease of use, the introduction you receive from a friendly, hand-drawn, animated cartoon when you first turn on your device that makes for an elegant tutorial and the seamless syncing it does with your Amazon account without having to enter any of your credentials.  What is also warm, would be the flawless Voice recognition mic built into the remote and how easy it is to navigate the menu.  Also, the controls on the remote are not only \"snappy\" and responsive to what you see on screen but simple and intuitive.  The warmness that's attributed to the Fire TV comes from the \"Fire\" in your \"TV\"; everything from your TV (ratio, resolution) to the sound output, nuance settings and Amazon account are all automatically detected.  Meaning, everything is ready to go out of the box (and it looks dazzling).  The only things that require configuration are your WiFi settings (if not connected directly to ethernet) and any Apps (like Netflix) requiring account authentication outside of Amazon.2) Video and sound quality:  As we already discussed, video quality and frame-rate (FPS) are top-notch on the FIRE TV, above any other streaming device on the market thanks to it's superior hardware architecture.  This architecture enables true Dolby Digital Surround Sound as long as your stereo receiver or TV supports it.  The difference might not be earth shuttering compared to the Roku 3 but its in the little things such as the lack of video/sound hiccups. Maybe its me (and a few other users) but we feel the Fire TV looks more brilliant (vibrant).3) WiFi: Thanks to the Dual-band, dual-antenna Wi-Fi (MIMO), your wireless connectivity to your router is maximized making the most of the channel between your Fire TV and the internet.  With that, you should experience less intermittency and streaming hiccups and buffering.  But remember, your streaming can only be as good as your internet speed.4) Apps Support: The two milestone apps that standout for the FireTV are, well obviously, Amazon Prime Instant Videos (which is less like an app than something that's integrated into the menu beautifully) and Netflix.  I have tested both and happy to report that both play exceptionally well on the Fire TV.  In fact, because of powerful graphics and processor engine of the Fire TV, it outscores its competition in every category of quality, sound and framerate (FPS); playing at blistering frame rates with exceptional quality. Leaving your friends asking \"Is this a blu ray?\". It's fun to watch their jaws drop when you tell them that it's a streaming device.Reasons why it could be considered better than blu ray?  Though the picture and sound match that of a blu ray player, the loading times, in my experience, are exponentially quicker on Fire TV.  Fire TV is also equipped with ASAP (Advanced Streaming and Prediction) which dynamically learns from your past selections and pre-buffers shows and movies that you are more likely to queue up next.5) Installation couldn't be any easier.  Think the opposite of installing Ikea furniture.  Step 1: Simply plug in the power cable, HDMI cable from your Fire TV to your HDTV and ethernet cable if you decide on a direct connection versus Wireless.  Step 2: Place the batteries in your remote and the Fire TV will auto-detect it.  Voila!  You're ready to go!  Your Amazon account will automatically be signed in based on the account you used to purchase the Fire TV.  Leaving plenty of time to make popcorn to gear yourself up for Star Trek: Into Darkness.  Step 3: lounge on couch, drool in awe at the Fire TV's crisp picture.The perks: Voice search is seamless.  Hold the Voice Recognition button while speaking and it picks up what you are saying perfectly and then offers any and all pertinent suggestions.  How this voice recognition is better than any other device currently on our planet is beyond me.  But then again, it's Amazon.  I'm starting to think they possess more magic than Disney.  The only caveat with Voice search is that it currently only works with Amazon content thus far.  Though I heard rumors that Fire TV will be releasing an update that will allow Voice Search to catalog the device's entire library and content.Having made this purchase on Amazon (not sure there are other outlets to buy Fire TV)  automatically synced my Amazon account with the Fire TV.  No sign in required.  Being that I'm a prime member, the endless free Prime Instant Videos (endless movies and shows) was instantly available to me.  That's over 40,000 Prime Instant Videos alone.  That's not including Netflix and the thousands more of videos that can be bought or rented on Amazon.  If you are already bought Movies/shows from Amazon like I have, they will automatically show up your Fire TV library.  Further, your Prime Instant Videos watch list appears in the menu as well.Shortcomings:  To date, HBO GO is a not available on Fire TV.  However, in recent articles, claim that HBO GO is a go for Fire TV by the end of the year.  It's true, after the major license acquisition Amazon made with HBO, currently classic HBO shows (Sopranos, The Wire etc) can be streamed at no cost for Prime members.  With this, Amazon also cut a deal to acquire HBO GO in a package that will soon emerge in the Amazon's APP marketplace.  This will be the icing on the cake and the only reason, currently, that some users will claim that the ROKU 3 has the slight edge.UPDATE:  Rejoice!  HBO Go is now available on Fire TV.  Though, its early version is a bit clunky, it does the job sufficiently.", "verified": true, "helpfulness": "6/6", "author": "David P. Castellani \"Casty\""}, {"rating": 1.0, "review": "First off there are very little instruction on how to attach this item to your TV!  The equipment to attach is not included. It is very difficult to attach to a TV older then 5 years old. I had high hopes for this device but...!", "verified": true, "helpfulness": "1/14", "author": "kChief"}, {"rating": 5.0, "review": "I've had both Roku and then Roku 3 to stream Netflix and Amazon Prime on my TV, and just got the Amazon Fire TV to replace them. Both Rokus were constantly stalling out in order to catch up with reloading (sometimes 4 or 5 times during a single movie) and that was driving me nuts. Oftentimes whatever I was watching would stop right in the middle and I'd get a message on my screen saying that that title was temporarily unavailable, or that I had lost my signal. I haven't had a single case of any of those things happening since I switched to Amazon Fire TV, Everything loads much quicker and the picture on my screen is much sharper. The remote's easy to operate, and with the Fire I can fling movies, shows, whatever I want, from a Kindle onto the TV screen. I love it. I wish I'd replaced my Roku with this sooner.", "verified": true, "helpfulness": "2/2", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I was using my LG blue ray player for Netflix streaming. It worked ok at first, but lately it would stopand reload every few minutes. It was virtually impossible to watch anything.  The Amazon Fire TVsolved my streaming problem. It was easy to set up. It has expanded my movie and TV choices.Well worth the extra cost.", "verified": true, "helpfulness": "0/0", "author": "Thomas R Wiesmueller"}, {"rating": 5.0, "review": "I have been using a Chromecast (which I love) for about 6 months.  I ordered this online, and it arrived promptly and with my Amazon Prime account information already put into it.  I plugged it in, it \"knew\" my name, and I was able to use it after easily connecting to my wifi.  I use it for Prime Videos, Netflix and Youtube primarily.  Fits my need seemlessly.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 3.0, "review": "We ordered the Fire TV recently and we loved it.  However, after having it less than a week, it stopped working.  It will no longer connect to the internet and tells us to return to the set up screen.  But it won't allow us to go to the set up screen.  Amazon's response was to tell my husband an email would be sent in 2 days.", "verified": true, "helpfulness": "0/0", "author": "Amanda Austin"}, {"rating": 4.0, "review": "We selected Amazon streamer for the ease of use. The quality exceeded other streamers for our use. I've recommended it to my friends", "verified": true, "helpfulness": "0/1", "author": "Robert"}, {"rating": 5.0, "review": "I haven't had cable TV for years.  I love streaming, tho.  I have been using my laptop to connect to my TV, which worked well but I really love having a device dedicated to just the TV.  AMAZON FIRE is incredibly easy to set up and use.  I didn't think I really cared about being able to talk to it, but that turns out to be a really nice feature.  And another nice little bennie is that when it goes to pause, there is a slide show of the most beautiful pictures!  I could just sit and watch THAT for while!  The sound system with the AMAZON FIRE is also WONDERFUL!  I'm very happy with this system and highly recommend it!", "verified": true, "helpfulness": "1/1", "author": "E. Foster \"wildrosem\""}, {"rating": 4.0, "review": "I have been watching old \"24\" shows and old Star Trek Voyager from Amazon Prime.  The voice search works only on that from what I have gathered from other comments.  The unit is really small and I like that since it is hardly noticeable setting by the TV. I expect that Amazon will add other apps in the future.  Personally I'm waiting for someone to add some faith-based programming and family programming.  I had subscribed to Sky Angel network which carried around 60 different channels thru streaming.  Unfortunately they went out of business.  Someone else would be smart to pick up this type of service and gain some subscribers who are not big fans of all of the \"modern\" TV junk.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I have multiple children, and when a cold keeps us home to care for them, this is a blessing!!! !!!", "verified": true, "helpfulness": "0/0", "author": "James"}]