[{"rating": 5.0, "review": "Great product. Everyone I gave these to loves them. Love that it doesn't limit the device it's attached to. You can continue doing whatever you want on the device you are streaming from without any lag even taking calls on your smart phone while it is streaming. Great product!", "verified": true, "helpfulness": "0/0", "author": "Tony Syrakis Jr"}, {"rating": 5.0, "review": "I love chromecast! It's really good! I'm a gamer, so i watch my pro gaming on twitch(Which works wells). I also have used Hulu as well. At the time of this review, it doesn't support amazon instant video but i found a work around for it. Either you can cast your screen on a mobile device(In my case i used my phone). Or you can stream your desktop to your chromecast(may need a few settings adjusted but works none the less).", "verified": true, "helpfulness": "0/0", "author": "Dequan Wilson"}, {"rating": 5.0, "review": "I love it. It does everything I was looking for it to do and more. I definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 5.0, "review": "Works fine.  But was not expecting it to need a separate power source.  Thought it would be powered by the tv like a flash drive.", "verified": true, "helpfulness": "0/0", "author": "Patricia B. Lisk"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Adem N."}, {"rating": 5.0, "review": "Really easy to install and work great in my tablet, phone and computer also in xbmc program", "verified": true, "helpfulness": "0/0", "author": "fernando"}, {"rating": 4.0, "review": "Works as expected!", "verified": true, "helpfulness": "0/0", "author": "elisha jones"}, {"rating": 5.0, "review": "Love this little gadget!", "verified": true, "helpfulness": "0/0", "author": "Selly"}, {"rating": 5.0, "review": "Excelent!", "verified": true, "helpfulness": "0/0", "author": "Jorge Engelhardt"}, {"rating": 5.0, "review": "Works as promised. . . I need to find an instruction manual to find out all that I'm able to access with this baby. Right now I'm stuck on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Sandra Bishop"}]