[{"rating": 5.0, "review": "I am so glad that I decided to purchase the Amazon Fire TV. I am able to watch Prime Eligible shows and movies, Netflix and listen to music.", "verified": true, "helpfulness": "0/0", "author": "rochelle18"}, {"rating": 4.0, "review": "This is a solid piece of hardware.  Just wish it had more apps like VUDU and other choices.  Not quite there but could be a contender real soon if it adds more apps.", "verified": true, "helpfulness": "0/0", "author": "Donald E. Speis Jr."}, {"rating": 5.0, "review": "I really like the how the fire comes with the voice search.  This is extremely helpful when searching for my children's shows.", "verified": true, "helpfulness": "0/0", "author": "Michelle thurston"}, {"rating": 3.0, "review": "Amazon Fire TV does not support Vudu or HBO Go.  Nice remote and streaming box, but will not replace Roku unit.", "verified": true, "helpfulness": "0/2", "author": "Jeff Parker"}, {"rating": 5.0, "review": "Solid construction. It has the same build quality as the Apple TV. However, the remote might be a little bit better on the Fire TV. Layout is nice and easy to use.Only downsides:There is no Prime only section. This makes it hard for others to watch movies and know they are not at risk of buying something. Yes the Prime stripe at the corner is there but it is not large. Plus I don't want to go through every movie and keep an eye out if it's Prime or not.Second, there doesn't seem to be a reset of the device from the remote. I don't mind that it never turns off, but when I'm switching Ethernet cords around and it loses internet for a while, it freezes the unit since it's constantly searching for internet. A simple sleep/awake functions would help me with this. It's easier than unplugging and plugging the device.Overall, highly recommend this device.", "verified": true, "helpfulness": "0/0", "author": "Agent Orange Peel"}, {"rating": 4.0, "review": "I get most of my videos from Amazon. So Fire TV seemed like a no brainer. Setup was really easy. I plugged it into the internet, and HDMI on the TV. When I turned on power the drive immediately began updating software. That continued for a short while. Then it was ready to go. The menu is really better than the internet menu for finding videos, music and TV shows. The voice search function works beautifully (much to my surprise!). The most incredible thing about Fire TV is the speed. It starts up immediately. Once I find a movie and rent or buy, it is ready almost immediately. When I go the movie to watch it the movie starts within no more than 2 - 3 seconds. Yes, seconds. How it can be so fast I can't imagine. There is none of the buffering nonsense I used to get. There is no stutter of any kind in playback. The picture quality has been good. If you watch a lot of your content through Amazon then this is the way to go.", "verified": true, "helpfulness": "1/2", "author": "Just a Guy"}, {"rating": 5.0, "review": "We were looking for an alternative to cable or U verse.  We like finding what is available via Amazon Prime, accessing our Netflix, Hulu, and Pandora.  I wish the voice search worked for other content than Amazon Prime.  It is easy to use....just wish it would work on my TV that is over 10 years old that doesn't have HD.", "verified": true, "helpfulness": "0/0", "author": "Kimberley M Jarboe Fund"}, {"rating": 5.0, "review": "Glad to see Gary back in the lime light again and talking to lamps!  Glad you gave him the opportunity to revitalize his career.  The commercial made me laugh!", "verified": false, "helpfulness": "0/0", "author": "Annabelle L. Fischer"}, {"rating": 5.0, "review": "Very user friendly . Picture quality is wonderful. Doesn't miss a beat when streaming movies . I have one for each floor.", "verified": true, "helpfulness": "1/1", "author": "Norm"}, {"rating": 5.0, "review": "Very easy instructions to follow, get connected and working. Everything worked right the first time. Being a Prime Member allows you to watch great programs.", "verified": true, "helpfulness": "0/0", "author": "Dennis Vanosdall"}]