[{"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "salahss"}, {"rating": 5.0, "review": "Installed fast and works great.", "verified": true, "helpfulness": "0/0", "author": "Cathy"}, {"rating": 5.0, "review": "Perfect for not having cable tv", "verified": true, "helpfulness": "1/1", "author": "jared"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Kim Sassaman"}, {"rating": 5.0, "review": "Works much better than my old wd tv box, a lot faster and no lock ups while watching amazon prime or streaming movies from my media server.", "verified": true, "helpfulness": "0/0", "author": "V.B."}, {"rating": 4.0, "review": "Keep adding apps and you'll staythe best. Google is on your tail, though!", "verified": true, "helpfulness": "0/0", "author": "David Boltz"}, {"rating": 5.0, "review": "I got this for my kids to put in their room. It's great. They can play games or watch movies or watch their favorite shows. They really enjoy being able to listen to music. This is a great option for anyone who is trying to ditch the cable/satellite bill.", "verified": true, "helpfulness": "0/0", "author": "Dcrutch"}, {"rating": 1.0, "review": "This is pure crap. It's CONSTANTLY freezes the picture, leaving only sound to come through. The only way to fix it it's too", "verified": true, "helpfulness": "1/4", "author": "Jarvis"}, {"rating": 5.0, "review": "I love this device! Interface is simple and easy to use and has all the apps I need on here for watching my favorite movies and shows. Very small and portable, which makes transfers to different TV's a cinch. My parents have the apple TV and I  think  the fire TV has a better interface that is easier to navigate than the apple one.  Would highly recommend getting this product!", "verified": true, "helpfulness": "0/0", "author": "cc2"}, {"rating": 5.0, "review": "I just received my new Amazon Fire TV; it was easy to hook-up; I have access to all my Amazon Prime content, including all my photos on Amazon's free image storage, all my music stored in the Amazon cloud. Add Netflix, and Hulu Plus, and I've got more content than I can watch in 100 years. Taking back a big pile of obsolete cable hardware tomorrow and NEVER looking back. This is probably the reason my cable bill increased 61% in one month - cable is a dying industry!", "verified": true, "helpfulness": "5/5", "author": "mt2hi"}]