[{"rating": 3.0, "review": "I am giving it three stars even though my frustration level runs high with this.  I have had nothing but trouble when it come to Netflix.  This device, at least for me, just refuses to run Netflix about 60% of the time.  Netflix says call Amazon, Amazon says call Netflix, very frustrating.  I have had to hook up my Roku to run Netflix.I pretty much like everything else about it, the UI is good, other apps seem to work ok, though other than YouTube, we don't use much else (except NETFLIX).  One other major gripe with this device (and others of the type) - why can't we get an on/off and a reset button?  Oh, and I miss the remote with the headphone jack (Roku).  My advice, if you already have Roku 3, there really isn't much reason to buy the Amazon Fire TV, save your money.Edit: It's worth noting that Netflix also has issues with Roku, it just isn't as prevalent.", "verified": true, "helpfulness": "0/0", "author": "Avid Reader"}, {"rating": 5.0, "review": "This is in my opinion the best Wi-Fi tv box on the market. Absolutely love the voice command feature. Its worth a couple bucks more than Apple Tv, and Roku.", "verified": true, "helpfulness": "0/0", "author": "Steve Ward"}, {"rating": 3.0, "review": "Chromecast user, swore I would never buy one... SlingTV's announcement of getting HBO changed that. It is a good product, but not great.Pro's:Has every streaming service, including Prime instant that was held off of Chromecast.Can do many many other things. Like stream PC games to your TV via apps like Limelight.Cord cutters dream with SlingTVCon's:Voice search is limited to Amazon services. Can not go in to Netflix or PBS and use voice search, need to type everything out.Finding Prime only TV shows and Movies is not easy, mostly because their free library is not as large as they claim, and they want you to may for TV/Movies.The fact that in the end I had to buy one still piss's me off. Prime Video should have been available on Chromecast. I have paid for Prime for a few years, why not let your customers enjoy the services they pay for in as many ways possible.", "verified": true, "helpfulness": "0/0", "author": "Edward Keefe"}, {"rating": 4.0, "review": "Pair this with Amazon Prime and Sling, and you not only save money when you buy, but it will cover a good portion of your tv viewing needs. Connect using an HDMI and connect to your router with an ethernet cable for the best picture, and least amount of lag/pixelation. I will be buying a second one in the near future.", "verified": true, "helpfulness": "0/0", "author": "Marvin"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Ditched cable for this and HD antenna. Also subscribed to Sling TV to get half off the Amazon Fire TV.  Between Sling, antenna, and Netflix We don't miss cable at all.  We get better HD on our 65\" TV with this than we did with cable (ATT Uverse) and so many choices.  We went from a $250.00 a month cable/internet bill to $73.00 a month for internet and the subscriptions to Sling and Netflix.  Sling is $20.00 a month for twenty channels and Netflix is $8.00.  All the broadcast channels are free due to the antenna.  Gotta say this was a smart move.  If you are a football fan you wont miss much but the NFL network, and I get that on my phone for next to nothing.  Just gotta figure out to put it on my TV and that shouldnt be to hard.", "verified": true, "helpfulness": "0/0", "author": "Beverly"}, {"rating": 5.0, "review": "Superb addition have sold both my apple tvs to replace with fire tvs, very quick well laid out. Free time for the children is a must it's excellent", "verified": true, "helpfulness": "0/0", "author": "Techi"}, {"rating": 5.0, "review": "appears to work as adviertized. I have only had it a short time", "verified": true, "helpfulness": "0/0", "author": "Roy Sowers"}, {"rating": 5.0, "review": "Awesome product and my daughter loves the different Amazon kids series shows available", "verified": true, "helpfulness": "0/0", "author": "Ryan Brent Reynolds"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "KevinG."}]