[{"rating": 5.0, "review": "It does almost everything I want: cast videos to TV from youtube, netflix, a growing list of other streaming websites, and for everything else, I can play on my laptop and cast the tab (full screen) to the TV.For all the supported apps/streaming sites, I can browse other videos while watching the current one. It has made watching TV easy and almost seamless. Best of all, it doesn't drain the battery when casting a supported service.", "verified": true, "helpfulness": "0/0", "author": "S. Li"}, {"rating": 5.0, "review": "This device is recommended for old models of LED's or LCD's as the new models have built in option to cast your programs through you phone or PC", "verified": true, "helpfulness": "0/0", "author": "Faheem"}, {"rating": 4.0, "review": "Good start and displays well.  Certainly hope that more media types and sites will have the \"click thro\" display feature.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "After getting rid of cable, I wanted some other options and an easy way to display those on my TV. I now own two Chromecasts and have not had any trouble. I use them for Netflix and Hulu and they are great.", "verified": true, "helpfulness": "0/0", "author": "Bearcat fan0609"}, {"rating": 5.0, "review": "Was exactly what I expected.  Worked flawlessly from multiple devices.  Now I do not need external speakers to listen to Pandora.  I just listen through my TV.", "verified": true, "helpfulness": "0/0", "author": "Lady Di"}, {"rating": 3.0, "review": "Works reasonably well but since it streams from another device, it is not as convenient. It would be better if it worked like a roku.", "verified": true, "helpfulness": "0/0", "author": "Pradeep K. Kedia \"Pinch Hitter\""}, {"rating": 5.0, "review": "Extremely easy to set up. Easy to stream content. Works great with limited apps it's advertised to support.My only complaint is that the apps that support it is limited. I wish chrome for android allowed me to stream video, but it only works for chrome on pc.Regardless of it's limitations, it's a pretty awesome little product for such a cheap price.", "verified": true, "helpfulness": "0/0", "author": "Corey Ferguson"}, {"rating": 5.0, "review": "I love the Google Chromecast!!!!! Inexpensive and works great!! Going to purchase another one for my bedroom TV!!! Great item!!", "verified": true, "helpfulness": "0/0", "author": "lana"}, {"rating": 5.0, "review": "I've used this very nice Chromecast player with my Android Samsung Tablet and it worked right away out of the box. II'll i had to do was plug it in, Download the app from Google Play, Setup the app and device in a few easy steps, set my TV to HDMI 2 and it broad cast in georgeous HDMI with fantastic audio. I was not sure if it would work this well but WOW...What and inexpensive and easy to use product to enjoy your Tablet and TV even more.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Burger"}, {"rating": 4.0, "review": "Now I used mine to watch downloaded movies and tv shows through Plex, which I have to pay for (but it's cheap) and I'm really happy with it. If you have a smart TV don't buy this you likely have access to all of the apps already. The pandora and YouTube apps are nice. I like it.", "verified": true, "helpfulness": "0/0", "author": "K. Demick \"Ken the Majestic\""}]