[{"rating": 1.0, "review": "Chromecast would be a fantastic piece of technology at a great cost, *IF* it could playback video that wasn't ludicrously choppy.  Unfortunately, streaming from Google Play, Youtube, and even a file off a computer on the same wireless network (with all other computers and network activity disabled) plays like garbage.", "verified": true, "helpfulness": "0/0", "author": "k polich"}, {"rating": 5.0, "review": "just gave it as a Christmas present. Very easy setup, includes power adapter if your TV doesn't have usb to power it. also comes with a little hdmi extender if it doesn't fit on your TV for some reason....pretty cool, not bad for $35", "verified": true, "helpfulness": "0/1", "author": "andy"}, {"rating": 3.0, "review": "I find this is worth it. Although if you are streaming from chrome from the laptop, your laptop is basically locked. You cannot multitask if you are streaming from Chrome. Picture quality is good. I feel picture quality is not that great when I stream from Netflix.Recently HBOGO also added as an app in chromecast.Overall, I would recommend it if anybody wants to buy this kind of streaming device in cheap price.", "verified": true, "helpfulness": "0/2", "author": "RAJARSHI DUTTA"}, {"rating": 5.0, "review": "The Chromecast is easy to set up.  Met expectations.  I purchased eight as Christmas gifts and they were a big hit!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is one of the few devices that does what it says it will.  It allows you to stream online media to your HD TV in high def.  Easy to set up and we were streaming movies in less than ten minutes.  Definitely worth every penny, and we are already ordering another one for our child's tv.", "verified": true, "helpfulness": "1/1", "author": "michael helfenstein"}, {"rating": 5.0, "review": "I love the Chromecast. It is one of the most brilliant devices invented. For the cost, it is a technological marvel. Set up was seamless (less than 5 minutes, including the initial update of the software)... It is slightly limited, because there aren't a massive amount of apps that sync with the devise, but my bet is Google is working on that :) Definitely worth it if you have most Google services, Pandora, Vevo, and a few other well known services. No regrets!", "verified": true, "helpfulness": "1/1", "author": "dwe"}, {"rating": 5.0, "review": "For the low price of less than $40, this is one of the best tech devices I have purchased in a long time. I use this device daily for streaming content from Netflix, Hulu, or Youtube. The addition of Plex enables me to stream movies stored on my computer. The quality and sound is very impressive considering it is over WiFi and most of my movies are in 720p or 1080p. I was previously streaming my movies via an Xbox, but it did not handle MP4 too well and the quality was not great. The Chomecast is far superior at this task.The Chromecast is generally responsive. Content from Netflix and other services can take a few moments to start streaming, but they pause and restart quite quickly. Movies streamed via Plex start very quickly - much faster than my Roku 3.When not streaming, the photo slideshow is nice. I sometimes let it go for a while when cleaning.As with any other device, there are a few things I do not like:1. It is WiFi only and I always prefer ethernet. Though I have a strong WiFi signal, a rented HD movie on Google Play last did temporarily change to very poor quality at different points. The pixelation was terrible, but luckily it only lasted about ten minutes. My HD movies streamed from my computer (via same WiFi) do not get pixelated like the rented movie, but will occasionally buffer. Based on the different issues when streaming, the quality change may have been on Google's end. Google may change the quality on-the-fly if network traffic between them and the consumer gets congested. This is a better option than extended buffering.2. There is no option for powering the Chromecast via HDMI, which I believe is possible in the newest HDMI specification. This may be because this specification of HDMI may not be too common yet. The USB power option is not too bad, especially since most new televisions come with USB ports.3. Though not the fault of Google (that I know of), there is no Amazon Instant Video app. Yes, it is possible to stream a complete web page from a computer, but the performance is generally very poor. I wish Amazon would offer their instant video app for everything. Amazon needs to make their service ubiquitous, just as Netflix did (I think it has worked well for them). Without hacks, I am not aware of Amazon's instant streaming being available on any Android device, other than the Kindle tablets. The lack of this app for the Chromecast may be a deal breaker for some.4. Limited selection of apps (currently). Google seems to have strayed a bit from their shoot from the hip attitude and they are not allowing just any app to work with the Chromecast. Only select developers can release apps for the Chromecast. Once Google opens this up to everyone, this device will be magnitudes better.Considering the cost of this device, coupled with its [generally] great performance, I can live with the cons above.Though very different prices, I cannot yet decide if I prefer the Roku 3 or the Chromecast. The Roku 3 is more than twice the price, but it has more apps (AKA channels) available. The Chromecast is new and slowly adding apps. The ease of use of the Chromecast beats the Roku's remote control (and the remote control app). Interaction with the Chromecast is via a mobile phone, tablet, or computer with the Chrome web browser. It could not be simpler. Though I do not know if it was intentional or who was responsible, but I can stream to my Roku 3 from the Chromecast option in Netflix. The Roku appears with my two Chromecasts - I love that. As mentioned above, Amazon instant streaming is not [generally] available on Android, nor for use with the Chromecast. Amazon instant streaming is available on the Roku 3.If you can live with the limited selection of apps (for now) and would like using your mobile devices as the best remote control ever, the Chromecast cannot be beat for the price. I mainly use mine for Netflix and I am totally happy with the purchase. If WiFi is your only option and the lack of ethernet is not a consideration, the Chromecast handles streaming quite well. If Amazon's instant streaming is a must, then the Chromecast is [currently] not for you.", "verified": true, "helpfulness": "1/1", "author": "John Alvarez"}, {"rating": 1.0, "review": "did not go far enough  I never saw the 20' max dist, it found it but could not transmit to it", "verified": true, "helpfulness": "0/0", "author": "docrambo"}, {"rating": 5.0, "review": "Muy bueno", "verified": true, "helpfulness": "0/0", "author": "maricris gonzalez"}, {"rating": 4.0, "review": "My only complaint is that there are not more apps that can use this. Currently supports youtube, pandora, but not spotify.", "verified": true, "helpfulness": "0/0", "author": "Panagiotis"}]