[{"rating": 5.0, "review": "You have all probably read the 8 million Chromecast reviews before, so I don't need to bore you with the details again. These things work great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "easy to set up ..streams movies wonderfully ..if anyone has an issue they should really check out their internet settings...mines works flawless...supports only a handful of progs right out the box ..BUT...i highly recommend everyone downloads the AVIA app...then do a little exploring..you might be very pleased", "verified": false, "helpfulness": "0/0", "author": "GEM1N1"}, {"rating": 4.0, "review": "Lacking in some areas, for the price it is great, but right now there aren't a lot of things that can cast to it.Gets very hot, even when idle.I was lucky to have usb power on my TV, however, you may be stuck finding somewhere to run the cable to power it", "verified": true, "helpfulness": "0/0", "author": "Steve Bruno"}, {"rating": 4.0, "review": "I got this because I wanted a 'smart tv' to search the internet and do media streaming.It did a very nice job of that....but it was not what I wanted.  I ended up returning it, as you cannot access the entire internet, only those with streaming media. Instead, I ordered the Sony Google Tv....now I am a happy camper", "verified": true, "helpfulness": "0/0", "author": "Suzanne - severe Amazon addict! \"Suzanne\""}, {"rating": 3.0, "review": "i like the inoveition but thsi prodcut is far to be finich, don't work well whit windows phone a whit android is very slow", "verified": true, "helpfulness": "0/1", "author": "K"}, {"rating": 5.0, "review": "Everyone needs one of these! I watch countless Netflix movies on my tv now thru my iPad Mini! It's an awesome way to see a lot of great movies!", "verified": true, "helpfulness": "0/0", "author": "Wendy Goble"}, {"rating": 4.0, "review": "I really have liked my Chromecast the last few weeks that I have had it.  It works great, connecting to my internet quickly upon TV start up, and loading apps quickly.  The apps that Chromecast have work really well (Netflix and Pandora are the two I have used most), but are still lacking in quantity of apps that you can use.The one difficult thing that I have found is that if your friend starts a movie on Netflix, but then has to go take a call or leaves the apartment there is no way for you to pause the show you are watching.  The only options you have is to either watch the show strait through or turn off the TV.  It can be a some what aggravating situation when you need to use the restroom, but don't want to miss any of the movie.I am very excited to see how this improves in the next months to years and really think this is a great deal compared to the price you pay for the competitors.", "verified": true, "helpfulness": "0/0", "author": "HB \"HB\""}, {"rating": 5.0, "review": "Excellent product, good ending materials, and excellent price for the finishing.It may not seem, but its a little heavier than I was expecting (not a concern at all).", "verified": true, "helpfulness": "0/0", "author": "Nx"}, {"rating": 1.0, "review": "The product worked fine for a few months then stopped casting. Could only view on the tablet.When attempting to cast to the TV an error message called 16003 occurs. If you google that error messageyou will find many people having the same problem. If there is a way to seek help from chromecast I can't find it.I just ordered a Roku 2.This followup is an apology to chromecast for my one star review. The reason for the 16003 is not chromecastsor Netflix fault. If you make sure the device you use(tablet or phone) has the correct time it will sync with Netflix and the 16003 error will no longer occur.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have nothing bad to say about the Google Chromecast. It is easy to use and does what it's suppose to do. Easy to cast from a phone or tablet using my home wifi network. 4/5 stars is simply because the only audio output on this device is through the HDMI connection. Unfortunately with my legacy stereo equipment I have no way to connect that audio feed to my receiver. The Chromecast is plugged into my receiver's HDMI input and passes the signal through to my TV. So when I use my Chromecast I'm using the TV stereo speakers only.  Put an optical out on that puppy Google and I'll buy another one.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"mediomonti\""}]