[{"rating": 5.0, "review": "Exelent product..! no complaints thanks", "verified": true, "helpfulness": "0/0", "author": "Sergio V."}, {"rating": 4.0, "review": "4 stars because whenever I use this with my computer, sleep mode seems to effect it even though I downloaded recommended app to disable sleep mode.  When using my iPhone 4 with You Tube it works the best.  My main use for Chromecast is for streaming You Tube on my Samsung smart TV for my son's cartoon viewing.  Don't know if it works for other tv's but when I start Chromecast, TV will automatically turn on and change to Chromecast viewing and I am able to use Samsung remote's play and pause videos which is nice since I usually am playing a game, so I don't have to switch over to YouTube if my son wants to pause.  And bad is it only works with certain apps (Chromecast doesn't work with Youtube views on safari for example).", "verified": true, "helpfulness": "0/0", "author": "BigBoy"}, {"rating": 5.0, "review": "I have this and firestick tv. Both have their advantages. Love chromecast to put stuff on the tv from my phone.", "verified": true, "helpfulness": "0/0", "author": "Eric D. Schlaht \"Eric S\""}, {"rating": 5.0, "review": "Great upgrade from my Roku!!!", "verified": false, "helpfulness": "0/0", "author": "Roel Mata"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Al  Ash"}, {"rating": 5.0, "review": "Works perfect with an Ipad air, Galaxy Tab S and a Galaxy S4", "verified": true, "helpfulness": "0/0", "author": "Diego Pistoletti Dovenna"}, {"rating": 5.0, "review": "We love it. Our Granddaughter loves to watch Raffi and Baby Bum on YouTube. We can put it on the TV for her and she loves it. I kinda like being able to watch YouTube turkey hunting videos on my big HD TV as well.", "verified": true, "helpfulness": "0/0", "author": "KyGoods"}, {"rating": 5.0, "review": "I am about to join Streaming Anonymous.  I have Fire TV, Roku, and now this.  I really like the news selections that Chromcast offers.", "verified": true, "helpfulness": "0/0", "author": "jeffrey holloway"}, {"rating": 5.0, "review": "Chromecast rocks!", "verified": true, "helpfulness": "0/0", "author": "ernest carrington"}, {"rating": 5.0, "review": "Works great! purchased as a secondary to have in the bedroom.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Maddox"}]