[{"rating": 5.0, "review": "The set up is an absolute breeze -- takes just a couple of minutes.  The interface is no-frills and intuitive.  What's lacking is the number of apps that work with Chromecast -- but I expect that to change quickly.  The units gets hot while streaming -- let's see if that affects its life.  All in all, a steal for the money.", "verified": true, "helpfulness": "0/0", "author": "Chaptak \"chaptak\""}, {"rating": 3.0, "review": "Tried casting a chrome tab from my macbook pro. First of all, there is a noticeable lag between your laptop and TV. Secondly, it crashes too often requiring you to go the laptop everytime and recast it. It works well with your tablet and phone. Hoping Google can fix this in the future chromecast software updates", "verified": true, "helpfulness": "0/0", "author": "vignesh viswanathan"}, {"rating": 5.0, "review": "Turn my standard TV to a smart TV.  Increase the number of sources for entertainment.  Very easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "RT"}, {"rating": 4.0, "review": "Easy to setup, works great with Netflix and Youtube, but lack applications to stream photos. Can't beat this for 35$.", "verified": true, "helpfulness": "0/0", "author": "Dominic Guérin"}, {"rating": 5.0, "review": "The Chromecast is best for viewing youtube on a large screen TV. Am able to watch full length musical shows and concerts flawlessly. I use a Nexus 7 for setup and control.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works pretty much as described.  Had a little trouble getting it hooked up due to the configuration of my TV, but with the extended connection in the box I got it done.  Not every thing can be sent from my laptop or IPad to the Chromecast as I had hoped. I am happy with the product and bought one as a gift for a friend after I got mine.  Theirs was easy to hook up due to different brands of TVs.", "verified": true, "helpfulness": "0/0", "author": "R. Taylor \"Say something about yourself!\""}, {"rating": 4.0, "review": "This is a very good device to simplify your life around wires and connections. It is the easiest tool to connect and make it work. Most media devices should follow this example", "verified": true, "helpfulness": "0/0", "author": "luis francisco peralta"}, {"rating": 5.0, "review": "This device is well worth the price. I highly recommend to anyone in the market for an affordable streaming device.", "verified": true, "helpfulness": "0/0", "author": "Franklin Chambers"}, {"rating": 4.0, "review": "If you have other Google devices and/or are technology inclined. You will love this device.  If you like tech this drive is for you.  Just make sure you have multi HDMI ports before you buy.", "verified": true, "helpfulness": "0/0", "author": "John Smith"}, {"rating": 3.0, "review": "When I bought this, I was using a Samsung Blu-ray player whose ability to stream Netflix was abysmal.  Chromecast certainly made it easier to stream Netflix and it also gave me the ability to send youtube directly to my tv from my iPhone, iPad or macbook.  You can't stream amazon prime video to it though.The thing about is Chromecast is it's not always convenient to use.  It's not totally chromecast's fault, but when i'm watching something on netflix and I need to pause it i need to: reach for my phone, unlock it, open the neflix app then wait for netflix to re-establish connection with chromecast then pause the stream.  That just takes too long (especially when you compare it to an apple tv).Also, there have been more than a couple of occasions when chromecast wouldn't be seen by the netflix app that forced me to restart chromecast.  That's frustrating.  I would call this a minor annoyance though, but it is an annoyance.In regards to broswer tab mirroring: it sometimes works.  I understand it's in Beta, but it really is frustrating to use.  It often just starts up then drops (by the way, I'm getting 22mb over wifi at the chromecast).Also, sadly: no intuitive way to stream local music or videos to it.  There are hacks out there to do it, but I don't want to hack around to get something to work.All in all, I'd say this: chromecast is good.  It's not great, but it is worth the $35 if you need a streamer.  If you already have an Apple TV or a Roku, there's really no need to buy Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Ali"}]