[{"rating": 4.0, "review": "1. Netflix losses my login password sometimes, I must re-enter it (hunt and peck method, ugh).2. It loses the Netflix app sometimes, must re-download it and re-log in.3. Confusing interface for someone who just watches Netflix (probably good for Amazon Prime)4. Sometimes the player does not seem to turn off (this is why I bought the Sony players, they actually had an on/off button), and will get hot.  I have to un-plug it from the wall.5. Remote sometimes will not respond/work.  Usually starts working again in a few minutes each time.This player is absolutely a fantastic media player at least from what I have used in the past.  The picture is much better than my last 3 players.  And loading times (just a few seconds) are very minimal to what I am used to.  And once the movie starts, it rarely has to re-load at any point.  But then I have used the horrible Sony players (2 of them that had CONSTANT loading).  And an old model Roku XD 1080P, that although was much better than the Sony's, had its problems also.Good remote, simple and you do not have to aim it.  One note, they should move the \"Home\" button away from the \"Play\" button.  I always seem to hit the Home button when all I wanted was the Play button.  They are too close together.  This make me have to reload the movie.Even though I rated this at a 4, I actually like it a lot.  But of course I had TERRIBLE media players in the past.  I just wish the interface was a little cleaner/simpler.", "verified": true, "helpfulness": "0/0", "author": "zuma"}, {"rating": 3.0, "review": "We have cancelled our satellite TV, tired of paying $150 per month for back ground noise.  So we picked this up to still watch movies and prime.  Over all it is a great stream-able hardware.  With its quad core and extra memory you can stream HD content from local hosts without distortion.How ever we have had numerous problems with the Amazon Fire TV \"locking up\" the network connection.  The software doesn't stop working, but anything that uses the internet network connection simply wont work (which.. is everything, but local streams).Unfortunately there is no volume control software or hardware with the unit.  So since I have long since 'lost' my original remote for the TV since satellite services come with their own, I now have to buy a new one.There is no way to reboot the unit via the remote (that I can figure out), which is needed every time the device 'locks up' the internet connection and wont stream content.A quick run down...Hardware... is fast and future ready.Software... is lacking and under developed.As I see it this 20th day of November, 2014 anyways.", "verified": true, "helpfulness": "0/0", "author": "Tyler Rathgeber"}, {"rating": 5.0, "review": "I would give it 5 stars only because it does serve my purpose for which i bought it. XBMC/Kodi. It simply works. As a matter of fact I am planning to ditch Netflix for few months and instead get Amazon Prime to get unlimited videos just like Netflix. The user interface in XBMC with fire tv is so easy that my wife could use it.The Prime is not that easy to surf but I think we will get away with it. I have to click MORE ways to watch when I am using Prime, to click Amazon Prime and then start watching it. Not a fan of that.", "verified": false, "helpfulness": "0/0", "author": "Pankaj Dhingra"}, {"rating": 4.0, "review": "I really like the Fire TV.  There are a few quirks that prevent me from giving a fully qualified 5 star rating but I'm quite satisfied overall!So here are the oddities...Voice command only seems to work for the amazon content.  I've tried within the Hulu and Netflix apps and the search results jump me out of the app back to the content offered directly from Amazon.  It would be nice to have the voice recognition feature translate through to the apps as well.The other annoying thing is that I've had to log back into some of the apps a couple times due to updates.  It would be nice if my credentials could be stored since it's not fun entering usernames and passwords without a keyboard.", "verified": true, "helpfulness": "0/0", "author": "Charles C Nemeckay"}, {"rating": 5.0, "review": "Great Box for Netflix and other programs. And its at a great price, Cant go wrong here.", "verified": true, "helpfulness": "0/0", "author": "MauriceOtt"}, {"rating": 4.0, "review": "I purchased this as an upgrade for an old Boxee Box that I had still been using for streaming media.  The Fire is a very nicely made machine, very quick (the quad core processor is definitely noticeable) and the no load start streaming (if you have a good internet connection) is awesome.  The voice search function is a nice feature, but in all honesty is seems to take longer (for me at least) than just typing in the search box what you want.  The only real complaint that I have with it is the fact that you cannot just connect an external source to the USB port and watch from something like an external HDD.  Well, that is unless you feel the need to root the box and install third party software, which will most certainly void any warranty.  Other than that, if you are looking for a high quality, fast media streaming device, the fire is an excellent option.  Easy to set up, easy to use and plenty of content to keep you busy. Great little device.", "verified": true, "helpfulness": "0/0", "author": "Tachyon"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "lovingprimetimeseries"}, {"rating": 4.0, "review": "my experience with my fire tv has been great, I do believe that it has met all my expectations, I think that the service could add the service of dubbing into other languages such as Spanish and Portuguese. I'm really quite pleased with my amazon fire tv", "verified": false, "helpfulness": "0/0", "author": "jose alfredo"}, {"rating": 4.0, "review": "It's fast and I love it! No waiting for it to load descriptions of shows or to launch them. Simple and easy to use, and my wife even agrees with me that it was a great purchase! It would have received a 5 star rating, but the initial setup required tech support due to a required software upgrade for Netfix that was not automatically loading (tech support from the Philipines was very good, friendly and understandable). I would definitely recommend to friends and family. Btw, I am comparing this product to NeoTV and Chromecast, which I also own.", "verified": true, "helpfulness": "0/0", "author": "DC"}, {"rating": 5.0, "review": "The best thing i did! I am completely satisfied!!", "verified": true, "helpfulness": "0/0", "author": "Milca \"MCSilva\""}]