[{"rating": 5.0, "review": "It is excellent and very affordable cost", "verified": true, "helpfulness": "0/0", "author": "Victor Mena"}, {"rating": 5.0, "review": "I bought one of these the very first day they came out.  I finally got a second one to hook up to my Speakers in my kitchen.  I am sick of plugging in my phone every time I want good music while cooking.  Now that I have the Chromecast I will be able to stream wirelessly where I am in the house.", "verified": true, "helpfulness": "0/0", "author": "Norm Walker"}, {"rating": 1.0, "review": "Garbage.  Wont charge.  Dell fixed 3 time.  Wont charge out of box.  DO NOT BUY", "verified": true, "helpfulness": "0/6", "author": "Sam Corcoran"}, {"rating": 5.0, "review": "Pure fun streaming from phone or computer", "verified": true, "helpfulness": "1/1", "author": "Don Johnson"}, {"rating": 5.0, "review": "Super fast shipping.  Great gift idea!", "verified": true, "helpfulness": "0/0", "author": "TLC"}, {"rating": 5.0, "review": "Works great! Easy to use..", "verified": false, "helpfulness": "0/0", "author": "Rae"}, {"rating": 3.0, "review": "no 5Ghz support! Seriously google? how can this device no support 5Ghz wifi? The setup can be cumbersome and not as intuitive as you would expect. Need a strong wifi connection or else this will not be able to connect properly. I also have a roku 3 and although the product is bigger, it is much more intuitive, more apps and easier to use. If you are not looking for portability, a roku may be a better option instead of the chromecast.", "verified": true, "helpfulness": "0/0", "author": "N. S."}, {"rating": 5.0, "review": "Seems to do exactly what it says it is supposed to do.", "verified": true, "helpfulness": "0/0", "author": "Tricia Cavan"}, {"rating": 1.0, "review": "This product is completely pointless.Why would you purchase this product that requires you to run the program on your smartphone or Laptop then have your phone connect through  wifi to the chromecast to play on your television?My Roku connects to  wifi directly and plays on the television.I purchased it to use while camping thinking it would pick up the programming from my phone but it doesn't work without wifi.  If I had wifi while camping .....  well you get the point.", "verified": true, "helpfulness": "0/2", "author": "Need More Stuff"}, {"rating": 5.0, "review": "Very good product.Full PC screenMirror (only Chrome Browser [Video play from PC with extensions is allowed]) not available yet, but the best probuct", "verified": false, "helpfulness": "0/0", "author": "Levente Szalay"}]