[{"rating": 5.0, "review": "It works great!", "verified": true, "helpfulness": "0/2", "author": "Armando Ramirez"}, {"rating": 1.0, "review": "Update caused most apps, including Amazon Video to stop working.  Spent an hour on with Technical support and issue not resolved.  No offer of refund no timeline for fixing it.  So the odd thing is on the Hulu app get the show teaser then the 1st set of adds but when the show starts get black screen and stuttering audio.***updated 6 days later-Still no fix.  Talked with support again for another hour.  They said there is a fix but will take up to 6 days to reach my device(for some unexplained reason)", "verified": true, "helpfulness": "1/2", "author": "Hyrum"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "Timothy Hake"}, {"rating": 5.0, "review": "I bought the Chromecast first and liked it.  But I decided to buy this and it is so much better.  The menu's are better and much easier to use.  I get my Hulu, Netflix, and a bunch of other channels.  I haven't dropped the cable yet, but I could very easily be satisfied with just this!", "verified": true, "helpfulness": "0/0", "author": "dwar"}, {"rating": 3.0, "review": "For the most part it works very well, however it comes with many optional apps that work very poorly. most of the apps that don't work are ADRISE apps. Also,when ithings start to go awry and start to work poorly, I have to pull the plug on the unit to clear the cache or buffer to get it working more smoothly. I would think that memory clearing would be automatic.", "verified": true, "helpfulness": "1/1", "author": "Bogdan Pieniak"}, {"rating": 5.0, "review": "This device is Fantastic.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome little box! Easy to side load apps via ADB over WiFi kick butt without any side loaded apps. Unfortunately with current firmware there's no way to root this without hardware mods but maybe that's a good thing. It runs fast and stable for what my wife wanted it for, which was to watch her shows!The remote is impressively responsive with no lag that I've noticed. The system doesn't have any micro stutter like some boxes I've messed with. Bluetooth 4.0 is a plus. I'm looking forward to when they add the additional bluetooth profiles so you connect more devices!", "verified": true, "helpfulness": "0/0", "author": "Michael Johnson"}, {"rating": 5.0, "review": "This thing is great! We had a Roku which was really good too but shortly after owning it we had a power surge which killed it. After that we decided to get a Netgear NeoTV seeing it had a nice remote and the addition of YouTube. We didn't realize it didn't have HBO Go and it is the most unresponsive piece of garbage I have ever owned. Enter the Fire HD. This thing is awesome. You press a button on the remote and it responds!! Plus it has an optical out for audio!!!!!! I highly recommend this!!!!!!", "verified": false, "helpfulness": "0/0", "author": "Mr. Hode"}, {"rating": 5.0, "review": "We mainly use this for Netflix and Amazon Prime Videos and it has worked great.", "verified": true, "helpfulness": "0/0", "author": "J. Nicholas \"Baller\""}, {"rating": 4.0, "review": "Enjoy the fire TV, just wish there was a way to make the font bigger on the descriptions.", "verified": true, "helpfulness": "0/0", "author": "SUSAN B. ELLIOTT"}]