[{"rating": 5.0, "review": "With prime this is a must have. TV shows and movies for everyone in the entire family. Ability to access apps and games and allows you to rent, buy or watch (with prime) in either SD or HD. Combined with prime and another kindle tablet this little box is a power house. Also this is the first complete success with voice command. I have found it to be 100% accurate when searching with voice command, something that really shocked me.", "verified": true, "helpfulness": "1/1", "author": "Norman"}, {"rating": 5.0, "review": "I love your fire tv, it works so well and with prime for about $99 per year. That's less than 10:00 a month after you purchase the fire TV box and remote. No commercials and so much to choose from. I would recommend it to my friends with an internet connection. I  love everything about it. Now I'm ready to add the game controller for my grandson.", "verified": true, "helpfulness": "1/1", "author": "realrockmama"}, {"rating": 1.0, "review": "No interoperability with VPN's for Americans working overseas. I purchased Fire TV but have yet to see any fire from my purchase!", "verified": true, "helpfulness": "0/4", "author": "Ken"}, {"rating": 5.0, "review": "Very easy to use and excellnet content.  Comparing to the Apple TV that I already have at home, Amazon TV is definitely a far better product.  Good job Amazon!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Amazon Fire TV is Great.", "verified": true, "helpfulness": "0/0", "author": "Keith D Moldenhauer"}, {"rating": 5.0, "review": "I love this.", "verified": true, "helpfulness": "0/0", "author": "John Lanscak III"}, {"rating": 5.0, "review": "I love everything bout it. Voice search is near perfect, the games are extremely fun, and videos load much faster than other devices I've had (to include the xbox one).The only thing I would say is that there is no VUDU. Kind of a bummer for me, but obvious since they are competitors.", "verified": true, "helpfulness": "0/0", "author": "Brian H."}, {"rating": 4.0, "review": "Great device. No delays while watching movies. I would have given 5 stars if more movies were free through Amazon Prime.", "verified": true, "helpfulness": "1/1", "author": "Jimchu"}, {"rating": 2.0, "review": "This device is a bandwidth hog! I can say with absolute certainty that the Amazon Fire TV is a data hog because its use is the only change I made to my internet usage in the last few months. My usage went from 264.7 gbs of data in a month in December to 625 gbs of data in January, after we received our Fire TVs. For many this is not significant, but we have a data cap of 400 gbs and our Fire TVs are eating through all of our data and then some. I paid an extra $70 last month because data went up to 800gbs! What the what?! I thought it might be a change in usage, and grilled my children about their TV viewing, gaming and YouTube usage for the past four months and it has not changed significantly. All in all, Amazon owes me about 100 dollars in overage fees from my ISP because of their wonky product. Buyer beware if you have a data cap!!", "verified": true, "helpfulness": "0/2", "author": "Brandy C. Carter \"amazoniac\""}, {"rating": 5.0, "review": "l love my Fire TV I'm cancelling my cable", "verified": true, "helpfulness": "1/1", "author": "robyn"}]