[{"rating": 5.0, "review": "Great product at a fantastic price.Easy to setup and use, we all use it at home. I love not to change the input source on the TV when I want to use chromecast.", "verified": true, "helpfulness": "0/0", "author": "JUAN URRABURU"}, {"rating": 5.0, "review": "For nostalgic people that take care of their stuff, and that don't like constantly having to dispose of perfectly good electronics, this is a wonderful way to \"send your dumb TV to school to earn a quickie degree\". Make your TV get smart in just minutes.Easy to use, and self powered if your TV has a USB port.No more balancing the laptop dangerously over DVD players or cable boxes, and no more having to get up from your bed to reload, or to turn everything off when you wish you could just fall asleep.Best feature is that you can control what you watch directly from your iPhone, and still be able to use all of your phones functions without interruption.I bought three to give as presents to people who love staying at home to bing on TV watching.I recommend it specially if you aren't tech savvy, or a risk taker that wants to go online finding torrents, or too-good-to-be-true websites that offer the latest movies or shows.And because of the price, I'm thinking of getting a couple more to give out for Christmas.", "verified": true, "helpfulness": "0/0", "author": "Valerie Mansilla"}, {"rating": 5.0, "review": "This product is awesome. The set up was quick and easy, it took me longer to open the package than to start broadcasting on my TV.", "verified": true, "helpfulness": "1/1", "author": "Jeepjcm"}, {"rating": 4.0, "review": "Excellent  product and exceeded my expectations. Easy to set up and excitedly waiting for additional applications. Currently works very well with Netflix and YouTube on iOS.", "verified": true, "helpfulness": "0/0", "author": "Ramsil"}, {"rating": 1.0, "review": "So after fighting with this POS to actually stream something for several weeks I decided to return it, only to learn I missed the return window by a few days. I'm stuck with it and not happy. I'm not a techie, and I tried over the course of a couple of weekends to stream stuff to the TV using this fob, each time giving up as it could never keep the sound and video synced, that it kept dropping the connection, and just in general sucked. Forgive me for being more interested in just watching the TV than in jacking around with tech issues (this was supposed to be \"plug and play\" turns out it's \"plug and pray it works\" as there's little I could do to adjust anything) - a HDMI cable is cheaper and more importantly *works*.", "verified": true, "helpfulness": "2/4", "author": "Aaron D. Robb"}, {"rating": 2.0, "review": "The reason for the 2 star is because this product does allow you to watch your videos from your devices, however it's typically videos from YouTube and Netflix. I tried streaming online movies and it would not show on my TV because the video is not compatible with Chromecast. In addition, I can't even watch videos on my phone or desktop directly. I would only recommend this if you only want to watch Netflix and YouTube.", "verified": true, "helpfulness": "1/1", "author": "Eli Scott"}, {"rating": 4.0, "review": "At this time I only recommend this if you don't mind fiddling with technology and/or you think that $35 sounds good compared to $50-$150 for a Roku or similar device.WHO I AM:This review will focus on my use of Chromecast.  Chromecast features will change over time (usually for the better). Look for up to date product details elsewhere.  I'm a techie but I don't spend much money on technology and I have little patience for bugs or bad design.HOW I USE OR HAVE TRIED TO USE THE CHROMECAST:> Sony Bravia TV.  I recently configured the TV to turn on and change the input automatically when I play something.  Cool feature.  It's too bad I still have to turn off the TV manually.> Netflix - I love that I can start a show from either my laptop or my Android phone.If I'm doing chores around the house I sometimes start a show from my phone and swap playback between the phone and the TV.  This usually works fine but sometimes the playback jumps backward by a few minutes.  This should work from a laptop too but...My laptop almost always loses its connection to the Chromecast during playback after a few minutes.  The Netflix page says to refresh the browser window but that rarely fixes it. (For what it's worth, I'm running Windows 8 with an Airport Extreme.)My Android phone seems to automatically close the Netflix app after 20 minutes of inactivity.  So if I'm watching a show I often have to restart Netflix on my phone and wait for it to reconnect to Chromecast before I can pause or select another show.  I imagine I would have heard more about this if it were widespread.  Therefore, I suspect that iPhones, iPads, and some other Android devices do not have this problem.Picture quality for Netflix is excellent.> Amazon Instant Video - Unsupported.> Google Music - Playback from my Android phone works flawlessly.  Playback from my laptop requires the music to go from the Internet to my laptop then to my Chromecast. This gobbles my laptop battery so I don't do it.> Spotify - Unsupported.> YouTube - Nice!  I think this is the best way to watch YouTube.  You can queue videos for playback and continue to browse the web as a video is playing. Unfortunately, the interface for adding a video to the queue is confusing.", "verified": true, "helpfulness": "1/1", "author": "Guy Montag"}, {"rating": 3.0, "review": "Very disappointed that Google decided to pull back the ability to stream any Chrome browser tab to your Chromecast. If that ability were still enabled, this product would be a 4 out of 5 stars. If Google had more content providers than ONLY youtube, then this would be 4/5 stars. If it had both, 5/5. Don't buy this until more content is available or if you're fine with only playing youtube videos.", "verified": true, "helpfulness": "0/0", "author": "Christian M. Gentry"}, {"rating": 3.0, "review": "I am pleased withe product so far . It's still evolving so its capabilities are limited. There are still quite a few  issues to be resolved YouTube streams fine to my Samsung but the Tab Cast still in Beta Mode will work intermittently", "verified": true, "helpfulness": "0/0", "author": "Amarjit L."}, {"rating": 3.0, "review": "It only work on 1080p TVs.I personally like other solutions out there. Its not for me.Video and Audio quality is not great.", "verified": true, "helpfulness": "0/0", "author": "Felipe"}]