[{"rating": 5.0, "review": "I love this product!!  I'm able to watch all my favorite movies and TV shows.  Easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "RoesertheReader"}, {"rating": 5.0, "review": "replaced my NG, big improvment", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "I love this little box. they're still working on upgrading a lot of the apps so it's still got some work to do but it's very nice to have especially on abig screen TVbig screen TV", "verified": true, "helpfulness": "0/0", "author": "mari \"love ya miss ya bye\""}, {"rating": 5.0, "review": "Got rid of cable for this, it is great!", "verified": true, "helpfulness": "0/0", "author": "John Rush"}, {"rating": 4.0, "review": "The voice search is great.", "verified": true, "helpfulness": "0/0", "author": "Blazer"}, {"rating": 4.0, "review": "I like it, but I still go back and forth between this and my Roku. The reasoning being is that my Roku still offers more options in regards to viewing content. The menu organization is also a bit confusing. It's a bit difficult to discern whether a program or movie is for Prime subscribers, rent, or a part of Netflix. The voice search works great and accurately, but is limited to Amazon's provdings. It has no interaction with Netflix, Hulu, or any other content provider, which is a bum deal. Hopefully a future update can resolve that. There's also no HBOgo app like is found on a Roku at the time of this review. You have HBO content, but not the in-depth access to their library. Showtime is proved. When it comes to gaming, its has excellent potential, however, it can be hard pressed if you already own much of the game being offered from Google's Playstore You will have to repurchase which restricts me heavily from playing many of the games that I do enjoy. The controller works well, I would say about on average and this is due to it being Bluetooth. There's a noticeable lag in response from pressing a button for actual response, but it's barely noticeable at times and is indicative of any Bluetooth controller. It can be paired with your Android device or tablet should you ever need a controller.Overall, I wouldn't recommend this device if you already own a Roku for you have a lot more options in terms of content being provided. It does make a nice invest however for I feel the potential advantage lies with Amazon commitment in making this a serious contender for your TV space.", "verified": true, "helpfulness": "0/0", "author": "raoul"}, {"rating": 3.0, "review": "No HBO Go = deal breaker.  Most platforms have HBO Go today why doesn't this?  They even have exclusive HBO content on Amazon Streaming Video.  They keep saying \"Later this year\" but why wouldn't you have your ducks in a row to start?", "verified": false, "helpfulness": "1/4", "author": "Mathew A. Kennedy"}, {"rating": 5.0, "review": "Faster than Apple TV with as much content. Love it!", "verified": true, "helpfulness": "1/1", "author": "AnT"}, {"rating": 4.0, "review": "Great device for streaming various web content. Super simple to setup!", "verified": true, "helpfulness": "1/1", "author": "Jimmie Bell"}, {"rating": 5.0, "review": "This review is from someone who only has netflix and hulu and use's a ps3 to stream them on Well here's my opinion of the amazon fire TV it works extremely well after the update before the update its a horrible experience connecting to Netflix and hulu but all that was fixed so I have nothing to complain about anymore so if your buying it and run into some problems well I recommend updating it before you try to connect to Netflix or hulu the picture quality is as expected really really good I think it looks better then my ps3 but that could just be my imagination I have the the fire TV connected to a Samsung 55inch led smart tv and wow it looks and sounds so good I love watching TV with it another thing I love about it is how small it is I expected it to be small but not that small I was really impressed they made everything fit in that tiny little box well that's all I have to say I know it everything I said has probably been said like 1000 times but I wanted to put my two cents out there and give this thing the 5 stars it deserves", "verified": true, "helpfulness": "1/1", "author": "Wisewo1f"}]