[{"rating": 5.0, "review": "It is exactly what is advertised.  I did run into one small problem when \"installing\", but with one quick phone call all was good.  I was especially happy with the customer service when I did have to call for help.  I'll be ordering a second one for another room soon.", "verified": true, "helpfulness": "0/0", "author": "ltf"}, {"rating": 4.0, "review": "I know that there are super secret hacks for the cognoscenti that allow one to transmute Pb to Au, but for the naive consumer buying the dang thing, there are precisely 3 things one can do:1) Enjoy a really magnificent slide show.2) Watch Netflix.3) Watch YouTubeWhen one can stream ANY content, from any IOS or Android device, then I say oh hell yes, till then... meh...Update as of 9 February, 2014:Well thanks to another user pointing me to:[...]I saw a list of supported apps. If you install any of theses apps, and connect to your Chromecast using the Chrome cast app first, then you can stream content. From a laptop running Chrome, you can send tabs using the Chromecast extension.I would like to add an additional star to my review and say I don't regret buying the thing, I think it's pretty dang cool, but still it would be friendly to include better documentation, and it would be helpful for the ancient likes of me if Google would update the IOS app to show all supported apps.Just saying", "verified": true, "helpfulness": "2/2", "author": "Joseph Myerson"}, {"rating": 5.0, "review": "Works amazing for Netflix on my non-smart TV.  I Use it every night! Not big or bulky so easy to keep clean and out of the way.", "verified": true, "helpfulness": "0/0", "author": "Billy Joe"}, {"rating": 5.0, "review": "I just loved the way the chrome cast performance....true value for money. Streaming is seamless if you have a powerful machine I use my MacBook pro 13\".", "verified": true, "helpfulness": "0/0", "author": "Navanith"}, {"rating": 5.0, "review": "Easy to use, no techy skills needed. No need for blue ray players, X boxes, etc to access netflix and other sites. HighlyRecommend. Makes every TV a \"smart\" TV", "verified": false, "helpfulness": "2/3", "author": "geethu thomas"}, {"rating": 1.0, "review": "I chose the rating I gave it a one star because, I would rather use my hdmi cable vs Chromecast.There are many things about this that I do not like and that they were not honest about with their advertising.", "verified": true, "helpfulness": "0/3", "author": "Joseph E. Battifarano"}, {"rating": 5.0, "review": "Perfect for watching on big screen TV thru tablet or laptop. No wires required, easy set up. Needs more apps to down load.", "verified": true, "helpfulness": "0/0", "author": "tarheel"}, {"rating": 5.0, "review": "My family and I love it. It's so much easier now to watch our favorite showes. This was a great investment.", "verified": true, "helpfulness": "0/0", "author": "Professional Shoe Lover"}, {"rating": 3.0, "review": "Had know Idea it has to remain plugged into a power source. So not what I thought it was capable of doing.", "verified": true, "helpfulness": "0/0", "author": "Jess W Ryan"}, {"rating": 5.0, "review": "Easy to use, no techy skills needed. No need for blue ray players, X boxes, etc to access netflix and other sites. HighlyRecommend. Makes every TV a \"smart\" TV", "verified": true, "helpfulness": "0/0", "author": "Woundgal"}]