[{"rating": 4.0, "review": "All the streaming! MIrrors the android tablet screen. Now hbo go and netflix are on my big tv. Don't have to use the playstation for netflix anymore which is nice.", "verified": true, "helpfulness": "0/0", "author": "James Macdougall"}, {"rating": 1.0, "review": "It didn't work for me.It almost came up once.Nothing since then.", "verified": true, "helpfulness": "0/1", "author": "Otis Boxer \"Otis\""}, {"rating": 1.0, "review": "Does not work with Apple Extreme.", "verified": true, "helpfulness": "0/0", "author": "John S."}, {"rating": 5.0, "review": "We have this ChromeCast and we have a Roku 3 player...We love our Roku too but there are some things it just won't do (or do as well)...so we use the Chromecast for these...1)We have Comcast Xfinity and we have HBOgo but Roku doesn't have an agreement with Comcast so the only way we can watch HBO streaming on the TV is with the Chromecast, and it works very well for that.2) We have purchased items on Youtube. Roku youtube doesn't let you play your purchased items, however I can stream them using the Chromecast!! yay Chromecast :) thanks for being a good sport.", "verified": true, "helpfulness": "1/1", "author": "A"}, {"rating": 5.0, "review": "Now I can actually use my tv to watch things again.", "verified": false, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "We use this mostly to stream YouTube onto the TV.  The picture looks amazing and is very responsive.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 1.0, "review": "I can't play/cast 99% of what I want to watch to this device. Amazon, Cox, etc. don't support it. Very disappointing.", "verified": true, "helpfulness": "0/0", "author": "Anja J Crotts"}, {"rating": 5.0, "review": "it works but I am a little disappointed that it needs an external power supply as my olde TV only has a HDMI (AABBBOOOO) and no USBand I hope soon they develop more applications that will work with it", "verified": true, "helpfulness": "0/0", "author": "Tim H \"Tim\""}, {"rating": 3.0, "review": "Reading all these glowing reviews makes me wonder. Where do all these people live? Why do I ask this? Il tell you in a moment. Before I do though.  Let me just say. I do like my chromecast very much. Considering what I payed for it and the fact that it works well most of the time. Its great.It does have a Achilles heel however. That is lack of 5ghz wifi support. This is a huge hole. If you live in a crowded and congested wifi area. Your gonna sufffer some bad lag. Chromecast will only work in the 2.4ghz channel width. I understand googles thinking on this. The device needed to be cost effective and compatible. But, I would gladly pay 10 bucks more for 5ghz compatibility.  After all. Thats what 5ghz is for. Streaming  video and music. Wish it had it. So just be aware of this if you live in a apartment complex with multiple AP' S around you. It will work mostly. With interruptions unfortunately. ..", "verified": false, "helpfulness": "0/0", "author": "pckarma112"}, {"rating": 5.0, "review": "A+++ fast delivery and product was as described. Would definitely use seller again!", "verified": false, "helpfulness": "0/0", "author": "Elizabeth"}]