[{"rating": 5.0, "review": "I love how easy it is to use!", "verified": true, "helpfulness": "0/0", "author": "Mike Fournier"}, {"rating": 3.0, "review": "I like what they are trying to do with this device, however, releasing the file sharing abilities would go a long way towards me loving it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "jaye"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "kellianne Smith"}, {"rating": 5.0, "review": "I have to admit - at first I hated it, but I did not know how to maneuver through the main screen.  Then I looked and it appeared that almost everything on there you have to Pay extra for!  BUT- then I found the area on left called PRIME VIDEO- bam!  that is where you find mostly free things to watch with your Prime membership.  I was in my glory!  then I went on my account on my desktop and found a few free games to put on there etc.  Now we are very happy and watch our Amazon fire Tv all the time -  We especially liked the Ancient Aliens series on there, the John Adams HBO series, Deadwood HBO series, and on & on.  Lots of free movies too.  You can get Pandora radio by getting the APP then signing in to it. (no you don't pay for Pandora)  You can search by voice- Hold the button that has a microphone on it and hold till you are done talking- search by saying \"Jack Nicholson\" and tons of Jack's movies pop up- then you scroll through to decide -some may be free some pay movies.  We adore the Galaxy Bowling game- can play with 1 or up to 4 people.  We bought package with remote and game controller - here is link to what the controls/buttons do:  https://developer.amazon.com/public/solutions/devices/fire-tv/docs/controller-behavior-guidelinesTHE ONLY CON for the Amazon Fire TV:  You CANNOT SHUT IT OFF/ON no button  it gets fairly hot- so I didn't like the idea of it staying on all the time!  SO:  you either unplug it every time (which is a big pain)  OR  Go to HOME SCREEN--- then scroll down to the SETTINGS  then to SYSTEM - then SLEEP should be yellow (highlighted) Hit ENTER (the middle of that round part on remote)  It will put Fire TV to SLEEP ---- But don't touch any buttons after this on remote or game controller-- or it will wake it up again!My husband looked at the Amazon Fire TV Holders that hang on the back of the TV Vents:  Voila ---- he made one for free out of Chicken wire with a few other wires attached at the top to hold it sturdy onto the back of our tv.  Keeps it nice and cool since it sits in the little basket with lots of holes and room.BE WARNED:  The HILL CLIMB RACE game can be addictive!  My husband who never plays games could not stop playing till he got to a certain level.  He has not touched it since!  (says he gets tooooo wired playing it)UPDATE 2/17/15--------Amazon gets you hooked on FREE series things like ANCIENT ALIENS series and Now all of a sudden BAM - starts Charging $$$ for each one or a whopping $34.95 for ONE Season!  I called Amazon today and the gal said Amazon no longer has agreement with HISTORY CHANNEL and also BBC.  Both of these are why we loved the Fire Tv unit.  Not any more!  May wrap it up and sell on EBAY if this keeps up!", "verified": true, "helpfulness": "26/27", "author": "SoCal Folks"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Pedro levasseur"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Patrick McCall"}, {"rating": 5.0, "review": "I have been using the amazon fire box for a month now. We fired cable because of the price jumps yet again. Best decision i have ever made. I havent had one problem with my box. It doesnt freeze. The apps work great. I have it pin locked so no surprise charges. If it is an item to be paid for it is easy to see what the cost is. I would reccomend this to anyone wanting tv options with out paying high monthly fees.", "verified": true, "helpfulness": "0/0", "author": "Christine"}, {"rating": 5.0, "review": "I've had quite a few streaming players in the last couple years and fire tv is the best. Easy to setup and use, lots of Apps and channels, great for running Kodi/XBMC and the voice search works great. If I had to list a con it would be that the voice search only works with Amazon and doesn't search Netflix or Hulu ect. But with the fire tv app remote on my iPhone I have a full key board to type in searches.", "verified": true, "helpfulness": "0/0", "author": "michael bay"}, {"rating": 5.0, "review": "Works great.  Easy to install.", "verified": true, "helpfulness": "0/0", "author": "Marlene"}]