[{"rating": 4.0, "review": "Wiatching Youtube on TV is a great feature, but need more applications to support it => hope it will be there soon", "verified": true, "helpfulness": "0/0", "author": "Serguei GLOTOV"}, {"rating": 5.0, "review": "Been waiting on this for quite some time. This little product works really well and I watch videos from tabs.", "verified": true, "helpfulness": "0/0", "author": "Paul Giang"}, {"rating": 1.0, "review": "This product doesn't do much other than play netflix and YouTube on my tv... To bad my tv and receiver already do this. Thought I'd be able to mirror everything from my iPad, at the very least I was hoping to mirror safari and movies on my iPad... Skip this and get the Apple TV.", "verified": true, "helpfulness": "0/3", "author": "kyle hindley"}, {"rating": 5.0, "review": "Great way to watch videos from YouTube and Netflix on my TV.  Works flawlessly with my Android phone and tablet.  LOVE this!  Will probably buy another for another TV.  Well worth it!", "verified": true, "helpfulness": "0/0", "author": "L Rogers"}, {"rating": 3.0, "review": "Is a very good product but casting local media is a must to be a 5 star product, for now is 3 stars.", "verified": true, "helpfulness": "0/0", "author": "Robin Muresan"}, {"rating": 5.0, "review": "This is great for the price! I love that I can watch anything on my TV from my tablet and computer!", "verified": true, "helpfulness": "0/0", "author": "June"}, {"rating": 2.0, "review": "My phone won't support the latest app (android, Casio G/zone) and it won't work with my chromebook. might be a great device but as of now I can't tell you.", "verified": true, "helpfulness": "0/0", "author": "Scubano"}, {"rating": 5.0, "review": "Easy to install and operate. Google does it again! It really make it easy to steam from an Andriod or OS device .", "verified": true, "helpfulness": "0/0", "author": "Tony Shepherd"}, {"rating": 4.0, "review": "The Chromecast is exactly what it was promised to be and works perfect. Easily and fast set up it works perfect with all the supported apps on my Android. Chrome on a laptop streams to the Dongle perfectly as well.Only the implementation of YouTube in Chrombrowser isn't working for me (at the moment in the UK) yet, but since I can cast every Chrometab it's not really a problem.I'm looking forward to many many more apps that support Chromecast i.e. Vimeo, VLC, Spotify, ... and when that happens especially if you don't have smart TV the dongle is worth 10 stars", "verified": true, "helpfulness": "0/0", "author": "Moritz Jahraus"}, {"rating": 1.0, "review": "This is only good for Utube and I guess Net(ripoff)flix. I cant watch TV through my computer without a DELAY. I hope they inprove this device so i can go wireless watching TV with no CABLE $.", "verified": true, "helpfulness": "0/3", "author": "Scott \"tech wannabe\""}]