[{"rating": 5.0, "review": "This is definitely a promising product.  I just wish it would have more apps like Amazon Prime Video and other apps.  They are a bit slow at pushing out apps.  This is glitchy at times and will need some ironing.  However, this is still in beta stage.", "verified": true, "helpfulness": "0/0", "author": "DL"}, {"rating": 3.0, "review": "After you install all of the necessary plugins to use this tool, it's awesome.Set up took me more than just a few minutes. But did eventually get it up and running.Fallbacks include not being able to easily watch personal video on connected device, not a huge number of usable vendors, and will not work when connected to a proxy server.", "verified": true, "helpfulness": "0/0", "author": "Michael Minter \"Programmer hiding out in Austin, TX\""}, {"rating": 5.0, "review": "I was lucky enough to order this on the first day it was released and got 3 months of free netflix with it.  Can't beat that.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Kassem"}, {"rating": 4.0, "review": "Love this gadget! Works great with my Android phone and very inexpensive to get HD movies to ur big screen.", "verified": true, "helpfulness": "0/0", "author": "tim28"}, {"rating": 2.0, "review": "It is not what I expect .  Set up is very easy but not easy to change to different wireless network", "verified": true, "helpfulness": "0/1", "author": "ricky nguyen"}, {"rating": 5.0, "review": "I have a 3 year old 55' Plasma HD TV . With Google Chrome cast i can seamlessly cast from my iphone 5 , Laptop .The clarity of picture i get when i CAST Netflix from my iphone 5 onto the TV is amazing . I use Google chrome browser in a desktopas well for casting . 'Cast Entire desktop' feature is pretty good .The audio  should be improvised though.Overall Google Chromecast fits into my requirement set perfectly.", "verified": true, "helpfulness": "0/0", "author": "Sreechandra Sangoju"}, {"rating": 2.0, "review": "Can't stream local content over a LAN, and Google's streaming media servers are unreliable in the extreme resulting in a very poor overall user experience.", "verified": true, "helpfulness": "0/1", "author": "Kirk Rader"}, {"rating": 1.0, "review": "I sent it back.  I think it's perfect for someone with a lap-top who wants to use Google to connect the capabilities of their lap-top and their TV.  But it doesn't work with my new note-pad.", "verified": true, "helpfulness": "1/4", "author": "Liz Severino"}, {"rating": 5.0, "review": "Casts directly from YouTube and Netflix (which we have) but also Hulu Plus and some others. You can cast full screen videos in your browser as well but Intel i3 processor minimum recommended or herky-jerky video ensues.Nice pics to look at as well when not casting.", "verified": false, "helpfulness": "0/0", "author": "Cheryl"}, {"rating": 3.0, "review": "I bought the Chromecast to see what Google is up to in TV.  Its OK, the video quality is not as good as Roku.  The content is not there compared to Roku.  Yes it works with YouTube, but Roku is now starting to support YouTube.  Its cheap, hence the OK rating as you get what you pay for.  I think Google would need to buy Roku to get a competitive product.", "verified": true, "helpfulness": "2/3", "author": "J. A. Quayle"}]