[{"rating": 5.0, "review": "Works great and a must have when trying to see videos from your phone and want to view on a large screen.", "verified": true, "helpfulness": "0/0", "author": "Daniel Castrellon \"Daniel Castrellon\""}, {"rating": 5.0, "review": "So nice to have a really easy way to do internet on TV without spending a mint or big tech barriers.", "verified": true, "helpfulness": "0/0", "author": "Jill Frederickson"}, {"rating": 5.0, "review": "Chromecast makes it simple to watch streaming content on your TV.  Occasionally I have to wait longer than I would like for the stream to start, but for the price, you can't go wrong.", "verified": true, "helpfulness": "0/0", "author": "Brian Luttinen"}, {"rating": 1.0, "review": "Roku beats this device on each and very term - apps, content and just works. Chromecast at this stage is a $35 donation to google to do their R&D; for a TV device.", "verified": false, "helpfulness": "0/2", "author": "Aditya Pandit \"adi\""}, {"rating": 3.0, "review": "just another bad product just to make a buck some people watch this commercial and think they too going to watch all the movies foe free Wrong", "verified": true, "helpfulness": "0/1", "author": "Phillip Lopez \"philliplopez\""}, {"rating": 5.0, "review": "I think this device worked exactly as described.  I am moderately to poorly skilled with computers and devices but this worked without undue frustration or stress, as advertised.", "verified": true, "helpfulness": "0/0", "author": "joand"}, {"rating": 1.0, "review": "Worthless piece of junk. 3 hours and I could not complete the setup. No instruction/directions. On line troubleshooting was no help.  finally was informed to change settings on 2 networks(which I can't).  It has a very narrow range of equipment compatibility issues.  Back to the store it goes.", "verified": false, "helpfulness": "0/3", "author": "Glenn A Brown"}, {"rating": 5.0, "review": "I love it for my Acer for Christmas can't wait to play it! :)Thanks amazon so far the products have not disappoint me satisfied customer!Lurisol", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It is really great;however, my internet is satellite and has a hard time meeting the streaming demands of chromecast.", "verified": true, "helpfulness": "0/0", "author": "Karen Snodgrass"}, {"rating": 3.0, "review": "I recently purchased the Google Chromecast HDMI as a replacement for my existing wired HDMI chord, The Chromecast is good only for Google related sites and few other online streaming sites like Netflix, Hulu plus and the likes. I chose this device because of it's wireless capabilities, I hate using wires and my old HDMI chord was not working properly. Having said that, the chromecast doesn't allow me to stream anything from my computer as I used to do with the HDMI chord and for me this is a big disappointment for me; I want to be able to stream from my computer without having to go through a browser. I think Google should quickly work on this issue. Until then I won't be recommending this product to anyone of my friends. I am also disappointed that it doesn't allow me to stream my own videos and songs stored on my android phone and Ipad. Google fail to include the lack of these features in their advertisements for the chromecast. I hope someone can bring a similar product to the market with all of these capabilities even if I mean paying a little more for it.", "verified": true, "helpfulness": "1/1", "author": "sbdjubor1306"}]