[{"rating": 5.0, "review": "Gave as a Christmas gift to my son who also bought another one.  He loves it says it is easy to install and is great for my grand daughter to use.", "verified": true, "helpfulness": "0/0", "author": "gamelover"}, {"rating": 5.0, "review": "I set this up in less than 5 minutes and it just works.  Casting a tab is a little less clear than casting the optimized content (netflix, google play, utube, etc.)  I even showed my 70+ year old dad how to use the chromecast.  Great little device.", "verified": true, "helpfulness": "0/0", "author": "ItsFullofStars \"ItsFullofStars\""}, {"rating": 3.0, "review": "Casting Youtube and Netflix was really good but when I cast a tab, it slows down the internet to 1 Mbps from 50 Mbps and  I had to restart my modem every time the internet goes slow. This is very annoying for me. Otherwise the device is good.", "verified": true, "helpfulness": "0/0", "author": "THULASIRAM DEVI"}, {"rating": 1.0, "review": "Taking notes from Apple the installation is made to be super user-friendly, but if you run into problems there is little to no help. I was able to install everything and get it working for about 10 minutes. The device seems to be unable to maintain a connection to my wifi network.I checked their FAQ, thankfully I have one of the supported routers, they listed an older version of the firmware, which I downloaded and tried and chromecast was even less reliable.From the 10 minutes I used this it seems like my Roku 3 is a far superior device. The form factor is better (this may be small but it's the biggest thing coming off the back of my tv and has tiny cords coming off the back of it, one they don't show in product shots). The only thing my Roku doesn't do better is YouTube, because for some reason they don't have a Youtube station and anyone that makes one gets shut down.But Amazon, Netflix, local media via Plex, and all the rest are done better and more reliably by my Roku.", "verified": true, "helpfulness": "3/4", "author": "wesruv"}, {"rating": 3.0, "review": "It's ok for many basics uses, but not to see hd videos in 3rd party app (like Avira).In Google Movies the streaming is good enaugh, but with some loss of quality sometimes.", "verified": true, "helpfulness": "0/0", "author": "Haw"}, {"rating": 2.0, "review": "I wish I would have done more research into this before hand. It is no where near the plug and play ease of use as they make it seem. It basicly is just an airplay device unlike others like it that have a remote and apps ... your remote is your device(i.e. phone, tablet) and you stream from it as well which unless you leave your device plugged in will drain the battery fast. This also means you wont be able to use your device while watching a show.The Set up was god awful I am a fairly tech savy guy but wont be getting any IT job any time soon and this thing stumped me. It wouldnt connect to devices it gave all sorts of error messages. after 3 emails and 2 phone calls to tech support a friend finally was able to go into \"My Network\" and change settings on my router and update with a patch to get it to work, then had issues a week later.If you are buying this as a gift make sure they are tech savy and not your elderly parents or grandparents because they will never be able to trouble shoot the device.", "verified": true, "helpfulness": "1/1", "author": "chad baker"}, {"rating": 2.0, "review": "I  followed all the instructions for set -up.  At this point I have spent a lot of time and have not been able to make it work !", "verified": true, "helpfulness": "1/1", "author": "Steven Kesl"}, {"rating": 5.0, "review": "This unit works the way I hoped it would. It is so simple, everyone in the house can use it.", "verified": true, "helpfulness": "0/1", "author": "John R Ardizzoni"}, {"rating": 3.0, "review": "Likes:- fantastic, compact HDMI-plug design- intuitive and responsive on-screen controlsIssues:- confusing at first to install both Chrome and the Chromecast plugin for iOS- need to power through USB means there are still logistical constraints (distance from and cabling to either a wall plug or powered USB port)- when viewing YouTube videos using Chrome, so many HD videos that were viewable on streaming device (phone, tablet, laptop) weren't through the Chromecast (not viewable due to resolution issues)", "verified": true, "helpfulness": "0/0", "author": "HK"}, {"rating": 4.0, "review": "Seems to work well. It was a gift. . I looked on the net and worked for a good while before I could get it to work.", "verified": true, "helpfulness": "1/1", "author": "Danny R. Guill"}]