[{"rating": 5.0, "review": "I love Chromecast. Help made cord-cutting easy.This thing just works!", "verified": true, "helpfulness": "0/0", "author": "robin jacob"}, {"rating": 5.0, "review": "I like it,Not love it. I would go with the amazon fire tv stick More.", "verified": false, "helpfulness": "0/0", "author": "miguel deleon"}, {"rating": 4.0, "review": "This little thing works! Streams nice and easy, even from other not-so-official websites. . .", "verified": true, "helpfulness": "0/0", "author": "Dngr411 \"[D]\""}, {"rating": 5.0, "review": "Unlike most people who would buy a Chromecast, I own a Smart TV. Yes, a lot of the functionality of the Chromecast overlaps the smart TV, but the Chromecast gives me a couple of functions I don't get from the TV.First, I have a lower-end Samsung Smart TV, and every time I turn it on, I'm greeted by a blank black screen. The Chromecast background gives me a nice default photo slideshow when I turn on my TV.Secondly, I use Plex Media Server at home, and the Chromecast allows me to play movies remotely or when visiting friends and family.For most users with a Smart TV, the Chromecast is an unnecessary expense. But if either of the situations listed above applies to you, it's well worth the purchase price.", "verified": true, "helpfulness": "0/0", "author": "David Hanson \"Dave in Colorado\""}, {"rating": 4.0, "review": "Does not have amazon app", "verified": true, "helpfulness": "0/0", "author": "Edgar"}, {"rating": 5.0, "review": "Interesting product that I use every day. I love not having to use a cord to watch Netflix on my T.V.", "verified": true, "helpfulness": "0/0", "author": "Michael DellaPaolera"}, {"rating": 2.0, "review": "Kind of a waste of money, the screen cast is the only function and we have laptops thatconnect to the screens.No way this is as smooth as a HDMI cableAbout its only use is wireless connect to monitor", "verified": true, "helpfulness": "0/0", "author": "Attn4d"}, {"rating": 5.0, "review": "LOVE my Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Christopher"}, {"rating": 5.0, "review": "Love these little guys. Have one on every TV!!", "verified": true, "helpfulness": "0/0", "author": "Fitgal"}, {"rating": 5.0, "review": "Outstanding device! I use it daily, and it's so easy to set up and cast. Love this thing!", "verified": true, "helpfulness": "0/0", "author": "Patrick Reeves"}]