[{"rating": 1.0, "review": "Being a Prime member, couldn't wait to try this device. I was offered a \"free 30 day trial\" of the device (more on this mishap later), so I took the opportunity and received it promptly. After the 25th day, Netflix suddenly said \"unable to play at this moment, please try again later:. This was for certain shows or movies, but now on the 50th day, NO shows nor movie is able to play. So I rebooted - nothing. Twice - nothing. Uninstalled, reinstalled Netflix - no dice.Thought perhaps it was Netflix, no way Jose'. Every device from my mobile phone, pc, mac, apple tv, xbox360, ps4,and google chromecast they ALL WORKED.Along with that, WATCH ESPN doesn't recognize Charter subscribers. Yet my other device forementioned all do.So then knowing that I wasn't happy with the device, I wwanted to return it before the \"30 day trial\" was over. Had to pay shipping and handling.. what a sham.I love Amazon and it's service, but now thinking this will be my last year as a Prime member - don't get me started on the troublesome Amazon Prime music service - rather stay with Spotify and even listen to the ads.", "verified": true, "helpfulness": "8/10", "author": "RpGedimac \"RpG\""}, {"rating": 5.0, "review": "This works much faster than my smart TV \"dongle\". ( I believe that is what it is called). We really like the voice-activated search feature.  Well worth the money in my opinion and would buy it again .  Only one issue at this point (Aug 2015): trying to hook up my bluetooth headphones and I purchased the appropriate dongle to plug into the USB port on the box, but still not working. (I tested everything on my PC and everything works)  So, my question is----What must I do to get bluetooth connection working on fire tv box?????  Many tks in advance for HELP!", "verified": true, "helpfulness": "1/1", "author": "Larry L. Schall \"Sirdakris\""}, {"rating": 5.0, "review": "Works great very easy set-up and super fast connection.", "verified": true, "helpfulness": "0/1", "author": "Ricky Bowen"}, {"rating": 5.0, "review": "Nothing else is this fast. With a quad core processor and 4 times the memory of any other streaming product, it speeds through menus, boots quicker, starts videos quicker and  with higher end resolutions and surround sound like no other boxes can do! (While Roku 3 was the fastest.)", "verified": true, "helpfulness": "0/1", "author": "ThePwrSerg \".......time will tell\""}, {"rating": 5.0, "review": "Love this thing!!!!!!!", "verified": true, "helpfulness": "0/1", "author": "Samuel stinger"}, {"rating": 5.0, "review": "WE LOVE THIS! so easy to use, wish the voice search function worked in other apps that are non-amazon though. When will Prime Music come to this device though?", "verified": true, "helpfulness": "0/1", "author": "TheHoskins12"}, {"rating": 5.0, "review": "Love the system. Easy to operate. Great show quality. No hesitation or jumbling while the signal tries to keep up like the others I've tried.", "verified": true, "helpfulness": "0/1", "author": "William Lindsey"}, {"rating": 5.0, "review": "After making the decision to cut the cord so to speak we connected our laptop to our smart TV and would stream what we wanted to watch via the internet. It worked pretty well but was somewhat \"clunky\" to use.and slow to respond.After looking at the different option available we decided on the Amazon Fire TV. Are we glad we did!!It was ordered on Thurs and delivered Sat morning and it was up and running ten minutes after out of the box.Was not expecting too much with the speech search but was amazed how well it functions. The overall performance of the unit is first rate.The picture quality is excellent.The cost of the unit was less that the cost of one month satellite.Very happy with this purchase, highly recommend.", "verified": true, "helpfulness": "0/1", "author": "Burtonman"}, {"rating": 5.0, "review": "If it worked! With my internet, the excuse is my internet, is not fast enough, to run the HD movies So, even though I downloaded the software correctly, all it does is buffer. I am waiting for the bugs to be worked, out. Because upgrading my internet is such a hassle.THAT was yesterday, I phone Amazon and I finally got connected with Drew, a tech working in the Amazon Kindle dept. and with his help and rebooting & updating, he did the impossible, my Amazon Fire started working with my slow internet connection. I watched the entire 8 episodes of, Jane Austen's Pride & Prejudice. I promised Drew, if he could make my Amazon Fire work, I would change my review. Thanks Drew!", "verified": true, "helpfulness": "1/2", "author": "Retro Shopper"}, {"rating": 5.0, "review": "Was hard to get connected to my tv though. Still working on that. May need some adapters.", "verified": true, "helpfulness": "0/1", "author": "TB Hairston"}]