[{"rating": 5.0, "review": "Love this!", "verified": true, "helpfulness": "0/0", "author": "L. Hounshell"}, {"rating": 5.0, "review": "Excellent product,  It needs a simple little instruction manual to come with,  that would be a BIG help.  The video that is built into it is good but you can't DO what it says and watch the video at the same time!!!  Same on you Amazon.", "verified": true, "helpfulness": "0/0", "author": "Len G \"Len\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "don't have a clue"}, {"rating": 5.0, "review": "The best out there, Apple is ok but this has more content and the advantage of Prime", "verified": true, "helpfulness": "0/0", "author": "PJD \"rfplanner\""}, {"rating": 5.0, "review": "more programas than apple tv and it works flawless!!", "verified": true, "helpfulness": "0/0", "author": "jjponcem"}, {"rating": 1.0, "review": "Never worked. Returned.", "verified": true, "helpfulness": "2/4", "author": "Steven Rodriguez"}, {"rating": 5.0, "review": "Great product! So much smoother than the Ruku box. Wish the tv shows and movies that aren't included with Primw were less expensive. Paying $2.99 for one episode of something is crazy! Maybe for the whole season but not per show.", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 3.0, "review": "No off button, has no ability to read movies form your external HDD or USB. the ret of the feature are ok.", "verified": true, "helpfulness": "1/1", "author": "usdot2"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Cheryl L. Gardner \"steppin in char\""}, {"rating": 3.0, "review": "Initially I LOVED this little box, but after about a week of use I began to get a pop-up saying my storage was \"critically low\" and I needed to delete applications. The funny thing is I haven't even started downloading any apps yet. I think the one flaw, and Amazon is already well aware of this, is the storage size. After reading other reviews and blogs and forums I guess you can't even use the USB either (for storage). Disappointing.", "verified": true, "helpfulness": "0/0", "author": "Vincent Lopez"}]