[{"rating": 3.0, "review": "Well, I should read about it before jumping to buy it. It is not a link between your TV and other device, it works only for some applications, not all. So if you are thinking, like I did, that I can see my tablet/phone screen on a big TV, this is not the case. It will work only for some applications not as a mirror screen for your device.", "verified": true, "helpfulness": "0/0", "author": "Goran Lazarevic"}, {"rating": 5.0, "review": "My daughter loves being able to stream movies and television shows to her bedroom using the HDMI Streaming Media Player.", "verified": true, "helpfulness": "0/0", "author": "Charleen C Ayres"}, {"rating": 2.0, "review": "Really a downer.The very reason I purchased the Google Chromecast was to watch Prime videos.  Not so.  It does everything else very well, but my smart television does Netflex, Youtube, and everything else without a problem.  Google Chromecast or Amazon should work together on a work around for this problem.VERY disappointing", "verified": false, "helpfulness": "0/2", "author": "David"}, {"rating": 5.0, "review": "Chromecast is the cheapest way to turn ur tv into a smart tv with ease.  Over time more and more apps are adding support to the chromecast.  I mostly use HBO Go and Allcast", "verified": true, "helpfulness": "0/0", "author": "Nirari"}, {"rating": 5.0, "review": "I read so much about the Chromecast and at one point I was in a confusion whether to buy DLNA + Mirracast Dongle or Chrome cast  and went with google.  I am very happy I can cast local content to TV from android phone or from PC I can cast the screen to TV like a projecter with cast options.  Only thing missing is 3.5 aux output which would help to use external audio systems/speakers.casting big movie files are slow even thought you have good WIFI and router, google has to do some thing here....Over all nice product from google as long they don't restrict casting local content.", "verified": true, "helpfulness": "1/1", "author": "enavas"}, {"rating": 4.0, "review": "The item performs some great tasks for the price. However, there seems to be obvious issues that you cant look away from. The number one issue is being able to stream your personal content to the device (digitally downloaded movies for example). The whole internet to TV conversion always seems to lack one or two things that complete its reason for existing and chromecast lines up right behind the rest on that note.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Fina"}, {"rating": 5.0, "review": "I love my Chromecast device.  I cast all my Netflix & YouTube media onto the TV.  It was easy to set up & I recommend it to everyone who doesn't have a PS4 or Xbox game to stream through.", "verified": true, "helpfulness": "0/0", "author": "Delphine Booker"}, {"rating": 1.0, "review": "I have a motorola time warner router and Chromecast does not let me set up on this router. I have tried to resolve the issue through their troubleshooting page and info online and they offer no advice for my router model.  I'm pretty sure this is a very popular Time Warner router, so beware that your chromecast has a high chance of being worthless if your router doesn't match its criteria", "verified": true, "helpfulness": "0/1", "author": "Wendy McIntire"}, {"rating": 4.0, "review": "I'm really enjoying my chromecast but I just expected that I could brodcast everything, just like if i used a wireless monitor.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This device is a big ZERO.  Does not work with a pc, does not work with an ipad, doesn't even work with an android or even two, it does not work i tell you not even one bit", "verified": true, "helpfulness": "0/2", "author": "Robere"}]