[{"rating": 5.0, "review": "Just awesome! we were using Apple TV and always having issue with it and the poor rental interface. (you cannot go back to a movie you just rented and re-start it). So now we're happily OFF Apple TV for good and enjoying Google's choice of movies which is as good if not better than Apple's. Yeah!", "verified": true, "helpfulness": "0/0", "author": "Zohan777 \"Moviefan\""}, {"rating": 5.0, "review": "Great device!", "verified": true, "helpfulness": "0/0", "author": "Jose P"}, {"rating": 2.0, "review": "Works well on iPad and iMac with the Netflix app (or Chrome window in the case of the iMac). Has a maddening propensity to malfunction when casting on the iMac from a Chrome window. Randomly, it will stop casting and give a \"device missing\" error. The only way I've found to begin casting again is to reboot the Chromecast.I saw a google troubleshooting page that said it was a known issue and they were working to correct it, but in defense of consumers, this is the type of \"issue\" that should be addressed BEFORE wide release, not after.", "verified": true, "helpfulness": "0/0", "author": "progstock \"progstock\""}, {"rating": 5.0, "review": "Good price", "verified": true, "helpfulness": "0/0", "author": "jacob tulga"}, {"rating": 2.0, "review": "I thought I would like the Chromecast because I use Google chrome and I have an android so everything works well together. I had to give the Chromecast two stars because I have only had it not even a year yet and it does not work anymore. Lately (before it stopped working completely), it would continuously reset itself like it was right out of the box. Now it won't even do that. The only thing that appears on the screen is this small box filled with vertical colored lines. I tried everything to fix it. Don't get me wrong, the chromecast worked really well for awhile and it was so handy streaming whatever you want from your phone or laptop, but it didn't last for me. Others may have had better luck than me. I originally had a Roku and had that one for years and it needed to be replaced so I decided to try this. I will be going back to the Roku now.", "verified": false, "helpfulness": "0/0", "author": "Laura T."}, {"rating": 5.0, "review": "Wonderful tool.  Chromecast makes media so much easier to access and watch on large TV's.  I have a smart TV, but this device just made it a genius.  If you watch anything for an extended period of time on line, you really want to get this.", "verified": true, "helpfulness": "0/0", "author": "Vincent Nelson \"Vanquisher\""}, {"rating": 4.0, "review": "Great for a TV with HDMI that don't have the Internet built-in.", "verified": true, "helpfulness": "0/0", "author": "SDP"}, {"rating": 5.0, "review": "What isn't to love about chromecast? Now that they added screen cast, you don't even need a supported app. If I can get to it from the web, I can get it on my tv.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 5.0, "review": "Really a great item", "verified": true, "helpfulness": "0/0", "author": "craig Paleschic"}, {"rating": 1.0, "review": "Works with any TV that has HDMI... my ass. It works with some televisions with Hdmi, not all. Google needs to make a list of supported devices instead of wasting people's time. It can not connect properly to my television, so I have to return it. Waste of my time, waste of my money. Be more forthcoming with information. Took me 4 hours to figure out why it wasn't working properly... because it was designed that way.", "verified": true, "helpfulness": "0/1", "author": "Haplo42"}]