[{"rating": 5.0, "review": "Beyond expectations!! Perfect way to start to get rid of your cable", "verified": true, "helpfulness": "1/1", "author": "corey"}, {"rating": 5.0, "review": "Still having fun seeing all it does!", "verified": true, "helpfulness": "1/1", "author": "Brianna"}, {"rating": 5.0, "review": "I have ordered Kindle Fire Tv and an waiting delivery.  I have Dish network with HBO and Showtime.  Can I cancel those 2 premiums or must I stil subscribe through Dish ??  Debrob1947@yahoo.com", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was the perfect gift", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "1/1", "author": "Jerry"}, {"rating": 5.0, "review": "My son loves the Amazon Fire.", "verified": true, "helpfulness": "1/1", "author": "Deb Shaunty"}, {"rating": 3.0, "review": "Three out of five... Not bad, not great. Fire tv lacks so many of the features to it's competitors, that I rated it average. The fact that you can't get digital sound through the box yet defeats the purpose of buying a digital settop box. Hopefully with firmware revisions and newer apps, this thing will meet the expectations of people like myself that know the technology already exists. The competition does it right with better search and the capability to use a tablet for text based entry or control (hope to see this function soon). I also found some of the apps like PLEX, which are inherently free on the competition, require $5 purchase.  Not that the meager cost is an issue... It became one when the digital sound failed to deliver.I'm keeping it, as it was a present, in hopes it gets better with age... Roku did. But Roku stayed ugly...", "verified": true, "helpfulness": "1/1", "author": "Venny Vicious \"Moving at the speed of Life\""}, {"rating": 3.0, "review": "LOVE, LOVE, LOVE the fire TV have WDTV, Apple TV, Google TV, BOXEE BOX and more. Hands down the Fire TV is the easiets and fastest streaming media app I have ever owned. However I gave this review only 3 stars for 2 reasons. First and foremost the biggest negative and the downfall of this product is the storage.. 8 gb is it, no upgrade ability. So after you install it and update your looking at around 6gb of storage. I installed 4 games, vevo, netflix, espn, nfl, hbo go, and a few other tv apps and im full now.One of the big things is if you use AMAZON prime for photos, that box seems to sync those up in cache taking a huge chunk of memory to allow instant streaming of images which you cant turn off. I have 1.2gigs of images cached in requiring me to delete so I had enough space to stream video.Amazon shouldn't be playing the apple small storage game. Amazon is a consumption device, and Micro SD or USB storage should be allowed so we can but apps, games, etc. I hate fighting with storage just so you force me into an upgrade next year.Other than that this is a fantastic device, but amazon needs to get it's heads out of it's ace on storage limitations.", "verified": true, "helpfulness": "1/2", "author": "Glenn \"Glenn\""}, {"rating": 5.0, "review": "Great product. User friendly, right out of the box. The interactive guide walks you through the process.", "verified": true, "helpfulness": "1/1", "author": "wel"}, {"rating": 5.0, "review": "As a huge Amazon purchaser, I am really enjoying the fire tv", "verified": true, "helpfulness": "1/1", "author": "Brian P Catt"}]