[{"rating": 5.0, "review": "Works great for all your viewing needs!!", "verified": true, "helpfulness": "0/0", "author": "LC"}, {"rating": 5.0, "review": "^Pretty sure^ this is one of the best devices ever made. Seriously the best system for streaming media to a TV and $35 MSRP? I've bought 3 so far...", "verified": true, "helpfulness": "0/0", "author": "Dan D"}, {"rating": 4.0, "review": "Just for you tube and few apps more, is like having your phone asa remote of your TV, but hey it is cool.", "verified": false, "helpfulness": "0/0", "author": "Alan H. Avella Macias \"Alan Avella\""}, {"rating": 1.0, "review": "It is not useful", "verified": true, "helpfulness": "0/3", "author": "Taghi"}, {"rating": 5.0, "review": "I use this device nearly everyday. So portable and easy to setup. Just bought a second one.", "verified": true, "helpfulness": "0/0", "author": "Damon Leto"}, {"rating": 5.0, "review": "i like it , is so quickly with Youtube and netflix , the only bad thing is about video shares i cant find a good free app for that", "verified": false, "helpfulness": "0/0", "author": "Luis"}, {"rating": 5.0, "review": "While the Chromecast isn't perfect, it serves it's purpose in my household very well.  We don't have cable and only use Netflix and Hulu Plus to watch TV and movies; the Chromecast works great for playing both.  There are occasionally issues with getting our phones or tablets to communicate with the TV, but most times it's an issue with the app on the phone rather than the Chromecast itself.  We also sometimes use apps like YouTube, Pandora, and Songza and they all work extremely well.  We haven't had much success with streaming from google chrome on a laptop, but we've only tried a couple of times.  We essentially use the Chromecast in the exact same way that we use our Apple TV, so for less than half the price, it's a great deal.", "verified": true, "helpfulness": "0/0", "author": "K. Lyons"}, {"rating": 4.0, "review": "This is a great product. So easy to use. Nice to not have to connect HDMI cables to your TV when watching movies off of your computer. We weren't using our Netflix account because of the hassle setting up the TV. But now it's easy.That being said, the first Chromecast we bought stopped syncing with our TV and router, and because we were already trying to troubleshoot the issue with Google we started the exchange process with Google. After two weeks of going back and forth with Google, we contacted Amazon for the exchange and had the new Chromecast in two days.All in all, the Chromecast is great. Because Google was as interested in the TV and router makes and models as they were, I think some devices might have issues with the Chromecast. However, our new Chromecast works like a charm.", "verified": true, "helpfulness": "0/0", "author": "William Lewis"}, {"rating": 5.0, "review": "This thing rocks!  Every home should have one.", "verified": true, "helpfulness": "0/0", "author": "Amy Garrett"}, {"rating": 4.0, "review": "Works as expected", "verified": true, "helpfulness": "0/0", "author": "Todd Oswald"}]