[{"rating": 4.0, "review": "Works great except that I can't get it to work right with netflix", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "The product met my expectations. I love it", "verified": true, "helpfulness": "0/0", "author": "Jose Zapata"}, {"rating": 5.0, "review": "Excellent alternative to the very expensive Apple TV. It gives me full functionality and it's easier to transport, as an added value.", "verified": true, "helpfulness": "0/1", "author": "Katia Alvarez"}, {"rating": 5.0, "review": "Great product!  Just wish they would add support for Amazon Prime.", "verified": true, "helpfulness": "0/1", "author": "Douglas J. Schmuecker \"DJ\""}, {"rating": 5.0, "review": "This was one of my better electronic purchase decisions..I'd thought my tv was too old for it, but it had an hdmi port and that was all I needed. I just wish when i sync my laptop to the screen the screen would be bigger..guess i need a tv bigger than a 32\".", "verified": true, "helpfulness": "0/0", "author": "Mel Bennett"}, {"rating": 4.0, "review": "Great item for the price!", "verified": true, "helpfulness": "0/2", "author": "Chris Wenner"}, {"rating": 1.0, "review": "It won't work with my wireless system.  I returned it and received a full refund from amazon.  Too bad.  I really wanted it to work.", "verified": true, "helpfulness": "0/1", "author": "Willie"}, {"rating": 3.0, "review": "When more apps Chromecast, this will be an awesome thing to have.  Personally, I prefer ROKU which does the same and so much more for $15 - $40 more.I recommend a WiFi enabled TV, ROKU and a android phone like (SAMSUNG Galaxy Note which I use to control TV, ROKU, DVR, etc) to take advantage of everything that cable and the Internet has to offer.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "Would be 5 stars if the chrome browser extension exists for android and ios.....awesome product other than that.", "verified": true, "helpfulness": "0/0", "author": "Brian D St Denis"}, {"rating": 2.0, "review": "EDIT:  BUY A FIRE STICKChromecast is garbage...hardly works without crashing, the Full page \"casting\" is terrible with a second or two lag making it impossible to use as a big screen monitor. Wants to tie everything in with google.  You can't even watch your home movies or play music without some convoluted step of streaming them to the internet and then downloading them again.  Tried to watch a youtube music video, it would either play on my phone or on my TV or it would crash or otherwise be a pain in the arse.You have to have it tied to your phone.  Tried it for a weekend and am returning now.  Will be buying another ROKU stick to replace this featureless and buggy dongle", "verified": true, "helpfulness": "0/0", "author": "Dave"}]