[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Carolyn M."}, {"rating": 4.0, "review": "Google's Chromecast is only good for Youtube, doesn't support other sources as good as Youtube.", "verified": true, "helpfulness": "0/1", "author": "shanli"}, {"rating": 5.0, "review": "Perfect!", "verified": true, "helpfulness": "0/1", "author": "Karina Lopez"}, {"rating": 5.0, "review": "Ontime delivery, product as advertised", "verified": true, "helpfulness": "0/0", "author": "Khurram Khwaja"}, {"rating": 5.0, "review": "great but could be replaced for SMART tv now for free", "verified": true, "helpfulness": "0/1", "author": "Omar S."}, {"rating": 5.0, "review": "love the chromecast. Super easy to setup and use!", "verified": true, "helpfulness": "0/0", "author": "Abi A."}, {"rating": 4.0, "review": "At first installation I wanted to cry, I felt duped in a sense.  I actually made an outcry as to why not to buy this product and go for a Roku or the likes instead.  However, I didn't return it, I kept it, for reasons unknown.  But to my surprise I actually found a reason to not only like it, but adore this little guy.  Now, for $35 to have something to further 'automate' your AV experience (esp in a NYC apt) that's quite the deal (seeing as a Sunday brunch will cost you double).  Now what I failed to realize with this (and please note I have years of AV and IT experience behind me) was that the apps this product is advertised with, don't actually come ON the stick; rather you CAST them to the stick.  Doesn't make sense?  Try this; you have an iPad, you download Netflix, you want to watch Pee Wee's Playhouse on the big TV that has Chromecast, you start the program on the iPad and hit the little icon to CAST it ... now you are watching what is playing on your iPad on the TV...wirelessly!  Yay!  But, there are some shortfalls with that.  However, what I LOVE LOVE LOVE about this is one thing that I use it for 90% of the time...Pandora.  I come in, I play Pandora (my receiver automatically switches once it sees that Chromecast is doing fun things) and now I have music from my iPhone to my stereo!  But wait!  There's more!  For those of you with AirPlay know, when the phone rings, there goes the music...not anymore!  Music will still play!  Actually, if you have a BT speaker (or receiver) or AirPlay device, you can play TWO different Pandora streams, simultaneously, from the SAME DEVICE.  To me THAT is effing rad as all get out!  So for $30, you get an easy to use thinger that can play music while you take that phone call, or put that YouTube video up on the big screen all while playing with your phone.  It's worth it", "verified": true, "helpfulness": "0/0", "author": "Anthony P."}, {"rating": 5.0, "review": "a really great product, enjoying it very much", "verified": true, "helpfulness": "0/0", "author": "Leann's Toffee"}, {"rating": 5.0, "review": "Chromcast, it does it all!", "verified": true, "helpfulness": "0/0", "author": "YPG"}, {"rating": 4.0, "review": "EVERYONE KNOWS WHAT IT DOES!It's beautiful, its amazing, its a technological advancement for the ages!But it has been glitchy as of late... especially the screen casting feature.", "verified": true, "helpfulness": "0/0", "author": "Vinith Kuriakose \"Guns&Movies;\""}]