[{"rating": 1.0, "review": "I could not get this to work with my Netgear R7000 Nighthawk Router. I tried reconfiguring the router several times following the suggestions on the Troubleshooting site for the Chromecast, but nothing worked. My router is not one of the routers that the Chromecast has been proven to work with.", "verified": true, "helpfulness": "0/0", "author": "mcdanief"}, {"rating": 5.0, "review": "Awesome it works great!", "verified": true, "helpfulness": "0/0", "author": "CM"}, {"rating": 4.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "MBA"}, {"rating": 5.0, "review": "Excellent!!!!", "verified": true, "helpfulness": "0/0", "author": "enrique lopez"}, {"rating": 5.0, "review": "This was a Christmas gift for my mom.  Two months later she says this was the best gift she's ever received.", "verified": true, "helpfulness": "0/0", "author": "Amabele"}, {"rating": 4.0, "review": "Would be best if casting a tab wouldnt be so delayed, overall great product!", "verified": true, "helpfulness": "0/0", "author": "Sean Buono"}, {"rating": 3.0, "review": "Best $35 Screensaver.  I use this for one thing.All this thing does is play a link to your TV.  It can't transport what you're seeing on your phone, wirelessly, to the TV.  That would be awesome but whatever.  Nothing does that except PSP and PS3/PS4 and blah blah, oh and Microsoft does it too with Glass, so if you're a console person you can have that experience, but basically all this does is: \"HEY GUYS!  I WAS WATCHING SOMETHING ON MY PHONE AND I WANT TO SHARE IT WITH YOU!  LET ME JUST SHOW IT TO YOU ON MY TV!!!  THE THING I WAS STREAMING TO MY PHONE!  WE'LL WATCH IT IN 720P ON MY TV WITHOUT THE STEREO WHICH IS WORSE THAN WATCHING THE SAME VIDEO FROM MY PS3!!!!!!!Right?So I was like, screw this thing.  But something I noticed: when you plug it in to the 4th (or whatever) HDMI slot you have on your TV, if you don't do anything, it will always display these pretty pictures.  So, in other words, if you have a TV and you have open HDMI slots?  If you buy this and plug it into one of them, at the very least you will have a nice screensaver that comes on every time you turn on your TV and choose that slot.This may not sound like much.  But someone is curating those pictures that keep displaying, they're all fairly good, and I haven't once seen a repeat.So, what I do, when I wake up in the morning and have some time to myself, as I'm preparing breakfast and reading news, and listening to music, and so forth, I like to just turn this on with my tv as a screensaver on my TV.  By screensaver I just mean something that shows images.It's just a picture, which changes every 3.5 minutes or so (it's fairly long-- my estimation may be completely off).All you're doing is changing your tv into a museum display showing various artwork.  It's worth $35 to have that experience, to me-- because I bought it on a whim.  If you expect this thing to do anything other than transmit lame 720P video to your tv and not be linked into your sound, have at it-- but I have to run stereo separately for best sound and frankly if I'm showing my friends a video?  I want it to be my full system, not just 720P on a 1080P display with TV sound.So I use it as a museum display in my home, and it works well that way and for me it was totally worth $35 because it just does that, as soon as I turn on my TV and turn it to HDMI4 which is where I have it located.  Works every time.", "verified": true, "helpfulness": "0/1", "author": "John Browning \"Beloved Console\""}, {"rating": 1.0, "review": "Not worth it.Wanted for screen mirroring but video and audio is unwatchable and choppy.OK for you tube and such but  big deal I can do that with my blu ray player and smart tv and my Tivo.So if you want it to watch web videos dont bother it not good.Cant cast from my phone work as its not on their list of phones it works with and the list of compatible phones is very shortThe only thing I will use it for is to play amazon cloud pictures on the tv so its good for viewing still images.", "verified": true, "helpfulness": "0/0", "author": "Alan H"}, {"rating": 5.0, "review": "Sweet.", "verified": true, "helpfulness": "0/0", "author": "Steve Klein"}, {"rating": 5.0, "review": "Works beautifully.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Evita\""}]