[{"rating": 5.0, "review": "Works great, love it.", "verified": true, "helpfulness": "0/0", "author": "Jewdisse"}, {"rating": 5.0, "review": "Instead of buying \"smart\" TVs that will be obsolete within a year or two, buy yourself a quality \"dumb\" TV and add a chromecast to the mix. Whether it's a chromecast, apple tv, fire tv, roku, or whatever new \"smartifying\" device is out there, you will be better served with one of these devices than otherwise.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 2.0, "review": "I still can't get my PC to work with this thing", "verified": true, "helpfulness": "0/0", "author": "Richard Turner"}, {"rating": 2.0, "review": "I got this because I was interested in the hype of the \"online\" TV and was hoping to save some dollars from the cable company.  Google's ads for this is really misleading.  From what I can tell, this simply hooks up to your network and allows your mobile device to broadcast to it.  You have to add the apps, such as Netflix, HBO2Go, Hulu, etc., to your device.  If you are like me, you may be running out of storage space on a mobile device to add such space hogging applications. My Samsung Smart TV puts the apps on its storage and works much faster than the Chromecast. Save your money to buy another device like Roku or Amazon's device.", "verified": true, "helpfulness": "0/1", "author": "TooClose2DC"}, {"rating": 3.0, "review": "Works good, just too bad the main thing I use if for is Youtubes on my tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"metoo\""}, {"rating": 5.0, "review": "I love that I'm able to watch YouTube, Crunchyroll, etc. on my TV for an affordable price! Setup is easy and it works great! I would highly recommend this to anyone!", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Chromecast is worth it.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 4.0, "review": "Would be nice if Amazon, CBS, and Showtime apps worked with it, but otherwise I'm very happy with the product.", "verified": false, "helpfulness": "0/0", "author": "kwaII"}, {"rating": 5.0, "review": "i love this product", "verified": true, "helpfulness": "0/0", "author": "jhoan juarez"}, {"rating": 3.0, "review": "Loses connection to my network pretty frequently", "verified": true, "helpfulness": "0/0", "author": "Michael Whitehurst"}]