[{"rating": 5.0, "review": "Awesome product the best I've ever used. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Jaz gyrl"}, {"rating": 5.0, "review": "Casi supera al Apple TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Have a dumb TV?  Turn it into a smart TV with this AMAZING adapter.  I have 2 including one on a smart TV that acts stupid often.  This thing just works and has TONS of support.THE ONLY thing currently wrong with the software is hotel support.  There is no way to get past the splash screen at most hotels to log in.  Considering how small this thing is, it is great to take on travel, but without being able to sign into the hotel WIFI, this because just a paper weight.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very nice product but sometime it stop works and I need reset...but it works fine.", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Duarte"}, {"rating": 5.0, "review": "It just keeps getting better! Easy to use. Apps keep being added to allow for more viewing sources.", "verified": true, "helpfulness": "0/0", "author": "The Grab Family"}, {"rating": 5.0, "review": "Great for android users, mirror everything from tablet or phone with minor lag, although lately there has been stopping or freezing of the image, but it is a quick fix.", "verified": true, "helpfulness": "0/0", "author": "Jesus A. Guardado"}, {"rating": 5.0, "review": "Love it. Works great with my tablets and phones. Even if you get disconnected just click on the \"cast\" icon within the app, the original device or another and you're good to go.Second Chromecast I've bought. Will be buying a third as a birthday present for my sister.", "verified": true, "helpfulness": "0/0", "author": "clayton"}, {"rating": 4.0, "review": "Chromecast is a perfect choice for someone who has an HDTV who just wants to watch youtube or netflix in their living room (or whereever else)If you have a smart TV, or a game console (xbox one, ps4, etc.) this is probably not the best choice.I experienced a handful of issues, but that's to be expected from such a small wireless device.", "verified": true, "helpfulness": "0/0", "author": "Joshua"}, {"rating": 5.0, "review": "Transformed my old LCD TV into a Smart TV for a cheap price , But definitely Great Streaming Device", "verified": true, "helpfulness": "0/0", "author": "migraineboy"}, {"rating": 5.0, "review": "If you already have a Prime Membership, this purchase is a no-brainer! Pretty much plug and play. It is so easy to use that my 2 1/2 year old can almost operate by herself.  What a great value as a companion to your Prime Membership.  Also very convenient to stream directly to your tv.  My daughter loves the ability to watch her favorite shows on the big screen on demand!", "verified": true, "helpfulness": "0/0", "author": "J. Sinnet"}]