[{"rating": 4.0, "review": "Initially it didn't work well with iPhone, couldn't tell if was the iPhone app or Netflix. My iPhone wouldn't discover Chromecast after I used another TV that has Wi-Fi and Netflix. Additionally, I would watch Netflix on my iPhone but when I tried to cast I would get a message on the TV that there was an error and the movie couldn't be displayed. Everything seemed to clear up after the SW update and a chromecast reset.", "verified": true, "helpfulness": "0/0", "author": "Scott Stroh"}, {"rating": 5.0, "review": "This thing is great. Only hold back is lack of software for it at the start, Netflix and Youtube. Will be great soon.", "verified": true, "helpfulness": "0/0", "author": "W.S. McEwen"}, {"rating": 3.0, "review": "works with youtube, netflix and some of chrome casting. I wish it could have casted anything on my desktop/laptop/ipad/tablet/mobile phone", "verified": true, "helpfulness": "0/0", "author": "walidshaari@yahoo.com"}, {"rating": 4.0, "review": "As soon as more apps use it, it will get my vote for product of the year.  Get if if you can.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jim M\""}, {"rating": 2.0, "review": "Ok, we have one TV that has the internet connection with a number of apps, another TV with a Roku Box and now we got Chromecast from Google. Very disappointed, limited functionality, screen freezes when using Google Chrome as a browser, not much use for it. Just get yourself a Roku box if you don't have a smart TV (or even when you do).", "verified": true, "helpfulness": "0/0", "author": "T. Albers"}, {"rating": 5.0, "review": "Love my Chromecast.  When my Android PC stick on another TV died, I purchased a second Chromecast for it instead of a Roku.  While Roku currently has more \"channels\" at the moment, I expect that to change soon.  And with KoushCast on the horizon and the ability to cast *anything* from an Android running CyanogenMod, the capabilities of this little device will not be limited to approved \"channels\" like the Roku.", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 4.0, "review": "Works, does everything it is supposed to do with the few apps available.Bought it with the idea that future development(apps)  will really open up a lot of capability for the device.I like the idea that it could offer much more than the limited channel selection of the Apple TV.  Apple locks down their products too much.I would given 5 stars if there were more apps.", "verified": true, "helpfulness": "0/0", "author": "Centex"}, {"rating": 4.0, "review": "Works like a charm.. It would have been even more amazing if it supported more apps. MaxGo should be the next app it supports.", "verified": true, "helpfulness": "0/0", "author": "Jah Mangy"}, {"rating": 5.0, "review": "I've got one hooked up to my projector and haven't had to use my AppleTV or my PS3 for watching content since, which is a very welcome simplification.I have to more hooked up to HDMI audio extractors for wireless music playback in two different locations in my house.  Would be nice if the Chromecast had an audio out as well, but this setup works fine.There have been a few little UI glitches, but I'm sure they'll iron those out with time.Overall, I'm very happy with Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Bryan Yeung"}, {"rating": 1.0, "review": "Sure YouTube works on it, but casting from the compute is a lost cause, too much latency.  I even replaced my router with a state of the art high speed AC 1750 router and when I try to cast Amazon Prime videos from Chrome there is just too much latency.", "verified": true, "helpfulness": "6/9", "author": "Kirbinster"}]