[{"rating": 5.0, "review": "Nice for streaming", "verified": true, "helpfulness": "0/0", "author": "Alfredo A. Menendez \"Al\""}, {"rating": 4.0, "review": "it's not possible to stream Amazon Prime which is unfortunate. everything else works well", "verified": false, "helpfulness": "0/0", "author": "Kathleen Broderick"}, {"rating": 5.0, "review": "Had to her use to the way it works! But it's great! And well worth the price! I totally recommend this product!", "verified": true, "helpfulness": "0/0", "author": "Seth A. Eubanks \"redValentine\""}, {"rating": 4.0, "review": "I bought this because I often go over to friend's houses and they don't have some movie that I want to show them.  It sounded great that it would be mobile and I could just plug it in wherever I go.In practice it does most of these things, but requires that I setup the device every time I change locations - because the Wifi network is different.  I understand this, but I wish that the setup was less clunky.One perk is that once streaming starts you can turn off your phone or the device you're streaming from in a lot of cases.  (Specifically, I use Plex and once I start the movie the Chromecast talks directly to that service - my phone only serves to initiate the connection.)", "verified": true, "helpfulness": "0/0", "author": "Justin O"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Mary Nardone"}, {"rating": 5.0, "review": "Loved this device.......", "verified": true, "helpfulness": "0/0", "author": "Aj"}, {"rating": 3.0, "review": "It only do the AirPlay function in AppleTV, you can push the videos from your smart phone or tablet to the monitor...", "verified": true, "helpfulness": "0/0", "author": "Waheed O. Busaeed \"Waheed\""}, {"rating": 5.0, "review": "I cut the chord from cable ... so I REALLY rely on good quality streaming devices. I used to exclusively use Apple products - but grew tired of their closed network. So here is my review on ChromeCast.Chromecast is the best value on the market but ONLY if you have an Android phone. If you have an iPhone - move on. This is not for you. Apple has a way of making Chromecast suffer and work terribly. This is the reason I dropped Apple, anyway. They are crooked.If you have a Droid phone ... then Chromecast is VERY affordable and works amazing over wifi. I used to have to hookup my Apple TV directly wired to get a decent show ... but Chromecast somehow streams without any lags time AT ALL.  I have not had a single issue in over 2 years.  This is my 3rd Chromecast.  I have also had Roku, VizioTV, Apple TV, FireTV ... but I use Chromecast the most ... My next best is FireTV ... Amazon is awesome, obviously ... and they made an amazing device ... but it lacks HBO Go and all that jazz ... so we use Chromecast to supplement where FireTV is lacking.  Between Chromecast and FireTV ... we are cable free. Never going back.This is a great buy. Don't hesitate.", "verified": true, "helpfulness": "0/0", "author": "Confirmed Buyer Review \"S.M. Saunders\""}, {"rating": 5.0, "review": "Great device, works great on the phone!  Need a better app for using on the laptop.", "verified": true, "helpfulness": "0/0", "author": "christopher s childress"}, {"rating": 5.0, "review": "I wanted one since it was released", "verified": true, "helpfulness": "0/0", "author": "A. Yar"}]