[{"rating": 5.0, "review": "I purchased my fire tv from Amazon so it was already linked to my account when it arrived. I am a senior citizen so my tech knowledge is very limited. lol  I had no problem connecting this up and linking to my wi fi. I actually amazed myself that I could do this; I had the neighbor kid on standby in case I had a problem ; only needed him to show me how to play one of the free games.  I purchased this fire tv because my cable/tv bill had become out of sight financially. This fire tv along with Amazon Prime will give my husband and I many hours of entertainment. As long as you have a good internet connection  I would highly recommend this fire tv.", "verified": true, "helpfulness": "0/0", "author": "susan shaheen"}, {"rating": 3.0, "review": "It's ok just need to add the walking dead to prime movies", "verified": true, "helpfulness": "0/0", "author": "Leo H Johnson"}, {"rating": 5.0, "review": "Just an excellent way to watch movies,tv,apps and games.very nice design,very smooth quick and responsive with no lag.i personally like apple products but I find Amazon products just as well made and easy to use.love it now can't wait for Amazon echo.and maybe a game controller for the fire TV to play games.", "verified": true, "helpfulness": "0/0", "author": "Brenda Payton"}, {"rating": 5.0, "review": "I love having this product. I can watch whatever I want, on whatever t.v., as long as there is a WiFi access. We have even taken it with us when we've gone to stay at hotels, and on visits to relatives.", "verified": true, "helpfulness": "0/0", "author": "M. Gwaltney"}, {"rating": 5.0, "review": "Lets watch shows and can look for kids items away from adults. Has the learning channels too.", "verified": true, "helpfulness": "0/0", "author": "Patricia J Zemany"}, {"rating": 4.0, "review": "Easy to use....I love it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Very good for the money. I also have an Apple TV, and by comparison, the Fire TV is much easier to use. This is mainly due to the remote.  I like the ability to add apps and watch them on TV, but I do think the Apple TV's screen presentation and the lettering is more pleasing to the eye, especially with smaller fonts. I have cut my cable tier down to local stations only and the Fire TV has made life much easier. Here are some of my favorite apps: Frequency, Watchup, Smithsonian Channel, the HISTORY Channel, and SlingTV.Pros: 1. You can download TV apps like ABC and FOX from the Amazon and watch them directly on TV without having to mirror them from your cell phone, tablet or PC.2. The interface is easy to use.3. The remote is very easy to use. The voice search feature actually worked as advertisedCons:1. Many of the fonts on the screen are too small and I found myself having to get out of my seat and walk to the TV to read the information on the screen, something I never had to with Apple TV.2. There needs to be an app folder or some way to organize download apps into categories and minimize screen clutter.In spite of those are two minor issues, I will not deduct a star because it was on sale for $84.00. You get what you pay for and need to be realistic with expectations.", "verified": true, "helpfulness": "0/0", "author": "VES"}, {"rating": 1.0, "review": "I cannot believe it was not suggested (or pointed out it's necessary) that I purchase HDMI cable to go with Fire TV!!  The packaging says \"effortless setup and use - get started in minutes\" then the first direction refers to a cable (not included)!?!?!?!  Couldn't I have stayed with the cable company if I wanted to get jerked around and disappointed like this?", "verified": true, "helpfulness": "2/8", "author": "Don Murphy"}, {"rating": 4.0, "review": "This is by and far the best streaming device on the market as compared to Apple TV, Google Chrome and Roku. The interface and menu in particular is very eye appealing. The only complaint I have so far is the Hulu app stays on the last watched show and the menus don't update. So the featured shows and movies are from 2 weeks ago. Whereas the Roku and PS3 we use to stream services updates on each use.", "verified": true, "helpfulness": "0/0", "author": "T"}, {"rating": 5.0, "review": "Easy hook up works fine, my Roku has more features.", "verified": true, "helpfulness": "0/0", "author": "William Carlson \"Bill C.\""}]