[{"rating": 3.0, "review": "I like a lot of the features. I like it a lot more than the Roku I had. Only issue I have with it is the picture always seems to freeze at least once per show or movie I watch on it. When the picture freezes, the sound still comes out. Then next I know the picture catching up to the sound and I miss entire scenes from my shows and movies. Kinda irritating especially when I try to rewind it and the issue repeats. I check for software updates at least once a week in hopes one will resolve this issue. Have also searched blogs online to see if others have the same issues, but haven't been fortunate in doing so.", "verified": true, "helpfulness": "1/1", "author": "Joshua Lang"}, {"rating": 5.0, "review": "With Amazon Prime video content and Hulu built in this is going to take the place of my satalitte system.", "verified": true, "helpfulness": "0/1", "author": "rcw"}, {"rating": 4.0, "review": "I like the product better than I had expected, howeverI think the amazon movie rental pricing is high.The voice search seems to work well.", "verified": true, "helpfulness": "1/1", "author": "Robert Williams"}, {"rating": 5.0, "review": "This is very easy to use.  Cost is right.  My son lives the games.  Movies selection great and easy to hook up.", "verified": true, "helpfulness": "1/1", "author": "Cindy Wilson"}, {"rating": 5.0, "review": "all i can say is took me 5 minutes to set all up including the apps that i like best product so far  no regrets", "verified": true, "helpfulness": "0/1", "author": "T-L-T"}, {"rating": 4.0, "review": "not enough apps  what is the holdup?  live stream  a favorite  of mine on roku  thanks  andya little larger remote would be good also  easy  to handle if bigger  for senior citizens", "verified": true, "helpfulness": "0/0", "author": "Andrew Merlino \"andy merlino\""}, {"rating": 2.0, "review": "Need more apps  and need to take off the block for amazon video in other countries that way more people can buy service.", "verified": true, "helpfulness": "3/6", "author": "Jose Pablo Paredes Avila"}, {"rating": 4.0, "review": "Set up was very easy, immediately picked up signal from router, picture very clear, and voice search is fun.  Voice search seems to only work with Prime, and not with my free month with Netflix.  Will probably stick with Netflix as larger selection of movies and shows, and all free so far.", "verified": true, "helpfulness": "1/1", "author": "cuzzzzz"}, {"rating": 1.0, "review": "works just like roku, apple tv, chromecast.  pretty much the same \"channels\" on all of them (or else you can workaround with each system).  however, you CANNOT disable various parts of your amazon account.  thus, all of your photos will automatically be synced.  same with videos.  i don't understand how this is not opt-in; a true UI/UX miss on Amazon's part.  until a user can control their privacy settings and enable/disable the various parts of their amazon account/cloud drive (ala apple tv, roku), i would NOT recommend buying this product.", "verified": true, "helpfulness": "12/19", "author": "MD"}, {"rating": 2.0, "review": "I was looking into this to replace cable, but it falls far short. Perhaps if there was a video on all of the navigation needed to get full use of the product? That would be helpful.", "verified": true, "helpfulness": "1/7", "author": "Tom Goldtrap"}]