[{"rating": 5.0, "review": "It's really nice and handy to have! SUPER easy to set up! I use it for Netflix the most but I'm sure there's many more uses", "verified": true, "helpfulness": "0/0", "author": "Amanda Trosky"}, {"rating": 4.0, "review": "Excelent product in combination with youtube and Netflix.  Great price. I'm waiting for more third parties apps to enjoy the product", "verified": true, "helpfulness": "0/0", "author": "David Guzman"}, {"rating": 4.0, "review": "This was fairly easy to install into my TV: be forewarned that you also have to plug it directly into a power source.  FYI: Do your research, you can only stream from certain providers ie Hulu, Netflix, Pandora and a few others - but I believe the list is growing.  This device does not enable unlimited streaming from every provider, but it works very well for a fairly low price.  If you are a casual TV/internet streaming viewer, this is a nice-to-have-but-not-critical tech accessory.", "verified": true, "helpfulness": "0/0", "author": "loki"}, {"rating": 5.0, "review": "I really love the Chromecast.  I was disappointed that it was limited to just a few streaming apps, until I found an android app called Localcast, that let me stream all my downloaded movies, music and tv shows also.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Carr \"Tollice Officer\""}, {"rating": 5.0, "review": "This was a gift and my brother was so happy using it. We will pay another $5-10, please give remote also. :)", "verified": true, "helpfulness": "0/0", "author": "Hemanth P"}, {"rating": 5.0, "review": "Just added to both TV's & this product makes it great to transfer from Phone or Laptop to your big screen.", "verified": true, "helpfulness": "0/0", "author": "Luis Gonzalez"}, {"rating": 5.0, "review": "Have been using it with HBO Go. It is very simple yet very functional. I see that multiple apps are now adding chromecast: Tinycam, tunein and PocketCast and many more by the day!", "verified": true, "helpfulness": "0/0", "author": "EastSide"}, {"rating": 5.0, "review": "I bought a Google Chromecast just to try it and see how and if it worked as advertised. Since it worked so well, I decided I would three more for my non-smart TVs however, Amazon places a limit of one (1) per customer for this item. Being that I would have to re-order this item individually for each TV, plus pay the individual shipping and handling as well, I decided to check eBay. Wow! Ebay did not have a limit, the items were brand new, and I recieved all three I needed at a lower cost, no shipping, and all in one box. I can understand if I were ordering an enormous ammount, but that was not the case. Amazon or whoever set this ordering limit, needs to step it up with it and use some common sense sometimes!!!", "verified": true, "helpfulness": "0/0", "author": "tony1970"}, {"rating": 5.0, "review": "I was amazed how easy it was to install and receive the end results I was looking for. Since I only have one TV I was very satisfied with the product", "verified": true, "helpfulness": "0/0", "author": "armpou"}, {"rating": 5.0, "review": "Was easy to install.  The streaming is seamless and crystal clear. youtube casting is great too.  It can do a lot when you learn how to use all of the features. I would recommend it to a friend.  Do know it cast tabs - not the desk top. With a few tricks you can overcome that limitation.", "verified": true, "helpfulness": "0/0", "author": "Dee Tee"}]