[{"rating": 3.0, "review": "bien", "verified": true, "helpfulness": "0/0", "author": "Emilio Gavidia"}, {"rating": 5.0, "review": "Good for travel when staying in hotel rooms", "verified": true, "helpfulness": "0/0", "author": "Jess Siegrist"}, {"rating": 5.0, "review": "Excellent for Apple users download Tvcast app & really put it to use", "verified": false, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "CHROMECAST ... everywhere, this device is amazing, i have one for each TV and my HDMI projector whee ;)", "verified": true, "helpfulness": "0/0", "author": "Jeff Bond \"gadget\""}, {"rating": 5.0, "review": "This thing. Wow. Very easy to install, very easy to use. Casts Netflix like a pro from my iPad to the t.v. Well worth the money and then some!", "verified": true, "helpfulness": "0/0", "author": "jj2sassy4u"}, {"rating": 4.0, "review": "A great and simple product. You just plug it in and choose the wifi and you're set! I've had it for about 2-3 years now and it still operates consistently. Although I need to update youtube on my hand held devices like my phone because it has had some problems lately. Other than a few software glitches I think it is a great all around product. You CANNOT surf the web with this device. You can however stream youtube and netflix (netflix can only be streamed from your Android device, Apple mobile device, or by visiting the Netflix website in your Chrome browser.", "verified": true, "helpfulness": "0/0", "author": "John Doe"}, {"rating": 5.0, "review": "Great product.  Turned my house into a entertainment center for family and friends.  Stream almost anything from any device.", "verified": true, "helpfulness": "0/0", "author": "who?"}, {"rating": 5.0, "review": "INTRODUCTION :The Chromecast is the first device like this I had seen. Ever since I first saw this device, I now see them everywhere. The Roku, Amazon FireTV...et cetera. This is the one I purchased because it was the least expensive out of the others, with pretty much the same features. And, it's by Google. That's reason enough.Here is my honest opinion on the Google Chromecast.PHYSICAL BUILD :Originally, I thought there was a battery in this device. I thought you just charged it and plug it in and it would last a couple days. But I was wrong, and that's when I realized exactly why the MicroUSB cord is so long. The device and box is very attractive, as well as the charging bank and the cable. I really like how the wall plug-in is on the side instead of facing out, which allows for much easier placement in plugs that are not so easy to access.SOFTWARE / HARDWARE :The strangest thing that I had found, and had initially blown my mind, was the fact that this device is not Bluetooth or ... anything. It's connected via Wi-Fi...which when I bought this product, did not know how this worked. I have a basic understanding now, but nothing in terms of explaining how this process works.The software is fine. I mean it works exactly how it should work. It does have some hiccups and whatnot...which is irritating at times, but for the most part it works fine. I would have given it 3 or 4 stars because you can't display your tablet display on the Chromecast.And then I realized, oh, you can. And therefore I give this product 5 stars, because I learned how to achieve this.CONCLUSION :This device comes with the Chromecast itself, an HDMI extender cable that is about 5 inches, a MicroUSB cable, and a wall charger. This is plenty for the price, and honestly I had thought it was a steal. And I still feel this way about this product. For the great price and features, this product is worth more than what they are asking. If you watch a lot of Netflix, YouTube, Hulu, or if you listen to a lot of music, or if you just want to display your tablet onto your TV at a cheap price, then this product is definitely for you.", "verified": false, "helpfulness": "0/0", "author": "Damion"}, {"rating": 2.0, "review": "This does not work on tablets, only works on PC and laptops a with the latest software according to Tech support.", "verified": true, "helpfulness": "0/0", "author": "Frank M"}, {"rating": 5.0, "review": "Great product, I love it!", "verified": true, "helpfulness": "0/0", "author": "Joel Chibota"}]