[{"rating": 5.0, "review": "Works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Ketch"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Pingocho"}, {"rating": 5.0, "review": "My son was very happy to get this as a Christmas gift and what a great price", "verified": true, "helpfulness": "0/0", "author": "sandra gordon"}, {"rating": 5.0, "review": "Simple to setup, Easy to use.If you have problems with connectivity, reload your browser page, or restart your browser to get it to recognize the chromecast. I had this problem if i turned on my tv (which boots up the chromecast) when my browser was already open.Improvements? Only wish it took advantage of chrome extensions like addblock plus", "verified": true, "helpfulness": "0/0", "author": "Charles  Wee"}, {"rating": 1.0, "review": "Worst piece of equipment purchased ever. Don't waste your money. Took hours to have it connect to my wifi network. Even after connecting multiple times it stops working later again. Real piece of crap.", "verified": true, "helpfulness": "0/2", "author": "maverick"}, {"rating": 4.0, "review": "Awesome when it works but I've been having trouble lately connecting it to my wifi", "verified": true, "helpfulness": "0/0", "author": "Trent Van Gorp"}, {"rating": 5.0, "review": "I received my Google Chromecast and promptly connected it to my television. Set up was easy and I love that you can name each Chromecast (Living Room, Bedroom, Theater Room, etc). I've used Chromecast through my laptop and by downloading the app to my cell phone and tablet to stream netflix and have not had any problems with it.", "verified": true, "helpfulness": "0/0", "author": "Bethany"}, {"rating": 1.0, "review": "Doesn't work on a hard wired desktop. Wasted hours trying to get it to work -- countless forums and contacted support several times. They were good, but could not help.also must use Google chrome, and can only cast stuff that is in Google Chrome window.But biggest gripe is I can't play from my wired desktop, the purpose I got it. Apparently it's been that way for over a year, and they don't want to fix it from the looks of it.", "verified": true, "helpfulness": "0/3", "author": "Matthew Anderson"}, {"rating": 5.0, "review": "I Love the Chromecast. The only thinkg that is wrong with it, would have to be that my one year old son snapped it in two at the HDMI part so it is BROKEN. Other than that its awesome.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "I had an inexplicable amount of trouble trying to get this damned device to work, but to no avail, no call support, internet FAQ, nor 3rd party company could get the device to work. Before you buy, check your router and make sure that it is 2.4 Ghz because that's all that it will comply with!!! I just got it yesterday and it's already back in its box ready to be returned.", "verified": true, "helpfulness": "0/3", "author": "Andre"}]