[{"rating": 5.0, "review": "Great/Cheap way to get Netflix on to your TV. A very great purchase for the Pandora app as well.", "verified": true, "helpfulness": "0/0", "author": "James Fox"}, {"rating": 4.0, "review": "Meh.", "verified": false, "helpfulness": "0/0", "author": "Michael Boggs"}, {"rating": 5.0, "review": "Love my ChromeCast.  Much nicer picture on the tv than my monitor.  Works great for most everything.  Only thing i wish that it could do is cast something not in a browser (like files from my computer).", "verified": true, "helpfulness": "0/0", "author": "Zach \"I am a huge Dresden Files fan.\""}, {"rating": 5.0, "review": "Had the Chromecast running for two days and I can say without a doubt that this is the best 35 bucks I've spent in a long time. I love this device and the way it just enhances the apps I already had installed on my iPhone. Installation is super simple and using it is a breeze. If your thinking of getting one, just go ahead and do it. You won't regret it.", "verified": true, "helpfulness": "0/0", "author": "Brian Reese"}, {"rating": 3.0, "review": "It can't project every thing, just youtube and a few others.", "verified": true, "helpfulness": "0/0", "author": "Linlin Li"}, {"rating": 4.0, "review": "Good product. Part of cutting the cord.", "verified": true, "helpfulness": "0/0", "author": "Pastor GR"}, {"rating": 1.0, "review": "The item arrived used, this was not a new product. This can be confirmed with the lack of original packaging, there was a used band-aid inside of the box that this came in, and the device was trying to search for its previous owner's WIFI Network.", "verified": true, "helpfulness": "1/1", "author": "Benjamin Perkins"}, {"rating": 5.0, "review": "I love this thing. It helps me get my work done at home by giving me a big screen to review my work! It's great!", "verified": true, "helpfulness": "0/0", "author": "G. Gerard \"onceaneducator\""}, {"rating": 5.0, "review": "Had another chromecast but my daughter took it to her room, so this is our second. Wonderful tech does exactly what it's supposed to for a great price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "is wonderful but i need to learn more, but you can see a lot of movies there", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]