[{"rating": 4.0, "review": "I've had this for quite a while now, it's in my home office so is on most of the day as a distraction from the noise outside.  I do like the Prime content, adore the new programming and am ecstatic there are no commercials.  The voice search is a huge plus, much better than trying to type with a little remote, though sometimes it struggles with my accent which can be frustrating, I'm from UK.Netflix keeps logging out, which is extremely annoying and makes one wonder if it's almost deliberate - it doesn't do that on any other device I have (and I have many).  You do need your Netflix or similar account unless you are willing to pay for shows like Desperate Housewives and any popular movie, but to be fair, that is no different to Apple TV.  I've never tried Roku or others so can't compare to those.I must state, in all fairness, that this is a total Apple household and I am a huge Apple fan (being in IT, not totally surprising).  Desktop, laptop, phones and TV all Apple, so I love the way I can watch my content anywhere anytime with AirPlay.  Amazon is catching up fast and the iPad app let's you go mobile with your Amazon account, though you cannot purchase content through it - I switch to the Amazon app to get around that.Where it falls down for me is the app selection, or more the lack of choices.  My favorite news app is Skynews which streams live for free with no ads, fantastic but not available on Fire TV, yet anyway and I did just check.  Also I can watch Amazon through my Apple TV using AirPlay but cannot watch Apple content through the Fire TV.  Though again, being fair, I haven't gone deeply into any tips/help to see if there is a way to do it.Basically, if I could only have one, it would still be Apple but I am interested enough to watch the Fire develop to see if it gets better as it gets more popular.  Cable is dead to me, I refuse to pay exorbitant fees to watch commercials, 'coming up' spoilers and 'previously on' after every break which leaves about 20 mins of actual viewing from an average hours worth of viewing. Also my cable company does not support the 'to go' channels, so those apps are useless to me on either box.If you are an Android household, I would recommend getting this, kick cable to the curb, there's plenty to watch here.", "verified": true, "helpfulness": "1/1", "author": "Britchick"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "Canguro13"}, {"rating": 4.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "KYOUNG MIN, JUNG"}, {"rating": 5.0, "review": "So far, so very good. Dead simple to set up and streams so much faster and smoother than my \"smart\" Blu Ray player ever did. I live in a sparsely populated area with a less than speedy DSL connection. Half the time I fired up Netflix or similar app I got a \"connection failed\" notice on my TV screen. Since I've had the Fire TV hooked up, I've had perfectly glitch free viewing of 1080p streaming video. And the voice search really works exactly as advertised (at least for Amazon content). If they can work that voice search function into the rest of the apps available for the Fire TV (and it continues to work this well), I might just ditch DirecTV for good. Well done.", "verified": true, "helpfulness": "0/0", "author": "JRM"}, {"rating": 5.0, "review": "Easy to set up, love the voice control remote, doesn't take up any room on the shelf and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Mac"}, {"rating": 5.0, "review": "It works pretty well, specially for Youtube and speech recognition.", "verified": true, "helpfulness": "0/0", "author": "Jose"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Thomas Skipper"}, {"rating": 5.0, "review": "Works very well.  I was surprised that it worked so well on my home WIFI.  I had planned to run ethernet cable, but it doesn't seem to be required.  Would like to see the ability to power it off though.", "verified": true, "helpfulness": "0/0", "author": "JLHSCTX"}, {"rating": 5.0, "review": "Easy set up, works great, crisp and clear view. Purchased 2 and enjoy them very much!", "verified": true, "helpfulness": "0/0", "author": "Alex & Sabrina Luna"}, {"rating": 2.0, "review": "Don't work well, keeps reloading over and over.", "verified": true, "helpfulness": "0/1", "author": "Johnny H. Walters"}]