[{"rating": 5.0, "review": "quick delivery and just what I wanted thanks.", "verified": true, "helpfulness": "0/0", "author": "Michelle Karr"}, {"rating": 3.0, "review": "I expected to like this more than I did. Instead I find it kind of a hassle to use. I have a very strong internet connection and no trouble at all with any of the internet connected devices in my home. The Chromecast does a pretty poor job of playing videos through screen cast and about 1/2 of the time the video will freeze up and the only way to fix it is to disconnect the Chromecast and restart it.", "verified": true, "helpfulness": "0/0", "author": "C. White \"Gaming Ma\""}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Prabhakar Annadurai"}, {"rating": 5.0, "review": "Great deal all around", "verified": true, "helpfulness": "0/0", "author": "Brian Winterstein"}, {"rating": 4.0, "review": "Chromecast is an excellent product for anybody who does a lot of video streaming and does not have a roku, fire stick, apple TV, etc.  The Chromecast does not really offer anything new that those other products do not, so if you already have something else I would not recommend purchasing this as well.To setup, I found the Chromecast fairly straightforward.  You simply plug it in to the HDMI port of your TV (I use the power cable as well), download the Chromecast app to your phone, and connect the Chromecast to your WiFi.  Once the device is connected to your network, it can be accessed by anything else on the same network, whether it's a phone, tablet, laptop, etc.  I have used the device on both an iPhone and an Android and it has worked well on both.In terms of streaming, I will say that I have had great success with the phone, but the product has been almost unusable watching videos on a laptop.  If I am streaming a movie on my laptop and try to \"cast\" the page to the TV, the quality is very poor and choppy.  For this reason, I stick to using apps on my phone.  The easiest apps I have used to stream are Netflix, Hulu, Youtube, and HBOGO.  These apps simply have a \"cast\" symbol on the top right of the screen and once clicked, will easily connect the device.  Then, you simply press play on your phone and the movie will begin streaming to the TV.One thing that's great about this device is you can minimize the screen on your phone and do other things such as text or browse the internet, and the movie will continue streaming uninterrupted to the TV.  The one major issue I have (and this may be more the fault of Amazon) is that the Amazon instant video app does not have Chromecast support, meaning there is no casting button on the app.  Luckily there is currently a workaround, where you can cast your entire phone screen to the TV and then play the video on your phone, but this means you must keep the video up on your phone at all times.  In addition, I do not believe this is yet supported for Apple iOS.To summarize:Pros:- Easy to setup- Works great on phone- For supported apps, one click streaming- Able to use phone for other purposes while streamingCons:- Poor quality for laptop casting- No Amazon instant watch support", "verified": false, "helpfulness": "0/0", "author": "Alex Illuzzi"}, {"rating": 5.0, "review": "Ive been using this thing for a year. Once you figure out how to set it up and use it you will not regret it. We ditched cable and all the cords. You can easily stream Netflix, YouTube, or other apps very easily. Your streaming device acts as a remote. Great for creating a queue on YouTube of songs for parties or hanging out.", "verified": true, "helpfulness": "0/0", "author": "Garrett Wolcott"}, {"rating": 3.0, "review": "was not covered my expectations at all ..", "verified": true, "helpfulness": "0/0", "author": "Johan J."}, {"rating": 5.0, "review": "Excellent little gadget with the right apps you can stream almost anything to your big screen tv, the changing background is a very nice feature and the size is perfect.", "verified": true, "helpfulness": "0/0", "author": "RevSistemsTec"}, {"rating": 5.0, "review": "Now I can watch my Prime videos on my big screen.", "verified": true, "helpfulness": "0/0", "author": "James Helton"}, {"rating": 5.0, "review": "When you buy a Chromecast you can't go wrong. Great quality and a really great price. This is my second Chromecast  (the first one still working as new). You need WiFi and a smartphone, tablet or pc to make it work but... who doesn't have one of these?", "verified": true, "helpfulness": "0/0", "author": "Abel Bortolotti"}]