[{"rating": 4.0, "review": "Needs DNLA support like \"Roku's\" media player channel without the need of 3rd party applications or having a \"dedicated PC\". Nas storage should be able to stream to any device that is on the same network, whether it be wired and or wireless.For example, before using Chromecast; I could still stream from YouTube and other applications to the roku.Nvidia shield Android 5.0 is compatible out of the box.", "verified": true, "helpfulness": "0/1", "author": "B.Harvest \"Your Frugal and Average Joe.\""}, {"rating": 5.0, "review": "Great for watching movies, videos, and reviewing pictures. On time delivery.", "verified": true, "helpfulness": "0/1", "author": "Gary McCluskey"}, {"rating": 5.0, "review": "Well priced for what it does.Jana", "verified": false, "helpfulness": "0/1", "author": "Christina M. Johnson \"daughternubr2\""}, {"rating": 5.0, "review": "Love this SO much I bought two! Seriously better than the Apple TV.", "verified": true, "helpfulness": "0/1", "author": "SuzieHomemaker"}, {"rating": 5.0, "review": "Works perfectly.  Useful tool. Fun toy to have.", "verified": true, "helpfulness": "0/1", "author": "Brennen Robert Sietsema"}, {"rating": 5.0, "review": "One of the things I like best about the Chromecast is the personalized background feature. Link to your pictures on Google Drive and see pics you forgot you ever took.", "verified": true, "helpfulness": "0/0", "author": "john watters"}, {"rating": 5.0, "review": "Excellent no problems at all Highly recommend. I wish it was a little bit faster though, but I am pretty sure thats just technology and my internet speed. I did notice the metal tip got bent a few times when i tripped over my cord however i think thats just the plastic housing around it because i quickly bent it back in place no problem and still haven't had any issues since. I would recommend this device for sure. And screen casting is awesome! It also looks nice too and not cheap at all. I do wish it came with an option for a smaller cord though. because the micro cable it comes with is huge and is the reason why i tripped over it several times. you can buy a perfectly designed one using this link. http://www.amazon.com/dp/B00NDOIZ2K/ref=wl_it_dp_o_pC_nS_ttl?_encoding=UTF8&colid;=2KL4HP8WFUEZD&coliid;=IZKOLROAQD5Y3", "verified": true, "helpfulness": "0/0", "author": "Justin Saunders"}, {"rating": 5.0, "review": "A Cool thing to have!", "verified": true, "helpfulness": "0/2", "author": "Piyush"}, {"rating": 5.0, "review": "I like this device better than my apple tv. well worth the $35", "verified": true, "helpfulness": "0/1", "author": "Vanessa Anderson"}, {"rating": 1.0, "review": "I spent hours researching why I could not get this device to recognize my wireless network.  I have multiple wireless devices working all at the same time, without any problem.  After a frustrating few hours I packed it up and sent it back.", "verified": true, "helpfulness": "3/3", "author": "Loren"}]