[{"rating": 3.0, "review": "Does the job decently for the price. If you use apps like youtube or other optimized apps, it works great. But if you're on a computer/android and screen share you will notice the pixelation. Still, does a good job for the price.", "verified": true, "helpfulness": "0/0", "author": "lime"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Jax'n Kozmic"}, {"rating": 5.0, "review": "Plays any and all videos from your phone or tablet rightonto your tv! Netflix, Disney, Googlemovies and tv and anything else you want to watch on your hi-def television!", "verified": true, "helpfulness": "0/0", "author": "Imageracin"}, {"rating": 5.0, "review": "Fist time use, great range and picture", "verified": true, "helpfulness": "0/0", "author": "Ernesto Carrillo"}, {"rating": 4.0, "review": "I own 3 if these so far. Only thing it needs is greater app support. But so far it's fantastic at what it does.", "verified": true, "helpfulness": "0/0", "author": "Luis Quinones"}, {"rating": 5.0, "review": "I think this is a good item. I have three. It extends my TV coverage.", "verified": true, "helpfulness": "0/0", "author": "Donald Nolen"}, {"rating": 4.0, "review": "I love it.  I am able to play music, videos. movies from my mobile phone and laptops.  I had to download other apps to be able to display my laptop screen, but, it works great.  I wish Google made native app and allow sharing of laptop and mobile phone; instead, of using 3rd party apps.  Giving 4 star instead of 5 star because lack of full support by native app and I had to download other apps.", "verified": true, "helpfulness": "0/0", "author": "S. Patel"}, {"rating": 5.0, "review": "I love this device. It made my (regular) TV smarter than any \"Smart TV\" in the market and it was only ~ USD $30 (really cheap). Also, it's so small that you really forget it's there.Things I use that are Chromecast-friendly:* Netflix* Plex (oh yeah!)* YoutubeI have everything I could possible want to watch on my TV thanks to this device.", "verified": true, "helpfulness": "0/0", "author": "Juan Ignacio Saba"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "DB \"Debbie\""}, {"rating": 5.0, "review": "Was delivered quality very happy", "verified": true, "helpfulness": "0/0", "author": "Chuck miller"}]