[{"rating": 1.0, "review": "It hasn't worked since I received it no wifi is strong enough its not worth the money I spent and very frustrated.", "verified": true, "helpfulness": "1/4", "author": "Craig Thompson"}, {"rating": 5.0, "review": "It works great!  I wish there were more apps for it.  I wish Amazon Prime would be available on it.  Netflix is excellent though.", "verified": true, "helpfulness": "0/0", "author": "valerie w."}, {"rating": 5.0, "review": "Works as told ... simple way to make a \"dumb TV\" a SMART TV....I would highly recommend this dongle great price for work preformed.", "verified": true, "helpfulness": "0/0", "author": "Alessandro Tocco"}, {"rating": 5.0, "review": "use it with an older linksys 54G home router, comoutcast service. The picture quality of media pulled from eg Youtube is surprisingly good. Did not experience buffering issues. Very happy", "verified": true, "helpfulness": "0/0", "author": "Hans Richtig \"Herzog\""}, {"rating": 5.0, "review": "I've bought the android mini pc, but I've regret the rate of processing.This gadget is best of all comparing to apple TV and ROKU.Try it and you don't regret a thing.", "verified": true, "helpfulness": "1/1", "author": "Carlos A. de Souza"}, {"rating": 5.0, "review": "Works great Just as advertised easy to set up and use when I travel in hotels all the time.  If you have an iPhone use real player to play your movies.", "verified": true, "helpfulness": "0/0", "author": "Andrew Daar"}, {"rating": 5.0, "review": "Trying to search for a Netflix movie or Youtube stream using your Blu Ray player's remote is a frustrating experience that has one wishing one could use a keyboard. With Chromecast, it's possible. I use my laptop to find the Netflix movie or Youtube stream I want to watch, start it running, click on the Chromecast icon built into the Netflix or Youtube tab or window, and the Chromecast device takes over. Movies and streams run at the same quality had you used the clunky remote to find and start them.This is the only way I run Netflix and Youtube now. And in case you're wondering, you can go on and open another window and check email, search the web, or do anything else and your movie will keep on running.I don't use Hulu and I think whether videos from other sources run well is probably hit and miss. Read other reviews for more info on that aspect.A real keyboard is much better than a virtual keyboard and a remote.I had a little trouble getting set up and running, but I got very competent help from Amazon telephone customer service  and soon had things going. I probably missed something in the documentation.$35 well spent as far as I'm concerned.", "verified": true, "helpfulness": "1/1", "author": "UnseenWorld"}, {"rating": 4.0, "review": "Pretty easy to set up. After initial set up, get other ipad, iphone, mac or PC, or tablet connected is easy.This thing works as a wifi receiver and stream video player, your pad, iphone, mac or PC, or tablet works as remote control. The good thing is your pad, iphone, mac or PC, or tablet can then be freed to do something else when your chrome cast is playing by itself.The not so great thing is there will be a delay in playing, you have to wait for a few second for it to start. WHen you are watching serial show, you have to start the show for each new episode.Also not great is that it won't play your stored video, of course, this you should know when you purchase it. I have no regret. I may buy another one if I need in the future, or maybe I can try a different one.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 5.0, "review": "They are trying to add more apps to the system but I love it none the less. I have a smart TV but the apps often glitch and it's frustrating. Now I use Chromecast and I haven't had any problems. I did use it at my parents house over vacation and if the network is slow because too many people are on it will buffer a lot but that's about network speed not the device.", "verified": true, "helpfulness": "0/0", "author": "Sue"}, {"rating": 5.0, "review": "I Recommend to buy the Google ChromeCast. You can use the Google Chromecast for muliplus stuffs. It is very usefull if you dont have smart tv.", "verified": true, "helpfulness": "0/0", "author": "Paulo Lopes eugenio"}]