[{"rating": 4.0, "review": "I love the chrome cast, only gripe would be that it doesn't work with a lot of the apps that I use.", "verified": true, "helpfulness": "0/0", "author": "Francisco Castro"}, {"rating": 5.0, "review": "the price and shipping speed were awsome. I dont know if it works because I gave it as a gift and havent heard anything positive or negative from the recipient.", "verified": true, "helpfulness": "0/0", "author": "Allen T. Peters"}, {"rating": 5.0, "review": "Chromecast works great using a smart phone as a remote.  You can use a lap top with windows7 or newer operating system.  It is very tiny and works with any WIFI that's fast enough to stream HD.", "verified": true, "helpfulness": "0/0", "author": "David Bechtold \"Dave Bechtold\""}, {"rating": 2.0, "review": "I could see the value in this, if it worked. I bought this as part of my plan to disconnect from twc, directv, etc to pick up a few shows not available on hulu and netflix. The picture quality is good, but the \"cast\" disconnects after only a few minutes. So it's impossible to watch shows. The online troubleshooting guide boils down to, \"we know it doesn't work, hopefully it will work soon.\"", "verified": true, "helpfulness": "0/0", "author": "James Nall"}, {"rating": 5.0, "review": "Simple once set up. Works well. My husband is using on turn around. He can watch movies in camper bed.", "verified": true, "helpfulness": "0/0", "author": "Monica Murphy"}, {"rating": 5.0, "review": "Really like the Google Chromecast! so wasy to use and fast set up!Very Satisfied, Will be recommending to friends and Family!", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 4.0, "review": "This device is awesome, works well when you're in the confines of the apps. The only problems I have are that is needs an internet connection to work and doesn't work with amazon prime videos. Hopefully they'll be a fix for that soon. Otherwise is a great little portable media streamer. (For those of you on campus, use your laptop to create a wifi network that only you have the password for, that way you don't need to worry about other people getting to it. Remember to share you internet connection with it, otherwise it can't update and won't stream.)", "verified": true, "helpfulness": "0/0", "author": "Ark"}, {"rating": 5.0, "review": "Works great with an android phone or tablet, but no great on an iphone or a kindle fire.  I almost gave up on it until I got my droid.  Now it works like it should.", "verified": true, "helpfulness": "0/0", "author": "Will Hallewell"}, {"rating": 4.0, "review": "takes a while to connect /your audience should be patient enough to wait for the connection to go thru/i certainly couldnt  hold my crowd down till the devices connected /so the experience was underwelhming!", "verified": true, "helpfulness": "0/0", "author": "dunstan mascarenhas"}, {"rating": 5.0, "review": "I purchased this because my smart dvd player broke down. My kods love Netflix and I watch lengthy youtube videos at times. Both my kids have tablet (a nabi and a Kindle) I have activated the safety locks and now they both can watch thier movies on the main tv when they want. I save money on the major cable channels which I wasn't watching much anyway. Its a win win.", "verified": true, "helpfulness": "0/0", "author": "Vernon Lorenzo Davis"}]