[{"rating": 5.0, "review": "Very good, essential for cord cutters.", "verified": true, "helpfulness": "0/0", "author": "megan"}, {"rating": 5.0, "review": "product good", "verified": true, "helpfulness": "0/0", "author": "oswaldo ernesto gonzalez colina"}, {"rating": 5.0, "review": "this is awesome - and need it more since VISIO stopped streaming Amazon Prime", "verified": true, "helpfulness": "0/0", "author": "Azure"}, {"rating": 4.0, "review": "Good stuff.  Lots of cool video connections.  great for family meetings", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"poemtiere\""}, {"rating": 4.0, "review": "I would like it to have more features that may come in the future. Like the ability to stream Pictures directly fro a laptop or PC.", "verified": true, "helpfulness": "0/0", "author": "Sir Irish"}, {"rating": 5.0, "review": "I live by these things. It works great to stream from my phone or my computer(using google chrome). I think everyone should have one...no seriously....everyone!!! :)Netflix, home videos, pictures, screen casting - w/galaxyS6, streaming from websites I love my Chromecast.The setup is very simple and straight forward, I used the app on my phone but I believe using a computer is supposed to be easy as well - just make sure your wifi is up and running well...sometimes the extension is a good idea as well.", "verified": true, "helpfulness": "0/0", "author": "muji24"}, {"rating": 5.0, "review": "Awesome!!!!!!", "verified": false, "helpfulness": "0/0", "author": "donald s"}, {"rating": 5.0, "review": "This makes my 3rd one so far!  It's super easy to set up, easy to use, and does so much.  I can play Lullabies in the baby's room through my streaming music app, watch the Food Network shows, HBO shows with the HBO Go app, Netflix and more.  Each dongle can have its own name and I can shoot to any of them while sitting on the couch in the front room (you do need to use a separate APP for each dongle).  I did have to purchase a WiFi extender to get the signal to reach to my room, but I'm not sure if it's a Chromecast thing or a modem range thing.  The coolest part is that I can take my Chromecast with me anywhere, like a friend's house, and watch streaming movies there, as long as they have an HDMI port and wifi.  It's small, but mighty and I love it!", "verified": false, "helpfulness": "0/0", "author": "Karmicways"}, {"rating": 5.0, "review": "I love this product. It works very well with my smart T.V", "verified": true, "helpfulness": "0/0", "author": "Neetae"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "A. Wright \"AmpsVoltsWatts\""}]