[{"rating": 1.0, "review": "Waited more time for arrival of this product from Google play store, waited more time in contacting Google staff to return this item. BUT took few minutes to know that this product is completely junk. And is waste of money and time.- I bought this from Google play store.- Do not buy this if you have a SMART TV with YouTube and Netflix App and built-in WiFi.- Complete waste of money.- My computer uses WiFi to play YouTube, and then chromecast uses same WiFi to cast to TV. Now what? Your internet connection is too slow. Computer is too busy. Processor taking too much pressure. Altogether nonsense product.- No audio signal from VLC player to TVif you already bought, call Google support on phone wait for 30 minutes for them to respond.Stay away.", "verified": false, "helpfulness": "1/6", "author": "Kris \"Kris\""}, {"rating": 5.0, "review": "have one for my tv and another plugged into my stereo.  using one with my stereo is actually the best use of this device at the moment. my google music library is live and loud whenever it needs to be.", "verified": true, "helpfulness": "0/0", "author": "spooky"}, {"rating": 1.0, "review": "This item does not have any advantages over using my wi-fi blue ray player.  There are no apps that this uses that I cannot get for my blu-ray player.", "verified": true, "helpfulness": "2/6", "author": "R. A. Smith \"Dick\""}, {"rating": 3.0, "review": "I am updating this review to say that yo ucan get it to work in Canada.  The caveat is that you need to use and iPad or iPhone to do the setup.  Original review below.I had thought this would allow me to broadcast anything from my laptop or phone to the TV, but no.  It works with Netflix and YouTube, and some other apps from the phone. Not at all from the laptop, unless there is some kind of app I need to install.On the plus side it allows you to use your phone like a remote.****Nowhere in the description did it say this is only for US customers, however, it will not function in Canada, and it will not connect if you are VPN'd to another (American) network.  Boo!  I want this to work!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent except for no Hulu Plus - Google needs to add more apps. Easy installation straight forward setup with phone and samsung tablet", "verified": true, "helpfulness": "0/0", "author": "Boz"}, {"rating": 1.0, "review": "I had high expectations when this product hit the market and waited over a month for it to arrive.  The hype was that it would work with most operating systems.  Following its arrival and subsequent installation I found it was not compatible with my Vista operating system and required an core i5 or newer Intel process to cast HD content from Google Chrome.  Check out minimum requirements very closely prior to purchase and avoid the major disappointment I experienced.", "verified": true, "helpfulness": "1/5", "author": "Vital G. LaCroix"}, {"rating": 5.0, "review": "Works great for YouTube and Netflix and was easy to install. I have a blu-ray player that is a pain to use with YouTube, and for that matter Netflix as well, navigating with the remote. With Chromecast I can do it all with my iPhone so it works nicely. One thing that is handy is that anyone can use their mobile device, really nothing to learn. I also tried \"mirroring\" from the Chrome browser on my Mac, and that works too. In fact, in full screen mode, I could switch to other programs and screen mirroring continued to work. I am eager to see what new content might be supported soon....can't wait.  I also have an Apple TV and that works very well but only with Apple devices. It can mirror the screen of your iPad or iPhone, which Chromecast cannot, but it also costs about 3 times as much.", "verified": true, "helpfulness": "0/0", "author": "Rodrigo"}, {"rating": 1.0, "review": "Don't buy this. It only supports Netflix and Youtube, and not very good at that. Extremely limiting!! Complete waste of $40. Instead, you'll want an Apple TV or Roku, which both support HUNDREDS of applications, not just two like Chromecast. Seriously Google, what's going on with you to release junk like this??", "verified": true, "helpfulness": "1/4", "author": "J. Johnson"}, {"rating": 5.0, "review": "I ordered my Chromecast on 28 July, and finally received it this past Tuesday (10 September). Patience is a virtue here!With the iOS app on both my iPhone and iPad mini, it was a breeze to setup. The app does let you reset the Chromecast to factory defaults, rename it, change the time zone, as well as reboot it.The Google Cast extension does work in both Windows and Linux. However, tab casting is only working in Windows. I have yet to get Screen casting to work from my notebook. I suspect my notebook isn't powerful enough to do screen casting.It does take it a bit to start streaming YouTube and NetFlix. I've only had NetFlix crash on the Chromecast once.My Insignia TV, a NS-32E440A13, supports CEC, but only has HDMI 1.2. So, I have to use the USB AC adapter or the TV's USB port.To get CEC to work, one has to use the wall adapter. My TV has options to power on, switch inputs. While Chromecast can turn on my TV, it doesn't always switch to the correct input. It's like Chromecast is going to sleep or low-power mode.I also have a 3rd generation Apple TV. These two devices have different purposes and functionalities. So, one can't really make fair comparisons between the two.Just a matter of time before more apps are released upon finalization of the SDK.Even with these few bugs, it's well worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Derek J. Witt"}, {"rating": 1.0, "review": "I tried several times to configure this on my home network and failed. I contacted Google support, and they had me reset the unit to factory defaults and I tried again to set up. I got a message informing me that I must have a router that supports UPnP to use the Chromecast. My router (Cisco ASA 5505) doesn't support UPnP for the very good reason that it is not secure. I have returned the Chromecast.", "verified": true, "helpfulness": "1/5", "author": "Erik Freitag"}]