[{"rating": 5.0, "review": "My family loves our chromecast.  We repurposed an old 24 inch Asus monitor as a kids TV.  We hooked up a mini soundbar (Bluetooth speaker by anker also 5 stars amazing) and used the aux out on the monitor.  Its perfect.  We have the multiple devices synced with the chromecast.  We mainly use Netflix, plex, and YouTube.  Its positively perfect and dead simple to use and setup.  Great job Google.  Also I leave it plugged in all day...it has this awesome feature where you can display a screensaver type photo stream of random gorgeous landscape photos drawn from the internet or pictures of your own.  Very cool digital picture frame feature.  I love it. 5 stars I can't say that enough.", "verified": true, "helpfulness": "1/1", "author": "Rach"}, {"rating": 5.0, "review": "So easy to use!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Zagatskiy O."}, {"rating": 2.0, "review": "If you can choose between chrome or apple tv, go with apple tv.", "verified": true, "helpfulness": "0/1", "author": "Amazon_customer"}, {"rating": 5.0, "review": "It was delivered so fast and it's working good. My son is really happy to watch Netflix with no problem using Chromecast", "verified": true, "helpfulness": "1/1", "author": "Amy"}, {"rating": 5.0, "review": "LOVE IT BEST INVENTION EVER", "verified": true, "helpfulness": "0/0", "author": "Steven Sanders"}, {"rating": 1.0, "review": "I'm not sure who writes these glowing reviews.  I've got four Chromecasts for the office.  They crash constantly.Replaced them, after a week, same problem.We used these for display monitors, every morning I come into work, I have to restart the extension.The worst part is they behave like an open wifi when they crash.  w...t...f...welcome to 1995, here is your default open behavior.Save yourself the hassle and avoid this.", "verified": true, "helpfulness": "0/1", "author": "John K."}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "jingjiesy"}, {"rating": 5.0, "review": "use it all the time. love it and nicely priced!", "verified": true, "helpfulness": "0/0", "author": "Calvin Do"}, {"rating": 5.0, "review": "Great works as described !!!!", "verified": true, "helpfulness": "0/0", "author": "Keith M. Young"}]