[{"rating": 1.0, "review": "I got the chromecast today, and I have not even been able to set it up. It could be user error, but during initial setup, I lose my wifi connection and I can't even use wifi until I unplug the chromecast.I spent an hour on the phone with my internet service provider, we refreshed the network and everything, and the same thing happened. I do not have these issues with my Roku, so I am returning this and just getting another one of those. Really disappointed, I was looking forward to using this product.", "verified": true, "helpfulness": "0/0", "author": "Bri"}, {"rating": 5.0, "review": "Super easy set up.  Works well.  Its nice to Youtube music videos on the big screen wirelessly with the surround sound.  $35!!! Google does it again.", "verified": true, "helpfulness": "0/0", "author": "Hanson"}, {"rating": 5.0, "review": "Cool, great buy. Got on you tube and watched a how-to video so setup was very easy. Works as expected.", "verified": true, "helpfulness": "0/0", "author": "M. T. Silveira"}, {"rating": 3.0, "review": "Meh. It's a way to stream your browser to your TV but dont expect much quality. I bought it to watch GoT on HBOGO but ended up getting a roku3 which I would easily and highly recommend over this device. Google TV doesn't appeal to me.", "verified": true, "helpfulness": "0/0", "author": "DesertScottAZ"}, {"rating": 5.0, "review": "At this price, there's every reason to buy it to get your Netflix, Hulu onto the big screen. Big wish would be for Amazon Instant Video to be available this way too. Worked well for me drawing power from the TV's USB socket", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "My problem with this device is that you have to stream whatever video you are watching through two devices.  Whichever device you are using to control it, phone, tablet, laptop, has to stream the video in order for it to be sent to the device connected to the TV.  This would be a very important piece of information that the manufacturer should provide in its advertising.  I would not have purchased it had I known this.  I don't want to stream through my laptop to watch on tv.  I might as well watch it on the laptop.  Also, Netflix has changed its program and only allows streaming through two devices at a time.  With this device you will be using all streaming ability with one device.  I don't like it because of this.  I wanted a device I could use independently and this is not it.", "verified": false, "helpfulness": "2/6", "author": "Anaya Lynn"}, {"rating": 5.0, "review": "This is a great product. Simple to install and use, works great with my Samsung tablet and Netflix. Just plug it in and start watching, it's that simple.", "verified": true, "helpfulness": "0/0", "author": "Dan Knous"}, {"rating": 5.0, "review": "Got this working straight out of the box.  We thought we were limited to just NetFlix, Hulu and youtube but figured out that Chrome had a tab extension that allowed us to stream stuff from our computer to our TV.  Love it!!!", "verified": true, "helpfulness": "0/0", "author": "stoelupe"}, {"rating": 5.0, "review": "It is the only way I can look at Netflix on my bedroom television, very convenient.  Does a big job for such a small device", "verified": true, "helpfulness": "0/0", "author": "M Scott-Girod"}, {"rating": 4.0, "review": "This is an easy to install media streaming device for your HDTV.  We have a wall mounted TV without a set top box (no place to hang one).  It's a unit that operates with a cable card (I find it incredible that the support of cable card technology was the \"mechanism\" used by the cable industry to obtain FCC approval for encrypting digital cable signals and now (since about 2008) no one makes TVs that support the technology).  In any event, it was easy to install and it required just one reboot of our wireless access point to get it to show up on the network.  My only complaint is that there are only a few streaming services that support it.  Amazon Instant Video is not one of them and should be!", "verified": true, "helpfulness": "0/0", "author": "D. Steinborn"}]