[{"rating": 5.0, "review": "I was skeptical that at 35 dollars it would be a good product, but it does  it claims to do at a great price.", "verified": true, "helpfulness": "0/0", "author": "jessepr"}, {"rating": 5.0, "review": "Awesome! I absolutely love it. Staying home after work instead of going to the movies is exactly what we need. Thanks", "verified": true, "helpfulness": "0/0", "author": "Blump"}, {"rating": 5.0, "review": "Works perfectly with my older \"non-smart\" tv set. Streams Netflix and other content from phone, teblet etc. You can also stream any content from the web using laptop with WiFi and chrome browser", "verified": true, "helpfulness": "0/0", "author": "TJOMF"}, {"rating": 5.0, "review": "Easy to install, can watch Netflix on my television, or my notebook.  Definitely would recommend it for anyone who wants more technology.", "verified": true, "helpfulness": "0/0", "author": "Phyllis Jacobek, Librarian"}, {"rating": 2.0, "review": "It's still sitting in the box after having tried everything I know how to do to get it to work.", "verified": true, "helpfulness": "0/0", "author": "Shelby K. Sherman \"What is the ground drag coefficient of an unhusked turtle?\""}, {"rating": 3.0, "review": "The set up was easy.  Plug, program, and watch.  Only down side is that only a limited apps lets you watch through chrome cast.", "verified": true, "helpfulness": "0/1", "author": "K638"}, {"rating": 3.0, "review": "I only use it to watch youtube videos on my tv. It does alot more than that, I used it with netflicks also. It works as advertised. I get to enjoy home movies I uploaded to youtube on my big TV.", "verified": true, "helpfulness": "0/0", "author": "Patricia B Napoli"}, {"rating": 1.0, "review": "When I called to report it had not worked in any of three hotels I had tried to use, was told, \"I hate to be the bearer of bad news, but it does not work in hotel TVs which are programmed to block it.\"  By then, of course it was too late for a refund.  Not satisfactory.Rebel", "verified": true, "helpfulness": "0/2", "author": "MsCarol5720"}, {"rating": 5.0, "review": "It functions well and I use it mostly to put on line tutorials on my big screen for better visability while following along", "verified": true, "helpfulness": "0/0", "author": "Michael Redburn"}, {"rating": 2.0, "review": "I chose two stars because it worked great for about a month, but now it suddenly won't connect to my WI-FI. It can tell that it's there, because I can see the name of my WI-FI network on the screen when I try to connect, but then it says that it couldn't establish a connection. Bad customer service for returns or replacements. I still haven't sent mine in for a replacement, but when I do I'll update my review if it works.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Matthews"}]