[{"rating": 5.0, "review": "LOVE this product. From the ease of use to the selection of what to watch....incredible. Like everything from Amazon,  the best of quality.", "verified": true, "helpfulness": "0/0", "author": "Jill Rosenstock"}, {"rating": 4.0, "review": "I am very pleased with my Fire TV purchase.  I purchased this as a Christmas gift for the entire family - this is definitely the future of entertainment.  Also love the streaming music and radio.  The cloud backup for pictures/photographs is also awesome.  I also like the remote control app that you can get on your smartphone in case you misplace the remote - this app allows your phone (mine is a Galaxy Note 4) to function exactly like the physical remote.  I would have given a 5 star rating if I could use the remote to get info/details on a program/show that I might be watching without having to exit out of the show.  Maybe that will be addressed in future upgrades.  However, the benefits far outweigh this one hurdle.", "verified": true, "helpfulness": "0/0", "author": "Vincent H. Brown"}, {"rating": 3.0, "review": "The voice commands is nice and super fast.", "verified": true, "helpfulness": "0/0", "author": "Krystal K."}, {"rating": 5.0, "review": "Great....", "verified": true, "helpfulness": "0/0", "author": "latonia cooper"}, {"rating": 5.0, "review": "My husband and I bought it for us for Christmas. We do really like it, We live in a rural area and my husband likes to listen to talk shows in the day time, We do have DirecTV, Netflix, etc. At first he was not so impressed but I showed him that I already had a list of over 1000 songs in my Prime Music List, over 100 save (for later) movies in my Prime movies, but the big \"OK, I'm impressed\" from him was when I showed him \"Iheart\" radio NOW, he can listen to am talk radio, local football games etc! So, I would give it a 5 Star", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "WOW! I was already a Prime member, but this takes it to a whole new level. Easy to set up, to use & neat to have a voice activated search option. Happy so far!", "verified": true, "helpfulness": "0/0", "author": "Pamela M McGrath"}, {"rating": 5.0, "review": "Works as well as advertised...", "verified": true, "helpfulness": "0/0", "author": "J Meyers"}, {"rating": 5.0, "review": "Good device, very happy.", "verified": true, "helpfulness": "0/0", "author": "Jack Misraje"}, {"rating": 5.0, "review": "Bought this to replace my Roku 2 (which I give 5 stars too as well) and love it. The voice search is incredibly accurate to both my voice and my 9 year old daughters voice. Paired with a wireless usb keyboard/mouse combo from logitech to make the keyboard searches less painful for the none voice stuff and I am a happy couch potato.", "verified": true, "helpfulness": "0/0", "author": "Chip Brooks"}, {"rating": 5.0, "review": "The Amazon Fire TV works well and exceeds expectations. Thank you!", "verified": true, "helpfulness": "0/0", "author": "aggiecain"}]