[{"rating": 5.0, "review": "Works well no delay and lots of tv shows and movies to watch with prime", "verified": true, "helpfulness": "0/0", "author": "gr"}, {"rating": 5.0, "review": "awesome media player, it is better than apple tv for sure", "verified": true, "helpfulness": "0/0", "author": "Terry L. Ballard"}, {"rating": 3.0, "review": "Movies I ordered did not yet play.If I want to watch a movie, I have to start playing it,pause it so it can load other wise it keeps buffering. Also I guess I don't know how to go back to a movie once I take a look at what else there is. Have not utilized it as much as I thought I would.It also suprised me, that their are charges on older movies like ,The Godfather,  Fried Green Tomatoes etc..Still debating if I should keep it.", "verified": true, "helpfulness": "0/1", "author": "J"}, {"rating": 1.0, "review": "Funny thing is some of the apps don't work properly.  For example Bloomberg and PBS, on Bloomberg the live broadcast keeps crashing until I reset to factory setting and re-installed everything again...So time consuming, then it works a couple days maybe a week and crashes again...PBS just crashes randomly, This seems like compatibility issues with Amazon TV vs app issues like I see most people blaming (I only say that because you have to reset the Amazon Box to resolve the issue!", "verified": true, "helpfulness": "1/2", "author": "AmazonJerm"}, {"rating": 5.0, "review": "We love the Amazon Fire with Prime account, it gives a very large repertoire of movies and documentaries... The voice command is very effective, even precise. Thank you...", "verified": true, "helpfulness": "0/0", "author": "Shinobi"}, {"rating": 5.0, "review": "Long time come and to hell with cable and satellite......", "verified": true, "helpfulness": "0/0", "author": "Michael T. Santeramo"}, {"rating": 4.0, "review": "Nice devise, easy to set up and use. Love the voice search. Will be better once it is able to be connected to my Tablo DVR.", "verified": true, "helpfulness": "0/0", "author": "Jerry D Bales"}, {"rating": 5.0, "review": "Love my Amazon Fire TV - watch programs all the time.Had trouble only once and called customer service. The rep was able to help me get my issue resolved in about 3 minutes.", "verified": true, "helpfulness": "0/0", "author": "Maren S."}, {"rating": 1.0, "review": "So regret this purchase.  I wish I had gotten a ROKU.", "verified": true, "helpfulness": "0/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! Easy to set up, but you need a HDM cable which should have been prominently displayed on the box. Really makes it easy to see Amazon Prime videos on the TV. Why did I wait so long to get it?", "verified": true, "helpfulness": "0/0", "author": "M. Mueller"}]