[{"rating": 5.0, "review": "Love the chromecast although we don't use it as much as we thought we would....only for Web only hulu shows.", "verified": true, "helpfulness": "0/0", "author": "Aimee"}, {"rating": 5.0, "review": "Outstanding little piece of hardware. Worth the money just for HBO go. Video quality is much better than the old laptop I was using. Also frequently use it for You Tube and Pandora. With a cheap HDMI to VGA connector, it hooks up to our projector no problems.", "verified": true, "helpfulness": "0/0", "author": "Cadnr"}, {"rating": 5.0, "review": "Quick delivery. Set up couldn't have been any easier.", "verified": true, "helpfulness": "0/0", "author": "WBrauck"}, {"rating": 5.0, "review": "Such a cool concept and much more affordable than an an apple TV or roku!", "verified": true, "helpfulness": "1/1", "author": "P.J. P."}, {"rating": 4.0, "review": "Enjoy watching videos and photos with family and friends. Works perfectly!", "verified": true, "helpfulness": "0/0", "author": "Jose Manuel Santos Tejada"}, {"rating": 5.0, "review": "Amazing.", "verified": true, "helpfulness": "0/0", "author": "Bill Meyer"}, {"rating": 3.0, "review": "This was fairly easy to set up.  However, we could not get smooth reception on our HDTV set.  We have DSL so I'm guessing our internet connection wasn't fast enough.  It was strange, though, because I could watch the same video on my PC, using the same DSL internet connection, and the video reception would be just fine.  We don't watch much TV, so, since the reception with this wasn't that great, I sold our Chromecast on EBAY.", "verified": true, "helpfulness": "0/0", "author": "Mercury Man"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Glenn Esber"}, {"rating": 4.0, "review": "Ok, a few things.  I set this up on my home TV, very quick to setup and easy to use.  There seems to be a lot that Google has not taken from beta to real life yet though.  I can cast off my phone for You Tube and Netflix which is wonderful, but why I cannot cast off the Chrome browser on my phone is a mystery to me.  I took this to do a presentation and hooked it up to a projector and it setup fairly easily on the facility's network but had major issues with the Chrome browser stopping casting in the middle of the presentation.  This was very frustrating and dashed my high hopes of making presentations with it.  But for $35 you can't beat it and we will continue to use it a home.  Hopefully in time it will be better supported with better documentation and functionality by Google.  I'm also hoping that it will be a bit more stable.  I have had this devices for about 3 months now.", "verified": true, "helpfulness": "0/0", "author": "firstlast"}, {"rating": 5.0, "review": "love this so much! easy set up, quick to connect even when i transfer from my place to my moms. called customer service once and it was the absolute FRIENDLIEST and most awesome customer service experience ever. love google.", "verified": true, "helpfulness": "0/0", "author": "Monika Tomas"}]