[{"rating": 5.0, "review": "Wonderful crystal clear pictures, easy to operate, good selection of apps and programming.", "verified": true, "helpfulness": "0/0", "author": "Deborah Darbonne"}, {"rating": 5.0, "review": "Amazon Fire is worth 10 ROKU's.  I could not get the Roku to stream a video with out having to wait for buffering all the time.  Amazon downloaded perfectly the very first time, never had to wait for buffering.  What else is amazing is the picture quality - it was twice as good as my high definition downloaded from my Direct TV satellite.  I tried it as a sample and will definitely keep it now.Its a $100.00 and Amazon Prime is also $100.00 but what I can download in TV series and movies for free plus the free shipping via Amazon.com I feel I am getting my money's worth.", "verified": true, "helpfulness": "0/0", "author": "Harris Les Myers"}, {"rating": 5.0, "review": "Absolutely love my fire!", "verified": true, "helpfulness": "0/0", "author": "Alycia Tandy"}, {"rating": 3.0, "review": "when i'm doing the kindle mirroring it suddenly freezes! but i still think its pretty good in other points of view", "verified": true, "helpfulness": "0/1", "author": "Miguel G-M"}, {"rating": 5.0, "review": "many options and great value, especially if you are a Amazon Prime member.", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Came already set up. Super fast! Great picture and sound.", "verified": true, "helpfulness": "0/0", "author": "Steve G"}, {"rating": 5.0, "review": "After reading some of the Amazon reviews as well as other reviews from some of my favorite tech sites I waited a bit and then finally made the purchase.  After using it for a few weeks I'm very impressed.Before Fire TV -We have a powerline network connection in the living which works great if you don't have a direct Cat5 connection to your router.  It connects to our router which in turn is hooked up to a DSL connection (4Mbps average).We had used our Blu-Ray player to access Prime, Crackle, Netflix, Revision 3 and other apps.  With the Blu-Ray apps there was a noticeable lag from the appliance buffering the content and then rendering it.  When we would decide to watch something it would generally take about 15-30 seconds to queue it up.  When we would watch prime or netflix content it would sometimes have the pixelated look for a few minutes and then would finally clear up.  I had come to accept this as being the norm and I had attributed that to my slower DSL connection since we don't have a faster cable connection.The Era of Amazon Fire TV begins -I received the appliance a few days after ordering.  Setup was easy and it was already pre-configured with our Prime account.  After the welcome video I took it for a test drive to view prime content.  It had a better interface than the Blu-Ray.  It looks looks like what you would see with XBMC, Roku or the like.  When I accessed a movie and then hit play the content displayed immediately and it looked very good compared how it renders with the Blu-Ray.  I attribute it to the Hardware and of course Amazon would optimize the player to render Amazon streaming content.  I suspect that while browsing content, i.e. while browsing a title and before you have actually hit the play button it may be doing an initial load of content into the buffer (getting a head start) so that when you hit play it just starts.  They call this ASAP (Advanced Streaming And Prediction).Other Content providers:The Netflix app was okay.  The menu interface reminds me of the web interface.  It doesn't load immediately like Prime content does and we still (as with Blu-Ray) suffer from buffering issues where a movie will stop midway waiting for content.  I'm beginning to think it is Netflix CDN (Content Delivery Network) and the Netflix App itself not utilizing the full hardware of Fire TV.  Word to Netflix:  If you are going to abandon the DVD rental and focus on streaming content then you better invest in more CDN for the flyover states and better support for major streaming appliances like Roku, Fire TV, Apple TV, Chromecast and such either build a better product or work with those who make them to utilize the full capabilities.Crackle runs good and displays well.  Revision3 runs better than I expected.  The Smithsonian app occasionally buffers, but is acceptable and has less buffering than Netflix.  YouTube,  Disney Channel was good.  Others like Frequency, a mashup app, is very promising, but for us and our lower internet speed the constant buffering is unbearable (your mileage may vary with a better connection speed).Voice command works good for Amazon and I'm certain that other apps will be able to utilize the feature.  The remote isn't an IR so it doesn't require line of sight.I can't comment on Games, since I haven't used this feature.Cons:There is no power button.  Maybe I'm just old school, but I prefer to have a power button to shut it off.  The Fire TV will go to sleep mode after a given amount of inactivity, but I prefer a shutdown option.  Also I don't like the size of the remote.  It is too small and could easily be lost.Access to local media.  While they offer a Plex app to access content on your Network (Your PC's or NAS), I would have preferred that it natively support DLNA/UPnP so that I can access pics, music, and videos or at least a free app.  The app has the ability to side load apps like XBMC that can view DLNA, but I haven't looked into doing that yet.  Plex is what you currently have.I haven't found a screen cast app.  This would be useful to display pics or videos on my Iphone to the big screen.I'm certain that someone will come up with something for all phone types.ESPN/ Showtime / HBO Go/ Disney Apps, Etc have Fire TV apps, but their availability is limited based on your internet provider.  So you install the app go through the verification process only to have to uninstall it later when you later find out that your provider isn't on the list of providers.Conclusion:Overall, we are very pleased Amazon Fire TV and I believe it is well worth the money if you have a Prime account.  I believe the Fire TV, even though a first Generation is very good and provided that their app market continues to provide more apps it will get better.  Our Blu-Ray is no longer the primary streaming appliance at night.  It just doesn't have the horse power and doesn't give us the flexibility to add new apps.If you don't have a Prime account I would suggest you first get a Prime Account on a trial basis before you purchase the Fire TV to see if the Prime Movies/TV series falls within your tastes and price and works reliably in your neck of the woods.  I personally think that Amazon Prime is better in content and reliability (doesn't suffer from bandwidth/buffering issues) and is worth the $99 dollars/year.  We don't have cable or Dish/DirectTV so Prime, Netflix, Crackle and other streaming content is our cable.  Netflix is less reliable and limited in content so we may soon drop our subscription if content/buffering doesn't improve.  We also don't rent through Prime or Hulu Plus.So for those without Prime it will initially cost you $200 dollars.  Try Prime on a trial basis first and if you don't think it is worth the price then for under $100 without a prime annual fee you can get a very good preconfigured Android HTPC like G-Box Midnight with XBMC. It has a Graphics GPU, a dual core processor, and just about the same amount of memory without the need for an annual Prime subscription.  I had to upgrade XBMC from Frodo to Gotham so that it would fully utilize the hardware and stop skipping my media library files.  Again, I think the content from prime is worth the annual subscription.  I can't comment on Chromecast or Roku only to say that their current offerings Hardware capability pale in comparison to Fire TV and G-Box Midnight.", "verified": true, "helpfulness": "3/4", "author": "Charles L. Byrne"}, {"rating": 5.0, "review": "With XBMC this is unbelievable fast.  Love it..", "verified": true, "helpfulness": "0/0", "author": "Hercuroc"}, {"rating": 5.0, "review": "Exactly as described. Good price.", "verified": true, "helpfulness": "0/0", "author": "BNH NH USA"}, {"rating": 5.0, "review": "So much faster and nicer than a Roku or smart TV.", "verified": true, "helpfulness": "0/0", "author": "Neal Sorensen"}]