[{"rating": 5.0, "review": "The Chromecast is a fantastic device and will really change the game of home streaming media as the simplicity and portability will enable it to take it with you and get it to work wherever wifi is available.  Thru the downloadable Chromecast app from the iOS or Android Play Store, pairing thr CC to your mobile device is simple and you can pair your CC with multiple devices and simply use whatever device is closest at hand to start operations.  Even if you shut off or reboot your mobile device, streaming playback is uninterrupted on the CC and operations can even be picked up on a different paired device.Right now streaming services are limited to the major players (netflix, hulu plus, pandora, hbo Go) but hopefully the list of supported services will continue to grow and once the SDK is released then other features will be opened up including streaming of local content", "verified": true, "helpfulness": "0/1", "author": "Kay One"}, {"rating": 2.0, "review": "I've had the Chromecast for about two months now. I really wanted to love it. But unfortunately I'm not very happy with my purchase and will try to return it if I still can.Set up was easy. Youtube streaming works like a charm from all my IOS and Android devices. But I could not get Netflix to work. I'm a big user of Netflix and this is a deal breaker for me. I contacted Google tech support via email and they are absolute MORONS!! They don't listen to what I'm saying and repeatedly ask the same questions. Every time I respond to their email, a different person picks it up and asks the same questions. It was very frustrating and if it weren't for their horrible support I probably would have given it 3 stars. I'd shell out a few extra bucks and get a Roku with WIFI.", "verified": true, "helpfulness": "0/0", "author": "TechTyrant"}, {"rating": 1.0, "review": "Was great when the player was working. But now, I have to keep it unplugged till I want to use it or it over heats and will not sink with my Android phone or respond to anything else. Would like to send it back to be fixed or exchanged, but Amazon says it has been over to send back time and Google wont take it back due to being sold by Amazon. So stuck with a non working player. So take this information as you will......", "verified": true, "helpfulness": "3/4", "author": "Rick Guttery"}, {"rating": 5.0, "review": "So if you're reading my review, you probably already have a general idea of what the Chromecast is about. I'm not going to regurgitate the technicalities of what Chromecast does like the other reviewers before me have done already. What I will tell you though, is why I personally like the Chromecast device.First and foremost, my family is a *HEAVY* user of Netflix. I purchased my first Chromecast as a \"test\" to see if it was really worth the $35 back when they first released it.  A few months later, I'm buying my second one for another room.As of this writing (12/3/2013), Chromecast currently supports Netflix, YouTube, HBO GO, Hulu Plus, Pandora, and Google Play Movies and Music mobile apps and streaming through the Chrome PC browser.  If you have any of those apps on your mobile device and it is the latest version, you will automatically have the ability to \"cast\" to the Chromecast from within the App.  If on Chrome PC, you download the \"Google Cast\" extension for your Chrome browser.I do not have HBO Go or Hulu Plus. Nor do I use Pandora or Google Play Movies.  On occasion, I will cast YouTube and it works as expected.Netflix App Performance:The app performance is wonderful.  It actually seems to be faster than compared to my Vizio Smart TV Netflix App as well as my Western Digital SMP app.  Videos queue very quickly.  The *ONLY* beef I have with the Netflix App is specific to when you're watching TV shows on Netflix.  All other Netflix Apps on my TV, media players, phone, iPad, Xbox360 will automatically play the next episode.  It doesn't do this on the Chromecast.  So when a TV episode is over, I have to whip up the app again and manually select the next TV episode.Setup:The setup is easy and the only requirements are:1. That you have WiFi in your location.2. A mobile device (Android or IOS) OR PC to use a a cast \"source\"3. The mobile device and/or PC is on the SAME network as your Chromecast. For most of you, that means they are connected to the same router you have in your home (whether wired or wirelessly).4. You have the Chromecast App on your mobile device or the Chrome browser w/ Google Cast extension on your PC for the initial setup process.5. The support app is the latest version that supports Chromecast.The reason I give this device 5 stars is because of the price and potential.  I can't think of a cheaper device to let me play my Netflix on my TV.  Plus many of you are complaining that there's not enough \"apps\" supported by the Chromecast, but be aware that it is in its infancy.  The SDK (software development kit) is currently not available, so homebrew folks and companies can't support it yet.  There are alternatives in \"beta testing\" where you can cast stuff other than the current apps, but it will take time.  I'm sure in a year from now, we'll see a lot more apps supported, whether official or unofficial. But coming from just someone who uses Netflix, I couldn't be happier.", "verified": true, "helpfulness": "2/3", "author": "Hyoun Kim \"Faluzure\""}, {"rating": 2.0, "review": "A little restrained, it's a big bet on future improvements.  Also, I like the option of not having a phone or tablet on me to operate it.  Like my Apple TV a lot better for a million reasons, and hope I'll like the Roku better too.  This is not that useful if you're basically trying to cut off cable.", "verified": true, "helpfulness": "0/1", "author": "Miguel"}, {"rating": 5.0, "review": "This stick is easy to set up right out the box. It cannot be seen once connected to my tv. Streams netflix movies with ease.", "verified": true, "helpfulness": "0/1", "author": "Warmspirit1685"}, {"rating": 4.0, "review": "Set-up was a bit troublesome, had to call Google for assistance.  Assistance was very good, with help I was \"casting\" easily. Works great with You Tube, Netflix and Hulu Plus, Google plans to have other streaming sources optimized in the future.  Other streaming sources can be \"cast\" but now with the quality of optimized sources.", "verified": true, "helpfulness": "0/0", "author": "KeeKee"}, {"rating": 3.0, "review": "Not too happy with the product. WiFi was not a happy connection. Several connection issues with the laptop too. Works well with You Tube and Netflix but not well with streaming Chrome from laptop.", "verified": true, "helpfulness": "0/1", "author": "kazoopalli"}, {"rating": 5.0, "review": "Excellent little dongle, easy-to-use, working flawlessly - all at a price that is hard to beat. We already have multiple across the house.There is growing number of streaming options that natively support Chromecast, including Netflix, HBO Go, YouTube, Google Play, etc in their respective players (web or mobile apps) through the Chromecast icon. The interesting aspect of the native support is that Chromecast itself actually connects to the streaming provider directly. In other words, at that point there is NO streaming going on between your phone/tablet/laptop and Chromecast. You can easily shutdown/work/or do other things. No quality impact either, obviously, that would be caused by your device. Simple and extremely effective.The other use-case is the \"casting\" (streaming) of tabs from within the Chrome browser. As other reviewers noted, in that scenario the performance is really depending on your device's performance and the content you are casting. Still a very nice feature that comes in handy quite often. Especially if you want to share web pages ad-hoc.And with a growing number of native support options, there is less and less need to use that option for casting video but rather use it for web page sharing.", "verified": true, "helpfulness": "0/1", "author": "Humboldt"}, {"rating": 2.0, "review": "When it works it's awesome.. However, even though I have a strong wifi signal it seems to loose sight of it all the time and not work. In fact it hasn't worked for over a month now and I've pretty much given up on it.", "verified": true, "helpfulness": "1/1", "author": "Todd"}]