[{"rating": 5.0, "review": "I have a media player and really get tired of trying to type one letter at a time searching for something on Youtube.  With this I can search comfortably from my chair.  I currently use this for Youtube, Netflix, Hulu, and Plex.  I wish I had a 2nd one just to carry with me on trips or to go to a friend's house with.  I was not sure that I would like this but I am pleasantly surprised.", "verified": true, "helpfulness": "0/0", "author": "Gadgetlve \"Gadgetlve\""}, {"rating": 4.0, "review": "O like this product, very easy to setup and install, it works perfectly with youtube and other apps, but i can't work it with a mobile google chrome and photo gallery", "verified": true, "helpfulness": "0/0", "author": "Igor Colaiacovo"}, {"rating": 3.0, "review": "Did not realise that product only streams information from internet. Switched to Apple TV. Sometimes loses connection with Wi Fi.", "verified": true, "helpfulness": "0/0", "author": "BMS"}, {"rating": 4.0, "review": "Good price.  Set was easy, but I don't feel they make it clear you need to plug it into power outlet.A little unwieldy to operate TV through phone.  Had one instance where it wouldn't work and needed to re-set my modem.", "verified": true, "helpfulness": "0/0", "author": "Dixon Cayne"}, {"rating": 5.0, "review": "The chromecast offers a simple easy-to-install streaming option for home media centers. I use my Chromecast in conjunction with my FreeNAS server and Plex Media Server (plugin for FreeNAS). The chromecast works great and has handled all my x264 encoded library with ease.My only complaint is that the current Chromecast does not support AC wireless bands (higher frequency ... aka faster) WiFi. The chromecast requires the use of a phone, tablet, or computer to cast media or control content playback. If you are used to a old fashion remote, then go for a Roku, FireTV, or something else.Overall the chromecast is worth the buy and comes highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Nathan"}, {"rating": 1.0, "review": "This works great with plex and their app and its integration in Android. You can pretty much share from any app in Android with Plex, and then watch that on chromecast (great job Plex team!). But I feel there isn't that much integration in Google's android ecosystem (Google...you made this, not Plex, what's with the lack of integration!?). I have to bend over backwards to get it to work, and most of that means using Plex's integration to Android to get content over to chromecast.The biggest issue for me is that it's networking is very stupid. I have a couple routers setup at opposite ends of my house. They both have the same name. Chromecast, which is situated at one of the ends of the house, wants to always connect to the WORST signal router at the opposite side. This caused me to have to rename my routers. VERY dumb.", "verified": true, "helpfulness": "0/0", "author": "M. Diehl"}, {"rating": 5.0, "review": "This simple little media feeder works GREAT for me. im hardly ever home and this allowed me to totally replace my cable box and watch media through my internet provider. It seamlessly links any droid, Google chrome browser and tablet to play youtube, google music. just about anything. they also allow aftermarket programs to feed movies to It as well. best 35 bucks ive spent for my home.", "verified": true, "helpfulness": "0/0", "author": "Tyner"}, {"rating": 5.0, "review": "Works great right out of the box.  Configure and control it with a phone or tablet.  Streams youtube videos (which a Roku couldn't when I got this).", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"patwood\""}, {"rating": 2.0, "review": "Lost signal on first unit. Changed wall power supply and still No Go. Sent in for replace. Replacement worked for three weeks. Same failure mode. Looking at other options as reliability is awful.", "verified": true, "helpfulness": "0/0", "author": "Michael M."}, {"rating": 1.0, "review": "Gave the Chromecast away to be someone else's problem and I bought a Miracast receiver instead.  Works 100 times better.", "verified": true, "helpfulness": "0/1", "author": "O4"}]