[{"rating": 4.0, "review": "That's ok, do what promisses.", "verified": true, "helpfulness": "0/1", "author": "Tiago"}, {"rating": 5.0, "review": "I use my Chromecast daily. I really enjoy the product and the services that this little product allows. I stream from my Note 3 and love watching movies and tv with Chromecast. Get one if you haven't already it's a great product.", "verified": true, "helpfulness": "0/2", "author": "Jesse Girdler"}, {"rating": 5.0, "review": "Best cost/benefit! And it does work outside US, despite they say the opposite in the FAQ.", "verified": true, "helpfulness": "0/2", "author": "Muglas"}, {"rating": 4.0, "review": "The Product does exactly what it says. Saved a lot of money by not buying an Smart TV, and invested inthis tiny smart thing. Have some issues with the apps that support streaming to the device.Be sure to have a good router for this to work seamlessly. As the routers capacity could be an hindrance.", "verified": true, "helpfulness": "0/0", "author": "Kaushik Mohanraj"}, {"rating": 5.0, "review": "this worked very well for me. There was an issue with my Wi-Fi router from my service provider - AP isolation is not disabled there.I call them and they could fix this config. Now all my devices, Andriod phone, tabs, Laptops and my Mac notebook pro, Iphone casts on to my TV without hitch.This enabled me to create a private cloud at my home, with my PC having all the data ( Music, videos) and I cast this onto TV through my phone using one of the APPs available there and I listen to musing on my bose soundlink through blue tooth, So this device enables me to have near home theatre experience with my private cloud I established.This is value for money for sure, if you like to watch every thing on TV along with your family and friends.", "verified": true, "helpfulness": "0/1", "author": "Rayasam Sridhar"}, {"rating": 4.0, "review": "I like this product a lot, watching stuff over TV with almost no effort is awesome. I would have loved it if I had a way to cast the entire screen of my PC or Mac. Now that casting entire screen is there on Android, I hope to see the same on other OS and HW. One issue I have seen is with casting live HD streams to TV via Chrome, ie MotoGP. Even though the video was smooth on PC, it was a choppy with lags on TV. I am not sure whether I needed an .11n network or some minor fine tuning somewhere, but I had to switch back to cable to watch the stream on TV. Good product though! Thanks Google...", "verified": true, "helpfulness": "0/0", "author": "Gorkem Canverdi"}, {"rating": 5.0, "review": "I love it!!!!", "verified": true, "helpfulness": "0/1", "author": "temiko zhorzholadze"}, {"rating": 5.0, "review": "perfect packing", "verified": true, "helpfulness": "0/1", "author": "kaspar"}, {"rating": 4.0, "review": "To couple of days to get the casting working...", "verified": true, "helpfulness": "1/2", "author": "Sathish"}, {"rating": 2.0, "review": "Good in theory but poor in operation. It plays everything but amazon prime. You have to control it from your mobile device. Thats not too much of a problem but it is when hulu and amazon disconnects from it. It happens a lot! You cant pause then play again. I have to restart the device by unplugging and plugging it back in. Switching back to my roku. Hulu and netflix can never find the chrome cast so i constantly have to restart the app. Its a huge hassle,", "verified": false, "helpfulness": "0/0", "author": "Leonamazon"}]