[{"rating": 1.0, "review": "Very few apps available. Your better off with something else like Apple TV or roku. I hope Amazon gets on the ball!", "verified": true, "helpfulness": "8/15", "author": "Joseph A Esquivel"}, {"rating": 3.0, "review": "I love the speed but they need to make it easier to turn off apps and an option to turn fire tv off. It stayed on for an hour after i turned off the tv because an app was on.  Also amazon you have to have vudu on fire tv, flixsters non hd playback is a deal breaker if i had knowledge of this i would have bought roku.", "verified": true, "helpfulness": "1/2", "author": "Erin \"elash\""}, {"rating": 4.0, "review": "The unit is exceptionally easy to install, the voice activated remote is awesome and is smart enough to understand accents! The one downside is that u need multiple units if u have more than one t.v. In your house, also a large number of movies that u can get at redbox for a dollar are a lot more expensive on amazon streaming", "verified": true, "helpfulness": "0/1", "author": "Lisa Lidston"}, {"rating": 1.0, "review": "Doesn't work.  Keeps freezing g up...claims it is my internet connection, but I have no problem with my wii internet connection.", "verified": true, "helpfulness": "9/16", "author": "Dolores W. Napello"}, {"rating": 5.0, "review": "Absolutely love this device! I have Apple TV and ROKU. This is by far the best of the three. Picture quality is fantastic! Don't just take my word for it. You won't be disappointed.", "verified": true, "helpfulness": "1/2", "author": "fthebaggers"}, {"rating": 3.0, "review": "Once it gets the TWCTV app and access to my Amazon music, I will change this to a 4 or 5. No complaints otherwise about either the hardware or software, just needs more apps.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great so far!  Seems a bit faster than Apple TV.  The sound quality coming through is also excellent.  I hope this is a home run for Amazon.", "verified": true, "helpfulness": "0/1", "author": "J. Magdic \"Joe\""}, {"rating": 3.0, "review": "If you don't have Amazon Instant Video then you may not like this. Netflix, etc. are buried in the menu and options. Also voice feature only works with Amazon Instant.....and that's not made clear in all their hype. Video performance is very good and remote is user friendly although it would be nice if it was back lighted..", "verified": true, "helpfulness": "1/1", "author": "digitaldaryl"}, {"rating": 5.0, "review": "Easy to set up and use! I only wish it would record tv shows.Still need to explore the other sites offered.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "So much better than Apple TV. Or any other set top box out there. Apps are integrated, voice recognition, size is perfect.", "verified": true, "helpfulness": "0/3", "author": "Mark Twain"}]