[{"rating": 4.0, "review": "Good start for an all-encompassing media player, especially when you can hook it up to the cloud. But, I sense things can start to get expensive if you end up buying everything offered. For now, just sling TV and Prime. Down the road, it'd be great if local channel streaming is available for free too, otherwise I have no access without resorting to antenna.", "verified": true, "helpfulness": "0/0", "author": "joe@ca"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "Annette Gadd"}, {"rating": 5.0, "review": "Love the quality of the picture, the controller is small and easy to use, rewind and fast forward is much easier than my blue ray player's controller. Amazon Fire TV is always ready, doesn't require time to turn on and load. Very happy with my purchase.", "verified": true, "helpfulness": "0/1", "author": "AM"}, {"rating": 1.0, "review": "Not what I expected. Waste of money.", "verified": true, "helpfulness": "0/9", "author": "joseph maloney"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/2", "author": "Daniel F. Janssen"}, {"rating": 5.0, "review": "its just Awsome", "verified": true, "helpfulness": "0/2", "author": "farid"}, {"rating": 3.0, "review": "I chose the Amazon Fire TV over the Roku based on some of the other reviews I've read and I have buyer's remorse. It's a good product and does its job for the most part... but the features that's supposed to make it great like the voice search is pretty much useless. Let's say you want to watch French Connection which happens to be on Netflix and you do a voice search for it. The only results you would get is to buy it or rent it from Amazon. This also applies to the non-voice search (typing in with the remote).My other beef with the Fire TV is the lack of apps. Most of the over 100 apps that are available are pretty much useless. There are probably a dozen that I would consider useful and they all require a paid subscription such as Hulu, Netflix and Sling. The games that are available are not that great. They're pretty much similar to the free games you would get for your smart phone or tablet. Why would you want to use your tv for a mediocre game when you can buy a PS3 or Xbox for around a $100.Another issue I've recently run into is that there is terrible lag when using the remote and the home button does not work consistently. It makes the experience of using the remote very unpleasant.I'm giving the Fire TV 2 stars for functioning but I'm very impressed with it.", "verified": true, "helpfulness": "3/3", "author": "Izzy \"insung@huntdesign.com\""}, {"rating": 5.0, "review": "Works great, allowed me to replace a full size desktop \"HTPC\". I purchased the Fire stick first to stream movies and tv from my Plex server. The wireless network or the firestick's hardware wasn't up to the challenge of some of my 1080p videos so the Amazon Fire TV was put to the test. It hasn't stuttered on anything I throw at it. Plex, SlingTV, PlutoTV, or amazon prime TV. Great little device.", "verified": true, "helpfulness": "0/0", "author": "Mr. Smith"}, {"rating": 4.0, "review": "It does what it is supposed to do. Hookup is simple, Operation is intuitive. What more could you ask for?", "verified": true, "helpfulness": "0/0", "author": "Charles W Armbrust"}, {"rating": 2.0, "review": "We were thrilled to watch 2 season's of orphan black!!  Were disappointed to have to pay for each episode in season 3...we cancelled watching and went back to Netflix!!!", "verified": true, "helpfulness": "1/2", "author": "Judy Sheldon"}]