[{"rating": 5.0, "review": "I upgraded to the Fire TV from the Fire TV Stick and I'm glad I did.  The Fire Stick worked pretty well, but I had constant issues with WiFi on it.  Amazon content played great, but Hulu and Netflix stuttered quite a bit.  I would switch over to my Chromecast and watch with no stutter issues so I had to lay blame directly with the Fire Stick.  With the Fire TV, I was able to use a wired connection and I have had zero problems with stutters since.It is also noticeably faster than the Fire Stick.  Blazing fast in fact.The remote is longer than the Fire Stick remote and has a different feel to it.  More of a grippy material.  It's nicer all the way around.The voice recognition works great and it is much more useful than I thought it would be.  I can say a show title and it will display results that include Amazon content (of course), but it has also displayed other services.  My wife wanted to watch The Bachelor so I simply said, \"the bachelor\" into the remote and it pulled up the results with a \"watch on Hulu Plus\" tag on the image.  I selected it and away we went.  It was perfect.The only negatives are the some of the same as the Fire Stick:I want a power button.  I have to go into a menu and select \"sleep\" to get it to turn off.  This is a problem for me because it hijacks my TV input and receiver and automatically switches to the input with the Fire TV/Stick in it when I power on the TV.  It only stops when I put it to sleep.The power on indicator on the Fire TV is sooooo bright in a dark room.  It might not annoy most people, but it really bugs me.I wish you had the ability to pin apps.  If you watch shows across Hulu, Netflix and Amazon, plus listen to music then your recent apps list can fill up fast.  Amazon makes it easy to find their content, which I get, but I want a more easier way to access my favorite apps.Other than those few gripes, it is a great streamer.  I disconnected my Apple TV's and Fire TV will be my primary streaming box going forward.  I will still keep my Chromecast for Vudu until Amazon decides to join Ultraviolet.  When/If that happens, then Amazon is where I will buy all my digital movies.UPDATE 2/23/15This weekend I had my first issue with my Fire TV where it started slowing down.  Moving between apps or episode selections had a long pause.  Selecting the Home button caused a long delay followed by the menu only partially showing and no images.  Once you selected an app or video it played fine, but going back to home caused delays again.  I finally unplugged it and it rebooted.  That solved the problem.  It is something I will keep an eye on.I also bought my first digital movie from Amazon and it worked flawlessly.  The kids wanted to watch Big Hero 6 and I bought it and was watching in seconds.  I'm old school and prefer to have a physical copies of movies that I own, but I do enjoy the digital version and actually end up watching them more.  It's just more convenient.  So, even though I hesitated buying it instead of waiting for the Blu Ray, it was a pleasant experience and is something I can see myself doing more.", "verified": true, "helpfulness": "1/1", "author": "Troy Lyons \"troythegeek\""}, {"rating": 1.0, "review": "I had a very disappointing experience with Fire TV. I received the box and set it up; setting it up is easy and problem-free. Everything went well, I could scan the menus and use voice-command through the remote ok. A couple of days later, I went to watch a movie and the box was completely dead. The TV screen just flashed \"No Signal\" and there was no life coming from the box. I tried restarting, unplugging the cables and then plugging them back in -- nothing. I ended up returning it for a refund. I don't know how typical my experience is with other buyers, but I thought I should share it. Had it worked, I'm sure I would have given it a 4 or 5 star review. I have a Kindle Fire that I love and use all the time. I'm just unlucky with TV boxes, I guess.", "verified": true, "helpfulness": "3/4", "author": "Robert R Evans"}, {"rating": 5.0, "review": "Can't say enough good things about this product.Easy to set up.Easy to useLots of choices from movies, to music and more.The new voice remote makes it even simpler to use.LOVE IT !!!!", "verified": true, "helpfulness": "0/0", "author": "ladyexzom"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Gina"}, {"rating": 3.0, "review": "Like the voice command and sound quality of the device, but they don't have a deal with Hbo go, showtime, or max go with Charter cable so I lose out on a lot of movies and shows. Same is true with apple tv.  Only Chromecast and Roku work with Charter on the go services", "verified": true, "helpfulness": "0/0", "author": "The Mort"}, {"rating": 3.0, "review": "It's a good Device but is lacking apps like The CW, Nbc, Abc, Fox, Cbs and so on.If it had more apps I will give it a five star.", "verified": true, "helpfulness": "0/1", "author": "Joe Masucci"}, {"rating": 5.0, "review": "Surpasses my expectations in both technical performance and variety and abundance of programming.", "verified": true, "helpfulness": "0/0", "author": "Arlene"}, {"rating": 5.0, "review": "The best tv ever.", "verified": true, "helpfulness": "0/0", "author": "Dennis Booth"}, {"rating": 5.0, "review": "Allowed us to ditch our XBox Live subscription so we now access Netflix, Amazon Prime, YouTube, and other services through this.  The voice interface is the best of any device I have ever owned, it actually knows what you are asking.", "verified": true, "helpfulness": "0/0", "author": "mb30004"}, {"rating": 5.0, "review": "I love my Fire TV so far! We have only had it for a week, but I am loving it. It is so easy to use and a lot to choose from.", "verified": true, "helpfulness": "0/0", "author": "Laura Harrington"}]