[{"rating": 5.0, "review": "Google chrome cast never fails me.  I've purchased 5 chromecasts now. Everyone I my family has 1. Cheap buy for what it does. You can use your laptop or your android/apple device to connect and watch YouTube/Netflix/Hulu etc without wasting your phone battery. Easy to use and install", "verified": true, "helpfulness": "0/0", "author": "Mai le"}, {"rating": 5.0, "review": "Where have you been my whole life, Chromecast?", "verified": true, "helpfulness": "0/0", "author": "Jane"}, {"rating": 1.0, "review": "You may not have this problem, but when you try to connect your chromecast to your computer, only then do they tell you that it can't be more than 20 feet from your computer.  So the signal from this device must not be nearly as strong as your WiFi signal'  So I have a $30 piece of electronic junk.  I'm about 25 feet away and cannot change that.", "verified": true, "helpfulness": "1/1", "author": "Jerry Rutledge"}, {"rating": 5.0, "review": "got a few of these so my kids could stream netflix at school.  Easy to setup and does a good job", "verified": true, "helpfulness": "0/0", "author": "KieferC"}, {"rating": 5.0, "review": "Can't beat it for the price!!", "verified": true, "helpfulness": "0/0", "author": "Steffan"}, {"rating": 5.0, "review": "Great value, works great, bought it again", "verified": true, "helpfulness": "0/0", "author": "Vincent Campagna"}, {"rating": 1.0, "review": "I am NOT TECH SAVVY, sooo with that being said, I never figured the thing out, for me it was a waste of money. I watched the video, I youTubed it, installed it, installed the app, re-installed it, and still nothing that made any sense came out of it. I am not saying it is Chromecasts fault, but it is back in the box and the only \"casting\" I am doing is when I am fishing. I quickly decided still my computer with a HDMI cable was the best option for me to stream to my television...", "verified": true, "helpfulness": "0/0", "author": "L. Jamieson \"Larie724\""}, {"rating": 4.0, "review": "Overall I think it is good product. For the price point it is a pretty good value.Setup: It is fairly simple to setup. it needs a USB power so it needs to be plugged in USB slot on TV or power cord provided.Positives: small form factor. Easily hides behind or to side to TV.There are a lot of apps it works with like Netflix and YouTube for Apple iOS or android.Negatives: does not work with Amazon prime which is unfortunate especially for prime members. not surprising since Amazon has entered the marketplace with very similar product. It does not work with HBO now but HBO has said it will in near future.It lacks some of the bells and whistles of  Roku , Apple TV or Fire stick but it is good value for money.", "verified": true, "helpfulness": "0/0", "author": "Sean C."}, {"rating": 5.0, "review": "The chromecast has become a staple in my living room. I have also converted my parents living room to revolve around their chromecast. I use my Nexus 7 tablet (any phone / tablet / computer will cast) to essentially turn my television into a smart tv via the chromecast. It is extremely easy to set up and has been fairly reliable for me (the most you'll have to do is reset it if something goes wrong). I have experience in software development and I am a Google fanboy. They are working toward a very convenient, very responsive, and very affordable \"Google ecosystem\" that I use across all my devices. This is a great addition to your home, even if you never use Google products. My sister can cast from her iPhone and as they develop their software, it will be easier and easier to use. The device now supports \"guest mode\" which is really nice for entertaining.", "verified": true, "helpfulness": "0/0", "author": "Adamm Hockman"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "luis barbecho"}]