[{"rating": 1.0, "review": "for them to address these 3 deal breakers.  No HBO GO, Youtube, and Amazon MP3, no purchase.  The commercial is filled with Game of Thrones, Boardwalk Empire and VEEP but it does not have HBO GO?!?!  Why is it so hard for streaming systems to get Youtube?  And not having your own MP3 app in your own streaming product is just terrible.  I can't get all 3 of those things in the Roku 3.  Trust me I'm a big fan of Amazon, but they really need to get this thing right!UPDATE: 5/19/2014So I did end up buying one and now I can say \"can't wait...until the next version comes out\" because this one is going back.  Still no HBO Go, still no Amazon MP3.  Plus i'm having issues with the sound on mine, unless I reboot the system perfectly, it sounds like its coming through a string and a tin can.  I also had the remote batteries die after about a week.  And one other issue or complaint, when buying TV shows I wasn't given the option to buy them in standard definition, it defaulted to HD and cost me $1 more.I love Amazon and I am confident that the next version will be 100% better!  Can't be any worse!", "verified": true, "helpfulness": "3/16", "author": "JEFFREY DOYLE"}, {"rating": 2.0, "review": "Some would even call it a deal killer.  The unit is unable to play DLNA or local USB storage content.  Similar to the Google Chromecast, this is primarily a cloud streamer.  Plex is the closest app available to a DLNA client but it still not quite the same.I'm hoping Amazon enables these features in a future update.  Till then, I'm just not able to recommend it.", "verified": true, "helpfulness": "103/126", "author": "atoy74"}, {"rating": 3.0, "review": "The facts:(1)  Fire costs $65 more than Chromecast.(2)  For apps that actually matter, Fire and Chromecast have basically the same app support.(2a) Fire has Showtime and WatchESPN, Chromecast has HBO... I see this as draw... If you're using this with your home TV, then you'll likely just use the OnDemand feature thru your cable provider.  That said, WatchESPN is a cool thing to have, but HBO has better shows that Showtime. Also, I can guarantee you that WatchESPN will have full Chromecast w/in the next 6 months.(2b)  Let's be real, people mainly use these devices for apps not available thru cable/dish (Netflix, YouTube, AmazonVid).  AmazonVid as it stands, is a second-rate product.  I have Prime and I still NEVER watch it.  Netflix is the prize possession for any of these devices...and all of them have it.(3)  Speach recognition... cool, but totally unnecessary.  If it doesn't work perfectly 99% of the time, it's worthless.  Since I'm a betting man, I'll bet it doesn't.(4)  Fire uses a standalone remote; Chromecast utilizes the smartphone you already own.(5)  Preloading shows you're likley to watch is a nice feature, but waiting 5 seconds for the Chromecast to load a show isn't even approaching inconvenience levels - frankly, I don't even notice.(6)  Both play video in full 1080p HD(7)  Games... who cares?!  If you're buying this for games you should probably just get an iPad instead.(8)  Chromecast will be rolling-out support for casting the Chrome browser from your iPad shortly... as it stands you can cast your Chrome browser from your computer to you TV.  You cannot do this at all with Fire.(9)  Set-up / Start-up couldn't be easier with the Chromecast.  Plug it into your TV, download the app, run it one time to sync the internet and you're done... for good.  You can even take it out and plug it into a new TV and it will work instantly.So... do any of the 'advantages' of the Fire outweigh the cost difference?  You be the judge, but to me it's a pretty clear NO.", "verified": false, "helpfulness": "0/15", "author": "David A Stucky"}, {"rating": 4.0, "review": "I love how small this box is and set up was a breeze and best of all I can talk to it and it listens!! What stopped me from giving it 5 stars though was 1. No volume control on the remote. I have a soundbar hooked to my fire tv, but I have to use the actual sound bar remote for volume control. Would have loved volume control/mute button of some sort. 2. Better parental controls. The parental settings are basically all or nothing. I wish I could block my kids from certain ratings such as pg-13 or R. If the parental controls are on for amazon prime tv you have to enter a pin everytime they watch anything! I'd like to put one of these in my sons room but not until they perfect that. Netflix uses a pretty good parental control. I'm really excited for the upcoming free time app for the fire tv. 3 more channels or apps would be nice but I'm sure those are coming.  Overall I love it just as I have loved the kindle fire tablets.", "verified": true, "helpfulness": "1/2", "author": "muscrat"}, {"rating": 4.0, "review": "I am a techno junkie.  I have had various versions of the Roku (which I love) and this is the first time trying something different.  I am really enjoying the Amazon Fire Tv.  One down side, the batteries that came in the box, freshly wrapped, were bad, so the remote didn't initially work.  I had to replace with my own batteries (mass produced in China I guess).  Once I got some good batteries installed, it was very easy to get up and running (I think easier than the Roku's I have owned but they at least gave me good batteries).  The remote and responsiveness of the system is great and much more user friendly to handle I think.  If you are not a game player, stick with Roku, the price is right and its a great device.Anyway, if Amazon throws in some free perks with Amazon OnDemand throughout the life of the device for those who have it, this would make it the device to have.", "verified": true, "helpfulness": "0/2", "author": "Diana R. Dixon \"diamonda\""}, {"rating": 5.0, "review": "I'll type this as I start with the Fire TV. My comparisons will be drawn between this, the Chromecast, and the Roku (previous generation).First impressions:The packaging is top notch. The care and detail shown really is representative of how far Amazon has come as a consumer electronics company. The packaging is tight, protective, and not the least bit wasteful. It's every bit the equal of an Apple product. The Fire TV itself is a small, non assuming black box (with matte finishes on top and bottom and polished around the other four sides). The remote, being bluetooth, doesn't require line of sight. So I've tucked my Fire TV in behind the wall mounted TV. But the box itself would fit in well anywhere you set it. It's a nice looking piece of kit.The remote is about the same size as a Roku's remote, with similar button layout. It's a bit thinner overall than the Roku remote, so it doesn't feel as sturdy in hand. For my office TV application the bluetooth controller is perfect, but I feel the lack of an IR capacity greatly hampers the Fire TV's ability to integrate into a home theater or living room (where I view a macro-enabled universal remote as a necessity).First boot it downloaded an update, then there was a very good introductory video (that cannot be skipped as far as I could tell). The animated introduction shows how to use the basic features of the Fire TV, with a focus on the voice activated search functions.Going through the menus, I noticed that it came pre-setup for my Amazon username. This is essentially the same as when you buy a Kindle (unless you specify a gift option), so all my Amazon Prime media was already to go within 5 minutes of opening the package.The menus are quick and have nice, smooth transitions. You can easily see speedy processor powering this box. ADB debugging is an option, so I'm hopeful the hackers make quick work out of this. I'd love to be able to run old school video game systems on this and use the Fire TV's optional game controller.The screensaver, enabled by default, features very Chromecast-esque nature and architectural photos. Being a fan of the Chromecast's screensaver, I like the Fire TV's as well. I did have to change the transitions (the pan & zoom option quickly gave me a headache) to dissolve (very similar to Chromecast).Downloading apps is a breeze, similar to working with the Amazon App Store on a Kindle (or the equivalent on Android or iOS). It appears as if you get free \"coins\" to spend on apps. I've got 400, which I don't recall ever buying or otherwise procuring. One nice feature, is in the apps listing it tells you what accessories are supported. So you'll know before buying if it'll work with the game controller.I use Amazon, Netflix, and Plex for all of my online and local content viewing. These apps were as easy to get linked to my accounts as they are on the Roku or portable devices. Plugging in a USB keyboard will make your life so much easier.Netflix asks if you'd like the \"normal\" or a Netflix Kids version on first boot. It's also worth noting that on initial setup of the Fire TV, there's the option of enabling parental controls.The Plex app is essentially the same as available on Android when you select the TV experience. No complaints, it's a solid app that performs well. Video quality was good. It appears slightly more grainy than that fed to my Roku or Chromecast, but not absurdly so.Overall:From my first impressions, the Fire TV appears to be a solid piece of hardware with a solid android-based software front. I like the inclusion of a remote (my largest complaint with the Chromecast) and the wide app support (it has everything I want that the Roku uses, but nowhere near the total number of \"channels\" available). I dislike the integration possibilities with the lack of a IR remote option, though I suspect the hacker community will come up with some options here.I tried a generic Windows Media Center remote and receiver into the USB port on the Fire TV, since a standard keyboard worked, in the hopes of getting at least some IR functions to no avail. It didn't work. So simple \"hack\" #1 out the window.***1 Month Later***So I've been using the Fire TV for a month now. I've used it almost exclusively with the Plex app, as that's where I do most of my viewing.The factory remote is superb! The Fire TV device itself has operated flawlessly. It is speedy, plays my media well, and has given me no issues whatsoever.My foray into finding a way to control it via IR has led me to three suitable approaches:I initially tried an old MCE remote and receiver that I had lying around. It didn't work. However, the http://www.amazon.com/gp/product/B00224ZDFY/ref=oh_details_o03_s00_i00?ie=UTF8&psc;=1 remote and receiver works. It provides access to all functions except the menu key. That is a key that I needed access to, since it's the only way to refresh the Plex app.Second, the Fire TV supports HDMI-CEC. So I can use the television remote to control the Fire TV's very basic functions through the TV remote. This has it's limitations in that the fast forward, rewind, and menu options were absent. So this was out.Third, I tried the FLIRC device available here http://www.amazon.com/gp/product/B00BB0ETW8/ref=oh_details_o02_s00_i00?ie=UTF8&psc;=1 It's slightly more expensive than the MCE remote, and requires some setup (the setup software and device are cross-platform), but has led to a complete replacement capacity for the factory remote's functions. You can even program in a voice search key (which obviously needs the microphone).I think the added ~$30 for IR integration is unfortunate, as it prices this considerably higher than the closest competitor in the Roku 3. However, the combination of the Fire TV (the smoothest, nicest player) with IR integration leads me to say that this pairing is the best home theater streaming device available today.", "verified": true, "helpfulness": "3/3", "author": "M. Barland"}, {"rating": 3.0, "review": "I was REALLY rooting for Amazon on this one, but I think they stumbled at the finish line. This is not an Apple TV or Roku killer. It's simply a respectable choice for anyone who has Amazon Prime and wants to watch that content on TV. What's most offputting is that the device needed a major update out of the box on the first day of release. Talk about a joy-killer! I let the box update itself while I went out for dinner, and thankfully didn't have to sit through the annoying introductory video. Once I got the box up and running, I was surprised to discover that you have to download apps like Netflix and HuluPlus - just like you would on a Kindle. That's not a deal-killer, but it's another buzzkilling waste of time. Once I got the device fired up and running, video looked nice when it played, but there were many little buffering pauses - way more than I'm used to on my Apple TV. The brightest spot is the remote and the voice search - which really works surprisingly well! Wish the same could be said for the Fire TV itself. All things considered, it seems this box is just a wee bit overpriced. For my money, it's okay ... just okay.", "verified": true, "helpfulness": "4/5", "author": "MeDC"}, {"rating": 3.0, "review": "Not sure if understand why Amazon would spend loads of cash to design their own device to do things scores of other devices already do. Plus it's trying to double as a closed source low end gaming device as well. OUYA is already available and its a more open OS. I think they are getting a little too confident.", "verified": false, "helpfulness": "2/4", "author": "Nitrixx \"nomad\""}, {"rating": 4.0, "review": "I received the Fire TV and set it up here are a few impressions:1. I REALLY hate the tight plastic wrap everything comes encased in today.2. I also REALLY hate video instructions and I HATE that the introduction video cannot be skipped or exited no matter what. Setup was so EASY that the need to force that inane video upon us is just absurd.Those are now over with and should not be counted very much against the Fire TV3. The Amazon app is, in a lot of ways, MUCH better than the Roku's but it is a little less intuitive about how to get to what you want to watch and, as I suspected, the voice search does work but it is not of value for me. The FF/RW etc in Amazon are, well, weird.4. I installed Plex and I have carefully set up the server and I have tested it and find that it is OK. I also tested the RARflix alternative to the Plex channel on the Roku. RARflix on the Roku is vastly superior to the actual PLEX channel on the Roku. The PLEX app on the Fire is also vastly superior to the PLEX channel on the Roku. The RARflix channel on the Roku is slightly superior the the PLEX app on the FIRE. Those are just my observations based on a couple of hours fooling around with PLEX on the Fire. BTW: I could not see if there is a way to auto-advance to the next show/movie on the FIRE app but the Roku channel (RARflix) does have a way.5. The apps available are quite limited as others have noted.6. Remote usage is a bit non-intutive in a number of screens but I am quite sure I will get used to it.7. The device seems rock solid and at no point, so far, have I felt that it was slow or about to lock up.8. It is very quick.", "verified": true, "helpfulness": "2/6", "author": "J. Turpin"}, {"rating": 5.0, "review": "I have just about all these boxes and the current generation of APTV and ROKU3 work perfectly. The Fire Tv clearly shows in its stellar performance. ROKU still has the widest selection of any hands down with almost perfect performance.I am hoping these is more to come that will make it stand out in overall selection.The installation was flawless - but I have learned to follow the instruction sequence and wait til it is all done and not interrupt it.The audio search worked fine for me and seems limited to Amazon for now. I liked it and I have never been pleased with SIRI but search etc. for SIRI is a lot more complicated than searching this limited database.", "verified": true, "helpfulness": "2/4", "author": "Zeb \"zebra01\""}]