[{"rating": 5.0, "review": "Just used it for first time this weekend..it is awesome..love it..for the cost and yearly service it will save so much money on rentals..cable etc", "verified": true, "helpfulness": "1/1", "author": "pati \"pati\""}, {"rating": 2.0, "review": "While the voice search concept is just phenomenal, the lack of support for other services is a big Debbie Downer for me.I am using multiple services in my quest to wean myself off of cable TV and I want a device that is open to all services that can meet up to Amazon standards. I am just talking about voice search, in case anyone was wondering but I would like other services to be added such as Aereo, Red box etc...As for other issues, the box will lock up on me occasionally forcing me to pull the plug. Not good.Video output will sometimes freeze or be choppy and I can hear audio but get no video.Brand new HDMI, verified to work on multiple devices so I know its not the cable itself.I am on FiOS 75/25 so I know speed is not issue and I tried running my Roku box and my  network TV without issue.So there's a problem with the Amazon Fire box.", "verified": true, "helpfulness": "3/4", "author": "Charles White"}, {"rating": 3.0, "review": "I have it a 3 out of 5 because although I like how the box works, the fact is that the majority of movies that I want to watch are not free on amazon prime but are free on Netflix.  In addition, every time I turn the box on, I have to reset my router so it can read it and now my Netflix would not work with this box.  Other than that, I like the features such as voice activated search and the fact that you can sign in to your other apps such as Pandora, iradio and Netflix (when it works).", "verified": true, "helpfulness": "2/3", "author": "Margarita"}, {"rating": 3.0, "review": "Netflix works great but utube is fine but not great and plex is the pits.  Maybe I need to update plex.", "verified": true, "helpfulness": "0/0", "author": "Ilene Valdez"}, {"rating": 5.0, "review": "This was a very wise choice for us.  The search engine is very effective and the choiced picked by the Amazon Fire after you watch a movie are very intersting and pleasant.  Very satisfied and happy with the Amazon Fire TV.  Congratulations!", "verified": true, "helpfulness": "0/0", "author": "Halil"}, {"rating": 5.0, "review": "I saw this product at a friends house and was intrigued enough to buy it.  It is really great!  I had no idea that my TV could look or sound so good and the selection of content is out of this world.  Set up was a breeze, it is intuitive to use and the voice control works weirdly well.  My only complaint (such as it is)? It would be nice if it came with HDMI and Ethernet cables.  As soon as EuroSport or beIN are available I am going to say good-bye to HBO and the rest of that crowd and use the savings to fund my granddaughter's college education.  Here's to compound interest and here's to Amazon!", "verified": true, "helpfulness": "0/0", "author": "Gordon Haber"}, {"rating": 1.0, "review": "The Amazon Fire TV did not work. Customer support asked me to get another HDMI cable. I purchased a $30 cable from Best Buy. It did not work either. Called customer support again. This was an awful experience. He asked the same questions over and over. I finally spoke to his supervisor, who agreed to send a replacement. Got the replacement today and hooked it up using a third HDMI cable. This cable works fine to connect my grandsons' X-Box to my TV. When the replacement was set up with power cable and HDMI cable, It still did not work. I am unable to get a Home Screen. Since I ordered the Amazon Fire TV for my grandsons to use while they were here, it is pointless to try to get a replacement. I received the first one on Friday 20 June. The second arrived on Monday 23 June. By the time I get a third one, it will be almost time for them to leave. All products purchased previously from Amazon have been great, so I was confident that this would be good as well. I've lost some faith in Amazon for sure.", "verified": true, "helpfulness": "3/4", "author": "Nancy Shonk"}, {"rating": 3.0, "review": "I was looking to decrease the cost of my overall cable bill. What I found is once you sign up for services such as Netflix and others you still have to pay more than your monthly subscription to get programing overall not a huge savings  I did like the on demand but not for me at this time", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I own a Roku player and find this device to be better. It is very user friendly and the interface is so simple that even a caveman could use it. I love when the device is on for a while the lovely nature backgrounds come up and they are ever so peaceful. I have left the device on just so I could fall asleep to the beautiful pictures. The clarity is awesome and fits in with the Amazon brand.", "verified": true, "helpfulness": "0/0", "author": "C. Calloway"}, {"rating": 5.0, "review": "i have had the fire tv now for several weeks and am very pleased with it's performance, easy to connect. i also have amazon prime along with netflex. there literally is no wait time to strem movies and tv shows in. i definately would recomend the fire tv.", "verified": true, "helpfulness": "0/0", "author": "john samberg"}]