[{"rating": 5.0, "review": "Alright it's Christmas morning and I've already gotten into that bottle I got into last night. You guys know what I'm talking about. Am I right? Anyway, this Chromecast is cool. I got a big TV at Wal-Mart for one of them Black Friday deals. I only go to Wal-Mart once a year. You just plug this Chromecast into the HDMI input and it sets up quick. Walks you right through it. Holding your hand like a child. For all you technologically impaired peeps, it's easy to setup. Download the app and then it connects to Wi-Fi. Send it from your phone to the TV. Done. Netflix, YouTube, don't worry about it. Real quick, no big deal. Just do yourself a favor and buy it.", "verified": true, "helpfulness": "0/0", "author": "VampireMaster"}, {"rating": 2.0, "review": "It was fine and pretty good for some time in my first apartment, it used to work perfectly but when I moved to another place it just stopped working for unknown reasons. I'm a software developer myself so I'm a tech savvy therefore I know what I'm talking about. I think it is still immature product and can't compete with Roku or Apple TV for example.Maybe Google should make it more expensive but reliable.", "verified": true, "helpfulness": "0/0", "author": "Michel Eissa"}, {"rating": 4.0, "review": "The Chromecast is brilliant in its low cost and simplicity.  As soon as this product was announced, I bought several for various TVs and they are all still working great. They will be replaced, however, by Fire TV Sticks not because there is anything wrong with the Chromecast... but because the Fire TV Stick is simply a better, newer product that does much more.However its not perfect in that sometimes the connection between device and dongle will cut out rendering you helpless in trying to control one from the other....I view this as a small complaint for a small $35 device.  It is simple and it does what it's supposed to. That being said, as much as I really do like the Chromecast, I simply cannot recommend it over the Fire TV Stick which does all that this does and more.The Fire TV stick is another great alternative.", "verified": true, "helpfulness": "1/1", "author": "Scott"}, {"rating": 3.0, "review": "Works great with most applications.  Having issue with Dishanywhere video.  The video doesn't want to display  Any suggestions?", "verified": true, "helpfulness": "0/0", "author": "rparkernay"}, {"rating": 5.0, "review": "very easy to set up, even if your computer illiterate.", "verified": true, "helpfulness": "0/0", "author": "cpettymore"}, {"rating": 5.0, "review": "Does what I needed.  I wanted something to stream my pictures and your tube to the tv.  It works for that without any problems", "verified": true, "helpfulness": "0/0", "author": "bill"}, {"rating": 4.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "JOSE M DE LA MOTA"}, {"rating": 5.0, "review": "Exelent!", "verified": true, "helpfulness": "0/1", "author": "Gonzalo Cáceres"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Rodrigo"}, {"rating": 3.0, "review": "Doesn't work with Amazon Prime well, requires a powered plug, sketchy support for things and limited by the power of your phone, even my LG G3 doesn't run stuff that well. Still, pretty cool and cheap and does mirror the screen well. Get Plex and stream content off your PC to the TV with ease too!", "verified": true, "helpfulness": "1/1", "author": "Brian Lee Jones \"ShotGaming - Gaming under the influence\""}]