[{"rating": 5.0, "review": "YouTube, pandora, Netflix, lots of great things to stream, cuts our cable bill!", "verified": true, "helpfulness": "0/0", "author": "Cassandra Bader \"Abyss327\""}, {"rating": 5.0, "review": "Streams Netflix with ease, no long cords", "verified": true, "helpfulness": "0/0", "author": "Matt Schleicher"}, {"rating": 1.0, "review": "Lag and Delay... These words precisely describe the product's operation. For me, it feels like the Chromecast was made for the sole purpose of watching short movies or casual stuff in low resolution - typically YouTube or FaceBook stuff. It is really impossible to watch an entire movie, of 1 hour duration or more, without getting major frame skips, lost of audio sync and/or lost of subtitles sync. Plus, the feature of 'casting over Google Chrome browser' - that should get rid of the product's already limited compatibility with other low-end video streaming sites - doesn't work well enough, only adding the complains I have stated before. Bottom line: Not worth buying it.", "verified": true, "helpfulness": "0/0", "author": "k_recao"}, {"rating": 5.0, "review": "Easy installation", "verified": true, "helpfulness": "0/0", "author": "Lora Brunner"}, {"rating": 2.0, "review": "not as cool as I thought, lots of channels out there wont transmit to it.", "verified": true, "helpfulness": "1/1", "author": "Jay Wycoff"}, {"rating": 5.0, "review": "Very good product, easy to install and use frendly.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Capponi"}, {"rating": 1.0, "review": "Product does not recognize my WiFi. w", "verified": true, "helpfulness": "0/0", "author": "SIM"}, {"rating": 4.0, "review": "Cast whats on your laptop, pad or Smartphone straight to your TV.", "verified": true, "helpfulness": "0/0", "author": "Michael R."}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "lisa"}, {"rating": 4.0, "review": "It does what its intended to do. The only reason I'm rating it 4/5 is every so often it will randomly disconnect. It doesn't happen often but it happens. Still a great device and I use mine almost everyday even if its just to watch a youtube video in the background.", "verified": true, "helpfulness": "0/0", "author": "Donato"}]