[{"rating": 1.0, "review": "Is not compatible wit my Centurylink Wifi. Will send back if it won't work.", "verified": true, "helpfulness": "0/1", "author": "Ron S."}, {"rating": 3.0, "review": "Not much more applications for what it is itself. Could have some tiny O.S", "verified": true, "helpfulness": "0/0", "author": "Rodrigo"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Dennis Mcauley \"dmcauley46\""}, {"rating": 1.0, "review": "We bought three of these, and while the idea is good, they are buggy at best. Needless to say it is incredibly frustrating having to stop and start your work out all the time because chromecast drops the signal.  We will be returning all three.", "verified": true, "helpfulness": "0/0", "author": "John Ennis"}, {"rating": 1.0, "review": "Too laggy and can't connect it to my faster phone Hotspot", "verified": true, "helpfulness": "0/0", "author": "Jon Thomas"}, {"rating": 2.0, "review": "Kinda weird.  Works, but hey it's cheap.", "verified": true, "helpfulness": "0/0", "author": "MarylandY's"}, {"rating": 5.0, "review": "yes", "verified": true, "helpfulness": "0/0", "author": "enrique"}, {"rating": 5.0, "review": "Works great. Fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Josh Morris"}, {"rating": 4.0, "review": "The more I use it, the more I like it.  Works really well with my Android tablet, and works OK with my laptop.  Worth the money if you are watching lots of streaming media from the internet or your own media server.Unfortunately, it seems like I have to stop and start more often than I like when streaming from web sites other than YouTube from my laptop.Update: The Chromecase definitely works much more smoothly with an android tablet than it does with a lap-top. I'm now using a small tablet as the control center for my entire media setup!  That's nice.  So, if I could up the review by 1/2 a star, I would.", "verified": true, "helpfulness": "0/0", "author": "William Bliss"}, {"rating": 5.0, "review": "Even if you have a smart TV you're missing out. I can stream just about anything from my computer to my TV. You can even stream family photos and videos. I do not regret buying this at all.", "verified": true, "helpfulness": "0/0", "author": "Ben Crompton"}]