[{"rating": 4.0, "review": "Works great as advertised.  We got rid of DirecTV and have Amazon Prime and Chromecast, with Netflix now.  Buyer beware, though, its cheap and ours died exactly one year and 10 days after purchase so no warranty :(", "verified": false, "helpfulness": "0/0", "author": "Johnathan M. Kent"}, {"rating": 4.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Eric B"}, {"rating": 5.0, "review": "* P *E *R *F *E *C * T", "verified": true, "helpfulness": "0/0", "author": "Abdel Aude"}, {"rating": 4.0, "review": "I hardly use it, except for in the bedroom on a non smart samsung. It works well to stream pandora and netflix to the TV from my iphone or ipad. Needs more apps.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "The device worked perfectly and included an adapter that was crucial to making the connection. Well done!", "verified": true, "helpfulness": "0/0", "author": "Roger McLord"}, {"rating": 5.0, "review": "Set up unit with my Android smartphone, as instructed by Chromecast help rep.  Using Windows 7 Pro 64 bit.  Once I input the password for my comcast wifi setup, it worked as advertised.  Make sure you Android device is operating at the 2.4 Mhz if you have a dual frequency router or gateway.", "verified": true, "helpfulness": "0/0", "author": "Ronald A. Ostreicher"}, {"rating": 1.0, "review": "Worked OK on the mac but had a very limited use.", "verified": true, "helpfulness": "1/1", "author": "Maxamillion Armani"}, {"rating": 1.0, "review": "Several friends are happy with their chromecasts.  Mine was buggy since day one.  Now the sound just stopped working all together.  I liked this because it was a cheap alternative.  I guess you get what you pay for. :(", "verified": true, "helpfulness": "2/2", "author": "Megan"}, {"rating": 1.0, "review": "Just got it. Only can install from my Samsung Phone..Not with my MAC notebook.. First though..maybe my internet is not good..but I check signal is OK.  I have Turbo Cable internet. Was on and off very often....Very un happy with this.", "verified": false, "helpfulness": "1/1", "author": "Magan D."}, {"rating": 5.0, "review": "I was holding off on this but as soon as screen mirroring kicked into effect I bought one.  You can mirror any 2D game over wifi with very little lag whatsoever.  You can run XBMC on your android and stream to your TV with this, right from your phone.  AWESOME.  3D games lag and jitter slightly more.  I expect that will be resolved in updates in the future.  Not a deal breaker.", "verified": true, "helpfulness": "0/0", "author": "Mark Z. Ciarleglio"}]