[{"rating": 5.0, "review": "It works just as described, this product will let you watch youtube and netflix right off your tv. Very good.", "verified": true, "helpfulness": "0/1", "author": "Julie Gnetz"}, {"rating": 1.0, "review": "Set up took two seconds. Was very easy. Just follow the on-screen instructions.But then... the actual casting part. I downloaded an app to cast a simple mp4 video. All it did was spin and think. Lame. Was really excited about this product, but it didn't work at all. Oh look! It's going back!", "verified": true, "helpfulness": "2/3", "author": "George P. Burdell"}, {"rating": 5.0, "review": "have two of them, i use it mainly whit netflix and works fine. Hope to get local media streaming soon", "verified": true, "helpfulness": "0/0", "author": "Oscar Ardiles"}, {"rating": 5.0, "review": "this was a great buyworks great easy set up I can watch the tv instead of my laptopwould recommend", "verified": true, "helpfulness": "0/0", "author": "Davidleecharter Net"}, {"rating": 5.0, "review": "Yup. It's totally awesome. Get one. We used to stream from the laptop but this is way easier and the picture looks better too. Of course Big Brother Google is watching, but boy is it fun. :)", "verified": true, "helpfulness": "0/0", "author": "ty \"ty\""}, {"rating": 5.0, "review": "Best budget gadget ever.I picked this up, simple as pie to connect.  This with Plex is unbeatable.  As long as its paired to a quality N router, it'll stream 1080p content all day long.  I use my desktop in the bedroom as the server and this on the TV in the living room.  Even use the analog out on my TV going to our ancient but still working receiver/Bose setup.  Works great for our needs.  $35 HTPC.  Done.", "verified": true, "helpfulness": "3/3", "author": "Christopher Lamarr \"MrRuckus\""}, {"rating": 1.0, "review": "I have to hand it to the google engineers, the technology is impressive. If you wanted a meeting to show what is on your computer browser to the main HDMI screen this is it. But wait, computers have HDMI out already! OK how about a phone or tablet browser to show it's content to the main screen. OK it does that well. How useful is that for home use?  But it has to be the Chrome browser. Minor detail. What about living room use. Since this does not have a remote control, you need something to run a web browser and CAST the  page to the main screen. Now you watch TV with a phone or table browser? Come on! This isn't so practical after all is it?  For a few dollars more you can use a Roku stick and a normal remote control and have great menus on screen and forget the chrome browser. Maybe google should just stick to being a search engine that do that well.  This caster went back for a refund. Now I know what i have friends that have this (because its cheap) and they don't know where it is (because ether don't really use it).", "verified": false, "helpfulness": "2/4", "author": "Mister Ed"}, {"rating": 1.0, "review": "It was a big waste of money it will not work on a wired pc. Plus it is far from what I had expected. That will be the last product I buy without reading reviews first! If you're thinking of buying this you need to consider a few things. Do you have a wireless device?, Do you know how to fix your wireless internet, because every time the chromecast looses power it resets. Plus you are limited to very few websites that you can use. That reason alone would have deterred me If I hadn't been mislead before buying the device. Actual rating from me is 0 stars.", "verified": true, "helpfulness": "1/3", "author": "Tim Moonshine"}, {"rating": 5.0, "review": "It was an easy hookup process. It does wOrk as it is advertised. Worked so well purchased another one for the family", "verified": true, "helpfulness": "0/0", "author": "Jose Tigeleiro \"iamtig\""}, {"rating": 3.0, "review": "I was excited about the Chromecast and managed to get it set up easily enough.We wanted it for our spare TV in the garage so could get Netflix and broadcast Youtube content easily.This is easily done and does an adequate job, but does that and little else for me.Personally much prefer the Amazon Fire TV as has more interaction options and has the added bonus of Kindle video and games.", "verified": true, "helpfulness": "1/1", "author": "Pippen148"}]