[{"rating": 5.0, "review": "This installed in approx.. 6 min.  Have a smart Panasonic plasma and this produces a superior picture. Thank you Amazon for another fine product.  Update: . I have had this for about 1 year and the big problem I have with this is the Hulu app stops and starts making it un playable, and they do not have the CBS all access app. This makes me have to stream thru my pc, very in convenient. I am giving some heavy thought to buying the Roku which has everything I need making it un necessary to have to use the pc at all. Just writing this has made up my mind I'm off to buy the Roku 2 (4210r) for $69.00", "verified": true, "helpfulness": "1/1", "author": "walter"}, {"rating": 4.0, "review": "Amazon fire is super easy to install and you can start watching your favorite programs right away. So far I like it", "verified": true, "helpfulness": "0/0", "author": "nena andueza"}, {"rating": 3.0, "review": "Slick unit, nice remote - nice picture and sound when connected correctly with necessary equipment.  Good for using with Amazon Prime and purchased \"Amazon Instant Video.\"  As with Kindles, not as flexible for uses outside the Amazon nexus.  Two big issues for me. First, remote is not the typical IR (is Bluetooth, I believe), so unit cannot be controlled with universal remote (like Logitech Harmony).  This is an annoyance.  Second, and bigger issue, is that the Dolby Digital Plus made it very difficult to get any sort of surround sound on my home theater system (my receiver is a Denon with every kind of surround under the sun, but not Digital PLUS).  Am using an HDMI switch (as my receiver has only two HDMI inputs), and was only able to get stereo sound to pass through this from the Fire TV.  Tried a new HDMI switch with an optical digital output, still only stereo on Fire TV. (Was able to get full surround from my Apple TV with this setup, by the way.)  Then tried a separate optical digital audio switch in addition to the HDMI switch and finally got surround sound from the Fire TV!  THEN discovered the remote codes overlapped on the HDMI switch and the optical digital audio switch!  While this last part can't be blamed on Amazon's choice of the audio for the Fire TV, in the end I spent $250 on a switching unit that switched both HDMI and optical digital audio.  While my AV receiver might be old by computer age standards, it is not that ancient in audio/video equipment years.BOTTOM LINE - You might want to do some research to make sure it will work with your other equipment.  If you are counting on using with universal remote (not talking about cheap, generic ones, either), won't happen!  (There might be remotes out there that have Bluetooth capability, but I doubt it.)  Probably not the best to buy if you are not using Amazon Prime Video or purchasing Amazon Instant Video items.", "verified": true, "helpfulness": "1/1", "author": "Don Hittle"}, {"rating": 3.0, "review": "I was an early adopter of Apple-TV, and now own 3.  Since the Apple TV has been on the market for several years now, I was expecting the brand new Fire TV to be better in every way.Bottom line - it's not.  In some areas it's not even close.1. Netflix - this is why I bought the Apple TV in the first place.  Compared to the Apple, the FireTV downloads a little faster, and films look a little better (1080p).  But, compared to the Apple TV, the Fire's interface for Netflix is woefully primitive.  Looks more like the Netflix app on a kindle, which is where I bet they ported the software from.  Very hard to search, find your queue.  For Netflix I still use my Apple TV.2. Prime - this is very good.  Lots of films and TV shows included with a reasonably priced subscription.  Excellent picture quality and HD sound.  To me this is by far the best feature on the Fire TV.  This they did right.3. Voice search - this is also very good, works quickly and is usually quite accurate.  Far faster than typing.  Downside is that it only works within Amazon world.  I.e. you can't voice search on Netflix.  That's a real shame, would have been a great feature.4.  Music - this is the biggest disadvantage of the Fire TV.  Using my Apple TV I can stream my entire library of almost 900 albums to any TV / stereo in my house.  Smoothly and easily.  With very good sound quality.  Amazon has a cloud player app for the iphone which is fairly equivalent and works well, but NOT for the Fire TV.  Why not?  That would seem to me to be a no-brainer.  For me this is HUGE negative as I often use the Apple TV's to play MY music.  Not to stream borrowed music from Pandora or I heart radio....5.  Paid Films - watching films from the Apple store on Apple TV is fairly seamless.  So is the Fire.  There's no real advantage to either device that I can see - the small increase in picture quality on the Fire TV is balanced by an interesting pricing conundrum.  That is, on Amazon once you find a film (or browse) you might have to pay.  Or not.  There is no easy way to search for free / Prime content.  With the Apple TV when I'm willing to pay or looking for a recent film I use the apple store, when I'm looking for free I use Netflix.  There's also no rhyme or reason to film rental pricing on Amazon, some very old films cost $5.99 to rent, while some recent films are $0.99 or free.6.  Shopping - Why the heck can't you shop with the Fire TV?  To me that seems like another huge blunder.  I can shop from Amazon using my iPhone, but they couldn't write a shopping app for this whiz-bang new device?  Like the omission of the cloud-player, that's a big mistake in my opinion.7.  Streaming Photos from phone - the Apple TV does this amazingly well, and it's hugely fun to see and share large-screen versions of your photos.  Could not figure out how to make the Fire TV do this.  Another huge downside.  I suspect you can upload them to the Amazon cloud, but streaming directly from phone to TV is really a nice feature in Apple world.8.  Overall - the Fire TV is nice device, and a reasonable competitor to the Apple TV and Roku.  But honestly, if you've got an iPhone and / or an iTunes library I think you'd be happier with an Apple TV.  If you're more interested in streaming old TV episodes or playing Pandora, then the Fire TV is fine.  With some new apps (better Netflix interface, shopping, wireless photo-streaming, cloud-player) The fire TV could wind up being better eventually.  But it's not quite there yet.  At all.", "verified": true, "helpfulness": "3/5", "author": "Winston Smith \"Chuck\""}, {"rating": 5.0, "review": "This is my first streaming device, but I'm sure it will be my last too. This product amazes me, I was even able to finally remove my cable tv. All I need is internet, and my monthly charge now is only a little over 8 bucks! I highly recommend this product, and I don't write reviews very often. I felt compelled to for this! Buy it and you won't regret it.", "verified": true, "helpfulness": "3/3", "author": "Brenden"}, {"rating": 5.0, "review": "This is probably the best streaming device on the market right now, the hardware is the best, with the quad-core processor and 2 gb ram, the ui is nice and snappy with a different layout and navigation than typical boring boxes, plus doubles as a gaming console. Updates and support are going to be frequent since this is Amazon, and build quality is very nice with innovative features like voice search, and it just doesn't feel as toy-like as a roku. It's going to appeal to a wider audience than just mom who wants netflix or amazon streaming and that's it.And as an added bonus, and the reason I purchased it, almost any android app can be side-loaded, which means this can be turned into an htpc with XBMC. So it's now competing with Chinese android boxes like the Gbox mx2. Advantage over the mx2 is that the hardware is better quality and you have Amazon support, so firmware is going to be better with less defects like wifi signal issues, overheating, broken apps, etc..", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "just discovered Amazon fire TV, LOVE IT!!  missed 3 episodes of Walking Dead right in the middle of the season, - got to buy them individually and watch immediately !  Have since bought Modern Family Season 1 to catch up and Big Bang Theory Season 1 to catch up.  We love the voice-command, - makes it so easy.  thanks Amazon!!", "verified": true, "helpfulness": "0/0", "author": "Patricia J. Brosio"}, {"rating": 5.0, "review": "Amazon Fire TV is a stunning product!My setup:1.) My Wireless is 802.11N;2.) Samsung 55\" LCD TV - high end but 5 years old;3.) Yamaha YSP-2200 Sound Bar;4.) HDMI cable from Fire TV to YSP-2200 and HDMI ARC from YSP-2200 to Samsung TV.5.) Advantage: All HDMI inputs to Sound Bar - therefore one place to choose inputs; One HDMI output to Samsung TV; Sound plays 7.1 on sound bar from all HDMI inputs.What I like about Fire TV:1.) Set up is baby simple:a. Attach HDMI cable from Fire TV to unit;b. Put batteries in remote;c. Connect power supply to Fire TV;d. Choose appropriate input on your TV (in my case on the sound bar);e. Follow easy on screen instructions;f. Fire TV setup found my wireless network - and allowed me to connect to my wireless network by only requiring me to provide my WPS Authentication-- my PSK;g. Fire TV works instantly.2.) Fire TV out of the box is set up with my Amazon Prime account. It knows me.3.) Wireless 802.11N connection to Fire TV is extremely fast;a. I had assumed that I would have to hard-wire a Gigabit Ethernet cable to the Fire TV to achieve suitable download times;b. 802.11N Wireless provides instant downloads;c. First movie I watched paused periodically to buffer;d. Conclusion: Wireless to Fire TV works - but I may need to hardwire a Cat 6 cable.4.) Remote control must be RF (Radio Frequency) as opposed to IR (Infrared);a. I pointed the remote into the palm of my hand - and it works.b. This means that remote is RF and I can place the Fire TV anywhere I want.5.) The Voice Search works by speaking into the remote -- again no need for Fire TV unit to be placed in a sight line.6.) The Voice Search is phenomenal.a. I thought voice search would choke on \"Poirot.\"b. Voice search recognized Poirot and exceeded my expectations in every other voice search experiment.7.) I set resolution to 1080p 60 Mhz; Picture is outstanding;8.) Sound plays through my Yamaha sound bar via HDMI; Sound is outstanding.9.) My Samsung TV already has an Amazon app?a. My Samsung TV has a Gigabit Ethernet hard-wire connection to my router;b. My Samsung TV has apps for Amazon - but:c. Amazon App on Samsung TV is awkward and cumbersome;d. Fire TV is the opposite of awkward and cumbersome - Fire TV is unbelievably easy and efficient.10.) Before purchase -- I researched:a. Google Chromecast;b. Roku 3;c. Apple TV;d. Price was no consideration for me;e. Fire TV has 2GB memory - but I do not know the significance of this.f. Obviously -- I chose Fire TV.What I do not like -- or do not know about Fire TV:1.) My vote is still pending on speed of wireless connection;2.) I have not yet found anything else I do not like about Fire TV;3.) I do not listen to music on my TV;4.) I do not subscribe to HBO Go, Disney Anywhere, Watch ABC TV, MLB TV, NHL or any Apple iTunes -- et.al.a. If any of these is a deal breaker for you -- do your own research;5.) I do not do any gaming:a. Fire TV has an optional Gaming Controller for $39.99;b. I have no comment on the Gaming Controller nor the games available;c. Fire TV claims hundreds or thousands of games. IDK;My Conclusion:Amazon Fire TV is a no-brainer to purchase for any Amazon Prime customer.Like MAD Magazine was 25 cents Cheap -- Fire TV at $99 is cheap.", "verified": true, "helpfulness": "10/11", "author": "David W. Johnson \"Little Orley\""}, {"rating": 4.0, "review": "This is an awesome device. Granted, it doesn't have a large list of current movies that I like, but it is more than just a movie player. Great job so far Amazon. Keep updating.", "verified": true, "helpfulness": "0/0", "author": "Lyrisist"}, {"rating": 5.0, "review": "This was so easy to use. Took about 3 minutes to get it hooked up and running. easy breezy to hook up and use. love this", "verified": true, "helpfulness": "0/0", "author": "grannypl6"}]