[{"rating": 1.0, "review": "I just want to know how to put the dang batteries into the remote !!usually when there is a \"clasp\" to open the compartment, it goes the way it slides open.can't get this remote to do anything.so I got this thing sitting in the box.waste of money cuz there is no video to explain nor a telephone number to call.not happy.and i'm sure itz simple..........itz just $$$ down the drain ...........how does this thing turn on?there's no video or instruction manual telling me how to turn it on !!all of the videos start with a home screen or menu screen.how do I get to that point ?!and where do I go?this box sucks.  not very consumer friendly !!!!!!!very disappointed since their selling point is just HOW EASY IT IS ............  not !", "verified": true, "helpfulness": "1/14", "author": "Red \"itzpms\""}, {"rating": 5.0, "review": "i have only 1 issue with my fire tv. the in app purchase and the way it's set up you can turn it off in settings but it can also be easily turn right back on with a click of the hand by anyone playing games. it doesn't require a password just for in app purchases. it is a password protection on there but that is annoying b/c it pops up every time you do something and i mean every time.if i pause a movie password if i change movies password........ so forth and so on. take for instance my ipad had in app purchases block and the only way it can be accessed is by typing in my password, if fire tv can just have a password set for certain thing then all is well.please fix this i love my fire tv almost as much as i love amazon", "verified": true, "helpfulness": "0/1", "author": "tonya"}, {"rating": 5.0, "review": "took me a while to figure out, but once I did no more typing", "verified": true, "helpfulness": "0/0", "author": "jerry mccain"}, {"rating": 4.0, "review": "Easy to use. Content is pretty good.  Don't expect newest releases.  Remote very sensitive.  Even bumping it switched TV input to HDMI port is it is connected to.", "verified": true, "helpfulness": "0/0", "author": "SD00001 \"SD\""}, {"rating": 3.0, "review": "I love this little box. Voice search works flawlessly. I am almost ready to cancel my cable. The only downsize is that the variety of things to watch can be overwhelming.Update 3/7/15 I have one complaint after long time use, because when I search for a title, it now directs me to buy it on amazon prime, it used to show me that it was free on Netflix. I don't think this is an accident, rather Amazon is getting greedy.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/1", "author": "brad venables"}, {"rating": 3.0, "review": "After trying Apple TV, ROKU and several other streaming devices I chose  WDLIVE .Amazon Fire TV is more powerful, has the latest gimmicks and more storage. But, and this is a big but! They are following the same tired approach as ROKU and Apple TV.I want to play it all, the music and video stored on my server. FLAC, 16 bit, 24 bit, MP3, OGG, MP4,Does the Fire TV do 24bit audio? What about the other formats?Streaming from a service anyone of these boxes can do.You buy this box and you keep on paying for services. I want options, I want choices.How much of an effort would it be to actually get it right? Unless your worried about the big cable companies and the money you can make on the back end.WDLIVE is not that difficult to setup it's pretty much plug and play to stream from an online service, granted you need to point it to your media server if you have one. it could use more horse power and  storage. But it does play everything I throw at it!Amazon fire TV take a look at the WDLIVE, WDLIVE take a look at the Fire TV.APPLE and ROKU, new boxes please!Give me Fire hardware & WD software.", "verified": false, "helpfulness": "1/5", "author": "Richard Lajeunesse"}, {"rating": 2.0, "review": "I haven't used Amazon Fire TV. When I signed up for the free trial to try this product, I wasn't told I would need a HDMI cable, which is sold separately, in order for Fire TV to work. So this can possibly be a great product but I would never know because I'm not buying the HDMI cable just to try it. It came packaged nicely, however.", "verified": true, "helpfulness": "0/13", "author": "Brandis Snagg"}, {"rating": 4.0, "review": "Have really enjoyed this unit.Pros:  Allowed me to get rid of cable at more than $150 per month. Bought a HD antenna to pick up local channels from air for news.Cons:  Requires periodic disconnection of power cable from unit to allow reset and quit timeout. Not really much of a bother", "verified": true, "helpfulness": "0/0", "author": "Lee Easter"}, {"rating": 3.0, "review": "Great", "verified": true, "helpfulness": "0/3", "author": "Essie Knight"}]