[{"rating": 5.0, "review": "Let me just start off by saying Chromecast is AWESOME!Me and my wife have been unplugged now (Free from cable companies) for about 5 years now. It was the best decision we ever made, paying $100+ a month for TV that tells you what to watch and when just wasent our style.Chromecast is amazing, it plugs right into the HDMI port of your TV and takes less then 5 minutes to set up. We signed up for Netflix, Hulu and HBO GO and have all our shows streaming to Chromecast effortlessly. We recently purchased the Amazon Fire stick because we love Amazon and their products. But let me tell you guys the Fire Stick sucked! It skipped constantly, froze and the app for Iphone didnt work.With Chromecast you can stream from Youtube, Crackle and anything that your browsing on Chrome browser you can cast to the TV. Its awesome, I can pull up my FB page and share videos with my wife and friends. I recommend this product to everyone its well worth the $35.00!!", "verified": false, "helpfulness": "0/0", "author": "Michael E. Riith"}, {"rating": 3.0, "review": "It would be better if more apps worked with it (without having to get into a forum for what will and how). I'd rather use my Roku.", "verified": true, "helpfulness": "0/0", "author": "drbrousters"}, {"rating": 5.0, "review": "Works better then expected!!!", "verified": true, "helpfulness": "0/0", "author": "Dave C"}, {"rating": 5.0, "review": "EXCELLENT little gizmo. use it every day and so far no troubles.", "verified": true, "helpfulness": "0/0", "author": "Gonzalo Salazar"}, {"rating": 5.0, "review": "exactly as posted... quick shipping, great product... thank you.", "verified": true, "helpfulness": "0/0", "author": "jason"}, {"rating": 5.0, "review": "Works great. The only issue is that I had to buy a splitter. My TV didn't have enough HDMI outlets.", "verified": true, "helpfulness": "0/0", "author": "Gabrielle Moulton"}, {"rating": 1.0, "review": "Waste of money", "verified": true, "helpfulness": "0/0", "author": "Ron A."}, {"rating": 4.0, "review": "GOOD PRODUCT", "verified": true, "helpfulness": "0/0", "author": "ESER KARAOGLAN"}, {"rating": 4.0, "review": "Already had one, bought this one as a gift. I could not recommend anything but this product, works great although if you are using a PC or Laptop occasionally the device will not be connected and you will be unable to pause.", "verified": true, "helpfulness": "0/0", "author": "Robert Amicangelo"}, {"rating": 5.0, "review": "Love this little device! If only it worked with all music/video apps.", "verified": true, "helpfulness": "0/0", "author": "joe weisenbach"}]