[{"rating": 5.0, "review": "Love it. Nuff said. Da da da.  Da da da. Cool as the other side the pillow. If ya don't got it, get it.", "verified": true, "helpfulness": "0/2", "author": "hootie123"}, {"rating": 3.0, "review": "I have had this for a few days now, but it does not reliably connect to my laptop via WiFi.  When it does the YouTube feature works great - even in Hi Def.  I do not have Netflix so I cannot speak to that.  The \"tab casting\" feature is Beta and does not work.  I have plenty of computer power and WiFi speed to meet the requirement, but the video freezes - reliably - after about five seconds while the audio continues just fine.  I'm sure Google is working to get this fixed and also adding more apps.  For $35 it was reasonable to purchase and investigate.  I would like to see it eventually be able to cast anything on my laptop to the Hi Def TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Perfect compliment to Netflix and YouTube for your TV. I use it with my phone and tablet. Easy to install and use. I placed it through my receiver not directly on my TV which is perfect to get sound through the surround sound system. I just wish it had or will have the capability to do slide show of photos and music as well.", "verified": true, "helpfulness": "0/0", "author": "SFD \"TECH\""}, {"rating": 5.0, "review": "There are limited applications this will work with at the moment, but that will all change once this is out for a while. Easy to setup and use. The apps that are able to be used, have a button to stream it to the Chromecast and it only takes a second for it to flip from the device to TV. $35 is a great price for this as it will only get better with time.", "verified": true, "helpfulness": "0/0", "author": "Chad Williams"}, {"rating": 2.0, "review": "I was excited ordering this because we watch a lot of shows through amazon instant video so we thought this would be great in that we would not be limited in our viewing sources.  However, once we got it and hooked it up we quickly realized that it only streams YouTube and Netflix.  Nothing else.  I don't understand why .  I think this is a deal breaker for a lot of people.  I guess ours will be going back soon.", "verified": true, "helpfulness": "0/3", "author": "julie36"}, {"rating": 5.0, "review": "Setup is always looked on as a challenge. Google found a way to make this as painless as possible. Another surprise was when I moved it to a different location, the part recognized t and started the simple setup again. This doesn't always happen with electronic things so I was doubly impressed.", "verified": true, "helpfulness": "0/0", "author": "zoomer"}, {"rating": 5.0, "review": "Absolutely love it! Perfect way to get netflix on TV w/o tying up a computer, we control from our phones and kids can see their favorite shows", "verified": true, "helpfulness": "0/0", "author": "Matthew J McMorris"}, {"rating": 4.0, "review": "I was pleasantly surprised at how well this streamed movies from Google Play, but it's not as good from a browser unless you have a fast network and a fast laptop. Watching a movie from the browser on my Chromebook wasn't possible, too slow and jerky. I thought this would be a good way to connect my Chromebook to hotel televisions, but it's first necessary to register the device on the hotel network which can be difficult to impossible. It would be nice if there could be a direct WiFi link from a notebook to the device.", "verified": true, "helpfulness": "0/0", "author": "Eric A \"programming fool\""}, {"rating": 1.0, "review": "This is the biggest nothing product I've ever seen.  If you've already got Apple TV or some other way to connect your tablet, phone or PC to your HDTV screen, skip buying this.", "verified": true, "helpfulness": "2/9", "author": "Thinking Reader \"TRDR\""}, {"rating": 3.0, "review": "Very limited: Netflix & YouTube are all I use.  I hope that they expand that in the future. Seems to work OK even with limited bandwidth Internet speed.  Few glitches.", "verified": true, "helpfulness": "0/0", "author": "B1"}]