[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/2", "author": "shaun alexander"}, {"rating": 5.0, "review": "FANTASTIC!!!", "verified": true, "helpfulness": "0/2", "author": "ABC"}, {"rating": 5.0, "review": "I love it! But I thought everything was free, found out it's not.  But I know what to look for now.", "verified": true, "helpfulness": "0/1", "author": "Karyn A Bradshaw"}, {"rating": 5.0, "review": "Pretty cool. I love it.", "verified": true, "helpfulness": "0/2", "author": "Nola smith"}, {"rating": 5.0, "review": "This has been fun to use and the selection of movies are great...", "verified": true, "helpfulness": "0/2", "author": "Bob H2O"}, {"rating": 5.0, "review": "Love it! Not sure how I lived all these years without it.Zero problems with setup or operation. Took me all of about 5 minutes to get up and rolling from the time I picked it up off my front porch.", "verified": true, "helpfulness": "0/1", "author": "Grant Doner"}, {"rating": 5.0, "review": "Amazing product. Wish I would have done it sooner. I have one now upstairs and down. Liked it so much sent one as a gift.", "verified": true, "helpfulness": "0/1", "author": "Elesia Koehler"}, {"rating": 5.0, "review": "ultimate cable cutter, i recommend to all my friends", "verified": true, "helpfulness": "0/1", "author": "Pan"}, {"rating": 5.0, "review": "Very fine hardware and software.  Much praise to Amazon for producing what I believe to be the best streaming device on the market (head and shoulders above Roku).I have only one element of the Fire TV that needs serious attention:  there is no way to shut off the device without unplugging it from the wallsocket and disconnecting the HDMI cable from the TV.  The \"Sleep\" function is nice enough, but for those that rely on \"over the air\" public digital TV (such as myself), the Fire TV will blackout the TV signal completely to all stations (in my area at least) when left in the \"Sleep\" mode.  Again, to watch TV, one must unplug the Fire TV from the wall socket AND disconnect the HDMI from the TV.  This is extremely frustrating!Other than that one BIG problem, the unit is a gem!", "verified": true, "helpfulness": "0/1", "author": "Regular Book Buyers"}, {"rating": 5.0, "review": "IS BEEN LONG YEARS OF LOOKING FOR A RELIABLE  TV BOX THAT DO NOT STOP MY VIDEOS FROM YOU TUBE ,AND FINALLY I BOUGHT THIS AMAZING PRODUCT .IS A 5 START PRODUCTTHANKS", "verified": true, "helpfulness": "0/1", "author": "Jorge M."}]