[{"rating": 5.0, "review": "I do not have cable. I find it to be a waste of money. I have a Wii U and Chrome Cast. I love that I can play on my WiiU while my daughter watches the tv from the chrome cast. I can share pics, videos in the browser while casting it to the tv. The apps on it rock.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "Cheaper alternative to Apple TV although with much fewer apps and channels - serves its purpose well allowing streaming from iPad/iphone or android device - only has more room to grow. Will likely buy more in convert UNSMART TV's to SMART ones without difficulty...", "verified": true, "helpfulness": "0/0", "author": "VG"}, {"rating": 5.0, "review": "If you don't have a chromecast- go out and get one right now! It is great for streaming Netflix from your ipad because it allows you to still do other stuff on your ipad while Netflix is streaming!", "verified": true, "helpfulness": "0/0", "author": "Vanessa McConville"}, {"rating": 3.0, "review": "It really is a great piece and one that is great to have at such a cheap price.However, you are limited to very very very few apps that will run on it as of 3/5/14.  That is the most disappointing.  Then there is the \"chrome tab to cast\" issue that drives me up the wall.  My laptop IN MY OFFICE can share a tab to the cast IN MY LIVING ROOM but my tablet that is sitting on my coffee table in the LR CAN'T...............  that is the most ridiculous thing there is!!  I'm hoping one day all this becomes a reality and i can share my chrome tab from tablet to cast and that every app is able to be put on the cast.  How great would it be to play Angry birds on your tv right?  make it a family night out of it!!  Even send my email up to the big screen! And with FB having videos posted that are not youtube, you can't share them with others in the room on the TV....So, its nice to have but it has a long way to go before it's 5 stars in my book.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Lots of bang for your buck. Great addition to your tv. Wish I had bought one sooner. Would buy again.", "verified": true, "helpfulness": "0/0", "author": "Carter"}, {"rating": 5.0, "review": "No hdmi cables needed it's perfect for any device that's compatible which is the plus for watching tv shows movies", "verified": true, "helpfulness": "0/0", "author": "GMAN"}, {"rating": 5.0, "review": "This makes your TV into an internet ready TV. It has several other apps that correlate with it, but I use it mostly for You Tube and Netflix.  I wish you could access VUDU on it. Great little product!", "verified": true, "helpfulness": "0/0", "author": "Deb Murphy"}, {"rating": 1.0, "review": "It's just wasn't what I thought it was so I don't like it and will not tell anyone to go out and buy it.", "verified": true, "helpfulness": "0/0", "author": "steven crenshaw"}, {"rating": 5.0, "review": "We cancelled cable and got a Chromecast.  Most of what's on TV is garbage now anyways and netflix will keep us plenty busy on the long cold nights.  It was a good decision.One of the best features: when the Chromecast isn't playing anything you see a series of beautiful landscapes or other pictures displayed with a nice little clock in the corner.  35$ is worth it for that alone.  For those of you that like your little cable box clock, this is better.  We leave our TV on all the time now so we can see the nice pictures.They say you can cast chrome tabs on the chromecast: I don't care.  We don't use that.  We use this purely as a netflix portal with a tablet and it is the best netflix experience I have yet to find.  No more slow bluray interface.  I'm not buying an Xbox or a PS4 for netflix.  35$ chromecast is perfect.  Sometimes I nerd out and use it to watch League of Legends games on youtube and pick my nose and that's nice.It's 35$.  Stop being a cheapass scaredycat and buy it.", "verified": true, "helpfulness": "0/0", "author": "Cameron J. Mcintyre \"Dr. Junius Hertzby\""}, {"rating": 4.0, "review": "best pricecheap price and good quality  very nice device..it can cast full hd videono more comment. 0", "verified": true, "helpfulness": "0/0", "author": "dato"}]