[{"rating": 1.0, "review": "Not worth the effort.  Very hyped up device that I thought might replace the lack of Intel® WiDi for the home.  However, I could only stream from a pc connected to wifi at standard 480p otherwise very jittery.  I have several DLNA servers in my home that have no issues streaming HD.  Also, since google's latest Chromecast update intentionally breaks AllCast. i.e. the ability to play media from external sources this device is not worth the trouble.  The only thing of use is that I was able stream mp4 format at 480p that was okay video playback.  Very disappointing with all the fanfare, I would be much happier with a mini dlna player device.", "verified": true, "helpfulness": "27/34", "author": "BAP"}, {"rating": 1.0, "review": "I was really excited about this product, because I want Youtube on my TV, mostly. My Roku doesn't have Youtube.Unfortunately the product doesn't work, at all. It fails on setup, not just from a Win7 PC but from an Android phone as well. It proceeds through setup initially, but then it bizarrely KILLS MY NETWORK. My wireless network disappears and never comes back. If I reset my network, it comes back, but as soon as the Chromecast sees it again, it tries to update again, and the network disappears once more.Worse than a product that doesn't work right is a COMPLETELY HOPELESS support experience. I have called the phone support number twice, and both times got a nice young agent who knew nothing about the product except how to reset it (tried six times) and couldn't refer me to anyone else. I was told \"a technician will get back to you in 24-48 hours\". It's been 96. Same experience with email support: useless instructions to make sure the power is on, and \"24-48 hours\". But no one ever gets back to me.I'm sure it's something to do with the device not getting along with my wireless router, but their (lengthy) list of router workarounds doesn't include mine.No one seems to be interested in talking to me about it. So, you know what? Screw you. I sent it back. I'm off to get an Apple TV, which is probably what I should have bought in the first place instead of this piece of junk or the Roku (which at least works right off the bat, even if it doesn't have the content I want).", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Waited for long time, ...don't like what I got.  Cannot transmit anything for more than 5-7 minutes.  After that the WiFi signal got killed and router need to be re-booted.  Absolutely no good help available, specially about my problem.  No help available via phone or email.  Maybe, I just got bad device and need to return.  As much as I want to have it, its waist of money now. How Google can offer product without good help?", "verified": true, "helpfulness": "0/0", "author": "MikeP"}, {"rating": 3.0, "review": "As someone who travels quite a bit, I find myself spending many nights in hotel rooms all over the country. When I first heard about the \"travel friendly\" Chromecast I was very excited. Finally, there would be a portable, super-lightweight way to stream Netflix (and now Hulu) content to the hotel TV. In theory, this should have been the perfect device for me.When  hooked to a TV via both HDMI and USB (for power) this little dongle is fantastic. You simply log into the Chromecast app on your phone, configure the Chromecast to access the network, and off you go! This works great at home, but almost never works on the road.The Problem:Nearly every hotel in the country now uses \"Captive Portals\" for their Wifi access. These captive portals are basically webpages that come up when you first connect to the hotel's \"open\" network. The pages usually serve as a way to pay for internet access, display terms of use or both. Even hotels with \"free\" internet access use such pages. Because ChromeCast doesn't have a browser built in, it can never get past the authentication pages of these captive portals.Kludgy Solutions:1. Travel with a Travel router. Not all hotels have ethernet ports, but for those that do, you can take along a travel-router. You connect the router to the ethernet, then connect to the router's wireless signal with any other device. When you authenticate on the captive portal, every device hooked to your private wifi are now authenticated... chromecast included. This works great for hotels with internet, but is kludgy and cumbersome. I feel ridiculous dragging a router to a hotel that has wifi.2. Use your computer's internet sharing as a router. If you have your PC or Mac with you can bridge network connections to make the computer behave much like a travel router: Same as #1.3. If you get really fancy, you could temporarily spoof the MAC address of the Chromecast using another computer... Authenticate, then hook up the Chromcast to the wireless network on which its MAC is now authenticated.Bottom line: In order to be of any use for travelers, Google needs to come up with a solution for the Captive Portal problem.", "verified": true, "helpfulness": "1/1", "author": "lordhamster \"lordhamster\""}, {"rating": 1.0, "review": "We have windows xp.  The ads did not mention this fact.  It is written on the box in very fine print that xp is not compatible.", "verified": true, "helpfulness": "2/4", "author": "Carolyn W."}, {"rating": 5.0, "review": "I love being able to get entertainment from other sources! Chromecast was simple to set-up and use.  New content is continually being added. I may be close to dumping my cable TV provider!", "verified": true, "helpfulness": "0/0", "author": "Michelle Smith"}, {"rating": 1.0, "review": "One star is an unfair review. It did not even earn one star. Mine was DOA. 35.00 in the trash.", "verified": false, "helpfulness": "0/2", "author": "Kevin Wilson \"Cookenstein\""}, {"rating": 3.0, "review": "For the price its ok, but it doesnt offer anything new for streaming media yet. It allows you to stream youtube and netflix from your phone, but many other devices can stream both of those. The screencast feature is almost unusable, which was the only value add this thing offers. When you cast a chrome tab from your pc, there is a 2 sec lag, and if trying to watch video in a browser, its choppy and frequently drops the connection. Ill continue to use an hdmi cable instead.The youtube sharing can be convenient if you want to take a vid you're watching on your phone and throw it up on the tv, but I dont do that much. Also, if you have google play movies, you can stream them well. Thats prob the biggest plus, but thats assuming you buy any movies from the google play store.Overall, ive had it for a month and never really use it. My roku remains my streaming device of choice.", "verified": true, "helpfulness": "0/0", "author": "BurningKerosene"}, {"rating": 2.0, "review": "This product connected to my network but would not connect to the internet!  Turns out the chromecast has to be within 20 feet of the router or it will not work.  Because my wireless laptop had no problem connecting from the same location, I was very disappointed.", "verified": true, "helpfulness": "2/4", "author": "Mario Nastasi"}, {"rating": 4.0, "review": "I bought this because it was cheap and wanted another streaming device.  This is definitely a great device, but I wish it had more support.  Steaming a tab has quite a bit of latency on my 300Mb router, but that really isn't an issue, I mainly use it to watch youtube on the big screen without using my \"smart\" tv's horrible thought out youtube app that hasn't been update in over a year.  For youtube and netflix, it is absolutely fantastic.  I love  having the ability to be able to stream on any HDMI connected tv.  For travelling, and things like that, it is awesome.  I love that it doesn't break the funcionality of my laptop or phone while using it either.  Before, if I wanted to watch something on the big screen, I would have to use an HDMI cord and have my device right next to the tv.  This way, I can just click stream and go on about my business.", "verified": true, "helpfulness": "0/0", "author": "James E. Scott"}]