[{"rating": 5.0, "review": "This is not exactly what I thought it would be, but that is my fault. Never less I can stream u tube from my lap top to my tv and that is great.I enjoy watching TED documentary on my lap top , now I can watch it on my big screen  tv. Later maybe I will stream other media from my lap top to my tv , but now I am thrill with what I have now.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Huber \"\" book sherlock\"\""}, {"rating": 4.0, "review": "Fun", "verified": true, "helpfulness": "0/0", "author": "Patrick Doty"}, {"rating": 5.0, "review": "10/10", "verified": true, "helpfulness": "0/0", "author": "Gabe"}, {"rating": 3.0, "review": "We got this while we were in the process of moving and ended up keeping it longer than expected. We are still switching to Fire TV but this thing worked alright most of the time. You control through an app on your phone so - when your phone goes to sleep - it basically has to reload everything when you want to use it, which takes a while and sometimes freezes. Not worth the hassle unless you need to save the money.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "No frills, but great for the price.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "ahmed shafik"}, {"rating": 2.0, "review": "Difficult to keep buffering on wireless network.", "verified": true, "helpfulness": "0/0", "author": "Urs"}, {"rating": 5.0, "review": "bar none.", "verified": true, "helpfulness": "1/1", "author": "Pete Cox"}, {"rating": 5.0, "review": "Now I can see Netflix in my LG 42 inches (wich is not a smart tv).", "verified": true, "helpfulness": "1/1", "author": "Carlos Niz"}, {"rating": 5.0, "review": "Works great and I think is easy to set up (my husband did it but hevhad no complaints). Great product for the price.", "verified": true, "helpfulness": "0/0", "author": "Suzio"}]