[{"rating": 5.0, "review": "This is simply one of the coolest things I have ever bought.  The speed a clarity is much better than either my smart TV of DVD player.", "verified": true, "helpfulness": "0/0", "author": "Flyfishmt"}, {"rating": 2.0, "review": "You deal with the regulated/limited amazon android app store, which I expected. However, I have this connected though the receiver in my entertainment center, and periodically have HDMI disconnect issues during video playback from any app. HDMI connections negotiate a secure digital connection between devices at a hardware level. If the secure connection (and I don't mean physically cable to connector) has trouble staying connected you will see what looks like static as the connection is renegotiated. Once this is re-established it will show the video output again. This happens often in the middle of netflix movies, hulu episodes, or plex movies etc. I called Amazon service and they were no hlep and tried to send me to other Amazon help numbers. Ultimately these issues won't get ironed out except through firmware update which take a long time if they fix it at all. So be aware.I have not had this issue with chromecast, though chromecast is a somewhat different type of device with the same purpose. The issues I have seen with chromecast are with retaining the connection from app to dongle when the device is locked or in sleep mode. It takes a bit of time for it to connect to each other, it's not always instant after waking the device.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great for old people who don't know how to work Xbox and playstation.", "verified": true, "helpfulness": "0/0", "author": "Braden S."}, {"rating": 2.0, "review": "I LIKE MY SONY MEDIA BOX BETTER IT IS USER FRIENDLYTHE FIRE TV MEDIA BOX IS NOT FRIENDLY TO USE", "verified": true, "helpfulness": "0/2", "author": "johnnie hankins"}, {"rating": 5.0, "review": "Just exactly what I wanted!  They were mode has a microphone so you can speak your preferences 😊", "verified": true, "helpfulness": "0/0", "author": "Lynda S Rowe"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jason D. Kerley"}, {"rating": 1.0, "review": "Amazon Fire TV is not for international customer. Unbale to get Prime movies and other features if you live outside of the USA.", "verified": true, "helpfulness": "1/3", "author": "Horace D. Stephens"}, {"rating": 3.0, "review": "Did not meet my expectations", "verified": true, "helpfulness": "0/0", "author": "William A.Conner"}, {"rating": 5.0, "review": "Works great right out of  the box! Easy to follow and succinct instructions. Another Amazon winner!", "verified": true, "helpfulness": "0/0", "author": "Stephen E. Gilman"}, {"rating": 5.0, "review": "Easy to set up and use.  Big hit with all .", "verified": true, "helpfulness": "0/0", "author": "Barry W."}]