[{"rating": 2.0, "review": "Waste of money.  Spend the extra dollars and buy a Roku.  Roku far superior especially with Playon and Playlater.  Chromecast video OK on grandson's 27\" TV but terrible on 46\"; even on highest video quality setting.  Gave mine to grandson.", "verified": true, "helpfulness": "0/1", "author": "Craig B Lapham"}, {"rating": 5.0, "review": "No reason why you shouldnt of bought this already if your looking at it right nowcant beat the price for what it doesMOST BANG FOR YOUR BUCK OF THE YEARPlus it works on my windows vista 2007 pc even though google doesnt say it supports it +1 for me streaming all the movies i want to my tv ! my computer is loaded with tons of recorded content ! Got to love The Tuner Card !BUY THIS NOW OR ELSE YOU WILL REGRET IT", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "obviosly the apple tv is better, but if your need it only to stream netflix and youtube this is it.  i prefer apple tv because you can airplay from a lot of apps", "verified": true, "helpfulness": "0/0", "author": "bernardo posada"}, {"rating": 5.0, "review": "I live in Costa Rica hence my initial worries were: would there be any problem with Netflix?  Would it connect with my tablet and iphone fortunately  it connected in a snap with both.  The quality of video is very good as well as the sound. I am very satisfied with this device.", "verified": true, "helpfulness": "0/0", "author": "Rodolfo Tacsan Ch \"rodolfotc\""}, {"rating": 1.0, "review": "I brought the chormecast device and it did not work I followed the direction and all I received was a bunch of different pictures fliping on my tv screen", "verified": false, "helpfulness": "2/3", "author": "jerry"}, {"rating": 4.0, "review": "Had issues getting this to work initially on our home Wi-Fi network.  Even after speaking with a very helpful and knowledgeable representative from Google we still had to search newsgroups to see how others were troubleshooting networking problems.  Our problem was that the Chromecast device came up right away on our Wi-Fi net, I could see it and connect to it from any of several client devices (e.g., laptop or tablet), but it couldn't access the internet through our Wi-Fi router/firewall.  I finally stumbled across a solution, but I can't fully explain why my solution worked.  I tried assigning the device a static IP address from my Wi-Fi router setup menu and put it in a DMZ - giving it unfettered access to the internet through our firewall.  After doing that and rebooting, suddenly the Chromecast could see the internet and immediately \"phoned home\" to pull down a software update.  After it rebooted itself it began working flawlessly.  Not wanting to leave it exposed to the internet outside my firewall, I then changed the firewall settings to move the Chromecast back into the protected part of our home Wi-Fi network.  The Chromecast  continued to work fine, passing network traffic through our firewall without a problem.  Our internet service is through Time-Warner Cable, and we have a Motorola Router/Firewall/Wi-Fi device.  I'd give it a higher rating if not for the networking issues some folks seem to have when trying to first set up their device on their home Wi-Fi network.  I don't see how  you can beat it for the price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was easy to get up and running. My little Google Nexus tablet has now become a workhorse for chromecasting from my Netflix and Youtube apps.", "verified": true, "helpfulness": "0/0", "author": "John M. Howland"}, {"rating": 5.0, "review": "Very good item. Easy to install. The best! Can watch any movie from Netflix or youtube. My kids love it.", "verified": true, "helpfulness": "0/0", "author": "Vina Huynh"}, {"rating": 5.0, "review": "Awesome. Easy to use, and worked right away. We don't have cable, but have Netflix so this was a great buy for us. The only downside is that it will sometimes stop working with particular sites because it's still in beta.", "verified": true, "helpfulness": "0/0", "author": "O.Rodriguest"}, {"rating": 4.0, "review": "Have tried this and the Roku 3. This item works great but because it needs a smartphone or tablet I would consider it more techie than the Roku3. Mine got pretty hot when using the USB at its power. Used my Instaoutlet for the power and didn't get near as hot. Not sure why.", "verified": true, "helpfulness": "0/0", "author": "Jill Kaskel"}]