[{"rating": 5.0, "review": "Love this! Easy installation and provides awesome addition to our tv. Love the pandora feature. We have this hooked to our tv in our bedroom and play pandora sleep music all night! Pandora also starts a slide show of beautiful nature scenes automatically while music playing....it's awesome! So great to be able to watch the great amazon prime shows/movies on a big screen. Voice activate feature on remote is very cool as well. Great product all around!", "verified": true, "helpfulness": "0/0", "author": "Marisol"}, {"rating": 3.0, "review": "The item is very compact and fairly easy to setup and use.  Controls are very intuitive and I love the voice commands.  My biggest complaint is that while I browse all of the different categories I see very little of the hundreds of videos I'm eligible to see as Prime member.  In most of the categories I will see some prime content and a lot of the content that I have to pay for.  I would like to access the Fire TV and see ALL of the content (movies) I'm eligible to view as a prime member as well as other content I might want to pay for.", "verified": true, "helpfulness": "2/2", "author": "gizmo7"}, {"rating": 5.0, "review": "I purchased this for my husband for Father's Day and he LOVES it! I am quite the rock star for choosing such a fabulous techie gift for him... I am still getting praise for my gift selection! We have Amazon Prime and so we are enjoying all of the free movies and it has dramatically expanded our use of Netflix. The set-up was incredibly easy and the voice recognition works very well. I am really impressed with the product. We also have Apple TV (in another room). Comparably, I prefer the Amazon Fire TV product. It is much easier to use and the remote is much more intuitive.", "verified": true, "helpfulness": "0/1", "author": "Michelle"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/1", "author": "The Old Crone \"Bon Vivant\""}, {"rating": 3.0, "review": "I purchased a Fire TV device April 3rd, the day it was released.  Initial results were very positive. In June, flaky things  began happening, e.g. flickering screens, strange responses to remote inputs.  I was able to clear those by rebooting the unit.  Now i've lost audio. I called tech support (rapid response!), and spent 30 minutes debugging/re-cabling/reseting/rebooting all without positive result. I  repeatedly asked for a replacement unit and was told it wasn't possible.  What is the 1 year warranty for?Nice  when it works, but not worth $100 for 3 months.  Amazon, I'm disappointed in you!UPDATE: Finally contacted someone at tech support who initiated a replacement unit.  Works OK, but still a few minor navigation faults.", "verified": true, "helpfulness": "2/3", "author": "Richard S. Pruss \"avgeezer\""}, {"rating": 5.0, "review": "Watch Fire TV just about as much as DirecTV now.  May get rid of satellite all together.", "verified": true, "helpfulness": "1/1", "author": "Steve P \"4freds\""}, {"rating": 5.0, "review": "Awesome! So fast! So Easy! Beyond expectations! Set up in seconds. Together with Amazon Prime there is no better way to watch movies.", "verified": true, "helpfulness": "1/2", "author": "sas1066"}, {"rating": 5.0, "review": "I love the device, but the selection of programming leaves a lot to be desired.  What I mean by this is the Amazon Prime streaming.  One has to drill down to determine if a programming choice has the option of Amazon Prime streaming which no cost.  The first selection is to pay for the episode.  If one didn't know to move over to \"view more viewing options,\" one would pay to view what has already been paid for through Amazon Prime.  If anyone knows how to mitigate this lack of functionality, please comment.  Admittedly, I'm a Netflix, etc. streaming user where one doesn't have to pay beyond the subscription fee.", "verified": true, "helpfulness": "0/0", "author": "Howard Freeman"}, {"rating": 4.0, "review": "It's good, I like it and I know it should be five stars, but this still needs more improvements and by improvement I mean more content", "verified": true, "helpfulness": "0/1", "author": "Villanueva G"}, {"rating": 4.0, "review": "a lot better than roku, but still hangs up about everynight whenpeople get finished with supper an get on the internet", "verified": true, "helpfulness": "0/1", "author": "RV \"RV\""}]