[{"rating": 1.0, "review": "Dolby Digital out on the fire TV only works with MP4 files, not anything else.  This means that it's pretty poor as a PLEX client (one of the featured launch titles, and the primary reason I bought this device).  I'll have to go back to using my power hogging PC which this would have replaced quite nicely.", "verified": true, "helpfulness": "2/10", "author": "E. Ho"}, {"rating": 4.0, "review": "Love itthe quad core proc is fast, easy setup, plenty featuresone minus, I wish you could set the device to search only on prime enable movies, my kids do not know the difference between prime and else. this is a feature that would make a world of difference.you can load Plex which is very cool", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 1.0, "review": "Amazon prime is a waste of money!  Do not buy this product!  Very few free movies, you have to rent most movies to watch them.  Though the actual box you can't tell which movies are for free.  The picture and sound quality is better than other services but over all I cannot recommend amazon fire tv.", "verified": true, "helpfulness": "1/13", "author": "John P Gardea"}, {"rating": 4.0, "review": "We think the quality of this unit is very good.  For Prime members there are many free movies and TV series.  It is very easy to install.  Great mobile device.  We ordered when we were vacationing in the desert.  Used it in a rental for several weeks, then took home with us.  Of late we have been having some trouble with Pandora because it no longer shows the song currently playing.  We don't know if this problem is with this Amazon unit or with the Pandora app.  But for this issue, we would have given it a 5 star rating.", "verified": true, "helpfulness": "1/3", "author": "Jerry"}, {"rating": 5.0, "review": "I LOVE the Fire TV. IT was easy to set up, and only having it hooked up for 3 hours, we're on our third movie. Can't wait to play with it some more and check out the rest of the ammenities. Would definitely recommend instead of buying a smart t.v.", "verified": true, "helpfulness": "0/0", "author": "Dawn Gilson"}, {"rating": 1.0, "review": "Sucks.........Can't watch any movies without paying $99 for Amazon Prime. Very unhappy and NOT paying an extra $99 at one time.  Needs to be pay by the month.", "verified": true, "helpfulness": "4/19", "author": "Barbara Kosloski"}, {"rating": 5.0, "review": "Really enjoying Amazon Fire TV. Movies,TV,games, your family photos on the TV. Better than spending money every month on Premium channels on cable. You can't go wrong with this TV accessory especially if you are an Amazon Prime member.", "verified": true, "helpfulness": "1/2", "author": "Alexander Giovanelli"}, {"rating": 5.0, "review": "I have both Roku and Apple TV but of the three I like this one the best.  Size is perfect to fit under my sound bar and the duel band communication really removes all delays from both Amazon streaming and Netflix.  BTW my kids love the games.  Great Job!", "verified": true, "helpfulness": "1/2", "author": "RealReviewer"}, {"rating": 4.0, "review": "nice little box just just wish it had mlb.tv streaming is very  good only compllaaint is voice search does not  work for someone with a speech impediment", "verified": true, "helpfulness": "1/2", "author": "Geffery Curtis"}, {"rating": 4.0, "review": "We like Amazon Fire TV. Thank you for making HD streaming video easy to access and fun to watch. I know that this is just the beginning; but the cables and sat guys are in for a big surprise. Somebody needed to remind them who and watch service is all about. Thank you!", "verified": true, "helpfulness": "0/1", "author": "Blake Higginbotham \"Blake Higginbotham\""}]