[{"rating": 3.0, "review": "It works, but picture quality is not the best and it is heavily reliant on your internet connection speed and quality of your wi-fi. But it does the job as described if you temper your overall expectations.", "verified": true, "helpfulness": "0/0", "author": "R C"}, {"rating": 5.0, "review": "Good From Google, Better when go with Amazon. com.. Thanks. Stu.", "verified": true, "helpfulness": "0/0", "author": "Stewart Campanaro \"Stu Campanaro\""}, {"rating": 4.0, "review": "As advertised.  Needs more supported function from Google.", "verified": true, "helpfulness": "0/0", "author": "Don K. \"retired IBM\""}, {"rating": 5.0, "review": "I've had the Chromecast since May 2014 and I use it along with my Nexus 7 (2nd gen) and a 4 year old Samsung plasma TV. The Chromecast dongle is plugged into one of the TV HDMI inputs and the Chomecast's USB power cable is plugged into the TV's USB port. When I turn on the TV, Chromecast powers on as well. When I open the Youtube app on my Nexus 7 there's a tiny screen icon you press and a window opens to display your Chromecast username. Tap \"connect\" and my TV automatically switches to the Chomecast input and you see the Youtube clips. I've been using it with the Youtube app and it's been working flawlessly allowing me to view Youtube videos on my large screen TV instead my small Nexus 7 or computer monitor. I was originally disappointed to realize that the android Chromecast app didn't allow me to stream the Nexus 7 screen to the TV. You could only stream with certain apps that had the Chromecast connect button. With the latest Chromecast update (July 10,2014) disappointment has turned to jubilation! Since updating the Chromecast app yesterday the Nexus 7's Quicksettings menu now has a \"Cast Screen\" button. As soon as I connect to my Chromecast I instantly see my Nexus 7 screen mirrored on my TV screen. There's a split second lag which is negligible. I can cast my tablet's photos and videos on my TV. I can even watch a game app on large screen. The picture quality and audio were great. For those who don't have the latest \"Smart TVs\" you can now enjoy your Nexus 7 screen on a large screen TV. Well worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Jimmy \"T\""}, {"rating": 5.0, "review": "This was a Father's Day gift for my husband and he is still thanking me for it!~  He loves it!", "verified": true, "helpfulness": "0/0", "author": "Maryann Maiava \"MAREM\""}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Moahmmed Jafar Ahmed"}, {"rating": 2.0, "review": "Get a Roku, this thing is very awkward. I still can't get it to fill out the TV screen. From the horrible help files it looks like I need to buy a chromebook to adjust this. My movie just finished so I have to find my netflix app on this tablet to start another instead of just picking up the Roku remote. Everything about this thing is awkward.", "verified": true, "helpfulness": "0/0", "author": "William Barrett \"stareagyl\""}, {"rating": 5.0, "review": "Very nice! Everyone should have one and so simple to use.", "verified": true, "helpfulness": "0/0", "author": "teresa wright"}, {"rating": 3.0, "review": "It is good. I wish it would work with all movies and such.", "verified": true, "helpfulness": "0/0", "author": "Lifeloving"}, {"rating": 5.0, "review": "Once I finally, FINALLY, succumbed to having an HD television, getting one of these was a no-brainer.I shouldn't have waited so long to get either!!!", "verified": true, "helpfulness": "0/0", "author": "Dave Zarco"}]