[{"rating": 1.0, "review": "\". . .send anything on the web to your TV from your smartphone\" (per Google) for the price of, say, a fast food dinner for two sounds too good to be true and, alas, it is not true; but it's false advertising. Another Google product thrown into the market before perfecting it. You can watch streamings like Netflix and You Tube on your TV with your Android smartphone, but you can't surf the web because, listen to this, you need a Chrome browser extension that (duh!) Google has not yet made available for its own Android OS (!!!) but only for Windows, and other OS's. Thus I'm returning this disappointing thing. I was an early grateful admirer of Google for opening new horizons for users, but over the years the founders' principles seem to have been eroded by subsequent managements to the point that Google is now following Microsoft's fate. At present there is no reliable gadget for surfing the web on your TV using a smartphone; there's a rumor that Amazon is planning one that would do the job. Let's hope so.", "verified": false, "helpfulness": "2/4", "author": "Doctor T"}, {"rating": 5.0, "review": "I initially bought a Chromecast for myself and fell in love with the simplicity and value of the device.  Setup was very simple through the smartphone app so that just about anyone could figure this out with the device completing its first auto-update upon first use.  When I purchased my device on Black Friday 2013, only a few specific apps were available but since then, many others have come out.  I would certainly recommend that everyone with a \"dumb\" HDMI-capable TV at least few years old invest in a Chromecast to add years of use to your TV.  The user experience is so much more polished than a similar Network enabled BluRay player.  As just a random detail, follow the suggestion in the instructions to power the device from the included USB power adapter rather than from your TV's USB (if equipped) so that the HDMI link (e.g. Regza-Link, etc.) allows it to control your TV power and inputs automatically.  Since my initial purchase, I've given three Chromecasts to friends.", "verified": true, "helpfulness": "0/0", "author": "Joe Cloyd"}, {"rating": 2.0, "review": "I was excited to get a Chromecast for Christmas.  My excitement quickly subsided though when it took me more than 3 hours to get the Chromecast device to connect to my wireless network, and I don't even have anything weird like an obscure router or unusual settings. It would get to the screen where it said 'connecting to network...' and just sit there for five minutes without doing anything else, and require removing the USB power connection for it to come back.  Once I finally did get it to connect (by using the iPhone app to configure rather than the Windows and Mac clients), half of the services that it is supposed to support didn't work.  Netflix, for example, if it would even start streaming at all, would only show the first couple frames of the video then it would play only audio the rest of the time.  Web browsing worked, but with a very noticeable lag and visible loss of image quality.  The only service I got to work consistently was Hulu Plus, which due to its nature has limited interesting content.Google still has a lot of problems to fix on this device.  If I was buying I'd hold off for a few more software updates.  It is really buggy right now.", "verified": false, "helpfulness": "0/1", "author": "D. Johnson"}, {"rating": 3.0, "review": "There is much you need to know, including files to download, but there is no instruction information to help you make it work.  The tech support people are very helpful and once you reach them, your problems get solved but I question if that is the best way to deliver this product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Nope, it's not perfect. But for the price, it's a darned good deal. It makes it possible for our low-end television to watch Hulu plus, Netflix and You Tube, with other services supposedly in the pipeline, including Amazon Prime, I'm told. It couldn't be easier, either.  Just plug the thing into the back of the TV and follow the [easy] instructions on the screen. Then, you can download the appropriate Google Apps for say. Hulu and You Tube, and away you go.  You can control your television from your laptop, smartphone or tablet. (We use either my Kindle, a MacBook or an iPad, and any one of the smartphones, if that's what we feel like) Everyone gets to have a remote, with just the gadgets we carry anyway.Is it perfect?  No.  It doesn't work with our Tivo, and there are fewer services than we were led to believe.  But the price was incredibly cheap, the installation was baby-simple, and the services we get work perfectly.  I can't wait for my Amazon Prime subscription to work with this thing, and I'll be floating on clouds!", "verified": true, "helpfulness": "0/0", "author": "K. Varraso"}, {"rating": 3.0, "review": "Google Chromecast Drops Internet signal too often but quality of signal when there is good.....would not purchase this item again", "verified": true, "helpfulness": "0/0", "author": "V Bogan"}, {"rating": 5.0, "review": "Works well once you download the app to your phone and play with it a little.  Instructions are straight forward but since each computer and phone are setup differently you will have to play with Chromcast to make it work to your satisfaction.  Works on my Samsung 51 in plasma TV very well.", "verified": true, "helpfulness": "0/0", "author": "Lee Powell"}, {"rating": 5.0, "review": "Overall Chromecast does what it says.  Image quality is HD which is impressive from wireless device.  It was easy to setup though I did have to change some firewall settings on my router to allow plug and play.  Only complaint is when going to next program on Netflix it will sometimes gets hung up, but that seems to be in the operation of Netflix.  Not enough of an issue to distract from buying and would recommend.", "verified": true, "helpfulness": "0/0", "author": "C"}, {"rating": 4.0, "review": "I love Chromecast.  I can find things on You Tube or Netflix and watch them all day long on the T.V.  I wish it worked with Amazon's Prime Video though.  Right now it is very limited in what it will work with.  I'm hoping some day it will work with Amazon's videos as it is something sold on Amazon's site, I would expect it to be compatible with their products.  My kids bought this for me for Christmas and I absolutely love it.  The only reason 4 stars instead of 5 is because it doesn't work with some of the things I'd like it to.  I can cast a webpage or cast the desktop (experimental) to the T.V. but there is quite a bit of lag and movies and videos don't work well when viewed in this manner on the T.V.", "verified": false, "helpfulness": "20/24", "author": "Wingnut"}, {"rating": 2.0, "review": "The videos which accompany the pitch for this product are very upbeat but also very juvenile. They contain almost no useful information and are edited with lots of very short scenes with lots of background movement. I still don't have any idea if I should buy this or not.  Kind of sad. Perhaps Apple TV is the better choice???", "verified": false, "helpfulness": "0/0", "author": "M. Loftus"}]