[{"rating": 3.0, "review": "It is awkward to use. I think I will stick with my Roku. I am a Google fan, but they missed the mark with this one.", "verified": true, "helpfulness": "0/0", "author": "Dirk P. Dorresteyn \"Dirk\""}, {"rating": 5.0, "review": "I love this thing.  I leave it on my Bedroom TV and control it with my iPhone.  No buffering, clear picture and sound...and I can use the closed captioning which is easily controlled through the phone.  What a cool invention.", "verified": true, "helpfulness": "0/0", "author": "nellapaul"}, {"rating": 5.0, "review": "For the money, this gadget is unbeatable. You can use it on multiple TV's (not at the same time) and the picture quality is excellent. To the naked eye, the difference between 720 and 1080 is virtually non-existent. If you sit closer that 10' and have a screen that is over 65\", you might want to be prepared for a very slight difference. Stream from multiple TV apps, Amazon, Netflix, YouTube, Hulu, the list goes on.", "verified": true, "helpfulness": "0/0", "author": "KEN W \"K\""}, {"rating": 4.0, "review": "This little device, is great for what it does, but 2 cons:- The lack of services- You can only use it in the U.S. (in my case, i have to pay for a VPN so i can use it, even with youtube)", "verified": true, "helpfulness": "0/0", "author": "Alfredo Mascimo"}, {"rating": 5.0, "review": "Works perfect for 30$ the only problem with it is the lack of apps the video quality is really good and smooth", "verified": true, "helpfulness": "0/0", "author": "Felix Tejada"}, {"rating": 5.0, "review": "very pleased with the product. Waiting for more apps, but otherwise very happy. It was worth the price and glad I bought from Amazon", "verified": true, "helpfulness": "0/0", "author": "George R. Clark"}, {"rating": 2.0, "review": "If you are a Verizon FiOS subscriber and use one of their routers do not waste your time ordering this device. Due to Verizon's stake in Redbox, their routers will not recognize or synch with the device. Spent a good couple of hours trying a variety of workarounds found on the Net and Verizon message boards none of which worked. I gave it the rating I did because of the incompatibility issues. Check with Chromecast's FAQ page before placing your order to make sure it works with your router.", "verified": true, "helpfulness": "0/0", "author": "Henry A. Siarczynski"}, {"rating": 3.0, "review": "You have to purchase an app to watch your own videos,  it was only 3 bucks but it was un expected.", "verified": true, "helpfulness": "0/0", "author": "Austin Battle"}, {"rating": 5.0, "review": "Excellent quality and service! This device will allow your TV to play videos from Netflix and YouTube, and even does on the big screen, the same that you use on your smartphone, tablet or laptop. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Yelena"}, {"rating": 1.0, "review": "Buy a Roku box instead. This was a real disappointment that oversold. I thought we'd be able to stream off everything, but it was just too difficult.", "verified": true, "helpfulness": "0/0", "author": "Has"}]