[{"rating": 1.0, "review": "I bought this thing so I could cast my browser on screen. Every time it starts shows my browser on screen for 3 seconds and then crashes. My chrome browser is completely up to date, my computer is well above the minimum requirements. It just simply doesn't work.Google... FAIL!", "verified": true, "helpfulness": "0/0", "author": "Brad Ellis"}, {"rating": 4.0, "review": "He likes it because now he can watch his Youtube videos on the TV. However, he was slightly disappointed that it won't pay the movies in his computer on the TV - I think he needs additional hardware in order to do that.", "verified": true, "helpfulness": "0/0", "author": "blueberries"}, {"rating": 3.0, "review": "Chromecast works perfect. Very easy installation less than five minutes.  I use for Netflix and YouTube. Wish it would work with Amazon Prime streaming.", "verified": true, "helpfulness": "1/1", "author": "FixItMyself"}, {"rating": 4.0, "review": "Expect the app to lock up a lot.The dongle profile is small and if your tv does not have a usb port the ac adapter is a great alternative.the fact you can stream almost any page is great. There are limits, but is very promising!", "verified": true, "helpfulness": "0/0", "author": "Manuel"}, {"rating": 3.0, "review": "As advertized", "verified": true, "helpfulness": "0/0", "author": "john williamsen"}, {"rating": 5.0, "review": "My Chromecast was really easy to install.  I have been able to also install the software on my tablet and smartphone just as easily.  I have two guest bedrooms in my home that do not have my cable tv system attached, due to costs.  However, when I have guests staying over, they can use the Chromecast and get tons of options because I have the wireless access in the house and all they need to do is download the Chromecast app to their smartphone, and go.  It also has come in handy when travelling in hotels that have WiFi in the rooms.  Definitely a good purchase for me.", "verified": true, "helpfulness": "0/0", "author": "Anthony Jones"}, {"rating": 5.0, "review": "Good value, easy setup. Would definitely recommend ! Attractive, easy to use, great value. Got it easily. Good value. Enjoy it.", "verified": true, "helpfulness": "0/0", "author": "gmajulia4"}, {"rating": 4.0, "review": "It is great but it only fits hdmi flat screen. I guess not all flat screens fit this product. lol", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Chromecast is one of the simplest, yet useful devices I have ever used or purchased. It basically sets itself up, and I am looking forward to more apps with Chromecast support.I will be purchasing another soon for a separate TV in my home, as well as one for my parents in another state. GET ONE!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "After installing it my Samsung led tv would not recognize any other video source. I had to unplug the Chromcast and power down my tv to get to my normal video sources. There is probably a way around this but I already have enough to do without having to study this too. I'll give it to someone with nothing better to do.", "verified": true, "helpfulness": "0/0", "author": "Ron Supat"}]