[{"rating": 3.0, "review": "Its a good but u can't use all the apps u have on ur phone and tablets.Need to make it so u can use all the apps on ur phone and tablets.", "verified": true, "helpfulness": "0/0", "author": "jeremiah"}, {"rating": 5.0, "review": "Really good product, purchased 3 actually. Obviously 1 for myself and another 2 were given away as birthday gifts.All this little baby requires to run smoothly is a stable internet connection and a smartphone / tab, with decent specs, any device 2012 onwards.Note: this device is useful mainly to people (like myself) who have spent a good amount of money on their HD TV's a couple of years back and are not looking to upgrade to a newer model just for the added \"smart\" capabilities...  this little device should be just fine for you.", "verified": true, "helpfulness": "0/0", "author": "R. James \"Russell James\""}, {"rating": 1.0, "review": "It uses up the wireless bandwidth while streaming a video, even at lower video quality. I have a decent Netgear Wireless-N router, but it is not good enough for this dumb device. Why did they make this only for wireless network? I have the router right next to the TV, and could connect this device to the router directly using an ethernet cable - one less wireless bandwidth eater.I should have returned it immediately, but haven't. Wated my money. Hope they can come up with a better design / performance.", "verified": true, "helpfulness": "0/0", "author": "H. Im \"Toollover\""}, {"rating": 1.0, "review": "Its too difficult to get it working.I'm still trying. There's too many confusion steps and I still cant make it work.", "verified": true, "helpfulness": "0/0", "author": "Donald A Weston"}, {"rating": 2.0, "review": "This is the second Chromecast device I've tried; the first worked great, easy setup, for several days; then it fell off my wifi network, and I was unable - even after multiple device resets - to get it to reconnect. Thinking it may be a device defect, I got a replacement - once again, the new device worked great ... for several days; it, too fell off the network. This one, though, will reconnect to the network (briefly) upon a restart, but promptly falls off again. Useless device if it CAN NOT RELIABLY KEEP A WIFI connection. Disappointing. FWIW, my router is relatively typical - Netgear WNDR3700 AP.", "verified": true, "helpfulness": "0/0", "author": "Ali S \"netarc\""}, {"rating": 5.0, "review": "It's so darn cheap for what it does.What I use it the most for:-Hooked it up to my TV in bedroom, sit on phone, subscribed to documentary subreddit and video subreddit which just about all youtube links, cast to TV and enjoy.-Desktop in one room, open Chrome, find file directory within Chrome where I store all videos, play video within browser, cast it to Chromecast and enjoy.Now that the SDK is out, I only expect more to come from this incredibly versatile device that cost me sub $35.", "verified": true, "helpfulness": "0/0", "author": "VXV"}, {"rating": 5.0, "review": "Thing works perfectly for our family.  One tv downstairs but multiple phones, tablets and computers.  When the family finds something they want to share we all view it on the tv together.  Perfect for youtube and netflix.  I can't wait to see what they do with future apps.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Chapman"}, {"rating": 4.0, "review": "Upgraded my phone, and decided to give this a shot. Did not know this works with pc's.Setup was a hassle.  I have a linksys e2500.  Chromecast would connect, but unable to use internet issue. Set up my old phone for tather router (Did not have simcard for my new phone yet) and updated the chromecast device. Worked great after the update. No need to disable antenna, or look for features I did not know exist.Was disappointed that the application for casting local media was free, but required an in app purchase of $2.99 or so to unlock the casting feature.Overall, I enjoy my chromecast. It was frustrating during the setup, but if you're having issues, try to find a different network you can temporarily use to get the latest updates before reinventing wifis.", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer \"kombat pikachu\""}, {"rating": 5.0, "review": "Excellent device.  Very easy to install and use.  Good quality of picture.  No buffering.  I would recommend this product to anyone that loves movies", "verified": true, "helpfulness": "0/0", "author": "Tommy Carroll"}, {"rating": 4.0, "review": "I really love that my not-Smart 65 inch TV can now stream Netflix and Youtube. I don't love that it seems pretty limited to those two options. Product is a great way to cheaply get the internet to you TV, but I am still waiting for the viewing selection to be as expansive as Roku.", "verified": true, "helpfulness": "0/0", "author": "Billy F"}]