[{"rating": 3.0, "review": "The \"selections\" remain painfully limited and the feature that allows the laptop to connect to Chromecast really needs refinement.  It is ok for what it presently does but I am not just \"blown away\" with the coolness of the device.", "verified": true, "helpfulness": "0/0", "author": "billy77024"}, {"rating": 5.0, "review": "This little device has finally managed to give me Netflix on my TV, which for some reason Samsung was unable to provide on a high-end TV.I had a few nits with the product, but I still consider it good enough for 5 stars.1) Couldn't connect out of the box to my WPA2-PSK network (served by an Asus RT66U). I set up an open network, connected, downloaded updates, then reconnected to the protected network without a problem.2) Doesn't work on networks with address isolation or networks that require webpage login (hotel or public wifi networks). I consider this a problem with the networks, not the unit, though.", "verified": true, "helpfulness": "0/0", "author": "Rolf Larsson"}, {"rating": 5.0, "review": "Chrome cast works great only glitch I had was I had to up date my wifi router's firmware after that everything works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "it's an Awesome product  but  it  turns off and restarts  about 7  times a day which gets very annoying  after a while.  love the clear image !", "verified": true, "helpfulness": "0/0", "author": "Ms  Curly  Hair"}, {"rating": 4.0, "review": "Excellent device, comfortable to use, but when sometimes comp. is loosing a signal, device is loosing it too and you have to jump back to the comp and restore your signal on the TV screen. Great for the price and gives very good picture on your screen.", "verified": true, "helpfulness": "0/0", "author": "ilya fishov"}, {"rating": 5.0, "review": "For what it is and how much it costs, this thing is amazing! Its pretty responsive and while the support for it is limited right now I think it will get better. If you have netflix it is worth it just for that!", "verified": true, "helpfulness": "0/0", "author": "Alexander Anderson"}, {"rating": 5.0, "review": "Great value - It will be better when more options are added - as good as Apple TV but cheaper", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 1.0, "review": "If you believe the claims it is simply a plug and play device no instructions included or needed except those drafted by a lawyer. They try to join their WiFi Chromecaster device your existing Wi-Fi network devices.  If you have more than one wireless link the simple link now becomes more complex quickly with no information as to security settings, or meaningful descriptions of link problems that continue to occur. You can spend hours trying to get their WiFi to linkage to your existing network.  There is very little to no useful trouble shooting elements. If you do get it up and running for a \"Chromecast\" nothing seems to connect allowing to cast anything. A real downer... Much better documentation is needed, a much less buggy linkage to existing local networks, and an ability to actually \"cast\" to your TV from a phone or computer without the BSOD (black screen of death).  A Very poorly implemented good idea.", "verified": true, "helpfulness": "1/2", "author": "Whitney Skaling \"Making it with Technology\""}, {"rating": 5.0, "review": "Straight forward instructions, literally plug and play.  We are now watching Netflix and browsing on the web on our large screen tv from my ipad!", "verified": true, "helpfulness": "0/0", "author": "Raymond R Monahan"}, {"rating": 3.0, "review": "My main purpose was to use this to view files, mainly .mov fies, from my computer on the big screen. Most of the reviews said that it would do this. After running setup, which was very simple and easy by the way, I found that it would not play the files.  After some digging I found that Google had changed this ability due to some legal issues or something. Works great with Netfix and the other programs it was mainly designed for, but I already subscribe to them an have other products that play these for me. I've used it once since purchase.How ever, If you don't have other devices to view Netflix or the other programs, I would highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Raymond Lochard"}]