[{"rating": 5.0, "review": "The chromecast is the perfect gift. I love it. I use it for card games when I have people over or to watch Netflix and look at photos. I also stream movies with it. I almost want to by my whole family each of their own!. I highly recommend this to anyone with any knowledge of phones and casting devices.", "verified": false, "helpfulness": "0/0", "author": "Ben Campbell"}, {"rating": 3.0, "review": "This is an interesting product.  I have had a Roku for several years and really liked the platform, and did not think that I would ever switch.  However, I recently decided to stop moving the Roku form room to room and thought I would try one of the new streaming stick devices.  The Roku device similar to Chromecast was $50 whereas the Chromecast is only $30.  Having used the Chromecast, I cannot see how other similar products can go for so much where this product only retails for $30.  The concept is interesting and different from the standard Roku which is a platform that has all channels available in one place.  With Chromecast, you have to have several apps to make this product stream to your TV.  The Chromecast acts only as an interface to get streaming content from your phone, tablet, computer, ect... to go to your television screen.  If you already have Youtube, Netflix, Crackle, ect on your device then this is no problem.  If you have to add these apps then this is slightly annoying but tolerable. The video quality is not the best, Netflix plays slightly grainy but not bad.  In all this device is a great way to stream content to the big screen from your devices but this is not really a replacement for a full platform device like my Roku 3 but for the money, this is a cool way to get content from a device to your TV.", "verified": true, "helpfulness": "2/2", "author": "Chasin T Turnier"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/2", "author": "Russell Beem"}, {"rating": 2.0, "review": "This thing cannot mirror for its life. Very choppy movie streaming. Works well with YouTube, but as if it just went to get the video on its own from YouTube, and not exactly streaming from the phone if you know what I mean, more like your phone just tells it where to go in YouTube directly.Save you money. To me it's just a half baked scam from Google to keep you from buying a better competitors product.I bought 2 on Black Friday.....that are going back. Software up date is not going to fix a hard wear problem.", "verified": false, "helpfulness": "1/3", "author": "R. Patel"}, {"rating": 5.0, "review": "Excelent product.", "verified": true, "helpfulness": "0/2", "author": "Jorge"}, {"rating": 5.0, "review": "Chromecast is good and getting better all the time.For 35$ this is a great way to turn an old monitor or a pre-smart era TV into a more useful device.If your Chromecast isn't working, something is wrong with it. Return it.I can't see rating this anything but 5 stars.", "verified": true, "helpfulness": "0/0", "author": "K"}, {"rating": 4.0, "review": "Good product, easy to use and works great.  Doesn't have ability to view Dish network which would have been great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have an Android phone and also an iPad and using the chromecast with each item is a lot easier than buying separate peripherals for each operating system,of course the chromecast has its limitations but it is well worth the money", "verified": true, "helpfulness": "0/0", "author": "don"}, {"rating": 5.0, "review": "Love the new features.", "verified": true, "helpfulness": "0/1", "author": "Carolina Marroquin"}, {"rating": 5.0, "review": "Its the best $35 dollars I have ever spent.", "verified": true, "helpfulness": "0/0", "author": "William Buckley"}]