[{"rating": 3.0, "review": "Requires new system to download.  Have to buy a new computer to be able to use this?  I don't think so...", "verified": true, "helpfulness": "0/1", "author": "gary mosse"}, {"rating": 5.0, "review": "I don't need it to stream my media from the laptop - that's what Plex is for. All my music is in on Google Play and that casts perfectly. The apps work perfectly with \"Chromie\" (as I named it during setup). I just sit back with my iPhone in hand and now my TV is the media hub. Super easy setup - just follow instructions.", "verified": true, "helpfulness": "1/1", "author": "stvgrc"}, {"rating": 5.0, "review": "Does exactly what it is supposed to with ease.  Love it, and have bought more for friends and family.  Every app that i have tried works great.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Crook"}, {"rating": 2.0, "review": "I was very disappointed with Google Chromecast. You must have another device such as iphone,android phone or tablet or Laptop or desktop. It is good if you want to stream youtube to tv other than that mind as well purchase a sony google tv or something else where you have full functions All in One device from there you can do your search and things.Cons.PC TO TV quality is really bad other than YouTube.You need a super fast computer coz chromecast will show your computer down.Pros.Good to send youtube videos to TVGoogle music to tv.MISCWhy do I need a Chromecast, to stream Netflix to tv when we already have tons of apps and devices which can connect to Netflix already for TV.", "verified": false, "helpfulness": "0/2", "author": "zuber"}, {"rating": 5.0, "review": "This is my second Chromecast and I can't say enough about it.  I watch more TV and movies via Chromecast than I do any other way.  I use my iPhone to purchase movies on Google play which can be accessed through the YouTube app.  You just select the TV you want to cast to, click play and you're watching a movie.  I also use Netflix to cast quite a bit.  I may actually drop my Comcast TV subscription because I can watch anything I want through these two methods.  My brother in law has Apple TV and its junk.  It constantly buffers and the resolution goes in and out.  They have the same internet provider I do so I'm pretty sure its the box and not the band.  I had another friend who also was having issues with Apple TV.  I let him borrow one of mine for an evening.  He called about 30 minutes later and said he was going to replace his Apple TV.  He's an Apple fanatic but I guess sometimes you have to know when to say when.  Its what I've come to expect from Google.  A small price for a ton of value.  Very impressed with this product.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 3.0, "review": "I love the in-app playback for the most part. Netflix streams seamlessly most of the time. The issue I have is when casting from websites. Hopefully Hulu will be supported in-app sometime soon, because the glitches and buffering when casting Hulu Plus from my computer is mostly infuriating (lag in playback, buffering, out of sync audio, poor quality). Paid services shouldn't look, feel, or behave like they're bootlegged. It's also inconvenient that my laptop needs to be plugged in while casting - defeats the purpose of having all this wireless capability.", "verified": true, "helpfulness": "0/0", "author": "Jennifer A Crowley"}, {"rating": 5.0, "review": "I bought Chromecast to stream videos from Netflix to my television.  It was relatively easy to set up and  I watched an entire movie with no problems.  I also discovered I can start streaming the movie and then use my Ipad for other functions.  Life is good!2 things to note:  You need WiFi in your home to use Chromecast.  And, if for any reason it fails to play, log out of NetFlix, clear your cookies and restart (at least that's what worked for me.)I am a very happy customer!", "verified": true, "helpfulness": "0/0", "author": "D. Abrams"}, {"rating": 5.0, "review": "I gave this to my boyfriend as an early Christmas gift and we both love it! I'd highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Ashley Mennillo"}, {"rating": 5.0, "review": "this device is a must have to stream your favorite apps. Its only going to get better as more development opens up and other services jump on it.", "verified": true, "helpfulness": "0/0", "author": "Antoshka"}, {"rating": 5.0, "review": "It's really not worth overthinking this. I got it just to play Netflix on our bedroom TV which already has an older Apple TV attached (a model that doesn't support Netflix). I don't want new Apple TVs yet because the current hardware has been around a while and it's no big deal to wait and see what comes out in 2014. In the meantime, why not add this even if it is only for Netflix? It's cheap, it's simple, and it works. And when it gets kicked out of the bedroom it will be no big deal to leave it unused. Except it won't be because there's always someplace this can be used - a home office, for taking on trips, something. I'm glad I have it around.", "verified": false, "helpfulness": "1/1", "author": "AJ"}]