[{"rating": 5.0, "review": "At this time it serves as the best standalone streaming device for digital media. I have a Xbox One, PS4, Roku XS, Apple TV 3rd gen, and Chromecast with subscriptions to Netflix, Hulu, and Amazon Instant Video. I can say with confidence this is the Best Streaming Device out right now.What separates the Amazon Fire Tv from the rest? The ways to access your media on almost any device is a HUGE selling point for me, I have been looking a way to invest in buying digital media such as movies and now I have access to them on my Xbox One, PS4, Roku, Chromecast and Apple Tv (through mirroring from iPad).Pros:Access to media on almost all devices and stream or download them to the device of choice with the Amazon App.Has 1st party games, can play Android games with a controllerEasy to make purchases and link to your Amazon account Day 1Has a microphone for easy searches of movies, actors, tv shows...etc...Small sleek design and takes minimal spaceEthernet out, Optical out, 7.1 surround sound, Dual BandYouTube support is best with ways to like, sub, and comment.HBO Go coming soonPLEXCons:-Due to Amazon Kindle being a competitor with other Android based devices, streaming Prime on Android devices have to be watch using a flash browser such as (Puffin) because lack of Amazon Prime Instant Video app in the Google Play Store-No Spotify sadly-No voice search within other subscriptionsI'm very experience with all devices of this genre, this by far is the best bang for your buck and Highly Recommend it!", "verified": true, "helpfulness": "2/2", "author": "Fox_Mamba \"Gamer Who Loves To Read\""}, {"rating": 2.0, "review": "Bought this for my mom... The ad on anazon makes I look like there's a separate amazon instant video app which if there is. I can't find. Netflix will work on it but amazon Instant video doesn't. Defeats the point of buying it", "verified": true, "helpfulness": "1/6", "author": "Gema Gomez"}, {"rating": 5.0, "review": "So it's important to note the reasons I purchased this product in the first place. I mainly wanted to stream Prime and Hulu to my TV. I had a device to do that, but it required me to give over use of my laptop, and I often like to do stuff online while I'm watching TV. So I wanted a new device that would bypass the computer and stream directly to my TV. I considered Chrome, Roku (box and stick), and Fire TV. The kicker for me was the 5 payment plan Amazon offered to me to buy it, due to my being a Prime member for 2+ years. (Thank you, Amazon!)For the reasons I purchased the Fire TV, it works perfectly. I love it.Though I did not purchase it for this, I also love that there is a YouTube app, which I did not have on the Roku I owned a couple years back. I love it. I am also enjoying music discovery on the iHeartRadio app, though I wish there were a Spotify app. And it's good to know that if I choose to subscribe to Netflix, I can get that app too. I do not play games, but I might want to at some time in the future. Oh, and I signed up for the cloud, so I can view my personal pics and videos. Bonus!That said, there are a couple things that could be negative I want to offer up to anyone reading this:1. If you do not have an HDMI cable, order one with your Fire TV. I thought I had one, but didn't, and ended up spending almost 3x as much as if I'd just ordered it from Amazon. Also, I wanted to connect my Fire TV and play as soon as it came, but I had to run to the store for that danged cable first.2. Make sure you have decent bandwidth. 1.5 mbps is not going to cut it to stream video, especially if your ISP is unreliable, as mine was (lots of outages). I changed ISPs and upgraded to 15 mbsp, and now it's smooth sailing.3. This might make me seem like a whiner, but when I'm choosing something to watch on Prime, I can't always tell if the movie or show I'm looking at is Prime eligible. I would like Amazon to work on that. I find that sometimes I have to look on the website to see if it's included in Prime.Overall, I'm liking Fire TV. It sure beats paying for cable TV every month.", "verified": true, "helpfulness": "5/5", "author": "Laureen P"}, {"rating": 5.0, "review": "I LOVE IT. IT IS SO GOOD THAT I HAVE ABANDONED USING MY BLURAY AND NETWORK STREAMING. A GREAT DEVICE AT A GREAT PRICE.", "verified": true, "helpfulness": "0/0", "author": "golfcalc"}, {"rating": 4.0, "review": "Its works really well and its fast. No problems yet. Im glad I got it. Now if they could offer cable channels somehow so we could get rid of local cable that would be a neat trick.", "verified": true, "helpfulness": "0/1", "author": "pat"}, {"rating": 5.0, "review": "This is a wonderful product! It's very easy to set up and install. The programs are awesome and I'm hoping there will be more coming in the future. I'm a senior citizen with some knowledge of electronics and would recommend this product to any older adult purchase. Thank you Amazon!", "verified": true, "helpfulness": "1/1", "author": "Ruth A. Ban \"Book Lover\""}, {"rating": 1.0, "review": "I bought this mainly to watch MLB.  It works great but no MLB.  Good grief, we get MLB on our phones and our Kindle.  Amazon says it will be available \"soon\".  When is \"soon?\"  I shall be returning Fire \"soon\" if I don't get a better answer.", "verified": true, "helpfulness": "4/15", "author": "JLG"}, {"rating": 4.0, "review": "We ended up loving this device so much that we have canceled our cable and am now just going with internet. It puts all of your favorite app and entertainment in on place. I love the video game the game controller pad is a must buy.  My only complaint is that the box never seams to turn off and neither do the remote we went through one set of batteries in less than a week. I'm getting rechargeable batteries and will be unplugging the batteries from the remote when not in use.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 2.0, "review": "This box is not ready to replace your WDTV Live or HTPC if you have a large library of Movies and Television shows that you like to stream on your local network.It currently (5/14/2014) does not support local playback of MPEG-2 (DVD format and a handful of Blue-Ray) or VC-1 (HD-DVD and some older Blu-Rays).Could be supported in the future, but for now, this is not your machine.Currently, you would be better served with a Raspberry Pi running XBMC.", "verified": false, "helpfulness": "4/9", "author": "Brett Smith \"smitbret\""}, {"rating": 5.0, "review": "It has replaced my cable box.. but i would like to see the CBS and NBC APP on it but keep up the good work.", "verified": true, "helpfulness": "1/1", "author": "P. Porter"}]