[{"rating": 5.0, "review": "So far, so good. I got this on the deal for signing up for Sling TV. I have Amazon prime so this was a clear choice between the roku. I love the voice search. The buttons on the remote are kinda \"clicky\" and loud but overall this is not a huge con. I have it wired to my modem so not sure about wireless performance. I wish the menu for browsing Amazon prime movies and TV was a little more extensive but you can always just use voice search!", "verified": true, "helpfulness": "0/0", "author": "shaneb75or"}, {"rating": 5.0, "review": "Amazon Fire TV is fantastic, I had a Roku for years and it stopped working. Got this awesome product in the mail today, Have to say it blows the Roku out of the water. It was simple to set up, Took me 5 minutes. The picture and sound quality blows me away, Just what I expected from Amazon. I love the voice search feature, It works great. The box is small and hides easy under my TV, The remote is the perfect size and the buttons are laid out to make it easy to use. I own many Amazon products and have not been disappointed yet, Another great Amazon product.", "verified": true, "helpfulness": "0/0", "author": "J. McCloud"}, {"rating": 1.0, "review": "useless don't buy", "verified": true, "helpfulness": "1/5", "author": "NuNu"}, {"rating": 2.0, "review": "If you're  a prime member and live out of the US you will not be able to reap the benefits of free instant videos and movies.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So much better than chromecast. Could have some more selections on movies.", "verified": true, "helpfulness": "0/0", "author": "kevin cissell"}, {"rating": 5.0, "review": "Highly satisfied!", "verified": true, "helpfulness": "0/0", "author": "Krystle"}, {"rating": 5.0, "review": "Awesome, easy to install, easy to use and hours of endless music,movies, weather reports,radar,etc We joined Prime for the free freight and all of this is a bonus. I filled my wishlist of movies the 2nd day after I installed it and started filling our \"shuffle\" music immediately too. We're only half way thru our 30 day trial and I'm already sold on it. We're still exploring all of the many features", "verified": true, "helpfulness": "0/0", "author": "Jane Kirk"}, {"rating": 5.0, "review": "Hands down the best add on for a TV put our \"smart TV\" to shame Net Flix  and amazon prime HD looks better then some blue-ray we have here at home i have and will continue to recommend this product to friends and family and great when the kids bring there kids because of the content area on there just for them. this is not the new small stick version, get the box as it seems to do better at range in our house that has metal stud walls.....", "verified": true, "helpfulness": "0/0", "author": "Patrick the old geek"}, {"rating": 4.0, "review": "The only thing that I don't like is if I search for a TV show or movie the Amazon Fire TV will only show me the Amazon offerings and will not let me see that the movie for rent or purchase from Amazon is free on Netflix. C'mon, really? You have to open the Netflix app and search there. I wish there were better interfacing between the options. Does Amazon have to be so stingy? If I ended up renting or even buying something that was free on Netflix I would be pissed!The voice recognition does work pretty well though. But oddly, when you search, it will sometimes recognize exactly what you are looking for, so you click on it and then it displays, 'nothing matches this search'... well, that doesn't make sense if it understood exactly what I was searching for. I may not be able to explain that one well enough, but trust me, it's goofy. But overall, we really enjoy using it!", "verified": true, "helpfulness": "0/0", "author": "Peggy S. Ross"}, {"rating": 4.0, "review": "I have several of these including one's for my children and grandchildren . I felt this was was the greatest device for downloading movies ,series , TV series and Prime free music from Amazon , Netflix , Hulu Plus and many others . The quality was outstanding and much better than the smart tv's I have and light years ahead of the Sony and Roku devices I replaced ( 1080P NOT 1080I and much faster than the other devices, which hunt if the internet slows down ) . Suddenly last week Netflix is not available to my profile (various messages come up and there is no way to correct ) interestingly , if I use my children's profile, family or my husband's there is no problem with Netflix ! I've called Amazon numerous times and everyone is very polite but have been unaware of the problem except for the last manager I talked to today . She was very gracious and said there has been numerous complaints exactly like mine and promised to call me as soon as it was fixed. Certainly a 5 star device if they are not targeting individuals. Incidentally our family never uses more than 1 device at a time to watch Netflix. Why would they (Amazon or Netflix) target one individual ?", "verified": true, "helpfulness": "0/0", "author": "MissMB"}]