[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Love this product, so much potential with sharing web content with entire family versus huddling around your tablet.", "verified": true, "helpfulness": "0/0", "author": "Glenn"}, {"rating": 2.0, "review": "Expected more from it. All it does is stream something from your phone to your tv. I have a Firestick as well and I thought the chromecast would be better but honestly I recommend the firestick. I had to download a bunch of apps to my phone in order to get the best experience from chromecast. I don't like having too many apps on my phone. With the firestick, I'm just able to turn my tv on and all the apps are ready on my screen. No interaction with my phone is needed.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It work great. They are very handy.", "verified": true, "helpfulness": "0/0", "author": "JENAE GEISLER"}, {"rating": 3.0, "review": "This should work much better than it does. I find it buggy and frustrating. I can make it work but that's the problem. You have to make it work.", "verified": true, "helpfulness": "1/1", "author": "danno11"}, {"rating": 3.0, "review": "Well it's okay. I was thinking it would stream whatever is on my desktop to the TV. Not so much. Not even the \"cast entire tab\" works well. Very choppy. It's designed to cast some stuff but not everything. So, not sure what the purpose really is.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Chromecast works fine in streaming most things from my laptop to the A/V Receiver and then to the TV.  However, one of the key reasons I got Chromecast was to be able to stream photos from Google's other product \"Picasa\", which unfortunately, is not recognized at all, and so, I cannot stream all of my Picasa photos to the TV.  Very frustrating, and it is very difficult if not impossible to search for a solution within the Google links.  If someone from Google can email me a solution, that would be grand!", "verified": true, "helpfulness": "0/0", "author": "Anton H. Kobus"}, {"rating": 5.0, "review": "This is awesome! So easy to use! I can stream anything from my chromebook to my tv and the quality is great! Very pleased with this", "verified": true, "helpfulness": "0/0", "author": "mrose"}, {"rating": 2.0, "review": "Works inconsistently", "verified": true, "helpfulness": "0/0", "author": "Pastor WPP"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "juan carlos galvan"}]