[{"rating": 2.0, "review": "I stream from my pc to tv, and it keeps dropping, on and off very unpredictable.  Now i stop using it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I bought thinking that I could transform my tv in a smart tv, however Chromecast just works with Youtube and some others Apps, does not work with Google Chrome for example. I've tried to show on tv Google Chrome, Facebook and I couldn't. If you want just watch Youtube, Netflix and others tv/music/films apps it works really well, high quality of image.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Tatsch da Silva"}, {"rating": 1.0, "review": "RECENT: JAN 7, 2014; GLADLY one (the 2 returned keyboards)  (single, just only 1) ITEM has been returned as of right now..but please tell me,WHAT about all the OTHERS? They were all returned in ONE UPS PACKAGE!!?? ANd one of them is this GOOGLE CHROMECAST Streaming Media Player...??", "verified": true, "helpfulness": "2/2", "author": "TEE JAY \"TEE\""}, {"rating": 5.0, "review": "A very simple and easy piece of tech for your house. Plug, connect to your wifi and play. Also such a great price!", "verified": true, "helpfulness": "0/0", "author": "Mr. P.M.F. Baker"}, {"rating": 4.0, "review": "This item allows you to turn your TV screen into a large monitor.  Whatever you see on you computer can be cast to the TV.  The only thing I don't like is that the fact that if you cast video in high definition it stalls and breaks up.  You have to cast video at the 480 resolution to see an uninterrupted video.  Still, it's nice to be able to share what's on your laptop, tablet, or phone without having to pass the device around.  Set up was a bit trying on my Mac at first, but you can figure it out.", "verified": true, "helpfulness": "0/0", "author": "paul Setmaer"}, {"rating": 3.0, "review": "When stream movies from laptop, it lost connectivity with chrome browser on regular basis....video sound also got greatly reduced when streaming.", "verified": true, "helpfulness": "0/0", "author": "GE ZHANG"}, {"rating": 4.0, "review": "Once it is setup, it works great. It does everything I expected it would and the price is reasonable! Buy it!", "verified": true, "helpfulness": "0/0", "author": "Thomas S. Fries"}, {"rating": 5.0, "review": "This worked really well once I got it hooked up.  I had to use an AC connection that was luckily already installed behind my TV on the wall because my TV did not have a USB port (except for the service port).  Then I downloaded the chrome cast app to my tablet and boom!  I was in business.  Then I noticed one more problem.  I always watch TV in surround sound.  Since this was running directly into the TV, it was not connected to sound system.  Sooo, I ran an optical cable from TV to sound system and all is great.  All I have to do now is open an applicable program on my tablet, tap on the chromecast icon that now shows up as an option on the program, and it streams the program straight to the TV.  I can only hope that Google eventually adds more program options to the menu.  For example they have HBO, but what about Showtime??", "verified": true, "helpfulness": "0/0", "author": "bwan"}, {"rating": 5.0, "review": "Super easy to setup and use. I went from in the box to casting my netflix in about 2-3 minutes. Download and install your chromecast app and extensions after you order so you can get going as soon as it arrives!The only thing to note is that it is a bit more difficult to setup on hotel wifi if you plan on travelling. It can still be done but will need to have either a) a laptop/device that can share the wifi connection or b) use a travel router. Problem is the chromecast cannot login to hotel wifi as they usually require a name and password/room number instead of utilizing wifi passwords.", "verified": true, "helpfulness": "0/0", "author": "Kenny Chan"}, {"rating": 4.0, "review": "Because not everything can be visually transferred from Google Chrome.... (i.e. NBA League Pass Broadband), it\"s not worthy of 5 stars.", "verified": true, "helpfulness": "0/1", "author": "R. Gordon \"Flash Gordon\""}]