[{"rating": 4.0, "review": "It's a useful streaming HDMI dongle.  If you use Google Play or Netflix and a handful of other apps it works great. Your phone/tablet is the remote and it just works. Amazon Prime Instant Video isn't supported, but that's not Google's fault. More apps are adding support and the device gets more useful every month.", "verified": false, "helpfulness": "0/0", "author": "Timothy D McCormick"}, {"rating": 1.0, "review": "Did not work with Windows Vista, which was not pointed out clearly in product specs or ads.  Did not sync with my very common wifi, and created problems with wifi connections to other devices.  Not at all as represented.  Will be returning.", "verified": true, "helpfulness": "0/0", "author": "Cecelia Farmer"}, {"rating": 1.0, "review": "I made my research before buying and learned that i got brainwashed by paid posts out there praising this thing. I bought 3 on black friday and took them back the next day. You can only cast only from youtube and that's pretty much it. YOUTUBE ONLY.", "verified": false, "helpfulness": "0/0", "author": "Crazy Customer"}, {"rating": 4.0, "review": "Fun to broadcast videos, pictures, etc to the big screen TV.  Easy to set up. Just plug it in. I use this in one HDMI port and Amazon Fire in the other along with a Mohu Leaf - no cable- on that TV. We get plenty of entertainment options.I use Chrome with my smart phone, tablet, and laptop to stream with chrome.", "verified": true, "helpfulness": "0/0", "author": "Mister C"}, {"rating": 5.0, "review": "very good item", "verified": true, "helpfulness": "0/0", "author": "Jorge Mario Lopez"}, {"rating": 4.0, "review": "Occasional sound sync issues.  Best tech item on the market for under 40 dollars though", "verified": true, "helpfulness": "0/0", "author": "Lenny G"}, {"rating": 1.0, "review": "it doesn't work.  waste of money.", "verified": true, "helpfulness": "0/1", "author": "morgan clippinger"}, {"rating": 5.0, "review": "Awesome. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "SungJun Lee"}, {"rating": 5.0, "review": "great price and arrived quickly.  We will see if they last.  So far so good, 2 months.  Only problem I had was my fault with getting it on the same wireless network ans my PC and Phone.", "verified": true, "helpfulness": "0/0", "author": "workbench"}, {"rating": 5.0, "review": "This is one awesome piece of technology. Once Amazon Prime Instant Video streaming capability is added, it will be unstoppable!", "verified": true, "helpfulness": "0/0", "author": "jFq"}]