[{"rating": 3.0, "review": "I was not sure what to expect when I order Fire TV, but I thought i was going to be able to see single episode of some of my favorite sit coms. Only to discover that I have to purchase the hole season from the last season. I was hoping to watch last weeks or last months.Fire TV works well, but I don't think it is for me.  I was also hoping to have access to more internet movies that didn't cost and save on my cable service. Again I discovered that I have to upgrade my cable service to see the sports programs I want to watch.  So all that being said it just doesn't serve my needs or wants. It isn't what I expected.", "verified": true, "helpfulness": "3/4", "author": "Leo Hogan"}, {"rating": 5.0, "review": "The Amazon Fire Tv is smaller than I thought but in that little black box is a great wide entertainment center with movies,TV series,games,the mote control controls most of the games,I like the Amazon Fire Tv so much am thinking giving up cable.", "verified": true, "helpfulness": "0/1", "author": "Jan"}, {"rating": 4.0, "review": "Works good- better than Roku 3- but every time you touch the remote it reacts. It is so sensitive that if you just pick it up to move it and aren't super careful it will change something. I am not kidding. I guess some ppl would say that is a positive but several times a DAY I will accidentally change the program, channell, etc just by moving the remote from one spot on the sofa to another. I now find myself cursing the remote!!!That is the only negative i can find.Amazon selection of pay per view is great. If you are like me and don't mind paying a few bucks to see pretty much ANY movie you want to... It's outstanding!", "verified": true, "helpfulness": "0/0", "author": "Curt Chappell"}, {"rating": 5.0, "review": "Love the amazon fire tv! Plus being a amazon prime member gives you so much more. I would recommend it to my family and friends.", "verified": true, "helpfulness": "0/2", "author": "lisa a roy"}, {"rating": 5.0, "review": "For my money and tv needs...this totally eliminates the need for cable! You will not regret this investment! ...ever since", "verified": true, "helpfulness": "1/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I would like to highly recommend this device. You just plug it in and away you go. It has both inbuilt wireless and also an RJ45 Network socket. Getting onto the Internet takes, just a few seconds. Once you're connected, the device auto updates and then addresses you by your own name. Yes, your Amazon account is programmed in, so you can start watching/playing/listening straight away.  It is very easy to use with a single and very compact remote control. No instructions are needed at all, as you just follow the simple menus. The voice command recognition is simply excellent. I have not had a single misunderstanding and it has always found what I am after. The compact size is also a big plus. I've not measured it, but is seems to be about 4 inches square by an inch thick. It's just so good that I have every intention of getting a second box for the TV kids room. Fantastic product and highly recommended to all.", "verified": true, "helpfulness": "0/0", "author": "Fairfax Ache \"Computingbitstogo\""}, {"rating": 1.0, "review": "Incridably disappointed of this deviceSome of the apps don't work with my tv providerThere is no hbo goThe voice commander is a jock.. Just working with Amazon stuff .. You can't use to search in any other app even YouTubeI hates that it surprisingly show some of my history clips and things that I checked out on my laptop in especially amazon n YouTube.. TV set is for group watching normally n this was embarrassing and danger privacyIt also easy to any one buy or rent shows on my credit card that saved in amazon accountAlso the quality of some videos' is not satisfactory at all, for example the games and life broadcast with watch esbn", "verified": true, "helpfulness": "4/14", "author": "Duran"}, {"rating": 5.0, "review": "I absoutly live my fire TV.  It was so simple to hook up, and so easy to use.  I have been catching up on old TV series that I did not get a chance to watch before.  And I love being able to watch my favorite movies an time using Amazon Instant Video Streaming.  Its the best...", "verified": true, "helpfulness": "1/1", "author": "MissKathy"}, {"rating": 4.0, "review": "I love the hardware on this thing. If they get HBO Go at some point in the future I'd raise the raiting to 5 stars. I do wish it had an earphone plug on the remote, but guess you can't have everything.", "verified": true, "helpfulness": "0/0", "author": "Austinhorn"}, {"rating": 4.0, "review": "nice to get a streaming product finally, only complaint is I have had to reboot it a couple times as it seems to lose either signal from my wifi or on amazons end", "verified": true, "helpfulness": "0/0", "author": "Donna Kafer \"Arizona Lady Bug\""}]