[{"rating": 1.0, "review": "It's a crappy product, for whatever content they advertise have to pay, it works much better and is more friendly on the Western Digital brand, this product have misleading advertising ...", "verified": true, "helpfulness": "0/4", "author": "Leonel Alberto Jiménez Ramírez."}, {"rating": 4.0, "review": "Difficulty getting it to work on Sony Bravia.  Otherwise, simple and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Mom in St. Charles, MO"}, {"rating": 5.0, "review": "So many varieties.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Great for streaming movies, music and more. You could also use an xbox 360 controller instead of the branded one.", "verified": true, "helpfulness": "0/0", "author": "Yo-Yo Dawg"}, {"rating": 3.0, "review": "Wish I would have known that I need a cable subscriber to use alot of the apps.", "verified": true, "helpfulness": "0/0", "author": "Appleby"}, {"rating": 1.0, "review": "You need a high-speed internet connection for this as it buffers poorly.  Tried a voice search within Youtube and it redirected me to the Instant Video app offering to let me buy what I was searching for.  The voice search has great potential but the redirects to Amazon \"buy this now\" areas are maddening.  Got this as a gift or I would have returned it.  Hey, I love Amazon.  I have a Kindle for reading and 2 Fire HDX's for my family.  Sad that this device needs high speed internet. The Fire HDX lets you pre-download if your connection is slow.  Not this device.  It tells you your connection is slow and offers no help.  Have updated the firmware and it got a little better.  Here's hoping the next firmware fixes things, I'd be happy to up my rating!", "verified": true, "helpfulness": "1/3", "author": "E. Coughlin"}, {"rating": 5.0, "review": "I LOVE IT! ITS AMAZING! BEST TV DEVICE EVER. BUY IT.", "verified": true, "helpfulness": "0/0", "author": "Philip R. Jones \"jonesranch\""}, {"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "deedee"}, {"rating": 5.0, "review": "Works great!  Gives you the choice of watching with Amazon Prime or Netflix and many other service providers.", "verified": true, "helpfulness": "0/0", "author": "howardawac"}, {"rating": 5.0, "review": "This awesome device has actually got me to sit back on the couch and relax, again.  I've been stuck in my computer chair for a long time, since it was the only place I had all the features I want available.  Having so much fun with the games, Prime Movies/shows, Netflix, Prime Music, and viewing my personal photos and videos.One thing I wish for: being able to sort my Watch List by Prime Only.  I wouldn't be surprised if this feature gets added in later.", "verified": true, "helpfulness": "0/0", "author": "Amazonian \"From deep in the Amazon\""}]