[{"rating": 5.0, "review": "I loved but please included movies in spanish..", "verified": false, "helpfulness": "0/1", "author": "Eliezer Cruz Almodovar"}, {"rating": 5.0, "review": "Wonderful!", "verified": true, "helpfulness": "0/2", "author": "Bobbie"}, {"rating": 4.0, "review": "It just did what I needed for with no problems", "verified": true, "helpfulness": "0/2", "author": "husni kobeissi"}, {"rating": 3.0, "review": "Series I was watching was taken off Prime and I was not able to finish it.", "verified": true, "helpfulness": "2/4", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Advertising hoopla: 'You can also access your entire Amazon Music library, so you can enjoy any albums and songs you’ve previously purchased from Amazon.'  Be WARNED: This feature is NOT available in the unit I received on 05 Sept 2014.  Also NOT available are all of the Amazon games and apps purchased in the past for my Fire HD and HDX; seems to be limited to 30.  I called Amazon help support and they were quite vague about when these issues would be fixed.  The logic I was told is that the Fire TV is new on the market and NOT all of the advertised features are currently available. Can't wait for these and other fixes.", "verified": true, "helpfulness": "1/1", "author": "AllanR"}, {"rating": 2.0, "review": "I've been using this product for several months, and was very happy up until a week ago. Then I started having a strange problem: I could select videos for viewing, but once I tried playing them, the screen would go blank. This applied to Amazon's own video, plus I was unable to play Netflix video. After dealing with Amazon's tech support, now I know why: It works fine when plugged directly into my TV. But when it's plugged into a receiver (as I've been doing since I purchased the product), the videos won't play due to DRM issues. The customer support rep explained that this is by design: Enabling playback through a receiver would theoretically allow people to record the programs. But requiring direct TV connection is a major inconvenience for me. I have a BluRay player, Apple TV (and until last week the Fire TV) all hooked up through my receiver, and I could easily switch back and forth and get stereo audio quality. Now I have to plug the Fire TV directly into my TV and run a separate optical cable to the stereo for high-quality audio. (My receiver has one port for an optical cable, but I had been using it with Apple TV to stream my iTunes library.) Bottom line: Viewing is a lot more complicated now, requiring switching cables and remotes if I want to go back and forth. What's strange is that it all worked fine until recently -- I'm guessing that the DRM \"fix\" was implemented in a recent software update. Bottom line: If Amazon won't let me connect this to my stereo receiver (as I can with Apple TV), I'm less likely to buy Amazon content in the future, and I might not have made the purchase to begin with.", "verified": true, "helpfulness": "6/7", "author": "SteveB510"}, {"rating": 4.0, "review": "Very pleased with this purchase. I have been able to cut some of the Cable cord. So that's nice.", "verified": true, "helpfulness": "1/2", "author": "heydavewhite"}, {"rating": 4.0, "review": "I'm very pleased with the Fire TV! It's awesome in that allows me to play from my netflix and Hulu account directly to my TV. I never was able to do that as I always just used my computer for watching. An added bonus is the huge library of movies Amazon allows you access to as far as RENTING - however the Prime account which I am testing out really quite frankly, sucks. Amazon boasts a 40,000 title library for Prime members included access, but the main menu and search functions only give you access to about 200 or so. There is NO category for Prime movies only so if you think you can easily search titles that are prime access you cannot. So far I have watched only one or two Prime (included in membership) titles, but I have definitely spent around $100 in rentals alone. On top of that, rentals are expensive - old movies (2000 and older!) are like $3.99 or more! That's crazy! Yes, I understand you pay more for the convenience, but even the duration of rental is unreasonable. I haven't seen a rental for more than 72 hours - some were even 24 hours only!My current internet speed is 1.5mbps which is the minimum to stream to the TV and the quality is okay, but I will definitely be upgrading to something faster to get that HD QUALITY.I'm really happy with the FIRE TV but the Prime membership is an utter waste of money UNLESS Amazon decides to allow their paying customers easy access to included titles - not force us to only search pay for titles. Also, the rentals are not categoriez easily either- definitely needs work!", "verified": true, "helpfulness": "6/6", "author": "Christine v."}, {"rating": 5.0, "review": "Hands down the best!!!!", "verified": true, "helpfulness": "1/2", "author": "J Eric Mutter"}, {"rating": 3.0, "review": "Now this Amazon Fire Tv was working great but now it's stopping on us. It gets hot after being on for some hours. Maybe that is the problem", "verified": true, "helpfulness": "0/1", "author": "Wilboy265"}]