[{"rating": 3.0, "review": "works well for netflix and youtube. didn't try Pandora.You can NOT stream web from your Android phone - you can only access apps they let you download. You have to download the google cast extension from google Chrome, and it doesn't work on android phones - you'll get the message that the Chrome shop isn't supported. So that means you're pretty limited.It won't work with my Archos tablet (chrome not supported) so I was stuck with trying to set up videos to play from my phone - very small, can't read descriptions, as you can't mirror the menu on your TV, just the \"cast\" video. Much too small to see very well. I could have brought my netbook upstairs and used it, but if I have to use a laptop, what's the point of having it on TV?I'm returning it to the store.Edit update - After two failed attempts with other less-than-stellar devices, thought I'd give in and try this again with my Win7 laptop. Although it showed the device added to the home network on the chromecast app, it showed the eternal circle timer and \"searching for device\". On the google cast extension, it showed \"no devices found\". I wasted an entire weekend on help forums and chromecast help. Never did get it to sync with the laptop, even though I rebooted every device - even the router - and followed all instructions. I'm sending this back.", "verified": true, "helpfulness": "0/0", "author": "Mary Harrell \"voracious reader\""}, {"rating": 1.0, "review": "Awful - spend the extra money to buy a Roku. This device is for penny pinchers and does not work flawlessly and there is ZERO support.", "verified": true, "helpfulness": "1/2", "author": "Bob J \"tarheelinva\""}, {"rating": 4.0, "review": "As a true consumer reviewer I always like to start my reviews with this caveat, I review based on what the manufacturer says the product can do.  I then compare that to what users feel the product should do and provide a Pro's which explains areas that the product goes above and beyond with their functionalities and Con's where I (my personal feeling) recommend areas I believe the product should improve in.  Star's are taken away from the product when it fails to deliver what the manufacturer said the product could do.The Chromecast viewer is a great viewer display technology.  It definitely makes TV watching easy, economical and practical.  Big different that consumers should be aware of, this is not a Roku or an Apple TV competitor.  Their are no channels with this system.  The system is probably the most advanced viewer in the industry right now.  The system literally works as a displayer where you can display videos and items from your mobile device assuming that the application is Chromecast compatible.  This part really takes away from the product since not all apps (and for good reason) are Chromecast compatible.  That being said you can also view all computer related items on Windows or Mac.  As the product specifies it requires chrome to do so.  So the compatibility is really around any system that can load chrome.  You can not use window media player per say to view movies or any third party application.  IT MUST have a chrome plugin that uses chrome to view.  For my purpose, HBOGO, Youtube, Facebook, Netflix, Hulu, Showtime, and online viewing it works amazing.  Same applies for the phone, i only have apps that are compatible with Chromecast so no issues there.  But i am sure in this community of users that have different needs that maybe an impact somewhere down the line, but for 35 bucks amazing product.Pros:-  Easy to setup.  Not difficult at all but it does require a degree of understanding of your TV an knowing your wifi password.-  Delay is pretty amazing, from computer to Chromecast only about a 1 second delay.  Beats the pants off of Netgear's products and Windows 8 screen display technology-  Audio quality is great, its an HDMI adapter so make sure you have HDMI on your TV-  The software needed to run is simple to use.  One click of a button and its up and running.-  Small and non intrusive.Cons:-  Google needs to add better user instructions on setup.  I know they have a guide but it would be nice on screen-  A win 32 agent or a .dmg app would be nice.  I understand its more to maintain but for this type of technology it would be nice to be able to see local machine videos and movies.  Case and point workout dVD's would be great to prodcast through Chromecast", "verified": true, "helpfulness": "0/0", "author": "Juan P Gomez"}, {"rating": 4.0, "review": "Desktop streaming isn't working as well as it could.  I have audio problems while using it but anything out of chrome works like a champ.", "verified": true, "helpfulness": "0/0", "author": "broohaha315"}, {"rating": 5.0, "review": "The chromcast was simple to setup and works excellent. Also was able to cast from my windows vista with a little reaseach online.", "verified": true, "helpfulness": "0/0", "author": "TMF"}, {"rating": 4.0, "review": "I like it but it freezes often and logs me off. I don't know if its because of the high speed internet I use or what. Still its great if you have an older tv and want it to function similar to a smart tv.", "verified": true, "helpfulness": "0/0", "author": "tasha still"}, {"rating": 5.0, "review": "Simple, functional, portable, high reliability.... Excellent product... After buying one i got another one for my other tv set.highly recommendable", "verified": true, "helpfulness": "0/0", "author": "TonyDC"}, {"rating": 2.0, "review": "\"Stream online video, music to your TV using your smartphone, tablet, or laptop.\"  The statement makes it appear as if you can stream anything from your smartphone, tablet or laptop which isn't true.  You can only stream \"certain\" things from your particular device.  From your smartphone, you can ONLY stream Youtube or Netflix.  From your laptop, you can only stream what is your chrome browser.  Apple TV is the way to go since it offers true mirroring.", "verified": true, "helpfulness": "2/4", "author": "IT guy"}, {"rating": 5.0, "review": "The media player was recommended by a representative of Netflix when I called them about replacing the xbox I was using to stream Netflix to my tv.  It was priced competitively, was as described and arrived quickly. Apart from having to purchase a pad-device to use as a remote the chromecast is a much more cost effective way to stream.  I have had no problems and am very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Gwen Johnston"}, {"rating": 3.0, "review": "the ad fools you.you need to attach more wires to this to work and I had to send it back .At the round end you have to attach wires to go to electric.I thought it was wireless as every picture I looked at had none which is why I was buying it. have too many wires now.So I cannot really tell you how it works", "verified": true, "helpfulness": "0/4", "author": "Sandra Cieklinski"}]