[{"rating": 2.0, "review": "Expensive to watch movies", "verified": true, "helpfulness": "1/6", "author": "Robert James"}, {"rating": 5.0, "review": "My first internet TV device was a Roku XD. I really enjoyed the device, but it was time to get something a little newer, faster and better supported. I have now owned my Fire TV for a couple months, and love it. While I cannot compare it to the current Roku 3, I can definitely say it outperforms my old Roku, as well as the Apple TV one of my buddies has. (Current Gen) The best benefit of having Fire TV is how streamlined it is with both Prime and Amazon pay videos. The Fire TV comes already registered to your Prime account and is good to go out of the box. I can also easily stream Netflix, ESPN, WWE and YouTube on this device. (Although there is no doubt it was built around supporting and pushing Amazon's products) If this annoys you, I would like to point out that the competition does virtually the same. Roku pushes M-Go and Apple TV pushes iTunes. If you have a lot of content with iTunes, then Apple TV might be the better bet, since iTunes is not supported. Otherwise, Fire TV has been a great experience with no real issues. The 1080p HD looks great on my TV, the menus are sharp and fluid, the device is fast and overall a great primary streaming device. Its been mine for sometime now, and couldn't be happier.", "verified": true, "helpfulness": "1/1", "author": "hfres42567 \"MMABookworm\""}, {"rating": 5.0, "review": "Everyone should have 1", "verified": true, "helpfulness": "0/1", "author": "Richard Hunt"}, {"rating": 5.0, "review": "Awesome! Easy to set-up and use. Lots of selections at a great price! Love it! Love it! Love it!", "verified": true, "helpfulness": "0/0", "author": "AA \"Free to be me\""}, {"rating": 5.0, "review": "liked it so much I bought a second one for my other TV", "verified": true, "helpfulness": "0/1", "author": "pikej \"jjp\""}, {"rating": 5.0, "review": "Great way to stream movies and TV programs. Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Jackson"}, {"rating": 5.0, "review": "Fun to talk to and try to play tricks on its IQ.", "verified": true, "helpfulness": "0/0", "author": "ronald"}, {"rating": 5.0, "review": "We love our new Amazon Fire TV. It was super easy to set up. We are switching over to a non TW cable lifestyle. We are going full on internet. This was the first step for us. The screens are easy to maneuver through.", "verified": true, "helpfulness": "0/0", "author": "aly 0905"}, {"rating": 4.0, "review": "I used this to replace a Mac Mini which was our primary media player. It's definitely a step up for viewing Amazon content. It's pretty good for Netflix, Youtube, etc., though the interface isn't as seamless for those apps. In fact, it took a few days before the Netflix would install at all.But there's a lot to like. The voice remote works quite well, the video quality is quite good, and the interface is generally pretty usable. I'll probably have to add an Apple TV to watch the stuff we've bought on iTunes, but I'll take 2 boxes for under $200 over upgrading our greying Mini.I agree with others that it'd be nice to easily ID what's free on Prime vs. other content.", "verified": true, "helpfulness": "0/0", "author": "B. Crounse"}, {"rating": 5.0, "review": "I'm testing til now ie exellent", "verified": true, "helpfulness": "0/1", "author": "VICENTE ARREAZA"}]