[{"rating": 4.0, "review": "I have had the Google Chromecast for over a year. It works beyond expectations. It is easy to install and set up, and is the least expensive of all similar devices. (Apple Air, Roku, DLink etc). Initially, there was a learning curve but it is not that difficult to master. My only beef is that it does not have an independent remote control, but needs to be connected to a computer/smart-phone via Wi-Fi network to access its contents.", "verified": true, "helpfulness": "2/2", "author": "Sinohey \"scribe\""}, {"rating": 5.0, "review": "Love this product!  i am a google fan boy.  I do not have cable because I use this as an alternative.  I have hulu, netflix, and hbo go.  I wish I was able to find an app that let me watch the news live.  Also, Amazon Prime does not have an Android app.  I blame this on Amazon trying to get users to buy there product instead.  I have bought a few of these for friends.", "verified": true, "helpfulness": "0/0", "author": "Joseph R. Kerr"}, {"rating": 5.0, "review": "Have you every spent time with a group sharing YouTube videos?  Everyone cramming around to look at a phone?  Or wanted to project your phone screen for any reason?This will do it.  This is easy to use, Performs seamlessly.  I love it.  We bought a second one just to carry around with us.  We've used it in hotels, at friends' homes, all over.", "verified": true, "helpfulness": "3/3", "author": "Karl Shelton \"Pomerado Eagle\""}, {"rating": 5.0, "review": "Exactly what I needed.", "verified": true, "helpfulness": "0/0", "author": "Claire Berger"}, {"rating": 5.0, "review": "Can't get anything better at this price. I use one on each TV plus another one with an adapter connected to speakers only for streaming music in the kitchen and dining room.If you have a large digital media collection, I highly recommend running Plex Media Server and the plex app for your mobile device. My Plex Channel for Roku will occasionally hiccup on some MKV files, but the Chromecast plays them all!", "verified": true, "helpfulness": "0/0", "author": "AJW"}, {"rating": 5.0, "review": "I LOVE this thing.  I don't know how I lived without one.  Use it all the time and it's perfect.", "verified": true, "helpfulness": "0/0", "author": "Jody"}, {"rating": 5.0, "review": "oh my god it's amazing", "verified": true, "helpfulness": "0/0", "author": "Gina Helms"}, {"rating": 3.0, "review": "Many disconnections, i don't know if it's due to net disconnections and slow internet or due to the Chrom itself...", "verified": true, "helpfulness": "0/0", "author": "Eli D."}, {"rating": 4.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "Beth kamrath"}, {"rating": 5.0, "review": "Not a lot of apps yet but the ones that are compatible work great and  its easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Dicky Davenport"}]