[{"rating": 5.0, "review": "It is a great product, works perfectly!Easy to setup and to use, would recommend it to every one.You won't regret it", "verified": true, "helpfulness": "0/0", "author": "Hubert"}, {"rating": 5.0, "review": "I have Chromecasted to various monitors in my home and hotels.  Always takes a little time to set up with the new network, but then works fine (except one time).  Version 2.0 will be even easier, I'm sure, but I would recommend this product - great small size, relatively easy to use, great form factor, good quality image projection.  It's now on my packing list for trips.", "verified": true, "helpfulness": "0/0", "author": "Dr. W."}, {"rating": 5.0, "review": "I love streaming my Netflix and Youtube to my television, my kids love it too!! I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Sybil Warner"}, {"rating": 4.0, "review": "I'm happy with that item, first time I had some troubles but issue was on my access point wifi connection instead chromecast, I'm using linux, (ubuntu)", "verified": true, "helpfulness": "0/0", "author": "Andres Solano Soto"}, {"rating": 5.0, "review": "Excellent device. More default apps would make the device even better. Unnoticeable power consumption from my cell phone during casting.", "verified": true, "helpfulness": "0/0", "author": "W. Ng"}, {"rating": 5.0, "review": "Chromecast is awesome, and its at an amazing price point, compared to similar devices like Apple TV and Roku box etc. You can use this device to play youtube playlists on your television, and control it from your phone, laptop, desktop or tablet, all over wifi! This is also a fancy little way to play netflix from my phone and sending the signal to the television. Get this. You will not regret it. There are more apps being made to be compatible with this device, and it's going to be a must have in everyone's entertainment room. I've already gotten one for my parents, uncle, sister; and they all love it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "we love it, we have an apple tv in the living room but we bought this for our bedroom so we can watch netflix.", "verified": true, "helpfulness": "0/0", "author": "Kate"}, {"rating": 5.0, "review": "Simple and easy to configure, you get started easily with few steps.Netflix, Youtube, Crackle, VEVO an others get easily", "verified": true, "helpfulness": "0/0", "author": "Sergio"}, {"rating": 4.0, "review": "This thing works great when plugged into my not so smart LG LCD TV. Be mindful that it has to be plugged in to work. Some people have mentioned that newer versions of HDMI (1.4?) can power it, but I suspect a lot of people will get this to educate their TV and make it smarter.Currently it supports streaming video apps such as HBO GO, Hulu, Netflix, YouTube. I do not know if Amazon Video works.Also to play local files, you can install the Chrome browser and play a file by pressing Ctrl+O in windows. This works ok but not as good as the streaming apps themselves.I got this at $35 and at one time I saw it at $30. At the time of this writing I would suggest this to people who have a HDMI TV with no means to stream Netflix or Hulu on it besides plugging in a laptop or computer. This will free up your computer if you use those apps. If you stream content from other providers, such as South Park Studios, then you can stream from the computer running the chrome browser and again free up your computer instead of having it tethered.", "verified": true, "helpfulness": "0/0", "author": "AYoussefi"}, {"rating": 5.0, "review": "Does what it's supposed to do. I love being able to watch Youtube on my TV. I've have no problems with my network like others have mentioned.", "verified": true, "helpfulness": "0/0", "author": "William F. Lawson \"Bill Lawson\""}]