[{"rating": 1.0, "review": "Like I said I cannot seem to get on-line using my password I use for my lap top and cannot find directions on how to use it.", "verified": true, "helpfulness": "1/7", "author": "Norma J. Meakes \"shiny curly\""}, {"rating": 5.0, "review": "I debated getting this or the Stick. My use is mostly pretty simple, but doubling the RAM and the ability to add memory for storage, the faster processor... they were pretty convincing.The Voice navigation feature? I didn't think I'd use it. Boy, was I wrong.It actually works, and for most people who don't speak like Brad Pitt's Welsh Gyspsy character in Snatch, should do well. I expected hilarious results the first few times, but no, it worked nicely, unlike the funny but truth based parody of Siri on Big Ban Theory.Picture quality depends on the source, of course, not only the file used, but the carrier, if you're using this as a web video server for other live channels. I've watched Conan live on this and, it definitely varies night to night, using Sling. Other channel providers often fare worse. The image from Amazon's own \"shop\" approach Bluray quality at times, and the audio is usually good. I use a Wimax connection from a tower that is literally line of sight from me, a block away, with zero obstructions. It still isn't all it could be. I'm sure a very highspeed wired or optical web service would make this look good all the time.Catch up on series here at Amazon, add Hulu Plus (only the paid version), Netflix (which is only paid) and catch stuff from international providers, which can be fun.You can also add a-la-carte services like HBO-Go or some sports channels, but they, too, require that you are currently subscribing via cable. That is likely to change, further making cable less necessary.The menu is pretty easily usable though there is no \"everything we have\" browsing for movies or genres, just the top 50 to 150 options, as applies.I like older movies (b/w) and would like to be able to really snoop around at ALL the options. It has never been apparent that such a feature is available.Some of the films that show up on Prime for free are surprisingly good, some are straight-to-video duds. Just like the old Block Buster was and cable still is.Rentals are two days and mostly reasonably priced.Amazon are just now dipping into newly released (to the US market) RUSSIAN TV series and films, in which I have real interest. The production quality may not be as good as we're used to, but the story-telling perspective is often very different and they like the same sorts of stuff we do.I just watched S1 of the Russian scifi series The Day After, which is a mad-scientist \"oops\" movie with zombies (sexy pretty ones), a deserted Moscow, the requisite heavy-handed martial law, but not by the people one expects, a small band of disparate randomly assembled \"survivors,\" or so it seems, and their agonizing process to escape being imprisoned and then the city-zone of Moscow itself. There's romance, after a fashion, sad goodbyes and plot twists, and it's all subtitled in sometimes hilariously transliterated English from the Russian by someone who does not speak both languages fluently. Some turns of phrase are, well, awkward or even weird, though you do know what they mean.I mention this because it's a Prime series... it's supposed to be free with your Prime subscription, which ain't cheap anymore like it was in the first couple of years. I was pretty P-O'd to get to the end of the first season only to have to BUY the last episode to know how the season ended (cliffhanger, of course). That seemed like a real low blow of a gotcha.There are plenty of favorites from US broadcast and cable to watch, though... to binge-watch a few eps per night, so there's plenty to keep you occupied. It seems that new titles are added all over the board every couple of weeks and things move from Prime back to paid. I think it's a bit outrageous to pay $4 PER EPISODE of a series that was free or included overall with a channel that was in a free cable tv tier, like some TNT stuff.This makes an entire season cost you $50 or more per season. That's packaged DVD pricing, which will include \"enhanced\" features that aren't in all the Amazon items.There are some music \"channels\" in addition to the song and album libraries. They are sorted by genre and are pretty decent and there are many choices. There are also created playlists with faves in a genre that generally run in the couple hours long range.One thing I do NOT like at all is that when you set a background playlist or album to play, say with environmental noises like a rainstorm, even if you pick the infinite repeat function, the thing does not repeat. VERY disappointing if you're going to use those albums or playlists to help you sleep, which was my intent.Other than that, though, the HDMI output makes this a snap, the RJ45 network cable makes connection to the web a snap, too you can add memory via the USB jack or play your own files through that. Lastly, there is an Optical Toslink Output, which is good for outboard DACs or receivers or preamps with DACs in them to take and decode the straight digital optical signal. I use a standalone DAC with tubes in the audio path... Shmoooov sound, indeed... to go into my Level 2 high power audio rig.This is a well thought out box, seems to outperform everyone else's little web-streaming boxes and it is priced right and includes content. I haven't tried the wifi connection, but Amazon's other wifi connected devices seem to work right away and well, so I'm not particularly worried about that if I do go that way.The small black box is about 5x5x3/4\", so it's easy to put aside and out of view. Since the remote is RF based and NOT infrared, it does NOT require line of sight to operate.Comes with a power supply (a beefy enough one) but NOT with any hookup cables, iirc. You DO get batteries for the remote, though, so don't forget to get an HDMI cable if you don't have one and you will be watching stuff within 15 minutes of opening the box. It really is that easy to set up if you have them ship it already with your account in it!", "verified": true, "helpfulness": "1/1", "author": "The Shopinator"}, {"rating": 5.0, "review": "This product works so fast and fluid. It is not only fully integrated with all content from amazon, but also has all the apps you want such as Netflix, hulu, youtube.com, and many others including games. It is like a Kindle Fire for your TV with a great user experience.", "verified": true, "helpfulness": "1/1", "author": "Jaykub7 \"Humble Pontifcant\""}, {"rating": 2.0, "review": "Honestly it's pretty poor. The Roku 3 had less malfunctions and technical issues. I'm not really in the mood to list because everyone on the internet in some way or another has already commented on how bad it works with Netflix (come on Amazon) and in general how poor all the apps work, which is no surprise as they really just barely dressed up an android phone to make this. They oversold, it's not really going to be great at anything, with other platforms offering way better games, better content access and a device that works (I've had 3 break on me just \"one day\" blank screen).", "verified": true, "helpfulness": "0/2", "author": "Christopher M. Paolini"}, {"rating": 5.0, "review": "Question: can i Connect my PC 2.1 sound round in to the Fire TV Addapter or ir must be 5.0?", "verified": false, "helpfulness": "0/0", "author": "Kosien"}, {"rating": 5.0, "review": "I have to admit this little bad boy is fantastic!  I love it so much more than my Apple TV and it does so much more.  I haven't fully used the product such as gaming but everything else is great.  The apps load great, the ease of use is fantastic, the ability to search using your voice is really handy, the ability to control the device using the remote without having to worry about line of sight is really helpful, and lastly the added bonus of having prime really makes this product a win!Another great feature is being able to control the screen saver with whatever pictures you want, unlike the Apple TV which only does your stream.If I could give it 10 stars, I would.", "verified": true, "helpfulness": "1/1", "author": "Angel Garcia"}, {"rating": 5.0, "review": "I've used a few other TV/Internet interface options in the past and this is by far my favorite. If you have Amazon Prime and don't have a TV that can directly use the Amazon apps that I assume exist, then this is a must buy. It allows you to watch all Prime movies and shows on your TV as well as is an interface for any Amazon instant videos purchased. A good way to utilize Amazon for all your multimedia needs. The remote is smooth and easy to use and doesn't require pointing at the box to function. The voice search feature is one of the best I've ever encountered, it almost never muddles what you speak to it. You can download 3rd party apps and games as well and stream things straight from your phone to the box via wifi (like a youtube video you want everyone in the room to watch). The only thing I'm hoping will be improved is the voice search working for 3rd party apps as well as Amazon itself because as of now, it only pulls results from Prime video and Amazon instant video.", "verified": true, "helpfulness": "0/0", "author": "Aaron Liu"}, {"rating": 4.0, "review": "I really enjoy this device.  Because we have a Prime account we like to watch Amazon content.  I also use it for Netflix and streaming via Plex from my PC.  No issues at all other than the fact that you can't just plug in a USB drive without having to sideload the device.", "verified": true, "helpfulness": "0/0", "author": "Antoine Johnson"}, {"rating": 2.0, "review": "better than the apple . so easy to use im really happy", "verified": true, "helpfulness": "0/4", "author": "johnathan gle"}, {"rating": 2.0, "review": "I bought this when it was first available and therefore have had it for a fair amount if time.  We cut the cable cord years ago and have used Roku, Sony blurays, and SmartTVs for streaming.  When the amazon fire plays,  the picture is amazing...much higher quality than the other devices.  However, from day one,  I've had nothing but frustration playing Netflix.  It will play for a while (with a beautiful picture) and then it will jerk for a few minutes, then back to normal, then jerk. It is so annoying that I often turn off Netflix and use amazon prime which, surprise surprise, has no problems whatsoever.  As I mentioned, we've used roku and Sony on the same Internet connection and have never had any problem running any apps.  I am a fan of amazon and this has been an annoying disappointment.  We finally ditched the amazon firetv, bought another roku, and that works fine for all the apps.", "verified": true, "helpfulness": "1/2", "author": "ILLibraries"}]