[{"rating": 3.0, "review": "The device worked and it worked well, so I can't say anything negative about the functionality.  Here's where it fell short of my expectations,1.  It can only stream Youtube and Netflix, that is, once you have started the show your tablet or phone you can have it broadcast on your TV and you can then turn off the phone or tablet if you like but the streaming will continue on your TV.  But you can't do this with anything else (Hulu, Vudu, Amazon Prime etc.).2.  You can stream Amazon Prime, Hulu, Vudu etc. from your laptop using the Chrome browser but you have to keep it running on your laptop.  If you close the browser that's the end of the streaming on the TV also.  And I didn't care for it as I thought it said, anything from your computer can be watched on TV.  Technically they are correct but that's very Microsoft like and not something I'd expect from Google.  I guess once you get the taste of money, principle goes out the window.3.  I have only two HDMI ports on my TV and one is being used by my Blu-ray player, the second by the set-top box (STB) and so I had to switch one of the device in and out and that was not convenient.4.  I couldn't connect the Chromecast directly to the HDMI port at the back of the TV as that prevented me from connecting to the other device.  Google does provide with an extension chord that enabled me to connect the other device (Blu-ray or STB) to the TV.5.  The Chromecast device by itself looks pretty cool but that's not the way it connects.  You have to be able to power it and for that you have to connect the Chromecast to the USB port at the back of the TV which my TV doesn't and for that I had to connect that to an adapter, which was connected to the power supply.  This extension is also provided by Google but it was never mentioned as such, again, they are technically correct as they do show in the demo video that you need to connect it to the USB port but as I said before, getting too technical for my liking.6.  I'd have still made this work if the HDMI splitter, which I ordered through Amazon had worked.  The idea of switching HDMI cables in and out was not a great option for me.7.  Finally, the Blu-ray device already streams Youtube and Netflix so what am I gaining by having another device that does the same as the Blu-ray.  It is true my Blu-ray does not allow me to stream anything from my computer to the TV but if I connect my computer to the TV that's also taken care of.In summary, if you have a Blu-ray or another device that streams Youtube and Netflix then Chromecast is not that great a buy.  But if you do not and would like to have the ability to do so then Chromecast is a great buy, it is priced right, for $35 you can't beat it.  It is possible Google will add other features to this device and then it will be a worthwhile purchase but for all the limitations that faced with this device it was not meant for me and I returned it to Amazon.", "verified": true, "helpfulness": "1/1", "author": "fatherof2"}, {"rating": 2.0, "review": "I have watch many streaming shows on my windows tablet on internet explorer with no problem. In order to use this device you need to install the Chrome browser winch is way to slow and lagging compared to internet explorer. May be fine for an Android device but now for their windows browser.", "verified": true, "helpfulness": "0/3", "author": "Matthew T"}, {"rating": 1.0, "review": "I've been using chromecast since the beginning.  I use it for Netflix.. It didn't work, then it worked, now it doesn't work again 12/14/2013 latest upgrade.. absolutely sucks for netflix. So disappointing..  I'm not a very critical user but I must say that I am giving up on Chromecast.  It just isn't worth the headache. I have no confidence when it will work, when I have to reset it, when its the network.. I mean.. who knows.. Waste of 35 dollars. I am confident it will get better but I'm not waiting for it.", "verified": false, "helpfulness": "20/25", "author": "James A. Pilkey \"chopperjimstoys\""}, {"rating": 3.0, "review": "I got the Chromecast device to play games on the Chrome browser on my HP Windows 8.1 laptop but the mouse cursor does not show up on my Smart TV.I called Google support and they had no solutions.I returned my Chromecast device because if I want to watch movie apps,Youtube,etc... I have that on my new Tv.No good for internet based gaming.", "verified": true, "helpfulness": "0/0", "author": "bill w."}, {"rating": 3.0, "review": "Expected moreon the way of apps. Only 4 at this time and since it's been out for such a while expected more.plus I use an android tablet and its even more limited since chrome for android does not support a flash player so I have to use either my laptop or tower for anything requiring flash. See to either get adobe for android on chrome or mske app for it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just plugged it into the HDMI port and it worked exactly as it was supposed to. We have Mediacom cable; it normally takes 3 to 5 or even more tries to connect to Netflix and movies often stop to reload several times. It's frustrating, to say the least. With the Chromecast, we don't have to use cable to connect. We're watching a movie instantly with no interruptions. If it weren't for the fact that we need cable in order for my husband to watch most sports, we'd dispense with Mediacom entirely.", "verified": true, "helpfulness": "0/1", "author": "Lynn"}, {"rating": 1.0, "review": "This \"thing\" is a piece of junk. Can't even set it up from my laptop or my computer. Both are on WIFI. I see it on both but won't cast. If you call $35 cheap then ask a disabled person if $35 is cheap. I have a brand new Sony tv and a brand new computer. Keeps telling me I have the wrong password then try again. Over and over again. Junk Junk Junk. Don't buy this nightmare. I bought this from Amazon and it took 10 days to get here. I live in Seattle.", "verified": true, "helpfulness": "3/7", "author": "DJ SXTN"}, {"rating": 1.0, "review": "didn't work", "verified": true, "helpfulness": "0/0", "author": "kj connolly"}, {"rating": 1.0, "review": "I bought this device having two things in mind: streaming movies with my kids on my big TV and streaming pbskids and disney junior on my big screen from any computer in the house.The first part doesn't work at all. I have no way of streaming my own movies with this dongle. Apparently there used to be a way but google felt the need to close the door on it.While I can cast a tab from the Chrome browser to the TV, as soon as a flash movie goes full screen (such as is the case when maximizing on Disney Junior)Chrome streams the main window not the full screen version. Which renders this feature useless for me. I have also tried using the \"stream the desktop\" feature but, aside from the poor quality (jittery) sound doesn't work in this mode.So far I can stream Netflix, YouTube and Pandora which I was able to do before anyway using either the BluRay player or the TV itself.For me this is a big disappointment and a waste of money. I think Roku or something similar is a better deal even though twice the price of Google Chromecast. Or should I say Google \"NoCast\".It may also be worth mentioning that I usually like everything Google. This is not one of those times. I should have done better research before purchasing.", "verified": true, "helpfulness": "74/93", "author": "Lucian Badea"}, {"rating": 4.0, "review": "I haven't had it for long, but so far it's been very good. The only issue I've had is sometimes it will lose connection on me, and I'll need to restart it. Other than that, it's as advertised!", "verified": true, "helpfulness": "0/0", "author": "Jake Young"}]