[{"rating": 2.0, "review": "Nothing is free you pay for everything?", "verified": true, "helpfulness": "0/1", "author": "Gregory Burns"}, {"rating": 5.0, "review": "Voice command works well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Met all my expectation plus more. I'm very glad I purchased it.  My main reason for getting it was that my existing home system supported Amazon Instant Video but did not support Closed Captions. The Amazon Fire TV does.The voice search is very handy and you can also filter by Prime only, which I didn't expect. I use the unit more than I expected when I first ordered it. It worked right out of the box. the only trouble I've had is after about a week the voice search stopped working and it would not go into sleep mode by itself. Amazon tech support cleared that up by having me unplug the unit and plug it back in (reboot?). Is has worked flawlessly for a couple of months now.", "verified": true, "helpfulness": "0/0", "author": "DaveM"}, {"rating": 5.0, "review": "Awesome love it", "verified": true, "helpfulness": "0/0", "author": "ERIC"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "kyle thornton"}, {"rating": 5.0, "review": "This is a great product so far. It has met all my expectations. It is fast and reliable,  exactly what I was looking for. Have not tried the game side of it yet though.", "verified": true, "helpfulness": "0/0", "author": "Aaron Harrier"}, {"rating": 5.0, "review": "Great device for the home entertainment highly recommended !", "verified": true, "helpfulness": "0/0", "author": "Hector Luis Fontanez Gomez \"HECTOR FONTANEZ\""}, {"rating": 5.0, "review": "I must exchange, it just keep logging of during gaming!! Or it may just be the area or company.", "verified": true, "helpfulness": "0/0", "author": "Lamont Robinson"}, {"rating": 3.0, "review": "The Roku 3 is much better in a few ways as when you search something in the main screen, it will search all of your apps instead of just amazon. Also, they do not offer UFC TV!", "verified": true, "helpfulness": "0/1", "author": "ernest butts"}, {"rating": 5.0, "review": "Love this device. Cannot believe I waited so long to get one.", "verified": true, "helpfulness": "0/0", "author": "qstormatl"}]