[{"rating": 4.0, "review": "works as promised, i use it for netflix, but it does get hot and i wonder if it will catch fire.", "verified": true, "helpfulness": "0/0", "author": "jim"}, {"rating": 4.0, "review": "It is wonderful and easy to use, of course I am looking forward for more apps and I think it will be.Mirroring the desktop is in beta and I hope it will be done soonIf you do not want to use many set boxes to connect to your tv have it and for the price it is very worth", "verified": true, "helpfulness": "0/0", "author": "louanchi"}, {"rating": 5.0, "review": "Easy to set up and use.  We do not have cable or Wii, so it is a great way to view our Netflix account using the galaxy phone or laptop as a navigator.  What a deal!", "verified": true, "helpfulness": "0/0", "author": "Amy Seigler"}, {"rating": 4.0, "review": "Really easy to use, and portable.  I wish it supported 5Ghz wireless, but otherwise it works faithfully.  It's really handy to have.", "verified": true, "helpfulness": "0/0", "author": "stansongman"}, {"rating": 4.0, "review": "I have Roku and Sony Google TV and I love this inexpensive device.  I only wish that it worked with Amazon Instant Video.  If and when it does, I will give 5 stars.", "verified": true, "helpfulness": "0/0", "author": "LAonline"}, {"rating": 4.0, "review": "Great little piece to playback from any device to your tv. Easy setup too!! All need to do is plug into tv connect to high speed internet and there you go", "verified": true, "helpfulness": "0/0", "author": "Angie Peterson"}, {"rating": 5.0, "review": "Netflix it is faster streaming over the air than my sony blue ray player connect with ethernet. The blue ray buffers, chromcast doesn't.Perhaps my computer  stores more in memory and then streams it.  Can't figure out how to stream recorded tv from windows media center.", "verified": true, "helpfulness": "0/0", "author": "Harry Y Wong"}, {"rating": 5.0, "review": "just plug it into HDMI and USB port on TV.  Download the Chromecast app on your device and you click one button on your device and it works!", "verified": true, "helpfulness": "0/0", "author": "Richard Allish"}, {"rating": 4.0, "review": "Love it!!! Works great!! I suggest you get it. I love it on Netflix and youtube. I recommend it to everyone", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 3.0, "review": "A $35 miracle, but limited in its usability. Need for a power cord is a bit of a disappointment too.", "verified": true, "helpfulness": "0/1", "author": "Alan Zisman"}]