[{"rating": 5.0, "review": "Best money ever spent on Amazon, I just canceled my cable which is saving me $80+ a month! I got the Fire TV for my main living room TV, and will be getting the fire sticks for the rest of our TVs as we do not need all the added features on the TVs we hardly use.", "verified": true, "helpfulness": "0/0", "author": "ChrisB."}, {"rating": 2.0, "review": "What can I say, had high hopes they would have the bugs out by now yet the choppy / jumpy video issue that I have read about seems to still be in the system.  If I play back either Prime content or Netflix, it seems to be dropping frames and this looks like it jumps.  This is NOT a data stream issue, but a hardware/firmware issue.In the attached video, take via a Canon DSL of the TV image, there are three jumps. Two JUMPs clearly seen as the third is right after the second.I called into Amazon to replace the unit and I was sent to Fire TV support. The person in support wanted to get into the Fire TV, thus coming into our network, and could not.  Of course they could not, I have multi firewalls in place as I use high end routers. (In todays world do you really want a company to be able to come into your device, or anyone for that matter?)Then she has me check the firmware version as \"there is a new one\".  I look, I do not have it, yet telling it to check for software updates finds NO UPDATE.  Funny, she says there is a newer version and not sure why it is not being detected.I ask again for a replacement.  \"Sorry, I have to first be able to see what is wrong and I can not do that if I can not get into the Fire TV.\"  I then reminded her that I also can not get the current firmware and she replies \"that is true.  Let me see if I can GET PERMISSION TO HAVE IT REPLACED.\"  What? You need to check to see if I can replace it????  Really????At this point after 30 mins on the phone and 3 call transfers, I am at the point of wanting to RETURN IT when before I only wanted it replaced.Amazon is better than this.And to think...most of us can do all of this already with apps that come built into the TV.  So why then did I buy one then? It is fast, really fast, and the user interface is very nice. Other than my issue the other grip that you read over and over it still makes for issues when you can not tell before you click on a show that you need buy it vs it being on Prime, thus free. Also you may be able to watch ONE episode of a TV show through Prime, but then need to buy the rest.  It can get do right frustrating and why Netflix works so well. Such issues can be fixed via new updates, so I really hope Amazon is listening to the complaints you see over and over and look to improve in this area. This box Is solid built and has  A LOT of POWER. As such it as a lot of room it can grow based on that power.UPDATE: They have agreed to send a new Fire TV unit.  Now I only hope for the best.  Will report back.UPDATE 12/16/14 - New FireTV received SAME ISSUE.  It is not any of my gear or Internet connection.  My Ruku does not jump.  The Apps built into my TV for Netflix or Amazon do not Jump.  Play something on Fire TV...jumps.  I have tried several HDMI cables just in case and tried it on multi TV's.  All with the same result.  The worst thing is, they say they have not heard of this issue before.  REALLY?  Come on we know you have...do a search for words like jumpy, choppy, skips and you will find people reporting it.AMAZON, you know that some of these have issues.  You make it so hard to deal with it.  You have a great, fast box, it just needs to be able to play without little jumps and skips where it drops like 10 frames and it need to catch up.If you have not see it on your box, watch closely, I bet it is there and maybe you had not noticed it.  Once you do, you no long can't not notice it.  SO DISAPPOINTED for such a powerful product.", "verified": true, "helpfulness": "5/12", "author": "David B. \"DBott\""}, {"rating": 3.0, "review": "Buffers up too much", "verified": true, "helpfulness": "0/5", "author": "Frankie"}, {"rating": 3.0, "review": "I like the concept of the box and the stick . They haven't had many issues and ALL issues were resolved through the help line . I am not happy with the prime . Amazon Prime sucked me in . I ponied up the 100.00 for a 1 year subscription . The shipping is a very nice bonus . For viewing I find that Netflix streaming offers a MUCH GREATER variety of films . Amazon Prime seems to want me to pay more for the selections . I purchased the systems to escape a $85.00/mo cable tv bill for garbage . It would be great if Amazon could lighten the load and not want rental/purchase $$ ..........I bought your stuff !", "verified": true, "helpfulness": "2/5", "author": "mike"}, {"rating": 1.0, "review": "Does not access channels from Charter Cable.", "verified": true, "helpfulness": "2/15", "author": "mark"}, {"rating": 5.0, "review": "I liked, very fast device, buffering video so fast, the best streaming media player so far.", "verified": true, "helpfulness": "1/1", "author": "gilberto"}, {"rating": 5.0, "review": "Previously tried a Roku box and hated it. This product is great, no problems so far.", "verified": true, "helpfulness": "1/1", "author": "William Mitchell"}, {"rating": 5.0, "review": "Better than expected!  The YouTube app that you add to the Fire TV is better than the Apple TV YouTube app.  As compared with Apple TV, it's easier to navigate (voice recognition works well) and easier to play your YouTube subscriptions as well as see what new YouTube videos have posted.  The only thing keeping us using the Apple TV is that podcasts are not available on Fire TV.", "verified": true, "helpfulness": "3/3", "author": "Matt Miller"}, {"rating": 5.0, "review": "So far I love it.  It works great.", "verified": true, "helpfulness": "1/2", "author": "ecallieh"}, {"rating": 5.0, "review": "Wow, easy set up.  Opened the box, plugged it in and identified the router.  I cancelled my cable movie packages and will pay for this in a couple months.", "verified": true, "helpfulness": "3/3", "author": "Greg E."}]