[{"rating": 4.0, "review": "I got my Chromecast from amazon yesterday. I ordered it as soon as it became available on amazon as was not willing to pay $3.99 for shipping on Google Play :)Pros:- Setup - its a simple setup. It took me longer (15 mins) since I have a Apple Airport Express router and had to update its firmware. \"Airport Utility\" app on ipad and iphone sucks and crashes them. For Windows users download here: [...]  Once I updated chromecast connected immediately. Before that it was not connecting.- Youtube, Netflix - \"casting\" from desktop and iOS (iPhone apps) works smoothly.- Chrome Browser Casting: this also works great...was able to watch videos from various sites without any issues. Saves me a lot of time and effort when I had to hook up HDMI cable from TV to laptop.Cons:- Lack of apps but I am guessing Google is already working on this given the response from consumers.All in all a great, simple to use product that delivers what it is intended for. I am just waiting for my netflix code that will make this an even better deal :)", "verified": false, "helpfulness": "0/0", "author": "shotime"}, {"rating": 5.0, "review": "The unit is so portable. The days of logging around my Roku or Apple TV are done. This thing is amazing. Whatever you can display in your Chrome Browser, can be displayed on the TV screen with various degrees of success. Some work better than others. I really hope the other services follow through and develop proprietary apps for this device. The installation is so clean on my Sony Bravia HX800. You can't see anything and the USB port powers the unit. A truly clean installation. The on board apps are limited to YouTube, Netflix, Pandora, and the browser streaming I mentioned before. The YouTube functionality is very cool because it allows you to queue more videos on the fly. No longer must I make a playlist for every event. I can change the mood of the party by sending new requests to the list. Netflix app is very responsive. Wishlist of apps would include HBO GO, Amazon Instant Video, etc.", "verified": true, "helpfulness": "0/0", "author": "Rafy"}, {"rating": 5.0, "review": "Need I really say more about this product. So far I really like it and highly suggest getting one. I hope you enjoy it as much as I do.", "verified": false, "helpfulness": "0/0", "author": "h34354354"}, {"rating": 5.0, "review": "Amazing, its cheap you can broadcast apps, chrome tabs, your entire desktop(through an experimental option) and you can also view local content if you drop .mp4 movies into chrome or have plex setup and movies stored on a server you can play them on a laptop through plex and broadcast it up. For $35 it is unreal what you can do with this.", "verified": true, "helpfulness": "1/2", "author": "S Mason"}, {"rating": 5.0, "review": "If you're an avid YouTuber and stream music from Google or Pandora, you will love this device. For $35 you can't go wrong. I love watching my channel subscriptions on the big screen and no longer have to use the xbox YouTube app.This device is going to change how we watch TV, remember YouTube has been experimenting with paid channels.", "verified": false, "helpfulness": "0/0", "author": "Devon"}, {"rating": 4.0, "review": "it's a cryptic install at best. so google fell short on easy install. They made it sound easy but if you don't know what you're doing it's really not. It trys to get you to sign up for gmail(which is junk) so don't and skip that part. Install chromecast and the extension for movies and you're good. Remember most anything in your browser can be viewed..i even got hulu to show. For $35. it's not a bad purchase. Thou they could have done a better job on the instructions. They could also eliminate all the unrequired info pop-ups which is misleading as part of the install.", "verified": true, "helpfulness": "0/2", "author": "REGULAR GUY..."}, {"rating": 5.0, "review": "I dont usually review things usually but I had to review this. This thing is just amazing had it since Friday 7/26 has been in use everyday since that day. Bought it so my mom could easily stream Netflix/Youtube from her Ipad, but use it from my phone now alot more.The only downside I cant think of is it doesnt support enough apps at the moment but that is to be expected with any new technology Im sure in the coming months alot of apps will be supported by this.Very easy, Very smart Google nailed this right on the head!", "verified": true, "helpfulness": "0/0", "author": "Buyer"}, {"rating": 5.0, "review": "At 35$ I got the streamer, an HDMI extension cable, a high quality USB power source, a charging cable, and 3 months free for Netflix. A great deal.", "verified": true, "helpfulness": "0/0", "author": "Gal"}, {"rating": 5.0, "review": "I opened the box, plugged the HDMI and USB ports in, was up and running in 3 minutes. I used the chrome plugin to stream a tab and it was great, then tried streaming HD video through one of those tabs, also worked great. Then sent some videos from youtube to load directly through chromecast, worked flawlessly.I'd suggest any of the negative reviewers to make sure their internet connection is fast enough to stream HD content and that their router supports wireless 'N' standards. A wireless 'G' router isn't going to cut it these days for the high quality HD content you've come to expect from your cable providers.", "verified": true, "helpfulness": "1/2", "author": "Craig McRae"}, {"rating": 5.0, "review": "I ordered the Chromecast the day it was announced and received it yesterday.  I was fortunately enough to have a TV with an open HDMI port with a USB port nearby for power.  I was worried that it might block access to the second HDMI port, but there was just enough room.Setup was a breeze and I didn't have any hick-ups.  I used a Nexus 7 tablet to control the Chromecast and it was quite easy to watch Netflix with the Chromecast.  I also displayed a video from Comedy Central's website using Chrome on a desktop machine and it played very well over the Chromecast.My only complaint it that the power-on light on the device remained on when the TV was turned off, and was quite bright.  As this was in my bedroom, I had to unplug the USB power cord to get to sleep.  I'll probably just cover the light with some black tape.", "verified": true, "helpfulness": "1/2", "author": "Paul Wasson"}]