[{"rating": 4.0, "review": "great product works well with youtube but won't work on competing product. Streaming from cell phone on youtube works fine.", "verified": true, "helpfulness": "0/1", "author": "sunil rajbhandary"}, {"rating": 4.0, "review": "I mainly use it to stream from my Chrome Browser. It's great at that. As for the limited App that is does have I have really only used Netflix and Youtube and I prefer my other streaming devices over the chormecast.", "verified": true, "helpfulness": "0/0", "author": "gohan2021"}, {"rating": 1.0, "review": "I don't like it i have tried every thing i know for it to work,and it will not work at all.Was sure hoping it would work.We have antenna and can't get hardly any stations.Was thinking of returning,but just have not been able to.", "verified": true, "helpfulness": "0/4", "author": "Sandy McKenzie"}, {"rating": 5.0, "review": "Gave this to my husband as gift.  Easy to set up and use, and works great. Husband wants to buy another for additional TV.", "verified": true, "helpfulness": "3/3", "author": "Krutch"}, {"rating": 4.0, "review": "I love it for it's price. My iPhone, iPad, and Android tablets works well with Chromecast. I still prefer Apple TV because it comes with it's own remote and it's easier to get to Netflix (and other apps) that way. Overall, very nice for it's price.", "verified": false, "helpfulness": "0/0", "author": "Q. Nguyen"}, {"rating": 5.0, "review": "We have two of these for the lake house. They work so good we cancelled the cable. We watch mostly Netflix and YouTube. The only gripe is that Amazon hasn't offered a Prime Video app. It's just dump business Amazon. Offer the app for Android!", "verified": true, "helpfulness": "0/0", "author": "Johnny P \"johnnyquest\""}, {"rating": 4.0, "review": "Love this little gadget. It's great for netflix. I do wish you can use it for All steaming but your limited. It's cheaper and worth if it's just for a few apps. Never had a problem with it. Used it about 15 times. Easy to figure out how to use it.", "verified": true, "helpfulness": "0/0", "author": "Ginam"}, {"rating": 4.0, "review": "Saved me the hassle of running a cable/fiber across the room to stream audio from my PC to my home audio system.  It mostly works well but there have been some occasions when the audio would start to stutter and the Chrome tab complains about network issues.  Perhaps it's because Chromecast only supports 2.4GHz and that band is shared by so many other devices in the house.  Regardless, for the low price, it's still worth it.", "verified": true, "helpfulness": "0/0", "author": "JasonE"}, {"rating": 5.0, "review": "You're never going to spend a better 30 bucks for a tech toy. Having netflix, hbogo, and my PC desktop on every TV with HDMI in the house is worth at least that.", "verified": true, "helpfulness": "0/0", "author": "Michael Tillman"}, {"rating": 5.0, "review": "Purchased two for myself and one as a gift for my friend. Firmly believe that the device's full potential has yet to be met. For now, though, it is a great device to use for watching Netflix (and other video) and listening to music on your TV. Even nicer if you've an older TV that has no built in apps; instant upgrade for 35 bucks! :-)", "verified": true, "helpfulness": "0/0", "author": "M. Concepcion"}]