[{"rating": 1.0, "review": "I have never been so dissappointed with a product!.  My new TV already has Netflix on it so the reason I bought the Amazon Fire was because I love the musicals and own many.  These are VCR copies and I thought that  it would be wonderful to be able to just \"sit on my butt\" and call up an old musical and be able to see it in the new digitized format.  Wrong.................Even though these are really old movies I have to pay for every one of them to either see or buy them.  Needles to say I haven't even used my Amazon Fire as yet.  I paid someone $75.00 to install it for me so, needles to say, I won't be taking it out.  Maybe someday I will want to see something badly enough to pay extra for it, who knows..................I do get things from you and have never before been dissappointed.  Recently I started getting food from Shwan's and I am a great one for ordering used books.  Keep up the good work.  I guess we just can't win them all.................", "verified": true, "helpfulness": "1/10", "author": "Marian G. Weiss"}, {"rating": 5.0, "review": "So, let me start off by saying that I'm no tech geek, I won't go over lists of specs and tests and benchmarks, nor will I go over how it interacts with all the different devices....just me and my feedback. I cut the cable and went with roku a few years back, but have been disappointed as of late with their product, so when this came out I decided to give it a go. Also that Amazon is offering it on a flex pay deal made it an easy option. Here is what I've noticed so far:It is faster than the roku. Way faster. None of that nonsense of waiting for the buffer to catch up. It doesn't have the overheating problem that plagues the newer versions of the roku.It doesn't have as many channels as the roku, but I don't watch Tamil language programming or the internet equivalent of public access anyway, so there's not much angst. The one thing it is missing that I do mind about is PBS on demand.The voice function is pretty damn cool. I want to watch Archer, and I just say so. Or even by actor name if I can't recall the show.It even came pre configured with my prime, so all I needed to do was plug it in and go.Slick amazon, you've taken over another part of my world.Buy one. You'll like it. Unless you watch Tamil programming and shows about worm aliens", "verified": true, "helpfulness": "1/1", "author": "eronele"}, {"rating": 2.0, "review": "So it's been two months since I deployed this in the living room. I do not like it. The Fire TV gets somethings rights but not enough to keep using it. This week I went back to a dedicated HTPC.What it gets right:Great build qualitySmall sizeRuns pretty cool compared to most media playersMenu layout is goodRuns androidWhat it gets wrong:Too Amazon centric, yes there's plex and netflix but that's truly it.Games are nothing interesting or compellingMedia format support is lacking, badlyI'm not sure why, but this thing uses twice the bandwidth as a Roku 3 streaming at 720pNo Amazon music support, yet... but why is this taking so long?What would make me come back is more media partners. Such as official support from Viacom for all of Comedy Central's streaming content. My blue sky wish would be support for Areo, but this needs to get played out in the courts before an established company like Amazon jumps on board.Final conclusion:The Roku 3 and newer players are still the best. Rolling your own HTPC is an option too but I find you still have to be fairly tech savvy. Let's put it this way, I bought my Parents Rokus for their two TVs. They use them without having to call and ask me how. They even find stuff available on the Roku that I did not know what there.", "verified": true, "helpfulness": "1/2", "author": "Steve"}, {"rating": 5.0, "review": "This product works as advertised. It is fast and easy to set up. I'm one of those people that has to have the new gadget. This is definitely a step up from Roku. Once they expand the voice control to include other than Amazon content, this will be excellent.", "verified": true, "helpfulness": "0/0", "author": "W. Lang"}, {"rating": 5.0, "review": "I love it!  It is so easy to use.  The sound is wonderful and the picture is so clear.  Awesome!", "verified": true, "helpfulness": "0/0", "author": "greeneyes"}, {"rating": 5.0, "review": "This was my first venture into the smart TV market and it integrates with the amazon prime service so well, plus having simple access to the most popular streaming services and the voice search, which really works well.  The picture quality and the size of the hard drive all give me options to explore especially since I don't want or have cable. It is a nice alternative for someone like me, who doesn't typically watch a lot of TV.  It gives me a lot more control over what and when I watch.", "verified": true, "helpfulness": "1/1", "author": "Christopher J Powell"}, {"rating": 4.0, "review": "As of 5/24/2014 Flixster is the only Ultraviolet Collection app available on the Amazon Fire. I've never been a fan of Flixster as my entire High Definition Movie collection always streams from them in VHS quality. It is terrible!If a Vudu or Target Ticket app becomes available within my 30 day trial, I will keep the device. If I'm left with just Flixster, it will undoubtedly go back.Having said that, the device is fast and intelligent. If all you do is stream content from Amazon Prime, Netflix, or Hulu-- this is the product for you. If you are a movie buyer-- and own an Ultraviolet collection-- you should look elsewhere until Vudu or Target Ticket become available on the Fire.Edit-Going to change my review to 4 stars since it does allow for some custom apps/nonsupported options. 5 if it weren't such a hassle to get Ultraviolet :D", "verified": true, "helpfulness": "3/4", "author": "Trace Van de Kamp \"Trace Van de Kamp\""}, {"rating": 5.0, "review": "Amazon has done it again.  Made a product I find great.  It works well and was very easy to set up.  Had one minor problem and asked to be called and within a couple of minutes was called.  It was something I had done wrong and their response to fix was really great.  Would recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Ronald"}, {"rating": 4.0, "review": "Very easy to hook up, turns on in an instant, was a little confused about no off switch but it shuts down pretty quick, voice recognition is for a Amazon only, was having some issues with netflix, was getting a white screen and an error code, unplugged it and replugged it and haven't had a problem since. Nice clear picture, excellent streaming.", "verified": true, "helpfulness": "1/1", "author": "Sharon"}, {"rating": 5.0, "review": "Very simple to set up.  Very simple to use.  Since I'm very simple, it's just what I needed.  Simply wonderful.", "verified": true, "helpfulness": "0/0", "author": "C. Denton \"Gray Wolf\""}]