[{"rating": 5.0, "review": "Pretty good value for what you get.  The instructions could be a bit better as the last part about using the broadcast button on app's like Netflix was a bit hard for me to figure out.  The video on google's website helped.", "verified": true, "helpfulness": "0/0", "author": "M. Joseph"}, {"rating": 1.0, "review": "it grate as it sound but it a pace of junk.  I hate it dont even do what it say.  All you can do it stream youtube.  If you look for some to stream you phone and tablet get a roku I love that thing better.", "verified": true, "helpfulness": "0/5", "author": "Denny Nguyen"}, {"rating": 5.0, "review": "It is such a user friendly piece of equipment.  You have to get used to it but once set up it is great.", "verified": true, "helpfulness": "1/1", "author": "Stacy Obiedzinski"}, {"rating": 4.0, "review": "Great product.one two three four five six seven eight nine ten eleven twelve thirteen to fulfill required number of words.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This does not connect directly from computer to TV as implied but rather goes from computer  to internet to TV.  As such it encounters the internet problems of bandwidth and latency.  Also there is the loss of security if it were to be used in a business environment.", "verified": true, "helpfulness": "0/5", "author": "Walker Power Design Jimmy A Walker"}, {"rating": 5.0, "review": "I was not very confident of this device at first but Google has done a hell of a job making this work. But I have to say that not buying this device is insane. The amount of apps that have compatibility with this device is unbelievable and it is just getting started.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Rodriguez Mann"}, {"rating": 5.0, "review": "A non-techie, even I could get this up and running within five minutes. The app is easy to use and so is the laptop interface. Could barely contain my glee when calling the local cable company to cancel my service! Works well with my MLB Network subscription, Netflix, etc. It is a bit \"laggy\" for live sports, but I'm not such a fanatic that it matters.  If you watch mostly movies/TV shows, you'll likely be quite pleased.Pros: Ease of use, valueCons: Lag time with live sports programming, works with a handful of apps", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The chromecast is cheap and pretty easy to use, though we've had an issue with getting our TV to recognize the port it's plugged into. The feature of casting from phone is nice, though more selection would improve it.", "verified": true, "helpfulness": "0/0", "author": "seamouse"}, {"rating": 5.0, "review": "It's only 35 bucks and you can do so much more than what the ad page says if you're truly interested in pushing your tech to the next level. Then it's great for parties if everyone has their smart phones then they can all cast onto the big screen and it's super easy to set up. It's just such a great communal device as well as a personal one. I share a tv with my computer and it's much more relaxing to drop the keyboard and go on my tablet for a bit while casting Netflix or Youtube.", "verified": true, "helpfulness": "0/0", "author": "Matthias"}, {"rating": 4.0, "review": "Still a limited number of apps, but Chromecast makes life easy.  Looking forward to what the future holds for another great Google product.", "verified": true, "helpfulness": "0/0", "author": "Andrew Gitzendanner"}]