[{"rating": 3.0, "review": "while streaming it always \"loading\", I didnt except for alot, but its even worse then i thougth..MAYBE this is a problem with my router, so I will check it out, and if my thougth will change, I will update my review", "verified": true, "helpfulness": "0/0", "author": "ALON HADAR"}, {"rating": 1.0, "review": "Did not work for my imac", "verified": true, "helpfulness": "0/0", "author": "Kourosh Shahriari"}, {"rating": 5.0, "review": "Works like I thought it would whatever is on my Nexus 5 phone I can stream to my HDTV.  Large selection of apps set up for streaming, can even steam Amazon prime.  Very easy to set up to home network.  Great value.  I would recommend having a good smartphone,  don't think it would work as well with older model phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "Anthony Buice"}, {"rating": 3.0, "review": "I bought this on a recommendation from a friend who loves theirs, unfortunately I can't say the same.  Mine stalls a lot then the words being said stop matching the movements of the people's mouths.  After that happens and you restart it a couple times, it looses sounds completely. I have borrowed said friends to see if it was something other than the Chromecast itself, however that one worked fine.  If I leave mine unplugged until I need to use it, it works better (it gets really hot when I don't and the problems tend to be a lot worse).  Sometimes I can watch a whole movie straight through which is why I gave this 3 stars; when it works, it's great but when it doesn't, it's supremely frustrating.  Evidently mine is just a lemon.  I've thought about just tossing the one I have and trying again but I've seen a lot of reviews with the same problems I've had and don't want to waste anymore of my money.", "verified": true, "helpfulness": "0/0", "author": "nlw167"}, {"rating": 5.0, "review": "I love this thing!", "verified": true, "helpfulness": "0/0", "author": "Heidi Smith"}, {"rating": 5.0, "review": "Love it so much, I bought one for every room in the house.  Super easy set up and good connectivity with Macs.", "verified": true, "helpfulness": "0/0", "author": "PS3 Paddy"}, {"rating": 4.0, "review": "I just dont like the fact that you can only control it with your phone.  Songza also has a glitch in it where it only plays one song at a time.", "verified": true, "helpfulness": "0/0", "author": "the rator"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Katie"}, {"rating": 4.0, "review": "google chrome, what else can I say", "verified": true, "helpfulness": "0/0", "author": "Loganator"}, {"rating": 4.0, "review": "Connected easily using my Samsung Chromebook...even on my Dual Band router.", "verified": true, "helpfulness": "0/0", "author": "RP"}]