[{"rating": 5.0, "review": "Nice very nice!!!  =)", "verified": true, "helpfulness": "0/0", "author": "Luis Cortes"}, {"rating": 3.0, "review": "It's cool but lacks easiness to set up. Full screen cast won't work most of the time or it will reproduce weird sounds on the TV.", "verified": true, "helpfulness": "0/0", "author": "Javier"}, {"rating": 3.0, "review": "It is OK. I just use my Roku much more.", "verified": true, "helpfulness": "0/0", "author": "Cynthia Miner"}, {"rating": 5.0, "review": "That's great.", "verified": true, "helpfulness": "0/0", "author": "Arnaldo Ramos-quiles \"Arnaldo Ramos\""}, {"rating": 5.0, "review": "Great to watch movies or videos, and its very inexpensive.", "verified": true, "helpfulness": "0/0", "author": "Eli R."}, {"rating": 5.0, "review": "Great smalll device. I love it.", "verified": true, "helpfulness": "0/0", "author": "Bessie Person"}, {"rating": 2.0, "review": "constantly requires connecting - bought two returning two", "verified": false, "helpfulness": "0/0", "author": "Sam"}, {"rating": 4.0, "review": "I was bummed to find out that the Chromecast doesn't support Amazon Prime Video.  Apparently you can kind of jury rig it to run from your browser, but seems like more effort than just watching APV through the app on my iPad.  It took a while to install/run properly, but was easy to do (make sure all apps and OS are the most current).Using it in conjunction with my TV sleep timer and Netflix resulted in Netflix shutting itself off, and the main \"decorative\" Chromecast screen displaying.  Sometimes, it's still less of a hassle to use iPad than to navigate through Netflix AND the Chromecast.Overall, does what it's supposed to do, relatively easily, plus it was quite inexpensive.  Would recommend to people getting rid of cable who don't want to spend a lot.", "verified": true, "helpfulness": "0/0", "author": "Liz S"}, {"rating": 4.0, "review": "I have to return this because my tv did not have the HiMI _not sure this is the right letters, but it would not work with my old RCA highdef. TV.", "verified": true, "helpfulness": "0/0", "author": "Texas rose  bud \"texasrosebud\""}, {"rating": 5.0, "review": "Works as expected. My wife watches Netflix using her 'smart' phone as controller.", "verified": true, "helpfulness": "0/0", "author": "HarleyDuc"}]