[{"rating": 5.0, "review": "Great product that had everything that we were looking for with its netflix and HBOGo compatibility. Also very easy to use", "verified": false, "helpfulness": "0/0", "author": "Samantha Lin"}, {"rating": 3.0, "review": "Need to be able to cast a tab with other streaming video. Also it locks in on netflixs and can not exit unless unplugging. it also needs a off switch.", "verified": true, "helpfulness": "0/0", "author": "Vic"}, {"rating": 5.0, "review": "This was a gift for Christmas and was the perfect little gift  for his Media Player, can't beat that for a gift.", "verified": true, "helpfulness": "0/0", "author": "ronald fugere"}, {"rating": 4.0, "review": "4 stars because it does what it's supposed to do, i.e. 'broadcast' the web site to the TV.  Unfortunately, if the website has a link to a PDF file, then one is s.o.l.  That's OK since the cost is very reasonable and is only a one time expenditure.  So, I knocked one star off because of my über-expectations.Recommended to anyone who just wants to \"Comcast\" a website to TV.", "verified": true, "helpfulness": "0/0", "author": "Angela"}, {"rating": 5.0, "review": "Easy to setup, I've done away with cable and now i'm streaming Netflix, youtube and Hulu on my 46\" with this thing. Sweet.", "verified": true, "helpfulness": "0/0", "author": "Burns13th"}, {"rating": 5.0, "review": "The days of lugging my desktop downstairs to plug into the television are over. I can stream not only YouTube, Netflix, and my favorite internet radio services, but also my personal media library using Plex. Elegant hardware, marvelous gadget. I love it!", "verified": true, "helpfulness": "0/0", "author": "Dillon Strichman"}, {"rating": 5.0, "review": "Amazing product, perfect price. After getting one for myself, I ended up buying one for my sister, parents, and girlfriend. I use it daily.", "verified": true, "helpfulness": "0/0", "author": "Cary Anderson"}, {"rating": 3.0, "review": "the first one i got had a defect in the button no the unit. got stuck inside and wouldn't retract. well the button would, but something on the inside wasn't having it. it kept factory restarting. sent it back for a replacement. The new one works ok.. casting from a computer, is somewhat choppy but it also had to do with your router so take that into account.. but the main thing that gets me, is when casting from hulu plus on my tablet. seems about 40% of the time it wont pick up, or give me the option to cast. sometimes i have to restart the unit. (unplug it and pop it back in). and other times it seems to have something to do with the app on the tablet. but restarting the app dose not fix it.. no no. you have to completely restart the tablet.. which is a pain when i have to do it 3-4 times a day. however casting from these apps is very smooth, unlike playback from the computer.", "verified": true, "helpfulness": "0/0", "author": "Cy"}, {"rating": 3.0, "review": "For the price, this is the best media streamer available today.  It doesn't support Amazon Instant Video and Plex requires a subscription to enable streaming to the Chromecast.  The Chrome tab streaming isn't exactly stable either, sometimes breaking in the middle of my 30 minute training videos.  It works pretty well as a streaming device for Hulu Plus and Netflix, but those also require subscriptions.  I'd easily choose a Roku (and I have done so) over this device, but the Chrome tab streaming gives the Chromecast an advantage if you don't want to bother with hooking up a laptop to your TV directly.  Finally, I found several flaws with detecting the chromecast from Windows 7 & WIndows 8, which were resolved by disabling all network connections (in the network & sharing center) except for the active one (either wired or wireless).", "verified": true, "helpfulness": "0/0", "author": "Daniel Levenson \"danfromfla\""}, {"rating": 4.0, "review": "I am satisfied with this product. Very easy installation. Moved itthe living room tv to the bedroom. Sometimes when I am looking at Netflixit hangs up and I have to play around with it to get it going again, reason foronly four stars.", "verified": true, "helpfulness": "0/0", "author": "anthony eccles"}]