[{"rating": 5.0, "review": "Great product. Works perfectly. I brought it to italy and it works fine. As soon as you have a good connection and a google browser you are good to go. Great enjoyment. Recommended!", "verified": false, "helpfulness": "0/0", "author": "Luca Iorio"}, {"rating": 5.0, "review": "I gave this to my tech-inexperienced mother for mother's day and she hasn't stopped using it since. She loves streaming Youtube videos to it, as well as Netflix and Hulu. I'm currently working on my Plex server to try and stream movies from my computer, but that's turning out to be a bit of a hassle. This thing is fantastic. Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Atromnis"}, {"rating": 1.0, "review": "I am incredibly disappointed in this product. The main problem is the lack of sound from the TV, which requires the viewer to watch the screen but listen to the computer speakers. Since there is a few second delay, the sound and video are out of sync. This is a common problem according to a web search.", "verified": true, "helpfulness": "1/1", "author": "K8tsmom"}, {"rating": 5.0, "review": "Great price for a device that can do so much. You won't go wrong getting one of these as a gift for someone who travels.", "verified": true, "helpfulness": "0/0", "author": "Informed Consumer from South Dakota"}, {"rating": 3.0, "review": "I have a Raspberry Pi, a Roku and a Boxee and I must say there is nothing special about the chromecast. Only a few applications allow you to stream to the device...", "verified": true, "helpfulness": "0/0", "author": "M. Stolzenberg"}, {"rating": 5.0, "review": "My husband and I bought this to stream YouTube and Netflix on the television. We both think that the picture streaming quality is pretty good and it serves its purpose well. No more having to share an iPhone screen when we want to watch a funny video together!", "verified": true, "helpfulness": "0/0", "author": "Regina Pham"}, {"rating": 5.0, "review": "It is a very good source to watch videos, movies and pictures from your laptop and cell phone. We really enjoyed.", "verified": false, "helpfulness": "0/0", "author": "Lydia"}, {"rating": 5.0, "review": "I ordered one the day it came out because I loved the concept, especially the independence from a device once your program is running. I bought it for my parents who are technologically slow, and they have no problem using it from an iPad, iPhone, or antiquated laptop. Not good for streaming video from a web page. Too much lag. Too much lag to use as a second screen in general, except for stationary presentation. Supported apps work beautifully. Price is right.", "verified": true, "helpfulness": "0/0", "author": "Duane"}, {"rating": 5.0, "review": "Chromecast is a cheap and easy way to get video from Netflix and YouTube onto your TV. I'd like more apps but at this price who's complaining?", "verified": true, "helpfulness": "0/0", "author": "Joao Felipe Coutinho de Sousa"}, {"rating": 1.0, "review": "Bought in Nov 2013. Started off working great, but then immediately started having issues.  I had to start re-booting the chromecast eventually it just stopped working all together.  I need something more reliable.  Will check out Roku and see how that goes.", "verified": true, "helpfulness": "0/0", "author": "J. Kong"}]