[{"rating": 4.0, "review": "Been looking for a reasonable way to untether our family TV from our older rather dated xBox with netflix app. Sure, we all watch on our respective computers, tablets and occasionally one of our droid phones but, there's nothing like sitting down together in the living room as a family unit and digging Ferris Bueller's Day Off out of the Netflix archive. While the xBox does display 1080p (what about that COX? 1080i's the best you offer??? That's only 540p non-interlaced! Fool me once.So, anyway the chromecast came in last week in a cute little box with the smallest instructions I've received, ever. Folded it weighed in at 4 pages an inch wide by 3 inches tall? Didn't really need them as it's basically plug-n-play. Stick it in an available USB port, tether it with the supplied DVI cable into a Hdmi port, fire up the TV, grab the code and enter it into your tablet/Netflix App.", "verified": true, "helpfulness": "0/2", "author": "kevin murray"}, {"rating": 4.0, "review": "Setup was a breeze as is streaming video to your HDTV.  Only major drawback is a lack of apps.  If your library is limited to Netflix, Playstore, YouTube and HBO Go, you'll love this device.It would be much simpler if Google simply imbedded their Chrome browser on this device.  This way, you have a lot more viewing options.", "verified": true, "helpfulness": "0/0", "author": "Roger A. Yocham"}, {"rating": 3.0, "review": "As others have mentioned, this product is way too restrictive.  I had envisioned all of my media needs met by this device, but Google only supports certain streaming apps.  I have a slingbox and an app, but I can't cast the stream unless I play it on my computer, then cast it from a chrome tab.  If you want to cast your computer, you again have to have Chrome to do so.  Google has forced customers to download their browser to use part of the features, which I don't care for.Playing anything outside of the supported apps requires you to 1) buy a powerful computer and 2) download chrome  3) hassling with the computer to play it.  This process should all be seamless.I will be trying the Miracast Video Receiver which is on sale for $20 around the web.", "verified": true, "helpfulness": "0/0", "author": "A. Hoover"}, {"rating": 4.0, "review": "Like it works great and is very easy to use.  Could use use more apps on to do on them", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "No idea why one set up easy and the other will not connect to the internet.  Tried everything.  Talked to google support and went through all the trouble shooting steps.  Nothing.  I was able to set it up but error message said not connected to the interment.  It's not my router.  Everything else is working.  Tech support told me this device has to be only 20 feet from the router.  Did that too.  Nothing.  Even though the other works fine. It's going back.  Maybe you can't run two in the same house correctly.", "verified": true, "helpfulness": "1/2", "author": "Dee \"Dee from PA\""}, {"rating": 5.0, "review": "This product is  very easy to use and met my expectations. I do hope Google expands what this can be used with, but that doesn't take away from the fact that what they say they support, they do, and the product works well.", "verified": true, "helpfulness": "0/0", "author": "Bob Puglis"}, {"rating": 1.0, "review": "I just received my Chromecast yesterday.  I want to make clear upfront that I do not get cutting edge technology as far as smartphones or even PCs go.  I do not have smartphone, so I can not operate the Chromecast from my phone.  I do have an iPad but, of course, the Chromecast app can not be installed on it because it is the first version of iPads and the Chromecast requires iOS 6.  In case you did not know, Apple does not upgrade the OS on iPad (first version) any more. iOS 5 is on my iPad.  I have a desktop PC that is pretty up to date (I am a software engineer and need it to have some power).  When I used it to try to set up my Chromecast, it found the device but could not set it up.  I tried numerous times.  Google says it needs to be within 20 ft of the TV, which my desktop PC is NOT.  OK, I understand the rules.  Unfortunately, neither the PC or the TV can be moved, so I am going to plan B (or C or D).  I have an old laptop that is running Windows 7 but only has 2GB of RAM.  However, it does have a kick butt wireless USB dongle from Cisco (Wireless n).  I took that PC into the room where the TV is and I started to run the setup.  This time my laptop found the Chromecast and installed Chrome (Browser) and ChromeCast App on my laptop.  I was getting excited.  Things were looking up.  No matter what I tried, I could not get anything to stream to my TV.  All I was able to do was view scenic pictures that Google brought down from the web.  I will try again tonight but I am getting frustrated.  I have Roku and AppleTV and have never had similar issues with either of these products.", "verified": false, "helpfulness": "1/5", "author": "Michael R. Dixon \"headbangerzoso\""}, {"rating": 5.0, "review": "Great addition to my network- easy to install and works great as long as you have a fast internet connection", "verified": true, "helpfulness": "0/0", "author": "Howard Goldstein"}, {"rating": 3.0, "review": "Chromecast has the ability to be a seriously amazing entertainment tool, but there is a long way to go. I let advertisements fool me into thinking that potential was closer to being realized. Don't get me wrong it is nice to play Youtube, Netflix and HBOGo on my TV from my iPhone and iPad, but casting a web tab has serious room for improvement. This device requires a seriously strong internet connection and if your unsure if your connection will be strong enough, it is likely not strong enough. I have Xfinity Blast internet and I have had frequent issues with excessive buffering, casting failure and being forced to try my cast again. Now I do love my Chromecast when it is working, but I just feel like the whole device is a beta with the potential to be a integral part of living rooms everywhere. If you have a strong and fast internet connection, and do not mind the frustrations that commonly come with new technology then you will be very happy with Chromecast. Its not a \"bank breaking\" purchase and for me it is worth the occasional hassles.", "verified": true, "helpfulness": "0/0", "author": "Frederick H. Mitsdarfer III"}, {"rating": 4.0, "review": "The Chromecast is great for streaming Netflix or YouTube videos on your TV. It does have a few limitations, but Google is adding more and more apps that it will support, so I expect it to get better as time goes by.", "verified": true, "helpfulness": "0/0", "author": "Doug Neeley"}]