[{"rating": 4.0, "review": "This device is reaaly cool, Stream anyhing frim your google chrome web browser to your TV. Versy simple and easy setup. I had tis working within 5 mins after removing it from the box. The reason for 4 stars instead of 5 = When watching over the air broadcasts via my outdoor tv antenna, this device causes intermittent interfearence with reception, If I uplug the power supply (USB port) to the device when not in use the interfearence issue goes away, This may or may not happen on all TV's mine is an LG 50\" plasma", "verified": true, "helpfulness": "0/0", "author": "Rob Rosenberger"}, {"rating": 1.0, "review": "Was very disappointed with Chromecast as it is only web based streaming only through Chrome.  But it does do as it is advertising claims and for the money I guess that's OK.  I will have to put this in my junk drawer for now, has no value to me.  My money was better spent on  Diamond Multimedia WPCTVPRO 1080p VStream Wireless USB PC to TV Adapter which allows users to stream their laptop or PC fully.http://www.amazon.com/Diamond-Multimedia-WPCTVPRO-VStream-Wireless/dp/B00AKYVMG2/ref=dp_ob_title_ce", "verified": true, "helpfulness": "0/0", "author": "Shane Mac"}, {"rating": 5.0, "review": "I didn't know exactly what to expect when I purchased it, but I was so happy to see how easy it was to use.  I can stream any site page I want to share with others, and enjoy netflix live streaming and you tube videos just like I was watching tv.  I'm very happy with it and I look forward to hearing that other sites have complied with its use, like netflix did (there's already a few), which is why I was contemplating giving it 4 stars instead of 5, but it's too good of a price for what you get.  I would suggest this to anyone because the entertainment value gained at such a little price is great in my opinion.I'm thinking of getting a second one so I don't have to unplug it from one room and take it with me when I switch tv's.  I recommend it!", "verified": true, "helpfulness": "0/0", "author": "whatever"}, {"rating": 5.0, "review": "The only thing that would make Chromecast an even better product is if I could stream from other apps to it.", "verified": true, "helpfulness": "0/0", "author": "Alex Veytsel"}, {"rating": 1.0, "review": "Didn't realize it was SO limited. Get a MINI-PC (Android based system) instead! It has the same options plus WAYYY MORE! My TV is essentially a giant tablet now (with the mini-pc). It is packed with apps & games, & I can control it with my phone or a wireless keyboard & mouse.", "verified": true, "helpfulness": "1/2", "author": "A. BEMILLER \"Bematorial\""}, {"rating": 5.0, "review": "I didn't think this would work..but it works very well and we use it all the time..I can't believe I waited so long to buy it..Love it!Update to initial review: After using this for a few months I have noticed a few things. I have to turn off my screen saver and power saver on my laptop before I start casting. If I don't, the casting stops, and it's a pain to get started again. What I do like is that I can cast Anything from my laptop in a Chrome tab. I have no problems with video from any site. I use my laptop between my wifi and tv. It seems to work better. I still recommend this as an inexpensive way to watch tv and personal video, music, or pictures.", "verified": true, "helpfulness": "0/0", "author": "cshelskr"}, {"rating": 5.0, "review": "I had no problems with setup and use... I only wish it supported more android apps.  For the price it is still a 5 star product.", "verified": true, "helpfulness": "0/0", "author": "Chris Mitchell"}, {"rating": 2.0, "review": "Got the unit today really excited ready to watch amazon prime....not...Took a little time to get the unit connected since I am not the most tech savvy operator. Finally got setup and would not stream Amazon prime movies which is why I purchased it. What a letdown. If I would h read these reviews I would have saved a lot of time and ......l am returning it until upgrading  has been accomplished.", "verified": true, "helpfulness": "1/2", "author": "A. Taylor"}, {"rating": 2.0, "review": "Good for YouTube but it seriously needs to fix the chrome cast extender to allow casting of different sites and not just from laptops! It's sad, because everyone knows it can do so much more than what's allowed. Now chrome cast and google aren't even trying to sync this with apple products! C'mon already!", "verified": true, "helpfulness": "0/1", "author": "L.J. Coates"}, {"rating": 5.0, "review": "Works well, as described with all accessories in original packaging. Very handy for streaming services and will only get better when the SDK is released", "verified": true, "helpfulness": "0/0", "author": "Nicholas Karamanos"}]