[{"rating": 1.0, "review": "I bought this hoping it would be an easy way to mirror my computer to my TV and Stereo. Not so easy! First, I had a lot of trouble trying to make it work with Netgear's latest Nighthawk router. Then, I found that it won't stream iOS devices unless you're using an app that has a streaming selection on the upper right. Since I use both iPad and iPhone, this isn't a good solution. And as mentioned, I never got it working with my Dell Latitude E6330. Google help did send instructions, but they were too long to consider, and with it not streaming iOS Devices, plus hard to connect, it just isn't worth the effort. I'm getting Apple TV.So, like Google's initial Google TV, this could be the ideal device, but it clearly isn't. Such promise! Such frustration!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer 921 \"daviddm1\""}, {"rating": 3.0, "review": "After buying this, I saw an older version Roku for $49.... I wish I would have purchased it.  The thing that Chrome does extremely well is Youtube.  it also allows a nice interface with Google Chrome.  But beyond that - - not much.  For instance, I cannot show my IPad pictures on the TV, using Chrome.  That sort of thing is frustrating.So - it's ok - - but just ok.  I'm sorry I bought it.", "verified": true, "helpfulness": "1/1", "author": "Bob S"}, {"rating": 5.0, "review": "I bought this as a Christmas gift for my son. He's been happy with the performance of this and it's ease of use. Came carefully packaged and delivered on time.", "verified": true, "helpfulness": "0/0", "author": "MOM2Ryan \"Mom2four\""}, {"rating": 3.0, "review": "This product works well with streaming video through ipod touches and our old ipad, but it's not compatible for use with our blackberry phones. We already have apple TV on our main tv, bought this as a cheap way to stream on our other TV too, but are very disappointed that we still have to use apple products. It also will not work with Windows products. This makes no sense to me. So tired of \"i-everything\". Since Apple tv already exists, wouldn't it make more sense for Chromecast to work on devices other than Apple?", "verified": false, "helpfulness": "0/1", "author": "Mrs.L"}, {"rating": 5.0, "review": "I install on my Panasonic hd 58 inch tv it is practical to have it but the picture is not clear", "verified": true, "helpfulness": "0/0", "author": "Ned E. Chika"}, {"rating": 5.0, "review": "Yes, finally, a way to take that funny video or PPT or webpage and throw it up on the big screen so everybody in the room can share. Just no more kittens, please!", "verified": true, "helpfulness": "0/0", "author": "Tfruman"}, {"rating": 3.0, "review": "when the movie is going , everybodys cool, it STOPS, TO BUFFER!! BUFFER IN LINE PLEASE! otherwise it works great.", "verified": true, "helpfulness": "0/0", "author": "Ronald Battle"}, {"rating": 4.0, "review": "I'm a Brit living in the US. I often watch some of my beloved UK TV programs on my computer and was looking for an easy way to get these onto my TV. So for Christmas, I received this little thing. Setting it up is a breeze, very easy (though you do, It seems have to use Google Chrome, correct me if I'm wrong). So you play the video on your computer and 'cast' it through to the Chromecast and it plays, as if by magic on your TV.My first attempt was nightmarish. Stuttering picture, terrible sound, and my programs were completely unwatchable. I then tried again after resetting my router (it hadn't been rebooted for a long time), and making sure that only Google Chrome was running on the computers. Much better! I'm not going to tell you it was perfect, sometimes the audio was slightly and annoyingly out of sync and it would still sometimes freeze, but it's perfectly watchable. I'm confident that with further fiddling around, I'll get it even better.So my conclusion is that this thing is pretty darned good. It's a simple little device that does what it says, and works very well. I look forward to seeing what updates they plan for it in the future.", "verified": false, "helpfulness": "0/0", "author": "Londonnoise \"Robby\""}, {"rating": 5.0, "review": "Perfect for displaying pictures, videos, movies on your TV.  Anything I take I can display on the big screen for all to see without any hassle.", "verified": true, "helpfulness": "0/0", "author": "Kenneth \"kcobra\""}, {"rating": 4.0, "review": "Love this.  Rather than deal with my clunky Netflix app on my Samsung wifi bluray player, I just use the Netflix app on my phone and stream it to my Chromecast.  Works great with Youtube as well.", "verified": true, "helpfulness": "0/0", "author": "Michael Wiley"}]