[{"rating": 5.0, "review": "Perfect. Seamless. Genius. No preloaded apps. Just casts apps or screen to your TV. This small, compact portable device is the most amazing lil piece of technology I own. You can cast any and everything. Almost all videos are compatible and if they're not you can just screen mirror!  Keeps getting better & better. Get around Prime restrictions by casting screen. Best $25-35 you'll ever spend. I have two.", "verified": false, "helpfulness": "1/1", "author": "A. Freedman \"techie\""}, {"rating": 5.0, "review": "Easy to set up and works as intended. Too bad i had to return it due to changes in living situation.", "verified": true, "helpfulness": "0/0", "author": "Duc Nguyen"}, {"rating": 4.0, "review": "Excellemt", "verified": false, "helpfulness": "0/0", "author": "rut diamint"}, {"rating": 5.0, "review": "The key for this to work properly for me was to add the extension cables.  Just using the very small extender that came with it was not sufficient - I was getting a lot of white screen flashing and disruptions and was alomost ready to give up.  But after adding the longer extender this completely ended and streaming is perfect.", "verified": true, "helpfulness": "0/0", "author": "J. FISHER"}, {"rating": 4.0, "review": "Not many IOS APPs work with it", "verified": true, "helpfulness": "0/0", "author": "Julie Cheng"}, {"rating": 1.0, "review": "Opened my new Chromecast, plug it in, and immediately on the screen showed the Wifi network and ISP of my Chromecast's previous owner. Looks like Amazon sent me a refurbished Chromecast instead of a brand new one. How did I confirm this? I googled the Wifi name of the previous owner, which turned out to be the guy's last name, along with \"Chromecast\". The first several results were message board posts from this guy complaining about his, now my, Chromecast not functioning properly. Minutes later I found out that even though the Chromecast was on its second owner, it was having the same problems. Not only did Amazon not send me a brand new product as advertised, they neglected to wipe out the previous owner's info. A little frightening, huh?", "verified": true, "helpfulness": "0/0", "author": "Jesse Alkire"}, {"rating": 4.0, "review": "I have two and some time  there are steaming and connectivity issues, but it does the job I guess.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "I love this thing we watch YouTube my Netflix, Google Play Movies, family my videos plus they give me $20.00 credit code on my Google Play to get whatever I want it I got it back a couple of months ago when I got it is real easy to install small so it doesn't take a lot of room in back of your TV. WE JUST LOVE IT !!!!( Google Chromecast  HDMI  Media Player)", "verified": true, "helpfulness": "0/0", "author": "WhiffySky431"}, {"rating": 5.0, "review": "Great gadget!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Perlis"}, {"rating": 5.0, "review": "working perfect.", "verified": true, "helpfulness": "0/0", "author": "Kiran Pradhan"}]