[{"rating": 1.0, "review": "wouldn't even hook up to the internet service we have here", "verified": true, "helpfulness": "2/6", "author": "Kenneth Pfiester"}, {"rating": 4.0, "review": "Streaming HD movies is pretty good.. No lagging. Voice search works well. I wish they can filter out all non-prime content so my kids wont try buying non-prime content... I've had it for 2 weeks. Will follow up if i see issues.", "verified": true, "helpfulness": "1/1", "author": "Jeric9"}, {"rating": 5.0, "review": "Totally awesome! Able to warch newer movies and play games without additional charges. Would highly recommend this to movie lovers!", "verified": true, "helpfulness": "1/1", "author": "Charlotte K. Sanders"}, {"rating": 5.0, "review": "Love my Fire TV!! Faster than Ruku3 and better than Apple TV, i've tried them all and love this one best so far.", "verified": true, "helpfulness": "0/1", "author": "Sarah Marie"}, {"rating": 5.0, "review": "Awesome! Great choice of films. Very easy to install and use.", "verified": true, "helpfulness": "1/1", "author": "Foxchase"}, {"rating": 3.0, "review": "we love the Amazon fire TV we ordered 2 of them in November for Christmas gifts we paid $99 each I see now they are $79 each. we have placed 40 orders in the past 6 months. I think we should receive a refund for the $40 we paid over the sale price. or at least a $40 gift card. Please advise.", "verified": true, "helpfulness": "0/2", "author": "Jim Delhunty"}, {"rating": 5.0, "review": "Loving it! It was easy to set up and get started and is working so much better than our previous setup (different product). Voice search has been especially fun and useful :-)", "verified": true, "helpfulness": "0/0", "author": "Rachel F."}, {"rating": 5.0, "review": "Hello all this looks great but have a question if anyone can answer me..can or how do you get local channels..like local and national news and do I need two units for my upstairs and downstairs TV's...seriously thinking on getting this but also want my local news..anyone know..thank you..", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very easy to install and use. Best Christmas present of the year!", "verified": true, "helpfulness": "0/0", "author": "Susan wright"}, {"rating": 4.0, "review": "Fire download is very fast and excellent picture quality. Would like better help access. On internet or on TV  screen. Especially for Netflix application.", "verified": true, "helpfulness": "0/0", "author": "Anthony J. Ruotolo"}]