[{"rating": 5.0, "review": "Simple, eloquent, and just works. Love that my kids can now use the old iPad to pick out the show they want to watch on their own without having to find the right remote and channel. Once they push play on the device it will switch inputs and start playing.", "verified": true, "helpfulness": "0/0", "author": "Sean Murphy \"murfmiser\""}, {"rating": 4.0, "review": "It was super easy to connect and we found that if what you're wanting to watch what is on the device, like netflix or youtube it works great! It's fun to use your phone or laptop to control what you're watching. However, the reason we bought it is to watch shows on xfinity that are only online, so we had to watch the webpage instead of a program that was on the device. The connection was always running a smidge behind, so the words didn't match what the people were saying and it drove us crazy and we gave up!It's still pretty neat little toy for a great price.", "verified": true, "helpfulness": "0/0", "author": "Carrie"}, {"rating": 5.0, "review": "I purchased this just to watch Netflix on my TV but I have really loved Pandora. I wish I could watch Amazon Prime as well but Netflix keeps me busy!", "verified": true, "helpfulness": "0/0", "author": "sterling"}, {"rating": 4.0, "review": "Love the consept.  I use my phone for every thing so that part I like.  The device it's self requires a strong wifi signal so that has been a challenge.", "verified": true, "helpfulness": "0/0", "author": "Justen Fowler"}, {"rating": 2.0, "review": "Bought one returned it becAuse it stopped working and ironically it only works with my iPhone? Although I could get it to work with my android tablet for the first few days. It's neat when it works, lots of glitches it seems.", "verified": true, "helpfulness": "0/0", "author": "Craig O."}, {"rating": 5.0, "review": "This is a nice piece of kit. Sets up easily with either a computer or you can download the app for chromecast setup. I used the iPad app. Chromecast-ing took my old \"dumb\" HD television and made it 21st century. It also casts pandora, which I thought was cool.", "verified": true, "helpfulness": "0/0", "author": "Tyler Jandreau"}, {"rating": 5.0, "review": "I was looking for a wireless graphics card so I could watch movies from the computer on the tv. Once I found the chrome cast and tried it, it was great. It does everything I wanted. The only thing I  Would recommend is having a good wireless router to handle the wireless display.", "verified": true, "helpfulness": "0/0", "author": "Cody Boyd"}, {"rating": 1.0, "review": "This device has issues with streaming keeps buffering all the time while my other WiFi devices stream without any issues.No just will not recommend this device.The screen mirroring between my samsung tv, samsung blue ray player and my android phone works perfectly fine", "verified": true, "helpfulness": "1/2", "author": "Bookcritics"}, {"rating": 5.0, "review": "Easy to set-up. Easy to use. East to set-up anywhere. Easy to use everywhere!Pick one up now! VERY AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Cory Frons"}, {"rating": 5.0, "review": "It's easy to use and I can watch things on my TV instead of my little phone and it's cheap. I'd recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Bobby D. Warren"}]