[{"rating": 2.0, "review": "Limited Google applications. Chromecast should be application agnostic. ANY application should be able to CAST, not just limited to Chrome. There are other devices on the market already without ChromeCast limitations.", "verified": true, "helpfulness": "0/1", "author": "Hossein M Moghadam"}, {"rating": 5.0, "review": "Awesome device!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I should say that my review is not necessarily on the product itself which works well enough for the limited item that it is.  My complaint is that its advertising is somewhat misleading.  I wish I had read some of the reviews here before buying one.  Be aware that you CAN NOT show locally stored content from your computer to your TV screen using this device.  For years I've used a cable connection to my laptop to show vacation photos and videos.  The cable connection allowed me to basically use my TV screen as a monitor for my computer that would allow the whole room to see what was being called up from the hard drive.  The Chromecast will NOT do this.  If you want to show your pictures or videos, you will first have to upload them so some cloud type website which you can access.  ALSO, in order to use Chromecast, you must use Google Chrome as the browser to access this website.  I generally use MS Internet Explorer so I had to download Chrome just to even set up the Chromecast device with my router.  So, if you are a person who stores their photos on a cloud site or are only interested in streaming things from the internet, Chromecast will be fine.  If you think it will be a way to wirelessly sync your computer to your TV screen as a monitor, you'll be wasting your money.", "verified": false, "helpfulness": "0/0", "author": "HD Rider"}, {"rating": 5.0, "review": "Nice!!!", "verified": true, "helpfulness": "0/0", "author": "Vitor H Bellote"}, {"rating": 5.0, "review": "Honestly, out of the box, I was like ugh what a waste of money because I couldnt want Amazon Movies or MLG.TV. Till I realized there's the chromecast extension for google chrome. Ive been able to watch everything I want off of Amazon, MLG, TWITCH, and more.I have my TV mounted on a wall behind my computer desk and if I ever want a movie or tv show running in the background with the click of a button on my browser tab it'll pop up on my tv. If i want a family member to see something on my browser without them hovering over my desk they can see it on my TV. Seriously you cant beat the 35 bucks to have this little device, once you get the grip of using it you can't be without it. This is definitely something I will travel with to any hotel so I can watch a movie without paying an outrageous hotel movie rental charge. I'm not signed up for netflix or hulu but for Amazon Prime and among other sites that are free online to watch latest episodes or movies.If your not a must see now type of person then you could get rid of your cable bill with just catching up with episodes online using this device. If im feeling lazy I just use my phone to watch movies, but for the chance to watch more shows and movies I would recommend just using your google chrome browser on your desktop computer, and yes desktop! I dont use a laptop or tablet I use my desktop with the google chromecast extension available for your google chrome browser.", "verified": false, "helpfulness": "1/1", "author": "Stephanie Perez"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Donna D'Onofrio"}, {"rating": 4.0, "review": "Buying was good, but I had expected Hulo to be included because price wise I could have purchased it at the bug box store. It's all good.", "verified": true, "helpfulness": "0/0", "author": "Julie Young"}, {"rating": 5.0, "review": "Excellent...!", "verified": true, "helpfulness": "0/0", "author": "Wilder Jimenez"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Martin Gonzalez"}, {"rating": 5.0, "review": "Awesome. No need for cable", "verified": true, "helpfulness": "0/0", "author": "Ryan"}]