[{"rating": 3.0, "review": "I have wait and watch - what additional features that google will put into chromecast device? I did try using my windows laptop. It did work fine. I tried to connect Chromecast using Windows phone - not supported. This is similar to airplay from Apple. Good device by Google. Need seamless communication with various devices (non-android based).", "verified": true, "helpfulness": "1/5", "author": "Umesh Satyanarayana \"Umesh\""}, {"rating": 5.0, "review": "It was easy to install and operates effortlessly. The fact that it is portable means I can take it anywhere and plug it in and go. The only problem was setting chromecast for all my gmail accounts. This wasn't explained and it took me awhile to figure out I had to go to the Chrome store for each account and add the Chromecast Extension for each user.Now my big question is where is the Coupon for my 3-months free Netflix. It didn't come with the device and I can't find any way to get the coupon. Google states that you need to get the coupon from the retailer you purchased the device from. That's you AMAZON.Now where is my coupon.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Make sure you have enough HDMI available inputs on your TV.  Understand the applications for this product are limited right now but will grow in the future.", "verified": true, "helpfulness": "1/1", "author": "Schnabby"}, {"rating": 3.0, "review": "I bought a Sony Blu-ray Disc/DVD player with EIFI. It cost about twice as much as the Chromecast device but it does tenfold more. It is really a nice player/browser. I still use the Chromecast on another TV but the Sony is my first string.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 2.0, "review": "It\"s o.k but as it is it\"s nothing special.only plays songs I have uploaded to Google play music ,others in my library won't play.Youtube works,but my Apple tv does that .it\"s a cool gadget,when more apps work with it I think it will be much better.", "verified": true, "helpfulness": "3/6", "author": "robbie H"}, {"rating": 5.0, "review": "As long as you go into purchasing this item understanding what it is capable of you'll be a happy customer. I like to watch shows and movies that I can stream on my computer, but not available through mainstream apps on my xbox or blu-ray player, and this makes it easy to do so. Some people have reported some delay or video quality issues, but I have experienced neither and am quite satisfied with no longer requiring a lengthy hdmi cable or lugging my desktop computer from the office to the living room.", "verified": true, "helpfulness": "1/2", "author": "Neil D Parry"}, {"rating": 4.0, "review": "I must say this thing is pretty nice.  Controlling from an android phone is so convenient.  It really needs a web browser and ability to play local media.  Other than that I can see so many possibilities for this as long as Google follows through with this and actually commits to making it a great device.Google kind of has some history with Dumping devices if there not popular when expected.", "verified": false, "helpfulness": "1/1", "author": "ThunderStick"}, {"rating": 4.0, "review": "This works great watching mpg-4 movies from your computer on your TV.  Very nice to be able to move to the bedroom to watch the movies.", "verified": true, "helpfulness": "0/0", "author": "Larry B. Walker"}, {"rating": 4.0, "review": "I love having the \"newest\" and \"coolest\" tech-toy - which is what drew me to the Chromecast and to order it as soon as I could.I was slightly disappointed to realize I had to plug a mini-USB cord into it to power it (our TV has a USB port, so it's not a big deal), but that disappointment is very minimal when I think about it being a no-brainer that a device like this would need to be powered. I'm probably more disappointed that Google didn't accurately portray this in any of the videos/images I saw of it in action.We cast from laptops and smart phones in our home and can honestly say we love the technology and ability!", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "If you have a good Wifi connection, you will have a very good experience with chromecast ! Hopefully, they will add more apps in addition to the aexisting youtube & Netflix etc", "verified": true, "helpfulness": "0/0", "author": "SUDHIR"}]