[{"rating": 5.0, "review": "I have been a prime member since it started. This makes Amazon Fire TV and sticks perfect for my family. I used to pay over $200.00 for baseball on Comcast. With my mlb subscription it's only 130.00 on any device, laptop,phone and fire. My grand kids all have kindles. I have an iPad so I went for Apple TV and one roku. Amazon fire TV and sticks are far superior for my needs. Comcast doesn't support hbo to go. We are hoping that we can cut the cord some day. I highly recommend. I have the fire TV on main TV and sticks on 3 others. I will give the roku away as a gift. Very user friendly, easy to set up. I recommend setting the parental control so as not to accidentally make a purchase if your a prime customer. I did. Amazon corrected it swiftly. My family are heavy Amazon users.", "verified": true, "helpfulness": "1/1", "author": "R.S.CASTORANI"}, {"rating": 4.0, "review": "The interface is not as good as the Apple TV but pretty darn close. I like the ability to play games.", "verified": true, "helpfulness": "1/1", "author": "Scott Kelly"}, {"rating": 5.0, "review": "I hesitated before getting Fire TV because I didn't understand fully how it works.  I was using a PS4 to stream Netflix on my TV and it was such a pain, I hardly ever used it.  FireTV is so easy and works so well, I feel like kicking myself for not getting it sooner.  I was surprised and pleased to see how much the Amazon Prime service offers.  I'm already hooked on their exclusive content.  I love watching movies and TV shows on my schedule.  I got one for my daughter and her family and now she is hooked too!", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This streamer works very well.  It is very powerful and handles tasks very easily.  This product sets up in just a few clicks and is as uncomplicated as it could be.  The remote fits well in my hand and is also uncomplicated.  There hasn't been anything added to this product that it doesn't need.  I would like a couple things included in the product however.  I would like to see some kind of mounting bracket.  The remote doesn't need to be in sight of the system so it would be nice if I could hide this behind my tv.  I would also like for it to have buttons for the tv's hdmi and volume control.  If it had those things it would be perfect.", "verified": true, "helpfulness": "2/2", "author": "lightnup"}, {"rating": 4.0, "review": "I wasn't expecting to purchase Amazon Fire TV. Was explaining it to a friend and then noticed they had a 1-day sale and I got one for myself for my non-smart Toshiba master bedroom HD set.It's elegantly simple and low profile. Installation was easy, but unfortunately it did not work right out of the box. I called customer service and they did some remote troubleshooting and got it up and running quickly. While I would always prefer that something work as it's supposed, it's gratifying to know that Amazon stands behind the product and very professionally, patiently, and amicably worked with me to resolve the problem. I'm not marking them down for that.I only wish they had a little bit more exciting content. I'm an Amazon Prime customer so that helps a little bit, but while they claim a lot of quantity the quality isn't totally there yet. I believe it will improve over time.An unexpected benefit of Fire TV is that it serves as a back-up to my Comcast Xfinity X1 service. While I like what the X1 platform is and does, it more often than it should freezes and/or needs to be re-booted. When that happens I just switchover to Fire TV rather than be without service on that set.In conclusion I do recommend Fire TV to friends.", "verified": true, "helpfulness": "1/1", "author": "JMagColorado"}, {"rating": 5.0, "review": "I love my Fire TV.  I have both Amazon Prime and Netflix.  My blueray player's Netflix app was really poor (sound was out of sync with the picture) and it was a pain to turn it on, connect, select a show and play.  The Fire is super easy to use, turns on quickly and plays perfectly.  It also has a PBS app you can load... Miss that latest episode of Downton Abbey? You can play it the next day on the PBS app.  There's also a Pandora app.  I listen to music a lot thru Pandora.  I used to connect my iPad to a speaker for that.  Now, I fire up Fire TV.  You can also listen to Amazon Prime music and any music you've purchased thru Amazon.  The only thing I've had an issue with is that it doesn't auto-power off after I listen to Amazon music.  I'm sure there has to be a setting to resolve that; I just haven't found it.  All this is packaged in this tiny little box -- about the size of two CDs on top of each other.  I'm very pleased with this purchase.", "verified": true, "helpfulness": "2/2", "author": "Tugster \"Tugster\""}, {"rating": 4.0, "review": "Since we have Prime, I decided to go with the Amazon Fire TV. The system is quick and responsive and there are a lot of great games and apps. The movies are nice and stream very quickly. The paid movies are a better price than Direct TV for the same movie.All this being said the Prime movie selection is very limited and runs out after going through a list of suggestions.One minor flaw: There seems to be more movies and shows accessible from a computer. You could do a search for a movie, but most of the time you draw \"not found\".There should be more access to what Amazon Prime has available, and if it is available it should be better accessible from the Fire TV menus.All in all I would still buy it again over some of the other devices.", "verified": true, "helpfulness": "1/1", "author": "T. Coffia"}, {"rating": 5.0, "review": "I just love it so so so much.", "verified": true, "helpfulness": "1/1", "author": "Shanan Stephens"}, {"rating": 3.0, "review": "There wasn't as many free shows as there were things to buy.", "verified": true, "helpfulness": "0/1", "author": "Jamie"}, {"rating": 4.0, "review": "5 stars if it had vudu also... But other than that almost as good as the roku", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]