[{"rating": 5.0, "review": "so quick and easy to connect!  we set up in minutes!  we love how many choices there are for movies, tv, games, our videos/pics!  we are so pleased with this purchase!  the picture quality is awesome...the voice control is cool.  we love that our tv becomes karoke when we play our music.  we love the mirroring with the kindle!  and we were told by tech reps that this can be quickly unplugged and then taken on vacation with us!  this means that as long as we have wireless, we can watch all these things while away from home.  the remote is easy to figure out.  this is so much better than apple tv!!", "verified": true, "helpfulness": "0/0", "author": "chinhappy"}, {"rating": 5.0, "review": "Best thing I ever bought. The picture quality and sound is great. I would recommend this to anyone who enjoys watching movies.", "verified": true, "helpfulness": "0/0", "author": "Joyce Lewis \"Tole Painter\""}, {"rating": 5.0, "review": "Nice device. Wife has problem with free intro offer. Keeps asking for payment, Can't figure why.", "verified": true, "helpfulness": "0/0", "author": "Wee Willie \"Willie J.\""}, {"rating": 5.0, "review": "We've used a few devices for streaming services and our media library and this is the best device we've used yet.We have a WD TV live (older model) and that was small and convenient but didn't have the processing power so it lagged, the menus weren't as robust and Hulu Plus froze frequently. Not to mention the Hulu Plus interface was sparse and didn't give the same options to access our favorites for some reason.We mainly used, and loved, our PS3 but it died, and not from overuse as a gaming system-besides Guitar Hero it was basically a glorified Blu Ray player. It wasn't an easily transportable system but the processing power was there so there was minor lag, if any. Displays were robust. It used a lot of power and got loud and hot when on too long- which was more often than I care to admit with small children at home. We purchased a used one cheap, it lasted about a year and when it went we turned to other options.We have a Samsung Blu Ray player with Smart Hub- again, nothing recent. Not portable, no processing power, displays were terrible, lag was horrible and it froze on us a few times. Went back to the WD TV Live- started to consider purchasing another used PS3. Then I was on Amazon and saw the Fire TV, read the reviews and we decided to give it a try. We are so glad we did.My husband and I are picky on different levels. We are both loving this device. Fast, small and portable (we once took our WD on a vacation at a rented house). The menus on the streaming services are beautiful, all options there. The picture we swear is clearer, there's NO lag, nothing freezes, we are trying out Prime and love their selection of kids shows and best of all- with a busy house life- the screen saver is a SCREEN SAVER!! We often have to pause or we just don't select a show right away and we've had menus burn in the screen temporarily. We are still exploring the options for the media server. There is an app called Plex that's $5. We haven't purchased it yet. Might just use the Blu Ray player for now. We will be recommending this device to everyone! Already started.", "verified": true, "helpfulness": "0/0", "author": "Laura K."}, {"rating": 5.0, "review": "I love it. it's really good product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I'm on my second Fire TV as the first one was not responding after a brief period of working properly.  The second one I now have is working, but requires some patience as it normally takes several tries to arrive at the program I want to watch.  Once I have the unit pointed to the correct program it works as advertised.  Amazon's response to my problems with the first unit was excellent and I had the new one the next day.", "verified": true, "helpfulness": "0/0", "author": "Paul Fitzpatrivk"}, {"rating": 5.0, "review": "Very easy setup and works great, though I'd mention the need to cache on initial startup.", "verified": true, "helpfulness": "0/0", "author": "J. Oquendo"}, {"rating": 2.0, "review": "Liked the Roku's much better then Amazon seems like this is all about purchases. Harder to navigate then Roku.", "verified": true, "helpfulness": "0/1", "author": "Karen Lee"}, {"rating": 4.0, "review": "I have a wonderful Sony Wega digital ready TV that does not have HDMI ports. I was determined to connect the fire TV to this set even though I was told it was impossible.  I first tried an HDMI to component converter and could see a poor quality picture but no sound despite a lot of fiddling. Next I tried an HDMI to composite converter, and it worked for a few hours and then stopped working. Mysterious, but the converter must have failed.  I set out to the local RadioShack and found a good helper that didn't say it was impossible.  I ended up with a bag of possibilities, and 10 minutes later, it was working beautifully!  I simply use a HDMI to DVI cable to connect the video, and an optical audio to component audio converter for sound. The picture and sound work beautifully now.I really like the free time for my kids- great selection of videos, and my 4 year old is obsessed with some of the games. Overall, I am happy.  I just wish Amazon would post more options for connecting Fire TV to a TV without HDMI", "verified": true, "helpfulness": "1/1", "author": "Rainy Page"}, {"rating": 4.0, "review": "Does a great job with Amazon video content, and the voice search is impressive. No music streaming yet, but hopefully that's on the way.I can get to my Prime Video watch list, and the shows play instantly when selected.  These were the two main things the Amazon app on my tv was missing.When a guest sees voice search for the first time, they're usually blown away.  There's a lot more to the commands than just actor or movie names.  Somthing I just learned, say Prime Eligible before the search term, and you'll only search the Prime collection.I can also mirror everything on my fire hdx to my tv, picture, music..", "verified": true, "helpfulness": "0/1", "author": "E. Munzer \"EliM\""}]