[{"rating": 4.0, "review": "Please add a Chrome web browser!", "verified": true, "helpfulness": "1/2", "author": "Jonathan O."}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Justin Van Buren"}, {"rating": 5.0, "review": "Love this! So much better than cable and on demand", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "so far so good, hoping to do away with Cox", "verified": true, "helpfulness": "0/0", "author": "Karen Snider"}, {"rating": 3.0, "review": "Works OK, but it's quite lame that no analog capability is included, for those of us who don't want to buy all new audio equipment. Worse, that fact is not spelled out in the product info, so only after all is set up does this become apparent. Had to pay for a digital to analog converter to be able to use my perfectly good sound system. Otherwise, the tv is adequate, especially if you like the Prime offerings. We got it with the Sling tv bundle, so there is an additional smattering of watchable fare through them, but frequent buffering is a problem with Sling. All things considered, 3 stars seems fair.", "verified": true, "helpfulness": "1/1", "author": "Will"}, {"rating": 1.0, "review": "So much potential but ended up disappointing.It currently doesn't play hulu at all, even after doing all the troubleshooting... which should not be necessary. It stutters uncontrollably, to the point of unwatchable. I wish I'd spent another $100 and gotten a full computer instead.I purchased the amazon fire because I wanted a little box that could do it all. I have a PS3, Chromecast and laptops all used to stream. The Chromecast is largely my favorite, but it too has has had some issues with hulu, though less severe.  Amazon refuses to support chromecast which is almost certainly a business decision.DO NOT BUY!I think at this point I'd wait for one of the $99 Chrome things. When streaming you almost also get a better selection through a 'computer' then a streaming device.", "verified": true, "helpfulness": "4/6", "author": "John D."}, {"rating": 5.0, "review": "Absolutely the best little streaming computer.  Kodi works snappy. Could not be happier....especially with the latest software update. Unbeatable value.", "verified": true, "helpfulness": "0/0", "author": "Aleksey Zimin"}, {"rating": 5.0, "review": "I have used both new and refurbished Fire TV and they both work Great.", "verified": true, "helpfulness": "0/0", "author": "Gary B."}, {"rating": 5.0, "review": "Unit works as advertised but needs at least 100Mb throughput", "verified": true, "helpfulness": "0/0", "author": "Flash"}, {"rating": 5.0, "review": "Works great on my Samsung TV.", "verified": true, "helpfulness": "0/0", "author": "Susan S."}]