[{"rating": 4.0, "review": "Works well most of the time, but when running for longer periods, service does falter slightly (just takes a reset). Additionally, most apps (Netflix, HBOGO, Hulu, etc) haven't quite figured out autoplay just yet, so when operating from a smartphone, you have to manually start each show. Otherwise, great product.", "verified": true, "helpfulness": "0/0", "author": "Dan"}, {"rating": 5.0, "review": "trying to find out what you can do with it. one example is playing netflix from Ipad on my full HD tv. works great.", "verified": true, "helpfulness": "0/0", "author": "Et"}, {"rating": 3.0, "review": "The chromecast did what it said it would do but there are others better.  I also brought the Roku steaming media player as well and it was much more user friendly and easier to use.  The chromecast was good but the Roku is better.", "verified": true, "helpfulness": "0/0", "author": "Brian Bilal"}, {"rating": 2.0, "review": "Does NOT work with Google Nexus, both made by google, what's wrong with this picture. You would think that 2 products made by the same company would work together. This is useless.", "verified": true, "helpfulness": "0/0", "author": "Andy"}, {"rating": 5.0, "review": "Awesome! Solved all my problems of video streaming to my TV's. Now I can use my phones, pads or computers to send video or music streams to my TVs.", "verified": true, "helpfulness": "0/0", "author": "Israel Aguayo"}, {"rating": 1.0, "review": "tryed setting up stream from my dvd player which is built into my computer their  is no setting for dvd player any advice", "verified": true, "helpfulness": "0/0", "author": "william pope"}, {"rating": 5.0, "review": "Easy to instal, easy to operate, I don't need to buy a new TV anymore, cause my old TV became Smart :)", "verified": true, "helpfulness": "0/0", "author": "Antonio I. M. Andrade"}, {"rating": 1.0, "review": "I bought this primarily to watch Netflix on my TV at home but, unfortunately, it doesn't work for my Metflix. Everything else works for. But Netflix just pops up with an error message each time. Glad it was cheap so I'm not out a ton. I think I'll be trying the Roku instead", "verified": true, "helpfulness": "0/0", "author": "Picky"}, {"rating": 3.0, "review": "Needs more app to work with and more things to watch other then that it works really really pretty great.", "verified": true, "helpfulness": "0/0", "author": "Herman Moore"}, {"rating": 5.0, "review": "Very easy to use. It was very quick to setup. I use it mostly for Netflix and Hulu plus. No complaints.", "verified": true, "helpfulness": "0/0", "author": "sitruc159"}]