[{"rating": 3.0, "review": "its o.k. if you are a movie watcher/not for me.", "verified": true, "helpfulness": "0/1", "author": "joe hudson"}, {"rating": 5.0, "review": "It does everything they say it does !!  its VERY EASY to hook up,,,its VERY FAST,, no delay when you pick a movie or show or game ,, goes right to it,,, everything starts FAST,,, no lag time,,,no buffering!!  the voice search works GREAT !!! just like Gary Busey says,,, and we know that HE knows his stuff !!!they have a VERY good list of movies, shows, games,,,,prime is only $99 a year plus second day shipping on Amazon orders !!!I bought this to see if I can just get the Basic cable from Comcast and then just use this to watch our favorite shows or movies,,, so far so good !!  will probably be buying one for each tv and save big $$$ on cable bills !!!", "verified": false, "helpfulness": "0/0", "author": "carl kurek"}, {"rating": 5.0, "review": "Love it and can't believe the quality of the video streaming content on Prime. Hardware is well designed and super fast! Have an Apple TV also on another tv and have to say Apple TV looks tired and old in comparison.", "verified": true, "helpfulness": "0/0", "author": "Daniel S Johnson"}, {"rating": 3.0, "review": "It's nice... but doesn't turn off. Since I bought this, the price has been cut in half because its really nothing special.I would not recommend it because there are many more products out there that have better functionality and are more user friendly.", "verified": true, "helpfulness": "1/2", "author": "Lee Hines"}, {"rating": 4.0, "review": "***Update:I talked to an Amazon rep today and was told that the streaming version is HD and the HD purchase was what was coming up with the additional charge.  That isn't my recollection of my limited experience with my attempt to stream, but I will watch this carefully.For now, I will increase the rating.  The device works well, if not for my Wi-Fi connection rotating the IP assignments too often (same issue on the computers in the house).  I will update if any of the \"Prime\" items seems to come with an additional charge for streaming HD.----------------------Original review:I have had Prime membership from the beginning.  I bought so much from Amazon and the 2-day shipping that was included with everything was great.The issue now?  The price has gone up, but I thought that streaming HD would be worth it.Almost everything available in HD COSTS EXTRA!  I feel ripped off.  I can stream SD TV and movies, using my Prime membership, but if I want HD?  $4.99 or more for EACH ONE!I have asked Amazon about this twice and have gotten a reply from them instructing me how to reset my device so that it would connect to the internet and another reply telling me how to click the \"select\" button on my remote!The web page for the Fire TV with Prime says you get HD with Prime.  Not so.", "verified": true, "helpfulness": "1/1", "author": "Ronald Holland \"HollandLaw\""}, {"rating": 5.0, "review": "works good", "verified": true, "helpfulness": "1/2", "author": "Cole Bundy"}, {"rating": 1.0, "review": "Doesn't work half the time .. waste of money", "verified": true, "helpfulness": "1/5", "author": "Diana"}, {"rating": 5.0, "review": "Between the RF remote, the iPhone remote and the speed of this device it just can't be beat!  I also have Apple TV and aside from being able to display my iPad on the TV this is a much superior product, especially because of the speed.  The only con I would say is the audio part of the remote will bring you to an Amazon movie even though that same movie might be on Netflix.  It can't distinguish between the two so it picks the Amazon \"pay per view\" movie.", "verified": true, "helpfulness": "1/1", "author": "Marc"}, {"rating": 1.0, "review": "Sending this unit back. Freezes frequently (and usually recovers). Sometimes stutters for several seconds (10+) without any indication it is working on anything. Sure, you could blame me for buying a refurbished unit but I personally think that's a solid indicator of how good a product is. This clearly was either damaged with overheating or something else and was not properly tested. Not a good sign. I'm moving over to the Android TV which, though it has less-impressive specs than the Fire TV, has a cleaner interface and much better app selection as well as good status indicators!I purchased this because of our investment in FreeTime with our many Kindles (HD 7, HDX, Paperwhite, etc.). However, there is absolutely no control available inside of the apps we use for local media -- since the Fire TV doesn't handle any local media -- and the selection available inside of FreeTime is paramount to useless for our older kids and only those apps already available inside of FreeTime are available on FireTV. There is no integration with Netflix for parent controls other than what is already available as well. We had hoped to be able to use FreeTime to restrict overall TV time but unfortunately the time controls are SHARED with their tablets. As of last week at least, I could not assign some time to the TV and some time to the tablet.", "verified": true, "helpfulness": "2/4", "author": "Traek \"traek\""}, {"rating": 4.0, "review": "I was sick of watching Netflix and Hulu on my little tablet.  I am enjoying new and old movies and shows on my big flat screen.  So I am very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Kimberly Johnson"}]