[{"rating": 5.0, "review": "Performs as advertised.", "verified": true, "helpfulness": "0/0", "author": "victor"}, {"rating": 5.0, "review": "Love it. Now I can watch movies and shows on my \"not smart\" tv. The voice search is wonderful! 2 months now and use it a lot. Zero issues!", "verified": true, "helpfulness": "0/0", "author": "DeeAnn W."}, {"rating": 5.0, "review": "I spent several weeks looking at what was available to make my dumb TV smart.  I choose Fire TV and it meet and exceeded my expectations. Easy to setup. East to use. Fast. bountiful selection of apps and games. What else could you ask for?", "verified": true, "helpfulness": "0/0", "author": "DaveG \"withtao\""}, {"rating": 5.0, "review": "i love it!", "verified": true, "helpfulness": "0/0", "author": "Eva A Goolsby"}, {"rating": 5.0, "review": "Easy to install.  Easy to use.  The only difficulties were waiting for it to arrive and putting the batteries in the remote.  Otherwise, it's great!", "verified": true, "helpfulness": "0/0", "author": "Marie A. Fritzinger \"Art's Mom loves BOT\""}, {"rating": 4.0, "review": "I, for some reason, I an Apple TV, Roku, Chrome Cast, and now this. As a whole, this is my favorite streaming device. The remote is more comparable to that of the Roku, but it feels like it is better quality. It also looks the best in my opinion. However, there are some downsides that are small, but should be addressed nonetheless.The first downside being how easy it is to accidentally purchase shows and movies through amazon prime. They make it pretty hard to see what you own and don't own, and those things that you don't can be purchased without verification. I had some friends over and they thought I owned a handful of shows that I did not and purchased them without being asked if you do or do not want to buy them!Second is the speed. Im not a computer wiz or even know what most of the technical internals are/do. But, what I do know is that they claim that this is twice as fast as the Apple TV, and its not, its about the same. Now I don't care because they are both pretty quick, but if you make a claim to be faster, I think it should be at least noticeable.As a whole, I would probably choose this over any other streaming device. The only reason why I would choose it over the Apple TV is the remote and that is it.", "verified": true, "helpfulness": "0/0", "author": "spencer"}, {"rating": 4.0, "review": "Great device @ a great price!", "verified": true, "helpfulness": "0/0", "author": "Luigi Frantellizzi"}, {"rating": 5.0, "review": "What a great product.  Seamless viewing and remote control, great variety of programs and content.  Just overall very pleased.", "verified": true, "helpfulness": "0/0", "author": "TEZ"}, {"rating": 4.0, "review": "Much faster than Apple TV, exceeded my expectation and air play is a plus for those who have IOS devises.The 5.1 stero is a plus when watch Hi-Fi movies or tv shows.", "verified": true, "helpfulness": "0/0", "author": "jonathan pan"}, {"rating": 4.0, "review": "Pretty cool, but a bunch of TV apps like HBOgo are pretty worthless because I can't link my Comcast / Xfinity account like u can link other cable providers. But being able to quickly switch between Prime, Netflix and Hulu using a remote instead of a mouse is worth 4 stars", "verified": true, "helpfulness": "1/1", "author": "JR McConnell"}]