[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Fred Schneider"}, {"rating": 5.0, "review": "So far so good. Crystal clear and lots of options to choose from. I like that it has many news channels.", "verified": true, "helpfulness": "0/0", "author": "dailyhappydeals"}, {"rating": 1.0, "review": "Since I have owned this I have not been able to connect to Netflix.  Makes me suspect that Amazon is blocking Netflix on purpose.  I have spent some five hours talking to many tec support people and even went so far as to buy a new router and Amazon still can not resolve the problem.  I would love to return it, but I threw away the packing box.  I'm really quite upset.  I would never recommend this unit.", "verified": true, "helpfulness": "3/10", "author": "SANDRA HUTCHINSON"}, {"rating": 1.0, "review": "Netflix does not work. I get error 13 every amazon prime selection. Help desk says unplug it.", "verified": true, "helpfulness": "2/4", "author": "mark a jones"}, {"rating": 3.0, "review": "We loved it, but  after only 3 months it wouldn't work and was extremely hot.  Tried unplugging and replugging it after it cooled off, but to no avail.  The return window expired about six weeks ago of course.  Havent went thru the warranty process yet, but will try that.", "verified": true, "helpfulness": "0/2", "author": "Terri \"terri67\""}, {"rating": 3.0, "review": "Screen layout is a mess", "verified": true, "helpfulness": "0/3", "author": "W. Doubletree \"Curacao maven\""}, {"rating": 4.0, "review": "This could be the best box for the function.The speech to text captions are not very accurate.", "verified": true, "helpfulness": "0/1", "author": "Philip"}, {"rating": 4.0, "review": "I had Apple TV already on this TV, but wanted Amazon a little easier than hooking up my Kindle HD.  I really like the fire.  It's much easier to use and including Pandora which my wife likes.  Be aware though that even though you have something like Showtime Go, if you were to ask for Dexter, it will take you to Amazon's TV library and you may wind up paying for it when it's free on Showtime.  I got hit with that a couple of times and finally stopped using voice (which works exceptionally well) and get anything not in Prime by clicking through to it.  Overall though, a well thought out addition to the Kindle family of products.", "verified": true, "helpfulness": "0/0", "author": "The Dude"}, {"rating": 4.0, "review": "A fast, small media box that connects seamlessly compared to the painfully slow Blue ray/media player and glitchy Roku3. The tutorial was a bit on the elementary side but did narrate some of the key functions very well for first time box users. The best remote control design so far. The clean and simple design cues are in line with Apple. WiFi - Fire TV is the only media box to not need an Ethernet hardline. It was a close decision compared to Apple TV but, Amazon fire has more freedom of choice at a better price. You can't get Amazon or Pandora on Apple TV. Apple TV uses it's dedicated store that is overpriced and personally, I don't feel like helping them fund the billions shelled out for Beats.  The speech mode is another big selling point for Fire TV. It just works. Hold the button down, speak your search request and release the button. Just like the ad states \"no more hunting a keyboard to spell out a word\". The resolution is 1080p and compares to high definition optic players (Blue-ray). I predict Blue ray disks will be showing up in garage sales next to VHS tapes very soon. I am glad I didn't purchase a smart TV. The technology is improving so fast.One final and very important note,Gaming systems work very well as media players but use an insane amount of energy (72Kw for Xbox1 and 89Kw for PS4 compared to 2Kw for FireTV energy used per average movie). The amount saved on the electric bill will more than pay for your Fire TV. Not too mention the wear and tear on your five hundred dollar gaming console.", "verified": true, "helpfulness": "2/2", "author": "Regnad Kcin \"Nick\""}, {"rating": 5.0, "review": "This is an awesome device. The voice command search is probably the best feature. And it's especially great if you're a Prime Member - all of that access to shows, movies and more!", "verified": true, "helpfulness": "0/0", "author": "Emily Ann Hogan"}]