[{"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "diego ospina"}, {"rating": 4.0, "review": "Had it for 3 months now.  You can't beat the price.  At first I loved it, but whole \"cell phone as remote\" thing is not ideal.  Pausing my show to answer an incoming phone call is a pain.  I think I would buy a Roku stick or a Fire TV stick for a few $ more, so I could have a remote control.", "verified": true, "helpfulness": "0/0", "author": "diffenbaucher"}, {"rating": 4.0, "review": "Got it for my daughters tv, it's ok for her. I would not of wanted it for myself. This device would have been better If they had a option to use a remote with it; I don't like having to down load everything on my smart phone to see it on google chromecast. I actually prefer Apple TV😊", "verified": true, "helpfulness": "0/0", "author": "Candy Watson"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "mary ann griffin"}, {"rating": 3.0, "review": "The google chrome cast is just okay.  The interface for use is a bit cumbersome and I suspect there will be a new version with a remote released at some point now that the amazon firestick has a remote.  To use this device, you need to open the netflix (or other video app) on your phone and find the content you want and then \"fling\" it to the chromecast.  Pausing and fast forwarding etc., will all be done from the phone or tablet device you originated the content from.With that limitation in mind, it works as advertised and rather well.  My father had a problem with netflix constantly buffering on an older smart blu-ray player.  He was going to buy a new blu ray player for watching netflix on his big screen but instead I bought him this and his buffering issues went away.Setup is incredibly simple and you will be up and running in no time.", "verified": true, "helpfulness": "0/0", "author": "Matthew R. Potts \"mrpotts\""}, {"rating": 4.0, "review": "Easy set up and works great.  However first use for a full movie the device stopped working half way through.  Not sure if there is a network issue, or if the device has a hard time handling an extended period of use.  The computer now no longer detects the device at all and will have to research how to fix this.", "verified": true, "helpfulness": "0/0", "author": "b.wash"}, {"rating": 5.0, "review": "Although I didn't purchased the Chromecast through Amazon, I wanted to let fellow buyers what this thing can do and it's AWESOME!First off, the set up is way too easy. I was done setting up in a couple of minutes using my Galaxy Note 4. Not only is this for streaming but it serves as a screen mirror for your mobile device as well! Besides casting YouTube or Google Play videos, you could literally see EVERYTHING that's in your phone on the big screen.For example if I am on the Home screen of my Note 4 where it shows the time, apps and all that , it shows up on the tv. You can open ANY app on the phone and it shows on tv at the same time. So any photos or videos you have taken from your phone, you could see them on the big screen. Even music saved on your device. And all this for the price of $30-$35? Not bad!Take note that both the chromecast and your device have to be connected to the same wifi network. (And ofcourse have decent connection/speeds)The only kind of downside (but not deal-breaker) to this chromecast is that besides being connected via HDMI, to use it, it has to be permanently connected via mini USB port, which is just more cables dangling behind or side of your tv. (If google makes a 2nd version, hopefully it will have HDMI power support as well.)All in all is a great little device that I could recommend to anyone! It's a must buy!", "verified": false, "helpfulness": "0/0", "author": "LANZR92"}, {"rating": 5.0, "review": "Great device. Easy to connect and use.If you want to cast your phone or even your chrome tabs on your PC this product will get the job done.", "verified": true, "helpfulness": "0/0", "author": "Yoav Gottlieb"}, {"rating": 4.0, "review": "Love the chromecast! Definitely more integrated with Android phones, just like Apple TV is the best media streaming option for iPhone users. For example on iOS Spotify streaming to chromecast is currently not available, but on Android, this is done via a third-party app. In my opinon, an Apple TV or Roku is a better all-in-one TV streaming solution, but for $35 the chromecast is a perfect addition to enable TV/movie/netflix streaming in any other room in the house.", "verified": true, "helpfulness": "0/0", "author": "Shane\u0099 :)"}, {"rating": 1.0, "review": "I purchased it to try to stream Italian chennels (rai 1) to my tv for my parents while in the country. It didn't work. I got it on the network. I found out I can't install the rai tv app from Google play on iPad. I thought it was part of Google tv not Google play but I thought wrong.I tried casting directly from the website in chrome. First I found out you also can't cast from chome on iPad. Then I tried installing chrome on a XP machine and found out XP is not compatible either. Finally, I tried streaming from a chrome tab on windows 8.1. The feed starts the stops almost instantly with the picture frozen on one image. I tried the development version of the app and it doesn't fix anything. After googling the issue in 8.1 may have to do with compatibility with my amd / ati hardware. I am on a A10-7850k apu. There are no work arounds.That's all the devices I have.What does work is casting YouTube to it from chrome in windows 8.1 . However I already have a 2 year old set top device that I can watch YouTube on my tv with. This feature isn't useful.Maybe it works well on android devices but I'm not going to buy one to find out. I spent too much time on this already. I'm going to return it tomorrow.", "verified": false, "helpfulness": "0/1", "author": "Sara P"}]