[{"rating": 5.0, "review": "The Chromecast is exactly what we needed; an affordable way to easily access internet apps and, most importantly, google music and videos!  You can read the description for the details but I will at least say this much; it works great and streams very quickly.  The price can't be beat for $35 either.  Google is a smart company and knows what they're doing and they totally reinvented the wheel with this one.  It's no longer important to have expensive access to internet apps and Google is bringing it to us at (finally) an affordable price.It's as small as it looks and so easily hides behind your TV in one of your HDMI ports.  There is a light that I can see from the side when all the living room lights are turned off, even when the TV is turned off because (as of 2013) it does require a power source which can be as easy as a micro usb cable to the USB port on your TV or to a plug-in into the wall.Great purchase and I can't wait to see where this small step leads the industry!", "verified": true, "helpfulness": "1/2", "author": "Yoshi Ex \"C Ex\""}, {"rating": 5.0, "review": "Folks are looking for more apps which will come . Besides Neflix there is YouTube , Chrome and Google Play which is significant if you like Google products.  The HDMI extender is quite important if your WiFi setup is marginal .  By adding it  my setup went from 1 to 3 bars.  My router is on the floor above.The setup was straight forward and for $ 35 there is nothing in its class.  I was fortunate to get the free 3 month offer from Netflix also.  Chromecast's  multi platform capability is impressive and the future looks bright .", "verified": true, "helpfulness": "0/0", "author": "Robert  J   Costello"}, {"rating": 4.0, "review": "3.5 stars for the price, form factor, ease of setup and works well with Netflix, Youtube and GooglePlay. Deduct some points for setup issue, can't play local contents (not Airplay-like) and lack of WOW factor. The product name, Chromecast, makes me think casting from Chrome browser is the key feature. It's not! TabCast on Chrome browser, is still in Beta and it doesn't support Android/iOS mobile device. As of now, it's really just a media streamer that allows Android/iOS/Windows mobile deviceto select, play and control online contents from the 3 online video services mentioned above. This product is comparable to a Roku Streaming HDMI stick or Plair (home.plair.com), but definitely not in the category of wireless display (Miracast/WiDi) or DLNA/AirPlay media adapter.Below is my full hands on experience review against various devices, with different test cases and even at 2nd location.The RequirementsFor setup - I suggest to use a laptop, phone, or tablet and have it connected to your Wi-Fi router.  You should have the Wi-Fi PIN in handy. Depends on what you want to stream, you'll need to have either YouTube or Netflix app (and an account). Google Play is readily available on Android devices.Out-of-box SetupEven though the instruction printed on the packaging is very clear, the initial setup experience did not go smooth as I had expected. Connecting the HDMI dongle to the TV and USB cable for power was a piece of cake even my grandma can do. Once you've done that, the TV displays \"Set me up\" and instructs \"On your laptop or phone, visit: google.com/chromecast/setup\" with the setup name \"ChromecastXXXX\". However, it's setting the Wi-Fi connection that I encountered troubles and I think it could happen to other folks.- I tried first with an Android phone, Nexus 4, the browser URL pointed to Google Play store to download and launch Chromecast app. It took a few tries for the app to detect and display my Chromecast, and then I was able to tell Chromecast to connect to my Wi-Fi router by providing it the PIN. Once I provided the wireless router's PIN, Chromecast then connects to the router and displays it's \"Ready to Cast\".- On an iPad/iPhone, there is no Chromecast app available so the URL directs me to Google's online setup webpage. It's basically telling user to manually connect the phone Wi-Fi to the Chromecast device with SSID \"ChromecastXXXX\" and then configure its Wi-Fi setting to pair with the wireless router. It's good to have the Wi-Fi router's PIN in handy as you'll be asked to enter that information. Once that's configured, it connects to the Wi-Fi router and displays \"Ready to Cast\"- On my laptop (Win8), Google setup site recommends to use the Chromecast utility to help with the setup. The utility works like a charm! It's almost like a wizard that could automatically extract the PIN from your existing Wi-Fi connection, connect to the Chromecast device, pushes the PIN to it and connects to the Wi-Fi router.The app is well designed and provides the best connection experience IMO.Note: If the system is connected to your Wi-Fi router via Cat-5 cable and your Wireless is turned off, then it will not be able to detect Chromecast.  Turn on the Wi-Fi and the app will be able to detect and connect to Chromecast.Streaming ExperienceOnce the TV displays \"Ready to Cast\" screen, I was able to play online videos by touching the screen. Chromecast just figures out what video I want to play and then it pulls the content directly from the online content service's server. After a short ~5 seconds delay from the time I click play, the TV displays a buffering status and then plays the video without any hiccup. The video quality is probably 1080p or at least 720p - I'm not sure but it looked very clear. Once the movie is playing, I could make or receive phone call and do anything on the phone without affecting the video stream on TV.- Using Netflix app: The app works very well on both Nexus 4 and iPhone 5, but I've been seeing 'black screen of death' with Nexus 4 (Android 4.3) lately whenever I use Netflix [huge bug according to Android forums]. Netflix app displays the option for you to \"Play on\" ChromecastXXXX and will tell Chromecast to fetch the content from Netflix to display. I could rewind, forward and pause the video from the app, but I can't find a way to permanently stop the video. The volume can be controlledfrom the app or from the volume button on the mobile device.  Netflix also allows you to toggle where you want the video play between the mobile device or TV, which is good because I start in one room and continue on another device from another room later. If there's another Chromecast TV in the house, I think it might be able to shift the video over there and continue where it left off. Since Netflix is the creator of the \"DIAL\" technology used in Chromecast so it's no surprise their app works so well.- Youtube and GooglePlay: Similar streaming experience as Netflix, with the little cast-to-screen icon available on the app to Play On TV. I didn't use these apps as much so I don't know if there's any particular goods and bad.TabCast ExperienceI find this feature is OK, but not great as there are issues pending on the Wi-Fi environment and some websites. Noted the product description says support for \"select web content through Chrome browser\".  This feature is still in Beta as labeled on the plug-in, but not mentioned on the product webpage or Amazon's description. To use the feature, I need to download and install plug-in \"GoogleCast\".  Not to be confused with ChromeCast plug-in as it's taken by some 3rd party developer.  Once the plug-in is installed to Chrome browser, there's a Cast-to-TV icon showing on the right of the URL address bar. Click on icon allows me the option to \"Cast this tab to...\" and Chromecast device of my choice.  The max video quality supported is 720p coming from the browser tab and the computer needs to be at least an Core i5 CPU. I notice my laptop CPU is put to work when I stream from site like ABC/HULU/Vimeo as TabCast clones my browser page and mirrors to the TV.  The experience is odd as I can see what I browsed on the TV, but there's no mouse cursor.  There was noticeable latency as each click takes about 1-2 seconds for TV to update the images.  Nevertheless, both video and audio play on the TV via TabCast.With Netflix and YouTube websites, there's a Cast-to option built-in to the player and the video gets retrieved directly from the device so the system is not put to work.  The supported video quality here is better since it's pulling directly from the service sites and does not go through many network hops.There are certain times I notice a much bigger latency and my video disconnects in the middle of of playing while using TabCast.  This seems to be a Wi-Fi congestion problem or CPU overloads that the data has hard time traveling from laptop-to-router-to-Chromecast.  It is similar to the AppleTV Airplay (mirroring) feature and it also has some mixed reviews due to the many network hops issue.Also TabCast plug-in is only available for Chrome browser on Windows/MAC system. The Chrome app on iOS does not allow you to TabCast since there's no plugin.  So the answer is No to the question \"Can I cast a tab from phone or tablet's Chrome browser?\"2nd Location / PortabilityIt's such a small gadget (key fob size) that I was able to put in my pocket and took it to my friend's house.  I forgot to bring the USB micro cable, but good thing my friend had a USB micro cable available.  I'm not sure if Chromecast can be powered with an MHL-enabled HDMI port, but didn't matter since my friend's HDTV doesn't have MHL anyway.  Google doesn't mention about MHL support probably because the # of TVs with MHL is pretty low and most consumers don't even know about it.  The device powered on and looked for the previous wi-fi router connection, so I had to repeat the setup and provide the new wi-fi router's information.  Once it's connected and online, I was able to repeat the stream like I did at home.  I guess people can bring it on the road to hotels, but keep in mind the newer LCD/LED TVs at hotels don't allow people to change the HDMI input.  Also remember to bring the USB cable, power prong and get the Wi-Fi code for it to connect.Would I Recommend?Yes, if you don't have Netflix or Youtube on your TV or Blu-ray player already.No, if you're looking for a media player to stream local files from mobile devices or NAS on the network. Or looking to mirror anything from phone, tablet or laptop's screen to the TVPros and ConsPros- Setup app on PC is excellent and props for auto-grab of the existing Wi-Fi PIN feature.  Who remembers their Wi-Fi router PIN??- On screen user friendly GUI- The superb experience of browsing media on mobile device and hand off to Chromecast to play- You can do other things on your mobile device while the video plays on TV, thus save battery- Can stream from Netflix, YouTube and GooglePlay real well- Control Chromecast with Netflix app trick mode is excellent, almost like a remote control- The small compact sized form factor and USB power allows it to shut down when the TV is turned off- The packaging, accessories and instructions- The price! $35!? take my money Google even though I already have Netflix and YouTube built-in to my TVs and BD PlayerCons- Setup isn't smooth with mobile devices- Can't permanently stop video on Netflix, thus may result to \"over the allowed players limit\" message on Netflix if you want to watch on a different device- While using TabCast, someone can hijack the TV by sending video from Netflix/YouTube app or vice-versa (can be done from another room)- TabCast is strictly for Windows/MAC Chrome browser with plug-in.  Cannot cast a tab from phone or tablet with Chrome app.- Chromecast can't handle 1080p while using TabCast ... even from a powerful system- No support for local contents playback (i.e. photos, music and recorded video on mobile devices).  I hear you can install additional plug-in, Plex, to PC and move the file to the TV via Chromecast- No DLNA DMP support, thus you can't push media contents from other places to Chromecast like you can with AppleTV (AirPlay)Tips- Use Chromecast Windows/Mac utility to find out the firmware version- Use the utility to Reset the device to Factory default setting - or press and hold the push button for 10 seconds- Chromecast Wi-Fi is on 2.4GHz band.  If your Wi-Fi router is dual-band, it should support 2 SSIDs (2.4 and 5GHz).  Chromecast will only see the 2.4GHz SSID- If your Wi-Fi router is a dual-band, ensure it's not in AP isolation mode- If your router has MAC whitelisting - your Wi-Fi network allows this device and your Chromecast to join- Ensure you are not connected to VPN", "verified": false, "helpfulness": "5/7", "author": "iGodzella"}, {"rating": 3.0, "review": "The product itself is nice, compact package, it sort of just works. It has a few quirks, probably a combination of older LCD TV (46\" Insignia 1080P 120Hz LCD) and networking/driver.Pros: Small package, works (does what it says), inexpensive. The provide the USB cable and wall plug.Cons:  There is a small delay when watching on a laptop while streaming to TV, no biggie but noticeable. *Requires* power. This is not bad by itself, but in my TV, plugging the USB into the TV caused my other HDMI to output no audio (I guess its a TV problem, rather than a device issue); however this caused me to have to use the provided USB power plug, which I try to avoid. Last, It failed to install from my desktop, but using a laptop worked fine (I opened a ticket with them). It sort of needs a WiFi adapter available. I can still see the device from my Chrome on Win 8.  I was surprised that the support is a bit lackluster. Even dev unlocking has been a bit challenging.Where does it fit? Well it's hard. I have an Xbox and a WD TV Live Plus box. I simply thought this would grant me wireless media streaming, but it requires some sort of mechanism to trigger it (Cast from Chrome, or from an Android device). The items I already own do this for me and more. I used it once or twice and that is it. It would be nice if I could navigate Netflix from within the device or stream from PC to this device (HTPC style). But that is not what was advertised and its not what it does.", "verified": true, "helpfulness": "1/5", "author": "E. Navarro"}, {"rating": 5.0, "review": "Google has done it again,excellent product.I received the Chromecast dongle about an hour ago,took a few minutes to set it up .I tested it with 3 HDTVS I own and streamed Netflix using my nexus 7 tablet.The technology is simply amazing,excellent streaming quality and nice that I can multitask on nexus 7 while still streaming Netflix. Opens up a whole new world of streaming capabilities.Glad I picked it up for 35.00.Highly recommend this product", "verified": true, "helpfulness": "4/6", "author": "C. Eley"}, {"rating": 5.0, "review": "Super simple and I know it will only get better!  I was able to set it up in about a minute and start streaming Netflix!", "verified": true, "helpfulness": "1/2", "author": "Chris"}, {"rating": 3.0, "review": "Easy setup.  Very good with Youtube from iphone and Netflix is just OK; Google Play features are not available on iphone yet.  The disappointment is with the web streaming video thru Chrome.  This is the main reason that I bought it, and, unless you have a computer with a very fast processor, the video is choppy at best.  It does not stream from a tablet or smartphone; only from a desktop or laptop.  Hope they fix this as this feature is in beta development, but not too happy.", "verified": true, "helpfulness": "2/4", "author": "S. Foster \"Rounder 355\""}, {"rating": 5.0, "review": "All I can say is I'm soooooooooooooooooooooo happy I got this the day after it came out for $35. Now the price has doubled! This thing is awesome. I stream Netflix right through my iPad so now I can watch movies in my bedroom.", "verified": true, "helpfulness": "2/4", "author": "Ang497"}, {"rating": 4.0, "review": "I was lucky enough to snag one of these a few minutes after it was announced. Amazon shipped it incredibly fast and setup was a breeze. Sure you need to power it but really it's not a huge deal. Its still smaller and much more compact than an Xbox. I will say that currently the support is lacking but that is only because the product was just released and people are still struggling to get their hands on it.In 6 months or so we will have dozens of apps that take advantage of the Chromecast and the possibilities will still be endless.For 35 dollars you really cannot go wrong. And if you were lucky enough to receive the netflix promotion then it's even cheaper.I wholeheartedly recommend this product almost solely based on price.Buy it, try it, and if you dont love it, put it away for a few months and come back when more apps support it.This is the start of something great.", "verified": true, "helpfulness": "4/5", "author": "Matthew Bossi"}, {"rating": 4.0, "review": "This is exactly the type of device I have tried to make out of hacked Apple TVs, a Raspberry Pi (running Xbmc), and a Sony Google TV (the older, blu-ray one).I love the Youtube feature on my GTV where I can control Youtube on the TV from my Youtube app. It makes Youtube watchable on TV since you can surf new videos and add them to the queue from your phone/tablet while watching them on your TV.Chromecast creates a similar experience for Netflix, although you can't queue up videos to watch.Usability right now (Aug 7, 2013), I would sum up as - It's a remote for Netflix, a Youtube play list manager, and google Play player.It has a lot of promise., and I can't wait for it to work from Plex and other apps.Chrome tab works, but if you view something like Plex videos in browser, it delays by at least a few seconds, and audio often is off just enough to be noticeable.There also doesn't appear to be any security on it, anyone on your local network/wifi can usurp control of your TV by selecting cast to it from their device. It would be nice if you could manage permissions by google account, source phone/tablet device, and destination chromecast device.It would also be nice if they just added casting to the Google TV.If you want a cheap Netflix player, or a Google Music on your TV setup, or a remote queue manager for Youtube, buy one now. If you're going to make Plex, or some other app work for it, there ought to be a developer hookup site, as I would gladly donate my second one to get faster Plex/other app support.", "verified": false, "helpfulness": "2/2", "author": "Jon Zobrist"}]