[{"rating": 5.0, "review": "I like this alot,i can now stream some of iPhone sports app to my HDTV,thanks", "verified": true, "helpfulness": "0/0", "author": "ricky thomas"}, {"rating": 5.0, "review": "Got 2 of these.", "verified": true, "helpfulness": "0/0", "author": "R. Long"}, {"rating": 4.0, "review": "A little difficult to setup.  While following the simple instructions precisely, my phone would disconnect from my WI-FI network, each time I would enter setup mode, while giving a message that Chromecast couldn't connect to the internet.  As soon as I would switch to my Wi-Fi settings, it would immediately re-connect to my network, but switching back to setup would disconnect it again.  Finally, I was able to get Chromecast attempt a connection to my Wi-Fi network in my phone's Wi-Fi settings, and after getting it connected, everything worked fine.  Not sure why I was having this problem, but I suspect it was either to vague instructions or maybe Chromecast was attempting to connect to the wrong network.After I got it setup, everything worked great.  It came with a HDMI extension cable, in case your HDMI port is snuggled away in the back of your TV, like mine, but oddly, the cable is only a few inches long and the instructions warn against using any other cable.  That still may be long for a better connection, but it seems like a longer cable would have been more beneficial.My only disappointment with how it works is that there is no slacker app.  I subscribe to Slacker and don't care for itune, Pandora or Iheartradio.  I'm sure that won't be the last disappointment, but I'm otherwise very happy with it.  I've had my PC connected to my TV for 20 years, but recently purchased my first store-bought machine and it doesn't have a video-out, so that was what prompted me to purchase Chromecast.  I also like that it's so small and portable, although I'm still scratching my head over the short HDMI extension cable.", "verified": true, "helpfulness": "2/2", "author": "rogun"}, {"rating": 5.0, "review": "The greatest part is I can screen my laptop screen on my big tv. con: not many apps available when you use your phone. though you're pretty much using your phone as a remote to stream netflix/youtube or show photos from your phone. Streams movies in HD and really enjoy the wireless capabilities. Still hoping more apps like Spotify jump on board. Still prefer it to the roku because like I said screen sharing.", "verified": true, "helpfulness": "0/0", "author": "Stef"}, {"rating": 4.0, "review": "i like the idea of watching everything on tv, but this is difficult to set up and almost impossible if you unplug it and then reestablish the setup because you have to uninstall various programs and reset your settings, extreme difficulty unless you are an engineer.  I watched many programs at first until i unplugged it for some reason.  Now I have not figured out the reset process.  Directions they give seem direct, until you try them, then no luck with resetting.", "verified": true, "helpfulness": "0/0", "author": "C. Mcn \"ENV ENG\""}, {"rating": 5.0, "review": "Seems to be a good device, I typically use it when studying.  I use my TV as a second monitor, works great!", "verified": true, "helpfulness": "0/0", "author": "AJ"}, {"rating": 3.0, "review": "Good for the price. I wish it had a remote like apple tv. Some apps, e.g, netflix hang for minutes at the beginning, and I have to power cycle once to make it work. I also wish it supported more apps on ios, such as sound cloud, etc.", "verified": true, "helpfulness": "0/0", "author": "SaeidB"}, {"rating": 1.0, "review": "Mostly disappointed in the performance; Choppy video. Finally, returned to Roku.", "verified": true, "helpfulness": "0/0", "author": "Mark Ludlow"}, {"rating": 2.0, "review": "Often fails to make proper connection. Have had to remove it and change ports to get it to work.", "verified": true, "helpfulness": "0/0", "author": "Stu Down"}, {"rating": 5.0, "review": "This thing is great. Pretty much can use your android or iOS device to cast/stream movies or shows to your TV. Hooks up to the TV via HDMI and to your network via WiFi.Simple to setup and use. Happy with it and would recommend over roku etc.", "verified": true, "helpfulness": "0/0", "author": "forrest73"}]