[{"rating": 5.0, "review": "Very fast shipping.  The device works very well. I use chromecast instead of cable. It's way cheaper than paying for cable.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Williams"}, {"rating": 1.0, "review": "The 2 main apps that use Chromecast right now are Netflix and Hulu Plus, which if you have a blu ray player, you probably don't need Chromecast.  If more apps get added to what Chromecast can do, it will be better.  Until then, it is not worth getting.", "verified": true, "helpfulness": "1/2", "author": "Tim Sprinkle"}, {"rating": 1.0, "review": "Advertises watch television from your computer, but all are things you must pay to receive.  Returned it and bought a cable that runs from my laptop to computer.  Now can watch my computer on my television and see lots of free things from Internet such as ESPN3, YouTube, etc.", "verified": true, "helpfulness": "0/3", "author": "Gary Hoormann"}, {"rating": 3.0, "review": "I tried it out on a Dell Latitude D630 in Ubuntu 13.10, Windows 7, and Android on my Droid Razr.  It plays well with Netflix and other apps that directly support it, but the Chrome browser tab cast feature does not work well at all.  For tab casting, audio never pipes through, and the videos are really choppy.", "verified": true, "helpfulness": "0/0", "author": "Chad A. Baker"}, {"rating": 1.0, "review": "netflix does not work. it worked for one week update and getting Netflix and red circle I do not recommend it", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It works great for what it is...I just wish I could play movies from my external harddrive through my computer to the tv... It is great for YouTube, Netflix, and Hulu.", "verified": true, "helpfulness": "0/0", "author": "Cynthia V. Lose"}, {"rating": 5.0, "review": "There are thousands of reviews so I am not going to be repetitive. This thing works great, right out the box. I am a heavy Google/Android user so this is right up my alley. I don't know how great the interface is with an iPhone, but I'm sure Google didn't leave you guys high and dry.The open developement kicked in a month or two ago, so many companies/individuals are hard at work making awesome apps for the Chromecast. Before long there will be a bunch more awesome ways to use the CC. There are more apps than what Google Play says their are, just need to browse on the web.PLEASE PLEASE Amazon/Google settle your differences and make Amazon Instant available to cast/view on mobile. Everyone else can but Google/Android devices as of now.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "This device easily plugs into an available HDMI port on your TV and is easily accessible by your networked devices to stream whatever you want. It is excellent!", "verified": true, "helpfulness": "0/0", "author": "Derven Mignott"}, {"rating": 5.0, "review": "Love it no visible cords. Not even a power cord. I have one for every tv I have. Now that it has HBO go I returned all my extra cable boxes. I only have cable box on the main tv but can still watch game of thrones in by bed room. Bedroom tv is wall mounted so I am very happy that you can power this off the usb port and not have to run another cable to the tv.", "verified": true, "helpfulness": "0/1", "author": "M. Levy"}, {"rating": 4.0, "review": "This little guy can transform your media viewing until more TV manufacturers build in more networking features that does not hike up the prices too much.", "verified": true, "helpfulness": "0/0", "author": "Fred Zahnow \"Fred the sailor.\""}]