[{"rating": 5.0, "review": "Expecting more apps in the future as Google is working on it. I hope this investment will not be a waste. Recommends to others", "verified": true, "helpfulness": "0/0", "author": "RJ \"RaRi\""}, {"rating": 5.0, "review": "Way more affordable and ideal for the smartphone/ tablet user. Ill probably get more for the other rooms in the house!", "verified": true, "helpfulness": "0/0", "author": "Miss Britt"}, {"rating": 3.0, "review": "It's only $28, so complaining is not an option.  It can only get better.  You can download software that lets you send your desktop and even movies from your computer to your TV.  Sound on streaming video is slightly off and there is a slightly noticeable stuttering to the video (my computer is fast) but it is watchable.  One issue to be aware of is that you need to be sure your TV set or cable is well shielded.  I currently have to power down the device when I want to watch TV.  The always-on wireless signal interferes with the cable signal.  Not so convenient, but I will be picking up some new cable that advertises better shielding to see if that helps.", "verified": true, "helpfulness": "0/0", "author": "Chuck"}, {"rating": 5.0, "review": "Provides a lot of great entertainment and it's worth every penny, I use it daily and it's awesome try it yourself", "verified": true, "helpfulness": "0/0", "author": "joser916"}, {"rating": 4.0, "review": "From a form factor standpoint...this is hands down the best media streamer with exactly zero footprint. That said, it does have some limitations, but if Google's history is any indicator...it will only improve.Some recommendations:-Amazon...seriously, support this device...you don't need to feud with Google...just let me get the content I pay you for through this little dongle...and you will replace my cable.-Screencasting, let me slave the Chromecast to my computer screen, either for home computing or presentations.", "verified": true, "helpfulness": "0/0", "author": "jlslemmons"}, {"rating": 5.0, "review": "Love my Chromecast so much that I ended up getting 3, one for each TV in the house.  It's cheap and does all I need.  Our kids can watch Netflix and YouTube on the big screen pretty easily, and I'm hoping more apps will get added.  We've also used it for meetings to cast agendas, etc. from a laptop to the screen using the Chrome browser.", "verified": true, "helpfulness": "0/0", "author": "JABAG \"Just Another Bay Area Geek\""}, {"rating": 4.0, "review": "Most of the apps on device are also on Blue ray player so not the best deal. Only compatible with Google Chrome. There's more room for improvement though.", "verified": true, "helpfulness": "0/0", "author": "callmeish"}, {"rating": 5.0, "review": "I really liked google chromecast, is easy to instal and set up. with you tube and netflix works great, using chrome tab streaming works good too.", "verified": true, "helpfulness": "0/0", "author": "Francisco Martinez Gonel"}, {"rating": 5.0, "review": "Purchased this as a gift for my family and they love it. We have been using it to stream YouTube, Netflix, and music and it was worked perfectly. It is a really great device that everyone should pick up.", "verified": true, "helpfulness": "0/0", "author": "Connor Hartzog"}, {"rating": 3.0, "review": "However I really wish it supported amazon video. Netflix is the next best thing but doesn't have a very good selection and I could have just streamed Netflix from my Xbox.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}]