[{"rating": 1.0, "review": "I wish i could get a refund what s the point i can get anything i want w cable on demand total rip off to my Sons hard earned money I wulld never recommend this to anyone", "verified": true, "helpfulness": "1/3", "author": "anne mateyak"}, {"rating": 5.0, "review": "Works great. Tutorial is pretty much right to the point.", "verified": true, "helpfulness": "0/0", "author": "Christine M. Fischer"}, {"rating": 5.0, "review": "It passed my expectations. It is easy to set up and easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I'm still learning all of the different programs that I can get.", "verified": true, "helpfulness": "0/0", "author": "midge"}, {"rating": 5.0, "review": "Love the Fire. Haven't had cable in a few years, but this brings all the content I could want. Sleek design and easy to use. Make sure you Amazon Prime, which is an awesome deal to, to really enjoy all the features the fire has to offer. Besides the TV and movies, there is music, cool apps, and the photo storage is awesome. The features and content will only grow over time. Hopefully studios will realize the market and start offering direct access to there content such as ESPN so we can watch live sports. Right now you still need cable service to access apps such as HBO GO and Watch ESPN, but as I mentioned things will change. Get the Fire now.", "verified": true, "helpfulness": "0/0", "author": "Tad Thrower"}, {"rating": 5.0, "review": "Thrilled with the Amazon FIre TV - it was easy to install and begin using. In less that 5 minutes we were watching a free Prime movie!", "verified": true, "helpfulness": "0/0", "author": "JP Cloutier"}, {"rating": 4.0, "review": "It's ok, just got it hooked up.  You need to people some time", "verified": true, "helpfulness": "0/0", "author": "Clarence M."}, {"rating": 5.0, "review": "LOVE it", "verified": true, "helpfulness": "0/0", "author": "Chatty \"Kathleen Lyman\""}, {"rating": 4.0, "review": "Need to have the voice search more that just Amazon. It's fast which is a big plus. Once Amazon updates the voice search and tweaks the menu system it will be perfect....more what I want anyway.", "verified": true, "helpfulness": "0/0", "author": "Gary Lynn Burden \"garycowboy\""}, {"rating": 5.0, "review": "If you are a Prime member this unit is a must have. Works great. I've used it for a few months now and very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Ernes T."}]