[{"rating": 4.0, "review": "Works well and when not in use it automatically scrolls through beautiful wallpaper's. The only user interface comes from an external source ie: mobile device, tablet or laptop. This is not a stand alone unit, must be used in conjunction with existing device.", "verified": true, "helpfulness": "0/0", "author": "Dwayne Boland"}, {"rating": 4.0, "review": "Great device.  Plenty fast enough - no speed issues.  Super Duper Easy Set-Up.Would be nice if it supported 5Ghz wireless or better yet MIMO for both frequencies (like Amazon Fire Tablets have).  This is the way to go.  Needs more entertainment provider supported apps, but you can work around the lack of but workarounds are a pain.Dish - Direct - Cable providers all should use this device structure for their remote TVs rather than bulky boxes.All great things have a begging.  ChromeCast is definitely the beginning of great streaming devices at an affordable price.", "verified": true, "helpfulness": "3/3", "author": "Chace 1693"}, {"rating": 3.0, "review": "Works very well for what it is designed for just not what I thought it was", "verified": true, "helpfulness": "0/1", "author": "Lauren Briggs"}, {"rating": 4.0, "review": "Was great!  Easy to get working.  Downloaded easily.", "verified": true, "helpfulness": "0/1", "author": "Lori casey"}, {"rating": 5.0, "review": "I watch entirely too much TV since buying my Chromecast.  Super easy to set up and the streaming quality is great.", "verified": true, "helpfulness": "2/2", "author": "revox"}, {"rating": 5.0, "review": "This is a great product for the price", "verified": true, "helpfulness": "0/0", "author": "Steven Martinez"}, {"rating": 5.0, "review": "Works even better than we hoped.  Whole extended family is now using Chrome!", "verified": true, "helpfulness": "0/0", "author": "R. Stout \"Becca\""}, {"rating": 5.0, "review": "Just what I was looking for! For my husband's birthday, I bought Chromecast in the hopes of mirroring (called \"Casting\") my Android phone or tablet to our TV screens so that we could watch a variety of things together. For the unbelievable $35 price tag, it promised that I could do just that without any other equipment.We decided to try it out that night only to find out to my complete chagrin that neither my tablet nor my phone could mirror because apparently only a handful of Android products were spec'ed for it at the time. I was so embarrassed because I had read so carefully about it to ensure it would work, but it turned out that while the Samsung Galaxy S5 was capable, the S5 ACTIVE (which I own) was not. Disheartened, I took to the internet to find that Google was planning on rolling out more updates to accommodate other phones, so I held out hope.Several weeks ago, for a lark, I searched again to see if my compatibility had changed, and indeed it had! I opened up Chromecast, and BAM! there was my screen with everything on it right there on our flatscreen. I played a game, some videos, scrolled through pictures, all with only minor lag. It is responsive to screen rotation, so make sure you flip your phone accordingly to enjoy your mirrored screen.As long as you have a USB/HDMI input on your TV, you can use Chromecast with any TV. We use it downstairs and upstairs. It's great for watching the WWE network on our TV in our bedroom which does not have the Playstation or for streaming Amazon movies without having to move a muscle.I love this little dongle x1000. If your phone isn't compatible yet, don't fret! Wait a few months, and you could just be in luck!", "verified": true, "helpfulness": "2/2", "author": "Dutchrub \"Cassie\""}, {"rating": 3.0, "review": "So far good, nothing wrong.update, july 2015: It keeps disconnecting on its own, or suddenly the video starts from the beginning several times. I don't know if amazon will exchange it with a new one for me or not.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth \"az\""}, {"rating": 5.0, "review": "Good item.", "verified": true, "helpfulness": "0/0", "author": "Estela Pinedo"}]