[{"rating": 4.0, "review": "Great video streamer/player. Needs live network feeds.", "verified": true, "helpfulness": "0/0", "author": "John Brown \"lpcustom79\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Charles H. Johnson"}, {"rating": 4.0, "review": "It would be a home run if you could throw you i-Pad videos up on the big screen. Great that it has both Amazon Prime and Netflix unlike Apple TV which only carries Netflix.", "verified": true, "helpfulness": "0/0", "author": "Robert Pelletier"}, {"rating": 5.0, "review": "Streams really fast! 😊", "verified": true, "helpfulness": "0/0", "author": "John Deckard"}, {"rating": 4.0, "review": "Would give it 5 stars as the picture quality is awesome.. wish there were more selections for movies and the prices were cheaper but it isn't too bad.  The remote, however, ate 3 sets of batteries in less than a week... called Amazon to let them know and hopefully we will get a new remote so we don't have to waste anymore batteries!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Super fast, great picture quality. I am disappointed with Prime TV.  I watched the first season of \" In Treatment\"  What ? , I have to pay for additional seasons. Netflix has you beat !!!", "verified": true, "helpfulness": "0/0", "author": "Neil Petrosky"}, {"rating": 5.0, "review": "IT IS GREAT, A FEW MORE SHOWS AN GOOD BYE SATELLITE TV", "verified": true, "helpfulness": "0/0", "author": "tater"}, {"rating": 5.0, "review": "Best XBMC box available. Doesn't do 10-bit / Hi10p content correctly, but that's an XBMC issue, not FireTV. As for the native FireTV functions, they work well too. RF remote is also very nice (don't need to place the FireTV in line-of-sight with the remote).", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "Better than Apple TV, faster, more features, easy to use, plus gaming with Apps.  Own several Apple devices, computers iMac, Mac Mini, MacBook Pro, etc. also own Apple TV  Vers. 1.0 (720p resolution model) great for watching Apple iTunes content such as movies, TV shows, iTunes music, streaming content from your Apple computers to you HDMI TV screen.  Upgraded to the Amazon Fire TV with game controller - Glad I Did, really impressed with the added features that are missing from Apple TV such as Voice commands, 1080p, TV Apps, Gaming Apps, Amazon Prime linking of movies. Since I already had an Amazon account the unit was sent to me already set up for pretty much plug and play easy setup. The TV unit is fast when searching and opening screens to search content to watch. The Fire is 4 1/2\" square and less than 3/4\" thick (Apple TV is 4\" square and more than 3/4\" thick).  Fast Internet loading of pages, storage for new Apps, easy to use and upgrading, plus a poor man's gaming console that lets you play many games that are available for your tablet or phone (no need for an Xbox or PS console for the casual gamer), but usable with an Xbox like Kindle Fire controller sold separately. Some games from Amazon, others that are Android that work well on your Kindle Fire HD(X). No other TV device that I know that allow gaming, plus no additional HDMI cables inputs are need to use. Links to your Kindle Fire HDX for full screen viewing. Stream music, personal photos from the cloud, auto screen saver, 30 min to sleep mode when not active.  If you own an older HD flat screen TV this Fire TV Unit will let you add Smart TV Apps Internet capabilities at a very reasonable price as long as you have high speed internet, thru you HDMI connector.Large content of TV shows, movie content to explore, preview, review and purchase. Can setup some of the paid services such as Netflix, Hulu, RedBox, plus some TV Apps to DL to custom meet your viewing interests. Links to your Amazon account.  Wasn't going to buy this since I had the Apple TV, but GLAD I DID - so much better and useful with its added features.", "verified": true, "helpfulness": "0/0", "author": "RPD"}, {"rating": 5.0, "review": "the best!! Will be buying another when on sale again!!!", "verified": true, "helpfulness": "0/0", "author": "Paula"}]