[{"rating": 1.0, "review": "I do not find this to offer any cost savings compared to my other devices / subscriptions. Just not impressed at all!", "verified": true, "helpfulness": "5/14", "author": "Stacey Wideman"}, {"rating": 1.0, "review": "I spent 2 hours on the phone with very nice support people trying various methods to make the Netflix app work.After a complete reset and reload they told me they were going to talk to the development team and get back to me.In short it doesn't work, more like Beta than ready for market as a product.They of course refunded my money and I returned the item.After the bugs are worked out I will take another look at it.", "verified": true, "helpfulness": "4/8", "author": "colorado"}, {"rating": 5.0, "review": "Six months of the year we live in Texas.  This works great there.  Six months of the year we live in the Boonies in NY and depend on Hughes satellite for our Internet.  It doesn't have enough speed for movies through Fire and one move uses up our Fair Access which means for the next 24 hours we have access that is slower than dial up.", "verified": true, "helpfulness": "1/1", "author": "Kathryn Walker \"katiedid\""}, {"rating": 3.0, "review": "Arrived fast, installed quickly and pretty painless adding it to my smart phones and computers. The voice activated thing is OK but not the reason why I bought it. After talking to Netfilx and Amazon, neither were able to explain why I can connect to everything else but not Netflix. It's small and could be made very portable. It's better than Chromecast with the remote.Still testing the waters and not unhappy at all, I just think more updates are in order.", "verified": true, "helpfulness": "1/2", "author": "Joan W."}, {"rating": 4.0, "review": "Fire TV is an excellent product, work as advertised, very fast, with prime membership I can Access a lot (and I mean a lot) of movies and series (Love CHEERS).The big problem (one star less for that) is that from time to time the connection gets very slow, I test my internet connection and the speed shows 8Mbps-10Mbps, but somehow every show (Prime, Netflix or HULU) takes forever to download, so I UNPLUG from the power the fire TV, plug it again and the problem is solved.  On two occasions my prime account didn't connect (every prime TV Movie or Series was unavailable to play), again I UNPLUGED from the power the fire TV, plug it again and the problem was solved.Maybe with the next firmware update they should put a REBOOT option to solve these problems.Almost 1 month of use, and I have to unplug the device 4 times, but it should not have this problem.Overall excellent product, Highly recomended.", "verified": true, "helpfulness": "1/1", "author": "Eda De Ortega"}, {"rating": 2.0, "review": "No MLB.tv. No ABC. No HBOgo. No NHL. No ACC network, which makes me skeptical about SEC Network.Device is easy to setup, and it's quick. But until the app selection is more robust, it's simply not worth the money when you can get ROKU for half the price.", "verified": true, "helpfulness": "2/6", "author": "Peter P."}, {"rating": 1.0, "review": "This device was a piece of junk! Your customer service could not help, although they were very professional and tried to be helpful. They turned over my problem to your techkies and they sent me a new device. Still no success. I have an LGE Smart TV, I have wi-fi, in my home, Apple TV works great with no problems connecting or maintaing the connection. I own the Kindle, Kindle Fire and love those devices. Kindle Fire does connect to my wi-fi!!!! This device I feel should never have been sold until the bugs are washed out. I have 3 friends that have the same problem with this device. I am very disappointed in this Amazon product!", "verified": true, "helpfulness": "6/9", "author": "Harold J. Hunter"}, {"rating": 5.0, "review": "love my new Amazon fire!!!! Just a shame they could not have also added a DVD player to it a well!", "verified": true, "helpfulness": "0/0", "author": "Sarah Kennedy"}, {"rating": 5.0, "review": "Loved it. My wife and I watch it all the time before bed. Great way to catch up on series or movies missed. Easy to use and set up was a breeze. Will be buying them for all the televisions in the house.", "verified": true, "helpfulness": "0/0", "author": "Randy L. Davis \"Krakknor\""}, {"rating": 5.0, "review": "I really enjoy the amazon fire, I would like more free movies from amazon,voice command for all apps. Over all it's great.", "verified": true, "helpfulness": "1/1", "author": "Sybil"}]