[{"rating": 5.0, "review": "I really enjoy this device.  It works really well with my Ipod touch and Iphone.  I also use it with my chromebook.  I have a DVD player that has youtube built in, but I like searching for youtube clips on my chromebook, it's just easier to type.  It's really easy to control the playback and I like sharing with the family and friends on the TV rather than everyone crowding around a small chrome book screen.  The price is right $35.  Love it.", "verified": true, "helpfulness": "0/0", "author": "RAB"}, {"rating": 5.0, "review": "Only downsides I have seen care due to my equipment or the smartphone apps like Netflix. I bought three more of them for the other rooms with screens.", "verified": true, "helpfulness": "0/0", "author": "Christopher W Birth"}, {"rating": 2.0, "review": "I returned it. Yes, it works, but the interface, at least from the Nexus 7 tablet, is clumsy, complicated and tedious.I bought it thinking it would be an alternative to my Roku box, so I could stream Youtube, If that describes you, just wait for Roku to get a clue and make a deal with Youtube,", "verified": false, "helpfulness": "0/0", "author": "Gadget"}, {"rating": 5.0, "review": "The chromecast was something of a impulse buy on my part, something I generally am against. However, this time it worked out for me very well.The little device does one thing - stream media from the following applications (on android) to your television via hdmi:NetflixHuluGoogle Play (including Google Music)YouTubeAlso, Chrome for PC can stream a tab to the device (making most webpages possible streaming sources)This list is assured by G to grow over time, something that will be a welcome addition. However, even without that, at this price point its a perfect Netflix box, and the YouTube functionality is excellent. I will be welcoming 3rd party support form Plex et. al., but until that time it still has a very solid selection of media outputs to enjoy.If you need a Netflix box, I would give it a serious consideration. Its a snappy little device that has been very useful around my house.", "verified": true, "helpfulness": "0/0", "author": "David Hudson"}, {"rating": 2.0, "review": "If you are using this for sports like football or hockey it sucks. Too jerky and is better to view on the laptop.", "verified": false, "helpfulness": "0/0", "author": "KG"}, {"rating": 2.0, "review": "works fine with netflix and youtube, but most tvs already have those apps preinstalled (smart tv) nowadays. needs to work with more apps to become indispensable. good value if you dont have smart tv i guess.", "verified": true, "helpfulness": "0/0", "author": "Peter Ian Staker"}, {"rating": 5.0, "review": "Got this for my LED which doesn't have wifi capability. It's on the cheaper side and it's an easy install. I primarily use it for Netflix streamed from my Android phone and it works well.", "verified": true, "helpfulness": "0/0", "author": "Jesse V."}, {"rating": 1.0, "review": "Item was too difficult to set up and not compatible with my wifi system.  Manufacturer truly overstates the complexity of setting the system up.  Delivery and product were as described.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up.  Make sure you know your router password before you start the process, though, as you will need to add the Chromecast to your wireless router.  Was a little glitchy and the Chromecast got stuck at 23% while updating.  I unplugged it from the power source and let it reboot.  That seemed to do the trick.  Really nice to watch Netflix on the TV and use my iPhone as a remote.", "verified": true, "helpfulness": "0/0", "author": "SRW \"garden girl\""}, {"rating": 5.0, "review": "It's easy to set up and it's cheap!I will probably buy another one for the other TVs in my house.Maybe even give some away a Christmas presents.", "verified": true, "helpfulness": "0/0", "author": "L. Channel Lemon"}]