[{"rating": 5.0, "review": "This is the best thing ever made. Side car apps are the dookie!!", "verified": true, "helpfulness": "0/0", "author": "Friday Love"}, {"rating": 1.0, "review": "I have the fire stick its $60 cheaper and I don't think there's a huge difference between these two", "verified": false, "helpfulness": "0/2", "author": "Isamar"}, {"rating": 4.0, "review": "Very nice box.. Very fast.. and I customize it for my taste.", "verified": true, "helpfulness": "0/0", "author": "Christopher Studet"}, {"rating": 5.0, "review": "I had a Roku 3 stick....a terrible performing piece if junk.  I bought the Fire TV to get Sling TV so I could cancel my UVerse TV.  I am amazed at the performance of the Fire TV.  It is very quick, responsive, and seamless to use. I would love it more if it had the Weathernation and VUDU apps, but I have VUDU on my smart TV and I can still use the Roku for Weathernation.  I was very apprehensive about spending $99 on this device, but I'm glad I did.  A fantastic piece of equipment!", "verified": true, "helpfulness": "0/0", "author": "Cliff"}, {"rating": 2.0, "review": "It works well with my TV and wireless service.  I worry that I will go through the movies that interest me pretty fast.  To keep the service, there will have to be many more movies and documentaries.  All of the apps seem to be free trials that will automatically charge to your credit card at the end of the trial 7 or 14 or 30 days.  Some of the apps have a lot of ads.  The new releases cost as much to rent as pay per view or demand on satellite or cable.  Sling TV is $20 a month and my family does not use it.  I had to pay 3 months up front.  I may not be understanding how to get the most of this system.  I have just had it for a few days.", "verified": true, "helpfulness": "1/3", "author": "AgentChin"}, {"rating": 5.0, "review": "Fire TV is simply great!", "verified": true, "helpfulness": "0/0", "author": "William H. Smith Jr."}, {"rating": 5.0, "review": "Thumbs up", "verified": true, "helpfulness": "0/0", "author": "Kate Schuberth"}, {"rating": 5.0, "review": "This was a mothers day gift and a total surprise ! I'm still learning and playing around with it , very user friendly not complicated like some of the new tech out there. The next move is GETTING OFF CABLE.", "verified": true, "helpfulness": "0/0", "author": "Deborah D. Whitaker"}, {"rating": 1.0, "review": "The FIRE TV has a terrible lag. We see the Wheel spinning. It is considerably slower than ROKU and Apple TV. But there are a lot of Games and other Apps.", "verified": true, "helpfulness": "1/3", "author": "Gopala Bangalore"}, {"rating": 5.0, "review": "We are very happy with this product.", "verified": true, "helpfulness": "0/0", "author": "steven badzioch"}]