[{"rating": 4.0, "review": "Can be a little quirky but works 9fairly well 90% of the time.", "verified": true, "helpfulness": "0/0", "author": "RooDHawG"}, {"rating": 5.0, "review": "Excellent item, easy to install and set up.", "verified": true, "helpfulness": "0/0", "author": "Jen M"}, {"rating": 3.0, "review": "This was late arriving which was not a big deal but I am not satisfied with ChromeCast because Hulu doesn't work on it. I use Netflix and YouTube fine but Hulu was the reason I wanted this device and it is not compatible....", "verified": true, "helpfulness": "0/0", "author": "Carina"}, {"rating": 5.0, "review": "Great product and easy to use", "verified": true, "helpfulness": "0/0", "author": "duckylucky1 \"William\""}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "danelle gabler"}, {"rating": 5.0, "review": "Best purchase of the year.", "verified": true, "helpfulness": "0/0", "author": "Francisco Anes \"Captain Frank\""}, {"rating": 5.0, "review": "Wow nice", "verified": true, "helpfulness": "0/0", "author": "Javier A Nogues"}, {"rating": 5.0, "review": "I'm a complete idiot for not buying this sooner. Over the last couple years, I have shifted my viewing from cable, on demand, downloads, to streaming anything I can get my hands on. Finding a way to get it onto my tv has been a challenge. I don't own a Smart Tv, so I was relying on using my very loud/slow Xbox 360. That ended up not working because the fan on the console had become so loud that I could hardly hear what I was watching. I was also limited to Video Apps.  Next came streaming from my computer. My computer is an older model and didn't have an HDMI port, so I was relying on a VGA and Audio cord. The result was a sub par picture, inconsistent sound, and having to set up my computer right next to the tv. I knew HDMI was the answer and was about to purchase adapters that might have solved the answer until I started looking for other answers.  Then came ChromeCast  which beat all the other streaming devices in almost everything.Pros:-The new Beta ability to cast Google Chrome tabs was the ultimate selling point. With all the other streaming devices, you rely on video apps like Netflix, Hulu etc... Chrome uses those too, but it also allows you to cast any video in a Google Chrome web browser tab. You do need to use a fast enough computer though because unlike it's other features which bypass your other devices and streams directly to the ChromeCast, this feature streams from your computer first. This feature is equivalent to connecting your computer directly with an HDMI cord, so if your computer is not up for the job, this feature might not be usable for you.-The video and sound coming off the device is fantastic and casts up to 1080p.- The price: I got lucky and purchased it on Cyber Monday for $23, but $35 is still more than reasonable and much cheaper than the competitors.- Setup is very easy. Plug it in, connect to your wifi, name your Chromecast and then just connect your devices to the new Chromecast network. (You will need to download the Chromecast app from the app store for your smartphone/tablet and download the Chromecast extension for Google chrome on your computer to make them compatible. After the initial setup, all you need to do is change the input to the appropriate HDMI source on your tv, choose one of your devices to cast from and hit the \"Cast\" button and you're good to go.- Like other streaming devices, ChromeCast is also dependent on Application compatibility. So you get your Netflix, Hulu, Youtube, but some apps don't support it, including Amazon Instant video. This was originally a set back until I discovered \"TV Cast\" available on the iOS App Store. This application allows you to surf the web in a browser and cast nearly any video on the page to your tv, the same way you would in the Netflix or other Apps. This app alone makes ChromeCast the perfect option, especially if you don't want to pay for services like Netflix or Hulu. The app also means I can run the App solely from my phone and never have to rely on the ChromeCast Beta feature which is unfortunately not up to par.", "verified": true, "helpfulness": "3/3", "author": "Charles"}, {"rating": 5.0, "review": "Awesome!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Shine Star 3 \"SS3\""}, {"rating": 4.0, "review": "Like the ease of use and updating is automatic.  Would prefer to have more applications available. Need support on additional Android devices to screen cast.  Maybe chromecast app for Roku?", "verified": true, "helpfulness": "0/1", "author": "Hugo Reyes"}]