[{"rating": 4.0, "review": "I love it EXCEPT that as a Directv customer, I cannot use the Showtime Anytime app to watch on it. I have to use my Chromecast. This kind of sucks and Amazon and Directv should get their $%#^ together and make this work. HBOGO works for directv customers so why can't Showtime?????????", "verified": true, "helpfulness": "0/0", "author": "Dennis C Alloy"}, {"rating": 5.0, "review": "It's like having a giant tablet. It's a lot better watching Netflix and using Youtube on your hd tv.", "verified": true, "helpfulness": "0/1", "author": "jjster2"}, {"rating": 4.0, "review": "UPDATED from two stars to four:I bought this so I could access Sling, so this review will have to do entirely with FireTV's Sling app.  (Netflix and YouTube and even Amazon Prime and all that are covered by my BlueRay and t.v.'s wi-fi.)There are lots of wrinkles with Sling.  So far, Sling's apps to watch on your mobile devices are only usable with Slingbox and not FireTV, so far as I can tell.  Amazon FireTV does not yet have a compatible app to drive iOS devices, anyway.  Practically, that means that if you get FireTV, you can get Sling up and running fairly easily, but you're not going to get ESPN on your iPad.And once they do issue a FireTV app, Sling's services won't let you watch on two devices simultaneously.  That's understandable: much the simplest way to make sure you don't let your friends all use your Sling account, but bothersome for (for example) a family torn between ESPN and ESPN2.Sling's got some buffering issues at the moment, so I'm giving them a few weeks to iron that out before I make a judgment about that service: nothing makes me think the FireTV unit is to blame, as everything else streams pretty elegantly.The unit itself is well-designed and sleek: just plug it in through an open HDMI port, turn it on, log into your wi-fi, and go.The voice-search rocks, Amazon partnering (for Prime videos) is seamless, and the \"apps\" format is sensible and easy to use.  (Read the fine print on pay-per-view / purchase items.)Edited To Add: Dropped my review from 3 to 2 stars.  Sling is really, really unfortunate right now, and the billing arrangement through Amazon is disastrously confusing; just spent a long hour on the phone with India trying usuccessfully to sort out billing and subscription issues.  My free trial has expired and I'm not going to pay for the service, as the streaming through my Amazon FireTV is so unbelievably bad.  Lots of buffering, errors, and other glitches.  My wi-fi is an Apple Airport, and my digital modem is decent enough, not top of the line, but nothing I should have to upgrade.  I'll watch the Final Four at a sports bar this year until they iron out the problems.And if not... well, it's only television.  Everything else on the FireTV seems to work fine.Edited (again) to add: In the last two months, Sling's gotten a LOT better.  I'm not sure if this is adjustments on their side or what, but we gave Sling a good try, and it works.  ESPN is still a little glitchy.  Everything else is reasonable: not cable-quality, but a LOT cheaper.One warning: there's a bit of confusion at Amazon customer support about whether or how Sling bills through Amazon Prime.  Be ready to straighten that out, and be absolutely sure to use your own Prime account as the signup.", "verified": false, "helpfulness": "2/2", "author": "Otter"}, {"rating": 3.0, "review": "I expected to have more movies available for \"Prime\" viewing. There seems to be more movies and shows that require me to rent or buy them. Disappointed in the fact that I would have to buy another device for a different tv. So far the music selections have been good", "verified": true, "helpfulness": "1/1", "author": "Liv"}, {"rating": 5.0, "review": "Installed  Fire TV and it works very well .My Amazon and Netflix  both stream well with no buffering", "verified": false, "helpfulness": "0/0", "author": "whiskers"}, {"rating": 4.0, "review": "Great item!!  More of f the movies should be free to compete with Netflix though!", "verified": true, "helpfulness": "0/0", "author": "Clea"}, {"rating": 5.0, "review": "My Amazon fire tv works great!  I have tried both Netgear and Roku streamers with my JVC TV and the Fire TV rocks!", "verified": true, "helpfulness": "0/0", "author": "Ram Fan in Wyoming"}, {"rating": 5.0, "review": "The experience has been great so far- the selection is vast and the picture quality is excellent.", "verified": true, "helpfulness": "0/0", "author": "Kathleen C. Obert"}, {"rating": 5.0, "review": "Very satisfied! Goodbye DTV...", "verified": true, "helpfulness": "1/1", "author": "Melissa Broughton"}, {"rating": 4.0, "review": "I've tried streaming on my Smart TV, on an Apple TV, but nothing compares with Fire TV... I LOVE IT!!!!*** Update.... one week after installation the unit began to malfunction, the phone tech told me it might be over heating.  They head no suggestions other than to not sit it on another unit that create heat give it space.  What I did and it has been working is attach four of those self adhesive feet you can buy anywhere for $1 to the bottom of the unit therefore permitting air to circulate around it.  I suggest Amazon ship the unit with feet, or at least put them in the box and offer the option/suggestion.", "verified": true, "helpfulness": "0/0", "author": "gabriel J. forzano \"gabriel\""}]