[{"rating": 1.0, "review": "rarely works, is such a hassle. what a waste of money", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Can someone post how to resolve chromecast instability? It keeps dropping. Or it plays on tv, but the remote on the ipad disappears and i cant pause or rewind as needed. It suddenly plays on TV independent of the ipad. Very frustrating. Cant find anything in groublrshooting. Should have bought Apple TV. This se who know how to fix this or whats causing it, please share. In simple language please. I am technologically challenged ;(", "verified": false, "helpfulness": "0/1", "author": "Kay A. \"love2bake\""}, {"rating": 4.0, "review": "I wish there were more apps that used it", "verified": false, "helpfulness": "0/0", "author": "j-pa"}, {"rating": 5.0, "review": "It does what is suppose to do and it works smothly.", "verified": true, "helpfulness": "0/0", "author": "Luis Duran"}, {"rating": 3.0, "review": "We bought this as our family's way of having access to watching things online.  We do not have a smart TV or Cable or Satellite.  This can be a great device, but we keep running into the issue of having to unplug it and restart it so that our devices connect.  When it's working right it is great, but when it's not it is very frustrating", "verified": true, "helpfulness": "0/0", "author": "Emily D"}, {"rating": 4.0, "review": "Hard to set up. Lost patience with it", "verified": true, "helpfulness": "0/0", "author": "tim"}, {"rating": 2.0, "review": "In a nutshell streaming has a lot of bugs to work out no matter which device you use. I purchased chromecast and have been using it just over a month because I was fed up with roku 2. I could not see buying another roku for more of the same so it seemed reasonable to go with chromecast. Roku everyday and several times a day had to be rebooted and that was getting really old. Chromecast started out ok, there is an adjustment to streaming after eons of cable, satellite and remote control. At first chromecast was an improvement over roku not having to reboot several times a day. However that did not last long, just over a month of using the chromecast the sound just decided to no longer function. I would access Hulu through roku and I had sound but when I would switch to chromecast there was no sound. I would access using either my pc, tablet or phone and chromecast would have no sound so it had to be the chromecast device. I uninstalled chromecast, media player etc everything that would make the chromecast work properly and the sound worked again, but temporarily. At this point to watch tv or movies it comes down to either using roku or chromecast, pick your poison, I have to rate them the same, both will stop functioning in their own way and will have to be rebooted. Either device when working like they are supposed too are great but both have a long way to go and many bugs to be fixed.", "verified": true, "helpfulness": "0/0", "author": "Mollie"}, {"rating": 1.0, "review": "Used it for a month or so with no problems. It then began to disconnect from my wifi and had to be reconnected every day, then it just stopped connecting. It is in the junk pile now.", "verified": true, "helpfulness": "0/0", "author": "Habayou"}, {"rating": 4.0, "review": "Works great with the limited number of available applications. Really weird that it ALSO needs to be plugged into the wall - hate the extra cord.", "verified": true, "helpfulness": "0/0", "author": "Paul Gardner \"Conductor of Magical Publishing\""}, {"rating": 1.0, "review": "They have a lot of nerve selling this product. It has problems regardless of what browser you use. Sometimes no sound, sometimes sound no picture and very slow to book. I would not recommend this product until they improve it.", "verified": true, "helpfulness": "0/0", "author": "Peter Klossbruhe"}]