[{"rating": 5.0, "review": "Follow up:I still am finding this little device to be useful.  However, since my Samsung TV in my home office has a Amazon and Netflix shortcut button I will not be getting another.  I currently am using this one device on an older samsung plasma that only has yahoo widgets and not direct shortcuts too these two major services.First impressions.  Great.  It comes already synced with my account...just like Kindles.  It needs to run a major update so don't get too comfortable.  You will need to either join it to your wireless or plug in the ethernet cable let the update run and then rejoin to your home network.Once this is done you are set.  The user interface is intuitive and requires a very short learning curve.I like the way my library and saved lists are displayed.I am just putting in my two cents worth here.  There are so many reviews so if you want to read an epistle you can do so.I for one prefer short and sweet.It is easy to use, hardware is nice, lookup function with the microphone is amazing and finds what you want!They have a lot of channels available and most cost extra.Compare and contrast to my apple tv.  Two very different devices yet they have a lot in common.I paid $99 for this and $99 a year for amazon prime. On my apple tv I paid $93 and that is it.  I watch a number of things that may or may not be on amazon.  I am used to watching them on apple tv and since i am heavily invested in the iTunes system with around 1.5 terabyte of videos, tv show, movies and music I will be keeping it.  I also watch sky news, youtube videos and MLB on the apple.  I of course have to pay $118 a year for MLB.So if you already are a prime customer this makes perfect sense.  It is hands above the roku device.", "verified": true, "helpfulness": "2/3", "author": "ILUVmyGrandKids"}, {"rating": 5.0, "review": "Set up was a breeze and I was on line in less than 5 minutes. Entering my network password took longer than plugging it in. This thing is so small you can put it anywhere and most people won't even see it.It is fast and the up scanning options are fantastic.  Wireless is fast enough to get good HD video on local or internet files.I like it!", "verified": true, "helpfulness": "1/4", "author": "Donald J Buteau"}, {"rating": 2.0, "review": "I have never owned a setup box like this before, no Apple TV, No Roku etc.  I have seen the others at friends houses and just didn't like the user experience..anyway.  Gave this one a try, don't really like it.  First, I have a trail Prime Membership and I can't tell 1/2 the time if the movie/tv episode is something I get for free or if I have to pay.  They make you dig down into the menu and select \"Amazon Prime\".  So, you have to go through this for every thing you think you may want to watch just to check to see if you need to pay or not.  Speaking of paying, every single movie, episode has the pay link front and center, if you are entitled to watch it for free with your Prime Membership.  It is like Amazon, is trying to trick us into paying for something we don't need to...hmmm.  Don't like that at all.  The apps seem to be of poor quality, the Youtube app has onscreen directions that don't apply to the Fire TV, the onscreen keyboard is horrible to navigate.  When you get all the way to the end of a list it just stops instead of starting over from the beginning.  There doesn't seem to be anyway to hid items in your Library that you have already watched, making it a pain in the butt to use.  Nope, not too impressed at all, it will be coming back to Amazon shortly.", "verified": true, "helpfulness": "3/6", "author": "David Ferguson"}, {"rating": 4.0, "review": "I like a lot of things about the Fire Tv unit, It was easy to set up and use.I just wish it had recording capabilities, and there is to much \"for sale\" movies and TV.The instructions are a little lacking.", "verified": true, "helpfulness": "0/0", "author": "Mit Nannerb \"T\""}, {"rating": 4.0, "review": "The Fire TV is a great product. Anything from Amazon is well thought off, planned and well constructed. However, I played the Movie \"SAFE\" and noticed that varies parts were cut out and in some instants the part of the move did not made any sense. Why are these movies cut and not play as on the DVD? I thought I don't have to buy anymore DVD but if I want to see the complete Movie I need to buy the DVD. Why is that.Thanks IVM", "verified": true, "helpfulness": "1/3", "author": "Ingo V Mewes \"Ingo V Mewes\""}, {"rating": 3.0, "review": "I was all in on this product just due to the speed and new OS.However I was very disappointed to find that it had neither WWE network or Twitch at launch. This is why I bought this device.As far as the product its self it is good, not great. Remote seems to have a mind of its own in my pocket. Also wifi drops quite often.Over all speed on this device is GREAT, just wish I had something to use it for other than Netflix as of now.AMAZON BRING WWE APP TO THIS DEVICE ASAP! You have this available in your app store and it is available on ALL of your competitors devices... this is where you are losing the race.", "verified": true, "helpfulness": "1/4", "author": "John Van Valkenburg"}, {"rating": 4.0, "review": "Not so easy to get other TV stations.  It would be easier if there was a drop down menu to select other stations or pay TV web sites.  Typing it in is cumbersome if you want many different channels.  That being said, I am spending much less than the cable neighbors and getting much better quality.  Having less commercials is worth the price.  I haven't figured out yet if I can Tvio yet, but I am very happy to have the Fire TV.  The future of cable networks and constant price hikes are over.  No more monopoly on TV!", "verified": true, "helpfulness": "0/0", "author": "Shirley McLaughlin"}, {"rating": 4.0, "review": "Not being a fan of cable, this is a great alternative.  Since I like the shows and don't necessarily need to confer with friends on my opinion of what happened on a given episode it works well for me and the kids love all the movies and TV shows so win-win overall.  For the price, I think this is a great addition.", "verified": true, "helpfulness": "0/0", "author": "sgapper"}, {"rating": 4.0, "review": "it's great, it does what netflix does and more.  Wish i could get local channels live with it,  Maybe it will happen soon.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Just received my Amazon Fire TV!  I was eager to  set it up and it was a breeze.  The set up is so simple a child could do it.  This is just what I needed to get my \"nightly Amazon Prime movie\" off the computer and onto the big screen.  I was thinking about upgrading to a 'smart TV' but now don't need that purchase.  It was really an inexpensive 'upgrade' and I love it!", "verified": true, "helpfulness": "2/2", "author": "Wendell P. Thompson"}]