[{"rating": 5.0, "review": "Easy decision to buy for yourself, perfect gift. Enough said...", "verified": true, "helpfulness": "0/0", "author": "B. Cornwell"}, {"rating": 5.0, "review": "It's AWESOME!!! Great Price!!", "verified": false, "helpfulness": "0/0", "author": "Tabetha Sarkkinen"}, {"rating": 5.0, "review": "Worked great.  Loved it.", "verified": true, "helpfulness": "0/0", "author": "Reba A J Phillips"}, {"rating": 5.0, "review": "I only got this product because it came for free with a router purchase. I stored it away for a couple of months and forgot about it. When I finally decided one day to try it, I was hooked. My laptop will cast some content to my TV on its own but it has to be very specific file types. This thing will cast your web page and Youtube videos and many more. The only thing it has a problem with is Amazon Prime, but if you configure Prime to flashplayer instead of silverlight, it will work (you do loose resolution though). Even so I love it. For the retail price of between $25 to $35 I think this is an awesome device.", "verified": true, "helpfulness": "0/0", "author": "John \"John\""}, {"rating": 5.0, "review": "This is my second one I've bought....one for each tv and it's saving me tons of money by not having to have cable anymore!", "verified": true, "helpfulness": "0/0", "author": "bruisertm"}, {"rating": 3.0, "review": "Not what I expected. But I gave it a neutral rating because I haven't used it much due to the apps you use with it want you to subscribe or ask for a username and password for your cable/satellite provider. I got it because I didn't want a regular cable service. I was thinking and what I read, all you needed was a Internet connection. So it's not technically how it works or made that is disappointing. It's the apps. What's the point of having this if you need regular TV? So I may change this rating as I use it more. But for now. I don't think I would buy it. And really any of the things like these. Like apple or fire. It's gonna be the same thing.", "verified": true, "helpfulness": "0/0", "author": "Kathleen Leatherbury \"Love and God Bless, Kathy\""}, {"rating": 2.0, "review": "Tried it for a week.  The video skipped on TV.", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "A-Pearl Smith"}, {"rating": 5.0, "review": "Everything what I expected and I got even more", "verified": true, "helpfulness": "0/0", "author": "Dennis Diaz"}, {"rating": 4.0, "review": "The chromecast works fairly well and is improving with every upgrade. My only complaint is that it will periodically lose connection or stutter.", "verified": false, "helpfulness": "0/0", "author": "Joshua Dunn"}]