[{"rating": 4.0, "review": "I bought this is in September, and it has been a solid investment. The main reason why I bought it is because I was tired of watching HBO GO on my laptop, and Comcast won't let you set up HBO GO on a PS3. Now I use it to watch YouTube videos, Hulu Plus, Netflix, etc.The set up was fairly simple, and once you download the app to your device, you can get right to using it. Your device becomes a sort of high-tech remote control which is pretty cool. It's pretty cheap so that's also a plus.I only gave it 4 stars, because I have had some issues with it. I don't know if they're specific to me, or if others have experienced it. The connection between the Chromecast and whatever device you are using tends to drop while whatever you're watching continues playing. It's a minor inconvenience to reconnect, but sometimes I wanted to pause it quickly. Also, this maybe my own issue, but when I use the Chromecast to watch something and then want to switch to my PS3, I have to unplug my television because it needs to be reset. Otherwise, the product is great!", "verified": true, "helpfulness": "0/0", "author": "A.Munoz"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Norberto"}, {"rating": 1.0, "review": "Every time that I want to use this device I have to go through  the setting process. Google needs to work on improving  thins thing. I puchased two of them and both of them do the same. I know that in the end Google will have a very good solution but this one needs work", "verified": true, "helpfulness": "0/0", "author": "Jose Astacio"}, {"rating": 5.0, "review": "Use it a lot and with the book it was easy to get going. Have a ROKU also but prefer the Chrome Cast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The chromecast is a cool device in concept but I don't think I could recommend this item at this time.  I picked it up to use in my apartment to stream video to a second tv.  The problem is that the chromecast ONLY will work on the 2.4ghz band and in densely packed apartments this band is cluttered.  I couldn't stream anything reliably or at high quality unless I moved the wireless access point right next to the chromecast.  I was hoping to use this in a different room so the wireless network band limitation is a huge problem for me.  The chromecast 2.0 device will be compatible with the 5 ghz band, so that should solve many of these problems.", "verified": true, "helpfulness": "0/0", "author": "Brian J. Krueger"}, {"rating": 5.0, "review": "oh yes !!! like advertised", "verified": true, "helpfulness": "0/0", "author": "dag"}, {"rating": 5.0, "review": "It has wonderful streaming and when your not connected or streaming, it showcases buetiful pictures from good photographers. It is also mega portable and versatile, but if there is another chromecast on the network when your setting up on another wifi signal, the chromecast that is already there might foul up what your doing.", "verified": false, "helpfulness": "0/0", "author": "Henrik T."}, {"rating": 5.0, "review": "This device is amazing and came so fast.", "verified": true, "helpfulness": "0/0", "author": "Sillysteph"}, {"rating": 4.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "ami"}, {"rating": 5.0, "review": "Worked exactly as expected. Great product.", "verified": true, "helpfulness": "0/0", "author": "DR"}]