[{"rating": 3.0, "review": "Very sleek design. Has all the features I want, and a lot more that I don't even care to explore. In fact, I wish there was a simpler model that didn't offer games and strange apps. I like the interface, overall, but there are some idiosyncrasies that I don't care for. Namely, the main menu is broken into repetitive or superfluous categories. Also, it displays all movies, shows, and apps you use at the top of the screen, in the order used...I'm not sure why that feature is thought to be useful. My main problem, however, is that I have had a LOT of problems using Hulu on this device. I'm not sure why, but I could never get Hulu to function properly in the month I've used Fire TV. The device itself seems more reliable than the Roku 3 that I use in the bedroom, and also seems to have a LOT sharper image. The price is reasonable, I suppose, given the limited spectrum of comparable devices.", "verified": true, "helpfulness": "0/0", "author": "S. Brown \"Browner\""}, {"rating": 5.0, "review": "Bought this for my daughter for Christmas. She LOVES it! We are going to buy one as well. Daughter was finally able to get rid of cable tv!! She's very happy about that, too!", "verified": true, "helpfulness": "0/0", "author": "Bijou \"Bijou\""}, {"rating": 5.0, "review": "It is fast and better image quality..Best part is side loading android apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"nagesh009\""}, {"rating": 5.0, "review": "I like It . Good product . had to order twice , they lost the first one . ordered again , got it on time . Thanks .", "verified": true, "helpfulness": "0/0", "author": "Big  D"}, {"rating": 5.0, "review": "I have been very satisfied. It has worked well and makes me think about dumping my satellite TV.", "verified": true, "helpfulness": "0/0", "author": "Lady Mandragora"}, {"rating": 5.0, "review": "Voice controller is fantastic but it only works with Amazon Prime (doesn't work with Netflix or Hulu Plus).  It's small and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Linda Sue"}, {"rating": 3.0, "review": "glitchy....goes from sd to hd very often. while watching movies or shows it buffers. voice search stopped working. would give 5 stars if it didn't have these issues.", "verified": true, "helpfulness": "0/0", "author": "Reneitia"}, {"rating": 5.0, "review": "I bought three of these.  I haven't hooked mine up yet, but gave two to a niece and nephew for Christmas.  They tell me that it took just minutes to hook up, works as described, and neither has gotten much sleep since.  They are up all night watching Prime movies and series.  Nephew has a high end Android phone that he can use with it.  Niece has iPhone, so I gave her a 7\" Fire HDX with hers and she loves it.  She enjoys mirroring the tablet to the TV screen, and says the features integrate nicely between the tablet and the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Cliff"}, {"rating": 3.0, "review": "Works part of the time.", "verified": true, "helpfulness": "0/0", "author": "Roberta Minkler"}, {"rating": 5.0, "review": "Love my fire tv! Use it all the time and have had no issues with it. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Lilly4467"}]