[{"rating": 5.0, "review": "I like it a lot. I would have one for each TV in my house.", "verified": true, "helpfulness": "0/0", "author": "Alexander Rincón"}, {"rating": 5.0, "review": "this is a must have for people with dumb tv's.  Stream everything right to the tv", "verified": true, "helpfulness": "0/0", "author": "Craig"}, {"rating": 2.0, "review": "I had it for about 3 days before it broke.... Cant really write an opinion.", "verified": true, "helpfulness": "0/0", "author": "pk"}, {"rating": 5.0, "review": "Great item.  Bought for gift. Excellent!", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 3.0, "review": "I didn't have much use for it.My future son in law bought me one for my birthday last year.My TVs have the apps built into them I need, and I have a MMPC where needed.When we first installed it, Google hadn't had their own screen sharing app for it, yet, and the 3rd party apps weren't that great with the samsung and the latest OS upgrades.I went to diddle with the chromecast again, to show my wife some pix off my phone, and found the google finally came out with a beta of a screen sharing and photo sharing app.IT work soo much better than the 3rd party apps.So I bought a 2nd chromecast for our other TV, for the price and with the google screen sharing app, I now have some use for it.", "verified": true, "helpfulness": "0/0", "author": "BK \"Bob\""}, {"rating": 3.0, "review": "Easy to set up but I haven't been able to \"cast\" from my phone... if you know how, let me know", "verified": true, "helpfulness": "0/0", "author": "Jeanne Pepsigirl \"Pepsigirl13\""}, {"rating": 1.0, "review": "Thought i could browse the internet but it has only apps & they aren't great besides Netflix & YouTube which the fire TV stick already has. 😩", "verified": true, "helpfulness": "0/0", "author": "Paris"}, {"rating": 5.0, "review": "I knew what I was getting when I bought it (not a media player, but a way to stream media to my TV), and it has performed above expectations.  I even found that some of the performance issues I experienced (occasional stuttering when a Netflix video starts on my tablet) do not appear when using the Chromecast.  Well done Google.", "verified": true, "helpfulness": "0/0", "author": "Sean Seger"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Ouyang"}, {"rating": 4.0, "review": "Pretty good product I have enjoyed many movies so far", "verified": true, "helpfulness": "0/0", "author": "Chris Finno"}]