[{"rating": 5.0, "review": "We love our chromecast! We have never had another device like this, so I do not have anything to compare it to. However, setup was a breeze and the display is beautiful. Chromecast has enough apps to entertainthe whole family! Love love love it :)", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great if your TV is not a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Tuan Pham"}, {"rating": 2.0, "review": "Easy set-up, great connection.However you need to download all the apps you require to  your phone (tablet, laptop,etc), it also runs off your device, so if I want to watch TV while working on the computer, well something has to give lol! I paid less for my Firestick (I got it when it came out) and prefer it much, much more that the Google Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Chez \"Chez\""}, {"rating": 2.0, "review": "I got this so I could stream movies from my Samsung S6 (whole other set of problems with that though) to an LED projector running off a solar set up while out in the middle of nowhere, i.e. camping, beach parties, etc, but it requires wifi to even screencast which makes this product useless for the reason I got it.  Something Google seems to go out of its way to omit in the product description.I plugged it into my TV at home (where I guess it's going to stay) and it does everything in that regard really well, but am entirely disappointed in that it fails to do what I bought it for.", "verified": true, "helpfulness": "0/0", "author": "Brent T"}, {"rating": 1.0, "review": "On the first day I got it, it usually worked.  When I switched the TV to the Chromecast input, I got an \"Invalid Format\" error on my TV, but if I rebooted the Chromecast device by unplugging and replugging its power, it usually worked after the reboot.However, after a day it pretty consistently started generating \"invalid format\" errors.  I tried a lot of things with it, unplugging the power from the device, unplugging the device from the TV, power-cycling the TV, etc., and after about a half-hour gave up.  We're returning it.", "verified": false, "helpfulness": "0/0", "author": "TJC"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "JOSE MIGUEL PARDO"}, {"rating": 5.0, "review": "Chromecast works great and I would highly recommend it to anyone that doesn't have a smart TV or a PlayStation/Xbox connected to their tv.  It's easy to set up. Supports a lot of services you probably use (youtube, netflix, hulu, HBO go etc)  And it's cheap, which negates some of the negatives I'll now be listing.Negatives:Lacks Amazon Instant Video support (this one is amazon's fault I'm sure as they want you to buy their fire stick)Not really future proof.  From what I've read Chromecast won't be able to handle 4k content.  And with the prices on 4K tvs dropping as much as they are...it won't be long till 4k is the new standard.  Chromecast won't help you there.  But since it's so cheap, it won't feel like a huge waste to have to upgrade in the future.", "verified": true, "helpfulness": "1/1", "author": "George Vazquez"}, {"rating": 5.0, "review": "Makes life so convenient! use this on my iPhone all the time", "verified": false, "helpfulness": "0/0", "author": "RonChamp69"}, {"rating": 5.0, "review": "works great, no more damn wires", "verified": true, "helpfulness": "0/0", "author": "James Chrisman"}]