[{"rating": 4.0, "review": "I thought that this would stream anything from a Bluetooth device but it turns out that only specific apps or the google chrome browser have to be used in order to stream to the tv.  It would be cool to be able to stream anything from the Bluetooth device.", "verified": true, "helpfulness": "0/0", "author": "Brent Nielson"}, {"rating": 5.0, "review": "Great price for a device that solves your streaming needs, the ability to cast content that is already on your computer is great", "verified": true, "helpfulness": "0/0", "author": "nicolas rocha"}, {"rating": 2.0, "review": "I got it but do not know how  to use it. I went to the web and it does not tell me what to do. I was wanted to see deals from the computer as a church service, but it does not do that for me", "verified": true, "helpfulness": "1/3", "author": "James H. Lafon"}, {"rating": 4.0, "review": "Maybe its me but I did have some problems with installation instructions.I sometimes wonder if the people who write instructions ask some one non tech savvy to try the set up before publishing it. Like trying certain  the big companies customer service \"push a number\" to ---------------calls.Apart from the installation concerns its OK", "verified": true, "helpfulness": "0/0", "author": "Dallas viewer"}, {"rating": 5.0, "review": "the chromecast was actually one of the only things that I have been wanting to get since Christmas. Well although it was worth the wait, now that I have been having a blast with it, I really wish I had not had to wait so long to get one!", "verified": true, "helpfulness": "0/0", "author": "R. Schnese"}, {"rating": 5.0, "review": "Excellent device, a must have for every home. Enables video streaming from any device connected to your home wifi network.", "verified": true, "helpfulness": "0/0", "author": "Aleksandar Bilbilov"}, {"rating": 5.0, "review": "Set up is a breeze, Straight forward and easy. I am watching netflix and u tube while running on my treadmill in my gymn room daily.", "verified": true, "helpfulness": "0/0", "author": "Kei-Chuen Lau"}, {"rating": 5.0, "review": "This tiny, low priced little device is amazing. The best part is you can stream YouTube but now it works with Hulu, Netflix, Vudu... more and more coming. I love it!", "verified": false, "helpfulness": "0/0", "author": "Paul Q"}, {"rating": 4.0, "review": "Super quick set up. So easy to use my 4 year old can find her own shows without my help. Not 5 star because sometimes I have to back out of app and reload. Hoping for more apps that work with it.  SO much easier to use the tablet instead of the remote.  Great Price.  Great product. I expect nothing less from google.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I got one for myself as well as my parents as presents and it's just awesome. Their tv had USB ports but wasn't a smart T.V. as much of the T.V's are today. So when I bought them this, they were able to watch their Netflix/Hulu/Youtube videos on their big screen. It was extremely easy to set up and no fuss. It is completely wireless which means less wires to deal with.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]