[{"rating": 2.0, "review": "Pretty fast.  However on random occasions the controls lag. As in a button is pressed and 30 seconds later the string of inputs is processed. 80% works like a charm.", "verified": true, "helpfulness": "0/1", "author": "ponytrack"}, {"rating": 5.0, "review": "Great purchase this is as awesome as my Kindle Paperwhite!", "verified": true, "helpfulness": "0/0", "author": "Lori Searl"}, {"rating": 5.0, "review": "Great device, clean design.", "verified": true, "helpfulness": "0/0", "author": "KrisSam"}, {"rating": 5.0, "review": "Channel after Channel. Your Kindle will love this! Tons of Music!!!", "verified": true, "helpfulness": "0/0", "author": "Joseph G. Villanueva"}, {"rating": 4.0, "review": "Does a good job for what it is.  The ability to use Plex takes care of my local media file access and allows for syncing up with my XBOX.  Cross application search would be a huge plus but for my needs this hits the spot.", "verified": true, "helpfulness": "0/0", "author": "Ivan"}, {"rating": 5.0, "review": "from my kindle to the big screen...love it!", "verified": true, "helpfulness": "0/0", "author": "craig simoni"}, {"rating": 5.0, "review": "Christmas gift to others. They are very happy with the product and ease of use!", "verified": true, "helpfulness": "0/0", "author": "JBD"}, {"rating": 5.0, "review": "Fantastic!  Love this so much!  I have owned other systems and this is so much easier to use & navigate!  You can watch all Amazon Prime shows on it!!  Great!", "verified": true, "helpfulness": "0/0", "author": "David NYC"}, {"rating": 5.0, "review": "I don't typically give 5 star reviews, but I really like this thing.  Picked one up for my brother when it was $99 and then picked one up for myself when it went on sale for $80 from Staples over the holidays.  I find the picture quality is great on both a 32 and 42\" tv and you can load netflix, youtube, and other apps onto it.  I'm still waiting for HBO Go, unfortunately, Comcast is like one of the few (if only) ISP's that will not permit you to use HBO Go with this device (for now).  I have other side-loaded apps that also work great and can vouch that they stream quickly and in good quality as well.  Overall I'm very satisfied with this product and would highly recommend it.  An alternative (if you can wait) is the Slice from Kickstarter, which is a lot like this but has a 1TB hard drive.", "verified": true, "helpfulness": "1/1", "author": "anonymous"}, {"rating": 4.0, "review": "Neat little toy.  Just recently droppedxxfinity, but I seem to watch Netflix over prime....  none of my shows on prime and they all want you to pay a couple dollars an episode to watch if they are on there... very sad", "verified": true, "helpfulness": "0/0", "author": "cory sagnella"}]