[{"rating": 4.0, "review": "This chromecast is very cool! however it is limited to what it can be used on right now. we bought it so we could watch missed episodes of shows on TV however it doesn't work well for that, when you watch it off a website through the internet it stalls a lot. however if you watch stuff from you tube or from Netflix it works awesome! i am very happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "Very easy setup, great picture quality, and it's really convenient to use your phone as remote.  For me, this is taking place of using a gaming console and buying a yearly subscription to stream movies.", "verified": true, "helpfulness": "0/0", "author": "Joshua R. Wilson"}, {"rating": 5.0, "review": "i found out about this through Paul Colligan and was blown away. You connect this to an HDMI port on your TV. Download an app from iTunes Store, and then you can transmit whatever is on your laptop or iPad screen to the TV. I recently attended a weekend of Internet Marketing training and can now see the programs on my 50\" TV.", "verified": true, "helpfulness": "0/0", "author": "James F. Butz \"Jim Butz\""}, {"rating": 5.0, "review": "I am visually impaired sp even my 10 in tab can be a challenge but WOW this thing sends my movies and youtube to the big screen. I use the usb on my tv to keep it powered rather than plugging it in. Love it", "verified": false, "helpfulness": "0/0", "author": "Dejibo"}, {"rating": 5.0, "review": "Very good product and easy to install and use, it still need to receive some apps to add more features but it's incredible how easy it works and how far it can go with just firmware updates from google or custom firmwares", "verified": true, "helpfulness": "0/0", "author": "Gabriel"}, {"rating": 4.0, "review": "Would have given 5 stars if there were applications other than just Youtube and Netflix. Should allow third party applications", "verified": true, "helpfulness": "0/0", "author": "Hassan M Farooqi"}, {"rating": 5.0, "review": "Great buy. I use it to stream all kinds of stuff to the tv. It was easy to install and to use.", "verified": true, "helpfulness": "0/0", "author": "Jorge E Rubi"}, {"rating": 1.0, "review": "When I first received the Chromecast it was great. One of the best products I have ever purchased. The price was cheap as well. Now I am guessing why. After about two months of it working stellar it started having issues. Now it won't play anything. It freezes for any video or google music. I am in the military and I am stationed in Germany. I bought this product and it had no problem shipping out here but now I am told that it is not supported out here so that is my issue. They will not replace it and no refunds. While the person who I spoke to on the help line was really nice and seemed to try to help, nothing was done. No fix actions just basic troubleshooting which I had already tried. Usually Google products are great and they back them up, but I guess not this one. Buyer Beware.", "verified": true, "helpfulness": "1/2", "author": "Joshua Dowd"}, {"rating": 3.0, "review": "Well, as,others have stated, it's not Apple TV.  For the most part, you are just telling the chromecast what to stream. Would be nice to have more services (Amazon Prome, etc) that you could use directly for iPad, but the workaround is not too bad.  I suspect there will be more options with time.  It's worth the money, but not much more.", "verified": true, "helpfulness": "0/0", "author": "eno \"eno\""}, {"rating": 1.0, "review": "First of all, I work in a call center and my job is to making all the network phone switching equipment can talk to it's component parts so I have a little experience with network stuff.  The Chromecast absolutely refused to connect to my home network.  The annoying thing about it is there is no way to manually do this stuff.  Either the software works, or it doesn't. If it doesn't, you can phone google support and they will tell you to get a chrome computer or an android phone or an apple device to connect.  (Since I was using various windows devices, they chose the other stuff.)  I borrowed my neighbor's ipad to try and set it up and it STILL wouldn't work.Am returning my Chromecast, not wasting anymore time trying to get a defective product to work.  Quite disappointed.", "verified": true, "helpfulness": "1/3", "author": "malcolm"}]