[{"rating": 4.0, "review": "If you have netflix, you would be crazy not to get it.  I do enjoy the different streaming options and the fact that you control it with you smartphone or tablet.  I've bought a couple of these and love em.  I'm excited that the API has been opened up and we should soon see more apps that can use the chromecast.", "verified": true, "helpfulness": "0/0", "author": "WhoShotJR \"felixb18\""}, {"rating": 5.0, "review": "we love our new chrome cast! I bought it for my husband not really knowing what it does, but it is the ultimate remote for those who like to use a laptop or tablet while watching TV. The netflix app is a little hard to manage at first but all in all its a great product and I would definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amy Krason"}, {"rating": 5.0, "review": "Love watching netflix on my bedroom tv.  Couldn't do it if it were not for the chromecast.  Would definately recommend.", "verified": true, "helpfulness": "0/0", "author": "michelle bushnell"}, {"rating": 4.0, "review": "Chromecast is the only way HBO allows me to stream to my tv (my HBO provider isn't compatible with my Roku for some stupid reason).  I've since used the device to stream via websites without an embedded Chromecast extension but the signal is really buggy.  If I use HBO, Netflix or YouTube that have the embedded feature, the signal works great.  I hope Google can fix this problem soon.My favorite feature of Chromecast is controlling it from my Galaxy 4 to my television.  I know it's dorky but come on, that's cool!", "verified": true, "helpfulness": "0/0", "author": "Andrea Koder \"Andrea\""}, {"rating": 5.0, "review": "Thinking about replacing a non-smart tv with an expensive new smart tv? Does it have an HDMI Port?This is a superb device for the job. It was easy to configure (with a laptop with a wireless card) and works great. Originally only had netflix, and pandora, but new apps keep coming online every month or so now. I have one in my laptop bag so that I can do presentations and share my chrome tabs with my laptop. Used it to watch netflix or or youtube, it claims to be lockd at 720p but my televisions report that they connect to it at 1080p and everything looks fine.I have had issues on slower internet connections, and older wireless access points. if you have alot of devices on your wireless network you may want to get a second access point dedicated to video streaming so that it can get enough speed and wont drop the connection from your laptop/phone/tablet.The only reason I could see people not liking this if they are not android users, because those are the only mobile devices I am aware of that allow you to send movies to them, but you can use Google chrome on mac os to send stuff from your computer but its not as convenient as using your phone. But for those people you can pay 3 times the price and get an AppleTV", "verified": true, "helpfulness": "0/0", "author": "Witmore"}, {"rating": 4.0, "review": "My Xbox can do nearly everything this can do, but at the low price I figured I'd try it out anyway.Overall it is pretty cool. The only cable is a short USB cable for power, which beats having a giant console or other entertainment box.But both my Xbox (360 and One) and PlayStation can do nearly everything this can do, so if you have any of those you probably don't need this.However, the main selling point for me which can't be done through my Xbox/PlayStation is how you can cast your Chrome browser from your PC/laptop. That sounded really cool, and it is, but the main thing I wanted to do with that feature doesn't work: Streaming HD video.For example, if I want to stream HD episodes of Conan from teamcoco.com (since I don't have TV service to watch it normally), I have to connect an HDMI cable from my laptop to my receiver or TV. My hope was that the Chromecast could allow me to wirelessly do this with much less hassle. But it greatly downscales the resolution and stutters with HD video streaming (even over 802.11ac wireless home network).So that was my big disappointment. But that aside, I do think it is a cool gadget that could be even better if/when they release a Chromecast 2 or simply release firmware improvements. You don't have much to lose either with how cheaply it is priced.", "verified": true, "helpfulness": "0/0", "author": "Vdub"}, {"rating": 4.0, "review": "If you're considering a Chromecast, then I'm sure you know it's features, I like that I can turn my stand alone projector into a portable netflix enabled projector without needing to run a cable from my computer. I wish that it would work with local media better, it doesn't quite do the job of streaming video files, pixels, freezes, and chirpy audio and glitches. Even in the same room with wireless N network with zero internet load. For the price, it's a great product that works well to stream in netflix to a device that wouldn't be able to on it's own. As an experiment, I connected it to a smart TV and did side by side comparison of the innate build in Netflix access of the TV (vizio) and the Chromecast. The Chromecast came in 2nd in terms of video quality the whole time.Still waiting for more apps, better local playback, but for the price it can give any TV, Projector, or monitor with HDMI netflix reliably. For streaming web pages or still content (like slide shows) it works well.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "I bought a bunch of these for my family, and they all like them and use them, and only one family member needed help setting it up. :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We have loved our Chromecast. For people who enjoy watching Netflix / Hulu, this is by far the easiest way I've seen to do it. Before this we were using the Xbox to pull up videos we wanted to watch. That required us waiting for the xbox to boot up, going into the netflix app, then using the xbox controller to search for what we wanted. This way we just pull up the video on our phone and hit the chromecast button. It's that simple. We use it every day to watch shows, movie trailers, or to pull up youtube clips. The only reason I gave it four stars instead of five is that they need to figure out a way to use it on networks with browser authenticated wifi. If they did, we would buy another one just for the times when we're travelling. Unfortunately as it stands, we haven't been able to use it at any of the hotels we have been to because of the browser authentication. Fix that and it will get a resounding five stars from me.", "verified": true, "helpfulness": "0/0", "author": "Jonathan"}, {"rating": 5.0, "review": "Great item!!!! But I wish I could stream my VUDU service with it!!! But still great, especially for the price", "verified": true, "helpfulness": "0/0", "author": "Wendy"}]