[{"rating": 4.0, "review": "Nice piece of work", "verified": true, "helpfulness": "1/1", "author": "har  rawls"}, {"rating": 1.0, "review": "If you purchase ensure that your wifi router is on the compatibility list.This is not listed on the spec list. I've got a 2.4ghz router, but the Chromecast is useless to me until I purchase a router from the Chromecast list of known acceptable routers. Very disappointed.", "verified": true, "helpfulness": "1/1", "author": "Jesse Mace"}, {"rating": 5.0, "review": "Love it love it love it, that's all I have to say.Although I wish I could use it to stream anything from any site - it only works with youtube, netflix, etc. Anything else is too choppy/laggy", "verified": true, "helpfulness": "1/1", "author": "Charlotte I."}, {"rating": 3.0, "review": "Great Internet streaming device. I hope it support more apps", "verified": true, "helpfulness": "0/0", "author": "ruimin zhang"}, {"rating": 5.0, "review": "LOVE chromecast!!!", "verified": true, "helpfulness": "0/0", "author": "sharon phelan"}, {"rating": 5.0, "review": "As promised", "verified": true, "helpfulness": "0/0", "author": "Mark Stephenson"}, {"rating": 2.0, "review": "It's ok. You must to have home wifi to use it. Not that good.", "verified": true, "helpfulness": "0/0", "author": "Carlos A. Castro \"andres\""}, {"rating": 5.0, "review": "I don't know why I waited so long to get one of these.  Love it!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "It does not work from my computer or tablet as claimed.  However, it was set up from my grandson's phone with ease.  Sadly, he does not live with me so I will not be able to enjoy it as originally thought.", "verified": true, "helpfulness": "0/0", "author": "DIANA SERNA"}, {"rating": 5.0, "review": "Bought them as Xmas Gifts... the peopel I did buy them for seemed to be excited to go home and try them out...I too got one from a friend for Xmas also.. hookup was kinda simple...but works great..loved it since I do not have a Smart TV...and easier then having to go thru my BluRay palyer..and quicker too ...", "verified": true, "helpfulness": "0/0", "author": "Michael J. Paglia"}]