[{"rating": 5.0, "review": "This was extremely easy to connect to your TV. All cables and connections you need are provided. This picture quality is great. So easy to operate. I used my Ipad2 and it is just perfect and so affordable!! You will love it. You can go the You Tube right from your device like my Ipad2 and hit a button and voila you are watching it in your television. You can still search and open other screens while your Chromecast is playing.This is the best for only $35!!!", "verified": true, "helpfulness": "2/3", "author": "Gpvegas"}, {"rating": 5.0, "review": "So I've had Google Chromecast for a few days now. I ordered it the day it became available on Amazon. I've used it nearly every day since streaming both YouTube and Netflix, with no problems what so ever. The quality of the video is great, as good as Netflix is when using any other device.Setup is a bit wonky, as the instructions don't make things very clear. But the setup problems are very short lived as once that's done, watching is super easy and reliable.I connected mine to an hdmi port on the back of my receiver using the supplied hdmi extension. Mine wouldn't power up using hdmi power even though my reciever is 1.4 spec, but that's no problem, I don't mind using the included power adapter.I was actually quite pleased with how well YouTube works with the Chromecast, very quick and very responsive. It's clear that Chromecast works to make sure the video quality is as good as it can be.I'm quite excited to see what applications come to Chromecast in the future.", "verified": true, "helpfulness": "3/4", "author": "Eric Walton"}, {"rating": 4.0, "review": "This device works as expected. I have not as of this moment streamed Netflix via the \"proper\" ways using the Android app or the \"Cast\" button on the site. I am pretty sure they will work as directed.Tab streaming is very good and is not choppy, unless you minimize it/move the mouse around, especially when streaming a local file to the screen. Website streaming is good, although laggy, it does the job.HOWEVER here is where it gets really bad: Streaming a local file REQUIRES internet to get the stream starting which is insanely stupid. Here is what I did:(With Internet)1) Drag and Drop a video file to Chrome. Let it play.2) Cast it3) Disconnect internetIt worked fine without internet. However when I stopped it and tried to stream a new file (this time a music file) it refused to work. It showed a black screen but that was it.I would like to see a better update to this. This is horrible.I will come back with updates as to if it streams a local web page without internet.However, if you want a simple netflix only experience, this is perfect. It goes without saying that it requires a cellphone but that is a given.", "verified": true, "helpfulness": "2/2", "author": "sayrith"}, {"rating": 4.0, "review": "I really enjoy having this, it's fun to have friends around and all of us adding to the youtube video queue or picking out something on Netflix.This device works wonderfully with android phones and tablets, i've tried both.Where this thing falls short is the casting of tabs on your Chrome browser on your computer. The quality is simply terrible even on the lowest settings. The audio stutters and the video is rubbish.I had to call Google about this so i'll make a note here for everyone that wants to buy one: It only works with devices connected to your wireless network! If your desktop is hard wired into your home, you will not be able to use chromecast. Wifi only!", "verified": true, "helpfulness": "4/5", "author": "Preston V."}, {"rating": 5.0, "review": "Easy to set up, simple to use, and it looks great when I have it take over the video from my tablet. I often see my kids huddled around a tablet watching things. No more of that. At the cost Google is selling it I can't see why anyone wouldn't buy one.", "verified": true, "helpfulness": "2/3", "author": "M. Lewis \"EnckePan\""}, {"rating": 4.0, "review": "My 4-star review (subject to change) is based on the fact that the Chromecast, in a year's time, could be an amazing fully functional value at $35.  But that all depends on what type of app support and additional functionality they build into.  As an early adopter, I'm not disappointed, but it's not quite an elite device right out of the box, either.The important thing to recognize about the Chromecast is that streams independently from your WiFi connection, but is controlled by another device (PC, Mac, iPhone, Android, etc.) on that WiFi network.  That's both good and bad.The good is that streaming on something like Netflix seems to go extremely well once you get it started up.  You're also free to close the app and do other things on your phone, even if you used the app to start the video.The bad side of the design choice they made is that there isn't any real \"remote\" for the Chromecast itself.  Android and Apple may offer one soon (much like the Apple TV \"Remote\" app), but at launch, none is available.  This can make navigating content a little clumsy.  It's best done with a smartphone running a supported app, but the only supported apps are YouTube, Netflix, and Google Play, which is a woefully underpowered lineup.Of course, you do have the ability to stream from the tab on your Google Browser, BUT, it needs to be a laptop or other computer on the WiFi network.  For most, this will probably be the case, but our house computer is a wired desktop, so no go.  I expect this device to improve a ton in the near future, and if it does, it's a great addition to the marketplace.  But it's definitely more of a \"secondary\" TV device compared to full-function boxes like AppleTV and Roku.", "verified": false, "helpfulness": "3/4", "author": "StormJH1"}, {"rating": 1.0, "review": "I made an impulse buy, even if I could get the device to connect, it appears to have no function that I do not have already have covered on my roku, blueray or smart tv. The tech support is a bunch of untrained newbies who could at least be polite and helpful but are short and rude. It was only $35 but quite frankly useless. I have never returned anything to Amazon, but there is always a first time, and the Chromecast is it. As recently is the case with Google, way too little, way to late.", "verified": true, "helpfulness": "9/42", "author": "James Fenton"}, {"rating": 5.0, "review": "If you are wondering if it works to stream the Spotify web player from a Chrome tab to the Chromecast, it does.  Tried it last night, and it works amazingly well.  Just open Spotify ([...] in a browser tab, click the Cast button, and you can play any song you want on your TV for free.  That alone is worth the $35 to me.  I don't have a nice sound system, but I would imagine if you did have a nice one, this setup would be pretty awesome.", "verified": false, "helpfulness": "7/9", "author": "caseyisajim"}, {"rating": 5.0, "review": "I just received my Chromecast, purchased directly from Google, yesterday.  Here are a few things I've noted:-Packaging...it's a very slick box that comes with the necessary components.  The package seemed to be completely recyclable, which I liked...though it is sometimes hard to just discard something like this box which looks so nice and useful.  Darn you, Apple, for this trend of making packaging prettier than the product.-It came with a USB power brick that is horizontally oriented, which I find to be the best use of space on an outlet.  It only sticks out about an inch from whatever outlet it is put in.-The TV I'm using it on has the HDMI port on the back, and the device itself stuck out about 2.5 inches.  This TV is on an articulating arm, so that's not an issue, though it could have been if it was wall mounted.  A 3 inch or so HDMI extension cable is included to get around this issue.-I initially tried setting it up on my Droid Bionic.  It warned me that I was not using an approved operating system (Android 4.1.2 ??), but I went ahead and attempted.  It had me connect the phone to the chromecast SSID, and when I switched back to the browser, it tried to reload and had no connection...I no longer had the button to click on to move forward.  So I switched over to my laptop running Linux Mint 15.  Again the message regarding having an unapproved operating system, but the setup worked fine through Chrome on that laptop.  Within seconds, I was streaming youtube using the Chromecast Tab extension.-I called in my daughter with her iPod Touch (5th generation), and she pulled up the Netflix app (which she already had running...it's ALWAYS running).  It had the Chromcast button, but the app was frozen.  She switched over to the Youtube app, and right away was able to stream from there (Nyan Cat, much to my chagrin).  After rebooting her iPod, the Netflix app worked fine as well.  We watched an episode of Psych while fixing dinner (this is on the Kitchen TV).-After that, my son got the Chromecast plugin installed in Chrome on his desktop (which is hardwired to the network...some reviews have stated that only devices on WiFi will work...I'm not sure why this would the case...the Chromecast should have no way of knowing if a device is on WiFi or Ethernet, just that they are on the same subnet).  His streaming worked fine...however this set up a battle of devices between him and my daughter...Adele would suddenly be replaced by a colorful snippet of Samuel L. Jackson delivering one of his signature lines.  Ahh, teenagers.-The last thing I tried was bringing up a browser based webcam app on my laptop, and using the Chromcast Tab plugin to broadcast my face into the kitchen.  That worked fine, and resulted in some \"WTF\" moments for those passing through.All in all, I'm very pleased with the purchase, and will probably be purchasing additional units for the other TVs in the house.  We have other devices that have Netflix, Youtube, Amazon, etc. embedded, but have sometimes reverted to using the laptop connected with HDMI because the web based searching interface is so much better, or the device has decided that it needs to update its software...which means a 20 minute wait before you can get to your content.  This will shortcut that process.  I'm a little disappointed with my Droid Bionic not working (the button in the Youtube app is not showing up)...but honestly I didn't give it much of a try, so it didn't affect my feeling that this is 5 stars (it would probably be 4.5 if they allowed that).", "verified": false, "helpfulness": "6/8", "author": "James Wright"}, {"rating": 5.0, "review": "I'm using this product with my old nexus 7 and my nexus 4 and I can tell you that it works great.Netflix and youtube streaming quality is seamless.You won't find by far a better product at this price range.", "verified": true, "helpfulness": "0/0", "author": "M. A. Ganon \"Mr. M\""}]