[{"rating": 4.0, "review": "Wonderful device. Simplifies getting internet content onto your TV. Many devices can link to it with more to come.Buy one!", "verified": true, "helpfulness": "0/1", "author": "James A Hand"}, {"rating": 3.0, "review": "Does not work correctly using an iPhone 5 running IOS 7.0.4 and Netflix 5.1 as of 12-17-13.  Google says they are aware of the problem and their engineers are looking for a fix.  Youtube works great.  I bought it specifically for Netflix, so it was a disappointment.", "verified": true, "helpfulness": "0/1", "author": "John"}, {"rating": 5.0, "review": "So far so good.  It works for youtube and Netflix for now.  It fit well in my smart TV.  Luckily, my smart phone had one HDMI and USB port next to each other.  Connected Chromecast in HDMI and powered it through the USB port.My smart TV does have both youtube and netflix.  Smart TVs are still not smart enough when it comes to typing in the search box.  But having the chromecast is very convenient to send what I am watching on my cellphone to the TV.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Jey\""}, {"rating": 4.0, "review": "I absolutely love this product.  Google has really outdone themselves with this.  Hopefully, they will add more apps to the direct stream as this is the best way to view (for NFL Sunday Ticket perhaps???).  So far I've used it to direct stream Netflix and YouTube.  The non-direct stream option is a little sketchy sometimes with quality.", "verified": true, "helpfulness": "0/0", "author": "schradsd"}, {"rating": 4.0, "review": "This is great for streaming youtube videos to the TV, but seems limited. I would like to be able to control the device with the tablet/phone version of Chrome.", "verified": true, "helpfulness": "0/0", "author": "Michael Hetland"}, {"rating": 5.0, "review": "First off, I can't say enough good things about this product! The price point is unbeatable, the ease of use is unmatched and it just works.Pros:Small (about the size of a standard thumb drive)CheapEasy to useWorks like it shouldCons:Set up can be slightly challenging for the \"older folk\"", "verified": true, "helpfulness": "0/0", "author": "GJM"}, {"rating": 4.0, "review": "A little confusing at first, but ultimately great for Netflix viewing. I would highly recommend this product to a friend", "verified": true, "helpfulness": "0/0", "author": "cheryl caliendo pecaut"}, {"rating": 3.0, "review": "This sounds like a great addition to the home entertainment system. Its not so easy to use without going online to see how it works. I could play movies from my laptop after I found out how but video stuttered and not watchable. I have not used the Netflix function I use my Blueray for that. I still have not taken the time to look up and figure out how to use this from my cell phone.!2/17/13 Update  After playing around and reducing the settings to 720 the video transfer was much better and I did get the Netflix to play from my Galaxy phone and was very satisfied with the quality. The Netflix does allow you to turn on subtitles for the movies.", "verified": true, "helpfulness": "0/1", "author": "R. Wilson"}, {"rating": 5.0, "review": "This is awesome! Everything for this devices plugs in through my TV. further more, I discovered that it puts out better picture quality on netflix that the built in app does on my SMART TV", "verified": true, "helpfulness": "1/1", "author": "MildGamer"}, {"rating": 4.0, "review": "Pros: If you research this item and buy it for what it's meant to be, then you won't be disappointed. I think most of the bad reviews here are from people not understanding the purpose of this item or having unrealistic expectations. I actually like the tablet or phone as a remote concept, although when I'm watching a series it is annoying that there is no auto-play of the next episode. Either way, I am very excited to see what Google comes up with next. It's hard to believe how much they were able to cram on a small thumb-drive sized device. Also, as a Roku user and DirecTV customer, this device enabled me to watch HBO Go on my TV.Cons: The developers for the software for the Chromecast need some serious help with their software change management process. This last update was a disaster and for a lot of users either made their Chromecast un-bootable or crippled their ability to cast Netflix. There are work-arounds to fix both (albeit temporarily), but if you're not an advanced user you would be dead in the water. As I mentioned before, no auto-play of the next episode of a series is also somewhat annoying.Bottom Line: I paid $25, so I feel like I got my money's worth, so I'm willing to be patient to see where Google goes with this item.", "verified": true, "helpfulness": "0/0", "author": "AggieJohn2003"}]