[{"rating": 5.0, "review": "I previously used my wii to run netflix.  It was difficault to use and I was only able to use it on wifi.  When I got the Fire TV, it was incredibly easy to set up and it has a port so that I don't have to use wifi.  This way if wifi is down I can still watch TV.  I was impressed by how easily the voice search worked.  It is easy to navigate the different apps and find what I am looking for.", "verified": true, "helpfulness": "0/1", "author": "Jessica Martin"}, {"rating": 4.0, "review": "I am waiting for HBO Go, PBS and other apps to become available. Otherwise, it is easy to use and opens up Prime Video and the search feature is great.", "verified": true, "helpfulness": "1/2", "author": "Joe Wiedenmeier"}, {"rating": 2.0, "review": "I am an amazon prime member and I don't want to spend money renting movies. I just want to enjoy the free movies that members can watch.Roku, in its amazon app, displays a lot more free options than amazon fire tv. I am still comparing the two but, unfortunately, I think Fire tv will go back to the store", "verified": false, "helpfulness": "4/6", "author": "Alejandro Villasante"}, {"rating": 2.0, "review": "There is no web browser , no voice search in apps, and no keyboard for easy text searches. Samsung's blu-ray player with internet apps is better.", "verified": true, "helpfulness": "6/7", "author": "Marjorie Hill"}, {"rating": 3.0, "review": "It works Ok except I frequently have to unplug HDMI cable and reconnect to restore audio. Once on, it stays on until next time I start it up. Amazon videos are better to navigate than with Amazon app on my Google TV Box.", "verified": true, "helpfulness": "0/1", "author": "Henrik B. Rasmussen \"Rik\""}, {"rating": 3.0, "review": "Voice search should work throughout all apps.  It only works with Amazon titles.  A little deceptive as advertised and not useful at all for finding content to watch from Hulu, Netflix, etc.  Roku has more apps.", "verified": true, "helpfulness": "2/2", "author": "Will"}, {"rating": 5.0, "review": "There have been some mixed reviews but I love it. It's simple and works. I would recommend it to anyone.", "verified": true, "helpfulness": "0/1", "author": "Cloud"}, {"rating": 5.0, "review": "It does everything advertised plus a lot more. By side loading programs you can make this little box into  a great addon for you tv", "verified": true, "helpfulness": "0/0", "author": "Wilbur Shinholser"}, {"rating": 5.0, "review": "Bought this on impulse, as my Kindle's battery is dying, and had been contemplating replacing it.Pros: Beautiful picture, looks equally sharp on my 29\" desktop 1080 tv and on the neighbor's 50\" 1080 (tried it just to see, and for bragging rights over their Roku). The remote is very easy to use (voice search works very well). No latency, no digital artifacts (using LAN, not wireless). Accessed all of my previous Kindle video history and added it to my playlist automatically. Like that it can access Netflix and the other services. Fun to invite friends over to share their subscriptions. Not a gamer, so nothing to add there.Cons: Nothing so far, other than it's a little hard to separate the Prime \"free\" streaming from the rentals - another menu row to add, maybe?I like that the platform looks open to add new features (email and web access? Keyboard and mouse control? Stream from my Windows Home Server?). Hope so.", "verified": true, "helpfulness": "0/0", "author": "pasound"}, {"rating": 5.0, "review": "Voice search is so good.  Easy to install and use.  It is great!  I bought first day because I was considering a similar device and my success with my Kindle Fire I was sure it was going to be great and I was not disappointed.", "verified": true, "helpfulness": "0/0", "author": "Chuck Meadors \"Chuck Meadors\""}]