[{"rating": 4.0, "review": "The Fire TV us the best unit I have used to date. If voice search would include apps like Plex, it would be a total 5 star rating.", "verified": true, "helpfulness": "0/0", "author": "Mike West"}, {"rating": 5.0, "review": "Since I joined the 'cut the cord' crowd (bye-bye satellite), I wanted something to enhance my viewing of broadcast TV ... I did the research and the Amazon Fire won ... Yes, the voice recognition thing works :) ... yes, there are apps for it :) ... add a Prime membership and you have more viewing than imaginable ... don't let your well-meaning but uninformed friends tell you different - purchase the Amazon Fire ... you will not be sorry", "verified": true, "helpfulness": "0/0", "author": "GoldyFish"}, {"rating": 5.0, "review": "I love the user experience and interface..Easy to set up and works well...Highly recommend it. Good value at the right price.", "verified": true, "helpfulness": "0/0", "author": "Suresh V Shenoy"}, {"rating": 5.0, "review": "Received the fire tv as a gift easy to set up and it is nice to see all the things that it has to offer .", "verified": true, "helpfulness": "0/0", "author": "Mark Doty"}, {"rating": 2.0, "review": "Interface needs a lot of work. Why on earth would the voice search function only work for PrimeTV (which I am a member). It's so annoying when you are in Netflix and try to use voice search and it takes you OUT of Netflix to show me things on Prime. Another thing, JUST SHOW ME THE SHOWS/MOVIES I CAN WATCH FOR FREE AS A PRIME MEMBER!!!. Nothing more annoying than searching, finding what you are looking for, clicking on it excited and finding out you need to pay $3.99 to watch the dang thing. Also the aspect ratio on some netflix programs is strange. No HBOGO?!?!?!? Much prefer our AppleTV but the fire will do in another room.", "verified": true, "helpfulness": "3/5", "author": "Andrew Morrison"}, {"rating": 5.0, "review": "PROS: Simple user interface.fast processorsimple remotenever buffers videoCONS: voice search only works with Amazon Prime programmingOverall, very good purchase. i may buy another one to replace my super slow Smart BluRay player in my bedroom.If you're looking for reliable platform to stream video, this is it.", "verified": true, "helpfulness": "0/0", "author": "ryantee"}, {"rating": 2.0, "review": "I'm a Soldier stationed in South Korea. I bought the Fire TV on the day it was released, which was a week before I left for Korea. I bought it thinking that I would be able to utilize my Amazon Prime account and stream movies while I was in Korea for a year, but, it doesn't work outside of the U.S.! Now it's nothing more than a fancy paperweight on my desk. Had I known that before I purchased it, I never would have wasted my money!", "verified": true, "helpfulness": "4/6", "author": "Stephen Lee"}, {"rating": 4.0, "review": "Had this for 2 weeks now and I am very happy with it. For the price of 1 month of my other provider i bought the fire and saved 25 bucks.Very,very,very easy set-up and so far have had no issues with the streaming. Voice search is excellent..Good buy and I have recommended it to everyone else I know.. Drop those satellites and get this box. Well worth the money..", "verified": true, "helpfulness": "0/0", "author": "jj vegas"}, {"rating": 4.0, "review": "onlything missing vudu.rental movies too expensive/product works as described.apps easy to install.all amazon products work excellent.have 4 kindles/no problems./excellent selection books.", "verified": true, "helpfulness": "0/1", "author": "danny j."}, {"rating": 5.0, "review": "I had Google TV for about a year and a half previous to getting Amazon fire. This is a lot easier to use. The menus work seamless, no lags. No need to keep logging in to apps. Apps don't crash. Streaming has very little if an buffering. Just a much better system I am totally happy with it. The speech search app works very well also.", "verified": true, "helpfulness": "0/0", "author": "Don DeFlavis"}]