[{"rating": 5.0, "review": "Best investment for the money you can buy with everything you need at your fingertip, and voice command is great!", "verified": true, "helpfulness": "0/0", "author": "Gerry"}, {"rating": 5.0, "review": "At first I was a bit skeptical about the FireTV and that it's just another box to watch Netflix on, that was before my friend showed me what the box is capable of. The fact that it's able run XBMC smoother than the Apple TV and is able run apps alone raised my curiousity. The voice searching and the ability to watch Prime content and be able to use other services natively without much configuration is what sold me to buy it right away. My only regret is that I should have been a little more patient and wait until the Cyber Monday sale to get the savings, but I think for the original price it does everything plus a bit more of what other boxes does.", "verified": true, "helpfulness": "0/0", "author": "Sagar Shah"}, {"rating": 4.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Thomas G Lausman"}, {"rating": 5.0, "review": "Ease of installation plus the simplicity of operation excelled", "verified": true, "helpfulness": "0/0", "author": "Ronald Maybell"}, {"rating": 4.0, "review": "Great system. Simple to operate,  high quality.", "verified": true, "helpfulness": "0/0", "author": "Will"}, {"rating": 5.0, "review": "Love it, very easy to setup and use. Voice search is awesome!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is like steroids for your TV. I'd give it 17-stars if I could. Very easy to set up, fun to use. This is a home run.....", "verified": true, "helpfulness": "0/0", "author": "Randy Harmon"}, {"rating": 5.0, "review": "Great! High depth, excellent quality.", "verified": true, "helpfulness": "0/1", "author": "Edgar L. Simons \"edgar525\""}, {"rating": 5.0, "review": "This device will save you $$$$$$$$", "verified": true, "helpfulness": "0/0", "author": "Allnavy"}, {"rating": 5.0, "review": "I should have paid extra for a 32 inch LED smart TV for our bedroom but the Amazon Fire TV makes our existing Samsung even smarter. Further I can take it with me when we head for Florida.", "verified": true, "helpfulness": "0/0", "author": "Joseph D. Ciancarelli"}]