[{"rating": 2.0, "review": "Just received my FireTV today. It has some flaws and is not quite ready for prime-time.When I first turned it on, it took ages to update the software. Then the audio squealed really bad on every channel. It was painful to listen to.Unplugging the unit and plugging it back in made the audio problem go away. Unfortunately, that audio problem made for a very bad first impression!After using the device for a few hours:Pros:The responsiveness of the user interface is fantastic.The physical product design is very beautiful, especially the remote. The remote feels very nice to the touch and fits well in your hand.The games are very impressive for a set-top box.Cons:The device refuses to stream HD video, maybe the network has been congested for the past few hours?The video quality is very noticeably worse than the Roku.The voice search only working with Amazon content limits its utility very significantly. Also, the big brother aspect is very creepy.Unfortunately, overall this product is a dud. I will be returning the FireTV and purchase another Roku. The Roku it is a much better product.", "verified": true, "helpfulness": "5/22", "author": "Michael McGarry"}, {"rating": 5.0, "review": "It looks like the TV accessory to buy. A pretty high end, well supported  anything streamer/gamer android/web box. Unless you are already invested in something I think the choice is clear. This is what to do with your spare HDMI port.", "verified": true, "helpfulness": "4/5", "author": "James F. Rendek"}, {"rating": 4.0, "review": "First I will say I have been a long time Roku user, have had multiple of every generation. If the Roku 3 were not available then the Fire TV would get 5 stars, but with the Roku 3 being almost as fast this is a tighter fight. The Fire is FAST! If plays immediately and buffers lightning fast. If you fast forward it play immediately in HD quality right away. I am sure Amazon tweaks the Fire and Prime to work hand in hard. The voice search is nice, but it has issues. I have Prime and Netflix and the voice search seems to find many things on either. I voice searched House Of Cards and it found it. I searched Orange Is The Black and it brought up House Of Cards.Coming from a Roku the interface requires a learning curve due to some quirky navigation decisions. If you search a multiple season show it seems to find a random season, then you have to click up and left to highlight Seasons and then can scroll multiple seasons. The bad news is unlike Roku where when you hit the end it wraps back around, the Fire TV just dead ends and you have to reverse scroll. Also since the navigation is not as initiative as Roku it is easier to wander off your desired screens and have to back track.It is obvious Amazon did read the comments on their competition as you can see some of the things they did that are common complaints about the competition. The device is heavy, clearly to make sure it does not flop around like the Roku 2. It boots fast and plays fast. Roku 3 is still slow to boot. The remote is targeting Apple TV users and iPod users.All in all this is a nice device. I can see it as a good alternative to Apple TV and Chromecast, but I do NOT see this displacing my Roku. I love competition because is suspect this will push Roku to make the Roku 4 faster and possible offer voice search. If you do not have a streaming device I say Roku is still king, but this would be the Queen. I am not an Apple TV fan as it is too old, slow and limited. Chromecast is good if you always have your smartphone or tablet around to drive it. I do have a Chromecast as well, but only use it as a quick device to throw some You Tube videos to.It will be interesting to see how many added apps (channels) get added. Fire TV does have the one niche as a low,end gaming device as well which when more channels and apps become available. I suspect Amazon is here to stay, the 800 pound gorilla in the room is still Apple, if they ever make their TV strategy clear.Update 1:After 2 days of playing with the Fire TV I think my impression is fading. Sure it is lightning fast, but the quirky navigation design choices and lack of apps has me leaning toward sending it back. Picture is great, but content is king and while I can play all my Netflix and Prime content my Roku has tons of channels I use that are currently not yet available on Fire and who knows if and when they will be. Like I previously mentioned, the good thing about the Fire is it has raised the bar and thus makes me eager to see how Roku responds when the Roku 4 eventually is released. Not being an Apple ecosystem person I do not care what Apple eventually releases, other than it will have a major impact on the competition.Update 2:OK have had it over a week now and the luster is wearing off. The Fire my have the slightest of an edge over Roku 3 for picture quality, but going back and forth on same content I may be splitting hairs. I use about a dozen Roku Channels and basically on Fire I have just Netflix and Prime videos. Also the darn UI is frustrating. Some say it is nicer than the Roku, but I think it is because it appears nicer and more modern, while the Roku is more simplistic. I'll take simplistic and functional over pretty and quirky any day. I will give it a few more days, but I was leaning on keeping it as a hobby, but may just send it back since I find myslef going back to the Roku almost every time.", "verified": true, "helpfulness": "1/3", "author": "KeithL \"HDKeithInGA\""}, {"rating": 4.0, "review": "I own this device:  After I bought this, and before it arrived I made a mental plan to really lay on the praise - but it did not take long to dent my enthusiasm. The home screen and interface makes it much more difficult to find what I want -  than any other device I own.Pro'sFast and responsive hardware.Simple and fast setupVoice search works well - but only if you are looking for Amazon contentRemote is not IR so the device can sit out of the way...Has a wired connection - very important to me.Will likely encourage me to use more included prime contentPerhaps a good root will come along and utilize the hardware without exerting control over the userPlex on the Fire TV is superior to Plex on the Roku  - I have lots of very high bit rate content that Plex on the Roku stalls on (some wont even start) (the Roku Media player plays most of it, but not all - so it is not the all the Roku's fault.)Plex on the Fire TV does not choke at all on any of the high bit rate content.(all of my media clients are wired gigabit) - I have the Fire TV Plex app set to maximum bit rate, the Roku sets are not full-bit rate, they can't handle it.Con'sWay too Amazon centric.very limited applications - hopefully that will change soonHome screen is a major disappointment. Amazon way or the highway - let me layout my home-screen exactly the way I want (and keep it that way), not what Amazon wants.  Amazon content is a significant part of the home screen.Voice search only works for Amazon contentRemote is not all that comfortable - sharp corner hits my palm annoyingly, and it is not thick enough for my preference.The remote lay-out is just OK. Remote is not as nice as some others  Way better than a WDTV remote, but not as good as a RokuNo DLNA - but PLEX on FireTV is way better than Plex on Roku.Other thoughts:  If DLNA is implemented, I'm guessing it will likely be limited to very few file types. (99.9 percent of my home titles are h.264 - which will likely be supported.It won't be replacing any of my other devices anytime soon - not sure how much use it will get - until things change.Why 4 stars?I love the hardware - performance counts a lot to me.i'm hopeful the other things will get fixed.About me:My home media setup consists of. 3x PS3's, 5x Roku 3's, 2x Roku XS, 2x HTPC, Thousands of titles on 3 DLNA servers (Synology, Xpenology (running Plex) & Nas4Free), 2x Windows home server's, 3 WDTV (they play more file types than Roku or PS3 so they still have a place on my network). 1 XBMC R-PI. The clients are connected to 7 TV's from small to very large. Gigabit ethernet everywhere - only my mobile devices run wirelessly. Multiple Gigabit switches in place, 4 Routers and 3 wireless networks.I bought the Roku's to augment the PS3's and WDTV's, and they do a nice job of it and are usually used instead of the others.Overall, I'm much less enthused about the Fire TV than I thought I would be - I really wanted to like this - because I'm a hardware junkie.(but still hopeful things will get smoothed out).", "verified": true, "helpfulness": "2/5", "author": "Amazon Customer \"Express\""}, {"rating": 2.0, "review": "Cons:Watch ESPN only works with very limited list of providers not all partners.No way (that I could find) to skip the introductory ad (er tutorial).Voice search only works with Amazon. This needs to be stated more clearly as it is one of the primary advertised features.Pros:Nice hardware.I was very disappointed and I thought the main features listed by Amazon such as the watch ESPN would have at least been made to work correctly and not be the repackaged Android app with no improvements. For some reason I also had it in my mind that voice search was the interface for everything on the device, not just for the Amazon app. I will give four stars to the hardware and packaging, but I am returning this product. I'm sad that I wasted my time.", "verified": true, "helpfulness": "3/7", "author": "David J. Earls"}, {"rating": 5.0, "review": "I've bought a lot of alternatives: dev boards like rspi berry, beaglebone black..., apple tv, chromecast... but none of them is as decent and reasonable priced as Fire TV. I certainly like this thang!", "verified": true, "helpfulness": "3/4", "author": "suzker"}, {"rating": 5.0, "review": "What's with the complaining that it had to download an update.  I liked that all my prime content was there.  People really want everything just handed to them.  It took 30 minutes for me to connect with all my content online and connect to all my accounts.  That is nothing.  On the player itself great connection but I have a netgear nighthawk.  Not everything is Amazons fault.  Very quick loads on apps and content.  Flixter gives me access to all my ultraviolet purchases and yes the box wants you to buy from amazon which I might be doing a lot more with how easy it is.  Now to see what happens with the NFL this year.", "verified": true, "helpfulness": "1/2", "author": "B. Clair"}, {"rating": 5.0, "review": "I don't understand why people is giving the Amazon Fire TV only one star, actually I do understand: selfishness, jealousy, and ignorance. Most of the one star reviews are because Fire TV doesn't have HBO GO, it is $100, or because it is made by the greediest corporation of all times AMAZON!I've been cable free for almost a year, so that means I don't have access to HBO hence I don't have access to HBO GO. Since I'm not paying for cable or HBO I'm saving like $100 a month, so I was able to spend $100 on this nice little piece of equipment. Amazon is the greediest corporation in the entire world, they only care about profit, their customer service is the worst, so basically I just bought the Fire TV so I can  give an accurate review of an item that I actually own.What can I say? The Fire TV is great! It's really easy to install, it doesn't come with a huge book for instructions because you don't need any, if you can turn on a computer and you are reading this review, then you can use Fire TV. The menus are smooth and easy to use. I have 6 years old daughter and her first impression was: WOOOW! And then she asked me: \"Are we going to keep it?\" Even tough I just bought for reviews purposes, by my daughter's request, this one is a keeper.I bought a Chromecast a few months ago but I ended up selling it since I own another piece of junk made by Amazon called Kindle Fire HDX (which by the way I bought for reviews purposes only, 5 stars). The Chromecast is great but once Amazon sets your tentacles on you, you are doom, there is no going back. As you may know Chromecast doesn't work with the Kindle fire so that one wasn't a keeper. On the other hand Fire TV integrates perfectly with my Kindle Fire, no set up required.English is my second language, that being said I have a thick Hispanic accent, Fire TV doesn't think that way. Everything I said, Fire TV understands, no questions ask.Now seriously, Amazon is great! Their customer service is the best, and every single item they made is awesome! Roku is great and cheaper, but almost everything I own has been bought via Amazon. I like the Amazon environment, their cloud, their customer service. So please do yourself a favor, if you like Amazon you will love this product. Don't waste your time with the one star reviews, read the review of people who actually own a Fire TV.", "verified": true, "helpfulness": "7/8", "author": "Webo"}, {"rating": 5.0, "review": "Works like a charm. I have it in the bedroom and my computer and router re in the living room streaming is seamless.", "verified": true, "helpfulness": "2/3", "author": "Caarol A. Overbey \"Home cook\""}, {"rating": 5.0, "review": "The Amazon Fire TV is what I hoped it would be.1.  YouTube support2.  Picture is great3.  Setup is 5 minutes for it to patch4.  remote control is simple and intuitive, and has a snappy responseAs a bonus5.  The voice recognition works great.  This was a surprise.I have the game controller coming, just for fun, and who knows maybe Sev Zero is fun. ﻿", "verified": true, "helpfulness": "4/5", "author": "Jeff M"}]