[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Larry Strickland"}, {"rating": 3.0, "review": "For netflix and other providers that have a native application it is great. If you are trying to watch content through a providers portal say abc/nbc/fx or anything that may have their own watch it on their site content without a google appstore app... it hasnt been all that great - pixelation, chopping...I was hoping to cut the cord and use this along with an hd antenna... but the tech isnt there yet for an easy passive watching experience.  As more people use these devices maybe more chromecast applications will be available for the bigger networks, but for now the cord is intact.", "verified": true, "helpfulness": "0/0", "author": "gary b kelly"}, {"rating": 5.0, "review": "WOW! I scored this when it was on sale recently, and now I'm getting ready to buy a couple more, plus some as Christmas presents! This thing immediately transformed my several-year-old LCD into a smart TV, and couldn't be any easier to set up and use. Even if there isn't a specific App for something, whatever is on your screen can be cast to the TV. Now I can bring up Xfinity TV Go on my phone, and watch shows in the bedroom where I don't have a digital cable box or a newer smart TV. This thing rocks, and belongs in every TV in the house! Since you can name each one, it's simple to cast to the correct device in the applicable room.", "verified": true, "helpfulness": "0/0", "author": "Biff Wellington"}, {"rating": 5.0, "review": "Still in Beta, but works fine.", "verified": true, "helpfulness": "0/0", "author": "Samuel Web"}, {"rating": 5.0, "review": "Works great! With more and more apps supporting Chromecast, this is a no-brainer.", "verified": true, "helpfulness": "1/1", "author": "The Dap"}, {"rating": 5.0, "review": "we use it all the time.  I bought a second one for another TV.", "verified": true, "helpfulness": "0/0", "author": "Thomas Daly"}, {"rating": 5.0, "review": "I will sh they would work out a deal for the WNBA so I could use it on the Chromecast but so far its pretty awesome.", "verified": true, "helpfulness": "0/0", "author": "Shive2002"}, {"rating": 4.0, "review": "works great for few applications", "verified": true, "helpfulness": "0/0", "author": "james miller"}, {"rating": 5.0, "review": "Price is right. Doesn't work with amazon prime very well. Good with netflix & youtube though.", "verified": true, "helpfulness": "0/0", "author": "Dennis"}, {"rating": 4.0, "review": "Allows you to play YouTube, Crackle, and others directly from your device to the TV.  I think I would use it more if more apps were compatible.", "verified": true, "helpfulness": "0/0", "author": "Michael Mohseni"}]