[{"rating": 1.0, "review": "very difficult to set up and use, I returned it and purchased Apple tv", "verified": true, "helpfulness": "1/6", "author": "Jeffrey K"}, {"rating": 5.0, "review": "IT IS EASY TO USE AND WORKS PERFECT. DO NOT CONTROL REMOTE SINCE I CAN MANAGE IT WITH MY PHONE OR TABLE. I HAD MY DOUBTS ABOUT TO BUY ROKU OR CHROMECAST.,, BUT BELIEVE ME CHROMECAST IS MUCH BETTER BECAUSE U CAN CAST ANY APP AND WEB BROWSER  WITH BACKDROP EVEN IF IT IS NOT CAST COMPATIBLE APP. IT IS HD SCREEN CAST.", "verified": true, "helpfulness": "0/0", "author": "Paty"}, {"rating": 4.0, "review": "I got this to watch netflix on the tv I have in my computer room, it worked great for that. However I tried plugging it into my main TV and the connection would cut out a lot for some reason. I'm not sure what's at fault here but when I use it in my computer room and at my girlfriends house it works fantastically.", "verified": true, "helpfulness": "0/0", "author": "Michael Wadsworth \"MajinAce\""}, {"rating": 5.0, "review": "We stopped paying for cable so this was the perfect gadget for my family. We watch Netflix and HBO Go on the TV instead of the laptop/tablet and it works really well!", "verified": true, "helpfulness": "0/0", "author": "Mari Maeda"}, {"rating": 5.0, "review": "Awesome product. Must buy.", "verified": true, "helpfulness": "0/0", "author": "Josh Verghese"}, {"rating": 4.0, "review": "I have since figured out how to cast my phone screen so that everything I see on my phone will be on my tv, but just when trying to cast netflix...sometimes the cast icon wouldn't be there.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Lynn Platts"}, {"rating": 5.0, "review": "Very excellent and the movement of the phone content", "verified": true, "helpfulness": "0/0", "author": "Hussein M Almutairi"}, {"rating": 3.0, "review": "All-in-all a solid device. I just wish for game support, more streaming support, and a more refined interface. (All of which can be fixed through software updates, so I won't be too harsh)", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "We already have one of these, and decided to take advantage of the discounted pricing to pick up another one for a bedroom TV.  We love the Chromecast media player!", "verified": true, "helpfulness": "0/0", "author": "T. McClellan"}, {"rating": 5.0, "review": "Like it since day 1", "verified": true, "helpfulness": "0/0", "author": "TWM"}]