[{"rating": 2.0, "review": "All of a sudden (after worked ng hreat gor about 3 months), fire stick doesn't show up on my TV.  Starting out this week it couldn't find my wifi.  Now it has completey \"disappeared\"", "verified": false, "helpfulness": "0/3", "author": "Linda Tuttle"}, {"rating": 5.0, "review": "THIS IS SUPER COOL!  if it could serf the web better it would be great,  but I like its worth the money..", "verified": true, "helpfulness": "0/0", "author": "JOE DIRT"}, {"rating": 5.0, "review": "I thought Fire TV was going to be mostly old movies, but it is much more. It was recommended by a Dish TV installer. He said that he had just picked one up and was amazed at how much it contained. The simplistic remote is a HUGE thing in my mind. I have too many remotes doing...I'm not sure other than on, off, and volume. After that, I'm lost. Frankly, when I sit down to watch TV, usually I have had a busy, stressful day. I don't need to get pissed off because I can't figure out how I messed up the TV...AGAIN. The Fire's remote is home, which turns on my TV (though doesn't turn it off or adjust volume, which I thought was odd if it could turn it on...yeah, I'm that non technical), and all I have to do is choose what I want to watch. I am a big PBS fan, and there is a very large amount of that, documentaries, animal shows, and even more brain food. But it has original series. And they are pretty go. Actually better than pretty good. The variety of programing amazed me. I hadn't heard of the Fire until the gentleman said something about it. It is less expensive than cable or satellite by far. Cheaper than the other subscription tv products, AND I get the bonus of free books and music, plus free two day shipping on my Amazon orders! Now that, ladies and gentlemen, for someone who pinches a penny until Lincoln screams, makes the Fire TV more than work the price.I will admit that the programing, in some categories, is a bit small, but I figured that as it progresses, the programing will, hopefully, expand a bit more. It's still in the early stages, so there is hope. Even if not, it is still more than worth it's price. Frankly, for me, it rocks!", "verified": true, "helpfulness": "2/2", "author": "Michele Halliwell"}, {"rating": 5.0, "review": "I am thinking about giving up my satellite company and just go with the local phone companies cable, I get so much on this.", "verified": true, "helpfulness": "2/2", "author": "Paula Harper"}, {"rating": 5.0, "review": "I love this thing! I've been wanting something like this for quite sometime but didn't know how to go about it...I'm a technophobe! I thought I would have to have my son come over and install it for me (since I'm so inept at this sort of thing) but I did it all myself in just a few short minutes. So far I'm loving it and so glad I purchased it...being able to get you tube and netflix on the big screen is awesome! Highly recommend this to those who can't stand the garbage on regular television.", "verified": true, "helpfulness": "1/1", "author": "nightsky"}, {"rating": 5.0, "review": "I have only tried this a few weeks but so far, I love the Amazon Fire TV.  We are prime subscribers so we get the added benefits of free movies and shows.  They really did a nice job with the remote and it generally plays without buffering issues.", "verified": true, "helpfulness": "2/2", "author": "KD \"The Dean's\""}, {"rating": 5.0, "review": "Love all the features and the ease of navagating through all of the movies and tv shows. I highly recommend the product.", "verified": true, "helpfulness": "0/0", "author": "Wendy A. Diko \"Jetskier\""}, {"rating": 4.0, "review": "So far so good I haven't been able to watch it that much but it seems to be working okay.", "verified": true, "helpfulness": "0/0", "author": "Ronald Fletcher"}, {"rating": 4.0, "review": "I like it.  It made it even better to be able to cancel Dish.", "verified": true, "helpfulness": "0/0", "author": "Suki Knight"}, {"rating": 5.0, "review": "LOVE IT!! It has made watching TV and entirely new experience. I am having a lot of fun with it.  Great product!", "verified": true, "helpfulness": "0/0", "author": "Russell D. Johnson"}]