[{"rating": 5.0, "review": "Excellent product meet all my expectation. Thank you", "verified": true, "helpfulness": "0/0", "author": "Omar Tua"}, {"rating": 5.0, "review": "EXCELENTE", "verified": false, "helpfulness": "0/0", "author": "edwin molina"}, {"rating": 5.0, "review": "This piece of equipment is everything that I need to enjoy my soccer matches. Excellent job Google.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Worked well but unable to stream video from iphone itines", "verified": true, "helpfulness": "0/1", "author": "Mark"}, {"rating": 3.0, "review": "HD 1080 movies will pause or skip, buffering problems. Lower quality movies work great though.", "verified": true, "helpfulness": "0/0", "author": "Cory Williams"}, {"rating": 5.0, "review": "Already owned this item, love it! Ordered 3 more for my family. Ordered monday night, got it on wednesday. Very fast delivery! Would order again from here if I need more! :p", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 5.0, "review": "Perfect.", "verified": true, "helpfulness": "0/0", "author": "sunny"}, {"rating": 5.0, "review": "SUPER FAST SHIPPING EASY TO USE I AM SO HAPPY I ORDERED THIS. THANK YOU SO MUCH", "verified": true, "helpfulness": "0/0", "author": "aletha rojem"}, {"rating": 5.0, "review": "Best thing out there,  the possibilities of doing stuff is great.  This is my 5th one  that I have purchased.  The price is great,  you can mirror your laptop screen using Google Chrome by getting the extension Google cast.  Cast your pictures and videos from your cell phone using airwire app,  cast any video or movie  online from your phone using Web video caster on android phones.  You can play games like just Dance and use your phone as the control.  Great product which keeps improving.  I definitely recommend this product.", "verified": true, "helpfulness": "1/1", "author": "Alberto Gonzalez"}, {"rating": 5.0, "review": "I was refered to this site by another customer on amazon. Link below:[...] I got this chromecast free from this site plus many other brand name products(ex.Apple,Samsung,LG,Bath and body works,Victoria secret) and many more! This site for s definitely worth checking out!", "verified": false, "helpfulness": "0/1", "author": "kiki&mone;"}]