[{"rating": 5.0, "review": "A great little device for streaming movies. Easy to install, easy use, all at a great price. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "John H. Arnold"}, {"rating": 5.0, "review": "This is an excelent device. It covered all what I want.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I spent an entire afternoon on the phone with Google Chromecast Support trying to connect my Macbook Pro to my TV with no success. After what seemed like an eternity, I was told her supervisor would contact me tomorrow.  Two days later I received an email from Google instructing me to run a diagnostic program and submit the results which I did.  The next day I got another email asking what happened when I plugged it into another TV after I told them I didn't have a second TV.  That did it, I contacted Amazon and returned the device. Apparently thi Google’s Chromecast isn’t compatible with a Mac.", "verified": true, "helpfulness": "0/0", "author": "Bob in Tampa"}, {"rating": 1.0, "review": "I figured out after lots of research that it seems need p2p to work. And I did not know the free return policy on Amazon....", "verified": true, "helpfulness": "0/1", "author": "Fan"}, {"rating": 5.0, "review": "Best 35.00 ever spent on Amazon", "verified": true, "helpfulness": "0/0", "author": "Lyndon Girvin"}, {"rating": 5.0, "review": "This far exceeded my expectations.  Great device.", "verified": true, "helpfulness": "0/0", "author": "SamuraiSaint"}, {"rating": 4.0, "review": "I've had my Chrome cast for quite a while now and it does everything as advertised. However, it doesn't have the ability to continue playing a series. You have to manually select the next episode each time you want to watch the next one. I also wanted to watch Amazon prime shows with this but am unable to figure out a way to do so.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Where's the beef\""}, {"rating": 5.0, "review": "Item met all expectations. Meets description and was delivery as promised", "verified": true, "helpfulness": "0/0", "author": "Louis Pinto"}, {"rating": 5.0, "review": "Does exactly what I hoped it would; allow me to cast content from my laptop to my flat screen TV to share with the family. A great convenience that, so far, seems to work almost flawlessly. Most YouTube videos have the ChromeCast button that allows you to easily link to your TV and those that don't only require you to maximize the player to achieve almost the same result. Quality seems very good.", "verified": true, "helpfulness": "0/0", "author": "David Montero"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "vip#1"}]