[{"rating": 5.0, "review": "Soo cool. ..", "verified": true, "helpfulness": "0/0", "author": "vickie"}, {"rating": 4.0, "review": "The box was very easy to set up. With our xbmc app installed we can watch everything.", "verified": true, "helpfulness": "0/0", "author": "Madison Cebular"}, {"rating": 5.0, "review": "I'll start out by saying our house is a mostly Apple house.  We have Iphone 6's, Ipad minis, and I use a Macbook PRO when I travel for business.  When shopping for a video streaming device, naturally I checked out the Apple TV first.  Unfortunately, due to Apple being a bit tight with the way Apple TV could play videos I already owned (AVI Files, stuff I've converted or ripped from DVD, etc) -- I had to look elsewhere.  Initially I tried to use the built-in \"SMART TV\" apps on my VIZIO televisions, but quickly realized that their software is garbage.  It would crash constantly, or fail to load from the PS3 Media server I had configured in my home office, or would hiccup constantly while watching movies.  I figured VIZIO would fix the problems with their code sooner or later, but after a year+ they never have addressed them.I ended up buying the Amazon Fire TV on Cyber Monday while the $69 sale was going on.  When the box showed up, it reminded me of an Apple product because it was a great presentation.  High quality box, limited docs, components nicely compartmentalized, and the device itself protected with a high quality plastic film.  This looked like a $300 product, and it definitely shows the effort Amazon is making to capture this market.  Right away I was pleased just holding the open box in my hands.Upon unboxing and setting it up, I was amazed at how easy it was.  Super fast too (especially compared to the apps on my \"SMART TV\") I simply plugged it in, and it worked first try.  It connected right away to my 5G Network (Which is a lot more than I can say about the IOS8 devices in our house right now - UGH!) -- There was a quick instructional video that played, and then I was off.  Since I bought it for streaming videos I already owned in AVI format, I immediately installed the PLEX APP, and put PLEX server on my PC.  Within minutes I was streaming movies to my TV from a computer in my home office.  I would say that VIZIO should just give up now and start bundling Amazon Fire TV's with their televisions, because they are never going to be able to compete with the speed, and quality of code that Amazon has packed into this little box.  The remote is even wireless and works through walls, so if I want to hide the box behind something, it would work without having to buy any additional accessories (Why Direct TV hasn't gone to this type of remote yet, I have no idea!?!?!)All in all I feel I got several hundred $$$ worth of value for the $69 I spent, and I would buy this device again in a heart beat.  I'm considering getting a few more for around the house so we can standardize our media streaming capabilities on a device that is faster and more reliable for the types of video streaming we like to do.", "verified": true, "helpfulness": "1/1", "author": "Carlton Davenport \"White Poet Warlord\""}, {"rating": 5.0, "review": "Great product. Works flawlessly with XBMC.", "verified": true, "helpfulness": "0/0", "author": "Iosif Yeremuk"}, {"rating": 5.0, "review": "Auch für mich als Europäer der nicht permanent in den USA lebt ein geniales Tool um Filme, Serien, Games, Videos oder Bilder zu laden, speichern und jederzeit wieder abrufen zu können.Dank des Prime Services stehen über 20.000 Filme und Serien gratis zur Verfügung. Viele Artikel im Amazon Shop werden innerhalb von 2 Tagen Portofrei geliefert. Prime TV und Amazon Fire TV haben mich schon nach wenigen Tagen restlos überzeugt.Die Installation ist äusserst rasch erledigt und die Bedienung einfach auch wenn man der englischen Sprache nicht so mächtig ist.", "verified": true, "helpfulness": "1/2", "author": "Eric Winkler"}, {"rating": 2.0, "review": "Bear in mind that I've never purchased this before but after reading about what the latest Amazon Fire TV firmware did, I would advise staying away from this product. If you have opted to root your Amazon Fire TV device, you must NOT update to any frecent firmware updates or you risk bricking your device from which such bricking is \"IRREVERSIBLE\". There are reports from current consumers that if you have used a bootloader to root your device, the recent firmware permanently bricks your device and it deliberately prevents you downgrading from the recent firmware. If Amazon is reading this, then someone needs to address this fatal flaw in Amazon Fire TV.[...]", "verified": false, "helpfulness": "1/5", "author": "Mark Talmadge"}, {"rating": 5.0, "review": "I love this device.  I have 2 Apple TV's but I prefer the picture from this device.  One thing I find unusual though is:  Unfortunately, my cable provider COX does NOT like the device.  I get nasty emails from COX each month saying I have exceed the usage on my cable modem.  I know my online viewing has NOT increased, but I think this device downloads a higher quality stream than the Apple TV and so it uses more bandwidth.  Just a thought, but I have not been able to measure it.  Anyone else experience this?", "verified": true, "helpfulness": "0/1", "author": "GeekInVegas.Robert"}, {"rating": 5.0, "review": "I love it and think it was absolutely a great purchase!!!!", "verified": true, "helpfulness": "0/0", "author": "Mike Diebert"}, {"rating": 5.0, "review": "Since I just received the Amazon Fire TV, I really haven't had too much time to play with it.  However, I did watch a movie and it was so easy to figure out, even I was amazed.", "verified": true, "helpfulness": "0/0", "author": "spidersmate"}, {"rating": 4.0, "review": "Voice search works well. HBO is the only missing element. Syncing Netflix was a little challenging. Make sure to run updates immediately since only 9 of 12 or 13 apps are there out of the box. Controller is simple to use and navigation is easily mastered.", "verified": true, "helpfulness": "0/0", "author": "Nedonn"}]