[{"rating": 5.0, "review": "Works like a dream.  I hope more apps become available to use with this!", "verified": false, "helpfulness": "0/0", "author": "Theo Montgomery"}, {"rating": 5.0, "review": "great product very happy", "verified": true, "helpfulness": "0/0", "author": "T. phillips \"tom41309\""}, {"rating": 4.0, "review": "so far looks good, don't see major cons..", "verified": true, "helpfulness": "0/0", "author": "mohan"}, {"rating": 5.0, "review": "Love it.  Great content available.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jason M Hoskins"}, {"rating": 5.0, "review": "Rock solid my grandma could install it if she were still aliveLots of apps.", "verified": false, "helpfulness": "0/0", "author": "GJB"}, {"rating": 5.0, "review": "I'm using with plex server and it help me a lot! I'm very satisfied!", "verified": true, "helpfulness": "0/0", "author": "Rafael Rosa"}, {"rating": 4.0, "review": "This is a really good device. The apps from Netflix, Crackle, YouTube, and Google Music are solid. I can't wait for wider support from other application vendors, like Comcast. The browser tab casting is okay, but doesn't perform as well as screen casting products from other vendors, like Apple (Apple TV). The primary reason we bought it was because it's extremely quiet compared to watching Netflix on a device with fans for cooling. It fulfills that mission perfectly.", "verified": true, "helpfulness": "0/0", "author": "TNEngineer"}, {"rating": 3.0, "review": "My problem is that the Chromecast uses internet bandwidth at the rate of about 25 GB / day -EVEN WHEN YOU'RE NOT USING IT!  Since we have Comcast for an ISP and they limit our total internet traffic per month to 300 GB, we would go through that in 2 weeks.I love it when we use it but we have to keep it unplugged until we want to use it.  In the end, I just plug in the long HDMI cable I have to my laptop and make the TV a 2nd monitor.If Google can fix this, we would use the Chromecast much more.", "verified": false, "helpfulness": "0/0", "author": "Jane \"CopperScaleDragon\""}, {"rating": 4.0, "review": "My \"techy\" son encouraged me to purchase a Chromecast, and I'm very glad I did. We don't have cable, but we subscribe to Netflix, Hulu and Amazon Prime instead. With Chromecast, however, I'm tempted to drop Netflix and Hulu as I'm able to watch much of what I like on Youtube including some of the Food Network shows that Amazon Prime unfortunately dropped. It may just be that I am not \"techy,\" but Chromecast seems a little buggy. It disconnects often, and I frequently have to reset it. Kind of irritating, but otherwise I like it a lot! It's a new product. Hopefully updates will be available soon with improvements!", "verified": true, "helpfulness": "0/0", "author": "Sempervirens"}, {"rating": 4.0, "review": "great product but it does have its slow or finicky way about it sometimes", "verified": true, "helpfulness": "0/0", "author": "JIM"}]