[{"rating": 4.0, "review": "It is a fast unit in menus,the processor is more then sufficient.extra memory it nice to.also I have had no wireless connection problems either.streams great.the only things I don't like are.menu selections for just prime movies and shows.also in your video library a desperate selection for your movies and tv shows would be nice.the Rocky has better menus but this is way more reliable in wifi and streaming without getting as hot as the Roku", "verified": true, "helpfulness": "1/1", "author": "T. Hansen"}, {"rating": 5.0, "review": "I bought the Fire TV and a Roku 3. I like the Fire TV a whole lot more than the Roku. It's faster, more responsive, the OS is better, and the voice command works very well.", "verified": true, "helpfulness": "0/0", "author": "Casey Nicholas"}, {"rating": 5.0, "review": "Excellent device!  Super fast.  Easy interface.  I sideloaded XBMC on it as well and it runs it very well.", "verified": true, "helpfulness": "0/0", "author": "theKman78"}, {"rating": 5.0, "review": "I love this product, we have yet to watch a dvd or blue-ray since purchasing this product. Our son plays games on it frequently. Only thing I wish is that you could expand the memory.", "verified": true, "helpfulness": "1/1", "author": "BJS \"\"Hooba\"\""}, {"rating": 1.0, "review": "It was bad enough that the voice search feature is only to sell Amazon movies. Surprisingly, Amazon found a way to make it worse. They required everyone to update the Netflix app to what has to be the worst app in history. It causes the video to lag and when you try to reset it, it knocks you off Netflix completely. Amazon has no ability to make technological hardware and should stay out of the business. If they plan to deliver stuff by drones it the distant future, I hope for everyone's safety they have others build the drones.", "verified": true, "helpfulness": "3/10", "author": "Gregory Harris"}, {"rating": 1.0, "review": "Will let me log into my Amazon account. Completely worthless!", "verified": true, "helpfulness": "1/10", "author": "Chris Cleveland"}, {"rating": 5.0, "review": "this is really great.  no more evening of nothing to watch. i just give the name of an actor and a list of their movies appear and i pick one. very easy to install and easy to operate. who could ask for more.", "verified": true, "helpfulness": "0/1", "author": "j collins"}, {"rating": 5.0, "review": "Love, love, love it!!  Best thing I've purchased in a long time.  You really need prime with it to get it's best use, luckily I already had it.  Price is incredibly good for all it does!", "verified": true, "helpfulness": "0/0", "author": "Annette Story \"Annetteref\""}, {"rating": 2.0, "review": "I was so excited to use this product, but was unable to. We tried hooking it up to two separate TVs, but kept getting the error message \"Signal unavailable.\" When I called for support I was informed that there would be no support for it because neither of my TVs have an HDMI port. I had to buy an HDMI to VGA converter,  but apparently the Kindle Fire TV is not eligible for TVs that have a VGA port and need a converter.I really wish this was made clear in the product specifications before I'd ordered, but thankfully Amazon is refunding my purchase price.", "verified": true, "helpfulness": "2/4", "author": "BookLover55"}, {"rating": 1.0, "review": "Copy of Apple tv", "verified": false, "helpfulness": "2/27", "author": "Taz_"}]