[{"rating": 5.0, "review": "Love this product from Google. And it will only get better with time as more apps are developed for it.", "verified": true, "helpfulness": "0/0", "author": "Jess Tauber"}, {"rating": 5.0, "review": "Chromecast is such a great devise. It doesn't have a lot to it (at the moment), but the potential for what this will be able to do in the future is going to be great. I already love it for Netflix and YouTube (so much easier to use than on my PS3 for YouTube).One thing I didn't understand was powering the unit.  It needs a USB plugged into it at all times to power it.  Now, if you have a larger / newer HDTV, there will be a USB port in it (like my 42\" Samsung). BUT, this really isn't that big of a deal. At all.Seriously, if you're even THINKING about buying this, do. It's some of the best money I've ever spent, and it's barely anything at all.Do it. You won't be disappointed.", "verified": true, "helpfulness": "1/1", "author": "JD"}, {"rating": 5.0, "review": "The bang for the buck is fantastic here - I'm seriously considering replacing my second original Roku XD with it.  The only downside is that you have to pick up your phone/tablet/PC to get a video started playing on it after you pick up the remote to turn the channel to it.  But the serious upside is that on apps like youtube, once you have the phone or tablet acting as a remote it is fantastic for building up a queue of videos to show people.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Whenever I try to use it, it kick me off my wireless network and I have to restart my router and unplug the device from my Television. This item is a bust and I want my money back.", "verified": true, "helpfulness": "2/4", "author": "yoac"}, {"rating": 3.0, "review": "...what do you expect with $35 bucks?What you need to know:- has to be plug into an outlet (comes with a cord).- works with chrome......anything outside of that, that is another story!Couldn't get my XMBC to stream...", "verified": true, "helpfulness": "0/2", "author": "mobius \"mobiuspowershred\""}, {"rating": 3.0, "review": "Streaming is limited to You Tube and Netflix.  Must us Googlechrome for laptop use.  Price was right with the 3 free months of Netflix.", "verified": true, "helpfulness": "0/0", "author": "Doug Centeno"}, {"rating": 4.0, "review": "Google makes great products ... this is no exception.  It does exactly what it's advertised to do.  Easy to use and stream content ... can't wait for more apps to support Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Nicholas McLarty"}, {"rating": 4.0, "review": "Overall, device performed as stated. Would like the ability to cast personal videos. Looking forward to more compatible apps and functions.", "verified": true, "helpfulness": "0/0", "author": "Sean Vu"}, {"rating": 4.0, "review": "Installed very easily and works great for showing NETFLIX streaming from an iPad.  No stutters and brings the full power of the NETFLIX profiles on the iPad to a TV.", "verified": true, "helpfulness": "0/0", "author": "Sigprog"}, {"rating": 2.0, "review": "I would love to love this device but it does not play audio through my TV.  After looking at forums is claims to not support HDMI 1.2, only 1.4.  This needs to be fixed so I can cease spreading a bad word for this device that I had such high hopes for.  Also, the Netflix/Youtube streaming needs to go to 1080p to my TV, the resolution is reduced.  I figure that is a mere software tweak after the initial adopters put the device through the paces.", "verified": true, "helpfulness": "1/1", "author": "paulpas"}]