[{"rating": 5.0, "review": "It was easy to install and has exceeded my expectations. I had been half-way looking for such a product. The available TV episodes and movies are much greater than that available on Comcast, and of course with my prime membership they're free and I can watch when I want. It would be nice to have a music channel (audio only). I see where you might make some regular television available like NBC, ABC, etc. Hope you include Fox News. Looking forward to further innovations.Ed", "verified": true, "helpfulness": "1/1", "author": "Edgar L. Oneal"}, {"rating": 4.0, "review": "Have been learning all the applications for about a week.  Nice and clean operation.  I will wait for Amazon to upgrade their Netflex to current specs.  As most of the reviews state they are using old version?  Would like to see more close to real time views for TV shows, such as the Hulu  offers.  Also more Prime free views would be better.  Overall, I would buy this product again.", "verified": true, "helpfulness": "0/0", "author": "Carlo \"Nica Brand Foods\""}, {"rating": 4.0, "review": "I do love it and I am currently trying a free trial of Netflix,thing is when I first got it I clicked on what I thought was Netflix and turned out it was Amazon and I got charged for a movie rental that would have been free from Netflix,oddly Netflix is listed as an app.Still new to my Fire TV but I am sure I am going to love it. Also I am glad I have the option of getting newer movies from Amazon.", "verified": true, "helpfulness": "0/0", "author": "cozycosi"}, {"rating": 5.0, "review": "Actually, I rate it as 4 1/2 stars.... I think they wanted to give you 30 day trial to trap you into buying Amazon Fire TV. Haha! I'm not complaining though. Amazon Fire TV is wayyy better than the last. After using Amazon Fire TV, I tried using the Roku and you can definitely tell the difference on both. Amazon Fire TV is clearer than the Roku, have better games and so far, I do not have a problem on streaming movies on any apps. The only problem is it doesn't have enough storage. I had to delete some of my games to make room for new ones. Also voice search only searches movies through Amazon. I wish you can do voice search in Netflix and YouTube. But I'm a happy camper. I'm definitely going to keep my Amazon Fire TV!!!", "verified": true, "helpfulness": "1/1", "author": "Joanne R \"J.P. Reeves\""}, {"rating": 4.0, "review": "My kids and I love it.  I think my grand daughter enjoys it the most.  We love watching all the different program selections.", "verified": true, "helpfulness": "0/0", "author": "georgia"}, {"rating": 5.0, "review": "Best set top box out there. Super simple set up. Easy menu. Great product. I would buy again and recommend to all my friends", "verified": true, "helpfulness": "0/0", "author": "heavyd"}, {"rating": 2.0, "review": "I don't know what to put here; the machine would never find it's remote.There wasn't an option to get a different one when I asked for the return.", "verified": true, "helpfulness": "1/2", "author": "P.A.S."}, {"rating": 5.0, "review": "I have an Apple TV on one TV and the Amazon Fire TV on the other.  I prefer the Amazon Fire TV.  I like to binge on series like Breaking Bad.  The Amazon Fire TV has a feature that it will autoplay the next episode after one completes.  With the Apple TV, you have to go back to the previous menu and select the next episode.  Great product!", "verified": true, "helpfulness": "0/0", "author": "Daisy Rich \"educated reader\""}, {"rating": 5.0, "review": "The apps built into this device, like Netflix and Amazon Prime, work so much better than the same apps included with the dvd and bluray players I already own. And the nicest feature is that the remote control is Bluetooth, so you don't have to point the remote towards the box - just press the buttons and they work. You can even hide the box behind your TV or console, and it still works!The fit and finish of this device screams quality. Its like nothing I've seen before. Its other-worldly. The cable connectors snap into place and hold firmly, and the look and feel of the device and remote are amazing. Good job, Amazon!I own two of these so far...", "verified": true, "helpfulness": "0/0", "author": "Compdoc"}, {"rating": 5.0, "review": "I LOVE Fire TV.  Super easy to setup and fun to use. I wish I could use Fire TV for all my regular tv programming.", "verified": true, "helpfulness": "0/0", "author": "R. Bear"}]