[{"rating": 2.0, "review": "Considering other options out there, this device is not good.  I wanted to upgrade my iPad and decided to go with a Samsung tablet along with replacing AppleTV with Chromecast.  Bad move...I returned both the Samsung tablet and Chromecast within days and bought a new iPad air instead, staying with AppleTV.The issues...With Chromecast, only select apps on your phone can be displayed on your TV...the Chromecast capability is not native to Android like Airplay is native to iOS.  In order to cast stuff from your screen, you have lug out your laptop and add a browser extension to Chrome, which then only allows you to cast stuff from your browser.  What's that you say? You can't cast anything you want from your Android tablet or phone, which is usually sitting right next to you on your couch when you're watching TV?  Unfortunately, that is correct.Unlike iOS and AopleTV, which allows you to extend ANYTHING from your iOS phone or table on your TV...Chromecast only allows you to cast a very limited number of apps and does not allow you to cast anything you want, just the specific apps that are Chromecast enabled which doesn't even include Chrome for Android or iOS (only Chrome for Windows or Mac).If you don't have any Apple products, I guess this is one of your few options.", "verified": true, "helpfulness": "0/0", "author": "D B"}, {"rating": 4.0, "review": "C'mon Google. Why not let your own Picasa be able to transmit. And why not browsers other than Chrome. Or the Chrome for iPad?! When and wherever it works, it works fine. May still buy one more!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Chromecast it's a great option for a more interactive TV. Love this product: it is small, simple to use, wireless and very useful. I am totally pleased with it!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Esteban\""}, {"rating": 1.0, "review": "After owning this for just three weeks it broke.  It was plugged into my TV, I went to remove it and the hardware bent.  I wasn't particularly forceful either-- it's a USB for goodness sake.  It don't qualify for a refund/replacement because by the time I got around to it, I missed the deadline by a few days.  Google doesn't claim responsibility--they sent me back to Amazon.I originally bought Apple TV, which I liked.  I returned that and bought Chromecast because it seemed like a better deal.  Wish I had stayed with Apple TV.", "verified": true, "helpfulness": "2/3", "author": "Sean"}, {"rating": 4.0, "review": "I really like my Google Chromecast.  For years I've been streaming Netflix and YouTube on my laptop. I was pleasantly surprised at the good picture quality.The only thing (and this could just be me) but the steps to setting it up were a little hard to follow so it took me longer to get it going then I'd like.I hope more and more apps become available to stream to my tv.It's a great value for the money.", "verified": true, "helpfulness": "0/0", "author": "D. Adrian"}, {"rating": 5.0, "review": "The Chromecast is easy to set up and works just as easily. I have come to the conclusion that this is most ideal for me on occasions where I travel and wish to enjoy content from my smartphone on a larger TV screen. Works wireless so no cables and connectors to travel with. And at $35, you really can't beat that!", "verified": true, "helpfulness": "0/0", "author": "Abdul M."}, {"rating": 5.0, "review": "I bought this for my dad because he travels a lot.. He has never used it, but I still rated 5 starts because it is a cool concept.. I guess I will have to try harder for his presents..", "verified": true, "helpfulness": "0/1", "author": "Chris"}, {"rating": 5.0, "review": "Chromecast is really easy to set up and easy to use. I have an android phone, a laptop, and a desktop, and I'm able to easily and quickly send videos from any of those devices to my TV via my wireless network. This is an amazing little device, and a great bargain for the price!", "verified": true, "helpfulness": "0/0", "author": "PJ"}, {"rating": 5.0, "review": "Works exactly as advertised.  For the price, its well worth it.  Easy to mirror anything on the crhrome browser.  Easy tibset up.  Get it!", "verified": true, "helpfulness": "0/0", "author": "scott"}, {"rating": 5.0, "review": "This product was what i expected. It was delivered on time and packaging was well done. There is nothing negative to say. Good job and i would recommend it to others. 100% satisfaction.", "verified": true, "helpfulness": "0/0", "author": "Manuel M."}]