[{"rating": 4.0, "review": "For Netflix viewing, it is excellent. Far better than my no longer working Roku 3.  You can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "toan"}, {"rating": 4.0, "review": "This is my second Chromecast... my first one crapped out on me and Amazon replaced it very quickly.. two extra points for Amazon!!  The Chromecast is a cool little item and when it works... it's great and I really like it a lot.  It's a slick item, it's a cheap price and I've recommended it to my buddies for watching Youtube or Movies via computer or phone onto your big screen TV. The best part is that you can take it along when you travel...", "verified": true, "helpfulness": "0/0", "author": "FZ"}, {"rating": 5.0, "review": "Worth every penny! Streaming content smooth like a butter. I like that you can still do other things while streaming.", "verified": true, "helpfulness": "0/0", "author": "DS"}, {"rating": 1.0, "review": "Let me start by saying I have the fastest Internet speed available, a new iPhone and a gaming laptop with 8GB of RAM.Don't even TRY to browse the WEB. It ain't happening. Well, you can,  but, be warned. You CAN NOT \"Cast\" web browser from ANY Mobile OS device.  So get out the laptop and travel back to 1995 and watch web videos on 56k dial up modem, because that's EXACTLY what it's like. So forget YouTube. As for its Netflix App? It won't pause, and you could cook and eat a meal while you're waiting for it to load, but thats after its frozen and been reset 10 times. So to make a long story longer.... I returned it. Don't wast your time (a lot of time) and frustration. Take that $35. and the family out to Panda Express.", "verified": false, "helpfulness": "0/3", "author": "Dawn"}, {"rating": 5.0, "review": "Chromecast is very easy to set up and works great! I was watching videos within 5 minutes. Just got it today and am still \"playing\" with it, but so far its pretty cool. Very happy with my purchase so far.", "verified": true, "helpfulness": "0/0", "author": "Mandy Couture \"Real Couture\""}, {"rating": 1.0, "review": "Does not work. At all. Tested at a friend. Tested at work. Bought a new router to match a confirmed Chromecast supported router, but this Chromecast never connects.", "verified": true, "helpfulness": "0/1", "author": "Spencer rands"}, {"rating": 5.0, "review": "Works great! I love using this device with my computer and phone to stream media to my tv. Good stuff.", "verified": true, "helpfulness": "0/0", "author": "Darren"}, {"rating": 5.0, "review": "Easy alternative to Apple TV, can be used with many streaming apps on most TVS and easy to install move around the house for the convenience of everyone!", "verified": true, "helpfulness": "0/0", "author": "Amber W"}, {"rating": 1.0, "review": "Cheaper than the Roku but not better.  No problems streaming from the Roku. The chromecast is another story.  Reboots and resets constantly. Horrible.", "verified": false, "helpfulness": "0/1", "author": "j irizarry"}, {"rating": 2.0, "review": "it didn't for me after numerous attempts and much research online. Best I could determine it doesn't work with my Arris router. They have a so-called compatiblity list that only lists certain models [...]", "verified": true, "helpfulness": "0/0", "author": "Back sufferer"}]