[{"rating": 5.0, "review": "I love this, and as I was already a Prime member I didn't have to have another subscription.  Extremely easy to install. I would and have recommended this product to any and everyone.", "verified": true, "helpfulness": "0/0", "author": "Susan C Peters"}, {"rating": 5.0, "review": "I'm not really concerned with comparing it to any other streaming devices on the market.  I like it because It's great.  The only thing that I would change If I were the Ad team at Amazon would be to let the public know that: The Netflix and Hulu services that you offer for free pertains ONLY TO THE APP!  Customers still have to subscribe via a monthly usage fee.  Other than that, I'm thinking about getting another one for somewhere else in the house.  However, I will make sure that I can buy 100 if I want to on my single user account before I make that step.  Thanks Amazon Fire TV!  The wife loves it!!!  (I do too!)", "verified": true, "helpfulness": "0/0", "author": "shave"}, {"rating": 2.0, "review": "I'm not the primary Prime member so the voice search was of little value though it did work somewhat with Hulu. What I found most annoying was that when searching/selecting for TV content that the most recent shows would require scanning through many older episodes and it's near the beginning of the year.I returned the Fire TV and will wait but will likely get another Roku 3.", "verified": true, "helpfulness": "1/1", "author": "Sasha299 \"Kayakpotomac\""}, {"rating": 2.0, "review": "It's a nice looking product, but right out of the box, it seemed to take forever to set up. It kept logging me out of my Netflix account.  When I was watching a show on Netflix, it would change the aspect ratio to some weird stretched view. There is no way to single out free prime movies v. the paid ones. I think I will just stick with my Roku 3, which seems to be very smooth, and much easier to navigate, plus you gotta love the headset that you can use with the Roku 3. Its really nice to watch a show and not wake people up.", "verified": true, "helpfulness": "2/3", "author": "Mlnaire0305"}, {"rating": 2.0, "review": "I set it up which was very easy.It worked good until the next day when I tried netflix and all I got was a white screen.The only way it would play I had to unplug it and then plug it back in.The controller would not work sometimes on netflix,it would lock up but only on netflix.It has a great picture and works good on amazon prime.There is to many bugs in this right now.Maybe they will improve it in the future because Amazons products are usually very good.I would not recommend this product until they get the bugs out of it.I will stick with my roku 2.", "verified": true, "helpfulness": "3/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I had no problem hooking the box to my TV, or adding it to my wireless internet. Hookup was a breeze.", "verified": true, "helpfulness": "0/0", "author": "P. O'Neill"}, {"rating": 5.0, "review": "This was so easy to install it almost did it by its self.You will love all the movies and tv shows that you can watch with it.Shipping was very fast!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The Fire pitched Free this and that so I thought this purchase would help lower my cable bill . However nothing is free. You pay one way or another. If you can live without network TV this might be the way to go . Otherwise don't waste your money", "verified": true, "helpfulness": "2/8", "author": "Vincent Pulcini"}, {"rating": 3.0, "review": "The espn app was a major reason I got this.  I have apple tv in the living room and now the fire tv in bedroom.  The quality on the espn app is perfect on the appletv, but very poor on the firetv.  I hope this is something they can change through an update, but will have to wait for that.  Everything else with the fire tv is awesome, video quality on everything else is great and the games are fun too, search feature works great.  The only other thing that could be improved is more customization on the layout of the home screen.  I like the apple tv and roku layouts much better.  If I had to do it over I would just by another apple tv and play video games on something else.", "verified": true, "helpfulness": "0/0", "author": "Matthew Hill"}, {"rating": 4.0, "review": "So far, I've had a good experience with the Fire TV.  Starting with the pro's:Picture quality is good (capable of 1080p), and streaming is quick and relatively stable thanks to your choice of dual-band MIMO Wi-Fi or Ethernet connections.  The box can also output in Dolby Digital-Plus, though so far I've only seen DD+ audio on Amazon's own content and on Netflix.  Amazon's specs say the box can push 7.1 DD+, and while it may technically be capable of it, I have only seen content with 5.1 channels.  Also keep in mind DD+ audio is only available via HDMI with a capable a/v receiver or soundbar; optical audio output is limited to standard Dolby Digital or stereo PCM.  The ASAP feature (pre-buffering what it thinks you'll watch next) works really great, especially when you're sequentially watching episodes from a TV series.  However, the feature only works with Amazon content.  Voice search also works surprisingly well, though again that feature only finds results within Amazon's own content.  Amazon claims its search function will include results from other apps in a future update.  This box is also by far the most powerful in terms of processing power out of all its peers.  Consequently, zipping through menus is a breeze and games play quite well.  The optional game control works great and makes this box a front-runner for a low budget game system.  Both the remote & the controller connect via Bluetooth, so they don't require line-of-sight to the box.Now for the con's:Many of the box's differentiating features, like voice search, ASAP, etc. only work with Amazon's own content.  That's likely to change with future updates, at least to some extent, but until it does, you really only benefit from them if you're an Amazon Prime subscriber.  The box also heavily pushes Amazon content front-and-center.  The \"movies\" and \"TV\" tabs only include Amazon content.  If you want to look through Netflix, for example, you'll have to go to the \"apps\" tab and open the app.  I knew that full well when I bought the box, and I understand this is an Amazon branded device, but it's important you go into the purchase with eyes wide open.  Again, that situation should hopefully improve when the search function becomes more universal.  While the controller is decent, it's quite overpriced at $40 for an optional accessory.  You'll need the controller to really enjoy gaming, as many of the good ones actually require the controller.  While the remote (and controller) don't require line-of-sight thanks to Bluetooth connectivity, you won't be able to use an IR-based universal remote with the Fire TV.  Strangely, the ability to play your Amazon MP3 tracks wasn't included at launch, but Amazon said it's forthcoming.  It's also missing some key apps like HBO Go (forthcoming) and Vudu (no word on that yet).Conclusions:The Fire TV is a solid first attempt from Amazon to break into the living room space.  Prime videos has really taken off over the last few years and has become a legitimate Netflix alternative, and this box really is the best way to access that content.  The features largely work as advertised, and picture & sound quality are quite good.  Browsing is zippy and easy, and the box makes my Roku 2 XD, which I've been perfectly happy with, feel sluggish by comparison.  Gaming is a cool feature but shouldn't be a primary consideration.  In all, the Fire TV easily makes the most sense if you already have a Prime subscription and you need a streaming box to watch your content.  If that describes you, this box should be at or near the top of your list.  However, if you're not already a $99/year Prime subscriber and don't intend to be, there's little reason to choose this box over the newest Roku, which is more platform-agnostic.  You could also go with the cheaper Chromecast or Roku stick if you just need a basic streamer.", "verified": true, "helpfulness": "3/3", "author": "mojo1633"}]