[{"rating": 2.0, "review": "I'm a little disappointed in google.The application \"plex\" I pay the subscription \"PREMIUM\" from IOS to use it.IOS is very limited, can only use \"Youtube\" and \"Netflix\".IF you have \"IOS\" buy an Apple TV do not make the mistake of buying this product.", "verified": true, "helpfulness": "1/1", "author": "Orellana Soberanis Carlos Juan \"carlos Juan\""}, {"rating": 5.0, "review": "A great and inexpensive alternative to Roku and Apple TV, with the killer apps Netflix, YouTube, and HBO Go. Would recommend to anyone with an extra HDMI port on their TV and an Android smartphone.", "verified": true, "helpfulness": "0/0", "author": "Ryan Hearty"}, {"rating": 5.0, "review": "I love this thing. The only downfall is it doesn't stream amazon videos. I'm happy to hear that they're opening up to new ideas.", "verified": true, "helpfulness": "1/1", "author": "Adrian Balderas"}, {"rating": 2.0, "review": "i guess they are still working on it but it is really slow and totally annoying to watch something on the tv. I wasted my money", "verified": true, "helpfulness": "0/0", "author": "Alieth"}, {"rating": 5.0, "review": "Easy setup, easy to use and overall really great technology that I can use with all my WI-Fi-enabled devices. :)", "verified": true, "helpfulness": "0/0", "author": "TJ"}, {"rating": 4.0, "review": "I just wish more apps worked with it,  but I'm sure more at coming. The price compared to what it does is outstanding though.", "verified": true, "helpfulness": "0/0", "author": "John Tresidder \"masondoctor\""}, {"rating": 4.0, "review": "I'm using this product from last two months. It has amazed me so far.- Anything which you can open/run/play in Chrome, can be played/projected on your TV- If you cast a youtube video on chromecast, it will not hog your devices' CPU or memory, instead it will be directly played on your TV. Even if you turn-off your computer, video will not be interrupted.- When you play nothing, it plays some nice images on your TV. Good thing is some of them are very good pictures. Bad part is you cannot customize them hence you can't use your TV as your digital photo frame.- You cannot directly stream any video from your machine. Local content needs to be uploaded somewhere e.g. on youtube, plex etc.- It will save you an HDMI cable as well.", "verified": true, "helpfulness": "1/2", "author": "Pankaj Upadhyay"}, {"rating": 1.0, "review": "Update: I can't return it. Apparently there's a very short period of time chromecast can be returned. So now I have a non-functioning pos that I used to really enjoy.Older reviews: Originally, I loved Chromecast for its simplicity, sleekness, and selection of apps to cast. HOWEVER...now I have constant issues: it began to buffer repeatedly, then the white light began flashing, then I began (like so many others, just google \"Chromecast can't...\") to have the inability to connect to wifi.  It's infuriating: it tells you it's searching for chromecast on your wifi, finds it ON your wifi, then tells you to connect it to wifi.  WTF?! I'm returning it.  Don't waste your time on this thing.  Research it, and you will see it has many problems.", "verified": true, "helpfulness": "0/0", "author": "James Graff"}, {"rating": 5.0, "review": "I wanted to try Crome cast for a while and when I saw it was on sale I jumped at the opportunity. You pretty much plug it in and go. It can be plugged into your tvs USB port to power it or if your TV lacks USB it comes with an adaptor with about 6' of cord. The picture is great! My one and only \"complaint\" is that you have to select each time you want to watch so TV shows won't automatically go to the next episode (hulu and netflix) which is just a mild inconvenience really and likely has more to do with the Netflix and hulu apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome idea, great price. I'm getting great reception. Can't watch Netflix yet,but as I understand it ; it does not work with slower internet reception. Unfortunately that's the best I can get from my Country in US location. Otherwise, great since my son, who lives in the city, recomended it. It is working great for him. Try it! Great clarity!", "verified": true, "helpfulness": "0/0", "author": "mame"}]