[{"rating": 4.0, "review": "This is a great device. the only thing i wish is that i could stream more of my movie and tv collection to it, as it stands i have to try and convert some of my avi files to a different format. i would like it better if VLC plugin would open the files like it is supposed to.", "verified": true, "helpfulness": "0/0", "author": "R. Hayes"}, {"rating": 5.0, "review": "Now if I want to show my family a quick laugh or just something exciting on youtube I can display for everyone. Also to watch Netfix is awesome. Now that's they open the sdk for developers, it'll just get better and better.", "verified": true, "helpfulness": "0/0", "author": "randomyz"}, {"rating": 5.0, "review": "If you don't have internet ready TV or other internet ready attached device, this gives you the access you want. Gave them to my daughter and son and they use it.", "verified": true, "helpfulness": "0/0", "author": "steveson"}, {"rating": 5.0, "review": "The Chromecast is an inexpensive solution for turning your \"dumb\" TV into a \"smart\" one. If you own an older model HDTV or HDTV that doesn't feature the smart capabilities of newer model TVs like I do, you're probably missing out on built in apps like Netflix, Hulu Plus, etc. The Chromecast is a great way to extend your TV's capabilities and value. The Chromecast simply connects through HDMI and will allow you to pair your smart phones, tablets and computers through your wifi network. I've used the Chromecast for streaming or \"casting\" videos through google chrome from my computer to the TV and this feature works great! The picture is crystal clear, HD quality! I also take advantage of its mirroring capabilities, which allows me to view what I'm doing on my desktop on the TV screen. I highly recommend this product for anyone who's considering upgrading to a smart TV, save yourself some money and give this a shot before you do!", "verified": true, "helpfulness": "0/0", "author": "Michieface"}, {"rating": 2.0, "review": "I found the Chromecast very hard to use.  I am used to a Roku and the Roku just works.  The Chromecast was difficult to set up and It was really only usable with my tablet \"beaming\" through the Chromecast.  I like the Roku because it is its own network device which logs into things like Netflix without having to use an \"app\".", "verified": true, "helpfulness": "0/0", "author": "99999jj"}, {"rating": 5.0, "review": "This is a great device for the price. And now that google released the SDK to the public, a lot more apps with be able to integrate! So go harass the developers to get on coding =P Really nothing to complain about for the price!", "verified": true, "helpfulness": "0/0", "author": "Adam Smith"}, {"rating": 3.0, "review": "Wasn't very simple to set up. I had to change a few settings in my router and it still doesn't work consistently from my iPad. Every now and then I have to reset the router and the internet connection.", "verified": true, "helpfulness": "0/0", "author": "Pratik \"phkhetia\""}, {"rating": 4.0, "review": "This is just what we were looking for. Chromecast and netflix work great together. Unlimited movies.I would recomend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "John H. Wiggins"}, {"rating": 5.0, "review": "This is a great product.  We actually purchased a second one after this.  It is easy to install, use and helped us to save money.  After purchasing this product, we cut the chord on cable and subscribed to Hulu Plus.  Two thumbs up and there are more apps coming in the near future!!", "verified": true, "helpfulness": "0/0", "author": "ksu_mpa"}, {"rating": 5.0, "review": "I gave it as gifts this Christmas and everyone loved it and was able to use it, unlike the google TV my son received and is yet unable to set up on our TV's.  And it was super affordable!", "verified": true, "helpfulness": "0/0", "author": "sharon seidler"}]