[{"rating": 5.0, "review": "Basically this thing seems to work great. The only issue I have had is when trying to stream video via the web browser (Chrome). Sometimes that video will be choppy and the sound a bit behind, even if I push it back to 480p.", "verified": true, "helpfulness": "0/0", "author": "R. Thompson"}, {"rating": 3.0, "review": "wheel i thought it was more then they pretend to be it won't work in 5 minute i guarantee you that you have to install chrome and chrome cast then your pc may see it or not in my case it did not suppose to work with wireless only but does work with wire internet too so by the time you figure this up you spend a lot of time plus its in no way replace Roku that i think its the best for the money work with every thing in the house with this Chromecast you need your pc on so if some thing go off your back to pc to solve problem its okay barely use it because got Roku and a blue-Ray player that does every thing i need for me so that why give 3 star and that pushing it .Ray", "verified": true, "helpfulness": "0/0", "author": "Mr. Real Fortin Sr."}, {"rating": 4.0, "review": "Very easy to use with Netflix. Answer to not having cable or dish tv. Very mobile from room to room.", "verified": true, "helpfulness": "0/0", "author": "Pam Buckel"}, {"rating": 5.0, "review": "It's much nicer to watch video content on a large screen.  Very easy to set up and get started. Wonderful! :)", "verified": true, "helpfulness": "0/0", "author": "J West"}, {"rating": 4.0, "review": "This works with Chrome so you can project what you see in your Chrome browser onto your TV with a wireless connection and an existing wireless Internet connection. It is fun for browsing and sharing on the big screen and for a one time fee it is not a bad value.", "verified": true, "helpfulness": "0/0", "author": "ECI-Tampa"}, {"rating": 5.0, "review": "No doubt why this was number one selling item! 100% satisfaction guarantee! And for those who complain about the lack of apps, I'd say this is only the beginning for this amazing device.", "verified": true, "helpfulness": "0/0", "author": "Rodik Figueroa Echarri"}, {"rating": 2.0, "review": "Hard to get it to sync with my tv. internet did not smoothly flow.  Stalled out numerous times. Had to restart it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "This doesn't work at all on a VPN.  If you are using a VPN for any reason, this will NOT work.  It is not a good idea if you don't live in the United States.", "verified": true, "helpfulness": "0/0", "author": "Kat Edwards"}, {"rating": 5.0, "review": "Purchased for total price of $12 with gift cards and discount codes. I think it would still be a good buy at full price.Sometimes watching Netflix, it would buffer a few times, but no worries here", "verified": true, "helpfulness": "0/0", "author": "Herman"}, {"rating": 4.0, "review": "I think i very good, in My case i was needing something like that, i used the ipad to put a movie at the chromecast and them i give it to mi litle girl 28 month. And all are happy", "verified": true, "helpfulness": "0/0", "author": "felix german"}]