[{"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Richard Dickson"}, {"rating": 4.0, "review": "It does everything the description says. It is very easy to set up. The wifi on it could be better. If I try to stream from my PC across the house, with a centrally located router, nobody is allowed to use the microwave or it stops playback altogether.Everything else about it makes it the bee's knees, though.", "verified": true, "helpfulness": "0/0", "author": "Dan Green"}, {"rating": 5.0, "review": "YAY!!  We use it all the time for Netflix!  Now we don't have to have our son's play station hooked up to the TV!", "verified": true, "helpfulness": "0/0", "author": "MomofFive"}, {"rating": 5.0, "review": "amazing product would recommend to anyone!!!!!", "verified": true, "helpfulness": "0/0", "author": "Victor"}, {"rating": 1.0, "review": "Slow connection", "verified": true, "helpfulness": "0/0", "author": "Justin Kang"}, {"rating": 5.0, "review": "Works great!,,", "verified": true, "helpfulness": "0/0", "author": "Gfbogie"}, {"rating": 5.0, "review": "Love it...Helped me finally cut the cable cord!", "verified": true, "helpfulness": "0/0", "author": "Janet A. Lindley"}, {"rating": 4.0, "review": "Amazing quality.  I gave only 4 stars because it won't broadcast everything. I can't get it to broadcast my dish network, not sure if it is not able or I don't know how to do it.", "verified": true, "helpfulness": "0/0", "author": "BEA BA"}, {"rating": 3.0, "review": "The product work well with the website like Youtube. However, not when you cast on the chrome tab. Often get delay. Overall, a great product. Should be good if you have both Chromecast and HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Dat Do"}, {"rating": 3.0, "review": "Ordered two of these  turned out that the products just really didn't work for me but kind of stupid that I have to pay to ship these and the adapter power cables back separate though they are going to the same place and all came in the same package.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]