[{"rating": 3.0, "review": "The Fire TV is simple to operate,  plays movies in a full 1080p and the remote operation is pretty fluid.  However,  and the reason, I give it 4 stars is it is lacking in a few places,  first off,  I travel for work,  a lot of hotels will give you a code to enter to access thier WiFi connection,  this being said,  the FIRE TV has no browser,  and therefore if a code is required to access the Internet in the hotel there is no way to enter such a code rendering the FIRE TV useless. The Second issue I have is I seem to have to change the audio output setting pretty regularly,  and there does not seem to be a \"automatic\"  setting for audio output,  since movies seem to have different audio encoding,  and since the FIRE TV doesn't just automatically adjust to the encoding you are left with a HD picture and no sound. I give it 4 stars because it needs a few improvements,  the major one being a browser.*UPDATE*So I finally got around to updating this review, Yes I have used the \"FIRE TV\" while out on the road in hotels and I can honestly say unless you have \"sideloaded\" a web browser to the FIRE TV, trying to log into the security splash screen of a hotel's wireless internet is utterly pointless, I tried using a Cat5 connection plugged into the wall as most hotels don't put security log ins on the hard line, however I am finding this more and more non existent, with that being said, since there is no browser of any kind on the stock FIRE TV, nor is there a option to download one, I have reduced my rating by yet another star because I don't think a web browser would be too much to ask for, so in short, if there is a security screen of any type that you have to enter a code in to gain access to the internet.......you're screwed.One thing I will point out, and for those of you that have a PRIME MEMBERSHIP as I do, Amazon's Prime Membership is SEVERELY LACKING including CURRENT or UP TO DATE MOVIES, when you try to select a video, all it shows you is a description, with a picture of the front cover that clearly states a CHECKMARK and next to it the words \"HD PRIME\" which leads one to believe that it is included in your membership, only to be let down once you select it and find out there is a $3.99 rental fee for the movie, or if you are watching TV its $2.99 PER EPISODE / $39.99 for the season. Personally, if I have to pay 40 bucks for a season to get all the shows, I am going to buy the Blu-Ray / DVD set and have it shipped to the house for free via the prime membership, load the digital copies to a USB stick and plug that stick into the back of the FIRE TV. Just my opinion, but if it says AMAZON PRIME with a CHECKMARK it should be included with your subscription.", "verified": true, "helpfulness": "0/0", "author": "GSHOCK75"}, {"rating": 5.0, "review": "Awesome service, awesome product, compact design, high performance. I got it solely for movies and apps, and it is definitely up to par for both. I also happen to love iheartradio on it as well. Tons of free apps as well as paid apps which are rather easy on the budget, great games, Netflix, amazon instant video... I could go on and on. add the controller like I did and you have an all in one device that will make everyone happy!!", "verified": true, "helpfulness": "0/0", "author": "Doug Hubbell"}, {"rating": 5.0, "review": "I use this everyday, the quality of the picture and sound are phenomenal. I am very pleased with the current selection of apps but would like hbo go and vudu.", "verified": true, "helpfulness": "0/0", "author": "Davit"}, {"rating": 4.0, "review": "I am extremely happy with fire tv.  It's quick and easy to use.  The only con is trying to find prime movies and tv shows that aren't recent releases.  Voice search is awesome.", "verified": true, "helpfulness": "0/0", "author": "Pethomas"}, {"rating": 2.0, "review": "I notice a regular slow down in video playback, as though the processor hits maximum throughput but still has more data to digest. Seems to occur around 45 to 60 seconds apart. It is consistent. You will see 8 to 10 frames lag, skipping intermediate frames, which makes the video stutter. It only affects video, audio seems unaffected.", "verified": false, "helpfulness": "1/1", "author": "EricW"}, {"rating": 3.0, "review": "worked fine at first...now I can't get any movies...what the hells up?", "verified": true, "helpfulness": "0/3", "author": "Gary Grant"}, {"rating": 5.0, "review": "It's awesome. Before getting this, I was using an xbox to stream netflix & amazon tv/movies. I don't play games on the xbox much and felt it was taking up space. So I decided to try out the Amazon Fire TV.It is very small and sleek. It's easy to setup and is very responsive. I got a discount on it and it arrived a day earlier than expected!", "verified": true, "helpfulness": "0/0", "author": "Tie"}, {"rating": 5.0, "review": "Previously had a Roku player, did not like it and stopped using after the first month. Bought this the day it came out. My husband and I LOVE it.  We love the options, the instant stream with Amazon Prime membership.  We cancelled cable and are never going back!", "verified": true, "helpfulness": "0/0", "author": "Cmg Denali"}, {"rating": 3.0, "review": "for the most part it is a good System.only problem is there's too many things I cannot watch ,because they all require payment twenty thousand things turned into less than 100 I was really looking forward to watching, outer limits.being on a fixed income is hard enough.", "verified": true, "helpfulness": "1/1", "author": "Edward Coombs"}, {"rating": 5.0, "review": "This item is a highest quality piece of technical gear. It is very impressive starting with the box that it is delivered in and it continues to the physical appearance, ease of hookup, ease of using and then the actual performance. We have no buyers remorse and highly recommend it to you.", "verified": false, "helpfulness": "0/0", "author": "Ronald Cribbs \"Ron Cribbs\""}]