[{"rating": 5.0, "review": "Great value and easy to use. What more can be said? Whats more, showed up at my door on time.", "verified": true, "helpfulness": "0/0", "author": "The Shoneinc"}, {"rating": 5.0, "review": "First Review: Was a nice gadget when worked. After two month will not connect. Now I have to deal with the pain of warranty claim..Updated Review: Turned out I had something wrong with my router. Restarted the router and the cast works as charm. Changing the rating from 1 to 5 stars.", "verified": true, "helpfulness": "3/3", "author": "BER"}, {"rating": 5.0, "review": "So easy to use. Great to be able to watch Netflix ont the big screen and the sound is perfect.", "verified": true, "helpfulness": "0/0", "author": "Maureen N Rogers"}, {"rating": 5.0, "review": "Great product. Very easy to use. I stream from my Samsung Galaxy S4 to the chromecast. I would definitely recommend it", "verified": true, "helpfulness": "0/0", "author": "Jimmy D'Ingillo"}, {"rating": 3.0, "review": "It works well, but is mildly difficult to control.  Instructions are very minimal.  Only can figure out how to get two apps in use.", "verified": true, "helpfulness": "0/0", "author": "Bigskyguy"}, {"rating": 5.0, "review": "OMG this is a must have on so many levels. Your Smart TV is not as smart as think if you don't have one of these!.", "verified": true, "helpfulness": "0/0", "author": "Stan C. Kingston, PA"}, {"rating": 4.0, "review": "Plugs into an HDMI port and then works it's magic.  No extra set top box needed to clutter up the area.  Good things to come as they add moreYes, you can surf/cast the web as long as you have the Chrome browser", "verified": true, "helpfulness": "0/0", "author": "Roc S \"Roc S\""}, {"rating": 5.0, "review": "Easy to setup, right out of the box. My wife uses it to stream Netflix using her cell phone while she works out in our basement. We've had it for 2 weeks and so far have found no issues", "verified": true, "helpfulness": "0/0", "author": "Ian D Baynes"}, {"rating": 4.0, "review": "nice device  límited software so maybe later it will be better. Google os seems will be great this review app sucks", "verified": true, "helpfulness": "0/0", "author": "Edin Barrientos"}, {"rating": 5.0, "review": "Excellent product!  Works as advertised with C720 Chromebook. I connect it to a home theater receiver.  Some sites are optimized for Chromecast, and those work better.  However any site that streams in Chrome can be cast in full screen mode.  It's an excellent low cost way to add browser based streaming to your home theater set up.", "verified": true, "helpfulness": "0/0", "author": "M. Sean Duffy, Esq."}]