[{"rating": 5.0, "review": "This is my first review and it's not going to be technical.  Being a mature (ahem)) person struggling to keep up with all the new technology, it seems that nothing ever installs/sets up/downloads/works/etc. as simply as advertised.  I read numerous reviews and comparisons before adding this to my Christmas wish list, and spent several days dreading setting it  up.  Imagine my amazement when it worked......immediately....without looking up \"Help\" or having to call support.  Installation was a snap, and it set itself up, recognized my router, gave me my free months of Amazon Prime and Netflix seamlessly and easily.  The remote is easy to use, and the \"voice\" is  fun and amazingly accurate.  I've used it for over a month, and have enjoyed it immensely.  I cannot think of a single negative, except maybe to wish that  all the content was free.", "verified": true, "helpfulness": "1/1", "author": "MiMi \"Tech Dummy\""}, {"rating": 5.0, "review": "love it love it love it!!!!  works perfectly with netflix.", "verified": true, "helpfulness": "0/0", "author": "ggh \"Gina Horwath\""}, {"rating": 3.0, "review": "While it does everything it says it will do , I am not that impressed.  It's just another gadget that does pretty much what my Kindle does with an HDMI cord minus the voice search.  If you own a Kindle save yur money and just purchase an HDMI cord to connect to your t.v.", "verified": true, "helpfulness": "0/3", "author": "G. Woodard"}, {"rating": 4.0, "review": "Very fast at loading streaming Hulu; nexflix amazon apps. Poor app interface and search engine for games etc. With little results most apps shown when searching on a computer don't show up on the firetv search. Needs actual google play.", "verified": true, "helpfulness": "1/1", "author": "John Mcdade \"audiofiler\""}, {"rating": 5.0, "review": "I love it!  Easy to use and lots to see.", "verified": true, "helpfulness": "0/0", "author": "John E \"desert geek\""}, {"rating": 5.0, "review": "I love that the movies and shows on Amazon prime are instant viewing and the streaming connection does not get lost in the middle of a movie like what happened while using our Roku.  I don't like that each episode runs constant and you have to stop it from playing on.  I wish you had to select each episode.  It is a small quirk that is easily ignored.", "verified": true, "helpfulness": "0/0", "author": "Nettie"}, {"rating": 5.0, "review": "Meets every expectation.", "verified": true, "helpfulness": "0/0", "author": "Richard Arruda"}, {"rating": 5.0, "review": "Very easy to use!  Great simple product.", "verified": false, "helpfulness": "0/0", "author": "Shendrix"}, {"rating": 5.0, "review": "was a gift we love it...", "verified": true, "helpfulness": "0/0", "author": "tim timmons"}, {"rating": 5.0, "review": "This is the best device yet for the TV. I have had Google TV and Chromecast and now absolutely love Fire TV and the Fire Stick. So simple to use  and find great content. Having instant access to all of our other streaming subscriptions like Netflix and Hulu is the icing on the cake.", "verified": true, "helpfulness": "0/0", "author": "David"}]