[{"rating": 5.0, "review": "This is cheap device and can turn your TV to smart TV. One thing this stick can do is live stream from youtube which I cannot do with the smarttv youtube application.", "verified": true, "helpfulness": "0/0", "author": "Patrick Tsui"}, {"rating": 5.0, "review": "Amazing product", "verified": true, "helpfulness": "0/0", "author": "Alvaro"}, {"rating": 4.0, "review": "The intended functionality, I like a lot.  Simple and does an interesting task that with Android Phones and a Chromebook around is very handy...displaying content and managing a queue of content for display or playback through the media system I have.I've never had any luck with wi-fi for streaming however and it could be local RFI (noise) that breaks my wi-fi, have never figured out the source and I work in tech.  So this device can be hit or miss for me simply because my wi-fi is not stable.  It truly requires a stable wi-fi network to function.All my other streaming devices, smart DVD, XBox etc I use a cabled connection for this reason.  I wish this had the option.", "verified": true, "helpfulness": "0/0", "author": "Kingsqueak"}, {"rating": 5.0, "review": "👍", "verified": true, "helpfulness": "0/0", "author": "Megan Lowry"}, {"rating": 4.0, "review": "Very useful...the lack of a remote type interface keeps it from being perfect.", "verified": true, "helpfulness": "0/0", "author": "Treymbx"}, {"rating": 5.0, "review": "My second Chromecast...love it!", "verified": true, "helpfulness": "0/0", "author": "Stevefxp"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "erica trejo"}, {"rating": 4.0, "review": "It's good and I believe it may be even better. Content that I already have in my phone or laptop should be able to display in the TV screen  with no need of wifi network or Internet conexión.", "verified": true, "helpfulness": "1/1", "author": "miguel"}, {"rating": 4.0, "review": "Is good!", "verified": true, "helpfulness": "0/0", "author": "Ivette A."}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "BADER ALHARBI"}]