[{"rating": 5.0, "review": "So far so good very simple and easy to use. Had to upgrade my internet speed to stream correctly but that was not a problem .", "verified": true, "helpfulness": "0/0", "author": "dan"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Karen Martin"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "MELISSA WOOD"}, {"rating": 5.0, "review": "Awesome! Fast! Great apps!", "verified": true, "helpfulness": "0/0", "author": "John Leonauskas"}, {"rating": 1.0, "review": "Thanks to the updated firmware I'm on limited on what  I can do with this device. It barely runs Xbmc. I need a device that allows me to run the apps I'm interested in. I'm looking at  the G-Box Q.", "verified": true, "helpfulness": "0/2", "author": "humbahodo"}, {"rating": 5.0, "review": "LOVE the Fire TV.  I have been mulling over a stream box for longer than a year.  When I would decide there would be news of another one coming out that surpasses.  I purchased a cheap Android box on Amazon and it was good.  Worked for me but not as clean as usual.  The Fire TV is perfect for my family.They used to hate to have to navigate the Android box and all I had to set up.  From weather to sports updates I had everything set up like a large tablet.  If you need a recommendation for something like that, just browse, it's out there.The FireTV OS is perfect for the family.  Easy for them to navigate and lots of apps.  Plus, since I am a Prime subscriber I wanted something that would let me access all that Amazon offers with that.  I love the 2 day shipping but the perks of music and movies/tv makes it well worth it.  This box makes it easy to think that this will stand the test of time.  The specs are well above anything that is the same price range unless you want to go with a no name Android box and hope that you will be happy with the OS.", "verified": true, "helpfulness": "0/0", "author": "Rosemarie"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Renold Fede"}, {"rating": 5.0, "review": "Bought as a gift for my son..we used it when he was home on break and it was really neat to have all those options on the TV..thinking of getting one for myself or at least the fire stick.", "verified": true, "helpfulness": "0/0", "author": "stask"}, {"rating": 5.0, "review": "Totally love it..the Voice commands make this a Breeze to use!The HD quality is excellent! You must have a High Speed Internet.", "verified": true, "helpfulness": "0/0", "author": "DWG"}, {"rating": 5.0, "review": "We purchased amazon prime so we could have a bigger selection to watch on Fire-TV without paying. It works great. We need to add netflix to it for more tv shows. Hope to cancel high dollar cable tv.", "verified": true, "helpfulness": "0/2", "author": "DAWN"}]