[{"rating": 5.0, "review": "I have heard a lot about the Chromecast, all of it was not good. I liked it we use it for a lot of different streaming data, movies ex. I thought it was moderately easy to install software that was free on the internet. I also installed the chrome browser, in order to use the cast devise for more web casts. We like to cast to the TV.", "verified": true, "helpfulness": "0/0", "author": "coolestfamilyever"}, {"rating": 4.0, "review": "Awesome device! Much more affordable than a roku or apple tv. Only downfall is that it often freezes my iPad when its connected. ALso, I wish that it would automatically go to the next netflix episode. Minor annoyances, but love it!", "verified": true, "helpfulness": "0/0", "author": "Sprinkle23"}, {"rating": 5.0, "review": "Super easy to install, works with both my computer and phone.  I use it mostly with Netflix and Youtube so it serves my purposes perfectly.  Will be nice when more apps are available but for the price I paid for it I'm very happy.My only recommendation is to unplug when not in use.  Mine seems to run hot, save energy and probably the device over time.", "verified": true, "helpfulness": "0/0", "author": "Bryn C \"Pegleg\""}, {"rating": 5.0, "review": "Took a bit of time configure on the computer and other devices but it works flawlessly.  Great picture quality, easy to set up, portable.  I wish I had the ability to view pics and vids on my computer to the TV.  it works basically with anything thatis viewed in Chrome or one of the Internet movie services...Netflix, etc.  But for the price you cant beat it.", "verified": true, "helpfulness": "0/0", "author": "NCosmany"}, {"rating": 5.0, "review": "I used my Nintendo Wii for my Netflix, Hulu, and Amazon content streaming.  When i got the Chromecast, it does away with the need for the Wii.I get my choice of using my phone, tablet, or laptop to act as my remote for my streaming content on my TV.  Plus, the quality picture and feed is so much better.  A great improvement from what i was using.I only wish that more streaming apps were available on this super awesome streamer!!!  Plus, it's behind your TV!!!  You don't have an extra box somewhere taking up space!", "verified": true, "helpfulness": "1/1", "author": "Stephen A. Gilbert"}, {"rating": 5.0, "review": "This was a Christmas gift for my husband and he was very happy with it. I am not very technical-minded so can't say more about it.", "verified": true, "helpfulness": "0/0", "author": "Linda K"}, {"rating": 1.0, "review": "Chromecast doesn't work as expected. Not a worthy Roku replacement. It currently stopped working and won't recognize any connected devices even after data reset.", "verified": true, "helpfulness": "0/1", "author": "JP"}, {"rating": 5.0, "review": "Easy to set up . Great to be able to  watch video on a big screen. Now I can see what my husband is laughing at online.", "verified": true, "helpfulness": "0/1", "author": "Kathi MacNeill"}, {"rating": 5.0, "review": "I was skeptical about the Chromecast device because I wasn't sure exactly how it worked.  Once I received it the light went on.  Here are the things you should know.  You need to have HDMI and USB (the USB powers the device) connections on the side of your TV OR be able to get to them on the back of your TV and you need to have your own WiFi connection,  You need to install Chromecast on your phone or laptop etc.  Once installed you can connect using your Wifi connection.  Make sure you have your WiFi router password (It's just like connecting your smart phone to your network.  You can then (if you have and account) connect to Netflix and YouTube.  Make sure you select the right input on your TV.  Once done you can take the device and connect it to any TVs in your home that have the same ports and it will work.", "verified": true, "helpfulness": "0/0", "author": "Dano1988 \"Dano\""}, {"rating": 4.0, "review": "Had one since 1st day. Struggles with HD content often times but works pretty well. Got my parents and bro-in-law one for Christmas. They liked it. Easy to install and easy to use.", "verified": true, "helpfulness": "0/0", "author": "JimyVee"}]