[{"rating": 5.0, "review": "Took a couple tries to connect the first time but has performed perfectly since then.  I would recomend to anyone that knows what it is for and recognizes its limitations. Seriously though, its one of my favorite tech purchases ever.", "verified": true, "helpfulness": "0/1", "author": "rustymx"}, {"rating": 3.0, "review": "The unit set up was very easy. I hoped that I could watch more than just a single tab though.  There seem to be more apps becoming compatible with the Chromecast.  That will be helpful.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jason Ball\""}, {"rating": 5.0, "review": "Setup was a breeze.  I don't have a TV a newer HDMI port so I had to add the attached USB cable and plug it into an open USB port on the TV to get power for the unit.  Follow the simple directions from the guide included in the box and also get the Chromecast extension for your Chrome browser.  Within 5 minutes I was up, running, and 'casting' videos and web pages to my TV.", "verified": true, "helpfulness": "1/1", "author": "fbara"}, {"rating": 5.0, "review": "Simple to set up and works great with new smart tv to created super entertainment.  Great find! Highly recommend to anyone wanting the extra edge", "verified": true, "helpfulness": "0/0", "author": "julie gwinner"}, {"rating": 5.0, "review": "It is easy to setup and awesome to stream!! Totally enjoy having this! A must have for every gadget wizz and movie buff", "verified": true, "helpfulness": "0/0", "author": "ShkMD"}, {"rating": 1.0, "review": "It was working for 3 months.  However, it would be a bit shoddy with reception and especially fast moving video such as sports.The other day I went to use it and it didn't work.  I've done everything to troubleshoot it and called Google support and they made me go through all of the steps that I had already gone through before calling.  They still couldn't get it to work.  They said my wireless router is not listed as incompatible but they're sent me a list of changes to make to my router settings.  Then they said if that didn't work, they'd have to get a specialist involved and if that didn't work, they may replace it under warranty.That's one hell of a list of hoops to jump through and a lot of \"Ifs\"...  They're trying to blame it on my router which it worked on perfectly fine until this week.  Well Google, welcome to the computer hardware industry!!  You have to stand by your product.  It's a $35 product that probably only costs you $5.  Replace the f-ing thing.  Greedy cheap asses!!I'm telling everyone I know about this.  You may be good with software but you'll get slaughtered by your hardware competition.", "verified": true, "helpfulness": "0/1", "author": "Shane Thomas Robson"}, {"rating": 3.0, "review": "I love the price of this item.  If you want to watch NetFlix or YouTube on your TV without using cables, this thing is great.  However, it makes no sense and is maddening beyond belief that it works extremely poorly with Google Play Movies.  Um, hello?  Google Chromecast and Google Play Movies playing well together, nay perfectly, on your TV without troubles should be what this thing does best, not worst.  And i have hear that some folks have the opposite problem, that Google Play Movies work well and Netflix not so much.  In short, great item for the price, but they need to work out the kinks.  I'd pay $50 for one that works perfectly.", "verified": true, "helpfulness": "0/0", "author": "Christopher Nelson"}, {"rating": 2.0, "review": "I bought my Chromecast about a month or two ago on Amazon and loved it. I watched youtube videos, netflix, and google play and never a problem. Recently I started having problems with youtube. It wont play the video and I get an error message that says \"There was an error playing this video, please choose another video\" I get this message constantly on youtube and it has gotten to the point that I get it every time.Earlier today the device showed that it was installing an update but since then it has been almost completely unable to cast from youtube. I now have a device that is great for netflix but youtube is no longer an option. I gave it a 2 because I can you youtube but I am very unhappy that I cant use youtube at all. I searched the net and found countless people who had the same problem. Just search Chromecast and There was an error playing this video, please choose another video and you will quick;y get the idea. If you want it for netflix, great, for youtube, good luck.  I just cant figure out why it worked so well with youtube for awhile and then crapped out. Piece of crap.", "verified": true, "helpfulness": "0/1", "author": "Garland Nixon"}, {"rating": 5.0, "review": "I owned roku xs 2 before I ordered chromecast.I used them both simultaneously. I plugged roku to my receiver if I want to pass the sound through my sound system. The chromecast connected directly to TV.The main difference between google and roku is with roku, you have to browse every channel to get what you want. Yes, there are cast apps too on the roku but still need to go through multiple steps.With chromecast, you can instantly cast anything even from your web browser. No need to go through multiple steps. Quality of sound & picture very similiar to roku.I loved the flexibility of it. Plus google plan to invest more on developing the apps for chromecast in 2014 is very promising. go get it before the price goes up.", "verified": true, "helpfulness": "0/0", "author": "Kits \"Cats\""}, {"rating": 5.0, "review": "use your android cell phone or tablet, or your PC to stream Netflix and YouTube to the TV.  very easy to install and set-up.  (so good, I bought one for every TV in the house.)", "verified": true, "helpfulness": "0/0", "author": "Michael A Jacobs"}]