[{"rating": 5.0, "review": "Can't live without it now.  Bought two.", "verified": true, "helpfulness": "0/0", "author": "R. Hayden \"RH\""}, {"rating": 5.0, "review": "Does what it's supposed to do really well.", "verified": true, "helpfulness": "0/0", "author": "gustavo guzman"}, {"rating": 5.0, "review": "Exactly as described. Quick shipping. Husband LOVES it!", "verified": true, "helpfulness": "0/0", "author": "Meshia Burry"}, {"rating": 1.0, "review": "I have had it a few months, and now when I try to use it. It no longer works. It will stream from the computer to the TV if you are doing anything BUT watching videos. Which is exactly why I bought it. Completely a waist of money.", "verified": true, "helpfulness": "0/1", "author": "J.M.I \"Ciao!\""}, {"rating": 5.0, "review": "Awsome", "verified": true, "helpfulness": "0/0", "author": "Anthony Garcia"}, {"rating": 5.0, "review": "It's like $35 ... does Netflix and if you have an Android phone you can share you entire screen. Just do it ... I have 3 of them.", "verified": true, "helpfulness": "0/0", "author": "Andre Xavier Mosley"}, {"rating": 5.0, "review": "If you don't know what this is by now, you're probably one of my parents.  Works great for streaming movies and youtube.  Friends and family think it's voodoo.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I now own all the streaming media players.  Chromecast is my least favorite.  Working with Ipads is impossible, and the ability to use it over seas is also bad.  There is no way for your to change DNS settings so it's worthless unless you live in the USA.  And if you do live in the USA, why don't you just buy the Amazon Fire Stick or and Apple TV.  It's much better.", "verified": true, "helpfulness": "0/0", "author": "Alan D."}, {"rating": 4.0, "review": "A bit of a pain to set up with a Belkin router, but once you figure it out its a pretty cool little device to have.", "verified": true, "helpfulness": "0/0", "author": "D. Brown"}, {"rating": 5.0, "review": "Freaking awesome! No really, talk about very useful. Bought one from BestBuy then decided I needed 4 more. One for each TV.", "verified": true, "helpfulness": "0/0", "author": "Dan"}]