[{"rating": 5.0, "review": "Pays for its self in a couple of months if you buy from Amazon like I do in Freight savings with Prime. I really like the voice ability to change a movie, etc.,. Works right out of the box and is easier to use than my Roku 3. I will buy again if needed! The main part of the Amazon Fire TV is also of heavier construction , which is great for the wires!", "verified": true, "helpfulness": "2/2", "author": "Chemicalman588"}, {"rating": 5.0, "review": "I love, love, love my Amazon Fire TV! Quick shipping with Prime Membership benefits, Easy setup, Navigation Made Simple and fast so I can find my favorite shows, & the selection of free available shows is so much more than what I expected!  So much so, that I am buying second one! I've had mine now for about a month & I'm still finding new ways to watch the shows I like.  I love the free applications that link you to cable network channels were you have access to free full episodes!", "verified": true, "helpfulness": "1/1", "author": "Leaveamessg \"DAC\""}, {"rating": 3.0, "review": "I bought this as I am fairly well committed to amazon. I find it faster and clearer on a regular basis then ROKU.  However my really big gripe is the sound on amazon movies.  When I use the dobly option, I have to turn up the volume fairly high on my Bose 321 to get sound, This is not an issue with Nexflix app only Amazon when I stream movies. This has caused me to go and turn off the dolby option. Other then that I have no gripes and would still recommend it.  ( I would like to know why there is a USBi input and no function for it)", "verified": true, "helpfulness": "1/2", "author": "Bill"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "1/1", "author": "Guido Baechler \"movie producer\""}, {"rating": 5.0, "review": "If TV in a box love is possible, then you will find it here.First off, let me start by saying I LOVE THIS! I have tried different streaming media players and none compaired to the Fire TV. Initially, I was under the impression that this unit would be like the others on the market, like the Roku and Apple TV, both which I have tried, but this out performs the competition with out a doubt. I also tried going the Chromecast route, but I was disappointed in the lack of features.Upon opening the box, I was greeted by a black sleek masterpiece and one sleek remote. I grabbed my HDMI cable and set up the Fire to my TV in less than 2 minutes. I turned on the unit and I was pleasantly surprised by the layout. Easy to read and navigate, and the voice feature was spot on.This unit comes pre loaded with apps, such as Amazon, Hulu, Netflix and Pandora to name a few, but here is where the magic begins. Unlike the above mentioned media players, the Fire TV goes above and beyond by letting you download others apps that are not only Amazon apps. This was worth it's weight in gold. I am normally an lover of all things Apple, but this outperforms. The ability to download whatever app you want is amazing; you are not limited by what Amazon allows for content on the Fire like all the other media streaming devices. You can google how to add \"unapproved\" apps and step by step instructions are available. If your not into adding apps, then this unit stands alone just fine with the preloaded as well.My main objective for buying a streaming media player was to ditch the big monthly cable/dish bill. I was done paying over $80.00 a month. This until paid for itself in one month, and I am excited to say that my monthly TV entertainment bill is $15.00 per month with a subscription to Netflix and Hulu. There are also free apps pre loaded on the Fire that do not require a subscription, which is amazing as well.If you are looking for a seamless and easy to navigate media streaming device then look no further, you will not be disappointed!", "verified": true, "helpfulness": "2/3", "author": "Jilian V"}, {"rating": 5.0, "review": "Love it, my kids fight for the remote.......", "verified": true, "helpfulness": "0/0", "author": "Kim Courtney"}, {"rating": 5.0, "review": "Most of the stuff we want to watch costs on Amazon. But, the Hulu+ and Netflix Apps are no charge. Works great and easy to use. Fast access and great 1080 and sound. Very easy to setup. Looking forward to learning more about it.", "verified": false, "helpfulness": "0/0", "author": "tiffany"}, {"rating": 5.0, "review": "I've previously owned an XBOX 360 and a Roku. I felt they did a good job for streaming content (Movies, videos) until I tried the Fire TV. Since then my expectations have dramatically changed in terms of response time and ease of navigation. Fire TV is not only super fast but it also has a very intuitive navigation. Best purchased I've made in the last few months.", "verified": true, "helpfulness": "0/1", "author": "Sanchez"}, {"rating": 2.0, "review": "Not as many option as compared to competitions. I love the fact this device has the power needed for a good experience but there isn't as much to experience in general.", "verified": true, "helpfulness": "1/2", "author": "D. Howard"}, {"rating": 5.0, "review": "Question....Do you have to have a subscription to Comcast to use the prime channels or are they a part of your Amazon Prime subscription. Sorry if this sounds like a dumb question, but I hate Comcast and I don't want to waste my money if they have to be included.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"Cassandra\""}]