[{"rating": 5.0, "review": "Works perfect!", "verified": true, "helpfulness": "0/0", "author": "Heath Oustad"}, {"rating": 5.0, "review": "Fanastic", "verified": true, "helpfulness": "0/0", "author": "Dragan Moraca"}, {"rating": 3.0, "review": "The idea is really cool, and the setup is nice too. I just didn't fall in love with it and integrate it into my life. Sure I use it occasionally and it works well most of the time. Drops Wifi occasionally, but that may be my system.", "verified": true, "helpfulness": "0/0", "author": "melka"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Rodrigo"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Joey Emory"}, {"rating": 5.0, "review": "I love using my chrome cast. One of the best investments you can make", "verified": false, "helpfulness": "0/0", "author": "Carter Cagle"}, {"rating": 3.0, "review": "Its cool the idea but not enough apps, the streaming is not as fast as I wish (20 Mb speed)", "verified": true, "helpfulness": "0/0", "author": "Gus_X"}, {"rating": 5.0, "review": "A very cool little gadget! Does just about everything our Roku's did, and it does it in an incredibly small, no muss, no fuss thumb drive sized package. The ingenious control interface, via free smartphone ap, is very easy to use.  Strongly recommended for those who want a versatile, affordable entertainment package in a very small, inexpensive package.", "verified": true, "helpfulness": "0/0", "author": "W. Church"}, {"rating": 5.0, "review": "Cool product and good service, would purchase again..", "verified": true, "helpfulness": "0/0", "author": "Jimmie"}, {"rating": 5.0, "review": "Love it! Well worth the investment for me personally.One thing to keep in mind though is the fact that Chromecast ONLY does a certain amount. It does what it does well but you should really check out the features on the device before buying it. There is a wealth of information online in the form of guides, blogs and Google's own explanations. Google it! Make sure it is worth the investment for you needs.", "verified": true, "helpfulness": "0/0", "author": "Chris Hamilton"}]