[{"rating": 2.0, "review": "Does not flow properly with satellite internet, I tried two different internet companies. Even high-energy generation 4.", "verified": false, "helpfulness": "0/5", "author": "Jeffemail"}, {"rating": 3.0, "review": "I have a question and couldn't another place to ask, so I'm asking here.  I need ONLY the music side of this device because I already have devices that have most if not all of the video content.Is there an \"app\" that would work as a remote control for this device?  I can't hook this device to a TV or monitor, so I need to be able to see what is on the device to choose the music source.  My Squeezebox and Sonos has this type of app, but I can't seem to find if the Fire TV does?The app would need to work on either an iPhone or an Android device.Thanks!", "verified": false, "helpfulness": "0/11", "author": "Mr. Audio \"Mr. Audio\""}, {"rating": 5.0, "review": "I LOVE IT!  Amazon has hit it out the park!  So fast and the voice search is really accurate!  Great choices to apps (I just wish you had VUDU) so easy to use! Great Price!", "verified": true, "helpfulness": "0/0", "author": "Lori Metoxen"}, {"rating": 5.0, "review": "We have 2... one for my family and one for my mom...Love it!", "verified": true, "helpfulness": "0/0", "author": "AmaRani Foster"}, {"rating": 3.0, "review": "My worst fears came true. This device consistently steers me towards paid Amazon Prime movies. In the same time I  got no notification that the same movie is free with  Netflix or You-tube. Check \"once upon a Time\"  and \"clone wars\" both free on Netlix but you will pay for them with Amazon prime.  And the  You-tube app is down right pitiful.", "verified": true, "helpfulness": "0/7", "author": "Liliana Ungureanu"}, {"rating": 5.0, "review": "I've been meaning to write a few good words about this wonder box for some time now. It has become such an integral part of our home's entertainment system that I don't even know it's there. Tiny little black box hiding behind the TV stand and totally unobtrusive, a tiny little white LED lights up when woken up instantly on demand, I press the microphone button on the little remote control and say \"Flashpoint\"...and instantly the Canadian S.W.A.T. show comes up and I watch whatever episode I haven't already seen. I say, \"Extant\", or \"Under the Dome\"...they all pop up.That little box can do more. It has quad-core processing capability, several gigabytes of fast RAM. It's capable of doing pretty much anything. But as an entertainment tool, I'm actually spending more time using this little black box than with the cable box.The remote control has 7 buttons: the magic microphone button I eluded to earlier, rewind/pause/forward, back/home/settings. It's awesome, what more can I say?", "verified": true, "helpfulness": "0/0", "author": "Erol Esen"}, {"rating": 5.0, "review": "Great system!!!  We like it better than the Apple TV for sure.", "verified": true, "helpfulness": "0/0", "author": "A. A. Rodriguez \"futures trader\""}, {"rating": 5.0, "review": "In an era of endless gadgets, this one stands out as one of the best.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 3.0, "review": "No Go on HBO GO. When I contacted Amazon several times regarding NO HBO GO, they couldn't, or rather wouldn't, give a date when HBO GO would be available.  Stick with ROKU if you want HBO GO.  Otherwise this is a good product, bordering on excellent.", "verified": true, "helpfulness": "0/8", "author": "Linda-Rocky Mountains"}, {"rating": 5.0, "review": "This is a great addition to gadget crazies like me. Using the microphone to speak the movie's name or actor's name is an additional all of these devices should have. I've got two Apple TVs, one Roku and the Amazon Fire; its the latter that I like most. I also bought an Amazon Fire HDX which also rocks!!", "verified": true, "helpfulness": "0/0", "author": "David \"davidwerble\""}]