[{"rating": 4.0, "review": "I bought this with the hope of using it while in the hospital so I wouldnt be stuck with their limited channels. But that is when I found out that this doesnt work on Guest or Open Networks, This is due to the port that is required to be opened so it needs to be on a home or managed network. Now that I'm home I havent had the chance to use it. I plan on putting it on an upstairs TV in my office but since i cant go upstairs due to the severity of my injuries, it can wait. I also suggest that you make sure your TV has a side-mounted HDMI port. If not it can go in the rear but make sure you get a 90degree HDMI adapter. Preferably one that is hinged. Or even a 3ft HDMI extender cable. Most rear HDMI ports are recessed and if you have your TV wall-mounted, it likely wont have space to go in straight. Still, cant wait to put this in my office which means I wont have to run another cable line upstairs. And that alone is worth it (plus the very low price)!!", "verified": true, "helpfulness": "0/0", "author": "The Dark Side Shopper"}, {"rating": 3.0, "review": "It has great potential, but still early days.I hooked it up with my Vizio and was controlling from my HP laptop. Setup was easy.Videos lag on TV with this dongle.", "verified": true, "helpfulness": "0/1", "author": "DS"}, {"rating": 3.0, "review": "Unless you have a very exspensive wifi set up at home dont waste your money. My set up is good enough to run multiple gamng systems but I cant watch a movie from my laptop in my room on my bedroom tv and a repeater in my room without it cutting out so all I can say is it is crap !!", "verified": false, "helpfulness": "0/1", "author": "Greg"}, {"rating": 2.0, "review": "I give it 1 star for the easy, intuitive setup. However, as a device it is totally useless and relegated to a drawer in my entertainment system. I wanted this device to augment my Roku where select content was unavailable, or I want to stream local media. However, the delay and stuttering renders it unusable. I have a high speed internet connection, a newish Asus Laptop with 6GB of ram, and a year old, high speed Cisco/Linksys router. My Roku performs flawlessly. My Chromecase...not so much", "verified": false, "helpfulness": "0/0", "author": "CrazyReviewInLI"}, {"rating": 5.0, "review": "cheep and easy, 10 min set up between plugging in, downloading apps and connecting to your wifi for any modern person. (I am 20 yrs old) . Remember to download the chrome desktop extension to make it basically wireless hdmi for your computer, or maybe even chromebook? chrome has come a log way and can read/run alot, including movies I have saved on my pc. I have two just because they are so cheep", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 4.0, "review": "I think the product is what it is. It streams video from devices that support Google Chromecast but that's it. There's nothing about it at the moment that makes it better than the competition (Roku, Apple TV, Amazon Fire TV etc.)", "verified": true, "helpfulness": "0/0", "author": "DynamicTim \"Advertising | UX | Branding\""}, {"rating": 5.0, "review": "Chromecast is just amazing. We use it for HBO Go and Netflix and are hoping soon that Amazon streaming services are added!", "verified": true, "helpfulness": "0/0", "author": "jhawk24"}, {"rating": 2.0, "review": "I'm unsure why, but Chromecast did not work very well, frequently jarring on the screen.  Followed troubleshooting steps to reduce quality, but not much change.", "verified": true, "helpfulness": "0/0", "author": "Scott R Farnum"}, {"rating": 4.0, "review": "I use this to stream from my phone and tablet, and it basically works well.  Lots of potential and I'm weeks from cutting the cord.  Wish there were more apps now (MX Player please?) but I'm sure with time more will meet the Google standards.  No problem setting up or using, haven't had to reset it like others have but maybe I'm just lucky.", "verified": true, "helpfulness": "0/0", "author": "Andrew J Maier"}, {"rating": 5.0, "review": "I got this one as a gift for my father in law, this thing is just awesome, I have one on each tv that I have at home.Keep up the good work Google!", "verified": true, "helpfulness": "0/0", "author": "Elias Sierra"}]