[{"rating": 2.0, "review": "I bought the Chromecast and when I installed it on my Smart TV it literally knocked my netflix off as well as my wireless printer.  I am not sure but shortly after installing my router went down?  I also realized that programs I hoped to stream would cost me dollars also, so I returned the Chromecast and spent the next week getting back online. Very frustrating.", "verified": false, "helpfulness": "0/1", "author": "gooddealgal \"gooddealgal\""}, {"rating": 4.0, "review": "I bought one of these to use with my new 60\" tv that I bought myself for my birthday.  The features that it offered for the price is unbeatable. so I tried it.  And I have been more than satisfied with my purchase.  I can just use my phone or tablet or laptop to connect to the chromecast watch my Netflix, Crackle, Vevo, youtube or any other app that supports chromecast. And the list of supported apps keeps growing.  Basically any app that has video playback or picture view is or will be supported by Chromecast.  It is well worth the 35 bucks that is costs to own one of these bad boys.  Also, it was a breeze to hook up and get connected, and once you are set up, connecting up to your apps is super easy. Also anyone in the family can connect up their devices to play through the chromecast as well.  The kids love pulling up youtube videos on the tv. Do yourself a favor and make this purchase. You will love it.", "verified": false, "helpfulness": "0/0", "author": "Travis Byrd"}, {"rating": 4.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Alejandro Panteon"}, {"rating": 3.0, "review": "Good product, but wouldn't connect to my Access point/Bridge without changing the settings on the router. I have an expensive wireless router set up as a bridge, for various reasons, and those settings will not allow Chromecast to connect to my network.", "verified": true, "helpfulness": "0/0", "author": "Brian Thorn"}, {"rating": 5.0, "review": "Excellent service, it's a awesome product.", "verified": true, "helpfulness": "0/0", "author": "Francisco Tomassoni"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "kwt"}, {"rating": 5.0, "review": "Excellent device!!! The children love it!!", "verified": true, "helpfulness": "0/0", "author": "G. Bailey \"G.B.\""}, {"rating": 5.0, "review": "Works really well even on an international basis", "verified": true, "helpfulness": "0/0", "author": "breese"}, {"rating": 3.0, "review": "still cant do what I wanted", "verified": true, "helpfulness": "0/2", "author": "richard obrien"}, {"rating": 4.0, "review": "Worked great for a few years, now I've graduated to Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "Sandy Manisco"}]