[{"rating": 5.0, "review": "Well I got this to replace my Ouya.  I go the Ouya mostly because Plex and XBMC, cheap and flexible.  But it is slow and not all the bugs have been figured out.  XBMC does not have an official app for this yet, but there is a way around it.  I haven't try it yet.  Anyway, the little machine works.  And yes, works better than Apple TV.  Most of everything out there do anyway.  It is lightning fast with no lag between the control and unit.  I love the fact that I do not have to point at the damn box like the ATV.  The remote has a nice feel to it.The complaints that I read are ridiculous.  I read one that was complaining the keyboard layout? OMG, if you think alphabetical is better than QWERTY, it means that you do not even know how to type or own a computer.  If you use a computer for more than 3 or 4 hours a day, QWERTY is the best way to go.  I get lost with those alphabetical keyboards.  So it does and update before starting? It takes just a little while, unless your Internet speed sucks. Which is why I guess these people are complaining.I have watched Hulu, Netflix, Crackle and Plex with no problems.  Everything looks awesome.  I have a Viera TV and everything looks great.So it does not have HBO GO.  The main reason to have these boxes is to cut the cable.  Well, HBO Go is cable.  Who cares about HBO?  I won't use it and none of the cable cutters will use it either.This will be my main box now.  The Apple TV is going to my kid's room and the Ouya to the spare TV.  I have a Roku as well and yes, this AFTV is way faster.  I love the little gadget.I don't like the Prime videos thing and that Amazon is trying to push their products.  Well, who can blame them?  They are a business after all.  They do have to fix that thing where you can't access all the videos though.  They probably will if enough people complain.", "verified": true, "helpfulness": "4/6", "author": "He who does not know anything"}, {"rating": 1.0, "review": "IF YOU ARE NOT IN THE U.S YOU WON'T BE ABLE TO WATCH MOVIES AND TV SHOWS O ANYTHING ! YOU WILL ONLY BE ABLE TO WATCH NETFLIX. I THINK AMAZON SHOULD TELL THIS TO THE COSTUMERS WITH BILLING ADRESSES OUTSIDE THE U.S BEFORE THEY COMPLETE THE TRANSACTION. IS THIS A FAST PRODUCT ? YES. BUT IF YOU ARE NOT IN THE U.S IT DOES ONLY WORK WITH 10% OF ITS FEATURES. IF YOU ARE NOT IN THE U.S GO WITH APPLE TV 100 %. VERY ANGRY WITH AMAZON SINCE IM NOT IN THE U.S ANYMORE TO SEND TE PRODUCT AND GET MY MONEY BACK.", "verified": true, "helpfulness": "5/29", "author": "Muller"}, {"rating": 3.0, "review": "Well, I went ahead a purchased my Amazon Fire TV even though it didn't have HBO GO.  I thought well at least it has ShowtimeAnytime.  But, to my great disappointment when I tried to register my Showtime account it didn't work because I have Directv.  I guess they do not have a deal for streaming Showtime with Directv.  U-Verse yes, Directv no!  The unit is good other than the lack of streaming HBO & Showtime.  It is very fast and the picture is excellent.  I just hope they add more apps in the near future.", "verified": true, "helpfulness": "3/13", "author": "Michael Hopper"}, {"rating": 3.0, "review": "Just got it a few days ago, really quickly, and I am not even a Prime member. Love the voice feature!", "verified": true, "helpfulness": "0/1", "author": "Jeffrey A. Waggaman"}, {"rating": 3.0, "review": "I bought this to replace a Roku which was outdated so I could watch WWE network, but it turns out this doesn't get the WWE app. as I had read it would. When i asked a rep why I couldn't find the app, he explained that this was a common request but Amazon does not offer the app after all. So this is just another device that I did not really need. Probably works great as advertised but I am wondering why some reviews said it would get the WWE network when it doesn't. ------ confused and disappointed.", "verified": true, "helpfulness": "0/5", "author": "Mr D."}, {"rating": 5.0, "review": "Its perfect.  I love that it came preloaded with my account information so I did not have to set it up.  From unwrapping to using it was under 10 minutes.  I had to find where I put the HDMI cable otherwise I think I could have had it up and running in 5 minutes.The voice command works flawlessly, when I turn it on it automatically goes to the right input on the-TV.  I was able to teach my elderly mother how to use it in under an hour.  The voice command made all the difference.  I previously had a Chrome-cast and had to return it as it was frustrating to use.When my contract is up the satellite company I will close that account as I have all I need with the Fire and its apps.", "verified": true, "helpfulness": "1/1", "author": "Lisa J. Lindsay"}, {"rating": 3.0, "review": "The interface and remote are great. Voice search works very well, but like my title says, it's all only useful when staying within Amazon's content.Go to Netflix, or any other app, and you've got nothing more than a roku box at best.Does not offer ANY local playback of any kind. You can use plex, but that requires running a PC at all times. No thanks!Get the voice search across all apps, and make any local file playable (MKV is a must), and I'd be happy!Amazon may bend over for the movie studios, like apple and everyone else, but MKV is a required format these days! Make the fire TV play ANY MKV file, and you'd have a sure fire (no pun intended) hit here.  I do not illegally download anything, ever, but I absolutely do use MKV very frequently. No MKV support means I have to go back to my WD TV and Chromecast. That combo is still the best cord cutter option available.", "verified": true, "helpfulness": "5/8", "author": "Jon"}, {"rating": 5.0, "review": "I received this tiny box a week ago and set it up in about 5 minutes. It took me about 30 minutes to run another HDMI cable through my wall to get to the Fire- another story. The microphone on the Fire remote is amazing. Works perfectly so far. I would recommend this to anyone. My dumb plasma big TV is now a smart TV.", "verified": true, "helpfulness": "1/1", "author": "S. Elliott"}, {"rating": 5.0, "review": "Fast and easy to use. Setup could not be easier, the voice search works very well and returns searches almost instantly.", "verified": true, "helpfulness": "0/0", "author": "Michael J Carlile"}, {"rating": 4.0, "review": "This thing is awesome.  The search function is ten times easier than the other black box.  I wish it had a \"Prime Only\" search feature, but I'm sure they do that to get you to rent.  I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Louis Wilham"}]