[{"rating": 3.0, "review": "This is a great concept, but at the moment it is very limited as to what it can do. Great for streaming YOUTUBE and NETFLIX onto your TV, but my TV already has those functions. You can broadcast whatever is open in your PC's Chrome browser, but not if it's playing a video. You also cannot broadcast your browser pages from your phone/tablet. Great future potential, I just hope they keep updating.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Works just like it says. Easy to set up. I would recommend this product to anyone that has kids. It is also a great gift for someone that is an electronics fanatic.", "verified": true, "helpfulness": "0/0", "author": "tbanhog"}, {"rating": 1.0, "review": "I received a product with defect, When I plug in it on my TV, only appears a black screen with colors dots, and a light on Chromecast is red. I send a email for Google Support and they say that my Chromecast needs to be change because the reset button is stuck.I'm very sad with this product. with Google and with Amazon for send a defective produto. And now I'll need send to back this product from Brazil to USA. And this will be many expensive. Don't buy this product online, because you need view if the reset buttons is stuck, or you may have the same problem the me.", "verified": true, "helpfulness": "4/6", "author": "aristenio monteiro filho"}, {"rating": 1.0, "review": "I originally tried this on a friends tv and wifi. Since then, it won't remember my wifi and always looks for his wifi. Thus, every time i want to use it , I have to start over. This is hugely annoying and I am guessing I won't ever use it. Wishing I had just bought an Apple TV. :(", "verified": true, "helpfulness": "2/3", "author": "Justin Hieggelke"}, {"rating": 2.0, "review": "It is not ready for local media yet. i still waiting for Google's actualization!!!! not good product, but there us not exist some kind product like gc", "verified": true, "helpfulness": "0/1", "author": "andres donoso"}, {"rating": 3.0, "review": "This product has a lot of potential if properly supported. Hopefully it doesn't end up like google tv. It has a great price point.", "verified": true, "helpfulness": "0/0", "author": "Naezer2"}, {"rating": 5.0, "review": "Very useful gadget for home! The most easy way to watch video fro youtube or online movies through google chrome!", "verified": true, "helpfulness": "1/1", "author": "Oleg"}, {"rating": 5.0, "review": "If you need to watch YouTube or Netflix right on your TV and control the playback from your phone or mac/pc - this is the thing you need to buy.", "verified": true, "helpfulness": "0/0", "author": "Eugene Slesarchuk"}, {"rating": 5.0, "review": "Love it! I can instantly stream Netflix or YouTube or music to my TV from my device with the touch of an icon. Quality is great for everything, except off a laptop using Google Cast, only downside right now is the limited apps compatible. Developers have dozens of apps ready for this device but can't share them, all they're waiting for is you Google, hurry up!!", "verified": true, "helpfulness": "0/0", "author": "JayFdz"}, {"rating": 5.0, "review": "May be a little hassle to set up at first if you do not know what you are doing. But as long as you follow the instructions accurately it should work like a charm.", "verified": true, "helpfulness": "0/0", "author": "Cuan Chai Megghross"}]