[{"rating": 5.0, "review": "Awesome product I can't seem to not Ute out everyday I get home from work during the days. Thanks Google", "verified": true, "helpfulness": "0/0", "author": "Stephen Tyrell"}, {"rating": 2.0, "review": "Google tried to come up with a great idea\\product without the support from other major companies. Works great with YouTube and Chrome - only!!- Amazon video app won't  work after the installation.", "verified": true, "helpfulness": "0/1", "author": "Jorge Cordero"}, {"rating": 2.0, "review": "Good idea but extremely limited. Needs apps, I was under the assumption that you'd get the google play store app with this and you could download apps to this...not the case. You can use YouTube, and netflix that's pretty much it and you need to use your smart phone to launch these apps. Perhaps it will be updated in the future", "verified": true, "helpfulness": "0/0", "author": "saeid balaei"}, {"rating": 5.0, "review": "Very simple setup. Good reception. Small yet very powerful .Price is great. Control thru your device so easy.It will be a must have to anyone who is into NETFLIX AND YOUTUBE.", "verified": true, "helpfulness": "0/0", "author": "Juan Solis"}, {"rating": 5.0, "review": "Outstanding product my family and I love watching movies via this device.  It works flawlessly and streams movie clearly to our TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I mainly use it to stream Netflix, which works great!Don't have to connect my laptop/tablet/phone to the tv anymore,just cast it, and it will stream right through the dongle,and you're free to do other stuff on your pc/tablet/phone.It really needs to get more apps supporting this,including making it available for Windows devices as well.I just got a 2nd one.You can play on one TV, pause it and tell to start again on TV in a different room.Pretty handy!", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Been waiting on this one for a while, and glad to say that it lived up to the hype.  Took about 10 minutes to setup using my iPhone.  Plugged right into an HDMI port on my projector, connected to power, and then used the iPhone app to actually setup the device.  Now I can stream Netflix straight to my projector and use the iPhone as essentially the remote to my TV.", "verified": true, "helpfulness": "0/0", "author": "Brad Wells"}, {"rating": 5.0, "review": "This item is wonderful!!!  It was extremely easy to install and very inexpensive.  It's a great way to stream Netflex.", "verified": true, "helpfulness": "0/0", "author": "Linda85614"}, {"rating": 3.0, "review": "I bought this to cast from my computer to my TV without having to hook my laptop to the tv. It is supposed to do that, but there are minimum system requirements needed which are not mentioned on the Amazon page. All is says is Windows 7 or 8, but it does not mention processor speed. Unless you have at least an intel core i3 processor it will not cast and stream at all. You need at least a core i5 3rd or 4th generation for high streaming quality.", "verified": true, "helpfulness": "0/0", "author": "Avid reader"}, {"rating": 1.0, "review": "After setting-up & updating my Chromecast it just stop workingLight burning but -- No access -- No homepage view -- Factory reset don't work -- Nothing on Google's help pages work -- Nothing to do but to throw away....or return (but return package cost from South Africa will cost more than buying a new CC...)", "verified": true, "helpfulness": "0/1", "author": "HesselD"}]