[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Betty Richardson"}, {"rating": 5.0, "review": "I use it everyday. So far works with YouTube only, unless there are more sites I don't know about.  Easy to install and use, highly recommended.", "verified": true, "helpfulness": "0/0", "author": "J.B."}, {"rating": 5.0, "review": "Love this thing. syncs easily and new new apps seemingly come out daily for it.", "verified": true, "helpfulness": "0/0", "author": "Daniel Gibson"}, {"rating": 5.0, "review": "Great product. Especially pairing it with compatible sites.", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 4.0, "review": "Doesn't always hookup.", "verified": true, "helpfulness": "0/0", "author": "Robert M. Tabor"}, {"rating": 5.0, "review": "Good product", "verified": true, "helpfulness": "0/0", "author": "Brian Sanders"}, {"rating": 5.0, "review": "Soo awesome, now I want one on all of my TV's. I don't own an iPhone, but Google Apps installed on an iPhone will work with your Chromecast... For example, YouTube on iPhone will cast, no problem. But I'm an Android guy,, so my Note 4 works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Gary Stover Jr"}, {"rating": 2.0, "review": "Even though my Galaxy Nexus is a Google phone many of the features are not usable because it is running 4.2.2If your phone or tablet is running less than a 4.4.2 operating system prepare to be disappointed.Google lists compatible devices but conveniently forgot  to mention it in the product specs.Roku is the way to go.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 5.0, "review": "I have had the Chromecast for about 2 months now and it has totally replaced all of my entertainment streaming devices.  I use to use PlayStation or Blu-ray player for Netflix, Hulu, and Playon; but now I just the Chromecast.  The unit does get a little hot and I had to buy a short USB micro cable to power it from the TV without a big bundle of wires.  I will say that most APPS are not compatible with the Chromecast but since I have a Nexus devise I can use the cast screen and everything goes on my TV.", "verified": true, "helpfulness": "0/0", "author": "james wulff"}, {"rating": 5.0, "review": "This Item Works Great I Just Hope More Apps Come online. There are a lot but we could always use more. I have two Devices.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]