[{"rating": 3.0, "review": "Why would the voice search not work for Netflix.  This rating really is kind of harsh because the device is amazing.  However, I'm sorry Amazon, your video service doesn't even sniff Netflix and I don't like that your voice search tried to push it on me.On a side note, I've heard that they will get voice search for Netflix up and going in future updates.Please do this update ASAP so I can change the rating to 5 stars.All this being said, it really is an amazing device.  I have an Apple TV as well as this and the only plus that Apple has over this is the easy device mirroring.  There are apps that do it as well on the Android, but I am yet to come across one that works half as well.  Other than that, I love the Android flexibility and love that Amazon despite their limited App Store has left the door open with side-loading apps if someone wants to try other apps at their own risk.Despite my harsh rating because of the ludicrous voice search limitations, please do buy this device because it is awesome and hopefully by the time you do, voice search will also work with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Cam"}, {"rating": 2.0, "review": "Thought I could download shows at non-peak hours to watch offline later.  Not able to do that and my wi-fi internet plan has very limited data cap (only 10 gb month).", "verified": true, "helpfulness": "0/2", "author": "Jim Amberson"}, {"rating": 3.0, "review": "Not too bad, very powerful system, works fairly well, but with no HBO Go, it's behind the Roku 3 in my book", "verified": true, "helpfulness": "0/0", "author": "Rick Maksian"}, {"rating": 1.0, "review": "If you use an Internet provider that has a limit on monthly data this is not the streaming device for you.  It uses a minimum of 200gig of data a month if I watch anything from the Prime content. By the time you get a notice from your Internet provider its past 30 days and Amazon will not let you return it.", "verified": true, "helpfulness": "1/5", "author": "Digi Edit"}, {"rating": 4.0, "review": "Havent had it a year and now that crackle is on it it keeps reloading every few mins", "verified": true, "helpfulness": "0/1", "author": "catherine blake"}, {"rating": 5.0, "review": "This product is terrific. the only problem that I have with it is that I bought it and got a lot of use with it, then my older tv died and needed to be replaced. The new tv' shave Amazon built in so I don't really need the apparatus shown above, but since I bought it, I'm using it", "verified": true, "helpfulness": "0/1", "author": "mary deleal"}, {"rating": 4.0, "review": "It's fine, only I was watching Breaking Bad, & clicked on the wrong thing, thought I was on Netflix, & now I'm being charged $2.99 for one episode to me, that's wrong, because we are watching the other episodes free on Netflix.Their should be more free movies also.", "verified": true, "helpfulness": "0/2", "author": "Trisha"}, {"rating": 5.0, "review": "Best thing that ever happened to me as far as TV is concerned.  I love it.  It is so fast and effective!", "verified": true, "helpfulness": "0/1", "author": "S. Punty"}, {"rating": 5.0, "review": "Great.Very easy installation.", "verified": true, "helpfulness": "0/1", "author": "RS"}, {"rating": 4.0, "review": "I had no problems connecting it and its very easy to use.", "verified": true, "helpfulness": "0/1", "author": "Bake"}]