[{"rating": 5.0, "review": "love it.", "verified": true, "helpfulness": "0/0", "author": "ginny"}, {"rating": 1.0, "review": "Wouldn't pair with my daughters kindle. Returned it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Jason Davidoff"}, {"rating": 5.0, "review": "Oh this little HDMI dongle that is powered by Chrome is incredible at streaming. Plug and play at its best!", "verified": false, "helpfulness": "0/0", "author": "Joseph Yeoman"}, {"rating": 4.0, "review": "doesn't work on public wi-fi (including the wi-fi at practically any college, university, or workplace), which would be fine if it were mentioned at all in the description or marketing.it's a good, cheap alternative to Roku/Amazon/Apple's devices (as long as you have another device to control it with, and a private router)", "verified": true, "helpfulness": "0/0", "author": "JenniferLopezzz \"Jenny\""}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "Qasim"}, {"rating": 5.0, "review": "Thanks a lot !!!", "verified": true, "helpfulness": "0/0", "author": "Jeniree Castañeda"}, {"rating": 2.0, "review": "1) There are still not enough streaming sites that allow you to direct cast it  to the stick (so your computer/tablet does not need to be running)2) While streaming from Chrome browser, the computer's CPU goes bonkers, laptop gets hot, fan kicks up to high. If your computer doesn't have a fast processor (I suggest at LEAST i5 dual core, but i7 quad core would be better), the streaming often gets jittery as it can't keep up with pulling it from the web and sending it to the stick.It's just not ready for public use yet! Get a Roku or FireTV.Revised: The other thing is that this does not have apps like other streaming devices, it relies on your computer or Android tablet (sorry iPhone/iPad users) and I understood that when I purchased it. In order to stream from the computer, you need to use Chrome browser. Okay, I get that too.  You also need to install the Google Cast extension. After doing that, even when I'm not streaming to the Chromecast stick, any video playing in Chrome drives the CPU higher than normal (not nearly as high as streaming) which still gets the laptop fan going and will drain battery much quicker when not plugged in.", "verified": true, "helpfulness": "1/1", "author": "Timothy A Martin"}, {"rating": 4.0, "review": "It seems to work well with older android 4.1 and 4.2.  My 4.4 kitkat version had issues and was a \"beta.\"  Would like it to have more fluid way to sync your entire screen without lag.  The function works fine for Youtube and Netflix, but is mysterious when it comes to web browser.", "verified": true, "helpfulness": "0/0", "author": "Mr. Mysteriouso"}]