[{"rating": 5.0, "review": "I am enjoying the performance of the Fire TV. It works fine.", "verified": true, "helpfulness": "0/0", "author": "Robert L"}, {"rating": 5.0, "review": "It lags when I try to watch episodes on HULU, but I think that is a HULU problem, not the Fire TV box itself. I am playing with it some more.", "verified": true, "helpfulness": "0/0", "author": "forg2011"}, {"rating": 4.0, "review": "Love it! User friendly and I think will change me from Netflix.", "verified": true, "helpfulness": "0/0", "author": "Raymond Brinkley"}, {"rating": 1.0, "review": "I have not been able to get it to work", "verified": true, "helpfulness": "2/4", "author": "charles parks"}, {"rating": 3.0, "review": "The product may be fine but the sales event was not. I Iooked carefully to see if a HDMI cable was needed, and since there was no mention of the need, I took a chance and did not buy one. Surprise! No cable in the box. Not everyone lives next to a Best Buy. Had to swap a cable to set up, which was easy once I got the remote batteries installed (which were included, thank you). On the other hand, getting the remote open after going on line to see which way the unit opened was very, very hard. Today on an errand 40 miles away, I was able to pay $20 for a cable I could have paid $5 for from Amazon. Good product so far, crummy experience.", "verified": true, "helpfulness": "0/0", "author": "Robert G. Emerson III"}, {"rating": 5.0, "review": "It works asome. I Will recomended.", "verified": true, "helpfulness": "0/0", "author": "Jean Africano"}, {"rating": 5.0, "review": "It's the Best.", "verified": true, "helpfulness": "0/0", "author": "theemperor"}, {"rating": 5.0, "review": "Love it. No Smart TV needed!!", "verified": true, "helpfulness": "0/0", "author": "Unique"}, {"rating": 3.0, "review": "Having trouble keeping it connected to my cable modem. Not sure if it's the modem or the Fire TV but my other stuff all works.", "verified": true, "helpfulness": "0/0", "author": "daveyboy700"}, {"rating": 5.0, "review": "I have two home theater systems, one with an HDMI receiver and an older one with a non-HDMI receiver.  I ordered the Amazon Fire TV to be connected to my non-HDMI receiver.  The connection is identical to my Apple TV.  Since I also ordered a Fire TV Stick at the same time, I initially connected both to my HDMI receiver for a side-by-side test.  Both worked well; however, both my wife and I agreed that the picture quality on the TV was slightly better with the Fire TV Stick.", "verified": true, "helpfulness": "0/0", "author": "ex-bomber guy"}]