[{"rating": 5.0, "review": "This is a wonderful investment. Allows you to take a regular flatscreen tv and make it smart, and gives access to the internet, and to cast anything on google, and anything on your phone. Best electronic investment ever! This is simply the best and a must have!", "verified": true, "helpfulness": "0/0", "author": "Myron Jones"}, {"rating": 5.0, "review": "Works great. You should buy one.", "verified": true, "helpfulness": "0/0", "author": "Timothy Palmer"}, {"rating": 5.0, "review": "I own three of these now.  Easy to set up and use.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 1.0, "review": "it failed with \"chromecast...\" black screen. and no return. Junk.", "verified": true, "helpfulness": "0/0", "author": "Pavel Nyaga"}, {"rating": 5.0, "review": "Wonderful invention, turns your television into a smart tv with little hassle or expense.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Not what I expected. Couldn't stream videos from Plex. Only supports certain apps your phone/tablet can run and cast onto Chromecast (ie: YouTube, Netflix). No onboard apps. Had difficulties connecting to my wifi router. Doesn't support Sling. Overall, a piece of junk. Trying Amazon Fire Stick.", "verified": true, "helpfulness": "0/1", "author": "Robert"}, {"rating": 3.0, "review": "This is one of the waste products to purchase.I dont see clarity in my samsung tv.  Secondly there is lag from the point it relays the picture on to TV....Especially when I am watching world cup cricket, there is lag ....  others on my whatsapp group are saying \"wav its a six\" and then after 2 minutes, I see a sixer....  I miss fun!!Well I can say I can give 3/5 for this.", "verified": true, "helpfulness": "0/0", "author": "Chandra S. \"Tondepu\""}, {"rating": 5.0, "review": "First bad review, item ran just over 30 days than stopped and warranty lasts only 30 days!  That just plain crap, as was the product!", "verified": true, "helpfulness": "0/0", "author": "David Botwinski"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Azim A."}, {"rating": 5.0, "review": "Nice idea of product but resolution of screen still need improve", "verified": true, "helpfulness": "0/0", "author": "G.G"}]