[{"rating": 5.0, "review": "Good stuff!", "verified": true, "helpfulness": "0/0", "author": "Trongle21"}, {"rating": 4.0, "review": "Use this daily. Very small and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Ryan Keen"}, {"rating": 4.0, "review": "This device seems to be dicey, at best. I received the device, it worked for 20 minutes, and then I could not get it to play after that. I performed all of the troubleshooting steps on Google’s site. Sent it back that same night. Unless you need to cast from Chrome, get an Amazon Fire TV.UPDATE: The issue seemed to be user error. My Internet connection was not strong enough and cause the device to corrupt itself. After letting it sit for one week, it somehow restored itself.", "verified": true, "helpfulness": "0/0", "author": "A. C. Peterson"}, {"rating": 5.0, "review": "Super easy to setup. A must-have if you'd watch Youtube videos or Hulu a lot.", "verified": true, "helpfulness": "0/0", "author": "Zheng Sun"}, {"rating": 5.0, "review": "Awesome Product, I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Maria Eliud"}, {"rating": 5.0, "review": "Unit was easy to set up. Haven't played around with it a lot, justuse it to watch Youtube videos. No problem yet. Good enoughthat we have cancelled cable.", "verified": true, "helpfulness": "0/0", "author": "WOLF F."}, {"rating": 5.0, "review": "No complaints with this item everything good", "verified": true, "helpfulness": "0/0", "author": "Money_Maker"}, {"rating": 5.0, "review": "I use this almost daily. My girlfriend uses it, my mother uses it and even my father. We all have our own, and its so simple to use and set up!", "verified": true, "helpfulness": "0/0", "author": "Justin A. Setiawan"}, {"rating": 5.0, "review": "AAA+++++++", "verified": true, "helpfulness": "0/0", "author": "Oscar R. Miranda"}, {"rating": 5.0, "review": "I love this! This is an absolutely amazing product for those who don't own smart TVs. The setup is beyond easy and the ease of use is even better.  I have both this and the Amazon Firestick. I would recommend this over the other if your devices (smartphones and tablets) are not from Amazon. The Chromecast allows \"flinging\" from any company, be it Apple or Android, whereas the Firestick claims it can be done on any device when truthfully it is only on their own company products such as a Kindle. Hope this review helps others in their purchases. Although I prefer this over the Firestick, both do get the job done, I'm just more picky in pricing and marketing.", "verified": true, "helpfulness": "1/1", "author": "Sherry"}]