[{"rating": 4.0, "review": "I found this system very interesting, feel there is room for improvements. find it hard to log onto some of the apps. no explanations as to why the log on isn't going thru.", "verified": true, "helpfulness": "0/0", "author": "Bill Trent"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Stephen Luongo"}, {"rating": 3.0, "review": "amazon doesn't give much movie or series choices with their Prime membership, so I pretty much pay for Netflix to have something to watch.", "verified": true, "helpfulness": "0/3", "author": "starj"}, {"rating": 4.0, "review": "Had this for about a month now. I love it. It works great with Amazon prime and other services such as Netflix. There are a lot of other free apps too. I wish the voice control would search more than just Amazon prime. Otherwise I would have given it 5 stars. I have not watched my cable since I gotten it and will be canceling my cable soon.", "verified": true, "helpfulness": "0/0", "author": "Christopher"}, {"rating": 4.0, "review": "Very good product. Will be much better as it gets more apps and updates some of the issues", "verified": true, "helpfulness": "0/0", "author": "michael f schultz"}, {"rating": 5.0, "review": "So glad I received this as a gift from my husband,now I can watch my Prime on the big TV. As always I am extremely pleased.", "verified": true, "helpfulness": "0/0", "author": "A. Honig"}, {"rating": 3.0, "review": "needs subtitles since I am quite deaf", "verified": true, "helpfulness": "0/2", "author": "ccmikeyb"}, {"rating": 5.0, "review": "Really easy to set up and use with all my streaming services, and I'm not a techie.", "verified": true, "helpfulness": "0/0", "author": "F. Hyde \"Bluetiger\""}, {"rating": 4.0, "review": "It would be perfect if it played MKVs and ISOs. The device is very responsive while navigating.", "verified": true, "helpfulness": "0/0", "author": "Stan Czerno"}, {"rating": 4.0, "review": "Love it. Setup was lots simpler than I had anticipated. Now I face the learning to find content I prefer.", "verified": true, "helpfulness": "0/0", "author": "Linda H. Ishem"}]