[{"rating": 1.0, "review": "Impossible to connect through WiFi; A poor design and implementation;It's cheap because it's worthless;Don't waste your time and money", "verified": true, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Have set it up on TV but have not sent any info yet.  Need more time to make sure it work.", "verified": true, "helpfulness": "0/3", "author": "user on the go"}, {"rating": 2.0, "review": "While the Cromecast is easy to install without clear instructions, it is NOT a substitute for an HDMI cable.  Sadly there is no mouce tracking and you can only watch once your movie has been chosen on your laptop.  It's ok, worth the $30 but not what I was hoping for.", "verified": true, "helpfulness": "0/1", "author": "Gentle Reader"}, {"rating": 2.0, "review": "Alas, I can't get Netflix nor YouTube to stream to TV. Password matched, but tried to stream from my Kindle Fire (not HD) and an old laptop. maybe HD is required.", "verified": true, "helpfulness": "0/1", "author": "Bill Doyle"}, {"rating": 5.0, "review": "I have one of these in each TV in the house.  If I'm using my Android tablet/phone or computer (Chrome Browser) and I want to send a webpage or on of the supported streaming sources to a TV, it's as simple as selecting the correct ChromeCast device from the ChromeCast list and switching the TV source to that HDMI port.  Easy as sending a print job.  For the price you can't go wrong", "verified": true, "helpfulness": "0/0", "author": "Ninove"}, {"rating": 4.0, "review": "Setup was a breeze with my ipad. Wireless reception is good with a wireless n router several rooms away.Streaming Netflix and Youtube in 1080p without a lag and good picture. I have a 30mb cable connection andwith this device streaming hd I still have 20mb overhead for other tasks on the network.You can of course stream almost anything with google chrome from your android phone or pc/laptop.Unfortunately there is no support for IOS using chrome to cast to the device.It will play my library files using chrome(minus sound for some .mkv files) at standard definition. It stutters andfreezes if you try to stream hd files in 1080p or 720p. for that you can get a good media player like kdlinksor roku etc. Overall, for a device this cheap it's a winner.", "verified": false, "helpfulness": "0/0", "author": "mediajunkie"}, {"rating": 5.0, "review": "I doubt there is much I can say that hasn't been said already, but the Chromecast is one of the best devices I have ever bought.Super easy to setup and even easier to use. I bought this because I was trying to find a device that my wife could easily use without getting frustrated and this delivered!I won't go on more, but this is one fantastic gadget if you are wanting to add some \"Smart\" TV features to a regular old TV.", "verified": true, "helpfulness": "0/0", "author": "Nick Porterfield"}, {"rating": 5.0, "review": "Just wish Google would hurry up with new apps, they're losing people quickly because nothing new has been released lately.", "verified": true, "helpfulness": "0/0", "author": "Brian Goggins"}, {"rating": 3.0, "review": "The picture was jerky and freezing when viewing videos with Hulu and other online content. My TV is 20 feet from new wireless router. Would be nice to be able to plug in an either net cable so I could hard wire it to the router. I purchased it from the Google store august 10,2013. When it didn't work  I called Google support with in a few days after I received it. I asked for a RMA # to return it. They wouldn't give a number right away. They said they had to send my request up the ladder. I called again the next day and finally was emailed a return label. I returned everything just like it came. After several calls and emails I still haven't received my refund. My latest call was Sept,25,2013 and was told they are going to send my request up to the next customer service level. I wouldn't recommend this thing unless your sure you want to keep it.", "verified": false, "helpfulness": "1/2", "author": "Mr.Pete"}, {"rating": 4.0, "review": "I have LG 42 inch 3d tv but it's not smart tv and I always wanted to have smart tvthis product will change your tv to smart tv and you will enjoy your tv nothing like before.But, there are limited apps to run, only runs with youtube, chrome, google plays, and Netflix.However, google is developing more apps to run on google chromecast$35 is worth to spend", "verified": true, "helpfulness": "1/1", "author": "bkuser89"}]