[{"rating": 4.0, "review": "Vudu doesn't work on it. No Vudu.", "verified": true, "helpfulness": "0/0", "author": "falconer"}, {"rating": 5.0, "review": "Vevy happy with it. Easy to install and use", "verified": true, "helpfulness": "0/0", "author": "Susan McNamee"}, {"rating": 4.0, "review": "This is a great device. Easy to use and great features", "verified": true, "helpfulness": "0/0", "author": "omar z"}, {"rating": 5.0, "review": "Works GREAT! I can watch both Amazon prime and Netflix which is exactly what I wanted to do. Also really easy to set up", "verified": true, "helpfulness": "0/0", "author": "JPL \"JPL\""}, {"rating": 5.0, "review": "I am wowed. Great fire tv. I plugged all the cables in and fired it up. Rented a movie sat down with popcorn and started the movie. The screen said buffering and it kept on buffering. I could not watch the movie I paid $4.99 for. I was using a mobile hotspot device that was not giving me the bandwidth I needed to stream movies. I called another wireless company and got a device from them that is not slowed down because you have a plan for unlimited data. Amazon Fire Tv is great with the right wireless company and I guess a data plan that has limitations and a cost for data usage. I got to watch the movie I rented, I paid for it again. That same evening I received an email from Amazon for a refund for the $4.99. They said they were sorry for the problem that I was having and issued the credit. That is great customer service they refunded my money on a problem that was not their fault. Great customer service Amazon!!!! And thank you very much.😊", "verified": true, "helpfulness": "0/0", "author": "Jerome E Michalak"}, {"rating": 1.0, "review": "I own three apple tv's.  Love them, but thought I would give the Amazon Fire TV a shot because we are already Prime members.The sound is terrible...  I bought a nice Sony sound base speaker to go with the Fire TV.  I returned the Sony sound base because I thought it was defective.  I replaced it with a Zvox sound base and realized it suffered the same problems.  Amazon replaced the Fire TV, no hassle, but the second unit exhibits the same audio flaw.  The sound is harsh, distorted, tinny, and garbled.  The only way to remedy this is the power down the Fire TV by unplugging the power wire for a reboot.  Using the remote control to reboot often will not resolve the sound issues.  This is required several times a day, which is simply not acceptable.We replaced our wifi router, optical audio cables, hdmi cables, sound base speaker systems, and so forth.  The Amazon Fire TV suffered the same audio failures.Additionally, the first unit would freeze and buffer constantly.  The second unit was slightly better.  Our Internet wifi router replacement did help some, but still not seamless and enjoyable.I just bought another apple tv to replace the second fire tv.  Swapped out the hardware in 3 minutes.  Apple TV works like a charm.  No problems, great sound, no buffering.The processor is very fast and snappy.  The bluetooth remote can be nice in some respects, but less preferred in others.  Voice search is neat, but only works with Amazon content and is useless for Netflix and others.  Since Amazon Prime content requires viewers to purchase content that is free on Netflix, we find ourselves watching Netflix 95% of the time, therefore the voice search is a moot point and no longer a benefit.Amazon Fire TV faults:buffers constantlyterrible audioAmazon content costs $$ for WAY too many titles and seriesremote unresponsive oftenforced to power cycle/reboot dailyvoice search limited value", "verified": true, "helpfulness": "1/3", "author": "fanofamazon"}, {"rating": 1.0, "review": "We got this as a Christmas gift.  first off amazon prime charged us AGAIN for it, still fighting them on this one AND it keeps telling us our HDMI cord is not capable.  We are on the third one and it still gives us issues.  it turns TV time into a VERY frustrating activity, thus we barely use it. Lastly we are busy people, raising our kids and have not seen that many movies in the past two decades, it seems like the majority of movies they are premiering are ones we have seem.  I would NOT recommend this product.", "verified": true, "helpfulness": "0/2", "author": "Jill B"}, {"rating": 5.0, "review": "I like but, If your company let this product be root, it gonna be betterThanks", "verified": true, "helpfulness": "0/0", "author": "Mr.T"}, {"rating": 5.0, "review": "Buying the Amazon Fire TV has been such a good choice.  I all ready trusted Amazon to provide good qualityand it's very much like using my Kindle HD.  I scaled down my cable channels because the Fire TV enablesme to tune in to so many television shows and of course all the movies and music available through Amazon Prime.I'm thrilled with my purchase!", "verified": true, "helpfulness": "0/0", "author": "Linda Irvine"}, {"rating": 5.0, "review": "So much better than anything else I've used! It picks up my network signal better than my Blu-Ray player and much less buffering while watching internet based programs like Hulu and Netflix. It was easy to hook-up to my TV and I absolutely love the voice recognition remote! I'm thinking of buying a second one for my bedroom!", "verified": true, "helpfulness": "0/0", "author": "Lynn Orange"}]