[{"rating": 5.0, "review": "This device was a great investment... Can't wait until more apps are available for it. Then it will be amazing.", "verified": true, "helpfulness": "0/0", "author": "Desmond"}, {"rating": 5.0, "review": "I cant wait for new apps to come out for this device.  So far its pretty nice to be able to \"cast\" what you choose to watch from your phone or tablet to the TV!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Nice idea! But they should have gone ahead and finished it. It's like someone had a good idea and then lost funding or interest. It works from a distance of about 20 feet. After that, you are going to experience interruptions and choppy performance. It only works with Google browser on a laptop. Needs to be able to \"cast\" Windows Media Player or other 3rd party DVD, MP4, or other video/movie players. At best, it's an interesting toy for about a week and then you run out of options and get quickly bored with it.", "verified": true, "helpfulness": "0/0", "author": "Pauli"}, {"rating": 3.0, "review": "Not exactly what I had expected based on research prior to purchase. At first I was going to send it back because of that reason but then decided to keep it for another TV that does not get used as often. It works best with a tablet or a cell phone which then uses your device as a sort of remote control. Chromecast does NOT do well from PC/Laptop to Chromecast/TV because it will ONLY transmit picture [NOT SOUND] to TV... Sound will continue to play on your PC/Laptop while you can watch on your TV! That was a big disappointment for me! What is the use being able to watch from PC/Laptop to TV but the sound is not included, that kind of defeats the whole purpose. Also, you can only get Netflix and/or YouTube directly with Chromecast from your tablet/phone with the appropriate Apps installed.*NOTE* About use with a tablet... prior to chromecast I used a hdmi cable from tablet to TV and had tablet plugged into power source in order to watch stuff off tablet [it would get really hot sometimes doing that]. Here was the big surprise for me... you can watch movies/shows from Netflix or YouTube literally for hours and not have the tablet plugged into power, nor use a cable. Everything will stream very nicely and the tablet will not even get warm and tablet will go to sleep while your movies keep streaming until you change or stop it. :-) For more help with Chromecast visit here:[...]", "verified": true, "helpfulness": "0/0", "author": "Kenjas Creations \"Kenja\""}, {"rating": 5.0, "review": "It's pretty easy to setup and use. Our family enjoy using it. It is sure a great buy. One drawback is the support for chrome web browser. Sometimes the support is not as good as youtube.", "verified": true, "helpfulness": "0/0", "author": "May Z"}, {"rating": 5.0, "review": "I love the Chromecast. It streams 1080p from Netflix with 5.1 Dolby Digital audio. I've stopped using my Apple TV because I prefer using my Android tablet to control the Chromecast.I use it with the Avia app to cast local and DLNA stored video and that works well too. It is very simple to use and set up. I have not experienced the problems detailed in the 1-star reviews I've seen.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I got it because at the time we didnt have a smart tv so this was as close as it would get. It works flawlessly for the most part. I only wish i could stream whatever content i want to the cast and that I could make a queue from various sources. So add netflix video then a few youtube videos in the queue after the netflix movie. So that when the movie is done playing it plays the youtube video or whatever I have next.", "verified": true, "helpfulness": "0/0", "author": "Gilles S. Biagomba"}, {"rating": 1.0, "review": "Do not waste your money on this item.  It is difficult to connect to, the resolution is very poor and is very limited to what it will connect with.  When streaming a movie on Netflix, on an HDTV the picture is blurry and it keeps having to buffer.  I have high speed internet in my house and a very strong Wi-Fi transmitter and it still was poor at best.  Try the Apple TV, much better.", "verified": true, "helpfulness": "1/2", "author": "Scott Stromenger"}, {"rating": 3.0, "review": "We received the Chromecast yesterday and had it set-up within minutes. Very easy and simple. Once set-up, however, it displayed a notice that our router was not compatible with the device. We have an old Actiontec router (M1000/W1000) from Qwest that we've used for almost 10 years. I sleuthed around the internet for a workaround to no avail. If you have a newer router I'm sure you will be fine, but if your router is older you might double-check (just google \"Chromecast router compatibility\" and you will find the Chromecast support page). Thus, we are returning and looking into an Apple TV or Roku.", "verified": true, "helpfulness": "0/1", "author": "Groo"}, {"rating": 5.0, "review": "I have to travel quite a bit for my job.  I love that I don't have to watch CNN stories over and over again in my hotel room.  Now I can just plug this into the tv and watch all my favorite Netflix flicks hassle free.  It's a pity it doesn't have Amazon video yet, but it's well worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Zorro Oscuro \"To avenge the helpless, punish cruel politicians, and aid the oppressed.\""}]