[{"rating": 5.0, "review": "Works great, hope to replace cable.", "verified": true, "helpfulness": "0/0", "author": "Al Jones"}, {"rating": 5.0, "review": "Setup is super easy; picture is fantastic; sound, from streaming audio, is incredible. Of course it's dependent on three things; a power source; good internet connection and HDMI connection on television. The speak to search functionality works great (even with my southern accent). Well worth it. Next move is to cut back on, if not eliminate, cable.", "verified": true, "helpfulness": "0/1", "author": "R. Wood"}, {"rating": 5.0, "review": "This is an absolutely fantastic device. I replaced my Chromecast with a Amazon Fire TV Stick, and then I replaced that with the full Amazon Fire TV. I'm very happy with the decision to go with the full Fire TV.The speed of this is great, and you can see the difference when loading between this and other, less powerful devices.I do wish that this were integrated into the Amazon Echo though. I would love to be able to tell Alexa to play something and have it control the Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Robert"}, {"rating": 1.0, "review": "Bought it for SlingTV and it crashes all the time. The \"extra\" stuff that Amazon pushes down your throat is useless to me and they restrict you from hiding the icons or even auto starting into an App of your choice. I would ditch this in a heartbeat if Sling had an app for a different platform that I already own.p.s. I also had my first Fire TV die a few days after using it and Amazon was good about doing an advanced replacement. This still isn't enough to give it a better review.", "verified": true, "helpfulness": "0/1", "author": "J. Leichtman"}, {"rating": 5.0, "review": "My Samsung smartv quit connecting to the internet, so instead of paying outrages repair costs, I purchased the Fire TV and couldn't be happier.  It's easy to use, looks great and should negate the need to spend extra money an a \"smart\" tv.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Harris \"Mexican Bobby\""}, {"rating": 5.0, "review": "Great piece of hardware/software.", "verified": true, "helpfulness": "0/0", "author": "Mary Howard"}, {"rating": 5.0, "review": "Good , like new product", "verified": true, "helpfulness": "0/0", "author": "THIEN NGUYEN"}, {"rating": 5.0, "review": "Very good product and I'm glad I purchased it. Was simple to set up and the voice recognition works well.", "verified": true, "helpfulness": "0/0", "author": "Everett"}, {"rating": 5.0, "review": "Greater!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Brian Pridemore"}, {"rating": 3.0, "review": "ProsVery fast, loved how powerful it was.I liked the voice search, very useful.ConsNot as many apps compared to Roku 3. Although this is the only thing it lacked, this is big on my list. All I ended up using was Netflix and Youtube.I eventually went with the Roku 3 because it did not have the apps I wanted.", "verified": true, "helpfulness": "0/0", "author": "Ancient"}]