[{"rating": 5.0, "review": "Google Chromecast is super easy to install. I have a Samsung S3 and everything went smooth. It only works with Pandora, HBO, HULU, Netflixs, and the marketplace would like to see it gain acceptance with other apps, but I purchased it for Netflix as my TV isn’t internet capable and this was a cost effective solution. It works fast even with DSL and controls everything from your phone.", "verified": true, "helpfulness": "0/0", "author": "matthew gilroy"}, {"rating": 4.0, "review": "PROS:--Portability : about the size of a car key fob--Relatively Easy setup--Convert nearly any TV or projector into a \"smart\" device--Great for travelers and roadwarriors, no more \"idiot\" tv's for you!--Comes with a HDMI extender, no worries if you have a tight squeeze around your HDMI ports - google has you covered!--Comes with wall wart and micro-USBCONS:--Limited app support and functionality at this time; PEOPLE - KEEP IN MIND THIS HAS NO APPS ON IT! YOU MUST USE YOUR OTHER SMART DEVICE (laptop,tablet,phone, etc.)--No way to overcome web based Wifi authenticationIN THE BOX: Chromecast, micro USB cable(3ft), HDMI extender, USB wall wart (power block), papers.My scenario:I bought it thinking I would use it for travel, get to a hotel and BAM! have a smart streaming TV with just this magical little device...1 problem, most hotel wifi use portal based authentication (i.e. webpage \"accept\" and click) which won't work with the chromecast, now casting locally stored videos (i.e. on your phone,tablet,etc already) that will most likely work ok. One work around would be to get a travel pocket router and use the hard line network jack in the hotel room to broadcast your own wifi for the chromecast to interface with, but now you have another gadget to haul around and setup just got more time consuming. Given that scenario, most people (including me) would rather just watch whatever on their tablet / laptop, and/or use an HDMI cable. Lets face it, most laptops and droids have HDMI (or micro/mini) and that means only lugging a single cable along with no setup time.Closing thoughts:I had really hoped this was going to be more like a \"droid-on-a-stick\" device like you see from the china warehouse sites, alas it is only really just a connection portal for dumb TV's. In reality if you have a smart TV, DVD/Bluray, PS3/Xbox, etc. you really have little, to no need for this device. It is basically just a wireless HDMI port.While this doesn't work for my intended purpose, I don't fault the device. I would be crazy to think that this was the \"one magic HDMI dongle to rule them all\" gadget. If you have older LCD's in your house, this is a cheap way to upgrade to a smart device, especially given the price point, it's hard to go wrong.", "verified": false, "helpfulness": "3/4", "author": "R. Rickey"}, {"rating": 4.0, "review": "Great device that fills 90% most of my needs.  The one biggest problem is that it does not allow me to cast all the content to my screen.  I would love to see games, websites (not using the chrome browser extension), and other content cast to my screen.", "verified": true, "helpfulness": "1/1", "author": "Teeem"}, {"rating": 5.0, "review": "YouTube is one of the best educational tools KNOWN TO MAN :-)...I can't tell you how much I've learned watching various tutorials. I use the Chromecast to watch these videos on my TV", "verified": true, "helpfulness": "1/1", "author": "Josh"}, {"rating": 5.0, "review": "The BEST product ever!  I use this every day, works flawlessly, I cannot wait for more app support! Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "sjcamm"}, {"rating": 4.0, "review": "Its a nice technological advancement by google. Replaces all the messy cables to the TV. You can watch videos on youtube as well as chrome. The only issues I have are that sometimes the connection is not very dependable and fails to recognize an active window. Also when using chrome browser, if you switch tabs you will have to relay the new tab again which is a pain. So far enjoying the comfort.", "verified": true, "helpfulness": "1/1", "author": "sultansfam"}, {"rating": 5.0, "review": "This gadget is fantastic.  My old 46inch LCD TV is not a Smart TV no mirroring function and had been a pain when I wanted to watch something thru my PC.  With this, it is completely wireless and I can see whatever streaming site I am watching on my PC on a 46inch TV.  The price is insanely cheap which is another reason why I love this.  NO BRAINER, just buy it !!!!", "verified": true, "helpfulness": "0/0", "author": "T.I."}, {"rating": 2.0, "review": "I've had the device for about a week now, and thus far I am not very impressed. It is still sorely lacking in application support, and my experience with what I've been able to try has been unreliable.Watching an HD video on Youtube/Netflix with a lot of movement/action? Be ready for jerky video.The one thing that has actually been reliable has been google music. But even that is crippled by the lack of local media support. Want to play a podcast that you've downloaded to your Android phone? Too bad.There is enormous potential here, but this is still a mostly-useless device. Sadly, Google has thwarted those who would like to root the device to unlock some of that potential by patching the hole that enables root access in an OTA update that is installed when you setup the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Erik S. Johnson"}, {"rating": 4.0, "review": "The device is very good. But there are some limitation for users in germany. That's sorry, but perhaps it is in investition in the future.", "verified": true, "helpfulness": "0/0", "author": "Rudi"}, {"rating": 5.0, "review": "Awesome, love the simple setup and use. Can use from any device, phone, tablet, laptop. Can't wait for more apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]