[{"rating": 5.0, "review": "Very smooth and easy installation and works so well. Kid learned how to use it quickly too. Great for watching youtube and similar sites on your TV. Fun!", "verified": true, "helpfulness": "0/0", "author": "S. Kljajic \"SK\""}, {"rating": 5.0, "review": "Really good price, nice and simple to use, easy to install, fast shipping and very useful for use with netflix and youtube", "verified": true, "helpfulness": "0/0", "author": "Francisco Budinich"}, {"rating": 4.0, "review": "Although it was a little tough to get configured and going, I am satisfied with its performance.Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "John P. Duda"}, {"rating": 1.0, "review": "Thing doesn't work. It streams hbo go ok but everything else is slow and choppy. Won't even work with YouTube", "verified": true, "helpfulness": "0/1", "author": "David Crader \"Boogieboo\""}, {"rating": 5.0, "review": "I really love this device. It is well-designed, works well for the purpose. Simple and powerful! Works immediately out of the box!", "verified": true, "helpfulness": "0/0", "author": "Andrew Sedelkov"}, {"rating": 5.0, "review": "I have Apple TV , but I like this more than it because it's much optimize and simple , yet I wish if they add the Screen mirroring to cast my power point presentation so it become my office best tools  .", "verified": true, "helpfulness": "0/0", "author": "YOUSUF MOHAMMED ALSHAIBA ALNUAIMI"}, {"rating": 5.0, "review": "This product was received on time and worked as described. It's great to see new Chromecast support being offered constantly.I can't wait to see all the future applications of this device.Pros:-It's cheap-Let's you share your desktop screen, Chrome tabs, videos, music via the various apps available-I was able to download the Chromecast app on my mobile in Singapore which is great! Thanks for unblocking that Google (I think they did that originally to maintain that customer experience while apps, etc. were being built).-I love the apps connection with Plex, Youtube and the other new apps from big brands joining the mix.Cons:-A few seconds of delay sometimes after clicking to load apps and play videos/ movies on Viki/ Youtube. This may be due to my wifi connection but worth noting.-Does not fully support local Singapore TV stations yet (e.g. Toggle, ChannelNewsAsia, etc.)", "verified": true, "helpfulness": "0/0", "author": "runhappy"}, {"rating": 5.0, "review": "It is great to use to send videos from any kind of devices. Works great. We still have to wait for more apps to come, but they'll be here in short time... no doubt about it... it's Google!", "verified": true, "helpfulness": "0/0", "author": "Valeria"}, {"rating": 5.0, "review": "Extremely happy with this purchase. It has definitely been worth the money, and I recommend chromecast to anyone. You should buy one.", "verified": true, "helpfulness": "0/0", "author": "Jeremiah Vigil"}, {"rating": 5.0, "review": "nothing feels like wireless!if you don't like lots of wires you can choose this Item.I can stream my photos and videos of my iPhone. not to forget to mention that my computer content can be streamed via Google Chrome.it's just great!!", "verified": true, "helpfulness": "0/0", "author": "Elias Alali"}]