[{"rating": 5.0, "review": "I think this is going to work out just fine. Thanks", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Little Horses\""}, {"rating": 5.0, "review": "Actually it does \"easily\"  cast Amazon prime to your TV.  The newest update of chromecast from 2 months ago \"cast to screen option\" in Chromecast now works on a lot more 4.0+ and 5.0 android phones.  I have the Samsung Galaxy s3 and the Nexus 7 2013.  All you have to do is go into the chromecast app and turn on the option to cast your whole phone screen to your tv.  Now that everything on your phone screen is on your TV just got to your Amazon shopping app and in the top left pull down tab select Amazon video.  You are now watching Amazon prime on chromecast.  NOTE: you need the newest Amazon Shopping app to access the movies from your Amazon shopping app.  The newest Amazon Shopping app is not available in the play store, but only directly from Amazon's website for free.  I have two chromecast and was here to buy a third when I saw all of these silly negative reviews from those who don't take the time to learn how to use chromecast.  Just another note: If you're having a lot of buffering issues with YouTube, Netflix and other video apps and you're using Comcast's or TWC's all in one combo modem? These combo modems can show a high speed test up and down and still drag opening pages and streaming video. Often rebooting corrects it only for a few hours.  Get a separate Modern and separate Wifi Router.  When I finally did this my speeds got night and day faster; 3 times faster as in really fast. No more constant rebooting  and buffering and picture quality went to highest video streaming quality.  Netflix streams picture quality setting to you based on your network quality.  From Amazon I got the Arris/Motorola Surfboard 6121 modem and Netgear AC1450-100NAR wifi router.  The Netgear TL-WR1043ND is also a good choice. The AC1450-100NAR is a little faster and easier to change firmware to DD-WRT. The stock firmware is also very good.  All are at very good price on Amazon.  Remember, when you look at these reviews to first hit the sort order to Newest Review first.  Looking at out of date reviews can be misleading when firmware, updates in the apps have fixed old issues or just recognizing that some poor reviews are simply a lack of knowledge in how to use the product.  I love the Chromecast product.  I have one on every TV. have fun.", "verified": true, "helpfulness": "3/3", "author": "HVG"}, {"rating": 5.0, "review": "What can I say...it's a Chromecast :)", "verified": true, "helpfulness": "0/0", "author": "DanX"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Stephen Taft \"Colt\""}, {"rating": 5.0, "review": "Love these! I own 3 (two installed at home and one for travel) and have gifted 4! Can't say enough about the simplicity and ease of use!", "verified": true, "helpfulness": "0/0", "author": "Chris M. \"bonesmurones\""}, {"rating": 2.0, "review": "This is really cool except it does not support amazon videos. Also its strange having to work off a tablet or phone all the time... No Amazon, No Deal!", "verified": true, "helpfulness": "1/1", "author": "R.H.Hollis"}, {"rating": 4.0, "review": "perfect, just i want it", "verified": true, "helpfulness": "0/0", "author": "José Miguel de León"}, {"rating": 5.0, "review": "Great product love it. It's small his behind the tv no need for a big cable box looking thing like the other company's have.  Smooth transition from your phone to the chromecast if you have if your kids are always on the phone looking at YouTube or Netflix or another streaming company with this just send it to the TV. Great I say you should get one", "verified": true, "helpfulness": "0/0", "author": "The god"}, {"rating": 3.0, "review": "waiting for the update so I can use it even without the internet. If I had known first that it needs to be connected to the internet before you can use it I would not have bought it.", "verified": true, "helpfulness": "0/0", "author": "JnP"}, {"rating": 4.0, "review": "Pros:1- it has automatic screen saver to save your TV when you dont watch anything. However, if you are in Netflix app but do not watch any movie for example the screen saver will not kick in. therefore screen will be screwed.2- its very easy to put any password and username in your system, since your remote is your phone.3- you can cast your files from your hard drive on the screen with certain apps.4- it turns off when you turn the TV off. since they share the power resource. However, I wish it could turn the TV on on some time or something. but it does not.", "verified": false, "helpfulness": "1/1", "author": "Amir"}]