[{"rating": 3.0, "review": "Good but didn't play with amazing prime movies and shows. And haven't use it in years.", "verified": true, "helpfulness": "0/0", "author": "Mishell (Michael) Phoenix"}, {"rating": 5.0, "review": "This is one of the best products out there for its price. I can project whats on my computer and iPad to watch TV on  a bigger screen and continue to use the two in another manner if I wanted to!", "verified": true, "helpfulness": "0/0", "author": "Jai Shamdasani"}, {"rating": 4.0, "review": "It good product Over all", "verified": true, "helpfulness": "0/0", "author": "Eddie Alkhatib"}, {"rating": 4.0, "review": "I've used a lot of devices and apps to stream video from my PC/phone to TV, but Chromecast is by far the best I've used so far. I love how simple it is. My only complaint is that it freezes up sometimes, or won't connect even though it has full wifi signal. It's rare for one of those issues to pop up, though, and it can usually be fixed by unplugging the device and plugging it back in.", "verified": true, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 5.0, "review": "Love my chromecast.  So eady to use", "verified": true, "helpfulness": "0/0", "author": "shace"}, {"rating": 5.0, "review": "Easy to setup and hookup to pc.", "verified": true, "helpfulness": "0/0", "author": "Bing Cao"}, {"rating": 5.0, "review": "Love this thing netflix YouTube all day long son.", "verified": true, "helpfulness": "0/0", "author": "Derek G."}, {"rating": 1.0, "review": "Only works about 50% of the time.  No interface and is undependable.I bought an Amazon Fire and like it much much better.", "verified": true, "helpfulness": "1/1", "author": "Charlie \"Chris\""}, {"rating": 5.0, "review": "Love it. Works perfectly. Item arrived on time and packaging was neat.", "verified": true, "helpfulness": "0/0", "author": "DOAMEKPOR EDEM"}, {"rating": 5.0, "review": "Love Love Loved this. A great addition to my Media", "verified": true, "helpfulness": "0/0", "author": "Bruce J"}]