[{"rating": 5.0, "review": "The streaming quality is great. Navigating the menus is simple, even for those who may not be technologically advanced. The remote is simple and fits the hand very well. The speech recognition sometimes needs 2 attempts to correctly interpret what you said, but for the most part works fine. The size and weight of it all makes it easy to take with you wherever you go so you can always have access to your netflix/amazon prime content. I haven't tried the gaming yet, but I would probably want the game controller to even try. It has a screen saver so it wont burn the image onto your screen if you leave it on, which is better than just dimming the brightness as that can still lead to slight image burns. The only downside, if you even can call it that, is that there is no \"on/off\" or \"power\" buttons. It goes to a sleep mode and then shuts off after a period of non-use, then you just push a button on the remote to wake it up. The only way to power it down immediately is to unplug the power cord. At first I didn't like that function but after a week of use I couldn't care less that it works that way. The power it uses seems to be minimal so it's not an electricity hog to stay on for a few extra minutes.", "verified": true, "helpfulness": "1/1", "author": "J. Fuller"}, {"rating": 5.0, "review": "This product is great! It has am easy to navigate remote with voice activation that works great. I have already enjoyed many hours of relaxing viewing. Plus after downloading my Pandora account I get great music too.", "verified": true, "helpfulness": "0/1", "author": "howard herman"}, {"rating": 5.0, "review": "Roku 2 owner here.  I was never really that happy with the Roku.  Its slow to load and reboots itself more than it should.  I've also had it lock up multiple times requiring you to unplug it.  I'd grown tired of it.Skip to the Fire TV.  First off all this thing is blazing fast compared to the Roku 3.  Setup is extremely easy and vid quality good.  Also it somehow seems to even stream better on our slow DSL that we previously could not on the Roku.  I usually streamed on 4g due to the poor DSL but now its usable with this device.  A huge upgrade over the Roku.If your on the fence and you too were tired of the Roku slowness then this device is your answer.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "The problem with the fire tv is that it doent have enough apps that you want, Like on my kindle i can watch ABC, SHOWTIME, HBO, NFLNOW, ETC. FireTV only has HBO and its in AmazonPrime. Its to hard to search through prime to find everything. I was really upset when there no way to watch NFL content on FireTV. Overall i was not impressed. the Roku 3 works just as fast and offers more apps.", "verified": true, "helpfulness": "1/3", "author": "goldsmith"}, {"rating": 5.0, "review": "I have both the Amazon Fire TV and the Apple TV and love them both, but the Amazon Fire TV is faster, no doubt. When you watch a series, for example, the next episode preloads so when you click the play button, it starts instantly. Love that. My 3 1/2 year already knows how to speak into the remote to search for Dora or SciGirls. That's the pro. The con is that the UI is clunky. It's hard to find content only because you have to slide along a set grid of results -- annoying when you have all the real estate offered by a large TV screen. The Netflix app should be integrated -- it's currently kinda bad. While not Amazon's fault, they could help fix that (but of course, Netflix is a competitor...). Voice search is great. The pro is that the search is really fast, the negative is that it only searches Amazon content and apps. Lately it shows apps first, which is kind of ridiculous. I'd prefer the voice search to search all available content that I subscribe to (downloaded). That said, I really enjoy having both the Apple TV and the Amazon Fire TV. So much so I just canceled cable TV and stream everything. This is a solid device.", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 4.0, "review": "As discribed and easy to set up", "verified": true, "helpfulness": "0/3", "author": "Donald Darbonne"}, {"rating": 5.0, "review": "The Amazon Fire TV is just an awesome device. The interface is beautiful, and well laid out. No bland icons on this home screen, full color graphics for top shows and items on my watchlist. There are plenty of suggestions for shows you may like and they are very accurate.The quality of the streamed broadcasts are fantastic. HD streams looks HD! Honestly the quality is better than my cable TV broadcasts. For those of you that have iPhones there are plenty of apps you can download to use Airplay with the Fire TV. I purchased one for 2.99 and it works perfectly. I can stream video from my iPhone right to my Fire TV. Overall I love it. Buy one.", "verified": true, "helpfulness": "2/3", "author": "CptDecker \"joe35667\""}, {"rating": 2.0, "review": "When you first fire this baby up, its amazing. Its very responsive, the menus are easy to navigate and setup was a breeze.  I loved the voice search feature, however this was also one of the biggest downfalls.  The voice search only searches amazon prime streaming...which is...ok if you want to pay $2.99-$5.99 for almost anything you want to watch.  Forget about watching a newish series...about $35-45 a pop.  The worst part is if you want to search for a specific show or movie, you have to search each app you have installed, one at a time.The other complaint is that there is a USB port on the back of the device.  How clever to add a port where you can hook up an external drive to do a photo slideshow, or pull up a bunch of movies you have saved right....WRONG.  The usb port is essentially useless unless you want to hook up some accessories.  This was, in my opinion a major oversight.Its better than nothing, but I dont think it was really thought out all that well.  For now I would stay with the Roku3.", "verified": true, "helpfulness": "6/9", "author": "Mike"}, {"rating": 3.0, "review": "The fire tv was installed with no problems. I am impressed with the electronic aspects of the unit.When I ordered the firetv I was under the impression that Netflix and Hulu plus were included for free. If you closely watch the ads for firetv you too may get the impression that they are free.I checked to see what came with the unit on the web site at firetv and apps, you will see the two apps (Netflix and Hulu) listed at no charge. Well I am a senior, senior citizen and did not know that just because you have an app, does not mean that the product it is for is free. To me this is misleading.I was also watching an interesting movie and about 40 mins. into it....it stopped and a notice appeared which told me I didn't have enough band width.I am a Comcast subscriber with the fastest internet connection they sell. And the fact that I watched a tv show afer being told I didn't have enough band width is beyond me.I am returning firetv, with no regrets, and will wait until they have all their ducks in a row.I am only giving it 3 stars because of the ambiguity.", "verified": true, "helpfulness": "6/12", "author": "Sharon Skewis"}, {"rating": 3.0, "review": "Sometimes it works and sometimes it doesn't.  Want to watch this in the bedroom and shows won't play.  Comes up temporarily unavailable.  So no video.  Has done this multiple times.  I have 30MB download with great WI-FI throughout the house.  So this isn't a problem.Should add an agreement with Dog TV.  That'd be great.Hold out until this goes down to $50.  Not worth the extra price over Roku", "verified": true, "helpfulness": "2/3", "author": "JP"}]