[{"rating": 5.0, "review": "I don't have a smart TV, so I wasn't sure if I should get Apple TV, Roku, Chromecast, or Fire TV to make my LCD TV a little smarter.  After reading product reviews from the manufacturers, 3rd parties, and confirmed purchases, I settled on Amazon Fire TV.  Another selling point for me was that I have a Prime account that lets me stream a lot of premium content for free.Fire TV comes in a very small box, just a tad bit bigger than the actual unit and remote.  It comes synced to your Amazon account, which I think is cool.  Fire TV already has your payment info, so renting or buying videos and such that aren't free it quick.  We've rented and bought a few movies on Prime, and the video quality is as good as Blu Ray, imho.  I also use Fire TV, a LOT, for Netflix, and the quality with that app is just as good.  The voice search only works for Amazon Prime, which is a little upsetting- I would like to have seen it work for all the apps that are available for download, but no biggy.  I recently bought a game controller after being hounded by my kids to play games on the Fire TV.  I have no doubt that the game quality will be very good as well.Amazon never fails to surprise me, and never lets me down.  Good job guys- keep up the good work!", "verified": true, "helpfulness": "3/3", "author": "Charles D Oryniak"}, {"rating": 5.0, "review": "I purchased one of these for my living room.  I have an older Roku 2 in my bedroom because the television on there does not have HDMI.  I am sure the Roku 3 is nicer and faster than the Roku 2, so the speed issues aside, I think I still prefer the Fire TV.  The remote is sleeker and the buttons seem more logical to my hand than the Roku.  Once you realize that the Prime videos are marked in the upper left corner, it is easy to navigate the shows and know which are free and which are not.  The interface is smooth and responsive.  It has less apps than the Roku, but I don't ever find myself watching those apps I have installed on the Roku anyway.  I have not tried any of the games, but then again I did not buy it for the games.", "verified": true, "helpfulness": "0/0", "author": "BWK"}, {"rating": 5.0, "review": "It is a powerhouse android device, very fast and responsive. But may not best solution for people who like things simple in other ways who like apple product.", "verified": true, "helpfulness": "0/0", "author": "Jitendra Singh Kushwaha"}, {"rating": 5.0, "review": "can't keep my daughter off of it", "verified": true, "helpfulness": "0/0", "author": "Joan Hainey"}, {"rating": 5.0, "review": "I have the Fire TV, the Roku, and a Tivo.  I like the Amazon Fire TV the best.  I really like the voice activation feature that actually works on the fire TV.  I also have multiple kindles that integrate with the fire tv.  I get to see what I have been watching if I forgot to turn it off and I get to look at my cloud pictures on the TV that I have uploaded from my android phone and my computer.  I have yet to try my music so I can't really comment on that feature.  I really like the integration of all my devices.If the fire TV could get my local channels, similar to Tivo, and record that is the only device I would own.  I would gladly pay amazon the monthly fee that I am currently paying Tivo.  The Fire TV is worth the money in my opinion.", "verified": true, "helpfulness": "1/1", "author": "cltexas"}, {"rating": 5.0, "review": "Stays on the dashboard and fits my Nuvi. I am delighted.", "verified": true, "helpfulness": "0/3", "author": "L. Pierce"}, {"rating": 5.0, "review": "Great product to replace my roku, but I wish it had HBO GO!!!", "verified": true, "helpfulness": "1/1", "author": "Lauren Provost"}, {"rating": 2.0, "review": "Its not what I thought it was it just streamlines from my kindle. I bought a cable to do that. I thought I could get free movies thought netflex. Not pleased with it.", "verified": true, "helpfulness": "0/3", "author": "Cheryl Edwards"}, {"rating": 1.0, "review": "i am very desapointed, this fire tv is unusual in latin america.all apps are linked to united state users, only netflix is available and it prices is very expensive for only one app.Prime account is not available either.It's better buy another like roku or apple tv wich prices are lower.Do not buy for Latin America.", "verified": true, "helpfulness": "3/8", "author": "Jose Antonio Diaz 18-01527"}, {"rating": 3.0, "review": "Roku, Apple TV, Amazon Fire TV.  I sold my Roku Unit to purchase this item, but sadly they have not yet unleashed all of the opportunity to truly be the market leader in this area.  I incorrectly thought that one could search using VOICE search in any app like YouTube for something that you would like to watch.  It is really sad that they do not allow this.  If you use any other app on the Fire TV you have to use the tedious letter by letter search.The only reason I got this was for the connivence of being able to search by voice....until they get that to work across ALL applications, I would not recommend this product be your choice.  I would stick with Apple TV for all Video and Roku if you like to play games.  Another consideration is that fact that I want to be able to read my Amazon books on the Fire TV - seems like a duh to me and something they would have included native to the system.Once they add Voice Search across all apps and a Kindle App, allowing people to read their content on their TV I will sell my other Roku and both my apple TV's.  Come on Amazon....let's get it done....it's a simple programming task.", "verified": true, "helpfulness": "0/1", "author": "Michael Leitz \"mr. leitz\""}]