[{"rating": 5.0, "review": "This device works as advertised.  I wish it had the ability to play videos from my phones gallery.  So far it is limited to only playing videos from YouTube and other listed apps.  You can try and stream videos from the chrome browser on your computer but the delay is ridiculously slow and quality is bad.  You can tell it wasn't designed to do that.  Still, it is simply amazing.  I can watch movies and TV shows directly from my phone onto the TV without having to hook up wires like I previously did.  Good job Google!", "verified": true, "helpfulness": "0/0", "author": "Brian Mitchell"}, {"rating": 4.0, "review": "I had been using the Hisense Pulse Google TV, which was extremely buggy but still served the purpose of playing YouTube videos and Google Music, capabilities my Roku lacked.  Finally the Google TV became too annoying to use.  Enter the Chromecast.  Obviously it plays YouTube, Google Music and anything else from the Google Play store.  Of course it has NetFlix, but I found the picture quality to be very poor.  Granted I only tried once.  (I still use my Roku as my primary streaming device.)  Using the Chromecast is different from what you are probably used to.  Typically you use a remote control to navigate menus on the TV.  With a Chromecast you browse your tablet or phone to select your programming and then tap a few buttons to start the program on your TV.  It is almost like having a very nice touchscreen remote control.  Once I got used to it, I liked it.  Setup is easy.  Plug the Chromecast into an available HDMI port and connect its USB power supply.  You can either plug the power supply into any available USB port on your TV or into a power adaptor which is much like a phone USB power adaptor.  I opted to use a USB port on my TV.  This means I have to turn on my TV first before I attempt to use the Chromecast.  For example in one  case I ran Google Music and then turned on my TV.  Google Music would not find the Chromecast.  I had to close Google Music and re-open it after the Chromecast was on.  Only then would it find the Chromecast.  Using other power option maybe get around this quirk.  I have not tried.  Now I just make sure to power on the TV and wait for the Chromecast screensaver before I attempt to stream any content.  One other complaint is the lack of mutlitasking.  For example one thing my Google TV did well was play music and a photo slideshow simultaneously.  However there may be a way to do this via a Chrome browser tab.  Currently the number of apps supporting Chromecast is low, but my hope is they grow quickly.  I am also hoping Google backs Chromecast much more than they backed Google TV.  My Roku is still the best thing going for streaming, but Chromecast has the potential to give it a run for its money.", "verified": true, "helpfulness": "0/0", "author": "Benjamin"}, {"rating": 3.0, "review": "Works great youtube Netflix thought I would be able to steam video & photos. From table or PC but can't I would have payed morepossibleb Need for improve ment", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Yes we plugged it into the TV. Then found the screen with a beautiful picture that reads Set Up Now. No instructions from here either on screen or in print. Tried to find instructions on-line, none. Try calling them on the phone, no number published. Thanks for nothing.", "verified": true, "helpfulness": "3/3", "author": "Guy Haynes"}, {"rating": 5.0, "review": "My daughter told me about this adapter so I tried it. Best thing ever. I can now watch a Netflix show without it breaking up and trying to stream.", "verified": true, "helpfulness": "0/0", "author": "Kerri Hitchcock"}, {"rating": 5.0, "review": "This took 5 minutes to set up on my tv, computer, and 3 handheld devices.  It was so fast and easy.  Casting Youtube,  HBO Go, and Netflix are SOOOOOOO easy!  The only downside is that Netflix is a bit pixelated on some shows.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 2.0, "review": "Three apps I currently use that can stream to this: Netflix, YT, and Pandora. You can also do HBOGo and HuluPlus but I don't have those.Netflix, comes out on your tv as SuperHD. Noice.YT, some videos are not permitted to be streamed. Greatttt.Pandora, great if you have an awesome tv surround sound system. Otherwise, a waste of electricity.I tried streaming my chrome browser (FB vids) but it kept dropping the connection before it would play.I love the background pictures it projects while you're not streaming anything, though.", "verified": true, "helpfulness": "1/2", "author": "BobaFetch \"nokia6230\""}, {"rating": 3.0, "review": "Being an all Apple household I wanted to see if this could be an Appletv killer. It is not. But it does allow my friends with android phones to stream music when they're over and they can share videos on the tv much easier. This is a great product at a great price, it just doesn't see much use in my house nor will it be able to replace my other streaming devices.", "verified": true, "helpfulness": "1/1", "author": "Robbie Helzer"}, {"rating": 5.0, "review": "At first it was just cool to stream HD Netflix and YouTube on my TV.  Now, with the addition of Hulu+, Pandora, and RealPlayer Cloud, I am very very pleased.  The boyfriend liked it so much he got one for his TV, too!", "verified": true, "helpfulness": "0/0", "author": "A. YOUNG \"A.M.Y.\""}, {"rating": 5.0, "review": "So once I received it - the right out of the box plug in to my tv. The setup took a bit as anything does, just go thru the steps. I believe that there was one earlier review that outline the setup well and I referenced back to those instructions. My drawback on this is that I got it set up to my Kindle and I can send only Netflix from there but not movies from my Prime which stinks or any of the other sites that I can send from my laptop like PBS, Natgeo and others, as examples. So once sent to the tv from the laptop II need to close the top down but not all the way or you cut off the item you are watching. No biggie set it in another area to not distracted by the screen (make sure you have it set up for not timing out on you program you are watching). Did not bother setting up on my phone due to my data plan and that is fine.All in all I do highly recommend it for it's value if you are not one for the blue-ray or other high tech gadget cannot go wrong for the price or for someone like my mom that still has a vhs hook to her flat screen :) and plan on getting her one as well so she does not have to watch her missed shows on her laptop and can throw them to her TV.", "verified": true, "helpfulness": "0/0", "author": "Sapphire Reader \"I am a audio book lover turned Audio Book Reviewer since Nov '14. Love it and now started my own review blog featuring all the reviews here!\""}]