[{"rating": 2.0, "review": "I was impressed when the first attempt in using it worked like a charm (Facebook).I then went to another page and it would not make the switch.  An error blaming my computer.  I had to get out of the program.  I could not cast after that.", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The actual product works well and is easy to setup. But right now there are very few apps that you can use with the Chromecast. I chose the Chromecast because of its universal ability to integrate with Windows and Mac products. But I could have waited for Google to add some more apps that would expand the opportunities to use the Chromecast, since that is almost what it's doing now. Also while attempted to stream a movie via the HBO Go app, I waited 5 mins for the movie to load (and eventually gave up) and bounce over to the television. Now since I was attempting to do this via my iPhone and because I was connected to the Chromecast's network I was not able to use my home WiFi that usually averages 40 mbs, this may have something to do with it with the long loading time.", "verified": true, "helpfulness": "0/1", "author": "Robert Longfellow"}, {"rating": 5.0, "review": "Chromecast is great. Just waiting for more apps so to be used with any program on my phone, tabet and pc...", "verified": true, "helpfulness": "1/1", "author": "lale"}, {"rating": 5.0, "review": "My family loves gadgets and streaming.  Good tool for that.  Easy for non geek to load and use..  Enjoying very much.", "verified": true, "helpfulness": "1/1", "author": "Pat"}, {"rating": 4.0, "review": "Clever device and easy to use, just wish more apps worked with it. The apps that are available make it a great choice.", "verified": true, "helpfulness": "0/0", "author": "Peter Cronwright"}, {"rating": 5.0, "review": "Easy to setup, I liked it so much the first day I recommended it to friends (who I then helped set up, actually was easier the second time). Set-up is very straightforward, took one on vacation and was able to watch Netflix in our little vacation villa in the Caribbean. Highly recommended.", "verified": true, "helpfulness": "1/1", "author": "Anthony J. Fasy \"AJF\""}, {"rating": 5.0, "review": "For what it does, it's fantastic. Works great. Fast and easy set up. I use it all the time. I travel a lot, and have been able to use it when I'm staying in hotels which is always a plus.", "verified": true, "helpfulness": "2/3", "author": "Lindsay"}, {"rating": 3.0, "review": "THIS ITEM WORKS FINE ONCE YOU FIGURE OUT HOW TO HOOK IT UP & MAKE IT WORK. FOR THAT YOU NEED A PHILADELPHIA LAWYER OR ME! IT IS A BLATANT CASE OF FALSE ADVERTISEMENT. YOU NEED WI FI WHICH I CONVERTED MY COMPUTER TO. YOU REALLY HAVE TO SEARCH TO GET THIS ITEM WHERE IT WILL COMMUNICATE WITH YOUR WIRELESS MODEM & OTHER WIRELESS ITEMS. IT CAN BE DONE AS I GOT IT DONE BUT HAVE A LARGE SUPPLY OF VALIUM CLOSE BY!", "verified": true, "helpfulness": "0/7", "author": "Robert W. Oliver Jr. \"MECHANIC\""}, {"rating": 4.0, "review": "Simple and love it! Only thing is that I wish I could stream/cast from my computer more easily. It stutters and if I play my own content to stream, the picture lags behind the audio. But good if you just like Netflix/Hulu/YouTube and have a smartphone.", "verified": true, "helpfulness": "0/0", "author": "Jenny"}, {"rating": 5.0, "review": "You can't go wrong with a Chromecast, it gives you so much for so little. And with updates it is only going to get better.", "verified": true, "helpfulness": "1/1", "author": "Baltazar Najarro"}]