[{"rating": 4.0, "review": "The unit works as described, setup is not difficult, i wish it support the display up to 1080P, however, it supports only 720P", "verified": true, "helpfulness": "0/1", "author": "Asem"}, {"rating": 5.0, "review": "Chrome cast is the best thing that has happened to TV today! I can play whatever I want on my tablet/laptop and project in on my HD TV - be it advertisements, movie trailors, songs or my favourite movies! I highly, highly, recommend it! Worth every penny!!", "verified": true, "helpfulness": "0/0", "author": "Roshni"}, {"rating": 5.0, "review": "Excellent!  All family members are really enjoying it.  Easy to use, set up is very quick, It was worth it. Recommended.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "does not work.action to slow.picture freeze.cant keep up. can not watch any thing. please advise this man how to fix", "verified": true, "helpfulness": "0/0", "author": "Joseph W. Martingello Sr."}, {"rating": 5.0, "review": "OMG THIS THING! I was so excited to get it and actually was able to just put my xbox up for sale because I've reached the age where I was only using it to watch Netflix. Now, I can watch Netflix, YouTube, and more just by choosing it on my phone. Its fast and I've not had any problems with it so far. Set Up was quick and easy. Could not recommend enough.", "verified": true, "helpfulness": "0/0", "author": "s marberry"}, {"rating": 3.0, "review": "At least for streaming Netflix to one of my TVs (which is not smart), it's ok. Other than that, for now... it's useless.", "verified": true, "helpfulness": "0/0", "author": "Natan"}, {"rating": 4.0, "review": "Works great but only YouTube works where I live. Just hope Google adds more apps support. I love this thing.", "verified": true, "helpfulness": "0/0", "author": "osama dakhil"}, {"rating": 5.0, "review": "Awesome! For the price nothing touches it. Now apps just develop more,  and Amazon quit using Android and not being compatible.", "verified": true, "helpfulness": "0/0", "author": "B. Edmondson"}, {"rating": 5.0, "review": "Very nice little gizmo. Very easy to use. Smart design. Couldn't ask for anything more. Look forward to more apps utilizing this wonderful product.", "verified": true, "helpfulness": "0/0", "author": "DJ EJ ones"}, {"rating": 5.0, "review": "works well with android tablet (hisense jelly bean) took a number of tries to connect to network initially (chromecast recognized network and presented matching ids on screen and tablet). When it connected, chromecast dongle updated itself, and has connected reliably since.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}]