[{"rating": 4.0, "review": "Chromecast is pretty decent, works well. I just wish that the mouse could be shown on the television when mirroring a web browser, forces me to still look at my computer while browsing. Perfect for watching videos from your computer on your television if you mind being restricted by an HDMI cord.", "verified": true, "helpfulness": "0/0", "author": "Abraham"}, {"rating": 5.0, "review": "excellent qualitygreat great price", "verified": true, "helpfulness": "0/0", "author": "greg dinunzio"}, {"rating": 5.0, "review": "Amazing cheap little Gadget that makes any tv a smart tv.  I love laying in bed and being able to throw Netflix, pandora, YouTube, and many other random applications on my tv so that I can enjoy the larger screen", "verified": true, "helpfulness": "0/0", "author": "Andrew Flock"}, {"rating": 5.0, "review": "i think it is very good.", "verified": true, "helpfulness": "0/0", "author": "Changho"}, {"rating": 1.0, "review": "This thing is crap.  Hardly any dowloaded videos will play on this.  (even when using the webstream app)  Its basically I nice slide show that gets old.", "verified": true, "helpfulness": "0/0", "author": "tommytee"}, {"rating": 2.0, "review": "It stopped working in less than a year, but since this is a refurbished product, it only had a 90 day warranty.I should have spent the extra $5 for a new one I guess.", "verified": true, "helpfulness": "0/0", "author": "david l bonilla"}, {"rating": 1.0, "review": "Don't buy it mine stoped working after six months.", "verified": false, "helpfulness": "0/0", "author": "Serafin Ferrer"}, {"rating": 5.0, "review": "One of my favorite things that I own! I use it everyday. I don't have cable anymore I just use this and watch Netflix etc...", "verified": true, "helpfulness": "0/0", "author": "peggy palmer"}, {"rating": 5.0, "review": "my husband and boys love this for streaming", "verified": true, "helpfulness": "0/0", "author": "sherrylp"}, {"rating": 4.0, "review": "Great product, as advertised, the only problem I have encountered was that it has Google's DNS fixed, so if you do not live in the US you cannot access US Netflix.", "verified": true, "helpfulness": "0/0", "author": "Claudia Davila"}]