[{"rating": 4.0, "review": "Works pretty good for what it is.  Wish it would have some more features to it. But it still gets a lot of use out of it.", "verified": true, "helpfulness": "0/0", "author": "J. Hess"}, {"rating": 4.0, "review": "I already own a PS3, and I usually just use that with my TV for things like playing Blu-Ray movies, watching Netflix, Amazon Instant Video, and things like that. However, my wife and wanted something a little more portable that we could take with us to use in hotels while we’re travelling. We saw how popular the Chromecast was and thought it would make for a good substitute that we could easily take with us on the road.  Here’s my take on it.Pros:It IS extremely portable and easy to take with you. The pricing is also pretty reasonable, and it ships really quickly. Setup was fast and relatively painless, and it’s worked very fluidly with my Samsung Galaxy S4 so far. I pair to the hotel’s Wi-Fi, connect to the Chromecast, and can instantly watch stuff on Netflix, YouTube, Hulu, etc. So far the audio/video quality has been pretty good too which is nice that I don’t have to sacrifice in those departments.Cons:Very limited as to what you can actually watch on the Chromecast. You have a set list of certain applications that it will work with, but beyond that, not much you can do with it. It would be AWESOME if you could exactly mirror what’s on your phone, tablet, or laptop onto your TV, but alas, the Chromecast has an extremely limited functionality that does not extend beyond a few apps. Also, it’s a huge bummer that it doesn’t work with Amazon Instant Video, because Netflix and Hulu don’t always cover everything I feel like watching. Lastly, it stinks that it requires an external power source beyond the HDMI port it plugs into. If your TV has a USB port or an AC plug nearby, great, but if not, you’re screwed because you won’t be able to power your Chromecast.Conclusion:All griping aside, the Chromecast is still a pretty good device. Not perfect, and it certainly has its drawbacks, but if you’re looking for an easy way to watch Netflix or a few other popular applications on your TV without a gaming system or streaming device like a Roku, the Chromecast is a cheap and easy fix. Just be aware of its limitations before purchasing.", "verified": false, "helpfulness": "0/0", "author": "A Boy Named Sue"}, {"rating": 5.0, "review": "I am very happy with the Chromecast. It was very easy to set uo and works exactly like it was described. It is nice to be able to view photographs on a large screen, especially for my mother who is having trouble with her vision. I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "Tylermade"}, {"rating": 5.0, "review": "I bought this to be able to stream Nextflix on my bedroom TV, which is a bit older and has not built in applications and it works perfectly. I was surprised at how good the picture is on an old TV. I use my cell phone and tablet to control it and I like the way the application works on my phone as well. Even when the screen goes to sleep you don't have to unlock the entire phone to access the controls for the TV app. for the price can't be beat.", "verified": true, "helpfulness": "0/0", "author": "DEP"}, {"rating": 5.0, "review": "Because it's an awesome device and I would recommend it to everyone! user friendly, straight forward and not a headache to install", "verified": true, "helpfulness": "0/0", "author": "Not Pleased"}, {"rating": 1.0, "review": "Not enough channels, very limited use, I don't use it anymore.  Very slow and difficult to set up, and keeps loosing the connection - I have a VERY strong wireless signal. I have to reset the entire connection process each time I try to use it.  I have 5 other WiFi connected devices that all work very well. I tried it with my Samsung Galaxy S4 phone, Galaxy Tablet and a laptop, all with limited success.  I use Netflix, Hulu Plus, Pandora, etc. on my mobile devices in wireless mode with no problems.  Also I have a WiFI DVD player and WiFi sound bar that I use for internet connection with many more channels and much easier to use and very stable connection.", "verified": true, "helpfulness": "0/0", "author": "Robert J. Youngberg \"Sudoku Fanatic\""}, {"rating": 5.0, "review": "As it says in the copy, you need a smartphone or similar to run it.  I bought an Android tablet which I use for the media player only. Couldn't ask for better for the price.", "verified": true, "helpfulness": "0/0", "author": "Leland Faber"}, {"rating": 5.0, "review": "I got one of these for my mom to use to easily stream Netflix to her TV.  Easy set up, and she loves using it.  She controls it from her iPhone.", "verified": true, "helpfulness": "0/0", "author": "wwatsonh"}, {"rating": 4.0, "review": "This works great for YouTube and Songza.  I wish I had done a little more research to find out how to use Chromecast to broadcast slide shows of our photos.  I'm sure there's a way, but it's not as simple as I hoped.  For the price though, it's working well for us.", "verified": true, "helpfulness": "0/0", "author": "Holly L. Nash \"Luna\""}, {"rating": 4.0, "review": "Very easy to use my only complaint is somehow the color doesn't seem to be perfect and is a little off", "verified": true, "helpfulness": "0/0", "author": "Rebecca C Boswell"}]