[{"rating": 2.0, "review": "This is sad. Just bought the chromecast a day back for 35$ plus taxes and now its for 30$.. Y U DO THIS AMAZON", "verified": true, "helpfulness": "1/24", "author": "Rochit"}, {"rating": 5.0, "review": "Awesome product.  I have never and I will never pay for any sort of television service!  This allows me to tap into all the freeness of streaming content on the e-net but visible to a larger audience.  Use it every day.  Not perfect, haven't figured out how to get it to stream Amazon Prime content yet, but still definitely worth $35.", "verified": true, "helpfulness": "1/1", "author": "Mark J."}, {"rating": 4.0, "review": "YouTube and Netflix work great, which is already worth it at just $35. Unfortunately, Google Play Music isn't available in Canada yet. Anxiously awaiting Rdio and Plex support. Please open that API, Google!", "verified": true, "helpfulness": "1/1", "author": "Dave Steinberg"}, {"rating": 3.0, "review": "The chromecast is not a bad device for the price, but when it cant perform as advertised, it becomes a disappointment not a waste of money to me. I would say it works 80% of the time, breaks connection a lot even though the router is 10 feet away, freezes and cant keep up if casting a google chrome tab. I know that last one is experimental, but it worked fine for the first month, now it stops to the point where you cant cast more than 5 minutes. Good to get this off my chest, I hope the next device fixes this silly connection problems. One more thing, google needs to let this thing lose, stop holding its power back.", "verified": true, "helpfulness": "1/2", "author": "Y. Reinosa"}, {"rating": 4.0, "review": "There's not an unlimited amount of apps that work with this device and it doesn't always work in hotels due to the security (bummer!) but, overall, I'm pleased with it!", "verified": true, "helpfulness": "1/1", "author": "Kevin Fink"}, {"rating": 4.0, "review": "Only Netflix and Youtube by now but seems promise. Using the PC or smartphone as the \"control remote\" was a great idea of Google. I have a Roku in other TV and by now Roku is much better.One of the good things is that you can cast your Chrome tab or even the computer screen. There's some lag doing that but gives you more options to cast content from PC to TV", "verified": true, "helpfulness": "0/0", "author": "Felipe Braga"}, {"rating": 5.0, "review": "35 dollars : 350 dollars worth device. Casting your chrome window to you TV is an amazing experience. You can watch anything on your chrome window and cast it to the TV with sound. Amazing.Youtube, netflix and pandora play nice, spotless .Best thing, power it from your plug, then cast something from your ipad/iphone/android/laptop , it will switch on the whole tv, sound system all with out pressing another button.. all for just 35", "verified": true, "helpfulness": "1/1", "author": "Neethu A. Mathew \"Mathew Family@yuma\""}, {"rating": 1.0, "review": "Junk, Do not Waste your money, the device is restricted to using the internet to deliver content, even if you just want to show a video of your family vacation, it is useless, Google has not updated their webpage on this product since july of this year, you would be better off buying another product one that will allow you to use the device for which you have paid, when a company fails to deliver a product that is capable of being used to display a consumers personal images, video for which they have the right to use then it is a deception to say that the product can do things which it cannot.  Stay Far Away, it will only do 720 P other products will do 1080 so spend your money in a better place stay away from Google", "verified": false, "helpfulness": "1/14", "author": "Macro books \"CONNOISSEUR of Goodness everywhere.\""}, {"rating": 5.0, "review": "love it....best deal for viewing on a large TV...I use this everynight for great flicks and utube.well worth it.", "verified": true, "helpfulness": "0/0", "author": "david pixley"}, {"rating": 1.0, "review": "Don't buy this product. Google does not honor the warranty unless you purchase an additional service called a Google Wallet which requires that you give Google your credit card information. I bought three of the suckers - two set up okay and one is an expensive chunk of plastic. The product's hype is far greater than it's performance. With any mobile device, you are pretty much limited to Netflix and YouTube. Google is keeping third party developers from letting you view local content, such as your own PowerPoint presentations or recorded/purchased content. Stay away.", "verified": true, "helpfulness": "2/8", "author": "David bishop"}]