[{"rating": 1.0, "review": "It didn't allow me to watch anything from computer, only items/shows that I can watch from roku box, that said if you don't have a roku box and a net fix account then go fir it", "verified": true, "helpfulness": "2/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I literally use the Chromecast every day. Whether its watching Youtube or watching my favorite shows on Netflix. I wish they would have support for more apps though. Either way I LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "j tamayo"}, {"rating": 4.0, "review": "The device arrived promptly and was relatively easy to install.  A little disappointing in that I could not transfer all the applications I would have liked to the TV screen, especially streaming television and movies from Amazon, but still amusing and worth the money spent.  If you are looking for a device to pick up all the streaming video you download from the internet and play it on your television, it is not yet available, but this little gizmo does OK", "verified": true, "helpfulness": "0/0", "author": "Richard Reed"}, {"rating": 4.0, "review": "Easy to configure and many applications to plsy with. Very fun that it can be controlled from your Smartphone. The Lsptop scrern projection is also easy to use.One star less because still not available for the phone's Chrome Explorer.", "verified": true, "helpfulness": "0/0", "author": "Erwin"}, {"rating": 4.0, "review": "this a awesome product for the price, I just wish you could mirror your phone/tablet/pc. but its the best $35 spent. :)", "verified": true, "helpfulness": "0/0", "author": "joseph munoz"}, {"rating": 5.0, "review": "This is an amazing idea.  I love using it for Netflix and Hulu shows.  My son is a pro with the tablet and he'll be 3 in April.  He knows how to find Netflix and he can pick a show and play it on the tv.  The only down side is I use my laptop for blu-ray player and would love to have VLC media Player or some kind of player where movies can come straight from my computer.  Even home movies that I have saved would be awesome if I could click a button and watch them on the tv too.  Everything else is great about it...very happy, very satisfied,", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I purchased this from amazon super psyched that I was going to be able to display my computer and youtube onto the tv. I received it a few days later and started to set it up. It requested my wifi and wifi password and I entered it. It then started to connect but the following error message was displayed, \"reconnect me, Chromecastxxxx' connected to (home wifi name), but can't access the internet. THE TWO BIGGEST NAMES IN ELECTRONICS, GOOGLE AND APPLE, WERE NOT EVEN COMPATIBLE WITH EACHOTHER. After spending quite a while calling the support centers who all told me to do the same things, I knew it was hopeless.HORRIBLE", "verified": true, "helpfulness": "1/2", "author": "Gordon Wren"}, {"rating": 3.0, "review": "hate the fact that i can only stream on a limited amt of apps and not directly from websites. Or that i can only stream from one device ( maybe i'm ignorant as to how to do multiple devices) but my phone connects and not my computer.", "verified": true, "helpfulness": "0/0", "author": "Kadi Ann Spencer \"kadith\""}, {"rating": 4.0, "review": "*see update below first review*Now don't get me wrong I am impressed with the product that has been made here. But due to things I misunderstood when researching it I came to find out a few things that upset me for not researching enough (I usually spend DAYS researching a product before I buy it but not this time) and for Google not doing enough on their end to ensure this was a home run. I thought the supported applications for the Chromecast would install on the device and you only used your android devices to access it to control it. Now I know what your going to say \"but it didn't list an internal memory\" and you'd be right. Because the information page for this seems rather slim and needing of more info (or removal of misleading info, research more you'll find I'm not the first nor the last person to be mislead by their product page) I made that mistake you shouldn't in gadgets and assumed. SO when they talk about supported applications what they really mean is the application has to be installed on your handheld device and the developer has to include the option to turn on the casting ability from within their application on your handheld device. Now I have a NAS filled with media, music and pictures and the product pages for this device show PLEX as an supported application, well that's great I thought cause I can use that for DLNA right? Well even though my NAS can get PLEX for free and my Smart TV's can get it for free it's $4.99 to get it to work on the Chromecast, also due to the fact that the applications are on your android device that means you have to repurchase the application for any other android device that is someone else's account (like my wife's tablet and phone). Also the product page shows you that you can use the chrome browser to do web surfing on the TV. Once again I said GREAT! And once again I was disappointed to find out that the Mobile Chrome Browser is NOT supported for Chromecast! Wait a minute didn't Google make this device and already put in Chromecast options into their other programs like YouTube and Google Music? Well that's a yes on both questions so the only question left is why didn't they do their mobile browser as well? Your guess is as good as mine! Now I downloaded the Pandora radio application from within the Chromecast program and my wife already had it on her phone. So my application had the cast option but her's did not. So we checked her Google store and updated the application. Checked it again and still the option was missing! Odd right? Uninstalled it from her device, had her download it from the Chromecast application and this time she had the cast option. That's something to keep in mind if you can't find the option. So i bought this for a 40 inch LCD TV in our bedroom that does not need to be replaced but was purchased before Smart TV's so even though my living room and even the kids room has a Smart TV that can stream our content from the house NAS we couldn't so this seemed like a great solution. Should Google work at fixing the device so things like web browsing from your handheld devices to the Chromecast and find a way to support/encourage other application makers to support casting and find a way to make it so if I buy the application to support the Chromecast that it need not be re-bought for all Google accounts (each Chromecast has it's own unique identifier so really this shouldn't be hard) then this could surely be a great option. Until that day there are still other options out there that work as well or better abet a bit more costly though. I would have personally held off buying had I know all this upfront but I am impressed enough to keep it instead of returning it. Here's hoping that improvements are forthcoming. Like it, love it or leave it that's just my two cents.*update 06/26*With Google's announced updates to chrome I expect to see better improvements from functionality. Biggest update being that you will directly connect to the device from your phone or tablet and no longer require a router to use it. My NAS was made by syncology and they did put out apps days after I got the chromecast to stream to it without costing me a dime. I found this to be a much better solution than using Plex. This device is getting better with the new found support and updates from Google but it will be limited vs a roku device and I'm OK with that.", "verified": false, "helpfulness": "1/1", "author": "B. Smith"}, {"rating": 3.0, "review": "The unit works, picture is good. The app driver is a little crappy but it gets the job done. Has problem with reconnects.Example, watching tv from your tablet in bed. Fall asleep with the Netflix app running and TV sleep timer on. Tv Turns off and the show ends in the background. Next night you have to restart the chromecast two to three times before any device can stream to it. You get error 16001.I don't hate it. But I don't recommend it either. Spend the extra $40 on a low end Roku. You will be happier.", "verified": true, "helpfulness": "0/0", "author": "Anthony"}]