[{"rating": 4.0, "review": "This is an excellent little product for the price.  It does a really good job of playing YouTube videos I've picked from my phone.  It has a little more trouble streaming videos from my laptops chrome browser.  I wasn't able to get a good picture from the ABC website or hulu.com.  The videos weren't synced with the sound and would stop and start a lot.  I've just decided to use it only from the dedicated apps from now on to prevent further frustration on my part.", "verified": true, "helpfulness": "0/0", "author": "Lgirl0223"}, {"rating": 4.0, "review": "For $35, it is a GREAT device. I will be buying another one for my TV in my room. Requires USB for power.Pros:  Netflix works great! Makes searching and loading movies  Loads from device, not from phone, which makes it not use your battery!  Pandora works great  Google Music works awesome too!  You can add to devices playlistCons:  Not very many apps support this  Chrome browser doesn't work all that great  Playlist feature still buggy. It sometimes clears out all that you have put in the play.Conclusion:If you are looking for a cheap way to make Netflix, Google Music and Pandora easy to use on your TV, then get it! If you want more out of this device, wait until more applications utilize it.", "verified": true, "helpfulness": "0/0", "author": "Joshua Pack"}, {"rating": 2.0, "review": "We don't have the most blazing fast internet connection, but Netflix works on it just fine. Sometimes it has to downgrade us to non-HD quality, and that is fine. But Chromecast just stutters and is unusable. It also gets out of sync with the phone I'm casting from and often becomes non-responsive. It's nearly useless.", "verified": true, "helpfulness": "1/5", "author": "Nick Welch"}, {"rating": 5.0, "review": "This does exactly what it claims to do, and does it both simply and well.The only improvement I'd like to see is allowing queuing audio and video from multiple phones/devices without interrupting each other.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Doesn't perform as expected. No support. Good idea but Google let the ball drop. Don't waste your money. Better to try something else.", "verified": true, "helpfulness": "2/8", "author": "Margaret Jones \"Avid Reader\""}, {"rating": 4.0, "review": "The only thing I did not like or would have expected to be better is the way it gets hot for couple of hours usage making me think how long the device will last if regularly used for longer hours.", "verified": true, "helpfulness": "1/1", "author": "Sridhar Ravuri"}, {"rating": 1.0, "review": "Very disappointed after all of the hype.  Tried to connect this device using two different wifi access points (Verizon FIOS and ASUS AP), and after several hours of troubleshooting and trying different wifi configurations, the chromecast never did connect.", "verified": false, "helpfulness": "4/9", "author": "Amazon Customer"}, {"rating": 2.0, "review": "After purchasing this, I realized how limited its functions are.  I was probably better of buying Apple TV or something else.", "verified": true, "helpfulness": "3/8", "author": "Kermit Loves \"Emmy\""}, {"rating": 2.0, "review": "I received Chromecast dongle approximately 4 weeks after I ordered it. Today it finally arrived (it was ahead of schedule, actually). I plugged it in, and started the setup process, which took only a few minutes to complete, and went reasonably smoothly. However, after using it for less than 30 minutes, I decided to return it. I'll explain the reasons but first, a little background:I watch a lot of online contents on my large screen TV, so I keep my computer connected to the TV using a HDMI cable. Because the TV set has only two HDMI sockets, one is being used for connecting to a blue-ray player, to use the Chromecast dongle, I had to unplug the cable that connects the computer.Here comes problem #1: Chromecast dongle takes a HDMI socket, but it cannot entirely replace the cable because it only \"casts\" limited set of programs (youtube, google movie, etc.) to TV. Which would be fine IF that were the only thing I watch. But I also want to watch the other stuff. So the only way to it, if I keep the dongle, is to keep switch back and forth between Chromecast dongle and the cable. It would be a big hassle with no apparent advantage.A second problem I had was that when I use Chromecast to watch programs on TV, for some reason the audio signal failed to reach the stereo system connected to the TV. So, in order to watch youtube etc. on TV through Chromecast, I would have to rely on TV speakers, which are not that great.A third (potential) problem, is that Chromecaset relies on home wireless network. It uses a lot of bandwidth, so depending on the speed of your wireless router, it may or may not be a problem. It wasn't a problem for me but I could imagine that it could be an issue on some older home wireless networks. By the way, the dongle gets really hot after about 10 minutes of use.Anyway, it worked but after the initial excitement, it was quite a disappointment.", "verified": true, "helpfulness": "5/12", "author": "Kent92"}, {"rating": 5.0, "review": "Loe it - love it - love it.  Took no more than 5 minutes to get it working.  I am very pleased with it.  Did I say I loved it ?", "verified": true, "helpfulness": "0/1", "author": "marian reed"}]