[{"rating": 5.0, "review": "This HDMI port lets you stream anything from your computer.from Iphone or Tablet it lets you stream netflix, Youtube, pandora and other aplications.AWESOME!!I'll recomend to have a stable and fast internet connection!!", "verified": true, "helpfulness": "0/0", "author": "Sibling"}, {"rating": 3.0, "review": "I wanted a gadget to stream videos from my laptop to my tv. But this only streams videos from internet and the pages from your chrome if you download an add-on  (still beta). The specs that describing that gadget are not very clear. So I thought it will fit to my needs but it doesn't. I am thinking of returning back", "verified": true, "helpfulness": "0/0", "author": "Kwnstanrinos"}, {"rating": 3.0, "review": "the google chrome was a gift for my son, he is happy with it by not over thrilled with the clear, sharpness of pictures", "verified": true, "helpfulness": "0/0", "author": "Chirstine"}, {"rating": 5.0, "review": "Easy to use and setup. Excellent product. I have purchased five of them. Four have been gifts and everyone that has used the device cannot believe how easy it is to use and setup. I highly recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "D. Watkins"}, {"rating": 5.0, "review": "With just the code to our home wireless system my son had this running without any issues. My  router is in the 1st floor family room north; his room is second floor west. In a larger home the connection to the D-Link was perfect.", "verified": true, "helpfulness": "0/0", "author": "FD Firefighter 121 \"Remember the 343\""}, {"rating": 4.0, "review": "Great item everything I expected.  Quick shipping with absolutely no complaints from me. I would purchase another one for my living room.", "verified": true, "helpfulness": "0/0", "author": "J. Whitaker \"Realist\""}, {"rating": 2.0, "review": "This thing only works with netflix.I supposedly has a feature where it can stream from a browser, but it never works at all.If you want a netflix machine, here you go! But thats the only thing it does well", "verified": false, "helpfulness": "0/1", "author": "Sergei Tuterov"}, {"rating": 5.0, "review": "Purchased this for my grandson to watch videos,etc. from his phone on his tv.  It was simple to set up and works as expected. Will probably buy another one with plan to eliminate cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Device will not play your videos (unless loaded on youtube) and has difficulty discerning between songs loaded on your device and the cloud. No ability to show pictures from you device.Returned.Waiting for google to loosen the strings.", "verified": true, "helpfulness": "0/0", "author": "Kyler Knudsen"}, {"rating": 2.0, "review": "It was easy to set up, had it up and going in five minutes or so. Hadn't had time to use it much till this weekend, yesterday it quit after about half hour or so. Tried everything to make it go again but wouldn't. Tried again this morning and started right up, again worked great for about half hour and quit again. Its not my WiFi, its up and working. Everything else was working with it. Not sure what the problem is, but its very frustrating. Great while its working, but it's not reliable.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]