[{"rating": 4.0, "review": "This small device essentially serves as Google's interpretation of Apple's AirPlay (of course with their own twist).  I still find myself using AppleTV over Chromecast, but for someone with more Android devices or no AppleTV, this would be an excellent option.", "verified": true, "helpfulness": "0/0", "author": "Bret"}, {"rating": 4.0, "review": "If you read the reviews they basically say the same thing.  Great idea but somewhat limited....for now.  There are great expectations about adding other features but who knows when.  Until then I do use it for the features it has and it's nice that I can use it from my iPad, SG$ and my MacBook Air.", "verified": true, "helpfulness": "0/0", "author": "gshacienda"}, {"rating": 5.0, "review": "The Chromecast is exactly what I needed. Although I already have a PS3 and Xbox for Netflix/Hulu, its great to be able to plug this tool in anywhere, and stream Netflix, and especially stream the tabs from my Laptop. It works perfectly and I haven't had any problems with it yet. It works great with my iPad and my Galaxy S4. Hopefully more apps are released soon, especially apps like the soon-to-be-released app from the android developer that allows you to stream dropbox videos. Can't wait for the future of this device!", "verified": true, "helpfulness": "0/0", "author": "Robert Graham"}, {"rating": 5.0, "review": "excellent product works as advertised I would recommend this to others interested in streaming content from there smartphones tablets or computers", "verified": true, "helpfulness": "0/0", "author": "fjack"}, {"rating": 1.0, "review": "What a waste of time. I was so optimistic when I got it. Set it up in a few minutes. Worked fine.Then went back with my Mac a couple days later to sit back and watch YouTube. Would not work. Tried my PC. Would not work. Tried my phone. Would not work. The Mac, PC, and Smart Phone can all see the device and all the codes are right. But it will flat not work. I have been to the tech web site and nothing there that helps me. A bad purchase.", "verified": true, "helpfulness": "9/14", "author": "Angeles"}, {"rating": 5.0, "review": "Easy setup. Watching YouTube within 10 minutes. Simple to use. Looking forward to more having a wider selection of apps!!", "verified": false, "helpfulness": "0/0", "author": "N. Santiago"}, {"rating": 5.0, "review": "I purchased this chromecast to see how I would like it. It turned out that I can't stop using it . I did have to use the adapter to get a batter signal.The picture quality is amazing to say the least. I must say for the cost this item is worth it . I have another one on order with amazon, so I will have two of them on hand once they are back in stock.", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 5.0, "review": "Excellent product. Easy to setup.Good quality picture.Good prices.I'm going to buy my second one.I recommend to everyone with android os", "verified": true, "helpfulness": "0/0", "author": "JOSE MIGUEL MADERA"}, {"rating": 4.0, "review": "In one word the Chromecast is developing. It is a fantastic solution for those with good wifi and a Netflix addiction. It is super simple to pull up the netflix app on your device of choice, connect it to the Chromecast and select your video. It all automagiclly appears on your TV! The only drawbacks for me so far (and these are sure to be fixed): It needs more content available, it needs to auto play Netflix tv episodes and youtube playlists, and last it needs to be able to stream local content from a Laptop or mobile device. There are a few developers out there that are working on the content issues, and I am very confident that google is working on the playlists. My only regret in buying one of these was only buying one! for $35 I should have gotten three for all the TVs in the house and for my girlfriend.On another note, I am not sure how well one of these will work with a network such as you'd find at a Hotel or on a College campus where it is open and the authentication takes place after connecting to the server through a browser, I will be looking at this aspect in about a week when I have access to both types of networks. The only other problem I can foresee is that if someone is connected to the network they can connect to your chromecast. Much like Glass Google seems to have forgotten to include some sort of password or pin protection to this device from the start, it is likely however that this will change in the future as Google further develops the SDK and development really takes off and becomes available to the public.In short if you are unsure of whether to buy one of these don't. You should buy three. They are fantastic and simple, exactly what has been lacking in this niche market. Its not a powerhouse, it wont stream Hulu, Amazon, or HBO Go (Yet...) but its also only a month old and the Hardware will support it. As Google gets more support from Amazon, HBO and the like more content will become available. So stop reading reviews and go hit that Add to Cart button, you will not regret it.", "verified": false, "helpfulness": "0/0", "author": "D. Fischer \"WxFisch\""}, {"rating": 4.0, "review": "It's got netflix, youtbe, and google music. All of them work as easily as if you were playing it on your phone or table since the interface is the phone or tablet. I can't wait for more services to add this. More simple than this I doubt is possible. If you know how to use Netflix on your phone for example all you need to do is then press a button. AMAZING!", "verified": true, "helpfulness": "0/0", "author": "Demetrio"}]