[{"rating": 4.0, "review": "It is as advertised. Great with compatible applications like youtube. If you have great internet then solid quality for regular google chrome browsing.", "verified": true, "helpfulness": "0/0", "author": "Doug Blumenfeld"}, {"rating": 5.0, "review": "The Google Chromcast definitely is the best choice, not only for the price, I recommend it, it is great if you want to have all you need in your TV.", "verified": true, "helpfulness": "0/0", "author": "Renato \"Renato\""}, {"rating": 2.0, "review": "Perhaps I just did not read all the reviews closely prior to purchasing.  I don't know.  The ONLY thing CHROMECAST helps ME with is watching YouTube on my TV from my Samsung Tablet.  All the rest of the DESIRABLE apps, Netflix, Hulu I already have on my SMART TV.  I guess I was hoping I could at least find a few more apps that would integrate with the system (CBS, NBC, ABC, CNBC etc...).  Maybe I just have not looked hard enough.", "verified": true, "helpfulness": "0/0", "author": "Leslie M English"}, {"rating": 3.0, "review": "I bought the Chromecast to use with Amazon Prime TV shows.  Be warned that there are lots of problems streaming Prime -- pink screen, breaking up, halting, stalling -- HOWEVER, most of those issues are a function of our less than ideal Internet access.  I think the device is mostly working like it is supposed to, it just didn't work well for what I wanted it for.  Had I read the info on it before I bought it, I might have reconsidered the purchase -- not because it doesn't work, but because it doesn't work well for what I want to use it for.We live in the country, so our options for Internet access are limited.  We use Dish.net (related to Hughes.net), and while it is much better than the previous satellite and wireless providers we have used, it is still minimal for streaming video.  In addition, we have a 10 gb limit per month, so any video I stream has to be during the off hours (when we get an additional 10 gb a month bonus).  I watch lots of Prime between 6 a.m. and 8 a.m.  Breakup of signal is less significant on the small screen of my computer than it is on the big screen of the TV, so the problem is inherent with any streaming.The pink screen thing (while using Chrome browser) is a deal killer for me.  There was a workaround (open the beta function of showing the whole screen instead of the Chrome window) that pretty much works, but according to other reviewers, it is a fairly new problem that needs to be addressed.My HD tv doesn't have a USB port, so I wasn't able to plug the Chromecast power cable into the TV, but I had to plug it into an electrical plug meaning that it was turned on all the time.  I personally object to anything that has to be ON all the time.  I also had the feeling that it was constantly accessing the wireless router for updates and images -- a deal when you are on metered Internet.If i decide to stream video to the TV again, I'll just use the hdmi port on my laptop or get a micro usb to HDMI device for the Galaxy Tab 10.On the up side, it streamed video (files on the tablet)  from my tablet beautifully using a free app from the google play store.  Since that is what my daughter wants to use it for (along with Netflix which I don't have for obvious reasons), I passed the device on to her.  If she has any further input, I'll update the review.", "verified": true, "helpfulness": "10/13", "author": "V. Sharol Cutrell \"Sharol\""}, {"rating": 5.0, "review": "Just hooked this up yesterday.  Physical installation is very easy, just plug it in.  The set-up of the device to your wireless will take about 5 minutes, no more than 10.  You just go to the website, give your device a name, download the app on your phone, or the plug-in onto your Chrome Browser, and start watching.  I watched Game of Thrones, and never even had to touch my computer, I did it from my phone app for HBO GO.  Also, the volume button on your phone controls the volume on the TV as well, which is very convenient.", "verified": true, "helpfulness": "0/0", "author": "SeanCEyler"}, {"rating": 1.0, "review": "I was excited to use this to stream to a TV.  The challenge is that it won't work to stream to a TV in a hotel room, as every device on the WiFi network seems to need authentication.  It's a great product if you want to stream to a private network, but if you are in a public network that requires authentication (e.g. hotel that needs you to click on \"I accept the terms...\") it will not work properly.  At least that's been my experience.", "verified": true, "helpfulness": "0/1", "author": "Ed Barry"}, {"rating": 5.0, "review": "I didn't know you could use it with any PC/MAC. That's pretty nice to me because you could watch movies from your computer in the TV.", "verified": true, "helpfulness": "0/0", "author": "George"}, {"rating": 2.0, "review": "It  works but alot to go thru and to much delays, need strong wifi and strong laptop and you have to have goggle chrome to work", "verified": true, "helpfulness": "0/0", "author": "Richard Friedle"}, {"rating": 2.0, "review": "Not really impressed! I mainly bought chrome cast to stream Netflix to my tv but it will not work! I called Netflix they blame chrome cast and did trouble shooting it didn't work therefore it was chrome casts fault! I called google they blamed Netflix they know it's happening but are working on \"fixing\" the problem! End results I get to deal with a product that doesn't work for what I need it to do! It does work with other sites such as Hulu plus, YouTube, the CW etc!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"I love shoes\""}, {"rating": 3.0, "review": "Technology is cool if you do not own a wifi TV. So far I've been having trouble with connecting and streaming video to play on Chromecast, though it will play with no issue on device.Not satisfied as I had expected to be. I will attempt a few more times either way not too expensive of a loss.", "verified": true, "helpfulness": "0/0", "author": "VRico22"}]