[{"rating": 5.0, "review": "Easy to use and gives me a lot of viewing flexibility; great for online courses", "verified": true, "helpfulness": "0/0", "author": "kue"}, {"rating": 5.0, "review": "The only downside is that there is no easy way to have amazon instant video streamed to my TV. Otherwise, it does exactly what it says it does with very minor set up.", "verified": true, "helpfulness": "0/0", "author": "Pedram Arani"}, {"rating": 3.0, "review": "Doesn't seem like a fully mature product. Lots of bugs, mainly due to chromecast implementation on other apps.", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "jcmoore"}, {"rating": 5.0, "review": "I'm very glad I brought this product.", "verified": true, "helpfulness": "0/0", "author": "Quentin Archer"}, {"rating": 5.0, "review": "Excellent! I'm very happy with the product!", "verified": true, "helpfulness": "0/0", "author": "Patricia Lechuga"}, {"rating": 5.0, "review": "A great mini stick, but no point in buying it if you have an excellent SMART TV.Below can be the reasons you should consider buying this device- If you dont have a SWIPE n Share feature in your TV. This works great- If you want to mirror your complete desktop or your web browser to your TV wirelessly- If you dont have a SMART TVPROS- Browser mirroring is best in class considering this price- Slight lag in Desktop Mirroing as it is still in Beta version.- Android phones can be completely mirrored- Very Simple setup, integrates very well- Audio sync is perfect- InexpensiveCons- Doesn't have a great list of supported apps, hopefully Google would add more in the future.- IOS apps are limitedOverall a worth-full stick, user friendly interface", "verified": false, "helpfulness": "1/1", "author": "Srinivas aathiyan"}, {"rating": 2.0, "review": "First off, I don't write many reviews unless I think it's warranted.  I also don't just arbitrarily run products In the mud unless I've had some experience with them.  I can't give this one star because when it works it works well.  However, it (or maybe just mine) decides, on any given day, when it's actually going to show up on the network.  No, it's not a range issue.  Router and chromecast are in the same room.  Not a speed issue, I'm drawing 15-30 Mbps.The only solve is to reset the damn thing which really takes the convenience out of it.  And even then it's hit or miss.I have had the thing a little over two years, and it's really been more of a pain than not.I can't recommend it in good conscience.  Sadly for Google, I am also in an industry where this could be used in any given solution that I engineer... I steer my clients elsewhere.", "verified": false, "helpfulness": "0/0", "author": "Joseph E. Boos \"Boozer856\""}, {"rating": 1.0, "review": "Did not work for me too complicated to set up. Returned and ordered amazon fire stick for streaming easier to set up works fine thank you..", "verified": true, "helpfulness": "1/1", "author": "B. J. Lindow \"silver moon\""}, {"rating": 5.0, "review": "Great!  Beyond expectations.  Excellent gift.", "verified": true, "helpfulness": "0/0", "author": "Alex Matsumoto"}]