[{"rating": 2.0, "review": "Netflix's iPhone app and website player have bugs that still haven't been fixed since the Chromecast's release in July.It will not play the next episode automatically, and the website's playback control buttons while casting are buggy.Pandora Radio's website does not have casting integrated yet.YouTube's website player while casting has bugs with volume levels, and playback sometimes restarts.Google Chrome's Google Cast extension says it is casting when it's not.Casting tabs is very delayed, and I cannot seem to fit the entire tab on my HDTV using the available extension options.I expect more out of the Google Chromecast considering its popularity and how long it has been available.", "verified": false, "helpfulness": "0/0", "author": "Chaz"}, {"rating": 3.0, "review": "U cannot watch amazon prime on it. It good idea though. U can not watch any thing other than YouTube and Netflix.", "verified": true, "helpfulness": "0/1", "author": "Joe"}, {"rating": 5.0, "review": "First of all I just want to say that we have came a long ways with technology, im 28 and I remember when you were fortunate just to have rabbit ears on your box television so you could try to have a clear picture but anyway back to the review. This product is by far one of the best I have ever purchased from amazon and I purchase a lot of items from them. The package comes in a nice little box everything is neatly organized inside, you really dont need any instruction to read as there is a diagram on the side of the box with 3 visual instruction. All you need to do is plug the device in, change the input to its corresponding channel and Google will walk you through the rest. Once I finished my setup of my Space Age Chromecast(thats what i named it) I tried it out with my phone through netflix, pandora and youtube and it works like a charm, it only takes a few seconds for the video to pop up. This product is ideal for me as I own a kindle fire, Iphone, laptop and desktop(im kind of a tech junkie) so I can watch my movies on the big screen anytime. I highly recommend this product and so far this has become a hit with my parents as they wanna be hip to so they are gonna purchase one as well!", "verified": true, "helpfulness": "0/0", "author": "H. Wright"}, {"rating": 5.0, "review": "This was easier to set up than my Roku and I love that I can cue up videos from YouTube, then turn the tablet off, and they will all play. I had a wonderful fireplace on Christmas Eve without using up my tablet's battery. You can't even see that it's there unless you look. I'm very pleased with it.", "verified": true, "helpfulness": "0/0", "author": "Rhapsody"}, {"rating": 4.0, "review": "It does not do everything you want but in time this will be an excellent product. I would recommend this to friends.", "verified": true, "helpfulness": "0/0", "author": "J"}, {"rating": 3.0, "review": "Its supposed to be easy, but it took forever to set this up.  I couldn't find it on my wifi network from neither my computer nor my galaxy SIII android phone.  After plugging it in and unplugging it multiple times it eventually started working.  Once I got it working I found I don't have much use for it.  I thought it would be cool to be able to cast browser tabs from my computer and phone.  In reality, I've never once actually wanted to do that.I would probably use it more if I could cast my whole desktop, but at the time of this review there weren't all that many supported applications.", "verified": true, "helpfulness": "0/0", "author": "Ryan C. Dorn"}, {"rating": 5.0, "review": "I love this thing so much I would buy some to my neighbors... expect that I don't talk to them.  In any case, this device is awesome for kids who want to watch TV while you (fellow over tired parent) want to stay in bed.This dongle of magic wonders gives me the super power of queuing up 1, 2,... 3(?) hours of youtube videos of their cartoon characters to play back to back while I get to sleep off their screaming overnight tantrums.Got a roku? Don't throw it away, it still does SOME things better than the Chromecast, but hey those Googlers are catching up quickly.", "verified": true, "helpfulness": "0/1", "author": "epinto"}, {"rating": 5.0, "review": "This is a great simple add on to your TV which allows broadcasting via Bluetooth with ease.  The setup was easy and did not take that long.", "verified": true, "helpfulness": "0/1", "author": "L. Cobb"}, {"rating": 4.0, "review": "Super fast delivery!  Not very clear setup instructions.  I was expecting more of a wireless HDMI affect but this is limited.  Maybe I should do more research and troubleshooting.", "verified": true, "helpfulness": "0/0", "author": "st"}, {"rating": 5.0, "review": "Google Chromecast HDMI Streaming Media Player is a fanatastic device.  It is as advertise and a lot more.  I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Thomas Sales"}]