[{"rating": 5.0, "review": "Couldn't live without it, now that I have it.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Johnson"}, {"rating": 3.0, "review": "This doesn't seem to be working so well for us when we try to cast live streaming programs.  They freeze up and stutter. We've used it for webinars and to watch a live stream of a church/memorial service. Had problems all those times.  Works great with YouTube videos or photo shows.  Anyone else having that same problem with live streams?", "verified": true, "helpfulness": "0/0", "author": "Barbara Bolton \"animal lover\""}, {"rating": 5.0, "review": "This is an incredible gadget!  It works perfectly.  Not sure how I ever existed without it!", "verified": true, "helpfulness": "0/0", "author": "Greg S."}, {"rating": 4.0, "review": "I enjoyed items But the return shipping got charged.", "verified": true, "helpfulness": "0/0", "author": "regina yhk chang"}, {"rating": 5.0, "review": "Nice way to have internet on tv", "verified": true, "helpfulness": "0/0", "author": "Raffaele"}, {"rating": 5.0, "review": "Great device with awesome features", "verified": true, "helpfulness": "0/0", "author": "ISMAIL"}, {"rating": 5.0, "review": "Nice and helpfull. Easy to use and install", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "It's good, I use it every day", "verified": true, "helpfulness": "0/0", "author": "ARACELIO QUINTANA"}, {"rating": 5.0, "review": "I heard about this years ago when they came out with it but never thought to buy it.  I had an extra TV in the house but no cable to hook up to the sattelite so I had attached this to the TV in the kitchen just to be able to play music or watch shows on and it works great.  I can play pandora or netflix right from my phone or tablet.  It was easy to set up.  I really like it because I just watch a show while I cook in the kitchen now.  Can play Pandora is you have friends over as well.  Also can broadcast Youtube or pictures on your phone or tablet.  Very neat little device.  I also plan to carry it with me when we go on vacation as you can just hook up to wifi and stream your shows or music on tv available in the room.", "verified": true, "helpfulness": "0/0", "author": "E. Layfield \"traveling mia\""}, {"rating": 5.0, "review": "Best streaming media device for the price. Hands down...", "verified": true, "helpfulness": "0/0", "author": "Jason S."}]