[{"rating": 5.0, "review": "This system blows apple tv and WD live out of the water. Plex works flawless and its super fast. Highly recommend for Amazon prime members and Streaming Video.", "verified": true, "helpfulness": "1/1", "author": "jason wesolowski"}, {"rating": 5.0, "review": "Amazon Fire TV is an amazingly compact device that packs big power. In fact, it is Fire's superb specs that ultimately swayed me from choosing either Roku or Apple TV. I've seen both in action and Fire easily outperforms them in terms of load times and speed, and even offers a few games that are clearly beyond the hardware capabilities of both Roku & Apple. No, Fire TV isn't going to replace your PS4 or Xbox One anytime soon as a gaming device, and many of the games that are available are mediocre Andriod ports, but the fact that it has this added capability will (if proper games are developed for it) be a huge plus for Fire TV moving forward.With two noteworthy exceptions, HBO Go and Vudu, all the great movie streaming apps are here and easy to use. However, in light of Amazon's recent deal with HBO that's slated to bring both HBO's impressive library to Amazon Prime later this month and add HBO Go to Fire TV's app lineup later this year, this shortcoming is only a temporary one. Hopefully, Vudu will also be added soon as well.The one glaring flaw in Fire TV's presentation, as many others here have noted, is the lack of a separate category for Prime content only. While it is true that there are categories such as \"New on Prime\", \"Recently Added to Prime\", etc, what is needed is an additional category enabling Prime customers to sift through individual movie and TV genres, as they can on Amazon's PlayStation app. This omission greatly diminishes Fire TV's presentation and can make navigating through Amazon's movie library unnecessarily frustrating and difficult. I shouldn't have to revert to my PS4 if I want to easily navigate my way through Prime's offerings if I already own a Fire TV, but that's what I have found myself doing. It is my understanding that Amazon does intend to remedy this in a future update with the inclusion of a \"Prime Browse\" category. That is good, because it's Fire TV's only shortcoming. Once that is accomplished, my rating for Fire TV will increase to 5/5.Overall, the good outweighs the bad for Fire TV. Provided that Amazon fully supports Fire TV going forward and listens carefully to customer feedback on how to improve it, there's no reason why this device shouldn't net Amazon the dominant position they obviously want in the home streaming market.Update 12/15/14:HBO Go has finally been added to Fire's increasingly impressive app library. Between Prime, Netflix, Showtime Anytime, Hulu Plus, Crackle, and now, HBO Go, this device now packs as much entertainment punch as Roku or Apple, if not more so, because of Fire's ever-growing library of games. In addition, the other criticism I offered back in May, that being the lack of a separate category for Prime content only, was fixed in a long ago patch. This device is now perfect in my eyes and I'm updating my rating to FIVE stars. Great work, Amazon!", "verified": true, "helpfulness": "3/3", "author": "AJR"}, {"rating": 5.0, "review": "Although I've used many other WiFi movie streaming devices in my house (Samsung Home Theater (two), Samsung 3D Blu-ray (three), Sony Google TV (one), Roku (two), and Apple TV (one) ), the Amazon FireTV has now replaced all the other streamers in our home.  With a quad core processor, 2 GB of RAM, and the voice activated browse on the remote I love this device.  The WiFi was so fast, I bypassed the Ethernet bridge I'd been using and connected directly to my WiFi using an Apple Airport AC 1200 dual band router.  Our development receives excellent throughput from Comcast which averages WiFi speeds in the range of 75 Mbps.  I've experienced no buffering or queuing  issues like what we had experience before with the Apple TV and Samsung Home Theater streamer devices.  Although there may still be one or two streaming devices which I have not used in our home, the Amazon FireTV is the best I've tried so far.  I purchased another FireTV for my daughter's house and the order which was placed on Friday night was delivered to her house Sunday morning, with only a day and a half turnaround.  I highly recommend the Amazon Prime service if you're going to watch movies on the FireTV.  It will save you a lot versus the same movies on AppleTV. In many instances the the movies are free with Amazon Prime.", "verified": true, "helpfulness": "3/3", "author": "Boca Buyer"}, {"rating": 4.0, "review": "Ability to download and play games is a big bonus. Many free apps and a powerful processor make this a delightful entertainment source.", "verified": true, "helpfulness": "1/1", "author": "jamjind"}, {"rating": 5.0, "review": "This is AWESOME!!  I am soooo low-tech that I never tell anyone how little I know.  My cell makes phone calls, nothing else.  I don't know how, I push a button and I talk to people.  AND, I'm happy.  AMAZON FIRE TV is like that for me.  Get a cable that AMAZON tells you you'll need for 7 bucks, plug into back of TV and plug other end of this cable and guess what???  I GOT MOVIES!!  I watched 3 old sci-fi movies for $00.00 (zip) and lovin' it!!  I'm a PRIME member so lots of movies to watch.But, just to see if I could talk into the remote tell Scottie does in Star Trek, \"Raging Bull\" (I'm even Southern)...I'm watching DeNiro!!  (All I did was buy the $7 cable and I'm talking into my remote to load up a movie faster than my DVD player does!!).AND, my Wi-Fi is my \"home\" office that was added to my house through a brick wall.  Fire TV works better than my email and the internet.  I love this, so glad I purchased!!", "verified": true, "helpfulness": "4/5", "author": "SandyInIndy \"SandyInIndy\""}, {"rating": 5.0, "review": "I have a Roku 2 but I bought a Amazon Fire TV as an upgrade.  It is really a much better device: better pictures, fast loading, easy to  browse and way more channels and uses.  I am impressed.  This is really the most up-to-date device at this time to get if you want to watch video and Apps from the internet.", "verified": true, "helpfulness": "3/3", "author": "Peter"}, {"rating": 1.0, "review": "The Fire Tv was good in many ways (ease of use, setup, streaming was very solid), but it fell short in a couple key ways.  First, there is almost no support for the device, except for an FAQ.  Which wouldn't be so bad, except when there are problems. Our problem started when we added the parental control. It's very easy to buy streaming videos accidentally, so I wanted to have the confirmation.  But the parental control goes online to check your password. So in the middle of streaming a movie, my wifi connection dropped, and in order to get back online, it has to confirm the password.  Which it needs to be online to do, so it never gets past the parental control screen.  I tried restarting, resetting to factory, everything seems to require the password, so I essentially have an Amazon fire paperweight, which I reluctantly returned.Anyway I hope this is helpful and hopefully they resolve these problems, but I'd probably give it some time to work out some of the kinks.", "verified": true, "helpfulness": "9/16", "author": "T. Eng"}, {"rating": 4.0, "review": "Love the unit and speed... Remote is a big plus with searching but it currently does not work with PC based DLNA content shares.", "verified": true, "helpfulness": "0/2", "author": "Kevin B."}, {"rating": 3.0, "review": "The last thing I want to do is pay $100 for a device, and then have to pay more for content. That is exactly the situation with AFTV. There is Hulu Plus for current TV shows, and Netflix for current films. Both require paid subscriptions. There is a lot of free content on the web, but AFTV doesn't provide access to it (not even Hulu \"minus\"). My kids seem to like the (limited) free games. It will be used primarily for that purpose, and the occasional \"free\" Amazon Prime movie. It will not inspire me to unplug my Directv.", "verified": true, "helpfulness": "0/0", "author": "R. Feldman"}, {"rating": 1.0, "review": "The material said you could access ESPN programs - like PTI - when trying to access those - you also have to have an account with a TV service provider like AT&T;, etc.The reason we wanted to use this product was to not have to have subscription service like AT&T; - which is not even avaiable in my area", "verified": true, "helpfulness": "3/10", "author": "SC GrandMother"}]