[{"rating": 5.0, "review": "It took only about 15 minutes to set up the Amazon Fire TV and start watching shows.  The Fire TV had no problems communicating with my eight year old TV and my three year old surround sound system.  The sound and picture quality is equal to my playback of DVD's.  I was surprised that with my speech impediment the Fire TV understood my speech.  I would like to see more APPS that provides weather information and network news.", "verified": true, "helpfulness": "0/0", "author": "Sid Hollowell"}, {"rating": 5.0, "review": "Its easy to use right out of the box, blew me away. Great interface and easy to get to what you want to watch quickly. They seem to have taken a few notes from Apple and its paid off. HIGHLY recommend!", "verified": true, "helpfulness": "1/1", "author": "Richard Cardarella"}, {"rating": 1.0, "review": "Not good guality for Internation is only  and not be use outside US, is basically  for only netflix use for international", "verified": true, "helpfulness": "6/25", "author": "Gilberto Castro"}, {"rating": 5.0, "review": "This product is fantastic!  Compact, but full of features.  Easy to install and connect to my wireless router.  Seamlessly works with My Amazon Prime & Netflix and the voice search feature is a blast!", "verified": true, "helpfulness": "0/1", "author": "e.byrne"}, {"rating": 4.0, "review": "Pros:-Voice search works great. Very responsive and has had little trouble recognizing what I say.-Menus move smoothly-Seems to run at good speed-Sleek look and quality made-Great 30 second jump buttons as well as fast forward-Plex Out of the boxCons:-Menus are laid out in a horrible fashion. I feel like I am going the right way but end up in the wrong place.-Amazon Prime Free videos should be easier to browse-Issues using an older HDMI LCD tv. Video went black.I have/used Roku, WDTV, AppleTV and my own made XBMC media centers and I would say Amazon Fire TV has jumped right into the pack. I think if it refines its menus it would start to pass the other, but I would hope it would do so since it is a box with twice the power of the others.", "verified": true, "helpfulness": "3/3", "author": "Robert LaBarre Jr"}, {"rating": 1.0, "review": "Amazon is becoming like Apple, creating garbage to purchase, just to watch people spend more money for nothing more.Received this as a gift.  First issue was the setup.  This idiot box would not link with my WiFi.  Had to add a ethernet cable to make it work.  Also, with previous device is could run through my sound system.  This one has nothing to let you do that function.  I would rather have taken the money and spent it on a wireless blu-ray with internet options.  Could have had one less box to deal with!", "verified": true, "helpfulness": "6/36", "author": "Gregory A. Riley"}, {"rating": 2.0, "review": "When I got this device I was very excited about the voice search, since it's painful to type with the small remote on the Apple TV and on the Roku. Then I found out that the voice search only works globally and it doesn't return items on all applications.Browsing items to watch in this device is like walking through a minefield of pay-per-view items mixed with free-to-view items.I really don't understand what's the business model... If Amazon is trying to woe people to their service and away from Cable, what's the advantage when for most of the shows you have to pay $4.00+ dollars just to \"rent\"!In a month, that comes up to much more than the $150.00 many people trash on Cable service.Amazon should really go to a flat-fee all you can watch, even if the fee is higher than Netflix.", "verified": true, "helpfulness": "2/8", "author": "Viktor"}, {"rating": 5.0, "review": "This has been what I have been asking for, a way to play the prime Instant Videos on my TV.  It took about five minutes to set itup (for me that's a miracle) and in no time at all I was watching all my stuff.  I can find nothing negative about it.  The voicerecognition works fine if you speak distinctly.  I can't tell you how the games work because I'm just into the shows and themovies.  As far as they are concerned, it's awesome.  I am a very satisfied Amazon junkie.", "verified": true, "helpfulness": "1/1", "author": "Jackie W."}, {"rating": 5.0, "review": "We figured we were pretty much switched over to Amazon/Kindle products and thought \"what the hay\" we might as well try the Fire TV.  We are very pleased and surprised with how much we use it and like it.It is very nice to be able to bring up the streaming shows including our watch list on a large screen and at a click of a button be able to watch a movie, show or whatever.  The voice command is REAL NICE, not having to type in a search on those tiny buttons is such a help.We also have played some games on it and I must say I didn't have too much hope for that part but once again am pleasantly surprised.  We held off ordering the controller thinking it probably won't be used, but after seeing the games you can play with it we will be ordering that too.  It is not available right now so we will have to wait till it is in again.I watch my You Tube subscriptions on it for my paper crafting tutorials and such and it is sooooo nice to sit on the couch and have them on the big screen at a touch of a button.  :)  Lazy? yup and I love it. LOLWe recommend the Fire TV and have no regrets so far in buying it.  In fact, we will be getting another one!!", "verified": true, "helpfulness": "3/3", "author": "CraftsnCoffey"}, {"rating": 4.0, "review": "Performance is awesome compared to any other similar devices or smart TVs.  Very fast to navigate through menus and load movies/TV shows or games.  Overall easy setup and remote works very well.  Audio search works very well, one of the best features.  I bought the game controller and my kids really liked the games and impressed with game selections and performance for such an inexpensive device. Expect to pay for games but most are very inexpensive (several dollars), especially compared to the traditional games sold for Sony/Microsoft game consoles.  TV and movie selections are good.  The Amazon Prime content is not well organized, which was disappointing, but by searching you can find the content.  Netflix works fine and easy to setup when I used my existing account.  Overall I really liked the product and would have given 5 stars if the Amazon Prime content was better organized, which I think Amazon could easily fix.", "verified": true, "helpfulness": "3/3", "author": "Daniel Gilbride"}]