[{"rating": 5.0, "review": "I've had a roku box ever since it came out and this is better! The voice search feature alone is worth the price!  It is so easy to use and you never have to type in the names of actors or shows that you are searching for.  The box is so small you can hardly see it so it takes up very little room on the entertainment center.  You don't have to point the remote at the box to use it, so you could hide the box altogether if you want.  If I had any complaints about this unit at all it would be the fact that you can't use the voice search feature to find movies on Netflix and Hulu Plus.  However, it is my understanding that Amazon is working on putting that feature in later this year.  This box is a great buy for the price.", "verified": true, "helpfulness": "1/1", "author": "Karry W. Foster \"Media Man\""}, {"rating": 5.0, "review": "GREAT WAY GOT WATCH AND FIND BY YOUR VOICE ANYTHING YOU WANT TO WATCH. IF YOU HAVE AMAZON PRIME, MANY, MANY MOVIES AND TV SERIES ARE FREE.", "verified": true, "helpfulness": "0/0", "author": "M. Ward"}, {"rating": 4.0, "review": "I like the voice search.Although, it says in the promotional material/intro that it returns the cheapest items first, this is not always true. I have netflix and their movies don't appear first even though they are already paid for.The controller takes my TV right to the Fire TV menu. Neat! I don't have to use the TV remote to get there. Good speed.It can be a little quriky. Like a recent Netflix TV searies will briefly appear and then disappear before you can select it for the next show in the searies.", "verified": true, "helpfulness": "1/1", "author": "Ralph Iam"}, {"rating": 5.0, "review": "We love this. Its alot faster then our apple box. Picture is great. Easy to navigate. The games are a great bonus to this. Kids love it. No one uses the apple box anymore.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We absolutely love our Amazon Fire TV . There are so many things we can do with on it . We would recommend it over any other .", "verified": true, "helpfulness": "0/0", "author": "nio123"}, {"rating": 4.0, "review": "I have been using my XBOX 360/PS4 and my blu-ray player to stream Amazon Instant Videos for years now. However, I have never liked having to boot all the way into a gaming system (and all of the stupid hurdles and forced upgrades, etc. that would hamper that) to watch videos, nor have I really ever liked the performance of streaming video from my blu-ray player.Enter the Fire TV. It is a dedicated streaming video set-top box. It is very small, and it works better than I expected it to work. It is very responsive (turns on pretty much instantly when you wake it), and I have had MUCH less in the way of problems with video playback watching video on it, rather than on my other devices (which I wouldn't be at all surprised if that was due to Amazon optimizing pipelines for their own devices, but c'est la vie).Additionally, the controller that comes with it, includes a neat new way to search for content, a voice search. It works shockingly well. (There is still a text search option if you prefer that).  The unit also has a plethora of A/V I/O options for those of you who want to do more than just run an HDMI cable to the unit and call it a day.PROS:-good audio and video playback-good interface-great controller with voice search-small profile-powerful device with good technical specs-supports gaming!NEUTRAL:-the price is a bit steeper than some other set-top boxes out there-It only has 8GB of storage for downloaded games, etc. The pack-in game alone for the gaming controller will take up about 1/6 of that. Any other games that are larger (like The Bard's Tale) will take up most of the rest of the space. Since you HAVE TO download certain games to play them, that could be a problem.-Amazon provides access to other content providers like Netflix on their system, but they prioritize their own content over the 3rd party stuff -- making you WORK to get at the non-Amazon content. That isn't a problem for me, because I don't use Netflix or anything else. But I know that will annoy some people.CONS:-no power-off switch, button, or controller input, the only way to force it to power-off, is to physically unplug it. I don't like that. The unit will \"sleep\" after going through a screen saver mode, though.-I have not been able to get the Ethernet port to work, it refuses to work with my Ethernet cabling (which all of my other devices use just fine) -- forcing me to use wireless with it (which I hate to do, because I hate wireless)Overall, it isn't a bad unit. If you have already bought into the Amazon ecosystem, then you will like this device too. If you haven't, you may want to consider a Roku instead, unless you like the voice search or video gaming capabilities of this unit, and feel they are worth the additional price.4 stars.", "verified": true, "helpfulness": "1/1", "author": "R. McAdams"}, {"rating": 4.0, "review": "It is unbelievably easy to set up. Once I connected to my wifi it played an annoying little video and then we were good to go. We watched Barnyard with the kids on our new Sony HDTV and wow were we blown away. I couldn't believe that we were watching a downloaded movie. The picture rivals that of a DVD and the sound through my receiver was excellent. The content available free leavesa lot to be desired but I ddidn't want to pay for yet another cable box just to watch a movie now and then. The kids got the hang of it and are already playing games with it. Good job Amazon!  I'm impressed. The best experience I've ever had with a new electronic device!", "verified": true, "helpfulness": "0/0", "author": "Bob Terwillager \"Especial\""}, {"rating": 4.0, "review": "I would have to say the esthetics are first rate. The speed is incomparable. I like the way that you are given \"other ways to watch\" if and when available is very cool. The voice search works really well, even letting you ask for other channel apps like Netflix and Hulu Plus. I have all the same choices in terms of prime versus shows that I want to pay a fee to enjoy. I have only 2 real disappointments, 1) the inability to access hbo go and 2) the way they lumped my video library all together with no separation between TV and Movies.Otherwise I really like it.", "verified": true, "helpfulness": "0/0", "author": "MICHAEL CARRINGTON"}, {"rating": 5.0, "review": "Sure there is room for improvement, but for my purposes of watch Amazon Prime movies and, Netflix, this is perfect.If you are a Prime user, this is absurdly easy to \"set up\".", "verified": true, "helpfulness": "1/1", "author": "Gregg"}, {"rating": 5.0, "review": "So very happy with my purchase.  Runs smoothly.  I also have Prime which opens up so many more things to watch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]