[{"rating": 1.0, "review": "If you want to watch Netflix, Hulu Plus, etc. I recommend a Roku player, which gives a smooth viewing experience.  The Chromecast dropped the signal or played in a choppy manner.  Controlling it is a pain because you have to use your other device as a remote.  So even though you can move to another screen on your device and do other things, you still have to keep popping back to the other screen to control what you are viewing on the tv.  This might not be a problem for some, but after experiencing the difference between viewing via chromecast and a Roku, there was no question for me.I might add that I have a couple \"smart\" blu-ray players as well and the viewing and connection is still no where near as smooth as with a Roku.", "verified": true, "helpfulness": "3/4", "author": "Massachusetts Mom"}, {"rating": 3.0, "review": "1.  It interferes with my existing WIFI network and connection drop has started.2.  No way to disable SSID name broadcast3. Some time, it plays only audio but video freezes.4. Have concern on security. There is not a way to configure for securing this device.", "verified": true, "helpfulness": "1/1", "author": "R. Joshi \"R. Joshi\""}, {"rating": 5.0, "review": "This is the greatest thing since sliced bread! It is easy to set up, easy to use. The hardest part is deciding what to watch!", "verified": true, "helpfulness": "0/0", "author": "Kesa Hopkins"}, {"rating": 5.0, "review": "I have had Chromecast for about a month now and really love it. I was looking for options to watch Netflix, Youtube, etc. on my TV and this far exceeds expectations. Incredibly easy to set up (literally 5 minutes), takes up very little space, and the price is great.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "I would love to give this thing nothing but glowing reviews but is does have some issues. The reason for 5 stars is that it is just such an amazing value.It has two maybe three problems right now.1. The first one I got was defective right out of the box. Google customer service SUCKED. I can't tell how disappointed I was with their service. I kept the email chain just because it was so ridiculous. But Amazon was a champ and had me a new one before I could be that upset.2. Its a little beta feeling, every now and then when it gets stuck switching between devices and needs a reboot.3. Netflix does not auto start the next episode after finishing a current one.other than those things its fantastic and I use it almost everyday", "verified": true, "helpfulness": "0/0", "author": "R. Birnie"}, {"rating": 5.0, "review": "It works well and u-tube has a wealth of good (and trashy) programs to take advantage of this device. A great value for the money!", "verified": true, "helpfulness": "0/0", "author": "J. Miller"}, {"rating": 1.0, "review": "The quality of the picture and the stream is just terrible. Even on a fast network with 30mb/s download speeds and a decent wireless router, the quality is un-watchable. At least it plays youtube videos like a champ....that's about it. Save yourself the time and money from buying this and just get a Roku box instead, 100x better for streaming and only 15 bucks more for 1080p.", "verified": true, "helpfulness": "0/1", "author": "Brett"}, {"rating": 5.0, "review": "I was really divided between Apple TV and Chromecast, but I decided for the latter due to its price, and I do not regret.Besides its simplicity, Chromecast does exactly what it promises very well. Also, there are many new apps being developed to it.It is a very simple, well made and cheap device.", "verified": true, "helpfulness": "0/0", "author": "Bruno Gama Catao"}, {"rating": 3.0, "review": "Nice remote control of TV from devices (iPad, iPhone). Save recording space on DVR since you can watch most programs thru Hulu, Netflix, etc,with Chromecast. Easy setup too.", "verified": true, "helpfulness": "0/0", "author": "Sparkybrn"}, {"rating": 5.0, "review": "Works as advertised.  I had a little trouble getting it working at first, but it turned out to be a config issue on my part when adding it to my router.  I am impressed with the fact that there has not yet been a buffering wheel or whatever they use to indicate buffering.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"nothing\""}]