[{"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Kenneth M. Becker"}, {"rating": 5.0, "review": "I have all of the features of a smart tv without the smart tv price.", "verified": true, "helpfulness": "0/0", "author": "Teshawnda Wilkerson"}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "R. Hughes \"gadget lover\""}, {"rating": 5.0, "review": "I use this a lot and it works great. The price I found it for was amazing. This was one of the best purchases on Amazon that I ever made!", "verified": true, "helpfulness": "0/0", "author": "Adam Morris"}, {"rating": 5.0, "review": "One of the best cord cutting tools out there.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Yowell"}, {"rating": 5.0, "review": "Excelent for those who do not have a smart TV,", "verified": true, "helpfulness": "0/0", "author": "John Troncoso"}, {"rating": 5.0, "review": "love it !!", "verified": true, "helpfulness": "0/0", "author": "yasser ahmed"}, {"rating": 1.0, "review": "Garbage! I purchased mine and used it for a few months and now when streaming a Netflix movie the Cromecast reboots itself every 15-20 minutes! I would not recommend this product!", "verified": false, "helpfulness": "0/0", "author": "Vincenzo Gulli"}, {"rating": 3.0, "review": "Solid at what it does. Contrary to other reviews you can multitask on your device while streaming. If you are streaming Netflix and then receive a call it doesn't interrupt the cast.However, I only have 1 hdmi port in my older TV and using a switch the Chromecast is the only device out of a fire stick, wii and roku 3 rust cannot stream YouTube or Google music properly. I have used multiple switches and these two apps always are buffering compared to the other devices.", "verified": false, "helpfulness": "0/0", "author": "Tony \"Tech Guru\""}, {"rating": 2.0, "review": "The lag time between streaming from my laptop to this thing is really really bad - I tried everything to fix it, but nothing helps.  All of my equipment has updated firmware and is the highest speed.  It doesn't matter.Somehow, streaming from YouTube is fine - no delays... but that's it.  I'm not sure what that means...but it's not what I hoped for.", "verified": true, "helpfulness": "0/0", "author": "A \"Reader\""}]