[{"rating": 5.0, "review": "This is my second Chromecast I really loved it. I recommend this product for Google lovers or at least give a try it won't disappoint you. The price seems fair and comes with enough accessories for you to use.", "verified": true, "helpfulness": "0/0", "author": "Brian Zepeda"}, {"rating": 4.0, "review": "This would be 5 star product if it worked with Amazon Prime video streaming. Correct me if I am wrong.", "verified": true, "helpfulness": "0/0", "author": "Erika \"greenflea\""}, {"rating": 5.0, "review": "Great thing to have. Especially for the kids to watch their TV programs live without cable.", "verified": true, "helpfulness": "0/0", "author": "Griselis Sanchez"}, {"rating": 3.0, "review": "works awesome with cellphone but video lags when casting from laptop", "verified": true, "helpfulness": "0/0", "author": "Pavan Konduru"}, {"rating": 5.0, "review": "One of the best purchases I have ever made was to buy the Chromecast. Bought this product over a year now and I have gotten more value of this 30$ product than I have for anything else I have ever bought. My parents love the ease of it. They are always casting so many different shows. The Netflix stream for me is excellent. This product also came in handy during the World Cup, I was able to stream the man different games straight to my TV. It is definitely worth having a few around the house. Google needs to bring more and more applications along that it will supprot and it will keep on getting better. Excellent Buy! Simple Setup! Cost Effective!", "verified": true, "helpfulness": "0/0", "author": "M.S."}, {"rating": 1.0, "review": "This device only works 10% of the time and does not in any way perform as advertised. It is a waste of money and I am returning it. Shame on Google for even daring to sell this useless device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A must need for people who enjoy multimedia streaming on their televisions.", "verified": true, "helpfulness": "0/0", "author": "Joshua Harrison"}, {"rating": 5.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Kevin Murray"}, {"rating": 5.0, "review": "Fantastic. Love it. Great for basic use of Netflix, Hulu, etc.", "verified": true, "helpfulness": "0/0", "author": "OneManWolfpack"}, {"rating": 5.0, "review": "easy to use...links up nicely with computer", "verified": true, "helpfulness": "0/0", "author": "Betty Stone"}]