[{"rating": 5.0, "review": "Just works.  Looking for additional apps to support casting.  Can't wait for what else is coming.  $35 Is a steal for this device.  Streaming netflix from the ps3 Is no longer our choice.", "verified": true, "helpfulness": "0/0", "author": "Khanh Nguyen"}, {"rating": 5.0, "review": "When this came out I jumped on it. Glad I did as the price doubled and tripled immediately after I got it. Should have gotten twenty and sold 19!!!!!  Works great- super simple, but as I said it is a little early as they need to line up other streaming support. I am sure that is happening as we speak and this will give the user greater media choices. Either way a pretty amazing product at a great price point.", "verified": true, "helpfulness": "0/0", "author": "ICONMAKER"}, {"rating": 5.0, "review": "What you expect is what you get!!! I highly recommend it to anyone! It is that good! and the price....", "verified": true, "helpfulness": "0/0", "author": "jmlc11"}, {"rating": 3.0, "review": "This review is for those that intend to use it outside of USA. using NetflixBefore you buy it make sure that you have Netflix service in your country, you will not be able to use a DNS service.  Chromecast is locked to Google DNS service. There is a lot of information on the web about this problem, read before you spend your money.If you have Netflix Latin America the Chromecast will reproduce Latin America programming even if you use a DNS service with the intent of receiving USA programming.You can customize the Chromecast settings such as IP address and DNS, but the DNS will not take effect.", "verified": true, "helpfulness": "2/2", "author": "Alex CK"}, {"rating": 5.0, "review": "Very nice product and easy to install. Easy integration with all the devices and TV. Hopefully few more apps will come in future.", "verified": true, "helpfulness": "0/0", "author": "Krishna Alavala"}, {"rating": 3.0, "review": "It works OK if you have netflex or want to watch youtube on your TV but I thought that I would be able to watch anything from my pc on the TV. This is not the case. I still have to watch my movies on the pc because the Chromecast would not send them to the TV.", "verified": true, "helpfulness": "0/0", "author": "Patrick W. Willis"}, {"rating": 5.0, "review": "Chromecast is awesome! I can't wait to see what other vendors add casting functionality to their products. It should be interesting to see screen casting polished up also", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 2.0, "review": "but they are ruining it with each update. There's no way to stop the updates. They need to stop acting like Apple and let the indie devs get in on the action.", "verified": true, "helpfulness": "0/0", "author": "Timothy Kowalski Jr."}, {"rating": 5.0, "review": "Chrome Tab Casting is just really awesome. Now Google just need to allow extension on Android version of Chrome then it would be perfect for business.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm glad that GOOGLE/CHROME thought up this device!It's really nice ! No more fumbling around trying to get YouTube and Netflix on to the Big Screen !I would recommend this device to anyone!", "verified": true, "helpfulness": "0/0", "author": "LARSON"}]