[{"rating": 5.0, "review": "Can't say enough about it. Got rid of cable. I use this and pay $8 for netflix. Between prime and netflix, there's always something to watch for adults and kids. Plus, with the amazon photo cloud storage (free for prime members), i upload all my phone pics and they are set as a screen saver. It's pretty cool to have a current slideshow going on the big screen at any time.", "verified": true, "helpfulness": "0/0", "author": "Melissa Knoppe"}, {"rating": 5.0, "review": "Puts the chromecast to shame!", "verified": true, "helpfulness": "0/0", "author": "John Dutton"}, {"rating": 5.0, "review": "I really like the Fire TV - works exceptionally well", "verified": true, "helpfulness": "0/0", "author": "Bradley Bishop"}, {"rating": 4.0, "review": "The set up is easy and great.  Picture quality is unbeatable.  Menu and accessibility to online application (Hulu, Vudu, etc....) easy.  The missing link is still access to current programing on national networks and cable networks, the per price show is pretty high.  Further the Fire TV promotes  Sling TV app. but I cannot distinguish it from any other app. and do not know what the monthly fee is or what is included.  I did have Roku for a trial but is was not easy to set up the programing, Fire TV is much more user friendly.", "verified": true, "helpfulness": "1/1", "author": "Happy Jim"}, {"rating": 5.0, "review": "Buy it! For real, it is easy to use, the remote is small and does not feel like another remote you need to have around. Amazon OS works great, no lag and it comes with Sling TV, which is why I bought it.", "verified": true, "helpfulness": "0/0", "author": "Robert C. Capazzi"}, {"rating": 5.0, "review": "We bought this because we wanted to make better use of our Prime membership besides just ordering and getting two day shipping. Very happy with what we've viewed so far. The resolution is really good and we love watching shows without commercials. There was one movie we watched where the dialog was a little quieter than we would have liked but we might just hook this up to our sound system anyway.", "verified": true, "helpfulness": "0/0", "author": "lisagentile"}, {"rating": 1.0, "review": "I got the Amazon Fire TV in February.  Up until 2 days ago it worked great and I was very pleased with the product.  We canceled cable TV and used this to stream Netflix, YouTube, and Sling TV.  Then 2 days ago Amazon pushed out an update.  Our unit got stuck in a state where it says the update is unsuccessful and it will start up shortly.  It never starts up.  So we powered it off and on several times and we also did a factory reset.  Still the same problem.  So we contacted Amazon 2 full days ago and I spent close to 1 hour on the phone with 2 reps and it still doesn't work.  They promised to call me back yesterday and did not.  I've been told they have a ticket in for me with \"development\".  They said they did not send a new unit because it would have taken longer.  I don't believe that - if they overnighted a new unit I would have had it yesterday.  I think they are doing what is cheapest for them.  With most products, I would be fine with a few day turnaround.  But with this being my sole source of TV, I'm very unhappy.  Even my old cable company would send someone out within 24 hours to fix a problem.I'm all for cutting the cord, but I no longer thing this is a reliable way to do so.  My biggest issue isn't the fact that it failed after less than 2 months which is bad enough, it's that they are doing such a slow, poor job fixing it.  I've always had great support from Amazon in the past.  Very disappointing.", "verified": true, "helpfulness": "2/3", "author": "Zhaan"}, {"rating": 5.0, "review": "Great product no flaws with it in my mind.", "verified": true, "helpfulness": "0/0", "author": "Chris Baist"}, {"rating": 5.0, "review": "This device worked better then I expected. you need to make sure you have good internet first, but everything hooked right up and connected first time. and with prime and sling I get all I need.", "verified": true, "helpfulness": "0/0", "author": "Don Hollingsworth"}, {"rating": 4.0, "review": "Great way to watch movies.", "verified": true, "helpfulness": "0/0", "author": "Conley E. Foster"}]