[{"rating": 4.0, "review": "Google Play needs to have lot more apps integrated with this device. Also there is some lag sometimes with youtube and netflix. The wallpaper pictures are what my mom likes;).", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "I spent hours trying to make this work with my router, online and phone, still will not work! I was told to replace my router as to make it compatible with the Google chrome-cast , just what I want to do...spend another $50-70 dollar to save a few!?!", "verified": true, "helpfulness": "0/2", "author": "Jane C. \"geeseoh\""}, {"rating": 4.0, "review": "I primarily bought this product primarily for use with my Plex server, Netflix and YouTube. The setup was easy and experienced no problems getting it up and running whatsoever. Netflix and YouTube produced great 1080p results. With Plex the video began skipping every minute or more. After some tweaks on the server side, mainly upping the servers buffer setting, the video was smooth again. I believe this has to do the the lack of or minimal internal buffer on the chromecast. I had not experienced any issues with a using Roku on the same server, even remotely. Overall for the price it's a decent device. The always having to \"drive\" from a device does get a little annoying, but I knew what I was getting into when I bought it. I think this is great for the novice to advanced techie, but for the average person, spend the extra money and buy a Roku, Apple TV or Fire TV.", "verified": true, "helpfulness": "0/0", "author": "D. Gatenby"}, {"rating": 1.0, "review": "I heard about this and thought it was a great idea.The first two days were outstanding as I stream Netflix via my iPad.  However, after that the Netflix connection stopped working. That was really the only reason I purchased this unit.  There is basically zero technical support for this device so i am stuck.  There is a chat board but no one from Google seems to respond.  And there are countless customers who are having the exact same problem.  Occasionally someone from Google will provide a list of troubleshooting questions but no response after that.The system simply will not \"cast\" Netflix to my TV anymore. Same error message over and over.It is apparent that there is some KNOWN issue between Netflix and Google Chromecast but there doesn't seem to be any resolution. So $35 later I have wasted my time.", "verified": true, "helpfulness": "1/2", "author": "MartiniMenz \"MartiniMenz\""}, {"rating": 3.0, "review": "Not many apps can be projected but ok with netflix and youtube. Works well with my PJD5134 SVGA DLP Projector", "verified": true, "helpfulness": "1/2", "author": "balaji"}, {"rating": 5.0, "review": "pros-cheap way to get netflix on tvpretty goodfast and preloads the videocons-limited support of apps", "verified": true, "helpfulness": "0/0", "author": "thomas"}, {"rating": 4.0, "review": "I use this product relatively frequently to stream Netflix and HBO GO from my device and it works perfectly every time. The only downside is the need to have it plugged into a USB power source. Our TV is close to an outlet so this is not really an issue, but the aesthetic is hurt by an additional wire (especially when most of the promos show JUST the stick being plugged into your TV).", "verified": true, "helpfulness": "0/0", "author": "Rinnjamin"}, {"rating": 5.0, "review": "Excellent product! After installation I cut my Comcast for good and saved $150/month. Wish that I would have ordered it a year ago...", "verified": true, "helpfulness": "0/0", "author": "Larry B"}, {"rating": 5.0, "review": "The google chromecast works great with my android smartphone, my tablet pc and my laptop. The android smartphone and tablet pc have limited programs that you can mirror to your tv. netflix, youtube are a few examples. My laptop running windows 7 with google chrome and the chromecast extension allows me to mirror any page open on my browser. The chromecast  has a good quality picture and works well from 30 feet away from my tv, there is a slight delay from the laptop to the tv which can be seen during a slideshow presentation. It comes with a usb adapter cable which allows me to run it from my tv power without the use of the powersupply that is included with it. As one Reviewer stated it is basically a wireless hdmi cable it simply mirrors the image of your smartphone, tablet or laptop to you tv.", "verified": true, "helpfulness": "0/0", "author": "LOWELL HUCK"}, {"rating": 5.0, "review": "Setup was very easy and streams from our phones with ease.  Plan on buying another one for our other TV.", "verified": true, "helpfulness": "0/0", "author": "brian spellazza"}]