[{"rating": 5.0, "review": "This is a great product and it does everything as advertised and more. There are really no negatives for the product, especially at the price it is given. If you have a HDTV, wifi, and a computer or tablet, go ahead and buy this product. You will not be disappointed. And even if you are disappointed (which you will not be), the Google Chromecast only cost $35. There is no risk, so what are you waiting for. Hurry up and buy it!", "verified": true, "helpfulness": "0/0", "author": "TyFoulks"}, {"rating": 4.0, "review": "Nifty little device. Set up really quickly and got rolling right away. The transfers between iDevice and Chromecast happened quickly and seamlessly and the quality was great. Right now there's not a ton of stuff that's compatible with it, but it's an open protocol, so we're hoping there will be more stuff soon.We're also looking into \"off-label\" uses, such as driving messaging screens at work that don't always show the same content. Someone could start the video from their phone (such as a custom YT video), transfer it over, and walk away.", "verified": true, "helpfulness": "0/0", "author": "Chelsea Lynn"}, {"rating": 4.0, "review": "GREAT PRODUCT! BUY NOW!Only thing I would've liked is if it could stream higher quality videos / different formats. My server doesn't like converting on the fly…", "verified": true, "helpfulness": "0/0", "author": "Ardit"}, {"rating": 5.0, "review": "I bought this for my father for Christmas. We played around with it quite a bit and it works like a charm.", "verified": true, "helpfulness": "0/0", "author": "K. S."}, {"rating": 4.0, "review": "To be clear, my four-star rating is not because the device does not behave perfectly, but because there is room for improvement. My household recently had a dedicated home theater PC (HTPC) that died and to quickly fill a gap we opted to give Google's Chromecast device a try and now there's no looking back. Surprisingly, we've enjoyed better streaming performance across the board and with the exception of disc playback have been able to completely replace the function of the HTPC.Though it's true that Chromecast does not have the wide variety of apps available for it that its competitors do, the few apps it can run perform enormously well. The device has some truly stunning potential, and because of this I can understand that Google is being very, very careful with the content it officially supports. For those who may not be technically inclined, it is important to understand that Google is relying on third-party partners (eg. Netflix, Pandora, HBO Go) to supply direct integration, which means that certain companies, specifically Amazon, may *never* decide to make their competing products compatible with Chromecast. In this sense, the Chromecast device is very different from Roku and Apple TV which can extend licensing agreements with third-party vendors. Because of this, consumers should be warned that not all services they enjoy will eventually become available on this new platform. In that sense, similar products may always be at a certain advantage over this one.That said, the device performs remarkably well for what it does do. The \"beta SDK\" available for developers seems to have some genuinely stunning potential, and as a no-fuss content delivery device the Chromecast does not disappoint -- so long as your expectations are in order. The portability and inter-device compatibility are truly exceptional, and with virtually zero set-up besides simply linking the device to my Wi-Fi network I could not be more impressed. If Chromecast was never updated past today and continued to support the select apps it already does, I wouldn't complain.One other thing that really enamored me with the device is the extras it came with: a 6\" HDMI \"extension\" cable, a micro USB cord, and a AC-USB adapter. Personally, I needed none of these peripherals, but it reminded me of the fact that Amazon's own Kindles frequently ship without even one of those same USB components for a measure of cost-savings, and in fact sells single, Kindle-branded AC adapters for more than half of the entire cost of this device. The fact that Google threw in these extras for \"free\" as a convenience to me, the consumer, has earned them a generous amount of good-will. I would gladly recommend these to anybody who spends time in front of their TV and doesn't already have a dedicated set-top box for Internet streaming.", "verified": true, "helpfulness": "1/1", "author": "ninestories"}, {"rating": 5.0, "review": "I got it for myself, it s a great product and good price. I order more but was to late for x mass. I would by another. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "GOMEZ"}, {"rating": 2.0, "review": "Supposedly there is a $6 Google Play credit when I purchased it.  But there is no code provided by either Amazon or Google.  I tried to email the question to Amazon customer service, then I realized that Amazon does not give you that option to email them.  I spent half an hour on Amazon website looking for a link to email their customer service, there is NONE.  So much for the best internet retailer in the country.For the Chromecast, it's a great idea.  Still it's quite unpolished.  It drops connections often.  But I can see its potential.  It will get better and more functional over time.", "verified": true, "helpfulness": "0/0", "author": "blueforest"}, {"rating": 5.0, "review": "It's awesome! Works great! Easy install!and it's so affordable that you can buy one for each TV ...love it a lot!", "verified": true, "helpfulness": "0/0", "author": "Muriel Lizarraga"}, {"rating": 5.0, "review": "I bought this to my tech geek brother for Christmas.  Works perfect and it is cool that he can take this anywhere with him because of it's size.", "verified": true, "helpfulness": "0/0", "author": "Tim Kinney"}, {"rating": 4.0, "review": "Works fine with TV in good wifi range, spotty with other TV in room at edge of wifi range. Nice that you don't have to keep your device (laptop, phone, tablet) open for streaming to continue.", "verified": true, "helpfulness": "1/1", "author": "Nick"}]