[{"rating": 4.0, "review": "indeed a nice choice.", "verified": false, "helpfulness": "0/1", "author": "DJ Byrne"}, {"rating": 4.0, "review": "works great, easy to use and place anywhere without being seen", "verified": true, "helpfulness": "0/1", "author": "Andres"}, {"rating": 5.0, "review": "Awesome purchase", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Buy it, Love it! Do it now and never be without something to watch again. Easy setup.", "verified": true, "helpfulness": "0/0", "author": "Wooliewebs"}, {"rating": 2.0, "review": "The box works great the only problem with fire tv was it kept going to sleep mode in 30 mins if inactive and there no way to turn off the sleep mode. You have to press any button every 30 mins to keep it awake which very annoying", "verified": true, "helpfulness": "2/3", "author": "trinh trinh"}, {"rating": 3.0, "review": "The FireTV has generally been a good device for basic TV viewing.It's under-powered for gaming, *especially* the Fire TV stick (which we also have).The TwitchTV app (Twitch is owned by Amazon) is a terrible version - no search capabilities, no login, etc.The one *big* problem we have is its response to the remote - it turns on the TV and changes the TV's input selection over to the Fire TV input if any button on any remote is touched. This means it turns on/changes input when you move the remote, if the cats touch the remote, etc. This also seems to drain the remote batteries very quickly - presumably because any button press wakes the remote or the remote is always in standby.", "verified": true, "helpfulness": "2/2", "author": "Jason Maltzen"}, {"rating": 5.0, "review": "We really like our fire TV, we especially like the sleep mode images. Sometimes I wish I could change the setting so the sleep mode images would last longer.  One major enhancement request for the video library!! Please allow me to sort my purchases movies and tv shows by alphabet or genre rather then displaying the video's based on date of purchase (this is a really annoying feature).", "verified": true, "helpfulness": "0/1", "author": "C. Rodowsky"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Amazon Fire TV is very very good", "verified": true, "helpfulness": "0/2", "author": "porter williams"}, {"rating": 5.0, "review": "Love love love.  We have used many different competitor similar products and just LOVE the amazon Fire TV.  In addition to the main TV that it's connected to, the transition from TV to kindle is a bonus.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]