[{"rating": 1.0, "review": "of the idiotic G. Busey commercial.  I will never purchase this.  Almost as bad as the talking animals they put on commercials. An insult to intelligent humans.", "verified": false, "helpfulness": "2/53", "author": "sjk"}, {"rating": 5.0, "review": "Wow, Amazon got it right! This device works the best of all of these devices! Setup is so easy - your account info is already in it - all you have to do is put in your wifi password and you are watching TV!What's best about this is that when you click play on a program, it takes only one second for it to start and no buffering like Netflix!Great HD picture quality!And the really coolest feature is the remote, with verbal search. The voice recognition is awesome and the response time of the search is soooo fast!  I tried to stump it by looking for really old movies or tv shows but it found them all in seconds - really cool!I signed up for Amazon Prime and though a lot of movies are free, i was surprised that a lot of the TV episodes - even ones that are really old - like Dick Van Dyke show - are 2 or 3 bucks for each episode!  I would have thought that for $99 a year, they would give you more free episodes.Other than that - it's super cool!Oh and picture quality is very very good.", "verified": true, "helpfulness": "6/6", "author": "AdvancedNovice"}, {"rating": 5.0, "review": "We had a corner of the house were it was weak internet and it works there.  only a few times had it paused.  our old box was horrible.  Content seems awesome... and tons and tons of choices.  I bought because the box seemed the most powerful chip-set etc..", "verified": true, "helpfulness": "2/2", "author": "Hiker \"Hiker\""}, {"rating": 4.0, "review": "one of my chief complaints is with Amazon, I purchased a Smart TV so I can watch my prime on a bigger screen.  I am disappointed in them backing out of the deal with Vizio.  I could have saved hundreds of dollars on the purchase of a tv the defeats my purpose and the apparatus Amazon made to view their prime primarily.", "verified": true, "helpfulness": "2/13", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The voice search is amazing and the whole remote and interface setup is intuitive. I have several other media players and this Fire TV beats them hands down in every way.", "verified": true, "helpfulness": "2/3", "author": "Debra Matchin"}, {"rating": 5.0, "review": "The Amazon Fire is great. Easy to connect and works easily. Unfortunately is was not what I was hoping for, it did not have many of the channels that I wanted for old movies and TV. But in spite of that I strongly recommend the item for people that don't care about the old movies and shows.", "verified": true, "helpfulness": "0/2", "author": "D. Hawkins"}, {"rating": 1.0, "review": "I like it, but there is a serious issue with the organization of the customer owned titles.  They really need to separate TV shows from Movies like they do on the Kindle.  As it is, I have to scroll through around 160 titles to find what I want and that can be real annoying.  I know they want to push the voice search, but half the time the results I get aren't linked to the titles I own and it asks me to buy the title again.Update: 7/31/2014I am having to lower my review a star due to continual software problems with the Amazon Fire TV control box.  I have had to reset it to factory default settings three times now, losing all my information and having to re-register my account because it suddenly develops 'I can't find this title' issues that are only fixed this way.  Which wouldn't be so bad if I didn't have to watch that damned 'New User' help video every time I had to reset it.Update: 10/4/2014I have never had to reset a device to factory settings more in my life than I have had to do with the Amazon FireTV.  It randomly forgets my network and/or won't let me disconnect it from the network to reconnect.  I have had to power cycle it more than I can count and many times not even that will fix the issues with videos not wanting to play.  On top of that IF I HAVE TO BE FORCED TO WATCH THAT DAMNED INTRODUCTION VIDEO ONE MORE TIME I will throw this damned thing off my balcony!  Get rid of the introduction video or allow people to skip it!  Seriously, I am going to switch back to the Roku if this piece of crap doesn't stop screwing up all the time.This is the worst Amazon product I have ever owned.  I have 5 Kindles that don't have any issues at all, but this thing is super flawed.Amazon, get your crap together.", "verified": true, "helpfulness": "3/4", "author": "Shawn Muder"}, {"rating": 5.0, "review": "OK.....you've already read about the flaws and drawbacks pointed out by other reviewers. I won't reiterate here. I'm in the market to cut the cable cord, so after speaking with a colleague who has knowledge of Roku, Apple TV, and this Amazon Fire TV, I purchased this based on his recommendation. I do have a Roku in a spare bedroom, but frankly, I never used it. That being said, I'm new to these devices....Anyway, I love it! It does what I want it to do. I'm an Amazon Prime member and I have Netflix. Currently, I'm trying out a free week of Hulu Plus. I'll most likely continue with that. Today Comcast installed my internet only service. Tomorrow I'll call Verizon to cancel internet and cable. I'm excited to be saving lots of money and to be paying only for services that I use. This was easy to install. There was no stopping and starting and rebooting. It perfectly picks up my wifi connection. The modem router is in the garage. This Amazon Fire TV is upstairs in my bedroom. The picture quality is outstanding. I'm satisfied with my purchase. Perhaps my expectations are lower than all those recent negative reviewers; regardless, I still highly recommend this product.", "verified": true, "helpfulness": "9/9", "author": "Carrie Sperlunto \"Carrie\""}, {"rating": 4.0, "review": "the voice command feature only searches Amazon and NOT other applications such as Netflix!  This is something Amazon should point out.", "verified": true, "helpfulness": "2/4", "author": "Sam Young \"statsman58\""}, {"rating": 5.0, "review": "I don't have cable anymore...a smart tv in my office and a roku 3 in the living room.  Wanted the fire tv for my bedroom where I have my exercise bike.  Could not believe how quicker it was than the roku....and the  voice activation....amazing.  Took about 2 minutes to set up and the sound and clarity is great.  Probably won't replace the roku in my living room so I guess I'll be in great shape as I will always be on the bike..lol", "verified": true, "helpfulness": "2/2", "author": "thebgirl"}]