[{"rating": 4.0, "review": "Every thing fine ordered correct thank you", "verified": true, "helpfulness": "0/0", "author": "richard a saullo"}, {"rating": 5.0, "review": "Great, worked for what I needed it for.", "verified": true, "helpfulness": "0/0", "author": "Aron"}, {"rating": 5.0, "review": "Pretty cool.. Streams off my phone great... streaming off of my laptop is pretty average.", "verified": true, "helpfulness": "0/0", "author": "Scott"}, {"rating": 1.0, "review": "it didn't work after 1 month.", "verified": true, "helpfulness": "0/0", "author": "Bhuvaneswar Pakkerakari \"Bhuvan\""}, {"rating": 1.0, "review": "The Chromecast was perfect, as expected!", "verified": true, "helpfulness": "0/3", "author": "Gabriela Prigue"}, {"rating": 2.0, "review": "Waste of money.", "verified": true, "helpfulness": "0/4", "author": "zz"}, {"rating": 5.0, "review": "absolutely LOVE it.", "verified": true, "helpfulness": "0/0", "author": "david"}, {"rating": 1.0, "review": "I bought this thinking all I had to do was plug it into the TV and download the app and I'd be ready to go. I was wrong. I need to have WiFi installed into my home for it to work. I am already paying 80 bucks a month for the internet on my phone, I don't want to have to pay another 80 bucks just so I can have it on my TV. I just want to stream Netflix from my phone to my TV. Simple as that. I feel I was duped. It doesn't seem like it should be that complicated to make a dongle that streams video from a phone to a TV,  but google managed to do that. I would not recommend this product to anyone. I am very disappointed.", "verified": false, "helpfulness": "0/7", "author": "esc.ctrl"}, {"rating": 5.0, "review": "thank you", "verified": true, "helpfulness": "0/0", "author": "Lana Shakhnazarova"}, {"rating": 5.0, "review": "My wife and I bought two of these and finally said FU to our cable provider. They work wonderfully and you'd be absolutely amazed how much free tv there is online. And I'm not talking about illegal streams or torrents. I'm talking about legit, legal, free content available on network websites. We also use it to stream Netflix and it works flawlessly for that.We save about $90 a month by cutting our cable and we find ourselves watching far less garbage now that we don't channel surf and just settle for whatever is on.", "verified": true, "helpfulness": "1/1", "author": "Dwayne Reviews \"Working to support my Amazon addiction.\""}]