[{"rating": 5.0, "review": "This handles Netflix and YouTube better than my Sony VAIO laptop, I love it. I would recommend this to anyone and you can't beat the price.", "verified": false, "helpfulness": "0/0", "author": "Jeff P Blankenship"}, {"rating": 5.0, "review": "At first I bought my Chromecast as a toy to show off here and there, but as they updated it and as I had more friends swing by the place, I found out how useful it is.First, it's quicker than turning on my ps3 to watch HuluPlus or NetFlix.The big one though is Youtube.  And yeah, everything can do youtube.  But there is a level of convenience here that is outstanding.Friends come by, everyone logs into your wifi on their phones, tablets, even laptops, and we can all share the same queue instantly on youtube. everyone can pause/skip. And suddenly you've accidentally started a youtube party.  It's a lot more convenient than the pairing process that leanback and ps3/360/roku have since your wifi password is fine.Even if a PC or laptop logs into your wifi the youtube website has chromecast options built into it.But anyway, after watching every Epic Rap Battles of History video there is and an assortment of anime music videos 2 of the 5 people who came by my house have already said they're buying a chromecast too.As the owner of a smart-TV, I prefer the chromecast over any of the TVs build in functions. So it can also be thought of as a super easy way to turn any TV in to a smart TV.I did have to plug in the USB power but that wasn't much of an inconvenience.", "verified": true, "helpfulness": "0/0", "author": "Nikodem Leszek Blach \"Nik\""}, {"rating": 3.0, "review": "why can't it cast more, such as watch espn.  I thought it would cast more from the iphone and ipad other than Netflix and such", "verified": true, "helpfulness": "0/0", "author": "Herb Gomez"}, {"rating": 2.0, "review": "Pro'sCheap way to stream HULU / Netflix apps.Con'sYou can't stream from local hard drive.You can ONLY stream from a handful of apps.Bottom line, I wouldn't buy this product right now. Maybe in two years, Google will all ANY media content to be stream.", "verified": true, "helpfulness": "0/0", "author": "T. Grigsby"}, {"rating": 5.0, "review": "This an outstanding device.  Easy to set up.  True plug and play.  It was up and running in 5 min.  I must confess that my needs are simple though.  I watched You tube videos and videos via the Chrome web browser.  Both audio and video were very high quality.  No buffering or any such problems.  I do have fairly high speed internet through my cable company -- that might be the reason behind my good experience.  True HD from You tube, and 720p or more via Chrome.  I did it through both my iPhone (no Chrome on iPhone though) and my laptop.  I am going to buy another one for another TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Infrequent Commentator"}, {"rating": 2.0, "review": "I received my Chromecast. Maybe my expectations were too high, but I'm not impressed with what's offered or what it can do. Apple TV has it beat by a mile. Hopefully there will be enhancements in the future.", "verified": true, "helpfulness": "0/0", "author": "Jay S \"Jay S.\""}, {"rating": 1.0, "review": "I'm sure it's a great device for those that can use it. I was not able to hook it up/be recognized by the latest Netgear router. Had no problems hooking up my other devices, laptops, Roku players, etc. But \"no cigar\" with the Chromecast.", "verified": true, "helpfulness": "3/5", "author": "K. Michelsen"}, {"rating": 5.0, "review": "Love it. Chromecast has made my life so much easier. I just mainly use it with my laptop because the iphone app sucks.At first, the connection was really slow and sometimes the Chromecast would lose its connection completely even with the HDMI cable that came with it. It was quite frustrating because sometimes the audio would get delayed, video would get delayed, dropped connection, etc. it was just unwatchable at time.Before giving up on it, I decided to get a newer wi-fi router (Apple Airport Extreme) and it solved everything. Now it plays super smooth and never loses its connection with my laptop. Best 35 bucks I've ever spent.", "verified": true, "helpfulness": "0/0", "author": "WatermelonSorbet"}, {"rating": 2.0, "review": "I wasted $35 so you don't have too. Out of the box, all this thing does is mirrors youtube videos you are watching on your smartphone. It does not control your TV. The picture makes you believe that you plug it into an HDMI port and you are good to go... wrong.. it needs to be plugged into a power source. If you buy it thinking you will get all kinds of content, \"cut the cord\", you will be extremely disappointed. $35 thrown away.", "verified": true, "helpfulness": "0/9", "author": "Discofuun"}, {"rating": 5.0, "review": "the setting up seems simpe but the audio would not come in for some reason and I reset the smart tv and chrome cast several times and I am an IT guy and I couldn't get it to cast to the TV", "verified": true, "helpfulness": "1/2", "author": "Clifford Schindler"}]