[{"rating": 5.0, "review": "Was waiting for something like this as all the other options either are complex to set up or costly or both.", "verified": true, "helpfulness": "0/0", "author": "SURESH KARRY"}, {"rating": 5.0, "review": "Saying that we enjoy this product is an understatement.  The ease of setup blew us away.  The ease of use makes it our go to streaming device.", "verified": true, "helpfulness": "0/1", "author": "Carlton B. Matthews"}, {"rating": 5.0, "review": "easy peasy set-up. Easy to use. would recommend it in a New York minute. Glad I made this purchase. Thanks", "verified": true, "helpfulness": "0/0", "author": "David Cooper"}, {"rating": 5.0, "review": "If you are a big Google person like me, buy this product!  Easy to set up, easier to use.  I love watching YouTube subscriptions on my flat screen, and watching movies is supper easy. I've been waiting for Google to produce something like this for so long.", "verified": true, "helpfulness": "0/0", "author": "alex villani"}, {"rating": 4.0, "review": "It works most of the time but gets slow when Wi-Fi is overloaded. Also, it does not like when you are multi-tasking by try to work using VPN connection and watch a movie. Hope to see enhancements and more features soon.", "verified": true, "helpfulness": "0/0", "author": "Skywalker"}, {"rating": 3.0, "review": "Hareware is so simple and looks good.But the function of software is poor comparing Apple's.Anyway I expect better software for the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "sang jin shim"}, {"rating": 5.0, "review": "Chrome cast ,I love This gadget! Easy to install and it works really well. Great buy for $35.00 Thanks google!Royson", "verified": true, "helpfulness": "0/0", "author": "Royson Junior Wong"}, {"rating": 3.0, "review": "Not Iphone or Ipad compatable yet.  Supposed to have an app coming, but not yet.  Hope it will be working soon.", "verified": true, "helpfulness": "0/1", "author": "DSB"}, {"rating": 5.0, "review": "I have been using Chromecast for over a month now & extremely satisfied with it.  It's ease of use & Price are the best features of this little devil. I would recommend this to anyone who would like to stream audio/video content on to your HDTV via Wi-Fi. I have heard that Hulu Plus, Pandora Radio , HBO Go, Redbox Instant are soon going to be added. Overall, amazing product by Google. Buy it & I'm sure you will not be disappointed. Cheers :-).", "verified": true, "helpfulness": "0/0", "author": "Sunil R Mutyala"}, {"rating": 5.0, "review": "It's made watching youtube and netflix on our big TV an awesome experience. Picture quality is great. Ease of setup/use unbeatable. Thanks Google!", "verified": true, "helpfulness": "0/0", "author": "Rajat Ahuja"}]