[{"rating": 4.0, "review": "It's called a \"Chrome\"cast, so you MUST install the Google Chrome browser on your computer. It works as described and very easy to install.", "verified": true, "helpfulness": "0/0", "author": "marek@831"}, {"rating": 5.0, "review": "Turn your dumb tv into a smartTV.  But it will be better when it has more apps.  Right now it has Netflix and YouTube.  The cool thing is that once you get a show or movie going, you can pause it right from your phone.  The APP is in the ChromeCast, not your phone, but if they are on the same home network, you can control it.  The Beta cast from Chrome works, but with some delay.  Great for the money especially if you're a Netflix person.", "verified": true, "helpfulness": "0/0", "author": "Sutch"}, {"rating": 5.0, "review": "I was looking something like this, this product is excellent, very small, very fast and works perfect, this can be used outside of the US with the services available (Netflix and Youtube), i definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Guzman Jose Luis"}, {"rating": 5.0, "review": "works perfect-I hope they keep the OMAP chip from TI in it.Installation - was very easy, I highly recommend it", "verified": true, "helpfulness": "0/0", "author": "Grant L. Smith"}, {"rating": 4.0, "review": "I have an apple TV, have used Roku and have just about every streaming option available through TV's and Blue Ray devices. I was interested in this because it seems so simple, and it is. If you happen to be cruising around YouTube and see a video you like you can simply press the cast button and \"Bam\" it's on your TV. This is awesome, and if your using an HDMI control as the input it will take over and automatically change to that HDMI channel. Netflix casting was flawless and worked amazingly well, as is usually the case with Nefflix offerings.Casting from the computer using a browser was actually quite good, and with a stutter here and there it was very manageable. The option have a cast option in Chrome is just convenient, because sometimes you want to share something quickly without having to change inputs, change audio, hook up and HDMI cable and generally waste time. It's just quicker.The only drawback is content, as of now you get Youtube, Netflix, Hulu on a Tablet and Chrome casting on your PC. I think of this as a cheap investment because it does look like the rest of the market is starting to push content to the Chromecast, and I think it will expand rapidly when they get their API's down.Overall a great device, not an apple TV killer but a fast alternative to stream content when you want to rapidly.", "verified": true, "helpfulness": "0/0", "author": "Sean Gately"}, {"rating": 5.0, "review": "Easy set up if you pay attention.  Simple to install, simple to use.  Does everything it says it will.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "JD"}, {"rating": 4.0, "review": "I read about this, and waited for it to be out for a couple of months to see what others were saying about it.  Finally, after it had been out for a couple of months, and I read many reviews, I decided to buy one.  For $35, I felt it would be a decent gamble if it worked, and little lost if it didn't.It arrived when I expected it to, and setup took only about five minutes, with much of the time required to get the device out of the box and physically connect it to my television, and power it up.  As a Netflix subscriber, I wanted a means to watch videos on my television in the bedroom, and this worked great.  It takes only seconds to switch the video from my iphone to the chromcast, and the controls remain on my iphone.  We have also used a tablet running android to play vidoes through this, and that works well also.  Basically, if you can turn on a computer and connect it to a wireless network, you can handle this device.  We have watched many movies with this, and some television shows off of Netflix, and we have had no issues with connectivity with the device during playback.  I have a wireless N router, and highspeed cable broadband (10 - 20 MBS).  Once you start the streaming to the device, you can turn off your device, as the streaming will continue straight from the wifi to the Chromecast Player.I am only giving this four stars, as I feel it should do more, as, right now it is limited to Netflix, Google Play, and a few others that I don't use.  I hope to see the apps to increase in the future, however, this is cheaper than a Roku device, and accomplishes what it says it will do.I expect significant improvements on this device over the next few months, possibly a next generation out within six months.  But, for less than the price of movie tickets for a family of four, and if you need a means of streaming videos to your television set, this is a great device.  And you don't need to be a computer scientist, or build rockets for NASA to set it up.  A television with an HDMI connection, a wireless router that you can connect it to, and a computer, smartphone, or other device to control the device with.", "verified": true, "helpfulness": "0/0", "author": "Philster \"Philster\""}, {"rating": 2.0, "review": "I really thought this was going to do the job for what I needed it for but, it did not. The messages do come and go, they are not consistent with what is playing as an example: watching videos. It starts ok, then goes away and then come back. I have used it once and have not tried it again.", "verified": true, "helpfulness": "0/0", "author": "eac"}, {"rating": 4.0, "review": "Hooked this up to the TV using my Windows laptop to configure it. I needed to move my wireless router closer to the device for it to configure properly. Once I got past this, I was able to stream from my Chrome browser to the Chromecast quite nicely. Setting up our Android tablet to stream to the Chromecast went smoothly, but was disappointed it would not stream from the browser on the tablet. I hear that capability is in the works, and will make this a much more usable device for us once that happens. Our primary use of the device is to stream foreign language television to our big screen. It works well from the laptop for that and a very good deal for the price.", "verified": true, "helpfulness": "0/0", "author": "John Weber"}, {"rating": 5.0, "review": "Have not yet installed it yet. Let the chips fall where they may, I will putt from that point , gladly...", "verified": true, "helpfulness": "0/1", "author": "JoeTw"}]