[{"rating": 5.0, "review": "MUCH BETTER THAN THE APPLE TV THUS FAR. WE SHALL SEE HOW THE BATTLE PLAYES OUT OVER THE NEXT FEW YEARS.", "verified": true, "helpfulness": "0/0", "author": "Shannon Faulk"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "bobw1965"}, {"rating": 5.0, "review": "No more wasting my hard earned money on cable.  Everything I desire to see I am able to see with the use of Amazon Fire TV.  My basic cable/interent was 140.00 a month.  I am now able to watch  Hulu, Sling, Netflix, and Amazon on my TV--less than 25.00", "verified": true, "helpfulness": "0/0", "author": "Renee"}, {"rating": 5.0, "review": "Love it...", "verified": true, "helpfulness": "0/0", "author": "Bella56"}, {"rating": 4.0, "review": "Very good device ,powerful,fast ,only thing you can't root fire tv ,that way you can't use vpn and proxy", "verified": true, "helpfulness": "0/0", "author": "edrees1399"}, {"rating": 4.0, "review": "I have been using Amazon Fire TV for a few days now. So far it does what it promised with a couple of small hiccups.Pros: The device is small, sleek and beautiful. Best part is the remote which does not need a line of sight to be used. Just press the button pointing in any direction and it works. The interface is simple and it works great. I subscribed for Sling TV and it works great on this device. The quality is definitely HD and it has no problem displaying it.Cons: I did not see a button on the remote to power off the device. It does go to the sleep mode, but I do not know if that can be turned off without plugging its power cord out. There is no volume control on the remote. So you have to keep both TV and FireTV remotes with you which is kind of inconvenient. Roku3 provides a audio jack on the remote to attach headphones, but there is no such jack on FireTV's remote.Not used yet: There is a USB port on the device. I am not sure if I can plug in a usb drive to play my videos through this device. There is a microphone on the remote to issue voice commands. I will try these out and will update the review.", "verified": true, "helpfulness": "0/0", "author": "Gagan"}, {"rating": 3.0, "review": "It's ok! Not what I expected", "verified": true, "helpfulness": "0/0", "author": "juan valenzuela"}, {"rating": 5.0, "review": "We love it !!!!!!", "verified": true, "helpfulness": "0/0", "author": "Gloria"}, {"rating": 3.0, "review": "The interface is way to busy. I know it is integrated with Amazon but its overwhelming. I use plex for most everything but the layout isn't great to get to it. This is a Plex thing but they have not updated the app to support multi-users yet. I'm looking forward to Nvidia shield TV or whatever it is called.", "verified": true, "helpfulness": "0/0", "author": "ryan8382"}, {"rating": 5.0, "review": "Easy set up. Works as listed. Apps load fast and run smoothly. This is a must if you are a cord cutter and a amazon prime member. The main page could be a little easier to navigate but I am not totally lost on how to find my apps and it should not be a deterrent on purchasing. I am new cord cutter and sling tv has a deal for a free amazon stick or $50 off amazon tv. This combo has saved me money for my cord cutting lifestyle. I get my sports and my daughter is able to keep up on her cartoons.", "verified": true, "helpfulness": "0/0", "author": "lolo"}]