[{"rating": 5.0, "review": "I purchased two of these devices for my two tv sets at home. You must have a chrome browser installed on the computer you intend to 'cast' the shows/videos/pictures/browser window from -- which isn't a huge requirement.In about fifteen minutes time, I was able to:  - install the device in my living room tv  (plug-in to tv and wall, change tv input to relevant HDMI interface)  - install the device in my bedroom tv (same thing as above)  - downloaded and installed the chromecast extension to my chromebook and got it to discover the devices  - downloaded and installed chrome onto my husband's mac book, also added the chromecast extension and it discovered the devices  - installed chromecast app on my android phoneIt works very well with Netflix (unless you are watching a series, then Nextflix doesn't show the \"cast\" icon, don't know why they chose to do that!)  The nice part about the Nextflix integration is that when you cast a movie from Netflix (as opposed to through the browser), it stops playing in your browser and only plays on the tv.  THat's really nice!!THere are a few other apps/sites integrated with chromecast (like YouTube)  This came in handy when my husband and I wanted to watch some reviews of outdoor equipment for camping together -- it was easier to watch on a large screen and see more detail.I'm sure there are more integrated apps out there, but I haven't yet discovered them all.", "verified": true, "helpfulness": "0/0", "author": "Sarah S \"Sarah\""}, {"rating": 5.0, "review": "I bought one of these, then I bought one for both of my daughter for Christmas, then bought myself another one!  They work great and the addition of additional content makes it even better.  I see many more apps that will be Chromecast compatible in the near future.  Compact, clean operation, turns any TV into a smart TV.  Looking forward to what's next for this little beauty!!!", "verified": true, "helpfulness": "0/0", "author": "D. S. Johnston \"\"The Bargain Hunter\"\""}, {"rating": 5.0, "review": "Bought it for my husband but my teen daughter loved it.  Thinking of buying another one.  I think it's great.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "The Chromecast is a huge hit, specially in countries where services like Hulu and Netflix are available.For the moment, with only YouTube and Chrome tabs to cast, the device feels underpowered. I will be waiting for more apps (specially one that mirrors my tablet screen) that will make this great gadget worth the buy.", "verified": true, "helpfulness": "0/0", "author": "Leo Angora"}, {"rating": 5.0, "review": "We have smart TV's and an XBOX 360. So I was a little hesitant on purchasing the Chromecast however I'll never pay Microsoft to use free apps to view Netflix or Youtube. The smart TV's have decent remotes however the keyboards on the back are very small and not very responsive.That said I purchased the Chromecast to enhance our Youtube experience on the TV. I was blown away by how seamless and easy it is to cast videos from our phones and tablets to the TV. It's actually fun! As a certified cord cutter it opened an infinite amount of content to our TV viewing and keeps getting better with new content and apps being added weekly.Now that Plex was added to Chromecast apps, I'm building a media server with an old PC to cast all of our videos and DVD's to our TV'sThis was easily the best tech purchase I've ever made for the price.", "verified": true, "helpfulness": "0/0", "author": "Virtual Media"}, {"rating": 2.0, "review": "Was hyped by what it was supposed to be able to do.It does practically nothing.I can't project my iPhone photos on tv.I can't project Comcast movies on my TV.Netflix is the only good feature.I had hoped to use it at my cabin and save on my cable bill.", "verified": true, "helpfulness": "0/0", "author": "Robert G Newsom"}, {"rating": 5.0, "review": "Great product!!! It works great from my phone or computer right to my TV. I used every day every week", "verified": true, "helpfulness": "0/0", "author": "Francisco"}, {"rating": 3.0, "review": "The instruction book was inadequate!! We spent hours trying to read, understand, and set up the Chromecast! Please improve!Thank you!! Cheryl Hill", "verified": true, "helpfulness": "0/0", "author": "Cheryl Hill"}, {"rating": 4.0, "review": "This product is awesome. The only down fall is that it does not work with amazon prime or dish on demand.", "verified": true, "helpfulness": "0/0", "author": "Vincent Pontorno"}, {"rating": 1.0, "review": "The google chromecast does not work. I am trying to cast something from my laptop to the tv.  The sound was ok but the picture would not come throught, or would be choppy or would lag with the sound. I tried placing all of the setting to the lowest to help the problem but it did not help. I have two of these things an they both work the same. This is a great idea but I think that more testing must be done with this product. Perhapse in the future updates will become available to help this work correctly.", "verified": true, "helpfulness": "0/0", "author": "JD"}]