[{"rating": 5.0, "review": "just plug and play works with google chrome and my nexus 4(low battery consume). It would be better if you add play local content native support", "verified": true, "helpfulness": "0/0", "author": "Galo Coloma V \"***coolGC****\""}, {"rating": 4.0, "review": "Super easy to set up, even for those not tech savvy. Not as intuitive to use, because you have to have the compatible apps, and they aren't many - YET! Hoping Google adds more. For now, I use this with no problem for YouTube, Pandora and Netflix. It's faster than using the smart TV settings, and faster than going through the PS3.As of this review, you cannot stream from Chrome apps on either iTunes or Androids, only from Chrome on a PC (after downloading an extension program). I'll give it 5 stars when you can stream any video played on Chrome from a mobile device.", "verified": true, "helpfulness": "0/0", "author": "Spiralsalamander"}, {"rating": 5.0, "review": "I have used it for more than 3 months now and it works well. I use it to stream youtube stuff on to my projector. Works seemlessly.", "verified": true, "helpfulness": "0/0", "author": "sri"}, {"rating": 2.0, "review": "This was recommended by my IT friend who believed that one could who it to access any storage on the network. All this thing does is is allow one to drag and drop any video into the chrome browser and have it play on the device that it is plugged into. There appears to be allot of compression going on as well so don't expect your HD collection to look all that great.", "verified": true, "helpfulness": "0/0", "author": "Raymond"}, {"rating": 2.0, "review": "Did not have enough apps to cast from.Need more ability to watch shows from computer to chrome cast such as the apps I have on my IPad.", "verified": true, "helpfulness": "1/1", "author": "V. Franks \"n756tk\""}, {"rating": 4.0, "review": "Super fast shipping by seller. No complaints, except for the device itself. It has a serious delay when not using apps to stream content and from what I read, there is no way around this. I will continue to use it on my small tv in the bedroom but I might it's go out and buy another Roku instead.", "verified": true, "helpfulness": "0/0", "author": "natalie perez"}, {"rating": 5.0, "review": "Great media player! I do recommend it to every tech lover. Watch or listen everything you desire. I hope there will be more apps supporting it soon.", "verified": true, "helpfulness": "0/0", "author": "Peter Bonta"}, {"rating": 4.0, "review": "It was very easy to install following the simple instructions, and works perfectly. I use it to watch HBOgo on my TV instead of the computer.", "verified": true, "helpfulness": "0/0", "author": "Cindy G. Holt"}, {"rating": 5.0, "review": "How is it that everyone doesnt have one of these, I find myself visiting friends and trying to stream my stuff out of force of habit. Could not do without it. Love it.", "verified": true, "helpfulness": "0/0", "author": "Belky Chin"}, {"rating": 4.0, "review": "We are happy with the product overall. Easy to install and use. We just wish we could cast more content from more sources. We cannot figure out how to cast from the Chrome browser, for instance. It would be great if you could cast anything streaming on Chrome. PBS Kids, XFTV, etc.", "verified": true, "helpfulness": "0/0", "author": "todd"}]