[{"rating": 4.0, "review": "It doesn't have the functionality that other streamers have in terms of the variety of supported application but for $35 + tax you get a nice compact device that can play netflix, Google Play (online movie rental/buy service, similar to iTunes), Google Chrome and youtube. The 'cast is also an open platform so they say the final word is far from being said here, and there's a lot more to come.There is no remote or some on screen interface. The device is controlled via mobile devices or pc/laptop using the chromecast mobile app. I have the app on my iphone and Nexus 7 (android). Integration with the devices is OK but can be improved in terms of interface however playback for Netflix and Google Play was flawless for me.Setup is super easy and simple. You basically don't need to type in almost any information other than naming you device (optional but useful if you have more than one). Just plug it in, and let the app on you phone/device set up itself. Note however that the chromcast turns off when not in use so you have to turn on your tv and switch to the chromecast to wake it up so you can set it up (say on another device).I hope this device will support other apps in the future, like Amazon for example. But for now I'm extremely happy for the price I paid.", "verified": false, "helpfulness": "0/0", "author": "Gil S"}, {"rating": 3.0, "review": "I ordered 2 of these and waited a month for them.during that time I considered canceling my order a few times because of the chromecasts limitations. I finally decided that its only $70 so why not keep them, we'll they o work but as of now all I can use them for is YouTube and Netflix. I don't subscribe to Netflix and I rarely use YouTube so they are kind useless to me. I was definitely hoping for the ability to stream from either my computers hard drive or my iPad. So for the 1 time a year I want to view a YouTube video on two of my tvs them in good to go. Otherwise not worth it. Google should have made some more partnerships before releasing this product. Btw I have a smart tv so I can get you tube on it already. Guess I'm the dumb one.", "verified": true, "helpfulness": "0/1", "author": "Christopher Marino"}, {"rating": 2.0, "review": "Seems like this was going to be a great product, but during the Chromecast setup I was told I needed to enable UPnP protocol on my router, yet ...I just read an zdnet article from earlier this year that said that \"the US Department of Homeland Security is urging everyone to disable the common networking Universal Plug and Play (UPnP) protocol. This is being done because Rapid7 security researchers have found that tens of million devices worldwide are wide open to attack because of flaws in the network protocol and its implementations.\" [...]My two smart TVs and my two Roku's do not require the enabling of UPnP. Is there a basic flaw in the Chromecast that it requires us to enable UPnP?Should I enable this on my router and take this chance just to use Chromecast? Could use some advice here.", "verified": false, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Notice I am a verified buyer of this product. I installed in on my Vizio Widescreen TV but can't use it until I get an iOS device.In order to operate the Chromecast you need an HDMI port on your TV (which I have), and either a USB port OR a free electrical outlet for power. Since my TV does not have a USB port I had to find a free electrical outlet in order to plug in a good-sized plug. Three weeks later, I am still looking for a free electrical outlet.I was hoping this would eliminate my need to have my PC connected to my TV, but Chromecast only supports Youtube and Netflix. Amazon, do you hear me? It does not support Prime Instant Videos!When I tried to access Amazon Prime via the browser on my Android Nexus 4, I got a message saying that Amazon Prime is only available for streaming with the Apple iOS. Even if I was able to test it with an iPad, I have doubts that it would be a seamless experience (possible aspect ratio errors).Amazon needs to put out a Prime Instant Video App and learn to play nice with Google in order for the Chromecast to be a blast.", "verified": true, "helpfulness": "0/1", "author": "Tom S."}, {"rating": 4.0, "review": "I was glad to get in on the first day and get this with 2 day shipping from Amazon rather than pay Google $9 to ship it to me. It took a little longer but I did get in on the Netflix 3 month trial which is great. Took only a few minutes to setup and I was off and streaming HD YouTube and Netflix to my 37\" Insignia. Looking forward to Amazon Prime video support in the near future...Amazon, are you reading this?!", "verified": true, "helpfulness": "0/0", "author": "Jordon L"}, {"rating": 1.0, "review": "I bought this thinking that I would finally be able to watch Amazon Instant Video on a big screen. AFTER I bought it, they changed the code and BLOCKED video from \"non-approved\" sources (e.g., Google's own websites like YouTube). So, the things you can use it for are extremely limited -- they are things I can already cast from my Tivo.(Speaking of Tivo, I can BUY or RENT Amazon videos through my Tivo, but I cannot watch content that I have already paid for with my Prime subscription...which is another source of Amazon frustration.)", "verified": true, "helpfulness": "1/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "For those without smart TVs, it's fantastic.  I plugged it into my receiver and was up in minutes.  I have decent wifi and I've never had an issue.  I was finally able to get the Wii out of the livingroom and put it in my daughter's room to watch Netflix.", "verified": true, "helpfulness": "0/0", "author": "basec0m"}, {"rating": 1.0, "review": "Wow, I was excited to see that my Chromecast arrived this morning when the mail came. I was eager to open it up and plug it into my TV and view my Ipad via my TV..  Until.....I found that it is very limited to specific programs and not what is on my screen. I was hoping that it would show whatever I had on my screen so I can do demos of whatever I wanted. Instead I am limited to Youtube and Netflix only... Not very useful in my mind. I am not interested in showing Youtube or Netflix to my employees. I needed to show them what I need to show them and how I want to show them.. Very frustrating.. So no, I cannot recommend this product.  On a positive note.. It does work well for Youtube and Netflix viewing.  I am hoping for an update that will allow me to view my screen on the TV.  I give it a big GRRRRRRRRRRRR Very disapointed....Google Chromecast HDMI Streaming Media Player", "verified": true, "helpfulness": "1/4", "author": "ned522"}, {"rating": 5.0, "review": "please go ahead and get you one before they hike the priceworks like a charm, i loved itget you one now coz the second generation going to more than $35 just my prediction", "verified": true, "helpfulness": "0/0", "author": "massawe"}, {"rating": 4.0, "review": "I've been connecting a 20ft. HDMI cable to my laptop to stream to my TV. What a pain that was. So glad to get rid of the cables all together now. The Chromecast is a great addition. Only reason I didn't give it 5 stars is because it seems to have a bit of issue streaming video from Google Chrome. I tried streaming one of the NFL football games from NBC.Sports.com in the Chrome browser and the video would play for about a second then hang. I imagine things like this will be fixed in the future since the Chromecast is new to the market. They just gotta iron out some of the bugs... Besides that, I love it!", "verified": true, "helpfulness": "0/0", "author": "ws6wes"}]