[{"rating": 4.0, "review": "Easy to use, convenient. Great free movies with prime time. The scenes that show up when paused are beautiful. The voice search is great!", "verified": true, "helpfulness": "0/0", "author": "Sandyhoe"}, {"rating": 5.0, "review": "Great picture, easy to use, and I love the remote voice activation.", "verified": true, "helpfulness": "0/0", "author": "Ronnie Franks"}, {"rating": 1.0, "review": "Tech Support Very Weak. I was given the Fire TV as a gift. Hooked it up. Worked great. I was really starting to enjoy and the it just quit. Now I have my 3rd box and second remote and nothing. The techs obviously have a script and if it's not on the script they don't know what to do. If you get one and it works I think you will enjoy it greatly. But if it doesn't, you may be kinda lost. Amazon has been great about sending a new unit, although I think that is in part because they have so little knowledge about how to debug an issue. They also don't know what the code is from the indicator light on my box. If you get one and it works, fantastic, enjoy. As of now, I'm looking at a refund.", "verified": false, "helpfulness": "2/7", "author": "Gronk"}, {"rating": 5.0, "review": "it is awesome...installation quick and easy...love the movie and TV lineup available.", "verified": true, "helpfulness": "0/0", "author": "CAPN' G"}, {"rating": 5.0, "review": "I love it!  Fairly easy to set up too!", "verified": true, "helpfulness": "0/0", "author": "Hidden"}, {"rating": 5.0, "review": "Made my smart tv look stupid. It is much faster and way better video quality than my smart tv was producing.", "verified": true, "helpfulness": "0/0", "author": "JimK"}, {"rating": 5.0, "review": "Great Item.  My friends intend to buy it.", "verified": true, "helpfulness": "0/0", "author": "Marianne"}, {"rating": 5.0, "review": "S**** awesome. Love it.", "verified": true, "helpfulness": "0/0", "author": "Nicholas Bolton"}, {"rating": 4.0, "review": "Performs very well.  Easy to use.  Voice search is very good, but would have liked it to be able to do voice search across all subscriptions (Prime, Netflix, etc.).  Also, would have liked to be able to limit searches to NO COST items only.  That being said, still very good.", "verified": true, "helpfulness": "1/1", "author": "I. U. Boi \"I. U. Boi\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Diane Felsher"}]