[{"rating": 5.0, "review": "It's great", "verified": true, "helpfulness": "0/1", "author": "Faleh"}, {"rating": 5.0, "review": "Great!!!.", "verified": true, "helpfulness": "0/1", "author": "Pacochido"}, {"rating": 4.0, "review": "Excelente!!!! I was not aware it had to be plugged in...", "verified": true, "helpfulness": "0/0", "author": "dolores"}, {"rating": 4.0, "review": "Mostly love it. Think it's our network that goes wonky. Wish it would cast Amazon Prime Video's.", "verified": true, "helpfulness": "1/1", "author": "Robin Forster"}, {"rating": 5.0, "review": "A must have for any older TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "my other one broke and I couldn't get it replaced from Google or Amazon so I bought another one that's how much I like it", "verified": true, "helpfulness": "0/0", "author": "Brooke"}, {"rating": 5.0, "review": "I love it", "verified": true, "helpfulness": "0/0", "author": "Terrell jones"}, {"rating": 4.0, "review": "Installation was as easy as Google advertises. I plugged the equipment onto the TV. I tested a Chromebook, Galaxy S4 and Windows 8 laptop. I had to install the Chromecast app onto the Chromebook and Windows 8 laptop. The S4 was different.The Galaxy S4 YouTube app already had chrome casting enabled. I was casting Nina Conti on the first try. The Chrome browser on the S4 required installation of the Chromecast app before it was useful.Performance was fine with the Chromebook and the S4. The Windows 8 laptop was choppy, even when I reduced the casted resolution to 480. I don’t blame the Chrome browser or the app. I think the problem was the 6 year old laptop’s aged wireless antenna.", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Hm. The Chromecast by Google. What will I be criticizing today?Introduction: The Google Chromecast is a HDMI/USB dongle that is designed to put your videos, movies and even sometimes games onto the bigf screen.Why I bought it: I bought the Chromecast because I was suffering from a case of lazyness syndrome, and I didn't want to walk all the way over to my PC to watch Twitch.tv.Pros:The Google Chromecast is pretty small.It comes with accessories that are not propriatary.Has a factory reset button incase I ship it back.Cons:Requires USB power, instead of running off the HDMI, if it even produces power.(Don't Hold me on this one) The Google Chromecast is useful, but not very good for killing time.My thoughts: The arrival came as I wanted it to, but I found instantly its not as fun as I thought it would. That doesn't mean I hate it neccisarily, just not as cool as it was shown on the ads.Final Review: In short, the Google Chromecast is worth your money if you enjoy not using a PS or XBOX that can support the simular functions, and do more. This, it the cheap alternative. Thanks google!", "verified": true, "helpfulness": "0/3", "author": "Edward"}, {"rating": 5.0, "review": "My favorite item in the house!", "verified": true, "helpfulness": "0/0", "author": "Frances"}]