[{"rating": 5.0, "review": "Everything is in the description! I love chomecast I just wish they would add spotify to one of the apps. Currently you can only use pandora.", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 4.0, "review": "I didn't think I would have much use for it but with the deal I got it at I figured I would try it anyway. Well it now is our main device in our living room. I love the fact I can control it from my cell phone or laptop. The only thing missing is that it can't stream Hulu Plus (not naively, does stream but lags quite often) or Amazon Prime (cannot stream at all), but that is because of those companies and not the device.", "verified": true, "helpfulness": "1/1", "author": "Andrew Leslie"}, {"rating": 5.0, "review": "I bought this for my parents because they always had to go to their basement to watch Netflix. After a short setup, i was able to hand over their devices (one android, one iPhone, one PC) and show them how to successfully watch Netflix on the television. Short setup and simple to use.Just a side note (not an issue in this situation): I thought this was an android device since it's made by Google. It isn't. If you're looking to install games and Kodi, get one of the amazon products. I personally have the Amazon Fire TV and love it.", "verified": true, "helpfulness": "1/1", "author": "Kyle"}, {"rating": 5.0, "review": "Make sure you register itwith Google when setting it up after that, I'll be up on your tablet and watch movies.", "verified": true, "helpfulness": "0/0", "author": "Paw \"Paw\""}, {"rating": 5.0, "review": "Awesome little piece of technology..I use it mostly for Netflix, but works as well for YouTube, Hulu, and others.", "verified": true, "helpfulness": "0/0", "author": "crazedgrannie"}, {"rating": 5.0, "review": "Very easy to use and set up.. I think it's a great substitute compared to having to pay for a smart tv. I just wish it had a remote.", "verified": true, "helpfulness": "0/0", "author": "Taylor"}, {"rating": 4.0, "review": "Great, except that there is a delay on netflix and the movie will stop and try to upload during the movie.", "verified": true, "helpfulness": "1/1", "author": "Wendy B."}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 5.0, "review": "like Chromecast a ton!!. Works really good and for the price is amazing with Netflix and youtube", "verified": true, "helpfulness": "0/0", "author": "Raymond D Jennings Jr"}, {"rating": 5.0, "review": "I can't say enough about this unit, I use it all the time.  I have owned it since it was released and have purchased them for Friends.  This is the best device for streaming.Easy to useUser friendlyLots of apps for it nowThis plus Plex and I can stream my whole movie collection from my Media Server", "verified": true, "helpfulness": "0/0", "author": "James."}]