[{"rating": 5.0, "review": "Love the item . Now I need to buy another one for my daughter", "verified": true, "helpfulness": "0/0", "author": "reymundo"}, {"rating": 5.0, "review": "Love these little guys... easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "M. Johnson"}, {"rating": 4.0, "review": "Chromecast is a great little device and does as what it's suppose to but not all online flash player videos work outside of Youtube, Netflix, and Hulu.", "verified": true, "helpfulness": "0/0", "author": "RyanR."}, {"rating": 4.0, "review": "This was a gift.", "verified": true, "helpfulness": "0/0", "author": "Danielle Utter"}, {"rating": 3.0, "review": "I was expecting some additional functions. Besides that I found some buggy performance when using Netflix and Youtube.", "verified": true, "helpfulness": "0/0", "author": "Javier Reséndiz"}, {"rating": 2.0, "review": "It's a bit limited in what it can stream.  Youtube - can't get it to work.  Web browsing - nope.  Amazon Prime - nope.  Wish I would have went with a different brand.", "verified": true, "helpfulness": "0/0", "author": "Shane Vincent"}, {"rating": 5.0, "review": "I use it daily and it had been part of my family to cast anything to my TV", "verified": true, "helpfulness": "0/0", "author": "Hitesh Wadikar"}, {"rating": 5.0, "review": "If you want wireless HDMI to your TV this is it. I always had my laptop hooked to the TV bc in the past wireless HD was horrible. Chromecast wouldn't be the best for gaming but awesome for movies or TV shows. So far I have had no problems with video and audio syncing. Chromecast has had no buffering issues with my computer and my wireless, and literally took me 5 minutes to hook up and start a movie on my computer. Theirs no point in getting a smart TV when chromecast made it to easy to stream from any device on the same router.", "verified": true, "helpfulness": "0/1", "author": "Nicholas armstrong"}, {"rating": 1.0, "review": "This is the worst streaming device I have ever used.  It worked great for about a week and then it started really messing up.  I usually only stream netflix for my daughter.  Within a 30 minute show, it will stop to buffer at least three times and will sometimes stop working all together.  Sometimes I can get it to work again, other times I cannot.It is incredibly frustrating and it was a complete waste of money.", "verified": false, "helpfulness": "0/1", "author": "Jessica Rooks"}, {"rating": 5.0, "review": "👍👍👍👍👍", "verified": true, "helpfulness": "0/0", "author": "Kinghkp"}]