[{"rating": 4.0, "review": "Certainly works as advertised, but don't assume it's a replacement for everything.  Need more apps supported and bluetooth support would be nice so you can stream directly to it from a device not on the network (like wifi).", "verified": true, "helpfulness": "0/0", "author": "Jeff B."}, {"rating": 4.0, "review": "Superb quality of youtube, netflix and hulu.Chrome mirroring is working only with computer.if it can mirror an android like apple tv it would become the best", "verified": true, "helpfulness": "0/0", "author": "Uz"}, {"rating": 5.0, "review": "It's great! Works exactly as advertised. It's so easy my 3 year old grandson can pull up Netflix on his Samsung 7 inch tablet and then play it on the tv with the chromecast.", "verified": true, "helpfulness": "0/0", "author": "Darlene Braden"}, {"rating": 5.0, "review": "love love love!!!!!! best producti love this device...a must have. do it, do it, do it!!! i recommend it", "verified": true, "helpfulness": "0/0", "author": "agenius!"}, {"rating": 2.0, "review": "Installation was easy, but as I've read from other reviewers, I've only seen it work well on YouTube videos. The Chrome casting add-on to Chrome is sketchy at best. It seems as if this unit gobbles a lot of wireless bandwidth which, in turn, degrades the video and audio quality of both the PC and the TV as you translate it to the large screen.If you want good quality audio and video going from your laptop or PC to the TV, either pick up an HDMI/VGA/DVI cable and combine it with an audio patch cable, or even better yet, re-purpose an older computer and use that as part of your entertainment system.Good luck to you.", "verified": false, "helpfulness": "1/1", "author": "Mike Lopez"}, {"rating": 2.0, "review": "I think what I don't like about this is that it only works for netflix and YouTube. I think the future for this devise has potential.  I do like how it works on the lap top.  If u r on chrome u can through the whole screen to the tv. But cell phones and tablets is kinda blah.", "verified": true, "helpfulness": "1/1", "author": "Amerz"}, {"rating": 3.0, "review": "Pros :- cheap- smallCons :- no Ethernet, only wifi- limited support  - no Firefox support  - Chrome chromecast extension is weak.. you can only add video, but it ruins if you already had a queue you created via the Android app so you have to wait for the queue to finish. - The android app is OK, but is a bit unintuitive. It has to be cantered around playing queue but is instead is an afterthought .", "verified": true, "helpfulness": "1/1", "author": "me \"me\""}, {"rating": 3.0, "review": "Basically it's a cheaper Roku that you need another device to use with.  I bought this hoping I could use it to view on TV programs that are not available on Roku's Hulu Plus or episodes from TV channels (such as CBS) that don't share their episodes with Roku.No luck.  ChromeCast does have a feature that allows you to cast what is on your browser window to the TV screen, so theoretically I could watch those episodes that way.  But it works so badly it's unwatchable.  It's still in the Beta version, though,, so maybe they'll improve it.  Just like they got around to improving their \"voice recognition\" captioning that has been in beta for years.  Oh, wait, they didn't.", "verified": false, "helpfulness": "1/1", "author": "Brian J. Peters \"BriPet\""}, {"rating": 5.0, "review": "does what is says. looking forward to more updated video sources. but Netflix is all i needed for a dumb tv in the bedroom", "verified": true, "helpfulness": "0/0", "author": "phxkoolguy73 awesome fun"}, {"rating": 5.0, "review": "It what it supposed to do I can't wait for Google to add more apps,overall I'm happy purchasing this product.", "verified": true, "helpfulness": "0/0", "author": "Peter Reyes"}]