[{"rating": 2.0, "review": "The device works great, however, I am disappointed by Amazon Prime.  Website advertises many TV shows, including House of Cards.  After setting the device up (easy) I found that only episode one of season one is available for Amazon Prime.  All other episodes cost money.  The content I have viewed is perfect with no streaming issues wirelessly on my home network. I wish Amazon had been A little clearer about the content that is available and state that it is limited", "verified": true, "helpfulness": "0/2", "author": "Kent Reimers"}, {"rating": 5.0, "review": "It's so simple that my parents can use it!!!!!", "verified": true, "helpfulness": "0/0", "author": "Aries Robillos"}, {"rating": 5.0, "review": "I can't tell you how easy it was to just hook up the box and it was ready to 'rock&roll;'!  Although it can be overwhelming to view what's available I find it easier to search on my desktop and add it to the 'watchlist'. Buying a movie or series is much easier than ordering it and having it shipped then plug it into the DVD player.  I just wish there were more 'Prime' Movies and Series added to the list but I can't complain... the selections are overwhelming!  Other than that AMAZON Fire TV is awesome!", "verified": true, "helpfulness": "0/0", "author": "Doreen"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Kay Ritter"}, {"rating": 5.0, "review": "Works well, easy to install. Enjoy the entertainment.", "verified": true, "helpfulness": "0/0", "author": "Randy Johnson"}, {"rating": 5.0, "review": "Was easy to install, is easy to use.  Has all the shows I want to watch.  I love the parental controls, and the fact that I am able to add shows to my watchlist on the internet, and then watch them on my television.", "verified": true, "helpfulness": "0/0", "author": "Michelle Dumler"}, {"rating": 4.0, "review": "Please update twitch app for 1080p and access to vods", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "I love the Amazon Fire TV, it is easy to install a to use. You have a great selection to choose from.", "verified": true, "helpfulness": "0/0", "author": "Gloria Jatho"}, {"rating": 5.0, "review": "The Fire TV is an excellent product that works as advertised. I would highly recommend the product to anyone in the market for a similar product.", "verified": true, "helpfulness": "0/0", "author": "Ronnie Gamble"}, {"rating": 2.0, "review": "Not very many movies that you don't have to pay for. I thought there would be more. I can get more from on demand.", "verified": true, "helpfulness": "0/3", "author": "Marla Reed"}]