[{"rating": 5.0, "review": "Only drawback is free content vs pay content is sometimes Murky.  Otherwise the device is easy to use ..fast setup and great video quality.", "verified": true, "helpfulness": "1/1", "author": "Garry"}, {"rating": 5.0, "review": "Having gotten used to spending a few hours figuring out how something fits and then a few more on how to make it work....this was a joy. Plugged into HDMI, it found itself and we were off. Nothing to learn nothing to read ...it juts works. Well done Amazon if ly Apple were this good.", "verified": true, "helpfulness": "0/0", "author": "Neil"}, {"rating": 5.0, "review": "This device makes steaming a cinch! After I wrestled with Apple TV which was so frustrating I stopped trying to use it, I was  skeptical about the Amazon Fire. But  it does what  Amazon says it will. After using many, this is the most user friendly tech device I have found!", "verified": true, "helpfulness": "1/1", "author": "teecha"}, {"rating": 3.0, "review": "if you are like us that uses the device also for netflix and hulu plus.  there seem to be problems, Netlix keep reloading every so often sometimes every two or three minutes and Hulu plus the image keep freezing but the sound continues.  If Amazon wants me to continue purchasing their hardware they have to work nice with others.", "verified": true, "helpfulness": "3/3", "author": "Juan Carlos Lopez"}, {"rating": 4.0, "review": "It does need a section only for Amazon Prime and a way to push programs from the Amazon site like I can to my Fire HD.", "verified": true, "helpfulness": "1/1", "author": "frank olvera"}, {"rating": 5.0, "review": "We replaced an old Logitech Revue (GoogleTV) with the Fire TV and love it.  The interface is super fast and haven't run into any issues so far (about 2 months).", "verified": true, "helpfulness": "1/1", "author": "Brett M."}, {"rating": 4.0, "review": "The voice search feature only searches Amazon, does not search within other apps as I expected. For instance, if ou search for something and expect netflix or hulu options to result it only shows amazon videos which are for pay (some even if you have prime).", "verified": true, "helpfulness": "1/2", "author": "Melissa Smith"}, {"rating": 3.0, "review": "It receives WIFI reception pretty good, I have to resubmit password for some prime shows, multiple times before I can view them.", "verified": true, "helpfulness": "1/1", "author": "Bernard C Nelson"}, {"rating": 5.0, "review": "I can't say enough good things about this device. Its the best.1. Super fast - amazing boot time and response time2. Optical out - 5.1 digital surround sound support3. Small, low power, power saving features4. Voice search will change your digital content consumption life5. Small easy to use remote6. Low price - for what you get, its a bargain7. Small sexy set top form factor. Its small, its black, it looks cool, it only has one little LED in the front!!! +++++8. HBO Go integration is a plus, however you do have to pay for the extra content which seems to be a bit pricey. 2.99/episode , YIKES!I do have one complaint, the ShowTime app does not have DirectTV support. So as a DTV subscriber and a ShowTime subscriber, I can't take advantage of the ShowTime now integration. :-(  I suspect this will be fixed in the future though.", "verified": true, "helpfulness": "2/2", "author": "James K."}, {"rating": 5.0, "review": "I love Fire TV so much I canceled my cable. Fire TV is easy to use and offers so much. I pay $7.95 for Netflix a month and $7.95 for Hulu a month, total cost $15.90 a month plus I have Prime Instant Videos and YouTube is free I have numerous videos on YouTube. So I'm saying I was paying $80.00 cable versus $15.90 monthly. Now you know why I love Amazon Fire TV.", "verified": true, "helpfulness": "3/3", "author": "Linda Cornell"}]