[{"rating": 1.0, "review": "despite the best efforts of several friends and family this just did not work. returning it", "verified": true, "helpfulness": "1/5", "author": "Karen Jones \"klj782\""}, {"rating": 3.0, "review": "I am disappointed since I can't watch The Netflix I already have a subscription to.  I don't want to buy \"coins\" to watch Netflix.  Any solutions to offer?????", "verified": true, "helpfulness": "0/2", "author": "Dottie"}, {"rating": 4.0, "review": "We own 2 Fire TV's.  We got one from our children for Christmas so we bought a second for the bedroom tv.  Start up is easy.  Works great!  Just wish there were more free movies that we want to see.  We can not afford to buy or rent many being on a fixed income.", "verified": true, "helpfulness": "0/1", "author": "Jeanne Chavez"}, {"rating": 5.0, "review": "Outstanding", "verified": true, "helpfulness": "1/2", "author": "michael paullin"}, {"rating": 4.0, "review": "This replaced the Roku in our living room. Hopfully over time all the other less used roku units in the house. My only gripe is the lack of volume leveling between applications", "verified": true, "helpfulness": "0/1", "author": "DrewG5"}, {"rating": 5.0, "review": "My hubby watched so much on his kindle, so I bought this for him. Now he can watch on the big tv. I love how we can listen to our music while the pictures scroll through. It has a ton of games but you do need a controller for most of them. We love it!", "verified": true, "helpfulness": "1/2", "author": "Tracey P."}, {"rating": 1.0, "review": "Wifi capability was horrible. Always lost connection.", "verified": true, "helpfulness": "1/3", "author": "wdmcwil"}, {"rating": 2.0, "review": "Beautiful picture, easy to use. Unfortunately does not support an external speaker system. so I took it back and bought Apple TV which desk for the next ternal speaker system", "verified": false, "helpfulness": "0/6", "author": "Christopher Haverty"}, {"rating": 5.0, "review": "We have completely replaced cable. This is the excellent option for our family room tv to watch all our prime shows and amazon streaming content. Add all the other streaming content we were already paying for and the Fire TV brings it all into one east to use gadget.", "verified": true, "helpfulness": "1/2", "author": "Pete Lorah"}, {"rating": 4.0, "review": "Very good but not as many movies as I would like", "verified": true, "helpfulness": "0/1", "author": "Mike Brosnan"}]