[{"rating": 2.0, "review": "I was disappointed that I found a limited selection of supporting applications.  What there is downloads for free, but then charge for every feature you try to use.", "verified": true, "helpfulness": "0/1", "author": "Tim"}, {"rating": 5.0, "review": "This works very well. I like to Cast Leo Laportes shows on his site, twitI have noticed that there is some lip sync issues with some programs.", "verified": true, "helpfulness": "0/0", "author": "Mark B"}, {"rating": 3.0, "review": "This item is ok but not great... Freezes up often and quality can be bad at times... Will not play from google chrome on anything but a laptop... Good thing it is only $35...", "verified": true, "helpfulness": "0/0", "author": "Chet"}, {"rating": 1.0, "review": "I use Apple TV to watch Netflix, mirroring from IPhone, IPad, Mac by connecting to my Home Wifi. I also have a Office WiFi at Home ( via virtual office) which uses 801.1x authentication ( ie it asks for username and password).I bought this so that I can connect it to the family TV and stream for work purpose ( like Web basedTraining, Web Conference etc while relaxing on my sofa. For this I need to connect this to my office Wifi. It doesn't work at all.So, I am left with my Home Wifi. However, the problem is , if I want to stream from my laptop ( i don't see why i should use this with my iphone as I already have the apple TV), it needs Google Chrome OS. There are two issues here.1) If you have a Firewall,you have to allow it or disable it. In my case, my PC firewall is managed by my Office IT. So,I cannot  edit the FW to allow Google Chrome application and hence a problem.2) I  disable the FW on my laptop (which is not safe) and was able to connect it but the connection drops all the time.Further, if you are using this to steam from your phone, there seems to be limited app. So, if you want to watch stuff like PBS app or something , it might not work.In my opinion, this is way behind the Apple TV.  It's worth spending at least 100 bucks on Apple TV  than to break your head on this. I got this today and already requested for a Return. Not worth it.", "verified": true, "helpfulness": "1/3", "author": "customer@amazon"}, {"rating": 5.0, "review": "The PRICE is so reasonable and the product work amazingly well.I wish if it could stream local media form tablet or phone but come for 35$ you can't complain.", "verified": true, "helpfulness": "0/0", "author": "Mahmoud Khater"}, {"rating": 4.0, "review": "Love the ease and multiple uses of this. Now, if it only was compatible with Amazon Prime streaming it would be 5 star perfect!!!!", "verified": true, "helpfulness": "0/0", "author": "T. Potts"}, {"rating": 3.0, "review": "Good foundation to build off of but needs more supporting apps.  Oddly enough... Chromecast can't open Chrome browser and there isn't an app for it in the appsites listed.  Can't believe that Google has let it slide.  Don't believe the reviews that say you can open non-supported or web based videos.  Unless your a computer savy web genius it operates a small group of apps only.", "verified": true, "helpfulness": "0/0", "author": "Robert Christopher Tyus"}, {"rating": 4.0, "review": "I love this little gadget. A breeze to set up and use. It works great to stream media from my tablet, phone, laptop. While at the moment it is a bit limiting on what it can cast too. Hopefully, Google will get more on board to be able to have this feature.", "verified": true, "helpfulness": "0/0", "author": "archboy"}, {"rating": 1.0, "review": "too many glitches . doesn't work with certain routers and difficult with mac osx. got it to work after a lot  of troubleshooting but did not work  on next try.", "verified": true, "helpfulness": "0/2", "author": "DAWN RICHARDSON"}, {"rating": 5.0, "review": "Works perfectly with my iPhone, iPad, and windows7 laptop. Easy setup. Looking forward to more than Netflix and YouTube streaming.", "verified": false, "helpfulness": "0/0", "author": "Jajam"}]