[{"rating": 5.0, "review": "Very happy with this purchase!", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 1.0, "review": "READ THE WARRANTY BEFORE PURCHASINGBuyer beware.  If there is a defect, they will replace the unit with a refurbished device.  Just had to deal with that on a very expensive kindle fire 8.9.  Defective device was replace with a refurbished device.  My initial investment is gone.  So we've cancelled our order for Fire TV.  Not willing to risk purchasing another electronic device with their warranty.", "verified": false, "helpfulness": "2/7", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works fantastic. Side load XBMC for live TV. All the latest streaming crud like Hulu, Netflix, plus games. Plex works great on it. May replace my HTPC.", "verified": true, "helpfulness": "0/0", "author": "Michael J. Kauspedas"}, {"rating": 5.0, "review": "My grandchildren had this connected and working in minutes.", "verified": true, "helpfulness": "0/0", "author": "elaine m"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Greta Warner"}, {"rating": 2.0, "review": "It seems good and all, but the apps are flawed and Amazon won't let you update it.  I tried to exchange for a much-better Roku but I was a day late.  It does work in \"Amazon world\" but if you don't consume Amazon content it's pretty inconvenient.  It's impossible to attach wireless headphones like other Android devices (or like Roku).  The keys are strangely mapped, so that depending on the screen you need to guess which button will take you back, or get you options (the option/menu key?  Nope, you have to hit enter sometimes!)", "verified": true, "helpfulness": "0/5", "author": "pmow"}, {"rating": 4.0, "review": "Very easy to setup and use. I do wish there weren't quite so many choices of apps for a fee to start with. Rather add them as I want them.", "verified": true, "helpfulness": "0/0", "author": "James Hooks"}, {"rating": 5.0, "review": "I love my Amazon Fire TV!!!!! I use it all the time in my house.My son loves it so much he wants one for Christmas but he's stationed in Japan for 2 years and I'm worried it won't work there. I believe he has wifi and already watches Netflix on his laptop so I'm wondering if the Disclaimer about using outside US is just a precaution.", "verified": true, "helpfulness": "0/0", "author": "Tracy Mauler"}, {"rating": 4.0, "review": "Alright. Still using Apple tv", "verified": true, "helpfulness": "0/0", "author": "HENRY CARROW"}, {"rating": 4.0, "review": "I love the idea behind this device.  As a huge Amazon fan and user of their Cloud services (Prime member, Photos and Video storage, Video and Music streaming) I couldn't wait to get this device.  It delivers on performance.  The voice enabled remote works great and is one of the reasons why I bought this device vs the Amazon Stick (This device is more powerful and even though you can upgrade the remote for the Stick, at the time the price difference wasn't much).  All of my content is readily available and movie streaming is quick to start.I knocked off one star because of the music streaming feature.  It works well for the songs I have uploaded, but you CANNOT stream any of the Amazon Prime free songs you may have added to a playlist.  For example, I created a Holiday playlist on my computer, comprising of songs I had uploaded and Free songs I added from Amazon Prime.  They all show up and play fine on my PC, iPhone App, etc. but the free Prime songs don't show up in my playlist on the Fire TV.  I called Amazon support and they told me this feature was not yet supported on the Fire TV and that it will be supported in the future.  They couldn't tell me when.What a bummer!  I wanted to stream music through my home theater over the Holidays (including the Prime songs) but they won't show up.  **One of the neat features of music streaming is it shows the lyrics on the TV screen as the song plays.", "verified": true, "helpfulness": "1/1", "author": "Chris"}]