[{"rating": 5.0, "review": "For years I have been struggling with different versions of Roku boxes (I have three versions) and with the Bravia HDTV built in widgets. My experience with Roku is that they have reliability issues. They continually drop connections and periodically mysteriously hang, also their customer support is all but useless. The Sony Bravia widgets are more convenient than using a seperate Roku box but they also have buffering and hanging issues. Actually the quality of the Sony widgets (Netflix in particular) seems to have deteriorated with the current firmware update. I have switched entirely over to the Google Chromecast controlled from my Ipad. I am totally blown away by the image / sound quality and the total lack of buffering issues. I love this product!", "verified": true, "helpfulness": "0/0", "author": "A. Kenney"}, {"rating": 4.0, "review": "After a little challenge setting up Chromecast seems to be living up to its reputation. I would recommend it to another buyer.", "verified": true, "helpfulness": "0/0", "author": "Mr. Robert S. Mahoney \"stephem\""}, {"rating": 3.0, "review": "I expected to be able to share anything on my phone in the big screen, including a web browser. That's the idea I got from Chromecast's initial marketing. Perhaps I didn't read the fineprint...", "verified": true, "helpfulness": "0/0", "author": "Aruna Abeyakoon"}, {"rating": 4.0, "review": "My daughter loves it.  She is able to stream programs we do not get through our cable.  Works great with Netflix and Amazon.", "verified": true, "helpfulness": "0/0", "author": "Susan Schwartz"}, {"rating": 5.0, "review": "This is my second Chromecast and it works perfect in the same network than the first one. The setup is awesome, doesn't need special or complicated configuration.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "This product is incredibly easy to set up and use. It it the perfect solution for converting an older HDTV into a smart TV. On a side note: I used it in combination with my cell phone to rickroll my wife from across the house while she was watching Twilight. Best Christmas present ever!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We have apple TV with our other television and this is better when it comes to portability and ease of use. We have not had any issues getting the shows that we want to watch. Obviously, it has limitations to what you can watch but we also have an HDMI cable that we link to our laptop in case we want to watch a movie online. Good value!", "verified": true, "helpfulness": "0/0", "author": "H. Guzman"}, {"rating": 2.0, "review": "This was fairly easy to install. Video quality was just fair with my slowsky DSL. But all it does is stream from the Play Store or Netflix if u have it (don't).Would be good for watching You tube on a big screen if u want to do that(don't).i'm a big Pandora fan but I don't need to see it on a big screen. I'm returning this and buying a Roku-1 for an extra 15 dollars will do a LOT more.", "verified": true, "helpfulness": "0/0", "author": "David Walters"}, {"rating": 3.0, "review": "I was excited to receive this product, but it is so limited, I'm so glad I did not sell my PS3.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I liked the idea but it proved finicky especially trying to work it on a WiFi extender (repeater).  Controlling play, pause, or stop after the movie starts was a problem. And, be careful - one hour-and-a-half HD movie used up about 3.2 GB of my 10GB monthly broadband allowance.", "verified": false, "helpfulness": "0/0", "author": "Edgar"}]