[{"rating": 2.0, "review": "Sorry, Amazon, I gave you the benefit of the doubt, and you failed!First, the ONLY reason I purchased this is because the Amazon \"players\" built-in to things like my TiVo and Blu-ray player are completely worthless. Amazon simply refuses to offer the full \"Prime\" experience on 3rd party devices thus forcing (read extortion) someone to pay them more money to buy their streaming player.Fine! I get extorted with other aspects of my life, why think Amazon would be different. So, I bought the Fire TV.Well, viewing Prime video content is the only thing this Fire TV player brings to the table. That's it!Unless you really, really (and I mean really) must watch your Amazon Prime video content, and can't any other way, then pucker up, bend over, and shell out $100.Pros:+ Very small size and weight+ Radio frequency (non-infrared) remote+ Minimal button remote+ Optical audio out (why, is this a plus? because the HDMI audio doesn't work)Cons:- Cost. For the bare minimum this player offers, it should be half the price- Voice search (only option offered) is flaky and doesn't give you long enough time to speak thus requiring multiple presses and attempts.- Netflix player has EXTREME stuttering (buffering) issues making watching nearly impossible- Pandora player doesn't prevent Fire TV from going to sleep! Great, I get all of an hour of music before having to restart- Fire TV required to view Prime video content on TV as most 3rd party Amazon players can not- Screen saver only allows 5, 10 or 15 minute time-to-start values- Cannot configure when the device goes to sleep- HDMI audio doesn't work when viewing through Netflix or Pandora apps. Had to resort to using only other option of Optical audio out port- No 3.5 mm audio out connector- No way to rate videos before, during or after playing- Can only resume watching a video, cannot restart from beginning- Browsing for content is very slow and doesn't show you everything available because the default view is a SINGLE row of icons that you scroll left-to-right. Where's the full screen grid format?!?I'm sure there's more I will come to dislike about this Fire TV, but I've only had it for about three weeks. Give me some more time!UPDATE: Please read the comments section of this review where I go into detail about the useless 3rd party Amazon player.", "verified": true, "helpfulness": "3/9", "author": "surfingump"}, {"rating": 2.0, "review": "I purchased this device to replace my Apple TV. The device at first was excellent, it had easy setup, a fast quad-core processor and an excellent interface. As I started to use the device I noticed some oddities, Voice Search only works with the Amazon side of it, you can not use voice search for Netflix or any of the other apps outside of launching it. After using the device for an even longer period of time I noticed that items were not as easy to find as on other devices. And lastly, the apps that are downloaded to the device are old versions, one thing I like about my Apple TV is that everything is always up to date. This is a nice device, and I am sure many will like it, I am just not one of the many.", "verified": true, "helpfulness": "2/4", "author": "N.V.S."}, {"rating": 5.0, "review": "I'm new to the streaming video, but this setup is easy to use and the selection from prime is varied and extensive.  A good buy.", "verified": true, "helpfulness": "0/0", "author": "Jess F."}, {"rating": 2.0, "review": "So my wife ordered the Fire TV for me as a gift, I had talked about ordering one but wasn't sure so she thought it'd be a nice gift. I was happy when I got it, it feels heavy, solid, very well built so no complaints there. I also have an Apple TV, a PS3, and an Xbox I use for streaming videos as well as my pc and my mac. The Fire TV is the worst offender when it comes to freezing and loading endlessly. Now I could go into the technical aspects and I'm sure some of you will rip my review because I'm not going to bother with specs. My wife and I are both techs and I don't care to throw around big words to try and impress anyone I like to keep it simple. Netflix plays just fine with zero issues on every other device except the Fire TV. Hulu streams just fine on every other device except the Fire TV. The Fire TV freezes and loads constantly makes zero difference if it is hardwired or wireless. Fire TV drops the connection when every other device has no issues connecting. I have tried it with a low load on the wireless (disconnected almost every other device) still no difference in performance. Very disappointing attempt from Amazon in my humble opinion. Not sure if they plan on updates to try and fix the issues but they really should.", "verified": true, "helpfulness": "2/4", "author": "Russ Elliott"}, {"rating": 4.0, "review": "I have the Roku as well.  I hoped this nice box with it's fast processor would control for the latency/variable speed problems I have with streaming video on my Hughes Satellite ISP.  No such luck.  Whatever the reason, I have the same constant buffering I have the Roku.  Item returned with no hassle from Amazon, of course.", "verified": true, "helpfulness": "0/0", "author": "Dr. Neuroprocto"}, {"rating": 5.0, "review": "This is one of many devices I have including, Apple TV, TiVo, western digital - there is overlapping content.  The Amazon TV gives me access to my prime a/c movies", "verified": true, "helpfulness": "0/0", "author": "Bruce J. Wong"}, {"rating": 5.0, "review": "I am amazed at this great addition to my electronic devices. It really provides the opportunity to enjoy movies as well as TV shows, and games.", "verified": true, "helpfulness": "0/0", "author": "Sbrunson \"sem\""}, {"rating": 2.0, "review": "I was selected to try Amazon Fire TV for a 30 Day home trial with option to buyI have decided after using it for 3 weeks, not to buy, and here is why...The streaming from Amazon Fire TV (and Amazon Instant Video in general) is very inconsistent.Sometimes I would watch a movie, quality would be HD, and it streamed fine from beginning to end, but that was rare.Most often I would start watching a movie, and video quality would degrade as it played.  Then it would stop, buffer, sometimes start up again, but more often than not it would stop and I would get an error saying my signal strength was too low for Amazon to continue playback of my video.My Internet and Wi-Fi signal consistently show Excellent Signal Strength with occasional Very Good if a number of devices are streaming at once...but other than occasional buffering issues with Apple TV (Single core/512MB) no other device or streaming service has ever just downright stopped saying my signal strength wasn't good enough, forcing me to start again and keep my fingers crossed.A little background, I have owned or currently own Apple TV 2nd Generation, Apple TV 3rd Generation, ROKU 3, Google Chromecast, and a Samsung Smart TV with dedicated apps for Amazon Instant Video and Netflix buttons on the remote.Apple TV is outdated and forces use of only iTunes store.  It is sluggish to purchase and start-up videos/movies and sometimes will pause for several minutes to buffer, but has never totally dropped me out of a video.Samsung Smart TV relies on apps to connect to various streaming services most notably Netflix and Amazon Instant Video.  Netflix is consistently reliable on it, as is crackle, YouTube, Pandora and more.The Amazon Instant Video app on my Samsung Smart TV is usually consistent, but does suffer from intermittent streaming issues particularly pausing and buffering or transitioning from a high quality picture to something that looks like an old movie.Chromecast is limited to what you watch and control on your tablet or phone as it does not have a dedicated remote.  Picture quality is amazingly consistently good however.  I use this mainly to watch YouTube videos when I am at home instead of watching them on my tablet I can watch them on my Smart TV.ROKU 3 is the star of the bunch with more channels than all the others combined, plus new ones added every day.  The interface is clean and it allows you to search from the main screen and view results that show your options for viewing/purchasing from various channels. For $99 (and often cheaper) it is the best option available today for streaming without getting tied down to a specific content store like Amazon or Apple. It also allows memory expansion through a micro-SD card.  You can also get the AMAZON Instant Video store to stream from an app on the Roku!Fire TV did some things right.  I like its remote control better than Apple's and Roku's.  The Voice Search, although copied from Samsung's Smart TVs, is mostly accurate once you remember to hold the button down while you speak, and the Fire TV square box, like the Roku, can be hidden from site when you use the remote.Unless you are totally and fully invested in putting more money in Jeff Bezo's pocket through the purchase of mostly Amazon content,Roku 3 is probably a better choice if you want a streaming player...or if your TV is on the fritz and you'd like to do away with an add-on box, Samsung Smart TVs offer a lot of built-in choices without the additional hardware.As far as APPS, I did not really try out APPS on the Fire TV as most require the additional purchase of a game controller.Roku 3 and Samsung Smart TV also have built in Apps or Apps that can be purchased and can be played with the same remote that controls the unit.", "verified": true, "helpfulness": "3/4", "author": "RJ2"}, {"rating": 4.0, "review": "Love this.  I own a Roku  3 .  It was always freezing up.  I upgraded my internet speed and that did not fix the problem.Since owning this I have had no problems.  Easy set up.  Only reason I didn't rate it five stars is because it does not have vudu.  I love vudu and I wish Amazon would add this app.", "verified": true, "helpfulness": "0/0", "author": "L Shipps"}, {"rating": 4.0, "review": "I am a big fan of Amazon and I must say, this is good stuff!!!!  Obviously, being a prime member is key and although it does connect with Netflix and such-I really chose it for the prime stuff.  My only complaint would be that something you can get with prime one day does not mean it stays like that.  I assume that different contracts stop and start so don't be surprised if what you thought you could get for free will stay that way.  No way to tell when it changes either.  At least on Netflix it will tell you when something is about to become unavailable.Other than that-cannot say enough good.", "verified": true, "helpfulness": "0/0", "author": "Tiny Dancer"}]