[{"rating": 1.0, "review": "The device failed to work after a firmware update. It could not be factory reset nor can be be rebooted. Most disappointing buy.", "verified": true, "helpfulness": "1/1", "author": "CKE"}, {"rating": 4.0, "review": "If you are trying to go ZERO TV, this thing is the best.What should be in the box:1. Chromecast HDMI device2. HDMI device3. USB power cube4. USB cablePros: Works with any PC, Apple, Iphone, Droid phone. Mirrors tabs from Chrome on PCs. Easy install. Inexpensive. Full 1080p. Support Netflix, Hula+, Google play, Goodle Movies, Pandora, Youtube. Play movies from a tab that you have downloaded on your PC.Cons: Not all video codecs are supported in Chrome Yet. Volume control is on the TV not the mobile device. Can not mirror a tab in Chrome on a mobile device, yet. No remote control like Apple TV, WD, Roku, ETC. Must be powered up via USB port on TV or power adapter included.", "verified": false, "helpfulness": "0/0", "author": "Stacy Johnson"}, {"rating": 5.0, "review": "I really think this is a nice and easy to hook up and use product created by Google. If google made it you know it is going to be user friendly and only require pushing 1-2 buttons to make it work flawlessly. Great product and CHEAP! Don't waste money on other expensive things very similar to this. For now, as of 2014, this technology is great - continue to wait and save up for that one can't miss product while using these user friendly cheap gadgets along the way to keep you 'in the know'.", "verified": true, "helpfulness": "0/0", "author": "Mike Christy"}, {"rating": 5.0, "review": "LOVE! LOVE! LOVE! CHROMECAST! This is a really cool, easy to use product. Of course, like any new technology, there are some minor bugs to work out, but if you like Netflix like I do it won't matter. I highly recommend Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Alice"}, {"rating": 5.0, "review": "Not bad for $30-35. I'd wait because sometimes Amazon has it for $30. I love how I can just browse the internet and put it on my tv or watch videos and put it on there. However besides google tracking basically everything you search to what you click on...I like how I can just control what I want to watch from my laptop or mobile device. Its so much easier than using Roku or a gaming console because its like using you're remote. I recommend this because you can use Hulu Plus, Netflix, Youtube. However I wish I could be watching or streaming other things other than just using chrome.", "verified": true, "helpfulness": "0/0", "author": "Khong Lor"}, {"rating": 4.0, "review": "Does everything you want it to. Very user friendly, just load the so you want to use up on your phone and cast it. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Christopher White"}, {"rating": 5.0, "review": "Cost versus return, this is the best device I have purchased in years. It's incredibly functional and is a pleasure to use.", "verified": true, "helpfulness": "0/0", "author": "M"}, {"rating": 4.0, "review": "I WISH I COULD CAST MORE. Easy to use. The product design is simple and the price makes you think it will not be all that. In the end I love the product. I wish more services worked with it. I am not a player but I cast a lot!", "verified": true, "helpfulness": "0/0", "author": "J. Genet"}, {"rating": 5.0, "review": "Great product! I love how I can view my computer on my t.v. now thanks to Google Chromecast! It is a great value.", "verified": true, "helpfulness": "0/0", "author": "Brian Anderson"}, {"rating": 4.0, "review": "In my short experience with this device, I was able to watch movies/shows from Youtube, Netflix, Hulu Plus, and Rabbit TV quite seamlessly. It's not for games, it's for video-watching. If I worked for the cable companies, I would be very afraid. One night, after recording Grimm on our Comcast DVR, it wouldn't play. It kept hanging up when we tried to play it.I brought the show up on Hulu Plus, and was watching it in minutes. I really believe that if your a bust person that watched TV when you want, the combination of Netflix/Hulu Plus/Rabbit TV/Chromecast will keep you happy in couch potato mode for as long as you like.Of course, you need good Wi-Fi :-)", "verified": true, "helpfulness": "0/0", "author": "well-read and still learning"}]