[{"rating": 5.0, "review": "I bought one not knowing you had to have the internet (which I don't have) to stream my home videos from my phone to the TV.  So I have not been able to use it and am disappointed for that reason.  However, I bought it because a friend had one and I loved what he could do with it.", "verified": true, "helpfulness": "1/1", "author": "D.hen"}, {"rating": 1.0, "review": "first it works, but I have to spend tons of time to reconnect it with cell phone or laptop everytime when I use it. I am IT personal, I hate it reset it every time. For me, this is not very friendly product.", "verified": true, "helpfulness": "0/1", "author": "Tao Shu"}, {"rating": 2.0, "review": "I like the ability to stream content to any tv, however there are a couple of issues with this device, the most annoying being that it can't ever seem to be found by my devices. My iPhone can't find it, my PC's can't find it. I tried using the HDMI extender to no avail. I'll keep debugging and update my review if I find out what the issue was, but right now it makes it difficult to use when it can't be found.", "verified": true, "helpfulness": "0/0", "author": "flamebaud"}, {"rating": 1.0, "review": "Just a fyi, I bought this and this does not work with amazon prime. Works good on other applications, but I have prime and it would have been nice to know that it does not work.", "verified": false, "helpfulness": "0/1", "author": "Coach Soup"}, {"rating": 5.0, "review": "Product easy to install and easy to configure. Works as advertised on the manufacturer's website. The You Tube and Netflix funcinaram perfectly!!", "verified": true, "helpfulness": "0/0", "author": "Geraldo José Grimaldi Ciluzzo"}, {"rating": 5.0, "review": "As you've probably heard, this little plug and play device is amazing. It's great for  applications like Netflix and can be powered by your TVs USB ports to save precious plugs.Chrome tab streaming  is probably it's best feature but it's also the most glitchy as of now. This is likely to change as developers get their apps to optimize with it.", "verified": true, "helpfulness": "0/0", "author": "Vik Prasad"}, {"rating": 5.0, "review": "The device works as advertised and is a snap to install. We have a Roku box, but the Chrimecast allows us to stream Netflix on our second TV.  I would expect that eventually other channels, e.g. Amazon, might be available.", "verified": true, "helpfulness": "0/0", "author": "jfb"}, {"rating": 5.0, "review": "I love this thing.  If you plan on having a party of any sort you need this.  VERY simple installation with easy to read instructions.  The ability to sync Pandora and YouTube from your phone to the big screen is awesome.  No more, \"hey did you see this YouTube video?\" and crowding around a tiny phone screen.  Just sync it immediately to the TV.  Plus Google announced they will be adding many more compatible apps.  Best thing of all is the price!  You can't beat it", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "This little hdmi is easy to set up, and it has some of the best streaming apps. The fact that it is small, and does not require a remote is a plus! You can operate this little gadget from your smart phone(even volume). Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Deuce 2222"}, {"rating": 5.0, "review": "great inexpensive product works like a charm.  I recommend to all that want to watch HD programming on their TVs that are not smart TVs", "verified": true, "helpfulness": "0/0", "author": "Martin D Kidder"}]