[{"rating": 3.0, "review": "Had a bedframe that was way too short, these were the cost effective alternative. They raised the bed but could be a little smaller footprint wise", "verified": true, "helpfulness": "0/7", "author": "Joan Duclow"}, {"rating": 5.0, "review": "I am a Amazon Prime member and the Fire TV was preset to my account. When I received the Fire TV it was as simple as plugging in the power and hooking up the HDMI cable to my TV. The Fire TV then searches for a Wifi connection. I entered my Wifi  password and started watching movies.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 4.0, "review": "The only thing I don't like about it is you can't add apps to it. I haven't found a way to do it, and the support pages take one in circles. The voice search and purchasing videos works fine.", "verified": true, "helpfulness": "0/0", "author": "J. Graves"}, {"rating": 5.0, "review": "I really do love the Amazon Fire TV.  It was so easy to hook up.  I normally have trouble with any electronics, but this one was a breeze.  It has worked very well.  So far I have only caught up on Downtown Abbey, but hope to watch a movie this weekend.I love old movies and thought that most of them would be free or at least free with Prime.  I'm a little disappointed in the fact that so many of them must be bought or rented.  I haven't looked at nearly all of them, but I did pull up some Cary Grant movies and even the least well known are not free.Over all I am very pleased with this purchase and look forward to more \"free\" choices.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I'm giving this 3 stars for now... Easy set up. We used to use our ipad for all of our streaming but someone would always knock the cord loose or we would have to put it far away near the tv. So having this with a remote is nice. However, there is no CNN app which is disappointing. And for some reason the Hulu app seems to have freezing/pausing problems. I'm fairly sure it's the app & not the Fire TV itself because I don't have any problems with Netflix. So the verdict is still out for me. First world problems right?!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Best gadget yet for watching Amazon Prime!  Voice control work just fine.  Only wish it had more real time sports coverage.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "Easy to set up in less than five minutes. Very fast switching and downloading. Best feature for me is voice search. That feature opens new worlds because it saves so much time searching for things you would not have before. I use it with my Samsung Smart TV. It is smarter and faster. Also, much easier to use than my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "lmschairman"}, {"rating": 5.0, "review": "We definitely do not miss cable, we will never go back . We absolutely just love our fire TV (so far) . It's everything we hope for and more plus we know the price is cheap and will never go up. No more hassles with customer service. Highly recommend to everybody who wants to get out from under the corporate thumb.", "verified": true, "helpfulness": "0/0", "author": "bob sobczak"}, {"rating": 5.0, "review": "I cancelled cable last month.  I rarely have time to watch TV, and whenever I actually did what usually happened is that I would spend the time flipping through channels looking for something to watch.  Then Fire TV came along.  Now TV is enjoyable again.  When I want to watch something, it is easy to pull up my favorite TV shows.  Love it!", "verified": true, "helpfulness": "0/0", "author": "AggiePats"}, {"rating": 2.0, "review": "Doesnt read external drive or usb flash drives.  Cant stream contents from pc or video game console.  Very disappointed with this.", "verified": true, "helpfulness": "3/6", "author": "jennifer"}]