[{"rating": 5.0, "review": "I cannot say enough about this device. I was more than fascinated. I've only explored a fraction of its offerings. Small, powerful with 2Tb of RAM. Movies and TV are exceptionally clearer than anything I've seen. My neighbor was freaking over its speed and clarity.PROS:► Easy installation. It really is \"Plug N Play\"► Speech recognition on the remote is crazy. It doesn't need to learn. You just speak. It works great.► Choose a movie or TV series and suggestions pop-up at the bottom of the screen. Great idea,► Very good selection of movies and series. Some week I'll have to sit down and investigate it all.► No DISH Hopper to so that I don't miss two TV series I enjoy + save $$. Amazon Fire TV handled that.►Built-in screen saver. Just absolutely amazing and beautiful. It's almost a production by itself.► Probably doesn't need the extra warranty since the unit is so inexpensive... bought it anyway.CONS:► Wasn't really sure how to access YouTube. A bit vague.► A few times the lips did not sync with voices. I probably did not stop a show correctly and jacked my RAM. Easy enough to fix by unplugging the power then plugging back in. No big deal and it only happened a couple of times.SUGGESTIONS TO AMAZON► Add a Screen Saver series with music to your line-up.► Improve the firmware but I suppose you're on top of that.", "verified": true, "helpfulness": "2/2", "author": "C. Taylor"}, {"rating": 1.0, "review": "In the past week prime and netflix have pretty much stopped working I get an error that says the video is not working. If I click on the video about 20 times it will finally work. This is garbage compared to a roku.", "verified": true, "helpfulness": "4/5", "author": "Zack"}, {"rating": 5.0, "review": "love, love, love it from the sleekness of the remote to the size of the box. Does stop to stream from time to time but it is no where near the headaches of Netflix, in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Val Watkins"}, {"rating": 5.0, "review": "Very nice device. Extremely easy user interface, and the device itself is so small. I love this thing.", "verified": true, "helpfulness": "0/0", "author": "Robert"}, {"rating": 5.0, "review": "Waaaayyy netter than Roku. Roku likes to talk about it's 1000 channels, but who really uses those channels? No one. This is very fast and just works. All of the time.", "verified": true, "helpfulness": "0/4", "author": "EOD7"}, {"rating": 5.0, "review": "Fantastic little box.  I have been a Roku customer for a number of years, but this box takes streaming the internet to another level. I love the content on the Fire Box. I am also a Prime customer, so I feel that I really get to use my membership to the fullest. I love the HBO TV series on Prime also!!! i can watch them for free.  The Roku has 1,000 apps but I find only about 10 that I am interested in. With the Fire Box, I love all the content. Please get an app for DramaFever (Korean TV dramas). My only other criticism is I wish there was a way to separate my gaming apps from the other apps that I installed and used. Currently they are all under the same heading. Other than that, I look forward to the new content that you will be providing for the Fire Box users. I have told a number of my friends about the Fire Box.  They are also Roku owners but I know the content here is more to what they would be looking for. I do not have any cable or satellite service. I strictly use the Fire Box and the Amazon Basic Extreme antenna for all my television needs. With the Basic Extreme antenna, I pick up 23 local channels free.  What I love is the fact that I have better content that what is shown on television and no commercials to boot.  Don't be afraid to dump your expensive cable or satellite service and go with the Fire Box and the Amazon Basic Extreme antenna. You can't go wrong.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Christian Blogger\""}, {"rating": 5.0, "review": "Excellent product. Works as advertised. Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Rob Watkins \"Rob W.\""}, {"rating": 5.0, "review": "This is outstanding. I can now watch movies and TV programs better. I don't use cable, only antenna, and this works wonders. Everyone that only uses an antenna, or even want to save on cable, should get one.", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 4.0, "review": "I like it better than the Roku we had, but...the HBOGo thing is far more annoying than I had anticipated!  Definitely will be 5 stars once that is added", "verified": true, "helpfulness": "0/0", "author": "mzaleski"}, {"rating": 5.0, "review": "Absolutely love this so much I am purchasing a second for my mother that lives with me.  Now she can watch all the Star Trek and CSI she can handle!", "verified": true, "helpfulness": "0/0", "author": "Margie"}]