[{"rating": 2.0, "review": "Caused some conflicts with our wifi connectivity on other devices in our home.", "verified": true, "helpfulness": "0/0", "author": "Phil in Reston"}, {"rating": 4.0, "review": "Pretty great idea in concept, but unfortunately did not fit my needs.  I was looking for something that I could use to stream content from my web browser to the TV. While it would have been pretty great for mostly-static pages, it fell short when I tried to use it to stream non-Youtube videos.  The Chromecast App for Chrome also tended to crash fairly often, though I would imagine that was just a symptom of using Linux as my primary OS.After a month or so of tinkering when I realized that this did not fit my use case, I gave this to my girlfriend as she always used her laptop to watch Netflix videos.  She really enjoys being able to watch shows and movies on a TV screen which is larger than her laptop.Overall, I prefer the Western Digital TV live since i can use it to play local media from my computers in addition to Netflix, youtube, MLB, etc for about the same price (refurbed) as the Chromecast.  The Chromecast does have the advantage of screen casting, which would have made me love it how it worked properly.  It may just need some additional software updates, so I will eventually revisit it.", "verified": true, "helpfulness": "0/0", "author": "Kevin Lesher"}, {"rating": 4.0, "review": "I like this product especially for the money.  I've had it pause once taking about five minutes to recoup. But other than that great product.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "Great little device. It is easy to connect, and since I already have google and netfix accounts it is just an extension of my internet movie watching experience. We also have a Roku that we use, so one can be used in one room while the other can be used in a different room.", "verified": true, "helpfulness": "0/0", "author": "Mel46 \"RetiredGeek\""}, {"rating": 4.0, "review": "Smoothly interaction between TV and PC internet explorer(I use Google chrome) One factor to take in mind is your Internet provider speed because sometimes it is a little slow.", "verified": false, "helpfulness": "0/0", "author": "Javier"}, {"rating": 5.0, "review": "and so should you!", "verified": true, "helpfulness": "0/0", "author": "TheDudeFromOther"}, {"rating": 2.0, "review": "Not many uses, buy Apple TV!", "verified": true, "helpfulness": "0/1", "author": "Dr. Forrest Meiling"}, {"rating": 3.0, "review": "I've been using my chromecast for about a month now, and while I was very happy with it when it was new, my impression of it has slowly fallen.  The chromecast device itself seems to be fine, though streaming choices are fairly limited, especially when compared to the Roku.  The big weakness is that you really depend on 3 different parts working together smoothly--the chromecast device, the remote device (phone or table or laptop), and the app installed on your remote device.  I found I could easily set up the chromecast you my Apple laptop, but I could never get the setup to work using my Android phone or tablet.  I also had troubles with apps--the WatchESPN app kept crashing on my Android phone (running latest version, 4.4, Kit Kat) and on my tablet running an earlier Android version.  On my Apple tablet all was fine.I would attribute all this to growing pain and that the chromecast is still a fairly new device.  I hope these bugs get worked out as more apps adopt the casting feature.  Hopefully, there will be more choices of services, too.", "verified": true, "helpfulness": "0/0", "author": "Rocky Shopper"}, {"rating": 5.0, "review": "Does what it is supposed to! Now I can stream almost every website!", "verified": false, "helpfulness": "0/0", "author": "PuntaCana Mike"}, {"rating": 5.0, "review": "awesome being able to stream internet videos to the big screen. now can watch movies, shows, etc.  remarkably- wouldn't stream movies or shows from Amazon website.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]