[{"rating": 5.0, "review": "this is a flawless streaming device.  I'm super pleased with it but unfortunately does not support movie players such as VLC, WMP, etcetc.. otherwise, I use it on certain icefilms streams, netflix, youtube, and cosmosdocumentaries.", "verified": true, "helpfulness": "0/2", "author": "Chris"}, {"rating": 5.0, "review": "This is exactly what streaming tv should be.  Finally Google got it right -- simply connect this dongle to your TV or AV Unit (use the included extender if you dont have room), connect it to a plug (or if your tv/av has a usb port that works too) and you have a powerful streaming tool.Google is hard at work including streamcasting to various apps -- it already has most of the big names covered (google music, hulu, netflix, hbogo, plex, and youtube) as well as multiple others.  Soon this tool will also support direct streaming from android phones (as found in the API).  Technically there is no stopping what this tool can do and it takes up less room than an apple tv, roku, or other media streamer.Drawbacks?Of course there are -- 1) it doesnt let you stream (currently) from chrome on your phone -- only from your computer.  2) XBMC can not be loaded to the dongle, although this may change when android phone streaming is opened up  then you can stream directly from your supported handset.  3) not enough apps -- definitely needs to be supported more widely -- but I am sure this will happen in the future.All in all its a great product and you can not beat the price", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This small inexpensive little thing, took my $200 TV and made it into one of those high end \"smart\" TV's. My wife and I love it. The best $35 I have ever spent!!", "verified": true, "helpfulness": "0/0", "author": "S. Capps"}, {"rating": 5.0, "review": "Clear up my RCA streamer  and an extra remote out of the way, it does what I expected to do.", "verified": true, "helpfulness": "0/0", "author": "Frank Chavez"}, {"rating": 5.0, "review": "Does exactly what we need, streams Hulu, Netflix, Google Play Movies & TV, Google Play Music, HBO Go, and now more and more apps are becoming available.  It will only get better!!!", "verified": false, "helpfulness": "0/0", "author": "JSet"}, {"rating": 5.0, "review": "I got this product on a cool deal and as soon as i got it i showed it to everybody, now all my friends are ordering one.  ahahahah", "verified": true, "helpfulness": "0/0", "author": "Rodolfo Maldonado Castillo"}, {"rating": 5.0, "review": "Works great.  Resolution is good but not great.  Transmits video and sound.  I put it in my man cave where I don't have a primary HD box.  Perfect for watching stuff from your browser.  Like catching up on TV sequels from Xfinity or watching the National Geographic channel or CNN.  I watch U-tube stuff too.  At first it does some updates but then settles in.  I bought it at 38.  Price is down to 35.  Break through technology.", "verified": true, "helpfulness": "0/0", "author": "David G"}, {"rating": 2.0, "review": "Cute idea, but I can't get it to work with my Netgear router.  Maybe if I spend a few more hours trying to trouble shoot, but for now, it's useless.", "verified": true, "helpfulness": "1/2", "author": "catawbatim"}, {"rating": 5.0, "review": "WAY too easy to set up!!!  AWESOMELimited options for iPad users right now.  But that may change with future updates, or Apps?Over all,..... I love it", "verified": true, "helpfulness": "1/1", "author": "Sherpa"}, {"rating": 5.0, "review": "One of the best purchases I have ever made from Amazon. A perfect companion to my new TV.  Look forward to Google continuing to roll out additional supported apps.  But at only $35, this device has already paid for itself.", "verified": true, "helpfulness": "1/1", "author": "Taylor Ricks"}]