[{"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "layne"}, {"rating": 4.0, "review": "The Google Chromecast has one job and does it well. Stream popular apps on to the television whether you have an android, iphone, or windows phone or a windows or mac based computer.Goodpoint:-Can wireless cast apps to the television.-Can cast your computers on to the television with just a download of the Chromecast extension.-Cost is really cheap and its worth trying out.-Some third party apps like showbox work for this device as well.-Uses HDMI which means is works on any flat screen television.Bad points:-Needs wifi (no wifi, no casting)-Can cast entire computer screen but function is experimental and audio still plays through the computer-Paying a little more for a Roku might be a better choice if you want to use it for commonly know apps (Netflix, Hulu plus, Pandora, etc...)For me and everyone in my house we have found multiple uses for it and it really help that I don't have to hook up my laptop to the television via HDMI cord anymore and it being really close.check out my video and see if this device is a good fit for you.https://www.youtube.com/watch?v=RPSnO6ykcKw", "verified": false, "helpfulness": "0/0", "author": "DuShaun Williams"}, {"rating": 5.0, "review": "excelente", "verified": true, "helpfulness": "0/0", "author": "lucila"}, {"rating": 1.0, "review": "The connection between the chromcast and the smartphones or tablets is almost impossible I have it since February but I just connect twice.", "verified": true, "helpfulness": "0/1", "author": "Natalia Beracasa"}, {"rating": 5.0, "review": "Been using this for almost a year now. It has basically become a part of our lives. I am writing this review while casting!There is only one issue of note. At times there is an issue with the cast screen setting in the app. If the app doesn't automatically have the cast screen option built in (Pandora, Youtube, etc.) and you need to cast your current screen, it sometimes doesn't work. This is probably a problem with the app itself or our phones.", "verified": true, "helpfulness": "0/0", "author": "Mike and Jen"}, {"rating": 2.0, "review": "This device is cheep so i didn't anticipate anything perfect. Sometimes it doesn't work and i need to replug it, sometimes it looses signal. It only works well with my Mac, on my Windows machine it works with 1sec delay, so it's impossible to use.", "verified": true, "helpfulness": "0/0", "author": "Alexander Vyaznikov"}, {"rating": 1.0, "review": "Bought it and after a month the input where you plugin the cable on the chromecast broke.", "verified": true, "helpfulness": "0/1", "author": "Elias Cisneros"}, {"rating": 5.0, "review": "Like the guy in the commercial, \"things should just work\" this WORKS. Easy setup for ChromeCast and Netflixs.", "verified": true, "helpfulness": "0/0", "author": "WebBuyer"}, {"rating": 1.0, "review": "Did not work", "verified": true, "helpfulness": "0/1", "author": "jaime vance"}, {"rating": 5.0, "review": "Does everything I want and more.  And for the price it is great.  This sets a high bar for simple to use technology.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}]