[{"rating": 5.0, "review": "This little gem puts all your entertainment in one place.  Very easy to search a huge array of movies/shows/etc.  Great product!", "verified": true, "helpfulness": "0/0", "author": "sporter84"}, {"rating": 5.0, "review": "Excellent for using Netflix.  Just finished viewing West Wing 7 season series.  Simple to install and use.  Must better than Google Chrome for me.", "verified": true, "helpfulness": "0/0", "author": "Galen R. Frysinger"}, {"rating": 5.0, "review": "This is a must have if you are a 'Prime' member. The movies and shows are great, and even if you don't have Prime the cost of the shows are quite reasonable. The best part is that searches are very easy using the \"voice button\".", "verified": true, "helpfulness": "0/0", "author": "Dr.  von Weyh \"Dr.  von Weyh\""}, {"rating": 2.0, "review": "I deep getting a slow internet connection even though it says it has a great connection. Very annoying. Can't find any info on this problem wondering if its the amazon fire product itself.", "verified": true, "helpfulness": "1/4", "author": "nuch"}, {"rating": 5.0, "review": "This is the best!  Quit wasting your money on cable and get with Amazon Fire!  Get Hulu and Netflix and you will really have viewing options.", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "I bought this item because my wife likes to use simple tech gadgets.  Can't imagine another device working better or has more features for the $$$.  The voice activation works every time.  Bravo to amazon", "verified": true, "helpfulness": "0/0", "author": "hjt777"}, {"rating": 4.0, "review": "The Good,Easy setupWi-fi remote is simple but very goodOffers gaming remote for those who want to play games on itAttractive user interfacePowerful (Quad-core @ 1.7Ghz, 2GB RAM)Snappy (fast and responsive), and not sluggish like most \"Smart\" TVs and Blu-ray playersThe Bad,No customization whatsoeverNo voice search for Netflix (yet, it's coming soon)User interface, while nice looking, feels disorganized at times, and not as good as the Roku 3's when navigating through itOld versions of apps, mainly Netflix. Seriously? Keep UP with UPdates. My slow Samsung Smart TV has the newest (prettiest and easiest) version of NetflixNo M-Go as far as I can tellLimited number of apps compared to RokuThis media player is good, very good actually, with potential to be the best media streaming device out there. It's close, but not there yet. For $99 final purchase and the chance to currently try it out for free for one month, I'd say jump on it. It'll only get better as time goes on.", "verified": true, "helpfulness": "2/2", "author": "vestopher"}, {"rating": 5.0, "review": "Have a Roku and it is a few years old. So while I must say this Amazon Fire is slick, it is newer with more features than Roku. But it was easy to connect. I entered my Netflix ID wrong and it took a little reading to figure out how to change it. WiFi connecting was easy and the speed seems faster than my Roku . Not sure why because it is the same WiFi.", "verified": true, "helpfulness": "0/0", "author": "Miles Felmly"}, {"rating": 5.0, "review": "Works great.  Fast.  The voice control works great too.  I'm an apple guy...but they better get going.  This smokes the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Go WSU Cougars!"}, {"rating": 4.0, "review": "It's significantly faster than the Roku. The voice search works great, but pretty much just works on Amazon Prime, no Netflix integration yet (coming this year). Until there's Netflix integration in the voice search, its not very useful for me.The build quality is night and day compared to the Roku. The Roku feels like a cheap toy compared to the Fire TV. The Roku remote doesn't fit in a nice home theater setup. The Amazon remote looks much nicer, but I don't like the rounded bottom on either one.The LED is brighter on the Fire TV than the Roku. I don't like how bright the Fire TV LED is.The Roku always seems to load Netflix movies in standard definition then transitions to high definition. The Fire TV loads right into high definition.The Roku also will occasionally slow down, freeze then reboot. My colleague has two Rokus that do the same thing. So far I've had no reboots or slowing down.", "verified": true, "helpfulness": "1/2", "author": "John"}]