[{"rating": 4.0, "review": "It does everything that it said it would do very well. I wish I could use my Vudu account on this. I'd recommend buying the Amazon Gaming Controller with it because you'll play games with it eventually.", "verified": true, "helpfulness": "0/0", "author": "M.Brand"}, {"rating": 3.0, "review": "Super easy to install. Like the layout. But it's not IR remote so I can't hide the box. Easy software, even my 5 yr old can operate it.", "verified": true, "helpfulness": "0/0", "author": "Twin Mom"}, {"rating": 5.0, "review": "Got rid of my cable company!!!", "verified": true, "helpfulness": "2/2", "author": "Lilly Mosquera"}, {"rating": 5.0, "review": "Fire TV does everything you said it would and does it well!", "verified": true, "helpfulness": "0/0", "author": "Walter A. Lucas,Jr."}, {"rating": 4.0, "review": "This is a solid project, with a few flaws. It could use a search engine that checks all the apps available on the system. It would also benefit from knowing when not to ask for my password.", "verified": true, "helpfulness": "0/0", "author": "John Tuero"}, {"rating": 5.0, "review": "I've been using The Amazon Fire for about a month now and I am quite satisfied with it. I have Apple TV, Tivo and Sony TV apps but have never been happy with the performance/functionality of apps supplied for those systems for both Netflix and Amazon Prime. Using Airplay with the Apple TV and my Ipad was always a hit or miss where Airplay stopped working while watching a show or movie.  While I'm a big Apple fan, airplay became annoying.Amazon Fire provides the solution for this old dude that I was looking for. Both the Netflix and Amazon Prime apps work very well. I also like the fact that when I hit home on the Fire remote my Sony TV will automatically change the input to the Amazon Fire. Other features like voice control I really have no favorable or unfavorable opinion. Kids may like voice control but it's not why I purchased the Fire.", "verified": true, "helpfulness": "0/0", "author": "David E. Edwards"}, {"rating": 5.0, "review": "Our TV is still in great shape and didn't want to spend over a thousand dollars to get a new one.I had some Instant Videos I wanted to watch, but my computer chair isn't comfortable to sit long enough to watch a movie.  The Fire TV makes it so easy to watch Amazon Instant Videos on our television.", "verified": true, "helpfulness": "0/0", "author": "Mary-Theresa Dameron \"MaryT\""}, {"rating": 4.0, "review": "As far as a media streaming device goes the Fire TV is top notch.  I have side loaded XBMC and it runs it better than my Apple TV and both of my Android sticks.  I would give it 5 stars if they could make it a little easier to side load apps and enable the USB port to be used for additional storage.", "verified": true, "helpfulness": "0/0", "author": "Jeff G."}, {"rating": 5.0, "review": "I love it. Voice search works wonderfully. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Catherine Ugarte"}, {"rating": 5.0, "review": "awesome", "verified": true, "helpfulness": "0/0", "author": "Jody Johnson"}]