[{"rating": 5.0, "review": "Works great.  Attached to an extra HDMI port on my TV, I can cast my Android phone screens to the TV, or any webpage from my chrome book.  Most apps have an icon that permits the phone app to be cast to the TV; however, there are a few apps that block the casting of video, such as nfl mobil.  It is great for viewing your  own photos and videos on full screen HD TV, or You Tube videos, etc.  If you do not have the Amazon TV App on your TV, then you can cast downloaded movies to the TV from your smart phone with no loss of fidelity.", "verified": true, "helpfulness": "0/0", "author": "F. Futch"}, {"rating": 5.0, "review": "Best product from Google", "verified": true, "helpfulness": "0/0", "author": "Doron De-Leeuw"}, {"rating": 3.0, "review": "Not entirely a seamless experience. Stops responding sometimes to mobile device and continues to play on its own.", "verified": true, "helpfulness": "0/0", "author": "V. Rajesh"}, {"rating": 5.0, "review": "Love this thing, had to buy 2 more for the kids", "verified": true, "helpfulness": "0/0", "author": "Q. Jones"}, {"rating": 5.0, "review": "Nice but the results are not what I expected.", "verified": true, "helpfulness": "0/0", "author": "MALAYAPPAN \"KALIDASAN\""}, {"rating": 5.0, "review": "Got it on sale for $25. It does work great but wouldn't pay more than 30 for it.", "verified": true, "helpfulness": "0/0", "author": "Enrique P."}, {"rating": 5.0, "review": "Hassle-less screen casting device, it's amazing the simplicity and general satisfactory feeling I get when using this device, cannot help to think that everything should work like this. Even if you have a \"smart\" TV, this thing really makes it that you finally realize how a smart TV should feel like. Even my father (64) uses it without trouble.", "verified": true, "helpfulness": "0/0", "author": "pablete"}, {"rating": 5.0, "review": "Works pretty well. Wish it had 5GHz option as my apartment building is pretty congested on the 2.4GHz channels", "verified": true, "helpfulness": "0/0", "author": "Valeri Petrov"}, {"rating": 5.0, "review": "Do I have to have wifi In my home in order for this to work on my tv? Really thinking about buying this!", "verified": false, "helpfulness": "0/0", "author": "Mercedes B"}, {"rating": 5.0, "review": "Excelent... 100% positive...", "verified": true, "helpfulness": "0/0", "author": "Numa"}]