[{"rating": 1.0, "review": "I love google and chrome, but the chromecast, just like the chromebooks, still has a way to go... there's no easy way to stream from your Mac (I used a browser plugin but it was impossible to watch a 2 minute video as it kept on stalling). I'll buy the next version to test it, but for this one specifically, I wouldn't bother...", "verified": true, "helpfulness": "1/2", "author": "Lucas"}, {"rating": 5.0, "review": "One of the most affordable yet super functional tech products I've ever bought! Plug this in your TV and stream anything you want from your iphone or iPad etc.", "verified": true, "helpfulness": "0/0", "author": "MD"}, {"rating": 5.0, "review": "I LOVE MY CHROMECAST! Its price is an insane value for how well it works. My roommate has an apple TV and has twice the amount of problems and pain three times the price for it! If youre trying to stream video on you TV chromecast should be your first choice!", "verified": true, "helpfulness": "0/0", "author": "Shawn Sweeney"}, {"rating": 5.0, "review": "While it is sometimes finicky for the most part this stick if fantastic.  I wish that the HDMI-CEC could control the playback and that the chromecast could control the audio of my home theater system, but otherwise it is great.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "This is an excellent product!You know what else is excellent?Earning more money that you can put toward your next purchase or anything else.All that is needed is a tracking# within 24 hours of its delivery date, and a $10 minimum wager.Email your tracking# to shipmintwagering@gmail.comWe will respond with 3 arrival dates for you to choose from.The option to play is up to you.Here are a few of the winners who opted to play:kingdaddy11XXXXXXXX.com won $10HoolaHoopchickXXXXXXXXX.com  won $10oklahomalandslideXXXXXXXXXXX.com won $10scenicroute66XXXXXXXXXXX.com won $10randomactsofblindnessXXXXXXXXX.com won $15whodini19XXXXXXXXXX.com won $25sterlingsilver88XXXXXXXXX.com won $35flyinghigh420XXXXXXXX.com won $45", "verified": false, "helpfulness": "0/2", "author": "Shipmint"}, {"rating": 5.0, "review": "Love my Chromecast! It is incredibly easy to set up and use. I love the fact that I can stream from my phone and still be able to use it to do other things at the same time. The price is also nice! Unfortunately, my sad little netbook cannot handle streaming videos from my Chrome tabs, but I have friends who were able to do it via a Mac. Also unfortunate is that it does not support Amazon Prime streaming. The consequences of competition, I suppose...I recommended this to another one of my friends, and he immediately bought three, one for each of his TVs!", "verified": true, "helpfulness": "0/0", "author": "Rose Zu"}, {"rating": 1.0, "review": "Bought the item, made the mandatory update and finally two weeks fromnow netflix and several others apps still not working.", "verified": true, "helpfulness": "0/0", "author": "Martin Bernabo"}, {"rating": 3.0, "review": "I love shiny new gadgets and ordered this when I first heard about it. Setup was fantastic, just connect to your wifi / go to a URL and it is done.My experience has been fairly meh so far. I rarely find myself using Chromecast, either its capabilities haven't been marketed well enough or I haven't spent enough time trying to learn what all it can do. For now, it stays plugged in even though I don't use it.Pros- Easy setup- Easy to project youtube videos onto TV from your phoneCons- I bought this thinking I would be able to share pics from my phone (Android) to TV but I don't think I have found a good solution for this. Can't project anything from your personally photo / video library on to the TV using Chromecast. Atleast I haven't figured this out just yet.- Limited functionality - I already have an Apple TV and through that I can project my entire Mac onto the TV screen. This gives the ability to play any content through your chrome browsers but that's about it. I really can't think of any wow/extra features which makes this exceptional.", "verified": true, "helpfulness": "0/0", "author": "SG"}, {"rating": 3.0, "review": "I have just bought this product from Amazon. I have managed to view only [...] videos only on my TV. The movies I cannot view are the ones I have bought from Amazon and my subscription to Netflix. I just cannot get any video transferred to my TV set with the Google Chromecast hooked up to it. I can add two more stars to this review if someone shows me how to transfer all my movies onto the Chromecast device hooked up to my TV.", "verified": true, "helpfulness": "0/0", "author": "jackiepapertracer \"Jack\""}, {"rating": 5.0, "review": "I got this thing to watch YouTube videos on my digital TV then plugged the TV audio out into my stereo.  It is like having your own concert hall on demand.  Very cool.  You do need a smart phone or tablet to drive it.", "verified": true, "helpfulness": "0/0", "author": "Joe Matucheski"}]