[{"rating": 5.0, "review": "Got a Chromecast for Christmas.  Setup was fairly easy.  Had to do a couple software updates but after that it worked fine.  Have used it mostly so far to just stream YouTube videos from my phone.  Works like a charm.  As an owner of a Tivo, BluRay, and Xbox360 adding this device wasn't really necessary but for $35 it's worth it and fun to play with.  Hope to see them add more and more things you can do with it.  In the end would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 4.0, "review": "I did not realize that iTunes would not work with chrome cast. But I am still happy with this product.", "verified": true, "helpfulness": "0/0", "author": "Lisa Willett"}, {"rating": 4.0, "review": "First you need to already have subscriptions to Netflix and or Hulu. Amazon Instant Video does not currently work on this device. Treaty to be signed later.I have a Kindle Fire HDX 7 and this has worked pretty well. The one thing to be careful of is crashes on the HDX while it's loading. It will confuse the Chromecast and you might have to reset to default settings. I had Hulu crash once and got only audio for a second on my Chromecast. Settings returned to default, problem solved.If you have a recent TV without cable or antenna this is a perfect device. Again, memberships are key. The Chromecast only allows you to access your memberships. Just like the Roku. Your tablet then becomes a cool remote. Very responsive.One advantage over the Roku is casting from your CPU to your TV. The Roku doesn't allow this out of the box.This is not for people who are technology adverse. Don't get it for Grandma or anyone else that can't program their electronics.Almost forgot. This has one of the most intelligent packaging designs I have seen in a long time. Simple. Economic. And quite nice.", "verified": true, "helpfulness": "1/1", "author": "Just W"}, {"rating": 2.0, "review": "Beta testers are still slow in reviewing and fixing bugs, so no 3rd party apps are available. At the same time, it should be able to connect directly (device-to-device) instead of asking for a medium wifi (so that one can use it when traveling, or are in a place where there's no wifi hotspot available).", "verified": true, "helpfulness": "0/0", "author": "sun"}, {"rating": 1.0, "review": "I shouldn't graduate from Google University so I can use this device.Hooked it to the TV, prompted me to go online (specified URL), asked to match my wireless network with whatever the name of this device's wireless. I stopped there.First: life is short to mess up with re-configuring my network upon someone's conditions.Second: it doesn't work with Linux, means for me: useless.It is collecting dust behind the TV.", "verified": true, "helpfulness": "0/1", "author": "AUM"}, {"rating": 2.0, "review": "No matter what I do, I can not cast chrome to TV as it promised, period.Not a really useful/differentiating product if you have apple TV already.", "verified": true, "helpfulness": "0/0", "author": "X. Luo"}, {"rating": 5.0, "review": "This is a GREAT buy! I wanted apple TV but there was no way I was going to pay that much. When I heard about this product I was weary because I am an apple fanatic but I am very happy with my purchase. I took it on vacation and I am surprised how easy it was to set up in a new place!", "verified": true, "helpfulness": "0/0", "author": "SaraBoBeara"}, {"rating": 5.0, "review": "I've recently fallen in love with HBO GO, but my iPad screen didn't do the content justice. AppleTV is late in the cycle for the current version, so I opted to find something that's newer and not so costly. The Chromecast addressed my need perfectly and is dirt cheap, to boot.<Skip if you don't have a Time Capsule>For most, setup will be a breeze...but not for me because I have an Apple Time Capsule. The Chromecast plugged into my TV fine, I got WiFi set up on the Chromecast, and the moment I began to stream video, it disconnected. A quick Google search told me the Time Capsule was likely the problem, but I didn't spend any time fiddling with it, I just found a workaroud. I ended up hooking to my ISP's WAP instead of my Time Capsule and it took ~2 minutes start to finish.</Skip if you don't have a Time Capsule>The iPad/iPhone versions of Netflix & HBO GO are spectacular. The browser versions of Netflix and YouTube are also spectacular. The developers of the browser version of HBO GO need to talk to the Netflix or YouTube developers...rough around the edges, but it's perfect via the HBO GO app.I haven't tinkered with Hulu Plus, so I can't render a verdict on that front. If you're looking for a cheap way to get HBO GO streaming on your TV, this is the way to go.", "verified": false, "helpfulness": "0/0", "author": "DCDude \"DCDude\""}, {"rating": 2.0, "review": "If you want to watch youtube or whatever is provided for by Google, then it is fine.If you want to display your photos or videos from the phones/laptops, etc - looks somewhere else.Overall, for $29 not bad, but would be 5-star if it was more flexible and played more content.", "verified": true, "helpfulness": "0/0", "author": "Nikola Trninic"}, {"rating": 3.0, "review": "I bought this primarily as a way to stream from my laptop to my TV.  Originally it worked great!  I could stream anything that was played on my computer just by adding an app.Then Google removed that app, and updated Chrome so it was no longer supported.  So I had to go buy a new DVD player after all.But I could still watch streaming content on the TV from any site on the internet without giving up the ability to surf the net.  All I had to do was run it in full screen mode, in Chrome.  Hitting alt-tab would keep the streaming tab streaming in the back.  Until right after Christmas.  Then, they update again.  Now the only full screen while surfing options that remain are the official Google partners - all pay services.This had much potential, but it's pretty obvious that Google is going to limit what they allow you to stream.  Which is a pity.....", "verified": false, "helpfulness": "1/1", "author": "Indyattic"}]