[{"rating": 5.0, "review": "And that is exactly why I got this for her.  Sure comparatively Roxio has more options, but she does not know any of them nor does she want to spend an afternoon signing up for all of their services.  Netflix, Hulu, and YouTube (grandchildren) is pretty much what she wants and needs.", "verified": true, "helpfulness": "0/0", "author": "Mirak"}, {"rating": 1.0, "review": "This hardware is not compatible with some routers, including mine provided by my ISP.  Changes required to facilitate compatibility affect security.  Returned item to Amazon.  Bought it because family members recommended it, but it is not for me.  Love my Roku!  Do not love Chromecast.  And now I see another reviewer writes it is not compatible with Amazon Prime.  Huh.  Buyer beware . . . .", "verified": true, "helpfulness": "0/1", "author": "Aunt Tee \"Aunt Tee\""}, {"rating": 1.0, "review": "does not connect at  all after following any and all instructions. Never buying another google product. Windows ME worked better", "verified": true, "helpfulness": "0/1", "author": "david"}, {"rating": 4.0, "review": "Awesome & so easy to setup!!  I love having the convenience of just plugging it in and playing my fav shows.", "verified": true, "helpfulness": "0/0", "author": "Veronica Madrigal"}, {"rating": 4.0, "review": "We have an Apple TV and although I like it, it's definitely not as great an Apple product as the iPod, iPad or iPhone.  I really wanted another one for the tv in our basement, but I didn't want to pay another $100 just to stream Netflix there.  Then I saw the Google Chromecast for about 1/3rd the price and although it didn't do quite as much as the Apple TV it appeared to do what I wanted which was just to stream Netflix.It was easy to set up, it's so small it's hidden and it powers through the tv......I was hugely impressed.  There were some minor hiccups initially, but the update seemed to fix that.  Every so often it will seem to take awhile to get going, but that could be because we have so many devices on only DSL at our house.  It's certainly worth the price and I hope they continue to add more apps and improve it.", "verified": true, "helpfulness": "0/0", "author": "KC"}, {"rating": 3.0, "review": "I think this has the potential to be a cool device.  I don't think it is where it needs to be.  There aren't many apps that will use this yet.  If you send something from your iPhone to the device you cannot stop viewing it.  I think they need to work out the bugs.  Also, this device gets very hot while it is plugged into an electrical socket.  This is fine, but be ready for it.  In the ideal world you will have a USB (not a service USB) port on your TV so the chrome cast will shut down when the TV is not in use.", "verified": true, "helpfulness": "0/0", "author": "Raymondoooo"}, {"rating": 3.0, "review": "I bought this with the intent of using it to watch Netflix and Hulu Plus.  It doesn't make the cut.Setup:- The setup process was easy.  Ran into one bug.  I tried to change the name of the chromecast box when it allowed me to, the device and the controlling computer get confused and I eventually had to start over.Streaming:- Youtube worked ok.  I watched 5 minutes or so with no problems.  I noticed that I could not watch private movies, even those that I own.- I watched 2 hours of content from Netflix and HULU.  It worked, but not without glitches ever 5 to 10 minutes where it would pause for a minute or two.  We eventually had to go back to our Roku to finish an episode of Arrested Development.- Controlling the device from my phone was a pretty neat trick and worked surprisingly well.Overall, I can see that this is definitely the future for streaming TV's.  But the streaming problems will need to get worked out before it is an alternative in my home.", "verified": true, "helpfulness": "0/0", "author": "Kevin Connors"}, {"rating": 2.0, "review": "The chromecast is good for watching Netflix and Youtube, but that is about the extent of it's abilities to provide quality content to the television.  I would have rather spent the money on Roku or the Apple.", "verified": true, "helpfulness": "0/0", "author": "dale kellison"}, {"rating": 5.0, "review": "Just what I hoped it would be like, really easy to use. Got on sale which made it even better!", "verified": true, "helpfulness": "0/0", "author": "momto2"}, {"rating": 5.0, "review": "Thank you very much, everything is fine! I love this thing. All worked very well. Thanks again. Recommend to everyone.", "verified": true, "helpfulness": "0/0", "author": "Oleg"}]