[{"rating": 2.0, "review": "The movie selection seemed small with prime and a lot of the shows were not available for free like I thought.", "verified": true, "helpfulness": "0/2", "author": "daniel fomin"}, {"rating": 5.0, "review": "I was using my x-box 360 to access my favorite apps, but honestly I wasn't interested in playing games online. So I figured instead of renewing my gold membership that I should just purchase Amazon fire TV. I was very excited to get this in the mail ha ha so it arrived and it was easy to set up. There was a problem I ran into with one of the hdmi outlets on my TV, not working correctly but had nothing to do with this product. I have almost all of my favorite apps on here the I did on my x-box and more.Very easy to use, and pretty self explanatory. I really don't have any complaints I'm glad I decided to purchase this instead of renewing my x-box live membership. The only thing a think is strange is it doesn't shut down or off at all, the only way to \"turn it off\" is to unplug it from the wall. Otherwise it will just go to sleep.Oh and when I was reading reviews and the forum on if I should get this --A LOT-- of people were concerned about being a prime member. First if you're not a prime member when you purchase the Amazon Fire TV they will give you a 30-day free trial. Amazon prime is a once a year time payment which includes all of the perks; however, you must have a permanent credit card or debit card, my friends family tried to get amazon prime on a pre-paid credit card and it doesn't accept it for prime even though they can use the card for other purchases.", "verified": true, "helpfulness": "0/0", "author": "Manga-Blondie"}, {"rating": 5.0, "review": "Have a wonderful five year old and unfortunately, I need to work. My little guy figured out this remote and I have an \"easier\" time to earn money for his lifestyle. Still have Direct Tv which besides the last Daily Show I haven't watched it. Still finding more and more goodies. One of my smartest buys.", "verified": true, "helpfulness": "0/0", "author": "Todd Meyer \"ixtlan23\""}, {"rating": 5.0, "review": "Fire TV is a great product.  I am able to watch a lot of shows and with the addition of Sling TV it makes it even better.  I only wish that there were move free movies on here.  I went to watch \"I Am Robot\" the other night and it wasnt free.  I would think that since we are paying for a monthly subscription that anything that isnt a new release or at least a year old would be free.", "verified": true, "helpfulness": "0/0", "author": "Jamie Wolfe"}, {"rating": 5.0, "review": "Loyal Roku user for past 3 years until both of my POS Roku units stopped working recently. Fire TV set-up was a snap and man this thing is fast. I like the look of the console (VERY minimalistic - think Spinal Tap's \"Smell the Glove\" LP) and the remote has a nice grip and heft to it, unlike the flimsy peice of plastic crap Roku provides. The interface and menu are also more intuitive than the Roku and provide more information about whatever you're watching - for example, when you pause the movie a side bar appears at the bottom of the screen with head shots of some of the actors - pretty cool. I've only had it a few days but I'm very happy with it  - even if $100 seems a little pricey. They must be getting massive demand for it, because I just ordered another one and even with my Prime shipping the delivery date is out 2 weeks.", "verified": false, "helpfulness": "0/1", "author": "Stark8"}, {"rating": 4.0, "review": "Love the Amazon Fire however, started having difficulty with the streaming of movies especially on Netflix.  The signal gets lost or something (it is not the internet signal; that is fine). We see refurbished boxes, can we send ours back for a trade-in in a new one? Cable company insists the problem is with the Fire box.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Spencer"}, {"rating": 4.0, "review": "I purchased this device as a replacement for my aging XBMC (now Kodi) media center box that was based on an re-purposed desktop PC .  I wanted something portable and capable of playing local media at the highest quality plus the streaming services I subscribe to.  The ability to play some games was a definite plus but not mandatory.  I originally purchased the NVidia Sheild TV because it had more powerful hardware and had the potential to be a very good casual gaming system.  I liked the idea of Google Play store compatibly because most of my app and Android game purchases were on the Play platform.  Unfortunately even though the potential was there the software just is not.  The Fire TV (even though it is running an older customized version of Android than the Shield) has a far better interface and is more usable for my primary use - video.  It has very good search that crosses several services (not just Amazon Video).  It has built-in support for HBO Go, Showtime Anytime, NetFlix, and Plex.  Kodi was pretty easy to side-load and works well.  The box is fast, stable, and easy for my family to use.  This device is definitely the winner of the currently available crop of streaming boxes in my mind.Good: UI, Ease of use, Speed, Search integration, Streaming service options, not too hard to side-load apps, BlueTooth support (keyboard, mouse, headset).  Support for overscan correction.Bad:  USB flash only memory expansion with limited capabilities (No SD card, one USB port). No Google Play App Store, UI doesn't directly support side-loaded apps.", "verified": true, "helpfulness": "0/0", "author": "TheComputerGuy"}, {"rating": 5.0, "review": "We've has Fire TV well over a year now and it's an awesome thing.  I love Display Mirrioring which allows you to watch anything you stream to your Kindle on the Television.  Voice search makes a quick job of finding your favorite shows plus with all that going through your home Surround Sound (if you have it) allows you to play all of your Prime music in hi-fi.  I can't say enough of how much we love it.  Plus with apps like Netflix, Hulu Plus, and Crackle to go with all the movies and show offered to Prime Subscribers for $0.00 dollars you are in control.  What a deal!! You can't go wrong with Fire TV.  The iceing on the cake is with Mayday they will help you with anything from Kindle questions to Prime shipping issues should they arise.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Really enjoy this product! We use it for Netflix and Hulu plus mostly. Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Corinne Nelsen"}, {"rating": 5.0, "review": "Always nice to have an alternative to cable", "verified": true, "helpfulness": "0/0", "author": "Chris Wymer"}]