[{"rating": 3.0, "review": "I really like the layout of the interface, the compact size, the ease of the remote but the signal range is terrible. I found that the quailty of the stream was terrible and compared it to my PS4 which is just a foot away and the image clarity was like night and day. I don't know if there will be a software update that can make it better or not. I did switch the default pic quality from auto to 1080p 60htz and it still had terrible picture. I have to have the box practically next to my main wifi box for it to work the way it should. Not sure if its defective or not. I'll have to look into it.I moved it to 3 different rooms and only the room with the main wifi box had a good picture clarity...i'm thinking of returning it within the 30 days.", "verified": true, "helpfulness": "1/5", "author": "Scott"}, {"rating": 5.0, "review": "Great device, very simple to install and operate, very fast/Responsive system...a must buy for anyone who likes a good STB", "verified": true, "helpfulness": "0/0", "author": "roy t weddington"}, {"rating": 5.0, "review": "I LOVE my Fire TV! The main reason I love is because the playback is lightning fast. Before we were watching streaming movies and tv with consistent pauses because our internet service is so slow. In our geographical area, we have the fastest internet service we can get which is not that great. Fire TV fixed all that. Now we can watch a whole movie without the actor stuttering and going uuuuuuu while the movie buffers. Thanks Amazon!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I own a Fire TV, Roku Box and an Apple TV. The Amazon Fire TV is by far the best of them all!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I WAS THINKING THAT THE BOX WAS MUCH LARGER FROM SEEING  IT ON THE PICTURE.. AND I DON'T UNDERSTAND WHY DO I NEED TO PAY  FOR  THE MOVIES ...?", "verified": true, "helpfulness": "1/15", "author": "Lorenzo"}, {"rating": 5.0, "review": "Fire TV is a very good product. Very easy to use and when linked with a Prime membership is hard to beat.Amazon hits a homerun with this product.", "verified": true, "helpfulness": "2/4", "author": "Bob Kale"}, {"rating": 5.0, "review": "Over the years I have used several models of the Roku player. Every time I try to fast forward with the Roku the signal is lost and I have to reset the player. I have had no such problems with the Amazon Fire Tv. I can fast forward quickly with no problems. The voice search works great but only with Amazon Prime. Would be nice if it worked with Netflix. After several weeks of use I have not had to reset it for any reason. It doesn't offer as many channels as Roku but I mainly use Amazon and Netflix. It was easy switching from Roku to Amazon Fire Tv, no great learning curve needed. I have a smart tv but find it easier to use the Amazon Fire Tv.", "verified": true, "helpfulness": "1/1", "author": "R. Gruber"}, {"rating": 2.0, "review": "6/5/2014 Now that I have utilized since it came out I leave it at a TWO. Voice commands only allow you to find quickly, with no selection as to from which service. It seems to select the pay for view. Seems to have limitations with Netflix as I can find more selections through my PC. In fact utilizing PC with HDMI port and cable allows greater selection with trade off of ease of operation.First purchasedLoads quick, easy to get up and running. Only searches Amazon for move, tv, or person. I was looking for King of Thrones and it found it on Amazon for a price. Looked it up on my PC and there was a discounted price not shown of Fire TV. Ordered from my PC at discount price and cycled power to Fire and my purchase was available. Opened a Amazon Cloud and uploaded some pictures. I was able to view on TV right away!You should be able to mirror your PC! You can only mirror Amazon products. Once they upgrade product should be exceptional.", "verified": true, "helpfulness": "1/4", "author": "Ron"}, {"rating": 5.0, "review": "Very easy hook-up, very easy operation. Voice search works terrific. Completely satisfied. Would recommend this to anyone to improve the Amazon Prime offerings from Kindle to big screen TV.", "verified": true, "helpfulness": "1/1", "author": "J. Nowicki"}, {"rating": 1.0, "review": "This device is very disappointing. It lacks MLB.tv and this freaking thing came out during baseball season. My cell phone can get MLB.tv but this\"set top\" can't. Save 50 bucks and get the Roku stick instead.", "verified": true, "helpfulness": "5/28", "author": "Dr Joseph K ONeal"}]