[{"rating": 5.0, "review": "Chromecast is awesome. I love it. I love how it works with all my Android devices and with my lap top while I'm on Chrome (the only browser I use anymore).", "verified": true, "helpfulness": "0/1", "author": "Shane Frost"}, {"rating": 2.0, "review": "I was excited at first when I read about this thing.  However, I don't find it very user friendly and it doesn't really do that much.  Right now it is disconnected from my TV and laying in a drawer someplace.  Don't waste your money.", "verified": true, "helpfulness": "1/2", "author": "Judith"}, {"rating": 5.0, "review": "I bought a HDTV about 1 year ago and it did not come equipped with built- in apps. I would have had to spend at least 500$ to replace my current tv for a web enabled tv. Google chromecast is awesome. Simply plugin through HDMI and stream netflix, youtube, hulu etc. Control everything from your phone, tablet or pc and let google chromecast show you it's magic.", "verified": true, "helpfulness": "0/1", "author": "David Vazquez"}, {"rating": 4.0, "review": "I wish there were more apps and free content, but what a great concept and price. more words more words.", "verified": true, "helpfulness": "0/0", "author": "John D. Reed \"Lemy\""}, {"rating": 1.0, "review": "HelloDidn't work with my PC. works only with my Phone.  I try calling the support not much of help.Thanks", "verified": true, "helpfulness": "1/2", "author": "Dhaval Shah"}, {"rating": 4.0, "review": "I love it just so easy to surf on TV,  I just wish they improve on the application numbers it works with. Limited but cool for now", "verified": true, "helpfulness": "0/2", "author": "mohsen"}, {"rating": 3.0, "review": "I bought this product and thought that it would flawlessly send the streaming videos to my TV. Initially it works fine but then I started seeing the lag between the screens of my laptop and TV. I have pretty powerful laptop (i7 8 core, 16 G memory) and the home network bandwidth is good too but still I see the problem.", "verified": true, "helpfulness": "0/0", "author": "FH"}, {"rating": 4.0, "review": "Pros: Easy setup and video streaming is flawless.Cons: Only reason for the 4 rating is lack of apps.Conclusion: If like to stream video content to your television from a PC or tablet, this is a must have.I hope that Google creates a way turn the device off when not in use.", "verified": true, "helpfulness": "0/1", "author": "Reginald Page"}, {"rating": 5.0, "review": "It arrived on time, in mint condition, and it was just what I needed, thanks you for the great service. that's why I rated it so high.A great item for the price, easy to use, an excellent purchase.  A must have", "verified": true, "helpfulness": "0/1", "author": "Edwin D Sierra"}, {"rating": 5.0, "review": "Great for my needs.  I mainly use it for HBO GO but it is also awesome being able to show my wife a youtube video on the fly since she doesnt like watching them on my phone.  Netflix works great as well.  I will most likely be purchasing a second one to use in my game room.", "verified": true, "helpfulness": "0/1", "author": "Sean"}]