[{"rating": 5.0, "review": "This is an awesome product. I am a mac head and I chose this over the Apple TV since it was super simple to set up and is compatible with every device I have. I have a mixture of mac and android products and it works beautifully and seamlessly without hassle. I would highly recommend getting one for every TV in the house!", "verified": true, "helpfulness": "0/0", "author": "StarGazer12"}, {"rating": 1.0, "review": "Had lots of issues with chrome cast. Was causing problems with other wifi devices. Had to return it.", "verified": true, "helpfulness": "0/0", "author": "KMR"}, {"rating": 5.0, "review": "The Chromecast media player keeps on getting better over time. I find myself using this for watching Youtube channels and also Netflix. The Netflix and Youtube apps are easier to flip through compared to a Roku which i also have and use. I do love the fact I can now mirror my Android phone screen to my tv using Chromecast, say if I wanted to show off the photos on my phone or videos too.", "verified": true, "helpfulness": "0/0", "author": "Mzag21"}, {"rating": 5.0, "review": "Lifesaver!", "verified": true, "helpfulness": "0/0", "author": "Abner Nieves"}, {"rating": 5.0, "review": "This item works as it should, the first time and, thereafter... just like it should!!", "verified": true, "helpfulness": "0/0", "author": "Phasr \"phasr\""}, {"rating": 4.0, "review": "dont use it often but it works great.", "verified": true, "helpfulness": "0/0", "author": "Shannon"}, {"rating": 5.0, "review": "It took more than a couple of tries to get this hooked up and working; but it was more than worth the effort!", "verified": true, "helpfulness": "0/0", "author": "S. Palmer"}, {"rating": 2.0, "review": "this little gadget cost me a trip to have my computer repaired.  It did something to the setting.  Perhaps it was just defective but I returned it and did not want to risk trying a replacement unit.", "verified": true, "helpfulness": "0/0", "author": "manny"}, {"rating": 5.0, "review": "great product, fast service", "verified": true, "helpfulness": "0/0", "author": "Robert P Cleary"}, {"rating": 5.0, "review": "pretty awesome", "verified": true, "helpfulness": "0/0", "author": "Robin"}]