[{"rating": 4.0, "review": "So much hope and anticipation at first but I rarely use it now.  Haven't played a game on it since the first week I had this (and I even got the game controller).  Hard to find just the movie or show you want to watch from the tens of thousands of programs available.  I do use it sometimes to put up a mirror image on the big screen TV of what I am watching on the Kindle tablet.  That's a neat feature.  But I don't really use my Kindle tablet anymore.", "verified": true, "helpfulness": "1/1", "author": "gengis01"}, {"rating": 5.0, "review": "this is a great product - easy to set up, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Anne L. Mason"}, {"rating": 5.0, "review": "Don't waste your money on the stick version. Spend a few more dollars and get this one.", "verified": true, "helpfulness": "0/0", "author": "Mark Absher"}, {"rating": 4.0, "review": "Easy to use, excellent graphics voice feature uncanny!!!,", "verified": true, "helpfulness": "0/0", "author": "Jim K"}, {"rating": 4.0, "review": "Easy to install, quality very good", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The sling interface was terrible.", "verified": true, "helpfulness": "1/3", "author": "Joe Plescia"}, {"rating": 5.0, "review": "I love my Amazon Fire TV.  Not only can I watch selections from Amazon Prime, I can also use Pandora and YouTube.  I could choose to use Netflix and other offers if I wanted to pay for that service.  It was easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "D. Snyder"}, {"rating": 5.0, "review": "Love it. It is everything is says it is and I am extremely happy with in. Super simple to set up and use. Definitely recommending to friends and family.", "verified": true, "helpfulness": "1/1", "author": "April"}, {"rating": 4.0, "review": "Good product.  Seems to load/buffer streams faster than other streaming devices and sticks. Quality of video and sound is great,  especially using the optical audio out.  I like all of the options but wish there was some more customization.  I figure getting the TV over the stick,  that there would be more features for double the price.  The remote is a little touchy and it's not very fluid when cycling through videos no matter which app you are in, feels a little choppy. All in all I am happy with the product,  maybe some updates will help the GUI", "verified": true, "helpfulness": "0/0", "author": "Mark Gelmini"}, {"rating": 5.0, "review": "I Love the movie options we now have", "verified": true, "helpfulness": "0/0", "author": "Marilyn Friedman"}]