[{"rating": 5.0, "review": "Everyone should have one of these!!  Easy to install and great to stream Netflix movies to your TV!! Wish I had gotten it sooner!!", "verified": true, "helpfulness": "0/0", "author": "chiaroscuro \"C.\""}, {"rating": 5.0, "review": "Excellent product! Love watching tv from my phone! Very happy with the purchase.", "verified": true, "helpfulness": "0/0", "author": "Florencia Casaux Alsina"}, {"rating": 5.0, "review": "The hardware is great.  The associated apps/software are noticeably improving.  Some limitations on what you can \"cast\", but a great value overall.", "verified": true, "helpfulness": "0/0", "author": "alne"}, {"rating": 5.0, "review": "works perfectly", "verified": true, "helpfulness": "0/0", "author": "Mary Stella"}, {"rating": 1.0, "review": "This thing rarely worked and now does not light up at all.  A worthless device that should not be sold.", "verified": true, "helpfulness": "0/1", "author": "Dennis K."}, {"rating": 5.0, "review": "Works well. Supports almost everything on your phone", "verified": false, "helpfulness": "0/0", "author": "NJ \"NJ\""}, {"rating": 5.0, "review": "Awesome technology in a tiny package, a great offering from Google. Get one!", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 3.0, "review": "Was disappointed in being able to stream stuff.  Jerky and slow.I tried all the settings Google recommended, nothing fixed the issueeither from laptop to high performance desktop machines.Its ok to cast pages, but forget streaming.  We have high speedbroadband, so that is not the issue either.  My brother got theone and he had same issue, jerky streaming, so its not just me.I contacted Google and they recommended beta version of Chrome,that didn't make any difference.  Spend a lot more and get a Roku.", "verified": true, "helpfulness": "2/2", "author": "Chris Holden"}, {"rating": 1.0, "review": "This was a very frustrating product.  I wasted hours trying to hook this up to my TV.  They kept running me around in circles, without ever offering any sort of simple explanation.  It's going to the garbage.", "verified": true, "helpfulness": "1/1", "author": "Charles Stark"}, {"rating": 5.0, "review": "Using constantly for netflix, youtube, casting photos for friends.  Great product.  We have several now and love them.", "verified": true, "helpfulness": "0/0", "author": "Josie"}]