[{"rating": 4.0, "review": "Cool device", "verified": true, "helpfulness": "0/0", "author": "Mushtaq"}, {"rating": 5.0, "review": "A year ago my roommate bought this and replaced the HDMI chord that was hanging across the living room. We were streaming movies/shows all the time so this was a convenient upgrade to say the least. Awesome for anyone in college or living with roommates. Now I cast with a MacBook Pro & iPhone on a 32\" LG and the picture quality looks great for traveling through thin air. The Chromecast does need a power source so hopefully you have an outlet nearby, instead I just use the USB port on the side of my TV. An extender is included with the Chromecast to improve Wi-Fi reception. I recommend connecting the extender to your TV first and leaving it connected for good, but UNPLUG everything else when you're not using it!!! Download the Chromecast app on your device(s), open Google Chrome, connect the Chromecast to your Wi-Fi and you're good to go. I'll probably have this Chromecast for years. Google is making moves!!", "verified": false, "helpfulness": "0/0", "author": "Ethan"}, {"rating": 5.0, "review": "It was Perfect\"", "verified": true, "helpfulness": "0/0", "author": "Ruftop"}, {"rating": 5.0, "review": "Amazing!! i like to stream movies and tv on the internet on sites other than hulu or netflix all the time but i used to hook up the hdmi to my laptop. now with the chromecast i can wirelessly stream my content to the tv and do other things while my friends and i enjoy a movie on my flatscreen. its small and dicreet when plugged into the back of the tv and i dont need a remote to turn it on/off since it it powered by the tv. i reccomend to anyone that watches alot of video on the internet. blows the roku out of the water because it can stream through my laptop so i dont need the stupid channels for everything", "verified": true, "helpfulness": "0/0", "author": "Erick W."}, {"rating": 3.0, "review": "My sister owns a Chromecast and I loved it! Seemed to easy to use and a very economical way to watch what you want on your own TV. For some reason, mine is giving me a lot of trouble. It rarely works! Perhaps it is an internet connection issue, but even after going through a service call it still has not been fixed. Would have loved to get the quality of service out of the product that my sister has. Too bad.", "verified": true, "helpfulness": "0/0", "author": "Urme Ali"}, {"rating": 5.0, "review": "Definitely awesome if you are trying to stream to TV via HDMI, very cool love it! Cool backgrounds!", "verified": true, "helpfulness": "0/0", "author": "Coya Jackson"}, {"rating": 1.0, "review": "This item was a total waste.  It doesn't work properly on 5ghz wifi which is essentially the speed you need for videos to stream properly.  Also it basically only links your computer to your TV which you could essentially do with blue tooth or a usb cable.  Spend a bit more for a Roku, Amazon Fire or Apple TV.", "verified": true, "helpfulness": "0/3", "author": "Mrs. And Mrs. D"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Reinaldo Moreno"}, {"rating": 5.0, "review": "This is a must have for streaming movies via WiFi. You can watch movies that are on your computer wireless on your TV. That's one of the features, but this is what I mainly use it for. It's easy to setup and extremely cheap for what it can do.", "verified": true, "helpfulness": "0/0", "author": "Spec \"Spector\""}, {"rating": 5.0, "review": "I use this to watch Netflix, Youtube and MLB.tv on the living room TV. It doesn't call attention to itself so it's easy to take it for granted, but you wouldn't want to give it up. It's a bargain at $35. Also there's a Chrome extension called Videostream that will let you stream locally stored movies from your computer to the Chromecast, so you can use it as a media center even though it's not marketed as such.", "verified": true, "helpfulness": "0/0", "author": "David L. Farquhar"}]