[{"rating": 4.0, "review": "chromecasting is so much fun.  has problem with receiving feed from ipad.", "verified": true, "helpfulness": "0/0", "author": "Medicine Man"}, {"rating": 2.0, "review": "I had high hopes for this, but it hasn't been useful at all. Now it's just hanging uselessly on the back of the TV while we use the old Apple TV instead. It turned out that almost everything we wanted to do with this involved using ChromeCast to cast from computer or phone to the stick... but there was always trouble with poor performance, stuttering, yuck. Basically, it easily extinguished its own use. And the Apple TV still does fine, even when we use AirPlay (the equivalent of \"casting\").  Not sure why this doesn't work well, there's no reason it shouldn't compete equally with the Apple TV.", "verified": true, "helpfulness": "1/1", "author": "Randy Fay \"Randy Fay\""}, {"rating": 5.0, "review": "100 satisfied gives a great look to the room when in background mode.", "verified": true, "helpfulness": "0/0", "author": "Marco Hernandez"}, {"rating": 5.0, "review": "Works very well with a Samsung tablet. Streams great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jordan"}, {"rating": 1.0, "review": "Bad", "verified": true, "helpfulness": "0/3", "author": "Pop"}, {"rating": 5.0, "review": "works as described, perfect product and cheap!", "verified": true, "helpfulness": "0/0", "author": "riley wysocki"}, {"rating": 5.0, "review": "Great invention for technology, very convenient, works as described!Highly recommended !!", "verified": false, "helpfulness": "0/0", "author": "Leiby!"}, {"rating": 3.0, "review": "Good product, the only company i have is the lag, which happens enough to bother me. Great idea, but not quite there yet.", "verified": true, "helpfulness": "1/1", "author": "Joseph"}, {"rating": 1.0, "review": "Used to be great, doesn't cast netflix or hbogo anymore. Works fine with youtube but who wants to watch that all day?!!!", "verified": false, "helpfulness": "0/1", "author": "geotx"}, {"rating": 5.0, "review": "This thing rules. First thing, I have a Smart TV (specifically a first-gen Sony GoogleTV) and I prefer using a Chromecast versus all the smart features my TV has built in. It's just plain faster and easier to use. I have mine plugged straight into my A/V receiver so I get both audio and video directly from the Chromecast and the video pushed to the TV while the receiver does the audio. There's an abundance of chromecast apps available that will stream just about anything you want. This thing is the perfect entertainment streaming device.", "verified": true, "helpfulness": "0/0", "author": "Christopher Lang"}]