[{"rating": 5.0, "review": "excellent product and seller", "verified": true, "helpfulness": "0/0", "author": "WUNAR"}, {"rating": 4.0, "review": "Sound varys up and down.", "verified": true, "helpfulness": "0/1", "author": "Dwight Vincent"}, {"rating": 5.0, "review": "There are 7,700 reviews of Amazon’s Fire TV. Will another review matter? No, I do not believe it will. But, I like this product so much that I wanted to lend my voice to the plethora of existing reviews.Here is what I like: size, price, price of antecedents (e.g. video games, apps), future capabilities, speed, innovation, ease of use, Amazon’s service and inter-connectivity.What do I not like? Only one thing. I spend 6 months each year in Canada. I am 50/50 in Houston and Toronto due to work. This product does not work effectively in Canada. I do believe this product is worth the $100 price tag for Canadians; but my willingness to pay is much higher in Houston than Toronto.Size: This product is small, but not too small. I feel it is “just right”. I have an extensive home entertainment center. This includes recent additions such as Google Chromecast, Slingbox/SlingTV, Xbox One, Roku, etc…Basically, I am an early adopter. This item looks sleek and fits the tight space between the television and top of the TV stand. It is small, but a perfect fit! The aforementioned items are either too small or too bulky.Price: For $100 this is a steal! I can play NBA2K ($4.99 to purhcase) then watch unlimited Prime videos. All the way while there are tons of other apps such as ESPN, HBO, Showtime, CNN, etc…just amazing! In Canada I re-routed the IP address through the States. It is a little slower, more complicated. It works, but not always worth the hassle.Antecedents: This includes apps and games. There are so many FREE games! They’re pretty good too. The app selection is growing. I’m having a good time with all these extras.Future Capabilities: Amazon has a direct line into your home now. This is exciting for me, someone who is an avid Amazon shopper. This little piece of equipment has Internet connectivity and has a bright future. Limitless!Speed; Compared to Google Chromecast, Roku, and Xbox One I am impressed. It is quicker and more intuitive (it heeds my spoken commands for god’s sake) than most other similar devices as named. The Xbox One CAN BE quicker, but it is also more complicated. And I can’t speak to it.Con: If you’re in Canada just know there are limitations. You need to re-route your IP through the States. You need a USA-based credit card for purchases.", "verified": true, "helpfulness": "3/3", "author": "J. Taillon \"\"Purveyor of Randomness\"\""}, {"rating": 5.0, "review": "We really like the Amazon Fire. It is easy to use and Prime offers a great selection of movies.", "verified": true, "helpfulness": "0/1", "author": "Susan Baune"}, {"rating": 5.0, "review": "good product, gives a lot of options", "verified": true, "helpfulness": "0/1", "author": "debbs \"poldarksearcher\""}, {"rating": 4.0, "review": "This is a great product if you have Amazon Prime. It is easy to set up and works seamlessly. It is small and does not take up a lot of space. I took it with us when we traveled as a family and it was easy to set up . Our kids were able to watch TV/movies and allow us to sleep in! My only issue is that Amazon advertises the following, \"You can also access your entire Amazon Music library, so you can enjoy any albums and songs you’ve previously purchased from Amazon.\" At this point in time, streaming your Amazon Music library is not available. It is supposed to eventually be rolled out; however, it doesn't appear as if even the Amazon tech employees know much about this eventual feature. I spoke with 3 different people and got different answers each time and was eventually emailed that the feature is not yet available.", "verified": true, "helpfulness": "1/1", "author": "Shayne Hatch"}, {"rating": 1.0, "review": "I could not hear the voices during streaming from Amazon Prime.  When I contacted customer service, they told me that they were sending me a replacement Amazon Fire TV and I got a remote instead.  I returned the Amazon Fire TV and would not recommend it to anyone, especially if something goes wrong as customer service was not there to fix the matter.", "verified": true, "helpfulness": "1/7", "author": "Des"}, {"rating": 5.0, "review": "I have really enjoyed mine. One of the issues I had was my Amazon Music Collection was not being available on it. Very happy to find it all available today!! Which did provoke me to get in here to rate and review. Cannot add much that has not already been reviewed. So, I'll just add that I did find it very easy to set up & use. Love the default screen saver images. Always having the option to resume where I stopped my movie and shows is awesome! Also, the occasional stop the stream request, to find out if I am actually still watching, is great! In my less than 2 months with it, I can tell they have been updating & working out the bugs. Better access to Prime content, etc. It only bugged out a couple times. A simple unplugging to reboot worked. Truly appreciated my try it for a month free. I boxed my Apple TV for it. Even though I did occasionally use my iPad & iPhone Airplay with Apple TV interface, so far, I prefer Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "rosetone"}, {"rating": 2.0, "review": "If all you want to do is watch video purchased from Amazon, it's probably a pretty decent machine. But if you want to use the voice search to pull up Netflix (like most people), you're SOL. If you're in the Netflix app and you do a voice search for a movie, it hijacks you out of Netlfix and brings you to Amazon Movies instead. Let me repeat. Instead of showing you the version of the movie that you can watch for free with your Netflix subscription, they try to trick you into paying to watch the same movie through their competing service. This is utter nonsense. And, arguably, false advertising.", "verified": true, "helpfulness": "4/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's fast and responsive! I love the free 30 day Prime trial it comes with and the apps. I have no complaints.", "verified": true, "helpfulness": "1/1", "author": "Supah Rei"}]