[{"rating": 5.0, "review": "Best electronic device I've bought this year hands down. Can't image life without my Chromecast. Completely does away with those horrible remote control navigation screens!", "verified": true, "helpfulness": "1/1", "author": "HE3 \"ECubed\""}, {"rating": 2.0, "review": "Works sometimes but not always.I was able to use it on Netflix but noticed that there is some compatibility issue, it works only sometimes. On many shows it tells me to try at a later time.Works okay on Youtube though.", "verified": true, "helpfulness": "0/1", "author": "Nilesh Palve"}, {"rating": 5.0, "review": "the product is easy to install and use. Tough there is some lag in the picture being displayed on the connected device - the videos are sharp and the sound clear.", "verified": true, "helpfulness": "0/0", "author": "Indu K \"MBA Student\""}, {"rating": 5.0, "review": "I purchased my Chromecast a few weeks ago and I love the device.I use it mostly to stream Netflix while I am doing my homework or a project where I need to use my laptop. Before I was plugging my laptop up to my TV and in doing that I cannot get the use of my computer at the same time, so this device is perfect for multitasking.I come from a family of Apple lovers so I have received a lot of flack for buying this device and having windows or Android products over Apple products. So it being compared to the Apple TV is a little frustrating at times.Again, Netflix is my top use, the quality is amazing and I like that I can put on a movie and close my computer or open up a new tab and do research. It does get a little frustrating when watching a TV show because sometimes it doesn't register that you have watched it but switching is very easy of course, so it doesn't change how I feel about the product.Streaming my browser straight to the TV does not have a great quality but I do not use this feature much unless the site contains a video or content I want to make bigger to show someone.When I purchased there were not many comments about it or reviews so I purchased it by chance from just reading a small description and seeing what it could do in the commercials, but it is exactly what I have been looking for in a device. Before the Chromecast was released I was looking into a Wireless HDMI but I am glad I did not spend the money to buy that product. The price for the Chromecast is amazing on top of that, I was shocked at how low the price was.UPDATE!I just posted this review but I was looking through comments and discovered that I can stream local content by dragging the file into my browser search bar and it works amazing.I have a lot of video files and being able to watch movies in that format is amazing. Everything I learn about this device make me love it even more!", "verified": true, "helpfulness": "3/4", "author": "Ashley"}, {"rating": 5.0, "review": "I had a Nnetgear ptv2000 and I foolishly upgraded my computer to Windows 8.1. The Netgear device stopped working and no one could get it to sync, although my computer found the device it would not connect. Dell kindly upgraded me to a Netgear ptv3000 which Netgear assures me is 8.1 compatible. It might be, but not on my computer. After days of tech support from Dell and Netgear I threw in the towel and bought the Chromecast. Setup took perhaps five minutes total and it works flawlessly. If you use it through the Google Chrome browser, you can mirror the internet and you don't even need to use the app. I haven't tried the apps yet, but I am so thrilled to get something up and working without hours of tech support.", "verified": true, "helpfulness": "1/2", "author": "geas"}, {"rating": 5.0, "review": "Works super fast from my phone, netflix, hbo go and youtube are quickly cast to the tv at the touch of a button. A bit more cumbersome from the Chrome browser on my laptop but still works well for netflix and youtube and websites (like having a giant monitor). Tried to stream local media through the Chrome browser, my laptop has issues with broadcasting 720p video but music and photos are fine (this is likely due to inadequate graphics card and cpu/ram). Can't wait until Chromecast is integrated into more online streaming apps/sites like TWCTV etc.", "verified": true, "helpfulness": "0/0", "author": "Angela O Leung"}, {"rating": 5.0, "review": "I bought one on day 1 and I love it. I'm tired of switching it back and forth between my two TV's, so I bought a second one on black Friday for $30 (can't beat the price - even the standard MSRP is great for what you get). I know, first world problems.", "verified": true, "helpfulness": "0/0", "author": "Joseph M. Wilson \"Joey Wilson\""}, {"rating": 4.0, "review": "Generally very good for what it does. Would be more useful if there was a chrome browser for iphone, which would allow casting browser content to TV. It would also be nice to be able to cast pc screen to tv, and not just chrome browser content.", "verified": true, "helpfulness": "0/0", "author": "Donnie Enns"}, {"rating": 4.0, "review": "Nice product with a great price. Needs to work with more applications. Limited to Netflix, Hulu, You tube for now. I am sure Google will introduce more apps on CC in the near future.", "verified": true, "helpfulness": "0/0", "author": "P. Kumar \"Bheemax\""}, {"rating": 5.0, "review": "Works as it says. Now I am thinking about canceling my direct TV and just use this. Highly recommend to anyone. Affordable and does the job", "verified": true, "helpfulness": "0/0", "author": "steven a masters"}]