[{"rating": 5.0, "review": "It is important to note that this doesn't have the kind of depth of features of something like a Google TV or Apple TV device. However, for the price tag ($35 when I purchased it), it's a very impressive product that performs extremely well.Setup was impressively easy. Even as a computer programmer, I was mystified how it auto-detected the Chromecast at first without Bluetooth or the device being connected to the internet, but I have since learned that it (semi-obviously in retrospect) uses an ad hoc WiFi connection to do so. Regardless, it makes the setup process incredibly painless.Currently, the device can have a \"native\" cast from an app setup to use the Chromecast SDK or a \"tab\" cast from a Chrome tab. I ordered mine on release day, and when it arrived, the only non-Google app to support native casting is Netflix, however, many developers have already publicly expressed that they are looking into implementing the SDK, so I'm sure the comparative lack of apps capable of native casting will be a very short term issue.Tab casting, on the other hand, just mirrors a Chrome tab exactly on the Chromecast in real time. I have heard that people with slower computers have had issues with video playback, but I had no issues whatsoever myself tab casting a 1080p video on a Core i7-equipped computer. Watched all of Ocean's Thirteen that way without any stuttering or hanging at all.My only complaint is that I am 100% sure that my TV has HDMI 1.4, and yet I cannot get it to power the Chromecast without the bundled power adapter. Apparently many others have had this issue. However, the power cable is not that inconvenient and can even be plugged into a USB port on your TV if it has one available to avoid having to take up precious plug space.All in all, for the price tag, however, I am very impressed with the device, and it's a great way to add powerful functionality easily, cheaply, and quickly to any HDMI-equipped screen.", "verified": true, "helpfulness": "3/4", "author": "Thorne Melcher"}, {"rating": 5.0, "review": "EDIT: I will post pictures later on tomorrow.EDIT#2: You must have an HDMI port on your T.VEDIT #3: NEXTFLIX PROMOTION IS NOW OVER!!!!!First I would like to ask who ordered it?Okay so to start with my first impressions. So when I received the device, the packaging had a very clean style and overall very good looking. Now for those of you who don't know what this device is I'll tell you. It basically streams video from your computer to your T.V. With that being said it is like having your computer hooked up to your T.V via HDMI but wireless.My first impression was different than I thought, the first thing I realized is the dongle needed a power source at all times via its own AC adapter. This was not a deal breaker but I hoped it would have powered itself.(You can also use the usb power from your T.V's USB port) The dongle is very sleek, and seems pretty durable. The device did come with a HDMI extender which was optional, it says it is used to improve fit (as it might not fit behind all tv's) and improve Wi-Fi connection. I did not use it because it fit perfectly and it wasn't a tight fit. The device was very easy to set up, it took about 3-5 minutes. You had to download the chromecast app which helps you configure the settings for the device and connect it to your wifi, and it also downloaded the chromecast add-on. Overall very easy and fast to set up.To use the device it must be on the same network as you device you're streaming from. Once you have set up everything you are good to go, you can stream youtube, netfix, etc and any webpage directly to your tv wirelessly.This device works with Android phones and Tablets, iOS devices, iPhones, iPods, and iPads, it also works on OS X ( Mac )While using the device for a couple hours I noticed that the quality is amazing and, the delay is that bad considering I am sitting almost all the way across the house.I haven't even talked about the icing on the cake yet. Included with this purchase you get 3 free months of Netflix. How does this work? Well if you order it from amazon it gives you a 3 month code. Now if you add the Netflix, $8 a month for 3 months that is $24, andthe device only cost $35 you have only paid $11 for the device!!!My overall opinion is the device can only get better from here, I noticed going into the Chromecast app that the device had a firmware version, meaning all they can do now is upgrade and get better. I highly recommend getting this device as it has many positives and is worth the money you pay.", "verified": false, "helpfulness": "1/2", "author": "Flix"}, {"rating": 5.0, "review": "Completely flawless. I find the YouTube playback quality superb, it doesn't have the framerate issues caused by Flash on the desktop. Completely butter smooth 1080p.  Even in an area of my home with poor WiFi.Tab casting is impressively good especially for a beta.Love the Play Music interface too.Just amazing how elegant it is, just pop open an app on your phone/tablet, hit a button, and you're off.  I don't know when Google added the functionality to these apps but it was right there waiting as soon as I had the Chromecast up and running, which took less than 3 minutes.Buy, Buy, Buy!", "verified": true, "helpfulness": "1/1", "author": "chambo622"}, {"rating": 1.0, "review": "This is the probably the worse streaming device on the market.  Really!  I don't understand all those high ratings.My experience is as follows:1.  Receive package with product - Nice looking.2.  Take product out and try to plug into back of T.V. - NOPE Will not fit in the space for the HDMI.  So I have to use the included HDMI cable and bend it to make it fit.3.  Realize T.V. has no USB port so I have to plug into power.4.  Now go to Set up:  CANNOT do set up with iPad; Go to computer - Have to download Chrome with Extension, then go to set up.  Okay.. So far not that big of deal (at this point I'm already 15 to 20 minutes into the setup - Not the 5 minutes advertised.5.  Set up complete.  First application I try:  Netflix directly from my Mac Mini running OS X 10.7.  I get a spinning Chrome Logo on the T.V Screen for a very LONG TIME - 15 minutes at least before I give up.6.  Exit the NetFlix streaming, but to my Surprise - the Spinning Chrome logo continues on my T.V. Screen - and I cannot stop it!7.  I unplug the Chromecast device to exit the Spinning Chrome Logo.  This does it.  But, to my surprise, I have to go back and do the SET UP All over again!8.  Next I try streaming Netflix again, now using my iPad.  Again, get spinning Logo on T.V. screen and repeat steps 6 and 7 again!9.  At this point, I'm already 1 HOUR into getting this to work.10.  I try a different site, and use the Chrome Browser to CAST a video - it works!11.  I try You-Tube, -- It works!12.  But, CANNOT get Netflix to work with it's \"built in support\".13.  Finally, I call Google Tech Support.  They answer phone fairly quickly and try to be helpful, but they CANNOT figure out a solution to get NetFlix to stream to the Chromecast.  I am on the phone with them for about 1 Hour!  They tech cannot offer any suggestions that work;  He just has me go down a bunch of restarting, resetting, router settings, etc. that are complete waste of time.14.  3 HOURS later from the time I received the Device, I still don't have NETFLIX working!  Give up and go to bed.15.  Next Morning, I decide to try streaming from Netflix Using the Chrome Browser TAB (instead of the built in Netflixt ChromeCast within the movie); This does it! -- Well Kinda -- Since it only streams the Video - BUT NO AUDIO.  NO SOUND.16.  I call GOOGLE Again, to figure out why I am not getting AUDIO on Netflix, Yet I do get Audio on You-Tube and other sites.  Again, Google Support cannot find a reason or solution, and nice lady has me spend at least another hour with resetting, rebooting, etc.17.  So Total amount of Wasted Time now is about 5.5 to 6 hours to no avail for Netflix streaming with sound.18.  I finally figured out a work around to get Netflix to stream with Audio.  I use a wireless speaker (Creative Labs D200 - very nice speaker) and set my Mac to output the Audio via BlueTooth to the D200 speaker placed near my T.V. Screen.  But now, I cannot use my full stereo speakers connected to my Big Screen (at least for Netflix streaming using Chromecast).19.  In the end, I've figured out (which I wish Google would have told me), that you cannot properly Stream Netflix on a Mac using the Chrome Browser Tabs as the audio is not supported for QuickTime for SilverLight.  And Casting directly from within the movie does not work (probably because of a bandwidth issue as it tries to send it in full resolution).My Old TIVO worked MUCH better and no hassle (it just finally died after many years of use).  I was hoping this would be just as easy.  Boy, was I wrong.Google Chromecast  is advertised as being Easy and plug and play.  Not the case at all!", "verified": true, "helpfulness": "23/73", "author": "- LC -"}, {"rating": 5.0, "review": "Before the Chromecast was announced, I was thinking about getting the Roku 3. The total cost with the HDMI cable and TV mount was keeping me from making the purchase. In total it would've been over $120 for the additional items. Good thing I waited, because this give me everything I wanted to stream Netflix for only $35. It's out of sight and simple to use. Searching for movies couldn't be easier and I no longer have to use my Xbox and pay for Xbox Live to access Netflix or YouTube.It's the best tech purchase I've made all year.", "verified": true, "helpfulness": "2/3", "author": "Dirk Da Silva"}, {"rating": 4.0, "review": "Wow, Google, you keep amazing me in so many ways! Actually, as I'm writing this review I'm watching Breaking Bad through Netflix! Luckily I beat the cut and scored the 3 months free of it. Anywho, this thing is a cinch to set up, however, make sure that you have a strong network (internet) connection and you're not far from your router. Nice clear picture, I can't wait to see what the future brings with this device.", "verified": false, "helpfulness": "0/0", "author": "Tyler"}, {"rating": 4.0, "review": "Really, this thing is super cool.  Unfortunately, it has yet to arrive!  But its the absolute best!  Go product of mystery!", "verified": true, "helpfulness": "0/16", "author": "Patch"}, {"rating": 3.0, "review": "PositivesA. Super quick setup until you are someone who messes around with router settings (if you do, you will know what to fix)B. All my iOS devices could cast YouTube/NetflixC. Cast a Chrome tab that is playing a movie and add another tab and browse as much as you want without disturbing the content being cast (just don't close the tab being cast or Chrome itself). I experienced no problem in casting as I have no need to watch both screens - my TV and my computer monitor! Casting quality is as good as it can be (using hdmi cable). Bye bye HDMI cables on the floor.D. Netflix played far far better than what I was experiencing when using over Wii or Sony BDP. A very pleasant surprise indeed. (I use Verizon dry loop DSL)E. Queuing works with mobile devices only and works nice and is a very handy tool if you have a get together at home.Not so niceA. Perfect experience if sharing from one device/one tab only. Gets terribly confused very often and you have no option but to close the apps/browser and start again fresh - no trouble whatsoever if you do not jump around devices/content too much - fix - Go to Chrome app and hit button for \"Stop Casting\" and try again.B. Dongle is hot when playing content.I consider Apple TV a far superior product, but only technically for its integrated experience.This little thing is a MUST for a household which does not have a wifi streaming device for their television. There is nothing better in the market.Update 16-Dec-2013After new update for Chromecast, facing lots of issues in streaming Netflix. YouTube streaming works well though.", "verified": true, "helpfulness": "1/3", "author": "Gaurav Prakash Mishra \"GP\""}, {"rating": 5.0, "review": "Set up for the iPhone was easier than for our Acer laptop.  Once set up, the picture quality is very good.  No more need toexpand the screen (youtubes, netflix videos) the dongle automatically provides full screen on your tv.You do have to click on the Chrome icon to get to netflix and youtube on our Acer, not so on the iPhone.We lucked out and bought the day it was announced which garnered us a 3 month free streaming of netflix ($23.97 value)Looking forward to future apps, hopefully Amazon.com!", "verified": true, "helpfulness": "0/0", "author": "L. Baraszu"}, {"rating": 4.0, "review": "I love the idea of this product and of course the price.It is limited to what it can do but the developers are working hard to push things out.I am excited to see its growth.I purchased this item, out of the box and into the TV, chose the hdmi port, followed the instructions on the screen and within 5-10 minutes I was watching netflix and listening to my music without any issues. I plugged this into the my receiver and worked with 7.1 surround sound like it was on a blu ray player. Awesome for the price, excited to see what is next.", "verified": true, "helpfulness": "0/1", "author": "Roman"}]