[{"rating": 1.0, "review": "Disappointing product ... video works but not sound and Google technical support had no clue how to solve the problem.", "verified": true, "helpfulness": "0/0", "author": "Goran Djuknic"}, {"rating": 1.0, "review": "I BOUGHT THE PRODUCT ON THE ASSUMPTION THAT I COULD GET PROGRAMS OR APPS LIKE NETFLIX. ( LIKE APPLE) THE ONLY THING THAT THIS IS GOOD FOR IS TO USE IT WITH ANOTHER DEVICE, IE COMPUTER.  I CAN WATCH IT JUST AS EASILY ON THE ORIGINAL DEVICE..  $40 BUCKS DOWN THE DRAIN", "verified": true, "helpfulness": "0/2", "author": "R WINSLOW M"}, {"rating": 5.0, "review": "Exelente", "verified": true, "helpfulness": "0/1", "author": "Keury Deschamps"}, {"rating": 3.0, "review": "I give Chromecast 3 stars because the set-up process was pain in my neck. It should not take 40 min and four or five attempts to complete the setup. I started the process of setting up with my Galaxy S5 smartphone, but the WiFi would keep switching between the router and the device, cancelling the process in the middle. I finally had enough and used my Windows laptop and Google Chrome browser (with Google Cast extension) to complete the process. It involved a few additional steps, but eventually I was able to finish it. Once finished, It works fine, but still better off with Windows/Chrome that with Samsung phone.", "verified": true, "helpfulness": "0/0", "author": "Old Bookie \"Pavel Z\""}, {"rating": 5.0, "review": "works well from my iPAD.  Only problems have been working with the Xfinity / Comcast router that I cannot control.", "verified": true, "helpfulness": "0/0", "author": "WhiskeyThief"}, {"rating": 3.0, "review": "Wish I could stream amazon on this", "verified": true, "helpfulness": "0/0", "author": "Shelli Willemarck"}, {"rating": 5.0, "review": "Had some difficulty getting it set up.... more than likely it was user error.  Otherwise we love it.  Beats paying for cable or satellite any day of the week.  I was a little apprehensive about switching to streaming at first with two toddlers but have learned it makes life easier because we can now watch Thomas and Friends whenever they want too.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "This is what TV streaming should be! I love the Chromecast. Vudu works way more consistently on the Chromecast than it does on my Roku Stick, so I find myself using the Chromecast more often.The only thing I wish it had was a way to browse for shows and movies directly on the TV with a controller, or using gestures on an Android device. I know that's not the point of the Chromecast, but I don't think it would be that hard to add that type of interface, and would complete with Apple TV and Roku to a higher degree. It's not a BAD experience to use your phone to find your shows, it just takes some getting used to. I love the Chromecast either way.", "verified": false, "helpfulness": "0/1", "author": "David"}, {"rating": 4.0, "review": "Pros - Almost everything. Very convenient affordable way to improve your entertainment setup. I use android and most Google services so this integrates really well.Cons - probably not as great without android phone/tablet. Clunky to cast from PC. Doesn't connect to 5ghz network.", "verified": true, "helpfulness": "0/0", "author": "Alex Orr"}, {"rating": 5.0, "review": "Bought it so my wife can watch youtube and netflix in the bedroom. Works Perfectly!! Turned our HDTV into a Smart TV and loving it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]