[{"rating": 5.0, "review": "I love all that is made available at a touch.  Love the beautiful pictures that come on during pause.  I actually  bought 2, one for the living room and one for the bedroom.  I cannot say enough words to describe how happy I am that I found Amazon Fire Tv'", "verified": true, "helpfulness": "1/1", "author": "Roberta Sue Atkinson"}, {"rating": 5.0, "review": "Performs as advertised.  MUCH faster and smoother than an older ROKU which it replaced.  Netflix and Amazon Video work flawlessly, as does Pandora.  I am very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Paul B"}, {"rating": 5.0, "review": "What a great little device! Easy to install and use. Only short fall is i can't run Dish Anywhere on it.", "verified": true, "helpfulness": "0/0", "author": "Margarethe Davis"}, {"rating": 4.0, "review": "I found this device so easy to navigate comparing to chromecast. However, even with prime it cost the same to watch a new movie like on demand. The good thing is we can stream from netflix which I think has a bigger selection on foreign movies and TV shows than amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Ana Maria Nimphie"}, {"rating": 5.0, "review": "Love love love the Amazon Fire TV!  Best feature of all is the voice search, which has never been wrong yet.  So easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Carrie"}, {"rating": 5.0, "review": "I HAVE NOT WATCH T.V. SINCE I PURCHASED THIS DEVICE I 'AM RECCOMENDING  AMAZON FIRE TV TO MY ELDERLY FRIENDS WHO CAN'T AFFORD CABLE T.V. AND THEY ARE BLOWN AWAY WITH ALL THE FEATURES AND THE PRICE. AND ALSO THAT YEARLY FEE AWESOME.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Coming from Chromecast, I've really enjoyed the Amazon Fire TV, I just hope you guys get some updates out soon and the ability to just 'power down' the unit. The bright white light when trying to sleep at night is kinda bothersome. Other than that, solid performance using PLEX/ and HULU Plus.*Side note, please allow a Prime only category.", "verified": true, "helpfulness": "1/1", "author": "Benjamin Ginther"}, {"rating": 3.0, "review": "I was excited when I learned about \"Fire\".  I like the new technology where you can search by voice without needing to type your search request.My problem is that I do not know all of the names of the movies or even the actors that I may want to see, making it difficult to find a show to watch.  The \"list\" brings up a lot of shows that are of no interest to me.  In ROKU, I can rate the program in Netflix or Pandora and the streaming source brings me additional programs similar to the programs that I may also like.Amazon Prime needs to work in a similar manner, without logging into Netflix or Pandora (I already have these services through ROKU and do not want to sign-up again through \"Fire\".  After Amazon Prime updates the \"Fire\" device to work like ROKU, it will be a better system then it is at this time, and then it will be worth the $99.00 + the Prime fees.", "verified": true, "helpfulness": "0/1", "author": "Alfred Humphreys"}, {"rating": 4.0, "review": "Like the non-buffering of videos... just wish Prime had more choices.  Like the Fire TV unit however.  Would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "Clouseau"}, {"rating": 5.0, "review": "This thing is fast, way faster than the Roku 3 I have. I love it. Voice search works great, but only works with certain apps like Amazons. Don't think voice search works for Netflix or Hulu. They need to add Aero and MLBTv so I can get rid of this rip off DirecTV. I can't wait. Oh, and HBO, who has to stop carrying cable and be available alone, I mean, what are they doing? I'm pretty sure you can get HBOGo on Fire, but you need to have a subscription to HBO thru cable or Dish Network (Directv won't let you use HBOGo even if you have a subscription, they're so bad. Contract is almost up!!!)", "verified": true, "helpfulness": "0/1", "author": "Kyle D R"}]