[{"rating": 1.0, "review": "This thing worked twice and has since completely crapped out. We have reset it at least 30 times and each time it craps out again. It's not worth it.", "verified": true, "helpfulness": "0/0", "author": "Ramy Badie"}, {"rating": 5.0, "review": "I used to stream off of my Playstation or laptop with a hdmi it would take a while and didn't like to wait. The Google chormecast saves me time and is so easy to set up! I love this so much and showed it to my family, now we have 3 in the house! It'd great if you have a good phone so anything you watch on your phone can be streamed to your tv. I basically make my tv into a smart tv by these device.  The Only problem Is That My Sister Always changes What I'm Watching just to upset me.", "verified": true, "helpfulness": "0/0", "author": "Raul"}, {"rating": 1.0, "review": "At first it was fine, but updates have broken it and it will no longer work on my Sony Bravia. LG is fine. Be sure to Google your model before you buy. Cannot recommend.", "verified": true, "helpfulness": "0/0", "author": "Steven C. Plutte"}, {"rating": 5.0, "review": "Works Great and a good price.", "verified": true, "helpfulness": "0/0", "author": "Erik M"}, {"rating": 3.0, "review": "Keeping tv connection and streaming of long videos could use some work but is nice to have", "verified": true, "helpfulness": "0/0", "author": "Johnny Johnston"}, {"rating": 4.0, "review": "works", "verified": true, "helpfulness": "0/0", "author": "Ellery Wick"}, {"rating": 3.0, "review": "It works well, but since it won't do prime, I wish I had tried the amazon product. I'll probably end up having both.", "verified": true, "helpfulness": "0/0", "author": "Bernie Bergen"}, {"rating": 1.0, "review": "Never could get Chromecast to work and I had to return it.  Amazon.com's return policy is great!  Thank you Amazon.com!", "verified": true, "helpfulness": "1/1", "author": "bkcr8on"}, {"rating": 5.0, "review": "excelente Producto", "verified": true, "helpfulness": "0/0", "author": "Luis Santander"}, {"rating": 5.0, "review": "Easy installation and works great", "verified": true, "helpfulness": "0/0", "author": "MTD"}]