[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Tabajara Silva Barros Sobrinho"}, {"rating": 4.0, "review": "I have one on each TV.I bought more 2 to give as present.Bad thing, I don't have an app to cast video files from my computer or my cloud.", "verified": true, "helpfulness": "0/0", "author": "Vankfire"}, {"rating": 5.0, "review": "I should have bought one of these when they first came out.  Absolutely awesome.  Provides excellent picture quality, and it is so simple my 4 year old figured it out in a few minutes.  Now we can watch HBO GO, Netflix, and Prime on our dumb tvs.  Works with my IPhone,  and my Android tablet.  No complaints, I plugged it in, connected to it from my cell phone, and was watching HBO GO in under 10 minutes.  Once the playback starts, it does not need your phone/tablet to even be turned on any longer.  Not sure how that is possible, all I know is that it works.  And they kept it simple, any device connected to your wifi can control it.  I liked it so much I bought a 2nd one so I could watch HBO GO on my Vizio smart TV that doesn't have an HBO GO App.If I had to complain, I would ask for a traditional remote control, but then again I always have my cellphone close by...", "verified": true, "helpfulness": "0/0", "author": "Stephen M."}, {"rating": 5.0, "review": "It works great!!!", "verified": false, "helpfulness": "0/0", "author": "Gabriel Castro"}, {"rating": 3.0, "review": "I'm only giving this 3 stars since we had so much darn trouble installing it. Finally got it installed worked great, then when we had to get a new modem install we lost the transmission to it again. Just haven't had the patience to install it all over again. But when it works its great.", "verified": true, "helpfulness": "0/0", "author": "Beverly Short"}, {"rating": 3.0, "review": "Chromecast was awesome until about a month in and then it stopped working. I am currently trying to return it for a new one since it is still covered under the manufacture warranty.", "verified": true, "helpfulness": "0/0", "author": "Whitney Deal"}, {"rating": 4.0, "review": "Very good item, easy to handle this with the apps in smartphone.", "verified": true, "helpfulness": "0/0", "author": "Luiz Paulo"}, {"rating": 5.0, "review": "Amazing product. Can't beat quality, price and function of this little device.", "verified": true, "helpfulness": "0/0", "author": "Allison Lamkay"}, {"rating": 5.0, "review": "Very nice! Podem comprar que funciona bem ;)", "verified": true, "helpfulness": "0/0", "author": "Bruno Duarte Silva"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Harrry J. Jacobs"}]