[{"rating": 4.0, "review": "Pretty nifty little device. I wish it were easier to stream content other than Netflix and YouTube though.", "verified": true, "helpfulness": "0/0", "author": "John W"}, {"rating": 2.0, "review": "It's good...I got it for 35$ about caople of weeks back now available at 26$ at Best buy target etc..", "verified": true, "helpfulness": "1/6", "author": "Rohit"}, {"rating": 5.0, "review": "finally stream my stolen movies to my tv!!!  chromecast", "verified": true, "helpfulness": "0/1", "author": "Y. Hassell-Herndon"}, {"rating": 3.0, "review": "Good service.  Good product but for stream from my PC (not internet) don't perform well.", "verified": true, "helpfulness": "0/0", "author": "Jose Lopez \"bandi\""}, {"rating": 4.0, "review": "Was extremely easy to setup and I can do everything wire-lessly now. Great replacement for all the hdmi cords that I used to have behind the TV. I can move this around from TV to TV and use it all over my house and I can use it on every device. Only caveat for tablets and smartphone devices is that you can't stream things that are on the web it can only stream things from Apps. So I can't stream Hulu.com or any website on the Web App from my tablet or smart phone. You can only stream Apps and there are a list of Apps on the ChromeCast App that is downloaded to the device.", "verified": true, "helpfulness": "0/0", "author": "Casey L"}, {"rating": 5.0, "review": "excelent", "verified": true, "helpfulness": "0/1", "author": "JORGE MUNOZ PACHECO"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/2", "author": "Dan"}, {"rating": 1.0, "review": "I was very excited to receive my Chromecast stick, but was soon disappointed to discover it only works with a limited number of phones.  I have a Pantech smart phone and was unable to use features such as Phone Cast or Phone Mirroring.", "verified": false, "helpfulness": "1/3", "author": "Cap Art \"Cap Art\""}, {"rating": 3.0, "review": "If this product supports full-mirror function for more different modes of smart phones, it would be perfect.I use Mi 3, it doesn't support.", "verified": true, "helpfulness": "0/1", "author": "David Chiu"}, {"rating": 5.0, "review": "One of the best invertion I have purchase,", "verified": true, "helpfulness": "0/1", "author": "Angel Olavarria"}]