[{"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Rene Garza"}, {"rating": 5.0, "review": "Well let me say I buy a lot of stuff on amazon,but this Google Chromecast  is without  question is one of the best item that I have ever bought.It did lack instructions but you can figure it out,and youtube will give you everything you need to know,including  google.It up and running and for 7.88 Netflix  you watch all the movies you want,cartoons for the kids.I think it a good investment for 35.00", "verified": true, "helpfulness": "0/0", "author": "William Lee Noland \"billy lee noland\""}, {"rating": 3.0, "review": "Does a nice job. But not consistent with playing flash files. I dont know if others have the same problem.", "verified": true, "helpfulness": "0/1", "author": "riw"}, {"rating": 4.0, "review": "Exactly what I need. I'm on my second one. Hopefully this one will last more than one year.", "verified": true, "helpfulness": "0/0", "author": "Michael William Betts"}, {"rating": 4.0, "review": "Cool gadget. Would be great if it did a few other things. Casting my screen is great sharing videos and pictures with the family. I just expected it to add a certain \"magic\". Works great for what limited things it does.", "verified": true, "helpfulness": "0/0", "author": "Mike Williams"}, {"rating": 4.0, "review": "These are cool if you understand the limitations of the device.  You need another device that is compatible in order to play media.  In the price range, there is no other device that offers everything this little wonder does.", "verified": true, "helpfulness": "0/0", "author": "Zer0"}, {"rating": 4.0, "review": "Works well I am really enjoying being able to cast from multiple devices such as phone, tablet, and laptop.", "verified": true, "helpfulness": "0/0", "author": "John Pisini"}, {"rating": 5.0, "review": "Love it, but the device stopped working twice and I had to reset it. Possibly my internet to blame. Works consistently otherwise, so I'll be buying more and gifting.", "verified": true, "helpfulness": "0/0", "author": "Lisa Yarde"}, {"rating": 1.0, "review": "Set up was difficult.", "verified": true, "helpfulness": "0/0", "author": "MtnMan"}, {"rating": 4.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "Simone Frotas dos Reis"}]