[{"rating": 5.0, "review": "omg i love this thing. i used to stream netflix through my Wii, but that thing is on the fritz now. i got the chromecast just in time. also it is fantastic to use with other apps like watchESPN and youtube. with the new beta version of chrome for android, you can cast any video that comes through the browser. this is really nice when the wife and i are feeling kinky and want to watch something naughty ;)", "verified": true, "helpfulness": "0/0", "author": "Evan Kostishak"}, {"rating": 5.0, "review": "Works as advertised, worth the cost. We carry one to Florida with us and use it there. We are not techies, but it was an easy set up.", "verified": true, "helpfulness": "0/0", "author": "Richard A. Teichman, Jr."}, {"rating": 5.0, "review": "Everything ok", "verified": true, "helpfulness": "0/0", "author": "Andres Garagorry"}, {"rating": 5.0, "review": "Love it ! Easy to connect . Highly Recommended", "verified": true, "helpfulness": "0/0", "author": "Hussam"}, {"rating": 4.0, "review": "I purchased this to use on my TV of the family room.It's great cheap solution to cast media from portable device such smartphones and tablets.It's very easy to use once set up.My niece and nephews love casting videos off their smartphone and tablet onto the TV when they visit.I love being able to watch my TV shows off my phone and tablet on the big screen TV.Unfortunately, I do run into some apps that still hasn't worked out their bugs to run on chromecast.I use it with my iPhone, Galaxy S4, iPad and Nexus tablet, and it works better for my android devices than my iOS Apple devices.It's also great that Google still provides updates for whatever issues it comes across.I would definitely recommend it for it's cheap price and functionality.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "I use Google Chromecast pretty much everyday. The investment is totally worth it. I got rid of cable and just use Chromecast for Netflix, HBO GO, Crackle, and Hulu.", "verified": true, "helpfulness": "0/0", "author": "Tayze"}, {"rating": 4.0, "review": "I was pleasantly surprised when I finally tried one of these.  The work well and the desktop plugin for chrome makes it easy to stream just about anything you can watch online.  There are also a few apps that allow the streaming of video from local sources (though there's still no VLC plugin yet.)It's kind of weird having no direct control over the chromecast but it's also nice to be able to use devices that you already have available and not have another keyboard laying around for a media center.Buying a few of these really saved me from running a lot of cables in my new house.  The only thing that could make this better is if I could stream the same thing to multiple devices at once.", "verified": true, "helpfulness": "0/0", "author": "Aaron"}, {"rating": 4.0, "review": "works well with youtube and netflex, but lags with the desktop extension button", "verified": true, "helpfulness": "0/0", "author": "Tee"}, {"rating": 5.0, "review": "Possibly one of my best purchases ever. Streaming content to it works great. Highly recommend this to anyone looking for an alternative to high cable/satellite prices. Super easy to install and configure. Takes minutes.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 1.0, "review": "I am very disappointed with this product.  Your iPad and iPhone are not companions for this thing.", "verified": true, "helpfulness": "0/0", "author": "Crystal Lake IL"}]