[{"rating": 5.0, "review": "Google Chromecast does exactly what it says it does-- puts your computer screen, YouTube, and more on the TV. The setup was straightforward, fast, and fairly easy. And I haven't had any problems with it since. It's great to bring the family together with stand-up comedy clips, SNL shorts, favorite songs, uploaded GoPro videos, and much more. And once you get it set up, it's always easy to access. Just by clicking the Chromecast icon on your YouTube video or browser, it'll load up to the TV. Nice, fun product.", "verified": true, "helpfulness": "0/0", "author": "K. Bystrom"}, {"rating": 4.0, "review": "Overall I'm happy with this product.  It doesn't (ironically) stream directly from the Chrome browser as well as I'd have liked, but Netflix, Hulu Plus, other apps with an integrated ChromeCast feature work pretty flawlessly.  For the ability to stream virtually anything to your TV via Wi-Fi, it's definitely worth the low price.  I can only imagine that the Chrome streaming will improve with updates to software and firmware.", "verified": true, "helpfulness": "0/1", "author": "Cody S."}, {"rating": 5.0, "review": "If you watch Youtube, Netflix, or Hulu Plus then this device is a must. Simply choose what you want to watch from your phone, tablet, or computer then cast it to your tv. Quick, easy, and in HD...love it.", "verified": true, "helpfulness": "0/0", "author": "Barnone"}, {"rating": 5.0, "review": "I was initially hesitant to purchase one of these since it seemed like a pointless device for me. I have a Netflix subscription and use Youtube quite frequently, but when I'm away, I can always pull that up on my phone to watch or plug in my laptop with an HDMI cable. For home use, I already have an Apple TV and the next gen consoles that could stream anything I desire. I had no need for a Chromecast.Well, I was recently in a situation where I wanted to pull up a Netflix show for a friend,  but did not have my laptop and could not feasibly watch it on my phone with another person. Suddenly, I saw the value of the Chromecast. I bought one the next day and tried it out. Within 20 minutes (there was an initial update to download), I was connected to my wireless network and could access netflix and youtube on my phone and cast to the Chromecast. Perfect! Now I can just keep this in my purse and pull it out when I need it.The really cool thing is it's ability to stream your own media.  Now this does take some setup, and unfortunately, file support is limited to MP4 and MKV with AAC audio, but once all your media is formatted for the Chromecast, you're golden! More information on file support is here: [...]First-off; you need to format your media. Handbrake will easily batch convert your files overnight while you sleep. For converting the audio in MKV files, MediaCoder works well. Just stream copy your video and convert the audio to AAC.Secondly, you need to get a casting app for your media. Allcast is $5, but will play your videos as long as they are on the proper format.I have a Synology NAS at home and using the DS File app, I can stream my properly formatted files from my phone with Allcast and have it playing on my Chromecast. I can also use the DS Video app and stream files directly to the Chromecast.Of course, if you don't have your own digital library, Netflix and other internet services work well. Unfortunately, Amazon Instant Video is not supported, and may never be, since Amazon is pushing their own devices now.There are a few drawbacks to the device. The most notable is that you must be connected to a wireless network that is configurable. This means that you can't use your chromecast on public wifi or a hotel, library or school. It would be nice if you could do an adhoc connection with your phone or computer to the chromecast to stream local media, but for now, that's not possible.As mentioned, the lack of file support is frustrating and if you want all of your media available to cast, it can be time-consuming to convert everything if you don't already have your media formatted correctly.There are still more potential with this device, but for $35, it's a great start.", "verified": false, "helpfulness": "1/1", "author": "Keri Ellis"}, {"rating": 5.0, "review": "I really was hesitant to buy this product but I am so glad I did. I love it.Easy installation and set up.", "verified": true, "helpfulness": "0/0", "author": "Sandra Cook"}, {"rating": 5.0, "review": "You could get a smart TV...or you could get this, much cheaper, easy to use product. It's great. Get it.", "verified": true, "helpfulness": "0/0", "author": "Anthony Hernandez"}, {"rating": 5.0, "review": "When I first bought this product I could only use it with my tablet because I was running XP on my desktop and wasn't blown away by it.  However once I upgraded my PC when XP support stopped I finally got to see the potential of the Chromecast.  I can cast any window from my PC to the Chromecast and cast any of my vids.  Love it especially for $35.", "verified": true, "helpfulness": "0/0", "author": "seavillebri1"}, {"rating": 1.0, "review": "I purchased 2...i really regret it now....Almost no video formats stream to it, most formats make AWFUL screeching sounds and skipping when streaming, no screen mirroring, 3/4 of all video formats wont even play....claims to support .mkv natively but doesnt play .mkv's...all good streaming apps cost another $5...need 3rd party app for ANY home media you want to stream on chromescast...as far as im concerned...its just not there yet...maybe in 12-24 months when they update all the features into it, sure....but as of 05/25/2014 unless the ONLY apps you have are netflix/hulu/pandora/youtube then its a waste, better off waiting until google steps their game up", "verified": false, "helpfulness": "0/0", "author": "Giovam pugliese"}, {"rating": 1.0, "review": "I got this to watch my favorite tv shows as advertised by the description. However once you plug it in and set it up you realize very quickly it only works with 8 apps. So I can not watch the ABC, NBC or many other apps I had hoped to use. The only useful apps are Pandora and Hulu which are already on my tv. Kind of pointless unless you have zero apps on your tv.", "verified": true, "helpfulness": "1/1", "author": "I don't want a profile"}, {"rating": 5.0, "review": "Very simple installation. Once I plugged it in all my compatible devices (ipads, Nexus, laptops, computers, cellphones) were able to see it and I could cast to it with the simple tap of a button. Bought another for the bedroom and even some for some family members all of which love it. I would definitely recommend it!", "verified": true, "helpfulness": "0/0", "author": "Fangor"}]