[{"rating": 5.0, "review": "Chromecast is great if you have netflix or if you want to watch youtube videos on your TV. It's easy to setup and you can control with an Android phone, iOS device, or your PC. Google just needs to release the SDK so more apps can take advantage of it.  There currently are about 7.", "verified": true, "helpfulness": "0/0", "author": "TheDave1022"}, {"rating": 1.0, "review": "Very disappointed it does not allow me to play my personal content (pics and music) from my tablet to my TV.  If only allow for Netflix, youtube etc...  Most new TV's allow this already.", "verified": true, "helpfulness": "0/0", "author": "steven4704"}, {"rating": 3.0, "review": "Not much app support for the Chromecast, thought this was an alternative to AppleTV .. it isn't.  I gave 1 away and sold the other to a friend.", "verified": true, "helpfulness": "0/0", "author": "aindelicato"}, {"rating": 5.0, "review": "Easy to set up, works very well, picture quality excellent. We can control it with our smart phones as well as the laptop. The phones are more convenient controllers. Now we are waiting for it to cast Amazon content. Presently we use it just for Netflix. Often my wife is casting movies on the TV while I am watching something else from Netflix on my computer. Our second large screen TV does not have an HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Reading Chemist"}, {"rating": 4.0, "review": "Does exactly what I need it to. Send a video I found on YouTube on my iPhone and send it to my TV. The only drawback, hence only four stars, is that the sound goes thru the TV and doesn't get piped thru my stereo system when I have it set for TV.", "verified": true, "helpfulness": "0/0", "author": "Renee F."}, {"rating": 1.0, "review": "Worked great initially, then erratically, then stopped functioning completely. Support sucks. You shouldn't have to spend 30 minutes troubleshooting your system every time you want to watch a movie. If I could give it no stars, I would. Avoid. Buy Apple TV or anything else out there.", "verified": true, "helpfulness": "0/0", "author": "Another Customer"}, {"rating": 5.0, "review": "Works perfect with the phone app and the tv,  does every thing they said it would.  Worth the price for sure", "verified": true, "helpfulness": "0/1", "author": "Francis J. Wheeler \"wheels\""}, {"rating": 3.0, "review": "My Chromecast HDMI is working great, so I bought another for my son.  He's tried everything and can't get it to work.  We've gone over all the installation instructions, with no luck---so my rating is 2,5 -- an average, 5 for mine and 0 for his.", "verified": true, "helpfulness": "0/0", "author": "Sue Neumann"}, {"rating": 5.0, "review": "Easy set-up, opened the box, followed set-up on box for power,  inserted into the HDMI socket and followed the on screen display, the media player was set up in about 10 minutes. Now I watch great movies and what ever I want to.", "verified": true, "helpfulness": "0/1", "author": "thomas williams"}, {"rating": 5.0, "review": "Really enjoy the google chromecast I use the most to stream movies from my tablet to my tv and on top of that I watch a lot if YouTube videos that I'm able to stream.", "verified": true, "helpfulness": "0/1", "author": "Nick Pytell"}]