[{"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Lyle A. Roberts"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "jen"}, {"rating": 3.0, "review": "Doesn't work all the time, needed to unplug for an hour...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "it does what it is supposed to do", "verified": true, "helpfulness": "0/0", "author": "Malcom"}, {"rating": 5.0, "review": "I bought this because you can cast anything from a chrome web browser and it has not disappointed! Sometimes it has connection issues but I think that has more to do with my internet connection than the chromecast.", "verified": true, "helpfulness": "0/0", "author": "S. Boyland"}, {"rating": 5.0, "review": "I own several streaming devices and this one is hands down the best if you need to stream something quick and easily from the browser or your phone.  The Google Chrome browser on your desktop PC can install a simple extension called Google Cast that can play whatever you have in one of your browser tabs to your Google Chromecast on the TV.  What is great is that you can even stream the content on one browser tab to the TV and continue web browsing on another browser tab without effecting what is shown on the TV.It also supports streaming from your Android or iOS phone.  The great thing about how it streams is that after you tell it what to play with your phone, you can then turn off your phone and it will still continue to stream as long as your internet router is kept on.  It goes from your phone to the router to the Chromecast.  You won't use up your phone battery by streaming to the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Peter Roberts"}, {"rating": 5.0, "review": "It works fine. It does just what I was expecting for", "verified": true, "helpfulness": "0/0", "author": "Daniel Penagos"}, {"rating": 5.0, "review": "Get two of these because your wife will want yours.", "verified": true, "helpfulness": "0/0", "author": "Jonn Coleman"}, {"rating": 2.0, "review": "When it works it is nice, When it decides to disconnect for no reason its annoying. Would be better if i could turn my phone screen off when streaming movies.", "verified": true, "helpfulness": "0/0", "author": "Mike D"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Charles Fogle"}]