[{"rating": 5.0, "review": "Love it! It works well and is easy to use. Wifi connection is good even without the extender.", "verified": false, "helpfulness": "0/0", "author": "dtrmnddream"}, {"rating": 4.0, "review": "I purchased the Chromecast about a month ago and have been pleased so far with the exception of the wifi range. The manual tells you to have it within 20 feet of your wireless router and this is very important to avoid premature hair loss. When I first tried to setup the Chromecast I had a real problem getting it to connect to my wireless network. The tv I was using it on was upstairs and my router was downstairs. Without measuring the distance between the two I figured I was probably close to the 20 foot recommendation so I ended up plugging the Chromecast into my downstairs tv which sits within a couple feet of the router and no surprise it connected immediately with no issues. After connecting to my network I took the Chromecast back up stairs and plugged it in and it worked immediately.I have used the Chromecast to stream Netflix, HBOGO, YouTube, and Pandora. The only issues I have had is some slight buffering (probably due the the distance between the Chromecast and the router) and a couple of times I've had to unplug it and plug it back in because it wouldn't respond to commands from our devices but other than those minor issues I have been very pleased overall.I would recommend the Chromecast for anyone who needs an expensive device to stream video.", "verified": true, "helpfulness": "0/0", "author": "R. Nicholson"}, {"rating": 5.0, "review": "works like a charm - bought once for each of the kids apartments too!", "verified": true, "helpfulness": "0/0", "author": "J. L. Halliday \"JLHalliday1\""}, {"rating": 5.0, "review": "My daughter lovessssd it.", "verified": true, "helpfulness": "0/0", "author": "AXEL RAMOS"}, {"rating": 5.0, "review": "First item came with defective USB power cable, so I had it replace. The new one works excellent and has the price of a good cable.... just without the cable. I like it.", "verified": true, "helpfulness": "0/0", "author": "Paris"}, {"rating": 5.0, "review": "GreT!", "verified": true, "helpfulness": "0/0", "author": "Rosemarie"}, {"rating": 5.0, "review": "It is great, runs really well from my Nook - I love it!", "verified": true, "helpfulness": "0/0", "author": "Susan Brooks"}, {"rating": 5.0, "review": "My husband love Chromecast so much he want to purchase a another, I would admits it's easier than using the laptop which have a be connected Aurum Cables 3.5mm Male To 3.5mm Male Stereo Audio Cable and PTC Mini-DVI to HDMI Adapter with 6ft HDMI Cable for Macintosh and more. So yes go ahead and buy it,  on like my hubby i'll just move the one we have from living room to bed room.", "verified": true, "helpfulness": "0/0", "author": "DC"}, {"rating": 5.0, "review": "i am casting stuff left and right to my tv, youtube, vudu, netflix, i do wish that i could cast from amazon prime however, hint hint amazon! great lil gadget!", "verified": true, "helpfulness": "0/0", "author": "carly s."}, {"rating": 5.0, "review": "Chromecast is great! I don't have cable and stream everything from either my phone or laptop.", "verified": true, "helpfulness": "0/0", "author": "Danielle"}]