[{"rating": 5.0, "review": "I ordered one the day it came out because I loved the concept, especially the independence from a device once your program is running. I bought it for my parents who are technologically slow, and they have no problem using it from an iPad, iPhone, or antiquated laptop. Not good for streaming video from a web page. Too much lag. Too much lag to use as a second screen in general, except for stationary presentation. Supported apps work beautifully. Price is right.", "verified": true, "helpfulness": "0/0", "author": "Duane"}, {"rating": 5.0, "review": "Chromecast is a cheap and easy way to get video from Netflix and YouTube onto your TV. I'd like more apps but at this price who's complaining?", "verified": true, "helpfulness": "0/0", "author": "Joao Felipe Coutinho de Sousa"}, {"rating": 1.0, "review": "Bought in Nov 2013. Started off working great, but then immediately started having issues.  I had to start re-booting the chromecast eventually it just stopped working all together.  I need something more reliable.  Will check out Roku and see how that goes.", "verified": true, "helpfulness": "0/0", "author": "J. Kong"}, {"rating": 5.0, "review": "Easy setuo, had it up and running within 15 minutes.  Be sure to download the app first, that way setup can be done within 5 minutes.", "verified": false, "helpfulness": "0/0", "author": "John Vaughan"}, {"rating": 5.0, "review": "I've had my Chromecast for about 6 months and I love it. I take it with me when I go hang out with friends or family. Apparently I dropped it in my front yard where I park my truck and haven't seen my Chromecast for about 2 months now. Since then it has rained 3 times. One rain of which lasted 3 days and flooded the entire area. I found my Chromecast this morning embedded in the ground scratched up from rocks and a little discolored. I thought this thing is trash. I shook it hoping there wasn't any water in it. Couldn't hear anything. So I plugged it into my T.V.This thing still works! I'm watching Netflix on it right now. It's been through rain, floods, sun, my truck tires running it over and mud and dirt. This awesome thing still works with now problems.", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 5.0, "review": "Great product with unprecedented results . I was very much blown away . Hooked up to my tablet and my iPhone with ease", "verified": false, "helpfulness": "0/0", "author": "Marion"}, {"rating": 4.0, "review": "Super easy. Totally addicting. Why do I have cable when I have this?!? Great having the beautiful pictures on my big flat screen instead of a black square in the room. Music, movies, tv shows I can't wait until people start making more apps to use on this!", "verified": true, "helpfulness": "0/0", "author": "Giovanna Anthony"}, {"rating": 5.0, "review": "Smooth streaming, and easy to use. I can only hope that more sites will be added in the future. This product is too good to be limited to only a few sites.", "verified": true, "helpfulness": "0/0", "author": "Lyle O. Martin"}, {"rating": 4.0, "review": "In general this device works very well, I'm very happy with it. There is occasionally buffering, which is annoying.  I doubt it's because of my internet.  I had apple TV as well, it never had the issue.", "verified": true, "helpfulness": "0/0", "author": "Fan"}, {"rating": 5.0, "review": "I love Chromecast! I use it to cast movies from my phone, Samsung tablet, laptop and pc. Its great to be able to 'big screen' all my purchased movies. I copied all my dvds to my pc, so  I can watch them on the tvs that dont have the blu ray attached.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]