[{"rating": 1.0, "review": "you cannot display personal files to screen ...you cannot listen to personal mp3's eitherframe dropping while playing a video in side chrome browser", "verified": true, "helpfulness": "1/2", "author": "12Y OB-User"}, {"rating": 5.0, "review": "It works perfectly as it is supposed to. My family has come to use the Chromecast to stream from youtube and netflix using the smart phones as a much more user friendly and convenient interface.", "verified": true, "helpfulness": "0/1", "author": "Matthew T. Byrne"}, {"rating": 3.0, "review": "There's no reason to get this if you have a modern game console, bluray player, or computer connected to your TV already.  Lack of IR remote control input frustrates usage and control.  Poor Chrome screen mirroring.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Great product. The Google Chromecast works well, with no problems. I wish there were more things to screen, but rumor has it that more are soon to come.", "verified": true, "helpfulness": "0/0", "author": "Joshua M. Morgeson"}, {"rating": 3.0, "review": "Too much trouble for me to fiddle with to get it to work properly. While I was in Chrome browser it could not find my device. Sometimes it would. But most of the time it wouldn't. Returned it.", "verified": true, "helpfulness": "0/0", "author": "underdog2904"}, {"rating": 5.0, "review": "Works great , Now i can watch you tube on my t.v. and listen to music . Meets my expectations", "verified": true, "helpfulness": "0/0", "author": "TROY JACKSON`"}, {"rating": 5.0, "review": "I own 2 chromecasts, one in the living room and one in the bed room. They work great, especially after the updates. Sometimes they need to be reset or re started but that's to be expected.", "verified": true, "helpfulness": "1/1", "author": "Mike Joe"}, {"rating": 5.0, "review": "Great product and affordable.  It was easy to install and my son can now enjoy the tablet movies even more.  You can stream it all.  Pictures...video....do not hesitate to buy...well worth it.", "verified": true, "helpfulness": "0/0", "author": "Konscious"}, {"rating": 3.0, "review": "Works great with YouTube but casting videos playing in Chrome browser is terrible. Already have a Roku for other streaming content so I pretty much only use this for YouTube.", "verified": true, "helpfulness": "0/0", "author": "Nicholas L. Taylor II"}, {"rating": 5.0, "review": "We picked this up to stream some TV series and movies from our ipad to the TV and it has worked out great!", "verified": true, "helpfulness": "0/0", "author": "Daniel Zolnierz"}]