[{"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Brad F. Paulson \"max5640\""}, {"rating": 5.0, "review": "Excellent device just a little too sensitive", "verified": true, "helpfulness": "0/0", "author": "Barba"}, {"rating": 5.0, "review": "The box works flawless with lighting  speed. With a decent  wireless signal there was no buffering  or connection  issues. You can find a good movie to watch easily and the music is great.", "verified": true, "helpfulness": "0/0", "author": "G. Loguidice"}, {"rating": 5.0, "review": "Wonderful to have. fantastic for watching good shows especially for the little ones in the family.", "verified": true, "helpfulness": "0/0", "author": "Sylvia"}, {"rating": 4.0, "review": "Best Android based TV box I've used.  No need to Jail Break/Root the device.  You can just side-load whatever apps you want.  Very fast Amazon based GUI.  Has all the major internet streaming apps and Plex.  You can easily install Kodi/XBMC.  Good wifi performance.  Love the remote.  Paid $79.00 during the holidays.  I give it 5/5 rating.Update 3/29/15: The power supply for one of my Fire TV's blew today.  Amazon charges $19.99 for a replacement?  I hope this is an anomaly, because the first one didn't even last a year.  There are cheaper alternatives, but it seems that after paying shipping, you are only saving $5.", "verified": true, "helpfulness": "0/0", "author": "MARK A. WILLIAMS"}, {"rating": 5.0, "review": "Love it and easy to use. Glad I received it for Christmas.", "verified": true, "helpfulness": "0/0", "author": "foster,bevrly"}, {"rating": 5.0, "review": "This product actually WORKS.  Love the remote and the voice search capability as well as selection of shows--even has PBS channel!Haven't used the Fire TV app yet but if it works as well as the rest of the device Kudos to Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It's great!!!", "verified": true, "helpfulness": "0/0", "author": "Jack Johnson"}, {"rating": 4.0, "review": "Great device with a few minor issues. 1. There is no power off button. 2. Voice search only works for Amazon 3. Streaming from your phone to your fire tv could work better. I still love this device regardless of the few issues.", "verified": true, "helpfulness": "0/0", "author": "TL15"}, {"rating": 4.0, "review": "We received this as a Christmas gift and I installed it several days later. After about 10 minutes, when the Fire TV was on, everything else Wi-Fi Would screech to a halt, then the fire TV would constantly say no network connection \"try again later. We have FIOS with 75mb up/down, so I determined that was no the issue. I went with a hunch to upgrade the router, and that did the trick. It was an older Verizon router that I imagine did not have the throughput and possibly distance restrictions that the new one does. Now all Wi-Fi devices work fine (Kindle, phones, cams, etc...) while the Amazon Fire TV is active. As far as content, we have not had it long enough to see all the options and what programming it has to offer.", "verified": true, "helpfulness": "0/0", "author": "M. Lis"}]