[{"rating": 5.0, "review": "mess this up. I am so pleased with the ease of connection and accounts. Slight problem with speed of connectivity on Hulu Plus. Could be our cord or Comcast hasn't bought them yet. I did keep havin' to 'splain to Ricky that we still pay for our subscriptions to Prime, Netflix, Hulu, etal. He's all techie now:)", "verified": true, "helpfulness": "0/0", "author": "Daisy McRib"}, {"rating": 2.0, "review": "Save your time and get the Roku. The Fire TV is only good for Amazon Prime. The voice search only returns results for Prime. I thought this to be its weakest point. The shows on Hulu are blacked out for a few seconds when returning to the show after an ad. They need to fix these flaws to get me to plug this back in instead of the Roku.", "verified": true, "helpfulness": "2/3", "author": "Bill M."}, {"rating": 4.0, "review": "I won't go over what this product is. There are a thousand-odd reviews here, so that's just not necessary. What I will do is go over some of the issues and joys I've run into in my time with the Amazon Fire TV.First up, some quick background: I'm a cord-cutter. I haven't had cable TV in many years, and although I have an antenna connected to my TV, I never use it. Instead, I get all my shows and movies from a combination of streaming services and rental services. I use Amazon Prime, Netflix, Hulu Plus, Crackle, Ultraviolet, and a few others. I have owned every Roku made since they hit the market, including the Roku Stick for HDMI, the most recent Roku device (which got swapped out for the Fire TV, by the way). I have owned several versions of WDTV, including Live and Live Hub. I've owned set-top boxes from Panasonic, RCA, Samsung, Sony, and pretty much every other major player, and I've had lots of HTPCs and Android boxes, including the Ouya, all running various media centers including XBMC, PLEX, Windows Media Center, and J. River Media Center. I have also had every major console from last generation, though I haven't jumped on board the PS4 or Xbox One bandwagon, yet.I won't go over those devices. You can see my reviews (or others' reviews) in their respective areas on Amazon. I am just mentioning this to make it clear I'm no layman. I've been at this a while.I went for the Fire TV for a few reasons:► Faster system. Folks said it was faster than any Roku, and they're right. It's even faster at getting to my videos than the game consoles are. It's fast, people. No doubt about that.► Games and Apps with Bluetooth controller support. I don't need it as a replacement for my console, but it's a nice supplement.► Voice Search. When it's working for Netflix, Hulu Plus, and other apps, it will be amazing. Right now, it's still pretty cool.So far, I'm not disappointed. I am, however, a little stifled by some of the limitations imposed by Amazon:♦ Storage space is not expandable (yet?)This is frustrating because I ran out of storage for games and apps on DAY ONE. I understand I can keep stuff in the cloud, but then I'm uninstalling and downloading constantly to play the larger games. And this is early. What happens when the game/app library is vastly expanded? Amazon NEEDS to support external storage via USB. Limiting us to 5GB of usable storage is hobbling the system, and not doing themselves any favors if they want me to buy more games and apps.♦ No \"Favorites\" on the Home screen.They have \"Recent\", but I'd really like the ability to pin a few of my favorite apps and games to a strip on Home, instead of needing to go to the Apps screen and scroll through.♦ No way to scan through the Prime Video selection easily.They have \"Recently Added to Prime\" and \"Top Movies on Prime\" sections, as well as \"Top TV on Prime\" and \"Kids Movies on Prime\", but no way to look through all the Prime videos without also seeing the non-Prime videos. There is a \"Genres\" section, but it's populated by both Prime and non-Prime videos. This is frustrating, as the Xbox, PS4, and Roku devices all allow one to scroll through ALL Prime movies, instead of just \"Top\" movies or \"Recently Added\" movies.Yes, the Voice Search is great--- If you know what you want to watch. If you want to \"window shop\" for Prime movies to add to your watchlist, however, you can't do that except within the narrow categories they provide. Oddly, though, if you look at one movie in Prime, the \"suggested\" videos based on that one are from the wider Prime selection, which you ONLY see in this instance. The rest of the time, there doesn't seem to be an easy way to find this stuff aside from Searching for it, specifically.♦ No filtering.I hate (HATE) reality shows. I hate them enough that I don't even want to see their annoying show logo or cover art on my screen. Unfortunately, when I look through Prime TV selections, I have to scroll past tons of these shows that I WILL NEVER WATCH to find shows I do care about. I'd love it if, like Netflix, Amazon gave us some sort of questionnaire that asks us what shows we watch, and how often we watch them. Netflix's version doesn't work all that well, but you'd think someone at Amazon could figure out some way, if I answer \"NEVER\" to \"Do you watch reality shows?\", to make it so no reality shows appear in my lists. Alas, that's not the case.Worse, this happens in the \"Recently Added to Prime\" section, mixing big tiles for TV shows of all kinds with smaller tiles for movies. If I want to see what movies are on Prime, I don't want to scroll past a hundred reality shows, too.So I'm BEGGING Amazon to figure out how to make it easier for me to filter my results for video on the Fire TV. If nobody in this house is ever going to watch Duck Dynasty, why can't I make it disappear from my screen forever? Why can't I banish this stuff I'll never care about?♦Difficulty with audio support in PLEX.I'm not sure if this is an issue with the PLEX app, or with the Fire TV, but some audio won't play in PLEX. I've figured out how to get DTS to play through (You set the local streaming to 20mbps, enable ALL the audio checkboxes in PLEX settings, and set it to \"Force Direct Play\" and DTS works), but I've found that some of the AAC encoded Dolby Surround audio tracks won't play under these settings, and you're stuck changing PLEX back to NOT supporting AC3, DD+, and DTS, and setting it to \"Android\" or \"Google TV\" instead of Direct Play, and then playing back a two-channel audio that will hopefully get decoded properly into a surround experience (but more often than not, it doesn't).For the layman, what this means is that the Fire TV is still not 100% playing nice with all Apps as of this writing, and will require a little more time to give the user a totally uniform, seamless experience from App to App. If you don't use PLEX (and you SHOULD use it) then this doesn't affect you (yet). If you do use PLEX, then all I can say is that the PLEX devs are aware of the problems and are working with Amazon to sort them out.♦♦♦Finally, this is not what I'd call an issue with the Fire TV, but with the Hulu Plus app itself: On TV shows, when it comes back from the ad break, the video for the show doesn't come back immediately. Sometimes it's a minute, sometimes less, but the audio track keeps playing. This is not an issue with the videos, as I've checked the same videos on other devices. This is specifically a problem with the way the Hulu Plus app handles the switch from advertisement video back to the main show's video. In short: There's a problem with the ads, Hulu... FIX IT.♦♦♦All this doesn't change the fact that the Fire TV is a great device. I'd give it 5 stars, but those minor issues need to be ironed out. Even with those issues, it's still the best streaming device I've had. No, it's not good for local media (nor is it really designed for it), but for streaming services it's fast, looks great, and does the job well. It has a great remote (though I miss the IR because I love my Harmony remote), and the game controller is pretty good, too.The Fire TV is a solid 4-star device that just needs to grow a bit. I hope Amazon is smart and lets it do so.*** UPDATE JULY 2014:So recently, Amazon pushed an update to the Amazon Fire TV that enables a few needed features. It's a step in the right direction. Here's what they added:☼ Music section. Right now it's only your Amazon Cloud Drive music, but they claim that in the future this will be the home of Amazon Prime Music (an excellent service!) on your Fire TV. I can't wait for that. For now, it's nice to listen to my music from Amazon's Cloud Drive. The menu has a nice \"shuffle all songs\" feature from the main screen. It's well designed within the parameters of the Fire TV GUI, and I'm pleased with it. Now bring on Prime Music!☼ Prime Video (Movies/TV) section. A previous complaint was that you could only search through specific offerings in Prime Video, such as popular or recently added. Well, this new section has the ability to search through Prime Videos by genre. It's just what they needed! I don't always know exactly what I want to watch, so the voice search won't help me there... I need to \"surf\" and pick something that just strikes me as interesting, sometimes. Now I can do this, and I'm grateful.☼ Kids section. I turned this off, but if you have kids around and want to use the free time function, now there's a whole section for it. I can't review this as I don't use it, but it's there, and this shows Amazon's willingness to listen to users and add things that seem to be desired by the user base. It's a good move by Amazon. I approve.So there you have it. A few software tweaks that have made this four-star device into a slightly better four-star device. I can't quite give it that extra star, but if they ever open the Fire TV up to external storage, I may be persuaded.", "verified": true, "helpfulness": "6/6", "author": "Raven Wilder"}, {"rating": 5.0, "review": "This is a great accessory to add to your entertainment equipment. It was very easy to hook up.The loading speed and picture quality is very good.Worth every penny spent on it.", "verified": true, "helpfulness": "0/0", "author": "Wilbur"}, {"rating": 5.0, "review": "Works great so far.  \"Voice requests\" has worked 100% of the time so far.  I have only used it for one day. :-)  I'll update in a week or two.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey J Haggerty"}, {"rating": 3.0, "review": "I wanted to be able to browse Amazon Prime movies without using my computer.  But it has limited browsing capabilities.  After two weeks it failed and had to be returned.", "verified": true, "helpfulness": "2/4", "author": "Michael J. Feldman"}, {"rating": 5.0, "review": "I've had several box attachment to our TV but Amazon Fire TV eclipses those in performance.  Additionally, the Amazon \"box\" is the size of a DVD case and easy to hook up.  The movies and videos are convenient to access and logically ordered.  I have kept the Amazon Fire TV on  non-stop since receiving it 10 days ago. An outstanding product that promises even more for future entertainment. I've spent $150 for a box that delivered less than Fire TV. It goes beyond all expectations but Amazon always delivers. It would be nice to add books.", "verified": true, "helpfulness": "2/3", "author": "Retired1943"}, {"rating": 4.0, "review": "I upgraded from a two-year-old Roku XDS that was very, VERY slow, so the immediately-apparent speed of the Fire TV was an instant benefit of my purchase. I also appreciate the fact that the Fire TV actually has optical output (and, additionally, is NOT wifi-only like some streaming boxes), which is being phased out on a lot of newer A/V products, unfortunately. The remote is very comfortable, and just feels satisfying to use with the snappy interface.And now, with the recent announcements of Prime getting exclusive rights to the HBO catalog (and HBO GO coming soon), and all seasons of 24, plus voice search coming for Netflix, there's no question in my mind that the Fire TV is the best device of its kind. Its only shortcoming is the minimal amount of storage space, but that is only an issue for those of us that plan on playing games, and should not be an issue for most users.", "verified": true, "helpfulness": "1/1", "author": "Dave"}, {"rating": 1.0, "review": "Maybe I am just spoiled by the content overload I have with my Roku, but all the Fire TV impressed me with was it's sleek packaging. Once installed by my 12 year old, I set up my Prime, Netflix, Crackle and Hulu accounts....... really guys thats it? Voice search really isn't all that and the Fire TV is reboxed and I have ordered a 2nd Roku unit. Some great hardware in the Fire TV but who wants a Maserati engine in a Gremlin?", "verified": true, "helpfulness": "7/21", "author": "Cathy P."}, {"rating": 2.0, "review": "The only good thing about the Fire TV box is the You Tube app, which is unavailable at this time for my Roku 2 XS.For $99 I'd expect something a lot more advanced than my Roku, but the Fire TV doesn't have room to expand the memory, which my Roku does, and ships without any kind of cable. At least Roku includes a composite cable with their product. Every time I try to use the Fire TV I get a failed or fair Wi-Fi connection and have to power it down and back up to get the connection back. The fling feature is kind of cool, but anything I would fling to the tv is pretty much available from my cloud account anyway. The one use I have for that feature right now is to play my Amazon mp3's. I have not found an app to replace the Cloud Player, which is not available for some unfathomable reason, so I don't have direct access to play my music from the Fire box.There are far fewer apps available for the Fire TV than Roku offers. Wouldn't you think they'd have a better selection than Roku prior to launching a hot new product line? I'll probably regret getting the first version on the market because next year they'll have a new version that addresses these issues and they'll increase the price, like they did with the Kindle Fire HD and HDX.I won't be spending another $99 and up to buy the new and improved Fire TV.", "verified": true, "helpfulness": "2/7", "author": "Kathleen Lamontagne \"Montie\""}]