[{"rating": 5.0, "review": "So far it's the best streaming hardware I've used. With the different apps and plex, this does everything I need. Android and chrome management makes it really easy to use.", "verified": false, "helpfulness": "0/0", "author": "K. Hutchins"}, {"rating": 4.0, "review": "Great product, however, some websites are not compatible, mostly compatible with YouTube.", "verified": true, "helpfulness": "0/0", "author": "Mohamad Shebley"}, {"rating": 2.0, "review": "Let me start this by saying that I believe this can be put to great use. However, my expectations were very different. I wanted the chromecast to stream from tab to tv and I had a lot of issues with it. I was never aware that it could only be used with google chrome. Which could be silly of me; however, I figured that as long as I have the app and extension it should be fine. Besides that, the one time the casting did work, it was very problematic with the audio and the tv was quite a few minutes behind the actual computer. My last issue with it, I had to reset it at least once a day otherwise it wouldn't connect.", "verified": true, "helpfulness": "0/0", "author": "Vivila Rosa"}, {"rating": 5.0, "review": "I love it but my dad has it in his head that someone can hack our network with it so he always goes after it.  Whats the point.  Alas they don't make that strong of a router yet to make this useful other than the floor above the router.", "verified": true, "helpfulness": "0/0", "author": "Lee A. Bartholomew"}, {"rating": 5.0, "review": "The best streaming player you can find. Casting is great and now it supports mirroring which makes any app available on your tv.", "verified": true, "helpfulness": "0/0", "author": "karan"}, {"rating": 1.0, "review": "not impressed at all", "verified": true, "helpfulness": "0/3", "author": "Jeff weeks"}, {"rating": 5.0, "review": "Great item, very satisfied with the purchase.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "We are delighted with the way this works.  It eliminates the need to use a wire to stream our Netflix and Hulu programming.  This was suggested by my engineer daughter and she was so right on.  You will not be disappointed!", "verified": false, "helpfulness": "0/0", "author": "Kathleen Bergeron \"Kathleen Y Bergeron\""}, {"rating": 5.0, "review": "excellent product, very responsible, I recommend", "verified": true, "helpfulness": "0/0", "author": "Schweisisk"}, {"rating": 5.0, "review": "I never knew what I was missing. I considered getting a Chromecast back when they came out, never got around to it, but now that I did, I am extremely glad I did.  Media streaming is obviously great, but the options for desktop/screen sharing make this even better.One downside is that this cannot reliably stream 1080p content from a desktop to a TV (via whole desktop sharing) but this is really not its intended purpose.Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "EAS"}]