[{"rating": 5.0, "review": "I used to watch online tv with a bunch of other devices, now its just a tablet and chrome cast.", "verified": true, "helpfulness": "1/1", "author": "Fernando"}, {"rating": 5.0, "review": "(Yes, I just created a new word) This little device is going to change the industry. The price cannot be beat and when Google allows anyone to let their products stream through this little gem, then you better hold on to your butts cause it's going to be awesamazing. Even if you're like me and don't have Netflix or Hulu plus, it's still worth $35 just for YouTube and Google play videos. If you're on the fence about getting one, jump the hell off that fence and run around your house three times and buy you one of these immediately.(The running around your house thing was just to raise awareness for a little known problem in this country. That's right, we all use our front and back yards but what about our \"side yards\". When's the last time you went to your side yard and played ball or had a picnic. Side yards can be (Guess what word comes next. That's right) awesamazing). And on a final note, get yourself a Chromecast.", "verified": true, "helpfulness": "0/1", "author": "rds2264"}, {"rating": 4.0, "review": "I would give 5 stars if google have more chromecast app.Streaming is abosultely effortless.I love Asian drama and I can watch all of them on Youtube", "verified": true, "helpfulness": "0/0", "author": "Sabrina"}, {"rating": 4.0, "review": "This is a cool tool for watching YouTube and Netflix. Both my Samsung support YouTube and Netflix, but they are so freaking slow and buggy that using the Chromecast makes me jump for joy. It is so easy to use and navigate using my android phone. My only wish is that it support DLNA and HDMI CEC. It would be great to stream video direct from my phone or Windows PC and not just from the internet. I would also like to be able to pause/rewind etc using my TV remote, which the HDMI CEC would allow for. That would make the user experience much cleaner. I always forget I am watching a movie through Chromecast and try to use my TV remote to pause, which does not work. It supports CEC a little bit, in that it will turn on my TV automatically when I use Chromecast, but a little more functionality would be awesome.", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "This small and compact unit is wonderful.  It allows our older TV to become a smart TV.  It does everything that it is advertised to do", "verified": true, "helpfulness": "1/1", "author": "SILVERLAWN"}, {"rating": 4.0, "review": "Easy to set up. We've had fun watching YouTube videos as a group. Anyone with smartphone or iPad can get in on finding the next video and casting them up to the TV. Everyone takes turns during the Chromecast party.Also makes it easier to search NetFlix and Hulu for shows you're looking for. Find them fast on your iPad or laptop, instead of the grueling work it is to search with the TV remote.It will just get more valuable as more apps add Chromecast capabilities.", "verified": true, "helpfulness": "0/0", "author": "Idontknowjack \"mh\""}, {"rating": 2.0, "review": "I was very disappointed that it wont work with chrome on ipad,iphone, or itouch.Needs robust host machine or video is pixelated and choppy.  With a machine that is robust enough and a supported app or with chrome on PC it works well.", "verified": true, "helpfulness": "0/1", "author": "Nottaway"}, {"rating": 5.0, "review": "Nice little device.  This is a must have is you like watching tv, and you have wifi.  works with phones, tablets, laptop, desktop. For the price you can't beat it. You can have a smart tv with out buying a new tv.", "verified": true, "helpfulness": "0/0", "author": "Max Krull"}, {"rating": 1.0, "review": "Bought two, one as a gift. Returning both! Not plug and play like Apple TV. Reconfigure my WIFI router? Are you kidding?Apple TV is the way to go here!", "verified": true, "helpfulness": "2/4", "author": "David R. Welch"}, {"rating": 5.0, "review": "This was a gift for my son, and he said it works great.  He can use it for everything he wants.", "verified": true, "helpfulness": "0/0", "author": "Carol M. Rieger"}]