[{"rating": 4.0, "review": "liked it, will only cast from your computer from the internet, you cant cast a downloaded movie from your hard drive...it works as advertised", "verified": true, "helpfulness": "1/1", "author": "Douglas Goldberg"}, {"rating": 5.0, "review": "very good, love it so far.", "verified": true, "helpfulness": "0/0", "author": "Lelainy Saavedra"}, {"rating": 1.0, "review": "It's OK when it works properly.  The problem is it messes up my wireless network and it is very inconsistent in connecting with my Nexus 5. Nice concept, but I've decided its not worth the trouble.  I also bought a Roku stick and in my view, its a more refined device - when its remote functions properly.  Lots of crappy products out there.", "verified": false, "helpfulness": "0/1", "author": "D. Lawson"}, {"rating": 5.0, "review": "I'll start off by saying all the hype that the Chromecast got when it launched, was all well deserved. This is my third Chromecast, and I have even started thinking of buying a fourth so that I can have one on every television set in my house.To start off, I tried the device using my iPhone and began streaming Netflix and YouTube with zero problems. They came through in amazing quality, and actually allowed me to disconnect and sell my XBOX that I previously used for streaming.Best part is, the Chromecast is so much smaller then any other device so I'm able to save a lot of room to store other items!After seeing how well my phone worked, I tried my laptop. I have a Macbook, and the YouTube and Netflix streams were once again flawless.I was also able to stream any tab I had open in Google Chrome to my screen. This feature was surprisingly cool, and allowed me to easily put up my Google Slide Shows on a television during business meetings. It also allowed for easy switching between mine and my co-workers presentations. My meeting were cut down in time, and I feel as if we accomplished more during the time as well.All in all, the Chromecast has become a huge part of my life! I would high recommend everyone who doesn't have one to order one now! Who knows, maybe you'll end up buying multiple just as I did!", "verified": true, "helpfulness": "0/0", "author": "Jeremiah \"Jeremiah Northcutt\""}, {"rating": 1.0, "review": "Bought this thinking it didn't require anything but a wireless router and a tv. however, you have to use a smart device with it.I tried using it with the ipad, android phone, and kindle. This device keeps loosing connectivity.", "verified": true, "helpfulness": "0/1", "author": "Youngmi Chung"}, {"rating": 5.0, "review": "This is so great.  Love that I can stream from apps on my phone & tablet!", "verified": true, "helpfulness": "0/0", "author": "The Bragging Mommy"}, {"rating": 5.0, "review": "worth to buy...", "verified": true, "helpfulness": "0/0", "author": "ankit trivedi"}, {"rating": 5.0, "review": "So good!.", "verified": true, "helpfulness": "0/0", "author": "Guery Diaz"}, {"rating": 5.0, "review": "Fast, reliable, it works great, with no speed issues, and google is continously updating. The chrome screen mirroring feature still needs improvement, it is slow. But when working with a native app (like google movies, youtube, netflix, etc) it works great", "verified": true, "helpfulness": "0/0", "author": "SergioV"}, {"rating": 5.0, "review": "Great birthday present.", "verified": true, "helpfulness": "0/0", "author": "monica"}]