[{"rating": 5.0, "review": "Immediate downloads, no hesitation in streaming, and the voice command is top notch.  I'm very pleased with this product, though still waiting for Amazon Fire TV to get the WWE Network", "verified": true, "helpfulness": "1/2", "author": "Bob Nowak"}, {"rating": 5.0, "review": "We love it! Can't wait to cancel Comcast. We pay over $100 for cable, and there's never anything on TV. Now, for much less we can watch whatever we want, whenever we want. We are so happy to have made the switch.", "verified": true, "helpfulness": "0/1", "author": "Stephanie Solis"}, {"rating": 5.0, "review": "Extremely easy to install, beautiful clear high definition on my 40\" TV. Amazon is expanding their selection of movies just when I want more. I am also glad I re-enrolled in Amazon Prime as it will give me a year's worth of free movies for only $99. Thank you Amazon for this invention!", "verified": true, "helpfulness": "0/1", "author": "Jean Phoenix"}, {"rating": 4.0, "review": "I had been holding out for Apple TV to come out with new hardware, but no luck.  Since I was an Amazon Prime member I thought I'd give Fire TV a try.  Pleasantly surprised at the speed, user interface is nothing exciting, but is fine.  The jewel is Voice Search! Just speak into the remote and immediate results that are spot on.  Sadly, Voice Search only works with Amazon titles, doesn't include Netflix or Hulu which it should.  Amazon just wants to force you down their purchase process.  Still it's a great little Video on Demand product for $100.  You will soon be binging on all sorts of shows.", "verified": true, "helpfulness": "0/1", "author": "Joan Knecht"}, {"rating": 3.0, "review": "I ordered on accident with the very large One Click button on the page and decided to try it once I had it. The major issue I took with it and sent it back was because when you searched for a specific show and the guide populates, it's very unclear if you have the license to watch or if you need to pay for it when you select it. And even being a Prime member, there were prices on shows that I didn't have to pay for. Not clear enough.", "verified": true, "helpfulness": "2/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We have enjoyed the kindle fire very much. It has met all of our expectations. Would highly recommend it to anyone thinking about purchasing one.", "verified": true, "helpfulness": "0/0", "author": "Leslie E. Chambers"}, {"rating": 5.0, "review": "Fire TV is on fire..  I have a NeoTV and thought that was good until I got this device.  The Fire TV media device is true head and shoulders ahead of other streaming media devices.", "verified": true, "helpfulness": "0/1", "author": "Herb Lorenz"}, {"rating": 3.0, "review": "I replaced my Apple TV so I could get easier access to Amazon Prime content but it is a real trade-off since my iTunes content is no longer available. It is also missing a couple of features I often used with Apple TV including PODCASTs. Bottom line is this has great potential but is not going to replace the PC I have connected to my TV. I also have to reboot the FireTV when it wakes from sleep mode since the video cuts out about once every 10 seconds. I will likely switch back to my AppleTV  soon.", "verified": true, "helpfulness": "3/4", "author": "Richard Schultz"}, {"rating": 4.0, "review": "It was as advertised.  It blows Apple TV and Chromecast away.  Roku 3 still hangs in there, but Fire Tv has the ability to play games.  Love it.", "verified": true, "helpfulness": "1/1", "author": "Wade Wilson"}, {"rating": 1.0, "review": "Despite purchasing on my usa . Com account., it repeatedly tries to link to my other .Co. uk account and content is affected.  Calls to the helpline have not been able to resolve.  It's a very expensive drinks coaster now. Poor experience", "verified": true, "helpfulness": "2/8", "author": "Mike Taylor"}]