[{"rating": 5.0, "review": "With over 100 channels it seemed I could never find anything to watch on TV. However with the combo of Amazon Prime and Fire TV I never lack for interesting and free programs and movies. It's also a great way to watch all my YouTube and TED favorites. Plus I get free 2-day shipping on 98% of the things I order from Amazon. It's a WIN - WIN situation.", "verified": true, "helpfulness": "1/1", "author": "SwePea"}, {"rating": 5.0, "review": "After months of seeing the ads for Amazon Fire and the prices slowly going up with my Dish Network I thought I'd look into it.  I have had it installed and hooked up now for about a month and I love it.  Voice activated, my internet is good so no waiting for the videos to load (if you have a slower internet I could see that being a problem).  I love John Wayne, Gene Autry and they have hundreds and hundreds of videos from them both.  If you are buying to see your favorite tv shows without having to wait 2+ months then this is not for you.  Most the shows I watch are about 3+ months delayed from original air date.  I also ordered Prime, so it gives me more access and still it is limited to current tv show episodes.  But Netflix, and hulu help cover that gap.", "verified": true, "helpfulness": "1/1", "author": "Michael R. Burgett"}, {"rating": 5.0, "review": "Bought it to complete my Prime account and have not regret my purchase. Although it is currently under my AppleTV, I use it more thanks to ASAP.PLEASE MOVE ASAP INTO THE KERNEL.  Other than Amazon own, the unit does buffer.It is outstanding however just wish amazon would let us tune the box.I don't play games I play netflix prime and Hulu plus and it is the perfect player for them.Please make more updates. It ain't perfect yet but you are getting there.", "verified": true, "helpfulness": "0/0", "author": "Adam Vazquez"}, {"rating": 5.0, "review": "I decided to do the 30 day trial just to give the Amazon Fire TV a shot. I must say, I have not had the box for long but I really like it so far. The set up was super easy. Finding the apps I wanted (Netflix, YouTube, etc) was just as easy too. The picture is wonderful! I have not had any issues with the movie being paused due to streaming issues either. I am going to give it some more time, to be sure there are no issues that do pop up, but I feel like I will be end my trial with a purchase.", "verified": true, "helpfulness": "0/0", "author": "That_Chic_Erin"}, {"rating": 5.0, "review": "I have only had the device a few days, and will likely update this review later as I learn more about it, and app selection expands. The Amazon Prime video app works very well, much better than I was expecting, the vaunted voice control lives up to the hype, and the game play on the more complex games is excellent, a true console gaming experience.I have only spent a limited time using third party video apps, Netflix seems to work well, as does Hulu+. I have used all of these apps on different platforms, and the Fire TV is as good or better than anything else I have used. The voice control doesn't seem to work yet on the third party apps, but I can live with that.I did have a few unboxing and set up issues, nothing major, and nothing that a couple of power cycles didn't fix. Naturally the first thing it did was update itself, then run a demo, after the demo the first time neither the remote or game controller were doing anything, I reset the box, it ran the demo again and from there it was fine. When I downloaded and installed GTA Vice CIty, it ran really poorly the first couple of tries, once again a couple of power cycles and it was fine. I haven't had any other issues other than those, overall the thing runs very well. It is very responsive and loads video much quicker than any other device I have used, including a PC.", "verified": true, "helpfulness": "0/0", "author": "Cecil B"}, {"rating": 2.0, "review": "When I received my Amazon Fire TV streaming device, I did not immediately pick it up from the postal drop at Blaine, WA.  When I finally retrieved it and set it up as a birthday gift I could not get it to work on any of the different media sources.  I suspect that because I am a Canadian user, my IP address has been tagged as not from the US.  Because it has been more than 30 days since the unit was shipped, I cannot get my money back from Amazon.  Their customer service information is almost non-existent to ask about what problems that I am having and how to resolve them.I did not have the same issues with the Apple TV device that I had bought originally.  I was hoping that the audio search feature would improve search time for locating programs.", "verified": true, "helpfulness": "1/4", "author": "Tom Dunn"}, {"rating": 4.0, "review": "First of all, Amazon Fire TV is a fantastic idea.  It is generally pretty easy to set up and use.  This review will be edited when we can access ALL of our Amazon content, including music.  My other strong suggestion is that Amazon allow for more customized menus, similar to that of the Kindle Fire.UPDATE:  July 15, 2014We can now access our music.  Rating changed from three to four stars.", "verified": true, "helpfulness": "0/0", "author": "EduCatR \"4MUSIC\""}, {"rating": 5.0, "review": "This was very easy to set up.  There have been no pauses for the buffering.  It operates smoothly.  I like the fast forward and reverse features of the Roku 2 XS better because you can visually skip to the the exact scene you want.  It's easier to build your play list from a computer.  I would highly recommend this especially if you already are a prime member.  Then you can view quite a few titles and TV shows for free.", "verified": true, "helpfulness": "0/0", "author": "Ds Thornton Colorado"}, {"rating": 3.0, "review": "I choose this rating as I assumed there would be many free movies and TV series to watch. It seems that everything I choose has a cost. The free items are intermixed with the for charge items. They need to have them separated so you don't waste time looking for viewing only to find out it has a charge. Very disappointed in this feature. Even many of the documentaries have a charge and the old movies as well. Many of these I can watch on Netflix for free or on utube. They need to have more options for free viewing.", "verified": true, "helpfulness": "1/4", "author": "Teresa Hamilton \"thamilt\""}, {"rating": 5.0, "review": "What can I say....Bravo Amazon, your Fire TV is a pleasure to use. It's easy to set up ( they had my account ready to go from the factory), it's easy to use, the controller works like a charm and with the additions of Netflix, Hulu Plus it has what I need. The addition of games has been a big plus, I wasn't interested in this feature but now I am glad you included it. I recommend this to anyone that loves entertainment.", "verified": true, "helpfulness": "1/1", "author": "Dennis"}]