[{"rating": 2.0, "review": "Can exit the intro. The intros just goes on and on and can't get out of it.If you press  backwards it starts all over again.The Dolby surround does not work over HDMI. the main reason I bought this box is because of Plex and the surround sound doesn't work on plex either.The interface is quick but boring.Whenever you purchase something requires no confirmation therefore you can accidentally purchase over and over again.Any movie playing device should have excellent sound Dolby, Dolby Digital, Dolby HD, DTS, DTS HD, or it's useless.High definition TV without surroundsound is pitiful.", "verified": true, "helpfulness": "12/54", "author": "giuseppe petruzziello"}, {"rating": 5.0, "review": "I wonder if the bad reviews are from competitors posing as customers. Amazon could take the lead and knock the competition out.The system will update with new features and such, so I'm not concerned.  Amazon wants to make us happy so I'm looking forward to future additions.The voice recognition is worth it.  Not having to physically search as much.If you love Amazon like I do, you'll be happy with it; remember you can still have your Hulu and Netflix, plus some live stream and ESPN sports.", "verified": true, "helpfulness": "2/4", "author": "Rohonda \"RB\""}, {"rating": 1.0, "review": "Amazon is a behemoth corporation that doesn't care about anything but profits.  They have misled and will do so again.  I have had personal experiences with Amazon admitting fault but not accepting responsibility.  PRIME is a scam and this is a new way to bundle their poor streaming content.  I suggest staying away of any of their products, especially the ones they are solely responsible for.  My theory is that this will transmit consumer data to Amazon so they can spy on you to better learn your viewing and buying habits in order to market more products directly to you.  Their device could access your microphones, webcams and speakers, do you want to give Amazon that power?  They hide behind a subjective Terms of Agreement, written in lawyerese that gives them a backdoor for anything.  Be careful.", "verified": false, "helpfulness": "14/124", "author": "Don't trust Jerri"}, {"rating": 4.0, "review": "Fine until loading new software.  Downloads fine, goes to install, a problem with download.  It is stuck in this endless loop.  From reading all this negative stuff, maybe Jeff should get out of the newspaper business and work with his new product boys.  Its only a hundred bucks.  It just makes the company look bad. I removed the power for a couple of hours and for the hell of it, tried it again.  It worked fine.  So I changed my one star to a four.  Forget about my original comments above.  Please accept my apology.  You know people can be such morons.", "verified": true, "helpfulness": "14/40", "author": "William McDonald"}, {"rating": 4.0, "review": "I'll keep this short and sweet:- Product is great at streaming. However, it freezes for moments on occasion (very rare, don't let this stop you from ordering one). Undoubtedly this will be fixed with upcoming updates.- The game controllers and remote are remarkably good.- For such a new product, the application and game library are great. Much better than we've seen with other products.- The setup is very, very easy. You will be up and running in less than 5 minutes.- The unit needs more storage for the gamer crowd. You only get ~5GB of storage, and many of the games are between 750mb-2GB. I bought a handful of the \"big\" games and I'm already full and can't download any more. There is also no option for expandable storage at this time.- No Spotify app. Big bummer.- No web browser app.However, with the couple minor issues I had, I'm a huge fan.Amazon, if you read this:- Reach out to Dolphin, they have a great browser. Get Spotify. Keep recruiting developers from other houses like you have been. And, last but not least, please add the ability to allow application installation to extend to USB storage devices so that we can add thumb drives and hard drives.Thanks!", "verified": true, "helpfulness": "9/10", "author": "Michael Egli"}, {"rating": 1.0, "review": "I was so excited to order the new Amazon FireTV, finally a device that would fill the need of my entertainment wants.Boy was I disappointed...Voice search is a joke, does not work as good as even the most basic voice recognition, bark instead of mark, time instead of fly, really just bad deciphering. Problem is that when it does recognize the movie or show you are speaking of, the only option you get is to watch it on Amazon.Then there is the Plex App, why do I have to pay for something I do not own?Great hardware, but I think they seriously missed the mark. Offers nothing that others don't already offer except for a broken voice search. Save your money, buy a Chromecast instead.", "verified": true, "helpfulness": "18/59", "author": "M. Buckman \"Internet Producer\""}, {"rating": 5.0, "review": "I am blown away by the voice search feature which works amazingly well.  Also, I like the user interface, especially where details of movies are shown on the screen without having to click on said movie title.  I can't wait til more channels are added.  The Fire TV is definitely one of the most iconic electronic products of our time.", "verified": true, "helpfulness": "2/5", "author": "Bolo"}, {"rating": 1.0, "review": "This is yet another boring streaming device that offers almost nothing new.Pros:Since web prime content requires Silverlight or Flash and it doesn't work with Flash in Chrome, Kindle devices are one of the only ways to access prime content.Cons:-Search feature only works with Amazon content!-Can't enter text via voice, only search terms, and only if you are searching Amazon's library. This is extremely annoying since you have to enter all text and search terms by selecting one letter at a time.-Prime video has no Chromecast support and no Android support. Kindle devices like this are the reason why.-Tries hard to shoehorn you in to buying from Amazon.-There actually isn't Youtube support, or I couldn't find it.-Boring and poorly designed UI.", "verified": true, "helpfulness": "45/77", "author": "Trevor Standley"}, {"rating": 5.0, "review": "Ok.. I read all the negative reviews before mine arrived and got nervous.. It's funny all the negative reviews came so early on.. I don't know why but some people just love to hate Amazon.  I have an Apple TV, Roku 3, and have played with my friends Chromecast which simply didn't have enough for me to buy it.  This is hands down without a doubt the best of the three.  It installs in about 20 minutes including about 5 minutes to unpack and maybe 15 to get through the download of the latest software and a quick tutorial.  If you don't want to go through that just let it do it's thing while going to do something else.  Once installed it is fully preconfigured and ready to use.  The graphics are excellent, and as expected all the channels that it currently has work great.  The one standout is the games.. I'm not a hardcore gamer, but I have played my friends XBox and Playstations.  This is pretty good and while maybe a true gamer wouldn't agree I think it's definitely good enough for any type of gaming I need.  The Sev Zero game is pretty impressive and shows what the box can do.  I'm sure that the system will evolve over time as well seeing it is the first release.  I definitely rate it at 5 stars!", "verified": true, "helpfulness": "4/6", "author": "SoCal Geek"}, {"rating": 1.0, "review": "The Chromecast does about the same thing. Yes, it has some neat gimicks, but its not worth keeping. All the additional apps included on the FireTV are useless to me. My bf said to send it back and get my money back. Which I will do.", "verified": true, "helpfulness": "12/51", "author": "Irina Yusupov \"Rapunzel\""}]