[{"rating": 3.0, "review": "It works but it's not for me I will continue using Roku instead.", "verified": true, "helpfulness": "0/0", "author": "F. Rodriguez"}, {"rating": 5.0, "review": "A great little piece of technology. I frequently youtube with my wife and now I can do it from our television instead of my phone. Easy to setup and how can you compete with that price. Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Jordan Shaw"}, {"rating": 5.0, "review": "Got it a year ago, still going strong. Needs some updates as far as screen casting, but other than that really good product. Could be just a TAD cheaper, but really not a big deal.", "verified": true, "helpfulness": "0/0", "author": "Ambrosio"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Chelsea S."}, {"rating": 3.0, "review": "Great when it wants to work. The problem is it only works when it wants to. I unintstalled and reinstalled the program several times and still drops out whenever it wants. It won't work at all with my wife's Dell laptop.", "verified": true, "helpfulness": "0/0", "author": "M Meli"}, {"rating": 5.0, "review": "Much better than expected. Allows me to play high res videos directly from my Samsung Note 3 via Screencast to my 70 inch tv. I will be buying a few more.", "verified": true, "helpfulness": "0/0", "author": "Boogeytime"}, {"rating": 5.0, "review": "This solves one problem but creates another.  It solves the problem of waiting to access Netflix on our projector via our old Windows 7 laptop that takes forever to boot up and frequently cuts in to push system upgrades or other annoyances.  With the Chromecast, streaming begins in a few seconds and continues (so far) without interruption.  Ahhh!  But this cheap little gadget is provoking an expensive overhaul of our audio system.  It streams Netflix audio (for most films) in the new Dolby Digital Plus (DD+) format.  Few AV receivers and fewer sound bars can handle this format, which means that our existing system will downgrade the audio to stereo only.  The 5.1 home theatre surround sound setup won't work.  So, to take full advantage of the Chromecast, we need a new AV receiver that reads DD+ and we need to replace the sound bar with a separate speaker system.", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 4.0, "review": "I bought this ti be used on Latin America. Not all apps are intended to work here, but I discovered many applications that works perfect. More than  published on Google ChromeCast page. Casting tabs from Chrome and Castscreen from Android are working, even these are beta. This device has a great potential, now the task is for developers.", "verified": true, "helpfulness": "0/0", "author": "Luis Fabres Montoya \"Amateur Photographer\""}, {"rating": 2.0, "review": "Works great for Netflix. Lousy with HBO GO. Buffered about every  20 secs. And never got better .", "verified": true, "helpfulness": "0/1", "author": "J1070"}, {"rating": 3.0, "review": "Does not work with Netflix but works great with everything else.", "verified": true, "helpfulness": "0/1", "author": "Pookie"}]