[{"rating": 5.0, "review": "Chromecast by Google is probably the best thing I ever purchased. I use it everyday and it makes my life so much easier. No need for cables to watch Netflix anymore. I'm shocked more people don't own one. I think most people don't realize you can use it on android or apple products. I love it.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 4.0, "review": "The convenience of using a smart phone or laptop makes this device shine.  Native apps work fantastic and the Chrome browser display feature is an extremely useful feature.  If it had Hulu I might be tempted to give it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "ducatisl"}, {"rating": 4.0, "review": "works well item as described works well with laptop now I have to get it to work with my i phone", "verified": true, "helpfulness": "0/0", "author": "Robbin Dawson"}, {"rating": 1.0, "review": "The support for this is so limited it can't be recommended unless you have almost no other type of tech.  An Apple TV with AirPlay is a much better solution for our needs, though AIrPlay is still blocked by certain developers unless you hack your device to get around it.", "verified": true, "helpfulness": "0/1", "author": "Karyn O"}, {"rating": 1.0, "review": "It's supposed to do very little. Somehow it manages to do even less. It connects to the wife and scrolls though background pictures.  Pretty sad that a such a limited device can't perform the one task it's intended to. I thought this would be easier  or more convenient than using my Xbox, Wii U or even my phone. Turns out I'm wrong on all counts. If it doesn't immediately work, give up. There is no support and a dozen better ways to do this.", "verified": false, "helpfulness": "0/2", "author": "Jonathan Attema"}, {"rating": 1.0, "review": "This is a beta product and it shows.  I went through the initial setup and used this several times.  The next weekend my android failed to connect but my daughter's iPhone connected.  Next weekend I tried again, and it still failed to connect. I did the reset dance - updated android chromecast app, restarted chromecast, rebooted router...., and it didn't help.  Phone tech tells me to reset to factory defaults but I refuse to have a product that requires me to reset to factory default every weekend.  I am returning the product and getting my peace of mind back.  Life is too short to hassle with poor quality products.", "verified": true, "helpfulness": "0/0", "author": "tyo"}, {"rating": 5.0, "review": "I won't dwell on what the Chromecast does, because if you're reading these reviews you are probably already aware of its features.  I have found it to be almost flawless in streaming from either a browser on my computer or a Netflix, YouTube or Google Music session initiated from my phone or tablet.  Once in awhile my phone will lose track of what is playing and I'll have a hard time controlling it, but I think that my phone is primarily to blame in those cases.The only shortcomings I have found are things that I wish it could do.  One is being able to stream anything displayed on your Android device.  This was initially available via some third party apps, but Google locked it down, so now you are restricted to the applications that are Chromecast enabled.  As far as the hardware goes, it would be nice if it had an ethernet port, so that I didn't have to rely on a wireless connection.  Perhaps this will be something included in the next version.All in all, I would highly recommend this product and for the price, it can't be beat.", "verified": true, "helpfulness": "0/0", "author": "DJ"}, {"rating": 3.0, "review": "Was easy to set up and worked exactly as described. I bought it more out of curiosity to explore it's capabilities.  So far I've only used it a couple of times.  Only time will tell if it was a worthwhile purchase for me.", "verified": true, "helpfulness": "0/1", "author": "Dave Workman"}, {"rating": 3.0, "review": "This device did not work with my wireless (originally due to low signal strength). It required the AP to be directly behind the device, and, even though it is an 802.11n AP, the higher resolutions could not stream. Maybe the network is crowded here (there are lots of other APs) but none of my regular devices (phones, laptops) have had any issues with the wifi.", "verified": true, "helpfulness": "0/0", "author": "emm386"}, {"rating": 3.0, "review": "I don't mind this item because it let's me not have to carry around and HDMI cable anymore.  First, I was hoping to be able to cast anything on my computer though so that is a drawback.  I wanted to be able to use it to project MS Office to do presentations but that is not possible.  It would have been cool to have a presentation for work on my phone and then project it on a large screen.Second, it has to go through WiFi, so that is the second draw back. I thought it would just cast directly from the computer to the TV like AppleTV. Like I said I don't have to carry around an HDMI but that is only to view a browser or Netflix.Finally, I don't like that it won't let you stream any \"side loaded\" music as it terms it. I have downloaded many of my old CDs onto my computer and then transferred to my phone but the device won't let me stream any of it.So for the $35 price you get a more convienient way to view what is on your computer on the big screen instead of being restricted with a HDMI cable.", "verified": false, "helpfulness": "0/1", "author": "Boonya2"}]