[{"rating": 5.0, "review": "Very good hardware. Works great!", "verified": true, "helpfulness": "0/0", "author": "Jay V"}, {"rating": 5.0, "review": "Nice product.  No issues and easy to set up and run.", "verified": true, "helpfulness": "0/0", "author": "damon"}, {"rating": 5.0, "review": "Fast, easy to use, and reliable. Unlike the Apple TV, I can start a show/movie in one room, and finish in another (with 2 Amazon Fire TV's).", "verified": true, "helpfulness": "0/0", "author": "DCT"}, {"rating": 5.0, "review": "This is an amazing product that delivers!  The voice recognition is probably the best of any program/device that I have ever used.", "verified": true, "helpfulness": "0/0", "author": "Randy J. Olsen"}, {"rating": 5.0, "review": "I was watching my netflix / amazon prime video on my playstation 3 on one TV, but needed something for my 2nd TV. This thing is great! Like the remote.", "verified": true, "helpfulness": "0/0", "author": "dashreeve"}, {"rating": 5.0, "review": "Awesome, if you have Prime this is a must have! Works much better than using my iphone and streaming to my apple tv.", "verified": true, "helpfulness": "0/0", "author": "C. Smith"}, {"rating": 4.0, "review": "Video quality less than Apple TV", "verified": false, "helpfulness": "0/0", "author": "Bob P"}, {"rating": 5.0, "review": "Great product runs very smooth and high quality video", "verified": true, "helpfulness": "0/0", "author": "Louis"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Upender Chirka"}, {"rating": 5.0, "review": "I'm a Prime subscriber, and can access Amazon content directly on my Vizio TV.  I purchased Amazon Fire TV because I am thinking of getting rid of cable.  I did not realize that it would massively improve streaming, and the overall experience of finding content at Amazon.  I love the voice search, which has no problem recognizing my Australian accent.  I love the layout of the content on the screen, and the ease of navigating through it.  I'm hooked.  And will probably get rid of my cable subscription.", "verified": true, "helpfulness": "0/0", "author": "Antonomasia \"Anton\""}]