[{"rating": 5.0, "review": "wonderful", "verified": true, "helpfulness": "0/1", "author": "Ghamaa7k"}, {"rating": 4.0, "review": "I have had this for over a year now and it has definitely gotten better with the last few upgrades. I also use the Roku 3 as my primary streaming player but use this for a second tv and traveling and it's been fairly reliable.", "verified": true, "helpfulness": "0/0", "author": "David Ruf"}, {"rating": 3.0, "review": "may be ...", "verified": true, "helpfulness": "0/1", "author": "Oh Sang Hyuck"}, {"rating": 5.0, "review": "Works like a cord, only no cord required.", "verified": true, "helpfulness": "0/1", "author": "Mark F"}, {"rating": 1.0, "review": "The dumbest product that google has ever made. You need either a tablet or a smartphone to make this work. For all of those parents that think...I'll get one and use it as a smart tv...WRONG! That means you will not be able to leave without your phone or tablet that you started streaming from. Then there's the PC/Laptop beta extension for Google-Chrome...BETA, the streaming uses alot or memory via Chrome to the ChromeCast Dongle. This is not an Android PC or a stand-alone Media player. There are a lot better products out there than this one. MK808's, Roku, FireTV, and more! This is the worse invention ever developed. Completely useless without another device to stream to it. You may as well buy a WiDi dongle.", "verified": true, "helpfulness": "0/3", "author": "J. NU-Clear \"Techie\""}, {"rating": 4.0, "review": "it adds a lot of extra steps, i do use it when I am out of town though...", "verified": true, "helpfulness": "0/0", "author": "Kameron T Devin"}, {"rating": 5.0, "review": "Still use every day, zero problems", "verified": true, "helpfulness": "1/1", "author": "Scott A. Noll"}, {"rating": 5.0, "review": "Intuitive, works with a lot of apps, and can even share my desktop screen.For such a small device and for such a small price, chromecast has such value!", "verified": true, "helpfulness": "1/1", "author": "Ken-G"}, {"rating": 5.0, "review": "This device for those that do not have a smart TV. You can hook it up to the USB port in your TV and watch what's on your smart phone or laptop right on the television.  It's very simple and easy to use. Works great!", "verified": true, "helpfulness": "1/1", "author": "Stacey King"}, {"rating": 5.0, "review": "It wasn't what I expected. I thought it simply enabled my TV for Wi-Fi.So after I saw that it either Screen Mirrors or uses an App on a connected device,at first I was disappointed.But after installing the app and having connected it to my Note Edge and RCA tablet very easily,was surprising happy. Netflix loads at a nice speed and haven't been disconnected once while using. Easy device to hook up.I bought the charger using the TVs USB port so it is a set it and forget it device I use with one tap on phone/tablet.Great price. Good product.", "verified": true, "helpfulness": "0/1", "author": "Joseph M Ingram"}]