[{"rating": 5.0, "review": "As someone who has tried all the streaming players out there. I find this one to be far above the rest. That's even before you load Kodi onto it. After you load Kodi it's the holy grail of media players.", "verified": true, "helpfulness": "1/1", "author": "Scott Haase"}, {"rating": 5.0, "review": "Outstanding!", "verified": true, "helpfulness": "0/0", "author": "Ed Yorke"}, {"rating": 5.0, "review": "I love the Amazon fire tv, it is so easy to install and very user friendly.  We use it mostly for Netflix and Pandora and of course Amazon, it can do so much more. I would definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Mandy Shreenan"}, {"rating": 3.0, "review": "A lengthy process to get started with a new service. At this time it looks very good.", "verified": true, "helpfulness": "0/0", "author": "Gary J. Chmura"}, {"rating": 1.0, "review": "Amazon Fire TV is like living in a company town with just one supermarket that stocks all the stuff you might buy at a normal supermarket except they make it really hard for you to buy anything that isn't their brand.  Tonight I wanted to resume watching Season 1 of Broadchurch, free with my Netflix subscription.  I press the voice search icon on the Fire TV remote and say \"Netflix Broadchurch\" and on the screen pops the cover of Broadchurch on Netflix.  I press the select button and on comes Broadchurch on Amazon for $2.99 per episode in HD.  I hit the voice search again and say \"Netflix\" and up pops Netflix games.  I say \"Netflix movies and TV\" and a moment later I get it.  I search for Broadchurch on Netflix using voice search and again I get Broadchurch on Amazon for $2.99 per episode.  I repeat the process three times with the same result.  Amazon Fire TV is programmed to bait and switch.  An episode of Broadchurch is 40 minutes.  My wife -- the soul of patience -- observes that I've spent 15 minutes trying to pull up Netflix (by voice, using manual search, even threatening felony assault with a heavy blunt object) to no avail.  She suggests a white flag and just paying Amazon the $2.99 ransom.  I mutter something about Neville Chamberliain and she deftly shifts from appeasement to diversion:  the episode of season 5 Downton Abbey we missed that's free on PBS, just four clicks away on our Roku 3.  I stupidly think I can pull up Downton Abbey on Amazon Fire TV -- and silly me I think it's free.  I get PBS on the screen and when I click it I get Amazon Instant Streaming and Season 5 Episode 2 at $2.99 HD.  I've had Amazon Prime for over five years now and doubt if I've found more than one program a year that's free and worth watching -- usually the same programs I can watch for free on Netflix.  Prime is great for free delivery, really lousy for movies or tv worth watching.  Upshot is I unplugged Amazon Fire TV, retrieved our trusty Roku 3, and four clicks later we were on Netflix and pondering whether new Broadchurch plot developments were a MacGuffin or if the plumber did murder his son.  I'm really disappointed with Amazon, a company I'd like to like but lately infected with corporate bad faith, a Golem-like obsession with the ring of absolute market monopoly.  Amazon Fire TV works great -- for Amazon.  If you prefer Netflix or any other streaming service,  you won't find it easily or at all on Amazon Fire TV.  Like the Ford Model T you can get any color you want as long as it's black.  And if Amazon Prime with its supposed \"70,000 free movies and TV programs\" had more quality content that Amazon didn't charge $2.99 or a lot more, maybe Fire TV would be worth buying. It used to be that a smart company gave away devices that consumers would spend money using but at the same cost as Roku 3, the Amazon Fire TV just proves P.T. Barnum's sagacity in the digital age.  Don't be a sucker.  Don't validate Amazon's corporate cynicism.", "verified": true, "helpfulness": "3/5", "author": "Yuri Asian \"Itsy's Dad\""}, {"rating": 5.0, "review": "We own Rokus and Chromecast.  This is our favorite streaming device so far.", "verified": true, "helpfulness": "1/1", "author": "B. Parsons"}, {"rating": 5.0, "review": "I received Fire TV as a gift hardest part of installing was going to the Wallmart for a new hd and ethernet cables so performance would be optimal. It took all of about 8 minutes to install and I am techno challenged. I didnt even want to deal with wireless since that would take more time and affect quality. Signed up for trial Prime-Netflix-Hulu-HBO Go and other streamers.Powered remote through my Kindle and i am totally ready. Now I started 1st seasons of Soprano's-SoA-Breaking Bad and Deadwood to begin a nostalgic binge along with a few Amazon Prime movies and  I am ready to GO. Add on the NoDoz and Green Mtn. Coffee deliveries and get the almighty to extend the 24 hour day and I am in 7th Heaven. Who says retirement is boring!!!!  PS BONUS I get to spend extra viewing time with my college age son watching shows he may not have seen before!!!", "verified": true, "helpfulness": "2/3", "author": "irishjohn"}, {"rating": 4.0, "review": "Great choices", "verified": true, "helpfulness": "0/0", "author": "wjm"}, {"rating": 4.0, "review": "User friendly!  Lots of great movies to enjoy, but a lot of the movies I wanted to see had to be rented or purchased.", "verified": true, "helpfulness": "0/0", "author": "Hamilton H. Taylor III"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Wallis Khan"}]