[{"rating": 5.0, "review": "I love it! Easy to set up, easy to use! It's terrific!", "verified": true, "helpfulness": "0/0", "author": "Andrea Miller"}, {"rating": 5.0, "review": "Nice TV media streamer, read reviews and decide this was the one to go with....", "verified": true, "helpfulness": "0/0", "author": "Harry Mah"}, {"rating": 1.0, "review": "Terrible. The whole reason I bought it was so I could finally watch my Amazon kindle fire HD on my tv. When I get home and have it all set up I find out that I can only mirror the HDX.", "verified": true, "helpfulness": "1/3", "author": "Devin Hanson"}, {"rating": 5.0, "review": "Fantastic product.", "verified": true, "helpfulness": "0/0", "author": "DAN FERDMAN"}, {"rating": 5.0, "review": "Absolutely amazing!", "verified": true, "helpfulness": "0/0", "author": "Andrew V."}, {"rating": 5.0, "review": "We converted our bedroom hd tv as a smart tv. It was easy to setup. Our only regret is that we did not do it sooner.", "verified": true, "helpfulness": "0/0", "author": "D E Brown"}, {"rating": 5.0, "review": "I bought two of Fire TVs in December 15th, one for me and one for my parents as a Christmas gift but the package got lost in the mail, I reported it and finally got it last Monday... way too late for Christmas.Anyway, I finally got to install mine. Very easy... plug two cables, done!. After a few minutes I was already watching my shows. Excellent picture, super-fast downloading and very easy to use menus. The voice search worked very well for me, even with my accent.I tried to listen to my cloud Prime playlists shortly after I first installed it, but it wouldn't find them, even after I did a \"sync\". I guess it needed a while to read all my information from the cloud, because I tried again three days later and all my music was available.The lack of and on/off button was a little disconcerting but I figured I just had to let it go to sleep by itself.Overall, this is much better than the other devices I've been using to stream Amazon content (X-box, Sony bluray) and I'm happy with my purchase. Now, if I had got it two days after I ordered it (as I was supposed to) it would had been perfect.", "verified": true, "helpfulness": "0/0", "author": "Veronica A. Garza"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Gwen Sherrod"}, {"rating": 5.0, "review": "It's just awesome, that's really all I have to say", "verified": true, "helpfulness": "0/0", "author": "chuck haberman"}, {"rating": 3.0, "review": "Should have got the Roku instead. A lot more channels for Roku. Amazon is not releasing new channels fast enough. Where is Watch ABC, CBS, Fox NOW, FX Now,The CW, Crunchyroll and many MANY more? HBO Go is great, UNLESS you have Comcast, then it is useless. Yes, it's fast, that;s about the only plus side I can give it. Would be nice to play games, but not paying $40 for a controller, thus not buying games. Will probably be selling it to get a Roku. Should have done my research better.", "verified": true, "helpfulness": "0/0", "author": "David"}]