[{"rating": 4.0, "review": "I like the fire TV.  It is very easy to use, and picture is very clear.  As part of a move away from \"cable TV' this was a good addition.  A couple reasons I took away a star:1.  There are limited apps which can be used, that may improve over time, but as a goal of moving away from cable, I would like to add other apps that don't exist.  There are a lot of games and other apps, but it is still limited.2. Search.  Search should be one of the great things but it is designed to find names (movies or actors etc) I would like to search a genre, limit it by Stars, or IMDB rating, and Prime.  No luck.  You spend most of your time side scrolling through \"recommendations\" which are not that great.  can use your pc to load up wish list, but since moves go in-and out of Prime, you cannot be sure it will still be prime when you watch it.3. Performance is good, in amazon apps, outside of amazon apps, it is a bit slow.4. Running apps outside of Amazon's apps the experience is less than perfect.  Not really amazon's problem, but worth noting.Yes, I would recommend getting it if you are a prime customer.", "verified": true, "helpfulness": "0/0", "author": "Dean"}, {"rating": 2.0, "review": "If you like Prime and only Prime then this is the streamer for you. If you like other channels that aren't Amazon related, good luck figuring out how to add them.", "verified": true, "helpfulness": "0/1", "author": "Henry Wu \"suckamc\""}, {"rating": 3.0, "review": "can you connect with all the tvs in the house ?", "verified": false, "helpfulness": "0/3", "author": "Kain"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "theresa"}, {"rating": 2.0, "review": "I've been very disappointed by the Fire TV. I got it mainly because I could install KODI and be able to watch any type of video file.  This part has worked well.  Fire TV also came with Sling TV.  Whenever I run any app and then run Sling, it will totally lag.  The only thing that fixes the problem is a full restart.  So, I know now that any time I want to use Sling, the first step is to do a restart.  I have 2 Rokus and I greatly prefer the Roku other than the Roku doesn't support KODI and the Roku media player is lacking.  Sling on Roku works excellent.  Last night I also had a problem with Fire TV lagging a video that was running off my local media server where the Roku never has that issue.", "verified": true, "helpfulness": "2/2", "author": "David M Byars"}, {"rating": 1.0, "review": "I love it when it works but I have to constantly unplug and plug it back in all the time.", "verified": true, "helpfulness": "2/4", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Wifi recognition is mediocre at best, constantly loses signal, nowhere near as reliable as appletv", "verified": true, "helpfulness": "1/1", "author": "Justin"}, {"rating": 2.0, "review": "I did not order  this so I want to know ho to return it .I have no use for no amazon fire.", "verified": true, "helpfulness": "0/8", "author": "evangeline"}, {"rating": 1.0, "review": "I have had this for 10 minutes and hate it so far.  I giving this a one star before of the forced into video that I don't want to watch and can't skip.", "verified": true, "helpfulness": "0/6", "author": "qwerert"}, {"rating": 5.0, "review": "Let me preface this review by stating that I also own two Roku 3's and one Roku 2, so I'm not new to the world of streaming devices. I also had purchased an amazon Fire Stick several months back and use it while traveling. I became frustrated with my Roku 2 as it is so painfully slow and thought I would give the Fire TV a try so I went to my local Best Buy and picked one of these up.After spending a weekend with this puppy, I gotta say I'm very impressed. The device is very responsive and if you're a Prime member it displays content extremely well and much better than the Amazon app on the Roku. The games are leaps and bounds better than anything on the Roku. That's definitely an added benefit. But one of my favorite features is ASAP. The device learns what Amazon shows you watch and preps the device for your watching. This reduces buffering or loading in the beginning of your shows to almost nothing.One huge concern I had when I purchased this was that there are several channels I really like on Roku to watch news and so forth. So far I've found many apps on Amazon that do the job equally or even better than those on the Roku.So if you're on the fence... this is the device I recommend.", "verified": true, "helpfulness": "2/2", "author": "Juan"}]