[{"rating": 5.0, "review": "Love it! For the $100 price, it's so worth it. I don't pay for cable, and can now watch netflix and amazon prime movies on my tv instead of my computer.Only wish they had an app for just hulu, and not hulu plus. I don't pay for hulu plus, but still want to watch hulu on my tv screen.", "verified": true, "helpfulness": "2/2", "author": "Molly Croteau"}, {"rating": 5.0, "review": "I just love my Amazon Fire TV, Using it at my camp,saves 1hr drive and back to the nearest video store. Works Great", "verified": true, "helpfulness": "0/0", "author": "Michael R. Christman"}, {"rating": 5.0, "review": "Absolutely love it! The interface is snappy and the remote is intuitive. I've been streaming Netflix through our TiVo Premier 4 and while the streaming bit worked well enough, the interface was sluggish and often unresponsive. If I accidentally hit the main menu button on the TiVo remote while streaming Netflix content, it might be 1-2 minutes before I'm back where I left off.  With the Amazon Fire TV, I can go back to the home screen and be back streaming Netflix content in a few seconds. I've only had one issue that I suspect to be a potential hardware problem. On 3 occasions the sound quality would sound tinny and completely annoying.  A hardware reboot so far has been the only way to resolve this issue. I'm still giving it 5 stars because I know Amazon would quickly replace the device if it becomes necessary.", "verified": true, "helpfulness": "0/0", "author": "mveerman"}, {"rating": 5.0, "review": "I have an Apple TV, a ROKU 3, and now an Amazon Fire TV.  The Fire TV has 4 times the buffer memory of the others, and if you opt for an Amazon credit card you get a $60 credit which can be used to purchase the $99 Fire TV.  The Fire is super if you already are a Prime member as many videos are free.  Also, for prime video searches the remote recognizes voice commands, no pecking the alphabet on screen.", "verified": true, "helpfulness": "0/0", "author": "Bruce M. Daniell \"BigGreenEgger\""}, {"rating": 5.0, "review": "Faster, better than ROKU ... been through 3 ROKU versions ... the FIRE TV is so much better, easier to use, gives me HD from Netfliks when the latest ROKU box drops me to a lower resolution.  Amazon content good.  Using Nexflix less and less.", "verified": true, "helpfulness": "0/0", "author": "Douglas B. Travis"}, {"rating": 5.0, "review": "I love my Amazon Fire TV! It has everything I need to watch the shows that I love and I appreciate the recommendations as well.", "verified": true, "helpfulness": "0/0", "author": "Brooke Wise"}, {"rating": 4.0, "review": "The navigation should have had some usability testing prior to launch.  You should be allowed to place any added apps to the main navigation.  The presentation and initial dashboard should have everything you want or the ability to add what you want, should be a little easier to navigate.  I own 2 Apple iTVs and love how easy I can get to the channels.  The voice search is great also.", "verified": true, "helpfulness": "0/0", "author": "Old Head; DJ/Dancer \"The Shadow\""}, {"rating": 2.0, "review": "I purchased this item to use at my home to watch Netflix, Hulu, and Prime. I cancelled by cable Tv recently, and thought this would work better then a dedicated windoes 8 computer to run the tv, I was wrong.If I only wanted to watch prime, then this system would be fantastic. It is setup well, organized, and works. The problem is I would also like to watch Netflix and Hulu. The apps for these programs are absolutely horrible, and I have a feeling that is on purpose to push people towards prime. The windows 8 apps for these services are 100 times better and easier to use. I don't want it to be difficult to use netflix/hulu, I want it to be easy like it is on a computer, so that is what I am going to use.", "verified": true, "helpfulness": "2/6", "author": "Celtic3"}, {"rating": 5.0, "review": "Great....", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Easy to set up and use right out of the box. The voice recognition is a plus. Highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Jack Kelleher"}]