[{"rating": 5.0, "review": "We own this and a Roku 2 HD box. Between the two, I would take this any day.We watch a lot of educational videos on YouTube and this is a vastly superior interface compared to any other TV centric streaming device I have used. You simply use the video app on your phone as you normally would, but press a button in the app to switch the video content to play on your TV.Setup was a breeze and the price is right. I can't wait to see additional functionality added.The downside is that no remotes are included. You must use a smart phone, tablet, or laptop to control the video. Also, there is still a limited pool of apps that can make use of the device. On my iPhone, I can use Pandora, Netflix, Hulu Plus, and Youtube, but not Amazon Prime streaming video.", "verified": true, "helpfulness": "0/0", "author": "vamommy"}, {"rating": 5.0, "review": "I love this thing. I can watch all the shows I want on my HuluPlus and Netflix account. Plus it allows me to stream Chrome tabs from my computer with ease. I will never use cable again!", "verified": true, "helpfulness": "0/0", "author": "AH"}, {"rating": 3.0, "review": "I had high hopes for the Chromecast. However, the device is quite slow in loading applications, and it often has trouble syncing with my devices. Now that I have a Smart TV I don't really see the need for this, and you might as well skip out on it as well - unless you're a diehard Googler and your whole life is wrapped up in it. Since mine isn't, I wonder if that's why I had trouble. Perhaps using Google's TV & Movies apps might work better than Netflix and Hulu? Just a thought. I say save your money.", "verified": true, "helpfulness": "0/0", "author": "Michael Vollbrecht"}, {"rating": 5.0, "review": "I bought this within a month of the release, and was pleased with the ability to stream Netflix to my TV without using cords from phones or computers.As time has passed, the additions of Pandora and most recently WatchESPN has made this device the center of my living room.  I recently purchased a new cell phone with the Kit Kat update, and even videos from within the Chrome browser on my phone can be cast to my TV.  The functionality of this device is only growing, and this appears to be the future of TV. And for $35!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I SUPPOSE IT DOES WHAT IS SUPPOSE TO DO.  WASN'T QUITE WHAT I THOUGHT IT WOULD BE.  I THOUGHT I WOULD BE ABLE TO ACCESS ALL WEBSITE THROUGH THIS PRODUCT, BUT THAT WASN'T THE CASE. STILL A GOOD PRODUCT, FAST SHIPPING", "verified": true, "helpfulness": "0/0", "author": "Ned"}, {"rating": 5.0, "review": "I have used Chrome cast before- and ordered 5 of them - its an amazing product- and one that has made my old mother love to watch what she wants on you tube especially ollld songs !", "verified": true, "helpfulness": "0/0", "author": "Shyam Menon"}, {"rating": 5.0, "review": "I received a Chromecast as a gift and love it. I bought two for my sisters and they love them. Easily can stream videos from YouTube and Netflix for my niece. Great product/value.", "verified": true, "helpfulness": "0/0", "author": "Scott W. Miller"}, {"rating": 5.0, "review": "Use this all the time, works very well, just have a computer, smartphone, or tablet nearby. Theres lots of apps in the Play store that have support for this, always something new to try. Try the Doodlecast app with your family and see what I mean.", "verified": true, "helpfulness": "0/0", "author": "Trent C"}, {"rating": 1.0, "review": "As a I.T. professional I think this product has more bugs than it lets on!! This thing is so unreliable and full of updates and things you need to do to do simple casting. It seems noncompatible with other browsers and only cast from chrome. Big piece of junk!!!! Google I would have expected WAY more from you guys!!", "verified": true, "helpfulness": "0/0", "author": "Nip/Tuck Fan"}, {"rating": 5.0, "review": "Must have for any house with wifi and a tv.....so all of them!  It was so great I ordered another", "verified": true, "helpfulness": "0/0", "author": "mark p wright"}]