[{"rating": 3.0, "review": "Not a casting device. Will not cast your screen. Only works with certain programs. Really only worth it for Netflix.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "How have I survived without this treasure? Easy to set up, works perfectly. Thanks, Chrome!!", "verified": true, "helpfulness": "0/0", "author": "Doretta M."}, {"rating": 5.0, "review": "This device is so inexpensive, that if you have a wireless router and a television with an HDMI port, you may as well buy it, even if you will only use it occasionally, as I will.  It is VERY easy to install both the hardware and software.  You can use it to stream any video that you can play in the Chrome browser to your television.  If you recorded the wrong show or it was pre-empted or your digital antenna had some interference that day, if the show is available online, you can still watch it on your television.  This to me makes it entirely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 5.0, "review": "This is easy to use and super portable.  We've taken it on vacation to watch movies at night hotels (we rented from the Google Play store, and it also supports HBOgo and Netflix) and we love that we can use it on multiple TVs at home.  It's a great bang for your buck, and with the AllCast app, you can stream pretty much anything.", "verified": true, "helpfulness": "0/0", "author": "Sarah Mactal"}, {"rating": 5.0, "review": "Does Exactly what it's supposed to. Perfect for watching Netflix in my bedroom where I don't have a Blu Ray player.", "verified": true, "helpfulness": "0/0", "author": "magen forgey"}, {"rating": 5.0, "review": "Fricken fantastic!  No issues, no regrets.  This is a wonderful device and inexpensive.  Google has sold 400 MILLION of these and no wonder.  Can't wait to see what is next.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 4.0, "review": "incredibly difficult to hook up because of the components i have. Probably not Google's fault, but had to dig deep to find out how finally to get the device to talk to a Sony projector, and Sony receiver.", "verified": true, "helpfulness": "0/0", "author": "Dominic De Fazio"}, {"rating": 5.0, "review": "hope it will support more application.I recommend it for Android user and IOS.", "verified": false, "helpfulness": "1/1", "author": "Taleb a."}, {"rating": 5.0, "review": "This purchase was a gift for my son as I have had the Chromecast for months and love it.", "verified": true, "helpfulness": "0/1", "author": "Lynda"}, {"rating": 5.0, "review": "Was a gift for a friend he liked it. Thanks.", "verified": true, "helpfulness": "0/0", "author": "Elvis"}]