[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "svega"}, {"rating": 5.0, "review": "Best \"Dad Gift\" ever. My boyfriend's dad is a tech-savvy surgeon with the newest gadgets. So when it came time to buy him something for the holidays we struggled to find something that he would think was both cool and useful.I am pleased to announce he sent us an email a few months after the holidays and thanked us for getting him something so cool. He says he uses it all the time and loves being able to stream his shows and sports directly from his phone.Great gift option! (Their TV would need to have a USB port of course.)", "verified": true, "helpfulness": "0/0", "author": "mplsmaven"}, {"rating": 5.0, "review": "Love this streaming player and it connects very good with my netflix, hulu, popcorn time and amazon streaming apps:) very great video quality too it's HD so I will recommend eveeyone to purchase this item for sure. The only thing that haven't worked is threw my computer, I downloaded it snd everything but can't seem to find the chromecast button to stream to tv but after not being able to i haven't tried to do it again. I use it via cell and while playing movie streaming from cell to tv with this device I can still use my cell and the movie still plays and I really like that. My kids use this all the time and love it as well I will be buying another one for my parents for xmas so they can enjoy this device like my family does.Makes movie nights very fun and easy", "verified": true, "helpfulness": "0/0", "author": "AMY B."}, {"rating": 5.0, "review": "I have two of these and can't imagine living without it.  I cut the cable a few months ago and haven't looked back.  All my media consumption -- TV, movies, music -- is done on a phone or tablet and streamed to the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Brandon Ross"}, {"rating": 1.0, "review": "Unworkable", "verified": true, "helpfulness": "1/1", "author": "Babatunde Alabi"}, {"rating": 5.0, "review": "Best thing ever...bye bye cable!!!!", "verified": false, "helpfulness": "0/0", "author": "Elizabeth Young"}, {"rating": 5.0, "review": "Love it! Simple to set up. I primarily use it for Netflix. I used to stream through a Blu Ray player but was always having streaming/buffering issues. No buffering issues streaming from my iPhone. It's great. And a great deal compared to the AppleTV.", "verified": true, "helpfulness": "0/0", "author": "ShopGirl2468"}, {"rating": 3.0, "review": "Does bot work with my computer.  Sound & picture broken up and jerky", "verified": true, "helpfulness": "0/0", "author": "Rick can fix it! \"Rick\""}, {"rating": 3.0, "review": "I do not know if the problem is the iPad app or the device, but I often lose control of whatever is being streamed.  In other words, I cannot pause, forward or rewind.", "verified": true, "helpfulness": "0/0", "author": "Samir Naguib \"frequent shopper\""}, {"rating": 5.0, "review": "Best purchase ever.", "verified": true, "helpfulness": "0/0", "author": "Benjamin Latagan"}]