[{"rating": 4.0, "review": "I've tried several other competitors (chrome case, Apple TV, Roku, FireTV Stick, WD TV). I'll start by saying that all of these devices are a bit of a compromise. Which is best depends on what you intend to use your device for and how/where you will use it.Why I choose Apple TV Box:- has an ethernet connection so that I can hardline in the internet connection...for me the location of this device is not suitable for WiFi.- I already pay for Amazon Prime (past 4 years) and have never watched much of the AP content as there was no app for it on Apple TV. Now I can and I love shows like Bosch or old HBO Series (for Free w/ AP).- The GUI (graphical user interface) and ease of daily use, as well as ease of app additions/deletions, device settings, etc. It is simple and easy to learn. It does the best of sub $100 streaming devices out there in this area.- Great extras like voice search, iOS apps, small/stylish design of both box and remote. Doesn't look nerdy or toy like. Also doesn't stick out.What I don't like:- At the time of writing this (and tech changes often so this may not apply when you read it)- It does have a plex app, but unfortunately plex does not seem to be overly customer service friendly and if you have problems you may spend hours trying to get it to work, and still have no luck. I have a similar plex problem with my NAS, so just an FYI just because a device (streaming device / NAS / Server) has a Plex app, don't automatically think that ='s it will work.- HBO Now is limited to AppleTV.- Price ($100) is at the top of the heap, and the device is getting older (yes 1 year + is old in tech).What would make it a 5 Star Device:- easier/better ability to function as a home media streaming device for movies/tv/home-movies stored on a local network (computer/NAS). This is something that most streaming devices suffer from and for me this type of integration would make devices like AppleTV a great device vs. a good device.Conclusion:If you don't have to have HBO Now, If you need a hardline internet connection, If this device is for use by both techies and non-techies, if $100 (AFTV) vs. $70 (Apple) isn't a big deal, and if AFTV has the apps you need/want then buy this over the similarly priced Roku.", "verified": true, "helpfulness": "0/0", "author": "rretina"}, {"rating": 4.0, "review": "Nice tool. Easy setup. Easy to use interface and the voice search is pretty kewl too.", "verified": true, "helpfulness": "0/0", "author": "Wade J. Ray"}, {"rating": 5.0, "review": "Super fast. Lots of entertainment", "verified": true, "helpfulness": "0/0", "author": "J Seymour"}, {"rating": 5.0, "review": "Fast easy  to use remote also cool because don't have to be in the same room  the best streaming box I have own !", "verified": true, "helpfulness": "0/0", "author": "Carlos G."}, {"rating": 3.0, "review": "The apps store or games that come with the bundle are total crap. The system itself is great for watching movies so I don't have to have my computer running. Overall Ive used it all of about 3 times. The games that come with the bundle are half finished at best, rough around the edges and not polished off at all. I can buy a game like the ones included in here for .99 cents on steam that functions better.", "verified": true, "helpfulness": "1/1", "author": "Jonathan Hubbard"}, {"rating": 5.0, "review": "Great replacement for my last dlink box", "verified": true, "helpfulness": "0/0", "author": "Allan Greenberg"}, {"rating": 4.0, "review": "Expensive on a lot of the content.", "verified": true, "helpfulness": "0/0", "author": "Stephen Rohlfing"}, {"rating": 5.0, "review": "Very very very easy to navigate, set up, fairly priced; backed by a dynamic user friendly interface...AMAZON", "verified": true, "helpfulness": "0/0", "author": "Christian"}, {"rating": 5.0, "review": "This unit is better than sliced bread! Compact but powerful. great streaming works well with slower speeds from your internet provider because it smart and preloads the data stream before it's needed to play. the only thing I would like from it is the ability to play YouTube.All in all I give this remarkable unit a Five-star rating it's great!! Frank Bartson, Electronics Eng. Ann Arbor, MI", "verified": true, "helpfulness": "2/2", "author": "FrankinAnnArbor"}, {"rating": 5.0, "review": "This is really nice, a lot of movies and kids shows. Gaming for the grandkids.", "verified": true, "helpfulness": "0/0", "author": "Janet Skehan"}]