[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "mario farias"}, {"rating": 4.0, "review": "Works well, many shows on it. Thought being a Prime member it would have more free things on it . But overall im happy", "verified": true, "helpfulness": "0/0", "author": "robert knowles"}, {"rating": 5.0, "review": "I'm still learning how to use it. I'm 75 yrs old, and had no trouble getting it hooked up and running.watched a couple movies and had no problems with buffering. Watching Netflix on my smart tv would take me 2 hrs to watch an hour movie. That doesn't seem to be a problem now.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Quick delivery and easy setup. Great system!", "verified": true, "helpfulness": "0/0", "author": "RFA"}, {"rating": 5.0, "review": "Love this thing better than other alternatives that we tried.", "verified": true, "helpfulness": "1/1", "author": "wittlebit83"}, {"rating": 5.0, "review": "Love it! We have the Roku 2 and this by far is the better product.  It's fast and easy to navigate.  Buy it now!", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 2.0, "review": "I wanted to like this, hardware wise is great. Videos do play great. Just like all other Amazon Fire devices the software sucks. Netflix and Hulu are buried in the menu and Amazon overload. I get they want to push there videos but they just don't have the content the other two do. The voice search function works great but only for Amazon Stuff for the most part. I wish I had gotten a Roku for so many reasons.", "verified": true, "helpfulness": "0/1", "author": "John362"}, {"rating": 3.0, "review": "First product worked well for one year then stopped working. I purchased a second because I like the product. At the time of this posting, second Amazon Fire TV is still functioning properly. Side note: Purchased a Roku at the same time I purchased the first Amazon Fire TV product and the Roku continues to perform well.", "verified": true, "helpfulness": "0/1", "author": "Reymundo Martinez Jr"}, {"rating": 1.0, "review": "The Amazon Fire TV falls far short of what I expected...I'm truly disappointed, it doesn't live up to the hype...I'll most likely return it.My experience falls way short of expectations. Period! Live Sporting events buffer 2-4 times per minute, taking away the feel of the game!Customer Service for the Amazon Fire TV was horrible when I called to discuss this issue. I'd rate it 2 on a 1-10 scale and the problem still exists.", "verified": true, "helpfulness": "0/3", "author": "David W."}, {"rating": 5.0, "review": "I love it!! 5 Stars!!", "verified": true, "helpfulness": "0/0", "author": "Kim Mason"}]