[{"rating": 4.0, "review": "Smooth", "verified": true, "helpfulness": "0/0", "author": "david fung"}, {"rating": 5.0, "review": "Does the job as advertised. Wish it hosts Amazon Instant Videos but apparently it doesn't. Can't have everything I guess - unless you've got a Smart TV.", "verified": true, "helpfulness": "0/0", "author": "Din \"Din\""}, {"rating": 5.0, "review": "Very good item. It works with my IPad but maybe I will need to make some adjustments.", "verified": true, "helpfulness": "1/2", "author": "Eliberto Martinez"}, {"rating": 5.0, "review": "Because google.", "verified": true, "helpfulness": "0/1", "author": "Jarrett Boudreau"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/1", "author": "l.Hayes"}, {"rating": 3.0, "review": "So, I should start off by saying I am a Google junkie, its my first go to for any app.That being said, when I initially bought this I loved it. It connected to a lot of the stuff that I would like to see on  a bigger screen I.E. Netflix, Chrome, YouTube etc. Then about 2 weeks after using it I started to notice that it would disconnect out of the blue. I would be watching something on Netflix and open another app at the same time, and Netflix would automatically disconnect from Chromecast. This happens a lot. Also, if I open Netflix and start connecting it to Chromecast and don't let it load all the way before I select a movie to play, it will not load anything and I will have to physically unplug the cable from Chromecast and let it reset. PITA!  Other than those issues (that happens quite frequently) it plays pretty well.Do I regret purchasing this? Kind of. Would I recommend this to friends or family? Absolutely not. I would much rather go explore Roku or Amazon Fire Stick.", "verified": false, "helpfulness": "2/2", "author": "Donnie"}, {"rating": 5.0, "review": "Thought about buying a smart tv but this is so much cheaper. It does what it says and it's super easy to set up", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 5.0, "review": "This little device is very cool!  I ordered it when it first came out and I have used it off and on since then. I don't use it as much now because I have a Fire stick that offers more functionality.  This device is great though.  I could see taking it with me on trips and using in a hotel room TV because it is that portable.  The downside is it is a client based device.  I have to use something else to control it: My phone, computer, tablet etc... This is where the Fire Stick is more useful with its remote.  Either way I like this gadget and still use it on occasion!", "verified": true, "helpfulness": "0/0", "author": "A. T."}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Burak Furkan EMIL"}, {"rating": 5.0, "review": "Works great for YouTube and Netflix from my iphone and does not take time to load YouTube like many Smart TV's do. Appears to stream right from the cable modem for no delay.", "verified": true, "helpfulness": "0/0", "author": "D. Brown"}]