[{"rating": 5.0, "review": "I'm using this with a kindle and another android tablet, and it works great most of the time. The set-up app didn't work for me the first time, had to delete and re-install. Also, I've noticed that if it goes dormant for a while, it asks to be unplugged and re-installed. But overall, I like it. I use it with avia media player and youtube. Slowly but surely, things like this will help consumers \"cut the cord\".", "verified": true, "helpfulness": "0/0", "author": "P. Sprinkle"}, {"rating": 4.0, "review": "I have to restart the router for my devices to find it (nexus 7) when I want to use it. After, it works great, mainly using netflix.", "verified": true, "helpfulness": "0/0", "author": "Phil Wodarczyk"}, {"rating": 5.0, "review": "i liked it it, it was as advertised and it arrived on time.excellent product and will recomend for some one else", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "I ordered this only to stream my personal video library to the television. The 1st time I hooked it up it didn't work, so I took it apart, packed it up, printed out return labels, got directions to the ups store. The next day, I saw an advertisement saying, it could stream my media. To make a 5 hour story short, after getting all installed, use the shortcut (Ctrl O)", "verified": true, "helpfulness": "0/0", "author": "Dan Gerous"}, {"rating": 5.0, "review": "I love the Chromecast, I love the convenience.  I use Netflix and Plex all the time.The problem comes during Prime Time hours when everyone else is streaming movies over wifi.  At that point your video will skip or stop playing.  It's the ultimate let down when you're in the middle of a movie and it stops working and there is nothing you can do.I've tried switching my wifi channel all over the spectrum and sometimes I can get it to play for 20 minutes, sometimes less.Update:Google knew this was a serious problem and they released an ehternet adapter!  Rating bumped up to 5!https://store.google.com/product/_ethernet_adapter_for_chromecastIf Google had some brains they would make a slightly larger version with an ethernet port.", "verified": true, "helpfulness": "0/1", "author": "Dan"}, {"rating": 5.0, "review": "The main reason I purchased this was to use with my plex server. Works great with the plex app and I can stream whatever I want to my tv. Be aware that this only works on 2.4GHz bandwidth signals. Wish I would use 5GHz just because but I guess there really isn't a need for my network.Works with movies, music, twitch inside the plex app.On occasion I use the Youtube app but I wish there were more options to really make this awesome.", "verified": true, "helpfulness": "0/0", "author": "egibbys"}, {"rating": 5.0, "review": "This is the coolest little device.  I use it to chromecast youtube videos.  I was able to eliminate tons of cables.", "verified": true, "helpfulness": "0/0", "author": "pl734"}, {"rating": 4.0, "review": "Great but needs more apps so you can stream from more than just youtube, netflix and hulu. but great with those apps!", "verified": true, "helpfulness": "0/0", "author": "Jenny L Pearce"}, {"rating": 3.0, "review": "Product is satisfactory, I don't use it much though because I have a computer that I do most everything on", "verified": true, "helpfulness": "0/0", "author": "Josh"}, {"rating": 5.0, "review": "works perfectly. no problems at all. would recommend to anyone looking to stream from a laptop, computer, etc. very nice.", "verified": true, "helpfulness": "0/0", "author": "D M"}]