[{"rating": 5.0, "review": "Very easy to configure and operate with the downloadable software. I'm using with Mavericks, the newest Mac OS and it works flawlessly. Very little to configure and literally is plug and play.", "verified": true, "helpfulness": "0/0", "author": "carl Sopranik"}, {"rating": 4.0, "review": "Works best when the wifi signial is good. I have some speed problems when connecting to my downstairs network instead of the much stronger one on the same floor. Other than that, I marvel at the cost/value ratio. Great buy if you are a hulu or netflix subscriber.", "verified": true, "helpfulness": "0/0", "author": "T. Gilbert"}, {"rating": 5.0, "review": "An easy way to stream movies from you computer or ipad through your TV wirelessly. It didn't seem to work for streaming video through a website but it works great for apps (netflix, hulu, youtube, etc.) that stream video.", "verified": true, "helpfulness": "0/0", "author": "Niki vonHedemann"}, {"rating": 5.0, "review": "Works with no issues. I realize the Chromecast API still needs work but it is upgradable and Google seems to be pushing updates frequently so it is a matter of time.", "verified": true, "helpfulness": "0/0", "author": "Anmar Oueja"}, {"rating": 2.0, "review": "It didn't work. The application on my andriod phone would not connect to the device. Several attemps were made, and app was deleted and reinstalled twice.", "verified": true, "helpfulness": "0/0", "author": "Kixbutox"}, {"rating": 4.0, "review": "This is a relatively new product so I'm sure more functionality is coming but having options to stream more things would be great. Setup is super simple and everything pretty much functions as advertised. You can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Mad Max \"Live and die in LA\""}, {"rating": 5.0, "review": "Lets you play almost anything from your computer or phone(given the apps are supported)I recommend reading up to use its full potentialPretty amazing", "verified": true, "helpfulness": "0/0", "author": "John H. Simon"}, {"rating": 3.0, "review": "I am disappointed with the product because I was hoping to access my iPhone and iPad on TV but that is not true. I felt cheated!To access Netflix and Youtube works without problems, but it is limited to that!The product has quality but not served the purpose I wanted.", "verified": true, "helpfulness": "0/0", "author": "Juliana Silva de Azeredo Lopes"}, {"rating": 1.0, "review": "I completely agree with all those that bought the Chromecast because of it's wrongfully advertised packaging. Just purchased it, brought it home, set up was easy, then tried to stream the \"ANYTHING ON THE WEB\" CBS TV shows and No-Can-Do!! The only few sentences on the package firmly state that \"Send video, music or ANYTHING ON THE WEB to your TV from your smartphone, tablet or laptop\". It will NOT do that. Only streams using their approved aps. As a Google STOCKHOLDER---Shame on you GOOGLE!!", "verified": false, "helpfulness": "2/2", "author": "ToolPro-PJ"}, {"rating": 2.0, "review": "With all the hype regarding this product, you would think it's the greatest thing since the invention of the smartphone.  When you read the fine print (I didn't) you discover that this only works with Netflix and Google Play. I bought it on Amazon because I am a Prime member and I watch videos on Amazon Instant Video. It will not work with Amazon video.In addition, you don't just plug it into the TV; you have to plug it into a power source so you will have a wire going to either a USB port or electric plug. I guess I'll just take my Roku on vacation.  This thing is going back.", "verified": true, "helpfulness": "0/0", "author": "S. Stevens \"Yoga Fan\""}]