[{"rating": 5.0, "review": "I actually ordered a Chromecast the day it was announced from Google. However the next day, I was told that they were available for purchase at bestbuy. I was anxious to try it out so I went and bought another one and gave it a try.", "verified": true, "helpfulness": "0/0", "author": "ULISES D. CASTILLO-TAVERAS"}, {"rating": 3.0, "review": "This will be so much better if I can play/mirror my ipad google website/browser on our tv... It only works on PCs :-(", "verified": true, "helpfulness": "0/0", "author": "HEIDI FAJARDO"}, {"rating": 5.0, "review": "With all the great reviews I had seen, I expected to plug this in, and be fully configured within a couple minutes.  Unfortunately, the configuration kept failing when I tried to connect the Chromecast to my wifi network.  I started digging into all sorts of advanced settings in my router, and when I finally got it working I realized it was the rebooting of the router that fixed it, not the changes I made.  I confirmed this by undoing the changes, and the Chromecast still worked.So bottom line is that if you're having problems connecting to your wifi network, try rebooting your router and it may fix the problem.Now that it's running, it seems like a pretty cool device.", "verified": true, "helpfulness": "0/0", "author": "JM555"}, {"rating": 5.0, "review": "run's a bit hot but does what it's advertised by google to do.  I don't watch as much youtube as expected but it's there.", "verified": true, "helpfulness": "0/0", "author": "S. Lee \"Harry\""}, {"rating": 1.0, "review": "I was excited when my Chromecast arrived but little did I know what frustration awaited me. I have been streaming video to my phone, laptops, TVs and iPad without issue for years but I wanted to access a friends Plex server from my TV instead of my assortment of small screens. Little did I know Google decided to risk tarnishing their reputation on this poorly designed little gadget. Let them mature it before you buy it. My router is on their supported list. Many of my applications are on their supported list. The product will stream for a few minutes and then lock up. I have had to unplug it seven times, reboot it three times and done four factory resets in less than 10 hours. The product was new in a box, not referbished. Epic failure Google.If you are willing to participate in this production trial, please go look at their joke of a support site first. Your choices are reboot everything or check all the other devices in the chain for errors. At no point do they offer a way to check their device for errors. Oddly I can stream the exact same content to five other devices seamlessly and simultaneously while the Chromecast jitters and stops without any error. This product is going back.", "verified": true, "helpfulness": "1/1", "author": "Bill"}, {"rating": 3.0, "review": "I bought this with the hopes that I could use it to stream my Amazon Prime. It is not compatible, however. It's good to use to stream music videos for a party or gathering but that is all I use it for. I don;t have Netflix or Hulu. I wish I had known about the Amazon player that just came out because I would have just held out for that. Oh well...", "verified": true, "helpfulness": "0/0", "author": "Melinda Paradis"}, {"rating": 5.0, "review": "I bought this as a gift for my fiancee so she could watch Netflix and YouTube on her 6 year old LCD TV.  When I received it, I tested it on my 24\" LCD computer monitor, since I don't have a TV.  Setup was uneventful.  I installed the Android Chromecast app on my Nexus 5, and the apps for the Chrome browser on Windows 7 and Windows XP.  All of them worked reliably, though not without the occasional glitch.  I brought it to her house, did the factory reset, and set it up again.  In fact, her teenage daughter successfully performed the setup.  A few weeks later, none of their Chromecast clients (Windows XP laptop and her daughter's IPod touch) could contact the device.  She rebooted the router and all has been well again for several weeks.  She would have preferred a dedicated remote to control the Chromecast instead of having to use the laptop.  However, now that she has a new Android phone with the Chromecast app, she is satisfied.  My verdict is that anyone who can use a laptop, desktop, or smart phone can successfully set up and use a Chromecast.  The Roku devices, AppleTV, etc. may be a better option for those who subscribe to a lot of media services, but the Chromecast was a perfect $30 solution to her needs.", "verified": true, "helpfulness": "0/0", "author": "Jon Fleig"}, {"rating": 3.0, "review": "...Especially if you have a newer Roku and can get your HBO-GO on that device or similar.Still, kind of nice, but not terribly useful in my experience, to \"play\" Chrome browser screens on the TV.Kind of like the early days of Roku -- not many \"channels\" right now.", "verified": true, "helpfulness": "0/0", "author": "MGG Tiger"}, {"rating": 5.0, "review": "I have used Apple TV for years and my daughter got me a Chromecast for my birthday. I was skeptical at first. But this is so easy to use, just as easy as Apple TV. I like it so much that I got one for my girlfriend and a second for myself. I cast from my Google Nexus tablet, my iPad, and my iMac, my daughters Google Nexus phone. Using a tablet with Netflix or HBO Go is so much easier than the way I used to access these services using a remote control and no keyboard. It is so easy to find shows, resume shows. The control of the play/pause/resume from a tablet or PC is instantaneous. I play my music using Google Music (since iTunes does not work with Chromecast)  in the same way I use Airplay from Mac or iPad or iPod. There could be more apps, but right now it meets my requirements and I am very satisfied.", "verified": true, "helpfulness": "1/1", "author": "Ian"}, {"rating": 1.0, "review": "You can only \"Cast\" from Iphone or Ipad from apps offered by Google.  I even installed Google Chrome on my Iphone 4 but I still couldn't cast  programs to my TV offered on the web.  I feel misled because that is not stated.  Shame on Google... how much $ do you need?  Is being deceptive really worth it???", "verified": true, "helpfulness": "1/2", "author": "Joe Giordano"}]