[{"rating": 5.0, "review": "Great technology for those who don't have a smart TV with build-in applications (like YouTube, Hulu, ...). Pretty much eliminates the need to hook up a separate computer to the TV for watching online video. Convenience, simplicity, great price.", "verified": true, "helpfulness": "0/0", "author": "S. Kleyman \"qwerty99\""}, {"rating": 1.0, "review": "streaming delays. Not worth the price", "verified": true, "helpfulness": "0/0", "author": "laksen"}, {"rating": 5.0, "review": "WORKS  GREAT -- WATCH YOUTUBE VIDEOS ON YOUR BIG SCREEN.", "verified": true, "helpfulness": "0/0", "author": "Luthier"}, {"rating": 4.0, "review": "A little buggy when it comes to screen mirroring but an over roll super cool and awesome product for its price", "verified": true, "helpfulness": "0/0", "author": "soly"}, {"rating": 5.0, "review": "Great little device that does exactly what you want!  I watch movies on it with my family all the time.  A good value.", "verified": true, "helpfulness": "0/0", "author": "Leroy"}, {"rating": 2.0, "review": "Product worked perfectly... when it worked. Bought it brand new, and it died on me 9 months later... got the solid red LED. Trying to figure out a repair/return policy, if there is one if the original packaging is gone... bought a new one in hopes this was a rare dud unit. Buyer beware.", "verified": true, "helpfulness": "0/0", "author": "bdk1981"}, {"rating": 5.0, "review": "Bought one for myself and have come back for more as gifts for friends.  There is absolutely no reason not to have one of these (unless your TV/game system/Bluray player already does all the same stuff).Being able to let your friends throw up youtube vids into a community TV queue alone is worth the cost.Only major downside: no Amazon Prime Video and there probably never will be.  Amazon is pimping their own streaming stick alternative.", "verified": true, "helpfulness": "0/0", "author": "Brett Perlas"}, {"rating": 5.0, "review": "The best 30 bucks I have ever spent", "verified": true, "helpfulness": "0/0", "author": "K80"}, {"rating": 5.0, "review": "Love my chromecast.", "verified": true, "helpfulness": "0/0", "author": "B.Brown"}, {"rating": 5.0, "review": "Better than roku", "verified": true, "helpfulness": "0/0", "author": "vahik"}]