[{"rating": 4.0, "review": "Now I have a \"Smart Television\". Google has another produce that is customer friendly and desirable in other words a hit.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 3.0, "review": "The unit I bought has major glitches! I called tech support to have them send a new unit to my house. The one I bought was defective.", "verified": true, "helpfulness": "0/0", "author": "JOSHUA CHAMBERS"}, {"rating": 3.0, "review": "This works really well for Netflix and Youtube, but streaming from a browser has a little too much lag.  I love the option to stream from the browser, but it's pretty hard to watch when the mouths and audio are about 1 sec off.  It works with Netflix, Youtube, Google Play, and the browser.  I wish it worked with Amazon Prime and Hulu Plus too.  Hopefully, that comes in the future.Another big drawback is that I feel I was tricked into thinking it didn't need external power.  Notice how all the pictures of the Chromecast have a little port on the end?  That's where you plug in the power cord.  Not one single photo I saw had the cord showing.  You can plug it into the wall or a USB port, but it makes it a lot more cumbersome than originally advertised.I wouldn't buy this yet.  It seems to me that the Roku Stick has more options for streaming and doesn't need an external power source.  Although the Roku is $100 and the Chromecast is $35, I don't think the Chromecast compares yet.  Maybe when they support Amazon and Hulu.", "verified": true, "helpfulness": "0/0", "author": "Nicole Barney"}, {"rating": 5.0, "review": "I am in love with this device, I am a netflix member and my 2 yr old daughter can watch all her cartoons and shows on tv and I get to do my things on my laptop while she watches her show..If you have a subscription on netflix and use youtube then this is for you especially if you have a little one who loves to watch cartoons and movies..It's a reasonable price (me being a single mom and all) and I get use my laptop while the little one gets to watch her favorite stuff on tv. Also the device itself is so small and discreet you don't even see it..I love it!!", "verified": true, "helpfulness": "0/1", "author": "Tanya"}, {"rating": 5.0, "review": "Working off DLS and still no lag.  Works great with Nexus 7 and Asus Laptop.  Hope more apps are supported soon.", "verified": true, "helpfulness": "0/1", "author": "B. Hogge"}, {"rating": 3.0, "review": "When I read about this it sounded like it would play anything but unless it has the icon it will not play. I read that Google or someone has restricted it streaming anything and has limited what applications can work with this device! Kind of disappointing!also quality of videos was not great either!", "verified": true, "helpfulness": "1/1", "author": "LB Selix"}, {"rating": 1.0, "review": "I got this error when downloading the app, \"not available in your country\". It didn't say anywhere \" for US only\", now i bought it and is useless. There should be a message somewhere saying don't buy it if not in the USA", "verified": true, "helpfulness": "1/3", "author": "David Gonzalez"}, {"rating": 5.0, "review": "I was pleased that setup was so easy.  Works with phone and computer.  Also requires power connection to HDMI connection.", "verified": true, "helpfulness": "0/1", "author": "Lynn A. Carpenter"}, {"rating": 1.0, "review": "I thought I was going to be able to stream my ipod all the time and not just with two apps.", "verified": true, "helpfulness": "0/2", "author": "gustavo balderas"}, {"rating": 5.0, "review": "Really love this tiny device and what it can do. Even more, I really am excited for its potential. Easy and low cost way to get Netflix, YouTube, and Google Play on your television.", "verified": true, "helpfulness": "0/0", "author": "ameriporean"}]