[{"rating": 3.0, "review": "Needs more apps such as HBOGO and more functional apps. Also the mirror connection to the kindle Fire HDX 8.9 needs to be improved as the connection doesn't last very long.", "verified": true, "helpfulness": "0/0", "author": "KeppyMan"}, {"rating": 3.0, "review": "I like the FireTV but the remote is the worst!!!! The Batteries dies with in a week or less! It's driving me up the wall. I'm tempted to send it back and get another AppleTV.Amazon you need a remote App like Apple does. At this rate I'm going to spend more on batteries then on the FireTV!I've searched the internet and lots of people are having the same issue, and there's mo support help I can find or have gotten from Amazon. Hopefully someone will get back to me.", "verified": true, "helpfulness": "0/0", "author": "Chris B"}, {"rating": 5.0, "review": "it arrived at the promissed time. Was very easy to set up. It is really plug and play. the streaming speed and screen resolution are very good. I love it.", "verified": true, "helpfulness": "0/0", "author": "Robert Fonkert"}, {"rating": 5.0, "review": "Love the simplicity.", "verified": true, "helpfulness": "0/0", "author": "Circle of Feathers"}, {"rating": 5.0, "review": "Another great device from Amazon! I had no problems setting it up and since I upgraded my internet speed, it is seamless. I'm glad they got Prime Music on it for the holidays!... now if they would put some holiday collections for the screensaver in, it would be perfect! The original one is great, but not very seasonal. :( I am waiting for the Fire stick just as an occasional use for the upstairs tv.", "verified": true, "helpfulness": "0/0", "author": "shadow"}, {"rating": 5.0, "review": "Love the voice command! It is very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "karenronningen"}, {"rating": 5.0, "review": "We love our Fire.", "verified": true, "helpfulness": "0/0", "author": "Pottery Collector"}, {"rating": 5.0, "review": "perfect", "verified": true, "helpfulness": "0/1", "author": "Nicola Zamboni"}, {"rating": 5.0, "review": "Love my Amazon Fire TV!!! The voice search feature actually works, even with an accent. Small footprint, and compatible with Hulu, Netflicks, and others.", "verified": true, "helpfulness": "0/0", "author": "Benedict Renade"}, {"rating": 1.0, "review": "The remote does not work even though I changing the batteries it came with new ones. Very poor installation information as well. It certainly isn't just plugging everything in as indicated.", "verified": true, "helpfulness": "1/5", "author": "Kyle  O'Hara"}]