[{"rating": 5.0, "review": "A++, would buy again.  Also can work without connecting to a router in \"guest mode\".  Convenient for use at a hotel/work/public place, etc.", "verified": true, "helpfulness": "0/0", "author": "JA"}, {"rating": 5.0, "review": "i have this and the Apple tv in every room. I even have a small pc monitor in my bathroom with it connected ;) smart huh. Best thing about it. Is that its wirelesss and you dont need a 120v connection like my apple tv's", "verified": true, "helpfulness": "0/0", "author": "Mario_Tejada"}, {"rating": 5.0, "review": "Second one for second TV.  Works great!!  Very clear pictures.....keeps me sane during my assignment in Russia enabling me to see US TV programs from my tablet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This little stick is the best 35 bux I have ever spent.Google keeps updating this and it just gets better and better. For 35 bux I have replaced my cable subscription with YouTube and netflix.It also works to show your phone screen or chrome browser window. I use it to watch movies stored on my computer or phone. There are tons of video sites that support it like Daily Motion (good for foreign shows).It works amazingly well and is very reliable with an android phone. It never lags (provided internet is fast enough), and its stable. It's basically perfect.It's not quite the same thing as a roku or apple TV in that it does not store any video on itself, but it is able to play from so many sources and your local computer flawlessly so I never miss it.", "verified": false, "helpfulness": "0/0", "author": "CZ"}, {"rating": 4.0, "review": "works good!", "verified": true, "helpfulness": "0/0", "author": "matteo"}, {"rating": 3.0, "review": "I'm a huge google fan, but this product has been fairly flaky, failing to play videos, or getting hung up during playback. My cell phone and tablet right next to it on the same network don't experience any of these problems.", "verified": true, "helpfulness": "0/0", "author": "B Mitch"}, {"rating": 5.0, "review": "I AM OBSESSED WITH IT. BUY IT!. BUY IT NOW!", "verified": true, "helpfulness": "0/0", "author": "Mawie Talion"}, {"rating": 4.0, "review": "Works ok once we figured it all out.", "verified": true, "helpfulness": "0/0", "author": "Queen Esther"}, {"rating": 5.0, "review": "People having problems with this gadget must suck. It's fool proof. No problems, streams great.", "verified": true, "helpfulness": "0/0", "author": "Vincenzo"}, {"rating": 5.0, "review": "Love it. Way better than the roku one in my opinion. Lots more options!", "verified": true, "helpfulness": "0/0", "author": "Loe55"}]