[{"rating": 4.0, "review": "Love it so far and will give it five stars when more apps are able to work with the device", "verified": true, "helpfulness": "0/0", "author": "James T."}, {"rating": 5.0, "review": "gave this as a present , they loved it and haven't stop using it sincehe even stopped using the roku", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The set up is easy. Works great. We usually cast youtube, play movies, netflix, google music from smartphone. Press the cast button tv turns on automatically. Hope amazon prime video gets there too, as access to it from the tv is such a pain. We use Tv a lot more now.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Easy set up.  Able to watch netfix, youtube and other streaming from laptop with minimal set up.  Only downside is that there is a power cable that needs to be attached either to TV usb port or power outlet.", "verified": true, "helpfulness": "0/0", "author": "Justin Y. Cho"}, {"rating": 1.0, "review": "Does NOT perform as advertised. The ONLY thing it does is YouTube and Netflix, if you have an account. The advertisement stated 3 free months of Netflix which did not happen. .ALSO, the box clearly states, \" Send video OR anything on the WEB to your TV from your smartphone, tablet or laptop'. This also does NOT happen. VERY disappointed in this product!!", "verified": true, "helpfulness": "2/12", "author": "Doreen J. Murphy \"Doreen\""}, {"rating": 1.0, "review": "Does not cast (google's word for mirroring) from IOS unless you are using only the netflix or youtube apps. Not even from the Chrome broser APP. From a laptop, you can cast from Chrome. What a useless POS. Went back through promotional material and nowhere were these called out, infact it was all about how you can cast from anywhere and anything. I expect most people will return this.Do no Evil.. yeah right, Google! bloody liars", "verified": true, "helpfulness": "3/13", "author": "LAPR"}, {"rating": 2.0, "review": "Firstly all the ads say it cost $35.00, but I had to pay $70.00 at amazon.  What we realized later is that when they first came out some people bought a whole bunch so that they then could sell them at their price.  Too bad I didn't realize this sooner.  I would never have gotten it. Especially since we also found that it doesn't do what the ads say it does.  It only works with you tube and net flix that you have to pay for.We were also disappointed in the fact that you have to bring your Reuter close to the tv.  That could be an inconvenience for some, like us.Another thing it does not work with iPads although It works with an one of our iPhones and our laptop.After the initial novelty of it, we haven't used it and probably  won't.  Probably will put back the Reuter back in its rightful place and the chromecast back in the box it came in.", "verified": true, "helpfulness": "0/6", "author": "Josie"}, {"rating": 5.0, "review": "I really love this device, it's not near Apple TV but for streaming youtube videos fast and portable, it's really worth the price.", "verified": true, "helpfulness": "0/0", "author": "Nawaf Salem Alsuwaiyed \"Tech enthusiastic\""}, {"rating": 5.0, "review": "If you're looking for a portable device thats easy to set up and use to watch netflix on a tv that doesn't support it, this does a great job", "verified": true, "helpfulness": "0/0", "author": "Johnathan Loyd"}, {"rating": 5.0, "review": "My wife and I stream movies on netflix nightly. Now i can start a movie, \"cast\" it to large screen Hi-Def TV and check my e-mail,,,ALL WITH ONE LAPTOP !!  I couldn't be more pleased !", "verified": true, "helpfulness": "0/0", "author": "GeoPhilly"}]