[{"rating": 1.0, "review": "Does not stream smoothly.  Lots of \"jerking\" going on.", "verified": true, "helpfulness": "1/2", "author": "Audette Beck"}, {"rating": 5.0, "review": "Truly spectacular product. The negative reviews are mainly folks complaining about missing functionality that they did not bother to do research about beforehand.There is a good reason why this device is the #1 Best Seller in Amazon's Electronics, it does everything advertised and has made casting much more convenient for my family. Bought a bunch more to gift to family!", "verified": true, "helpfulness": "1/1", "author": "Nisha M."}, {"rating": 1.0, "review": "My chromecast died, google admits but won't replace because although warranty is valid, I'm overseas. I've just called Google support in US at (855) 836-3987 and got this information. This is related to a known issue on a automatic software update that took many devices to death (search google for chromecast update reboot stuck).", "verified": false, "helpfulness": "0/1", "author": "Bruno Magalhaes Martins"}, {"rating": 5.0, "review": "Used it on a daily basis.  Loved the product.  Going to get a 2nd one.The new backdrop (screensaver) feature is a good plus!", "verified": false, "helpfulness": "1/1", "author": "Zhaochen Liu"}, {"rating": 5.0, "review": "Very easy setup an after up download your apps watching tv brings you so many more channels to expore for your entertainment", "verified": true, "helpfulness": "0/0", "author": "Wanda Lambert"}, {"rating": 1.0, "review": "Horrible. Won't work with my router. Simple Google interface as fatally flawed as their arrogant \"self-driving\" cars. Crap that fails at the first hint of a problem. Not returnable. POS.", "verified": false, "helpfulness": "0/3", "author": "Miriam Hardin"}, {"rating": 3.0, "review": "I have a LG g3 and every time I use it on my tv (not a smart tv unfortunately) it lags big time. Same Wi-Fi connection. And even if I were to not use Wi-Fi I have Verizon wireless as my mobile carrier so the connection shouldn't be so bad.  If there was a way to fix this very minute detail than I think definitely it would deserve a higher rating for its accessibility", "verified": true, "helpfulness": "0/1", "author": "jose gutierrez jr"}, {"rating": 1.0, "review": "1) it can only be controlled by a wifi device. None of my home's hardwired computers can control it.2) It forces you to download Chrome web browser. Will not work with any other.3) My work netbook runs XP, an OS not supported.I have not been able to use the chromecast & I'd rather pay $40 for a Roku than $500 for a new wifi device.Money down the drain.", "verified": true, "helpfulness": "0/4", "author": "David Farrier"}, {"rating": 5.0, "review": "Excellent product. Very useful and inexpensive.", "verified": true, "helpfulness": "0/0", "author": "Kevin Streckewald"}, {"rating": 5.0, "review": "Simplemente fantástico.", "verified": true, "helpfulness": "0/0", "author": "Jonathan"}]