[{"rating": 5.0, "review": "I love this thing. It's making our tv watching so much easier. We use mostly with netflix, haven't had any problems, and will purchase more for additional tv's.", "verified": true, "helpfulness": "0/0", "author": "Tam Ferg"}, {"rating": 2.0, "review": "Too slow for streaming something from chrome.  And it only lets you stream from the chrome browser which makes it very limited to use", "verified": true, "helpfulness": "0/0", "author": "Priyank"}, {"rating": 5.0, "review": "I plugged it in and after some initial updating, I was presented with a clear 1080 HD photo-stream, which is the default Chromecast \"ready\" screen.  Using my laptop or phone (both have been setup for use), I start Google Chrome, or the Netflix app and tell it to cast.  What was on the phone or laptop quickly appears on the HDTV.  Using it at two different homes (one with only 6 Mbps download speed), the streaming is clear, full HD and almost NEVER has any pauses or hiccups. I am very happy!Other than the Netflix app, I have only tried some direct TAB casting from Google Chrome, with works great while surfing or reading email.I see Google is working hard at creating more apps and I hope we see Amazon Prime??, ESPN and others in the future!", "verified": true, "helpfulness": "0/0", "author": "mbotts"}, {"rating": 5.0, "review": "I have put a far amount of life equity into Google. So maybe it just fits me - Calendar, Email, Phone, Calls, etc etc etc. So needless to say I'm one of the 50+% percent of the world who uses Google Chrome browser exclusively. I Enjoy casting movies from play, tv shows form Hulu, pandora the ONE and only downside I have to say is, it doesn't yet support Amazon Video which I have corrected this issue by not buying my VOD's from Amazon. I hope they read that and take note, but Vudu and Google Play support Chromecast so that's where I'm building my online video collection. Its shockingly easy to setup. I use the \"For Service Only\" USB plug on my TV and it works fine.", "verified": true, "helpfulness": "0/0", "author": "Craig M."}, {"rating": 4.0, "review": "Overall my Chromecast experience has been very positive. I now have two in two different rooms of my house. I have Plex on my iPhone and stream video from my Plex Media Server. What I'm basically doing is throwing away the media interface on the TV and putting it on my phone. It's like an extremely detailed remote control and I get to pick where I play my media. It's very cool.I do only have one complaint, however this may be a Plex issue I'm not certain yet. Because everything is done over WiFi the files are converted down to a lower format so there is no lag with playback. So my 720p files are playing somewhere between 360p and 480p which really shows pixelation.If you would like to save a little money on buying this Chromecast, I would recommend actually buying one on Craigslist. People who are confused by the product or for there own reason don't like theirs are going to Craigslist. Plus it is basically brand new. The price on Craigslist...$20. If you don't feel comfortable with this, buy here.", "verified": true, "helpfulness": "0/0", "author": "Adam M"}, {"rating": 5.0, "review": "It's cool that I can stream showtime, netflix, etc from my Androids, but I have several terabytes of movies on my desktop that I can watch too! I am no longer tethered when I want to show my family pictures or movies!", "verified": true, "helpfulness": "0/0", "author": "Psi \"Psi\""}, {"rating": 5.0, "review": "I like my off-brand TV, but it was made before 'Internet-ready' was a big deal. Now I just 'cast' a movie or TV episode to the big screen, I get better sound, and I can continue surfing the web or writing emails. Best $35 I ever spent.", "verified": true, "helpfulness": "0/0", "author": "Dale Atchison"}, {"rating": 5.0, "review": "Love this so much we are going to buy more!  My teenage daughter loves it in her room for playing Hulu!", "verified": true, "helpfulness": "0/0", "author": "Jessica Bettingrr"}, {"rating": 5.0, "review": "Chromecast allows me to control my outdoor entertainment from my phone or table thru my home theater system.  The system is constantly being updated.  Gives you both audio and video.  Easy setup", "verified": true, "helpfulness": "0/0", "author": "Russell W. Patton \"clean music lover\""}, {"rating": 4.0, "review": "Works great for the things that support it. Would be awesome if anything you were doing on your phone or laptop showed up on your TV with it but only works for certain apps. (Netflix, HBO, Hulu, etc.) Whatever quality video you're watching on your device, that's how it should show up on your TV. Also, once your movie or show starts playing on your phone, you can back out and do other things on it and your show will keep playing. Not sure if this works with all apps but it does for the app I use and that would be TV Portal, which just started supporting chromecast and that's my reason for buying one.", "verified": true, "helpfulness": "0/0", "author": "damon"}]