[{"rating": 3.0, "review": "Though less expensive than the Apple TV, it also allows you to do significantly less.  For example, you cannot broadcast / mirror everything you are doing on your laptop or phone to the TV screen like you can between a macbook or iphone and the apple tv.  May be in the future Google opens it up to broadcast/mirror everything, but until then, definitely disappointed.", "verified": true, "helpfulness": "0/1", "author": "David Jesse Graham"}, {"rating": 3.0, "review": "I'm still just using it to see Youtube video. It can't cast web browser through smartphone(can cast through Chrome web browser of PC version).If Roku added Youtube and web browsing function, I would have bought Roku.Chromecast still needs lots of upgrade. Even Chromecast extension is beta version.", "verified": true, "helpfulness": "0/0", "author": "Kyungju Son"}, {"rating": 4.0, "review": "Its pretty much the smallest media player out there. The only problem that I have is unlike other devices this doesnt go to the next episode in Netflix. Other than that this is awesome!", "verified": true, "helpfulness": "0/0", "author": "Dylan Suchowski"}, {"rating": 5.0, "review": "I take my CCast with me everywhere.  It is so portable and easy to setup.  The price is great!  You use your mobile device or computer running the Chrome Browser to remote control your system.Excellent product. I am looking forward to future versions.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 2.0, "review": "Roku is 10 times betterDoesn't compareHad trouble setting up and had to have help from GoogleWould not recommend", "verified": true, "helpfulness": "0/2", "author": "A. Robert Fisher"}, {"rating": 3.0, "review": "Hoped that this was a substitute for more expensive streaming products, so I was disappointed that it didn't meet those expectations.Will use it on the kid's TV to get Netflix....", "verified": true, "helpfulness": "0/0", "author": "A. Castro"}, {"rating": 1.0, "review": "Get what you pay for. You can stream websites that other streaming boxes can't because you are using the full PC browser. Latency is a big issue especially when playing audio. Unsupported on my phone/tablet, my PC refuses to connect to it leaving my laptop the only thing in my house that can stream to the chromecast. quality is very meh, if the streaming boxes I already have just had a more full featured browser I'd have no use for this.", "verified": true, "helpfulness": "0/1", "author": "Christopher A Howard"}, {"rating": 3.0, "review": "I bought this because I have a digital camcorder, and I back up all my video on a hard drive. I was hoping to have a way to go through my archives and play back video on my television easily, basically a wireless HDMI cable. Although this is possible, it's not really as easy as I had hoped. First, you can only play back video through the Chrome browser, not my first choice for playing video. Second the video format from the camcorder doesn't work in Chrome, so I have to convert it to some other format first. Then when I do have a format that works it's not the smoothest streaming video. That being said, it was $35, so I'm sure that I'll find some use for it that will make it worth the money, and who knows they may have some updates that will improve the use of this. But for now I'll probably just continue viewing video on my computer screen.", "verified": true, "helpfulness": "0/0", "author": "G Stevens"}, {"rating": 4.0, "review": "The Chromecast is a great piece of technology, especially considering the price point and what it offers, not just now, but in the future as more apps/streaming options become available.  Set-up on a dual-band WiFi router was a little tricky for me.  If you have a  dual-band router, I would suggest doing web searches prior to ordering the Chromecast, so you are at least familiar with what you may be up against when it arrives.  After about an hour, I was able to get it to work - don't give up!What it does well:1. Watching YouTube videos from my Nexus tablet or Windows 8 Tablet - so much better on the TV when I want to show my kids something.2. Netflix streaming videos from my Nexus tablet - I find it great that I can get a show going for my kids and then use the Nexus to browse, check Facebook, etc, while they are still watching their program. I don't really care to watch what they are watching, so I enjoy this feature.3. Google Play TV - This is a nice touch from my Nexus tablet as we don't have cable/satellite at home so we buy the TV shows that we want to see and the Chromecast delivers!What I wish it did:1. Watch ESPN - again, since I don't have cable/satellite, it would be great to have ESPN support on the Watch ESPN app for the Nexus &/or web-support from my Windows 8 Tablet/PC.  No dice yet, so I run HDMI from my Windows 8 Tablet to the TV or use the app on my Xbox 360.  1st world problems, right?2. XBMC support - this will probably not ever happen, but here's to wishing.Overall, this is a cool little device and I'm anxious to try this out when I go to my in-laws for the holidays or on the road at a hotel, to see how easy/difficult it may be to set-up.", "verified": true, "helpfulness": "1/1", "author": "D. Robbs"}, {"rating": 5.0, "review": "The chromecast is perfect for streaming netflix from my computer or smartphone to my tv.  I also stream tabs in google chrome which works great with any online video streaming content.  Well worth it for the price. The only thing that it is lacking right now is that it cannot stream local content from computer or smartphone.  There was an option called fling, but google has disabled it.", "verified": true, "helpfulness": "0/0", "author": "I.m. \"Ivan\""}]