[{"rating": 1.0, "review": "Slow", "verified": true, "helpfulness": "0/0", "author": "Odai Al-Attal"}, {"rating": 4.0, "review": "it worked and whatever.  far less capabilities than there could be and until these companies start offer free streaming services for life with their product they're pointless devices really.  if you have a smart tv.  you do not need one.  if you have a laptop with an HDMI port you do not need one. If you understand nothing about technology, this product is for you.", "verified": true, "helpfulness": "0/0", "author": "IckyGreen"}, {"rating": 1.0, "review": "Not very pleased. Had high expectations after playing with a friends.  Not sure if it's my cable provider, but I'm not very pleased with the speed of it. When playing videos etc it pauses because it's trying to load or catch up. Feels like DSL all over again.", "verified": true, "helpfulness": "0/0", "author": "Brian Matte"}, {"rating": 5.0, "review": "bruh it a chrome cast bruh it like works and stuff bruh", "verified": true, "helpfulness": "0/0", "author": "ryan"}, {"rating": 5.0, "review": "Works as advertised, do some research before saying it's a terrible product soley due to ignorance before purchasing. Google chromecast streams or mirrors from your phone/tablet etc. Take for instance amazon prime movies/tv. Amazon will not let you stream directly to chromecast such as Netflix. However, if you play amazon movies/tv on your phone/tablet and mirror your screen, (\"cast screen\"), this solves that.", "verified": true, "helpfulness": "0/0", "author": "Taylor Fossey"}, {"rating": 5.0, "review": "Excellent for Netflix. I just start Netflix on my laptop and cast it over to the TV and it's fantastic!I've had it since it came out and have not had a single issue with it.", "verified": true, "helpfulness": "0/0", "author": "Nick T"}, {"rating": 5.0, "review": "Is perfect!!!", "verified": true, "helpfulness": "0/0", "author": "Luciano Milan"}, {"rating": 3.0, "review": "The chrome cast  works well, I expected it to work with all aps on my smart phone, most chrome cast aps are not interesting to me.", "verified": true, "helpfulness": "0/0", "author": "Sven3"}, {"rating": 5.0, "review": "Anything I have on my computer I can watch on my TV.  Simple.", "verified": true, "helpfulness": "0/0", "author": "Victoria Brown"}, {"rating": 5.0, "review": "Chromecast is the s***. If you have a TV, it should come stock with a Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Mike M."}]