[{"rating": 4.0, "review": "You get more undated movies and more for your money than Netflix ...no regrets", "verified": true, "helpfulness": "0/1", "author": "Kevin Whitlow"}, {"rating": 5.0, "review": "IS THERE A UNIVERSAL REMOTE THAT CAN WORK WITH THIS, MY BLU RAY, AND TV? samgenerelli@hotmail.com. contact", "verified": true, "helpfulness": "0/2", "author": "Cassandra Gershaw"}, {"rating": 5.0, "review": "This has been a nice upgrade from the old laptop we used to stream media. DO yourself a favor though, look up XBMC( name changing to KODI) and install that. You'll be happy you did.We also grabbed one of the Rii Mini wireless keyboards to use this, much faster than using the remote to type.", "verified": true, "helpfulness": "0/1", "author": "R. Humes"}, {"rating": 5.0, "review": "Love the Fire TV.  We are watching movies with prime instant video.  One of our better purchases.", "verified": true, "helpfulness": "0/1", "author": "sajk1"}, {"rating": 4.0, "review": "Love Fire TV, but my voice search isn't functioning properly. I need to do some research on this, because it's a great feature.", "verified": true, "helpfulness": "1/1", "author": "Scott A. Hiles \"Comic Book Fan\""}, {"rating": 5.0, "review": "We didn't have cable in our bedroom.  Fire TV is an easy way to have television and lots of movie selection without a monthly fee. We keep Amazon Prime year round for free two day shipping, so all of the movies and music are included and at your fingertips.  Great purchase.", "verified": true, "helpfulness": "1/1", "author": "Reggie Tate \"Tate\""}, {"rating": 5.0, "review": "really good and it is fast also", "verified": true, "helpfulness": "0/2", "author": "Luis Garcia"}, {"rating": 2.0, "review": "I t is a Great product and I like it but the down side is that I cannot pay HBO Directly it has to be through another source like cable wish i could just pay them directly so i can watch directly.", "verified": true, "helpfulness": "0/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is easy to use and allows for a great range of entertainment, most for no charge. Sorry we waited so long to get it!!", "verified": true, "helpfulness": "0/0", "author": "JoAnne Jahnke"}, {"rating": 5.0, "review": "More than we expected.  It's wonderful...so much to chose from and with voice commands!", "verified": true, "helpfulness": "0/0", "author": "Kris Archambault"}]