[{"rating": 5.0, "review": "I actually bought this in May but didn't get to hook it up until this weekend. The set up was so easy and literally took 5 minutes! I was so impressed. Everything I needed sans the HDMI cord was right in the box. Immediately upon connecting I was streaming and the processor in this device is top notch! I have a tivo downstairs and I have a smart blu ray player and the streaming of mlbtv baseball on the Amazon fire tv never froze or buffered once but it does occasionally on my other two devices. This made watching a game the way it should be. The apps are easy to navigate and initially download with ease. The device is small and classy looking and it is very quiet as it's operating. I didn't try the voice command but I highly recommend this device and the price for what you get is AWESOME!!! There is no HBO to GO as of yet but I am hoping that, that will come soon.", "verified": true, "helpfulness": "0/0", "author": "John W"}, {"rating": 3.0, "review": "The Fire TV stresses Amazon downloads to much.", "verified": true, "helpfulness": "2/4", "author": "Leonard J. Gauthier"}, {"rating": 1.0, "review": "Amazon, I was trying to order one of this product, but unfortunately it does not ship to FPO/AP address.  We, military service members overseas don't rate to have this too?  Please answer.", "verified": false, "helpfulness": "1/4", "author": "SammieG"}, {"rating": 5.0, "review": "Runs xbmc really well!", "verified": true, "helpfulness": "0/0", "author": "CPsilverspring"}, {"rating": 2.0, "review": "As a Prime member for over two years the adds for this unit seemed great, however, being over 70 and retired on Social Security I can only afford the free Prime. It is very, very difficult to determine what is Prime Free and what is not. It seems as if we are being tricked into ordering extra charge items.Please make it clear what is free and what is not.", "verified": true, "helpfulness": "12/15", "author": "James W. Anthony"}, {"rating": 1.0, "review": "Amazon Fire TV is nicer than the Roku 3 since you can eliminate a lot of typing by using voice search. It could have better interactive menus and use voice for menus as well. I would have given five stars, but, unfortunately the remote started having problems after about a month of use. Now it is difficult and annoying to use at times. I had so much more hope for Amazon than this.", "verified": true, "helpfulness": "5/5", "author": "Amazon Customer"}, {"rating": 3.0, "review": "First, I would like to point out that as a basic streaming media player, Amazon Fire TV is a very good product.  It is exceptionally fast, easy to install/use, and supports most of the popular streaming video applications used by the general consumer base (Netflix, Hulu, Youtube, etc).  If that is all you need in a media player, then this is a terrific product for you.HOWEVER, as someone who purchased the Fire TV as a streaming media HUB, I am sorely disappointed with the product.  The quantity, quality, and availability of the selections in the Fire TV app store is abysmal!!!  The number of apps available pales in comparison to other streaming media players and even console gaming systems.  To be honest, the my Sony HDTV has a greater variety of pre-programmed streaming video applications than the Fire TV.A large amount of the \"free\" apps are useless (and have intrusive privacy issues, such as third party usage tracking, etc) or require further payment to actually use the products.  Additionally, the Fire TV does not support most apps available in the regular amazon app store (especially games and streaming music).  Likewise, the types of applications offered range from the expected popular apps (Netflix) to a decent quantity of obscure/narrow scope applications (random regional church app for parishioners, chinese foreign media app, and, for a fee, random ambient noise or fireplace apps).  The gaming section is equally as sparse and fails to even include popular andriod game library applications such as Humble Bundle.The second major issue is with the layout of the amazon prime media selection itself.  Each of the genre lists presented appear to contain a plethora of titles (with a numerical catalog count of 150 or so per genre).  However, when one thinks they may have 150 or so titles to scroll through, the reality of the situation is that each season of a given TV show is listed separately (unlike Hulu and Netflix).  The seasons themselves are not listed in order within the list, with each genre list containing numerous duplicates.  The general appearance itself suggests that this is done to \"pad\" the catalog numbers, making the selection appear larger than it is.TL/DR:  Great/Fast BASIC streaming video player.  Horrible Application and Gaming variety.  Missing many major media offerings that are standard in the Google Play and Android Marketplaces.  For people attempting to separate themselves from cable tv, the Fire TV will not meet their needs.", "verified": true, "helpfulness": "4/5", "author": "ChaseTheGreen"}, {"rating": 4.0, "review": "Love this, use it everyday and I have one upstairs and one downstairs. I stream Netflix, HULU and Amazon Prime. The only thing I don't like, it seems to feeze up often and then I have to go into settings and clear my catche cookies memory. It's a pain to do this ever 10 days or so. I don't know why but after I do that it seems to work good again.", "verified": true, "helpfulness": "2/2", "author": "Jen N \"Jen N\""}, {"rating": 3.0, "review": "I won't bother going into the features as they are widely published and reviewed.I'll state my perspective as a custom home theater installer instead: while the included remote works well, and the voice feature is cool, the fire tv is a huge pain for anyone with more than a basic living room tv setup.  Any home theater setup or even just a well designed home that has a centralized media closet will have trouble with a fire tv, because they overlooked the most basic of functions and failed to include an infrared remote control option.  If there were published developer details for IP control, or an IR command input port, serial port, etc, this system could be easily integrated into a home automation system. Without that function or the ability to use discrete remote commands, options are limited. There is a USB ir receiver dongle on the market, but the programming is overly complex to make it work, and it simply should not be necessary.  Anyone buying one of these who wants to have it incorporated into an automation system should expect to spend several times the cost of the actual firetv on install costs from your local home theater installer, because of the additional equipment and programming that will be necessary. Even if you just want to keep your install simple and use a basic logitech harmony or other programmable remote, you're still stuck either cobbling together a workaround option with added equipment and manual programming, or having to use 2 remotes.", "verified": true, "helpfulness": "0/1", "author": "Nathan P \"nathanep\""}, {"rating": 2.0, "review": "Still too new i guess.  Almost a month and i was not able to watch something when turning on tv.  Continuously searching through shows, movies and apps.  I liked some of the games and relaxation videos (i.e. fireplace, music with beach and pinball), I just don't want to go through all that EVERY time i turn on TV.", "verified": true, "helpfulness": "0/2", "author": "Sue Se"}]