[{"rating": 4.0, "review": "The user interface is great, the device works flawlessly. This is a cool toy for the price. Great job Google", "verified": true, "helpfulness": "0/0", "author": "Michel Charest"}, {"rating": 5.0, "review": "Came on time. connected easily. no problems to get the movies streamed. Too little contents other than You-tube or Netflix though...", "verified": true, "helpfulness": "0/0", "author": "Isaac"}, {"rating": 3.0, "review": "....I cant stream videos I got on my hard drive. I don't know what it is about the format of these video files but roku and chromecast cannot display the video.This is great if you want to play videos off of youtube, but it doesn't work so good with other sites.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "This works well. I had a hard time getting it to work but I am older and it takes me a while to get any technical product working. I originally bought it for my mom's Vizio television and could not get it to work on the Vizio.", "verified": true, "helpfulness": "0/0", "author": "Carrie Selesnick"}, {"rating": 2.0, "review": "Remember back when Gmail came out and it was 10x better than annoy other email service available? Those days are over. Now we get products that are lacking some of the most important features. (E.g. Google Voice with no MMS) You can't stream your own media to it, so it's just something they use to get a kickback from the subscriptions you're paying for, AND you can't navigate Netflix or anything on the TV...you have to do it from your phone, iPad, or laptop, and stream it to the TV from there. Ugh...why do I even BOTHER with Google anymore? I know it's just going to fizzle away and they're going to drop support for it. Stupid purchase...I should have known better.", "verified": false, "helpfulness": "0/1", "author": "Advanced"}, {"rating": 5.0, "review": "Simple set up. Works like a champ! Great way to utilize your TV for more than over the air channels.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 5.0, "review": "forget about fire tv, roku or western digital .. easy set up, your cell phone or tablet as controller, lots and lots of tv show and movies, im happy", "verified": true, "helpfulness": "0/0", "author": "Manuel Avila"}, {"rating": 3.0, "review": "I thing that this was can control from web interface, but only transmit from computer, phone or tablet cast to chroncast.But in general is good.", "verified": true, "helpfulness": "0/1", "author": "alfredo chirinos"}, {"rating": 5.0, "review": "I love it so much I bout more.  I gave them out as gifts.  I love being able to cast youtube, aero,, netflix, google music ....etc all from my phone.  Great when family and friends are over.  Nice to control volume from my phone.", "verified": true, "helpfulness": "0/0", "author": "Jason McNeill"}, {"rating": 5.0, "review": "Awesome product. Perfect for my HDTV in my bedroom turned it into a smart TV. Easy to set up & configure.", "verified": true, "helpfulness": "0/0", "author": "Gregory Terrana"}]