[{"rating": 4.0, "review": "The Chromecast works well for most applications. Streaming NetFlix, HuluPlus, and Amazon seem to work fine after a few software updates. There have been issues streaming ESPN 3 but apparently it is possible. It is a good device to have when travelling with your laptop / phone / tablet.", "verified": true, "helpfulness": "0/0", "author": "LFP"}, {"rating": 5.0, "review": "Does what it suppose to...", "verified": true, "helpfulness": "0/0", "author": "jojocan \"jojocan\""}, {"rating": 5.0, "review": "So far so good, works as suggested. Going to tr my Kindle Fire HDX but don't expect it to work. Streamed from my phone through netflix and worked great. So far, it is as described and I will be trying it out when I have more time. For 40 bucks though I cannot complain whatsoever. We have a ROKU in the main room and it is wonderful but we spent a 100 on it and all I need is to have netflix available so it works great.", "verified": true, "helpfulness": "0/0", "author": "mgroman"}, {"rating": 5.0, "review": "This is great little gadget! It has more than a few little quirks and bugs that sometimes interfere with what you want it to do, but on the whole this is a fabulous way to add internet abilities to an otherwise \"dumb\" TV. For that matter the way it handles streaming through another device is often a much better way of navigating than many \"smart\" TV interfaces. One odd quirk (of many): you need to be on the same wireless network - having an a computer on a wired connection to the same wireless router will not allow you to talk to the Chromecast. Chromecast requires a wireless network connection on whatever device you are using to cast to the TV.", "verified": true, "helpfulness": "0/0", "author": "Steven K."}, {"rating": 2.0, "review": "Though I haven't found many uses for it yet and Netflix is a little sketchy sometimes I really love this little guy. My TV doesn't have a USB port so rather than spend $30-$40 on various cables to work it out of another HDMI port they give you a little wall AC adapter with a cord just long enough. I have crappy wifi but I'm getting a new router so it should help with the lag. All in all no complaints! Just wish I could use it a bit more. 4/5 StarsUPDATE 6/22/15ITS STARTED DOING THIS WEIRD THING WHERE IT CRASHES MY ENTIRE WIFI NETWORK AND REFUSES TO BE SETUP. HAD TO KNOCK IT DOWN A FEW STARS CUZ NOW I GOTTA BUY A NEW ONE", "verified": true, "helpfulness": "0/0", "author": "Stewy"}, {"rating": 5.0, "review": "A few hiccups with it randomly losing the connection but that's probably my wifi more than this device. So easy to use and much better than the worthless cords I bought that stopped working for no reason after 6 months.I use this to connect my 2nd gen Nexus 7 tablet to my non-smart tv. Works perfectly. Very happy with this product!", "verified": true, "helpfulness": "1/1", "author": "Melanie S"}, {"rating": 5.0, "review": "I love this device!  Easy to setup works with all my devices (laptop, Kindle Fire, android phone) and works well to boot!  I purchased a couple and may purchase another.  The vendor I purchased it from was also great, super fast shipping.", "verified": true, "helpfulness": "0/0", "author": "NS, Chicago"}, {"rating": 5.0, "review": "Love it....  makes showing movies and photos a breeze.", "verified": true, "helpfulness": "0/0", "author": "Frank Diaz \"compucot\""}, {"rating": 5.0, "review": "This is great.  I have this and a roku and don't need both.  Would recommend you get this for free streaming, streaming from the net on your phone or computer with an app (search for it and you'll find some free ones), or for Netflix/Hulu.", "verified": true, "helpfulness": "1/1", "author": "Sleepers Delight"}, {"rating": 2.0, "review": "very limited, won't buy another, would rather use a hdmi cable and stream everything", "verified": true, "helpfulness": "0/0", "author": "Stevan Brisevac"}]