[{"rating": 4.0, "review": "Buffering still takes too long. Be great if it was a direct link from computer to chromecast by diverting away from the router.", "verified": true, "helpfulness": "0/0", "author": "gil"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Carl R Mosesman"}, {"rating": 5.0, "review": "Great device. I use it multiple times throughout the week. I would appreciate a better way of streaming downloaded movies to it instead of playing it through the browser.", "verified": true, "helpfulness": "0/0", "author": "330cibeamer"}, {"rating": 5.0, "review": "Now I can watch my shows in my bed!", "verified": true, "helpfulness": "0/0", "author": "Janet Lei"}, {"rating": 5.0, "review": "Don't know what we did before Chromecast. A great product!", "verified": true, "helpfulness": "0/0", "author": "Wendy Douglass"}, {"rating": 2.0, "review": "On paper the Chromecast gets your hopes up, but in practice It's a pain to use.. Even with my decent connection, Chromecast feels like taking a step back a decade to dropped frames, low-bandwidth video. I have used it to watch a few shows that were only available on the web, but my friends ruined the experience by ragging on the bad video. I wish I had got the Roku Streaming Stick instead.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 4.0, "review": "bueno", "verified": true, "helpfulness": "0/0", "author": "ricardo daboin"}, {"rating": 1.0, "review": "a complete waste of money does nothing except broadcast what is ever on your computer to your TV", "verified": true, "helpfulness": "0/0", "author": "Larry Sprissler"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Darwin Orozco"}, {"rating": 4.0, "review": "I like the Chromecast thing-a-ma-jig. It works o.k. I'm finding I don't use it too much. While watching a movie (I use non premium sources), I lose the picture and then have to restart my tablet and the appropriate app. My wife finds this irritating and doesn't want to watch movies this way - a few pictures of our granddaughter is o.k.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]