[{"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Victor M. Carrasco A."}, {"rating": 5.0, "review": "It's a piece of junk, does several things just wrong, just a poor design but I'm still giving it 5 stars because with a good wifi connection it does allot more than it's advertised to do. If you read the adds it looks like it's a Netflix box and Netflix is what makes it worth buying, but add google chrome on a laptop it's one of the best $30 purchases you'll make. Stream anything, control Netflix with your cell phone. Buy 2 and name the TV's. anyone with a smart phone, tablet, or computer can control any tv. It's just like using a network printer... but easier.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "working as of now... will update later", "verified": true, "helpfulness": "0/0", "author": "General \"ver\""}, {"rating": 5.0, "review": "Everyone in my house uses the Chromecast. My 2 year old son understands how it works and my 4 year old mastered the Chromecast a long time ago. I have no reason to even look for a smartTV anymore.", "verified": false, "helpfulness": "0/0", "author": "balconio"}, {"rating": 4.0, "review": "It is great to use for every streaming program I have.  The only reason I gave it 4 instead of 5 stars is that you have to reset it every few months which is pretty normal for a streaming device.", "verified": true, "helpfulness": "0/0", "author": "PasadenaZ"}, {"rating": 5.0, "review": "love my chromecast.. i bought 4 more for all my other tv's. great for sharing photos, music, watching youtube, pandora, etc..", "verified": true, "helpfulness": "0/0", "author": "randy"}, {"rating": 1.0, "review": "I bought this to stream Netflix to my t.v., and it doesn't work. Disappointing.", "verified": true, "helpfulness": "0/2", "author": "Stephen A Rizzi"}, {"rating": 5.0, "review": "Great packaging and easy to install. Just make sure you have a device to use it.I would really love to see support with desktops or laptops that are on a LAN with a wifi router. I would use this a whole lot more.", "verified": true, "helpfulness": "0/0", "author": "RavenMac"}, {"rating": 5.0, "review": "I purchased this as a gift for my hubby, but everyone enjoys it in my house.  We have 2 smart tvs with amazon, hulu, netflix etc in our house, not to forget at&t; uverse.  Bought it mainly because hubby uses an app to watch european tv and I wanted him to be able to watch it in the big screen.  This was the perfect gift.  There are many apps, including netflix that have the cast button.  We find that we mainly do the cast screen, which is like a screen mirroring in Beta version.  Now, we use it to view the same apps/programs we view via the android phone or tablet, but also to view videos that we have in the NAS.  I love the wireless streaming.  I use ES Explorer to browse my NAS and just cast the screen to the tv and voila! Sound and quality are marvelous, couldnt ask for more.  I am thinking about buying another one so I do not have to move them around between tvs, and also as a house warming gift for friend.The usb is pretty small and comes with a long enough cable that if your tv doesnt have a usb you can add it to a charger.In summary for the $34 it is a steal.  The sound and video quality are good, well of course as good as video you are \"casting\".  The phone or tablet because like the remote control.", "verified": true, "helpfulness": "0/0", "author": "sommerfugl"}, {"rating": 5.0, "review": "Works as advertised. I am using this mostly with chrome browser to mirror flash videos. But using your mobile with supported apps works great which is what it is advertised for.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]