[{"rating": 3.0, "review": "\"It's okay\" really sums up the launch day version of Fire TV. It works, it's mostly zippy, voice search is pretty good at recognizing what you say, and if it was your first STB I don't think you would be disappointed.Having said that, I had several issues with it. Most of it was small stuff, but one really big problem. It's all stuff that could be fixed in future patches to the device, but at present this thing is strictly worse than a Roku 3 in my eyes.The big problem:Why is there not a dedicated prime video browsing section? Every other Amazon Instant Video app I've tried has a way to just browse Prime video content (Roku, iOS, Vizio TV app, Samsung TV app, the AIV website). But on this device, nothing. All I can find that is prime only is the Latest and Popular sections. I even tried running searchs for things like 'Prime Comedy Movies' and didn't get prime only results.As a prime user, that alone makes this device worse than a Roku.Nitpicky Annoyances:-Mostly unskippable introduction tutorial video. Upon starting your device (and after patching finishes) there is a tutorial video that is unskippable, ~but~ you can use the back button and back out of the tutorial. This will force you to rewatch the entire tutorial again.-Cloud Player is not a launch day app. Yes this is advertised, but I still want to complain about this. So if you want access to all your Amazon content, Roku is the better device again.-Slowdown then speed up scrolling. When you press and hold directional buttons to quickly scroll it has this annoying accelerate from stop going on. To better describe:1. When you tap the button to go right, the items on screen quickly slide one item to the right.2. Now if you hold down on the button instead of releasing, so you would trigger 'fast scrolling' right. It first stops, then slowly accelerates back up to a fast scroll speed.This stop and accelerate takes so long, you are almost better off rapidly tapping to go right instead of holding down.This also occurs if you are already rapidly taping along, and decide to hold down and let it 'fast scroll'.Random stuff:-It's pretty snappy in term of performance, though there is some choppiness whenever I return to the home screen after watching a video. But not really a noticeable difference vs Roku 3-Voice Search, pretty accurate. But not that useful in my use case. I use prime video heavily, so I spend more time browsing through what is available rather than looking for a specific title.-Gaming, eh. Not really what I'm after and I didn't spend the 40 for the controller so not something I can comment on.-WIFI MIMO, Roku 3 has it too so I didn't really notice a difference-Build Quality, feels sleek. Nicer than the Roku 3.", "verified": true, "helpfulness": "26/31", "author": "Z"}, {"rating": 5.0, "review": "I have the Apple TV, Google Chromecast, and now, the Amazon Fire TV.The Fire TV is great and on par with the Apple TV in terms of ease of use and responsiveness which I consider to be very important.The setup was easy for both wired and wireless connections and download speed is quick with no hint of buffer or jitter.The free content is broad and the layout is clear and intuitive.Overall, a great experience so far. I'm looking forward to finally ditching my $75 cable TV bill and getting a $10 Hulu Plus subscription.Don't forget to but an Amazon Basics HDMI cable and the game remote!", "verified": true, "helpfulness": "2/2", "author": "frogperson \"MMFF\""}, {"rating": 5.0, "review": "I ordered my fireTV on Wednesday and with my Prime Membership, I had it on Thursday for just $3.99 extra,It comes in a compact box that just looks cool.  The device it self continues with that cool look.Setup was super easy.  Just plug it into the wall and into the TV and it goes.  Connecting to my wifi was easy, and entering the password using the remote was the easiest I have ever done on a device like this.  Once connected, it updated the software and launched me to the home screen.I didn't have to set up my account, because it came set up to my account.Lots of apps, easy and intuitive navigation.  The voice search worked every time I tried it.I finally have a way to watch Prime Videos on my television.Highly recommended.", "verified": true, "helpfulness": "3/3", "author": "Jim G"}, {"rating": 1.0, "review": "Whether using the Roku, the new Amazon Fire or my Sony top of line DVD Blu-rays to stream, Amazon video streaming is AWFUL. It is impossible to sit through a single video, whether it's paid or free on Amazon Prime without it requiring multiple reboots. This happens on heavy use weekend nights as well as on week nights. I have the fastest wireless money can buy and have NO problem with any other streaming service. It's sooooo bad that Amazon has even been refunding my paid movies lately on their own initiative. As well they should. I turn to them less and less for paid streaming content because of this very annoying issue. One wonders if this is intentional on their part and is resolved ONLY on the Amazon Fire. My exposure to the Amazon Fire is too new to determine the answer. But I'll certainly be watching to see. In the meantime, I see no advantage over Roku, and am exceptionally irritated with Amazon for putting out the Fire (so to speak) before addressing their streaming problems. Not nearly enough servers/bandwidth for their customers it would appear. If the Fire has some kind of magic chip that solves the issue only for Fire owners/users - VERY disappointing...", "verified": false, "helpfulness": "0/0", "author": "WT Door"}, {"rating": 4.0, "review": "Looks like a great device and would gladly go to from my roku if it offered NHL gamecenter. That's the game changer for me so I'll be watching for that addition.", "verified": false, "helpfulness": "2/7", "author": "Amazon Customer"}, {"rating": 5.0, "review": "As the past and current owner of a Chromecast, a few Roku's and a Apple TV( All of which I like for different reasons), I was reluctant to give another streaming device a try but decided to have a fly at the Amazon Fire TV.  I have to say I am impressed with the level of polish this device has for being a 1st gen product.  The remote and the streaming box itself have a great look and feel to them.  Though I have had the device less than 24 hours, I am pretty sure that it will find a place in our home.The interface is well thought out though I do wish there was a way to make it a bit easier to access the third party apps or make them more prominent on the interface.  So far, I have run HuluPlus, Plex, Netflix, Riptide, and a few other apps (and of course the Amazon offerings) and have come away impressed with the speed with which one can navigate the various interfaces.  As an aside, the Plex app seems to be a little more robust on the FireTV. I am a Plex Pass user and have used their apps on Android, IOS , Windows and Roku devices and have yet to see the number of features on other devices that are present in this incarnation.Voice search works as advertised, just hoping that it is opened up to include 3rd party apps.  Though, this device is obviously not a hardcore gaming machine, the games did catch the attention of our 11 year old. I think that Amazon may have hit a sweet spot for the casual gamer who may usually do most of their gaming on mobile devices.  The potential price point of the games may make this an attractive alternative for those who do not want to spend the prices associated with gaming-oriented devices. Perhaps the, for now unused USB port, will provide a means to expand the storage of the device for more apps/games?...  Overall I have to say our family is impressed with the Amazon FireTV.  My only hope is that Amazon continues to build on this impressive start by adding more functionality and apps.  I will add more as our usage increases.", "verified": true, "helpfulness": "4/4", "author": "Jerry Palmer"}, {"rating": 4.0, "review": "Ok first off, if you are looking to get one of these things dont put all your eggs on one basket as far as other reviewers go. The bad ones I think are just haters, apple lovers, people who dont have one, or have nothing better to do but to not give thing a proper review.I got mine yesterday and had a few hours to play with it and use it. I have XBox 360 and used that for my Netflix and Amazon Prime but wanted something else to do that with. So Amazon came out with this and ordered it. Here is a list of good and bad. But understand I dont own apple or Roku.The Good:1. The speed and response on this thing is VERY VERY fast.2. The video quality is great. It truly is 1080p. I think that is better the what my XBox puts out3. The sound quality is great. I used a HDMI plugged it in to my 5.1 and sounds great.4. The hook up was very easy and straight forward. It is a plug and play.5. Hooking up to home network was very simple. I use the wireless and it so far runs flawlessly.6. The remote is small and very simple and not complicated very straight forward and very smooth.7. The movie and show load up time is very instant. With my Netflix it took no time at all to load up unlike my Xbox.8. This is the best part I thing anyway and so far no has said anything about this is...That you can take it with you on a trip. As long as the T.V has a HDMI and you can get on the wireless you can watch your programs or movies on any T.V. I think that is the best part about it all.9. It is small and very light.10. The voice search works really well.Cons and these may not be cons or bad for you.1. The voice search will only find movies or programs on Amazon Prime. But from what I hear that is cause of a deal thing with the other providers and that may change in the further.2. You can not power it down or put it to sleep. But for me that is no big deal. And really you can just unplug it if you want.Summery:Over all I find this unit works really well and it is very responsive. I have yet to see any lag with the things that I have watched or played with.Note: I have not used the games for this so this is only for the programs. I put it through its paces for the few hours that I have used it and so far I think that Amazon did a pretty good job with this.Note: After looking at the box and reading the back of the box there is a note that says there will be a Spring 2014 update. So my thinking is that the stuff that is \"missing\" or things that are not \"there\" will be coming soon. Just remember that this JUST came out a few days ago and I am sure that things will only get better in time.", "verified": true, "helpfulness": "57/66", "author": "Proud Model Train N Scaler"}, {"rating": 3.0, "review": "Received the Amazon Fire TV box yesterday and set up was as advertised.  Am I keeping it??  Jury is still out on that, can access Netflix and it is faster than the blue-ray player I was using, however I cannot find anything on \"Amazon Prime\" that does NOT cost me extra $$$$ to watch.  I need to do further research before I decide to keep this little box as I was mistaken as to my Prime benefits!!  So if you are a senior on a fix income you might want to really stop and consider this purchase, especially if you are looking for an inexpensive way to watch movies.", "verified": true, "helpfulness": "4/12", "author": "Shirley A. Hines \"Retired & loving it\""}, {"rating": 3.0, "review": "How hard is it to tell us what services will not be available outside the US?  Seems like a simple task instead of us having to hunt all over to find out.  I like the idea but wont buy right away until I find out the service coverage.", "verified": false, "helpfulness": "4/28", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really snappy interface, voice search works great and videos start instantly. I'd really like to see voice search work across other video apps like Netflix. Let's hope that's in a future update. I am more interested in the media side of this device than the games but it could get interesting when more TV-friendly, casual games hit the device.", "verified": true, "helpfulness": "4/5", "author": "C. Longo"}]