[{"rating": 3.0, "review": "It works once you go through the pain of installation.But typical Google, hard to install, poor support.They make it sound so easy in the marketing literature.", "verified": true, "helpfulness": "0/0", "author": "W. B. Smith"}, {"rating": 5.0, "review": "This is awesome little toy.  I got it when it was on sale and that made it even better.  There are other manufacturers selling similar stuff, but based upon my experience, this is the best.", "verified": true, "helpfulness": "0/0", "author": "M. Kim"}, {"rating": 4.0, "review": "Works well, but not as easy to setup as the Fire TV Stick. I still find it to be useful but will not likely purchase another one of these.", "verified": true, "helpfulness": "0/0", "author": "Ted \"tedpas\""}, {"rating": 5.0, "review": "Just a very simple and eloquent solution to steaming Netflix and Google Play products. I wish it had a remote because it can 'de-sync' the app from the TV and make it difficult to pause but it's very cheap. I honestly don't have any major criticisms because even the remote would be something that I feel isn't there fault because of the price point.I would also mention that with advertisements for these video streaming sticks there's a lot of discussion about what apps are available but I don't think it's a really issue because there's a lot of overlap between like Netflix and Hulu. Then with other more more niche app offerings, you didn't have them before so you're not missing them.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Liked it so much I bought one for every tv in the house.  Does have a few connecting issues when multipule devices are used, but worth the headache.", "verified": true, "helpfulness": "0/0", "author": "Odds"}, {"rating": 5.0, "review": "USED WITH PLEX THIS IS A UNSTOPPABLE COMBINATION. ANY DEVICE AND BAM THERE IS THE VIDEO RIGHT ON THE TV. NETFLIX APP BUILT IN IS FASTER THAN THE APP IN MY TV. GOOD JOB GOOGLE...NOW STOP TRACKING ME ITS JUST CREEPY", "verified": true, "helpfulness": "0/0", "author": "K5oscar \"K5oscar\""}, {"rating": 5.0, "review": "Handy for watching Netflix, Hulu, YouTube and other things via your TV from your Phone.For the original $35 it is great for making your TV \"smart\".", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "it's Cool and stable device, Thanks you", "verified": true, "helpfulness": "0/0", "author": "Ahmed"}, {"rating": 2.0, "review": "I had connectivity issues from day 1. Sync issues intermittently.", "verified": true, "helpfulness": "0/0", "author": "Krishna C."}, {"rating": 3.0, "review": "It was not compatible with my wifi configuration and that turned into the biggest hassle ever. So I'm not even using the chromecast I purchased.", "verified": true, "helpfulness": "0/0", "author": "Millie Mansker"}]