[{"rating": 1.0, "review": "I did not have a good experience with Amazon Fire TV.  Maybe it was a fluke or just bad hardware, but it literally only worked for me 1 day and only after tracking down Amazon Technical Support (which is not easy to find) and spending over 60 minutes on the phone worming my way through the system, was the problem corrected on a Monday only to have the problem re-appear on Wednesday.  It kept losing the device and technical support would have to \"reset it\".  After four times, that was the final straw.Additional reasons why I returned the Fire TV:  Many of the features I need from a media-center device do not exist.  No DLNA support.  Can't access anything on Windows Media Center.  No HDHomeRun Support.  Massive bummer as this device has all the makings of an awesome experience.  I can do some of these things on Kindle... But not Fire TV?  Odd.Maybe I will come back to this after this has been baked for a while.  But as of October 2014, not worth it.", "verified": true, "helpfulness": "2/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We recommend this for anyone who has trouble streaming Netflix etc.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great.  Absolutely no download problems.  Movies play without interruption to refresh.", "verified": true, "helpfulness": "0/0", "author": "Lefty Lowell"}, {"rating": 5.0, "review": "WOW! Lightening fast downloads! I have an older Apple TV and recently, it received an auto update that has been the kiss of death. I can't push anything from my iPad or Mac Book Air to the Apple device, so all of the videos that I bought from Amazon were no longer accessible to play on TV. I knew this was an Apple issue and not an Amazon issue because I could not push anything to the Apple TV device. I buy movies from both Amazon and Apple. I price them from both services, and a lot of times, Amazon is less expensive. Plus, as a Prime member, I have access to a lot of free movies.  When the Gaming version of Amazon Fire went on sale, I decided to buy it. I love Apple, I have been buying Apple products since the 80s, but I cannot believe how much faster this Amazon Fire is. It blows my Apple TV out of the water. The moment I click on a movie, it starts. I am not waiting for it to 'authorize.' I do not watch the wheel spin as it starts to buffer. I push watch, and I immediately watch my choice. If you have a Smart TV with HDMI ports, it is a snap to set up. I had it up and running in minutes. If you are thinking about buying one of these devices, I highly recommend the Amazon Fire. It is really fast. Like some other reviewers have written, it would be nice if the video choices were laid out, so you could see them all and not have to scroll through them. It would also be nice if they separated movies and TV shows in our libraries. But, that is a small issue compared to buffering issues. Amazon, you hit it out of the park with this one!", "verified": true, "helpfulness": "1/1", "author": "Gubio3"}, {"rating": 4.0, "review": "Very Good product , but I did not find a need for  it after trying it out for 30 days. I would recommend it to anyone that could have a need for it.", "verified": true, "helpfulness": "0/1", "author": "Hector Leslie"}, {"rating": 5.0, "review": "I bought this at the $85 sale price and with prime membership & in two days it was at my door. I hooked one attachment from my TV to the Amazon fire TV box with an HDMI cable (not included) and hooked an internet cable (not included) from to my intenet box to the Amazon fire TV box. It's really that simple.In seconds it played the instructions and in minutes I was flipping through shows and movies, watching trailers, and adding them to my watchlist. Then I settled down to binge watch some House of Cards on my big TV.The press and speak feature is so cool and fun and recognizes what I'm saying 98% on the first try and 100% on the second. This gizmo is giving me so much more access to my free prime and netflix stuff that I'm already paying for but not using. Also, anything I've ever bought video-wise is there on my video library. It was immediately set up for auto payment (which might piss off some people. but I loved). When I see something I wanna watch (that has a fee) I click one button and it starts playing.The only improvement would be for me to be able to speak into Netflix rather than type, and if Netflix and prime were integrated that would be darn nice (I have to search twice right now). It all works so smoothly - feels like I am holding the future of technology in the palm of my hand.", "verified": true, "helpfulness": "1/1", "author": "Donna Anastasi \"Spin the Plate\""}, {"rating": 5.0, "review": "I love this system. I actually have an Apple TV too and the combination of the two seems to work great. I'm very happy with this purchase. I bought one for my dad too.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 4.0, "review": "I really love how quick and feature rich the amazon fire tv is. It really shines with its quad core and 2 gb ram... it can handle streaming 8gb 1080p x264 like butter. The only reason I gave this 4 out of 5 is that from the main dashboard amazon really pushes its media down your throat. I am a prime member and it would be nice to have a section for prime and a section for pay. Otherwise i have bought a few apps that i love for this device and all of my media services connect and are lightning fast. Good job Amazon!!! But please really update your firmware to be more customizable as far as dashboard is concerned.", "verified": true, "helpfulness": "1/1", "author": "George IV"}, {"rating": 4.0, "review": "This little box is really entertaining. The voice search is great, except the search results are only for prime...I can't voice search something on Netflix or another app. It's quick too. Only issue is that for some reason, running fire tv causes my wifi to cut off, whereas other streaming devices have no such issue.", "verified": true, "helpfulness": "1/2", "author": "mom5679"}, {"rating": 4.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Tony Speirs"}]