[{"rating": 5.0, "review": "Great great, 2 day shipping with prime. Have bought 3 of them now.", "verified": true, "helpfulness": "0/0", "author": "rob"}, {"rating": 3.0, "review": "Not good to use in China", "verified": true, "helpfulness": "0/0", "author": "Zhang Heng"}, {"rating": 5.0, "review": "Works great. Easy set up. Much better than trying to connect to online TV with a DVD player", "verified": true, "helpfulness": "0/0", "author": "pairadox"}, {"rating": 5.0, "review": "My friends kept telling me to get one of these things and kept saying I have a HDMI cord so it's not necessary. I finally broke down and brought one and I LOVE IT!! I don't have to waste time fiddling with cords or stragically placing my MacBook/phone. I love that I can watch anything, I thought it was only capable of streaming Netflix and Youtube movies but I was soooo wrong! I can even watch Amazon Prime movies through this thing! I'm getting one for every room in the house!", "verified": true, "helpfulness": "0/0", "author": "Tashina"}, {"rating": 5.0, "review": "Awesome product and so simple to install", "verified": true, "helpfulness": "0/0", "author": "Miriam Seda"}, {"rating": 5.0, "review": "Absolutely love it .", "verified": true, "helpfulness": "0/0", "author": "irma lopez"}, {"rating": 5.0, "review": "I cannot buy enough of these. If I could plug one into my coffee maker or toaster I'd do it in a heartbeat.", "verified": true, "helpfulness": "0/0", "author": "Tom B"}, {"rating": 5.0, "review": "We love the chromecast! It is so convenient and works very well on our Iphones, iPads, Android and computers!+ You can cast Netflix through it, using your phone, youtube of course and many other apps.+ You can cast entire tabs from Chrome browser. This is awesome because you can watch videos in Chrome and then cast the tab to your chromecast, and watch it on your TV.+ For $30 I think this is one of my favorite purchases of the year.+ More and more services and apps are being added to be used with Chromecast+ Minimal software installation (Chrome browser or chromecast library)+ HDMI+ so easy to plug :)+ compactThis is definitely a nice gift for christmas, birthdays, etc.", "verified": true, "helpfulness": "0/0", "author": "TheFrenchFamily"}, {"rating": 5.0, "review": "We haven't had cable for 3-4 years now since we just used the Wii, Xbox or our Playstation to watch on Netflix, Amazon or Hulu.  But this thing makes it so much easier, smaller, takes no space and we can drag it along with our PICO 3 projector any where.  Fully recommend and will be buying 2 more for the living room and for my parents.", "verified": true, "helpfulness": "0/0", "author": "jorandjas"}, {"rating": 5.0, "review": "Purchased similar product in the past through in-store pick up and through \"traditional\" mall shopping. Amazon is so easy and the price is right.Product is awesome. I have them on all my TV's and have given them as gifts.", "verified": true, "helpfulness": "0/0", "author": "Mike"}]