[{"rating": 5.0, "review": "Easy to install, met our needs .Easy to use .We just love it.Recommend it .The price is right. Just click and buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Compatibility issues with no video or sound. Also connected to Samsung small Flatscreen with no better results.  Chrome cast trouble shooting did not provide any solutions.", "verified": true, "helpfulness": "2/3", "author": "Emily \"English Teacher\""}, {"rating": 5.0, "review": "This item is best value for money that you could get right now. Also it allows you to stream video and music from any stored media on your network. Very cool", "verified": true, "helpfulness": "0/0", "author": "Ian J"}, {"rating": 3.0, "review": "It is a fine streamer for 1/3 the price of Apple TV or many Roku. The services you can stream from are limited, although they may expand in the future. One real let down is that it only streams from the cloud. I wish it would stream media directly from my devices instead of Chromecast acting merely as a way to turn my phone into a very cool and super cheap media remote control. In our case, we live in a rural place without dependable high speed internet and very limited download bandwidth. So the ability to stream media files locally from my mobile device directly to the dongle would mean I could (for example) purchase a movie in the Google Play Movies app, download the media when I am near a good internet connection (pre-caching the media is called \"pinning\" in google Play Music and Movies), and then cast them locally to my TV when I get home. THIS DOES NOT WORK THAT WAY. Even if I have pinned a movie on my device, Chromecast will still try to download the media content from the cloud, clobbering my daily internet quota. But again, this is a strictly rural issue in the US. If you have great or even normal internet connection capable of streaming video, you have plenty to be happy about with this $35 streamer. If you are rural, or have limited bandwidth, get a mobile device with and HDMI output. That \"wired\" solution works great with pinned Google Play Movies.", "verified": true, "helpfulness": "0/0", "author": "Green Desert Home"}, {"rating": 5.0, "review": "If you have a 7 month old or older like I do the chromecast is worth 10 times what they are charging. I have a 7 month old that can work the native netflix app fluently on ipad, iPhone and iPod touch. She can now navagate through ios devices so fluently she now has her own iPhone and ipad. To face time grandma whenever she or grandma want and to watch netflix and amazon prime movies. We also have apple Tvs on 2 of our tvs. I've yet to get our doughter to learn how to use the apple Tvs.I own and install automation system for a living. So I'm constantly purchasing AV devices for testing and review. After installing a comcast in the living room for testing I was presently surprised my daughter tough her self to cast Netflix movies to the living room tv on her own. I have 3 more chromecasts on order. Do to the integration of native apps and simplicity of use I see these replacing all the apple Tvs in the house in the near future after google officially releases the sdk for the chromecast.By the way I'm a mac freak so for me to replace an apple product with an android device is saying a lot.", "verified": false, "helpfulness": "0/1", "author": "Justin T."}, {"rating": 3.0, "review": "I haven't been able to make it work satisfactory with my windows laptop and not at all on my Ipad except individual sites that are providing support. I'm hoping Apple and Google will get together to allow this to work from the browser so I can use my Ipad with my TV. My desktop running Ubuntu and Google chrome works flawless but it is in another room so not as convenient. Picture and audio quality is excellent.", "verified": true, "helpfulness": "0/0", "author": "Dwayne Theroux"}, {"rating": 3.0, "review": "Its ok as it streams Youtube videos easily...unfortunately very limited use other than what this device offer...pretty much just use it to stream Youtube as I dont have or use netflix. For what its worth...I think Roku is still better (its just they dont stream Youtube anymore)", "verified": true, "helpfulness": "0/1", "author": "Super_lumpia"}, {"rating": 3.0, "review": "At first it worked fine. For unknown reason, it had problem with network setting and I tried several configurations it still did not work.Disappointing.", "verified": true, "helpfulness": "0/1", "author": "Yi Pang \"Electron\""}, {"rating": 3.0, "review": "I like the product.  It works well with my tv.  I have a serious problem with Netflix.  I have repeatedly responded to their \"free\" trial offers only to be met with a paywall that demands credit card entry before the \"free\" trial.This problem has once again reared its ugly head.  10 days before my three-month trial ends, Netflix is demanding i enter a credit card because i lack payment info.  i think i will dispense with netflix because they demand payment for \"free\" services and their HD content is so far below HD it is pathetic.  I have tried every setting i can find but only receive SD or worse picture with large blocks of pixelization in the darker portions of the screen.  Before you say it is my ISP, perhaps it is, but COMCAST claims it is not throttling video and my speedtest.net tests report  30Mb down and 5-10Mb up speed.Chromecast rocks -- NETFLIX sucks.", "verified": true, "helpfulness": "0/3", "author": "T. Morgan \"Caveat Emptor\""}, {"rating": 4.0, "review": "Works great but needs more content. what else can i say? Great price and does what it is supposted to.", "verified": true, "helpfulness": "1/1", "author": "J. OLSEN"}]