[{"rating": 5.0, "review": "Really is a great  product !!  I can recommend to my friends works great :0)I enjoy every timeThanks Google ....", "verified": true, "helpfulness": "0/0", "author": "Luis Eduardo"}, {"rating": 1.0, "review": "This is a Google's attempt to distribute their Chrome browser. If you have a Mac and happy with Safari then you will still need to replace Safari with Chrome to make this player work. This is why this player is so cheap. I see it as a dirty trick by Google. I am returning my Chromecast back to store.", "verified": true, "helpfulness": "1/9", "author": "Greg"}, {"rating": 5.0, "review": "This is a great product for the price.  I found it to be quite easy to set up, and it works reliably (one reboot in a month).  I've only used it with Netflix so far.  More apps would be a good thing, but Google seems to be slow walking the process.  But for $35, it does the job.", "verified": true, "helpfulness": "0/0", "author": "TRP"}, {"rating": 5.0, "review": "Great product, more than satisfied,actually purchased another one. Make sure you have a mobile device for setup, setup from your pc and you will have to reconfigure your router.", "verified": true, "helpfulness": "0/0", "author": "steel70"}, {"rating": 2.0, "review": "I browsed the device on day-1 but neglected to pull the trigger and lost out on the Netflix deal- I wouldn't be so disappointed if I received the Netflix credit.  Still, at a comparatively $35 price I decided to purchase anyway.  That's the only \"pro\".WOW- HALF BAKED DEVICE!I'm an Android fan and have only Android devices in my home.  However, this Android device fails to impress me.  I feel like I'm using an Eclair device again.  Brings back bad memories!  :(WiFi signal strength is horrible, even with the dongle attached.  I have Google Music All Access and the device continually loses connectivity and stops playing.  When I play a Netflix movie, the device takes over the streaming chores but then if I want to pause the video I find that my handheld device has disconnected from the Chromecast.  No way to regain button-control of the Netflix stream.  So, now there's not much reason to use my Chromecast.I am very diappointed Google closed the interface to block 3rd party apps from using the Chromecast.  Let developers be creative!  I'd have many more apps to use with the Streaming media Player if Google would only allow developers to stream media to it.MLB- where is your support?  I've got some TVs that don't have a built-in MLB app.  Chromecast fails to meet my simple needs.Google: make sure the connection between the Chromecast and the streaming device don't lose connection.  You put connections in a state of limbo with no user controls. I can't even use my push-button Harmony remote control at that point other than TURN OFF.Lame device... it's now sitting unused waiting for an update to let me use it to it's potential.Don't buy it... yet.", "verified": false, "helpfulness": "0/2", "author": "S. Albert"}, {"rating": 5.0, "review": "This is a great way to stream content to your TV and with the anynet+ it can turn on my TV and switch to the correct input without me having to touch the TV remote.", "verified": true, "helpfulness": "0/0", "author": "Chunker \"My name is Chunker...I Wear a hat\""}, {"rating": 5.0, "review": "Updated 5/11/15: Not sure why I had to talk to a friend to figure this out, but once I did it worked fine. Use the extender for poor WIFI connections as it adds antenna length.  Also cell phones have a setting to check the internet connection with that needs to be turned off manually. Hopefully they updated the documentation and FAQs to include this.Between these issues and with the software updates that have been happening I am changing my review to 5 stars. Google keeps supporting it and now with HDMI control support it makes things much easier for setting up the amp automatically based on when something is shared.I tried setting this up with 5 different items...4 Cell phones and a MAC.It tells you to point your browser to the setup page. Once you do this I makes you download Chrome if you don't have it.  I understand this is necessary for it to function, but why do I have to download and install Chrome on my MAC to find out it is NOT SUPPORTED.  I tried to proceed anyway and it failed.  OK, try a phone.I point the chrome phone browser at the URL, and now it wants me to install chromecast on my phone from the playstore.I do this and try to configure the chromecast, but my Android phone keeps telling the the chromcast network is not reliable and disconnects from it before I can finish configuration.  I turn off the auto-netowrk switching and try again, this time it tells me my password was wrong...it was not.I tried from several different devices and never successfully connected it to the internet.  I received various error messages when setting it up. Most times it \"Could not connect to my wireless network\". When it would connect \"it was not able to establish a connection to the internet\".  All in all a waste of $35.  Seems like most of Google's other products...BETA.I love the idea this is, but I am fairly technical and was not given a way around the issues I encountered and it frustrated me.  I may try this product again if they can figure out how to make the setup work.  I think they tried to dumb it down more than they should have. Provide an alternative to setup and I may change my rating.", "verified": true, "helpfulness": "1/3", "author": "Dan Durig"}, {"rating": 4.0, "review": "this product will NOT cast proprietary video players, such as HBOGO and Showtimeanytime.  It will, however, cast video players which are embedded into the chrome browser, such as hulu and crackle.NOTE:  if you launch the video player out of Crackle, it will NOT play.  Why? ,, because the crackle video player is not (yet) supported with Chromecast. In order to 'cast' a video from Crackle you must stream it from Chrome, then expand your screen.  The fallback in doing this is that it consumes your laptop (or other PC) whereas you're not able to surf or perform other functions on your laptop while the video is playing.I'm guessing as time goes on the proprietary video players such as HBOGO, showtimeanytime, crackle and others, will eventually support chromecast, but as of today, 10/19/13, it does not.on the other had, it works great with Youtube, which my Roku doesn't support.  In a perfect world, there will be one product which will support ALL streaming sites.  Until then, there's a lot of money to be made by selling all these individual devices for each video site.Hope this helps.", "verified": true, "helpfulness": "1/1", "author": "Andrew N. \"King Andrew\""}, {"rating": 5.0, "review": "I bought this as a Youtube Streamer. I own a Roku as well, That is an awesome Streamer. But accessing Youtube is a painful process. This little thing just works and as long as your in the Chrome browser, you can do just about anything. Last.fm on your Surround sound! Pandora, Google play Music! it just does it. I really like being able to queue up video's on my phone then it just plays them.The only problem I've run I've run into is that the app doesn't really get along with my Older Android phones. It will work fine with Youtube for a bit then crash the phone. And I haven't been able to get the Google play Music app to actually Cast.. No biggie, It's new and they seem to be kicking out updates so the app might work better in time.If your looking for a cheap Youtube Streamer, I would definitely recommend this. I think this little guy may have just relegated my Roku to a Movie rental Box. And it may eventually completely replace it.", "verified": false, "helpfulness": "1/1", "author": "Carl T."}, {"rating": 4.0, "review": "I understand that Google will be adding feature and things to it, cool.  Still wish there was still something more amazing that what it is.  Great gadget, I like that I can check out my youtube clips on a big screen but still wish it was just more.  Hard to explain.  I don't regret buying it, just wish there was more even though I know it's kinda new and it will improve.", "verified": true, "helpfulness": "0/0", "author": "Greg Colic \"G.A.C.\""}]