[{"rating": 5.0, "review": "I don't care for a lot of new technology because I'm pretty old school. Do have cell phone, home computer and basic know how for some of the  stuff out there today but was able to connect the Amazon Fire to my HDTV just fine. After a few minutes of figuring out my password I hooked right up and there was Netflix, which I already subscribe to. With a phone call to them I was able to get everything working together. Thanks Netflix. As far as ordering movies that I have to pay for I'm not doing that at this time other than Netflix, but the whole concept of Amazon Fire means I don't have to mail anything anymore. It is more expensive than some of the other similar items out there and in the future I will probably avail to the other options available, but so far, so good.", "verified": true, "helpfulness": "0/0", "author": "E. Adams \"hardatit\""}, {"rating": 5.0, "review": "I don't have cable in my room so this is perfect!!!!!!! Now I can watch Netflix and amazon prime in my room!", "verified": true, "helpfulness": "0/0", "author": "Caitlin McCarthy"}, {"rating": 5.0, "review": "I have neither cable or satellite TV, antenna channels are spotty.  I use DSL.  This is fast, no loss of HD quality.  Combined with a Prime membership, it makes for a very economical viewing experience.  I like that the remote does not need line of sight.  When it goes into standby mode, you get a really nice assortment of pictures  Also this was the simplest device I have setup in a long time.  It just plain works.I had tried the Google TV device.  Trouble was you needed to have your computer on for it to \"cast\" to the TV.  Often, I would still have internet connection but the connection to the TV was lost and wouldn't come back until the next day.  This would happen in the middle of what was being shown.Back to Amazon Fire TV, voice help is cool, but it does not always do what I expect.  It may get better as it learns my voice.  But the ease of finding material I like without the voice search is amazing.  It has found shows, series and movies that I truly enjoy and had no idea existed.  I understand there is going to be even more content by the end of May.One other thing, people in the house can still use their computers online when Fire TV is in use.On a large screen HD TV, picture quality is first rate.  Sound quality seems better than other sources.  It loads very fast, between instant and 2 seconds for most programs I have watched.  It is much faster than Blu-ray and I think the quality is equal.", "verified": true, "helpfulness": "1/1", "author": "George R."}, {"rating": 5.0, "review": "I am very impressed with the speed of this device. I have had it for about two weeks and not one single time has the video paused for buffering. The amazon prime streaming service works especially great on it, as it would be very slow on my ipad.", "verified": true, "helpfulness": "0/0", "author": "Robin Smith"}, {"rating": 4.0, "review": "This is a great streaming device. Amazon Fire TV is very easy to set up and is also user friendly. Be aware of the fact that not all apps are yet available for the device. HBO Go and a lot of other apps are able to be streamed on your Kindle but not to your Fire TV...I called customer service and they said that fire tv will have the ability to download more apps.", "verified": true, "helpfulness": "0/0", "author": "Mike Panora"}, {"rating": 5.0, "review": "AMAZING AMAZON!  Installed in less then 2 minutes, learned how to use in 3 from video and LOVE the voice control!", "verified": true, "helpfulness": "0/0", "author": "Christian L."}, {"rating": 5.0, "review": "This is the easiest device for finding what I'd like to see that I've used. Just talk to it, like Gary Busey said. The HD picture quality is great too.", "verified": true, "helpfulness": "0/0", "author": "John T. Earl \"John Earl\""}, {"rating": 4.0, "review": "Needs to extend voice search to other areas.  Like Plex, Netlfix, etcOtherwise the best device and I've owned most of them.  Beats Roku, Apple TV, Logitech Revue,.....", "verified": true, "helpfulness": "0/0", "author": "thewrightman"}, {"rating": 2.0, "review": "almost the same as goggle but more then double  the price It is nothing more them an outlet for amazon to sell more movies the free prime movies and tv shows are very very limited.Anything of interest that is free on reg. cable TV cost on on this service.If you don't have cable it is for you but if you have it don't waste your money", "verified": true, "helpfulness": "1/4", "author": "bruce miller"}, {"rating": 5.0, "review": "I bought this to save money on my cable bill. I was able to cancel all but basic (for the local news and weather) and still watch all my favorite shows! The cost was much less than I was paying for one month of cable and my grandkids love it.", "verified": true, "helpfulness": "1/1", "author": "CynthiaSNY"}]