[{"rating": 1.0, "review": "Google customer service is really bad. They will never able to solve your problem as they are illeterate and does not have knowledge. Their behaviour is also bad.", "verified": true, "helpfulness": "0/2", "author": "SK"}, {"rating": 2.0, "review": "Holy crap, Chromecast is a trainwreck of a device! It is wholly dependent on you using a laptop, android or ios device. It is basically a device mirroring gadget, what you see on a smartphone, laptop, or tablet screen, is what is mirrored on a larger TV. I was going to give this as a gift but I cannot in good conscience as it is a waste of money for anybody except the most hardcore of tech nerds. This is a cool gadget for a party or family gathering but if you want something to stream your NetFlix, HuLu, Amazon Prime, etc., go buy a Apple TV, Roku, Amazon Fire TV, or modern game console. Those devices have those apps built in and are an always connected to your TV device so all you need is an account to the services you want to watch. If you already have a tablet, just watch your content there. Just remember, if you do not have a smartphone, tablet, or laptop handy when you want to use the device, it is only a powered dongle. At leats with my Apple TV if I want to watch NetFLix or Crunchyroll, I can just turn on the device and link my account and then - BOOM - content is available. If I want to stream my iTunes purchases again - BOOM - it can access my iTunes account and play any purchase I have made. If the apps were built onto the device it would be a worthwhile purchase but since it is wholly dependent on other devices, it is a step down from ANY modern device (game console, streaming box, etc.) in that aspect. The reason that it got at least two stars from me is that the variety of apps you download on your phone that stream natively to the device is impressive.", "verified": false, "helpfulness": "1/5", "author": "Vernon E. Parker III"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "zohar"}, {"rating": 5.0, "review": "👍👍", "verified": true, "helpfulness": "0/0", "author": "Mubarak"}, {"rating": 5.0, "review": "This is a great product.Easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Zlatka Ilkova"}, {"rating": 2.0, "review": "Not much to use. I wanted to watch sling box TV on my 55 inch TV with my laptop which do not have HDMI output.I first tried to show a google chrome tab which shows my sling box TV then it shows the tab but  don't know whythe only a part of screen which shows TV isn't shown up on TV, that parts is just black.I installed google cast beta which allows to send entire laptop screen and tried to show my sling box TV on TV.then it showed TV but frame rate is not very fast so that the TV is not smooth, it is hard to keep watching TV like that.so, basically it didn't fill my needs. It shows desk top and chrome tabs. just good for watching picture, desk top but notsling box.  Youtube is ok. I still keep it connected to my TV but not much thing to see on it. just consume extra energy,I guess I'd better remove it from my TV.", "verified": true, "helpfulness": "0/0", "author": "Texas Ozy"}, {"rating": 5.0, "review": "Fantastic google tv accessory.", "verified": true, "helpfulness": "0/0", "author": "LaHa"}, {"rating": 5.0, "review": "Love the Chromecast! The recent updates have really improved it. Love that I can cast my tablet screen to the TV.", "verified": true, "helpfulness": "0/0", "author": "T. DeLong"}, {"rating": 1.0, "review": "If you are a Verizon FiOS customer do not buy this product it will not work!!!!! I had to call Verizon tech support and we changed all the modem settings and it still doesn't work its a waste of money because you can't return it", "verified": false, "helpfulness": "0/2", "author": "jenn"}, {"rating": 1.0, "review": "If you enjoy spending hours and hours trying to figure out why this and that, and particularly sound, does not work, give it a go.  Great idea, pathetic implementation.", "verified": false, "helpfulness": "1/3", "author": "Keith J Thibodeaux"}]