[{"rating": 4.0, "review": "works fine for me great product", "verified": false, "helpfulness": "0/0", "author": "dwight morris"}, {"rating": 4.0, "review": "As promised and arived in time.", "verified": false, "helpfulness": "0/0", "author": "tondello"}, {"rating": 3.0, "review": "I just got it but so far it is good.", "verified": true, "helpfulness": "0/1", "author": "Howard Janapol"}, {"rating": 5.0, "review": "Very easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "Darron Baker"}, {"rating": 5.0, "review": "This is the best value on Amazon. Google supports this product with live support--we called, they answered and walked us through a technical issue with a smart techie with no wait time! It turned it out it was much easier than we were making it, lol. I connected this unit to an older model Samsung (about 6 years old) USB port. You go to the Chromecast website, plug this into the TV and do the set-up. You must have Wi-fi.I connected my parent's iPads, iPhones and Windows notebook to it. It will come up as Chromecast on the Source options list for your TV. Then you have to download the apps you want to use on Google Play or iTunes. (BTW--GL Wiz does not have an app for this even though Google makes the code available to developers--hence our technical issue).To work it, you select the Chromecast source input on your TV. Then when you open an app or your browser, you'll see a little TV icon that you select to activate it on the TV.  It is that simple. My parents are in their 70s and they find it very easy to use to watch Netflix, YouTube, and anything they want on the TV--this is amazing considering my mom just learned how to email this year.I am getting one for my son so he can play his apps on the TV, and one for my daughter in college for her viewing her lecture sessions. Amazing little piece of gadgetry for so very little--best tech money I've spent all year.", "verified": true, "helpfulness": "0/0", "author": "A. Paulson \"alliealia\""}, {"rating": 2.0, "review": "You can use only limited things only you tube and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Biren Patel"}, {"rating": 5.0, "review": "Excellent streaming stick, very affordable, easy to use and setup. Works fantastically with Netflix and plex.", "verified": true, "helpfulness": "0/0", "author": "A.Technohollic \"Technohollic\""}, {"rating": 4.0, "review": "Drops connection fairly often but I see the major potential and I enjoy it.", "verified": true, "helpfulness": "0/0", "author": "jonathan Philemon"}, {"rating": 5.0, "review": "Really good !", "verified": true, "helpfulness": "0/0", "author": "Sergio Eduardo Novoa Melchert"}, {"rating": 5.0, "review": "Easy install, instant use.  Have watched a PBS stream, a Hindi movie stream, etc.  Dont see any problem yet.  Maybe because I use it so little, I do Netflix, Amazon and vudu directly off the internet connected TV.", "verified": true, "helpfulness": "0/0", "author": "Real Conservationist \"umeshrao\""}]