[{"rating": 3.0, "review": "Seem to be having a problem with clear vocals. Also have a hesitation at times making watching a show via internet to TV almost unbearable. Anyone have a suggestion??", "verified": true, "helpfulness": "0/0", "author": "vicki cohan"}, {"rating": 5.0, "review": "This is awesome and well worth the price as they are adding more apps all the time.", "verified": true, "helpfulness": "0/0", "author": "Raknahs Rian"}, {"rating": 5.0, "review": "I've spent many nights with friends and family laughing at youtube videos that we can ALL see at once with this handy little device. Totally worth the money.", "verified": true, "helpfulness": "1/1", "author": "Mags"}, {"rating": 5.0, "review": "Google product!!  What more needs to be said?", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 5.0, "review": "Like many of you, I struggled with the decision of choosing between this little gadget and the many similar, or even more powerful products out there on the market. I researched several products and spent (way too much) time comparing.I ultimately landed on the chromecast, and here's the short reason why: The COST was low, i didn't have much to lose. Chrome cast's capability is limited, but sufficient for my needs currently, and can be augmented by finding some good apps. Those apps can cost money, so if you have immediate plans to use your device to accessChromecast is great for Netflix, YouTube, Crackle, and Hulu. If getting those apps to play on your TV are really the only use you're looking to get, stop reading here, and just buy the Chromecast. They integrate seamlessly from your device to play on your TV. Most/all phones with chromecast don't even require you to keep the specific app open while you watch, allowing the user to continue using their phone for other purposes.Here's an adequate, though incomplete chart from businessinsider.com comparing various similar products with the Chromecast: http://www.businessinsider.com/tv-streaming-products-competition-chart-2014-7It might be able to answer all your questions and help solve your media consuming needs.Now, if you are still interested, here's my reasoning behind why i picked the Chromecast and am still happy with my choice:I was willing to lose out on the ~$35 I spent on the Chromecast if it didn't end up meeting my needs. I realize that money could be put toward a more powerful device, but I also realize I own multiple TVs and the Chromecast would likely end up getting used either way as long as I wasn't completely disgusted with it.My plan was to buy the chromecast and use it for a couple of it's simple purposes that i for sure wanted, and then upgrade to Roku or Apple Air, or another similar product if I wanted more. Since then (10 months ago), I still haven't bought anything else. I use chromecast nearly every day. I've found that chromecast does all that I personally need by using a few apps that I already owned. I'll explain in a paragraph or two... but it allowed me to pick and choose the features I wanted a la carte. That being said, the most simple and streamlined way to get some or all of those features would be to buy a more expensive product in the first place, and saves the hassle of figuring out to integrate multiple apps.Power of chromecast:The chromecast can cast tabs, which opens options up significanty for its use, but is also heavily dependent on how good your wifi router and internet connectivity speed is (speed is going to affect any device though). Other devices function without having to communicate with your phone or tablet. Apps are being added slowly over time. Plex allows for remote viewing of your computer's media. Slingbox allows you to view your home tv and dvr from anywhere in the world on a phone or tablet (like the dish hopper), with the help of a chromecast, you can then sling your video to the TV you're currently near, assuming you have it connected to a chromecast device and have wifi access.One thing about the Chromecast to know is that although it looks like a simple thumb drive, it's a bit bigger and some TV ports will need the dongle (the small extension cable included with your chromecast) to hook up and still allow other HDMI cables to insert in adjacent ports.", "verified": true, "helpfulness": "4/4", "author": "Larry"}, {"rating": 5.0, "review": "it works like it's supposed too, love it.", "verified": true, "helpfulness": "0/0", "author": "Vivalamiseria"}, {"rating": 5.0, "review": "Husband loves this. He plays youtube and streams to our tv. Its very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Carin"}, {"rating": 4.0, "review": "so far is good products and good .", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Try to stream movies using Apps and it constantly buffers even on lowest quality setting.", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 5.0, "review": "One of the best invention Google has made.  My son uses it all the time.Thanks again.", "verified": true, "helpfulness": "0/0", "author": "Ruth Colon"}]