[{"rating": 4.0, "review": "I got this since we were trying to do away with Dish. So far we have been watching old tv series and it's been going fine. But we haven't tried other things.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I was excited to early adopt the Amazon Fire TV. I was an early adopter of the Kindle Fire and Amazon Prime and have been very pleased with the kindles and prime service. The Fire TV was pre-configured to my Amazon Prime account and set-up was a breeze. That warm and fuzzy feeling about my purchase quickly faded after about an hour or two of my son playing Asphalt 8 Airborne car racing game. For some reason, the sound completely drops out. We later noticed this to occur after watching movies. My profession is that of an electrical engineer and techie, so immediately I suspected an overheating issue. The box is located in a well ventilated area and the room temperature was at 72 degrees F. To the touch the box felt much warmer than I would expect. I also noticed that there are no vents in the box itself where heat can dissipate. I contacted Amazon regarding the sound problem and explained to them that I suspect an overheating problem with the box and that I took precautions to insure that it was in a well ventilated area. The rep said that he would contact their engineers. A few weeks later I received a follow-up message that their engineers suspected an overheating issue (thanks a lot for confirming what I already knew) and that I should move the box to a better ventilated area.I would have a returned it then and there, except that my son has already invested a lot of time to build up credits in his racing game that we fear will be lost with a box swap. As a last resort, I bought an electronics cooling fan to set the Fire TV box atop in its already well ventilated area in hopes that the overheating problems would be resolved. It helped, but not entirely. Instead of the sound dropping out after an hour, it drops out after about 1.5-2 hours. I suppose I could relocated the Amazon Fire TV box in our refrigerator and run a really long HDMI cable to our TV, but still not sure that would fix the overheating problem. It's hard for me to believe that Amazon \"Engineers\" would design a \"dual core\" set-top box like the Fire TV and not include in the design any ventilation slats or other heat dissipating measures. My recommendation for anyone considering the purchase of an Amazon Fire TV is to either wait until Amazon fixes the overheating problems or learn to read lips. I already have several Rokus for my streaming TV, so I think I will stick with Roku for now. I may need to look into Apple TV as well. I'm disappointed in Amazon's customer support regarding there Fire TV. Hope they provide better support for Fire TV and their new cell phone. Don't think I'll be an early adopter of Amazon technology until they better manage their product launch and customer support.", "verified": true, "helpfulness": "4/6", "author": "Chalupa Batman"}, {"rating": 4.0, "review": "i like this a lot.the voice recognition works well too, and the user interface is very good.however, there are two negatives:negative 1:  is the box of the unit (not the packaging, but the unit itself).the edges are to sharp, and the corners are down right lethal.  the box should 'bevel'the corners and edges.  you don't want to have the unit in a place where a child would pick it up or bump into it.negative 2: several of my 'favorite' internet channels are not (yet?) available, and are available for the ROKU", "verified": true, "helpfulness": "0/1", "author": "Elhosots"}, {"rating": 5.0, "review": "Oh look, you can watch movies, tv shows, and even play games! Amazon fire is like a piece of computer/gaming device attached to your TV. Looking forward to when they enhance this device!", "verified": true, "helpfulness": "0/0", "author": "Emily"}, {"rating": 3.0, "review": "I also have an apple tv so I do have something to compare with. I like the voice search. However the hand search is not as easy to navagate as Apple. In fact Apple is far more easy to use. The user part for Netflix is stupid. Apple is much better. I will keep it becouse I like to watch movies and netflix just is not adding new movies fast enough. I also do not like the u tube app. It does not have a history. You have a good product, but it need some tweeking.", "verified": true, "helpfulness": "0/1", "author": "bonnie dean"}, {"rating": 2.0, "review": "ProsEasy to useDecent interfacePlenty of video apps and gamesVoice recognition for amazon and HuluConsNo voice recognition for Netflix and Plex8gb of memory and not currently expandableThere is no app for audibleAfter installing just a couple games I run out of space. This would almost be alright except that while watching movies I would often get interrupted to make space by removing apps.I would guess that all of the problems that I have mentioned will be fixed with an update in the not so distant future at which point I will change my rating to 5 stars.UPDATE: I was recently having a problem with Netflix stuttering around every 10 seconds for less than a second. The way to solve it was to go to the Fire TV settings for applications and clear all data for netflix.Update (01-10-2015)All the info in my original review still applies. It's a shame amazon isn't improving this at all. I have also been noticing that I have to sign back in on Netflix a couple times a month which is annoying.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 3.0, "review": "I've had the Fire TV for just over a week now. I bought it to replace an old Roku unit that failed. And all I can say is that the Fire TV  is ok. I haven't seen any benefits from the higher performance processor and more memory as compared to the Roku 3. I have both. My experience is that the Fire TV doesn't load any faster than Roku or stop to buffer data any less. And I have a 26Mbs broadband connection.  The picture and sound are great, but not any better than Roku. The unit feels very solid, more so than Roku. Since I am a Prime subscriber the unit came preprogrammed for my account, so it was very easy to get going. Just plug it in and go.I find the menu system rather confusing. The Roku menu system is much more logical and intuitive to me. On Roku, all the application tiles stay in the same place. On the Fire, the tiles move as you watch stuff. So, let's say you start with the NetFilx tile as first, then go and watch 3-different TV programs. When you come back to the Home menu, the Netflix tile is now listed in the 4th position with your 3-TV programs listed first. What the???  Why are video tiles mixed with application tiles? Makes no sense to me.And try finding Prime videos. They're buried in the menu system and you have to pay attention when you select a video because it's not easy to determine if it's Prime or not. I've even found videos that say they are Prime, but when you select them there is a price for watching. I find it very confusing.I'm considering returning the unit and getting another Roku.", "verified": true, "helpfulness": "0/0", "author": "Steve \"seecwriter\""}, {"rating": 5.0, "review": "This is a nice small device that was a breeze to connect and get up and running. Updates were the only time consuming part of the install and they only took 15 minutes.", "verified": true, "helpfulness": "0/0", "author": "Mary S. Murray"}, {"rating": 4.0, "review": "Right now I only have Netflex subscription.  Last night I dicovered amazon movies andtv.  I am a happy camper.  On top of this, there are all those many other things I haven't looked into.Set up was quick and works wonderfully.Certainly worth the $.  And the lay away plan goes much better with my retirement budget than big chunks up front.", "verified": true, "helpfulness": "1/2", "author": "JMWH \"l\""}, {"rating": 5.0, "review": "My wife and I love it!  We can see all of our favorite programs and use all of the apps such as Netflix.  Easy installation.  Set it to HDMI and you are on your way!", "verified": true, "helpfulness": "2/2", "author": "gordondc"}]