[{"rating": 5.0, "review": "So usefull and works very well... So easy to used", "verified": true, "helpfulness": "0/0", "author": "Angie"}, {"rating": 5.0, "review": "Being in India, only thing that I use it for is YouTube, but it is still worth it!", "verified": true, "helpfulness": "0/0", "author": "Chirag Rathod"}, {"rating": 5.0, "review": "Works amazing with my smartTV and computer!! very nice to have wireless connection!!", "verified": true, "helpfulness": "0/0", "author": "Theresa R Heidt"}, {"rating": 5.0, "review": "Best bang for the buck I have ever found.", "verified": true, "helpfulness": "0/0", "author": "J. Salvadore \"J M Salvadore\""}, {"rating": 5.0, "review": "This thing is great, but loses its novelty fairly quick. Screencasting is the most useful for me.", "verified": true, "helpfulness": "0/0", "author": "wcparry"}, {"rating": 3.0, "review": "Hasn't really worked well for me but I think it is more my TV connection than the product itself.", "verified": true, "helpfulness": "0/0", "author": "Dale W."}, {"rating": 5.0, "review": "Absolutely love my chromecast. Not every app or service will cast through the chromecast but I'm ok with that. I use it for Pandora (music) and cast youtube videos...and I manage to find a LOT of youtube videos to cast weather it's some yokel explaining how he's going to fix the brakes on his pickup truck or a professional documentary about the moon. There are many other apps available I just haven't been bothered to look into.", "verified": true, "helpfulness": "0/0", "author": "Stage 1 Productions"}, {"rating": 5.0, "review": "Super easy to use and fun just wish it came with a remote like a roku does but set up took only 10 mins", "verified": true, "helpfulness": "0/0", "author": "Jenn"}, {"rating": 5.0, "review": "Great but limited on applications you can view.", "verified": true, "helpfulness": "0/0", "author": "raymond"}, {"rating": 2.0, "review": "Great product but there are a couple of set backs that bother me:1. Many routers need to be configured in order to work with the Chromecast. Once you do the settings properly it all works flawless but until then you're stuck with no connection. That could be quite problematic for me as I often use it in places where I don't have direct access to change the router settings.2. A bit older versions of Android are not supported. For example, Samsung Galaxy S3 fully upgraded to the latest available version cannot cast its screen to the Chromecast and that's not that old of a phone. Yes, it could be reinstalled and updated to the newest Android version but still that's something that should have been considered and supported, at least according to me.Don't get me wrong, overall it's a get product doing a great job but in my case it could be quite troublesome sometimes.EDIT: After struggling for awhile to find ways to make it work on public WiFi networks, it turned out that there is no way to do that and I even read a post from their customer service confirming that. If you can't access the router to switch off the AP limitations, you are stuck. I changed direction and tried to make it work through a hotspot using my phone as a network and trying to stream from my laptop onto a TV screen. That also turned out to be impossible with the devices that I had.At the end, it turns out that you need either an additional piece of hardware (additional router to carry with you and setup) or additional apps to use as portable WiFi to connect to. Both of these options require additional equipment and/or cost and that for a product that's supposed to work out of the box. It would have been my favorite widget if that was really the case but alas.", "verified": true, "helpfulness": "0/0", "author": "SVMM"}]