[{"rating": 5.0, "review": "Loooooove dat chromecast doooee.No but seriously, if you have the option to hook this up to your television, do it. Netflix marathons on the couch, na'sayin?", "verified": true, "helpfulness": "0/0", "author": "Maria Almazan"}, {"rating": 3.0, "review": "Easy to install and use at home. Didn't work at hotel. Not a substitute or second monitor.", "verified": true, "helpfulness": "0/0", "author": "Michael Strait"}, {"rating": 5.0, "review": "I have been using this since it came out and cannot get enough of it. I use it everyday for streaming YouTube videos and also live streaming games on my TV. It is relatively inexpensive compared to Roku or Apple TV and very easy to setup. Even if you are a beginner, it wouldn't take you more than 5 mins to set up. You can also cast things from multiple devices such as a PC or tablet.What I love most is that it doesn't consume battery on the smartphone so you can turn off the screen after you have initiated the streaming.It doesn't support any local storage media directly so the only way to do it is by connecting the storage media to your PC and stream from there.", "verified": true, "helpfulness": "0/0", "author": "hardgamer"}, {"rating": 1.0, "review": "Doesn't work after a month. Never again.", "verified": true, "helpfulness": "0/0", "author": "Enerolisa"}, {"rating": 5.0, "review": "YouTube & Netflix great streaming from tablet & chromebook", "verified": true, "helpfulness": "0/0", "author": "vigneshram"}, {"rating": 4.0, "review": "my dad loved it! Great gift", "verified": true, "helpfulness": "0/0", "author": "Alexa Kotlyar"}, {"rating": 4.0, "review": "this thing  really is a joy .... from laptop right to my 32 incher", "verified": true, "helpfulness": "0/0", "author": "handi"}, {"rating": 5.0, "review": "I like it.  I  use it to screen videos front youtube and (Pandora - music)from my  tablet to  the television.", "verified": true, "helpfulness": "0/0", "author": "H. Rhyant \"Syracusel\""}, {"rating": 5.0, "review": "Works great, affordable, what more is there to say!  Very happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Heather"}, {"rating": 5.0, "review": "So easy to set up and now I can stream Netflix and ESPN3 where before I had to watch on my phone.  Thanks Chromecast!!", "verified": true, "helpfulness": "0/0", "author": "G. Themann"}]