[{"rating": 5.0, "review": "Great and Excelent!!", "verified": true, "helpfulness": "0/0", "author": "CarlosD"}, {"rating": 5.0, "review": "Works as intended, and arrived in perfect condition! Thanks!", "verified": true, "helpfulness": "0/0", "author": "Katherine Waldis"}, {"rating": 4.0, "review": "worked as advertised", "verified": true, "helpfulness": "0/0", "author": "Adam N."}, {"rating": 3.0, "review": "Still trying to understand how it works", "verified": true, "helpfulness": "0/0", "author": "John Lester"}, {"rating": 4.0, "review": "It's a fairly simple product that works well once you get it set up properly. If you have some devices that are wireless and some that are wired, you might run into some initial problems. Make sure you download the Chromecast extension for your browser to save you some headache. You also might want to grab Plex or some kind of media server for your computer. This will tie into Chromecast and make your life easier.I bought this for my PS4 since it didn't stream media at the time. Then Sony released the PS4 Media Player that would have made Chromecast obsolete for me. The PS4 Media Player seems to want to work only when it feels like it. When that happens, I scream at my PS4 and then go ahead and use Chromecast as my backup.", "verified": true, "helpfulness": "0/0", "author": "J. D. Fohs"}, {"rating": 5.0, "review": "Use it almost every day!", "verified": true, "helpfulness": "0/0", "author": "Lindsay"}, {"rating": 4.0, "review": "I have always enjoyed streaming devices and with there being so many I have trouble picking. I liked the Chromcast and the fact that I can easily control it with my cell phone. The only reason it is a 4 and not a 5 is because the only way to control it is with my phone...a remote would be nice as well.", "verified": true, "helpfulness": "0/0", "author": "Tee Adams"}, {"rating": 1.0, "review": "Stupid Device, useless!", "verified": true, "helpfulness": "0/2", "author": "James Stevens"}, {"rating": 5.0, "review": "By far the best portable media stream stick! It's quick, easy and reliable with all the apps you could need.  I love this and use one on nearly every tv I own. Who needs a smart tv!", "verified": true, "helpfulness": "0/0", "author": "HPrice"}, {"rating": 5.0, "review": "Very nice product. Easy to install and configure. Netflix available in my \"non\"smart TV.", "verified": true, "helpfulness": "0/0", "author": "Denis Vieira"}]