[{"rating": 5.0, "review": "Works exactly as described in the advertising.  I'm using it with a MacBook Pro.  Links easily via my wifi network and produces great picture and sound from variety of sources.  Great value for the money.", "verified": true, "helpfulness": "0/0", "author": "David A Zopf"}, {"rating": 5.0, "review": "It's not perfect, sometimes the feed is a little grainy, and sometimes a reboot of the computer is required to make it work better, but for the most part it's pretty good. And for the price, it's awesome. By comparison to an A-TV that costs 3x as much but has superior quality (but still requires a reboot sometimes to fix an audio issue), I pretty  just bought several of the Chromecasts and can use that just fine for every TV in the house. Overall, extremely happy with this.", "verified": true, "helpfulness": "0/0", "author": "angelduzt"}, {"rating": 5.0, "review": "Great device. I have two. One at work and one at home. Its great for reviewing you tube videos on your iOS device first before pushing to the TV. you can even review while there is one playing. I think it's great that once you start playing a Netflix movie that it doesn't drain your mobile device. It seems to find the stream directly from the Chromecast device and even if I turn off my iPad, the movie continues on so don't worry about it draining your battery. Waiting for it to do more things like share the screen of the mobile device but they seem to be adding more and more. Setup was very simple using an app from the app store. I like it as it's nice to allow everyone to see you tube on the TV rather than crowding around you and the ability to control it from the mobile device is nice.", "verified": true, "helpfulness": "0/0", "author": "High Hopes \"Information Technology Manager\""}, {"rating": 2.0, "review": "the lack of browser interface from mobile device even using chrome.Video streaming other than netflix, you tube and playstore", "verified": true, "helpfulness": "0/0", "author": "Newman"}, {"rating": 5.0, "review": "Very happy with my purchase!  I'm a low-tech, senior lady, and had no problem installing and running the Comcast Media Player.", "verified": true, "helpfulness": "0/0", "author": "Sally Freeman"}, {"rating": 5.0, "review": "Works as advertised.  Not a lot of apps yet, but projecting laptop content to my big screen is well worth the $35.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Coe, Jr."}, {"rating": 5.0, "review": "works as stated was very easy to hook up and use. just make sure you have a good wifi connection and you will have no problems", "verified": true, "helpfulness": "0/0", "author": "R Zimmer"}, {"rating": 4.0, "review": "as long as you stream netflix or youtube ONLY its fine... but wanna stream from a browser.. yeah right.. chrome has a tab cast but it is beta and it crashes often!", "verified": true, "helpfulness": "0/0", "author": "Michael F. Berry \"micber\""}, {"rating": 5.0, "review": "Arrived very quickly. Very intuitive using a Chromebook and Samsung HDTV, had it set up within minutes. Watched Netflix movie and UTube videos wirelessly immediately. Very impressed with quality and price.", "verified": true, "helpfulness": "0/0", "author": "Free Spirit"}, {"rating": 5.0, "review": "Great little product for a very reasonable price!  I usually watch Netflix on my PS3, but I don't like listening to the drive spin all the time and I'm always thinking about how I'm wearing down my PS3 just to watch Netflix, so this was an ideal solution!  Was simple to set up from my Galaxy Note 2 (point Chrome browser to setup site and \"Request Desktop Site\") and it took about 3 minutes total.There are some things I would change about the Netflix Android app (like automatic progression to the next show in a season) but as for the Chromecast, the device itself is great!  Would be nice to be able to turn it on and off from the Chromecast app to save the small amount of power it uses as well as wear on the device, but overall I felt at the price this is definitely a 5-star value!Now if only Google would hurry up and release the finished SDK to developers we'd be able to see what this little device is really capable of!", "verified": true, "helpfulness": "0/0", "author": "TreeburnerCT"}]