[{"rating": 5.0, "review": "We decided to get rid of cable and use Chrome cast instead. Thus product is amazing. I am able to cast right from my phone. Not only to we stream shows, I can use apps. I use educational apps and you tube right on my TV to help with homeschooling our kids. I am so pleased with this product, I have told everyone I know to order one!", "verified": true, "helpfulness": "1/1", "author": "Karise and James"}, {"rating": 3.0, "review": "It's not very easy or friendly when trying to stream from a Samsung Android Tablet or Phone.  Let's face it, people want to beam and stream more than just content they have on google, and unless there is some undocumented magic to make that happen, it requires purchasing more apps to make this happen.  On the fence with this device, and frankly haven't used it much based on limitations.", "verified": true, "helpfulness": "0/0", "author": "Maximlead"}, {"rating": 1.0, "review": "totally false advertising by seller. I thought it was Google chromecast which is wanted another.Waited over a month and it turned out to be wecast some Chinese junk.  Will send it back.", "verified": true, "helpfulness": "0/0", "author": "Asif Khan"}, {"rating": 4.0, "review": "If you own an iPhone, iPad then you have to think thru this before purchase. Most app requires a purchase or subscription to use with Chromecast. It is easy to set up and with a few tweak my iPhone6+ and mini iPad 2 now can cast movies with basically no major problem. I just wish there are more apps for Chromecast.", "verified": true, "helpfulness": "0/0", "author": "imbebe"}, {"rating": 4.0, "review": "GOOD", "verified": true, "helpfulness": "0/0", "author": "Ronald L. Blackwell"}, {"rating": 5.0, "review": "Fast becoming a must-have, you can connect several apps to your TV over WiFi. No issues with it whatsoever. And I only got it for about $25.", "verified": true, "helpfulness": "0/0", "author": "Everly"}, {"rating": 5.0, "review": "I love this little guy.  Has made my TV viewing that much more enjoyable. The only thing that is sad is that I cannot watch my Amazon Prime videos on it... but that is for my playstation to handle. Don't know what we did before this guy... wait I do... but now I don't have to every worry about going back to that state.Updated:  5/3/14Sorry yes you actually can watch Amazon Prime with Chromecast however you cannot really pull up an other website that uses video or games.  Like I like to play my facebook games while watching... and Amazon streaming through Chromecast gets choppy when you do both. But it does work perfectly fine with HBOgo, Netflix or Stars", "verified": true, "helpfulness": "1/1", "author": "Kit Johnson"}, {"rating": 5.0, "review": "Great product,", "verified": true, "helpfulness": "0/0", "author": "claude"}, {"rating": 4.0, "review": "I love the price and apps.  I would prefer a remote instead of using a phone.", "verified": true, "helpfulness": "0/0", "author": "Avid Blu-ray Watcher Guy"}, {"rating": 5.0, "review": "Easy to install and works like a charm. i use it to watch Netflix on my Tv.", "verified": true, "helpfulness": "0/0", "author": "Debbie Garvin \"VanWaDeb\""}]