[{"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Rafael Serrano"}, {"rating": 5.0, "review": "Works great, very simple.", "verified": true, "helpfulness": "0/0", "author": "Todd Edwards"}, {"rating": 4.0, "review": "Love how easy was to start using it. In Europe we miss all fancy features, but ability to broadcast desktop to your TV is super useful if you compare price of chromecast to one better HDMI cable. I found difficult/impossible to stream video with subtitles via Chrome. Streaming with broadcast desktop is slow (probably depends on lan and resolution) and there is no sound (must use sound output of notebook).", "verified": true, "helpfulness": "0/0", "author": "IGOR BESLIC"}, {"rating": 1.0, "review": "I feel the marketing for this product has been vague and misleading as to its true capabilities. Much of it indicates that it allows you to view content from the Chrome browser on your TV using this device. I bought two of these only to find it does NOT do this, at least not with an iPad. The Chromecast website even clearly shows Chrome as an app that works withChromecast. What Google DOESN'T tell you is that it only works with a browser extension that isn't even available for iPad. so, it only works with a limited number of specific apps, and even though Chrome is supposed to be one of them, apparently it's only for desktops. The marketing for this device implies it has much broader connectivity with mobile devices than it actually does. I feel like I've been defrauded.", "verified": true, "helpfulness": "1/4", "author": "C. Chesser"}, {"rating": 4.0, "review": "I originally thought it was like roku where u can download apps to it not have to stream from phone but its cool", "verified": true, "helpfulness": "0/0", "author": "David dunn"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Oscar Ruiz"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Hansel Santana/075118"}, {"rating": 5.0, "review": "worked perfectly within minutes of installation", "verified": true, "helpfulness": "0/0", "author": "Jerl"}, {"rating": 5.0, "review": "If i would've been told that i could change the channel on my tv while having the excuse that i cant hand over the control because its my own phone 10 years ago, i would've call bull.", "verified": true, "helpfulness": "0/0", "author": "Joseph David Zavala"}, {"rating": 5.0, "review": "Love my chrome cast although I use my AppleTV more it's nice to have", "verified": true, "helpfulness": "0/0", "author": "chris blatus"}]