[{"rating": 4.0, "review": "I bought this for $31.50 ( inclusive of tax ) and am happy about the purchase.Despite having a smart led TV , I prefer to use chromecast for watching YouTube videos and other videos from Google chrome browser as it is easier for me(easier to search videos).It is definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Uma Chandrasekaran"}, {"rating": 5.0, "review": "Very good shipping and quality of item is great!", "verified": true, "helpfulness": "0/0", "author": "Trent"}, {"rating": 3.0, "review": "Very buggy....only Youtube seems to work well with this device, No other video file I play seems to work...Hopefully Google will fix this over time", "verified": true, "helpfulness": "0/1", "author": "sreenath"}, {"rating": 3.0, "review": "It's OK!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Poor instruction. It is very hard to set it up and could not pair it up with the Iphone 4S.", "verified": true, "helpfulness": "0/1", "author": "Denny Pui Laihing"}, {"rating": 4.0, "review": "I've owned this little 'cast for over a year now (and my girlfriend just bought one - gives you two sides of the coin, tech and non-tech). Here's what you need to know:Pros:- If you live off a phone or tablet, this $30 dongle can do more than most multi-hundred-dollar receivers- Gives you absolutely zero excuse to not cut your cable TV subscription (and save at least $30 A MONTH)- It's the future!- Setup is easy. Like, my non-tech girlfriend had it fully set up in less than 5 minutes after glancing at the instructions easy.Cons:- If you have more than just a TV, things become complicated. Because the Chromecast only outputs HDMI, you'll either need your TV to have a separate audio output - or get one of these HDMI -> HDMI + audio splitters for $30: http://www.amazon.com/gp/product/B00KBHX072/ref=as_li_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B00KBHX072&linkCode;=as2&tag;=todmedblo-20&linkId;=7Y2RH6K5VOCXMV52- It's only worked about 90% of the time (though, that's really more a qualm with technology in general)- You're limited to the apps that support this. I used to use XBMC media center but was forced to switch to Plex because Plex added Chromecast support first. In the end, I'm actually happier with Plex....but know that if you have a special media setup going on, you'll need to do some research to see if it'll work.Conclusion:- If you just have a TV (or a TV that outputs audio to speakers), and you just watch TV...this is the device for you. Buy it, stop paying for cable, and save $30+/month for the rest of your life.- If you have a more complicated setup (ie projector, media center, receiver) the choice isn't so cut and dry. Because each situation is different, do some research on if your setup is supported. If you have a media center PC, it's also worth asking if you even /need/ a Chromecast, since some setups (like Plex) already have Android + iOS remote control capabilities.I hope you found this helpful! Feel free to ask any questions you have in the comments :)", "verified": false, "helpfulness": "8/8", "author": "Todd Medema \"Entrepreneur, photographer, tech junkie\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "ghalib mo"}, {"rating": 4.0, "review": "The Only thing it needs is Flash Compatibility. Everything works well, its fast and never had it crash.", "verified": true, "helpfulness": "0/0", "author": "Jose Villanueva"}, {"rating": 3.0, "review": "Love it when it works.  It's hit and miss when device would connect to the chrome cast.", "verified": true, "helpfulness": "1/1", "author": "S Y."}, {"rating": 5.0, "review": "a must have", "verified": true, "helpfulness": "0/0", "author": "Efrain Bastidas Berrios"}]