[{"rating": 3.0, "review": "For years I've been getting DVDs in the mail from Netflix.  When I saw Chromecast I jumped all over it - bought two to start.  Set up had a couple of glitches, but once that was done, streaming from Netflix worked well, with reasonable quality and continuity.  But there is ONE BIG PROBLEM.  None of the recently released movies that I wanted to watch was available for streaming.  Nothing but older movies, most of which I had never heard of.  So I went to Netflix Live-Chat and found out that to stream a movie, they FIRST have to negotiate a license with the movie company, and that can take more than a year, and in many cases they never get the license at all.  So I now have two devices that don't do me a lot of good.  Anyone have another source besides Netflix for streaming movies that are Chromecast compatible?????", "verified": true, "helpfulness": "0/3", "author": "noazuser"}, {"rating": 4.0, "review": "Simply put, the Chromecast is fantastic. For the price, especially if you got in when they had the Netflix deal, this was almost impossible to pass up. Now, I'm a bit of a tech guy and have a computer plugged into every TV in my house, but this is still great for sharing YouTube and Netflix videos to the big screen without having to go switch inputs and grab my keyboard. I like the CEC support to turn on and change the input of your TV automatically the most.I can only give 4 stars out of 5 though because while the product is fantastic and the price is right, it still hasn't been adopted by many other apps than the initial few. Hulu recently added support, but Google has been fairly quiet about the product since announcing it. Still, even if you just used it for YouTube, Netflix, and/or Hulu, it's so cheap it's still a great buy. I'd really like to see Google use this technology more though and it would be worth a full 5 stars.For those comparing with Apple TV or Airplay, I don't see any reason for these products to co-exist as they do very similar tasks. The difference though is that using Airplay requires you to buy an Apple TV at minimum which is a good bit more expensive. Simply put though, if you're an Apple person with a lot of Apple products, you may be happier with an Apple TV using Airplay. Otherwise, this cheaper alternative can perform similarly if not even better once Google and other companies (hopefully) start to utilize it more.", "verified": true, "helpfulness": "0/0", "author": "A. Jerman \"AJerman\""}, {"rating": 5.0, "review": "The Chromecast is exactly what I expected.Its much faster than any other smart TV / wii/ roku/ etc I've used.", "verified": true, "helpfulness": "0/0", "author": "S. B. Mak"}, {"rating": 2.0, "review": "Do not expect anything more than Netflix yet. By the time it evolves a bit another product would be out there.", "verified": true, "helpfulness": "0/0", "author": "Ari L."}, {"rating": 5.0, "review": "Let me begin by qualifying that I know that the chromecast is designed to only work with certain \"apps\" such as Netflix, YouTube, Play, and Chrome (to a certain extent). I also know they have plans to add additional content in the future. but I'm not banking on that. Personally, my wife and I watch a lot of YouTube channels and Netflix together, and I couldn't be more pleased with the quality and ease of doing this directly from my phone onto our television. We also have a Blu-Ray player with certain video apps (like Netflix), but I actually find it easier to use the Chromecast since it's directly on my phone. The quality is great with one exception of the sound being slightly delayed (but this is an easy fix on the receiver).Pros:- Cheap!- YouTube playlists that make it easy to watch several videos or a playlist in a row.- Easy to set up, easy to use.Cons:-Slight sound delay, but nothing to complain about (my wife doesn't even notice).", "verified": true, "helpfulness": "0/0", "author": "Bruce Mayberry"}, {"rating": 5.0, "review": "Pros:Update!! I will be purchasing one of these for each room. Pandora Radio is also available and it sounds amazing through the TV.1) The COST!!! What electronic device costs less than $40?? This one!2)Excellent Quality and uninterrupted playback , even if your phone dies and s***s down, this player will continue playing over your wifi.3) 1.2.3. installation.Cons1) Not blue tooth compatible2) You can only use it for netflix and you. I don't have netflix, so , I use it for youtube only.3) You cannot use it to view pics, videos and other media from your phone3) Strictly for youtubeWith so many cos, how could you give it 5 stars? \" this thing cost $35. thats cheaper than a good memory card. If it was called youtube-only-caster.... I would have brought it and had zero complaints.Youtube is the new Free Tv, I will be purchasing one of these for each room.Jesus is coming. Repent. Peace.", "verified": true, "helpfulness": "0/0", "author": "Hajilo"}, {"rating": 4.0, "review": "The software is still a bit ropy, it regularly loses sync with the Chromecast.  But the major problem is Google's kowtowing to the legacy media regarding the difference between Chromecast and an HDMI cable.  Nobody limits the functionality of the cable, but Google appears willing to compromise the user experience in order to placate their new content friends.  Shabby.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I picked this little device because it was cheap and I could just use my phone as a remote which seemed like a cool idea. Unfortunately, the reality is that the apps suck at controlling the Chromecast. Using the Netflix app in particular can take a full 2 minuets from the time I tap on the app until I get something up on my screen.", "verified": true, "helpfulness": "0/0", "author": "Tyler Crook"}, {"rating": 3.0, "review": "The only things you can use this for is Youtube, Netflix and Hulu, it would be amazing if I could pull up a web browser and put it on my computer. Also would like to be able to stream my online movies to a tv. Its a great idea but not adapted into real life yet.", "verified": true, "helpfulness": "0/0", "author": "Michael Manns"}, {"rating": 5.0, "review": "Gotta love the guys at Google.  Think of this as a USB Thumb Drive only as an HDMI device.  You plug this into an HDMI port on your TV and plug in it's power cable (which is a mini-usb port).  Then, the device creates an ad-hoc wifi network that you connect to either with your laptop/mobile device.  The Chromecast app on your laptop/mobile then automatically detects the widget and allows you to connect it to your preferred wifi network.  Once that is complete, all of the devices on the network see the Chromecast and can control it.Watch Netflix, Hulu, Google Music, Google Video, or stream a Chrome browser tab to your TV.  Super slick, easy, small, etc.I love using it in hotels, though that setup is a bit more complex as I travel with an airport express that I setup in my hotel room, connected to the hotel wired internet (if there isn't a wired connection, the setup doesn't work).  I can then plug in my Chromecast and it connects to the airport express and I'm set to watch whatever I want in my hotel room on demand.  Sweet!", "verified": true, "helpfulness": "1/1", "author": "Sators \"Sators\""}]