[{"rating": 5.0, "review": "Great little device. Very simple to set up and operate. Right now limited apps will hinder it's value but once other apps become compatible the sky is the limit for this device.", "verified": false, "helpfulness": "2/3", "author": "Mr. Daje Moffet"}, {"rating": 2.0, "review": "Awesome idea, but it doesn't hold a candle to my apple tv or my roku xs.  Easy to setup, but the streaming quality was definitely NOT HD quality.", "verified": true, "helpfulness": "8/20", "author": "DKS"}, {"rating": 4.0, "review": "I added the near future caveat because currently the only apps that include casting are YouTube, Netflix, and Google Play's media apps. From what I've read online, developers are working on adding the feature to all the apps I want to see included (more specifically, PLEX).So what makes this device so awesome? It's not doing anything a whole lot different than my Roku or Xbox 360. It streams music and video just like any other internet streaming box does. So what's the big deal with this? It's cheap, it's easy to use, it's good for parties, and most importantly it makes watching video content over the internet more enjoyable. Let me explain.Currently:When watching videos online, you typically choose the video you want to watch using some remote that isn't great at navigation and typing input. After choosing said video, you watch it and then navigate again through the same ok navigation (probably taking a few minutes to pick your next video). All this time whoever is in the room with you is watching as you go adventuring through the media wild. Not much of a good coop experience (unless the second viewer can chuck things at you while waiting for the next video to start).Chromecast:Here's the beauty of Chromecast. TVs with d-pad type remote controls aren't good ways to navigate a large amount of digital content. So why do we think we need the remote control? Why not use that awesome little smart device almost every person has these days in their pocket? It has a keyboard, touch navigation, AND it's not coupled to the TV's display. That last part is key. So in the same scenario as before, I could be watching a show with a friend and, without interrupting our video, add some more videos after the one that is currently running. When our video ends, it just moves on to the next video in the queue. Cool right?Not only that, but your video/music can also become party play! Anyone in the house that is connected to your WiFi with an Android, iPhone, Windows Mobile, or Blackberry device can add to your queue. So now you have a Jukebox of music and video, where anyone can take control of your media without anything more than getting your WiFi password.Now I know some of this is already possible with AppleTV, but even there you have to use Apple only devices. With Chromecast, anyone can join in.I love using my phone/tablet to control what content I watch on my TV. I'm done with controllers.UPDATE:Another thing I realized yesterday at my parents' house while showing off their new Chromecast:The Chromecast turns your mobile device into a digital right media hub. So remember that example I made before about multiple people in the room having control of what content gets displayed on the TV? Well last night I realized that this also makes sharing the content you own or subscribe ridiculously easy. Take watching HBO Go, once they add support for casting to Chromecast, I could go to a friend's house and cast Game of Thrones straight to his TV. We wouldn't have to input a login/password or activate his device with HBO. It would just work. Or say I have bought some movies on the Play video store, I could cast them as well. So pretty much my phone is now a portable media hub for everything I own on the cloud and there is nothing more to sharing that content at a friend's house than just bringing my phone with me.I know I'm starting to sound like a sales person here but I just love how such a ridiculously basic device can totally change my concept of watching media. I love when things just work!", "verified": true, "helpfulness": "5/7", "author": "Amazon Customer \"Family > Video Games > Everything Else\""}, {"rating": 5.0, "review": "Alright.. I ordered 3 for the living room, bedroom and kids room. It works as expected and the video codec Google is using for Chromecast is fast and looks great with just 2 Wifi bars. This device compatibility will grow and I wouldn't be surprised to PPV apps crop up that will deliver special events through this product.I have noticed that LIVE YouTube video does not work yet (at least during my tests) but I expect this to also work within time.I can't be any happier with this product. My family is an Apple ecosystem (6 memebers= 7 ipads + 2 iPhones) household even with 1 Apple TV unit that hardly gets used because most times it streams from the iOS unit and if you go to a web page and want to play another video, what you're already watching on Apple TV will play it. Chromecast does not have this issue, one you start playing a video on Netflix or YouTube, you can continue to use the remote device.There are some rookie glitches with connecting at times but nothing that can't be worked around by restarting the app on your device and sure to be smoothed out on future updates.Overall, this product was able to add internet video capability to 2 non-smart HDTVs in the home on the cheap, and added to the living room TV (which is smart) as a faster and easier way to play video from our household mobile devices. I was about to buy a few Roku boxes but this product came out of the blue and solved our needs.For $35, it's cheaper than a night out at the movies in NYC. I highly recommend buying one just to be in the mix when that PPV premium stuff starts happening because it's inevitable.UPDATE 7/30/2013:I just successfully streamed on all 3 Chromecast at the same time 1080p video in 3 different rooms in the house with an Optimum Online 50Mbps plan line.. 2 from Netflix and 1 from Youtube. Solid performance.", "verified": true, "helpfulness": "3/4", "author": "Al Leong"}, {"rating": 1.0, "review": "this device is a POS.  would not recommend.  it's just a stripped down google tv, which sucked already..  zero stars.", "verified": false, "helpfulness": "9/82", "author": "DJ Walker"}, {"rating": 5.0, "review": "What sets the Chromecast apart from the rest of the media streaming devices is the convenience.The implementation in Chromecast is not new. Casting to the screen can be done on PS3 and most recently on the Xbox 360 (both through the YouTube app).The difference with Chromecast is the ease off app switching. While on my PS3 or Xbox (or frankly any other dedicated streaming device), if I was watching YouTube and I started getting bored and wanted to see what was on Netflix, I would have to close the YouTube application and open the Netflix app, then surf around with the controller. The experience was just slow and cumbersome. Sometimes I would just watch something I didn't really want to watch because it just took too long to surf the interface and I would give up and choose something I recently watched.With the Chromecast, I can queue as many YouTube videos on the YouTube phone app and the Chromecast will continue playing the next video on the list. While the videos play, I can switch to my Netflix app on my phone and browse a video that I want to watch.The best part is I don't have to close any app on the Chromecast and open another one. If I'm watching a YouTube video and I hit play on my phones Netflix app, the Chromecast automatically switches to the Netflix app and starts playing the video.Another thing to note is that there is no ui on the Chromecast. There is no interface, and you don't have to use a controller or a remote, and slide one by one on the movie selections. You use your phone, tablet, or computer to find the content. These devices are better suited to find content as they are fast and have better manipulation of their interface (using touch screen or mouse and keyboard vs. A controller or remote)At the moment, there is a limited selection of apps that support streaming through Chromecast, however I believe developer support will be high on this device. It is the perfect bridge to get app contents on the home entertainment, without putting a lot of money and effort on different devices (Roku, TiVo, PS3, etc)", "verified": true, "helpfulness": "8/10", "author": "Jorge Rodriguez"}, {"rating": 4.0, "review": "First off this a super little device that will easily replace the built in streaming options that ship with my Vizio TV. Much nicer to use my smart phone to fling content than the clunky built in TV UI. High quality streams that start fast. I hope more apps include Chromecast support, especially Amazon VOD. This should be the thing that pushes Amazon into releasing a non-Kindle VOD player. The marketing material sadly leave off any mention of Linux, but this works perfectly fine casting URL's and tabs from Chrome on Linux. I am a bit disappointed that I have not received the promised 3 months free Netflix promo code. Google ended the promo quickly, but should at least honor it for devices purchased the first few hours of release.I didn't give the device 5 stars because of some performance issues when casting a full Chrome tab.", "verified": true, "helpfulness": "6/6", "author": "Matthew"}, {"rating": 4.0, "review": "Netflix quality was so-so, but YouTube videos look great. I was surprised that it stated that it was iOS compatible. During set up I learned that iOS compatibility is \"coming soon.\" I was still able to set it up using my web browser, though. (Luckily, it worked, as I do not have Windows 7).", "verified": true, "helpfulness": "1/1", "author": "Marshmellow"}, {"rating": 5.0, "review": "You need this. Take any (modern) tv, and bring internet video to it. You can listen to your google music, play netflix, youtube, and anything you buy in the play store. Easy to set up, very clever, and works well. Very easy to que up many videos and lay and watch youtube on the couch.", "verified": true, "helpfulness": "3/4", "author": "Keaton Wheeler"}, {"rating": 5.0, "review": "Setup was a breeze using windows 7 PC. I could not use iphone to set it up, but could use iphone to control it after set up. Netlfix picture quality was very nice (I have a 12mbps DSL internet connection). I can fast forward, rewind, increase or decrease volume all using my iphone. I plugged the USB cable to the USB/service port on my Sony TV instead of the power plug that came with it. Apparently the TV USB port supplies enough juice for the device, and I know power will be cut off from the Chromecast when the TV is off.Easy to set up, easy to control, nice picture, inexpensive --> great value", "verified": true, "helpfulness": "1/1", "author": "maysoun"}]