[{"rating": 4.0, "review": "A strong internet connection is very important if you want fast streaming. Other than that, great product that will hopefully advance in the near future.", "verified": true, "helpfulness": "0/0", "author": "Zoltan"}, {"rating": 1.0, "review": "I purchased Google Chromecast months ago, in fact when it first became available. The first time i tried to use it, I spent hours, and got no where. I was angry and very frustrated. tried again the following day. Same results......nothing. over the ensuing month I have tried several more times. Have never been successful. A total waste of money, and the source of a lot of grief. tried with various devices and to different TVs.", "verified": false, "helpfulness": "0/1", "author": "mscatmar \"marsha3304\""}, {"rating": 2.0, "review": "I can't find a # where I can find out about a password,I've tried all my passwords and none of them work what do I do?", "verified": false, "helpfulness": "0/1", "author": "Beverly"}, {"rating": 4.0, "review": "easy to set up and uses.", "verified": true, "helpfulness": "0/0", "author": "Bentley"}, {"rating": 3.0, "review": "I like this device a lot! However, i have experienced some connection issues lately. My internet/wifi has no issues on my phone, laptop etc. but when I try streaming a movie through my phone on my tv, i have to disconnect the chromecast and reset it. I experienced the same when attempting to stream a video on Youtube. its a bit of an inconvenience. It will start to lag and then it'll stop. No issues with other apps like Netflix or pandora. I give it 3 stars for the lagging and having to reset it often.", "verified": true, "helpfulness": "0/0", "author": "Edgar Ayala"}, {"rating": 5.0, "review": "Great product! We own 3 in our house and gave some for Christmas gifts. Easy to use and if you enjoy Netflix we use our smart phone as remotes.", "verified": true, "helpfulness": "0/0", "author": "Julia S."}, {"rating": 5.0, "review": "Great product. If you have a good wireless connection, streaming is consistent", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 1.0, "review": "Review posted with USB Power for Chromecast", "verified": true, "helpfulness": "0/1", "author": "Brenda Andrews"}, {"rating": 2.0, "review": "Returned it.  Need a smart phone with Google play on it.", "verified": true, "helpfulness": "0/1", "author": "April Richstein"}, {"rating": 4.0, "review": "Some of the things are really cool. Also it would be nice if the customer could get few days of free service for apps like hulu plus or hbo or others to enjoy movies and other stuff. Since all these diff apps are subscription based, so it would help the buyers if they get those services for free for some time like trial period or something.", "verified": true, "helpfulness": "0/0", "author": "suraj basnet"}]