[{"rating": 5.0, "review": "Great all around. The one wish is for a \"free\"  prime movie section.  It takes too long to sort out the free movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Really awesome device.  Ultra fast nice apps and having the joystick it's a must for playing.  There is a new game coming soon and mmo from lego looks cool", "verified": true, "helpfulness": "0/0", "author": "John J Castillo"}, {"rating": 5.0, "review": "The only issue I had was that I was not able to start it the first time and, I might not have look adequately on the box or documentation, but I couldn't find a number to call. I went on the WEB and found very easily the number to call though. From then, the experience was really great the people I spoke to were very cordials and he found the issue with the box and fixed it quickly....great service.", "verified": true, "helpfulness": "0/0", "author": "Daniel Lachapelle"}, {"rating": 5.0, "review": "Thank you Amazon, this product is fantastic! You saved me $130.00 per month since now I do not need my cable provider.", "verified": true, "helpfulness": "0/0", "author": "Howard J. Kaye"}, {"rating": 5.0, "review": "Its a great unit.. tons of movies, games, Tv shows...you name it.....I wish it will bring closed caption in different lenguages ( 4 example spanish)....Its the only thing I regret!!! Nevertheless  GREAT!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "not enough films that interest me, lack stars names", "verified": true, "helpfulness": "0/0", "author": "FRANCIS J.` KANOFSKY"}, {"rating": 5.0, "review": "Great.  USB port does nothing though, and the remote control is too tiny.", "verified": false, "helpfulness": "1/1", "author": "R. Henson \"Bob\""}, {"rating": 2.0, "review": "Really only bought it to watch NBA. This unit is not as good as ROKU streaming stick for watching NBA.plus no HBO app", "verified": true, "helpfulness": "1/1", "author": "Larry Shores"}, {"rating": 5.0, "review": "Incredible experience using this box... needs job go but it's coming.  The experience if downloading apps is different but it's nice that you can download console-caliber games too.  Never waiting for things to load is a fantastic touch too.", "verified": true, "helpfulness": "0/0", "author": "Anthony B"}, {"rating": 2.0, "review": "The cool thing about the device was that it came from Amazon with all my account information on it, so I did not need to go through the registration process. However, the Prime Music app was not pre-installed on the device and it was not an available app download via the device, even though I am a Prime member. The did not work well on or at all over my rural area 1mbps DSL speed. I would gather that 3mbps would probably be more conducive and yield a better streaming experience. So, I was not able to use the device because the device kept messaging me that my internet connection speed was too low. If you have 3mbps DSL or higher, I imagine this device is a must have.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]