[{"rating": 5.0, "review": "Amazon Fire STICK.I asked the help desk questions about the product and here is what they told me.Q.Can you play games with the remote?A: yes.Q: if you buy a second remote for $14.99, can you play 2-player?A: No.  you need to buy the game controller to play a second player. ( you can use multiple game controllers not multiple remotes)", "verified": false, "helpfulness": "0/4", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I got my Fire TV at launch in April and I waited to post a review until the Netflix app was updated.  The only major problem with the box is the Netflix app was based on a very old version.  Finally on October 28th they updated it to look like every other device.This box streams Amazon Instant content great the picture quality is amazing even non 1080p content looks great.  The only thing I don't like is how they jumble paid content with free content which will confuse new users as it is very easy to make a accidental purchase.  I think they should give you a option to only show Prime content or to have there paid content in a separate app.  Also I think the apps should be organized better.  Instead of having them all jumbled on the home screen they should be in a separate section where only apps show which there is but they are still jumbled I want them in alphabetical order.Also the other apps like Hulu Plus and YouTube are there and perform great.  The only major app that is still missing but will most likely soon arrive is HBO Go.", "verified": true, "helpfulness": "0/0", "author": "Tony Ramirez \"tonyram57\""}, {"rating": 2.0, "review": "I give it one of the stars for the clarity.  The picture comes in really good.  The second star is for the fact that if you only want a few sites, such as Netflix, Hulu, History, and A&E; this would be a good product.  But, you can't \"channel shop\" like on a Roku.  We love the programming on the BYU channel such as American Ride and Studio C, but for some reason you can't channel shop.  Until Amazon allows channel shopping, I would recommend a Roku.", "verified": true, "helpfulness": "0/3", "author": "shelly"}, {"rating": 3.0, "review": "Functions are limited", "verified": true, "helpfulness": "0/3", "author": "James C. Woo"}, {"rating": 4.0, "review": "Works very efficient with little no difficulties ...", "verified": true, "helpfulness": "0/0", "author": "eric"}, {"rating": 5.0, "review": "love my Amazon Fire TV", "verified": true, "helpfulness": "0/0", "author": "Kim MacLean"}, {"rating": 4.0, "review": "Love the voice search and small size but hate the way it favors Amazon products over other streaming services.", "verified": true, "helpfulness": "0/1", "author": "T. Dettloff \"noble thomas\""}, {"rating": 4.0, "review": "I wish it had an on/off button though. Otherwise, I like it so far.", "verified": true, "helpfulness": "0/0", "author": "A. Strater"}, {"rating": 5.0, "review": "Great bargain!  Lots to watch for a mere $99!  I enjoy NO COMMERCIALS and all of the entertainment I need. Why pay for cable?", "verified": true, "helpfulness": "0/0", "author": "B. Waters \"brendella\""}, {"rating": 4.0, "review": "I like it but I don't love it. You can look at movies but some are free and some aren't. I do like ability to speak to the remote and say what you want and it goes directly to it. You just hit enter. I'm still learning how to navigate through all the options but refuse to pay for anything. If it isn't free, I'm not viewing or playing it. It's not bad for the price. I was paying $80 a month after taxes for basic Direct tv and I paid $85 for this one time and I'm good.", "verified": true, "helpfulness": "0/0", "author": "Keith D. Bolton \"Soja\""}]