[{"rating": 1.0, "review": "was disappointed. check one site then I got a message that I bought it. There was an offer I should check and free for a month.", "verified": true, "helpfulness": "0/7", "author": "elliesamericana"}, {"rating": 5.0, "review": "Love it. Fast it is!", "verified": true, "helpfulness": "0/0", "author": "WILLIAM BUREK"}, {"rating": 4.0, "review": "It takes too long to fill an internal buffer and reach HD 1080 quality though I have a steady 100 Mb connection. I would rather wait until the buffer is full than waste time watching a picture in a low resolution.", "verified": true, "helpfulness": "0/0", "author": "EvgenyUS Fedoseev"}, {"rating": 5.0, "review": "Amazing product", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "it's very small and perfect for home video stream, especially for TV shows stream. Love it!!", "verified": true, "helpfulness": "0/0", "author": "Tintin"}, {"rating": 5.0, "review": "I just want to point out for all the numerous reviews and comments blasting this for making Prime content hard to find.... read the product description.\"Easy to find PrimePrime entertainment on Amazon Fire TV is just a click away. Simply select Prime Video on the Home screen's Main Menu and browse your favorite Prime TV shows and movies sorted by category. Say “Prime only” as part of your voice search to limit results.\"That said, I keep trying all the streaming devices, and nothing compares to Fire TV, the voice search alone puts it ahead of the competition.  The immediacy of the menus is something you may not think is really that great, but when you use the Fire TV for a bit, then try the Roku again, you get frustrated with how slow everything is.The only thing that I would say could improve this, and even make it compete with, say, Wii U and XBone for streaming would be connectivity with your cable.  It would be nice, as on the Wii U, to have even cable times come up in your search for certain shows or movies, but that would be Fire TV2, or whatever they're gonna call the follow up.", "verified": true, "helpfulness": "3/3", "author": "Derick"}, {"rating": 4.0, "review": "Working just fine after I had to  upgrade my internet to 4G.", "verified": true, "helpfulness": "0/0", "author": "Keith Smith"}, {"rating": 4.0, "review": "First off, let me say I LOVE my fire TV. I have had it for a few months now. AMAZON - Please tell me there will be an update for the 'skipping' that I have when watching movies. I seem to notice it when watching a movie where the camera is moving quickly from one point to another, its like my Fire TV can't keep up and pauses a couple of times a second and then speeds up really fast to catch up. I thought maybe it was my internet connection at first, but when I watch these movies through my Xbox or Roku it doesn't happen. I LOVE my fire TV and prefer it over the other 2, so I would love to hear that there will be some kind of update to fix this :) THank you!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"j howard\""}, {"rating": 5.0, "review": "You need this tool if you like to watch movies and videos.", "verified": true, "helpfulness": "0/0", "author": "Sabry E. Mason \"Nikonian\""}, {"rating": 5.0, "review": "Okay, I am hooked.  Amazon has got me right where they want me.  Fire TV could not be simpler to hook up or easier to use.  I chose to connect it directly to my router with a network cable and the responsiveness is impressive.  You queue up a movie and then press play and it is playing within a few seconds.  And what really blew me away was I could queue up a video on my Kindle fire HDX and then click to start playing it on the Fire TV.  Amazing, this turns the tablet into a controller for the video while also allowing you to view additional information about the program you're watching such as cast, storyline, and other info about the show.  How cool is that!  I really enjoyed the voice search feature, it finds anything that you speak aloud with impressive accuracy - although not everything it finds is available through Amazon of course.  I tried testing the limits of voice recognition by searching for \"Allegro Non-Tropo\" (the animation movie) and the screen popped up the correct spelling for the movie which was quite impressive despite the fact that they do not have it in their library.Someone else mentioned that if you double-click the left or right side of the scroll wheel you will bump forwards and back by the 10 seconds which is convenient to go back and catch a piece of dialogue you missed.  This is not mentioned in the extremely minimal instructions and is a very valuable feature.Like most people who purchase a WebTV box I am binge watching TV shows like Dr. who, and some of my other favorite sci-fi classics like Eureka and Warehouse 13.", "verified": true, "helpfulness": "0/0", "author": "Guy Marsden \"Guy\""}]