[{"rating": 3.0, "review": "Good idea but you need to have internet connection on your TV which means if you don't have Smart TV,  you need to have some smart blu-ray or DVD player that will connect your TV with internet. Without it, it's of no use.  Also I had to restart the chrome cast multiple times as netflix and youtube apps couldn't connect to the chrome cast. Overall 2.8/5.", "verified": true, "helpfulness": "0/0", "author": "Ashok Tulachan \"selenium lover\""}, {"rating": 5.0, "review": "Love it,  works well in Canada,  be careful of your data usage,  averaging over 200G/month with the whole family watching Netflix on 5 different devices.  Thank you for unlimited usage Videotron!", "verified": true, "helpfulness": "0/0", "author": "Jeanot Desrosiers"}, {"rating": 4.0, "review": "It works great except for viewing Amazon Instant Videos.  These would not transfer to my TV.  All the other movie rentals worked fine.", "verified": true, "helpfulness": "0/0", "author": "James R. Saule"}, {"rating": 1.0, "review": "Picture not clear cant play games better off buying the wire.Wish I could return it or trade it for Samsung wire", "verified": true, "helpfulness": "0/0", "author": "Jason Stewart"}, {"rating": 4.0, "review": "Really great idea, but with limited options. I really like this and want to love it but it needs more supported apps. It'd be nice if Google would stop breaking 3rd party apps which allow this to be used more freely. The price is right but if you really want to stream all your entertainment go with a Roku.", "verified": true, "helpfulness": "0/0", "author": "Tebowned"}, {"rating": 5.0, "review": "Love it!!!! Works perfect!!! Anyone thinking of getting this should beacuse its RAD! So glad I bought this! Just waiting for more apps to be compatible with it!", "verified": true, "helpfulness": "0/1", "author": "kimberly calderon"}, {"rating": 4.0, "review": "Works good from Youtube, but the chromecast from a chrome browser has a delay and has lip synch issues.  If the laptop locks the screen, it would pause the video on the TV.  Overall we like it.", "verified": true, "helpfulness": "1/1", "author": "Ganesh"}, {"rating": 3.0, "review": "The quality when casting a tab from Chrome is not as good as I had hoped. Working from an app like YouTube works well and i wish there was more support for the unit from others.", "verified": true, "helpfulness": "1/1", "author": "Robert E. Henry, Jr."}, {"rating": 5.0, "review": "Amazing for what it does.  Picture quality is better than cable.  For the price it cannot be beat.  Works from my older Kindle and Android phone.", "verified": true, "helpfulness": "0/0", "author": "ned"}, {"rating": 4.0, "review": "this is really great device to watch.  I wish its could expand to watching other media instead of YOUTUBE and Hulu only.", "verified": true, "helpfulness": "0/0", "author": "TanD"}]