[{"rating": 3.0, "review": "It works great with my lap top, but does not work with my Android tablet (Samsung Galaxy 10.1).  It would be great if it can work with my Android tablet.", "verified": true, "helpfulness": "0/0", "author": "Kingsley C. Wong"}, {"rating": 5.0, "review": "It is working great with great picture quality and easy to setup. I bought another for my sister-in-law as well.", "verified": true, "helpfulness": "0/1", "author": "john kim"}, {"rating": 2.0, "review": "Chromecast is not magical. There are a lot of internet programs that cannot be casted from iPad or laptop to my tv except a few that chromecast support. Hopefully google chromecast can work rapidly to increase the apps. Some even lag behind.", "verified": true, "helpfulness": "0/0", "author": "bin sung"}, {"rating": 5.0, "review": "If you have netflix, hulu or an account similar that has an app, it's awesome! Without the app, not so much. Overall I love it and have used it for a month now and don't regret the $35 I spent on it.", "verified": true, "helpfulness": "0/0", "author": "linuxed"}, {"rating": 4.0, "review": "I was skeptical as to the validity of this thing but it does work and we love it.  There were a few bumps getting it set up but well worth it.", "verified": true, "helpfulness": "0/0", "author": "Charles Paquette"}, {"rating": 5.0, "review": "I could not believe how great this inexpensive device works.  I was able to stream Amazon and Netflix into any TV in the house with control by my smart phone.  Good wireless down speed is essential.  Great buy!", "verified": true, "helpfulness": "0/0", "author": "JaxFem"}, {"rating": 5.0, "review": "I have owned Apple TV for several years, and have found the operation to be quite simple.  Now, Chromecast has entered the market with easy and quick setup with similar features at about one-third of the cost of Apple TV.  Excellent product.  I have purchased three for gifts, and everyone has liked Chromecast as well.", "verified": true, "helpfulness": "0/0", "author": "Larry Rowland \"shoolover\""}, {"rating": 4.0, "review": "I really enjoy Chromecast. I like the fact I can control it from different devices. However, the downside is that 1.) You have to pay for PlexPass in order to get it to work with Chromecast. 2.) If you do not have a wireless adapter hooked up to your desktop you cannot stream to Chromecast.Hopefully they will design the software better in the future to where your desktop can just be hooked up to the wireless router. Then transmit information to it, which from there the router can route the information to the Chromecast.I have other wireless devices that I can transmit information to from my desktop, a little disappointing.Other then that I am really happy with its performance.", "verified": true, "helpfulness": "1/1", "author": "Dustin"}, {"rating": 4.0, "review": "It took some fanagling to get my wireless router set up correctly, but that's not the Chromecast's fault. Now that it works I'm loving it. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Does less than a 12 dollar chord on amazon. Boo. Maybe I'm just not doing it right, but the features aren't that great.", "verified": true, "helpfulness": "0/1", "author": "Robert Lillie"}]