[{"rating": 2.0, "review": "I dislike it because it is not like a typical streamer . It is Stupid and I wish I did not buy it", "verified": true, "helpfulness": "0/2", "author": "Lenora"}, {"rating": 5.0, "review": "This product is great!  I bought it as a Christmas gift for my parents, taught them how to use it, set them up with Hulu Plus and Netflix accounts, and enabled them to cancel their Comcast TV subscription, and all because of this product.", "verified": true, "helpfulness": "1/1", "author": "Donkey"}, {"rating": 5.0, "review": "The chromecast was a great addition to our Vizio smart tv, that was unable to directly stream HBO Go.  Nice and small, it was easy to use.", "verified": true, "helpfulness": "0/0", "author": "aksteeel"}, {"rating": 2.0, "review": "Not able to install it.  Directions not clear.  Would like help, but have no idea how to reach a real person for the help that I need.", "verified": true, "helpfulness": "0/1", "author": "Mary Anderson"}, {"rating": 5.0, "review": "First of all, this plugs into an HDMI port, not a USB (which is even better).  Not sure why I thought it was USB, but just wanted to put it out there.  The Chromecast works wonderfully.....if you have wifi in your home and a spare HDMI port on your tv, this should work for you.  Your phone or PC will act as a \"remote control\" for the Chromecast.  The Chromecast unit is the one that uses wifi to get content....not your phone.  So, you phone stays well charged, etc.  Nice!  You can look up online content of your choosing (or anything on your home network) and the TV will display it.  Netflix works great as does YouTube vids, etc.  I read this will not with Amazon vids yet, which is a shame, but for my purposes, it is a great addition for a low price.", "verified": true, "helpfulness": "0/0", "author": "T Gergen \"Tim\""}, {"rating": 2.0, "review": "Is not what I thought, not too smart, lots of limitation what it does it can be done without it and with much less conditions waste of money", "verified": true, "helpfulness": "0/0", "author": "Cesar Clx"}, {"rating": 1.0, "review": "This device _requires_ a 1080p TV.  My old 720p BenQ projector does not work with the Chromecast.  I've plugged all kinds of HDMI stuff into this projector, the Chromecast is the only one that does not work.I called Google support, they told me to RMA the device \"because it is not compatible with my TV\".Nowhere did the product description indicate that the device requires a 1080p TV.  Very disappointed.", "verified": true, "helpfulness": "1/2", "author": "Mike M"}, {"rating": 3.0, "review": "I have a 10,000 square foot house and have to use 2 wifi repeaters/extenders with my router to cover the whole house.  This device wouldn't work when it wasn't near the main router.  Unfortunately I really wanted to use it in the bedroom where the wifi is extended with a repeater.  I have had issues with other devices too.  If anyone knows a solution let me know....", "verified": true, "helpfulness": "0/0", "author": "Somertime"}, {"rating": 5.0, "review": "For the price I paid ($29.00) this is like a gift.  It works well and the screen-savers that comes with this device are worth a lot more than the device itself.However, be careful with free apps downloads you will get from Google Chrome apps website, many of them are loaded with annoying commercials, you may be better off paid a dollar or two than to endure those apps that fill your screen instead of the application you want to enjoy.Other than this side issue this is a great device.Ajay", "verified": true, "helpfulness": "0/0", "author": "4REAL"}, {"rating": 4.0, "review": "Streaming movies from Netflix is wonderful.  I wish there was a \" directions\" folder included though.  It was hit and miss until I got the hang of it.", "verified": true, "helpfulness": "0/0", "author": "Carol Marrin"}]