[{"rating": 5.0, "review": "So easy and simply to turn your TV into a smart TV. Cheap and the best way to go!", "verified": true, "helpfulness": "0/0", "author": "Ben Ellefson"}, {"rating": 5.0, "review": "Best ever!", "verified": true, "helpfulness": "0/0", "author": "Reina Pogue"}, {"rating": 2.0, "review": "I wasn't sure how it worked when I bought it. Basically it turns TV into an additional screen while the videos are playing on PC, phone or whatever. You can't play them on TV only, or control them on TV, like with Apple TV or Roku. The videos have to be controlled and played on another device, Chromecast just copies everything on a TV screen at the same time. That's it.", "verified": true, "helpfulness": "0/0", "author": "J. Kay"}, {"rating": 4.0, "review": "Pros:SmallNo additional power neededFastAttractive screen saver mode which is customizableEasy to setupPriceCons:Doesn't have it's own remoteCan't access NAS drivesCan't do 5Ghz wifiLimited selection of compatibility.", "verified": true, "helpfulness": "0/0", "author": "Quiqie"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Dper805"}, {"rating": 5.0, "review": "Nice to be able to throw stuff from your phone or tablet on to the big screen.", "verified": true, "helpfulness": "0/0", "author": "Ken Weinert"}, {"rating": 5.0, "review": "Cast your device to the big screen!  This is a cool addition to your techno nerd collection. We leave it in guest mode and you will not believe how much entertainment it provides our guests. This is an easy 35 dollar purchase. Check it out!", "verified": true, "helpfulness": "0/0", "author": "Lance T. Davis \"LANCE\""}, {"rating": 5.0, "review": "Love this thing!  One thing I found after the fact that people may enjoy is that if you go to the settings you can actually \"cast screen\" and it will show your phone or tablet on your TV, the home screen or any  app you bring up, so even if you have an app that doesnt allow you to use the Chrome Cast this works as a mirroring device!!!  This is much cheaper then the Samsung Dongles or an All Share Hub.  Love this Chrome Cast and will end up buying for any additional TV i put in my home.", "verified": true, "helpfulness": "1/1", "author": "Justin L."}, {"rating": 5.0, "review": "great product", "verified": true, "helpfulness": "0/0", "author": "Amir"}, {"rating": 5.0, "review": "I use it all the time, mostly for Netflix. I use my phone to control it on the Chromecast, but it allows me to user phone without interrupting the streaming.", "verified": true, "helpfulness": "0/0", "author": "Amanda Davis"}]