[{"rating": 5.0, "review": "I loved it for the few days that it worked. I had to send it back and for this item you can return for an exchange, you have to reorder, which I have not done. Had it not stopped working, would still be enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Laura hernandez"}, {"rating": 5.0, "review": "Amazon Fire TV was purchased for my mother.  It is so easy to use and she can get to whatever she wants to see with the ability to say what you are looking for rather then having to type it in. The choices of shows/movies are limitless.", "verified": true, "helpfulness": "0/0", "author": "Leigh Schwartz"}, {"rating": 5.0, "review": "I own a Apple TV, Roku 2, Roku 3 and Roku streaming stick.  I'm a cord cutter, so I'm always looking for the next best thing.  It's here, it's the Fire TV.  With the exception of HBO Go missing, and a PlayOn app, this has everything you need for a great streaming device.  I actually started watching more Prime content than before, but I'm sure that's the point of Amazon selling there own device.Gaming is much better than expected, I just wish they'd put out some new games faster. I did have a little trouble setting up the device with a hard wire connection to the internet, for some reason it wouldn't accept it at first, but after I unplugged/plugged it back in, it seemed to recognize the connection.The layout is clean, the voice works really well. (Will be much better when it searches Netflix and Hulu also) and the previews of Amazon's Game Studio has gotten me very interested to see what the future holds.  Buy this!", "verified": true, "helpfulness": "1/2", "author": "Adam Mingos"}, {"rating": 5.0, "review": "Love the searching for movies and the storage of our photos which can be watched on our big screen tv", "verified": true, "helpfulness": "1/2", "author": "gmoney"}, {"rating": 5.0, "review": "Great product. Lots of neat features. The Voice search works really well. I would buy this product again without hesitation", "verified": true, "helpfulness": "1/1", "author": "Michael Gildein"}, {"rating": 5.0, "review": "I really love this device. After cutting the cable we own two ROKU 3's. We needed another streaming device and wanted to try the Amazon Fire. Glad we did. Easy hook up, the picture is crystal clear and it offers a lot more than a ROKU such as games and with an additional blue tooth supported controller its like having another gaming system. The downside is Amazon wants a lock on streaming rentals so unless you have a smart TV you can cancel VUDU and these type of services. With Amazon's collection you should be able to do this anyway. Enjoy.", "verified": true, "helpfulness": "0/1", "author": "Sam Phillips"}, {"rating": 5.0, "review": "Great so glad we made the purchase.", "verified": true, "helpfulness": "0/1", "author": "Steven"}, {"rating": 2.0, "review": "ads make you think you can project anything on your kindle onto your tv.  Life just doesn't work that way.", "verified": true, "helpfulness": "0/4", "author": "MoonDoggy \"studiogramps\""}, {"rating": 5.0, "review": "5/5 stars great product form amazon!", "verified": true, "helpfulness": "0/1", "author": "Pulsefsx"}, {"rating": 5.0, "review": "Makes everything easier to watch especially Prime movies and videos.", "verified": true, "helpfulness": "0/1", "author": "billd307"}]