[{"rating": 5.0, "review": "I recently got fed up with high cable/directv prices and decided to try the fire tv and a streaming video company (I went with huluplus).  i'm really impressed on how this works with just about anything.  i also was able to stream my personal movies with plex on the fire tv.  it takes almost no time at all to set up and once you do, you're all set.  one cool thing i found was if i paused and came back later, it picked up where i left off.  I highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Thomas Bartenstein"}, {"rating": 4.0, "review": "I love this thing but I have one glaring issue...There is not enough storage!! I understand Amazon's cloud storage strategy but wiith a device like this local storage is a must. After installing a few apps and some games my 5GB of usable storage is GONE. Who wants to have to delete something to install the latest game. I had to delete Vevo to make room for Asphalt, I passed on an opportunity to purchase Sev Zero because I had no room. PLEASE turn on that USB port. Most of the games I'd want to use on this thing are 1+ gb (Sev Zero, Asphalt, Walking Dead) instal those 3 and a few apps and you are done, out of space...not cool.", "verified": true, "helpfulness": "3/4", "author": "Drew Taylor"}, {"rating": 3.0, "review": "Works great technically but I'm disappointed by how much extra it costs for literally anything I actually want to watch.  You could really blow your credit card up if not careful.  I really expected more to be included with my prime membership.  As if I'm going to pay big dollars to watch shows that air on normal TV every day too?? I might find a movie to watch every few months but at this stage I doubt it will get too much use.", "verified": true, "helpfulness": "5/9", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I would have given this five stars, but I think it's pretty lame that it's missing the ability to play my amazon music library.", "verified": true, "helpfulness": "0/1", "author": "Josh"}, {"rating": 5.0, "review": "Love it! Basically everything the other streamers offer, plus more power to play a library of games that are visually more impressive than the typical offerings (e.g. Angry Birds), and a nicely crafted remote with bonus voice control. New HBO deal is exciting too! A step toward HBO GO without cable hopefully. Fingers crossed.", "verified": true, "helpfulness": "1/1", "author": "Pac Man Fever"}, {"rating": 5.0, "review": "I did my research and read many reviews and since I'm alteady a PRIME member decided to give it a try.  Prior to yesterday, I've been using my Apple TV for most of my streaming video content and have been very pleased with it.  Although, after setting up the Amazon Fire TV, my streaming vehicle has changed.  IMHO, Apple TV has a great unit but they have failed to embrace its true potential and havent changed anything with the UI since i bought it 2 years ago. And, all the Apple content requires purchase for movies that have been avalible on HBO and Netflix for years already. The Amazon TV is what the Apple TV \"could\" be if they would update their UI.  I won't get rid of the Apple TV, since I drank the coolaid and bought into the iTunes universe. But, for now, the Amazon TV has taken center stage and I continue to be amazed at the HUGE amout of content that is available with a Prime membership.", "verified": true, "helpfulness": "5/5", "author": "Loman Bell"}, {"rating": 5.0, "review": "This is a great streaming box!  Like the title says, it's a ROKU on steroids.  I have an Apple Airport Extreme router and the ROKU would \"occasionally\" start buffering because of the processor; however, with the Amazon Fire TV, that's not an issue because it has a quad-core processor.  Great streaming box!Updated 5-4-14  I've had the Fire TV for a couple of months now and for the most part it's great; however, today we rented \"Bad Grandpa\" on Amazon.  It played great but when there was 35 mins left in the movie, it quit playing.  Tried to restart the movie and got a message saying there was a problem with playing the movie and to contact Amazon Customer Service.  I called them and they said that when this happens, \"...unplug the Fire TV for 15 seconds and then plug it back in.\"  In my opinion, that takes the fun out of watching a movie!  I thought the memory and quad-core processor would be enough to stop this from happening, wrong!  Having said that, instead of naming my review \"ROKU on Steroids\" I should have named it \"Just like ROKU\".The Amazon rep said that it was a problem with the memory of the Amazon Fire TV and not the video.  When asked if the problem could be fixed by Amazon with an update, all he said was \"I'll forward that to Amazon\".If you don't mind watching videos that stop playing and having to unplug the Fire TV and restart it during a movie, you'll really like the Fire TV.One other point, the Amazon rep stated that it might be my router.  I have an Apple Airport Extreme, the best and fastest available.  If it was my router, I guess the Amazon rep should have had me unplug my router instead of the Fire TV.  He finally admitted that it was the Fire TV and not the router.Just wanted to get this information out there so people can be informed about the Amazon Fire TV before purchasing one.  All in all, I'm happy with the Fire TV...just aggravated that I have to unplug it and restart it when watching movies.  The Amazon Fire TV should be better than this!", "verified": true, "helpfulness": "1/1", "author": "JPE \"Paul Ezell\""}, {"rating": 5.0, "review": "I love my Fire TV. I already had a WD TV but I moved that to the bedroom and have my Fire TV in the living room. The streaming is awesome. I haven't experienced any skipping or delays when watching movies using any of the apps. I recommend this to anyone who has a Prime account or anyone who enjoys watching movies on Netflix, Hulu, Amazon Instant, or streamed from your PC (using Plex) who do not already have another streaming device or looking for a new device.", "verified": true, "helpfulness": "1/1", "author": "Cherelyn"}, {"rating": 5.0, "review": "I have AppleTV and roku3. All three streamers have strong and weak attributes I am heavily into the Apple ecosystem I love Apple bought the Apple TV has become very slow and needs an updated system. Roku 3 is very fast has hundreds of apps( that you will never ever use) and yeah Roku has HBO and Showtime which are useless to me because Comcast does not support either one on roku. Okay To fire TV. Almost everything about this thing is great, and you know it's just going to get better. Though I do have to say if you have Amazon prime this is a no-brainer. If you don't I might stick with a roku this thing is a streaming box on steroids. In the games are fantastic. When Roku announced they were going to have games on their system a few years ago i was very excited, but ultimately very disappointed. There is no comparison between the two when it comes to games fire wins hands-down! By the way for all you haters  giving this one star simply because it doesn't have HBO, I got some news for you. Amazon just signed a deal to carry exclusive HBO content for free to all prime members!!!!", "verified": true, "helpfulness": "5/5", "author": "Tim Hobson"}, {"rating": 2.0, "review": "NOTE 6/1/2014: Originally I had given this 4 stars back in April, but after waiting and waiting for it to improve, I've changed it to 2 stars.Finally there is a sub-$100 set-top-box (STB) that is powerful enough to play HD video and support flashy applications (to include games that rival previous generation consoles).  The specifications are great from a performance standpoint. It boots up very quickly.  It is low power (<10w normally) and the quality to my HD projector at 1920x1080 is superb.APPS: When and if the Fire TV App Store has started to get more content I will come back and upgrade my review.  Right now it's pretty slim aside from the essentials in streaming (Plex, NetFlix, etc.).  It is possible to install standard Android applications (apk files) via the Developer mode.  I have been able to setup TeamViewer, Firefox (Aurora), XBMC, and a few other applications without too many issues. These applications are not made for FireTV so some buttons might not work, and the cursor shows a big circle instead of an arrow.UPDATE 6/1/2014: Not much has improved as far as Apps availability in the official Amazon store.  Updates are infrequent.  Netflix still has a weak interface.  Plex is available, but you have to setup your own server and it's not free.  It still doesn't integrate voice search with other applications.  It rarely shows content aside from Amazon on the main Home screen.DEVICE COMPATIBILITY: It natively supported all of my wireless (not bluetooth) mice and keyboards.  I did not get a gamepad, but I do not see why it wouldn't be difficult to provide other input devices (certified for FireTV) in the future. It did not detect my USB storage devices (flash drive and USB hard drive) but I presume this will be working at some point given the device only has 8GB of space (which could hold only a handful of games and/or a few hours of synced HD content).UPDATE 6/1/2014: No compatibility with Flash devices still.  Almost ran out of space installing GTA San Andreas before finding out I need a gamepad to even run the application.AESTHETICS AND FEEL: The box is small, light, and nondescript. I like the simplicity of the remote; however I wish it was designed differently as I continually press the Home button instead of Play given their proximity (which then exits my current program and returns me to the main Home screen).  I think this should be removed as accidental button pressing in some applications does not give any warning -- and instead just exits and/or closes entirely.  Better application support for the Home button might solve this non-issue.UPDATE 6/1/2014:  The Home button's location on the remote has become a major annoyance now.  Applications have to be specially developed to have a custom action for the Home button, or else when you press it the application closes and returns you to the main screen by default.  Depending on the application, you might lose all of your progress or it might just be running in the background.OVERALL:  I am not going to return it.  I had just purchased a Roku 3 when the FireTV came out, and chose to return the Roku 3 in favor of the FireTV.  The Roku 3 has better app support, but it is not as fast and developer-friendly as the FireTV.  The FireTV has greater potential in the long run because porting existing Android applications is possible without considerable effort.UPDATE 6/1/2014:  At this point I'm pretty disappointed with how Amazon has handled it post-release.  I was hoping that the application store would grow much more than it has.  It sounds like Amazon's \"walled garden\" approach has turned off developers from getting anything new or exciting on the FireTV vs. other Android or Roku devices.  It is very good at playing Amazon Prime content or a few decent games and applications... but that's about it. I wish I had kept the Roku now... or waited a little longer for the Android TV to come out.", "verified": true, "helpfulness": "1/1", "author": "P. Taylor"}]