[{"rating": 4.0, "review": "Setup was easy and it works so well with the Netflix app on my iPhone and iPad.  The only downside is that there are only a handful of apps that work with it.  I would love it if they can integrate it with providers of free content, especially NBC and ABC apps.", "verified": true, "helpfulness": "0/0", "author": "mb10567"}, {"rating": 4.0, "review": "Google makes it so its perfect!!!Ok fan boy jokes aside this is a great product.Pros:SUPER easy setup.Super easy use.Chrome browser streaming allows you to stream other video sources that do not have a Chromecast app. (plex server, other movie sources)Super cheapCons:Gets VERY hot when plugged in. It really bothers me with how hot this thing gets. Heat is the big killer of electronics and with as much extended use as this device is going to get I really worry that it is going to burn out.Lack of apps/lack of development kit at launch. I understand that Google is working with other sources on apps but there really needs to be a public development kit available so that other programs can get chromecast support. (VLC, winamp, PLEX, even itunes maybe)", "verified": true, "helpfulness": "0/0", "author": "andrew"}, {"rating": 5.0, "review": "The Chromecast teamed with my Serviio media server lets me do almost everything I could want to do.  I'll be buying 2 more here shortly.", "verified": true, "helpfulness": "0/0", "author": "Curtis"}, {"rating": 5.0, "review": "It was awesome for my long time waiting. Great tool let me mirror the phone/mac/pc screen to my 46' TV. Yeah!!!!! ^_^", "verified": true, "helpfulness": "0/0", "author": "Patrick chan"}, {"rating": 5.0, "review": "Awesome, works perfect with Netflix and youtube and any other app that allow its.  Very high definition and fast to load", "verified": true, "helpfulness": "0/1", "author": "Warren Villalobos"}, {"rating": 3.0, "review": "difficult to set up.....works ok with pre-programed channels, however the time monkeying around with it far exceeds hooking an HDMI cable to your computer and being wired.......great idea that needs some tweaking to really save time and reduce wires.....", "verified": true, "helpfulness": "0/0", "author": "Jim Jensen"}, {"rating": 4.0, "review": "Works pretty good most of the time.  Must allow some buffering during some movies but overall satisfied. I will be purchasing another soon", "verified": true, "helpfulness": "0/0", "author": "Antonius Robinson"}, {"rating": 5.0, "review": "I like this, especially for using netflix. Here in Brasil, there are few movies, but, for the low price, worth it!With Youtube is great too!I recommend.PS.: The first setup was unable to iOS, Android used.", "verified": true, "helpfulness": "0/0", "author": "Guilherme"}, {"rating": 1.0, "review": "This product just ruined my tv.  Had it one day and wake up the next morning and my screen is destroyed.  Supposedly has built in burn in prevention.  But there is a horrible burn in of the ready to cast screen on my tv. And my tv was turned off all night.  Was only left on for a few hours.  Love good but this is a crap product not ready to go live. Will be returning 35 dollar product but hundreds of dollars in damage! Buy at your own risk I guess because I have a feeling Google will not do a damn think about it to help me.", "verified": true, "helpfulness": "3/5", "author": "J"}, {"rating": 3.0, "review": "I really thought this device would do more.It works well for what it is, namely an easy to setup and use streamer from my phone to TV. But very limited. It only seems to stream Youtube and Netflix. As far as I can see, it is unable to stream my browser or other services such as Amazon Prime to my TV, and that is a real disappointment. Perhaps it will get improved functionality in the future.So for now I will stick with my beloved Roku.", "verified": true, "helpfulness": "0/0", "author": "R.S.X."}]