[{"rating": 1.0, "review": "HORRIBLE! Find yourself another box. Sling TV keeps getting buffer errors \"catching up\". I have a 50Mb internet connection and box is connected to the router via PLA. Big mistake to have moved to Sling on Amazon Fire TV. Amazon Fire TV, also, has major issues. It keeps running out of space. My son can't play and save his games. Sadly, the Fire TV does not allow you to connect an external drive unless you jailbreak it. But doing so voids the warranty, so I did not want to do that. Get yourself another Android box. This one is too restrictive. Great hardware. If it was less restrictive, I would give this 4 stars. Overall, Horrible! I'd be watching an exciting Warriors game, 23.9 seconds left fourth quarter, and then it hangs, screen turns black, message \"catching up\", then freezes. Arrrrgh!!! Like I said, I'd be better off with another Android TV box. So, I have another one... and it is flawless compared to this.", "verified": true, "helpfulness": "4/6", "author": "Bambino"}, {"rating": 5.0, "review": "Wow!  This was an easy installation.  This is an excellent device that delivers!  Easy from start to finish.", "verified": true, "helpfulness": "0/0", "author": "Ed W."}, {"rating": 3.0, "review": "So far, pretty good from a content and search perspective.  I was impressed with the speed and accuracy of the voice search. And the fact that it searches HBO Go and Netflix in addition to Amazon was a nice surprise.But the interface visually is garbage because it won't let me force 720p resolution. The Fire is connected via DVI to my old Plasma TV and doesn't auto-detect the supported resolutions. So it just looks terrible. The videos are fine, but I wish I could select a resolution. The interface looks so embarrassingly bad I would never show this off to anyone visiting.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great device and easy to operate.", "verified": true, "helpfulness": "0/0", "author": "Lamont Alexander"}, {"rating": 5.0, "review": "Now that I have this I'm really getting my money's worth with our prime membership.  So many videos to choose from!  Turn your TV into a huge digital photo frame :^)", "verified": true, "helpfulness": "1/1", "author": "John Sorbel"}, {"rating": 3.0, "review": "DO NOT BUY FOR TWITCH!!! Everything works well with the exception of the Twitch app , which crashes and kicks you out of channels frequently. Amazon....you own Twitch TV....WTF....If you don't care about Twitch it works pretty well.", "verified": false, "helpfulness": "0/0", "author": "rtc"}, {"rating": 2.0, "review": "The main reason I bought the Fire TV was to watch my out of market MLB team.  Streams TV shows fine, but live feeds are brutal to watch.  Every 10-15 seconds it buffers, making it real hard to watch a game.  The apple TV and my iPad work perfect.  And I've got xfinity 50 meg internet.", "verified": true, "helpfulness": "0/1", "author": "Brad Edwards"}, {"rating": 5.0, "review": "Exellent", "verified": true, "helpfulness": "0/0", "author": "SaraJin"}, {"rating": 5.0, "review": "Awesome Fire Tv.  A+", "verified": true, "helpfulness": "0/0", "author": "Gonzalo"}, {"rating": 5.0, "review": "Great device. Had some issues connecting to WIFI. Instructions not entirely clear.", "verified": true, "helpfulness": "0/0", "author": "Ann-Marie DiGennaro \"book collector\""}]