[{"rating": 5.0, "review": "Easy set-up, opened the box, followed set-up on box for power,  inserted into the HDMI socket and followed the on screen display, the media player was set up in about 10 minutes. Now I watch great movies and what ever I want to.", "verified": true, "helpfulness": "0/1", "author": "thomas williams"}, {"rating": 5.0, "review": "Really enjoy the google chromecast I use the most to stream movies from my tablet to my tv and on top of that I watch a lot if YouTube videos that I'm able to stream.", "verified": true, "helpfulness": "0/1", "author": "Nick Pytell"}, {"rating": 1.0, "review": "Mine stopped working after a few weeks and the support from Google was not good. They had no diagnostic abilities to offer. I had to return the product. Maybe a next generation will be better.", "verified": true, "helpfulness": "0/0", "author": "Paul Bishop"}, {"rating": 5.0, "review": "A great tool for the price, works great with my iPad mini, and I look forward to it adding compatability to more apps.", "verified": true, "helpfulness": "0/1", "author": "Ryan A Cunningham"}, {"rating": 1.0, "review": "NEEDS DISCLOSURE: You neglected to mention that it was  not compatible with Windows Surface 2. As it, it's useless to me.", "verified": true, "helpfulness": "1/2", "author": "Randall A. Baker"}, {"rating": 5.0, "review": "I'm not normally a tech impulse buyer and the TV commercial wasn't real clear on what the Chromecast can do. I figured, however, it was worth $35 to find out. It doesn't replace a Roku or Apple TV. It streams specific content including You-Tube, Hulu, Netflix and Google Play from your smartphone or tablet to be displayed on your HD TV screen. It will also stream web pages from Chrome on your desktop - as long as these all have a wireless network connection. It was confusing to set up (I'm in my late 50's) but we got there and it has been worth it. My wife is thrilled that she can watch the season of Sons of Anarchy that she bought, on the big screen instead of just her tablet screen.", "verified": true, "helpfulness": "1/1", "author": "J. L. Martin"}, {"rating": 4.0, "review": "Excellent device for the money!  I just wish it came with a remote.  That would make it perfect.With more apps being added to this in the last couple of weeks, I'm increasingly hopeful of its flexibility.", "verified": true, "helpfulness": "0/0", "author": "RONAK A NAIK"}, {"rating": 2.0, "review": "It works only with youtube or netflix. If you want to play some videos from your computer, you must buy a media player, not this.", "verified": true, "helpfulness": "1/1", "author": "cocosalto"}, {"rating": 1.0, "review": "I bought this so that I could stream from my laptop, or my Mac or my iPad. After 4 weeks of trying, I'm giving up. It's going in the trash. It doesn't connect. Useless.", "verified": true, "helpfulness": "1/2", "author": "Luis Garcia"}, {"rating": 5.0, "review": "Why I love this product...powers through TV so no need to run another cord to the power strip, tiny in total, no need for another \"box\"', works so well with my Nexus 7 -- simple interface for CC and volume and thumbnails for dragging though streaming, costs so little, now I can view Netflix et al on my new TV. For folks without Bluray or Wii who have TVs new enough to have ports needed and tablet or pad to operate,this is the best thing ever.  Ordered through Amazon. Quick delivery, well packaged, easy to install and use.", "verified": true, "helpfulness": "0/0", "author": "DLP"}]