[{"rating": 1.0, "review": "HI AllI was really existed to get itI spent as others did a lot of time to figure out how my modem should fix itI have searched every where and I could not make it work :(Finally, i was able to set it up manually and i got the message on the TV: Ready to Castbut my devices could not get that :(I have contacted Google support [7-6540000001982]and I discovered that I will not get support because I do not live in USA :(here is the last reply:Hello Mohammed,Thank you for contacting Google and for your reply.Chromecast is not currently intended for use outside the United States, and Google does not make representations about its functionality outside the U.S. Please note that some countries may have legal restrictions on your ability to import and/or use Chromecast. We look forward to bringing Chromecast to additional countries but have nothing to announce at this time.", "verified": true, "helpfulness": "0/1", "author": "Mohammed Bokhary"}, {"rating": 3.0, "review": "Its not the device that was the problem, it's my TVs - they are too old and don't have the HDMI connection that I thought they had when ordering it.  Anyone interested? If so, let me know.", "verified": true, "helpfulness": "0/0", "author": "M. Imes"}, {"rating": 4.0, "review": "This product is great...close to perfect,  it has rebooted a couple of times in the middle of the program, but other than that, love it!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Tuite"}, {"rating": 4.0, "review": "The chromecast does very well what it promises, to cast the chrome browser and to watch netflix and youtube. But I'm still waiting for new apps to come to improve the experience.", "verified": true, "helpfulness": "0/0", "author": "Rafael A S COrreia"}, {"rating": 5.0, "review": "Wonderful, I bought four pieces for my family and my friends ........Everybody love it . Thanks you Google Chromecast .", "verified": true, "helpfulness": "0/1", "author": "Khanh Vu"}, {"rating": 5.0, "review": "Please note that this product comes with a US wall-plug - since it was intended for US sales only but due to a glitch in Amazon this could be bought elsewhere in the world this might be good to take note of)What you get: * 3 meter USB cable (Micro-B to Type-A) * USA wall-socket adapter to USB Type-A (powers the chromecast) * 30 centimeter HDMI extension cable (in case you have a tight fit behind your TV) * And ofc, the Chromecast itself.The only downside to this marvelous product is the fact that it can't power itself via the HDMI outlet on your TV.There's rarely any mention or picture of it in any of the products images that you NEED a external power-supply.Google assumes your TV is modern enough to have a USB plug at the back of your TV which mine didn't, luckily my amplifier does which sits below the TV and just happen to be in a perfect distance to be useful with the USB cord that comes with the Chromecast.All in all, great product which finally delivers what for instance Apple does via AirPlay.You can now watch stuff on your TV and thanks to my 7-HDMI-input amplifier i can also play music via this very tiny product. What you essentially buy is an AppleTV but in a super-slim form-factor which isn't \"proprietary\".(With AirPlay/AppleTV I'm referring to the ability to watch certain videos and listen to music via your phone streamed to your HDMI-input-compatible media-player with very little effort and without any cords. AppleTV obviously have some additional features that you will not get from Googles chromstcast just yet, but then again.. This is being developed as this review was written).", "verified": true, "helpfulness": "5/5", "author": "Anton Hvornum"}, {"rating": 4.0, "review": "needs more integration with computer to play any videos from hard disk, also nee more apps and pc applications  with support for chromecast", "verified": true, "helpfulness": "0/0", "author": "Arunkumar"}, {"rating": 1.0, "review": "All the hype about \"Casting your web pages to your TV\" are bogus! While it sounds like you can do so via PC and tablet, all it really works is via PC. The only reason I bought this thing was to send my tablet's web pages to the TV so the device is a waste.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "One of the products that combines nice technology, with simplicity and a very reasonable price ($35). Although it is limited to cast only from Google products, e.g. YouTube, Chrome Browser, etc. but the simplicity and fun in doing that makes it really enjoyably product to utilize. For YouTube, you can stream/cast directly on your TV from any iOS or Android Smartphone or Tablet just with a single click on Cast Icon, and it works like a charm, brilliant. Highly recommended to buy one especially if your TV does not have apps like YouTube, Browser, etc. Enjoy.", "verified": true, "helpfulness": "0/0", "author": "Fahad Al Solaie"}, {"rating": 5.0, "review": "limited apps right now but, I hope it will just get better as more people show an interest! good deal!", "verified": true, "helpfulness": "0/0", "author": "Christopher P White"}]