[{"rating": 3.0, "review": "I was disappointed with this as it says we get NetFlix, Hulu, etc with purchase, but that is not possible when those are all pay by the month sites.", "verified": true, "helpfulness": "0/6", "author": "Christian McGinnis"}, {"rating": 5.0, "review": "fantastic", "verified": true, "helpfulness": "0/2", "author": "Marcel Rivard"}, {"rating": 5.0, "review": "I use this device daily! Watching series on Prime TV is easier than Netflix. Love the iHeartradio app! Pandora upgrade is cheaper than going through Pandora and rocks as everything goes through my high-end Yamaha receiver!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great way to watch movies and shows.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "works great but does not clone/ mirror to your screen with Apple prods", "verified": true, "helpfulness": "0/1", "author": "JCarl"}, {"rating": 5.0, "review": "This was a gift for a family member.", "verified": true, "helpfulness": "0/2", "author": "Mac's Mom"}, {"rating": 4.0, "review": "This product would get five stars if voice search included other services.  Also, the unit will not enter the sleep mode unless the screen saver is deactivated.  This can be set by choosing \"never\" in screen saver settings.  Everything else is great.", "verified": true, "helpfulness": "0/0", "author": "Northspirit"}, {"rating": 5.0, "review": "I bought one for myself and I recommended it to 3 others. They also now own a FireTV.The design is compact, high quality material and great specs. I use it everyday and I am very happy with it.I actually like the remote. It is bluetooth. So I don't need to point it to the device and can control the device as long as the range allows me to.", "verified": true, "helpfulness": "0/0", "author": "Che"}, {"rating": 5.0, "review": "Excellent product!  This is far better than other internet player ever~I really like this product!", "verified": true, "helpfulness": "0/1", "author": "Jinsung Choi"}, {"rating": 5.0, "review": "I have had the Fire TV for 2 months or so. I had been using my older LG BluRay that would still stream Amazon. but the buffering and poor directory setup was frustrating. I am so impressed with the Amazon unit I am buying my daughter one to replace her Roku or whatever she has. Amazing HD quality, and it might have buffered twice the whole time I've had it, and that was during peak Internet times. All pros so far except one minor complaint. It would be nice to be able to set up a playlist to play consecutive movies/programs without having to stop and restart the next one.like my MX Player Pro does. Or if the function is there, I don't know how to use it. Basic instructions are readily available, but tracking down more advanced features are harder to locate.All in all. my highest recommendation. And I got it on sale for $84.00 with Amazon Prime shipping.", "verified": true, "helpfulness": "0/0", "author": "William Brooks"}]