[{"rating": 1.0, "review": "I bought this, plugged it up, spent four hours on the phone with tech support, reset everything on my network, returned it and bought another one and it still did not work. I don't recommend this to anyone until they get the bugs worked out.", "verified": false, "helpfulness": "0/0", "author": "John Lester"}, {"rating": 1.0, "review": "I was unable to connect it successfully due to problems with my WiFi. It was a big disappointment as it was a Christmas present for my wife..", "verified": true, "helpfulness": "0/0", "author": "M. Simmons"}, {"rating": 1.0, "review": "The reason I didn't like it is it downloaded unwanted stuff to my computer. I would have also had to use computer to do stuff.", "verified": true, "helpfulness": "1/1", "author": "Gail Guernsey"}, {"rating": 4.0, "review": "Worked as promised. Set up was a breeze. Only reason why I gave 4 stars is due to not much can be done using iphone. Also need more apps.", "verified": true, "helpfulness": "0/0", "author": "ANGEL13"}, {"rating": 3.0, "review": "It isnt as good as i was expecting. I have good signal on high speed internet and get alot of lag. Works good on some things like Youtube but places like HBOGO not worth the time.", "verified": false, "helpfulness": "0/0", "author": "Nightglow"}, {"rating": 1.0, "review": "I bought a Chromecast for $35.00 and that is when the nightmare began.  First I tried to set it up on my PC and was told that the device could not be found.  I repeated this using a Mac Airbook, a Nook and a Kindle witht hte same results.A search of the Internet eventually led to a issue with my Linksys E3000; first the AP feature must be disabled (it was) then since the router is a dual band (24 and 5.0 Ghz) I was directed to give the 2.4 GHz connection the same name as the Chromecast.  Still not working, I found someone who said that by enabling Upnp users to disconnect the Internet connection  - still no go.My Nook and my older Kindle needed to have the updated wireless name configured but still no Chromecast.Best I can tell I will have to acquire an iPad or Android to function as a 'remote' in order to make this work.All in all - 25 thumbs down.I almost forgot, you need to use Google Chrome as your browser for this mess.Final update - I finally gave in and tried my iPhone, even though I don't want to use my phone to watch TV.  I was able to get the APP from Apple but -------- I need to update my iOS to 6.0 or later.  NO WAY!Now I have to decide if I would rather return the Chromecast or SMASH IT WITH A HAMMER!!!!!", "verified": true, "helpfulness": "1/2", "author": "Ez"}, {"rating": 5.0, "review": "Keeps party guests entertained with the easy to use interface and the beauty of its simplicity. My whole family was queuing up youtube videos and two family members bought one from Amazon while they were in my living room.  Web surfing and Netflix all work wonderfully. Pandora as well, this thing is neat.", "verified": true, "helpfulness": "0/0", "author": "Blake London"}, {"rating": 4.0, "review": "Kinda' turns the budget LED LCD into an upstairs entertainment center. Just Chromecast Pandora from the tablet it turns on the tv so we can enjoy our favorite music while we make the bed. Or stream Netflix while we ride the exercise bike. Lots of possibilities!", "verified": true, "helpfulness": "0/0", "author": "eyoreboy"}, {"rating": 3.0, "review": "I bought the Chromecast with the intention of giving my Roku 2 to my parents. However, due to video lag, dropped casts and the few apps that currently work with Chromecast (and the fact that my parents can't figure out how to use a Roku), I have both devices installed on my tv. I find myself using the Roku about 2x more often. Hopefully once the list of apps and extensions for Chromecast grows, this will not be the case.", "verified": true, "helpfulness": "0/0", "author": "mona t morgan \"monatara\""}, {"rating": 1.0, "review": "Haven't figured out how to fix a wi-fi problem yet. Working on it. Will have time next week or so.", "verified": true, "helpfulness": "0/0", "author": "Robert  P. Trump"}]