[{"rating": 5.0, "review": "Nice little device.  This is a must have is you like watching tv, and you have wifi.  works with phones, tablets, laptop, desktop. For the price you can't beat it. You can have a smart tv with out buying a new tv.", "verified": true, "helpfulness": "0/0", "author": "Max Krull"}, {"rating": 1.0, "review": "Bought two, one as a gift. Returning both! Not plug and play like Apple TV. Reconfigure my WIFI router? Are you kidding?Apple TV is the way to go here!", "verified": true, "helpfulness": "2/4", "author": "David R. Welch"}, {"rating": 5.0, "review": "This was a gift for my son, and he said it works great.  He can use it for everything he wants.", "verified": true, "helpfulness": "0/0", "author": "Carol M. Rieger"}, {"rating": 5.0, "review": "I enjoy the Google Chromecast.  The video quality with Netflix and HULU is clean.  I can stream almost anything with my Google Chrome browser to the TV.  I can't wait to see what other apps are going to be coming out with it in the future. I would love it if Amazon Prime would upgrade to become compatible with ChromeCast. Currently we cannot stream Amazon Prime from my PC using the Google Chrome browser to Chromecast either.  I am able to use my phone as a remote and continue doing other functions on my phone while my shows are playing.  All in all this product does exactly as it is advertised.  It is easy to use and install.  I enjoy using it and would recommend it to anyone who wants a good quality product.", "verified": true, "helpfulness": "0/0", "author": "Linsey"}, {"rating": 4.0, "review": "Even when I think it is a good product, there is something missing. It  needs more apps running to get out of it all its potential.", "verified": true, "helpfulness": "0/0", "author": "Luis Rojas"}, {"rating": 2.0, "review": "It would not connect to my wifi and when it finally did the loading screen stayed up for 3 hours ... I returned it", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "The unit was uper easy to set up, even for a non tech person like me.  I use it every day.", "verified": true, "helpfulness": "0/0", "author": "jms"}, {"rating": 3.0, "review": "Pretty nifty little device, but the commercials make it seem like it's like a flash drive you just slide into your HDMI slot. But in reality, you need power, so you either need to connect the other end to a USB connection or a power outlet to make it work. On a really thin form factor TV, this doesn't look so good...Functionality is great though if you tend to start watching or browsing for things to watch on your phone or tablet first, as it makes casting it onto your TV super easy and convenient.", "verified": true, "helpfulness": "0/0", "author": "G. Mone \"gOAt\""}, {"rating": 4.0, "review": "As soon as I can cat a chrome tab from my tablet, it'll get 5 stars. Pretty great device otherwise!", "verified": true, "helpfulness": "0/0", "author": "Laura Griffin"}, {"rating": 5.0, "review": "Works great with my ipad.  I love this product.  I have an older tv that is not considered a smart-tv, and can now watch Netflix on that tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]