[{"rating": 2.0, "review": "It's a pain in the Ass. Keeps losing connection and not worth the $35.00. Wish I had not ordered it.", "verified": true, "helpfulness": "1/1", "author": "Jose A. Guadalupe"}, {"rating": 1.0, "review": "It's a rip off. It works, but it's very limited. One would expect to be able to watch the videos or listen to the songs stored in a tablet or smartphone. But it will only play movies or songs you buy on Google apps. Or what you get on Youtube or Netflix. I expected more from it.", "verified": true, "helpfulness": "2/3", "author": "John Kirkpatrick"}, {"rating": 4.0, "review": "A bit choppy and laggy when streaming PC content but other than that, works seamlessly over connections and does the trick!", "verified": true, "helpfulness": "0/0", "author": "Sepehr Salimi"}, {"rating": 4.0, "review": "The chromecast is easy to setup, easy to use. Love casting Youtube videos straight to my TV. Looking forward to more apps on the iPhone that support it.", "verified": true, "helpfulness": "0/0", "author": "Jono Tucker"}, {"rating": 5.0, "review": "The Chromecast works as advertised, very easy to set-up and use. It works flawless with my Nexus 7 and Nexus 5. I have not had any issue streaming Netflix, Hulu and youtube.", "verified": true, "helpfulness": "1/1", "author": "David Magana \"David\""}, {"rating": 5.0, "review": "Absolutely love this device. I don't have cable or satellite in my home but I do have high speed wi-fi so this device is perfect for the TVs in my home that I can't connect computers to. I only wish this has been invented before now.", "verified": true, "helpfulness": "0/0", "author": "April Dawn \"aprildawn\""}, {"rating": 1.0, "review": "Until they start getting more than Netflix and youtube, I'm not gonna give this a good rating.  I don't have my computer in the room I use this so I can't use the Chrome add on.  I only have an iPhone so I am a bit disappointed.", "verified": true, "helpfulness": "0/1", "author": "rocketjewel"}, {"rating": 1.0, "review": "Chromecast is a great concept, but installation may be impossible if your TV, Android operating system, or modem/wifi router is incompatible with Chromecast.  This info may be difficult to find out in advance.TV: An HDMI port is required, and a USB port is helpful (a cord and adapter plug are provided in case your TV lacks a USB port and you have to plug Chromecast into a wall outlet).Tablet:  If you use an Android, I believe a 2.3 or later operating system is required.Wifi:  Some modem/wifi routers are not compatible.  You may be able to find this info on the Chromecast setup website.  At least it lists work-arounds for some incompatible routers.I connected the Chromecast to my TV (Sony Bravia) HDMI port and used the separate power plug, no problem. The Chromecast set-up screen came on as soon as I switched the TV input to the corresponding HDMI port.I connected my Android tablet to the Chromecast wifi network (go to settings, then manage wifi, then select the Chromecast option).The TV screen instructs you to go to google.com/chromecast/setup to download the free Chromecast app.  It would not download for me. An additional problem is that the Chromecast website is designed for a large screen laptop not a 7 inch tablet, so much of it is illegible even with maximum enlargement.I went to my desktop and downloaded the free Google Chrome browser so that I could read the instructions in parallel.It was on the Chromecast setup site that I learned that some Qwest (Actiontec) and other wifi routers are not compatible.Chromecast told me to call Actiontec.  Actiontec said this is a common problem and told me to call Chromecast.  An impasse.After more than an hour of back and forth, I decided that wasting further time for a $35 dongle made no sense.PROS:--I got a good aerobic workout running up and down stairs between my TV/Android and my desktop.--Amazon makes returns quick and easy.  This is the first item I have ever had to return an Amazon item.  Just follow their instructions and drop off the item at your nearest UPS store (Amazon has a UPS locator).CONS:--A waste of time.", "verified": true, "helpfulness": "1/2", "author": "efsch \"efs\""}, {"rating": 5.0, "review": "My son and his roommate had cords all over just to connect Macbooks for streaming, but the Chromecast works perfectly for them without the corded mess. Awesome clarity and transmission without any lag from both Windows or Apple laptops. My sons phone is Android, and we sat on the couch throwing things up on the TV without any lag. The Chromecast switched between content from three mobile devices like a boss. Super easy and fast set-up.", "verified": true, "helpfulness": "1/1", "author": "Ronald D. Pemberton \"Thoughtful Consumer\""}, {"rating": 5.0, "review": "What an amazing little device.  works interactively with youtube and netflix.  able to take whatever is on your current tab on chrome browser and plays it up on the tv screen", "verified": true, "helpfulness": "0/1", "author": "Bryan Burns"}]