[{"rating": 3.0, "review": "What it does it does well,it's just that it does not do enough; just Netflix and YouTube apps and mirroring what's on my Mac", "verified": true, "helpfulness": "0/1", "author": "Eli Bensky"}, {"rating": 5.0, "review": "Wow, I really do like this media playing alot,worked really good right out of the box.I will be telling all ofmy friends about it.", "verified": true, "helpfulness": "0/0", "author": "Willbe275"}, {"rating": 3.0, "review": "I'm generally not an early adopter, and the Chromecast reminds me why. Had it cost more, I'd be pretty unhappy and would probably return it. But since it was so cheap and I waited so long to get it (I placed my order a day after it was announced, and got it almost a month later--later orders are even more back ordered), I'll keep it for now. I bought it primarily to watch YouTube on my TV (for things like exercise videos) and to do some web surfing. Having said that, there are a couple of things I would've liked to have known before buying, so I'm listing them here.1) It doesn't work with Windows XP, or, oddly, Macs older than 2011, so beware.2) You can only use the Chrome browser to surf the internet. Perhaps this is obvious, but the thought didn't occur to me. I mostly use Firefox, so I had to download Chrome (only to find out it doesn't work on XP). I haven't had any luck getting it to work with my iPod Touch except through the YouTube app.2a) I got a Win8 computer over the weekend, so now I can use Chrome to chromecast. But even that isn't straight-forward--you have to download the chromecast app to use it. Another extra step.3) The quality of most Youtube videos on a big screen is pretty bad. This wasn't a huge surprise to me, actually, but it was a bit worse than I was expecting. Doing some research, it looks like it doesn't support 1080p streaming. If you're expecting a good picture quality, you're going to be disappointed.4) The setup is more awkward than it needs to be. It doesn't just find your wi-fi then you enter your password, like every other device I've hooked up. You have to change your wi-fi to Chromecast, then it guides you through the process of getting it back to your regular wi-fi. It just seems like an unnecessary step. Once you've got the wi-fi going, figuring out how to \"cast\" is also not as obvious as it should be. For this, I place the blame entirely on google's pointless move away towards using actual words and replacing them with symbols that may or may not relate to whatever it is you want to do. There's a short video that explains it, but again, if they just used the word \"Chromecast\" instead of a weird little symbol, the video wouldn't be necessary.I also have a Roku, which I love, and I think that it's a better value overall (the cheapest Roku, which is what I have, is only $5 more than the Chromecast). But the Chromecast has a lot of potential.", "verified": true, "helpfulness": "2/4", "author": "SkunkTabby"}, {"rating": 4.0, "review": "I also got 3 months' free Netflix which makes the chromecast $11 for me, what can beat this price? It's cool and handy to cast youtube, netflix, etc. to the TV, the only concern about this product is, the wifi signal can be better.", "verified": true, "helpfulness": "0/0", "author": "B. Z."}, {"rating": 5.0, "review": "I read the reviews and picked one up! Love it for streaming music as you can change songs as well as adjust volume from your device. It's more fun watching YouTube videos when you can just push them directly to your TV so easily. At the $35 price point you cannot go wrong!", "verified": true, "helpfulness": "0/0", "author": "Brian P Remick"}, {"rating": 5.0, "review": "Chromecast can do almost any media. I admit, you do need a decent wifi connection, but given this, get ready to enjoy all your media consumption at the touch of a button...it's even easier than a remote!", "verified": true, "helpfulness": "0/0", "author": "Brennan C."}, {"rating": 5.0, "review": "I absolutely love my chromecast.  It has been great for streaming Netflix and youtube videos.  It is simple in its design and I am confident that Google will be updating it to be even better and work with more services.  I will be buying these as gifts for many of my friends and family this holiday season!", "verified": true, "helpfulness": "0/0", "author": "Dallen Jensen"}, {"rating": 4.0, "review": "I purchased it on the day it was launched. It was pretty easy to setup and I had high expectations with it. I get average 20mbps bandwidth on my Comcast internet but it is still not enough for Chromecast. It takes a lot time to buffer and one can not watch youtube videos with it.Hopefully it will get better in coming days and I will be able to use it regularly.", "verified": true, "helpfulness": "0/0", "author": "Himanshu"}, {"rating": 3.0, "review": "I had problems setting it up at first, didn't want to \"connect\".  once it did it's not exactly what I thought it would be.....", "verified": true, "helpfulness": "0/0", "author": "Dawn"}, {"rating": 3.0, "review": "I am another not happy cusotmer with the Chrome Tab casting. I never saw anything anywhere about it being Beta. That was really the main reason I bought it. I have an I5, 8GB ram and my network is up to date using a Cisco N Router. I guess I should try a hard connection to see what it does but from the other users doesn't fix a thing. Maybe a hard connection to the Chromecast device would be nice to have as an option. That would solve it I am sure but then I would be investing in a competitor's device I would assume.I did not give it more stars as I haven't tried it with Netflix. I did try Youtube I thought and it didn't seem to work well there if I remember right.", "verified": true, "helpfulness": "0/1", "author": "Steve Brewer"}]