[{"rating": 4.0, "review": "Pretty awesome unit. I love how fast it is. I would have given 5 stars but there's a lack of important apps. I have hundreds of dollars invested in vudu but can't have vudu on here.", "verified": true, "helpfulness": "0/1", "author": "Daniel Duncan"}, {"rating": 4.0, "review": "I love my fire tv however, it does need a good news channel as I said in the heading. If I could flick to the news like CNN I wouldnt need to ever have normal television.", "verified": true, "helpfulness": "0/0", "author": "T. Hutchinson"}, {"rating": 5.0, "review": "We use only for movies on prime so can only commit on that use.  Set up to the router was no problem.", "verified": true, "helpfulness": "0/1", "author": "Allen"}, {"rating": 5.0, "review": "Love this unit. Remote works like a dream, buttons are so nice and click perfectly (don't know how else to describe)", "verified": true, "helpfulness": "0/1", "author": "Andrea"}, {"rating": 1.0, "review": "I made the mistake of buying Fire TV strictly for it's Plex functionality. I had thought plex came with it, but buying the app for $.99 wasn't at all a big deal. The app looks good, and plex is able to stream some content from a PMS. (plex media server) The problem is, as of now it does not support DTS. So any movies you've ripped with surround audio, will play but without sound. I tried for an interim solution of adding a secondary non-DTS sound file, but it doesn't seem to work either.Don't hold your breath waiting for the Plex team to fix the DTS issue. They're a very fragmented bunch; working on Plex for 50 different devices at the same time. Last I was told they were \"working on it with Amazon\" and that was about a month ago. Given they've already got a client ready for Google's new TV effort, I can only assume the Fire TV isn't/won't be a high priority.If you're NOT using this for Plex, it seems like a pretty responsive device. The movies I did stream that were non-surround did so flawlessly. I had time giving the box a star rating, separate from Plex itself. (since amazon was pushing it) So the box I'd give a 4*, while Plex itself would get 2* because I haven't seen a fix for this issue yet.**UPDATE**Apparently Plex has a fix for this already, and it's Amazon standing in the way now. So until they let Plex fix the issue, my rating is both for the device and for Amazon's BS when dealing with the plex team.", "verified": true, "helpfulness": "7/8", "author": "El Duderino"}, {"rating": 4.0, "review": "I loved my Roku for 6 weeks, then it just died. Sony blu-ray player, as a streaming device, is preposterously slow. Google Chrome dongle? Never worked. But I have had the Amazon Fire TV for 2 months and it's terrific.  Only a couple of minor things keep me from giving it 5 stars. The extended warranty isn't available after you have had the box for 30 days, yet Amazon still sends me junk e-mails asking me to buy it. And you can't easily browse the free (for Prime members) titles, so I end up just using it to watch Netflix. But it's got terrific potential if Amazon continues to upgrade the software.", "verified": true, "helpfulness": "1/1", "author": "Gary"}, {"rating": 3.0, "review": "No lie -- this is a really neat product.  As others have stated, I found that the microphone/voice search feature works really well.  Navigating through the menus is intuitive & does not require reading a lengthy manual.  Amazon has a decent selection of TV shows & movies from being a prime member however I would look at this device as being a platform for the participating companies (& of course Amazon) to make & have you spend more money.This can be both good & bad -- good in the sense that consumers do not have to pay for features/add-ons that they do not want or need but bad in that it is easy to be 'nickel & dime'd' and not realize how much you're actually spending.  Most, if not all of the participating partners require a paid subscription in order to utilize their service on this device -- netflix, espn, hulu plus, etc., which don't get me wrong, is perfectly understandable.  But a lot of effort has NOT been put forth in making that known to the consumer.. or at least not when I purchased the unit.So I guess that makes me either a sucker or someone who likes to try out new technologies.. or both.  At any rate, I still watch broadcast TV most of the time & will say this is a nice thing to have available when nothing good is on TV.  I will keep it & say it is a cool product... I just wouldn't rush out to buy it b/c I feel reasonably certain that they will be coming out with a new & improved version & this one will be all over amazon & craigslist for $25!", "verified": true, "helpfulness": "1/2", "author": "Plain & Simple"}, {"rating": 5.0, "review": "We have been using the FTV for about a week and we are very satisfied with all aspects of its operation.It performs just as advertised.  The hardware is very small and compact - about the size of a double CD pack.  The installation is quick, easy and uneventful.  The only tedious part is adding in all the associated user names and passwords for WIFI, NF, HULU, etc.  The FTV comes registered and immediately recognizable by amazon.  FTV is a masterwork and we recommend it without reservation.That said, FTV can be improved upon.  It needs to be usable with multiple TVs - at least three.  Amazon needs to expand their access to TV shows and films, both old and new, and reduce rental fees to mimic NFLIX, HULU and such.To view our favorites currently, we need access to not only prime, but NFLIX, and HULU as a minimum.  Amazon, needs to be able to provide streaming access to some limited LIVE programming on a pick/choose basis - financial, world news, sports, and special events, Not an easy task, but if Amazon were able to accomplish this - they would take cable customers faster than they could produce the hardware.  We are even now ready to eliminate our cable TV access down to only the very basic and save a net $60 -80/mo over the current cost of cable TV vs prime/NFLIX/HULU monthly costs.  We want to eliminate cable all together, but we cannot seem to find away to stream CNBC, local news and some sports at a reasonable cost  Satellite radio is a possible alternative though.Amazon - just do it!!", "verified": true, "helpfulness": "1/1", "author": "Fair and Objective \"cost buster\""}, {"rating": 2.0, "review": "I received an Fire TV as a gift because my blu-ray was having issues streaming. After streaming for a few days the Amazon Fire TV crashed my wifi and now it is the ONLY device that will connect wifi in my house. It is so annoying and I would have never purchased it if I knew this was even a possibility of happening. There is no help online anywhere because it is so new. Now my cell is eating up data and my computer will only load certain web pages. This is something that needs to be fixed before I recommend anyone buying this. But, (since it's now my only device) it's great with streaming; only have a few errors so far. Very user friendly. A bit confusing when it comes to free prime shows vs. ones you have to pay for.", "verified": true, "helpfulness": "1/4", "author": "Dana"}, {"rating": 2.0, "review": "After using this product for a few months, I'm almost completely underwhelmed.Basically, I can do everything this product can do on a cheaper product (mostly on chromecast).Now that the Fire TV stick is out, it would seem that every feature that I use on the Fire TV is available for $19.The apps availability is weak.  I use WatchESPN, but I have yet to see Fox Sports Go, TNT, TBS, HBO, or a variety of other channel apps that were expected early on.It would seem that Amazon quickly rolled this product out without putting much time and effort into it.  They hyped it up, and they have yet to deliver.Personally, I'm just waiting for the day that I can trade it in and get rid of it (but Amazon has denied that to date).", "verified": true, "helpfulness": "0/0", "author": "DG"}]