[{"rating": 3.0, "review": "Says what it does but there is lag when streaming media. I'll probably use it for pictures from device to tv.", "verified": true, "helpfulness": "0/0", "author": "allen \"fam shop\""}, {"rating": 5.0, "review": "for 30 dollars i couldnt complain, amazing features, i just cant wait till amazon video is supported, but with youtube and plex support its well well well worth the money", "verified": true, "helpfulness": "0/0", "author": "Anto Antony"}, {"rating": 5.0, "review": "mostly use it for netflix and youtube,but there's more you can cast with it.your computer or smart phone is basically just the remote control,if your using your smart phone with it, it won't burn your battery.easy to set up and easy to use.", "verified": true, "helpfulness": "0/0", "author": "jwk"}, {"rating": 5.0, "review": "Pros:Browsing and selecting Netflix and YouTube videos on your phone as opposed to TV remote is immensely faster and more efficient.Cons:Since there is no physical remote, you have to go back to your Phone/Tablet/PC to pause or play the video. When someone really needs to pause a video and the host device isn't accessible at that moment, they either have to have a compatible device to control the Chromecast or just shut the TV off completely. Not as easy as reaching for a physical remote and pressing Pause. I hope Google makes a basic remote for the ChromeCast just to control simple playback functions, or allow other OEMs to manufacture them.", "verified": true, "helpfulness": "0/0", "author": "Robert E Leet"}, {"rating": 5.0, "review": "Great product!  I'm in YouTube heaven!  I use Chromecast every free moment I have.  It's so easy now to use my Android to control it and I keep up with my subscriptions with such excitement.  Television has never been better!  An, amazing, heavenly product!  I can't wait to take it with me when I travel!", "verified": true, "helpfulness": "0/0", "author": "Josephine Spence"}, {"rating": 5.0, "review": "The setup was very quick and straight forward, about 3 minutes from opening box to streaming Netflix from my IPad. I also like how when I hit the cast button my TV automatically switches input to the Chromecast, pretty sure that's the TV sensing the input and switching, can't recall the term for that feature atm. Haven't had any issues after about a month or so of regular use with Netflix and HBO GO.I'll never understand why people complain about and/or give low ratings because something doesn't do things it never claimed to do... It's a cheap device for quick and simple streaming, and it's targeted to those of us that don't feel like dropping $100+ on an Apple TV or similar device.... It does it what claims to do, and does it very well. I love reading reviews where someone will only give it two stars because you can't browse through NF or HBO's selections with it, or tab cast from mobile devices, etc......", "verified": false, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 3.0, "review": "For the price, this is a neat little bit of technology. The only thing I wish it could do is stream from Amazon Prime… and I don't think that is going to happen soon.The app isn't perfect, and does some odd things when you have to unlock your phone. But to put the TV on the back porch once in a while; it is great.", "verified": true, "helpfulness": "0/0", "author": "Peter D. Fortin"}, {"rating": 4.0, "review": "Purchased the chromecast a little over a month ago for my 3 year old. He loves it! It was easy for him to learn to control since he already knew how to use his samsung galaxy player. Now he can watch netflix on his bedroom tv instead of the 4 inch screen on his device. The reason im only giving the chromecast 4 stars is because i have had to reset it a couple times and do the inital setup again which is a little inconvienent. Otherwise its a great product.", "verified": true, "helpfulness": "0/0", "author": "Debi Rossetter"}, {"rating": 5.0, "review": "This was very easy to set up. I was very surprise how good it worked. I first tried the WII BUT IT WAS SO HARD I GAVE UP.", "verified": true, "helpfulness": "0/0", "author": "mary little"}, {"rating": 3.0, "review": "I've had the chrome for almost a year. First of all I got it to mainly watch netflix.Secondly, I thought \"how cool is it that my TV has this sort of online access for that price\" As soon as I got it, I started installing it in my room. It was real easy, understandable steps. Got the installation done in about 5 minutes. The size wasn't too bad but I have an LG tv mounted in the wall and the usb connection was not in an ideal place for the connection. Because the chrome isn't that big I was able to work with it.It worked fine for the first month. It had some loading issues but very rarely. I was happy.Then- out of nowhere I was having issues. Couldn't watch something  without it loading, pausing, freezing,stopping, and even disconnecting every minute. I called to see what could be done. They told me to basically reset everything and refresh and what not. It helped, but it didn't solve my problem.I tried it on my living room, connection was even worse!I decided to call again and this time they said that the chrome connection also depends on the type of wireless router box I had. They guided me to check the compatibility of my wifi and the chrome. Turns out that based on the wifi router the chrome needed to be within 12 ft of my wifi router.Our box is located in my sisters room and I decided to try it there.Connection improved and she has no issues with it AT ALL.I have to say I was upset upon resolving the issue because I got the device with the impression I would be able to use it on any tv in my apartment and it only works in ONE ROOM.I advice you, especially if you have wifi : PLEASE MAKE SURE THE CHROME WILL WORK FOR YOU ACCORDING TO YOUR WIFI CONNECTION/ROUTER. You don't want to get a device which later on won't work like you thought it would. I don't mind my sister keeping it but let's say I don't get to enjoy it as much. The 3 stars are for how well it works within the \"perfect conditions\". It doesn't get 5 stars because there are limitations to where and who will fully benefit from it.", "verified": true, "helpfulness": "0/0", "author": "tottie"}]