[{"rating": 5.0, "review": "Having a lot of fun watching this. All the choices are amazing", "verified": true, "helpfulness": "1/1", "author": "Joanne Wright"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "1/2", "author": "Anthony"}, {"rating": 5.0, "review": "Kick-ass.", "verified": true, "helpfulness": "1/2", "author": "Mitch Paulk"}, {"rating": 2.0, "review": "I already had Netflix, and it seems to have alot more titles than Fire. Like alot of other reviews, I agree that picking a show or movie is a pain. You have to go through too much to find out if it's free through Prime. I've only had Fire for about 3 weeks, but about to unhook it and cancel Prime. I got Prime because of Fire, but except for the free 2 day shipping,(which you can share with 4 family members)my wife can't use any Prime benefits. She has a Kindle and would use Prime advantages alot more than I will.", "verified": true, "helpfulness": "2/3", "author": "Jim"}, {"rating": 2.0, "review": "I am somewhat disappointed in what I get from Amazon's Fire TV. Everything that my wife and I chose Fire TV over Roku for were greatly diminished when we found out that ALL of the channels were additional fees. Whereas on Roku they were included. We chose Fire TV because we were already Prime members and figured this would be the easiest and cheapest way to drop our cable. Boy were we surprised when we found out the while Fire TV does offer HGTV and the shows we wanted to see, we would only be able to watch EACH SINGLE episode for a pay per view charge of $2.99! It would be cheaper to have full blown cable with all the pay channels that we wanted to watch.Showtime Anytime IS available but ONLY if you are paying for it through your cable provider. It is an included service on Roku.Where are the savings? What is the benefit of having Fire TV?I can watch everything that is offered on Fire TV on my Kindle Fire HD...I don't see how this is any different than anything else that you don't already offer for those of us with Kindles.We thought this would be so much more....", "verified": true, "helpfulness": "2/4", "author": "Mack Diesel \"Mack\""}, {"rating": 5.0, "review": "Love how much cpu power this thing has in it.  And it allows side-loading android apps too.  This replaced my Raspberri Pi as a XBMC media center, plus I have access to all the amazon prime content too!  It runs cool and fast. Couldn't ask for much more.", "verified": true, "helpfulness": "0/0", "author": "Nathan M \"geek\""}, {"rating": 5.0, "review": "My husband loves his Father's Day gift!  He's found some of his favorite shows from the past and even some new ones!!  As a music lover he's able to fill the house with his favorite artists in the evening which makes for a nice relaxing environment!!!", "verified": false, "helpfulness": "1/1", "author": "L. N. Hines"}, {"rating": 3.0, "review": "Coming from a ROKU3 and Apple TV, the Amazon FireTV interface was slightly confusing to me. After figuring it out, there was some things I liked and didn't like.The speed of the FireTV blows away the competition, the remote design and layout was much better than Apple and Roku with ease. The voice search function of the FireTV is what I loved and hated. I hated the fact it only search upon Amazon stuff. Amazon is trying to shove all its content in your face to make more money off you, which is super annoying. I want the voice to search all installed channels so I can see where the movie/tv show is I want to watch and what it's going to cost me in each venue. I don't want to be forced-fed with Amazon content, and yes I am an Amazon PRIME member and still don't want it force-fed to me.If/when the voice search can search all installed channels, I will then switch to a FireTV, until then, I will stick with a ROKU 3 which has sever me well, is still fast enough, functions properly and has more channels.I do no care about the gaming aspect of the FireTV at all, not even remotely. I'm sure the majority of people who purchase it feel the same. Overall I think its better than the AppleTV (because that is archaic now) but I still think the ROKU 3 is an overall better product for my needs and that's all that matters to me.Also, the NETFLIX app was the dated VHS style layout, odd considering the updated HTML5 version of the app is available on lots of other platforms, including the ROKU3.------------------------UPDATE #1: 07/25/2014------------------------I contacted Amazon about their voice search and when it would become available to 3rd party apps such as Crackle, Netflix, Hulu, etc. I did a follow up call this past weekend and I received conflicting info from various reps. The first rep so it was available and voice search did work with all apps. But it literally didn't.The second rep said it doesn't currently work with all apps and as app updates come out some apps may be voice search compatible however there wasn't a list of apps that would or wouldn't be compatible. It was up to the 3rd party app devs to make it compatible.The third rep said it was only meant for Amazon content and they did not provide an SDK for the DEVs to make it compatible with their apps.In the end, I'm running in circles and don't know what is or isn't true. Very disappointing for a company that strives in customer satisfaction. Based off this information, I dropped the review to 3 stars as it's deserving in my honest opinion. I will update in 3-5 months.", "verified": true, "helpfulness": "7/8", "author": "Orlando"}, {"rating": 1.0, "review": "Apparently Amazon has a beef with Netflix as the Amazon Fire TV displays errors when loading all Netflix content.  We have had the device since April and had no issues until the past two (2) weeks.  This is definitely an Amazon issue because we also have a Google Chrome Cast which we now use instead of the Amazon Fire TV because the Chrome Cast has no issues playing Netflix content.  I tested this several times with the same movies and Amazon Fire TV is consistent in not allowing Netflix content to play and Google Chrome Cast is consistent in showing Netflix content with no issues.  NOT HAPPY.", "verified": true, "helpfulness": "3/7", "author": "Robert E Browning"}, {"rating": 1.0, "review": "The device does not play Netflix properly consistently.  It will try to load a movie or show, it will buffer slowly then when it looks like it's loaded, it kicks me out of the app and brings me back to the FireTV home page.  I have to clear the cache, get up, un-plug the device, wait, plug it back in.  Then I have to log back in to Netflix and cross my fingers.  Netflix will work smoothly for a day or two and then I will have to go through the process again.  I know it's coming when it buffers slowly.  I have no issues with Netflix apps on my PS3 or other devices so this is a problem with FireTV interfacing with Netflix, one of there most popular apps for this device, rendering it frustrating and useless. The only fix currently available is the one I mentioned.Update:  Since I wrote this review, Amazon contacted me. After much ado they sent me a replacement unit, temporarily charged me for it, and asked to send the original back.  I received two return slips from them which I though was strange until they received my return and I received a partial refund. They charged me a restocking fee and some other fees.  I paid $99+tax and received a $78 refund.  Now I have to deal with them again.  I would have just left it alone had they not contacted me and now they charged me for it.  To make it even worse, the same problem persists on the new unit.  I have it wired with Cat-5 and I have internet speeds up to 20Mbps.  This is no Kindle (which I love), this thing is junk and the customer service was wretched. I have no problems running Netflix on my PS3, this is an issue with FireTV.Don't take my word for it, look it up on the web.  If I could give negative stars I would.", "verified": true, "helpfulness": "3/6", "author": "Joe"}]