[{"rating": 5.0, "review": "I have just bought this because it's the best option ever, I'm from Dominican Republic and here a HDMI cable may cost like 25 or 30 USD, and you have to keep your devices attached to the TV, and it's not the same because the Cable would only allow you to stream your device screen.  The chromecast gives you a lot of options, I'm always learning something new that this thing can do. BEST PURCHASE EVER!", "verified": true, "helpfulness": "0/0", "author": "Felix Garcia"}, {"rating": 4.0, "review": "After the initial bummer of realizing you have to keep it plugged in while its in use, its been great.", "verified": true, "helpfulness": "0/0", "author": "Alex Gould"}, {"rating": 1.0, "review": "this item is not a user friendly unit", "verified": true, "helpfulness": "0/0", "author": "kenneth w snider"}, {"rating": 5.0, "review": "Love this! We tried to use our blue ray with wifi and the service was so slow. Replaced it with this product and what a difference! Easy installation and starts working right away! Great product :)", "verified": true, "helpfulness": "0/0", "author": "Alton"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Henry"}, {"rating": 5.0, "review": "Great product, work petfect!", "verified": true, "helpfulness": "0/0", "author": "Bigheadgals"}, {"rating": 5.0, "review": "I now have three of these gems. Just buy one and it will speak for itself.", "verified": true, "helpfulness": "0/0", "author": "Nothing Sound"}, {"rating": 3.0, "review": "Was great when I got it, the last few months it hasn't played Netflix at all.  Price is great but still no Amazon Prime app.", "verified": true, "helpfulness": "0/0", "author": "Vijayender Saladi \"Gadget Lvr\""}, {"rating": 5.0, "review": "Works amazing...the quality is super good and the setup was easy and painless.  At first I had an issue with my TV flickering during playback and thought the Chromecast wouldn't work, but I switched it to a different HDMI port and it worked flawlessly.  Getting another one for my other TV.", "verified": true, "helpfulness": "0/0", "author": "E.J. Michaels"}, {"rating": 3.0, "review": "It's okay, but I'm not happy with it.  Broadcasting your desktop (on 8/23/14) is experimental and does not support sound.  So, video without sound.  Sure, you can probably set up the sound in some other way (wire it directly, perhaps?), but then it won't sync with the video.  Forgot to mention the video is noticeably delayed.  Fairly unhappy with this device and the purchase in general.", "verified": true, "helpfulness": "0/0", "author": "Robert W. Newton \"lektrikpuke\""}]