[{"rating": 5.0, "review": "I have had the Amazon Fire TV for a little bit now, and I purchased it in hopes of cutting my cable.  I haven't been able to do that yet, but I have hopes.  A few more apps and hopefully I will be cable free.  I love the ease of use and have only minor issues with the voice control.  If I speak too softly or mumble (like first thing in the morning) then it doesn't work well, but that is my fault, not Amazons.", "verified": true, "helpfulness": "0/1", "author": "Leslie Campbell"}, {"rating": 5.0, "review": "Realy have not used it yet for movies but the games are interesting and the weather app is great.", "verified": true, "helpfulness": "0/1", "author": "Frank Weido"}, {"rating": 4.0, "review": "Love the idea of this box, only issue I have is that I can NOT turn it off!  Maybe Amazon will find a way to change that....", "verified": true, "helpfulness": "0/1", "author": "K S."}, {"rating": 5.0, "review": "For 2 years previously have used the built in streamer in my Sony Blu Ray DVD player. The Fire appears to be much advanced.  Although many of the basic functions are the same between the two, the Fire steps ahead in several areas.  1) Small footprint of hardware and very easy installation; 2) Beautiful, interesting, and elegant user interface; 3) Excellent, quality remote control with built in voice search microphone (this is a very useful and funtional difference between the DVD player and most streamers); 4) The speed of the units \"transport\" keys is impressive and far better than other devices 5) video and audio quality are significantly improved.  All this shows me that the Fire unit was well researched and developed.", "verified": true, "helpfulness": "0/2", "author": "mikeinga \"mh51\""}, {"rating": 3.0, "review": "Good so far.", "verified": true, "helpfulness": "0/4", "author": "Uncle Ken"}, {"rating": 1.0, "review": "I had no problem setting it up.  But I didn't like it because of all the things you see in the other negative reviews.  Like my Roku much better.  Return was no problem.  Though I wound up keeping the cable I ordered with it as it came from a different company and would have cost more to return it then I paid for it.  In the future I'll buy that sort of thing locally.  I'm only out about six dollars on the cable and thirteen on returning the Amazon Fire.  Live and learn", "verified": true, "helpfulness": "6/7", "author": "kate476"}, {"rating": 5.0, "review": "Amazon has really outdone themselves on this unit, I don't use my Direct TV anymore as I am finding an endless amount of movies/shows to watch. If you have Amazon Prime then you need to have this unit, you wont need cable/satellite anymore.", "verified": true, "helpfulness": "0/0", "author": "Michael Favreau"}, {"rating": 4.0, "review": "Needs better search capabilities.  Seems to only want to search Prime.  Also, needs easy way to play videos and music directly from ethernet PC.", "verified": true, "helpfulness": "0/0", "author": "Ron Pankey"}, {"rating": 5.0, "review": "I have several different type of Media Players over the years and this one rates at the top of my list so far.I have only had it a couple of weeks but it has met my needs, as well as my wife. It plays Hulu perfectly and one draw back I thought it may have had was not ability to play my own content from my server but with it using Google Play and the library of applications I found my Vimu app that I use on my Sony Google TV and so everything works just fine on this device. My Sony is my second favorite but it doesn't have Hulu as of yet. Then I have Apple TV 1, 2 and 3 to which fall in 3rd place. I had to jailbreak 2 to make it useful for me but it underperforms a lot.So I will probably be buying another 1 or two of these Amazon Fire TVs but may also wait awhile to see if it gets upgraded.", "verified": true, "helpfulness": "0/0", "author": "Bradley R. Clampitt"}, {"rating": 5.0, "review": "Very happy with Amazon Fire TV.  Set-up was about 5 minutes, easy to use, great picture.  One odd thing--any video from Amazon Prime looke wonderful but initially all Netflix videos were awful, even the \"superHD\" ones.  Smeary, jaggy picture that was never going to be acceptable.  Realized there was an update waiting and installed that.  Now all videos from any source are beautiful and flawless.Haven't tried all the features yed, but installed a free radio app, and found a large selection of music, news & talk radio too.Now I'm cutting the cable at last, and good riddance.", "verified": true, "helpfulness": "0/0", "author": "Stephanie A. Stark"}]