[{"rating": 1.0, "review": "Straight up disappointed. Real review here, I have a macbook pro, iPhone 4 streaming to the chrome cast thats plugged into my samsung 46 inch 1080p tv.this is my third chrome cast. the chrome cast lags, disconnects, takes forever to load before doing the previously mentioned actions and is just a waste of time. doesn't stream local media, but if you have playlists on youtube then its no problem. NOT iTunes compatible. anything you bring up in google chrome from youtube to amazon to porn can be cast up but its horrible. can't even shop on amazon with this thing. waste of time. waste of money. i didn't even bother trying to get a refund, i just left it outside my door for the next poor sap", "verified": true, "helpfulness": "2/5", "author": "Derrin Evans \"Whatshisface913\""}, {"rating": 5.0, "review": "As long as you understand what this is, it works perfectly.  It is not a stand alone device.  It needs a computer with a Chrome browser or a smartphone, tablet, iPad or PC with a compatible app, that once started on the smartphone, tablet or whatever, is then \"passed to\" (or \"cast\") to the Chromecast where the Chromecast then displays the app on your TV.  For example.  Netflix.  I start Netflix on my phone.  On the Netflix screen is a \"cast to Chromecast\" icon.  I select that icon, it asks which Chromecast to send Netflix to and gives a list of Chromecast devices it find on YOUR home network.  You select the Chromecast and a tiny stub program is sent to the Chromecase that then connects the Chromecast to Netflix and plays whatever it was you selected from your smartphone.  Pause, fast forward and so forth are still done via your smartphone.  There is no separate \"remote\".  The video is not displayed on your smartphone.  In fact, you can actually turn your smartphone (or PC or whatever) OFF and the video will continue to play as it is streamed directly to your Chromecast from Netflix, not to you phone, and then to the Chromecast.  BUT, realize that if you do that (turn your smartphone off), you will no longer be able to control pause, play, start, fast forward or fast reverse.  It's a great device, I love mine!", "verified": true, "helpfulness": "0/1", "author": "D. Curtis \"Don\""}, {"rating": 5.0, "review": "Everything works really well since day 1 and I just ordered another one for a 2nd tv. I love it!", "verified": true, "helpfulness": "1/2", "author": "I. Prado"}, {"rating": 1.0, "review": "Poorly working device. I had to return it on the 2nd day because too many errors. Many functions are beta so very unstable.", "verified": true, "helpfulness": "0/4", "author": "Sung-sub, Shin"}, {"rating": 5.0, "review": "I just received my Google Chromecast, hooked it up  and it hooked me up, this is great. I was using a monitor to monitor cord to watch my shows and movies from my laptop. now I don't have to. I love this . Well worth the money.....", "verified": true, "helpfulness": "0/1", "author": "Pam"}, {"rating": 5.0, "review": "TOTALLY FREAKIN' AWESOME!!!The best invention since the world wide web! Go Google!It took less than 5 minutes to setup and works perfect!", "verified": true, "helpfulness": "0/1", "author": "lamdressag"}, {"rating": 1.0, "review": "it only works with media from the internet. NOT your device if you have a picture or movie on your  tablet,phone or computer this device will NOT stream to tv.", "verified": true, "helpfulness": "4/9", "author": "Dax"}, {"rating": 5.0, "review": "Works Great. Very easy to use. Allows you to do other things on your mobile device while using the Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Eric"}, {"rating": 1.0, "review": "Can't get Amazone prime and no remote control hard to set up not worth the time, Google rushed this to market. I like all Google products but this one suck. And to top it off I hand to pay shipping back to Amazon.", "verified": true, "helpfulness": "2/6", "author": "Gary F"}, {"rating": 5.0, "review": "Product took forever to get. But it's a great item. Husband uses it often and it works great. No issues at all.", "verified": true, "helpfulness": "0/1", "author": "Amanda R. Bell"}]