[{"rating": 2.0, "review": "This was not easy to set up.  DId not synch or work with UVerse.  Needed to buy a different router and then find someone who could hook it all up.  It works now but was not easy.  And does not work with as many options as Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Lamartine Simons"}, {"rating": 4.0, "review": "It does exactly what it says it will do.  I wish it would work on many more Programs.  I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Connects to your HDMI port on your TV. I'm using it with an older Philips TV and multiple nexus tablets.  For $35 it's great.  More app support would be awesome.  Tabcasting from a tablet would be awesome. Still to come?", "verified": true, "helpfulness": "0/0", "author": "Joe W"}, {"rating": 5.0, "review": "Easy to set up. Love how I can wirelessly connect everything from my Laptop/phone/Kindle to TV. The best part I can mute my Laptop and keep working on something else while my netflix plays on TV.", "verified": true, "helpfulness": "0/0", "author": "Praveen"}, {"rating": 5.0, "review": "This was easy to set up and run, but at first there were occasional pauses in the streaming movies. I relocated my Linksys Wireless-G Router near to the TV that had the Chromecast attached, and it has worked flawlessly since. I subscribed to Netflix and downloaded their app on my Android phone and I like being able to use the phone to choose a movie and then as a remote to start/stop/pause play.", "verified": true, "helpfulness": "1/1", "author": "Bruce Colley"}, {"rating": 5.0, "review": "When presented with the prospect of buying a BlueRay disc player with Wi-Fi to attach to my 4-year old Samsung HDTV to make it Smart, laying out as much as $150 in the process, or paying $35 for the dongle that would stream media for me AND be portable to my other TVs, not much more thought was required on my part. Downloading software and installation were a breeze, and I had Chromecast up and running in a few minutes.For a small investment, it has enhanced the level of entertainment for my family, provides us with more viewing choices, and makes leisure time more enjoyable. A big feat for so small a gadget! If only it could make me younger....", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "I just love this small gadget it fits my every need for my movie watching experience. I would highly recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Den ise Robinson"}, {"rating": 5.0, "review": "This thing is so cool. It plays nice and they are cheap enough to have one for each TV in the house.", "verified": true, "helpfulness": "0/0", "author": "Conner C Brown"}, {"rating": 5.0, "review": "Great product, easy to use and set-up.  It took me less than 10 minutes to configure.  I have been using for a couple of weeks without any issue.  Unlike my wi-fi equipped Samsung blue ray player, the chromecast has not timed out or experienced any buffering issues.Keep in mind it does not work on all products.  It does not work with web videos or Amazon prime videos, but works great with Netflix, Hulu Plus, and Youtube.  I have heard rumors that Google is looking to expand the compatibility of chromecast.For the price ($35 less $5.01 Amazon student discount), product offers a good value compared to substitutes (e.g., wi-fi equipped blue ray players, Apple TV, wired iPhone connections) .  I will probably buy another one for my other LCD TV.", "verified": true, "helpfulness": "0/0", "author": "jhanfman"}, {"rating": 4.0, "review": "I am a technophobe. This product was EASY to install, and i was watching movies from my paid-for-but-never-used Netflix account within 30 minutes!", "verified": true, "helpfulness": "0/0", "author": "Deborah H Gonzalez"}]