[{"rating": 5.0, "review": "I stream shows from Netflix/HBO GO to my TV and it works extremely well. Both Netflix and HBO GO have Chromecast buttons on their actual media player which is awesome. I've had no problems with either. I've also streamed some games and Youtube videos from Google chrome. It takes a few seconds for the sound to \"catch up\" to the video, but it works well. Another pro is that anyone with access to your WiFi can play music videos via Youtube on their phone. It's helpful because everyone has a different taste and you just let people do their thing without having to worry about what to play. I have this connected thru my sound system and it works well.", "verified": true, "helpfulness": "0/0", "author": "John S"}, {"rating": 5.0, "review": "I would recommend this to anyone who is thinking about it. For the price, you simply cannot beat it. Set up was a little bit tricky because of my router settings and the 5g band it was sending but other than that, it works extremely well. I even installed in on a \"smart tv\" so that I could cast my own computer screen onto it.", "verified": true, "helpfulness": "0/0", "author": "Jerms"}, {"rating": 5.0, "review": "This is one of the greatest inventions yet. Wish it worked off of the data network rather than wireless internet, but whatever. Works like a charm though.", "verified": true, "helpfulness": "0/0", "author": "NBrof"}, {"rating": 4.0, "review": "I'm on the road quite a bit for work and this allows me to stream my Netflix/hulu to the hotel TVs as long as I jump through a few hoops.  The first being that since I'm signing onto the hotel wifi, I had to bring my own router, and then set the Chromecast to connect to my router in lieu of the hotel wifi.  I connect my device to my wireless router and am good to go.  It'd be nice if I didn't have to connect the two to the same network in some way, but instead just stream straight from device to Chromecast.  I'm sure there are reasons for this, but I was considering getting one of these for my cabin, which doesn't have any network or internet, to be able to play videos stored on my tablet.  More hoops to jump through for that.  That being, I love that I can watch Netflix and Hulu on the Hotel TV in lieu of watching on the tablet.  I never thought I'd need one of these at home with a Smart TV, but when I started traveling, it's become a must have for me.", "verified": true, "helpfulness": "0/0", "author": "Clint Craft \"Crafty\""}, {"rating": 5.0, "review": "It works, plain and simple. I love it. Use it with netflix a lot. Compatiable with my macbook so i'm happy google did that.", "verified": true, "helpfulness": "0/0", "author": "Joseph I. Lazarus"}, {"rating": 4.0, "review": "Works great with Netflix and Youtube from my mobile devices, so from that standpoint it's great for turning an old tv into a smart-tv.  Unfortunately what I was most excited about was using it to stream Amazon video since it would've been the first device I have that's capable of that.... and it doesn't work.  After trying several troubleshooting steps suggested online and finding out that Google says my problem is a known issue, I've given up on it being Amazon Video capable for now.  Therefore, if I do buy another device for my other tv, it will probably be an Amazon Fire instead of a 2nd Google Chromecast, which is a pity because there's so much potential here at such a great price.  But if you'd be satisfied with just Netflix and Youtube, knock yourself out, it's well worth the price!", "verified": true, "helpfulness": "0/0", "author": "Tawanda"}, {"rating": 5.0, "review": "fantastic product.I use it to stream audio and/or video from my phone or my upstairs PC (where I cannot run physical video cable) to my downstairs living room projector.Godsend !", "verified": true, "helpfulness": "0/0", "author": "Patrick J. Richardson"}, {"rating": 3.0, "review": "Tried to love it but it is just not as good as ROKU..IT REALLY HAS SOME OKAY THINGS going for it like the price and I like that you don't have to be in the same room to turn it on! But it really NEEDS A REMOTE CONTROL and more apps!", "verified": true, "helpfulness": "0/0", "author": "sandra"}, {"rating": 4.0, "review": "Occasional streaming problems, but overall more convenient than connecting the computer to the TV with a cable.  I would recommend it to a friend.", "verified": true, "helpfulness": "0/0", "author": "Kathy Hawkins"}, {"rating": 5.0, "review": "This is the best device for your tv. Your able to have the ability to treat your tv like a smart tv without spending thousands of dollars. It's an awesome investment!", "verified": false, "helpfulness": "0/0", "author": "Dario"}]