[{"rating": 4.0, "review": "Pro: Simple and works well. Con: The only free streaming video app right now is from Youtube. I hope this limitation is overcome soon.", "verified": true, "helpfulness": "0/0", "author": "mrmoto"}, {"rating": 4.0, "review": "The product works as promised but I wish it support more apps or allow you to stream everything on your PC as extended monitor, but works perfect with YouTube and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Samibrix"}, {"rating": 4.0, "review": "I really like this little dongle. I got this as soon as it came out so it was a no brainer with 3 months free netflix. I was gonna renew my xbox live gold, which i only  use for Netflix now, but this was a better deal. I have mainly used this with netflix and it works great with my iphone. I have also used my laptop and chrome browser to stream some shows that my dvr skipped. Playback isn't as smooth that way due to limitation of my laptop and wifi connection but it was in HD and definitely watchable. I'm looking forward to more apps as it seems a lot of stuff is in development. I think this is a way better deal than a roku or apple tv. The other thing is this is so portable from one tv to another in my house.", "verified": true, "helpfulness": "0/0", "author": "John Coltrane"}, {"rating": 4.0, "review": "Does what it says, was not as straightforward for setting up as it's so simple.  But once I figured it out it works as described.  Due to the wireless nature of the connection it can be laggy.", "verified": true, "helpfulness": "0/0", "author": "Dorothy"}, {"rating": 5.0, "review": "I love this little device, Its a breeze to set up and the quality of Video is incredible. For $35 its the best streaming device out there.", "verified": false, "helpfulness": "0/0", "author": "Selvas"}, {"rating": 3.0, "review": "Be Aware: Though the product description lists Google Chrome as one of the applications that you can 'cast' to the TV, this only works with Chrome on non-Android devices!  You will not be able to cast your CHROME sessions from any Android device. A big disappointment for me, especially since the name implies that you can cast CHROME browser sessions with no restrictions. Google is aware of this and is supposedly working on an Android Chrome version that will be compatible.  Other than that, Pandora, You Tube, Netflix and Movies worked nicely.  So I will keep the device for that purpose.", "verified": true, "helpfulness": "0/0", "author": "Jon"}, {"rating": 2.0, "review": "Very laggy even with computer within 6 feet of device.  Bought this to play home videos that are on my computer on the big screen tv.  That functionality has been disabled so device doesn't work for that purpose.  Even playing videos from youtube was very choppy and rendered device unusable.  Returned!", "verified": true, "helpfulness": "0/0", "author": "shyvoyeur"}, {"rating": 5.0, "review": "I'm having trouble getting sound from the TV to the stereo but that's not Chromecast's fault.  I love casing a tab from Chrome, going full screen and alt-tabing back to my browser to continue surfing the web with no hard to read in the dark remote to deal with.", "verified": true, "helpfulness": "0/0", "author": "Staylorme"}, {"rating": 5.0, "review": "I bought this for one thing only, the ability to mirror the page i was browsing on my laptop to my tv. That feature was introduced as a beta feature but it worked great for my needs. Whenever I saw a webpage that I had to share I would just cast it on the screen. If its a youtube video it often will use the native youtube player instead of casting the page (although sometimes it casts the page playing the youtube video). It even worked for watcing hulu on my tv. However this feature is heavily dependant on how powerfull your computer is that is casting. So for example when I use the chromebook to cast hulu, it is laggy and jumps and you cannot watch anything. When I use my laptop with 6gb ram, quad core processor and an ssd installed I can stream hulu...however even on that I have to make sure that no other app is running in the background.I power it from the service usb port on my tv and do not need to plug it into an outlet.They are adding more apps to the list (like i heard hbo go is on it now..and I really want an amazon vod app for it) so it can on ly get better.I didnt really need the netflix app since everything nowadays comes with netflix on it (ps3, xbox, bluray players, google tv boxes, roku, smart tvs and more). Pretty much everything has netflix on it so that was just there...Im gussing next gen toasters will come with netflix on them so you can watcha  show while your toast is being made.I bought this when it first came out so I got the 3 months free netflix (worth 24 dollars) making this a great device for 11 bucks but I would even buy this at 35. It is worth it for streaming all sorts of things.", "verified": true, "helpfulness": "2/2", "author": "Amazon.Buyer \"Never argue with an 1d10t...they will drag you to their level and beat you with experience!\""}, {"rating": 4.0, "review": "Would have helped if the instructions were more clear. Required more technical expertise than this 77 yr. old man has.Forced to request assistance from my son who is an SE at IBM. Took us about 40 minutes over the phone. Otherwise worksgreat once you get past the installation.", "verified": true, "helpfulness": "0/0", "author": "Walter Thyer"}]