[{"rating": 5.0, "review": "Product works great, I bought 3; One for parents and on For each of my brothers. Only issue was one of my brothers left it out of case and stepped on it, and now it doesn't work, so be careful to always put it in a safe place.", "verified": true, "helpfulness": "0/0", "author": "William Stanton"}, {"rating": 5.0, "review": "Amazing device! Works great. Streams to your television perfectly. My son loves it. Streams YouTube right to the television. Highly recommend it", "verified": true, "helpfulness": "0/0", "author": "Craig L Kirsner"}, {"rating": 5.0, "review": "I love it can't get enough of it, its like being at the movies in the privacy of your own home I recommend everybody should give it a try", "verified": true, "helpfulness": "0/0", "author": "dondre monk \"MR.DONDRE MONK\""}, {"rating": 5.0, "review": "I can use my cell phone to control my TV. This was a marvelous invention. I just hope they come up with more apps....I use it almost everyday for Netflix and Pandora.", "verified": true, "helpfulness": "0/0", "author": "James C."}, {"rating": 5.0, "review": "I loved the fact that i could see everything on my tv even tho i couldn't do it with apple tv.", "verified": true, "helpfulness": "0/0", "author": "Majid Shojaei"}, {"rating": 3.0, "review": "Interesting new piece of technology. It's nice, but Google needs to work on the software a bit and maybe add some more TV channels. Other products like the Roku hdmi stick are now coming into the market trying to compete with the Chromecast. The full screen live stream is very glitchy for me. I only see a part of what the full screen should be on my TV screen if I was to stream the full screen of my laptop's screen onto the TV. I have no updated Chromecast yet, however, looking into it, a lot of people didn't know that there were even updates for the Chromecast and others are saying that it updates itself. If it does update itself, then there really have not been any changes. If it doesn't update itself, then Chromecast needs to let it's customers know when there are updates. Other than these things, I like the fact that you can stream things to your TV without wires, however, there is a bit of a small lag time.", "verified": true, "helpfulness": "0/0", "author": "Albert"}, {"rating": 2.0, "review": "I already have a ROKU but was unable to receive YouTube. I had hopes this chromecast gadget would offer a more seamless experience.It was only OK. I found the Chromecast worked best with my mobile phone than with my PC chrome browser. Using the chrome browser,the video stopped and started and never really did flow. Using the mobile phones,Chromecast worked like a charm.", "verified": true, "helpfulness": "0/0", "author": "James C MacKinon"}, {"rating": 3.0, "review": "Chromecast is just OK, it gets the job done. I have a hard time \"Switching Controllers\" and have to reboot the device frequently. I guess that's what you get for a $35 streaming device. It's good enough for the price.", "verified": true, "helpfulness": "0/0", "author": "Androvich \"N. Andrews\""}, {"rating": 2.0, "review": "I purchased this product as a fun device to my 2nd tv because it was really cheap (~$25). I received this product today and was really excited about it. The product wins in the packaging and installing department! it was really easy and fun to set it up (less than 3 mins) however performance wise this device has some issues. First of all this device is really slow and Lags all the time (internet speed ~ 40mps) no matter what app you are using (Netflix, HBO). You need to give it so much time to buffer videos from your applications and that ruined my whole experience with it. I had higher expectation from google and going to return this product ASAP. If I were you I would save my money and buy a either a roku 3 or an apple tv (own both of them and very pleased with their performance).", "verified": true, "helpfulness": "2/2", "author": "V. Saeidi \"sean\""}, {"rating": 5.0, "review": "This is how I like to get things to my TV! We've had a roku for a couple of years and prefer this because of the user experience and interaction", "verified": true, "helpfulness": "0/0", "author": "A. Loudenback"}]