[{"rating": 5.0, "review": "This is an amazing little device. It does not have any where near the range of channels that a Roku device offers, but it works very well with Netflix, which is our primary channel for movies. With Chromecast, there is no disruption of either the video or audio in a movie. It's so easy to use that it could be taken on trips to use in motels and hotels.", "verified": true, "helpfulness": "0/0", "author": "BGFalcon \"book falcon\""}, {"rating": 4.0, "review": "Its a good for 35$ and youtube and other app casts are fine without any playback issues. But streaming from browser - if you have a older system - casting has issues with playback,buffering and if its a HD video.", "verified": true, "helpfulness": "0/0", "author": "Raja"}, {"rating": 5.0, "review": "Google Chrome is an awesome add to our tecky family. We love watching netflicks, YouTube, and listening to music on our TV.", "verified": true, "helpfulness": "0/0", "author": "D. Benz"}, {"rating": 3.0, "review": "My Chromecast worked for an hour after setup, then mysteriously disappeared from both my phone and laptop. It was clearly still on the network because the music continued to play, but I could no longer control it. It would reappear after going through the reset process, then again disappear. After much fruitless searching, I wrote Chromecast and learned they only support HDCP devices. I discovered this is a copy protection protocol, but NOWHERE do they mention this requirement. Apparently my TV and Bose home entertainment system predate this development, so I am returning my Christmas gift after needless hours of frustration.", "verified": false, "helpfulness": "1/1", "author": "Paul Sperry"}, {"rating": 4.0, "review": "So far no issues. If it would have worked for all applications other than Google products that could have been great", "verified": true, "helpfulness": "1/1", "author": "G. PALADI \"Java Lover\""}, {"rating": 5.0, "review": "I bought it so I could stop using my Computer as a netflix streaming device.  This works great as a streaming device for netflix as well as Pandora for when she is taking her sweet time getting ready.... But that's neither here nor their, it works.  sometimes it's a little touchy with my tablet, but restarting the application seems to be working pretty consistently to correct any errors.", "verified": true, "helpfulness": "0/0", "author": "JP"}, {"rating": 5.0, "review": "This was the best $30 I have spent in a while! The image is amazing, and there is no delay", "verified": true, "helpfulness": "0/0", "author": "Marco Caparrotta"}, {"rating": 5.0, "review": "After purchasing my first one the same day it was released I was a little disappointed in the number of supported apps. After a few months owning one, I ordered another one for my bedroom.  I find that the most important content that I watch is supported (Youtube, Netflix, Hulu) and new apps/content is being added regularly.  This platform has a ton of potential.I really enjoy the interface of this device.  Since I am normally using my phone or tablet while watching TV, this makes a perfect extension of that experience.  This is one of the few ways to broadcast Youtube content on my TV and it does it well.The one improvement I would like to see if the ability to stream content stored on your device to your TV (your videos and pictures you captured on your phone/tablet's camera).", "verified": true, "helpfulness": "2/3", "author": "Dan P."}, {"rating": 5.0, "review": "Best $35 I have spent in a long time.  I am not techy and I installed it and maintain it with ease.", "verified": true, "helpfulness": "0/0", "author": "Gift giver"}, {"rating": 5.0, "review": "it was a present but he used it all Christmas day.  Lived up to its expectations.probably get one for me", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]