[{"rating": 3.0, "review": "Very powerful and intuitive. But it's really, really geared towards Prime and Instant video. Easy to find stuff there, not anywhere else", "verified": true, "helpfulness": "1/1", "author": "John"}, {"rating": 5.0, "review": "There's some definite dark patterns around trying to get you to make purchases, but what do you expect. The UI gets out of the way, the game controller is solid, and the content library is good.", "verified": true, "helpfulness": "0/1", "author": "RandomOutput \"Scifi Junkie\""}, {"rating": 4.0, "review": "I have used Apple TV and ROKU…I was hoping Amazon would be a leap forward, but it is not for me.My biggest complaint is the ability to fast forward in a video or movie…Amazon TV locks when trying to move ahead more than a minute or two and needs a restart.  The other two do keep up with fast forward.I would also like to see an App for AcornTV --- which ROKU has.The Voice search is really a great feature.I still finding myself using Apple TV the most.", "verified": true, "helpfulness": "1/1", "author": "hkedie"}, {"rating": 4.0, "review": "Previous to getting the Amazon Fire TV, I have used a blueray player to access Amazon Prime and other premium channels. It works just fine that way. The Fire TV does the same thing, but faster, with fewer steps. It works really well, the video is very crisp and clear, and there is an extra added bonus of beautiful outdoor scenes that come on as screen saver.It's easy to set up, following the minimal instructions. You will need an HDMI cable if you don't already have one, since the Fire TV doesn't come with one.Once I contacted Mayday for help, it was easy to mirror the screen from my Kindle HDX through the Fire TV to my HDTV. I was hoping that I could do that without a wifi internet connection, but this is not the device for that. To make use of the Fire TV, you must have internet.My main disappointment was that I couldn't get to my music in Amazon's Cloud. I have heard that there will be an update soon to address this, and I will look forward to that.", "verified": true, "helpfulness": "1/2", "author": "LN \"LN\""}, {"rating": 4.0, "review": "I only have been using Fire TV for a week and am not an avid TV watcher.  I use an antenna plus streaming for my TV viewing.  Fire TV has proven to provide a lot of power for the price.  I've used Smart TV, Blue player, Roku box, and Chromecast for streaming in the past and the Fire TV is equal to or superior to any of these in terms of streamed picture quality.  If you have added a component to a wireless net work in the past set up is straight forward.  The voice search feature worked smoothly and is very well integrated with Amazon Prime.  So why only 4 stars?  The search function gives results for Amazon Prime and Hulu catalogs. Both free and pay to view selections are displayed.  The NetFlix catalog is not included in the voice search results.  This could lead to someone paying for a selection that may have been free with one's NetFliix selection, so a separate text search using the NetFlix app is required to make sure. To be fair, I've read post that Amazon is working on including the NetFlix catalog in the voice search results.  I'm not a gamer, but the selection and quality of the games provide doesn't seem to be all that great.  Definitely don't buy thinking this is substitute for a dedicated gaming console.  Finally in my limited time using, I've had the Five TV box freeze up while browsing.the NetFlix catalog.  A simple power cycling of the Fire TV box reinitialized things and the box appeared to operated okay afterwards.  I'm not sure if the box has a problem or the NetFlix app.", "verified": true, "helpfulness": "0/0", "author": "Eric R. McFarland"}, {"rating": 5.0, "review": "Excellent product. Loved the voice recognition. It makes it easy to search for movies or tv show. I would recommend it to all my friends.", "verified": true, "helpfulness": "0/0", "author": "DIMITRI G Petersonch"}, {"rating": 3.0, "review": "Thinking that Amazon would approach the streaming TV / Video market with the same disruptive panache as when they introduced the first Kindle - light years ahead of the competition - and when they first introduced \"Prime\"  I jumped early and bought the Amazon Fire TV unit. It simply is not a very good product in its current incarnation.  Klunky search capacity is quite limited, voice search is neat but I'd rather have a substantive search across all available platforms than the IntraMural search that lands you at the feet of Amazon Sales, rather than a free source for the same video (Netflix, etc).  The apps are extremely limited and if you are an NFL or MLB fan...forget about it. Nothing other than \"MLB at bat\" which i can use on my IPhone with less hassle and why would I sit and watch it on the big screen? MLB TV is an alleged promised carrot but why wasn't it available at launch? For a group that did their other disruptive forays quite well - this is a miss (as it stands). Makes one wonder why they rushed to market. Roku is broader and better. Fire TV may never catch up at this pace.  I wouldn't spend the money again until they proved they'd actually put together that unique market disrupting package that their loyal sycophants deserve for $99.", "verified": true, "helpfulness": "2/3", "author": "Edward G. Roche \"Vulcanrider\""}, {"rating": 3.0, "review": "We had a Chromecast and liked it EXCEPT for the poor connectivity with our WiFi system and clumsy controls So, we grabbed the Amazon Fire when it hit the market. The good news is that it has much better connectivity and the system is super easy to use. The speech recognition is pretty cool if you are in a quiet room. It has all the movies we could want and you can use HULU and REDBOX if you need MORE movies.Where the Fire falls short compared to the Chromecast is in streaming ANY website... We like CBS, NBC and the odd cooking site but we can't stream The Blacklist, Elementary, or Person of Interest or some other shows that aren't on the Amazon site.Friends have Apple TV and ROKU. priced about the same as Fire but not nearly as cool as AMAZON PRIME.We sure wish we had a web browser option.So, Overall, We like it...", "verified": true, "helpfulness": "0/0", "author": "Carl"}, {"rating": 5.0, "review": "I've been looking for something to replace our old Logitech Revue that was orphaned by Google and Logitech and this Fire TV exceeds what I expected by a long shot! Setup was absolutely dead-simple: I plugged it in to our Yamaha receiver and powered it up. The Fire TV found our wi-fi network in a flash and immediately downloaded the update. Total time to get it going was about 15 minutes, including putting batteries in the remote. The remote is the best and most intuitive I've ever used. I tried the voice search for an Amazon video and I couldn't believe how quickly it found exactly what I said. It's like magic! Navigation on the home screen is a breeze.Basically we watch Amazon Instant Video and YouTube and listen to Pandora radio. I downloaded the YouTube app (free) and set up our accounts with no problem at all.So far I'm extremely impressed with the whole FireTv experience. It's incredibly fast and easy to use.I'll update this review after I play around with it this weekend. Anybody looking for a used Logitech Revue? ;-)Sam", "verified": true, "helpfulness": "0/1", "author": "SamIam"}, {"rating": 2.0, "review": "Good hardware, but the software and apps are not there yet. It is faster than the Roku 3, but the Roku 3 wasn't slow in the first place except when navigating their new Netflix app. The only two things I like better about the fire tv vs the Roku 3 is the Netflix app and the remote control. I wish Roku would adopt the netflix app that is on the fire tv, or at least go back to the one they had before they thought it needed updating. Also, I really do like the prime streaming service, the free content is nearly as good as netflix. But alot of the free stuff is in HD with no option to stream at lesser quality in order to save bandwidth. I, like many, don't have unlimited internet access.", "verified": true, "helpfulness": "3/10", "author": "Warren"}]