[{"rating": 1.0, "review": "You cannot stream YouTube live content from your tablet.  I had to use a desktop which you cannot see your mouse to control easily.If I could mirror my Android tablet or PC full screen that would help.I'm better off with an hdmi cable.  Google has had a long time to add more basic features and is too slow to make this product better.I might try a Roku to see what it can live stream.", "verified": true, "helpfulness": "0/0", "author": "Rodney"}, {"rating": 1.0, "review": "This device didn't work with my tablet or my phone. It always said that it could not establish a connection I sold it and got roku.", "verified": true, "helpfulness": "0/1", "author": "Steven woolley"}, {"rating": 5.0, "review": "I already knew what I was purchasing, but now that more and more apps are coming with the Chromecast SDK this device is a must have for every TV you own.", "verified": true, "helpfulness": "0/0", "author": "carlos v."}, {"rating": 5.0, "review": "Works great in the Family room with my wifi on the other end of the house.  Love the music with Pandora, love the movies with Netflix and love watching You-Tube.  For a small device it provides a lot of entertainment value.", "verified": true, "helpfulness": "0/0", "author": "S. Summerlin"}, {"rating": 5.0, "review": "I totally love this device. You don't need an expensive smart television or a xbox to enjoy movies. This device allows me to watch Netflix and YouTube on my tv. It's very easy to set up. All you is a good wifi signal.  ( it works well with Visio )", "verified": true, "helpfulness": "0/1", "author": "Joshua Umrani"}, {"rating": 4.0, "review": "It every good at what it does for the price . I have 2 of them and they work fine just sometime they can not fined the wifi if you go to googles suport page a list of wifi routers that it works with but mine still work even if it is not a suported it just can not fined the wifi sometimes", "verified": true, "helpfulness": "0/0", "author": "Michael Echeverria Jr"}, {"rating": 1.0, "review": "This little gadget sounds good on paper. Never could get it to work and finally threw it out. Very frustrating. Thank goodness it was cheap.", "verified": true, "helpfulness": "0/2", "author": "linda stroope"}, {"rating": 3.0, "review": "I chose the Chromecast because I wanted better quality for my Netflix streaming movie viewing.  The picture quality improvement was quite dramatic as compared to my old method of streaming using my Wii console.  I like the fact that the Chromecast is controlled by either a web browser, iPhone or iPad.  The downside is that quite often the controlling device will lose communication with the Chromecast, meaning that I lose the ability to rewind, pause or stop a movie.  This happens at least 50% of the time.  I can usually figure out a roundabout way to regain control, but that's a clumsy way to do things.  Hopefully these problems will iron out over time as the software gets improved.", "verified": true, "helpfulness": "0/0", "author": "bikerjff"}, {"rating": 5.0, "review": "now I have a Smart TV, I do not need Extra features, i only need Netflix, Youtube & Plex.Great!!!", "verified": true, "helpfulness": "0/0", "author": "Luis Mendoza Jr"}, {"rating": 4.0, "review": "First device I have purchased.  While single minded it is the simplicity that makes it enjoyable.I also have ROKU and now the new Kindle Fire TV. With only a single available HDMI I also havepurchased a 'switch' (not yet installed) which is to give me the ability to use it to integrate my devicesso I can pick and choose what app's I want to use, that day.", "verified": true, "helpfulness": "0/0", "author": "Brenda"}]