[{"rating": 5.0, "review": "Chromecast is amazing. It does way more than I expected. It works amazingly with Netflix and Youtube, and I can carry it with me to watch my content anywhere there's a WiFi connection available. You can hook it up to the TV and do a video party, as anyone with a smartphone can remote control the thing. When MLB adds native support to its At Bat app this is going to be the perfect purchase. For 30 bucks it's a no-brainer. Get it now!", "verified": true, "helpfulness": "0/0", "author": "Tiago Rosa"}, {"rating": 5.0, "review": "I got this for my husband. It is pretty cool! I can play a movie from my computer on the tv and I can still work on other projects at the same time. I mainly use it to play music from my phone onto the tv screen though my husband uses it to play youtubs from his computer on the tv. I am sure there are other features but I don't know much about technology. My husband just set it up on my phone and told me what buttons to push, so even a tech dummy can use it. Super simple to set up and use!", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Seems silly to call the add-on capability of it as adding apps because it's nothing like a cell phone or any other handheld device.  It stays attached to the back/side of your tv and you should be able to place it in such a place as to not see it.  The connected light is really bright but now that it's behind the tv it's no longer annoying.  If your TV comes with HDMI and USB you don't need to use the power adapter (it took us a bit to figure that out) but now there are no cords hanging down from the back of the TV.  We don't even have a DVD player attached to it any longer.  Between HBO GO, YouTube, and Netflix, we're set.  Now, can't wait for AMAZON PRIME video service to be added... hint hint, nudge nudge Amazon ... go make friends...  We don't use Pandora on it or Hulu but you can.", "verified": true, "helpfulness": "0/0", "author": "Penny Borden"}, {"rating": 5.0, "review": "It displays a tab from a chrome web browser on a locally connected computer to your TV screen.  It's like a wireless HDMI cable, but cheaper and more convenient and interesting than an HDMI cable.  I'm glad I have it.", "verified": true, "helpfulness": "0/0", "author": "Grant Barker \"grant7bar7\""}, {"rating": 5.0, "review": "More often than not we are all hovering over the same youtube video or two passing a phone or ipad around to view it.This is a way for everyone to share and stream video easily.", "verified": true, "helpfulness": "0/0", "author": "Grace S Cunningham"}, {"rating": 1.0, "review": "The first two weeks i was quite happy with the chromecast. However; after the last two software updates netflix stopped working. I am able to start watching for like 1 minute then it stops. The main reason i got chromecast int he first place was to watch netflix in a \"dumb\". It is unacceptable that Google has now acknowledge the issue. There are several other users experiencing the same problem in the latest firmware of the chromecast.If you are buying the chromecast to only use youtube, then go for it. If you like to stream from netflix then I recommend you look for an alternative until Google fixes the software errors.I am a soft dev and it should be pretty easy to rollback the update to a working version.", "verified": false, "helpfulness": "0/0", "author": "Nestor Martinez"}, {"rating": 1.0, "review": "Title says it all.....I experience tons of lag when casting from the Chrome browserThe Apple products we own (Ipad and Iphones 4 and 5) cannot find itLimited appsShocked that this is a google product", "verified": true, "helpfulness": "0/1", "author": "JL"}, {"rating": 5.0, "review": "Having a Chromecast is awesome. It does not do everything, but everything that it does do, it does extremely well.", "verified": true, "helpfulness": "0/0", "author": "rrosenblum"}, {"rating": 5.0, "review": "Fast shipping! I'm so glad I bought this!!! Everything is so much easier!! I'll definitely recommend this to my family and friends!", "verified": true, "helpfulness": "0/0", "author": "Alejandra"}, {"rating": 5.0, "review": "I use this thing all the time! If you are just looking to watch Netflix, Youtbe, or Hulu then this thing is for you. Not to mention it is still in beta testing. I am expecting big things out of this little device in the future.", "verified": true, "helpfulness": "0/0", "author": "Bryce"}]