[{"rating": 4.0, "review": "Works pretty well. Other devices want to connect to it instead of my wireless router so I usually unplug it when not using. That's my only complaint. I have a ROKU too but don't use it any more. I'm sure the next generation stuff like this will be out soon but for now it's cool technology.", "verified": true, "helpfulness": "0/0", "author": "Ray Montondo"}, {"rating": 4.0, "review": "Love these little gadgets. This is my second one (for my bedroom). I just love these. They are easy to use and easy to set up. I would like more flexibility in the apps and I think it's overpriced for what you can use it for but overall it's a cool gadget.", "verified": true, "helpfulness": "0/0", "author": "A. Summers \"SexxSeaBlonde\""}, {"rating": 4.0, "review": "Works great with android devices and am able to cast Chrome browser on Windows 8 machine.  Wish I could cast everything on Windows 8, but for the price it's well worth it.", "verified": true, "helpfulness": "0/0", "author": "Tri V. Tran"}, {"rating": 4.0, "review": "This is great only missing a star because it will freeze from time to time not to unexpected but it's a little more frequent then I would expect", "verified": true, "helpfulness": "0/0", "author": "LEPRECHAUN"}, {"rating": 2.0, "review": "You are better off getting a more versatile device like Roku.", "verified": true, "helpfulness": "0/0", "author": "KayBee"}, {"rating": 5.0, "review": "Absolutely love this, just what I needed and easy since I have a 7\" tablet", "verified": true, "helpfulness": "0/0", "author": "Paulette \"Poppy\""}, {"rating": 5.0, "review": "So far 6 days haven't stopped using it apps make this device the best guest sharing is great", "verified": true, "helpfulness": "0/0", "author": "william hester"}, {"rating": 4.0, "review": "Works perfect.", "verified": true, "helpfulness": "0/0", "author": "Special K"}, {"rating": 5.0, "review": "Love watching. Netflix on my tv! ABC app also works with it. Not computer savvy but I was able to set it up by myself!", "verified": true, "helpfulness": "1/1", "author": "Sharon Tanner"}, {"rating": 5.0, "review": "Love It", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]