[{"rating": 5.0, "review": "One of the best things I have bought from Amazon", "verified": true, "helpfulness": "0/0", "author": "Robert Allen"}, {"rating": 5.0, "review": "love these", "verified": true, "helpfulness": "0/0", "author": "Paula Soholt"}, {"rating": 4.0, "review": "I like the voice command feature. I wish the had more movies that you don't have to buy or rent. I don't want to waste money on renting or buying movies I end up not liking.", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 5.0, "review": "This box is a lifesaver! We save so much money watching our shows and movies here instead of having cable.", "verified": true, "helpfulness": "0/0", "author": "SamanthaCuhel"}, {"rating": 5.0, "review": "Love the voice command feature!  Unit is small enough to 'hide' in any TV mounting configuration and the use of the HDMI and fiber optic audio cables makes a neat looking package.  The self-contained how to use tutorial is about all that is needed to watch your first movie.  Enjoy!", "verified": true, "helpfulness": "0/0", "author": "Larry L. Willits"}, {"rating": 5.0, "review": "I got it on time, it takes a little to get used to all thethings on it you can do. I would say they did a good joband with the prime lots of good moview to see", "verified": true, "helpfulness": "0/0", "author": "Leslie A Marsh"}, {"rating": 5.0, "review": "Easy to use", "verified": true, "helpfulness": "0/0", "author": "khalid razzaq"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "Patricia Herring"}, {"rating": 4.0, "review": "Pretty good, but wish more things were prime, esp old and current movies, etc.", "verified": true, "helpfulness": "0/0", "author": "Oaklander \"oakland CA\""}, {"rating": 5.0, "review": "Fantastic gadget.  Sure beats trying to wait till you can get a DVD from Redbox, and for those movies that you have to pay for, it is consistently less than from other sources.  Also, you can find almost any music that you want with it.  Highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Garleeque"}]