[{"rating": 1.0, "review": "Arrived DOA, doesn't get past black screen with white Amazon logo. Maybe the next will be better. I will update then.", "verified": true, "helpfulness": "1/4", "author": "dsjr2006"}, {"rating": 5.0, "review": "i love my amazon fire tv .it has changed how my wife and watch tv.i love shopping at amazon.thank you for the great service.", "verified": true, "helpfulness": "0/0", "author": "james lawton"}, {"rating": 4.0, "review": "I've been using the amazon fire TV for about a month now. It works great, has a huge number of apps to add functionality and is just all around a great device. I had the chromecast before I got this and I'm extremely happy I switched. I only have one gripe about this product and it's the reason I took off a star. There is a USB port on the back of the box that does absolutely nothing! I mean really amazon? You obviously put it there for a reason, and I for one would love to be able to plug a flash drive or external hard drive in to watch my movies. There's plenty of apps that allow you to stream from a server or nas box or even your desktop, but that kind of defeats the purpose when you have to set up multiple devices to work together just to watch your own digital media. That is my one and only complaint, if they updated the software to support external usb storage this would definitely be a five star product.", "verified": true, "helpfulness": "1/1", "author": "Sean Ward"}, {"rating": 5.0, "review": "Good buy", "verified": true, "helpfulness": "0/0", "author": "Gordon H. Johnson"}, {"rating": 4.0, "review": "Well from what I have read this product is very good ,Now that said Im not a customer of this device yet ( Amazon fire TV )  but Im a amazon prime customer. And instead of a review, I have several questions regarding this item . I'm a customer of dish network. Now do I need to unsubscribe from their service , do I need to keep my internet service with them to use this device, do this device (amazon fire tv ) replace the service that I have now with dish network  you see like other customers I'm not tech savvy on certain things and Im to tell you the truth a bit confuse my self I like certain channels more than others and with dish network well just you just have to paid for another upgrade wich in the long run you end up paying and arm and a leg well I hope that somebody help me with this dilemma cause Im considering on getting one ( Amazon fire TV ).", "verified": false, "helpfulness": "0/4", "author": "Ramon B. Maldonado Rosas"}, {"rating": 5.0, "review": "Received Amazon Fire TV as a Christmas gift, otherwise I had given no thought to such device.  I was able to stream similar content through my Wii gaming system.  The Wii continues to provide the services, but the operation of Fire TV is much more fluid from \"binge watching\" TV series and series made specifically for the streaming systems.  The recommendations are more accurate and in tune with my watching preferences.  The device is easier to search by categories, but similar to the Wii when searching by name.  It still requires subscriptions, but once have one, it applies to all accessible devices.  It turns off automatically and much sooner than the Wii even goes to standby mode.  I consider it a great gift and asset to my home viewing media of old and new.  This review pertains to the thin, square box device, not the plug-in device.  It truly is enhanced HDTV addition.", "verified": true, "helpfulness": "1/1", "author": "Lily Morgan \"Best regards, Lily\""}, {"rating": 4.0, "review": "The sound and picture are very good.  The interface is easy to navigate and there are a lot of fun applications to choose from.", "verified": true, "helpfulness": "0/0", "author": "Daiban"}, {"rating": 5.0, "review": "One thought only:  the best the world has to offer.  Access to hundreds of APPS, Netflix, HULU, 40000 movies, games, cloud storage, 800 radio stations, countless number of songs, you name it.  Beginning of the end for cable - DirecTV, HughesNet, XFinity, Comcast, again, you name it.  Best to become an Amazon Prime Member to take maximum advantage of this unit's capabilities.  Prime cost:  $99/year.  The unit itself now promo'd at $84 instead of the usual $99.  The only downside:  you could spend way to much time watching this thing.", "verified": true, "helpfulness": "3/3", "author": "Batman \"Bruce Wayne\""}, {"rating": 5.0, "review": "Item arrived promptly and as described.", "verified": true, "helpfulness": "0/0", "author": "Bill Kirchner"}, {"rating": 5.0, "review": "Of the several devices to add streaming movies to your repertoire, this is the best hardware available. Faster, more memory, excellent video streaming. Only fault is that the apps are limited to the major applications -- Amazon, Netflix, Hulu. Still, an outstanding way to view TV and movies.", "verified": true, "helpfulness": "1/1", "author": "Randal 6393 \"The Old Guy\""}]