[{"rating": 4.0, "review": "Works exactly as advertised, the problem here is not the product but the apps that the product relies on. The Netflix app is far from perfect and you can only use the product with existing apps. This product does not mirror your computer, it will play apps for which you have an account like netflix or hulu. I'm thinking that perhaps a Roku box would have been wiser.", "verified": true, "helpfulness": "0/0", "author": "Primo Lasana \"Otha Fish\""}, {"rating": 4.0, "review": "I love that when I connect it directs me to the app store and when I try to download, \"Currently this product is unavailable for your ....blah, blah.Don't get me wrong, I like the Chromecast but why can't someone come up with a product that Apple TV, Roku and Chromecast does in one package, I'm willing to pay for it if its a little pricier.", "verified": true, "helpfulness": "0/0", "author": "Van Payne"}, {"rating": 1.0, "review": "I received a brand new Google Chromecast and it worked wonderfully as I watched \"House of Cards\". I finished the series, forgot about it for 3 weeks and then tried to connect to a different series.  Dead--can't connect.  Tried it on 2 other TV's to ascertain that it was not the fault of the original TV , but it wouldn't connect.  Googled, youtubed solutions but nothing helped.  I tried today to return it and discovered I'm 2 days over the 30 day limit for returns :/  Usually I'm happy with Amazon, but not so much today.", "verified": true, "helpfulness": "0/1", "author": "KC"}, {"rating": 1.0, "review": "I bought this thinking that it would be a platform for new applications and access to many services (e.g. Amazon Prime). Unfortunately, I realized that the development for Chromecast is completely stagnant. For example, after over a year there is no support for Amazon Prime that thousands of people have requested and are anxiously waiting for. The only way to use Amazon Prime is via tab which is sub par. I decided to disconnect from my TV, as we just used it for the first few days. I would say it's a waste of money. Fortunately, it is just $35.", "verified": true, "helpfulness": "0/0", "author": "DS1111"}, {"rating": 1.0, "review": "Why couldn't it simply copy everything onto a TV from the screen?  Instead, one have to hit a \"cast\" icon that is not supported by every application. The only application I know of at this moment is Youtube.  Five minutes after installing it, it was stuck with \"error receiving data\".  Need to recycle power to get rid of the error.  If one has multiple devices capable of casting, it is important to properly connect and disconnect each device.  Urrrrrrg...... (It probably would be OK, if you setup only one device to cast data to the TV.)", "verified": true, "helpfulness": "0/0", "author": "Yu-Ping Cheng"}, {"rating": 5.0, "review": "I was a fan of the Nexus Q concept and kicked myself for not pre ordering it when I had the chance. I was happy to hear it when Google was redesigning the Nexus Q after bad initial impressions but had no idea that it would ultimately become the Chromecast.The Chromecast is very well built, very easy to setup and very easy to use. It's about as close to plug and play as one can get in this age. I use a lot of Google services and Netflix so my needs perfectly align with what the Chromecast is capable of. I stream Netflix, Google Movies and TV and Google Music to my HDTV. Google recommends plugging the device into a HDMI slot on your HDTV but I've found that it works fine plugged into a 7.1 surround sound Sony receiver. No great revelation really as the concept behind the Chromecast is pretty straight forward. But for those with killer audio setups going through receivers, subwoofers and such, know that the Chromecast will work through them. At least it worked with mine.Streaming has worked flawlessly for me with the exception of Google Movies and TV. At times I get a buffering loop on certain films which can be very annoying. I believe this has more to do with the movie service as there's a licensing error that appears from time to time after constant buffering. Netflix and Google Music have run flawlessly even after running for a full 24 hours.It's disgustingly good to the extent that my WiiU and PS3 look at me like scorned women because I don't need them to stream Netflix movies anymore or to play music (as the case with my PS3).The only true negative I've found is Chromecast doesn't stream everything available on Android or iOS. The selection of supported apps is limited at present. There are other streaming solutions that support more apps and features but I chose Chromecast for one reason and one reason only...official Google support. I know Chromecast will get dedicated Google support that 3rd parties will be hard pressed to match over the long term. The limitations of Chromecast is changing as Google has made available the APIs for developers to cast their apps.The day when Chromecast can stream games to your HDTV will be the day dedicated game consoles really start to lose their luster for many and Ouya becomes totally irrelevant.Final verdict....Buy it. Easy to set up, easy to use. Well built. The Nexus Q reborn. For $35 you can't beat it unless you already use Roku or AllCast.", "verified": true, "helpfulness": "0/0", "author": "Logain Ubiv Tnomal Ablar \"Striderhayasa\""}, {"rating": 2.0, "review": "You cant cast this from android devices, I cant believe it.No idea why, but android users have to ignore this item.", "verified": true, "helpfulness": "0/1", "author": "Satheesh"}, {"rating": 2.0, "review": "Totally worthless for my Toshiba tablet. Will not let me download the extension on my tablet so no way to get it broadcast from the tablet to the tv", "verified": true, "helpfulness": "0/0", "author": "Melissa N."}, {"rating": 1.0, "review": "I'm sure this is a great item, but I was unaware at it's functionality. This streamer works off of a phone or tablet and actually streams to the television. My lack of knowledge made me return it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this and expected this little guy to do exactly what it does.  It's not for everyone, but it's neat to be able to view your google content and other things on your tv...not bad for a $35 device!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]