[{"rating": 5.0, "review": "Great price, easy to setup & use, what's more to say? With more app support coming and the ability to share what you're watching to a larger screen, this is simply awesome!The only feature that I can't wait to see implemented is being able to stream your recordings to the device. (Don't know if this is possible or not, haven't looked into it yet)", "verified": true, "helpfulness": "0/0", "author": "justj03 \"It's all about making memories...\""}, {"rating": 5.0, "review": "Makes my life much easier!  I used to stream movies in my computer and watch them with my tiny screen but NO MORE :o)  Thanks Google ;o)", "verified": true, "helpfulness": "0/0", "author": "Henry Perez \"Mets Fan\""}, {"rating": 4.0, "review": "I am not ready to ditch cable, so this is a great option to watch Netflix and Hulu. I wish I could stream Amazon content.", "verified": true, "helpfulness": "0/0", "author": "ccbonjour"}, {"rating": 5.0, "review": "I have had my Chromecast for several weeks now. It performs very well and was very easy to setup. The only down side is it does not work with everything but that is not a fault of Chromecast but with apps not updated to support it yet.The Amazon Instant Video app doesn't work with it for instance. But then the Amazon Instant video also doesn't work with my Nexus 5, Nexus 7, or Galaxy Tab 2 so I see Amazon Instant Video not working with it as just one more negative against Amazon Instant Video and has no rating on the Chromecast rating.", "verified": false, "helpfulness": "1/1", "author": "Brooks Hagenow"}, {"rating": 5.0, "review": "Love this product, just wish there were more services that Chrome would offer, i.e casting ESPN, xfinity and so on", "verified": true, "helpfulness": "0/0", "author": "Jaskanwal Bisla"}, {"rating": 4.0, "review": "I been streaming movies and shows from Netflix since I bought this and work fantastic.Still trying to figure out how to stream from other location from Chrome.", "verified": true, "helpfulness": "0/0", "author": "kevin mccurley"}, {"rating": 5.0, "review": "easy to setup and install on multiple devises(nook, tablet, phones). great price for intended use at our home instead of cable.", "verified": true, "helpfulness": "0/0", "author": "Rianna"}, {"rating": 1.0, "review": "Terrible product. I have high speed internet and the video playback is still very choppy and starts and stops a lot.", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 3.0, "review": "It is a cool idea but it doesn't see much use in our house.  I ended up putting it on my 7 year olds TV because the streaming quality kind of sucks.  I stream from the internet to my tablet to this device, that is a lot of unnecessary latency.  I can get my Roku to stream HD no problem, this I have yet to stream with any kind of quality.", "verified": true, "helpfulness": "0/0", "author": "carpainter69"}, {"rating": 5.0, "review": "Very inexpensive way to stream Netflix, HBO to go, or YouTube videos to the television without having to upgrade my current LCD TV.  Setup was easy for me and has worked very well.", "verified": true, "helpfulness": "0/0", "author": "Mark O'Donal"}]