[{"rating": 5.0, "review": "I have had the Amazon Fire TV for about a year now, it was a gift - a gift that keeps on giving.  I really love this.  There are times, many unfortunately, that there is absolutely NOTHING on TV even with a few hundred stations on my cable.  Amazon Fire TV to the rescue.I can watch/re-watch movies, TV shows, and more just with the touch of a button.  Yes you could \"catch\" them on your cable \"on demand\" channel but that is only for a short period of time, here I can watch whenever I want.  Easy access to Netflix, HULU , Amazon Prime content or even playing games, and then back to your \"regularly scheduled program\" on your TV.Was super easy to set up and use - plug in, do the set up (with great walk through) sign into wi-fi then connect to your Amazon Prime Account and your done.  Yes, this is the best gift I've received for entertainment purposes.", "verified": true, "helpfulness": "2/3", "author": "Kat's Inspiration Corner"}, {"rating": 5.0, "review": "Love this!!!", "verified": true, "helpfulness": "0/1", "author": "christie5683"}, {"rating": 3.0, "review": "Not sure I really needed this, the stick might have been as good.", "verified": true, "helpfulness": "0/0", "author": "Stephen Redgrave"}, {"rating": 5.0, "review": "Great way to watch tons of movies and cartoons with the Grandchildren! Easy to hook up and use.", "verified": true, "helpfulness": "0/1", "author": "Ronda Densford \"Jacksonville FL Realtor\""}, {"rating": 5.0, "review": "Easy to install & ready to use, in minutes.  Just speak into the remote, to search for hundreds of movies or TV shows.", "verified": true, "helpfulness": "0/1", "author": "K. F. Boehme"}, {"rating": 5.0, "review": "With the somewhat notable exception of not being able to access Google Play content... Amazon Fire TV is easily the most powerful media streamer currently available... Especially for those fond of Amazon Prime content.", "verified": true, "helpfulness": "0/1", "author": "David A. Harvey \"The Music Man\""}, {"rating": 5.0, "review": "Easy to use, easy to install, user friendly.", "verified": true, "helpfulness": "0/1", "author": "Dan"}, {"rating": 4.0, "review": "Most of the features that come on this device work well.  However, I wish there was a way to control the volume directly on the remote.  It gets rather annoying having to use two remotes -- the television remote for volume control -- then the fire remote for the remainder.", "verified": true, "helpfulness": "0/1", "author": "James L."}, {"rating": 5.0, "review": "First I'm an old woman, and this Fire TV is so easy to hook up and use. No brainier people! I watch \"0\" TV at night because husband just watches sports. During the day I watch series that I would never get to see and I'm loving it.... Just push button and say the name of actor, director or movie title and there you go, it's right there all in info you need to play what you want to watch. Amazon is adding new shows and movies for free for prime members everyday. I highly highly recommend this product, no monthly fees either.....LOVE IT.", "verified": true, "helpfulness": "2/3", "author": "Diane W. Kryszczuk"}, {"rating": 5.0, "review": "Many apps, loads fast and plays without buffering. Works much better than my Sony Blue Ray player for Netflix and Prime videos.", "verified": true, "helpfulness": "0/1", "author": "Samuel Todd Courtney"}]