[{"rating": 5.0, "review": "Excellent product. Ease of use and available content is amazing the voice search is the best I have ever used.", "verified": true, "helpfulness": "1/1", "author": "Troy Calton"}, {"rating": 5.0, "review": "I use this thing just about everyday. It has convinced my family to switch from cable boxes. In fact, once our contract is up, my dad has told me that we're no longer going to do business with comcast. Which is no big deal, since with the Fire TV you have thousands of tv shows, and pay about as much for a few series you actually like as you do for thousands of channels you can't be bothered with.Things I've tried:- renting a couple movies.- buying a few movies (currently have the extended hobbit series thats out).- watching prime specific shows.- voice search works! (this is from someone who had to undergo years of speech therapy so that people could understand her).things i've encountered- sometimes the wifi messes up and you can't load. When it does, just forget the network and readd it. Doesn't happen very often for me, and i think it might be related specifically to the wifi.", "verified": true, "helpfulness": "2/2", "author": "Mary Greenman \"book lover, audio listener\""}, {"rating": 5.0, "review": "Works like a champ! Love the voice search for Amazon hosted movies!", "verified": true, "helpfulness": "1/1", "author": "Matthew Shipley"}, {"rating": 5.0, "review": "The best way to view programs movies and series without paying a high cable bill.  Should have bought this long time ago.", "verified": false, "helpfulness": "1/1", "author": "kathleen cox"}, {"rating": 1.0, "review": "Stoked as heck to unbox... Once all set up netflix update doesnt even work.... So netflix is out. Other apps wont even download. Ploy? Or is the fire tv just a crappy unit. Go for Roku is my suggestion. Later.", "verified": true, "helpfulness": "1/5", "author": "Mike D."}, {"rating": 5.0, "review": "Finally Cut The Cord! And I'm glad I selected Fire TV to make the switch. I'm not one to make rash decisions and I research the heck out of everything before I spend my money on anything. For me it was the right decision. With an Amazon Prime subscription for Christmas and adding Hulu Plus and Netflix. From opening the box to watching.. 10 minutes flat... AWESOME!It has 3x the processing power of the Roku or Apple TV. Quad-core processor, 2 GB of memory, and Dolby Digital Plus surround sound. The only issue I had was downloading the Netflix app. I went to help, clicked for a rep to call me back and 10 seconds later my phone rang. WOW! He instructed me to go to the settings menu and download the latest update. Soon as I did, bam... Netflix downloaded. And I must say kudos to tech support at Amazon. THANK YOU Matthew O. 5 Star service!This may help others:Next time you need to reboot fire tv.Step 1. Press and hold play/pause and select button ( in the middle of the circle ) For 5 seconds will reboot your device.1.  From the Home screen, select Settings.2.  Select System, and then select About. You will see the current Software Version.3.  Select Check for System Update to manually check for a software update. If an update is available, it will automatically start downloading.4.  After the download is complete, select Install System Update to install the update, or it will automatically install the next time your device is idle for 30 minutes or is rebooted.Menu's are easy to navigate and the voice search feature worked every single time without fail. It also has the best specs of any similar box out there. Best purchase I have made in awhile. I have a ton of content and will save over $900 a year. ADIOS AT&T;!!!!", "verified": true, "helpfulness": "2/2", "author": "LA Livin \"Rick\""}, {"rating": 5.0, "review": "The fire is perfect for games, videos and music all in one place at finger tip reach.  It gets better and better.  I like that the kindle fire works with it.", "verified": true, "helpfulness": "0/0", "author": "Dancing Oak"}, {"rating": 4.0, "review": "Nicely made product.  Several recent movies were not available yet through Amazon prime although they appeared to be available.  They can be purchased or watched for a price, though. Voice control only works for fire, none of the other services.", "verified": true, "helpfulness": "0/0", "author": "Yoshizawa \"paperfolder\""}, {"rating": 5.0, "review": "Big upgrade from a Roku 2. Better picture quality, no freeze-ups like the RoKu. Tiny little thing! Works with USB wireless keyboard and track pad combo well. I'll be side loading a web browser for additional usefulness.", "verified": true, "helpfulness": "1/1", "author": "Jeremy c"}, {"rating": 5.0, "review": "I love Fire tv. The voice search is amazing. It is a great way to watch with tv with my prime membership. It is also the easiest way to watch netflix.", "verified": true, "helpfulness": "0/0", "author": "AliciaK327"}]