[{"rating": 2.0, "review": "DONT LET IT AUTO UPDATE, IT BREAKS ROOT ABILITY! You are then stuck using only 5 or 6 apps and none of the local content on your device. I had hoped that I would at least be able to play my pictures and videos on my TV from my phone. So far I can only use google play movies, you tube, and hulu. You tube is the only free one in the bunch. There is a custom ROM out for it but if you let it update, you won't be able to take advantage of this.", "verified": true, "helpfulness": "0/0", "author": "steelew \"Wil\""}, {"rating": 3.0, "review": "\"Send video or anything on the Web to your TV from your smartphone, tablet, or laptop.\"Let's clarify this, shall we, since no \"fine print\" or disclaimer appears anywhere on the packaging:\"Send video or anything on the Web to your TV from your PC (via Chrome), or send a few selected apps (that you already have on your Smart TVs and/or Blu-Ray Players, as of 2011) to your TV from your Android tablet or smartphone. *Though we're 'working on it,' Chrome on Android does not currently support casting video from web pages, or web pages themselves.\"Does this help to clarify things?  Think people would still buy it?  I wouldn't have, given that the one and only reason I purchased it was to enable the viewing, on my 60\" television, via my S4, of web-based broadcast TV replays that aren't present in Netflix (e.g. last night's \"The Blacklist,\" via nbc.com).  \"Send video or anything on the Web to your TV from your smartphone, tablet, or laptop.\"  Hmmm.  No...that isn't actually the case.  I expect truth in advertising, and this is what appears to be a blatant statement of something that simply isn't true.  It may be the case that it *becomes* true...but as of today, 12/3/13, it is not, and thus, the box should not state it as present fact.  The sad reality is that, as of today, this device adds no value unless you're one of the few hundred people on the planet who can't already access Netflix, YouTube, and a couple other choice apps from either your TV directly or your Blu-Ray player...*unless* you have a relatively high-end PC on your wi-fi network (your netbook isn't going to cut it...trust me) *and* you cannot run a length of HDMI cable in your house/apartment.  Why \"and?\"  A weak CPU will send weak video..it's that simple.\"You should have researched it first.\"  No.  \"Send video or anything on the Web to your TV from your smartphone, tablet, or laptop.\"  This is a false statement.  You *cannot* send anything (at all...I mean nothing [excluding app-based content]) on the Web from your smartphone or tablet.  What am I missing, here?  Shame on Google.Don't get me wrong...for $35, for those who are vehemently opposed to simply spending $50 on a Blu-Ray player that includes the same apps, or those with powerful laptops and PCs on their networks who cannot run HDMI cables to their televisions for any reason (I can't think of one, minus different floors in a house, e.g...but then, how would you control your PC or laptop? :)), this device is perfectly fine.  Well, not really; even when transmitting from an app, am I getting the 1080p that I'd get using my Blu-Ray player's apps?  \"HD\" isn't good enough for me, given that said device's apps confirm specific resolutions.  Further, why would I want to use my PC to send video (using the worst browser under the stars--you guessed it--Chrome) at \"720p, high bit-rate,\" when I can simply send the same video via my PC's HDMI output at 1080/60p?  Why would I want to use an inferior device that doesn't add additional value?  I wouldn't.  I'm gifting it (to the only person in the world, to my knowledge, without a Blu-Ray player that has Netflix installed on it [as of 2013]...my grandmother). :)p.s. \"unknown\" is actually a ~5 mbps stream (on \"extreme,\" of course...) that is uploaded by the PC to your network, then downloaded and displayed by Chromecast (I measured and monitored speed with NetMeter).  It frequently stutters, and audio often loses sync with video, requiring reloading of the browser tab...and that's with a new wireless N 300 mpbs router.  If you still use an old wireless G router, it isn't likely that you'll be watching smooth \"720p extreme\" casts (the average G router maxes out at 13 mbps download and 2-3 up, despite whatever it claims to do).  Also, on \"extreme,\" audio is uploaded and output at 32 kHz (LPCM)...which means output frequency response is limited to 16 kHz.  All things considered, it's a far cry from using HDMI (1080/60p at 44-192 kHz, depending on your settings)...so I continue to recommend simply finding a way to use an HDMI cable, if at all possible, in place of casting browser tabs.  A 25-foot cable (which should be more than sufficient for most situations) can be had for $7: http://www.amazon.com/s/ref=nb_sb_noss_1?url=search-alias%3Daps&field-keywords;=25+hdmi", "verified": true, "helpfulness": "3/4", "author": "TheTruthHurts"}, {"rating": 5.0, "review": "I am very impressed with Google chromecast product and it has been very useful especially if you use your laptop more often.Thanks to Amazon for delivering before time.", "verified": true, "helpfulness": "0/1", "author": "RAMS"}, {"rating": 2.0, "review": "I mistakenly thought you could show the photos and videos on my laptop/smartphone/tablet based on the advertising.  No can do.  Too much trouble to load onto Chrome.  Not sure why you need this if you have a smart tv or wifi Blu-ray player.", "verified": false, "helpfulness": "2/3", "author": "zina28"}, {"rating": 5.0, "review": "This is the next big thing! The next big thing since iPhone! This changes the whole way we watch online videos. I received the Chromecast today and I am impressed! The setup was a breeze. Been testing with youtube, googleplay movies, and chrome browser for the last couple of hours and everything working as expected! Hopefully more app support and 1080p casting via browser will come in future. Highly recommended. Kudos to Google for making it so affordable. Every home should own one!", "verified": true, "helpfulness": "0/2", "author": "R. P."}, {"rating": 5.0, "review": "This little, relatively inexpensive, gadget is very simple to set up and work really well.  You just need an HDMI port, electricity, and wifi.  Once you plug it in, the directions appear on the screen.After you set it up on wifi and the upgrades are complete, you download the Google Chromecast extension to your Chrome browser.  Then you can \"cast\" any tab in your Chrome browser to the TV.  Certain apps like Netflix, YouTube and Hulu Plus are already compatible with this device, so you're streaming directly from your wifi and your computer or smart phone are just used to control what you're streaming.This makes it so much easier to stream because your computer or smart phone have a keyboard and you don't have to use the user-unfriendly interface many of these products provide for searching if you have a wifi TV or wifi DVR that supports streaming.", "verified": true, "helpfulness": "0/1", "author": "wifi-er"}, {"rating": 4.0, "review": "Works well most of the time.  It does need to be reset from time to time if it loses power of wireless internet.  It is nice that it doesn't stream from your device and you can use your ipad or phone without it slowing down.", "verified": true, "helpfulness": "0/0", "author": "Julian Compton"}, {"rating": 2.0, "review": "Will not connect to HDMI without my Vipre Security rejecting set-up.  Google Chrome \"download\" wants to include software I don'twant...I tried to out-smart the downloads intrusion, I could not.  I will no longer attempt to connect My laptop PC, what an attemptto introduce crap software!!!!!  However, Chromecast connects automatically to my 7 inch Tablet and performs well.  FYI, I trieda different Laptop and the same software, claiming to make my PC faster, intruded again and it took a little skill to remove.I very often use the regular Google site for it's great search capability.  As far as googlechrome, it should be a \"snap\" for a personwith my backround nonetheless, I ATTEMPTED TO CONECT MY PC OVER \"60\" TIMES including, at times while on the phonewith customer assistance.  I give it two stars because the ease in which it connects with my Tablet.", "verified": true, "helpfulness": "0/0", "author": "Charles R."}, {"rating": 5.0, "review": "Awesome so far.  Super easy to set up, super easy to use.  I just wish there where more options available as far as what you can sync.  Easiest way to watch netflix at any tv in my house.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer \"thenavonod\""}, {"rating": 4.0, "review": "Chromecast is dope but honestly, you can stream everything from a ps3 that you would Chromecast and avoid crashes and still be able to play Blu-rays. #justsayin", "verified": true, "helpfulness": "1/2", "author": "Steven Matos"}]