[{"rating": 5.0, "review": "Now we can watch movies and videos easily on our TV.  We could not get this to work with our smartphone (It is an older model) but easily set it up using our computer.  The best part is not having to run a long cable from the computer to the TV.", "verified": true, "helpfulness": "0/0", "author": "Sarah V."}, {"rating": 5.0, "review": "Awesome instrument.  I can cast anything from Youtube and Netflix to TV instantly.  Easy installation.  I came through an article that more Apps are supporting Chromecast.  This is very nice to hear.  I would recommend this to my friends.", "verified": true, "helpfulness": "0/0", "author": "Narayana Murty"}, {"rating": 4.0, "review": "I like this product, It's better than thought it would be. The only thing is that you have to have wireless were you are using it.", "verified": true, "helpfulness": "0/0", "author": "Delia"}, {"rating": 2.0, "review": "I thought I could watch Netflix with it and you can.  But I don't have a computer at home so I have to get my laptop or phone out and set it up.  I bought a $55.00 Blue Ray/DVD player and it works real good.  If you have a computer hooked up at home all the time then this will work for you.", "verified": true, "helpfulness": "0/0", "author": "Tate Vinson"}, {"rating": 1.0, "review": "Terrible u can't use it with just a few apps! Netflix is ok though but not worth money! When I Gould get a cable for 5$", "verified": true, "helpfulness": "1/1", "author": "Jose Rodriguez"}, {"rating": 4.0, "review": "needs more features. only certain apps work it chrome, not bad for the price. would think twice if i had to buy it again.", "verified": true, "helpfulness": "0/0", "author": "javier garcia"}, {"rating": 5.0, "review": "I bought this for my husband and he loves it. It coordinates with his Droid phone and well as my Nexus 7 tablet.", "verified": true, "helpfulness": "0/0", "author": "Donna Knesek"}, {"rating": 5.0, "review": "We don't use this as much as we should but it is sure handy to have when we want to use it!  Very easy to set up and so great to be able to view videos, shows and movies on your television instead of the phone of tablet.  Incredibly easy set up and use.  Can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "C. Thorpe"}, {"rating": 1.0, "review": "I could not set up the Google Chromecast streaming device to my entertainment system, using the VERY sparse instructions included.  I use a Motorola router, which is supplied by AT&T; U-Verse and must be used for my phone system/internet bundle.  This is a known product/manufacturer and not even mentioned in Google's troubleshooting guide list of routers.  Going on-line to their website and following their troubleshooting recommendations, then calling Google's \"customer service\" dep't offered no solutions.  I also called AT&T; and then my router's manufacturer, neither of whom had heard of Chromecast and could not offer any help, other than giving the spec's of the router and telling me to re-contact Google.  After waiting on hold, again, prior to talking with a rep., then while she spoke to her supervisor (who would not speak to me, personally), I was switched over to their IT department.  After explaining my trouble having the router recognized by the unit, giving them the spec's of the router and asking for their help in set up, I was told that because it was my router's problem, not Chromecast's, I would have to pay a service fee (I believe it was $49.95), then he tried to sell me a $15/month service plan.  WHAT???  This is a new product, produced long after my router and if it can't configure to a common brand router, utilized by THE major phone/internet service provider in the country, how is that my router's fault?  I wasted well over 5 hours on the phone and on-line trying to figure out this \"easy to use\" product, only to end up frustrated and feeling that I had been \"taken\".  Reconfirming that suspicion, a later call to Motorola verified that the information given to Google's IT department, would have alerted them that the unit could not be used with my router, without reconfigurations (which Google told me I needed to the router) that could affect my phone/internet service and void the router's warrantee, Google tried to sell me IT customer \"service\", knowing full well that the unit was unusable or would damage my router if changes were made to it.  THANKS, GOOGLE!!!  If Google will not honor their product, I only hope they will not give me a hard time in refunding my purchase fee - which I am fearful I may get nothing but excuses...again.", "verified": true, "helpfulness": "3/5", "author": "Thomas R. Ordronneau"}, {"rating": 5.0, "review": "Bought for husband to stream youtube videos on our tv. We use it everyday. Plays music videos clearly. Works great with netflix also. Do not have to keep device open while streaming either.", "verified": true, "helpfulness": "0/0", "author": "S. Torrico \"s.t.\""}]