[{"rating": 5.0, "review": "Easy to install & set up, VERY easy to use! So great to be able to watch videos, shows & browse the web on our TV. We loved it so much we bought our son who is in college one for Christmas too!", "verified": true, "helpfulness": "0/0", "author": "StephB"}, {"rating": 5.0, "review": "Simplicity.  Low cost.  Little to no commercials.  I can watch what I want when I want. My smart phone is my remote.  Bite me cable companies!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I really like the Chromecast compared to the blu-ray player I was using to watch Netflix, Amazon and Hulu. The major issue I have is that I bought it from Amazon and didn't realize that it doesn't Work with Amazon Instant Video. It also will not stream local video files from your tablet. My fault for assuming that it would do those 2 things but it seems like it really should. If it did that, the device would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Deacon Blue \"Deke\""}, {"rating": 3.0, "review": "Works well, set-up is easy.  Limited number of apps so not great until they provide more apps and more variety.", "verified": true, "helpfulness": "0/0", "author": "Alfa"}, {"rating": 1.0, "review": "Like many others I was excited to get the Chromecast to be able to transfer my youtube exercise videos from my computer screen to the big screen. After hours of wasted time, because there were not directions if you have problems, and no youtube videos yet on how to solve them and reading the reviews on Amazon I went to the trash pulled out the mailing package to send back to Amazon. None of the troubleshooting tips found on the Chromecast website helped, changing my router settings, changing my Anti virus settings...nothing worked...Finally I gave it one last effort after resetting the thing and relaunching set up for hours...my problem was that I did not have Chrome as my browser...that was so simple...they could have started off telling me that I need to have Chrome as my browser to set this thing up...after downloading Chrome I was able to get the Chromecast icon to launch my youtube exercise video...so at 1 am I am doing Zumba...I am still going to send it back because the quality is not the best the ,was slower than the computer, the picture quality is not the best and after about 45 mins the Chromecast shut down in the middle of my routine so I had to relaunch the video...all in all if you want something for the kids to watch their youtubes this is a very inexpensive way to achieve that...since I was up all night I did not get a chance to watch Netflix but I will today. Hopefully this review helps someone else from spending hours on this thing.", "verified": true, "helpfulness": "0/1", "author": "pumpkinone"}, {"rating": 1.0, "review": "Thought from the advertising that Google Chrome would be a great way to watch Netflix and Amazon content on our tv.  After hours of trying to make it work, with phone calls and online searching, finally found out our Uverse router was incompatible!  The final sting was a snappy comment from Google chrome:  \"Sorry 'bout that!\"  I'm surprised, and disappointed, that Google would do this.  Sent it back, thankfully that was easy with Amazon.", "verified": true, "helpfulness": "0/2", "author": "Careful Shopper \"Barbara Racey\""}, {"rating": 4.0, "review": "It was very easy to set up, but it simply needs more content.  If you're not a netflix or huluplus subscriber, you're stuck with youtube,  However, I have found out that a screaming toddler will be entranced by 100 continuous hours of Nyan Cats, so it can't be all bad.  Google, start rolling out more content and you'll earn that fifth star.", "verified": true, "helpfulness": "0/0", "author": "A. Oertel \"Wood Guy\""}, {"rating": 3.0, "review": "Need more appsSometimes device not casting I have to resetStreaming to tv slow at timesPicture quality is excellent", "verified": true, "helpfulness": "0/0", "author": "huewayne guy"}, {"rating": 5.0, "review": "Did more than was expecting. Can't wait till they add more to broadcast. Need more TV's in my house. Get it!", "verified": true, "helpfulness": "0/0", "author": "Ilsa"}, {"rating": 5.0, "review": "The dedicated apps are what make this product shine. Casting a Chrome browser tab works but any graphics will be slower than if you use the dedicated app: ie Youtube.  Netflix, Pandora, Songza all work marvelously.", "verified": true, "helpfulness": "0/0", "author": "John Robinson \"unfinished business\""}]