[{"rating": 5.0, "review": "So darn easy to hook up and it prevents me from having to use Wii to Stream Nextflix or Amazon.  The Wii controller was very difficult to use.  This is remotely controlled by either my phone or tablet.  Totally awesome.", "verified": true, "helpfulness": "0/0", "author": "CJ Roper"}, {"rating": 4.0, "review": "Easy to install - the Chromecast dongle broadcasts videos from my iPad crisp & clean. Terrific technology at an extremely affordable price.", "verified": true, "helpfulness": "0/0", "author": "The Nonchalant Savant"}, {"rating": 1.0, "review": "Chromecast was working great for several months. Now, it seems stuck on the wrong resolution and displays in a zoomed mode. Nothing changed with the TV. This only happened after the latest update from Google. Every video from Youtube to Netflix is displaying in almost a zoom mode. Even the screen saver for Chromecast is displaying where I can't see the time and name of my device.", "verified": false, "helpfulness": "0/0", "author": "Jared Tracy"}, {"rating": 2.0, "review": "Its not a lot you can do with this device kind of disappointed I still use it but not that often", "verified": true, "helpfulness": "1/1", "author": "Monique"}, {"rating": 5.0, "review": "We love our Chromecast and it easily streams our Netflix and YouTube content. I am waiting for when SlingBox is supported and I will buy more to replace the cable boxes I have in various rooms.  I've had a few issues where I needed to completely restart and re-sync the devices. To restart, you need to hold the button on the edge of the device for a quite a few seconds.", "verified": true, "helpfulness": "0/0", "author": "Adam T S"}, {"rating": 4.0, "review": "Biggest downside is the lag and there's not a lot of apps that are available for it's usage. Other than that, a great tool for non internet hdtv", "verified": true, "helpfulness": "0/0", "author": "jorge"}, {"rating": 4.0, "review": "Elegantly turns a dumb TV in to a smart TV compatible with phones and tablets. As more apps are getting integrated, it's getting even better. Installation was surprisingly easy. I mostly use this for Netflix and Pandora. It is a bit slow to power up, then add a little more time to connect to your mobile device, and then to get a movie or station running. So a bit pokey, and I'm removing a star for the interface. Still, I'm mostly pleased and the price can't be beat compared to competitors.", "verified": true, "helpfulness": "1/1", "author": "Tastinient"}, {"rating": 1.0, "review": "Have been unable to secure a consistent connection.  If I receive addiitional instructions that actually correct the reception issue, I will re-post.", "verified": true, "helpfulness": "0/0", "author": "Devonite"}, {"rating": 1.0, "review": "Had much difficulties performing the initial wireless and app setup. Once installed, found video very poor in quality with frequent frame freezing even with a very high internet connection above 25 mb broadband and close proximity to the access device. Additionally, seems that the only browser supported is Google Chrome, no surprise there.", "verified": true, "helpfulness": "0/0", "author": "Richard Varela"}, {"rating": 4.0, "review": "If you do not already have a means of streaming mainstream sources like Netflix or YouTube or Hulu, go and get it! Works great with Chromecast supported sources.Otherwise, if you are looking for casting Chrome browser content to the TV, you might be a bit disappointed. It works .. but, you need a powerful personal computer to do it. Laptops and tablets don't cut it.The device is small, simple and easy to set up. Beware of quality issues .. the USB power connector on the first unit was not tight and power fluctuated making it unusable. Amazon quickly replaced the unit with a good one. (Google's customer support .. excellent .. also offered to replace it but Amazon's return process is so much easier to use).", "verified": true, "helpfulness": "0/0", "author": "Tzar Igor \"Tzar Igor\""}]