[{"rating": 5.0, "review": "Listening to music on Pandora is wonderful.  Now that Plex allows non-monthly subscribers cast content that is on their media server to Chromecast, you could send any of your movies that you have in the Plex Media Server to Chromecast.  You do still need to pay for the Plex app. It is $5 so it is fairly inexpensive for the convenience of watching your media.  It would be nice if they integrated the Chromecast feature onto the server.  This way you would not have to go to your smartphone all of the time just to play your content.I am sure more apps will integrate with Chromecast, so the fun has only just begun.", "verified": true, "helpfulness": "0/0", "author": "Marcia Boivin"}, {"rating": 5.0, "review": "Nice alternative to cable and we are able to watch in any television.  Great value also.  Glad we purchased after seeing the commercial", "verified": true, "helpfulness": "0/0", "author": "Lucy"}, {"rating": 3.0, "review": "I was a little disappointed.Only transmits Netflix and You Tube.  Probably my fault for not reading more thoroughly. I hoped it was more robust -", "verified": true, "helpfulness": "0/0", "author": "Michael Leeds"}, {"rating": 5.0, "review": "I wach tyt and other youtube videos every day, and i rent movies from google paly, good with My Ipad but better with my galaxy s4 because i can use google play. I can cast from my pc but there is not need for me", "verified": true, "helpfulness": "0/0", "author": "Pblo"}, {"rating": 4.0, "review": "Only takes a few minutes to setup and you're up and running. Needs more apps though... including amazon prime.Plays well with netflix.", "verified": true, "helpfulness": "0/0", "author": "Ced S"}, {"rating": 5.0, "review": "Great for streaming.  Easy to use.  Little does he know I am going to steal it for myself.  The fight is on.", "verified": true, "helpfulness": "0/0", "author": "PAWPRINTS"}, {"rating": 5.0, "review": "My wife and kids love this device.  We are an iPhone family and have this hooked up to our main tv.  My wife loves it because she can use her phone to control Netfix, without going through the wii, and stream Pandora through our sound system.  My daughter loves the Youtube and Pandora control. We are cordcutters and love the ease of use and NO monthly payment for the device.", "verified": true, "helpfulness": "0/0", "author": "Firepool"}, {"rating": 4.0, "review": "This is an incredible little device. I use it in Argentina, and it only supports Netflix and Youtube (besides other not so well known channels) The quality of the image is amazing. One comment: I can only cast Youtube in my Acer A500, (With Netflix It gives the \"error 16003\" so many people talk about and cant seem to solve) but strangely enough, my LG L7II works perfectly with Netflix and Youtube. I hope in the future other channels will be added, but I am happy having those two.", "verified": true, "helpfulness": "0/0", "author": "Jakes"}, {"rating": 2.0, "review": "It won't play Amazon movies. That is the main reason I bought it. It is just taking up space behind my TV.", "verified": true, "helpfulness": "0/0", "author": "GC"}, {"rating": 3.0, "review": "This is a great idea, but doesn't live up to expectations.  I could never get it to work with my iPhone and wifi.  A little more instruction and explanation of what the capabilities are before purchasing would be great.", "verified": true, "helpfulness": "0/0", "author": "Barneybowwow"}]