[{"rating": 4.0, "review": "But it isn't a ROKU replacement. As there is only a few apps that sling to another device on your house WIFI.", "verified": true, "helpfulness": "0/0", "author": "S. Grayban"}, {"rating": 4.0, "review": "Good alternative to TV that doesn't have apps available - although there aren't as many apps available through chromecast yet either. I have no trouble casting netflix through my phone. Casting from the chrome browser isn't perfect, but I think that has a lot more to do with my internet connection than the actual device itself.", "verified": true, "helpfulness": "0/0", "author": "krissie h"}, {"rating": 5.0, "review": "This device helps you to watch online movies in a big screen on your TV, and I believe it is wonderful to have it.", "verified": true, "helpfulness": "0/0", "author": "ja"}, {"rating": 5.0, "review": "This was a leap for my technical skills, but it was easy to install and after I got Netflix set up, I started \"casting\" from my laptop to the TV. I DID IT - all by myself!!", "verified": true, "helpfulness": "0/0", "author": "Bill Loweth"}, {"rating": 5.0, "review": "I think it's one of the thing it must not miss. It doesn't exist anything so perfect for streaming media contents on TV.", "verified": true, "helpfulness": "0/0", "author": "Massimiliano Spiccia"}, {"rating": 5.0, "review": "I have Roku as well as Apple TV, and I would say that chromecast is a great, portable option.YouTube is especially fun to use with the chromecast.  You can create playlists from iPad or iPhone from multiple devices.Fun option for netflix as well.", "verified": true, "helpfulness": "0/0", "author": "Gilda Viola Books"}, {"rating": 5.0, "review": "The quality of the stream is amazing. It was easy to setup and a great companion to the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "R. Jeter"}, {"rating": 5.0, "review": "Perfect. So easy to set up. I use mostly Plex Media Server through it. Works great. No complaints about it. Can't wait for more apps to come out for it.", "verified": true, "helpfulness": "0/0", "author": "t. mcgritty"}, {"rating": 4.0, "review": "It's probably the best way to watch videos from the internet on the big screen. Not only is it incredibly easy and intuitive to have your smartphone as a remote (a TRUE 21st century remote, not the crappy IR stuff found on the HTC One and Galaxy S4), it's also the cheapest \"box\" to get Netflix on your TV.I have to knock off a star because of the lag when mirroring tabs in Chrome. It's pretty much useless because of the audio delay, and it doesn't have too many uses besides that. It also is only 2.4GHz 802.11n. I guess that is just leaving room for improvement on Gen2.It'll be nice if they can make a way to let me use my phone as a remote to play videos to the Chromecast FROM my Windows PC. That would make this a $35 HTPC.It's a no-brainer product though. It's seriously great and I think eventually this is how we will watch TV in the future. There's not a single set-top box whose interface is as intuitive as a smartphone app. They just need to work on the lag (both the mirroring and loading apps and videos) and the cohesiveness before you cancel your cable.", "verified": true, "helpfulness": "0/0", "author": "quentin"}, {"rating": 4.0, "review": "Perfect for what I wanted it for; itallows me to use my phone as a remote to send video apps to my TV.", "verified": false, "helpfulness": "0/0", "author": "Caryn Bird"}]