[{"rating": 5.0, "review": "I received my Chromecast this past Saturday. Took less than 2 minutes to open package and setup and I was \"casting\" YouTube videos. (Full disclosure, I installed the Chromecast app on my Android tablet weeks ago in anticipation of receiving my Chromecast) If this takes you longer than 5 minutes to setup you should not be doing things like driving cars.Works great. I decided to get rid of my smart Blu-ray player and get a dumb DVD player for ten bucks. I don't need the apps anymore, I don't rent/buy Blu-rays and I only used the 3D functionality once (the day I got it).With the Chromecast we no longer need TV's and DVD players to be \"smart\". What we need is for new televisions to have Chromecast built-in and for all streaming media services (ie MLB.TV, Hulu+, Amazon Instant, etc.) to build the ability to \"cast\" into their mobile apps.Update 08/17/2013I have to say the packaging is really nice. I keep it next to me on the couch so I can admire it and I open and close the box and it makes me giddy. I even sleep with it next to me on my pillow so I can feel close to my Chromecast. And I actually love the weird smell that pervades the Chromecast's packaging. I even sniff it. I think it smells like new car.When you airplay something does an Apple TV turn on your television and switch it to the correct input automatically? I doubt it. And therein lies the magic of the Chromecast.", "verified": true, "helpfulness": "3/4", "author": "Justin A. Wilson"}, {"rating": 5.0, "review": "i was a lucky one and got the unit within the first week of release.  For the price I couldn't pass it up just to try and out and play with it. Well truth be told we use this more than we use the Netflix app on the tv, or my Xbox. And it works so much better than using the menu on Comcast to rent movies. Google Play is so simple to use wit my tablet or phone, or laptop. My girlfriend can easily stream from her Iphone and while the movie is playing we can still make phone calls and use the phone for text messages etcusing this device to play music streamed through my home stereo works so much better than using Bluetooth also, I don't have to worry about being too far away.  I can't wait to get 2 more devices for the other tv's around the house.", "verified": false, "helpfulness": "1/1", "author": "BKM"}, {"rating": 1.0, "review": "Preface: I have high speed internet and a business grade router Cisco Linksys E300. My TV is located 10ft from the router. I was very excited to start using the device.1. The set-up worked fine and it connected to my internet. (I was very excited to start pushing netflix via my tablet and phone)2. THE PROBLEM: I sync my devices (motorola Xoom 4.1.2 and Samsung Galaxy Note 2.3) and try 'Cast' netflix onto my TV....It  stalls in a loading state. 5 min later it gives an error message on the screen and aborts trying to \"Cast\" the netflix show on my TV.I really wanted to give it 5 stars because the idea is awesome, but it is not working for me.I messaged Google and they have yet to respond.", "verified": true, "helpfulness": "17/42", "author": "PMB"}, {"rating": 5.0, "review": "Handy way to start Netflix or stream musics using your phone or tablet. Pretty slick, especially if you already have and use any Android devices.", "verified": true, "helpfulness": "0/0", "author": "William Stamper"}, {"rating": 1.0, "review": "I don't own this, but have read the specifications on it.  I thought about buying this, but until I can use it with my Amazon Prime movie streaming (and all of my music I have stored with Amazon) I wouldn't consider buying this (reason for 1 star).  In fact, I'm hoping Jeff Bezos and crew release something similar (and supports a larger range of services) in the near future.  Interesting concept, but I feel they should have supported more services right out of the gate.  I'm sure they will support more services down the road, but until then, I'm waiting to see what happens.", "verified": false, "helpfulness": "5/44", "author": "Chris"}, {"rating": 5.0, "review": "Great device. Possibilities are endless. The chromecast was easy to set up and now I get all my favorite digital media on my TV.", "verified": false, "helpfulness": "0/0", "author": "Austin Mutschler"}, {"rating": 2.0, "review": "I suppose if you just didn't want to spend a couple dollars more and buy a Roku this is sort of OK.Well, kinda sorta.It doesn't do much on it's own. If you're not streaming from a browser then YouTube/Netflix is it.What's also annoying is that instead of the tiny little plug-in you think it is most people will find they'll need all the extensions and cables coming out of both sides. It makes both Apple TV and Roku boxes look elegant.That combined with harder then should be router connection and your phone's the remote makes this yet another piece of Google hardware that's just not ready for prime-time.Most anything else looks and works better.", "verified": false, "helpfulness": "1/13", "author": "Matthew Kennedy"}, {"rating": 4.0, "review": "It was a breeze to set up and it's so convenient being able to cast my computer to my tv.  I can control Netflix from my phone, tablets and Chromebook.  I do wish that I could cast HBO Go or Pandora, but this device is brand new so it's a work in progress.  I think it'll only get better from here.  I'm impressed, Google!Tip: Chromecast Can Cast Your Entire Desktop Screen Too, Not Just Tabs:[...]\"To access this experimental entire screen casting, all you have to do is tap the Cast button in Chrome (assuming you installed the Chrome extension), tap the little down arrow box in the pop-up, and select \"Cast entire screen (experiemental).\" Once you have that option checked, you'll then tell the Cast extension to cast to a Chromecast.\"", "verified": false, "helpfulness": "0/0", "author": "Vanessa C. \"Vanessa C.\""}, {"rating": 4.0, "review": "I literally have an old PC attached to a 42 inch HDTV just so I can watch videos or play games off of it, but its one of those TV's that doesn't quite recognize the PC every time (or even half the time) it starts up so having to remove the HDMI plug and replace it back in to get sound and video to work is a hassle; it also screws with resolution settings reverting them and having to readjust that as well. Once I got chromecast I no longer needed to rely on that PC to watch videos or even bother turning it on anymore, I can sit back and stream it from my Galaxy S3. The amount of power drain from your phone is small, if I were to watch the same videos on my phone it could drain 2-3% of the battery per 30 min video whereas streaming to Chromecast it only drained 1% for 3 videos in all so it's just sending data rather than playing it on both devices.Any device on the wi-fi can connect to the Chromecast, it doesn't need the phone App on all of them just the one that sets up the connection after that the app is no longer needed. We tested every smart phone we have and they all connect to it automatically. For PC/Laptop you do need the Chrome Browser, but what if you don't like using the Chrome Browser? Well there is a way around that, but you still need to use the Chrome Browser as a back drop hiding in a minimized window. Open Chrome, and download the browser app/extension \"Chrome Remote Desktop\" with this you can remote into your own PC/Laptop and can be viewed as a direct mirror of sound and video onto the Chromecast. Once you have it setup you can minimize the window and run whatever else you want, from other Browsers, video players like DivX, if you're old fashioned like me play WinAmp, Windows Media Player, your photos, or even PC games. They will all project through the Chromecast as long as the Chrome Browser has the Chrome Remote Desktop actively running. Video games have a slight delay for less video intensive games its hardly noticeable, but for fast pace games it can be pretty annoying like Planetside 2 there's at least a 0.5 second delay on input to video, it gets worse when you have big armies on both ends.", "verified": true, "helpfulness": "1/1", "author": "Phane"}, {"rating": 3.0, "review": "Pros:its Googleeasy to set upCons:Chromecastvery slowwill not stream Amazoni will use a $20 RCA WiFi Streaming Media Player can do more or my Smart Tv", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]