[{"rating": 5.0, "review": "Go ahead and click \"buy\".  The only way this could be made better is if it plugged itself in.", "verified": true, "helpfulness": "0/0", "author": "Danster"}, {"rating": 5.0, "review": "Does a good job streaming live tv broadcast.Easy to install without a lot of complications.", "verified": true, "helpfulness": "0/0", "author": "Eddie  J. Benjamin"}, {"rating": 5.0, "review": "It worked as advertised...and for the price how can you go wrong.  Best results was with a PC or Droid device....much more difficult to interface with an Apple device.  If you have all apples in your house buy Apple TV, a few more bucks but no interface issues.", "verified": true, "helpfulness": "0/0", "author": "Ernie Judson"}, {"rating": 4.0, "review": "I just set it up last night and it works fine. There is a bit of a delay, but it is pretty short (less than 10 seconds). It would be nice if the power cord was longer (I have my TV on top of a tall cabinet) and it took me a minute to figure out some of the features, like how to rewind, but those are minor downsides. All in all it seems to work well, especially for the price.", "verified": true, "helpfulness": "0/0", "author": "CarolineV"}, {"rating": 5.0, "review": "Great quality", "verified": true, "helpfulness": "0/0", "author": "SB Inc."}, {"rating": 2.0, "review": "If you want to use this for streaming live sports, I would not recommend it. The output is choppy and the quality is lacking. If you want to use it for netflix or hulu etc, you should probably be okay.", "verified": true, "helpfulness": "0/1", "author": "Micah"}, {"rating": 5.0, "review": "Works flawlessly as a streaming media player! Been streaming YouTube videos for parents to watch their foreign soap operas and movies at ease.", "verified": true, "helpfulness": "0/0", "author": "T. Ung"}, {"rating": 5.0, "review": "Even better than having a smart tv. You can stream pretty much everything from google chrome)", "verified": true, "helpfulness": "0/0", "author": "Adolfo Perez Romero \"Rp!..\""}, {"rating": 5.0, "review": "Good product.", "verified": true, "helpfulness": "0/0", "author": "Teresa"}, {"rating": 5.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "Adam"}]