[{"rating": 4.0, "review": "Great product specially given its low price. There is a lag in the audio on tv when a video is played on my computer. Would recommend using the chromecast for picture vieweing, website surfing etc.. not really made for video in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Adnan Alshalan"}, {"rating": 4.0, "review": "While I have a smart TV, they don't include all broadcasts to watch later, so this device is very easy to set up and cast to your tV with any computer with Chrome.  The quality is very good.  On occassion I had to restart because of lip sync (annoying).  For the price it is well worth it and I look forward as they add new apps to this device.", "verified": true, "helpfulness": "0/0", "author": "Juan Sandoval \"elsapoverde\""}, {"rating": 1.0, "review": "I choose the poorest rating because you have to be within 20' of your computer. This info should have been known before I bought. Great idea, but poor results.", "verified": true, "helpfulness": "0/0", "author": "Lawrence Amell"}, {"rating": 4.0, "review": "Chromecast is really cool.  However, you may want to upgrade your router; as I've found that Chromecast slows everything else down on my network.  I have trouble streaming HD video, but I believe that's a function of my substandard router.  My family watches TV during dinner, and this item allows us to spread out in the living room, and not huddle over the laptop.", "verified": true, "helpfulness": "0/0", "author": "Tubbins"}, {"rating": 3.0, "review": "I have to agree with so many other reviews, this is a great idea, but is still a Beta version implementation.It intermittently drops connections to your source machine, and takes several steps to reconnect.The content can come only from Chrome Browser, although the way it passes off Netflix, YouTube, and Hulu URIs directly to the device is a good approach and seems to work well. It will still stutter and pause on some streaming content.I was largely interested in using it for meetings and presentations, but it still requires some local WiFi setup, although not too much. When sending PowerPoint presentations, I could not find any way t o have it shown in regular full-screen mode, it always keeps the slide index on the left as one would do during development. (There are workarounds, converting to full-screen locally, and using a different display mode, but the standard \"casting\" mode should work better.)But overall it also has limited content sources - for example who wants to subscribe to Hulu and pay to watch commercials?I look forward to when this develops into its full potential - the idea is a great one!", "verified": true, "helpfulness": "0/0", "author": "gGuthrie \"guthrie\""}, {"rating": 4.0, "review": "still trying to figure out how to work it with my system. But over all it is very nice to have", "verified": true, "helpfulness": "0/1", "author": "jo b."}, {"rating": 5.0, "review": "easy setup and a lot cheaper than cable...luv it!we have netflix and use our laptop as the \"remote\" and it's even for my kids to use.", "verified": true, "helpfulness": "0/0", "author": "patti jordan"}, {"rating": 4.0, "review": "Too bad its not widely supported by other software..The picture quality from youtube and netflix is great.Hope we get support for more services and better access to local media on pc.", "verified": true, "helpfulness": "0/0", "author": "Jani Into"}, {"rating": 3.0, "review": "First of the good- the thing is tiny.  Compared to roku, apple tv, etc, this thing is super small.- it works.  It is very simple to operate and begin using- its portable.  Unlike other products, when you are done with it you can simply unplug it from your tv and go.- its power comes from usb.  This is perhaps the one of the best parts about this thing.  You do not have to plug this into the wall for it to work, but simply plug it into a usb port also on the back of most TV's.  the usb cable is included!- PRICE!  I mean come on, seriously... you can turn your tv into a smart tv for under 40 dollars!The not so good- There is only a very few apps that work with this so far: Youtube and Netflix.  (also it casts whatever is on your chrome browswer)Suggestions:- It would be great if they could expand the apps to also work with MLB, NHL gamecenter, and slingbox to name a few.In the end, you can not beat the price of this device.  Even with the limited app support I would recommend this product.  Once more apps are supported, this thing will amazing.", "verified": true, "helpfulness": "0/0", "author": "MyReviewMyStory"}, {"rating": 5.0, "review": "We are extremely glad that we bought this. No more hooking up the laptop to the T.V. Works well with Casting the tab from a PC.Only issue that we notice is that we cannot use Iphone or Ipad to cast the tab from Chrome.Would recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Honest_Reviewer"}]