[{"rating": 4.0, "review": "I bought the Chromecast dongle so that I could play Google Music through my TV, and it works like a charm. I also use my Chromecast when my Apple TV gives me trouble, so I have been able to see how the Chromecast stacks up against the Apple TV. When I watch certain shows on Netflix through Apple TV, I notice that some shows (most recently Madmen) will start in HD and will immediately switch to SD. I reset the router and checked all my settings, but am not able to fix the problem. Recently when this happened, I decided to see if the Chromecast worked better, and it worked with no problems whatsoever. I watched several episodes of Madmen on Netflix and had no problems with the resolution. The major disadvantage of the Chromecast compared to the Apple TV is the number of services you can stream through. Google is currently working on adding services (currently offers streaming through Netflix, Pandora, HBO GO, Hulu Plus, Google Play TV & Movies, Google Play Music, and YouTube) but Apple is far ahead in this respect at the time of this writing. I think that Google will continue to improve the Chromecast, so if you can still pick one up for $35, I would go ahead and do it.", "verified": true, "helpfulness": "1/1", "author": "S. Linton"}, {"rating": 3.0, "review": "Works but has problems with HD playback (insanely slow and sometimes just fails). Still trying to find out if this is ISP problem (25 down/15 up) or YouTube/Google issue.", "verified": true, "helpfulness": "1/2", "author": "hamndrew"}, {"rating": 5.0, "review": "Easy to use. Great buy! I am a You Tube movie fan. This is the best product for watching You Tube on TV!!", "verified": true, "helpfulness": "0/1", "author": "Ivan patterson"}, {"rating": 3.0, "review": "Pros: Cheap, streams (internet) media, is super tiny, and can run off the tv's USB port.Cons: Has no setting to combat burn in on plasmas, making it totally unusable on my main TV. Can only stream web content, as \"casting a tab\" is slow and sad. Has no ability to stream local content, which may never be fixed, as google seems to be sucking up to big content on this one.Will update if there are changes (hopefully there will be soon)", "verified": true, "helpfulness": "0/1", "author": "Windham M. Graves"}, {"rating": 1.0, "review": "From supposedly being a super streamer from all your stuff from a computer or an android it became a Netflixx player. Stupid restrictions", "verified": true, "helpfulness": "0/4", "author": "Antonio Siciliano Garcia"}, {"rating": 5.0, "review": "I purchased my Chromecast at Best Buy. When I got it set up, it worked just as expected! I was a little frustrated at first because I own the Samsung Chromebook and I was not able to set up the Chromecast from it (seriously, Google?). Anyway, I was able to set it up with my iPhone no problem. There were just two hiccups for me getting it ready. One. After Chromecast joined my wifi network neither my iPhone or my Chromebook would recognize that the Chromecast was available. I was getting a little feisty, but then I did what every troubleshooting expert would tell you to do--I unplugged the power for the Chromecast and plugged it back in. As soon as it rebooted, there was an update. The update took about 15-20 minutes to install. Great! Two. But my devices still wouldn't pick up the Chromecast signal and now I was really mad because I had waited for the update and it still wasn't working. Before I got any more upset, I unplugged my wireless router and plugged it back in (since there was a note in the Chromecast set up that it was rebooting the router). Voila! Everything worked. iPhone, Chromebook, it was perfect. YouTube and Nexflix have a Chromecast button (looks like the Chromecast extension icon) in their menu bar and when you click that it will let you choose whether you want it on your computer/phone screen or your Chromecast (which you can give a custom name). For Google Play, I had to click \"View this in YouTube\" and once the YouTube screen came up I could click on the Chromecast button. I hope they get more Apps soon!", "verified": false, "helpfulness": "0/0", "author": "Nina Dyer"}, {"rating": 5.0, "review": "Easy to set up and fun to use.  We have 2 phones with Chromecast plus a PC and a laptop.", "verified": true, "helpfulness": "0/0", "author": "Gerardo Arroyo"}, {"rating": 5.0, "review": "Absolutely the best 35 bucks I have ever spent!!! I used to connect my laptop to my large screen tv when I wanted to watch something or display anything on the tv.  This involved connecting an RGB cable as well as a 3.5mm audio cable between the laptop and the television. Then we bought a few Macbooks which do not have the second monitor connection.  I purchased the Chromecast and now I can transmit via WiFi from the Macs, Windows, or even smartphones.  It is easy to setup and flawless in its picture quality.  I would highly recommend this to anyone looking to have the ability to watch YouTube videos, Netflix, or even broadcast your desktop to your television.  It's nice and small and is invisible because it connects to the HDMI port on the television just like a thumb drive.", "verified": true, "helpfulness": "0/0", "author": "Ronald A. Adamson"}, {"rating": 5.0, "review": "Now with HBO GO, it is definitely worth $35. Will only get better with more services like screen mirroring and Spotify.", "verified": true, "helpfulness": "0/0", "author": "Justin R"}, {"rating": 5.0, "review": "This is an amazing product! I can be on my tablet or iphone and throw a video up on my TV and it's right there! The commercial has it right! Simple, easy to use and fun! Thanks again Google for a terrific product!", "verified": true, "helpfulness": "0/0", "author": "klp"}]