[{"rating": 2.0, "review": "I lost the icon on the computer screen about a week after I got it. I can't figure out how to get it back.", "verified": true, "helpfulness": "0/0", "author": "Roy Menzel"}, {"rating": 2.0, "review": "This was initially a good product but it was quickly downgraded in usability and promptly abandoned by Google. I was light years ahead with an HDMI cable connecting my TV to my PC 5 years ago. Just buy a Roku and be done with it. This half hearted effort by Google isn't worth a second glance in its current form.", "verified": false, "helpfulness": "1/2", "author": "T. Hugok"}, {"rating": 5.0, "review": "This device does work just fine considering its price.  Once I got it set up I had no problems watching any of my media.", "verified": true, "helpfulness": "0/0", "author": "eveljohn"}, {"rating": 2.0, "review": "That is the reason I wanted this. Doesn't do it. Google removed that capability for some stupid reason after saying we could do that.", "verified": false, "helpfulness": "1/1", "author": "builder1650 \"builder1650\""}, {"rating": 1.0, "review": "It may be a good device but I am not able to use it.  Only 35 bucks- who cares- but they should have some kind of phone assistance available- there is no on to call.", "verified": true, "helpfulness": "1/2", "author": "Glenn G. Wells"}, {"rating": 4.0, "review": "I've been using the Chromecast for two weeks as my main streaming device went ylod on me. So far it's really good, and the future of this device should be brighter. Not as easy to handle from your ipad vs the ps3 controller, but it's something.I give 4 stars to the fact that I was used to stream netflix from my ps3, which is better in my opinion. If more apps/functionality is given into this device, it easily can get a 5 stars.", "verified": true, "helpfulness": "1/1", "author": "ManoM"}, {"rating": 1.0, "review": "Does not have much options of use.  I regret  that I bought it.  I would not recommend anyone to buy it.", "verified": true, "helpfulness": "1/2", "author": "skylima"}, {"rating": 5.0, "review": "Great, works well, and simple to use once you get in synch with your router.Need more selection of shows to chromeCast.", "verified": true, "helpfulness": "0/0", "author": "Philip johnson"}, {"rating": 4.0, "review": "I thought from some of the other reviews this would solve my netflix streaming problem, but it just crammed up my hole. It was too big, I just kept pushing thinking it was just a really snug fit but, it never got all the way in. My wife was helping me and she just kept asking me \"Is it in?\" over and over. Found out I was putting it in the wrong hole, haha whops.Great product though.", "verified": false, "helpfulness": "3/5", "author": "Eh_kees"}, {"rating": 5.0, "review": "This is an excellent purchase for my household.  We are now streaming videos and other information routinely.  We had some problems in the beginning but that turned out to be issues with my modem and not problems with Chromecast.  I was able to work with the Chromecast technical help to resolve the issue fairly quickly.  I would recommend this product to anyone who has a TV with HDMI and USB input but does not have a built-in wireless system. This is so much smaller and less costly than an Xbox or even a Roku or others like that.  This product was the answer to the product I was looking for over two years.  Thanks Google.  Good job.Ed Vernon, New Mexico", "verified": true, "helpfulness": "0/0", "author": "George E. Vernon"}]