[{"rating": 1.0, "review": "My husband and I were very disappointed with Fire TV and sent it back. We hardly watched anything. There were a lot of technical problems setting it up, then audio problems. After a lot of back and forth with Customer Service, my husband realized a box on top of our tv table was blocking the signal. Customer Service had no idea how to help with this issue, or with the lack of audio with Netflix documentaries. The other major frustration we had was that there were no intuitive categories for the movies and tv shows. Unless you knew in advance what you wanted to watch (by looking elsewhere), you had to click through a gazillion random movies/tv shows in no order (which then repeated).  Also, a number of recent movies we wanted to watch were not available, unless we paid an extra charge. We often ended up so frustrated, we just watched basic tv.", "verified": true, "helpfulness": "4/6", "author": "Artgirl1"}, {"rating": 3.0, "review": "I am actually disappointed with the fire tv. The device is pretty powerful but amazon decided to take the fun out of it. Storage space is extremely limited, if it is meant to be a gaming platform, you cant store many games on  the 5.5 gb of available space. You cant install apps from the play store. They removed the ability to root it with the latest software update. I wanted to use it to play emulators but now i have to stick with the less powerful ouya or a htpc. They disabled the usb port so you cant browse pictures, videos or mp3s, what a bummer. I got this during the black friday sale so i guess i will just stick it on a spare tv for netflix use.", "verified": true, "helpfulness": "1/2", "author": "marvin thomas"}, {"rating": 4.0, "review": "Great product, easy to use, loads of free content if you're already a prime member.I bought it for Black Friday and then they discounted it $30 barely 48 hours later. My device arrived on the same day the discount began. So that will be -1 star on Amazon for screwing me on that.", "verified": true, "helpfulness": "1/3", "author": "Georgia Pech \"Trust me, I'm from the internet.\""}, {"rating": 1.0, "review": "Very few apps that work with it.  HULU does not work (the free one) as well as so many others.  Any app that provides free something that Amazon sells will not work on the Fire TV.  It will work on the Kindle so I have to think that you pay for a streaming device that is only good for buying additional services.  I would return it if I hadn't been so busy with the Holidays that I missed the window.  This is the first Amazon product I am really disappointed in.  (Love my Kindle Fire though).", "verified": true, "helpfulness": "6/8", "author": "Dr Jac"}, {"rating": 5.0, "review": "I love it. What can I say. I can't wait to get my Fire TV stick for another TV I have.", "verified": true, "helpfulness": "0/0", "author": "Darwin Jimerson"}, {"rating": 3.0, "review": "I'm not sure I would recommend this devise It is simple enough to operate and the picture quality is good. I would have liked to receive some written instruction. The intro video assumes that all customers are electronic devise savoy and think the same way the script is written. To resolve the problems I was having I had to call Amazon - Its not an easy phone number to find either.", "verified": true, "helpfulness": "1/3", "author": "Coffee lover"}, {"rating": 5.0, "review": "I did my research and decided with amazon fire TV, I made the right choice!", "verified": true, "helpfulness": "1/2", "author": "cita"}, {"rating": 5.0, "review": "Love this.......... Pretty easy to use .", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 4.0, "review": "I have had Fire TV for a while now and its great. Before this I had a Roku and this beats that in quality. That said this is my second Fire TV as the first one stopped working after a little more than a month. The other issue I have that I find very annoying is that unlike some of the other players if you have no internet/outage the device is a brick. We play many movies using Plex from our computer network and it will not allow you to access anything on the device even the non internet apps without an active connection.", "verified": true, "helpfulness": "3/3", "author": "MincedGeek"}, {"rating": 5.0, "review": "I love this thing!  It's great for getting access to all the various streaming services, but with a little doing, makes an awesome XBMC box.  Doesn't require root, or any real meddling with the system.  Amazon, please don't close this off, it's what makes this box better than the rest!One thing I wish it could do is play my UltraViolet HD collection.  Amazon isn't part of the UV club, and none of the other UV apps can do it.  Amazon, please join the party!", "verified": true, "helpfulness": "0/0", "author": "John Hirning"}]