[{"rating": 5.0, "review": "Yes yes yes yes yes.Yes. Fantastic design, simple to use, and easy to get started. Thank you Google for providing a device that makes it even easier for me to use my television interchangeably and wirelessly with my web-viewing.", "verified": true, "helpfulness": "0/0", "author": "Aaron Safronoff"}, {"rating": 5.0, "review": "Works just like its supposed to! I just wish it could do more, but I also have apple tv for that! Hopefully one day I can make the switch fully", "verified": true, "helpfulness": "0/0", "author": "Honest _rian"}, {"rating": 1.0, "review": "I was hoping for so much more from google.  This is a piece of crap.  Limited funtionality.  Great if you dont have an internet connected TV.  But really who is going to buy this that doesnt already have this funtionality through DLNA compliant TV.  Dont waste your money till Google increases support and funtionality.", "verified": true, "helpfulness": "19/25", "author": "Puneet Sharma"}, {"rating": 5.0, "review": "It's so small and unobtrusive. Much better than having a gaming console which takes up a lot of space (and I don't use anyway)!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"classics fan\""}, {"rating": 5.0, "review": "Exceptional device with more functionality every month. Google is slowly making it more possible to live a standing life. For this I thank them.", "verified": true, "helpfulness": "1/1", "author": "Dwayne Richards \"dw\""}, {"rating": 2.0, "review": "Lag from browser to TV stream (obv except netflix and youtube). Not an internet connection problemBUT, its only 35 bucks", "verified": true, "helpfulness": "0/0", "author": "Dhanushyan Dharmarajah"}, {"rating": 1.0, "review": "This didn't do what I wanted it to do, totally disappointed with this piece of equipment, not sure of the hype.", "verified": true, "helpfulness": "10/14", "author": "leroy taylor"}, {"rating": 5.0, "review": "Works very well. Strongly recommend it. I'm now enjoying all my Netflix and Youtube stuff without having to mess around with Samsung TV's crappy built-in smart TV software.", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 1.0, "review": "SORRY !! BUT I RECIEVED THE PACKAGE OPENED WITH NO CONTENTS. I FILED A COMPLAINT TO THE P.O. IN ST.LOUIS,MO.ON OR ABOUT THE 1ST.OF OCT. SO FAR NO WORD FROM THEM YET. IF YOU COULD HELP IN SOME WAY I WOULDAPPRECIATE IT .  THANKS ; ROBERT MOSER", "verified": true, "helpfulness": "1/5", "author": "robert moser"}, {"rating": 4.0, "review": "I am not a techie, but I managed to get this to work right out of the box..... One of the FEW things that has gone well with Windows 8!I love using this for my Netflix. Now we need to get it to work with Amazon streaming as well.", "verified": true, "helpfulness": "0/0", "author": "Helen"}]