[{"rating": 5.0, "review": "Awesome product and you cannot beat the price!", "verified": true, "helpfulness": "0/0", "author": "Jordan Shaw"}, {"rating": 5.0, "review": "great for HDMI streaming.", "verified": true, "helpfulness": "0/0", "author": "Olivia Lang"}, {"rating": 5.0, "review": "Been using this chromecast for a few weeks now. Very easy to set up and use, slightly difficult to find instructions on how to swap wifi networks but still easy once you find them. No issues to report, shipping on time. The chromecast only supports a limited number of file types, so you may have trouble streaming from sites where you don't \"purchase\" the content, if you know what i mean.", "verified": true, "helpfulness": "0/0", "author": "tom"}, {"rating": 4.0, "review": "Been using it very frequently for HBO GO and Netflix. It really has served its purpose well. I just wish there were more apps associated with (i.e. Amazon video or iTunes). Also makes it difficult to use in hotels these days since the majority of hotels now ask you to \"login\" when the browser first starts to initiate their Wi-Fi. With Chromecast, there's no real way to do that unfortunately.", "verified": true, "helpfulness": "0/1", "author": "Love gadgets"}, {"rating": 4.0, "review": "It's nice, but no amazon prime...  also setup could be difficult for some people.  It's definitely not just plug and play.", "verified": true, "helpfulness": "0/0", "author": "Drrnhrn"}, {"rating": 3.0, "review": "I just wish it supported more apps.  You can't beat the price and convenience.  Setup takes seconds and its really easy to use.  I just hope Google expands the available apps that you can cast from.", "verified": true, "helpfulness": "0/0", "author": "Weiss"}, {"rating": 3.0, "review": "excelent", "verified": true, "helpfulness": "0/0", "author": "Angel Luis Gonzalez Olivero"}, {"rating": 5.0, "review": "One of the best smart productits turn my TV to Smart TV", "verified": true, "helpfulness": "0/0", "author": "KHALIL ALQAHERI"}, {"rating": 5.0, "review": "love this item. great for watching all my movies and youtube on my TV. Excellent purchase", "verified": true, "helpfulness": "0/0", "author": "kevin j travis"}, {"rating": 1.0, "review": "Wouldn't stream our iTunes movie", "verified": true, "helpfulness": "0/1", "author": "LisaB"}]