[{"rating": 5.0, "review": "This was the best gift ever...this allows me to watch Netflix and YouTube on my TV...it is so wonderful!!", "verified": true, "helpfulness": "0/0", "author": "Karen"}, {"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/0", "author": "Ricky  L. Morrison"}, {"rating": 5.0, "review": "Awesome way to stream Netflix on my tv. Just wish I could stream Amazon prime.", "verified": true, "helpfulness": "0/0", "author": "Kassey"}, {"rating": 2.0, "review": "This is very fickle.  It has trouble connecting to a WiFi hotspot which is only 5 feet away.  Getting a device to connect to it and show Netflix is hit or miss....  I have had this for 6 months, and rarely use it, because it can take 10 minutes to get connectivity working.  I waited to post my review, hoping a software update might fix intermittent problems.I will say that once streaming begins, it works fine.  However, sometimes it can take 15 minutes to get it connected.  Most frustrating is that frequently after watching a movie and pausing for a while to do other activities, it will lose itself and constantly have to be unplugged and reconfigured for wifi to try to get it working again.", "verified": false, "helpfulness": "0/0", "author": "Paul Fowler"}, {"rating": 5.0, "review": "Really useful to watch You Tube/ Netflix videos on your television sets. Integration of Chromecast Extension into Chrome adds on to the usability allowing user to play videos or music and even displaying images in the television by just running it on one of the tabs in chrome.", "verified": true, "helpfulness": "0/0", "author": "Jeet Harshal"}, {"rating": 2.0, "review": "setting up wasn't easy for me...if you are not tech savvy, perhaps it is not for you", "verified": false, "helpfulness": "0/0", "author": "loyang \"cat\""}, {"rating": 1.0, "review": "worked great", "verified": true, "helpfulness": "0/4", "author": "john"}, {"rating": 5.0, "review": "This works very well on any of the numerous sites that support it. Unfortunately Amazon Instant Video has taken the decision to snub the Chromecast which doesn't reflect very well on Amazon. I assume they just want to sell their Fire TV box, but instead I will probably let my Prime member ship lapse especially with the forthcoming price increase.The Chromecast is great because it sits behind the TV out of sight. It gets its power from the TV (USB port) and so it doesn't consume any power when the TV is off. It is easy to control from my iPad or my PC so that I can multitask. Great tool.", "verified": true, "helpfulness": "0/0", "author": "CGT"}, {"rating": 1.0, "review": "Just didn't like how it worked.", "verified": true, "helpfulness": "0/1", "author": "JoeG"}, {"rating": 5.0, "review": "I have no problems with this item works great", "verified": true, "helpfulness": "0/0", "author": "jorge barcia"}]