[{"rating": 4.0, "review": "I have to admit, I am well-entrenched in the Amazon universe. I have a fair amount of purchased Amazon video content, regularly watch their new release rentals, and am, of course, a member of Amazon Prime.  I also have a Netflix subscription and watch their content now and then.  Oh and I'll fire up Pandora occasionally as well.  And that's the extent of my streaming needs.  Does Fire TV live up to what *I* expected it to do? Absolutely, and then some.  I was just blow away by the *speed* of this thing. For most of the Amazon content I brought up, there was no buffering at startup.  FFW and RW on Amazon streams suddenly became a cinch to do.  There are 10 second forward/backward controls, and holding those buttons down for longer brings up a mini view of the scene in the program that corresponds to where the search is (even as you're watching the show from it's original position).  When I skipped around to different portions of a movie, there was about a 2-3 second lag before the show came back up.  The video quality of HD content is GORGEOUS, but what really impressed me was the sound. I hadn't heard my home theater system produce sound like this from streaming video in well, ever.  The voice search works as well as everyone says it does. You can even say things like \"science fiction\" and it will bring up a list of movies in that genre. I've found some hidden gems this way that I never knew about.The Netflix app is exactly the same interface as what was on my Sony blu-ray player. Some have criticized the lack of a better interface (apparently it's upgraded on the Rokus) but this is what I'm used to, so no complaints there.  You still get the scene display when searching, to help you decide when to stop during ffwing and rwing.  Be aware, though, that Amazon has not yet added voice search functionality to Netflix. When you text search from the Netflix app, though, you do still get a set of autocompleted titles on the right side of the screen, which makes it easier to find what you want.  I was hoping for the same kind of Pandora interface as is found on the Panasonic Blu Ray players (best Pandora interface I've seen yet), where you can go back and rate up to three songs after they're done playing. Unfortunately, the Fire TV is your basic Pandora player where you need to thumbs up/down while the song is playing. There is also no support for multiple Pandora accounts like there is on other players.Rumor has it that Amazon is working on an app that will allow playback of music stored on their cloud service, a feature I am eagerly waiting for, as all my music has been uploaded to their storage service for some time.  I get the feeling they'll be adding updates to this as new services are made available.Overall, the unit functions as a more dedicated Kindle Fire for the TV.  This definitely has it's perks - you can listen to Pandora while you are browsing around for movies to watch.  It's main screen has a carousel of apps and video content that you have accessed most recently (I happen to love this about the Kindle Fires, but I know it annoys some people).  You can also navigate through the menu on the home screen to get to content, or just use the voice search for anything you want to watch on Amazon.This is, hands-down, the fastest streaming interface I've ever seen (and I thought Sony's was good).  That alone, for me, is worth the cost of the unit.", "verified": true, "helpfulness": "0/1", "author": "Trillian"}, {"rating": 5.0, "review": "Everyone should buy this device! The voice recognition works perfectly, video streaming is fast, and the staggering amount of content available for relatively low cost thru Amazon Prime is awesome!", "verified": true, "helpfulness": "1/2", "author": "Ray Stout Jr"}, {"rating": 4.0, "review": "I love this thing!  Not enough apps but I'm hoping they'll be added as time goes by. I hooked it up with no problems whatsoever. I downloaded the apps from amazon.com. (It was easier to find the apps all in one place.) Just searched \"fire tv apps\". I'm very pleased.", "verified": true, "helpfulness": "1/2", "author": "Linda J Conklin"}, {"rating": 5.0, "review": "Everything Gary Bussey states it is in the commercial.  LOL!  My son loves the car racing game on there and love all the shows I watch and catch up on.", "verified": true, "helpfulness": "0/1", "author": "Hannah"}, {"rating": 5.0, "review": "I really like it, very easy to use and install, even a cave man can do it..., hmmm... you don't have to be looking channel by channel to find your favorite program, good job", "verified": true, "helpfulness": "0/1", "author": "Hector R. Montes"}, {"rating": 4.0, "review": "Love it, start up is easy, but figuring out out from there, not so cool. I took 6 yr old time to get out.", "verified": true, "helpfulness": "0/1", "author": "1024"}, {"rating": 5.0, "review": "I'm only a day into it, but I can give it some high marks right out of the box.  Installation doesn't get any easier with only two connections to make, network from the router and HDMI to the TV, then plug it in and turn it on.  I really like the voice search, saves the tedious effort required to type in terms with a basic remote and has hit the target every time so far.  Currently enjoying some older TV series courtesy of Amazon Prime, without which this box wouldn't be anywhere near as attractive.  For the price and quality this is a great alternative to cable on demand and premium channels.", "verified": true, "helpfulness": "1/2", "author": "Mark Gatzke"}, {"rating": 5.0, "review": "This is by far the best streaming box I have ever used. The titles load instantly and streaming is flawless. The voice command ability means no more lengthy typing letter by letter. I would give this 10 stars if I could.", "verified": true, "helpfulness": "0/1", "author": "Steve S"}, {"rating": 4.0, "review": "This by far a great product. My only problem with the firmware is I could not see the MAC address. It is pretty important to my network. I had to sense the network to find the MAC address. Other than this technical issue, the overall product delivers a wide range of functions and entertainmant. I recommend this product with 4 stars only because of the technical issues I had with my network.", "verified": true, "helpfulness": "1/2", "author": "David M. Shifflett \"TAZ\""}, {"rating": 5.0, "review": "I gave it a 5 for easy to hook up and easy to start watching all my favorites. Just that simple.", "verified": true, "helpfulness": "0/1", "author": "Thomas Doss"}]