[{"rating": 4.0, "review": "I like it a lot", "verified": true, "helpfulness": "0/0", "author": "Jose Luis Narvaez"}, {"rating": 3.0, "review": "no different than the rest", "verified": true, "helpfulness": "0/0", "author": "Patrick Post"}, {"rating": 5.0, "review": "Was really nice just to plug it in and works great!", "verified": true, "helpfulness": "0/0", "author": "Christa Morgan Lee"}, {"rating": 5.0, "review": "It was a breeze to setup and is very easy to use.  The video quality, even on a large screen, has surpassed my expectations.", "verified": true, "helpfulness": "0/0", "author": "D. Hargett"}, {"rating": 5.0, "review": "Made my non smart TV very smart and the voice search remote is phenomenal and very user friendly. Ease of access to fire content also seems to be improving over the short time period since adding amazon prime to my account a few months ago. Great job amazon team fire R & D.", "verified": true, "helpfulness": "0/0", "author": "dan griffith"}, {"rating": 2.0, "review": "What the device does it does well, if that makes any sense. However, it doesn't do what I expected based on questions and answers before purchase. That is why two stars. If I expected what it DOES do, would give four or even five stars - hence my comment at the very beginning of this review. I expected to be able to visit the youtube site, for instance, search and find a documentary or old movie and watch for free - this is what I am doing now on my computer. Just wanted a way to watch on my TV straight from the net. What am I missing. Maybe I am not catching on and it will do what I want. Maybe I just need to practice and get better using Amazon Fire and be satisfied if it can't do what I wanted. Has a nice appearance and easy to setup. Will not work well on wifi - using cable. Forgive my bad writing - have multi-infarc dementia. Oh well, will continue to practice using this thing. Have had device a few weeks. Thanks for this space to comment. I do like doing business with Amazon and plan to continue when necessary.", "verified": true, "helpfulness": "0/0", "author": "John Stone"}, {"rating": 5.0, "review": "I lke it a lot.", "verified": true, "helpfulness": "0/0", "author": "Rochelle Wilkinson"}, {"rating": 3.0, "review": "Mine doesn't always work. Says HDMI cable is bad, but I am on cable #3 (This one is an Amozon Basics Cable) and it still does it. Very Annoying!!!", "verified": true, "helpfulness": "0/0", "author": "Carrah McElfresh \"CMac\""}, {"rating": 4.0, "review": "Amazing quality on video and sound. To be effective and have access to movies, you have to subscribe to Amazon Prime, and even then not all things are free. It is disappointing that there is no crossover to Apple products.", "verified": true, "helpfulness": "0/0", "author": "Ralph J. Papaleo"}, {"rating": 5.0, "review": "I am so impressed: simple device, as easy to install as a flash drive; simplified control that is very responsive; useful for streaming from Amazon's library or from the major streaming services like Netflix and Hulu. And the price is awfully reasonable. I expected the Amazon Fire TV to be useful, but I hadn't hoped it would be as useful as it really is. It fills a real need now that I have told cable tv to kiss off.I do hope that I'll be able to view CBS Plus on the Amazon Fire TV in the future. But I am more than happy with Fire TV now. Thanks, Amazon!", "verified": true, "helpfulness": "0/0", "author": "D. Rogers \"Inkblots\""}]