[{"rating": 2.0, "review": "A coworker told me about chromecast and it seemed like a great solution for me, as the VGA out on my laptop no longer works. Right from the start I experienced problems with this thing. It was a pain to set up - the TV wouldn't recognize it and then I couldn't connect to it via wifi. After a few minutes I got that sorted out and it started work...for a little while. Here are the following issues I had with it:1. Half the time casting a tab or netflix wouldn't work - either nothing would show on the TV, or it would put like a place holder screen on the television (for example with PLEX player it would say \"plex player: ready to stream\" or whatever) but the video would still be playing on the laptop and not show on the tv and I'd have to totally close out of everything/reboot and unplug chromecast & plug it back in and hope it worked.2. Although I have a good internet connection, at first almost every video via netflix would open and get stuck at 0% and never load. Eventually this got better but it was REALLY frustrating.3. Every few days the television would completely stop recognizing the device; it would claim no device is plugged in to that HDMI port. For a while moving it to another HDMI port fixed it.4. After about a month it stopped working altogether and now it's not recognized in any HDMI port. I tried a reset on the device itself and now when I try to reconfigure I cannot because it doesn't show up on the TV at all.Overall, since very few things actually support Chromecast (so far) it's not really that great even if it was to work flawlessly. I would definitely use it, but it wouldn't be a 5 star product - though there is certainly potential in the future. However, as these things seem very buggy (after reading a bunch of forums trying to troubleshoot issues, it seems as though the issues are widespread) and don't offer a ton of functionality, I wouldn't recommend it. I have decided whether I even want to try for a replacement or just close the book on chromecast for now...", "verified": true, "helpfulness": "0/0", "author": "D"}, {"rating": 5.0, "review": "This thing works great. I dropped cable a long time ago, and was using bulky expensive game consoles for movies and television, via apps like Netflix and HBO GO. Chromecast is so much cheaper, and you can plug it right into the side of a wall mounted TV without needing to install a shelf, or use an entertainment stand.  I'm able to power mine through the TV USB port, but I believe some of the older TVs don't supply enough power to their USB port to actually run the Chromecast dongle. That's what I've heard anyways.  I've had amazing results with Vudu. The picture and sound are great. I've even taken it to my cousins' place, and used it on their network, and had great results there as well. Netflix quality isn't too bad. I feel like Netflix looks better on my computer than on the Chromecast display, but it doesn't bother me unless I get close to the TV. It is by far worth the cost in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Paul Hudgeon"}, {"rating": 5.0, "review": "The easiest way to convert any HDTV into a smart TV.  I use this on my Samsung LED SmartTV because it is so much easier to use!", "verified": true, "helpfulness": "0/0", "author": "Paul Baker"}, {"rating": 5.0, "review": "Great tool.  I thanked my friend who recommended it.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Thomas \"broken\""}, {"rating": 1.0, "review": "Waste of time.", "verified": true, "helpfulness": "0/1", "author": "Duncan H."}, {"rating": 2.0, "review": "I returned this because it kept freezing up on me. I have a pretty strong wifi signal, but this Chromecast kept dropping off. I decided to just get a Roku stick and keep my htpc.", "verified": true, "helpfulness": "0/0", "author": "Limogi \"diy-er\""}, {"rating": 5.0, "review": "Who doesn't love their Chromecast?It gets better and better everyday and support and new apps keep growing. Still a winner for the price!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "No problem works like a charm", "verified": true, "helpfulness": "0/0", "author": "esteban"}, {"rating": 5.0, "review": "Excellent!! Been almost a year no issues or complaints perfect for netflix, YouTube, hulu everything. Love it! Have multiples.", "verified": false, "helpfulness": "0/0", "author": "Honesty Sorlie"}, {"rating": 5.0, "review": "Wonderful! Now the family doesn't have to use my computer to watch Netflix :) Easy to setup and use.", "verified": true, "helpfulness": "0/0", "author": "DM"}]