[{"rating": 1.0, "review": "Doesn't stream content from phone like Apple TV. Nothing special about it.  Would not recommend.  If they update and add where I can show on TV anything that's on my phone, then I am in.", "verified": true, "helpfulness": "0/0", "author": "Hugo"}, {"rating": 5.0, "review": "We've been able to stream from websites, youtube and Netflix using a laptop.  Much better than I expected.  Would recommend", "verified": true, "helpfulness": "0/0", "author": "snow"}, {"rating": 1.0, "review": "I have read other reports hoping to find a fix.  But, my problem is our router!  I can't get my Verizon Fios to accept Chromecast.  I think its a battle over service provision..they'll only flip the correct switches to make this work if I pay them more money monthly, which is equivalent to \"I might as well get FIOS for TV\".  We don't watch premium TV or movies, but hoped to stream Netflix.  I guess we'll just send this back and buy a CD player that is Netflix ready and use it!", "verified": true, "helpfulness": "0/0", "author": "Kindle Deb \"Deb\""}, {"rating": 5.0, "review": "Purchased this for my daughter because she doesn't have cable and thought she could enjoy her Netflix on the tv without having to have a computer. She is happy with it.", "verified": true, "helpfulness": "0/0", "author": "Cat"}, {"rating": 5.0, "review": "The Chromecast was very easy to install, connected to my wireless with no problem, and worked from the start.  I could not install the software to my old laptop because the requirement is Windows 8, but I did not purchase it for that anyway.  For the ipad, you can only currently play Youtube and Netflix apps, but that is why I purchased it.  It works great and I would recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "gcarp222"}, {"rating": 5.0, "review": "It's very useful for several applications: watching You Tube videos, Netflix movies and series. All of them with good image quality.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "We like it for Netflix in the bedroom, not as good as the Roku in the living room.  Biggest complaint is no Amazon Prime Instant Video?  What the what?!?", "verified": true, "helpfulness": "0/0", "author": "James Cook"}, {"rating": 1.0, "review": "I bought this when it was released with the expectation of being able to stream anything I wanted to my TV, sadly you can only stream youtube and a few other things.  This was not made clear when it was initially released.  Any internet capable blu-ray player can stream more stuff than this, so it's useless to me.  I wanted to be able to stream videos and pictures directly from my phone.  FAIL.", "verified": true, "helpfulness": "0/0", "author": "Joseph King"}, {"rating": 4.0, "review": "I really really liked this but 2 days ago chrome cast did a update and it hasnt yet been working as well as it did when i first got it. I had to spend hours to get it running and still it is not working as well as it did.", "verified": true, "helpfulness": "0/0", "author": "Electa Comings"}, {"rating": 1.0, "review": "Google Chromecast will NOT work with Microsoft Surface RT Tablets.  There are NO apps available in order for the tablet to work with the Chromecast.Will return the product.  Either Google or Microsoft must create an app for this product to work.", "verified": false, "helpfulness": "0/0", "author": "ReviewKing"}]