[{"rating": 5.0, "review": "After getting a Kindle, this is just what I wanted.  Helps me take advantage of my Prime membership! Great buy!", "verified": true, "helpfulness": "0/1", "author": "psmerc"}, {"rating": 3.0, "review": "I have just received the Fire TV unit today.  After looking at what is available - not much diversity in apps.  The Roku has more free options and diversity.  The Fire TV is good if you only use Amazon Prime-Hulu-Plus and Netflix.  Does not have Target Ticket or other competing programing such a M-GO. No PBS - History Channel etc. They also forgot to add the Amazon Cloud Player as an app.  My Roku has that as an option.Right now - if you play a lot of games - the Fire TV is for you.  It does have a ton of Free games.Hopefully they will add more diversity in the Future", "verified": true, "helpfulness": "2/3", "author": "Alan Marvel"}, {"rating": 5.0, "review": "I have both a first-generation Roku and a \"smart\" tv, so I was feeling a little guilty about even wanting this device, but I put it in my cart to think about, and my husband, casting about for a birthday gift, came across it there and decided to get it for me.  I am so glad he did!  It is WAY faster than either of the other two options, and the streaming just plain works better.  When streaming content on my tv it would frequently stop in the middle of a program to rebuffer; I constantly had to try and downgrade anything I was streaming, from Amazon or Netflix,  to SD to make things even remotely watchable. With the Fire TV,  this hasn't happened at all, even when watching an HD movie. The streaming is also better on Netflix content as well as Amazon content.  I also love the speed of loading movies and tv shows, and when I remember to keep holding the button down while talking the voice search feature works great!  Also, the speed and ease of scrolling through the \"recommended\" suggestions that come up with a search has made me much more interested in looking through those results, and I have found some things that I definitely am interested in watching that I never would have known about without this.  The biggest downside so far is that when watching old, non-hd content (some of the early Inspector Morse shows, for example) on a big big-screen tv, the image quality actually looks worse when we watch through the Fire tv than when we watch directly through the smart tv.  I have no idea why that would be, but it's definitely noticeable.  Still, that's not enough to knock any stars off.  For something I wasn't sure I would even find a legitimate use for, this gadget has certainly made a great impression on me!", "verified": true, "helpfulness": "0/1", "author": "K. Shankman"}, {"rating": 1.0, "review": "The wifi setup worked and after it downloaded the updates I got stuck at a blank screen. There was not support for this problem so returned it.", "verified": true, "helpfulness": "9/14", "author": "Jonathan Lee-Russo"}, {"rating": 2.0, "review": "I sold my Apple TV 3 to give the Amazon Fire TV a try. Here are my results:1. Packaging - comes on a nice small box. 5 Stars *****2. Set Up - set up was simple to do, the on-screen keyboard is ok, they have added many of the email services like .gmail.com, yahoo.com, etc. It connected to the network fine. - 5 Stars *****3. Interface - clean, but not as good as the amazon app on the Xbox 360. Very hard to find prime movies and shows. They have included both paid and prime versions in the same interface, so it appears that they want you to rent/buy the shows instead of having a dedicated Amazon Prime shows box. 3 Stars ***4. Purchased Amazon Videos - I have purchased some shows in the past, so trying to get to them was an unpleasant experience. I tried to go to the show I bought (i.e. Season 3, episode 11) and I had to go to Owned Videos, scroll and look for the show, then scroll and find the correct season, then scroll through the episodes that I do not own until I was able to find episode 11. This of course is very unappealing since I already know what I own and not own. 2 Stars **5. Hulu - The Hulu interface is not as good as the Apple TV, but the worst part is that the video keep freezing, although the audio keeps going, I had to continuously stop the playback, then go back to the show. 1 Star *6. Hardware - the best out there, 5 Stars *****Overall experience - Although other apps like Netflix and Plex worked as design, I was not happy with the interface experience. You can fling your videos from your Kindle Fire HDX tablet, but not with the Kindle Fire HD. That is very pathetic in my opinion. I usually like and support Amazon products, but this one is not for me. 2 Stars **", "verified": true, "helpfulness": "4/5", "author": "J. Sanchez \"Josh\""}, {"rating": 4.0, "review": "Now that I am able to access Netflix as well as Amazon Prime Instant, I enjoy using it,  It is convenient to be able to use something other than my laptop to access my streaming accounts.", "verified": true, "helpfulness": "0/0", "author": "Cecelia Wisdom"}, {"rating": 5.0, "review": "Works great right out of the box. Easy to use and fast response times make this box an excellent choice for streaming video. Voice Recognition works great! Would definitely recommend. Looking forward to more apps and movie choices.", "verified": true, "helpfulness": "0/1", "author": "Cacheonly"}, {"rating": 5.0, "review": "best product i have purchased in years.  easy setup.  simple remote.  can access everything.  i HIGHLY recommend this to anyone who would like to expand beyond just cable.  owning it feels like you have the movie, gaming, app, television, and etc worlds at your finger tips.", "verified": true, "helpfulness": "2/3", "author": "Kathleen M. Monnin \"dr. katie monnin\""}, {"rating": 5.0, "review": "Love this new device.  We have an Amazon app on our Smart TV, but the Fire is easier and more fun.  We also take the Fire with us when traveling.  Most TVs at motels don't let you use smart TV apps if they have one.  This little device cuts through all that.  Great!!!", "verified": true, "helpfulness": "0/1", "author": "J. Lykins \"Doc\""}, {"rating": 4.0, "review": "There needs to be a tab that ONLY has all FREE movies and a tab that has ALL FREE TV shows.  I feel like you are not fixing this easy issue because many may accidentally buy some content or maybe just buy it on purpose because they are tired of trolling through the thousands to find free instant videos.  We pay our yearly Prime fee, we bought Amazon Fire and pretty much buy everything from Amazon that isn't food; so please listen and fix this annoying issue, stop \"hiding\" your free content from us/all loyal Amazon customers.  5 Star rating pending until easily fixable issues are resolved.Now, after that issue I will have to say that I love the Amazon Fire!  Setup was a breeze, I am running on WiFi about 15 feet away from my router (1st Floor) and I have not experienced any lags or connection issues...Well I have but that's a Comcast issue and this is neither the place nor the time to start up about them.  The voice search function seems pretty flawless thus far.  I haven't signed up for Netflix/Hulu yet but the issues I read in other reviews would be an annoyance of the search only working for Amazon videos.  So hopefully they will fix that issue as well.  The remote feels great in the hand and the footprint of the box itself is minimal.  I have high hopes for the future of this device and Amazon itself, and I believe they WILL deliver!", "verified": true, "helpfulness": "5/6", "author": "Ryan P."}]