[{"rating": 5.0, "review": "Simplicity, ease of setup and quick installation.  More importantly the HD streaming player for the lowest possible price from Google.", "verified": true, "helpfulness": "1/1", "author": "naraynar"}, {"rating": 4.0, "review": "A great value for money, will move ur simple HD enabled devise to a smart TV, (actually all what you need from a smart TV is YouTube ) and this device do it in a marvelous wayPros:1- great simple and effective package that give u all what you need to start streaming.2- a nice IOS application to help u setting the device up in 2 minutes (really I did it )3-it does not drain your battery of the iPad as it only starts the video form the iPad but it use the wireless network to stream not your device (as some smart tv does)4- you can plan a tv queue that will fill your day with highly selected by you watching materialsCons:1- it has to be connected to electricity or USB cable (not a big problem but the video gives u the idea that u will not need that )2- only YouTube from iPad (we don't have Netflix here.The missing star is only to push them to make an update to allow more application to pair", "verified": true, "helpfulness": "0/0", "author": "Dr. Ahmed Salem"}, {"rating": 5.0, "review": "BEST THING EVER INVENTED!!!!!!!!!!!  GOODBYE $400 FOOTBALL PACKAGE EACH SEASON!!  STREAMS ALL ONLINE CONTENT FROM PC OR IPAD DIRECTLY TO THE TV!!", "verified": true, "helpfulness": "1/3", "author": "NJ Mom"}, {"rating": 1.0, "review": "For $5 more you can get a Roku LT which supports Netflix, Hulu, Amazon, Vudu, Redbox, Blockbuster, Crackle, PBS, Spotify, Mog, Pandora, Tunein just to name a few! And it comes with a remote, or you can use your smartphone / tablet just like the Chromecast.  The Chromecast has Netflix, Youtube, and a-la-carte Google play. VERY limited and lot a good buy comparatively.Roku 2450D LT Streaming Player", "verified": false, "helpfulness": "5/14", "author": "Tim A. Lucas"}, {"rating": 3.0, "review": "I order on the second day. Found out that i won't be getting it till December 2013. I got an email 4 week later revising the shipping date. Just received it after 6 weeks. Late delivery is not Amazon's fault. Factory was backordered due to heavy demand.Did not get the free netflix trial as advertised.Overall the product is good for youtube streaming. That's it. Currently it is only a one-trick pony. Can't do anything else.Can't stream local user owned content like music, vidoe and pictures. Third party app support is very lacking .What is most concerning is that, google is trying to limit outside content being streamed, i don't know why? I want to stream the pictures I took not the movie I buy from play store.", "verified": true, "helpfulness": "0/3", "author": "O.F"}, {"rating": 4.0, "review": "I ordered this device the first day it was launched - which included the 3 months free netflix subscription. So my total cost of ownership was $11 only, and in that respect it was an awesome device. The Google Cast support in YouTube and Netflix apps is pretty good, and the quality of streaming is as great it can be. Wish 'casting' a tab on Chrome from you laptop would as flawless as playing youtube/netflix content, but this depends on a lot of other factors so I wont really hold it against Chromecast per se.So for a 'beta' - version 1.0 product, I was pretty satisfied with it overall, and use it exclusively to play web content on my TV.I prefer using the Chromecast over the in-built apps in my TV/DVD/Receiver.Version 2.0 needs a couple of things fixed- Re-configuring the device after the first time setup is a pain. I would need it to be powered off and connect to it using its wireless network , but that drops of more often than not. This needs to be fixed- This might be an App issue  but the Netflix app on iOS needs to improve for better playback/integration with the device.- More apps/content providers need to use Google Cast. I wonder what it would take for, say, shows like Daily Show to enable streaming to ChromeCast? A lot of potential for that sort of integration, I hope it happens.", "verified": true, "helpfulness": "0/0", "author": "ramesh"}, {"rating": 4.0, "review": "I recently received my Chromecast and am connecting it using my Onkyo receiver.  I've plugged it into the HDMI port and change the input on my TV to find the device but it can not be located.  Has anyone else tried using this device through a receiver and not the TV?I plugged it into another TV and it worked perfectly!", "verified": false, "helpfulness": "0/0", "author": "na120782"}, {"rating": 5.0, "review": "This replaced my media computer for netflix.  Much better to use an interactive touchscreen as a netflix remote.  This WILL be the future.  Mark my words.  Soon it will just be built right into TV's.", "verified": true, "helpfulness": "0/1", "author": "Kyle"}, {"rating": 1.0, "review": "can't connect. I don't have internet connection in my house, but I have a hotspot in my phone. I use this hotspot if I go internet anywhere. I tried it hook with this chromecast but to no avail.", "verified": true, "helpfulness": "3/10", "author": "Leonel Celicious"}, {"rating": 5.0, "review": "I gave up cable a few months ago and hooked my computer to my TV using an HDMI cable.  Although this worked great, I was thrilled to have a wireless option.  Chromecast was easy to set up and use and its great value for money.", "verified": true, "helpfulness": "1/1", "author": "Shredded"}]