[{"rating": 5.0, "review": "I plugged it into the TV and set it up on my wireless network in minutes and was watching TV from chrome.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "work great and a good price too thanks", "verified": true, "helpfulness": "0/0", "author": "Jim C. Bristow"}, {"rating": 4.0, "review": "This little dongleStreams everything in your houseDongle, hee hee hee", "verified": true, "helpfulness": "0/0", "author": "Adam B."}, {"rating": 5.0, "review": "As advertised", "verified": true, "helpfulness": "0/0", "author": "Richard Armstrong"}, {"rating": 5.0, "review": "Love this Chromecase! I bought to use in the living room with iPad and it works seamlessly. It does slow down if the internet is slow just like it would if I was watching on the computer but for the price, you can't beat it!", "verified": true, "helpfulness": "0/0", "author": "Carly White"}, {"rating": 2.0, "review": "Not user friendly. Does the same thing my apple TV does. And I don't care for the apple TV at all.", "verified": true, "helpfulness": "0/1", "author": "James"}, {"rating": 5.0, "review": "Suck it, Apple TV.  Works great!", "verified": true, "helpfulness": "0/0", "author": "C. Estes"}, {"rating": 3.0, "review": "Cool technology. Works as it claims. Easy 5-min set-up. But the service still seems to be in beta stage. After weeks of usage, I found that connecting my Mac directly to my TV through HDMI cable actually works better. The streaming to the Chromecast took a lot of bandwidth I feel. Sometimes the connection or sync did not work after the TV was off and turned back on. However, I am looking forward to its future development.", "verified": true, "helpfulness": "0/0", "author": "Andrew H"}, {"rating": 5.0, "review": "This works great once you learn how to use third party programs to cast to it.  The picture and sound are fantastic.The only negative is that is seems to get a little to hot while plugged into its power supply.  I unplug it after each use.", "verified": true, "helpfulness": "0/0", "author": "Kaimuki"}, {"rating": 5.0, "review": "Getting rid of my apple TVs.. Chromecast does it all and more,, much faster", "verified": false, "helpfulness": "0/0", "author": "Daniel"}]