[{"rating": 3.0, "review": "Cool device but without a way to turn it off, I don't feel as though I have complete control of it...", "verified": true, "helpfulness": "0/0", "author": "Vince Nicholes"}, {"rating": 3.0, "review": "Still trying to figure it out; does not play for me when the controlling laptop is closed.  Setup however was pretty simple.", "verified": true, "helpfulness": "0/0", "author": "Ayla Senol Wolfe"}, {"rating": 5.0, "review": "We bought this hoping to get rid of cable and it does the trick perfectly. It can stream anything that is compatible: youtube and hulu for example. It can also stream the screen of a chrome book (albeit , not crystal clear). I have heard that it is in the works for Amazon prime streaming to be added as available and that would make this the perfect tv substitute.", "verified": true, "helpfulness": "0/0", "author": "Nicole DeShazer"}, {"rating": 2.0, "review": "It was hard, no impossible to setup with my Galaxy S4. I had to use my old Droid 3 to set it up, and I had to find a good apps to be able to share my videos on my TV. Luckily I am an engineer, any other person would have given up and return it.", "verified": true, "helpfulness": "0/0", "author": "Hugo A Martinez"}, {"rating": 5.0, "review": "What can I say, this how turned 2 of my non internet tvs into internet tv's.  Just know that if anyone else is hooked up to your wifi and has the chromecast app, they will see them and be able to control them.  Lock down your Wifi.  Great for google play, youtube, HBOGO and a few others.", "verified": true, "helpfulness": "0/0", "author": "05on20s"}, {"rating": 1.0, "review": "Worked fine with picture, but no sound, even though I had everything configured properly. Tried to get tech support, and like Comcast Google just passes it off to consumers to help each other solve problems or they outsource to people who don't have anything to do with Google. So for me, Chromecast is worthless. So is Google support.", "verified": false, "helpfulness": "0/0", "author": "DVD reviewer"}, {"rating": 5.0, "review": "I love my Chromecast and can't wait to see what else Google comes up with to make this thing even more valuable. What a great idea to ditch the clunky remotes and use the smart devices we all carry with us. Even the occasional bugginess of this isn't going to detract from my review because I bought this knowing it was a very early device that would need some time to become more stable and capable. Google has been updating and improving it regularly and I'm seeing a variety of new apps supporting this platform.", "verified": true, "helpfulness": "0/0", "author": "ifGeek \"caldjeff\""}, {"rating": 5.0, "review": "Pros----Price-Quality-Portable-Plenty of popular apps (Netflix, Hulu plus, Youtube, RealPlayer Cloud, Plex, etc)-Does not need to be constantly connected to a device to streamCons----Interface in the apps while casting aren't always the best experience (based on app experience)Bottom Line: I highly recommend this. The apps for this (vs smart tvs and the Roku) seem to work better.", "verified": true, "helpfulness": "0/0", "author": "Bernard"}, {"rating": 4.0, "review": "I like the product so much that I own three of them. I wish there were more available networks, but it certainly does for me what it needs to do.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "AMAZING, I watch almost everything on this.Here are the facts--you have to have wireless-- the chromecast connects to your wifi and then your device (ie iphone, computer, ipad) also has to connect to the wifi for this to work, works fantastic with my Mac, you HAVE to use GoogleChrome browser though.Stream Hulu, Netflix, AmazonPrime, YouTube AND everything else (including all other streaming sites).", "verified": true, "helpfulness": "0/0", "author": "Maria Vershvovsky"}]