[{"rating": 2.0, "review": "Was super excited to get this to use for playing videos out of the browser on my laptop... Well it doesn't work worth a damn with a computer... had to reconfigure my PC and my router to get it to work. Tried to watch videos via the tab cast and it's worthless... google play music, same deal nothing but glitchy fragments. Works fine going back to just laptop speakers. None of the windows 8.1 dedicated apps for streaming services appear to have the cast button (though I could just use my ps3 for this purpose). I don't have any tablets or phones to test it with because my kids break the charge ports quicker than I can buy them so I haven't tested on an android device. Really I just wanted the browser cast for doing the stuff that my other devices that stream won't but it's a seriously lacking feature. Maybe after some more software updates and after tab casting comes out of Beta it won't suck. Overall I'm extremely dissatisfied but for $30 I guess I got what I paid for. Fix the tab cast so it actually works and it would be worth the money spent.", "verified": true, "helpfulness": "0/0", "author": "John/Cue\\Publik"}, {"rating": 3.0, "review": "it's pretty good. I'm just having trouble with the $20 google play credit it promised to come with. I sent an email and followed the directions thinking I'll get a code  or something but to my surprise NOTHING! i sent another email and still haven't heard from them..", "verified": true, "helpfulness": "0/1", "author": "Mayday06"}, {"rating": 1.0, "review": "None of the features I've tried have worked at all. Just plain doesn't work.", "verified": true, "helpfulness": "0/2", "author": "Connor"}, {"rating": 5.0, "review": "I LOVE my Chromecast! Took a little reading online to figure it out but now I wouldn't want to be without it!!", "verified": true, "helpfulness": "0/0", "author": "J. Caudill \"Twisted pOdder\""}, {"rating": 5.0, "review": "Chromecast is so useful, I use it in the rooms where I don't have a roku or wii to watch streaming content on my tv. Good value.", "verified": true, "helpfulness": "0/0", "author": "Monica"}, {"rating": 5.0, "review": "I love my Chromecast, this is the second one I buy. Great for casting Netflix, HBO Go, etc. Best thing for the price!", "verified": true, "helpfulness": "0/0", "author": "LPfanUSA"}, {"rating": 3.0, "review": "It's my personal preference to have a real remote and an on-screen menu rather than cluttering up my tablet with apps.  I know there is a way to use Prime with Chromecast, but with Roku 3 I don't have to jump through hoops to get it.  The Chromecast is better casting PC and tablet screens, and is much cheaper than Roku 3.  Either one will work with most channels and your preference may be different.", "verified": true, "helpfulness": "1/1", "author": "T. ONeil"}, {"rating": 5.0, "review": "Able to stream anything from laptop,tablet and phone. It's pretty sweet", "verified": true, "helpfulness": "0/0", "author": "ricky vega"}, {"rating": 3.0, "review": "Need to access more apps  like Google  search", "verified": true, "helpfulness": "0/2", "author": "ramzi aljamal"}, {"rating": 2.0, "review": "This seemed to play havoc with the wireless network connections of other devices. I am not sure if it was something I did, or location, or what, but I returned this and the problems went away.", "verified": true, "helpfulness": "0/0", "author": "Timothy M Schneller"}]