[{"rating": 5.0, "review": "Fulfilled all the expectations that i had.Its very easy and came in perfect condition at time.I recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Diego Núñez"}, {"rating": 5.0, "review": "Now I can watch Hulu and Netflix on my TV!!  Love \"casting\" off from my laptop and from my phone, too.!!!", "verified": true, "helpfulness": "0/0", "author": "Leon"}, {"rating": 5.0, "review": "VERY USEFUL PRODUCT. NO NEED TO PAY FOR SMART TV BIG BUCKS.I WILL RECOMMEND IT. CONNECTS ALL YOR DEVICES. GREAT.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Ula Z.\""}, {"rating": 1.0, "review": "I bought this unit back in September 2013. It has very little content available to stream, and the content that it can stream does not work well.  I have tried to stream online through the Chrome browser and any video is grainy, choppy, and the audio is out is sync with the video. I had high hopes, but alas it just sucks. I am sorely disappointed. This was with my Surface Pro as well as other PC laptops.", "verified": true, "helpfulness": "2/3", "author": "R. Freestone \"Phone Monster\""}, {"rating": 1.0, "review": "Set up appeared easy, I got the video to go to the TV, but I could not get the audio to work.  Very frustrated.", "verified": true, "helpfulness": "1/2", "author": "Garret Q Seevers"}, {"rating": 5.0, "review": "My husband and I love this product.  If there are things on your phone that you want to see and hear on the tv, you just put this on your tv, and voila, send the image, music, etc., from your phone to your tv!  It's awesome!", "verified": true, "helpfulness": "1/1", "author": "John Shadel \"Johnny B\""}, {"rating": 5.0, "review": "After a little frustration setting it up, I was off and running. Want to put on a show for my daughter? Bam. A few taps on my phone and she's set up. Get some work done while watching Netflix? Easy.With it being now open to developers, I can't wait to see what I'll be able to do next", "verified": true, "helpfulness": "1/1", "author": "JHill"}, {"rating": 5.0, "review": "The Chromecast is a brilliant idea. Let the Android or IOS apps control the media, and then direct the Chromecast to stream directly without interference (or battery drain) from the device.I've taken to listening to Pandora, Google Play Music, watching Netflix, HBO Go on the Chromecast, and I think the HD picture quality from Netflix is even better on the Chromecast than on my Samsung UN40ES6150 TV. Perhaps it's because the antenna is exposed.By itself, Google feeds this with beautiful HD still images, and a clock. The Android app now asks for rough location data, so I'm hoping -- c'mon Google! -- that I can customize my Chromecast's \"screensaver\" mode with local weather, traffic to a specific location (\"work,\" based on my Google Now cards?), etc. Just as options, mind you.You need to plug it in to a 1A USB port (not 500mA like PC USB ports) on your TV, or ... use the included charger and longer microUSB cord. A short one is provided in case your TV does have a higher power USB port.For $35 this is a great way to stream content on an HDTV that doesn't have the smart apps (or a streaming disc player, or Roku) to get. As a simple music player (Songza, Pandora, Google Play Music), the Chromecast is great.Now we just need MORE APPS to support the Chromecast...!", "verified": true, "helpfulness": "0/0", "author": "D.B. Spalding"}, {"rating": 5.0, "review": "Chromecast is extremely useful for me.  I like watching Netflix/Youtube a lot and this makes it possible to quickly stream on my HD tv.  I love that the volume is switched to the television.  There is NO compromise of picture quality or sound.  The picture and sound are so clear that I prefer using it instead of my laptop.  The only problem with the device I have is that Java is not supported.  Therefore when I want to cast a Java encrypted animation or something or play games, it won't show up on the screen.  I'm sure they will work on these things to improve though.", "verified": true, "helpfulness": "1/1", "author": "Joe Rhodes \"JR\""}, {"rating": 4.0, "review": "This is a very clever gizmo and has made our master bedroom TV available to Netflix, etc. for just $35.  Only reason I gave it four stars is because I have to \"cast\" to the TV from my laptop (we don't have a smart phone) which is in another room (my office) across the house.  Yeah, I could move the laptop into the bedroom so we can pause, change shows, etc. at bedside.  However, setting up the machine on a folding tray every time we want to watch something in the master is just as inconvenient as my having to step into the office to do the same.  We still like the device no matter the inconvenience.", "verified": true, "helpfulness": "1/1", "author": "Steve Frenzl"}]