[{"rating": 5.0, "review": "Great way to stream movies, youtube or your favorite site online from your computer to your TV - I would recommend this product to anyone", "verified": true, "helpfulness": "0/0", "author": "Heather Schuller"}, {"rating": 4.0, "review": "I personally liked it overall.  I use google chrome for my web browsing and so I added the extension for Chromecast.  I can play videos for about 3 hours fairly well.  Every once in awhile the audio and video will be off sync.  I have not found a resolution for it yet, but it is a rare occurance.Video quality is good, not excellent.I do like that I can go on chrome and use the T.V. for my web browsing.  It's stable for a long time as long as I'm not doing excessive videos.The initial setup was a little confusing, but once I was clear on the instructions it went well.Overall good purchase for what I do.  I would like to see more apps from the factory.  And an option for the Kindle fire would be nice too.", "verified": true, "helpfulness": "0/0", "author": "truckin727"}, {"rating": 1.0, "review": "I was hoping this would be like running any android apps directly on your TV - but all it does is mimic what you have on your Google Chrome browser - which is a complete waste of money - on top of that most of the time the mimic of chrome is unsuitable for TV and becomes redundant as you still have to have the laptop/computer to browse.Most TV's that have HDMI input are likely to be already smart so its pointless to use Chromecast to run Netflix and Youtube ( being the main popular apps) as they are already available on most smart TV's.Finally, a couple of my computers just failed to see the Chromcast on the network and the help was useless!This is a waste of money - period!", "verified": true, "helpfulness": "1/5", "author": "N. SAYED \"let_it_be\""}, {"rating": 1.0, "review": "Quality sucks when transferred to your tv. It is blurry and delayed. It also losses connection with your device frequently. Tried to make it work a few times and now I will never use it again.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Love the new Google Chromecast. It's super easy to setup and use and beats having to hook a laptop up to HDMI. Also much more affordable and less hardware required than alternative systems like Roxee, Google/Apple TV, etc.I live in a loft with five other friends so having this makes our lives much easier as we can all download the Chromecast app on our respective smartphones/tablets and connect to the Chromecast device. We have Netflix/Hulu+ subscriptions and this allows us to easily control what's playing on the TV in the living room from any of our devices.Only issues I've encountered are with casting from browsers - it tends to be a little laggy and sometimes crashes.", "verified": true, "helpfulness": "0/0", "author": "Jason Wei"}, {"rating": 5.0, "review": "...for a great price.  It is easy to set up and functionality is a breeze.  I would definitely recommend this product to others without hesitation.", "verified": true, "helpfulness": "0/0", "author": "Michael J Ruel"}, {"rating": 5.0, "review": "Bought as a Christmas gift, recipient very happy with it.  I received it very promptly as well.  Check your tv for the fit, however, might be a tight squeeze..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Jim\""}, {"rating": 2.0, "review": "WELL THIS ITEM DID NOT WORK FOR US...CAUSED A HELL OF A VIRUS..SENT IT BACK ..IT IS A GOOD IDEA..IT MAY WORK FOR OTHER'S..GOOD LUCK", "verified": true, "helpfulness": "0/2", "author": "SWEET ELLA MAY"}, {"rating": 5.0, "review": "I bought two: one for upstairs TV and downstairs too. Hook up to your app for watching whatever, and BINGO!Love this thing.", "verified": true, "helpfulness": "0/0", "author": "Ernie Z. Wood \"Philobook\""}, {"rating": 5.0, "review": "I purchased one for myself, immediately after it was announced, and LOVE it!  I use it with Pandora, Google Play Music, Hulu and Netflix...I also purchased Avia for streaming local media.  It was incredibly simply to set up, and a breeze to use.  The genius here is that they TOTALLY separated the user interface from the display device!  All of your controls are on the smartphone or tablet, yet the content streams DIRECTLY to the Chromecast (not going from your phone).  This frees your device to do other things...and saves on battery life.  Also, say you are at home with your girlfriend, start watching a movie, but then have to leave...your girlfriend can still continue watching the show even if the phone isn't present!Picture quality is OUTSTANDING...I have never seen Hulu look as good as it does here!  Same goes for Netflix and YouTube.I bought 4 of these as gifts for family this Christmas...and just bought another for my brother who just moved into a new home.  I can't recommend these highly enough!  Get one, you won't regret it (especially at $35!)!", "verified": true, "helpfulness": "1/1", "author": "John Nemesh"}]