[{"rating": 5.0, "review": "excellent product", "verified": true, "helpfulness": "0/0", "author": "carlos carreño"}, {"rating": 5.0, "review": "I use it daily", "verified": true, "helpfulness": "0/0", "author": "Good Granny"}, {"rating": 2.0, "review": "Never worked.  Was unable to get replacement from Google.  Finally gave up.", "verified": true, "helpfulness": "0/0", "author": "John706"}, {"rating": 2.0, "review": "Its been around for a while and the apps list for this is growing however the Amazon TV stick is way better", "verified": true, "helpfulness": "0/0", "author": "jose"}, {"rating": 5.0, "review": "Arrived just in time for Mother's Day and my mom loves it! She can easily watch all her favorite movies directly from her phone. She's not very tech savvy and is intimidated by 'technology' but she quickly learned how to cast her favorite Netflix shows to the TV.", "verified": false, "helpfulness": "0/0", "author": "Lasers"}, {"rating": 5.0, "review": "This is one of the best purchases I have made all year. I pair this up to my laptop and also my cellphone so that I can watch Netflix videos, you tube, look at pictures, home videos, and you name it right on my television screen. I am one happy and satisfied customer. You have to have wifi to make it work though.", "verified": true, "helpfulness": "0/0", "author": "Alan Whitmoyer"}, {"rating": 5.0, "review": "I love this device. I purchased this one for use in my classroom at church. Very user friendly and good quality streaming!", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 1.0, "review": "I bought one of these for me and one for my parents. The amount of times I have had to reset BOTH chromecasts due to issues is ridiculous. It constantly disconnects from my router for no reason, even after I optimized it. I had to optimize it by sitting with google on the phone for hours. Then I come back home to my apartment complex. If you live in an apartment complex where you cannot reach the router or change its settings, DO NOT BUY THIS PRODUCT. It never worked due to connection issues, and when i called google for tech support they told me they cannot refund my money. I highly advise looking for alternative products on the market. I love google but I have never in my entire life had such a bad experience with a product continuously. I tried ROKU instead, worked instantly with no problems. Please buy any other product on the market, not this horrible \"BETA\" product.", "verified": false, "helpfulness": "0/0", "author": "Kevin Thomas"}, {"rating": 3.0, "review": "It's great when it doesn't freeze up. This seems to happen after watching for 3 or 4 hours. Since I mostly use the chromecast, it freezes up several times a day. :/", "verified": true, "helpfulness": "0/0", "author": "Karen Pratt"}, {"rating": 1.0, "review": "WORKED FOR ONLY A FEW WEEKS THEN DIED..! buy it at a store where you atleast have a 90 day warranty", "verified": true, "helpfulness": "0/1", "author": "Lonya"}]