[{"rating": 5.0, "review": "optimal solution for intelligent TV", "verified": true, "helpfulness": "0/0", "author": "Adilson divua Francisco \"Adilson Divua Franciscp\""}, {"rating": 5.0, "review": "Google made a  good product.I like this because I can watch almost anything from my tablet or cell phone to my tv without any buffering.My two year old son loves it's work the most.", "verified": true, "helpfulness": "0/0", "author": "Md Quamrul Huq \"Rimon\""}, {"rating": 5.0, "review": "LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Shannon S Jones"}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "Nedim Soybas"}, {"rating": 5.0, "review": "Great! I used to have an AppleTV, but the Chromecast is so much more practical for daily use. Turn on your TV and it's there. Perfect. I would like the Chrome browser tab streaming to have a better quality (lags most of the time), but that's probably my netwotk's fault.", "verified": true, "helpfulness": "0/0", "author": "Emanoel Barreiros"}, {"rating": 4.0, "review": "You can cast whatever is in chrome browser.. And some apps.. No more than that", "verified": true, "helpfulness": "0/0", "author": "KAVIN RAJ RANGASAMY DEVARAJU"}, {"rating": 4.0, "review": "Does what it is supposed to but I would recommend a roku over this", "verified": true, "helpfulness": "0/0", "author": "Oniel Dixon"}, {"rating": 1.0, "review": "A couple of months ago bought these items, now unfortunately the day was going to use for the first time, I realize that both do not work", "verified": true, "helpfulness": "0/0", "author": "José Alexander Orellana Díaz"}, {"rating": 5.0, "review": "it depends the version of the tv, i bought two but in of the tvs it didnt work cause it was old (like 2009 samsung lcd tv) but the most tvs it worked perfectly", "verified": true, "helpfulness": "0/0", "author": "Luiz Araujo"}, {"rating": 1.0, "review": "Less than 3 months after purchasing the Chromecast it died, now it only has the redlight, reset did not work, tried all the google support steps and nothing, there is only a black screen with the text \"Chromecast...\" .I'm a very dissapointed customer that will think more carefully before purchasing another google hardware product.I live in Costa Rica so it's more expensive and tiring to try to return the non functional device.", "verified": true, "helpfulness": "0/0", "author": "Guillermo Salazar"}]