[{"rating": 4.0, "review": "Is great to see your pictures in HD with excellent sound, wireless. Right now Chrome cast is limited to a few applications as Netflix and YouTube. As soon as new apps will be adapted, it will be really usefull.", "verified": true, "helpfulness": "0/0", "author": "Alberto"}, {"rating": 4.0, "review": "Works great with iPhone.  YouTube and hbo go work flawlessly.  My only complaint is chrome is needed if you want to connect on a website.  More apps are needed to support this.", "verified": true, "helpfulness": "0/0", "author": "RDS"}, {"rating": 4.0, "review": "I think it needs more supported apps (ie. video player and photos viewers) for mobile and computer in all platforms.", "verified": true, "helpfulness": "0/0", "author": "Marwan Hamza Khayyat"}, {"rating": 2.0, "review": "It has lots of limitations. Can not use chromecast extension with nexus 7. Limited channels. But pictures are clear and and crispy. Wish they also have a remote for this like roku.", "verified": true, "helpfulness": "0/1", "author": "john234"}, {"rating": 4.0, "review": "It works 98% of the time. There have been instances where it had trouble streaming Netflix off my phone. I have had to turn off my phone or disconnect (reboot) the Chromecast to get it to stream.", "verified": true, "helpfulness": "0/0", "author": "Shawn S."}, {"rating": 4.0, "review": "Got this for my roommate. The sounds and visuals work for her tablet and desktop, but for some reason on my 13\" Macbook Pro, the sound is only on my laptop and not on the TV. Still trying to figure out how to fix that problem, but it works fine on the other devices.", "verified": true, "helpfulness": "0/0", "author": "Nicole Lynn Cloar"}, {"rating": 4.0, "review": "I purchased this to use in our apartment in Slovakia with a VPN router and US VPN service - (rather than pay for cable that is not in English0. It works well with my I phone, I pad and computer also with my Android phone. It could use more apps for expanded services but you can use it with Rabbit TV running on Chrome to access a lot of internet content. The setup is very easy.", "verified": true, "helpfulness": "0/0", "author": "LMD"}, {"rating": 3.0, "review": "it is a great sleek design product,set up is easy and flawless function for the apps it is designed!pros:does not support Amazon instant streaming!!!!does not stream personal movies stored in the computer,or owned DVD,or blue rays!!!other wise it is a great dongle!", "verified": true, "helpfulness": "0/1", "author": "hugh serski"}, {"rating": 2.0, "review": "I was too excited when it came to me but I was never able to steam in 720p . Only 480p  . Even that was not a great experience. Moreover the entire screen casting experience in beat version was horrible. I believe the product is good but it needs time to mature", "verified": true, "helpfulness": "0/0", "author": "Pankaj"}, {"rating": 5.0, "review": "We've bought seven Chromecasts.  Four are used and home and the others were stocking stuffers.  Everyone found they are easy to connect after watching a few YouTube videos.  Not one has given any of ours or other family a problem.  Easy to clear and setup at work in a pinch for a meeting.  Way to go Google!", "verified": true, "helpfulness": "0/0", "author": "Terry Mundy"}]