[{"rating": 1.0, "review": "On the Fire TV, the \"internet\" connection is dropped constantly on Netflix and Plex apps, but Amazon Prime Video always runs perfectly.  I've used both wifi and ethernet connectivity and still have the same symptoms. My iOS, Android, and LG TV apps run without these \"platform\" issues.So if you like Amazon video services, it works flawlessly.", "verified": true, "helpfulness": "0/3", "author": "Harry"}, {"rating": 5.0, "review": "This is a great replacement for cable.  Family enjoys it,", "verified": true, "helpfulness": "0/0", "author": "anon"}, {"rating": 4.0, "review": "Fast deliver, having trouble with remote had to push really hard down", "verified": true, "helpfulness": "0/0", "author": "Jcthunderbird"}, {"rating": 5.0, "review": "Great Job Amazon, the Fire Tv is not bad at all.Only gripe I have is that Amazon does not work in Australia. I even got an online American Visa and still they wont take my money, crazy stuff.I modded mine to run XBMC which it does very well.The remote is one of best on the market, love the feel of it. The voice search works, but the whole search engine falls apart because it only searches Amazon content, disappointing. Roku's search absolutely kills it in this departmentYes it plays games, does that interest me? No.If your in the States go for it, live anywhere else in the world probably stick with the Roku", "verified": false, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "So far we love our Amazon Fire.  Super easy installation and ease of use make this great for any one.  We are more \"mature\" than some who may purchase this so if we can get so much out of it so quickly I would recommend it for every age.", "verified": true, "helpfulness": "0/0", "author": "Judy Migliorisi"}, {"rating": 2.0, "review": "To say that I'm extremely under-impressed would be an understatement. It's fast and snappy, but overall I dislike the interface, the stability, and compatibility issues with the iOS apps available. I cannot control this unit using my iPhone like I can with my Roku. That means I have to keep a pile of remotes next to me at all times. Lame.", "verified": true, "helpfulness": "0/1", "author": "misesludwig"}, {"rating": 5.0, "review": "Very intuitive!  I am an Apple fanatic and although I would never get rid of my AppleTv I love having the companion.  Many so that I can get Amazon Instant Video!", "verified": true, "helpfulness": "0/0", "author": "Jeffrey"}, {"rating": 5.0, "review": "I am enjoying watching programs from my Amazon Prime. The box and remote arrived safely and well packed. It was easy to set up and start using on my TV, once I purchased the cable that you need. Amazon, you should make a point of explaining that you need to purchase the cable for it.", "verified": true, "helpfulness": "1/1", "author": "JoT"}, {"rating": 4.0, "review": "I like it, the only thing about it is that in order to watch season's of shows you have to pay for them when netflix is Free you just subscribe to netfix and all movies and season's are Free. I dont like that you have to subscribe to different channels in order to watch.", "verified": true, "helpfulness": "0/1", "author": "Renee"}, {"rating": 5.0, "review": "Lov this, the Amazon Prim content is great. Woks well for Spotify, Pandora and Netflix too. Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Jim M"}]