[{"rating": 4.0, "review": "Easy setup and loving the quality / images projected to my LED TV. I would like to give it a 5 star but I'm still having trouble trying to solve the 'no audio / volume' issue which quite a handful of users had reported, as my LED TV is an old model and only has 01 HDMI port and limited settings that can be tweaked. I'll update again if I manage to get that issue solved.", "verified": true, "helpfulness": "0/0", "author": "F. SUE"}, {"rating": 5.0, "review": "awesome little gadget!! from YouTube to Pandora, the chromecast streams everything to your big screen. you can even web browse on your TV if you use a Google chrome web browser. Netflix quality is also amazing!! certainly worth the $35.", "verified": true, "helpfulness": "0/0", "author": "L C"}, {"rating": 3.0, "review": "excellent vendor, not so top notch of a product.  Casting over wifi is weak and glitch filled so much I can't watch 30 minutes of anything beginning to end.", "verified": true, "helpfulness": "0/0", "author": "David Ducolon"}, {"rating": 3.0, "review": "Does the job. Waiting for Intel WiDi to come out next year on Skylake chip.", "verified": true, "helpfulness": "0/0", "author": "Jack M"}, {"rating": 5.0, "review": "Couldn't wait to get it and then it totally met my expectations", "verified": true, "helpfulness": "0/0", "author": "Indera Gibson"}, {"rating": 5.0, "review": "it works great!", "verified": true, "helpfulness": "0/0", "author": "Xi Deng"}, {"rating": 1.0, "review": "Only lasted 8 months before dying and there is no warranty.", "verified": true, "helpfulness": "0/1", "author": "Rittam"}, {"rating": 5.0, "review": "This is great!! I use it almost every day", "verified": true, "helpfulness": "0/0", "author": "Cathy Thomas"}, {"rating": 5.0, "review": "This is 35 dollars everywhere of Coarse its hdmi all of them are why would I pay 50 after shipping for something I can get walking into walmart. ..I own this it is wonderful I use it everyday but don't gyp people of their money :/", "verified": false, "helpfulness": "3/6", "author": "tawny"}, {"rating": 5.0, "review": "amazing!", "verified": true, "helpfulness": "0/0", "author": "rafael bittencourt reis"}]