[{"rating": 5.0, "review": "We love our Chromecast!  We ditched cable this past year and this allows us to play Hulu, Netflix, YouTube and many other items on the TV from our cell phones/tablets without all kinds of crazy cords.  It's like having most of the features of a Smart TV, without all the added expense.", "verified": true, "helpfulness": "0/0", "author": "Cheryl DiMeo"}, {"rating": 5.0, "review": "Easy set up and it does its job. I've had it for awhile and have not had any issue of putting my chrome screens onto the TV.", "verified": true, "helpfulness": "0/0", "author": "Shengyuan"}, {"rating": 5.0, "review": "Worked great while travelling until I lost it.", "verified": true, "helpfulness": "0/0", "author": "Marc C."}, {"rating": 5.0, "review": "Every home should have these own 3", "verified": true, "helpfulness": "0/0", "author": "bobwire"}, {"rating": 5.0, "review": "For a beta item it works pretty well. Still think they rushed it to market. Cmon, beta Google? Then give it away... We are not your testers. Pay someone to do that and release a solid product if your going to charge for it. I really do not care what you paid to manufacturer it in comparison with what I paid..... I have dealt with you since your inception and you have always been some cheap (#$holes.", "verified": true, "helpfulness": "0/0", "author": "T. Gage"}, {"rating": 5.0, "review": "It does everything I want and more.", "verified": true, "helpfulness": "0/0", "author": "Fatima"}, {"rating": 4.0, "review": "Pretty awesome, much better than Apple TV which I hate.  Only issue I'm having is where's my $20 Google Play credit?  I haven't seen this come through yet....", "verified": false, "helpfulness": "0/0", "author": "ronald minondo"}, {"rating": 5.0, "review": "Not what I thought it would be but flawlessly works with all my apps, HULU, NETFLIX, and videostream, from my phone, tablet and laptop.", "verified": true, "helpfulness": "0/0", "author": "Jeani Beani Beach"}, {"rating": 3.0, "review": "It disconnects from my phone all the time so I am always having to reset the chromecast and ad it again to my network. Other than that, or works great for streaming Netflix.", "verified": true, "helpfulness": "0/0", "author": "Breann St John \"bre\""}, {"rating": 5.0, "review": "Purchased for my 80 year old father- he can work it with his iPhone. That's how simple it is!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]