[{"rating": 5.0, "review": "I like the way it works. However it would better serves me if it could work without having internet, but over all it is a good product.", "verified": true, "helpfulness": "0/0", "author": "Fitzroy Williams"}, {"rating": 5.0, "review": "Easy hook up, easy to operate, great to watch!  Since my TV had only one HDMI outlet I also purchased the \"Fosmon HD1831 3-Port HDMI Switch with Pigtail Cable\" from Amazon.", "verified": false, "helpfulness": "0/0", "author": "Hank"}, {"rating": 3.0, "review": "Good, but not too much usefull.", "verified": true, "helpfulness": "0/1", "author": "jose guarnieri"}, {"rating": 5.0, "review": "Google chomecast is great, the only thing I dont like is the low number of applications you can use with the divice. Hope google adds more applications because this is a very nice idea,  why pay $200 more for an smart tv when you can watch videos using cromecast.", "verified": true, "helpfulness": "0/0", "author": "D Carbajal"}, {"rating": 5.0, "review": "This device is working just like it said it would.  I did have to get a wifi router which was not expensive for it to connect because it would not connect to my phone.  The other problem is with netflix.  It was working fine but it started pausing and playing movies on their own but I can't blame the device because it works well with other movie providers like Hulu and Grackle.  Netflix has tried t fix the problem but have not been able to.", "verified": false, "helpfulness": "0/0", "author": "Eddie Barroso"}, {"rating": 5.0, "review": "One of the best things I have purchased in the last few years. Amazingly useful and extremely low price for what it does. I watch all of my Netflix and YouTube on the TV now. Have used with multiple HDTV's with no problems.", "verified": true, "helpfulness": "0/1", "author": "Mark Repka"}, {"rating": 5.0, "review": "Great way to share what you are interested in on a large screen. Hoping they will include more options in the future but for now I no longer have to share music clips and youtube videos on my phone, laptop or tablet.  Hurray!", "verified": true, "helpfulness": "0/0", "author": "P. WEAVER \"namaste\""}, {"rating": 1.0, "review": "Useless. The same thing can be done with any smart TV.Bought it, try it for 10 minutes, repacked it and sent it back.", "verified": true, "helpfulness": "1/4", "author": "Claudio Lombardo"}, {"rating": 5.0, "review": "A+ Service and Product!", "verified": true, "helpfulness": "1/2", "author": "Miranda Oliver"}, {"rating": 5.0, "review": "Very awesome product. Lets you keep watching a video while doing other applications like checking email, browsing, etc. Video stays on even if you turn your phone or tab device off.", "verified": false, "helpfulness": "1/1", "author": "dekzan"}]