[{"rating": 5.0, "review": "I love it.  It is so easy and quick to set up.  Actually it takes longer downloading app than setting up on my TV.  I love it so much i bought another one for my bedroom.", "verified": true, "helpfulness": "0/0", "author": "Kyong S. Fair"}, {"rating": 5.0, "review": "easy to setup", "verified": true, "helpfulness": "0/0", "author": "Kevin Ketzler"}, {"rating": 2.0, "review": "I love Google, but... Why does Google always seem to try to duplicate someone else's product and not quite get it right?", "verified": true, "helpfulness": "0/0", "author": "Xsair"}, {"rating": 4.0, "review": "The software is a bit lacking, but eventually it works. Have had a few hangups in You Tube. But for the price, it's a great deal.", "verified": true, "helpfulness": "0/0", "author": "West Coast book lover"}, {"rating": 3.0, "review": "I only gave 3 stars, though I like the potential of what Chromecast can be.  For all the potential of this device, there is limited out of the box functionality.  Probably most frustrating problem is that connecting and disconnecting can be hit or miss using the app, though it seems that screen casting is a \"beta\" feature (even though it has been out for a year).  Sometimes it works great, but of course when I try to show something to a friend it won't connect - though I am one of the folks haunted by Murphy's ghost.  I've also noticed when trying to help others set up the chromecast using their phones, the app interface is a bit confusing.  Hopefully it will become more useful for me after I try out with autocast with tasker which has some cool features most people would probably expect would be baked into Chromecast out of the box.  I am keeping my Chromecast with the hope that Google improves it to the point where it is reliable, and that autocast will bring some basic functionality to the experience of using it.", "verified": true, "helpfulness": "0/0", "author": "MidnightRunner"}, {"rating": 2.0, "review": "I was using it to stream video and it did not work very well at all.", "verified": true, "helpfulness": "0/0", "author": "L. Hill"}, {"rating": 5.0, "review": "Great in every way.", "verified": true, "helpfulness": "0/0", "author": "Michael Franzblau"}, {"rating": 5.0, "review": "CAN'T FIGURE OUT HOW TO WORK IT", "verified": true, "helpfulness": "0/1", "author": "Marguerite Seaton"}, {"rating": 5.0, "review": "We have gotten a lot of use out of this. I can watch Netflix,Utube, or anything from my phone. Sometimes it doesn't want to mirror off of my phone and disconnects itself, but i stay determined until it works.", "verified": true, "helpfulness": "0/0", "author": "Chastina J. Rawlings"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Matias Basualdo"}]