[{"rating": 5.0, "review": "SO SIMPLE! MAKE SURE YOU HAVE  WI-FI INTERNET CONNECTION!", "verified": true, "helpfulness": "0/0", "author": "WE THE PEOPLE"}, {"rating": 5.0, "review": "Simply awesome", "verified": true, "helpfulness": "2/2", "author": "Alyssa"}, {"rating": 4.0, "review": "Love ❤ it", "verified": true, "helpfulness": "0/0", "author": "Susan De leon"}, {"rating": 5.0, "review": "Best low cost streaming device all around.", "verified": true, "helpfulness": "0/0", "author": "Aphixe"}, {"rating": 4.0, "review": "The documentation that comes with this item is not detailed enough. It took me quite a while to realize that I had to go to the Play Store and download the apps for the video channels that I want to watch, install the chromecast app on my phone and then bring up the video channel's app and click on a small rectangle that transfers the screen output from the phone to the TV screen. Google needs to do a better job of explaining all of this.", "verified": true, "helpfulness": "0/0", "author": "Tampa Jim"}, {"rating": 1.0, "review": "I bought a Chromecast on black Friday, because it was on sale. I love the idea of being able to cast tv shows, pandora, etc, from my computer or smart phone. However, this thing RARELY works! I used it three days ago to watch a movie, then tried to cast Pandora today, and the cast button wouldn't come up on my phone, so I tried it on the computer and got the same message that I am SO tired of - No Device Found. The support pages at Google are NO help. Then one day it will just randomly work. But most of the time, no dice. I wish someone could explain to me what the problem is.", "verified": true, "helpfulness": "0/0", "author": "M. Mitchell \"momofmany\""}, {"rating": 3.0, "review": "Can't figure out how the heck to use this", "verified": true, "helpfulness": "0/4", "author": "Susan M. Hale \"Real Person\""}, {"rating": 5.0, "review": "I got it and I like it.", "verified": true, "helpfulness": "0/0", "author": "Bader"}, {"rating": 5.0, "review": "Love it.... transfers shows from your ph ok ne to your TV ...", "verified": true, "helpfulness": "0/0", "author": "Britt de Cormier \"Britt & Carisa de Cormier\""}, {"rating": 4.0, "review": "The video drags constantly, but it is great if you don't mind your video stopping every few minutes.", "verified": true, "helpfulness": "0/1", "author": "P. Carrillo"}]