[{"rating": 5.0, "review": "Works great !", "verified": true, "helpfulness": "0/0", "author": "7714"}, {"rating": 3.0, "review": "Love the idea but it really needs a remote other than a phone/ipad - it does not work seamlessly with netflix or hulu and can take a long time to pause or stop the movie/show  because the software is super laggy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This device requires Access Ports to be disabled on your home router and uPnP to be enabled.  Don't know about Access Ports but enabling uPnP can be a security risk.  I am not willing to configure my router to meet these specs.  I returned the ChromeCast.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"gwitte2\""}, {"rating": 5.0, "review": "Great for cell phones and tv.  Can't live stream though.  Does not work with surface rt at all.  Netflix and Hulu work awesome and you tube too.", "verified": true, "helpfulness": "0/0", "author": "eric s wiseman"}, {"rating": 4.0, "review": "I have been owning this toy for quite some time (probably 1 year), so it is time to give it some of my thoughts.I currently have 3 of these devices. One for my living room, one for my bedroom and one more my father's bedroompros:1. very easy to set up2. very easy to broadcast anything from youtube3. Quality is great as it is HDMI streaming4. Even support vob file (need to install additional chrome extension)5. Easy to use as long as you are on the same networkcons:1. need to be powered up via a microUSB. I wish it could power up using the HDMI somehow....just somethought to reduce less cable tangled behind my TV.2. lagging when network is kinda hịt3. look kinda chubby4. to broadcast, we need Google Chrome browser. Since Windows phone does not have Google Chrome, can't use Windows phone to broadcast. Need workaround to do so.", "verified": false, "helpfulness": "0/0", "author": "wanderer"}, {"rating": 4.0, "review": "it works pretty well. sometimes the picture gets choppy and I need to reduce the quality of the video, but it still looks fine on the tv.", "verified": true, "helpfulness": "0/0", "author": "N. Feldman"}, {"rating": 1.0, "review": "We never could get it to work. It kept making us change the settings on our router. As opposed to the roku we also purchased and it just...worked.", "verified": true, "helpfulness": "0/0", "author": "Marlissa"}, {"rating": 5.0, "review": "we use this to stream netflix to the TV. Love it!", "verified": true, "helpfulness": "0/0", "author": "libertymarie"}, {"rating": 5.0, "review": "I have already received the product and am satisfied with the purchase, thanks", "verified": true, "helpfulness": "0/0", "author": "Yamid Rojas"}, {"rating": 5.0, "review": "Best gadget I've bought in ages. So easy to use and set up for streaming. Not sure what took me so long to get one.", "verified": true, "helpfulness": "4/4", "author": "Mom of Boys"}]