[{"rating": 5.0, "review": "Great things come in small packages and the Google Chromecast is one great little package.  YouTube and Netflix work just great.  Quality appears to be very good and so far no complaints on lag.  Setup was a breeze.  Using your Android tablet or phone as your remote control makes it super simple to use.Hopefully Google finishes the SDK soon and allows more Chromecast apps to appear.  Now if Amazon would just follow Netflix, Hulu Plus, and HBO and offer Amazon Instant Video for the Chromecast I would be one very happy camper.", "verified": true, "helpfulness": "0/0", "author": "J. New \"JN\""}, {"rating": 5.0, "review": "This is AMAZING! I love this product! Definitely nothing wrong with it at all! I love how you can stream netflix, YouTube, and other apps on this.. It's very handy, and remote-free! I DEFINITELY MOST DEFINITELY recommend this product!!", "verified": true, "helpfulness": "0/0", "author": "cjennings6211"}, {"rating": 3.0, "review": "The viewing experience was slow and sluggish.  Maybe the next generation will be better.  For now, I'll just keep watching on my iPad.", "verified": true, "helpfulness": "1/1", "author": "Reader Girl \"Avid Reader\""}, {"rating": 4.0, "review": "I already have roku but still I bought chromecast for the following reasons:1. Play YouTube.2. Cast Chrome browser tabMy impressions:Pros:====1. Cheap: $352. Very Easy Setup. To be honest, never seen any setup being this easy.3. Can Start TV, Change Volume , Change Input if the TV is HDMI CEC compliant. Having said this, Chromecast doesn't change input in my lg hdtv.4. Works beautifully with the apps which support chromecast5. Ability to cast chrome browser tabCons:======1. Performance issues with casting a tab: The router which I have is pretty good,laptop which i use is extremely powerful but still the casting of chrome browser tab has issues. The videos quality takes a dip or freezes in between even though it works flawlessly on the laptop. This especially happens after streaming for several minutes. Even though google treats this as an experimental feature, it needs improvement.2. The app support is still very limited.3. Doesn't support 5 ghz", "verified": true, "helpfulness": "0/0", "author": "S. Gautam"}, {"rating": 5.0, "review": "Since we've bought this, we are using it more and more. And it seems that more and more applications are starting to support Chromecast streaming. Certainly Netflix is what we use most, but using YouTube streaming on our TV has proved surprisingly helpful.Quality of the picture on your TV is going to be heavily dependent on your wireless speed. One day when our router was acting up, the picture quality degraded. With that fixed, the picture quality is great. It's not HD level, but it's much better than expected.We have not used the tab casting feature much yet. Still exploring.One complaint is the Netflix app on my iPhone will freeze in certain situations and I'll need to restart everything. Also, not having a remote to control the Chromecast can feel weird at first, but once you get the hang of it, it's much easier all around.", "verified": true, "helpfulness": "0/0", "author": "Zachary A. Stanley"}, {"rating": 5.0, "review": "I was skeptical on buying Chromecast, as I've read a lot of mixed reviews. However, I found that I use Chromecast nearly every day now, and with more apps coming down the line, you can't get much better! I do think it'd be cool to have a remote or something to go along with it, but I guess it's part of the minimalistic outview to only have as little as possible!", "verified": true, "helpfulness": "1/1", "author": "Brandon Wright \"Indie Author Book Reviews\""}, {"rating": 4.0, "review": "Works GREAT!  The only disappointment is I thought I'd be able to use the tv as my computer monitor, put doesn't work that way.  Like being able to see the internet for videos and movies.....", "verified": true, "helpfulness": "0/0", "author": "Cathy Smith"}, {"rating": 4.0, "review": "Have been using it to stream Youtube videos from my iPhone, love the quality and response time. It's just as good as a physical connection, but only it's not. The convenience of not tripping a cord on the floor is always welcomed.", "verified": true, "helpfulness": "0/0", "author": "Will Yang"}, {"rating": 5.0, "review": "A great device to use with my tablet!I can watch on my LCD Netflix, YouTube and much more in HD.", "verified": true, "helpfulness": "0/0", "author": "David Salischiker"}, {"rating": 1.0, "review": "If you have a smart TV - this device is pointless. It forces you to download new (or updated) apps for everything you are already watching on your smart tv. In fact the Netflix/Chromecast app is WORSE than the smart tv Netflix app. With the Chromecast version you are sent to a random \"page\" promoting some random show at the end of EVERY episode of the show you actually want to watch. At least the smart tv version queues up the next episode. There is NO continuous play option. Even if you attempt to \"Chromecast from the Netflix website - nope the app still gets in there and \"F*&^s\" it up.That said, trying to stream video content from any random webpage resulted in the device shutting off the TV. Now that's useful!I'm going to try the Raspberry Pi - I'll let you know how that turns uot...couldn't be worse!", "verified": true, "helpfulness": "0/2", "author": "Gwen"}]