[{"rating": 5.0, "review": "Works fine!", "verified": true, "helpfulness": "0/0", "author": "Guilherme Loberto"}, {"rating": 5.0, "review": "I don't use this as much as I thought I would but it is handy when I need it.", "verified": true, "helpfulness": "0/0", "author": "Frank Prieto"}, {"rating": 1.0, "review": "Couldn't get it to stay connected to my home WiFi. Had to return, went with the Roku Stick which works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "ben tucker"}, {"rating": 5.0, "review": "It makes my TV experience so much easier, thanks", "verified": true, "helpfulness": "0/0", "author": "O. Miranda"}, {"rating": 5.0, "review": "Chromecast is awesome.  I've found uses for it beyond just streaming movies.  I can also use it to stream anything that can be loaded by a browser... of particular interest to me was being able to pull up maps and photos for use during table top gaming.", "verified": true, "helpfulness": "0/0", "author": "bluewanders"}, {"rating": 5.0, "review": "It's Chromecast!  It's a great value.  Easy to install, works great.", "verified": true, "helpfulness": "0/0", "author": "Cobra"}, {"rating": 5.0, "review": "A+++++++", "verified": true, "helpfulness": "0/0", "author": "Vernon G Keene"}, {"rating": 1.0, "review": "I really wanted this to work for me. Unfortunately, I needed to buy this as an application for a work project. It didn't allow for me to be able to access a secure wi-fi network that required *both* a username and password. Fortunately we have a \"guest\" wifi connection, but after setting that up, I found that I would need (per the FAQ pages on chromecast.com) to restart the wifi router in order to get my laptop/phone to recognize the device. I work in a big company - I'm not in a position to just get IT to do this.Ultimately, it ended up being a useless purchase for me, and left me feeling that this is why Apple wins: with their Airplay feature, they made an out of the box product with Apple TV that plugs into your HDMI port and works the first time and allows screensharing of content. Unfortunately an Apple TV is 5x bigger and costs 2.5x as much - you can't just walk around with it in your pocket like I could with this device. The Chromecast is a far superior product in terms of the design (keychain-dongle size), which is what motivated me to purchase it: what if I could just walk into an office and give a great presentation via sharing from my screen, and cast that to other offices via Google Hangout? Wow - what a great solution Google would have had on their hands! Instead, owing to the fact that I didn't buy this for home use, I'm stuck with a lemon of an HDMI dongle that should have been much easier to set up.I'm sure it's a decent device for folks that don't have internet-connected TVs and want to stream content from apps on their mobile devices, and can toy with their internet settings at home. Unfortunately, I needed it to do another function it advertised but ultimately couldn't deliver.", "verified": false, "helpfulness": "0/0", "author": "J. Kahn"}, {"rating": 5.0, "review": "I like it a lot. I would have one for each TV in my house.", "verified": true, "helpfulness": "0/0", "author": "Alexander Rincón"}, {"rating": 5.0, "review": "this is a must have for people with dumb tv's.  Stream everything right to the tv", "verified": true, "helpfulness": "0/0", "author": "Craig"}]