[{"rating": 4.0, "review": "I would recommend this to anyone who does not like watching shows on a small screen.  It was great to go from a 10.1 inch view to a 50\".  Good deal  for the price of only $35.  It would make an inexpensive gift or stocking stuffer for Christmas.", "verified": true, "helpfulness": "0/0", "author": "wendy l hansche"}, {"rating": 4.0, "review": "The functionality of the device is great, netflix and youtube worked easily even if the iPhone has some issues with Netflix.  I really hope amazon prime would come in as a service for it and its usefulness would be complete.", "verified": true, "helpfulness": "0/0", "author": "Leo"}, {"rating": 5.0, "review": "Not really compatible with some Hotel Wireless-- I would give it 4 stars, but it's just so useful.  I pack along a travel router.I use it all the time for work presentations using a tablet.  Audio is difficult/impossible on projector sometimes without extra equipment..  even so,  this device works well.", "verified": true, "helpfulness": "0/0", "author": "tim fitz"}, {"rating": 1.0, "review": "If I could give the Chromecast HDMI Streaming Media Player a MINUS 25, I would.  The written instructions are so small I couldn't read them with amagnifying glass.  The device upon plugging it in became more than warm, more like hot.  The correct display showed up on the TV.  After downloading the app., I tried repeatedly to connect the player to my notebook computer which has Windows 7.  The network and sharing center pane said I was connected to the Chromecast4548 network.  The computer kept displaying that I was not connected, and recommended I try again.  What a waste of my time, and money.  This player is JUNK, GARBAGE, TRASH.....what a waste.", "verified": true, "helpfulness": "1/5", "author": "Paul J. Kochis"}, {"rating": 5.0, "review": "The price point is well within budget. What it does is impressive enough to appreciate, but it won't win over Tech snobs. It basically turns your standard TV to a Smart TV. The difference is you can use your smartphone/laptop/tablet instead of a remote control. Which I will tell you that is faster. Also, works over WI Fi, so you don't even have to be in remote control distance to use. I like it, if you don't like it feel free to donate it to me!", "verified": true, "helpfulness": "0/0", "author": "Alex T"}, {"rating": 4.0, "review": "Love it. So easy to use and one can be watching in no time Youtube and co on the \"big screen\" at home. Hopefully google will listen to all of us and have the next generation also stream data / movies / music also from a computer at home and not only from the internet. Should be easy to do and would boost their sales. I bought this one at BestBuy for $29.95 (BlackFriday deal)", "verified": false, "helpfulness": "0/0", "author": "geogeo"}, {"rating": 4.0, "review": "I've been able to use the Chromecast to stream from my Galaxy Note II, Galaxy S3, and two PC laptops. The great thing about streaming from the Chrome browser is you can press 'Ctrl+O' and open music and videos from your hard drive. The quality has been great and rivals media streaming quality through my Xbox 360.For those who have NFL Game Pass and had trouble with it because of the pop-up browser - I found a workaround. I copy/pasted the hyperlink from that pop-up browser into a normal Chrome window that allows Chromecast. The stream came through pretty well (I'd say 4 out of 5 star quality) It is not 120Hz smooth, but the audio/video sync is spot-on and it solves the previous issue of poor quality.Great device - I hope the allow more open source so I can use it to stream ALL media from my PC and smartphones.", "verified": true, "helpfulness": "0/0", "author": "T. Davis"}, {"rating": 5.0, "review": "For just $35, Chromecast has brought home entertainment to another level for my family. The kids can now watch their favourite videos from YouTube on the big screen TV. Definitely worth the buy.", "verified": true, "helpfulness": "0/0", "author": "Lester Tan"}, {"rating": 5.0, "review": "Easy as pie to set up. Works way better than expected. If you don't have this yet, get it NOW!", "verified": true, "helpfulness": "0/0", "author": "Joseph Voigt"}, {"rating": 2.0, "review": "I was excited to try this streamer, but soon after I set it up, my Comcast gateway began acting abnormal. All other devices in the home were unable to access internet service, and everyone began complaining how bad the Comcast service had become lately. Then, I took my gateway to Comcast and got a free replacement, after explaining the situation with my internet connection. To my surprise, the situation did not improve at all with the new gateway. Then, I put my techie hat on and decided to troubleshoot my connectivity -- trying to calm upset souls in the family with the continued bad service. At some point, I suspected the Chromecast might have something to do with this abnormality, and removed it from the TV, unpowerd and put it away. Later that day, the internet service improved a bit, and over the next couple of days, we were back to the blazing speed which the family got used to. Two possibilities -- either Comcast detected the Chromecast and applied policy to affect my service (why do they do that?), or the Chromecast WiFi signal interference with the gateway WiFi caused it to choke and unable to operate -- I am doing further investigation to find out the root-cause.", "verified": true, "helpfulness": "0/1", "author": "Michael Damena"}]