[{"rating": 5.0, "review": "The best feature of this product is that you can stream any tab in Chrome to your TV. It allows you to have a second screen for work, whether you're on video calls, collaborating on presentations, or need extra space. I also enjoy that Youtube and HBO GO stream automatically.", "verified": true, "helpfulness": "1/1", "author": "Seth Clampett"}, {"rating": 5.0, "review": "Great streaming product! I love it!", "verified": true, "helpfulness": "0/0", "author": "Chia-Ching L."}, {"rating": 5.0, "review": "This is an amazing device. It allows me to stream just about anything to my TV, ranging from pictures on my phone, to using several \"Cast\" enabled apps such as Netflix, Pandora, YouTube, etc. It allows easy sharing of whatever I have on my phone through my 60\" TV. I use it often do to presentations in my living room for my home based business without having to have the need for a projector, etc now.Pros:- Small and easy to plug into the HDMI port- Many apps support \"casting\" to this device on your TV- Easily turn your \"dumb\" TV into a SmartTV- Great picture and audio quality when \"streaming\" from your phone.- Price is amazing. For $35 you upgrade your Dumb TV to a Smart TV, instead of having to spend 100s or 1000s more replacing your TVCons:- None", "verified": true, "helpfulness": "0/0", "author": "Frankwin Hooglander"}, {"rating": 5.0, "review": "It works fine. Easy way to stream movies to the tv.", "verified": true, "helpfulness": "0/0", "author": "Eduardo"}, {"rating": 2.0, "review": "Item has stopped connecting", "verified": true, "helpfulness": "0/0", "author": "casual cal"}, {"rating": 3.0, "review": "I was sold on this because I wanted to stream NFL Mobile from my phone to my TV because I could not get Patriots games while I was in Kentucky.  The Verizon guy told me I could get them on my phone with the app and cast them to my TV.  Great concept, crappy execution. Come to find out, the video you want to stream has to be Chromecast compatible... most aren't.  I probably would like this product more if I hadn't been lied to by Verizon!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Winchester \"mainehorsenut\""}, {"rating": 5.0, "review": "I love this thing! Never watching Netflix, HBOGO or Hulu from my laptop again!", "verified": true, "helpfulness": "0/0", "author": "Kathryne Bosco"}, {"rating": 3.0, "review": "buy roko instead ! you have to use phone or tablet to run, pain", "verified": true, "helpfulness": "0/0", "author": "Sargento"}, {"rating": 5.0, "review": "Love this! Easy to use on any electronic Wi-Fi device! No cons, it works great just make sure you have a good internet connection!", "verified": true, "helpfulness": "0/0", "author": "Amazing Riley"}, {"rating": 2.0, "review": "If you just want to use it for Netflix ETC. then it is good. If you’re using the Chromecast for Chrome on your laptop to project tabs, the video quality and audio can dump quite a bit. It’s almost useless in IOS you can't cast screens and in chrome you can't even cast tabs. I bought with the device under the impression you could mirror your screen from your laptop, but you can't........there is terrible lag. The technology states it is still in experimental mode. I returned this product.", "verified": false, "helpfulness": "0/0", "author": "Anthony"}]