[{"rating": 5.0, "review": "I'm not a big TV person but I love my NetFlix late at night.  I used to either watch on my desktop or my Samsung Notebook until I got tired and then jump into bed.  Now I feel like a NetFlix Queen.  I get into bed and watch everything on my NetFlix list on my big screen TV.  It has also made it possible for my family to sit in the den and choose a show or film to watch together when the weather's bad or if we don't feel like going out or if it's late at night and we don't want to speak to each other!This item truly adds a new level of luxury to your lifestyle and at its price it's an awesome device to own.", "verified": true, "helpfulness": "0/0", "author": "susan austin"}, {"rating": 4.0, "review": "It's great! I love being able to throw just about anything on my screen and I can take it with me too! It does drain the iPhone battery when you stream and do other things but just plug it in and you can do it all!", "verified": false, "helpfulness": "0/0", "author": "Kayla L"}, {"rating": 5.0, "review": "Fantastic!  Quick and easy!  Tried Roku and Funai... Both terrible reception issues.  Chromecast is highly recommended .  No wifi issues noted.", "verified": false, "helpfulness": "0/0", "author": "Saara Roberts"}, {"rating": 5.0, "review": "It's really easy to setup. It's really fun to watch youtube video's on the big screen. Also they're adding support for more apps every now and then.", "verified": true, "helpfulness": "0/0", "author": "Drew"}, {"rating": 1.0, "review": "I am sorry to say our chromecast doesn't work, it won't show on the wifi for any of our devices.  Can we please return it for a replacement?", "verified": true, "helpfulness": "0/0", "author": "CaddyCalvin"}, {"rating": 1.0, "review": "After seeing what the Roku does this is a grave disappointment. There's no separate remote which I found really convenient. There's no platform to search through your different streaming sources like Netflix, Amazon...you gotta use your laptop or iPad. Also during the set up it gave me issues about my router needing to have different settings so that the Chromecast would be allowed to utilize the net. I had to figure that out. I hate it. Buy something else.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"MDK\""}, {"rating": 5.0, "review": "This is the best thing I've ever purchased. I recommend it to anyone who wants to be comfy and watch stuff", "verified": true, "helpfulness": "0/0", "author": "Baby Bear"}, {"rating": 5.0, "review": "I have to say, I am a bit of a techie but will often wait until hearing from friends and family about whether something works.  However, I took the leap with this, thinking I really wanted something I could use to stream Netflix, websites and have it be an easy solution.  This has been everything and more!  I use it daily, and have since bought a second one for travel.", "verified": true, "helpfulness": "0/0", "author": "David Rodriguez"}, {"rating": 5.0, "review": "My son had to coax me to buy this but I can't rave about it enough! For me, the best part is laying in my bed and having Netflix streamed to my tv from my phone. It is so easy to set up and to use! I rave about it all the time.My teens like to use it for youtube on the tv and pandora but it's great for so many things!", "verified": true, "helpfulness": "0/1", "author": "Tonya"}, {"rating": 5.0, "review": "Not having a smart TV this little addition made watching shows that much better. Youtube on a big screen...Netflix episodes...so much better than my tablet.", "verified": true, "helpfulness": "0/0", "author": "AEspo"}]