[{"rating": 2.0, "review": "I had to return mine as it wouldn't connect.  My girlfriend has one and loves hers, but she has a single band router and no issues.  I'll try the new Fire TV Stik which is supposed to be dual-band.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Wish i could stream my own media and my amazon prime content", "verified": true, "helpfulness": "0/1", "author": "Jose"}, {"rating": 4.0, "review": "The Chorme Cast is a wonderful device. I watch Netflix and YouTube with it all the time. Issue I have are I can't control it with my Windows 8 System and I'm limited to Netflix and YouTube.", "verified": true, "helpfulness": "0/0", "author": "Dior Otto"}, {"rating": 1.0, "review": "Netflix and Hulu upgraded their software on this device to make it incompatible with any device running Android 4.0. At the time of purchase it was compatible with my original Kindle Fire. Not anymore. Planned obsolescence.", "verified": true, "helpfulness": "0/0", "author": "Kenneth Schildt"}, {"rating": 1.0, "review": "Very disappointed in this product, yet more disappointed in dealing with Google technical support! Back and forth emails at this point, as it appears there is only one person at Google who is the expert at casting issues.", "verified": false, "helpfulness": "0/0", "author": "KathleenN"}, {"rating": 5.0, "review": "I have older Samsung 50\" plasma that does not have USB for poser, but this can be powered from wall outlet so we tried it.  Setup was quick and easy and this has been fun to use with laptop to see old pictures/videos, youtube, etc. glad we got it.", "verified": true, "helpfulness": "0/0", "author": "slcmd"}, {"rating": 5.0, "review": "This thing is genius. Yes, there can be some minor issues, one being that the \"cast\" doesn't always take on the first try....this is, luckily, rare.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey A. Coffman"}, {"rating": 5.0, "review": "This is the best product you can buy for < $50.  No questions.", "verified": true, "helpfulness": "0/0", "author": "F. Janjua"}, {"rating": 5.0, "review": "Great item!", "verified": true, "helpfulness": "0/0", "author": "alvarado"}, {"rating": 5.0, "review": "awesome device", "verified": true, "helpfulness": "0/0", "author": "Malcolm Jones"}]