[{"rating": 4.0, "review": "I really like the Chromecast. Set up was amazingly simple. Using it is very easy. The only downside is the limited number of apps that link with it.", "verified": true, "helpfulness": "0/0", "author": "Carlo E Atene"}, {"rating": 5.0, "review": "Works as promised and easy to install.  I am enjoying my Netflix movies on my tv.  I wish more thins were this easy to operate..", "verified": true, "helpfulness": "0/0", "author": "Julio Leal"}, {"rating": 5.0, "review": "Excellent efficient and inexpensive alternative to Apple tv which I already own.I have it on our bedroom set and find operating from the phone a little difficult but not overly so.", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 5.0, "review": "A little confusing to hook up but once I got it going it was fantastic...Worth the money Will buy another for the bedroom", "verified": true, "helpfulness": "0/0", "author": "ray benedetti"}, {"rating": 5.0, "review": "Goggle Chromecast is the best, I can watch anything on tv instead of having to watch on my laptop, wireless.  No more watching movies or shows I missed on my laptop.  Just watched SNL on xfinitytv.com on my tv.  This is fantastic.", "verified": true, "helpfulness": "0/0", "author": "rboles"}, {"rating": 3.0, "review": "This product does the work extremely well for a limited options. I bought it since I travel extensively and stay at various hotels across US and wanted to watch my programs on TV using any mobile device. Unfortunately Chrome-cast does not help. I would have given them a 5* had they worked upon in all the hotels. This device works absolutely fine if you are using it at home using home WiFi network.", "verified": false, "helpfulness": "1/2", "author": "ADVIK RAY"}, {"rating": 5.0, "review": "This thing can be used anywhere and streams seamlessly and with the highest clarity it's installation and use were easy.", "verified": true, "helpfulness": "0/0", "author": "E. Gholar"}, {"rating": 5.0, "review": "$35 gets you a cool little device that lets you watch content  from Netflix, Youtube, and a bunch of other apps on your HDTV. It plugs in through an HDMI port and connects to your wi-fi. You set it up in a snap with your iPad, iPhone, or other device.Works great!!", "verified": true, "helpfulness": "0/0", "author": "jimbalaya"}, {"rating": 5.0, "review": "This is very convienient as oppose to viewing on my cell phone. I can now relax with my spouse in the bed while we both enjoy movies.", "verified": true, "helpfulness": "0/0", "author": "doreg4u"}, {"rating": 5.0, "review": "Works great if you are running an app like HGO Go,  there is a delay when using the Chrome browser. But I love it for the price you can't go wrong purchasing. Can't wait till they release the final SDK, and allow for more apps to be made available to use with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]