[{"rating": 1.0, "review": "I bought an apple TV.", "verified": true, "helpfulness": "0/5", "author": "Pablo Aristimuñoz"}, {"rating": 5.0, "review": "Amazing!!!", "verified": true, "helpfulness": "0/0", "author": "Susana Donald"}, {"rating": 4.0, "review": "Love it! rated 4 stars because I hoped it had some sort of screen-casting feature for streaming android game play on my tv, latiency or not it would be a nice feature since we play many mobile MMO games with friends at our house). Wishful thinking I guess haha.We've had this for a few months and it's been a joy to have in the house, on our larger hdtv it heats up a lot, which had me worried at first, but given the manual states that it's \"normal\" I guess I don't have to worry about my tv catching fire? After months of it being plugged in and daily use that isn't an issue!", "verified": true, "helpfulness": "0/0", "author": "Eben"}, {"rating": 5.0, "review": "Met all my streaming media needs in a compact package. Plus setup was easy to understand and friendly.", "verified": true, "helpfulness": "0/0", "author": "Brett R. Green"}, {"rating": 4.0, "review": "Does not work with Chrome browser on tablets and phones.  When casting from Chrome browser it only works from a desktop or laptop.  Otherwise all features are versatile.", "verified": false, "helpfulness": "0/0", "author": "disk79"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Robert F."}, {"rating": 5.0, "review": "The chromecast streaming media player works very well for me.  It is simply the best as long as you have a very good wifi connection. I would encourage anyone who wants a streaming media player to buy the chromecast streaming media player.", "verified": true, "helpfulness": "1/1", "author": "Cindy Bennett"}, {"rating": 5.0, "review": "I had some difficulty getting the Player to work with a wifi repeater but once I sorted out the IP issues, I could enjoy a movie on the player.", "verified": true, "helpfulness": "0/0", "author": "Kenneth D'sa"}, {"rating": 5.0, "review": "Super. Works great and cheaper on amazon than in stores.", "verified": true, "helpfulness": "1/1", "author": "aframe \"arcticamy\""}, {"rating": 5.0, "review": "Hey is really good and work so nices only is your need internet connection always", "verified": true, "helpfulness": "1/1", "author": "Angelica"}]