[{"rating": 5.0, "review": "I bought this for my son for Christmas. He said it was very easy to set up and he now has several options for streaming TV. I would buy this again!", "verified": true, "helpfulness": "0/0", "author": "A Lemley"}, {"rating": 5.0, "review": "Works like charm for its price. Go Google. You now have work on improving the online content for this, by getting everybody on board now.", "verified": true, "helpfulness": "0/0", "author": "Murali"}, {"rating": 5.0, "review": "The Chromecast is a really interesting little device for such a small price.  As of this review it has been gaining more and more apps but really the only one's I'd ever use are Netflix, Google Play Movies, and YouTube.  Maybe Hulu Plus.However, the true power and excitement of this device will come when Google release the SDK to the public.  I say definitely grab this up if you're looking to turn your TV into a smart TV", "verified": true, "helpfulness": "0/1", "author": "B. Jenniges"}, {"rating": 3.0, "review": "Not much usage for now till updates come thru from Google to enable it to be fully utilise.... Should provide the developer codes earlier", "verified": true, "helpfulness": "0/0", "author": "lang peng siang"}, {"rating": 5.0, "review": "I have a bad habit of incurring so many late fees, that I should have just bought the movie.  With Google Chromecast, I can rent popular movies for several days and/or buy them at sometimes really good discount prices!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "easy to installworked right off the batbeen casting from my ipad, galaxy s4 awesomepicture is greatmy internet is shared with kids so it slows down sometimes and the movie starts buffering but all in all works perfectly.No need to buy a smart tv anymore. kidding at least not for a while.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey M. F. Brooks"}, {"rating": 5.0, "review": "This has to be one of the best purchases I have made this year.  Now I can pull up Netflix, YouTube, Hulu+, Pandora, and other online sites on my computer and stream it right to my flat screen TV and the sound system attached to it.  I bought two; one for me and the other as a gift to the couple who take me to church every Sunday. They love it too. The on-screen instructions are easy to follow and the website is very helpful with any questions I had.  Google really came up with a winner this time!", "verified": true, "helpfulness": "0/0", "author": "N. Grabarek \"Goober\""}, {"rating": 5.0, "review": "I purchased this product for my husband for CHRISTmas and we could not be more pleased with its performance! We have watched YouTube videos from our iPhones with it, as well as Netflix movies. It is especially useful when you have a large gathering of people all wishing to view videos you shot of events they could not all be present for (perhaps a Child's performance at school, graduation, etc.). I highly recommend this product to anyone!", "verified": true, "helpfulness": "0/0", "author": "Sheila Bagg"}, {"rating": 5.0, "review": "I had been eyeballing a Chromecast ever since it came out this past summer, but I was hesitant to buy one because I've purchased electronic gizmos like this before only to be let down. And those previous products that made \"broadcasting\" promises were much more expensive than the $35 price point on the Chromecast. Yet still, I waited to get one...waited for the reviews to come out.I received a Chromecast for Christmas (it was on my \"list\") and it was the one toy I was both excited about and not let down by. After all the Christmas hustle and bustle from the morning had settled down, and half the house went down for a nap, I took the break time to get my Chromecast out of the box and install it. I can honestly say that it took all of 5-7 mintues to setup...seriously. I had the thing broadcasting off of my Tablet (Galaxy Tab 3.0) two mintues later to my TV (Sharp 32\" LCD w/2 HDMI ports); then I had it broadcasting off my Laptop (HP Presario) 2 minutes later; and finally off my Desktop PC (HP SmartTouch) 2 minutes after that. It was very easy and it works...like a champ, it works!But here's the one, tiny catch to it all...you must install the Google Chromecast App on all the devices you wish to \"cast\" to your TV. And, if you are wanting to broadcast off of the Web, you must use the Chrome web browser. And lastly, Google has not yet made a Chromecast App for the Galaxy Tab 3.0, which means that while I can broadcast movies, music, et cetera, I CANNNOT broadcast anything off of my Chrome Web Browser. But that's it...and that's nothing compared to what this thing actually does.Now I can watch anything from my web-based systems on my TV. For me, that's a big deal because my Wife and I enjoy catching up on shows that we may have missed the first time around. And there are websites out there that cater to our way of watching TV (i.e. CouchTuner). The only time I watch live broadcast TV anymore is for sports...everything else is from my DVR and now from the Web!", "verified": true, "helpfulness": "0/0", "author": "NDM"}, {"rating": 5.0, "review": "Works as advertised. Easy set up and operations. Currently, I have it hooked up in my living room tv and it works great. I'm going to buy another for my bedroom tv.", "verified": true, "helpfulness": "0/0", "author": "JaMarcus"}]