[{"rating": 5.0, "review": "Excellent product !", "verified": true, "helpfulness": "0/0", "author": "Rafa"}, {"rating": 5.0, "review": "easy to hook up and works great love voice adv.", "verified": true, "helpfulness": "0/0", "author": "carl e reed"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "phyllis"}, {"rating": 5.0, "review": "This box is great. It does need someone with knowledge to program it. The box itself will not do much with a programmer. It has unlimited programming one it is programmed properly.. You do have to have internet..", "verified": true, "helpfulness": "0/0", "author": "L.R.Allen"}, {"rating": 5.0, "review": "Excellent. Works great.", "verified": true, "helpfulness": "0/0", "author": "Ronald G Diaz"}, {"rating": 5.0, "review": "I love it.  It was a great decision.", "verified": true, "helpfulness": "0/0", "author": "LaTanya & LaMonte"}, {"rating": 5.0, "review": "I am thoroughly enjoying the Fire TV and it is getting a lot of use.  So much programming available.  I haven't even had a chance to watch a traditional movie on it.", "verified": true, "helpfulness": "0/0", "author": "Cathy H. Geraci \"CathyG\""}, {"rating": 4.0, "review": "I really like Fire TV. The connectvity is just plug and play which is easy as pie.The only issue is whenever we change the AV input to go from watching cable TV to the component for Fire TV, the sound is nil. It's weird because we used it for months and didn't have this issue and then all of a sudden one day it started acting up like this.It's a pain in the rear to always have to unplug from the back but thankfully that's all we have to do. It works fine in less then a minute but obviously not ideal.", "verified": true, "helpfulness": "0/0", "author": "LMM \"LMM\""}, {"rating": 5.0, "review": "I've been using my Amazon Fire TV for about a year now and really love it.  As a Prime customer, I've enjoyed access to Amazon's video and music content via the Fire TV and particularly like some of their original programming.  I especially like the fact that I could install the PBS app and watch many of the PBS television shows (like Frontline and Mr. Selfridge) for free via this app.  I also like that I have been able to connect both my Hulu Plus and Netflix accounts to their Amazon Fire TV apps and basically have just one \"gateway\" to the majority of content I watch.  The iPhone remote control app has been helpful but I find that the remote that came with the device is just as easy to use (though it is a small one, so it tends to find its way into the sofa cushions fairly often!).  My one complaint has to do with purchasing content ... the device defaults to purchasing media with gift card balances first.  It would be nice to be able to select a payment preference at time of purchase so I wouldn't have to tap into my gift card balance for every purchase.  Otherwise, a great device that's found it's way into the center of much of my television usage.", "verified": true, "helpfulness": "0/0", "author": "MBAPete \"Pete\""}, {"rating": 5.0, "review": "Works great, fast ship.", "verified": true, "helpfulness": "0/0", "author": "Peorggie"}]