[{"rating": 5.0, "review": "I think this product is a good option if you want to turn your old LCD into  a Internet connected TV. I bought the Chromecast 1 month ago and it works very good. Before the Chromecast I usually connected my laptop to my LCD using the  HDMI port, easy right¡, However I had to do it every day, because I use the laptop to work and as a entertainment device. I'm user of Netflix, I can see smooth and clear movies and videos (youtube). I hope this review can help to decide.", "verified": true, "helpfulness": "0/0", "author": "Daniel Mora Valarezo"}, {"rating": 4.0, "review": "It works great for Netflix, but I have had trouble with Hulu (not Hulu Plus, but running Hulu from my laptop.) I love being able to run video from my phone to the tv. It's much simpler than fiddling with hooking up my laptop.", "verified": true, "helpfulness": "0/0", "author": "Kevin Chaffer"}, {"rating": 5.0, "review": "Installation was quick and easy, and set-up was pretty straightforward.  Great delivery of YouTube and Netflix on the big screen.", "verified": true, "helpfulness": "0/0", "author": "Scott Osler"}, {"rating": 5.0, "review": "I got this as un upgrade (companion) to my ROKU LT box which doesn't have youtube.  I got youtube now!  I love that it can be controlled through my wife's iphone or my android.  I can also use it from my computer.  Since I use exclusively the Chrome browser anyway, it's awesome because I can now broadcast that directly to my TV.", "verified": true, "helpfulness": "0/0", "author": "Tooth"}, {"rating": 5.0, "review": "Good product just wish there were more apps...its good for youtube and netflix..it would be cool if i could play my  itunes from my laptop  so i could go through my sound bar.", "verified": true, "helpfulness": "0/0", "author": "yukonjackz"}, {"rating": 5.0, "review": "What a convenient device. Its very Easy to use and very affordable. Definately Worth every penny.Showing pictures and video from my phone to the TV is extremely convenient.", "verified": true, "helpfulness": "0/0", "author": "Sal Vasta"}, {"rating": 5.0, "review": "works great. easy install.  Fast shipping.  Highly recommend to anyone with a smart tv that wants to use more apps.", "verified": true, "helpfulness": "0/0", "author": "bufro13"}, {"rating": 5.0, "review": "Finally a device that doesn't add yet another remote to my coffee table.  Browsing on my phone is so much easier.  Can't wait to see the other apps that arrive on Chromecast.", "verified": true, "helpfulness": "0/0", "author": "BF"}, {"rating": 3.0, "review": "Got one of these for my Grandson for his dorm room and it's fine, but the new Amazon Fire box is light years better.", "verified": true, "helpfulness": "0/1", "author": "John Bowman"}, {"rating": 5.0, "review": "really easy to install and use. Works like a charm. Lately having issues with casting chrome using my mac, works with pc", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]