[{"rating": 5.0, "review": "Awesome. So easy too use. I want one for ask my TV's.", "verified": true, "helpfulness": "0/0", "author": "Graeham Ford"}, {"rating": 3.0, "review": "Not very useful if you own another media player. I also own a Roku 2.When I first got this, it was the best way for me to play YouTube videos. Now that Roku has a YouTube channel, I haven't used my Chromecast in months.If you already have a media player, the only thing that I would recommend using a Chromecast for is screen mirroring. I can't speak to how well it works now, but it used to be terrible at streaming Chrome windows (when it was in beta, so I'm cutting it slack there). I'm sure other reviewer's have a better idea of how it is now.", "verified": true, "helpfulness": "0/0", "author": "Nate H"}, {"rating": 5.0, "review": "My Chromecast is set up in our bedroom, and it's been awesome for us.We're able to stream not only Netflix, but DLNA content from our home network to our television without any hassle. This is a great purchase.", "verified": true, "helpfulness": "0/0", "author": "James O'Meara"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/1", "author": "Ignacio Guzmán"}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/1", "author": "ryan carter"}, {"rating": 5.0, "review": "was good", "verified": true, "helpfulness": "0/1", "author": "carlos"}, {"rating": 5.0, "review": "Great product, need to include more channels", "verified": true, "helpfulness": "0/0", "author": "rr1136"}, {"rating": 5.0, "review": "streaming for 30$, you can't beat that.", "verified": true, "helpfulness": "0/0", "author": "Assaf Ohana"}, {"rating": 1.0, "review": "This is a pretty worthless item.  Why would anyone want to use this since it will not let you use all of the apps on your mobile device?  You are limited to the apps that Google is getting paid to let you view.  If you want a device that lets you watch all of the items on Chromecast and hundreds more and doesn't require the use of a mobile device, buy a Roku Stick.  I purchased a Chromecast when it first became available and have never used it because it is a pretty stupid idea.", "verified": false, "helpfulness": "0/6", "author": "Amazon Customer"}, {"rating": 1.0, "review": "not working", "verified": true, "helpfulness": "0/0", "author": "Isaac Cordero"}]