[{"rating": 3.0, "review": "Many times, the casting is really jilted and the voice/picture aren't in sync. Usually need to re-cast every hour or so, it just stops working midshow.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Gretz"}, {"rating": 2.0, "review": "There is no up-conversion with this. The quality will not look good on a big TV.YouTube on a 55 inch TV looks very grainy . Not even broadcast quality. Even with 1080p YouTube HD.Have only used it twice since Xmas. Not a buy I would do or recommend again.", "verified": true, "helpfulness": "0/0", "author": "keith"}, {"rating": 5.0, "review": "I loved my Chromecast so much, I bought this for my mom. :)", "verified": true, "helpfulness": "0/0", "author": "Arland"}, {"rating": 5.0, "review": "I cannot say enough about the Google Chromecast. This is the 3rd one we have purchased. We now have one in our Living Room, Bedroom and now our office. We also take one with us when we travel and the size is just perfect for that. The list of apps that now cast are growing making this just an awesome addition to your entertainment set-up. I love being able to use my phone as a remote. Would recommend to anyone in the market for a no-frills HDMI Streaming media Player for a very decent price.", "verified": true, "helpfulness": "0/0", "author": "MZ"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Huy Cao"}, {"rating": 5.0, "review": "This Chromecast HDMI is great. I put it on my TV & I can watch Netflix my pictures on my phone videos.. Awesome.", "verified": true, "helpfulness": "0/0", "author": "Joseph De La Rosa"}, {"rating": 4.0, "review": "Value for money", "verified": true, "helpfulness": "0/0", "author": "Vivek Gupta"}, {"rating": 5.0, "review": "Thanks", "verified": true, "helpfulness": "0/0", "author": "Bob Marley"}, {"rating": 1.0, "review": "Very limited and very slow i recommend spending the few extra dollars for the fire stick", "verified": true, "helpfulness": "0/0", "author": "colin butler"}, {"rating": 5.0, "review": "Chromecast was easy to install and use. I highly recommend this to everyone", "verified": true, "helpfulness": "0/0", "author": "Kelly Croy"}]