[{"rating": 5.0, "review": "I'm extremely happy with these. I ordered 2 for my parents (one for each TV), and they love it for streaming their favorite Chinese TV shows from their laptop, or sometimes I just walk into the room and fling a YouTube video from my phone. All I need to watch anything anywhere with one of these connected to the TV in my house is my phone. If I'm using my laptop, I can use it on my laptop too. The price is just the cherry on top!", "verified": false, "helpfulness": "0/1", "author": "Marylin Brando"}, {"rating": 5.0, "review": "The best thing you can add to any TV with HDMI.Super simple to use!I love it. And it updates itself automatically!!", "verified": true, "helpfulness": "0/0", "author": "Tre"}, {"rating": 5.0, "review": "I got it fast after it was back ordered.  Easy to install and operate with my Visio big screen.  Everyone in the house is happy with it.", "verified": true, "helpfulness": "0/0", "author": "kent7777"}, {"rating": 4.0, "review": "This product should definitely receive 5-stars because it has a high build quality that you can expect from Google. It, however, received a one star reduction because of its lack of applications that are supported. While I do understand that it is still in early beta, if you are not a tech-savvy person, please wait until it is more widely supported. If you really want to buy it, then by all means please do.", "verified": true, "helpfulness": "2/2", "author": "Taaha Mahdi"}, {"rating": 4.0, "review": "Simple and elegant. Shows why Google is the best tech firm. Only if it works with local files as well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Chromecast is a pretty cool device. Just the switch of an input and you can show any YouTube video, Netflix, or tab from your Chrome browser on your computer. On mobile, you can stream YouTube and Netflix TO your tv very easily. Response is a little delayed along with a few seconds of loading time, but what do you expect from a small, sleek, first of its kind product for a really good price?? Doesn't get much better than that if you ask me. Also, it is 720p, not 1080. Very cool gadget", "verified": true, "helpfulness": "1/1", "author": "Jake"}, {"rating": 4.0, "review": "The Chromecast works great; super easy to set up.  Will be even better once Google strikes deals with more content providers.  But, for now, works a lot better than an HDMI cable ... for not much more money!", "verified": true, "helpfulness": "0/0", "author": "MD User"}, {"rating": 4.0, "review": "Works well, little difficult to set up. sometimes there are WiFi issues connecting.Once its setup, seems to work well with iPhone or iPad.", "verified": true, "helpfulness": "0/0", "author": "ITguy4U \"ITGuy4U\""}, {"rating": 5.0, "review": "I'm so glad we bought this device!  I love how it streams from any device from anywhere in my house!", "verified": true, "helpfulness": "1/1", "author": "Michelle Roberts"}, {"rating": 3.0, "review": "is okay but not too many options so I will wait for better one comes out  just wait for better one", "verified": true, "helpfulness": "1/3", "author": "jewelplus"}]