[{"rating": 5.0, "review": "that's my second chromecast, no regrets, excellent. I wish google add spotify.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Just about anything you can play from your phone you can cast to chromecast. I've primarily been using it for Netflix and Youtube and occasionally Pandora. I can honestly say that it works...ok. It's a bit cumbersome at times because you have to do everything on your phone. The biggest annoyance is having to quickly pause a video or song and it can take a long time to connect again to pause. Sometimes it takes forever to log off.That being said, this is by far the cheapest solution to make a tv or monitor into a smart tv. Even beyond that it's extremely convienient. On a recent vacation my wife and I stayed in a cabin without TV so I connected it to a computer monitor and we had tons of stuff to entertain us.The Chromecast isn't perfect but for the price and convienience it's excellent!", "verified": true, "helpfulness": "0/0", "author": "Sunshine"}, {"rating": 5.0, "review": "A$35 entertainment system!  Makes my iPad part of my entertainment system!", "verified": true, "helpfulness": "0/0", "author": "Rico Dante \"E .C.\""}, {"rating": 5.0, "review": "Got this as a gift for a friend and they love it! Works really well, just make sure you have either a USB port on your TV to power it or an outlet you can plug it into. Also it does require a wifi network to work so it must be in range.", "verified": true, "helpfulness": "0/0", "author": "BGaulin"}, {"rating": 5.0, "review": "Amazing solution!! we have 3 of these in every single TV. More applications will eventually support it but so far so good. Specially for young kids youtube videos", "verified": true, "helpfulness": "0/0", "author": "LGuiriga"}, {"rating": 4.0, "review": "So good I am ordering 2 more for older TV sets around the house,", "verified": true, "helpfulness": "0/0", "author": "Alex Andrade"}, {"rating": 3.0, "review": "I have cut the cord and saving money every month.  I already have a Roku Stick so figured I would get this Chromecast.  While it is great in some regards, there are some things that bug me about it and I guess figured wasn't an issue, but is.There are no remotes or on TV channels with this.  So, you are left up to use your phone or tablet to control the streamer.  Now, this doesn't seem like a big issue, but the apps on the phones are touchy with getting the shows to cast to the device.  I also had issues with Hulu Plus jumping back to the beginning showing commericals and crashing.  If you use your phone at all while casting, there are issues.  I guess I got spoiled by having the apps or channels on the screen and using the remote to run through them.  Really, you MUST use a phone to run this, there is nothing on the screen otherwise.  That is a big disappointment.For me, it seemed like a hassle for what it's worth and ended up going to a refurb Roku Stick for my second TV.  They were the same price.  So, I guess it's ok but understand the major flaw.", "verified": true, "helpfulness": "0/0", "author": "mnpilot"}, {"rating": 5.0, "review": "Fabulous!", "verified": true, "helpfulness": "0/0", "author": "brownies-r-great"}, {"rating": 5.0, "review": "Good! Does what it is supposed to do.", "verified": true, "helpfulness": "0/0", "author": "Daniel R Turner"}, {"rating": 5.0, "review": "Awesome !!! this little guy blows away other devices such as Roku2 and the Smart Samsung DVD player (which are the one I have). First, I paired it with my android phone. It was really fast and the picture quality was very good. Sometime my kids watched movies on Netflix, I thought they used the DVD player. Later I bought a Chromebook to pair with it. For Netflix, Hulu, Youtube, it resumed to where you left off, fast-forwarded... instantly. I could also have the whole webpage on my big screen TV as fast as it on the Chromebook. The web browser on the Roku2 or Samsung DVD player is very slow compare to this little device and it costs only ~ 1/3 the price of the others.", "verified": true, "helpfulness": "0/1", "author": "Harrison Le"}]