[{"rating": 4.0, "review": "Regarding my Amazon Fire recent purchase.1- Easy to order, easy to instal- very easy (including Internet hook up2- Very disappointed.  80% of the movies I want to watch are all requiring I pay something on account.  The clear advertizing message , and my expectation, from Amazon was after paying for Fire package,  including Prime, I would be watching literally thousands of free movies and older serial TV shows.  So far, about 80% of what I selected has a charge.  Some such as House of Cards even have a weekly episode charge for over 20 episodes per season. EXPENSIVE  In another case, I finally found a movie my wife and I would like, I moved it to my wish list but when I later asked for the movie on the voice command, I was directed only to a PPV version of the same movie.3- Equally disappointing was to TV serial charges , are the uncertainties.  Even NPR television has charges.  For example I am ready to drop Direct TV, particularly after I read in papers ,  of an Amazon NPR agreement, so I could cut the cable and watch Dowton Abbey on Prime instead of live TV/Cable.  Now I am not sure of the cost but also if the latest  Dowton Abbey will be available the same night/same week or even same year  and at no charge.  The same for video serials  that I follow on TNT such as The Ship and others.4- It sure woud be nice if one could print up over the internet, a list of Prime detailed instructions of FAQ's for us older retired folk.I sure hope for a response to my comments.Sincerely", "verified": true, "helpfulness": "1/2", "author": "Paul Vilandre"}, {"rating": 4.0, "review": "Love the speaker feature. The reason for 4 stars instead of 5, there are some Apps that are on Roku that are not on the firestick.", "verified": true, "helpfulness": "0/0", "author": "Chazz"}, {"rating": 4.0, "review": "I like being able to log on to movies quickly, I have a lot of trouble finding movies that interest me. Haven't figured it out yet. not a true computer geek.", "verified": true, "helpfulness": "0/0", "author": "havoccat"}, {"rating": 5.0, "review": "works great and so easy to hook up !!", "verified": true, "helpfulness": "0/0", "author": "larry weatherford"}, {"rating": 5.0, "review": "Good quality !Happy so far ;)", "verified": true, "helpfulness": "0/0", "author": "fersi"}, {"rating": 5.0, "review": "I've owned several devices over the years.  This one by far exceeded my expectations.  It has everything I need and more!  I use it primarily with my Plex service and it makes my media center experience easy.  My children use it without problems.", "verified": true, "helpfulness": "0/0", "author": "gibblove"}, {"rating": 5.0, "review": "While I do not agree that the Amazon Fire TV is a “game changer” I will say that when you consider cost, features, function and future possibilities it is the best on the market. It already works better as a part of Amazons infrastructure (effortless Amazon music/video integration) then Google, Microsoft (Xbox), or even Apples streaming products. It has excellent content selection (not the best but most will be more than satisfied) with Amazon’s amazon customer service on the backend. I mean does any other service refund your money due to poor video quality? Now think about future possibilities, it should be pretty easy to tie the Fire line directly into the Echo infrastructure. Amazon please update and continue to sell this excellent product. I really look forward to the next rendition.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I like this product a lot.", "verified": true, "helpfulness": "0/0", "author": "Dennis R. Pope"}, {"rating": 4.0, "review": "still learning how to use it, but seems to deliver as promised. having an issue with audio hookup", "verified": true, "helpfulness": "0/0", "author": "theonne bittenbender"}, {"rating": 2.0, "review": "I can't make it work through Bose console.", "verified": true, "helpfulness": "0/0", "author": "Poor Bill"}]