[{"rating": 3.0, "review": "This is a handy device, but the range is limiting.  I tried using it in my living room with my router in another room, about 30ft away...it couldn't pick up my wireless network.  It will work on my other TV which is about 20ft from the router.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"tjay@ameritech.net\""}, {"rating": 5.0, "review": "works well, convenient device, driven by Chrome browser and its features", "verified": true, "helpfulness": "0/0", "author": "Paul Colombo"}, {"rating": 5.0, "review": "I added a wireless netgear device to my home pc and installed the chromecast on my tv works great, what you see on your computer you see on your tv great for streaming movies over the net.", "verified": true, "helpfulness": "0/0", "author": "keystarm"}, {"rating": 3.0, "review": "This is compatible with my Samsung Tablet. Works with my Samsung television great for YouTube. I wish there were more compatible apps. Ocassionally requires a lot of restarting to get it to work. Screen mirroring may make this obsolete", "verified": false, "helpfulness": "0/0", "author": "Onedertwin"}, {"rating": 1.0, "review": "I can't install. No signal in TV.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Wilches Cruz"}, {"rating": 5.0, "review": "Broadcasting to my TV now is super easy! I love this device and plan to buy more for my guest room and bedrooms.", "verified": true, "helpfulness": "0/0", "author": "adr4"}, {"rating": 5.0, "review": "Ordered 5. These are awesome", "verified": true, "helpfulness": "0/0", "author": "l bunn"}, {"rating": 3.0, "review": "I bought this item from Amazon with the idea that I would be able to see my Netflix movies on my big screen TV.  I  have not been able to install the chromecast to do so and I have had 3 people installing/downloading it and either we are all idiots or its just not as easy to do as I thought it would be.  I put it back in the box and that's where it is to this day.", "verified": true, "helpfulness": "0/0", "author": "April D. Mathis \"ireadalot\""}, {"rating": 5.0, "review": "I really liked this device. It takes a little bit of getting used to, but it's still very easy to use. The price is good and I love how it works. It is a lot of fun. I strongly recommend this piece.", "verified": false, "helpfulness": "0/0", "author": "CrisGGirl"}, {"rating": 5.0, "review": "once I figured out how to use the chrome cast, it fit every thing I wanted into do. I watch movies, and tv shows on my tv rather than mykindle. My wife uses it instead of her iPad. If you use these devices to watch shows or movies, get this.", "verified": true, "helpfulness": "0/0", "author": "tony b"}]