[{"rating": 3.0, "review": "Unless you've got a Kindle Fire, it's just not worth the extra money above what a Roku costs.  Not enough video apps.", "verified": true, "helpfulness": "0/0", "author": "Dave Williams"}, {"rating": 1.0, "review": "The Fire TV is not DLNA certified which means you cannot stream from your own media server unless you are going to pay extra for an app and be locked into it's own software. The unit must be unplugged constantly to restart it so that it will connect to the internet (wired or wireless). After one month of owning this, I cannot say that I have ever owned such an overpriced worthless gadget in my life. If I had to define the Fire TV, it would be this: an semi-functional media client (at best) that has a main goal of up-selling movie rentals to you.", "verified": true, "helpfulness": "5/8", "author": "Jason Killingsworth"}, {"rating": 2.0, "review": "My frustration level with this product is through the roof. Hulu is REAL problem with this thing. Actually, for the first 4 weeks I had it, it was perfect, no problems whatsoever. Was able to watch my favorite shows on Hulu with very good pictures, sound, etc. Now, about 6 weeks into own this piece of junk, I get no picture on my Hulu shows, only sound. My WiFi signal is listed as \"very good\". I have rebooted countless times. I have turned off every other WiFi signal drawing device in the house for good measure, so the Fire can have the signal all to itself. No effect: no picture on Hulu, only sound. Or, picture for a second or two, then freeze frame while the audio continues. I have uninstalled Hulu and reinstalled it, I have done that twice, actually. No effect. I have cleared the cache and deleted the data from the Hulu app; no effect. WHY is this such a problem????? I can stream Hulu from my Mac -- in the same room, using the same WiFi -- NO PROBLEM. I can even stream Hulu from my iPad with no problem. Amazon Fire? Doesn't work. Here's the thing: why did it work perfectly for a month and then all of a sudden stop working? That's the part that infuriates me. I notice however, that the Amazon Prime stuff works just fine (figures) -- except they don't have the shows I want to watch, which is why I'm trying to watch Hulu. Netflix is also sluggish compared to Amazon Prime. Why offer the other apps if they don't work??? I'm a dissatisfied customer.", "verified": true, "helpfulness": "4/4", "author": "Lorenza"}, {"rating": 5.0, "review": "Good: 1) The voice control is great.2) The sound and video is also great3) Pandora sound is awesome and the screen saver pictures that come up are beautiful.4) Very easy to set up and use.  Easier to use than cable or most tv remotes.Bad: 1) security code is entered one visible number on screen at a time.  I am sure my kids have memorized it by now.2) Entire seasons of TV shows come up.  It would be great to sort through them by voice control or have favorite episodes.3) Parental controls are limited.  I don't even want my young kids to be able to see the rated R titles.", "verified": true, "helpfulness": "0/0", "author": "DWH"}, {"rating": 4.0, "review": "Why did I buy the Fire TV?  Because I cut the cord - or the cord to the dish as the case might be - the same I imagine as a lot of other people who would buy something like the Fire TV have done before me.  Even if you get it to use for nothing but Amazon Prime, you're still better off as you're paying for what YOU are interested in, not a carpet bombing of channels you never watch so you can get the five shows you do watch and the occasional movie.  But I digress, on with the review...This is a great streaming device.  It's extremely fast and intuitive, the remote is well designed, and everything just works really well.  I really appreciate that it has an optical out along with the HDMI since my receiver is a bit older and the HDMI ports don't support audio so I need to use the optical audio along with the HDMI.  There are only two things I don't like.  While the voice search is an awesome feature it only works with Amazon.  That would be a slam dunk feature if it worked with Netflix and friends.  My second complaint is the fairly short list of channels available compared to the venerable Roku (which is why I bought a Roku 3 as well).  The Roku interface isn't nearly as slick as the Fire TV but the channel list is enormous in comparison.  The odd thing about the Fire TV is that everything outside of Amazon is an app.  That works fine but it makes aggregating what you watch from different sources a bit of a pain.  Outside of the channels available which is my only real gripe, I think Amazon hit a home run with this.  It just works and works really really well.  They would have hit it out of the park if the voice search worked with other apps, the channel list was better, and there was a better way to aggregate what you're interested in.  I'm happy with the Fire TV but if there are other online channels you're interested in, you'll probably want a Roku as well.  I bought both because after watching several reviews it was obvious the Fire TV had a much better interface and a lot of what I wanted to watch was available with the Fire TV either from Amazon or Netflix or Hulu Plus - and all three implementations of those are great.  If I had it to do again, I'd still have bought the Fire TV and the Roku.  The interface is really well done especially for Amazon content if you have Prime so I'd rather use the Fire TV than anything else, but the available content just isn't there yet and the Roku is far better at aggregating.Bottom line is everything about the Fire TV is better but if you're mostly interested in the big services like Amazon (of course), YouTube, Netflix, Hulu Plus, Vimeo, etc. but other content is only available from the approved apps list that isn't terribly long.I have had almost no buffering issues at all.  Movies and TV shows start very quickly and it's extremely rare for something to buffer in the middle of watching it, and I'm using it over a wireless N connection right now, not wired.  Everything works great, works fast and video and audio quality are excellent.Since I cut the cord I realized there are a lot of great shows that aren't even available with \"offline\" services, which was a very pleasant surprise.  What you won't get with Fire TV or any other streaming device are the big networks.  I don't miss them.  The few shows I watched on the big networks that aren't available online I can usually pay for through Prime, or invest in a good HDTV antenna.  Either way you're still paying less than cable or satellite and only paying for what you actually watch.UPDATE:Well here it is exactly one year later and I'm still sold that this is the best streaming device.  The comments I made a year ago about how I thought the Roku was a better channel aggregator I no longer think is true.  I much prefer the way the FireTV groups things and it all seems pretty intuitive.  Updates are fairly regular for the most popular services like Amazon itself (of course), YouTube, Hulu, Netflix and a few others.  New channels don't arrive as quickly as they do on the Roku (why I still own and use both), but when the app is available on the FireTV, I always always use the one on the FireTV.  I'll stick to my original analysis in that if you have a diversity of interests you still need a Roku, but for all the big services, the FireTV is far far superior.  The interface is clearner, faster, more intuitive and probably most importantly reasonably consistent across apps.  If all you care about are the major services, get a FireTV and don't look back, otherwise you still need a Roku.A few months after purchase, I ran ethernet cabling to the living room where this sits.  While we never really noticed much buffering on Wireless-N, it's all but non-existent now.  There were a few times it disconnected from the wireless but I can't say if the router was the issue or the FireTV.", "verified": true, "helpfulness": "1/1", "author": "Earnie Shoes"}, {"rating": 1.0, "review": "Why is everything complicated to watch and charges for everything?  Even with prime trial membership everything has a fee!!!  Going to return this item.  Why do many programs only have watch list?  What is watch list?  Very disappointing.  Alot of junk.  What are we doing wrong?", "verified": true, "helpfulness": "1/8", "author": "DSC"}, {"rating": 5.0, "review": "I have more than a dozen video players around.  5 WDTVs, a few roku, and on and on.  This is the current favorite, Its FAST, and the games are pretty good.", "verified": true, "helpfulness": "0/0", "author": "R. Patton \"RobPatton\""}, {"rating": 3.0, "review": "I got Amazon fire TV on impulse when a deal was offered bundling it with Kindle Fire HDX.  I should have just updated my old Roku box.  I really really miss Roku's universal search function.  With Fire TV, I have to search Netflix, then search Hulu and Amazon separately... very frustrating.  I do like Fire TV's voice function, and the beautiful screen saver pics that turn my TV into a sort of meditation garden... but I suspect I will be going back to Roku in spite of those nice features.", "verified": true, "helpfulness": "1/1", "author": "Alexandra Bassett"}, {"rating": 4.0, "review": "I liked the voice search and the selection of games.  The interface is biased towards getting you to purchase Amazon content, which is understandable, of course. For video, I use Netflix and Amazon Prime, I seldom buy Amazon video. I'd like it to be easier to find Prime content. I do like the voice search, and I'd like it a lot more if it worked with anything besides Amazon. We're told that this will be available soon, but time will tell. This will be a better product when voice search is integrated with Netflix, and will be better still when Prime Music is integrated.", "verified": true, "helpfulness": "1/1", "author": "Robert Stephens"}, {"rating": 1.0, "review": "After only 2 days, the battery in the remote went dead.  The voice search feature has never worked.  And now the picture is blurred and there is a loud static sound.  Have you ever tried to contact customer service?  They make it almost impossible.", "verified": true, "helpfulness": "2/5", "author": "J. R. McCarthy \"Jimmy\""}]