[{"rating": 4.0, "review": "Love it! We have direct tv and when nothing to watch we choose Fire TV ! Hubby loves it for he watches way more tv than me so 4 stars for Fire TV!", "verified": true, "helpfulness": "0/0", "author": "Jean Mat"}, {"rating": 5.0, "review": "I love amazon fire TV!  There is so much available!  TV shows and series. Movies games and an endless supply of music including music concerts!  This is one of the best purchases I have ever made!", "verified": true, "helpfulness": "1/1", "author": "Sarah Christine Barton"}, {"rating": 5.0, "review": "Why did I wait so long? I always thought you needed a smart TV. With the AmazonFire Tv, my old TV is now smart!!!:-)", "verified": true, "helpfulness": "1/1", "author": "Jody L Svete Gerard"}, {"rating": 5.0, "review": "The voice remote is the best! This was so incredibly easy to use and set up and gives us access to all of our media outlets including Netflix, Prime, Hulu Plus, and YouTube (through ProTube) and many other built-in apps. My husband and I just made the leap from cable to streaming services, and this was the best device for the transition (we didn't want one that required us to use our phones). I'm excited to purchase the Fire Stick for the other TVs in our home.", "verified": true, "helpfulness": "2/2", "author": "Heather Lister"}, {"rating": 5.0, "review": "The Fire TV was easy to hook up, connect to my wifi, and set up my account. It's great to have Netflix and Amazon Video together. It's so much faster and less glitchy than the Apple TV. So far I love it!", "verified": true, "helpfulness": "1/1", "author": "cinji"}, {"rating": 1.0, "review": "This item worked well for two days, after which it failed to work at all. The light on the front flashed a white blue and quickly changed to an orange flashing light. There is no instructions for troubleshooting ad it just wot work. Doing a search showed that ours is it the only unit having this problem. I just want a refund ad will this twice before adding any more Kindle products.", "verified": true, "helpfulness": "1/5", "author": "C."}, {"rating": 1.0, "review": "This box doesnt live up to it's name.  I've purchased 3 movies and was refunded due to the low quality and inability to stream. Wouldn't recommend", "verified": true, "helpfulness": "2/5", "author": "Kiwasha S Kelly"}, {"rating": 5.0, "review": "I only leave reviews (not very in-depth) for items that I feel deserve it (Good or Bad).I bought this after listening to a iDB podcast. I'm very glad I did.The device is more capable than I thought, especially compared to the Apple TV 3 (which I've had for years).A couple neat things:-support of many different USB devices and inputs. I use the XBOX 360 wireless dongle to hook up 4 XBOX 360 controllers for their games and controlling the interface in general.-Bluetooth remote. That means you don't have to point the controller at the box which means you can hide it behind the TV out of the way.I use it more for the XBMC/Kodi application you can put on it; runs like a dream.Tech savvy users:The real bang for your buck, to take advantage of the powerful hardware, is after you tweak it slightly (just google aftvnews and read BEFORE hooking it up online)", "verified": true, "helpfulness": "2/2", "author": "Wolfe"}, {"rating": 5.0, "review": "Pleasantly Surprised! Amazon Fire TV works well and I use it along with my Amazon Prime subscription (Hulu Plus and Netflix UHD as well).PS. Actually, I bought two for two different TV's. Thinking of getting a third as a gift for my parents.", "verified": true, "helpfulness": "0/0", "author": "Rob"}, {"rating": 5.0, "review": "Easy to set-up...easy to use....love the music with Amazon Prime. Very happy with purchase.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}]