[{"rating": 5.0, "review": "Item is as posted, shipping fast and communications great A++++", "verified": true, "helpfulness": "0/0", "author": "jerry r. tabler"}, {"rating": 5.0, "review": "Love this", "verified": true, "helpfulness": "0/0", "author": "Readers Confession"}, {"rating": 1.0, "review": "It did not work right .", "verified": true, "helpfulness": "0/0", "author": "nancy matteliano"}, {"rating": 5.0, "review": "Received and performed exactly as expected", "verified": true, "helpfulness": "0/0", "author": "Vernon"}, {"rating": 5.0, "review": "Shipping=ExcellentProduct=Excellent", "verified": true, "helpfulness": "0/0", "author": "Alberto Ong"}, {"rating": 1.0, "review": "chromecast sucks!!!! It is easy to install, easy to use and everything.... BUT IT DOENST WORK!!!! I have 15mb internet, I watch full HD videos on my Apple TV all the time, Netflix, YouTube, and I never had problems... Now with chromecast witch I bought for a tv in my bedroom (trying to save some money) IT DOENST WORK!!! For a 1 hour Netflix episode, it's stops like 10 times for loading... It freezes often, disconnects from the iPhone and you have to start all over again.Bottom line, spend a few bucks more and get an Apple TV... You won't regret it.", "verified": true, "helpfulness": "0/1", "author": "Guilherme"}, {"rating": 1.0, "review": "Worthless.It only works one out of twenty times you try. For a one hour movie...it takes me two hours to get it to work. I have 2 Apple TVs and an Amazon Fire. I'd much rather spend my time watching my show through one of those units, rather than trying to get this one to work. You could sell it for $5...it still isn't worth it. I have been patient, and optimistic...but I only have so much patience and optimism.", "verified": true, "helpfulness": "0/1", "author": "MGL"}, {"rating": 5.0, "review": "Super easy to set up! Works great playing from my Galaxy Note and my roommate's Macbook pro. Has some issues playing off my iPhone 4 (understandably). Has really made my Hulu and Netflix experience more enjoyable overall. My mom liked it so much she got one too.", "verified": true, "helpfulness": "1/1", "author": "Leslie"}, {"rating": 5.0, "review": "So much more convenient and efficient for streaming YouTube and Netflix straight to your TV than connecting a laptop to your TV's HDMI port. I can just sit back and control what I watch using my phone.", "verified": true, "helpfulness": "0/0", "author": "Daniel Lyu"}, {"rating": 1.0, "review": "In one word: terrible.I have a Roku 3 and it is fantastic.  It has the Chromecast Youtube app and I have no problems with it.  Unfortunately I can't stream my desktop to it.The Chromecast drops connection constantly, restarts at times, can turn on a TV but not off.  It would be useful if I could listen to my music on it longer than 5 minutes.", "verified": true, "helpfulness": "0/1", "author": "Zach"}]