[{"rating": 4.0, "review": "the only missing features which would make fire tv totally superior to the apple tv (which i was a heavy user of before getting your product) are (for me, of course):-- difficult navigation between seasons and episodes for tv shows: too many \"go up, click, go down click, go right click\";-- more visible episode information, such as the name of the episode (currently it is hidden in the block of text);-- more visible available, but not watched yet, episodes (very much needed for a quick lookup);-- information on the cast, leading to an easy search for the actor's director's other titles.other than that - i've switched my hdmi cable from apple tv to fire tv :-)", "verified": true, "helpfulness": "3/3", "author": "Yury Bogomolsky"}, {"rating": 5.0, "review": "Best addition to a home theater system. If you have Prime it is a must. Tons of free movies. 10x faster than the Apple TV.", "verified": true, "helpfulness": "0/0", "author": "spencer bull"}, {"rating": 5.0, "review": "I disconnected my tv and got this! Pretty much all I need in one. Very Cool and I highly recommend it!", "verified": true, "helpfulness": "0/0", "author": "randy"}, {"rating": 4.0, "review": "This little box is impressive. At first I did not know what to think about it since it was new, and almost bought a Roku. I changed my mind and decided to give the Fire TV a try. So far it has been a joy to use and has brought new life to the TV in our home office. We did not have a cable connection in that room and contemplated paying to get one installed. Enter the Fire TV and presto... we are now watching all of our shows with no problem, and the added bonus of being able to play games isn't bad either. Give it a try, I think you will like it.", "verified": true, "helpfulness": "1/1", "author": "E. Richardson"}, {"rating": 5.0, "review": "No longer have to hunt and peck to searce. The voice search works great and makes the Fire TV  my favorite. Grandchildren love the games.  No lag and quick access also a big bonus.", "verified": true, "helpfulness": "0/0", "author": "Thomas Wilcox"}, {"rating": 5.0, "review": "I'm thrilled with it, plug and play.Couldn't be happier, easy to use, easy to figure out. Well made. Great product, Service!", "verified": true, "helpfulness": "0/0", "author": "Patricia Van Lierop \"Hamburgerpat\""}, {"rating": 5.0, "review": "Faster, voice search is handy, typing is easier, content available is good. Over all improvement over ITV and the game controller is good.", "verified": true, "helpfulness": "1/2", "author": "Charles Knowles"}, {"rating": 4.0, "review": "I just got it yesterday, but so far I really like it.It's easy to setup and very easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Irma van Amstel"}, {"rating": 5.0, "review": "I was about to buy another devise when I saw the ad for the Amazon Fire TV, knowing their reputation for excellent productsI decided to buy the Amazon Fire TV, I'm very happy with the devise and give it five stars", "verified": true, "helpfulness": "0/0", "author": "hamking"}, {"rating": 5.0, "review": "I received my item very fast after ordering. Nicely packaged, well protected. Easy to hook up. Faster/Better connections with my WiFi than any other streaming player I have had in the past (had several). I no longer get any buffering issues, no more grainy videos due to connections. Great Video in HD. Love it!If I had any suggestions for improvement:1)  Increase the number of applications and services2) Add bluetooth capabilities allowing consumers to pair to their mobile or other blue tooth device to stream pics, video and music to the Amazon Fire TV box for viewing on TV3) Add Aereo ([...]) as a supported application/service allowing consumers to stream local tv in HD direct through the Amazon Fire TV box. This coupled with the Amazon and Netflix video services would allow consumers to eliminate cable/sat TV and go all in with Amazon", "verified": true, "helpfulness": "1/1", "author": "Brian Frey \"KeepingItReal\""}]