[{"rating": 4.0, "review": "Works as advertised except that most of the Amazon content is fee driven, I expected a variety of free movies and tv, not so........", "verified": true, "helpfulness": "3/5", "author": "Thomas Eliason"}, {"rating": 5.0, "review": "It would be nice if it offered a USB Control dongle in the box.  We purchased ours after market.  So far the Control 4 Drivers work pretty well.", "verified": true, "helpfulness": "0/0", "author": "aavdistributors"}, {"rating": 5.0, "review": "the only drawback being it gives you access to a lot of extra program streaming and so forth that it makes one wonder when you have time to watch all that is available.  In my view this unit further makes cable TV kind of senseless because you pay for a lot of crapola these days and it is getting worse.  With Fire TV you can watch a lot of programs heretofore only available on cable and still get the original picture quality.", "verified": true, "helpfulness": "1/2", "author": "Gunther \"woodworker\""}, {"rating": 5.0, "review": "LOVE IT!!!  Extremely easy set up! EXTREMELY user friendly!!! LOVE voice mic, love easy remote navigation!!  When getting ready for work, I LOVE Pandora and listen to my favorite songs!  I found this device very easy to use compared to latest Roku, Raspberry and remote works better then Apple TV!!  Gosh.. I hated using the remote to Apple TV. I had to press button a billion times on the Apple remote and completely frustrated me!!! THIS DEVICE is a great price for everything it offers.  Highly recommend!!!", "verified": true, "helpfulness": "1/2", "author": "Luvlytrinity"}, {"rating": 5.0, "review": "Meets or exceeds all my expectations. It is simple to use and the on screen tutorial is comprehensive and clear.", "verified": true, "helpfulness": "1/2", "author": "Denis Gilmore"}, {"rating": 5.0, "review": "Great unit. We love it. Some really great features like voice activation. Voice activation needs to be available across the board not just for Amazon products other than that though the unit is fantastic.  Super fast processor. One other small very important glitch or should I say oversight. There needs to be a primary power on off. I don't like that the unit stays on for 15 minutes before shutting off by itself. That feature does not always work. There seems to be open apps in the background that cannot be shut off individually. If you can fix that with a minor software update the unit would be not only be 100% but 1000%. As always Amazon is the best we do love the unit. Please continue to add additional channels I hate to see roku three with so many.", "verified": true, "helpfulness": "2/3", "author": "David P. Biasco Jr."}, {"rating": 5.0, "review": "Does everything I expected better and easier than I ever imagined possible. Threw my Google Chrome in the trash where it belonged.", "verified": true, "helpfulness": "1/3", "author": "Scott Pickett"}, {"rating": 5.0, "review": "I like this, and use my remote to start my programs even tho I have a Vizio  TV that has the programs listed on the TV.", "verified": true, "helpfulness": "1/3", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This is a great device.  I had been using my Kindle Fire and a cord to stream old movies, but the battery would go down .  This device is plugged into an outlet, so it is much nicer.  With Amazon Prime, we have not run out of Free movies to watch.", "verified": true, "helpfulness": "1/2", "author": "G. Price"}, {"rating": 4.0, "review": "Sleek design, very quick response. Voice search works well, but only searches amazon's prime video (i.e. not Netflix).  But functionally the same as Apple TV.  Much more functionality than a chromecast, but worse integration with YouTube.", "verified": true, "helpfulness": "2/2", "author": "Jack Zhu"}]