[{"rating": 1.0, "review": "I was so excited to get this that I was even willing to wait for the slight backorder on Amazon.I got it today. I plugged it in to my tv. It looked cool.It said to use a phone or tablet to connect, so I pull out my iPhone and go to their website.All was working smoothly until it gets to the step where it says my WiFi Password is wrong. It isn't wrong.I click \"try again\". It tries again for 3-5 minutes, then resets itself.I called Google support. They naturally blamed it on my router.I called Comcast support. They naturally said \"I dont know, would you like to pay for advanced tech support?\"I had them turn off the built-in router on my modem.I plugged in my known-good router that I have complete control over.I tried again. SAME STUPID FAILURE.I called Google support again. The B* on the phone literally had the stupidity/nerve to tell me \"It doesn't work with iOS yet.\"So I informed her that going to the setup website it said it works with my web browser regardless of device.She again repeated that it doesn't work with iOS. I said, \"okay, then what do you suggest I do\"?Google B*: \"You should buy an android device\"Then I hung up the phone and wrote this review. Now I will return this piece of junk.Dear Google, if you're listening, you were better off when you didn't have a phone number. At least then I thought your employees were too smart to help. Now I know they're too dumb.", "verified": true, "helpfulness": "28/84", "author": "Pavel Sokolovsky"}, {"rating": 5.0, "review": "Happy to sync my ipad 2 with my hd tv. Now hoping to get more vendors on board to caste.", "verified": true, "helpfulness": "0/1", "author": "Josephoine Rivera"}, {"rating": 5.0, "review": "Good bye to HDMI cables!With Netflix offer this is a bargain deal.  A must buy from Google.  Able to cast any webpage from my acer chromebook.", "verified": true, "helpfulness": "1/1", "author": "HIREN ROKADIA"}, {"rating": 2.0, "review": "So this thing is a slick package. I thought hmm.. for the price sure i can give it a go, although i have several Apple TV's around the house which do what this box does and then some.Considering that Google is a current business that presumably operates on the same planet, please.. why would you even release this thing until it's at least somewhat ready to compete with Apple tv. this thing lacks all sorts of features that apple tv already has and all in all this is basically google's marketing effort to get you to use their Chrome browser.If you are looking for something comprehensive that will work with your TV by extending it's usability drop the extra coin for apple tv otherwise you'll have a nice dust stopper for your hdmi port until google actually puts in some real thought behind this.", "verified": true, "helpfulness": "0/11", "author": "ALK \"AK\""}, {"rating": 5.0, "review": "I've been anticipating getting my Chromecast since it was first announced. So, luckily, when it came in the mail, setup was super easy and fast. I used the Chromecast app on my Nexus 7 and was guided easily through setup.I immediately began streaming my first video from the Chrome browser on my laptop. At first, my image was chopped on the edges, and I thought it was the Chromecast. However, I soon learned it was the overcast feature on my television, and I promptly disabled it.Since then, it's been fantastic. Great quality. No audio/video lags. I've had a couple stutters in streaming but that's largely due to my internet connection. The apps for casting are somewhat limited for now, but I have full confidence the market will expand. Even so, for $35, why wouldn't you buy this?", "verified": true, "helpfulness": "2/3", "author": "Cameron"}, {"rating": 4.0, "review": "I ordered mine directly from Google and got it last weekend.  A breeze to setup, and really slick to use from either of my Android tablets.  The only negative at this point is that it only supports Netflix and Youtube, although support for other services will be forthcoming.  It would be nice to see Amazon Prime support but that obviously isn't going to happen because Amazon wants you to buy into their closed tablet ecosystem.Once gripe that is not related to the product.  Something like 40 nitwits had already reviewed this product before it was even released, based on nothing but their like or dislike of Google.  Get a life you fools and don't review anything unless you have actually used the product.", "verified": false, "helpfulness": "4/5", "author": "SurlyHiker \"SurlyHiker\""}, {"rating": 5.0, "review": "This is exactly what I have been looking for. I have been using my \"Smart\" TV for the past two years to stream content from Amazon, YouTube and Netflix.  But the user interface is clunky and I might as well forget about them ever updating the apps. Plus, my TV does not have a means for me to stream my music collection. But with the Chromecast, you know that the user interface will always be up to date since it uses apps from your phone/tablet. I will be able to stream my music from Google's music service, watch any YouTube videos, and also my Netflix subscription. The only thing lacking is the ability to stream TV shows and movie rentals from Amazon. Amazon has been my main service for this for the past two years, so I have to admit this kind of sucks. It is really in Amazon's best interest to add support or they will loose a lot of customers. Google also offers a TV and movie service that is supports Chromecast; so I plan on using that from now on, assuming Amazon does not come out with a Chromecast friendly app soon.With that said, I am even more excited about what the DIY community might come up with. Google has already released beta API's for developers to start tinkering with, and the online community has already started coming up with some amazing apps. One developer has already written an app that will allow you to cast pictures and videos from your phone to the TV. He also wrote another app that allows streaming from cloud services, like Drive, Dropbox, and Box. Assuming Google doesn't block these abilities, they should be released to the general public in the near future ... cross your fingers. This little Chromecast is about to become a power house if Google allows it.", "verified": true, "helpfulness": "1/1", "author": "A. French \"AlexNC\""}, {"rating": 3.0, "review": "This gadget, from one of the world's pre-eminent tech giants is a disappointing distraction.  It does nothing new for your TV.  The only broadcasts that can be seen are Netflix, and Youtube.  You can see both on your home TV without this gadget.  You can also view Chrome web sites on the TV with the aid of the Chromecast add-on.  I am surprised that Google released this dongle without more content available.  There is discussion on-line, and in the press that more content may be coming, but for now, nada.  As an early buyer, I was promised a 3 month Netflix paid subscription which was to arrive by e-mail in five days from the shipping date.  No subscription has been forthcoming.  Recommend holding off on buying this gadget until Google provides a lot more content.  In the mean time, this thing is a distraction, and not a notable addition to your digital capabilities.", "verified": true, "helpfulness": "2/9", "author": "OlympicWest \"OlympicWest\""}, {"rating": 5.0, "review": "It works with any laptop, smartphone, and tablet even if it's not your own.The only bad thing is that it doesn't come built-in on every TV, and Stereo.", "verified": true, "helpfulness": "1/2", "author": "Luis"}, {"rating": 5.0, "review": "I've been using this a ton since I got it. It's not a do-all streaming device, but I can stream hulu, youtube, and movies from my pc (as long as the movie is encoded correctly). The coolest thing is that I can cast videos from youtube and it puts no load on my pc or phone.", "verified": true, "helpfulness": "1/1", "author": "SkiHood \"SkiHood\""}]