[{"rating": 4.0, "review": "Superb wireless companion to have around. I hope the apps that support keep growing!", "verified": true, "helpfulness": "0/0", "author": "Abbas Dawood"}, {"rating": 5.0, "review": "I used to watch videos from my phone all the time. I finally gave in and bought a chromecast and it's amazing. Easy set up. Turns on my TV by it self when I want to stream! It's insane!", "verified": true, "helpfulness": "0/0", "author": "Thai Do"}, {"rating": 4.0, "review": "Little issue with Netflix but other than that it's work great.", "verified": true, "helpfulness": "0/0", "author": "Dijah"}, {"rating": 1.0, "review": "Was stoked about getting this item.  I even moved the Apple TV to the basement.  Upon first set up everything went well.  Easy.  Then after a few days it started failing.  Over and over.  We were haunted by the error messages and inability to reconnect the device.  What a piece of junk.  Pay more for the Apple TV.  There's a reason it costs more.  That reason:  it works.", "verified": true, "helpfulness": "1/1", "author": "Nando U"}, {"rating": 5.0, "review": "Super easy set up. Can cast videos, screen from my S4, and any browser tab. Love it, and can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Amy"}, {"rating": 5.0, "review": "Inexpensive and awesome.  Nothing more need be said.", "verified": false, "helpfulness": "0/0", "author": "Brandon Stout"}, {"rating": 5.0, "review": "Love my chromecast!", "verified": true, "helpfulness": "0/0", "author": "Nashka"}, {"rating": 5.0, "review": "Bought a \"smart TV\" two years ago, the apps on it are limited and never work right. Broke down and bought Chromecast and have not looked back. Now we can watch Netflix without having to wait for it to buffer every so often. Love that we can view our pictures on our TV now without downloading 3rd party software to that works with our type of TV. With Chromecast, we can use our phones as the remote, or our tablets, or our computers; which ever is near. Wish we would have just bought Chromecast sooner and saved the money that we spent on the not so smart \"smart TV\".", "verified": true, "helpfulness": "1/1", "author": "Jennifer"}, {"rating": 4.0, "review": "For $35 I think it's really good.", "verified": true, "helpfulness": "0/0", "author": "Allen Fepuleai"}, {"rating": 2.0, "review": "not good enoughyoutube works mmmmmmmm", "verified": true, "helpfulness": "0/0", "author": "Eduardo"}]