[{"rating": 5.0, "review": "This product delivers what it advertises. It has thousands of more possibilities. It is simple and quick to install it. I just love it...", "verified": false, "helpfulness": "0/0", "author": "Joel Rodriguez \"Joelyesca\""}, {"rating": 5.0, "review": "This is a very inexpensive way to broadcast your mobile devices to your television.  A lot of people have grumbled about it a separate power connection, but I didn't have an issue with it.The set up was very fast, and I have moved it from one TV to another several times with no problems.  On my TVs, there is a USB port next to an available HDMI port, so I just power the Chromecast on the USB there.I have been using it most for YouTube and playing music.", "verified": true, "helpfulness": "1/2", "author": "S. Stidam"}, {"rating": 4.0, "review": "I don't have a TV with WiFi so this enables me to watch Netflix without having to use my Xbox 360; The picture quality is awesome. I cant wait until there's more apps that have the \"cast\" feature.", "verified": true, "helpfulness": "0/0", "author": "Roccfoxx"}, {"rating": 5.0, "review": "Anybody who thinks that this product isn't fantastic for the money is looking at it from the wrong perspective. Let's pause here and think about what the product does, and how much you have to pay for it. Now think about other products that do something similar, and how much you have to pay for those...The ability to use your smartphone or tablet as a remote is a nice feature, but having the ability to wirelessly share your laptop screen is fantastic! Granted if you're trying to stream video from your local files, it will tend to be a bit laggy but if you're just attempting show the family portraits this product is fantastic! Another great product from Google.", "verified": true, "helpfulness": "0/0", "author": "TechHwk138"}, {"rating": 4.0, "review": "I have been pleasantly surprised with what this can do for being a $35 item.  It will only get better as more apps support it.  I ordered it on July 24th and still haven't received my 3 months of Netflix code.  Please email it Amazon, I have some TV shows to watch!", "verified": true, "helpfulness": "1/1", "author": "D. Fitzgerald \"fitz\""}, {"rating": 3.0, "review": "As long as you know that the Chromecast needs Chrome to run and can only watch Netflix, Youtube, or surf the web via Chrome, then this device will work fine for you.A big issue that bummed me out was I thought I could take it on the road and watch Netflix on my hotel TV.  The Chromecast has to be on the same network as the laptop and the Chromecast can't communicate with any hotel router that asks a question for entry such as \"Do you agree with these terms?\" or \"What room are you in?\"  Chromecast has no provisions for logging into wireless networks therefore it is only useable on home networks. I'm picking up a TPLink mr3040 portable router and will try to get Chromecast to work in the hotel that way but it is getting to be a PITA.As for how Chromecast works at home, it is pretty cool, the kids are starting to use it to watch youtube videos and play music videos from their Android phones.  I like it for browsing the web.This product has huge potential but it is too restricted now... I'd give it a year.", "verified": false, "helpfulness": "6/8", "author": "AK"}, {"rating": 1.0, "review": "Until bugs are fixed and things are added, and people stop RIPPING people off there isn't a point to buy this.  They pay $35 for it and I've seen some people buy it for 120...  Wait 2 months for supply to catch up and the features to be even better.", "verified": false, "helpfulness": "8/45", "author": "Monk"}, {"rating": 4.0, "review": "For reference, this is my setup:Time Warner Cable in Austin, Texas with gamer speed, on really old shared wiring that is so bad there isn't enough power to get actual cable--I just have cable internet; a MediaLink router; a four-year-old Korean re-branded Viore monitor without a working antenna, but with three HDMI ports; and, a two-year old basic Dell, factory setup laptop.Having said that:  my cable service, despite paying for \"gamer speed\", is pretty shoddy during peak hours.  HuluPlus and Amazon on Demand seem to have packet streaming that deals with that pretty well--I have to restart movies during peak hours, two or three times, but other than that I don't have much interruption.But, I thought this didn't work at all with a two-year-old Dell laptop because it couldn't connect during peak hours. (It wouldn't work at 10 p.m. on a Monday night). Then, my boyfriend got it to \"Cast\" using a Samsung phone at about 11:00 p.m.. We like to watch very old Led Zeppelin videos on YouTube, and it did work well for that. The video and audio with even really old footage is excellent.The next day, I had no problem at all getting it to cast at 1:00 a.m., from my laptop.  As of this writing, though, I don't think it works unless your cable is really good.If you have bad internet, this isn't worth the money.  The free Netflix is nice, though.", "verified": false, "helpfulness": "1/1", "author": "L*"}, {"rating": 1.0, "review": "At $35, I bought based on the high-level pitch & promise they gave on the product.  My fault for not reading all the nuances of the limitations but they are significant... other posts get into it so I won't rehash.  I think I want what most everyone wants, flip up my content to the TV from connected devices.  Thought this would get me there...", "verified": false, "helpfulness": "5/40", "author": "SeaTan"}, {"rating": 2.0, "review": "The setup was such a challenge.  After connecting to TV, Chromecast needs to be setup through a computer/smartphone.  I used my MacBook to fire up the app that I was asked to download as part of the setup process.  My MacBook could not complete the setup process as I was constantly getting an error message that my router settings needed to be modified to unblock UnPP streaming.  After several attempts, I gave up and tried the same setup process on a Windows 8 machine.  The setup software during the installation was stuck up mid way as it required .NET foundation 3.5 and upwards, strange as I had 4.0 installed on my computer.  I gave up and tried on another Windows 8 PC. Same error message about .NET foundation.  As a last resort, I used my iPhone to complete the setup process.  If I was unsuccessful with my phone I would have probably returned Chromecast.My troubles did not end there; after the setup was complete, Chromecast needed me to download Cast extension from my Chrome browser.  The cast extension would not recognize my Chrome cast device both on Win 8 PC as well as on Mac.  I get an error message that if router transmits signals both in 2.4 and 5 ghz, Chromecast may not be recognizable unless there are some tweaks again in the router.  To me this was absolutely frustrating.  After several restarts and shutdowns of both Chromecast as well as my computers, I was finally able to connect! Yeh!Here are few initial comments after using it for a couple of hours -  For people used to Airplay and Apple TV, Chromecast is very rudimentary.  From a computer, all it does is stream a specific open tab  identified for 'casting'. Nothing more.  It does not mirror your PC nor does it 'cast' any other application other than the chosen Chrome tab.I am not complaining as I was able to get the 3 months off for Netflix.  So including that discount, for 11 dollars I was able to connect wireless from PC to TV without an HDMI/VGA cable!Update on Aug 11, 2013After having used it for a few days, here are a couple of updates:1. I have been able to connect Chromecast  to only one of my computers.  I am still struggling to connect other devices, with the cast extension on my chrome browser refusing to recognize them.2. There is so much lag when I use Chromecast that internet streaming drags. I get a constant error message that my internet connection is too slow! I have a few internet bandwidth hungry devices at home and to support these I subscribe to higher bandwidth from my cable company and those devices never complain.I continue to be disappointed with this product.", "verified": true, "helpfulness": "2/11", "author": "UMKPK"}]