[{"rating": 5.0, "review": "We love this product.  We weren't sure what to expect but have already watched some great shows.  As a Prime Member we are able to enjoy a large number of shows free.  Easy to install and hook up to our home network.  The initial tutorial made it a lot easier to understand how to use and take advantage of all the options on the remote and Amazon Fire TV.", "verified": true, "helpfulness": "1/1", "author": "4dogs Vegas"}, {"rating": 5.0, "review": "I like how it comes on almost instantly.", "verified": true, "helpfulness": "0/0", "author": "Michael Dalaba"}, {"rating": 5.0, "review": "Exceeded my expectations. Set up was so easy, no buffering or waiting for streaming. I don't know why I waited so long. Well worth the money-so much so, I've bought a second game controller!", "verified": true, "helpfulness": "2/2", "author": "redigo"}, {"rating": 2.0, "review": "The fire TV worked great at my house but when I took it to school I would not connect with the WiFi in the dorms or with the aid of an Ethernet cord. Wish I could get it to work that was the main place I wished to use it.", "verified": true, "helpfulness": "0/1", "author": "Eli Clemons"}, {"rating": 4.0, "review": "It's a excellent equipment.I don't give 5 stars because the USB are useless and you can't play external media (AVI, MPG, etc)", "verified": true, "helpfulness": "0/0", "author": "Esmeralda Villarreal V"}, {"rating": 5.0, "review": "Love it, voice search feature works great", "verified": true, "helpfulness": "1/1", "author": "Steven Sartin"}, {"rating": 4.0, "review": "Great for Amazon prime member.", "verified": true, "helpfulness": "1/1", "author": "W. TRAN \"WT\""}, {"rating": 5.0, "review": "Fire TV is awesome!!! I'm so glad I dumped my roku.", "verified": true, "helpfulness": "2/2", "author": "David Scharler"}, {"rating": 1.0, "review": "Haven't bought yet - if it works through the internet, do you still need the TV feature from Comcast?  After purchasing the device, is the cost only for the Amazon Prime membership?", "verified": false, "helpfulness": "0/12", "author": "Diane"}, {"rating": 4.0, "review": "It's not bad would be better with a vudu app.. hint. .hint! !", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}]