[{"rating": 3.0, "review": "Keeps timing out.  Need it to run longer periods of time.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Blackburn"}, {"rating": 5.0, "review": "Setup was easy and it works great... I love having the ability to stream content directly from my phone and tablet to my TV.  And the number of apps available to stream content makes it a great tool for fun and business!", "verified": true, "helpfulness": "0/0", "author": "Geoffrey Moore"}, {"rating": 4.0, "review": "It works well, altho there is sometimes a little trouble with the mouths on tv and the words coming out at the same time.", "verified": true, "helpfulness": "0/0", "author": "D. Waggoner"}, {"rating": 5.0, "review": "I bought chromecast as soon as I heard it come out. My first chromecast i bought from google. I bought this one for my sister's house so i can stream from my phone when i visit. Initially, chromecast did not have a whole lot to offer but as time went along (netflix and few other apps), it improved and it is so awesome. I can now cast whatever is on my phone screen or tablet! turns any older TV into a smart tv for $35! cant beat that!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"maximus31ad\""}, {"rating": 5.0, "review": "WooHoo!!! Love it! take it anywhere!", "verified": true, "helpfulness": "0/0", "author": "alex Castro"}, {"rating": 5.0, "review": "My second Chromecast!  I purchased this one for my travel bag/RV so I could leave one connected to my living room TV.  This is the easiest way to shoot a chrome web page or video to a screen.", "verified": true, "helpfulness": "0/0", "author": "J. Hunt"}, {"rating": 5.0, "review": "good idea!!", "verified": true, "helpfulness": "0/1", "author": "Patsy Siliezar \"Cautious buyer\""}, {"rating": 5.0, "review": "It make watching Netflix & YouTube enjoyable.", "verified": true, "helpfulness": "0/0", "author": "Okunlola Oladokun"}, {"rating": 5.0, "review": "This is a plus for everyone,  hello", "verified": true, "helpfulness": "0/1", "author": "K. Greene"}, {"rating": 1.0, "review": "Although this device works as indicated, the unit I received was used and had equipment data loaded onto it. Unit description indicates new.", "verified": true, "helpfulness": "0/2", "author": "slong"}]