[{"rating": 5.0, "review": "Great gift!", "verified": false, "helpfulness": "0/0", "author": "Taylor"}, {"rating": 3.0, "review": "It worked for a few months, at first I had problems making the Ipad detect it, now the TV doesn't even detect it... the network doest detect it, and I literally put the WIFI Repeater 4 centimeters from the device behind the TV...It's a great idea, but troubleshooting this thing, when they say basically, \"do this\"and you \"did this\"you know you \"did this\"and there's nothing else you \"can do\"And I know it's not the repeater, or the wifi, or anything that Google blames for it not working besides themselves, because it worked for a few months there... now it's just dead in the water... not even being picked up by the repeater... it's just, kaput.", "verified": true, "helpfulness": "0/0", "author": "Mike M"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"artandtravel\""}, {"rating": 3.0, "review": "Doesnt stream too well umless you are using an app.", "verified": true, "helpfulness": "0/0", "author": "Ed"}, {"rating": 5.0, "review": "Great Product. I send shows from my computer to my TV", "verified": true, "helpfulness": "0/0", "author": "Althea Jones"}, {"rating": 5.0, "review": "Product delivered on time and works as described.", "verified": true, "helpfulness": "0/0", "author": "Chris  K."}, {"rating": 1.0, "review": "If you're thinking you'll save money to buy the Chromecast instead of the more expensive options like Roku, believe me, it's not worth it. Sometimes my chrome cast works... usually I spend so much time trying to cast a video that it exceeds the amount of time I would have spent watching a television show, and I give up. I really just don't get it. It will work fine then not at all for days, and the chrome cast help suggestions are just a slap in the face implying that the issue is anything but the s***ty device itself.", "verified": false, "helpfulness": "0/0", "author": "Elizabeth Buckler"}, {"rating": 4.0, "review": "If you don't have an internet ready tv, there is a lot of rigamaroll to deal with to set it up to play.", "verified": true, "helpfulness": "0/0", "author": "BJ or Stan Friedman"}, {"rating": 4.0, "review": "Late arriving and didn't receive 4 free months of  Hulu......the device itself is fine", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 2.0, "review": "I'm moving my TV viewing to direct HDMI hookup from my laptop.  Using Chromecast, veiwing some of my favorite shows results in a choppy experience as the signal moves from wifi to chromecast.  I am unable to watch Walking Dead with getting a headache, so now just directly hook up my laptop to the TV.", "verified": true, "helpfulness": "0/0", "author": "A. Jones"}]