[{"rating": 5.0, "review": "Omg this thing is great. I stream everything I ever needed. Just make sure your home wifi is fast enough or it'll overload the system because it's like running we devices streaming at once. So if you have cell phones, tablets and other computers connected it'll get really sloppy. I just use a separate wifi network for it and I can stream in HD all day long", "verified": true, "helpfulness": "1/1", "author": "Andrew"}, {"rating": 1.0, "review": "they don't tell you that you cant mirror with windows. all it does is stream from online.you cant play videos stored on your computer. this sucks I would rather use a hdmi cord and be able to play what I want on my tv.", "verified": true, "helpfulness": "0/1", "author": "Richard B."}, {"rating": 4.0, "review": "I have a love\\hate relationship with my Chromecast.  When it is working it is amazing but, sometimes i have fits with it where i have to reset it to get it working again.  Its like it loses it brains every once in awhile.  Love that it is very small.  I love the integration into the browser, netflix, Vudu, Plex, and many others.", "verified": true, "helpfulness": "0/1", "author": "The Zoner"}, {"rating": 5.0, "review": "Item is as expected and shipped quickly to me", "verified": true, "helpfulness": "0/1", "author": "Tina Clarice"}, {"rating": 5.0, "review": "This product is fantastic. I purchased 2 and it does well with my media stuff. I can watch my usual Netflix but also my collection of media files. Its great", "verified": true, "helpfulness": "0/1", "author": "George"}, {"rating": 5.0, "review": "Amazing little device to use with Netflix or YouTube! Very responsive but gets hot if kept on for long periods. Not sure if this will harm it though.", "verified": true, "helpfulness": "0/1", "author": "Some Assembly Required"}, {"rating": 4.0, "review": "Doesn't work with Amazon Prime.  Kinda wish these organizations would stop trying to slit each other's throats and work together.  My Google Music on my phone will cut off my music and start up on its own if I'm listening to Amazon on my phone.  Aggravating.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This is a pretty cool device. I keep on losing connection to the device from my iPad, and I have to power recycle every time I want to use the device.", "verified": true, "helpfulness": "0/1", "author": "Nirav Pradhan"}, {"rating": 5.0, "review": "Works very well with little hassle.", "verified": true, "helpfulness": "0/1", "author": "Alexandre Ellis"}, {"rating": 4.0, "review": "Works great!", "verified": false, "helpfulness": "0/1", "author": "Vijay T. Olander"}]