[{"rating": 5.0, "review": "all my famililly love it", "verified": true, "helpfulness": "0/0", "author": "Galumak"}, {"rating": 5.0, "review": "Everything was good. Product was brand new and works perfect. Plugged it in and it worked perfect with my television.", "verified": true, "helpfulness": "0/0", "author": "william brown"}, {"rating": 1.0, "review": "I thought this would be a great product to stream TV shows from my web browser since I am watching my favorite shows on the network websites on my computer.  The quality wasn't that great.  The voices weren't in sync with the lips which drives me crazy!  There was a constant choppy look to the screen as well.  Casting from the browser also made the picture choppy on my computer screen.  Once I stopped casting, my computer screen went back to normal so I knew it was Chromecast and not my computer.  I also have the fastest internet speed you can get with Comcast XFinity and even tested the speed which well surpassed streaming high quality video.  I am going to stick with Amazon Prime and Netflix using my Apple TV or PS3 and watching my network shows for free with my laptop.  (Cancelled cable recently so that is no longer an option.)", "verified": true, "helpfulness": "1/1", "author": "Stephen Ingalls \"Steve Ingalls\""}, {"rating": 5.0, "review": "The Google Chromecast HDMI Streaming Media Player makes life so much easier!  All you have to do is plug the Chromecast into your TV and you'll have flawless access to Netflix (with a paid subscription), HBO Go (with a paid subscription) and YouTube.  It's really the only device you need to catch up on your favorite television shows or to share videos with a group on your TV instead of your computer.  My only complaint is that Amazon Instant Video does not work on the Chromecast.", "verified": false, "helpfulness": "0/0", "author": "KatieO"}, {"rating": 4.0, "review": "Troubles: without screen mirror function and with few options of services to Brazil. Besides, it's not sold in Brazil yet.", "verified": true, "helpfulness": "0/1", "author": "Tiago Vinhal Pereira"}, {"rating": 1.0, "review": "This item is misleading in its promotion..they fail to tell you that a power outlet is needed. They fail to mention that it requires HDMI..also requires USB..does not live up its billing as a easy to use item..", "verified": false, "helpfulness": "0/2", "author": "edward d shields"}, {"rating": 2.0, "review": "I tried to watch \"Sherlock\" on Netflix, and while the picture quality was good, the sound quality was absolutely terrible. Also, I would prefer that this product was compatible with Amazon Prime, although I don't have a problem with that. I knew that it wasn't compatible with Amazon Prime when I bought it.I'm more irritated by the incompatibility with Netflix.", "verified": true, "helpfulness": "0/0", "author": "M. KINSLAND"}, {"rating": 4.0, "review": "It's exactly what I and anyone else should expect it to be. It's an affordable way to stream Netflix, Hulu, HBO and the like straight to their TV's without needing an expensive box to do it. The only thing that's missing is the ability to stream photos and videos taken on your phone or tablet straight to your TV.", "verified": true, "helpfulness": "0/0", "author": "zkrocek"}, {"rating": 3.0, "review": "there is no chrome broser window casting capability from ipad or android phone, only from desktop or laptop.false advertising!", "verified": true, "helpfulness": "0/0", "author": "MJ"}, {"rating": 3.0, "review": "Its not horrible.  Its not the best thing since sliced bread.  you are kind of limited.  We were hoping to use it at a hotel to catch up on some netflix but the hotels have firewalls and this prevented the use of the chromecast.  At least it was not an expensive toy.", "verified": true, "helpfulness": "0/0", "author": "Krissy Scott"}]