[{"rating": 5.0, "review": "This dongle is worth twice the price.", "verified": true, "helpfulness": "0/0", "author": "Dirk Derkle \"DakineAthon\""}, {"rating": 5.0, "review": "Great for streaming video. Even better than the built-ins that come with DVD-BluRay players.", "verified": true, "helpfulness": "0/0", "author": "integration_hero"}, {"rating": 3.0, "review": "Ive had this for a while now even though i do like it, it wont work with netflix. I guess for it being inexpensive you get what you pay for. I do enjoy however, being able to watch my favorite youtubers in my TV.", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 3.0, "review": "Works fine but lack of common apps disappointing", "verified": true, "helpfulness": "0/1", "author": "Ron Beaver"}, {"rating": 5.0, "review": "Love chromecast! My tv us a sharp so the internet is limited. Chromecast adds great functionality.If you have a samsung you might not find this that useful.", "verified": true, "helpfulness": "0/0", "author": "Brian Garber"}, {"rating": 1.0, "review": "For some reason, it barely connects to my TV. It can't find my wifi. I think it's because my TV is in a different room than the router. The product description should have mentioned any such requirements. I managed two watch few youtube videos and wasted around two hours for it. I returned the chromecast at the end.", "verified": true, "helpfulness": "0/0", "author": "Ashraf"}, {"rating": 3.0, "review": "Be very cautious ordering this wonderful device. Make sure you have an applicable smart phone or laptop in order to operate the program correctly. I had to return this product because i have an out of date smart phone and i am borrowing a friends HP Mini which has Windows XP on it both programs no longer supported. I was really disappointed!", "verified": false, "helpfulness": "0/1", "author": "wind_is_my_guide"}, {"rating": 5.0, "review": "So my cable company wanted over $100 to install cable in my back bedroom which was way too high for me because I am currently in a rental home and didn't want to spend that much just to have TV in the bedroom. I was considering buying a smart TV to put in the room so I could watch Netflix or HULU when my husband suggested this. This thing has been awesome! Now if I feel like watching a movie in bed at night or on the weekends I can do just that! I really like the flexibility of being able to use different apps via your phone because we had a roku prior but it was so limited and so it never got used.", "verified": true, "helpfulness": "0/1", "author": "Rjcarner"}, {"rating": 3.0, "review": "I need to know if this item works in another country other than USA", "verified": false, "helpfulness": "0/1", "author": "Nelson"}, {"rating": 1.0, "review": "The device only works about 20% of the time. I receive an error that it cannot find the device on my home network, which is working because my tablet can browse the web. Most of the Netflix programs will not display correctly on my television. I was pretty disappointed.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]