[{"rating": 3.0, "review": "Probably I'll like it more once it is availabe in Brazil, if your planning a trip to US, buy this only if you don't mind waiting for this to became available. Otherwise try to install the software from Play Store and checkit if it is available in your country.", "verified": true, "helpfulness": "0/0", "author": "gsisson"}, {"rating": 5.0, "review": "We wanted internet TV (mainly Netflix) on a TV in our bedroom but didn't want to run wires or buy a wireless bridge just for that TV.  I stumbled on this little guy almost by accident and thought I'd give it a try...after all, it was only $35.  It's awesome!  I simply plugged it in, set it up on my existing wireless network, then I can watch netflix on this TV by initiating (and controlling) the program from my iPad, laptop, or even my iPhone.  Once the program is playing, it streams over your network, not through your device, so you can turn off your laptop or ipad and just watch the movie.", "verified": true, "helpfulness": "2/3", "author": "Justin Harmon"}, {"rating": 5.0, "review": "My kids watch a lot of You Tube videos and now we can share it on the TV and it's simple and works great!a MUST HAVE for the family!", "verified": true, "helpfulness": "1/1", "author": "Bill Nave"}, {"rating": 4.0, "review": "It streams Netflix and YouTube perfectly, from any device, but I thought I could broadcast my pics and vids from my iPad, but apparently it's only for streaming specific apps, like the ones mentioned above.  (I would like to stream my GoPro Vids and video taken with iPhone and iPad.).  Maybe an app for that will be put out someday.  I still recommend this to be able to broadcasts on anybody's tv. It's great!", "verified": true, "helpfulness": "0/0", "author": "E. Venegas"}, {"rating": 4.0, "review": "This is a great idea and is still coming along.  You can watch essentially any video off chrome on your TV, which is the major benefit for me. And also its very small size. The only issue I have is that it lags/stalls.  not sure if thats my problem or the hardware.  for 35$, its worth it.", "verified": true, "helpfulness": "0/1", "author": "A. Drain \"youngsaaron\""}, {"rating": 5.0, "review": "Thank you Very nice ItemS!!", "verified": true, "helpfulness": "0/0", "author": "JPHELLO"}, {"rating": 1.0, "review": "I bought this,because I thought I could stream pictures and videos from my phone to the tv using this device; WRONG!! If you need apps and you have an older tv, then this device might be for you. However, I have a smart tv with preloaded apps so I didn't need this particular feature. Once I found out that I couldn't stream video and picture content, I returned it.", "verified": true, "helpfulness": "94/127", "author": "MyWill"}, {"rating": 5.0, "review": "I'm a nut for new technology, so HAD to give this a shot, and much to my surprise it works great.  I can stream anything from my computer, but selection is somewhat restricted from my iPad and iPhone, but it's really great to stream Netflix and Youtube to the TV while sitting across the room.", "verified": true, "helpfulness": "0/0", "author": "Dr. J. A. Metcalf"}, {"rating": 4.0, "review": "This is one of those little gadgets that are super easy to setup, does just one thing and does it well. And on top of it, it's cheap.The only problem is that the number of applications supporting the still-in-beta Cast SDK is VERY lacking (blame Google!), you have YouTube, you have Netflix, Hulu, Google Play, and that's it. And you should consider that the only \"universal\" service among those is YouTube. All the others have their own restrictions in terms of geographic availability.Also, the platform is restricted to Android, iOS and the Chrome browser (with some issues).As my HDTV doesn't support YouTube nor Netflix natively, and I already owned a couple of Android devices, the Chromecast turned to be the best alternative, considering size, price and features.The \"Cast Tab\" in the Chrome browser feels extremely \"beta\" (if not \"alpha\") quality, and you really need a powerful PC or laptop and a very good wifi network if you want to make anything mildly useful with it.So, if considering its many restrictions it fits your bill, then it's almost perfect. If not, you'll be wasting your money.", "verified": true, "helpfulness": "0/1", "author": "Mariano Draghi"}, {"rating": 5.0, "review": "I saw this on a tech website and decided to give it a go since it was 35 bucks and I was tired of hooking my laptop up to my TV via HDMI when I wanted to watch a movie on a bigger screen.  I've got to say that 35 dollars was quite well spent.  It works perfectly with the Amazon prime movies when I cast it from Chrome on my laptop, and Youtube from my Galaxy S3 casts effortlessly. I love how you can queue the TV on the phone, and how easy it is for other smartphones to use the device as well (my family essentially has three remotes!) I've used Google Music from my phone a couple times, and that worked great, but definitely not as useful as the other two ways I mainly use it for.  I know Google is working on other apps for the casting to work, but for me, this was already worth the money for the convenience it provided.", "verified": true, "helpfulness": "0/0", "author": "Lucas Lin"}]