[{"rating": 5.0, "review": "So simple to setup and use. Works perfectly for streaming YouTube, Netflix, and anything in a Chrome web browser directly to the television.", "verified": true, "helpfulness": "0/0", "author": "PW \"MakeItAwkward\""}, {"rating": 5.0, "review": "Purchased this for my secret santa and he LOVED it!! The pricing couldn't be beat, great value for an awesome product.", "verified": true, "helpfulness": "0/0", "author": "Sonny"}, {"rating": 5.0, "review": "I ordered this for a Christmas gift for my husband. Knowing at the time that Google was still pushing for further support of 'casting' videos to and through this device.Set up was a breeze, and while I'm a little tech savy, I believe that Google made the set up for this device simple and straight forward enough for people who have no tech knowledge. All you need is a laptop, or smart phone, TV with HDMI port and a wifi network (and of course a way to power the device - it comes with a USB cable or adapter for outlet power if your TV does not have a USB cable).At first we tested it out and watched a YouTube video from my Samsung Galaxy S3, and then from my husband's Asus Transformer Pad TF300T. Both worked flawlessly and easily with the Chromecast device, and both recognized the device without any prompting from us.Next we thought we'd test our luck and see if we could cast a streaming video of a TV show from one of the laptops. We queued up one of our favorite shows straight from Fox's website (using Google Chrome Browser of course) and right up by the address bar is a 'button' that reads 'cast'. Hit it and WALLA! We were now watching it on our TV. Now this is a Beta feature...but that proves that Google is very actively working on developing support for this little device.All in all...we both couldn't be any happier with the outcome of this. It went above and beyond our expectations and I would recommend it to anyone!", "verified": true, "helpfulness": "0/0", "author": "shnngns \"shnngns\""}, {"rating": 5.0, "review": "Google has made it more affordable than ever to be able to view internet streaming content on the TV.  Not only is the Chromecast affordable, but I prefer to use it over any other method I have.  Set-up is very simple, just a matter of connecting the Chromecast to your wireless network, downloading the app on either a phone, tablet, or computer, then pairing the devices by entering the code that appears on screen.  Chromecast has support for 14 different apps as of right now, but more should be along the way very soon.  Google has had an SDK out for developers for quite some time, but right now is only allowing select developers rights to the full Chromecast support.  I love using my Chromecast to listen to music from my phone and being able to adjust volume, skip tracks, etc wirelessly from my phone.  The only problem I have ran into with Chromecast is when used with the Pandora app on my phone, sometimes the app will basically stop unexpectedly on my phone leaving Pandora running independently and uncontrollable on the TV.  You can re-launch the phone app and click the cast icon again, but it will interrupt the song currently playing and start a new one.  I don't know if this is a problem with the Pandora app or my phone.  Otherwise, everything else works fine.  Its nice being able to scrub through a show on Netflix or Hulu, as well as share a youtube video with other people in the room quickly and effortlessly.  As far as hardware, I like that the Chromecast is just a small HDMI device, but I don't think a lot of people have the powered HDMI ports yet, so that means you will have to plug the device in the wall or a powered USB port while using it (again, of course, unless you have powered HDMI ports)  Also, obviously there are no other output options, which should not be a problem for the most part unless you have an odd TV like me that has no audio output options.  I see this being more of a flaw in my cheap TV than the Chromecast device.  Overall, I love this device and it is totally worth the $35.", "verified": true, "helpfulness": "0/0", "author": "E. Bauer"}, {"rating": 5.0, "review": "I wasn't disappointed because I did the research >before< I purchased this.  I was well aware of the product's features and limitations.  So far, I am really enjoying my $35 toy.  Setup was a breeze.  I was mainly interested in wireless streaming of YouTube and Netflix.  There are eight or so other supported apps, including HuluPlus, which is about $8/mo.  I can cast from either my laptop or my Andoid tablet.  My phone is too old @ version 2.2.  You need 2.3 or newer.  An unexpected bonus was that Chromecast allows me to use my TV as a monitor when surfing the internet using my computer.  I can check email, pull up my FB page, etc.  Cannot seem to do this from the tablet, though.  If you are on the fence about buying Chromecast, go to YouTube and check out some user videos before you buy.", "verified": true, "helpfulness": "1/1", "author": "James DBH"}, {"rating": 1.0, "review": "repeated error messages regarding the chromecast cannot be found on my network, suggested solutions involved UPNP VPN and other stuff, I don't understand any of that talk.This was to be a gift and turned into a nightmare.", "verified": true, "helpfulness": "1/2", "author": "elizabeth taylor"}, {"rating": 5.0, "review": "This device has so much potential and already functions great to stream movies using plex and also its great to pull websites from my laptop up onto my large tv. for 35$ this is a no brainer everyone should own one of these! Cant wait for google to release more features and improve streaming quality!", "verified": true, "helpfulness": "0/0", "author": "Joshua Thomas"}, {"rating": 4.0, "review": "So with all the modern-day consoles, what's the point of getting this?  I asked myself this question a number of times as I had it sitting in my cart - but I finally pulled the trigger as I said \"why not?\".It's small, it's neat, and it works.  At first I had quite a few issues getting this thing connecting to my WiFi but I discovered this thing doesn't support the 5 GHz band.  That's the only reason for deducting a star so far.With the recent addition of Plex - I now can pretty much do everything I need on this device.  Over the Christmas holidays our family sat around the TV as we surfed Youtube, Netflix, Hulu Plus (resubscribed!) and even a little from the Plex library.  Is it better than Roku or WDTV?  Hard to say, though as a fan of consoles and WDTV, I find this little device convenient as it is just simply is \"always on\" and I can cast to it anytime from my smartphone.  My phone is ALWAYS on me, so I don't have to go find a Playstation controller or my WDTV remote when I want to use it.With the great performance, ease of use, price and potential in the future for more apps, this was an easy investment.", "verified": true, "helpfulness": "1/1", "author": "William Vegas \"William\""}, {"rating": 4.0, "review": "So far I am loving the Chromecast Dongle. My family and I during the Christmas Holiday watched Forrest Gump via my Galaxy S3 and Netflix App with very minimal battery drain on my phone. During Christmas I had bought my Fiance a Sea King Kayak which had the Bar Code reader on the front showing a short video of it. I went on to Barcode Scanner, scanned it then commenced on watching the Youtube video on our TV. At first it did not work with my Laptop but I was able to set it up via my S3. One the phone updated I did a restart on my laptop to reset the connection and everything works great via the two.I only gave this a 4 Star because what I really wanted to do was use this in conjunction with my HDX 7 that I got for Christmas. Now you can use this via a \"Side Load\" and watch Netflix or other Apps however you cannot \"Cast\" Amazon Prime Videos which was what I was really wanting to do in the first place. However for 30 bucks and free shipping you cannot go wrong with this.", "verified": true, "helpfulness": "1/1", "author": "Scrappy"}, {"rating": 5.0, "review": "I gave this as a gift and now we all want to have one!  And the price is great, too.", "verified": true, "helpfulness": "1/1", "author": "Susan Westbrook"}]