[{"rating": 5.0, "review": "Works great for all my chromecast needs", "verified": true, "helpfulness": "0/0", "author": "Benji"}, {"rating": 5.0, "review": "We use it all the time, even when we cut the cable company.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline"}, {"rating": 5.0, "review": "works as advertised and i like it so far.", "verified": true, "helpfulness": "0/0", "author": "F.V.S \"cruiser dude\""}, {"rating": 2.0, "review": "This does not work with Apple iPhones nor iPads and probably not Apple computers. Do not buy this unless you are going to use PC and android to control it. Also, it is not compatible with Comcast/Xfinity modems.", "verified": true, "helpfulness": "0/5", "author": "Constance Sebastian"}, {"rating": 5.0, "review": "Love my chromecast.  Allows me to to get Netflix, Hulu, or Plex at night when I'm going to sleep.  And I can play my games, read, or watch videos while managing whats on my TV at the same time.  Cheap, simple, easy to install.  If you have any Android device this is a no brainer!", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "Prompt delivery, nice packaging and clear instructions made the product instantly pleasing.I watch a lot of Netflix and some YouTube through my iPhone after installing the extensions for both apps. They work wonderfully!Also, I cast streaming video from my MacBook Pro by installing the Cast extension on my Chrome browser and it works beautifully. I went from streaming news and variety shows on my iPhone 5S while eating dinner to watching it on my big screen TV. So the \"beta\" tab casting works a lot better than most described in the countless user reviews I had read prior to purchasing. Only about 5% of the time did I experience connection issues... and then again, that may be a problem with my connection, not the device.This little gem definitely made my life a little bit more convenient. Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Eric &#34;honestly opinionated&#34; Kim"}, {"rating": 1.0, "review": "Worst product for anyone to buy . This is a scam .", "verified": true, "helpfulness": "0/4", "author": "Chibuikem Ogbonnaya"}, {"rating": 5.0, "review": "I tried to use the Amazon Fire TV Stick to mirror my phone. Even though it was a \"supported\" device it didn't work. The Chromecast did. It disconnects though from time to time. I have excellent Wi-Fi, up to 50 mbps. So the device is pretty average.My favorite thing about Google Chrome is the number of applications developed specifically for it and how it integrates seamlessly with my mobile device!", "verified": false, "helpfulness": "0/0", "author": "Sean E"}, {"rating": 5.0, "review": "SO SIMPLE! MAKE SURE YOU HAVE  WI-FI INTERNET CONNECTION!", "verified": true, "helpfulness": "0/0", "author": "WE THE PEOPLE"}, {"rating": 5.0, "review": "Simply awesome", "verified": true, "helpfulness": "2/2", "author": "Alyssa"}]