[{"rating": 5.0, "review": "So cool to be able to bounce my netflix with me when I travel. Most convenient way to watch shows on a regular size screen and not my iPad.", "verified": true, "helpfulness": "0/0", "author": "Thomas R Knoll"}, {"rating": 1.0, "review": "Its sucks. Couple of things to point out.1. Big WiFi Bandwidth Hogger. Slows down entire WiFi home Network.2. No way to shutdown this unit, so keep eating data.3. It does screen mirroring. So, it can not keep stream from your chrome browser if you computer goes to sleep. some of the reviewer has said earlier that no need to keep your computer running (totally wrong)4. It description does not mentions WiFi bandwidth requirements, Most important aspect is being missed.5. Chrome browser itself is an an issues, it limits video steaming from certain webpages.6. Its only good for pre-installed apps (which is now a days available in every Roku, SmartTV, or Blue-ray player) only..", "verified": false, "helpfulness": "0/0", "author": "Sachin Kumar \"sachin\""}, {"rating": 5.0, "review": "Works very good, I'm very happy with it. I highly recommended, price very reasonable.", "verified": true, "helpfulness": "0/0", "author": "Edgardo Poggi"}, {"rating": 3.0, "review": "Configuration was pretty easy, but video was choppy.  I tried using it to watch Amazon Videos and NFL Game Rewind games.  But even at its peak framerate, it wasn't very smooth (especially when the on-screen action got heavy).  I ended up getting a Fire TV and demoted this device to the shelf.  Maybe I can give it away to someone.", "verified": true, "helpfulness": "0/0", "author": "Michael \"avidreader\""}, {"rating": 5.0, "review": "Good device with good price", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best ever piece of tech", "verified": true, "helpfulness": "0/0", "author": "Ferid"}, {"rating": 5.0, "review": "Great products still limited in things you can use it with though", "verified": true, "helpfulness": "0/0", "author": "Davinder Sidhu"}, {"rating": 5.0, "review": "Very good product. I'm so happy to bought this", "verified": false, "helpfulness": "0/0", "author": "wilfido"}, {"rating": 2.0, "review": "fickle. not dependable.", "verified": true, "helpfulness": "0/0", "author": "AmaLaVida84"}, {"rating": 5.0, "review": "Google Chromecast makes watching Netflix movies or YouTube so easy. The picture is crystal clear. The set up is very easy. Just follow the instructions that come along in the box. Once set up you want to make sure that you connect to Chromecast from your device before playing a movie, etc. That was a well spent $35.", "verified": false, "helpfulness": "0/1", "author": "Heike Martin"}]