[{"rating": 5.0, "review": "Perfect solution saved me tons of money over buying a \"smart\" tv. Just put it on an much cheaper HD tv without built it apps.", "verified": true, "helpfulness": "0/0", "author": "adam danoff"}, {"rating": 3.0, "review": "It is great if you are trying to make a non-smart tv into a smart tv. If you currently own a smart tv there really is no reason for this product. Once more apps start to support Chromecast it will become much more useful.", "verified": true, "helpfulness": "0/0", "author": "William Followell"}, {"rating": 3.0, "review": "The setup is easy. To use it is easier. The major problem is you can only use it, with very few apps. If you want to listen to your own music library , it has to be uploaded first to the cloud.", "verified": true, "helpfulness": "0/0", "author": "VICTOR"}, {"rating": 5.0, "review": "LOVE this little gizmo...was easy to attach to the TV, and sync it with my Wi-Fi... I ...sync the tablet to the chrome and go from a 7\" screen to 32\".I travel A LOT and so it is also nice when I take it with me and can watch Netflix( which works in London; Brazil, and Amsterdam) on a bigger screen I simply attach to the TV in the hotel room and sync with the hotel Wi-Fi and start watching...I Just make sure to leave a huge note on my door...so that I don't leave it behind ;)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I can stream an movie from my plex media server to a $35 chromecast! That's all I have to say.", "verified": true, "helpfulness": "0/0", "author": "Theo Sherman"}, {"rating": 3.0, "review": "No ,the chromecast item does not work, it is a faulty product;I am totally dissatised of course.You should be more  diligent about the sellers you deal with.", "verified": true, "helpfulness": "0/0", "author": "Donald Green"}, {"rating": 1.0, "review": "as roommate bought another service and then we never got to use this Google Chromecast HDMI streaming media player, so actually no rating would be the true as never used this product.", "verified": true, "helpfulness": "0/5", "author": "RedRussell"}, {"rating": 1.0, "review": "It is so technically deficient that Amazon itself cannot cast with it. If you buy this, you cannot watch Amazon Instant Videos with it (including Prime content).Roku has a $50.00 stick but Apple TV (which works with non-apple products) is still the best purchase.", "verified": true, "helpfulness": "0/0", "author": "Dana Andrews \"IT Technician, State of Wisconsin\""}, {"rating": 1.0, "review": "I purchased it at the end of December 2013, it stopped connecting to my iphone5 in the I middle of March, and thus becoming totally useless.  I used it solely to watch movies from Netflix and would not purchase another one.  Its main short coming is the need to use a certain smart phone to transmit the signals.  It is main advantage is its small size and portability.  It is not cheap if it failed to work after 3 months.Other devices such as the Roku, a small form factor PC or an old playstation-3 are much more reliable and better choices for watching netflix movies.", "verified": true, "helpfulness": "0/0", "author": "Kin H. Yu"}, {"rating": 3.0, "review": "It would be nicer if it had more compatibility with other applications, but it'll do. Turned my non WiFi TV into a somewhat wise TV. Not smart.. needs more feature which you can not get with this gadget.", "verified": true, "helpfulness": "0/0", "author": "Jancito"}]