[{"rating": 5.0, "review": "I love it. Period.", "verified": true, "helpfulness": "0/0", "author": "Patricia H. Quinlan"}, {"rating": 5.0, "review": "We love it! Extremely easy set up. Very easy to use. I keep forgetting to use the microphone for search. Still amazed it has that feature!", "verified": true, "helpfulness": "0/0", "author": "Barbara Swonger"}, {"rating": 5.0, "review": "I received it as a Fathers day gift and I love it. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Luis Pena"}, {"rating": 4.0, "review": "I would rate higher if it would allow for my tuners to be available just as in \"Windows Media Center\" with the \"Recorded TV available to me as well as the TV Guide.  The remote is superb.", "verified": true, "helpfulness": "1/2", "author": "Goobz34"}, {"rating": 5.0, "review": "I love it!", "verified": true, "helpfulness": "0/0", "author": "Luiz Otavio Pita \"luiz o p oliveira\""}, {"rating": 3.0, "review": "I bought a Fire stick and it was lousy.  Constantly buffering. I heard good things about the Fire TV since it has a larger memory, and the buffering problem is resolved.However, this comes with the same crappy remote.  The remote completely sucks.  You can't use it for navigating the keyboard menu to do searches, because pressing the left or right button even the teeniest, tiniest bit will cause the cursor to fly ten or twenty spaces.  This also happens when trying to scroll through my cued list of movies.And no, it is not the batteries.  I replaced them.  It's the remote.  It sucks, plain and simple.", "verified": true, "helpfulness": "1/2", "author": "LT"}, {"rating": 5.0, "review": "Just got hooked up. Seems like it was a great move.  Returned all my comcast boxes. We are good to go!!!", "verified": true, "helpfulness": "0/0", "author": "DJDEB"}, {"rating": 5.0, "review": "Neat device and makes Amazon Prime easier to access with voice and scroll.", "verified": true, "helpfulness": "0/0", "author": "otto zuckschwerdt"}, {"rating": 5.0, "review": "It's small, compact, and works great!  We use it with SlingTV and LOVE it.  It came on-time and was everything we expected.", "verified": true, "helpfulness": "0/0", "author": "Hilary"}, {"rating": 5.0, "review": "My family loves this product.  We surf the Internet, watch movies, listen to music, play games, etc..  Overall great!", "verified": true, "helpfulness": "0/0", "author": "Angela"}]