[{"rating": 5.0, "review": "Very good easy to work", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 5.0, "review": "Very good product . wish it had more drive space.", "verified": true, "helpfulness": "0/0", "author": "David Hatton"}, {"rating": 5.0, "review": "Love it. Recently got rid of cable and this and Netflex are working great as replacement.", "verified": true, "helpfulness": "0/0", "author": "Nana2004"}, {"rating": 5.0, "review": "This is great.  I already had a slingbox and always had to use a computer to access it from a location away from home.  It is nice that we can use the television now.  Hooks up quick and easy.  I am so glad I purchased it.  I also purchased the fire stick which I am very pleased with.  I bought them both at the same time, but didn't hook up the amazon tv until 4 months after I purchased it.  I would have just bought the fire stick, they are both excellent products as other amazon items are.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Very slow compared to roku without faster internet", "verified": true, "helpfulness": "2/3", "author": "Holly"}, {"rating": 5.0, "review": "This has worked very well as a streaming device for me.  The dual band is particularly helpful in a place with strange mid-home brick walls.", "verified": true, "helpfulness": "0/0", "author": "Brian Whitman"}, {"rating": 5.0, "review": "This is an initial \"out of the box\" review. First, congratulations to Amazon on the packaging, I almost wondered if this had an iPad inside, very nicely done! (But that is only fun for the 1st 5 minutes.) The Fire TV was super easy to setup and the pre-registration for my Prime account was handy. I got started on this to get Sling TV for ESPN sports and it is working very well. The deal for $50 off the Fire TV with a 3 month subscription to Sling TV made this an easy decision. I cut the cable in January, but missed to sports and while not perfect, Sling TV brings me some ESPN coverage that was missing. We watch Wimbledon tennis and ESPN is required to participate and love college football and basketball. The French Open coverage has been excellent on the Sling TV/Fire TV combo.The Fire TV does not use IR for the remote so the Harmony 300 I have used for years will not support it. Nothing Amazon can do about that and thats the price of progress. I have used Sling TV, Netflix, Amazon Instant Video so far and the streaming has been excellent. I have a 15Mb Time Warner standard internet service.Just starting to explore other features and with apps to download the Fire TV box is very capable.", "verified": true, "helpfulness": "1/1", "author": "Clark K Wallace"}, {"rating": 4.0, "review": "Great product! The unit seems to be well built.  Much faster than the Apple TV. I would give it five stars but the remote seems to be a little cheap.", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 5.0, "review": "I purchased this item because I decided to cancel my DIRECTV service, which I had for 15 years. I was tired of scanning through the channels and not finding what I wanted to watch or something that would catch my eyes. This was starting to become a daily chore. Prior to me cancelling DIRECTV, I did a quick survey with my family, and they basically gave me a hand full of channels that they watch. I looked in to the fire TV and saw that it offered everything my family needed. The 1st concerned was that they would not be able to record their favorite shows, and I said why would you need to do that when all the episodes are there. You can pause, rewind and forward. No need to record anymore. So with that said, I decided to cancel DIRECTV, and boy did they beg me to stay, but, I had my mind already made-up, so I cancelled DIRECTV. I also signed up with Amazon Prime and now I get tons of shows and movies for free with the subscription. I can now officially say that I am a cord cutter! I am happy with the Amazon service and the Fire TV box unit I bought. This is truly a life changing way of the way I watch TV/Entertainment. that my family and I are quickly adjusting to.", "verified": true, "helpfulness": "0/0", "author": "JCarreon"}, {"rating": 5.0, "review": "Very easy to install. I was up and running in under five minutes. The only extra things to do which take a few additional minutes is downloading Netflix, but this gem has made it easy. Once downloaded simply type in your Netflix user name and password and you're ready to go. Any additional programs like Showtime Anytime, require downloading and activation. Again, just a few minutes.I'm considering purchasing another unit for our other television. Would make a great gift.", "verified": true, "helpfulness": "1/1", "author": "Greg Stenzel"}]