[{"rating": 5.0, "review": "Happy, happy, happy!  Need I say more?", "verified": true, "helpfulness": "0/0", "author": "Darlene J Layne"}, {"rating": 1.0, "review": "Got it as gift to much work installing it", "verified": true, "helpfulness": "0/0", "author": "michael wadley"}, {"rating": 5.0, "review": "OBSESSED", "verified": true, "helpfulness": "0/0", "author": "Molly"}, {"rating": 2.0, "review": "lag, and occasional lapses in quality that are not experienced when a computer uses an HDMI cable", "verified": true, "helpfulness": "0/0", "author": "cmoore"}, {"rating": 5.0, "review": "Excellent product!", "verified": true, "helpfulness": "0/0", "author": "Alejandro Uribe"}, {"rating": 4.0, "review": "I love my Chromecast, I use it almost every day. It helps me view YouTube at a better quality. I also love watching movies on my tv and controlling it through my phone. I am so glad i got it, but I really wish there were more apps for it.", "verified": true, "helpfulness": "0/0", "author": "Jackie F."}, {"rating": 5.0, "review": "Magical piece of technology at an unbeatable price. Stacks up well against other streaming devices such as the Amazon Fire TV Stick and the Roku Streaming Stick.", "verified": true, "helpfulness": "0/0", "author": "Christian Montalvo"}, {"rating": 5.0, "review": "Works great after initial set up difficulties. Difficulties stemmed from router settings not related to chromecast. Had to go adjust several settings on my comcast wireless router (ended up being the channel setting) before being able to use. On other router it worked fine right from the start. Great device for streaming content, as more apps become available and companies improve their apps. (for example HBO has some streaming/buffering issues) it will become even more useful.", "verified": true, "helpfulness": "0/0", "author": "High Standards"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Fausto Gautreaux"}, {"rating": 4.0, "review": "My only issue is that it heats up quite fast", "verified": true, "helpfulness": "0/0", "author": "Michael Jon Tanag"}]