[{"rating": 5.0, "review": "Had some difficulty getting it set up.... more than likely it was user error.  Otherwise we love it.  Beats paying for cable or satellite any day of the week.  I was a little apprehensive about switching to streaming at first with two toddlers but have learned it makes life easier because we can now watch Thomas and Friends whenever they want too.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "This is what TV streaming should be! I love the Chromecast. Vudu works way more consistently on the Chromecast than it does on my Roku Stick, so I find myself using the Chromecast more often.The only thing I wish it had was a way to browse for shows and movies directly on the TV with a controller, or using gestures on an Android device. I know that's not the point of the Chromecast, but I don't think it would be that hard to add that type of interface, and would complete with Apple TV and Roku to a higher degree. It's not a BAD experience to use your phone to find your shows, it just takes some getting used to. I love the Chromecast either way.", "verified": false, "helpfulness": "0/1", "author": "David"}, {"rating": 4.0, "review": "Pros - Almost everything. Very convenient affordable way to improve your entertainment setup. I use android and most Google services so this integrates really well.Cons - probably not as great without android phone/tablet. Clunky to cast from PC. Doesn't connect to 5ghz network.", "verified": true, "helpfulness": "0/0", "author": "Alex Orr"}, {"rating": 5.0, "review": "Bought it so my wife can watch youtube and netflix in the bedroom. Works Perfectly!! Turned our HDTV into a Smart TV and loving it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love the convenience of Chromecast... I ended up buying more for family members. The only thing to note negative, is it cannot be used when traveling if the WiFi has a login procedure  (most hotels do)...at least that I can figure out. Otherwise a great purchase well worth the money spent.", "verified": true, "helpfulness": "1/1", "author": "MoniCat"}, {"rating": 5.0, "review": "I first saw and used Chromecast at a friend's house. I loved it so much there that I had to get one for my house. I just received it today, but I used it earlier for a bit. It works perfectly so far. Honestly, setup is a breeze! I highly recommend this for Hulu+ users. Some movies and shows can be watched on a laptop, but not on portable devices. This allows you to mirror your laptop or smartphone or tablet onto your TV. Now I'll be able to watch Hulu+on my tv.", "verified": true, "helpfulness": "0/0", "author": "Heather Raper"}, {"rating": 5.0, "review": "Works great, amazing video quality. And in a tiny package.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Great for an easy alternative  to roku or airplay.  Can't use it if you have to sign into wireless through a browser though. So if you want to use it while at a hotel you're screwed.", "verified": true, "helpfulness": "0/0", "author": "Seamus Cozmo \"Seamus Cozmo\""}, {"rating": 5.0, "review": "Absolutely love the chromecast, it's worth every dollar...", "verified": true, "helpfulness": "0/0", "author": "Xegfred Lou T. Quidet"}, {"rating": 5.0, "review": "Runs GREAT on Google!  Makes watching movies on tv so much better. No more crowding around the small screen of a laptop to watch a movie!", "verified": true, "helpfulness": "0/0", "author": "T.B."}]