[{"rating": 1.0, "review": "I didn't state that it didn't come with and HDMI cable & that you would have to have Internet for it to work!", "verified": true, "helpfulness": "0/10", "author": "Brittany"}, {"rating": 1.0, "review": "They removed xbmc/kodi", "verified": false, "helpfulness": "0/9", "author": "Justin B."}, {"rating": 4.0, "review": "Lot's of fun hours here.  Relatively simple to get up and running.  Not as much \"free stuff\" as I hoped... But if you're willin' to join Amazon Prime and Netflix, there's tons of viewing out there:~)  I'm cutting the package back on our cable to compensate.", "verified": true, "helpfulness": "1/1", "author": "Jim Goodman"}, {"rating": 5.0, "review": "love it so far", "verified": true, "helpfulness": "0/0", "author": "boyce b"}, {"rating": 2.0, "review": "I am very disappointed. I had a Roku and was able to watch my British sitcoms free. Now I have to pay for HULU to watch them? This makes no sense. I guess I now have to replace the Roku I just gave away .", "verified": true, "helpfulness": "0/1", "author": "Bobbi"}, {"rating": 4.0, "review": "When it works.... it works well.  But not enough content.  And it's irritating to get all involved in a series (in my case Sons of Anarchy) - then suddenly find it pulled from the lineup.Apparently a lot of licensing issues.  But oh well.  It is what it is.", "verified": true, "helpfulness": "0/0", "author": "Phillip B."}, {"rating": 4.0, "review": "Purchased about a month ago...great so far", "verified": true, "helpfulness": "0/0", "author": "G"}, {"rating": 2.0, "review": "I followed the simple HDMI connection from Amazon Fire HDMI to TV HDMI input . . .Video was very clear but there was no audio sound coming out. All connections were hooked up correctly.  What now?", "verified": true, "helpfulness": "0/2", "author": "Leovy \"Leovino Allanigue\""}, {"rating": 5.0, "review": "Excellent, fantastic, great unit, works far beyond my highest expectations.  It is truly plug and play, so easy to install and set up. BUT, BE SURE TO PURCHASE from Kindle books THE GUIDE TO OPERATING FIRE TV.  This unit is so powerful, you need help to unlock all the fabulous features and which apps you really want to add.  I give it five stars and fully recommend Amazon Fire TV.  The backup and support from Amazon is amazing.  Almost continuous updates and new apps.  Definitely purchase Amazon Prime, it goes hand and hand with Fire TV.", "verified": true, "helpfulness": "0/0", "author": "pdar"}, {"rating": 5.0, "review": "great easy perfect thanx", "verified": true, "helpfulness": "0/0", "author": "Dave Paceley"}]