[{"rating": 5.0, "review": "I love this little dongle. I also really love saying \"dongle.\" Try it: \"Dongle.\" Wasn't that fun? You know what else is fun? Sending stuff from your phone or computer to your TV without cables or wonky smart TV apps!I haven't used this dongle much with my PC, as you need to leave whatever you're watching open in full-screen, so you aren't able to use other programs. You also can't use the Chromecast dongle to turn your TV into a second monitor, or at least not into a good one. The dongle is meant to stream media, not magnify your Word document; it will be much more delayed than you'd probably like.I use the dongle almost entirely with my iPhone. Some of the apps I have on my phone (YouTube, Pandora, Netflix, etc.) are already set up to cast to the dongle, and more apps are adding this feature all the time. There are also apps that will let you cast more or less ANYTHING, like videos you open in Safari rather than YouTube. I've had perfect casting every time.The Chromecast dongle can also be paired with multiple devices, so we have two phones, two computers, and a Kindle* paired to it. If company comes over and wants to show us baby videos that will probably be totally lame, they can pair their devices with our dongle and cast their dumb videos of their lame-o baby to your TV, like you don't have anything better to do than watch little Liam get a bath. Again.Possibly the best news about this is that Google made the software open-source (or some other computer words), so anyone can make apps that will work with Chromecast. Just Google \"Chromecast apps\" and you'll find about a gajillion-billion apps that you can get, many of them free.*Kindles don't play nice with Google Chromecast because they have a crush on the Amazon Fire system, so you have to go in and make it work, which is kind of a pain but definitely doable.", "verified": true, "helpfulness": "0/0", "author": "Robio Dante"}, {"rating": 5.0, "review": "I really like this item.", "verified": true, "helpfulness": "0/0", "author": "lacarl jones"}, {"rating": 3.0, "review": "It loses connection with the apps! It worked great for about 3 months but now I wish I would've purchased a Roku instead!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product, easy to set up, use and figure out how to use. Would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "Cody Durfee"}, {"rating": 4.0, "review": "Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Francisco Theiler"}, {"rating": 5.0, "review": "Meets and exceeds all the hype.  Y'all have got to get one (or more) of these!", "verified": true, "helpfulness": "0/0", "author": "eernsdorff"}, {"rating": 5.0, "review": "The future of media Consumption, the only downside is that there's no remote for it, like roku", "verified": true, "helpfulness": "0/0", "author": "Oscar Bowdry"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "rocky"}, {"rating": 5.0, "review": "It turned our HD TV into a smart tv.  Easy to use.", "verified": true, "helpfulness": "0/0", "author": "Debbie"}]