[{"rating": 5.0, "review": "Google of course! Love it and highly recommend it.I can connect my cellphones, ipad, laptop, etc whenever I want. I wish they add some more features to it though.", "verified": true, "helpfulness": "0/0", "author": "Raj Singh \"Raj\""}, {"rating": 4.0, "review": "Can't beat the price and functionality of this little device. I have a Roku 3 and a PS3 and I want two more of these (one for my living room and another to take on the go) Set up is really simple and easy, it walks you through everything. The functionality is improving but sometimes it takes a bit of fiddling to get an app to play in chromecast but it's tons better than when I first bought it and getting better every day.  I love the stream from chrome function, it will allow you to play anything inside your browser, although you have full screen on the tv and then browse on you computer without a second monitor dedicated to whatever is streaming in the browser.", "verified": true, "helpfulness": "1/1", "author": "Jared Grabau"}, {"rating": 5.0, "review": "Watching stuff on your tablet/phone/computer is rarely comfortable. This is great if you don't have an XBox/Smart TV and don't want to spend the money on a Roku/etc. I can watch  Hulu, Netflix, YouTube videos, and HBO Go. The only thing I think it's missing is being able to stream things from XFinity online. I think it works best with my tablet, since it is just the most convenient, but works well with my phone and computer as well.", "verified": true, "helpfulness": "0/0", "author": "Sarah Chimoff"}, {"rating": 5.0, "review": "This gadget is purely amazing.  I am not exactly knowledgeable about tech, but a young friend quickly set this up for me; and I love being able to choose a movie from Netflix and stream it to my TV.  I only wish Netflix had more of the movies in my queue available for streaming.  Of course then I would probably drop my DVD plan!!", "verified": true, "helpfulness": "0/0", "author": "Virginia A. Tucker"}, {"rating": 5.0, "review": "Super easy to set up and use. I have the HTC One which I can use for my TV remote, so I can control the TV and the Chromecast with just my phone! It's great.", "verified": true, "helpfulness": "0/0", "author": "AndroidGuy"}, {"rating": 4.0, "review": "It does what I want it to do. I got this for streaming hulu and Netflix in my bedroom. Cheaper than other devices. I use my Samsumg Galaxy Tab as my remote for my tv and the Chromecast. Works great for these things. I haven't really tried doing anything else.", "verified": true, "helpfulness": "0/0", "author": "Magnumous"}, {"rating": 5.0, "review": "The Chromecast is a great media streaming device.  For the price of $35 I am now able to watch videos from most online streaming services directly to my computer.  This is easily controlled with my smart phone.  This allows me to play, pause, increase/decrease volume, and search for content all on my phone.  Then I just click the cast button and it all goes onto the TV.The only thing that I would mention is that I did have a bit of trouble setting up the device.  Initially when I was going through setup I would get to the part where you provide the WPA2 network password to the Chromecast and it would time out saying that my phone could not communicate with the Chromecast (I used my phone for set-up).  I tried reading through Google's support page and couldn't find anything that helped.  Eventually I just tried standing closer to the Chromecast during set-up and that fixed the problem.  The initial set-up requires your device to communicate directly with the Chromecast and apparently it was having issues doing this from more than 5 feet away.  But, after set-up the Chromecast has been working very well.I would also add that since the initial set-up requires direct communication from the setup device (computer/phone) to the Chromecast the set-up device must have WiFi capabilities.  This means that computers that only have LAN (such as some desktops) will not be able to go through the Chromecast set-up.  However, once the Chromecast is set-up properly a Computer with LAN can cast to it just like any other computer.Overall a great product in my opinion.  I've no problems with it since setup and I use it to stream Netflix and YouTube on a regular basis.  Also, it's worth mentioning that any computer with Google Chrome running on it can cast any full tab to the Chromecast - effectively allowing you to stream anything in your browser.", "verified": true, "helpfulness": "0/1", "author": "Zactionman \"Zachary\""}, {"rating": 3.0, "review": "First let me start bye saying i have a love affiar with google products. I have a chromebook that i use all the time, i use gmail, google hangouts, google + etc.I do not have satalite, local tv or cable.I do have a Roku on 3 of my TV's ( roku 1 roku 2 and picked up a Roku 3)This can not replace my roku's they stream flawlesly and have almost every app i would want. ( amazon prime, netflix, HBO GO, HULU, and Redbox instant)I did want this product to stream my chrome browser to my TV with out having to run a HDMI cord from my TV to my Chromebook. So easy peasy i thought. Took it out of the box and tried to connect .. nada .. tried with my Moto RAZR .. Nada .. what in the world. Did some research though google. turns out some people were having issues because it would not work with there wifi routers .. a lynksys E series .. so i changed my router out for the old WRT54GL ( just to see if it worked) ..still no though my Chromebook .. so i went though the setup proccess on my Razr .. bingo. After the initial set up it did work with my chromebook according to tech support you cant set it up with a chromebook ??? ok .. tab browsing was a little choppy but did work ..i have since then moved back to my Eseries router and the Chromecast is gathering dust.. perhaps i will buy another router at some point and try again ..summary : if you dont have a ROKU or internet TV or WIFI set top box then sure this is ok .. but if you do dont waste your money", "verified": false, "helpfulness": "0/0", "author": "Bcon"}, {"rating": 5.0, "review": "I bought this device for my parents and they loved it. Its easy for anyone to use. My 63 year old father was so intrigued that he went on Youtube and found music videos and artists that he had not seen in over 50 years. This made him very emotional. I was so glad to hear that a product like this could bring back old memories in our large TV.This is also awesome because you can stream from pretty much any device, android, apple, any computer, etc.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "We use this all the time, to stream netflix, hulu, pandora and even youtube videos to our T.V. It's very simple to use - even the kids have figured it out. I use it more than I do my cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]