[{"rating": 4.0, "review": "Amazon could rule the TV world by merging the TIVO broadcast TV recording and menus feature into this box. Broadcast HD is cheaper and looks better and is the cheap lure to Amazon content sales.  Its really a no brainer.", "verified": false, "helpfulness": "0/2", "author": "TerryG"}, {"rating": 4.0, "review": "A solid product (I got it to compare against the AppleTV & because my Samsung smart TV doesn't have the Amazon ap - & we watch a lot prime content).  On the pro's, the voice command capability is great - something AppleTV does not yet feature.  However the major drawback is that the Fire TV has a difficult time w/ less than bountiful Internet BW.  I tried it both w/ High speed cable Internet (50Mb/s) where it works great & a 3Mb/s DSL service where it struggles to play content (unlike the AppleTV which handles the lower BW environment w/out issue).My recommendation is a buy if you need the Amazon prime app (for a TV that doesn't have it),  or want voice commands, & you have high speed service (something significantly more than a 3Meg DSL - the curse of country living).  However if you need AirPlay &/or have a slow DSL service, stick to the AppleTV.", "verified": true, "helpfulness": "1/2", "author": "M. Doggett \"mdog\""}, {"rating": 5.0, "review": "Works very well, but very poor written instructions. Turns off after a while, when not used, press one of the main buttons to turn it back on and make it ready to work. There sure are a lot of features, which you have to explore.The remote control is cute and small, but the battery cover is very difficult to open. The remote takes a while to get used to.", "verified": true, "helpfulness": "0/0", "author": "Kimi Kagome"}, {"rating": 5.0, "review": "Nice ... great performance - processor and memory.", "verified": true, "helpfulness": "0/1", "author": "DaBogeyman \"\"KDB\"\""}, {"rating": 5.0, "review": "I'm dead impressed with this TV streamer.We were getting fed up of the lack of content available on our smarttv (panasonic). A great TV but the \"smart\" bit isn't very smart, considering that more or less the only App available for streaming movies was Netflix.This box also solves the issue I had of getting the Netflix content on my TV to play audio through our surround speakers... the HDMI dolby plus is awesome as you don't need an additional cable to carry the digital audio signal to the receiver.HIGHLY recommend this Fire TV stuff. Great job Amazon, thanks :)", "verified": true, "helpfulness": "0/0", "author": "LH"}, {"rating": 5.0, "review": "I love it!  Easy to use and set up!", "verified": true, "helpfulness": "0/0", "author": "Dwiz724"}, {"rating": 3.0, "review": "Could not use with my TV", "verified": true, "helpfulness": "0/4", "author": "Charles D. Stevens"}, {"rating": 4.0, "review": "Easy to setup and fairly good quality. We enjoy classic old movies. Seems limited in prime choices. But,  I would recommend this product for those of us they really don't want to pay cable prices anymore.", "verified": true, "helpfulness": "1/1", "author": "kathy"}, {"rating": 5.0, "review": "I'm not much of a TV watcher so regular programming with cable or dish has never met my needs. Amazon Fire, with its voice search allows me to find and watch the programs that I want without waiting for it to come on it's scheduled time. I also love that I can get Pandora!", "verified": true, "helpfulness": "0/0", "author": "K. Clayton \"kcpeace\""}, {"rating": 2.0, "review": "I returned this and got a new Roku 3 instead. You get the smart-TV Netflix experience, which is bad, and the entire interface feels choppy.", "verified": true, "helpfulness": "1/3", "author": "nirnear"}]