[{"rating": 4.0, "review": "It's a very good device, comparable to a Roku in most ways, some better some worse (Once apps start getting ported we'll see what happens) but there is plenty of room to make a \"FireTV 2\" much better in the future...", "verified": false, "helpfulness": "0/0", "author": "THIPPESHA DYAMAPPA"}, {"rating": 5.0, "review": "Fire is the greatest TV product!  Easy  to set up, easy to use.  Only negative note is that I wish there were more new movies available on Prime.", "verified": true, "helpfulness": "0/2", "author": "Chris McGinnis"}, {"rating": 5.0, "review": "We haven't had this for very long and Ive only used it once, but we love it.  My son set it up very easily and got it up and going quickly.  We love the voice activated remote but its only for Amazon Prime items not for Netflix or other channels.  Beautiful picture.  I am really happy with my purchase!  We also got 2 controllers and my son played the game it came with.  He enjoyed it very much.  I would recommend.  I put my roku in another room for the kids, and I have the FireTv, its great!  Everyone should have one!", "verified": true, "helpfulness": "1/2", "author": "Debra Gallagher \"Deb\""}, {"rating": 5.0, "review": "Works great and is easy to set up. Plus it's small and is very fast with both netflix and prime.", "verified": true, "helpfulness": "0/0", "author": "kbp"}, {"rating": 5.0, "review": "This device met our family's expectations very well.  It allows reliable high quality viewing of Amazon Prime videos.  The Amazon Prime App in our blue ray player was slow and prone to glitches that required reloads.  This does not happen with this new device. We use other devices for other streaming services, so I cannot comment on how these work on the \"Fire.\"I would suggest that Amazon make it easier to separate paid from free videos. Making searches less transparent may not increase sales as much as Amazon thinks, particularly if it annoys customers who want to appreciate an \"Amazon\" experience. There are many alternatives out there.", "verified": true, "helpfulness": "0/0", "author": "Wyomiac"}, {"rating": 2.0, "review": "I bought this thinking it would be better than our Roku.  After a couple of days trying it, we unplugged it and went back to our Roku.  The Fire TV only allows access to things Amazon wants you to see and purchase from them.  Yes, you can get Netflix, Hulu, Pandora, but voice search only works for Amazon movies and television and nothing else. Many apps we like on Roku are not available on Fire TV. There is a lot more out there than just Amazon movies and television, and that access is blocked with this device. Fire TV is like having a controlling mother filter what you can see.", "verified": true, "helpfulness": "3/9", "author": "D. Dowrick"}, {"rating": 4.0, "review": "I wish it was DLNA compatible. I would like to view a server that I have running on my PC. Also wish I could look up movies/shows with the voice recognition for other apps like Netflix and Hulu.", "verified": false, "helpfulness": "0/0", "author": "denise gingles"}, {"rating": 3.0, "review": "Was a toss-up between getting Amazon Fire TV or a Roku 3.  Were pretty equal, to me, except Roku lets you use a headset plugged into the remote, and Fire TV gives you voice search in the remote.  Wish I could have BOTH features in one device, but decided I'd probably use voice search more, so went with Fire TV for that reason.  HUGE DISAPPOINTMENT.  Most of my viewing is Netflix and Hulu (not an Amazon Prime member), but Fire TVs voice search ONLY searches Amazon content!Initial set up was relatively easy.  However, it seemed unnecessarily time-consuming with the \"searching for updates\" and \"updating software\" downloads.  I purchased this 1 day after its initial release; shouldn't it come with the most up-to-date software being only 1 day old??So far, it's working fine...no complaints there.  Just keep in mind, if you're thinking of buying it, the voice search ONLY searches Amazon content, most of which you have to purchase.", "verified": true, "helpfulness": "1/6", "author": "WarsawNan"}, {"rating": 5.0, "review": "Amazon Fire TV is very easy to use.  Even my husband can figure out how to use the voice commands.  A little confusing on the installation, and no real instructions included, but after I got one of my kids to complete the installation --- piece of cake.", "verified": true, "helpfulness": "2/3", "author": "Argylemom \"Argylemom\""}, {"rating": 4.0, "review": "My son has been wanting an Xbox and I (his middle aged mother) have been wanting a Roku or Apple TV device - this combines the best of both worlds. It was SO easy to install - litterly you just plug the thing in.Why 4 vs 5 stars:The only downside (and it's a big one but no better anywhere else) is the search functionality - The voice search currently only searches Amazon Prime shows - and you still have to go into every single 3rd party channel to find something to watch. This problem/issue REALLY needs to be solved. You should be able to view everything available by category. Come on developers! Let's do this.", "verified": true, "helpfulness": "1/1", "author": "Karri L Hall"}]