[{"rating": 5.0, "review": "LOVE IT.  GREAT TO HAVE THIS ACCESS WHEN WE ARE BORED WITH WHAT IS ON REGULAR TV OR SATELLITE.  LIKE THE VARIETY OF SHOWS AVAILABLE, AND WE CAN RE WATCH A SHOW AT OUR CONVENIENCE.", "verified": true, "helpfulness": "0/1", "author": "Scurtiss1974"}, {"rating": 5.0, "review": "Got this for my Girlfriend and she loves it", "verified": true, "helpfulness": "0/0", "author": "Hill"}, {"rating": 5.0, "review": "good product", "verified": true, "helpfulness": "0/0", "author": "Duke"}, {"rating": 4.0, "review": "Works awesome for Amazon Prime,  but the Netflix app leaves a lot to be desired.  Voice search only works with Amazon Prime.  Overall it works better than hardware built into the smart TVs.", "verified": true, "helpfulness": "0/0", "author": "David Bloom"}, {"rating": 1.0, "review": "I don't get all the positive reviews.  This devices was extremely easy to hook up.  From box to working in less than 5 minutes.  But after that, I just don't understand how this thing is useful.  I usually hook up my laptop to my tv to screen media.  This device didn't give me anything my laptop doesn't.  I don't get the $99 price tag for something that doesn't do what I already have.g", "verified": true, "helpfulness": "2/16", "author": "S.K."}, {"rating": 4.0, "review": "I'm really enjoying this. My kids love it too!", "verified": true, "helpfulness": "0/0", "author": "Jill Anderson"}, {"rating": 4.0, "review": "I like it, because now I can use the Close caption with amazon prime movies... I wish I could use the voice command with the other providers like netfliix or hulu plus... but voice command is only for amazon prime.  The only think I guess I was a bit disappointed is that it went on sale after I got it by a month or so, and that bummed me out !!! oh well, I always miss the good sales ...", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I have bought several of these units for my home.The first thing I recommend, as soon as you plug it in .....( and register, etc )go to  settings & up-date the unit immediately..This is great for those that have little kids.( Lots of features ... parental controls .... kids section ... etc. )", "verified": true, "helpfulness": "0/0", "author": "Richard B."}, {"rating": 4.0, "review": "This really does the job well.  The designers have through out the menu system, and made it very intuitive, plus it is possible to use a variety of Apps to access other channels (Hulu, Netflix etc).  I've not had any streaming problems, and the picture is very high quality.", "verified": true, "helpfulness": "0/0", "author": "JCM Jr \"manicdrums\""}, {"rating": 5.0, "review": "The box is really cool... Tiny! I am a little bummed because I feel like it was not really clear how much programming came with the prime subscription free.", "verified": true, "helpfulness": "0/0", "author": "Catherine Phillips \"Cathy208\""}]