[{"rating": 4.0, "review": "It's a very useful device to broadcast YouTube on TV, but some times YouTube does not respond during broadcasting!!", "verified": true, "helpfulness": "0/0", "author": "murtadazon"}, {"rating": 5.0, "review": "this is my second Chromecast. As we only have 2 TV's in the house this was a no-brainer for us. We have not broadcast TV service lie cable or even DTV. We are a Netflix only family. This second one did have a connectivity issue with our network that the first one didn't encounter. I had to run setup every time we used it for like 2 weeks. It now stays connected without issue.  If we were ever to get antoher TV (I doubt it) WE would undoubtedly get another Chromecast.I also found an android app called LocalCast that perfected my home streaming multimedia experience. I can now stream music and video from my NAS unit or my phone/tablet.", "verified": true, "helpfulness": "0/0", "author": "TJCN"}, {"rating": 5.0, "review": "I now own 3 of these little gems. I picked up the first one when they were initially released and I keep going back for more. If you are a smartphone or tablet user, this is one of the easiest and best ways to stream to your TV. Being able to use the easy interface of your device to browse for content and then just cast it to the Chrome cast is great. I frequently use it to stream music and podcasts aside from just the normal video content. Love this little device.", "verified": false, "helpfulness": "0/0", "author": "R. L. Johnstun"}, {"rating": 5.0, "review": "Work", "verified": true, "helpfulness": "0/0", "author": "Ever Rivas"}, {"rating": 5.0, "review": "Game changer and under $40", "verified": true, "helpfulness": "0/0", "author": "Raymond Frank"}, {"rating": 5.0, "review": "I bought this hoping it would let me use Chromecast on my OLD non-flatscreen TVs--with an HDMI to RCA converter (I bought/use the Etekcity white converter, about $30 on Amazon)--it works like a charm-- I now watch anything I normally watch on my laptops-- on my old dinosaur televisions. I use an RCA cable (red, white, yellow--purchased separately Amazon, $9). In the living room, I plug the red and white (audio) into my surround sound system and the yellow (video) into the TV. VOILA!!! Internet on the tv in full sound (not HD and probably not true surround sound, but all 5 speakers are putting out what is on YouTube or whatever I've got streaming.) the bedroom is just r,w,y plugged into r,w,y. I've two RCA cables I leave hooked up to each TV so when I go form room to room, I just take this converter with my Chromecast connected to it at hook it up to the cables I leave right in place. Too cool!!NOTE: it took some fiddling with \"input\" and channel changing. Also it worked best when I plugged the converter's power source cord in (included with the converter, but I had to borrow the usb-to-ac square from one of my iPhone chargers to actually be able to plug it in.) but once I \"got it\" I can't tell us how crazy it is to see Internet stuff on these ol' TVs.With Chromecast ($35), the converter (about $30) and the two RCA cables (one for each tv) (about $10 per) for a grand total of less than $85 I now watch the Internet tv I've come to prefer on my televisions rather than my laptops. Crazy. Far better than dropping $200--$???? For two new tvs. I love it.I use my iPhone, iPad, and MacBooks to \"cast\" from. There's no delay, no skipping, no sticking...it's all good.", "verified": true, "helpfulness": "0/0", "author": "The Write Idea \"Read, think, dream...\""}, {"rating": 1.0, "review": "Just when you think you are connected and in business, you can count on this device to make your life a living hell. First of all Google / chrome / Amazon offered two free months of HULUPLUS with purchase of this device and made it impossible to redeem said offer. So from the get go this has been a negative and aggravating experience of having to first find phone numbers for above mentioned entities. Each blame problems on the other, but bottom line, Hulu broke down and gave me one month free. The offer was for two months. Now the casting icon fails to show up on the screen and no one at Chromecast can help. It's not worth the aggravation. Now they can all go jump in a lake as far as I'm concerned. I want my money back and more importantly, I want the time I spent chasing them down back. I do not recommend Chromecast streaming device unless you have a high tolerance for BS.... Otherwise, move on.", "verified": true, "helpfulness": "0/1", "author": "kk"}, {"rating": 5.0, "review": "Fab!! Makes a standard TV a smart TV for all intents and purposes. Would highly recommend it.", "verified": false, "helpfulness": "0/0", "author": "Twomen1"}, {"rating": 5.0, "review": "uh Chromecast!", "verified": true, "helpfulness": "0/0", "author": "FDawg"}, {"rating": 3.0, "review": "Much harder to set up than they want you to believe, but does work. Probably only worth getting if you plan to use/control it with a smart phone.", "verified": true, "helpfulness": "0/0", "author": "Wes Helm"}]