[{"rating": 5.0, "review": "Great buy", "verified": true, "helpfulness": "0/0", "author": "sergio mejia"}, {"rating": 5.0, "review": "Love it. No issues.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Kelly"}, {"rating": 5.0, "review": "Cheaper then Best buy, same product, works perfect.", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 5.0, "review": "LOVE this, great price, great product. It has had a couple issues but it seems google was on top of it and promptly updated to get rid of glitches,  and the service continues to improve. So great to be able to use the computer on the couch while streaming TV, plus I can use my phone or tablet to show people videos and photos on a bigger screen instead of having them gather around my cell. chromebook + chromecast + netlfix + android has changed my life, so thank you google for doing most of those things ;)", "verified": true, "helpfulness": "0/0", "author": "Maude"}, {"rating": 5.0, "review": "My significant other purchased this when it came out and at first, I was hesitant.  I already had an Apple TV (3rd gen) and a Roku Streaming Stick which both worked fine.Setup was very easy and the device is very fast.  To be honest, it didn't take long for me to embrace the Chromecast and stop using my Apple TV and Roku.  Using a Chromecast gives you the freedom to be watching content on your phone and then to instantly share it to a larger screen.  I'll go from sitting at my desk, watching YouTube on my phone to watching YouTube on my TV in the living room with a simple touch.Lastly, there's also a nice plugin which lets you stream content from your computer (either a video in Chrome, the entire tab, or your desktop).If I had one tip to give, it would be to plug the Chromecast into a USB wall adapter instead of the TV's USB port.  I did this so that when I turn my TV on, the Chromecast doesn't have to load since it has already been on (Wall adapter is always on while TV turns on its USB port when turned on).I would definitely recommend and they aren't too expensive so buy a couple!", "verified": false, "helpfulness": "0/0", "author": "Tyler Wright"}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Tarrell M. Johnson"}, {"rating": 5.0, "review": "Just bought two more! now i can stream digital videos from my computer to my tv! no longer have DVDs! Woo Hoo!", "verified": true, "helpfulness": "0/0", "author": "USN Eddie"}, {"rating": 5.0, "review": "I got this and within 5 minutes I was casting to my TV from my phone and laptop. It is awesome and very easy to use!", "verified": true, "helpfulness": "0/0", "author": "Hannah"}, {"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "0/0", "author": "Valery Matushenko"}, {"rating": 5.0, "review": "This is a great product.  It is used on a daily basis and does everything it says it will do!  It was a great buy at the time too.", "verified": true, "helpfulness": "0/0", "author": "Tricia Monaco"}]