[{"rating": 4.0, "review": "Very nice I just wish I had access to more free or downloadable TV networks without having pay for cable or satallite.", "verified": true, "helpfulness": "0/1", "author": "Michael Houston"}, {"rating": 5.0, "review": "This devices works great!  At first I had problems with wifi reception, but I moved it a few inches away from the TV and it works great.  I think it was getting interference from the TV.  It is so much faster than using the built-in Amazon on my Vizio TV, and this is very portable.", "verified": true, "helpfulness": "0/0", "author": "David Carlisle"}, {"rating": 4.0, "review": "A very nice accessory if you do not have a Smart TV. Loads of apps like Netflix and HBO GO and about 100 games (you need the game controller add on for about half the games)Being able to \"cast\" my and my family's Kindle Fire tablets is really cool (check your model tablet, it doesn't work with everything)We have upped our family Game night with family friendly party games and of course, movie night on this is a lot less hassle than jumping through hoops to get the Xbox and Play Station to play streaming movies.Favorite feature: talk to the remote control. Seamless, fast, accurate and fun.Least favorite feature: they could really open up the games library.It would be nice if visitors could come over and log in with their apps and games so we can share but I haven't figured out how to do that.My bundle with the Fire TV unit, game controller and the all important HDMI cable cost 150.00 and it was a worthwhile purchase for our family as we all use it one way or another.It is NOT a sufficient replacement for a legitimate console system ie. Xbox or play station. The games availability is not there.", "verified": true, "helpfulness": "0/0", "author": "Richard R. De Blasio"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "jt newman"}, {"rating": 5.0, "review": "Love it.  Gives on line capability to a TV that does not have it.", "verified": true, "helpfulness": "0/1", "author": "Matt Jasinski"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/1", "author": "Yadira"}, {"rating": 5.0, "review": "Very nice !", "verified": true, "helpfulness": "0/1", "author": "Igor Chepets \"levsha\""}, {"rating": 5.0, "review": "Love it. A lot better than the chromecast for sure.", "verified": true, "helpfulness": "0/1", "author": "Kimberly Burkhardt"}, {"rating": 5.0, "review": "This is the 3rd one I got.  Well I got the sticks 1st & then another, but I find my wifi causes buffering at times.  Once i found out I could hard wire this it was a no brainer.  Still get some buffering,but I'm think it has to do more with the site than the device.  After all some things stream from literally around the world.", "verified": true, "helpfulness": "0/1", "author": "DC"}, {"rating": 5.0, "review": "It works well.  Plug and play.", "verified": true, "helpfulness": "0/1", "author": "Nicholas Lehr"}]