[{"rating": 5.0, "review": "Ordered this so I can stream to my TV.  I use my phone more than my laptop, and it works great.  Well worth the cash for this.", "verified": true, "helpfulness": "0/0", "author": "Allen"}, {"rating": 4.0, "review": "Was not expecting much for a$35 item, but it works really well. Streamed from Chrome with Allcast ESPN3 to get UCONN games only on ESPN 3 web. Great image, many additional programs becoming available as the opened the SDK to developers.Only minus is here, Amazon Prime streaming video doesn't work, hope this can be cleared up soon as with this feature it would be a great product. (Assuming Amazon won't allow it as they are probably developing a set top themselves.)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "If you are buying this to cast photos for your kids to look at beware. I downloaded their app called Dayframe. It casted the photos from my phone until I turned the phone wide....after that I was stuck looking at a photo from their site of a woman giving a guy a hummer (not a picture on my phone!).", "verified": true, "helpfulness": "0/0", "author": "Harold Saxon"}, {"rating": 5.0, "review": "Great product for your TV. I love it. Got it on time and I have been using it ever since", "verified": true, "helpfulness": "0/0", "author": "Mojoe"}, {"rating": 3.0, "review": "It does what it was supposed to do, but it's not great.  You need a great internet connection to get decent definition.", "verified": true, "helpfulness": "0/0", "author": "Centurion75"}, {"rating": 5.0, "review": "I have a few Roku devices at home but was looking for something that didn't need a \"channel\" to work.  Chromecast is awesome.  I didn't quite get it until I saw on revision3 techzilla and it is liberating to stream video on the net from your laptop to your tv via the chromecast hdmi connection.  I tend to like to watch tv in hand and with Chromecast you can still surf other web pages as it streams and the quality is top notch all without wires.  (Keep in mind you will need a high speed connection).  Anyway I liked this so much I ditched my roku's and replaced another 2 with Chromecast.  Great product period.", "verified": true, "helpfulness": "0/0", "author": "Pascal Pennel"}, {"rating": 5.0, "review": "Easy to set up, easy to use, easy to see why it's popular!  Even if you're not sure - you can't beat that price.", "verified": true, "helpfulness": "0/0", "author": "Tom Butler"}, {"rating": 3.0, "review": "It's okay.  It's not as good as the Roku box, but the compact format is very attractive.  I think it will be better once more apps are available for it. But right now the chromecasting apps are extremely limited.If netflix is all you need, I would imagine that this would be perfect.", "verified": true, "helpfulness": "0/0", "author": "thisguy"}, {"rating": 3.0, "review": "I expected something different I guess.  It does what they say it should.  I thought it would show my pictures on the TV but only things on line and I don't really want my pics on line.", "verified": true, "helpfulness": "0/0", "author": "Connie"}, {"rating": 4.0, "review": "I love my chromecast. At first I was a little disappointed in the app support for it, but this has been steadily increasing. The one major thing it still doesn't support is amazon video streaming. This seems a little short sighted of amazon even if they are supposedly releasing a streaming device soon they can still get the revenue from chromecast owners. I wish this device also had a 5ghz wifi mode as I have run into issues a couple times with quality when streaming to it over 2.4ghz. I love that I can cast web tabs but this feature is still rather buggy. Otherwise I primarily stream netflix, hbo go, and plex to this device and they all work really well.", "verified": true, "helpfulness": "0/0", "author": "Trey Kyle"}]