[{"rating": 1.0, "review": "Have to download and setup every timeI want to use it with my Kindle HDX!  Was never informed that it was not compatible with the Kindle!", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "The Google Chromecast HDMI Streaming Media Player has worked flawlessly I now have three of them and can watch a Netflix movie in any one of the rooms as I go from one to the other....", "verified": true, "helpfulness": "0/1", "author": "Jim"}, {"rating": 2.0, "review": "It works fine but should come with its own remote control so you can use it without using another device.", "verified": true, "helpfulness": "1/1", "author": "Joan Fagel"}, {"rating": 5.0, "review": "If you have an Android phone and/or tablet, you need to get a Chromecast.  It's worth way more than what it sells for.  Very easy to set up and even easier to use once it is.  It makes playing music (via Google Play Music) and videos (via YouTube, Google Play Movies/TV and HBO Go) to your TV super simple.  If you don't have one, you should.", "verified": true, "helpfulness": "0/0", "author": "Kevin Mueller \"Truck Camper\""}, {"rating": 5.0, "review": "This was a great product. I use it all the time. It makes watching Netflix on my tv a whole lot easier.", "verified": true, "helpfulness": "0/0", "author": "joaquin rico villanueva"}, {"rating": 2.0, "review": "Did not have the needed jacks to hook up to my tv.  Information on website did not inform me of what was needed.", "verified": true, "helpfulness": "0/0", "author": "David Crine"}, {"rating": 2.0, "review": "In my setup with a Samsung TV 4 feet away from the router and Android and iOS devices accessing the Chromecast the media player felt like a beta version, working nice and smooth at times and being irresponsive at other times.The setup is easy and the hardware seems to be solid, but the required USB cable destroy the clean. My hope is that future versions of the software will improve the reliability.", "verified": true, "helpfulness": "0/0", "author": "Shaken Not Stirred \"kidnej\""}, {"rating": 5.0, "review": "It does what it is suppose to do.  Great shipping time.  Would do business with again.  So far google products have lived up to their reputation.  Keep it coming!", "verified": true, "helpfulness": "0/0", "author": "Cory Gene Newport \"bushlaff\""}, {"rating": 1.0, "review": "Sometimes it works, most of the time it doesn't.  The majority of the time, i cannot connect to it. The device is not found, even though the tv is on the welcome screen. When it does work, if I am watching a movie, it will lose connection and when the movie is over I cannot stop the movie.  If I am watching a TV show, I cannot stop the episode and start a new one.  It worked fine the first couple of times then just crap.  I have tried updating Netflix, YouTube, and Chrome software.  I have uninstalled, rebooted, reconnected.  Just tired of dealing with an unreliable product.  I expected more from Google.", "verified": true, "helpfulness": "0/0", "author": "tpb75"}, {"rating": 4.0, "review": "I'm confused about what the Chromecast is supposed to do?  It's essentially a wireless HDMI cable that only broadcasts the Chrome browser...so...what does that really do for anyone?  The Chromecast is meant for the person that doesn't have a blu-ray player with streaming, a gaming console, roku, apple tv, media pc, or smart tv?  But that person for some reason owns a tablet, smart phone, or laptop with streaming subscriptions, and a newer TV with HDMI?Obviously I am not that person, and I'm having difficulty imagining who this device is for.  I'd advise anyone that doesn't already have a streaming device, to buy anything else.  The Chromecast is cheap, but it doesn't do anything your laptop or smartphone can't do already with an HDMI cable. (The cable will do a better job too, and for cheaper)", "verified": true, "helpfulness": "0/0", "author": "Velourfog"}]