[{"rating": 4.0, "review": "Great stuff  , it make regular tv into a smart tv ! Just waiting for more applications to come  ! To really enjoy", "verified": true, "helpfulness": "0/0", "author": "Lows"}, {"rating": 5.0, "review": "Priced at $35.00, can not beat it.Easy to use.Opperate from your smart phone.Portable if you like.just needs more apps - on the way.", "verified": true, "helpfulness": "0/0", "author": "Tom Sargeant"}, {"rating": 4.0, "review": "Limited choices of content, but for the most part gets the job done. I would like to see more options in the future.", "verified": true, "helpfulness": "0/0", "author": "Carlos Ballesteros"}, {"rating": 2.0, "review": "Works great, but only set up for netflix and YouTube... Need amazon streaming, watchESPN, redbox streaming, etc. to actually be useful.", "verified": true, "helpfulness": "0/0", "author": "gtg022y"}, {"rating": 3.0, "review": "To bad google blocked support streaming of local content, otherwise, it is a great product and I like it a lot.", "verified": true, "helpfulness": "0/0", "author": "Ofer Perets"}, {"rating": 5.0, "review": "I like to watch YouTube since I cut cable and this makes it easy for me to get it on my TV since my TV doesn't have a built in app. I prefer to search for videos on my iPhone or laptop anyway. I've also cast entire tabs from the Chrome browser, but I can't see myself getting much use out of that. My kids love to watch cat videos on YouTube now. I really like playing HD surf videos just for something pretty in the background. I did have to use the WiFi extender that came with the device. I also plugged it into my Yamaha RX-V473 receiver and it works fine. When I switch to that input the ChromeCast then connects to my network. You do have to restart the Chromecast app on the laptop or iPhone if you have rebooted since the last time you used it. Overall I'm happy with this.", "verified": true, "helpfulness": "0/0", "author": "David McLaughlin \"Frontline 9\""}, {"rating": 4.0, "review": "I would've gave it 5 stars if it had its own battery. Would be convient for the ppl who dont have usb outlets in their tvs", "verified": true, "helpfulness": "0/0", "author": "Britnee L. Adams"}, {"rating": 5.0, "review": "Awesome devise, haven't gotten it to work with my iPhone but works great with my computer. Great for Netflix and YouTube. I like that you can cast a tab and keep doing other things while it plays on the tv.", "verified": true, "helpfulness": "0/0", "author": "Baolbaol"}, {"rating": 3.0, "review": "The device works pretty good with excellent video and sound quality. Sadly Google choose to cripple their own brain child! If you want to watch a video you made yourself, it's a No-Go. Listening to music you put on your phone directly (side loaded) it's a No-Go. Why? Because Google choose to remove the ability to use local media!! Why?? Because they can. There is really no other reason. Copyright?? Nope! A Google rep says it was an oversight, but after several more updates there is no fix for the issue. What a shame! If I hook up my hdmi cable, everything works. Come on Google, do the right thing and fix it already!", "verified": true, "helpfulness": "0/0", "author": "Gregory M. Ross \"PhotoMaster\""}, {"rating": 3.0, "review": "If you watch Netfix or those other pay extra services and you need a WiFi path over to your TV this isn't bad. Displaying your personal files pictures, videos etc. you'll have to jump through hoops to get it done. Wait till they work that out.", "verified": true, "helpfulness": "0/0", "author": "Enigmaview"}]