[{"rating": 5.0, "review": "This device arrived at my home pre-programmed to my Amazon account and ready to use. I plugged it in and it started working right away. The interface is similar to our Kindle Fires, and was very easy to use without any instruction. I could't locate the Free Time options, so I asked Amazon to contact me. They called me within 10 seconds, and a live person was on the line. He showed me how to install updates, which included the Free Time suite, and stayed on the line until I had everything up and going. We've been using the Fire TV for a few days now without a single glitch or problem. I love the parental controls, and all of the content available through Amazon Prime and Free Time Unlimited. I thought I might get Netflix and Hulu Plus as well, but I honestly don't think I'll have any need for them any time in the near future because we've found everything we've looked for right on Amazon. Very happy! This was such a stark contrast to the Roku Streaming Stick we ordered, which didn't work right out of the box, offered only online tech support, an hour wait for help with the problem, and no solution offered after only 10 minutes of trouble shooting. I sent it right back and will be replacing it with another Amazon Fire TV device.", "verified": true, "helpfulness": "1/1", "author": "TCA"}, {"rating": 4.0, "review": "Arrived today — super easy to set up, looks great, sounds great. And I'd give it 5 stars except for ONE simple thing it needs —profiles like Netflix! Different personalities and ages in a household demand different watch lists to keep from having to sift through one massive list, keep kiddos out of mature material, etc. Actually shocked that the option isn't already in place -- seems like a no-brainer that the smart folks at Amazon would have thought of before launching the product.", "verified": true, "helpfulness": "0/0", "author": "A. Steakley"}, {"rating": 5.0, "review": "Awesome! Small, convenient, and easy to connect. Wish we could separate Prime but will wade through it.", "verified": true, "helpfulness": "0/0", "author": "bg"}, {"rating": 4.0, "review": "I've had my Fire TV a few days now, and while it has some cool things such as automatically linking the pictures I've taken with my Kindle Fire to the TV, I can access everything through my TV, Blu-ray or PS. The voice search has worked well, so that's nice. You have to buy the game controller separately and it would be nice if they had a bundle too. Games are not included, you have to buy them, so be ready to pay for some apps. You'll need an HDMI connection, so if you are using all of yours you'll need to switch between devices or use a splitter. Since I can stream movies and music to my TV and sound system from my phone and tablet without the Fire TV it's more a gadget than a necessity. If you like gadgets and fooling with your gear get it and have some fun!", "verified": true, "helpfulness": "0/0", "author": "timothy morgan"}, {"rating": 4.0, "review": "Loved it to begin with.  Developed a problem connecting to Netflix - couldn't reset the registration information on Fire TV - must use other equipment to watch Netflix now.  Although they tried, no one at Amazon was of great help. They don't know how to get into the registration information.  Needs to additional development.", "verified": true, "helpfulness": "0/0", "author": "Robert W Jordon"}, {"rating": 5.0, "review": "Pure awesomesauce, miles ahead from any other android box, even the newer releases. this SoC is just better than anything available", "verified": true, "helpfulness": "0/0", "author": "Carlos Velazquez"}, {"rating": 5.0, "review": "great to use", "verified": true, "helpfulness": "0/1", "author": "Doralynne K. Metz \"Dodi Metz\""}, {"rating": 5.0, "review": "Love the Fire.", "verified": true, "helpfulness": "0/1", "author": "MEH"}, {"rating": 5.0, "review": "To give you an idea of my comfort level with technology, I like to play around with the settings and integrate my tech as much as possible to get the most use out of them.  We own several “smart” devices and I make sure all are up to date.In trying to decide between the Apple TV, ROKU 3, and Fire TV, all had to have certain apps (ex: Amazon / Crackle / ESPN / Netflix / YouTube) for it to be considered.  I generally could care less how many channels a specific streaming box may have as we / I are not going to watch most of them; just that it has the key ones required.I decided to try the Fire TV as it seemed to have the quickest loading time of the devices with the least amount of buffering issues.  The gaming aspect of the Fire TV did play in my decision, but it was not a key factor.  Basically, if I was unhappy with the streaming capability of any device, then gaming would be a poor substitute for value.  As a note, in the two weeks I have owned this device, there has only been one instance of buffering.Setup for the Fire TV is very quick (already loaded with your Amazon info) with just the needing to connect to your home internet before downloading any apps and entering your account info with them (ex: Netflix).  I also suggest to immediately look for any software updates as almost any device has one.For Amazon Instant Video, the loading time for any movie or show is insanely quick.  I know software was written to cue streaming if you “hover” over a selection – and it seems to work very well.  For overall performance, it is very impressive.  I have four areas I would love to see Amazon improve Instant Video for the future.  1 – Allow individual profiles a ’la Netflix.  With multiple people in our household, some watching the same series / movie, this is a necessity.  2 – When finishing watching an episode in a series, have it automatically cue to the next episode.  3 – Allow adding a series to the WATCHLIST versus only being able to add a specific season (of which you then need to remove the viewed season and then add the next one).  To be blunt, this is fairly clunky.  4 – I would really like it if there was a section devoted to Amazon Originals.  They have a section for HBO (which I love), but not one for their own shows.For other services such as Crackle and Netflix, it does start streaming quicker than via the XBOX 360 or computer.  Further, buffering issues are non-existent!  From all of the reviews I read, I was unsure how good the performance would be.  But, I can report it is at least as good as any other device if not slightly better.I find the included remote to be very responsive and easy to hold.  The texture is comfortable and seems to fit well in my hand.  As to the much vaunted voice search, it works with a couple of apps besides Amazon, but not yet on Netflix.  I have read where Netflix has agreed to have the feature integrated into their app by the end of the year.  If it works as well on Netflix as it does on Amazon, this could be an outstanding feature for some people (I am not sure how much I will use it – but it is a cool feature).As to the gaming side of things, I already owned a MOGA controller, so I was curious as to how good of a job the Fire TV could do.  We downloaded a few games (ex: Riptide GP 2 / Rally Racing / Asphalt 8) to test.  To my surprise, the graphics were pretty good (based upon the type of device it is – it is not a true gaming console) and the gameplay is quite responsive and fun.  I would not base the purchase of a streaming box strictly on its gaming performance, but it does help justify the price.  It has been used fairly extensively and I have a feeling it will be used regularly in the future.Overall, I have been very happy with the Fire TV and I do not regret my purchase in the slightest.  The performance aspects are outstanding and I look forward to updates (ex: Netflix) and additional features.  If anything changes – good or bad – I will update.Update (8/30/15):  I wanted to provide a quick update as I have owned the Fire TV for a bit over a year now.  Since then, I have compared it to several other streaming boxes, and this one is still my favorite.  It is still the fastest overall with the Prime Instant Video still extremely quick to load.  It appears they are getting ready to come out with a second version - and I look forward to seeing how they improve upon this one.  But, if they seriously drop the pricing for a refurbished version, I would suggest to purchase it.Also, the addition of adding Bluetooth headphones has been great.  As with the MOGA controllers, pairing was very quick and easy and has worked without issue.", "verified": true, "helpfulness": "1/1", "author": "BigO"}, {"rating": 1.0, "review": "I could not get it to work and I could not understand the Amazon technical support person because of his thick accent. The written instructions were no help.", "verified": true, "helpfulness": "2/3", "author": "JRE"}]