[{"rating": 1.0, "review": "This purchase was a waste of time and sweetness for my love. She is pregnant and this was a gift for her after her first trimester. It is the most painful device to try and connect. I am usually pleased with Amazon, not so much this time......", "verified": true, "helpfulness": "2/3", "author": "Russell whaley"}, {"rating": 5.0, "review": "In my book, the Fire TV is superior to Fire Stick. Its faster! Love it!", "verified": true, "helpfulness": "0/0", "author": "etriplec"}, {"rating": 5.0, "review": "Everything your family need in a small box from games to movies and live tv from Sling TV, Amazon Tv saves you 70% on cable bill when all you need is right here", "verified": true, "helpfulness": "0/0", "author": "Ken Ramos"}, {"rating": 5.0, "review": "Sweet deal. Great idea. Awesome and tons of fun", "verified": true, "helpfulness": "0/0", "author": "Jeff McGinnes"}, {"rating": 5.0, "review": "The Fire TV is great. The only problem (not Amazon's fault) is that you cannot get HBO Go and other premium network's apps through comcast. But all-in-all Fire TV is one of the best purchases ever.", "verified": true, "helpfulness": "0/0", "author": "Robert katner"}, {"rating": 5.0, "review": "The Amazon Fire installed easily and was well above my expectations.  I was pleased to see the photo storage and display option and music access.  I had not expected that.  The graphics were very nice.  It is a pleasure to own.", "verified": true, "helpfulness": "0/0", "author": "Jim Eller"}, {"rating": 5.0, "review": "This is wonderful", "verified": true, "helpfulness": "0/0", "author": "Sharon Baker"}, {"rating": 5.0, "review": "Fire TV is so easy to set up. It is fast and provides easy access to Amazon Prime, Pandora and other sources of music and video.", "verified": true, "helpfulness": "0/0", "author": "James Trifone \"epistoman\""}, {"rating": 5.0, "review": "First I tried the Fire Stick and it worked fine. Got a chance to get the TV and I'm happy with it! Works well, low power(compared to my other media consumption devices), and just all around a snappy device. I think the UI could use some work or allow for customization, but overall it's a solid buy if you don't already have another way to consume media.", "verified": true, "helpfulness": "0/0", "author": "jack"}, {"rating": 4.0, "review": "It's great. My only problem is that I can't get NCIS", "verified": true, "helpfulness": "0/0", "author": "Sherman Flynn"}]