[{"rating": 5.0, "review": "This is an EXCELLENT device for video streaming.  The big plus over Roku and AppleTV is the ease with doing a search using the voice search.  When I use to search through my Blu-ray player for Amazon Prime movies/TV shows and/or Netflix, without voice search, it was soooo tedious.  Now searching is so quick.  The Amazon Fire TV was so easy to set up.  We have two in our household, one in the master bedroom upstairs and one on the main TV in the family room.", "verified": true, "helpfulness": "0/0", "author": "P. Scidmore \"YLtennis\""}, {"rating": 3.0, "review": "I'd have rated it higher but they don't support directv as a provider.  This wasn't mentioned anywhere before I bought it and I can't find any info on if it's in the works.  Since I bought it to go in our bedroom rather than adding a receiver this is pretty disappointing.  I can watch Netflix, Hulu and Amazon on our playstation.  I may return it and go with an Apple TV.", "verified": true, "helpfulness": "0/0", "author": "ARP"}, {"rating": 5.0, "review": "Awesome lil machine. Quick and responsive. Love the voice search... saves a ton of time and effort. Plus its fun seeing what you can bring up with keywords. The gaming remote (which I purchased) is a nice addition to this power packed entertainment system. Highly recommended both for gaming and tv/movie fans.", "verified": true, "helpfulness": "0/0", "author": "John \"bbmaster\""}, {"rating": 5.0, "review": "Great choice of Prime Instant Video for all viewing selections.  Great programs for my four and six year old granddaughters.  Excellent picture quality.", "verified": true, "helpfulness": "0/0", "author": "Gary A. Knutson"}, {"rating": 4.0, "review": "Hope to get some contents available in Argentina soon.", "verified": true, "helpfulness": "0/1", "author": "Jonatan ponzo"}, {"rating": 4.0, "review": "Lots of apps. Very please with audio & video quality.", "verified": true, "helpfulness": "0/0", "author": "Layne Hood"}, {"rating": 5.0, "review": "As a Prime member, there are plenty of programming options for FREE!  Could not be happier with this.", "verified": true, "helpfulness": "0/0", "author": "curly girl ny"}, {"rating": 1.0, "review": "I have looked into getting this box 3 or 4 times now and keep stopping myself from buying it.  I have Apple TV and Roku 2 on each of my 3 TVS.  Everything I read keeps saying this is good but my one draw book is the Vudu app.  Once Amazon puts Vudu on the Fire TV I will consider buying.", "verified": false, "helpfulness": "0/11", "author": "Rocky Mee Jr"}, {"rating": 5.0, "review": "I love this thing!!  The only criticism I have is that I cannot find an app for playing music files from a USB stick.  However, with the Vimu player app I can access all the music files I want from all the computers on my network.  Very nice!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I absolutely love this thing!  I have spent so much time watching movies and so far all of them have been free.  I also have Apple TV, and Amazon Fire TV beats Apple hands down.  Fire TV is so much more flexible and user friendly.  This is one of the best purchases I have ever made.", "verified": true, "helpfulness": "0/0", "author": "Angie"}]