[{"rating": 4.0, "review": "Works as advertised. Would give 5 stars if it worked with more apps or anything displayed in my browser. Given the limitations I am more likely to use AirPlay through Apple TV along with AirParrot to project from my PC.", "verified": true, "helpfulness": "0/0", "author": "michael taliefero"}, {"rating": 5.0, "review": "Its a very simple product, and works great. It's very easy to set up and use. Wish have more app working with. The major flw it's the impossibility to stream local contents like pictures and music saved in your computer (you can, but you need to do using your chrome browse, but, this kill the idea of simplicity). Any way, if you want stream Netflix and YouTube, you can't get wrong with thi little thing.", "verified": true, "helpfulness": "1/1", "author": "C. Rocha"}, {"rating": 1.0, "review": "Dont get me wrong. This is probably one of the best tech for folks who want to view internet content on TV.Unfortunately for me, the dongle wont work with my Vizio TV. I replaced the dongle once assuming that i got a defective piece (thanks to Amazon while Google support dragged the case for-ever) but still the same issues.It just wont work with my Visio. (Its an LED tv). The video starts flickering and then breaks every 5 seconds, giving me a blue screen. To me its a waste of investment until i buy the next TV. Now you tell me, is it worth to buy a new TV just to make $38 chromecast work? Why not i just buy a smart tv rather? I dont know..There is no warning from google that the dongle will work on on a certain kinds of TV (afaik) and i feel cheated :(Please take a look at some of the comments before buying the dongle.[...]I am still trying to figure out a way to get this thing work. Hope i will stumble onto something.", "verified": false, "helpfulness": "2/3", "author": "Punnoose Isaac"}, {"rating": 3.0, "review": "It works okay, but many videos are jerky and the video and sound are often not sync'd and I still haven't figure out how to get it to work with all of my devices, laptop, two tablets, and android phone.", "verified": true, "helpfulness": "0/0", "author": "Josef Lowder"}, {"rating": 5.0, "review": "Works just as expected. Perfect for YouTube parties no matter the mobile platform you use :). Tab sharing allows to watch videos much more than just from YouTube.", "verified": true, "helpfulness": "1/1", "author": "Eugene T."}, {"rating": 5.0, "review": "It easy to use ando you can see videos and movies in you big screen tv... also if you travel can do the same at the hotel...", "verified": true, "helpfulness": "1/1", "author": "Enrique"}, {"rating": 3.0, "review": "Google Chromecast is a slick little inexpensive device that works very well at streaming media to a TV or HDMI monitor, but it only works with apps that were designed to support it (like Chrome, Netflix and YouTube). At the current time, this is rather limited, so you can't stream music, pictures or videos stored on your phone or tablet. I expect this will improve with time as more developers add support for it.", "verified": true, "helpfulness": "0/0", "author": "D. A. Down"}, {"rating": 2.0, "review": "This device is great for casting youtube and netflix to your big screen tv. other than that it's worthless.because most devices now has youtube and netflix app like playstation3, wii, xbox, smart tv, etc. so what's the need for chromecast?i try to cast a live streaming from a website and i hate how chromecast perform, i believe it's still on beta, so i'm hoping google will make it worth to have.", "verified": true, "helpfulness": "0/0", "author": "aris"}, {"rating": 4.0, "review": "There are times where you are sitting in your living room and a particular YouTube video, or website comes up.  You want to show it off, and everyone huddles around your phone to see.  Enter Chromecast.I'm using a 6 year old sony XBR (non-smart) tv with the chromecast.  Video signal is transmitted over an HDMI port, and the Chromecast is powered using the USB connection on the TV.  Setup is quick and painless  utilizing an app available for download online via browser for your computer, or in either respective store for iOS or Android.  Right now, you can \"cast\" any content from a browser window directly to your TV, in addition to specific support for Netflix and HULU (soon to come I believe).  I hear there is further development going on to implement more features (i.e. casting local filesystem content).If you don't have a smart TV, game console, or any other way to view streaming video content at your TV, this is an indispensable device.  Even if you do have those things, at $35 this is a nice toy to play with, providing a backup in case your other video streaming hardware options bite the dust (my XBOX 360 just died recently).  You can literally move a streaming video mid-view to your tv, and continue to control the playback via phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "sethat"}, {"rating": 5.0, "review": "Turned out to be far more useful than anticipated and would recommend to anyone with a similar need to the manufacturer's stated use.", "verified": true, "helpfulness": "1/1", "author": "David J Caulfield"}]