[{"rating": 5.0, "review": "Good product and speedy delivery.  Very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Pat Norris"}, {"rating": 4.0, "review": "Easy to install works well - not great picture quality but usually the streaming is from low quality vids.", "verified": true, "helpfulness": "0/0", "author": "Paul F Dessureau"}, {"rating": 5.0, "review": "Aside from not being able to play and provide a WiFi connection with the same phone, it is an excellent device.  Keeps getting better and better everyday as new apps provide compatibility.", "verified": true, "helpfulness": "0/0", "author": "Timbo"}, {"rating": 5.0, "review": "Easy and sensible. Pretty much the perfect addition to my home theater system. If I ever get a second TV, I'll definitely buy another one of these.", "verified": true, "helpfulness": "0/0", "author": "Michael StClair"}, {"rating": 4.0, "review": "Nothing special to see here.If you want a simple, easy, inexpensive streaming device, then Chromecast is for you. Chromecast allows you to stream from popular sources like Netflix, YouTube, Google Chrome Webpages.The box comes with: 1 Chromcast (looks like a little USB stick), 1 Charging Block, 1 mini USB to USB cord, 1 HDMI extender, great customer servicePros: Easy to use and set up, inexpensive, easily transferrable, good quality on some sitesCons: Not yet compatible with all streaming services (Prime Instant Video, iTune), lag time on browser casts, my first chromecast stopped receiving electrical input... i.e. it broke", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "bert"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Nicolas Penott"}, {"rating": 5.0, "review": "Radically changed how i watch Youtube videos and Netflix for sure! Great Google Product", "verified": true, "helpfulness": "0/0", "author": "george123"}, {"rating": 5.0, "review": "my 2nd one I bought. I got one for my mom and plan to buy another one for the house. I hope Google keeps coming out with more Apps to use.", "verified": true, "helpfulness": "0/0", "author": "angel"}, {"rating": 5.0, "review": "Great product if you have a good internet connection", "verified": true, "helpfulness": "0/0", "author": "Dawn C"}]