[{"rating": 2.0, "review": "I purchased this in the hope of using it to send my music and movies to my television. You can only use it to watch movies from netflix $, hulu $ or Google Play movies $.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a great product for sharing media from your other devices. It is small and simple to use. If you photos or movies on your phone you can simply stream them to the television and share with everyone in the room.", "verified": true, "helpfulness": "0/0", "author": "Phyllis M. Szeliga"}, {"rating": 1.0, "review": "First one failed to give set-up page on older TV, then burned out in 24 hours.  Second one did not work with older TV bu did get to Set-up page with newer TV.  Program crashed every time I tried to specify a network and assign a name using a newer Mac Book Air running the required version of OS X.", "verified": true, "helpfulness": "1/1", "author": "Sam"}, {"rating": 5.0, "review": "Very Good but I wish I could use Itunes to stream with it.All in all a solid product.Thats all folks!", "verified": true, "helpfulness": "0/0", "author": "Dude"}, {"rating": 2.0, "review": "After long attempt to connect using Macbook Pro and Airport Express (Apple Wifi), I finally got the Chromecast set up. But then, it did not scale properly on screen (sides cut off maybe half inch) and no sound to be found. I tried various settings, but no good resolution. I will be returning it, and just using HDMI cable to project screen. Then it will work from all screens (not just chrome), have near immediate response time (which Chromecast did not for me, including can't see cursor on TV), and will have 1080 quality (instead of max of 720 with current Chromecast consumer edition, not API).", "verified": false, "helpfulness": "0/0", "author": "Customer on Amazon"}, {"rating": 5.0, "review": "Chromecast (Google) is adding more and more ways of running Chromcast.  I like how the streaming on, let's say YouTube, is handed of the Chromecast.  I can start a YouTube video and go back to what I was browsing or turn off my laptop or smartphone and it keeps streaming.Well played Google!", "verified": true, "helpfulness": "0/0", "author": "Robert W. Hodges"}, {"rating": 4.0, "review": "It's worked great. Was very easy to set up. Bought a second one for the other TV. Have been doing Netflix marathon of Breaking Bad. Casting the contents of my Chrome browser comes in handy too. Wish it would cast my entire desktop (Mac and PC).", "verified": true, "helpfulness": "0/0", "author": "K. Fuller"}, {"rating": 5.0, "review": "This was so easy to setup.  And the quality is amazing, although it does seem to work best from a phone or tablet than casting Chrome.  I will use this for years to come and it will travel with me.", "verified": true, "helpfulness": "0/0", "author": "VitaminMoose"}, {"rating": 3.0, "review": "Before I purchased Chromecast, I read a few reviews that said it was a simple set up, just plug it in to the TV and it works. That didn't happen. It wouldn't recognize our wi-fi network. My son had to reset the network, which changed the password, so then everything in the house -- laptops, printer, phones -- had to re-input passwords. It took me 3 hours to get the printer set up for wireless printing again! Now everything is working, including the Chromecast, but the setup is NOT easy!", "verified": true, "helpfulness": "0/1", "author": "Patricia A. Lowczyk"}, {"rating": 5.0, "review": "Have issues with Netflix playback. Also, have it plugged into my 7.1 surround sound receiver and it only uses the 2 front speakers, but everything else has worked great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]