[{"rating": 5.0, "review": "Ok here's the deal. I bought this to use with one of my tv's. I unwrapped it (very easy) plugged it in (even easier) and then went to my computer to set up the software (a cinch). When I got it all done about 12 mins later I was able to view what was on my Android (Samsung Galaxy S4 Active) easily. Picture is fantastic, sound is great. It's also very easy to choose when you want to stream.This little gadget is GREAT for anyone who wants to stream Netflix, Youtube, Hulu etc.What I didn't realize is that I have a PS4 also connected to that same TV and I could've just streamed Netflix through that. Instead of purchasing this. So I returned it. Great little gizmo but not what I needed. Thank you Amazon for your great refund policy. Had my refund in 2 mins after filling out the form.This is great for ppl who need it. Works simply and well at a low cost.", "verified": true, "helpfulness": "0/0", "author": "Queen B"}, {"rating": 5.0, "review": "Great device", "verified": true, "helpfulness": "0/0", "author": "Wilfred Holmes"}, {"rating": 5.0, "review": "Cool device:>)", "verified": true, "helpfulness": "0/0", "author": "Henry PAN \"Henry PAN\""}, {"rating": 5.0, "review": "Five stars easily!! The best! Now I can watch just by connecting to it!!!!", "verified": true, "helpfulness": "0/0", "author": "Sanjuanita"}, {"rating": 4.0, "review": "First of all, it is not a miracle device. What Chromecast does is to cast \"cast-supported\" apps from your smart phones, tablets, and stream media from your laptops and PCs to the TV on the same local network (LAN).Setup is easy and straight-forward. Connect Chromecast to your TV, download Chromecast apps from Google Play / iTune to your device, making sure Wifi-is on, setup Chromecast's Wifi connection via your mobile device, and it is done. Setup only needs to be done once. Other supported devices connected to the same local network will then all be able to use the same Chromecast.Now Google Play has a section dedicated to Chromecast compatible apps. For some reason, this section is only shown via Google Play app, not browser version, but going to chromcast.com/apps would also give you the list. Currently the selection is quite limited, with a great deal of them just variations of apps for streaming media from your local computers and media servers to Chromecast. Others like YouTube, Netflix, Hulu, and so on frequently requires paid subscription to truly make a difference.Basically, Chromecast combines your mobile device and TV into a fast-response SmartTV.The Touch-Ups which could potentially make Chromecast a perfect device:Currently, the only way to cast PC Desktop screens onto Chromecasted TV is to download the Google Chrome extension \"Google Cast\" by Google (sorry, mobile Google Chrome is currently not supported). It gives your the option to stream a dedicated browser Tab or cast the entire desktop screen. However, there are some flaws:1. In general, casting would mess up your Google Chrome \"non-maxed\" window size. It is a mild annoyance, but still annoying anyhow.2. Tab cast mode has no option to display mouse cursor. Not an issue for portable laptops, but a serious issue for a casting PC from another room.3. Desktop cast mode does display mouse cursor, but it could only cast the whole desktop. If you have a multiple monitor setup, it practically makes the cast useless.4. Neither Tab mode nor Desktop mode have build-in PC control mechanism. Although this could be easily fixed by using app such as \"Unified Remote,\" it is still one extra step.*How 4. works, Google Cast to cast PC desktop + Unified Remote on your tablet/smart phone to control the PC -> result displays on TV**Better solution: Chomecast app integrates with Google Cast. It still needs PC, TV, and mobile device to work, but require one less app to install.If the above touch-ups could be implemented, Google Chromecast could be a potentially monopoly-accused TV casting device.", "verified": true, "helpfulness": "1/1", "author": "H. Chen \"Black Rice - Born To Dye\""}, {"rating": 2.0, "review": "Extremely SLOW to starting showing Youtube videos.  Sometimes it does NOT show Youtube videos", "verified": true, "helpfulness": "0/1", "author": "Evandro Schmitz"}, {"rating": 3.0, "review": "The product sometimes finds itself stuck in downloading mode sometimes and it is quite frustrating when it does.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 5.0, "review": "Best thing ever", "verified": true, "helpfulness": "0/0", "author": "Isabel"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Gianfranco De Blasi"}, {"rating": 4.0, "review": "Great product for the money!", "verified": true, "helpfulness": "0/0", "author": "April MacMackin"}]