[{"rating": 4.0, "review": "We actually cut off our cable, and just use this!Connected it to a 50\" 1080p LEDLCD store-brand display, and were blown away. Forget about remotes, you interface with the content on your android, and \"Cast\" it right to your set!Netflix? Flawlessly and quickly. Setup? An cinch! The possibilities? ENDLESS?Nothing brings me more joy than casting videos of puppies on YouTube from the bedroom upstairs and freaking out the dogs asleep on the living room floor. Better than that first cup of coffee.Casting your Chrome Browser works well, but is in Beta, so not perfectly.It shipped so fast, too! Yay!", "verified": true, "helpfulness": "2/2", "author": "Jem \"Aeterna tenebris abyssi stupefiat et obduxit vos in eius infernalis aegris dulci amplexu.\""}, {"rating": 5.0, "review": "Easy to connect, it works very well with my HP Split ultrabook and with Galaxy S5. Very satisfied with the product!", "verified": true, "helpfulness": "0/0", "author": "Judson Borges"}, {"rating": 4.0, "review": "Works as advertised.  Simple hookup and connection.  The problem is the lack of video applications that support it ... Chrome is the only one of a couple of apps that support it and I bought it almost a year ago thinking that more apps would be added ... come on Google....", "verified": true, "helpfulness": "0/0", "author": "Kevin W. Wright"}, {"rating": 4.0, "review": "I really like the interface and it was really simple to setup. As they add more features I'll be even more satisfied. It's a great deal and has a high value to usefulness ratio. I'm moving away from Android devices but the great thing about this device is that you can use it with a Chrome browser so I can stream from my Surface Pro too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fun to use and easy to install glad I bought it. Wish it could work with my Mobil hot spot though. .", "verified": true, "helpfulness": "0/0", "author": "cruz ochoa"}, {"rating": 1.0, "review": "I know a lot of people really love the Chromecast device, but I truly regret this purchase.  My long time stable home wireless network now is a constant worry.  My tablet and phone will not connect to the internet once Chromecast has been turned on without first unplugging Chromecast, then unplugging the modem, then powering off each of my devices, then plugging the modem back in, then powering up each device, forgetting my network on each, signing back on to my network on each device, and then *trying* (50% success rate) to connect to my network.  Nobody has any answers for this, though through googling I've found others with the problem.  To me, Chromecast is not worth all this trouble, and it is going back.  I just hope I can somehow get my wireless network back to its customary exemplary operation once Chromecast is out of here!!  What a pain.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Evie\""}, {"rating": 3.0, "review": "we actually sent this back.  we wanted to use it as a way to broadcast from our tablet (nexus) to the tv so we could actually stream shows on the tv.  a lot of the broadcasters didn't have an app for that so we found that we didn't need it.  we might try again later when they finally get on board.  not chromecast's fault i guess but still didn't do what we had wanted it to do", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "For those of you who don't know how this works:You plug it into the back of your TV in an HDMI slot  (one not already in use...) and it allows you to do things on that TV that you couldn't normally do.Basically, any App (Application) you can run on your phone, can be run on your TV via bluetooth.Like what?Like watch your Netflix movies or shows on a TV that doesn't have an internet connection!  That's really cool! No extra account needed!Show your photos from your phone on your TV screen (via bluetooth.) so everyone in the room can see themUse it as a remote for the TV via your smartphone.broadcast a movie from your phone on your TV.Again, basically, any App (Application) you can run on your phone, can be run on your TV via bluetooth.And- it doesn't have to be plugged in to a wall outlet the whole time!Drawbacks:When it is plugged in to the back of the TV, you can't just switch it off to watch regular TV or whatever. You have to unplug it.  Once it has been paired with your smart phone or ipad, it will automatically look for that connection as long as this device is plugged in to the back of the TV.Any games you can play on your smart phone can be played on your TV screen via bluetooth", "verified": true, "helpfulness": "2/2", "author": "slim \"57psalm\""}, {"rating": 5.0, "review": "Easy to use.You can watch everything, YouTube, Vimeo, NetFlix and streaming movies from your computer using the videostream app.", "verified": true, "helpfulness": "1/1", "author": "Fernando Douglas Távore Graça"}, {"rating": 2.0, "review": "Hard to handle, instructions aren't clear. When plugged in, volume is down for everything else. Return was easy, awaiting credit.", "verified": true, "helpfulness": "1/1", "author": "William Nussbaum"}]