[{"rating": 5.0, "review": "Installing is easier then pronouncing it, having Amazon Prime is a huge bonus, the word recognition is just awesome!Best Product on Amazon!", "verified": false, "helpfulness": "0/1", "author": "Leiby!"}, {"rating": 5.0, "review": "Very pleased with unit.  Voice search works very well.", "verified": false, "helpfulness": "0/0", "author": "Zuzu's Boy"}, {"rating": 5.0, "review": "Best investment ever.  After 25 yrs of constant price increases between cable and satellite service it I great to not have that expense.  The fire service is uninterrupted unlike cable and satellite. I get 13 local channels on an indoor antenna for broadcast TV. I watch what I want on Fire TV. No flipping through channels trying to find something to watch.Easy to install.", "verified": true, "helpfulness": "1/1", "author": "Charles Cunningham"}, {"rating": 2.0, "review": "not really feeling the fire TV.", "verified": true, "helpfulness": "0/4", "author": "Taheeia keith"}, {"rating": 5.0, "review": "It's awesome!", "verified": true, "helpfulness": "0/0", "author": "Robert Yallelus"}, {"rating": 1.0, "review": "Horrible!!!! on my second unit and does not turn on after initial set up.", "verified": true, "helpfulness": "0/1", "author": "Nathan Wistran"}, {"rating": 2.0, "review": "We are recent cable cutters which is no issue for us having previously been without cable. We were excited to try out the Fire TV since we have been long time Amazon subscribers. The Fire TV was a HUGE disappointment. It did not have all the apps we were looking for. Some of the apps required cable access which we do not have. That was a major issue with my son who wanted to watch Disney Jr and my husband who wanted History channel access. We could not search for Prime only content. The biggest problem was that the boxes were defective. The first box I received worked for less than 24 hours and then just quit working. I tried to find the problem with Amazon and then was sent a replacement box. That box did not work out of the package at all. Then they said a full refund would be issued and they would schedule UPS pick up. I told the technician that I did not have a printer at the moment to print the return labels and pick up would have to wait until I could either use our apartment complex's printer or finally order one.  The UPS pick up came the next day, which I had to decline. I was able to order a printer, send back the boxes and am waiting on  FULL refund because I paid shipping not Amazon. The box just did not live up to the hype. If I have to watch Power Rangers and Ninja Turtles all day, I'm doing it on the Roku.EDIT: They are issuing a full refund with shipping included. Amazon Customer Service has been great for me. I'm just disappointed in this product.", "verified": true, "helpfulness": "1/2", "author": "Cassandra \"Cassandra Littlefield\""}, {"rating": 5.0, "review": "JUST CAN'T LIVE WITHOUT IT.", "verified": true, "helpfulness": "0/0", "author": "MUBEEN QURESHI"}, {"rating": 5.0, "review": "Great product, I highly recommend it. Very versatile and great quality, plus you can't beat the service of Amazon.", "verified": true, "helpfulness": "0/0", "author": "Robert Jodra"}, {"rating": 5.0, "review": "very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Jeff K."}]