[{"rating": 5.0, "review": "Smart and simple way to turn a regular HD tv into a smart TV.The chrome cast is simple in its functionality... Just plug it into an open HDMI port, plug in the included adapter to a power outlet, and you now have the capability to use your smart phone as a remote control to play Netflix and YouTube content on your TV. Simple and straightforward.To be honest, there is actually a small, one time setup routine you do have to go thru to register the device on your network, but after that, it's smooth sailing. If you want to play a video off YouTube, just press the cast button, and if the tv is off, it will turn on and switch to the correct Tv input and you're off to the races.I only have two complaints about an otherwise fantastic product.The first is that it doesn't allow you to play content from your computer...yet. Apparently, this feature will be coming later this year.The second issue is that it sometimes over heats if left plugged in for long periods without use. This has happened 4 times over the last 3 or 4 weeks, so now I tend to unplug it overnight.Other than that,I can't recommend it enough. My sister saw it in action and immediately ordered one for herself.Totally worth it.", "verified": true, "helpfulness": "3/3", "author": "Kion S"}, {"rating": 5.0, "review": "this product is awesome. Sure it's not as full featured as other boxes, but it was simple and easy to use.", "verified": true, "helpfulness": "0/0", "author": "Jimmy Lieu"}, {"rating": 1.0, "review": "I bought this a few months ago and finally received it today. I was really looking forward to being able to easily stream media of all types from nearly any device with a wireless card. I thought of the incredible usefulness of a small inexpensive device that could steam the video presentations I create for my clients. Instead of a laptop and a projector, now all I would need to bring is my phone and a Chromecast.And now it's just another device that allows you to stream video only from Youtube and Netflix. A mandatory firmware update two weeks ago from Google REMOVED the one feature that made this thing worth buying. You can't stream  your own video to it. They are also hunting for user-developed apps for Chromecast and blocking access to them. So much for \"Open\" source.Nobody needs this thing now. Nobody.  You have better functionality from your Blu-ray player, or from any game console, or from the TV itself now. Every single one of those already allows you to watch media from Netflix and Youtube. And while Google scrambles to play catch up with all of those devices (at least one of which most everybody already owns) which already allow you to watch licensed streaming content, they forgot one important feature that those devices have which Chromecast will *NEVER* have..  each of those devices has a remote!Google doesn't care about what functionality people really want. They care about separating you from your money. Too bad a court of law will never get to nail the folks at Google for false advertising.", "verified": true, "helpfulness": "1/120", "author": "B"}, {"rating": 5.0, "review": "Read the reviews and articles to see limitations. I use it with a Mac and a pc. Only words with a Netflix on smartphones.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I just got this and haven't used it yet, but I have used it at a friend's house.  He has a 4K Seiki television and the picture on You Tube and Netflix is great.  We watched a few 4K videos on YouTube - very impressive video quality.Would have given it 5 stars except:  1 - It has to have power connected and you never see a power wire in any of the ads.  It's understandable since (to my knowledge) HDMI doesn't currently provide any power (like USB).  It would have been OK if it were a bit bigger if it had a battery (rechargeable, preferably) - that would be swell.  Take it on trips, simply plug it into the hotel TV's extra HDMI port and watch your own stuff.  I know you could still do that with a wire, but it would be nice not to have to find a reachable outlet.  2 - There aren't may apps (seems like it was, basically, YouTube and Netflix) - especially compared to something like a Roku.  However you can display any video that's running in your Chrome browser.  However, I have a number of videos (home movies, ripped DVDs - that I own) on my PC and tablets and it would be nice to be able to play them.  Perhaps that will be available later.By the way, Roku is coming out with a similar device (Roku Streaming Stick), but it will require a MHL port (something new on some TVs).  And I'm not sure at all of its power requirements.Further proof that this is an exciting time to live.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "There appears to be some confusion due to some of the marketing of this product.  While it works very well for YouTube, Netflix, and some chrome based videos, it will not stream anything else. This is a huge disappointment.  Some marketing implied that you could stream anything on your tablet, or android phone.  Quality of the video is good if this is all you want - but it's just plain stupid to offer a product like this with such limited functionality.", "verified": true, "helpfulness": "1/1", "author": "Michael A. Pavia"}, {"rating": 4.0, "review": "Nexus 7 works perfectly with this.  Windows needs to turn off virtual networks.  If you have Hyper-V or Oracle Virtual Box, Chromecast won't work, even though the diagnostics says it is.  At this time, Youtube and Netflix are the ones support chromecast.  I ordered early enough to get three month Netflix coupon with it.  Chromecast SDK is available only for Linux and Apple but not for Windows.  Google somehow does not have good programmers for Windows.  Google, don't ignore Windows!", "verified": true, "helpfulness": "0/0", "author": "udon"}, {"rating": 1.0, "review": "1. Google cast does NOT work with iOS, so you cannot stream from google chrome to chromecast on an apple device.2. Chromecast will not work through a VPN, so if you have a VPN connection on your laptop, chrome will not see the device.3. Good luck connecting if you are running windows 7.Bottom line, you can watch youtube and Netflix, buy a roku or wait for them to get their act together. This is cheap and still a waste of money.", "verified": true, "helpfulness": "2/5", "author": "Jon Z"}, {"rating": 3.0, "review": "Chromecast is not a device as described on its box. It can only stream from youtube or netflix (or google play) from smartphones. So far, I didn't find any other apps support it from a smartphone/tablet. On the box, it says chrome browser can stream its content to chromecast. This is true only from laptop version of Chrome. Actually, you have to install chromecast app from google play store,  which is not mentioned anywhere in the box (I found it by googling the topic - it is not described from chromecast homepage).As for the quality of the steamed video, so far it is OK. It is smooth. However, I found the contrast is too high compared to my TV content. I can tune the contrast on my TV but it is not convenient if I don't plan to use this TV for steaming only (It has to be tuned back and forth for different sources). The volume control via my ipad is not very smooth, the step is too large. Whenever starting or stop streaming, the volume will go back to maxima (or just very loud). It is for sure the original TV controller is a better choice.For people using smart TVs or Blu-ray players embedded with youtube/netflix capabilities, chromecast seems not that useful. (OK, to be honest, it is more convenient to search in youtube using a tablet/smartphone/laptop than on a smart TV.)Since it is so cheap, I will keep this device and expect Google team will expand its app support (at least make smartphone version of Chrome support this device). Hope Google won't disappoint me ...", "verified": false, "helpfulness": "0/0", "author": "MING LU"}, {"rating": 1.0, "review": "Constantly disconnects, unable to play paid for rented movies from Google Play or even watch Youtube videos.*Updated direct from Google's technical support: \"I appreciate your response, for the Chromecast to work its best it is recommended that it be within 20ft of the router with one wall of distance between. \"My Chromecast was 30 feet away from my WiFi base and had severe connection issues. I bought a Roku to replace the Chromecast and the WiFi works just fine now.If you're more than 1 room away from your router, pass up on the cheap Chromecast and get another solution.", "verified": true, "helpfulness": "1/3", "author": "Neal Solis"}]