[{"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it. Couldn't get along without it. Thnx.", "verified": true, "helpfulness": "0/1", "author": "JW-C"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/1", "author": "rater"}, {"rating": 2.0, "review": "Doesn't work ith my Kindle Fire HDX  purchased 2013!  I contacted Amazon, Comcast, Google and my local isp.  No help / connection available, even though we have wi-fi.  :(", "verified": true, "helpfulness": "0/1", "author": "Linda M."}, {"rating": 3.0, "review": "Disconnects from whatever is casting it frequently (usually my LG G2 but also my desktop, nexus 10 and laptop). For example, you might be casting Pandora from your phone and hear a song you wish to skip, you'll pull out your phone to hit the skip or thumbs down button and suddenly chromecast will stop playing and restart the Pandora app. So it will stop whatever you were playing and start a new song. Sometimes it will play entirely different songs other than what is currently being displayed. It will do the exact same thing with the Youtube app as well, so I do not believe it to be a problem with Pandora. It has done the same weather launched from chrome on my desktop or laptop as well, I have no idea what the problem is. It's almost annoying enough for me to consider to stop using it, box it up and ship it back for a refund.When it works though, it's awesome and very convenient.", "verified": true, "helpfulness": "0/1", "author": "Mpal"}, {"rating": 1.0, "review": "Probably the worst ever made product to try and setup, I wouldn't give this to an enemy. Three easy steps my a$$. Tried every work around they gave me and it still didn't work. Save your money for something better... perhaps a Roku3", "verified": true, "helpfulness": "0/3", "author": "Jay Roye"}, {"rating": 5.0, "review": "Haven't had any problems :)", "verified": true, "helpfulness": "0/1", "author": "Lyndsey E.  Patton"}, {"rating": 3.0, "review": "Video is very choppy when you try to mirror a chrome browser window on your laptop. I've used it for netflix, youtube and Korean drama, and it works very well. I've found it more convenient to directly connect my $100 chromebook to my TV for websites that don't have a chromecast app.", "verified": true, "helpfulness": "0/1", "author": "Arjun"}, {"rating": 2.0, "review": "Slow and hard to set up if you have to set up more than once", "verified": true, "helpfulness": "0/1", "author": "ROBERT LOOMIS"}, {"rating": 4.0, "review": "Really cool little device that saves you the hassle of dealing with an HDMI cable in order to get what's on your computer on to your TV screen. The streaming is not always seamless. I'm often unable to pause what I'm watching and have to restart the app and even have to turn off the TV at times in order to regain connectivity and not lose my place. I hope they will keep releasing updates to improve.", "verified": false, "helpfulness": "1/1", "author": "Sarah Shelton"}]