[{"rating": 1.0, "review": "It's what they don't tell you  There is more to it then is stated in the sales material. help desk not all that good.", "verified": true, "helpfulness": "2/5", "author": "Bon221d"}, {"rating": 5.0, "review": "The Google Chromecast has made TV interesting again.  Whether it is watch Netflix or Youtube it is great!  I have watched 4 seasons of the League,  Orange is the New Black, Breaking Bad, House of Cards.  I love that I can control the device from my phone. Love, love, love it!!", "verified": true, "helpfulness": "0/0", "author": "Balz Wit \"Spots\""}, {"rating": 3.0, "review": "Nice little product to stream YouTube and movies, I tried playing my music I have used the ear phones icon but said it can't play side loaded music.overall good little device.oh it seems to get warn if plugged into the power cord continuously so I use the USB port any so wiil shut off when the TV is off.", "verified": true, "helpfulness": "0/0", "author": "Angel Gonzalez"}, {"rating": 1.0, "review": "I thought i'm able to cast just about everything on my laptop/ipad, but no, just youtube, not that great at all", "verified": true, "helpfulness": "6/9", "author": "Victor"}, {"rating": 1.0, "review": "If I could give this unit a zero I would. I downloaded Netflix and realized it will not do the basics. I couldn't pause. That is a fundamental function and no matter how many times and how many ways, it would not pause after the first 3 or so minutes of a movie.Further, once the movie started I couldn't get my iPod touch to convert to the movie. All it would do was run the movie on the iPod itself.It's a great idea with a terrible result. It's a POS.Karen", "verified": true, "helpfulness": "3/5", "author": "K. Miller \"KM\""}, {"rating": 4.0, "review": "Well designed and works well with Google Chrome, YouTube, and Netflix.  The only draw back is the need for more apps for video streaming.  I have a Roku which has many apps but love the size and simplicity.", "verified": true, "helpfulness": "0/0", "author": "Mr. Paul"}, {"rating": 1.0, "review": "For the first time I'm disappointed with a product from Google/Amazon.This thing is a joke.  The synch of audio and video is horrid.  I know, I know, I did all that.  No joy.Google's suggestion is to move my wifi router closer to the TV.  NOT POSSIBLE.  If 3 feet isn't close enough then it's not possible to move it closer.I went back to my ATV3.  At least it synchs.", "verified": true, "helpfulness": "4/6", "author": "James B Deatsch"}, {"rating": 5.0, "review": "First I want to point out that TECHNICALLY this device is considered to be in BETA. That means that it is still being improved and developed.The downside, for streaming TO your Chromecast, is that you are currently limited to a small number of supported android apps and Google's Chrome Browser.The good news is that you can do almost everything you need to already with some performance issues here and there. If your goal is to stream Netflix, Hulu, YouTube, Google Play Movies, Google Play Music or other web pages you will be very happy. If you are looking to stream DVDs or other video files from your computer than you MAY be disappointed. It is possible to stream video files, but file performance may be lackluster and you have to play the videos through the Chrome browser - not a dedicated video play on your PC. Also, don't expect to be playing your android games or device screen on your TV yet. I have no doubt that will happen, but it currently isn't an option.I was also surprised that the mouse pointer isn't visible when sharing a chrome tab OR your entire PC screen. That would be an excellent addition for presentations.I really think there is a lot of potential with this device. Hopefully it will get better and better over the next several months. For now though, $35 is still a great deal for a very capable device.", "verified": true, "helpfulness": "0/0", "author": "R. Buchmann"}, {"rating": 5.0, "review": "I love this little gadget. The ability to stream movies and YouTube wirelessly is awesome! If you ever want to stream your own movies from your PC to your TV use Plex.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Hernandez"}, {"rating": 4.0, "review": "Purchased this device a few weeks ago.  Goal was to find an economic (in time and $$)  way to wirelessly stream movies and websites from my laptop to my TV without purchasing a separate netbox computer and mess with all the ancillary issues of maintaining a separate computer.  Researched Roku, AppleTV, etc. but they lacked the ability to stream from my computer to the TV whatever I was looking at on the screen.The Chromecast met those goals.  I won't describe the full mechanics of how it works -- there are tons of product reviews/tech sites that explain that -- but I will say that this devices works really well and is dead easy to use.  It is small, quick to set up, doesn't require a technical degree to figure out and does what it says it will do. You control playback from your computer so no additional remotes to pile on the coffee table. It comes populated with Netflix and YouTube and a music channel (have not played with music channel) and one thing I REALLY like is that I can start a movie or video on my computer and send it over to the TV -- \"Cast\" it --- and the device then takes it from there -- streams the video from the network --- thus allowing me to continue surfing on the web while the movie is playing. It will even turn on your TV for you when you cast to it.  I can minimize the cast tab and continue to work on other browser tabs and even in different browsers.  The Chromecast requires that you use the Chrome browser for casting.  I am a IE user.  So I kick off whatever I'm watching in Chrome and then go back over to IE to surf and work.The movies and videos from Netflix and YouTube playback in HD.  If you are playing a video that is streaming directly from a website (embedded in the webpage) the playback will be in whatever quality that is on the webpage, and can be a bit choppy and get out of sync with video/audio.  I'm guessing this is b/c it is streaming from the website to your computer, then streaming to the Chromecast device instead of streaming directly to the Chromecast as with the native channels on the device.  However, if I stop and then start up the video again it seems to sync up and be fine.  I should also point out that I am using this on a DSL 3MB internet connection and have no issues with buffering, interrupted playback, pixilating, etc.on the Netflix/YouTube playback.  A faster internet speed might resolve the webpage issues.Wishes:  I would like more native channels on the device for PC.  Google announced a HuluPlus addition but seems to be for phones and pad devices .  They are promising more channels but have not seen much so far.  I am moving towards cutting the cable TV subscription entirely and have already reduced down to a minimal level for local channels.  And in that vein, I may revisit purchasing a Roku to compliment the Chromecast.Bottom line:  I really like this device.  And for a low startup cost -- $35 --- it was a good gamble to see how well it would work with my home set up and meet my goals.  Am looking forward to seeing how Google grows and adds to its capabilities.", "verified": true, "helpfulness": "1/1", "author": "S. Thompson"}]