[{"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Mark Flores"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "Clarissa"}, {"rating": 5.0, "review": "I get more use out of it then I thought. Easy setup and works great!!", "verified": true, "helpfulness": "0/0", "author": "KevinF63"}, {"rating": 4.0, "review": "This is a good product", "verified": true, "helpfulness": "0/0", "author": "Glenn Bryan"}, {"rating": 5.0, "review": "it's very good", "verified": true, "helpfulness": "0/0", "author": "darksius"}, {"rating": 3.0, "review": "Didnt understand the instructions.", "verified": true, "helpfulness": "0/1", "author": "Arturo D. Torres"}, {"rating": 5.0, "review": "very cool to stream stuff from your laptop.  i copy address links from my desktop and paste it to my webbrowser address bar to stream contact media center", "verified": true, "helpfulness": "0/0", "author": "Vu Vuong"}, {"rating": 5.0, "review": "Works wonders for streaming netflix, hulu, Pandora etc. Purchased two so far and I'm very pleased.", "verified": true, "helpfulness": "0/0", "author": "alfreida"}, {"rating": 4.0, "review": "I really like this little device. It's extremely convenient, and gives me the ability to watch just about anything from my phone, tablet, or computer on the TV. My only gripe is that it's a little glitchy with the mobile apps such as Netflix and Hulu Plus. Not sure if that's because of the development of the app itself or because of Chromecast or both. Either way, it's a little frustrating at times. I also wish it was compatible with Amazon Prime Video (however, you can stream it on your laptop onto the screen), but I understand why it's not and the rating isn't based on that.Overall, worth the price I think.", "verified": true, "helpfulness": "0/0", "author": "Kate B."}, {"rating": 3.0, "review": "returned for the Roku streaming stick. The Roku comes with a remote for easy access. No need to access through a cell phone, so anymore that comes over can stream with our remote.", "verified": true, "helpfulness": "0/0", "author": "Julia C."}]