[{"rating": 4.0, "review": "just as descibed", "verified": true, "helpfulness": "0/0", "author": "tammy troy"}, {"rating": 5.0, "review": "Arrived quickly and best price out there.  EVERY TV in our home as a Chromecast now and we LOVE them.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "With hundreds of channels to choose from on cable tv, I find I only use Chromecast to watch tv now. I want to watch what I want when I want and not depend on the crap that populates television these days. With this I could do without cable completely.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I'm currently using a Google Chromecast HDMI Streaming Media Player, Chromecast app (now with Cast Screen option) and a NETGEAR NeoTV Prime with Google TV Streaming Player GTV100 (2012 model) in my Living room. For my needs, they serve their purpose well.", "verified": true, "helpfulness": "0/0", "author": "S. Gabriel"}, {"rating": 1.0, "review": "I got this thinking I can stream to the TV other ways but getting this would make it a snap, I was wrong. I have PC's, Androids etc but I can't get this thing to work at all and I gave up. It's not broke it's just confusing, I want to stream video from my cell to the TV and can't make it happen.", "verified": true, "helpfulness": "0/1", "author": "Harry K. Link \"thirstyfox\""}, {"rating": 3.0, "review": "Works great when I use my phone.  When I try to use my computer or tablet it has a hard time streaming.  The streaming is a bit broken up when I use my computer.", "verified": true, "helpfulness": "0/0", "author": "Katie Ingle"}, {"rating": 5.0, "review": "Easy set up, great speed and picture.", "verified": true, "helpfulness": "0/0", "author": "Cat"}, {"rating": 1.0, "review": "I have had a Chromecast since April of this year, it was really as simple as plug and play and the added iOS support has been fantastic.That said, I decided to purchase another for a different tv and my experience has not been the same. I received one unit made in Nov '14 and it had the red light and never would function properly. I returned it (Amazon return was amazing of course) and received another unit made in Nov '14 and it also has the red light and will not function properly.This one star review is due to what must be a bad lot of units manufactured in Nov '14. That I received two of these dead units tells me that the odds must be good that several are not functional. Overall, I love the Chromecast that works but this is nuts and QA must be stepped up. I'm going without a second Chromecast for the time being.Don't jump to conclusions; I work in software, I have another Chromecast that works fine, I've used multiple tvs to test, I've used the power from the TV (marked usb), I've used the supplied wall socket adapter, and I've tried holding down the button to reset the unit -- NOTHING MAKES EITHER UNIT WORK. DOA!!", "verified": true, "helpfulness": "0/2", "author": "S. Reincke"}, {"rating": 5.0, "review": "I loved this product. I haven't had any wi-fi issues with it. I've had it for about a month so far. The only issue is that sometimes I have to unplug it and plug it back in because it starts playing really really quietly but there is a possibility that the product is not at fault.  The picture is great, the only time I have any issue with it is when my Netflix is giving me problems, once again that's my personal wi-fi problem not the product itself.  I live in the basement on the opposite side of the house from my router and have no problem maintaining my internet connection. I'm waiting till I have more money to buy more of these for the rest of the house.My only real complaint is that I wish the product was a little more user friendly. This is definitely not dummy-proof. You will need some of the help provided by them online but once you get the hang of it, you're good to go. Do not give this to your severely technologically challenged grandma.", "verified": false, "helpfulness": "0/0", "author": "Brooke"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "ARMANDO QUINTERO CRUZ"}]