[{"rating": 4.0, "review": "Youtube on my so-called Smart TV is very jumpy. I don't have and don't need any paid subscription like Netflix or Hulu plus, .... yet. It works as expected with Youtube. When i power it with the USB connection on a DVD player, it works most of time. One time, the device could not be found by my PC and laptop. I unplug it, let the hot device cool down, plugged it in an AC powered USB. It worked again.", "verified": true, "helpfulness": "0/0", "author": "H Lang"}, {"rating": 5.0, "review": "I love Chromecast.  I use this to stream netflix, youtube and movies from my phone and laptop.  It's extremely easy to install and has made watching movies more enjoyable.  Installation took about 10 minutes and I was casting within 5.  It's affordable and a great solution if you're looking to go wireless.", "verified": true, "helpfulness": "0/0", "author": "Anh"}, {"rating": 5.0, "review": "The setup of Chromecast is easy.It's easy to display videos on TV by this device especially to watch videos in youtube.", "verified": true, "helpfulness": "0/0", "author": "malin"}, {"rating": 5.0, "review": "Works very nicely. Setup was fairly easy and quick. Great buy for the money. You can't beat it. I use it with multiple devices", "verified": true, "helpfulness": "0/0", "author": "Hugh Davis"}, {"rating": 3.0, "review": "I didn't realize when I purchased this item that it did not work with all WiFi routers. Unfortunately I am unable to enable Upnp on my router because it is unavailable.  I was super excited about getting this and using right away and was really disappointed that it wasn't as easy to setup as indicated on the ads.  Check your WiFi router before purchasing this item so that you don't have to go through a bunch of useless troubleshooting like I did.", "verified": true, "helpfulness": "0/0", "author": "Supermom"}, {"rating": 3.0, "review": "I bought it thinking I could put anything on my tablet or phone on the TV, not so. Limited to apps on devise. Wouldn't recommend.", "verified": true, "helpfulness": "0/0", "author": "Old FIlm Watcher"}, {"rating": 5.0, "review": "This device is great to use to hook up to your TV. It defaults to 2.1 sound which can be pulled out with a audio switch which makes it very convenient to use on new and old TVs alike.", "verified": true, "helpfulness": "0/0", "author": "Spencer Penley"}, {"rating": 1.0, "review": "I received it as a gift and i wish i wouldnt have opened it.  I dont watch you tube regularly and dont subscribe to Netflix.  This is worthless.  I thought i would get to access my Prime videos and the other content purchased through amazon, nah.Only redeeming quality is its app for pandora, but i didn't need this product for that purpose.Silly product.", "verified": false, "helpfulness": "2/2", "author": "richard camacho"}, {"rating": 2.0, "review": "I got a a good deal for my Chromecast purchase. However, I am disappointed at its limited applications. I thought it could \"chromecast all websites and links\". But it DOES NOT! It requires Chromecast Extension to access other websites. Unfortunately it supports limited platforms for this feature and NOT iPad at this time. With iPad, I can only use Chromecast for Youtube and Netflix. Disappointingly, I have no need to subscribe Netflix. I give it 2 stars for the price.", "verified": true, "helpfulness": "0/0", "author": "R C"}, {"rating": 1.0, "review": "This is a glorifies screen saver for your TV.  It does not stream from any of my devices...  compatibility issues from my 3-year old mac book pro, and nothing from my iPhone 4S.  Nothing of this variety, that costs $35 should take more than an hour of time for an experienced technology user. There are virtually no instructions and the top level of the website is of no help...  unless you consider 'call Cisco' for router compatibility issues an answer.", "verified": true, "helpfulness": "2/4", "author": "R. Adams"}]