[{"rating": 5.0, "review": "Item packaged well and shipped promptly. Item undamaged and as described.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "There are many reviews on the Chromecast, so I have little hope that many people will read mine.This device is NOT what I expected. I had misread (I suppose) the literature on this, so I made the wrong assumption that it adds smart apps to any TV with an HDMI connection.In fact, this turns one HDMI port of a TV (or monitor) into a DUPLICATE SCREEN of a smartphone or computer. In fact, it's not even quite that--it duplicates the screen for certain apps or a single browser tab.As far as that goes, it seems to do very well. I did, however, notice that both my Android and my iPhone slowed down with the Chromecast app installed.On the PC, you can stream one tab while using other tabs or programs. That was a pleasant surprise.The big negative is that you can't use it without tying up a device of some kind. That really didn't take care of my initial need.I'll probably keep it. The cost is low, and I'm not sure it's worth the trouble of returning it.", "verified": true, "helpfulness": "0/0", "author": "Phil Ruffin"}, {"rating": 4.0, "review": "Works well opens many possibilities.  Would get 5 if worked consistently well sometimes kicks you off.", "verified": true, "helpfulness": "0/0", "author": "Am"}, {"rating": 2.0, "review": "These are pretty cool when they work.  Casting Plex will sometimes get audio without the video and will cause me to have to exit Plex from my phone, clear it from memory, reboot the Chromecast (sometimes factory reset), wait for it to become available again and then try everything from start again.  Casting from Netflix works pretty well with an occasional glitch.  Finally decided last night after months of aggravation to order an Amazon Fire TV to test.  We use Roku 3 without any issues, sometimes requires an occasional reboot but not nearly as often as we have to fix the Chromecast.  I like having a different set-top box per TV for stability and simplicity, even though having a remote is not what most call \"simple\" it gives me the peace of mind that Chromecast cannot give me.", "verified": true, "helpfulness": "1/1", "author": "kevro"}, {"rating": 4.0, "review": "Good Product", "verified": true, "helpfulness": "0/0", "author": "Deepak Dhanya"}, {"rating": 5.0, "review": "I love this product. Works great!", "verified": true, "helpfulness": "0/0", "author": "Gerry Cramer"}, {"rating": 5.0, "review": "Friend got this for me, since I don't have cable, I'm really gald he did. Its been such an improvement to the livingroom tv.", "verified": false, "helpfulness": "1/1", "author": "JJ Dixon"}, {"rating": 4.0, "review": "Works just like its suppose to. Although it lags sometime but not sure if it would be the internet/computer or chromecast.", "verified": true, "helpfulness": "0/0", "author": "Pratik Patel"}, {"rating": 5.0, "review": "What a fun gadget!  I'm only just discovering all the things it can do.  And more is promised for the future!I got one for myself and two for friends, and they love theirs too.", "verified": true, "helpfulness": "0/0", "author": "Richard Ferch"}, {"rating": 5.0, "review": "we have 3 in our house they are amazing", "verified": true, "helpfulness": "0/0", "author": "Nicole"}]