[{"rating": 4.0, "review": "This is a really cool and convenient device. The only issue I have is that I wish more apps would work with it. I do use it with Pandora, Netflix and HBO Go. While I have the first two apps on my TV, they work much better on my iPhone. Plus I can bring my iPhone into the backyard and control the music on my outdoor speakers.", "verified": true, "helpfulness": "2/2", "author": "Urban Cyclist"}, {"rating": 4.0, "review": "Pretty much only offers netflix and YouTube . Would be a 5 if it offered a little more as far as function. Google, you are better than this!", "verified": true, "helpfulness": "0/0", "author": "Justin Blews"}, {"rating": 5.0, "review": "I was looking at Apple TV as an option for watching Netflix in my bedroom, where I have a tv that's about three years old and not a Smart TV. This was a much more affordable option and so far works perfectly for what I use it for! I know it doesn't have as much capability as Apple TV does but I just wanted it for Netflix and Amazon Instant Video. My boyfriend was able to set it up easily. Great product, does exactly what I needed it to do!", "verified": true, "helpfulness": "0/0", "author": "Jenna Conan"}, {"rating": 4.0, "review": "It works in Iceland.  Very well.  Just waiting for the mirroring support to happen :)  When that happens, I'm in heaven :)", "verified": true, "helpfulness": "0/0", "author": "Hilmar Fridjonsson"}, {"rating": 1.0, "review": "I am not happy with this product I thought it would connect to my Netflix's without the use of my computer.", "verified": true, "helpfulness": "0/1", "author": "Dennis rothwell"}, {"rating": 4.0, "review": "I love the chromecast for what it's able to. However, it doesn't always work the best. For instance casting a tab that you are playing local media on is stuttery. Also, I bought a movie through youtube, it didn't work through chromecast unlike the flawless playback I get with normal youtube videos. But everything else it says it does out of the box works great!", "verified": true, "helpfulness": "0/0", "author": "IzzuThug"}, {"rating": 5.0, "review": "Received my new Google Chromecast quickly; it was packaged well and in excellent condition when it got to me.  It was easy to install and is working great!", "verified": true, "helpfulness": "0/0", "author": "dct"}, {"rating": 3.0, "review": "The Google Chromecast is a great idea but it's got a lot of execution problems. It's laggy and often times doesn't work. It uses a metric shittonne of bandwidth which will slow down the internet for everyone else in your house. My roommate owns an apple airplay which has most of the same functionality except it reliably works. I wouldn't recommend this product. Maybe some day Google will update it and fix the bugs but for nor this feels like a product that's still in beta testing.", "verified": true, "helpfulness": "0/1", "author": "Dante Marone"}, {"rating": 2.0, "review": "Though I am a fan of Google this product did not meet expectations. Makes noise while streaming and the cord is an eye sore, much longer than depicted online hanging off the side of your tv. I am sure you could spend additional money and buy the one they have pictured pictured somewhere. Worked decent for Hulu and Netflix but cannot stream Amazon Prime w/o a back channel as it states in other reviews.  Just not for me unfortunately, I like my bdr Roku better.", "verified": true, "helpfulness": "0/1", "author": "K. Barbour \"Kelly B.\""}, {"rating": 4.0, "review": "But not versatile enough!  I'm hoping for more support for this device.You Tube and Netflix work well,  Setup is easy. Price point is GREAT, however because it works only as well as the apps supported by it, there is very little you can do with it.Casting a file from within Google Chrome is iffy.  I found that I had to reduce my computer screen resolution to see the full picture on my TV.Bring on more apps, Google.", "verified": true, "helpfulness": "0/0", "author": "Alan Boase"}]