[{"rating": 5.0, "review": "Only gripe is there is no on/off switch but you can make it go to sleep thru the setup menu.  Otherwise, it works great.  And much easier to use than Google TV or Chrome-cast.", "verified": true, "helpfulness": "0/0", "author": "DG"}, {"rating": 5.0, "review": "Bye, bye cable bill.", "verified": true, "helpfulness": "0/0", "author": "mike black"}, {"rating": 1.0, "review": "with out paying $39.95 you get nothing usable", "verified": true, "helpfulness": "0/11", "author": "jon waterhouse"}, {"rating": 5.0, "review": "Does all as advertised.....for those internet connected to the world, all that is needed for home theater needs.  Can not wait until  upgrade to new Class  4  [4000 lines per inch] standard and compatible content library.", "verified": true, "helpfulness": "0/0", "author": "JAMc"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "anne garcia"}, {"rating": 3.0, "review": "Great hardware for the price - very nice for use with Amazon services BUT the software get's in the way and navigation is terrible if you want to sideload anything. Launching side loaded apps is a several step process. No way to customize or add apps to launch from the home screen, they removed Kodi from the app store for pretty lame reasons. No use of Google Play so you can kiss any apps you purchased from there goodbye on this device or re-purchase them if available in amazons app store. No NHL game center app.I really want to love this thing and pick up a couple more but the things I list, at least for me are pretty much a deal breaker.", "verified": true, "helpfulness": "0/0", "author": "talex \"talex\""}, {"rating": 5.0, "review": "excellent value. simple to use", "verified": true, "helpfulness": "0/0", "author": "jerry stalcup"}, {"rating": 5.0, "review": "Awesome! Easy to set up... just great! love it.", "verified": true, "helpfulness": "0/0", "author": "Barbara Thurber"}, {"rating": 5.0, "review": "Hello, I have to admit that I am one of those who is connected to the apple realm of movies and TV shows, I have so many movies and TV shows that I bought, which is why I use the Apple TV.I have been one of those people who waits and waits for a new Apple TV and this past month finally gave up waiting.I saw a commercial for Sling TV, if you order three months worth of it you get the Fire TV for $50, so I figured let me give it a try, what do I have to loose.I won't go into full detail as many others have done, and I don't use it to play games, so I will speak on what I have noticed in comparison to the Apple TV.1) it's so much faster than the Apple TV in every way, even waking up and sleeping this thing beats out the ATV.2) Netflix is so much faster and the menu for Netflix is so much better than the one that is on the ATV.3) Amazon prime is amazing and supper fast when searching for a movie or actor when using the voice option.4) After many hours of comparing the apple tv to the fire tv when it comes to video quality, the fire tv beats it hands down. Clearer and brighter, there is no lag on Netflix at all... much better picture quality I assure you...So if you care about picture quality this is the option compared to the apple tv, if you care about how fast amazon prime and Netflix loads this is for you.", "verified": true, "helpfulness": "1/1", "author": "Enrique Vargas \"E. Vargas\""}, {"rating": 5.0, "review": "Love It!!!", "verified": true, "helpfulness": "0/0", "author": "Tanya McDougald"}]