[{"rating": 1.0, "review": "I usually like Google products but this particular item is awful.  I found it complicated to setup and I actually never got it to work correctly.  Even if I did get it to work, the fact you have to tie up a tablet or your phone to control what you watch is a major pain that I don't think I could have adjusted to.  My advice is to spend the extra and get an Roku.", "verified": true, "helpfulness": "1/1", "author": "JC"}, {"rating": 5.0, "review": "Brand new condition & packing was good. Everyone knows what chrome does if not go through various videos on youtube. Its similar to apple tv but one thing that could have be better is the google chrome web pages option for tv. You can only see webpage on chrome cast if you access it from a laptop. Tablet wont support this function. Sad .. Cheers", "verified": true, "helpfulness": "0/0", "author": "shar"}, {"rating": 5.0, "review": "The Google Chromecast made much more sense for my purposes than a smart TV, at a much lower price point.  I bought the Chromecast only as a Netflix interface, but am slowly finding out how much more it will do.  My son is in college and will be using the Chromecast to watch ESPN.", "verified": true, "helpfulness": "1/1", "author": "Jeffrey F. Mcdaniel"}, {"rating": 5.0, "review": "Very good!", "verified": true, "helpfulness": "0/1", "author": "Ronei Elias Quedi"}, {"rating": 2.0, "review": "Spend the $10 more and buy a roku. I have both and this thing is annoying and doesn't have all the functionality a roku has. Regret buying big time.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A great little streaming device for an almost nothing price.", "verified": true, "helpfulness": "0/0", "author": "Dwayne A. Smoot \"And again!\""}, {"rating": 4.0, "review": "A cool addition to the TV", "verified": false, "helpfulness": "0/0", "author": "John A. Fiske"}, {"rating": 5.0, "review": "you wont find any product with the same simplicity, reliability and stability as the chromecastworth every penny :D", "verified": true, "helpfulness": "0/0", "author": "Yazan"}, {"rating": 5.0, "review": "After reading some negative reviews I was so afraid that it will be the same for me but I'm glad I bought it. We use a very old laptop running on Vista which is used mainly for streaming videos to our TV. FIrst try for setup with this old laptop failed so we used our iphone 5 and it was a success!! Once setup, we have no problem going back to our old laptop to search for the Chromecast in our network. Now we don't have to be limited to hard HDMI wire connecting to our laptop but use this Chromecast all the time.", "verified": true, "helpfulness": "0/0", "author": "mR2"}, {"rating": 5.0, "review": "Great buy, mostly use just for screen mirroring and Plex which both work perfectly. Runs a little hot, but not a big deal. For $30, an easy buy.", "verified": false, "helpfulness": "0/0", "author": "Debarshi Majumdar"}]