[{"rating": 5.0, "review": "Use it every day", "verified": true, "helpfulness": "0/0", "author": "dave vang"}, {"rating": 5.0, "review": "Nothing to complain about it was free :)", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 4.0, "review": "I love the convenience and responsiveness of this streaming dongle.  I love how it works with any of my smartphones or tablets.  But therein lies the rub, streaming from PC or laptop is a pain in the arse.  You can stream from the chrome browser, but not from any other program 'officially'.  Streaming from the browser also limits you to the formats that the browser supports, and doesn't enable transcoding like Plex does.  And yes, you can stream from Plex, but you still need to control it from a tablet or smartphone.  There is also spotty compatibility using the Chromecast app to cast your screen (works on Galaxy S5, but not on the LG tablet),My only other complaint is volume.  There seems to be a bug with certain apps that if you adjust the volume down using that app, Chromecast takes that new value as the maximum volume in another app.Things I'd like to see:Support for 5Ghz wifi band.Manage from PC/Laptop/Media Server - change settings, adjust audio balance, volume, and profile.Streaming support enabled to allow PC applications such as VLC or Media Player Classic to output to the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Jessica Mell-Weiner"}, {"rating": 4.0, "review": "love this thing. wish it was faster to connect to my phone through the TV and all. But awesome for what it does that I use it for. which is just YouTube music vides to show to buddys of mine.", "verified": false, "helpfulness": "0/1", "author": "Alex"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "dannyb"}, {"rating": 5.0, "review": "Love this device, still haven't figured out all of its features but have currently used it with my ipad and netflix and its the best if you dont have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "Jose Felipe Osorio Santos"}, {"rating": 5.0, "review": "This is very easy to use. I bought a second one for another TV.", "verified": true, "helpfulness": "0/0", "author": "Y J \"Jin Ying\""}, {"rating": 4.0, "review": "I like it.", "verified": true, "helpfulness": "1/1", "author": "John Teixido"}, {"rating": 4.0, "review": "Bought it as a gift for Dad.  He likes it.", "verified": true, "helpfulness": "0/0", "author": "Fernando"}, {"rating": 1.0, "review": "I bought one 2 months ago and am incredibly dissatisfied with this product. I typically use this to watch media (netflix, hulu, hbogo, etc) and the chromechast 1) takes forever to load a video 2) completely sucks at controlling the video once it is playing and 3) makes you recast every single time. I much prefer my amazon fire stick and have bought a second one for my other tv. If you are buying this to watch streaming shoes AVOID IT.", "verified": true, "helpfulness": "0/1", "author": "Aaron Hernandez"}]