[{"rating": 5.0, "review": "Chromecast will eventually be awesome, assuming the right developers sign up and Google allows open development. I am really waiting for the Plex support- if this little thing can utilize my plex server, it will be a 35 dollar media center solution for all of my TVs.As of now, however, the only thing it does is play youtube and netflix videos- which is pretty lame considering the plethera of ways to watch youtube and netflix. Most TVs and BluRay players do this already. yes, you can stream a tab directly from chrome onto your TV but what does that do? Not much. it doesn't work well to stream non youtube video. The best use so far seems to stream pandora on my TV so that I can hear it thorugh the house and can control it with my portable device.All in all, Google has shot themselves in the foot... again. They released this thing before it had any real functionality and unfortunately, the hype about it will probably die before it gets off the ground- unless they work very quickly.UPDATE 12/10/2013Chromecast just added a whole slew of apps, including Plex! Yeah, it is official. If you have a plex server set up on your desktop PC, and you have a smart phone... this is a 35 dollar HTPC solution. FANTASTIC! A must-own! Chromecast just knocked Apple TV out of business!", "verified": true, "helpfulness": "1/1", "author": "Neg8iveZero"}, {"rating": 3.0, "review": "I was under the belief that I could use Amazon Prime with this devise since it was made by Google. I was wrong. It works with Google Play which charges for everything. If I had Netflicks, I might be a bit happier.It is now a glorified You Tude player unless I get Net Flicks.", "verified": true, "helpfulness": "0/1", "author": "McAfee2000"}, {"rating": 4.0, "review": "Works like a charm. Really easy to set up and configure with WLAN. However, at time the audio wont stream, so I have had to disconnect and connect again (might be my wifi??).Other than that, I am really pleased with the product.", "verified": true, "helpfulness": "0/0", "author": "Jose R. Suarez"}, {"rating": 5.0, "review": "Very easy install and ready to use right out of the box.  I can't wait for additional apps to start showing up.", "verified": true, "helpfulness": "0/0", "author": "Tamara"}, {"rating": 5.0, "review": "This thing has revolutionized the way we watch TV. Though my computer can be directly connected to the TV, this allows me to use my computer while we watch Netflix. We use my Nexus 7 and our iPhones to control it and it functions incredibly well. It will be even better as they add functionality. We don't even have cable TV because this is all we need.", "verified": true, "helpfulness": "0/1", "author": "Nat Natarajan"}, {"rating": 5.0, "review": "No sure what else to write about this.  It's an amazing device, especially considering the price.I'm very happy with mine.", "verified": true, "helpfulness": "0/1", "author": "Peter Luong"}, {"rating": 3.0, "review": "I have a nexus 10 and casting YouTube from it works great!  However, the Chrome browser on my nexus doesn't support casting.  That's kind of disappointing.  You'd think if they advertise \"can cast from Chrome\", they'd cover all their bases... I am looking forward to the Chrome upgrade for tablets", "verified": true, "helpfulness": "1/1", "author": "Yanan M."}, {"rating": 2.0, "review": "I guess I should have payed closer attention to the capabilites of this little dongle when I bought it....My HOPE was that anything and everthing on my cellphone, an HTC One, ....INCLUDING mirroring of the phone, would whiz wirelessy thru my home wi-fi network to my big, beautiful 50\" plasma TV screen. As of today, the Chromecast cannot do this. Perhaps it's coming in the near future, let's hope.As it is, it does a decent job of streaming the lone 4 apps that it advertises on the box that will stream to your TV.... netflix and youtube worked well, although I'm not entirely sold the audio quality and video quality is quite on par with my blu-ray player..., it is also  supposed to stream googleplay music, but I think the music has to reside in the cloud , like a google account or something....This is a bummer, as I haven't fully jumped into the move to the cloud as of yet....so a big chunck of my 15 gigabytes of uncompressed music files are on my cellphone, and the Chromecast will not stream them from phone to TV.... nor all my personal pics, vidoes and assorted other media.This inability to stream local media..on your phone, on your pc (without using the Chrome browser + extentions,etc) is by far such a large drawback that I'm actually thinking of returning it, and perhaps buy it at a later time when it does have the functionality, or, keep it since it is so inexpensive, and try the HTC Media Hub, which DOES wirelessly send all your phone media and even mirror exactly what you see on your phone to the TV , with no hoops to jump through or caveats.These days, most people with a TV new enough to include HDMI ports, very likely ALREADY have the means to stream Netflix and Youtube and other web content with the TV's built in internet apps software.....what would REALLY put the Chromecast over the top for me, is 100% seamless streaming of anything and everything on my HTC One mobile phone, including mirroring I mentioned earlier....Maybe that day is not too far down the road , the way technology is going.........", "verified": false, "helpfulness": "1/1", "author": "Marc Harris"}, {"rating": 5.0, "review": "I love my Chrome Cast.  Anything I can watch on my computer, tablet, smartphone- can be sent to the TV for viewing on a bigger screen.  I've had mine for a few months now and watch everything for free.  Some images have better quality than others but I've found that most of the companies who transmit via the internet will be adding the chrome cast option for their signals- just like Red Box, Hulu, You Tube, etc.  The setup was easy as plugging the 'thingamajig' into the tv and clicking a few links on the computer and it has worked tirelessly for the past few months.  I watch all the NFL games, Baseball Games, etc for free! As well as the network stations and anything else I can find online.  The Chrome Cast is a big hit here at home and worth the $$$ at twice the cost.", "verified": false, "helpfulness": "0/1", "author": "Scotts Contracting, St Louis Renewable Energy"}, {"rating": 4.0, "review": "However, only works with YouTube and Netflix.HD streaming works perfectly.Without an Netflix account, you only left with youtube.", "verified": true, "helpfulness": "1/1", "author": "BO YANG"}]