[{"rating": 5.0, "review": "Very simple to use with wifi.  Very cheap and useful gift for any one with smartphone.  I've. Bought three already and will buy atleast one more.", "verified": true, "helpfulness": "0/0", "author": "jihad Muhammad"}, {"rating": 5.0, "review": "I love the speed and flexibility chromecast delivers! If it's YouTube, Netflix, Hulu, you don't have to watch it on your phone or tablet. Chromecast streams it on your tv! It's great if you're having people over- everyone can take turns picking songs/videos.", "verified": true, "helpfulness": "0/0", "author": "Sara"}, {"rating": 2.0, "review": "This unit will not allow the desktop to be displayed on the TV.  It only supports a limited (i.e. owned by Google or Paid service provider programs)  number of video providers content to be displayed.  Damn near useless.", "verified": true, "helpfulness": "2/3", "author": "Orbit"}, {"rating": 5.0, "review": "I love this Chromecast so much! Bought it as an option to replace using my 360 since my xbox live subscription was up and boy am I glad I did this. Streams directly to the device from what I tell it to on my tablet and phone(Galaxy 10.1 & Razr HD Maxx). Amazing quality, streams at max available so 1080P!Best thing is they keep adding applications to be used with this device and knowing Google it will keep expanding and improving. Best $35 spent!", "verified": true, "helpfulness": "1/1", "author": "Paul E."}, {"rating": 4.0, "review": "Works with netflix, hbo, Hulu and you tube. Would love it if it would work with show time, cinimax and others.", "verified": true, "helpfulness": "0/0", "author": "Laurianne Demers \"truth seaker\""}, {"rating": 3.0, "review": "I love how easy it is to use, but I thought I could 'chromecast' everything from my iphone's browser, not just youtube, Netflix and hulu.", "verified": true, "helpfulness": "0/0", "author": "Adrian G. \"AlphaGem\""}, {"rating": 5.0, "review": "it works with chrome-cast extension only! of course I meant desktop PC.It can't stream my own videos or photos, it is a disappointment. But itdoes stream online videos flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Goodie"}, {"rating": 2.0, "review": "I tried getting it to work with Netflix for  1 1/2.  I then emailed Google support and they gave me things to try to I had done them all already.. several times.  I then called and they were quick to pick up and walk me through some things but then they told me that since this is still in BETA they know there are some bugs in it getting to work with Netflix.  WHY THEY THAT ISN'T ADVERTISED OR TOLD TO ME PREVIOUSLY IS BEYOND ME.  Thankfully, Amazon is easy to return to so, back it went.  I'll probably buy it again but I'm phoning Google first to make sure before.", "verified": true, "helpfulness": "0/0", "author": "CareyV"}, {"rating": 4.0, "review": "Great price for a wireless streaming device albeit limited to Youtube and Netflix through Google Chrome - wish it would support other streaming video content from other sites on the web - perhaps in a future update?  Packaging design is quite nice with 1-2-3 instructional text and visual drawings on one flap of the box.  The web page for setup is fairly straightforward - had a little hiccup with the wifi configuration as the sequence for setup not quite clear, but overcame it and once connected everything runs smooth.  We have it powered via USB cable connection next to the HDMI connection on the side of our LG plasma television.  Really nice quality video.", "verified": true, "helpfulness": "0/0", "author": "B. Chin"}, {"rating": 1.0, "review": "My in-laws asked me to set theirs up. After about 4 hours of troubleshooting and reading forum posts online I was able to determine my router settings had to be changed. Instead of using the default DNS settings I had to change it to \"automatic\". Then it still didn't work so I rebooted and re-ran the setup and was finally able to connect. NOW it appears that I cannot view Amazon instant video on it, and in fact it appears the only apps it works with are Youtube and Netflix which I can't believe! If it works with anything else I cant figure out how. There is virtually nothing in the way of support.Update:My dad got one. He is one of these people with nothing but Apple, including routers. After spending a total of three different days of about 4 hours each at my Dad's house trying to make Chromecast work with his Apple Airport routers (Timecapsule and Airport Express) I finally gave up (Chromecast can connect to the network but can't access the internet.) I also spent several hours outside of that reading through forums and Apple support. None of the solutions others found worked for me and the Apple routers are incredibly difficult to adjust settings on. Bottom line - If you have an Apple router, unless you are an Apple techy type - you may want to avoid this thing and just buy Apple TV.I brought my dad's home and will mess with it on my set. What's most annoying is that I can't watch my Amazon instant video with it from the iPad. Perhaps it will work from a Chrome browser tab.Update: so over a year has passed since I plugged this into my TV and virtually nothing has improved. The number of apps that support this is ridiculously small. Still can't watch Amazon, still can't stream from Chrome on iPad. Am thinking about getting a Roku. Chromecast is good for netflix and Youtube. If you want to use it for anything else, better make sure it will run on your device first.", "verified": true, "helpfulness": "0/1", "author": "Tranzition Zoner"}]