[{"rating": 3.0, "review": "Wish it worked with amazon prime :(", "verified": true, "helpfulness": "0/2", "author": "Daddyrosie"}, {"rating": 5.0, "review": "The Google Chromecast does all it is meant to do flawlessly. I bought this for a birthday gift for a friend who was thinking of purchasing a Roku so she could watch Netflix in her bedroom without having to watch it on a laptop. She and her husband have lamented to me numerous times how much they love this device. They use their smartphones to choose the movie and then send it over to the device to play on the tv. I have a Roku myself, but with the price difference between the two I would choose the Chromecast if I ever needed another streaming device. It makes no sense to pay 2-3 times more for the same functionality.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 1.0, "review": "It only connects a small percentage of the time I try it.  Even then it requires at least four attempts.  I change nothing on my computer so why does it connect some times but not most times.  Mostly it's a big PITA.  I generally just give up and go to a HDMI extension cable to my computer which is dead simple and foolproof.  The only downside to that is the cable strung over the floor.", "verified": false, "helpfulness": "1/1", "author": "B. Eleveld"}, {"rating": 5.0, "review": "its amazing", "verified": true, "helpfulness": "0/0", "author": "Nashaat"}, {"rating": 5.0, "review": "No problems setting up, worked the first time and provides a good quality picture using You Tube or Netflix.  So far have not tried with other services.  Use your Android tablet/Phone or standard PC with Chrome browser to easily get this running on your home Wi-Fi network.  Note not likely to work on hotel or other public Wi-Fi spots if a login via browser on the hotspot is needed.", "verified": true, "helpfulness": "0/0", "author": "IPPete \"IPPete\""}, {"rating": 1.0, "review": "Can't hook up to a lot of modems....no toll free support. Google never answered", "verified": false, "helpfulness": "0/0", "author": "cookerman"}, {"rating": 5.0, "review": "Best technology you can buy for $35.  It'll crash and freeze sometimes, but it's 35$..  Its the only thing I use to watch TV", "verified": true, "helpfulness": "0/0", "author": "Damon Kuenzler"}, {"rating": 5.0, "review": "I've got three of them and just love them.Netflix is much easier to use when you have a tablet and can queue up your video request over to your chromecast player.YouTube is equally much easier to use than any \"smart\" tv with their bad hunt and peck typing of subject matter.More and more apps are able to stream to this device.", "verified": true, "helpfulness": "0/0", "author": "James P Potter"}, {"rating": 5.0, "review": "This is an amazing product.  It works like a charm.  There are numerous apps you can use to stream local files to the device.  I can use my smartphone as a remote!We had a smartTV and stopped using the functions because the chromecast is better.  Really.  When we bought a new TV, we opted for a 'dumb' TV because we knew we could trust ChromeCast to do everything we wanted.  And did I mention I can use my smartphone as a remote? It's the best.We did have some initial connectivity issues, however those were resolved by simply restarting the router.", "verified": false, "helpfulness": "0/0", "author": "K. Karpenko \"Cynic\""}, {"rating": 1.0, "review": "if you're getting this device in order to stream tv shows from third party websites (so, not netflix or youtube) then look elsewhere. First, using the page streaming (sending the entire webpage to the tv) is slow and the video is stuttery and sound quality is crappy. On the flipside, streaming youtube and netflix was 100% okay. Then, trying to find third party chrome plugins that could cast flash or mp4 content from websites to your tv directly (versus casting the entire page) proved fruitless. There was one plugin that seemed promising but their cast feature is not yet available. I have no need for another netflix/youtube device, and the quality was not there for the features i wanted. So I returned it. A 20 foot long HDMI cable would have been a better purchase.", "verified": true, "helpfulness": "1/1", "author": "trader"}]