[{"rating": 2.0, "review": "It's ok it freezes a lot but free trial was nice.", "verified": true, "helpfulness": "3/5", "author": "Anthony J. Langford"}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "1/1", "author": "ims"}, {"rating": 5.0, "review": "This review is for those folks that want the Fire TV (FTV) to do more than what it does today.  Namely run XMBC and play media off of a network drive.  Yes, the FTV can do this and with only a small amount of effort!It really ended up being no contest between the FTV and the Apple TV/Roku.  While those devices are great for what they do (ATV for the Apple ecosystem, Roku for steaming everything else), their specs for playback of media and performance of the UI were nowhere close the the FTV.  Plus on the FTV, you can SIDELOAD apps.  This means you can install android based apps that are not on the Amazon appstore!So first on my list was getting XMBC installed.  If you haven't checked it out before, XMBC is an incredible home media management application which will pretty much play any type of files.  I prefer MKV files, but this will do just about anything else.  Check out the wiki for XMBC plus the page for installation on FTV.I'll say the hardest part of getting XMBC to work was actually getting the Google Android Debug Bridge app installed (and Java), and that's really easy.  With ADB installed and debugging turned on on the FTV, you're now able to load apps to the box with a couple of simple commands.The XMBC wiki is helpful for telling you how to do certain things, but it's not perfect.  Here's a brief overview, but some simple google searches will get you the rest of the way:1. Download and install Oracle’s Java development kit2. Download and install Google ADB3. Download whatever app APK file you want (for example xbmc-13.1-Gotham-armeabi-v7a.apk) to install4. Download the Llama APK (this is a snazzy app that lets you run programs as other programs, more on this below)5. Fire up your command terminal6. Connect to your FTV using ADB (eg. adb connect 10.1.1.1 <--- your FTV IP goes there)7. Enter adb install (file name)  (for example xbmc-13.1-Gotham-armeabi-v7a.apk)8. On the FTV install a throwaway app like Classic TV or Flixster9. Run Llama on the FTV to run XMBC everytime you start one of those throwaway appsRead up on how to do that in more detail on the wiki, but essentially those are the steps.I'm running XMBC and Crunchyroll, both of which are not on the Amazon appstore.  The experience is great, sound and picture quality is awesome, and best of all, all of the default FTV stuff works as you didn't have to muck with rooting the box or whatnot.To sum up, FTV rules.  I love XMBC for home network media streaming.  And anyone can do this with a bit of patience.  Enjoy!", "verified": true, "helpfulness": "3/3", "author": "MG"}, {"rating": 1.0, "review": "This product is ridiculous; a pointless hunk of electronic garble.  I love Amazon and have been a patron for AGES.  However, I have never been more disappointed in something than the day this little box arrived and was fired up for the first time.  Here's the thing, if you have a television/satellite subscription of any kind, a gaming system of any kind, and an internet service package...this box is pointless.There is nothing this box can do for us.  Perhaps it would be useful in delivering some TV if we had none, but it still doesn't make since for what you have to pay each time you view something.  It is cheaper to just have a NetFlix subscription, really.  And that's what we've had, along with internet service, during a 5 year span of absolutely no television subscription and we've not been deprived.  And...if you have game systems, you can browse the net with them, which we do.  You can't do that with this product.  Why?  Just, why?The cost was a real issue for me.  You have to buy entire seasons of TV shows at once; there's no option to just get an episode here and there.  The seasons are crazy prices, like $40-something per, if not more!  They keep talking about a few freebie things on there, but I swear I didn't find one thing that was free.  My husband said it's there, but it's free for a reason:  it's a bunch of crap that nobody would pay for anyway.  And getting a Prime subscription will not help you if you get the student version, which I think bites.  Frankly, that is another totally useless service, but that is another review.", "verified": true, "helpfulness": "7/19", "author": "Bethanie B Ludlum"}, {"rating": 1.0, "review": "The plex app doesn't work it plays choppy and no sound half the time... I know it's not the server because i have a samsung smart tv with the  plex app and a roku 3 that play the same exact movie just fine.... Plus my Server is over kill  amd 8 core cpu and 32gig of ram and dual nic's  with the asus 1900 ac router wired.....  not only and I am life time subscription to plex I had to pay for this app 4.99 and it doesn't work... main reason I purchased this was it had 2 gig memory for video but that doesn't seem to work.... hope they will refund my money....", "verified": true, "helpfulness": "7/9", "author": "William"}, {"rating": 4.0, "review": "We moved our PlayStation yet still wanted access to Netflixs and Amazon Prime from our main television and this unit was nice and small - you barely even see it.  My husband loves that it listens to him but I am not big on talking to household appliances so I find it works just as well for me without that feature.  The only issue I have is not with the unit so much as our slow internet service.  Please Google come to Portland, Oregon so I can enjoy this item during times that the neighborhood bandwidth is dragged down by everyone trying to get their digital fixes.", "verified": true, "helpfulness": "3/3", "author": "Di"}, {"rating": 3.0, "review": "It's ok. It really doesn't have a lot of movies that are prime. I'm 33 my daughter is 11 we get disappointed a lot. There's so many movies we want to watch that are old from the 80s 90s but they aren't free and they really should be.", "verified": true, "helpfulness": "4/6", "author": "Jamie"}, {"rating": 3.0, "review": "Nice interface. However streaming apps will stop working at times. I have had to reset to factory defaults twice now. Netflix just stopped working one day. It still doesnt work.", "verified": true, "helpfulness": "6/6", "author": "red-door"}, {"rating": 1.0, "review": "Just buy a Roku!!! Our Amazon tv has been nothing but trouble since we got it. Between error code 13s every other day and an audio search that doesn't work, it is a total pos and Amazon customer service is useless. Worst purchase ever!!!!!!", "verified": true, "helpfulness": "7/11", "author": "Shadra B \"Shadra\""}, {"rating": 3.0, "review": "I only received a couple of days ago, so this is an initial review.PROS: had a reduced price coupon, easy to set upCONS: voice input only works to sell amazon content, not much else (not netflix), control is very limited when playing even simple games like card gamesI will update once I have more experience.", "verified": true, "helpfulness": "2/3", "author": "B. KURTZ"}]