[{"rating": 2.0, "review": "My Fire TV arrived today and I was anxious to set it up.  We have a very slow 1.5 Mb DSL connection here without much hope for improvement in the near future.  We have multiple ways of streaming Amazon Instant Video and other streaming services through a Smart TV, Xbox One, iPad, etc.  I purchased the Fire TV in hopes that we'd see less buffering (or at least no worse).  Well, I have to say that we've never experienced as much buffering as we did today with the Fire.  Just to be sure there was nothing going on with our ISP, I ran AIV on our Xbox and viewed the same show with zero buffering through an entire hour.  I went back to the Fire and the same show buffered every minute or so.  Both systems are wired to the same router.  I'll update this review if I figure anything out so that it will help others.  For now, if you're looking for better performance with less buffering, don't go the Amazon Fire TV route.", "verified": true, "helpfulness": "3/4", "author": "Esche Family"}, {"rating": 5.0, "review": "Totally love this!  Very easy to use.  Voice search is excellent.  Remote is simple and responsive. Small, but not too small.  Many many apps available.  Prime account makes all of this even better.  If you have an audio / video collection then be sure and get Plex and the Fire TV is unstoppable.", "verified": true, "helpfulness": "0/1", "author": "JL"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "andrew english"}, {"rating": 5.0, "review": "Very easy to use.  The voice control feature is outstanding.  It adds a new entertainment dimension for our family.", "verified": true, "helpfulness": "0/0", "author": "Ross L. Bradie"}, {"rating": 5.0, "review": "Dude. This thing is amazing. Everyone should have one.", "verified": true, "helpfulness": "0/0", "author": "Joshua Karalunas"}, {"rating": 4.0, "review": "Still learning how to use it. I am happy", "verified": true, "helpfulness": "0/0", "author": "karen Watters"}, {"rating": 5.0, "review": "We love it,", "verified": true, "helpfulness": "0/0", "author": "Christine Matson"}, {"rating": 5.0, "review": "Very good", "verified": true, "helpfulness": "0/0", "author": "ali"}, {"rating": 1.0, "review": "Don't waste your money on this if you have DSL. I live in a rural area and the only choice I have for internet is DSL. I thought this would download the movie so you can watch it without waiting for it to load. It does not have any memory so it stops and loads more after several seconds. Useless to me.", "verified": true, "helpfulness": "5/11", "author": "RJKinVA"}, {"rating": 5.0, "review": "Have had Amazon Fire TV for a few weeks now and we are really enjoying this fire product.  It is easy to navigate.  Love that you can add to your watch list from other devices.  It allows you to easily remove movies from watch list after you have seen them.  Appreciate free prime movie's with lots of options.  Happy we finally purchased this product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]