[{"rating": 1.0, "review": "I bought tow and one turned out to be factory defective.No means to reinstall  firmware and clean reset. Limited to streaming few apps.", "verified": true, "helpfulness": "1/2", "author": "Zafer Rasim"}, {"rating": 5.0, "review": "Product arrived on time as promised. Well packaged. Bought 2. One was for my son . Have now ordered a 3rd one for another large TV in the house. Excellent product with a great price for what it does. We have 1 of the major dish networks and they will not allow us to stream Netflix as it is in direct competition to what they offer at a much higher price. I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I thought it would be difficult to install and use, but it wasn't. I use it almost every day. If there ever is a problem, it is with wi fi, not the chromecast. It def has brought a lot of fun into my kitchen!", "verified": true, "helpfulness": "0/0", "author": "Katherine C. Boyte"}, {"rating": 5.0, "review": "It work so well with my Iphone as a remote control to play on my 21 inches Samsung Monitor in my room. Love It !", "verified": true, "helpfulness": "0/0", "author": "Nicky"}, {"rating": 4.0, "review": "Very good gadget. Grreat for netflix.but still needs more apps. Easy to use and install. It is worth the money.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Ahumada"}, {"rating": 5.0, "review": "We picked one up for christmas and already its unshackled the way we watch our media.  No longer as we required to convert our content to be used in a certain other media center device.  Instead Chromecast lets us enjoy our media directly from our little archive that we maintain on our home network.That's not to say it's ready to go right out of the box, you will need to do some homework and find the appropriate apps and such to make use with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Chibi Masshuu"}, {"rating": 3.0, "review": "Works well with you tube and Net Flix but I bought it for Amazon movies and it is not compatable with Amazon signal! Major disapointment.", "verified": true, "helpfulness": "0/0", "author": "Joesph R. Brunault \"Joe B\""}, {"rating": 2.0, "review": "I was expecting plug n play functionality and easy device connectivity.  Apple TV was 3 times the cost but 10 times easier.", "verified": true, "helpfulness": "0/0", "author": "Jay J Couzins"}, {"rating": 4.0, "review": "Set up was simple, plug it in, find the wi fi and follow the instructions.  We've used it with Netflix, YouTube, Pandora and the internet.  Having just signed up for Amazon prime I'll be using it for the movies.", "verified": true, "helpfulness": "0/0", "author": "Jeanna"}, {"rating": 5.0, "review": "it is fantastic the Chromecast!! it works great! for Netflix is great, unfortunately in Italy Netflix doesn't exist, but it works great with Google Play!", "verified": true, "helpfulness": "0/0", "author": "roberto"}]