[{"rating": 1.0, "review": "Don't waste your time and money purchasing this. I'm very disappointed with the product. It has many limitations. You should try the Favi Smartstick instead which isn't the best but it's better than the Chromecast, I'd say!", "verified": true, "helpfulness": "0/2", "author": "Shane Hiralall"}, {"rating": 5.0, "review": "And I thought I needed to replace my tv to have nextflix without a game attached to it.  This is super portable and really easy to use.Download the chromecast app and netflix app on your phone, plug Chromecast into your tv and connect to wifi. done.I don't do anything else with it but am completely satisfied with what it does especially for $35.  I bought an apple tv at the same time and am returning it (without using it). maybe it's better but the Chromecast works for me and is much less expensive.", "verified": false, "helpfulness": "0/0", "author": "Happy Hunter"}, {"rating": 4.0, "review": "need more app ,there are to little apps here,just open source to the developers plz.movie and tvs is required .", "verified": true, "helpfulness": "0/0", "author": "chans"}, {"rating": 1.0, "review": "I still haven't figured out how to set it up!!!! My chromecast can't connect to my router and it says I have to change the router settings. After searching through multiple forums I see that many people have the same problem as me. I have a 2wire router and there is a list on google.com/chromecast that shows other routers that will have a problem.", "verified": true, "helpfulness": "0/0", "author": "Robert Smith"}, {"rating": 5.0, "review": "loved it so much i ordered a 2nd one for the master bedroom and will get another for the office", "verified": true, "helpfulness": "0/0", "author": "gregory g franklin"}, {"rating": 5.0, "review": "It works great!!!!!  I definitely recommended anyone to buy it.  Good quality and clear!  It's amazing!  Buy it now!  Yes.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "My devices can almost be dead and this sux no life from them push play n turn the device off. Even works after u leave the house ie left Pandora radio on when I left n came back n it was still playing.", "verified": true, "helpfulness": "0/0", "author": "WAStanley734"}, {"rating": 4.0, "review": "works great...I like it ...my tv not a smart tv ...use it all day ...worth it will recommend to every one", "verified": true, "helpfulness": "0/0", "author": "GEORGE"}, {"rating": 1.0, "review": "This is not a realistic product since it only streams a hand full of apps. I ended up just giving it to my kid since we watches videos on YouTube and he doesn't even use it also. There are much better products that steams the entire screen of your android devics, not just specific apps.", "verified": true, "helpfulness": "0/0", "author": "D. Smith"}, {"rating": 3.0, "review": "The gen 1 model could be improved. Needs more apps, like Amazon Prime and Xfinity (cable). I do not use Netflix. Streaming is not smooth and the screen frequently freezes. Also, needs to be easier to use with iPad. I'm excited to see what it's like with enhancements.Good price point.", "verified": true, "helpfulness": "0/0", "author": "Jenypher Jones"}]