[{"rating": 5.0, "review": "Chromecast works well. I had some minor issues at first where I would not be able to see casting button on my devices. I reset my modem and router and now everything works great. I stream content from my iphone and ipad and couldn't be happier. I enjoy having the ability to view youtube videos on my living room tv.", "verified": true, "helpfulness": "0/0", "author": "Artemio C. Ruz"}, {"rating": 5.0, "review": "This s*** is badass!!!! Easy setup, 10 minutes tops, you can still use your tablet while streaming which is cool!", "verified": true, "helpfulness": "0/0", "author": "Trillo"}, {"rating": 3.0, "review": "This is the easiest product ever to setup and use. plug it into your TV and then you are ready to use it.What can use improvement?well there are only a few apps that are optimized for the service. netflix hulu youtube and etc. other video websites you need to cast the tab. the hitch is that you are casting the tab not the just the video. so you can full screen the video, but it will remain in full screen on your computer as well so if you wanted to multitask you couldn't. you could leave it in normal screen mode and check other tabs or other programs.I would like to see the ability to cast as if it is a second monitor.I am very happy with the performance of this product.", "verified": true, "helpfulness": "0/0", "author": "Tom S R"}, {"rating": 5.0, "review": "Worked without a hitch! Everything I tried that has the chromecast ability has projected to my tv without a hassle...", "verified": true, "helpfulness": "0/0", "author": "Sonny"}, {"rating": 5.0, "review": "We have had several of these and have never had a problem.  I recently purchased a couple more for the holidays.  Once you set up the device, it is simple to use.  One thing to keep in mind is that the device is not compatible with all Wireless Routers.  Make sure you check the Chromecast website before you make the purchase to avoid disappointment.", "verified": true, "helpfulness": "0/0", "author": "hozae"}, {"rating": 3.0, "review": "It's a neat idea, and it works well.  The downside is that it kills my phone when I use it to stream to the TV.  I have a 4 month old Galaxy S4 and I can't even get through 1 movie without killing the phone's battery.  Works well when I leave the phone plugged in, but when I do that, I have to deal with the phone (which acts as a remote) being tethered to the wall or laptop for a charge.", "verified": true, "helpfulness": "0/0", "author": "Jman"}, {"rating": 5.0, "review": "For years I have been struggling with different versions of Roku boxes (I have three versions) and with the Bravia HDTV built in widgets. My experience with Roku is that they have reliability issues. They continually drop connections and periodically mysteriously hang, also their customer support is all but useless. The Sony Bravia widgets are more convenient than using a seperate Roku box but they also have buffering and hanging issues. Actually the quality of the Sony widgets (Netflix in particular) seems to have deteriorated with the current firmware update. I have switched entirely over to the Google Chromecast controlled from my Ipad. I am totally blown away by the image / sound quality and the total lack of buffering issues. I love this product!", "verified": true, "helpfulness": "0/0", "author": "A. Kenney"}, {"rating": 4.0, "review": "After a little challenge setting up Chromecast seems to be living up to its reputation. I would recommend it to another buyer.", "verified": true, "helpfulness": "0/0", "author": "Mr. Robert S. Mahoney \"stephem\""}, {"rating": 3.0, "review": "I expected to be able to share anything on my phone in the big screen, including a web browser. That's the idea I got from Chromecast's initial marketing. Perhaps I didn't read the fineprint...", "verified": true, "helpfulness": "0/0", "author": "Aruna Abeyakoon"}, {"rating": 4.0, "review": "My daughter loves it.  She is able to stream programs we do not get through our cable.  Works great with Netflix and Amazon.", "verified": true, "helpfulness": "0/0", "author": "Susan Schwartz"}]