[{"rating": 2.0, "review": "Ok, definitely need an additional service like hulu or netflix. Appears to have channel apps for  some very popular stations like disney and history channel but they don't completely work(may ask for internet signup but doesn't work). Would like to see more cable channel type apps that work. More recent shows or movies cost additional money. Was hard to cut the cable company cord after seeing amazon fire tv but had to.Would be higher rating if it had more database of material or a cable feel.Amazon nobody wants to pay cable $125 bucks a month for 300 channels when they only watch 10 to 20 channels. Figure out a way for us to watch and choose our 10 to 20 channels through your service and you'll have the next best thing and millions of customers!", "verified": true, "helpfulness": "1/4", "author": "AJ Flys"}, {"rating": 5.0, "review": "Fire TV is so easy to use. My husband and I have it hooked up in our room and use it daily. Between prime, netflix, hbo go and other streaming we can watch whatever we want whenever we want. It is really one of the best purchases we have made recently.", "verified": true, "helpfulness": "0/0", "author": "S. Stamm \"Newly Married Baker\""}, {"rating": 2.0, "review": "Amazon movies are fine, but have already seen most of them on tv.  Netflix movies have a better selection but the movie doesn't download in its entirety before the movie starts. Once the movie does start it keeps being interrupted by additional downloading, very frustrating.  Many movies require a payment, which I didn't expect. Overall, it's ok but much the same as premium channels and the movies are pretty old.", "verified": true, "helpfulness": "1/2", "author": "Dale M"}, {"rating": 4.0, "review": "Lots of good shows movies etc.  Wish there were more current or recent ones however.", "verified": true, "helpfulness": "0/0", "author": "marthawood"}, {"rating": 5.0, "review": "Outperforms my smart TV by a mile. I wish this technology was licensed to the TV manufacturers. I bought this device originally for 5ghz wifi This is definetly my preferred device for digital media and I have a Vizio smart tv, ps4, and chromecast to choose from.", "verified": true, "helpfulness": "0/0", "author": "Garrett Stauber"}, {"rating": 2.0, "review": "Too much content from The United Kingdom, PBS and \"Never heard of it before\".  Difficult to determine what is actually included as Free in your Prime subscription.  What is free in the subscription is not very interesting.  Streaming TV has a way to go!", "verified": true, "helpfulness": "0/1", "author": "Dennis Ward"}, {"rating": 5.0, "review": "I love the Amazon fire tv. It is so much more than the Apple TV and I love apple products. There is not a day that goes by that we don't use it for Netflix Amazon prime TV as well as Hulu and Vudu.The interface is great and intuitive. The voice search is amazing and works great. The remote is small and works from just about any distance. The box is so small that it can be hidden just about anywhere.The box contains the remote, Amazon batteries, the Tv box, power cable and adapter. Instructions are clear and if you order using your member ship it comes registered to your name and account. This of course can be undone and registered in another account if you choose", "verified": true, "helpfulness": "0/0", "author": "kmurphy"}, {"rating": 5.0, "review": "Love this fire tv  It was very easy to set up and easier to use,  I really like the voice commands and they really work!!!!!", "verified": true, "helpfulness": "0/0", "author": "Durinda"}, {"rating": 5.0, "review": "We love our Amazon Fire TV.  It was simple to set up and has exceeded our expectations.  The voice remote option works great and makes it so easy to find the program or movie you are looking for.  I would recommend this device to anyone looking for a great addition to your Home.", "verified": true, "helpfulness": "0/0", "author": "Janet Minger"}, {"rating": 4.0, "review": "The picture is beautiful and I like how I can play my music from my TV.", "verified": true, "helpfulness": "0/0", "author": "Coco1955"}]