[{"rating": 2.0, "review": "This started up and worked fairly easily the first two times and then NOTHING!!!!  I tried re-installing it twice and it was choppy and dropped off.  Don't buy it or any Google OS products until they get their act together.  I also have a chromebook and there aren't ANY tech people to help over the phone or via e-mail/web if you have a problem.", "verified": true, "helpfulness": "0/0", "author": "heather higgins"}, {"rating": 4.0, "review": "First things first, the package arrived on time with no damage.I liked the box it came in and the included accessories are great. Very small and portable. Was easy to setup the first time but when I tried to set it up at another house I was confused because I couldn't get it to work for awhile. I eventually figured it out on my own(searching online didn't help)and I think I got the hang of it now. So far I have only used my I-pod touch 4g and my mothers smart phone and both work without a problem.Netflix works well with this but a huge fault is that you cannot queue up movies or tv episodes like you can queue up videos with youtube. Quickly becomes an annoyance. Not sure if it's a problem Netflix must fix or Google. I would give this 5 stars if it supported more apps.", "verified": true, "helpfulness": "0/0", "author": "Tanner"}, {"rating": 5.0, "review": "Google Chromecast HDMI Streaming Media Player. Thank you to Google. High recommend, it's a good product, easy to install, easy to setup.", "verified": true, "helpfulness": "0/0", "author": "amazone"}, {"rating": 4.0, "review": "This was brought as a Christmas gift for my Granddaughter.  I asked her today about this item.  She said it was good except the WiFi that she has doesn't work that well, but the problem is the Wifi.", "verified": true, "helpfulness": "0/0", "author": "Allen"}, {"rating": 3.0, "review": "It is not what I was expecting. You need special applications to watch videos. You can't watch just anything you want it has to be just what there is available for chrome cast.", "verified": true, "helpfulness": "0/0", "author": "moises g. salazar"}, {"rating": 1.0, "review": "I know some of you people love it, but read this before you buy this product. I choose this rating because I am a technology geek. My family is not into technology like I am. I couldn't set this up. I have a windows phone 8, windows 8 tablet, ipad 2, iPhone 5, and a laptop. I couldn't use my windows products, including the laptop. I didn't try the iPhone, because it was dead. On the Ipad, I got as far as being able to see the video on screen, but not being able to hear it. Also it is deceiving, there are cords people, it isn't what it looks like in the commercials! Tre are wires for your tv and an outlet. I would recommend this product to absolutely no one. THINK TWICE  BEFORE YOU WASTE YOUR MONEY ON THIS, I AM SENDING IT BACK IMMEDIATLEY!", "verified": true, "helpfulness": "0/6", "author": "argdgxh"}, {"rating": 1.0, "review": "I have Microsoft Window XP and Google does not work with Microsoft Window XP,  you need Microsoft 7 or 8.", "verified": true, "helpfulness": "0/2", "author": "Mike Baron"}, {"rating": 1.0, "review": "Not able to get it to work reliably, so I returned it.  Amazon was good enough to refund my purchase price, less return shipping.  I don't know if the problems were with the device, my wi-fi situation, or maybe because I am not a youngster anymore.  The nuances of these types of problems are beyond me, and no one else seemed able to get it to work reliably, either.", "verified": true, "helpfulness": "0/2", "author": "Dave Bower"}, {"rating": 4.0, "review": "Works really good only draw back cant use every app unless you pay for service. Also tried to look at pictures on phone and dosent work.Maybe i am doing something wrong. However still enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Lyle"}, {"rating": 5.0, "review": "This was the best option for one of my TV's because we could not get cable into my art room. I could use the wireless for my laptop so after watching a few commercials about Chromecast I decided to give it a try. Perfect, perfect, perfect! So good in fact that we ordered another one for our TV downstairs.", "verified": true, "helpfulness": "0/0", "author": "Dawn"}]