[{"rating": 3.0, "review": "I thought this thing was going to be AWESOME! So maybe thats why I was disappointed... but if you're like me, you have very high expectations for products by Google.My chief complaint is that its not holding the settings. I have to constantly reconnect it to my home wifi. Additionally, and along the same lines, the \"casting\" of netflix from my iphone and/or ipad is also very finicky. Where the Chromecast only sometimes recognizes the \"cast\"Bottom line, I expected more...For the price it is worth it as I am sure many upgrades are coming", "verified": true, "helpfulness": "0/0", "author": "Seetz"}, {"rating": 5.0, "review": "Works like a dream! Make sure and check out the ebook \"Unlock the Power of Your Chromecast\" - the best way to maximize the features of Chromecast.", "verified": true, "helpfulness": "0/0", "author": "MWM \"apple elppa\""}, {"rating": 4.0, "review": "Best $value$ streaming device out there. Works on my PC, Mac, and Chromebook. Lots of apps (Netflix, HBO Go,, Youtube, etc.) come \"Chromecast\" ready. Easy to setup, and easy to use. If you have Chrome web browser, you can \"tab cast\" your screen. Definitely worth checking out due to low cost, ubiquity, and entertainment choices - especially if you are invested in the Google Play ecosystem.", "verified": true, "helpfulness": "0/0", "author": "D. Tyler Durham \"Consultant\""}, {"rating": 4.0, "review": "My wife got this for me for Christmas, And i Love It! The only problem i have with it is that it can be slow and have to update a lot if you have more devices using the WiFi. Other than that, It is great for streaming Netflix and Youtube!", "verified": false, "helpfulness": "0/0", "author": "doublej w"}, {"rating": 5.0, "review": "One of the best addons for your Android phone or laptop. I'm routing audio to my phone headphones using the Android LocalCast app. When the Moto X is supported for mirroring, I probably won't need that app anymore.", "verified": true, "helpfulness": "0/0", "author": "Mace Moneta"}, {"rating": 5.0, "review": "So far this is working great. As Google continues to improve functions, as well as additional apps, it is going to look even great.", "verified": true, "helpfulness": "0/0", "author": "Brian Adams"}, {"rating": 5.0, "review": "pretty cool, easy to set up works good", "verified": true, "helpfulness": "0/0", "author": "Joe Vidricksen"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/1", "author": "none"}, {"rating": 3.0, "review": "Satisfied with the product most of the time, but it doesn't play some videos.  Going to wait for some fixes before considering to purchase a newer version.", "verified": true, "helpfulness": "0/0", "author": "Lunch Box"}, {"rating": 5.0, "review": "Great product, easy to set up and to use.", "verified": true, "helpfulness": "0/0", "author": "Franco"}]