[{"rating": 1.0, "review": "I ordered this expecting to be able to play content from my laptop on my flatscreen but due to all the Google updates it only plays video or audio via Chrome.  Don;'t know what happened to this product as it was supposed to be simple to use to work via your home network to connect to your TV and now it is internet only and mainly Netflix or Youtube.  My Bluray player already does that.  Read carefully the product description as it is very misleading.", "verified": true, "helpfulness": "2/3", "author": "Rodster"}, {"rating": 1.0, "review": "Initial setup took only 5 minutes. Went to play a movie on Netflix via android phone (sg3) and it literally takes on average ~3-5 minutes just to \"connect\"the phone with the chromecast.  Transitioning between movies, forwarding, pausing movies is a hassle and doesn't work everytime.  The connection seems to timeout.If you try to watch something on another day, you are forced to redo the initial setup which is cumbersome. Basically everytime you want to watch something you have to set this thing up as if u just bought it.After numerous attempts to try to play anything (YouTube, Netflix movie) via my phone and laptop I just gave up and returned it.  I even tried to do a factory reset of my phone and reinstalled the Netflix asp to no avail.This is a frustrating product to use and not very reliable.  I do not recomend this product to anyone.", "verified": false, "helpfulness": "1/2", "author": "ATK"}, {"rating": 4.0, "review": "This is for people who don't have any smart software connected to their TV. Wifi Internet is obviously required to use this product.If you already have a PS3, Roku, Apple TV, you wouldn't really benefit from owning this product.It is a great portable device though if you don't want to carry around your PS3 in order to stream online content. But you MUST have either a PC, Mac, android or IOS device in order to tell the chromecast what to stream.The biggest flaw is that the software isn't great on every device, it seems to work best with my Android phone of all devices (including ipad, macbook, pc, iphone). It's seamless on an android controller, but when used on an IOS device it isn't as intuitive.Overall amazing product especially for the price, I've always wanted an all in one TV controller on my phone. (You can find out how to even turn on the TV from your phone with a few special tricks)", "verified": true, "helpfulness": "0/0", "author": "Darwin Chaug"}, {"rating": 4.0, "review": "Works great!! But only with certain websites such as Netflix and YouTube. Hope more websites become compatible in the future.", "verified": true, "helpfulness": "1/1", "author": "Charles"}, {"rating": 5.0, "review": "Easy to use and now my 48\" TV can play Netflix  movies and YouTube videos directly from my Wi Fi", "verified": true, "helpfulness": "1/1", "author": "Ron"}, {"rating": 4.0, "review": "Google Chromecast is great- works with Netflix, Hulu and You Tube but not Amazon Instant Video.I have had loading issues with You Tube and Hulu which is why I am not loving it.It is easy to install/remove  and it is a great price! Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Tawnie \"Classic Movie Lvr\""}, {"rating": 1.0, "review": "Only a few applications can be played. I though it will be more open to play most of apps. After 20 minutes of use, I put it back in box and sent to basement.Do not buy it.", "verified": true, "helpfulness": "1/3", "author": "Pirata bueno"}, {"rating": 5.0, "review": "wonderful product and performs flawlessly. allows me to watch you tube on any tv in the house with out a connection", "verified": true, "helpfulness": "1/1", "author": "Don Dickerson"}, {"rating": 5.0, "review": "Always super reliable, can find and connect to my internet with minimal input from me.I love that I can control my TV with my smartphone, and also any other TV with chromecast as well!", "verified": true, "helpfulness": "1/1", "author": "Jake Brinkmann"}, {"rating": 5.0, "review": "I have both Apple TV and the Google Chromecast...both have their pros and cons, but the Chomecast is great for viewing Netflix and YouTube from any Android device and even our iPad and iPhone. Set up was super easy and was done within minutes.", "verified": true, "helpfulness": "1/1", "author": "DC"}]