[{"rating": 1.0, "review": "Got one of these as a gift and I really don't like it.  Stick with ROKU.  Chromecast is a huge hassle to use with providers that Google doesn't push, like Amazon Prime video.  You have to download stuff onto your computer/phone to make it work, and the your iPad won't support the download software.  Just forget it and go with ROKU.  They don't push any one provider, and all the main ones work fine right out of the box.", "verified": false, "helpfulness": "0/0", "author": "MattA"}, {"rating": 5.0, "review": "it works perfectly , very easy to use", "verified": true, "helpfulness": "0/0", "author": "A A."}, {"rating": 5.0, "review": "good products,", "verified": false, "helpfulness": "0/0", "author": "ali subah"}, {"rating": 5.0, "review": "One of the best purchases I've made in awhile. Love being able to make every TV a \"Smart TV.\" My TV in my living room was one of the first generation Smart TVs and I was never truly impressed by it. Obviously, they've come a long way and I couldn't imagine life without one. Now the TV in my guestroom has the Chromecast and it is a \"Pseudo Smart TV.\" My next purchase will be the Amazon version. Not sure why I tried Chrome first. I'm an Amazon Prime member and love Amazon. I guess I just didn't hear about the Amazon product in time. I have a \"dumb TV\" in my master bedroom, so I'll probably try the Amazon version in there. Once I muster up the money for the Amazon version, I'll post results here.", "verified": true, "helpfulness": "0/0", "author": "David Ostrom"}, {"rating": 2.0, "review": "I'm not sure how to rate this. I really liked it when it worked, but it didn't last a year! I loved that I could take it to my mom's and watch my hulu and netflix on any of her TV's.  But, sadly it didn't last a full year. Should I be happy that I got almost a year of service?  I don't remember reading it was supposed to last any specific amount of time. Should I buy another one or try a Roku? Hmmmmm", "verified": false, "helpfulness": "1/2", "author": "Patricia Gallardo"}, {"rating": 5.0, "review": "Cut off every now and then, probably because of my WiFi signal, but other than that it was perfect. Super simple to use and works with my MacBook, Samsung phone, and LG tablet.", "verified": true, "helpfulness": "0/0", "author": "Bub"}, {"rating": 5.0, "review": "love chrome cast, can't be the price", "verified": true, "helpfulness": "0/0", "author": "Deiby Arias"}, {"rating": 3.0, "review": "It's ok", "verified": true, "helpfulness": "0/1", "author": "Thiago Coimbra Lemos"}, {"rating": 4.0, "review": "This product can go head to head with the apple tv and leave it in the dust because it can do almost everything as the apple TV and also some extra. It doesn't take up space net to all your other boxes and it only costs 35 dollars. This has been out for a pretty long time and lots of it's features are still in beta, but they are adding a lot of things as well. It is very easy to use and set up, all you need is a phone or computer and WiFi. I had to take off a star because of all the beta things after being released in mid 2013. But over all this is a must have product for every one without a smart TV but doesn't want to upgrade.", "verified": true, "helpfulness": "0/0", "author": "Anik P"}, {"rating": 5.0, "review": "People who know I have bought this ask me what it is and honestly I have a hard time describing it other than directing them to the product description. What I can say is that it works almost flawlessly and when people watch me use it they immediately ask me how much it is. They are shocked at how inexpensive it is. I use the word \"inexpensive\" because it is not \"cheap\". It is high in quality and low in price. I believe this product and others like it are leading the charge in a change in how people use their televisions. BYE BYE S**T CABLE!", "verified": true, "helpfulness": "0/0", "author": "Jonathan Quesnel"}]