[{"rating": 5.0, "review": "Stream movies to TV on your cell phone. More and more content becoming available. Google is taking over the world.", "verified": true, "helpfulness": "0/0", "author": "K. Simpkins"}, {"rating": 5.0, "review": "Works well", "verified": true, "helpfulness": "0/0", "author": "Mark Cordeiro"}, {"rating": 5.0, "review": "Excelente producto...", "verified": true, "helpfulness": "0/0", "author": "PAVEL GUTIERREZ RIVERA"}, {"rating": 5.0, "review": "came really fast, now i am obsessed with streaming music videos and tv from my laptop. amazing product for the price", "verified": true, "helpfulness": "0/0", "author": "Brandon Schmidt"}, {"rating": 5.0, "review": "Works great, easy to use, and worth every penny. I use it with my google nexus phone and they have the same operating system, so my Chromecast has been flawless. May not be the case for everyone.", "verified": true, "helpfulness": "1/1", "author": "B. Miller \"Truth B Told\""}, {"rating": 3.0, "review": "Hard to figure out", "verified": true, "helpfulness": "0/0", "author": "R. Burris \"The Centurion\""}, {"rating": 4.0, "review": "I really love my Chromecast, the only complain that makes it deserve 4 stars is that sometimes it \"get lost\" and have to reset it to factory settings and get it configured again in order to find it on my network. It does not happen really often but so far about 3-4 times in about 6-8 months.I use it mainly for Netflix and YouTube, but have a bunch of other apps for video and audio sharing that I use sporadically.I really recommend the device in case you have an old non-smart TV.", "verified": true, "helpfulness": "0/0", "author": "Josue Ramirez"}, {"rating": 2.0, "review": "meh, I don't think is worth it having because of the quality of the picture on the TV", "verified": true, "helpfulness": "0/0", "author": "Alberto L. Villarubia Perez"}, {"rating": 5.0, "review": "everyone should have it. super easy to use and makes streaming at home very comfortable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Those who use powerline networking (or wifi extenders) should note that there are connectivity issues. It works best if your controller device (say the phone) is using the same wifi router/switch as the one the Chromecast is connected to. When the controller device is connected to other routers/switch, there might be some problems, even though everything is on the same network.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer 47"}]