[{"rating": 1.0, "review": "You need patience to watch movies from chrome cast...most of the times it will have connectivity issues to your network...even if it connects it will work for maximum 1 hour...again it will have issue....daily i used to reset the chrome cast and set it up.....I got bored..Instead of this I would have used my hdmi cord and watch all websites..i don't recommend this to my friends.", "verified": true, "helpfulness": "0/0", "author": "Maniks \"Maniks\""}, {"rating": 5.0, "review": "At first I was considering the apple TV but decided to go with the less expensive Chromecast, Glad I did.  Works great and set up was a breeze!  I basically use this to watch Netflix on the T.V. I have loved watching Youtube videos and listing to music videos as well. Shippment was prompt and arrived within just a few days.  Would recommend this product to anyone.", "verified": true, "helpfulness": "0/0", "author": "blayde_hayli"}, {"rating": 5.0, "review": "It's totally hidden away and inexpensive with tons of potential.  Netflix and Pandora work flawlessly absolutely no buffering.  If you have Google Play All Access Music like I do then this is an absolute must have.  Casting from your Chrome browser is still in \"Beta' but I haven't had any issues with it although for casting video it is highly recommended that you scale down to 480p.The reasons this is better than Apple TV is 1) Price 2) No need for ANOTHER remote laying around 3) It plays nice with all devices (Not only Apple devices as the Apple TV does)", "verified": false, "helpfulness": "0/0", "author": "Bozak"}, {"rating": 1.0, "review": "We (my husband and I) watched the commercial on how easy it was to use, three easy steps and he said he wanted one.  Well, I bought him one for Christmas.  The three easy steps took 4 hours and it never worked properly.  The ads say that you can stream from your tablet, android or Ipad, or from your laptop.We could not get it to work with my IPad, it's to old (first generation), nor could we get it to work from my brand new Kindle Fire.  I talked to Kindle Tech support, and she said the although the Kindle Fire is an Android device, it did not support the Chromecast.  My husband installed it on our laptop and the movie would play for about 30 seconds, then stop.  When we realized how limited it is in your selection of movie sources, we decided to return it.  Our DVD player will stream Netflix, so until we find something better, we will just use that.", "verified": true, "helpfulness": "2/3", "author": "JR"}, {"rating": 4.0, "review": "Overall, I'm happy with my Chromecast; it's one step closer to all of my devices being connected. The price is reasonable for this reason alone.A couple minor flaws that keep the Chromecast from being great:1. No spotify app or ability to play local video files directly.2. This can be circumvented by streaming the video or the spotify web player from Chrome, but this approach suffers from a lot of skipping, lag, and occasional disconnects.The Chromecast is still relatively young, so these things may change in the future.", "verified": true, "helpfulness": "1/1", "author": "H. McCaslin"}, {"rating": 2.0, "review": "it didn't seem to work.  kept freezing up.did not like my wireless router.  the instructions are not the best.  I would spend a bit more and buy something else", "verified": true, "helpfulness": "0/0", "author": "John Wang"}, {"rating": 4.0, "review": "So I got this item to supplement my ROKU collection, I placed it in the master bedroom while all others have the Roku. I have to say I love the ability to control it from my cell phone or (cast). I would have given this 5 stars but I am waiting for my integration with websites and other services besides netflix.It works great, one thing I would say to others is to insure you have a good speed on your internet plus wi-fi connection or strong signal, this will obviously enhance your video quality. The size is right, make sure you have an HDMI on your TV, you will need a USB connector for power, the dongle has a wire from it into the USB for power. If not it does have a wall adapter so you are still good to go.I'm excited to see what features they add next to this device", "verified": true, "helpfulness": "0/0", "author": "bfamily"}, {"rating": 5.0, "review": "Neat small device that will greatly expand your TV viewing.  Easy to install and use.  Price is quite reasonable for something most people will enjoy.", "verified": true, "helpfulness": "0/0", "author": "Joseph P. Olah"}, {"rating": 5.0, "review": "Got this for my fiance for xmas and it works exactly as expected. Works great with Netflix. The picture quality is great and there's been no buffering at all. Excellent price.", "verified": true, "helpfulness": "0/0", "author": "Annedore Schweers"}, {"rating": 4.0, "review": "I really love the price of the chromecast.  I really like the fact that I can look at HBO go.  They need to get more  app.", "verified": true, "helpfulness": "0/0", "author": "Malika Newton"}]