[{"rating": 3.0, "review": "Although I already have Apple TV, I wanted to try out Chromecast.  The setup was simple enough (I did it from my iPad).For the iPad app, there is only links to Netflix and YouTube.  They both worked well.  Though I had closed the Netflix app on the iPad, it kept playing on the TV via Chromecast.  I tried to stop it by reopening Netflix but it wouldn't connect me to Chromecast.  I had to open YouTube, connect, and then stop playing via Chromecast.  I wish there was a control directly in the iPad app.On my iMac, I played HBOGO via Chrome browser.  It did play on the TV via Chromecast, but with a bit of a lag.I going to try to use it in France to see if it will work there too.  I'll update the review at that time.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Weisbart"}, {"rating": 4.0, "review": "I hoped ChromeCast would have more services available initially.Netflix plays better with ChromeCast than on either of my WiFi enabled Blu-Ray players.The ability to watch Netflix streaming video is worth the expense.", "verified": true, "helpfulness": "1/1", "author": "Audra Lyon"}, {"rating": 5.0, "review": "Very easy to set up... was done in under 3 minutes. This is not a replacement for Apple TV yet... you cannot mirror your phone or tablet and so cannot display local content on the TV. But you can do so from your laptop through chrome, and you can control the apps from your phone. No messy wires. Very elegant solution.", "verified": true, "helpfulness": "0/0", "author": "U. Gupta"}, {"rating": 4.0, "review": "Using one of my many left over monitor (keep upgrading) and speakers in my art room with this device and it worked great.  Only wish Amazon offered a streaming app that was supported by this device.", "verified": true, "helpfulness": "1/1", "author": "gary dzurny"}, {"rating": 3.0, "review": "There are several issues with this device that had I known them in advance I wouldn't have made the purchase.1) there is currently no support for streaming Amazon Prime Instant videos. Since I just cancelled my Netflix account (which is supported by Chromecast) and purchased the year of Amazon Prime, this is an issue for me.2) the Chromecast app will not load onto my husband's IPad 1 because it requires IOS6 and as you IPad 1 owners know, you can't install higher than IOS 5 on the first generation. (SEE UPDATE BELOW RE: THIS ISSUE)3) beware that only newer TVs have the HDMI port. Of our 4 flatscreens, only the 2 newest have the port.4) be advised it requires the unit be plugged into an electrical outlet as well as the back of the TV so extension cords will likely be involved.Otherwise it was fairly simple to install into the TV and onto my Mac computer and my iPad2. I can watch HBOGo on it. I can put my Chrome browser up on the TV and use it as a monitor, though I'm not sure I'll actually do that. I did try playing an Amazon Video on my computer browser and then putting the browser onto the TV. That worked however the video area is tiny and making it full screen on the computer, makes it disappear off the TV, and the sound doesn't come out of the TV. Given that, it's easier and more pleasant to watch the videos on the laptop screen or the iPad app.At $35 it's probably more trouble to try to return it than just keep it and I am hoping one day for Amazon app support. If you have Netflix, newer TVs and new tablets, this will be great for you. If not, steer clear. Check out the Roku. More pricey but it supports Amazon Instant videos. I am considering that for myself.UPDATE- we just discovered that even though the Chromecast App won't install onto the iPad 1, the iPad still picks up the Chromecast device and allows us to connect to it. I guess that app is only like a remote control and not needed but the device emits a signal making it discoverable like a bluetooth device or router would? Anyway, it is still too limited for me. I want it to support more--such as Amazon Instant Videos, and the other apps I routinely stream/watch such as ABC and  Xfinity. But I raised it to 3 stars since it does work.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Most amazing piece of technology to be so easy to set up and use. I am obsessed and will soon have one in every room of the house. Now that HBO GO is available, I may never turn off the TV. The device accesses all of the same apps as Apple TV or gaming systems, but for only $35.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "This is a device that has so much potential to create a new tier in home entertainment. Instead it is falls short of even wifi enabled bluray players.The streaming function is cool but you have to keep your computer, tablet or phone running which drains battery and kind of defeats the purpose. You can bypass this and turn off the computer and the chromecast will continue to stream but then you lose the ability to pause the program.My suggestion to google would be to create a keyboard or app that would let you use chromecast as a stand alone web browser. This would add the functionality to make the chromecast a must have piece of technology.", "verified": true, "helpfulness": "1/1", "author": "marcus"}, {"rating": 5.0, "review": "Works great but make sure you don't name the chrome cast the same name as your wifi or it can cause problems.  Once I did this it worked fine.  Needs to be reset randomly but that may just be my wifi...For the cost it's much better than buying a smart tv.", "verified": true, "helpfulness": "1/1", "author": "Galen"}, {"rating": 5.0, "review": "It's great makes things so much easier than hooking up my computer to the TV. Installation is a breeze also.", "verified": true, "helpfulness": "1/1", "author": "Rachel Hamilton"}, {"rating": 5.0, "review": "Awesome. It takes moments to set it up. Very easy to play content from mobile devices and view it on the big screen.", "verified": true, "helpfulness": "1/1", "author": "Michael Morrison"}]