[{"rating": 3.0, "review": "Works great and fine but I have Amazon Prime...it's useless if you want to watch amazon prime on your big screen. a THANK YOU FOR AMAZON FIRE!!! 👍👽👍", "verified": true, "helpfulness": "0/1", "author": "Lop3z"}, {"rating": 3.0, "review": "Was super excited to give Chromecast a try after my vizio google tv pretty much died, and it's ok... One thing all these devices are missing, one of the few things google tv got right is a freaking hdmi out AND an in. Who wants to change inputs? Or better yet try explaining how to do it 500 times to an elderly family member, or better yet any non slightly tech savy family member. After playing long videos on it (hour +) it kinda freezes up and you have to disconnect app from it and reconnect it to get it going again, kinda annoying. Also had it loose connectivity once to my wifi and pwr cycle did not resolve, had to wipe it and set it back up like new.", "verified": true, "helpfulness": "0/0", "author": "necrackolytez"}, {"rating": 1.0, "review": "I tried to setup the device by connecting it to my TV. The device had problems finding my network. After a couple of tries, it found it and started to update. The update stayed at 20% for about 10 minutes before I gave up. I read online that it sometimes has problems with a wall mounted TV. I used the HDMI extender, which didn't help. I finally plugged it into one of my receiver HDMI ports. I finally got it to see my network and setup. I was able to see my web browser on the TV. I then tried to stream YouTube from my phone. I am now listening to audio and the only thing on the screen is \"Retreiving Data.\"After over an hour of trying to get this to work, I think I need to give up and return it.", "verified": true, "helpfulness": "0/1", "author": "J Jeffrey Bierman"}, {"rating": 4.0, "review": "Great for HBO go, youtube, netflix, and the likes.  I find it very convenient and useful.  Takes very little space, the charging wire is a little annoying, but can be hidden.", "verified": true, "helpfulness": "0/0", "author": "Marc O. Joseph"}, {"rating": 3.0, "review": "I bought this to show pictures (kids) to my mom on my TV screen from my laptop.  Using anything higher than a 780 resolution causes significant delay and pixlataion.  using the Slideshow feature also causes trouble for Google Chrome Cast.  In all fairness Google does say this is a Beta feature, so I get it and am grateful for teh technology at all, but its not perfect.  I dont use this for anything else so no comment on that.", "verified": true, "helpfulness": "0/0", "author": "mhkp"}, {"rating": 5.0, "review": "I paid a friend with cable the HBO subscription fee so he could add HBO to his account, now I can use that account on HBO Go and use the Chromecast for silky smooth HD playback.  Have not noticed any choppiness so far, very easy to install and use, great tool for cord cutters.", "verified": true, "helpfulness": "0/0", "author": "Mackin"}, {"rating": 4.0, "review": "Bought this on a whim when it first came out. It hooks up really easily and works well as long as you're using the Chromecast app specifically. Casting web pages is just ok and if you're trying to cast videos from other sites it's just not there yet. That said, it's cheap for what it is and it's a lot of fun for music videos and watching youtube with people over.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"Jessica\""}, {"rating": 5.0, "review": "Does everything I wanted plus more, would highly recommend getting Plex as well it has been more then useful. Yeah", "verified": true, "helpfulness": "0/0", "author": "keith morgan valentine"}, {"rating": 2.0, "review": "the instructions for this are quite lacking - thy were really quite disappointing - set up was unclear - clarity is needed", "verified": true, "helpfulness": "2/2", "author": "Wade"}, {"rating": 5.0, "review": "Nice gadget google came up with. I love it. it turns your existing systems in Air Play mode basically. I hope more and more apps will be supported in future.", "verified": true, "helpfulness": "0/0", "author": "Vikram Rao \"Viks\""}]