[{"rating": 1.0, "review": "It work nice for six months. then it stopped working. The LED is red, factory reset not working. Can't find the chromecast from any device. Can't find support from my country, or how to replace the device.", "verified": true, "helpfulness": "0/0", "author": "Nahshon"}, {"rating": 5.0, "review": "Absolutely Amazing!!!", "verified": true, "helpfulness": "0/0", "author": "Mike L."}, {"rating": 3.0, "review": "not necessary if you have a smart tv.", "verified": true, "helpfulness": "0/0", "author": "jose m reyes"}, {"rating": 3.0, "review": "Works well with Android but it has a lot of problems communicating with Apple products. I have two of these chromecast and they both have problems pausing and fast forwarding media through iPhone and especially iPad.", "verified": true, "helpfulness": "0/0", "author": "Dylan Fischer"}, {"rating": 5.0, "review": "This is a perfect size & was easy to set up.", "verified": true, "helpfulness": "0/0", "author": "bird"}, {"rating": 5.0, "review": "Chromecast offers a lot of capability to project content from laptops and tablets. We use these pretty often to broadcast content.", "verified": true, "helpfulness": "0/0", "author": "P. M. OConnor \"P. M. O'Connor\""}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "James D."}, {"rating": 5.0, "review": "So much quality in such a small device. I love it!", "verified": true, "helpfulness": "0/0", "author": "Gregory M."}, {"rating": 5.0, "review": "I have three of these for all the tv's in our house even one that is already a smart tv. It's incredibly easy to use and love that I can use my phone as the control as it's so much easier then utilizing a tv or dvd remote for other smart devices.I loved it so much that I gave them all out to my groomsmen at my wedding. Definitely recommend and you can't beat the price!", "verified": true, "helpfulness": "0/0", "author": "Seth H."}, {"rating": 1.0, "review": "This didn't come close to fulfilling my expectations for a streaming media device. Roku & Fire TV do much better.", "verified": true, "helpfulness": "0/1", "author": "J. Green"}]