[{"rating": 5.0, "review": "I don't have cable and this turned my TV into something very useful. I use it almost everyday. I watch movies, shows, music, can even cast the screen to play games. The list of offerings and apps you can cast grow all the time.", "verified": true, "helpfulness": "0/0", "author": "Alex Jr. \"Bacalao21\""}, {"rating": 5.0, "review": "Excellent product and seller", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "Great gadget.", "verified": true, "helpfulness": "0/0", "author": "Spike"}, {"rating": 5.0, "review": "The Chromecast is truly a valuable and genuine alternative to a lot of other set-top boxes (ie. Apple TV, Roku, etc.)The requirements to utilize a Chromecast to it's fullest extent?-A decent wireless network, that the Chromecast can connect to (cannot have a authentication portal.. at least not that I'm aware of)-A device that supports said wireless streaming-USB power.-USB power, I plugged this guy into a normal, older 32\" TV that supports a USB, but is actually a factory service port- so it won't supply a consistent 5V. I solved this by utilizing a USB portable charger I had laying around- but pair this with a normal USB wall plug, problem solved.-A decent wireless network, should support a decent amount of bandwidth going through from device to Chromecast, for HD and SD.-A device that supports said wireless streaming.Safari/Chrome on the iPad, will not stream.The YouTube, Pandora app on the iPad, will.Chrome on the MacBook, Desktop, or any laptop, will if you download the Chromecast extension.The best thing I did for this Chromecast, was purchasing Plex Media Player.My desktop has a ton of Movies, TV Shows and is usually always running.With the mobile app, desktop browser, I basically have my own Netflix- free, given I can find the shows I like.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 4.0, "review": "This is very user friendly after you get through setting it up.  We still have issue with it freezing up or not connecting to the internet at least once a week if not more even though our wireless signal is full bars where the Chrome is located.  I love the fact I can just sit on my couch and use my phone instead of having to use another remote controll.", "verified": true, "helpfulness": "0/0", "author": "tbrownell"}, {"rating": 3.0, "review": "I love this technology when it works. There have already been several occasions when Chromecast couldn't play a show or movie from netflix, and that's frustrating.", "verified": true, "helpfulness": "0/0", "author": "Ita M. Paskind \"Ita\""}, {"rating": 4.0, "review": "Overall I am satisfied but using the chromecast extension and adjusting the setting to 720p from my laptop to the TV produced bad lag on the video, worse when using high stream 720p so I was only able to stream from Amazon prime video in 480p mode which made the picture look like I was watching beta or vhs tape. So I am keeping this for my kindle maybe it will work better.", "verified": true, "helpfulness": "0/0", "author": "bladeless fan - fan"}, {"rating": 4.0, "review": "When it works its great, but every once in awhile it disconnects,and wont reconnect until i unplug it and go through the setup process again.", "verified": true, "helpfulness": "0/0", "author": "ezra"}, {"rating": 3.0, "review": "Very cool device, but set up was not easy. Could not set up suing my S4 phone, iPad 2 or Sony laptop. Took 2 hours and nothing. Set up a return with Amazon and forgot to drop it off at UPS.So I tried setting it up again using hard lined desk top computer and it now works. Ill keep it now.Beams Pandora and YouTube with little lag/buffer and Netflix with a longer lag/buffer, but it did work. I was able to mirror my chrome internet browser window easily.Picture quality takes 20-30 seconds to really get sharp, but after that is is good quality. I am not sure if it is great, but HD none the less.dlink DIR-655 Hardware version A3 firmware 1.37", "verified": true, "helpfulness": "0/1", "author": "Jack West"}, {"rating": 1.0, "review": "It works randomly, then I'll start enjoying something on netflix, then BOOM, it stops working.  So I'll try to troubleshoot it and of course nothing works, and google has no support for this product.  Get something else, this product is terrible.  I'd consider cutting my losses and throwing this into traffic just so I don't get tempted to use it, then watch as it stops working halfway through a movie.", "verified": true, "helpfulness": "0/1", "author": "Matthew Allen"}]