[{"rating": 4.0, "review": "If you are looking into this product you should know it works well. The signal strength upstairs in my house isn't great but this picks it up and stays connected well. Setup wasn't not very difficult either. Had a problem with one tablet staying connected to the device but other tablets continued to work, so I think the issue is with the tablet itself. Kids love it and I like being able to control what they watch from another room (Netflix).The only reason for a reduced star is it's very limited currently in what applications it works with. Netflix, Youtube and Google Movies.I got it for Netflix so it does what I need. I know there is some confusion out there about what else it can do so I wanted to be clear in my review.The fact it came with 3 months of Netflix was great, it works with current customers too.", "verified": true, "helpfulness": "1/1", "author": "J. Moore"}, {"rating": 4.0, "review": "It works very well.  I had some issues after some automatic software updates.  Sometimes, the device lost the tv resolution information and the image appears out of proportions.  The workaround: Unplug the chromecast device from the hdmi port and plug it again.", "verified": true, "helpfulness": "1/1", "author": "Jorge Forero"}, {"rating": 3.0, "review": "I found Chromecast easy to install and it is convenient to use from a Windows laptop or from an iOS or Android device. Streaming Netflix from an iPad and controlling it worked well. Streaming HBOgo from a Chrome browser window was a major disappointment. It was extremely choppy. I do not believe I had anything intense running on my network, though we do have many connected devices. Based on comments below, I suspect the problem is the Core 2 Duo laptop I am using. Perhaps I will get more value from the ChromeCast once I upgrade (I'm waiting on a good Haswell Win 8 convertable tablet).The reality is that I can use my PS3 for watching Netflix (and Amazon instant video), but I hoped I would get value from the Chromecast by mirroring Chrome on a laptop. Based on the performance I experienced, it looks like I will just have to wait for more services to be supported.", "verified": true, "helpfulness": "1/1", "author": "David J. Moreau \"David Moreau\""}, {"rating": 4.0, "review": "Glad it came with the USB cord extension because I needed it to plug the unit into my TV.Easy to install and get running. Works great and is inexpensive. Even this non-techy was able to get this working the first time, with no challenges.Giving four stars: -1/2 because I had to wait a couple weeks to get it due to demand. Note to Amazon-- don't offer it for sale, if you don't have it in stock. And -1/2 because Amazon Instant Video (AIV) is not supported by Chromecast, which has driven me to Netflix for content. Not certain if this is a Google or Amazon decision, but as a consumer, it would be great to see AIV supported.", "verified": true, "helpfulness": "1/2", "author": "JibberD"}, {"rating": 4.0, "review": "This works great! I now get YouTube on my tv. You can use chrome to chromecast as well. With the auto software updates works very well.", "verified": true, "helpfulness": "1/1", "author": "MWJII"}, {"rating": 1.0, "review": "I pre ordered it a month before it shipped. Said I would be able to stream local files. That is false", "verified": false, "helpfulness": "2/7", "author": "James"}, {"rating": 1.0, "review": "Title says it all.  The Apple TV is far and beyond the better product.  Even at $35, the chromecast is a waste of money...and, especially, time.  The chromecast is for you If you like inconvenience, poor implementation (if at all), and a device that rarely works the way you'd expect.  If you like to enjoy your phone's content without complication, get the Apple TV.  The Apple TV is far and beyond the better of the two products.", "verified": false, "helpfulness": "1/8", "author": "SFTech"}, {"rating": 5.0, "review": "I pre-ordered a Chromecast in mid July.  I received it around July 30th.  Easy setup.  Took me about 3 minutes.  Does everything I want it to with 1 exception.  It will not stream local content, meaning media files on your local networked computer, phone or tablet.  Yes, there is a workaround by opening your local content in a chrome browser tab.  Right now, it doesn't work well for my needs.Youtube, Netflix and Google Play stream effortlessly to my HD television with stunning success.  As others have said, when doing one of these online services (and the many to  come) are streamed directly from the internet to your router to the Chromecast.  This process will allow you to turn off the device used to engage the service once it is streaming to the Chromecast.  You can leave the device on and use it as a remote.  Leaving the device on uses less than 1% of my cpu on my Samsung GS3.  Not much, doesn't seem to run battery down.Streaming a tab from the Chrome browser on a desktop or laptop works very well for me.  I have very fast computers.  Both my laptop and desktop have 3rd generation i7 processors and have little problem casting the Chrome browser tab.  However, after reading reviews, I tried an older i3 laptop.  It was not able to handle the process of getting it to the Chromecast from the Chrome browser.  As the content in this scenario is streamed from the internet to your router, then to you computer where it is decoded, recoded and sent back to your router and finally to your Chromecast.  Lowering the video quality helped but did not eliminate the issue on my older laptop.  Google has recently added the ability to cast Netflix, Youtube and Google Play directly to the Chromecast when using the Chrome browser on a desktop or laptop.  This is now the same scenario as from a smartphone or tablet, when doing these services the Chrome browser simply engages the Chromecast to stream the data.  Almost any desktop or laptop would be able to do this, but only for the included services.  Important if you don't have a smart phone or tablet, you can still engage the Chromecast without taxing an older CPU.  Music services like Pandora and Spotify play well on almost any halfway decent PC using the Chrome browser.  I have one Chromecast plugged into my HDMI port on my Onkyo receiver and listen to Spotify and Pandora over my stereo without the TV being on.  Controlling with my laptop or desktop.  Sounds great, I love it.After a full day of use, I ordered 2 more Chromecasts for my other HD televisions.  I use one of my tablets, smartphones or computers to cast to any TV in my house.  I personally love the Chromecast, and like I said, it does it all for me.  I can stream anything I can find on the web to my HD televisions.  You may not be able to depending on your equipment.  It is a cheap way to add Netflix, Youtube and Google Play(many to come) to a HD TV that is currently without that capability.  I hope this review explains enough for you to decide if it is for you.  If you do not have a newer PC or Mac, you might find the Chromecast very limited right now.  If you do have a new computer, this is probably the best device for you to stream any online media to your HDMI device.  And eventually, I see this device adding most services for direct streaming of online content, supporting anything Roku and Apple's equivalent can, including streaming local content from your PC, tablet or smartphone.5 stars for me, but depending on what you want and what your existing equipment is, it may not be for you.", "verified": false, "helpfulness": "3/3", "author": "L. David \"LDAVID\""}, {"rating": 4.0, "review": "The only things this does excellently are Netflix and Google Play.But then does it really need to do more?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "only reason for not giving a five is that is does not work with my kindle fire. Wonder why that can't be done without a jailbreak.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]