[{"rating": 5.0, "review": "I have one and it is great to use, I gave it as a gift.", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 2.0, "review": "not really happy.  I may not be doing things right though.  i installed on the tv and everything is working with that and was very easy to install and hook up.  i have it running off my IPad.  I have google play/chrome/google account and all the goodies loaded on the IPad but so far all I can get to work is the netflix, crackle, spotify, and pandora.  Im not impressed as I thought I would be able to surf social media sites and use the TV as a monitor...grrrr", "verified": true, "helpfulness": "1/1", "author": "Eric Hughes"}, {"rating": 5.0, "review": "We love this device. It's opened up a whole new world of fun viewing for us.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Good product, thanks", "verified": true, "helpfulness": "0/0", "author": "FRANKLIN CARPIO NUÿEZ"}, {"rating": 4.0, "review": "I bought this product after a good friend of mine who is a huge Netflix, YouTube, Twitch.tv user, told me about it. For $35, I feel like I'm cheating Google out of money. I have spent several hours putting a video or a show on my TV, when before I'd have to spend an hour before hand setting up a computer to do the same function. Often my family and I will sit in the lounge room with our phones out flipping through YouTube to show each other videos.Unfortunately, due to an accident, the HDMI port on our Chromecast has been damaged, and it no longer displays video. I do not see this as a fault in the Chromecast as much as a fault in HDMI, as I have seen many HDMI cables ruined in similar ways. While it could possibly be repaired, I lack both the knowledge or the tools necessary to do it. I am very pleased with the product and I have no problem purchasing another one and putting forth the measures to prevent a repeat of before.", "verified": true, "helpfulness": "0/0", "author": "Tyler R Allen"}, {"rating": 5.0, "review": "The chromecast itself is pretty awesome. The cost of programming sucks bad. I can't bring myself to buy any video from the play store when I can get RedBox for way cheaper.", "verified": true, "helpfulness": "0/1", "author": "J. Brigman \"FreeTeeVee\""}, {"rating": 5.0, "review": "Great device at good price point.", "verified": true, "helpfulness": "0/0", "author": "Desean"}, {"rating": 5.0, "review": "I've had this a while but now just am getting to a review.  Love to use this for listening to my You a tube channel on my tv. Works awesome with my iPad", "verified": true, "helpfulness": "0/0", "author": "Stacy M Wolf"}, {"rating": 3.0, "review": "looks nice but no instruccions what so ever", "verified": true, "helpfulness": "0/0", "author": "Wilson Achio"}, {"rating": 5.0, "review": "Got this for my friend's birthday gift. She loves it! If you watch television shows and stream stuff a lot, this would definitely be a good gift to self or friend! Also, you could connect it to your hulu, netflix, etc :)", "verified": false, "helpfulness": "0/0", "author": "Amanda Cheung"}]