[{"rating": 5.0, "review": "Very good .Thanks .", "verified": false, "helpfulness": "0/0", "author": "Abdulkarim M. Fattah"}, {"rating": 5.0, "review": "How did we ever get along without it! Watch anything you like on youtube (usually for free), also use it with Netflix - - it's so awesome to move your little computer screen viewing to the tv big screen! And now we never run out of programming for the grandkids when they're over, dinosaurs, trains, planes, cartoons, whatever they ask for you can usually find it on youtube, Netflix, and others.", "verified": true, "helpfulness": "0/0", "author": "highlandmist \"highlandmist\""}, {"rating": 1.0, "review": "I didnt know you had to almost pay for almost everything on it. There are some free channels, but for the most part every channel you have to sign up for and pay a monthly fee, like netflix, hulu, and other channels.", "verified": true, "helpfulness": "1/3", "author": "mintac60 \"Norman Titus\""}, {"rating": 5.0, "review": "Great device for a fare price!!! It plays through some apps on my Android phone, the App must have the Chromecast share functionality. To cast from the notebook its also ease, simply install an add-in on your chrome browser and a software called \"plex\" and you can share your browser tab with your TV. It is simple, easy, HD and works just perfectly! I totally recommend!", "verified": true, "helpfulness": "0/0", "author": "Theo"}, {"rating": 5.0, "review": "Easy to use and the setup was simple", "verified": true, "helpfulness": "0/0", "author": "Keith D McDonald"}, {"rating": 4.0, "review": "Fast Shipping, It freezes sometimes and gets very hot, but works pretty good", "verified": false, "helpfulness": "0/0", "author": "Wanda Angeles"}, {"rating": 4.0, "review": "Nothing to add other than what has been said before about the product.  Looking to cut the cable for all but internet connectivity I have been using Chromecast for about two weeks.  The bigger challenge in cutting the cable and casting to TVs is the programming beyond just movie watching.  Netflix, Amazon Prime and others are easy and the quality of the video stream to Chromecast is extremely good (I have a 20+MB download internet service/Netgear wireless router).  Live TV is the challenge and having a account is really required.  If you can get a logon to a cable provider from a friend or relative  you are pretty good to go.Amazingly casting seems to work best using cell phone connected to WiFi better than a desktop computer but have no doubt this is not nearly as high resolution live streaming as a regular cable connection.  Casting movies, Netflix and Amazon is just as good as any connectivity but not live streaming like NFL Game Day (Plz don't ask me how I do that from here in the U.S.. Do your research.  It is easy and it works.)", "verified": true, "helpfulness": "0/0", "author": "VinceC"}, {"rating": 2.0, "review": "Rwturned", "verified": true, "helpfulness": "0/1", "author": "Billy B \"sloyakman\""}, {"rating": 5.0, "review": "Nice.", "verified": true, "helpfulness": "0/0", "author": "Guillermo Rivera"}, {"rating": 4.0, "review": "It would be great if google expands its casting ability to support any (at least most) video players as it does for Netflix and youtube. Picasa support supposed to be added. Playing videos both on laptop and TV wastes energy and also hugs up a  big part of home wifi stream, mine is 18mbps/12mbps down/up but stills buffers a frequently when more than one internet browsing device is being used along with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "KRP"}]