[{"rating": 3.0, "review": "One major problem I've seen....it will play MLB.TV just fine for about an hour and then it sits in a constant buffering state.Tried all of the recommendations and it keeps doing the same thing.Plays just fine on the PC, so it's not network related.", "verified": true, "helpfulness": "0/0", "author": "Sean As"}, {"rating": 5.0, "review": "Fantastic!  The Voice Search works amazingly well.  This one feature alone blows away the competition.  Very well thought out remote control.  Set-up was a breeze.  On screen functions while watching a movie are superb.  No, I don't work for Amazon!", "verified": true, "helpfulness": "0/0", "author": "Uncle Woody \"Scott Wood\""}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Lynn Allman"}, {"rating": 5.0, "review": "this was a birthday gift it stopped working the very next day HoweverAmazon was quick to replace it for us and I have had 0 Problems with this oneI really like the layout and being able to talk to it and have it find what I'm looking for.It's quick and responsive, easy to setup and having Amazon Prime just gives us more choices.", "verified": true, "helpfulness": "1/4", "author": "susan"}, {"rating": 5.0, "review": "Simply awesome", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 5.0, "review": "Wonderful product and super easy to install - even for me!!!  I still have to get a little more familiar with it, but, I watched three movies so far and an entire TV series.  The selection process was very easy.  I wish the menu was more like TIVO so I wouldn't have to learn another system.......  My kids love it as well and don't seem to care that it's a new system to learn - they took to it like a fish in water.  Well worth the money.  The picture is clear and there is NO buffering problems.  The entire movie/TV series pays without any hesitation and starts right away - without all the annoying previews or commercials.", "verified": true, "helpfulness": "0/0", "author": "Ruger"}, {"rating": 5.0, "review": "Fantastic!  I have had a Roku for several years.  The Amazon Fire TV is much better.  I love the experience!!", "verified": true, "helpfulness": "0/0", "author": "Stephen Kingery, Author"}, {"rating": 5.0, "review": "I am predicting that it will be amazing.  I haven't had time to really sit down and try it yet.", "verified": true, "helpfulness": "0/0", "author": "Ellen L Spiller"}, {"rating": 5.0, "review": "I really like to have all my streaming service on one device. It works really well and I would buy again.", "verified": true, "helpfulness": "0/0", "author": "Leonard Canada"}, {"rating": 5.0, "review": "I love the new Amazon Fire TV.  It still needs updates in order to get apps like Starz Play which currently I can't get from the App Menu.  For that to be my only issue I say Hooray!!!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]