[{"rating": 5.0, "review": "This is a great addition to our home entertainment. I have an older Panasonic TV with only two HDMI ports. Recently we bought an Onkyo receiver TX-NR636 with multiple HDMI ports. I have Dish DVR connected directly to the TV and the other port comes from the Onkyo. Without even turning on the Onkyo, I plugged in the Chromecast into the CBL/SAT port on the Onkyo and turned on the TV. It instantly came up on the TV and connected. I downloaded the App to my ipads and phone and were streaming movies to the TV within 20 minutes. Couldn't have gone any smoother. It streams flawlessly with DSL and have not had any issues other than finding halfway decent movies to watch.", "verified": true, "helpfulness": "1/1", "author": "RVator"}, {"rating": 5.0, "review": "This was given to me after a friend bought it for themselves to use at my house, and then decided we just both needed our own!  I used to use my Xbox 360 to stream from Prime and Netflix, but since my XBox has been on its last legs, this has become increasingly difficult.  Within 8-10 minutes of un-boxing the Chromecast, we were streaming again!  All you have to do it go to the website, install the app, and then you go to whatever platform (Netflix, for example) from your phone, laptop, tablet, computer, or whatever device, and click the little button to cast. It REALLY is that easy!  My XBox was noisy, but this is SILENT, and I have noticed it's actually better on overall volume than the Xbox, too.  You can control the volume of the unit itself AND the TV or whatever you're streaming to, so you've got more room to bump up the output.  This was a problem with the XBox not only because the XBox itself was loud, but because I felt like we were always jacking the volume WAY up on the TV just to make it audible.  The size makes it easy to take on trips so you can cast in the car and leave the DVD's at home.  The easy power adapter means you can use it just about anywhere you can charge a phone or other mobile device, too.  It really is simple AND simply awesome!", "verified": false, "helpfulness": "0/0", "author": "Starry-Eyed Mama \"Starry-Eyed Mama\""}, {"rating": 5.0, "review": "If you know that it does not intend to be an Apple TV, you will be 100% satisfied. It is really awesome, easy to use and works very well.", "verified": true, "helpfulness": "0/0", "author": "Raphael Araujo"}, {"rating": 5.0, "review": "I have 2 of these devices.  I wouldn't live without one.  For the price it's a fantastic product.", "verified": true, "helpfulness": "0/0", "author": "Paul"}, {"rating": 5.0, "review": "Perfectly as described!", "verified": true, "helpfulness": "0/0", "author": "Chelsey"}, {"rating": 5.0, "review": "I've had a Chromecast for over a year and have always loved it.  This Christmas, I purchased 3 as gifts for family and friends - they all love it too!  It's super easy to set up and use.  My 22 month old daughter can even navigate to YouTube, select a video, and stream it to the TV via the Chromecast.  Works perfectly streaming from my iPad, Samsung Galaxy S4, our Lenovo ThinkPad and even our desktop from another room.", "verified": true, "helpfulness": "0/0", "author": "Victoria"}, {"rating": 5.0, "review": "This is awesome, so much technology in such a small package. If you download this app called TV Cast you can watch any video from any website on your TV!!!! 👍👍👍", "verified": true, "helpfulness": "0/0", "author": "Bryan L."}, {"rating": 3.0, "review": "It's a cool gadget, does what it says it will do, small and very easy to use. But I like the roku better.", "verified": true, "helpfulness": "0/0", "author": "J-Squared"}, {"rating": 5.0, "review": "Works as intended. Mirrors,  Localcasts videos and streams from my Nook hd+.  Also streams from my iMac.", "verified": true, "helpfulness": "0/0", "author": "A. Wong"}, {"rating": 5.0, "review": "I Love The Chromecast! It arrived very fast.", "verified": true, "helpfulness": "0/0", "author": "William Snook"}]