[{"rating": 5.0, "review": "I LOVE being able to stream videos from my Amazon Prime account. As well as having access to Hulu Plus, Netflix, Pandora, and much more.", "verified": true, "helpfulness": "1/1", "author": "Alexis VanPool"}, {"rating": 4.0, "review": "If only everybody got along and iTunes was included it would get 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Wld8hrt \"wld8hrt\""}, {"rating": 4.0, "review": "It took a customer service rep to assist in the setup. The video shown on the site doesn't give the full detail of what you need to do. The number of TV shows and movies available aren't the best of what's trending to watch. Those you want to see will cost you to watch. Somewhat disappointed with what's available. Example any of the Law & Order shows, Murder She Wrote, Rizzoli & Isles and Red Road. Just to name a few. It seems those with less audience viewership are free. I gather that's why you have the option to add things like Netflix. But do I want to pay for two services just to watch a TV series or movie? Hmmm, I've give a few weeks and see if I need to reconsider which service to go with.", "verified": true, "helpfulness": "0/0", "author": "Mickely \"Mickey\""}, {"rating": 4.0, "review": "Overall a great device, I'm not to fond of the home screen, apps and other items move around based off of what you last used. Its very difficult to repeat the same steps to get to a certain app. Also, the Home menu items always need internet connection. if the internet connection goes out, you can access anything on the home screen.", "verified": true, "helpfulness": "1/1", "author": "Allen C."}, {"rating": 4.0, "review": "I like my fire tv but the stick to control selection did not even last a year before malfunctioning.  Very disappointed in this result.", "verified": true, "helpfulness": "0/0", "author": "Phyllis J Siner"}, {"rating": 4.0, "review": "So far I am enjoying having Amazon fire TV with Amazon Prime. I Really like being able to watch Downton Abbey which was not yet available on Netflix.", "verified": true, "helpfulness": "0/0", "author": "Janet Rees"}, {"rating": 5.0, "review": "So easy to set up and has some really cool features to it. I really love the voice response on the remote. Can't wait to try all of the features!", "verified": true, "helpfulness": "0/0", "author": "Kathleen Noonan"}, {"rating": 1.0, "review": "Had to return it because I couldn't get the British Acorn channel.", "verified": false, "helpfulness": "1/2", "author": "Mark Hogan"}, {"rating": 5.0, "review": "great interface", "verified": true, "helpfulness": "0/0", "author": "charles layne"}, {"rating": 4.0, "review": "Overall great product. Numerous channels, ease of operation, and the ability to restart it if needed makes this a strong competitor to ROKU...but at the end of the day it is not a ROKU.....I own 3 ROKU's and one the Amazon Fire TV sets.....each have their own strengths and weaknesses. If you are new to the streaming world the ROKU is a solid investment. But if you have already gone down that road and are looking for an android based platform that you can add upon, then the Fire TV is your choice.", "verified": true, "helpfulness": "0/0", "author": "Adam Ryley"}]