[{"rating": 2.0, "review": "Unfortunately could not get it to work properly.", "verified": true, "helpfulness": "0/0", "author": "Fadooz"}, {"rating": 5.0, "review": "It's everything I expected. I have 2 of them. To be able to take this little piece of hardware and attach it to a tv and end up with a smart tv versus buying a smart tv.....what a great idea and it saved me a lot of money, that's why I purchased 2.", "verified": true, "helpfulness": "0/0", "author": "LK"}, {"rating": 5.0, "review": "Great product and very cheap!", "verified": true, "helpfulness": "0/0", "author": "Rich"}, {"rating": 4.0, "review": "Much easier to work with than the Roku, though you need your cellphone or tablet as a controller. Can be a bit confusing setting up, but that seems to be an issue with all these Internet TV products.", "verified": true, "helpfulness": "0/0", "author": "R. F."}, {"rating": 5.0, "review": "The chromecast really works and I have no problems with them.It works with my labtop, tablet, and smartphone.", "verified": true, "helpfulness": "0/1", "author": "Tyrone Thomas"}, {"rating": 3.0, "review": "meh", "verified": true, "helpfulness": "0/2", "author": "n j"}, {"rating": 5.0, "review": "Works very well with iPad, iPhone and PC.  Picture is surprisingly sharp with no streaming issues.  The only complaint is the amount of Apps currently available with the product.  Hopefully this changes in e near future.", "verified": true, "helpfulness": "0/0", "author": "Allen A."}, {"rating": 4.0, "review": "Fairly simply to use but I find it a bit of a novelty. Still a bit too finicky for a daily use device. I will be getting a dedicated android HTPC box to replace this which I suspect will be far better. This is great value for the price though.", "verified": true, "helpfulness": "0/0", "author": "mark"}, {"rating": 1.0, "review": "It is bad. Don't buy it", "verified": true, "helpfulness": "0/2", "author": "Paul Truong"}, {"rating": 4.0, "review": "Worked well, but limited apps and occasionally the video and audio were out of sync.", "verified": true, "helpfulness": "0/0", "author": "OC"}]