[{"rating": 3.0, "review": "Chromecast works fine with supported apps like youtube and Netflix. However while stream ok ng videos from other sites there is an audio lag.", "verified": true, "helpfulness": "0/0", "author": "Mugdha"}, {"rating": 5.0, "review": "awesome piece of technology I can recommend anyone to purchase this product its simple to used and easy setup too.", "verified": true, "helpfulness": "0/0", "author": "Josue Hernandez"}, {"rating": 4.0, "review": "The Chromecast is an interesting idea: Stream content to your TV, from the internet, by means of your other devices. This is a pretty good concept except for one issue: it would be ideal if it didn't ALWAYS require another device, IE if it had or you could buy an affordable remote of its own.In terms of execution: The content designed specifically for Chromecast works well: Netflix, Youtube, Pandora, Google Music. I've notice that triggering the Chromecast via my phone works better than from within Chrome on my laptop. However there have been some glitches from each. I like how I can start something on my laptop and then later control it from the phone. A great feature is the ability to stream ANY tab from Chrome. This is a great idea but in practice it is laggy and a worse quality than any of the official content \"apps.\" Finally, the cross compatibility (Android, iOS devices, any computer with chrome) for setup and use is great.Overall the Chromecast is a good idea and provided at an excellent price, I just wish it had more content. The SDK, the thing content developers use to allow chrome casting, is still in limited distribution and I think this is why we haven't seen more apps. If every, or most apps had chromecasting this would be perhaps, THE tv streaming solution due to its price. Until then its another fun Google toy thats 80% complete.", "verified": true, "helpfulness": "1/1", "author": "Jonathan P. Saltzman \"Jon\""}, {"rating": 4.0, "review": "Very easy to use and I could use my cell phone or Galaxy note 8 to control it. Just download the application and connect to wireless you done. Only thing I have problem is you could not return this guy off. you have to either connect it to TV all the time or unplug it.", "verified": true, "helpfulness": "0/0", "author": "tigereast"}, {"rating": 5.0, "review": "For $35 you can't beat this streaming player. The HDMI (1080p) is incredible on Netflix. I could never get this hi-rez on my tablet, probably because it is too slow to handle 1080 data rate. With Chromecast, no stuttering, freezing, or bad syncing of the sound.  It's also nice that you don't have to have a physical connection between the tablet or phone and the HDTV. So far I have only used it for NetFlix, and u-tube. Haven't tried Chrome browser. While it is true that the steaming apps are limited, for $35, I can't complain.Setup was trivially simple with no issues at all. MY HDTV does have a USB port for providing 5V power to the Chromecast so the physical setup was a snap. If you HDTV doesn't have a USB port, a line connected USB port is provided.", "verified": true, "helpfulness": "0/0", "author": "Richard G \"Richard\""}, {"rating": 5.0, "review": "Ordered this with some reservation, however when it arrived, all that went away.  I bought this for a bedroom TV - as my smart TV is downstairs.the hookup was real, real simple - HDMI and USB on the TV - then downloaded the app for my iphone5 (you have to also download the google chrome app) - followed the steeps and BAM - next thing I know I was watching videos and netflix.", "verified": true, "helpfulness": "0/0", "author": "NC10735285"}, {"rating": 3.0, "review": "I'm experiencing issues with casting from Netflix with my Samsung Galaxy Note 2 and Google Support can not fix it.There is no problem casting with my tablet nor my laptop.", "verified": true, "helpfulness": "1/1", "author": "Weber Batista"}, {"rating": 4.0, "review": "Very easy to set up and easy to stream from the Chrome browser. Only downside is that it doesn't do sports very well. Streaming basketball from ESPN is very choppy.", "verified": true, "helpfulness": "0/0", "author": "darryn niebrugge"}, {"rating": 2.0, "review": "Just received the Chromecast.  Once connected I attempted to watch hulu.  The TV is a 55 inch LG, maybe a year old running at 240 Hz.  The hulu show was very jerky on the TV but very smooth on the Chromebook that I am using to drive the Chromecast.  I think there is a bit more work required on the Chromecast.", "verified": true, "helpfulness": "1/1", "author": "JimB"}, {"rating": 3.0, "review": "There are some things that would help make this much nicer.  First off would be to not lock down support of apps.  Let anyone make apps that work with it and it would be the best thing ever!Also, give it a basic browser through the app so users can enter web access credentials or click acceptance policies needed to access certain networks (hotels, coffee shops, hospitals, etc.)", "verified": true, "helpfulness": "0/0", "author": "SPRUNT"}]