[{"rating": 5.0, "review": "Very convenient and quality is excellent.  The problem is that it needs to support more apps.  For instance, it would be great if I could use it to put presentations on a TV or use it to display from my Amazon Instant Video Player.", "verified": true, "helpfulness": "0/0", "author": "Douglas Gray"}, {"rating": 5.0, "review": "Google isn't the only game in town, but they do it right.The packaging was superb; a nice flip-top box akin to what software used to come in. No get-your-industrial-scissors-out-this-plastic-is-indestructable kind of cheapo thing. It looks classy.The device itself is nothing to speak of; it just works. Installation was trivial, and it worked the first time.That's more than I can say for a lot of products. We use this _all_ _the_ _time_. For watching Netflix movies, YouTube videos, even sharing vacation photos with a large group. So do your Netflix browsing from your computer, cast it to the TV, then retire to the couch, where you can control it from your iPod. Pretty sweet.On some family nights we trade off sharing videos we've found during the week, me from my iPod and my son from his Android phone. Without us having to crowd around the computer.Yah, so we're just lazy couch potatoes? Well, maybe, but that's besides the point. This is a great little product, and it works exactly as advertised. 10 stars.", "verified": true, "helpfulness": "0/0", "author": "Steve Thorn"}, {"rating": 2.0, "review": "connected it too three different tvs and watched countless connection videos still never worked.. very disappointing I was looking forward to some binge netflix", "verified": false, "helpfulness": "0/0", "author": "Daja Prince"}, {"rating": 4.0, "review": "If you are looking for something that can be a go-to quick streaming device this is a great buy.  Definitely recommend Chromecast for people who stream Netflix, Hulu, and other subscription based internet providers.", "verified": true, "helpfulness": "0/0", "author": "Zachary Harrell"}, {"rating": 1.0, "review": "We have followed EVERY instruction available and CAN NOT get this to cast anything.  Our equipment is all compatible, my laptop is less than 20 feet away, and GOOGLE announces READY TO CAST on the television.. however, once I hit on the cast box it sends my laptop screen to the television and FAILS within 3 seconds! Connections are perfectly installed without any issues HERE... so conclusion... is this another way for google to be invasive?", "verified": true, "helpfulness": "1/1", "author": "Here In Jersey"}, {"rating": 2.0, "review": "I was excited to try this, having heard so many people talk about it, but it doesn't come close to matching what the Roku can do.  For example, in order for it to work you have to make sure your phone, tablet or PC is constantly connected and on.  So if you are trying to stream Netflix to it via your mobile phone and you decide to leave the house you better hope nobody else at your house is watching it because as soon as you leave the wireless network - poof - it stops.It seemed every unintuitive, and even as an IT geek I found myself trying to figure out just what I was supposed to do.  There are no channels per say, you just have to go find what you want to watch and then tell it to cast it.  This would be very confusing for children or older adults who just want to watch something, not spend all day searching and trying to find the magic button to make it work.I tried it for a week, but then sent it back and ordered two more Roku 3's for my televisions.  Much happier with the Roku setup, and much easier to use!", "verified": true, "helpfulness": "0/0", "author": "Robert Stinnett"}, {"rating": 5.0, "review": "I live in Canada but ordered it through the USA side of Amazon.  Simple to set up, awesome to use .... this is an incredible unit for $30 .. has allowed me to do everything I thought it would, and more. Two thumbs up!!", "verified": true, "helpfulness": "0/0", "author": "Steve Potosky"}, {"rating": 3.0, "review": "+ easy install ( I would say they made it so everyone can do it)+ easy to use, same here, you don't need to be computer savvy- Works with Netflix and most application BUT NOT with Amazon prime as they use a different format for streaming.- So if you're buying this on Amazon, there is a good chance you're a prime member and would like to stream movie content to your TV, well that will NOT work. Hope that Amazon addresses that with Chromcast. Would have given this product 5 stars otherwise due its ease of use.", "verified": true, "helpfulness": "0/0", "author": "Emma N."}, {"rating": 5.0, "review": "Awesome! Does what I've been needing: Netflix and YouTube. I picked this up for $20 and my wife and I use it everyday. YouTube has everything from music, TV shows, movies, how to instructional videos, etc. Search YouTube on your cell, ipad, computer and throw it to the TV with one click.", "verified": true, "helpfulness": "0/0", "author": "John K"}, {"rating": 5.0, "review": "I really liked how easy it was to install and program the Chromecast  HDMI Streaming Player. Works great with multiple components. I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "James M. Murphy"}]