[{"rating": 5.0, "review": "It's a google product.  You know what you are getting when you buy it and it works well. love it", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Nolte"}, {"rating": 5.0, "review": "This product is awesome! We used to have to turn our Xbox or PlayStation on to be able to play videos and all that but now it's just one little thing you use and click and voila! Awesome!", "verified": true, "helpfulness": "0/0", "author": "eena"}, {"rating": 4.0, "review": "Video quality is great when streaming content! I would give it five stars if I could stream videos from Amazon Prime with it...that was the primary reason I purchased Chromecast. I think this is a big miss and hope this is remedied soon.", "verified": true, "helpfulness": "0/0", "author": "Amanda Chancey"}, {"rating": 5.0, "review": "I was not sure what to expect for $35, but this thing works really well.  I love the fact that I can control things like NetFlix or Hulu from my smartphone.  That is especially handy when my kids are watching NetFlix and I am in a different room - I can see how much they have left and push more to the TV if desired, as well as stop the show as well.I've also had success with streaming a tab from chrome to my TV via the chromecast extension.  Note it does not work as well at high resolutions, and in full screen mode, as the voice and video are sometimes not synchronized properly.  I am doing this streaming from my laptop (which is hardwired to my router) to the chromecast device (which obviously is wireless).  I have a wireless N router, so it is as fast as you can get.So bottom line, if your only use for this is to stream video from a chrome tab to your TV, it may not meet you needs.  If you want to use it for things like Netflix, Hulu, YouTube, etc, then it is great.", "verified": true, "helpfulness": "0/0", "author": "Rob M"}, {"rating": 5.0, "review": "I usually stream my Netflix through my gaming device, but this made it easy to stream on a different TV. Now I can watch Netflix in the living room and the bedroom effortlessly. First use was last night and it seemed to work perfect for me.", "verified": true, "helpfulness": "0/0", "author": "Mitch Kamps"}, {"rating": 3.0, "review": "Works as stated.  Very little app support which is frustrating.  Still worth the $35... Any more and I would say not.", "verified": true, "helpfulness": "0/0", "author": "matthew roux"}, {"rating": 3.0, "review": "I like that you can cast to this from chrome however.. I wish that it could do more because when you are using chromecast and casting a video from a website it has a major problem with lageness and the video gets really choppy and skips bad.SOMEONE PLEASE GET XBMC RUNNING ON THIS THING!!!", "verified": true, "helpfulness": "0/0", "author": "Paul D. Estep Jr."}, {"rating": 5.0, "review": "Does exactly what I bought it for and I love it. I use it for listening to music through my Google Play Music Subscription all the time.", "verified": true, "helpfulness": "0/0", "author": "Ezra"}, {"rating": 5.0, "review": "Works and functions as described.  Easy to set-up and allows us to stream the internet on our HDMI TVs!  Thanks!", "verified": true, "helpfulness": "0/0", "author": "Jose Florendo"}, {"rating": 1.0, "review": "I had great expectations for this player but disappointed that there is hardly any content for canadian consumers. Hopefully that will change soon. Otherwise gadget works fine.", "verified": true, "helpfulness": "1/2", "author": "gomez"}]