[{"rating": 5.0, "review": "just as this unit is somewhat a work in progress, so is this review. I don't really see any way to give the product less than five stars for what it offers at this price point.  I have a few 1080p plasma screens that are just fine (along with some current web-enabled models in my media room) For $35.00 this has allowed me to bring some new life and features into some older, but still excellent Panasonic plasma screens that otherwise might not be seeing as much use. I won't get into features here - those are a bit fluid, and also well documented elsewhere - other than to say set up was easy,, connection to my LAN was easy - no issues with pass/encryption, and content that was on the \"menu\" was accessible without concern.  In ?? months, with a little more packed into the firmware, this'll be a real contended for Apple TV, etc, but as it sits, it's still missing some critical things, which I won't belabor, as anyone looking to purchase this will easily see the plusses, minuses, included features, and features that are \"under development.\".Once this is fleshed out, it will be a killer, though.", "verified": true, "helpfulness": "0/0", "author": "Sam Beckett"}, {"rating": 4.0, "review": "It works great for you tube, netflix. The setup is really simply and the definition is really nice. You have to consider that anyone thats using Wifi and netflix/You tube can control the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Francisco Jose Ayala \"fr23\""}, {"rating": 5.0, "review": "looks a litthe like roku but I think the google backing can eventually make much better if you are on the go", "verified": true, "helpfulness": "0/0", "author": "chick"}, {"rating": 4.0, "review": "Kind of a fun device.  If you load the app you can run Netflix or YouTube from you phone or tablet to your TV.  If you use Google Chrome you can project what is on you screen to your TV.  Kind of nice if you have a large screen. This works from your computer, not your phone or table.  You can also project your desktop once you figure out how.  Just open Chrome, then click on the cast button, choose the little down arrow on the right then choose cast desktop.  I assume it will get better in the future as they add more  channels to the app.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this device hoping that it would live up the the 'hype'.  I had another streaming device but found that it was much more labor intensive to get going.  The Google Chromecast was basically plug and play and go!  Loved getting the free trials to Netflix and Hulu.  All in all I highly recommend this product.  My needs are pretty simple and I didn't want to invest a ton to get the results I wanted.  This more than fills the bill.  I use my kindle to control it and it doesn't bother me in the least.  My one complaint is that I wish I could connect to my home network and stream movies that I have saved on my pc's.  From what I've read Google disables any 3rd party software that would give you that ability.  I'm hoping that in the very near future they will offer an upgrade to allow you to stream from your computers.", "verified": true, "helpfulness": "0/0", "author": "Dianne J. Hamilton \"Djaye\""}, {"rating": 1.0, "review": "When I ordered Chromcast is worked with thrid party applications. Between the time I ordered and I recieved my order Google blocked thrid party apps. Seems Google has adopted the proprietary Apple model. There is no Kindel app for Chrome cast. I cannot view photos on my laptop with Windows 7 OS. I cannot view Amazon Prime content with the Chromecast. Most content cannot be viewed on the Chromecast outside the United States, so forget using Chromcast when traveling international. What I thought I ordered was a very useful and flexable gadget for view content from my laptop and Kindel Fire.  After Google blocked the thrid party apps, what I ended up with is an expensive, very limited use gadget.", "verified": true, "helpfulness": "1/5", "author": "Robert Knight"}, {"rating": 4.0, "review": "I do like it and it will be great for watching YouTube on the TV.  I already have Roku so the NetFlix is no benefit to me.  I was really expecting to be able to put what is on Chrome on my iPad / iPhone on the TV but that is not possible at this point.The only way to cast internet content is from a PC/Mac with the Cast extension installed.  There is no Cast extension for mobile devices.Setup was a little problematic.  I have three wireless access points and it would only connect to one (the closest one thankfully) and I kept getting errors trying to connect to the others.I am impressed with the image / video quality so far.", "verified": true, "helpfulness": "0/2", "author": "Bill B in Atlanta"}, {"rating": 4.0, "review": "I owned a Logitech Revue for almost two years and barely used it. I liked the idea, but the device just never met the initial promise. The Chromecast works great. Open Youtube or Netflix or Play Music and it effortlessly starts playing on the television. I've gotten more use out of this $35 device in a couple of months than I did out of the $100 Revue in almost two years. It's already pretty great and it can only get better.", "verified": true, "helpfulness": "0/0", "author": "AndroidGoat"}, {"rating": 5.0, "review": "So here's the common question I hear from people. Because you control it using the Netflix-App & Youtube-app on your phone, does that mean it's streaming from your phone?The answer is \"No.\" It has no effect on your phone's battery life. To test this, I started a netflix movie then removed the battery from my phone so I know it's definitely off. The movie ran to completion then chromecast sat there waiting for the next command. So, the phone is simply the remote-control. That is all. Once you start the youtube/netflix video, you can throw your phone into a blazing inferno and it has nothing to do with what the chromecast is doing. The nextflix & youtube app are inside the chromecast, the UI is on your phone.", "verified": true, "helpfulness": "0/0", "author": "Anime4uAndME"}, {"rating": 2.0, "review": "I purchased this after reading all the great reviews and although I knew it had limited apps., the ability to stream wireless from my laptop to the TV was top priority. Should have read the comments re: Chrome having it's own DNS address. I subscribe to streaming services, but living in Canada, had hoped to be able to access some American content, which is far superior to ours. Chrome does not allow blockers. This was a disappointment.Also the video quality was not a good as expected. What played on my laptop and what was projected on my TV was much lower quality. Had I known, would have invested, the extra money on Roku or other similar systems which at least gave me more programs.", "verified": true, "helpfulness": "0/1", "author": "Ben"}]