[{"rating": 5.0, "review": "For only $35 this little gadget is perfect for streaming movies from Netflix and videos from YouTube. I wish there were more apps available to use with it though- not just Netflix + YouTube. There is a little lag time when streaming from your device to the TV but not bad at all. Picture quality is perfect. Set up was very easy. Would definitely recommend buying this if you don't have another way of streaming.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Brigham"}, {"rating": 3.0, "review": "Good streaming from youtube...browser is still hanging....all and good start! Imeadiashare sw was free and rendered similar qualify for streaming.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "This product is amazing.  I have a Roku ($70) and the Chromecast for $35 is very cost effective for a second tv.  Easy to install and setup.  The Roku has many more channels of which I really don't watch so the Chromecast is quite acceptable.  The only drawback I see is that the item does stick out from your HDMI input and can be bumped (my inquisitive cat).  If you use a short HDMI extender that will solve the problem.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 4.0, "review": "We purchased this after reading reviews.  Had a few problems installing at 1st as the setup wanted me to change router settings.  After researching I was able to get the device to work without changing any settings on my Linksys router which is on the supported router list from Google.  It is somewhat limited as to what you can stream, especially from Kindle devices. We have streamed from smart phones as well and it works.", "verified": true, "helpfulness": "0/0", "author": "Steve Larson"}, {"rating": 1.0, "review": "My rating is solely based on the fact that the Chromecast does exactly what it says it does, which is to say, and it does nothing more. My one hope for it was to stream Amazon Instant Video, which it doesn't do.What it doesn't at all say in the product description or included documentation is that THE CHROME EXTENSION REQUIRED TO CAST A SINGLE TAB DOESN'T WORK WITH ANDROID. Really? The ability to stream video from random websites is its strength, and to be able to use your device as a remote. However, it doesn't work with Google's own OS. Imagine that. That gross oversight is one thing. That it isn't documented anywhere in the immediate product notes is clearly intentional.It takes a bit of fuss to set it up and install the app on your device. All depending on your network connection, it streams a bit slower, or in some cases jerkily.In all, Chromecast is lose-lose for me. For my purposes, Roku is a better streaming solution.", "verified": true, "helpfulness": "0/0", "author": "S. K. Harrell"}, {"rating": 5.0, "review": "Arrived promptly and in good shape.  It does the job I needed it for.  The item looks to be of good quality materials.  Would buy again ...", "verified": true, "helpfulness": "0/0", "author": "DrRuth"}, {"rating": 5.0, "review": "I really love this product. I liked it so much that I bought a second one for our other TV.  Its lots of fun", "verified": true, "helpfulness": "0/1", "author": "Heather Ruff"}, {"rating": 1.0, "review": "This took so long to down load everything it said was needed to make it work that I finally gave up and have not tried to use it since. Also and I am not sure if this is the reason but my sound board blew on my TV after the down loads leaving me with out audio. Now I am not sure if I want to try it again.", "verified": true, "helpfulness": "1/1", "author": "rieksr"}, {"rating": 4.0, "review": "It works well enough for what it does. Setup is trivial, all you really need to do is plug it in and follow the on screen directions to connect to wi-fi and register the device so it can be found for streaming. It must be on the same local network as whatever device you stream from to work. It's sensitive to Wi-Fi strength and needs to be close to the Wi-Fi router. There is no RJ-45 ethernet option. It plugs into a HDMI port on the TV but only supports resolution of 480 and 720 so it's not true HD. Since DVD is only 720 anyway it's OK for that, but 1080 sources like BlueRay rips lose some of their video quality.It's powered via a micro USB port. Since my TV has a USB port for memory sticks, I use that to reduce cable clutter. It also has a little AC adapter power supply, which offers the advantage of allowing use of HDMI-CEC. That allows Chromecast to turn on and switch inputs on the TV when you begin streaming automagically, given the TV supports HDMI-CEC. If you use the TV USB port, it's not powered when the TV is off and the magic doesn't work.It has some limitations in that it will not stream local content directly out of the box. Since I have NAS running a web accessible media server I can browse to my Twonky server and stream whatever's there with the Chrome browser. Firefox, IE and other browsers aren't supported. That way anything you've ripped from DVD or downloaded elsewhere can be sent to the TV no prb. The iOS app won't allow streaming of itunes content, which I found odd. No Airplay support either, which is a shame. I think the self imposed limitation was probably added to mollify content owners who hate the idea of a universal streaming device.But for just $35 it is a bargain and requires no physical connection to the device it streams from. It's great for shooting YouTube, Netflix and Hulu Plus content to the TV, but is somewhat limited in the apps it supports. Roku and even Apple TV support much more, but are more expensive and require more space and cables. A current list can be found here: [...]", "verified": false, "helpfulness": "0/0", "author": "SonnyB"}, {"rating": 4.0, "review": "Purchased for my daughter as a xmas gift and she loved it!this was a great suggestion for the person who has everything.", "verified": true, "helpfulness": "0/0", "author": "Yvette Nevarez"}]