[{"rating": 5.0, "review": "It's hard to imagine this thing was only $35.  It's amazing!  My living room was always setup for home theater use, so adding it there just made sense and it works great.  I primarily use it with Plex & Netflix and it works awesome!  After using it for a few days in there, I bought another one for use in the bedroom.  Now I can get all my movies in there as well easier than using my DVD's apps.  Thinking about buying one more for the upstairs/loft TV room for the kids...", "verified": true, "helpfulness": "0/0", "author": "Music Demigod"}, {"rating": 4.0, "review": "Mine is now installed and working just fine. Quality is excellent, provided your wifi speed is good. It comes with almost no instructions, so it can be a bit hard to figure out. I ended up calling customer support, and they told me one or two things that solved the problem. If you are really tech savvy, it probably won't be an issue. Cool to watch Netflix on an older gen flat screen, controlled by your iPhone.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 3.0, "review": "I purchased a Chromecast for our home to use in the living room. When the product is able to connect to the Wifi network, it works exactly as expected and is a great, cheap way to stream content from many different devices. I ran have run into many issues however with getting the Chromecast to pick up a strong signal from my router. I have tried two different routers, both being different brands. It may be an issue with my house and interference from other devices, although all of my other wireless devices have no trouble connecting in this location. If you are going to purchase this product, I would urge you to check that you have ample reception in the area you plan to use it.", "verified": true, "helpfulness": "0/0", "author": "Michael Weitekamp"}, {"rating": 3.0, "review": "Simply put, this is a device that lets you watch in your TV some of the content of your PC/smartphone/tablet.  While it does exactly that, the versatility is its weak point.  Not all of the things you would like to sync can be seen and suddenly the Chromecast fever fades away in a couple of days/weeks.", "verified": true, "helpfulness": "0/0", "author": "Esteban Vega Calvo \"Pura Vida\""}, {"rating": 4.0, "review": "great product for Netflix streaming. too bad that I cant stream Amazon instant video. Its a good device for traveling.", "verified": true, "helpfulness": "0/0", "author": "tonmilv"}, {"rating": 5.0, "review": "I wanted to cast websites and the Google Cast plug-in made that happen very easy. Very Happy with my Purchase.", "verified": true, "helpfulness": "0/0", "author": "Aaron KoRn"}, {"rating": 5.0, "review": "Cool little device for streaming stuff to TV or even projector. I was able to project using, ipad, galaxy s4, and laptops to my TV and even Benq projector.", "verified": true, "helpfulness": "0/0", "author": "Raj"}, {"rating": 2.0, "review": "I wasn't aware before l purchased it that my wireless router was too old and didn't meet the minimum requirement. So I haven't been able to use it.", "verified": true, "helpfulness": "1/2", "author": "Ken Bachman"}, {"rating": 1.0, "review": "Seems to be temperamental with when it wants to stream quality video. Often lags even on a secure high speed connection. Would be more useful if it also streamed everything else on computer screen and not just video. I am sticking with the old fashioned VGA cable and wireless mouse for now.", "verified": true, "helpfulness": "1/2", "author": "Leea V Allen"}, {"rating": 5.0, "review": "I got tired of being screwed by direct tv so now I streaming Netflix from my smart phone and I wont look back", "verified": true, "helpfulness": "0/0", "author": "greg carter"}]