[{"rating": 3.0, "review": "Utilized free trial to try amazon fire.  We loved small size of box and easy use of system however after about 3 weeks the remote stopped working.  We tried all troubleshooting suggestions but still didnt work so sent back", "verified": true, "helpfulness": "0/1", "author": "Birdlady1"}, {"rating": 4.0, "review": "Works fine and well built, so that's not the issue. I think the movies are awesome (51 yr old Dad), but my kids say that the TV shows and movies for them (teenagers) are better on Netflix", "verified": true, "helpfulness": "0/0", "author": "J Rusty Shaffer"}, {"rating": 5.0, "review": "I can't believe how much of a game (not gaming, although it does that too) changer this device is!  I am talking about streaming movies and tv, it does better than anything I COULD HAVE EVER imagined!  It met my expectations and EXCEEDED them GREATLY!  I have read all the reviews and was on the fence about getting one for months now.  I am so SORRY I didn't order one sooner.  (I have only had it in my home for an HOUR now).  I can't believe what a GREAT job AMAZON did on this device, WISH I COULD AFFORD THE PHONE, IT MUST BE OUTSTANDING.  In time maybe.If you are trying to decide on getting this or not, I am ready to do away with cable and my TIVO and just have this, I do have an Amazon Prime account and will probably get other streaming services added soon.  I can't believe how quickly this loads shows, pause and fast forward work like watching a dvd or better.  Not to mention all the other abilities (I have not even begun to check out yet).I already decided I a buying another for my bedroom TV, which I was using my Laptop connected to TV to stream Prime movies, this is even easier and quicker than that.  I can't give you enough information on how good this is.  NO AMAZON DID NOT PAY ME ANYTHING FOR THIS REVIEW.  WISH THAT COULD, BUT, NOW THIS IS MY OWN DOING.  AND THIS SHOWS HOW MUCH I LOVE THIS DEVICE.If your thinking about getting one, JUST ORDER IT!  You won't be sorry.  Easy set up, took all of 3 to 4 mins, if that.  That is including the time to remove it from the UPS packaging as well.  I am so happy with my purchase!!!!!!!!!!!!!!!!!!!!!!!", "verified": true, "helpfulness": "1/1", "author": "Stuart Bryant \"Stu B\""}, {"rating": 4.0, "review": "The key app missing for me is MLB Premium TV, but I expect that's coming.  Like the product other than that, particularly the way it synchronizes with my Amazon account and Kindle Fire.", "verified": true, "helpfulness": "0/0", "author": "Howard"}, {"rating": 5.0, "review": "Bought this after we decided to cancel our cable service and just use this to access our Netflix and AmazonTv. It's easy to use and works great. Recommend this to everyone!!!", "verified": true, "helpfulness": "0/0", "author": "Oana Daragjati"}, {"rating": 4.0, "review": "Powerful and fast but having issue with remotes voice recognition. Working with amazon to fix. Could be just a hardware issue with remote or software glitch on Amazon's end.", "verified": true, "helpfulness": "0/0", "author": "J. Kabler"}, {"rating": 2.0, "review": "Are you so lazy you have to talk instead of moving your thumb to change what you are watching?  Amazon Prime video is expensive and a waste of time, it does not have enough selections to warrant the expense.  I bought a Roku 2 years ago and it works just fie,  Netlix is 7.99 a month and it has enough.  When we become so attached to games and off beat videos it is time to trash your TV, you have officially become an idiot.  We changed our cable to basic cable, just the major channels so we can watch the news, Being a child of the 50's it seems insulting to pay to watch TV.  I watch what I like on Netlix.  I only watch a fee select shows.  When my Prime membership is over I wll not be renewing ir, it is not worth it. I do not purchase enough to make it worthwhile.  Even  my kids do not have television anything they want to watch they can see on their computers, they do not want their children watching the idiot box.  My husband watched 2 international channels (Filipino) and I can get his favorite show for free on my computer.  Once in a blue moon I will buy a DVD of a critically acclaimed movie or documentary that is basically the only time our TV is on for more than one hour.  IS your TV in the living located in a central point so all can be amused?  Is there a TV in each bedroom?  If so, you are officially stupid and you are not doing your kids a favor.  Buy a book, get them a Kindle reader..  When was the last time you had a family conversation uninterrupted by the idiot box?  When have you played a game with your kids, or checked their homework?  Do you even know what is going on in their lives because you are transfixed by your favorite TV program?  Get out of the mindset that you need constant amusement, get a life and a clue.  Kids nowadays are dumber than they were 40 years ago and the American family is falling apart because they lost the fine art of conversation and socialization.", "verified": false, "helpfulness": "1/16", "author": "Diana Mendoza \"NanaDiana\""}, {"rating": 5.0, "review": "After careful study and review, I purchased Amazon Fire TV to replace the streaming device I had been using for several years.  I could not be more pleased with this purchase.The voice search feature is phenomenal.  I put it thru some paces by \"voicing\" different titles and names, some of which I are more difficult to pronounce than others.  It worked every time, the first time.There are quite a number of apps that are already available, I have downloaded a few and will be adding more as time goes on.Using Fire TV to view personal photos (that I stored in Amazon Cloud) is amazing.  There is no loss of resolution, even viewing them on my 42\" flat screen.Picture quality while streaming is very sharp, it took me by surprise just how much better the quality was over my previous device.I'm looking forward to my continued enjoyment of the Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "S. Taves"}, {"rating": 5.0, "review": "Amazing fast streaming. Easy to uses. Would recommend it to friends and family. Defiantly a product worth buying if your an Amazon fan.", "verified": true, "helpfulness": "0/0", "author": "james f becerra"}, {"rating": 5.0, "review": "I got a Roku 3 and of course about 4 days later Amazon introduces Fire TV. I have another TV in the back room so I ordered it for that. I use the Roku 3 more of course, because it's on my main TV, but both devices are excellent. The Fire is a little bit faster loading and the menu is setup a little different which takes some minor getting used to. The big plus is the voice command. That is a very cool option. If I could only have one of them I'd probably go with the Fire, because it's a bit faster, has voice command, and I've been an Amazon customer for a long time and I just like doing business with them. There are other things to consider that i'm not that farmiliar with such as private channels you can get through other websites for Roku not sure how that works with Fire. So that is something to consider. Like both, gonna keep both and if you have 2 TV's you wanna cut your cable or satelite from these things pay for themselves quickly.", "verified": true, "helpfulness": "0/0", "author": "Scott Braddy"}]