[{"rating": 1.0, "review": "Purchased two of these things, now I'm not the brightest bulb but I can swap a mother board and reformat a HD, so how hard can this be? Maybe I'm just getting old but in 2014 the thing should be like a refrigerator, plug it in and it works, not with these things, sorry,but if I had been able to get a human to help me with it I might be telling a different story. Anyway everyone else seems to have no trouble so what the hell do I know, maybe it's Win8,  or my HP PC, or the two year old Vizio. All I wanted to do was get Netflix to showon my TV, instead I got a 28\" Hanns•G monitor and now \"House of Cards\" plays just great.", "verified": true, "helpfulness": "1/1", "author": "J. Scott-Monck \"Tool Fool\""}, {"rating": 4.0, "review": "The chromecast works well. The only issue I have is that it has very limited apps that it can cast to the tv.", "verified": true, "helpfulness": "0/0", "author": "Wirianto Wong"}, {"rating": 1.0, "review": "such slow streams, prefer computer, only worth it for netflix...which i don't have...stupid! should be more versatile...very dissapointed in google", "verified": true, "helpfulness": "1/1", "author": "Liz"}, {"rating": 1.0, "review": "after an hour with tech support Roku referred me to my internet provider after first telling me that their network was having problems...for 3 days?, I asked.not very helpful, and the product in my case just isn't reliable.", "verified": true, "helpfulness": "1/1", "author": "Will \"Will\""}, {"rating": 5.0, "review": "The Chromecast was ridiculously easy to set up. I was streaming shows from my iPad to my TV in under 10 minutes.  The picture is great and I would definitely recommend this to anyone looking for an inexpensive way to stream shows/movies/youtube from your device to your tv.", "verified": true, "helpfulness": "0/0", "author": "Joseph Clark"}, {"rating": 5.0, "review": "You should buy one. Great for when your traveling. Really comes in handy when your videos are on a phone or tablet and you want to watch them on the big screen.", "verified": true, "helpfulness": "0/0", "author": "ORANGE AND GREEN"}, {"rating": 2.0, "review": "I would like to hear from anyone who feels Chromecast is even close to a Roku.  No need for me to reiterate the differences as there are numerous reviews already.  Now that a Roku Stick is out, if anyone want to buy my Chromecast, contact me.", "verified": true, "helpfulness": "0/0", "author": "Johnny GP \"JohnnyGP\""}, {"rating": 1.0, "review": "I bought this at best buy. I brought it home and hooked it up. I got to the first page and it stopped. I could not proceed after tryingfor an hour .I than called the google help line, the first thing they asked was do you have any other wi-fi item in the house or do I have a friend that could come over with theirs.I said no.they said this was a must because if you only have a desk top computer in your home and no other item that has wi fi you cannot set it up. I took it back to best buy and asked them if they knew this and they said no they did not know that and apoligized for all the trouble i went through.  Regards  Robert", "verified": false, "helpfulness": "1/1", "author": "Finders6 \"Robert\""}, {"rating": 5.0, "review": "I love the anime and this one let me see all i want using chromecast tab casting. I love it!Inexpensive.Supported apps work well.Chrome tab casting is very useful.Easy setup.Compact design.", "verified": true, "helpfulness": "0/0", "author": "Alejo"}, {"rating": 5.0, "review": "got to me fast. was easy to set up. i'm a little confused on it, but i haven't really gotten into it much yet. seems easy and definitely affordable!", "verified": true, "helpfulness": "0/0", "author": "Nina B. Gettes \"squintz\""}]