[{"rating": 5.0, "review": "This little device is seriously one of the coolest things I own. The interface is incredibly easy to navigate, the app works great, and when they add the ability to push HBO GO and Hulu Plus through the dongle it will be my favorite possession by a mile. Could not be a bigger fan of this, absolutely recommend this to everyone", "verified": true, "helpfulness": "0/0", "author": "M. Zambrzuski \"I Love Big Oil\""}, {"rating": 2.0, "review": "Google needs to do a little more work on this before I would consider it a good purchase.  The music ap doesn't work.  It starts to play but then drops out.  The movie ap works, but the quality sucks.  I haven't tried netflix or youtube.  I thought this device would stream directly from the phone or tablet, but it doesn't.  It only uses the phone/tablet as a psuedo remote and then it streams directly from the source (i.e. google play, netflix, youtube).  If you were planning on playing movies from your tablet or phone on your television as was I, stick to the cable for now.", "verified": true, "helpfulness": "0/0", "author": "SB"}, {"rating": 5.0, "review": "While there are many devices that allow you to watch both Youtube and Netflix on the big screen, finding and selecting videos to watch always left a lot to be desired.No more! I can now use the ultimate device to find videos and play them on whichever big screen is graced by a ChromeCast.  I've been watching more internet streamed video than ever before.  ChromeCast also lets me play music from Google Play from my phone or tablet directly on the stereo (this is where I have ChromeCast plugged in)As a bonus, ChromeCast automatically switches the selected input to itself whenever you start to play something so you don't have to look for the remote as long as the TV is on.  Perhaps in a future update, it will also be able to turn the TV on and off.  I'll be buying more of these for friends and family.", "verified": true, "helpfulness": "0/0", "author": "J. Greefkes"}, {"rating": 5.0, "review": "Soon to be cutting the cable bindings and paying for the bundled junk I do not want... If your home has WiFi and your TV has a USB AND HDMI port... this is an easy one. Buy It Today... $35 is a give away price for this amazing device.", "verified": true, "helpfulness": "0/0", "author": "Old School Rider"}, {"rating": 5.0, "review": "I am absolutely, unabashedly in love with this little gadget. I've played around with streaming devices of various types, including the usual suspects of SmartTVs, AppleTV, Rokus, the Xbox360 and more traditional HTPCs. And for me, the Chromecast is far and away the ideal means of implementing the core abstraction of \"Use TV to display content\". I know you can read this caveat in any of the thousands of other reviews, but I'll say it again here; this is -not- just a cheaper version of an AppleTV, or a Roku. It is not optimized for streaming local content (though it is possible). It is not capable of displaying content from any source. It is not even a finished product; the software is still under development, so don't expect the Apple polish and shine. If you are expecting any of these qualities, you WILL BE DISAPPOINTED.But, if you forget about all of that, what you get is a supreme interface for using the devices you already own (your iPad, your smart phone, your laptop) to transfer media (specifically, Netflix and Youtube) to a larger screen, effortlessly.SURE, BUT WHY IS IT BETTER THAN OTHER STREAMING DEVICES?If you've used any other TV media devices before, you know how much the interfaces suck. Frequently, they are constrained by the requirement of an input device (usually a remote with a handful of buttons, or a controller for a game console). Searching is reduced to using a directional pad to painfully select each key from a keyboard, or a tiny keyboard on the back of the remote itself. Remotes work just fine for channel-based TV, where all you need are rockers to surf. But when dealing with internet based content, searching and interaction becomes so much more crucial, and the transition to that kind of paradigm, without the appropriate shift in input devices, yields a profoundly frustrating user experience. The genius of the Chromecast is that it doesn't try to reinvent the user interface, or the input device. Instead, you use the same interfaces you're used to, that have been developed and optimized for this kind of media; the websites themselves if you're using your laptop, or the various apps on a phone/tablet. Once you've selected your media on one of these devices, the Chromecast takes your selection and broadcasts it to the screen. No booting up SmartTV apps, no syncing input device and streaming device. It detects what you're trying to view, boots up the appropriate software, and begins streaming the content. It really is a thing of beauty. And on top of that, once the streaming begins, your device is free. It's not doing the work of streaming; just pointing the Chromecast at the target media, and letting it run. So no battery drain and no 'lockdown' of the device.This is the epitome of good user interface design. Clean, pure and simple. No menus to navigate, no apps to load. The software is doing all of the work for you, and I truly hope that this is where the future of 'The Screen' is headed; use any device to select media and display it on any screen with zero effort.", "verified": true, "helpfulness": "1/1", "author": "Derek"}, {"rating": 5.0, "review": "worth the wait.  great product for really cheap price.  brought it on my vacation and it is my instance movie center.", "verified": true, "helpfulness": "0/0", "author": "val balaton"}, {"rating": 1.0, "review": "This thing DOES NOT work in my country! They never said this. Is Google so fragile financially that they need to pick pocket my $30??????", "verified": true, "helpfulness": "0/6", "author": "Andres Pochat"}, {"rating": 5.0, "review": "With extensions on chrome, it is really flawless. Uses TV volume.Netflix, you tube are naturals. Other tabs show flawlessly too.Good product. Well priced.", "verified": true, "helpfulness": "1/1", "author": "MR"}, {"rating": 3.0, "review": "Works great with my daughter's chromebook.  She can cast anything that is on her screen.  From an iPad it is limited to YouTube and Netflix.  On the iPad there is no control to pause the Netflix movie.", "verified": true, "helpfulness": "0/0", "author": "John Kelsey \"John K.\""}, {"rating": 5.0, "review": "This is the perfect device for house parties or get-togethers.  We have this plugged into our television, so when friends are over, we can create our own custom playlists of items from YouTube or easily search Netflix for a movie to watch.Currently, all this can really do is connect to YouTube and Netflix, but for $35 the Chromecast is well worth the purchase.", "verified": true, "helpfulness": "0/0", "author": "Alex"}]