[{"rating": 5.0, "review": "I bought this for my mother, who just dropped cable and was stuck with a rabbit-ear antenna and 4 channels.  Setup was super easy and quick, and it was easy to show my mother how to use it.  She can easily cast Netflix and YouTube from her phone, as well as a Chrome Tab from her laptop.Just in case you were worried, it is possible to use a ChromeCast on a Linux machine.  You have to use the Chromium browser, and install the ChromeCast extension the same as you would with a Windows machine.  It worked perfect for her!", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 4.0, "review": "I love this little guy. So much so that I ordered about 6 of them for Christmas presents last year. I had to show some how to use it, but it seems to fit many of their needs.I gave it 4 stars because it is a little difficult to get to play from my media server (dedicated movie server). I can do it from a computer but on my phone nothing seems to work yet (I'm still digging).", "verified": true, "helpfulness": "0/0", "author": "Justin \"67comet\""}, {"rating": 5.0, "review": "My tv doesnt have an HDMI port so remember to look before you order this. But I have another tiny tv in the apartment that me and my boyfriend use to stream our netflix. Easy to do, easy to use. Only thing thats annoying would be changing the Wifi for the chomecast player because we didn't know where to find it ( chromecast.com ). Can't complain though, love it. Cheap and nice to watch tv with the friends if you can't afford cable", "verified": true, "helpfulness": "0/0", "author": "Katarina Habelmann"}, {"rating": 5.0, "review": "I'm enjoying my Chromecast immensely. It's particularly entertaining when my boys are watching a guy flick in one room, and from my smart phone one room over, I can switch the show to say, My Little Pony. The reaction is priceless.", "verified": true, "helpfulness": "1/1", "author": "Christine Bodnovits"}, {"rating": 5.0, "review": "Works great! But I can't seem to get Amazon Prime to work on it..", "verified": true, "helpfulness": "0/0", "author": "Carlos A. Paez"}, {"rating": 1.0, "review": "I just couldn't find a use for this.", "verified": true, "helpfulness": "0/4", "author": "Steve White"}, {"rating": 5.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "unrucoloco"}, {"rating": 1.0, "review": "When I received my package, the seal was broken on the box and all of the contents was there except for the actual chrome cast USB... not much use to me. If you want to spend $30 on nothing, buy this product!", "verified": true, "helpfulness": "0/1", "author": "Shea Colbert"}, {"rating": 5.0, "review": "If you do not use apple TV, or do not own any smart TV... then this is a good solution to stream off your devices.", "verified": true, "helpfulness": "0/1", "author": "Petros Dermetzis"}, {"rating": 5.0, "review": "It was a gift for mom, she loves it", "verified": true, "helpfulness": "0/0", "author": "Luis"}]