[{"rating": 2.0, "review": "Only works for Hulu, Netflix & YouTube.I cannot stream any movies, home videos or pictures from any other device.It did not work to watch amazon videos or a PBS broadcast streaming from my PC.It did not work with most of wifi unless is completely open.It did not work with several type of routers I tried, most of the times you have to reconfigure the router which, sometimes may no be possible to do.It's going back!", "verified": true, "helpfulness": "0/0", "author": "Jose Goncalves"}, {"rating": 4.0, "review": "I picked up the chromecast because it is the cheapest/easiest way to get netflix on the extra tv in my bedroom. So far it has worked flawlessly. Its main advantages is using your phone/tablet to control it, and having netflix/hulu in 1 place.The downside is the available channels to watch. When more channels get added, it will be great. There are a number already added, but mainly things i will never watch. If you are only wanting to watch netflix and hulu, it is great.", "verified": true, "helpfulness": "0/1", "author": "C.Will"}, {"rating": 5.0, "review": "Have a HDTV but not a \"Smart\" one? This is a neat little tool that uses your wireless network to stream to you TV. demo it with my smart phone and laptop. Works great and cost a lot less than an internet HDTV.", "verified": true, "helpfulness": "0/0", "author": "rwe"}, {"rating": 5.0, "review": "There are already so many ways to play netflix & youtube on your TV but this has become my go-to. It's easy to set up on your wireless network and easy to get your phone to start communicating with it. I even bought one for a family member for Christmas and one for work so we can share useful videos during meetings without having to bring our laptops in.", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 1.0, "review": "That internet is required for the chromecast to do anything. As of now there is absolutely nothing i can cast without internet. My only reason for not sending this back is because when the chromecast sdk comes out there are developers that will make it possible to stream over wifi with no internet.", "verified": true, "helpfulness": "1/3", "author": "inteprid"}, {"rating": 2.0, "review": "As an iPhone user who already owns a smart TV, I found Chromecast to be useless.  The only streamable apps available through the Chromecast app are Netflix and Youtube, both of which my TV (and my blu-ray player, for that matter) can already stream on their own.  Value added: Zero.Where is the ability to cast my phone's screen onto the TV?  Where is the integration with the iPhone's native Photo Album and Video Album?  These are egregious omissions on the part of Google for which there can be no excuse.  It has the feel of a deliberately underdeveloped beta product.  (Could it be that Apple has somehow purposefully blocked this?  If so, shame on Apple.  It's not like I'm about to go running out to buy an \"Apple TV\" over this.)  Clearly the \"casting\" technology is mature enough to sell on the open market; what is lacking is the software to make sensible use of this great technology.The only reason I am giving this two stars instead of one is that I'm holding out hope that Google will write updates to its app to include more services -- and I'm not talking about the other paid services like Hulu, Vudu, etc. that it offers to Android users.  I'm talking about the ability to stream free, commonly used apps like the Chrome browser, Photos, or Videos.  I can get all that other \"commercial\" stuff already via Roku, TV apps, and blu-ray apps.What I wanted out of Chromecast was a solid, versatile interface between my mobile devices and my TV, without having to buy an \"Apple TV\".  Google was almost there with Chromecast, they just need to finish developing it so that it will actually DO that.I can't recommend this product as-is to iPhone users.  If what you want is a Netflix and Youtube streaming box, I recommend you pass this up and instead buy a cheap blu-ray player that has web apps for about the same price. That way you'll get the bonus of being able to play discs too.  Do the world a favor and make Google finish developing Chromecast, before you put any more money into their pockets buying a half-finished product.", "verified": true, "helpfulness": "0/1", "author": "J. Rousse"}, {"rating": 5.0, "review": "Very simple to set up and easy to use. However, do not be misled by the commercial so that you think there is no wire at all. Yes, Chromecast needs power to work, and you can use the USB cable (included in the box) to power it up, or use the power adapter (included in the box) to power it up. The communication between your mobile device and your HDTV is through your WIFI network.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Zheng"}, {"rating": 4.0, "review": "Easy setup, Netflix and tab mirroring is great.  Waiting for more apps to support it, and also playing local content.", "verified": true, "helpfulness": "0/0", "author": "Colin Mah"}, {"rating": 3.0, "review": "Good idea but limited applications so far.  Maybe more are on the horizon.  Yes, I'd buy again and use it on another TV.", "verified": true, "helpfulness": "0/0", "author": "Edward M Smith"}, {"rating": 5.0, "review": "Amazing functionality with a simple interface. Sets up in minutes and allows you to put anything from Chrome into your TV from your PC. Limited Functionality on Apple products as Apple has a competing device that costs more.", "verified": true, "helpfulness": "0/0", "author": "Marshall Lohrenz"}]