[{"rating": 5.0, "review": "I was skeptical at first, but now I'm a true believer. This is amazing!  We love to stream from YouTube.", "verified": true, "helpfulness": "0/0", "author": "Monnie"}, {"rating": 4.0, "review": "Was Good!!", "verified": true, "helpfulness": "0/0", "author": "Javier Plateros"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Diego Rodriguez"}, {"rating": 5.0, "review": "What a great product.  Simple.  I didn't realize that the USB had to be plugged in for it to be powered, as all the pictures just show the HDMI dongle.  That was a surprise but I found a way. We use this all the time to run video from the many devices in our house to our big screen.", "verified": true, "helpfulness": "0/0", "author": "Paul Webster"}, {"rating": 4.0, "review": "the only thing stopping me from giving 5star is that sometimes this will not work, but hey, it's technology right?! worry not, this works 90% of the time. I love this device so much, I hope more things can be streamed with this gem.", "verified": true, "helpfulness": "0/0", "author": "Christian X"}, {"rating": 5.0, "review": "So cheap and easy to use. I even bought one for my mom who has major issues with technologies and is able to use chromecast on her own.", "verified": true, "helpfulness": "0/0", "author": "Mel D"}, {"rating": 5.0, "review": "Everyone needs to own this. Seriously.", "verified": true, "helpfulness": "0/0", "author": "Charlie T"}, {"rating": 1.0, "review": "lasted a few months.  now I have a red light and its not recognized by the tv.  Even the month I had it, I didn't find it very useful.  Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Alex R"}, {"rating": 5.0, "review": "With all the new apps out there for streaming from PC-to-TV, the Chromecast is worth every penny and then some. Perfect for streaming Youtube videos, local video files (when using the right apps), and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Sam"}, {"rating": 4.0, "review": "used it for a week then bought a smart TV. Took a bit to find the MAC address, I filter my router.", "verified": true, "helpfulness": "0/1", "author": "Bedrock"}]