[{"rating": 5.0, "review": "I purchased this device knowing very little about streaming media players.  I am happy I choose this product.  It is very easy to setup and use with my many different devices.  I have used this to stream videos from my desktop computer in my upstairs office to my TV downstairs.  I did have to upgrade my wireless router to a N router because I was getting a choppy signal.  I also use my laptop, my iPad, and my iPhone to stream various web videos.  The apps are free and easy to use.  Overall, I'm very happy with this device as my first streaming media player.", "verified": true, "helpfulness": "0/0", "author": "NAte"}, {"rating": 2.0, "review": "there is a lag between tablet and TV. I really need more experience, I am tech savvy, but WOULD NOT install in my parents home, they would never use it, or, I would be on the phone troubleshooting a couple times each week. seams to need a bit of troubleshooting each time I use it.", "verified": true, "helpfulness": "0/0", "author": "TonyS"}, {"rating": 5.0, "review": "And this product is fantastic!! Older television, wall mounted, the directions are perfectly clear and even I could figure out how to use it. I am a huge fan now, and recommend this to anyone. You don't have to be a genius to connect!", "verified": true, "helpfulness": "0/0", "author": "Mimi Champlin"}, {"rating": 2.0, "review": "My tv already did pretty much everything this does and my phone's Chrome browser, a recent Samsung Mega, wasn't compatible. So it worked and it eliminated cables but I didn't need them before. And I just couldn't use it when I really wanted it. I couldn't display photos from my phone, none of the album programs were compatible, and as I said, nothing from the browser. The all inclusive family of Google purposely miss leads us to think it will do more than it can and when you complain they say, \"Oh, you mean you didn't read that fine print.? Your bad!\"", "verified": true, "helpfulness": "1/1", "author": "UD \"dlookup\""}, {"rating": 5.0, "review": "I use this everyday in my room as I dont have a cable box. Use it to stream HBO go, Netflix, or just youtube videos. Great product at a great price.", "verified": true, "helpfulness": "0/0", "author": "jorge \"G\""}, {"rating": 1.0, "review": "Doesn't work with att uverse.  I bought a chromecast device 5 months ago and was excited about it.  It seemed like an easy setup,  just plug in and go but that's not the case with u verse. They use a 2 wire router that's incompatible with cromecast unless you change certain settings. According to customer service at uverse making those changes would compromise my security.  Both cromecast and uverse referred me to pace America who make the 2 wire device but they weren't helpful. Shame on you amazon and cromecast for not making this compatibility issue easier to check before buying. What a waste of $35. I'd give it no stars if that was possible.", "verified": true, "helpfulness": "1/1", "author": "Vicki Merkel"}, {"rating": 1.0, "review": "I received my Chromecast player and was able to quickly install it on my android phone and tablet and PC laptop. I learned a few things.1.  Older Vista and Win7 computers may not stream via Chrome tab well, especially if the processor isn't a quadcore or i5 processor. (mine was horrible)2.  Amazon Prime instant video doesn't stream via Android with chromecast, (requires kindle or ios)3. A lot of app downloads my be required.  There are apps available for Crackle and Viewster that gives free tv for casting.  Youtube works ok too.4. Must have hulu plus and app to cast via Android.5. Must have netflix app to cast via Android.All and all it's a cool piece of hardware and basically does what it says it will... However is it worth the cash?  I'm still undecided about that.**edit**  Today is exactly 4 days since I got this product.I HATE it... if I could give it Zero stars I would.Despite the previous information, I tried to like this thing.  But the ONLY thing it streamed well was Youtube.  Crackle and Viewster both had buffering,stuttering and flat refuses to play. I never did get Netflix to work right either. Then today after streaming 1 (one) show, it suddenly wanted me to set it up again.  So I tried.... and tried...and tried.  I unplugged, reset, re-booted wifi, chromecast and my tablet and phone...and the dang thing refused to connect to the wifi and complete the set up.  I don't know if they updated something or what but after today I'm returning this utter and complete hunk of garbage. Google btw... is NOT helpful.Take my advice.  DO NOT BUY THIS PRODUCT.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I've been using this for a while now and am very pleased withed the ease of use. Once I got a good network connection it works flawlessly. As more apps are supported I expect to purchase more of them.", "verified": true, "helpfulness": "0/0", "author": "Randy Woodward"}, {"rating": 5.0, "review": "I have a media player and really get tired of trying to type one letter at a time searching for something on Youtube.  With this I can search comfortably from my chair.  I currently use this for Youtube, Netflix, Hulu, and Plex.  I wish I had a 2nd one just to carry with me on trips or to go to a friend's house with.  I was not sure that I would like this but I am pleasantly surprised.", "verified": true, "helpfulness": "0/0", "author": "Gadgetlve \"Gadgetlve\""}, {"rating": 4.0, "review": "O like this product, very easy to setup and install, it works perfectly with youtube and other apps, but i can't work it with a mobile google chrome and photo gallery", "verified": true, "helpfulness": "0/0", "author": "Igor Colaiacovo"}]