[{"rating": 5.0, "review": "We use this all the time to cast images, movies, videos, or screen shots to our flat panel TV. We love it, and have recommended it to all our friends.", "verified": true, "helpfulness": "0/0", "author": "Daniel Garvin"}, {"rating": 5.0, "review": "Its almost a must have for me now. Recommended to many family members and friends.", "verified": true, "helpfulness": "0/0", "author": "JVerburg"}, {"rating": 5.0, "review": "This is great if you have Amazon Prime (hint hint) so you can watch your favorite shows from your laptop to your TV! Plugs right in so it doesn't take a genius to make it work.", "verified": true, "helpfulness": "0/0", "author": "C. Witton \"chains_girl\""}, {"rating": 1.0, "review": "Stationed in Korea, doesnt work here.", "verified": true, "helpfulness": "0/1", "author": "Illiterate chimp \"%D\""}, {"rating": 3.0, "review": "WAs so excited for this but the wifi was pretty far from this and it was a lagging fest used it like 4 times for netflix then just got a smart tv and now is collecting dust.", "verified": true, "helpfulness": "0/0", "author": "Angelo A."}, {"rating": 3.0, "review": "Set up is somehow tedious .. the connection to the Android device take sometime, and any chrome cast .. needed to be done thru Google Chrome browser", "verified": true, "helpfulness": "0/1", "author": "Carlos Javier Zepeda \"jexx56\""}, {"rating": 5.0, "review": "I should have gotten rid of my cable a long time ago.  Love this product and all the apps that are available.  I can watch what I want when I want to.", "verified": true, "helpfulness": "0/0", "author": "DNixXin"}, {"rating": 5.0, "review": "It works great. I replaced the cable for an USB directly connected to the TV.", "verified": true, "helpfulness": "0/0", "author": "Soledad Celej"}, {"rating": 5.0, "review": "We could not get this on our home wireless for some reasons, so mu husband took it to school where he teachers science.  The following is his review:  \"I plugged this into the HDMI port on my projector. Connected it to the faculty network and was able to screen cast from a chrome book, a mac laptop, a kindle fire, and my android phone.  (Anything that can run chrome browser with the chromecast plugin).  As a science teacher this was an excellent tool.  I can cast to the screen from anywhere in the room, or actually anywhere in the school (as long as i am on the same network).At one point during a lab, I used my kindle and the camera. When one lab group has a great \"find\" or reaction, I can project an image or video live to the screen for the whole class to see.  In short, this was a very effective way to teach and project power point, and other lesson info from anywhere in the class.Hardly any lag, videos worked great with sound as well.  (Occasional lag casting youtube)  You can select to cast entire screen, or single tab.\"", "verified": false, "helpfulness": "0/0", "author": "Holly PBW \"Busy Mom\""}, {"rating": 4.0, "review": "I absolutely love this device!!  I only wish more networks were available for use with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Ladyinwaiting72"}]