[{"rating": 2.0, "review": "Not a techie so this was not easy for me to set up.  Still not set up and I bought it awhile ago.  Not happy that I had to purchase an instruction booklet for extra money so where are the savings.", "verified": true, "helpfulness": "0/1", "author": "Yolanda Gaytan"}, {"rating": 5.0, "review": "OMG is all that can be said. We thought the G-Chrome was good, but Fire burns everything else on the market up. Only wish we had bought it earlier. We have spent hours binge watching for free with our Prime & No lag or Buffing. Amazon Rocks!!!", "verified": true, "helpfulness": "1/1", "author": "Z.Scott Williams"}, {"rating": 5.0, "review": "Blazing fast!! Much faster than the Roku I tried a couple of years before. I can play my Amazon Prime music in the background while having my photos slideshow on the screen!  Love it!!", "verified": true, "helpfulness": "1/1", "author": "Joan"}, {"rating": 3.0, "review": "dont work properly outside US", "verified": true, "helpfulness": "0/0", "author": "Jaime"}, {"rating": 5.0, "review": "Nice product from amazon another big hit!!!!", "verified": true, "helpfulness": "1/1", "author": "juan"}, {"rating": 5.0, "review": "i have owned apple tv 2 and roku but this is by far the best fastest  most enjoyable streaming box yet. the voice feature just plain works! cant wait for a vudu app?", "verified": true, "helpfulness": "1/1", "author": "david"}, {"rating": 4.0, "review": "Works very well. I only wish the voice command worked for every app.", "verified": true, "helpfulness": "0/0", "author": "Michael Cico"}, {"rating": 5.0, "review": "I have a Roku in my living room and love it so I wasn't sure whether to buy this or another Roku but since I have Amazon Prime I decided to give this a try.  Installation was actually easier than Roku because I'm a Prime member it recognized me and my TV.  Selection of other streaming options is the same as you get anywhere but the real hook is the Amazon part.  Everything in one place!  I like it!!", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 4.0, "review": "Working as intended as expected. I wish current seasons of shows were free.", "verified": true, "helpfulness": "0/0", "author": "nameyourgod"}, {"rating": 5.0, "review": "Works great. Never had a problem. Sets up by itself after it's plugged in. Easy to use with good programs and movies to watch. Will be canceling my satellite tv when the contract is up and save $110 each month.", "verified": true, "helpfulness": "0/0", "author": "richard hutton"}]