[{"rating": 4.0, "review": "IT is nice to be able to broadcast youtube videos easily to the TV.As for as using it for networks, really the only thing that it will broadcast is Netflix  - we look at that a lot, so works for us. But you will not get any of the other major systems like HBO, or Showtime.  Probably will come on later.It's pretty easy to set up, but so is a Roku, Apple TV.  If Netflix is the only service you have, this is a good deal.", "verified": true, "helpfulness": "0/0", "author": "Bill S."}, {"rating": 4.0, "review": "Two days into it, I am very impressed with Chromecast.  With a stable internet connection, it performs beautifully.  Netflix works pretty well, although it occasionally seems to get stuck and does not transition to the next episode of a show after completing the one before it. Otherwise it streams very smoothly and maintained good picture quality.  Streaming the entire desktop (the experimental option) caused a fair amount of lag and skipping when I tried to cast a DVD and it does not seem ready to be used in that fashion.  Casting a live stream from ESPN also resulted in lag/skipping, although my internet connection is also likely to blame.  So far, it has really improved the way I use Netflix and I have been casting Pandora to my TV for better audio with great results.Still seems a bit buggy, and isn't perfect, but is a solid 4/5 and a reasonable alternative for those of us without a smart television.", "verified": false, "helpfulness": "1/1", "author": "J. Stack"}, {"rating": 3.0, "review": "When the chromecast by google came out it was worshiped by many in the tech press. Some, like Leo Laporte bought several units right away. All of this sight unseen. So, is the actual unit as good as these folks would have us believe? Nope. It's an ok device for particular use cases but don't look to this device to solve the living room TV's problems. Look for Apple to do that sometime soon.Two of chromecast's biggest problems are: 1) Not so easy setup. Although the tech fanboys would have you believe setup is a piece of cake it many not be so easy for many would-be users. 2) Once it's operational it's not so easy or fast to use. For example if you get a phone call while watching TV to pause your show you need to wakeup your control device and even then it takes a few seconds to pause a YouTube video or Netflix movie. google should at the very least bundle a simple remote that allows a user to pause and then resume viewing.As is often the case the promise of the device and real world usability do not equate. My guess is in most cases I'll continue using my five year old Roku box.", "verified": true, "helpfulness": "0/2", "author": "Craig Shipp \"Craig Shipp\""}, {"rating": 5.0, "review": "Works great. Once I noticed that it needed to run on window7 or windows 8, it down loaded fast and was working in minutes.tried window vista and it needn't work on it.", "verified": true, "helpfulness": "0/0", "author": "Eliezer Ortiz"}, {"rating": 1.0, "review": "I must admit that this Chromecast is easy to install with its fool proof system, even in IOS with its limited wifi setup options. The lack of apps available for this device makes it a an expensive Netflix and Youtube viewer hence, i recommend you to hold on to your 35 bucs till more apps are available and (for IOS users) the setup is more explicit.", "verified": true, "helpfulness": "1/3", "author": "Guillermo Gonzalez"}, {"rating": 5.0, "review": "Google brought this to market to suck you into 6 hour marathon Youtube holes. You will quickly become the neighborhood expert on funny cat vids. Also you're Twitter and Facebook feeds might get piled up with ridiculous over sharing.", "verified": true, "helpfulness": "0/0", "author": "Huehuehue \"Eddi\""}, {"rating": 4.0, "review": "Surprised that it arrived earlier than expected. Easy to setup and use. Main reason for purchase was ability to view YouTube videos and it works beautifully for that. [Note: I dropped cable years ago and Roku lacks a YouTube channel.]Why good, not great? Device runs hot which is a bit of concern because heat is not good for electronic devices. Also, the \"channel\" content available is still limited. While this was known at time of purchase it has been several weeks and nothing additional has arrived.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Chromecast just came in the mail today.  Setup took about 30 minutes.  Most of that time was waiting for my WiFi to recognize my password in the setup.  Use your phone or iPad to run Netflix or Youtube.  Also, you can still use your phone apps, check mail, facebook.  Good picture and muchcheaper than buying a Smart TV.  Happy, Happy.", "verified": true, "helpfulness": "1/1", "author": "P. M."}, {"rating": 5.0, "review": "Worked for me right out of the box. Using android phone and tablets, YouTube Netflix, Google Play movies and music work like a charm. Apparently hulu and HBO are working on it for their apps also. Only thing missing for me is Amazon instant, but they don't currently make an app for any android devices except their own,(kindle fire) so I'm not holding my breath on them doing it anytime soon.", "verified": false, "helpfulness": "0/0", "author": "Kevin B. Hill \"Wired Animator\""}, {"rating": 1.0, "review": "I study at MIT, and this device did not get past the setup stage.  It seems that the device is incompatible with the routers at MIT, and that I will have to wait until I graduate before I can use the chromecast device.  What a waste of money.", "verified": false, "helpfulness": "3/5", "author": "laughingmonk_ey42"}]