[{"rating": 5.0, "review": "Nice.....", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Is cheaper than satialite and easy setup. Will highly recommend it to all my friends and family.", "verified": true, "helpfulness": "0/0", "author": "shane searle"}, {"rating": 3.0, "review": "Works good, but the lack of ability to play local files is an unforgivable omission.", "verified": true, "helpfulness": "0/0", "author": "JC"}, {"rating": 5.0, "review": "Gave it as a gift to my son.  He really likes it.", "verified": true, "helpfulness": "0/0", "author": "JB"}, {"rating": 5.0, "review": "Love my new Amazon Fire TV.  I can now watch things that interest me and not have to put up wit the nonsense they call TV.  Wish Ihad done it sooner.", "verified": true, "helpfulness": "0/0", "author": "V. Hein \"bird lover\""}, {"rating": 5.0, "review": "This is available for US, UK and Germany and not for Costa Rica, but do you know if the basic services are unblock like netflix, crackle, hulu?? I have a suscription with netflix and i was wondering if it works here in Costa Rica with your device because I wanna purchase it hoping that the rest of the services will be available soon, and do you know if this is gonna be in a short term. Thank You", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer \"Stephen\""}, {"rating": 5.0, "review": "Works great. So easy to set up", "verified": true, "helpfulness": "0/0", "author": "Sam K."}, {"rating": 4.0, "review": "We really enjoy our Fire TV and use it every day, but every day (sometimes more than once a day) there is an issue where the sound gets messed up and the only thing to fix it is to unplug and restart the device. This does get annoying, especially when you are in the middle of your favorite show. Is there any way to permanently fix this? I even changed the HDMI cable to make sure it wasn't some wire issue.", "verified": true, "helpfulness": "0/0", "author": "Camille Galanis"}, {"rating": 5.0, "review": "Super easy setup.  More features than expected.  Awesome so far.  Only complaint is that the DRM sometimes compains about the HDMI connection.  Not sure if its because of the Redmere cable or the older TV.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Lemay"}, {"rating": 5.0, "review": "makes my non-smart TV a smart TV.  wifi works great with it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"LThornton\""}]