[{"rating": 1.0, "review": "Sounds like a great device, but don't be fooled. It is very limited as to what it will actually broadcast and there is a definite lag for what it can broadcast. Spend the extra money and buy the Chromebox, because this thing is a POS", "verified": true, "helpfulness": "0/0", "author": "jon blewett"}, {"rating": 3.0, "review": "Works as advertised. Bought it on a whim and tried it out. Can't find a practical use for it. However, if you can pull it up on your computer or phone you can project it on the TV. Fun to use for awhile but grows old in a hurry.", "verified": true, "helpfulness": "0/0", "author": "Donald Tomlin"}, {"rating": 5.0, "review": "We love this and use it all the time", "verified": true, "helpfulness": "0/0", "author": "anonymous"}, {"rating": 3.0, "review": "Meh.  One day, it may be better.  Now, it is ho-hum and limited for my uses.", "verified": true, "helpfulness": "0/0", "author": "Dr. Allison L. Hayes"}, {"rating": 5.0, "review": "Awesome can't live without it.", "verified": true, "helpfulness": "0/0", "author": "Adrian"}, {"rating": 4.0, "review": "Makes a dumb tv smart...sort of.", "verified": true, "helpfulness": "0/0", "author": "Arthur M Stoute"}, {"rating": 4.0, "review": "It is great for PC users and I believe droid tablets or phones, but apple mobile devices are still lacking in major areas. However, it is easy to set up, easy to stream, and the quality is great. You can stream music, photos or video from most websites and apps.", "verified": true, "helpfulness": "0/0", "author": "uknown4no"}, {"rating": 1.0, "review": "Unreliable", "verified": true, "helpfulness": "0/0", "author": "Paul MacDougall"}, {"rating": 5.0, "review": "Works great, love it!☺", "verified": true, "helpfulness": "0/0", "author": "E.j."}, {"rating": 4.0, "review": "Now stymied with not having split sound out.  Problem with having a good but old stereo with no HDMI in and a projector with no sound.  Still stuck running cables, super cool to send stuff from the phone to the projector though.", "verified": true, "helpfulness": "0/0", "author": "anonMaArse"}]