[{"rating": 5.0, "review": "I love it! Was definitely worth the money. I recommended buying this device over paying for cable saves you a lot of money in the end.", "verified": true, "helpfulness": "0/0", "author": "Jasmine Reese"}, {"rating": 5.0, "review": "After having problems getting it to connect to my WiFi . Easy.Verybuseful b if you want to stream from your phone ,laptop n or tablet. Other uses like the firestick. No. If you want Netflix, amazon prime hulu, hbogo, any apps like that and games plus music thus is not v tge stick for you. I have both this and fIrestick. Id chose firestick first but if you want to watch those videos you filmed on your phone or look at a stream if pics thus us cool. Also if there's any movies released not on any if the above mentioned apps but online under Google this is great to have. So yes I'd recommend  it for all those things I mentioned snd a few more. You can download some cool ap o s to it but I don't keep it plugged in 24/7 like I do my firestick but it's really worth haveing. So yes I'd buy it for all the other reasons. It's just cool for all those th I ng you can n only Internet access but would like to watch on your t.v.", "verified": true, "helpfulness": "0/0", "author": "L. Hayes"}, {"rating": 4.0, "review": "Works great with my iPhone", "verified": true, "helpfulness": "0/0", "author": "Greg G. Smith"}, {"rating": 1.0, "review": "I purchased this product and had problems with it immediately but thinking it was something on my end, I sent for a second Chromcast. This is the worst product I've ever purchased with Amazon and will never recommend it to anyone else.", "verified": true, "helpfulness": "0/2", "author": "WYNIKA O. FLOOD-GRAHAM"}, {"rating": 5.0, "review": "It's great. Easy to set up. Got it quick. Love Chromecast and Amazon.", "verified": true, "helpfulness": "0/0", "author": "Donna Digennaro \"digorno\""}, {"rating": 5.0, "review": "Worth every penny for the price even if you want to buy it and see what it does.  Have used it to stream YouTube to television for working out with no problems.", "verified": true, "helpfulness": "0/0", "author": "David K Frattare"}, {"rating": 4.0, "review": "ITS GOOD", "verified": true, "helpfulness": "0/0", "author": "nagireddy"}, {"rating": 1.0, "review": "I didn't like it - way too limited and the app to control it is really annoying.If I could change it I'd buy a Raspberry Pi or some other solution for my entertainment", "verified": true, "helpfulness": "0/2", "author": "rshimoda"}, {"rating": 5.0, "review": "It is a great product", "verified": true, "helpfulness": "0/0", "author": "Cindy Barquero Rojas"}, {"rating": 1.0, "review": "I think they meant well , but this device works fair at best. I am an A+ certified tech and very good with gadgets. I average about 30mbps. This device just isn`t usable. Skips, lags , freezes, and often times just says unable to cast. Companies are in such a hurry to make a buck they do not explain to the end user that there router must be \"perfectly set up\". A call to customer care simply told me to change a half dozen settings in my router interface. I did. Still no better. Most people would not even be able to make those changes. This thing was not ready to be released, and Google did not seem interested in refunding me or even exchanging it. Now it`s in a box in my shed with a bunch of extra wires.Wasted my money. However my Roku 3 works great ... as does my smart DVD player and my smart tv.", "verified": false, "helpfulness": "0/1", "author": "Norm Brooks"}]