[{"rating": 1.0, "review": "I am very tech savy. However, the Chromecast product is not user friendly.  It requires that you search for and load the program every time you want to launch the program. It fails to interface with your wifi due to any number of security provisions you may have to protect your wifi, meaning if you delete your wifi security to allow Chromecast to function you are exposing your entire network.  The product lacks a decent user interface, and support is nonexistent. Stay away unless you want to waste your time and money.", "verified": false, "helpfulness": "1/2", "author": "Michael sAYER"}, {"rating": 5.0, "review": "Our son really likes this item, we bought it for him for Christmas and he really likes it and now we want to get one, too. It enables him to watch shows on his TV rather than being stuck to his PC. I'm not sure why my first review was refused! I said the same thing. Geez. Anyway, it's a great little item! In our son's words, \"It's amazing!\"", "verified": true, "helpfulness": "1/1", "author": "Anirta"}, {"rating": 2.0, "review": "This rating doesn't have a whole lot to do with the product, more as it pertains to comparability with Apple products. At this point if you are trying to use an iPhone or ipad it's fairly worthless unless you need it for You Tube or Netflix.", "verified": true, "helpfulness": "0/1", "author": "richard fungaroli"}, {"rating": 4.0, "review": "I received and the set up was very simple, my TV had an open USB to charge it which is nice but.....the chromecast wasn't able to sync with my router. I reset my router, I reset the chromecast, I've tried to troubleshoot every way imaginable and it still will not sync. According to the supported/compatible routers on their site, the router I have isn't supported. My router is less than a year old and the cheapest router that is supported is $60 which is a hidden cost to consider.", "verified": true, "helpfulness": "0/0", "author": "gellikit"}, {"rating": 4.0, "review": "Excellent streaming quality. Very responsive in general, with minor delays in pausing or stopping streaming.The chrome cast occasionally freezes with netflix but a quick restart of the app on the ipad usually does the trick.It would be nice if it had access to things like the photo and video app or did a screen share like the Apple TV, but that may be more Apples doing than Google.", "verified": true, "helpfulness": "0/0", "author": "Jamsheer Anklesaria"}, {"rating": 5.0, "review": "I thought about purchasing the Chromecast when it was first announced a few months ago, but ended up waiting and adding it to my Christmas list. And boy am I glad I did!Set up was a breeze and in under 10 minutes I was streaming from YouTube, listening to Pandora, and viewing content from my browser. The setup was incredibly straightforward and easy. I was a bit concerned that the device wouldn't work as seamlessly with my Apple devices, but I have yet to run into any issues. The only minor setback is I wish more of my apps had Chromecast support from within the app, but that will come with time, I'm sure.Thanks to some clever people on the internet, there appear to be some great workarounds to stream any content from my computer that isn't expressly supported by Chromecast (like iTunes and VLC).I HIGHLY recommend this device to anyone looking for a more affordable alternative to Apple TV or wanting to \"upgrade\" their television to a smart tv.", "verified": false, "helpfulness": "1/1", "author": "ZGraphikerin"}, {"rating": 3.0, "review": "The programs that work with it on my computer work really well, but the are limited.  From the ads on tv I had expected that you could broadcast anything from your computer, but when I got it I found out there are only a few things that actually have the ability to broadcast to it.  Netflix, YouTube and  hbo go work great, but not many others.", "verified": true, "helpfulness": "0/0", "author": "Paul Jentlie"}, {"rating": 5.0, "review": "Arrived in perfect condition. Excited to find the perfect use and bring it with me when I travel to locations in N.A.", "verified": true, "helpfulness": "1/1", "author": "Dvds Burnwell"}, {"rating": 2.0, "review": "I was disappointed that I found a limited selection of supporting applications.  What there is downloads for free, but then charge for every feature you try to use.", "verified": true, "helpfulness": "0/1", "author": "Tim"}, {"rating": 5.0, "review": "This works very well. I like to Cast Leo Laportes shows on his site, twitI have noticed that there is some lip sync issues with some programs.", "verified": true, "helpfulness": "0/0", "author": "Mark B"}]