[{"rating": 5.0, "review": "Bought this for my 9 year old son at the time and his exact quotes were \"This is way better than the appleTV. it is so much easier to find what I want and i can play games too.\"", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to install and use. Nice interface. Voice search function is handy.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "Awesome.  Love everything about it.  Easy setup.  Easy use.  Fast downloads and streaming.  Great sound and picture.  Well worth the investment.", "verified": true, "helpfulness": "0/0", "author": "Gary M."}, {"rating": 5.0, "review": "bought this as a Valentine's gift for my boyfriend, he absolutely loves it. he's been wanting something like this since he played around with his friend's apple t.v  around thanksgiving time. he did a bunch of research and settled on fire t.v because the better performance and the additional content we get for having prime. we're very happy with it thus far. loads of content for us both and a ton of stuff for our 4 years old boy", "verified": true, "helpfulness": "0/0", "author": "tatiana"}, {"rating": 5.0, "review": "Love this thing!!!", "verified": true, "helpfulness": "0/0", "author": "Danny Spybey"}, {"rating": 5.0, "review": "Very pleased with this purchase.", "verified": true, "helpfulness": "0/0", "author": "AJ from JC"}, {"rating": 5.0, "review": "I love it! Amazon Fire TV is smoother and runs better than Apple TV. And I can do more things with it! Love the quality of the TV shows and movies when being played And the friendliness of it in the family setting. The remote is easy to use and has voice control!!! Amazing! The tutorial as soon as you set up your Amazon Fire TV is super helpful, and quick and painless. My partner had no problems picking up the remote, watching the tutorial and starting using the remote like he had been doing it for years!", "verified": true, "helpfulness": "0/0", "author": "Brett Richardson"}, {"rating": 5.0, "review": "It's easy to use and install. All the apps work great. My only gripe is that the voice search only works for Amazon apps, movies, shows, etc.", "verified": true, "helpfulness": "0/0", "author": "Ronald Lundgren"}, {"rating": 5.0, "review": "i love it!!i hope amazon prime service of korea.", "verified": true, "helpfulness": "0/0", "author": "RYAN LEE"}, {"rating": 5.0, "review": "Awesome ! Just Awesome!...Going to the cable company to cancel my service !!..just going to run internet service only...This is the beginning of the end for traditional cable service as we know it!! With SlingTV ,Netflix Hulu and Amazon Prime...whats the point for cable tv??? Now i will be paying 1/3 of my cable bill for now on!! Freaking Awesome!", "verified": true, "helpfulness": "0/0", "author": "Michael W."}]