[{"rating": 1.0, "review": "Great idea but may have been pushed out too soon. Like my self, many are having problems getting the item to work with a Apple AirPort wireless router. Spent the better part of a Sunday figuring this out. Maybe Google will work out the bugs, but I am disappointed.", "verified": true, "helpfulness": "6/17", "author": "Michael S Ford"}, {"rating": 1.0, "review": "I did order on July 24th well before the promo cutoff of 5:30 PM EST on July 25.http://www.amazon.com/gp/feature.html/ref=pe_424060_31534320_pe_button/?docId=1001297671&ie;=UTF8I still wish I didn't order at all.The device was not to ship for another week.It arrived. It is small, but not exactly what was expected.It requires a usb cable to power it. But you never see the USB cable in any of the marketing for the device.I guess I thought that the USB cable would be for charging purposes only - sort of like a cell phone. Not a requirement to always be plugged in.But that was probably more my mistake and misunderstanding than the Chromecast.There was no coupon for the Netflix trial. After scrounging around, I finally hit upon a website from chromecast that stated that the tril promotion would be emailed within one week of shipping.Well, it didn't.I tried the chromecast with an iPhone and iPad. Doesn't work. They are working on it. ???? Why advertise that it works from an iPad, when it doesn't?I tried it with chrome. it was a worse experience than simply attaching an hdmi cable.Why bother?The app support is in its infancy. The device support is in its infancy.The promo or Netflix does not work.The device is not worth the $35.00Save your money and get a Roku or even an Apple TV.As for the Netflix promo, I finally called Amazon Customer service and they said that they would turn this over to marketing to get my code shipped within 1 day.I then asked for a promotional credit instead for the $23.97 value that the Netflix promo was worth. After placing me on hold. The polite customer service representative placed a $30.00 credit on my Amazon account.The one star goes to the Chromecast. It is a piece of junk.I will give Amazon customer service 4 stars for turning around and honoring my request for a credit to my account instead of simply getting the Netflix promo coupon.", "verified": true, "helpfulness": "4/23", "author": "Michael Darby"}, {"rating": 4.0, "review": "For starters this is brand new equipment with all of the associated opportunities and challenges that come with something new. You better pay careful attention to the supported operating systems because Chromecast will not play well with older systems and the iphone app is not yet available regardless of whether or not you have iOS6 or higher.Around our house we have a laptop running Windows XP, a desktop running Windows Vista Ultimate, a desktop running Windows 7 and an iPhone that is up to date. The iPhone will sort of work without the app and the desktop with Windows 7 works but does not have a wireless connection and the others will not work with Chromecast. I use an Ethernet connection on my computers which has a wireless access point for the wireless devices.Setting up Chromecast for me was not a plug and play experience. I suspect with the app it might have been but the Windows 7 desktop was not connected to the Wi-Fi and the laptop which was wouldn't work because it was using Windows XP. I was faced with the problem of setting it up via a browser in the iPhone sans app and it took some doing on my part.Plugging the Chromecast into the TV was simple; it requires a power source in addition to the HDMI plug-in offers the option of a USB connection to the TV or a transformer connection to a wall plug. Fortunately my TV offered a USB connection next to the available HDMI input so that worked very smoothly.Once the TV had found the Chromecast, which was simply done, the screen showed the Chromecast home screen with the word Chromecast and a number following which identified the device for Wi-Fi connection purposes. I had to set up a temporary Wi-Fi network to complete the settings on the Chromecast.Using the iPhone browser I was able to set up the Chromecast to use the regular Wi-Fi network in the house but had to put in the username and password for it to work. Once this was done I switched the iPhone from the temporary Chromecast network back to the regular household Wi-Fi network and it then found the Chromecast device on my TV.So far I have done some video streaming from You Tube with great success and really look forward to getting the iPhone app when it finally is available. I have no idea how long that will take. There are only very brief summary instructions in the box and it is necessary to go online to get more complete information.One other point is the absolute necessity of a Chrome browser, Chromecast will only work with a Chrome browser as far as I can tell.The bottom line on all of this is the Chromecast seems to be a very useful tool but it's new and may present some setup problems. It took me around three hours to learn, experiment, and finally setup the Chromecast but I'm just a regular guy, no computer expert here. It will probably go a lot faster if you have the appropriate app for your Smartphone or have Windows 7 connected wirelessly to your network.", "verified": false, "helpfulness": "5/7", "author": "David Bower"}, {"rating": 5.0, "review": "This product does what Google said it would do and does it extremely well.  When they announced it I jumped and bought one right away.  It doesn't do a very good job of mirroring my PC screen, so things like Hulu don't work very well.  But for Netflix and Youtube it is awesome.  Well worth the $35 spent.", "verified": false, "helpfulness": "1/2", "author": "Matimeo"}, {"rating": 5.0, "review": "Google has created this for easy streaming for smartphones, tablets and computers on HDTV and easy installation in less than 5 minutes. Thanks #Google.", "verified": true, "helpfulness": "0/2", "author": "X0l4nD34"}, {"rating": 5.0, "review": "But once it was set up with MacBook Air, it's great. Haven't tried with iPad Mini, but don't really need to syn. Mirrors everything. Free three months on Netflix. Bye to cables.", "verified": true, "helpfulness": "0/0", "author": "lib teach"}, {"rating": 5.0, "review": "I was so excited to get this little gadget along with 3 months free Netflix!  I must say that as I waited for it to arrive, I became anxious that I wouldn't be able to get it to work with my TV. My fears were unfounded, though. I followed the super easy instructions for Chromecast and I also followed the equally easy instructions for connecting with Netflix with the code for the free 3 months and in approximately 15 minutes I was watching a movie on my flat screen TV. My TV is an RCA bought in 2009. It is not considered fancy by anyone's standard. Your TV will need a USB port and a HDMI port. It helps if those two are near each other as mine are. There is a selection of cords, however, so if your TV does not have the USB port, there are other ways to supply the Chromecast with power. I think there is even an AC attachment. It comes in a very impressive box, so if you are giving as a gift, it will deliver a nice impact.", "verified": true, "helpfulness": "0/0", "author": "L. Parks \"Lady Reads-a-lot\""}, {"rating": 5.0, "review": "No longer need to hook up my phone or tablet to an HDMI cable to watch movies or listen to music... Works well... Currently has limited apps, but that should change when the SDK is finalised and released...", "verified": true, "helpfulness": "1/1", "author": "Craig Gomez"}, {"rating": 5.0, "review": "So we managed to get a ChromeCast unit.  I was slightly apprehensive based on some of the other 1 star reviews here, but after playing with it for a few hours, I am totally satisfied and glad we purchased this unit.  First of all, we have an HDTV but from the era before 'smart' TV's.  Second, we don't have a cable or satellite TV Provider.. (ie: I'm not paying $100 a month for anything).  We do enjoy watching Netflix.Tech... -The setup was easy.  It just worked.  Simple.  Follow the directions printed in the box.  You plug it into the HDMI port on the TV.  Then you plug it into a power source.  Switch the TV Input to see it on the screen, it says Hello!.  On your computer you go to the web url and it asks you to download a small bit of software.  You run it, it auto configures everything.  You give it the wifi password.  Done. Chromecast app from the Play store on the android devices and it works.  Neflix and Youtube apps now have a button to cast to the tv.  Nothing complicated at all.  We have a PC with Google Chrome as a browser, and we have a Nexus 7 tablet, a Samsung Galaxy Tab 7 (v2), and Samsung Galaxy Nexus phone devices.Tabcasting- So you can cast from the tab in google chrome.  This works great, and the resolution is good too.  No stuttering, no chop, sound is in sync with the video.  Drag and drop movies into chrome, cast that onto the big screen too.  at 720P, it looks great.  The picture is smooth and defined, no pixelation, no chop, sound is once again in sync.  This is with 720p 256-512bps AVI files.  (you know, the ones that are on average 1gig in size per movie).Specs - Google indicates that the device is 1080p capable, but for tab casting there are 3 options, 480p, 720p, and 720p high bitrate.  Note, this is FOR TABCASTING.  Youtube videos and Netflix content are directly streamed by the device and the HD content streams in HD.  Youtube content sometimes starts out at a low res (blurry, w/ lots of huge pixels) but as the stream buffers it steps up the bitrate to the native resolution the content was filmed in.The secret...  We don't have bandwidth issues.  We have high speed internet with a 20mb down speed on a DOCSIS 3 protocol router with 4 channel upstream bonding.  So streaming Netflix in HD to 5 devices at the same time does not cause our bandwidth to suffer.  So Rule #1.. you NEED to have quality internet.  The other half is just as important.  We don't rent a crappy modem with wifi AP... We own our modem, and we own our Wifi Router.  We have a Linksys E3200, so nothing fancy, BUT it is a simultaneous dual band 802.11n capable router serving 7 or 8 devices at any given time.  So we have good bandwidth distribution, the router is located centrally, and half of the devices are n capable, a third of those are dual band capable or operate on the 5ghz band, and the rest of the devices are 802.11g on 2.4ghz... This means the data can get there efficiently and there is no bottleneck.The Chromecast device is 2.4ghz 802.11 b/g/n... so having a strong wifi network is important.Overall, TOTALLY worth it.  Costs less than a Roku, and allows control at your fingertips from anywhere on the network.  I can start a Netflix video on my phone, and while i'm sitting somewhere else, pick up a tablet, any tablet, and am able to pause the netflix video or change the cast stream.Looking forward to more Chromecast apps, but totally satisfied with what we have.", "verified": false, "helpfulness": "2/3", "author": "M. Blunt"}, {"rating": 5.0, "review": "Cheap enough to buy one foe every tv in the house.  Works awesomely with Netflix and YouTube with a lot more coming soon, ie HBO2go.", "verified": true, "helpfulness": "1/1", "author": "Robert Habisreitinger"}]