[{"rating": 5.0, "review": "Best money spent", "verified": true, "helpfulness": "0/0", "author": "Gamer Bailey"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "Love this item. I am going to cancel my satellite service when I have satisfied my contract.", "verified": true, "helpfulness": "0/1", "author": "lakelalady"}, {"rating": 5.0, "review": "Amazing!", "verified": true, "helpfulness": "0/1", "author": "Jasmin"}, {"rating": 2.0, "review": "Super cool device, love the size abd how quickly it boots up, But... It's got a few issues. First of all, the USB port is useless - they could easily make it play videos or show pictures from external devices but like apple they want their $$ so they try to force you buy everything at outrageous prices from the amazon store. Also, like all android devices, it often lags and jerks and chops when you're streaming video in netflix or hulu. It will slow down to slow motion, the audio will desynchronize from the video, then the video goes in hyperspeed until it catches up. It's very frustrating and happens about every 10 minutes. Lastly, the voice control ONLY works with the amazon prime content... Which means if you're looking for a movie, sure you can watch it, you'll just have to pay $7!!", "verified": true, "helpfulness": "1/4", "author": "David Umina"}, {"rating": 5.0, "review": "Simple set-up, easy to use, works flawlessly, straightforward menus and the voice search function works very well.  Might buy another one for a second TV!", "verified": true, "helpfulness": "0/1", "author": "R. Leonard"}, {"rating": 5.0, "review": "Great product would recomend it to a friend", "verified": true, "helpfulness": "0/1", "author": "Allen"}, {"rating": 4.0, "review": "Received this as a gift and absolutely love it. It is so good to be able to access all our favorites from Amazon.", "verified": true, "helpfulness": "0/1", "author": "Bob C \"an e-reader\""}, {"rating": 5.0, "review": "Works very well  (GET)one...", "verified": true, "helpfulness": "0/1", "author": "Eric Thomas"}, {"rating": 5.0, "review": "Got rid of cable and we are saving a TON! We love all of our options from movies, kids shows, music....", "verified": true, "helpfulness": "0/1", "author": "bethanynicole"}]