[{"rating": 5.0, "review": "very good", "verified": true, "helpfulness": "1/2", "author": "jaeho kim"}, {"rating": 3.0, "review": "Operates very quickly but prime programming is disappointing.", "verified": true, "helpfulness": "0/1", "author": "Stephen  Miller"}, {"rating": 4.0, "review": "Excellent interface, very fast loading, both video and menus.  The only improvement I could make on it would be to put a qwerty keyboard on the back of the remote (like Boxee).  Well done, Amazon.", "verified": true, "helpfulness": "0/0", "author": "Joey L."}, {"rating": 5.0, "review": "This is awesome . Worth every penny", "verified": true, "helpfulness": "1/1", "author": "ERIK PALM"}, {"rating": 5.0, "review": "I didn't think it was possible, but I like this better than my Apple TV.  I must have Apple TV because my house it pretty much Apple integrated. But I have Amazon Prime and it was difficult to stream movies through my dvd player so I bought the Fire TV.  East to set up. Worked immediately. No problems with network connection (I have a direct wired connection).  The remote and interface is far super than anything else I have used.", "verified": true, "helpfulness": "1/1", "author": "Robert"}, {"rating": 5.0, "review": "May be key to cutting cable.", "verified": true, "helpfulness": "1/2", "author": "John B"}, {"rating": 4.0, "review": "I would like to see AOPA channel added to the channels offered.", "verified": true, "helpfulness": "0/1", "author": "Jose Corleto"}, {"rating": 5.0, "review": "Easy to install ... a pleasure to use", "verified": true, "helpfulness": "1/2", "author": "franklin klein"}, {"rating": 5.0, "review": "Really love this. Had been using my kindle to play through TV but this is much easier and more fun.", "verified": true, "helpfulness": "1/1", "author": "DocSavage \"docsavage98\""}, {"rating": 5.0, "review": "I love it. I am an Amazon Prime subscriber and also have an Amazon Fire Stick.  I am so sick of paying through the nose for a package of cable channels of which I watch maybe 4. They force me to pay for local network channels even though I have a high def, digital antenna that gives me all local network channels over the air in 1080P. They force me to pay a \"Regional Sports Network Fee\" even though I have no sports channels and any sports I do watch are on free local network channels. I am sick of 20 minutes of every hour of TV being infested with mindless commercials. As soon as I can ween my wife off the 2 cable channels that she watches I am kissing cable and all its service fees, equipment rental fees, surcharges, add-ons and taxes good-bye.", "verified": true, "helpfulness": "1/1", "author": "Justin Sayne \"TROY-BILKED\""}]