[{"rating": 4.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "jen"}, {"rating": 3.0, "review": "Fire TV works well, but I rated it as a three.  I was upset that Amazon Prime dropped Doctor Who.  I was also upset that I could not get \"Watch ESPN\", for some reason the Amazon Fire TV does not support my provider (Charter) for \"Watch ESPN\".", "verified": true, "helpfulness": "0/0", "author": "DTB"}, {"rating": 5.0, "review": "So far, we love it and use it daily.  With 2 toddlers, that is a lot of viewing time.  It is easy to use, even my 3-year-old figured it out.", "verified": true, "helpfulness": "0/0", "author": "JOSEPH R LEDUC"}, {"rating": 5.0, "review": "Great as expected. Works best with Prime. Love the Amozon movies/series. Bought one for my daughter I liked so well. Would advise all to purchace.", "verified": true, "helpfulness": "0/0", "author": "Topper"}, {"rating": 4.0, "review": "Unfortunately, I had to return the Amazon Fire TV box. Am a DIRECTV subscripter and DIRECTV is not one of the providers options listed to use select to watch the cable channels  like ESPN, Cartoon Network, TNT, CNN, TBS, HGTV, Food Network,  In the meantime I did enjoy the Fire TV for the short time I used the it.  Please add DIRECTV as one of your providers!", "verified": true, "helpfulness": "0/1", "author": "Taria A Jones"}, {"rating": 5.0, "review": "Instant video. Hardly no buffering like when using blu ray players to stream netflix.", "verified": true, "helpfulness": "0/0", "author": "MickyB"}, {"rating": 2.0, "review": "It's responsive and arrived quickly with an easy setup....Cons- it has a usb BUT you are not allowed to hook up your own external hard drive....HUGE CON.... You cannot turn it off ever unless you unplug it it goes into sleep mode after 30 minutes. If your worried about privacy then beware your microphone is always on. The user interface is setup is jumbled and somehow neotv has an easier interface", "verified": true, "helpfulness": "0/1", "author": "justin"}, {"rating": 5.0, "review": "Awesome speed !! and voice search really work..:)", "verified": true, "helpfulness": "0/0", "author": "Nivedita"}, {"rating": 4.0, "review": "I really like this. It was easy to install.  My only gripe is that I understood that the voice control was for all apps and does not work with Netfilx, which is primarily what I use this for.  It only works with Amazon videos.  I'm still glad I got it.  It's so much nicer then having a laptop connected to the TV.", "verified": true, "helpfulness": "0/0", "author": "Irma"}, {"rating": 5.0, "review": "Very fast, working very good, better than G box", "verified": true, "helpfulness": "0/0", "author": "Merlin's wife"}]