[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Dee A Schultz"}, {"rating": 5.0, "review": "I bought this for my wife and she loves it. It's compact, easy to mount, easy to navigate, plug and play...the list goes on and on. In short, it is a very good purchase, especially for those who wants to eliminate cable or satellite tv.", "verified": true, "helpfulness": "0/0", "author": "Simba"}, {"rating": 5.0, "review": "We are enjoying this more and more each day.  A great product at a low price.The only complaint I have is that the written instructions are not as detailed asthey should be.  Other than that, it is well worth the money spent.  It deserves 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Michael Evans"}, {"rating": 3.0, "review": "the machine is techy and works well, very cute search mode but  there doesn't appear to be as many free movies/tv as they say.  We will keep looking", "verified": true, "helpfulness": "0/0", "author": "cookie"}, {"rating": 3.0, "review": "No. I was very disappointed with the limited number of prime movies.", "verified": true, "helpfulness": "0/0", "author": "Law Offices of Ronald I. Paltrowitz"}, {"rating": 4.0, "review": "Very satisfied with product. A little disappointed that kindle app not available.  My grand kids love it", "verified": true, "helpfulness": "0/0", "author": "donna"}, {"rating": 1.0, "review": "I purchased this mainly for access to Plex and I have been nothing but frustrated.The unit constantly crashes and there is no support for 5.1. I know it doesn't play MKV but that doesn't matter so much as all my content is converted to MP4. So I get stereo sound or no sound at all.I don't have these problems with my Roku.Also I paid $2.99 for the Plex app and then a week later it is up there for free.It seems there are some work arounds to side load apps, but I don't have the time or patience to hack it up to make it work.", "verified": true, "helpfulness": "0/2", "author": "Mary Riley"}, {"rating": 5.0, "review": "Yes,i do like it. Of course,it had to have upgraded internet.", "verified": true, "helpfulness": "0/0", "author": "roseannhill"}, {"rating": 5.0, "review": "very nice !  much smoother and reliable than streaming through my Wii console. Voice search is handier than a pocket on a shirt.", "verified": true, "helpfulness": "0/0", "author": "Mr. S. Grant \"smokin45\""}, {"rating": 5.0, "review": "I used to have a Chromecast which worked okay but this Amazon Fire TV is off the hook.  I love the interface and remote, makes finding your show super easy and fast.  Everything loads quickly and is very, very smooth.  The voice operation on the remote has surprisingly been really neat and gets me to my show ASAP.  Love this thing.  May never leave couch again.  Please send help & food.", "verified": true, "helpfulness": "0/0", "author": "J. Bradley"}]