[{"rating": 3.0, "review": "It was on back order and when it arrived I couldn't get it to work.  But i'm still trying (it's a good product) I just have to figure it out.", "verified": true, "helpfulness": "0/0", "author": "daytripper88"}, {"rating": 5.0, "review": "I have had no problems and it does exactly what it is supposed to do, and the best part is that the apps list keeps growing.", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "Chrome cast makes life so simple. It takes under 5 minutes to set up and it is worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Chris Barr"}, {"rating": 4.0, "review": "They don't tell you that but once that issue is past, it's a quick set up. It told me it couldn't find the wi-fi when I tried to use my computer which is hard-wired to the router.  Took me about 2 minutes with my phone. Very user friendly.", "verified": true, "helpfulness": "0/0", "author": "Michelle L. Frazier \"mickisix\""}, {"rating": 2.0, "review": "It's not that Chromecast is difficult to use; it just doesn't give me anything I don't already have with my WiFi streaming Blue Ray player. I guess if it's your only device then it's worth having or at least another device for an additional TV", "verified": true, "helpfulness": "2/2", "author": "1-JAS-58"}, {"rating": 4.0, "review": "Chromecast by Google is the cheapest and simplest way to put internet based streaming content on your big screen TV.Included in the package is a HDMI stick, a USB power cable of sizable length, an AC adapter, and an HDMI-elbow cable. The packaging is excellent and I like the extras they included just to be sure you'll be ready to set up right out of the box. The device itself will be completely hidden behind your television even if you use a side HDMI port. You also need a home wireless network and a reliable broadband connection (but everyone has that).Set-up is simple. Just plug everything in, switch to the correct input, then download and run the Chromecast app or go to [...] on your chrome browser. Connect Chromecast and your Android/chrome device to the same  2.4ghz wireless network and you're done.The Chromecast itself seems to do almost nothing. There is no interface and no way to input commands into the device. It just relays a signal to your television (basically).The next step is getting the apps. If you're on an Android device, go to the Play Store, select Shop apps, then swipe over to categories and select Chromecast at the top. This page is home to the full list of Chromecast officially supported apps. This list can also be found here: [...]All your interactions will be with your smartphone, tablet, or PC. Your results may vary depending on the device you're using. You're going to be searching content, \"switching channels\" (moving between apps), and controlling playback all from your device. I was using an HTC One M8 and found everything to be very snappy and smooth. Whatever it's like browsing for content to stream on your device, that experience will be identical using Chromecast.That list is everything. If it's not an app there, you're not getting it on your TV. This means no Xfinity TV Go, no Amazon Instant Video, no live sports, no Shotime. If you browse over to Roku you can see just how much more they offer in terms of content. It makes Chromecast look quite sparse. What Chromecast needs more than anything else is more app support. Still, it  gets all the major streaming services (Pandora, Netflix, Hulu+, HBOGo), and Plex (at least for me) rules over all.Once you pick something to watch, your device's job is done. Everything else is handled by the Chromecast itself. This frees you to do whatever you would like with your device, even turn it off or get in your car and drive down the street with it. You won't be using any battery life or processing power. Once the stream has started, it will play until the end as long as you have internet.I find the two screen experience very enjoyable. Chromecast let's your TV do what it was made to do: VIDEO PLAYBACK!! Menus, icons, and on-screen keyboards belong off your main screen so your fancy LED 70\" display is free to do its job.I can be watching a movie and see an actress who's really great, then search for other movies she has been in and have them ready to cast without interrupting playback. If you wanted to explain it to Grandpa: it's your TV guide and remote controller combined and there's no schedule.Multiple people can search Youtube on their smartphone for music videos and cast them out to shared TV Queue that plays automatically. It's like a free music video jukebox that you can use from across the room.Chromecast creates a 'shared' watching experience. I can pull up some old George Carlin stand up then my friend can remember another funny standup then add a specific video to the queue and while that plays I can look up Dogma on Netflix and cast that out. The screen real estate is all video playback expect for brief loading/buffering screens when switching apps.Google's Play Music and Play Movies are also available if you have purchased or downloaded any content from those store fronts. AllCast can be used to stream local content off of your phone. (paid app). Plex is just the best. The Android app is $.99 cents on Amazon. It runs a server off of your home PC to share video and more. I loaded up 23 seasons of the simpsons and about ten 1080p video files now everything is available to stream on my local wireless network. Very cool, very cheap, and very easy to set up. Everything looks spectacular, you can set it up at [...]One of the issues is that the experience seems to vary on an app by app basis. Some apps don't allow for queueing and won't automatically play the next episode. So after every episode on an Archer marathon on Netflix you're going to have to pull out your phone, open the app, and select the next episode. On HBOGo I'm only given Play/Pause, and an inaccurate scroll bar. No fast forward or rewind?? Huh?? I'd like to have more complete control of playback with fast forward, rewind, slo mo, 30 second skip, etc. It needs to be there for all playback.What the Chromecast can't do is cast. . .Chrome. At least not yet. In order to stream from Chrome you have to download the Google Cast Extension and select your Chromecast device to cast to. We're kindly reminded that this usage is still a \"BETA\" feature so your results may vary. I've heard the latency isn't the greatest and other issues can arise. I never had any studdering or latency, but I wasn't able to stream some content. If it's not an approved/licensesd app you're not going to get playback on your TV. For example, Amazon Instant Video always appears blacked out and I suspect that WatchESPN and the rest will have similar results.I used mine on a 42\" 1080p vizio television. Playback from Netflix,Hulu+, Plex, HBO Go always appeared 1080p quality with no artifacting, stuttering, lag, etc. If your internet speed and wireless signal strength are at least above average you should be fine.At $30 the value here is incredible.  (I personally bought mine at Best Buy for $35). The market for this type of device is getting more and more crowded with the release of Amazon's FireTV and the announcement for Android TV. In addition to the already popular Roku line. I really hope Google figures out a way to support AndroidTV and Chromecast together. I've never used any of the other devices, but from what I can tell they offer a more stand-alone experience at three times the cost.My only experience is with the PS4 and their small suite of streaming apps. Overall it's a nice, kind of exactly what you expect it to be like on a gaming console, but Chromecast is better due to the fact that I can search for content on other apps without pausing current playback and I don't have to wait for the hardware to boot up. I will still be using the PS4 for live sports and Amazon Instant Video, but for day to day streaming it's all Chromecast now.The $90 tier of devices also offer some gaming options. Why anyone would want mobile gaming on their big screen tv is beyond me. I think it's a way to sell more Angry Birds. Even if you're not gaming on the latest PS4/XONE there's so many better options. Pull some old Nintendo cartridges, maybe some Playstation 2. There's just so many options for a home gaming console to be spending time with mobile games.As for the multi-screen experience, Chromecast is the best option HANDS DOWN. Amazon's FireTV also requires you to buy into their FireHDX tablet. Apple requires an iPad or iPhone. And Roku only offers limited multi screen usage. Chromecast supports the widest range of devices so it's very likely that whatever tablet/smartphone you currently own will make an excellent remote/guide for your Chromecast experience. And the same goes for any guests who might be over. Why buy more hardware when you don't have to? Maybe if you don't own a tablet/smartphone or don't want to use it to control your television the Roku3 may be a better option.Bottom line: buy a Chromecast today, then write a letter to Google demanding more app support. $30 and you get Netflix, HBOGO,Pandora,HULU+, and Plex on your TV. That's worth the price of admission right there.  4 stars for lack of app support and full playback control.", "verified": false, "helpfulness": "2/2", "author": "Michael Gronkowski"}, {"rating": 3.0, "review": "netflix does not work very well with this product its always buffering every 5 mins making it frustrating to watch anything i wish i would have known that before i bought it.", "verified": true, "helpfulness": "1/1", "author": "Gary Beardsley"}, {"rating": 4.0, "review": "Awesome device. I wish it had more control over my TV though. It can switch inputs to the device the second you press play on Chromecast on a device, but it doesn't switch back.", "verified": true, "helpfulness": "0/0", "author": "Valued guest"}, {"rating": 5.0, "review": "Ordered this as a gift and the price was great, everything was great and I appreciate the service. Thank you", "verified": true, "helpfulness": "0/0", "author": "DS"}, {"rating": 5.0, "review": "Literally just plug it into your TV and que up anything!Apps I've been using with this:YouTubeNetflixCrackleHulu PlusPocket CastsRdioCrackleTwitch!!Just infinite entertainment! So cheap and so many developers are hopping on the bandwagon every week.Make sure you have a good internet connection, at least 1Mbps, anything lower makes everything really glitchy and makes it difficult to speak to the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Luis G. Niebla"}]