[{"rating": 2.0, "review": "Maybe I was expecting too much, or too ignorant, when I purchased the Chomecast HDMI.  I could only find nice pictures on my TV screen produced by Chromecast.  There weren't and aren't any icons for apps, instruction/help area, or anything else.  I found out that you need to use your other devices apps to \"cast\" something to the screen.  These apps disappear when you shutdown Chromecast, leaving you with pretty pictures once again.  The main feature that I thought would be available was streaming stored items from my desktop computer.  I am not ashamed to admit that I was wrong in thinking Google Chromecast HDMI could preform what you would think would be a simple task.  Maybe, I was dazzled by the other, wonderful and amazing services that Google created.  Not realizing that streaming PC stored items, would pose such a challenge to the world's 8th wonder.", "verified": true, "helpfulness": "0/1", "author": "Penelope Penworthy"}, {"rating": 5.0, "review": "This is convenient and easy to use. We do not use a DVR. This is a great little device to meet all our viewing needs.", "verified": true, "helpfulness": "0/0", "author": "dd121"}, {"rating": 5.0, "review": "This is by far the most used item in our household. The apps work wonderfully on the device. They are able to mirror the display of the casting device but audio and video at same time requires a solid WiFi connection and casting device (phone or tablet) tends to overheat when more then 20 mins in length and then disconnects, only in mirror display mode. I believe this is only a casting device issue which will improve as hardware gets better. The Chromecast itself works beautifully when initiated into use, and then other device (phone or tablet) can be shut off and Chromecast still plays on itself. Its a mini computer by itself, once you verify your intentions it takes over the heavy lifting from your own devices. Think of your phone or tablet or home PC as the remote for this and it just works fine.", "verified": true, "helpfulness": "0/0", "author": "Kevin M."}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "mauricio gil"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Raymond Francois"}, {"rating": 2.0, "review": "I was not able to use it with my laptop but I could use it with my cell phone.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it.  Small and easily plugs in to an HDMI input out of site behind your tv (and can powered by USB, assuming you have a USB input on your television), so it in no way adds to the collection of set top boxes beneath your TV.I use it for Netflix, which it operates with seamlessly.  I also use it for movies and shows I have on my local drive.  There's a number of ways to do this. The way I do is super simple.  I just open my chrome browser.  Click File: Open File, and find your media.  It'll start playing in a browser tab, and assuming your have the chromecast extension installed, you can just fling it up to your TV with a click", "verified": true, "helpfulness": "0/0", "author": "m moseley"}, {"rating": 5.0, "review": "it is better then my roku and I love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Devices functions nowhere near as seamlessly as it's marketed. Installation was relatively trouble free, but it's incredibly flaky when working with various apps iOS 7 or 8. Youtube app and Netflix app both will fail to play to the Chromecast until after numerous attempts. The problem occurs even when I use Chrome browser on my laptop. \"Fixing\" it usually amounts to closing the app on both the phone and turning my TV on/off in order to reset the Chromecast.iOS 8 is currently garbage, so it would be easy to blame that. But these problems persisted on iOS 7 as well. It's across operating systems, across devices, across apps. It's hard to believe that the only thing staying constant here - the Chromecast - isn't at fault.", "verified": true, "helpfulness": "0/0", "author": "Scooter McScooterson \"im a farty head\""}, {"rating": 4.0, "review": "It is a boon. Sometimes there is a playback lag, but it fixes itself quickly when you pause and resume. Has worked well with all \"wireless\" pieces in our home.", "verified": true, "helpfulness": "0/0", "author": "Anj Jay"}]