[{"rating": 5.0, "review": "Awesome if your home is an amazon prime zone.", "verified": true, "helpfulness": "0/0", "author": "Paul Ruby"}, {"rating": 4.0, "review": "great content..... easy to use and decent amount of apps which is growing... just wished it had HBO and NHL gamecenter. Overall this is a quality product for tv and movie content and now in the race for tv domination from other companies... it's all about content. wish the game controller was a little bit cheaper too.", "verified": true, "helpfulness": "0/0", "author": "Teddy Sanowski"}, {"rating": 5.0, "review": "Outstanding!", "verified": true, "helpfulness": "0/0", "author": "william maclean"}, {"rating": 5.0, "review": "I am really glad I took a chance on this.  As a prime member I wanted to maximize the use of my membership and this has almost replaced our cable service.", "verified": true, "helpfulness": "1/1", "author": "MattG"}, {"rating": 4.0, "review": "Pretty cool, kids love it - too bad it doesn't loop or repeat.", "verified": true, "helpfulness": "0/0", "author": "James S."}, {"rating": 5.0, "review": "Works as advertised. Very nice unit.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "the voice activated control makes this the best streaming device around.", "verified": true, "helpfulness": "0/0", "author": "RICHARD AGUILAR"}, {"rating": 5.0, "review": "Can't beat this little baby. Connects easily and is a family hit.", "verified": true, "helpfulness": "1/1", "author": "William Bono"}, {"rating": 3.0, "review": "The FireTV works great for watching Netflix, Hulu Plus and Amazon Instant Video.  It's fast, easy to use and reliable.  I also like how it supports Plex, which lets you stream a variety of non-iTunes media files from your computer (which you can't do on an AppleTV).  The hardware is fast and plays media better than an AppleTV.My single, HUGE complaint is that there is still no HBO Go support despite it being repeatedly promised.  To me that's a dealbreaker and I'd return this device now and go w/ a slower, less feature-rich AppleTV in exchange for HBO Go support.  Also, the Showtime app only supports a handful of cable providers, Comcast not being one of them.", "verified": false, "helpfulness": "2/3", "author": "Mr. Robs"}, {"rating": 5.0, "review": "LOVE this! We use it all the time. From set up to daily use it's really easy to use.", "verified": true, "helpfulness": "0/1", "author": "Aloha Erin"}]