[{"rating": 1.0, "review": "I plugged in my Chromecast and was going through the setup.  When I got to connecting to my network, Chromecast was able to find the network, but could not connect to it.  I called the helpful 24x7 support number and got a very quick answer to my problem:  the device controlling the Chromecast must itself be connected to the wireless network to which you are attaching the Chromecast.  This network requirement should be made clear in the technical requirements for the device.  Perhaps it might be obvious to others, but it wasn't to me. After connecting my PC to my wireless network, I attempted the setup again.  Although my PC and the Chromecast were both able to see the network, they could not interact.  Google has workarounds for some router brands and models, but not all. Apparently, there is not yet a workaround for the Netgear N150.  Ultimately, I returned the product as being unusable with my other hardware.", "verified": true, "helpfulness": "14/22", "author": "Eriknorcal"}, {"rating": 4.0, "review": "This was out of the box and working within 10 minutes. The audio and video was as good as HD as I've ever seen ( Toshiba Regza 46\" LED) It's cool to be able to broadcast from my lap top and continue to surf other web sites. I think Google will add some neat twists and this will last for quite a while. My iphone recognized it right away and I can play YouTube and Netflix immediately with superb clarity. I hope to be able to use it with my Amazon Prime soon. Hint, hint Amazon. I also received two free months of Netflix even though I am already a subscriber. My account was credited for two months. What a bargain!", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer \"GADGET CRAZED\""}, {"rating": 5.0, "review": "As a musician I am on YouTube a lot and the D-Link MovieNite Streaming Media Player I purchased for that was not as reliable nor as versatile as I had hoped. This device, though was practically made for connecting YouTube to my TV and controlling it with my Samsung Galaxy Note II or my wheezing old Windows XP laptop.Yes, this will do more than YouTube, but I also have a Roku and that does the Amazon Prime movies I want. This is my YouTube box and it works perfectly.  Installation entailed first plugging this into one of the two HDMI ports on my TV and attaching power. Since my TV has an USB port I use it for power, but the device comes with a wall wart for a USB cable too. The next step required downloading the Chromecast and YouTube apps for my Note II and connecting to my network. Now when I bring up YouTube there is a 'Cast' icon I can press to watch whichever videos or clips I bring up in a search or from my favorites.The app I loaded also will detect and work on my friend's Chromecast when I am at her house, so in a way this is a universal remote. She is using an iPhone 4S and went through basically the same install process, although she is also using NetFlix with hers. Like me she has a Roku plugged into her second HDMI port. She uses that device more than I do, but out needs are different.Overall, I can heartily recommend this for folks who spend a lot of time on YouTube, even if they have another streaming box like the Roku. I am not so sure that I would get this as a general purpose streaming device - at least at this point - if I wanted movies from other sources. In that category the Roku seems to have many more options (at this point in time) and is a more mature and versatile platform. However, for YouTube this is THE solution in my opinion.", "verified": false, "helpfulness": "0/0", "author": "Mike Tarrani \"Jazz Drummer\""}, {"rating": 5.0, "review": "Enjoy using this dongle very much.  Getting use to it was easy and setting it up was even easier. Havihg a lot of fun with it.", "verified": true, "helpfulness": "0/1", "author": "Big Ben"}, {"rating": 4.0, "review": "I have a Roku Box and if it had a YouTube channel, I wouldn't need the Chromecast. I'm sure there will be more versatility with the Chromecast later but for my purposes, I will only use it for viewing YouTube. I only use the TV for viewing movies and hopefully images. For regular computer usage, I prefer the monitor and keyboard process. The rest is hoopla for me and not as efficient.  I can see possibly why there is no YouTube channel on Roku....otherwise, the Chromecast wouldn't be as popular. I say, get a Roku Box and if you really want YouTube, also get the Chromecast. You may need an HDMI Multi input switch box if you don't have enough HDMI inputs on you're TV.", "verified": true, "helpfulness": "1/1", "author": "dlo"}, {"rating": 4.0, "review": "I bought this for my wife and she likes it a lot. it was fairly simple to set up using a tablet and a smart TV. The unit comes with a usb cable, as well as an AC power cord.", "verified": true, "helpfulness": "0/1", "author": "M. Winston"}, {"rating": 5.0, "review": "The cost is low and it is easy to link to iPads and Android tablets.  It is limited to a few apps but the Netfliks works great.  Allows the setting of captions and volume on tablet sets it on the television.  This is great now and the technology will only get better.", "verified": true, "helpfulness": "0/0", "author": "Reader"}, {"rating": 5.0, "review": "I often find it necessary to display webpages for an elder parent who is not a computer user.  This tool simplifies the process by allowing me to broadcast the Chrome browser (or Youtube) page on a large television screen.  It is much easier to browse the web from a laptop than from the built-in browser functions on my A/V system.  Great tool for online research with groups of people.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "There was a time when I couldn't a YouTube video of hot girls washing cars from my bedroom to the tv in the living room to interrupt my gay male roommate and his boyfriend's movie night woot warning.  But now I can.  Thanks, Chromecast!(There are a lot of glitches with this, you can send video except through YouTube. Netflix doesn't yet work. You can send up a tab in Google Chrome too. Once the software is out of Beta, is gonna be slick.)Worth the low price tag.", "verified": false, "helpfulness": "1/2", "author": "Dawn Elizabeth \"Queen of the Universe\""}, {"rating": 5.0, "review": "Easy set up. Works great. Worth more than the price. I recommend this to anyone who'd rather watch the TV screen than the computer screen.", "verified": true, "helpfulness": "1/1", "author": "Connie L. Reaves"}]