[{"rating": 3.0, "review": "I thought you could stream anything from your phone and you can't, basically works for YouTube, I couldn't even make pandora work with it", "verified": true, "helpfulness": "0/0", "author": "La Mejor"}, {"rating": 5.0, "review": "Unbelievably east to use and install. The clarity of the picture is amazing . I highly recommend this Google Chromecast!!!!", "verified": true, "helpfulness": "0/0", "author": "jane major"}, {"rating": 1.0, "review": "Did not work with my eqipment,have by buy more stuff.It sounded so simple but ??I'm not very happy with it..", "verified": true, "helpfulness": "0/1", "author": "carl klopfenstine"}, {"rating": 1.0, "review": "Does not have the ability to stream PC to TV. Only through Youtube and paid servers via Netflix ect. Servers required to function as they advertise.", "verified": true, "helpfulness": "0/1", "author": "Henry Gage Jr."}, {"rating": 5.0, "review": "I am amazed at what this little dongle is capable of doing! Google has a winner here.  Used frequently to cast videos from my Kindle Fire HDX through Plex!", "verified": true, "helpfulness": "0/0", "author": "Steven Buzzell"}, {"rating": 5.0, "review": "Easy and Comfortable !!!!!!......if could be possible to downloading and streaming Internet file via URL address, it would be more convenient", "verified": true, "helpfulness": "0/0", "author": "vano mechurchlishvili"}, {"rating": 4.0, "review": "I really didn't think I woud like this little gadget, but I have really grown to like it alot. I wish there were more applictions compatible with it, but that list is growing. Easy to set up and nice to not have to turn on my PS3 inorder to access Netflix on my plasma, which is not a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I love my Chromecast.  It's an easy way to watch Netflix on my TV, but that's only because my plasma pre-dates smart TVs.  The support for other streaming apps out there isn't wide enough yet.  And streaming from a Chrome browser tab is video-only.  The audio still comes from the source device speakers (PC, phone, etc). This is okay if you want to gather everyone around to look at a web page together, but useless if you want to stream video from un-supported apps onto the TV.This is a fantastic gift for people who need an easy way to watch Netflix on a non-smart TV.  Bought one for my in-laws for Christmas and they love it, but that's all they use it for.", "verified": true, "helpfulness": "0/0", "author": "Novum"}, {"rating": 4.0, "review": "It works really well when it wants to.At times, it just doesn't want to cast :)I hope they add chrome casting from mobile devices soon.", "verified": true, "helpfulness": "0/0", "author": "S. Moza \"Sunny Moza\""}, {"rating": 1.0, "review": "An Amazon help line person told me that if I got the Kindle HDX, I should get the Google Chromecast so I could play my Kindle content on my HD TV.  I could not get this to work.  If I got a Netflix or the Hula app it would work, but I wanted to play the Prime account movies and Rhapsody music on my TV (and this my stereo system).  MAyday said it would not work and they had no alternatives after 12/25/13.  I returned this thing.  Thankfully AMazon made it easy to return.  SInce then the Netgear Push2TV was brought to my attention as supporting the Kindle HDX.  It worked like a charm.", "verified": true, "helpfulness": "0/0", "author": "L. Stemke"}]