[{"rating": 5.0, "review": "my kid loves this item.  now he watches all his videos on tv via chrome cast. really good item and super easy to use.  highly recommended!!", "verified": true, "helpfulness": "0/0", "author": "PATRICK C TSAI"}, {"rating": 5.0, "review": "I got rid of Direct TV, finally, when I thought this gadget might work for me. I am saving $92 a month no longer having satellite and instead pay $7.99 each per month for Hulu+ and Netflix. I bought a Chromecast for each of my televisions as well as inexpensive antennas so that I can pick up local channels! I recommend the Chromecast, just make sure that your television is compatible. If you have a Smart television, you should be all set.", "verified": true, "helpfulness": "1/1", "author": "Kristi Bancroft \"krisms1960\""}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/1", "author": "Carolina"}, {"rating": 2.0, "review": "I love technology and being one of the first to try new products, so when I saw the Google Chromecast was coming out, I ordered one right away.  I thought it might be a good way to make my \"non smart\" TV, \"smart\".  It did, but for me it was cumbersome and not intuitive.  It was hard to navigate through to places I wanted to go.  I also thought it would be an easy way to \"air play\" my devices on the tv.  It probably is for Google products, but I have all Apple products.  Not as easy to do.", "verified": true, "helpfulness": "1/2", "author": "Andrew Denlinger"}, {"rating": 2.0, "review": "There are too many common feeds you can't use it on so i rarily use it anymore. Also, using it to feed from a laptop isn't practical. Way too slow.", "verified": true, "helpfulness": "0/0", "author": "Paul in Colorado"}, {"rating": 5.0, "review": "Awesome. Simply awesome.", "verified": true, "helpfulness": "0/0", "author": "David W Bradford"}, {"rating": 3.0, "review": "While it worked wonderfully for Youtube, Hulu and other videos from online were a nightmare. They skipped, jumped, had sound delays, and just over all didn't work. I went and looked through how to 'fix it' and even after everything nothing was helping. Had everything worked as smoothly as the supported youtube, this would have been a great product.", "verified": true, "helpfulness": "0/0", "author": "Michael Poole"}, {"rating": 5.0, "review": "My iPhone and computer readily recognized devise.  It was easy to set up and instructions were simple and easy to follow.", "verified": true, "helpfulness": "0/0", "author": "E. Neumann"}, {"rating": 4.0, "review": "It is nice to be able to view pictures etc. on the TV, especially a wide screen TV.  I'd recommend this to everyone!", "verified": true, "helpfulness": "0/0", "author": "anna first"}, {"rating": 5.0, "review": "and I tried it and it is a good product, I recommend it to everyone who uses netflix and have no smart tv, thanks", "verified": true, "helpfulness": "0/0", "author": "jorge rinaldi"}]