[{"rating": 5.0, "review": "This is what husband wanted for Christmas so I got it for him.  It was in time for Christmas too.  Yay.  It is awesome.  No rebuffering like with our wifi bluray player.", "verified": true, "helpfulness": "0/0", "author": "christi"}, {"rating": 4.0, "review": "To watch youtube videos from smart phone, tablet, laptop or desktop --- this is really a good device.It will be nice to have to see the entire desktop or local disk videos and photos to play with this device In future release / upgrade of the software/firmware", "verified": true, "helpfulness": "0/0", "author": "HKS"}, {"rating": 2.0, "review": "Did not work on Netflix for about  15 days after update, I bought a Apple TV much more selection . It seems to be working now  after another update", "verified": true, "helpfulness": "0/0", "author": "gary mirling"}, {"rating": 5.0, "review": "I used to connect a computer directly to my television and that was a bit cumbersome. This device solves that problem and allows for a wireless cat directly from my laptop, phone, or tablet. I love this thing. The best part about it is you can take it with you to hotels if you travel a lot or to a friend's house.", "verified": true, "helpfulness": "0/0", "author": "Vinipux"}, {"rating": 4.0, "review": "Everything is great, but I wish it connected directly with more apps. Also, the iOS version of Chrome does not support the browser Chromecast, which is a little bit of a bummer. Chose this over the Apple TV because of the price, but if you have iOS products (iPad, iPhone), I would say you will find that Airplay via Apple TV will have a lot more to offer. I'm now wondering how long to wait for Chromecast to connect directly to more apps, or if I should go ahead and just an Apple TV.That said, this is really a GREAT product. Especially if you live in an Android world. The only downside for me is that I have iPhone and iPad and Apple doesn't seem too interested in playing nice with Google's competing products.", "verified": true, "helpfulness": "0/0", "author": "new crocs fan"}, {"rating": 5.0, "review": "Is usefull and bring power to my TV, is a great product and low costRecommended is a great option", "verified": true, "helpfulness": "0/0", "author": "Luis Jose Bedoya Franco"}, {"rating": 1.0, "review": "Setup was easy. Very limited range of capibilities, It won't allow you to broadcast the current browser page. Returning it.", "verified": true, "helpfulness": "1/2", "author": "Geddy L."}, {"rating": 5.0, "review": "Very easy to setup and streaming feature works really well. There's a limited number of apps at the moment, but more are on the way.", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Easy to use. Had this working in minutes.  Gave as gifts. This has appealed to 3 generations!  Each had a different use .", "verified": true, "helpfulness": "0/0", "author": "catherine watkins"}, {"rating": 5.0, "review": "Love to stream my rented movies, recently taken family videos....  all cuddled up with my grandchildren, enjoying popcorn in front of the big screen tv... a definitely on the go fun item.  This device is so efficient to install on any applicable item and so small for the great job it accomplishes that I do not leave home without it..... its with me, ready to use. Easy plug in, easy to use.  Its very low priced for the range of enjoyment our family receives and did I mention the ideal small size making it easy to transport, plug in, activate for quick and efficient installation.", "verified": true, "helpfulness": "0/0", "author": "Cynthia McDonald"}]