[{"rating": 5.0, "review": "Gotta love this budget streaming device. Best part is it's PORTABLE' and does what it says.", "verified": true, "helpfulness": "0/0", "author": "Vic from N.Y. \"Vic From NY\""}, {"rating": 3.0, "review": "Works great with netflix and youtube, but it is not set up to work with other programs like Amazon Instant Video or other websites.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Sokolis"}, {"rating": 1.0, "review": "\"Easy setup: Plug into any HDTV and connect to your home WiFi network\"  -  Not so muchI will stick to a true plug and play Apple TV - I have been working on this Chromecast thing for over 2 hours and can't get it to work (and I am not a tech idiot)... It definite is NOT Plug and play.", "verified": true, "helpfulness": "0/4", "author": "yamargie"}, {"rating": 2.0, "review": "I have used this device for around 3 months and generally it has performed OK. However for some reason Google have decided to sabotage it and render it uselss.To begin with, it's a neat little device. It's easy to set up, it's inexpensive and it runs a pretty slideshow when it's idle. It is also useful for streaming tabs to - these tabs can be web pages or video. I use it most of the day to stream Bloomberg TV from bloomberg.com and for that it works perfectly.So why only 2 stars? Well, it's because I wish it had just been left to do the above. The problem with the device is that whenever you want to stream a tab for Youtube, Netflix or BBC iPlayer, the device decides to run its own native application instead of just casting the chrome tab - and they never, ever work. The tab will just freeze and the device will say 'waiting to cast'.It's infuriating. I have tried factory resetting the device 3 times. I've tried a new device. They all have the same issue.I'm not technically illiterate either. I have run an managed IT services business for over 10 years.I don't see why there isn't an option to override the poorly written apps and just cast tabs as it's supposed to. If they introduced that function, the device would again be useful and I will change the rating to 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Magnus"}, {"rating": 3.0, "review": "It was a little difficult to set up, It works now but the quality of the video (on YouTube) is not so good, It's kinda slow.", "verified": true, "helpfulness": "0/0", "author": "M. G."}, {"rating": 5.0, "review": "This is a great device , It has great range, and works good , I had use it for netflix and other video devices , I think the software could be better it is super fast and it takes right over .I would recommend this over the other units available.I have several of them running", "verified": true, "helpfulness": "0/0", "author": "Mr. D \"Mr. D\""}, {"rating": 2.0, "review": "I had bought this with such high hopes based on a friends recommendation, for use in the tv built into my treadmill. I set it up, after one power cycle it totally forgot everything I had setup. So I had to set it up again, seems to have remembered this time. It only supports 2.4 Ghz on my wireless network, which then I have to change my laptop that I stream from down to 2.4 Ghz from 5 Ghz. The streaming is very choppy making it un watchable. So now it collects dust.", "verified": true, "helpfulness": "0/0", "author": "Garry"}, {"rating": 5.0, "review": "I LOVE THIS DEVICE.  Perfect for mirroring your Android phone.", "verified": true, "helpfulness": "0/0", "author": "frank carrero"}, {"rating": 5.0, "review": "Great product.  Everyone should have one of these.", "verified": true, "helpfulness": "0/0", "author": "Thomas Rippy"}, {"rating": 5.0, "review": "This is not exactly what I thought it would be, but that is my fault. Never less I can stream u tube from my lap top to my tv and that is great.I enjoy watching TED documentary on my lap top , now I can watch it on my big screen  tv. Later maybe I will stream other media from my lap top to my tv , but now I am thrill with what I have now.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Huber \"\" book sherlock\"\""}]