[{"rating": 2.0, "review": "Near complete fail, whether close or far from my wifi connection. I was so excited for this product, I purchased (pre-ordered) TWO of them. So disappointed... the streaming stalled, stuttered, and generally didn't work at all. I promptly returned both of them. Looking at purchasing a \"smart\" TV instead... seems to me the technology/price point to justify this is good.", "verified": true, "helpfulness": "0/0", "author": "An Amazon Customer"}, {"rating": 4.0, "review": "Absolutely love this product. Only reason I gave it 4/5 stars is because I was unable to set it up at my mom's house when I was at home for the holidays, that was disappointing.", "verified": true, "helpfulness": "0/0", "author": "Natalie Sutter"}, {"rating": 5.0, "review": "Works perfectly with my Galaxy S4 and iPad Mini to stream to my TV! Easy setup and very easy to setup! I love how small it is so I can take it whenever I go to a buddies house and whatnot. Highly reccommended!", "verified": true, "helpfulness": "0/0", "author": "Ruben"}, {"rating": 3.0, "review": "i like it and all BUT, i really was hoping to cast a tab via mobile devices like my nexus 7 or my phone. :( the programs on here work really well and everything but doesnt do anything i already had. I believe more updates and compatible apps will be coming soon so keep your fingers crossed and thats about it.", "verified": false, "helpfulness": "0/0", "author": "Bryan"}, {"rating": 3.0, "review": "I got this in lieu of a couple cords I would have had to get to connect my MacBook Pro to my TV because I thought it'd be easier to have something wireless. Have had a lot of difficulty with it so far.. I've basically had to go through the entire setup process every time I want to use it, and sometimes in the middle of using it if it's been on for a long block of time. When it does work, however, it works well, especially for Netflix, which is what I primarily use it for anyway. Hoping that the kinks will get worked out in the near future and that more popular apps will jump on board.", "verified": true, "helpfulness": "1/1", "author": "Gracia Goldberg"}, {"rating": 5.0, "review": "It gets the job done, I can watch any youtube video on this and anything on netflix and its pretty fast. Also you can project whatever tab if open on Chrome on there so basically anything you can find on the internet to watch, you can watch it on your TV with the chromecast. And I have a MacBook not a Windows PC and it works perfectly fine!", "verified": true, "helpfulness": "0/0", "author": "Krishna Shah"}, {"rating": 5.0, "review": "This is an amazing device.  I had my doubts, but they quickly vanished when I received this item.  5 minute setup and it was working perfectly.  It does what it does perfectly.  I was previously watching Netflix thru Windows Media Player on my HTPC, but now I am able to stream it in full 1080p, and trust me the increase in video quality is very noticeable.  I love this thing!", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 5.0, "review": "This dongle is about the best thing since sliced bread. I love that on my second tv, the only thing plugged into the back is this little guy. Plus the new additions of Hulu Plus and HBO go have been fantastic. My one suggestion would be that the next addition be Flixster or Vudu. That way my movie collection could be readily available via Chromecast. This player is simple, elegant, and absolutely amazing.", "verified": true, "helpfulness": "0/0", "author": "JMoose"}, {"rating": 1.0, "review": "I had high hopes for the Chromecast, but it is of no real value in home entertainment.  First, one would assume that this little stick it a little android computer onto which one could install apps and use your phone or tablet to control.  WRONG.  The chromecast is no better than the intel streaming video feature that was a bust from a couple of years back.  Remember that?  You buy an Intel enabled laptop chipset that pushes your screen to a tv using a special box that hooks to the tv....that one...remember? Of course not, they don't make it anymore because it was such a bust.  Same principle, cheaper hardware and equally lackluster result.What you will get with the Chromecast is access to a handful of apps that must be on your device.  This includes Netflix and Youtube and a few other odd apps.  No Xfinity.  No Direct TV.  No web browser unless you want to use your PC/MAC laptop with the device.  Again, just like the old Intel push to tv concept.  BTW, if I'm using my laptop, then what's the point?  I can just hook an HDMI cable my TV and be able to use everything on my laptop with the TV as a clone display.  In fact, you can do the same with your droid tablet.To add to limited options, you also have performance issues.  In particular, using the chromecast with my Samsung tablet, Netflix will fade out to black after a few minutes.  I still hear the sound, but no picture.  If I switch to another HDMI input, then back to the chromecast input, I get the picture back.  Really annoying.I want something that works out of the box with no bugs.  Want to be able to play internet content on the tv without a pc.  Chromecast does neither.  I suggest you avoid it until they substantial improve it.  I wasted 3 hours screwing with this thing. It is not intuitive and has is buggy.  Expected more from google.I am shocked at the number of positive reviews for this product.  It is a DOG.", "verified": true, "helpfulness": "1/3", "author": "mrob1"}, {"rating": 4.0, "review": "The Google Chromecast HDMI streaming media player was reasonably priced, simple to hook up, easy to activate.It is a welcome addition to our household media devices. It is important to ensure that the WiFi signal is strong to avoid connection issues.I'm sure that the number of supported media services will increase in the future making this little device even more popularVery satisfied!", "verified": true, "helpfulness": "0/0", "author": "Hal Puchalski"}]