[{"rating": 5.0, "review": "VERY  GOOD  AMAZON  YOU  DID  A  VERY GOOD JOB ON THIS!!!", "verified": true, "helpfulness": "0/0", "author": "Michael Salenga"}, {"rating": 5.0, "review": "I do really like the Fire TV. I got it on the free trial offer and ended up keeping it. I primarily use it for Netflix, but I also watch a lot of the HBO content available via Prime. There are some titles that are offered on both Prime and Netflix, but Prime adds enough additional content that I always have something to watch. The device itself works well, the interface is nice, the voice search is neat. My only complaint is the damn thing takes forever to sleep. I do like that it can turn my TV on via HDMI when I turn on the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "W. Littler"}, {"rating": 4.0, "review": "Nice but there is no YouTube as stated! Where is the cost for Amazon Unlimited Movies & TV episodes?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"ByzantineFlowers.com\""}, {"rating": 5.0, "review": "Well worth the money!  Easy set up!", "verified": true, "helpfulness": "0/0", "author": "Todd panek"}, {"rating": 5.0, "review": "Great way to watch great movies! Amazon Prime has such a great selection of movies! We also love the easy way to search for movies, TV shows etc. the voice search works great! Highly recommendable!", "verified": true, "helpfulness": "0/0", "author": "Angelika Linke"}, {"rating": 5.0, "review": "I love this!  We use it daily.  My kids use it, my wife uses it.  It is perfect.It has the best interface for netflix I have ever seen, and the interface for the prime videos is quite easy to navigate.  It was also easy to install XBMC / KODI on, so it functions as our everything entertainment platform.  It plays everything in 1080p, and no lag time at all. Great processor, great product.  I wish I had bought two of these, instead of also a firetv stick, as the stick cannot process nearly as well as this can...I only wish that my Amazon Echo could also control it.  Seriously, that would be nice Amazon.  \"Alexa, pull up youtube on the firetv and play 'let it go' from frozen.\"", "verified": true, "helpfulness": "0/0", "author": "Ty"}, {"rating": 5.0, "review": "Great entertainment and saves money while getting fast shipping.", "verified": true, "helpfulness": "0/0", "author": "Larry Locke"}, {"rating": 4.0, "review": "It is really nice. Like it. Lot!!", "verified": true, "helpfulness": "0/0", "author": "Phyllis Mayer"}, {"rating": 5.0, "review": "Very easy to use love", "verified": true, "helpfulness": "0/0", "author": "Linda Nix"}, {"rating": 1.0, "review": "In just a couple of days I had used up my data allowance on my internet plan. Not an inexpensive way to watch TV. The current shows weren't available. Mostly shows that we a few years old.", "verified": true, "helpfulness": "0/7", "author": "Matt Steitzer"}]