[{"rating": 4.0, "review": "The first unit I received would disconnect from the network after just a few seconds of use. Amazon sent me another and it's working like a champ. It does exactly what it says it does, and does it well. My wife likes to use it for Facebook sessions when she has a friend or two over.Plus it's great for displaying photos on the big screen. Plugging this tiny thing into a dumb TV makes it much smarter.It gets 4 stars instead of 5 simply because of a lack of compatible apps. The list is growing but it's fairly limited at this time. I just learned that Vudu has been added to the list, which is key for me. The ability to watch Vudu content on my no-frills 37\" LCD will be awesome.", "verified": true, "helpfulness": "0/0", "author": "Gonnzo"}, {"rating": 5.0, "review": "Absolutely love the chromecast. I use it all the time now!", "verified": true, "helpfulness": "0/0", "author": "Spr0ckEt"}, {"rating": 5.0, "review": "Bought it for $29.99...can't say anything about it that hasn't already been said.  I actually stopped cable service and only have internet now because I stream everything to my TV's through the chromecast.", "verified": true, "helpfulness": "0/0", "author": "Grant Wood"}, {"rating": 5.0, "review": "Excellent!", "verified": true, "helpfulness": "0/0", "author": "arquin"}, {"rating": 5.0, "review": "By far the cheapest and smallest way to get netflix, pandora and youtube to your TV.A fair number of times we've had it loose connection, which stinks, and this device doesn't appear to be able to be set up from a desktop computer.  Still totally worth it.", "verified": true, "helpfulness": "0/0", "author": "gman"}, {"rating": 1.0, "review": "I returned this product because it would not work with my cable provider. I purchased it solely because I wanted to watch MLB on my TV instead of just on my laptop. Even called my cable company and they came out and tried various things without success.", "verified": true, "helpfulness": "0/2", "author": "Jim"}, {"rating": 5.0, "review": "what a great device! I have an apple TV and this is by far, much better and convenient.", "verified": true, "helpfulness": "0/0", "author": "Moe_Lluna"}, {"rating": 5.0, "review": "I use this thing every day to watch netflix, it does exactly what I needed and even allows you to screencast movies streaming from your computer. Great little device! but MKV files aren't supported when streaming from your computer and the video will work but the sound won't. No big deal since it's not what the device was intended to do.", "verified": true, "helpfulness": "0/0", "author": "James R Lopes"}, {"rating": 2.0, "review": "Issue: will not connect to internet.This is the 2nd Chromecast unit I have - and is located on my upstairs TV; the 1st CC is on my downstairs unit, located near router. This 2nd CC installed fine but cannot connect to Internet, rendering it useless. I left messages on Google Tech forums but noone has come up with solution. I'd be wary if you are buying a 2nd CC to access the same router as your 1st CC unit.Fwiw, I installed Amazon's FireTV unit where the 2nd CC unit was to be used - and the FireTV works perfectly. So I'm not sure the distance from the router is the issue. The CC unit may be defective but the window of time to return the unit has expired (while I attempted to resolve the issue).", "verified": true, "helpfulness": "0/0", "author": "sjhersh"}, {"rating": 4.0, "review": "I'll give 5 stars if it can \"Naturally\" handle Amazon Instant Video", "verified": true, "helpfulness": "0/0", "author": "Gabriel"}]