[{"rating": 5.0, "review": "This little machine is great, I can honestly say it performs much better then my appleTV! easily stream your home movies via PLEX and xbmc friendly!! happy with my purchase!", "verified": true, "helpfulness": "1/1", "author": "Jonathan Rosado"}, {"rating": 5.0, "review": "I know nothing about electronics and have been 'wowed' by this device...the setup was easy, breezy, covergirl, literally...  Take it out the bag, plug it up, connect to your wireless connection and presto...that's it.  The voice command is \"everything\".  We were watching cable news and my housemate picked up the remote and pressed the 'voice' button and Amazon Fire TV came right up...no switching channels, no setting and/or re-setting the device, no configuring the TV...nothing.  I'm still learning about the many capabilities of this device but am pleased with its' operations so far...way to go, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Mikal Nabors"}, {"rating": 4.0, "review": "Amazon created a powerful small black box that is the new high end of streaming media players easily beating out Roku, Apple, Sony, et al. in both design and function.The tech specs easily beat out anything else on the market and it shows with its performance.However this high performance media vechicle only comes with limited options in terms of apps (channels for Roku users).The price while higher than the bottom line players, is not really far from the higher end players, so comparing it on price like so many others do is a moot point.Hopefully Amazon will address the apps issue as I really hope to see HBO Go, WWE Network, and a decent Weather app added soon since those are services I use as much as Amazon Video and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Zlade \"zladestraker\""}, {"rating": 1.0, "review": "I am so upset with Amazon right now! They were providing an abundant number of tv shows and movies through Amazon Prime that was easily accessible through the roku. Now for the people that have been using Amazon Prime and streaming videos through their roku, they have to pay a higher membership fee for prime and buy an Amazon Fire box. Why are you doing this Amazon? Raising the prices and making us spend money on more equipment? Not very affordable! I will probably have to close my prime membership and no longer be able to stream movies from Amazon over my roku. It was good while it lasted......", "verified": false, "helpfulness": "7/31", "author": "sylvia"}, {"rating": 4.0, "review": "I would have given this a 5 star rating but I am an HBO Go watcher not showtime. so when they come out with HBO Go app I will rate this little bad ass a 5!!Alot of people think also that its not DLNA complient but it has PLEX app, so it does work.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product- well designed, easy to navigate and the remote is great! Love this product and would reccomend it over its competitors.", "verified": true, "helpfulness": "0/0", "author": "Lindsey Jones"}, {"rating": 5.0, "review": "I have a TV with a lot of channels, but often can't find anything I want to watch.  So with my Kindle Fire TV, and can just choose a BBC series, and fling it at my TV.  Then settle back for complete entertainment - a wonderfully produced show at the time when I want to watch it.  I can catch up with episodes that I missed.  I can try a new series and decide if I want to watch it.  I can have a marathon and watch everything until my eyes get buggy.  This is the most convenient way to enjoy shows.  The interface is flawless.  You just say what you want to watch, and it brings up your choices.  Our FIOS interface is so clunky that we hardly ever watched anything.  With Kindle fire, I just might not leave the house.", "verified": true, "helpfulness": "0/0", "author": "J. Lipoti"}, {"rating": 2.0, "review": "This is a great device with optimal resolution and fast downloading service,but unfortunately the options for my geographical area (Ecuador-South America)  are too limited..  I can use only netflix because with Amazon Fire Tv  I can't access to youtube, while with apple tv I can ! .  If this can be improved I'm more than sure that Amazon Fire Tv will be much better than apple tv", "verified": true, "helpfulness": "1/3", "author": "Maria Aguilar Gallardo \"Maria Aguilar\""}, {"rating": 5.0, "review": "This is a great device with a good user Interface and fast performance along with many great applications. It is well worth the 99 dollar price tag.", "verified": true, "helpfulness": "0/0", "author": "Douglas C. Hawes \"New Investor\""}, {"rating": 5.0, "review": "This is a pretty amazing little box.  I have had WDTV boxes, a boxee box, and a roku in the past, this thing blows them all away.  Combined with the Plex app I am able to have access to everything that I need from a single front-end, all of my local content as well as quick access to my Amazon stuff and all the free goodies from Prime.", "verified": true, "helpfulness": "0/0", "author": "M. Marhanka"}]