[{"rating": 1.0, "review": "This is a great product if you want to keep your computer open and running 20 feet away from the tv that you are streaming to.  Terrible otherwise.", "verified": true, "helpfulness": "1/2", "author": "The Bee's Mama \"Ms K\""}, {"rating": 5.0, "review": "I own just about every streaming device made -- AppleTV, Roku, WD, \"smart\" TV apps, etc. This one works the best of any of them, and it's completely portable. Chromecast now has support for most major streaming apps like Netflix, Hulu Plus, HBO Go, and YouTube, plus it supports Plex beautifully for watching your personal media library. You can actually take this with you when you travel -- setup on new devices takes seconds. I have had no problems streaming 1080p files on this. And the price is about a third of what Roku 3 or AppleTV will cost you. Absolutely essential device for video lovers.", "verified": true, "helpfulness": "0/0", "author": "Jake Fantom"}, {"rating": 5.0, "review": "I use this to stream HBO GO to my TV and it works flawlessly. My one complaint is that I wish there was more control over fast-forwarding/rewind so I could skip the opening credits. Otherwise, full marks.", "verified": true, "helpfulness": "0/0", "author": "B. Taxy"}, {"rating": 5.0, "review": "Item arrived quickly and was set up in a couple of minutes.  Extremely easy to use and has been a wonderful addition to our television experience.", "verified": true, "helpfulness": "0/0", "author": "James Veillette"}, {"rating": 4.0, "review": "Being able to cast from my phone, tablet, or laptop is awesome!  I mainly use it for NetFlix casting from my tablet.  Can also cast tabs from Chrome from your laptop.  Comes in really handy for me as I no longer need to run an hdmi cable from my laptop to my tv.", "verified": true, "helpfulness": "0/0", "author": "franky jun"}, {"rating": 5.0, "review": "Best $35 I ever spent! Works ás promised. Easy to install & use. I really like how you can use your smartphone, tablet or computer to stream.", "verified": true, "helpfulness": "0/0", "author": "June Saxton"}, {"rating": 5.0, "review": "I got ordered a Chromecast the day it came out and have used it to watch a lot of online content. You can queue and watch youtube videos, Netflix, Hulu Plus, ESPN, stream music from Pandora, Rdio, and more applications will stream to your TV from your other device. If you plug the Chromecast into the wall, by hitting cast in one of the apps, your TV gets turned on and automatically changes to the right HDMI channel. However, if you can't/don't want to plug it into the wall, you can power the Chromecast from the TV if it has a USB port on the TV. When the TV is powering the Chromecast, you can't power on the TV by hitting cast.When streaming from your computer and not a dedicated app, there is a slight delay, but it's detected and the audio and video get realigned pretty well. The quality is much better when using a supported app, so when possible, do that.I have thoroughly enjoyed my Chromecast for streaming online content and have bought some for gifts for other people. I highly recommend it if you want to watch Netflix or ESPN (and more) on your entertainment setup instead of a phone or computer.", "verified": true, "helpfulness": "0/0", "author": "Cody"}, {"rating": 4.0, "review": "Works well with programs like You Tube,  but still waiting (7 months later) for the software that will allow you to throw computer screen and programs on the TV", "verified": true, "helpfulness": "0/0", "author": "Chuck D. Nelson \"jammerman 03\""}, {"rating": 2.0, "review": "The image in my Samsung 55\" is not HD, it has very low quality, but I have to consider the price.", "verified": true, "helpfulness": "0/0", "author": "Elton Celio De Oliveira \"Elton\""}, {"rating": 2.0, "review": "Mine worked fine for a while.  It was fun to cast videos to it.  But then it just died a few months later.  Can get it to reset.  Just has a solid red light on it, and screen says \"chromecast ..\"", "verified": true, "helpfulness": "0/0", "author": "Dominic Paz \"Dom\""}]