[{"rating": 4.0, "review": "I use this with HBO GO and You Tube a lot. I can also stream video from my android.I wish there were more support from Apple. I can't stream video from chrome on the iPad, which stinks. Few applications support casting at this time. But for the price this is a no-brainer. I wasn't sure how much I'd use it, but it's been almost nightly for the past few months.", "verified": true, "helpfulness": "0/0", "author": "T. Beaulieu"}, {"rating": 4.0, "review": "A bit sluggish, but I do like the chromecast concept and will use it with youtube on occasion.  However, I still use my roku for most other functions.", "verified": true, "helpfulness": "0/0", "author": "zaphod"}, {"rating": 5.0, "review": "exelent....", "verified": true, "helpfulness": "0/0", "author": "Jesus"}, {"rating": 5.0, "review": "Probably one of the most significant products that google has ever made.  This should be in everyone's house!!!!!", "verified": true, "helpfulness": "0/0", "author": "Jmyu"}, {"rating": 5.0, "review": "My father purchased this and I traded him for my Fire Stick. I have used a chromecast for a long time now and I just don't really like the way the Fire stick works. If I had to choose between the two I would pick the Chromecast for sure.", "verified": true, "helpfulness": "0/0", "author": "W1ll1am"}, {"rating": 5.0, "review": "no problems yet", "verified": true, "helpfulness": "0/0", "author": "G. Rodriguez \"G rock\""}, {"rating": 4.0, "review": "A little bit tricky to setup and requires a few software install in your mobile or tablet, but once it's done it's completely addictive.Very stable and fast and images are pretty clear.", "verified": true, "helpfulness": "0/0", "author": "orlando encina"}, {"rating": 5.0, "review": "excelente", "verified": true, "helpfulness": "0/0", "author": "Lorena Lopez"}, {"rating": 5.0, "review": "only need to get 2 more than my whole how will have them i love them that much!!!!", "verified": true, "helpfulness": "0/1", "author": "Ruthanne Tucker"}, {"rating": 1.0, "review": "it was broken when I received it it must have been somebody else's return", "verified": true, "helpfulness": "0/0", "author": "dixon e allen"}]