[{"rating": 5.0, "review": "Awesome gadget to convert your normal tv has su smart. Its great to use Netflix or YouTube at tv. I like so much.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "Great gadget for little money! Works like a charme and does exactly what it's expected to do... not more, not less :-)", "verified": true, "helpfulness": "0/0", "author": "Kristian Peetz"}, {"rating": 5.0, "review": "Best thing ever!! Simple, useful, watch my chrome tabs and youtube on tv!! And for the price it is worth it.", "verified": true, "helpfulness": "0/0", "author": "Isauro"}, {"rating": 5.0, "review": "I really love it. It is easy to set up and works flawlessly. I recommend this product if you wasn't an easy way to get internet content and music into your living room.", "verified": true, "helpfulness": "0/0", "author": "Niko"}, {"rating": 5.0, "review": "Product works as expected, perfect for casting YouTube videos and chrome tabs directly on the tv screen! Very good product !", "verified": true, "helpfulness": "0/0", "author": "gaetan d"}, {"rating": 5.0, "review": "Even though Amazon warned me about the possibilty of a lesser experience in Europe, I love my ChromeCast. Easy setup and it performs just like I expected.", "verified": true, "helpfulness": "0/0", "author": "M Veltmaat"}, {"rating": 5.0, "review": "it's brilliant! for those that have older tv's that are not smart...most of the smart tv's have this option of sharing content from your mobile device to the screen anyway...", "verified": true, "helpfulness": "0/0", "author": "MR MINDAUGAS SCIUKAS"}, {"rating": 4.0, "review": "It worked with YouTube and pandora , delivery to Australia was expensive but I am happy enough with it thanks", "verified": true, "helpfulness": "0/0", "author": "Peter manderson"}, {"rating": 4.0, "review": "Very easy to set up and use looking forward to more app support.Excellent device works like a dream, makes streaming from phone and tablets so simple.", "verified": true, "helpfulness": "0/0", "author": "konrad thomas"}, {"rating": 4.0, "review": "The Chromecast does everything I expected it to, and does it very well. My only complaint is that the number of apps that support streaming to Chromecast is a bit limited at the moment. It also doesn't support admittedly crap technologies such as Silverlight. Still, if you want a great yet simple and cheap streaming device, this is a great buy.", "verified": true, "helpfulness": "0/0", "author": "Andreas Eklöv"}]