[{"rating": 5.0, "review": "Great for YouTube music and media.", "verified": true, "helpfulness": "0/0", "author": "Abel Salas"}, {"rating": 2.0, "review": "Cool, but sending it back for the Amazon Fire stick. Google is now outdated, slower, and has to broadcast through your mobile device, it does not connect to wi-fi on its own.", "verified": true, "helpfulness": "1/1", "author": "Lindsey"}, {"rating": 5.0, "review": "Arrived on time. Works flawlessly. Thinkijg about hetting one for each TV in the house.", "verified": true, "helpfulness": "1/1", "author": "Diego Martinez"}, {"rating": 5.0, "review": "Perfect for my family. Works great on Netflix, YouTube, and have had no issues streaming local media files using several different methods. With the growing number of apps available, it only gets better.", "verified": true, "helpfulness": "1/1", "author": "M. Axford"}, {"rating": 5.0, "review": "Mother in law loves it!  Not everything can be sent to your tv from your phone. Only YouTube videos. No videos from your phone. Nexflix works well.", "verified": true, "helpfulness": "0/0", "author": "April Mhire"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "pengyang"}, {"rating": 1.0, "review": "I purchased my chromecast six months ago. The first four months were great, never skipped a beat and I was enjoying casting youtube and netflix on my HDTV.  Unfortunately, that is when things turned sour. All of a sudden I started having the dreaded \"brain freeze\" error.  The chromecast would reboot, and tell me to try again, only to brain freeze yet again within ten minutes.  Unless you are watching shows that cast for less than ten minutes, I suggest you look elsewhere. I'm hoping amazon takes this unit back after this much time, because I feel like I've been robbed!!  I'm actually surprised the reviews are still so high for this device, since I seem to see many who are having the same issue. Perhaps we all just got defective units.", "verified": true, "helpfulness": "14/16", "author": "GeoCorb \"quidproquo\""}, {"rating": 5.0, "review": "Best purchase. Love it.", "verified": true, "helpfulness": "0/0", "author": "shankar venkatraman"}, {"rating": 5.0, "review": "nice", "verified": true, "helpfulness": "0/0", "author": "Kavandez"}, {"rating": 3.0, "review": "Not hard to use after you practice many times. Also, many interruptions in broadcasts", "verified": true, "helpfulness": "1/1", "author": "Vicki G. Gussen \"avid reader/observer\""}]