[{"rating": 4.0, "review": "The Fire TV is a very powerful, and yet extremely small device.  It has a dual band antenna which makes it very easy for me to ensure good QoS to it, and as such have never seen any problems with connectivity.  The remote is blutooth connected, which means it doesn't need to be pointed towards the TV at all (Which I'm still getting used to, but is very nice), and fits in your hand easily.There are a couple downsides for me though.  Firstly, short of physically unplugging it, you cannot control when it turn off. And second, some of the apps advertised on Amazon.com cost money just to download (Plex is the one I am thinking of at the moment).  There isn't an internet browser either, so if I want to access my own local media, I am forced to have to pay for it.", "verified": true, "helpfulness": "0/0", "author": "tdjackson"}, {"rating": 5.0, "review": "I was hooked from the get go.  What more can I write?  This is the best purchase I've made in quite some time.", "verified": true, "helpfulness": "0/0", "author": "maggie"}, {"rating": 5.0, "review": "LOL ... but honestly, this little box is awesome.  I'm a bit bummed that I have to have a cable provider to access the Showtime Anytime and probably the same with HBO Go.  Most of the actual stations you would get with cable still require you to have cable to access them.  But here's the thing, Amazon is staying cutting edge and I feel confident that, as the cable tide changes to Internet TV (and it will), Amazon will be a front runner and will continue to update this little gem so I not only purchased it for everything it offers me now but for everything I know it will be offering me in the future.  Oh and the voice recognition actually does work incredibly well.", "verified": true, "helpfulness": "0/0", "author": "Shelly B. \"S.\""}, {"rating": 5.0, "review": "Great tool, replace my Apple TV just to give this a try.  Runs great with Plex and streaming netflix, amazon, and hulu plus.  Really fast and no problems at all!  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "!! \"GOAT11\""}, {"rating": 5.0, "review": "Finally a \"toy\" which actually recognizes my voice...and my husband's voice.  This was very easy to connect to the television - took about 5 minutes and we were good to go.  I love that I was able to add my personal pictures to the screen and make it default to showing personal photos when not in use.  There's a large selection of TV shows, movies and games available and, in conjunction with my Amazon Prime account, many of them are free.  I am currently working my way through all 8 seasons of \"The Closer,\" and my husband is working his way through old episodes of \"The Walking Dead,\" or some such nonsense.  I am hoping that as time goes on more shows will be offered for \"free,\" and that Amazon will add some newer movies but for now, this is quite enjoyable and easy to operate.  If you have Amazon Prime you do have to be a little careful about how you \"order\" things to watch - make sure you hit \"Watch with Amazon Prime\" or you will be charged for your show.  I made the mistake of not doing so but Amazon very graciously credited my account when I told them of my blunder.", "verified": true, "helpfulness": "0/0", "author": "LoLo"}, {"rating": 2.0, "review": "Loved the speed...hated the format of the grid and having to pay for almost everything.  Signed up for Prime, but Amazon has buried most of the selections in their entire library of shows.  Also, when you click on \"Other ways to Watch\", and it takes you to Hulu or wherever else the show may be watched...it doesn't take you directly to that show...you then have to search again within the other app.  It's like they discourage people from NOT using Amazon, and paying to watch something to avoid the frustration and time it takes.  I don't want to pay for every episode of every TV show and movie.  I sent it back and bought an Apple TV...I can stream videos and movies FREE from my Iphone, as well as watch History Channel, A&E;  FREE and more on their selections.", "verified": true, "helpfulness": "4/7", "author": "Rhonda Lampton \"Crafty Mom\""}, {"rating": 4.0, "review": "Much better then the usb devices i had before.  Makes netflix better to navigate. As for Amazon Prime TV, i am still evaluating. I think it needs more that is free to watch for the price.", "verified": true, "helpfulness": "0/0", "author": "DMH"}, {"rating": 3.0, "review": "We are in a rural area so the speed available is not adequate for this. Another thing was the small variety of channels to get. There were no Christian channels (the main reason we wanted one). I do have to say though, the picture quality was great!. In a year or two when the channels increase in number and we have better wi-fi, we will probably try it again.", "verified": true, "helpfulness": "2/2", "author": "D. Stickrod \"DJS\""}, {"rating": 3.0, "review": "Easy instalation, great performance. Somehow I miss amazon recommendation to help me find content. Still, very \"internet\" / app oriented... It suppose to be TV (leanback mode)", "verified": true, "helpfulness": "1/2", "author": "FABIO R SOUZA"}, {"rating": 4.0, "review": "We are well pleased with the TV Fire.....at reasonable price, enables streaming of wide array of programming.  Simple to operate and reliable, highly recommended as a source of good viewing and a wide array of games.", "verified": true, "helpfulness": "0/0", "author": "Carolina"}]