[{"rating": 5.0, "review": "Very good!", "verified": true, "helpfulness": "0/0", "author": "Fabio Sarcansky"}, {"rating": 1.0, "review": "Not very good product also can't go on 5g network so sucks even more", "verified": true, "helpfulness": "0/0", "author": "Steven Rodriguez"}, {"rating": 5.0, "review": "Cool!!! My Kids use it a lot for playing YouTube from their iPhones on the TV.", "verified": true, "helpfulness": "0/0", "author": "Boaz Katz"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "Eduardo Corella Molina"}, {"rating": 2.0, "review": "Meh at best....", "verified": true, "helpfulness": "0/1", "author": "Barclay G. Smith"}, {"rating": 4.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Jesse"}, {"rating": 5.0, "review": "We love this and use it most to watch movies on Netflix and Youtube videos.", "verified": true, "helpfulness": "0/0", "author": "SABINA L VAZQUEZ"}, {"rating": 1.0, "review": "I'm sure it's a great product but the way it operates will only work if you have control of your internet router. I am a college student and the Optix internet used in my complex does not support it because it uses \"Access Point Isolation\" to protect it's tenants. Optix confirmed that the Chromecast is the only device that won't work. It even says in the troubleshooting fine print, \"If you do not have access to your router settings, or if you are attempting to connect through a guest, hotel or public network with AP/client isolation, you will be unable to set up your Chromecast.\"So unless you have your own router in your home or apartment, don't bother.", "verified": true, "helpfulness": "0/0", "author": "Connor"}, {"rating": 5.0, "review": "I love my chrome cast!If you watch YouTube, google play movies and music, pandora, and Netflix Hulu than you need one of these! Very very simple setup but I found its easiest to use a tablet computer to run the chrome cast.", "verified": true, "helpfulness": "0/0", "author": "William Shoupe"}, {"rating": 4.0, "review": "A small wireless streaming device that turns any TV with HDMI ports into a SmartTV.I purchased this last year for my mom to allow her to easily stream Netflix to her living room television. The television does not have built in wifi. The television is also a Sony from a few eyars ago, so it required a very specific Sony wifi adapter, which was not in production anymore. This elft me with 3 options:1) Go out and overpay for a device no longer in production2) Drill some more holes in her walls and run some cable3) Find an input device that has its own wifi connectionBecause I value my time, money, and sanity, I went with option 3. The Chromecast had recently come out and was receiving good reviews. Being somewhat a Google fanboy, I gave it a shot. The $35 price tag was also an incentive, The most comparable device, the Roku streaming stick, was $50.I showed my mom how to stream from her laptop and iPhone and even played a movie off my Android phone. The only issue I have is that it is still somewhat tedious to stream to it, since it does not have its own controls. You are reliant on whatever app or service you are trying to use to be compatible. This was an issue early on, but has vastly improved. However, Amazon Streaming Video is still not available (gee, I wonder why). Also, mirroring is not very well supported, requing Windows 8.1 or an Android device. Even if you meet one of those requirements, it is not as seemless as some other options. Chromecast also lacks a convenient way to control it, meaning you eithe rneed to keep unlocking your smartdevice or computer to use a \"remote\". It still surpasses most \"Smart\" TV interfaces I've seen, though.If you are looking for a way to extend your computer or smart device to a larger screen, there are better options. However, Google is working on ways to better utilize Chromecast and there are plenty of new apps and extensions coming out for it.If you are looking for an affordable and relatively easy way to stream most of the major services and some of your own media files, the Chromecast is a great choice.", "verified": true, "helpfulness": "0/0", "author": "Urban Techie"}]