[{"rating": 5.0, "review": "i dont know if its a good thing but since getting this device im actually watching my tv more often. my friends and family are amazed at how i load a movie from play store from my phone ( HTC One ) and send it to my 40 inch TV. now all microsoft needs to do is make one for windows media player to stream to tv too and my world will be much more complete.", "verified": true, "helpfulness": "0/0", "author": "M. irving"}, {"rating": 5.0, "review": "You really cannot beat this solution at the $35 price tag. Super easy to set up and use. I have purchased this for multiple people as gifts and every one of them thanks me on a weekly basis. Everyone should own one of these.", "verified": true, "helpfulness": "0/0", "author": "Lovepinke"}, {"rating": 3.0, "review": "its weird how i have to take my password off my Belkin router in order to use this, and also Netflix isnt working on it and i did update both Netflix and the Chromecast", "verified": true, "helpfulness": "0/0", "author": "katey huf"}, {"rating": 5.0, "review": "35-BUCKS for this!!!!!! ... WOW! ... Works great. Leave to to Google to fill a niche. Works great. Worth every penny of this inexpensive item.", "verified": true, "helpfulness": "0/0", "author": "Chicharon"}, {"rating": 5.0, "review": "So glad it had the additional bendable adapter to fit into the TV. It was super easy to setup once the wireless network found it. A little concerend about the note in regards to the unit getting hot so we unplug the power adapter when it is not in use. The movie easily loaded from our tablet and was glitch free.", "verified": true, "helpfulness": "0/0", "author": "TSampson"}, {"rating": 5.0, "review": "We use Plex media player and Netflix for 90% of our TV time. This thing is a perfect fit for our house. I bought 4 and put one in each room. Basically, you take any mobile device (iPad, iPod, smart phone, windows tablet, etc) and the devices have apps. The apps listed on Chromecast website will have a \"wireless icon\" at the top for casting. You touch that icon and select a chromecast, then click play and BAM! HD streaming content from your media server or from a service like Netflix, Hulu, etc.Setup was also easy. Basically the Chromecast has its own wireless card, so plug it into the TV and USB power. You goto your PC or Mac computer or laptop, and visit the Chromecast URL. You install the Chromecast application to your computer which finds \"available Chromecasts that need setup\". You follow the easy 3-4 simple steps of connecting to the Chromecast, then connecting your Chromecast to your home wireless network. Then any mobile device on your wireless network can stream to any Chromecast. Took me about 15 minutes to setup the first one, and like 5 minutes to setup the second.", "verified": true, "helpfulness": "0/0", "author": "Seth Carstens \"Seth Carstens\""}, {"rating": 5.0, "review": "I bought this as a gift at Christmas.  I have heard nothing but praise for it.  You can steam anything you want onto your TV from your computer.  Makes any TV a smart TV for less than $40.", "verified": true, "helpfulness": "0/0", "author": "Edie"}, {"rating": 5.0, "review": "I have a Samsung smart tv, but I use the chromecast apps since they make it so easyI use HBO Go and Netflix on Chromecast very regularly. From my Android phone or my Macbook Air. UI is seamless, and very easy to setup. Highly recommended for it's very small price", "verified": true, "helpfulness": "0/0", "author": "Manny K"}, {"rating": 1.0, "review": "If I were YOU, I would Spend the extra money and go purchase yourself Apple TV, which may be hard to install but you will be so glad that you did... This product I highly do NOT recommend.", "verified": true, "helpfulness": "0/3", "author": "Cindo45"}, {"rating": 3.0, "review": "Since I already have a Roku player, the main reason I bought te Chromecast  was to view video streams on my TV that are not available through Hulu, Amazon prime, Netflix etc. I have mixed feelings about its performance. Youtube videos play well and it's nice not having to run an HDMI cable from my laptop to TV. However streaming internet video is a big disappointment. I tried watching Olympic highlights and it was a bust. Lots of lag and frozen images.The Google Chromecast help menus basically put the blame on my laptop. Yet, the streaming is perfectly fine on my PC.I think what I really need is just something that will emulate an HDMI cable. If I can find this, I'd consider returning this unit as it doesn't live up to my expectations.However, if your intent is to use it to watch Youtube videos or to view Chromecast friendly programs, perhaps it's a good, inexpensive solution.", "verified": true, "helpfulness": "0/0", "author": "D. Fisch \"Dave\""}]