[{"rating": 1.0, "review": "no ethernet portno huge collection of appwhy bother?  please dont tell me wireless is better than ethernet connection, LOL.", "verified": false, "helpfulness": "0/5", "author": "anonymous"}, {"rating": 4.0, "review": "The only detractor is the limited set of content that can be casted from my tablet or laptop, but otherwise it works perfectly and is simple to configure.", "verified": true, "helpfulness": "0/0", "author": "John Korecki"}, {"rating": 5.0, "review": "I bought this as a gift for my daugter and she loves it. The install and set up were very easy. She can take this anywhere that has an HDmI connection in the tv and wireless.", "verified": true, "helpfulness": "0/0", "author": "Mary Ann"}, {"rating": 5.0, "review": "Figured out how to watch videos from my collection in HD on my TV!The best value for the money I have ever learned!Going to watch Q.I. ... the one thing is needs is an app for video. (My way is a little wonky, but it does work,)", "verified": true, "helpfulness": "0/0", "author": "Will Silver"}, {"rating": 1.0, "review": "My Order was placed August 1, I received the Chromecast on September 10th. It was back-ordered so that's understandable. However, the unit I have never worked right. Streaming for my pc, my iphone, my ipad, my sons laptop - works for a short time, then the Chromecaster reboots/resets itself.It could be iTunes, YouTube or anything cast from Chrome itself using the tab-cast method. Same results regardless. Works for a bit (5 or 10 minutes) - then boom - reboot. And once the reboots happen, it seems to shorten the time until hit happens again.I called customer service and at first they were very helpful. Trying any number of things, resets, moving it to a different hdmi port on the tv, moving it to another tv. But none of this helps. It still happens.And the customer server has gotten worse and worse. At first they stayed on the line and waited for the result - then they moved it to emails, where I had to wait days if not longer in between replies and those replies were useless, suggesting things that had already been tried or demanding things like proof of purchase and then not replying for a week after it's provided.I would have sent it back and gotten a replacement but they were still back ordered in September and I figured Google would actually take care of their customer. I guess that was my mistake.Here I am, a month later and no resolution. No response from customer service and no working chromecast.", "verified": true, "helpfulness": "119/152", "author": "Thomas S Flanagan"}, {"rating": 5.0, "review": "I love this device. I think my favorite part is being able to search for specific titles on my phone and send them straight to my HDTV. This is way easier than using an arrow on a TV or console remote to navigate through an onscreen menu.Scrubbing forward and back on a movie could be better. It's hard to go forward or back only a minute or two or stop on exactly the right spot.", "verified": true, "helpfulness": "0/0", "author": "Jimmy V"}, {"rating": 5.0, "review": "Just as I had finished installing my son, who wasn't really paying attention, discovered he could \"cast\" the show he was watching on Netflix on his iPad on to the TV. He called it \"dark magic\".", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"paki bhai\""}, {"rating": 2.0, "review": "Well it works only marginally plus it forces you to install Google Chrome.  If it had cost more, I would have returned it.", "verified": true, "helpfulness": "0/1", "author": "William B. Morland"}, {"rating": 1.0, "review": "I bought this to stream from my devices to my TV/Stereo system.  The Chromecast only work with a few apps and even fewer on iOS.  If you're trying to stream music from your iPad or iPhone to your stereo system or stream movies from your iOS apps it will NOT work.  The only thing that's of any use that works is Netflix streaming, which I already had through either computer hooked up to the TV, Roku, etc.Chromecast's limited appeal doesn't do it for me and it's going in the junk drawer.", "verified": true, "helpfulness": "0/1", "author": "Ross"}, {"rating": 5.0, "review": "Works as advertised.. If you have a smart tv already it's kind of redundant. No point.. But great if your tv doesn't have internet hook up. So far as I know the only things that cast are Netflix and Youtube.. I wish that it would cast ANYthing and EVERYthing I wanted it to. It works great so far. Bought for my parents who have a nice LG tv, but got their tv before wireless became standard in new tvs.", "verified": true, "helpfulness": "0/0", "author": "jeschiller"}]