[{"rating": 4.0, "review": "I got this so my PS3 wasn't running 24/7. This thing is amazing when it works. That last part is important. First time I used Hulu it would freeze and give me a black screen while continuing to play audio. Only on Hulu mind you. I reset the Internet and it's worked (mostly) ever since. My biggest peeve about it is the fact that it has no power button. You don't turn it off. It goes to sleep after 30 minutes and only if you're in the main menu, or you manually put it to sleep. That and the combination of a microphone in the remote (which works great btw) gives me a false sense of security. If someone wanted to, they could listen in. You could unplug it, which works. All in all, I love it. It's very responsive when searching through the menus, it's high def and the screensaver is a nice touch. If you have no concerns with anything I listed above, it's great.", "verified": true, "helpfulness": "0/0", "author": "Mitch Connor"}, {"rating": 5.0, "review": "It's really awesome, and easy to use.  It gives us many entertainment options to view, plus we have enjoyed watching some Amazon specific programming.", "verified": true, "helpfulness": "0/0", "author": "Scott M."}, {"rating": 1.0, "review": "It worked one time & I'm going to send it back !", "verified": true, "helpfulness": "0/1", "author": "Ambermarieanna"}, {"rating": 4.0, "review": "The FireTv is the 3rd streaming device in my collection. I also have Roku 1, 2 and 3, and then AppleTVsI like the interface for Amazon Prime streaming - it is great. I wish there were a similar interface for Netflix and such.I like that theres a big handful of games that can be played, and the additional controller can be used to play them.I like how fast the device is.As of now, the app for iOS is not out yet - which if I lose the remote, would be a very bad thing.Hands down, the fastest streaming box, and best prime interface. Largest game library out of the streaming devices I own.I would have to give best channel selection to Roku. Best cross device ecosystem to AppleTV. Best UI to AppleTV.This purchase was based off a see it before you buy it - as we saw and used my brother-in-laws before even thinking of purchasing a FireTV.Mainly made the purchase as it was $30 off for 2014 holiday gifting (from my wife to me - and she knew that I liked the casual gaming aspect)", "verified": true, "helpfulness": "0/0", "author": "Nate & Ash"}, {"rating": 5.0, "review": "Awesome.", "verified": true, "helpfulness": "0/0", "author": "Nathan Arnold"}, {"rating": 5.0, "review": "I have a question, do you need an Internet connection?", "verified": false, "helpfulness": "0/0", "author": "B. Smith \"barb\""}, {"rating": 5.0, "review": "What can I say I love it! I have it hard wired so I can't speak as to how fast it is on wireless. Very fast and easy to use. I highly recommend buying one if you are even thinking about it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Trung Diep"}, {"rating": 4.0, "review": "Beautiful, simple form factor. Simple setup. And then it just works", "verified": true, "helpfulness": "0/0", "author": "Luke"}, {"rating": 5.0, "review": "Now I have a smart tv. A breeze to install. Now I don't have to mirror from my kindle fire. Very easy to navigate on the screen.", "verified": true, "helpfulness": "0/0", "author": "rln"}]