[{"rating": 5.0, "review": "We loves it. The system is easy to use and access to everything we like. Please continue to update and give us more apps.  I buy alot from Amazon. The BEST money I spent in a Long Time !! Great product I've been telling all my friends about it..", "verified": true, "helpfulness": "0/1", "author": "JV505"}, {"rating": 5.0, "review": "Ordered the little box, hooked it up in literally 60 seconds... and I'm watching \"Justified\" season 1.No lag, streams smoothly and I can't think of a single thing to complain about.", "verified": true, "helpfulness": "0/1", "author": "James R. Davis IV"}, {"rating": 5.0, "review": "This is, by far and away, the finest access box available.  Simple to install, simple and accessible interface, all others are model T's to this Rolls Royce.", "verified": true, "helpfulness": "1/2", "author": "William Roy Ives"}, {"rating": 4.0, "review": "I love  it the box is small, it has most of everything I use. It just needs hbo go and Vudu and it would be perfect.", "verified": true, "helpfulness": "1/2", "author": "Beatrice L."}, {"rating": 5.0, "review": "Easy set up, streams everything in the world. Sure beats accessing Netflix through a Wii. It's another winner from Amazon.", "verified": true, "helpfulness": "0/1", "author": "Bill Fleck"}, {"rating": 4.0, "review": "First I will say that I love how fast it is and I love the Plex app so I can stream my media quickly and easily in HD. With my apple TV I had to do  it via airplay and same with Amazon video with apple tv so those two things alone make the Fire TV better for me.Now the not so great:1. Hulu App CONSTANTLY freezes the video while continuing the audio. I have a 30Mbps connection so it's not a bandwidth issue,  I also have it plugged in to my router with an ethernet cable so it's not a wifi interference issue, it's a fire TV issue.  I often have to clear the cache, force quit the app and start all over to get it to play properly.2. There is a USB port on the back but you can't plug anything in to it like an external hard drive. My old Roku at least had a media player application so I could plug in an external hard drive for direct access to my media.I do still really like it and I'm glad I purchased it but I would LOVE it and tell all my friend to buy one if those minor issues were fixed :)", "verified": true, "helpfulness": "0/1", "author": "Mathew Koenig"}, {"rating": 4.0, "review": "This box is on Fire! I would definitely recommend it any and all. The voice recognition WORKS! But needs more apps like HBOGO ect.", "verified": true, "helpfulness": "0/1", "author": "Juan Colon \"Kapow!\""}, {"rating": 5.0, "review": "I was spending most of my TV time watching shows from Amazon, using my Prime account, but I didn't have a compatible device so I had to use my computer.  Now I can enjoy those shows on my television .  I also realized that I was not using most of the channels provided by my cable service so I changed my subscription to a less intensive plan saving me money every month.The Amazon Fire TV device and the Amazon Prime subscription is worth every penny.The voice search is also great. When my 4 year old grandson came over and wanted to watch a video, I used the voice search using the word \"children.\"  Many choices came up and he was able to make his choice and watch a show while I made dinner for us.", "verified": true, "helpfulness": "1/2", "author": "Kathleen Smith"}, {"rating": 5.0, "review": "I love the new Amazon Fire TV.  Voice activation is wonderful.  It's nice to see the cheapest way to view things.", "verified": true, "helpfulness": "0/1", "author": "rlsmarty \"Renee S\""}, {"rating": 3.0, "review": "I liked the features on the Amazon Fire but was unable to get The Blaze... that stopped me right there.  I do not want to have a lot of little boxes connected to see the Programs I want.  I want just one box that delivers the shows I want and as the best I can tell The Rokou.  Will just keep reading reviews...", "verified": true, "helpfulness": "1/4", "author": "Rebecca B Bleau"}]