[{"rating": 3.0, "review": "It works but I really dislike that the content is my mobile device - but then I knew that when I got it so no deductions for that. What I didn't know was that it will not play movies from my iPad unless they are from Google Play. This means even movies you own on DVD or BluRay that you rip and put on a device it will not play them. It will not play movies rented from iTunes, or from any other digital source except the Google world. That was the main reason I got this was for travel and playing movies from my iPad. Luckily my Apple TV is not too big and worked fine in the hotel with the help of my D-Link Systems Wi-Fi AC750 Portable Router creating a WiFi hotspot.I currently keep it attached to one of my computer monitors but that is really useless since I can already play content on that monitor anything that can be streamed from my iPhone.Maybe Android users will have a better experience, but it is not very good with an idevice. Maybe when I get an office TV it will be a little more useful since my Roku and Apple TV are staying on my main TV. I like not having to find my tablet or phone to watch Netflix.The price is its only savior.", "verified": true, "helpfulness": "0/0", "author": "M. McDonald"}, {"rating": 1.0, "review": "Despite what is advertised, this device does NOT work with Hulu Plus and a PC.", "verified": false, "helpfulness": "0/0", "author": "Benjamin"}, {"rating": 5.0, "review": "Awesome product, now i can stream media directly to my tv from my mobile or laptop.", "verified": true, "helpfulness": "0/0", "author": "Inwinder Kochhar"}, {"rating": 2.0, "review": "It did not work with my TV make.  Returned it.", "verified": false, "helpfulness": "0/0", "author": "D. Spencer"}, {"rating": 2.0, "review": "Wish I could say that this product is good. It worked for the first few months, but we have connection problems everytime we try to cast. Even after being on every help forum, we still have issues.Shame, I had high hopes.", "verified": true, "helpfulness": "0/0", "author": "Mona Holmes"}, {"rating": 4.0, "review": "As someone who has to give presentations I love this little device. I can easily broadcast my presentation onto the big screen TV to practice my presentation. It also works well when we are searching the web as we can do that on the TV in the comfort of our recliners rather than crowded around a desk. Love that we can also watch things from YouTube on the TV without having to plug the laptop into the TV.", "verified": true, "helpfulness": "0/0", "author": "Have2Cruise"}, {"rating": 5.0, "review": "This works great. I never heard of this thing until recently and wow, you can watch Netflix etc in another room so easily! do not hesitate to buy this!", "verified": true, "helpfulness": "0/0", "author": "LINDA CONNOR"}, {"rating": 5.0, "review": "Functions as intended. Exactly what I ordered.", "verified": true, "helpfulness": "0/0", "author": "Scott Hathaway"}, {"rating": 1.0, "review": "Purchase only if you have very good wifi connection otherwise no use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Nice, really for screen casting, Netflix and watching YouTube. It is very sensitive if the WiFi signal is weak.", "verified": true, "helpfulness": "0/0", "author": "samiyr glover"}]