[{"rating": 3.0, "review": "Easy to set up and use with Netflix and YouTube if you don't have a \"Smart\" tv with those capabilities built in.  It needs to expand it's capabilities to iTunes and the computer desktop with sound.  When they do that I will give them five stars.", "verified": true, "helpfulness": "0/1", "author": "KNITWITNY"}, {"rating": 1.0, "review": "\"Google Chromecast TV Player with HDMI extender \"The standard Chromecast already comes with the HDMI extender. There is nothing in this listing that does not come with the $35.00 Chromecast.", "verified": false, "helpfulness": "20/26", "author": "atl2rva \"Paul W\""}, {"rating": 4.0, "review": "The newer your tv and the more refresh cycles you have, the better this gismo works. It's just genius and so freeing!!!! Is it theatrical quality? NO, but who cares. I do a lot of presentations and guided mediations (audio and video atmosphere) and I use the gismo. If you already have digitally created the audio and video, this is the way to go. Have not tried PowerPoint with it, because I keep Microsoft products to the bare minimum on my equipment, but the gismo might work with that too. I don't know.Kudos to Google for inventing something so practical.", "verified": true, "helpfulness": "0/0", "author": "Marilyn"}, {"rating": 4.0, "review": "As an avid user of many of the supported applications for the Chromecast, I have to say I love it.Some background.  I have tried cable TV, but hate the lack of on demand.  Tried mobile viewing, but prefer my big screen.  Have a smart TV, but the interface is slow and clunky.  Tried Roku 3, a better interface, but sill too many buttons to watch a show.This lets me use interfaces designed to take full advantage of touch controls and keyboards, making finding and playing shows easy, while allowing me to push that content to any HDMI enabled screen.  Netflix works great, though I miss the auto-forward.  Hulu works good.  Plex is absolutely killer.  All in all lots of functionality for the price.That said there are some negatives.  This is clearly revision 1 hardware, I can't use it in my bedroom despite having no problem with my Roku (moved from the living room) or 2 laptops.  There are issues maintaining a connection freqently, with inconsistent results when reconnecting.  The SDK is finally out, but I haven't seen any new killer apps yet.  This is still a beta product, but with potential to shake the media consumption world once the content providers get behind it.I hope to see a day where all my media apps have a push to chromecast button.  Where I can jump between providers apps (FOX, Hulu, ABC, HBO etc.) and watch my shows using a natural interface.  With a cheap tablet replacing my old universal remote.", "verified": true, "helpfulness": "0/0", "author": "Jared L. Vanderford"}, {"rating": 1.0, "review": "Roku is lot better when tried this, no one talking about the problems it has. May be in future it will get better.", "verified": true, "helpfulness": "0/1", "author": "gee"}, {"rating": 3.0, "review": "The concept of the chromecast is too good to pass up at this price, but I have had difficulty with streaming starting and stopping and my router is directly next to my TV. The apps with the built in feature seem to work better than just streaming out of the chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product works smoothly. Like that is can stand alone without having my phone constantly working on streaming the content the Chromecast takes over. It's simple yet designed well and does what it says it will does.", "verified": true, "helpfulness": "0/0", "author": "Rick \"Island Boy\""}, {"rating": 5.0, "review": "Highly reccomend for anyone without a game system to play netflix, hulu, or youtube. The fact that I can use my phone and tablet as a remote is awesome.", "verified": true, "helpfulness": "0/0", "author": "Connor Sullivan"}, {"rating": 2.0, "review": "poor quality viewing, I own a television capable of HDMI and this is not ready for prime time. So Sorry ChromeCast", "verified": true, "helpfulness": "0/1", "author": "glenn.b.hansen"}, {"rating": 1.0, "review": "that doesn't work.My son was enamoured of this device. He loves all things Google.We were in a hotel and I was using it with their internet. It totally befuddled the poor little Chromecast thingie. After  an hour of fiddling, I pulled it out of the TV in disgust and plugged my HDMI cable from my laptop to the TV. Using a wireless mouse and keyboard, I sat on the couch and watched anything I wanted to.If you were trying to stream HD video and sound from a smartphone or something without an HDMI input to a big TV, AND if it worked, that might make this gadget be worth something...", "verified": true, "helpfulness": "0/2", "author": "Anchorman"}]