[{"rating": 3.0, "review": "It is great to be able to use any Chrome browser (Desktop browser and some tablets) to simply click chromecast icon and display on a big screen wirelessly. Also with newer releases of Chrome, one can leave video running on TV/Monitor while opening a new browser on the desktop. This process is using computer processor and wireless LAN.Audio and Video can be displayed although video quality is not HD unless you stream from Google services directly, Google has added some additional apps for direct streaming such as Netflix but the apps support is very limited. If Google were to allow apps such as Plex to stream directly this could seriously improve video quality. Google app selection needs to be increased significantly to make this device useful. If you only want to stream from Netflix and Hulu, you may OK with this very cheap device.But limitations of applications supported to display directly severely limits its usefulness.*** Outside the streaming capability of the device one other point you must be aware of is that the Chromecast device NEEDs to have a UPnP enabled router. If your home router does not support UPnP it will NOT WORK. Some cable companies provide the home router and lock admin of the router with UPnP turned off. *** Check with your provider before buying. ****Roku is a great alternative with multiple versions of the RoKu starting at nearly the same price as Chomecast. However Roku provide  much great app support (I mean a LOT more). Although Roku does not display your web browser window, with the flexibility of apps available I not sure how much I need a web browser over hundreds of video streaming services that Roku does support. If you need to display your Chrome web window use Chromecast, if not, I would recommend Roku. If Google could improve Chromecast Web sharing video quality and add more apps supported for direct streaming it may be a great product, but it is not there yet though.Apple TV is another alternative and is available globally, but like Chromecast it restricts the apps you can show to ones Apple approve and even worse, lock the Apple Apps on the screen, with no way to remove them. Apple needs to be connected by LAN cable not wirelessly and as such the video quality is potentially better than Google, but less flexible. Apple does deliver a nice click to play from iPhone/iPad but little other options if your content is not always held in Apple. So kind of forcing content to Apple makes them just as bad as Chromecast but but limitations in different ways.Overall, I recommend RoKu. Good start Google, but keep working on it.", "verified": true, "helpfulness": "0/0", "author": "Daz"}, {"rating": 5.0, "review": "Google did a great job with this product. Setting it up was *almost* seamless and using it incredibly simple. Google does a good job taking you through the steps of setting it up and getting it running. I will be buying another one before I go back to Canada.", "verified": true, "helpfulness": "0/0", "author": "pmogh"}, {"rating": 4.0, "review": "Magical piece of equipment. Worked great with very little set up. It literally configured itself without needing the user to fiddle with it.", "verified": true, "helpfulness": "0/0", "author": "Raphael Ehicheoya"}, {"rating": 5.0, "review": "This is a fantastic product. I got one and then I got another. And if I get the opportunity I will buy a third. Simple and easy to use.", "verified": true, "helpfulness": "0/0", "author": "ML"}, {"rating": 3.0, "review": "This is a very cool technology.  You plug it into your TV and you can control the chromecast from your phone or computer to play netflix or hulu plus or youtube.  You can also show chrome webpages from your browser.The limimted # of apps makes the usefulness of this limited for me.  As they add apps it will be better.It is so cheap, so it is hard to regret the purchase, but it is more of a novelty than anything else at the moment.", "verified": true, "helpfulness": "0/0", "author": "J. Erlich \"Dr. J\""}, {"rating": 5.0, "review": "I got exactly what I expected:- Cheap solution for viewing youtube and netflix on my TV.- Easy to install and handle.- HDMI!Great value in a small device.", "verified": true, "helpfulness": "0/0", "author": "Carlos"}, {"rating": 5.0, "review": "Works well. Relatively easy to set up. I like being able to move it from my living room to my bedroom with ease.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is really cool and really easy to use and setup. This would be really cool if you had a Chromebook or a tablet. I have a PS3 so this is really only used for Youtube videos.Hey AMAZON! Will you support this device for Amazon prime videos! That would make this that much cooler!", "verified": true, "helpfulness": "0/0", "author": "DVSIT \"Bob Lob Law\""}, {"rating": 3.0, "review": "Video is badly synced but that might be a function of my network bandwidth. I'm not sure.  I have a 3meg DSL  and a 10/100 network. I'm wireless N at the router but I have a 11G repeater nearest my TV.  If all that is Greek to you, all I'm saying is that if you have newer equipment or more capable equipment YMMV.", "verified": true, "helpfulness": "0/0", "author": "Edwin P Souse \"epsouse\""}, {"rating": 5.0, "review": "I have owned an Apple TV (3rd Generation), my parents own a Roku. I purchased the Chromecast because I was curious and it ended up replacing my Apple TV. Any device can be a remote, the future possibilities for in-app casting are endless, the picture quality is fantastic (especially using the Hulu Plus app for Android), it does NOT overheat (or even get very hot) if you use the extension cable to angle it away from your TV. There were no wireless traffic problems to my surprise. I don't see my network slowing down or our internet, which is fairly slow at 12mbps. If you have slow internet, you can cast in 480p SD. This thing is feature packed and really pretty incredible for only $35!", "verified": true, "helpfulness": "0/0", "author": "mike"}]