[{"rating": 5.0, "review": "My entire entertainment center now revolves around my Chromecast.I had bought a smart tv that had apps built in, but it became quickly apparent that the tv manufacturer was not interested in keeping the software up to date or expanding their offerings in terms of services.  This is where the Chromecast is brilliant - the providers themselves are interested in getting on your tv and they'll keep their software up to date on your mobile devices.  Things like Netflix, Pandora, Rdio work fantastically with the Chromecast.Would love to see Amazon finally allow Amazon Prime Video work on Chromecast, though.", "verified": true, "helpfulness": "0/0", "author": "Brian O'Connor"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Mario Alberto"}, {"rating": 1.0, "review": "Worked for about an hour, then couldn't ever get it back online.", "verified": true, "helpfulness": "0/0", "author": "Katie Evans"}, {"rating": 4.0, "review": "Neat.  Not everyone will have a use for it but it is super fun for me and the kids on the kitchen tv that isn't hooked up to TV service.", "verified": true, "helpfulness": "0/0", "author": "JenD"}, {"rating": 4.0, "review": "Easy product with easy setup", "verified": true, "helpfulness": "0/0", "author": "@nottyp"}, {"rating": 5.0, "review": "These things are great, nit as good as quality as my fire tv, but never needing a remote is a bonus", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE IT! SO EASY TO SET UP ON MY NEW CHROMEBOOK.", "verified": true, "helpfulness": "0/0", "author": "PAX"}, {"rating": 5.0, "review": "use it all the time", "verified": true, "helpfulness": "0/0", "author": "Charles C."}, {"rating": 5.0, "review": "This is our 2nd one, for our second TV.  We are now officially on our way to cutting the cord from our cable provider, and only getting internet.", "verified": true, "helpfulness": "0/0", "author": "Michigan SEO \"Detroit Website Devel0per\""}, {"rating": 4.0, "review": "This is a neat little device.  It's such a different approach to online streaming than the alternatives like Roku and Amazon Fire TV.  I didn't really research it before I got it, I just wanted to try it out so I had no idea that that it didn't just have apps on it that you play from like every other device.  That has it's ups and downs for me.  It's nice that I can cast any tab from Chrome right to it.  But it's not so great that I have to rely on another device to provide the apps like Vudu or Netflix or WatchESPN to then Cast them to this device.  I'd prefer an approach where the apps are on the device so you can use them directly from the device. But it then had another option for casting Chrome Tabs or mirroring your phone screen with Android 5.0.", "verified": true, "helpfulness": "1/1", "author": "Bryan K. Gravely \"~~g\""}]