[{"rating": 3.0, "review": "I wish Apple TV and Amazon would just agree to allow play each others programming on their boxes (So, I don't need 2 boxes).  Amazon Fire is not as good as Apple TV.  Amazon TV is OK, I like that I can watch TV/Movies on my Prime account and not pay a rental fee.  However, when I switch over to my TV (regular) (a different source), Amazon TV goes black.  I have to reboot it to be able to it to see the menu.  I called the Help Customer Service for help, the first rep, I couldn't understand the person.  The 2nd person I understood better but not by much, but after saying the same thing about 10 times, he finally said \"Oh\" and then I found the problem.", "verified": true, "helpfulness": "0/2", "author": "Believer"}, {"rating": 4.0, "review": "Installed my fire tv today, October 2, 2014. I don't have the amazon music app. Why? I'm a Prime member. I want my music!  [UPDATE} Well, when I next turned on the Fire TV it updated the software and I got additional capabilities.", "verified": true, "helpfulness": "0/0", "author": "Stratomaster \"cacamio\""}, {"rating": 2.0, "review": "I'm pretty irritated that it didn't come with an optical video cable and that there wasn't a warning that I'd need an RCA adaptor. I won't even get a chance to try it until I get these things now.", "verified": true, "helpfulness": "0/5", "author": "David Schachter \"aglaeca\""}, {"rating": 5.0, "review": "Amazon Fire TV was so easy to install that a child could do it. It is also easy to use. The remote only has a few buttons, and they are so easy to work. Bravo, Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amanda S."}, {"rating": 5.0, "review": "Recently purchased two of the fire tv units and unless I'm missing something the white power light stays on all the time.. Is there a way to turn the unit off or does it stay on all of the time... Thanks", "verified": false, "helpfulness": "0/0", "author": "Harley Dad"}, {"rating": 5.0, "review": "Love the download speed and the film movement and kino lorber apps.", "verified": true, "helpfulness": "0/0", "author": "Ava R Moreno"}, {"rating": 1.0, "review": "Maybe settings are incorrect, but it seems that as an Amazon Prime member, I have to pay extra to see HD versions of old television shows and movies. If this is correct, I will be returning this unit.Please contact me at diger-at-vermontel-dot-net", "verified": true, "helpfulness": "2/9", "author": "Philip L. Winsor"}, {"rating": 5.0, "review": "Good product.", "verified": true, "helpfulness": "0/0", "author": "bobby4051"}, {"rating": 5.0, "review": "Easy to install & use", "verified": true, "helpfulness": "0/0", "author": "Geminigal"}, {"rating": 5.0, "review": "After much frustration with my new Samsung \"not so\" Smart TV, I broke down and bought the Amazon Fire TV as a workaround to get to Netflix. Samsung upgraded their software and broke accessing Netflix. Still don't know when they'll fix it.I have to say, I was impressed by the packaging. It's beautifully designed. Reminds me of Apple products in that sense. It was simple to install and get running and having the option of voice commands makes it so much faster than scrolling to find what you want to watch. As a Prime member, it already knew and had all the Prime videos available without having to go through logging in and entering passwords like I had to do to get Netflix running.", "verified": true, "helpfulness": "2/2", "author": "M. Muller \"knowledge seeker\""}]