[{"rating": 5.0, "review": "Set-up is so simple. Quality of video is great. All it needs is for more apps to be released and all will be great.", "verified": true, "helpfulness": "0/0", "author": "David Forgue"}, {"rating": 4.0, "review": "The concept is there but my internet does not seem to be strong enough to stream. Other than that this thing is awesome.", "verified": true, "helpfulness": "0/0", "author": "Steven C. Wilson"}, {"rating": 5.0, "review": "Initial setup was a breeze, and once setup via wifi, I was able to connect with a wired PC too, which was a pleasant surprise. Using a third party application, you can stream pretty much any video format, which is nice for someone that doesn't want or can't have the extra cables running to the TV.", "verified": true, "helpfulness": "0/0", "author": "Silva"}, {"rating": 4.0, "review": "Easy to install, worked great and did what I needed it to do. I displayed pic's from my iPhone and TV episodes from ABC, CBS and NBC. This is one of the steps I'm taking to drop my cable service.", "verified": true, "helpfulness": "0/0", "author": "Robert K."}, {"rating": 5.0, "review": "Awesome works perfectly exactly what I wanted in my room that I did not want a computer in thanks Google. Def needs more apps as well as update chrome on android to cast the tab", "verified": true, "helpfulness": "0/0", "author": "james holt"}, {"rating": 5.0, "review": "Chrome cast is Very simple to use, I wish it would work with more apps than just Netflix and  YouTube", "verified": true, "helpfulness": "0/0", "author": "R. Anthony Spunzo Jr."}, {"rating": 5.0, "review": "It's cheap, it streams from a Chrome browser. It's remarkably simple to set up, and is fast about it. What more needs to be said?", "verified": true, "helpfulness": "0/0", "author": "Jacob Lee"}, {"rating": 4.0, "review": "It is truly a good product. Can't wait for more 'chromecast' intergration on all platforms to allow us to stream effortlessly.", "verified": true, "helpfulness": "0/0", "author": "SB \"reading personality\""}, {"rating": 5.0, "review": "Amazing! Who needs cable. I purchased this thinking, $35, it will not work. Streaming is great. Must see to believe.", "verified": true, "helpfulness": "0/0", "author": "Juliet Mason"}, {"rating": 4.0, "review": "I  chose this rating because the dongle works perfectly but the Netflix service does not always work or may not work with all movies. So just a little wonky but perfect for casting to my bedroom tv.  It was just too far to run a cable or connect it to another computer.", "verified": true, "helpfulness": "0/0", "author": "M. DeMarks"}]