[{"rating": 2.0, "review": "Returned. Did not like the remote, it tipped over onto the ground because I place it on my arm of my chair. It was also not comfortable or easy to use.", "verified": true, "helpfulness": "0/2", "author": "sunpalm \"Bonnie\""}, {"rating": 5.0, "review": "i wish i would have bought this along time ago.i was looking for something different.when this came along with SlingTV i could not go wrong.ii", "verified": true, "helpfulness": "0/0", "author": "eric"}, {"rating": 4.0, "review": "Very satisfied with the Fire TV. Does everything the Roku is capable of and it integrates with my Kindle.", "verified": true, "helpfulness": "0/0", "author": "B. A.  Powers"}, {"rating": 5.0, "review": "I LOVE THIS AND IT WORK BECAUSE I DON'T SLEEP AT NIGHT", "verified": true, "helpfulness": "0/0", "author": "Carmen"}, {"rating": 5.0, "review": "After getting used to it, I like it better than our Apple TV! I wish Amazon had as many movie rental options, but still good selection & will get better and better.", "verified": true, "helpfulness": "0/0", "author": "Eureka!"}, {"rating": 5.0, "review": "Once I got it out of the (not exactly) \"frustration-free\" packaging, it was super-easy to add to my system. It fired right up, works great & is impressively fast. The new software seems to have eliminated the issues mentioned in earlier reviews. A simple Install instruction is the only documentation included in the box; the User Guide resides at Amazon to read or download. I would recommend. (Amazon Prime membership adds greatly to the features.)", "verified": true, "helpfulness": "0/0", "author": "Otis"}, {"rating": 2.0, "review": "We have had issues with freezing pictures, then it has to fast forward to catch up to real time. Don't buy the refurbished fire tv box. I'm sure this is why it was returned the first time.", "verified": true, "helpfulness": "0/0", "author": "jason"}, {"rating": 5.0, "review": "Love Amazon Fire. My TV had Amazon, Netflix etc. built in to it but it was fairly cumbersome. Amazon Fire TV is so easy and streamlined I just love it!! I also have Roku but will stick with Fire from now on.", "verified": true, "helpfulness": "0/0", "author": "jlrcub"}, {"rating": 5.0, "review": "Awesome product", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "Would purchase again.I like that I can watch Netflix shows in what seems to be higher definition than when I watch it on my computer...", "verified": true, "helpfulness": "0/0", "author": "Zombie Lincoln"}]