[{"rating": 3.0, "review": "Appear valuable, but how often do you \"cast\" images when you can just connect the device to a smart tv with an USB cord.  Firestick much better value.", "verified": true, "helpfulness": "0/0", "author": "R.B.L."}, {"rating": 2.0, "review": "Still missing corporate features, like doing presentations.", "verified": true, "helpfulness": "0/0", "author": "Jose A."}, {"rating": 5.0, "review": "It works great as described.  Although I wish it could mirror the computer screen and play media from your files on the computer as easily as casting from the Internet, I think it is a great product.", "verified": true, "helpfulness": "0/0", "author": "Porntina Tangsajjavitoon"}, {"rating": 5.0, "review": "this thing has to be the best/ coolest thing ever invented... We use this thing daily.. we love playing youtube music videos and dancing as a family.. This was the best money ever spent!!", "verified": true, "helpfulness": "0/0", "author": "ryan"}, {"rating": 5.0, "review": "Looooove the Chromecast!  Best invention since the TV and the Internet...", "verified": true, "helpfulness": "0/0", "author": "GL"}, {"rating": 5.0, "review": "Does everything that I need flawlwessly. No buffering, lag, or skips unlike the Roku that this replaced. Whatever you do with your smartphone is mirrored onto your TV. I love using it to watch and share YouTube videos, pictures, websites, and movies. It just plain works.", "verified": true, "helpfulness": "0/0", "author": "Goober22 \"William\""}, {"rating": 5.0, "review": "Wow. I am pleasantly surprised with this product. I am on a Macbook pro and just recently switched to Chrome from Safari as well. I love that I can watch TV from my chromecast and still use my laptop for other  things. Best $28 ever spent.", "verified": true, "helpfulness": "0/0", "author": "Mallaree Mingee"}, {"rating": 5.0, "review": "All right", "verified": true, "helpfulness": "0/0", "author": "Vinicius Ferraz"}, {"rating": 5.0, "review": "I definitly buy again , it does a lot of functions , is an excelent purchase", "verified": true, "helpfulness": "0/0", "author": "luis ripalda"}, {"rating": 4.0, "review": "Works well some of the time, but tends to be kinda buggy on occasion.", "verified": true, "helpfulness": "0/0", "author": "Andrew Diehl"}]