[{"rating": 4.0, "review": "Streaming video is not compatible with mac operating systems which is the only reason that I still have my apple tv as well, otherwise the fire tv is AWESOME!", "verified": true, "helpfulness": "2/2", "author": "Techy \"Amazon Lover\""}, {"rating": 5.0, "review": "Just got one for Christmas. Easy install, but the best part is how strong the wifi is, wireless router is on the other side of the home upstairs, had planned on setting up an access point to use with this, but so far it is unnecessary, Fire TV is at the farthest possible point of the home and streams as if it is directly wired into the network, simply amazing.", "verified": true, "helpfulness": "3/3", "author": "J. Hooverman"}, {"rating": 5.0, "review": "I love amazons fire tv, it's great, it's ten times better than the other one, (has a fruit shape) it plays movies I own from Amazon with ease, has lots of other programs, the remot died a lot more than others, I think it's great! If you belong to prime you've got tons of free movies and games! Thanks Amazon!", "verified": true, "helpfulness": "1/1", "author": "Bart"}, {"rating": 5.0, "review": "We moved from a house with 13 Mbps internet to one with 7 Mbps and my old Roku took forever to buffer and kept pausing during movies to buffer again.  I am a big fan of all things Amazon so bought the Fire TV.  I can't believe how fast the menus and the movies load.  I thought the voice command feature, based on the movie star commercial, was a farce, but no -- love the ability to say the name of a movie and to go right to it.  Then I saw where I can play Tetris on the Fire TV, how much fun will that be?  I haven't used any recent competing products but don't see how one could go wrong with a Fire TV.", "verified": true, "helpfulness": "4/4", "author": "Ed (left the snow belt)"}, {"rating": 5.0, "review": "Fire TV is the best streaming and gaming device you can get for your money.  It's fast, easy to hook up, and simply easy to use.", "verified": true, "helpfulness": "1/2", "author": "Disney L"}, {"rating": 5.0, "review": "I love my fire tv. I can't imagine life without it. Being an amazon prime member I have so much to choose from. It's so small I can move it to tv to TV with only two connections HDMI cable & power cord.", "verified": true, "helpfulness": "2/3", "author": "Mars4470"}, {"rating": 3.0, "review": "Just tell it what you want and it almost gives it to you.  It will give a list that matches and you select which is best.  However, your selection will only be for the first instance!  For a tv series, that means season one.  Other seasons will require searching like regular on the remote, one button at a time.  For movies and actors, it works fine.  It has limited games offered;  and who would listen to music on tv?My fire box hd does not turn on when I press any button on the remote.  I always have to cycle power.  At least it boots quickly.", "verified": true, "helpfulness": "2/2", "author": "JayZ"}, {"rating": 2.0, "review": "I WAS happy with this product until I started trying to watch movies. No volumne? On the screen it says something about No audio support but if I hard wire my Kindle Fire HD  I get audio. Wish I  had not bought one for my Grandchild. The stick i ordered has beed shipped. If movies don't play with audio i need to rethink all my kindles and TV fire and Prime.membership.", "verified": true, "helpfulness": "1/5", "author": "GB"}, {"rating": 5.0, "review": "Loved it and re-place my Apple TV with this one right away very powerful box but I wish they should have come up with the keyboard on the back if that is not possible at-least Blacklit anyways still amazing box you can see its true power once you root this box and Install XBMC on it.. 10 Start Kudos to Amazon voice search is fantastic no doubt.", "verified": true, "helpfulness": "1/1", "author": "Fazzy"}, {"rating": 3.0, "review": "does not work as well as i thought it would using voice commands", "verified": true, "helpfulness": "1/2", "author": "David Posner"}]