[{"rating": 5.0, "review": "Amazon TV good...", "verified": true, "helpfulness": "0/0", "author": "JIYOUN J."}, {"rating": 5.0, "review": "It is so nice to have a deivce that doesn't take forever to boot up to get to all my devices. Also having Netflix & Amazon Prime at my finger tips is great!", "verified": true, "helpfulness": "0/0", "author": "Ellaina Thomas"}, {"rating": 5.0, "review": "love it.  like that you don't have to have remote faced at unit to operate.  super small.  would recommend to others.", "verified": true, "helpfulness": "0/0", "author": "AIR-RON"}, {"rating": 1.0, "review": "I would like one of these due to the fact that one of my TV's doesn't have a Plex app and won't play mkv videos.I am also not sold on Prime programming - which we had for a couple of years - but I do like the ability to rent or purchase videos on Amazon.But - I don't want Prime Video and am concerned that if you don't pay Amazon their monthly fee then then unit won't work well or be slowed down.Must I have a Prime subscription to utilize this device?", "verified": false, "helpfulness": "0/2", "author": "StevenEddy \"Audio Pro\""}, {"rating": 4.0, "review": "The product is fantastic, but there are a few things that could be better. The unit doesn't shut off completely, and it is time consuming to find all prime shows.", "verified": true, "helpfulness": "0/1", "author": "William R Gates"}, {"rating": 3.0, "review": "Not bad.  Works well with prime service..", "verified": true, "helpfulness": "0/0", "author": "leon(lano) \"lano(Leo)\""}, {"rating": 5.0, "review": "I was hesitant to buy this product.  It works over WiFi (there is Ethernet connectivity as well), and whereas my WiFi hub is in the backroom of my house, the TV is in the front room, a distance that is as far as possible on my first floor (five rooms).  My laptop, when I connect in the front room, registers a \"Fair\" or \"Good\" connection, but never \"Excellent.\"  But I looked through some reviews (quite helpful, thanks all) and only found only one person that had an issue with connectivity, so I took the chance.This product fulfilled all of my most hopeful expectations.  I have had no problems with HDTV streaming over WiFi.  At the beginning of episodes I get first typically the visual sign of buffering for a few seconds, and the image for a minute or two might be at less than HD quality, but after that I get full HD quality for as long a streaming time that I need.  I have watched movies of two hours with no buffering.  There is some great content as well that is free for Prime users.  Am happily watching the HBO series \"John Adams.\"  My impression is that if anyone has an issue with buffering they should upgrade their WiFi rather than forego the advantages of this system.", "verified": true, "helpfulness": "1/1", "author": "Richard W. Field"}, {"rating": 4.0, "review": "A great product if you get proper hands on", "verified": true, "helpfulness": "0/1", "author": "Eyad Karadsheh"}, {"rating": 4.0, "review": "I will preface this review with the fact that this is my first streaming device. I find the Amazon Fire TV easy to use. The interface is easy to navigate and the voice control seems accurate. Access to your Amazon Prime Cloud Drive is a plus with access to your photos, music, etc. My main issue with the Fire is the movie selection offered for Prime Subscribers. I feel like it didn't take too long to work my way through the quality titles. Otherwise, this seems to be a nice addition for the money.", "verified": true, "helpfulness": "0/1", "author": "Jon S."}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "HELEN WEIS"}]