[{"rating": 4.0, "review": "It does everything it's supposed to do.. But I expect a little bit more from a device like this.I have 40mps internet connection (the router is 3m away from the Chromecast) and still have YouTube buffering issues especially when casting from multiple devices. There is an annoying delay when casting from a PC or Mac.I kind of feel that it's a non-complete product under development being sold as is.", "verified": true, "helpfulness": "0/1", "author": "Khaleal Yasin"}, {"rating": 5.0, "review": "Google chromcast is a great product,easiest plug and play ever.It's interface is very friendly and it can make any TV with HDMI conection to a very smart one. It took me not more than 10 minutes after I opend the box (nice one)  to plug the dongle, download the software and started watching evrything thats on the web.Some friends come to visit me, we turned on the youtube channel and I didn't need to got up of my sofa once to chnge song or channel, I did it all from my IPAD.The dongle can communicate with severel computeres (2 PC, IPHONE and an IPAD).For a summary its a very good buy.", "verified": true, "helpfulness": "1/1", "author": "amihai"}, {"rating": 5.0, "review": "Good solution for streaming. I am not writing a long review because a lot has been already written here on Amazon.It works well. Only advice: be sure you have a very high speed internet connection", "verified": true, "helpfulness": "0/0", "author": "Francesco"}, {"rating": 5.0, "review": "Best 30 dollar spent. Who needs cable lol", "verified": true, "helpfulness": "0/0", "author": "Cecilio A Noriega"}, {"rating": 5.0, "review": "Sweet!", "verified": true, "helpfulness": "0/0", "author": "Mitchell Talley Jr."}, {"rating": 5.0, "review": "Wonderful purchase. Best of all world's. Don't review if you have an old android device. Its not fair to to the technology.", "verified": true, "helpfulness": "0/0", "author": "SpyderBite \"spyderbite\""}, {"rating": 1.0, "review": "The lagging kills! It is almost useless for me. I have tried all of the solutions I could find on the Internet, but non of them worked.", "verified": true, "helpfulness": "1/1", "author": "Pouya Rahmati"}, {"rating": 4.0, "review": "I want to like it more than I do.  It's cheap and offers access to a variety of streaming services.  It works well most of the time (occasionally have to pair it to the wifi network again, but not a big deal).  The only drawback is by design, and you have to decide how much it matters to you: there's no remote (you control it with your smartphone/tablet/PC).  I honestly thought that would be no problem for my family, but I found that all of us (even me, the tech geek) tended to avoid using it.  It somehow seems inconvenient to operate it using your smartphone as opposed to a remote control.  Especially if you've got non-technical folks in the house, this can be a problem.  My parents and 4-yr-old cannot get the hang of this.  Replaced with Roku3, which has a small (RF!) remote and it gets a lot more use.  If you don't mind not having a remote then this is a great product, but we found that having the option to use a remote is nice.", "verified": true, "helpfulness": "1/1", "author": "EquinoxV"}, {"rating": 1.0, "review": "This item did not live up to my expectations.  I purchased it to stream movies from my Xfiinity online account running on an iMac computer cast to an HDTV.  The product's performance was unstable and unreliable for this use.  Movies would run for a while and then stop and the WiFi link would be dropped.  I would reestablish the link and restart the movie only to have the same thing happen a short time later.  I was very disappointed with Chromecast and give a 1 star rating.  The ease and efficiency of Amazon's return process gets 5 stars, however.  Couldn't have been easier!  Thanks Amazon.", "verified": true, "helpfulness": "1/1", "author": "William J. McDermott"}, {"rating": 1.0, "review": "Functionality predicted upon having wifi", "verified": true, "helpfulness": "0/2", "author": "Kevin O'Hare"}]