[{"rating": 3.0, "review": "I thought long and hard between a roku and amazon fire Tv. I went with the amazon fire because I own a good portion of movies through amazon instant video.  I only have two issues with it but they are important to me so that is the reason for the missing stars. I read through several reviews before purchasing and did not see a review regarding my first issue: rewind and fast forward. Watching this is similar to watching a tape. It has a 10 second skip in either direction which is useful but I prefer the method roku has for this. Roku allows you to scan through the movie with more pin point accuracy and versatility, you can take your time and select what you want. The amazon fire tv selecting the fast forward or rewind you hope that you hit play fast enough and you might...oh...2 times out of 20 get you close to where you wanted to be.  The second issue is the amazon menu. On roku it separates every item in your amazon library into categories. On the fire tv there are categories listed but it is very rigid. It doesn't flow well. Example? My library is all listed together in no discernible order. Roku lists my Tv series in a Tv section and my movies in a movies category in order of purchase. It would have been nice if it had been at least the same.  Better if they also included a way to sort your library by category/genre example action/adventure, horror, children's, etc", "verified": true, "helpfulness": "0/1", "author": "Lorraine \"Say something about myself? Hmmmm, let's see......ummm...I read....and read....oh! Right! I read some more! And I like coffee ;)\""}, {"rating": 5.0, "review": "Very pleased. Easy to use. Easy to set up. Cutting my cable bill in half.  Will pay for itself in three months.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Don't like it as much as my ruko", "verified": true, "helpfulness": "1/4", "author": "Anna Hurst"}, {"rating": 5.0, "review": "So much faster than Roku. Easy setup. Picture is better than I've seen with other streaming.", "verified": true, "helpfulness": "0/0", "author": "K. Gust"}, {"rating": 4.0, "review": "I don't like the fact that I can't just search items that are free with my prime account, instead I have to weed through the rentals also and I feel that there are not many free newer releases.", "verified": true, "helpfulness": "0/0", "author": "Marc Augustine"}, {"rating": 5.0, "review": "I can't say enough good things about Fire TV. I bought the Apple TV before this because I have been an iPhone user since version 4. Apple seems like it's from the Jurassic period compared to this. It's so fast and easy to use. The voice search feature works splendidly and is super nice. My wife is not exactly the tech savvy type, and for her this was as easy as getting up from the chair to turn tv channel knob! And she remembers doing that! If you are a Prime member you can also watch a lot of content for free with membership. I highly recommend the Fire TV. Highly.", "verified": true, "helpfulness": "0/0", "author": "Timbo"}, {"rating": 5.0, "review": "better than cable", "verified": true, "helpfulness": "0/0", "author": "doug carleton"}, {"rating": 5.0, "review": "Miles ahead of Roku.  Frankly I am fed up with Roku.  Two of my three Rokus have had major wifi failures.  Basically the wifi in the Roku box is junk.  Plugged in the Amazon Fire and it was love at first sight.  Its processor is hugely faster than those Roku uses.  It really is noticeable not only on initial boot, but on the loading of other content.  Since I typically stream only Amazon and Netflix I am for the moment happy with the content available.  I need more time to see if there are channels that Roku offers that are missing here that I would want.", "verified": true, "helpfulness": "0/0", "author": "Jeff Kingston"}, {"rating": 4.0, "review": "Actual interface/apps are decent... However, with xmbc installed this works awesome. Could use some more options for screensavers, and an easier way to launch xbmc would be nice. I own 3 rokus and I like this way better just for the use of xbmc. The major downside compared to roku 3 is the ability to use headphones off of the controller.. Everything else is comparable or better with the fire TV.", "verified": true, "helpfulness": "0/0", "author": "Ben Peterson"}, {"rating": 1.0, "review": "EVERYTHING FIRE  TV DOES CAME WITH OUR SAMSUNG SMART TV,  SENT IT BACK", "verified": true, "helpfulness": "2/10", "author": "Guy with An Opinion \"Nick Danger\""}]