[{"rating": 5.0, "review": "The perfect element for tv home highly recommended", "verified": true, "helpfulness": "0/0", "author": "hellfish2"}, {"rating": 5.0, "review": "Gift recipients loved it", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 2.0, "review": "This product is disappointing, the apple tv is much better.", "verified": true, "helpfulness": "0/0", "author": "Guilherme Pimentel"}, {"rating": 5.0, "review": "Going to buy another for my other TV's", "verified": true, "helpfulness": "0/0", "author": "Ellmac"}, {"rating": 3.0, "review": "The whole concept of this item is very exciting and brilliant. However, it produces a not so good as expected image quality in some of its features and you just can't experience fullHD 1080p with it.", "verified": false, "helpfulness": "0/0", "author": "Agostinho G. R. C. Terceiro"}, {"rating": 5.0, "review": "Everyone should be getting one of these.  We now have one for LR and BR.  Great invention at a reasonable price.", "verified": true, "helpfulness": "0/0", "author": "dwbuae"}, {"rating": 5.0, "review": "This have to be the best thing that I have plugged into my TV, now I don't even need cable", "verified": true, "helpfulness": "0/0", "author": "teo"}, {"rating": 5.0, "review": "This is a great add-on to your HDTV. It plugs into an available HDMI port on your TV and gets its power from a USB port on your TV or from a wall outlet. With specific Chromecast-compatible smartphone apps, you can control the content that is played through the Chromecast onto your TV. For example, if you want to watch a movie from Netflix on your TV, you open up the Netflix app on your phone, press the button within that app that makes it connect to the Chromecast, choose a movie, and hit play. The movie will then begin to play onto your TV (as opposed to playing on your phone). During this time you can still use your phone to do other tasks, or just set it aside while you watch your media. There are a handful of Chromecast-compatible apps that are useful. Another neat feature is the ability to mirror your Android smartphone screen to your TV. I have an Android phone [HTC One (M7)] and using the Chromecast app, I can mirror my phone display onto the TV. This is great when you want to share pictures or videos with a room full of people. For such an inexpensive device, I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "gabe"}, {"rating": 4.0, "review": "Wish it was supported by more companies", "verified": true, "helpfulness": "0/0", "author": "Christopher L. Robinson"}, {"rating": 5.0, "review": "Very Cool!", "verified": true, "helpfulness": "0/0", "author": "Anderson Braz de Sousa"}]