[{"rating": 5.0, "review": "Very easy to use and it streams content so well and the setup was so easy for a non tech guy", "verified": true, "helpfulness": "0/0", "author": "John Tempone"}, {"rating": 5.0, "review": "Great tool for watching movies on my TV. Easy to setup and use with a great quality! I am using Chromecast outside the US (live in Austria) and it works really fine.", "verified": true, "helpfulness": "0/0", "author": "Alexander G."}, {"rating": 3.0, "review": "My Chromecast locks up after some hours.  It is great when it works but I must unplug the USB cable after I use it and plug it in again when I am ready to use it again.", "verified": true, "helpfulness": "0/0", "author": "Michael Davis"}, {"rating": 5.0, "review": "Works as advertised and at an excellent price point.Streams nicely from my 1st generation Nexus 7 tablet. No problems with setup.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "5th star when Chrome will cast its tabs without lags. The hw is great. Casting from YouTube is fantastic. Hope to try netflix and play movies integration as soon as possibile from italy", "verified": true, "helpfulness": "0/0", "author": "paiella daniele"}, {"rating": 5.0, "review": "Brilliant. Could not be easier to set to and works so well. The quality of Netflix through it is a bit too good.", "verified": true, "helpfulness": "0/0", "author": "Nathan Askew"}, {"rating": 5.0, "review": "Amazing product and very simple to setup. Although I can only use YouTube and hope that Google gets more services to work in other countries as well.", "verified": true, "helpfulness": "0/0", "author": "Faisal Patel"}, {"rating": 3.0, "review": "Casting from my mobile is OK, but from my laptop the quality is poor, sometimes videos totally freeze after a few minutes.", "verified": true, "helpfulness": "0/0", "author": "Jorma Kemppainen \"Bookworm from the North\""}, {"rating": 4.0, "review": "Ordered 2 of these and they quickly despatched and arrived rather promptly. Items were well packaged and in good order as I have come to expect from Amazon. Extremely easy to setup, just plug into HDMI socket and use either USB slot or provided plug to power the device. Software setup is via website or through chromecast app and its all rather easy (took about 5mins). Its definitely a more enjoyable way to watch YouTube listen to music on TV. For $35  its a great little device but several months since announce Google has done little too expand its capabilities (or at least I haven't seen improvements).So much potential but something needs to be done by powers that be to realise it. I hope it doesn't end up like the revue or nexus q.", "verified": true, "helpfulness": "0/0", "author": "Tanaka Mazarire"}, {"rating": 2.0, "review": "Chromecast is a good start, but by far not mature. The number of services are also not thrilling. Defenetly missing is a function to mirror the screen of a win PC", "verified": true, "helpfulness": "0/0", "author": "Jürg Haas"}]