[{"rating": 5.0, "review": "This is my first purchase of one of these boxes so I cannot compare them to any of the others already on the market.  I have been using Amazon's streaming videos, Hulu Plus and Netflix before purchasing this box and purchased the box intending to use these three also.  Out of the box the first thing I noticed was the size.  The box is very small compared to any cable box or blue ray player.  It was very easy to set up with only two cables needed for my TV (HDMI, Power).  If you don't have a wifi signal or you want to hook it up to external speakers the setup will be more time consuming.  Quick note if you have an older HD TV, the only way to hook this up is with HDMI.  The older TV's without an HDMI input will not work.  Once the box is plugged in it searched for my WIFI signal and after about a 20 minute update I was ready for action.  My Amazon account was already on screen so I could immediately access movies.  I downloaded the apps for Hulu and Netflix and within a few minutes I had access to all three accounts.  I watched an HD show using each (Amazon, Hulu and Netflix) with good picture and sound quality.  I can't say for sure all of the shows came out in HD but on my 51\" TV the pictures looked very good.  I also tested the voice search on the remote control and it worked great.  I know some previous reviewers said the voice search only worked well with Amazon content but mine searched Hulu and Netflix as well.  I have not and probably will not try the gaming feature on the box so can't give it a grade on gaming.  The remote is a little bit small but very responsive with almost no lag time.  Overall I think this is a great box for the price!", "verified": true, "helpfulness": "5/5", "author": "Halerman"}, {"rating": 5.0, "review": "I have used many streaming players including our smart TV and this one is the best of the lot. Streaming is super fast on Amazon Fire TV (so called ASAP feature), you press the watch/resume button and playback starts immediately. I have found this is the case most of the time, and have not observed any buffering or playback issues so far.Voice search is great and for those of you who do not know, you can search for a given app using voice search. Youtube is there, so is netflix and hulu. Just say the name while holding the search button and you will get the matching item listed within few seconds. You can search for movies, apps, games, actors/directors among many other things.UI is super fast and is intuitive. Games are fun too and good for a casual gamer like me. Really happy with the product!", "verified": true, "helpfulness": "0/0", "author": "sharma.123"}, {"rating": 4.0, "review": "Perfect companion for Amazon Prime content! High-quality video, zero lag and a great user interface.  Voice searching works well but only across Amazon content - hopefully this changes in the future.  Love the dual-screen option with my Kindle Fire HDX tablet - great companion when watching on the big screen.Other apps like Netflix and Pandora work as expected.  Really would like to see other apps such as Slingplayer, Spotify, Sirius, MLB and HBO apps in the near future.", "verified": true, "helpfulness": "2/2", "author": "E. Jeandell"}, {"rating": 5.0, "review": "I honestly didn't think Fire TV would be so user friendly but I was pleasantly surprised. I was using ChromeCast but was frustrated that I couldn't access any of the 1,000s of Amazon Prime shows unless I connected my laptop to my TV with a huge ugly HDMI cable. With Fire TV, not only can I now easily watch Amazon Prime shows, I can also watch HuluPlus and Netflix. I'm not a gamer, but did have some fun with the Pinball and Poker apps.The actual box (not sure what to call it) is only about the size of two cell phones; very small and compact. The controller is also small; only about 5\" long. I have not played around much with the voice controller yet so I can't really comment on it.My only two frustrations are that (1) YouTube is not an available app, and (2) I had to call Amazon tech support to figure out that the ring surrounding the circle on the controller is how you move the \"cursor\" up, down, left, right, and that the circle inside the ring is the \"enter\" button. Duh!! Tech support was very easy to reach and we had a good laugh about how silly I felt for not figuring this out on my own. (I'm normally a quasi computer savvy  person; I guess I was just really excited about checking this new toy out and developed temporary brain-fade!)I'm inching towards cutting ties with Uverse. Prior to Uverse I was a Dish customer. I won't pay the exorbitant rates for pay channels; other than the local news stations, what's available is mostly mind-numbingly stupid garbage (or in a foreign language).  I'm not a big TV watcher, but the little time in the evenings that I do have available to watch it, I prefer watching something memorable or inspiring.Amazon:  PLEASE give us a YouTube app (and a couple news station apps)!!!!!!!", "verified": true, "helpfulness": "3/4", "author": "Elizabeth W"}, {"rating": 2.0, "review": "I thought that this was the box i was waiting for, but it is not quite ready to take on Roku.Pros:* fast booting* prime movies start quickly and stream reliably* minimalist design* perfect remote size, weight, feel, and responsiveness* easy to setup and configureCons vs. Roku 3 (why I switched back to Roku 3 after two days)* lack of content channels i enjoy* confusing interface* no universal search - Roku search is much more comprehensive* prices for shows hidden on details page - slows browsing/decision making* no dedicated PRIME listingCons vs. Apple TV* Neflix interface is choppy and datedCons overall* Purchase-only content forced to front - this product feels like an ATM for Amazon* Asinine, unskippable introduction video* Small channel selection* No search in Netflix!* Seriously - No search in Netflix!!* 5.1 does not work on my popular late model LG Home theater - no compatibility list available that I could find", "verified": true, "helpfulness": "6/10", "author": "preset1"}, {"rating": 1.0, "review": "I am an amazon fan, and purchase almost daily.  I was very excited to see that the Amazon Fire was coming out as I have been a Prime member since the first year it was offered.However, I am very disappointed in the clunky UI, the inability to search for Prime content only (there is only a limited number of free videos that show up on the menu), the fact that you can choose \"Dolby Digital over HDMI\" but yet my receiver never indicates that it's receiving 5.1 channels, and the worst thing... which seems like a nit... but where is the OFF button or the restart button???  As we ALL know electronics need to be rebooted occasionally and I'm tired of waking up at 3am after falling asleep watching it, and there it is still on, streaming images that I can't choose, taking up my internet bandwidth.UGH.  I'm keeping an eye on the last date it can be returned to see if there are any firmware updates.  Otherwise I'm sending it back.  Love my AppleTV even more now.", "verified": true, "helpfulness": "17/27", "author": "Dawnuh"}, {"rating": 5.0, "review": "Set up was a breeze, signal doesn't pause or skip, remote works just like Gary Busey says it does! I definitely recommend this!", "verified": true, "helpfulness": "1/1", "author": "James Davenport"}, {"rating": 5.0, "review": "Amazon has knocked this one out of the park. Great product, hope to see a lot of prime movie add ons soon.", "verified": true, "helpfulness": "1/1", "author": "quaz"}, {"rating": 5.0, "review": "Great unit, easy to use, love the speed in which items get loaded and the easy of voice activated searches.I had many of these options preloaded on my TV, but when playing downloaded movies the systen halted and stay buffering.Since we received our Kindle fire we been using it daily,  great entretainment.", "verified": true, "helpfulness": "1/1", "author": "Alberto Martinez"}, {"rating": 5.0, "review": "It took me longer to unpack my new Amazon Fire TV then to set it up.  Just a few minutes and I was surfing the movies and TV shows.  The best part is being able to speak what I want to see and have the Fire \"think\" and find.  Speak movies stars, genre, actual titles.  Its wonderful!!!!!!  Thank you Amazon.", "verified": true, "helpfulness": "2/2", "author": "Barbara  A Westberry"}]