[{"rating": 5.0, "review": "Surprised with what you can do with this device only 35 dollars. I recommend everyone this handy tool to play your media from the comfort of your tv screen.", "verified": true, "helpfulness": "0/0", "author": "jonathan"}, {"rating": 5.0, "review": "This little gizmo is a very nice tool. One thing to be aware of is it needs and external power source (USB or standard outlet plug). This was the one drawback I saw but not much way around that one since HDMI doesn't carry power. Netflix works as well as if you were streaming on a Laptop, may even a little better. Picture comes in very nicely. HBOGO is laggy at times. New apps coming out for this will definitely make it even more versatile. Plugged into a smart TV, works better than the smart TV.", "verified": true, "helpfulness": "0/0", "author": "Stephen Ioannou"}, {"rating": 5.0, "review": "my second one.  probably geting another for my study room,  to have access to all of my documents in every room.  works with my phone seamlessly", "verified": true, "helpfulness": "0/0", "author": "Hannah"}, {"rating": 5.0, "review": "I've been using this thing almost non-stop since I got it. It works great. Very good picture quality. Now I can use my phone to watch Netflix on my TV.", "verified": true, "helpfulness": "0/0", "author": "Barcelo"}, {"rating": 5.0, "review": "I got two of these. We use them mostly for Netflix, YouTube and Pandora. They don't work perfectly 100% of the time, but they work well enough most of the time to make them totally worth the price. We'll probably get a couple more at some point.", "verified": true, "helpfulness": "0/0", "author": "J. Turner"}, {"rating": 5.0, "review": "Easy to use. Good quality picture. Great for use with Netflix and HBO Go. And it has a very good price", "verified": true, "helpfulness": "0/0", "author": "Roberto David Gentile"}, {"rating": 2.0, "review": "I really want to learn how to use this and watch a movie on my TV....So far I can not figure it out..I know that it is my fault.. so I am still trying....Someone said to ask a 4 year old grandkid to explain it to me...might have to try that~~~~", "verified": true, "helpfulness": "0/0", "author": "Victor Roulund"}, {"rating": 3.0, "review": "The concept is great - a small, unobtrusive and affordable device which plugs into your HDMI port and provides HD quality sound and picture. The execution, however, leaves a bit to be desired. 1) It's buggy: It overrides the application inside the application and makes for some difficult navigation. Sometimes the application crashes during use and the stream cannot be controlled at all. 2) It's limited: Google makes it fairly obvious they want it to work with whatever application they think it should work. This means pay apps which Google either owns or is possibly getting a cut of the profits. I wish it were a little more \"rogue\" and it was up to the user as to what he/she wanted to stream. There are ways around it on a computer, but not your mobile device which would be more useful. All in all, it's fine and if you're already a Netflix subscriber, this comes in handy for a low price.", "verified": true, "helpfulness": "0/0", "author": "Blaine Henry \"Loko Hank\""}, {"rating": 5.0, "review": "The product is very good. I can wach my favorite series in this. It's like a smarth tv. I like it.", "verified": true, "helpfulness": "0/0", "author": "Sigifredo Escobar Gómez"}, {"rating": 4.0, "review": "You cann't watch all videos, only those linked to chromecast. But for the price, not bad. I'm using netflix and you tube, and happy with the quality.", "verified": true, "helpfulness": "0/0", "author": "Alexander G Zilber"}]