[{"rating": 5.0, "review": "This is a very convenient way to watch online content (i.e. YouTube) without having to get some other bulky product.  I also installed the chromecast extension on my laptop to further extend it capabilities", "verified": true, "helpfulness": "0/0", "author": "Mary"}, {"rating": 5.0, "review": "I wish they would quickly open up the SDK and add more features to it's streaming capability. For the price though, this is a now brainer.", "verified": true, "helpfulness": "0/0", "author": "Ananya Gupta"}, {"rating": 5.0, "review": "Simply plug in, setup, and watch.This is the second Chromecast in our household. We can use both at the same time without problems.", "verified": true, "helpfulness": "0/0", "author": "Rob Jensen"}, {"rating": 2.0, "review": "Picture quality is a joke. You also can not use it for most applications in Europe( netflix). You have to have a android of iPhone to use it.", "verified": true, "helpfulness": "0/0", "author": "B Review"}, {"rating": 4.0, "review": "Like the Chromecast hate that there are not enough apps yet.  I cant complain too much as mine was basically free with the free Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Rietman"}, {"rating": 5.0, "review": "I love my google chromecast this price of this product was a great price I love it for playing FarmVille via Google chrome", "verified": false, "helpfulness": "0/0", "author": "Dalton Bower"}, {"rating": 5.0, "review": "The Google Chromecast is very easy to set up and use. It pairs easily with your device and the simple push to stream on the TV is great. The only thing i would recommend is having fast internet service. I have the minimum speed from my provider and loading and drops occur but with the proper speed it brings YouTube, Netflix, videos, photos, etc. easily to your TV for better viewing. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This dongle is better than I expected! It was super easy to setup... took me about 5 min to hook up to my tv, iPad, etc. I'm so happy that I now have a way to watch some of my favorite live streaming websites on my tv. One thing that really helped me was to go to youtube and watch some tutorial videos on Chromecast. This is how I learned how to set everything up quickly and know all the cool features it can do. Like before I didn't know that I could watch videos that i have saved on my laptop, but now I know how to do it thanks to youtube. I think some of the negative reviews about Chromecast has to do with people not even knowing fully how it works. If you take the time to check out some videos online, you will realize how fantastic this little thing is", "verified": true, "helpfulness": "0/0", "author": "CeCe"}, {"rating": 5.0, "review": "Plugged this baby into the TV and paired it to my iPad.  In seconds I was watching youtube golf videos on the big screen. Netflix is awesome as well. Thinking of buying another one for upstairs.", "verified": true, "helpfulness": "0/0", "author": "paul johnson"}, {"rating": 4.0, "review": "works great with netflix and huluplus for streaming to a hd tv... also can stream from chrome browser with chromecast plugin", "verified": true, "helpfulness": "0/0", "author": "William Solomon"}]