[{"rating": 5.0, "review": "It is fast and works great with Amazon fire mouse. Awesom  to watch videos and movies", "verified": true, "helpfulness": "0/0", "author": "NQ"}, {"rating": 3.0, "review": "It's okay I guess. If I could do it again I would have gone with a Roku 3.Fire seems a bit buggy. It's unfortunate the way apps just end up in a horizontal slide show with no way of ordering them other than unistalling and re-installing. Prime videos have about a 1 in 5 chance of distorting the sound halfway through the video with no fix other than to reboot the system.Music app is worthless. So is the photos app. Most games are garbage mobile ports or clones of much better console and PC games.Suffers from the same limited lists in movie and tv show categories with no way to refresh or shuffle, leaving the user no choice but to search for anything that's not on the lists.No support for private channels (that I can tell.)I was upgrading from a 1st gen. Roku player and thought the Fire would win out over Roku 3. I was mistaken.", "verified": true, "helpfulness": "0/0", "author": "Duckmill"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Joe Landin"}, {"rating": 5.0, "review": "excellent", "verified": true, "helpfulness": "0/0", "author": "Keith Phillips \"Commander Phillips\""}, {"rating": 5.0, "review": "Just love it. Goodbye to cable.", "verified": true, "helpfulness": "0/0", "author": "C. Shannon \"csluvbbq\""}, {"rating": 2.0, "review": "It's a nice little unit works well. What I don't like is you pay your prime membership every year and still have to pay for shows you want to watch.", "verified": true, "helpfulness": "0/1", "author": "akuba"}, {"rating": 5.0, "review": "Exceeded my expectations", "verified": true, "helpfulness": "0/0", "author": "Leon Wessinger"}, {"rating": 4.0, "review": "I would like to see more movies and tv shows.  The sytem itself is great and is fast.Overall a great value with some very nice features.", "verified": true, "helpfulness": "0/0", "author": "Ian Moore"}, {"rating": 4.0, "review": "Bought for the sole purpose of watching MLB premium TV. My cable provider offers their MLB package for double the price and get this only airs 2 games a day in HD.  Deal-breakerGot this device over Roku because I have Prime.Device sleek, easy to set up and link with your media accounts very fast, the picture quality is superb, the voice control only works with amazon content (not with netflix)The remote is better than a phone app remoteWhen I first started watching MLB TV it started buffering every minute andI went online and saw many complaints about this.  No other app was buffering like thisI cleared the apps cache and restarted and problem solved.  Gives you both home or away broadcasts.and radio broadcasts Let's you hide scores, all games. It's really excellent.The rewind and ff is a little tricky plus YOU CANNOT FAST FORWARD ON GAMES THAT ARE STILL IN PROGRESS.  Not too much of a problem for me because I usually watch after the fact.Very happy with MLB TV on the Fire TV except for the no Rw or Ff on live gamesPicture quality excellentLike the feature of YouTube syncing and control with my phoneBut for MLB it works", "verified": true, "helpfulness": "1/1", "author": "Claudia"}, {"rating": 5.0, "review": "Its awesome", "verified": true, "helpfulness": "0/0", "author": "oudom"}]