[{"rating": 1.0, "review": "This device is telling me I have to change the settings on my router to get it to work. No way for a $35 piece of junk am I going to start fooling around with my router and home network.Direct to the trash and I'll buy another Roku box.", "verified": true, "helpfulness": "0/5", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Its hard to work with, if you cast a webpage it uses a lot of resources on your computer and if you are overseas and have a Personal VPN it doesnt work at all!! I have no issues with my Apple TV, so its definitely worth the extra $50", "verified": true, "helpfulness": "0/1", "author": "Juan Carlos H. Dealtan"}, {"rating": 5.0, "review": "Goodbye adapters, cords, and anything else annoying and unnecessary that was formerly required to project media from your comp to the TV.Definitely worth the money.", "verified": true, "helpfulness": "1/1", "author": "Simon G."}, {"rating": 5.0, "review": "The Chromecast has made my TV way more versatile and useful. Before the Chromecast, watching Netflix involved finding my laptop, plugging it in and logging on to the website. Pandora used to involve the same thing or finding a power source for my phone and using that as a Pandora player. The same goes for using YouTube. Now with the Chromecast I just turn on my TV and wait for the cast button to appear on my phone's Pandora, Netflix, or YouTube display and cast it straight to my TV. The greatest thing about this product is that the Chromecast assumes the responsibility of the streaming, this leaves your phone free from the constant strain on the battery when streaming.Brilliant packaging and a ten minute setup time made a great first impression on me. The second thing I noticed about the product was the lack of a user interface, leaving this product remarkably simple. Instead of fading to a black screen when not in use the Chromecast displays stunning photography that I will admit to leaving on for the ambiance it adds to a room. If your TV has a HDMI port you really should invest in one of these. There has not been a day since I got it that I haven't used it. A fantastic product and looking forward to buying more for the other TVs in my home.", "verified": true, "helpfulness": "1/2", "author": "Hayden"}, {"rating": 4.0, "review": "This little gadget is awesome.  I no longer have to connect my laptop to my tv with a 10 foot long HDMI cable.  I can stream any website I want over the browser.  Now I can watch movies while still working on other things on my laptop wirelessly.  I am also able to stream my Nexus phone and tablet over to the television.  My television's HDMI outlet produces enough power to enable the Chromecast, however a separate charging cable is provided in case its not.Otherwise, I don't think I would have purchased this if it hadn't been on sale.", "verified": false, "helpfulness": "0/0", "author": "Andy"}, {"rating": 1.0, "review": "Totally misleading! Bet a lot of people got this as a Christmas gift and got burned. This only lets you view netfix and youtube on your TV, which is already built into most new TVs or people have via Roku boxes. Its a waste of money!Last week I heard Google opened up the licensing so 3rd parties can push their apps to the TV through this as well. Better, but still not what consumers want. People want to be able to see ALL their Android apps on their TV, play their games, etc.Save your money for something else. It won't get used.", "verified": true, "helpfulness": "0/2", "author": "N. Smith"}, {"rating": 5.0, "review": "My iPad ate my first, and very eloquent, I might add.So, my fiancé and I saw the commercial for Chromecast, hopped into the car and we were off to Best Buy (sorry Amazon, the fiancé is a \" right now\" kind of guy).  Personally, I thought the Chromecast was neat, but we played Netflix through my Son's Nintendo Wii, our television supports Amazon Streaming Video (LOVE Alpha House, guys), so...what were we exactly going to use Chromecast for?At first it was only You Tube things.  THEN.  THE DAY FINALLY ARRIVED:  Chromecast now supported HBO GO!!!!  Now I could introduce my fiancé to my favorite shows:  Deadwood, Carnivale, Oz, Rome, Big Love and so many more wonderful HBO productions.  So far we've made it through Deadwood (while watching Deadwood, my fiancé asks, \"I had no idea females appreciated Westerns).  Surprise!  Some of us do.  We've torn through Rome, The Sopranos, and we're starting \"Boardwalk Empire\".Your product is magnificent and I know there is more coming.  So thanks, Google!  You've made this self-proclaimed \"Nerdiest Couple Ever\" very, very happy!", "verified": false, "helpfulness": "0/0", "author": "Kellie Cook"}, {"rating": 5.0, "review": "Picked this one up as a gift for my parents who had been using my PS3 for their Netflix.Well, the time had come where I wanted to get my PS3 back. I picked this up for Christmas and they really seem to like it. They use it with their iPad's netflix app and haven't had any issues.", "verified": true, "helpfulness": "0/0", "author": "T. Edwards"}, {"rating": 3.0, "review": "At this time not all of the apps we were hoping for are available. We look forward to using it more as more apps become available.", "verified": true, "helpfulness": "0/0", "author": "Nora A"}, {"rating": 5.0, "review": "Able to stream youtube from iphone without any issues... wish there are more apps that will be compatible with the chromecast.also able to cast chrome tabs from computer without any issues! Recommended!", "verified": true, "helpfulness": "0/0", "author": "Ken Zhang"}]