[{"rating": 4.0, "review": "have used it for pandora and netflix.  need to try hbo go and learn what others can be transmitted.  i originally thought i could send anything from my pc or smart phone", "verified": true, "helpfulness": "0/1", "author": "Bradley F. Keller"}, {"rating": 5.0, "review": "This is the best of the best wonder product.Wireless HDMI with no sacrifice to the quality of the video.stream your chrome web browser, youtube, netflix right away instead of waiting for the crappy TV apps which takes forever to load and search.", "verified": true, "helpfulness": "0/0", "author": "Kumar"}, {"rating": 1.0, "review": "Despite a fast high-speed WiFi connection and no other devices battling for bandwidth, slinging video from the Chrome browser on my new laptop to the Chromecast dongle on the back of my HDTV results in an utterly maddening viewing experience. It takes just minutes for the Chrome browser to start complaining about a poor connection. Again, there's nothing competing with Chromecast for bandwidth and everything else in the equation measures up to Google's required specs. Troubleshooting tips were useless.If you want to look at a webpage on your TV, then maybe this is a great solution. But to watch video - which, let's be honest, is what virtually everyone who buys Chromecast wants it to do at least part of the time - it's useless.God help you if you want to watch sports, action movies or anything involving motion of any kind. Chromecast stutters, sputters, freezes and stumbles until you just can't take it any more. High-quality streaming from a computer to an HDTV for $35 sounded too good to be true, and it was. Shame on me, but also shame on Google for rushing this piece of junk to market.", "verified": true, "helpfulness": "4/7", "author": "Enrico Pallazzo \"Jasper in VA\""}, {"rating": 5.0, "review": "The product is great and was fairly easy to  install.  One problem. I was promised I would be able to get Amazon Prime movies but am not able to do so. There is something called Pandora which I don't want, sounds like games.  I do want Amazon Prime movies.  please let me know how to get these movies asap.Thank you,Nancy Freemanliterate10@comcast.net", "verified": true, "helpfulness": "0/3", "author": "Nancy Freeman"}, {"rating": 5.0, "review": "So much fun to use - I can broadcast wirelessly from my MacBook, my iPhone, or my iPad to my TV - very easy set up and simple to use.", "verified": true, "helpfulness": "0/1", "author": "vikinggirl64"}, {"rating": 5.0, "review": "I have used a lot of different devices connected to my TV and of all of them, I like this the most.  I don't need to install special apps on it or need a special remote, it just uses the apps already on your phone or tablet.  Once Amazon Videos and UltraViolet streaming comes to it, I think it will be unbeatable for a media streaming device.I'm coming from having used the following; Smart TV with apps, Raspberry Pi with XMBC, Ruku, Wii and Google TV.I hope google makes a chromecast app that will run on other hardware such as an app on my SmartTV.", "verified": true, "helpfulness": "0/1", "author": "Eric L. Mccormick"}, {"rating": 4.0, "review": "Needs better integration with other video players on the web to be more useful, but you can always cast the tab at a lower quality.For things like Netflix, Prime, etc, it works great.", "verified": false, "helpfulness": "0/0", "author": "Kristin Ingalls"}, {"rating": 4.0, "review": "The instructions for setting up my Chromecast were easy to follow and within minutes I was watching a Netflix show on my TV.  Can also stream to tablets and phones.  The device itself is top notch so what follows is not Google's fault:  my disappointment is that I expected to be able to watch the same Netflix movie releases as I did when I was signed up for their DVD shipments.  Not even close!  There are very few top tier movies available through their streaming service, so don't get the Chromecast if you're doing it solely to watch Netflix movies.  Or if you do, continue to pay for their DVD service (or go to Redbox) and add their streaming service.  You can still get a lot of great TV shows and documentaries through Netflix so there is value added.", "verified": true, "helpfulness": "1/2", "author": "Nick"}, {"rating": 5.0, "review": "Have had the device about five days. Setup was simple used the USB on front of ATT box for power plugged into the AUX hdmi on front of receiver. In only a few seconds downloaded Chromecast app. Had friends over some had IOS some Android we all kept cueing you tube videos it was easy enough for Grandmas. I have had my computer connected to HDTV in family for years. Finally moved it  and utilized my desk since sending anything from my browser to TV is so easy. It was disappointing to not see app in  Kindle store however I started a kids movie on Netflix and there was the chromecast button. Click and it was on tv. Streamed content entire day didnt even notice any extra battery drain(seriously impressed) Ive installed  Home Automation, Custom  home theaters for twelve years this is easier than Apple TV and more functional considering openness of platforms IOS & android support and any computer running chrome. Hopefully this lays the groundwork for NEXUS TV. fingers crossed.  I do wish there was more options IE spotify from phone not just browser, Soundcloud etc. I'm an uber nerd so most people will be fine with Netflix, pandora, hulu+ etc. Time magazines gadget of the year, earned every bit of that title in my opinion.", "verified": true, "helpfulness": "2/3", "author": "Gary Fusion"}, {"rating": 5.0, "review": "I purchased 3 Chromecast devices from Amazon mainly because I like the wireless devices \"no wires needed\" you can't beat that. The chromecast does all that you would expect and it does it very well. I would certainly recommend it to my family and friends.", "verified": true, "helpfulness": "0/0", "author": "Joseph E Wienecke Jr"}]