[{"rating": 5.0, "review": "I would like the Fire to be an Audible device. You guys have a vast library and I would like to be able to stream audiobooks on my tv because then it easy to hear them while working or resting at home.I hope you can make this happen soon. This would be a big plus that no one can match. And if they could, it would increase sales of audiobooks.", "verified": true, "helpfulness": "2/3", "author": "Michael Oliver"}, {"rating": 3.0, "review": "OK. BUT. Where is You Tube????You tube has many many old TV shows and other entertainment. I had to buy a ROKU 3 to get Netflix and You tube. BUT, Roku 3 costs $100. It also has a UHF remote which allows you to control the programming from a distance.Roku 1 can provide the same as this Amazon fire for $59.What does Amazon fire offer better than ROKU?", "verified": false, "helpfulness": "0/10", "author": "Carl23"}, {"rating": 5.0, "review": "I've been streaming via my laptop for many months and, as I'm a minimalist, I have hesitated to add other hardware to the shelves.  I'm aware of Roku, etc., but when the email came about Amazon Fire TV I finally bit.  I'm glad that I did.  The free Pandora app is, well, I ABSOLUTELY LOVE IT!  I also stream Amazon and Netflix video.  Both are presenting beautifully.  Navigation works fine for me.  So what if the voice command function takes one to the Amazon library only.  I'm expecting that Amazon will win the video streaming battle anyway considering Amazon's offering of new and recent movie releases for rental (you have to watch for these because they aren't available for long).  For $3.99 or $4.99 we have viewed most of the 2013 titles that are worth viewing.  This certainly beats $22 at the theater plus $15 for a bag of popcorn and a bottle of water.  I do not do games so I cannot comment on that issue.  As for video, I am now ready to put the 42\" into a bedroom and clutter my life with a 60\" screen.  This was a well spent $100 plus tax.", "verified": true, "helpfulness": "4/4", "author": "Michael J Wiley"}, {"rating": 5.0, "review": "Wow for a first crack at a streaming device Amazon hit it out of the park !Only two drawbacks no HBOGO and voice search only works with Amazon videos", "verified": true, "helpfulness": "2/2", "author": "Robert Timpone"}, {"rating": 4.0, "review": "I got my Fire TV yesterday and set it up intermediately. So far I am impressed with the speed and functionality of this device. Set up was about as easy as it gets, equivalent to setting up a Roku or Apple TV. Just plug in an HDMI cable (not included), the power cable, and that that's about it unless you need to use an optical audio cable or are plugging it into an Ethernet jack.Connecting to my wireless network was fast and easy. It can scan dual band signals (2.4 and 5GZ bands), so I used the 5GZ band as it's less crowded in my home.After it's connected to the network it runs a brief tutorial showing you how to use the remote, install apps, use voice search, etc. I found this device to be very fast in firing up video's from Amazon Instant Video. It takes a bit longer to launch videos from Netflix, but no worse than the Apple TV or Roku 2XD that i own.The picture is very high quality although dependent on the video source of course. Sound is also excellent. I chose to send Dolby Digital 5.1 via HDMI to an A/V receiver and it is feeding the receiver with a Dolby Digital 5.1 signal as it's supposed to. I haven't tried any gaming yet as i am waiting for a controller which won't be sent till later in April according to Amazon.My only complaint is that it is missing some apps that I have on my Roku such as MLB, NHL, Dishworld (for European soccer), MLS, Vudu, and TWIT TV. I imagine that these will all come in time so I will be patient.I get a kick out of all the people who have given this device a 1 star rating without having even purchased it, Griping and complaining that it didn't have HBO GO. People, it's been out on the market for less than a week. It takes time to get deals with content providers. If it doesn't have all the apps you want then don't buy it till it does. I'm sure Amazon is working to get as many apps as possible and I look forward to seeing what else they do with it regarding content/channels, and games. Show me any device of this nature that had every app and feature the public wanted right out of the gate. There isn't one.Now will someone make some deals with \"cable\" channels so we can pay for the stations we want so we can dump cable and satellite providers completely?!", "verified": true, "helpfulness": "4/4", "author": "David"}, {"rating": 3.0, "review": "The set up was easy and fast. The unit is very responsive and the controls are intuitive. I haven't yet used the voice control but will be trying it tonight.My biggest gripe is that there is no way to use this unit to play my Amazon music content! That is a MAJOR limitation that could have been easily included. So Amazon sells a unit that won't play Amazon music but does play Pandora and others. Ugh.", "verified": true, "helpfulness": "2/3", "author": "Wab"}, {"rating": 2.0, "review": "I was pretty excited to get a little streaming box for the bed room and since I already own a PS4 and PS3 I didn't need something for the TV room and quite frankly it lacks to many features to replace the tv room.QualityBuild quality is great, everything feels solid, small and easy to fit in almost any room or home.PerformanceThe system boots up pretty quickly, I tried a few games and it lagged quite a bit but I bought the unit for a streaming device so that really doesn't bother me,  the wireless works pretty well though it has dropped a few times during a streaming test but over all its pretty solid and other then wireless drops the movies and tv shows look clean and good.UIThe ui is pretty basic, its similar to other Amazon devices, its fluid easy navigation and gets anyone around quite easily.AppsThis is where the system falls flat, the app support currently is awful, there is a total of 25 apps available to download, and for anyone that has NAS solutions or other ways of streaming media should stay away cause unless you use amazon or Netflix or some of the common streaming solutions there isn't much out there in terms of having a wide Varity of options.  This will probably change but for a device to come so late in the game I expected WAY more media options.Conclusion.The Fire TV is a solid solution but it misses a lot of marks, there is no connections to home solutions, cant offload movies and pictures from the offered USB port, you are pretty much forced to use amazons cloud ( which was by obvious design) the app selections are terrible and the fact you cant even connect to google play or amazons main APP center just limits the box even more.  My biggest gripe is not being able to connect to my home solutions very easily, I have a Sinology SAN which works for IOS, Android and even Kendle apps but there is no apps or any way to even connect to it via the wifi and this is very frustrating.  overall if you are looking for a streaming solution and have Netflix and amazon prime and nothing els this is a pretty solid option but to be honest a Roku, or Apple TV or even 100$ for a PS3 is a way better bang for you buck.", "verified": true, "helpfulness": "7/12", "author": "A. Briggs"}, {"rating": 4.0, "review": "Would recommend amazon set this up so you could use the same apps that are available on the fire. An make the fire a game controller is a similar manner you can sling your movies from the fire to the fire tv.", "verified": true, "helpfulness": "1/2", "author": "jonc"}, {"rating": 4.0, "review": "UPDATEI wrote a review and only gave this product 2 stars when I first got my Fire TV, but I'm adding 2 more because of the way things are going. I have been playing around with it more and I'm getting used to this cool box. I'm impressed more and more with the way Amazon is listening to the customer, now voice search also shows hulu and netflix results!, making it more easy to find your movies and tv shows on different streaming services, not just Amazon as it previously did. I would like to see a section for Free Prime movies and shows only, this will make navigation extremely easy.I want to acknowledge that I still believe in this awesome product and yes I was wrong when I compared the chromecast to the Amazon Fire Tv. I just like to be practical and sometimes it takes me some time to familiarize with a new product.I can't wait to see what this box will be capable to do.Keep up the good work Amazon!", "verified": true, "helpfulness": "1/11", "author": "Rony Martinez"}, {"rating": 3.0, "review": "Well... I'm looking at the specs and still trying to understand what really separates this... Why not pay the same price for all the same features AND a blu Ray player?  What am I missing?", "verified": false, "helpfulness": "0/7", "author": "Dr James Pendleton \"James Pendleton\""}]