[{"rating": 5.0, "review": "This works just as promised. I have no issues with the device.", "verified": true, "helpfulness": "0/0", "author": "Amazon Surfer"}, {"rating": 1.0, "review": "didn't work", "verified": true, "helpfulness": "0/1", "author": "tom garland"}, {"rating": 5.0, "review": "Works great! Does everything you'll want and more.", "verified": true, "helpfulness": "0/0", "author": "jeff"}, {"rating": 5.0, "review": "great tech!", "verified": true, "helpfulness": "0/0", "author": "Gary R Simon"}, {"rating": 5.0, "review": "the best ever item i bought throw amazon", "verified": true, "helpfulness": "0/0", "author": "Said Z."}, {"rating": 4.0, "review": "Haven't had a chance to use it as much as I'd like, but so far, it's really awesome.  Every now and then have to reboot my router, which is why this review isn't 5 stars.", "verified": false, "helpfulness": "0/0", "author": "Philip Hatfield"}, {"rating": 3.0, "review": "It's great when it works. I often have to unplug/plug it back in to get it working again, and sometimes needing a hard refresh every 1-3 months.", "verified": true, "helpfulness": "0/0", "author": "Todd"}, {"rating": 5.0, "review": ". easy to install and well worth the price. now can watch youtube and all the tv shows, movies, comedians from the golden age of entertainment.", "verified": true, "helpfulness": "0/0", "author": "fred"}, {"rating": 1.0, "review": "I have a Samsung smart TV with all the apps, only reason to buy Comcast to be able to cast everything from any of the portable devices laptops, smartphones and tablets. Much to my disappointment cast images ONLY works for specific applications supported by chromecast. Also Apple/QuickTime movie trailers would not work either even if the plug in for chrome browser is present. Last but not the least I noticed everytime I turn on the TV Samsung remote would not work, let's say, to increase or decrease the volume, workaround is to get the chromecast disconnected either physically or at software layer in order to have control. In addition to this there is a lag casting the contents over to the tv, my guess is it mgut work better qoth wireless AC mode capability. So in a nutshell it has been a waste for me to invest in chromecast.", "verified": true, "helpfulness": "0/0", "author": "Imran \"Kestrel142\""}, {"rating": 5.0, "review": "Nice!!", "verified": true, "helpfulness": "0/0", "author": "felipe"}]