[{"rating": 5.0, "review": "Easy to installed (less then 5 sec.) Everythg/Anything you can put on your computer you can send to your TV now. Highly recommend this to anybody trying to do away with the cost of cable TV.", "verified": true, "helpfulness": "0/0", "author": "a jean g"}, {"rating": 4.0, "review": "Had this unit connected to my smart TV....(quite simple plug in)....now I get a big kick  watching Utube  using surround sound....and on big screen prompted by cell or pad.......I am still trying to explore further possibilities for this smart gadget !", "verified": true, "helpfulness": "0/0", "author": "Health seeker"}, {"rating": 5.0, "review": "I love this item I use it all the time to watch movies from my new HTC ONE (M8) Phone . the phone has the app that is compatible to use it. Great Item !!!!", "verified": true, "helpfulness": "0/0", "author": "OldSnake1902 \"Pro Gamer\""}, {"rating": 5.0, "review": "no issues at all.and specially after a 3rd party created apps for you to stream anything from your phone.", "verified": true, "helpfulness": "0/0", "author": "Jorge Rodriguez"}, {"rating": 2.0, "review": "There is no seamless experience while using this device. If I stream netflix from my iPad, I need to keep unlocking the iPad to pause, change episodes etc. Most iPad apps don't support this yet. And playing Chrome tabs on my TV is super-laggy. Lastly, audio quality has been consistently rubbish.I'm probably going to go back to paying Xbox 50 bucks a year for Live. Bummer.", "verified": true, "helpfulness": "0/3", "author": "techgeek"}, {"rating": 5.0, "review": "This is an awesome product especially considering the frequent updates as well as the low cost. I have purchased several of these.", "verified": true, "helpfulness": "0/0", "author": "Yesenia"}, {"rating": 5.0, "review": "Great usability and versatility when combined with the correct applications on the phone. Very handy to cast images/videos/web-videos to any hdmi-enabled tv.", "verified": true, "helpfulness": "0/0", "author": "Vladimir"}, {"rating": 5.0, "review": "I have bought 2 for gifts and they love them. (Price also makes it a very good deal.) I will be buying more in the future.", "verified": true, "helpfulness": "0/0", "author": "mjcl"}, {"rating": 5.0, "review": "This is for my coffee shop...I have cable but I don't like what is on there. This offers more opportunities.", "verified": true, "helpfulness": "0/0", "author": "M. Morkert \"Pastor Mike\""}, {"rating": 2.0, "review": "If you already have a wi-fi enabled TV, this doesn't necessarily add much.Although the product description says, \"Send video, music or anything from the Web to your TV from your smartphone, tablet or laptop,\" when it comes to \"anything from the web,\" it's more like \"from a tiny slice of the web\" if you want to use this with an Android tablet/phone.The Android tablet/phone options aren't browser-based. So, you can choose from about two dozen Android apps to cast with (as of May, 2014). It's more than my tv, but I have a modern tv, so the additions aren't anything I was missing. You cannot yet use Chrome on your tablet to cast using Chromecast.So you have to use Chrome on a computer to cast \"anything on the web.\" It decreases the convenience quite a bit, and in my case, it made my Macbook Pro run over-the-top hot. Way hotter than when I just stream video and watch it on the laptop screen.When it is well-integrated with the Android version of Chrome, it will be great. But not yet.", "verified": true, "helpfulness": "0/0", "author": "Kathleen"}]