[{"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Yakov O. Breyt \"ybreyt\""}, {"rating": 3.0, "review": "While it is easy to connect and set up, you can only use it for a couple apps such as youtube, netflix, Pandora and Google movies. It also does not work with the surface tablet.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}, {"rating": 1.0, "review": "Won't work with Apple Airport Express.  Would have been nice to know that before ordering it.", "verified": true, "helpfulness": "0/1", "author": "Naven Johnson"}, {"rating": 5.0, "review": "Never believed I could like it as much as I do.", "verified": true, "helpfulness": "0/1", "author": "Robert Severson"}, {"rating": 5.0, "review": "Works great for me.", "verified": true, "helpfulness": "0/1", "author": "Mike"}, {"rating": 5.0, "review": "perfect!!!", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 2.0, "review": "Too restrictive and set up is not intuitive. You can plug the dongle in and power it up yet many devices cannot act as a remote. I just wish it were more like a Roku or other set top box. It is not.", "verified": true, "helpfulness": "0/0", "author": "Celeste and Gampy"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/1", "author": "Claud Souza"}, {"rating": 4.0, "review": "Does what its supposed to but (on our network at least) there is significant lag time when casting from my desktop. Tablet and phone (which are probably optimized for mobile) casts much better.", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Hodnett"}, {"rating": 5.0, "review": "Chromecast is an awesome product by Google.- I can cast my entire phone screen or tablet screen on to the TV- Cast browser TAB or Entire desktop on to the TV- Guest mode lets friends cast their picture on to the TVMost of the video streaming apps on Phone/tablet now comes with Cast button built-in : Example : Youtube, Netflix, ESPN GO, YuppTV, etc.Above all this, Google keeps on give rebates, discounts and gifts for Chromecast users. :) Cannot complain about free gifts.I have 3 Chromecasts in my house and it has integrated well into our family. My son, who is almost 3 years old, know how to cast it to the TV what he is watching on youtube, using his tablet.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]