[{"rating": 3.0, "review": "It didn't do all I expeded.", "verified": true, "helpfulness": "0/3", "author": "Robert Caine"}, {"rating": 3.0, "review": "Works great", "verified": true, "helpfulness": "0/2", "author": "George L. Miranda \"George Louis Miranda\""}, {"rating": 3.0, "review": "I mean it is what it is, I didn't like how this only streamed 720P from my laptop's videos. It wasn't what I was looking for, what I needed was an HDMI adapter since my laptop didn't have one. That was the only issue so I bought this to stream my videos, but it disappointing me. However this is not a bad product, for people who are just streaming YouTube or Netflix you'll get the quality you want. I just found it more helpful for me that I connect an HDMI cable instead.", "verified": true, "helpfulness": "2/2", "author": "Jimmy"}, {"rating": 4.0, "review": "I like the idea but you have to have a strong internet connection for it to work properly.I had to return it because of this, but it's a great product.", "verified": true, "helpfulness": "2/2", "author": "Gregory"}, {"rating": 3.0, "review": "It is a good thing. But it freezes sometimes. I used to hook my laptop to TV with a HDMI cable, but Chromecast has made it easy for me to watch Youtube  even from my phone device.", "verified": true, "helpfulness": "0/0", "author": "samza \"samaza\""}, {"rating": 5.0, "review": "Love this little gadget! I just keep buying them for gifts now!", "verified": true, "helpfulness": "1/1", "author": "FairOphelia9"}, {"rating": 5.0, "review": "Good price and order was processed properly. Chromecast = Awesome. As well as using with handheld devices, Google has added a cast button in their Chrome browser so you can just use laptop and do anything.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Not sure what I ever did without mine.  I can't get enough of it!  Best money  I've ever spent", "verified": true, "helpfulness": "0/0", "author": "Emily Bowers"}, {"rating": 4.0, "review": "Not bad.  Love the easy portability of it.  I also have the fire tv stick.  If I didn't have a lot of purchased media on google play and was trying to decide between the 2, I would go with the fire tv stick.  Didn't realize how much I would like the remote.  So much better than using my phone.  Except when using youtube, that's easier when using your phone/tablet.", "verified": true, "helpfulness": "0/0", "author": "B.N."}, {"rating": 5.0, "review": "Love it i have one on every tv in my house... Way better then Apple TV and is cheeper too", "verified": true, "helpfulness": "0/0", "author": "Eric C"}]