[{"rating": 5.0, "review": "Love the Fire TV. The remote is so much better than Apple TV's! Incredible content availability with Prime.", "verified": true, "helpfulness": "0/0", "author": "clreindeer"}, {"rating": 5.0, "review": "Great product.  Well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Paula"}, {"rating": 5.0, "review": "Dear Amazon,THANK YOU so MUCH for Amazon Fire!  It has helped us to cut the cord with cable.  Now there is no going back.  We couldn't be happier.  And, as Prime members, we are enjoy the added benefits.  I just can't say thank you enough.  The fun part is the remote.  It's nice to talk to a remote the responds to my requests.  It really listens to my needs. :-)Faithful,Amazon Customer", "verified": true, "helpfulness": "0/0", "author": "Lazy Cat \"Noonie 1020\""}, {"rating": 5.0, "review": "Had lots of problems with Roku, returned it and tried this one, we've been very happy.  If the kids use the remote for games, batteries wear out very quickly.  Had a problem at the beginning with getting the Netflix app to work, and their customer service was good.", "verified": true, "helpfulness": "0/0", "author": "Sara Kronteres"}, {"rating": 5.0, "review": "Extremely easy to set up and navigate through the vast list of movies and TV programs. Particularly useful is the fact that the mobile device is connected via Bluetooth and can be used from anywhere in the room without having to be in line-of-sight with the Amazon Fire TV unit itself. I highly recommend this as a better alternative to Apple's iHome.", "verified": true, "helpfulness": "0/0", "author": "Gregory Smith"}, {"rating": 5.0, "review": "Great and easy to use!!!", "verified": true, "helpfulness": "0/0", "author": "FDWhitehawk"}, {"rating": 5.0, "review": "The Sony television I have had came with a YouTube app - that went away on 4/20/15. I had a choice between an HDMI cable, a Chrome cast plug-in, or you Fire TV. My television has an HDMI port - but not my computer. I choose yours because it did what the others did - and much more. I enjoy the voice recognition - although I do feel a bit strange sitting alone talking to the TV. Overall I'm very satisfied, and will probably add Amazon, Netflix or Hulu. I think I'm the same as everyone else when it comes to wanting to watch, what I want to watch, when I want to watch it. Besides, network TV is turning - or has already turned- into a moronic inferno.100 channels - and little of value to watch.My only complaint is that all this technology is changing faster that my limited technological ability to keep up.It seems as if as soon as I master which buttons to push - someone insists on changing it. Where is all this going? Is there a plan? Quo vadis - ?", "verified": true, "helpfulness": "0/0", "author": "Abbott Lee"}, {"rating": 4.0, "review": "I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Tim Chance"}, {"rating": 5.0, "review": "I love this.  Been using it non stop since I bought it.", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Susan Donnelly"}]