[{"rating": 5.0, "review": "hands down the best product for any android device. I've had this product for more than a month now. I have no had any issues so far, arrived well packaged and stays connected to my TV. I do wish there was a switch to turn it on and off though, but for it's price and wait it's awesome. Works well with MODDED ROMS and android carrier OS's", "verified": true, "helpfulness": "0/0", "author": "Romy"}, {"rating": 3.0, "review": "I would give more stars if it didn't have a light shining day and night...and if Netflicks had anything good to watch...Netflicks used to be worth it...so now It's pretty much you tube or nothing...needs more apps...", "verified": true, "helpfulness": "0/0", "author": "Wagney"}, {"rating": 3.0, "review": "It is similar to Apple's AirPlay, you can cast videos to the TV, but it didn't contain some App inside, so you have to use a Smartphone or a Tablet to cast.  Unlike Apple TV, without a phone or tablet, you can do nothing.Much worse, there are too few apps supporting Chromecast, in my iOS device, only Netflix and Youtube.  I don't have any Android device at hand, so I don't know how much Android app supporting it now.Anyway, it is not expensive, so 3 stars.", "verified": true, "helpfulness": "0/1", "author": "JIONG XU"}, {"rating": 1.0, "review": "I and probably most people bought this with the dream of watching locally stored video on my TV.  My PC and Laptop are in other rooms from where my TV sits.  I'm not moving my laptop to be near the TV whenever I want to watch a stored video.  There's no room for a laptop except for the floor and with a 7 year old child and a dog running around the house, that is not going to happen.  The Chromecast would solve this problem.  But Google is being a butt-head about letting developers release there apps.  This device was released on July 24, 2013.  Today is 16 October and still NOTHING.  When an enterprising individual came up with his own app to play locally stored video, Google killed it with an update to the Chromecast.  For Google wanting to be more open with this device, it takes a backseat to it's precious partners who have yet to get off the stick.  Third party developer's have Apps waiting in the wings and Google is the roadblock.  As for the FEW available apps, they do work great.So, my advice is DO NOT BUY until Google is ready to let the ball roll.  Keep checking back here for newer reviews that will then sing this thing praises.  Then you'll know it's time to buy.  For now, my $35 is wasted.  I haven't used in in almost 2 months.  It'll sit there for now.", "verified": false, "helpfulness": "156/203", "author": "Shogun"}, {"rating": 4.0, "review": "Excellent for traveling with a laptop and streaming movies in a hotel room. Only problem can be router or hub if the wireless connection is slow.", "verified": true, "helpfulness": "0/0", "author": "Kelly Ryan"}, {"rating": 2.0, "review": "was given bad info..doesn't work with my older tv and can't use from my pc..i was told by best buy it would so its a 40 buck waste of money", "verified": true, "helpfulness": "1/2", "author": "larry hirsch"}, {"rating": 5.0, "review": "I knew someone would eventually come out with something like this. It's so nice to be able to just plug it in to the TV and stream shows. Hate to have to have a big Xbox or whatever to stream from. This eliminates the need for that. :)", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I was going to buy another Apple TV to use in our bedroom. Wish I had this just doesn't cut it for me. Wish I had another Apple TV which is so easy to use.", "verified": true, "helpfulness": "0/2", "author": "Bruce L."}, {"rating": 1.0, "review": "I was hoping I could put my computer screen onto my TV, but you can't really do that.  It only works with a handful of apps.  If you have a smart TV then there is not much use for Chromecast.  If you have a dumb TV then it probably has value.", "verified": true, "helpfulness": "23/30", "author": "rmroan \"ronnie1\""}, {"rating": 4.0, "review": "Very good construction and packaging. Very good interface.Limited (at least for now) to youtube, netflix and google movies. Hoping the functionality will be extended in the future.Much better than the rikomagic stick I had before it.", "verified": true, "helpfulness": "0/0", "author": "Hallux"}]