[{"rating": 4.0, "review": "Extremely promising unit.  Performs quite well and is very fast.  I would like for voice search to extend across all movie/TV content providers (only Amazon for now).  I would also like a way to \"pin\" my favorite applications to a personal section where I can control what is displayed or hidden and in what order, etc.  Right now there's only the recently used section which is dynamic.  Gotta say, though -- for a v1.0 it is pretty solid and holds a lot of promise.Some additional -- random notes:First of all -- I own 2x Roku LT set-top boxes and 2x Chromecast units, as well as the Fire TV.* Fire TV is a quality unit.  Small but has some \"heft\" to it.  No fear of the cables dragging the unit off the shelf.* The connectors or solid and attach with a quality and secure feel.  Nothing feels \"cheap\" about this unit.  While I hate to use the term \"apple-like\" it does have a quality \"apple-like\" feel to the unit -- even the packaging.* The UI needs some work.  While it is fast and \"technically/logically\" categorized, it is not \"intuitively\" designed -- and it is way too \"Amazon-centric\".  The Movies and TV section displays Amazon Movies and TV shows -- not your Movies or TV apps.  And the content is only from Amazon Prime.  And as stated in other reviews -- the free Prime content is mixed in with the pay content and not clearly denoted until you try to watch it.  I'd really like to see a section where a user can \"pin\" their favorite apps.* Video playback quality is outstanding.  Visually better than my Roku units.  (Haven't really compared to Chromecast)* The remote controls is nice and simple, but the dark remote with dark buttons, makes it a bit difficult to navigate in a darkened room. No support for Universal Remotes -- especially Logitech Harmony remotes at this point in time.  A problem for me as the kids have a hard enough time keeping track of one remote -- much less 2.* Audio output options are excellent.  You can route audio via HDMI or SPDIF Optical or both.* Want to playback your computer downloaded movies?  One word -- PLEX.  Install the Plex Fire TV client (99 cents) and then install the free Plex Media Server on your computer.  It's fast and easy and will play back virtually all your content beautifully.  Don't try this on a single core computer -- give it a fair chance with a reasonably easy dual core or quad core.  Plex will stream Fire TV natively supported file types and allow the Fire TV to decode; however, if it is a file type that Fire TV cannot handle, the Plex Media Server computer will \"transcode\" the file into  a supported format.  This will require some CPU power on your computer.  BTW -- XBMC can be side-loaded and works fine, but it requires some hacker skills and launching once installed is not very intuitive.* Voice search is amazing ... But., limited to Amazon Prime content at this point in time.  I read that this will be expanded as other content providers re-write their apps for this feature.* No access to Google  Play Store.  You are tied to Amazon (unless you hack or side-load apps).  The stuff you've purchased for your phone or tablet on the Amazon Store, do not seem to be available for installation on the Fire TV.  (Possibly due to hardware compatibility??)In closing:  Is the Amazon Fire TV perfect? No.  Is there a value proposition and is the device worth the cost ($99)?  I believe so.  Remember -- this is a v1.0 product.  There are a whole lot of things that can be done to improve the device and with the input of the fabulous user community, I' feel pretty confident that it will be addressed -- either by Amazon, or the development community.  (Remember -- this is based on an Android OS and there is quite a capable and adept community of developers more than willing to give you what Amazon won't.)If I had to give a quick tip to Amazon, it would be:  Do not make this lean so heavily towards Prime, that it loses it's place as a premium general purpose set-top streaming device.  It's kinda looking like something you should be throwing in for free with an annual Amazon Prime subscription, and you don't want that.  This product has the capability of appealing to a munch broader audience.  I'll attribute this to a v1.0 thing and trust that future releases will broaden the support and customization.** If you've read all the way to the end -- What are you still doing here.  Go buy the darn thing and take it out for a spin !!", "verified": true, "helpfulness": "1/1", "author": "Richard"}, {"rating": 4.0, "review": "All I can really say is, the more I use it, the more I like Fire TV!I! Is this a Roku? No. This is an Amazon streaming box and all other apps are basically secondary. Coming from a Roku2 XS, the FTV is different in virtually every way. Faster, instant stream start on Amazon, faster Netflix loading than Roku2 XS. Waaaaaaaaaaaay fewer apps than Roku, but they will come in time, just as Roku did. Heck, Roku now, FINALLY, just got You Tube! So I am not concerned much. Most major apps are available. People fret over no VUDU, I say, who cares? What difference does it make whether you pay Amazon for a movie or Vudu? It's the same flick! Go in with the understanding that this IS based around Amazon Prime and all will be well. The picture ramps up to full 1080p faster than the Roku2 XS, also.The reason for detracting one star is because there is no IR support, unlike my Roku2 XS that does support IR and I can use my Harmony remote.", "verified": true, "helpfulness": "1/1", "author": "M. Connelly"}, {"rating": 5.0, "review": "Works well. Nice to have this option since its hard to find anything on regular tv I want to watch.  I much prefer the previous way Prime was set up to find a movie.  I feel this product is well worth the money.", "verified": true, "helpfulness": "0/0", "author": "Michael Pasqua"}, {"rating": 5.0, "review": "Purchased the Amazon Fire TV, as I am mainly Housebound because of a Back Injury, and needed something to watch, It arrived very fast, very easy install, after the initial update, it was up and running within 30 minutes of install, great selection of free movies, TV programs, and apps & games, the voice control works instantly and I have watched many things. GREAT JOB AMAZON", "verified": true, "helpfulness": "1/1", "author": "M. Wheeler \"Mick\""}, {"rating": 3.0, "review": "Pros: slick looking device.... Great picture quality over wireless... Extremely fast..., I am using it wirelessly and no buffering like I get with other streaming devicesCons: not enough of the basic apps every streaming device should have... No Hbo Go, no vudu, no time warner app to stream live tv... It is basically a amazon on demand streaming device ... Voice search only works for prime.. If you say house of cards it brings up amazon version to buy.... Come on how do you not bring up netflix version that is free?", "verified": true, "helpfulness": "1/3", "author": "William Coleman"}, {"rating": 5.0, "review": "Hands down the best streaming device I have ever used.  Netflix was very poor through my blu-ray player and Amazon video was just OK.  My Sony tv was actually slightly worse for streaming content.  The Fire TV with four core processor and dual wifi antennas just does an absolutely amazing job at playing video.  Video is always crisp and clear and load times for both Amazon video and Netflix are almost instantaneous.  Will be giving this as gifts this year for Christmas!", "verified": true, "helpfulness": "1/1", "author": "Greg \"greg19444\""}, {"rating": 5.0, "review": "I have only owned the Amazon Fire TV for about 12 hours.  I was in love, 5 minutes out of the box. First, make sure you have an HDMI cable ready to use!  We had zero issues with our wifi and we have it hooked up in a room at the opposite end of the house. For those with wifi issues, I suggest a simple plug in wifi booster.  It worked great before we bought the new modem.  The Amazon Fire TV is user friendly for those of us that have remote issues. I am forever handing the remote(s) to one of the kids, \"find me this or that\". Now, I just talk into the remote. Last night, we tried searching all \"Paul Walker\" movies and 100 options came back. 1-2-3  I couldn't be happier that this supports closed captioning! Finally, a device that the deaf community can use (besides an Apple TV)!!  My Netflix and Amazon Prime is now being put to good use!", "verified": false, "helpfulness": "4/5", "author": "Susan L. Macdonald"}, {"rating": 3.0, "review": "I have a very fast internet connection. Yet, I go on-line with this via Wi-Fi..I get this....The download seems slower than normal. Please check your internet connection. Hmmmm..I would suggest that you up-grade your servers BEFORE the launch. I am about ready to go back to my RoKu...# disappointed", "verified": true, "helpfulness": "5/6", "author": "Joseph Dombek III"}, {"rating": 5.0, "review": "Our cable bill slipped past $200 a month after they put thru a price increase and didn't mention it. So, got an old school broadcast antenna for local channels (we get 43 here in Las Vegas, with lots of old movies and TV shows). And were trying to decide between TiVo and something streaming. For the price, we decided to try Amazon Fire TV. We kept the cable high speed internet connection and it works very well with Amazon. It's 25mbps (for $70 a month) and we don't have any fits or jerks or streaming problems.We find we do need a DVR for broadcast shows that we like: \"Elementary,\" which Amazon streams, but charges $3 for. (Old shows are free, current episodes cost.)Do like the selection, but have gotten stalled at \"Mr. Selfridge,\" and have consumed all episodes including the current one which, again, costs $3.Really like the voice command which understands me, but my southern wife, not so well.", "verified": true, "helpfulness": "0/0", "author": "Jack R. Chappell \"Spindoc\""}, {"rating": 5.0, "review": "I have Apple TV and I like the Amazon Fire better. The best features are the voice command, the games and the ability to stream from Amazon. lol.  I can still watch netflix and hulu. What more could I want?  If developers are listening out there, I would like the ability to get certain tv sub channels like MeTV, Antenna TV etc. that are not available  everywhere.", "verified": true, "helpfulness": "5/5", "author": "Amazon Customer"}]