[{"rating": 5.0, "review": "Easy to set up, still learning to use it", "verified": true, "helpfulness": "0/0", "author": "Antonella Piana \"Anto64\""}, {"rating": 5.0, "review": "Great item i replaced my old apple tv for this amazon fire tv one big + over apple tv is the Bluetooth remote i was completely tired of using apple remote and that you have to point remote in straight line to apple tv . In short words i love my new fire tv", "verified": true, "helpfulness": "0/0", "author": "Juan Rivera \"flaco\""}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Ivan Garcia"}, {"rating": 4.0, "review": "Is ok but you have to have the amazon prime subscription or otherwise you won't be able to watch anything!", "verified": true, "helpfulness": "0/0", "author": "roman"}, {"rating": 5.0, "review": "Recently cut the cord and this box has saved me.", "verified": true, "helpfulness": "0/0", "author": "Nick G"}, {"rating": 5.0, "review": "We love our Amazon TV!  We will soon be dropping our cable and using Amazon for all our TV watching.  The movies, video games, TV series, and TV channels are all we need and they come \"without\" commercials.  Oh happy day!", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 1.0, "review": "Netflix did not work property, reading online asked me to clear cache and restart. I un plugged and it never started again. Waiting for replacement", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"jayjathaul\""}, {"rating": 5.0, "review": "Excellent streaming device. I've had no issues with it thus far. I'm able to watch every show and movie I love and play games as wellDo not hesitate to purchase!", "verified": true, "helpfulness": "0/0", "author": "Chanell"}, {"rating": 5.0, "review": "LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Dan Izzo"}, {"rating": 1.0, "review": "The UI is horrible. It's not at all what I had expected. I feel like some people may love this UI but for how I would want to use the device it is not great. i am more interested in using slingtv and netflix and games and these do not take precedence at all in the UI. it's all about movies and TV shows. The stuff I care about has horrible organization. It takes way to many clicks to get to were I want to go.Another thing, the quallity of the voice remote is not great. I may have a bad one though. The button does not seem to be debounced properly. That is the technical term for I click the button once, and it thinks I clicked it many times. It starts going way past where I wanted it to go when I am navigating.", "verified": true, "helpfulness": "1/2", "author": "Kirk"}]