[{"rating": 5.0, "review": "Very easy to set up and start using.  Loving it so far.  So fun to stream our movies from Netflix and Amazon Prime.We look forward to trying some games and other functions also.", "verified": true, "helpfulness": "1/1", "author": "Cindy  - Montana"}, {"rating": 4.0, "review": "I thought at first that who needs the voice search for movies, etc, but it is so convenient and easy to use it would be hard to live without.  I would like to have voice search for Netflix and other apps and hopefully that will come later.  The main problem I see is the \"Prime\" library of movies is very limited.  Amazon Fire TV wants you to rent movies that you can watch for free on other sources.  Overall I am very happy with this product and would highly recommend it, mainly because it is so simple to operate.", "verified": true, "helpfulness": "0/0", "author": "Thomas P. Chalfant"}, {"rating": 5.0, "review": "Item is fast as it being quad core easy to navigate straight forward controls  if you like playing games get the game controller as you do not want to over use the remote for viewing online.", "verified": true, "helpfulness": "0/0", "author": "raven \"raven\""}, {"rating": 5.0, "review": "I love the Amazon Fire TV. I have it set to 1080 mode and am watching it on a 1080 LCD 40\" TV even as I write this review.(But I wish that when episode 9 of the TV series I'm watching finishes, the Fire TV would automatically start episode 10, butthis complaint is not enough to cut down my rating to 4 stars. 4.6 stars maybe, but that rounds to five stars.I have had the unfortunate experience of watching movies and TV shows on DVD in prison.Members of the \"Inmate Association\" (called different things in different units) would make a list of movies for the entireweekend, complete with times they thought each movie would start, but oftentimes, they just listed a bunch of starting timesthat were two hours apart, even though some of the movies were three hours long.But even if the schedule were correct, the guards would mess up the schedule by forgetting to put the next DVD into theplayer when the prior one ended, leaving sometimes an hour of dead time until someone could convince a lieutenant to go downand put the next DVD into the machine. Or they would find out a DVD has bad spots, or some other problem would occur. Theprinted schedules on the bulletin board were only worth the value of the paper they were printed on.With some improvements, this device (or a similar device that implements my suggestions) could become something that \"InmateCouncils\" could purchase and use to control an entire weekend schedule of movies.Actually, some of these ideas would be valuable to normal people. Parents could program the Fire TV for an evening oftelevision programs before the babysitter arrives, and know that the TV would be more likely to be turned off at the righttime.. (Especially if Amazon allowed the inclusion of a \"good night\" message to be the final selection on the \"schedule\".HOW TO SELL THIS TO CAPTIVE AUDIENCESPlease add NEW MODES to the Fire TV which could solve the problems faced at many prisons around the country.SCHEDULE MODE(This could be a program on the computer that could be uploaded to the Amazon Cloud and to the Fire TV after it is approvedby the \"management.\" Though I'm sure it could also be done on the device.)Here's how such a Schedule Program could work:---- Start the Schedule for the Day ----1. Click on the DAY that the schedule you are working on will start. (We don't need to specify the date because the finalschedule will be a maximum of seven days long, and each schedule a user creates could be uploaded to Amazon so that othergroups could use it, and you might want to re-use the schedule another weekend.)2. Click on the STARTING TIME for the first movie. (We don't need to specify a time zone. This way, any group can use thesame schedule in their time zone and not have to adjust the times.)---- Add Movies, TV Shows, etc. to the Schedule ----3. Click the ADD MOVIE TO SCHEDULE button.4. Select movie, TV show, preview or other event. (NOTE all Schedule Mode movies must be Prime Eligible in order for acorrectional system to allow the use of this device. In any case, there are MANY movies to choose from.) (If the item pickedhas multiple episodes, allow user to specify \"from\" and \"to\" episode numbers.)5. Keep repeating steps 3 and 4 until the schedule is as full as desired.---- Editing and other Daily Functions ----6. Click the VIEW SCHEDULE button to see the entire schedule for the day, including starting times7. Click the EDIT SCHEDULE button to insert an item before another item, delete an item, etc.8. You could even add a function that would insert previews of a few upcoming movies when that would let the next movie startat a desired time, like changing a start time from 3:55 to 4:00.---- Weekend Functions ----REPEAT the entire DAILY process for every day in the weekend scheduleUse PRINT MODE to print a schedule that includes all item titles, starting times, and optional short descriptions, for everyday in the weekend. This could then be printed and posted on various barracks bulletin boards.Use UPLOAD MODE to upload schedule to Amazon's Cloud so that the Amazon TV can download it and so that other people canborrow and use the same schedule, if allowed by the author.---- SPECIAL FUNCTIONS ----THEMES: Users might enjoy creating themed lists of movies for Holidays and other special occasions.RANDOM: Once a user puts in some movies and other events, a RANDOM option could fill in the rest of the schedule with randommovies on certain themes.---- CONCLUSION ----With all these features, you could sell this to prisons (and other groups who schedule movies to be watched by groups) allover the country. You could even give those groups the ability to pay their licensing fee (or whatever its called) thatallows them to play movies all year long based on the number of people who typically watch the weekend movies. (How does thisget licenses? By the number of seats at the movie televisions, or by the population, most of whom don't watch the movies?)If you pull this off, I hope you'll track me down and reward me for my ideas.", "verified": false, "helpfulness": "0/2", "author": "WilliamsSon"}, {"rating": 5.0, "review": "Great addition to other Amazon products.  Easy to install and easier to use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I purchased the Fire TV with Amazon ' s no interest payments offer. I figured it was the best time to try it. I use the Fire TV in my bedroom as a replacement for my bluray player's streaming feature.Speed/ Ease of UseIt is fast and easy to use and setup. Plug it in, add the HDMI cable, and you're ready to go. The Fire TV is always on; it goes to sleep after 30 minutes, but comes back up in seconds when you press a button on the remote. The system navigation is fast and smooth; everything loads quickly. The buttons are easy to understand and use for navigation.QualityThe device itself is simple but seems to be well made. The apps available work quite well - I primarily use it for Netflix, and my quality of streaming as well as loading / buffering times and connection have all improved over the blu - ray player I was using before for the service. I've also tried a few of the music and game apps, and all seem to run well. The remote is also very nice, of good quality, and looks like it will hold up well with a lot of use.Voice recognitionThe Amazon voice recognition service works flawlessly.  It has always been able to understand me (though I make sure to speak clearly). The only downside is that it doesn't currently integrate with everything, only Amazon-related software; also, the voice software won't work inside any other apps. If you want to see if Netflix has something Amazon doesn't,  you have to search the app separately,  and you have to type.  It is, however,  a very well done feature, as well as useful,  and perhaps Amazon will be able to expand it in the future.ApplicationsAmazon seems to have a pretty good variety of apps for a new device. It doesn't have everything - I believe HBO Go is not currently supported, for example - but I expect that will change as always as Amazon continues to update the device.I am very happy with my purchase and would make the Fire TV my first choice for another streaming device when needed. It is a well designed, well made product with great value for  a relatively low cost.Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "N. Ryker \"Vythonvex\""}, {"rating": 5.0, "review": "(Check out, Verified Purchase.  If you don't see that, then just ignore the review.)I have 3 ROKU's and one of them just died, which is why I bought the Amazon box.  I should note right off that the ROKU warranty is 90 days and the Amazon warranty is 1 YEAR.  (I found this out after my newest ROKU  inexplicitly died after only 6 months!)Anyway, I have a intimate knowledge of ROKU's and was delighted with them until I got the Amazon Box.  I have a whole different perspective now, and let me tell you that the Fire TV is far superior to any ROKU in terms of performance.  It is WAY faster.  It is totally refreshing to use something so fast.  It seems everything hooked to a TV these days is sooo slow to load; I had gotten used to it.  If I had the money I would upgrade all my TV's to the Amazon box for this reason alone.", "verified": true, "helpfulness": "0/0", "author": "Clark Griswold \"Clark\""}, {"rating": 5.0, "review": "My Roku 3 image quality was failing after 3 weeks so i sent back to Amazon and purchased an Fire TV. Sorry Roku 3 but Amazon wins with the FIRE TV and here are my reasons. Fire TV one year Warranty. Flawless voice search works every time (also has manual search). Beautiful playback of movies (Videos). Very fast. Great storage. The fire TV does go to sleep when inactive.  I plugged in my wireless controller for my mouse on the USB port of the fire TV (thought i give it a shot) and it works perfect (so does the keyboard). Android base so i added XBMC and now I have thousands of links to TV + MOVIES and streaming some live TV. XBMC runs on fire TV WITHOUT any computer running. The fire TV does go to sleep when inactive.  Remote is a perfect size and works without any issues. Yes there is no direct app for just Prime members but give Amazon a chance. You know that this WILL happen. The possibilities are endless with the fire TV, If the people (with the negative feed back) who have had issues with Netflix or YouTube not working on  fire TV this can happen with any device give it a rest. A few times this has happened to me and all was well within 10 minutes. Like this never happens with cable or satellite TV or your internet provider. Yes i did cut the cable and am saving $90.00 a month. Amazon do not rush out with a billion apps. Take your time and and do it right. (Prime app first please) Folks this is a great product that works just as intended or better with unlimited possibility for future updates. Highly recommend Amazon fire TV.", "verified": true, "helpfulness": "1/1", "author": "Anthony"}, {"rating": 5.0, "review": "It works great have no problem with it picking up my speech. Everyhting I have said into the remote has come up on screen right on the button.", "verified": true, "helpfulness": "0/0", "author": "Ron \"Cigarwin\""}, {"rating": 5.0, "review": "It works great, never had a issue with it. Just needs to get a NFL app", "verified": true, "helpfulness": "0/0", "author": "Bear"}]