[{"rating": 5.0, "review": "Very convenient and extremely easy to set up.  Can stream from Netflix or any website. Also was easy to stream from my Android phone. Reasonable on price and found worth the money.", "verified": true, "helpfulness": "0/0", "author": "Brenda L Valentin"}, {"rating": 5.0, "review": "Big fan of Chromecast. I have 2 of them. works well with Chrome browser casting and also with some third party apps, including NFL Gamepass finally! Great price.", "verified": true, "helpfulness": "0/0", "author": "Glen"}, {"rating": 5.0, "review": "arrived without any problem , it is perfect", "verified": true, "helpfulness": "0/0", "author": "Mario Villalba"}, {"rating": 4.0, "review": "I have one this at home, Great speed of responding, multiple ways to use at home or work. Has good price for small devise", "verified": false, "helpfulness": "0/0", "author": "Mary Mussolini"}, {"rating": 5.0, "review": "all I can say is goodbye cable!", "verified": false, "helpfulness": "0/0", "author": "Brad"}, {"rating": 3.0, "review": "only works half of the time", "verified": true, "helpfulness": "0/0", "author": "K7HFO"}, {"rating": 3.0, "review": "Well, I'll be really honest.The product is usefull and promising. However, in my case, the Chromecast App installed on my Galaxy Tab 3 with Android Kitkat is a Beta Version, so, i'ts not able to do what it's meant to.Whenever I press Cast Screen it trys to proceed but the process finishes inmediatly. As I said, it's a BETA version so maybe, maybe in a nearly future it'll do what it should.Because of that, I had to try many different third party applications, with their advantages and disadvantages, with advertisements, etc. I found 2 or 3 that I found usefull for my needs.In my case, Im a teacher and I wanted to use Chromecast in my classes to give them a better looking and a more interactive environment. However, because of the limitations of those third party applications, I couldn't say I'll be able to fully achive what I wanted.I give to the product 3 stars not because of its quality but because of the lack of a software that can fully take advantage of its potential.", "verified": true, "helpfulness": "0/0", "author": "Carlos A. Crisón G."}, {"rating": 5.0, "review": "loved it but my internet sucks so its hit or miss", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "Love it , everything I expected and more", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 4.0, "review": "It plugged in and gave me, a non computerized person, a few missteps but it all installed easily. I was watching different videos from the net fairly quickly.  I can recommend this adapter to anyone that wants to enlarge their options.", "verified": true, "helpfulness": "0/0", "author": "John Spradlin"}]