[{"rating": 5.0, "review": "Perfect. Exactly what I needed. You just need a high speed internet connection and you`re Ok.", "verified": true, "helpfulness": "0/0", "author": "Zoumana Kamagate"}, {"rating": 5.0, "review": "The best thing since sliced cheese", "verified": true, "helpfulness": "0/0", "author": "todd"}, {"rating": 4.0, "review": "Terrific gadget.  It should be noted, however, that the device requires a power source... so there's a cord that runs from the 'stick' to an outlet.  ... which makes it a little less convenient than the picture might indicate.  Still, it's reception is great, with apps for Netflix, Amazon, Hulu, and more.Since no remote comes with the device it is necessary to control it via a smartphone or ipad... which could be a minus for some users.  However, good news is that's one less remote to worry about misplacing!", "verified": true, "helpfulness": "1/1", "author": "M. R. Stein"}, {"rating": 5.0, "review": "ENJOY THE MANY SHOWS", "verified": true, "helpfulness": "0/0", "author": "James D. Harris"}, {"rating": 1.0, "review": "Good to very good to stream hulu, netflix, youtube....Device won't work with Amazon Prime or DVDs.I was supposed to receive a $6 google play credit, but this did not materialize and no way to contact google about this.  Google rocks though generally.", "verified": true, "helpfulness": "1/4", "author": "J Ellis"}, {"rating": 5.0, "review": "AAA+++", "verified": true, "helpfulness": "0/1", "author": "Henry Porraz"}, {"rating": 5.0, "review": "Works like a charm!", "verified": true, "helpfulness": "0/1", "author": "Foxy"}, {"rating": 5.0, "review": "Amazing just amazing!!", "verified": true, "helpfulness": "0/1", "author": "Austin Vine"}, {"rating": 5.0, "review": "i like this alot but i didnt know it only works on certain apps that you install on your phone so yeah it was kinda waist of money on my end but it works and easy set up so read before you buy this lol  but its still a good product", "verified": false, "helpfulness": "0/0", "author": "ki"}, {"rating": 5.0, "review": "Good for what it is. I use it to play podcasts from Pocketcasts on my android device to my TV. Streams smoothly.Haven't founf any music apps that will cast to my TV. I use Jetaudio for music.", "verified": true, "helpfulness": "0/0", "author": "V. Maharaj"}]