[{"rating": 3.0, "review": "works well, but only for certain apps and programs", "verified": true, "helpfulness": "0/0", "author": "Paul P"}, {"rating": 5.0, "review": "Amazing. It can replace cable TV. We watch 1970's TV", "verified": true, "helpfulness": "0/0", "author": "jus \"Justinr11\""}, {"rating": 5.0, "review": "Fantastic little gem.  I've used it successfully in hotels in the U.S. and abroad.  When there's nothing on TV in English you can plug the Chromecast in and catch up on news, watch movies, etc.  Nothing like it for the price.", "verified": true, "helpfulness": "0/0", "author": "bruce112157"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Don"}, {"rating": 5.0, "review": "Glad I bought this early. Brings alot of good content to your TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "don't think you're getting an android dongle!  a lot of ppl think that.  think in terms of a spiritual medium conveying content from another entity.  i know that's a bit odd, but that's really what's happening here.", "verified": true, "helpfulness": "0/0", "author": "skipmeißter \"skip davis\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "sherree"}, {"rating": 5.0, "review": "now with new beta update mirrors my win 8.1 computer to my big screen tv replaces running hdmi cable from computer to tv", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "I like it. It does what I wanted it to do.", "verified": true, "helpfulness": "0/0", "author": "rudy wilkinson"}, {"rating": 4.0, "review": "one month in and it's been great. a bit disappointed at the lack of support (no phone support, only user forums) but they've been super helpful.If you own an older router (especially an Apple timecapsule) you're going to be in for some major configuration changes but it actually started working and now it's been fantastic and it play almost equally as well with Android, Mac and iOSI will be following up on this review and adding as I go...stay tuned mwahahah", "verified": true, "helpfulness": "0/0", "author": "BWolfeJR"}]