[{"rating": 4.0, "review": "Great, I replaced my apple tv2 with it, much faster", "verified": true, "helpfulness": "0/0", "author": "Harrison Cantrell"}, {"rating": 5.0, "review": "Love it...bought a new smart tv over the holidays that was supposed to do essentially the same thing. However. You have to have your wireless modem no more that five feet away from the tv go get a signal. Be careful if you are looking at vizio wi fi tv's.the fire tv has no problems even being two rooms away. Has lots of great apps as well. More than came with the tv in the first place.downside......it makes it really easy to spend money..get prime and save yourself hundreds on rental and shipping..plus.....its portable. Internet signal and your good to go.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 4.0, "review": "Excellent piece of equipment.", "verified": false, "helpfulness": "0/0", "author": "Dcrits"}, {"rating": 5.0, "review": "This by far was my best Holiday purchase.  I want to buy one for the bedroom also.", "verified": true, "helpfulness": "0/0", "author": "Woof586"}, {"rating": 5.0, "review": "Was over the top in what I expected ! Am learning more and more what it all entails....love it!!", "verified": true, "helpfulness": "0/0", "author": "Cheryl Groshelle"}, {"rating": 1.0, "review": "The box did not work, there was no audio/sound and the screen flashes continuously. I completed registration and the initial software update but that didn't help.", "verified": true, "helpfulness": "1/2", "author": "S. Biradar \"SB\""}, {"rating": 5.0, "review": "all I needed was the fire tv so I can watch movies from my watchlist on my kindle", "verified": true, "helpfulness": "0/0", "author": "MA Schreck"}, {"rating": 5.0, "review": "This is great for watching what we want at the the times we want to watch it.", "verified": true, "helpfulness": "0/0", "author": "josie"}, {"rating": 3.0, "review": "Works well, some of the netfick movies will hangup;ie, go into fast forward by themselves or start to buffer every 20 secs. So far,all the amazon products have worked very well. I bought two of these, one as a gift for my parents. Somehow the fire box given as a gift was tied to my account and I was billed for products my parents bought. Amazon straightened it out for us. Good thing I didn't gift 20 of these things.", "verified": true, "helpfulness": "0/0", "author": "amazon shopper"}, {"rating": 3.0, "review": "It only work so/so in my house. Buffers a lot ..... It's a good value but I have to say My Mom's Roku stick seems to work better. Also the remote is so tiny it honestly gets lost every day . I did like the packaging and the ease of set up.", "verified": true, "helpfulness": "0/0", "author": "pamela"}]