[{"rating": 2.0, "review": "Beware! The voice search only searches amazon offerings.  Netflix you have to search with text entry.  Many movies and shows are free if you have a Netflix account, but the voice search will only return Amazon offerings you may have to pay for.  It is setup to lead you into paying for shows you may already get through other subscriptions.  This is a Trojan Horse to get you to buy more stuff from Amazon.  Not as advertised!", "verified": false, "helpfulness": "2/8", "author": "Otteraz"}, {"rating": 1.0, "review": "I was excited to get this, and when I first plugged it in I really enjoyed the ease of setting it up and the quality of sound and picture. The next time I used it the unit froze, turned off, and no matter what I did, will not turn back on. I have tried unplugging it and plugging it back in, and searching around online, but there doesn't seem to be any ideas on how to fix this. Oh well, I tried to 'chat' with Amazon support but I got someone who didn't even ask a question, but just hit buttons to display preprogrammed responses. So, I got responses to things I hadn't asked. Quality...so...don't buy. You won't get any support if you do and something goes wrong. The same thing happened to me with a Kindle Fire, and needless to say, after the second one broke for no reason, I didn't get a third. Needless to say I was an idiot for trusting that maybe they had made some improvements to their hardware, but sadly I shouldn't have bought one of these. Don't waste your time or money with this product.", "verified": true, "helpfulness": "12/27", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I gave this product 1 star because you had to at least give one star to leave a rating. I purchased this unit along with two game controls, I am highly disappointed!!! About 90% of everything I tried to view you have to pay for, even if you're a member of Amazon Prime. I don't really see what the benefits of Amazon Prime are if you still have to pay for a majority of the movies. I also tried playing some of the free games, good luck!!! The one game that I found was free let me play the first level for free, if I want to advance to the next level I needed to pay a fee. My best advice to anyone considering purchasing the Amazon Fire TV unpackage it very careful so you can repackage it and request a refund. Stick with Netflix, at least you don't have to pay for each movie...one monthly fee and you can enjoy unlimited access to all movies on Netflix.", "verified": true, "helpfulness": "11/36", "author": "Willis Taylor"}, {"rating": 5.0, "review": "I was surprised at the small size, but it works seamlessly. Set up was soon easy. I am very pleased as well as everyone in our home. Voice select is a nice extra. Just so glad I purchased! I would recommend and have. Keep up the good work Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I don't even work for Amazon, I'm a drafter for an oil and gas company and I've been pushing this product on my co-workers. Some are eager to hear about the gaming. I'm currently waiting on my two controllers to be shipped. I love my Amazon Fire, IT'S GREAT AND I HIGHLY RECOMMEND THIS PRODUCT!!! 👍👽👍", "verified": true, "helpfulness": "1/1", "author": "Lop3z"}, {"rating": 1.0, "review": "From the moment I saw this unit I was so excited, I could not wait to order it. When UPS knocked on the door, I was as giddy as a school girl. I tore open the box and saw that the unit was so small that it could be placed anywhere. I hooked it up immediately. The process was fast and easy. The setup went without any problem at all. I went to my favorite Netflix show, House of Cards, and noticed immediately that there was a problem. The picture was soft and even blurry. I quickly changed out all of my HDMI cables and ran a direct line for my DSL connection. When I saw that the picture was still sub-par, I almost cried,I switched out cable cable after cable, in hopes of an improved picture to no avail. Everything about this unit was perfect from esthetics to ease of installation, but when it came to the important part, the picture quality, no matter what I did, it could not be improved. I currently watch Netflix on a 3 year old LG Blu-Ray Player. The Fire TV could not come close to matching the picture quality. I can not emphasize enough how disappointed I am. I have been a customer of Amazon for 15 years and I love the company. But someone needs to take a second at the their Beta testers for this device. I truly expected more from this device based on the advertising.", "verified": true, "helpfulness": "21/33", "author": "WILLIAM R EDWARDS"}, {"rating": 5.0, "review": "Amazon FIRE TV knocked it out of the PARK!! Great device, sleek packaging, sleek device.  No time to install.  Voice command ACTUALLY WORKS ....LOVE IT", "verified": true, "helpfulness": "1/1", "author": "TXshopper"}, {"rating": 5.0, "review": "Just to set this up, let me first say that while I’m no Luddite, I’m no early adopter, either. I kicked cable to the curb a couple years ago, and have been streaming from my Blu-ray player with sometimes sketchy results. Also, I’ve had it all of four days, so I just have four days of experience with it (does it emit poison gas after a week? We’ll see).That said, Fire TV rocks.I like that it’s small and can be out of sight. I like that it took me longer to get it out of the packaging (maybe two minutes since it was cool packaging and I was enjoying it) than it took to set up (maybe a minute at most). I love the sleek remote. I like that I turned it on, and after a little updating and a tutorial, it just worked. This is the promise of streaming: what you want when you want it, with no hassle. Easy to set up, easy to use, great quality, little or no buffering. Bam. Pick a show and it plays. That’s what we want, right?Yes, it prefers Amazon Prime. If you don’t have it, you might want to consider iTV or Ruku, but I can’t help you there since I wouldn’t know either I tripped on it. On the other hand, if you don’t have Amazon Prime, you might want to look at why not (I bought a lawn mower—free 2-day shipping, but I digress). However, I think it’s not so much that it handicaps Netflix or Hulu or whatever—those are right there, ready to play—it just makes Amazon Prime even easier than that.Any downside? Well, I had to use optical cable to hook it up to my old stereo receiver, but big deal If that’s something you want to do, make sure you can do that with your equipment and that you have an optical cable lying around or, if not, buy one (mine was five bucks). You might want to read more thoroughly than I did, and notice that as of April 2014 the Amazon Cloud Player app isn’t ready yet.Whatever. I say fire your cable and welcome to easier, better, cheaper.", "verified": true, "helpfulness": "2/2", "author": "William Burleson"}, {"rating": 4.0, "review": "I have tried several of these streaming devices and found this one much easier to set up than the others. I also appreciated being able to simply say what I wanted and have it appear.My only problem with it is that so far there seems to be a charge for everything I have inquired about. I am wondering whether there is any free content available for this service or whether I am going to be running up a bill for every movie, TV show, etc. I watch.", "verified": true, "helpfulness": "0/0", "author": "Ann Strosnider"}, {"rating": 5.0, "review": "I'm an Amazon prime member and have the Kindle fire HDX. Let's say I'm a fan of Amazon. I got the fire tv because I thought it be nice to see prime movies on the t.v.set. I got the fire tv and it was so simple to set up. I have nothing to compare fire tv. I know there's Roku and Apple tv but I have no idea about those. All I know is that this is great, I can see YouTube and Netflix and it looks great. I ordered the game controller so that should be fun. I'm very satisfied with this purchase.", "verified": true, "helpfulness": "1/1", "author": "Kindle Customer"}]