[{"rating": 3.0, "review": "Somewhat disappointed with limited apps and no hbogo. Otherwise works very well. Also amazon music needs much better selection.", "verified": true, "helpfulness": "1/4", "author": "danny aguiar"}, {"rating": 5.0, "review": "The Amazon Fire TV was great tight out of the box. The directions were simple and everything set up the 1st time without a glitch.  We immediately started watching ESPN3 and favorite music videos.  It  is very simple to use and we think we are going to enjoy it for many years.", "verified": true, "helpfulness": "1/1", "author": "Jacqueline Scavo"}, {"rating": 5.0, "review": "Love it!  It's easy to use and so easy in fact that all  you have to do is talk to it.  Tell it what you want to watch and there you go.  I will say my son set it up for me and showed me how to use it but there's just a few steps and you're there.  I bought it on sale for $69 and for the first time I'm actually thinking of giving up regular cable.  It's really a good bargain at that price.  I'm a fan of Amazon and they keep rockin' it.", "verified": true, "helpfulness": "0/0", "author": "Steve B"}, {"rating": 5.0, "review": "Terrific device. I have both the Fire TV and Fire TV Stick. The former is worth the extra $40 now that it's only $79. The interface is much smoother. Much smoother. It's not even comparable. On the Stick, there's often significant lag switching between menus. Apps take longer to open. Video is slightly choppier than on the Fire TV.Great value, especially with a Prime subscription!", "verified": true, "helpfulness": "1/1", "author": "Ahia Boy"}, {"rating": 5.0, "review": "Great Product!", "verified": true, "helpfulness": "0/2", "author": "Skip Adams \"ezrdr\""}, {"rating": 1.0, "review": "It is a let down. Anything worth watching needs to be purchased. No music available that I could find. Maybe Amazon can try again or give a free software upgrade. So much for Prime perks.", "verified": true, "helpfulness": "3/12", "author": "ERS"}, {"rating": 5.0, "review": "Nice and easy to use", "verified": true, "helpfulness": "0/2", "author": "expatjohn"}, {"rating": 5.0, "review": "After comparing all the competition I picked the Fire TV, glad I did. It's everything said and awesome.", "verified": true, "helpfulness": "0/0", "author": "Joseph M."}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/2", "author": "liz"}, {"rating": 5.0, "review": "This is awesome! Got it for my wife for Xmas and she is a huge streaming snob. She loves it. Works better than Netflix alone and since we are already Amazon Prime members we get a bunch of free shows/movies without any additional cost.This really makes coming off cable so much easier!", "verified": true, "helpfulness": "0/0", "author": "PK118"}]