[{"rating": 4.0, "review": "excellent for people who don't want to pay for dishor cable tv very well worth the price", "verified": true, "helpfulness": "0/2", "author": "Kathleen Thomas"}, {"rating": 1.0, "review": "Lists services that are an extra charge.  Deceptive advertising!", "verified": true, "helpfulness": "2/9", "author": "Marcia Ford"}, {"rating": 5.0, "review": "Pros1. The speed is fast2. The remote is wonderful3. Lots of channelsCons1. Voice search does not work sometimes", "verified": false, "helpfulness": "0/0", "author": "Shan Liang"}, {"rating": 3.0, "review": "Ruku is still better. The user experience is poor. Voice search is cool but everything else is poor and unorganized. Picture quality is same as Ruku and chromecast. Netflix and Hulu plus does not work in my box. So, I am calling the tech support. Not worth the price unless you play games.", "verified": true, "helpfulness": "0/0", "author": "T. Saha \"smartbengali\""}, {"rating": 5.0, "review": "I have a roku 3 and I have a Fire TV. The Fire TV is much better as far a processing power is concerned. There are a lot more useful apps on roku. I like the remote on the roku better, too. This device hasn't frozen yet though. My roku has to be re-booted pretty often. The Fire TV also shuts off after 45 minutes inactivity, the roku stays on all the time unless you unplug the thing. So there are pros and cons to either.", "verified": true, "helpfulness": "3/3", "author": "Good Merican"}, {"rating": 5.0, "review": "It's awesome!!!", "verified": true, "helpfulness": "0/2", "author": "Diana Ruiz"}, {"rating": 1.0, "review": "So disappointing. I bought this as I travel for work every week. This small device would be great to throw in the suitcase and watch streaming media in the hotel. However, Amazon, in their infinite wisdom, failed to include a browser, even a limited one that would allow you to connect to a public hotspot and authenticate/accept T&C;'s. This is an epic fail for a device that is supposed to change the industry. I will now be getting a Roku as it does support this simple requirement.", "verified": true, "helpfulness": "7/13", "author": "Chaz Spahn"}, {"rating": 1.0, "review": "Purchased this with great anticipation. Unfortunately it would not connect to its own home screen. Tech support was not particularly helpful, I returned it and got my money back. To be fair, though I was not satisfied with the product, I was very satisfied with my treatment by Amazon. In all the years I have been shopping with Amazon, this is only the second item I have ever needed to return. Great company, but this product did not work for me.", "verified": true, "helpfulness": "6/8", "author": "Philip F."}, {"rating": 1.0, "review": "I will upgrade to 5 stars when HBOGO is available.", "verified": false, "helpfulness": "2/14", "author": "sven-o"}, {"rating": 5.0, "review": "Money well spent. Had some issues with set up initially but was quickly resolved", "verified": true, "helpfulness": "0/3", "author": "Ronald \"Retired\""}]