[{"rating": 5.0, "review": "My husband and I are obsessed with this thing!!  We have one for each tv in the house.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "These things changed our lives.  Cut the cable, save money.", "verified": true, "helpfulness": "0/0", "author": "J. Sussex"}, {"rating": 5.0, "review": "Cause awesome", "verified": true, "helpfulness": "0/0", "author": "ben"}, {"rating": 5.0, "review": "Simply put, it's awesome. Can cast a screen from nearly every device I have (Samsung Galaxy S4 phones, Chromecast, any laptop/computer using Chrome for web browser, wife's iPad, cheap Android tablet I bought for a Black Friday deal) it's just super convenient. Haven't ever had a problem with it, though there are times when it seems like it might get hung up and have to reconnect. This could just as likely be an issue with my internet and it doesn't occur frequently or long enough to ever be an issue. They're so cheap, if I had more televisions or traveled more I would purchase more just to travel with me or for every unit I had.", "verified": true, "helpfulness": "1/1", "author": "T. Page"}, {"rating": 3.0, "review": "Too choppy video to stream in HD. Had to reduce vid quality to pay smoothly. I ended up just going back to the HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Google Chromecast is the best thing since they created HDMI cords. I love being able to cast my laptop's screen to the TV. I can surf the web, watch Netflix, or even play Spotify through my TV without the hassle of annoying cables. It simplifies the streaming and casting process to someone anyone can do.Then there are the extra apps you can get for the Chromecast. You can literally play Cards Against Humanity with all your friends on everyones smartphones anywhere in your house. It's amazing! If you have Netflix, HBOGo, or any other of the tons of streaming sites, this device is perfect for you.", "verified": true, "helpfulness": "0/0", "author": "Zach"}, {"rating": 5.0, "review": "We liked ours so much, we bought more to give as gifts.  Great little invention, and a must have for long MN winters.  Works with a simple plug and play on any TV in the house.", "verified": true, "helpfulness": "0/0", "author": "DMB95"}, {"rating": 2.0, "review": "I bought this originally to use with some basic apps such as Netflix.  It does work to do that, but the streaming quality is terribly, it barely picks up my wifi signal despite being 10 feet away, and you need another device to be able to use it.  My advice, go buy an Amazon Fire TV Stick.  I recently did this and it works way better, has way more to offer, has built in apps, and is only $5 more.", "verified": false, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "this is a great item", "verified": true, "helpfulness": "0/0", "author": "Priscilla"}, {"rating": 5.0, "review": "I bough it directly from amazon and it was delivered pretty quickly, It's very useful if you don't have a smart tv because it basically turns your normal tv with hdmi into a smart tv, or even if you already have a smart tv it's useful, you can look for videos on web pages and most now support to send the video directly to the chrome cast, and I don't mean only web pages like youtube, I mean third party ones that doesn't even have apps for smart tv,I never had any problem with it and I love it.On a side note, it draws power from the USB connector on the tv, but if it doesn't have one it comes with a wall plug, also remember to use the hdmi extension since it acts as an antenna for the WiFi and have better signal", "verified": true, "helpfulness": "0/0", "author": "Alfredo De la rosa"}]