[{"rating": 5.0, "review": "Awesome!  Love the small size.  But the best is the voice activation; it makes navigating ridiculously easy.", "verified": true, "helpfulness": "0/0", "author": "PersnicketyPT"}, {"rating": 5.0, "review": "Love love love", "verified": true, "helpfulness": "0/0", "author": "Trishia Crane \"t dean\""}, {"rating": 1.0, "review": "Not buying prime TV until they make it easier to find the free shows and movies.  I already have Amazon Prime on my kindle Fire and I agree with the reviews that I just read that sometimes you just want to search for what is available.  If I am interested in an item,I will be happy to pay for it.  However, many nights I am just looking for something to watch and not interested in anything special.", "verified": false, "helpfulness": "3/6", "author": "Irene"}, {"rating": 5.0, "review": "This is great.  The only thing that would make it better is if it worked with Comcast Xfinity.", "verified": true, "helpfulness": "0/0", "author": "B. H. Levey"}, {"rating": 3.0, "review": "We have nothing against Amazon Fire - we just think that all of the streaming platforms don't offer compelling enough content for our liking but we are probably too picky.  The cost is reasonable (especially when you factor in the free 2-day shipping you get with Prime) but we felt we would have ended up having to pay extra for the actual programming we would prefer to watch.", "verified": true, "helpfulness": "0/0", "author": "Alan D. Godin \"Bigalgae\""}, {"rating": 5.0, "review": "Purchased this in hopes it would have a stronger signal to stream netflix and other movie apps.  Our bluray player just wasn't doing it!  Our wireless router is rather far off in the house. The fire tv has good reception, does not need to buffer like the bluray did and has not given us any problems. It is super easy to use. There are so many apps available you can always find something different to watch.  We did take a 30 day trial of prime but didn't keep it.  Glad we tried this fire tv device, it works nicely!", "verified": true, "helpfulness": "0/0", "author": "Jennifer M. \"Pre-K Teacher\""}, {"rating": 5.0, "review": "My wife and I took back our Verizon over priced boxes and bought the Amazon Fire TV.  It is a great viewing experience so we've never looked back and certainly don't miss Verizon TV or the high bills.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Gene\""}, {"rating": 5.0, "review": "Great movies and shows along with lots of fun games", "verified": true, "helpfulness": "0/0", "author": "Robert Bruington"}, {"rating": 5.0, "review": "Its a complete package of entertainment for all ages. I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Eleanor ONeill"}, {"rating": 4.0, "review": "very good product and navigation is good", "verified": true, "helpfulness": "0/0", "author": "maz"}]