[{"rating": 5.0, "review": "Works great. Needs more ability to sling from ipad. Works better with android. Streem is good. Nice if had a port for ethernet", "verified": true, "helpfulness": "0/0", "author": "tim"}, {"rating": 5.0, "review": "Bought for a gift. My friend loves it. It works great, less than half price of an Apple TV. No glitches nor any issue", "verified": true, "helpfulness": "0/0", "author": "Quentin"}, {"rating": 5.0, "review": "Best thing since sliced bread! And only $35? Can't beat that. Will be buying all my friends and family one for Christmas!", "verified": true, "helpfulness": "0/0", "author": "Trixie"}, {"rating": 5.0, "review": "This is another great step towards fighting off a cable tv bill as a starving college student.  I can stream the content I want from my favorite services.", "verified": true, "helpfulness": "0/0", "author": "Rocky Road"}, {"rating": 1.0, "review": "This device will not work with the HBO GO app, although the company/manufacturer is selling at as compatible with that service.We streamed 45 minutes of True Detective, an HBO original series, before it started buffering constantly.At this time we can watch 3 seconds of any HBO GO series on the app, before somewhere between 30 and 60 seconds of buffering begins. We are then allowed another 3 seconds of video, before the cycle continues. Our Internet streaming is fine and other content will stream fine. I am leaving a poor review in hopes that the company will fix the issue with the HBO GO app, or stop selling it as compatible with that service. I have tested the app on iPhone 4S, iPhone 5, and iPad air, all running iOS 7.", "verified": true, "helpfulness": "1/1", "author": "matt delaney"}, {"rating": 4.0, "review": "I have a few different streaming devices (roku 3, atv2) and I wanted to give this a shot since I have an android phone now.  I think it's pretty cool, but it needs some more support.  Hopefully that will be coming soon since they released the SDK for it.  For the price its tough to beat as long as you have a device that can cast to it.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 3.0, "review": "Make sure your wireless router is compatible and you have patience with each time you start it, sometimes it works on the 1st attempt sometimes it takes several. Still some bugs that need to get worked out but other than what I mentioned it works great!", "verified": true, "helpfulness": "0/0", "author": "Danny Prine"}, {"rating": 4.0, "review": "I absolutely love this.  As soon as I got used to it and got a Netflix streaming account, I immediately bought a second Chromecast for our bedroom TV.  In my opinion this sort of thing is the wave of the future.  For $35 and a $9/mo subscription to Netflix, you open up a whole new world of TV watching.  I find now that I end every night watching something streaming on Chromecast.I would easily give this 5 Stars if you could stream local media from your Tablet.  I imagine they'll get there eventually, but for now it seems a bit odd to me.  One of the first things my wife tried to do was play a video of our granddaughter that she had in email.  I had to tell her that didn't work yet.  Not sure whose problem it is, the tablet makers, or Googles, but it really needs to be solved before you can realistically call these things 5 Star.", "verified": true, "helpfulness": "1/1", "author": "Del \"Rocket Scientist\" Ritchie"}, {"rating": 4.0, "review": "The Chromecast is very good for both UTube and Netflix.  However, if you have an I-Phone, it does not allow you to view other videos as the Google app cannot be modified to allow for play through an Apple device.  Somewhat disappointing.  The device set-up was easy; it took about 10 minutes tops.  Video quality is good with my UVerse router.", "verified": true, "helpfulness": "0/0", "author": "Robert Sanderson \"Bob\""}, {"rating": 1.0, "review": "Doesn't stream content from phone like Apple TV. Nothing special about it.  Would not recommend.  If they update and add where I can show on TV anything that's on my phone, then I am in.", "verified": true, "helpfulness": "0/0", "author": "Hugo"}]