[{"rating": 5.0, "review": "I am thoroughly enjoying my Amazon Fire TV.  Watching My Prime movies late into the night.I strongly advise any Prime member to buy the Amazon Fire TV  and enjoy watching the movies on a full TV screen.", "verified": true, "helpfulness": "1/2", "author": "Peter Creanza"}, {"rating": 4.0, "review": "We researched the best gadget to buy, Chrome, Rouku etc. Very happy with the Amazon Fire TV. It runs a lot of apps and the Voice to Command function even works with my British husbands accent. We really like that we can run XBMC, Hulu and Amazon Prime on this device. Haven't had any connection problems with my wifi either.", "verified": true, "helpfulness": "0/0", "author": "digiproducer"}, {"rating": 5.0, "review": "I love my fire tv it connects right to the tv and all you need is your router password well wrought buying", "verified": true, "helpfulness": "0/0", "author": "pennyhahn"}, {"rating": 2.0, "review": "I'm not real sure if I like this or not. I am a Prime member ($79.00 a year) and this cost $100.00 and I am still required to pay for Movies that have been showing on regular TV..Not sure if this is worth the cost. The movies that are Free to \"Prime\" members really aren't worth viewing..A larger movie selection needs to be added to make this worth while..", "verified": true, "helpfulness": "3/8", "author": "TB \"TB\""}, {"rating": 5.0, "review": "So far we are very pleased with amazon fire TV.  It works well and we use it with both Amazon prime and Netflix.  So far I haven't used it for games.  The sound seems to be much better than when we streamed netflix streamed to our smart TV in another state.", "verified": true, "helpfulness": "0/0", "author": "Helen Conner"}, {"rating": 5.0, "review": "Got this last week and can't stop raving about how awesome this little invention is.  It's interface is very similar to Plex, which organizes all of your personal media , so it was fairly easy for me to navigate.  The quality is excellent and I haven't had any glitches with the wifi connection and the Amazon Fire TV.  So far it's a great addition when you don't want to build a media center or have a computer to host Netflix, movies, etc...", "verified": true, "helpfulness": "0/0", "author": "hspadgett \"hfish77\""}, {"rating": 5.0, "review": "It is great to be able to watch movies and TV programs on more than one TV. The box is easy to move from one TV to the next!", "verified": true, "helpfulness": "0/1", "author": "Auntie Cee"}, {"rating": 5.0, "review": "I love the Amazon Fire TV, it has all my favorite TV shows and lots of great movies.The best thing about though, is that is really is to use. Thanks Amazon", "verified": true, "helpfulness": "0/1", "author": "Lavonne Haddad"}, {"rating": 4.0, "review": "The jury is still out, we are waiting for an Amazon upgrade to fix the no sound out on some HD Movies over HDMI, otherwise the voice works great most of the time, we where among the first to get this device, we hope Amazon will write some software that goes beyond the basic, dry, testy Android Interface and Apps, it is not cool, when using Apps, a little testy!", "verified": true, "helpfulness": "0/0", "author": "JEM(Jaden E Michiko) \"JEM\""}, {"rating": 4.0, "review": "Great device, super easy set up. Unit is very small and light weight.Voice search really works. Even with my southern accent.I can only give Amazon 4 stars on it til we get HBO GO.", "verified": true, "helpfulness": "0/1", "author": "L. Stamper"}]