[{"rating": 1.0, "review": "* Updated - dropping to 1 star *If you don't want to read this review, do yourself a favor and buy a Roku 3 instead and stop reading now. To me it seems like the product isn't quite finished yet (I guess that's what you get for being an early-adopter, though it's now many months after the release). The interface is poor - the voice seems to be a bit gimmicky, though it generally works. It doesn't seem to do the 'consolidated search' that it promises, where it will refer you to paid episodes of a TV series that are free through the Hulu application, or even sometimes via Prime (I see what you did there Amazon). It occasionally glitches running through my Bose sound system (which is a hub for my HDMI inputs), and generally seems to be more flakey than watching streaming video through either my Roku or Xbox One. If this will be your only device for streaming TV, then maybe you will like it - if it's not, I definitely don't think you will be impressed or even think it was a worthwhile purchase. I was hoping for more evolution through updates months after the product released (now many months), but it seems to be getting left on the shelves while they focus on the Fire Phone. I've now disconnected the device from my TV and replaced it with the Roku that I already owned. Incredibly disappointing.", "verified": true, "helpfulness": "15/16", "author": "slowly growing deaf \"slowly growing deaf\""}, {"rating": 5.0, "review": "Streaming is great.  Quality of the picture is very good. We are very happy.", "verified": true, "helpfulness": "0/0", "author": "Cari L. Tortes"}, {"rating": 5.0, "review": "Amazon Fire TV is amazing. A lot faster than apple TV. Movies and serious are a bit pricey so you will need to purchase Hulu plus or Netflix. Also remote is very small so we lose it a lot", "verified": true, "helpfulness": "0/1", "author": "Stephine"}, {"rating": 5.0, "review": "Love it.  The voice recognition function works perfectly and the searches are efficient and quick.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome... I now have a few gadgets hooked up to my HD TV and with a Prime subscription you can't beat this deal!", "verified": true, "helpfulness": "0/0", "author": "Michael Livingston"}, {"rating": 4.0, "review": "So far the Fire TV has lived up to its expectations. My goal was to have a single, go-to device for all our video entertainment needs. Before the FTV, my setup included a Mac Mini running Plex Home Theater and Media Server, and the built-in Netflix app provided by my Vizio TV. I had the remote for the TV to control power, and Netflix, the apple remote for the Mac Mini, which provided control for Plex home theater, and the receiver's remote for volume control.My setup with the FTV allowed me to add the Prime video to my options, as well as giving me a single device from which I can watch all my media. The Plex app was used to replace Plex home theater, the Netflix app replaces the TV's Netflix app, and the Prime video is just a bonus. I've found, surprisingly, that there's not as much overlap as I had anticipated in the streaming content provided by Amazon vs Netflix.The interface runs smoothly and is for the most part intuitive. I was sad to see that there is no option to restart or power off the device, or it was buried somewhere that I failed to check. I was also slightly disappointed that there wasn't a way to force a check for a software update. These are very, very minor issues, and could be things that the majority of the users do not care about.TL;DR:I know the Fire TV has faithfully fulfilled its role as the entertainment hub of the household because after receiving it my next month's data usage triggered a warning from our local cable internet provider. I had apparently gone over my soft data cap for the first time in 7 years.------------------------Update:Be careful with the factory reset option!I had a slight problem with my Fire TV. Admittedly, this was self-inflicted. I was having problems with the Music section not loading, so I attempted to reset the system to factory defaults. This cause some sort of unrecoverable corruption of the system settings, and I was no longer able to play video of any kind (Plex, Netflix or Prime). I called into support after trying my best, and they were also unable to resolve the issue. I was promptly sent a new unit, next-day air, which arrived as promised, on Saturday. I'm back up and streaming video again.I also found the option to check for OS updates. It's under Settings > System > About > Check for Update. Still haven't found a way to reboot the device without yanking the power cord.", "verified": true, "helpfulness": "1/1", "author": "Brandon Raabe \"Brandon\""}, {"rating": 5.0, "review": "If one is not a news or sports junkie, this option provides an excellent lower cost alternative to the monthly sky-high cost of cable or satellite TV. Be aware that this will not replace that service. It provides no access to the main broadcast outlets like ABC, NBC, CBS, or Fox, and it provides no live coverage of news or sports. However, this service provides more movie options than one could possibly access in a lifetime if one subscribes (pay for) to the provided services like Amazon Prime, Netflix, and Hulu. It will be the same as if you were to put a DVD into your player to watch. I've had Amazon Fire TV for about 2 months and I absolutely love it because it provides so many options! The only setup problem I had was that I have an old router provided by my Internet service provider many years ago which has only 1 ethernet outlet (needed for my computer.) It took me some time to find out how to resolve this problem (with a new router) so that I would not have to physically unplug the ethernet cable for my computer from the router to connect the Fire TV & vice versa.", "verified": true, "helpfulness": "0/0", "author": "Steven Janasik"}, {"rating": 5.0, "review": "I've been looking for an acceptable HTPC to entertain whoever sits in front of the TV while keeping these few things in mind:- small form factor- wireless interface- supports HD- fast processor- decent storage space- flexible and supports XBMC- ease of navigationThis was going to replacement my year old Raspberry PI that while I'm happy with, wish it had more faster processor.  Granted the RPI served me well.First impression, the device is solid hardware and software factors.  Small, yet packed with most of the features I was looking for as I mentioned in the beginning.  While the software interface was good, it can certainly use more tweaking for my liking.  So I ventured into rooting the device and sideloading XBMC.  There are places where you can get directions on how to root and replace the launcher to default to XBMC which is what I really want.  However, I can still launch the KFTV interface when I need to from the Android apps within XBMC.While it did took me almost two days of trial and error as I modify the files and interface into a more easier navigation, I'm happy with the results.  I was able to sideload applications using ADB which I then used to install Google Play Store.  Now, the device is almost a full blown android unit and I can install application from the market.  The only downside to all this is the lack of storage space, but I will be looking into expanding storage using an external SSD.So if you are like me who seeks a good HTPC, look no further - AFTV blows all the other ones out there.  While OpenELEC on RPI is good, XBMC via FireTV is way better...*** Watch my video >>> http://youtu.be/6G23u1TtluE  || This is my FTV after the root process + sideloading of XBMC + custom launcher from advanced remote keymapping  ***  I'm still in the process of manipulating the interface to my liking...", "verified": true, "helpfulness": "1/2", "author": "Y. Velazco \"flip phinoi\""}, {"rating": 5.0, "review": "Wow very easy to hook up and very easy to use.", "verified": true, "helpfulness": "1/2", "author": "T"}, {"rating": 5.0, "review": "This is the best streaming video box on the market.  Just wish it had more access to other streaming services but it couldn't be easier to use.  As a Prime customer I just love it.  Disconnected my Dish recently after adding a digital antenna from Amazon and now I can watch local and streaming programing and save $100 a month too.", "verified": true, "helpfulness": "1/2", "author": "Reidson"}]