[{"rating": 5.0, "review": "It's easy to use and I can watch things on my TV instead of my little phone and it's cheap. I'd recommend it to everyone.", "verified": true, "helpfulness": "0/0", "author": "Bobby D. Warren"}, {"rating": 5.0, "review": "Works great. Smooth streaming from devices. No hiccups. Simple enough to use even my mom can use it easily. Hoping more apps become compatible with it.", "verified": true, "helpfulness": "0/0", "author": "Sultan"}, {"rating": 5.0, "review": "Google has done it again! This device was quick and easy to plug in and start enjoying my shows. Goodbye Direct TV and cable!", "verified": true, "helpfulness": "0/0", "author": "Jesus Altamirano"}, {"rating": 5.0, "review": "I am using Chromecast to replace an HDMI cable that I had been using to play movies and TV shows from the internet onto my TV. I don't have cable so I use this function almost daily. The cable was often left plugged in on the side of my TV and often looked very gawdy and it had started having functionality issues so I started looking at replacement options. I saw chromecast when it came out and was very interested, but I decided to wait until sometime had passed. Now that I have it, I wish I had gotten it sooner. I have been using it to play youtube videos (love the TV queue) and videos from the web and it works great. I uninstalled silverlight so amazon instant videos work and they work great. The other sites I use for streaming work as well as they did before and it is much more convenient. The thing that really surprised me was that I could stream videos from my desktop. Before I was using a laptop to connect the HDMI cable and was expecting the same from Chromecast. I tried my desktop on a whim and it worked like a charm. My desktop is on the older side, although it is lean and works well, and streams just as well as the much newer laptop. Real Cloud Player has worked really well with playing local video's from my phone and computers, still haven't found anything for pictures, but I have also never been interested in showing pictures, at least not yet. Overall I like chromecast very much and wouldn't hesitate to buy again.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "Best electronic device I've bought in a while I really like how versatile this device is and howI don't have to strain my eyes anymore trying to look on my phone I can just connect my phone to my chrome cast and it shows up on my tv  10stars", "verified": true, "helpfulness": "0/0", "author": "Chrissy \"Chrissy\""}, {"rating": 5.0, "review": "I use ATT DSL Internet (Motorola NVG510 modem), it worked without any issues right out of the box. Best value for the price.", "verified": true, "helpfulness": "0/0", "author": "KKumar"}, {"rating": 4.0, "review": "No wires to connect. Works great. The apps which are built to work with chromecast are just a handful for the moment but you can cast any web page that you can open on chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Yogi"}, {"rating": 3.0, "review": "Not as much content was available to stream as I was lead to believe. I thought all Chrome content would be able to stream and not the case. I also have the Apple TV for the iPad and find it does a better job for its platform and seems to be getting more and more options as time goes by.", "verified": true, "helpfulness": "0/0", "author": "Keith"}, {"rating": 5.0, "review": "This thing is great! Let's me stream my computer to my tv from a whole different room! Very easy to change to different tvs. I'm going to buy 2 more for my other tvs!", "verified": true, "helpfulness": "0/0", "author": "Pete"}, {"rating": 5.0, "review": "Can't wait till more things jump on the chromecast bandwagon. Sucks that the google browser on the iPad won't work with it though", "verified": true, "helpfulness": "0/0", "author": "Tom W"}]