[{"rating": 1.0, "review": "Save your money.  This thing is junk.  WOW it streams youtube and Netflix that have serious lag.  Had an issue with my cable modem.  Switched it out and this thing turned into a paper weight.  Stuck in a loop where it won't connect to the Wi-fi, then I reset it and it connects to the Wi-fi, however it will no longer connect to my devices.  Just threw it away and plugged in my Amazon fire from the other room.", "verified": false, "helpfulness": "1/2", "author": "Steve"}, {"rating": 5.0, "review": "Great device to broadcast from your devices. I recommend to everyone.", "verified": true, "helpfulness": "0/0", "author": "Spidey677"}, {"rating": 3.0, "review": "It's like.they created and than stopped barely any apps for it or that work with it", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Good value.", "verified": true, "helpfulness": "0/0", "author": "Rocky Pyrdeck"}, {"rating": 5.0, "review": "When I bought my 32' LG tv I wanted something I could play my Netflix on but I also wanted something that would work like a HDMI cord and so I did some research and the chromecast is what I found. The chromecast does a lot more than what I thought it would. When you download the chromecast app it gives you a list of other apps that you can also download and use via chromecast but there also are a lot of other apps that aren't in that list that will let you cast your phone to the chromecast. For example there is an app called viki that gives the ability to also use the chromecast. Another thing I experienced while using this device is that when I visited a website narutoget.com I went to play the video on my phone there was the cast icon beside the volume. Even though it wasn't one of the apps listed and it was a website it still had the little icon for me to cast the epsiode on my phone. Overall I think it is a great product to invest in. I'm a very satisfied customer.", "verified": true, "helpfulness": "3/3", "author": "Lisa Turner"}, {"rating": 4.0, "review": "Very good to stream content from my macbook chrome browser or screencast my Android phone. Works excellent with youtube! Chrome tab casting has also greatly improved but ever now and then there might be some slight lag or an interruption. Considering the low price I think this is an amazing device with a LOT of capability. Having owned an Apple TV I would say this beats it as it's a small form factor the size of a USB flash drive and it has a lot of functionality and Google is constantly improving to make things better. I am giving it 4 stars instead of 5 because there are still some bugs that you encounter but as more and more people buy the Chromecast these bugs are starting to get fixed.", "verified": false, "helpfulness": "0/0", "author": "Jagdeesh 'Jaggy' Mhasalkar"}, {"rating": 5.0, "review": "This thing is freaken awesome", "verified": false, "helpfulness": "0/0", "author": "Kalaeb"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "David B. Small"}, {"rating": 5.0, "review": "I have a TV and I just use chromecast to watch TV. Great product.", "verified": true, "helpfulness": "0/0", "author": "OSMAN ERTUGAL"}, {"rating": 5.0, "review": "great,I recommend it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]