[{"rating": 5.0, "review": "Love it!! the thing communicates with my I pad so I can watch video on the television from my IPAD", "verified": true, "helpfulness": "0/0", "author": "Kim Tolliver \"Cat lover\""}, {"rating": 5.0, "review": "Seriously. You pay $30 for a HDMI dongle that can stream Netflix, Youtube, and Pandora. That alone is worth the $30. Now on top of that, with a little tech saviness you can do sooo much more than that. No problems.", "verified": true, "helpfulness": "0/0", "author": "TheTechGuy"}, {"rating": 4.0, "review": "I like the ability to use my phone or tablet as the remote. Frequently, doesn't connect to my wi-fi right away, sometimes have to reboot it, but eventually it connects after a couple of minutes. Desperately needs more content sources: Vimeo, Amazon video streaming, Redbox instant, etc.", "verified": true, "helpfulness": "0/0", "author": "Max"}, {"rating": 1.0, "review": "This is intended for people with no smart TV, if you have one don't  buy this product. Apple TV do a better job. I bought because all the fuzz in the media but I overestimate its functionallity. Basically if you don't have a smartphone or tablet you can not use this product...", "verified": true, "helpfulness": "4/5", "author": "Leo B"}, {"rating": 1.0, "review": "I ended up giving this to my mom as a xmas gift because in my opinion it is a product that has no real purpose. I have a roku on my dumb tv and a vizio smart tv. If I had to chose between a tv with built in features of a vizio or a dumb tv with a google chromecast I'd take the vizio built ins every time. Roku and apple tv are better products and you can pick up a roku for under $40 most of the time. no local media playback and needing a device handy to start playback were deal breakers for me. some people might like it, but it is not for me.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The device has very limited internet applications to stream from, which are YouTube and Netflix.  I use my iPhone to search for media on those two applications and then to stream on the Chromecast.However, to surf the internet, you must use Google Chrome installed on your computer or laptop, which is, to me, not convenience.", "verified": true, "helpfulness": "1/1", "author": "S. Ghaly"}, {"rating": 4.0, "review": "This is a great product and I use it on my porch television while I work out. I only wish that I could use more apps on it. other than that its great! I play exercise videos on youtube while I work out.", "verified": true, "helpfulness": "0/0", "author": "M"}, {"rating": 5.0, "review": "Definitively met my expectations. The device is very easy to use, the video quality is good enough. Setup is not quite easy, but you may get information on google.", "verified": true, "helpfulness": "0/0", "author": "Eduardo"}, {"rating": 5.0, "review": "I use it frequently to watch movies not only in youtube or netflix but in any other page where i find something to view: sports, series, etc.  Also the other day we used it in the tv as a karaoke, i really love this thing.", "verified": true, "helpfulness": "0/0", "author": "Oswualdo Herrera"}, {"rating": 4.0, "review": "I love the chrome cast, only gripe would be that it doesn't work with a lot of the apps that I use.", "verified": true, "helpfulness": "0/0", "author": "Francisco Castro"}]