[{"rating": 5.0, "review": "Cordcutters dream.", "verified": true, "helpfulness": "0/0", "author": "Jeff Blankenhorn"}, {"rating": 5.0, "review": "This is a great product.  We have satellite and had taped many episodes of series but beginning in advanced seasons.  Now we are able to catch up with the videos on Amazon Prime.  We could have put our satellite on vacation for the past three months.", "verified": true, "helpfulness": "0/0", "author": "wdr"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Patschild \"brookny\""}, {"rating": 5.0, "review": "I use the amazon fire TV for prime shows and movies and to watch media on my main computer.  I have had no issues with it for those purposes, I also play some games on it as well.", "verified": true, "helpfulness": "0/0", "author": "Jason Cheers"}, {"rating": 5.0, "review": "ABSOLUTELY LOVE IT!  Previously owned a Rokus attached to all my TVs at home.  After purchasing Fire TV, I changed the Rokus out for Fire Sticks.", "verified": true, "helpfulness": "0/0", "author": "tacmedic"}, {"rating": 3.0, "review": "Mostly Amazon stuffs but apps are nice addition. I bought it primarily to watch Sling TV and it worked most of the time.", "verified": false, "helpfulness": "0/0", "author": "BioMed"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/1", "author": "Keith Williams"}, {"rating": 1.0, "review": "still have to buy others services, not worth it..", "verified": true, "helpfulness": "1/7", "author": "Cathryn L. White \"katy\""}, {"rating": 5.0, "review": "I have tons of cable channels (far more than I care for, in fact) but I always end up finding something to do my AFTV box. My grandchildren love being able to play Minecraft on my giant TV, while someone else plays on a Kindle so that they can join up worlds and do whatever the heck they do on there together. That alone, has made it worth the purchase price.", "verified": true, "helpfulness": "0/0", "author": "LaDeeDa"}, {"rating": 5.0, "review": "Love this product.", "verified": true, "helpfulness": "0/0", "author": "joannetk"}]