[{"rating": 4.0, "review": "Yes I'm very satisfied with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Hatvey Dunbar"}, {"rating": 4.0, "review": "Nice combining of home theater and mobile platforms", "verified": true, "helpfulness": "0/0", "author": "Ken Larson \"modhran\""}, {"rating": 5.0, "review": "After a couple month's of using the Chromecast I can say without a doubt it's the best 35 buck's I've ever spent! Now I'll hold off on a new TV for the App's and 4K is not popular enough or cheap enough for me.. Just know this is made to works WITH a smartphone or tablet and can be used with a PC. It is not as a srandalone player if yoy want that you need Android TV or some other streaming player. It does however play the content from the router, but needs to be TOLD what to play.Example,, after starting a movie via Netflix/Hulu/YouTube you can then do whatever you need or want to on your phone/device and it will continue to play until you tell it to stop.Just trying to help those that's not sure what a Chromecast is or does.", "verified": true, "helpfulness": "0/0", "author": "joshua"}, {"rating": 5.0, "review": "Love the Chromecast! The picture is fantastic and is perfect for watching anything on the internet, on our tv. Would definitely buy again and will probably give these as gifts too.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "This was one of the best buys I've made in literally the last five years. Even though I own Apple products (Mac, iPhone, iPad) and an Apple TV, I didn't want to buy another one to just stream Netflix onto my bedrooms TV. Don't get me wrong, the Apple TV is far better than the Chromecast but it costs three times the price (at the moment of s*** review). If you just need to stream Netflix and some other apps which are compatible with the Chromecast then it is a great option.", "verified": true, "helpfulness": "0/0", "author": "Gonza"}, {"rating": 3.0, "review": "it does what it says: casting Netflix and YouTube video to your TV.  However, if you have an older TV (with 720p), it may not work due to the HCDP issue.  Lack of available apps with casting ability.", "verified": true, "helpfulness": "0/0", "author": "Phi Nguyen"}, {"rating": 4.0, "review": "Received it on time! Love this! Been using this for awhile now!", "verified": true, "helpfulness": "0/0", "author": "linda"}, {"rating": 5.0, "review": "Very easy to configure, it works as expected.", "verified": true, "helpfulness": "0/0", "author": "Jorge Eloy Alan Atala"}, {"rating": 5.0, "review": "This is probably the best technology invention since the smart phone in my opinion!We currently have 3 of them in our house.We use them for Netflix, HBO Go, and more importantly Disney Jr and Disney apps.It's so simple to use even my 3 yr old know how to open  the apps and launch his shows.I also see Google is implementing features where you can control certain things with your remote which will be awesome.I'd never buy a Roku over this. The convenience of using your phone over a remote is great. Plus no box taking up more space. The feature will only increase as well as more and more apps utilize Chromecast.", "verified": true, "helpfulness": "0/0", "author": "S. Helderman"}, {"rating": 5.0, "review": "This worked exactly as advertised. I ended up buying one for my son-in-law and he loves it also.", "verified": true, "helpfulness": "0/0", "author": "K. Michael Krumbholz"}]