[{"rating": 5.0, "review": "Product worked just as I expected it to.  Would highly recommend this product.  Amazon is also very easy and reliable to deal with.  Great price.", "verified": true, "helpfulness": "0/0", "author": "Damon Lewis"}, {"rating": 3.0, "review": "can only stream stuff that Google apps let you ..you cant stream native movies from your tablet or phone. Its ok ..", "verified": true, "helpfulness": "0/0", "author": "arjun reddy"}, {"rating": 5.0, "review": "Worked perfectly from the beginning and know I use it every time with my kids and family. I use it mostly for YouTube and Netflix and it's great, you only set it once and then can use it with every smartphone or tablet.", "verified": true, "helpfulness": "0/0", "author": "P. Valencia \"draco\""}, {"rating": 5.0, "review": "I already have an Apple TV but some months ago I bought a video projector in order to have my own home theater; the thing is that with the Apple TV there are too many cables hanging from the video projector and as I have it in my living room each time I use it I have to connect and disconnect them. With the Google Chromecast this is simple: I connect it to the HDMI and USB connector on the back of the video projector and forget about cables running everywhere. A thing to keep in mind is that Google Chromecast works differently than the Apple TV (or Roku); in the latter one you have a full GUI menu embedded within the Apple TV to browse the different media providers. In Chromecast you have to use a mobile device (Tablet, Smartphone, Laptop) to select the media from a provider like Netflix and then this is casted to the Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Carlos Adrian Ramirez"}, {"rating": 5.0, "review": "my family loves this product for net flix and you tube. very easy to use with all of our different tablets", "verified": true, "helpfulness": "0/0", "author": "michele"}, {"rating": 5.0, "review": "can not use on big TV even tho i pay extra for the fastest speed my isp offers, my signal will not go one room away to the large screen set", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"dvbdan\""}, {"rating": 5.0, "review": "The only downside is that it would not connect to my 5ghz network but connects fine to the 2.4 ghz. That caused a little bit of a headache setting it up but since then no problems.I really like how when I tell any app to connect to it if the TV is off it will turn the TV on for me.", "verified": true, "helpfulness": "0/0", "author": "Daktaklakpak"}, {"rating": 5.0, "review": "I loved everything about this. In great shape! It works great with everything. Was brand new as well. Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "John Nemmers"}, {"rating": 4.0, "review": "Very easy setup and operation. The directions are printed on the box and tell you clearly how to install.Needs more applications to bring it closer to Apple TV but for the money, a third of the price of the apple, you could do worse. Just check to see if you will be happy with the viewing choices.", "verified": true, "helpfulness": "0/0", "author": "DiamaondDave"}, {"rating": 3.0, "review": "It is a handy little device. So far we have a had few problems with it connecting. Needed to move it up on the networks priority list. Time will tell if that fix helps. I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Amanda P"}]