[{"rating": 5.0, "review": "Very good seller. I indicate for all.", "verified": true, "helpfulness": "0/0", "author": "Gustavo Carrilho"}, {"rating": 2.0, "review": "- it used to work with netflix, but since the last chromecast software update (months ago!) it constantly buffers.  and there's nothing you can do about it, there's no option to go back to an older version.  horrible customer support.- it interferes with antenna signals.  don't know how this passed FCC certification.  Have to buy an adapter and cable and move it far away from the tv, which looks bad.- controlling it (pause, etc.) is just slower than having a dedicated remote.I ordered a fire tv stick, hope that will be better.  Google doesn't have their \"a team\" on this product.", "verified": true, "helpfulness": "0/0", "author": "Karlito"}, {"rating": 5.0, "review": "How did I live without this? Absolute must have. Play youtube videos for kids, netflix, hulu, hbo, and so much more. Easy to set up and use, even with the mobile phone.", "verified": true, "helpfulness": "0/0", "author": "Parabellum"}, {"rating": 5.0, "review": "Absolutely amazing I can stream Netflix shows off my Iphone without even draining battery and it appears in HD! It was also easy to teach my parents how to use this wonderful technology considering all you have to do is press a button and they finally appreciate technology. I would recommend this to anyone who wants to take advantage of wireless technology and loves streaming their favorite shows without any ads. I know i'm tired of 10 minutes of continuous ads on Time Warner Cable.", "verified": true, "helpfulness": "0/0", "author": "Amrit Arora"}, {"rating": 5.0, "review": "Great product!!!!", "verified": true, "helpfulness": "0/0", "author": "Fabian A. Giraldo"}, {"rating": 5.0, "review": "Great thing since sliced bread.  I watch pretty much whatever I want on my TV, sent from my laptop or my phone (I should mention that the Plex Media Server is a great accompaniment to this product).", "verified": true, "helpfulness": "0/0", "author": "Ken Hopson \"kwhopson\""}, {"rating": 5.0, "review": "excellent product", "verified": true, "helpfulness": "0/0", "author": "Bank of America"}, {"rating": 5.0, "review": "Great product and really easy to setup.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "Very useful with my youtube app in my iPad", "verified": true, "helpfulness": "0/0", "author": "Bhaskar"}, {"rating": 5.0, "review": "great product. we dont use the TV in the guest room so didnt want to rent a cable box that would go unused. We got this so we could offer something to our guests. We use it a lot now.", "verified": true, "helpfulness": "0/0", "author": "Brooke Brissette"}]