[{"rating": 4.0, "review": "I love my AppleTV but the Fire TV has a far better UI implementation.  Now if only it would have all the content iTunes has to offer.  :(", "verified": true, "helpfulness": "0/0", "author": "Niclas"}, {"rating": 5.0, "review": "I switched from an Apple TV to the Amazon fire tv.... Being a huge apple fan, I was a bit nervous, but so far I am quite pleased! Honestly the voice search was one of the main differentiating selling points, as searching without a normal keyboard is always a bit of a pain. The voice search is definitely worth it, and I use it often! Great product", "verified": true, "helpfulness": "0/0", "author": "nurseman21"}, {"rating": 5.0, "review": "I love using my Amazon Fire TV. It is so easy to use with my Direct TV. I have Amazon Prime which makes so many shows available to me. I would highly recommend.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"none\""}, {"rating": 5.0, "review": "This freed us from satellite TV and the terrible contents of so many channels. Voice activation is incredible!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Love the Fire TV!  Loads much faster than my Apple TV even with my ridiculously slow DSL connection.  In fact the Fire TV pops a message periodically that asks if I want to continue watching when the connection is really slow or try again later.  So far, I've chosen \"continue\" and it apparently has had enough time to spool that it's fine after that.  NOTE:  this is an issue with having a slow internet connection and not an issue with the Fire TV's performance.However, the only flaw I've found was that about 2 weeks after purchase, it wouldn't come on when I pressed the Home button on the remote.  Because it's a computer, I figured, what the heck, guess I'll reboot it.  Pulled the power plug, waited a few seconds and plugged it back in.  The Fire TV fired up and went through it's initialization.  However, pressing any button on the remote still had no effect.  Doh!  Changed the batteries and it worked fine.  So, here's my only gripe...I had originally downloaded and been watching the Netflix app but after I rebooted, I had to download and sign into the app again.  Just be aware that this may happen for you too.I like the interface better than the Apple TV too.  But that's a personal and somewhat subjective thing so your experience may be different.I have not tried any of the other apps yet because I bought it primarily to stream Amazon Prime and Netflix.The reason for 4 stars instead of 5 is having to download and sign in to Netflix again on reboot.  If I had a lot of apps and had to do that it would be kind of a pain.", "verified": true, "helpfulness": "0/0", "author": "Sally Lawrence \"Home Sales Sally\""}, {"rating": 5.0, "review": "great device for the price. xbmc sideloaded is amazing!", "verified": true, "helpfulness": "0/0", "author": "Ron Lawrence"}, {"rating": 1.0, "review": "No USB option makes Fire TV no better than chromecast or roku stickTgere is no reason to pay 99 for this device", "verified": true, "helpfulness": "1/6", "author": "Samir Arora"}, {"rating": 5.0, "review": "I already have Amazon prime and use it constantly, now I can watch the same programs and movies on the TV..I like the Amazon Fire TV so much, I am going to delete part of my cable package....and Amazon Fire TV is so easy to use.", "verified": true, "helpfulness": "0/0", "author": "BSC"}, {"rating": 5.0, "review": "outstanding", "verified": true, "helpfulness": "0/0", "author": "moises noe pena"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "RaShae Davis"}]