[{"rating": 3.0, "review": "After one night there is really nothing new to offer an existing Apple TV user.  Especially if your movies, TV shows, and music already exist within Apples “walled garden”.Pros• Super fast, scrolling is smooth.• Build quality is nice.• Preloaded with my Amazon Prime account information.• Content looks great.Cons• The unified search is for Amazon content only. Kind of misses the point.• The interface is cluttered at times.  Actually all the time, I got lost in the menus more than once.• Amazon Prime Video content (free) and pay per view Amazon content are commingled. Only a very small Prime badge differentiates the two.• Free Amazon Prime content still has the rental pricing listed which just adds to the confusion.• The one game I played was Monsters University.  It contained exactly two levels.• No Airplay streaming from devices.• No HBO to go app.• The Netflix app is a step back from the Apple TV implementation.• No photo services outside Amazon’s cloud drive.  It would’ve been nice to at least be able to add my Flickr photos.", "verified": true, "helpfulness": "5/8", "author": "Domingos Fernandes"}, {"rating": 3.0, "review": "Set up was easy, seems to work quite well. BUT the inability to search for AMAZON PRIME videos is a major drawback. I imagine amazon can probably address this issue with a software update. My guess is that amazon wants to tempt you into buying more content on a pay to view basis. Whether amazon does or does not address this issue will spell out their intentions for amazon 'tv'", "verified": true, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to set up. Did have to update but even with wireless internet this took less than 5 minutes. Fantastic picture quality.  Voice search function is excellent.  Very pleased with my purchase.", "verified": true, "helpfulness": "2/5", "author": "Jeff Mar \"dojimaster\""}, {"rating": 5.0, "review": "I have been streaming video to my Tv's since the original Roku.  When I saw that Amazon came out with a streaming box that had voice search and spec wise it blew everything out of the water, buying this was a no-brainer.  Voice search works very well, and load times are faster then my cable box DVR.  Picture also looks better then my cable box.What i like:1.  box is low profile2.  load times are really fast3.  voice search works well4.  remote is simpleWhat i don't like1.  there is no option to turn off the confirm screen with voice search2.  As of now, no HBO Go rights.3.  This is only an impression, by remote feels like it would wear out easily4.  Voice search only works with Amazon Prime.", "verified": true, "helpfulness": "4/5", "author": "budfox"}, {"rating": 4.0, "review": "Issues to cover: Setup, Wifi/Networking, Service.When I set mine up I didn't have any sound turned up. Also when pairing the remote I assumed it was only Bluetooth, so it took me a minute to realize I should point the remote at the device. After setup Bluetooth starts right up. I did notice the long video others here have already mentioned, but as I was busy with homework & had no sound I hardly payed any attention. My objective was to get on Netflix.Wifi or networking issues. I live in an apartment, so Wifi is always in contention. If this is the case for you, and you can't get good signal then I recommend you use the wired networking port on the device. I will chide Amazon for not putting Gigabit ethernet on the device. If they had we could have used jumbo frames to improve streaming performance. With that in mind I watched Netflix all night, and have zero problems with the Wifi range & quality. The AP I am using is a Routerboard from MikroTik for anyone who is interested.Now for the service of the device. The Netflix app they made for the Fire TV is top shelf. I am coming away from using my computer for media, and watching Mom's Apple TV. The Apple TV can't autoplay to the next episode, but my browser version does. It is nice to see Netflix added this capability to the Fire TV app.Amazon video service, and provider agnosticism. Amazon's instant video service is more like Apple's iTunes rental service. You can also buy content on both services, but they are not like Hulu or Netflix.  Speaking of searching. I did take note that when looking for a title. Amazon did offer me the information that it was available on my Hulu account. I don't think it does this for Netflix? This is quite honest of them IMO.You can be a Prime member, and get access to a catalog of content, but as others pointed out the searching for new stuff is not great. Amazon needs stronger typing in Genre searching. It's not great when you search for Scifi, adventure, animated, and see all the same titles. I think Amazon needs more specific genres, and stronger enforcement.What I think they did was to be inclusive so if someone even thought it might be considered adventurous it got that type too. I think more genres would be good to zero down into what you are looking for like Disney type animation vs. cartoon or anime. All of which are lumped together right now.If you want Netflix, Hulu, and Amazon Instant video on the same TV device this is it. I tried a Archos device recently, and Hulu admitted to me none of the Google TVs were supported yet, and nothing from Archos was. Amazon is competing against Google on Android so most devices have no Amazon Instant video support. Even Apple TV only has two of the three. (along with their own iTunes store service)My verdict: It's better than Apple TV right now, but if Amazon wants to keep it up they need to clean up their own video service.I'll consider updating my review as I have more experience with the device.Update: One thing I would like more clarification on from Amazon is how the use of their Kindle Fire is used with the Fire TV. I see now it can have both media uses, and gaming uses. They need to show how they converge together. (basically how to make them work) It seems to me now that you can get Google Chromecast-like functions?Update: Had to move to ethernet port since two of us in the apartment streaming Netflix/Amazon Prime at the same time starves out the iPhone. The quality I guess was just too good. ;P", "verified": true, "helpfulness": "4/6", "author": "Jay"}, {"rating": 4.0, "review": "Overall a good solid product from Amazon. It doesn't like to connect to WiFi, so I ran another Ethernet cable to my router. It kept resetting and telling me that it could not download the latest software. After about the fifth time, I finally got it running. Not as \"plug and play as my three Roku boxes, but not bad overall for a first effort. When the controller comes, I will review that and talk about how it plays games.**Update**I can send the video stream back and forth between this and my Kindle HDX!!!!! THIS ROCKS!!!!! Amazon has really put a solid entry into the video streaming (and gaming) market. The price gives great value and the hardware is high quality. I have also reviewed the game controller for this. The game controller is well worth the money also. Buy this, an HDX and the controller and subscribe to prime for an awesome living room experience.Okay, I admit, I'm an Amazon SUPERFAN!!!!!", "verified": true, "helpfulness": "1/2", "author": "wizardshat"}, {"rating": 2.0, "review": "WOW where do I begin! First I'll say I was excited to get this item in 1 day instead of the Primes 2 day shipping but man, once I got it, wow, it sure was NOT as easy to hook up and the Amazon Fire TV platform page outlines. You'd think it would have been and I actually did my research before buying the thing. I had to call in Amazon twice for help and the representatives were as clueless as I was. No one was helpful AT ALL and they just seemed to say, \"I'm sorry you're having that issue...\" Well me too and after spending $100 on the machine, after already spending $75 on Prime membership, what is the worth of switching over???That's all I was asking myself the whole time while setting this thing up. I had to move my whole living space around because the system has to be set up with Ethernet AND HDTV Cable, so you're modem has to be close to the tv system, which ours was not! Yeah, re-decorating and trying to figure this out, NO!!!!! After paying for the system you should get all the apps free. Why pay for the box, to have to pay for all the memberships, very expensive Roku box!", "verified": true, "helpfulness": "2/15", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Jeff Bezos and team can be justifiable proud of their new Amazon TV Fire product.  It set up quickly and has great intuitive control.  As the content grows, it will become more compelling.  For now it is a nice evolutionary leap in watching TV.", "verified": true, "helpfulness": "2/2", "author": "E. Mathewson \"EM\""}, {"rating": 5.0, "review": "Have had this unit for a couple of days but it has performed as expected and then some. Setup was extremely easy right out of the box and was on the TV in a manner of minutes. I have a separate out building with no wired connection and it found every network in the neighborhood right away. Hooked up to my network via wireless not wired... waited for the update to download and have been enjoying it ever since.Very easy to use. Very small, nice looking unit and the voice search had never failed yet.I don't use this for everything... nor do I expect it to clean the house and cook the meals... I use it just for wireless TV and so far it works excellent for that.", "verified": true, "helpfulness": "3/3", "author": "M D McCallum"}, {"rating": 2.0, "review": "Still no effing browser?  Why not?  This is still a boob-tube.  Games are about all that sets this apart from the other crap-top boxes.  Disappointing.", "verified": false, "helpfulness": "5/19", "author": "Conal Garrity \"Reverend Gonzo\""}]