[{"rating": 5.0, "review": "Best unit going. Able to connect to hotels that have password protected wifi very easily. Fire TV does everything it says it will do. Commended over roku and Google chrome cast", "verified": true, "helpfulness": "0/0", "author": "Brian Beach"}, {"rating": 5.0, "review": "I like it, I'm satisfied with my purchase.  It is pretty cool now, soon you can connect it to Amazon Fire TV, so it will be like having a sound bar for free.  Plus I think a lot of other cool things are coming.", "verified": true, "helpfulness": "0/0", "author": "Norm Rohrer"}, {"rating": 2.0, "review": "I don't know if I like it or don't actually since i can't get my wifi configured (with no help from my ISP), but I'm sure I will. I've spoken to several other folks who are simply pleased beyond expectation. So . . . I'll keep troubleshooting to enjoy it as well as others.", "verified": true, "helpfulness": "0/3", "author": "Sharon Kocuba"}, {"rating": 5.0, "review": "Fast processing, intuitive interface, great ergonomic remote. Good value. Enjoying speedy access to multiple forms of entertainment with music, movies, games and apps.", "verified": true, "helpfulness": "0/0", "author": "Michele L"}, {"rating": 5.0, "review": "I wished I have bought this gadget first. It has changed my way of watching tv and I don't rely on my Direct TV service to command what can I watch and when. After this I don't feel I have to keep Direct TV any longer unless the very basic for local news/ The best investment I have made media wise.", "verified": true, "helpfulness": "0/0", "author": "Ricardo Torres"}, {"rating": 5.0, "review": "We LOVE, LOVE, LOVE our Fire TV! No more high satellite TV subscriptions for us! Now we get to see what we want, when we want for a fraction of what we paid for satellite! With a couple of very low-cost monthly subscriptions we now have all of the viewing content we could ever want delivered through this magic little box! Thanks, Amazon, for another amazing product! We would highly recommend Fire TV!!", "verified": true, "helpfulness": "1/1", "author": "Shelley L Lee"}, {"rating": 3.0, "review": "I like to be able to get live Fox News and cannot.", "verified": true, "helpfulness": "0/3", "author": "John Nelson"}, {"rating": 4.0, "review": "If this had been around before I bought a playstation to watch Netflix on I wouldn't  have wasted the money. Not that I didn't like the playstation.", "verified": true, "helpfulness": "0/0", "author": "jack gahan"}, {"rating": 5.0, "review": "My Amazon TV is great. I recently dropped my cable TV provider and replaced it with slikg TV which is supported by the amazon tv. The remote is easy to use and there is a lot of content.", "verified": true, "helpfulness": "0/0", "author": "Robert Berkley"}, {"rating": 3.0, "review": "Every time I try to watch a news program it buffs every forty seconds or so. Plus there is not much live TV.", "verified": true, "helpfulness": "0/0", "author": "Trina Davis"}]