[{"rating": 4.0, "review": "Overall solid device. I wish Amazon Game Studios would release more games for it. The voice search feature on the remote is very precise and impressive. Works much better than my Xbox One's Kinect or iPhone's Siri. Great for streaming and using apps like Netflix, HBO Go, ESPN, and Twitch. Most importantly it's very easy to use and set up. Very neatly designed and discrete. I certainly do not regret my purchase. My only complaint is the lack of game support from Amazon themselves.", "verified": true, "helpfulness": "0/0", "author": "Joshua Perez"}, {"rating": 5.0, "review": "Very happy with how easy it is to use.", "verified": true, "helpfulness": "0/0", "author": "Dennis winckler"}, {"rating": 5.0, "review": "I am absolutely loving it.  Haven't watched anything on regular cable since I got it!", "verified": true, "helpfulness": "1/1", "author": "Korrin Tracy"}, {"rating": 3.0, "review": "Wish there were more movies available without additional cost.", "verified": true, "helpfulness": "0/1", "author": "Terri Seemans"}, {"rating": 5.0, "review": "Great device.  Near the top of the list as one of the smartest purchases I ever made.", "verified": true, "helpfulness": "0/0", "author": "Grace Bartal"}, {"rating": 1.0, "review": "It worked exactly one time. I was able to set it up, played with the microphone, watched a couple of trailers and installed a few apps. Terrific little gizmo, as first impression. I would have given 4 stars (1 out for the experience when you have an active PIN). Unfortunately, it was also the last: I left it alone over night and it went dead. Maybe it was afraid of the dark, who knows. Maybe it missed its siblings in the Amazon warehouse. Maybe it got afraid when I tried the voice recognition using 4 letter words.At first. I blamed myself for not reading the F manual - I assumed it's so intuitive I did not need to.The problem is that the little white frontal led was off. I tried to move the power adapter to a new socket, restart it after powering it off for 30 seconds, nothing worked. I have a voltmeter and I'm not afraid to use it - so I ruled out the power adapter. The problem is in the little black brick itself.Too bad I don't have the package any more to send it back for a replacement. I really liked it.UPDATE:Amazon replaced it for me. Hats off to them. Unfortunately, they sent another broken device, that starts and shows a niiiice Amazon logo, white on a black background. And that's it. I looked at that logo for 10 minutes, expecting to change. I thought it has a lot of updates to do. So I called the customer support, that offered another change. I decided that I don't want to test another broken device, since I don't work for Amazon, so I asked for a refund. They did not accept, of course. Maybe they wanted to send me a 3rd one that can make some smoke when powered on?Overall, now I have a nice black brick that I use to warn my friends about Amazon, a nice 6V power adapter (why not the standard 5V that everybody else uses?), and, the most useful, a nice bluetooth remote that can be paired with computers.I guess I'll join the apple fanboys and get an appletv. Naaah - a raspberry pi will be the replacement!", "verified": true, "helpfulness": "2/3", "author": "topaz"}, {"rating": 3.0, "review": "I wish it had Vudu, and MGO. for the most part, it gets the job done. I am anxious to try the games out. A controller should be included or atleast be bought at 50% off for the the first one.", "verified": true, "helpfulness": "0/1", "author": "Bucky"}, {"rating": 5.0, "review": "Just overall great...with the addition of Sling TV, we have dropped cable completely", "verified": true, "helpfulness": "0/0", "author": "Nathan Dell Beni"}, {"rating": 5.0, "review": "I absilutely love Fire TV. It was so easy to hook up and it is super fast and works beautifully.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is AWESOME!  Way better than my \"smart\" dvd player.", "verified": true, "helpfulness": "0/0", "author": "Chris Minor"}]