[{"rating": 5.0, "review": "Easiest way to stream our videos on the TV!", "verified": true, "helpfulness": "0/0", "author": "Tiffany"}, {"rating": 2.0, "review": "Works well for what it does, BUT BE AWARE, this will ONLY work with google apps and programs. I should have done even more home work, but i took the sites description as it plays ALL media on your phone or tablet. IT DOES NOT!!! It will only work via the android device direction the chromecast to a web site, ONLY", "verified": true, "helpfulness": "0/2", "author": "Dana W"}, {"rating": 4.0, "review": "Does What I expect it to day", "verified": true, "helpfulness": "0/2", "author": "Alfred L Billingsley"}, {"rating": 2.0, "review": "returned it. Works for everything except Amazon Prime streaming video. DUH?", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fast delivery, easy setup, love watching youtube on the big screen. Went to Best Buy and bought one for my son. Seems to enjoy it's use as much as me. Had issues with Netflix in the beginning and lots of lag on viewing my pictures and video but sure it will soon improve.  Still a good product which I have recommended to others.", "verified": true, "helpfulness": "0/0", "author": "Anna Casey"}, {"rating": 3.0, "review": "Decent, slow. Usable.  the casting thing is really nice, but it needs being close to the router. Specifically of need to stream local cpmtent,  then you need both devices close.", "verified": true, "helpfulness": "1/1", "author": "islam ahmad"}, {"rating": 5.0, "review": "Good \"adaptor\". Roughly speaking, it can change an ordinary TV to a smart one. The interface with iPhones must be improved.", "verified": true, "helpfulness": "0/0", "author": "John L. Tassoulas"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "claudio ache"}, {"rating": 5.0, "review": "Amazing product. Easy to install. We put one in every room now for easy access to Netflix and anything on our iPhones, iPads. So cool. I've tried wireless adapters and they are not effective. This product is awesome!", "verified": true, "helpfulness": "0/0", "author": "Sherri Tone"}, {"rating": 5.0, "review": "Yeo", "verified": true, "helpfulness": "0/0", "author": "tpsslugger"}]