[{"rating": 5.0, "review": "I use this in my child's room to stream Netflix and other content.  works flawlessly and never had an issue.  I have 2 now and couldn't be happier!", "verified": true, "helpfulness": "0/0", "author": "Jonathan Van Tol"}, {"rating": 5.0, "review": "I have a 60'' smart television, and this just enhances the experience that much more. Youtube, Pandora, Netflix. Being able to stream all that right to my television is phenomenal.", "verified": true, "helpfulness": "0/0", "author": "Marissa Dixon"}, {"rating": 5.0, "review": "i bought this for my parents and theyve been using it to everyday to watch movies on netflix and indian tv shows from youtube. It also works with HboGo and you can cast tabs form google chrome on your PC which is very useful. Installation is super quick, you plug it into a HDMI port on your tv and then plug it into either a USB port or a wall plug for power. Then you download the Chromecast app and follow the instructions, takes 5 minutes.I know Google recently released the code for this so the number of apps that use the chromecast will increase even more in the next few months.", "verified": true, "helpfulness": "0/0", "author": "Lucky"}, {"rating": 5.0, "review": "I always wanted to watch stuff on my TV but clunky controllers and menu's were always terrible and really made me hate to use them. With this I can finally find what I want to watch and stream it seamlessly. The ability to use Hulu, Netflix, Youtube, HBOGo, and others really can't compare to the price of this... $35 is a steal!", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 3.0, "review": "I enjoy the nearly endless options of the Ruku far more than Chromecast. Don't buy it for streaming media, you'll regret it.", "verified": true, "helpfulness": "0/0", "author": "Zachary Rose \"Anarcho-communist\""}, {"rating": 2.0, "review": "The only couple of products currently available for streaming have huge limitations on using them to stream. You either need to download some sort of payed converter software and convert your video all to the same format, or upload everything to realplayers cloud and pay them for the privilege (it does NOT support direct streaming). The full screen streaming is why I bought this and it's choppy and the sound wont stay in synch. The hardware got released way too early without any good software supporting it. I wanted to be able to just put up the video output from my computer to my TV basically and it does a terrible job at that.", "verified": true, "helpfulness": "0/0", "author": "christopher steen"}, {"rating": 5.0, "review": "What can I say about this Elite product. .... Especially with the inclusion of HBO Go, HULU Plus and of course yourtube n Netflix .... its been overused at my home and had no problems ... I also cast my chrome browser at times and works pretty well....Very happy with this .... This is my 2nd one for my home .... wink", "verified": true, "helpfulness": "0/0", "author": "Senthil"}, {"rating": 1.0, "review": "claims to be easy to usenever workssays the chromecast is ready to use but never works on my devices.Worst purchase ever!!!", "verified": false, "helpfulness": "0/4", "author": "Aaron"}, {"rating": 3.0, "review": "Was considering a Roku but went with this because its Google and its cheap.Set up is pretty easy.Some problems- no Amazon- I guess they are competitors.Hulu Plus is listed as working - BUT- check your software- I have an Android phone, an Itouch, and a laptop.  NONE of them have the operating systems needed to cast HuluPlus.  After figuring this out I had to cancel my Hulu account- I might get it again when I get a new phone.Netflix casts great- as does You Tube (which is Google- so it should)So- not bad at the price- but Google needs to add some more streaming services- fixing HuluPlus would be a quick fix.", "verified": true, "helpfulness": "0/0", "author": "Joe bagadonuts"}, {"rating": 2.0, "review": "It's wonderful when it works.  But it doesn't stay connected to my Internet router.  I have to unplug & reboot the router several times a day.Chromecast support gave me a list of things to check on the settings on my router.  So, now I'm going to caller the router manufacturer and they said they'd help me check all of the settings.So, it's not as good as I expected it to be.", "verified": true, "helpfulness": "0/0", "author": "jeffwillet"}]