[{"rating": 1.0, "review": "No it didn't amazon should make it clear  that it's not for country out of the us  now  I got this amazon fire that is no good to me", "verified": true, "helpfulness": "0/2", "author": "sherwin Anthony kelly"}, {"rating": 5.0, "review": "Great picture. Quick load time. Seamless streaming. I can't wait to fully get rid of our cable.", "verified": true, "helpfulness": "1/1", "author": "Katrina"}, {"rating": 5.0, "review": "Perfect. My kids love watching movie on Amazon Prime. .", "verified": true, "helpfulness": "0/0", "author": "Jim Heinz"}, {"rating": 5.0, "review": "We have truly enjoyed using this TV attachment.  We have not watched regular TV since we installed the Fire.  We use mainly Amazon Prime and Netflix, also Acorn TV.  I would highly recommend the Amazon Fire TV for folks who want to watch TV series episodes back to back.", "verified": true, "helpfulness": "1/1", "author": "Irene \"IrisEyes57\""}, {"rating": 4.0, "review": "Once it was hooked up it is great. You should have better directions inside to hoop it up.  I could not open the remote to insert the batteries. I googled that and got results. Many people had the same problem I had.  Then, when it was hooked up, it would not work. I did not know how to select nor to go up and down. Since it is completely black I suggest putting white arrows around the select button so you can see the direction arrows. I found out quite by accident. then, I thought I was all set and what do you know it did not work. I then googled that problem and I found out I needed a newer and faster router.  After I bought that, it finally worked and works great. My husband watches a lot of  tv since he is in a wheelchair. He now can find movies all the time.", "verified": true, "helpfulness": "0/0", "author": "Judy"}, {"rating": 5.0, "review": "Exactly what I was hoping for.", "verified": true, "helpfulness": "0/0", "author": "leoanatoli"}, {"rating": 5.0, "review": "Great product. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "C A T V in central Penna. !!!!!!!!!!! are you paying attention? These folks gave me what I wanted at a price I was willing to pay.........not what YOU wanted me to have at a price YOU determined!  C U later!", "verified": true, "helpfulness": "0/0", "author": "Mary's husband"}, {"rating": 4.0, "review": "Like it...still learning/experimenting.", "verified": true, "helpfulness": "0/1", "author": "Jerry R. Bitner"}, {"rating": 5.0, "review": "We love our Amazon Fire TV.  It's easy to set up and easy to use.  There is a lot of viewing options if you are a prime member.  In addition, there are a lot of purchasing options if you'd like the most recent TV shows and movies.", "verified": true, "helpfulness": "1/1", "author": "Love my Kindle"}]