[{"rating": 5.0, "review": "It worlks both on my Ipad and Window 7, after you downloaded free app for each system respectively, great for Netflix and Youtube, I watched youtube a lot so this thing helps a lot casting on to 52\" HDTV.  This is very simple product, and the picture quality is as good not bad, you see way better for youtube on the big screen.  It works good on windows 7, page by page loading, as normal browsing, but the Ipad only works Netflix and Youtube.Anyway, some people like some don't, for me it is good product to watch netflix and youtube on big screen for $ 35 !", "verified": true, "helpfulness": "0/0", "author": "MTR999815"}, {"rating": 1.0, "review": "Plugged it in, pulled it out to go in another port and the metal usb part came out from the plastic housing.  Has damaged the port on the tv as well.  No unusual or rough handling - just fell apart.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Not WIRELESS HDMI, you can only stream apps, which limits the use. Everything is also still in beta including most importantly Chrome browser.Rumors say soon we should be able to stream our whole screen instead of just an app.Speed is okay, slightly lag input as expected. Uses Router's Wifi network to connect and issue commands. Big problem is it only accepts 2.4GHz, no 5GHz. Fortunately my Asus AC66U dual band lets me sign onto 5GHz on phone, and control the Chromecast on the 2.4GHz signal.P.S. You still have to switch your TV's input every time so you can't ditch the remote completely, not quite a Smart TV alike, but neither the price.", "verified": true, "helpfulness": "0/0", "author": "Martin"}, {"rating": 4.0, "review": "Easy to install, works as promised.  Will be great when there is more content available for people to veiw online.", "verified": true, "helpfulness": "0/0", "author": "Henry K Johnson"}, {"rating": 1.0, "review": "I was very disappointed with this streaming media player.  It only works on a single band router, and not a dual band one.  After I spent an hour with technical support they discovered that I had to change my router to a single band one. This fact IS NOT indicated in the specifications.  Total waste of money and time.", "verified": true, "helpfulness": "0/2", "author": "Dedalos"}, {"rating": 5.0, "review": "Very good priceCan't wait until more things work with itLove putting stuff on the tvWaiting for iTunes hope that works soon", "verified": true, "helpfulness": "0/0", "author": "Norma"}, {"rating": 3.0, "review": "Nice ideal but missing some much needed functionality and 3rd party app support. Only really works with the select products listed.", "verified": true, "helpfulness": "0/0", "author": "Charking"}, {"rating": 2.0, "review": "I did return mine which I bought hoping to be wire free and able to mirror iPad on my TV. That's what it looked like on product page/advertisement/on all gadget review blogs I read).I didn't realize that1. it needed brick adapter plugged into power outlet.2. it can only cast certain apps (only two Netflix and Youtube at that time)  2a. Netflix using Chromecast won't auto play next episode. I had to exit from current episode, select the next one from the list to watch next.BTW, it is not plug and play like it is still written on product page. (It's very easy setup but not plug and play).If someone asks me what one feature Chromecast perform better than any other device is or feature only Chromecast have? I don't have an answer. I mean if it is same wire clutter and have Netflix with less feature, why would I need it? I already have ps3/tivo/pc connected to my TV. It does not perform better than any other product I have, worse it took up the USB slot on my tv. I give 2 start for stream image quality which is great.(Bought from Best Buy).", "verified": false, "helpfulness": "1/1", "author": "kmttw"}, {"rating": 1.0, "review": "I bought the chromecast hoping to be able to stream material from my chromebox to the TV.  After a couple of days trying to get it to work with no success i called google for help.  They told me that chromebox was not compatible with chromecast.  I then began the process of trying to send it back and get a refund.  Instead of taking the information online they said the case would be referred to their service department.  Several weeks later and numerous calls i finally got the return label.  i sent the chromecast back as instructed and now it's been over three weeks of waiting.  i called service again and they said they would refer the case to another department, but they could not check on the status of the return.So, before you order a chromecast, be sure its compatible with whatever you're going to hook it up with.  Otherwise, you will have a long and frustrating experience with trying to get service and your return money.", "verified": false, "helpfulness": "2/3", "author": "frank \"realist\""}, {"rating": 1.0, "review": "Very excited to get the Chromecast. Cutting the cord... Plug it in. Go to set it up..... nothing. Could not connect to it through my Verizon Fios router. Spent a couple of hours scouring the internet looking for solutions. Tried some recommended changes to my router, nothing. Spent an hour on the phone with Google, they were very nice, but they seemed like they were surfing the web looking at the same problem resolutions I had already tried. I mean a Fios router??? I know there are probably a hundred different types, but really??? It's Verizon!!!Tried connecting via a PC, Mac Pro, Moto Android,.... nothing. Probably try a Roku...", "verified": true, "helpfulness": "5/7", "author": "DMarie"}]