[{"rating": 5.0, "review": "I usually don't bother writing a review for things I buy on Amazon, but I felt compelled to do it with the Amazon Fire TV.  I love EVERYTHING about it.  It took less than five minutes to hook up, I was pre-registered, so I didn't have to worry about that part, and once everything was uploaded, I was kicking back watching my favorite TV shows and movies.  I couldn't tear myself away from it all weekend!  I highly recommend the Amazon Fire TV.", "verified": true, "helpfulness": "3/3", "author": "Jennifer D. Williams"}, {"rating": 3.0, "review": "I have tested out Chromecast, Apple TV, Netgear neotv and now this amazon fire tv.  I love Amazon for shipping/ordering stuff/customer support but I think their attempt at making electronics have just fell short for me.  I have owned the kindle fire also and did not like it which is kind of the same deal with this kindle fire tv.  In my personal opinion the features are there it's just the interface I think, something about how everything is laid out and how you have to navigate around (just not feeling it).  I know they are probably trying to stand out from the rest but still it's just a little hard to search and move around on the Fire TV.  What I found odd was even though I am a Prime member and I find a show that is Prime ready, it still ask if I want to buy it for 2.99 +.  I finally figured out that if I just click on the screenshot of the title it will play.  Another thing to think about is you are forced to rent new movies from Amazon only starting at $5.99.  I can rent the same movie from VUDU or M-go on the Roku for $4.99 and the quality looks the same to me.  I know what Amazon is doing here which is smart they want you to rent/buy from them just like Apple TV which is another reason going with Roku is a plus because they give you multiple options.  I think there were just some oversights in the design and I'm sure all this will change with time.  I remember when the Kindle Fire came out everyone was complaining about the layout and they did change that so I'm sure the layout of Fire TV will get a fresh look soon.  One other thing I noticed is if you are searching under top recommendations for Prime TV, you have to click like 3 times to finally get to the movie/show (I think it should load automatically if you click on the picture you see, only makes sense).As for the speed, I cannot see a big difference from my Roku XS box the same buffering is happening so I really think the speed of any box relies on your wifi connection not the specs inside the box.  That was the only reason I tried this box was to give it a shot at speeding up my viewing but it hasn't happened yet.  I will say that if you pause and then playback that reacts quick but the Roku does the same, apple TV does not.  I really didn't try the games out because I am not a gamer so can't review on that, it may be the life saver for this little black box if it takes off.  I attempted to download a racing game but it said it required some add-ons that were like 1800MB and it would have taken forever to download.  I'm sure the more games you put on the device the slower it will get because you will use up all the memory eventually.  The voice search appears to work pretty good and it does recognize what I'm saying even with my southern accent so they did it right in that dept.I have read over and over that HBOgo is not on there and some didn't get it for that reason and some could care less.  I am kind of in the middle I don't watch it all the time but I did find myself last night wanting to watch something on HBOgo and had to postpone because the app wasn't there (guess I could have hooked my Roku back up :)This same thing happened when I bought the Apple TV, I thought I was going to like it but the lack of app support and the fact that it did not perform any better than Roku I just stuck with my trusty Roku which does it all pretty much and just keeps getting better and better.Overall I think the Fire TV will get better with time just like the Chromecast but for the time being I will stick with what seems to be an all around good media player (Roku) and the most bang for the buck.", "verified": true, "helpfulness": "1/5", "author": "Stem \"Stem\""}, {"rating": 4.0, "review": "First, I love it.  Easy setup.  Voice search is, literally, great.  It's also wicked fast...scrolling through the listings, playback, etc.On the negative side - voice search should be extended to Netflix and other apps.  That's frustrating that it's only for Amazon offerings.  Also, no HBO Go.In all though, I love it.  As soon as voice search is extended and HBO Go arrives...this review goes to 5 stars.", "verified": true, "helpfulness": "0/1", "author": "GCM"}, {"rating": 5.0, "review": "First of all I just got the device delivered and couldn't wait to set it up. While some people complain about not including and HDMI cable, I had no problem connecting it with a spare cable that I had. Besides, I guess the elegant packaging that made it such a pleasure to unbox wouldn't have been as compact if a cable was included. The box took all of 5 minutes to set up. The automatic software update was super fast. After I typed in my Wi-Fi password I was up and running. I subscribe to Amazon Prime and HuluPlus. Immediately I was able to watch Iron Man, The Avengers, and Thor for free. Hulu Plus was a breeze to set up. I do recommend that users subscribe to Prime, Hulu Plus, Netflix, or Showtime or the functionality will be greatly limited. Voice search was remarkably accurate. I searched for Reign from the CW and on the first attempt got \"rain\" but somehow on the second try I pronounced the more guttural silent g and got the correct choice. This device is so seamless, I just love it and it's inexpensive too. Anyone who read the recent NYT review, it is false and misleading. The reviewer was annoyed that you had to press a button to activate voice search. I'm glad that you have to press the search key down to speak your search terms, if the bluetooth mic was always on, background noise and conversations would interfere with the search. The NYT reviewer also said that this device was an attempt to get you to buy more Amazon products. Well, if you don't pay $79 a year for Amazon Prime or subscribe to other online services, why would you buy an online video streaming box? If you are a Prime member you get 40,000 movies for free and don't pay any extra. O.K. enough of that. In summary, I love the device, I love Amazon Prime, and this device provides tons of viewing pleasure throughout the week.", "verified": true, "helpfulness": "23/25", "author": "MaryG \"MaryG\""}, {"rating": 5.0, "review": "It does what it says it will do... What more can I say?  Sets up easily without hastle, even setting up the Wireless Internet connection is automatic, and it works perfectly right off the bat.  The on-screen keyboard for entering passwords and searches is one of the most innovative and easy to use I've seen.  The voice (audio) search is excellent and requires no \"training\".  Perfect!!", "verified": true, "helpfulness": "6/6", "author": "Black Cat 27"}, {"rating": 5.0, "review": "I am very impressed. I bought this to replace a computer I was using for media in my livingroom. The Aamazon Fire TV is way smaller and the quality of video playback awesome. I would suggest buying this.", "verified": true, "helpfulness": "2/2", "author": "Moises cruz"}, {"rating": 5.0, "review": "I was an early adopter of the original Roku.  When it came out it did not support playing files through the USB port, HBO GO, or many of the apps that the Roku system now contains.Amazon has a solid product, intuitive, works as described, and has greater potential than Roku to provide better services.  I am a satisfied customer and look forward to what developers decide to do in addition to the excellent ecosystem experience.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "I have the lowest DSL speed, which seems to work fine with Netflix, but Amazon content keeps giving me an error saying I need a faster connection. If I could get a faster connection I would have happily done so years ago.", "verified": true, "helpfulness": "4/12", "author": "Larry D. Burks \"lb\""}, {"rating": 5.0, "review": "I have used most player and there just ok . This one is very easy to use and works great !  TRY IT !  YOU WILL LOVE IT !", "verified": true, "helpfulness": "3/3", "author": "desktopgeeks"}, {"rating": 5.0, "review": "I have been looking for perfect complete local and internet streaming box forever. The perfect box should have to play Netflix, HBO Go, Amazon prime and possibility to stream locally full Blu Ray rips. I had or still have WDTV, PS3, Xbox 360, PS4, Roku 3, new Roku stick, and now Amazon FTV. Neither box is perfect but so far Amazon's box is the best one.Pros:- Best picture quality period. According to internet \"experts\" digital signal should be the same on each playback device, well apparently quality GPU and output buffer still do make a difference. Last year I found that PS4 destroys any other device that I have or had in streaming picture quality. Now I found the same result with Amazon FTV. If you care for picture quality get this or PS4.- Fastest boot up, browsing, and stream buffering  speed(on Amazon video)- Finally responsive UI (outside of gaming consoles)- Stable OS so far (no resets)- Elegant, responsive, and quality Bluetooth controller- Simple appearance and small footprintCons:- The big one: HBO GO is missing. Hopefully they will add it sooner than later.- No local file playback- Just as on Roku, Plex does not support direct play of full Blu Ray rips.- Focus on Amazon video storeIn the end, the device is not perfect but is way better than any streamer at the moment. New Apple TV may or may not change this. For me Amazon FTV + WDTV would be the closest device to perfect media player.Also, If DD plus does not work for you, it is probably because your AV receiver is older one and does not support it (same thing with Roku).", "verified": true, "helpfulness": "6/6", "author": "P4ntera"}]