[{"rating": 5.0, "review": "Best device there is for streaming video. I bought two and I love them!The system interface is great and the performance of the hardware is impressive, when if comes to buffering your shows.", "verified": true, "helpfulness": "0/0", "author": "W. Barnett"}, {"rating": 1.0, "review": "My blue ray has most the same Video apps. I don't play games not sure what I was expecting. I can get the prime on'my device . Was not money well spent.", "verified": true, "helpfulness": "1/4", "author": "Larry T. Cupp"}, {"rating": 4.0, "review": "I have had the FireTV for about 2 weeks of good use. I like that I can go back to watch full episodes of TV programs that I missed or even watch a program from the beginning. Watching TV shows without commercials is like having a very large DVR. Being able to watch some newer movies is a plus also. Just wish there were more FREE stuff to watch. Maybe I need to explore some more to find the FREE stuff. Some of the games are outdated and you really need the game controller to play them. The remote just isn't the way to play games. It's slow to respond and some times doesn't respond at all. I guess I'll be spending the $40 for the game controller. (which I think is way over priced) The speech search has been great so far. It has heard everything I said with 100% accuracy. Give me a few more weeks of exploring and I'll update this feedback if need be.If it only had a couple things more it could be the best thing going since sliced bread.1) Be able to hook up an external hard drive through the USB port to store things or to watch your own videos2) Be able to use the same apps as those found on the Amazon AppStore3) Larger internal hard drive. 8GB isn't much when over half of it is used for the OS.", "verified": true, "helpfulness": "0/0", "author": "David Rogers"}, {"rating": 5.0, "review": "Works great and has a great picture.", "verified": true, "helpfulness": "0/0", "author": "Jason LeBoeuf"}, {"rating": 5.0, "review": "Best purchase of the year!  It was so easy to install and set up.  Being a Prime Member has it's benefits and it's a whole lot more than free shipping now!  TV shows, movies, exclusives and music.  This has it all and is a great alternative to costly on-demand movies and watching certain nights of TV that have nothing good to offer.  I have recommended this to quite a few people.The only thing that I would like to see Amazon consider is a lower price for watching non-Prime options, or offer a reasonable price to just watch a movie or series.  I'm not into buying movies and TV series; I rarely watch them again.  Not like music that you listen to over and over.", "verified": true, "helpfulness": "0/0", "author": "Colleen"}, {"rating": 5.0, "review": "Fire TV is awesome. The setup was so easy and within 5 minutes I was in awe of the quality, clarity and assortment of apps available. I am still waiting for the game controller to be shipped because its on back order so my family and I can play more games.  I researched all of the other available boxes on the market and my decision was based on the reviews and the amount of content on each.  The voice search is awesome. Im glad I got the Fire TV. Highly recommended.I do have to say I wish there were more popular gaming apps available and more variety in the movie selections for Prime members.", "verified": true, "helpfulness": "0/0", "author": "SD"}, {"rating": 5.0, "review": "Love it! What did I do before this?!?", "verified": true, "helpfulness": "0/0", "author": "Captain84"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "Ivan A Teets Jr"}, {"rating": 5.0, "review": "Received Fire TV as a gift and it is the gift that keeps on giving!!! LOVE, LOVE, LOVE!!!  Seamless streaming, fantastic content and the voice search is amazing.  I recommend this product most highly!!!", "verified": true, "helpfulness": "0/0", "author": "Mae"}, {"rating": 5.0, "review": "Works great. Easy to navigate.", "verified": true, "helpfulness": "0/0", "author": "Allyson Hodge"}]