[{"rating": 3.0, "review": "It was easy to set up, and works reasonably well with the services that support it.  Casting using Google Play Music on Android has an issue with locally stored music not being able to play (\"cannot play sideloaded music\" is the specific error.)  The Chrome browser extension that allows you to cast a tab doesn't work with services that use Silverlight (including Amazon Prime.)  Hopefully more services will add the casting function, and the unit will be able to handle locally stored media without having to open each item individually in the Chrome browser.People who already own another streaming player will probably find this unit doesn't offer a lot that they need at this point.", "verified": true, "helpfulness": "4/5", "author": "Lawrence Lamb"}, {"rating": 4.0, "review": "Just picked this up and it was a bargain with the 3 month free Netflix promotion they had going (I don't think you can get that any more).  I tried it the very first day it arrived and so far it works great.  Both Netflix and YouTube come through crystal clear, and I love the fact that you can continue surfing on your device while the content plays on your TV.  Been wanting to do that for ages, so that's a huge plus.I'd give it 5 stars if you could get Amazon Instant Video and HBO/Cinemax/Epix etc. apps to play, but Google was up front about them not working as of launch.  Setup was easy and definitely a good pick if you don't have an App enabled TV yet.", "verified": true, "helpfulness": "1/1", "author": "LittleMan"}, {"rating": 5.0, "review": "After having only used my Chromecast for a few hours, I have to say, Google pretty much hit a homerun with this little guy. After a slight hiccup with the setup process (I had something called Client Isolation enabled on my router, no idea what it is), I was able to get everything running great; I was streaming youtube, play music, and netflix instantaneously. The whole setup process was literally only like 10 minutes (including having to configure my router) from unboxing the Chromecast to streaming content on my TV. I did encounter a couple crashes when my brother tried to stream content from his iPad and his Galaxy S3, but to counter that I experienced no faults or hiccups when I was casting from my desktop Windows PC, Galaxy S Blaze, MacBook Air, and my Nexus 7. All in all, I'm extremely satisfied with how simple it is to get something on my TV from a swath of mobile devices and computers. Well done, Google. Well done.", "verified": true, "helpfulness": "1/2", "author": "Tim"}, {"rating": 5.0, "review": "It just works. Easy to set up and works for all my Android devices and IOS devices. At $35, it is a steal.", "verified": false, "helpfulness": "2/3", "author": "tockkim"}, {"rating": 1.0, "review": "pros :You tube app works fine.Cheap price.Cons:Tab casting is painfully slow. Videos can not stream fast.Doesn't support 5GHZLack of apps(I think right now only YouTube/Netflix works)Overall Roku/Apple TV does much better job(if you don't compare the price) Roku and Apple TV does what they say in the product specs but Chrome cast doesn't do what it say in the product specs. I think Chrome cast is a beta product.", "verified": false, "helpfulness": "11/47", "author": "Trinad"}, {"rating": 5.0, "review": "We do not have cable or satellite TV. We have 2 TVs in our house, one with an Xbox and one with nothing running to it. We could stream on the Xbox but now we can currently stream on both TVs. I literally just plugged this thing in and within a matter of minutes I was streaming Netflix/ YouTube on my TV that was just sitting there never being used. I would strongly suggest this product to anyone.", "verified": false, "helpfulness": "2/3", "author": "Daves23"}, {"rating": 4.0, "review": "I was excited when I read that Chromecast would allow me to cast anything from my chrome browser to the tv. Since I've already got a Roku HD Streaming Player (and because not everything I watch is on Netflix), that was really the only feature I really cared about. Given that I ordered early enough for the Netflix promotion, I thought it was worth the $11 investment.Despite my interest in casting Chrome from my computer, my first trial was casting Netflix from my phone. It worked beautifully, and I was very happy with my purchase... until I got around to casting from Chrome. That was an utter failure. We've got enough bandwidth that streaming video has never been a problem, either on the computer or through the Roku. But stream to the computer and Chromecast to the tv, and suddenly stops and starts so much, it's unwatchable. In the moments when it's playing instead or pausing, the video doesn't even match the audio.I still think the Chromecast has potential if more developers start incorporating it, and it works well if all you watch is Netflix and YouTube. But if you want to stream video via Chrome, Chromecast won't cut it.UPDATE: Just a few additional notes, based on comments posted by other users.1. Chrome tab casting is in beta. Thanks, for the reminder. Let's hope it gets better.2. Computer performance can significantly impact quality of casting. Our macbook is several years old, so that could be a contributing factor.3. Video quality settings can improve the performance. We tried the low resolution setting. It improved the performance but not to the point of making it watchable.SECOND UPDATE: I'm not sure if there have been upgrades to the firmware or if it's because I've been careful to make sure all other programs and browser tabs are closed before starting a video, but I've been having more luck with streaming video via Chrome. We use it regularly now, and, although it still has issues, it's no longer \"unwatchable.\" It freezes or produces mismatched video and audio most times we use it, but those issues rarely occur more than once (sometimes twice) in an hour-long show (I do have to restart the video whenever this happens). Given the problems we still have, we don't even bother trying the HD stream. But if other users are having trouble, definitely make sure your computer isn't trying to do anything else while Chrome is casting, and that may help. Although it's still not perfect, it's performing quite capably for a $35 piece of equipment.", "verified": true, "helpfulness": "597/760", "author": "Jordan Michel"}, {"rating": 1.0, "review": "They don't bother telling you this, but you can't set up a Chromecast if your router isn't uPnP-cabable. Unfortunately, AT&T; U-Verse's 2WIRE gateways are not. I'm extremely disappointed that they don't care enough to inform customers about obstacles that render their device completely useless.", "verified": true, "helpfulness": "42/106", "author": "Kevin Healy"}, {"rating": 5.0, "review": "This is everything the Nexus Q should have been. At $35, this is an impulse buy that everyone should consider. It is cross platform, and turns every TV into a smart TV. Limited app support right now, but with HBO GO, Hulu, Vimeo, and Plex coming soon, it will only get better. I have one in every TV and I am looking forward to testing it in hotel TVs.", "verified": true, "helpfulness": "2/3", "author": "Seth M."}, {"rating": 5.0, "review": "Now I can watch Netflix on the bedroom TV.  I have a PC and Roku hooked up to the main TV in the living room, so I don't really need a Chromecast there.  Netflix streams without any lag or slow buffering on this gadget.  One note, however, is that a strong Wifi signal is essential.  This seems especially important when streaming a Hulu video on a Chrome browser on my desktop computer.  There was too much lag and choppiness to be acceptable.  When I moved it closer to the router, there seems to be no more problems.  Great buy for around $10 (with the free 3 months of Netflix)!  Even for the full $35 price, I think it's worth it.  I see no advantages to getting another Roku given what the Chromecast lets me do.  Another thing I noticed is that when it is turned on (I usually unplug it when not in use), it takes around 4-5 minutes for other devices to recognize the Chromecast on the network.  Not sure if anyone else has this problem.", "verified": false, "helpfulness": "1/2", "author": "Amarillo by morning"}]