[{"rating": 4.0, "review": "I purchased this item without properly researching, shame on me.Full disclosure, you can not transmit pictures, video or music from your portable android device.  These media have to be on an approved web server (google+, youtube, etc...).  I have heard you can trick a laptop/PC to broadcast via a chrome browser, I haven't tried this yet.  I also see programs which you can buy and broadcast, I have not tried these apps yet either.The aforementioned aside, I like streaming netflix from my tablet/phone to my home entertainment system.  I can use my device as a controller (netflix/youtube/google music/etc), turn the device screen off, and still be able to watch the movie on my television.I have this device plugged into my home entertainment system receiver and can have my surround sound functional.I RECOMMEND THIS DEVICE!", "verified": true, "helpfulness": "0/0", "author": "Mr. Robert J. Miller"}, {"rating": 4.0, "review": "I use this to watch Netflix from my tablet in the bedroom.  Works great. Instructions were easy to follow.  No more fighting over the TV with internet access!", "verified": true, "helpfulness": "0/0", "author": "Leander Lady"}, {"rating": 3.0, "review": "Bought the Google TV Revenue a while now, it worked well for what we wanted it for but it was a bit bulky. So when i saw the small Chromecast, i thought it would be a great replacement for the Google TV, no so much. It has some features but limited to a few apps & websites. It requires using a computer, laptop or tablet unlike the Google TV that makes your TV in to a computer without the use of any other device. Like the concept but just which it did more.", "verified": true, "helpfulness": "0/1", "author": "Real Picky \"Fetti\""}, {"rating": 5.0, "review": "perfect gift for the holdays.  we bought ourselves this little fob as our family present.  it works great.  plug it in, follow very simple instructions on the setup web page, your done.  the Chrome add-on was easy to install.  we had to fiddle with NetFlix a few times to get it to work until we realized there was a 2nd Chromecast button in the browser we needed to click to start the casting.  It's been perfect.  How can anybody not like the price?", "verified": true, "helpfulness": "0/0", "author": "Craig D. Engel"}, {"rating": 4.0, "review": "Once I finally got it working,(no thanks to furnished instructions) it worked great. Resolution of You Tube clips on the TV screen  was actually much  better than on the PC screen. It was a good buy.", "verified": true, "helpfulness": "0/0", "author": "lenver"}, {"rating": 5.0, "review": "Setup is a breeze, this is the 3rd one I have ordered. If you don;t have a smart TV this is the best thing that has happened to home electronic in  a long time!", "verified": true, "helpfulness": "0/0", "author": "Carolus"}, {"rating": 5.0, "review": "Great product from google,Pros:Affordable priceVery handy to useExcellent and easy communication with other devicesAll the required accessories are included int he packetAll you need is a free HDMI port on your TV!", "verified": true, "helpfulness": "0/0", "author": "SHIBU T GEORGE"}, {"rating": 4.0, "review": "I think a lot of the negative reviews about this product comes from those who weren't clear on what the product is supposed to do... it casts video from your browser (or apps like pandora, Hulu, and Netflix) . With that being said, the chrome cast is pretty good at what it is SUPPOSED to do, not what people expected it to do that they didn't fully research before buying it. I give it 4 stars- it works awesome with supported apps but anything else freezes (ie. Trying to stream an online movie/video)", "verified": false, "helpfulness": "1/1", "author": "A. Boateng"}, {"rating": 4.0, "review": "When I use the iPad or iPhone to view videos and cast them to the Chromecast device - they all work great.  I do wish Google's competitive stance with other streaming video suppliers wasn't an obstacle, because there are some that simply won't work with it.  I suspect it is the streaming service, not Google that is the stick in the mud here.", "verified": true, "helpfulness": "0/0", "author": "PapaBear60"}, {"rating": 2.0, "review": "While the gadget was easy to install, getting it to work was another story. Tried the lap top (Windows Vista) net book (Windows 7) and the tablet (Android). Asked friends for help (NCSCA employee, CISCO teacher, IT worker at major medical center),all unable to get it to connect. All I wanted was to watch YouTube on TV, nothing fancy. Gave up and bought a Sony Blu-Ray, problem solved.", "verified": true, "helpfulness": "0/0", "author": "Eva Jehle"}]