[{"rating": 1.0, "review": "In one word: terrible.I have a Roku 3 and it is fantastic.  It has the Chromecast Youtube app and I have no problems with it.  Unfortunately I can't stream my desktop to it.The Chromecast drops connection constantly, restarts at times, can turn on a TV but not off.  It would be useful if I could listen to my music on it longer than 5 minutes.", "verified": true, "helpfulness": "0/1", "author": "Zach"}, {"rating": 5.0, "review": "The Google Chromecast HDMI Streaming Media Player is very good for streaming movies.  What I like best  about it is that you don't have to have a lot of bulky equipment.First, I had connected to my laptop; however, it tied up my laptop with the streaming and I couldn't use the laptop to check mail, etc. while watching movies.  So I connected to my tablet and the streaming is great.  I like the feature of using the tablet as a remote control when watching movies.", "verified": true, "helpfulness": "0/0", "author": "Carol A Carroll"}, {"rating": 3.0, "review": "I rented a movie on Google Play in HD & tried streaming it through Chromecast via my laptop. It buffered every ten to fifteen minutes. I should have bought the Roku Streaming Stick instead, although I might have had the same problem with that too. I am returning this product to Amazon for a refund and from now on will just use my HDMI Cable to play movies or TV shows on my TV via my laptop, which is fine. Chromecast is basically just a wireless HDMI cable is all. It doesn't even have a user interface or a remote. For $15.00 more I would buy a Roku Streaming stick (in the link below) which doesn't have ridiculous buffering times.http://www.amazon.com/gp/product/B00BGGDVOO/ref=as_li_tl?ie=UTF8&camp;=1789&creative;=390957&creativeASIN;=B00BGGDVOO&linkCode;=as2&tag;=dan010f-20&linkId;=NAY7ZD4IRWRFP7EF", "verified": false, "helpfulness": "0/0", "author": "Dan"}, {"rating": 1.0, "review": "chromecast sucks....", "verified": true, "helpfulness": "0/2", "author": "Aaron"}, {"rating": 5.0, "review": "LOVE it.", "verified": true, "helpfulness": "0/0", "author": "bb"}, {"rating": 4.0, "review": "Needs a few bug fixes", "verified": true, "helpfulness": "0/0", "author": "His Majesty"}, {"rating": 1.0, "review": "If i could give this 0 stars i would. I purchased the chrome for my boyfriend for Christmas. He has used it two times and the gold part on top just completely snapped off. t. He used it December 26,2014 and again on Sunday January 12, 2015. Not even a month has past and it is already broken. it was used two times. I would like someone from the company to contact me immediately to resolve this.", "verified": false, "helpfulness": "0/3", "author": "katelyndeeeee"}, {"rating": 5.0, "review": "Great!  Love it!", "verified": true, "helpfulness": "0/0", "author": "Carol Mindlin"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Brian MacKendrick"}, {"rating": 5.0, "review": "A very good product for the money, well worth it as a small media center!!", "verified": true, "helpfulness": "0/0", "author": "rastko"}]