[{"rating": 2.0, "review": "where is the $39.00  fire fly that was on at Christmas time by Amazon.", "verified": false, "helpfulness": "0/3", "author": "h100"}, {"rating": 4.0, "review": "I have this a roku 3, chromecast and now this.The roku was easy to set up.  Plenty of channels.  The best part is that it has a headphone jack which allows you watch/listen to a tv show and do the dishes late at night without having the tv way too loud.Chromecast.Most difficult to set up.  Has the worst quality.  I bought this so I can watch nfl rewind.Fire TVPerfect for plex.  If anyone has Plex I would get this.  The voice searching works most of the time, if it doesn't work the first time it'll work the second time.  2 voice searches is faster than any other type of searching.  My 4 year-old can search for Curious George!I understand that the roku has more channels but this had all I needed.", "verified": true, "helpfulness": "0/0", "author": "onlyme"}, {"rating": 5.0, "review": "The speed of downloads is super. The ease of navigation and setup is very good. The remote works well, but I still am going to see if my Logitech universal remote works as well.", "verified": true, "helpfulness": "0/0", "author": "DEguy"}, {"rating": 5.0, "review": "This device is a good deal. Provides access to a wide range of Amazon videos and movies and if u have Amazon Prime many shows are free. While the coverage is not as extensive as what u get with Apple iTunes (for xample YouTube is not offered) you have access to Netflix and Hulu+. However, Amazon offerings are quite extensive, especially movies and streaming video and, I might add, the Amazon remote is a bit easier to use than the one provided with Apple. In conclusion I think that Amazon Fire TV has a slight edge over apple especially for customers who have Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "A. Yiannakis"}, {"rating": 3.0, "review": "It is so easy to use. I am disappointed on that there are not more free movies.", "verified": true, "helpfulness": "0/1", "author": "baw"}, {"rating": 5.0, "review": "We absolutely love this! We got it as a christmas present from a relative and are completely satisfied. No complains whatsoever.", "verified": true, "helpfulness": "0/0", "author": "Tara"}, {"rating": 4.0, "review": "My mother loves it. She binge-watched House of Cards in two days. The set up was easy, even though Netflix gave her a little trouble (there was a system update required). She was hesitant about using the voice search, but after easily finding her shows, she loves it. She's now considering giving up her $215/mo cable.", "verified": true, "helpfulness": "0/0", "author": "KkUu"}, {"rating": 3.0, "review": "Good product, It's works well with my projector and speakers.However I am sorely disappointed that the voice search only brings up amazon instant results that you must pay for.I have mine rooted, running netflix/popcorn time.", "verified": true, "helpfulness": "0/1", "author": "Louis Monday"}, {"rating": 5.0, "review": "Loving my Amazon fire tv box. So easy to use. Netflix is improved; it will auto play the next episode if you're watching a tv series. Great to have the ease of access to Amazon prime videos as well. Not likely to use for the games that are available.  Box takes advantage of the high quality picture on our HDTV. Beautiful!", "verified": true, "helpfulness": "0/0", "author": "Chiefs wife"}, {"rating": 5.0, "review": "Everything I hoped for! (Captions/3D Compatible w/LG 3D TV, Current Shows onnext day!)", "verified": true, "helpfulness": "0/0", "author": "Scott W Stewart"}]