[{"rating": 4.0, "review": "Easy to install and voice recognition feature is excellent. Should have purchased the gaming control with my initial order. I took advantage of the free month of PRIME. I am hoping that if I cancel PRIME I will still be pleased with the selection of movie and TV shows.", "verified": true, "helpfulness": "0/0", "author": "Jilayne"}, {"rating": 5.0, "review": "Must have!", "verified": true, "helpfulness": "0/0", "author": "Adam Contreras"}, {"rating": 5.0, "review": "So far it's everything I expected. I'm no stranger to TV apps, been a Visio television owner for several years. The experience on Fire TV is definitely far improved and the voice search is what TV apps have been missing for years.Paired with Amazon Prime and Sling TV, there is no shortage of things to watch, but add in all of the other apps available and games this thing should keep us occupied for some time. Definitely worth the early termination charge to cancel my satellite service, plus I'll save over $700 net this year.", "verified": true, "helpfulness": "0/0", "author": "K. Cole"}, {"rating": 5.0, "review": "Excellent choice for a media player, very versatile and paowerfull hardware, no to mention the android platform, however they should be more open to install android apps and, they should unlock more the box that has a lot of potential as a media center.", "verified": true, "helpfulness": "0/0", "author": "Hernan"}, {"rating": 3.0, "review": "I want to give it a 5 star rating, but after using it once, its now a pretty black brick.  I will say this, it was extremely east to set up, performed flawlessly, and the user interface was intuitive.  Unfortunately, after using one day, then trying again 2 days later, it seems to be dead.  No light, no response, no good.  Will contact support.", "verified": true, "helpfulness": "0/0", "author": "Mark A Scott"}, {"rating": 3.0, "review": "My husband got these on his account.  First mistake. Amazon needs to really step up their Customer service game if they want to be a content provider. If the physical ip address is at the same location, I should be able to access my account too. Netflix doesn't find this that hard to do.  So what's up Amazon? Link the accounts? Sheesh.For the most part we've been happy with the use of it.  However one of the mainstays Hulu is starting to really give us grief.  Though with some trouble shooting we determined it wasn't Hulu itself that was the problem. We have it also on our xbox and it works fine there.  It's hiccuped several times and then kicked us out, making us watch the same ad 3 x without even the gratification of a show.  If Amazon doesn't start developing better communication, they are only going to be a shipping house and not a content provider.", "verified": false, "helpfulness": "0/1", "author": "KH"}, {"rating": 3.0, "review": "Easy setup, vids roll immediately. Excellent quality on my 52 via the HDMI. Pro sound output. Hardware is correct, quality up to the task.Connections are firm, confident.Lots of content with good deal Prime, Nice quality feel hardware, nice simple remote, voice command actually works. Surprise.Second surprise is excellent amazon created material. Well done.  Apps install easily, run fine.Vids stutter on WiFi, spinning balls of WAIT. No issue on the  wire. Plan on wire.Overly fancy packaging, a hint of  Applista in$pired flaws.. \"I didn't come here for abuse\".  \" Oh, I see, Argument is down the hall to the right\"Acks:1)  Will not stream files from network/PC. Why?  Am I missing something? Is there an app for that?  ??2) Can not even download free apps without a registered credit card.Opt out of that should be available..3) Inevitably I click an Icon that leads to  \"enter cable co info\". Stting\" Got Cabvle? Yes No. the bait disappears, please?It is a poke in the eye, each time. Stop it.4) Related to 3 above, Lacks live weather/news stream. Folks who have cable will not miss this, but I have been a cutter for 10 years.Live feeds are the one thing I miss.5) limited on board storage, Likely will prove an issue for gamers. Will evidently not access external USB drive? Correct? Is there an app for that? What is the USB connector for?All in all, almost all the way.  Babe Ruth, reduced to a 250 hitting shortstop who makes errors in the bottom of the ninth, because the manager requires him to play wearing a blindfold.Fix it please? Instead of intentionally breaking it . Like i saisd, if i wanted apple, i would have bought Apple.It would blow up everything else out there if you did.As it is, I require  second solution, and the opening is there for me to move to One that gets it all done.later.", "verified": true, "helpfulness": "0/2", "author": "id8"}, {"rating": 4.0, "review": "It's a great product, and so far, we're pretty impressed with it.I would have given this 5 stars, but I think Amazon.com fails on this.  The day after I purchased it, Amazon puts it on sale for $15.00 off.  I think, after all these years of being a good customer of Amazon.com, and a Prime customer since Prime began, that I would have gotten a courtesy notice that the item was going on sale, and give me the choice to wait a day or two to order before handing over the full purchase price.", "verified": true, "helpfulness": "0/1", "author": "Charlotte Acha \"Axe's Rattt\""}, {"rating": 2.0, "review": "Every time I try to watch a movie it buffers every 2 minutes", "verified": true, "helpfulness": "0/0", "author": "PAULINE A ADLAM"}, {"rating": 5.0, "review": "Love Amazon fire TV. I like it because my Netflix, Hulu, and Amazon accounts are all located in one central location. I just wish that it had a power button. it's supposed to shut down after 30 minutes of no use, but I've noticed that if I don't go back to the home screen it will still be on the next day. Concerned about product life with this type of function.", "verified": false, "helpfulness": "0/0", "author": "derrian stanley"}]