[{"rating": 5.0, "review": "Works great with the cell phone and the computer. The TV hook up was very easy and it goods great.", "verified": true, "helpfulness": "0/0", "author": "Steve Montgomery"}, {"rating": 1.0, "review": "Worked fine for 3 weeks, then quit.  No way to contact customer service that we could find - no info about warranty.  Complete waste of $35.00", "verified": true, "helpfulness": "0/2", "author": "john drew"}, {"rating": 2.0, "review": "You need to have a very strong Wifi signal in order for it to work but once it does - works well.", "verified": true, "helpfulness": "0/1", "author": "cmt"}, {"rating": 5.0, "review": "I like the cutting edge technology. The setup was a breeze and worked right out of the box. I can't wait to see the added supporting apps.", "verified": true, "helpfulness": "0/0", "author": "todd & kate \"todduh\""}, {"rating": 5.0, "review": "Very good product.The flash drive works fine, I'm really enjoying it.I have nothing more to say about it.", "verified": true, "helpfulness": "0/0", "author": "claudio schwabacher"}, {"rating": 2.0, "review": "I bought this a couple weeks ago, once HBOGo was officially advertised as being supported.I get to see a few episodes and movies of HBOGo casted to my TV, but in more than often occasions, I also get an error message, or the cast will just not start.There is no instruction booklet, no support, or no customer service to ask for assistance on when this device is not working.Not very happy with this purchase.", "verified": false, "helpfulness": "0/1", "author": "William Webb"}, {"rating": 5.0, "review": "Had to come back and get two for the kids. They absolutely love this. From broadcasting youTube videos, games, to Netflix.", "verified": true, "helpfulness": "0/0", "author": "Kdc1595"}, {"rating": 5.0, "review": "Really inexpensive considering the usability, it does what it says. I'm really happy with my purchase. More words required for the review... done.", "verified": true, "helpfulness": "0/0", "author": "ndh"}, {"rating": 1.0, "review": "This device is worthless for my system setup.  Although it says that it can connect with \"hidden\" networks that do not broadcast the network name, it does not.  I've tried to set it up via an IPad, a PC, & a laptop and it failed each time.  It WILL connect to my network if I turn on broadcasting of the name, but I choose to not do that.  All other devices that I have (iPad, laptops, Kindle, etc.) have no problem connecting to my network.  I do have the latest Chromecast firmware and the latest versions of the setup program.", "verified": true, "helpfulness": "0/2", "author": "MFA"}, {"rating": 2.0, "review": "I did not find this easy to plug and play.  I had to by an HDMI switcher and cable to add ports.  Then once I got it installed and loaded on ipad, the Youtube video had no sound.  Not a lot of other options either so I am going to get an Apple TV.", "verified": true, "helpfulness": "0/2", "author": "Tamara Marson"}]