[{"rating": 4.0, "review": "Haven't used it yet, but set up was super easy!", "verified": true, "helpfulness": "0/1", "author": "GrungeGirl314"}, {"rating": 5.0, "review": "This is a wonderful product, however I return because I have a smart TV and this did not really do anything different except that it sounds louder and netflix worked much better and smoother otherwise I did not need.  I would but in the future if things changed on my end.", "verified": true, "helpfulness": "1/9", "author": "HB \"Black Beauty\""}, {"rating": 5.0, "review": "I really love my Fire TV.", "verified": true, "helpfulness": "0/2", "author": "Christy J. Wrenn \"Academic Book Lady\""}, {"rating": 4.0, "review": "Even with book I bought, hard to follow; what I've been able to see, Ihave liked; watched two seasons of Orange is the New Black...hooked.", "verified": true, "helpfulness": "0/5", "author": "Deb V."}, {"rating": 3.0, "review": "Ok so far.  However, voice search does not consistently search Hulu Plus.  When I search for Daily Show or Colbert Report, only Amazon Prime and Amazon videos come up.  Other shows do show up as watch on Hulu. The inconsistency is frustrating.", "verified": true, "helpfulness": "0/2", "author": "Jeremy T Seeman"}, {"rating": 5.0, "review": "Much faster than the access through my blue ray player or tv. Virtually no streaming pauses. I'm not thrilled with the menu, seems it could be less cumbersome, but I can deal with it. Overall I like it.", "verified": true, "helpfulness": "0/0", "author": "b. gamer"}, {"rating": 5.0, "review": "We have had this for several months now and LOVE IT. If your a prime member you should have a streaming video component and this is the one we would highly recommend. The only thing I dislike about it is that we didn't get one a year or so ago when we first became a member of Prime.", "verified": true, "helpfulness": "0/1", "author": "Keith L. Tripp \"Traxterhitlist\""}, {"rating": 5.0, "review": "Love the ease of setup and access to my Prime videos, Netflix and more. Had no issues with setup. The voice search works fast and even impressed my Apple son-in-law.", "verified": true, "helpfulness": "0/0", "author": "J. Kopchok"}, {"rating": 4.0, "review": "Great for watching Amazon Prime, NetFlix, and Hulu Plus but lacks a lot of the additional channels/apps that a Roku has to offer. The Fire is much snappier than the Roku 3 that I had previously used and I love the picture quality of the streaming videos. Comparing it to streaming on a smart tv or bluray would be like comparing a horse and buggy to a Cadilac. I have not tried the games but they seem like a nice addition to a pretty capable device. If you just want NetFlix, Amazon Prime, and Hulu Plus videos this is an excellent device that will last for years. If you are looking to stream everything the internet has to offer you may want to wait for the Fire to catch up to its competitors in app offerings or go with a device that doesn't perform as well in the short term.", "verified": true, "helpfulness": "1/1", "author": "Josh"}, {"rating": 2.0, "review": "Add a headphone jack to the remote and I will buy one.", "verified": false, "helpfulness": "1/14", "author": "Barry in MO"}]