[{"rating": 5.0, "review": "The device arrived quickly, nicely packaged and in great shape.  We basically just hooked it up and plugged it in as directed.  It was already set up for our account, so we could immediately use it with our wireless service.  It works pretty intuitively, and we were really happy with the voice search feature - so simple to use.  Movies downloaded very quickly.  The ability to put our pictures on the TV (through amazon cloud, as per simple directions) was a big bonus! We're very happy that we made the purchase - well worth it!", "verified": true, "helpfulness": "1/1", "author": "DMS"}, {"rating": 5.0, "review": "I absolutely love Amazon Fire TV!!! It is so great being able to watch all the movies and TV shows I get with my Prime membership now on my TV instead of my computer or tablet. It is such great quality picture! The install was super easy (a 2 step process) just plug in power and HDTV cord and off I went on setting it up. If you already have an Amazon account, set-up is pretty much all set, you just have to connect to WiFi!I would recommend this to anybody!", "verified": true, "helpfulness": "2/2", "author": "Coutry1621"}, {"rating": 4.0, "review": "Amazon fire tv does exactly what it says it does and does it well.  I am surprised at the speed and ease of use of the unit.  It is so easy that my 2 yr old can press the button and tell it what show he wants and it goes there.  Only disappointment is the remote.  I want the remote to have more functionality such as volume control and power.  I would also like a linked app that I can use to control the device.", "verified": true, "helpfulness": "0/0", "author": "matt"}, {"rating": 5.0, "review": "Love it. Great apps to choose from as well as the Amazon movies. I can always find something interesting to watch, no matter the time or day.", "verified": true, "helpfulness": "0/0", "author": "L A Holdridge"}, {"rating": 5.0, "review": "I love it!  The voice command to the remote doesn't work great, but everything else about it is awesome.  It is much nicer to use my bigger TV for this stuff than use my laptop.", "verified": true, "helpfulness": "0/0", "author": "Krys413"}, {"rating": 5.0, "review": "I would like to purchase Amazon Fire TV but I need to know if it works out the USA or only in the USA. I live in Central America.Some body wknows about it.", "verified": false, "helpfulness": "1/3", "author": "J. C. Barbero \"de leon barbero\""}, {"rating": 4.0, "review": "I am a little disappointed that I have to use three remotes to use this ... one each for the tv, cable, and the fire tv.  Also one of the series I as catching up on over the years, I noticed that last year's shows requested that I pay for each show.  Other than that, it is fine.  Just have to get used to that.  I haven't tried using my kindle or computer with it yet tho.", "verified": true, "helpfulness": "0/0", "author": "Brandi"}, {"rating": 5.0, "review": "I have been shopping on Amazon for over 10 years, and I've never written a review for a product before.  But the Fire TV is such an amazing product.  I had purchased a Chromecast last year for the bedroom, and it was just awesome for what we needed.  When the Fire TV came out, I thought I would give it a shot and put it in the living room.  Boy was I surprised.  This thing tremendously exceeded my expectations.  It has been so easy to use, that I now look at the Chromecast in the bedroom with despair.  We are considering getting a second Fire TV to replace the Chromecast in our bedroom.  I highly highly recommend this product to anyone that likes streaming Netflix, Hulu, Amazon Instant Video, etc...  This product is just too good to pass up.P.S.  This is the first product outside of the Netflix webpage app that I've ever seen do auto-play, which has always miffed me about all of my other streaming devices.", "verified": true, "helpfulness": "1/1", "author": "Robin Reigstad"}, {"rating": 4.0, "review": "i have a trouble because various app dont working,wwnetwork,youtube,all disney app.and i got the apple tv too and this app working perfectly.please help me with that.", "verified": true, "helpfulness": "0/0", "author": "Mariano Gutierrez"}, {"rating": 4.0, "review": "Better than  chromecast and the others. What gets me is that I wish I could surf local channels across USA here. There are apps to add for tv like shows but needs to expand choices so as to be worthy of the price and lure sensible people away from cable forever.", "verified": true, "helpfulness": "0/0", "author": "kevin"}]