[{"rating": 5.0, "review": "Purchase for elderly patents to more easily navigate videos,all are very happy with purchase.", "verified": true, "helpfulness": "0/0", "author": "Kristi Kelly"}, {"rating": 5.0, "review": "Easy to use lots of content", "verified": true, "helpfulness": "0/0", "author": "Rafael N"}, {"rating": 5.0, "review": "I purchased the Amazon TV about a month ago. I've owned the apple TV for a couple years. I must say, there is a big difference between both devices! You won't know how limited the Apple TV is until you have the Amazon Fire! You can still airplay on the Amazon Fire from your Apple device as well! (Of course you will have to download the app) There's so much you can do on the Amazon Fire, there's even games you can play by yourself or with a group of friends! A definite must-have for all Amazon Prime members and those wanting more from their Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Crystal N"}, {"rating": 5.0, "review": "I have a 2013 smart TV...this is faster than the smart tv....hands down!! If u are tired of slow loading speed and u are a prime member this is the way to go. I know every device streams Netflix and prime these days. But this menu and interface alone is worth the price. Even the voice recognition is quicker than my TV. No insult to Samsung but they need to partner up with a streaming box and get a lot faster. If you are on the fence about choosing weather to go with the fire tv or fire stick. Ask youself do i like instant gratification? Do i hate the buffering circle? then the choice will be clear. GO WITH THIS ONE!!  Ohh btw i heard this device pre-loads all the prime content. So if you watch prime content it's that much quicker on startup.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "So easy to install!  The variety of programs is great.  Plus, the system suggests programs you might want to view based on previously viewed shows.  Love it!!", "verified": true, "helpfulness": "0/0", "author": "Ellen"}, {"rating": 5.0, "review": "Only problem is that there does not seem to be as much as I would like to watch included in the Prime membership.  There have been shows we started watching for free that were not free a couple of days later.  Since I don't watch a lot I do not know if this is normal.", "verified": true, "helpfulness": "0/1", "author": "Sarah"}, {"rating": 5.0, "review": "It works great! I have never had any luck getting Netflix to play well on any device except for my Wii. This plays very well, and also plays Amazon Video well, too! I couldn't even get good playback for Amazon on Kindle Fire! Amazon Fire is great for other video options as well. It also is very user friendly, and I really wasn't expecting that to be true! I was extremely pleasantly surprised. Simple set up,too. Well worth it!", "verified": true, "helpfulness": "0/0", "author": "Shelly W. \"Shelly Wilson\""}, {"rating": 4.0, "review": "This is a good device. It offers a break from the mind numbing broadcast TV without committing to an additional monthly expense.", "verified": true, "helpfulness": "0/0", "author": "Ed \"K.Tenzin Drakpa\""}, {"rating": 4.0, "review": "Easy installation and utilization, however not all items were available without further expense which was inconsistent with original representations.", "verified": true, "helpfulness": "0/0", "author": "Susan B. Driggers-Hord"}, {"rating": 4.0, "review": "Amazon Fire TV is easy to use. The voice recording is helpful. The only disappointment is the number of 'Prime' movies and TV shows that are available.", "verified": true, "helpfulness": "0/1", "author": "M"}]