[{"rating": 5.0, "review": "I dont use it a whole lot but when i do im very thankful for it. Only beef i have with it is that the quality on the screen dosnt come out as good as i would like it to but that could have something to do with my wifi.", "verified": true, "helpfulness": "0/0", "author": "Matthew Meredith"}, {"rating": 4.0, "review": "I love this product makes it so easy to cast to your tv . The  negative thing I found was certain formats like avi videos won't cast and I can't cast web pages from my Android tablet, if it did this I'd give it 5 stars anyway I'm going to still buy 2 more of these.", "verified": true, "helpfulness": "2/2", "author": "christopher allen"}, {"rating": 4.0, "review": "I really like Google chromecast. It could be much better if it had bluetooth capability to stream directly from your device in addition to wifi. For example, you can't use this at a hotel because of the requirement to enter a password for the hotel wifi. Also it would be nice to be able to stream everything rather than just certain apps that Google allows. I only use Youtube and Netflix.", "verified": true, "helpfulness": "1/2", "author": "C. Keebler \"Hooyahdiver\""}, {"rating": 5.0, "review": "I've been debating whether or not I should get one of these for a long time and finally gave in. I don't regret it for a second. It was set up in less than 10 minutes and guided me step by step through the process. What surprised me is that you don't use a remote or chromecast app. You use the actual netflix, hulu, pandora. etc. apps and can transfer the video/audio to your tv when you like. That is awesome because it allows you to play something on netflix, send it to chromecast, and then do other stuff with your phone (like wathc a youtube video). I didn't know that I could watch youtube on chromecase either. As a german immigrant, i can now watch hundreds of german shows on youtube. Get yourself one of these and don't look back!", "verified": true, "helpfulness": "1/1", "author": "Infinity9610"}, {"rating": 5.0, "review": "This product in excellent!easy to install, easy to use, very usefull.And the price is very good: U$S 35!", "verified": true, "helpfulness": "0/0", "author": "Marcelo"}, {"rating": 5.0, "review": "This little device is such a great and convenient piece of technology.  I was finally able to stop having to use my HDMI cable and my laptop to stream videos to my TV.  It was rather unsightly having my laptop next to my tv.  I have not had any problems streaming to this device, using windows, macs, or linux.", "verified": true, "helpfulness": "1/1", "author": "Host"}, {"rating": 5.0, "review": "This product was recommended by a friend we enjoy seeing Netflix and youtube on our tv. Very easy to use", "verified": true, "helpfulness": "0/1", "author": "yicell martinez"}, {"rating": 5.0, "review": "Great.  I use it all the time glad I got it.  I have not had any problems with him yet.", "verified": true, "helpfulness": "0/1", "author": "Gerald Ledford"}, {"rating": 5.0, "review": "great love it, beats cable bill by far.  if you don't want cable bill, get it and netflix, hulu at radioshack, much cheaper", "verified": true, "helpfulness": "0/1", "author": "Joanna"}, {"rating": 4.0, "review": "Video cuts out every few minutes when watching netflix and it seems the chromecast reboots all the time. After I plug the USB to a separate wall charger, it works fine now. It may be that the USB port in the TV is not able to power the device.", "verified": false, "helpfulness": "1/1", "author": "dandandelion \"dandandelion\""}]