[{"rating": 5.0, "review": "Not a day goes by that this is not used.  Love having friends and family over, we all connect and push YouTube videos to it and laugh for hours!", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 2.0, "review": "It's okay, if you want something portable and like using your phone as an input device. Personally I don't like the phone setup.", "verified": true, "helpfulness": "0/0", "author": "mayjalook"}, {"rating": 1.0, "review": "This product only lasted me 6 months before it stopped working. I am now unable to return it and stuck with a piece of junk.", "verified": true, "helpfulness": "0/0", "author": "gisselle gavarrete"}, {"rating": 3.0, "review": "It doesn't stream 80% of the time I try to use it. I get a can't find message all of the time and then after I restart my computer it will work again.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Hatfield"}, {"rating": 1.0, "review": "Doesn't work well with apple products, can maybe stream 2% of the content on your phone.  Then when it does stream it does not stream what you see on your phone, it just plays the video from the start.  This means is you want to pause or fast forward the video you can't!It specifically will not let you watch your pictures, surf the web, facetime, or facebook from your phone to tv.  I tried some some workaround apps to achieve these goals but ultimately came to the conclusion that the product is just junk.", "verified": true, "helpfulness": "0/0", "author": "MommyTara"}, {"rating": 2.0, "review": "The idea sounds great. Bought it and easy to link to it from my wifi.. For some reason, it is soooo slow to cast a show from Netflix to it. It takes about 20 minutes of frustrating turning off and on. Even pulling the power out and plugging it back in. It doesn't seen to play the Netflix video from the Ipad or Iphone on command. After turning off and on so many times, it would play. When it does play, the picture is perfect. I love it. But after watching a show or after 30 minutes, you want to go back to your Ipad or Iphone to turn it off. You can't find it on your device. Best way to turn it off would be to unplug the power cord if you do not want to lose where you previously watch..Still not there yet.", "verified": false, "helpfulness": "0/0", "author": "Thy Vu \"Thedaynearby\""}, {"rating": 5.0, "review": "Excellent product.  Had a bit of a challenge setting up with a Comcast router, but that was old Comcast router equipment issues, not Chromecast issues.", "verified": true, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "enjoying my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Teresa G. Williams"}, {"rating": 5.0, "review": "We love the functions of this product. The only downside is that the chromecast occasionally looses connection with our computers and stops casting. Other than that this product is really great for the price!", "verified": true, "helpfulness": "0/0", "author": "Tara"}, {"rating": 5.0, "review": "For the price you cant beat it... streams Youtube, netflix and hbogo on my tv.  Picture quality and sound are really good.", "verified": true, "helpfulness": "0/0", "author": "Dan J"}]