[{"rating": 2.0, "review": "Meh. I can send YouTube, Netflix, or Hulu to my TV with this device. Its underwhelming to say the least.", "verified": true, "helpfulness": "0/0", "author": "SC Sully \"CineCal\""}, {"rating": 1.0, "review": "so-- you can \"cast\" your google chrome web browser to your tv.... at a loss in speed, quality, and it often doesnt even function right.sound goes in and out. connection dies out of nowhere... good luck trying to follow some online instructions for how to watch your downloaded stuff on your tv. that rarely works.. there's absolutely no benefit to buying this stupid thing for any amount of money, you're better off directly connecting your device to your tv and buying whatever that takes- you can probably chip in a wireless keyboard mouse to help you out.this thing sucks.worst product i've ever seen from google.", "verified": true, "helpfulness": "0/0", "author": "Ro"}, {"rating": 1.0, "review": "Review title says it all. Revise the Chromecast firmware and iOS7 app to work with hotel logins and I'll rate the gadget *****", "verified": false, "helpfulness": "0/0", "author": "A. S. Templeton"}, {"rating": 5.0, "review": "I have used this to watch Netflix and it worked really great.  I have also used it to watch U  tube and enjoyed being able to see it on my tv screen.", "verified": true, "helpfulness": "0/0", "author": "Anne A Howard"}, {"rating": 3.0, "review": "Pros :  Price is cheap  multiple device can be connected to chromecast  from same network  lots of program recently available  Google opened adk so that third party software's are available like allcast which can cast your local phone videos,music and photosCons : sometimes it disappears from network displays on tv like its ready for casting but on apps like youtube you want have option to cast ,have seen this issue with my friends chromecast also so i belive its wide spread.", "verified": false, "helpfulness": "0/0", "author": "Rakesh"}, {"rating": 5.0, "review": "Absolutely love it! Works amazingly well with my samsung galaxy 3 tablet I can have my tablet using it in the other room while controlling what my kids are watching in the other room great apps on google play for it as well. Very thrilled with mine I am going to buy more of them for my other tvs.", "verified": false, "helpfulness": "0/0", "author": "Jadeeyes240"}, {"rating": 5.0, "review": "I like this item. The only drawback so far is there are not enough compatible sites on the web where it can be used. It does what it says though and watching a movie on 42\" is better than watching on 15\" or less.", "verified": true, "helpfulness": "0/0", "author": "memfisman"}, {"rating": 5.0, "review": "Loved it especially I used it for youtube videos, like a usb, convenient to carry to anywhere, worked with my iphone 5 really well, prompt delivery and good quality. Thank you!", "verified": true, "helpfulness": "0/0", "author": "Vanny"}, {"rating": 4.0, "review": "I love this. I wish I had gotten it sooner. The only thing keeping this from a five-star rating is the fact there isn't an easy or high-def way to cast local video from my PC.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Unless you have a great TV and good internet it will work. The frame rate and the streaming wasn't at its best for us and its probably because we didn't have the best TV. Itstopped working randomly when streaming from putlocker. Netflix was good but you might as well get a roku if that's all you need it for", "verified": false, "helpfulness": "0/0", "author": "TinselTopp"}]