[{"rating": 5.0, "review": "This is my fourth one. I consider it the minimum TV access for all of my systems. I do have some Sony BD systems and three Internet capable TVs, but none of them can compare to the capabilities of the Amazon Fire TV module!", "verified": true, "helpfulness": "1/1", "author": "Tom C"}, {"rating": 5.0, "review": "I already had a Roku 3 when I purchased my Amazon Fire TV.  I thought I had the fastest streamer available.  The Fire arrivedand opened my eyes to a new level in streaming speed.  Along with the speed, the Fire TV has a really sharp picture and great sound. The voice search on the remote has not failed me yet and is very accurate.", "verified": true, "helpfulness": "2/2", "author": "BernieMac"}, {"rating": 5.0, "review": "I love it, love it, love it...!!!", "verified": true, "helpfulness": "1/1", "author": "D. Davis \"xraydavis 2000\""}, {"rating": 4.0, "review": "I will end up buying a second or third one. A couple of times it has given me some trouble on the network, but often it was the fault of my router. The only thing I really can't stand is Amazon's insistence on forcing you to put your photos on the main menu. Also there needs to be an easier way to access third-party apps. Its bandwidth is very limited for buffering HD video, but given the circumstances (I am using this to run Kodi), I really can't complain. As long as Amazon doesn't mess with the hardware and continues to allow me to sideload my apps, I'm as happy as a clam and will continue to buy more. I love the fact that I can plug in a USB hub and connect my gamepad, mouse and keyboard.", "verified": true, "helpfulness": "2/2", "author": "Jon"}, {"rating": 5.0, "review": "I got this as a gift for my mother. She loves it! We both like how simple it is,  and the speech search is really easy.  And we don't have any connection problems. I'd definitely recommend it.", "verified": true, "helpfulness": "1/1", "author": "Gabrielle Lopez"}, {"rating": 4.0, "review": "Wonderfull product, but dont have Spanish Language", "verified": true, "helpfulness": "1/1", "author": "Arlene Arce"}, {"rating": 5.0, "review": "Bought two. Use everyday.", "verified": true, "helpfulness": "1/1", "author": "G. B. Cohane \"Apple_Fan\""}, {"rating": 4.0, "review": "My internet speeds are too slow for me to enjoy this!  Must have fast internet for this item!", "verified": true, "helpfulness": "1/1", "author": "Jeff"}, {"rating": 5.0, "review": "Love it, just wish that search didn't always bring up Amazon prime stuff first.", "verified": true, "helpfulness": "1/1", "author": "jeff patterson"}, {"rating": 5.0, "review": "Family room TV had mediocre internet capability (bought it 1 year too early).  Fire TV brought it into the modern world.  And the Netflix app is hands down way better than the Netflix app on the TV.Con:  It's now too easy to binge watch TV....:-)", "verified": true, "helpfulness": "2/2", "author": "Dan Danz"}]