[{"rating": 4.0, "review": "IT WORKS ONLY WITH U-TUBE FILES , OTHERWISE MUST HAVE A NET FIX SUSCRIPTION.YOU CAN NOT WATCH A COMMON VIDEO FILES", "verified": true, "helpfulness": "0/3", "author": "Brandes Enrique \"ENRIQUE BRANDES\""}, {"rating": 5.0, "review": "Worked completely and as easily as advertised with a very acceptable price.  This simple to use item will save all of us that bought flat screen TV's early on the price of upgrading them.", "verified": true, "helpfulness": "0/0", "author": "Mark Miles"}, {"rating": 1.0, "review": "I was waiting to have this item for a long time, finally arrived and on first use it was amazing. Later began having an issue were the screen flickers... later the screen was completely blank (no signal).. tested on 2 tv sets with same outcome. Some days later the signal came back and it's been working but the image is grainy so image quality is not as expected. I would love to have it replaced but Amazon says that as I took it away from the US I should deal with it... not what I would expect for a customer whose purchases can be counted by hundreds..", "verified": true, "helpfulness": "0/1", "author": "Carlos Chaves"}, {"rating": 4.0, "review": "Easy to connect. Limited number of Apps. It has a very limited number of app that can be used directly. The way around this is download the Chrome (browser) extension, it will allow you to display anything from your browser, directly on the TV. It is like having a giant monitor. There is a slight delay (less than a second) to get image onto TV when using browser mode.", "verified": true, "helpfulness": "0/0", "author": "A. Johnson \"AMJ\""}, {"rating": 3.0, "review": "I was disappointed to see the limited video formats that Google Chromecast was able to play from my laptop. This is because Chromecast only plays video through the Google Chrome browser which can't play .avi, .wmv, .mkv and many other video formats. To date, the only video format I can get it to play is .mp4.There is an option (still in beta) to cast your desktop. This allows you to play any format video in a usable application on the desktop and cast it to Chromecast but the video lags the audio by so much that it makes it unbearable.Google Chromecast has no security. This could allow anyone with the right knowledge to see your network.", "verified": true, "helpfulness": "0/0", "author": "grommetik"}, {"rating": 5.0, "review": "I can watch it now bringing Youtube clips and even movies to the screen.My kids love it as well.The interface is better than simple - it does not exist at all on that device.10 seconds after I turn TV on Cromcast is on and ready to accept video.Now it is all about interface Android or Apple versions of Youtube have for it. And it works marvelously with both Youtube versions in my home.I do not have Netflix account and can not judge its performance when showing Netflix.Same goes for Hulu and many other services announced as already streaming to this device.But I am looking forward for the upcoming wave of new Cromcast ready services Google hinted about for 2014.", "verified": true, "helpfulness": "0/0", "author": "Lenny Sh \"Lenny\""}, {"rating": 2.0, "review": "I was pretty happy with the device, which was working fine using several devices Apple OS, Android, Windows. But since the upate it started having problems with the connection, requiring a reset.If I were within the return window, I would definitely  return it.", "verified": true, "helpfulness": "4/4", "author": "NorthEastern56"}, {"rating": 1.0, "review": "Can't get it to work - directions not easy to follow-bad purchase choice-web site should be easier to follow-read reviews, other people having same problems.", "verified": true, "helpfulness": "0/3", "author": "Kathy A. Sperl"}, {"rating": 5.0, "review": "I love it. Just as simple as that.If you`re no sure about buying it, don`t think too much about it, just do it.", "verified": true, "helpfulness": "0/0", "author": "Angel Pacheco"}, {"rating": 5.0, "review": "I have Roku, but I got this for HBO GO and it was worth it. I love this little thing.", "verified": true, "helpfulness": "0/0", "author": "Statuewon"}]