[{"rating": 4.0, "review": "Good but needs more apps", "verified": true, "helpfulness": "0/2", "author": "K z"}, {"rating": 5.0, "review": "Didn't know what to expect but I love it.  I signed up for Prime aslo but saw little advantage to me because every movie I wanted to watch I had to rent. Didn't like that, netflex seemed a better deal at $7.99 a month with a better selection of free movies.  Had no use for 2 day shipping, music, or watching movies on my computer.  Movies that have been on cable for a month now was free and prime charged $3.99 , not good for me.", "verified": true, "helpfulness": "0/0", "author": "Peter Zguzenski"}, {"rating": 5.0, "review": "Wow great video quality...  Amazon prime all the way, great video quality, great family and kid friendly choices.  I also have xbmc installed, so we can watch our backed up move vea network.  Router with usb port that is.  Great pics, you can push video and pics from other devices.  Amazon has great apps, that are user friendly, work well with tv box and there remote.  Setup was to easy....  Get prime account, a no Brainerd.  You get free video, movies and shows with prime, and also free shipping on 99 % of things you buy on amazon.  I even got mom 1 of these.  I also have setup fire tv for a few of our friends and family.", "verified": true, "helpfulness": "0/0", "author": "James G."}, {"rating": 4.0, "review": "I would give it five stars if it had a way to control picture quality or bandwidth usage. If you have a limited amount of monthly data usage, it would be nice to be able to reduce the amount it uses. The picture quality is excellent, even at a reduced rate, which I am having to do through my router.", "verified": true, "helpfulness": "0/0", "author": "Ronnie L. Richards"}, {"rating": 1.0, "review": "Not really a bargain, roku2, pay for prime, pay for box, not worth it, and no employee discount. Quit being greedy.", "verified": false, "helpfulness": "1/11", "author": "jose lopez"}, {"rating": 3.0, "review": "I'm trying to use this but have too much trouble finding my Netflix which I've found on these reviews Amazon does not allow us to use. I have to reconnect my Roku2 to my tv again. It's so easy to use Roku. It also is to late to return my Amazon Fire TV by 6 days so I'm stuck with it and not happy.", "verified": true, "helpfulness": "1/4", "author": "Callia"}, {"rating": 1.0, "review": "Tried for forty minutes with support by telephone. I explained the remote doesn't work. New Batteries  (three checks to make sure I inserted them correctly. Powered down the box 4 times. Either the remote is faulty or the box is; there was Absolutely no activation. None. I received it today and will call tomorrow to return it. I hung up because I we frustrated that I could not understand the tech and he was not paying attention to what I was telling him.", "verified": false, "helpfulness": "2/6", "author": "Susan E Campbell"}, {"rating": 5.0, "review": "This device is awesome I own a roku but this device is so much better! The voice search is great and the games are awesome this isn't just a media device its a micro console. This device is totally recommended!", "verified": true, "helpfulness": "0/0", "author": "M. Scott"}, {"rating": 4.0, "review": "The Amazon Fire seem to be missing some of the apps that other similar devices have, but what it does have I enjoy.", "verified": true, "helpfulness": "0/0", "author": "Ben \"Benny\""}, {"rating": 5.0, "review": "It was far better then I had anticipated, so far we have been able to surf far more better than we did with the Roku player, We really are enjoying this item and would recommend this to all those who have high speed internet as it works great with. And so for it has also worked better than my Apple TV which we also own, so I have enough items to compare it to.", "verified": true, "helpfulness": "0/0", "author": "Bernie Tapetillo \"Old Europe\""}]