[{"rating": 5.0, "review": "At this price I don't see how anyone can go wrong with this. Now that the SDK has been released more and more apps are becoming available daily.", "verified": true, "helpfulness": "0/0", "author": "Justin"}, {"rating": 5.0, "review": "If you want to watch YOUTUBE, NETFLIX or another APP compatible with Chromecast, there is no better way to do it!PROS:Easy InstallPerformanceMultidevice (ANDROID, iOS, MOBILE,TABLET,NOTEBOOK)CONS:Not compatible with all the apps", "verified": true, "helpfulness": "0/0", "author": "F. REIS"}, {"rating": 1.0, "review": "I spent 3 hours today trying to install this device without success. I am in a concrete and steel apartment building that apparently blocks the Wi-Fi signal.", "verified": true, "helpfulness": "0/2", "author": "Diana C. Cook"}, {"rating": 5.0, "review": "Good product,works great. I purchased it on amazon as its was on sale for 30 dollars instead of 35. Got the deal.", "verified": true, "helpfulness": "0/0", "author": "anu's world \"ananya\""}, {"rating": 5.0, "review": "If you have any of the following and use them often:Netflix, Hulu, HBO GoPositives: Cheap, easy to use, multiplatform (iOS, android, windows, mac)I am not ashamed to say that I have bought 6 of them and last Christmas gave them out to my friends and family. They make amazing stocking stuffers. Chromecast at this stage are only going to get better. They recently have released their SDK software out and developer of apps will hopefully soon make their apps compatible.One of the few negatives I have with it is that streaming video from my laptop is pretty difficult at this point. I can do it if it's an mp4 (through chrome) or if I use plex but I want to be able to do it for all my videos without having to go a third party app. I think this will be quickly fixed by the end of this year when some enterprising developer will figure it out.", "verified": true, "helpfulness": "0/0", "author": "Tri Anything"}, {"rating": 3.0, "review": "It took some time but I finally figured it out.  I also figured that Google is watching what I watch on TV for Youtube marketing purposes.  Very interesting....", "verified": true, "helpfulness": "0/0", "author": "Brian64 \"Brian\""}, {"rating": 5.0, "review": "I really love this product for the price and it is really easy to use (Trust me if I can use it, anyone can!) I bought it for a retirement gift for a friend who loved it and I bought it for a Valentine's Day gift for my husband (he doesn't have to know it was only $35) We play photo slide shows on our 60\" TV and can really see the photos at that size.  I like watching You tube videos on it and also easily play Netflix movies from my phone or computer with it.  Another thing we do is have battles, yes battles with it.  My husband will put up a photo and I'll one-up it with a better photo or you-tube video.  My one hope is that someone comes up with an app to play videos using this awesome tool.", "verified": true, "helpfulness": "0/0", "author": "Craver"}, {"rating": 4.0, "review": "Pros:$35 to stream from any smart devise to a TV? Hard to beat if you're interested in that functionality.Cons:I was hoping to be able to use it in hotel rooms but connecting to a hotel network proves to be impossible if they require entering a user name and password on some \"portal page\".", "verified": true, "helpfulness": "0/0", "author": "Wyatt Andersen"}, {"rating": 4.0, "review": "It's great ... But it could be greater ... In Time!! It is an amazing piece of technology and is simply magic it just doesn't play everything on your phone ... But eventually it will! And for $35 bucks !!! You can't beat that !! Awesome!!  Can't wait to see the future !!", "verified": true, "helpfulness": "0/0", "author": "C. Pack"}, {"rating": 4.0, "review": "So simple. Works for most part. I had trouble sometimes with youtube queue. Closing/switching off everything and starting over again worked. It is annoying, but I am ok with it for the price and the function.", "verified": true, "helpfulness": "0/0", "author": "Senthil Chicago"}]