[{"rating": 5.0, "review": "A must.  Good product.", "verified": true, "helpfulness": "0/0", "author": "James T."}, {"rating": 1.0, "review": "by hardware doesnt matter which one you buy.  but softwares are horrible every one apple or google are pushing consumer to use their own products. there must be regulation for this restriction if i paid my device i have to use any way i want.its keep lagging when i connect 10 ft hdmi cable its clear no lag no freezes. but choremecast keeps freezes.480p from brand new macbook pro with 150 mbps fast router still frezes i read every thing about it but no way.programers not working on quality any more they spend all their times to restrict and stuck user on their auro software and products.come on google you made this billions because you were ahead of others and support people for free serach and mail before every other company. now google became a huge scam machine that we cant fight for any extra penny they do every thing just like remove disscussuion button from serach because it s not making money and give users all info they need about products.chorecast software has a lot of bloatware program line that stuck users and i don not use it any more i just stick an hdmi cable all the way from my computer to tv its much better.and chormecast keep using computers sources  when playing from chorme.", "verified": true, "helpfulness": "0/3", "author": "Mustangy_nyc"}, {"rating": 5.0, "review": "I love how it ties into Chrome and Netflix on Android.", "verified": false, "helpfulness": "0/0", "author": "Bobbie Stivers"}, {"rating": 5.0, "review": "perfect for college student ...", "verified": true, "helpfulness": "0/0", "author": "DaBogeyman \"\"KDB\"\""}, {"rating": 5.0, "review": "Works as expected.", "verified": true, "helpfulness": "0/0", "author": "Rick Deckard"}, {"rating": 5.0, "review": "It just works. A must have for any smart phone user.", "verified": true, "helpfulness": "0/0", "author": "muhammad umair qayyum"}, {"rating": 4.0, "review": "Now I can watch youtube in my TV!!The only drawback is the wifi signal, not very good as my mobile phone's.", "verified": true, "helpfulness": "0/1", "author": "Joao Marinho"}, {"rating": 5.0, "review": "Bought through Amazon a few month back, no complains. It worked pretty well with my Galaxy Tab, which allows me to painlessly project YouTube and other apps onto the big TV screen. I can also stream content from my Windows PC.", "verified": true, "helpfulness": "1/1", "author": "copperzammer \"CQ\""}, {"rating": 4.0, "review": "This is making my life a lot easier when i want to share something in the family with the big screen TV. It will be better if there are more apps is supporting this Google Chromecast :)", "verified": true, "helpfulness": "0/0", "author": "Sheepbro"}, {"rating": 5.0, "review": "Love it, so easy to install and I use it everyday.", "verified": true, "helpfulness": "0/0", "author": "sexyblue"}]