[{"rating": 4.0, "review": "Pros: I like the ease of streaming media from any of my mobile devices without having to connect the device to the television via a cable.Con: other than when using netflix or youtube apps, the chromecast only works via google chrome.", "verified": true, "helpfulness": "0/0", "author": "segobanton"}, {"rating": 4.0, "review": "Works great. If only it could stream more than just Netflix & YouTube. Hope google adds more sites to stream soon", "verified": true, "helpfulness": "0/0", "author": "Kumar Subramanian"}, {"rating": 5.0, "review": "Product works as expected and delivered in a timely manner. I use it on multiple tvs throught the house and can now control it on both my phone or laptop.", "verified": true, "helpfulness": "0/0", "author": "Smooth"}, {"rating": 5.0, "review": "Brilliant piece of hardware at throwaway price. . Definitely worth buying. Works very well with all my devices- macbook android phone", "verified": true, "helpfulness": "0/0", "author": "Sunit Gupta"}, {"rating": 5.0, "review": "The Chromecast has been a great device to stream Netflix to my HDTV.  I bought this mainly to stream Netflix and Youtube and it's worked well and met my expectations.  One area that I have not used is Chromcast from a laptop of PC, I believe this would be very usefull to share a webpage.Setup and install was very easy using the directions provided in the box.  Chromecast comes with a small HDMI extension cable that should allow the connection to most HDMI ports, USB Power Supply, and USB to micro USB cable, Chromcast, and instruction manual.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}, {"rating": 5.0, "review": "LOVE the Chromecast. I use it all the time. It's pretty much all I use to watch tv shows and movies.", "verified": true, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 1.0, "review": "Limited options. No general streaming. Google need to try harder and open up the streaming to other applications and more countries.", "verified": true, "helpfulness": "0/0", "author": "Dodo"}, {"rating": 5.0, "review": "Works great!  Streams Netflix and YouTube very well at home, or on the road.  A real bargain for such a low price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "This device is so simple to setup and use.  It works with all of my devices (cell phone, tablet, laptop) with no problem.  I would have given it 5 stars if more apps supported it.  At the time I am writing this Hulu, Netflix, Pandora, and YouTube are supported. From what I hear though many more are coming out shortly.  Thank you Google.", "verified": true, "helpfulness": "0/0", "author": "Michael J Rubillo"}, {"rating": 3.0, "review": "It Plays very limited content as compare to all other TV sticks plays anything from google TV. I will wait...", "verified": true, "helpfulness": "0/0", "author": "WIQAR SHAIKH"}]