[{"rating": 5.0, "review": "Easy to install. Chromecast device and Chrome browser are very nicely integrated. I discovered that I can only cast Web site videos, not dedicated video viewer applications.", "verified": true, "helpfulness": "0/0", "author": "Doyle R Painter Jr"}, {"rating": 3.0, "review": "Works as advertised, arrived quickly and package good.  The only issue is that it only works with specific applications and not on Chrome on Android for example.", "verified": true, "helpfulness": "0/0", "author": "Ihab Riad"}, {"rating": 5.0, "review": "Although installation wsa a bit of a challange, when done it worked as promised. No problemo! This dongle interfacing with my cell phone for a wireless remote for netflix. Get rid of your cable bills.", "verified": true, "helpfulness": "0/0", "author": "michael Frank"}, {"rating": 5.0, "review": "Great item.  And easy to use.The best of the best.I recomended it because it worms perfectly.Thanks Google", "verified": true, "helpfulness": "0/0", "author": "Manuel Castillo"}, {"rating": 5.0, "review": "best thing you could buy as a gift for someone honestly since its cheap and provides a lot of power to any hdmi capable tv", "verified": true, "helpfulness": "0/0", "author": "josean"}, {"rating": 5.0, "review": "Easy to use to watch our favorite shows on a bigger screen.  Great price and value. Synced it with the on-line version to go cordless too.", "verified": true, "helpfulness": "0/0", "author": "Rita DeVore"}, {"rating": 5.0, "review": "Love how easy it was to set up and how small it is.  We can easily pack this and bring with us on our travels. I only wish it did amazon prime. Hopefully it will in the future", "verified": true, "helpfulness": "0/0", "author": "T. Smith \"BZMAMA\""}, {"rating": 5.0, "review": "It is amazing and I can watch TV shows on the TV that I couldn't before and I love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Sunil tikyani"}, {"rating": 4.0, "review": "This is a fabulous item!  LOVE being able to send stuff from my iphone right to the tv!  It sends a lot more things than just netflix, hulu and YouTube.  You can send all your PC screens!  The only reason I don't give it 5 stars is that you are at least weekly resetting it all up as it looses it's connection.  :(", "verified": true, "helpfulness": "0/0", "author": "William Ryalls"}, {"rating": 5.0, "review": "Product was very easy to follow directions and set up and understand the installation! I would definitely recommend this product.", "verified": true, "helpfulness": "0/0", "author": "AMJ"}]