[{"rating": 5.0, "review": "Awesome product!! really convenient. You can cast your whole laptop screen via chrome. It is not just limited to YouTube and Netflix.", "verified": true, "helpfulness": "0/0", "author": "Ajaypal Singh"}, {"rating": 5.0, "review": "While the functionality is limited (would love to see some more apps support it), what it does it does well!Netflix works well - way less buffering compared to watching things on my Nexus 7.Youtube works even better - love the fact that I can queue videos to watch on it!(Cannot test Hulu, since that is not available in this part of the world. Did not test streaming from Chrome - I have other options for streaming from my own network.)", "verified": true, "helpfulness": "0/0", "author": "F. Rodolf \"Dutch, love science fiction and fantasy, but am partial to an interesting (auto)biography too.\""}, {"rating": 3.0, "review": "Canadian buyers should be aware that if you are purchasing to watch Netflix or amazon Prime from a mobile device or from Chrome you can't use a VPN to get US netlfix on the device and then cast to the chromecast.  It won't work.  Other than that, it basically just streams Netflix at the moment but most of us already have TVs and streaming devices anyway.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy set up.  I watched a movie and it was very clear.  I have not been able to link the Crhomecast with my IPad or phone as of yet.  I do not understand why it is not working.", "verified": true, "helpfulness": "0/0", "author": "tuffwen"}, {"rating": 2.0, "review": "Doesn't work with a TV hooked up to a Bose stereo surround system.  So that sort of complicates things when you have a media system.", "verified": true, "helpfulness": "0/0", "author": "Tammy Hoyt"}, {"rating": 4.0, "review": "Quick & simple setup, easy to use. Just wish that you there were more options than just Netflix & Hulu.", "verified": true, "helpfulness": "0/0", "author": "Herman Alzamora"}, {"rating": 5.0, "review": "For the price, I cannot complain at all... it works MUCH better than that piece of crap Samsung HomeSync and it's only a tenth the price! Unfortunately, it only streams from Netflix, YouTube, Hulu Plus, Google Play Movies, and Google Play Music. It won't stream existing videos on your phone or from your network, so if you're getting it for that, don't bother. I have a couple of TVs that aren't \"smart\" and I've watched a few Netflix and a couple of YouTube videos on my 60\" plasma, it looked fine and the sound was good. Setup was too simple with absolutely no challenge, boring, but a good thing! I plugged it into the HDMI and used the USB on the TV so it doesn't have to stay on 24/7. It popped up with a URL to go to, I went, it found the ChromeCast, it set it up, I didn't even have to find my wireless password, totally lazy... you control it with your crApple (I think), Android phone/tablet/laptop, or Google Chrome browser. I just ordered another \"idiot box\" and will likely get another ChromeCast... in fact, I'll order it while I'm here.", "verified": true, "helpfulness": "0/0", "author": "Dave the Pear"}, {"rating": 4.0, "review": "Easy to setup, easy to use. I use this a lot. It has become the primary way I watch youtube and netflix, replacing my apple tv for the most part. I did have to restart the device once or twice since I have owned it to fix some glitchs. Steaming from a computer works pretty good. I just wish more apps supported it, which is happening slowly.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 5.0, "review": "Had this little guy for over a month before setting it up...Last night finally took the time to set it up...Set up was super easy, as you'd expect from Google...then used it for the evening...All I can say is awesome...If you want a way to use your computer to throw content to your HDMI connected TV,then this is it. Just bring up your CHROME browser, using the Chromecast extension(which both are vey easy to set up) and choose to CAST it...there ya go. On your hdmi connected TV flowing through your local wireless network.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "you cannot display personal files to screen ...you cannot listen to personal mp3's eitherframe dropping while playing a video in side chrome browser", "verified": true, "helpfulness": "1/2", "author": "12Y OB-User"}]