[{"rating": 4.0, "review": "This things fantastic. It turns on when I turn on my tv. It's quick to just throw up movies, youtube videos, etc on there and it's got a cool little screensaver when you're not using it. No regrets with the purchase and I'd recommend it to someone who wants to get into streaming movies and tv shows.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 3.0, "review": "limited use", "verified": true, "helpfulness": "0/0", "author": "Damian K."}, {"rating": 5.0, "review": "Best invention ever!", "verified": true, "helpfulness": "0/0", "author": "Tracy \"Aamba\""}, {"rating": 3.0, "review": "This little device brings an old 'dumb' TV back to life.  For the most part, it works fine.  Unfortunately, whenever there is a lull in activity for a few days, I am forced to unplug it and plug it back in order to get it working (-2 stars).", "verified": true, "helpfulness": "0/0", "author": "Mark M"}, {"rating": 4.0, "review": "Can't beat the price, which is why it's okay it really doesn't do all that much. Great for casting anything to the tv, except some apps (Slingplayer, for the worst of the worst) don't really support it.", "verified": true, "helpfulness": "0/0", "author": "Pierce Liefeld"}, {"rating": 5.0, "review": "great product, has multiple uses and all are very easy to setup", "verified": true, "helpfulness": "0/0", "author": "GqSilvFX10"}, {"rating": 3.0, "review": "I bought this to cast from my phone or tablet, I didn't know that Internet was required even for casting content that is already on the casting device. I'm sure it's great, but it doesn't suit my needs yet. But I'm keeping it because it was such a great price and I will update my  review after I get Internet.", "verified": true, "helpfulness": "0/0", "author": "Bruce Flanagan"}, {"rating": 5.0, "review": "Second Chromecast for my living room TV.  Simply love to control everything from my phone!", "verified": true, "helpfulness": "0/0", "author": "CESAR REDONDO SANCHEZ"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Dagny Alvarez"}, {"rating": 4.0, "review": "I Have been Very happy with this Product.  Probably the feature I like the most is the screen mirroring feature.  Other devices dont have this and it comes in very handy.When I first got the device the number of apps that you could directly cast to the TV was somewhat limited.  Google has improved this and there are many more now.  They are working in the right direction and should soon have all the desired apps to cast.  Great investment for the price.", "verified": true, "helpfulness": "1/1", "author": "Douglas Mulqueen"}]