[{"rating": 1.0, "review": "The description for this product is misleading.  It says it is easy to setup: \"Plug into any HDTV and connect to your home WiFi network.\"We could not get this to work after trying several times and installing updated software.  It recognized the home wifi network but it would never connect.  When we went to return it to amazon, we missed the deadline by 1 day.  Now we are stuck with a product that we cannot use.Roku and apple tv are much better and worth the extra money.  I would NOT recommend Google Chromecast. It is basically an overpriced way to connect your computer or iPad/iPhone to your tv.  The same could be accomplished with an inexpensive hdmi cable.  (The cable would be more reliable).", "verified": true, "helpfulness": "0/0", "author": "twenty five seconds"}, {"rating": 5.0, "review": "Love mine. bought a second one for my downstairs t.v. Comcast now allows direct sending to my Chromecast from the tablet.", "verified": true, "helpfulness": "0/0", "author": "Moonutdad"}, {"rating": 3.0, "review": "I bought the chromecast believing it would have a lot of features. The product works nicely but besides using it to watch netflix there isn't much to do. being able to view webpages utilizing chrome cast extension on google Chrome browser is ok, but depending on the PCs' resolution the image in the TV chromecast will appear chopped. Good product but in my opinion needs more features to be worth it.", "verified": true, "helpfulness": "0/0", "author": "servenaya"}, {"rating": 2.0, "review": "These are a pain to integrate into some routers and networks. Even then the performance is not great. I was hoping for more, maybe future generations will be better.", "verified": true, "helpfulness": "0/0", "author": "eoneill \"Ed\""}, {"rating": 5.0, "review": "Fantastic. I am never disappointed by the quality of the products I buy on Amazon and the service is better than I find in many department stores. The Chromecast is outstanding. My only disappointment was realizing I was not able to use it with my online studies. But It works better than I thought it would.  Like I said, I'm never disappointed. Great venders, quality service and product. Thank you everyone.", "verified": true, "helpfulness": "0/0", "author": "Jeff Riddle"}, {"rating": 1.0, "review": "Ordered one, and it worked for 1 week. I sent it back, and it was replaced with another one. The replacement does not work well at all. It has not stopped working like the first one, but it works when it wants to. What are the chances of me getting two defective products??? I wish I would have shopped around and spent a little more money for a better product. So disappointed :(", "verified": true, "helpfulness": "1/1", "author": "Lalenavcas"}, {"rating": 5.0, "review": "I ordered the google Chromecast because of the price. I have a Apple TV in my main living area and really enjoy it. I just didn't want to spend another $99 just to watch Netflix and YouTube. The Chromecast was just $29.99 with my prime membership. Shipping was fast. It arrived in 2 business days. I live in a older building and I am unable to get cable in the bedroom, so the Chromecast was the best alternative. The Setup took only a few minutes. I connected to it to my wifi I love to watch Youtube and Netflix on it. Actually Youtube shows better on the Chromecast than the Apple TV IMO. It doesn't come with a remote but I have a galaxy s4 and I use it as the remote with the watch on app. I do like that I can use my ipad and iPhone as well to control it. Overall its a great product for the money and what I use it for.", "verified": true, "helpfulness": "0/0", "author": "Cassie I"}, {"rating": 5.0, "review": "Good tool for taking your TV favorites to every place that you want. Not a lot of apps, but the good ones. Very easy to carryout with you.", "verified": true, "helpfulness": "0/0", "author": "Manuel Marangon"}, {"rating": 5.0, "review": "One the best devices Google has produced, and knocks other streaming devices out of the park. This is Google's town now, and they rocked it.", "verified": true, "helpfulness": "0/0", "author": "Jason Parent"}, {"rating": 4.0, "review": "- Easy to setup- Responds quicklyI hope it will soon have DLNA capabilitly to stream even pics and videos from laptop / mobile and the Chrome Browser cast will improve its performance.", "verified": true, "helpfulness": "0/0", "author": "furhor"}]