[{"rating": 5.0, "review": "I finally received this yesterday and loved it simplicity. Before buying I read lot of negative comments regarding comparisons with Roku or Apple TV but I disagree with all of them now. This is simple Chromcast device stream Youtube and Netflix from multiple device without any sophisticated control. Although many other app-makers already working on Chromecast support . Only two kind of people right now bashing chromecast who doesn't get Netflix code and second one who doesn't have it.PS: I am able to play videos from hosting bulk , Videoweed from chrome browser and loved it more but still I would bought it as Youtube Streamer alone. Just Loved simple setup and able to cast videos from IPhone and Android.Update: I am disappointed with Google eco to produce more supported app. Recently bought roku2 XS for 45 bucks and blown away by contents and app. Also Roku have Twonky app which perform function like beaming from iPhone and Android even better you can beam your photos, videos and music etc. Currently, I am happy with Roku 2 XS and using more over my chromecast.", "verified": true, "helpfulness": "1/3", "author": "Sushil"}, {"rating": 5.0, "review": "Extremely easy to setup. Took me less than two minutes to set it up and start using.Works like magicNice packaging", "verified": true, "helpfulness": "0/0", "author": "Dbs"}, {"rating": 5.0, "review": "I am not a very tech savvy person and had a little hiccup installing. initially had no problems installing everything was going as planed until I ran into a problem with the router. It had to do with something called VPN (which I have no idea what it is). It took me a good 20-30 minutes trying to figure out what I needed to disable on my router but once I figured it out the installation process was completed. Also, you do need to plug the thing in to power it up. It also does not work from a desk top. I know it does not mention desk top but like I said I am not the most tech savvy person and I though I would give it a shot.My primary use for this was so that the kids could watch Netflix in their room and this device does just that and it does it well. Casting from Google Chrome also works for me without any problems to this point. People have complained about the capabilities but I just think they may be asking too much of this product. I have also seen complaints about the 3 free months of Netflix. I ordered mine hours after the announcement and I did get my code and I did receive the credit to my account. If you ordered your device after a specific time you will not get the code as this was a limited time offer.", "verified": false, "helpfulness": "6/9", "author": "fredlow1"}, {"rating": 1.0, "review": "Was under the assumption that this was a plug and play device-that it almost installs itself. That is very far from reality. It initially installed very easily, but \"casting \" from the icon on the program page resulted in a very grainy,unwatchable picture on the TV despite the page being clear on my computer. After fruitlessly searching the help section on the chromecast page I gave up and called support. The agent was very helpful, but explained that it only really works on netflix and youtube correctly right now. You have to click on the app icon on the video playback window, not the one on the cast app page. He said its still in beta, and there should be upgrades or patches available soon.I checked and it did play a more watchable picture, but when I tried to stop playback the video continued playing but the chrome cast icon on my mac toolbar disappeared. The video continued playing with no way to control it. I have a Roku that this was going to replace or be an alternative to. The Chromecast is now carefully packed back in its box and will be on the way back to Google Monday morning. The Roku set up and has worked flawlessly since the first install. The Chromecast is an interesting toy, but I have no time to play.I actually expected it to work as reviewed and advertised.Maybe some day it will.....until then Roku is my choice.", "verified": true, "helpfulness": "23/65", "author": "grh2011"}, {"rating": 5.0, "review": "For anybody wondering what this is, this is a device about twice the width of a thumb drive that plugs into the back of your tv and lets you stream wirelessly from your laptop/phone/tablet to your tv as long as you have wifi. So it basically lets you hook your laptop to your TV without using an HDMI cable. Its not rechargeable by the way and has to be hooked to an external power source through either the included wall adapter or through another included cable that lets you power it through your TV's USB port.", "verified": true, "helpfulness": "1/3", "author": "Deem"}, {"rating": 3.0, "review": "I had a lot of trouble getting this to connect with wifi, but was helped by a reference sent me to [...] Worth looking at.", "verified": false, "helpfulness": "0/4", "author": "MabelDodge"}, {"rating": 1.0, "review": "I know it's coming but you should have mentioned that before I bought it....I'm stuck with it.... It sucks...", "verified": true, "helpfulness": "9/46", "author": "Rinel Lozada"}, {"rating": 5.0, "review": "The small form factor is amazing and can be essential with some mounted TVs.With the right implementation the Chromecast could have endless potential.No Mas Wires.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 2.0, "review": "This does not work on television sets older than six years-old. The issue is with the HDCP. Your older TV set will not display any images that come from this device.", "verified": true, "helpfulness": "4/12", "author": "Five Cat Brewery"}, {"rating": 4.0, "review": "I have Google TV, a Vizio TV with apps, and a Panasonic Blu-ray player. All three devices are capable of streaming Netflix. The picture quality of the Chromecast is superior for me compared to the other devices. Why did I purchase the Chromecast? I purchased with 3 month Netflix deal making my cost minimal for a device I can take with me. Fortunately my three year old TV has a side HDMI port with USB outlets right next to it so my install is clean with no need to connect to the wall. The TV also had a firmware update to support CEC allowing the turn-on switch inputs feature to work.I have a fast network with a high-end desktop PC that is connected via a wired connection to the router. For me the quality of a picture streamed to the TV through the desktop browser is great. It is slightly behind the desktop but the picture has been rock solid from a variety of sites. Have not tried streaming from a lower end laptop or tablet so I can't comment on that.I have had a Roku box in the past. Highly recommend it. The channel choice is unsurpassed. If you have room for another box it is probably the best choice especially when compared to what third-party vendors charge for the Chromecast. AT 35 Chromecast is good value at 100 it is way overpriced compared to the Roku at 78 plus cable for a 1080p streamer. Do not pay anything more than than retail. When I ordered from Google they said it would ship in 2-3 weeks. It shipped in two days though the journey took a week from when it was shipped until it arrived.", "verified": false, "helpfulness": "3/4", "author": "Bobsacto"}]