[{"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "Excelente!!!", "verified": true, "helpfulness": "0/0", "author": "Rafael Duran Frias"}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/1", "author": "This guy!!!"}, {"rating": 5.0, "review": "I love Chromecast! Bought one to try, ended up buying one for my dad and then two more for my own house. Great price, amazing functionality. I love that anything I can open in Google Chrome I can cast. Desktop casting works too though a little bit slower than things that have a Chromecast app. Much better than Roku (Netflix hasn't worked on our Roku box for a year now). Just wish they would make a Hulu and Spotify app for Chromecast. The screensavers are gorgeous too!", "verified": true, "helpfulness": "0/0", "author": "Livia \"Med student\""}, {"rating": 4.0, "review": "This works great from my Android phone, but I'm having trouble getting it to work from my Apple products.  It was pretty easy from the phone-just plug it in, change the setting on the TV, and there is my movie.  I use Apple TV at work, and feel the Chromecast works as well or better.  At work I have connectivity issues that I haven't had at home.  It would be nice to have it work easily with any of my devices.", "verified": true, "helpfulness": "0/0", "author": "Kim Kanney"}, {"rating": 1.0, "review": "It just pulled apart!!! The copper from the HDMI pulled right out, I had to use needle nose pliers to get it out of the TV. I only used it 4 times. When it did work it was mediocre at best. I did not like the fact that I had to have a separate app to stream videos and etc. where as an AppleTV it just makes life much easier and faster.", "verified": false, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE IT (:", "verified": true, "helpfulness": "0/0", "author": "Shelby Story"}, {"rating": 2.0, "review": "I bought several of these at one time (one for each tv in our house) because they were inexpensive - there's a reason they aren't charging $100 for these.  They SUCK. They constantly lose reception and have to be rebooted, the app frequently doesn't work, and overall they're just a pain. After wasting $35/each on four of these, I tossed them all and bought AppleTVs.", "verified": true, "helpfulness": "0/1", "author": "S. De Arman"}, {"rating": 5.0, "review": "I already own one of these and have been using it for a year and Love it. I bought this one for my parents and they are NOT tech savey. It took them a few minutes to learn but now they use this all the time! Its so much better than trying to type on a remote control to find something on netflix when you have a tablet or phone you can use instead!", "verified": true, "helpfulness": "0/0", "author": "William Shamblin"}, {"rating": 5.0, "review": "I love it. This is my third one, I gave the other two as gifts.  They loved it.", "verified": true, "helpfulness": "0/0", "author": "CALLIOPE"}]