[{"rating": 5.0, "review": "This is my 2nd one of these. I liked the first one enough to get another so I would highly recommend these. I stream netflix or watch ESPN with no problem right to my TV :)", "verified": true, "helpfulness": "0/0", "author": "GoGators950"}, {"rating": 5.0, "review": "Great for streaming youtube & Netflix but I'm still trying to find out how to stream movies from other sites.", "verified": false, "helpfulness": "0/0", "author": "salem o kees"}, {"rating": 5.0, "review": "Works great, so easy to use, can't believe we lived without it!", "verified": true, "helpfulness": "0/0", "author": "JB928"}, {"rating": 5.0, "review": "This HDMI stick is very easy to use and convenient.The reason i recommend this over other similar products, is that Google is the producer. This means androids and Chrome users have increased functionality with this product. For example, with Chrome, you can mirror your laptop screen onto your TV. ALSO, you can mirror your anrdoid screen on to your TV.Buy this product!!!", "verified": true, "helpfulness": "0/0", "author": "Mr. Blue"}, {"rating": 1.0, "review": "I love it.", "verified": true, "helpfulness": "0/1", "author": "Philip Chiu"}, {"rating": 5.0, "review": "My sister loves it", "verified": true, "helpfulness": "0/0", "author": "Eric Betts"}, {"rating": 5.0, "review": "works great an amazing tool for my TV.", "verified": true, "helpfulness": "0/0", "author": "Gilbert A. Rivera"}, {"rating": 3.0, "review": "I can't get my TV to play it on the first try", "verified": true, "helpfulness": "0/0", "author": "GiddyYuppy"}, {"rating": 5.0, "review": "Not as complete a kit as a Roku or Apple TV, since there is no remote, but it is the biggest \"bang for your buck\" for those that want to bring \"smart tv\" features to an older HDMI capable tv.  One of our Panasonic plasma panels did not have any wi-fi features or apps, so the Chromecast was very inexpensive upgrade to the panel.  We also had a barely used Nook HD tablet to employ as a remote and streaming source.  The Nook does not have bluetooth or an IR blaster, but since the Chromecast uses wi-fi for controls, it breathed new life into the tablet as well.", "verified": true, "helpfulness": "0/0", "author": "M. Ichiyama"}, {"rating": 5.0, "review": "Amazing for $35, I have a roku 2 and a roku 3. Chrome cast is great for the TV in the kitchen and as a media TV next to my computer. But I prefer the roku for the living room and the roku is easier for the parents to use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]