[{"rating": 5.0, "review": "Fantastic product! Strongly recommended for anyone looking to watch download from their smart gadgets on the big screen...ease of use and provide entertainment for the whole family.", "verified": true, "helpfulness": "0/0", "author": "Tan HJ"}, {"rating": 5.0, "review": "This is the best purchase I've made in a long time. It blows away the Sony blueray player I've been using for a number of years. Always thought it had problems and apparently it did. The picture quality is excellent and I believe the sound is way better. Set up is very simple. Running it on Galaxy s3 and through my Onkyo AV receiver. Have run a bunch of You Tube and Netflix movies this weekend and no problems.", "verified": true, "helpfulness": "0/1", "author": "Rex Deshon"}, {"rating": 1.0, "review": "I plugged Chromecast into the TV and configured it from my iPad.  All went OK at first--it updated its own software and rebooted, and asked for the name and password of my wifi network.  I did that and the Chromecast says it's on my wifi on the TV screen.  But from my iPad, on the same wifi network, couldn't find Chromecast.  I then tried the same thing from an Android phone and a Windows PC laptop.  None could find the Chromecast device.  I put the Chromecast right under the wifi router and still couldn't find it from a phone.", "verified": true, "helpfulness": "0/0", "author": "Dan Anderson"}, {"rating": 4.0, "review": "This lacks the ability to use plex on a cell phone.  If your computer hasn't got a fast processor with lots of power reconsider it until they allow plex.", "verified": true, "helpfulness": "0/0", "author": "Roger \"bandman1967\""}, {"rating": 4.0, "review": "This is the beginning of a major revolution for content sharing. Though, not perfect, the Chromecast is a simple and beautiful entry in the TV streaming space. Bravo Google. Now, keep the updates coming!", "verified": true, "helpfulness": "0/0", "author": "Jaykron"}, {"rating": 5.0, "review": "Setup was painless. Most of the negative reviews I've seen were by people who expected it to do things it wasn't meant to do. I was so impressed with my first one that I ordered another one. It works best using my Motorola Xoom tablet. I've read reviews stating that it wouldn't work with dual band routers (Belkin specifically mentioned). I have a Belkin dual band router and had no problem getting it to work. After reading many negative reviews, I've come to the conclusion that some people are technically challenged! Setup couldn't be easier. I would like to see more apps available in the future, but even if that doesn't happen I'm very satisfied with the way it's working now - like I said, it does what it's supposed to do.", "verified": true, "helpfulness": "0/0", "author": "RAYMOND R ERICKSON"}, {"rating": 3.0, "review": "I own 2 of the chromecast devices. the concept and the supposed ease of use are great, your TV becomes an extension of your chrome browser which means that everything thats on the internet could be viewed on your TV.The problem is that device has a lot of issues staying connected on the network when used on the chrome browser and it messes up the wifi connection for all the devices in my experience this happens only if you cast from your chrome browser and not if you cast the few [but expending number of]apps available for the phone and tablet. This issue renders it quite impractical for chrome browser streaming but the growing number of app with casting ability are making this less of niche device and increasingly viable streaming option from phone/tablet to the home theater system.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Zalmen\""}, {"rating": 2.0, "review": "Great packaging; easy initial set up but I have not got it to shake hands with my router which is in the next room.  I am not sure if I don't like it or it does not like me!!  I have done all the right things (I hope) - I have run setup five times and the icon shows on my Google Chrome toolbar but it does not recognize my Belkin router.  Also, my cable box has dropped some of my channels (related? - I don't know!)  When I have more time I will try again but it is not the plug and play that I had hoped.  Reverted to Netflix by mail!  Not for the faint hearted if things go wrong.", "verified": true, "helpfulness": "0/0", "author": "secret squirrel in VA"}, {"rating": 1.0, "review": "My unit got tired after an hour and went to sleep.This happened on several occasions, so I gave up on it. Another toy for the recycle dump", "verified": true, "helpfulness": "0/0", "author": "Leo28"}, {"rating": 5.0, "review": "I don't know if the information wasn't there or I just missed it, but you have to have Windows Vista or higher to make this work.  I am now waiting for my son (the computer wizard) to install Windows 7 so I can happily stream web-only content to my TV.  Looking forward to the day!!", "verified": true, "helpfulness": "0/0", "author": "Nona R"}]