[{"rating": 5.0, "review": "I have several set top boxes and got the Chromecast last December. I bought it when the price was only $30 so I ended up eventually getting a second one for my upstairs TV as well the downstairs one for my home theater system.The key with Chromecast is simplicity. It is small device that is easy to transport and take with you and easy to hook-up as well. You plug it into a free HDMI port on your TV or A/V receiver. I have it hooked to my A/V receiver downstairs and direct to my TV HDMI upstairs. The upstairs unit I use with the included AC adapter,  the downstairs one is plugged into a USB port on my A/V receiver that powers it. Once this is done you control everything through either a mobile device or a computer. The interface is completely driven by installed apps or websites on the internet that have a casting icon option.Compared to other boxes the ease of use and speed is generally pretty good. Your smartphone or tablet is much more powerful hardware wise then most set top boxes so you can browse faster. Searching is also easier as you are using a mobile device keyboard instead of the typical remote control selection process. Mobile device keyboards also work well with voice search so that saves you having to type anything. I always have either my Galaxy S4 phone or Ipad tablet near me all the time and being able to use this without having to hunt for another remote or keep an extra one around is nice.Content wise Chromecast is getting much better then when I bought it. Chromecast has most of the stuff that I want to watch including Netflix, Hulu Plus, YouTube, HBO Go, and Vudu.  It would be nice to have an Amazon Prime Instant video app that would cast. The YouTube experience is the best of any other set top box because you can create live playlists of content. This means you can cast one video and while it is playing you can add more videos to a live playlist that will play one video after another on your TV. To add to this anyone with a YouTube app on a mobile device can add to this existing playlist without interrupting any of the content playing on the TV.Sound and picture quality wise Chromecast is as good if not better then any other devices I have used. With the HDMI going into my receiver I get Dolby Digital Plus content when it is available on Netflix, Google Play movies, and Vudu. HBO Go is lacking Dolby Digital which is a miss since it plays with Dolby Digital on other devices. Picture quality wise I have always been impressed with Chromecast especially on Netflix. I noticed some nice film grain on several films and the device holds the Super HD resolution without any drop offs during broadcast. This will depend on your internet speed but it works quite well in my home.When you combine features with the price point and value I give this 5 stars. If it were a $100 box like Fire TV I would not give it as a high a number. Fire TV is however worth the $100 in my opinion for its extra features and it can also cast content to YouTube like Chromecast. If you want an inexpensive set top box solution however Chromecast is still a great solution. If you do not like or use mobile devices though I would not recommend it. If you do then it is a unique and fun experience for a great value.", "verified": false, "helpfulness": "0/0", "author": "Raymond R. Jackson"}, {"rating": 3.0, "review": "After 3 weeks I think I got it working. Stuff you need to know: It's NOT plug 'n play! To get it to work with a tablet you need the 'Avia' app.  Also, if you want to stream media from any of your home devices, they will need DLNA server installed. Google Chrome works for some stuff (like Hulu & Youtube), but it's kind of buggy for casting your personal media.  Don't bother using Chrome to cast from a Linux box - it crashes after about 20 minutes (every time). I did get 'minidlna' to work, but only after a full 2 days of messing with it. The bottom line - If you want something quick & easy that will cast media to an older tv - don't buy Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Christopher Jones"}, {"rating": 1.0, "review": "Do Not purchase this device if you have any plans of casting Gooogle's own browser Chrome from ANY Mobile device. I spoke with Chromecast support this morning and they verified Chrome, google's own browser will not support the necessary chrome extension needed to cast chrome from the mobile chrome product. Gooole does liitle or nothing to alert the public to this deficiency. In my opinion Google is making fraudulent marketing claims as to how well the product performs and what the limitations are.Yes it does stream YouTube or any of the other sites that have released a seperate Chromecast app. Again, THIS PRODUCT WILL NOT CAST GOOGLE'S OWN CHROME BROWSER ON ANY MOBILE DEVICE.", "verified": false, "helpfulness": "2/2", "author": "Scott Drury"}, {"rating": 4.0, "review": "Pros: The price is very low. The image quality is great. It's super easy to set up. Cons: Not enough apps support it and no chrome support on android.Overall, the product is great, and I hope more apps will support it in the future. But, be warned, it's still in early adopters stage imho. Only buy it if you already have one of the supported apps.", "verified": true, "helpfulness": "0/0", "author": "Ivan B."}, {"rating": 4.0, "review": "I bought this for my mom, so she could stream her Netflix to the tv. It works really well and I know she is enjoying it. I think the only downfall is that sometimes the videos stop to load, but I think that is just because of the chromecast trying to connect with the internet. All in all, I would definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "Nicole Wyatt"}, {"rating": 5.0, "review": "Got a second Chromcast to watch NetFlix, YouTube, HBO, etc. on my TV set up from my cell phone or tablet. Looking forward to Chrome adding more applications. For $35, can't be beat.", "verified": true, "helpfulness": "0/0", "author": "Larry Jeffryes"}, {"rating": 2.0, "review": "Very limited use. Thought is was same as my Roku. It is not. Does not stream from wireless devices unless specic application has Chromecast funtionality built in.", "verified": true, "helpfulness": "1/1", "author": "Charlie"}, {"rating": 3.0, "review": "Can not get to work on my Emerson tv. Works fine on older olevia. I've tried it on all the hdmi plugins on back of tv and changed the source to match. Says 'no signal'  I have iPhone and iPad which both recognize it's.  So what do I need to do next?", "verified": true, "helpfulness": "0/0", "author": "clarice george"}, {"rating": 4.0, "review": "It works very well! and the price is very reasonable! my only observation is regarding compatibility with certain devices. I couldn't stream netflix from my galaxy tab 2 due to a issue that apparently is well known (error 16001).", "verified": true, "helpfulness": "0/0", "author": "Benjamin Vigneaux"}, {"rating": 5.0, "review": "You can't beat the ability to turn your 50\" plasma T.V. into an internet-ready 50\" plasma T.V.  I owned an Apple T.V. Years ago and it was nice, but, as far as I can remember, this Google Chromecast does the exact same thing for $30 versus $100.  You just plug the Chromecast device into an HDMI port on your T.V. and plug the power cable into either a USB port on your T.V. or use the supplied adapter and plug it directly into a wall outlet or your surge protector.  Then you just change the input on your T.V. to whatever port you plugged the device into and you're good to go.  I use it mainly to be able to watch Netflix on my 50\" plasma versus watching it on my iPad and it's worth the $30 just for that ability.", "verified": true, "helpfulness": "0/0", "author": "Dan"}]