[{"rating": 1.0, "review": "It works, but all it's useful for is to display wallpaper on my TV. It doesn't work with Amazon Prime and it can't be controlled from an iPhone or iPad because the Chrome browser on these devices doesn't support Chromecast. Consequently, you have to jump through hoops to stream videos such as PBS Video to your TV.", "verified": true, "helpfulness": "0/0", "author": "alphazetaomega"}, {"rating": 3.0, "review": "I was disappointed to learn upon receipt that it does NOT support Amazon streaming.  Silly me - thinking Amazon would promote a product it did not play with.  As a result, it's basically useless to me personally, although I think it is a good product for users who don't care about Amazon streaming.", "verified": true, "helpfulness": "0/0", "author": "Oregonuser"}, {"rating": 1.0, "review": "Don't waist your money, this gadget is useless, difficult to install depending in your wifi, parental caution, etc, etc, etc. There are many easy way to enjoy your movies and shows. Don't buy it.", "verified": true, "helpfulness": "0/1", "author": "Carlos A. Serna"}, {"rating": 2.0, "review": "Meh. It's okay. For our purposes, mostly using apps to watch movies and tv shows, I prefer the Roku. It's a lot more plug and play than the Chrome.", "verified": true, "helpfulness": "0/1", "author": "aukalou"}, {"rating": 5.0, "review": "Works great as always expected !", "verified": true, "helpfulness": "0/0", "author": "Joe Albergo \"Joe\""}, {"rating": 5.0, "review": "Does what it advertises. I like that it gives my tv a nice background picture that changes every few minutes. Theres been times i loose connection while watching a show on Hulu but im pretty sure its just cause of my slow internet. Other than that its easy to use and very useful", "verified": true, "helpfulness": "0/0", "author": "Hellboy741"}, {"rating": 1.0, "review": "I can't get it to work.  Is there a number I can call to walk me through the process of set up?", "verified": true, "helpfulness": "0/2", "author": "Paul Gasior"}, {"rating": 5.0, "review": "Love, Love, Love it!!", "verified": true, "helpfulness": "1/1", "author": "Alicia Love"}, {"rating": 5.0, "review": "This is a great piece of equipment if your non-smart TV has an HDMI port.", "verified": true, "helpfulness": "0/0", "author": "Patrick Ireland \"Mastergat\""}, {"rating": 5.0, "review": "excellent product", "verified": true, "helpfulness": "0/0", "author": "carlos carreño"}]