[{"rating": 3.0, "review": "Cuts out somewhat frequently. Maybe a faulty unit? Anyone else have this problem? Should we be returning it for a new one?", "verified": false, "helpfulness": "0/0", "author": "Reverb Records (Consignment)"}, {"rating": 5.0, "review": "Works great couldn't be more happy", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 5.0, "review": "Ditch cable and simplify your life. Get a chromecast for a quarter of the cost of one month of cable. We also bought a digital antennae for over the air HD. Good-bye Comcast!", "verified": true, "helpfulness": "0/0", "author": "Jeremy H."}, {"rating": 4.0, "review": "Very good on apps. Does tend to run hot, so unplug it from power when not in use. have to reset some. Everything is working that it says will work. I am pretty satisfied.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "Pretty lame that you have to use another device as a remote. Yes it's pretty cool to cast things to your t.v., but it sucks that you have to leave those devices running the whole time. Some Samsung t.v.s have this feature built in to them out of the box. I bought this to compare to our Roku streaming sticks. My opinion: Stick to the Roku's. (I have not tried the Fire stick yet, that's next on the list)", "verified": true, "helpfulness": "0/0", "author": "Ravyn"}, {"rating": 2.0, "review": "clunky implementation and we didn't really need it anyway. We have other streaming devices that work better. Sold it within a couple months.", "verified": true, "helpfulness": "0/0", "author": "T. Watson"}, {"rating": 5.0, "review": "EXCELLENT!!!!!! It works perfect with Netflix, which is the reason we bought it. It is second device so far and both have been extremely useful to transform our LEDs into smart TVs.", "verified": true, "helpfulness": "0/0", "author": "Carlos M."}, {"rating": 5.0, "review": "Best thing ever.", "verified": true, "helpfulness": "0/0", "author": "Gabrielle"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Dan Nguyen"}, {"rating": 5.0, "review": "Google has done it again. If you have Netflix, Amazon FireTV and a Chromecast you have the best of all worlds.", "verified": true, "helpfulness": "0/0", "author": "James F. Rendek"}]