[{"rating": 3.0, "review": "It can only output stereo audio and the Android software on my Samsung phone is very bad and buggy so it it doesn't always work well. There are a limited number of apps that is is compatible with. For the price, it is a neat thing to show your friends but the usability is hampered by bad Android software on third party devices.", "verified": true, "helpfulness": "0/0", "author": "Eric"}, {"rating": 5.0, "review": "Works as advertised. Does not screen mirror, and has limited apps available, but works well with what it can use. Can even sometimes stream video from chrome browser.", "verified": true, "helpfulness": "0/0", "author": "Shawn L Roberts"}, {"rating": 3.0, "review": "This allows wireless streaming from a PC or iPad to a TV equipped with an HDMI input.  You must have a Wi-Fi network in your home.  Set-up was easy and fast, and Google is to be commended for that.  Sometimes getting these devices working properly is like pulling teeth.My only issue is that the device is limited to streaming of Google-approved commercial sources such as Hulu, Netflix, YouTube and HBO GO.  For example, you cannot stream home video from your computer or iPad to your TV using this device.  And you cannot stream a web page either.  Both of these uses are within the capability of the device but for some reason Google has limited its functionality.So I gave it three stars.  If through a firmware (or other) update they would enable the device to handle all of the functions of which its capable, then I'd be the first to give it a resounding five stars.  But not now.", "verified": true, "helpfulness": "0/0", "author": "Cynthia"}, {"rating": 3.0, "review": "Limited in it's actions but pretty cool when it does one of the few things it can. Watch an online review before buying.", "verified": true, "helpfulness": "0/0", "author": "Steven Pollack"}, {"rating": 1.0, "review": "I googled this before i bought it because i wanted to see how easy it was to hook up.  It seemed pretty simple.... until i actually got it.  Now i know i'm not the most tech-savvy guy in the world but seriously.  it made me nuts.  the instructions are not very thorough and there was no help line that i could find in the package.  maybe i missed it.", "verified": true, "helpfulness": "0/0", "author": "Ronn Arnold"}, {"rating": 5.0, "review": "Bought one for me and my roomate and it works great. I can play pandora or netflix through the main stereo and tv using my phone as remote.", "verified": true, "helpfulness": "0/0", "author": "Mr Jones \"Kevin\""}, {"rating": 1.0, "review": "I thought it would do more!  You have to use the Chrome browser so if you have an app you can't broadcast it.  at least it was only $35", "verified": true, "helpfulness": "1/1", "author": "mman \"mman\""}, {"rating": 5.0, "review": "An inexpensive great product.  So easy to use! Very simple connection and set-up process.  Then you're watching movies on your big screen instead of a laptop or tablet.  Great!", "verified": true, "helpfulness": "0/0", "author": "Clifford Brass"}, {"rating": 5.0, "review": "A must have tech addition! It amazes me that many people still have no clue what the Chromecast is or does. I have been using mirror technology for quite some now. The Net Gear Push products have been my go to hardware for a few years but now the inexpensive Chromecast is all I need.", "verified": true, "helpfulness": "0/0", "author": "Frugal Shopper"}, {"rating": 5.0, "review": "It only took five minutes to install and get everything set up.  We will be getting another one very soon!", "verified": true, "helpfulness": "0/0", "author": "jennifer kramer"}]