[{"rating": 5.0, "review": "Very small form factor.  Faster and much better than any TV app I've used.  If Amazon Prime Video is the reason you are looking at TV's with built in apps, then save your money.  If not, buy Fire TV anyway because you'll like it much better.", "verified": true, "helpfulness": "0/0", "author": "Cavitt Donelson"}, {"rating": 3.0, "review": "Horrible luck.. purchased this.. which seems like it is always on back order and they lowered the price $16 the next week. It works ok...", "verified": true, "helpfulness": "0/1", "author": "AK Coach"}, {"rating": 5.0, "review": "Very easy to hook up and get started and easy to use!", "verified": true, "helpfulness": "0/0", "author": "Robert Compton"}, {"rating": 3.0, "review": "I received my Amazon Fire TV as a Christmas gift. For a little box, it definitely packs a punch. Lots of options for apps, crisp and clean interface, beautiful high definition video. Everything is quick and easy.There are some issues that I think should be addressed though.1. When the device is put to sleep (or goes to sleep), the video feed to the TV should shut off. This will allow the TV to shut off automatically. As of now it just makes the screen black.2. When the device is put to sleep (or goes to sleep), the internet connection should shut off as well. I have it connected to my router using the Ethernet cable, and it is definitely still active. There are times when I leave it a sleep for a few days, and even with the internet going that whole time, nothing loads properly when I activate it and I have to plug and unplug the device (there is no other way to turn it off). There was another time when I just unplugged the Ethernet cable from the router while it was on sleep mode and when I plugged it in and activated it, the same issue occurred. Now I just unplug the device when I'm not using it for longer periods and it's pretty annoying.3. Why are there ads if I have a Prime account connected? You have to be joking.4. The screensaver will come on with certain apps if you're not using them (like weather).5. The voice search should be able to work outside of Amazon content. I understand it will take some development to achieve this but it should go on the list.6. This is more of an observation than an issue but if you have a small television, the text (descriptions for movies and TV shows) is impossible to read. I upgraded from a 24\" to a 48\" and it's much better now.Amazon developers, you have a great thing going here. I love my little box. But please take a look at some of these issues (especially the first two) so you can make it even better.", "verified": false, "helpfulness": "0/1", "author": "M. Thomas"}, {"rating": 4.0, "review": "This was an awesome purchase. It was easy to set up. Only issues were electric cord was too short to thread to the back of the entertainment center and down to the outlets. Also I plugged the HDMI into the side of the TV and it did not work. I had to move it to the HDMI slot on the back of the TV. There are tons of free programs to watch. Lots and lots of PBS shows are free. There are lots of free movies to watch but intermingled with pay programs. Did learn that many times the key to knowing if it is free is to look for the Watch Now button. Even so if you are interested in something especially series click through to check. It may still be free. The remote is very responsive with the Amazon line up. I also downloaded the Iheart radio app and Crackle. There are a lot of apps you can download such as Netfix. Some free some not. Would give 5 stars if it was easier to sort free content.", "verified": true, "helpfulness": "0/0", "author": "Susan"}, {"rating": 4.0, "review": "Easy installation and clean instructions.", "verified": true, "helpfulness": "0/0", "author": "P. Oquist \"Mystic Goddess\""}, {"rating": 3.0, "review": "Product is great  just the delivery took for ever", "verified": true, "helpfulness": "0/0", "author": "Amy Petersen"}, {"rating": 2.0, "review": "Loved this device until my internet internet bill came. I used Chromecast before this and Amazon Fire TV is such a navigational delight to use compared to Chromecast. However, My internet service provider caps my data use at 300GB/month and starts charging me for data use after that. I have never gone over 200GB, but after I plugged in Amazon Fire TV after christmas (with no data streaming behavior changes over the past 12 months) I jumped up from 180GB in December to 730GB in January and then was up over 600GB by February 6th!! So my data usage increased to using OVER 100GB PER DAY. I unplugged the Fire TV and checked my data usage for the past 3 days and I'm now back down to my previous 10GB or less usage per day. I called Amazon and they said they had never heard of anything like that and I should reset to factory settings and try again. I'm going to wait until I get another billing cycle so I don't get charged more for the debugging. But I'm dubious.", "verified": true, "helpfulness": "1/4", "author": "Trish Tunney \"trishtunney dot com\""}, {"rating": 5.0, "review": "Not a hitch one. It was ready to roll straight from the box. Very impressed. And it works very well thanks so much Amazon", "verified": true, "helpfulness": "0/0", "author": "Howard Peters"}, {"rating": 5.0, "review": "This item is great. The kids are enjoying it more than I am. I don't have to worry about Cable playing re-runs, i dont have to wait to \"pre\"-record any movies i want to see. The selections are overwhelmingly more then enough.I'm glad I'm a Prime member. Its worth it.", "verified": true, "helpfulness": "0/0", "author": "angie english"}]