[{"rating": 3.0, "review": "The Netflix sync is excellent but the YouTube streaming is balky and cuts out for inexplicable reasons.  There are simply not enough applications to sync with Chomecast yet.", "verified": false, "helpfulness": "0/0", "author": "DAVID CANMANN"}, {"rating": 5.0, "review": "Worth every penny. Highly recommend this product for anyone looking to stream videos, tv shows, etc from online. Works great.", "verified": true, "helpfulness": "0/0", "author": "Clark Diedrich"}, {"rating": 1.0, "review": "Ended up setting it aside and never got it to work.  I don't want to spend all day trying to make a cheap item work.", "verified": true, "helpfulness": "2/4", "author": "Joseph Obrien"}, {"rating": 1.0, "review": "It is easy to setup, works great, then the extension  disappears, too many software problems? If google gets the problems fixed it would be a great product", "verified": true, "helpfulness": "1/2", "author": "Randal Tanabe"}, {"rating": 4.0, "review": "Chromecast from an app works great, however can't cast from Chrome on a mobile device such as Nexus yet. I will enjoy this product even more when that works and when more apps support the chromecast.", "verified": true, "helpfulness": "0/0", "author": "L Kohl"}, {"rating": 1.0, "review": "I ordered 2 of these as Christmas presents and only wish I could return them. Apparently they have a very limited warranty. They worked initially, then stopped working. After contacting the company and doing everything possible to \"reboot\" them, they just never worked again! Don't waste your money or time with this product, it's a farce that even Amazon won't back!", "verified": true, "helpfulness": "2/3", "author": "connie l. rupp"}, {"rating": 5.0, "review": "it is performing as advertised.  Good product, however installation and start up instructions could be more clear.  I use it mostly for youtube.", "verified": true, "helpfulness": "0/0", "author": "Peter Hannak \"Snowbird\""}, {"rating": 5.0, "review": "Google, streaming, many more apps coming... Whats not to like?Right now, I mostly use this to stream Youtube for kinds shows for my 16 month old daughter.", "verified": true, "helpfulness": "0/0", "author": "Stanleybb50"}, {"rating": 5.0, "review": "It's a google product.  You know what you are getting when you buy it and it works well. love it", "verified": true, "helpfulness": "0/0", "author": "Jeffrey Nolte"}, {"rating": 5.0, "review": "This product is awesome! We used to have to turn our Xbox or PlayStation on to be able to play videos and all that but now it's just one little thing you use and click and voila! Awesome!", "verified": true, "helpfulness": "0/0", "author": "eena"}]