[{"rating": 5.0, "review": "works but needs more support", "verified": true, "helpfulness": "0/0", "author": "Alexander S."}, {"rating": 4.0, "review": "We love this!  We use hulu plus and Netflix all the time at my house, so this is grea because we don't have to have any cables to connect our computers to the tv, since we have both a pc and a mac. It helps us keep things simple.", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 5.0, "review": "One of the best purchases i have made.  No more cords to stream my media from my computer to my TV.  My wife even made me get one for the bedroom TV as well.  Can't wait for the updates that are scheduled.The only downfall is that there aren't a ton of apps if you are an apple user (as is to be expected).  If you are an android user buy these for all your tvs", "verified": true, "helpfulness": "1/1", "author": "Christopher"}, {"rating": 3.0, "review": "Needs more functionality. We have this and Roku and we got weeks, sometimes months, without using the Chromecast because the Roku has such a superior interface as well as all of the apps and programming we are looking for.  Chromecast has potential that has yet to be realized.", "verified": true, "helpfulness": "0/0", "author": "LawStudent"}, {"rating": 5.0, "review": "Works great! I look forward to additional app compatibility in the future but for now this is a great, CHEAP tool!", "verified": true, "helpfulness": "0/1", "author": "Craig W. Marker"}, {"rating": 5.0, "review": "If you've never used Chromecast than you don't know what you're missing. Pretty much makes any TV a smart TV and works perfectly with Google Nexus 5 smartphone. Play Netflix or YouTube on your TV without having to touch the TV remote. Doesn't drain cell phone batteries either. Perfect upgrade for any TV.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Unlike Roku, it offers too few channels", "verified": true, "helpfulness": "0/0", "author": "Joseph Hoshen"}, {"rating": 4.0, "review": "Google Chromecast was relatively easy to install and has worked for me with Netflix.  I haven't yet tried to get it to work with other internet sites.", "verified": true, "helpfulness": "0/0", "author": "Patrick C. Noon \"Pleased owner of new table\""}, {"rating": 3.0, "review": "The Chromecast does as promises. I'd give it a 5 star review, however, without having a dedicated andriod device, it's hard to gage complete functionality. Using my netbook, tab casting is kind of laggy but i'm certain that is due to the netbook being underpowered and tabcasting still in Beta phase. When I purchase an android device (which will be more compatible), I will update my review.", "verified": true, "helpfulness": "0/0", "author": "Matt Mehrtens"}, {"rating": 5.0, "review": "The best gadget ever!!!  I do not have a lot of cable channels, but the ones I get on my laptop can now be seen right on the TV in high def.  If I had more than one TV it would be on every one of them.  For the money it is amazing.", "verified": true, "helpfulness": "0/1", "author": "Cheryl A. Ringelheim \"CRIN3\""}]