[{"rating": 5.0, "review": "The comfort I needed.", "verified": true, "helpfulness": "0/0", "author": "Fabiano Aguiar"}, {"rating": 5.0, "review": "Perfect product.", "verified": false, "helpfulness": "0/0", "author": "WorldChampSpurs"}, {"rating": 5.0, "review": "I now have one of these in both televisions in my home and have absolutely no use for cable. It's brilliant!", "verified": true, "helpfulness": "1/1", "author": "Tiffany Dawn Klos"}, {"rating": 5.0, "review": "At my home we use it mostly for projecting online movies and Pandora radio to the HDTV.  It's important to note that not everything can be projected.  I erroneously thought that it was the equivalent of having a projector wirelessly connected to your laptop, tablet, phone, etc.  It is not and it shouldn't get a lower rating just because I didn't understand exactly what it's capabilities are.  For what it will do, it does it very well.I can get High Definition entertainment to my HDTV which looks and sounds great.  I can wirelessly broadcast the contents of my browser* or ANY Chromecast enabled application to the TV.  At this time, the only two applications I really use that can cast are *Chrome (the browser) and Pandora.  I know there are applications that can be downloaded to assist with getting other things cast, but I haven't used any of them an can't comment on their usefulness or trustworthiness.  So...if I want to broadcast a Netflix or Amazon streaming movie, I use Chrome (the browser) to accomplish this. Pandora can be cast from the iPhone and perhaps other mobile OSs.As of this writing, I don't think there are Chromecast plug-ins/addons for IE or Firefox so the only browser I cast from is Chrome.", "verified": true, "helpfulness": "0/0", "author": "Dale Edwards - Santa Lucia Highland valley - California"}, {"rating": 4.0, "review": "Need more apps to use with it but awesome for YouTube.", "verified": true, "helpfulness": "0/0", "author": "Doc Divot"}, {"rating": 5.0, "review": "I bought two at the same time as the price was great. I now have three and use all of them. Two at home, and one for travel. The work very well", "verified": true, "helpfulness": "0/0", "author": "John A. Johnson \"Avid Reader\""}, {"rating": 3.0, "review": "Bad reception, sometimes lags... not the greatest for streaming. However, it works most of the time and carries out its purpose.", "verified": true, "helpfulness": "0/0", "author": "Thomas Pham"}, {"rating": 2.0, "review": "Sound delay makes it uncomfortable to watch anything from my galaxy note 3 phone. Occasional pixelation occurs as well. Not happy.  On the other hand connection was a breeze.", "verified": true, "helpfulness": "0/0", "author": "Sergey I. Vakulchik"}, {"rating": 5.0, "review": "The Chromecast is just one of those devices that creates a little awe for its simplicity of design and its great performance. For 35 bucks or less you can get one of these and then load the Chromecast app onto your PC or Android device, sync up the device on the network with the app. In my case I don't normally use Chrome, but downloaded so I could use this device and its simple to just log into Netflix or Amazon Video and pull up a movie and the \"cast\" it over to the Chromecast and start watching it on your TV. I have it hooked up to an older Plasma TV that has an extra HDMI port but is doesn't provide sufficient power, but the guys at Google already thought of this and included an AC adapter to power it. Pretty neat overall, though it does get quite warm in operation but hasn't faltered yet, and when I am not using it I simply unplug it.There's a reason why they have sold millions of these things -- simple, cheap, and they work well and that makes for a winning combination.", "verified": true, "helpfulness": "0/0", "author": "Coyote"}, {"rating": 5.0, "review": "It is cool. My family is enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Yewunetu"}]