[{"rating": 5.0, "review": "I love watching shows I want to watch, when I want to watch them. Very clear and sharp picture. Would recommend this to anyone.", "verified": true, "helpfulness": "0/0", "author": "Mark Lawson"}, {"rating": 4.0, "review": "The Chromecast itself is brilliant. I use it mainly for Netflix and the two integrate seamlessly. Picture is great, the controls are intuitive.Setting it up, however, took some patience. My wireless is setup through my cable box and it took quite a few forum searches to figure out you need to specify the wireless channel on your router in order for the Chromecast to be able to find your wireless network. I battled with it for a couple days and was about to throw in the towel when I found this advice on a Google forum search. Just know it may not be the plug and play for your system; you may have to do some fiddling to get it setup.But it is worth it in the end, especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Nikki Wittrock"}, {"rating": 1.0, "review": "As the title states, I'm disappointed with this device. I wanted to love it, but alas...The Good:- It automatically switches the channel when you begin casting to your TV.- You can start it from anywhere as long as you are connected to the same WiFi, distance is not an issue.- Since it basically streams it's own media, you can turn of your phone/tablet and it will just keep playing.- It's cheap.The Bad:- Very limited app support. Had to download Allcast to get some better use out of it.- Hard locked Google DNS. This may seem like a non-issue but it truly sucks if you live abroad where watching Hulu/Netflix requires you change DNS. Changing DNS at the router level is not enough, you have to reroute the iptables in your router... (For anyone trying to figure out how to do this the command is: iptables -t nat -A PREROUTING -d 8.8.8.8 -j DNAT --to-destination 0.0.0.0 {change 0.0.0.0 to your DNS and repeat this command for 8.8.4.4})- Device gets really hot while just idling- Constant error messagesAll in all I wouldn't recommend this to anyone living outside the US (hulu) or one of the major Netflix regions (US/UK/Canada/Netherlands.)", "verified": true, "helpfulness": "1/1", "author": "J. Ferreira"}, {"rating": 5.0, "review": "It's amazing piece of hardware which setup as magic and you only need to have wifi and phone or tablet connected through same wifi.Small in size and good delivery from vendor.", "verified": true, "helpfulness": "0/0", "author": "keshar hayat"}, {"rating": 5.0, "review": "Serious, I love this thing. We own 2 of them and use them all the time. Can be a slight pain to set up at the start (didn't work with one router we owned) but once you get past that it's smooth sailing... or streaming.", "verified": true, "helpfulness": "0/0", "author": "debtink \"ben@hopping.com\""}, {"rating": 5.0, "review": "While I have several appliances that can play YouTube videos(BluRay player, my TV, a computer hooked up to it), this is truly the path of least resistance. Say you find a movie or tv show on YouTube you want to put on the big screen. Just 1 click and it's over there.Doing this from my laptop I found to be the easiest. No fiddling with the numeric keypad from a remote, typing on a cell phone or tablet(but it's available), just search & go. The installation process was one time and nearly painless.The cost is the biggest draw. I have a feeling that if other manufacturers tried something like this, it would be easily $100 without the convenience and straightforward approach. I have only done YouTube videos with it, but I'm sure there's plenty more app hookups to be planned in the future.", "verified": false, "helpfulness": "0/0", "author": "S1500"}, {"rating": 4.0, "review": "Found it on sale @ AMZN for $30 Prime so I bought it to use on a bedroom TV. Installation couldn't be easier and the picture quality is great. Having owned a Roku 2 for a few years, I was accustomed to the polished UI and relatively quick performance offered by the Roku. To me, the casting button in Netflix is pretty clunky. There's normally a bit of delay when making selections and sometimes Netflix \"forgets\" it's talking to Chromecast when the phone wakes up.I don't regret buying Chromecast however with the Roku stick now available, I'd probably consider spending the extra money for the better UI and increased app availability.", "verified": true, "helpfulness": "0/0", "author": "SuperJ"}, {"rating": 4.0, "review": "Ordered this on the day it was announced. Got it fast. Got my free netflix but won't use it. I ordered a couple and one didn't work and I am too lazy to replace it oh well.", "verified": true, "helpfulness": "0/0", "author": "Gagroo Y."}, {"rating": 4.0, "review": "It didnt work for my computer right away when it was setting up but when i used my phone it started to work", "verified": true, "helpfulness": "0/0", "author": "Bishwa D Pokharel"}, {"rating": 3.0, "review": "I set this up on a Saturday night and started streaming a Netflix movie from my iPad.  I was disappointed to find that the only way to pause a streaming movie is to open the Netflix app on the iPad and press the pause button.  I think this is an inconvenient way to watch a movie, but to make matters worse, once my iPad turned off from inactivity, it could no longer locate the Chromecast.  In short, there was simply no way to pause the movie.  I wish there was an easier way to interact with the Chromecast but, unfortunately, there is no remote (physical or digital) to be used with the device.I was willing to accept this limited functionality since this product is much cheaper than similar alternatives.  However, my opinion has diminished greatly after the Chromecast damaged my Plasma TV set!  I turned the TV off Sunday night and woke up Monday morning for work.  My wife asked why the TV had been left on and I said that I wasn't sure, but I always turn the TV off when I'm done watching it.  Bear in mind, I'm always the one turning lights off behind my wife when she leaves them on.  You could almost say I'm OCD about turning things off when they are done being used.  Anyways, we both left for work on Monday and were surprised to find that the TV was on when we returned from work about 10 hours later.  The TV was on and the Chromecast \"Set Me Up\" screen was on the display.  It seems clear to me at this point that the Chromecast turned on the TV for no apparent reason.  If the nuisance of this wasn't bad enough, due to poor programming (and decision making) the \"Set Me Up\" screen does not shift at all on the screen and instead stays in place indefinitely.  The result is that I now have \"Set Me Up\" and the other Chromecast menu items burned into my Plasma TV's display.  It seems ludicrous to me that none of the geniuses at Google realized that the \"Set Me Up\" screen should periodically shift on the screen to avoid burn-in.  I have seen products perform this type of \"screen saver\" trick for many years; it is not a new concept and the exclusion of this simple protection seems unforgivable.UPDATE:  I have given this product a second chance.  I haven't looked to see if the burn-in is still evident on my Plasma, but I am hopeful it is only temporary.  I still do not particularly like the interaction between iPad and Chromecast -- it just seems cumbersome.  I streamed a movie last night using my Samsung phone and the results were better.  I was able to use lock-screen controls and the Chromecast was responsive to pause commands, etc.  This product is probably a decent replacement for the more expensive competing products, but the price point is probably the only attraction.  I will also point out that after hooking up the Chromecast again, it did turn on my TV and bring me to the \"Set Me Up\" screen.  From my previous experience, I know this screen does not lead to a screensaver and does not \"shift\" on the screen.  I think it is a really poor decision since this could lead to burn-in, as I experienced with my Plasma TV.  So far, it does not seem like the Chromecast will turn on the TV unless it is prompting for the initial set up, via the \"Set Me Up\" screen.", "verified": true, "helpfulness": "1/3", "author": "E. Chamberlain"}]