[{"rating": 5.0, "review": "I love this thing, sometimes it can be a little unstable but it works great with Netflix and all that. Hard to stream local files. Also got free 6$ google play credit for valentines day. The little offers it comes with is pretty cool.", "verified": true, "helpfulness": "0/0", "author": "Rudy \"The Man with the Plan.\""}, {"rating": 1.0, "review": "It never worked, there seemed to be some fault. Could not return it in the stipulated time, so I just did not bother.", "verified": true, "helpfulness": "0/0", "author": "Brian Pierre"}, {"rating": 4.0, "review": "Bang for your buck! There are so many things you can do with this, from watching YouTube videos, to Netflix, to games. However, the range of applications is not entirely clear unless you do your research on the device. For the devices that communicate with the Chromecast, it would be great if apps were developed to provide as a Chromecast app launcher. What better way way to show what it can do, than to show to the average user a launchpad to use all of the applications.", "verified": true, "helpfulness": "1/1", "author": "Karan Suraj"}, {"rating": 5.0, "review": "My tv is one smart tv, but i think that with Chromecast it works better than native software from tv.", "verified": true, "helpfulness": "0/0", "author": "Diógenes Hélder Bezerra e Silva"}, {"rating": 4.0, "review": "We love our chrome cast!", "verified": true, "helpfulness": "0/0", "author": "Emily"}, {"rating": 5.0, "review": "Compact and small yet has a nice fast reponse, unit communicates well wuth both wifi and bluetooth. Great product", "verified": true, "helpfulness": "0/0", "author": "Shaunagain"}, {"rating": 5.0, "review": "We use this connected to our media hub in our living room. It's not connected to a TV, just audio. It suits my needs perfectly, and evey once in awhile google will distribute coupons/free stuff/google play credit so after a couple months this little device has already paid for itself and then some.", "verified": true, "helpfulness": "0/0", "author": "Samantha Scott"}, {"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "biggiegiles"}, {"rating": 4.0, "review": "Works OK not the smartest device I own but great for the cost", "verified": false, "helpfulness": "0/0", "author": "Jeremy Martin"}, {"rating": 3.0, "review": "Nice little device but needs to be rebooted at least once a day as it appears to be connected but devices can't find it.", "verified": true, "helpfulness": "0/0", "author": "Glen"}]