[{"rating": 5.0, "review": "It is cool. My family is enjoying it.", "verified": true, "helpfulness": "0/0", "author": "Yewunetu"}, {"rating": 5.0, "review": "This was my best purchase in a long time.  Easy to install and works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Not the big real", "verified": true, "helpfulness": "0/1", "author": "Freddy taveras"}, {"rating": 5.0, "review": "Perfect for what we wanted!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It was very easy to set up and works like a charm. It starts playing much faster than the Bluray player we'd been using to stream movies.", "verified": true, "helpfulness": "0/0", "author": "Jim Wolf"}, {"rating": 5.0, "review": "Just bought a second one. Great product and Amazon is the cheapest place to get them.", "verified": true, "helpfulness": "0/0", "author": "The College Nerd"}, {"rating": 3.0, "review": "I am very disappointed that his does not communicate with and cast my Amazon Prime videos. So much so, I may return this and get the Amazon fire instead.", "verified": true, "helpfulness": "0/0", "author": "S. Matthews"}, {"rating": 5.0, "review": "easy to use. amazing product.", "verified": true, "helpfulness": "0/0", "author": "joshua"}, {"rating": 5.0, "review": "Works well. No issues with streaming.", "verified": true, "helpfulness": "0/0", "author": "Miamiu \"Gwen\""}, {"rating": 5.0, "review": "All I wanted to do was be able to screencast from OSX/Windows/IOS/Android. Whatever's on my phone, or my laptop, or my desktop in my office, regardless of the OS running, or on my friend's laptop he just brought over on a whim, I want to show up on the \"big screen\" without a bunch of hassle. And I don't want to mess with VGA cables like I'm still in the 90's. It's the 21st century, we can livestream probes landing on comets - is it too much to ask to be able to do platform-independent wireless screencast to my TV?So after spending many hundreds of dollars over many years on half a dozen other big-brand media player devices that would do a mediocre-at-best job with a specific ecosystem of devices, and require hacks to make it work so-so with anything outside of that brand's ecosystem, or hacks to make it do useful things it should have done out of the box, I was pleasantly surprised to learn that the Chromecast that I picked up on a whim would do exactly what I wanted it to for a fraction of the money I had spent on other devices - about what I spend on a tank of gas. It even turns my TV on when I begin casting and changes to the correct HDMI input.I'm keeping the Chromecast, and Ebay'ing all the other crap.", "verified": true, "helpfulness": "0/0", "author": "Michael"}]