[{"rating": 5.0, "review": "Definitely the next level from my last-gen Apple TV and Roku player.  Love the remote in particular.", "verified": true, "helpfulness": "0/1", "author": "Amy B. Chamberlin"}, {"rating": 3.0, "review": "Ok I guess. Amazon has a long way to go for Prime video content. I was excited about the Showtime app until I tried using it and it's not available for Directv or Dish subscribers. How stupid! Also needs to get HBO Go. I only seem to use it for Netflix now", "verified": true, "helpfulness": "0/3", "author": "Chris"}, {"rating": 5.0, "review": "Works great making my daughter's 32 inch bedroom TV smart. Haven't tried it extensively wirelessly. Preferred instead to connect to a powerline ethernet adapter. Works great and absolutely love the voice remote!", "verified": true, "helpfulness": "0/1", "author": "Jackie Beard"}, {"rating": 4.0, "review": "It is fast and good....but did not like the fact that I had to enter my credit card number to access some of the FREE stuff ?I was dissapointed it did not have a Youtube app.And for me it was a dissipoinment that the USB port is useless...They should make it work for flash drives and Hard Drives !", "verified": true, "helpfulness": "0/1", "author": "Ken F."}, {"rating": 5.0, "review": "First of all, it's important to say that I don't think I've explored this thing enough yet to REALLY be sure if it could do everything I would ideally want it to do. (Ex: does this have enough features that I might as well just get rid of Comcast?) But that having been said, it's already paid for itself. So, on to the list of:PROSVery easy to set up.Easy to find things while browsing.It's surprising how much content is easy to find, including a lot of fairly obscure things (all of the classic Godzilla movies, for instance.)There's a lot that is free with a Prime account.CONS:It's almost TOO easy to set up, which means that while it's extremely easy to get the Fire TV going, it's not so easy to figure out if it really has all the features you want.There really, REALLY needs to be a complete owners' manual included. There are *way* too many products and services in 2014 that still include a full, printed owners' manual for Amazon to really be justified in forgetting about it quite yet. A decent alternative would be to have a clear link to a full manual printed in the small get-started guide that *is* included. But that isn't there, either. Instead, you have to hunt it down.  Here's where I found it: Fire & Kindle Support › Amazon Fire TV Help›Amazon Fire TV User's GuidesYou can download PDF versions of the user's guides for your Amazon Fire TV and accessories.It really shouldn't be necessary for people to go through all these extra steps and embark on a fact-finding mission. It would be very easy for Amazon to either include the full printed manual that STILL comes with almost everything you buy OR to include that clear link to an online manual.Overall, though, there's no question that the Fire TV has been worth it. I'd been looking for reruns of Deep Space 9 FOREVER, and it never showed up on Comcast. It was so great to find all those old Godzilla movies. My sister is really hooked on Transparent. What I don't yet know is how many hoops you have to jump through to even find out if you CAN totally replace regular cable and still get everything you want. But I'll figure it out at some point, and then I might add to this review. The final judgment: Recommended, as long as you understand that you'll be spending some time on it, and it isn't quite as plug and play as it seems.", "verified": true, "helpfulness": "1/4", "author": "Kindle Customer"}, {"rating": 5.0, "review": "great alternative tv", "verified": true, "helpfulness": "0/1", "author": "Cheryl Martin"}, {"rating": 2.0, "review": "I purchased this because on paper it looks great.  Everything worked fine except for the Hulu app.  Which is the app I use the most.  It kept crashing.  Constantly.  The Hulu app does not crash on my Roku 3, Roku Stick or Apple TV.  Only on Fire TV.  For that reason, I returned it.  Also, voice search is nice, but it doesn't work inside of the apps.  Only on Amazon stuff.  It's an OK system, but very unstable for Hulu at the moment.  I'm sure an update will eventually sort this out.", "verified": false, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "easy to set up and use. delivered quickly", "verified": true, "helpfulness": "0/1", "author": "Good product \"cchester\""}, {"rating": 5.0, "review": "It took me 6 months in take the decision in getting Amazon Fire TV, I am old fashion and doesn't believe that small box will delivery all the entertainment that this Service offer, I got for $85 in promotion and now I cut my Cable provider and saving $80 per month, $960 per year!!!. Give a try , you have 30 days for trying and return if you do not like it, but believe me, you are going to love it and more when your Cable Bill is ZERO.", "verified": true, "helpfulness": "0/1", "author": "myqhomes"}, {"rating": 5.0, "review": "Simply Awesome", "verified": true, "helpfulness": "0/1", "author": "Vikram J."}]