[{"rating": 5.0, "review": "Gotta love these for the price. I honestly dont use it much since my Apple tv does much more. I sometimes have problem streaming video from laptop with chrome but im sure that something that will be fine tuned.", "verified": true, "helpfulness": "0/0", "author": "R."}, {"rating": 5.0, "review": "What can I say...if you are a advid Youtube craft watcher this is a must to buy for your TV viewing.", "verified": true, "helpfulness": "0/0", "author": "Barbara Y. Lacaden"}, {"rating": 5.0, "review": "great product for what it is! easy to configure. took it on the road and had to reconfigure but no big deal. would recommend if you have Netflix, HBO togo and want to easily access those apps from where ever via ipad or iphone.", "verified": true, "helpfulness": "0/0", "author": "jennifer"}, {"rating": 4.0, "review": "I love the idea of the chromecast, but must admit I had some problems at first. Once it is setup, it works pretty well. It's great to stream from Netflix or YouTube on your iphone. The only time I really have problems with it is when I move it somewhere and have to set it up again, sometimes it can be a bit finicky.", "verified": true, "helpfulness": "0/0", "author": "Scott F"}, {"rating": 1.0, "review": "I can't use this product.  I originally purchased the Amazon Fire HD tablet for several aspects,but I would have appreciated a heads up when I purchased  the Chromecast product that it would not work with the tablet.  How can I return the Chromecast and get the Amazon Stick to use with our new tablet?", "verified": true, "helpfulness": "0/0", "author": "James Smith"}, {"rating": 5.0, "review": "This was the second one I purchased for use on a 2nd TV in our house.  Works well - have no complaints.", "verified": true, "helpfulness": "0/0", "author": "Jerry"}, {"rating": 5.0, "review": "Awesome device! Don't know what we'd do without it as we don't have cable. Love that we can cast our screens!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "What crap.  I'm a systems analyst so I'm fairly technical.  Spent over an hour on the phone w/Google trying to get this garbage to work with my dual-banded Belkin router.  Once fixed, it didn't really do much.  Buy a Roku instead!", "verified": true, "helpfulness": "0/0", "author": "SCOTT FABRIS"}, {"rating": 5.0, "review": "Easy to setup and works like a charm.", "verified": true, "helpfulness": "0/0", "author": "Brian Vicente"}, {"rating": 4.0, "review": "Works really well for most things like casting directly on tv. I've been using it to cast NFL Game Pass on my TV and it has worked perfectly without any hitches as well as using it to watch tv shows from Plex.However if you are playing a video on your laptop and cast that to your tv it just keeps showing still screens every 2 seconds with audio running fine. I should note this feature (casting entire screen) is still experimental. Hopefully the kinks will be ironed out soon.", "verified": true, "helpfulness": "0/0", "author": "Ryan"}]