[{"rating": 5.0, "review": "I love Amazon, but I wont say a peoduct is awesome if its not. Firetv stick is awesome! It's credibly easy to use, with a nice interface, I even think my parents could figure it out without calling me for tech support. The remote is just the right size. Remote buttons are well placed. I had no issues at all with install or use on 2 TVs in my house.  The 'help' videos are useful, there are a lot of features I had no idea firetv stick was capable of. Very cool product!!!", "verified": false, "helpfulness": "0/0", "author": "Mariam Rudolph"}, {"rating": 5.0, "review": "Love it so far. Voice command is great!", "verified": true, "helpfulness": "0/0", "author": "dragonsmith"}, {"rating": 2.0, "review": "No because I can't use it unless I pay for everything.  It was purchased already, and it's just another way for Amazon to make money", "verified": true, "helpfulness": "0/2", "author": "Stormy"}, {"rating": 5.0, "review": "Super easy set up and now I have access to everything I need for my tv watching! I love it!", "verified": true, "helpfulness": "0/0", "author": "Sarah A"}, {"rating": 5.0, "review": "Love my Fire TV, super fast, extremely reliable - we use this every day for Netflix, Vimeo, Vevo, Amazon Prime Video, Prime photos and Amazon Music (which has karaoke-style lyrics on some tracks).", "verified": true, "helpfulness": "0/0", "author": "B. Vyas \"B. Vyas\""}, {"rating": 5.0, "review": "This is a great product. I allows user to place files, including pictures onto the tv for viewing. Love it.", "verified": true, "helpfulness": "0/0", "author": "David R Dickson"}, {"rating": 5.0, "review": "Great device. Roku and other players should be very very afraid!", "verified": true, "helpfulness": "0/0", "author": "slt"}, {"rating": 5.0, "review": "Love it!! So much better than roku.", "verified": true, "helpfulness": "0/0", "author": "Steve M."}, {"rating": 5.0, "review": "Fabulous. Far better than Apple TV. Easier almost instant set-up, voice recognition and a simple user interface. I will never go back to Apple TV again....", "verified": true, "helpfulness": "0/0", "author": "Steve Blackman"}, {"rating": 5.0, "review": "Excellent item. I watch everything I want. although some are to be paid, with YouTube features I am highly satisfied. Thanks Amazon with your new technology.", "verified": true, "helpfulness": "0/0", "author": "sat"}]