[{"rating": 5.0, "review": "Wonderful !!!!!!", "verified": true, "helpfulness": "0/0", "author": "James A. Miller  Sr"}, {"rating": 4.0, "review": "For the most part it works well, there are times where it will not display a show and you have to go out and back in again in order for it to stream.", "verified": true, "helpfulness": "0/0", "author": "CRC"}, {"rating": 5.0, "review": "The product works quickly and effeciently, it started out laggy and non-functional the first day (black screen then goes to home every time I tried to open an app) but after leaving it connected to the wifi for two days downloading the updates and getting all my apps, it now runs smoothly, clearly, and best of all no more black screens.My advise for new users make sure the device is up to date and spend the first day downloading any apps you plan to use first, that is done it should start working properly, you may need to try opening apps a few times before they open but once they do open they'll no longer give you any issues. If the issue's persist for more than the first week contact customer support or return the product.The shipping was...wow...dedication man... they(UPS mail) delivered it to my house even though there was a really bad thunderstorm outside it, I don't know if this is normal or not but it deserves praise in my opinion (5/5)", "verified": true, "helpfulness": "0/0", "author": "Jose Ramon Galvan Flores"}, {"rating": 5.0, "review": "FANTASTIC! So much better than Roku for me, since I love Amazon and buy many of the movies.", "verified": true, "helpfulness": "0/0", "author": "Max Hudson"}, {"rating": 5.0, "review": "Love it. I like the size and how easily I can carry it from one room to another if I need it. Do wish it had Vudu on it to make it my go to streaming device - we have a chrome stick for everything else that we can't play on this - but I do like ease of access to my amazon content. The controller is small, simple but fits nicely in hand. Worth the purchase.", "verified": true, "helpfulness": "0/0", "author": "Gerald L. W. Stewart"}, {"rating": 5.0, "review": "Love this product, works better than expected", "verified": true, "helpfulness": "0/0", "author": "Crowvet"}, {"rating": 1.0, "review": "I bought this thinking it would be a good replacement for my DVD player since I only stream now. I can't remember being more disappointed in a product. It must be because I had such high hopes. I've used Amazon Instant Video on my Sony DVD players, iPad, computers, Xbox 360, Xbox one, ps4, and Fire. By far the Fire interface is the most disappointing because it could be so much more.Here are some key features it is missing:1. Unable to filter and sort my video library. Really? Even my Sony Amazon app lets me at least filter by movies or tv. When I want to browse my library ( not search, browse) I have to go through all 425 entries in sequential order.2. Voice search doesn't run apps. If I search for Netflix and it finds it, then it should run the netflix app. Instead it shows me entries from the Amazon lists.3. The remote control isn't backlit. Since I don't always watch my Fire in the middle of the day. It's hard to find a tiny black remote control in the dark. Once I find it, it's very hard to make out the tiny white symbols on the buttons at night.4. There is no way to restrict searches to just my music or video library. When I search for a movie I own, I always wind up getting at least two versions of it. Usually I've paid for the SD but it's showing me the HD that I have to buy. Let me restrict searches to just my stuff.I'm sure there's more but I just can't think of it right now so I'll end the review here.", "verified": true, "helpfulness": "2/3", "author": "Zain"}, {"rating": 5.0, "review": "We are loving our Fire TV. We primarily use it for Plex, but it is nice to have our Prime account supported so nicely. It's also fun to play a game from time to time. For those apps that aren't natively available in the Amazon store, you can try them by side loading. I use ADBFire on Mac and it couldn't be simpler. We use our Fire TV every day.", "verified": true, "helpfulness": "0/0", "author": "C. Barrett"}, {"rating": 5.0, "review": "Amazing. Love this product. I have both,the fire stick and the tv. Love them both. Plan to buy two more for my basement. I use it with my plex media server.", "verified": true, "helpfulness": "0/1", "author": "Michael Ganesan"}, {"rating": 5.0, "review": "We love Amazon Fire TV, we have 3 of them. So easy to use, and we can view our photos and hm video on it. Love the voice search too.", "verified": true, "helpfulness": "0/0", "author": "Elisa"}]