[{"rating": 1.0, "review": "Hated this, gave it away to a relative. I'm sticking with the Apple TV-- much more intuitive and it may be a bit more, but with its recent price drop, you just get more bang for your buck.", "verified": true, "helpfulness": "1/1", "author": "Liz Adams"}, {"rating": 4.0, "review": "Has some connecting issues. Still isn't good with streaming from apple products. Totally get if you have android, save up for apple tv if you have apple.", "verified": true, "helpfulness": "0/0", "author": "johnny"}, {"rating": 5.0, "review": "Quick delivery and thing works great!", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 2.0, "review": "don't know how to use it and can't get much help online, not compatible with IPAD. Not happy.", "verified": true, "helpfulness": "0/0", "author": "Damariz Valentin"}, {"rating": 5.0, "review": "One of the best things I've purchased in a while! I use it almost daily, for all sorts of different tasks.  Google made another great product. It also shipped quickly via Amazon Prime.I will get more excited as more apps become compatable with cromecast (amazon instant video).", "verified": true, "helpfulness": "0/0", "author": "Tom S."}, {"rating": 5.0, "review": "as expected", "verified": true, "helpfulness": "0/0", "author": "Wilman Pimentel"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Wagner Novas"}, {"rating": 3.0, "review": "Amazon Fire Stick is a better poroduct", "verified": true, "helpfulness": "0/0", "author": "Taymonk"}, {"rating": 4.0, "review": "I was not too happy with this product at first.  It didn't seem to do anything an internet ready TV wouldn't already do.  Then I found the AllCast APP for my tablet and phone.  Now any video that is on either can be streamed to my big screen.", "verified": true, "helpfulness": "1/1", "author": "J. Webb \"Tosser's bar and grill\""}, {"rating": 4.0, "review": "I truly enjoy being able to use this.  I just started using it as of recent, but I hope there are more apps that will be compatible with it.  Like HBO Go works, but the Showtime App doesn't.  Would love to see accessibility across all streaming apps.", "verified": true, "helpfulness": "0/0", "author": "Tom Shewbridge"}]