[{"rating": 5.0, "review": "One of the best media players that I have.  Great user interface and the system never locks up.  I love the remote!", "verified": true, "helpfulness": "1/1", "author": "Mike Kelley"}, {"rating": 3.0, "review": "We've been using the Amazon Fire TV for about two months. I really like the voice search, however it only works with Amazon video and not Netflix or other streaming apps you install. We don't have very high bandwidth, but the Amazon streaming has worked really well, with little or no buffering.The interface is easy to navigate, however it's difficult to tell sometimes what item you are on because highlighting of selected  options is not clear enough to indicate what is actually selected. However, this could be more of a subjective issue.Had issues with Netflix right from the start, but after searching the web found out how to empty the cache on the apps, which helped remedy the problem of streaming apps taking extremely long to load. Which brings me to something I do not like and that is limited documentation with the product. I've received a few emails from Amazon attempting to SELL me books on how to use the Amazon Fire TV. The device itself is fairly simple to use, however some documentation on simple troubleshooting would be helpful without having to search the web for answers, or PAY for a user guide.Recently the device will no longer connect via Ethernet to our home network. Initially it hooked up wired to our home network without issue, but now for some reason will only connect wireless. Seems to be working ok via wireless, but since we have limited bandwidth assumed the streaming would work better via a wired connection. Contacted Amazon support and was disappointed with that interaction. The tech I spoke with didn't really seem very knowledgeable and said I would need to contact my ISP to configure the wired network manually. I contacted our ISP and was told the Ethernet should be plug and play and I shouldn't have to enter in any info manually. So, to say the least, I felt like a ping pong ball being bounced back and forth. Amazon did attempt to contact me after I complained, but frankly didn't feel they were reading/listening to my responses as they proceeded to instruct me how to hook up the device via Ethernet, which, as I had explained, tried and it wasn't working. I give Amazon high marks for past customer service and quick responses to customer service requests. However, I found this instance frustrating.With more and more households going to streaming and \"cutting the cord\" to regular network/cable TV streaming devices will improve.  Tweaking the interface of the Amazon Fire TV would be an improvement, and better tech support/documentation.", "verified": true, "helpfulness": "2/3", "author": "SL"}, {"rating": 5.0, "review": "Love my Fire TV.  I watch netflix and amazon prime on device, and my go to for movies.  Easy to use and set up.", "verified": true, "helpfulness": "1/1", "author": "Matt Monteiro"}, {"rating": 1.0, "review": "Useless!!!  out of the box could not log in.  as a prime member, didn't get the 84.00 price.  prime shipping failed", "verified": true, "helpfulness": "2/8", "author": "Gthayes"}, {"rating": 5.0, "review": "Love this fire TV. Easy to set up. It does exactly what it says it will do. Free movies because I have prime! So excited!", "verified": true, "helpfulness": "0/0", "author": "Latisha"}, {"rating": 5.0, "review": "We really enjoy our Amazon fire. Hulu, Amazon Prime video, Netflix and so much more on one little device. Great for kids too!", "verified": true, "helpfulness": "0/0", "author": "Stephanie"}, {"rating": 5.0, "review": "Love this - as I am an Amazon Instant Video junkie. I dont even use it for any other apps. Provides awesome 1080p HD for all my Amazon digital downloads.", "verified": true, "helpfulness": "1/1", "author": "Dr. Tom's Reviews \"Tom Hunter\""}, {"rating": 5.0, "review": "as advertised.", "verified": true, "helpfulness": "0/0", "author": "Robert H. Mcganty"}, {"rating": 5.0, "review": "Bought as gift for my daughter.  She loves it", "verified": true, "helpfulness": "0/0", "author": "Boog"}, {"rating": 5.0, "review": "Handy", "verified": true, "helpfulness": "1/1", "author": "R. Pinson"}]