[{"rating": 5.0, "review": "great product that works the way its suppose to. easy to stream online video to your tv with the press of a button", "verified": true, "helpfulness": "0/0", "author": "Frank Schiraldi"}, {"rating": 1.0, "review": "I had high hopes for this. But couldn't not get it to work more than a few seconds at a time. Wifi is very weak. Also, I expected to brouse the web with my chrome brouser, but it does't work that way. If you don't do Netflix, youtube, or buy google movies then your out of luck. Just not any use to me. Will probably send back.", "verified": true, "helpfulness": "2/3", "author": "Byers"}, {"rating": 4.0, "review": "Simple and easy to use. Nice product with no bells and whistles. Can't beat it for the price. Size is great..", "verified": true, "helpfulness": "0/0", "author": "Michael W. Smith"}, {"rating": 5.0, "review": "Anything I want so far to play thru my phone I can play on my old dumb 42\" flatscreen.  It just works.  I now have a smart TV and only for a $35 investment.", "verified": true, "helpfulness": "1/1", "author": "R. Bergren \"www.bergren.net\""}, {"rating": 3.0, "review": "Depending on (currently zero) app support this dongle is primarily useful for youtube streaming and that's about it.  It seems that if they open the apis up we'll see lots more interesting Airplay-like functionality but right now there is none.", "verified": true, "helpfulness": "1/2", "author": "Greg E."}, {"rating": 1.0, "review": "This item is not supported in my country and i can't dowload the setup from Googleplay. In our age of WiFi and world Google, I can't use this gadget. So i will bay small android dongle  from China for the same purposes.", "verified": true, "helpfulness": "0/4", "author": "alex kazak"}, {"rating": 3.0, "review": "I have a Samsung Smart TV and the Google Chromecast is interesting but does not work well with my TV, the resolution is very poor. There really is not much more I can do the Chromacast that I could not already do. So I gave it three stars for affordability, It's an interesting start but has a long way to go.  Apple TV is much much better in my opinion.", "verified": true, "helpfulness": "0/0", "author": "William R. Smith \"Bill\""}, {"rating": 5.0, "review": "This works great and was easy to set up. Just basically plug it into the HDMI port on your tv, plug in the USB power cord, and set up the wi-fi connection. This is a great Christmas present!", "verified": false, "helpfulness": "1/1", "author": "D Salzman"}, {"rating": 4.0, "review": "For 35 bucks and the integration with my android phone I am very happy with this product.  Controlling Netflix from my cell phone that doubles as my tv remote is great.  Also the integration between Youtube and the Chromecast is flawless.The only drawback is the lack of integrated apps as it is really only Netflix, Youtube, and Google Music.  If Iheartradio and Amazon Instant Video gets apps for it, it will be a great device at 35 bucks.", "verified": true, "helpfulness": "0/0", "author": "drew"}, {"rating": 3.0, "review": "I was hopeful for this device and expected to own 2-3 of them. Wasted my money on just one.I own Apple TV, Negear Push2TV, Roku, Bestbuy Rocket Fish Miracast, and Samsung media dongle.  Im in constant search for the best wireless video display and source mirroring. I have found the Apple TV and Samsung Allshare cast dongle the best and most reliable connections and with few limitations to stream content.The Chromecast has potential, I guess, but is mostly I can't do that.If you are looking for a way to play your purchased Google movies, Neflix and You Tube, and THAT's ALL, from your closed WiFi network, this might be for you, and minus Google movies via Apple.  At present, only Netflix and You Tube can be streamed via Apple devices. But if you have other needs, it's not ready.If you want to use it at a hotel or other secure open wifi, it won't work.THE WAY IT WORKSFrom what I can tell, the device seems to be a smaller version of a media streamer, e.g. Roku player.  I think it works independently of of the tablet, phone or computer that you set up the wi-fi it works through.  However, even if your phone is connected to a wi-fi connection, the Chromecast won't connect if it is not truly an open connection or it does not connect through a secure password. E.g. if you connect though a network that requires you to enter the password via a browser after provider connection, it wont connect.  I also tried connecting it to a secure public network with WEP/WPK and the Chromecast would not connect.Although its claimed someone reverse engineered the device and could play media off the device, it seems the the Chromecast actually accesses the internet independently and not through the controlling device. Your computer, tablet or phone is only used to enter the wifi code through the Chromecast.WIFI REQUIRED, NOT WI FI DIRECT-DOESNT WORK ON PUBLIC NETWORKSDespite its small size, this is not a Miracast device and it needs to access the internet independent of the alleged source device.  It's unlikely to work on an open secure wi-fi system, and unlike Apple TV, which can still stream source media even if the internet is down, Chromecast can not stream if the internet is not working. I also tried connecting it to a secure public network with WEP/WPK and the Chromecast would not connect.NO PROFESSIONAL APPLICATIONI was hoping to project powerpoint and business applications, but it cant be done, not even through Chrome browser.  The most you can do is stream Chrome internet media, provided both the device and the computer have internet access.", "verified": false, "helpfulness": "1/2", "author": "Amazon Customer"}]