[{"rating": 3.0, "review": "Not super useful at the moment. It makes my one remaining \"dumb\" TV a little smarter, but only with a few apps at the moment. I don't subscribe to Netflix or Hulu, so I can't comment on those, but I have used it for HBO GO, which worked well (although I could have watched it through On Demand, too). I haven't had much luck with the browser plug-in (laggy) or streaming my own media through RealPlayer (very slow to start). I think it will become much more useful once Google releases a public development kit and more apps can get in on the action.One more note: ANYONE on the wifi network that it's connected to can stream to it. There's no password or security, so don't expect to use it in a college dorm (or similar situation). My brother had to leave his at home for that reason.", "verified": true, "helpfulness": "0/0", "author": "Rob W."}, {"rating": 4.0, "review": "Do you have Netflix, Hulu plus, watch a lot of YouTube?If yes, buy this Chromecast. (it works well with supported services)If no, it's probably not worth it...It could have been my wireless network, but the Chromecast did not work well when I tried to stream video from just a regular website and not one of the supported sites. Apparently, you can cast anything in a chrome window (including local video files etc) but the quality and lag made this almost unbearable. The best option (and cheapest) for playing video from your computer to TV is still a regular HDMI cable for $5.", "verified": true, "helpfulness": "1/2", "author": "chasm"}, {"rating": 5.0, "review": "I bought 2 of these for Christmas gifts and both my wife and son are thrilled! They were very easy to set up and have worked perfectly since we have received them. Both like to stream TV and Movies through Netflix and now they can each do it in separate rooms at the same time without the hassle of using the Wii to do so. Plus, the ease of which to show all your pictures,slide shows and movies from the Ipad is worth the price alone. Cost less than at Best Buy and shipping was free......a deal for sure! I always love the great service I get through Amazon......", "verified": true, "helpfulness": "0/0", "author": "Jack"}, {"rating": 4.0, "review": "I recently purchased this and it is extremely easy to setup and use.  I wish there was more content that I could stream to it but for the price, I can't complain.", "verified": true, "helpfulness": "0/0", "author": "CoquiLostInNY"}, {"rating": 5.0, "review": "I Love this thing, I use it for mainly for netflix as i did not want to waste another device holder for the owner of the netflix account (My Bro) i decided to do research and came back to this as i looked into this before release. finally bought it Christmas day, arrived quickly which was great. so i test start with this on a 40 inch and i am telling you now, Netlfix looks amazing on this device. me and my sister watch and enjoy shows and the quality is great, even the background images are impressive lol. if you do not have a smart tv or cannot bring netflix to your big screen for any reason, i recommend this for their great quality product and their great pirce. sorry if this review does not help the way i typed this but i just trust me. This device kept me loss for words.", "verified": true, "helpfulness": "0/0", "author": "Tommy L."}, {"rating": 4.0, "review": "My son was not expecting this, so he was pleasantly surprised to receive it. He is happy to be able to control it through his ipad. The only issue he has occasionally is it seems to disconnect from his ipad. I am not sure why, but he mentioned it so I thought I would include it in the review.", "verified": true, "helpfulness": "0/0", "author": "GGLUVBUG"}, {"rating": 4.0, "review": "My Chromecast was simple to set up, easily switches between multiple users/devices in the house, and does exactly what it is supposed to do - if only there were more things to do with it, this would get 5 stars.", "verified": true, "helpfulness": "0/0", "author": "soldmymind"}, {"rating": 4.0, "review": "This has turned into my goto media consumption device.  It works perfectly everytime.  I would pay $35 for a netflix set top box, so one that does Google Play Movies, Music, Hulu, and Pandora was a no brainer.", "verified": true, "helpfulness": "0/0", "author": "sean shaikun"}, {"rating": 5.0, "review": "I bought the Chromecast during the holidays just to see what it was all about. At $35.00 ($29.00 on sale), I had very little to lose. Set-up was a breeze and it wasn't very long until I started using it. I can now sit on the couch with my iPad and watch HBO and Netflix without having do deal with the pain of hooking it up to the TV. My daughter can even sign in to my Netflix account and control the TV through her phone. Although it's not perfect, as sometimes it stops while buffering, it's one of the easiest and cheapest ways to watch video from multiple devices on your TV. I can't imagine any video service not having this ability for their video streaming (I'm looking at you Cinemax Go). I love it!", "verified": true, "helpfulness": "0/0", "author": "J. Perkins \"mrradiotvfilm\""}, {"rating": 5.0, "review": "It's an easy and fast setup. But must be clear you have to have a google compatable phone, or labtop for it to work.", "verified": true, "helpfulness": "0/0", "author": "Kathy Johannes"}]