[{"rating": 5.0, "review": "I like this Chromecast very much. I am having no problems with it. Set up was very easy. Works on both my smartphones and my Nexus 7 2013.Also works on Windows 7 x64 with the Chrome or Chromium browser extension.Can not get it to work with Linux (slackware64) yet.", "verified": true, "helpfulness": "0/0", "author": "R.E.M. \"REM\""}, {"rating": 5.0, "review": "What a fun accessory - it is well priced, super easy to set up, and fun to use....great to travel with too.", "verified": true, "helpfulness": "0/0", "author": "Daniel Grover"}, {"rating": 3.0, "review": "I don't use this often -and when I go to use it again - it does not seem to remember its connection - and dropped a lot. When it works it is fine. I found it in a store at a lower price than online - but I bought it here on amazon.I have heard more devices are coming out on the market that my have better connectivity and ease of use.But since my use of this is infrequent - I will probably slog along with this one until I hear of something else that does this function that is compelling - and at a reasonable price.", "verified": true, "helpfulness": "0/0", "author": "Mark W Mitchell"}, {"rating": 1.0, "review": "Bought one,  tried and tried  to make it work Too Too complicated.  Never got it to work,  sent it back. Don't waste your time.", "verified": true, "helpfulness": "0/1", "author": "L. Morales"}, {"rating": 3.0, "review": "thought i would use this more...seems to just sit in TV.....works well but seems to have limited content i can access....didn't really need it considerig i have a computer contented now to my TV", "verified": true, "helpfulness": "0/0", "author": "Carah \"And that's where the hornet stung me....\""}, {"rating": 5.0, "review": "Useful device. I use this from my phone and computer. So far no issues at all. It is worth for the price.", "verified": true, "helpfulness": "0/0", "author": "Basker Ganesan"}, {"rating": 5.0, "review": "Love it, just plug it in and let it do the work for you, watch movies, listen to music, play games!! I think everyone needs one of these, cut the cost of what you paying now to more than in half!!", "verified": true, "helpfulness": "0/0", "author": "Daniel Dwyer"}, {"rating": 4.0, "review": "I was expecting to be able to do more with my phone that is why it isn't rated higher.  You can stream from your laptop or notepad devices.  Limited apps on phone - and you have to pay for most of them.  I like google tv better. For overall operation.I guess I got this for streaming and being easily moved from tv to tv so - in the future I may think differently.", "verified": true, "helpfulness": "0/0", "author": "Terry Overbo"}, {"rating": 2.0, "review": "Not as advertized. Difficult to get it to work. Could not even get it to work. They need to back to the drawing board on this one.", "verified": true, "helpfulness": "0/0", "author": "Marcia Carey"}, {"rating": 1.0, "review": "Dont like it - I cant use it with my Modem - Its not what I wanted - bad choice", "verified": true, "helpfulness": "0/0", "author": "shyamala"}]