[{"rating": 5.0, "review": "I was recently given a television after not owning one for more than 10 years. I've never had cable, and to my surprise, prices are through the roof. So, after lots of research, I decided to get the Chrome. The shipping was quick. Once received, the setup was easy. I'm sure this little gadget does many things, but I mainly use it to play music from my phone on the television. I know, maybe my friend should have given me a radio instead lol. Periodically, I cast YouTube videos and Netflix. The picture is always clear and it doesn't skip/freeze. Hope this helps.", "verified": true, "helpfulness": "1/1", "author": "NATURALBEAUTY78"}, {"rating": 3.0, "review": "I didn't know it was just casting/streaming from my computer, mobile and tablet, I thought it had the ability to run programs itself.", "verified": true, "helpfulness": "0/0", "author": "Rodrigo Marcus"}, {"rating": 5.0, "review": "Wonderful item, love it.", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 3.0, "review": "First off, I have been very pro google for years, but I just can't help but notice the decline in quality. The basic, just doesn't work no matter what you try. I have been through three Chromecasts, and have seen one hardware failure, and connection failures in all three. Get used to seeing \"Cannot find your Chromecast\". Oh and don't think that trying to set it up from a Chromebook will help, because it's worse. I've had better success setting up via PC. I have never, in my year of trials with the Chromecasts, gone longer than a week of needing to run the setup wizard again. Or even reset my router. I actually even upgraded to the latest router I could find to try and make the Chromecasts happy (on that note, why doesn't it have 802.11ac?) with no success. This is a sub-par product that should still be called \"beta\" like Google does with most everything else. Avoid for now.", "verified": true, "helpfulness": "0/0", "author": "C. Rich \"C. Rich\""}, {"rating": 3.0, "review": "its just okay when it works its awsome but the videos can be choppy at times", "verified": true, "helpfulness": "0/0", "author": "Das Vacuum \"Willkommen!\""}, {"rating": 5.0, "review": "For the price, you just cannot beat this thing. If you use chrome or any Google services, you're going to love this. We use it primarily for HBO Go which is now supported and it works like a dream.", "verified": true, "helpfulness": "0/0", "author": "WillK"}, {"rating": 5.0, "review": "Works perfect and was a good buy with quick Prime shipping!", "verified": true, "helpfulness": "0/0", "author": "Amy Jellison"}, {"rating": 5.0, "review": "Use it all the time. Love it.", "verified": true, "helpfulness": "0/0", "author": "Amy-lynn Engelbrecht"}, {"rating": 5.0, "review": "Really good. It works as expected", "verified": true, "helpfulness": "0/0", "author": "Jeremy D George"}, {"rating": 5.0, "review": "Fantastic...Very easy to install & set up....Great product...", "verified": false, "helpfulness": "0/0", "author": "JTK"}]