[{"rating": 5.0, "review": "Great  piece of equipment. It does a great job of buffering  Amazon prime, Netflix, Hulu etc. I was using a smart TV  or smart BD player before, Fire TV is so much better. The voice search works 99% of the time for me, and I don't speak that  clearly. I have heard that this will soon work with Netflix. It would be great if voice search worked across all streaming APPS.I look at the gaming capability as a plus. I have a PS3, this is not a PS3 and I believe it was not intended to be. If you don't have a game system you will definitely like Fire TV's.It is very easy to set up. The online tutorials tell you just about every thing you need to know.", "verified": true, "helpfulness": "1/2", "author": "Duke"}, {"rating": 5.0, "review": "Love my new Fire TV. Easy setup and quick to respond to commands. I've enjoyed several free Prime movies already. I also have an Apple TV and find the fire much easier and quicker.  However, I miss having a direct connection to my Mac. I'm experimenting with the amazon Cloud Drive and think I will be able to view my photos with that. Overall, it's worth the money.", "verified": true, "helpfulness": "1/2", "author": "Lulu1"}, {"rating": 5.0, "review": "This is an amazing product.  If you're kind of technical but not super technical, hopefully you will find my review helpful.  I use my streaming devices mostly for streaming Netflix and Amazon and a few other things here and there.  I have two Smart TV's (different brands), an Apple TV, a Sony Streamer, iPads and computers.  Apple TV is great to pair with Apple products, but it doesn't allow Amazon to get in there.  Let's face it, Amazon is becoming a must have!  My Smart TV's are just okay, I use them when I am in those rooms.  The Sony was not very good, though it allowed me to have Amazon.  The problem was the speed of the Sony, and this streamer was placed in the room I stream the most.  Over the years, the Sony has gotten slower and slower.  So after a week of constant interruptions and buffering during streaming, I got fed up and started looking at new products.  I was torn between the Roku 3 and Fire TV, so I read reviews to help me with my decision.  The reviews were pretty similar between the two.  I became impulsive and went to Best Buy to check out the Roku 3 in person.  Much to my surprise, they had the Fire TV.  The decision was made on the spot...mostly for speed alone.  Some of the complaints of the Fire TV, did not affect me.  Such as it doesn't pull up \"Prime\" movies/shows for streaming.  It did in fact show the Prime movies/shows blended with the Non-Prime movies/shows, so I didn't understand the complaints.  However, since purchasing this (2 weeks ago), Amazon already improved that and have a \"Prime\" section that is separate from the ones you need to pay for.  They have also added more apps and accessibility that people were complaining about.  Even the guy at Best Buy made the comment that \"if there are updates or extra things needed, Amazon will fix it and update their firmware\".  So just know that, and it's already proven true since I purchased it.  As far as the appearance is concerned, it's a thin small black box with a small light on it.  You don't even notice it.  The remote is ultra familiar, similar to the Apple TV remote as far as controls are concerned.  It does have the Voice Control, but I'm just not in the habit of using it, so not sure how much it will matter to me.  The Sony remote was horrible - buttons all over the place with no back light...I had to hold it up to the TV or use my iPhone as a light if I was watching it in the dark as it's not savvy to use by memory like the Apple TV and now the Fire TV.  You can't turn the Fire TV off, but it cuts itself off after a certain amount of time.  I guess I'm indifferent to that feature, but it seemed odd to me at first.  The biggest selling point of the Fire TV is the speed.  It is so instant and I have not seen any lock ups or need for buffering.  You make your selection, press play, and boom - it's starting.  My husband can be tight with purchases at times, so he was kind of ticked when I bought the Fire TV, since we already had a \"working streamer\" (though he complained constantly with the lock up's on the Sony).  We left the Sony in that room b/c we wanted Amazon access and that was the only option.  As soon as I actually set up the Fire TV, he watched me stream a movie and he was mesmerized by the speed.  The $100 purchase seemed to not bother him anymore.  He is still amazed at the speed and comments on it almost every time we watch something.  The price of the Fire TV is comparable to a few others, so it makes sense to spend that much if you are wanting to get a nice and quick streamer.  It makes even more sense to choose the Fire TV over the others as it has everything you want, and if it doesn't now, I'm sure it will later.  Amazon seems to be listening to customer concerns and updating the system to make constant improvements.  So if you are trying to search for the best product, go for this.  You won't regret it!", "verified": true, "helpfulness": "3/4", "author": "Canfit"}, {"rating": 5.0, "review": "I am a huge Apple TV fan for interface - but simply love the speech lookup - makes it so easy - really love this and makes  use of your Amazon Prime membership - games well just ok - but the streaming is great - maybe just a bit pricey needs to be $20 cheaper.", "verified": true, "helpfulness": "0/1", "author": "GatorMan"}, {"rating": 5.0, "review": "As always, Amazon delivers-happy customer.", "verified": true, "helpfulness": "1/2", "author": "Nydia I. Diaz \"Aidyn52\""}, {"rating": 5.0, "review": "Pure awesomeness!", "verified": true, "helpfulness": "1/2", "author": "John P Cavanaugh"}, {"rating": 5.0, "review": "Great device still have a few tweaks needed but you can see that this will make any user happy.", "verified": true, "helpfulness": "0/1", "author": "Jason G."}, {"rating": 5.0, "review": "I don't have this yet but im definitely going to replace my roku box with this,my friend has it and i really love it,similar to my roku box but way more cool features,i can wait to order mine next week!!", "verified": false, "helpfulness": "0/0", "author": "Nick"}, {"rating": 5.0, "review": "LOVE IT.", "verified": true, "helpfulness": "1/1", "author": "Christian"}, {"rating": 4.0, "review": "The video quality is excellent.  There are only 3 negative things I'll say about it.  First, the remote (and game controller) is too sensitive.  Often when you click left, right, up, or down, it will move two places (like you intentionally clicked twice); second, Amazon has been advertising that thousands more games are coming (particularly free ones like Roku has).....I'm still waiting for more games to come; third, when watching a TV series that is Amazon content (whether Prime or ones you bought) when an episode ends it should automatically start the next episode in the series as it does in the Netflix application on the device.  Work these things out and I will not only give it 5 stars but will firmly state it exceeds the Roku devices.", "verified": true, "helpfulness": "0/0", "author": "Paul Bismarck"}]