[{"rating": 5.0, "review": "I loved it, work very well and is easy to install and use. It would be great to have more mobile applications with support for Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Isaías Gätjens M"}, {"rating": 3.0, "review": "I thought it would allow screen mirroring.  But it does allow some content to stream to TV.", "verified": true, "helpfulness": "0/0", "author": "Rodney Jackson"}, {"rating": 1.0, "review": "It doesn't work", "verified": true, "helpfulness": "0/0", "author": "Mani Degani"}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/0", "author": "richard himle"}, {"rating": 4.0, "review": "I wish Chromecast worked on more of my apps on my iPad, otherwise it works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Magyar641"}, {"rating": 5.0, "review": "I completely got rid of Cable TV in my house now.  I have an antenna for local channels and use this for every thing else! Really happy about being done with cable.  I can watch everything I can get on my computer or tablet now on the TV.  I have 4 one for each TV.", "verified": true, "helpfulness": "0/0", "author": "Grant Graves \"semi-consumer\""}, {"rating": 5.0, "review": "This is the absolute best idea ever! We own two of these and have given them out as Christmas presents. We love watching youtube videos and this makes it ten times easier. We've had occasional issues with it disconnecting, but nothing major that couldn't be fixed. We really love that is so easy to use. Simply look for the icon on your desktop, laptop, tablet, or phone and you can connect it to your TV.Must have for any home!", "verified": false, "helpfulness": "0/0", "author": "Jennifer"}, {"rating": 5.0, "review": "I have a Roku, a smart TV, and two Chromecasts.  Out of all of them, the Chromecasts are my favorite.  It is so much easier to find something using my phone and sending it to the TV as opposed to using my remote to type out what I am looking for.  It's to the point where I refuse to use video apps if they do not allow casting (hello, Amazon Video).  And you simply can't beat the price.  Yes, I have two and want a third.", "verified": true, "helpfulness": "0/0", "author": "andrewt522 \"Andrew T. Mason\""}, {"rating": 5.0, "review": "Awesome for streaming from Tablets, Computers, phones, etc. We have tw of these now, worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Cody & Chelsey Craft"}, {"rating": 5.0, "review": "Finally!", "verified": true, "helpfulness": "0/0", "author": "daniel"}]