[{"rating": 4.0, "review": "If there is an app that is made to communicate with the Chromecast, it should work just fine.  Netflix, Chrome browser, and YouTube work great.  I wish it would allow for PC mirroring better.  PC mirroring is iffy at best.", "verified": true, "helpfulness": "0/0", "author": "Eric Ericson"}, {"rating": 5.0, "review": "Love the new electronics!", "verified": true, "helpfulness": "0/0", "author": "Satisfied customer"}, {"rating": 4.0, "review": "I originally bought this so I could watch Netflix or my movies on Google Play while traveling. Come to find out that most hotel WiFi won't support this device in doing that. After finding that out, and being grumpy about it, I brought it home and plugged it into my own TV to set it up. Where I have devices at home to watch Netflix on I didn't have a way to watch My Google Play purchases so that's what I primarily use this for. With my phone, the Note 3, I'm still able to use my phone while it's streaming and it doesn't appear on the TV. Overall I'm still happy with the purchase, just not happy I can't use it while traveling.", "verified": true, "helpfulness": "0/0", "author": "Jill W"}, {"rating": 5.0, "review": "Great product, 100% recommended.", "verified": true, "helpfulness": "0/0", "author": "Tyrone"}, {"rating": 5.0, "review": "Every bit worth the money.  Greatest little streaming device made.", "verified": true, "helpfulness": "0/0", "author": "C. Price"}, {"rating": 5.0, "review": "Best purchase I made all year! Should have done it sooner. :)", "verified": true, "helpfulness": "0/0", "author": "Carley Brookes"}, {"rating": 5.0, "review": "Great product, use it to watch lots of Youtube", "verified": true, "helpfulness": "0/0", "author": "Larry M."}, {"rating": 5.0, "review": "Works great, should have bought it sooner.", "verified": true, "helpfulness": "0/0", "author": "E. Johnson \"ejohn\""}, {"rating": 5.0, "review": "excellent, 100% recommended", "verified": true, "helpfulness": "0/0", "author": "Pedro Méndez"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "RALPH1972"}]