[{"rating": 2.0, "review": "It only support netflex and youtube, and probably very few other sites.  I expect it can work in a general way.  Most site that I visit does not support it, especially chinese sites.  And, it has LED light always flashing when it is plugged on the TV, very bright during night.", "verified": true, "helpfulness": "0/1", "author": "wenshen kao"}, {"rating": 2.0, "review": "Have been unable to get it to recognize my Linksys router. I may eventually get it but for now a no go.", "verified": true, "helpfulness": "0/0", "author": "vnzjunk \"vnzjunk\""}, {"rating": 2.0, "review": "I no longer use this since it is just super inconvenient.  I purchased this due to the low price point and thought it would save me from transferring downloaded items to a flash drive to watch.  Since it came with free netflix time...it was basically free.Since you can't control playback...you have to go back and forth to your computer constantly to pause of fast forward or whatever.  So you won't want to get this if your computer is in another room.  You can ONLY use certain file types with this.  It won't work with things like VLC player so make sure the file types you have will play n chrome.  (Drag and drop them into the browser). I believe .avi is the file type that doesn't work with this.  It's one of the two popular file types...I can't remember since it has been so long since I've bothered using this.  Far easier to just load a flash drive with a bunch of stuff.Really just a waste.  Get a roku if you need to play netflix on your tv...that's way more convenient.", "verified": true, "helpfulness": "0/1", "author": "MaiLau"}, {"rating": 4.0, "review": "I use this as an alternative to hooking up my PC to my TV via HDMI. It is nice to immediately have the option to use Netflix on my non-smart TV. Only issue is sometimes it is hard to get the phone to recognize the device is present. It doesn't work with many apps at the moment, but hopefully there will be updates in the future. Responses can be sluggish at times.", "verified": true, "helpfulness": "1/1", "author": "Travis Bagley"}, {"rating": 2.0, "review": "Great idea but alot of bugs to iron out! ! Make sure you have the correct operating system for connecting.", "verified": true, "helpfulness": "0/1", "author": "Ray Stewart"}, {"rating": 5.0, "review": "I have only used it thus far for Netflix and YouTube videos.  The quality is awesome.  super easy to set up. I was so happy with it I decided to buy 3 more for family members. Can't wait to get them Tuesday. excited for my family to experience them. A+ product.", "verified": true, "helpfulness": "0/0", "author": "Ciana"}, {"rating": 5.0, "review": "At a really low price i can wirelessly send my desktop to TV.. simply love it... good bye roku and others..", "verified": true, "helpfulness": "0/1", "author": "shopper"}, {"rating": 5.0, "review": "Google Chomecast is fantastic. I take it along on business trips and watch streaming video content from Amazon's video library, and Netflix's video library.", "verified": true, "helpfulness": "0/0", "author": "Zachary"}, {"rating": 4.0, "review": "I have the Google Chromecast in my kids’ playroom.  I like the fact that I can choose and play a Netflix movie from anywhere in the house, that it doesn’t tie my phone to the TV and that I can use almost any mobile device (Tablet, laptop, chromebook, ipod, smartphone, etc…) to choose a movie.  The only downfall is that if I forget to play a movie, the Chromecast home screen creates screen burning.  It already happened on my LED tv.", "verified": true, "helpfulness": "0/1", "author": "ichuyi"}, {"rating": 2.0, "review": "Can't use your phone as a WiFi connection. Woulda been nice to know that up front. Ughhh spent two hours to trying to hook up", "verified": true, "helpfulness": "0/0", "author": "mike mendez"}]