[{"rating": 5.0, "review": "It works exactly the way it was expected!", "verified": true, "helpfulness": "0/0", "author": "Giles L. Klinka"}, {"rating": 5.0, "review": "you shouldnt even be looking at reviews... just buy one", "verified": true, "helpfulness": "0/0", "author": "Cole"}, {"rating": 5.0, "review": "Great device.  Makes streaming content to your TV easy.", "verified": true, "helpfulness": "0/0", "author": "Michael J Manning"}, {"rating": 2.0, "review": "Well this chromecast seems pretty cool and worked okay for about two days. Streaming my gs5 to it has proven more than a pain. It frequently disconnects or stops to load. I have to set it up over and over, and it will only work for a couple minutes at a time. Of course you can't call Google for tech support so I'm throwing my chromecast in the garbage. It's pretty unusably bad to be honest.", "verified": false, "helpfulness": "0/0", "author": "Andy Untch"}, {"rating": 5.0, "review": "better than expected. i googled to find out how i could see my desktop on my tv and google chromecast was mentioned over and over again.  keep in mind you must have an android smart phone or i phone as this is wi-fi based.  it is easy to download the drivers and you will be 'casting' within minutes.  you can show your desk top or internet content, including streaming on your tv.", "verified": true, "helpfulness": "0/0", "author": "detroitdolly"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "T. Vale"}, {"rating": 3.0, "review": "MUST have strong wifi connection", "verified": true, "helpfulness": "0/0", "author": "Blair Kuethe"}, {"rating": 3.0, "review": "I'm having trouble streaming with my weak internet. But it's frustrating because Netflix is fine on my computer but then all choppy on the TV. I'm trying to increase my internet speed and then we'll see.", "verified": true, "helpfulness": "0/0", "author": "Jill"}, {"rating": 5.0, "review": "Bought 3, one for each TV. If you know how to use it, it works perfectly.", "verified": true, "helpfulness": "0/0", "author": "TacticalDad"}, {"rating": 4.0, "review": "works great.", "verified": true, "helpfulness": "0/0", "author": "derickson"}]