[{"rating": 5.0, "review": "Works perfectly", "verified": true, "helpfulness": "0/0", "author": "josiah"}, {"rating": 5.0, "review": "Love it. However you have to be careful, the more you plug it in and unplug it swapping between tv the HDMI connector starts to get loose and will eventually stop working. Highly recommend more than one if you plan on swapping it between TVs.", "verified": true, "helpfulness": "0/0", "author": "Daniel Oberg"}, {"rating": 5.0, "review": "Received quickly.  Easy setup and installation. Was streaming android tablet screen in 10 mins", "verified": true, "helpfulness": "0/0", "author": "Tony"}, {"rating": 5.0, "review": "Love, love, love this device!", "verified": true, "helpfulness": "0/0", "author": "neversaynever956"}, {"rating": 5.0, "review": "Works great!! East setup!! Arrived earlier than expected", "verified": true, "helpfulness": "0/0", "author": "Shae Horn"}, {"rating": 1.0, "review": "I don't know what all the fuss is about.  Yes it does what it says but it's missing one big component.  There's no SMB video player that will broadcast to Chromecast???I have a server with all my media.  Music and videos.  And I use SMB video player like Dice Player to stream videos to my devices.  But Dice Player doesn't work with Chromecast.  I find video player that works with Chromecast but then they don't have network feature.  I found one that have both.  Videostream for Chromecast but doesn't work properly.  I can only start/stop playing from the computer and controlling it from the smartphone doesn't work.Just playing from Dice player on my smartphone and casting the screen to Chromecast yields poor quality.Yea, the pictures work well.  But I got this device for picture gallery?  Get it right google.", "verified": true, "helpfulness": "1/1", "author": "Brian Choi"}, {"rating": 2.0, "review": "need wi fy", "verified": true, "helpfulness": "1/2", "author": "Paul J."}, {"rating": 5.0, "review": "I initially rated this with 4 due to some unstable connection until I found it written somewhere that the HDMI extender it comes with can help strengthen the signal, and yes, I'm now in love with that I got another 3 devises to gift. I have connected it to my family room TV where my 65+ mother spend most of her TV time and she likes it too. Simple installation and 1 click connection from any psird device.", "verified": true, "helpfulness": "0/0", "author": "Lamees"}, {"rating": 5.0, "review": "Perfect for streaming anything you want - lightweight, compact, and speedy. Great product!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it. I will buy it again.", "verified": true, "helpfulness": "0/0", "author": "J"}]