[{"rating": 4.0, "review": "First lets talk about the device, it is pretty great. Very intuative to set up and there are plenty of apps. If you are into the develper thing it offers plenty of choices without having to root it. Now as for the support, I had an issue with Amazon Prime videos not playing. I was boinced around to several departments before landing in the correct one almost an hour later where the issue was quickly resolved. Amazon could have prevented this by having on shore support instead of outsourcing it to another country.Overall this is a great media player for everyone, beginner to advanced.", "verified": true, "helpfulness": "2/2", "author": "Jeff Chamberlain"}, {"rating": 2.0, "review": "I sent it back....this seems overly complicated  to use,....possibly because it is Amazon centric.  I found it difficult to access other channels and impossible to add TED Talks.Maybe it is good for gamers,I do not know.", "verified": true, "helpfulness": "0/3", "author": "R. Stanhope"}, {"rating": 5.0, "review": "Excellent product and according to my experience I love it more than Apple TV and ChromeCast.", "verified": true, "helpfulness": "0/0", "author": "Jatinkumar"}, {"rating": 2.0, "review": "We are not pleased at all with the amount of shows that you have to purchase on the Amazon Fire TV even though we pay for prime and we paid for the unit itself.  Most everything we try to go to watch it has a fee.  There is no way we are paying to have the grand kids watch the old TV shows we grew up on.  The picture quality is poor and the most of them are in black and white.  It is ridiculous.  The voice recognition is not good for me at all but my husband can get it to recognize what he is trying to tell it about 80% of the time.  Very disappointed to say the least!!!!sorry but I would think you would rather hear the truth.  I wouldn't be surprised if more people haven't complained..", "verified": true, "helpfulness": "2/3", "author": "Mary"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "Ang"}, {"rating": 3.0, "review": "I normally like Amazon and their products, but this one fell really short for me.  We own four Roku boxes and one Apple TV box.  So, we thought we would give this one a shot.  Installation of the box was simple.  Getting Netflix to work on the box was a nightmare and ended up resulting in a call to their tech support department.  The tech support department was very nice and was eventually able to solve the issue with an update of the firmware.  With that said, I have been so disappointed in the interface.  I probably should have expected it, but I didn't.  The interface is so predominantly focused on Amazon streaming that it makes other apps/tv options difficult and cumbersome to find and use. Unlike the Roku boxes where all of your channels are at the top level, on the Amazon box, they are buried.  It also forced me to re-enter my password constantly for Netflix.  This is so annoying.  Another thing that drives me absolutely crazy is on the new releases.  It drives me nuts to have to select a new release and go to it's page to see if it is available for rent. So many of them are only available for purchase.  Amazon needs to put these in a completely separate category so we can just avoid them instead of wasting time.  My daughter has been begging to purchase the remote for games (which I have refused, because that's what our gaming systems are for), as most games are are finding can't be played with the remote, so there is another $40. I wish they would categorize the games more appropriately.  I still haven't figured out a way to make the dolby stereo work even though our tv is capable of it.Okay... now for the things I like.  It does seem to stream a bit faster without issues.  I like the voice search, although it really only works on Amazon.  I like that they have separated prime viewing videos.  I like that I no longer have to input my pin number to order video on demand rentals.Overall, I wish I could recommend this box, but I really don't recommend it.  I think the Roku is so much better, as it isn't focused on just Amazon content, but rather overall viewing content from many channel providers.  So, while this may have a couple \"nifty\" things, they just aren't enough to outweigh the negatives on this box.  So, back to Roku we go.", "verified": true, "helpfulness": "2/2", "author": "MKinz \"Mindi\""}, {"rating": 4.0, "review": "this is a better way to stream than the Comcast. no trouble hooking it up either. amazon prime has a lot of options too.", "verified": true, "helpfulness": "0/0", "author": "Daniel bounous"}, {"rating": 3.0, "review": "I didn't think I was going to like the remote but it turned out to be very intuitive and it's nice that it doesn't require line of sight. The voice search works better than any other system I've ever seen (Google Voice, etc). The interface is pretty simple and intuitive as well.My main issue with this is that some moron engineer decided to build this unit with no power button. You can turn it on with the Home button, but there is no way to shut it off. Supposedly you just leave on the home screen for 30 minutes and it shuts itself  off. 1 - it's not acceptable to me to waste 30 minutes of electricity for no reason other than lazy,poor design. 2 - it doesn't actually work. It stays on for days until I unplug it.On a much more minor note, it's really limiting that the voice search only searches Amazon Prime, not Netflix, Hulu, Pandora, etc. It wouldn't be THAT hard to make the different software interface... The customers would definitely appreciate it", "verified": true, "helpfulness": "1/2", "author": "Jennifer Rhodes"}, {"rating": 4.0, "review": "Just \"hooked\" this up to my TV, great product and easy to install and pair with our wifi - only drawback is that you have to buy your own hdmi cable!!  That's why I gave it 4 stars - otherwise I would have given it 5 stars.", "verified": true, "helpfulness": "0/0", "author": "J. Mitchell \"ashlynlee\""}, {"rating": 1.0, "review": "Worked for 1 week. Then player would not activate. Called Amazon return number. Transferred to 3 different agents. Spent 24 minutes on phone to Amazon Fire TV agent asking me to unplug & plug in adapter many times with long pauses between requests. I kept saying it would not activate. Her response was \"unplug adapter...\" etc. Hung up in frustration.", "verified": true, "helpfulness": "1/2", "author": "Retired AL"}]