[{"rating": 5.0, "review": "This is possibly the best thing ever invented. The only way it is hard to set up is if you can't read. Wait, scratch that, the directions on the inside of the box (there are three steps) are written out in pictures. This thing is amazing. What I love the most is that it is super portable. I've used it for everything from the usuall stuff like TV shows, streaming YouTube and Comcast to some other stuff like a projector replacesment - I just cast my powerpoints from my smartphone!Buy this. Buy one for every TV you have. Do it now.", "verified": false, "helpfulness": "8/8", "author": "Del Belcher"}, {"rating": 5.0, "review": "Great product this should just come with every TV", "verified": true, "helpfulness": "0/0", "author": "mike"}, {"rating": 5.0, "review": "Got rid of my ugly looking Sony smp with this small device. But very small number of apps available that really work with chromecast with most of them in beta version.", "verified": true, "helpfulness": "0/0", "author": "Prasanna Bableshwar"}, {"rating": 4.0, "review": "the chromecast works great. it does exactly what I need it to do and does it very well. im sure more and more apps will be compatible in the future. with a little research online you can do some of the things that the chromecast is limited to do out the box. otherwise great product", "verified": true, "helpfulness": "0/0", "author": "Bert Anthony Morales"}, {"rating": 5.0, "review": "AMAZING", "verified": true, "helpfulness": "0/0", "author": "Amy Stansfield"}, {"rating": 5.0, "review": "Easy to install, works great, terrific bang for the buck!", "verified": true, "helpfulness": "0/0", "author": "Reviewer1977"}, {"rating": 5.0, "review": "My internet performs much better than ever before!!!", "verified": true, "helpfulness": "0/0", "author": "Red_Leopard \"101\""}, {"rating": 3.0, "review": "Requires a separate internet connection to stream, (👎) but is still good for UPnP on a local network. (👍)", "verified": true, "helpfulness": "0/0", "author": "zay hill"}, {"rating": 2.0, "review": "I am not able to get anything to play using this item. Maybe I am doing something wrong, but I can't get my Amazon Prime to stream to my tv.", "verified": true, "helpfulness": "0/0", "author": "CAMooreofme2"}, {"rating": 5.0, "review": "Very good item. Fast shipping", "verified": false, "helpfulness": "0/0", "author": "Claudio Ureña"}]