[{"rating": 5.0, "review": "Love it. It's really small, really easy to set,  and not noticeable.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Virrueta"}, {"rating": 4.0, "review": "Sometimes is bad, with the connection", "verified": true, "helpfulness": "0/0", "author": "FRANCISCA FORTE"}, {"rating": 5.0, "review": "Amazing little device! Technology is surprising now-a-days!It works as shown on the commercials, and if you haven't seen any, basically you plug the Chromecast to a smart TV (it has to be plugged into an outlet in order to work) then download the application to your phone and/or tablet and start streaming! The image is flawless and plays perfectly. You just control it from the device you decide to use.The only bad thing is that if you wanted to stream from a Laptop/Computer you'd need to download google chrome and then the chromecast add-on. And even still, the videos don't load well and they get stuck.Other than that I haven't had any issues with it! Recommended!", "verified": true, "helpfulness": "0/0", "author": "Adriana D"}, {"rating": 3.0, "review": "works great at home but I need it to work in hotels when i travel. I have not been able to get it to work yet.", "verified": true, "helpfulness": "0/0", "author": "Alex Lucero"}, {"rating": 4.0, "review": "It can not connect to Google and thus no function at all until you put it into a VPN/SSH-enabled router", "verified": true, "helpfulness": "0/0", "author": "undersound"}, {"rating": 5.0, "review": "Had to get a second one for another tv. Works well", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Bought several for every TV in the house. We love them!", "verified": true, "helpfulness": "0/0", "author": "OC/1251"}, {"rating": 5.0, "review": "Love that I can watch Netflix on my old Sony Bravia while working on my laptop. And move the Chromecast to my office TV to watch there. Works great! EZ setup and use.", "verified": true, "helpfulness": "0/0", "author": "IrishGirl"}, {"rating": 5.0, "review": "One of the best Attachments you can add to your TV.....", "verified": true, "helpfulness": "0/0", "author": "SSTRIKER"}, {"rating": 5.0, "review": "Gotta have a Chrome if you don't have a truly smart TV. Netflix, Youtube, easy stream from Android phone of local and network media", "verified": true, "helpfulness": "0/0", "author": "Mebobbob"}]