[{"rating": 5.0, "review": "It streams pretty nicely considering how slow my phone is, and on my tablet it's even smoother since I don't have as much of a storage issue.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Chofis \"Fia SuperStar\""}, {"rating": 4.0, "review": "Does what you expect, the Chromecast market is expanding. Nothing astounding yet but there is great potential.", "verified": true, "helpfulness": "0/0", "author": "christian smith"}, {"rating": 2.0, "review": "I purposely waited at least 3 months to review this item because it's still so new.  For the first few weeks, we could stream Netflix with absolutely no problems.  About 2 weeks ago, it started \"freezing\" during play - the movie just stops dead for about 30 seconds while it \"reloads\".  This is INTENSELY annoying!!!Yesterday, while I was updating some of my software, I noticed that Google dropped a \"BETA\" update to the Chromecast.  At this point, the Chromecast will be returned as soon as possible since it now freezes up no less than 10 times per 90 minute movie.  Don't waste your cash on this one, folks.", "verified": true, "helpfulness": "0/0", "author": "Nancy Barnhart \"itsonlybeadz\""}, {"rating": 5.0, "review": "I love mine, my daughter bought ROKU and wishes she had bought what I got!  No mistake, it's worth the money", "verified": true, "helpfulness": "0/0", "author": "Melinda buys \"The Fouche' Institute\""}, {"rating": 1.0, "review": "Not what I thought it would be.  Streaming takes too long and it is choppy and there are delays constantly.  Very hard to watch anything.Back it went.", "verified": false, "helpfulness": "0/0", "author": "John Izzo"}, {"rating": 5.0, "review": "Best deal for the money, This item has made my normal HDTV into almost like a smart TV for a lot less money.", "verified": true, "helpfulness": "0/0", "author": "David Bowers"}, {"rating": 5.0, "review": "We got this to work after some trial and error attempts. Once we got it synchronized with wife's ipad it seemed to work good. We have yet to hook it up to my Fire Kindle 7HD.", "verified": true, "helpfulness": "0/0", "author": "Richard Sandstrom"}, {"rating": 5.0, "review": "Best 30$ investment I've made", "verified": true, "helpfulness": "0/0", "author": "bayron aguilar"}, {"rating": 3.0, "review": "I purchased this specifically so I could stream Amazon Prime Video content on my television. Wish I'd read the reviews from other people before I did. When will Amazon stop being so proprietary and allow streaming on something other than their own device?", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A MUST HAVE! 👍👍👍", "verified": true, "helpfulness": "0/1", "author": "Jillian Rochon"}]