[{"rating": 5.0, "review": "My fiance and I don't have cable, we use Netflix and his external hard drive on his Playstation to watch TV and movies. When we upgraded to a bigger TV and put it in the bedroom, we needed to move the Playstation as well in order to watch TV, which left our original TV in the living room unusable. We bought a cord to connect my laptop to the TV to watch Netflix that way, but it was a pain in the @$$ and I didn't like that I couldn't use my laptop while it was hooked up to the TV. My brother received Chromecast as a Christmas gift and told me he liked it so I decided to try it. I had a little difficulty figuring out how to set it up, but that was nothing YouTube and Google couldn't show me how to do. Now we can watch Netflix from my laptop without having to hook it to the TV and it works great! I'm not sure why so many people are having issues (according to other reviews). I downloaded the Chromecast app and Netflix for my Android phone and that worked too, but it does too much damage to the battery life, and I find using the laptop easier. This is a great product if you're in a similar situation!", "verified": true, "helpfulness": "0/0", "author": "chels_21"}, {"rating": 1.0, "review": "Doesn't work as advertised.  Drops connection from my laptop like a hot potato.  I do not have Netflix so maybe it works with that, but Amazon Prime movies do not work.", "verified": true, "helpfulness": "1/3", "author": "Kindle Customer"}, {"rating": 2.0, "review": "A child could do it!  Maybe that's my problem - I'm long since not a child!  I am having difficulty getting this up and running. It is all installed on one TV but it won't cast nor am I having success in adding \"apps\" or finding free apps that will allow me to add them and access certain TV channels. One difficulty seems to be with router settings and either enabling or disabling PnP (Plug and Play) I have searched for clear instruction on how to access this on my router and then do whatever is required to see if this opens the gates but to date I have not succeeded and I frankly am a little disappointed. Could be I need to find and hire a ten year old.", "verified": true, "helpfulness": "0/0", "author": "l'homme de guerre"}, {"rating": 5.0, "review": "I had high expectations and they were satisfied.  My kids love it (ages 2 and 4).  They know how to work the iPad (Gen 1 and Mini) to watch Netflix, and YouTube.The Chromecast is so easy that once I set it up and explained it to them once, they now can find a show on the iPad and put it on the big TV.  It's great to see them able to use it.  I've also gotten more use out of my Netflix, and YouTube accounts because it just feels better watching some of those shows on the main tv, instead of through the computer, tablet or phone.Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Rob S \"Rob S.\""}, {"rating": 5.0, "review": "This thing is just amazing.  Super easy to use and we now have Netflix and anything else on my iPad on our tv screen.  Totally portable as well - I travel a lot and most hotel room tv's have a hdmi port so off I go!  Love it!", "verified": true, "helpfulness": "0/0", "author": "Dave"}, {"rating": 5.0, "review": "Easy to use. Allows me to do so much more with my laptop. Worth the money I paid for it.", "verified": true, "helpfulness": "0/0", "author": "rhonda"}, {"rating": 5.0, "review": "At first I thought I was only going to be able to see videos and listen to music with this chromecast hdmi streaming media but I was able to view anything that I could access on the internet from my computer.  So it's a great cheap way for you TV to have access to a full web browser.", "verified": true, "helpfulness": "0/0", "author": "Cutie"}, {"rating": 5.0, "review": "i love this product! no lagging and works great with any type of tv as long as it has an hdmi port", "verified": true, "helpfulness": "0/0", "author": "tvargas"}, {"rating": 5.0, "review": "I really like the chromecast, I have become of fan of television programs like Orange is the New Black. Prior to getting this device I watched on my Kindle.", "verified": true, "helpfulness": "0/0", "author": "LaShonda Harvey"}, {"rating": 1.0, "review": "The only videos I can are from YouTube and the image is blurry. Not sure if is me or the device .", "verified": true, "helpfulness": "1/2", "author": "Dee Colon"}]