[{"rating": 5.0, "review": "Got it for the lady and she loved it! Setup was a breeze and streaming was simple. Great price for a great piece of tech!", "verified": true, "helpfulness": "0/0", "author": "Lance Corporal Fozzington"}, {"rating": 3.0, "review": "Sometimes works. Sometimes eh.", "verified": true, "helpfulness": "0/0", "author": "william richards"}, {"rating": 1.0, "review": "Worthless - Fire Stick is 1,000 times better.  I would return this NOW if I could, what a ripoff. It is not plug n play, I have to go into my router and change stuff.. I am not familiar with that so I am not going to mess with my router. Bottom Line, it doe s not work, it is a waste and a scam - shame on google, shame on Amazon for selling this.", "verified": true, "helpfulness": "1/2", "author": "RJL \"RJL\""}, {"rating": 5.0, "review": "the Google Chromecast is a must have for any tech enthusiast. from being able to share your favorite videos/photos/music to being able to screencast your favorite apps/games. you are sure to get your money's worth in no time. and with the included bonus of getting hulu plus and Google Music free for 90 days getting a Google Chromecast will be one of the best tech buy decision's you will ever make.", "verified": true, "helpfulness": "0/0", "author": "c, juarez"}, {"rating": 1.0, "review": "Crushed. This was the only gift I got for Christmas and it does not work with my kindle fire HD. I have no way to return it either because it was a gift or I would exchange it for a fire tv stick. =(", "verified": false, "helpfulness": "0/0", "author": "Holly Cowden"}, {"rating": 5.0, "review": "Totally worth the money! Google has rises above all others such as Roku simply because of its ease of use through your smartphone. If your into watching movies or simply watching YouTube videos. I current have 3 one for each TV and even my grandma uses it to seek through the Netflix app.", "verified": true, "helpfulness": "0/0", "author": "JEFF GAONA"}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Thuy Dang"}, {"rating": 5.0, "review": "Wonderful product, fast ship, will get lots of use.  Purchased a few for gifts, very well received.", "verified": true, "helpfulness": "0/0", "author": "Ducky Brennan \"Duxnest\""}, {"rating": 3.0, "review": "On first install I received a message that chromecast was having difficulty gaining access to my wifi (I don't remember the \"exact\" phrase that popped up on my tv screen but that was the gist of it). Then Chromecast reported it found a work around of its own (again that wasn't the exact phrase, but the gist of the message).I was then able to cast a prime video playing on my bedroom laptop to my bedroom tv with the chromecast installed on it. HOWEVER it then knocked my Roku3 & Micca Speck that were/are connected to my Living room TV out of service. Now I have nothing :-(Update: My Roku came back online and my Micca started to perform as usual the next day, so I changed my 1 star review to 3 stars.", "verified": true, "helpfulness": "0/0", "author": "PebbleBeacher \"Your Beliefs Don't Make You a Better Person, Your Behavior Does.\""}, {"rating": 5.0, "review": "My son is very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Judy Paris"}]