[{"rating": 4.0, "review": "Very good. Once remote navigation is mastered a very useful tool. Could still have a much larger movie selection, but this is not the fault of the device.", "verified": true, "helpfulness": "0/0", "author": "Jean Paul Daval"}, {"rating": 1.0, "review": "I purchased this for Plex. It doesn't play most of my Plex video files. It looks like the Plex program version Amazon Fire TV uses is super outdated so the problem isn't on Plex's end. If I still had the box, I would return this in a second. My chromecast was much cheaper and works much much better. I'm about call this a loss and go buy another chromecast. Don't buy this! If you own it, maybe if more people complain Amazon will actually fix the problem.", "verified": true, "helpfulness": "3/11", "author": "ibecraiger"}, {"rating": 5.0, "review": "Love this product!  We have both an Apple TV and a Sony Media Player, along with two other DVD players that have a mix of Internet choices.  By far, the Amazon Fire TV is our favorite.", "verified": true, "helpfulness": "2/2", "author": "K. GARRON"}, {"rating": 5.0, "review": "Amazon fire is awesome. It replaced a Roku which I liked, but was constantly reloading. I do think having Prime is a necessity as individual episodes (TV) are expensive. Amazon passes do help if you are sure you want to watch the whole thing. My single criticism is that I have  a difficult time reading the print on the screen as it is so small. Would like to see  some type of magnification capability.Good job overall Amazon.", "verified": true, "helpfulness": "0/0", "author": "Shank8 \"shank8\""}, {"rating": 1.0, "review": "I like this product much better than Chromecast or AppleTV. Unfortunately, performance has deteriorated to being almost unwatchable on Netflix. Seems like an anti-competitive measure to let the app for Prime Instant Videos to competitor to perform poorly while Prime works great.", "verified": true, "helpfulness": "2/3", "author": "tdell"}, {"rating": 5.0, "review": "Keeps from tying up my computer.  Easy to use.  Had to work through  the  sound settings.  I would recommend it to others!!!!!!", "verified": true, "helpfulness": "1/1", "author": "harleybob"}, {"rating": 4.0, "review": "I like the Fire TV. IT is much better than the Sony media player I use now.  I loved that all I had to do was inbox it and plug it in and it set itself up and just worked.I was able to add some apps and games (my girls love that) and browse and watch movies all in a few minutes.However, all is not perfect.  The user interface is a little awkward. I still have issues finding stuff in prime.  I wish I could re-order the choices to my preference.My biggest peave is that I can't turn it off. IT takes 30 mins to goto sleep so my auto hdmi switcher won't go back to my dvr when I want it to.  I have to manually switch back.  Amazon says to turn off the Fire TV I need to unplug it.", "verified": true, "helpfulness": "2/3", "author": "TitanCamper"}, {"rating": 5.0, "review": "Amazon fire is a very good video streaming device that is especially well suited to Amazon prime members. Picture is high quality and very smooth. It is extremely easy to use. We enjoy the many viewing opportunities available with amazon prime and a Netflix subscription. Highly recommended to anyone considering adding a media streaming device to their entertainment portfolio.", "verified": true, "helpfulness": "1/1", "author": "JPW"}, {"rating": 3.0, "review": "I am sure this is a good product, but everything I want to watch costs. And nothing is cheap. Redbox is cheaper and most of this is free on Netflix. My grandson enjoyes the games.", "verified": true, "helpfulness": "2/5", "author": "Mary Rubio"}, {"rating": 4.0, "review": "PROSI received my streaming player with game controller and it was very easy to setup. My account was already setup and I had very little to do in the way of setup. It is easy to navigate and find what you need. The voice search works very well and it is surprisingly accurate. Amazon prime is seamlessly integrated, Prime movies are labelled at the top-left so you know it is part of your Prime subscription. I must say that, probably due to the design and user interface, it is way more easier and faster to find content to watch. It takes me longer on other streaming play (while browsing) to find content.The games work really well and the graphics is good. The display look really nice and overall graphics is sharp. The unit work very well without any glitches and connects easily to my network. I am very pleased with this unit and I'll easily recommend it. The price is also very good.CONSThere is a limited selection of apps and games available but the ones that are available are good. Also the results from the search feature only contain links to content that you have to purchase. For instance, even though 'Max steel' is included in my Netflix subscription, when I use the voice search to find 'Max Steel', the links that come up only have options to buy. I should not have to buy what is already included in my subscription. Going in through Netflix and using Text Search, I was able to find and watch 'Max Steel' without purchasing. Hopefully this will be fixed. Also, I may have missed this but there should be an option to require a pin during purchases. I also did not find an option to power down the unit. I am still exploring the unit but I could not find the option to setup more than one user for the games. There is no web browser or TV pass-through.", "verified": true, "helpfulness": "3/3", "author": "George D. Massaquoi"}]