[{"rating": 2.0, "review": "Worked beautifully, until it didn't.My eight year old RCA ran it gorgeously.I bought a new 1080p Sanyo and it no longer displays anything more than a glimpse of the Amazon logo on booting. The resolution/refresh rate is wrong, but there's no way to fix it. Even the automated resolution cycling fails to work.Bizarre and annoying, but it's probably easier to return the FTV than the television.", "verified": true, "helpfulness": "2/3", "author": "Will H."}, {"rating": 3.0, "review": "The basic devise is ok as something to stream with but there seems to be a problem with some of the apps. The Netflix app for one does not work right. When I try queuing a show from a  tv series, I usually will get a promo instead of the show and have to fiddle around to watch what I want. I switched to streaming with my Blu Ray & that don't happen. I'm also disappointed with the available games. I bought this and a game controller thinking it would be a cheap occasional game devise, but like I said, the games available aren't all that good.  I don't think this is any better than a Roku, Blu Ray, or any other streaming devise.", "verified": true, "helpfulness": "3/3", "author": "cruiser"}, {"rating": 5.0, "review": "Love  it.", "verified": true, "helpfulness": "1/1", "author": "Billy yancey"}, {"rating": 5.0, "review": "outstanding product!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "How did I live before Amazon Prime and Fire TV? I use this to stream Netflix and HBO Go as well as Amazon Prime. I have retired my Bluray player and DVDs, which always seem to hang or were unplayable. Reliable streaming video with tons of free content, and most is more easily managed than the ON Demand features from TWC. I can also take it with me when I travel, as long as there is an Internet capable TV and wifi available. Some of the very best money I have ever spent!", "verified": true, "helpfulness": "2/2", "author": "Lisa Tolbert"}, {"rating": 4.0, "review": "The Amazon Fire TV is very fast and reliable. The voice search is amazing and cut you a lot of time. I really like it.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Adames"}, {"rating": 4.0, "review": "Works as advertised.  Turned our t.v. into a Smart TV, able to stream Netflix and Amazon Prime videos with no difficulty.", "verified": true, "helpfulness": "0/0", "author": "AzTchr"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "harini racherla"}, {"rating": 2.0, "review": "Purchased to replace BoxieBox but is not as intuitive or as configurable.ProsSmall unit, good aapearance, remote is good feel and weight, lots of capability. Android based.ConsTime zone support not good, non Amazon apps don't appear in correct place, screen saver is not configurable and does not activate as soon as it should, Amazon have stood the unit from bein rooted(why?)For joe blow good product for advanced user just OK.", "verified": false, "helpfulness": "1/2", "author": "Rodney Sommerich"}, {"rating": 4.0, "review": "I've had this for quite a few months now and mostly no problems. I am afraid that it may start getting more glitchy though. For some reason sometimes when I press pause on a movie it will play the audio of a random movie I've already watched or it will play the audio of prime music I've listened to last. Would be good as a feature but this is obviously a glitch.", "verified": true, "helpfulness": "0/0", "author": "Roger B. Eber"}]