[{"rating": 5.0, "review": "Love it. Fast downloads. With Amazon Prime have not had to pay for anything yet!", "verified": true, "helpfulness": "0/0", "author": "Shelley Pettit"}, {"rating": 5.0, "review": "I got this for my dad for the holidays. The product itself gets 5 stars...However I did have to go and get an HDMI cable because my dad did not have an extra one.This product is much better than the sticks.", "verified": true, "helpfulness": "0/0", "author": "pH 14 \"pH14\""}, {"rating": 1.0, "review": "WE ARE VERY UNHAPPY AS MY HANDICAP SON WAS ABLE TO VOICE ORDER A MOVE WITH ENTERING A PASSWORD AND WE WERE CHARGED, WE DID NOT APPROVE THIS PURCHASE AND THE MIX BETWEEN PRIME AND PAY IS FAR TOO CONFUSINGTHIS NEEDS TO BE CORRECTED AND IN THE SET UP CLEAR INSTRUCTIONS ON HOW TO PREVENT UNAUTHORIZED PURCHASES AND AVOID THE BAIT AND SWITCH METHOD", "verified": true, "helpfulness": "0/2", "author": "David Tringo"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Erik J. Leerkes"}, {"rating": 5.0, "review": "I received this for Christmas and it's great!  I can now watch Netflix, UTube, etc in my bedroom.  Don't need the computer.  It was so easy to set up, still playing with it.", "verified": true, "helpfulness": "0/0", "author": "blw"}, {"rating": 5.0, "review": "Great product.  Works perfect", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I have it mounted behind my Vizio smart TV, which also has Amazon/Netflix which stream perfectly, albeit with a much less convenient search feature. Sadly, the Fire TV is buffering for around 20 seconds every couple of minutes, nothing is watchable. Clearly this is due to inferior range as compared to all other devices in the house. It is going back.  The voice search is great, although Amazon only is searched.", "verified": true, "helpfulness": "0/0", "author": "drift \"drift\""}, {"rating": 4.0, "review": "I just set it up and so far it is great !  The only reason I don't rate it a 5 star is I have only very little time with it , I can say though that installation and setup was amazingly easy, I believe it will be great from what I have seen so far with it ..Great value and I can use my android phone and laptop with it .", "verified": true, "helpfulness": "0/0", "author": "bruce"}, {"rating": 5.0, "review": "Brings my Kindle Fire content and a whole lot more to TV screen. The only broadcast I don't get is local TV news or direct TV, but easy enough to switch modes. Love to voice recognition feature!", "verified": true, "helpfulness": "0/0", "author": "Bz"}, {"rating": 5.0, "review": "Still testing it.....but Its pretty cool.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]