[{"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer \"Ava Maria\""}, {"rating": 4.0, "review": "I like it.easy to install. Need more FREE tv shows.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Amazing device very powerful and snappy !!", "verified": true, "helpfulness": "0/0", "author": "Carlos_Tico"}, {"rating": 4.0, "review": "Enjoying content not found on other services, as well as speed of download, and pleasant images on screensaver when paused.  This made a terrific Christmas gift for my husband.", "verified": true, "helpfulness": "0/0", "author": "Christi Powell McClintock"}, {"rating": 3.0, "review": "Could be a game changer...Cost of device + cost of prime is about excessive, considering the unaccounted expense of \"cutting the cable.\" Also, most of the content we watch: diy shows, network TV shows -- amazon still makes you pay-per-view or \"buy\" an entire season. I prefer a more on-demand kind of service.Lower the cost of the actual device's, expand the FREE content library (within Prime) and consider the \"GAME\" -- CHANGED!!", "verified": true, "helpfulness": "0/0", "author": "Alexander Mugatu"}, {"rating": 5.0, "review": "This is a plug and play device. Worked very well. Very impressed with it.", "verified": true, "helpfulness": "0/0", "author": "Edward R."}, {"rating": 5.0, "review": "So far, I'm quite happy with my new Amazon Fire TV. I'm hoping to see a lot more apps in the near future.", "verified": true, "helpfulness": "0/0", "author": "Carol Holaday \"Joysprite\""}, {"rating": 4.0, "review": "The Amazon Fire TV works as advertised. It would be nice if it could accommodate more of the Kindle apps; I have several on my Kindle Fire that would be nice to show on the TV. And I do see where the Amazon apps are not always as fully functional as the same app on an IPad (example is Campus Insiders where I could watch something live on the IPad, but not on the Kindel). While it is possible to find multiple movies or TV shows on the Amazon website, the Fire TV itself does not have much of a browse feature. Once the movies or TV shows are in the Watchlist, they can more easily be accessed. And of course, the search function will bring up some, but not as well as it should.  I hope over time that there are ongoing improvements. For what it does have, it works very well, and was extremely easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Bren \"Perfer cozy mysteries for audiobooks\""}, {"rating": 1.0, "review": "Very limited in offerings and apps would not always load. I ended up returning and will look at other products out there to fill this need.", "verified": true, "helpfulness": "2/4", "author": "Mike Nolop"}, {"rating": 5.0, "review": "I purchased this for my daughter for Christmas she absolutely loves it I love it it's easy to set up it's easy to navigate through love the little microphone you can just say what you want to watch and it pops up right away that makes it so easy for my 6 year old she can also play games on it with the game controller it's so cool if your Amazon Prime member you get instant video if your netflix subscriber that is also available on the device I usually never give a product 5 stars but amazon definitely hit the nail on the head with this one", "verified": true, "helpfulness": "0/0", "author": "troy"}]