[{"rating": 5.0, "review": "When you get  this it is already synced to your amazon account so just install and you are ready to go !!The voice remote is Awesome,it just make a life a little easier and who doesn't want that I am not tech savy and it was easy for me to learn", "verified": true, "helpfulness": "0/0", "author": "carol"}, {"rating": 3.0, "review": "The Fire TV Box is awesome, but I am disappointed about what movies are free to watch. Even as a Prime member you have to pay for the successful films. Even the very first episode of NCIS cost money.Like I said the box is great. I got Netfilx, there the movies and TV shows are free.", "verified": true, "helpfulness": "0/0", "author": "Stefan Cohrs"}, {"rating": 5.0, "review": "Amazon fire is awesome! Easy to set up and use. Being overseas we needed a good option to enjoy our favorite shows from back home. We also use it for Netflix and Slingbox. Is amazing!", "verified": true, "helpfulness": "0/0", "author": "Mrs.B"}, {"rating": 5.0, "review": "Simply incredible and well worth the investment!! You can pay for this in one month vs paying for cable! You get everything you could want and more! Love the selection it offers! You can pair this with your current cable subscriber but I would use someone else's to save money!!", "verified": true, "helpfulness": "0/0", "author": "Mommy2Cali&Tristan"}, {"rating": 3.0, "review": "Ok product. Needs a restart switch. When it freezes, the only option is to unplug the device.", "verified": true, "helpfulness": "0/0", "author": "marc white"}, {"rating": 3.0, "review": "Would be nice to get more and better selection on \"Prime\" free movies.", "verified": true, "helpfulness": "0/0", "author": "Pete"}, {"rating": 4.0, "review": "Works great!!", "verified": true, "helpfulness": "0/0", "author": "tyson smith"}, {"rating": 2.0, "review": "If you have DirecTV, do not plan on using the A&E;, History, or Lifetime Apps because when you got to enable them, there is no selection for DirecTV. Amazon goes from a 4 to 2 for this blunder.", "verified": true, "helpfulness": "0/3", "author": "B. W. Leikam"}, {"rating": 5.0, "review": "Love it. Can watch all my movies and listen to my music.  So easy to set up.", "verified": true, "helpfulness": "0/0", "author": "Cathy B Loftis"}, {"rating": 5.0, "review": "It's a pleasure to use.  Voice recognition is pretty special but not 100% quite yet.  Has all the apps you'd want and works great.  More refined than the Roku 3 in appearance and sophistication of operation.  I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "P. Speelman"}]