[{"rating": 4.0, "review": "excellent device, with minor requirement fo enhancement.it would be nice if they could support all media.i would be nice if they could support local PC movie cast.", "verified": true, "helpfulness": "0/0", "author": "abdulaziz"}, {"rating": 4.0, "review": "I like the standard Netflix, Hulu, YouTube apps.  It works great for that!  I'm hoping Google will improve the TabCasting (still in BETA) since it lets you screen-cast anything you see on the web from your computer screen.  However, the current resolution is too low and too pixelated to be a good solution, it will do in a pinch, but not for a movie!", "verified": true, "helpfulness": "0/0", "author": "JWJAHARK"}, {"rating": 5.0, "review": "I was on this very website scanning replacement options for my dying Roku 2, which could no longer hold a WiFi signal or play a Netflix movie longer than 5 minutes at a time, and the customer feedback was strongly suggesting that the newer models had all the same problems right out of the box.  The initial run on Chromecast was over, meaning they were available, so I thought I'd give it a try.  At only $35 I would be stupid not to. Man, am I glad I did.  This thing is better than myrRoku ever was.  In several months of use, it has only spooled once during a movie, and only for a few seconds at that.  It has never lost my WiFi signal, even though I don't have it in an ideal location.  And the HD picture quality is gorgeous.  Okay, there aren't many apps for it yet.  At $35, if it never did more than Netflix,  Pandora, and Google Play, it would still be a bargain.  But that situation is about to change rapidly.  This is Google we're talking about,  after all; remember when Android was the underdog?  This is a great product that is only going to get better.  Note:  I downloaded the Chromecast app onto my Android phones and iPad tablets.  The user interface for Android is far superior to that of iOS.  Go figure.", "verified": false, "helpfulness": "1/1", "author": "Pete T."}, {"rating": 4.0, "review": "But sometimes has issues connecting. Otherwise enjoying it from the day i bought it. Use it mainly for youtube but really slow for netflix.", "verified": true, "helpfulness": "0/0", "author": "S.S.Rao"}, {"rating": 2.0, "review": "Unfortunately predicted occupy all videosBut unfortunately that does not serve only Netflix & youtubeSo I would not advise it", "verified": true, "helpfulness": "0/0", "author": "alqasem"}, {"rating": 1.0, "review": "Probably not players fault.  Just could not get a connection from computer to TV.  Other folks had same problem according to googling for a fix.", "verified": true, "helpfulness": "0/0", "author": "George P Molzahn"}, {"rating": 5.0, "review": "We purchased a Google Chromecast at Best Buy today. The device was easy to install; just plug the flash drive-like Chromecast into a HDMI port and connect the included USB cord to your television or use the plug-in adapter (also included). Using your remote, change the Input method to match the port the Chromecast is plugged in to (HDMI 1, HDMI 2, etc.). Lastly, download the Chromecast app on any devices you would like to use (tablet, android, computer) and follow he onscreen prompts to complete setup. Now you will be able to share content from your gadgets to your television by just pressing a share icon.You can have more than once device connected at a time and alternate sources with no programming/switching between each o them. Sharing mobile content is a bit more limited to specific apps (Netflix, Hulu, Youtube, etc.), but from my computer, using the Chrome browser (and Chromecast extension) I can share my Chrome browsing.We are really enjoying the Google Chromecast and I especially like that I can just \"set it and forget it\", with minimal effort required to work the device. I am hopeful that in the future, more (all) apps/content will work with the Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I am looking for a Chromecast for sometime When I saw that Amazon had it on sale for $30 I jumped on it Great work Amazon", "verified": true, "helpfulness": "0/1", "author": "William Duvall"}, {"rating": 5.0, "review": "It is the best way to broadcast your pc/phone/table to the tv and to actually work. Just make sure you are in range of the wifi network.", "verified": true, "helpfulness": "0/1", "author": "Rad"}, {"rating": 5.0, "review": "I was able to set this up in a matter of minutes. If I can do it, anyone can. It's so convenient to watch my shows/movies from Netflix with this device. I highly recommend it. I also love that I can control the TV with the app on my iPhone/iPad.I haven't tried streaming You Tube clips but honestly can't think of why I would want to. All in all, this was a great purchase.", "verified": true, "helpfulness": "0/1", "author": "Michelle \"ThinkBlue\""}]