[{"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "Tony Ventura"}, {"rating": 2.0, "review": "I set up my friends fire tv and there isnt anyway to save money. Everything costs. So much for cutting cable cost. You cant even download anything from amazon apps. I wanted Yidio for her, But that isnt possible. You should be able to download apps that you want not what they want you to watch which costs.", "verified": false, "helpfulness": "0/1", "author": "Tam"}, {"rating": 1.0, "review": "Not happy at all with the Amazon Fire TV or Amazon customer service. Installed The Amazon Fire TV this morning, I was using it for an hour listening to music walked back into the room, and noticed that it had turned off. We tried everything to see if we could get it to power back up, nothing worked. I called Amazon customer service to see if there was anything we were doing wrong, although the product is pretty straight forward. The customer service rep for Amazon had me unplug and plug back in, and of course that didn't work. I was then told that it would be replaced, and they would send me a new one. Great! Until, she told me that the delivery date would be March 26/27th. When I told her that was unacceptable she replied that there was nothing else she could do. Finally, after talking to two other managers I was told that they would credit me the price I paid and then I could go to Best Buy and purchase (which of course would be more expensive). I know this sounds like an o.k solution, and I should just move on. But, I am frustrated with the fact that I have to be inconvenienced by Amazon for their own product. I wanted to LOVE this product, in fact we have three of the fire sticks and they are the best thing ever. I am hoping that once I receive the replacement from Amazon, that I LOVE it just as much as the sticks. I am just very disappointed that  I ordered these well in advance, and because of a defective product I am now going to have to wait 21 more days to receive the product. Very disappointed in your customer service Amazon.", "verified": true, "helpfulness": "1/2", "author": "Whiskey soup"}, {"rating": 5.0, "review": "Haven't used it that much yet but, so far so good. Netflix works much faster than on my Tivo. Search seems to work just fine. Like that I can see the pics on my phone on the big screen. Maybe I'll upload all my pics so I can see them upon my TV.", "verified": true, "helpfulness": "0/0", "author": "Omega-Man"}, {"rating": 4.0, "review": "This appears to be very good and the remote response is so much faster than the WDTC Live it replaces.I did have to move the unit away from the side of the TV where the HDMI ports are (left to right) as there was an annoying chirping/squeal while watching streaming content.FireTV support are non-native English speakers and really couldn't work with me, but were polite.Content ought to be able to sort Prime only as it is a little frustrating sometimes. Can do this somewhat online from computer.PLEX I installed ($5) and this works quite well though I am still learning to use this.Crackle and Tubi TV have some different older content.Shaun the Sheep is included wiht Amazon Prime - woohoo", "verified": true, "helpfulness": "0/0", "author": "L. Jones \"angsax\""}, {"rating": 5.0, "review": "Really completes our television experience.  We no longer have cable and couldn't be happier.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Haley"}, {"rating": 2.0, "review": "I have an Apple TV, but was encouraged by my sons to try Amazon Fire TV.  I was initially underwhelmed because I could not see anything that Amazon TV offered that Apple TV offered except for games.  It is harder to control purchases on your account with Amazon TV, so really watch your credit card purchases.  The voice search on the remote is really accurate but search function searches only in Amazon environment.  So, if you are in Hulu or Netflix, it will take you out of them and go to Amazon to complete the search. If you are not careful and click on the search destination, you'll pay extra. That's walking a tightrope!  Here's the reason I ultimately returned it:  I'm stuck at home on a snow day, and the Amazon TV cannot play any of shows, and keeps giving me the error message that there is a problem with playback of the video.  Yet, I can play the same videos on Hulu and Netflix from my iPad and from my computer without issue.  If you're looking for access to a lot of games this will help, but the frustration factor for other apps is not worth it!", "verified": true, "helpfulness": "0/1", "author": "LEISADEE"}, {"rating": 5.0, "review": "Amazon fire was easy to set-up and even easier to use.  I was having issues with my Samsung T.V.  It uses a hub to access  netflix and other services and it always created a problem.  Now with Amazon Fire there are no problems and it has made using these services a joy to watch.", "verified": true, "helpfulness": "0/0", "author": "Steve Nelson"}, {"rating": 3.0, "review": "Disappointed that most of the movies and shows I would like to watch I still have to pay for, not very many free that I want to see, It is nice that I can watch almost any movie I want but still have to pay for it.", "verified": true, "helpfulness": "0/0", "author": "Sheri Pefley"}, {"rating": 5.0, "review": "Love this thing can find pretty much any movie i want to watch have it hooked up to my netflix and hulu accounts.", "verified": true, "helpfulness": "0/0", "author": "carol ann matteo"}]