[{"rating": 5.0, "review": "Best $35 I ever spent!  Love it.  I had been watching Netflix on my computer only;  now can watch on my TV.", "verified": true, "helpfulness": "0/0", "author": "Karen K."}, {"rating": 1.0, "review": "I was very excited to get the google chromecast because I do not have any way of watching netflix on my tv. This product has been nothing but a headache. I'm very disappointed. It was a waste of money. I have to reset it all the time so it will connect. After connected it works great but when you have to reset it every day it becomes frustrating. Now it won't let me connect at all! I'm not happy.", "verified": true, "helpfulness": "0/1", "author": "Jaymee"}, {"rating": 4.0, "review": "Easy to install and use, work fine with all my devices: phone, ipad, asus tablet.Very recommendable for the price.", "verified": true, "helpfulness": "0/0", "author": "Linder Reyes"}, {"rating": 5.0, "review": "I got rid of my x-box gold membership and got this for a third of the price.  It allows me to get to Netflix on the TV instead of having to hook my laptop to the TV.  Just updated the Chrome browser on my Samsung Note 3 and watched the last episode of The Walking Dead on the TV.  Plays very clearly.", "verified": true, "helpfulness": "0/0", "author": "Timothy Johnson"}, {"rating": 1.0, "review": "The product worked great for a couple of weeks, but then lost connection to wifi and couldn't reconnect no matter how many times I tried or tried to turn product off and on.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "A first rate product at an extremely economical price! I am still exploring all that it offers but I absolutely love the product. the picture quality of the movies/videos is very good. Google has produced another winner!", "verified": true, "helpfulness": "0/0", "author": "Leon Fraser"}, {"rating": 5.0, "review": "Great product to turn TV into entertainment device. Constantly streaming to the TV since I don't own a PC ATM. Buy it. Great price, great product.", "verified": true, "helpfulness": "0/0", "author": "Alex Barad"}, {"rating": 1.0, "review": "Have had this for 2+ weeks, still have not been able to make it work, The hdmi cable works best. Very disappointed at this point.", "verified": true, "helpfulness": "0/1", "author": "Elliott Owens"}, {"rating": 5.0, "review": "Worth buyingGood experienceExcellent qualityHappy to see movies , songs etc on tv without having latest tv model which have everything in built", "verified": false, "helpfulness": "0/0", "author": "Gaurav"}, {"rating": 5.0, "review": "I love it!  Not complicated to set up, worked within minutes (after updating software).  Perfect if you read the description and understand it has limited apps like netflix and youtube for watching.  HboGo works very well through this..... I hope they add more apps soon.  Showtime Anytime would be nice.... but overall, I am quite pleased with this product.", "verified": true, "helpfulness": "0/0", "author": "SubarcticJewel"}]