[{"rating": 5.0, "review": "Love this little gadget.  It was easy to install and works a charm.", "verified": true, "helpfulness": "1/1", "author": "Barbara J. Geiger \"bjgeiger\""}, {"rating": 4.0, "review": "The chromecast works great once you get it up and running.  My biggest issue with the chromecast is that you may end up troubleshooting things many times over if you have connection issues. So many times my ipad wouldn't register the chromecast device. I would reboot and it would \"see\" the device, but then suddenly wouldn't.  I recently had a lot of back and forth, trying to get things to work consistently. If you come across these issues, I'm certain that the average person will not have the patience to work through them.  My job is in technology and I troubleshoot all of the time which is why I don't mind, but If you're not tech savvy, get someone who can help you with any issues you may come across. Once you learn the device and get things up and running, It's an awesome product! We love it! I would've given it 5 stars if it wasn't for so many issues with the setup.Quick Notes:1. Before your purchase, make sure your TV will work with the chromecast.2. Amazon Instant video can only work if you cast from a computers chrome browser. There may be other methods.3. Make sure that your satisfied with the compatibility (i.e. It'll work with Netflix, Crackle, Youtube, etc.. and I'm okay with only the given options.)4. Amazon is making a similar product. You might look into it to see if it suits your needs.", "verified": true, "helpfulness": "1/1", "author": "Mark T Witmer"}, {"rating": 5.0, "review": "I was worried when I purchased this that it would not do all that I wanted it to do but in the end it did them all:Plays Netflix, Youtube, Amazon Video's (with a little work), and I stream my network videos from my phone and laptop from there websites.", "verified": true, "helpfulness": "1/1", "author": "Kaylene Ward"}, {"rating": 5.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Najeeb"}, {"rating": 3.0, "review": "These work well, but they're a bit fragile.My son and I both broke one of these, and they're not repairable.So don't mount it anywhere that something that cause it to be bent.", "verified": true, "helpfulness": "1/1", "author": "Tan Bronson"}, {"rating": 1.0, "review": "Does not work.  I've spent days working with both chromecast and my internet provider.  It will not connect to the internet.", "verified": true, "helpfulness": "0/0", "author": "Ronald B."}, {"rating": 5.0, "review": "Love it simple installation", "verified": true, "helpfulness": "0/0", "author": "Robin Rice"}, {"rating": 5.0, "review": "Works like advertised", "verified": true, "helpfulness": "0/0", "author": "Dean's machine"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Cristopher De La Cruz"}, {"rating": 5.0, "review": "I love this little wonder!! My TV is not dumb anymore, thanks to this device that added some updated functionality to it. I do have one question, though, when will AMAZON PRIME VIDEO support it?", "verified": true, "helpfulness": "1/1", "author": "danbambam"}]