[{"rating": 4.0, "review": "Works great for Amazon and Netflix. Excellent picture quality. No mlb TV is a drawback. Could use more games as well.Overall a nice device but hard to justify $99 for something that gives me little more than I already have on bluray player and smart tv.", "verified": true, "helpfulness": "0/0", "author": "Robert T."}, {"rating": 5.0, "review": "I am so glad I bought this. It took about 90 seconds to set up. The picture and sound quality are extremely high. Everything loads very fast. The only time there is ever any buffering is when I rewind a bit.I have Amazon Prime and Netflix. Other than that, I don't need to pay for anything to have a fantastic selection of programming. I don't miss cable at all. In fact, the overall quality of programming is much higher with this set-up than it ever was with my super duper cable package which cost me as much in one month as Amazon Prime costs in a year. Now that Amazon Prime added so many fantastic HBO series that I never got to see before, I'm in heaven. I couldn't afford HBO on top of my already exorbitant cable bill so I missed lots of good series. I'm watching The Wire now (fantastic quality program!) and plan to watch The Sopranos or Boardwalk Empire next.The box is so small it's unnoticeable near my TV. I could even hide it if I wanted to because of the blue-tooth. The remote feels really good in my hand. It's ergonomically pleasing. Also, I don't need to point it at the TV to use it. The controls are completely intuitive. I'm not a gamer so I didn't buy the game controller.I tell everyone I know how much I love my Fire TV. I'm very glad I bought it.", "verified": true, "helpfulness": "0/1", "author": "Andrea Studebaker"}, {"rating": 5.0, "review": "Perfect product!", "verified": true, "helpfulness": "0/0", "author": "TBradt"}, {"rating": 5.0, "review": "Just got it today, and already have it setup.  Even installation of XBMC was a snap, just watch some YouTube videos to find out how.  Really sweet system.  I have only 1 nit to pick, but it is not worth taking a star off... after loading 2 games and a couple of apps, the internal storage is almost gone!  We need more storage on this device, or Amazon is not going to sell many apps/games.  After loading my 2nd game, I have less than 2gb left.  Not a whole lot.  I think Amazon's best bet would be to open up the USB port for \"external_sdcard\" usage, and let apps and stuff install there.  That would open up quite a bit of storage space, customers could quickly expand with thumb drives.UPDATE: Day 2=============Okay, I need a bigger usage cap from my ISP, Cox has given me a cap of 300gb, but this Fire TV is going to blow the doors off.  My first day consumed 10gb!!  And the screensaver is disabled!  (Amazon has said that the screensaver may be the cause.)  And really, it was a rather lite day.... I am going to have to be very careful with this box... the biggest cap Cox offers in my area is only 400gb, and I don't think even that will be enough.The HD picture looks GREAT though, but you gotta pay the piper (your ISP, in this case).", "verified": true, "helpfulness": "1/1", "author": "E. Meiners \"pawnslinger\""}, {"rating": 5.0, "review": "good device.", "verified": true, "helpfulness": "0/1", "author": "Lee T."}, {"rating": 4.0, "review": "I love this! it exceeded my expectations. Love the interface and the ease of use. Voice search is a joy to use.", "verified": true, "helpfulness": "0/0", "author": "Jimmy Martin"}, {"rating": 3.0, "review": "I am very pleased with amazon Fire TV. The only reason I have given it only three stars is becouse when I am playing a game, it often freezes then kicks me to the home screen where I have to start all over.Aside from that annoyance, I have watched movies  with it, am I am very pleased with the quality of the picture, and the choices of viewing I am given. I have had other programs such as Net flicks, and it is also offered with the Fire TV, but I believe I'll stay with the choices Amazon gives me.  Perhaps the rating should be 3.5 stars, but this \"glitch\" with the gameing function particularly annoys me.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I am so disappointed with Amazon Fire TV. I have an Apple TV and I was looking for something a little better and judging by the ratings and speed of the machine, I thought this would do the trick; boy, was I wrong. I have had nothing but problems with my Amazon Fire TV, the picture keeps going in and out and freezing. Worst money spent.", "verified": true, "helpfulness": "1/4", "author": "Henri"}, {"rating": 4.0, "review": "This really deserves 3.5 stars at this point. This device has a lot potential and I am fully integrated with all Amazon products but there are several little tweaks that should be done and this device would be awesome. First the layout of the menu is clumsy. Second of all it seems like this should be a no brainer but being about to move videos that are bought from Amazon around on the menu in the order you would like would make the experience much more enjoyable. Example being if you start buying a series such as Lord of the rings and you buy all the ones already out then you have to wait a long time for the next one well it will be stored no where near the others maybe I'm just OCD but I like all series kept together and with Amazon you can't. Get rid of the carousel look and upgrade it. With Amazon music and HBO go missing at least for now it should only get 3.5 stars and when it gets them and if they would change the setup a little this product would be far better than the roku. The search feature works great and the device is fast and gives a great picture.......update 2/28/15....with hbo go and amazon prime music now available the box is the best!!!! Not 5 stars but I grade hard and it's not perfect but my favorite streaming box, but I'm an Amazon person so if one has movies on other platforms then roku is your best bet but for me Amazon all the way!", "verified": true, "helpfulness": "0/1", "author": "christopher olaughlin"}, {"rating": 4.0, "review": "Small and unobtrusive.  I was expecting something much larger.  I had a problem with getting it installed, called Mayday on my Kindle and they helped.  The problem turned out that I had the cable box attached and when I attached the Fire TV it still was looking the the cable on the the HDMI port.  After arranging to send it back I found out by accident that if I unplugged the TV and then plugged the Fire TV into the TV, it was recognized immediately.  Go figure.  I actually mirrored the Kindle to the Fire to watch items not available , ie websites.  So now I am actually using my Kindle for something besides reading.  My suggestions:  Amazon needs to get more apps for the Fire TV, Prime Music needs to be available and finally, give us a discount if we ALREADY own all of your other items.#updateI now have two fire tv's.  The second one was perfect, plugged it in and started watching.  I use it with the sling tv app.  Between Amazon Prime and sling tv I have comely cut my cable.  Your Amazon Prime playlist now can be played on the Fire TV.  I would recommend this for ease, a great parent or grandparent gift.", "verified": true, "helpfulness": "0/0", "author": "PinkDog"}]