[{"rating": 5.0, "review": "great purchase....very glad I purchased the Amazon Fire. Previously had; the roku but this is faster and more innovative.", "verified": true, "helpfulness": "0/1", "author": "cb"}, {"rating": 5.0, "review": "What a sweet device! The set up took me a minute. My kindle content was loaded, the music, pictures, etc from my cloud was loaded. My Amazon Prime was already loaded. I mean how easy is that! The remote is quite small, as is the Fire itself. The voice activation/search tool is really amazing. It actually works :-)I have no issues with any of the apps especially the Netflix app, but that could be as I am used to it from my Kindle.To search for movies is very very fast and so is load time. Crystal clear pictures and hi-def.I am very happy with this gadget and very much appreciate the ease to load and use for the 1st time.I am thinking about buying another one for my 55 inch Samsung downstairs instead of keeping my kindle hooked up to it. :-)", "verified": true, "helpfulness": "1/1", "author": "P. Lyons"}, {"rating": 5.0, "review": "Amazon Fire TV is amazing. Even I could set it up in less than five minutes. The voice device is great for my husband who has trouble with modern gadgets. I could not believe how much better the quality of the picture was and also the sound. I had an Apple TV, what a difference. Would recommend to anyone who loves streaming movies. Only thing I don't like is the price of Prime movies, there should be a monthly subscription fee like Netflixs.  All in all a wonderful product would recommend highly.", "verified": true, "helpfulness": "1/1", "author": "Anne  Macpherson"}, {"rating": 5.0, "review": "I loaded XBMC on and it works like a charm", "verified": true, "helpfulness": "1/1", "author": "DS \"sweetoil\""}, {"rating": 1.0, "review": "This was billed on TV to be the easiest to use ever - IE Gary Bussey saying Gary Bussey and finding all he was on instantly.LET ME TELL YOU I YELLED GARY BUSSEY at the damn thing and at Tech Support but nobody laughed. Not even a laugh track.We have had Roku and others and had them be a disaster and clunky to work with. This was my redeemer tech purchase....HAHAHAHHAHAHThis product is supposed to be registered automatically to your account when you purchase - unless you say it was a gift.Mine was not.And I did not say it was a gift.You should be able to login to your account via the Fire TV and begin watching immediately.Mine didn't and I could not and still can't.It kept telling me my password or login was invalid, yet I could grab my Mac and sit right there and login to Amazon -2 ft from the Fire TV- just fine. When I looked under my managed devices, my Kindle is there but not my Fire.After some really frustrating hours of trying every conceivable way to make it work, I sent Amazon an email indicating it did not, and here is what I had encountered. They asked me to contact them via chat or phone. Since I was at work, I chatted. Explained the situation again, and all I had gone through to trouble shoot prior to contact. They indicated they would need to call me. \"Frank\" called me. Listened and was empathetic, however said I needed the product in front of me to troubleshoot. VERY frustrated, I waited until I got home to call again/THIRD TIME dealing with tech support- not Gary Bussey easy. Got someone who was clearly reading a script for troubleshooting and English not primary language.About an hour on the phone of trying to get it resolved, and telling me to go to the settings repeatedly...that is not an option because I CAN'T GET INTO THE DEVICE PERIOD, he gave up and said he would send me another one, and to ship back the one I had.Which, ok fine...but this really does not make me happy when ease of use is the selling point. I spent HOURS trying to make this work. Not easy at all. I felt better versed in tech support than the people assisting me. Frank indicated we could possibly register the device to my account - via the phone, but when I asked about this later, was told it wasn't possible. I was also told by the last tech support person I talked to that my account was closed. CLOSED I SAID...I have made thousands of purchases this year, it better not be closed. Oh oopsy...looking at the wrong account. WHAT?>!@!!!!!!Frankly, I would think twice about this purchase if I had to do it again. I am a big Amazon supporter and HAD this been super easy, it was on my list of Christmas purchases for technically challenged family members. The good point in all this-it has kept me from impulse buying the Fire Phone I have been obsessing over. If the Fire TV is this bad, how bad will the phone be? And I WANTED the Fire Phone enough to consider paying two cellphone bills.Tech support needs to up their game.It really SHOULD be easy to use - but its not if you encounter any technical issues.It is small...and could be very good purchase - if it worked - which it doesn't and if it doesn't work, it should be realllllllly easy to fix - which it wasn't.", "verified": true, "helpfulness": "4/9", "author": "CB"}, {"rating": 1.0, "review": "The good:It has the best screensaver!  My housemate and I love  the  screensaver.The  kind of bad:Voice recognition does not always work.  Perhaps this is to be expected in a new device.I've had to twice clear out memory from my account in order for the Fire to work.  I never, ever had this problem with the Roku.The worst:My Amazon Fire won't connect to my Amazon account.  I can't get any video to stream from Amazon.  Interestingly enough, content from Hulu does stream.For a couple of months, I had no trouble accessing my Amazon video, but the last week I could not get my amazon videos. At least I can get Hulu.I am a big supporter of Amazon and even have some stock in Amazon.  It pains me to give this device a one star rating.  I am very disappointed in this device.", "verified": true, "helpfulness": "4/6", "author": "Therese \"Treehugger\""}, {"rating": 5.0, "review": "We have enjoyed the Amazon Fire TV so much since we received it - always super fast and the quality is second to none.  Easy to use - well worth the money!", "verified": true, "helpfulness": "0/1", "author": "Stacey Townsend"}, {"rating": 5.0, "review": "I love this thing!  I was using a Roku that I was completely happy with.  I decided to take advantage of Amazon's 1 month free trial for the Fire TV and now my Roku is collecting dust and not used.The voice search works really well and not just some marketing ploy.I'm not getting any lag from the shows that I'm streaming and the shows run pretty smooth.", "verified": true, "helpfulness": "0/1", "author": "michael lim"}, {"rating": 5.0, "review": "My son had signed us up for Prime  for my birthday - we have a Kindle and a Smart TV so he thought we could really benefit by it.  The instructions were not such that we could not access it without Amazon Fire so he purchased it as well.  It is just another one of those technology quirks, but we have plugged it in and have really enjoyed the access to the movies that Prime has available.", "verified": true, "helpfulness": "0/1", "author": "Paula M. McAdow"}, {"rating": 4.0, "review": "We REALLY like the Fire, but ours - every once in a while - garbles like it's fast forwarding with lots of static...not sure why.  Thought it was the cable we were using, so we got a new cable, and we are still having the garbling \"effect\" periodically.  Love the voice search feature, and we can use it on all of the apps as well!  Would love to have it update to new versions instead of having to buy a new box whenever they come out with new features.  If you want to ditch cable, this may be the way to go!", "verified": true, "helpfulness": "0/0", "author": "Wanda Jones \"Movie Queen\""}]