[{"rating": 1.0, "review": "I can't get it to play Netflicks, which is the main reason I bought it. It loads and recognizes my acct., but every show I select says it cannot be played right now. And of course Amazon doesn't have technical support or a customer service phone number.", "verified": true, "helpfulness": "0/2", "author": "Scott W. Cass"}, {"rating": 5.0, "review": "Works great. Perfect tool for ditching cable and using on your main tv, or just to use in a second room or bedroom with out cable. It is fast, and the voice search is awesome and really works. When my cable contract thing runs out I'm ditching cable and just using this thing. And, of course it's very easy to install. Connects with Ethernet cable or wireless. The remote is not glitchy and works from multiple angles. I can watch all amazon instant videos, netflix, and you tube videos and movies that I want to watch. Also easily connects to a sound bar or surround sound home theater setup. For the price you cant beat it. You can also play games with it downloaded from the amazon store. I have not used it for games yet and probably wont since i have a ps4. These things will make awesome Christmas gifts.", "verified": true, "helpfulness": "1/1", "author": "christopher"}, {"rating": 5.0, "review": "I am almost completely satisfied with this product. It has the apps and general functionality that I was expecting. But sometimes, even with very high speed internet, it still stops randomly while I'm watching a show as though it's buffering. That would be easier to accept if those same apps didn't run flawlessly on my PS3. Still, not really a deal breaker. I just have to wonder why the same apps behave differently on the two devices. As long as it doesn't get worse, I won't worry about it.Update: April 2015The issues I had when I first got the Amazon Fire TV are all but completely gone. Not even worth noting. I am now completely satisfied with this product. Thank you Amazon.com.", "verified": true, "helpfulness": "0/0", "author": "RandyM"}, {"rating": 5.0, "review": "That is what I want", "verified": true, "helpfulness": "0/1", "author": "Anthony marshall"}, {"rating": 1.0, "review": "We purchased the Amazon Fire TV to replace my Roku because of the ability to give my child her own profile and to give her limited autonomy while maintaining some control over her access to certain programming. Unfortunately, Freetime was not even loaded on the first unit that I received. After more time than I care to remember on the phone with tech support, we were able to update the untit with Freetime. It however would not allow us to add or delete movies/ shows, only apps. After exchanging it for a new unit, the replacement had the same issue. The most discouraging part about this whole process is the lack of tech support. Nobody I spoke to (three different representatives) knew a thing about Fire TV, how it worked, or anything about it logistically. Back to the Roku and still in search of a system with separate profiles for adults and children.", "verified": true, "helpfulness": "0/2", "author": "Domenick Bedrosian"}, {"rating": 5.0, "review": "Easy to use and set up; I'm loving it!", "verified": true, "helpfulness": "0/1", "author": "Terri Allen"}, {"rating": 5.0, "review": "it ok, but a lot of features that you would expect it to have(and it should by the specs)it doesn't, it has Bluetooth but no way too add a blue tooth keyboard and you should be abel to add a usb hard drive., while you can buy a Chinese knock off or even a pivos and get keyboard supports plus usb harddrive support, Also it also should be open so you can add root(since it is mostly just a heavily screened android box) If you do buy this I would add xbmcupdated june 7th 2015with the latest update from amazon( a few months ago) it fixes many of the flaws or missing features it should have launched with , I would rate this now a 5, you can now use a usb drive for incrased storage and a lot more Bluetooth devices enabled also,theres a rumor that some portable  usb hard drives work with it also but since I don't have any I cant confirm that", "verified": true, "helpfulness": "0/0", "author": "mat"}, {"rating": 5.0, "review": "Simple To use & straight Forward ​", "verified": true, "helpfulness": "0/0", "author": "Sean"}, {"rating": 5.0, "review": "Excellent product! The voice recognition is spot on!!", "verified": true, "helpfulness": "0/0", "author": "Dr. C."}, {"rating": 1.0, "review": "I will be sending it back.", "verified": true, "helpfulness": "0/5", "author": "Gene K."}]