[{"rating": 5.0, "review": "I spent $31 on a sushi lunch the other day at work,not a regular thing but whatever.this thing is $35 and displays youtube effortlessly and correctly on my TV.how can it not get 5 stars on this alone?O and it will automatically power on, and if the TV is already on, auto change TV inputs on my Samsung TV when I cast to it...", "verified": true, "helpfulness": "2/4", "author": "billy timmy"}, {"rating": 5.0, "review": "Very awesome little device, and it has a ton of potential.  Would love to see some Prime casting in the future. :)", "verified": false, "helpfulness": "1/2", "author": "DrCr4nK"}, {"rating": 4.0, "review": "Works very good, u need to have high speed internet, no issues with my 40 Mb/s internet speed. Hope they hurry and add more apps to it", "verified": true, "helpfulness": "1/1", "author": "Flo"}, {"rating": 5.0, "review": "I just got it on the mail and installed it on my TV using my Samsung Galaxy SIII in 2 mins. I turned on Netflix and it works perfectly with full HD! And it loads even faster than my computer. Before I was looking for pricey DVD Players with wifi in order to stream Netflix on my TV, but now with Chromecast I dont need to spend on a pricey DVD Player to get what I needed.Must buy!", "verified": false, "helpfulness": "1/2", "author": "MAA"}, {"rating": 1.0, "review": "waste of time .. maybe V2 will be better .. slow, unresponsive .. Google claim it works with ChromeBook but then chromecast says MacBook Pro not enough performance to stream  , on a fast wifi network", "verified": true, "helpfulness": "8/39", "author": "ML"}, {"rating": 5.0, "review": "This player is by far the best idea out there.  I have tossed the apple tv out and strictly use this for Netflix.  Can't wait for the rest of the applications to jump on board and I may even cut the cable cord.", "verified": true, "helpfulness": "2/3", "author": "Greg"}, {"rating": 5.0, "review": "The Chromecast device is great. Works perfectly when controlling YouTube and Netflix from my phone. I tried it at my office and plugged it into the TV. Everyone in my office whether they had Android or iPhone was able to control Netflix and YouTube with it with no additional software or setup (after the initial setup I performed of course). They were blown away that that feature already existed in their iPhone and they didn't even know.The tab cast feature in Chrome is cool too. I was able to cast every website I tried without a problem. Keep in mind its only an image of what's in your chrome browser and your computer has to upload what's happening on your computer screen and then download to the Chromecast. People shouldn't expect that feature to work well if you are trying to watch Netflix or YouTube or some other kind of video from Chrome.I did get the Netflix discount but I would have bought this thing without the discount too. TOTALLY WORTH IT.", "verified": true, "helpfulness": "1/2", "author": "Stealth Employed \"Stealth\""}, {"rating": 5.0, "review": "I have PS3 and Bluray 3D player.  Both devices can stream Netflix and youtube video.  Therefore, the first day it came out, I was not too excited about it.  Then, I decided to give it a try 2 days later on Bestbuy shipping with 3 months netflix promotion.  Here what I want to share:-  Both bluray player and PS3 offer a difficult way to search or enter song from youtube.  I was able to enter data faster when using smartphone.-  After the chromecast starts, I shut down the power of my phone and netflix movie still showing on TV (so cool).  Similarly, I exit the youtube app on my phone, and the video continue playing until the end.-  I was able to play Candy Saga Crush on my phone while watching the youtube video.  I think HDMI connected to laptop must show on TV what it is showing on laptop screen.  For example, you can't check email on when connected HDMI to TV without Chromecast.-  My daughter will not have to watch youtube movie on the small screen of my phone anymore.  I'll send it to the TV for her to watch.Currently, apps are limited and the device feel little warm to touch.My advice, don't need to spend a lot of money on ebay to get one.  Eventually, the price will go down.  The netflix promotion might or might not come back.  You have been able to live w/o it before, so no need to pay a lot of money to get it now.", "verified": false, "helpfulness": "3/4", "author": "HCM-CUC \"SAIGONESE\""}, {"rating": 4.0, "review": "I just got my dongle and I'll write a full review soon.I hooked it up so far, and it works well. It does get quite warm for a full movie. I'll update more.", "verified": true, "helpfulness": "2/4", "author": "Mina"}, {"rating": 5.0, "review": "I recently received my Chromecast that I ordered directly from Google and I can already say that this is a very impressive device. It is also important to note I own a Roku 3 (verified purchase on my profile)and an Apple TV.This device is the perfect for those who don't need as many options as the Roku but require the Popular apps like \"Netflix, YouTube, Hulu (this was just announced and confirmed), etc.. Not only that, you get the added bonus of \"casting\" a web browser.As many have noted most apps simply \"cast\" by pulling what you want to see through the cloud and not your device (iphone, tablet, etc..)It is important to note that the \"casting\" of a Chrome browser tab is a direct broadcast from your computer. Currently \"casting\" chrome browser only works with a computer and requires an extension called \"Google casting\" which you can get from the Play store. Tab casting is only in Beta and should only improve from here.The other apps have worked flawlessly thus far and I have no complaints.Highly recommend for users that only need the essentials or those who have extra TV's that need to get \"connected\" You simply cant go wrong at this price point, and it will only get better as new apps are added to it.", "verified": false, "helpfulness": "5/7", "author": "SoundTech"}]