[{"rating": 4.0, "review": "Excellent.", "verified": true, "helpfulness": "0/0", "author": "K. PATIL"}, {"rating": 3.0, "review": "A good device, but has its limitations.", "verified": true, "helpfulness": "0/1", "author": "Carlos R. Munoz \"Atloco\""}, {"rating": 5.0, "review": "Given as a gift", "verified": true, "helpfulness": "0/0", "author": "BONNIE FLEMING"}, {"rating": 5.0, "review": "We love using it and it is really easy and simple.", "verified": true, "helpfulness": "0/0", "author": "Maternst Isoff"}, {"rating": 5.0, "review": "This was totally an impulse buy. I already had a Surface RT that I could connect to the TV to watch Netflix. I must say however, this was the best impulse buy ever and I dont regret it anymore.", "verified": true, "helpfulness": "0/0", "author": "Edwin Fernandez \"bestcoqui\""}, {"rating": 5.0, "review": "Love it, with the new update you can now mirror what you're doing on your phone straight to your TV.", "verified": true, "helpfulness": "1/1", "author": "jermam"}, {"rating": 3.0, "review": "I also have a really old AppleTV which seems a lot more reliable than the Chromecast. Oddly, I've had the most trouble getting this to work from Chrome and Youtube. Go figure. Quite often it just isn't available and I have to reset it. I also really don't like not having a remote. I had planned to use this to watch Youtube etc. from my bike trainer while working out but it is difficult at best to use a smart phone when your hands are all sweaty. I switched and use the AppleTV with remote instead. I'll probably ultimately replace this with another AppleTV or Roku.", "verified": true, "helpfulness": "0/0", "author": "Peter Githens"}, {"rating": 4.0, "review": "This is a fun little gadget. Now that we have a smart Bluray player, we use this less. But still useful for youtube.", "verified": true, "helpfulness": "0/0", "author": "Steven B. Patton \"St Pat\""}, {"rating": 4.0, "review": "Works well with my Android phone.  Streaming quality for videos on the phone could be a little better though.  Does not compare to streaming say Netflix from the Internet.", "verified": true, "helpfulness": "0/0", "author": "Chris Fong"}, {"rating": 4.0, "review": "A little choppy streaming from some devices, but overall a good investment especially with that $24 lightning sale!", "verified": true, "helpfulness": "0/0", "author": "Zip Zander"}]