[{"rating": 4.0, "review": "Now stymied with not having split sound out.  Problem with having a good but old stereo with no HDMI in and a projector with no sound.  Still stuck running cables, super cool to send stuff from the phone to the projector though.", "verified": true, "helpfulness": "0/0", "author": "anonMaArse"}, {"rating": 1.0, "review": "Never could get it to work. Horrible support, waste of money.", "verified": true, "helpfulness": "1/1", "author": "Peter C Kassner"}, {"rating": 5.0, "review": "So easy, so good!!!I can watch my series and movies on TV, good quality!!!", "verified": false, "helpfulness": "1/1", "author": "Emerson Barros"}, {"rating": 5.0, "review": "So far it is really good. I'm streaming from tablets, cellphone and laptop and I had no problems at all. For that price it is incredibly good. We play games, karaoke,  watch movies, pictures, mirror my phone, etc.", "verified": true, "helpfulness": "0/0", "author": "Juan Moya"}, {"rating": 5.0, "review": "Chromecast is a superb addition to entertainment systems. Initial setup is fairly quick, and streaming from a smartphone or laptop is very easy. Supported apps work very well, with great quality. As an additional option on some devices, you can also do a full screen cast, which can serve as a work around for unsupported apps. Overall, Chromecast is an excellent option for streaming music and video.The one issue I have found so far is that casting from a Chrome web browser tab from my laptop has been poor. However, I believe this is a router issue, and not a problem with Chromecast.", "verified": false, "helpfulness": "0/0", "author": "Bill"}, {"rating": 5.0, "review": "Works and easy to setup.", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 5.0, "review": "Clever little device.Combined with a nice FIOS and a sneaky free-tv site, I can stream tv shows from my computer to my big-screen tv with no commercials whenever I want.Modern technology - making wasting time even more seductive.", "verified": true, "helpfulness": "0/0", "author": "Sharna"}, {"rating": 1.0, "review": "Doesn't work properly with my hotspot.  I can't get any sound to come out of my TV.  Gogole says they don't support Chromecast through a hotspot.  Now I know.", "verified": true, "helpfulness": "0/0", "author": "Marissa Parker"}, {"rating": 5.0, "review": "My Blu-ray wireless dvd did not seem to like my new set-up with Verizon and Netflix.  I purchased a chromecast and now \"cast\" Netflix from my laptop.", "verified": true, "helpfulness": "0/0", "author": "Scout858"}, {"rating": 5.0, "review": "Works great, get one. Other reviews cover the compatibility better than I can explain...", "verified": true, "helpfulness": "0/0", "author": "Gary R. Wheaton \"Redneck computer geek\""}]