[{"rating": 5.0, "review": "It's an excellent streaming device that does what it's suppose to do!. I don't know why people complain that it doesn't work on many applications like how apple and roku does, but come on guys it's only $35 and does streaming for Netflix and youtube that's pretty much all I need.  Chromecast is expanding so just be patient guys. Overall I give this a 5 star for having a neat UI easy to use style and is fast on the streaming( this may vary depending on your connection speed so please have that in mind).", "verified": true, "helpfulness": "0/1", "author": "KT"}, {"rating": 5.0, "review": "Thinking of ditching satellite and this is one of the items/services we have decided to use. Love it so far.", "verified": true, "helpfulness": "0/0", "author": "Brandi B"}, {"rating": 5.0, "review": "Delivers on its promise in every way. For the budget conscious user who doesn't need a super complicated setup this is a great choice. The portability is an added bonus -- recently brought it to my parents' home to show them how to stream their web purchased movies/series and they loved it, too.", "verified": true, "helpfulness": "0/0", "author": "CookeeGalore"}, {"rating": 5.0, "review": "I am i love with this device. I always carry it with me wherever I go so I can play my media and share it on HD TV with my friends", "verified": true, "helpfulness": "0/0", "author": "Emad al-subaihi"}, {"rating": 5.0, "review": "I use this all the time for netflix and pandora, you can even mirror your Chrome browser onto your tv. It was really easy to install and set up. I highly recommend it", "verified": true, "helpfulness": "0/0", "author": "brandon bond"}, {"rating": 5.0, "review": "It did everything I expected. Best purchase and money well spent. Don't let this get away. You won't be sorry", "verified": true, "helpfulness": "0/0", "author": "Audrey"}, {"rating": 2.0, "review": "Does no push audio back through CAT5 cable systems to your home theater components. Can only get audio through TV speakers...", "verified": true, "helpfulness": "0/0", "author": "Huckleberry"}, {"rating": 5.0, "review": "I love my chromecast. The only real limitations for this product are it's inability to stream certain video players (mainly vlc). I'm really looking forward to the availability of third party apps. Should clear up that small issue.", "verified": true, "helpfulness": "0/0", "author": "Dean Moore"}, {"rating": 5.0, "review": "I ordered on Friday evening and received it on SUNDAY. I didn't know they would deliver on Sunday. Easy setup. I love using plex and Pandora.", "verified": true, "helpfulness": "0/0", "author": "Marcus Enriquez"}, {"rating": 3.0, "review": "I thought it would be like a Roku or other \"set top\" device but it's just a catch all for apps that support it. It takes a very specific video file type and if you don't use just that one it won't play. There are conversion tools out there but it's almost like, \"Why bother\". Yes it does what it says but they could have just put the software on the thing and it would have worked better without all this app business. I think it's still new and there needs to be more development in the app side and also more apps adding the chromecast capability.  If you aren't tech savvy stick with the Roku.", "verified": true, "helpfulness": "0/0", "author": "K. A. Monson \"Some Audiobooks were provided by the author, narrator, or publisher at no cost in exchange for an unbiased review courtesy of AudiobookBlast\""}]