[{"rating": 5.0, "review": "Plugged it in to the back of the television, followed on screen directions, watched Netflix minutes later.  No lag, Wi-Fi reception good.", "verified": true, "helpfulness": "0/0", "author": "here4now2"}, {"rating": 4.0, "review": "Works great for movies and tv show streaming ! Netflix app doesn't work well with it but could be overall ap not google chromecast", "verified": true, "helpfulness": "0/0", "author": "Katie12"}, {"rating": 1.0, "review": "It doesn't do what I thought its use was I bought it so I could get away from cable TV so I thought I would have easy access to free movies but only found it is not user friendly and  you have to purchase almost everything you watch my option is its a junk gimmick useless", "verified": true, "helpfulness": "0/3", "author": "Donald Lynn"}, {"rating": 4.0, "review": "Works really well and is very responsive to your 'casting' - but understand how this works before you buy it.  It is not pre-loaded with software to stream stuff or anything like that.  You install the software on your smart device - tablet, phone, laptop - and then play the thing you want to view from a list of accepted media players (Hulu, Netflix, Youtube are the most popular currently).THEN you hit a little button that 'casts' the image from your media player onto your TV, through the dongle.I'm a fan.  Turned my 3 year old 50\" RCA into a smart TV with my phone.", "verified": true, "helpfulness": "0/0", "author": "Samantha K. Miller"}, {"rating": 4.0, "review": "This is a cool device.  I works as advertised.  Just make sure you have an application for it.  With today's smart TVs and DVD players, you can do most of this functionality without this device.  That said, I have no regrets since it is only $35.  As a matter of fact, I bought a second for another TV.", "verified": true, "helpfulness": "0/0", "author": "Dan G \"ComputerMan\""}, {"rating": 4.0, "review": "Got as a Christmas gift, but wife stashed it away to be given away later. Now she cannot find it. It would be a definite backup from my Roku.", "verified": true, "helpfulness": "1/1", "author": "Mr. Hanie"}, {"rating": 1.0, "review": "It doesn't work on anything. When it showed up I tested it, it worked on a static page, it seemed like it was going to work. I tried loading a video and it kept crashing. It won't work on my kindle or my android, both of which it tells me are not yet compatible. Plus, the damn thing superheats just from being plugged in. Don't waste your money on this garbage.", "verified": true, "helpfulness": "1/2", "author": "D"}, {"rating": 5.0, "review": "I'm soooo glad I bought this!! Seriously, I have been so angry with Comcast for not allowing their subscribers to use HBOGo on other devices and it seemed the only options were an XBox or Apple TV. Being that I'm not made of money, this was awesome! It was super easy to set up however I'm a very tech savvy person. It's still a little shaky, with some of the features still being tested, but totally worth it.", "verified": true, "helpfulness": "0/0", "author": "I Love Everything"}, {"rating": 4.0, "review": "I bought already 2 of these Chrome casts as they are nice to use and prevent cables.It would be nice if it works with more applications though (i.e. VLC, media player, etc...)", "verified": true, "helpfulness": "0/0", "author": "Sherif"}, {"rating": 5.0, "review": "Its simply amazing. Very simple to setup and now there are lots of apps are coming with lot of features. I think I will not need anything else for my TV.", "verified": true, "helpfulness": "0/0", "author": "Abhijit"}]