[{"rating": 3.0, "review": "I got one for the simple fact of streaming anything from smart phone, tablet, or pc  when I got it all it allowed was approved applications by chrome cast. I will not recommend this item for purchase until it allows all applications from the play store.", "verified": true, "helpfulness": "0/1", "author": "Justin Groneman"}, {"rating": 5.0, "review": "the best thing for those who doesnt have an smart tv. very easy to use. its \"old parents friendly\" lol", "verified": true, "helpfulness": "0/0", "author": "MelaisA"}, {"rating": 4.0, "review": "Would be better if there's more apps for it.. ex, mirroring and other stuff.Rest r so good.. size,  etc.. thanks", "verified": true, "helpfulness": "0/0", "author": "Hassan"}, {"rating": 1.0, "review": "i can not get it to work  i have 34 moves in my pc try to watch them  it will not let me", "verified": true, "helpfulness": "1/2", "author": "walta"}, {"rating": 5.0, "review": "I ran into a few glitches when setting it up but after I got past those initial problems it works like a charm. It's fast - reliable - and the picture quality is amazing. Hard to beat the value you get from something so cheap yet so effective.", "verified": true, "helpfulness": "0/0", "author": "D. Rodrigues \"I'd rather be cycling\""}, {"rating": 2.0, "review": "Very cool idea but the technology is half baked, screen goes blank or stops while the sound continues (while not doing so on the computer) or the chrome cast comes back with an error message. This makes it difficult to enjoy watching a movie or TV show as you are constantly having to troubleshoot. Its easier to just plug and HDMI cable into my computer and enjoy watching on my TV uninterrupted.", "verified": true, "helpfulness": "1/2", "author": "Patrick McDaniel"}, {"rating": 3.0, "review": "Okay, I will admit that I bought this because I love gadgets.  When it comes down to it, I guess I don't know why I thought I needed it.  I have a PS3, which does my Netflix, Youtube, etc. more efficiently.  I never use this thing.  I will say this - it does what it is supposed to do, so if you need to stream Netflix or other things from your computer to your TV, it really does work.  I guess I didn't really need it though.", "verified": true, "helpfulness": "0/1", "author": "Jason"}, {"rating": 4.0, "review": "I'm beginning to know this interesting electronic device, so far has worked very well.I am knowing their multiple uses.", "verified": true, "helpfulness": "0/0", "author": "Ney Rios"}, {"rating": 5.0, "review": "This is great for what I use it for, streaming videos from my computer/laptop/tablet/phone.  I have had no issues at all with the laptop, tablet, but I have had some small lag issues or buffering issues from the desktop computer or phone.Other than that its great for the price and does the job, I would recommend this to anyone that likes to travel and watch movies from their tablet or laptops.", "verified": true, "helpfulness": "0/0", "author": "Cody"}, {"rating": 5.0, "review": "I love it..just what i needed...not a waste of money like i thought it might be...easy to use you will love it.", "verified": true, "helpfulness": "0/0", "author": "carol"}]