[{"rating": 2.0, "review": "the apps doesnt work propertly after use other one", "verified": true, "helpfulness": "0/2", "author": "juan roques"}, {"rating": 5.0, "review": "Love it. Had Apple TV but Amazon Fire is so much better. Use it often. That said, it seems no \"first choices\" of what I realllllly want to see are Prime (i.e. free) just all the old stuff. Like the recommendations they give. Easy to navigate...and the verbal command feature is awesome, very helpful.", "verified": true, "helpfulness": "0/0", "author": "bennetbo1"}, {"rating": 4.0, "review": "I bought this as a gift for my wife so we could stream movies.  It was easy to install, set up and use.  I was disappointed in that Amazon advertises that you can watch thousands of movies free as a prime member.  I suggest you check closely when you watch a movie.  If it suggests a rented price, it's not free.  Only movies with the \"watch now\" indicator are free.  Otherwise I like the unit and would recommend it to others", "verified": true, "helpfulness": "0/0", "author": "William Burris"}, {"rating": 5.0, "review": "EASY setup!  Wonderful picture on a 56\" 1080p TV...kids and wife were able to learn how to use it easily!  I only wish there was a way to turn it off when done viewing instead of waiting for it to go to sleep.", "verified": true, "helpfulness": "0/0", "author": "Art Hogarth"}, {"rating": 2.0, "review": "It is claim to be faster than Roku 3 and Apple TV. But i have all three now and compared with all following applications are really slower than Roku 3 or Apple TV.Netflixsling TVYupp TVWatchESPNYouTubeThese are the application i used most.", "verified": true, "helpfulness": "0/1", "author": "Vk"}, {"rating": 4.0, "review": "Set-up is easy. The only downside at this point: one more remote!", "verified": true, "helpfulness": "0/0", "author": "Uncle John"}, {"rating": 5.0, "review": "I got this device when i signed up for SlingTV.  As a recent cord cutter, i'm finding the FireTV becoming my \"go-to-device\" for viewing.  We currently have several different devices (Chromecast, Rasberry Pi running Kodi, OTA Antenna, Chromebook) and with our Prime account we have access to so much high quality content.  I really thought we would just be using the Fire to watch SlingTV & Netflix, but the Prime Library has grown so much, that it's #WINNING.We choose the Fire TV box over the Fire stick because it has additional memory and a beefier processor which we felt were important and well worth the difference in price.  I've heard great things about the stick and haven't used one so i can give a side by side comparison, but the Fire TV has over-performed for us.", "verified": true, "helpfulness": "1/1", "author": "Andy Begnoche"}, {"rating": 5.0, "review": "I love the Amazon Fire TV.  Very easy to use and works great with Netflix.", "verified": true, "helpfulness": "0/0", "author": "MarFro"}, {"rating": 4.0, "review": "I still think paying 100 dollars every year for prime there should be a little \"better\" movie selections if you will. Just some newer popular movies that can be seen quicker then they are seen on Netflix .", "verified": true, "helpfulness": "0/0", "author": "Tyler mowery"}, {"rating": 5.0, "review": "I wish there could be more stars!! Wonderful device.  Far exceeds my expectations.", "verified": true, "helpfulness": "0/0", "author": "Lois"}]