[{"rating": 3.0, "review": "The device works great and was fairly easy to set up. I am very disappointed that I cannot use with Amazon Prime instant videos.", "verified": true, "helpfulness": "1/1", "author": "Scott & Erica Root"}, {"rating": 2.0, "review": "My title says it all.  It has potential but right now it does was my roku xbox 360 And DVD player does but less. I can only play netflix and YouTube. In fact the company I purchased this from(amazon) will not let me stream videos from their site", "verified": true, "helpfulness": "1/2", "author": "Brian"}, {"rating": 1.0, "review": "I expected something like a small Roku or Apple TV and what I got is a slimmed down version of Airplay but with only YouTube and Netflix channels for now. Nice toy and the UI is very pretty but it is pretty useless as is. Unlike Roku and Apple TV you must use it with a smart phone, tablet. etc., it is not a stand alone device. Back to the drawing board Google.", "verified": true, "helpfulness": "4/6", "author": "E. Pope \"EP\""}, {"rating": 4.0, "review": "I use it every day and it's very convinient, I can plug it on the tv in the living room or in the kids room, the configuration took longer than I expeceted but besides that everything is great", "verified": true, "helpfulness": "0/0", "author": "Rene Cotto Strems"}, {"rating": 1.0, "review": "I bought this expecting to be able to stream video from my internet devices to my flat-screen TV. Setup was easy and painless as my old Sony Bravia worked flawlessly with the new Chromecast. I was able to see my Chrome browser from my laptop on my big screen TV. But it wouldn't show videos pasted into the browser. I tried a few other things but it was close to bedtime and I figured I could try again tomorrow.The next day nothing would work on Chromecast. Also, the light on the device was red instead of white. I removed the device rebooted my TV and laptop and hit the reset button on the chromecast device. Still nothing. I called Google and the tech had me reboot everything but it still wouldn't work.I returned the device for instant credit from Amazon and now I'll wait for the \"next big thing\".", "verified": true, "helpfulness": "21/26", "author": "sportyrider \"sportyrider\""}, {"rating": 3.0, "review": "I bought it to try it out, and see how it compared to Airplay etc. It works ok, lets me send any Chrome content to my TV, but it's flaky, and reports an error after 3-5 minutes, over and over. Netflix works well, so I think it's a Chrome Extension issue or something. I'll be selling it since the return period just expired.", "verified": true, "helpfulness": "0/0", "author": "Rob Marlbrough"}, {"rating": 1.0, "review": "I tried to connect this to my HD television and it would not do so.  I went to the Google website and their instructions were impossible to follow.  The advance word was that his item was easy to use and that proved to be a totally false statement.  This is the first time I had to return an item due to its failure to live up to its promise.  In the future Amazon should first test its new products before offering them for sale.", "verified": true, "helpfulness": "2/4", "author": "Edward Gilbert"}, {"rating": 2.0, "review": "This product is awesome but it's very restricted. You can't play what you want. You have to upload the video to Youtube then play it on TV.It does not work in offline. You must be connected to Internet.IT'S WASTE OF MONEY.", "verified": true, "helpfulness": "0/0", "author": "Ali"}, {"rating": 5.0, "review": "It works flawlessly. I did notice a slight hesitation with Netflix to register the cast to from any device to the TV but I guess patience is a virtue and it works the second time. It literally is plug n play so the setup is quick and painless. You might  have a problem with the limitation of using Chrome browser but I generally use it anyway. Well worth the money to me as it literally allows a TV to project any website that you are viewing.", "verified": true, "helpfulness": "0/0", "author": "B. Taylor \"Just Good Music Fanatic\""}, {"rating": 1.0, "review": "OMG..Poor Customer ServiceNo phone numbers to be called for customer support or technical support.Customer support only through email and after after one day.I could not get connected to my TV.And contacted customer support.To and forth emails for 1 month.Finally I had to return the chromecast device back to best buy for store credit.", "verified": false, "helpfulness": "95/122", "author": "Brownsugar"}]