[{"rating": 4.0, "review": "i was hoping to be able to rid myself of cable and still pick up free channels in real time and without charge for it.", "verified": true, "helpfulness": "0/0", "author": "wanda anderson"}, {"rating": 5.0, "review": "Tons of tv shows and movies. .. and just talking to the remote makes it a whole lots easier. . Already have friends and family hooked on it", "verified": true, "helpfulness": "0/0", "author": "Alex R"}, {"rating": 5.0, "review": "Easy to set up. Have really enjoyed it! Amazon is adding to it all the time.", "verified": true, "helpfulness": "0/0", "author": "darlene sheets"}, {"rating": 5.0, "review": "All Pros no Cons!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works very well. Helped me cut my outrageous cable bill significantly. Connected easily to my surround sound system and displays up to glorious 1080p and cranks magnificent 5.1 Dolby and DTS when the content allows. Hoping Amazon keeps Amazon Prime fees reasonable and that (dare I say) streaming technology finds a way to put cable either out of business or at least forces cable to offer reasonable rates.", "verified": true, "helpfulness": "0/0", "author": "Dru \"Dru\""}, {"rating": 5.0, "review": "Love it. Much better than the Roku.  Not sure if it's better than Apple TV but I've never tried it since you can't have access to Amazon. When I turned it on, it knew me and my movie watching history. It must've been programmed before shipping. How smart!  Would recommend highly, especially to Amazon prime members.", "verified": true, "helpfulness": "0/0", "author": "teachermom \"teachermom\""}, {"rating": 5.0, "review": "Awesome product. bought 5 of them for the entire family, definitely a blast difference between this and the western digital i replace as far as the smooth navigating through the menus. My kids love the MIC option, no more typing or looking for virtual keyboards (I believe only works with PRIME). I love the option to have XbMC, but for the kids its awesome to be able to use their XBOX 360 controller and also play games like Minecraft on this device. I already had Netflix & Prime & with thema alone it provide a vast majority of content, hard to check for live tv!", "verified": true, "helpfulness": "0/0", "author": "M. Guzman"}, {"rating": 5.0, "review": "Great service with prime! Needs more new movies on demand though without paying $20 to buy them.", "verified": true, "helpfulness": "0/0", "author": "JR1620"}, {"rating": 5.0, "review": "Best media play under 100 dollars.", "verified": true, "helpfulness": "0/0", "author": "Lena"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "John"}]