[{"rating": 5.0, "review": "I am still looking for the one to replace them all--best feature is the super fast loading of Amazon prime instant videos. The only drawback to this is the lack of vudu support and other various apps. I actually prefer the interface of Apple TV to this, but I'm very happy with the performance of the user interface compared to others.Update: 2/22/15I have owned this for a few months and I feel that even without the same ios support the apple tv has for the iphone, I believed this to be a far superior product.  Loading times are super fast, network connection is always strong, and while I initially preferred the interface of the Apple tv the arrangement is much simpler and takes less clicks of the remote to get anything going.", "verified": true, "helpfulness": "0/1", "author": "Richie Rich"}, {"rating": 5.0, "review": "We love it!  Lots of free apps.  No buffering during your movies.  And the kids love playing Minecraft together.  With a swipe, everything on the Kindle Fire goes to the screen.  Then, our other son plays along using the Amazon Fire game controller.", "verified": true, "helpfulness": "0/1", "author": "Trena R Freeman"}, {"rating": 5.0, "review": "What internet or broadband does it run 🏃 off?", "verified": false, "helpfulness": "0/3", "author": "melynda l smith"}, {"rating": 5.0, "review": "Quick and easy to install. Simple to use. LOVE it.", "verified": true, "helpfulness": "0/0", "author": "AbbeyLynn"}, {"rating": 5.0, "review": "There needs to be more programming offered. ID TV for one, Ghost Hunters for another. And let's not forget Longmire,", "verified": true, "helpfulness": "0/0", "author": "Kathleen Kaitis"}, {"rating": 5.0, "review": "Love Love Love it. It's so cool, how you can talk to the Fire TV remote, and it pops up on the TV screen.My husband really likes, that he can watch all of the Archer past episode.", "verified": true, "helpfulness": "0/0", "author": "Alyssa"}, {"rating": 4.0, "review": "Amazon Fire is easy to hook up and use.  It makes accessing Netflix and other apps much quicker and easier to access than an Internet ready tv or DVDs player.  I like it very much and would recommend it to any internet tv fan.  I have one problem with it though;  the \"FREE ONE MONTH TRIAL OF AMAZON PRIME\" comes only with a qualifying additional purchase.  In other words there is no free trial.  I would have liked to try prime membership before I committed to a year, but, I consider this little marketing trick dishonest.", "verified": true, "helpfulness": "0/0", "author": "Robin A. Adler \"old timer\""}, {"rating": 5.0, "review": "Loads fast and videos flow uninterrupted. However I think the item description is misleading. Saying that items such as Showtime Anytime, Netflix and others are included at no charge may make some people think these services are free when it is only the app to access these services that is included at no charge and a separate subscription is needed for each service. Setup was easy and fast. I mainly bought this item because I already was a Prime member and was not interested in the other services.", "verified": true, "helpfulness": "0/0", "author": "AMR"}, {"rating": 5.0, "review": "I had been using my blue ray player to run Netflix, Amazon Prime and others. It usually led to frustration waiting for it to load or to rebuffed in the middle of shows. This never happens anymore and picture clarity is awesome.  One of the best investments that I have made. Just $84.00 and a world of viewing is open to me. The voice search really works. I love it.", "verified": true, "helpfulness": "0/0", "author": "Peter Keating"}, {"rating": 5.0, "review": "Bought two of these. Both work well. My only issue that there is no power off function. Id prefer being able to shut it down or atleast put in low power mode from the menu or the remote. Other than that, it plays the app i purchased the device for and allows me to connect to amazon videos.", "verified": true, "helpfulness": "0/0", "author": "J. BRADSHAW"}]