[{"rating": 4.0, "review": "Performs as expected, for a rather minimal price. Easy to set up and get running. My Sony TV is supposed to be \"smart\", for example it has Netflix connectivity. I was never very happy with it's performance, particularly unreliability connecting to Netflix. But the Google Chromecast is much faster, and 100% reliable. For modest cost, it fixed the Sony's limitations.", "verified": true, "helpfulness": "0/0", "author": "David Brender"}, {"rating": 5.0, "review": "Awesome!  There is a learning curve to figuring out how to make this work (so be patient), for Amazon, but once you get the correct app it is so user friendly.  From casting facebook on my TV to casting Netflix, fox and others I can't be happier with this purchase.", "verified": true, "helpfulness": "0/0", "author": "Downing \"Darcy Downing\""}, {"rating": 3.0, "review": "This is an awesome idea in theory but the technology is only as good as your internet provider and it doesn't disclose that.  Fortunately we have great internet speed but I know friends who have purchased this and been greatly disappointed.  Also, the compatibility of this device with my \"new\" HTC phone is a little sketchy.  Not enough Apps yet to be worth your time or money.  Maybe in a year or two it will be worth it.", "verified": true, "helpfulness": "0/0", "author": "Dennis Dotson"}, {"rating": 5.0, "review": "We enjoy Netflix on our large screen TV from my Sampson Tablet.  I tried Amazon Instant video (D.A.R.Y.L.) from my laptop and the picture kept halting.", "verified": true, "helpfulness": "0/0", "author": "Frank A. Boneno \"fboneno\""}, {"rating": 5.0, "review": "Best way to stream content from your phone/computer/tablet", "verified": true, "helpfulness": "0/0", "author": "Derek Baker"}, {"rating": 5.0, "review": "I don't write many reviews, mainly because most stuff is mediocre at best. But this little item is pretty darn nice. I am stuck with, no, punished with Time Warner as my Internet provider. I also have Apple TV and Roku, Apple most of the time cannot reach its server and Roku is just ok.... This Chromcast implementation just plain works with both my IPAD and my Moto X and is able to tolerate TWC's fluctuating bandwidth, at 35 bucks, it is just great.", "verified": true, "helpfulness": "0/0", "author": "L. Leedom"}, {"rating": 5.0, "review": "Works Great", "verified": false, "helpfulness": "0/0", "author": "k jenkin"}, {"rating": 3.0, "review": "Jusy got this yesterday so it's too soon to rate. So far I think it will be much easier to use with a dedicated tablet instead of using my phone.", "verified": true, "helpfulness": "0/2", "author": "jason janes"}, {"rating": 5.0, "review": "google !!! awsome ness!!!!", "verified": true, "helpfulness": "0/0", "author": "zhen liu"}, {"rating": 4.0, "review": "This is a great product and works very well. I wanted a streaming device that easily let me play videos that are not on supported apps and this is the only one I have found that lets you me do it.", "verified": true, "helpfulness": "0/0", "author": "Allison"}]