[{"rating": 5.0, "review": "google chomecast streams great through my apple iphone. It barely skips, and skips less than my apple tv. It is inexpensive and a great way to watch on your tv without a cable box or provider. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "kimberly ayers"}, {"rating": 5.0, "review": "Works great. Got here quickly.", "verified": true, "helpfulness": "0/0", "author": "Mark Harnage"}, {"rating": 5.0, "review": "Took a while to figure out but I finally got it do what I wanted.", "verified": true, "helpfulness": "0/0", "author": "Cameron Hewines"}, {"rating": 5.0, "review": "Chromecast is easy to set up and does exactly what it says. I had no issues setting it up. I can easily cast from my macbook or Galaxy S4 without any problems. The image is really clear, much more clear when using Chromecast over Xbox, Wii, etc.", "verified": true, "helpfulness": "0/0", "author": "Rachel Tritsch"}, {"rating": 4.0, "review": "The basic features of the Google Chromecast can be used easily by any one that knows how to connect to a wifi network. The product itself is small and can be hidden behind the TV either by itself, or with the supplied HDMI \"corner\" add-on. As it can be powered by the TV's USB slots, it minimizes the amount of power outlets needed and the amount of cables that run through the house.The basic and easy to use features include: \"Casting\" tabs from your Chrome browsers into your TV (via the official \"Google Cast\" extension to Chrome) or \"casting\" mobile/web apps to your TV (such as Netflix, Pandora, Youtube, etc.).However, some feature may seem too advance to normal users. For example, in order to stream a movie file from your PC (or Mac) to the Chromecast, you would require an additional app/Chrome extension. An extension such as https://chrome.google.com/webstore/detail/cnciopoikihiagdjbjpnocolokfelagl (Videostream for Google Chromecast).Moreover, if you're residing within countries that don't have services such as Netflix, etc. Be aware that setting the Chromecast to work with services such as http://www.unblock-us.com/ might prove more difficult (as the Google Chromecast uses the Google http://8.8.8.8/ DNS by default).In comparison with other streamers, such as Apple TV, the Google Chromecast might improve the performance of streaming online services (Netflix, Pandora, etc.), as it stream them directly from the source (as opposed to the Apple TV, that streams it from your computer/mobile phone). On the flip side, the Apple TV will stream local content (a movie on your mobile, etc.) in a superior way.Overall, I've been using Google Chromecast for the past 4 months and it is now my main Netflix viewing method. I also don't connect my computer to the TV anymore via a cable - I only use Videostream for Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Gilbert"}, {"rating": 3.0, "review": "Good product to have for $35. Not sure which one has a clinch but it freezes time to time.", "verified": true, "helpfulness": "0/0", "author": "Demberel"}, {"rating": 5.0, "review": "Easy to install", "verified": true, "helpfulness": "0/0", "author": "Q"}, {"rating": 5.0, "review": "Works very well.", "verified": true, "helpfulness": "0/0", "author": "A. Marr"}, {"rating": 2.0, "review": "Always buffering", "verified": true, "helpfulness": "0/0", "author": "ADOLF BURKE"}, {"rating": 1.0, "review": "Never worked right. Netflix never completely worked. The connection was never working properly. All my other web products worked fine. Don't waste your money.", "verified": true, "helpfulness": "1/4", "author": "Lori"}]