[{"rating": 3.0, "review": "The Google Chromecast easily installed on my Apple iPad and it's great to watch \"You Tube\" videos but I was hoping that it would allow streaming of videos from network web sites.  I can watch old issues of TV shows on my iPad but was thinking it would be great to be able to stream them to our larger television.  Well, you can't do that.  Hopefully in the future the networks and Google will come to an agreement to allow that.  It can't take that much of a change in software to make that work.  The Chromecast is a great idea with a fantastic price but for me it needs more applications!  One other complaint.  Please tell us what's in the box.  I thought I would need an HDMI cable so bought one at the same time I bought the Chromecast.  You don't need additional cables!  I can't send it back because postage is more than the cost of the cable.  Come on Amazon, let us know what comes in the box!", "verified": true, "helpfulness": "0/0", "author": "Lee"}, {"rating": 4.0, "review": "Overall it's a good product. I'm just waiting for new apps after the SDK release so I could stream my media from my laptop too!", "verified": true, "helpfulness": "0/0", "author": "Dren"}, {"rating": 4.0, "review": "good quality that really works as promised ,been using it for the past couple of weeks and really enjoying it .", "verified": true, "helpfulness": "0/0", "author": "Tarek Sakr"}, {"rating": 5.0, "review": "I think it's super !  Easy to bring up available. Programs . To my understanding more are coming out . Price friendly also !", "verified": true, "helpfulness": "0/0", "author": "Howard boyce"}, {"rating": 5.0, "review": "I love this. Would like to see an app for Mac to cast Amazon video. Have used this with Netflix, Youtube, Facebook and Vimeo. There is a brief lag on some videos...it starts playing on the computer and then catches up on the screen. One cool feature: you can browse web while casting Netflix.", "verified": true, "helpfulness": "0/0", "author": "Brett H."}, {"rating": 4.0, "review": "Really easy to use for both apple and android users. It has very limited apps at the moment but for the low price its worth a try.The chromecast runs strong even with my router over 50 ft away on the otherside of my apartment, but expect the chrome mirroring feature to be very very slow. As expected the mirroring required a larger network bandwith and can be very sluggish to stream. Otherwise for the low price it easily runs netflix, hulu plus, and hbo go from my phone and tablet. All in all very good product and I look forward to more apps.", "verified": true, "helpfulness": "0/1", "author": "sam"}, {"rating": 3.0, "review": "I have Samsung Galaxy 2 7.0 tablet and YouTube is only app that works.  Netflix gets errors after an update.  Tech support keeps telling me to reset to factory specs but it doesn't work.  Google knows they have a problem but no idea how to fix it.  Seems to me they should just be able to back out the update but not the case. There must be better streaming solutions as this isn't a good one. Am returning mine. Life is too short to put up with this frustration.Update - my neighbor came over and it works on his Motorola smartphone which has older OS than the Samsung. Guessing the Chromecast update isn't compatible with Samsung's OS. The experience still hasn't changed my mind on returning it. What happens next time they add an update - it stops working until they find a fix?Update - after an email conversation with several tech support depts, discovered this is a time issue with the tablet.  My time was 2 minutes off from \"official\" time.  Am changing my rating from 1 to 3. I give the device a 4, support difficulty/frustration a -1.", "verified": false, "helpfulness": "0/0", "author": "Bit Twiddler \"Ron\""}, {"rating": 5.0, "review": "Compatible with all my devices (iPad, Motorola HD, MacBook, surface pro). Easy setup and start up.I just wish that I can cast amazon prime instant videos...", "verified": true, "helpfulness": "0/0", "author": "Baby mama"}, {"rating": 4.0, "review": "Very cool device. For 35 bucks it makes for a great entertainment tool at parties.the price is right and cost effective enough to add to multiple t.v.shopefully more apps are developed around the device.", "verified": true, "helpfulness": "0/0", "author": "Anonymus"}, {"rating": 4.0, "review": "It's fantastic on YouTube but just okay on other sites.  The videos stop and you have to wait, etc.It is really nice tho to watch YouTube videos on my big TV.  Been binging on sewing instructions and entrepreneurship videos.  And music videos.Not great on all sites.  But very much worth $35 if you have the cash.", "verified": true, "helpfulness": "0/0", "author": "Sheila"}]