[{"rating": 5.0, "review": "Works great very pleased", "verified": true, "helpfulness": "0/0", "author": "Cathy Molarius"}, {"rating": 5.0, "review": "Just wish there were more free episodes for Prime members", "verified": true, "helpfulness": "1/1", "author": "Diana"}, {"rating": 5.0, "review": "I should say the Fire TV is outstanding. Both my kids use the voice search and it works great. The menu is designed well, and security and parental control works well. Quality audio and video with HD.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Disappointing; another locked down apple TV clone;1.  No DLNA support2.  Locked root; requires rooting3.  Locked ROM4.  Forced updates that will wipe root5.  Forced amazon home screenAgain; another locked down proprietary piece of hardware that could of been much much more.Was hoping a vendor the size of amazon could fight back against the content providers bullying the market into requiring devices to be locked down to \"protect content\".  They keep hiding behind this as a reason you cannot modify hardware you purchase and keep trying to force laws that cripple these devices.", "verified": false, "helpfulness": "2/9", "author": "zerobane \"zerobane\""}, {"rating": 4.0, "review": "I like all the programs that are free and the grandchildren will like the games.", "verified": true, "helpfulness": "0/0", "author": "Betty Case"}, {"rating": 5.0, "review": "So far, so good.", "verified": true, "helpfulness": "0/0", "author": "Forrest T. Kinkade"}, {"rating": 5.0, "review": "Easy to use.  Provides great access to a variety of TV viewing.", "verified": true, "helpfulness": "0/0", "author": "PJ"}, {"rating": 5.0, "review": "Does everything you could want!", "verified": true, "helpfulness": "0/0", "author": "Stewart Dalton"}, {"rating": 3.0, "review": "The voice activated feature is pretty cool, although it was a big let down that you couldnt connect a usb or external hard drive to it. If i would have known that I couldnt connect my external hard drive with my movies I would have purchased something different. All in all its a good device.", "verified": true, "helpfulness": "0/2", "author": "Mark Campos"}, {"rating": 5.0, "review": "I wish I knew about this much earlier!  So EASY to install.  Don't even need a screwdriver!", "verified": true, "helpfulness": "0/0", "author": "Russ - Largo, Fl"}]