[{"rating": 5.0, "review": "So easy, cheap. Eventually synced with the kindle, but took some trouble shooting. Netflix and YouTube only on kindle. Great", "verified": true, "helpfulness": "0/0", "author": "SheilaE"}, {"rating": 4.0, "review": "So I got the Chromecast as an impulse purchase but I'm glad I did. The unboxing experience was good. Came in very cool packaging that was well thought out. Setup (iPad and iPhone) could have been a bit less convoluted but it was straight forward once I got into it. The confusion point is having to change wireless networks during setup to choose your Chromecast and change its name. I haven't done the PC setup yet as I use my iPad 99% of the time.Netflix and Youtube on the iOS devices works great but haven't tried the PC connection yet.Overall I'm pleased. I'll be glad when they add more functionality/channels/etc.The Holy Grail for me would be Amazon Instant Streaming but I know that'll NEVER happen...R-Update: since this review was done they added Hulu and HBO Go (YES!!!)", "verified": true, "helpfulness": "0/0", "author": "Rick"}, {"rating": 1.0, "review": "This Google Chrome Cast Player looks good on papper !! I wasted way to much time trying to get it working !!! It showed on my TV that it was connected. I have a Google Chrome book so it should have been easy. If it looks to good to be true........  I do however Love my acer ChromeBook", "verified": true, "helpfulness": "1/3", "author": "Michael E. Barrett"}, {"rating": 3.0, "review": "This is a fine product, but it will not do what I thought it would.  My computer and TV are located to far apart.  I did not know until I received it, that they must be no more that 20 feet apart.", "verified": true, "helpfulness": "0/0", "author": "Jerald F. Jones"}, {"rating": 2.0, "review": "From the announcement, I thought it would stream from a Chrome browser on your phone or tablet.  But, it doesn't.  That is what I bought it for.  It has netflix, but so does my Roku and PS3.  It has Youtube, but so does my tablet.  I am hoping for an update soon.  Otherwise, I will just consider this a $35 loss.", "verified": true, "helpfulness": "0/0", "author": "Pete"}, {"rating": 5.0, "review": "Greatest little device in years!  And, three months of free Netflix ... what's not to love!  I've used my Chromecast on three different computers without a glitch.", "verified": true, "helpfulness": "0/0", "author": "Timothy D. Carroll"}, {"rating": 1.0, "review": "Terribly inconvenient / using a remote app on iPad or iPhone for Apple TV is a superior experience, but still not the solution I was expecting.  Lame!", "verified": true, "helpfulness": "0/1", "author": "Ryan Topper"}, {"rating": 2.0, "review": "If a strength and intent was \"one more little box you could take with you, and have your YouTube and NetFlix at a hotel\", at least get a Roku that could do both HDMI and component for hotel/motels with crappy TVs.  This is a neat device on paper, but I can't find a hole in my life to fill with it.  Roku has too much going for it (minus the lack of YouTube at present, granted), but get over yourself, turn off the TV for one damned night or watch YouTube on your other 8 devices, people.  The inability to cast from Chrome on an Android phone or tablet (so far) is again, the dumbest of deal breakers here.  At best, it lets me send something annoying for my kid from a Windows Chrome browser tab (lets call it ABC Mouse, for example) over to the TV across the room, while I still browse at the PC, but this is hardly a mover of worlds.I have high hopes that things will develop and blossom for this little gizmo, but I just bought my first Roku, and three days later, bought two more.  So, tinker away, Google, and open this one up wide to developers and garage tinkerers from all walks of life.  For this to matter, it needs to have something... ANYTHING... a weather channel, some newsfeeds, RSS, come on...", "verified": false, "helpfulness": "0/2", "author": "Andrew Sherman"}, {"rating": 1.0, "review": "My interest was in sending browser data to a larger screen with the Chromecast.  I saw that it could do so from the Chrome browser and ordered one.  When it came, I discovered that you really can not send anything from an Android tablet or phone other than Netflix, Youtube and Google Play.  Turns out that while Android support is touted and Chrome support is touted, you need to dig deep to discover that they don't support Chrome on Android, only Windows.  Basically, it made the device worthless to me.  Mea culpa, I should have been more diligent in research rather than believing the ads.  Read carefully to make sure it does what you want, because it does not do that much.", "verified": true, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 2.0, "review": "... but I much prefer my Roku box. Like many other people, I have a separate Wifi network by the TV. This has been necessary to get a good strong signal for the various dongles attached to my TV/audio system. Chromecast relies on getting control commands over wifi, where everything else (Roku, Android stick, PS3) uses a remote. Therefore, your tablet or phone must be chained to your little wifi network by the TV. Next issue, many Android apps do not currently offer a Chromecast option. I use a Plex media server - great with Roku, laptop, tablet and phone, not so great with Chromecast.", "verified": false, "helpfulness": "0/1", "author": "whitehat"}]