[{"rating": 5.0, "review": "I set up the device last night and it took me a little less than 10 mins. As soon as you plug it in there are instructions that go step by step both on the TV and on your device (my laptop). I'm electronically challenged and I did it without asking my electronic savvy room mates.you plug in to back of TVlog on to websitedownload appset up WI FI passwordname your device (opt)log on to Netflix (or whatever)play movieSo COOL!!! Best $35 spent!", "verified": true, "helpfulness": "0/0", "author": "Anna Plummer"}, {"rating": 5.0, "review": "At first I thought all I can watch is youtube and Netflix (which I don't have).  If you're using your phone or tablet, I suppose this is true, but I wanted to stream shows from my computer.  A friend of mine did some research and we found that as long as I use the Chrome browser (which is the only thing I use anyway) to stream my videos, I can stream it directly to my TV.  For instance, I can watch movies/shows from Amazon by opening up my Chrome browser, installing the \"Chromecast\" extension, and playing the media.  This can also be done with Netflix, ABC, CBS, Vimeo, Hulu (yes, regular hulu, no need for a hulu plus account), etc.I have not experienced any lag between audio/video/subtitles either.  I can finally watch anime on a big screen!!", "verified": true, "helpfulness": "1/1", "author": "Stepherz"}, {"rating": 4.0, "review": "This is very easy to install and use.  Does not do as much as IP for TV does but for the price it lets me get HBO and Netflix on another TV.", "verified": true, "helpfulness": "0/0", "author": "Babs"}, {"rating": 1.0, "review": "IF it was possible to give 0 starts I would have. I have to say this is by far the worst product I've ever purchased to date. It only works on approved apps (only 8 of them so far most notably Youtube & Netflix). It's not possible to cast from Chrome Browser on mobile devices. I tried downloading Google Chrome cast extension from my laptop still a complete mess. I cannot imagine how a product of this caliber is made commercially available.  A simple Google search reveals there are many people who felt duped & misled as well.I'd say even if this product was sold for 1$ it would be 1$ too many. FAIL!!!!!", "verified": true, "helpfulness": "0/3", "author": "DLC"}, {"rating": 5.0, "review": "Fasinating.  I suspect there is much more to come with this technology. I can cast almost everything from my laptop, but expectmore to come for the Ipad.", "verified": true, "helpfulness": "0/0", "author": "BobsByte \"AmFan\""}, {"rating": 3.0, "review": "Gives insufficient access too content. Youtube and Hulu are not enough to make it useful. There should be much more.", "verified": true, "helpfulness": "0/0", "author": "edthieme"}, {"rating": 5.0, "review": "i bought one of these for my 2nd tv i have a apple box for the main tv but i was so impressed with the chrome cast unit that i bought 2 more of them as gives.", "verified": true, "helpfulness": "0/0", "author": "leonardo \"expression n color\""}, {"rating": 1.0, "review": "It was not compatible with my Kindle!  I had to return both that I had ordered.  It looks like they thought I did not return two.  The person I chatted with only marked down 1 item.  I noticed the error after I had already sent them both in.  I am waiting for a response as to if my account has been credited for 2 items and not just the one.  Thanks", "verified": true, "helpfulness": "0/0", "author": "Keith Anderson"}, {"rating": 4.0, "review": "Chromecast is a very useful device to own.  I can now pretty much everything I used to on my laptop on my HD TV.  The only reason I have 4 stars is because it still only has limited services that it supports.  I am sure in time that will increase and then the chromecast will be a must have device.  I was thinking of getting the Apple TV.  Thought I would give this a try for the price difference.  Although the Apple TV would enable to seamlessly move between my Apple devices and my TV, I am not disappointed using the Chromecast at all.  Plus it is more portable.  I would recommend this product to others.", "verified": true, "helpfulness": "0/0", "author": "Venkatesh Noorni Krishnan"}, {"rating": 5.0, "review": "This is as said, Streaming only and it does work very well. Awesome little gadget for the dollar I would recommend to anyone.", "verified": true, "helpfulness": "0/0", "author": "javier"}]