[{"rating": 4.0, "review": "I love this little gadget. So much so, that I originally only bought one dongle, but I moved it around from room to room so much that I ended up purchasing another unit. I may even, eventually, buy one more for the kids play room (heck, these things are only 35 bucks). I love the fact that chromecast is so portable but I love, even more, that the device(s) is easily accessible through, both, apps on my iOS devices and my android devices. And I don't know if anyone else thinks that this is a plus, but if your are watching television and then suddenly enable a chromecast supported app, chromecast automatically change the input on your television to the corresponding chromecast input. I gave this a 4 because nothing is perfect. I would have loved to have seen more app support, cough, cough, VLC player... I would have also welcomed DLNA/desktop/streaming support (natively, not through a any sort of hack). Eventually, Google will release development kits, so I'm sure that my dream will to fruition at some point in the near future.", "verified": true, "helpfulness": "0/0", "author": "D. Carson \"Some Random Reviewer\""}, {"rating": 2.0, "review": "I purchased this for an I pad, For what it does I wasnt happy spent the extra money and got a Apply TV, my suggestion do either Apple TV or get an HDMI cable for your i pad", "verified": true, "helpfulness": "0/2", "author": "tom k"}, {"rating": 1.0, "review": "Save your money. This thing aint all it's advertised as. It's slow to load and having to use another device to run it is a P.I.T.A.  You would get more enjoyment buying yourself a good Cigar and setting the 35 bucks, that this thing cost, to light the Cigar.", "verified": true, "helpfulness": "1/4", "author": "Curtis Schulze"}, {"rating": 4.0, "review": "I really like the promise of Chromecast, but it's not fully baked. Your can cast YouTube, Netflix, and some google play media, that that's it. Over time,I'm sure Google will work out agreements with other content providers, and that's when Chromecast should really take off.", "verified": true, "helpfulness": "0/0", "author": "ray marcano"}, {"rating": 5.0, "review": "This is my second Chromecast. I bought it to go with a new TV and am as pleased with it as I am the first one. Every TV should have one.", "verified": true, "helpfulness": "0/1", "author": "Richard Hostler"}, {"rating": 5.0, "review": "This little item is one of the best purchases I have made. IT is easy to install and use, wonderful!", "verified": true, "helpfulness": "0/0", "author": "Russ Cagle"}, {"rating": 5.0, "review": "i now have 3 units all bought here on amazon, chrome cast,apple tv 2,firestick...they are all awesome and connected to my sony hdtv bravia by special hdmi switch also bought here on amazon,AS for mirroring from apple macbook pro and iPhone and all in all the best has to go to chromecast,but firestick close second if you have amazon prime you must get at least the firestick unfortunately it is not as good as chrome cast for mirroring ,AS FAR AS APPLE TV ITS GREAT FOR MIRRORING APPLE PRODUCTS.....HOPE THIS HELPS", "verified": false, "helpfulness": "0/0", "author": "buddaman1260 \"buddaman1260\""}, {"rating": 5.0, "review": "Works really good.  I had quite a problem getting connected at first.  Finally, I adjusted my computers firewall and was able to cast from my chrome browser without a problem.  Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Jared Friesen"}, {"rating": 4.0, "review": "It's a really cool product, and definitely worth it's value. I don't know what to do with it other than watch youtube/Netflix on my tv, but I'm sure things will come out for it. I would recommend getting it if you have some money to spare and are interested in being an early adopter.", "verified": true, "helpfulness": "0/0", "author": "Ali Poonsakvarasan"}, {"rating": 4.0, "review": "This was easy to set up. Not many applications support this, but those that do are pretty solid. I use this with Pandora, Youtube and NetFlix. I wish Amazon Instant Video would support this device. I wish it would be easier to stream my own content to the chrome cast (e.g. home videos, etc). The ability to cast from the Chrome browser is a terrific feature. In any case, a solid product with tremendous potential.", "verified": true, "helpfulness": "0/0", "author": "Marilee"}]