[{"rating": 5.0, "review": "this is an amazing product.  it works exactly as expected, we now have 3 of these throughout the entire house.", "verified": true, "helpfulness": "0/0", "author": "Jarod Rishe"}, {"rating": 3.0, "review": "It's just a gadget, that's all... not going to revolutionize your living room. After a while I realized that could be better... but for now, for 35 bucks, Its a gadget that im enjoying.", "verified": true, "helpfulness": "0/0", "author": "Lucas Ogasawara"}, {"rating": 4.0, "review": "What gives Amazon? If you'd write an app for this like Netflix, I could finally watch my instant video on my television.", "verified": true, "helpfulness": "0/0", "author": "S. FitzGerald \"Skroo\""}, {"rating": 4.0, "review": "The Chromecast was a little difficult to install, mainly because our Internet speed is so poor in Central Kansas. But it works great now!", "verified": true, "helpfulness": "0/0", "author": "Maura Wiebe"}, {"rating": 5.0, "review": "It as it say that it easy to in stilling  on your TV I say get one for your home try it now", "verified": true, "helpfulness": "0/0", "author": "Dexter John"}, {"rating": 5.0, "review": "It gave my old TV set a new life, allowing it to access internet, including NetFlix, that was my desire. You can also browse your PC with Chrome and show it on TV screen. Great, for a good price.", "verified": true, "helpfulness": "0/0", "author": "Paulo Morais"}, {"rating": 5.0, "review": "I love this little dongle. I like to have the tv on when I go to sleep, and generally that's all I do - watch it til I drop off. Saves me the monthly cost of an extra outlet!", "verified": true, "helpfulness": "0/0", "author": "Howza \"CPH\""}, {"rating": 4.0, "review": "I love this, I just wish I could do even more with it. Great product for the money. I would buy again.", "verified": true, "helpfulness": "0/0", "author": "jackie"}, {"rating": 5.0, "review": "Delivered In A Timely Matter...I Use This To Stream Netflix And Youtube Videos To My TV From My Cellphone And Laptop And The Images Are Clearer Than My Regular TV Cable Channels.", "verified": true, "helpfulness": "0/0", "author": "dshep1"}, {"rating": 5.0, "review": "Easy to install. Easy to set up. Easy to use. Changes easily from television to television. Recommend for anyone. Will be buying them as affordable gifts.", "verified": true, "helpfulness": "0/0", "author": "Linda R. Mcconnell"}]