[{"rating": 1.0, "review": "Thought I was going to be the cool kid by being the first on my block to get the new Google Chromecast. Was all excited with my new gadget when it came in the mail yesterday. Installed it and got it running today, only to find out that one of the main features, streaming from your Chrome browser to your TV, is not yet supported on Android devices!! The browser plug-in for Chrome is supported on Mac, Linux, and Windows, but not Android!! WTF? Its made by Google for god's sake!! Why would they release the hardware without having one of its main features supported on Google's main platform.  Especially considering it has already been on the market for 2 months this should not be an issue. The whole point of the thing is to stream from your device to your TV!!! Epic fail Google!!", "verified": true, "helpfulness": "4/14", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a great device! Yes, it's not as fully featured as an AppleTV or other similar devices, but for $35 and having had very little exposure to developers, this purchase is definitely worth it.A WORD OF CAUTION: if you are planning to use this device on a public network that you do not have any access to adjust settings for, STOP AND MAKE SURE THAT YOUR NETWORK HAS THE CORRECT SETTINGS! i.e.: it is impossible to use a Chromecast on my university wifi because my university network administrators have not woken up from their 10-year technology hibernation and realized that it is 2013 and there are more than just laptops that use wifi.", "verified": true, "helpfulness": "0/0", "author": "mh"}, {"rating": 1.0, "review": "There are only three apps on Android that support it.  Two if you have many models of phone (netflix was not upgraded on many of the popular older phones).  Does not cast well from the browser on the laptop, get stuck, pauses, crashes.  Thought it would be a cool little gizmo.  Turned out to be another useless piece of junk.  Does Google take anything out of beta and finish it?", "verified": true, "helpfulness": "1/6", "author": "James"}, {"rating": 3.0, "review": "Setup was a little difficult but once I got through it, it has worked great.My major issue is that it doesn't support enough playback options. On my iPad/iPhone, only Netflix and YouTube (through the YouTube app) are supported. On the computer, I can send anything from Chrome to my tv except, if the site uses Microsoft's Silverlight, it won't send sound. It's pretty annoying to watch the picture on the tv with the sound coming from my computer.", "verified": true, "helpfulness": "0/0", "author": "Jeff S"}, {"rating": 5.0, "review": "For what it does, and what it will be able to do in the future, it's low price makes it a great value.  I use a PS3 as my primary Netflix device on my main HDTV, but the Chromecast lets me watch Netflix on my secondary bedroom TV.  I ordered my unit in time to receive the (now discontinued) 3-month Netflix credit, giving me an effective cost of $11, which is a steal.  When (not if) they come up with a way to play locally stored content, this thing will be even better.  (And it may not seem like it, but the fact that this is controlled by your phone/tablet/laptop and not with a separate remote is actually a big plus.)", "verified": true, "helpfulness": "0/0", "author": "Brian Casey"}, {"rating": 5.0, "review": "Just go ahead and order it, arrived 9/6 I ordered it on 7/26 way too long to wait but that is not the products fault.Anyway, nice simple packaging, simple instructions, easy set up. (unless you are a moron, which I suspect most of the one star people are.)Works nicely with Netflix, watched two entire TV shows, controlled one from a Galaxy S3, the other from a laptop.Watched a little steaming from a chrome tab, quality had to be turned down to get it to work right but it worked OK.Netflix worked.You Tube worked.Google Play Movies worked.Google play Music Worked.That what I was promised, that is what I got. What more can you ask?", "verified": true, "helpfulness": "0/0", "author": "Doug Y"}, {"rating": 4.0, "review": "Works good when casting YouTube. Not so good when casting movies online. Hoping future upgrades will improve performance from PC to Chromecast.", "verified": true, "helpfulness": "0/0", "author": "ksr69"}, {"rating": 4.0, "review": "For 35 bucks its pretty cool.  I have a Netflix on my DVD player and navigating is bearable.  Navigation with my Nexus 10 and the Chromecast is easier, but I would like to be able to display more things.  I would like to display powerpoint presentation or spreadsheets for work but AFAIK this does not.  The power cord is a bit of a drag.  It would be nice if power over HDMI was in the works.", "verified": true, "helpfulness": "0/0", "author": "tabinin"}, {"rating": 3.0, "review": "When I bought this I thought it would have it's own apps or could be used with the app store but sadly no.  It will only stream from a chrome browser which means you actually need two devices to watch anything.  Maybe in time google will add more value to it.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "Google did an awesome job with this product. Now I get to enjoy all the good YouTube videos on my TV. Wating on more apps to be available.", "verified": true, "helpfulness": "0/0", "author": "Lobo50"}]