[{"rating": 1.0, "review": "Pie Writ Bhey is free! Just another stupid device wasting resources...", "verified": false, "helpfulness": "1/18", "author": "Bryan Kluth"}, {"rating": 3.0, "review": "I have Roku 2 now and though I'm really un-happy with it I won't purchase the Amazon Fire TV. My must have is headphones. As soon as Fire adds headphones I'm there.", "verified": false, "helpfulness": "0/11", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Hi guys! I live in the very south of the Americas: Chile: Please let me know whether Fire TV is OK for my country or it is restricted like Prime instant Video... (so, if we could use it or not!)We have American relatives in California coming soon. They could bring along the device to Chile.Tks!", "verified": false, "helpfulness": "0/3", "author": "Mauricio Faivovich"}, {"rating": 5.0, "review": "The best you have ever done", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "We love our Amazon Fire TV. The only thing is it has started to tell us not enough memory is left and we have only had it a month.", "verified": true, "helpfulness": "0/0", "author": "Mata Smith"}, {"rating": 4.0, "review": "I wish apple would issue something a bit cheaper. This is still quite expensive to our family", "verified": false, "helpfulness": "0/2", "author": "roger kent"}, {"rating": 3.0, "review": "The Fire TV freezes up and not as many channels as our Roku. The only time you can use voice command is when using Prime. When accessing other channels it does not work. I was excited to get this for my husband and was let down with it.I would not purchase another FIre, I would purchase the Roku again in the future.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Until I got the Amazon Fire TV, I thought Roku 3 was the epitome of streaming video players. I had the Amazon Prime and Vudu apps on it that I used frequently. Vudu I liked because of its superb audio and video movie offerings. Then I hooked up this unit and played the Amazon Prime app. What a difference! The sound is amazing; equal to anything on Vudu, and the picture is a knockout as well. Oh, did I mention the speed? Amazon Fire TV has it hands down. The one thing I disliked about the Roku 3 was its small memory (512 MB) and slow (Dual Core) processor. I often found myself unplugging the Roku to refresh its memory because I'd get the rotating wheel and a buffering message. Contrast that with this baby's Quad Core processor and 2GB of memory and it makes the Roku 3 look pathetic. Oh, and I've come to love the Voice Search a lot, too. Do you get that I really like this unit? I recommend it without hesitation.", "verified": true, "helpfulness": "2/2", "author": "CJ"}, {"rating": 5.0, "review": "I use this now to buy all my movies and shows.  I no longer have to buy it on my laptop then watch it on my Xbox.  Also, this makes it so much easier to just do voice remote control to say what you want to watch and buy it/watch it right a way.  No more large collection of DVD or BluRay boxes all over the house.", "verified": true, "helpfulness": "2/2", "author": "B. Butler"}, {"rating": 5.0, "review": "Very happy w/the Fire TV!", "verified": true, "helpfulness": "2/2", "author": "MTAR \"Colo Book Lover\""}]