[{"rating": 4.0, "review": "Actually prefer it over my Roku. Great for cord cutting with Sling TV.", "verified": true, "helpfulness": "0/0", "author": "matt b"}, {"rating": 5.0, "review": "Awesome device. Meets many of my needs and allowed me to \"cut the (comast) cord.\" Two things: 1. I hope Amazon adds MGo to its content. 2. I would like to see the content organized a bit more like Roku in future upgrades/versions. Overall, I am enjoying the device and have no regrets.", "verified": true, "helpfulness": "0/0", "author": "AmazonJunkie"}, {"rating": 5.0, "review": "Works like a charm. Way better then Apple TV!", "verified": true, "helpfulness": "0/0", "author": "Avtar Rai"}, {"rating": 5.0, "review": "better than apple tv, and im have both at home", "verified": true, "helpfulness": "0/0", "author": "Matheus Machado"}, {"rating": 5.0, "review": "I say that because of center channel audio and low volume issues I am having. I have read others dealing with the same thing. I have been able to compensate for much of it with my Yamaha RX-V675 Receiver but then my Samsung BD-FM59 Blu-Ray player needs adjusting. Yes I know the audio delivered to the receiver is different which clarifies my uncertainty to whether it is an issue with the Fire TV or not.Anyway, I like the Fire TV a lot. It took a bit to get used to the mixed content but that is past tense now. The video content is ample enough to always have something for me to watch. I am in binge heaven!  I rarely use Netflix now. The games are ok for just quick gaming but my XBOX 360 is still my heavy gaming box. I can't expect the Fire TV to compete with that. Prime music is great. The family has profiles and the lyrics included on some are cool. The Fire TV box is crisp when clicking the remote. I also have two Fire TV Sticks and crispness is obvious between the two. The iPhone app works well but can have latency issue but that can easily be caused by my network and known iPhone Wi-Fi issues.Would i recommend this to a friend?  I do all the time!  This blows away the Roku 2 I have. Waste of money really but I still have a tube TV I use it with.This was my cable cutting solution and I am now $200 a month richer for it. Local channels are pulled in via antenna.I told my other two kids that if they show me all 90's on their grades by Christmas that they will get one along with a flat screen TV. The 3rd child made Honor Roll so you know she did. So there, possibly two more in my future.", "verified": true, "helpfulness": "1/1", "author": "RT"}, {"rating": 1.0, "review": "I WISH I would have just ordered a regular Roku. At least they work better!! The screen freezes up ALL THE TIME> and the movie keeps playing. When you try to rewind it to the part you missed it starts over. It also is very difficult to get the clicker to stop and not overclick on everything. I absolutely hate this product. I am going to have great joy bashing it to pieces with a with a baseball bat. What a waste of a $100!!! (oh and BTW I also have PREMIUM internet) so no... its not my internet. :(", "verified": true, "helpfulness": "4/6", "author": "Dianna Garcia"}, {"rating": 1.0, "review": "Ok after using this for a while I have several complaints 1. why does it go to sleep if you are playing music such as pandora and the sterm ends the box goes to sleep.  I went into settings and there is no way to change the sleep mode, I called Amazon Tech Support and they said I was correct.  Streaming MLB the video stops and buffers for several minutes before starting again, fortunately I have a hard wired network available so I use it.  I agree with the other buyers about Prime Free Movies.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It works pretty well for everything except Amazon Prime.  Either I get too many buffer issues or I get error messages preventing videos from playing.  Other services (like Netflix) work fine.  Considering I got this primarily for Amazon Prime, I am very dissapointed.", "verified": true, "helpfulness": "1/1", "author": "Michael J. Cole"}, {"rating": 5.0, "review": "Easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Morgan \"phone\""}, {"rating": 5.0, "review": "Simply the best hardware and best streaming Entertanment system out there. I have purchased 6 unit, 5 for my home and on when I travel.", "verified": true, "helpfulness": "0/0", "author": "Dion & Catherine Tsourides"}]