[{"rating": 5.0, "review": "I LOVE my Chromecast.  I use it to stream my online video lectures from my tablet, phone, or computer to the TV for better viewing of my classes.  Nice screensaver pics prevent screen burnout, and the resolution is fabulous on our 55\" HDTV.  Also works great for Pandora, Netflix, and Hulu.I've had mine since January 2014, and I haven't had any problems with the device.  I do wish that it could remember more than one network at a time, since I take this traveling with me frequently (works great on hotel TVs, but you have to provide a login network, so I usually set up a wifi hotspot).  Maybe that's by design, or maybe that will come with the next generation.Finally, I put this to the \"granny\" test.  My mother has blinking 12:00 on all of her household appliances and is generally uncomfortable with new technology.  She was able to set it up herself and get it working with her iPhone, which means that it is not a complicated technology to use.", "verified": true, "helpfulness": "0/0", "author": "M. Cirtain"}, {"rating": 4.0, "review": "Good. Prefer Apple TV to this though.", "verified": true, "helpfulness": "0/0", "author": "Bob A."}, {"rating": 3.0, "review": "Good but takes 24hrs to refresh", "verified": false, "helpfulness": "0/0", "author": "robert hudson"}, {"rating": 5.0, "review": "A great way to get digital media to the tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"KMD\""}, {"rating": 5.0, "review": "Excellent Product!", "verified": true, "helpfulness": "0/0", "author": "Brian Berry \"BBNZ\""}, {"rating": 5.0, "review": "The best XMAS present ever. Now I have three..one in each bedroom", "verified": true, "helpfulness": "0/0", "author": "Jordan B. Smith Jr."}, {"rating": 2.0, "review": "I returned it. Do a lot of research before buying to mitigate expectations. Sure there's an app for iPhone and iPad but you can't push anything from them which made it useless for me. If I have to push from my laptop and hard wire it so the picture doesn't waiver, might as well hook up laptop via hdmi cable and save $30.", "verified": true, "helpfulness": "0/0", "author": "Lori Johnston"}, {"rating": 2.0, "review": "other SMPs are much better", "verified": true, "helpfulness": "0/0", "author": "David j Button"}, {"rating": 5.0, "review": "This is an awesome product. I am a mac head and I chose this over the Apple TV since it was super simple to set up and is compatible with every device I have. I have a mixture of mac and android products and it works beautifully and seamlessly without hassle. I would highly recommend getting one for every TV in the house!", "verified": true, "helpfulness": "0/0", "author": "StarGazer12"}, {"rating": 1.0, "review": "Had lots of issues with chrome cast. Was causing problems with other wifi devices. Had to return it.", "verified": true, "helpfulness": "0/0", "author": "KMR"}]