[{"rating": 5.0, "review": "This is simply the most advanced streaming media player on the market. Period. I made this purchase with low expectations, but was amazed at how easy it was to set up and use, and the ability to play games was an added bonus - most are free and my son loves them! Thanks to the generous internal memory for buffering, once laggy playback has become a turbo-charged viewing experience. Highly recommended!", "verified": true, "helpfulness": "1/1", "author": "Sid B"}, {"rating": 5.0, "review": "Love my Amazon Fire!hours and hours of fun!", "verified": true, "helpfulness": "1/1", "author": "Carl B Tash"}, {"rating": 4.0, "review": "I love my Amazon Fire TV. The only issue i have with it, is that there is no OFF button! So the thing in on all the time.....does anybody know the trick to this thing?", "verified": true, "helpfulness": "0/0", "author": "Nidi Flo \"Nidi Flo\""}, {"rating": 4.0, "review": "Overall impressed. Some minor issues here and there, but don't know for sure if it's the Fire TV or the actual app. This blows away my Roku 2 player I had. Super fast menu scrolling and loading time for videos seem super short!", "verified": true, "helpfulness": "0/0", "author": "Pdog"}, {"rating": 5.0, "review": "Excellent product.", "verified": true, "helpfulness": "1/1", "author": "Manuel R."}, {"rating": 4.0, "review": "Great! I love it. I haven't figured out how I can surf the web. Maybe there is a way. I'm still exploring all its potential.", "verified": true, "helpfulness": "0/0", "author": "K. L. Gould \"word addict\""}, {"rating": 5.0, "review": "This is the best invention since the computer. It's so easy to set up, so easy to use, has so many great options. I love it, I recommend it.", "verified": true, "helpfulness": "1/1", "author": "Helen E. Dicks"}, {"rating": 4.0, "review": "The Fire TV device delivered exactly what i was looking for - content that makes my treadmill time more enjoyable.  There are 2 things I do wish that were easily available:1. Automatic recognition of my wife's Prime membership.  Maybe I just didn't push the correct button, but it asked if i wanted to test drive Prime for 30 days.  I'm certain I'll get it square but.....2. Easy access to our FIOS (in our case; Cox/Comcast etc for anyone else) content.  Again, there might be a magic button that I haven't found.This is a very good product and I'd buy another.", "verified": true, "helpfulness": "0/0", "author": "Mike Stewart"}, {"rating": 1.0, "review": "Product went dead within 30 minutes of use. Unable to power on. Hoping for a better outcome with the replacement.", "verified": true, "helpfulness": "4/4", "author": "Rachel Burns"}, {"rating": 5.0, "review": "Fabulous!  I can now stream to my flat screen tv.  Watched all the 10 episodes of BOSCH on my tv instead of my Kindle.HIP HIP HOORAY!", "verified": true, "helpfulness": "1/1", "author": "Rochelle Brown"}]