[{"rating": 3.0, "review": "once there's more apps available,it will be what I need. right now I am limited to what there is to watch", "verified": true, "helpfulness": "0/0", "author": "kipp"}, {"rating": 4.0, "review": "This little device is great for streaming netflix or anything on your google chrome web browser.  I have found it is a bit buggy when streaming from my phone (Galaxy Note 2).  The netflix app has some quirky things to it that you need a little troubleshooting ability to fix.  Sometimes the icon to send to google chromecast doesn't show up.  Sometimes it does but it doesn't do anything.  Sometimes netflix will fail to load off of chromecast and you will need to reset the power.  Sometimes your phone will say chromecast is playing something off netflix but your tv won't budge (typically happens when you start something while netflix is loading on the tv).Besides all the quirks I've been immensely satisfied with this product.", "verified": true, "helpfulness": "0/0", "author": "Steven G Schultz"}, {"rating": 5.0, "review": "More than met my expectations. VERY easy to set up. Life saver when it comes to entertaining a six year old who wants his favorite cartoon & I have to get it off the internet because I don't subscribe to that channel.", "verified": true, "helpfulness": "0/0", "author": "Darrell"}, {"rating": 5.0, "review": "Just what I needed to stream Youtube and Google Play programs to my TV.  Along with my Roku, antenna and now Chromecast I have been off of cable for three years now and haven't missed it.  I pay $17 a month ($8.50 for Netflix, $8.50 for HuluPlus) for TV on my Roku, I can rent what I want through Google Play on my Chromecast now, Youtube has tons of free stuff and I can get live sports on the antenna or on my computer through Justin.tv or various other outlets (I haven't missed an Arsenal game in the past three years I have not had cable).  Don't miss cable at all and at $35 Chromecast just made my experience that much sweeter!", "verified": true, "helpfulness": "0/0", "author": "Denis M Rodriguez"}, {"rating": 5.0, "review": "It's not expensive. It totally does it's job what it promises. It even exceeded my expectations. It's been 2 months, no problems.", "verified": true, "helpfulness": "0/0", "author": "binay"}, {"rating": 5.0, "review": "Finding the Chromecast helped make our decision to ditch cable.  We already have Netflix and Hulu and now we can \"cast\" anything that plays on my laptop to the TV screen.  We've had no problems at all with it, we even stream from the app on our phones.  Best thing we've done in awhile!!", "verified": true, "helpfulness": "0/0", "author": "Pam  P"}, {"rating": 5.0, "review": "Works awesome with all my devices (MacBook Pro Retina, Nexus 7 Tablet 2nd Gen and Nexus 4 phone). I love using my devices as the controller and the convenience I get from it.So far I enjoy Netflix, YouTube and Hulu Plus on but would like to have more Apps especially one that would enable you to Stream your own collection to Chromecast.The perfect I believe would be VLC app or something that could play all video files, formats and codecs to your TV that would just make Chromecast untouchable and PERFECT!I hope something like this is allowed on Chromecast if not then it seriously being crippled :(", "verified": true, "helpfulness": "0/0", "author": "CARLOS RUIZ"}, {"rating": 4.0, "review": "I bought this because1. it was only $352. It seems to be a cool new toy3. it's really small so you can take it with you when you travelI give it only four stars, because it's still being developed.  It supports Youtube, Google Play, \"chromcasting*\", and Netflix right now.  I'm hoping they add PlayOn soon.  Basically it's a Roku on a stick.  The fact that Google is developing it gives me hope that there'll many more apps coming.*I mentioned \"chromecasting\" above. What I mean is you can share you chrome browser screen from you PC as well.", "verified": true, "helpfulness": "0/0", "author": "Paul Bradford"}, {"rating": 4.0, "review": "I bought this for what it one day will be, the ultimate supplemental media streaming device. That being said it still has some work ahead of it, the cast desktop and tab options have significant lag and in the whole desktop option the screen is flipped upside down. Understandably both of the aforementioned options are labeled \"Beta\" so expect improvements in the future. The Youtube application is problem free and extremely impressive, as is the Netflix application. I look forward to the day when the supported application list expands to Amazon Video.", "verified": true, "helpfulness": "0/0", "author": "Anri Pekaj"}, {"rating": 5.0, "review": "very good device. it's very easy to setup. However, the setup does not working with a macbook and a hidden network. I have to switch to my PC which is running windows 8.Other than that, all the castings are working like charm and it's worth $35.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]