[{"rating": 3.0, "review": "Cheap $35 gadget and works with Youtube and Netflix apps. But the connectivity is crappy and many times I have to reconnect. Hope we get a firmware upgrade soon, and with out it it is not meant for primetime.", "verified": true, "helpfulness": "0/1", "author": "T. Adeeb \"AmazonUser\""}, {"rating": 5.0, "review": "This little gem works for our household as described.  Setup was reasonably easy.  I purchased 3 of these.  Named them differently and use them a good deal.  So far we have not had any problems.", "verified": true, "helpfulness": "0/0", "author": "CV Graham"}, {"rating": 5.0, "review": "Now we can control YouTube, Netflix and Hulu from our phones or family tablet. It's awesome! I only wish Google would get a clue and let people stream video directly to it.", "verified": true, "helpfulness": "0/0", "author": "Guillermo Amaral \"gamaral\""}, {"rating": 3.0, "review": "If you have any device that can mirror iPhone/iPod to your HD TV, I think this is not very useful. It does not mirror your iPhone. This device only works with a few apps, such as Netflix. There is also some limitation on Network setting. The only good thing is you can control your Netflix wirelessly with your iPhone.", "verified": true, "helpfulness": "0/1", "author": "Hyunsoo Chae"}, {"rating": 5.0, "review": "Still learning about everything we can do with this but definitely worth the price!  Need an expert to come teach me more!", "verified": true, "helpfulness": "0/0", "author": "ron judge"}, {"rating": 1.0, "review": "After seeing all the rave reviews, I decided to give this a try.  It set up fairly easily.  A few little hiccups but nothing major.  The trouble came when I started watching content.  After about 1-2 min the video started to jitter, then stop.  \"Re-casting\" worked ok, but again and repeatedly it would jitter than stop after 1-2 min.  Occasionally the connection was completely lost.  I checked the troubleshooting guide and found that this is a \"known issue\" and that what I've already been doing - recasting - is their recommended fix until they work out the bugs.This is an unacceptable bug.  I deem it unusable as it is.", "verified": true, "helpfulness": "1/1", "author": "Stuart B. Wtherbe \"sbwetherbe\""}, {"rating": 5.0, "review": "What can I say, $35 and I can stream stuff from any of my electronic devices to the TV. as well when friend come over all they have to do is connect to my wireless and they can start streaming  too. I love this little thing. It has completely put our smart blue-ray player out of commision.", "verified": true, "helpfulness": "0/0", "author": "ngille"}, {"rating": 5.0, "review": "Very easy to use, automatically switches the HDMI input on my TV.  The easiest way to watch online video on your TV period.", "verified": true, "helpfulness": "0/0", "author": "Timothy P Witmer"}, {"rating": 5.0, "review": "2014 is set to bring more apps to the Google Chromecast and I can't wait!  Easy to use and works really well.", "verified": true, "helpfulness": "0/0", "author": "Andy Whalen"}, {"rating": 5.0, "review": "Only YouTube and Netflix works on Google Cromecast. Also, installation is a breeze. Impressive. I have installed Cromecast on Android and Apple products. Works effectively.", "verified": true, "helpfulness": "0/0", "author": "Lucky father"}]