[{"rating": 5.0, "review": "I simply love it. Easy to hook up, the hardest part was entering the password to my wifi, but that's a slow progress on nearly all boxes. Haven't had any problems and the navigation is simple. I've only used the speaking function a few times; I'll try to make it a habit now.", "verified": true, "helpfulness": "0/0", "author": "Arsenic and Young Lace \"closet geek\""}, {"rating": 5.0, "review": "Great selection of movies and tv shows. Very easy to install and use. Very sleek and low key. No reason for my AppleTV anymore!", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 4.0, "review": "I like a lot about the Fire TV. I was replacing an Apple TV 2nd Generation that was jailbroken and had Xbox Media Center, now Kodi, installed on it since I bought it.There are a lot of  positives. First it is much quicker than my previous ATV2. The menus are quicker, it starts playing video quicker and is able to stream HD video without any stutters. I can stream bluray rips and for the most part it is able to keep up just fine. I also like the ease which KODI can be installed on the Fire TV and it works very well.A few things have been bothering me about the Fire TV. it will at time be unable to get videos to play either from netflix or amazon. I have had to restart the Fire TV probably a couple times a week. I also dislike that the Fire TV won't work with my existing Harmony Remote. Finally I wish there was a way to load KODI without having to manage the applications through the menu. (There may be a way, I just don't know it yet.)  Also I wish that airplay worked better to KODI via the Fire TV. I know that is a software issue, but it is one thing that I miss about my apple TV.Overall I am glad that I made the switch and feel it is an upgrade. I may still build an HTPC as the Fire TV doesn't appear to pass through HD audio. However I really like that netflix and amazon video are natively supported and work better than most HTPC workarounds.", "verified": true, "helpfulness": "0/0", "author": "L. Matthews"}, {"rating": 5.0, "review": "Worked perfectly right out of the box", "verified": true, "helpfulness": "0/0", "author": "CBW"}, {"rating": 4.0, "review": "So far it is great! I am going to buy one for my mom who doesn't have cable but DOES have Wifi and an Amazon Prime acct. It is so simple to use", "verified": true, "helpfulness": "0/0", "author": "dlight"}, {"rating": 3.0, "review": "its alright, its a bit lacking on available apps, and i really don't like that there is no web browser. would be nice if the search option would search all installed apps, instead of just amazon.", "verified": true, "helpfulness": "0/0", "author": "GDEL"}, {"rating": 5.0, "review": "Loving playing with this new device....no longer need cable box for my son's room due to this device", "verified": true, "helpfulness": "0/0", "author": "Pen Name"}, {"rating": 5.0, "review": "The specs on this box are second to none which is why I decided to try it. I've also used Apple TV and Matrocom android box but this really performs excellent. It does all the things it's built to do very well but for me what put it over the top was how well it works with Kodi. If you're even just a little tech savvy you shouldn't have a problem setting up Kodi if that's what you want it for, but it's worth getting just for the usual applications like Netflix or HBO Go or the various other options.", "verified": true, "helpfulness": "0/0", "author": "Daniel Hernandez"}, {"rating": 5.0, "review": "We enjoy it.", "verified": true, "helpfulness": "0/0", "author": "Laura Pawlowicz"}, {"rating": 5.0, "review": "Purchased my Amazon Box about one month ago and is very pleased. The processing speed played into my decision of purchasing this box. Great Buy!", "verified": true, "helpfulness": "0/0", "author": "Corey Bolden"}]