[{"rating": 5.0, "review": "I just love this little gadget!  Now I can send movies to my nice big flat panel TV that I used to have to watch on my computer.  I can' also project Facebook and other social media sites onto my TV when I do workshops.  It's great for both personal use and business use and all for a tiny, price.  I just saved thousands of dollars on a projector that I no longer need to buy.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Linda Nelson\""}, {"rating": 5.0, "review": "I received this item as a gift, and couldn't be happier!  Easy to setup and use.  No i have no wires from my night stand to my TV to watch Netflix, HBO GO, or just a Tab on chrome.  Also if your TV has a USB port that is not labeled \"Service\" you don't need to worry about were to plug in the device.  Great gift or just to link a phone, tablet, or computer to your TV.", "verified": false, "helpfulness": "0/0", "author": "kyle craver"}, {"rating": 4.0, "review": "Google put together a quick easy and cheap way for people to stream video.  I bought one and gave one to a relative.  Good Job!", "verified": true, "helpfulness": "0/0", "author": "M. Wilson"}, {"rating": 4.0, "review": "It only streams things that it has plugins for like netflix and youtube and tabs of Chrome. That said, for the price, it can do amazing things, and I can see a lot of neat apps for this coming in the near future.", "verified": true, "helpfulness": "0/0", "author": "Eric B. Pratt"}, {"rating": 4.0, "review": "Finally figured out how to make it work. Everyone can sit around the bigscreen, and all can take turns sharing YouTube videos from their own smart phones. Everyone with the ChromeCast app on their device share Control automatically!", "verified": true, "helpfulness": "0/0", "author": "Michael Bell"}, {"rating": 5.0, "review": "At the begining, I canot make the connection with my bedroom TV, because I was far away of my Wii Fi, So I give it to my son and in his place, the WiFi was near the TV, so It work nicely.", "verified": true, "helpfulness": "0/1", "author": "Beatriz de la Vega"}, {"rating": 1.0, "review": "It doesn't work with netflix and only work with youtube but after a while it shows an error. I really want to return it", "verified": true, "helpfulness": "0/2", "author": "Eduardo Molina \"Eduardo\""}, {"rating": 5.0, "review": "It really does just about everything you could want it to do. Netflix, HBO Go, Hulu Plus, Youtube, Spotify and general Chrome browsing all projected to a big screen for effectively $32 is just unbeatable. Took me longer than I want to admit to realize that I could just plug it directly into one of the HDMI inputs on my receiver, but I really couldn't be much more pleased with it. If I had to nitppick, it's not resilient against network congestion and there are occasional ghosts in the machine that you'd expect from a rev1 product. Still, gift of the year (of course, I gave it to myself). I'll be buying more for every other TV in the house.", "verified": true, "helpfulness": "1/1", "author": "Dan"}, {"rating": 3.0, "review": "Chromecast performs the basic concept of easily sending your video feed from the limited available apps. I found it difficult to send a feed of my screen because it would not adjust correctly to my screen size.", "verified": true, "helpfulness": "0/0", "author": "Mario Ichaso"}, {"rating": 1.0, "review": "Okay so currently it is a cool idea, but it doesn't do much at this time.  It only has like 8 apps that it will work with and won't work with your actual videos or pictures.  So basically unless you don't have any way to watch netflix or hulu on your tv, then this is pretty much worthless to you.  Wanted to really like it, and thought it was a great idea, it just doesn't do much of anything currently.", "verified": true, "helpfulness": "0/1", "author": "JSB"}]