[{"rating": 2.0, "review": "always try to up sell u....irritating!!!", "verified": true, "helpfulness": "0/1", "author": "marc butler"}, {"rating": 5.0, "review": "GREAT STURDY BUILD QUALITY... EASY TO USE REMOTE.... EXCELLENT PICTURE AND MENUS....YOUTUBE APP....SUPER FAST!!!!  EASY TO GET GOING!!! CAME ALREADY LINKED TO MY AMAZON ACCT!!! BUYING A SECOND ONE!!!!", "verified": true, "helpfulness": "1/1", "author": "Joel S"}, {"rating": 2.0, "review": "Glitchy. Cannot get Netflix to open. Some issue with the device.", "verified": true, "helpfulness": "1/1", "author": "john longenecker"}, {"rating": 5.0, "review": "Love I love it But needs more choices of movies or TV shows", "verified": true, "helpfulness": "1/1", "author": "Edward Baldwin"}, {"rating": 4.0, "review": "I've only had Amazon Fire a few days, and so far, it seems to be working fine.  I had a little problem with setting up the one-click payment process, but believe it's okay now.", "verified": true, "helpfulness": "0/0", "author": "ReDickulus"}, {"rating": 5.0, "review": "The voice command is awesome. It would be nice if amazon charged per month like netflix . Or had a bigger selection of prime movies. But still awesome. Thanks", "verified": true, "helpfulness": "1/1", "author": "Dan Saenz"}, {"rating": 5.0, "review": "This is the best product ever for TV.  The selection is amazing, and the price is very reasonable.", "verified": true, "helpfulness": "1/1", "author": "D. Nied"}, {"rating": 5.0, "review": "just started using the fire tv but so far it is great.", "verified": true, "helpfulness": "0/0", "author": "DONALD R. BAILEY"}, {"rating": 4.0, "review": "Would have given 5 stars but i live in the bahamas and cant utilize the Prime member features. But i downloaded netflix so i watch movies there. Otherwise i love firetv", "verified": true, "helpfulness": "0/0", "author": "laurinda griffin"}, {"rating": 1.0, "review": "Content is the problem.  Why would I want to play more for movies and show with this device than I can get on DVD or elsewhere.  For instance, Breaking Bad Season 2 is ~$22 on Fire TV.  It's $10 on DVD here and in Bes Buy and Streamed on Netflix for the $9 per month.  What is Amazon out to do, trick people into spending twice the real price on stuff?", "verified": true, "helpfulness": "3/10", "author": "Brian W. King"}]