[{"rating": 5.0, "review": "cool", "verified": true, "helpfulness": "0/0", "author": "Alexandre"}, {"rating": 1.0, "review": "As open as Google likes to claim to be, this device doesn't allow you to change the DNS servers.  I sent it back.  Won't buy it again.", "verified": true, "helpfulness": "0/1", "author": "An honest reviewer"}, {"rating": 5.0, "review": "Is very nice, now can see just to I want to see...", "verified": true, "helpfulness": "0/0", "author": "eduardo"}, {"rating": 1.0, "review": "had big problems trying to get connections an codes to come together ?", "verified": true, "helpfulness": "0/0", "author": "Bill Dorsey"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "John Hagan"}, {"rating": 5.0, "review": "Good!!!!!!", "verified": true, "helpfulness": "0/0", "author": "Gilberto"}, {"rating": 2.0, "review": "It does not work if you are using a personal hotspot on a iPhone for your Internet data connection. The video displays properly; and it is very easy to setup. The problem is with sound...you have none. I have 40 yrs in the tech industry; and I have to say that Google tech support did a stellar job working with me for over an hour trying multiple work-arounds; but to no avail. I think that this is a great product if you have a fixed data connection. And if someone could figure out how to get the sound to work with personal hotspots, I would give it 5 big stars.", "verified": true, "helpfulness": "0/0", "author": "Donald H."}, {"rating": 1.0, "review": "Great in concept, horrible in actuality! It worked for about a month and then the problems started. This product is designed to work through your smart phones, tablets, lap tops, ext... These are your controls.  No remotes are sold with this.  Connection between Chromecast  and controls ALWAYS drops off and they can't see each other. I have found sites where coustomers have posted questions to try to get help for three months and not one person has been helped! DO NOT BUY THIS, until they have fixed this issue.  It is now a very expensive toy for my grandchildren. A complete waste of my hard earned money!!!!", "verified": true, "helpfulness": "0/0", "author": "Hotgrammyof10"}, {"rating": 5.0, "review": "This is a great product.  Easy to install and easy to use with my iPad and iPhone great streaming video and audio.", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "It's amazing", "verified": true, "helpfulness": "0/0", "author": "Gustavo V."}]