[{"rating": 5.0, "review": "I was surprised how this worked. I have a Android RAZR so it worked great using my phone. The downside is I had use a USB extendion cord to power it my TV does not have a USB and my outlet was far away. I mainly use Netflix and YouTube so I can not rate the other services available.", "verified": true, "helpfulness": "1/1", "author": "Shadow \"Shad\""}, {"rating": 1.0, "review": "If you want my advice, just take the cost of this device, and throw the $35. out the window the next time a Windstorm is coming! I mean that, the only practical use for this Device, is for someone wanting to shoot a signal by way of cell phn.  I made the mistake of listening to news people hype this device, and I can assure anyone this is only for a very select few individuals. I actually bought this thinking I could send the signal to another tv in the home?  This is the most overhyped device I've ever came in contact with. Not overhyped by the People at Amazon, but others in the Media.  I have a Brother-in-law, an Electrical Engineer, that played with this for a few hours, and as I said to him in the beginning, it won't do anything at my house, but if you can use it, it's yours! His reply no thanks, this device is only good for a specific, number of limited users. Or to be more blunt, he could find no practical use for it! Save your money, unless you have a Vast Knowledge of Electronics, definitely not a practical device! I'm still looking for someone who can use it? When I do, I will gladly give it to them, just wish I could send it back!", "verified": true, "helpfulness": "1/3", "author": "Mitch Pelley"}, {"rating": 5.0, "review": "I got a great black Friday deal on the Chromecast from Amazon and it came with $6 Google Play credit.  Set up was very easy, just plug and play, add wifi password, and essentially you are good to go.This was purchased primarily to do what Roku can't, stream Google Play Videos and YouTube, but I was pleased to learn that I can also cast CBS episodes from the Chrome Browser.  Thus far, I have casted from my phone, my wife's phone, and a laptop with no problems.I view this as a must have for cable cutters like myself.  With the added capability of streaming Google Play videos and YouTube combined with Netflix and Amazon Prime from my Roku, I will be able to shop around for best deals on movies and TV episode seasons.  With the ability to take advantage of streaming Play Store movies and episodes, the $29.99 I spent on this should pay itself off rather quickly.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"gmj\""}, {"rating": 5.0, "review": "would love it to have more apps or apps unique to this device (since I can get hulu, pandora and netflix on basically every device). but i certainly love the ability to stream web browser to the big screen. best price and simpler than competing devices", "verified": true, "helpfulness": "0/1", "author": "k b \"kaneb80\""}, {"rating": 5.0, "review": "I wanted a way to easily watch Google Play Movies On my television. Roku wouldn't do it. The setup couldn't be easier. Plug the device into the TV. Install the app on your phone. Open the app and follow the instructions. It's great for watching YouTube videos and Netflix as well. I highly recommend this. It does require a wifi connection.", "verified": true, "helpfulness": "0/0", "author": "sjcabdriver"}, {"rating": 3.0, "review": "Setup is easy and device is small and neat but its extremly limited in terms of apps which can be displayed on your TV.", "verified": true, "helpfulness": "0/0", "author": "elid"}, {"rating": 5.0, "review": "I love this product. Makes my life easy. I can quickly search youtube video and send it to my tv. My kids love it too. so easy to use my 4 year old son can send his netflix movies to tv with no help. No need buy expensive smart tv or smart blu ray player.", "verified": true, "helpfulness": "0/0", "author": "Victor Etilo"}, {"rating": 5.0, "review": "excelente producto", "verified": true, "helpfulness": "0/0", "author": "Alejandro Mujica"}, {"rating": 5.0, "review": "Love it, no latency issues during streaming from my phone (Galaxy S3), quality is good enough that I don't see any pixilation issues.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "WOW!!! So happy I got this and been telling everyone to buy one ever since! So easy to setup and such a great price! Even with my slow internet I still get a clear picture and minimum buffering.", "verified": true, "helpfulness": "0/0", "author": "Bow Shot"}]