[{"rating": 5.0, "review": "Terrific product at a very nice price. Streaming from laptop works better than via Apple TV (smoother, less stutter and jerkiness) and once the streaming starts, your computer is \"freed up\" to do other things.", "verified": true, "helpfulness": "0/0", "author": "SY \"SY\""}, {"rating": 5.0, "review": "This is the perfect streaming player for inexpensive tv/video watching.  It is pretty much plug and play, so setup is super easy.  The price cannot be beat.", "verified": true, "helpfulness": "0/0", "author": "Char Lunsford \"Charla\""}, {"rating": 1.0, "review": "the amazon fire stick is much better product.", "verified": true, "helpfulness": "0/0", "author": "FuzzyLogicRiceCooker"}, {"rating": 5.0, "review": "love it!", "verified": true, "helpfulness": "0/0", "author": "V. Mil"}, {"rating": 5.0, "review": "I love my Chromecast, both of them. There are so many apps that allow you to take advantage of this device. This will be on every HDTV that I buy.", "verified": true, "helpfulness": "0/0", "author": "showtime775"}, {"rating": 5.0, "review": "It is wonderful. I am able to connect with my phone or computer. We have more than one which makes watching TV better", "verified": true, "helpfulness": "0/0", "author": "Sandy Tucker"}, {"rating": 5.0, "review": "Works great.  Easy set-up and use.  I love it.", "verified": true, "helpfulness": "0/0", "author": "Brent"}, {"rating": 3.0, "review": "I am happy because I am no longer at the mercy of the cable company. However when the device gets hot it stops receiving the signal from the casting device. If I am watching a program and Chromecast stops working in the middle of the program, I have to unplug it until it cools off. This takes 5 to 10 minutes, and it is a hassle to do, when I am in the middle watching television. It also could have come with better set-up instructions.Laura W.", "verified": true, "helpfulness": "0/0", "author": "Laura Williams"}, {"rating": 3.0, "review": "Plugged it in to the TV to show computer on TV, it works, you must have google chrome on your computer and enable it to cast. Clunky interface. Haven't used it since I set it up. Doesn't show computer screen on TV, it only shows what is inside the Chrome window, um hello Google my cheap Vizio 48\" shows web pages without anything plugged into it, what else do you have? Also have an Apple TV and Digital camera hook up, Apple TV smokes this thing with both hands tied behind its back, I can flip my phone onto the tv by pushing one button on the remote to change channels, maybe the next generation will be better?", "verified": true, "helpfulness": "0/0", "author": "B. Scholten \"emonkey\""}, {"rating": 2.0, "review": "Piece of Boo Boo, doesn't work and never worked.", "verified": true, "helpfulness": "0/0", "author": "monique campbell"}]