[{"rating": 5.0, "review": "I like it", "verified": true, "helpfulness": "0/1", "author": "HNikesch"}, {"rating": 2.0, "review": "Bought it in March, it stopped working in July (last week). Amazon service just sent me a power cord to replace, but the power cord does not fix the issue. I am without TV and there is no option to get this box fixed until I complete the return on my original power cord? Not very impressed here with the customer service. I regret not getting cable now, it's so boring at my house.", "verified": true, "helpfulness": "0/2", "author": "Jord K"}, {"rating": 1.0, "review": "I found very few programs included or free", "verified": true, "helpfulness": "0/2", "author": "Michael Pearlman \"Michael\""}, {"rating": 3.0, "review": "Amazon Fire TV is nice.", "verified": true, "helpfulness": "0/1", "author": "Kevin T. Mickelson"}, {"rating": 5.0, "review": "VERY NICE PRODUCT. WORKS EXACTLY AS HOPED IT WOULD.  NICE, SIMPLE TO OPERATE REMOTE, ONE TOUCH CONTROLS EVERYTHING. VERY EASY SET UP. HARDEST PART WAS REMEMBERING THE PASSWORD FROM MY ROUTER! :)", "verified": true, "helpfulness": "0/1", "author": "Jerry EHT"}, {"rating": 5.0, "review": "It's really great. It turns your regular tv into almost a smart tv. With this little device and an indoor antennae, there's no need to look to cable for tv service again", "verified": true, "helpfulness": "0/0", "author": "Gil Miracle"}, {"rating": 5.0, "review": "It's been a while since we were considering getting rid of cable, and finally, we did it and purchased the Amazon Fire TV.The only experience we had with streaming TV boxes was the old Roku Stick, which wasn't bad at all, but this technology has advance very rapidly ever since, and customer behavior has followed the same pattern. The reason we did not get the Roku 3 and purchase the Amazon instead is because we have Amazon Prime, Amazon Cloud Drive (with unlimited pictures and videos for an extra fee), and Amazon music (I also pay an extra fee yearly so all my music is on the Amazon cloud, about 40,000 tracks) so we are already in this -ecosystem- and figured the best would be to stick with Amazon. Clearly, in this case, I see the Fire TV as a winner, although it is also true -as many other reviewers have pointed out- that the box is very biased in looking and presenting content to you, so you stick to their products. Regardless of this, so far we are very happy with this purchase, and can't give it less than 5 stars. The main reason we wanted this box is to watch TV Shows, and with the addition of Netflix and Hulu, I'd say you are 80% covered. The only 20% comes with a subscription to Showtime, which you can get for an additional $9 or so with your Hulu subscription, and then of course HBO Now, which is NOT available yet for Amazon Fire TV. When I visited the HBO site in July, it said it would be available for Fire TV in July 2015. On 7/31/15 it changed into 'coming soon' ... Not much worried about it, because I am sure it will be available sooner than later, but if you absolutely must watch HBO, you can always sign up online and watch it on your computer. If you have an iPhone or iPad you can also sign via those devices. Once you sign up, you can watch it everywhere as long as the device is compatible (not Fire TV as today 8/4/15). I was considering getting Sling, but I've read many mixed reviews that complain about their poor streaming quality, so I decided not to get it yet. And honestly, I don't care about TV much, anyway ... I am happy whenever I can watch some TV shows and/or movies, so I am covered with Amazon Prime, Netflix and Hulu.See the attached pictures of my unboxing of the Fire TV.I have no comments on the technology because I am not a tech guru and I am not going to pretend I am by repeating the stereotypes you read here and there. I am just a regular person, and the box works just fine. I have the Amazon Echo and the remote is the same, except the Fire TV has more buttons. But same size, design, etc.", "verified": true, "helpfulness": "5/6", "author": "Benjamin"}, {"rating": 5.0, "review": "I like this a lot better than buying movies off Directtv", "verified": true, "helpfulness": "0/1", "author": "Andrea K. Baldus"}, {"rating": 4.0, "review": "I bought the fire TV as a gift but right away discovered that even if you add additional memory, you still can't download and save movies.  I would have also like to be able to download books so if I had audio with a children's book, I could use it on my TV so if there are a number of kids they aren't try to gather around the small fire to see the story.  I really was expecting more of Fire that was connected to my TV.", "verified": true, "helpfulness": "0/1", "author": "robert bailey"}, {"rating": 5.0, "review": "My husband really enjoys this.", "verified": true, "helpfulness": "0/1", "author": "anne leilani"}]