[{"rating": 4.0, "review": "We bought one of these awhile back to test it out and see how it compared to our Roku. We liked how it worked but really wanted more functionality than Netflix. I did some research and found that I can have my Plex Media server serve as an alternate casting device as well since it is from a browser. This made it better and we were able to watch many more things that we were before with just Netflix. Now they have added Hulu+ making this device all around great. It still has some kinks to work out and I would like to see support for Amazon as well but for $35 it's the best bang for the buck. We now have them on every TV in the house, canceled our AT&T; Uverse and sold our Roku. $105 for 3 Chromecasts + ~$16 a month for hulu/netflix is a killer deal and I'm not sure how Cable/Satelite TV will stay in business!!I would give it 4.5 stars if I could, it is not deserving of 5 stars yet as it needs more functionality but it is very solid for $35.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great toy, use it all the timeSometimes Netflix seems to count Chromecast and the host device as two instances. I only consider it one.....", "verified": true, "helpfulness": "0/0", "author": "D. Clifton"}, {"rating": 4.0, "review": "Using chrome you can easily pass over your tv just about anything. The only thing is that is a bit slow. i have Wireless N at home, maybe using a new technology, might be faster and my concern would be none. But asides that, its great. beats having a Apple TV that costs 3 times more. Btw, you can stream anything in your desktop (beta)", "verified": true, "helpfulness": "0/0", "author": "Hector Corominas"}, {"rating": 5.0, "review": "Easy to install, easy to use, cheap... Just wish you could use more than Netflix or YouTube with it right now.", "verified": true, "helpfulness": "0/0", "author": "Michael C. Phillips"}, {"rating": 5.0, "review": "Worth more than any other. It works with every Device in the house. Just waiting for Google to ad more apps.", "verified": true, "helpfulness": "0/0", "author": "Steve Austin"}, {"rating": 4.0, "review": "Great way to watch online content on y our tv. I wish you could broadcast more than you can at present (outside of Crhome), but maybe that will come.", "verified": true, "helpfulness": "0/0", "author": "Eve"}, {"rating": 5.0, "review": "Just as simple and easy as promised. Operates better than videos on a desktop - no buffering or glitches. Hope they are able to partner with more content providers soon. Got it only to watch \"house of cards\" which was well worth the very small cost of the unit and Netflicks subscription.  But now enjoying movies, documentaries and YouTube. It would be great for music like Pandora.", "verified": true, "helpfulness": "0/0", "author": "Larry Glidewell"}, {"rating": 3.0, "review": "Performs well on my 52 inch HDMI TV.  You must use Google Chrome as your browser for it to work.  Disappointed when I rented an Amazon movie that wouldn't 'cast'.  The frame showed on the screen, but not the video or sound.Also, I would like to display my personal files like photos and MP4 videos.  You would have to move these to the cloud first, and then watch them.Clever small package,  There is some minor delay when 'casting' between the computer screen and the TV.  Also, all activity ( clicking ) must be done on the computer, as cursor does not show on screen.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it! We use it almost everyday :) easy to install and very practical! Would definitely recommend having one to everyone.", "verified": true, "helpfulness": "0/0", "author": "Lukas'mommy17"}, {"rating": 4.0, "review": "I thought I would be able to stream anything from the computer to the TV but this is NOT the case.  I don't use it very much.", "verified": true, "helpfulness": "0/0", "author": "Veronica Deevers \"Wildlife Artist\""}]