[{"rating": 5.0, "review": "It arrived on time, great packaging, easy setup, quickly updated itself, and has really good video quality. Previously I was watching Netflix on my (not particularly smart) Panasonic TV with a wireless dongle connected to my wifi. Well that connecting would always have to be reestablished, buffered a lot, and was often of poor video quality.The Chromecast just works as advertised.", "verified": true, "helpfulness": "0/0", "author": "bsoten"}, {"rating": 4.0, "review": "Lucky for me I do have a Samsung Galaxy S4 and can cast my screen to my TV.  If they had support for more mobile phones I would have given it a 5 Star.  Also, casting my tablet screen would be nice.", "verified": true, "helpfulness": "0/0", "author": "Edward M Greshko"}, {"rating": 5.0, "review": "Just a little piece of very useful hardware. This solved almost all my streaming needs at home. Wife can put cartoons in her mobile and stream them to our baby to watch.Google has still to open the SDK more so other software can make use of the device, but for the price and quality I really recommend it.", "verified": true, "helpfulness": "0/0", "author": "will824"}, {"rating": 5.0, "review": "If you own an Android...you need this device.  If you use google chrome...you need this device.  If you breathe Oxygen...you need this device.  Works great with my Galaxy Tab S 8.4 and my Lenovo Ideapad Yoga 2.  Love watching YouTube on the big screen and renting movies from google Play.", "verified": true, "helpfulness": "0/0", "author": "Oz W \"Walkman\""}, {"rating": 2.0, "review": "It barely functions.  Hulu works fine on the computer but is slow, choppy and pixelated on chromecast.", "verified": true, "helpfulness": "0/0", "author": "Dane Owen"}, {"rating": 5.0, "review": "works like a charm", "verified": true, "helpfulness": "0/0", "author": "D. Davis"}, {"rating": 1.0, "review": "Not as advertised.  Terrible. Read the fine print.", "verified": true, "helpfulness": "0/2", "author": "Sherry L."}, {"rating": 5.0, "review": "very good, it's work perfect", "verified": true, "helpfulness": "0/0", "author": "Azhar"}, {"rating": 5.0, "review": "No problems here.", "verified": true, "helpfulness": "0/0", "author": "A Customer"}, {"rating": 1.0, "review": "I got caught in the hype. Know that this device only plays videos from within the YouTube application from your Android device or iOS. It has no functionality beyond that. Usability is low. It frankly is quite useless to me.", "verified": true, "helpfulness": "0/1", "author": "growingneeds"}]