[{"rating": 5.0, "review": "Really happy with this thing.  There's a bit of a lag even though I'm on > 25mb broadband but not really a problem.  I'd rather cut all those laptop cord connections to my TV.", "verified": true, "helpfulness": "0/0", "author": "BARRY G."}, {"rating": 5.0, "review": "After reading so much about this, jumping into getting one was the best decision.Quick setup and plug and play. This product does more than it asvertises it can,I'll leave it to you to decide, since it has so much potential I haven't even tested all thatI wanted yet.Love it, and will never use my devices to stream anything but in my tv.", "verified": true, "helpfulness": "0/0", "author": "Jose Manuel Perez Bolivar"}, {"rating": 5.0, "review": "Great for bedroom TV - Fun to project!", "verified": true, "helpfulness": "0/0", "author": "Eric L Carpenter"}, {"rating": 5.0, "review": "I love this device. I can watch movies from my tablet or phone directly to my TV.", "verified": true, "helpfulness": "1/1", "author": "Grandcatdaddy"}, {"rating": 5.0, "review": "Awesome!!!", "verified": true, "helpfulness": "0/0", "author": "Richard C Robles"}, {"rating": 5.0, "review": "I love my chromecast. I hardly ever watch regular tv anymore,  I just stream from YouTube,  Hulu and Netflix.", "verified": true, "helpfulness": "1/1", "author": "Tyler Pease"}, {"rating": 5.0, "review": "I use chromecast everywhere I can now, and have even considered upgrading my other TV so I can use one on it too. Highly recommended.", "verified": true, "helpfulness": "1/1", "author": "M. Weiss"}, {"rating": 5.0, "review": "Works like a charm. We have two of them, easy to set up and we have had no issues with them at all.", "verified": true, "helpfulness": "1/1", "author": "Chris"}, {"rating": 3.0, "review": "It does what it's suppose to do, easy installation, everything was easy.  The product description failed to mentioned that it contained a USB Power cable so I ended up ordering one separately. Not a big expense but it would have been a nice to know.", "verified": true, "helpfulness": "0/0", "author": "john n"}, {"rating": 5.0, "review": "Very Good!", "verified": true, "helpfulness": "0/0", "author": "Dinesh Bissoon"}]