[{"rating": 5.0, "review": "I have a smart TV right now!", "verified": true, "helpfulness": "0/0", "author": "Rafael B."}, {"rating": 3.0, "review": "I have not purchased this yet but for those having trouble with your router try to check to see if your port is open or the router is not firewall blocking it.  YouTube can show how to do things like this. I have a networking background so for me it's difficult to explain.  Just a friendly suggestion is all", "verified": false, "helpfulness": "0/0", "author": "menace"}, {"rating": 5.0, "review": "This is the best media gadget I have ever owned. I have a Roku, Apple TV, Fire TV, and some ugly HTPC's. This is so simple. I use plex, amazon, and youtube and I love it. I can't say anything bad about it.", "verified": true, "helpfulness": "0/0", "author": "Joseph W. Manning \"I buy stuff on amazon everyday thank you PRIME\""}, {"rating": 3.0, "review": "It just stream for internet application, no mobile media (videos or images), but it works perfectly and very fast.", "verified": true, "helpfulness": "0/0", "author": "Jeanmanoel Bejarano"}, {"rating": 1.0, "review": "Great idea and started out working awesome. Tanked after 6 months. It does NOT play well with Apple products. I have two Iphones and an Ipad, all of them worked great at first. What you stream is limited(Netrflix, HBOGo, Pandora, YouTube) but not bad for the price. I really loved streaming pandora, but after a few months I was having trouble connecting to it. One of my apple products would see while the others wouldn't. Never consistent in which one it would be, but at least one of them worked. Then finally it stopped working at all, wouldn't stream, iphone said it was streaming but chromecast would never get going. Then finally it tanked and nothing could see it anymore. Also have one at work that no one can get connected to, andriod or ios. Was a great idea that they didn't test long enough.", "verified": true, "helpfulness": "0/0", "author": "speedread1"}, {"rating": 5.0, "review": "I can't even begin to explain how handy this device is. I have been using it since it came out, and I absolutely love it! I introduced my non-tech-savvy girlfriend to it, and she loves it! Easy to set up, easy to use, and the best thing is how affordable it is!", "verified": true, "helpfulness": "0/0", "author": "Flak"}, {"rating": 2.0, "review": "Very limited to what you can do with it: kinda pointless really.I played with it all of one day, that was the day I set it up.Since purchase I have used it for a total of 3 times, YES only 3 times.Once was for setup and the other two times was just to show a friend a Youtube video, which I could have done on my Apple TV.if it was't so cheap I would of been upset with this purchase,Does anyone want to buy it from me? ? ?", "verified": true, "helpfulness": "0/0", "author": "Zay"}, {"rating": 1.0, "review": "Don't waste your time!  Never could get the thing to sync with our iPad and Vizio tv! Slowed the Internet connection way down!", "verified": true, "helpfulness": "0/2", "author": "kb1"}, {"rating": 5.0, "review": "This is good, and getting better as more apps are released that support it. We occasionally have family chromecast night where we take turns sharing YouTube videos from our mobile devices over the chromecast. Beats tv a lot of times. Now with a new app I can stream my music to it so when playing a game at the kitchen table, I can control from my phone what music is playing through my system.", "verified": false, "helpfulness": "0/0", "author": "M. A. Reif \"FoFa\""}, {"rating": 4.0, "review": "It's great. Get one.", "verified": true, "helpfulness": "0/0", "author": "Jana Dexter"}]