[{"rating": 4.0, "review": "We love our Amazon FIRETV! Easy to set up. You really have to buy Prime to make it work! Which is just over 8$ a month. Lots of entertainment, lots more if you want to spend money!!", "verified": true, "helpfulness": "0/0", "author": "KrisAF"}, {"rating": 5.0, "review": "Very easy set-up and works great!", "verified": true, "helpfulness": "0/0", "author": "Dino DiLuigi"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "john mcgee"}, {"rating": 2.0, "review": "The voice control defaults to only Amazon selections even when one is in an active window for netflix or other applications.", "verified": true, "helpfulness": "0/2", "author": "Bill Patz"}, {"rating": 5.0, "review": "Great product if you are a prime member.", "verified": true, "helpfulness": "0/0", "author": "A. Young"}, {"rating": 2.0, "review": "Frequently loses username and password settings for Netflix. Have to reenter which is inconvenient and time consuming.", "verified": true, "helpfulness": "1/3", "author": "jfritts"}, {"rating": 5.0, "review": "Very impressed so far with this device. I realize it's not the same as a Chromecast but it's hands down a much more reliable and consistent tv experience.I also appreciate the kid-related offerings on it, specifically Prime tv shows and movies. Backyardigans and Thomas are two shows we watch on occasion and both stream very well so far.", "verified": true, "helpfulness": "0/0", "author": "Bart"}, {"rating": 5.0, "review": "While I have nothing to compare it to, I am very satisfied with it. It is small and unobtrusive. The remote , while small and very simple works like a charm except when rewinding or  fast forwarding during movies. The voice function search feature is terrific.I also own a Kindle Fire HDX of which I love and works nicely with the Fire TV.  I'm currently enjoying prime for free but will purchase the full subscription when able to renew.  If you love movies and music Amazon Prime is a must and worth every penny.", "verified": true, "helpfulness": "0/0", "author": "mark francis"}, {"rating": 5.0, "review": "Works just like the full sized Fire TV box, except WiFi only (no Ethernet jack), no RCA and fiber audio output (HDMI only), and no voice search on the remote (but I think you can buy a remote with voice search).  I gave it five stars because it works great considering the price.  However, I sometimes have to reconnect to the network when I first start using it if it's been sitting awhile, even though Wifi signal is strong and no issues with other devices.  My full sized Fire TV box that I've had for a year is connected via Ethernet cable, and has no issues.  Hopefully this slight quirk can be corrected in firmware soon.  All things considered (including price), I'm quite happy with it.", "verified": true, "helpfulness": "0/0", "author": "SnatcherGeek \"snatchergeek\""}, {"rating": 5.0, "review": "Amazing device!! We love it!!", "verified": true, "helpfulness": "0/0", "author": "Lesley Snow"}]