[{"rating": 5.0, "review": "This is so great and easy to use.  I've showed it off to all who come to the house or when we are traveling. The connection and set up is a snap for anyone.  As I have been a long time Prime customer I don't seem to have the problem mentioned by others on separating the free from the charged programs.  Great Job Amazon !!!", "verified": true, "helpfulness": "1/1", "author": "Linndell Scarbrough"}, {"rating": 5.0, "review": "My order shipped quickly and was at my door before I knew it.  The packaging was frustration free as promised and the Fire TV is sleek and cool looking.  I didn't think I was going to be impressed on the look and feel of this product but I was.I am not the most tech savvy so I was super surprised how easy this was to hook up to my TV and get started.  I also purchased the Amazon Basic High-Speed HDMI cable; totoaly worth it. I had the Fire TV hooked up and a movie playing within minutes, even my husband was so impressed that I was able to get this up and running so quickly!  It is also super easy to find what you want to watch. There is a cool tutorial that walks you through the whole set up.Totally reccomend for all TV and Movie junkies!", "verified": false, "helpfulness": "1/1", "author": "Ligure"}, {"rating": 4.0, "review": "Really liked it but, except I couldnt use my cable company for the HBO app was kinda disappointed", "verified": true, "helpfulness": "0/0", "author": "Angelle"}, {"rating": 5.0, "review": "Very very happy with this product, very easy set up. The Amazon offers everything I want and need it fits perfectly in my life", "verified": true, "helpfulness": "1/1", "author": "s. thatch's"}, {"rating": 5.0, "review": "This media box works great. The selection of titles available to PRIME users is plentiful. It came preconfigured for my Prime account so plug and play. Get one!", "verified": true, "helpfulness": "1/1", "author": "John Judy"}, {"rating": 1.0, "review": "poor reception", "verified": true, "helpfulness": "2/12", "author": "JOHN T."}, {"rating": 3.0, "review": "I'm a netflix user and the Netflix app tends to lag or buffer much more through Fire TV than if I stream from mu iPad. I hope Amazon addresses this soon because it is convenient to have one device plugged into my TV. As it stands now I get frustrated with the Fire and unplug it and use my iPad without issue.", "verified": true, "helpfulness": "2/3", "author": "Marky Mark"}, {"rating": 5.0, "review": "Impresive, thebest system i have used, much better than apple tv , Google chrome or rokus", "verified": true, "helpfulness": "1/2", "author": "G. A. MENDEZ \"GAMF\""}, {"rating": 3.0, "review": "Excellent device. Need to improve the filter on how programs are shown.  Prefer the app home page. If you improve this then you get 4 stars.  5 stars is a level of perfection that I only give to the exceptional.", "verified": true, "helpfulness": "0/0", "author": "Rishi Pimentel"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "1/1", "author": "kate"}]