[{"rating": 1.0, "review": "When I first learned of this gadget, I couldn't believe how cheap it is. But I soon found out that you get what you pay for.Compared to Roku and Apple TV, the selection of channels is very limiting. There's much more quality content from those two TV boxes. Plus, Chromecast doesn't have a remote control, so you have to have a tablet or smartphone handy, with the app open. Honestly, a remote is much more convenient for a family to use. The Chromecast seems much more glitchy too.Sure, this thing is cheap, but for about just $15 more you can get a full-featured Roku box with a nice remote. Roku's remote and on-screen menus give it a more polished, traditional TV experience. Or for a few more bucks, the Apple TV has a even more premium experience. Apple TV has special features that work with iPads and iPhones, like AirPlay.", "verified": false, "helpfulness": "6/6", "author": "R L"}, {"rating": 5.0, "review": "Perfect in operation though content available in Australia is a bit limited, happy none the less. Tubule movies are good as well as catch up tv shows", "verified": true, "helpfulness": "0/0", "author": "Greg Jones"}, {"rating": 5.0, "review": "Very easy to use, work fine on all smart phone in house, reliably and very responsive ,recommended for youtube lovers", "verified": true, "helpfulness": "0/1", "author": "ali dado"}, {"rating": 4.0, "review": "Easy to setup. Easy to play netflix and pandora. Downside is the few number of apps. But you can stream anything from chrome browser on laptop which makes up for apps.", "verified": false, "helpfulness": "0/1", "author": "Diga Desi"}, {"rating": 3.0, "review": "Shouldn't be that hard to install, but they found a way to do so. Need a extra computer or device just to install. Next time I will just by a Smart T.V.", "verified": true, "helpfulness": "1/1", "author": "Tashia"}, {"rating": 4.0, "review": "The only reason I won't give it 5 stars is because I can't stream my amazon prime instant videos, but as soon as it does I will be ecstatic! Does exactly what it's supposed to, and beats buying a smart tv.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Compare to Apple TV very few useful apps, so far only Netflix, HBO GO, and You Tube.Casting Chrome browser tab is still in Beta phase, but has a lot of potential.", "verified": true, "helpfulness": "0/1", "author": "Paym"}, {"rating": 2.0, "review": "Doesn't work as well as we'd hoped. Frequent connectivity issues make viewing and use inconvenient. Sending it back and looking for a used Apple TV.", "verified": true, "helpfulness": "3/3", "author": "Kelly G \"kelsmiley\""}, {"rating": 4.0, "review": "Setup is pretty simple and easy. You do have to set it up with each device, which is to be expected. It is pretty restrictive on iOs devices, as far as what you can cast. However, if you know of one of those websites (not going to name them here), where you can stream movies for free, you are able to open a tab in Chrome and cast that to your TV...which was the reason I got the thing in the first place.I consistently run speed tests on my internet. I'm usually between 10-12 MBPS download and 2 MBPS upload, at these speeds I am able to cast in high quality, but not the \"extreme\" setting. For me, watching a free movie, 720p is fine for me. There are some times where it lagged a bit, but that is an issue more with my speed I think.My biggest complaint is that if you watch a 3 hour movie, Chromecast will undoubtedly, lose connection at least once. It is a beta device, and it isn't perfect. I notice there is about a 1-2 second lag from anything you do on the computer, till it is casted to you TV, but considering the data transfer process that is going on wirelessly, I think this is a fair compromise for now...second or third generations I would expect to be much better at this.So you are asking yourself, \"should I buy this\"?...at $30 (what I paid for it at Best Buy), it's an easy yes. Just do not expect perfection out of it just yet.", "verified": false, "helpfulness": "0/1", "author": "Saucy"}, {"rating": 3.0, "review": "Needs work…needs more available options but assume they will come with time.  If had to do it over would probably get apple TV or roku.", "verified": true, "helpfulness": "0/2", "author": "Scott M Scheidel"}]