[{"rating": 5.0, "review": "Turn your dumb TV in to a smart TV.  The only complaint I have is that the Youtube control gets disconnected, resulting in the Chromecast erasing the queue.", "verified": true, "helpfulness": "0/0", "author": "Justin A. Parr \"jparr\""}, {"rating": 4.0, "review": "I really like it, works well allows me to watch youtube, hulu, and such on my tv. You can't actually stream from the chrome app on iPhone, which is one main reason I bought it.", "verified": true, "helpfulness": "0/0", "author": "Aaron J. Tricoche"}, {"rating": 3.0, "review": "Not a lot of apps supported, yet. It was a bit tricky setting up to my router, I did a reset of my router and it was not difficult after that. Note, I have not had problems hooking up anything else in the past, i.e.: roku, wii, tablets, e t c. It is a little buggy,  have had to switch my wireless router off and back on a few times. I primarily use it for YouTube. It is fairly clear and worth every bit of $35.  Hopefully Google will run with it and make it able to cast/mirror your phone/tablet/laptop.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Cool as hell, sure not many apps on it yet, but its more convenience, someone text you a youtube link, throw it up on this, go over to someone's house who has a decent tv but for some reason does not have technology in their lives, plug it in, comes with a power adapter but can plug into a usb plug in any tv, so far at least, also has a pretty good future probably once more support is allowed by Google", "verified": true, "helpfulness": "0/0", "author": "J Johnson"}, {"rating": 5.0, "review": "If something can be viewed on Google Chrome on the computer; it can be viewed on the TV.... nuff said.", "verified": true, "helpfulness": "0/0", "author": "Neo \"eCoder\""}, {"rating": 5.0, "review": "So happy with our Chromecast purchase! Ours came with a short netflix subscription too, so we will get lots of use out of it.", "verified": false, "helpfulness": "0/0", "author": "Lovestargetmom"}, {"rating": 2.0, "review": "Arrived before time - AwesomeMy below observation is using my laptop with internet speed of 12mbpsYoutube - streaming well with qualityNeflix - streaming well with qualityWhen cast  tab or desktop(beta) with running video in browser the first frame/picture cast and then hangs without any video or audio. I am sure they will improve this in future.I am returning this and may buy again when cast tab & desktop without any issue.If you are looking for cast only youtube and netflix this is really very nice device.", "verified": true, "helpfulness": "0/0", "author": "Himanshu"}, {"rating": 3.0, "review": "ProsIt's inexpensiveSmall/compact & Easy to take on tripsCool for YouTubeCool for Netflix (if your traveling).  At home I have Roku in bedroom and family room has Netflix on TV and BluRay...so didn't really need it for that.Cool for pictures and videos (worked well with my iPad Gen 2, not as well with my iPhone 4)ConsThat's it.No other uses.Wish it could mirror my iPhone and iPad!  I'll probably end up buying an Apple TV.Overall if you watch YouTube and Netflix, it's a cheap alternative to The $100 alternatives out there.", "verified": true, "helpfulness": "0/0", "author": "B. Callahan \"BC\""}, {"rating": 5.0, "review": "A great device for streaming from the PC to the big screen, would recommend it to anyone who enjoys watching Videos online...", "verified": true, "helpfulness": "0/0", "author": "Christopher Mutuku Muange"}, {"rating": 4.0, "review": "I bought this so that I'd be able to watch Netflix on the living room television. Currently I use a Roku 2 XS in the bedroom and I found myself wanting to purchase another for the living room. Rather than coughing up another ~$60 - $80 for a 3rd generation Roku, I elected to try out the Chromecast - at $35, I thought surely I couldn't go wrong.It's easy enough to set up, no complaints there. The problem is that it's a pain in the ass to use. To use it with your computer, you actually have to go to Netflix, sign in, choose whatever you want to view, play it, then switch it over to the Chromecast. Episode ended? You have to get back on your computer (or phone), go back to the episode page, choose the next episode, click play, and change the stream over to Netflix AGAIN. Every time. I had no idea it was going to be so cumbersome to use.To use it on your phone, you have to first download the Chromecast app and pair the device. Then you have to download the Netflix app (if not already installed), and set it up for your Netflix account. Luckily, it is much less cumbersome in the app: you simply switch the video to the Chromecast in the Netflix app, browse until you find something to watch, and hit play. Episode done? Browse to the next one. If it weren't for the app, this thing would be sent back immediately.\"But you can do more than just watch Netflix on it!\"No, not really. At least, not right now. You can cast youtube videos if you want, I guess. I watched a few and realized that it's a huge pain in the ass. It's much faster to just watch youtube in your browser; you have to wait for the Chromecast to access the video with its built in app and then load said video. You then have to wait a bit before the video buffers to better quality so it doesn't look horrendous. Also on that note, most of the videos are pretty terrible quality, which is only exacerbated by my 52\" living room tv. Suffice it to say, I don't project using the youtube functionality ever again.\"But you can stream music to it!\"That is a factual statement, yes. Why would you stream music over a television, though? Stereo, headphones, and computer speakers all exist...\"Well, you can also cast Chrome browser tabs to it.\"If I was in a business environment and giving presentations, sure. But I'm sitting at home on my couch. Plus, I've been having some speed issues with Chrome lately and for some reason it continues to freeze in Blackboard connect when checking answers in online homework...resulting in any entered data being lost. But back on topic, any non-youtube video is going to be jumpy. I routinely watch NHL games in NHL Gamecenter Live on my laptop in full HD. Trying to stream these to the tv results in very jumpy video with no audio transferred. I wish there was an NHL Gamecenter app that worked like the youtube plugin, I'd get a ton more use out of this device.As it stands, I'm giving it 3 out of 5 stars because, well, it's just okay. I'm still deciding whether or not I want to return it and just spend the $15 more to get a basic Roku that will play netflix and stream gamecenter games.Update (11/7/2013): I've decided to keep it, and I'm adding a star. The Pandora app was just released (although I don't use it) and hopefully the sdk will be out soon so that more can come. What this device does, it does very well. There have been a few instances where I've played youtube tutorial videos on my television so I could do something on my laptop at the same time, so that's moderately useful. Hopefully soon full screen non-youtube videos can be broadcasted rather than having to just broadcast the whole tab with the video windowed, but that could be a flash thing.", "verified": true, "helpfulness": "2/3", "author": "hock3ydud3"}]