[{"rating": 5.0, "review": "After reading reviews and looking at the comparisons, I would really prefer Amazon Fire TV over my Roku. However, I need HBO go... Adding it anytime soon? It's the only thing holding me back.", "verified": false, "helpfulness": "2/5", "author": "Terrynce D. Adams"}, {"rating": 2.0, "review": "I have used a plethora of devices for years for streaming. My main sources for streaming are (in order of use): Vudu, Plex, Amazon Instant, XBMC, PlayOn and Netflix. Roku 3 is my primary go-to and I have no problems with it whatsoever. I decided to buy this when it went on special to tinker with it and and see what it could do.Pros:- Comes pre-installed with your Amazon account info. Amazon services just work out of the box.- Has a decent menu system.- Voice search is robust.- Support for Plex, Amazon Instant, and NetflixCons:- Woeful lack of premier streaming apps, most notably (for me):  -- No VUDU app.  -- No PlayOn app.  -- No XBMC app.- All of my apps in Amazon are not accessible in the apps gallery on the FireTV.- No way to prioritize/organize my apps. They just appear how they want to, I think based on usage.- While the voice search is cool, it just feels trendy. I prefer to scroll through my media.The thing I really didn't expect was a lack of PlayOn support, because Amazon has PlayOn in their app store.This doesn't make the device unusable, but it does keep it from replacing my Roku and will also make me not use it for now until it gets some further updates and support. It just can't do what I want it to do, even if I side load the apps.", "verified": true, "helpfulness": "1/6", "author": "Dead_Cow"}, {"rating": 1.0, "review": "Goog hardware, Bad cost of content", "verified": true, "helpfulness": "1/13", "author": "H Clark Pollard \"Geek\""}, {"rating": 3.0, "review": "I spent about an hour yesterday on the phone with Amazon help desk trying to get this to work on my Samsung Smart TV and my Bose surround sound system. Still no resolution and the issue has been elevated. I have another TV with a sound bar and have no issues, but I don't want the box on that TV. I gave it 3 stars for this reason. Now that I've had a chance to actually use it with my other TV I can say that the content is pretty decent. I'm a Prime member and all the usual programming is decent. I'm ready to cut the Direct TV and wanted to use this as well as an HD antenna to pick up local channels. It's a much cheaper option for the limited TV I watch. The only drawback is the limited access to sports like NFL and college football games and tennis. I've figured out a workaround for that though. Once Amazon figures out how to get this working with my other TV then I'll be ditching satellite and sticking with this option. It's really a simple device to use. That's why I'm surprised that Amazon can't figure out how to get this to work with my other TV. I also found the help manuals and videos to be less than helpful. They cover very basic issues and the troubleshooting section is really weak.", "verified": true, "helpfulness": "0/1", "author": "Kelly"}, {"rating": 3.0, "review": "Still learning the ropes on this unit.  The voice activation is great.  Thought there would be more free movies then there are.  To rent movies...Red Box is alot cheaper.", "verified": true, "helpfulness": "0/0", "author": "Steve Olayas"}, {"rating": 4.0, "review": "The Good: Very quick, very easy to set up and use, and very inconspicuous sitting next to the TV.The Bad: My only issue with Fire TV so far is using PLEX to stream photos, music and video to the TV from a computer.It works, but the PLEX program seems overly complicated to use. And there seems to be basic functions missing in PLEX such as shuffle all music, not just one artist or album.It could be me - though I feel I'm better than average with using media software - Amazon needs to step up and build in something more familiar to us Amazonians (is that a term?!) for the streaming from PC functions than PLEX.Otherwise - at $99 this is a heck of a unit. And with Prime included a sweet deal. Fix the PLEX thing and I'll resubmit a 5th star", "verified": true, "helpfulness": "0/0", "author": "Crow Hill Rebel"}, {"rating": 5.0, "review": "Awesome!  This was everything I needed instead of expensive cable TV which didn't give me what I wanted to watch anyway.  I totally loved this product.", "verified": true, "helpfulness": "0/0", "author": "DONNA KURTH"}, {"rating": 1.0, "review": "Never could get a signal that would stay connected. The Amazon guys were great at trying to get it to work, unfortunately they couldn't,  so was told it would be replaced. So far haven't heard back and feel they are going to let the 39 return run out. Makes a good base for my Roku 3 which works fine. Was really hoping that it would work but apparently made the mistake of getting a first generation with bugs included.  Do love having Amazon Prime.  Paid for itself in a month. Will renew it every year.", "verified": true, "helpfulness": "1/5", "author": "jgcnsf"}, {"rating": 5.0, "review": "Works great.  We take it on vacations that have Wi-Fi and can watch our shows we watch at home.  We upload photos and play them.  Turns any tv into a smart tv.", "verified": true, "helpfulness": "1/1", "author": "Julia \"Julia\""}, {"rating": 3.0, "review": "It's OK, the lack of HBOGo is pretty s***ty. Voice search should include more than just Amazon content. Its faster than other similar devices. I also wish that I could link to more than one amazon account. My wife has coins on her account and I don't know how to access them without deleting all of my existing pictures and account information to Netflix and Hulu and amazon streaming content.", "verified": true, "helpfulness": "1/7", "author": "f.no"}]