[{"rating": 3.0, "review": "This is adequate for the price. Sometimes it is a little glitchy when trying to control it with an ipad.  It would also be nice if there were more apps that would allow you to chromecast. For now it allows me to do netflix which keeps my son happy.", "verified": true, "helpfulness": "0/0", "author": "Steven Tree"}, {"rating": 3.0, "review": "Chromecast is Great for using YouTube and HBO GO, but still does not support chrome browser on iPad or my laptop.", "verified": true, "helpfulness": "0/0", "author": "William A. Mcmillan \"-Bill\""}, {"rating": 5.0, "review": "This is an absolute great device.  The installation is foolproof!  We've enjoyed this product so much, we bought a second one for our family room.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This item was received within the time frame advised and in good condition. The setting up process was straight forward without any major trouble. This device does what it is suppose to do very well. However, Netflix can only be cast from my phone & not my Galaxy Tablet. A time out error \"16003\" keep popping up!", "verified": true, "helpfulness": "0/0", "author": "Els Ford"}, {"rating": 5.0, "review": "There is a world out there on Netflix, You Tube and I know the services will expand.  TV REVOLUTION here I come.  Looking forward to saving money not paying for overpriced cable!", "verified": true, "helpfulness": "0/0", "author": "Amazonian \"Luckyvic\""}, {"rating": 2.0, "review": "I was expecting to be able to cast browser sessions, personal photos to large screen but apparently that feature was removed at some time after reading initial reviews.", "verified": true, "helpfulness": "0/0", "author": "Larry Shockley"}, {"rating": 4.0, "review": "I think there are a total of like 5 apps you can use.I own the HD tv play also, This is much nicer but lack of apps.Also runs really hot. You do need a power cord to run this, or usb.", "verified": true, "helpfulness": "0/0", "author": "L. Graves"}, {"rating": 4.0, "review": "The Chromecast is a nice little device.  Right now there are not enuf apps for it though. You can stream a Chrometab, but really u need Netflix or Amazon prime to get the most out of it i would think.  Make sure u have enuf bandwidth to stream media.", "verified": true, "helpfulness": "0/0", "author": "Scotty"}, {"rating": 5.0, "review": "Everything works as described, easy setup, no issues. Just sit back and enjoy the show(s). Oh, pricing, cheap for what you get in return... Go to your local theater, with the family... Paid.", "verified": true, "helpfulness": "0/0", "author": "Rick Collins"}, {"rating": 5.0, "review": "Created a presentation and it played on a loop without error. I was the talk of the trade show In visual representation.", "verified": true, "helpfulness": "0/0", "author": "Don Wallace \"Fabweb\""}]