[{"rating": 1.0, "review": "not what I expected. To costly. ed", "verified": true, "helpfulness": "1/3", "author": "ed"}, {"rating": 5.0, "review": "This machine is awesome. The voice recognition is unbelievable. The speed in which the movies load is way faster then my Sony blueray player. For the price this can't be beat.", "verified": true, "helpfulness": "0/0", "author": "jeffrey  carver"}, {"rating": 4.0, "review": "I was really hope for more shows and content as part of the PRIME membership. There are a lot of choices that are easy to search, but most have an added cost. The voice feature works great and that's the best way to search, using the arrow keys works but is slow to scroll through selections. On a PC there are more categories to help with the search. It was quick and easy to set up and use with HDMI TV. Worth the price ($75 at BestBuy).", "verified": true, "helpfulness": "0/0", "author": "Mark Antkowicz"}, {"rating": 5.0, "review": "easy to install, use and makes me wonder why i still have cable....", "verified": true, "helpfulness": "0/0", "author": "Andrew Morgan"}, {"rating": 2.0, "review": "It works great except with Hulu Plus. Hulu Plus freezes up constantly, which is a problem I did not have with Roku", "verified": true, "helpfulness": "0/1", "author": "JennaP"}, {"rating": 5.0, "review": "Very nice.  I like the ability to add Kodi XBMC and many other addons.  Great performance.  Excellent product.", "verified": true, "helpfulness": "0/0", "author": "Don Impala 66 \"Donald Lombard\""}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Sharon K. Coffman"}, {"rating": 4.0, "review": "I love it so far.  Wish Direct tv was one of the carriers that were included for the ESPN channel.", "verified": true, "helpfulness": "0/0", "author": "Adam Lawrence"}, {"rating": 4.0, "review": "Needs more apps, more tv shows and more prime movies. My in-laws have Hulu and they have a twctv app but you guys only offer that on the kindle for some reason! Very disappointed in that.", "verified": true, "helpfulness": "0/0", "author": "Giget"}, {"rating": 5.0, "review": "This is Great! I've had Amazon Prime for a couple of years and never thought about the videos. I got this as a present from my son. We hooked it up in minutes and started watching shows quickly. I know I've got a slow internet connection, but this thing works great! We cancelled all our movie channels on Dish. There is so much to watch and it's so easy!!! Even my wife enjoys all the new stuff we can watch. This thing is probably saving us $30-$40 per month!!!", "verified": true, "helpfulness": "0/0", "author": "Stilllookingforadeal"}]