[{"rating": 5.0, "review": "Great product. If you have a good wireless connection, streaming is consistent", "verified": true, "helpfulness": "0/0", "author": "Linda"}, {"rating": 1.0, "review": "Review posted with USB Power for Chromecast", "verified": true, "helpfulness": "0/1", "author": "Brenda Andrews"}, {"rating": 2.0, "review": "Returned it.  Need a smart phone with Google play on it.", "verified": true, "helpfulness": "0/1", "author": "April Richstein"}, {"rating": 4.0, "review": "Some of the things are really cool. Also it would be nice if the customer could get few days of free service for apps like hulu plus or hbo or others to enjoy movies and other stuff. Since all these diff apps are subscription based, so it would help the buyers if they get those services for free for some time like trial period or something.", "verified": true, "helpfulness": "0/0", "author": "suraj basnet"}, {"rating": 5.0, "review": "It works great I like everything about it", "verified": true, "helpfulness": "0/0", "author": "Redmann"}, {"rating": 5.0, "review": "I love it, wife not so much", "verified": true, "helpfulness": "0/0", "author": "milt sundeen"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jacob"}, {"rating": 5.0, "review": "Works with Samsung galaxy 4 tablet and galaxy 3 phone", "verified": true, "helpfulness": "0/0", "author": "Demetris Haynes"}, {"rating": 2.0, "review": "I purchased an Apple TV for more than the cost of the Chromecast and it has no limits discovered yet. Got the Chromecast and it is very limited. Really thought it would allow me to utilize more streaming movie sites and was very disappointed that it failed at that. It does allow you to watch Netflicks and YouTube, but I can't view Amazon prime movies and other movie streaming sites that I can with my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Lightfighter A 3/27"}, {"rating": 2.0, "review": "It worked fine when I first purchased it. But since around the second month of having purchased it, it hasnt been able to connect to the internet. Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "ginna"}]