[{"rating": 4.0, "review": "The device is great if you use Google products (movies from Google Play) and watch lots of YouTube. Otherwise it can be a disappointment.The Chromecast device streams wirelessly from your device to the TV. The downside is that if you have Amazon Prime the device is unusable unless you stream from a laptop or desktop. Using a laptop or desktop with Google Chrome browser you can stream anything to the TV but you lose clarity. I believe it streams at 720 vs full 1080.Chromecast I believe was designed to better monetize Google products. Example, to stream a movie, you can stream via Google Play vs. Amazon or other movie providers where it won't work on a mobile device. For me, I have a desktop with a TV a few feet away. I can \"cast\" via my Google browser. But if I go downstairs with my Xoom or iPad, then I'm stuck with YouTube or movies from Google Play, which I don't believe offer any freebies.Lastly, signal strength. The Roku has better signal strength. I tried both in a back bedroom with a weak WIFI signal. Chromecast cannot pick up the signal. The Roku can. As an FYI, the Chromecast works as follows --- when you click on a URL in say YouTube, Chromecast is sending the URL to your router and receiving the signal, thus the 1080 playback and better signal. When you click on a URL using the browser and a desktop then the call is made to the router but the video is streamed from desktop to TV, thus 720 playback.I understand why Google created this. I don't blame them. Just understand the limitations. It would be easy for this device to \"cast\" any URL but that defeats Google's purpose of monetizing their assets. Hopefully someone can come along and provide a low cost device that can stream content wirelessly from the Net.", "verified": true, "helpfulness": "0/0", "author": "Charlotte"}, {"rating": 4.0, "review": "I have two Apple TV devices and they are now unplugged.  These things are plugged into my TV's HDMI and USB ports(for power).  Even my original Macbook Air that doesn't work with Apple TV's Airplay, works with Chromecast.  I'm not saying it's perfect, yet.  Support is limited and for the most part requires that you are in a Chrome Browser if you are using a PC, and mobile applications are all updated to support it yet but it is getting better.  I hope they allow this to extend your desktop or duplicate your desktop soon as that's the only reason I'm not giving it 5 stars and I expect they will if they haven't already.  Oh and did i mention it's only $35!", "verified": true, "helpfulness": "0/0", "author": "Hammerton"}, {"rating": 4.0, "review": "The set up process took several tries to get Chromecast to communicate with my wireless router, but I did finally did get it to work.  I love how it integrates with Netflix and YouTube, but I wish it did more.  I'd like it to project other apps from my smartphone as well.  For the money, it's still a great product.  Looking forward to more functionality by Google in the future.", "verified": true, "helpfulness": "0/0", "author": "F. Fazio \"tech book junkie\""}, {"rating": 3.0, "review": "Based on reviews on various websites- this was supposed to stream anything opened in a chrome browser to TV, which is not happening at all!Apparently google has blocked this feature since late august!I am disappointed as I am again restricted to Youtube and netflix...which anyway are available directly on my smart TV! I will still keep it only because it's cheap and I am hoping goggle eventually will come up with something cool.", "verified": true, "helpfulness": "0/0", "author": "chanakya"}, {"rating": 5.0, "review": "I used to watch Netflix on a larger screen from time to time. But now I watch it on the larger TV screen ALL the time. No more hooking my laptop to the TV, setting up screen viewing mode and keeping my laptop plugged into an outlet while streaming. I don't quite understand how Chromecast does it, but I can pull up Netflix on my phone for hours and it doesn't effect the battery life. Fabulous! And I have a nifty remote control in my hand (my phone). Keep in mind, it's a remote control I can use to text and browse the web while I adjust the volume and pause whatever I'm watching. Chromecast is simple, priced at an affordable $35 and works like magic. I can't wait to see what Google does next with this line of technology.", "verified": true, "helpfulness": "0/0", "author": "purrr chase"}, {"rating": 1.0, "review": "Won't work with 1st gen Ipad, or windows XP. Barely works with my android smartphone. The four available apps are not anything I use. No amazon prime. No internet access.Wasted my money.", "verified": true, "helpfulness": "2/4", "author": "Allen Simpson"}, {"rating": 4.0, "review": "Installation was a breeze & the unit works great.NOTE:- casting from the Chrome browser is not possible from a phone (any phone) at present. Only from a laptop, tablet, etc.- casting from the Chrome browser (on a laptop) seems noticeably choppier, pixelated & out of sync, though this might be due to WiFi issues.- casting from Apps designed for use with Chromecast (Netflix/Youtube) is beautiful -- just like normal TV.", "verified": true, "helpfulness": "0/0", "author": "Ben Cacchione"}, {"rating": 3.0, "review": "Haven't spent much time with this yet, but out of the box it didn't work.  And then sent me off to an equally simplistic website with the same instructions.  I guess I'll have to really sort through this.", "verified": true, "helpfulness": "0/0", "author": "Thought you should know \"you should know\""}, {"rating": 5.0, "review": "Impressed with how easy this product is to setup and use. Not a lot of features compared to some more expensive devices, but it allows me to flawlessly stream HD content from my laptop/phone/tablet to my TV. Exactly what I wanted!", "verified": true, "helpfulness": "0/0", "author": "cr3ature"}, {"rating": 5.0, "review": "I like the fact that I can navigate and select both Netflix and YouTube video on any of my devices -- phone and tablet.  I can hardly wait for more applications to support chromecasting.", "verified": true, "helpfulness": "0/0", "author": "joeyd44"}]