[{"rating": 5.0, "review": "There are a lot of streaming sticks out there so do your research and know which features you are looking for before you buy. As far as the Chromecast goes, they are always adding new streaming services so it's been fun to watch over the past year or so as this product gets more and more useful. Keep in mind that the only controller you have for the Chromecast is going to be your computer, phone, or tablet. Some people like that, other people find it inconvenient.", "verified": true, "helpfulness": "0/0", "author": "Spencer M"}, {"rating": 1.0, "review": "Ugh, huge disappointment. So purchased this thinking I could stream my slingbox to it as I travel outside the U.S.... Huge mistake. So slingbox has an app, but the chromecast never connects. You always get \"can't find chromecast\" or some other message along the same lines. If you are purchasing this item for some other use, sure maybe it works, I can't really comment. If you are trying to use it with slingbox, forget about it. It's not an Internet strength issue. It's a chromecast issue. I've tried everything.", "verified": true, "helpfulness": "0/0", "author": "Fran M."}, {"rating": 5.0, "review": "Its a game changr, although i bought this a while ago and now that i know more about streaming sticks, i would go for an amazon fire stick", "verified": true, "helpfulness": "0/0", "author": "Javier M. Y."}, {"rating": 5.0, "review": "My husband loves this! Does exactly what it is supposed to do and was easy to set up", "verified": true, "helpfulness": "0/0", "author": "Grace L."}, {"rating": 2.0, "review": "Expensive and not as versatile as the Amazon Fire Stick.", "verified": true, "helpfulness": "0/0", "author": "Roger Rotor \"mofo1\""}, {"rating": 5.0, "review": "This has been an amazing little device.  We've liked and used it so much, we've been purchasing them for birthday and Christmas gifts for family and friends.  I don't know how I ever survived without my Chromecast.", "verified": true, "helpfulness": "0/0", "author": "M. Waldron"}, {"rating": 3.0, "review": "Cool gadget.", "verified": true, "helpfulness": "0/0", "author": "E. J. Younes \"BaldyLokz\""}, {"rating": 5.0, "review": "I just want to post again how great this device is!", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 5.0, "review": "Sweet! Functionality at a phenomenal price!", "verified": true, "helpfulness": "0/0", "author": "D Shegs \"Sour Dima\""}, {"rating": 3.0, "review": "I expect more", "verified": true, "helpfulness": "0/0", "author": "Alejandro R."}]