[{"rating": 5.0, "review": "Chromecast is perfect. I got rid of my cable when I got this, and I can't even tell. I actually got my friends to buy one too for their place.", "verified": true, "helpfulness": "0/0", "author": "Kati Kerperien"}, {"rating": 1.0, "review": "I was really excited about getting this but ended up being bothered by two things:  1, in the TV commercials and advertising, they never seem to tell you that you have to plug it in from the large round end into the TV USB (if your TV has one), or into an electrical outlet. 2, it would never connect to my wifi network.  After an hour of trying to get it to connect, I gave up and decided to return it.  If something won't work for me in less than an hour, it's not worth the trouble.", "verified": true, "helpfulness": "0/1", "author": "Curtis R. Rogers"}, {"rating": 1.0, "review": "Bought this because I am a gadget guy.  I a not sure what the point is.  I have no plans to buy applications from Google in order to use this.  I see this as being pretty useless.", "verified": true, "helpfulness": "0/2", "author": "Sandman"}, {"rating": 1.0, "review": "another intrusion device for google....they shouldn't need my phone number, email, and wifi network for me to just connect my phone to the TV. I had a terrible time installing the app on my motorola razor phone and getting it to work properly.", "verified": false, "helpfulness": "0/2", "author": "jd"}, {"rating": 5.0, "review": "I gave them out for Christmas, and received one myself. I am pleasantly surprised that this little inexpensive device can turn your TV into a Smart TV. I was able to watch Christmas movies all day. Very cool.", "verified": true, "helpfulness": "0/0", "author": "DC"}, {"rating": 4.0, "review": "For now I can watch youtube movies only my TV using chromecast.I hope that in future it will improved (by online update for someway) and many more options will be added.And one more thing, you need a WIFI at home to use it . Because chromecast not takes the media directly from the device (My Nexus for example).", "verified": true, "helpfulness": "0/0", "author": "Adir"}, {"rating": 5.0, "review": "This device is already well worth the price for me as it casts Youtube and GooglePlay media seamlessly.  I also use a couple of the newly compatible apps (BeyondPod and Avia) but I really appreciate it for casting tabs from a computer.  Now people should realize that the quality of casting from a pc  is highly dependent on the computer's processing power since it is really mirroring the tabs and has to \"double render\".  I've tried it with three different desktop/laptops and performance is in direct correlation to the power of the processor. It actually works really well with my most recent $200 Acer Chromebook. The double-rendering, of course, does not apply to Chromecast-supported sites such as Youtube, Netflix and HBO Go, as they cast in the same way as apps from your phone--sending just the link to be picked up and rendered by the Chromecast itself.This is why the future is so exciting for this gadget.  Google has already announced plans to support a lot more apps and release the SDK soon in 2014 so that any website can incorporate the technology.  Once that happens, you won't be mirroring videos from the pc, but rather casting them in the efficient, high-performance way.", "verified": true, "helpfulness": "0/0", "author": "CAC1031"}, {"rating": 5.0, "review": "Google has a whole list of routers that aren't compatible with the Chromecast, or require a workaround.  I don't know if you can access the list BEFORE you buy. but it's worth a look to see.  I researched Chromecast vs. Apple TV on YouTube before buying this, and saw the two have different advantages.  Chromecast's advantages were price ($35 vs $100) and flexibility -- I have a PC and android as well as Apple products.  Apple had more features and benefits.  I chose the Chromecast - the need to purchase the new router wiped out the price advantage, however.", "verified": true, "helpfulness": "0/0", "author": "Carol M. Liege"}, {"rating": 5.0, "review": "Just received this and set up was easy.  It works great.  I am glad I purchased it.  I recommend this.  I have an older TV, so it was an easy process.  I only use it for Netflex and UTube.", "verified": true, "helpfulness": "0/0", "author": "Clarice Duncan \"CLARICE\""}, {"rating": 5.0, "review": "I used to use an HDMI cable to stream from laptop to TV, mainly Netflix and Youtube. Chromecast quality seems to be just as good, and no cable in the way. What's not to like? Although Google doesn't technically support doing this, you should be able to plug Chromecast directly into your receiver to get sound through your stereo speakers, rather than plugging into your TV and then having to run an audio cable to the receiver.", "verified": false, "helpfulness": "0/0", "author": "César Chávez \"Tax the Rich... free the poor.\""}]