[{"rating": 5.0, "review": "Very nice...works as said..", "verified": true, "helpfulness": "0/0", "author": "OldDawg143 \"nucman\""}, {"rating": 4.0, "review": "Well, this was purchased cause I am was sick on not being able to rent movies from my Apple TV.  Apple support could not fix the issue with my appleid, so out of frustration I went out a purchased the Fire TV.  Now, I am hooked and will never go back.  It is just awesome, plain and simple.  Way better that the Apple TV which I was using for years.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Pretty amazing piece of equipment, I was able to find enough programming to cut the cable with pay tv . It would only be better if Amazon would include more of the better movies with the prime account . Instead making them only available for rental with an extra charge. So far Netflix is the winner for streaming movies and classic programs .", "verified": true, "helpfulness": "0/0", "author": "Steve Sowers"}, {"rating": 2.0, "review": "Does not support HBOGO so I returned it.", "verified": true, "helpfulness": "1/2", "author": "Federica Consolazione"}, {"rating": 5.0, "review": "It rocks.. fast, picture looks great. I even like the screen saver picture.  The remote feels good and the voice activated feature works really well actually.  This is much better than my apple tv 3.Cons: Amazon prime mixes what's available as part of the amazon prime streaming and HD downloadable rentals.", "verified": true, "helpfulness": "0/0", "author": "zjessez"}, {"rating": 5.0, "review": "So much better than cable!  The HD quality is excellent and there are so many choices for viewing. Amazon Prime is worth the $99 fee for the year and we are so glad we made the switch from cable to Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Sherri"}, {"rating": 3.0, "review": "You can't have ESPN to watch since you need a TV provider which I don't have and don't want to pay my money wasted to cable and satellite when I just watch movies and sports, good quality, depending on the internet provider you have, if youR account was blocked because of a issue with your card they ask you over 100 times to go check your card payment to install a free app any app take your pick, so wasn't sure why they need a valid card when clear the app states it's free, another thing is you try to call to get ESPN you get no one on the phone to provide you with a valid answers not even if you call ESPN they keep saying we need a TV provider like really, why ? i want to pay for ESPN service why would i need a TV provider? yes it's true you have a lot apps which as i stated before I can't download until my card on amazon is validate which i did a couple of times. another thing was if your control stops working its not broken its low batteries, the speak into the control action is good no issues there funny come backs when you say something wrong, I can't put 2 or 1 stars since i don't hate it nor i don't like it that is why it seems ok not to perfect but still i could stream alot of movies i hope this issue with checking my card goes away and i can download cbs, the weather and a game oh and to play a game you need to purchase separately the controller for games", "verified": true, "helpfulness": "0/1", "author": "Stephanie"}, {"rating": 5.0, "review": "Much better performance...the apps are expanding.  i think it streams so much better and sounds great!", "verified": true, "helpfulness": "0/0", "author": "Tobias Baughman"}, {"rating": 5.0, "review": "Easy to setup with an added bonus that you can sideload apps not found on the store site like XBMC. I have an Apple TV 2nd Gen and have found the Fire TV to be a significant improvement in speed, access to additional apps and program content. The UI is easy to use and as long as you are a Prime member and can grin and bear not having access to HBO, Sky and AMC, you will be very happy with your choice.Shortcomings are that since the remote is Bluetooth, you can't use a universal remote to control it, so there is no backup if you need one-especially since for some dumb reason, somebody thought it would be fine to release the product without a mobile phone app to control it. It also means you are stuck with more than one remote on your table since it doesn't control sound volume which also seems like a major oversight.", "verified": true, "helpfulness": "0/0", "author": "Jason Levine"}, {"rating": 4.0, "review": "Great.", "verified": true, "helpfulness": "0/0", "author": "Omar Zeciri"}]