[{"rating": 5.0, "review": "I love this device!  Easy to setup works with all my devices (laptop, Kindle Fire, android phone) and works well to boot!  I purchased a couple and may purchase another.  The vendor I purchased it from was also great, super fast shipping.", "verified": true, "helpfulness": "0/0", "author": "NS, Chicago"}, {"rating": 5.0, "review": "Love it....  makes showing movies and photos a breeze.", "verified": true, "helpfulness": "0/0", "author": "Frank Diaz \"compucot\""}, {"rating": 5.0, "review": "This is great.  I have this and a roku and don't need both.  Would recommend you get this for free streaming, streaming from the net on your phone or computer with an app (search for it and you'll find some free ones), or for Netflix/Hulu.", "verified": true, "helpfulness": "1/1", "author": "Sleepers Delight"}, {"rating": 2.0, "review": "very limited, won't buy another, would rather use a hdmi cable and stream everything", "verified": true, "helpfulness": "0/0", "author": "Stevan Brisevac"}, {"rating": 5.0, "review": "Simply way to display internet content on your TV.  We use it for Google + photos, and occasionally Netflix and youtube", "verified": true, "helpfulness": "1/1", "author": "TX gadget nut"}, {"rating": 4.0, "review": "It works good, but it is obviously first generation. It can be very buggy, but in time I think it will be a great tech gadget to have. If you simply want to watch youTube Videos on your TV it works. When you go outside of the basics, this is when it gets really buggy. As long as the price stays low, the bugs are tolerable.In all fairness it is a much better solution than searching and watching YouTube videos on your TV, with a Smart TV or a Directv Box.", "verified": true, "helpfulness": "0/0", "author": "Russ"}, {"rating": 5.0, "review": "This is awesome. I love being able to watch something from laptop on the TV", "verified": true, "helpfulness": "0/0", "author": "Kathy"}, {"rating": 3.0, "review": "it's ok when it works, but it tends to overheat easily- for a 1/2 hour to an hour show, not usually a problem, with a 2 hour movie, it overheats,and I have to reset the ipad and the device itself. Wish it were better. I bought to stream certain channels through the tv,and it works ok for that purpose.", "verified": true, "helpfulness": "0/0", "author": "J. murphy"}, {"rating": 5.0, "review": "I am very happy with Chromecast performance.", "verified": true, "helpfulness": "0/0", "author": "Cristina Castro Cranwell"}, {"rating": 5.0, "review": "awesome gadget!!  user friendly", "verified": true, "helpfulness": "0/0", "author": "Jeanne Fleek"}]