[{"rating": 5.0, "review": "It's still quite limited in term of features but there are workarounds with third party apps like Avia that allow you to view your photos and videos. Perfect for YouTube and Netflix and so simple to set up!", "verified": true, "helpfulness": "0/0", "author": "Cris"}, {"rating": 5.0, "review": "This little gadget is amazing!!  We have a 36\" Flat Screen TV and can't afford Cable; we put Netflix from my Laptop to the screen..  No more Squinting at an 11\" screen.  I don't have to pay $75.00 a month to a greedy cable company, merely $8.00 to Netflix and the one time payment for the \"Google Chromecast\".  This is Wonderful!! Thank You.", "verified": true, "helpfulness": "0/0", "author": "MomOf5NanaOf4"}, {"rating": 5.0, "review": "This thing is great. My kids can use it from their kindles with ease. My wife and I can use all our mobile devices with it too. Not too many apps, but the thing works well. The chrome tab streaming from the computer is cool too and works very well. Easy setup and easier to use.", "verified": true, "helpfulness": "0/0", "author": "JTownsIV"}, {"rating": 5.0, "review": "I absolutely love this product....we set it up and it was very easy to do. You can use your phone or tablet to stream apps OR you can download Chromecast to your Google Chrome browser on your laptop or desktop and  anything you have on your PC or MAC you can see right up on your TV screen. Pictures, documents, websites....anything on your PC you can see. This is an awesome product. Here is a wonderful article that tells you all the cool things you can do with your Chromecast:[...]I highly recommend this product!", "verified": false, "helpfulness": "1/1", "author": "bambam0922"}, {"rating": 5.0, "review": "One of the best product that Google has invented.. simply love it.. Worth every penny ..!! Just waiting for more apps now..!!", "verified": true, "helpfulness": "0/0", "author": "Viral Makwana"}, {"rating": 4.0, "review": "I am satisfied with the product overall. However, tab casting needs major improvement. Even with 600MBPS wifi and latest haswell processor there is a lot of stuttering and lip sync issues with tab casting.", "verified": true, "helpfulness": "0/0", "author": "Si Mason"}, {"rating": 5.0, "review": "The chromecast works great I wish google would add more apps that are compatible like spotify. That's my only complaint I can take it anywhere an it works awesome. I'm sure google will add more I can't wait for that day.", "verified": true, "helpfulness": "0/0", "author": "Felipe"}, {"rating": 2.0, "review": "Jan. 2014. My 15-yr old daughter spent a lot of her savings to buy the Google Chromecast for me for Christmas, knowing I couldn't wait to watch NETFLIX on our TV. However, I was quite disappointed. Not only is it not \"PLUG and PLAY\" with our Verizon FIOS system router, I spent a good 3-4 hours trying all the changes to our router recommended by Google and Verizon (and others). It still would not work.  I gave it two stars because up until the time when we actually tried playing Netflix (or Youtube), the setup was easy.", "verified": false, "helpfulness": "1/1", "author": "J. Rockafellow \"busyjr\""}, {"rating": 1.0, "review": "It may be user error, but I doubt it.  I can't get video to play on it.  Every time I connect and play a video it freezes on the video.  The audio plays amazingly, but the video isn't there.  Oh well, maybe their Charlie version will work.", "verified": false, "helpfulness": "1/2", "author": "tim cooley"}, {"rating": 5.0, "review": "My husband plugged the Google Chromecast into our bedroom tv and immediately had it streaming Netflix off of his iPad and onto our tv. The world will never be the same.Fast delivery and product is exactly as described.Very easy to use, with some technical knowledge of working with apps.", "verified": true, "helpfulness": "0/0", "author": "Deskins"}]