[{"rating": 5.0, "review": "I don't have cable, this fills the gap and is so convenient with netflix and the utube I have tried.  Fabulous with netflix.", "verified": true, "helpfulness": "0/0", "author": "Julietta \"The babe!\""}, {"rating": 5.0, "review": "Works as I wanted to project videos from my computer to my TV!  Sound and Video work great!  Simple set up.", "verified": true, "helpfulness": "0/0", "author": "James F. Graham"}, {"rating": 5.0, "review": "Great way to make any TV a \"Smart TV\". I use it mainly for Netflix. Can't beat the price. I would recommend to a friend.", "verified": true, "helpfulness": "0/0", "author": "Craig Ladd"}, {"rating": 2.0, "review": "It worked once.  The next several times we tried to use it, it would connect-disconnect-connect-...  It has never worked properly since.  We tried it with a desktop, laptop, tablet, & phone.  Very sad.", "verified": true, "helpfulness": "0/0", "author": "M. Grubb \"rug weaver\""}, {"rating": 1.0, "review": "Very misleading.  They get you with the Google name, price, and 3-easy-step setup.  Easy? - I'm above-average in solving my pc problems, and spent too much time reading their massive online troubleshooter regarding the problems with my Verizon FIOS router (pretty common router for Google's product designers to screw-up this \"handshaking\" of hardware).  I sure got fooled! - don't be their next fool.  If Google wants ChromeCast to succeed, wait a few years for them to work the bugs out, and keep checking user reviews.  For now, you'd have to agonize over all the bugs yourself.After removing it from my TV to prepare it for return . . . my TV (4 years old) no longer picks up channels.  I had the TV auto-reprogram its channels, and all I'm seeing is snow on the screen.  Judge for yourself, product review readers.  I rarely write reviews, but sure hope this helps some of you.  10% of the reviews are 1-star, which for me is pretty bad.", "verified": true, "helpfulness": "3/5", "author": "Glory2God!"}, {"rating": 5.0, "review": "Works Brilliantly. I was up an running, from unpack to streaming Netflix from my laptop to TV in about 5 minutes.", "verified": true, "helpfulness": "0/0", "author": "Sean McAleer \"Techno Geek\""}, {"rating": 5.0, "review": "it makes watching youtube a really amazing experience and it becomes easier now with Chromecast which enable me to enjoy watching the videos on the big screen. I would recommend it differently", "verified": true, "helpfulness": "0/0", "author": "Khalid Alhaqqan"}, {"rating": 4.0, "review": "Work great and seamless for all my HTC One, Nexus 7, iphone 5 and ipad 4.  For watching you tube content.", "verified": true, "helpfulness": "0/0", "author": "TonyH"}, {"rating": 3.0, "review": "Works well, but if you don't use Netflix it doesn't have much use.  If you have a recent game console, or a media center PC this won't be very useful unless you travel and sit in your room a lot.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 3.0, "review": "It needs an SDK to work on for a start. More app support! Only supports a few big time apps such as Netflix and Youtube", "verified": true, "helpfulness": "0/0", "author": "Carsen Klock"}]