[{"rating": 4.0, "review": "It work very surprisingly", "verified": true, "helpfulness": "0/2", "author": "John Gabriel"}, {"rating": 2.0, "review": "i cant get free hulu and dont know what to do to get it.  love your subcription but cant afford $99- right now is there a montly verion?", "verified": true, "helpfulness": "0/3", "author": "katie lanoux"}, {"rating": 4.0, "review": "Great but just wish I could get local news.  Learning to pick some different shows / programs from what I once watched.  But Fire TV gives me a great deal of programs to choose from.  I feel as time goes by this is the way to watch television.", "verified": true, "helpfulness": "1/2", "author": "W, Howlett"}, {"rating": 3.0, "review": "Good performance overall!! I wouldve given 5 stars but I was dissapointed about the fact that HBO GO and SHOWTIME ANYTIME doesnt work if you are subscribed through comcast :(((", "verified": true, "helpfulness": "0/1", "author": "gerald marku"}, {"rating": 5.0, "review": "Better than I expected. Easy to hook up. Highly recommend if you do have a smart tv. Picture is perfect.", "verified": true, "helpfulness": "0/0", "author": "Joyce"}, {"rating": 5.0, "review": "Simply awesome.  Need more storage space, but still a 5 star rating", "verified": true, "helpfulness": "0/1", "author": "Leah Romano"}, {"rating": 5.0, "review": "So fast and easy to use", "verified": true, "helpfulness": "1/2", "author": "james a effah"}, {"rating": 4.0, "review": "Great box.", "verified": true, "helpfulness": "0/1", "author": "Ruben"}, {"rating": 3.0, "review": "Hardware wise, I thought the Five Tv was very good. The device worked with ease, was very fast and responsive, great graphics, and never froze up. The only flaw was the lack of a Power (On/Off) button, but rather just a \"Sleep\" option that had to be done manually through the settings menu. On the Software side of things is where I feel the Fire Tv falls short. There is a limited number of Apps  and many Apps other streaming players offer, the Fire Tv does not. I also would've liked web browser capability.", "verified": true, "helpfulness": "0/0", "author": "Jules"}, {"rating": 5.0, "review": "I received this product yesterday. Since I have an older TV I needed to also purchase a HDMI to composite video converter ($20). [The Amazon Fire TV only has a HDMI output]. Nevertheless, everything connected together without any problems. I then powered up the system and it recognized me immediately. It also 'knew' that it was connected with an internet cable to the router.After playing around with 'clicker' I became familiar with the operation. It is very intuitive! The picture quality was very good. There are VERY many channels,some are free many are not. But it is a whole new world out there.The product worked exactly as advertised.", "verified": true, "helpfulness": "1/1", "author": "Kurt Gruensfelder \"Kurt Gruensfelder\""}]