[{"rating": 4.0, "review": "There are only 2 apps in it (Netflix and YouTube). Need more excitement. Every piece of technology today, from TV's to DVD players, etc. has more apps. What's the point of getting this one. I had an old Blue Ray DVD player that already has Netflix, YouTube and Pandora. One word, needs more juice. Cool gadget but now just became a part of TV that is not being used", "verified": true, "helpfulness": "0/0", "author": "Kastriot Gaspri"}, {"rating": 2.0, "review": "While we love its streaming of Youtube content, rest of pure chrome web casting is patchy at best.  Casting stops and terminates for no reason and after several restarts we give up.  It is also not cool that chrome browser can not cast from iPad/iPhones. I am disappointed at this sub-optimal product from Google.", "verified": true, "helpfulness": "0/1", "author": "JimBean"}, {"rating": 1.0, "review": "P.O.S. Glitchy. Slow. Times out a lot.  This reminds me of the 28k Modem days.  BTW:  My TV is within 5 feet of my ultra high spped DSL wireless router and my computer is within 10 feet of both. This should work just fine - but it is a terrible waste of time.  An HDMI cable from my computer direct to the HDMI port on the TV is a much, much better solution.", "verified": true, "helpfulness": "0/1", "author": "A. Soundhouse Recording LLC \"Soundhouse Recording Studios\""}, {"rating": 2.0, "review": "It work as Roku, limited function, easy install with wi-fi limitation. for my situation, it is difficult to connect to wireless.", "verified": true, "helpfulness": "0/2", "author": "KM \"Man Wong\""}, {"rating": 5.0, "review": "Love it. Got it mainly for HBOGO and it wouldn't work until I upgraded my iPad to iOS7 now works like a dream. Very cool!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this product so much! It has literally made watching Netflix so much easier compared to wiring the computer to the TV.", "verified": true, "helpfulness": "0/0", "author": "Sopheany"}, {"rating": 2.0, "review": "Have spent a good hour trying to connect device to a new wifi connection with no luck. Gave up. Must use Chrome which is fine but setup and interface was very spotty on Macbook pro.", "verified": true, "helpfulness": "1/4", "author": "smrbrz"}, {"rating": 5.0, "review": "I have asked Amazon more times than i can count to make their prime video app available on the #1 mobile os (Android) so i can watch on my phone and tablets but for whatever reason they won't. So now I buy my movies from google play and can watch my videos on every device I own. I hope Amazon will make an app but if they insist on pushing Android users away they will find chromecast a big help. Please open your eyes Amazon, I am speaking with my money.", "verified": true, "helpfulness": "0/0", "author": "Ron"}, {"rating": 5.0, "review": "so simple to use. Took a whole 5 minutes to set up and stream from my google tab! I just wish I could get this to work with my Ipad.", "verified": true, "helpfulness": "1/1", "author": "rdog"}, {"rating": 5.0, "review": "Fantastic product that is always reliable, almost never buffers, and it was super cheap!Setup was a snap, and once it's done, you'll never need the Chromecast app again, just open Netflix or YouTube and click the Chromecast button, and you're done.", "verified": true, "helpfulness": "1/1", "author": "Ryan Romel"}]