[{"rating": 4.0, "review": "At first we had a lot of dis-connectivity issues.  Every show would loose connection. I bought a new wireless modem and that stopped, even though my old one was only 2 years old and one of the best out there.  We only see connectivity issues once or twice a week now.  I do wish there was a way to sort our free versus paid tv shows/movies.  I saw an advertisement where Roku has a feature that just allows you to search for a tv show/movie and then it displays each app (Netflix, amazon, hulu, etc) and how much the show costs on each app.  On Fire TV, it defaults to firetv and you can search but often we get to movies/shows that want money.  I can sometimes go to Netflix, search again and get it for free.  Overall, its a great device, just tempted by the Roku search feature that's searches all apps and lets you know the best price.  On FireTV, It would also be nice to see the prices (or even a price icon letting you know its not free) on the main screen and not have to load all the movie details.  We have a Prime account and the only easy way to search for free movies is on your computer and then add them to your watchlist.", "verified": true, "helpfulness": "1/2", "author": "Jesse Allport \"Jesse\""}, {"rating": 1.0, "review": "Has a hard time loading", "verified": true, "helpfulness": "0/13", "author": "Mary Renee bradford"}, {"rating": 5.0, "review": "Blazingly fast and intuitive.  Other smart device creators can take notice: Amazon Fire TV got it right!  Love it!", "verified": true, "helpfulness": "1/4", "author": "Ray H \"Ray H\""}, {"rating": 5.0, "review": "I'm loving Amazon Fire TV.  Worth every penny.", "verified": true, "helpfulness": "2/3", "author": "Orange-Poppy"}, {"rating": 5.0, "review": "This is the coolest thing.  I'm disabled so unfortunately I have to spend several days in bed at a time while my pain goes wild.  This with Amazon prime and Netflix is awesome.  I love the speak search function that is so cool.  Also I can move it from TV to TV in the house. Just plug it in and connect to TV and you've got it. Easy to use but make sure you have fast internet or it will frustrate you.", "verified": true, "helpfulness": "2/3", "author": "Peter Dutcher"}, {"rating": 5.0, "review": "this works great is way way better than the roku!!!I have both and this is much faster.", "verified": true, "helpfulness": "2/3", "author": "tonia"}, {"rating": 5.0, "review": "We LOVE it!!!", "verified": true, "helpfulness": "0/1", "author": "W Kruz"}, {"rating": 3.0, "review": "This review is a comparison between the Roku 3 and the Amazon Fire TV. (This review has been updated from its original)(UPDATE)I wanted to test these two side by side to see which I preferred. The Amazon Fire TV claims to have a 3x faster processor. I am not quite sure why that is needed since apparently the Roku 3, which may have a 3x slower processor than the Amazon Fire TV, can handle HD content just fine. So unless they come out with something higher then 1080p HD that requires the 3x faster processor, I am not sure why the additional processing speed is needed, but it is nice to know it is there. After further investigating I can see now why it would be nice to have Amazon's 1.70GHz Qualcomm Krait 300 processor over Roku 3's lower end processor. Amazon Fire TV runs off of the Android, or in this case, Fire OS which is very similar if not identical to the every day Phone and Tablet Android OS's. That being said, you can download high end games, normally found on Google Play, to play on your big flat screen. However, there is much more potential to Amazon Fire TV's operating system then meets the eye. That is, you can modify or \"root\" your device. This means you can open up possibilities that the Roku 3 cannot even touch. Imagine logging into a Windows 7 computer using the \"Guest\" profile. You are limited to what you can do and access. Now login with the Administrator profile. You now have complete access to everything. The Amazon Fire TV, and almost all Phone and Tablets you buy from a retailer or phone company is locked and all you have is guest privileges. Rooting it gives you Administrator privileges. Just think of having access to Google Play on Amazon Fire TV, not just limited to what Amazon's store has to offer. You can also convert Wii remote controls into gaming controls and so much more. Bottom line there is much more potential to the Amazon Fire TV then meets the eye. Of course, any modifying or rooting voids your warranty and you can potentially damage your device if not rooted properly. So don't think I am telling everyone to modify your device. What I am telling you is that there is a hidden gem in the Amazon Fire TV and you can tap into it with a little bit of research and the likely hood of voiding your warranty. But you have been warned and I hold no responsibility for your actions. All this information I have stated is clearly accessible by searching the internet. I have not done any of the modifying and don't plan on it. I did do the same research with the Roku 3. And even though it seems you are able to root the Roku 3, you get nothing out of it. It is very limited, no Google Play and no perks as of yet but that could change. It just wasn't designed like the Amazon Fire TV.Setting up both units are pretty easy. Plug up the device and follow the on screen instructions. The Roku 3 took a bit more time to setup. You have to create an account and you must supply a credit card number. Then you are ready to go. However, the Amazon Fire TV comes with the unit pre-programmed with your Amazon account. So the only thing you have to do is connect to your wireless router and your done. I did find it entertaining that Amazon decided to create a short cartoon introducing the Amazon Fire TV and its features but was not needed.The designs of the two are significantly different. The Amazon Fire TV seems to have gone towards the more smooth like rubber/plastic, more of a modern look. It looks sophisticated, modern and sleek. The Roku 3 seems a bit more bulky with different colors and looks more toyish with a shiny plastic polish. The Roku 3 and the Amazon Fire TV both seem to not have an on/off button. It simply stays on all the time. The Roku manual claims it was designed this way and it barely trickles electricity. I assume the Amazon Fire TV has similar statements. Amazon won this one.(UPDATE)The Amazon Fire TV has optical output where the Roku 3 does not. However, after being informed by a comment from Christian Maracine (thank you) and after doing some research of my own, HDMI passes higher-resolution audio, including the formats found on Blu-ray: Dolby TrueHD and DTS HD Master Audio. These formats can't get transmitted across optical. So even though Amazon was nice enough to add the optical audio output for those who use it, its better just to use an HDMI cable.(UPDATE) After several comments (thank you commenters) we have cleared up that BOTH the Amazon Fire TV AND the Roku 3 have ethernet ports. Whether or not they both support gigabit connections I do not know and don't have time to test them and I'd rather use 5GHz N any ways. Someone feel free to comment and provide a source.The Roku 3 has a head phone jack in the remote control that allows for an individual to enjoy sound without disturbing others which I believe is a neat idea that Amazon Fire TV should of adopted. But then again I am not sure how often it would be used and at what quality the sound be transmitted. Also, I could assume the battery would drain fairly quickly if used all the time.The Amazon Fire TV's remote has the voice search capability. However, this feature seems to only work with Prime and nothing else like Netflix or Hulu+ which is a big negative. When you use the voice search button, only suggestions for Prime videos come up even if logged in and viewing a Netflix account. Either this is a limitation or Amazon did this on purpose for marketing purposes. Either way, when I saw voice search on the tin, I expected voice search on everything. Was a big disappointment when I am forced to only search Prime when I know Netflix has a bigger selection of content. This was an instant negative 1 star.The Roku 3, when a tv episode ends, it automatically counts down and changes to the next episode. Whereas, Amazon Fire TV waits till the very end of the episode, then counts down and changes to the next episode. Honestly I like the Roku's way better. I'd rather skip the same ending credits and go straight to the next episode. You end up having to wait another 2-3 minutes with Amazon Fire TV. Roku wins this one.The Amazon Fire TV and the Roku 3 have the option for connecting to 5GHz routers. This means faster streaming, less buffering and less drag on other devices that are connected to the 2.4GHz receiver and vice versa.The remote controls are similar in size yet the Roku remote seems more comfortable in my hand. I prefer the Roku 3 remote just because the menu buttons are a bit bigger, are more visibly understandable and kind of resembles a Wii remote for gaming. It has a glossy finish. The Amazon Fire TV remote is a bit skinnier and is smooth.The Amazon Fire TV has a nice screen saver mode with beautiful scenarios of mountains and such. This was set by default. However, the Roku's screen saver is just a black screen with a logo. I didn't do much investigating with the screen savers since I don't really care. But it is a nice touch.The Amaon Fire TV gives your no way to categorize between Free Prime and Paid Prime. This really irritates me to the extreme. This is obviously a marketing scheme but it is also very disappointing when I search for a movie, it shows up and I attempt to watch it and I have to pay money for it. I pay, like everyone else pays, a yearly rate for Amazon Prime. I searched for a 15 year old movie that Amazon had for cost money. I assumed only new content required money but even old content, as old as 15 years ago requires additional payment. Very disappointing. -1 star for Amazon forcing their paid prime customers to sort through free and paid prime content. Give us the option and you can have my respect back.I did not have a chance to get into the game content. I only know which is whats on the tin. However, in the comparison chart of Amazon Prime TV and Roku 3, Amazon shows Roku 3 only supporting 100 games. Either Amazon has not updated their comparison chart recently or they are just lying or Roku is lying. Roku states over 1000 games exist for its console. However, after viewing the games off of Roku's website, a lot are homebrewed. So I assume the 100 game claim has to do with official games.At the end, Amazon Fire TV wins by a hair. With its limited voice search feature and its slick matte design, its makes for an envious person. It's not like I dislike the Roku 3. I had absolutely no problems with it. In fact I purchased the Roku 3 first and then saw that the Amazon Fire TV went on sale only days later and thought I would compare the two. If Amazon gives their paying customers the option to search all accounts, Prime, Hulu+, Netlflix etc. then I will give them their 1 star back. I am sure its easy to do with and they can patch it through with an update. As well as giving Prime members the ability to categorize between free and paid videos. If those two features were added Amazon Fire TV would beat Roku 3 to the ground. But as is they are not too far apart.I hope this helps you choose between the Roku 3 and the Amazon Fire TV. Good luck!", "verified": true, "helpfulness": "7/9", "author": "Jay"}, {"rating": 5.0, "review": "Would like to buy amazon fire tv from the us but am wondering if it will work in calgary canada", "verified": true, "helpfulness": "0/6", "author": "DANIEL"}, {"rating": 5.0, "review": "Incredibly easy to install! Took one minute to hook up and wiring seconds I was watching my first TV show with no commercials! If you're a Prime member, the device is preprogrammed son you don't even have to sign in. Voice recognition feature is incredible! Highly recommend. I had an Apple TV several years ago and Amazin had blown away that competition!", "verified": true, "helpfulness": "0/0", "author": "Michelle Conklin"}]