[{"rating": 5.0, "review": "Very good, works fine in Brazil. It's better than paid tv, cheaper and you can choose whatever you wanna see.", "verified": true, "helpfulness": "0/0", "author": "Bruno Pelegrini"}, {"rating": 4.0, "review": "The device is straightforward to use. Speed is acceptable. However one major drawback is not being able to watch my own videos shot in my camera and stored in my computers. I did not realize that that till I searched a few discussion forms. Google must fix this.", "verified": true, "helpfulness": "0/0", "author": "Sekhar Bhattacharyya \"Good Guy\""}, {"rating": 5.0, "review": "It does what it says it does. Casts from chrome. Apps and the browser itself. Play a movie, get it full screen anf off we go :-)", "verified": true, "helpfulness": "0/0", "author": "TIAGO JOAO BRUNO"}, {"rating": 4.0, "review": "This works great most times.  Occasionally it will not work and we have to plug up the hdmi.  Kinda spoiled by this method of watching internet on the t.v.", "verified": true, "helpfulness": "0/0", "author": "Renee' Fowler"}, {"rating": 5.0, "review": "Nice small stick works great, easy fast way to watch things on a big flat screen.Good and fast application is coming for it what most of the devices can handle.", "verified": true, "helpfulness": "0/0", "author": "Laszlo Tolcsvai"}, {"rating": 5.0, "review": "So simple to set-up that my sister did not need to call me to do it. Big plus here.It works with Plex very well. Way better than a \"smart\" TV.", "verified": true, "helpfulness": "0/0", "author": "Adrian Traian Popa"}, {"rating": 1.0, "review": "I wish I could give this a better rating, when it works it is great, unfortunately it only worked about one fifth of the time, and not at all for the last week or so so I can only give it one fifth of of five stars. (and yes before you ask the little connection icon has at least 3 bars if not 4)", "verified": true, "helpfulness": "0/0", "author": "Benjamin S. Bailey"}, {"rating": 5.0, "review": "We can watch almost anything from our IPAD! It was so easy to set up and use! Quick and fast\"", "verified": true, "helpfulness": "0/0", "author": "Richard Lundgreen"}, {"rating": 3.0, "review": "This is not a shot at the product.  I travel a lot and was tired of hauling around my Roku with cables.  Thought this would work with hotel wifis once my phone was connected.  Not true.  You still have to get the sign in screen to accept terms and conditions for hotels & this does not allow that connection.", "verified": true, "helpfulness": "0/0", "author": "Calrefugee"}, {"rating": 5.0, "review": "I bought this so my parents could watch Netflix on their TV and they absolutely love it. They said it took just a couple of minutes to put it into the TV and get the Chrome Extension to allow it to show what was on their laptop screen, and these are parents who dislike anything technological because they assume it's too hard for them to do.", "verified": true, "helpfulness": "0/0", "author": "Ryan Hocutt"}]