[{"rating": 2.0, "review": "The device does not stay connected with the wireless system and requires restarts, reboots, and factory resets and a lot of fiddling with it to get it to work.  When it finally works it works good.", "verified": true, "helpfulness": "0/0", "author": "John Abercrombie"}, {"rating": 5.0, "review": "I purchased this for my 19 year old daughter for Christmas. It was easy to set up and we have enjoyed it everyday since.  We primarily use it to watch from our netflix account on the TV.", "verified": true, "helpfulness": "0/0", "author": "Stacie W"}, {"rating": 4.0, "review": "Having computer problems at home that have delayed my full use, but what is working is cool.  This is an interesting device that is useful enough, and simple enough that i suspect will be incorporated in new computer systems in the very near future.", "verified": true, "helpfulness": "0/0", "author": "Hoz"}, {"rating": 5.0, "review": "We ordered 5 of these for Christmas to give as gifts and they have been a huge hit. If you have a smart phone and flat screen TV, this is a no brainer. Display what's on your phone right onto your TV in a few easy steps. I highly recommend and will be ordering more in the future!", "verified": true, "helpfulness": "0/0", "author": "Tabitha T."}, {"rating": 4.0, "review": "Works well but it would be more useful if the DNS was not tied to Google. Ability to change would also allow connecting to various Netflix sites around the world.", "verified": true, "helpfulness": "0/0", "author": "N. L. Harker"}, {"rating": 4.0, "review": "I am a senior citizen and I thought this product was fairly user friendly...It did take a little while to load but overall I have not had any problem playing netflix, hulu or amazon prime....it works very well so far...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "It is all right but with only two channels to cast. . .I am disappointed. I expected more  about it", "verified": true, "helpfulness": "0/0", "author": "Gerardo Fresia"}, {"rating": 1.0, "review": "This only works within the chrome browser. If you have stored photos or Video on your device that you would like to stream this does not work.Sorry not for me.", "verified": true, "helpfulness": "1/2", "author": "Manoj MAnsukhani"}, {"rating": 5.0, "review": "This replaces the need for xbox live to stream Netflix.Works well when internet router is nearby.Wish regular hulu could be used as well.", "verified": true, "helpfulness": "0/0", "author": "L. Welton"}, {"rating": 3.0, "review": "It's very cool and cheap. The only disadvantage is it only work for ( YouTube, Netflix, Hulu and chrome), so it doesn't work for the whole computer,", "verified": true, "helpfulness": "0/0", "author": "Ahmed Albassam"}]