[{"rating": 3.0, "review": "I'm a tech nerd, and set up of this was simple. Watched a movie (Usual Suspects) to see how it worked, and did not get it in 5.1 Dolby Surround. Best I could get was Pro Logic, even though the movie streams in HD. Yes, I used HDMI, so that's not the issue. Anyway, didn't think I would have to start figuring this out so soon.", "verified": true, "helpfulness": "0/0", "author": "Sadtaco"}, {"rating": 4.0, "review": "I rated Amazon Fire TV a 4 star because I am still evaluating it at this time. It has been a plus to me as a royal Plex user. This box has a larger storage capacity which increases the streaming speed, which when it comes to streaming you don't want to be waiting to watch your movie. It also has lots of setting that makes the viewing more pleasurable. I own several Roku boxes and this may become a better bridge between viewer and Television. I hope that Amazon continue by adding more apps, especially PLAYON.I would recommend this product to anyone.", "verified": true, "helpfulness": "1/1", "author": "4realguy Beaumont, Tx"}, {"rating": 5.0, "review": "1. Showtime Anytime has a very small list of providers for the Fire TV.  This needs to get fixed.  If you have DirecTV, you can't use the Showtime Anytime app on Amazon Fire TV.  I believe Comcast is also not listed, just for reference.  I was banking on being able to use Showtime on this device, but I was sadly disappointed with the small list of providers.2. HBO GO isn't on the device either, which I knew going in, but it still contributes to it not being 5 stars.  HBO and Amazon have a deal in place to finally bring HBO GO later in the year.Outside of those two things, this device is pretty cool.  It's zippy, and the picture is excellent.  There will be no need to use my Xbox One ever again to stream anything since the picture on the Amazon Fire TV is much better.  I also read reviews prior to purchase that said it was difficult to tell what is prime and what's not, well, that apparently has been remedied since everything is appropriately labeled as prime or not prime.If you order for yourself, Amazon has your account already on the device when you start it up.  That was pretty cool.  So in terms of Amazon Instant Video, you don't need to enter an account or anything.  If it's gifted then you don't get the pre-programmed.  The final thing, this thing is tiny!  I was expecting something a little bigger, it was kind of shocking.  I like that it's so small though, fits everywhere.UPDATE 2/18/15: Amazon FireTV is officially awesome now.  Showtime Anytime now accepts DirecTV, so that's a welcome change.  HBO GO is finally on the device as well.  These were, as noted, the biggest issues I had with the device, that these apps were not usable or not on the device.  That has obviously been remedied.  I love my FireTV now!  More apps have been added over time as well, so I have a pretty good library of things to use on the device.  It's not extensive as something like Roku, but it's getting there.  I'd recommend checking out PlutoTV, and for cordcutters, SlingTV if you want sports (and some other things).I'm not sure if Amazon has tweaked the interface, as I didn't use the device for a long while, but it seems like they may have.  It's incredibly easy to navigate, and again, Prime stuff is appropriately labeled in its own category.  I don't know how games work on it because I could careless about them.  I have a PC and Xbox One for games.  But the device is definitely improved!  Amazon and Dish have a pretty sweet deal going for SlingTV and the FireTV or Stick.  Worth checking out if you're a cord cutter!", "verified": true, "helpfulness": "2/2", "author": "Stephen Szymanski"}, {"rating": 5.0, "review": "Easy to set up and love the speech to text function, it easily understands what I say.  The box and remote are small and not very noticeable.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "So voice search doesn't search within or across video sources - they all go to Amazon for rent, purchase, etc.  For example, I own and ripped Heartbreak Ridge, putting it on my home plex server.  Searching for the movie title takes one out of the Plex app and into Amaxon Instant.  Interface-wise, it's a little more zippy than roku 3 and AppleTV3, but not appreciably, and without DLNA support, I'm not happy with it.  Further, it seems to create choppy video symptoms about 2 out of 5 times.", "verified": true, "helpfulness": "2/4", "author": "An Amazon Customer"}, {"rating": 5.0, "review": "Absolutely as advertised!  I am loving it. So fast and easy to connect and the choices for entertainment are great.", "verified": true, "helpfulness": "1/1", "author": "Super Shopper"}, {"rating": 5.0, "review": "As long as Amazon allows you to side load apps with this thing it is amazing I have access to prime video when I need it and than with xbmc installed I now can finally cut the cord. I don't even need my htpc anymore", "verified": true, "helpfulness": "0/0", "author": "C. Wong"}, {"rating": 1.0, "review": "how cAN THE MOST IMPORTANT APP WILL NOT PLAY.ASKED ,BUT NOBODY WILL RESPOND.PLUS YOU HAVE TO BUY EVERY EPISODE.STAY WITH THE COMPUTER.DO NOT WASTE YOUR MONEY ON THIS PRODUCT!", "verified": true, "helpfulness": "3/16", "author": "patrick horton"}, {"rating": 1.0, "review": "Netflix does not work in this crap box! The box breaks down and spits some XML code on TV.. I dont recommend this product who is planning to use it to mostly watch Netflix..", "verified": true, "helpfulness": "2/12", "author": "Sri Harsha"}, {"rating": 5.0, "review": "It has no flaws!  Any negative reviews read here are just not true.  What more could one want?  No brainer set up, already registered to my Prime, remembered everything I had saved in my Prime account.  Some people are just too nitpicky, you can find anything you want.  The voice search control blew me away.  The picture is beyond compare. Everything is now in HD/3D.  WOW.  I ditched my Blu Ray with wifi, as it kept dropping the signal, and was very frustrating.  I am so happy, finally I can view Prime movies (and Netflix) without the frustration.  Don't know why I waited so long to get this.  If you are considering buying this tiny little wonder of a box, don't even hesitate a minute.  Great packaging, fast delivery in 3 days, and didn't even need to read the instructions.  It's all right there on the screen.  I LOVE it.  Thanks, Amazon!!", "verified": true, "helpfulness": "5/5", "author": "Vickster \"Music Reviewer\""}]