[{"rating": 5.0, "review": "I love my Chromecast. I have had it for several weeks now and I use it everyday. It's extremely simple and works flawlessly between my phone, computer, and TV. I plan on buying more of these for my other TV's for the great functionality at a great price. The functions of this device are going to get better and better, I can't wait to see what else Google does with it.", "verified": true, "helpfulness": "1/1", "author": "Pat C"}, {"rating": 1.0, "review": "If you have an Xbox or Blue Ray and use it to see YouTube, this device is not required. I downgraded my rating to 1* because Chrome mobile is not supported meaning you can not cast from your tablet or smartphone, just my intended use when I bought it. Useless if you don't have a pc.", "verified": true, "helpfulness": "2/3", "author": "David M. Perez Pena"}, {"rating": 3.0, "review": "It's sort of cool, but the features haven't really materialized yet.  There's pretty much only Netflix and the Google store available, and if you aren't using a real computer (versus a tablet), you can't mirror the browser onto your TV.  I'm sure these problems will be fixed soon enough, but they aren't yet.  Also, there's no battery, so the adds are misleading when they just show people plugging it into the TV and it working....it actually needs to be plugged into an A/C adapter all the time! Kind of lame.That all being said....at $35 it's basically free.", "verified": true, "helpfulness": "0/0", "author": "dustinreviews"}, {"rating": 3.0, "review": "Chromecast . . No HBO GO and they killed DLNA .. Get what you Pay for, should have bought a roku2", "verified": true, "helpfulness": "0/0", "author": "Max"}, {"rating": 3.0, "review": "I'm not sure how I feel about this yet. I've been having issues on and off when using the Chromecast and I'm not sure if it's the product or what. It constantly cuts the broadcast off and I have to set it back up again. It also loses sync a lot so either the characters are speaking ahead or behind the dialogue and it's really annoying. It would be nice if it could be full screen in the TV without me having to sacrifice being able to use my computer while watching what I'm broadcasting on my TV (the way it currently works is if you want full screen on the TV it has to be full screen in your computer - so obviously you can't work on anything else if that's the case). It also wouldn't work on my older computer because the OS wasn't supported (and the OS isn't really that old). The set up was easy and I do use it a lot. Again, it's just not ideal right now so I would suggest maybe waiting until the next version comes out and it's improved significantly before I would suggest anyone purchasing this. I have a Roku so when I want to watch movies/tv shows via my Amazon Prime account, Netflix and Hulu I just use that instead of the Chromecast because it's easier and the quality is better as well. The only differences between Roku and Chromecast (for me) are that the quality/consistency in playback is better with Roku but with CC I can cast something from my Chrome tabs so that's great but if they could plug it in to more of my programs and apps (like for editing) that would be awesome.", "verified": true, "helpfulness": "0/0", "author": "tiffanie"}, {"rating": 1.0, "review": "I still have not been able to get it to connect with my internet. It boasts being a simple and easy to use product but this has not been the case for me.", "verified": true, "helpfulness": "0/0", "author": "Mike C"}, {"rating": 4.0, "review": "Currently only Netflix and Chrome are supported - but works well. Was pleasantly surprised to see that iPhone and Android phones are supported.", "verified": true, "helpfulness": "0/0", "author": "A. Robinson"}, {"rating": 1.0, "review": "Doesn't work with my dektop, which is what I wanted it for.  Really messed up our wireless system. Very disappointed.", "verified": true, "helpfulness": "0/0", "author": "Frank W. Mann \"World Citizen\""}, {"rating": 4.0, "review": "works excellent just wished Google allowed true streaming from your devices own video files. other than that works as advertised", "verified": true, "helpfulness": "0/0", "author": "Abram Baca"}, {"rating": 3.0, "review": "Chromecast is a great idea and it works perfectly for Youtube and Netflix but i cannot get it to stream a google chrome tab that i have dropped a video file into. It was advertised as being able to do this but it definitely cannot for me. good thing it was only $35.", "verified": true, "helpfulness": "0/0", "author": "Highlander"}]