[{"rating": 4.0, "review": "I like it a lot. Its been nice having the movies on my tv and not on the laptop. The Netflix app has some,problems sometimes.", "verified": true, "helpfulness": "1/1", "author": "Joshua Johnson"}, {"rating": 4.0, "review": "Fantastic little toy, would be a 5/5 if it supported HBO Go right off the bat.", "verified": true, "helpfulness": "0/1", "author": "Thomas Corkran II"}, {"rating": 4.0, "review": "UPDATED REVIEW:I am updating my review of this product.  I had previously rated it ONE STAR.  To watch movies, I use Amazon Prime, Netflix, and occasionally YouTube for other clips.  For music, I use Spotify (and on a limited basis, Pandora).  This product seemed like the \"Holy Grail\" based on it's advertising.  When I got it, it worked great with Amazon Prime (obviously) and YouTube, but Netflix was completely broken and Spotify wasn't really a full-fledged client.To Amazon's credit, they sent me an email after my review proactively offering me help fixing the problem.  I was busy with work and life, so before calling them back, I thought I'd give it another try.  Something had changed, and Netflix worked perfectly and my experience with YouTube was smoother.  All that being said, the device itself is slick.  It is \"snappy\" and easy to use.  I really like the format - I just didn't like what I considered to be \"false advertising\".So, I am changing my review from ONE STAR to FOUR STARS.  If they someday release a Spotify app that actually is a Fire Client instead of something that can just stream music from my phone through the Fire to my TV, I would consider updating it to FIVE STARS, but until then, it's not perfect.  But, my hat is off to Amazon for reaching out to me based purely on one of thousands and thousands of reviews.------------------------------Old title: Worst purchase on Amazon ever - BUYER BEWARE - FALSE ADVERTSINGI buy lots of things on Amazon - we get packages literally every other day.  I have bought $5000 cameras, large TVs, Kindles, computers, etc.  Of everything I have purchased, this is absolutely the worst thing I have ever received.  I was excited about it, as I currently get \"online\" through a Blu-Ray player and was excited to have one thing to see Amazon Prime, Netflix, Spotify, Pandora, Hulu, etc.  And the voice recognition was an added bonus.  I figured there would be some setup, but was fine with that.  I have a home network set up with 15TB of pictures, movies, backup.  I have 3 wireless access points throughout my house.  I have a degree in electrical engineering and have programmed computers professionally.  I figured setting things up should be a breeze.Boy, was I disappointed, and it wasn't because of the setup.  As long as you want to just use Amazon Prime, I've never seen a better installation.  HOWEVER, Netflix doesn't work.  You have to download an app, which I could never get to load - so, NO NETFLIX.  I tried to use Spotify for music - but it's not a full-fledge client, merely something that \"connects\" to Spotify running on your phone or iPad - and that didn't even work.  I could never get the Fire to see my phone on the network.  Similarly, with other things I tried.  The only thing that works well is watching movies on Amazon - and I could already do that (although less efficiently) on my Blu-Ray player.THIS IS A PIECE OF GARBGE, AND ALL OF THE CAPABILITIES LISTED ARE FALSE ADVERTISING.  DO NOT BUY.  SAVE YOUR MONEY !!!!", "verified": true, "helpfulness": "10/27", "author": "MikeSaltLake"}, {"rating": 2.0, "review": "Seems the antenna inside isn`t great for wifi.Have used Roku2 & 3 and Appletv in the same spot w/flawless reception, and the FireTv box didn`t react well to same spot.Moved to another spot closer to router where a roku2 works flawlessly on wifi and again the same problem.After it was setup, was pausing and slow so decided to return..I should have known than to get a 1st generation.I`ll stick to Roku.I would be interested to see if Amazon gets some bugs out of the next roll around.Imrpove the antenna!", "verified": true, "helpfulness": "2/3", "author": "njrapid"}, {"rating": 5.0, "review": "l love my fire tv acount with my prime absolutly love it", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "It suits my purpose, to get away from cable. It is very easy to use. It hooks up simply, and starts up instantly. If your a prime customer it has lots of selection. I have Netflix and it works great with it. I am pleased with it. I haven't used the gaming aspect so I cant comment on that. I like the feel of the remote, and the size of the box. I haven't had it but a few weeks, but so far so good. It will pay for itself in two cable bills.", "verified": true, "helpfulness": "1/2", "author": "Karen J Bailey"}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kevin M Quinn"}, {"rating": 5.0, "review": "works great love it", "verified": true, "helpfulness": "0/0", "author": "george bilquist"}, {"rating": 4.0, "review": "Not exactly  what we expected. Thought we would also have access to live local channels.", "verified": true, "helpfulness": "0/4", "author": "Synthia Alley"}, {"rating": 5.0, "review": "This is a great way to access a larger variety of movies, HBO series, music, videos, etc. I previously used Chrome Cast, but because of wanting to access Amazon Prime movie offerings, I was unable to stream them via Chrome Cast. To my delight, switching to Amazon Fire TV has been well worth the price.", "verified": true, "helpfulness": "0/0", "author": "Aussie"}]