[{"rating": 4.0, "review": "This is a great device and is easy to use. You can send things to it from your phone and then continue to use your phone for other things. (Also works with computers using the Chrome browser of course.)I wish it had more iPhone options than just Netflix and YouTube (e.g. being able to play music videos from the phone's library) but I'm sure that's just something on Apple's end; hopefully they'll cooperate with Google so *anything* viewed on the iPhone can be viewed with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "volys"}, {"rating": 5.0, "review": "Super useful little device for streaming.  Works with Android phones, Android tablets, chromebook, and chrome browsers on computers.  Highly recommended to all.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "AMAZING system for watching/working/playing on my laptop via our big screen tv. Some functionality is annoying, but overall this system is incredible. Setup is very quick and use of device is fairly self explanatory. Definitely considering one for each television in our home and one for travel! Maybe we can say goodbye to poor cable tv during hotel stays!", "verified": true, "helpfulness": "0/0", "author": "Rbrt Groves"}, {"rating": 1.0, "review": "I did not have a good experience. It did a terrible job of streaming. Really bad picture. I'm sticking to Apple TV.", "verified": true, "helpfulness": "0/5", "author": "R. Joseph \"West Coast Review\""}, {"rating": 5.0, "review": "This is easily my cheapest tech buy that delivers the greatest value in 2013, especially with my purchase of a Chromebook. Everything that can be displayed on a Chrome browser can be casted onto the TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It's really interesting and works well for what google currently allows, but as of right now that isn't very much. Netflix, google music, and chrome... That's about it as of right now. I really hope google opens up the API so that anyone is able to use this, it has great promise.", "verified": true, "helpfulness": "0/0", "author": "Kevin"}, {"rating": 5.0, "review": "Works like a dream easy to use and install, makes me forget that I don't have cable or a fancy satellite dish.", "verified": true, "helpfulness": "0/0", "author": "C. Grimsley"}, {"rating": 5.0, "review": "It's great.  It is easy to set up and works very well.  A terrific addition to my at home entertainment options.", "verified": true, "helpfulness": "0/0", "author": "Nancy K"}, {"rating": 3.0, "review": "works great with Youtube but not with chrome browser itself. i was trying to watch some live sport games from online networks, it doesnt work properly..", "verified": true, "helpfulness": "1/1", "author": "Ozan Okuyanoglu"}, {"rating": 1.0, "review": "I'm very disappointed with Chromecast. I purchased Chromecast specifically to stream Amazon Instant Video on my tv. After setting it up (which was very easy) I tried to stream a video and no luck. Then I went online to check what was wrong and read that it doesn't support Amazon Instant Video. What gives Google? I'll be returning this tomorrow.", "verified": false, "helpfulness": "4/8", "author": "Janice Lichtenwaldt"}]