[{"rating": 5.0, "review": "Works good, although it is dependent on the wireless bandwidth available. Picture can stop then catch up but all in all I like the way it works!", "verified": true, "helpfulness": "0/0", "author": "kurt3228"}, {"rating": 3.0, "review": "Even if i have top speed internet worked lousy I don't use it anymore.", "verified": true, "helpfulness": "0/0", "author": "Erdem Orhun"}, {"rating": 2.0, "review": "Slow and choppy.  Use a regular HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Dan L."}, {"rating": 5.0, "review": "Very Good", "verified": true, "helpfulness": "0/0", "author": "mustafa"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "NATARAJ"}, {"rating": 5.0, "review": "I wish I would have bought one for each TV in the house. I recommend chromecast to all my friends", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "remarkable little caster. Crazy easy to set up. Steaming quality is very good. If you are casting to the device the chromecast will link up with your wireless network and automatically stram straight from the router to the unit which means there is no drain on your device's battery, and you can continue using any other aps on your device without affecting what you are watching. Only reason it did not get 5 stars is because the stuff that you can cast is a little limited, but with time google should remedy this.what keeps it a 4 star is the easy of casting loopholes that allow you to literally watch anything on the internet. If you cannot cast something, for example if you use Hulu but dont have a Hulu+ account (can only cast Hulu+ not free Hulu), you can mirror your device or computer. To do this download Google Chrome web browser, then install the chromecast app and bam, you can mirror anything to your tv that you can pull up in the Chrome browser.-mirroring from Google Chrome is not the same as casting from an app like Netflix or HBO Go, mirroring will drain the battery of your device, Or if it is a laptop the quality will degrade the further from the tv you move the computer. Picture quality is not as good either.Verdict: Great cheep alternative to apple tv, roku, or amazon fire stick. portable (travel on the weekends) and can take with you anywhere. easy of use and ability to find a way to cast anything makes this a strong buy recommendation. Dont  buy a smart tv, they are slow and expensive. update your old tv with a chromecast.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Wonderful. Its nice. Works good. No complications.", "verified": true, "helpfulness": "0/0", "author": "Lance S"}, {"rating": 4.0, "review": "It works well. I wish I had more control over the device as I am used to with my Android phones.I feel they could improve certain things like if it were having trouble streaming it would pop up a message on the screen and provide some tips to resolve it.", "verified": true, "helpfulness": "0/0", "author": "Nate Dizzle \"tech guru\""}, {"rating": 5.0, "review": "This thing rocks, I have 2 apple tv's , airport extreme, and all I really used them for was youtube and netflixUnfortuneately Apples remote app crashes every time you wake the ipads from sleep andyou end up having to restart the Remote App and reconnecting to the specific apple tv. (irritating and time consuming)Latest apple tv ios update did not addresss the issue. (unfreekin-believable) even though the forums are full of complaints.So I just ordered a second chromecast (because they work)Both Apple Tv's are now sitting in a drawer. (what a waste of money)If your like me and your main thing is youtube and netflixTHIS IS WHAT YOU WANT !", "verified": true, "helpfulness": "0/0", "author": "baby killer"}]