[{"rating": 3.0, "review": "I used this product for many months and it worked well. However, I had cause to compare the video output from the Amazon Fire TV to the output from my PlayStation 4 on both Netflix and Hulu Plus the I was surprised to see a dramatic difference. The picture quality on the PS4 was far superior and I have since started using that as my media box.", "verified": true, "helpfulness": "0/0", "author": "Paul T."}, {"rating": 5.0, "review": "Love it!  Easy to set up.  Easy to use.  I especially like the voice recognition for search.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great!!!", "verified": true, "helpfulness": "0/0", "author": "Nicola R."}, {"rating": 5.0, "review": "Super easy to set up and use!", "verified": true, "helpfulness": "0/0", "author": "SKM"}, {"rating": 3.0, "review": "Worked well but voice search only for Amazon video", "verified": true, "helpfulness": "0/0", "author": "nathan lake"}, {"rating": 5.0, "review": "love the Amazon Fire TV.  got it for my husband you can't find anything to \"watch\" on regular tv.  this allows him to browse Movies, TV series, Comedy etc.,  again love it....", "verified": true, "helpfulness": "0/0", "author": "Linda Riddlebarger"}, {"rating": 5.0, "review": "Love it!!!!", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "I travel full time and use my own verizon hotspot to connect wirelessly in my hotel rooms. Set up was a piece of cake. If you have just a little TV savvy it is very easy to connect to the hotel TV's HDMI port and use the manual inputs on the side of the TV to change the source. I picked it up when it went on sale, and I love the voice option on the remote. The only thing more that I could ask for is if it would emulate an Apple TV and allow me mirror from my iPad. Other than that I have no complaints whatsoever!", "verified": true, "helpfulness": "0/0", "author": "Mike Studley \"Mike\""}, {"rating": 4.0, "review": "So far I am liking it except there is no real way of quickly turning it off or putting it into sleep mode. I hope the add the button to the controller or add a sleep timer to it as well", "verified": true, "helpfulness": "0/0", "author": "Wesley"}, {"rating": 5.0, "review": "This is my first device of its kind and it's opened up many doors that I didn't know existed. It was refurbished but came looking and even smelling like brand new equipment. I'm a for ever fan of Amazon for more than just free two day shipping", "verified": true, "helpfulness": "0/0", "author": "Sis"}]