[{"rating": 5.0, "review": "Come on and buy it already!  I would have paid double and probably triple the price of this thing.  The biggest negative is on Amazon.  COME ON AND MAKE AN APP FOR THIS THING ALREADY!  Regardless, using the chrome browser you can cast your prime videos, and I was surprised to find out that when casting a tab with video, the sound plays on the TV!  I was under the assumption that the video would play on the TV but the sound through the computer.  NOPE... So that made it even better!", "verified": true, "helpfulness": "0/0", "author": "Heath"}, {"rating": 2.0, "review": "I find this device to be of very limited use. It essentially turns your TV into a smart TV but with some major restrictions.You control it with either the Chrome browser on a PC, an iPhone, or an Android phone. My wife has an iPhone but I have a Window's phone. I cannot Chromecast from my phone. As for Chromecasting from a PC I have to wonder what the point is - I get better results with an HDMI cable. Furthermore, it doesn't even work when I Chromecast from my old Dell Inspiron - I get a black screen. It's not uncommon for the device not to work at all and it can take several attempts to actually watch something.So we have two controllers: my wife's iPhone and my XPS computer upstairs. My wife is fed up with me borrowing her iPhone to use as a remote.It's an interesting idea, but for us it simply doesn't satisfy our needs. I'm waiting for one of our TVs to break so I can replace it with a smart TV. I think that's a better solution for us.", "verified": true, "helpfulness": "0/0", "author": "Math Addict"}, {"rating": 3.0, "review": "Works great out of the box, I am still trying to find the WOW factor when compared to other players.", "verified": true, "helpfulness": "0/0", "author": "Erika Tieko"}, {"rating": 4.0, "review": "It works well.  Wish it came with a remote though.  My kids don't have anything to sync with it.  So have to leave my phone.", "verified": true, "helpfulness": "0/0", "author": "janelle boyer"}, {"rating": 5.0, "review": "I'm changing my review from F+ to A+WHY?BecAuse I was a huge burr head and instead of figuring it out before I wrote review!Its actually a fine little device that I wouldn't want to be without!To ANYONE who goes by my reviews I apologize because I pride myself on honesty and research!When you get it home take your time to pair this to your devices whether it be tv phone or laptop.Its well worth the money!MY GRADE/RATING; AAAAAAAAAAA++++++MY RECOMMENDATION: RECOMMEND HIGHLY!!CatziyesAka: Kim Winningham", "verified": true, "helpfulness": "0/5", "author": "catziyes \"kim hames winningham\""}, {"rating": 5.0, "review": "So far so good works perfect with my Toshiba 65H84 65-Inch HD-Ready Rear-Projection TV with HDMI Input . It is easy to install.  You can watch any show , any website on your big TV instead of little screen on your laptop.", "verified": true, "helpfulness": "0/0", "author": "Chalo  L."}, {"rating": 5.0, "review": "The Chromecast is great.  A must have for any cable cutter", "verified": true, "helpfulness": "0/0", "author": "Dodrithard"}, {"rating": 4.0, "review": "Chromecast is a amazing device for most users.  For $30 you get a streaming device for most major sites, and it's simple to set up and use.  For more advanced users, it isn't quite where I'd like iy to be, but it's not bad at all.  Worth the price.", "verified": false, "helpfulness": "0/0", "author": "Michael R. Bednar"}, {"rating": 5.0, "review": "Perfect! Exactly what I was expecting.", "verified": true, "helpfulness": "0/0", "author": "A. McMillan \"phancykat\""}, {"rating": 5.0, "review": "Very easy to set up, nice wallpaper with time display while it waits for a streaming device.", "verified": true, "helpfulness": "0/0", "author": "M. J. Codding \"IT Guy\""}]