[{"rating": 5.0, "review": "AMAZAING!", "verified": true, "helpfulness": "0/0", "author": "neuronurse2003"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Tom Cooper"}, {"rating": 4.0, "review": "It took me a week to finally be able to download Netflix on it. I kept getting error messages. Now that it is fully functional, I love it.", "verified": true, "helpfulness": "0/0", "author": "Amanda Spain"}, {"rating": 5.0, "review": "Awesome selection, even the free ones through Prime. Can pretty much cancel the cable service now and save over $100/mth doing so. Buying this pays for itself.", "verified": true, "helpfulness": "0/0", "author": "astute"}, {"rating": 5.0, "review": "One downside is no HBOGo yet. :(", "verified": true, "helpfulness": "0/0", "author": "Scooby"}, {"rating": 5.0, "review": "An excellent value for the price...easy setup well made and shipped very quickly.", "verified": true, "helpfulness": "0/0", "author": "wwg"}, {"rating": 5.0, "review": "This is a good device I recommend this to anyone it's better than cable ;)", "verified": true, "helpfulness": "0/0", "author": "Keandra Fitz Life is full of roses"}, {"rating": 1.0, "review": "As I wrote previously, I was totally disappointed with this proct(s).  I sent one back because of it's failure to perform.  You sent me replacement which worked for a couple of days then failed. I returned both and recieved full credit.  I am leery about ordering another.  Maybe the FIRE STICK?  I'm not convinced.", "verified": true, "helpfulness": "0/1", "author": "Ludus Maximus"}, {"rating": 5.0, "review": "Awesome! Works great with my prime membership!", "verified": true, "helpfulness": "0/0", "author": "Matthew Budagher"}, {"rating": 4.0, "review": "Fire TV is great and great that it is free with prime.  Searching by pushing a button and talking is fantastic.  The biggest problem is that you have to drill down on each Movie and TV show to find out if it is free or costs extra.  The music is OK.  You have to get on your PC to include music in playlists.  Amazon needs to enable the Fire TV controller to manage playlists.", "verified": true, "helpfulness": "0/0", "author": "Old Manager"}]