[{"rating": 1.0, "review": "Needs further development. Not efficient,  inconsistent, unreliable. Takes a great amount of time to work(15+ min.),  given you that you can get it to work.  Unsatisfied and returned. To good to be true and is.", "verified": true, "helpfulness": "1/1", "author": "MallardManIII \"52 Greenys MATB\""}, {"rating": 5.0, "review": "...and the person I gave it to tells me it is awesome.  How much better can it get as a gift giver?", "verified": true, "helpfulness": "0/0", "author": "Supertronic \"Sotti\""}, {"rating": 3.0, "review": "It seems to be working perfectly but the only concern is limited application to stream on chromecast.no update on apps to add for watching videos or movies..only youtube netflix...i have an infinity app where i can watch tv or movies on my smartphone /ipad but not on tv...my room doesnt have cable connection thats why i watch on ipad thru internet...hope you can add more apps to chromecast...", "verified": true, "helpfulness": "0/0", "author": "Elmor"}, {"rating": 5.0, "review": "I bought this for my husband and I must say we love it.  We did not realize it had to be plugged in so that is helpful to know.  We use it for Netflix and Hulu and as long as the device streaming it is in the house it works wonderfully.", "verified": true, "helpfulness": "0/0", "author": "Penny Mack"}, {"rating": 1.0, "review": "amazon had a great return policy on this worthless product, difficult to install, it is NOT a plug and play, do not buy a sub developed product, with difficult installation for non-geeks, an HDMI cable would be much easier, never again", "verified": true, "helpfulness": "2/2", "author": "Learning Princess"}, {"rating": 5.0, "review": "This little guy is AWESOME!  This is not like Apple TV or Roku.  Those units are stand alone devices.  Google chrome requires another device to control it but only as a controller!  In other words, I use mine with my iPhone and Netflix a lot.  When I open the app, there is a little icon that you can toggle that will allow you to play a movie on your device or on your Chromecast.  When you select Chromecast (here's the major misconception by a lot of people) the Chromecast doesn't steam the video from your phone!  Your phone (or tablet or laptop) tells the Chromecast where to find the video you want to play out there on the internet and gets authorization to play the video.  After the video starts, you can close the app if you want to or leave your house or turn off your phone.  The video will keep playing directly off the internet until you tell it to stop of until it reaches the end of the video, whichever happens first.  If you do close the app, all you have to do is re-launch it and your device will open the controller.  From the controller you can play/pause, fast forward / rewind (via slider bar), back up 10 seconds, turn the volume up or down, change audio and subtitle settings, or put the video back on your phone.  The cool thing about Chromecast too is that if I start a movie with my iPhone and leave home, my wife can open her app and it will put a blue banner across the top of the screen.  If she were to ignore it she can just go about watching videos on iPhone, but if she clicks the blue banner, it will launch the controller at which point she can control what I casted on the TV.  Another cool feature, if you get more than one of these.  You could start watching a movie on the couch and decide you want to finish it in the bedroom.  All you've got to do is hit the cast button and tell it where to go and your movie will pick up right where you left off on your other device.  I mostly use mine with Netflix but have also enjoyed using it with YouTube, and even Google Play Music.  Oh yeah, almost forgot!  You can NOT browse the internet with Chromecast!  If you have a PC with Chrome you can \"Cast a tab\" which will make your TV mirror your computer screen just on the Chrome Tab.  In that case, you are steaming from your PC to the Chromecast and not getting info directly from the inet.  Hope this was informative!", "verified": true, "helpfulness": "0/1", "author": "johnme7 \"johnme7\""}, {"rating": 5.0, "review": "Can't go wrong with this in my opinion - I love android and google .....If you're going to buy a new tv/smart dvd player you may not find any use for this but if you have an older tv without smart functionality what are you waiting for buy it!New tv - Hundreds of dollarsApple - way too much in my opinion.Smart dvd player - $69Chromecast - $35I think the price and functionality speaks for itself.", "verified": true, "helpfulness": "0/0", "author": "Jordan Elison"}, {"rating": 1.0, "review": "I couldn't get to work as it was suppose to. I will have to get some IT help or pitch it.", "verified": true, "helpfulness": "0/0", "author": "Roger Pittman"}, {"rating": 2.0, "review": "Intended to exclusively use the Chromecast for you tube content because the price of the product is  attractive and the simplicity since I have encountered way too many technical problems with software changes on Plex and Videobuzz so my Roku can  stream the site.  Chromecast does not at all stream smoothly/coherently on my television whereas most channels streams fine with the Roku including you tube content when it was available through those channels. I gave this 2 stars because it is inconclusive that with a faster connection speed it could be functional. Unfortunately where I live  the internet infrastructure has been monopolized and service pathetically poor. On a good day you get only 25% of the speed you pay for most often much less.", "verified": true, "helpfulness": "0/0", "author": "jb65355"}, {"rating": 4.0, "review": "It works well but don't think it plays personal content unless you upload it somewhere first...... That being said it does play all the youtube vids I sent to it, and netflix too.  I understand there are many others but only really use those.", "verified": true, "helpfulness": "0/0", "author": "Freezing in the USA"}]