[{"rating": 5.0, "review": "Very nice, well price.", "verified": true, "helpfulness": "0/0", "author": "Denver"}, {"rating": 5.0, "review": "Great piece of equipment for my AV setup!", "verified": true, "helpfulness": "0/0", "author": "Jim"}, {"rating": 5.0, "review": "This is a very handy device.  We bought it a year ago and used it to cast video from our phones and tablets to the TV in the exercise room, where we had no TV hookup.  We've also used to it cast movies and TV shows to hotel TVs.  This year, we bought 2 more for our sons so they can cast content from their tablets and phones to the TVs in their rooms.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Love it, but does not hook up to stereo.", "verified": true, "helpfulness": "0/0", "author": "Adam"}, {"rating": 1.0, "review": "Didn't like it at all. First of all, this does not work with iOS, which is conveniently not mentioned in the product features. Secondly, the streaming quality was poor. I use a 20Mbps connection and still the video was choppy. This was of no use to me, since I already have a Smart TV and I can stream Netflix, Hulu Plus, etc. from it. Just wanted this device to stream videos from the internet, but wasn't satisfied with the performance. Returned it the very next day.", "verified": true, "helpfulness": "0/0", "author": "Chirashnu Mondal"}, {"rating": 4.0, "review": "One of my favorite inexpensive purchases.", "verified": true, "helpfulness": "0/0", "author": "Chuck Dyson"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "JEM"}, {"rating": 5.0, "review": "Great way to stream movies, videos and lots of other things from your devices.", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 5.0, "review": "Works very good with my nexus 7 tablet", "verified": false, "helpfulness": "0/0", "author": "sparkydale"}, {"rating": 5.0, "review": "All I can say is amazing! You can move it from tv to tv and place to place quickly and easy! Plus the price is awesome", "verified": true, "helpfulness": "0/0", "author": "courtney hahn"}]