[{"rating": 1.0, "review": "this product broke my $5000 TV and Google will not take any responsibility for it.  if you get one, you better test it on an old TV that you don't care about.  My video is gone and all i have is audio and a blank screen.", "verified": true, "helpfulness": "0/2", "author": "leanne noble"}, {"rating": 5.0, "review": "I love this product. Very easy to set up and use.", "verified": true, "helpfulness": "0/0", "author": "Mindy"}, {"rating": 4.0, "review": "It works well but google needs better apps!", "verified": true, "helpfulness": "0/0", "author": "Gorgeous"}, {"rating": 4.0, "review": "little hard to figure out but one you get it down. Its great cause I can take it from room to room.only gave it 4 star cause when first installing the device it hard to figure out what steps to take", "verified": true, "helpfulness": "0/0", "author": "angela williams"}, {"rating": 1.0, "review": "There was no detailed specification for voltage 110V la Korea and regret is not appropriate.", "verified": true, "helpfulness": "0/1", "author": "yang young jin"}, {"rating": 5.0, "review": "great  product", "verified": true, "helpfulness": "0/0", "author": "Gary Bonnet"}, {"rating": 4.0, "review": "We are avid projector users because we love a 12 foot screen :P  Our projectors are old and don't have sound output.  This causes a big problem when we want to output the visual to the projector and the output to the bluetooth speaker, but this doesn't have bluetooth for sound.... only HDMI for sound and audio combined.We rigged up a pretty peculiar setup to split the HDMI to s-Video and component sound.  However, we didn't have a receiver because we had been projecting from our laptop and sending sound to the bluetooth speaker.  We finally got a receiver, so it has the sound output to surround sound speakers and the projector gets S-video.On our other projector, we have HDMI to HDMI and AUX and the AUX goes to our old blue-tooth speaker and the video to our projector.  The other thing is that neither projectors have a powered HDMI (or S-video), so we also need a power cord to the chromecast.  For a tool that is supposed to help you go wireless, we now trip over more wires, lol!It's a good idea, especially for the projector that is mounted to the ceiling, but it's not the full package.  GOOGLE - YOU NEED TO ADD A BLUETOOTH OR SEPARATE SOUND OUTPUT!!!!", "verified": true, "helpfulness": "0/0", "author": "ABQ"}, {"rating": 5.0, "review": "Works better than advertised. I bought one and liked it so much, I have bought two more. My parents and brothers both bought them also. Great product at a great price.", "verified": true, "helpfulness": "0/0", "author": "Bryce"}, {"rating": 5.0, "review": "I love my Chromecast.  I told my local cable company (Charter) to stick it and I save sixty dollars a month.  I kept internet so I can watch online, shoot it to the tv.  I move the Chromecast from tv to tv.  You can power it through the power cord, or by a micro usb plugged into the usb of your tv if so equipped.  I have a power cord (usb or plugin) on every tv I use the Chromecast on so I just need to move it.  So easy.  Team it with Netflix and you will never go back to cable.", "verified": true, "helpfulness": "0/0", "author": "Diana L. Cooper \"bikealounger\""}, {"rating": 5.0, "review": "Ty.. You rock !", "verified": true, "helpfulness": "0/0", "author": "Alex Rosales"}]