[{"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Jessica"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Andre Luiz Rocha de Souza"}, {"rating": 5.0, "review": "Amazing", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best buy for the Money.", "verified": true, "helpfulness": "0/0", "author": "Brenda E Leverett"}, {"rating": 5.0, "review": "Love it.I like the fact that I can watch programs from you tube on it.Would definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Vidal"}, {"rating": 4.0, "review": "I have 2 of these, one was powered by the included adapter, the other off of the TV's USB port.  the one powered off of the adapter works great, the one on the TV's USB port was spotty at best.  I ran it this way for a few months before pulling my head out of my rear and running them both off of the included ac adapter.  After the switch, there is still the occasional drop of communication between the chromecast and controlling device, but it is no where near as frequent or problematic as when I was running it off of the USB port. if yours is giving you communication problems, or dropping the wifi connection and needing to be reset a lot, try using the power adapter if you aren't already, it might help, it did for me.", "verified": true, "helpfulness": "0/0", "author": "ramfan23"}, {"rating": 5.0, "review": "Pretty sweet little toy", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 4.0, "review": "Pros:It's nice to use wifi to watch videos and mirror desktopeasy to setup and useCons:delay when select higher resolutions (desktop mirroring)", "verified": true, "helpfulness": "0/0", "author": "Salah El-Din"}, {"rating": 5.0, "review": "This performs well alongside FireTV, Roku and Apple since it uses a phone or tablet as a controller. I am very satisfied.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I bought this to watch my Amazon videos that I own, rent, or watch from prime... Forget it. I researched for hours if there was SOME way........ Nope.Basically as MANY have stated here... They're other streaming choices that makes this useless. Roku is probably the best. I regret choosing this over roku. As for now I'm back to using my playstation for it has Amazon on it (everything that streams has Amazon Instant Videos except THIS! )Dear Chrome Cast........ \"Amazon Streaming!!!\"  And device home videos too.... SighIf you have NO streaming equipment an ONLY want to watch Netflix or YouTube that's pretty much it's use for video streaming worth noting (crackle? Sure, 1970's and 80's junk but that's even on roku) Pandora is a plus, to me the only reason I kept mine.", "verified": true, "helpfulness": "0/2", "author": "Angel \"acousticangel\""}]