[{"rating": 4.0, "review": "I brought 1 and it works great so I got another one to try on another TV which has only component inputs and brought a HDMI converter. It does not work with it. It would be a great help if Amazon would list what if any converters would work with the Kindle fire TV.  Also the Kindle Fire TV won't work with all HDMI cables if you plan to use a HDMI Switch.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Our daughter has both Roku and AppleTV devices and we weren't impressed, so we decided to get the Amazon Fire TV. Good choice. It arrived late yesterday and took no time for hubs to get it up and running. There was a short and clear video explaining how to use it with the remote. Netfix quickly installed and I logged on and found my wishlist, then navigated with no problems finding the same thing on Amazon Prime.Oh, and for you Comcast people -- no problem, because you connect via Wi-Fi. Using the remote control, you select your network from a list displayed on the screen, or enter it if need be, type in your password and voila!", "verified": true, "helpfulness": "1/2", "author": "Penelope"}, {"rating": 5.0, "review": "Not much to say other than I have owned about every type of box there is and I like this the best so far.", "verified": true, "helpfulness": "1/1", "author": "Ben Davidson"}, {"rating": 1.0, "review": "Fire TV doesn't allow you to watch your own videos from a hard drive or other your own medias. It basically only lets you watch online. They offer cloud for free for only 5 GB, which is not enough for even home videos.", "verified": true, "helpfulness": "7/19", "author": "al"}, {"rating": 1.0, "review": "Most cable and network TV station shows are not free. Amazon TV and Movie free movies are REALLLY old or obscure titiles. Confusing pricing and rate descriptions: buy, rent, etc, ...If I want to watch a show now under my Prime membership, why would I rent it?  What do I own if I \"buy\" it? Had to call Amazon to figure out what i would be charged for and what is included in Prime membership. The customer service rep didnt have his Fire TV turned on , so could only talk in generalities and compare it to Roku, which he had. Duh, can I have his job Amazon? Turns out if it says\"watch now\" its included in Prime. Who knew? Recent or First run movies can only be bought. Apps take a long time to load and when you click on content, always indicates that there is a problem connecting or you get a streaming spinning wheel indicating its trying to straeam but not going anywhere.. Apps Essentially worthless. Internet connection goes in and out, but always indicates that signal is strong. Amazons solution:  reboot your router. Did so, no improvement. If the internet connection is strong as received by the Fire device, why does it continually drop the connection? Ill be returning this before the trial deadline if it doesnt improve.", "verified": true, "helpfulness": "2/16", "author": "J. G. Fleming"}, {"rating": 2.0, "review": "The streaming service was down the minute I plugged it in. A system-wide problem, but what a disappointment. I didn't find it easy to use or navigate.", "verified": true, "helpfulness": "1/7", "author": "Jennifer Camp \"a fellow human\""}, {"rating": 2.0, "review": "It only plays 480p from the PLEX server app.  It is missing DLNA support.  You can't select Prime only on search.", "verified": true, "helpfulness": "1/5", "author": "Brent Barr"}, {"rating": 4.0, "review": "Love our Amazon Fire TV.  We also own a Roku and between the two, there is really no love-hate relationship.  We like both equally.  The only thing I would like to see on our Amazon Fire TV is my CLOUD stuff along with my MP3 cloud purchases.  I am really surprised to see that as a Prime member and Fire TV owner, access to Kindle, MP3 cloud and other info is not part of the package YET.  It's my understanding access to these is on the horizon and I am looking forward to an update of product soon!!  Otherwise, the ease of use, the slick and handy remote, the voice search and the apps are superb.  Highly recommend.", "verified": true, "helpfulness": "2/2", "author": "KNairn"}, {"rating": 5.0, "review": "Love Fire Tv. I'm catching up on Downton Abbey and Madmen. I LOVE it!! It's east to hookup. I did it all by myself.", "verified": true, "helpfulness": "0/0", "author": "Stacy Morris"}, {"rating": 4.0, "review": "I have to say I really like the ease of use of the Amazon Fire.  It was very easy to set up and works wonderfully.", "verified": true, "helpfulness": "0/0", "author": "arochom"}]