[{"rating": 3.0, "review": "Loved the chromecast, but its now obsolete due to the amazon fire player that is now out. the chromecast is dependent on another device to STREAM to this. The player is independant in itself, which is what i am using it for, to turn a non-smart TV into a smart TV!", "verified": true, "helpfulness": "0/0", "author": "Timothy Lake"}, {"rating": 5.0, "review": "I find Chromecast is a great value for my money. So far, I have been able to cast successfully pictures, music and video from my main home Dell computer, my Samsung Galaxy S3 smartphone, and my Samsung Galaxy Tab 2. My TV is Sharp Aquos Quattron 60\" smart TV.I am very pleased with the Chrome cast performance.I am looking to eliminate my cable TV in its entirety when my contract runs out in June. So far, I am on schedule, because of Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Danny Maynard"}, {"rating": 2.0, "review": "Great idea - but another example of an American-centric idea. Doesn't match or even comes close to Apple TV's capabilities and connectedness.", "verified": true, "helpfulness": "0/0", "author": "Jan Schlosser"}, {"rating": 2.0, "review": "Check to see if your router is compatible with this. I set this up and it worked fine. A month later i upgraded to a zoom router and this was no longer working.", "verified": true, "helpfulness": "0/0", "author": "jeff"}, {"rating": 5.0, "review": "We recently setup a small TV in our kitchen so we could watch TV while preparing big meals (and while cleaning up after having guests over for big meals).  We watch almost all of our TV shows via streaming services (Hulu, Netflix, Amazon...) so we wanted something that would cover a lot of the streaming services we use (note: we use the Chromecast for Netflix and Hulu, at the time of writing an Amazon streaming video app is not available for Chromecast).  We also wanted a device that would be inexpensive, not take up a lot of space, and easy to use while making meals or cleaning up.The Chromecast was an excellent surprise.  I must admit to being a bit skeptical due to its low price.  However once I got it hooked up I was impressed with both the quality of the video and how easy it was to use.  The convenience of controlling it with my phone is really nice, especially since my phone is always in my pocket.  I don't have to try to find the remote while I'm cooking or cleaning, I can just grab my phone out of my pocket, pick a show, and put it back in my pocket.  For the price I haven't found anything that beats this.  We are even considering getting one for our main TV just for the convenience of being able to switch from the Kitchen to the Livingroom without having to boot up a different device and find the show.I do have a few minor issues with the device.  One is that sometimes my phone doesn't stay in sync with Chromecast.  I'll start a show and need to pause it and find that I have to fiddle around with it a bit before the two talk to each-other again.  The other minor issue is that since the TV sits in a tight space next to the microwave, we have found that when we use the microwave it can interfere with the wireless.  This could be solved by using the extension cable and positioning the Chromecast further away from the microwave, but it is very infrequent that it gets in the way, so I haven't bothered to try.Overall it is a great device, I'm very pleased with it.", "verified": true, "helpfulness": "1/1", "author": "Serenity Horizon"}, {"rating": 4.0, "review": "This is good for the price but I would recommend purchasing AppleTV or Roku if their apps are compatible with your cable provider. Chromecast is only around $30 but there are only a few compatible apps, which make it very limited. Also, it's not a stand alone device like AppleTV and Roku. You need to use your mobile device in order to use Chromecast. I highly recommend AppleTV even if you don't have an apple device. I bought Roku and returned it mainly because it wasn't compatible with Xfinity and AppleTV had a lot more to offer, such as podcasts, radio stations from all over the world, and a lot more. I recommend Chromecast only if you don't have the money for AppleTV. Given the price is about 30% of the cost of AppleTV, it works great for the money but it's no where close to as special as its competitors.", "verified": true, "helpfulness": "0/0", "author": "Felipe Del Futuro"}, {"rating": 4.0, "review": "Works great, but sometimes it can not access the internet connection.  While staying at a hotel, I could not get it to go on line with the hotels wifi.", "verified": true, "helpfulness": "0/0", "author": "k4"}, {"rating": 5.0, "review": "It's about time I stepped into the 2nd decade of the 21st century! Streaming Netflix and Youtube wirelessly to my tv in HD is the coolest thing ever!This thing works great! I've been using mine for a couple of months now and have had no problems whatsoever.Who should get this? Anybody who is sitting on their couch (with a TV across the room) and is still watching any kind of video on their phone or tablet. Stream it to your TV with just the push of a button!", "verified": true, "helpfulness": "0/0", "author": "Matthew Allen"}, {"rating": 1.0, "review": "I have wasted more money than $35 on things and I have wasted more time trying to get some use out of a piece of worthless junk before, but nothing has aggravated me more, wasted more of my time and made me wish I had my money back all at once as this worthless plug.It installed easy enough and moved from one TV to another in the same home network. When we went to visit my mom and I used to show her a video on the internet of her grandson it worked fairly well, but mostly the streaming to this device was so broken up and choppy I would just shut it off. The worst part is the only way I could get casting to work was from a chrome browser and the video did not stop playing on the source web browser so you end up with two versions of the same video playing but the cast version on the TV is a second or two, sometimes more, delayed from the original. Now it is going in the trash can because after bringing it back home from  my mom's it won't reconnect to my home network. I am not computer illiterate either, I have been a hardware and software engineer for over 40 years.", "verified": true, "helpfulness": "0/1", "author": "Nickers52 \"starting from scratch again\""}, {"rating": 1.0, "review": "I'm not sure why others are having a good experience.  In my case, my wifi is just fine in the room where the TV is, but the chromecast netflix video is choppy and breaks up.  So Chromecast was a complete flop for me.", "verified": true, "helpfulness": "1/2", "author": "Stewart Kiritz \"bookish\""}]