[{"rating": 4.0, "review": "I was expecting this device to mirror my screen on my smart phones and ipods, which is my only complaint and wish.  Overall, we use this a lot for netflix and youtube videos.  In fact, we bought 2 more for our other tvs located in the living room and kitchen area.  This thing is just awesome and has a reasonable price in my opinion.", "verified": true, "helpfulness": "0/0", "author": "Graig Lumives"}, {"rating": 2.0, "review": "Really not happy with the Chromecast. At first setup was a breeze and streaming (or whatever the hell you want to call it) was working just fine from my phone/tablet/laptop.2 months later - I can't even get it to recognize my wifi network, connect or communicate with my network or devices. I've never unplugged the thing or renamed my SSID and the password is correct.I'd recommend just saving a bit of money and buying an Amazon Fire TV or something better.", "verified": false, "helpfulness": "0/0", "author": "Nicole"}, {"rating": 5.0, "review": "Everyone should own this.  It is ridiculously amazing.  Cheap, easy to use, works really well.  Just buy it!  There is no reason to get Apple TV and everything else people are getting these days.  Chromecast is cheaper and better!", "verified": true, "helpfulness": "1/1", "author": "Mikaela Z."}, {"rating": 5.0, "review": "This thing is probably the best device Google has ever released. I was able to add apps to my phone and computer's browser so I can browse shared movies on my home network that are in mv4 format and cast to the Chromecast. On top of this you have the standard ones like pandora, youtube, netflix, etc.. that all work great with your mobile device or tablet. If you get one, look up Videostream on the app market and also in the browser extension/apps. It is a great product that they have added tones of features to. Plays flawless to my TV that is on the opposite side of my house from my media computer.The way I use it is through Teamviewer on both the PC and phone and then I use my computer to connect to the Chromecast, while using the phone as a remote control. I have a tone of movies available and its easy/fast to start/stop/pause all without having to leave the couch to look for my factory DVDs.Can't recommend this any higher really. It is a must have.", "verified": true, "helpfulness": "1/1", "author": "IndyTom"}, {"rating": 5.0, "review": "Easy, compact and cheap! It's convinient for streaming content from netflix, youtube and more.It's not google tv. It mirrors content from your tablet or smartphone!", "verified": true, "helpfulness": "1/1", "author": "LEONARDO"}, {"rating": 5.0, "review": "Well worth the price. Love it at home for YouTube and other video apps on my TV. Especially love it for travel...an excellent way to watch Netflix where ever i go on large screen TV.", "verified": true, "helpfulness": "0/0", "author": "Neal Ketchman"}, {"rating": 3.0, "review": "I had this for my dorm room and it was great for watching youtube videos on the big screen, but when it came to anything having to do with iTunes (which is where all my movies and music are) then it was a no go. It was also a bit finicky to set up as well. If you have a chrome book then you are golden, my dad has one and he can do so much using the chrome cast. If you're on mac then you'll definitely have limited functions but I guess it's not all that bad for only having to pay $30.", "verified": true, "helpfulness": "0/0", "author": "Landry Sims"}, {"rating": 5.0, "review": "It is very easy to setup and easy to stream UTBE videos.Advise to buy it if you want to watch UTBE in bigger screens", "verified": true, "helpfulness": "0/0", "author": "ayngaran"}, {"rating": 1.0, "review": "No, did not perform the way I expected I was hoping to stream TV shows from ABC NBC and CBS", "verified": true, "helpfulness": "2/6", "author": "gene"}, {"rating": 3.0, "review": "It works.  It's easy to install and it easy to get it added to my network.  So far what I have used it for (Netflix, Youtube, Hulu), has all worked well.  Still need to play with other apps.  In some aspects, it's not what I expected.  I was under the impression you could stream anything from your computer, tablet, or iPhone.  Not the case.  I'll update this as I learn more about this device.  For now, let's just say it is useful for the above mentioned apps, but not for much else.", "verified": true, "helpfulness": "0/0", "author": "BigDInTexas"}]