[{"rating": 4.0, "review": "I am a real techie and I have been looking to incorporate my TV with my computer systems.  I had a Logitech Revue (Google TV) and thought it was really good for what it did, but it did have a lack of applications and was too locked down and not powerful enough.  I tried several of the Android Sticks, including Chromecast, but none of them really did the job well or had problems with certain apps.  I eventually just hooked up a Mac Mini, which is a good fit, but why do I need a small computer to run some apps, mostly Plex, and do some surfing?The Fire TV is definitely the fastest and most responsive of any of its competitors and there is quite a bit of memory, over 5 GB free, for apps and storage.  I am not a fan of having a separate ecosystem for apps, but it is ok.  However, some of the apps I am looking for are not available in the Amazon Store or not made for Fire TV yet.  I had to sideload some of the apps I wanted.  Some worked and some did not.  I am hoping more developers make their apps for Fire TV.One of the other annoyance is that certain functions are missing from Fire TV's Android implementation, like VPN.  It would have been great if Amazon just put their custom interface on top of Android and then just users do what they want, like any other Android installation.  I would also like the box to have an HDMI in and then passthrough the signal to the TV/receiver.  There are so many cool things that could be done if that were available.For now this is my go to box.  It uses much less power than a Mac mini and loads ultra quick.  Voice search is a waste unless you want to use Amazon movies and tv shows, but it is cool.", "verified": true, "helpfulness": "0/0", "author": "Brian S. Paskin"}, {"rating": 4.0, "review": "I switched out my old Roku for this and man this thing is fast when watching Amazon movies.  It is a little fast with Netflix then my Roku was but the Amazon content comes on almost instantly.  My only complaint is when watching amazon content, there is not a resume from beginning feature so I have to rewind it back to the beginning if I am re-watching something and did not let the credits play all the way through.", "verified": true, "helpfulness": "0/0", "author": "Yensid78"}, {"rating": 3.0, "review": "Sadly, It's only okay. I've given it a few months, and I'm trying really hard to get to like it - but it's a struggle.The good:+ Some things are fast - like starting a show is so quick compared to other devices.+ Seeing linked IMDB info is cool... I'd love to see this expanded.+ The remote is small and easy to use - however it doesn't use IR - so see below...+ Parental controls are a step in the right direction.The bad:- Generally hard to see relevant information on some screens. You have to dig in with lots of clicks on your remote... it's great in some areas, but not so great in others.- Very small irritation - you can't turn it off when you're done.- Sometimes it glitches out - particularly when i'm using an app. The only way to restart is to unplug the device.- Remote doesn't use IR: My universal remote cannot be programmed to control my Fire TV.- The main menu is an ever changing/flowing area. While it's good for featured content, I can't have an area where I want to go for certain apps i.e.: Netflix, Hulu, and have it be in the same place.- Voice Search is amazon content only - no tie in with other apps or as a keyboard replacement.The ugly:- Lack of apps (notably a good app to take advantage of Ultra Violet library - leaves a hole in the digital experience)- Many apps are clunky - unprofessional.- Hard to see full breadth of what's available. Especially just PRIME content. Sometimes I don't know what to search for... and you quickly run out of featured content.My wish list:1. Built in support for Airplay and Chromecast (is that too much to ask?) - (actually, not amazon's fault, but wouldn't it be nice to have an industry standard for flinging audio and video to various devices?)2. Voice search tie into apps... at least key apps like Netflix, Hulu, etc...A good start, and I'm glad amazon is in the game. I was just a bit let down.Whoever can make a device that isn't so bent on selling their own content, but actually builds a device that is customer centric, and and plays well with the other companies around (even if it's a competitor) will get my $$$ and do well. Ironically, I think AppleTV and less-ironically Roku are doing this a bit better than Amazon right now.", "verified": true, "helpfulness": "0/0", "author": "S. LEWIS"}, {"rating": 5.0, "review": "A great service....Far more better than Apple TV!  Highly reccommed!!!", "verified": true, "helpfulness": "0/0", "author": "Marc Andrew Downing"}, {"rating": 5.0, "review": "I replaced my Apple TV box with the Amazon Fire box, no comparison, Fire wins in every category . I researched the reviews, read the instruction books & still find no fault with this product. I've been a Prime customer since it's beginning, this is just icing on the cake for me.", "verified": true, "helpfulness": "0/0", "author": "Kenneth R Nunn"}, {"rating": 5.0, "review": "I will never go back to watching regular tv!!  I can begin a program on Fire TV & continue it on my Kindle anywhere in the house.  I LOVE IT!!!!", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "Where is the music Amazon? Received my Amazon TV yesterday and discovered after the software update that the Amazon music selection is still not present. I understand Amazon is rolling out a new update that supports this. Where is my update? My Apple TV supported this right out of the box. I find it strange that a company that wants everyone to sign up for Prime membership does not support the new Amazon prime music either on one of their products.Also their Dolby Digital Plus implementation is broke, it does not support Dolby Digital 5.1, I understand from reading on the forums that they are working on a fix. In the meantime the Dolby Digital Plus needs to be turned off for a receiver that does not support Dolby Digital Plus.All this and their screensaver bug that uses incredible amounts of data.This product is not ready for release.", "verified": true, "helpfulness": "1/1", "author": "Karl Anderson"}, {"rating": 5.0, "review": "This made a great fathers day gift.  I really liked it.", "verified": true, "helpfulness": "0/0", "author": "Chumpsey"}, {"rating": 5.0, "review": "Love it! So easy to navigate...would definitely recommend!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This has to be the most user friendly device out there!", "verified": true, "helpfulness": "0/0", "author": "Linda Furey"}]