[{"rating": 2.0, "review": "First off I actually really like this product.  It has the best parental control setup I have seen with Free Time and is very easy to navigate.  The problem for me is that the product has unresolved issues regarding bandwidth consumption.  I ended up having to return this.I have a data cap with my ISP and had to jump it up from 250/GB month to 350/GB and still would have gone over had I not shut it down at the end of the month.I was not using Mosiac for the ScreenSaver which is known to leech bandwidth.  The issue is that Amazon does not have a way to watch the free shows/movies in standard def --it defaults to HD unless it is a show where you payed for SD.The other issue is that Amazon caches content for fast loading based on what it thinks you might watch from your searching/viewing patterns.I really wanted this product to work out, and I will say that if you have kids and no bandwidth limits then this is a great product for you and works wonderfully.  But if you have data limits expect to run into problems until Amazon resolves these issues.", "verified": true, "helpfulness": "3/5", "author": "SB"}, {"rating": 4.0, "review": "I like the FireTV.  Honestly I bought it to create a very clean TV footprint.  I was working to get rid of my media players and cable boxes and move solely to a platform that you cannot see.  I wanted to see no wires, and I wanted no electronics in sight other than the TV.  I succeeded.I bought a streaming cable system with 3 tuners (HD HomeRun Prime) w/cable card.  I had a fast computer (Intel i7) running software that acts as a PVR (mythtv in my case).  After I got that all working I started to work with some software called XBMC that looked like a cable box interface with a full featured guide and the ability to schedule and playback recordings.  I read about my options for boxes to run XBMC.  The FireTV seemed like a natural choice given the computing power and the price.  Sure the rest of the streaming is awesome, but really I bought it to load XBMC.  It worked well, so well I turned in my cable boxes 1 week ago and cut my cable bill by $50/month and I still can watch all my normal sports, financial, news, and entertainment cable channels in HD.  Sure I'm a nerd, sure it is a little work to set-up, but I wanted a clean looking set-up.  Thank you amazon for building a small solid form factor.  I bought two of the devices.  People that I know are working to go down the same path as I..although they are using windows and windows media center.I love that the remote is bluetooth as I hid the FireTV behind the TV.  Now I have a TV hung on the wall without any electronics showing.My wife and kids have been very supportive of my little project.  While we often have cable playing we are streaming a lot from NetFlix, Amazon, and Hasbro.  Thank you Amazon for including the Hasbro channel, my little boy love transformers.  :)My only problem is the remote control for the FireTV.  It is missing controls to turn on/off the TV, and control the volume. I would be able to give it 5 stars if it had that.  If anyone could suggest a bluetooth & IR remote that can control a TV (via IR) and the FireTV (via bluetooth) for under $60 that would be awesome!Thank you!", "verified": true, "helpfulness": "2/2", "author": "Tom"}, {"rating": 5.0, "review": "I really love this product.  I was skeptical believe me - my Sig O has the Apple TV, which I find to be just so-so - he also recently purchased a smart TV which is pretty cool but above and beyond what I really need.  Enter the Fire TV - Amazon made it irresistible by offering a small discount and payment plan allowing me to really check it out and return it if needed, with no cost or risk.  The set up was a breeze, voice recognition is awesome - no issues using it and makes it so easy to find whatever you are looking for.  There is a wider selection of apps vice the Apple TV and if you sign up for prime you can watch several movies and tv episodes without paying anything additional.  I was able to reduce my cable down to basic and save money by using this as my primary go to when I want to see a movie or catch up on a tv series.  No complaints at all!", "verified": true, "helpfulness": "0/0", "author": "Kate D."}, {"rating": 5.0, "review": "Don't understand why I was charged another 99 dollars after I spent that on the amazon fire", "verified": true, "helpfulness": "1/2", "author": "Jackie McCallister"}, {"rating": 3.0, "review": "I have a couple Rokus, a couple smart TVs and a chromecast, but thought i would give the amazon Fire TV a try.  After now using it for a month or two, here are the things that i like/dislike about it.  TLDR:  i would buy another Roku if i had to choose again.1.  The menus feel like a jumbled mess--there is no way to \"pin\" apps that you use alot, and the interface just feels messy.  Ad another bar above the \"recent watched\" that we can pin apps in the order we want, or allow us to pin them to the sidebar.  I understand they are pushing their own content over apps, but there should be a way for us to customize the interface.2.  The method of fast forwarding/rewinding is kind of annoying compared to the Rokus.  You press the button and it jumps forward/back ten seconds, or you can hold it down to fast forward/rewind but its hard to stop at the point you want to, and while you are fast forwarding the video itself keeps playing.  This is especially annoying when watching a TV show late at night, and trying to fast forward through the intro song to keep the sound down.  On the roku, it pauses the video and you can see the frame that you will be skipping to.3.  There is no way to rate videos that i can find.  I was watching some of the Amazon Original content shows, and wanted to rate them so that it would help them get chosen for further production, but apparently you have to go to a computer to do that.4.  The search function only shows Amazon content unlike the Roku, which will tell you if your search is available on any of the other services.  Again--i know they want to push their own content, but leaving this feature out seems kind of petty.  We are going to look on those other services anyway, why not make it easier for us?  I thought i read back in April that they were going to fix this, but it still isnt available on my Fire TV, so im guessing it was abandoned.5.  Games/Apps are lacking and generally pretty poor in general.  Some of the ones that say they work with the the FIre Remote do not actually work with it.  I dont have a controller for it, so maybe that makes some of the games work a bit better, but that doesnt make up for the lack of good apps available.6.  Wheres the promised HBO go app?  I know there is HBO content available, but not the new shows.7.  Why is the watchlist not split for TV and Movies like it is on apps (like the amazon app on the Roku!).  I would prefer if there was a TV watchlist and a movie watchlist.8.  For some reason, when i am a few seasons into a show, if i click on a recently watched show, i have to manually go find the episode i last watched, and start it from there.  If i try to \"add to watchlist\"  it will automatically remove itself from the watchlist.  Then a few days later, it will all of sudden start remembering where i was, and start working again.9.  On the good side, the controls are snappy and quick.  I have noticed very little lag, and videos do start pretty fast.  The feature that pre-loads content makes me a little nervous with my data cap, but i havent noticed any issues with that yet.10.  I also wish it would show the price of the content in the scrolling list, instead of having to select the movie and go into the info screen just to see the cost of it.  And on new released movies, there should be a tag on the cover to show if its rentable, or just purchasable.  Or even have 2 different scrolling lists for these.  I hate when i go to rent a new release, and find that its only available for purchase for 20$.  A \"newly available for rent\"  list would solve this issue easily.", "verified": true, "helpfulness": "24/25", "author": "JAA Hoaas \"Bug\""}, {"rating": 4.0, "review": "Pros : Fastest multimedia box on the market right now.  Easy to use.  Works great with Netflix, Hulu Plus, and of course Amazon Prime.Cons : It's relatively new right now so it lacks as many apps as I want, such as crunchy roll and a web browser.", "verified": true, "helpfulness": "0/0", "author": "Frank P Gillette"}, {"rating": 5.0, "review": "I love it. We also have a ROKU that was given as a gift a couple years back. I prefer my fire.", "verified": true, "helpfulness": "0/0", "author": "Micheal P Cooper"}, {"rating": 4.0, "review": "I have only had this for a few weeks, but so far I love it.  My only problem is that the HDMI cable seems to come loose without anything happening.  I will be listening to Pandora and all of a sudden there is no sound.  If I wiggle the HDMI cable, it starts playing again.  It's not a cheap cable either, so I don't think it's the cable.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "Randy"}, {"rating": 5.0, "review": "I had an issue getting it to detect my wifi. It wouldn't let me sign in, so had a guy come help with it and found out that is was the hyphen in my password that it wouldn't take so changed the password and haven't had any issues with it from there. The hubby is really enjoying it. He like the voice recognition. I've not had the roku or anything else to compare it to, but overall we are enjoying the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Karen McCall"}]