[{"rating": 5.0, "review": "Best 35 bucks i ever spent on home entertainment! It's easy to install and portable. If i go over someone house it goes with me", "verified": true, "helpfulness": "0/0", "author": "Jernard Gatling \"DA MAN\""}, {"rating": 3.0, "review": "It's premise is good yet very limited and somewhat complicated. Still would be a good classroom tool to extend visual aid of a computer. It's just not ready to play movies.", "verified": true, "helpfulness": "0/0", "author": "Ralph Tucker"}, {"rating": 4.0, "review": "If you are getting away from the financial noose of the cable companies, this device is a great way to add shows from your browser (like regular Hulu, Nick, Netflix) or just pictures and such.", "verified": true, "helpfulness": "0/0", "author": "Stevedog"}, {"rating": 5.0, "review": "Very easy to set up and worth every penny. Now I blast my music from my phone from anywhere around my house. I can even cast my chrome browser and watch movies by just pressing a button. Convenience at its best.", "verified": true, "helpfulness": "0/0", "author": "Mastayugi91"}, {"rating": 2.0, "review": "problem with conect to tv.it takes at least 15 minutes to conect. an during this 15 minutes tv is restarting unstopable", "verified": true, "helpfulness": "0/0", "author": "sixaraaaa"}, {"rating": 5.0, "review": "Now I gotta get used to using Chrome Browser…. not a bad thing, but being a mac guy now…  I understand the two sides to every device and gotta weigh it out for your own experience that U want", "verified": true, "helpfulness": "0/0", "author": "James"}, {"rating": 1.0, "review": "Right from the beginning I had trouble getting the chromecast to connect.  I did the things the troubleshooting said to do and was able to get it to connect and finish set up. The very next time I tried to use it it wouldn't work.  I've had to reset it, unplug it, try the power adapter, try the usb, try the hdmi extender, monkeyed with my router settings, even tried a different wireless network all only resulting in it MAYBE working for an hour at best and most times it still won't connect at all. The chromecast isn't far from the router so it's not a distance issue. I hate this thing and really need to look into returning it.  It's great while it's working but since it never works it is awful.", "verified": true, "helpfulness": "1/2", "author": "anthony J. Koester \"MrSeLfDeStRuCt\""}, {"rating": 5.0, "review": "I moved away from standard TV companies about a year ago and my family has used a Wii for the past year to stream Netflix and Hulu+ to our TV.  After looking for a backup plan for the inevitable day that the Wii dies I read up on Chromecast.  After receiving it in the mail we started using the item.  First thing I loved over the Wii streaming, the HD quality of the shows.  You can stream from your cell phone or tablet, sometimes we even use our home PC.  You can stream (slower speed) google chromed websites from your PC.  My wife hadn't planed to ever use it, but says she has used it at least once a day ever since we got it.Pros: HD quality, easy to useCons: If you have an older phone that cannot update to newer firmware (mine is an older phone that cannot update past gingerbread) you may be able to run the Hulu+ app on your phone, but it is a version of that app that cannot stream to chromecast.  Guess it might be time for a new phone.Con:  If you have kids that want to control what you are watching, we find it easier to have it on the Wii, I don't need chocolate and jelly all over my phone (my 5 year old taught himself how to stream from the PC though)", "verified": true, "helpfulness": "0/0", "author": "Son of Archness"}, {"rating": 5.0, "review": "When I first got my Chromecast it was not very stable with the wifi connection, however after moving the CHromecast to an MHL HDMI port on my tv it works great and never drops a connection.", "verified": true, "helpfulness": "0/0", "author": "P. Demers"}, {"rating": 5.0, "review": "So convenient and tiny I recommended this product to the fullest. Great product google hopefully in the future you guys will add more apps.", "verified": true, "helpfulness": "0/0", "author": "TH821"}]