[{"rating": 4.0, "review": "Amazing quality.  I gave only 4 stars because it won't broadcast everything. I can't get it to broadcast my dish network, not sure if it is not able or I don't know how to do it.", "verified": true, "helpfulness": "0/0", "author": "BEA BA"}, {"rating": 3.0, "review": "The product work well with the website like Youtube. However, not when you cast on the chrome tab. Often get delay. Overall, a great product. Should be good if you have both Chromecast and HDMI cable.", "verified": true, "helpfulness": "0/0", "author": "Dat Do"}, {"rating": 3.0, "review": "Ordered two of these  turned out that the products just really didn't work for me but kind of stupid that I have to pay to ship these and the adapter power cables back separate though they are going to the same place and all came in the same package.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "It is 1 of the best gadget I've purchased this year!", "verified": true, "helpfulness": "0/0", "author": "Tracy"}, {"rating": 5.0, "review": "Bought this for my husband, we are all loving it.  So great for family movie night and streaming workout videos.", "verified": true, "helpfulness": "0/0", "author": "Aimee Cayer"}, {"rating": 5.0, "review": "Love my Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Branson E."}, {"rating": 5.0, "review": "When I first heard about Chromecast I was really excited because I very rarely watch TV in real time. This allows me to display videos from my laptop or iPhone right onto my TV so seamlessly. It works really well and it's super easy to use. It's also really inexpensive for what it offers. I can't compare it to the other similar products, because I've never tried them, but I highly recommend Chromecast!", "verified": true, "helpfulness": "0/0", "author": "gettingdown2business"}, {"rating": 5.0, "review": "For $30 this is a steal! Anything I can do on phone,  tablet and laptop,  the chrome cast will Mirror effortlessly, all you need is a TV with hdmi and WiFi.", "verified": true, "helpfulness": "0/0", "author": "Eric kuan"}, {"rating": 1.0, "review": "Worthless piece of junk.don't buy this unless you need more frustration and disappointment in your life.", "verified": true, "helpfulness": "0/1", "author": "PDQ services"}, {"rating": 1.0, "review": "Can't get it to work!", "verified": true, "helpfulness": "0/1", "author": "Pops"}]