[{"rating": 4.0, "review": "Have youtube and netflix on my tv but this loads in a 1/4 of the time. Plus control with your phone or laptop is sweet.", "verified": true, "helpfulness": "0/0", "author": "D.B."}, {"rating": 5.0, "review": "For $35 this is the best value O have come across all year. It is mobile and easy to use. Great product. With all the new technology available today I will be cutting my cable TV cord in November when my contract expires and will never turn back. Thank you for a great and inexpensive tool Google.", "verified": true, "helpfulness": "0/0", "author": "STEVE MIHALY"}, {"rating": 2.0, "review": "Packaging was off the chain, but for using it's ONLY PC USE. Too bad.I guess I'll have to try to bring back the old PC just for TV.", "verified": true, "helpfulness": "1/3", "author": "Kim Fagan"}, {"rating": 4.0, "review": "its so simple to use . now i hope you will get some other things tied into it, like hulu, blockbuster...then it wouold be over the top.....", "verified": true, "helpfulness": "0/0", "author": "joe gloudemans"}, {"rating": 4.0, "review": "Simple, small and easy to set up. A good replacement if not buying the apple TV. Reception is poorer than the apple TV.", "verified": true, "helpfulness": "0/0", "author": "Quick"}, {"rating": 5.0, "review": "When I connect my smartphone to the TVs HDMI to watch a movie or videos, the display will always be substandard even though the signal is HD. So when I purchased the Chromecast, the most important to me was display resolution. What I get from the Chromecast is whatever the Smartphone signal resolution is what you get at your HDTV. So overall, I am more than satisfied for the price and product and most of all the YouTube video lessons I able to digest.", "verified": true, "helpfulness": "0/0", "author": "MARIO G TOLENTINO"}, {"rating": 3.0, "review": "Works great but it is very limited in app support.  This will become really useful when the native screen sharing from any app or even the base OS (Windows, Android) is automatically enabled..,", "verified": true, "helpfulness": "0/0", "author": "Vali"}, {"rating": 5.0, "review": "Just does what its supposed to do, and does it well!The only thing I miss is more chromecast enabled apps!", "verified": true, "helpfulness": "0/0", "author": "Espen Erlandsen"}, {"rating": 3.0, "review": "Works well with it's current limited functionality, enough so that it gives me hope of what can be done with it soon.  Currently music and movies have to be thru Google Play but not on the device - only uploaded or purchased.  It's a start.  Also works well with youtube apps on my iPad, my Nexus 7 and my Droid phone.  Tried working with Chrome browser with some success but much more trouble.  Not really worth pursuing yet.  I'm sure they will get it there.If you are a heavy Play purchaser or upload your music to google play it allows you to send the audio and video through the TV or amplifier.  For the price that's a good start.", "verified": true, "helpfulness": "0/1", "author": "Robert Bray"}, {"rating": 5.0, "review": "I just tested out my Chromecast. I love it. It's easy to set up and simple to use. I like that I use my phone as a remote and it didn't eat up battery life.  I wish I would have this thing in college.", "verified": true, "helpfulness": "0/0", "author": "N. Clifton"}]