[{"rating": 5.0, "review": "Love it.  Bought 2, one for the main TV, one for a bedroom.  Both TV's are HD.Added so much to the families viewing.Programmed the smart phones, iPad and Kindle to do the Chromecast.We were viewing Netflix via Wii and that was ok, but with Chromecast we pull HD off of a DSL line.Fantastic HD resolution and very, very little buffering.One downside, now need TV controller, DVD, etc and now another device for Chromecast.Smart app would be a single device to control the TV, VCR, DVD and coffee pot", "verified": true, "helpfulness": "0/0", "author": "California Ed"}, {"rating": 5.0, "review": "I would have rated this 5 stars if the Chromecast would allow you stream local videos to your TV. That would have made it a 5 star review.", "verified": true, "helpfulness": "0/0", "author": "ahmed alothman"}, {"rating": 4.0, "review": "Works really well.  Does everything as advertised.  The only issue is that it's not quite obvious that you can't \"chromecast\" web pages from a tablet/phone.  That only works from a desktop/laptop running chrome.  But, you can still push youtube, etc from an Android device.  Once the api for this thing goes live, it's gonna be amazing.", "verified": true, "helpfulness": "0/0", "author": "M. Jody Brookover"}, {"rating": 1.0, "review": "The _only_ reason I ordered this was to Tab Cast on my iPad 2.  I have IOS, Chromecast App and Chrome App up to date but I still can't find a way to do it.  The casting tab only comes up when I go to YouTube so far (useless for me), not any other web pages.", "verified": true, "helpfulness": "0/0", "author": "Duke"}, {"rating": 4.0, "review": "I would have rated this 5 stars if the Chromecast would allow you stream local videos to your TV.  That would have made it a 5 star review.", "verified": true, "helpfulness": "0/0", "author": "Julio Luis Hidalgo"}, {"rating": 4.0, "review": "Great item. Would have given it 5 stars if you could stream local content from android device. Hope google sort this out soon", "verified": true, "helpfulness": "0/0", "author": "tony whittle"}, {"rating": 5.0, "review": "I am very happy is a excelente product.I like because i can see movies, you tube, and listen the music.", "verified": true, "helpfulness": "0/0", "author": "Ivan Vasco \"Ivan Vasco\""}, {"rating": 3.0, "review": "Works OK  but there are just not very many apps / options for this yet .  They need to get more sites on board for it to be a great unit.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Simple and effective. Does the job. Which it would support VPN but there are ways to get around this within your local home network so no big deal. For the price it's a steal and the future.", "verified": true, "helpfulness": "0/0", "author": "Eigres"}, {"rating": 5.0, "review": "Even better than I thought it would be. I thought I would at least use it some, but now I use it all the time", "verified": true, "helpfulness": "0/0", "author": "Brad"}]