[{"rating": 5.0, "review": "I bought a Chromecast after watching the product since launch and reading many reviews for the product. With the recent addition of Hulu plus HBO Go, Songza, and several other supported apps, i decided to jump on board. Chromecast has quickly become our preferred method for streaming content to our television.I have been especially impressed with the beta feature for casting a Chrome Browser tab. I have used this feature to show off pictures and other content from my Dropbox accounts and for several other web-based services. I have also found tab-casting to be a life saver for watching streaming episodes from network TV sites like CBS and Fox (which do not have chromecast support for their apps, fingers crossed). Although the tab-cast doesn't always work perfectly, its a great way to get a huge variety of content up on your tv. Waiting for the chrome mobile browser cast option!", "verified": true, "helpfulness": "0/0", "author": "Brady Phipps"}, {"rating": 5.0, "review": "I gave this as a gift for Christmas and they love it...I think I will get one for myself to use with my ipad", "verified": true, "helpfulness": "0/0", "author": "minerva hopkins"}, {"rating": 5.0, "review": "All I expected and more. Easy to use. Does exactly as advertised. If your TV doesn't already have apps built in, this is a very cool accessory.", "verified": true, "helpfulness": "0/0", "author": "James A. Hyler"}, {"rating": 1.0, "review": "Honestly I will change this review once google makes it better since I can see the potential, but right now it doesnt do much at all.  If you don't own any of the number of devices already available to most households that stream (ps3, wii, xbox, roku, appletv, most actual tvs, etc), really no point in getting this right now since those devices probably do it better.  The ability to cast youtube is cool but most devices with youtube apps already support this.  Also the ability to cast screens is choppy and doesnt do casting your screen justice.  Apple tv def handles this better.Also doesnt support streaming content from your own media server which is a huge minus that other streaming devices currently support.Google removing the ability to root and mess around with what chromecast can do also removes the interesting innovations that couldve been possible with the device.Bottom line:  Its cheaper than almost everything else out there, but pretty useless unless all all you need it netflix and youtube.  Spend another $50 on some of the other devices and you can get a lot more out of what you spend.", "verified": false, "helpfulness": "1/3", "author": "Madan Soundar"}, {"rating": 1.0, "review": "An hour of frustration is an hour of my life I will never get back. It should have been straight forward. I entered in my network password. It would not work. No support. I'm sending it back.Besides, Google probably uses it to spy on me anyway.", "verified": true, "helpfulness": "0/3", "author": "Ignatious O'Reilly"}, {"rating": 4.0, "review": "This works great for youtube but as most reviewers have pointed out it needs more apps.  When I cast from the chrome browser there definitely is a delay and it tends to crash.  Hopefully google allows more apps to take advantage of it.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 4.0, "review": "I love the chromecast. The only reason I gave it 4 stars and not 5 is because whenever I cast from my iphone it freezes. When I cast from my computer it's fine but I can't get it to work with my phone yet.", "verified": true, "helpfulness": "0/0", "author": "steve mann"}, {"rating": 3.0, "review": "I am a cinephile nut with a pair of Roku's, a Boxee box, Samsung internet access on my blu-ray player, and a great 7.1 Onkyo receiver (that I only have 5.1 on so far) with a HD33 1080 projector from Optoma.  I added this Chromecast to an extra port on my receiver and it's easy to access and throw things at it from Youtube, Netflix and a few other offerings.  I am wondering if having my HDMI port where I have it installed is perhaps not the best place as I do seem to get some choppiness in my video streaming, where I don't via any of the other internet wired or wireless ways I have to play from.  Will have to play with that, if moving it out front changes anything.  The fact that my receiver has a HDMI port in the front will allow me to play with that and also make the device more portable for me as well since I am thinking it will be of benefit for my use of broadcasting from my laptop or cell phone at a friends TV.  The chromecast app works well on my LG Android phone, and the Chrome extension on my laptop works well also.I only wish I could do more with it.  To be able to play video files direct from my laptop, and not have to run them through a browser, would be a great feature.  Also, the requirement to have to power it via a USB port seems cumbersome.  Is there no power capability through HDMI itself?  Perhaps not.  Anyway, would like to do a lot more with it, so keep it's support coming and bring on the additional apps!!", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer \"William\""}, {"rating": 1.0, "review": "Have tried with laptop and Surface. Both running Windows 8.  No joy.  Love the idea, wish I could use it.", "verified": true, "helpfulness": "1/3", "author": "Dave Johnson"}, {"rating": 5.0, "review": "What can one say? Google made a great device. It is small, simple to set up and easy to use. A very simply way to experience to internet and streaming media in the living room.", "verified": true, "helpfulness": "0/1", "author": "Xander"}]