[{"rating": 5.0, "review": "Chromecast is extremely useful for me.  I like watching Netflix/Youtube a lot and this makes it possible to quickly stream on my HD tv.  I love that the volume is switched to the television.  There is NO compromise of picture quality or sound.  The picture and sound are so clear that I prefer using it instead of my laptop.  The only problem with the device I have is that Java is not supported.  Therefore when I want to cast a Java encrypted animation or something or play games, it won't show up on the screen.  I'm sure they will work on these things to improve though.", "verified": true, "helpfulness": "1/1", "author": "Joe Rhodes \"JR\""}, {"rating": 4.0, "review": "This is a very clever gizmo and has made our master bedroom TV available to Netflix, etc. for just $35.  Only reason I gave it four stars is because I have to \"cast\" to the TV from my laptop (we don't have a smart phone) which is in another room (my office) across the house.  Yeah, I could move the laptop into the bedroom so we can pause, change shows, etc. at bedside.  However, setting up the machine on a folding tray every time we want to watch something in the master is just as inconvenient as my having to step into the office to do the same.  We still like the device no matter the inconvenience.", "verified": true, "helpfulness": "1/1", "author": "Steve Frenzl"}, {"rating": 4.0, "review": "The idea behind the chromecast is a great one. However, the execution leaves a bit to be desired.Pros:-------- Easy streaming- Very small device- Controlled via smartphone- CheapCons:-------- Very limited content, this should get better now that the dev kit is open to everyone, but currently it basically just supports netflix and youtube which isn't enough.- Problems streaming. Many people have run into problems streaming with the chromecast where the picture doesn't come through- Each use I have to activate the chromecast app, then access netflix- Requires separate USB power (should pull this directly from the HDMI slot)- A little slow and clumsy to useOverall it is an interesting concept, but I ordered an Xbone to handle my media services because the chromecast just doesn't do enough to be particularly useful at this time. In a few months when more app support is available some of these issues may be resolved, but the stability of the product is still likely a deal breaker for me.", "verified": true, "helpfulness": "0/0", "author": "Hostage67"}, {"rating": 5.0, "review": "This is awesome, can't wait for more apps to show....but great for my man cave and the streaming is great", "verified": true, "helpfulness": "0/0", "author": "Ryan Himeda"}, {"rating": 5.0, "review": "Great tool, works wonderfully at streaming videos from my laptop to our TV. At times, the framerate can drop, but for the most part it works great! There is a delay between the laptop display and the projected image, so if you're using it as a live projector (for a presentation, for example), then you'll have to realize that there is about a 3 second delay.", "verified": true, "helpfulness": "0/0", "author": "Arturo Donate"}, {"rating": 5.0, "review": "This thing is cheap and supports local streaming of content.  Also, unlike most other similar products, casting content from your phone or tablet makes browsing a pleasant experience.  I bought two.  Also, I use BubbleUPnP to steam local content.", "verified": false, "helpfulness": "1/1", "author": "Jared"}, {"rating": 5.0, "review": "I travel a decent amount for work, and most of the places I stay have relatively new LCD TV's.  That means they have HDMI and usually have a powered USB port.  If not, I always travel with a cheap household extension cord and use the USB to wall adapter that's included with the chromecast.I primarily use this for HBO GO, and sometimes Youtube/Google play purchases.  I haven't used \"tab-casting\" from my laptop very much, but the few times I did mess with it, it seemed to work fine.As iOS continues to allow more and more apps to function with the chromecast, I think it will continue to be an increasingly useful streaming stick.", "verified": true, "helpfulness": "0/0", "author": "aophil"}, {"rating": 5.0, "review": "Very simple to use. Makes watching Netflix on my TV 1000x easier. I have bought 3 of them so far and will most likely buy more in the near future. It also makes a great gift because it is sold at such a low price. Thanks Google!", "verified": true, "helpfulness": "0/0", "author": "chris"}, {"rating": 4.0, "review": "I really like having netflix to use on my tv whenever I want. I love the easy access of using it. I didn't give it 5 stars because of the available apps. There isn't enough apps in my opinion. I would like more options on my chromecast. The other reason I only gave 4 stars is because every once in awhile it hangs and I have to close the app to get it to respond to the movie I'm watching like to pause or play. It will get hung and won't respond. I like the app but there is a few bugs here and there. Would still recommend to purchase if you like to watch Netflix it is perfect for that.", "verified": true, "helpfulness": "0/0", "author": "Srshenderson"}, {"rating": 3.0, "review": "Since you cannot get netflix to work on chrome on a mac because of the silverlight issues, you cannot watch netflix if you only have a macbook.  I am not a smart phone or tablet user so i am kind of out of luck with this thing. works great for youtube, and that is a nice feature, so i will keep it.  If it were more expensive I would have sent it back.  If i become a smart phone user someday, i think it will be really great to use with netflix.  if google would fix its issue with netflix it would be awesome. I had a nice chat with a tech at netflix and he said they would be soon changing some things so it would work with chrome better. Great idea, great price, not great if you don't have a smart phone.EDIT: They seem to have fixed the silver light issue. It works great now, but I honestly don't use it much now that I bought an Amazon Fire TV stick. Still a cool device.", "verified": true, "helpfulness": "0/0", "author": "Sarah Jean \"Srahahui\""}]