[{"rating": 2.0, "review": "I plug it into the TV and get the home page on the screen but it I am told there is no wifi Internet connection.  I have other devices connected to my wifi but for some reason this device is not recognized.Gave up trying it just sits there.  Waiting for my son in law to come to help.  Maybe I am just computer illiterate.For me it was a waste of money.  I can not recommend it to anyone.", "verified": true, "helpfulness": "3/3", "author": "Walter A. Krenisky"}, {"rating": 5.0, "review": "This is one of the best items i could buy loads of fun...plus the price is great...evrryone should have one.", "verified": true, "helpfulness": "0/0", "author": "Alfred Richardson"}, {"rating": 4.0, "review": "It will be nice to use it with more feature like other programs and be able to see other applications", "verified": true, "helpfulness": "0/0", "author": "ruben"}, {"rating": 1.0, "review": "Either the chromecast itself or the chrome browser app crashes and your are done.Unless your restart your tv or pc multiple times.", "verified": true, "helpfulness": "1/1", "author": "ASTRALZEEKE \"AMATEUR D'ART\""}, {"rating": 3.0, "review": "Inexpensive and works as advertised. However, it's rather restrictive as to what you can watch with it. It doesn't support Amazon Prime Instnat Video. It does support Netflix nicely though. Also, while it does work using an Android phone or tablet (I have a Nexus 7) a remote would be less cumbersome and more convenient for the family to use. I sort of wish I had waited for the new Amazon FireTV.", "verified": true, "helpfulness": "0/0", "author": "David S Matthews"}, {"rating": 5.0, "review": "it is the coolest thing to be able to broadcast something from my computer onto the tv so that we all don't have to huddle around the cramped office to watch something interesting.  works well for us and has been great.", "verified": true, "helpfulness": "0/0", "author": "Russell R. L. Harms \"travelr64\""}, {"rating": 1.0, "review": "Never expected google to put out total garbage like this.  It simply does not work...at all.  If you are lucky enough to get it to work momentarily it will overheat.  If you are not lucky it won't connect at all.  Really makes you wonder what google is doing.  How can a company like google sell a product that flat out does not work?!?!  What is going on folks?", "verified": true, "helpfulness": "0/0", "author": "jason black"}, {"rating": 4.0, "review": "I bought it since it was on sale for $30. Even though I haven't seen too many uses yet, I know There are apps being made for Chromecast that will diversify how the product will be used. I can already use it with Flixter to play some of my movies.", "verified": true, "helpfulness": "0/0", "author": "enrique589"}, {"rating": 1.0, "review": "Pretty much a dissappiontment... Doesn't interface with amazon prime, and seems to always have connection issues/times out with other services... I would definitely recommend other devices over this...", "verified": true, "helpfulness": "0/1", "author": "Samantha A. Smelko"}, {"rating": 5.0, "review": "Love it because it works with my mac, pc, android and works with others iphones. If you want to cast I highly recommend this. Several updates have made it even better.", "verified": true, "helpfulness": "0/0", "author": "G-MO"}]