[{"rating": 5.0, "review": "Google got it right with Chromecast.  They say it takes about 15 minutes to set it all up.  Took me about 5.  Plug this sucker into your HDMI port, plug the power into your TV USB (or optional standard wall plug if you don't have USB on your TV) and you're all set.  The Chromecast app finds this little device and you're watching programming in no time.  I use Netflix streaming service with Chromecast and it works perfectly.  A+.", "verified": true, "helpfulness": "0/0", "author": "Hotgravy"}, {"rating": 1.0, "review": "If you are looking for a way to stream Netflix to your TV from your iPhone or Android device via the Netflix App, this is useful.  For all other types of streams, don't even bother.I bought this specifically for the Chromecast from Tab function with my browser.  To say that is blows is an understatement.  Not matter what stream I try, I never get any audio.  I can only get the video to stream.  Then when I try and make the video full screen, the stream just freezes and stops working completely.I've owned this thing since November and Google still hasn't gotten it to work, and I don't see any developments on their end to try and address this basic functionality.  Since I have a Roku, I don't need Netflix.  I want to stream online sports matches that are on my NBC website but aren't on Cable.  I bought Chromecast to do this, and it has failed miserably.  I might as well throw it away.", "verified": true, "helpfulness": "1/1", "author": "Shane Labuzan"}, {"rating": 5.0, "review": "I love this little thing. I love it so much, I bought one as a stocking stuffer for everyone in the family over last Xmas. By now everyone knows what this device does and doesn't do compared to the Rokus, Apple TVs and Fire TVs. For that reason, I will not get into an extensive comparison (but point out only major differentiators). My review is solely based on my experience with the Chromecast, devoid of any expectations set by its more expensive competitors.--------------The Good--------------Setup was a breezeThings you will need right away to set this up: A TV with HDMI-in, an extra power outlet near the TV or a USB port on the TV (to power the Chromecast) and a WiFi-enabled network (broadband preferred). If you have your Android or iOS device handy, download the Chromecast app - that's a huge plus. I plugged in the Chromecast into the TV, downloaded the Chromecast app onto my iPad and followed the on-screen instructions to set it up. I was up and running in less than 3 minutes.Size MattersThe Chromecast is as small as a USB thumb drive. It neatly hides behind our big screen TV. Plug it in and forget about it. You have one wire for powering the device, which can be plugged into any open USB ports on the TV itself or into a wall using the wall charger.Good hardware+good firmware = Good QualityPicture quality has been consistently top notch for me with a variety of apps. I mostly use the Youtube, Vevo, HBO, Netflix and Real Player Cloud apps and have never had any quality issues. A thing to note here, the quality of your network will have some bearing on the quality of your stream and thus the picture quality on the screen. We have a high speed FIOS connection and consistently get full HD picture.So easy a caveman could do itThis is by far the biggest reasons I rate this a 5-star. Just about everyone these days owns a smartphone or tablet. Launching apps, choosing videos and playing them on these devices is as easy as it has ever been. Casting a video (or other supported content) from a compatible app on your Android/iOS device only requires two additional steps -1) Switch your TV to the HDMI port where the Chromecast is connected2) Find the small Cast icon within the app and click it to send your Chromecast-supported content to the TV.Penny saved = Penny earnedThe Chromecast costs $35 retail and sometimes $28-$30 on sale at B&M; stores. That is a hard price to beat.No device discriminationWorks on iOS, Android and Windows apps (including desktop-based Chrome browser). Ok fine, they discriminated against the 12 Blackberry users out there. Google search tells me there are ways around that too.No perceivable battery drainSince the content isn't actually streaming from the device where the cast originated, there is no battery drain. Once the casting is initiated, you can even just turn off your Android/iOS device (you will need it for playback control, however)--------------The Bad--------------'App'sentWhile the number of apps supported is steadily growing, it has not exactly rained content. As of the writing of this review there are still only a handful of \"officially supported\" apps for Chromecast. It covers some of the bigger usecases for online media but clearly absent are apps like Amazon Instant/Prime Video, WatchESPN, TEDTalks, Slacker, iHeartRadio and others.* Some older reviews have pointed the lack of support for local media. This can now be fixed using apps like Real Player Cloud or Plex. Real Player Cloud is free (but has limited content playback support), Plex is a paid app but supports many channels in addition to local media files.BrowsercastI tried browser casting via the desktop Chrome browser a few times and found it buggy and eventually gave up. Also, it's not the most convenient mode of usage (for me anyway) unless you want to sit with your laptop by you for control while watching content on your TV. If and when Google decides to enable this feature for the mobile Chrome, I will be willing to give this another shot.Doesn't respond to Gary BuseyWe all know Gary Busey likes to speak to inanimate objects (re: Fire TV commercial). The chromecast doesn't have a remote nor any sort of interactive voice search/navigation ability. Personally, this doesn't bother me. I love using my touchscreen phone/tablet interface way better than using any lousy remote but this is a matter of personal taste and so some people may be put off by the lack of options. Gary Busey for one.------------------------------I hope this review helps the readers make an informed decision.", "verified": true, "helpfulness": "0/0", "author": "DigiSym"}, {"rating": 5.0, "review": "They work just fine.  I bought three.  One for the kitchen, one for the family room and one for the home theater room.  No problems.", "verified": true, "helpfulness": "0/0", "author": "Q"}, {"rating": 5.0, "review": "I got this thing while thinking of cutting cable.  I can say it does what it says.  I use this with a Nexus 7 tablet (works with my phone  (nexus 4and 5)and my wife's (some android model not needed as it is a android 4.0 or newer) as well and other products examples iphone/ipad/computers both mac and windows).  I use this to cast netflix, Hulu Plus, Vudu, crackle and hopefully very soon aereo.  I will say for the most part the chromecast works well, i do see from time to time some artifacts (the blurry, fragmented picture on the screen).  I assume that the artifacts are caused by the interface with the wifi signal/ the lack of signal/ little hiccups that will be solved soon (hopefully).Pros: Unit was easy to setup, price is very good (except you need a tablet or some similar to run it (see there list of millions of products that work with it.)  I was able to cut the cable tv from my house with the help of this guy ( so a win for me)Cons: only the random artifacts/hope they add more apps soon.", "verified": true, "helpfulness": "0/0", "author": "Empiror22"}, {"rating": 3.0, "review": "Need to use Chrome web browser, not as \"universal\" as I had hoped for. Options are very limited unless you subscribe to a paid movie appZero Linux support, Not Open SourceI will look for another wireless device", "verified": true, "helpfulness": "0/0", "author": "Peter"}, {"rating": 4.0, "review": "Only issue I ever have is connecting to internet. That's more than likely a problem on my end... i.e. not being close enough to the router. But it works great whenever I have good connection!", "verified": true, "helpfulness": "0/0", "author": "Bentley Corbett"}, {"rating": 4.0, "review": "Had some issues installing.  Ended up moving my router within 20 feet, because it doesn't work reliably farther away.  The casting is weird.  Every time you do a new tab or page, you need to recast.  Not a true browser environment on the TV, but since I didn't buy it for that, it's ok.  Have some problems on startup of the TV.  It doesn't always recognize that the network is connected. The workaround is to cast any page to the TV and then it seems to work.Overall, we have been able to watch lots of movies from Netflix, so it was worth the $35 instead of getting a smart TV.  Chromecast needs to work on some of the quirks, though.", "verified": true, "helpfulness": "0/0", "author": "Susanne Shalit \"susanq99\""}, {"rating": 5.0, "review": "I dont use it a whole lot but when i do im very thankful for it. Only beef i have with it is that the quality on the screen dosnt come out as good as i would like it to but that could have something to do with my wifi.", "verified": true, "helpfulness": "0/0", "author": "Matthew Meredith"}, {"rating": 4.0, "review": "I love this product makes it so easy to cast to your tv . The  negative thing I found was certain formats like avi videos won't cast and I can't cast web pages from my Android tablet, if it did this I'd give it 5 stars anyway I'm going to still buy 2 more of these.", "verified": true, "helpfulness": "2/2", "author": "christopher allen"}]