[{"rating": 5.0, "review": "a little hard to install but well worth it", "verified": true, "helpfulness": "0/0", "author": "readim75"}, {"rating": 4.0, "review": "This is an awesome little gadget that works great with most phones. The only bad thing about it is that you must have a phone to operate it. It is not a stand alone device. I  say this incase you want to install it in your children's room, and they do not have a device to operate it with.", "verified": true, "helpfulness": "0/0", "author": "Gabriel Medina"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "David W Spencer"}, {"rating": 5.0, "review": "Super", "verified": true, "helpfulness": "0/0", "author": "Jothi prakash Santharam"}, {"rating": 5.0, "review": "Must buy for netflix, hulu, youtube lovers to watch on the big screen from their phone.  One of the best things I have ever bought in life!!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Vo \"- jennifer\""}, {"rating": 5.0, "review": "Awesome little gadget.", "verified": true, "helpfulness": "0/0", "author": "Terol Stauffer"}, {"rating": 5.0, "review": "Worked so good,  I bought 3 and I am also recommending this item to friends and family.", "verified": true, "helpfulness": "0/0", "author": "Evelyn Delgado \"Ed\""}, {"rating": 5.0, "review": "Very good!", "verified": true, "helpfulness": "0/0", "author": "ximena"}, {"rating": 5.0, "review": "I love being able to push video from my phone to the TV. Have one at home and a few in the office. If you are watching a video on the web (any video, not just YouTube) a Chromecast is great because you can push it to the TV from the Google chrome browser. A lot of mobile apps also support it.If you're looking for something standalone to watch Netflix/Amazon (without a mobile device or computer) a Roku is better suited. But most mobile apps support Chromecast, such as Netflix, ESPN, etc. It seems that mobile apps send the Chromecast a link to stream the video directly (behind the scenes), so the quality is good.My only gripe is no support from Amazon video. Not Google's fault though. Amazon seems to refuse adding support to goat customers into buying their Fire Stick. So Amazon streaming currently doesn't work, unless you stream your Chrome tab on your computer, which the quality will suffer because it's actually streaming the video frames from the computer. For the living room where the Chromecast lives I use a PS3 for Amazon, but I use a Roku for the smaller TV.", "verified": true, "helpfulness": "0/0", "author": "Luke"}, {"rating": 4.0, "review": "Excellent value for the money.", "verified": true, "helpfulness": "0/0", "author": "Praveen Gattu"}]