[{"rating": 5.0, "review": "My wife and I don't care much about current TV programming, so fire fits the bill. Also we don't use a DVR so we get to catch episodes of some shows that we missed on our schedule.Never had a performance issue yet. Streams like network TV even with Netflix. I do wish they would mark the \"Prime\" free shows and pay shows more clearly. Feels like Amazon is doing a bait and switch sometime.", "verified": true, "helpfulness": "0/0", "author": "Patrick T. Long"}, {"rating": 3.0, "review": "I bought this when I went to the USA (I'm a european resident) since I heard so much good things about it. I have an AppleTV and Chromecast already, but the price of these things are so cheap that I just had to try it out.My setup at home is with a Logitech unversal controller, and for some reason the controller doesn't work with the FireTV. I've been able to get the iPad app (Harmony) to work with it, but the Logitech remote controller seems unable to do so. That leaves me with two controllers again which is a minus.There is no way to choose a time zone outside the U.S. when setting it up - while that is no big deal, I find it kind of weird to put a restriction on that.There is no way to change part of the IP settings, either DHCP or fully manual (e.g. just change your DNS settings, but keep the IP through DHCP is not possible)Apart from that, the box is great - the performance is way better than chromecast and appletv, and if you have an Amazon Prime account, it adds even more value to the purchase.I like it, but if they had fixed the IP and timezone issues I would have given it more stars - if they had fixed the universal control support, I would have added another one.", "verified": true, "helpfulness": "1/1", "author": "Steinar Watne"}, {"rating": 2.0, "review": "Amazon huckster product.", "verified": true, "helpfulness": "2/6", "author": "Robert N. Veeder"}, {"rating": 5.0, "review": "Awsome", "verified": false, "helpfulness": "0/0", "author": "Mario"}, {"rating": 2.0, "review": "Yet another unstable, unreliable set-top box.  Amazon put a good interface on here and the chip is fast (same processor as the Galaxy S4 Phone), but this box will occasionally forget how to connect to the network, even if plugged in directly via CAT5. So, you have to reboot it.  Or, you'll be running the netflix app, so you'll have to reboot it. Or, you'll be running the plex app and won't be able to access your network shares, so you'll have to reboot it. You get the picture.  At least this device isn't one of the ones from China with a noisy fan and a nonfunctional remote.", "verified": true, "helpfulness": "5/5", "author": "andre2142"}, {"rating": 5.0, "review": "I love  Amazon Fire!  It is really slick.  It is so easy to set up and use.  It has a great interface.  The voice search option actually works.  No special enunciation is required.", "verified": true, "helpfulness": "0/0", "author": "RJ \"RJ\""}, {"rating": 3.0, "review": "We finally decided to get rid of cable. I carefully reviewed device options. One big selling point for the Amazon Fire that I saw in Amazon's comparison chart against other devices was that it came with ESPN. Great, I thought, hubby won't have to miss out on ESPN. Then it turns out you can't actually use the ESPN app unless you have cable. What???? The whole point of getting a device like the Amazon Fire is that you are getting rid of cable! If we had cable we wouldn't need to watch ESPN on the Amazon Fire.Also, we use HuluPlus and it freezes ALL THE TIME. Our internet speed greatly exceeds Hulu Plus requirements. I am starting to suspect it's the Amazon Fire based on other comments.Also, the voice search is useless unless you have Amazon Prime which we don't want.", "verified": true, "helpfulness": "1/1", "author": "D's mom"}, {"rating": 5.0, "review": "The Amazon Fire TV ran easier out of the box than I've found Apple TV did.  I only complain about the cost of movies: they're about $4 down to $2 where I expected free!  Now why is that?  Its because so much of your advertising promised it, I thought.  I've gradually gotten more familiar with the program and I like it better than Netflix already.  It seems more natural to me, even though I'm sure I'll like it better as I learn to use it more.  My wife and I have watched it a number of movies already, many more than we did with Netflix, even though I haven't found a free one yet.", "verified": true, "helpfulness": "1/2", "author": "Larry Tynes"}, {"rating": 1.0, "review": "Bought amazon fire tv after rave reviews from friends. I've had it for probably 2 months and now it won't play netflix. Slowly losing faith in amazon.", "verified": true, "helpfulness": "1/6", "author": "Robert Ruffner"}, {"rating": 5.0, "review": "i really enjoy it theirs a lot of movies to watch", "verified": true, "helpfulness": "0/1", "author": "randall redmon"}]