[{"rating": 1.0, "review": "It is very unresponsive! It freezes and I have to reset it many times. I use it from an Iphone 5S. Maybe using an android device could work better...", "verified": false, "helpfulness": "1/1", "author": "Felipe Torres"}, {"rating": 5.0, "review": "Really nice streaming device. Good for Netflix, youtube and other streams services.The only con is that there are only few apps on google play.", "verified": true, "helpfulness": "0/0", "author": "Filipe Ribeiro"}, {"rating": 5.0, "review": "This device has been great for me and keeps getting better. This product is not only reasonably priced, but also works great and allows me to watch streaming tv from netflix, hulu and hbo go as well as others from any tv with an hdmi port. It's even portable so I can take on on the go too. Great Job Google way to learn from your past mistakes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Be aware that some network access points (many or all hotel wifis, some mifis) are set to disallow communications between devices on the same access point. If you do not have control of the access point and it is set to disallow traffic between clients (e.g. \"Set AP Isolated\" on ASUS routers), it will be very, very difficult to make Chromcast work.", "verified": true, "helpfulness": "0/0", "author": "loghlr"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "yscgroup"}, {"rating": 5.0, "review": "Excellent affordable media device.  Not the best, a bit buggy but for the price, it can't be beat.", "verified": true, "helpfulness": "0/0", "author": "RS"}, {"rating": 4.0, "review": "It's great for the price. I wish it allowed amazon prime instant video viewing, but I'm sure amazon hundred that option, to promote their own streaming device. Other than that, it's a good product.", "verified": true, "helpfulness": "0/0", "author": "Rockwell"}, {"rating": 3.0, "review": "It is an okay product. I thought I can stream games with this, but no I can't.", "verified": true, "helpfulness": "0/1", "author": "Martin"}, {"rating": 4.0, "review": "I wanted the Chromecast to be my answer to life's greatest mysteries. Alas, it has fallen short and I only use it to stream Plex and play Pandora. The potential for this product is amazing, and the price cannot be beat for a streaming HD device, so I am firm at 4 stars - but I really WANT it to be 5! Audio tweaking is needed for Plex, but overall it is pretty solid.What I wish it could do :Second screen with iPad - It really needs this capability, do not limit to just Android.Stream as a dedicated HD monitor on a PCMore capable web management - this device has the capability to run as a PC itself, why limit it? It would be a great solution for media servers/extenders in home theaters to replace with this device and a dedicated media server stored somewhere else if it could just do more and you could install or package apps for the device itself (give it storage!).", "verified": true, "helpfulness": "0/0", "author": "Jason Blalock"}, {"rating": 4.0, "review": "Still trying to figure it out.", "verified": true, "helpfulness": "0/0", "author": "JOHN VANBUSKIRK"}]