[{"rating": 5.0, "review": "It does everything I want!  I specifically bought it so that I can mirror Major League Baseball from my Kindle HDX to my big screen tv.  It was very easy to set up and I can watch MLB on a big screen, rather than on the small Kindle HDX tablet.", "verified": true, "helpfulness": "0/0", "author": "William B. Sears"}, {"rating": 5.0, "review": "I love it.  I cancelled my movie channels.", "verified": true, "helpfulness": "0/0", "author": "1misunderstood"}, {"rating": 5.0, "review": "Fire TV delivers what is advertised and I love it. Connection and set-up are simple. Logging into my router and into Amazon was required only once (during set-up). After the initial set-up one merely has to turn on the television and press the Fire TV remote. The streaming is uninterrupted and provides great picture and sound quality. Compared to another brand of streaming video devices that I own, Fire TV wins hands down. Amazon alone has thousands of TV and movie options and Fire TV is the perfect companion to my Amazon Prime account. There are plenty of other options for streaming video, but I haven't explored all of them - Amazon has provided plenty of selections so far. Fire TV will replace my cable TV when the cable contract expires.I have yet to try out the voice search or using my Fire tablet in conjunction with Fire TV, but am pleased to have those options.", "verified": true, "helpfulness": "1/1", "author": "S. Elliott"}, {"rating": 5.0, "review": "USE ON ONE TV SET AND FIRE STICK ON ANOTHER. BOTH WORK WELL & FAIRLY EASY TO USE WITHTHE GUIDE BOOK FOR THEM. I AM A PHYSICIAN NOT AN ELECTRONICS GEEK, THOUGH DRS. ARE HAVING TO BECOME COMPUTER SMART NOW-A-DAYS, BUT i CAN USE THIS AFTER USING GUIDE BOOK. RAG", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 4.0, "review": "Happy to be able to watch movies etc. but we thought there were more movies FREE of charge as well as music.", "verified": true, "helpfulness": "0/0", "author": "Bubbyx3"}, {"rating": 1.0, "review": "most of the programming of interest is pay for view. I will not be renewing Amazon fire in the future.", "verified": true, "helpfulness": "0/1", "author": "David N"}, {"rating": 5.0, "review": "What a great addition to our media center.  Love the interface, so much easier to use!", "verified": true, "helpfulness": "0/0", "author": "Toddd L. Tomlinson \"Todd Tomlinson, Author\""}, {"rating": 5.0, "review": "Simply put it's great.", "verified": true, "helpfulness": "0/0", "author": "Mark Vaughan"}, {"rating": 3.0, "review": "It was working well almost 11 months now but now  having a lot of sound and visual issue. Trying to get it replaced!!", "verified": true, "helpfulness": "0/0", "author": "Tico"}, {"rating": 2.0, "review": "I purchased FireTV because of the high specs, but I still use my Roku2 because it works better.  I have frequent buffering on FireTV that I don't have with the Roku.  I hope Amazon updates the OS soon to address this problem.", "verified": true, "helpfulness": "0/1", "author": "Jack Gentile"}]