[{"rating": 5.0, "review": "So far we have really loved this.  Do not hesitate to order this.  There is nothing to dislike.  Order Amazon Prime and you will have to much good TV to watch with no end to it.  It works like charm.", "verified": true, "helpfulness": "0/0", "author": "SJD"}, {"rating": 5.0, "review": "I have really enjoyed watching  the three seasons of \"Downton Abbey.\"Fire TV even remembers my location in the series.  I look forward to many other free movies.I am wondering why I even need cable any longer.", "verified": true, "helpfulness": "0/0", "author": "Faye"}, {"rating": 5.0, "review": "one of the best things I ever bought!!!!!!!!!!!!", "verified": true, "helpfulness": "0/0", "author": "John Smothermon"}, {"rating": 5.0, "review": "Love the Fire TV, makes it easier to navigate through Amazon and Netflix movies and really like the voice activated control.", "verified": true, "helpfulness": "0/0", "author": "Stephen J."}, {"rating": 5.0, "review": "Best purchase I have made in a long time.  This thing keeps me up all night!", "verified": true, "helpfulness": "0/0", "author": "quintin w. parker"}, {"rating": 5.0, "review": "I LOVE THIS PRODUCT!!!  Just The \"Voice Search\" Alone Makes The Whole Thing SO COOL!!!  HIGHLY RECOMMENDED OVERALL!!!  The Remote Is MUCH SMALLER Than A Standard Remote SO DON'T LOSE IT!!!", "verified": true, "helpfulness": "0/1", "author": "Charles Larson"}, {"rating": 4.0, "review": "It's a wonderful tool for watching tv.. Easy to set up...however should have come with a hdmi cable", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Best voice recognition program I've ever worked with.", "verified": true, "helpfulness": "0/1", "author": "Evil Ei \"State of Evolution\""}, {"rating": 5.0, "review": "really enjoying the fire tv.  much easier to use than the Roku.", "verified": true, "helpfulness": "0/1", "author": "Ed Cheek"}, {"rating": 5.0, "review": "Have absolutely loved my Fire TV! This is my first actual streaming box. I had been looking at different ones for a long time. When I saw the option for amazon fire tv and read about it, I immediately decided to go with it. It has not disappointed. In fact, it has exceeded expectations. I don't know what to expect with other players, so can't compare, but I know I am completely satisfied with this one.", "verified": true, "helpfulness": "0/0", "author": "bfly_gal"}]