[{"rating": 2.0, "review": "Only good for Netflix and YouTube streaming.  I would not have ordered it with such limited use (my TVs already have wireless internet access).", "verified": true, "helpfulness": "0/2", "author": "Chris"}, {"rating": 5.0, "review": "Worked out of the box and could not be happier. It is a well made product. I am overall pleased with the products put out by Google.", "verified": true, "helpfulness": "0/0", "author": "USer"}, {"rating": 5.0, "review": "Worked as advertised, easy to install, had it up and running in about five minutes. I highly recommend it. I am getting another for my kids.", "verified": true, "helpfulness": "1/1", "author": "richard wood"}, {"rating": 2.0, "review": "Dont plan on plug and play..I figured it would be a quick process...it wasnt for me...also my slow internet connection didnt help.I was primarily looking to watch You Tube on my flat screen..it just was more complicated than i was willing to invest. Maybe othersare loving it, however, i sent it back.", "verified": true, "helpfulness": "0/3", "author": "olgitpicker \"douglas bryan\""}, {"rating": 4.0, "review": "really great purchase, tried it with YouTube and works like magic :) but It really need a GOOD Internet connection", "verified": true, "helpfulness": "0/0", "author": "Ahmed"}, {"rating": 1.0, "review": "Update: spent a lot of time on phone with google support.  they could not determine why could not be configured to work from a macbook air running mountain lion...  works fine from an iphone or ipad....I have now spent more than 1.5 hours trying to set this up.  I am very tech savvy and have tried all kinds of \"configurations\".  Samsung TV show Set Me Up, 4 digit code, name of Chromecast, etc.  downloaded the chromecast setup app.  it finds the chrome cast.  shows that the chromecast is on one of my networks. but then every time get the following message: \"We canʼt seem to connect to \"ChromecastXXXX.\" Make sure your Chromecast is powered on and nearby and that you are not on VPN.\"..... nothing works... rebooting computer, router, etc.  nothing works.  have searched all over the internet and not found any answers....  may have no choice but to return....", "verified": true, "helpfulness": "4/6", "author": "kettleman"}, {"rating": 5.0, "review": "This device works seamlessly with my setup from tablet to computer to phone. Love how easy and little to no setup is needed. Recommend setting it up on the computer first", "verified": true, "helpfulness": "0/0", "author": "Casey J. Monson \"Casey J Monson\""}, {"rating": 5.0, "review": "Had a laptop that Netflix and hulu where all I seemed to use it for, ran hdmi cable across the room so I could control from the bed, got his little bad boy and have not had to use my computer at all. Both me and my wife can tie into it from our phones if I leave she can take over and use her phone as the remote. Streaming is fantastic quality, super simple to set up, now supports hulu plus, and I taught my completely technotard mother how to use it, if you can use Netflix on your phone you can use this guy. Just hit one button and blam", "verified": true, "helpfulness": "0/0", "author": "bakerbread"}, {"rating": 3.0, "review": "works as advertised however I did not find it as easy to setup especially using a windows 8 computer that kept dropping the connection, it worked much better with a nexus tablet. If you want to play Netflix, you tube, google movie/music its fine as for casting a browser that did not work for me.", "verified": true, "helpfulness": "1/1", "author": "Peter Iancic \"pete\""}, {"rating": 5.0, "review": "Finally came in & got to set it up. Very easy to use & fun if your using the chrome browser. It wont replace the Apple tv, Little Black box but will be used along with them. For the price cant go wrong.", "verified": true, "helpfulness": "1/1", "author": "Ace S. Tanoue"}]