[{"rating": 1.0, "review": "Hooked up a vista laptop to a 46 in. Sharp and streaming video on the screen was jerk- jerk- jerk. Totally useless. What a waste of my time and money. Grrrrrrrrrrrrrrrrr.!.", "verified": true, "helpfulness": "0/4", "author": "KIMO"}, {"rating": 4.0, "review": "I love what it does but tieing in to your wifi and you are able to broadcast anything from your phone, tablet, or desktop laptop onto your hi def tv. What it did not like was the fact you have to power it by plugging it in.  I though it would get it's power through the hdmi. The power cable has mini usb which was pretty flimsy and since it was in my side hdmi port on my tv, that mini usb snapped and i had to replace and that is what powers the device.", "verified": true, "helpfulness": "0/1", "author": "Q"}, {"rating": 5.0, "review": "Like i said this is an amazing device.dummy proof set upeasy to use and I think it took less than 5 minutes to set upNow I can stream youtube and netflix..No hassle of wiresOn top of this look at the Price very nice ..", "verified": true, "helpfulness": "0/1", "author": "Wsm"}, {"rating": 4.0, "review": "Watching youtube in a TV was never easier. I know people complain about the limitations but c'mmon it just works. I have not given 5 star because its not quite useful for audio I think, it does not play music which is not uploaded to Google Music.", "verified": true, "helpfulness": "0/0", "author": "SoulMan"}, {"rating": 3.0, "review": "Should have done my homework first. If I had known you couldn't stream from Amazon Prime I would gave never bought it. That was the sole reason for buying it.", "verified": true, "helpfulness": "1/2", "author": "stacey farrell"}, {"rating": 5.0, "review": "1. I have one plugged into my stereo - play my Google Music, Netflix and home videos on the large screen - google play and nexus 7 and Chromecast work great together - I have an Apple TV but have stopped using this - keeps signing me out and having to use their control to input my password is a huge pain.2. I bought an audio/hdmi splitter on Amazon (ironically costs more than the chromecast), and plug the audio into the aux  of stand-along music player in another room - figured if I'm subscribing to Google Music I might as well get full use of it.3. Third one is plugged into our bedroom tv with the usb power coming off the TV itself, that way I don't have the annoying light on all the time on the chromecast.I was a die hard Apple fan, Airport extreme, itunes and AppleTV - not any longer, all sold off", "verified": false, "helpfulness": "1/1", "author": "J R Hartley"}, {"rating": 1.0, "review": "Purchased it with high expectation. Nothing as good as roku.Slow buffer. Only quite a few programs. It's still on early stage.", "verified": false, "helpfulness": "0/5", "author": "Qian"}, {"rating": 5.0, "review": "Not gonna lie; I didn't need a chromecast but having one is a sweet delicious luxury. Sinfully easy and barbarously fun thanks Google", "verified": true, "helpfulness": "3/3", "author": "Nic Walker"}, {"rating": 1.0, "review": "They don't show you that you need to somehow power up this piece of plastic crap... then once you get everything plugged in, it fails to work with apple ipad, then it bombed on my notebook....what a piece of crap....worse 35 dollars I ever spent...plus I bought a second one for a vacation home... what should I expect from Google....stick to maps and search engines, your product SUCKS!", "verified": false, "helpfulness": "0/8", "author": "grape725"}, {"rating": 4.0, "review": "When I have been able to get it to work properly, it is fine.  However, I am still trying to figure out how best to use it.  I have a first generation Nexus 7 which is the main way I have been trying to use it with mixed results.  It only works well with Windows 7 and Windows 8 but I am using Windows XP on my computer and this supposedly limits its functionality.  I am surprised that it does not work easily with the Nexus 7 unit since it is also made for Google.I know that this was a hot seller as the Best Buy stores could not keep them in stock so I assume it is just a question of learning its total functionality.", "verified": true, "helpfulness": "1/1", "author": "Elliott D. Novak"}]