[{"rating": 5.0, "review": "I am very pleased with the Chromecast. It works very well. though, I do hope that the availability of apps will increase in the near future. Overall I am content with my purchase and would recommend it to others.", "verified": true, "helpfulness": "0/0", "author": "Vincent"}, {"rating": 5.0, "review": "This is an awesome product. No wonder CNET listed it as one of 2013's best technology. I will probably buy a few more in the near future for my other tvs.", "verified": true, "helpfulness": "0/0", "author": "3653179"}, {"rating": 3.0, "review": "The Google gadget works well except for apple products. It runs whenever it has power and gets warm, I unplug the usb when it is not in use.", "verified": true, "helpfulness": "0/0", "author": "Capnron \"capnron\""}, {"rating": 4.0, "review": "Excellent! meet all the things that I was  expecting!! it took me like 5 minutes to install it!! very easy!", "verified": true, "helpfulness": "0/0", "author": "wagner"}, {"rating": 5.0, "review": "I bought one because it seemed so inexpensive, I didn't feel theere was anything to lose. Literally had it setup and \"Casting\" within 5 minutes. We liked it so much we bought 2 more for daughters incollege to use on their tv's", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "We were hooking our laptop up to the TV to watch Netflix and controlling that with a wireless mouse. We got the Chromecast to make it possible to leave the laptop in the office and quit messing with cords just for Netflix, but now we use our tablet as a large TV remote and cast Pandora from the phones.Well worth the $29.99 we paid, and $35 isn't a bad deal either. Best gizmo we've picked up in awhile. Now, if only it would also function as a wireless signal extender.", "verified": true, "helpfulness": "0/0", "author": "Joseph Kovar III"}, {"rating": 5.0, "review": "My two girls love their chromecast - wish amazon prime was on it!!!! That is our only regret - more apps", "verified": true, "helpfulness": "0/0", "author": "Cooper"}, {"rating": 5.0, "review": "My grandson loved it. He can see Netflix on his tv from his iPhone, iPad and his iPod also.  He made his tv into a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Jo Ann Ochoa"}, {"rating": 5.0, "review": "Easy set up and does what it says. Netflix looks great.Set one up for my parents and its easier than a DVD since it switches the input on their smart tv", "verified": true, "helpfulness": "0/0", "author": "rangersfan"}, {"rating": 1.0, "review": "The fact it can't Connect directly to my phones Wi-Fi is lame. That was the only reason I bought it.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]