[{"rating": 4.0, "review": "Works for internet broadcasting. Would also be nice to be able to broadcast personal files to it also. Will only work for Google chrome pages", "verified": true, "helpfulness": "0/0", "author": "Rodney Ochesky"}, {"rating": 4.0, "review": "I like how my laptop and phone can put my netflix on my nonsmart TV. It doesn't make my phone hot or use too much battery it is convienient to pause and so farI am satisfied with its abilities!", "verified": true, "helpfulness": "0/0", "author": "Sharae Davis"}, {"rating": 5.0, "review": "Got it as a Christmas present for her because she mentioned it one day. She is very happy with it!", "verified": true, "helpfulness": "0/0", "author": "Christian J. Schwindt"}, {"rating": 3.0, "review": "Easy setup.  But very limited functionality for ipad (can only cast Youtube and Netflix).  On a windows laptop, it appeared to be more functional ( can cast browser tabs ) but the fuzzy picture and latency between movement and sound was aggravating.  I attribute some of the problems to the quality of my own wireless network.  So at best, it is a more convenient alternative to an HDMI cable.  But  I'm certainly not ready to throw away my cables yet.", "verified": true, "helpfulness": "0/0", "author": "busterdad"}, {"rating": 5.0, "review": "He opened it Christmas morning and has been using it daily.  He's happy-I'm happy!  Nothing more to say about it.", "verified": true, "helpfulness": "0/0", "author": "Charles Minton"}, {"rating": 5.0, "review": "Easy to install and it works great with Netflix. We have been streaming from our New Galaxy Tab 3 and it has been great so far.", "verified": true, "helpfulness": "0/1", "author": "Shima"}, {"rating": 5.0, "review": "Bought one of these for my husband and mother-in-law for Christmas. Easy to set up and use. Took maybe 30 minutes each, probably not even that long.For the price, being able to watch Netflix at night on my bedroom TV makes this completely worth it. More apps will be added eventually. I hope they get VuDu soon, as I have a ton of movies on there.You have an HDMI port and want to watch Netflix on your TV? Buy this. There's really no reason not to.", "verified": true, "helpfulness": "0/0", "author": "Erin Mills"}, {"rating": 5.0, "review": "This is a great little device. I get all my shows and movies via streaming services and usually access them on my phone which I then cast to my tv. Simple and awesome.", "verified": true, "helpfulness": "0/0", "author": "Valdern L. Chalwell"}, {"rating": 5.0, "review": "This little jewel let's my son stream Netflix and Youtube to his bedroom from our wi-fi router in the living room. The picture quality is great and he controls it all from his ipod touch. All for 35 bucks. Can't beat it.", "verified": true, "helpfulness": "0/0", "author": "Tomkat67"}, {"rating": 5.0, "review": "Loved the phone cover and the media player.  Arrived very quickly and met  most of my expectations.  I did have a little trouble getting the media player to function.", "verified": true, "helpfulness": "0/0", "author": "Jodi Bryant"}]