[{"rating": 4.0, "review": "It is nice to be able to view pictures etc. on the TV, especially a wide screen TV.  I'd recommend this to everyone!", "verified": true, "helpfulness": "0/0", "author": "anna first"}, {"rating": 5.0, "review": "and I tried it and it is a good product, I recommend it to everyone who uses netflix and have no smart tv, thanks", "verified": true, "helpfulness": "0/0", "author": "jorge rinaldi"}, {"rating": 4.0, "review": "I love the google chrome! Its such an awesome idea! We can play movies from an ipad and have it play right on the television. It is very simple to use! I had gotten it for a friend as a gift and they loved it as well! I plan on purchasing one for myself as well. The only reason I did not give this product 5 stars is because you need to make sure that you have a strong internet connection in order for it to work successfully. Initially it would only connect half of the time. I contacted the help desk and the wait was super long! We ended up getting a new router and it worked perfectly!!", "verified": true, "helpfulness": "0/0", "author": "Jessica Kruger"}, {"rating": 5.0, "review": "I was skeptical to buy it at first because I didn't understand completely how it worked. However, after some extensive research including reviews from friends I decided to get it. I love it!! I used to stream all my videos through my Xbox 360, but frequent disconnects from the network became frustrating. I wanted a dedicated device for streaming and I got that with Google Chromecast!", "verified": true, "helpfulness": "0/0", "author": "Sparrow"}, {"rating": 5.0, "review": "The Google Chromecast was all that I'd hoped it would be. It was very easy to set up and now allows me to enjoy various streaming media at a very economical price. I highly recommend.", "verified": true, "helpfulness": "0/0", "author": "TC"}, {"rating": 4.0, "review": "Love it! Works better than I evem imaginedit would! I would recommend these to all my friends and family! No more tripping over. HDMI cables.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Avid Reader\""}, {"rating": 2.0, "review": "Works when it wants to. The internet cannot connect to this most of the time. Needs to be updated and the software needs some work.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I liked the one in the bedroom so much I got one for the living room TV, which already had many of these streaming apps installed. The CC runs better and can be controlled from any computer, laptop, tablet or smart phone in the house. And no more remotes to lose in the couch.", "verified": true, "helpfulness": "0/0", "author": "freemont"}, {"rating": 5.0, "review": "I had been using an XBox 360 as a media device to access Netflix and Hulu Plus, but I wound up moving it to my son's room. To fill that gap, I debated a variety of products - another XBox, a wi-fi enabled Blu-Ray player, a Roku, or just continuing to use  my computer's HDMI output - and decided that the Chromecast was the best optionI love being able to use my phone to control the programming and I like that my kids who don't have phone can use a tablet or even cast from a computer.No complaints about the product. Stellar.", "verified": true, "helpfulness": "0/0", "author": "Cullen James"}, {"rating": 5.0, "review": "I couldn't get netflix through my xbox due to inadequate internet connections. This was the best alternative. It's cheap and works GREAT!", "verified": true, "helpfulness": "0/0", "author": "Eric"}]