[{"rating": 1.0, "review": "Was really disappointed in the Fire TV.  The main issue I have with it is the space.  I purchased the gamer's edition and two games came with the system and then I installed a third game.  When I went to purchase a fourth game I could not install it due to a lack of space.  What good is the gamer's edition if you can not install multiples games on the system?  One of Amazon's main selling points was that the box was fast and could handle games.  Even if the system is capable of handling games, it does not do the user any good if he can only have 3 games installed.  To me this box was a huge waste of money and I now see that it offers little over its competitors.  I would have bought a much cheaper box from Amazon's competitors if I had known that the space was so limited on the Fire TV.  I do not see any reason to pay extra for higher performance since its extra capabilities are wasted due to a lack of space.  Amazon needs to come out with an external drive for the Fire TV in which games and apps can be installed.", "verified": true, "helpfulness": "6/9", "author": "Brian Agrawal"}, {"rating": 4.0, "review": "We got this to have Netflix/Prime access in our bedroom.Pros:VERY easy to set up and useSmall footprintLot of available games and apps.The only con I have found (knew this going in from the PS3) is that Prime video needs to be better organized.", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 4.0, "review": "Overall, I would say we really like the Amazon Fire TV.  I was disappointed, however, that ALL of my cloud music wasn't available to listen to, only the ones I 'purchased' not including the ones I got for free with the Prime.  I would like to see some specials for renting movies as well. The new releases are really expensive when you figure RedBox has them for around $1.20, why would I pay the extra $3-4 to rent the same movie versus just driving down the road to RedBox.  I would undoubtedly rent movies through Amazon if the prices were more reasonable and/or if they had specials (like two-fers or 99 cent specials).  But, all that being said, we've really enjoyed it and are looking forward to many more hours of entertainment.  :)", "verified": true, "helpfulness": "0/0", "author": "A. Schafrath"}, {"rating": 5.0, "review": "Love it! went from a Roku for netflix and amazon prime and gbox for xbmc to this one. Sideloaded xbmc and now I have one box that does it all. The optic out for audio is nice as well, good sound from pandora.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "So far it's been great!", "verified": true, "helpfulness": "0/0", "author": "Allen Joseph Straith"}, {"rating": 5.0, "review": "I recommend getting Amazon Prime, if you get the Fire TV.  Cut the Cable!", "verified": true, "helpfulness": "0/0", "author": "Thomas"}, {"rating": 3.0, "review": "Overall this device is great especially when using prime content. The streaming performance is good.I did however notice that my prime music library didn't sync fully and the search capabilities don't work with Netflix content. The biggest downside for me is that you can only control it with the remote which is easy to lose our for dogs to chew. As a result I spent 60 bucks on remotes and currently an stuck unable to use the device again. I refuse to buy another remote, so it is now worthless. Please allow us to control with a phone app similar to any comparable device...that I now wish I had instead.", "verified": true, "helpfulness": "0/1", "author": "Scott Hietpas"}, {"rating": 3.0, "review": "I thought that there would be more movies available for the $99 annual fee.  It seems that this is not the case.  I'm still waiting to see if this is worth it or not.", "verified": true, "helpfulness": "1/1", "author": "Bna"}, {"rating": 2.0, "review": "I'm not going to say that this thing sucks. It does deliver on what they promised in terms of hardware. In terms of content though, they fall very, very flat. For one thing, I pay for Comcast cable. I pay for HBO and Showtime and history channel and all of the other things that come with cable, but I'm not always home. I travel and thats why I bought a fire TV. Wired connections are better in hotels. But only after I got it out of the box, did I find out that apparently Comcast is not supported as a cable provider for the cable channel apps. That is so disappointing. I might as well have just bought the apple TV, which at least provides the content I want and a lot more of it. Comcast is a major cable provider, Amazon! Get with the program!", "verified": true, "helpfulness": "1/2", "author": "Lynne Wilder \"Lynne\""}, {"rating": 5.0, "review": "Good nothing else that what i expect. I recommend it.", "verified": true, "helpfulness": "0/0", "author": "Juan E Bustamante"}]