[{"rating": 4.0, "review": "It was easy still.Some user may not be able to.We need more apps for Chromecast.For example Citrix client.", "verified": true, "helpfulness": "0/0", "author": "masafumi akaneya"}, {"rating": 1.0, "review": "Can't stream very many apps.  Worth then $35 I guess.  Push 2 tv is much better. Streams your whole screen from your computer.", "verified": true, "helpfulness": "1/2", "author": "Anthony Esposito"}, {"rating": 1.0, "review": "It only works with YouTub.  Would be better it I could play movies from my tablet.  I'm not spending more money to get another service that is listed for Google Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Ron Borgstedt"}, {"rating": 2.0, "review": "I cannot cast my videos stored on my computer without going through downloads of programs that come with more hidden programs that I do not want and large intrusive advertising and I found a great increase in junk mail about things I do not want to deal with. May be a fine product if you wish to only use chrome for your browser. I do not, too much baggage and does not do the one thing I wanted it to do.", "verified": true, "helpfulness": "0/0", "author": "subsailor"}, {"rating": 1.0, "review": "I would not recommend it, it will not work, tried way more times than should.  It just will not connect", "verified": true, "helpfulness": "1/1", "author": "DANNA HALEY"}, {"rating": 5.0, "review": "I love my Chromecast. The many people I have given/recommended Chromcast to also love theirs. It's so simple and so elegant. It just works.", "verified": true, "helpfulness": "0/0", "author": "Matthew Tagliaferro"}, {"rating": 4.0, "review": "I''ve tired several options in order to get Netflix to play without buffering. Nothing but a didicated $800 laptop could do the trick. But I needed that laptop on business trips occassionally. Hassel. Then this little contraption came along, and it even works well from a distnce, No bufferingIt can't cast everthing I want, but it can cast everything I most want. Apple has to match this and we will all be winners. This one tops anything right now.", "verified": true, "helpfulness": "0/0", "author": "Bigbear"}, {"rating": 3.0, "review": "works with my phone but not my computer also works with laptop but not on desk top computer and you can not be more then 15 feet away from tv", "verified": true, "helpfulness": "0/0", "author": "nick"}, {"rating": 5.0, "review": "this is my best buy! It was easy to install and my wifi did the rest . I am going with internet only and canceling my broadband cable tv. This is be my favorite purchase!", "verified": true, "helpfulness": "0/0", "author": "glenda"}, {"rating": 5.0, "review": "Reputation of the person who may also be purchased. In Japan, not well understood by many people how to use yet, but it appears that use is known, that it expected to sell fairly.", "verified": true, "helpfulness": "0/0", "author": "Eiji Okazaki"}]