[{"rating": 5.0, "review": "Great,", "verified": true, "helpfulness": "0/0", "author": "lido"}, {"rating": 3.0, "review": "Just received my Fire TV. The first thing that hit me was that it did not recognize my 2 tb portable hard drive plugged into the USB port. It specifically did not like the NTFS format and a message said it required FAT32. This does not bode well for the unit if it can not read modern USB storage formats. The GUI takes a bit of getting used to. But after a few minutes I figured out how to get past the SW's predisposition for Amazon content in order to find HULU and NETFLIX. It does seem to have a good network interface that finds and connects quickly. I did notice that it times out very quickly when trying to enter a password. When it encounters an error like this, it tends to start over (reboot) from scratch rather picking up from where you left off. I had to enter my ID and password for both HULU and Netflix multiple times before I could beat the clock. This meant I had to watch the system restart several times and click my way through to the HULU and Netflix sign on screens several times. The voice activation feature has some difficulty differentiating between the soft c and s sounds, such as Sybil and Cybil, and you are not given a way to fix it when it happens. If your choice is not there, you don't get to use voice. But for the most part it seemed to work fairly well and adds a nice interface to the legacy move and click gopher lists. Tonight I plan to format my drive to FAT32 and check out whether it can interface with a 2 tb drive and whether it can play a variety of video files, such as FLV, MPG, MOV and others in addition to the MP4 format listed. 10 June 2015.Update 11 JuneOK, More information. Apparently if you get a unit that has not been updated, you can rout the internal drive so that you can later connect with an external drive to share content. However, the unit is designed to update immediately in order to prevent you from doing that. Once it is updated, you can not get it to recognize any external drive that isn't small and formatted with FAT32. Stickmount doesn't help. So if you want to play media files from your hard drive, this unit is not for you. Still considering if I want to return it. The one good feature that might convince me to keep it is that it has a great internet interface and the horse power needed to play and stream hi def video. It is the only free standing media player I have found that can stream hi def MOV files from my NAS. So, as long as my ASUS router doesn't get even more unreliable than it already is, I can watch all of my media by streaming it from my NAS. I had to install Kobi player in order to do this. CHECK YOUTUBE FOR SOME GOOD INSTRUCTIONS. This is what I wanted to begin with before I found out that WD Live and Netgear could not stream hi def from my NAS and i had to buy individual hard drives for every player. My NAS is USB 3.0 into a Gigabit ASUS router. I also found that the remote's voice feature will in fact find content on HULU and Netflix, as well as Amazon. Push buttons are very sensitive on the remote though.Can be difficult in button intensive scenarios.", "verified": true, "helpfulness": "3/3", "author": "Kilroy Jones"}, {"rating": 5.0, "review": "Great product  super fun worth every penny", "verified": true, "helpfulness": "0/0", "author": "lacey Torres"}, {"rating": 5.0, "review": "Have had it only a couple of weeks. Works great. My Netflix feed is clearer and more definition with the Fire TV. All of the programing and Apps work great !", "verified": true, "helpfulness": "0/0", "author": "domayes \"oleman\""}, {"rating": 3.0, "review": "Loved our Fire TV...used it since Christmas. Then all of a sudden, it stopped working. We changed the battery in the remote. Still nothing. Can you help?", "verified": true, "helpfulness": "0/0", "author": "Beverly R."}, {"rating": 4.0, "review": "Exactly as described. Quick ship", "verified": true, "helpfulness": "0/0", "author": "charles watson"}, {"rating": 5.0, "review": "It's great  I love it.", "verified": true, "helpfulness": "0/0", "author": "Eli Ismail"}, {"rating": 5.0, "review": "A great device! Easy to use menus and great selection of shows and movies for prime members.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Excelent Product,", "verified": true, "helpfulness": "0/0", "author": "Cristina Guajardo Baños"}, {"rating": 5.0, "review": "Had mine for a week and cancelled my cable service.  I primarily watch Youtube videos or use Amazon Prime to watch videos.  I was using my PS3 for that but now with the Fire TV I can access those easier.  The voice system has been flawless even with my smooth southern accent.  That was unexpected but has been a huge plus.  Only slight con would be the tiny remote's ability to fall through cushion cracks on my recliner and get hung up in there where I can't find it.", "verified": true, "helpfulness": "1/1", "author": "Kevin"}]