[{"rating": 5.0, "review": "This is a simple but a very good product. It is easy to use and install.  You can access Netflix or your other favorite streaming service. It is faster and has more memory than the smaller and less expensive version that amazon sells", "verified": true, "helpfulness": "0/0", "author": "R. Seligman \"Psych. Guy\""}, {"rating": 5.0, "review": "Happy so far. I also have a ROKU 2 and the Fire TV interface definitely responds faster due to it being basically a small computer. I am happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "John R. Sydenstricker Jr."}, {"rating": 5.0, "review": "So far so good.", "verified": true, "helpfulness": "0/0", "author": "L.A. Buyer"}, {"rating": 5.0, "review": "Love it but I can't figure out how to use my Sharper Image headphones with it since I have to set up my Fire TV connected to my cable box to get cable channels. Any suggestions?", "verified": true, "helpfulness": "0/0", "author": "AnnetteR \"book lover\""}, {"rating": 5.0, "review": "So far so good with Amazon fire TV.It took me about 10 minutes to hook up and I found installation to be simple (as long as you have an HDMI cable handy.  I also opted to use an ethernet cable to plug directly into my modem instead of going with wifi).The \"box\" is actually smaller than I thought it would be which was a nice surprise.The app offerings are what I was looking for (Pandora, HuluPlus, NetFlix) and the Prime content with the free 30 day prime trial seems to be pretty good.The voice activated remote really does work and I find the remote to be very intuitive and easy to use.I'd recommend this product if you are looking for a solid device to stream shows, movies, and music.", "verified": true, "helpfulness": "0/0", "author": "Anonymous"}, {"rating": 5.0, "review": "Breeze to set up and linked to my Prime account seamlessly.  Very snappy response from the controls, no lag or annoying pauses.  So far so good, very impressed", "verified": true, "helpfulness": "0/0", "author": "SC"}, {"rating": 3.0, "review": "It is a great helpful entertainment device but it is not as extraordinary as advertised. Apps like Pandora and Hulu were great all in one place.", "verified": true, "helpfulness": "0/0", "author": "TNP"}, {"rating": 5.0, "review": "I just added this to my wish list because I need this for my iPad mini and for my mom", "verified": false, "helpfulness": "0/0", "author": "Sobeida Acosta"}, {"rating": 5.0, "review": "Very pleased with my purchase of Amazon fire Tv Like it better than Apple TV", "verified": true, "helpfulness": "0/0", "author": "Gary Mawyer"}, {"rating": 5.0, "review": "I think it's a great thing to have. I'm getting rid of direct tv and using this and a hd tv antenna. Will save 1,600 year doing this.", "verified": true, "helpfulness": "1/1", "author": "Murdock"}]