[{"rating": 5.0, "review": "best $35 spent on any electronic streaming device!", "verified": true, "helpfulness": "0/0", "author": "Alexandra Pasquale \"Lexi\""}, {"rating": 5.0, "review": "Was a gift for my son.  He loves it..", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Google's Chromecast actually surprised me for all that it can do for the price. It seems more and more people are looking to get into the streaming experience, but the price for some may be too high. Google really packed a lot into a device for the price point, and it can do a lot of what Apple TV or a Roku box can do. You just have to do a little research and experimenting to get what you need.For $35 dollars you get an a streaming device that ties all your electronics together whether you use Mac OS X or Windows for laptop. If you use the Google Chrome extension you can steam content from your browser with audio to the tv. Then you can also mirror desktop too but you will not have audio as the feature is still in beta. On the mobile side if you have an Android device you'll truly unlock the experience with what it can do. By looking on the Play Store you'll find a range of apps that will let \"cast\" content to the bigger screen without killing battery. In addition if you use an app called BubbleUPnP you can cast content that does not have the capability yet, but you have to toy around with settings.The only negative I really have with the device a whole is that if you step away for an extended period of time the apps will stop streaming. The only other negative is more on my WiFi setup than device is that sometimes buffering takes a while. Overall if you are on a budget and want some great steaming content go for the Chromecast.Pros:- Cost- Easy set-up using the Chromecast app (on Play and App Store for free)- Lots of streaming options than you expect- Solid Design and Form FactorCons:- Times out of content after you go inactive from device (~ 15 to 30 minutes if you pause content)- Depending on your network or WiFi signal buffering could take a little time if router is far away.", "verified": true, "helpfulness": "0/0", "author": "Bruce Levine"}, {"rating": 5.0, "review": "This is a great companion for all devices and make a real smart TV for a low price.", "verified": true, "helpfulness": "0/0", "author": "Rulax"}, {"rating": 1.0, "review": "Don't waste your time or money unless all you want to do is stream some online content to your TV. It is near impossible to stream your own media from your PC or MAC to the TV. It either requires expensive second-party apps, or the experimental \"cast the entire screen\" option which is clunky, low resolution, has choppy playback, delays, and often crashes and disconnections. HUGE disappointment!", "verified": false, "helpfulness": "0/0", "author": "Susan McDevitt"}, {"rating": 5.0, "review": "Cool product!!! Love how anyone can use their device and we see it on our tv!!!", "verified": true, "helpfulness": "0/0", "author": "J.Kray"}, {"rating": 5.0, "review": "awesome!", "verified": true, "helpfulness": "0/0", "author": "Debi Smull"}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "Kevin H."}, {"rating": 1.0, "review": "No instructions.  Two other computer savvy friends tried and one uses a Cromecast and still couldn't get it to work.  It's in the junk drawer now.", "verified": true, "helpfulness": "0/1", "author": "Steve"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Shan"}]