[{"rating": 5.0, "review": "wha a great device!  Now I can view programs that I missed.  The processor is fast and powerful.  Amazon Prime members can access tons of free movies and programs.  Recommended.", "verified": true, "helpfulness": "0/0", "author": "The GMan"}, {"rating": 3.0, "review": "Too difficult to fine movies that are prime only.", "verified": true, "helpfulness": "0/0", "author": "Mech"}, {"rating": 4.0, "review": "A lot of entertainment in a little box. We are enjoying it very much", "verified": true, "helpfulness": "0/0", "author": "Gary Carter"}, {"rating": 5.0, "review": "We love it, sold our Apple TV..", "verified": true, "helpfulness": "0/0", "author": "S. Judkins \"sjmilw\""}, {"rating": 5.0, "review": "Works Problem free", "verified": true, "helpfulness": "0/0", "author": "Randy Sellers"}, {"rating": 4.0, "review": "bought as a gift for my mother in law the speech search is pretty cool and was the reason I chose this and not the fire stick. The speech search only works for Amazon not in YouTube not in Netflix. I wish it would work in whatever ap you are in.", "verified": true, "helpfulness": "0/0", "author": "krdaniels"}, {"rating": 3.0, "review": "needs vudu, nasa live, and a few more .....useful channels. .....maybe some up to the minute news and weather. fire tv is off to a good start but they have a long way to go if they want to compete with roku. I have fire tv, apple tv and roku. roku is the king by a long shot. They are a true open platform streaming box with all the bells and whistles that actually work well", "verified": true, "helpfulness": "1/1", "author": "RICHIE"}, {"rating": 3.0, "review": "Can it work without wifi", "verified": false, "helpfulness": "0/1", "author": "noel brown"}, {"rating": 5.0, "review": "Ii is working great !!", "verified": true, "helpfulness": "0/0", "author": "Anthony Luo"}, {"rating": 3.0, "review": "i am having an issue with  the product BUT i am not sure what is wrong - it may not be the produxt !? could be wiring or network issue !i do love the voice recognition part of the search for content.........the absolute best of any products ANDit works - u did not just take a stab at it - u hit a home-run !!having said that it is still a little tedious finding out which TV shows, which movies are covered (free) thru Amazon prime;if u re-organize with the amazon prime & free and the non amazon prime & pay TV / movies it would be a much better product overall.........", "verified": true, "helpfulness": "0/0", "author": "pat mullen"}]