[{"rating": 4.0, "review": "Chromecast is available at Best Buy and Google Play for $35.00.Chromecast is extremely easy to setup. Why is it so expensive on Amazon??[...]", "verified": false, "helpfulness": "3/9", "author": "D. Battle \"reading junkie\""}, {"rating": 5.0, "review": "As of now (Aug 5, 2013), it has limited functionality (casting from YouTube, Chrome Tab, Netflix, Media player). Works simply great.As soon as possible, Google should add screen-cast feature like Airplay.", "verified": true, "helpfulness": "1/1", "author": "Tomy"}, {"rating": 5.0, "review": "Yes, it's odd controlling this thing with no remote, but it works as advertised. I'd like to see more apps supported, but that's life on the bleeding edge. As for the device, YouTube and Netflix work flawlessly from the phone. Chrome tab casting, on the other hand,is too slow to use in its current from. Good start.", "verified": false, "helpfulness": "0/0", "author": "Robert E. Clack \"Author\""}, {"rating": 5.0, "review": "This makes watching youtube on your tv a piece of cake.  As soon as I'm casting youtube on my phone or tablet, Chromecast can even change the input on my tv to view it.  It's that easy once it's set up.  Aside from Netflix, I'm able to watch documentaries and many other programs on youtube.  And if you can play something on your chrome browser, you can cast it on your tv as well.  Such ease and joy to use.  For $35, you have to be a moron to give this thing less than 5 stars.", "verified": true, "helpfulness": "1/1", "author": "Frank C."}, {"rating": 5.0, "review": "Chromecast is extremely easy to setup. I was able to install and start using the device within 5 minutes.Great image quality, and I have had absolutely no problem streaming videos to this device with my wireless router - content streams clear and sound is great.Packaging is nice- simple and clean design.Love that chromecast is so small- no box and no wires.  An amazing product and at $35.00 it is a steal .", "verified": false, "helpfulness": "1/2", "author": "msw"}, {"rating": 5.0, "review": "This little thing is just the best.  And I stream a LOT of TV content.  I have PS3s (2), Rokus (3), Xbox (1), Google TV (1), and Boxee Box (1).  My favorite, however, is this little Chromecast unit.  It can't take over for all my streaming yet, as it doesn't have support for Hulu Plus, Amazon Prime, or Vudu.  However, I'm positive these services will be providing support in very short time and this will become my go to device for TV and movie viewing.Using my phone or tablet as the remote for Netflix, YouTube or Google Play is so much better and superior than the custom built UIs built into the other devices.  It's not even close.  We've all have been having a great time using it to share YouTube Videos and watch Netflix.  Plan to buy 3 more to cover the rest of TVs in the house.  This thing is a no brainer.  Streaming from a Chrome web browser is a bit buggy and it works, but not as smooth as when built into the mobile apps.For $35, you can't go wrong.", "verified": true, "helpfulness": "5/7", "author": "Erik Marum"}, {"rating": 5.0, "review": "To stream things from your computer on to your TV, there are several expensive options out there...or you could purchase this little gem for $35 and stream 1080P right to your TV from various different devices.  Works GREAT!", "verified": true, "helpfulness": "0/1", "author": "David"}, {"rating": 5.0, "review": "I can control any TV with my laptop or iPad.  I can browse the internet while the laptop streams almost anything to my TV!  Good clear audio and picture.  I'd pay twice this much for this gizmo!", "verified": true, "helpfulness": "0/1", "author": "Bajadrifter"}, {"rating": 5.0, "review": "I've been using it for days and love it. The idea of using the brains of any device you've already paid good money for is awesome. I'm using it all the time for everything, to include music. I'm looking forward to the development of more supported apps. C'mon developers!", "verified": true, "helpfulness": "1/2", "author": "adam"}, {"rating": 5.0, "review": "I do wish it had some level of security so users cant change it while I am watching  something.  for $35.00, this is the best deal around!", "verified": true, "helpfulness": "0/0", "author": "David L. Lowy"}]