[{"rating": 5.0, "review": "I got this for Christmas, and I've got to say, best gift ever. Although it may not seem like a big deal, copying movies onto a usb drive takes forever, and with this, all I have to do is stream it directly from my computer to the Chromecast. Don't waste your money on Apple TV or Amazon Fire, get Chromecast. It's cheaper than it's competitors and has a lot more convenient features.", "verified": false, "helpfulness": "1/1", "author": "Brandon \"Brandon Stump\""}, {"rating": 5.0, "review": "I love my Chromecast but where is my $20 google play store credit?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very likely the best $30 I've ever spent, def on a TV accessory! I can stream just about anything I want, doesn't totally replace cable but way better than On Demand... this is a perfect product for any techie and/or TV junkie !", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "InfuserTech"}, {"rating": 5.0, "review": "I love the ability to use different devices from cell phones ttablets", "verified": true, "helpfulness": "0/0", "author": "rocky hicks"}, {"rating": 5.0, "review": "Really great product, much better than fire tv stick", "verified": true, "helpfulness": "0/0", "author": "Ben"}, {"rating": 5.0, "review": "Absolutely one of the best electronic devices I have ever purchased. I had been thinking of canceling my cable subscription for some time but the purchase of a HD smart TV and the Chromecast finally convinced me to go ahead and go digital. There are do many Chromecast apps. I was able to turn my kitchen TB into  \"smart\" TV with this device. I can watch Netflix, YouTube, and can cast stuff from the web.  This is really a bargain.", "verified": true, "helpfulness": "0/0", "author": "Francisco"}, {"rating": 5.0, "review": "Super easy to use and makes life so much easier!", "verified": true, "helpfulness": "0/0", "author": "Chetan Soni"}, {"rating": 5.0, "review": "Best and easiest way to stream videos from PC to TV", "verified": true, "helpfulness": "0/0", "author": "Clark C. Cline \"gizzmoid\""}, {"rating": 4.0, "review": "The media player itself is a little bulky which could prove to be problematic when connecting to a TV, however this problem is quickly alleivated by an extension cable, which is supplied in the box. A quick google search found the App necessary and web content (YouTube for example) streams seamlessly from my Chromebook to my TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]