[{"rating": 4.0, "review": "This is very good for streaming contents from play store, youtube and netflix. The browser cast feature is quite useful at times. I just hope google allows for streaming of media from phone, tablet and pc as well.", "verified": true, "helpfulness": "0/0", "author": "Nabeel Ahmed"}, {"rating": 3.0, "review": "I'm happy with my purchase over all. However with only one app that I can use that supports this which is Netflix. There is just nothing else Chromecast does.", "verified": true, "helpfulness": "0/0", "author": "Me2"}, {"rating": 1.0, "review": "I cannot get to work with my iPad. Don't believe it when they say it supports IOS. There is no app unless you are on Android. I just wasted my money. I will stick to my Apple TV which I have in the bedroom. I just plugged it in and it worked.", "verified": true, "helpfulness": "4/13", "author": "Will I Am \"Will I Am\""}, {"rating": 5.0, "review": "I absolutely love this product. At first I just got it to watch Netflix on my TV because my XBOX was being used elsewhere, but now it's my go to media device for my television. Streaming Netflix and Youtube is only part of what this device does now and promises to do in the future.Current Pros:-Streams Netflix seamlessly to my TV and easy control with any Android or iOS device-Same with Youtube-Cheap, at $35 it's a steal-Something I like to call party mode, and I'm sure once developers get more into it this will take off: Invite a bunch of friends over, everybody hook up to the Chromecast via Youtube and everybody can pick what music video or viral video they want to watch and put it in a universal queue, allowing your guests to pick what they want to watch. I really hope when apps start to come out they build this into them-Setup was really easy, only took a minute.-Stream video files from your computer (Use Chrome to play the file and cast it to your TV)Cons:-Lack of current providers (There's a lot of interest, though, so I bet this will change) Only Youtube and Netflix really so far. Looking forward to seeing Spotify or Pandora jump on board with this.I highly recommend this, especially for $35.", "verified": true, "helpfulness": "0/0", "author": "Paul H. Lyons"}, {"rating": 5.0, "review": "This device is great. I've been using it for a few weeks now. I use it for netflix, youtube, and google music.  It works well with my android devices as well as my wife's iOS devices.  It will even change the input for you.  It will even cast my entire desktop for playing local files on my computer.  However this last function doesn't seem to work to well for HD playback.  I'm not sure if its because of my internet speed or what?  Overall, I am very satisfied and for $35 it's a no brainer!", "verified": true, "helpfulness": "0/0", "author": "JRust"}, {"rating": 5.0, "review": "I love my chromecast! Works great on every platform including android, iOS, Mac, and Windows naturally using Google Chrome. Using a CEC enabled port it will switch the HDMI input for you, here is a slight catch 22 if you will. Because this device requires power from USB if you are like me you put in in your usb port on the tv. This means that you have to turn the tv on for the device to be operating. If you went the route of the power adapter in the wall you will not have this \"issue\" and CEC will turn the tv on and onto the correct input without intervention. Note that streaming is only via enabled apps currently as of August 2013 this is youtube, netflix, google play music, and youtube from your browser. There is a beta feature on the chrome web browser to send any tab to the chromecast results certainly vary but most of the time you will not have an issue.", "verified": true, "helpfulness": "0/0", "author": "Bryan Miner"}, {"rating": 1.0, "review": "I have a sony TV which doesn't mirror my S4. Guy at best buy said to get Chromecast. I want screen mirroring. Dont get this if this is what you are trying to do. All this thing does is reflect google apps. You are completely restricted. I was very angry about this because it was a waste of time. Why companies continue to mislead and lie to people is beyond me. Don't call it a smart TV if your going to restrict everything and everyone. Complete BS. This device does nothing. Download an app on your blue ray, smart tv or PS3. This thing is junk.", "verified": false, "helpfulness": "4/11", "author": "Jericho541"}, {"rating": 1.0, "review": "I was so happy to hear that I could finally watch Netflix, among other things, on my dumb HDTV in our living room.  The TV which is 15 ft away from my 6 month old $130 router.  First off there is basically NO support for iOS or Win XP. Luckily I had an old Samsung Android phone lying around that finally let me enter my password on my WPA secured network.  Nevermind that I had to enable my SSID broadcasting to get it to connect.  I finally got it connected and then it would disconnect, then it would reconnect, and then while connected I decided to try Netflix and every time I did it would disconnect.  So here I have a $35 device that can't connect to my router 15 feet away for more than a few seconds all the while I have computers, phones, and tablets that can do it atleast 6-8x as far away though my house.While it sounds like an amazing product it simply just doesn't work.  After 3 hours of trying to get this POS to work it's going back and I'll just spend $15 more and get an Android Stick that isn't going to be held captive to Google's whims of what it should and shouldn't be able to do.", "verified": false, "helpfulness": "4/9", "author": "DJ"}, {"rating": 5.0, "review": "I bought this from Best Buy while browsing around. I had heard about it on the blogs and I saw a whole stand almost cleaned out but 3 left so I figured why not. I thought I would regret it but not only am I impressed but this is probably the best $35 I have ever spent. Google well done I almost bought Apple TV since I am a Mac/iOS user but ill pass on it and stick with this. No wires and very mobile and compact. Works really well with my Macbook and iPad", "verified": false, "helpfulness": "1/2", "author": "KB"}, {"rating": 5.0, "review": "This has the capability to be a killer product.  Of course it does a great job as a streaming device for Netflix, YouTube, and Google Play Movies and TV, but it also (as of this writing) will play videos from my phone and DLNA network, via aVia Media Player Pro, which cost $2.99 in the Google Play store.", "verified": true, "helpfulness": "0/0", "author": "Craig Herberg \"Craig Herberg\""}]