[{"rating": 1.0, "review": "We want to love this device. We've tried it, twice! It is so nice when it works. Fast and pretty! But, unfortunately for us, it doesn't work for very long. Then we get static, just a little at first, but then it builds, and builds. And builds. And then we only get static. If we unplug it and leave it alone for a bit, that sometimes fixes it. If we reset to factory defaults, that sometimes fixes it too! But then, more static. The HDMI port works fine with other streaming devices. No more Fire TV. :(Now, I am sitting chatting with customer service being told that no, amazon won't take it back because it is outside the 30 day return period.Edit: We have received authorization to return the device, after an hour on the phone. Success?Beware.", "verified": true, "helpfulness": "1/3", "author": "Amber W."}, {"rating": 5.0, "review": "returned", "verified": true, "helpfulness": "0/1", "author": "Jeffery Chandler"}, {"rating": 1.0, "review": "Well it worked for a little over a year and then it broke. In fact: Don't bother buying this device or complaining to Amazon. They had me jump through three hoops over two days and then after over an hour of \"troubleshooting\", saying they'd replace the nonfunctional remote, and following up with an email that states they need more information to \"replace the equipment\" then and only then say the remote is out of warranty (after 14 months) and if I want to pay half price I can do that. Thanks but no thanks, Amazon. Hello Roku!", "verified": true, "helpfulness": "2/4", "author": "Mairzy Doats \"Mairzy\""}, {"rating": 1.0, "review": "Worked for 1 week . Second week ...volume quitting out all the shows on netflix froze up. Did all steps including setting back to factory setting. Not happy  with product.", "verified": true, "helpfulness": "1/3", "author": "von shefke"}, {"rating": 1.0, "review": "Value of the product has really dropped since they blocked Kodi on the Appstore.  I use it to access my 100% legal archive of my dvd's and tv episodes which are all paid for. Kodi contains no piracy tools at all and was removed for no reason by Amazon.", "verified": true, "helpfulness": "2/5", "author": "J. Lee"}, {"rating": 5.0, "review": "The TV Box all other boxes look up to. A smashing Home Run from Amazon", "verified": true, "helpfulness": "0/0", "author": "David Rodriguez"}, {"rating": 1.0, "review": "I really liked it while it worked, in fact I preferred it to my Roku 3, which is over two years old, and still going strong.  I have had the Fire TV for about 6 months.  It worked for about the first half of that time period, then it started getting \"flaky.\"  It would work okay for a little while at a time, then it started taking longer for it to start playing a program that was selected, especially if it was on Hulu+.  From that point, the performance kept degrading until I could no longer watch a program on Hulu+.  The Fire TV would take an inordinate amount of time to buffer enough to play for any reasonable period of time before stopping to buffer again.  From that, it went to a condition where once I got a program started playing, it would play normally until the first commercial break, then, when the program started to play again after the break, I would either get audio or video, but not both at the same time.  I would most often, but not always, get audio with no video.  Pausing to allow additional buffering did no good.  I have tried every troubleshooting step given on the Amazon Fire TV help page, plus every step suggested by Hulu+, multiple times, all to no avail.  Today, I initiated an online chat Customer Service request.  They had a Fire TV customer service representative call me.  All I got from him was that he wanted me to start doing all of the troubleshooting steps I had already performed multiple times.  I could not convince him that I had already been through all of the steps time and time again.  I became so disgusted, I finally terminated the call.  I am really disappointed, because Amazon Customer Service has always been outstanding in the past.", "verified": true, "helpfulness": "3/4", "author": "Wilbert L. Washam"}, {"rating": 5.0, "review": "Talk about easy installation. Easy to use and I had it hooked it up to Netflix in NO time. Worth every cent!", "verified": true, "helpfulness": "0/0", "author": "Cassandra"}, {"rating": 5.0, "review": "use it all the time. love it  lot of choicesthank you I love AmazonRobert", "verified": true, "helpfulness": "0/0", "author": "robert lloyd"}, {"rating": 3.0, "review": "I have been successfully using this device for the past 7 months. Recently the screen has periodically gone black and the message re: adjusting the HDMI cable appears. I remove and reinsert the cable into the unit. Again after a short period of time the problem returns. This is repeatable \"n\" times.Amazon appaently does not have a support site that I have found.Has the HDMI connection degraded in the unit or what?Should I replace the cable?", "verified": false, "helpfulness": "3/5", "author": "Fred Rothstein"}]