[{"rating": 5.0, "review": "The Googel ChromeCast HDMI Streaming Media Player worked as expected with efficiency and and no hiccups. Definitely worth its price.", "verified": true, "helpfulness": "0/0", "author": "Zamien Allard"}, {"rating": 2.0, "review": "great now that google update software and can actually share pages from samsung tablet and phone to my TV, but it only took 7 months", "verified": true, "helpfulness": "0/0", "author": "DFW Powder Coating \"Owner\""}, {"rating": 5.0, "review": "excellent and convenient for users like me, who dont want to use extra space or extra electricity cause is very small and it plugs to the usb tv port as energy source.", "verified": true, "helpfulness": "0/0", "author": "hapo"}, {"rating": 2.0, "review": "This is not worth the money after getting it setup I found It to be of no use unless I wanted to do everything through my laptop or phone just to watch TV your best bet is to buy a low price streaming device and hook that to your T.V.", "verified": true, "helpfulness": "0/0", "author": "Hoop 4"}, {"rating": 2.0, "review": "hard to work", "verified": true, "helpfulness": "0/0", "author": "rodney.zimmerman"}, {"rating": 5.0, "review": "good .", "verified": true, "helpfulness": "0/0", "author": "martin"}, {"rating": 5.0, "review": "LOVE!!!!!", "verified": true, "helpfulness": "0/0", "author": "Brooke"}, {"rating": 1.0, "review": "It would not work with my Toshiba TV. It would not recognize my wifi network. I sent it back for a refund and replaced it with a ROKU unit that works GREAT!", "verified": true, "helpfulness": "0/1", "author": "JC \"Bobo\""}, {"rating": 3.0, "review": "Disconnect from internet too often!", "verified": true, "helpfulness": "1/1", "author": "Glue Stick"}, {"rating": 5.0, "review": "Can't go wrong with the Chromecast.  We usually use it for Netflix or YouTube, but recently I got Plex and have been watching local content.  Also using Showbox (not officially supported) and Avia I don't even have to DL stuff to watch locally.  Easy to use, easy to set up, never crashes.  New apps are added every month or so, so this thing is just going to keep getting better.", "verified": true, "helpfulness": "0/0", "author": "Timothy"}]