[{"rating": 3.0, "review": "Works as expected but is being replaced by newer TVs.", "verified": true, "helpfulness": "0/0", "author": "Runforit"}, {"rating": 5.0, "review": "Super easy to install.  I had it up and running in minutes.  I was unable to project Power Point using the experimental full screen mirroring but anything cast in Chrome has worked fine so far.  I liked it so much I bought a second one for my brother.", "verified": true, "helpfulness": "1/1", "author": "NewtonP"}, {"rating": 5.0, "review": "Loved it. great for netflix", "verified": true, "helpfulness": "0/0", "author": "Maria"}, {"rating": 5.0, "review": "Be sure there is strong Wi-Fi near your chromecast. Disconnections during Google Music use can be especially frustrating.", "verified": true, "helpfulness": "0/0", "author": "Adam M."}, {"rating": 5.0, "review": "Just what I need.", "verified": true, "helpfulness": "0/1", "author": "Debbie Marron"}, {"rating": 1.0, "review": "No, the program stops and freezes and does not proceed", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Works great, but I wish there were more apps that would stream to the device, including their own Chrome browser. Using this with the latest gen. iPad.", "verified": true, "helpfulness": "0/0", "author": "Alpinist"}, {"rating": 3.0, "review": "Chromecast - works only for few applications, good to stream from mobile devices. Not worth if planning to cast from a PC browser.", "verified": true, "helpfulness": "0/0", "author": "vijay"}, {"rating": 3.0, "review": "Arrived on time and as discribed", "verified": true, "helpfulness": "0/1", "author": "Eugenio C."}, {"rating": 1.0, "review": "I ordered for my parents while I was out of town, and when it got shipped, they kept saying it wasn't working. I thought it was because they're old and aren't good with technological stuff. I came back home a couple days ago for a family gathering, and told everyone we were going to watch a movie, old videos, etc. This chromecast wasn't working, and tried EVERY SINGLE POSSIBLE way, and followed instructions more than 10 times, but it's still not working. I'm now assuming youguys shipped one of the 'returned' ones, or fake ones. I'm kind of really angry, and I want a FULL refund back, and I will ship it in as soon as the money comes back into my account.", "verified": true, "helpfulness": "0/1", "author": "jung lee"}]