[{"rating": 5.0, "review": "A friend bought one of these to try out earlier in the summer. It's a great (and cheap) way to share a YouTube video (as well as watch a TV show or movie from one of the supported streaming sites). There's no security so it depends on the security of your network, but  it makes setup and use simpler. It has no playback performance issues that I can see (YouTube videos of varying quality, Hulu+ HD, Netflix HD). Playback works great both from an Android device and a Linux desktop. Highly recommended if you're looking for a cheap, small streaming set-top-\"box\"", "verified": true, "helpfulness": "0/0", "author": "Jesse B"}, {"rating": 3.0, "review": "Everybody knows this is basically a device to stream/cast your youtube video primarily to your tv. I connected it to my receiver and which is inturn connected to tv. device works great with youtube and maybe will work with other approved software.Con - if i cast anything from chrome browser, then the browser needs to be active from my laptop/android phonecant play local media (thought might work with options like plex media server).", "verified": true, "helpfulness": "0/0", "author": "Lokesh Purushothaman \"Logie\""}, {"rating": 3.0, "review": "Sometimes it's glitchy and freezes when trying to change shows but for portability and price, I'll keep it or maybe gift it.", "verified": true, "helpfulness": "0/0", "author": "dextv"}, {"rating": 5.0, "review": "I was concerned about the installation, but it was extremely easy. I plugged it into my tv, and it walked me through the setup. Everything was automatic. I just had to push a few buttons. I actually did all the setup from my phone. The sound quality is incredible. I'm so glad I bought this.", "verified": true, "helpfulness": "1/1", "author": "rvincent"}, {"rating": 1.0, "review": "Do u have to have wifi for the chrome because i don't have wifi only my phone has wifi since i pay it each month. so can some please tell me if u do or not", "verified": false, "helpfulness": "0/4", "author": "chrissy60"}, {"rating": 5.0, "review": "Installation is so easy that you tend to make it hard.  I am casting from a tablet, a smart phone, and a laptop running Win 7.  It connected to my wireless network right away.  My primary reason for buying was to view videos on my computer on my HD TV.  I am using the Real Player Cloud app that has Chromecast compatibility.  Great picture quality.  Only had one problem.  The Chromecast device started dropping off the wireless network around the second week of use.  Researched user forum and found the answer to my problem was the USB cable that came with the device was faulty.  Installed new cable and have had zero signal drops since. Have viewed up to 5 hours of video straight without any problems", "verified": true, "helpfulness": "2/3", "author": "James L. Schaffner \"Jim in CO\""}, {"rating": 5.0, "review": "This is a great idea. It's better than having a dedicated computer just for the HDTV. Anyone using a chrome browser can connect on Windows or Mac. Android users can use Netflix, Hulu, HBO GO, You Tube, Google Play Movies, and Google Play Music. I hear that there are more apps coming that are compatible with it. I have two of these now. One for my room and one for the living room. I may get another one to take with me for work to present web apps to my clients.", "verified": true, "helpfulness": "0/0", "author": "sixstringking \"post punk syndrome\""}, {"rating": 5.0, "review": "How convenient? Just plug it in to your TV and it virtually becomes your computer screen when you choose to \"cast\" specific tabs you have open in your Chrome.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "The setup is quick and easy. On YouTube and Netflix in a matter of minutes. Its cheap and works really well.", "verified": true, "helpfulness": "0/0", "author": "Charlie Nguyen"}, {"rating": 5.0, "review": "I got tired of using my xbox to watch netflix so I got this. It turns out using my phone to run the tv is so much more convenient than I thought it would be, now my tv is always running netflix, pandora or youtube when I am home through my chromecast. And being able to throw a youtube video up on the screen in a few seconds to show friends is cool and handy.I also want to give a shout-out to the shipping crew at amazon. They always seem to get my items to me sooner than I actually expect them!", "verified": true, "helpfulness": "0/0", "author": "Tate"}]