[{"rating": 3.0, "review": "Let's start with the good. It's fast. I've had samsung smart tvs, apple tv, xbox, and nintendo wii,  this streams and downloads faster then them all. However, my problem is they most likely rushed this product to the market. As of writing they don't have the content. The only thing you will find on amazon prime at this point is some big movies that are on netflix too, HBO shows, British television, and bad reality tv. Not much there. My next problem comes with the gaming. They only have a few now, but they've promised 10,000 more. Yes, it's great that they have these types of games, but they're glitchy at best. Not to mention that when you buy the controller there is no instruction how to set it up. All in all I feel that they will fix these problems in time, but it's not a must have item right now.", "verified": true, "helpfulness": "1/1", "author": "movielover20"}, {"rating": 1.0, "review": "A month in and we were doing ok. But my kid kept playing with the remote so in order to avoid a purchase we put the password under parental control. What a mistake. Somehow that made it go offline in the middle of a movie. And when we went back to reset the wireless connection, guess what? It asks for the password. And when you put in the password, guess what, it can't connect to the internet. Endless loop. No way out of it, so now it is a big paper weight. Tried to turn power off and on to no avail. Tried to find troubleshooting, costumer service, a forum, and nothing turned out. So, we are returning it. Don't think we will get another one. Maybe will try the roku, but I have my doubts. Bunny ears and netflix thru hdmi will have to keep working.", "verified": false, "helpfulness": "6/11", "author": "CRI"}, {"rating": 2.0, "review": "i have had Apple TV for a while and wanted to try the NEW Amazon Fire TV.  It was great packaging; easy to open and a snap to get started. But that is where easy ended.  It is soooo harder than Apple TV to find anything.  I have hulu plus and netflix along with amazon prime.  Unless I know what I want to watch I cannot find anything; in other words there is no such thing as picking a genre and looking through all the shows in that genre and picking a show.  I just hate my amazon fire tv and wish I never would have bought it.  No instructions either so there is a book on amazon to purchase but some of the reviews were just not positive.", "verified": true, "helpfulness": "2/5", "author": "Laverne T. Morgan"}, {"rating": 3.0, "review": "Sometimes it starts freezing up, probably due to a slow DSL connection that occurs once in awhile on my  Century Link internet service. So make sure you have a fast net connection if you want to use the Amazon Fire TV box. I bought a Chrome Cast at the end of last year, so that works as a backup, and if all else fails, I use my WII for Netflix, which always seems to work, even though it is also through Century Link. Other than those few problems I really like the Amazon Fire concept.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love it .wouldnt trade it for anything else my money well spent, love u amazon !!this is wht I've been waiting for!", "verified": true, "helpfulness": "1/3", "author": "kareem phillips"}, {"rating": 3.0, "review": "I thought it would downscale to HDI but not so much. I'm sure it would have been nice, but I had to return it.", "verified": true, "helpfulness": "1/5", "author": "Jeff G."}, {"rating": 1.0, "review": "The voice feature only seems to work with Amazon related products. If you don't use Amazon Prime, get ready to spend lots of money.It is easy to install, and the voice to text feature does seem to work well, but it will only search Amazon movies, which I rarely use because the prime listings seem so limited, compared to Roku.I am very disappointed with this product.Don't buy it, wait till they make a better one.Update: Four months later. I have found that I use this less and less, so I am thinking of getting something else", "verified": true, "helpfulness": "4/15", "author": "Kel Kel"}, {"rating": 5.0, "review": "Amazon Fire was easy to set up and works perfectly.  It is easy to use and works well with my TV.", "verified": true, "helpfulness": "0/1", "author": "DANIEL I CASTRO"}, {"rating": 5.0, "review": "We have used a wii, roku and regular cable in the past.  This offers more, is easier to navigate and minimal in design.  I love it! Amazon Fire TV will be my new \"go-to\" for gift giving.", "verified": true, "helpfulness": "1/3", "author": "natalie martindale"}, {"rating": 5.0, "review": "As much as I hate the term, I \"cut the cord\" about 3 years ago. I have had a ton of set top boxes, and I am still searching for the 'Holy Grail.\" For those that are wondering the best option is still a PC connected your TV via HDMI and a remote keyboard, but it is still not perfect.Regardless.. the only one that previos set top box (other than a PC) that has stayed connected is the Apple TV 2. Although only having it a week, I can honestly say that the Fire TV is a real contender.You can read the specs for all the juicy details, but let me point out what I notice as good (coming the the idiot that bought too many of things).-Well built; sounds silly, but pick up a Roku then pick this up and you will see what I mean (or dont and take my word for it)-Great UI; Easy and fast, no complaints here (and I dont really use the voice thing yet)-Great Content... only missing HBO Go (but they say it is coming)-Potential: ok, call it wishful thinking, its android based (and stable), allows for apps, and... has a USB. I guess some developer guys are all ready doing some cool stuff.Its a bit of a toss up between this and Apple TV, so use your best judgement- but if you have Prime, or are a religious \"android\" guy, this is probably the move.However, it is great that we now have a serious contender that can really help push these devices further.Apple can't just chill out anymore.", "verified": true, "helpfulness": "0/1", "author": "BoozeLover"}]