[{"rating": 1.0, "review": "Upon initial setup, the Fire TV needed an update.  This wouldn't have been a big deal if I could have actually updated the device and started using the thing.  The Fire TV immediately got stuck in the update loop ... i.e. downloading the update, installing the update (unsuccessfully), rebooting, downloading the update again, installing unsuccessfully, rebooting, etc ... you get the idea.  I have the device for 2 days.  I let the device go through it's update loop probably a dozen times, then boxed it back up, & I'm shipping it back to Amazon today.I was offered no explanation other than \"it's probably your WiFi that is messing up the download process.\"  While I can stream Netflix, run my laptop, phone, etc off of it (mind you I shut everything off except the Fire TV when it was downloading its update).  I then was instructed I needed to run an ethernet cable across my house to get the device to update properly.  I was quite unaware that the WiFi on the device couldn't the job done.Long story short, I'm returning the device.  May try a Roku 3.  Heard nothing but great things about it from the reviews (both in the Fire TV review and Roku 3 review section).", "verified": true, "helpfulness": "12/18", "author": "Brandon Ramirez"}, {"rating": 5.0, "review": "I just received my Fire TV yesterday. I was impressed with how easy it is to set up and use. I like how they ship it to you already configured for your Amazon account. That's a nice touch. Also, the animated video clip explaining how to use it is pretty slick. I watched several Netflix shows on it and experienced zero buffering or distorted picture. The remote works well too. One thing to note is you have to provide your own HDMI cable to connect to your TV, so if you don't have extras laying around, be sure to order one when you order Fire TV.", "verified": true, "helpfulness": "5/5", "author": "Texas23"}, {"rating": 5.0, "review": "THIS LITTLE BOX IS PERFECT FOR WE WHAT NEED IT FOR. BEEN USING XBOX 360 JUST TO WATCH NETFLIX SHOWS AND AMAZON TV SHOWS. THIS IS PERFECT AND DON'T TAKE UP MUCH ROOM AT ALL. NEVER USED THE XBOX 360 TO PLAY GAMES, ONLY GOT IT TO CONNECT TO INTERNET TO WATCH SHOWS. THE FIRE TV IS MUCH FASTER GETTING WHERE YOU WANT TO BE. LOVE THE TALK AT IT TOO. VERY COOL!", "verified": true, "helpfulness": "3/5", "author": "Allen"}, {"rating": 5.0, "review": "Bought this because my HDTV did'nt have the WiFi apps.  Love this thing. I even use the voice feature and at first I thought it was a dumb feature", "verified": true, "helpfulness": "0/0", "author": "John P. W"}, {"rating": 2.0, "review": "doesn't do any more then the roku box, as a matter of fact i think the roku is a better buy. with roku i can get every thing that amazon says the fire tv can get. there seems to be a problem getting Netflix with the fire tv.", "verified": true, "helpfulness": "3/14", "author": "David Haas"}, {"rating": 4.0, "review": "Fast, easy to use, compact and powerful.  When it finally get's MLB.TV and the announced HBO additions, I will probably upgrade this to a 5 star rating", "verified": true, "helpfulness": "2/2", "author": "Thomas M. Brizendine \"TMB\""}, {"rating": 3.0, "review": "Let me start by saying the box is very nice -- the quality of the build is very solid. The remote, however, is very \"clicky\". The round select buttons are too noisy and felt really cheap. Why not use a rubber material for that instead?Now, let's talk about the disappointing software... I know, here it comes...First of all, the Fire TV is built on Android 4.2.2. While, the device runs smoothly on it, it lacks apps. Even the Amazon's own apps lack basic or functionalities such as a qwerty keyboard layout. The TV/movie app is very disappointing. It's difficult for Amazon Prime members to use. For example, it takes 8 clicks from the main TV screen to get to the button that allows Prime members to watch the movie or TV show for free! Why is that, Amazon??? The Amazon Instant Videos app on non-Amazon devices works better than this. Also, you can add shows your watch list, but you'll have to repeat the 8 steps/clicks to watch each episode; there's no \"watch entire season\" button.I can go on and on, but I don't feel like it today... I only purchased this device from Best Buy so I could test out my apps on it. Otherwise, I would've returned it the next day. The Amazon Fire TV device IS NOT retail ready in my opinion. Or, at least, it's not made for Amazon Prime members, which sucks.", "verified": false, "helpfulness": "11/13", "author": "The Pretender"}, {"rating": 5.0, "review": "Great device!  Very responsive and fast.  I have had no issues with downloading or watching movies with the device.  Install was simple and quick.  Voice command works really well for searching for movies.", "verified": true, "helpfulness": "1/1", "author": "D"}, {"rating": 5.0, "review": "First off, this box is FAST.  No lag, it sails through the menus, apps, and listings with easeThe remote control is very easy to use and wireless.  I have had no range issues with mine at all.Video and audio quality seem to be a little better than both the smart tv apps, and the blu ray player's apps.Also have tried out the Pandora, and TuneIn apps. Both work great.The only thing I wish this had was a \"deep sleep\" or \"off\" function.  It's always on, and not sure how much power it's chewing up like that.", "verified": true, "helpfulness": "1/1", "author": "SJGreg"}, {"rating": 5.0, "review": "I read some reviews in preparation for buying this, and in comparison to my ROKU,  I see four BIG advantages to Fire TV right off the bat:  1) voice control- which will, for example enable you to watch TV in a darkened room, and, no looking for reading glasses to see the buttons on the remote, no buttons to press if you lack manual dexterity or motor function, etc.;  2) the ability to switch back and forth at will between your Kindle Fire and your Fire TV,  3) you can play GAMES with it, and  4) perhaps best of ALL, it's offered and backed by AMAZON, the most customer-centric company on the planet.  I've never seen a company as attentive to customers' concerns/needs and ready to HOP TO to address them, mentioned in many a forum discussion and in others' reviews/comments, and borne out consistently in my own many dealings with them.  (Actually, J C Penney & Nordstrom value customers too, though neither is the monolith Amazon is).  Just try picking up the phone and talking to someone at eBay about a problem!  I started as a fan of both years ago, now I do virtually (pun intended) ALL my shopping on Amazon.  They've exceeded my expectations time and time again, a VERY high batting average, while eBay did the exact opposite.My 2¢ worth.  I'll update my review once I get it, with pros and cons.  And one more thing- Amazon provides a PLACE for us to praise and blame, voice opinions, yay and nay, at LENGTH.  That in itself is evidence of how much they value customers and their opinions- where else can you do that??", "verified": false, "helpfulness": "6/9", "author": "Trancelucence \"Leigh\""}]