[{"rating": 5.0, "review": "I have an older flat screen that does not have built-in wi-fi, so having this device to cast Netflix is great!Unfortunately, I went thru a period of not being able to cast Netflix.  I was able to cast everything else, YouTube etc, but just not Netflix.I finally figured out what my problem was.  I think it had something to do with the transition from IPV4 to IPV6.  I went to my router configuration, disable IPV6, and I am able to cast Netflix again!  Disabling IPV6 was not a solution in my book.  I re-enabled IPV6, and I am back to not being able to cast Netflix.The solution: update my router firmware.  When I did that, everything works great!So now, I love my Google Chromecast HDMI Streaming Media Player!", "verified": true, "helpfulness": "0/0", "author": "T. Lew"}, {"rating": 5.0, "review": "People get real, the Chromecast is pure bang for your buck, just $35 miserable bucks vs. $100 for Apple TV. It does what it does, and it is quite proper. With the latest update, and if you have a really new smartphone like the S5, you can actually cast your telephone into de TV, so it means you can have all your apps and games on your TV. This means streaming video directly from Chrome to Android, music from spotify, watching your own videos and photos, and you can even set your phone as a camera an cast Skype, youtube, wathever. Games can be casted as well, and Android Phones can become the controlles, Bombsquad is a game on Android Market that can be used in this setting. This is the perfect gift for somebody who travels a lot, as you can have your netflix account on any hotel with wifi, and you can share your presentations is there is a HDMI compatible TV in the room. So yes, for just $35 bucks you get a lot!!! Actually, people who graded the Chromecast with one star either they have s***ty phones or slow internet connections. And as the Chromecast App is receiveng lots of updates, I feel that the Chromecast gets better and better with time.Try this, opening a free streaming movie in Chrome for Android and cast it directly into your TV!", "verified": false, "helpfulness": "0/0", "author": "Juan Algravez \"Client Très Exigeant\""}, {"rating": 2.0, "review": "Currently it's a waste of money because I do not have a compatible device to perform an initial setup.On my smartphone I have an old android version (2.x) for which no app is available.And through my Linux desktop, there is no possibility of setup and after some googling, I found this link: \"https://productforums.google.com/forum/#!topic/chromecast/OW8YCsYjQGs\".Hopefully I'll find quickly a workaround.", "verified": true, "helpfulness": "0/1", "author": "Kristoffel De Geest"}, {"rating": 5.0, "review": "Quality items at a great price.  Very happy!!", "verified": true, "helpfulness": "0/0", "author": "Dean A Caudle"}, {"rating": 5.0, "review": "Overall works very well compared to Apple TV. It freezes or needs rebooting once in a while but for the price I think its definitely worth it.  I would like to see some more functionality added like expanding the number of video sources.", "verified": true, "helpfulness": "0/0", "author": "Marc Beharry"}, {"rating": 4.0, "review": "Pretty cool, I like that out can mirror your tablet screen now", "verified": true, "helpfulness": "0/0", "author": "Joshua Dombrowski"}, {"rating": 5.0, "review": "I know I'm late to the game, but Chromecast is BALLER!!!! I can stream Plex, as well as a Chrome browser, OR just mirror what's on my phone straight to my TV! My TV Live Plus box just became obsolete. So sorry, Western Digital. To sum up, Chromecast=BALLER!", "verified": true, "helpfulness": "0/0", "author": "Aaron Campbell"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "scotty"}, {"rating": 5.0, "review": "So happy, super awesome product. And Seahawks suck,", "verified": true, "helpfulness": "0/0", "author": "Mayosol J. Ballester"}, {"rating": 5.0, "review": "Wonderful!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]