[{"rating": 5.0, "review": "I bought the Chromecast for my parents and they are so excited with the product.", "verified": true, "helpfulness": "0/0", "author": "Gladys"}, {"rating": 5.0, "review": "Convenient and useful for Android-based hardware.", "verified": true, "helpfulness": "0/0", "author": "Timothy Lusk"}, {"rating": 5.0, "review": "A lot faster to search and find movies on your phone then cast it to your TV than to wait for roku remote to catch up.", "verified": true, "helpfulness": "0/0", "author": "christopher charles piascik"}, {"rating": 4.0, "review": "The chromecast is a neat device for a low price. I would recommend a Roku or apple tv if you're willing to pay a little bit more though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I bought this for my daughters family and they love it. Were very thankful for it.The price was reasonable.", "verified": true, "helpfulness": "0/0", "author": "gerald R Coyle"}, {"rating": 5.0, "review": "Works perfectly.  Great investment for the price.", "verified": true, "helpfulness": "0/0", "author": "Sandy"}, {"rating": 5.0, "review": "It's really easy to use. I got rid of cable in favor of this little thing.", "verified": true, "helpfulness": "0/0", "author": "Brown"}, {"rating": 5.0, "review": "Awesome! does everything a smart t.v does 😃", "verified": false, "helpfulness": "0/0", "author": "jennifer"}, {"rating": 3.0, "review": "Kim", "verified": true, "helpfulness": "0/0", "author": "eduardo Ortega"}, {"rating": 5.0, "review": "This was the perfect addition to my Samsung Smart TV.  Samsung's proprietary link technology never seemed to work right and I had difficulty streaming videos from my laptop or phone to my TV.  Samsung link has problems with various video formats and often wouldn't \"see\" new videos added to the folder.  I decided to give the Chromecast a try.  Coupled with the Videostream Chrome extension, I am able to wirelessly stream literally any video from my laptop to my TV, and in high definition (up to 720p).  I also find it more intuitive for streaming YouTube videos to the TV than with the Samsung TV App.  I have had a few connectivity issues when using it for YouTube, though.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Peck"}]