[{"rating": 5.0, "review": "Works great for what we intended it to do, quick streaming from phones or tablets  The TV keeps saying 480P even when some of the content was indeed 1080p but it was defintely better picture than 480p. Luckily we still have the 480p to compare !", "verified": true, "helpfulness": "0/0", "author": "Ash"}, {"rating": 3.0, "review": "My Bluray player takes too long to load Youtube and Netflix apps, so I'm using Chromecast for that. You don't get any ads when playing YouTube videos, a small nice bonus. Also after a couple of updates it finally started to play videos from ewas the reason  mbedded flash players in a mobile version of Chrome, so you can also watch Vimeo in HD quality. Software is still on a rough side, you'll have to reboot your tablet sometimes. Couldn't figure a simple way of streaming local media files, which I wanted it to do when considered this purchase.", "verified": true, "helpfulness": "0/0", "author": "Dmytro Aleksyeyenko"}, {"rating": 5.0, "review": "Excellent gizmo! Love it!", "verified": true, "helpfulness": "0/0", "author": "Dr. Yvon Araktingi \"alfie99\""}, {"rating": 5.0, "review": "Its Chromecast. Not Air Play. As a result it rocks so awesome it will make you feel like a rock star yourself. I am yet to find anything wrong with this device. (Sometimes they die. Call Google and have them get you new). I don't even have cable anymore. Netflix, Crunchyroll, Amazon & Internet is pretty much all you need. Yes it will even play flash based video from you phone. (Need an app). It will even bestow its greatness onto iPhone users. Flash too? Oh, you are funny. But if you buy iPhone 6 you can have 2012 NFC tech.", "verified": true, "helpfulness": "0/0", "author": "Baltazar"}, {"rating": 4.0, "review": "So cool", "verified": true, "helpfulness": "0/0", "author": "William Oldham"}, {"rating": 5.0, "review": "Works good", "verified": true, "helpfulness": "0/0", "author": "Nury Gomez"}, {"rating": 5.0, "review": "We love this thing. It works very well.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Read To Know\""}, {"rating": 4.0, "review": "Would be better if it supported the 5 GHz frequency range.", "verified": true, "helpfulness": "0/0", "author": "RT"}, {"rating": 4.0, "review": "Hey it works, It is more convenient to transport and connect than anything else I've seen.", "verified": true, "helpfulness": "0/0", "author": "Mitchell Biles"}, {"rating": 3.0, "review": "Didn't really find any use for it.  Worked okay though.", "verified": true, "helpfulness": "0/0", "author": "AzDayton \"- Dayton\""}]