[{"rating": 5.0, "review": "Great Product. Was very quick and easy to set up. great way to entertain family and friends.....Who needs cable now!! lmao", "verified": true, "helpfulness": "0/0", "author": "Deborah"}, {"rating": 2.0, "review": "I am having a difficult time connecting to my wi-fi.", "verified": true, "helpfulness": "0/0", "author": "Sandra Brown"}, {"rating": 5.0, "review": "Love it, I have canceled my cable and now enjoy Netflix and all else of the computer and other places, streaming is amazing", "verified": true, "helpfulness": "0/0", "author": "Douglas R. Hudspeth"}, {"rating": 3.0, "review": "It does not work with Amazon video streaming", "verified": true, "helpfulness": "0/0", "author": "DavidJT \"Criminologist\""}, {"rating": 1.0, "review": "I bought this because my old flash drive finally gave out and I love chrome and when I tried putting my games and movies on here it did not work. I called amazon and they just just said \"....really?\" And hung up. I'm sorry but I would enjoy this flash player with music and movies on here.", "verified": false, "helpfulness": "1/8", "author": "The1and0nly"}, {"rating": 4.0, "review": "I've enjoyed using this device a great deal for YouTube, Netflix, HBO Go and other services. The only Issue I have with it is that its output doesn't seem to jive well with my older Epson projector. All other devices display fine (blu-ray player and cable DVR), but the ChromeCast display is \"zoomed in\" with the edges omitted. My projector doesn't have an overscan setting that lets me correct it.", "verified": true, "helpfulness": "0/0", "author": "Charles West"}, {"rating": 5.0, "review": "Love it, love it! Use it everyday along with some bunny ears and I am FREE FROM TIME WARNER!! WOOOOOOOOOO!", "verified": true, "helpfulness": "0/0", "author": "S. Yee \"amazoncricket\""}, {"rating": 4.0, "review": "Chromecast easy to setup. Youtube cast really works good.But casting from Chrome PC browser is  distorted and out of sequence.", "verified": true, "helpfulness": "0/0", "author": "Seth"}, {"rating": 5.0, "review": "Love it! Makes my television become a Smart TV.", "verified": false, "helpfulness": "0/0", "author": "Vladimir Bien-Aime"}, {"rating": 5.0, "review": "I wish Google made everything...This little guy came in the mail, and i thought, well let's see how this works.I unpacked it, and plugged it in. Setup was a breeze and I was watching Netflix in less than 10 minutes (including the software update).It is well made, durable, and ULTRA PORTABLE, especially when compared to its competition (e.g. Apple TV, Roku). I throw it in my briefcase when on the road and plug it into my hotel room TV. So nice. Control via smartphone is so logical and easy.For $35, you can't go wrong. ~20,000 other reviews can't be wrong!", "verified": true, "helpfulness": "0/0", "author": "C. Wells"}]