[{"rating": 4.0, "review": "I really enjoy this product, hoping in the near future Google chromecast can work with more apps such as Directv everywhere", "verified": true, "helpfulness": "0/0", "author": "Andres Gutierrez"}, {"rating": 4.0, "review": "So far it works as advertised! It will be better when they add more viewing options. I really enjoy using Chromecast! I can now watch tv in another room without keeping anyone else up at night.", "verified": true, "helpfulness": "0/0", "author": "Nancy Lewis"}, {"rating": 1.0, "review": "I have to unplug the unit and plug it back it each time I turn my TV on and off. It's fairly annoying.", "verified": true, "helpfulness": "0/0", "author": "Zachary Kaveney"}, {"rating": 5.0, "review": "For SOME reason the person I call honey bunny seems to think the ONE and ONLY way to hook this here puppy up is to reach over yonder to the far reaches of the TV WAY up high! To the TOP of the TV - where for some unknown reason, he's unable to reach ... or perhaps there's something already plugged in - but I think it's pure laaaaa ... eh hem let me pull myself together, I think my dear husband being only 6'2 can't reach that high, and is having trouble locating the place to plug this in.Well, low and behold when I told him I actually read (the other day that it COULD be hooked into an audio or video device! And didn't HAVE to be hooked into the actual television!)I hooked it into the hdmi port on the Netflix box, but haven't had a chance to try it yet ... will report back when I find the remote my teenage son is \"borrowing\"! : )", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "same with this device.cant connect and a waist of time and money big time.apps,and more apps,and more money,still not connected...", "verified": true, "helpfulness": "0/1", "author": "Anthony"}, {"rating": 5.0, "review": "This HDMI connecter Chrome Media Player was easy.  I plugged the Chrome stick into my HD TV and used my tablet to go to their setup site.  I logged in the code that popped up on the TV.  I find videos on my tablet and send it to TV via connected Chrome media stick.  So now I can watch YouTube, HuluPlus, Netflix...videos on my TV and use my tablet to surf net, play games or check email.", "verified": true, "helpfulness": "0/0", "author": "msschemist@yahoo.com"}, {"rating": 5.0, "review": "Loved my first one so much I bought a 2nd.  I'm finding more and more uses for this lovely $30 piece of magic.  I have a tablet and a phone so I'm able to control 2 Chromecasts at the same time.  Also being able to control it from my computer to stream a tab from my internet browser is nice too.  I'd recommend this for anyone that doesn't want to always use an xbox or ps4 or expensive computer to stream Netflix and Youtube to your tv.  It's nice I can sit back, put on a show... even control the volume from my tablet or phone.", "verified": true, "helpfulness": "0/0", "author": "Matthew"}, {"rating": 5.0, "review": "...You just need to uninstall Microsoft Silverlight from your computer, and tell Chromecast to stream through Flash Player (you should get this option the first time you try to stream from Amazon Prime).  Of course you need to install Chromecast first, but the installation worked flawlessly on our system.Once you do this (and that's all simple to do), it works fine.  I suspect from other reviews that how well it works depends on your Internet speed, and how far your TV is from your router.  Some people report poor resolution or hangups in play... we have not had these problems, and it works fine for us.Very happy with it.", "verified": true, "helpfulness": "0/0", "author": "Phil Clapham"}, {"rating": 4.0, "review": "I love this little device!Pros: Portable, easy to setup, great for streaming from devices, google support.Cons: The device is still a little dry... I'm sure this will change as time goes on.", "verified": true, "helpfulness": "0/0", "author": "Alex B."}, {"rating": 5.0, "review": "Works great with netflix, hulu and youtube. Unfortunately this doesn't work with amazon video and apple just yet. Pretty amazing IMHO.", "verified": true, "helpfulness": "1/2", "author": "elkath"}]