[{"rating": 5.0, "review": "I grabbed one of these so I could stream Google Music to my receiver.  I was not expecting much but was impressed by the audio and video quality, simple setup, and ease of use.  Oh, yeah, and the price :-)", "verified": true, "helpfulness": "0/0", "author": "salhadef"}, {"rating": 5.0, "review": "My husband bought this item following the Google event.  I thought he was crazy.  And he usually is, as techgeek.  The item arrived today and he was able to get it all to work, effortlessly, in 5 minutes and I was able to stream all of my YouTube subscriptions without fail.  We don't have a Roku box or SmartTV, but this works really well, and subtracting the 3 free months of free Netflix, is a great value at only $11.  My husband is crazy, crazy smart, I'd say.", "verified": true, "helpfulness": "0/0", "author": "Trinh Tran"}, {"rating": 5.0, "review": "The Chromecast (while not huge right now as far as developer support goes) is going to be HUGE!!!  For 35$ Google has figured out how to have people interface with their \"smart\" TV's.  Netflix is only the beginning people.  Next up will be Hulu Plus, Plex, and everything you could imagine being on your Tv's.... plus, for 35$, what is there to lose?  GO BUY ONE!!!!", "verified": false, "helpfulness": "0/0", "author": "Kenneth B. Hurst"}, {"rating": 5.0, "review": "Got this for my bedroom TV which is not hooked to cable.  Was up and running in less than 10 minutes. Youtube, Play Music and Play Movies work like a charm.  The mirroring of Chrome tabs on my laptop is laggy however but frankly I'm at the far reaches of my weak wifi plus it's beta so hopefully will get better with time.  It's 100% intuitive and the remote and interface is as easy as it gets: there is none!  That is the brilliance of this thing: grab whatever device you got, hit the cast button and that's it.Personally I think Google has a huge winner here and I really hope to see that little cast icon on more and more apps asap!", "verified": true, "helpfulness": "2/3", "author": "Robert"}, {"rating": 3.0, "review": "I purchased this item the day it came out at 4 pm CST. My Chromecast just came in the mail today and I cannot find my free 3 months of Netflix code. Since I ordered this item before the deadline listed above I can't understand why my order didn't contain the Netflix code. If anyone can help me in solving this mystery I would be very appreciative.", "verified": true, "helpfulness": "0/13", "author": "Wubnub"}, {"rating": 4.0, "review": "Hi all, I just got my ChromeCast and hook it up via the provided USB power cable. I have an older TV where the HDMI does not have the power need, so I have to use the USB. I plugged it into my Kill-a-Watt and it only uses 1.8W when streaming content! .02 amps, very little power is needed to run this dongle. I did notice that it runs VERY hot, might get some heat off the TV but its pretty hot.I have not been able to really get the youtube playlist feature to work yet, and when bouncing around from iphone, ipad to computer it does not really play nice yet. I might need to reboot everything and try again tomorrow.I wish the device shipped with more apps that supported it, maybe google should of held off the launch and just show off the SDK to get devs on board. Oh well, its a really cool piece of hardware that has TONS of potential, its just up to Devs to make this a killer \"set top box\"", "verified": true, "helpfulness": "2/3", "author": "Socbrian"}, {"rating": 5.0, "review": "just got the unit delivered by mail, ordered it in  the first few hours after it went live from the company website. got a code emailed for the netflix offer to me in a separate  email as promised. hooked it up to the spare input on my Samsung tv. first tried to hook it up via desktop, not possible if the desktop is on a wired network, it has to be wireless. fired up my trusty win 8 Lenovo touch and then the set up was a breeze. disconnected the unit and hooked it up to an empty slot on my receiver. worked like a charm. tried the native Netflix and you-tube apps and they both work, so does Pandora if pulled up in the chrome browser. in fact it does mirror the browser, remember it pulls everything directly from the web so it might actually be faster than your laptop. it does transmit everything in hi-def onto the screen and 5.1 Dolby audio, tested it with a feed of frozen planet from you tube. that's all for now", "verified": false, "helpfulness": "3/4", "author": "hard worker"}, {"rating": 5.0, "review": "Internet connected TV devices have always failed because they rely on a 20+ year old device to navigate, the remote control. Google has just eliminated that step in a big way with the Chromecast. Choose your content, click a button, and boom! My TV turns on, switches to the correct input and plays my content. It doesn't get any more simpler or better than this folks.", "verified": true, "helpfulness": "3/4", "author": "AndyDL"}, {"rating": 5.0, "review": "I ordered my Chromecast on the day it was announced and just received it today.  My tv is a 2006 40\" Samsung LCD, so it's an older set and not smart.  Before the Chromecast, I was using my Blu-Ray player for YouTube and Netflix playback, but it was a cumbersome enough process that I hardly watched either of those on my tv.  It's not that it took a super long time to boot up, but it was a multiple remote control process that took enough time that I'd rather just watch videos on another device.  In just a few minutes with my Chromecast, I was swiping through movies and videos on my tv and was immediately extremely pleased with my purchase.First, the price made it almost a no-brainer to try out.  When I received it, the packaging was simple and nice.  The scant directions on the box are all you need to set this up.  It took just a few minutes to plug in and set up with my laptop.  I was guided along the process with very simple, easy to follow instructions.  Within five minutes of taking it out of the box, I was loading up my first Netflix show.  I set it up to work with my phone (DROID Razr Maxx HD) and tablets (Nexus 7 and 10).  Using my phone as a remote was cool.  When waking my phone up, a nice fullscreen showing my current Netflix show with options to pause, stop, and rewind were displayed.  Being able to make calls and send texts while controlling playback was amazing.This is a great little addition to anyone who doesn't have a smart tv and would like something easier and seamless to view Netflix with.  It doesn't take up any space on your entertainment center and it makes watching videos a breeze.  Because of my Chromecast, I'll never have to juggle three remotes or wait for my Blu-Ray to boot up and load.  That in itself makes this purchase a winner.  I'm excited for the future apps and compatibility that will surely come in time.  For now, though, I am extremely pleased with my Chromecast and would highly recommend it.", "verified": true, "helpfulness": "2/3", "author": "R. Adams \"Ms. Adams\""}, {"rating": 5.0, "review": "I gave up cable a while ago and watch most of my TV through Netflix. I also have all my music on Google play. So you can imagine my excitement when this was announced. It fits right into most of the products I use and was a no brainer purchase. Easy to setup, works with relatively few hiccups for being a beta product. For me it is already worth the $35 dollars and then some. The fact that as more companies update their products to support it it should get better is just icing on the cake for me.", "verified": true, "helpfulness": "3/4", "author": "Jose Castro"}]