[{"rating": 3.0, "review": "We like the FireTV, but it gets annoying when streaming video starts to chug. They should add a restart function into the product so that you don't have to pull the plug on the device to get it to restart.", "verified": true, "helpfulness": "0/1", "author": "Simon"}, {"rating": 4.0, "review": "Like it a lot so far....seems faster than my Roku Stick was...I am however still getting used to having Amazon as the main page and finding everything, I still haven't found my recently watched section.  I do think it is cool that you can play your Amazon music so easy and have it playing while you are picking out something to watch.  Easy to setup and use....my 9 yr does great with it.  I gave her my Roku stick for her tv..the only thing she likes better is the Roku remote because it has the Netflix button.", "verified": true, "helpfulness": "0/0", "author": "Celeste Malone (Stubblefield)"}, {"rating": 5.0, "review": "This is the most convenient streaming device on the market.  Setup was a cinch and navigating titles is really simple.  All you have to do is push and hold the microphone button and say what you are looking for and it comes up!  A must have!!!!", "verified": true, "helpfulness": "0/0", "author": "mcpopp \"Marti\""}, {"rating": 5.0, "review": "This gizmo is a trip, man.  It opens new vistas of television viewing.  I may never watch cable tv again.  There is a problem with Amazon Prime. Many of the programs and movies that were available when prime was $79 a years are not available now that prime costs $99 a year.  Must be a new business model.....like going from a mercedes to a pinto.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product, easy set up and to use.", "verified": true, "helpfulness": "0/0", "author": "Kenneth M. Runne"}, {"rating": 5.0, "review": "This was a gift. I already have 3 apple TV's and the Amazon Fire TV is much faster and better in every way accept for the adds on it..", "verified": true, "helpfulness": "0/0", "author": "Larry Foster"}, {"rating": 5.0, "review": "My Amazon Fire TV is my new favorite thing in the house. I love the voice search and the remote makes it easy to view and select items. It was so easy to set up and get started. The parental controls are great and easy to manage. The free time space is great for my 5 year old. It gives her the ability to choose from all her favorite characters. I love the fact that it gives me the reassurance that she is watching only kid friendly shows and that the remote prevents her from navigating outside of the kid space.", "verified": true, "helpfulness": "0/0", "author": "Maat_6V"}, {"rating": 4.0, "review": "This gadget is a wonderful device. I have been borderline disappointed a few times due to internet delay.  I use \" somewhat\" because my disappointment hardly has time to become a problem.  Too much entertainment available - so many choices!!  At my age, I have to choose carefully when adding to my watch list!!", "verified": true, "helpfulness": "0/0", "author": "Susan D."}, {"rating": 5.0, "review": "Been using this around six months. Great pic quality superfast loading and awesome voice recognition feature that ACTUALLY WORKS!!!! Now that HBOGo is available on this unit why buy anything else. Worth every penny. Only issue for me is why can one not bring up prime music with this", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Needs more app support, still missing VUDU which pretty much all other players support.  Sometimes netflix playback is choppy, which I have not seen on my other players (WD TV Live, Samsung Smart TV, XBox One, Sony Blu Ray Player, etc).It is very centered around Amazon Prime, but I wish it had a better dashboard (home) page more akin to Roku, Samsung Smart Hub or WD Tv Live.  It takes awhile to get used to finding what we really watch most often (Netflix, Plex) since its all Amazon centric.Speed of the device is very good, most responsive media player we have.  Plex app is good, plays videos at highest quality without issue. (1080p with 7.1 surround sound via direct play).We are considering returning it, and getting a ROKU instead but have yet to decide.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}]