[{"rating": 5.0, "review": "Buying Amazon Fire TV is easily the best entertainment investment I've ever made. So small, so simple and so amazingly easy to use. I've been an Amazon Prime member for years. The unit came pre-programmed from Amazon with all of my account information, so it really was open the box, plug and play. I initially joined it to my wi-fi network, but the room where we set it up gets some network interference from neighbors' networks, so a relatively small additional purchase for powerline adapters (Amped Wireless Powerline Nano AV500 1-Port Network Adapter; from Amazon, of course) and I now have it wired to my home netwotk via ethernet where it has performed flawlessly.  The only small hitch occurred after two months of steady use where we saw that a few random episodes of some TV shows suddenly became unavailable. It wasn't network related, so we contacted Amazon Customer Service through the Amazon Fire TV menu, and the Amazon rep talked me right to the option to empty the cache, and suggested we do that weekly or so to avoid any future issues. I have not used Roku, Apple TV or other similar products so I cannot offer a comparison, but we could not be happier with the performance, the available Amazon content, and the overall experience of this product.", "verified": true, "helpfulness": "1/1", "author": "Jon H. Greenlee \"jong50\""}, {"rating": 5.0, "review": "This product is amazingly easy to set up, transport, and use!", "verified": true, "helpfulness": "0/0", "author": "MM 44888"}, {"rating": 3.0, "review": "I tried it for few days and then returned it as it doesn't have what I wanted, keeping in mind that I have Logitech Review (Google TV)Lets start with pros first:1. Voice search is really good.2. easy to setup.3. Easy to operate.Cons, reasons due to which I returned them back:1. There is no browser (really a big down for me)2. There is no key board, even though it has very good voice search but keyboard is keyboard and voice search can not beat. Specifically like login to any account (userid/pwd), setting up the system, etc it really gets frustrating.3. Not good support for DLNA/Network media play.4. Limited apps", "verified": true, "helpfulness": "1/2", "author": "Bhawani Shanker \"Shanker, bayarea\""}, {"rating": 4.0, "review": "I have the Roku and Chrome cast along with the Fire TV. I keep the Roku in the bedroom, the Fire in the kitchen and the Chrome in my office.  The Roku is in the bedroom because, unlike the Fire, it has a headphone plugin.  This way I can stay up and watch TV while my wife sleeps next to me.  If the Fire had a plugin for my headphones I would have purchased two Fires instead of the Roku.  The chrome is in my office because it easily interfaces with my phone, laptop or tables; the fire is completely incapable of this.  The Fire is completely for R&R; instead of work.", "verified": true, "helpfulness": "2/3", "author": "Jacob"}, {"rating": 5.0, "review": "I bought this despite the Gary Busey ads and it has since replaced my Roku 2nd gen - it is much faster, menus are more intuitive, and the Hulu Plus interface doesn't take its sweet time to load like the Roku does.  The voice feature works really well, and you can also ask for more involved things like \"french movies\" or \"romantic movies\", err, I mean \"movies with robots in them\". I also have an Apple TV, but I keep that one for mirroring off the ipad and accessing my home iTunes, but I could always get a newer gen Kindle Fire and mirror off of that.", "verified": true, "helpfulness": "0/0", "author": "R. Carboni"}, {"rating": 5.0, "review": "Amazon fire is awesome! Both my daughters have asked for their own box. Both feel that we no longer need to pay 300.00 per month for cable.", "verified": true, "helpfulness": "0/0", "author": "Joi J"}, {"rating": 5.0, "review": "I loved the Fire TV but returned it as the main reason I was interested in it for could not be fulfilled.  I thought this would be a great option when I travel with my kids.  They could stream movies without taking over my computer or lugging a bunch of DVDs.  It is also very portable.  Unfortunately, due to the lack of a web interface, I was unable to accept the terms and conditions for accessing the wifi at the resort we were at.  They kids ended up taking over my computer anyway.  Also, when I tried it out, the parental controls were not part of the OS yet.  I will look at it again when/if these issues are overcome.  With internet-ready bluray players, our Xbox360, Wii, tablets, and computers, I could not justify another electronic device that can only be used at my home.", "verified": true, "helpfulness": "0/1", "author": "Carey Baker"}, {"rating": 1.0, "review": "Totally disappointed with the Amazon Fire TV. I have ordered Amazon fir TV, got delivered by right time.. Totally excited about it and could not find HDMI cable inside the box . This is my worst experience I ever had from Amazon products. No HDMI cable inside the box is making me wait for few more days to hold on playing games and watch TV. Very bad about Amazon, they didn't mention anywhere about this. shame on Amazon, they neither provided explicit information neither suggestions neither cross selling option about this simple $5 accessory FULL-too disappointed today !!!", "verified": true, "helpfulness": "1/23", "author": "Satya"}, {"rating": 5.0, "review": "We love our Amazon Fire TV!  We did have to buy a new wireless router as our internet and Fire TV kept crashing.  It was a small investment and worth it.  I do wish that the Netflix app would function more line the online version.  I miss having my queue and such.  Other Apps are great too.  LOVE Pandora!", "verified": true, "helpfulness": "0/1", "author": "T. Ebert"}, {"rating": 5.0, "review": "this is a very good product love it", "verified": true, "helpfulness": "0/0", "author": "ALEXANDER LONDN"}]