[{"rating": 4.0, "review": "I like the fire TV features and options. It would have gotten 5 stars if it had a power button and didn't have so many issues with Netflix App. Which is the main reason I purchased the fire TV. When you call to report the issue one tech will tells you that you have to reset the entire device which means you lose all data you have on the device. Another tells you something different. They need to fix this issue asap", "verified": true, "helpfulness": "2/2", "author": "Crossed"}, {"rating": 5.0, "review": "It is fantastic! We have no cable  available as we live in the country. The price is unbeatable for the content!  Love, love it!", "verified": true, "helpfulness": "1/1", "author": "Thomas J. Virant"}, {"rating": 5.0, "review": "It is so fast, and being able to voice search is great since it actually works. I have had AppleTV and a Roku and this is my favorite so far. My kids love being able to play games on it.", "verified": true, "helpfulness": "1/1", "author": "Bobby \"Bobby Edgar\""}, {"rating": 5.0, "review": "We love it! Another great Amazon product. And we all thought that Google was going to take over the world!!! Wrong... It's Amazon!!!", "verified": true, "helpfulness": "1/1", "author": "Sigkill(9)"}, {"rating": 3.0, "review": "This wasn't really what I expected for the price.  I ended up returning it and buying something else instead.", "verified": true, "helpfulness": "0/1", "author": "Andrea"}, {"rating": 5.0, "review": "Gave this to my husband for his birthday.  He loves it.  If you want to dump your Cable company this is what you need to get.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "General: I don't use cable or satellite TV so I rely on Netflix and now Amazon for non-over the air TV content. As a Prime member, I had rarely taken advantage of the Prime instant videos since my “smart” TV is apparently only smart if one is only in elementary school and I was forced to view the Amazon content on a laptop.  FireTV seems to compliment Netflix well since it has a lot of content not found on Netflix and I find the Prime content has enough choices to make the purchase of the FireTV worthwhile. It should be noted I subscribe to Prime mostly for shipping, so Prime instant videos are a “freebie” for us.Installation and setup: I have to say, installation and set up was a snap. I used the TotalMount system to mount it on my TV, and because the FireTV doesn’t need line of sight to the remote, I installed the box on the back of my TV. The setup was anticlimactic since I expected to “fight” with getting the box to work and all I needed was the password to my router and it connected in a few seconds.Ease of use: While having to keep track of “another” remote wasn’t appealing to me, the included remote is uncluttered and works well. The voice search function on the remote is top notch. I tried several searches, all successful, then handed it to my wife and it had no problems with the voice change. I bought a game controller for the FireTV, so I haven’t tried to use the remote for gaming. Prime choices are clearly marked on the home/navigation screen with Prime Movies and Prime TV and are free to stream. However if you want to purchase them it will cost you.Loading: Loading of the initial games took a bit of time, but after first use they didn’t seem to be any slower than loading a game on a PS3. We have watched several shows with the FireTV and have had ONE incident of a program buffering during the show, compared to Netflix this is a VAST improvement.Image quality: ExcellentAll-in-all, I’m very satisfied with my purchase.", "verified": true, "helpfulness": "1/1", "author": "khagan1227"}, {"rating": 5.0, "review": "The Amazon Fire TV is great addition to our home entertainment system. Easy access to a lot of free Prime Movies and children's shows with our Prime membership is perfect. We also use the TuneIn Radio app to listen to international radio stations quite a bit.Setup was very easy and operating the device is simple - even for my tech-challenged husband :)", "verified": true, "helpfulness": "1/1", "author": "hekin \"hekin26\""}, {"rating": 5.0, "review": "I've had an Apple TV, Roku DS, and Fire TV, and I must say that the Fire TV is my favorite so far. It was dead simple to set up, responds quickly to input, the voice search is pretty fantastic (I haven't been able to stump it yet), and the picture quality is great on my crappy Comcast connection.I hope it lasts longer than the Roku (which stopped working 3 weeks after the warranty ran out; ever wonder why there are so many refurbished Rokus for sale everywhere?).", "verified": true, "helpfulness": "1/1", "author": "JP \"Jeff P.\""}, {"rating": 5.0, "review": "Easy to use ... smartest purchase I've made in sometime.", "verified": true, "helpfulness": "0/0", "author": "B. Gal \"wonder dog woman\""}]