[{"rating": 4.0, "review": "The usability you get from it is limitless, i use it everywhere, but the wifi is very weak and problematic", "verified": true, "helpfulness": "0/0", "author": "Rashed Ali"}, {"rating": 4.0, "review": "Awesome! Sometimes need to restart the app (Netflix) other than that very cool", "verified": true, "helpfulness": "0/0", "author": "DC"}, {"rating": 5.0, "review": "Greatest invention ever.  The only problem I ever had was trying to connect it to another network, but eventually after much effort it worked", "verified": true, "helpfulness": "0/0", "author": "Lisa Hardebeck"}, {"rating": 5.0, "review": "Love it use it everyday!!!", "verified": true, "helpfulness": "0/0", "author": "Nikki Stansberry"}, {"rating": 5.0, "review": "Very easy to install. Love this product", "verified": true, "helpfulness": "0/0", "author": "MIchael J Karmazyn"}, {"rating": 5.0, "review": "Best device ever.", "verified": true, "helpfulness": "0/0", "author": "Lucas R."}, {"rating": 4.0, "review": "Good.", "verified": true, "helpfulness": "0/0", "author": "Jeff Davis"}, {"rating": 5.0, "review": "Love this device! We recently cancelled cable and have been using this to stream Netflix to our tv and play Just Dance. We have not had any issues with it at all. The biggest pro for me is that I can stream with my phone, but I can still use my phone to do other things. It does not tie up my screen at all. My kids love looking through pictures on the tv, instead of looking at the smaller phone. I haven't found any cons at all. Highly recommend the device.", "verified": true, "helpfulness": "0/0", "author": "Monica Scott"}, {"rating": 5.0, "review": "So far so awesome!  I've had Chromecast for a week and love it.  No more YouTube, Netflix on my tablet or itty-bitty phone screen.  Much more rea$onable than buying a smartTV that I will hardly take advantage of.  Really good internet access is needed since there can be lags w/WiFi viewing.  I have no complaints.  Easy setup and use.  Highly recommend this.", "verified": true, "helpfulness": "0/0", "author": "Not Hidden"}, {"rating": 5.0, "review": "Chromecast is hands down the best casting device available on the market right now. So many different options from Twitch, YouTube, Plex Media Server, Netflix, Hulu, HBO, can mirror the screen from my iPad, Samsung S4, Macbook Pro, etc. Uses very little power (had this plugged into the hdmi port of a projector with the power leading into a portable anker power brick), WiFi range is great in my experience, no overheating issues, very versatile little device.Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "B. Obama \"Barack Obama\""}]