[{"rating": 5.0, "review": "At first it was just cool to stream HD Netflix and YouTube on my TV.  Now, with the addition of Hulu+, Pandora, and RealPlayer Cloud, I am very very pleased.  The boyfriend liked it so much he got one for his TV, too!", "verified": true, "helpfulness": "0/0", "author": "A. YOUNG \"A.M.Y.\""}, {"rating": 5.0, "review": "So once I received it - the right out of the box plug in to my tv. The setup took a bit as anything does, just go thru the steps. I believe that there was one earlier review that outline the setup well and I referenced back to those instructions. My drawback on this is that I got it set up to my Kindle and I can send only Netflix from there but not movies from my Prime which stinks or any of the other sites that I can send from my laptop like PBS, Natgeo and others, as examples. So once sent to the tv from the laptop II need to close the top down but not all the way or you cut off the item you are watching. No biggie set it in another area to not distracted by the screen (make sure you have it set up for not timing out on you program you are watching). Did not bother setting up on my phone due to my data plan and that is fine.All in all I do highly recommend it for it's value if you are not one for the blue-ray or other high tech gadget cannot go wrong for the price or for someone like my mom that still has a vhs hook to her flat screen :) and plan on getting her one as well so she does not have to watch her missed shows on her laptop and can throw them to her TV.", "verified": true, "helpfulness": "0/0", "author": "Sapphire Reader \"I am a audio book lover turned Audio Book Reviewer since Nov '14. Love it and now started my own review blog featuring all the reviews here!\""}, {"rating": 3.0, "review": "This is a net little unit for a tv that has no streaming player or console on it.  It does work well, but is quite limited in what it can stream.  This product is screaming to get hacked and opened up to other streaming sources.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Chromecast HDMI player was extremely easy to install and set up.  People who want to order this need to make sure their TV allows HDMI input.  I have used this for Netflix and Xfinity and find it works well.  If you have a slow internet hookup, you might experience some slowness in getting the movie.  Also, on a slow internet connection the sound and actual movie action might be a second off (not syncing up exactly as it should).", "verified": true, "helpfulness": "1/1", "author": "PM \"peterom\""}, {"rating": 5.0, "review": "So easy a cave man can do it. I absolutely love how easy and elegant it is.- ProsEasySmallEffectivePicture quality is greatWifi has never had a problemIt just works- ConsNot a lot of app support (yet)", "verified": true, "helpfulness": "1/1", "author": "Tyler"}, {"rating": 1.0, "review": "I purchased this hoping for a quick set up as I read most of the reviews said this. However this did not happen at all!After four hours and several phone calls to google and my Router Company, not one tablet or phone could find this in the Wifi setting. We changed all the settings as suggested by Google and had no luck. It went on and on, till I gave up.Please be aware if you have an Actiontec Router, that it most likely will not work - unless you have a Smart TV or Mac TV, which I do not. I have a newer TV with all the proper HDMI ports, USB ports, etc, but Chromecast is not compatible with the Router I use, as provided by the Fios Company I use.Google needs to look into this. I am returning it to Amazon and will look into purchasing something else like the Roku HD streaming player as one other reviewer suggested. The only good thing is that the cost is low, so it wasn't a big investment. However don't waste your time or money on this one. You might be disappointed.", "verified": true, "helpfulness": "1/1", "author": "peaceful"}, {"rating": 5.0, "review": "I love this chromecast, and is easy to set up easy to use, I use it with hulu plus, but you can also use it with netflix it's nice to be able to watch what I want on my big screen instead of trying to find some I don't really care about that is on dish or cable.", "verified": true, "helpfulness": "0/0", "author": "Maurine Negron"}, {"rating": 5.0, "review": "This little thing is the best money I have invested ever, I now own three, ordered two and asked my friend to get me another for chritsmas, so now I have one for each room. So now I have 3 Smart tvs at home with out have to pay alll the extra hundres for them. I love chrome cast, the best way to entertain the kids. Hey I can play my pandora here right on the tv. and cast the pc tabs, it only needs to work on a few glitches on making the pc casting a bit faster, but all the other cast, like youtube netflix pandora hulu, hbo, work great! they now just need to keep expanding!!", "verified": true, "helpfulness": "0/0", "author": "Daverba Cruz"}, {"rating": 4.0, "review": "Would rate a 5 but it tends to run hot and apparently sometimes it messes up and loses it's Wi-Fi connectivity and all associated information.", "verified": false, "helpfulness": "0/0", "author": "DrLysurgery"}, {"rating": 1.0, "review": "I thought this was similar to a ROKU, I could not have been further from the truth. This product streams from one device to another and the time to set it up is not worth it. There are no built in apps, so if you think you can plug this in and pull up various apps you too will be disappointed.For instance, you want to watch Youtube, Netflix or Hulu on your tv and your tv is not a smart tv, If your tv has a usb port, you can plug the dongle in, use your laptop and stream the desired video to your tv. Save yourself the hassle and get ROKU, its great.", "verified": true, "helpfulness": "2/2", "author": "Matthew Whitfield"}]