[{"rating": 5.0, "review": "Chromecast works amazingly well. I am able to stream data from my tablet, laptop, and other devices on my network flawlessly. I highly recommend this device. If this could turn on my tv too (probably possible; haven't investigated), I would consider it the best device in its class. I particularly like being able to stream my screen as is, rather than using pre-constructed applications.One possible qualification is network/router speed: use the channel with the highest bandwidth possible for best performance. I run it on a 5 GHz network; your mileage my vary.", "verified": true, "helpfulness": "0/0", "author": "David Martel"}, {"rating": 5.0, "review": "Works as advertised - easy to install, easy to navigate. I've accessed it from my laptop, desktop, tablet and phone. I wish it was more compatible with Apple products, but I completely understand why it isn't.", "verified": true, "helpfulness": "0/0", "author": "Phantom76 \"Phantom76\""}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Armen"}, {"rating": 5.0, "review": "One of the best invements I've made!!! now i rent all my movies from youtube and stream to my TV", "verified": true, "helpfulness": "0/0", "author": "C. Garcia \"Charlie Garcia\""}, {"rating": 5.0, "review": "Just about the best little gadget I ever bought. Love it!", "verified": true, "helpfulness": "0/0", "author": "John Hogan"}, {"rating": 5.0, "review": "works fine..but since i am in asia cant use it for netflix or hulu. will need livecast to do screen mirroring.", "verified": true, "helpfulness": "0/0", "author": "cardiodoc"}, {"rating": 2.0, "review": "really doesn't seem to work very well.  the picture displayed on the TV is choppy and difficult to view.", "verified": true, "helpfulness": "0/0", "author": "lowstress"}, {"rating": 1.0, "review": "Didn't work with Netflix app returned and bought trustee apple tv", "verified": true, "helpfulness": "0/0", "author": "Chloe Beemer"}, {"rating": 5.0, "review": "it's super , I love it", "verified": true, "helpfulness": "0/0", "author": "B. D. Gray \"photo lover\""}, {"rating": 1.0, "review": "The Chromecast is definitely not what I expected. I thought I would be able to access Youtube and Netflix directly from my TV, but I guess this is my fault, I should have known better before purchasing it.When I try to stream a movie from my notebook, the quality is not really good and somewhat lagish. The share screen function on my Android phone works until some point and after some time, it crashes. When I try to stream both audio and video, it doesn't work at all.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]