[{"rating": 1.0, "review": "Rogu is much better", "verified": true, "helpfulness": "0/0", "author": "Lionheart"}, {"rating": 5.0, "review": "So far this past month or so...Love it!! I haven't had any problems with the decide at all at least yet. Set up was so easy for this device. And for my computer/phone etc to broadcast on it. Only issue I had was when I visited a different country and brought it with me it would get to where it almost loaded the movie then just stop. But in the us. No problem at all.I also just love how small it is and easy to travel with and use in some of the hotel rooms I've been in as well.", "verified": true, "helpfulness": "0/0", "author": "December"}, {"rating": 5.0, "review": "I am loving the chromecast. I used to have to hook my computer up to my tv with hmdi cables and then I couldn't use my computer for other things. Now no cables are needed and I can still browse on the computer while one window is streaming to the tv! The set up was a little tricky because we have a soundbar and had to figure out how to get it to play the sound through that but all we had to do was plug it directly into the soundbar and change a setting. The only thing I have had a few issues with is that with some websites when streaming to the chromecast the sound is very low so we have to turn the sound bar to the max. But other then that it has been fantastic.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "We have two of these and LOVE them. We have one for each TV and it makes it so easy to watch netflix, amazon prime, hulu, youtube, and other stuff off the internet. We do not have any sort of cable on one of our tv's and this makes it so easy to watch shows, movies or play music. There are a few small glitches with Netflix but I can't blame this chrome cast. The Chromecast plays Netflix but will stop and exit after 1 episode. It is a small annoyance to keep your lap top open and restart it each time but it only takes an extra few minutes.", "verified": true, "helpfulness": "0/0", "author": "Valerie"}, {"rating": 5.0, "review": "does what it says", "verified": true, "helpfulness": "0/0", "author": "Keith Strozewski"}, {"rating": 3.0, "review": "We use ours all the time! It's nice to be able to stream almost anything you want to(via iPhone). The only problem we encounter is it overheats. This causes it to freeze up and we have to unplug it, wait a few minutes, and plug it back up. This may be covered under warranty. Haven't checked. All in all, great product.", "verified": false, "helpfulness": "0/0", "author": "Jonathan Gaultney"}, {"rating": 5.0, "review": "A great streaming solution. My phone will always be a superior remote when compared to a roku's or amazon fire's remote.", "verified": true, "helpfulness": "0/0", "author": "Leonardo Castro"}, {"rating": 5.0, "review": "works", "verified": true, "helpfulness": "0/0", "author": "Peter J"}, {"rating": 4.0, "review": "It work good", "verified": true, "helpfulness": "0/0", "author": "Johnny"}, {"rating": 5.0, "review": "I have purchased several of these since once I had one, everyone around wanted one too.  They are a great buy and do a great job.", "verified": true, "helpfulness": "0/0", "author": "Donna"}]