[{"rating": 5.0, "review": "This is hands down my favorite thing i have ever bought on Amazon.  The Chromecast has opened my family up to a while new world of entertainment.  Yeah maybe it has less features than Apple tv or Roku.  For the cost it is amazing, has never let us down, and I really enjoy streaming from my phone to the t.v. easily.  It makes those funny videos I want to share with my family that much easier to view.  I would recommend this product for any and all people.", "verified": true, "helpfulness": "0/0", "author": "Jason Witter"}, {"rating": 5.0, "review": "I like the chromecast because it gives me smart tv capabilities with out buying the tv. The only thing I don't like is sometimes it disconnects while casting.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Steph Burns"}, {"rating": 5.0, "review": "The best $30 I ever spent. I stream for HOURS on this thing (don't have cable). It works beautifully - especially with my 4K Smart TV. Easy to install, easy to use. I have one for every TV in the house now. If you're on the fence about it, you shouldn't be.", "verified": true, "helpfulness": "0/0", "author": "Kristen Healy"}, {"rating": 5.0, "review": "gonna get another of these...soon enough!!", "verified": true, "helpfulness": "0/0", "author": "Marc Miller"}, {"rating": 4.0, "review": "Pretty neat. Went with this one over other streaming devices because it gives you the option to mirror your phone. I dropped down one star due to the lag at times and the inability to mirror my phone without WiFi connection.", "verified": true, "helpfulness": "0/0", "author": "Vic D."}, {"rating": 5.0, "review": "Fast delivery and a must have device!", "verified": true, "helpfulness": "0/0", "author": "Ashutosh Mukherjee"}, {"rating": 2.0, "review": "skips and buffers endlessley", "verified": true, "helpfulness": "0/0", "author": "Brian Charles"}, {"rating": 4.0, "review": "Love it. Friend told me about it and great. Wish could cast anything on phone but there's other items for that. Used for Netflix and you tube primarily. Easy to set up.", "verified": true, "helpfulness": "0/0", "author": "suzanne morse"}, {"rating": 3.0, "review": "It can't do 1080p", "verified": true, "helpfulness": "0/0", "author": "James O'Sullivan"}]