[{"rating": 4.0, "review": "The chrome cast is a GREAT device; however, I am really disappointed the firmware doesn't have some type of way to stop certain people from accessing (or only giving permission to certain devices to access it). Otherwise if you are on a college campus or in a home with a large family, any person can access it and send videos which can be annoying.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 1.0, "review": "The only reason I am giving this one star is that a virus is attached on the Picasa2.exe.  This exe is part of your download and it runs the scrolling landscapes pictures on your tv after Chromecast is installed.  My virus checker caught it.I went back to Prime and will be returning Chromecast.", "verified": true, "helpfulness": "0/3", "author": "Kindle Customer"}, {"rating": 5.0, "review": "This little device is amazing! I can stream my YouTube subscriptions right from my phone to my TV. On top of that, Google keeps adding support! Netflix, Google Play, Pandora and Hulu+, just to name the ones I use. This device is amazing as is, and it's still being worked on. For $35, this is a must have for anyone with a spare HDMI port!", "verified": true, "helpfulness": "0/0", "author": "Grantisimo"}, {"rating": 4.0, "review": "Wish there were more stations. Roku has more stations. I wish it could actually let you search using the web.", "verified": true, "helpfulness": "0/0", "author": "Artemas Holloway"}, {"rating": 4.0, "review": "Works fantastic, can watch off Iphone, Ipad, laptop.  My only thing is I thought you could watch itunes too,  but AWESOME purchase for price!!", "verified": true, "helpfulness": "0/0", "author": "MackLFuel"}, {"rating": 4.0, "review": "Works well and pretty easy to connect to any and all devices that support the app. Pretty happy with the product. I guess the cables can get a bit messy but thats about it...", "verified": true, "helpfulness": "0/0", "author": "Carlos Alvarez"}, {"rating": 5.0, "review": "After streaming issues with my computer were worked out it WORKS! Expectatons have been met, nothing else need be said", "verified": true, "helpfulness": "0/0", "author": "C. Stein"}, {"rating": 1.0, "review": "I returned the first one because It stopped working, and the second one still can't make it work...can't figure out what is wrong.", "verified": true, "helpfulness": "1/2", "author": "Rosana Di Mauro"}, {"rating": 5.0, "review": "Because this plugs into the HDMI port of a TV, you can quickly pop one in while visiting friends/family/hotels and have your Netflix and Youtube viewing on that device. You can broadcast from your computer, tablet or smart device.The cost for this awesome way of taking new faves to share with friends, who then want one, too. Meaning, what we've shared and the device we used to share it. We have one for our tv, ordered one for each of our sons, and I am ordering another to keep in the glove box of our car.HBOGO also now works, however you still cannot share a photoslideshow, pix or vid without extra steps. ... Yet. \"They\" are working on it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Viv\""}, {"rating": 5.0, "review": "This is fantastic if you do not have a smart TV. If you are planning on getting a smart TV, you should consider this first. If you have a Smart TV, the only benefit that I am aware of is transferring your chrome browser window to your TV.", "verified": true, "helpfulness": "1/1", "author": "Phone Buyer"}]