[{"rating": 5.0, "review": "Love this product", "verified": true, "helpfulness": "0/0", "author": "Julie"}, {"rating": 5.0, "review": "Great newer movies, voice command.Only con is only 1st month is free, then movies even some ones get pricey", "verified": true, "helpfulness": "0/0", "author": "Stephen Melissas"}, {"rating": 1.0, "review": "This thing caused my internet usage to skyrocket. After having this thing for less than two weeks I received a message from my ISP telling me I had used 90% of the 300GB allowed each month. I binge watch TV shows on my two Roku's pretty often and I have never come close to my data cap. It's getting returned and probably getting replaced with an Apple TV.", "verified": true, "helpfulness": "2/15", "author": "Customer128975239"}, {"rating": 5.0, "review": "fast and reliable, occasionally needs a power reset by unplugging the device and plugging it back in, but ive only had to do that 2 times on them for there whole life and it was after a storm both times where the power flickered they are on surge protectors but I guess when the power goes out for a sec the go dumb sometimes other than that supper fast just wish they had better game already but there slowly growing.", "verified": true, "helpfulness": "0/1", "author": "Chad Bessesen"}, {"rating": 5.0, "review": "I absolutely love it!!", "verified": true, "helpfulness": "0/0", "author": "Janice E. Sipes"}, {"rating": 3.0, "review": "Doesn't have nearly the amount of Prime movies as advertised.", "verified": true, "helpfulness": "0/2", "author": "BAMF"}, {"rating": 2.0, "review": "I LOVE THIS BOX ....... but ....It is BLOWING through my data cap with Comcast. In the past few months I've used about 80-90 GB of my 300GB cap. But this month the only thing that changed was that I purchased this box to replace my Wii I was streaming from.I received a notice from Comcast the weeks into the month that I have used 290GB!I immediately unplugged the device and it has not been on since.The box has no off button so I can't conveniently shut it off, it has to be unplugged. Why does it use so much more data? I hope Amazon has a solution soon.", "verified": true, "helpfulness": "3/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Easy to connect and a very in expensive way to enjoy movies and tv series.", "verified": true, "helpfulness": "1/1", "author": "D C"}, {"rating": 1.0, "review": "I'm very disappointed in this product.  I gave my daughter my ROKU to take to college and instead of replacing it with another ROKU I bought the Amazon Fire TV.  I've had MANY problems with the shows freezing or buffering that I never had with my 2 year old ROKU.  It is also more difficult to navigate than the ROKU.  Since my internet service hasn't changed I can't think that it is my internet service.  I have to back out of the show and go back in at least once if not multiple times per show.  It is VERY annoying.  As a single mom I'm not really in the position to go out and buy a new ROKU just because I don't like the Amazon Fire TV.If anyone has any suggestions about how to troubleshoot this, I would appreciate it.", "verified": true, "helpfulness": "3/6", "author": "Kim"}, {"rating": 2.0, "review": "Voice input doesn't work with Netflix, can't setup the amazon video to easily just show what is free which just makes everyone mad when they are looking for something to watch and most every item picked isn't on prime.", "verified": true, "helpfulness": "1/2", "author": "Jeff"}]