[{"rating": 5.0, "review": "Great versatile product. Can't beat the price.", "verified": true, "helpfulness": "0/0", "author": "Brian Solis"}, {"rating": 2.0, "review": "Would not work with my Vizio TV.", "verified": true, "helpfulness": "0/0", "author": "Bruce C Voiles"}, {"rating": 2.0, "review": "Google really dropped the ball with this thing. It's only applicable in certain situations, and while it's easy to get it on the internet, finding apps/programs it will work with is a waste of time. I wanted to be able to screenshare easily from my wireless devices, but this is not the solution I was looking for.", "verified": true, "helpfulness": "0/0", "author": "vitalicvision"}, {"rating": 5.0, "review": "Chromecast RULES ! EASY to install, it's pretty much PLUG AND PLAY... :D", "verified": true, "helpfulness": "0/0", "author": "Ozkr."}, {"rating": 5.0, "review": "Love love love this. Purchased as a gift for hubby and he uses it daily now.", "verified": true, "helpfulness": "0/1", "author": "Char Lunsford \"Charla\""}, {"rating": 5.0, "review": "Love this!  Great price no issues and easy to set up!", "verified": true, "helpfulness": "0/0", "author": "Rosemarie"}, {"rating": 4.0, "review": "getting troubles to connect, after tried several times working fine, but still issues every time I want to use,", "verified": true, "helpfulness": "0/0", "author": "Jesiiec"}, {"rating": 5.0, "review": "I'm unable to stream to my TV in my area due to low internet speed so I purchased two of these for two different TVs in my house & am now able to stream through my iPad with no problem.  This is very easy to hook up by following the instructions.  I am now one happy streamer!!", "verified": true, "helpfulness": "0/0", "author": "Wafi"}, {"rating": 4.0, "review": "Very easy to connect. Came in 3 days. Awesome.", "verified": true, "helpfulness": "0/1", "author": "Pamela Fantroy"}, {"rating": 2.0, "review": "Easy to install, but product  didn't work as advertised. Streaming was extremely slow if it worked at all.", "verified": true, "helpfulness": "0/0", "author": "Samuel W Bishop III"}]