[{"rating": 4.0, "review": "Chromecast is a bit more exciting in theory than it is in practice.Pros:- Very easy installation as long as your TV has available HDMI & USB Ports- Android & iOS apps work well to configure and cast media to the TV- Pretty seamless operation once configured and on-lineCons:- HD picture quality from HBOGo or Youtube is sub-par compared to cable or roku broadcasts- Occasionally stops playing and requires restart from the app (even while showing full strength Wireless connection)- PC interface not as slick as mobile device, HBO broadcast shown on PC & TV simultaneously, doubling the bandwidth needThe first Chromecast I bought died after a week of use. First the audio was distorted, then it would just boot to a black screen. After contacting google support and jumping through a number of hoops, I was sent a replacement. It has worked well since it was installed.Issues aside, I think the utility of this device is excellent and bridges the gap between PC's/Mobile and my TV. Looking forward to seeing what improvements come in the future.", "verified": true, "helpfulness": "0/0", "author": "H. Schuller"}, {"rating": 5.0, "review": "I bought my first Chromecast on Black Friday, more to just try it out. I am a person who has as Roku on each TV, a Mac Mini HTPC, and run a server with Plex. With the rlease of support for Plex the Roku and HTPC are quickly becoming redundant.It simply works, open your video app on the phone, pick something, send it, vola it's playing. No cumbersome slow remote navigation. Youtube videos play almost instantly and only buffer for a second or two. Plex works well, and it is needed considering Roku broke their support for many Plex users when they failed to update their older devices.It took all of 30 seconds for my niece to figure out how to use the Chromecast to play her favorite music videos on the TV from her phone.I wish I could get it to show my own Picasa photos instead of just random ones off the internet.", "verified": true, "helpfulness": "0/0", "author": "Joshua Driggs \"ZapWizard\""}, {"rating": 5.0, "review": "Easy as 1-2-3...up and running in less than 5 minutes from the time I opened the box. Exactly as advertised", "verified": true, "helpfulness": "0/0", "author": "john"}, {"rating": 5.0, "review": "Chromecast is an amazing gadget.  It enables you to easily wirelessly control content and broadcast it directly to your tv.YouTube videos, Pandora Radio, Netflix...and others are coming on board everyday.Easy to connect.  Works with any Android product.  I loved mine so much I bought several more to give as Xmas gifts.Well worth the $35", "verified": true, "helpfulness": "0/0", "author": "Gary Saylor"}, {"rating": 5.0, "review": "Plug and play is right, looks great on my TV works well when switching from tablet or phone watching HULU", "verified": true, "helpfulness": "0/0", "author": "slimsh8d"}, {"rating": 4.0, "review": "Been using it for over a month now. For $35, its worth it. I wouldn't pay any more than that.I have 2 nieces and its quick for me to open my iphone app, and stream youtube song playlists instantly. It takes 5 seconds but anymore than that and its hard to control my nieces.I had to download Chrome to my Mac but now I can watch movies and songs directly from my Mac. I don't need Roku or appletv or anything.There are still some issues Google has to work out. Sometimes the videos stop working if I shut down my Mac, so if I am playing a movie, I have to keep the movie running on my Mac also.I can't play a movie full screen and also browse on my mac. Its because Chromecast does mirroring so I have to play the movie full screen on my mac to make it full screen on my TV.For 35 bucks, really, its worth having it.", "verified": true, "helpfulness": "0/0", "author": "Sagar \"S\""}, {"rating": 1.0, "review": "I've owned the Google Chromecast for almost month and I really wanted to like it but after a month of use I've come to conclusion that this device as of right now is a  piece of junk. The price tag is what attracted me to it but I quickly learned that you get what you pay for. I mainly bought this for the HBO GO compatibility so I wouldn't have to spend another $100 on an additional Apple TV for my bedroom but after a month of  agonizing trying to watch a whole program without some kind of buffering and/or picture freezing I started to wish I had just shelled out the money for the Apple TV. At $35 dollars I'll just eat the cost instead of going through the hassle of returning it and maybe in the future with some firmware updates it will be what I hoped it would be and I can use it again but until then my recommendation is to just pay a little more for an Apple TV or a Roku box.", "verified": true, "helpfulness": "0/1", "author": "BroncosFan75 \"Erik\""}, {"rating": 3.0, "review": "This is great for getting your YouTube onto the TV, but other than that, if you already have SMART TV's (all of my 4 TV's are), it doesn't really add much.  Might be easier browsing etc....but for YouTube it is great since the search on SMART TV's sucks.Keep in mind, this is EXTREMELY limited in apps available.  I believe NetFlix, Hulu+, YouTube, Crackle, and like two more.It is NOT open to developers to Chromecast to add to their own apps.  Not sure if/when that is going to change.", "verified": true, "helpfulness": "0/0", "author": "Dave Hahn"}, {"rating": 4.0, "review": "Great device that has allowed us to start watching Netflix and YouTube much more easily on our TV.  Really did take only about 3 minutes to setup, and I can't setup anything related to a network normally!  Also, it's really cool how you can put your device to sleep once the media has started because the Chromecast is streaming the content directly from your router, not through your phone/tablet/pc which would drain the battery on those devices!One thing that I really like about it is that it senses the bandwidth available and automatically adjusts the resolution of the video feed to avoid having to pause the video for buffering.  Only under really poor bandwidth does it pause, but only after attempting to reduce the video quality some trying to keep it streaming.But don't think that it always plays at low quality.  I live in a densely populated townhouse community, and can see 20 wifi networks where I live, and generally it still manages to deliver crisp HD video, even though I only have 2 or 3 bars of wifi on my devices!I did knock one star though because I wish that it supported displaying things from the device sending it commands.  Unfortunately, right now you can't just display your own pics on your phone for instance (without jumping through additional hoops).  I've heard if you sign up as a developer through Google you can do this, but I haven't looked into it more.  But if would be nice if I could just stream some items straight from my phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "Speedy"}, {"rating": 3.0, "review": "This product was very easy to install.  I just followed the instructions and was up in running in no time and I was watching Netflex movies that evening.  I was disappointed to learn that it would not run on my kindle or Nook.  Hoping that soon it will compatible with my Kindle.", "verified": true, "helpfulness": "1/1", "author": "pinky2"}]