[{"rating": 5.0, "review": "Chromecast was easy to install and use. I highly recommend this to everyone", "verified": true, "helpfulness": "0/0", "author": "Kelly Croy"}, {"rating": 4.0, "review": "One of the best gadgets I ever had! It works perfectly for almost any media streaming.", "verified": true, "helpfulness": "0/0", "author": "JOSSY"}, {"rating": 5.0, "review": "amazing invention.", "verified": true, "helpfulness": "0/0", "author": "shellymaxi"}, {"rating": 4.0, "review": "Don't use it very much, but it's a great device when it works. I've had some issues connecting (for various reasons), but for the most part it's fine. I wish it worked for Vimeo, though.", "verified": true, "helpfulness": "0/0", "author": "KoptimusPrime"}, {"rating": 4.0, "review": "I bought the Chromecast to work with my Chromebook. It is extremely easy to set up and works quite well. My only complaint is that not every website will work. So please check before you buy, if you need it to use specific web sites.", "verified": true, "helpfulness": "0/0", "author": "Homey Jim"}, {"rating": 5.0, "review": "This product has been instrumental in our ability to cut the cord from cable.  We are constantly using it to stream Netflix and youtube.  We also use many of the other apps like the network television apps to cast shows.  The fact so many developers are involved with the process also helps because we have been able to use many different applications like the local cast to cast our personal videos or locally saved videos to the screen.  The only things that could make it better would be if it had Prime Instant Video or sling tv integration.", "verified": true, "helpfulness": "0/0", "author": "n. langley"}, {"rating": 5.0, "review": "Excelent.", "verified": true, "helpfulness": "0/0", "author": "Pablo G. García"}, {"rating": 5.0, "review": "Awesome product. Works great. Absolutely in love with this. It lags now and then but it is all reasonable.", "verified": true, "helpfulness": "0/0", "author": "elvira b"}, {"rating": 1.0, "review": "I really wanted to love this device. Unfortunately, the cons really outweigh the pros.Pros:- Easy set up- Small form factor, easily hidden- Backed by Google- Ability to stream webpages is niceCons:- Terrible, terrible, terrible wireless reception- Google issued mandatory update that broke streaming of local content from your phone or computer- Frequently disconnects in the middle of playing my Google Music playlists- Doesn't respond to commands to pause, change volume, switch apps, etc. and requires a full device restart to recitfy- No way to force HD video on Netflix- No remote- Other competing devices do a better job, with more control and ease of accessIt is ironic that Chromecast is supposed to be a wireless convenience, but I found the exact opposite to be true. Getting it to work properly is an overwhelmingly exasperating event. Even if you manage to get it functioning, it will probably drop your content half-way through listening or watching. I've taken to just plugging my phone or computer directly into my hi-fi receiver, and completely circumventing Chromecast.", "verified": false, "helpfulness": "0/1", "author": "Josh"}, {"rating": 5.0, "review": "So convenient to watch all the internet shows and videos on the TV.  Love the wireless concept! We had these as our party favors for the wedding - that't how much we love this product.", "verified": true, "helpfulness": "0/0", "author": "Anna0982"}]