[{"rating": 5.0, "review": "The best out of Roku and Apple.Amazon TV just gets better everyday as they add new thing to it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Okay we were not to sure about this. . .but we love it.  We have been threatening to give our cable company the boot (Cox Cable/Virginia).  This made our mind up fast.  So we are going to kick Cox to the curb and use this.  We are also going to purchase a digital antennae for our local channels.", "verified": true, "helpfulness": "0/0", "author": "kadybug"}, {"rating": 5.0, "review": "Very happy with my FireTv", "verified": true, "helpfulness": "0/0", "author": "Bryan Courville"}, {"rating": 5.0, "review": "I love the fire tv! how ever I had some billing issues and tried to correct them today, much to my dismay, customer service rep told me I had already paid for the Fire TV but I could not change my credit card. If I wanted to keep the Fire TV I would be billed $19.995 per month! I never read that anywhere in the terms. Needless to say I will be returning it.", "verified": true, "helpfulness": "0/0", "author": "Becky"}, {"rating": 5.0, "review": "Love the fire TV", "verified": false, "helpfulness": "0/0", "author": "Mohsin \"MO\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Paula Slingerland"}, {"rating": 5.0, "review": "OMG this is the best of all the small T.V Box wow you could download from the internet or even your computer into this box this is the best of the best and its very fast, I love it", "verified": true, "helpfulness": "0/0", "author": "ieesa123"}, {"rating": 5.0, "review": "I love it and better than Roku 3 in some parts.", "verified": true, "helpfulness": "0/0", "author": "Mike"}, {"rating": 5.0, "review": "Way better and cheaper than comcast!", "verified": true, "helpfulness": "0/0", "author": "Brett Jones"}, {"rating": 4.0, "review": "I chose this because it offered the best hardware for the price among its competition.  Most industry reviews pointed to the Roku 3 being more flexible but 85% of my needs are Amazon video and Netflix.  iTunes would have been nice but the Apple TV was otherwise the runt of the litter when I shopped.  I wanted a responsive box and this one delivers.  It feels obvious how this had the fastest internal hardware in the current generation.It is tiny, reliable, and easy to use.  Setup was cake.  I wish the voice input worked with other apps (e.g. Netflix) but that is a minor complaint.  It works like magic for Amazon content.I wanted a box to replace having to hook up my laptop to the bedroom TV for streaming and this did the trick.  I just ordered Amazon's new streaming stick to replace using a PS4 for streaming on another TV.  I'm curious to see how it compares for so much less money.The screen saver images are an unexpected bonus.  Those high-resolution nature images are very cool.", "verified": true, "helpfulness": "0/0", "author": "Eric D. Arnold \"Penforhire\""}]