[{"rating": 5.0, "review": "Shipping was fast got it 3 days before the scheduled date. Easy set up. Now I can watch showbox and all my downloaded videos straight to my tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "cons: Poor quality at project to tv.pro: Enjoy musical videos in a big screen and many apps supports.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Not able to get it to work.tri'd to fix no luck.want it back? Bruce bayne", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very nice!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It worked as expected but honestly, I expected more from it.", "verified": false, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Doesn't work worth a fly speck. I don't recommend buying it unless you want to waste your money.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The Chromecast works great, does just what it is supposed to do.  I gave it less than a 5 star rating, for the following reasons.  I don't have a smart tv, so that is why i use the chromecast on my tv, for movies, etc. The chromecast will not work with a windows phone, a windows laptop yes, but not a windows phone, so l had to buy an android tablet to  operate chromecast.  It also will not cast the phone screen or any websites to the tv, a laptop, yes, but not a windows phone, or my android tablet.  Other than that it a great gadgit and i use everyday.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It works great and the price was right!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I ordered this item over a month ago,cannot set it up tried to set it up with tablet and directions does not work.bought new tv and tablet tried phone still does not set up. what should i do? does it need its own remote?", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]