[{"rating": 1.0, "review": "I cannot get the chromecast to work for any media at all. There is always an error. I am very disappointed", "verified": true, "helpfulness": "1/2", "author": "Bullie Nation Rescue"}, {"rating": 5.0, "review": "Great option for TVs that lack the \"smarts\" or some sort of game box or alternative media center box. Easy setup and connection to your WiFi. If you are a Netflix subscriber, this is a must have for any TVs in the house that don't have it built in. I also recently took this on vacation with us which made for a great alternative to the in-room options.", "verified": true, "helpfulness": "0/0", "author": "AMarks \"AM\""}, {"rating": 5.0, "review": "With teens in the house, there are always some new YouTube videos to watch and with this nifty little gadget now everyone can see them on our 61\" screen instead of huddling around the computer. It was super-easy to setup and we are still exploring new ways of Chromecasting, but this is a welcome new toy in our Media Arsenal!", "verified": true, "helpfulness": "0/0", "author": "John Allen"}, {"rating": 2.0, "review": "DOESNOT SUPPORT AMAZON! Any other service like hulu you'll be fine but do your research before buying. Price used to be $25 I'm not sure why they thought they needed another $10 out of us. All the other devices like roku, fire tv and wd tv are to expansive.", "verified": true, "helpfulness": "1/2", "author": "Jeff"}, {"rating": 1.0, "review": "Not really happy with this purchase as the device isn't really compatable with the Kindle HD 8.9.If I want to see a movie using this device I have to set it up with with my laptop. That's not what I had in mind when I bought all the equipment. The aid that Amazon runs for this equipment should specify that it's not compatible with Kindle Products.Very mis-represented.", "verified": true, "helpfulness": "1/2", "author": "Richard O. Allen, Jr."}, {"rating": 5.0, "review": "My roommates and I use this for Netflix and Youtube.  Between those 2 services I can watch anything I want on my TV", "verified": true, "helpfulness": "0/0", "author": "Sean Murphy"}, {"rating": 2.0, "review": "What you don't find out until probably after you've purchased this thing (taking the adverts at their word) is that the standard routers provided by the major broadband providers CenturyLink and Comcast are NOT compatible with Chromecast.  You will have to go buy a router of your own and set it up if you want it to work consistently and you want Google to fully support it.  After many hours on the phone with Google, Netflix, CenturyLink and ActionTec to try to figure out why the Chromecast kept getting dropped by my router, a Google tech finally pointed me to their \"compatibility\" page and I found out the router I was renting from CenturyLink (along with untold millions of other people) was not compatible with the Google device.  I am just in shock that a company like Google can advertise this as the ultimate Plug N Play media streamer, knowing that is far from the truth for a substantial number of people out there.  My glee over dumping the conmen of cable for the brave new world of streaming media has been pretty thoroughly extinguished.", "verified": false, "helpfulness": "3/3", "author": "Chris H."}, {"rating": 5.0, "review": "With over 7K five star reviews for the Chromecast, I don't have much to add about how this device works. I bought my first Chromecast for my parents so they could keep up with programs that they lost when they switched from satellite tv to regular cable. I didn't know what to expect from the Chromecast but I figured at 35 dollars it didn't hurt to try it, and it could always be returned if it was a dud. As it turned out the Chromecast is the perfect solution for anyone switching from satellite or cable to internet TV. I liked it so much I bought a second one for myself just a few days later.This gizmo has worked with everything I've thrown at it. I have high speed cable internet which is fast 95% of the time so my tv images are beautiful and issues with lag or buffering using Chromecast have been minimal. Note however that Chromecast may not work as well with slower internet speeds. In short, if you're wondering which streaming device to get and you have fast internet - pick the Chromecast!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Google Play SD movies only stream in 2ch stereo?  When good old DVD has 5.1, something's not right here...Video streaming of home videos from Nexus phones is also another must have.Amazon - where's your app for streaming Amazon video on Chromecast?", "verified": true, "helpfulness": "0/0", "author": "TD \"wasabe\""}, {"rating": 4.0, "review": "When using this device, if we do not continuously manipulate items on the screen, the image times out.  We use this as a tool for meetings with staff and students, generally using Excel or Word, and it would be nice if I did not have to keep reconnecting tot he device because we have not moved the mouse in a few minutes.  Besides this issue, this is a pretty cool tool.Thanks,Paul", "verified": true, "helpfulness": "1/1", "author": "Paul Valdez"}]