[{"rating": 5.0, "review": "Google chrome is awesome.  Being able to cast chrome tabs and my desktop wirelessly has been great... though the desktop feature is very laggy just to warn.", "verified": true, "helpfulness": "0/0", "author": "Andy P"}, {"rating": 5.0, "review": "It works! The only drawback so far is its inability to easily stream content outside your region. For example, using hola unblocker  app or the like. However, this can be achieved by tweaking your router settings and signing up for some kind of DNS service(which will cost you. There are free trials)", "verified": true, "helpfulness": "0/0", "author": "Francois Brown"}, {"rating": 5.0, "review": "New technology so fast available by amazon. With this I can review all my vídeo indica my computer, new toy for y daughter", "verified": true, "helpfulness": "0/0", "author": "Mariangelica"}, {"rating": 1.0, "review": "This product is not good at all!!, I bought 2 and one of them works OK, the other one doesnt reproduce Netflix from iPhone or iPad.I live our of the USA, so I cannot change it. DONT PURCHASE THIS PRODUCT!!", "verified": true, "helpfulness": "0/1", "author": "Ignacio Villardino"}, {"rating": 4.0, "review": "Overall these things are good, fairly easy to setup, and almost always work.  The biggest issue is the limitations of the program side.  It only works with Chrome as a plugin, youtube, and a handful of other websites or apps (phone).  Once someone gets a program to just replicate what is viewed on the desktop it will be near perfect.", "verified": true, "helpfulness": "0/0", "author": "Gregory Rhoden"}, {"rating": 5.0, "review": "works fine and had no problem in 2 months of use. not too many apps on it though but that is not an issue for me. i use to stream youtube and chrome from my desktop. works very well even after a prolonged use.it works only on wifi so it would be good it there had been a wired option as well. a wired option could allow for a higher quality streaming.", "verified": true, "helpfulness": "0/0", "author": "JS"}, {"rating": 5.0, "review": "The most suitable hardware you can buy for every budget. It works perfectly with any HD TV with an HDMI input. Requires Android or iOS for streaming.", "verified": true, "helpfulness": "0/0", "author": "Esteban Morales"}, {"rating": 2.0, "review": "Does not play with most of my iPad apps including Xfinity which is the reason I bought this thing. Not too impressed. Ended up losing the thing and to be honest I don't really care to go look for it and find it to use for other apps.", "verified": true, "helpfulness": "1/2", "author": "Chris"}, {"rating": 5.0, "review": "Very convenient, and cheap. We hook ours to a nexus and works flawlessly. Probably will buy another for a different tv in the house.", "verified": true, "helpfulness": "0/0", "author": "R.H."}, {"rating": 1.0, "review": "dose not work on galecy 2 phone or nextbook tablet works on newer phones so it did not solve my needs so I gave it away", "verified": true, "helpfulness": "0/1", "author": "basicdad"}]