[{"rating": 1.0, "review": "Terrible on wifiFreezing all the time.Don't have that problem with my old Roku.", "verified": true, "helpfulness": "2/3", "author": "Jorge H. Robayo"}, {"rating": 5.0, "review": "I love it!  It was easy to set up and I love it was already set up to my Prime account.  It has great user interface and feel.  I loved  the 'how to' video that plays at start up.  It seamlessly integrates all the apps and features into a very nice interface. The remote is very responsive.  The HD is crisp and sharp.  I've been a huge Roku fan for years.  I will now be systematically replacing my Roku players in my house with these units.Look out Roku, THERE'S A NEW SHERIFF IN TOWN!!!  This set top box is fantastic!Thank you Amazon!", "verified": true, "helpfulness": "0/0", "author": "DANIEL E. MCGINNIS"}, {"rating": 4.0, "review": "Amazon Fire TV makes the prime membership and the streaming way better. Fire has a menu screen that allows for easy searching. It is easy to add items to the watch list for later or stream them immediately. Additionally, although this is obviously most beneficial for prime members, it does contain items that are not eligible for prime as well. The device makes it easy to distinguish and makes the streaming experience much better. However, I think this would be redundant for anyone with a Smart TV but that is just my opinion.", "verified": true, "helpfulness": "0/0", "author": "Makeshift Patriot"}, {"rating": 4.0, "review": "Technically, it has great picture and sound.  I wish the programming will evolve so it can handle multiple profiles.  The parental controls are great.  A frustrating thing within the Amazon menu is that you have to make several clicks on a movie/program (and go into sub menus) to see if it's free to everyone, free to prime members, or if you have to pay.  The voice control on the remote does not work if you leave the Amazon menu and go into Netflix.", "verified": true, "helpfulness": "0/0", "author": "Auburn Berry"}, {"rating": 5.0, "review": "Exceeded my expectations. I'm gong to buy one for my son.", "verified": true, "helpfulness": "0/0", "author": "eye-dunno"}, {"rating": 5.0, "review": "This is the best day of my life", "verified": true, "helpfulness": "0/0", "author": "johnblaze"}, {"rating": 5.0, "review": "The Amazon Fire TV is very fast............for watching Amazon content either on WIFI or direct Ethernet.  The search function is also very accurate..............for finding content on Amazon Prime.  The games are, meh.  I realized pretty quickly that I had no desire to use this for games, it's a total failure as an even casual gaming device so far, but then again, I'm a gamer so I have higher expectations than non-gamers.  Overall, this streaming box works absolutely beautifully for streaming your Amazon content.The remote controller is really fantastic, too.  It's small and has a nice feel that doesn't get slippery or plastered with finger prints.  It works via bluetooth so no need to point it right at the box (you can hide the box behind your TV).  It's also very responsive.Outside of Amazon though, it's a ridiculous failure.The Netflix app is unacceptably slow.  It's also an antiquated version of Netflix compared to other Netflix apps on other devices.  I can stream Netflix over WIFI to my Google Chrome dongle at much higher quality and without the general lag that the Amazon Fire TV gives.  It's a total failure and if Netflix is your primary portal for watching TV and movies, like it is with me, then this box is a complete failure for you.The other thing that really bothers me about this thing is that you can't turn it off without unplugging it.  I don't like the idea of having things ON all of the time, even in \"sleep\" mode.  There has been times when my Netflix app has continued playing through a series (lagging the whole time, I'm sure) while I sleep so I come back and I'm 1 and a 1/2 episodes ahead of where I left off.I bought the Fire TV on launch day and boy did I learn a lesson... I should have waited but I let the hype get me excited.  I didn't post this review until 7+ months later because I wanted to give Amazon the benefit of the doubt that this is a new product and see if they would update their Netflix app or their UI, however, nothing (visually) has updated and it appears that they are done with the Fire TV and are moving on.  It's disappointing because I love Amazon content and I enjoy my Prime membership and TV / Movie content I get with it, however, I'll stick with the Amazon app on my other streaming devices from now on.  Hopefully, I can unwind this purchase in the secondary market.*UPDATE*-----------------------------------------------------------------All of the issues I previously have had with the Fire TV box are solved now.  It runs Netflix and all of the other apps (FINALLY HBO GO!!!) like a charm.  You can even chromecast to it!  This is now my main entertainment box that I use for everything.  Very glad I made this purchase.", "verified": true, "helpfulness": "3/3", "author": "Yoshi Ex \"C Ex\""}, {"rating": 5.0, "review": "great product .....this is a money saving device, we have cut All premium channels saving us 40.00 a month. Since i had a prime membership because I buy from Amazon anyway, this was a no brainer.We have disconnected our apple tv and replaced with Fire.....the voice search feature is great.", "verified": true, "helpfulness": "0/0", "author": "ajp"}, {"rating": 5.0, "review": "The Amazon Fire TV is a great buy we can watch movies a lot are free.  Some you have to rent, but most are not that expensive.I recommend this item.", "verified": true, "helpfulness": "0/0", "author": "Harpos"}, {"rating": 5.0, "review": "You have to have a good internet connection ...", "verified": true, "helpfulness": "0/0", "author": "V.L.Classics"}]