[{"rating": 5.0, "review": "Great product.  My wife and I enjoyed it from the day we plugged it in.", "verified": true, "helpfulness": "0/0", "author": "JW"}, {"rating": 5.0, "review": "Best thing I have ever bought. You can't be the price for everything this does", "verified": true, "helpfulness": "0/0", "author": "Elizabeth Dennison"}, {"rating": 5.0, "review": "This is a great little gadget.  Works great.  High quality.", "verified": true, "helpfulness": "0/0", "author": "Lariat"}, {"rating": 3.0, "review": "I am a little disappointed with this product but it still has potential in the future.  For the price it's worth trying out.  Very easy install, great screen resolution.  My only issue is that it can't play your itunes library w/o a 3rd party app.  Google needs to add more things to watch.  Becasue if y ou want to watch anything besides youtube video' you need to pay for them...(HBO, NETFLIX ETC.)  But for the price it was wortha try and hope in the future Google adds more platforms.", "verified": true, "helpfulness": "0/0", "author": "dianne smith"}, {"rating": 3.0, "review": "I was really trying to find a device that would mirror my computer screen on the TV.  While this device works okay it is too limited on which media sources it will play on the TV.  I was just hopeing it would do more.  I think I'll stick with an HDMI connection directly from the output of my computer.", "verified": true, "helpfulness": "0/0", "author": "Mollie B"}, {"rating": 1.0, "review": "Beware of this gadget if you access Netflix or BBC iplayer via a SmartDNS or VPN service. Google's DNS settings are hard coded into the device and will override the DNS settings of your service provider...", "verified": false, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Works great. Even bought a second one for the other tv", "verified": true, "helpfulness": "0/0", "author": "Jake Sylvis"}, {"rating": 3.0, "review": "Overall, I really like this device. I have it plugged into my Xbox One, and it makes watching media a breeze. It's simple to control and use, and it has every app I want save for Amazon Streaming.However, there are one glaring flaw that I needed to dock two points for: Chromecast broadcasting its SSID.For those of you who don't know, an SSID is basically a wireless network. The Chromecast will broadcast an unprotected SSID when not linked to WiFi so that devices can broadcast to it. (For example, if you're WiFi was down and you wanted to mirror your screen directly to the Chromecast without the router as an intermediary.)Now, this might not seem like a problem since the setup process involves signing the Chromecast into your WiFi. However, my Chromecast constantly decided that it wasn't connected to the WiFi and broadcast its SSID despite saying that it was connected to the WiFi.The only reason I discovered this by chance, and, if the Internet is any Indication, others are confused by this, as well. I haven't seen any response from Google. I was able to remedy this with a factory reset, but it was still a shock to discover that my beloved new Chromecast was broadcasting its SSID to my entire building, and that Google hasn't posted a response anywhere that I've seen.Buy it. It's a great little device at 1/3 the price of a Roku or Apple TV. Just check to make sure that your Chromecast isn't broadcasting its SSID, and factory reset until it doesn't.", "verified": true, "helpfulness": "0/0", "author": "nonja121 \"121\""}, {"rating": 5.0, "review": "I've had this little device for about a week now, and I am simply blown away! A little about my setup-- I have a fairly extensive home network (four routers that connect seven computers, two NAS devices and six different tablets). I have a big deck at the end of my yard that's about 200 feet away from the closest router, and I decided to install a TV on the outside of a shed that's connected to the deck for outdoor viewing and needed a way to stream content to it besides the OTA antenna I installed on the roof of the shed. Enter the Chromecast-- I was afraid that I wouldn't be able to get a strong enough signal to stream content to this device (if I place a laptop in the same general area, the signal is pretty weak), but this thing handles everything I throw at it flawlessly. I have watched a movie on Netflix every night since I installed it (a process which takes all of five minutes) and I've yet to have a single stutter. It provides a constant, crystal clear HD stream that looks nothing short of fantastic on my TV.  In the morning, I use the Watch ESPN app to stream Sports Center while I drink coffee on the deck and, again, no pauses, pixelation or stutters so far. I also use Plex media server to stream content from my main living room PC and it works amazingly well.I also own an Amazon Fire TV and the latest gen Apple TV-- this thing blows both of those out of the water for what I'm using it for, and for $30, no less. It's not even a contest (nothing against the other two devices... I especially love the Fire TV, but it can't handle my deck situation properly because I have nowhere to place it so that the remote can control it properly). There are some cons, but none that are the fault of the hardware, so I can't take off any stars-- Amazon hasn't added Chromecast support for Instant Video or Amazon Music (I assume both are forthcoming), nor have Spotify or Vimeo added support.  Once those folks wake up and add support for Chromecast, this will be a perfect device!", "verified": true, "helpfulness": "0/0", "author": "momentarydogma"}, {"rating": 5.0, "review": "Works Great", "verified": true, "helpfulness": "0/0", "author": "Kelly"}]