[{"rating": 5.0, "review": "I tried ordering from Amazon but the wait was going on for over 1 month, cancelled my order and got it from Ebay for $42.00.very easy to set up, took a minute.  I got it to work with my Kindle Fire, but it doesnt work with Windows Phone!Thats ok, Streaming was fast and  very great quality. I use youtube mostly and netflix on this and for the first time using Google play movies..The problem is i used the beta option to stream file videos and my pc,, the lag is really bad and choppy--for me it doesnt work..Disappointed about that and that i cant watch amazon movies.. but for $35 you cant go wrong.. Looking fwd to amazon with making a similar device for even cheaper. :)", "verified": false, "helpfulness": "1/2", "author": "taylordd"}, {"rating": 4.0, "review": "Works well so far for Windows PC and Android tablet.  Not so well for Apple devices.  But I guess this is expected.", "verified": true, "helpfulness": "0/0", "author": "Son Nguyen \"surviving gator\""}, {"rating": 1.0, "review": "PURCHASED TO WATCH BACK ISSUES OF UNDER THE DOME. OOPS! IF NO ONE SUPPORTS THE CHROMECAST MINI-TV SYMBOL (AND VERY FEW DO) THEN IT IS WORTHLESS. SENDING MINE BACK.New News. Up and running using Chrome Browser. Have to get up ever 15-20 minutes because Chrome drops the Chromecast stating \"cannot find Chromecast\". Desktop 20 feet away from TV that has Chromecast installed. Wireless indicator on TV full strength. What a bummer. Wife and I had to go into the study to finish watching Under the Dome on the PC display.", "verified": true, "helpfulness": "4/18", "author": "BG"}, {"rating": 1.0, "review": "I moved TVs around and waited a month for the arrival of my Chromecast.  Easy five minute set-up and you are viewing Youtube and hundreds of other internet videos through your home TV.  I installed it, started the setup and halfway in I got this message:\"Learn More: AP Isolation is enabledYour Wi-Fi network configuration prevents devices from communicating with Chromecast. In order to resolve this issue, you will need to disable AP (access point) isolaion, also known as client isolation, on your router. Please refer to your router documentation to learn how to disable AP isolation.If you do not have access to your router settings, or if you are attempting to connect through a guest, hotel or public network with AP/client isolation, you will be unable to set up your Chromecast.If you are attempting to connect through a Wi-Fi extender, please check your extender settings. You will need to disable AP isolation on your Wi-Fi extender before setting up Chromecast to work with your Wi-Fi network.\"Do you have your modem documentation?  I don't and I see hours ahead checking the number of my modem, downloading documentation, well you get the idea. Is that what the great Google company calls 5 minute setup.  Checking on the net I find that this happens to a number of modem configurations, how many, I don't know 10% 30%.  As I read about this device I never saw anything written by Google about this defect.  A company like Google should be ashamed for releasing a product like this which is obviously not ready for the mass market.", "verified": true, "helpfulness": "8/16", "author": "albrenner"}, {"rating": 4.0, "review": "It was very easy to set up on my TV.It connected right away with my Netflix subscription and began \"casting\" some old Twilight Zone episodes I hadn't seen in over 50 years!Very COOL!It only works with a very limited number of \"apps\", but I'm sure they'll develop more in the future.", "verified": true, "helpfulness": "0/0", "author": "Desert Papa"}, {"rating": 4.0, "review": "The good:  Start with the low price.  Next, it does a great job with Netflix and You Tube.  Fills the TV screen with clear video and audio.  If that's all you want, buy this instead of the more costly Apple TV.  Finally, set up was a breeze via my iPad.  Set up via PC requires Chrome browser (see below).The bad:  Chrome browser is a disaster.  Can't hold a candle to Firefox or Internet Explorer.  That is why you are well advised to use your iPhone or iPad for Chromecast setup.  But you need to use Chrome browser to get anything beyond Netflix and You Tube to stream to your TV.  Even without streaming Chrome is unstable, some of the time simply won't open without a reboot, and when it plays Amazon Prime Instant Video it takes several tries to get the video to play and when it does the picture is only in a corner of the screen when you go to full screen view.  That carries over to your TV screen when you stream it.  And because by default Amazon Instant Video uses Silverlight, which is not supported by Chromecast, I could not stream Amazon videos at all until I changed to the Flash plug-in in the Chrome browser, which is supported to a degree.The future:  Streaming via the Chrome browser is a beta function.  Hopefully Google will improve this in the future, which will extend the capacity of Chromecast beyond Netflix and You Tube.", "verified": true, "helpfulness": "1/1", "author": "Mike"}, {"rating": 2.0, "review": "Between the time I placed the order and received the product, Google did a \"update\"? that killed almost all of the functionality of the Chromecast. Now the only Apps that work is Netflix, YouTube and Google Play. When I ordered the Chromecast there was third party software that you could use to stream everything from your computer or Smartphone to your TV. I already have a Roku, so I can watch Netflix, YouTube and a lot other programing on my TV . I bought the Chromecast to stream from my Laptop and Smartphone to a TV in a hotel room when I travel. After I received the Chromecast and found out how it works I realized that I probably couldn't do that because it has to be set-up through a router and the hotel wouldn't let me access their router. I could already display my Laptop and Smartphone on a TV before I bought the Chromecast by using a HDMI cable. After some research I found that the Chromcast is in beta development and Google \"may\" (at a later date) enable the Chromecast to stream all content from a computer and Smartphone. For now it's on the self.UPDATE: At first I didn't understand that if a video is playing in the \"Chrome\" browser you can chromecast it. I'm not going to go into great detail her but if you have \"PLEX\" running on a computer you can chromecast \"Plex\" through the \"Chrome\" browser with \"Plex/Web\". Google \"Plex/Web\" or go to the Plex website for more info. Because of the this updated info I'm going to change my rating to 2 stars.", "verified": true, "helpfulness": "2/4", "author": "Stevely \"perfectionist\""}, {"rating": 4.0, "review": "The Chromecast must be set up from a wireless device.  If you try to follow the instructions on your ethernet-wired desktop to set it up, you will get an error saying, \"No big deal, but your wifi is off.\"  This refers to your computer, not the dongle itself.  Once I downloaded the iOS Chromecast app from Apple on my iPhone I was able to get the device to connect.  Once set up, the desktop computer running Google Chrome can \"cast\" to the Chromecast.  In this case you will need to download the Google Cast Extension to your Chrome browser.  It will automatically find your Chromecast device and allow streaming from the browser.Unfortunately, two phone calls to Chromecast support failed to even ask me how the computer I was using to set up was connected to the internet... a very important and obvious thing to ask it seems to me!  One rep actually told me my router wouldn't work unless I turned off security (not an issue since Chromecast is compatible with both WEP and WAP).  Another rep sent me an email with instructions on how to install from an Android phone when I specifically told her I had an iPhone.  I suppose the tech support will catch up as these devices become more common and are used by non-techies.All it all, if you read all you can (the reviews here are very helpful and accurate) and understand what it can and cannot do, you will be happy with this device.", "verified": true, "helpfulness": "2/2", "author": "M. Moore"}, {"rating": 5.0, "review": "This is a simple product, but it solved a problem I had - how do I view uTube (and other) videos on my TV? The setup is straight-forward, and once you get past the idea of no real user interface - you just share from your devices - it works really well. I'm very happy with it.", "verified": true, "helpfulness": "1/2", "author": "Kevin"}, {"rating": 4.0, "review": "I have had the Chromecast for about two weeks.  I purchased from Amazon with free netflix for three months.Pros -  It is a nifty device.  It streams Netflix better than my BluRay player, PC or XBox 360 ever has. It was easy to set up, and it is easy to use (just cast two it from the three things: netflix, youtube or a chrome window.Cons -  Very limited casting apps. I want a full featured casting app that will play music or video from my local hard drive. I have about 35GB of music ready to serve up, and the only thing available is a chrome window... one song at a time.  I would also like to rip movies to disk, and cast them from there.At the price... with three months of netflix... this is a great device. Previously, I had turned off netflix streaming because my DSL is so bad that it looked like a VHS tape!  Chromecast is somehow able to do a much better job than previous streaming devices I have tried. So I will definitely be streaming video every night for the next three months. Still, this has only limited use until a suite of casting apps is created to fully exploit the capabilities of this little gem.", "verified": true, "helpfulness": "1/1", "author": "R. Hood"}]