[{"rating": 5.0, "review": "This thing is freakin awesome.  Voice recognition works great.  The speed/response time is SUPER fast.  Shows start playing right away and I love that you can fast fwd by 10 seconds every single time you press the FF button.  Now I don't even have to watch into/outros on top of not having to watch commercials.  The screen savers are awesome.  I wish there was a power off button but it will go to sleep on it's own from the home screen, not from the paused/play screen.  So if you want to save a little energy, go to the home screen before you power down the TV.This is the best remote I've ever used.  I can hide it under a blanket and it still reaches the tv....pointing it at the TV is not necessary at all.Nice job Amazon!", "verified": true, "helpfulness": "1/1", "author": "ohu812"}, {"rating": 3.0, "review": "I tried out the unit and returned it. it's OK, but would be more useful if I owned a large screen TV. In short, this unit acts to supply web content to your TV.Since I have a 32-inch TV, I can just as easily watch the Amazon Fire TV programs on my computer. I tried one of the games, but couldn't play it without the more expensive controller. Still, as I said, the unit makes sense if you have a large TV.", "verified": true, "helpfulness": "0/7", "author": "Amazon Bob"}, {"rating": 5.0, "review": "I have a Roku 3, Boxee Box, and a Raspberry Pi running XMBC, but the Amazon Fire TV is by far my favorite now.I use the Fire TV for Plex the most, and it is excellent. Fast, responsive, and the picture quality is top notch. I occasionally use it for Prime movies and shows also, and the quality on those are also great. I initially thought he voice search would not work very well, but it does amazingly well. Now that I have an Xbox one and use voice commands on it constantly, I really enjoy having the voice search feature on the Fire TV.The design of the unit and the controller is fantastic, though I would like it if there was an Android remote app for it also.My only con for this device up to this point, is that there is no HBO Go app available yet. I can't knock Amazon for that, because it is HBO that needs to release the app. HBO seems to be lagging in general these days as there are still no apps for PS4 and Xbox One.", "verified": true, "helpfulness": "2/2", "author": "Tony M"}, {"rating": 5.0, "review": "The Fire TV works seamlessly with my Kindle tablet and the Fire TV game controller.", "verified": true, "helpfulness": "0/0", "author": "Randall P. Nelson"}, {"rating": 5.0, "review": "I've not tried the Apple TV, but I have tried dozens (it seems like anyways) of other TV or DVD player based streaming services and the Fire TV just works wonders above and beyond anything else.As some folks across the internet have said, I wish the move and TV selections were more extensive, but that issue resides with the production houses, not Amazon or it's competitors.I love it!", "verified": true, "helpfulness": "0/0", "author": "cocamoxb"}, {"rating": 3.0, "review": "It is a great product but it does not support DirectTV", "verified": true, "helpfulness": "0/4", "author": "journee"}, {"rating": 5.0, "review": "Flawless Streaming!  Brilliant video. I fought with my ROKU for 18 months.  I suffered spooling problems CONATANTLY. The tech people at ROKU are worthless!  After an hour or so of use the ROKU Heats us and then WILL NOT WORK. Enter the Amazon Fire.  All my problems have disappeared.  FIRE kicks ROKU's BUTT!", "verified": true, "helpfulness": "0/0", "author": "John-Paul L."}, {"rating": 4.0, "review": "I love it. So easy to set up and use. But I only gave it 4 stars because I was so disappointed that I could not make acorn.tv one of my channels. I had to buy a roku so I could see the shows I wanted. I could buy the episodes at Amazon but they are expensive. I got a good deal from Acorn for  a roku 2 that included 6 months of acorn.tv for free. I don't like the roku as much as fire tv but at least I can watch what I want. I didn't know that some of these devices have exclusive rights. Makes no sense to me. Imagine that you bought a phone and you couldn't call who you wanted. It's Un-American.", "verified": true, "helpfulness": "1/1", "author": "Alice Tolsma"}, {"rating": 5.0, "review": "The Fire TV provides me access to amazon prime movies and android games. It is very responsive, easy to navigate, and robust. I like how I rarely have to wait on updates. The remote control is easy to grip and natural to operate. The software on the device downloads video in advance, so tv and movies begin play very quickly without any waiting.", "verified": true, "helpfulness": "0/0", "author": "PFD"}, {"rating": 3.0, "review": "It is a good system, I have used primarly for NETFLIX.  However if I would have known that they basically charge for every single movie or episode of TV shows I wouldn't have bought it.  We tried to watch an HBO show starting from season 1 and I was absolutely shocked when I realized they werent charging $3 for the whole season but for episode!  Thank you very much I'll stay with DIRECTV it is cheaper.", "verified": true, "helpfulness": "1/2", "author": "pipinita"}]