[{"rating": 4.0, "review": "I love this but it comes with some drawbacks because I am an Apple user. It still has room for improvement and I wish it would add Amazon Instant Prime Video app to the chrome cast family but overall you can't beat it for the price. Easy to use, easy to set up. I love it. Keep in mind you cannot use Safari with it. Even if you download Chrome on your Apple product, you cannot cast with it because you are unable to download the cast extension.", "verified": true, "helpfulness": "0/0", "author": "Jenn"}, {"rating": 3.0, "review": "Should have known better than to try and use my iPad with it... doesn't come close to Apple TV replacement.  Very limited apps to use and right now we would rather just watch our iPads instead of trying to reconnect the Chromescast after an software update.  What a headache.", "verified": true, "helpfulness": "0/0", "author": "SCUD"}, {"rating": 5.0, "review": "I USE IT EVERY SINGLE DAY, WITH PC, MAC, IPAD, PHONE. EXCELLENT PRODUCT", "verified": true, "helpfulness": "0/0", "author": "Eduardo Zuloaga"}, {"rating": 3.0, "review": "Once Chromecast is eventually updated to cast more items to it, this could become very useful.Like casting home pictures and videos. I have ServiioGo loaded on my phone and am able to cast movies to the screen using this device. When I bought this, a long time ago, I knew then it was nothing more than a novelty, but for $35 it's a cool tool.", "verified": true, "helpfulness": "0/0", "author": "C. W. Schmidt"}, {"rating": 4.0, "review": "The Google chromecast is a breeze to setup and use. Having to use an iPad or a cell phone as a controller is no problem at all. Be sure you have a USB port within reach to power this bad boy.Admittedly I am not 100% sure how this works but I think it slings it through your device. I believe this to be true because based on my wireless speeds, the chromecast will sometimes stall (compared to my wired connection which is fast 100% of the time.Me second biggest beef is the robustness of this device: my cat bumped into it and now it is bent. Still works perfectly but how many more bumps until it is done you know? Although at $40 it wouldn't be the end of the world to replace.", "verified": true, "helpfulness": "0/0", "author": "Andrew"}, {"rating": 3.0, "review": "Very nice, however I'm not happy with it. Can't do some basic stuff like showing photos to my friends on the tv due it only works if you send google all your photos. Also other apps do not work as expected, the publicity shows as easy to do everything but this is only true if you do everything as google wants", "verified": true, "helpfulness": "0/0", "author": "Mauro Katzenstein"}, {"rating": 5.0, "review": "Works alot better now that I put net gear router extended witless device on", "verified": true, "helpfulness": "0/0", "author": "bob olson 3"}, {"rating": 5.0, "review": "This thing is awesome, it does everything that I could ask of it. The only issues I have had are that it randomly turns the TV on after it has been used and shut down, and I find myself spending too much time in front of the TV.", "verified": true, "helpfulness": "0/0", "author": "jesse d spring"}, {"rating": 5.0, "review": "very good product for the price.", "verified": true, "helpfulness": "0/0", "author": "suresh"}, {"rating": 3.0, "review": "SO-SO", "verified": true, "helpfulness": "0/0", "author": "Michael K. Davidson"}]