[{"rating": 5.0, "review": "Muy bueno", "verified": true, "helpfulness": "0/0", "author": "maricris gonzalez"}, {"rating": 4.0, "review": "My only complaint is that there are not more apps that can use this. Currently supports youtube, pandora, but not spotify.", "verified": true, "helpfulness": "0/0", "author": "Panagiotis"}, {"rating": 4.0, "review": "I bought this product looking for a device that would upgrade the T.V. that I already had to use internet browsers, Netflix, and Youtube. This product does all of that and as long as you can put up with a small amount of lag and being stuck with google chrome as the only web browser its one of the best products out there for the money.I have really only been using it to stream Netflix and youtube in my dorm room. I can say that there is a slight problem when the wifi network is being taxed with other traffic and at times I get people sending youtube vids to me from their phones when they try to figure out what the little symbol is on the corner but it is nothing to big to deal with.The one thing that can get frustrating is switching between tabs in chrome. The chromecast can only handle one tab at a time and to switch between two you have to stop casting one and start casting the other. There is a bit of lag with this process but other then that it work rather well.One of my favorite things is using Pandora or spotify with it because the audio comes out of the T.V. and not my laptop and there were no settings to deal with to set this up. All you have to do is get the google chromecast casting addon for your browser and everything just works.If you are looking to start getting more out of an older or none smart T.V. and you are on a budget I would defiantly recommend this.", "verified": false, "helpfulness": "0/0", "author": "Eric"}, {"rating": 4.0, "review": "Why just near?...Well,..if google launch a kind of Wmedia player, but with the adds that what are you watching in your computer you can do it throught this device on your tv..There so,..this little thing will be just perfect, making you able to play not only  bluray, dvd, but also mkv rmvb,h264 and all kind of video you imagine.", "verified": false, "helpfulness": "0/0", "author": "Gustavo"}, {"rating": 5.0, "review": "Google Chromecast makes watching Netflix and other internet programs very easy using your smartphone as a remote. I would recommend it.", "verified": true, "helpfulness": "0/0", "author": "Walt"}, {"rating": 4.0, "review": "I like being able to pull up Hulu plus or a football game on my computer and then watch it on my tv without dealing with vga cords. The sound sometimes delays a second which gets annoying. I can also stream from my phone. Overall, I like it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing is worth every penny of $35.00 -- it's great quality and beats out something like an apple tv.", "verified": true, "helpfulness": "0/0", "author": "Chris Dorsey"}, {"rating": 5.0, "review": "We tried a few different ways of setting it up with our 4 year old flat screen tv before we found the \"best\" way. It works like magic. Love it. :)", "verified": true, "helpfulness": "0/0", "author": "Dawn Crandall"}, {"rating": 5.0, "review": "Just hooked this up after getting it for Christmas...and I must say I'm sold! I have a roku 2 that I wanted for the streaming capabilities but due to me having xfinity I couldn't use the roku for hbo go.  But at last I can stream my hbo go to my tv with this! I also keep my extensive music library synced to google music and I can play it wonderfully! And setup is so easy it took less than 10 minutes to get going from plug in to updating. Looks like I'm going to be selling my roku 2!", "verified": false, "helpfulness": "0/0", "author": "Kaitlin"}, {"rating": 1.0, "review": "If you're a Comcast customer and have the modem Arris TG862 with built in router, Chromecast won't work under any circumstances. Been messing with this thing for hours now. Ruined my Christmas.", "verified": false, "helpfulness": "0/0", "author": "Kelsey"}]