[{"rating": 4.0, "review": "Google has done a really good job with Chromecast.  It's relatively easy to install and use.  Navigating on a tablet or a smartphone is much more enjoyable and efficient than using a remote.  There are limited options to get content but it looks like Google is working to fix that with addition of Hulu+ and others.  It is more of an addition to your existing TV service than a replacement.  If it could replace my existing service that would get a great rating!", "verified": true, "helpfulness": "0/0", "author": "Kevin M."}, {"rating": 5.0, "review": "Easy to setup, install and use, this is the second one and it is great for Netflix from my phone.", "verified": true, "helpfulness": "0/0", "author": "Francisco G."}, {"rating": 5.0, "review": "works like a champ.  using a tablet makes watching netflix streaming movies easy to use with this device.  love it", "verified": true, "helpfulness": "0/0", "author": "jsds \"book reader 2\""}, {"rating": 2.0, "review": "When I got the Cromecast, it worked fine with my galaxy tablet, but it did some update and stopped working.  It still works on my laptop but has limited usage.  I hope that the community steps up and gets it works a lot better.", "verified": true, "helpfulness": "0/1", "author": "Marc L Ahrens"}, {"rating": 4.0, "review": "This is a great item at the price.  It gives and easy way to play youtube or netflix easily through your tv, using a phone, tablet or laptop.  It lacks the bells and whistles of Apple TV or simliar products, but costs much less.  It will allow you to cast any tab from Google Chrome to the TV but there is a delay, so this is not good for streaming video outside of Youtube or Netflix.  Hopefully, they will add some features in the future.", "verified": true, "helpfulness": "0/0", "author": "Jonathan M. Hampel"}, {"rating": 4.0, "review": "Admitting that I purchased this somewhat impulsively, and did not do my homework at all, I was a little disappointed to find that certain file types and that certain Web based video are not supported, If this is a concern for you, then be sure to investigate first. Otherwise, overall, still a pretty slick little device.", "verified": true, "helpfulness": "0/0", "author": "James Saccoccio"}, {"rating": 1.0, "review": "Even Hugh every app on my android phone has the button to stream to a device like this, the chrome blocks everything and is useless.", "verified": true, "helpfulness": "3/6", "author": "Thomas Baxter"}, {"rating": 1.0, "review": "I have never had a problem connecting devices to my wifi before, which includes a Roku player, a blue ray DVD player, a printer, 3 computers and a smart phone.  Google tech support was worthless.  Nothing they suggested worked and I was passed around to several \"experts.\"  Even the help on the blogs did not help.Too bad, I was hoping to \"cut the cord\" with my cable company.", "verified": true, "helpfulness": "0/2", "author": "JC2"}, {"rating": 2.0, "review": "It will be good if it can cast local videos too , Youtube can cast on its own without chromecast", "verified": true, "helpfulness": "0/1", "author": "dinesh"}, {"rating": 3.0, "review": "We originally purchased for the ability to view pictures and skyp/tango from phone to TV but after we purchased we found that Google stopped allowing third party apps that would let you do that. We already have Netflix and Youtube so until Google allows third party apps again we wont be using the Chromecast for anything other than a paperweight.", "verified": true, "helpfulness": "0/1", "author": "Scott E."}]