[{"rating": 5.0, "review": "great little box.  works well, super fast, great picture quality.  love it!", "verified": true, "helpfulness": "0/0", "author": "Dave Pettigrew \"dave pettigrew\""}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "chris linhardt"}, {"rating": 5.0, "review": "Wonderful and very easy to use.", "verified": true, "helpfulness": "0/0", "author": "Brenda"}, {"rating": 2.0, "review": "LOOKS GOOD I GUESS JUST DONT KNOW WHAT TO DO WITH IT?", "verified": true, "helpfulness": "0/0", "author": "kerritt \"kerritt\""}, {"rating": 4.0, "review": "I was hoping the FireTV would replace my Apple TV but, until plodding Comcast permit HBO GO on Fire TV, I will have to keep the AppleTV as well. So, my major gripe is actually with Comcast. The other reason for switching to the Fire TV is for displaying my family photos uploaded to the cloud. Since unlimited photo storage is now included with a Prime subscription, it is wasteful to also be paying for Apple iCloud storage. Also, I dislike how Apple syncs deletes. The Amazon Photo app on my iOS devices does not sync deletes - so I can delete photos from my phone when I know they have been pushed up to the cloud, and know that they won't also be deleted from the cloud.", "verified": true, "helpfulness": "0/0", "author": "The Spokesman"}, {"rating": 5.0, "review": "Wish I could get local channels on it. Aside from that it's been great!", "verified": true, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 2.0, "review": "I like amazon but, I use other services also.  The fact that the voice search doesn't work on anything but amazon stuff kind of defeats the point.  I like using google music but, that is impossible with this device.  I've quit using it due to it's limitations.", "verified": true, "helpfulness": "0/0", "author": "bignate \"bignate\""}, {"rating": 5.0, "review": "I did a lot of research and couldn't decide whether to purchase this or apple tv.  I have an iphone and ipad, so I was really leaning towards apple, however, I am so glad I decided on Fire TV.  It's wonderful! We use it all the time, even if it is just to listen to pandora!", "verified": true, "helpfulness": "0/0", "author": "Whit Dunn"}, {"rating": 5.0, "review": "Perfect", "verified": true, "helpfulness": "0/0", "author": "melissa parker"}, {"rating": 5.0, "review": "it works great", "verified": true, "helpfulness": "0/0", "author": "GRIZZ"}]