[{"rating": 5.0, "review": "I cancelled cable tv and went with this. Love it.", "verified": true, "helpfulness": "1/1", "author": "brent"}, {"rating": 5.0, "review": "Superb streaming solution. Yes, the interface focusses on Amazon content; but the other choices work better than any of the other streaming options we've tried (including Roku, Sony, and related DVD and Blu-Ray players).", "verified": true, "helpfulness": "0/0", "author": "RonE \"musicman\""}, {"rating": 2.0, "review": "It's ok...but honestly, I have 3 Rokus at home and it just didn't live up to the number of channels and useability of the Roku.  I have kids and a loud house so the voice recognition was completely worthless.  There's always some noise going on, someone saying something, etc. and it just never picked up anything I said properly unless I'm alone in a quiet house with headphones on.  Nobody in the house wanted to use it so I ended up returning mine.  Just not good enough to keep.  Not all games in the catalog are playable as they require touch screen, like Candy Crush.  You just can't start the game on some of them.", "verified": true, "helpfulness": "0/2", "author": "Number2"}, {"rating": 4.0, "review": "Overall, very good.  But sometimes fails to load some videos which load without problems on my older ROKU unit.", "verified": true, "helpfulness": "0/1", "author": "Marshall Schwartz \"ms from phx\""}, {"rating": 2.0, "review": "First time I tried to use it, I could not tell which movies would be charged to account. I clicked on one to see if it would be Prime or a pay movie. It went right to the movie and never told me. I didn't watch it, but I was charged a little over $5.00 for it. Now I am afraid to click on anything. Any help appreciated.", "verified": true, "helpfulness": "2/7", "author": "Dozenelk"}, {"rating": 5.0, "review": "This was a must for my new flat screen t.v. I just moved to a new place and after living out of the country for several years never upgraded to a new digital t.v. Once I got a new t.v.; I didn't know what to do with it! I had been using a computer screen for the past few years and wanted something that would allow me to access all my online subscriptions (netflix, amazon prime), as well as other content, like Youtube. I really didn't know what to get. After reading all the reviews on Amazon about Fire tv, I was sold. This is a must have if you want access to all your online content through your fancy new t.v.!", "verified": true, "helpfulness": "0/0", "author": "Seawards"}, {"rating": 3.0, "review": "This device streams Amazon Prime seamlessly. BUT the video stutters continuously on Netflix and it's very, very annoying!  Since all Amazon Prime works, it's clearly not a streaming or HD issue. I have to wonder if it's a proprietary thing......wish I'd bought the Roku instead.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Don't hesitate to order this product--excellent for the price, and the ease of setting up could not be much less complex!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Don't waste your money, After several months of the box crashing and refusing to load hulu, nextflix etc.  And going through 2 remotes that both stopped working  I gave up on this device.  There is also the problem of going over your data limit.  The first month I used 750 gig of data, my isp only allows for 300gig.  This is due to the fact that the fire will only stream in 1080p.  There is absolutely no reason to buy the fire if you have an xbox or ps.  It was a complete waste.", "verified": true, "helpfulness": "3/10", "author": "steve falk"}, {"rating": 1.0, "review": "used to work quiet well but after a few month after it's release it's stopped working.it no longer can play amazon's own movies nor other videos from hulu or netflix.it's not a network, accounts nor service issue as they all work just fine on other devices.disappointed.update 9/28/2014: so a day or so later after this review I decided to try one last thing. I decided to reset the firetv to factory default settings.This basically wipes the device so I have to redownload and register everything.This worked! I was able to view my videos in amazon as well as hulu and netflix.however, today [two weeks later] the device decided to fail yet again. I can't watch any videos no matter what app I'm using.The amazon video player says there's a licencing error.I've factory default reset the firetv once again and all the videos are playing again.I've owned multiple media devices and I've never had this issue on any of them. I can only imagine that amazon is trying to do a update and it fails cause it happens from one moment to the next.I'm a long time amazon customer but I wouldn't recommend this device to anyone. It's just too much trouble for the ordinary user.I'd go with one of their competitors, at least until amazon figures out what it's doing here.", "verified": true, "helpfulness": "2/8", "author": "Larry Ortiz"}]