[{"rating": 5.0, "review": "I've always cherished my Amazon Prime membership for many reasons, especially the Amazon Prime Instant Video feature.I got my Amazon Fire TV last night and hooked it up.  I ran the digital optical cable to my entertainment system, and connected to my router via the ethernet cable (for better speed) instead of the WiFi.I queued a movie and streamed it, and it was simply marvelous.  Uber-clear audio, 1080p picture.I was in heaven.Set Up is really a breeze.  Nothing could be easier.*****Update 5/7/14*****For a while, I've done my Netflix viewing via my IP-connected Blu-Ray player. The performance improvement I saw after setting up my Fire TV, was like going from AOL dialup to a T1 connection.The Apps that are available (Under Apps on the left-hand menu) are pretty cool.  If you really want to see how amazing this thing is, check-out The Smithsonian app.  You'll have access to many full length Smithsonian programs (one of the chief reasons I hung on to subsription services for so long).I have a 20Mbs broadband internet connection.  App downloads are just a few seconds, very impressive.Buffering issues with playback so far appear non-existent.Yeah, pretty much:  Get this thing.  I'm happy.  You will be too.", "verified": true, "helpfulness": "1/1", "author": "Bill"}, {"rating": 5.0, "review": "Really the Amazon Fire TV was a real surprise for its fast loading of programs, especially Netflix. The high-definition video and audio, using the HDMI cable is outstanding.", "verified": true, "helpfulness": "0/0", "author": "Vicente J. LLorca \"Musicólogo\""}, {"rating": 5.0, "review": "Very small device yet does great things. Movies are very clear n crisp. I watch youtube in this device and it s a whole new youtube experience for me. Easy to navigate. Hope they add more apps and games too.", "verified": true, "helpfulness": "0/0", "author": "Amazonshopper"}, {"rating": 5.0, "review": "I love this all you have to do is say what movie you want and there it is. Would highly recommend getting prime if you don't already have. There are a lot of movie/shows you can watch for free. If you don't have an Amazon Fire TV yet you need to order one today.", "verified": true, "helpfulness": "0/0", "author": "Suwaneegirl"}, {"rating": 5.0, "review": "I bought my Fire TV a couple of weeks ago, and have ended up using it instead of my xbox or cromcast for extended tv viewing.The Good:Fast - preloads movies so often clicking play immediately starts the movie. Also games load very quickly with little load screen action.Voice control works well for the limited apps that utilize it.The Bad:Very little hard drive space. If you plan on downloading HD films or large games you will end up deleting quickly. This doesn't make much sense to me as a larger flash drive would be relatively inexpensive, there is also no SD card slot and the USB does not allow removable storage.", "verified": true, "helpfulness": "2/2", "author": "Jacob Lynn"}, {"rating": 4.0, "review": "excelent product , hands down the best set top box out there ,voice search its awesome but saddly doesnt work with netflix", "verified": true, "helpfulness": "0/0", "author": "Mario"}, {"rating": 1.0, "review": "I am concerned with the asap feature that learns what you like. I have limited bandwidth so just concerned if this is constantly pulling new movies or tv shows up my internet would get sapped in like 10 days. My question is can this be turned off?Update: found my answer through an article on mashable thanks to them I won't be buying into a mistake. For others needing this answer the asap feature can not be turned off making this device a 1 after all no need to edit or delete it. Note to amazon those of us on limited bandwidth can use these apps still but we need a way to monitor the asap feature so our limit isn't used up too fast.", "verified": false, "helpfulness": "3/17", "author": "BamaGoatt"}, {"rating": 4.0, "review": "The Amazon Fire is a very good product for streaming movies, TV, games, etc...  I would recommend that a blu-ray DVD be included as an additional bonus for watching DVD's.  Curently, I have to switch the cable to watch my Blu-Ray DVD's.", "verified": true, "helpfulness": "0/0", "author": "ann comley"}, {"rating": 5.0, "review": "Easy 2 min set up... Works like a charm... So happy to have this..not having cable, this was a perfect option-", "verified": true, "helpfulness": "0/0", "author": "Juliet"}, {"rating": 5.0, "review": "I am a big fan of Amazon and its Prime ecosystem of books, movies, and fast delivery times. I've had just about every rendition of the Kindle ereader and fire tablets. I'm heavily invested in Amazon ebooks and have become more invested in the Amazon Instant Video service over the last year. I find it hard to justify paying so much $$$ for cable TV when I can use Hulu Plus and Amazon Instant Video to get all of the same programming (with fewer commercials BTW) for a lot less. Add to this that I run a Plex media server and that I've had a Google Chromecast since the week of it's launch and you can see that I'm only a hair's breadth away from ditching cable TV completely.The only thing that kept me hanging on was the intermittent problem with streaming to the Chromecast. I had a lot of buffering issues, stuttering, and stops in the video playback. This was most pronounced with my Plex server. I spent more than a few $$$ on the server and the network, and none of my other devices had these problems (tablets, phones, game consoles, etc...all work flawlessly). I could use my Xbox, but I HATE paying the yearly MSLive fees just to use Netflix and Hulu. I've also never been impressed by the hardware specs on the more expensive Apply TV or Roku devices. Why pay so much more for a device that has about the same pipeline as the Chromecast? Sure they have more apps, but the hardware didn't justify the price to me. I stuck with the Chromecast and just accepted the issues were going to happen.Then along came the Amazon Fire TV, a powerhouse internet media streaming device that is for all intents and purposes a suped up android tablet without a screen. I won't lie and say I was on the fence about it. Finally, here was a streaming device with power to spare! I bought one immediately and couldn't wait to get it hooked up. After playing with the apps, the amazing voice control, and the ease of the interface, I have to admit that I have found exactly what I was looking for.This thing is SUPER quick. The speed with which it loads movies and tv shows is astounding. Amazon states they have some crazy mind reading clairvoyant algorithm running that predicts what you're going to select and it begins to buffer it even before you hit play. If that's true, please let it send me some lottery numbers because damned if that thing isn't incredibly accurate. And the voice recognition via the remote control is better than anything I've used on my android phones. I hit the button, whispered \"Justified\" and had Timothy Olyphant quick drawing on fools in less than 5 seconds. Simply put? Amazing.The voice recognition does not work yet in other apps. However, I'm happy to say that Hulu Plus was much more stable on the Amazon Fire TV than it was on the Google Chromecast. I had no freezing or stuttering, and it was streaming in HD immediately, whereas the Chromecast tends to start off in SD and then upgrades to HD as it buffers more of the content. Pandora is responsive and surprisingly easy to use w/ the remote control. Netflix is as great as always, though I will add that I like the interface in the Fire App much more than I like that on my Xbox 360.The big seller for me, however, is how well the Plex app works. I have a large library of music, photos, tv shows and movies hosted on my own Plex Media Server. It works great streaming to my phones and tablets. However, it was spotty at best with the Chromecast. I am happy to say that it is rock solid with the Amazon Fire TV. The interface loads immediately. The movies load up much quicker than on any other device. I am finally able to fast fwd and rewind in the app without stuttering or pauses. The hardware in the Fire TV handles all my Plex needs like a pro. I did a little jig...it's that good.I have yet to play any games on the Fire TV as I don't have the controller yet (oh...but it will be mine!). However, the fact that devs are clearly porting over Android hits for it speaks volumes to the user base that Amazon can reach. There are reasons why devs like Telltale Games are porting to the Kindle prior to any other android device...stability and user base being prime amongst them. It doesn't hurt that the hardware specs on the Fire put it in the top tier of all Android devices. Amazon is showing attention to detail when it comes to hardware as evidenced in the Kindle HDX, and it is continuing that trend with the Fire TV. It's got beefy power and I can't wait to dive into World at War, Asphalt 8, Bard's Tale, The Cave, and the Walking Dead once my controller is delivered.To wrap up, the Kindle Fire TV is an amazingly nimble internet media streaming device that can clearly compete with the Google Chromecast, Roku HD and Apple TV devices. In fact, it's so speedy and stable it has now rendered my Chromecast a travel device...something I'll tuck into my laptop bag when I'm away on vacation and not much else. I know many would argue that the $99 price tag puts it in a different class than the $35 Chromecast, and they'd be right.  This is a clear case of getting what you pay for.  I can't recommend the Fire TV enough. If you want a way to watch your internet streamed media, you can't find a better solution than Amazon's Fire Tv.UPDATEI have found only one area where the Amazon Kindle Fire TV is lacking...it doesn't have the Silk browser found on the Kindle Fire. This wouldn't be an issue if there were good apps for some of my favorite online streaming sites. For example...TedTalks. There is no TedTalks Fire tv app. If I had a browser, I could still watch the videos. The available YouTube apps aren't so hot either. With a browser, this could be resolved. It's a small, nitpicky point, but I do wish there was a browser included.", "verified": true, "helpfulness": "1/1", "author": "Ex Libris Vita \"Ex Libris Vita\""}]