[{"rating": 1.0, "review": "Ok, I don't know why people are raving about this product because it doesnt do much of what people on You Tube as saying and the reviews as well.  This product doesn't do anything it only takes us back to the \"gilda years\" in 90's when Microsoft Web TV was a flop and 3D has failed. Here is why...1) Why would you buy this product when you already have NEW TV's that have \"internet application\" already which are \"smart TV\" with NetFlex, YouTube, and a browser?  Really, all you should already2) Plus you CANNOT use your Tablet to mirror off on your TV because Google Play Store does not support Google Chrome.  You HAVE to go to Google Store to play games there to mirror off your tablet or laptop.Note: I bought this product thinking that you can use your Tablet that already google playstore purchased apps to play off on the TV from the Chromecast Device....IT DOES NOT!!!  (find another device on Amazon that you can do that)3)  I wanted this product so that I can use my laptop to work off my desktop and use it for Excel, Work and (see my laptop) on the TV screen...IT DOES NOT!!! If you want to search the web, email and other stuff, you must be on the Google Browser to see ONLY what on the Google Browser and NOT on Explorer, Firefox, etc.  (you got it?)Note: Its a really dumb device because it ONLY does what google wants it do ONLY.  Google does NOT support Windows and Windows does NOT support Google (The want to keep it a competition and a monopoly) until they are willing to together as a unit or company and make each product compitable to work on each other software platform, but I doubt that for know, because both of them are too greedy and needs to do it for the people or consumer.Note: When I hooked up this device and saw my Google browser, I noticed that my Bluetooth Mouse Did NOT appear it was invisible, but you can click on images, type, but you won't see your Mouse Pointer or taskbar on top, because remember, Microsoft owns that taskbar or pointer on their Window platform...you understand?This happens to be a really dumb product and I don't why the everybody is \"raving\" about it when Microsoft made a similar product called the WebTV and that FAILED! So will this product.  I know I know everybody is saying that is still in its infantcy stage but that what they said about WebTV and it was (paid sucription) and didn't go nowhere.Everybody wait when they come out with a TV with a computer hard drive right next to the TV so that you can access your TV as a computer while your on your bed or lounge to do your work.  I will be waiting for that, if there is a smart brain out there who is listening.So, I experienced this product and it really didn't nothing for me, because if I wanted a bigger TV for Netflix, YouTube, or Google, then I would buy a BIGGER TV WITH ALL THE FEATURES without buying a small device.", "verified": true, "helpfulness": "2/9", "author": "Norma Cano"}, {"rating": 5.0, "review": "I got this as a christmast presant for my brother, He just loves it. Comes out of work and starts sreeming.", "verified": true, "helpfulness": "0/0", "author": "Nelson Rosario"}, {"rating": 5.0, "review": "Sold my xbox so I had no access to my netflix account on my television. Considered investing in a new smart tv but hated the idea of doing that when I already have a 50 inch flat screen in the living room. Grabbed the google chromecast for 35 bucks 25 minutes after getting the device it was connected and streaming netflix using my phone as a controller also my iPad. I am in love with this device, it can be the replacement for my $180 cable bill,", "verified": false, "helpfulness": "0/0", "author": "Benny"}, {"rating": 5.0, "review": "Gave it to my husband for Christmas and it is awesome! Easy to set up and use from any device like your phone or iPad or any tablet.  Husband and kids love it. Great price for a great piece of tech.", "verified": true, "helpfulness": "0/0", "author": "Rebecca Ann Beck"}, {"rating": 3.0, "review": "Very good but need to be updated to run faster and more support for programs to display mobile content and fully computer", "verified": true, "helpfulness": "0/0", "author": "Ramzi mohammad"}, {"rating": 5.0, "review": "Arrived in time for Xmas and my mother in law loves it. It's simple enough to operate for anyone with a smart phone. Great girft.", "verified": true, "helpfulness": "0/0", "author": "Squawk"}, {"rating": 4.0, "review": "I am planning on buying another one for my other tv it is a good price and it is easy to use...", "verified": true, "helpfulness": "0/0", "author": "jared uyehara"}, {"rating": 5.0, "review": "I searched high and low for something to help with \"just TV\" and finally found this.  It is fantastic!  I had a bit of a problem to get it to work, so I called Samsung.  I have both the Samsung Galaxy s4 and Samsung Galaxy Note 10.1.  Samsung told me that the Chromecast was NOT compatible with any of their products.  They were not exactly truthful.  After I realized what I was doing wrong.  They both work great.  If you need help with this product don't take the word of other manufacturers.  I love my Google Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Ronda McKamey"}, {"rating": 2.0, "review": "Youtube or Netfilx, yes -- but is that all there is to the product?  Chrome tab cast non functional after a few days.  No indication of issue.  Amazon Prime via tab cast worked (sort of) but laptop fan on high (annoying) and video did not match sound (annoying).Considering how many of these are sold by Amazon hard to imagine no support for Amazon Prime.  Cancelled Amazon Prime.  Not a good day for Amazon or Google.The packaging is amazing.", "verified": true, "helpfulness": "0/1", "author": "Richard H \"Richard H\""}, {"rating": 5.0, "review": "I bought this when it first came on market a few months back. It works beautifully.  I bought another one for my parents.  Using Apple chromecast app, installation is easier than easy. Now my parents can enjoy their favorite YouTube video or shows on a bigger screen.", "verified": true, "helpfulness": "0/2", "author": "Working Mom \"Working Mom\""}]