[{"rating": 3.0, "review": "I did not really read the specifications or I didn't know that it does not work with the apple airport. Though it would have been easier to use, I am not using it now. I hope it will be upgraded to be able to work with other apple products! I do not want to buy another router for my airport utility is working well!", "verified": true, "helpfulness": "0/1", "author": "Augusto T. Acob"}, {"rating": 5.0, "review": "Setup was rediculously simple. Just need Hulu and Amazon Instant and I'll get rid of my Roku. This is the cheapest and best set top box out there.", "verified": true, "helpfulness": "1/1", "author": "John"}, {"rating": 2.0, "review": "It does NOT let you use the internet on the TV from  your phone.Hopefully I can upgrade it later.", "verified": true, "helpfulness": "0/0", "author": "Todd Nelson"}, {"rating": 5.0, "review": "This product is worth having for all your flat screen tv's in your home.  The Google Chromecast setup is easy and amazing;it's one of the best investments I have ever made.", "verified": true, "helpfulness": "1/1", "author": "Kimberly M McLemore"}, {"rating": 2.0, "review": "For the Good: I will say the setup was easy.  I followed the simple directions and using my phone it was running in about 5 minutes.For the Bad: while it easily casts netflix and hulu and HBOGo from my phone, it would not cast Hulu from my tablet, the icon in Hulu never appeared despite reloading it twice.  Also I can't cast browser windows from the tablet or my phone.  You can froma laptop, but not your other devices.For the Ugly: it doesn't work at all with a desktop.  The device has to be wireless.  Even though my desktop can see the Chromecast in the networked devices, the chomecast software can't handle communicating with it, so my desktop is right out as a streaming device.At the end of the day, it works great for a laptop, it works kinda from a phone or tablet, and doesn't work at all for a wired desktop.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Install was easy enough.  Only streams from a very limited number of sites though.  For older model tv's I can see the value...but newer tv's with app or direct wifi connect capabilities, this device is not needed.", "verified": true, "helpfulness": "0/0", "author": "ezzylivin"}, {"rating": 5.0, "review": "Easy to set up.  Easy to use. Can't beat the price. And it can be transferred from one TV to another once you set it up. Buy one!", "verified": true, "helpfulness": "0/0", "author": "Erlan Dobronsky"}, {"rating": 5.0, "review": "I have to say for what it's worth, definitely an awesome device. Especially with my plex pass membership plex where ever I have WiFi? Count me in. great price for a great product.", "verified": true, "helpfulness": "0/0", "author": "Alfredo Dinunzio"}, {"rating": 3.0, "review": "The chromecast constantly buffers the router is really close by. Also if you turn on your microwave it will interrupt the signal causing it to buffer even more.", "verified": true, "helpfulness": "3/3", "author": "Jose"}, {"rating": 4.0, "review": "Great product. Simple to install and it is good option to see youtube videos and Netflix movie in your  tv. Now we need more apps that cast their content.", "verified": true, "helpfulness": "0/0", "author": "Pablo Mazzilli"}]