[{"rating": 3.0, "review": "Need more apps to cast, no the ones that need to be paid in order to get movies/videos from my local drives. It should be free. Hope this happen soon. As soon as the SDK be realese for all developers.", "verified": true, "helpfulness": "0/0", "author": "Juan Matos"}, {"rating": 1.0, "review": "Don't buy this!!! We bought it thinking it would work well. It doesn't at all, choppy picture, sound is off, and it closes in the middle of playing! So we followed the troubleshooting on the website to see if there was a solution, it still wouldn't work right. I emailed the help section on the website and the didn't address any of my issue but rather sent me exactly what was on the help page that I had already done myself to try and fix it. Then I tried to return it and the actually want to charge me shipping to return it!", "verified": true, "helpfulness": "1/2", "author": "Sam4h6"}, {"rating": 5.0, "review": "Easy to install - about 10 minutes.  Works great! Download Chromecast software to your tablet or laptop and follow the directions. No problems.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"mfbishop\""}, {"rating": 5.0, "review": "Bought this for my husband who isn't very tech savvy.  Easy to connect, picture quality is top notch and has better streaming speeds that our internet ready tv.", "verified": true, "helpfulness": "1/1", "author": "April Cross"}, {"rating": 5.0, "review": "The Chromecast is super convenient to use. Now I can watch movies and videos on TV instead of on my small computer screen. I like it! If you stay at home a lot in weekends, it's highly recommended to buy a chromecast!", "verified": true, "helpfulness": "0/0", "author": "Haojie Zhang"}, {"rating": 5.0, "review": "This was ordered as a gift for my nephew.  He loves being able to just plug it in and stream music and movies.", "verified": true, "helpfulness": "0/0", "author": "A.J."}, {"rating": 5.0, "review": "Easy to install and download movies and tv programing with the wifi that I have. Told a few friends about it and they are impressed with it too.", "verified": true, "helpfulness": "0/0", "author": "James Davis"}, {"rating": 4.0, "review": "I bought this for myself and a family member for Xmas, works good off my phone, good off my computer..but will not work on Kindle. I also picked up a Kindle fire hd..hoping I could stream from it to the Chromecast...not.Amazon wants you to buy their own streaming set up...called prime. Which they have there own streaming app that only works with that.So works with a lot of products..as long as those products don't come from Amazon. Now I am debating returning my Kindle.", "verified": true, "helpfulness": "0/1", "author": "jeff jones"}, {"rating": 1.0, "review": "This gadget was very disappointing. I  bought it to work with my I-pad so I could see anything on my I-pad screen on my TV. It plugged into the TV side HDMI slot and its power cord plugged into the USB slot and worked fine, But it would not show the Ipad screen. All it will do is show Facebook and Netflix which I already get from my Sony blue Ray player. I have a Chrome book but it does not work with that either because it is Samsung!  Overall a waste of money. My son tried to down load an ap for his windows laptop and could not link it up either.", "verified": true, "helpfulness": "1/2", "author": "Theodore L. Phillips \"Farfalla\""}, {"rating": 5.0, "review": "I recently purchased a SmartTV for my living room and moved my old TV into my bedroom.  I love my new SmartTV and use it everyday to watch Netflix and Hulu but was depressed my old TV in my bedroom couldn't do the same and did not want to shell out another $700 for a TV.  I came across this great device.  It took me a mere 5 min to setup and update to get this to work.  Just plug it in download the app on your device and go into the movie or show you want to play.  This now allows me sit in bed and watch anything i want so i can fall asleep in peace.Only downside to it is it does not run things like Amazon Prime yet.", "verified": true, "helpfulness": "0/0", "author": "Eric Meyers"}]