[{"rating": 3.0, "review": "Initially it seems easy to use, but. let's be real - what is it that we don't like.  1.  movies are easier to locate on a kindle then use voice command ( which works great) to add movies to your Watch a List .2.  the movies you would like to watch with Prime for free turn out to be most are avail only for an add'l fee.  3.I thought we could listen to music already purchased on Amazon Cloud - you can't.  4.  Often when watching Direct TV, the TV will go to the Fire TV screen - a real nuisance .  After using for a. weekend, I haven't bothered with it.  My main reason for purchasing was for movies and music -", "verified": true, "helpfulness": "1/2", "author": "Anthony Cook"}, {"rating": 5.0, "review": "I have pulled my Apple TV and XBox 360 out of my system. This does all that I need. The games are great, too!", "verified": true, "helpfulness": "1/1", "author": "T-Bone \"tbeecher6\""}, {"rating": 5.0, "review": "I love my Amazon Fire TV. It's a great way to watch my favorite shows from Amazon Prime. it's really easy to use.", "verified": false, "helpfulness": "1/1", "author": "Gail Smith"}, {"rating": 5.0, "review": "I bought a Roku 3 last week and quickly returned it.  First, it looks and feels like a cheap little toy. Second, you have to provide your credit card information in order to register it!  Seriously!The Fire TV unit feels like it's solidly built.  I am streaming Netflix just fine.  It's easy to use, and NO CREDIT CARD IS REQUIRED!", "verified": true, "helpfulness": "0/1", "author": "The Dude"}, {"rating": 5.0, "review": "Hook up and getting setup was very easy.  Watched the cartoon and started playing with this Amazon Fire TV. VERY EASY.  I have a Roku 3 which I have in my bedroom because it has the headphone jack for watching movies.  I am a prime member and love Amazon.  I have purchased 5 kindles for ourself & grandkids.When I got to the home page I noticed my apps, movie list, pictures, & games were already showing.  Amazon did a great job having my cloud items already to go.  The only thing not showing is my music, but that is coming.  You can speak & your movie comes up or your actor. When a movie pops up & will show you all the ways you can watch the movie.  Prime, rent, buy or other apps as Netflix.  Very well done.  I started a movie on my Kindle HDX and flinged it to the Fire & watched it on the TV.  Very cool.  Do not know at this time what else you can do.  I paired up my Laptop and will pair up my Samsung phone later on.  Also you can call up the Netflix app by speaking.  When you bring up a Netflix you will have to use the remote to move around, which is no big deal. Order this Amazon FireTV.  It is great!", "verified": true, "helpfulness": "3/4", "author": "Nancy Gilliam"}, {"rating": 5.0, "review": "OMG,this is so much faster than my roku,the speed is fantastic,I have to say the remote is to sensitive at times, but I love my fire TV.", "verified": true, "helpfulness": "3/3", "author": "Palm Lover \"Palm Lover\""}, {"rating": 2.0, "review": "If you aren't using an UHD TV, this is a great product.  I almost kept it just for the voice search... which is marvelous.  However, my TVs are UHD, and even with an outboard Sekei U-Vision 4K upscaler, the picture quality is ... meh.  I get a much better picture viewing Amazon Prime TV using scaling BD players, and selecting Amazon Prime TV as the source, even though I lose voice search.So... if you're only using 720p,  this is a 5 star product.  With 1080p, 3 or 4 stars (not much HD content on Amazon).  But when you bump to 2160p, I think you'll prefer your smart hub or in-set upscaler.", "verified": true, "helpfulness": "2/8", "author": "Hualalai"}, {"rating": 5.0, "review": "Lightning fast - Great GUI - The best I have seen, kids love the games.  I like the parental controls.", "verified": true, "helpfulness": "1/1", "author": "Mister R. \"Crazy Reader\""}, {"rating": 5.0, "review": "We have been using our Kindle Fire HD to watch Prime and Netflix movies on our TV. Having the Fire TV is GREAT as compared to continually having to connect the Kindle Fire HD. Everything works fine with the Fire TV. Even the voice search has worked every time from the start. The only word of caution to new buyers (especially if you have used a Fire HD), THE CABLES ARE NOT THE SAME. The Fire TV requires a full size HDMI cable connection on both ends where the Fire HD uses a miniature connection on the Fire HD end. I started to hook up the new Fire TV with the same cable I had been using and much to my dismay I had to wait for a new cable purchase. As said before, once I had the correct cable the Fire TV works GREAT. I have had no issues.", "verified": true, "helpfulness": "2/4", "author": "Larry L."}, {"rating": 3.0, "review": "The unit itself is extremely high quality and the fact that you have digital audio out to your receiver was why I purchased it. Sadly though, either Plex or Amazon doesn't allow audio pass through to your receiver, therefore you can't watch any of your own movies in DTS and other high quality audio. Also, Netflix has been neutered. If you're going to include them, at least allow them to provide the same great user interface that Netflix is known for. It's a really bad Netflix interface on this unit, but Amazon Instant Video interface is beautiful and works with the voice search flawlessly. I sent mine back because of these issues and I hope that either Amazon or Plex fixes the pass through issue.", "verified": true, "helpfulness": "5/5", "author": "Shon"}]