[{"rating": 5.0, "review": "I love the Google comcast I switch from my iPad to the television' great invention", "verified": true, "helpfulness": "0/0", "author": "Donna Petties"}, {"rating": 5.0, "review": "everything ok, just need more apps for this kind of streaming..", "verified": true, "helpfulness": "0/0", "author": "Milan"}, {"rating": 5.0, "review": "If you are looking for a fast and reliable way to stream content, I highly recommend the Chromecast. Worked amazing, even under less than optimal wifi conditions. It's like magic.", "verified": true, "helpfulness": "0/0", "author": "Rk"}, {"rating": 5.0, "review": "The viewing options are slightly limited when using a phone (app restrictions), but when we use our laptop we can watch everything we want with ease. The quality is great and the only lag time is due to our weak internet router.", "verified": true, "helpfulness": "0/0", "author": "Jessica Clark"}, {"rating": 5.0, "review": "Greatest electronic toy ive bout for myself this year. I download movies playing at the movies and screen cast them to my 83 inch tv. I can have movie nite with the family every night for no cost. I love it", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 5.0, "review": "Fantastic little device, but I would only highly recommend if you are firmly entrenched in the Google ecosystem.", "verified": true, "helpfulness": "0/0", "author": "B. Coleman"}, {"rating": 5.0, "review": "It's awesome and cheap. Get it. Really....it makes life easier without all the wires and boxes.", "verified": true, "helpfulness": "0/0", "author": "rosshawk"}, {"rating": 5.0, "review": "With this handy dongle, I never have to watch television again. I just download the apps onto my iPhone and then stream through the Chromecast. It's also very easy to connect the Chromecast to my laptop through Google Chrome, although the buffer time seems to be a tad longer when I use Google Chrome as opposed to the apps on my phone.", "verified": true, "helpfulness": "0/0", "author": "Tarantallegra"}, {"rating": 3.0, "review": "Beginning to drop a lot lately.", "verified": true, "helpfulness": "0/0", "author": "Mellow"}, {"rating": 5.0, "review": "You can take my kids and my wife, but please don't take away my Chromecast!", "verified": true, "helpfulness": "0/0", "author": "SailorBoy"}]