[{"rating": 4.0, "review": "Great product if you don't have a smart TV.  Since I do it was overkill.", "verified": true, "helpfulness": "0/0", "author": "smilesawalking \"Jeanne\""}, {"rating": 5.0, "review": "I have been using an Apple TV 2 for the last 3 years. I was very excited to see a new alternative come on the market. I had Jailbroke the Apple TV so I could put XBMC on it and stream from my NAS. The Amazon Fire TV allows me to do all this without the headache of the Atv. I was able to quickly load XBMC, if the fire tv loses power or is unplugged I do not have to jailbreak it again. The Netflix app and Amazon Prime is flawless.Hardware in this machine is light years ahead of the competition. I have yet to use it for gaming, but I have nothing but praise for the streaming HTPC functionality of this device!", "verified": true, "helpfulness": "2/2", "author": "Kurt Dedmon"}, {"rating": 5.0, "review": "This box allows us to get Amazon Prime items on our tv. Love it after figuring how to opperate it.", "verified": true, "helpfulness": "0/0", "author": "Reader"}, {"rating": 1.0, "review": "...and I have owned a lot; multiple Blu Ray players with streaming apps, multiple smart TVs, XBOX, ROKU 3, Logitech Revue (Google TV box)...the list goes on.  I'd rather use ANY of those before the FireTVI have to admit it was the hardware that attracted me to this unit.  I look at the specs for everything, and the comparison to other boxes got me excited about all the stuff I could do with the Fire TV.  I even splurged and got the controller.  I have had the Fire TV from the day it came out so the following does not come lightly or without a lot of use under my belt.  And I am (was) an avid user of Amazon content and love (loved) Amazon as a whole for their business model and the services they provide; so I went into this experience completely biased towards liking the FireTV.When I got it in the mail I excitedly tore the box open and ran to the TV to hook it up.  I ripped the Roku 3 out and plugged my new toy in.  Set-up was really easy (for most, I understand that this is not always the case) and I was off and running...well, more like crawling really.  The wireless capability on the FireTv isn't really the greatest...I can have full bars over a 50Mbps connection and the shows and movies will still stall out and I get the warning that there must be something wrong with my internet connection.  Odd; so I go off and dutifully check my router and wifi...everything is humming along as fast as possible...so I check the other wifi devices in the vicinity of the Fire TV.  I have an internet TV that has Amazon Prime, Netflix, Hulu Plus, etc. and I have an XBOX, both right next to it.  I check the streaming apps on those and have no problem watching the exact same show; so maybe it was just a hiccup and everything was effected but it's better now.  I go back to the Fire TV and same problem...can't watch shows.This happens off and on with the Fire TV for no apparent reason.  And even when I can watch shows I can only really watch Amazon prime content because Netflix performance is usually in the toilet, and Hulu Plus has a synching issue with the audio where the voices are seconds off from the video.To address the bandwidth problems I thought I would get a media hub with 802.11ac. I tested it, and it is getting about 600Mbps to make sure that I was getting all the speed available from my connection.  I plugged all my hardware into the hub and most everything was off and running...except, again, the Fire TV.  I can watch streaming content on anything plugged into the hub reliably except the Fire TV.So now the only thing I can watch on the FireTV is Amazon Prime content, although I usually have to stop and start the show 10 times because the audio doesn't come through correctly. The problem continues with all the other streaming apps (Netflix, Hulu Plus, etc.), if I can even get to them due to the abysmal menus on the Fire TV...they really are awful.  But then, all menus on anything ever built by Amazon are terrible.  I really believe they need to fire whoever designs their UI.  Seriously, media and app content menus and web pages are awful.  Just copy someone who has it right.UPDATE:  So Hulu Plus now barely works and Netflix never works on this box.  No amount of unplugging/plugging in can fix that.  It will run the games I have installed but won't let me use the controller for most of the games, and I'm talking about the ones advertized as controller compatible.  I find myself going to the room where I have the Roku 3 set up so I can watch what I want reliably.  Every time I go to stream something on the FireTV I get angrier and angrier that I bought it.  Not just that, I have just about abandoned buying anything from Amazon as a result.  I have lost respect for the company as a whole directly as a result of buying this awful streaming media player.  This experience has also highlighted other issues I have with Amazon...the fact that I can't watch the content that I OWN on either my tablet or my phone because they don't have an app on either Google Play or Amazon App store and when I try to get it through the browser it says i can't watch it on this device; the Asus Transformer Prime and Galaxy 5s aren't compatible with playing media from Amazon...did they not pay you money?  You have to buy Amazon hardware for that I guess. I'm on the verge of cancelling Amazon Prime, selling the FireTV and Kindle, and never buying anything from Amazon ever again.Mine may be an exception to the stellar performance that a lot of the people reviewing the box may have, or it might be just that I have higher expectations than the average user, I can't say for sure.  But I will say that I went from being completely in love with the Amazon brand to abandoning it completely as a result of my experience with the FireTV.", "verified": true, "helpfulness": "4/6", "author": "E. Bowen \"BS Detector\""}, {"rating": 5.0, "review": "I like it even if I don't know how to do all the things on it.  I bought a key board, but I still can't get it to pair with the Kindle?!  I also downloaded a couple of games, but a week later I tried to download but it won't work.", "verified": true, "helpfulness": "0/1", "author": "Antoinette Rubin"}, {"rating": 2.0, "review": "It works great and loved how thin it was. The voice comand didn't work as well as I had hoped. The only real negative issue is to get the most out of it, you must be a prime member. I don't want to pay 100 dollars for fire tv and another 100 dollars to enjoy it. Not being a prime member you only are able to get about 30% use from it. Hate that Amazon set it up that way.", "verified": true, "helpfulness": "1/3", "author": "Amazon Customer"}, {"rating": 5.0, "review": "LOVE this product.  It offers the Amazon Prime video, which was our deciding factor over Apple TV.  And we are appleheads.", "verified": true, "helpfulness": "0/1", "author": "Steph"}, {"rating": 4.0, "review": "It is working well and is fun to use.", "verified": true, "helpfulness": "0/2", "author": "eleven"}, {"rating": 5.0, "review": "Love it! It far surpasses what I had thought it was going to be.", "verified": true, "helpfulness": "0/1", "author": "Debra Saturday \"Debra\""}, {"rating": 5.0, "review": "This little box is phenomenal. I cannot compare this to its competitors as I've never used them. However, I can tell that this was plug and play simple. I was up and running within minutes. I now have access to my Prime Instant Movies and Netflix in one spot. The streaming and quality of the picture and sound is great. If you are a Prime Member Fire TV helps provide you access to the many benefits of your membership.", "verified": true, "helpfulness": "0/0", "author": "Peter A. Bartelt"}]