[{"rating": 5.0, "review": "easy to use", "verified": true, "helpfulness": "0/0", "author": "Jason LIM"}, {"rating": 3.0, "review": "Amazon has very few free movies, and the usb port cannot be used to view videos from a jump drive. It is not very useful for me.", "verified": true, "helpfulness": "1/3", "author": "Vern Barela"}, {"rating": 5.0, "review": "Very easy setup and a large selection of movies, tv shows, apps, and games to choose from.  Just wish they subscribed to more of the basic broadcast stations.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"student\""}, {"rating": 1.0, "review": "Can't watch Netflix. The app no longer works.", "verified": true, "helpfulness": "2/8", "author": "Amazon Customer"}, {"rating": 4.0, "review": "It's been pretty good.  Easy to install.  The voice feature does not function very well for me and it's tedious to type in the searches.  You have to be careful to make sure you know if your'e in Amazon TV, NetFlix or one of the other stations offered.  There have been a few times I tough I was in Netflix and I was in Amazon.", "verified": true, "helpfulness": "1/1", "author": "Mr. Mortimer"}, {"rating": 5.0, "review": "I wasn't sure about this purchase for my husband but the whole family loves it.", "verified": true, "helpfulness": "0/0", "author": "K. Morrissey"}, {"rating": 5.0, "review": "Love it!!!", "verified": true, "helpfulness": "0/0", "author": "Kimberly K. Hasapes"}, {"rating": 3.0, "review": "2/18/15 Update: I loaded a couple of games for my kids. The load time to play is incredibly slow. As far as games go...meh.I picked up the Amazon Fire TV from a big box store. I have to say, everything about the box and remote is svelte. I also love that there is integration with Amazon's Cloud services and gaming potential (see update above: meh performance on this front). I really like that Bluetooth is built in so you can have audio out with no additional cords. The music player has some nice configurations available. I was surprised by how much I actually liked this feature. The voice search on the remote does work well.I like using Apps. I had been using a 5 year old Roku unit that did not easily allow me to switch between user profiles. The app makes it easy. However, this is where the good ends. Overall, the Roku's UI stands more than head and shoulders above Fire TV.Amazon needs to design the UI around the fact the user isn't necessarily holding a smart device in their hand or sitting in front of a computer. Many customers are trying to use it from their couch, meaning there is space between the user and the interface. It feels like Amazon used an artist who understands the beauty of minimalism/elegance to design the physical unit and a technical group with no oversight for the rest, and ne'er the twain shall meet.I expected this device to prefer Amazon content - that's a given. I did not expect it to be more difficult than using my computer. I find that I'd rather add things to my watchlist via my phone/computer so I don't have to deal with the UI...that's not good if your customers feel they have to bypass a clumsily designed environment.So Roku really set the standard for UI and Amazon falls flat. As others have noted, it is difficult to quickly discern what is Prime content vs what is paid. Adding further annoyance is the font style or size (or both). Sitting about 7 feet away from my 32 inch screen, I can barely read the text. That's infuriating especially when trying to determine if I'm about to rent something or if it is included with Prime. If you have an HDX, you might find that the UI for Fire TV doesn't affect you much, but why should we need another device to make up for this? I'm convinced the voice search is there to make up for the terrible UI.Sleep Mode: Should you really be forced to go into settings to put the Fire TV to sleep? I don't think so. There should be a shortcut for this.This also needs an SD slot and/or allow for USB storage integration.I'm on the fence with the Fire TV. I might be returning this and getting a Roku 3. For about the same cost, you can get a Roku 3 that is designed around how you use it and can integrate with your other devices. With the Fire TV, you get something that hobbles along and really needs outside assistance from other devices to be manageable. I bought the Fire TV based primarily on the specs - if you think specs are everything, you might be happy with this. If your breath doesn't smell like Faygo and Cheetos, you probably won't.", "verified": false, "helpfulness": "2/5", "author": "the frenchman"}, {"rating": 4.0, "review": "Sold my rokustreaming  devises. This is a great streaming devise. Just a bit limited in apps yet. My only real gripe is no vudu  That is the best newer movie rental service by far. If the fire had vudu I would add another star.  So far everything else great.  Easy set up great pic audio very flexible.  If you connect hdmi direct into a receiver or soundbar it will decode Netflix dd+ to dd 5.1 true 5 channel sound rokustreaming does not do this.  Also very fast. It has no power button but in the menu there is a sleep option.  Other than more apps this devise blows the roku streamers  away.  Well worth the lower price and prime . Suggestions to Amazon add hdx, and vudu.  Highly reccomended.", "verified": true, "helpfulness": "1/1", "author": "robert mallis"}, {"rating": 5.0, "review": "FANTASTIC !!!!!", "verified": true, "helpfulness": "0/0", "author": "tom"}]