[{"rating": 5.0, "review": "Awesome product! Google keep it up!  Really nice & easy to configure & use!  Still new so not many apps but YouTube itself it's worth it", "verified": true, "helpfulness": "1/1", "author": "Mehdi \"xbox360forless\""}, {"rating": 1.0, "review": "Great idea, sleek design. Unfortunatelly, just a couple of apps support it. Phone/Tablet - miniscule support, can't even see my picasa web photos. And local media, of course....  For now it's still hard to justify even at a $35 price tag, as there are many other ways to watch YouTube and Netflix. And it's very easy to loose control of Netflix, actually.  Hoped for more features/apps when i was buying...", "verified": false, "helpfulness": "3/3", "author": "MichaelG"}, {"rating": 4.0, "review": "Good but it could really do with mobile chrome browser support. Why Google haven't sorted this out yet is beyond me?", "verified": true, "helpfulness": "0/0", "author": "C. Tsamados"}, {"rating": 3.0, "review": "Limited apps so far. It may work out in the future.Nice price, nice product some dayNice price, nice product some day", "verified": true, "helpfulness": "0/0", "author": "D. Morris"}, {"rating": 5.0, "review": "it is very nice but still needs some improvement, for we cannot watch netflix in some countries. and we cannot watch our own videos on the pc or tablet using this. hopefully it gets upgraded. but very clever device.", "verified": true, "helpfulness": "1/1", "author": "Kapu"}, {"rating": 2.0, "review": "Without the Netflix offer Google Chromecasts is a letdown. The product is limited with options. Maybe useful if you don't wanna invest in A smart tv, Roku or Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Hassan Al Hashemi"}, {"rating": 5.0, "review": "Awesome, use it a lot. Tab Cast With Google Chrome makes this worth every penny alone. I use it from an iPad, android phone and Win7 laptop.", "verified": true, "helpfulness": "1/1", "author": "YoursTruely"}, {"rating": 5.0, "review": "It works flawlessly. I use it every day and have found it very useful in the car too. Who needs a DVD player when you can use the phone as a video source.", "verified": true, "helpfulness": "0/0", "author": "Massoud majidimehr"}, {"rating": 4.0, "review": "All this google chromecast is missing is for you to be able to play your local videos on your phones and tablets to your TVs and I would be happy 100% happy besides that it does a great job playing youtube, netflix, hulu plus from my phone and tablets to the tv at 35$ dollars definitely worth the money.", "verified": true, "helpfulness": "1/1", "author": "@djeddieone"}, {"rating": 2.0, "review": "Doesn't really stream anything except utube, thought it would stream video from apple products, but it doesn't.Not for me I'll stick with Apple TV.", "verified": true, "helpfulness": "0/0", "author": "diane"}]