[{"rating": 5.0, "review": "Fast and smooth overall", "verified": true, "helpfulness": "0/0", "author": "stargate"}, {"rating": 1.0, "review": "Disappointed. It doesn't do more than my smart blue ray player other than voice recognition and that's only for shows", "verified": true, "helpfulness": "1/5", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Daughter got this for Christmas and loves it! She plays games, watches different tv series and movies.", "verified": true, "helpfulness": "0/0", "author": "Danielle Roberts"}, {"rating": 2.0, "review": "Amazon Fire is not nearly as fast or feature rich as Roku and it has way less apps available.  It does however, have a great remote, well laid out and fits nice in your hand.  Layout on the Fire is not as good as on the Roku and there are less setup options.  You have to be extremely careful about not inadvertantly making purcheses unless you go to parental controls and use a 5 charavter password for purchases.  When you do that the downside is that you must enter that pin over and over again for various functions.", "verified": true, "helpfulness": "0/1", "author": "Raymond S."}, {"rating": 5.0, "review": "I'm in love with fire tv.  If they add more channels (HBO etc., live broad casts etc.) I would drop satellite tv.", "verified": true, "helpfulness": "0/0", "author": "ALPODA"}, {"rating": 5.0, "review": "I am pleased with this Amazon Fire TV box. It was so easy to setup. I only wish kept up on the \"real world\" over the last 12 years,  I haven't been to a movie, or even looked at reviews of what to watch!..  I do like the FREE PRIME series available.", "verified": true, "helpfulness": "0/0", "author": "Rocks ROCK \"If you are MAN enough to BREAK IT, be WOMAN enough to FIX IT 2008\""}, {"rating": 5.0, "review": "We're loving it! Bye bye Comcast!", "verified": true, "helpfulness": "0/0", "author": "Taryn Desmond"}, {"rating": 5.0, "review": "Fawk yeah", "verified": true, "helpfulness": "0/0", "author": "Chip Chipperson"}, {"rating": 5.0, "review": "Awesome. It's great not to always string a cord across the room into my Kindle fire.", "verified": true, "helpfulness": "0/0", "author": "a buckeye"}, {"rating": 5.0, "review": "Nice little gizmo.  Just hope the quality of the device itself is there.", "verified": true, "helpfulness": "0/0", "author": "toy junkie"}]