[{"rating": 2.0, "review": "Netflix didn't work properly . Not worth the money .", "verified": true, "helpfulness": "0/0", "author": "Benjamin Maxwell Gonia"}, {"rating": 5.0, "review": "It works perfectly.  I'm going to buy 2 more.", "verified": true, "helpfulness": "0/0", "author": "Your Highness"}, {"rating": 4.0, "review": "Works well enough; it can be a bit choppy at times and i'm finding limited use for it at home, but it's a gem when travelling.  My only complaint is that it doesn't support 802.1X which is a bit of a pain when working with business networks or my home network (I'm a network architect by profession so i have nerd level network gear).  Hopefully google will release a firmware update that will allow it to support 802.1X at some point so i don't have to build compromises into my setup.", "verified": true, "helpfulness": "0/0", "author": "Tim Hendrix"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Jesús"}, {"rating": 5.0, "review": "We LOVE our Chromecast. Couldn't live without it!", "verified": true, "helpfulness": "0/0", "author": "Amedeah"}, {"rating": 5.0, "review": "awesome to have who love free movies and sports.thanks", "verified": false, "helpfulness": "0/0", "author": "TONY"}, {"rating": 4.0, "review": "I felt bad when I would see my mom flip the channels on the TV over and over because nothing was on.  I got her this and hooked her and dad up on my netflicks account and now they can always find something to watch!  It only seems to do Netflicks and YouTube, but maybe they'll change that soon...", "verified": true, "helpfulness": "0/0", "author": "Hip Audio"}, {"rating": 5.0, "review": "Great! Works with all my devices and streams perfect!", "verified": true, "helpfulness": "0/0", "author": "RCSaintL"}, {"rating": 5.0, "review": "very useful device. now it's easy to pump pandora or youtube from anyone's phone to the tv system. great for parties.", "verified": true, "helpfulness": "0/0", "author": "M. Barra"}, {"rating": 1.0, "review": "This product is absolutely terrible. It worked for about a day and now can't connect to anything. Don't waste your money.", "verified": true, "helpfulness": "1/2", "author": "Zach Landis"}]