[{"rating": 2.0, "review": "this product only displays internet content not what is on your computer, but i can put a movie on via-internet for the kids and still work on the computer, thats a plus for me . it's still is a good product.", "verified": true, "helpfulness": "0/0", "author": "David Gutierrez"}, {"rating": 4.0, "review": "Well you get $35 out of it. Looking forward to future improvements. The idea of the is great just needs more stable features", "verified": true, "helpfulness": "0/0", "author": "Luke"}, {"rating": 5.0, "review": "It's so easy to hook this up to my network and watch YouTube videos, Netflix shows, or anything from my laptop.", "verified": true, "helpfulness": "0/0", "author": "Kenny1021"}, {"rating": 3.0, "review": "Works ok not bad.", "verified": true, "helpfulness": "0/0", "author": "Aro"}, {"rating": 5.0, "review": "5stars because its another fine tuned Google product, that's nearly sets itself up and just works! Just Like my chromebook. I got a cast app, and with a click it casts to TV. You can elect to show other tabs in image ie full screen mirror image if PC or click options for just showing that tab, etc. I can say, thanks to my amazing chrome book, that I had 303 tabs open, with Google play in background playing, and a stream from it to TV all at same time. The kicker is that it all ran off my T-Mobile 3g hotspot, with no lag or drag. Thank you Google. Only a matter of time til the word is out and you put Comcast crooks out of business. Ill be supporting and sharing until then! Maybe Google should buy Comcast. Then people would get more then they expect from nice people. And a working product. ;)", "verified": true, "helpfulness": "0/0", "author": "shanntastic"}, {"rating": 5.0, "review": "Excelente producto.", "verified": true, "helpfulness": "0/0", "author": "fredy alberto murillo"}, {"rating": 5.0, "review": "I freakin love it! It's too awesome. Easy n it just feels like mobile magic. Get it.", "verified": false, "helpfulness": "0/0", "author": "Escobar"}, {"rating": 2.0, "review": "The compatibility section for this item reads \"Chromecast is compatible with WiFi-enabled Android 2.3+ smartphones\" which is not specifically accurate. If your WiFi source is a mobile hotspot via said Android smartphone the player will not work. It is actually designed not to work with mobile hotspots. That's pretty important information to have up front especially when it says is with compatible. I returned the item as it was nothing more than a paper weight.", "verified": true, "helpfulness": "0/0", "author": "Stuart R. Donald \"Stuart Reb Donald\""}, {"rating": 5.0, "review": "Everything I had hoped for.  Can't wait for Amazon to jump on board.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Love it, couldn't have asked for a more useful item, it brought my old projector TV 60\" out of retirement..", "verified": true, "helpfulness": "0/0", "author": "BritVic \"victor1651\""}]