[{"rating": 2.0, "review": "If you just want to use it for Netflix ETC. then it is good. If you’re using the Chromecast for Chrome on your laptop to project tabs, the video quality and audio can dump quite a bit. It’s almost useless in IOS you can't cast screens and in chrome you can't even cast tabs. I bought with the device under the impression you could mirror your screen from your laptop, but you can't........there is terrible lag. The technology states it is still in experimental mode. I returned this product.", "verified": false, "helpfulness": "0/0", "author": "Anthony"}, {"rating": 1.0, "review": "Very few options. waste of money. I tried Microsoft Wireless Adaptor and it works fine for all.", "verified": true, "helpfulness": "0/1", "author": "Parveez Shaikh"}, {"rating": 5.0, "review": "Great! It's easy to install and to use. I tested with Youtube and Plex in an old LCD TV, transmitting from my cell (Android) and my Macbook. It's a plug'n'play product! Recommend!", "verified": true, "helpfulness": "0/0", "author": "Luciana"}, {"rating": 5.0, "review": "Just awesome.  We hardly ever used the tv in the main room.  Now we spend significantly more time in the room due to the ease of use of this device and the tv when trying to watch or listen to any number of things.  Obviously this is a clear winner for Netflix customers.  But i use it quite often when trying to play music from my phone, show pictures, let guests control things.  Worth every penny.", "verified": true, "helpfulness": "0/0", "author": "archangel59"}, {"rating": 5.0, "review": "Love to chrome cast. Whether it is Netflix or You tube casting to the TV is easy with the stick.", "verified": true, "helpfulness": "0/0", "author": "da weez"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Adel ali alrajhi"}, {"rating": 2.0, "review": "Very limited, good video if you can get it to work.", "verified": true, "helpfulness": "0/0", "author": "James Towle"}, {"rating": 5.0, "review": "Under $30, what are you waiting for?", "verified": true, "helpfulness": "0/0", "author": "Joseph Mani"}, {"rating": 5.0, "review": "nice piece of technology", "verified": true, "helpfulness": "0/0", "author": "Kimo"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "Martha"}]