[{"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/1", "author": "Stefania Dominguez"}, {"rating": 5.0, "review": "Me and my wife loves this item. It makes our streaming life easier especially when i get to travel with her. We use it in our hotel and not to worry about bringing the HDMI cable with us. perfect.", "verified": true, "helpfulness": "0/0", "author": "Matt Smith"}, {"rating": 5.0, "review": "Finally, TV I get to choose!", "verified": true, "helpfulness": "0/0", "author": "mary vitti"}, {"rating": 5.0, "review": "I am a fan of this gadget i have 3 tv's and each one has its own chromecast. This thing has made my life so much easier", "verified": true, "helpfulness": "0/0", "author": "Simranjit Singh"}, {"rating": 1.0, "review": "Things a piece of junk! Worked great but now it only has error problems all the time. If I'm lucky it'll work sometimes but most of the time it doesn't. I'd recommend saving up and buying something else because this may be cheaper but it works cheaper than the other products like this one.", "verified": false, "helpfulness": "0/0", "author": "Stephen D."}, {"rating": 4.0, "review": "My family and I are always watching movies. We actually watch a lot of movies on our phones and tablets but can never watch them on TV till now. The Google Chrome cast is a wonderful addition to any techies hoard.This device comes with everything you need to get the chrome cast going so no need to buy anything extra. The instructions are clear and precise to get everything synced and going. The only flaw I found is that it can be a total pain in the butt to connect to the Wi-Fi at times. when I disconnected it and move it to a different TV it took us a half an hour to get it to reconnect.But overall I highly think this product is worth it. It's so much easier to watch your movies on the TV instead of fighting with your tablet.", "verified": true, "helpfulness": "0/0", "author": "Kitana jaiya"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "13 blackcats"}, {"rating": 5.0, "review": "Excelent!", "verified": true, "helpfulness": "0/0", "author": "VE379156 A."}, {"rating": 5.0, "review": "works as expected.", "verified": true, "helpfulness": "0/0", "author": "Verni Fernandez"}, {"rating": 1.0, "review": "A", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]