[{"rating": 3.0, "review": "I have both the Roku and the Amazon Fire, both are good units plus the Google Chrome device a far distant third..  The Roku has much superior remote to the Fire.  You can plug in a set of headphone into the the remove for private viewing.  The Roku remote is larger and has a strap and some blue coloring making it much harder to disappear. The designers of the fire TV remote must have had some mischief in mind when they designed a small black disappearing device that is virtually impossible to find in a dark room. We spent hours looking for the Fire remote, which is identical in size to the Amazon Echo remote. I would give the Fire TV five stars if corrected a couple of items, mainly having to do with the remote. Black  is the hardest color to find, if I had my druthers it would be bright yellow and I would add my favorite feature of the iPhone and iPad, which is the find my iPhone app which causes the device to play a sound making it easy to locate. If Amazon insists on making a black small remote, they should at least provide an app so that it can be located when it's lost, which it often is. Fire TV is worthless without the remote.The Roku device has a slower processor than the Fire TV and does not have voice search, which only works with Prime.  I also have Google Chrome, which sets gathering dust as it does not work with Prime TV. I wish these manufacturers would grow up and play together.If private viewing is important or you tend to lose", "verified": true, "helpfulness": "0/0", "author": "S Smith MD"}, {"rating": 5.0, "review": "Fast on time shipment and it was worth the price. I purchased the bundle that come with a Fire TV Box, TV Controller and a game controller. For me it was a great choice. I had been looking at various other gaming consoles and weighing price and options for all of them. Then I started looking into google chromecast and all the other devices in this area, but ultimately I decided to go with the Amazon TV Bundle. It's not a \"gaming console\" per say, but if you are a casual gamer and also like the ability to stream netflix in HD along with a free 30 day trial of Amazon Prime instant video, which includes HBO-GO, then this is the ticket. imo You have access to a lot of content. They just added \"Game Fly\" and Amazon Prime is only 99$ a year which comes out to 8.25 a month. I have netflix which streams nicely on this device, but Amazon Prime has a category called \"movies not on Netflix.\" Anyway, for my purposes this was worth the cost.", "verified": true, "helpfulness": "0/0", "author": "cgm"}, {"rating": 5.0, "review": "I was pleased with Fire TV when I got it and it gets better all the time!  Since the addition of Sling, I will surely drop cable once my contract expires, upgrade my internet service, and still come out $50 - $60 ahead each month.  The choices of what to watch are as good or better that satellite or cable and the addition of Prime Music makes it even better with all of the free albums and playlists available.  I think this is the beginning of the end of satellite and cable as we know it.", "verified": true, "helpfulness": "2/2", "author": "tc79"}, {"rating": 5.0, "review": "Great device. easy to uae.", "verified": true, "helpfulness": "0/0", "author": "Allen Etheridge"}, {"rating": 5.0, "review": "Works great", "verified": true, "helpfulness": "0/0", "author": "John Moriarty"}, {"rating": 1.0, "review": "Latest update now completely bricks the fire TV if the internet is not connected.Apps, games, and local media streaming are completely disabled if the internet connection is down.Critical flaw in an already less than perfect device. Not recommended for use with local DLNA.", "verified": true, "helpfulness": "1/6", "author": "P"}, {"rating": 4.0, "review": "Awesome five stars", "verified": true, "helpfulness": "0/0", "author": "Paul J O'keefe"}, {"rating": 5.0, "review": "I have Netflix,for awhile.it is better than that with more movies & music.no commercials I wish that I could remove movies that I don't want to watch", "verified": true, "helpfulness": "0/0", "author": "matty drumchapel"}, {"rating": 5.0, "review": "it has exceeded my expectations in every way!  way better than an Apple TV, especially once you put Kodi on it!", "verified": true, "helpfulness": "1/1", "author": "Alex"}, {"rating": 1.0, "review": "It needs an HDMI cable that's not included. I'm irritated that I can't set up the thing out of the box. Also in the instructions it doesn't say if it's possible to link to external speakers like my Roku. I wish I hadn't torn out the Roku before trying to get this to work.", "verified": true, "helpfulness": "2/6", "author": "Yellow Pillow"}]