[{"rating": 1.0, "review": "System is too locked down.  Cannot stream your own content -- ONLY stuff purchased in the Play store.  Extremely disappointed in this device.", "verified": true, "helpfulness": "0/0", "author": "N. Thompson"}, {"rating": 4.0, "review": "So far so good.  It appears to not want to run videos direct from my iPad.  I will have to continue to play with it to see if I can figure it out.  Will update as I get more familiar with product.", "verified": true, "helpfulness": "0/0", "author": "DPAZ"}, {"rating": 4.0, "review": "Im removing one star just because it still does not stream local content, but as per google news this little monster will do it.You can go wrong with this dongle just be sure to know what can do and what cannot do.Pros:-Small and it fits any HDMI port, it comes with an extender in case that you HDMI is in a complicated location.-Streams Youtube, Netflix, Google Music and Video without any problems.-Easy Setup.Cons:-Still does not have local media support for streaming.For $35 you convert any regular TV into an Smart one!", "verified": true, "helpfulness": "0/0", "author": "Carlos Saborio Badilla \"C. Ivan\""}, {"rating": 5.0, "review": "Worked seamlessly after an easy set up. Works great with youtube and netflix.  Hope to see some more services added.", "verified": true, "helpfulness": "0/0", "author": "L. Hall"}, {"rating": 2.0, "review": "Only allows Netflix and Youtube.  Sometimes you will see the webpage but you will not see the video in the webpage.", "verified": true, "helpfulness": "0/0", "author": "hellodad"}, {"rating": 4.0, "review": "Awesome product. Easy to use. took a little research to get it to work with my desktop. I gave it 4 out of 5 because of the lack of instructions.", "verified": true, "helpfulness": "0/0", "author": "tony"}, {"rating": 4.0, "review": "Great device and good substitute for expensive alternatives like Roku and Apple TV. This is for non-Smart TV users like me. I am enjoying the 3 month free Netflix now. The code redemption was complicated but it got sorted out in one call with netflix. Device performance is great.", "verified": true, "helpfulness": "0/0", "author": "gamer"}, {"rating": 4.0, "review": "I had to come back and edit this review because I have since had time to appreciate the ease and reliability of the Chromecast HDMI Streaming Media Player compared to other Web-content delivery devices. For the record, I have two Smart DVD players, one Samsung and one Sony. three Roku boxes, and I have used two Smart TVs, one from Vizio and one from LG.My original comments on the Chromecast (abridged version): \"The good: Great price. Neat device. Great packaging. Easy to plug in. Comes with an HDMI extension, for tight spaces in some TVs. Easy set up. Good tech support from Google. The Bad: I bought it to push content from my mobile device and from my mobile network, not my LAN.\"OK, some further explanation here, because when I first bought this thing, I misunderstood its capabilities. And, I might add, so did some of the tech support people at Google, who insisted we could get this to work on a Mobile Network. Fact is, if you think you can use this through your cell phone and your cell phone mobile Network, think again. You need to have Wifi Internet capability in your house in order for this to work. If you want to have content from your phone pushed to your TV, you need a different type of dongle.OK, so, originally, I gave the Chromecast a 1-star because it did not work from my mobile network and in the beginning Google gave me the impression it would. Now I'm giving it 4-stars. I'd give it 5 but it doesn't link with Amazon or carry the wealth of Web-content programming other smart wifi devices carry.The main thing is this. The Chromecast has a great interface. It's fast, and it shoots out HD as well if not better than anything I own. My Sony DVD player is a slow, old dog and constantly resets my router's IPs, which can be a pain in the arse. My Samsung requires that I re-initialize my accounts with User ID and Password every time there's a power failure or the device is unplugged. The Chromecast never does this.One bad thing, I have an older Android phone, running some pre-Jellybean OS. After a recent software update by Google Chromecast, my old Android became obsolete and refused to cast to the TV. You probably should be running an Android phone with jellybean 4.2 or better.", "verified": true, "helpfulness": "0/1", "author": "Bob \"seabgb\""}, {"rating": 5.0, "review": "We didn't really need this but for the price I bought it to try anyway. Then I won a TV! I had a spot for another TV, but didn't want to pay cable fees for it. So now the new TV is our netflix streaming TV. I can't believe how easy this is to use. I stream off my Nook color. Quality is awesome. Never any glitches or lag time. Pretty neat! I can also stream youtube but haven't tried streaming any other content.", "verified": true, "helpfulness": "0/0", "author": "L. Mooring \"VA mom\""}, {"rating": 5.0, "review": "Easy to install, easy to use, cheap.It just works as you would expect.Highly recommended for basically everyone.---Why do I have to write more words?", "verified": true, "helpfulness": "0/0", "author": "Thomas Donker"}]