[{"rating": 5.0, "review": "Thanks to this device, TV is watchable again! Youtube is the channel of choice and options are unlimited!! Setup was a breeze...and this thing lies tucked inconspicuously at the back of the TV. I suspect there are additional applications if I dug about...but this is one of the best $35 I spent on a tech!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I choose the Google Chromecast because it seemed like an easy way for us oldsters to get movies streamed to our tv.  I warned my grandson (19) that we would probably need his help, but we were delighted to find out it plugged in easily and we were up and running in no time at all.  We are still in our free month of Netflix movies and we love this feature.  Our granddaughter (12) was down to visit and was able to see movies after we retired for the night.It was so easy to use and we are so very happy with it.  The price was terrific and well worth it.", "verified": true, "helpfulness": "0/0", "author": "Patricia A. Blackburn"}, {"rating": 5.0, "review": "Really easy to use and set up. I love using Chromecast with my phone, tablet, and laptop. They all work great!", "verified": true, "helpfulness": "0/0", "author": "Nicholas Morrison"}, {"rating": 5.0, "review": "Works well enough for 35 bucks. Wish it had Pandora and Amazon instant video on it. Netflix and Youtube are getting a little thin.", "verified": true, "helpfulness": "0/0", "author": "Daniel Morris"}, {"rating": 3.0, "review": "streams well, sometimes drops network connection and there is voice lag when when streaming. please update for bug fix soon. thanks.", "verified": true, "helpfulness": "0/0", "author": "steven dcroz"}, {"rating": 5.0, "review": "I love it!!! My best purchase ever.I really recommend this gadget: it's cheap and works just as expected. I use it with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Fabio Parodi"}, {"rating": 5.0, "review": "Amazing, can wait till Google launches more apps with it. Its been great for streaming off of chrome as well.", "verified": true, "helpfulness": "0/0", "author": "JG"}, {"rating": 5.0, "review": "Easy to setup and use. Would be nice if it supported more streams, but works well. Can stream pc window, but not as useful for that.", "verified": true, "helpfulness": "0/0", "author": "John W. Martin"}, {"rating": 1.0, "review": "My perception of this when I bought it was that I would be able to stream anything on my PC to my smart TV using this device.  Not so.  Only supports Netflix and YouTube both of which are built in to the TV.  This is a good concept but it should enable any content on your PC for streaming.  The capabilities are overstated.Overhyped but it will make a nice stocking stuffer for someone over this Christmas.", "verified": true, "helpfulness": "36/46", "author": "Paul H. Mansfield \"BSharp\""}, {"rating": 5.0, "review": "Love it. My dad likes to watch Youtube on his nexus, but it was always too small for him and has to squint his eyes. So I bought this so he can stream it to the big screen. So far he spends about 3-5 hours a day watching Youtube on the Chromecast. Bought another one to put in my parents' room.", "verified": true, "helpfulness": "0/0", "author": "S. Mak"}]