[{"rating": 5.0, "review": "What I love about this product is that it allows me to watch my Android content (movies, tv shows, etc.) since I made the switch to Apple's iPhone. Along with Google's content, I am able to stream Netflix at 1080p, which was another reason I ended up purchasing a Google Chromecast. I only hope Google continues to release new apps for the Chromecast since there are only a handful of apps available now. Along with more apps, being able to mirror the screen from my 2nd Gen Nexus 7 would be another reason to pick up the $35 streaming media player. I'd recommend this product to others because I feel Netflix and YouTube will be thoroughly enjoyed by whomever uses this device.", "verified": true, "helpfulness": "0/0", "author": "Justin Hardy"}, {"rating": 5.0, "review": "Awesome product for a great price, just plugged it in and it was ready to be used!! I would highly recommend this product to anyone!!", "verified": true, "helpfulness": "0/0", "author": "sbendine"}, {"rating": 3.0, "review": "Even thought I'm impressed by the simplicity of the usage of the Chromecast and I'm a bit disappointed by its limitations.I wrote a more exhaustive review here. \"ttz .name/2014/01/06/chromecast-everything-you-love-now-on-your-tv-not-really\"", "verified": true, "helpfulness": "0/0", "author": "Thomas T."}, {"rating": 4.0, "review": "Its a great a device at a great price. But, I struggle to get good performance, especially at high resolutions. Also find that it disconnects alot, even after I tried to making adjustments to my wifi network.", "verified": true, "helpfulness": "0/0", "author": "Samir Anand"}, {"rating": 3.0, "review": "I was very excited for this when it finally came out. It was very easy to get set-up by following the directions included. Once I got everything connected and installed, I could not get the Chromecast to work with my laptop. I contacted google about it and they emailed my different troubleshooting ideas, but none of them worked. When I was about to send this back, I searched for solutions, I found a few suggestions on a couple different forums that solved the problem. Turned out I needed to change some of the settings in the Firewall to get the connection to be allowed on my laptop. If you are trying to watch a video on any site other than Youtube or Netflix, it is very jumpy, but the specific sites that they list as working with the Chromecast work pretty well.", "verified": true, "helpfulness": "0/0", "author": "John Ferderer"}, {"rating": 3.0, "review": "The device was very easy to set up per the instructions in the box and only took 10 minutes before I could stream video from Netflix to my TV.  I'm reserving a higher rating for the future when I hope new Apps come out that let me stream other feeds from my iPad and computer.  Nice little device!", "verified": true, "helpfulness": "0/0", "author": "Literal Jim \"The Words Count\""}, {"rating": 4.0, "review": "Great compact unit. I originally purchased this item to take with us on vacation so we could watch netflix in our hotel. I learned the hard way that this device will not work on a wireless router that is set on the guest setting. We already have Roku's on all our tvs but it is cool to put things on the tv from your laptop or iPad.", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "I love Chromecast. I didn't want to pay for another cable connection in my home, but I really wanted to watch movies and TV series on my television and not laptop. I didn't want to spend a fortune to do it, though. Chromecast to the rescue. I've had Chromecast since the week it came out and I've loved it. I've watched more movies in the past six months than I had in the past couple of years. The setup for Chromecast was easy-peasy and I haven't had a problem with it.", "verified": true, "helpfulness": "0/0", "author": "pfowlkes"}, {"rating": 5.0, "review": "Works great with my phone...easy to use. Just wish it had more apps for watching shows like Amazon Prime. Until that happens it's a great streaming device for Netflix and hulu plus and doesn't take up any room with no wires showing.", "verified": true, "helpfulness": "0/0", "author": "melissa"}, {"rating": 4.0, "review": "it works very well with youtube.With Chrome browser, it's a bit slow.I didn't try it yet with other applications.I hope that more apps like hangout, realplayer will support chromecast soon.", "verified": true, "helpfulness": "0/1", "author": "Elias Baaklini"}]