[{"rating": 2.0, "review": "Great product. Does everything its supposed to do. The IOS app has some problems and lags. You can only cast youtube and netflix from your iphone or ipad. So you cannot use chrome browser in ipad to cast ur screen. Unclear if this is possible in android or samsung tablets. So this limits things that you can cast if you have an ipad or iphone. Would hope that google updates its app so that we can cast pictures and browser on our ipads to the big screen. It works great if you have a laptop where the who browser is casted. However I cant see the cursor on the tv so even if I have a wireless keyboard, I can use it without seeing my laptop.Update: 11/15/13After using the chromecast for 4 days, I realized that there is significant buffering issue and even with it playing youtube and netflix I cant seem to have a smooth streaming. The chromecast is barely a ft away from my router and I dont think its my internet as my laptop is streaming fine. Moreover the time of the day determines the streaming quality (I guess the cloud gets overwhelmed). I dec quality to 420p but still the same issue. Returning mine to amazon. Will wait for the next generation of chromecast. For now, going to buy an appletv.", "verified": true, "helpfulness": "0/0", "author": "Adrenaline"}, {"rating": 4.0, "review": "I have only used it to view Netflix.  So I am not sure what else it has to offer but it works great from my android to my TV for netflix.", "verified": true, "helpfulness": "0/0", "author": "Tnew"}, {"rating": 4.0, "review": "Chromecast is very cool and a very inexpensive way to stream to a television. My only issue is that my wife would prefer a remote and not have to rely on a smartphone or tablet, neither of which she possesses.", "verified": true, "helpfulness": "0/0", "author": "Centroid_314"}, {"rating": 2.0, "review": "Easy to  install but not user friendly for selecting video sources. Also disappointing that Amazon prime wasn't listed as an available resource. I will hang on to it and see what refinements are made over time.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The device is very easy to install and hook up to the laptop. I'd prefer it not have the bright light behind it as it lights up a dark room, but it's a very cool, inexpensive way to painlessly send video signal to a TV.", "verified": true, "helpfulness": "0/0", "author": "Daniel Sanchez"}, {"rating": 1.0, "review": "The biggest drawback is the device is dependent on another computer/tab/phone. The only app it offers that you cannot get over Roku, Apple TV or other dongles is YouTube. $35 for just YouTube simply sucks. And, they won't let other apps like Dropbox stream to it, so it isn't an open device.", "verified": true, "helpfulness": "1/2", "author": "TwinPeaker"}, {"rating": 3.0, "review": "If this thing would have cost a penny more I would have returned it.  They did a great job setting a low price since it really doesn't do very much.  I was under the impression I would be able to easily stream most things from my tablet via Chrome, but that only seems to work from my laptop. I think it has a ton of potential and it's awesome if you travel frequently and stay at hotels with HDTV as you can bring this and stream Netflix from your phone or tablet.", "verified": true, "helpfulness": "0/0", "author": "tr0ntr0n21"}, {"rating": 1.0, "review": "If you want to use only Netflix this might be just what you need. If for example, you want to stream your own content, that is a different story. If you have movies on your device, you aren't going to be able to stream them to anything else. The same applies if you watch Amazon's Prime Video streaming.There are all kinds of comments about work-arounds, experiments and so on but is that really what you want to do? If so, try it but if you think you can just take this along in your pocket, plug into some TV somewhere and stream a movie, that isn't going to happen unless you are also paying money for some other services.If you have a lot of movies you already own, Chromecast isn't going to let you stream them to a TV. Again, you can try the work-arounds but really, isn't that a lot of trouble when other products can do what you want out of the box?", "verified": true, "helpfulness": "0/0", "author": "Red Lightning \"It isn't impossible, you just can't figure it out.\""}, {"rating": 5.0, "review": "Good looking and stylish, easy to use, and classy looking.Weak documentation - but it's easy to set up anyway.Now you can stream from Netflix's and never leave the couch ~", "verified": true, "helpfulness": "0/0", "author": "William Shaul"}, {"rating": 1.0, "review": "cant stream your OWN library photos or video to it , ONLY can stream online service youtube hulu netflix >", "verified": true, "helpfulness": "1/2", "author": "mohammad"}]