[{"rating": 1.0, "review": "It would have been nice to know that netflix is unavailable. Would have gone with Apple TV instead.", "verified": true, "helpfulness": "1/7", "author": "Sam"}, {"rating": 5.0, "review": "Amazing and so easy to set up", "verified": true, "helpfulness": "0/0", "author": "Rodrar"}, {"rating": 5.0, "review": "amazon is a little pushy, but is pretty cool device", "verified": true, "helpfulness": "0/0", "author": "gail autry"}, {"rating": 2.0, "review": "Movies stopped playing after 17 minutes.  Cancelled Primetime", "verified": true, "helpfulness": "0/2", "author": "William"}, {"rating": 5.0, "review": "I absolutely love it! So very easy to use, and with subscription to Netflix it's truly never-ending possibilities or choices of entertainment.", "verified": true, "helpfulness": "0/0", "author": "Marlehn Denman"}, {"rating": 3.0, "review": "Technical quality is very good, but it's hard to find free movies.It was easier using my laptop to control streaming.Falls short of my expectations, but maybe programming will improve.Or maybe it will boil down to PPV.", "verified": true, "helpfulness": "0/0", "author": "John P. Steve"}, {"rating": 5.0, "review": "I have been waiting to purchase the Fire TV and read several favorable reviews.  I am so glad I decided to purchase when I did and the $20 reduction in the price was an added incentive.  I love it.  It makes it so much easier to view shows on Netflix, Amazon, etc., without having to use the WII and it's awful controller.  I love the ease of using the remote; and the quality of the picture is great. This was my Christmas gift to myself and I am happy!!", "verified": true, "helpfulness": "0/0", "author": "J.D. Melvin"}, {"rating": 1.0, "review": "I have a Roku TV and another TV using Roku 2 and I am happy with them.  I bought Fire TV as a gift and very frustrated that I wasted money, should have bought another Roku..  Thanks to many responses about how to locate the PBS, History, etc channels, But ... still unable to find something that does not cost each time I want to just to see a TV show.  I was bombarded with $$ for one episode and $$$$ for whole season even for shows that are free on PBS.  I  stumbled upon free shows and they all have \"episode not available\" What a ripoff device designed to have you buy more. It only took me a few times to figure out how to add, delete, search or sort channels on Ruko. Fire is very user-Unfriendly, it's designed to channel user to \"BUY\". I will make another attempt to look for channels that would have no buy $$ popped up each time I select it.  I plan to put  Fire on the driveway and run over it with my car. I am sick of BUY, BUY, BUY....", "verified": false, "helpfulness": "2/5", "author": "Maureen O. Bryant"}, {"rating": 4.0, "review": "It's pretty good and works very well. Satisfied.", "verified": true, "helpfulness": "0/0", "author": "minekid"}, {"rating": 4.0, "review": "So far I am enjoying what I'm viewing.Watching tv on my terms is great! It's still very new and I have a lot of kinks I need to work on. Cause, going from the way I've been viewing it's a job figuring out the ins and outs.", "verified": true, "helpfulness": "0/0", "author": "Mary"}]