[{"rating": 5.0, "review": "Love being able to watch movies and programs on my large flat screen TV instead of on the Kindle Fire HD small screen. The voice command is especially nice, as it usually helps find what I'm searching for; sometimes, though, it cannot recognize a word and looks for something else. It's a learning experience for us both.", "verified": true, "helpfulness": "0/0", "author": "S. Phillips \"sahp\""}, {"rating": 5.0, "review": "Excellent.  This product was easy to install and works beautifully.", "verified": true, "helpfulness": "0/0", "author": "Carol A. Marks"}, {"rating": 5.0, "review": "Competitively priced. Easy to set up. Love the huge selection of movies, TV shows, games, music, and videos. I highly recommend this product to everyone.", "verified": true, "helpfulness": "0/0", "author": "Duane Eganhouse"}, {"rating": 5.0, "review": "I enjoy all the options you have to watch thousands of TV shows and movies.  In looking to end my cable completely soon and this was my reason.  My only wish is that the CBS shows were added to someones app. This is one reason I've yet to cancel my cable. Not an Amazon issue though.", "verified": true, "helpfulness": "0/0", "author": "demogal22"}, {"rating": 5.0, "review": "couldnot set either one up on my tv will return soon.", "verified": true, "helpfulness": "0/0", "author": "holden"}, {"rating": 4.0, "review": "Great device to catch up on your TV watching and light gaming. Has a lot of potential and can only get better. Only true issue is the way the interface is setup and no way to customize it. Would like to have the sleep button easier accessible because there is no way to turn it off and the sleep button is buried in the settings.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Few devices we buy work far beyond expectations. This does. In every way, this works flawlessly. The search feature makes finding simple and easy; browse movie listings and save titles for viewing later. Pause today and resume tomorrow; it's all there. Wow. I should have bought this long ago.", "verified": true, "helpfulness": "0/0", "author": "D. Swisher"}, {"rating": 4.0, "review": "Works great I love it", "verified": true, "helpfulness": "0/0", "author": "Deandre"}, {"rating": 5.0, "review": "Amazon Fire TV is a great device. Coming from mostly apple products (Apple TV) the Amazon Fire TV in my honest opinion has way more to offer in regards to content. Once you tweak it a bit you will have an awesome media player!", "verified": true, "helpfulness": "0/0", "author": "William L."}, {"rating": 4.0, "review": "The Fire TV is decent as far as streaming devices go, though it doesn't seem as sturdy as the Roku not as consistent as the Apple TV. It is better than the Fire TV Stick, and I personally prefer it over the Google Chromecast, though I tend to have bad luck with anything Android.Now just to be clear - as I get this question a lot - this is not a cable box. There is no monthly fee, just the one time purchase fee. It does not have channels, it has applications. All of the apps that are compatible with this device come preinstalled onto it - as new apps are developed, they are rolled out in updates.Updates should come through automatically but if it's doing anything funky, and when you first set it up, it's always a good idea to manually check for software updates. (Settings> System > Check for updates, if it finds any it'll automatically download and install them).By using the Fire TV, you can utilize the appropriate apps to stream music or video to your television. The beauty of the amazon devices is that you can also view your photos that are stored in your Amazon Cloud right on the TV. (Just as you can access your iCloud on the Apple TV).What's the difference between the Fire TV and the Fire TV Stick you ask?-The Fire TV can work with either Wifi or Ethernet, where the Fire Stick is Wifi only.-The stick has a very poor antenna, ideally needs to be within 10 feet of your modem or router and things like microwaves can still interfere with the signal.-Fire TV has more internal memory and storage, therefore tends to run more smoothly.In order to use the Fire TV or Fire TV Stick, you do need to register it to an Amazon account. You will not be able to access Amazon Music or Amazon Instant Video unless you have a Prime membership ($99 annually) and even then, you only have access to the PRIME videos for free - the Amazon Instant Videos do cost. This seems to be a common topic of confusion.Apps compatible with the Fire TV:NetflixAmazon Instant VideoHulu PlusCrackleAmazon MusicI Heart RadioHBO GoESPNPandoraSpotifyQello ConcertsVimeoYou TubeA&E;PBS KidsTwitchBloomberg TVHuffpostSling TVNBAHistoryShowtime AnytimePlexYup TVIt also includes games and you can purchase a game controller **OR** pair an XBox controller with it.Dont forget you can download the Fire TV Remote App onto iPhone, Android or Compatible Kindle devices as well.Games included are all listed above on the product page. Remote included with the Fire TV has the voice control option as well. Be sure to use a High Speed HDMI cable to connect your Fire TV to your HDMI/ HDCP compatible television for maximum performance. You can buy an Amazon Basics one on here for about $5-$6.As for which streaming device to purchase, I'd say go by the one that has the most apps that are relevant to you. Personally, my Apple TV is my favorite streaming device.Also check the other devices in your home - these days many Smart TV's and Smart BluRay players come internet ready and equipped with many of the apps I've listed above, eliminating the need for a streaming device.", "verified": false, "helpfulness": "3/3", "author": "Pelican Freak"}]