[{"rating": 5.0, "review": "Love it works on all my electronics streams great", "verified": true, "helpfulness": "0/0", "author": "Diane"}, {"rating": 5.0, "review": "Works awesome! Should a got one sooner", "verified": true, "helpfulness": "0/0", "author": "Dan Miller"}, {"rating": 5.0, "review": "Yeaph it's ok", "verified": true, "helpfulness": "0/0", "author": "johnny"}, {"rating": 5.0, "review": "I so love this Chromecast.  Works very well with my I-phone and pad like a charm.  I have recommended it to a few friend already.", "verified": true, "helpfulness": "0/0", "author": "James Hunsicker"}, {"rating": 1.0, "review": "Work poorly, especially with an Iphone6", "verified": true, "helpfulness": "0/0", "author": "Amanda Pilkington"}, {"rating": 5.0, "review": "I just love it. It is very easy to use and works every time", "verified": true, "helpfulness": "0/0", "author": "AE"}, {"rating": 5.0, "review": "Can't say enough great things about the chromecast.  We have one for all of our TVs.  you can't beat the convenience it offers.  we probably get 90% of our media from either Netflix, or by streaming local files via Plex, and the chromecast gives me what I want, on the TV I want, all with a push of a button on my phone.  You can also cast from your computer, which comes in handy, but it's so great being able to control everything from your phone.  It will even turn the TV on when you connect to it, which is a great feature.  It's a great little gadget, and the fact that it's so cheap makes it even better.", "verified": true, "helpfulness": "0/0", "author": "Luke"}, {"rating": 5.0, "review": "Works beautifully for receiving programs and videos from my phone or laptop.", "verified": true, "helpfulness": "0/0", "author": "Carl L. Young III"}, {"rating": 5.0, "review": "Exactly what I as looking for.", "verified": true, "helpfulness": "0/0", "author": "Evan Stein"}, {"rating": 5.0, "review": "Works great wife and kids love it. Another daddy cookie. Something else to verify smart phones purchases.", "verified": true, "helpfulness": "0/0", "author": "buster brown"}]