[{"rating": 5.0, "review": "Setup was easy. Works great. Highly recommend!", "verified": true, "helpfulness": "0/0", "author": "Gertrude"}, {"rating": 5.0, "review": "I can have Pandora in my Living room now ;-) and giggles!", "verified": false, "helpfulness": "0/0", "author": "Donna J Nelson"}, {"rating": 4.0, "review": "After the installation itself, the product is easy to use and worth the money. I use it mainly Netflix, YouTube, and Pandora; all I can say is that it works. The only initial trouble for me was that I have a Mac and had to install Google Chrome prior to setting anything up, as well as download the (free) Netflix and YouTube apps for my iPhone. Also, I wish it had an easy rewind/forward/pause setting for videos; you can do it by sliding the bar but can never be sure where exactly you're stopping, and sometimes when you go back to watching after pausing it it freezes and you have to start from scratch.", "verified": true, "helpfulness": "1/1", "author": "I."}, {"rating": 1.0, "review": "Don't buy doesn't work, could not get netflix on it...", "verified": true, "helpfulness": "0/0", "author": "pastallie"}, {"rating": 2.0, "review": "It's great when it works.  Sometimes it drops connection with device after a period of time. Sometimes it doesn't find the device on start up.Yes I have the latest update.Yes, I have the devices on the same Network.Using Samsung HDTV 2008, iPhone 5", "verified": true, "helpfulness": "1/1", "author": "David"}, {"rating": 4.0, "review": "good good good!!!!", "verified": true, "helpfulness": "0/1", "author": "marcelo"}, {"rating": 5.0, "review": "I use this all the time - one of the best and affordable investments I ever made ;-) seriously - way more savvy and neat than buying a ton of messy cords.", "verified": true, "helpfulness": "0/0", "author": "Vintanya Crawford"}, {"rating": 5.0, "review": "Perfect if you have and LG NEXUS, i have a nexus 5 and work very well, the mirroring is awesome, i love it google", "verified": true, "helpfulness": "0/0", "author": "Josh T."}, {"rating": 4.0, "review": "Google Chromecast is a very good option for someone who doesn't have a Smart TV and is not willing to pay a lot for an Apple Tv, Roku, or any other similar devices. I like it more than I thought I would.It does limit you a lot on what you can do with it. Everything needs to be displayed via Google Chrome, or an app that shows the Chromecast button, but there are some ways to \"cheat\" and have other things displayed on the TV, like a movie or picture that is stored in your computer.PROSIt is very easy to install it on your home network and tv.You can leave it on, so when you want to display something on the tv you can just change it to the HDMI channel.Works perfectly with Netflix, the video and audio quality are very good.CONSSometimes it takes a while to load and buffer the video, and there is always a delay.The network gets stuck and you need to restart the Chromecast for everything to work again.You can only use Google Chrome to display very few kinds of video, and the pairing with the TV still needs a lot o improvement.", "verified": true, "helpfulness": "0/0", "author": "Jullianna"}, {"rating": 5.0, "review": "Best Impulse buy of all time of the 21st Century. $30 .. Really?!", "verified": true, "helpfulness": "0/0", "author": "Carmine"}]