[{"rating": 3.0, "review": "Pros: smooth interface, voice search, easy setup.Cons: no HBO, no trial of prime, no shutdown or power off, says can play games but no controller.Overall: I still prefer the Apple TV for the same price out of the box. I can only hope that with updates or future generations the unit will come with some extras.", "verified": true, "helpfulness": "1/5", "author": "DankDoobie"}, {"rating": 4.0, "review": "The Good:The FTV works great!! It handles everything I have thrown at it and it seems to be a great all in one box.  It works as a client HTPC and is the best \"thin-client\" I have found for XBMC.The Bad:Amazon is taking a very strange stance on this box.  They claim that they want this open for developers, but it seems that the only thing that is being allowed into the app store are games.  My main complaint is that side loaded apps cannot be added to the home screen.  This limits the box from having a very user friendly feel.An additional gripe and the reason I cancelled the prime membership is that there is no way to filter just by prime.  This really killed the WAF (Wife Acceptance Factor) as she had a hard time finding prime content (I didn't think it was very intuitive either).Conclusion:Overall I would recommend the device it really works well and I love the android platform for an home theater device.I would say that until prime content is searchable on its own or at least filterable on its own, the ease of use of having and using a prime subscription is just not attractive enough to justify it.  It is just too kludgey.The final comment is that Amazon really needs to truly open this box up.  Allow root and allow users to make changes to their box.Maybe a simple root disclaimer that voids support/warranty could be settup, but until some of this is done and apps can be added to the home screen and usb can be used for storage, the box, while it still gets my recommendation, has some improvement that can be done.", "verified": true, "helpfulness": "0/1", "author": "jjhtpc"}, {"rating": 3.0, "review": "I didn't realize that every show I watched would cost a fee.  I also didn't know that I would not be able to watch anything on my cable channels without disconnecting the Amazon Fire TV.  I liked the voice feature and the hand control was very simple, but I can't afford to pay for every show I watch. The promotion for the Amazon Fire TV should mention that it could cost you quite a bit if you watch a lot of tv, like I  do.", "verified": true, "helpfulness": "2/4", "author": "Deb"}, {"rating": 3.0, "review": "Not surprisingly Amazon has optimized the user experience and speed for their own video offerings, so if your primary source for this type of entertainment is Amazon Prime, this is what you want.  But be aware there are some things missing - Amazon Cloud Player for example, but Roku does have this.  And some things seem arbitrarily speed limited - Netflix never seems to be able to stream HD over this device, but is almost always HD on our 3 Roku boxes.  So, unless you are always and forever an Amazon Prime only member, I recommend Roku over Amazon Fire TV.", "verified": true, "helpfulness": "1/2", "author": "W. Mobley"}, {"rating": 4.0, "review": "I'm actively looking to \"ditch the dish\" and not have cable as we transition to internet TV. I had already purchased Chromecast and now I bought the Amazon Fire TV. Now, I can watch all the Prime streaming shows on my TV.If the show is in HD it is outstanding but not all Prime shows are HD. I have a few more months on my Dish contract and when I get close to the end I'll be subscribing to internet TV providers and we'll see how Amazon Fire TV works with them.I had one issue after setting up my Dish remote to control my Bose Solo, I no longer had sound on Amazon TV. I went to the \"help\" screen on AFTV and there was an option to have Amazon call me. I clicked on it and immediately my phone rang with a customer service rep who helped me get the sound back on. That was impressive.So far, I'm impressed and I would recommend.", "verified": true, "helpfulness": "0/0", "author": "Stealthvette"}, {"rating": 3.0, "review": "This is a great streaming box. Very easy to use, quick and responsive, and a great picture quality. The only problems I've had with the Fire TV is the limited number of apps and streaming services available (which is expected with a new platform) and the playback of Netflix. For some reason, Netflix shows and movies stutter and freeze periodically. Playback through Hulu Plus, Flixster, and Amazon Instant are flawless. The playback for Netflix is so bad, that I inevitably have to switch to my PS3 to watch movies in my Netflix queue. Hopefully Amazon will fix the bugs with Netflix playback soon. Then I would upgrade my rating to 4 stars.", "verified": true, "helpfulness": "3/3", "author": "Robin F. Griffith, Jr."}, {"rating": 5.0, "review": "I only use Amazon Prime and Hulu Plus, but it works well. There is still no system that reliably provides any and all the current TV shows soon after the initial showing. The Voice Command works well some of the time. It depends on the clarity and simplicity of the name being requested, and how clearly and correctly you say it. For instance; It took 8 or nine attempts for it to finally recognize Denzel Washington. The 'z' in Denzel had to be clearly ennunciated.I think that designing a good navigation system must be difficult. The Amazon Fire TV navigation is ok, but not as easy and efficient as I would like.I would like to see the Hallmark Channels included in the available networks.", "verified": true, "helpfulness": "0/0", "author": "C. Hall \"Lazy Shopper\""}, {"rating": 4.0, "review": "Easy to install and use. Fast downloads. I don't miss my cable and love the overall savings and convenience of watching anything, anytime. The voice search feature makes this device real simple to find and view anything", "verified": true, "helpfulness": "0/0", "author": "Liz"}, {"rating": 5.0, "review": "this thing is great. it has internet radio , games , many different apps to use for all different kinds of stuff.and the prime movie section works very nice with the voice command.", "verified": true, "helpfulness": "0/0", "author": "weezildog"}, {"rating": 5.0, "review": "I am planning on giving up my AT&T; Uverse subscription-getting quite costly and bought this to see what I could watch before I gave up AT&T.; I have absolutely NO RESERVATIONS on giving up my AT&T; now. Plenty to see and do and I am looking forward to all the HBO shows I never saw-Sopranos especially! Easy to use too.", "verified": true, "helpfulness": "0/0", "author": "ReneBT"}]