[{"rating": 5.0, "review": "what can I say. It is as it was listed, it will do all that , well", "verified": true, "helpfulness": "0/0", "author": "indexer"}, {"rating": 5.0, "review": "This is an amazing device!", "verified": true, "helpfulness": "0/0", "author": "Terrence A. Jackson"}, {"rating": 5.0, "review": "Excellent product. Easy to navigate and the setup is a snap.", "verified": true, "helpfulness": "0/0", "author": "Peter M. Leavitt \"JudgeGuy\""}, {"rating": 5.0, "review": "I bought this to replace my laggy Roku 2.  I could not stand the freezing anymore. This is absolutely perfect. It doesn't heat up like the Roku, and it has a \"sleep\" feature in the settings (NOT a sleep timer).  It doesn't lag or freeze, everything is pretty quick.", "verified": true, "helpfulness": "0/0", "author": "cgia"}, {"rating": 5.0, "review": "Thank you.", "verified": true, "helpfulness": "0/0", "author": "thomas hoover"}, {"rating": 2.0, "review": "I had the Fire Stick, but it wouldn't \"take over\" my TV and Sound Projector like my Bluray player does.  Got it working but sound came through the TV, not the projector.  Amazon said get the box instead and an optical cable.  So I sent the Stick back, bought the box and an optical cable and no, that didn't work either.  I finally ended up getting a HDMI switcher box and use that to run the Fire Box.  But there's a catch there too.  The signal coming out of the Fire Box is not sufficient to get the HDMI switcher box to recognize it.  My Bluray DVD player has enough signal, even an old laptop I installed on the switch sends enough signal.  So if I want to use the Fire Box, I have to leave the Bluray or Computer on.  If I turn either one off when using the Fire Box, the Fire Box signal is turned off as well.  As I said on my review of the Fire Stick, this is a small PROGRAMMING ISSUE, Amazon, and you could fix this.  Everybody else is going with some industry standard, but not you...  I only went with this since I'm a Prime member and I can't say that this is very good.  If you're looking for a TV movie or program, you have to figure out how to stay in Prime movies for no additional charge, and the kids can buy movies accidentally if they don't understand the purchase options.  Definitely adult supervision required.  I guess I got spoiled by Netflix, which works. 2 stars.", "verified": true, "helpfulness": "0/2", "author": "Gregg"}, {"rating": 5.0, "review": "5 stars , best investment I made yet", "verified": true, "helpfulness": "0/0", "author": "Leon B."}, {"rating": 5.0, "review": "Love it I bought 3 one as a gift so far going to get rid of my cable bill and just use my fire.", "verified": true, "helpfulness": "0/0", "author": "Debra Searcy"}, {"rating": 5.0, "review": "Well I go way over my internet providers bandwidth limits. I have had to upgrade my service.... pout", "verified": true, "helpfulness": "0/1", "author": "Madmax478"}, {"rating": 5.0, "review": "Great item", "verified": true, "helpfulness": "0/1", "author": "Ran"}]