[{"rating": 4.0, "review": "Works Great! Needs more apps that are compatible.", "verified": true, "helpfulness": "0/0", "author": "KimKBestFriend11"}, {"rating": 1.0, "review": "Total POS! Sure stream something. Don't think about pause, review, rewind.Device totally fails to the degree you must de-power device and start your content from the beginning without the capability to fast forward to previous location. Chromecast is complete crap. Don't waste even 35$. Doesn't do anything useful.Complete garbage", "verified": true, "helpfulness": "0/0", "author": "Mr. Continental \"You are correct...I AM very handsome.\""}, {"rating": 5.0, "review": "Hubby loves this, as he can binge watch \"This Old House\" and videos of 70's and 80's music off YouTube.", "verified": true, "helpfulness": "0/0", "author": "CookieQueen"}, {"rating": 5.0, "review": "I have been using all day the chromecast for about 3 weeks and sometimes I have to turn off and turn on the TV but is all what google say, really awsome, i hope people create more app for this.", "verified": true, "helpfulness": "0/0", "author": "Juan Jose Ajcuc Baires"}, {"rating": 3.0, "review": "If you can get it to work with Chrome and other programs, apps, it works fine, but Chrome extension for it is very iffy. I got it to work with Windows 7, 8, and 10 notebooks, but only one tablet of 3 and it would not work with my Samsung phone. The blogs are full of complaints about this missing icon on android Chrome for many people.", "verified": true, "helpfulness": "0/0", "author": "Big-Z"}, {"rating": 4.0, "review": "sometimes it acts funny and wont connect... idk why", "verified": true, "helpfulness": "0/0", "author": "bonana"}, {"rating": 5.0, "review": "Best media player. Instantly turn any TV with an HDMI port into a smart TV. Netflix, Hulu, Plex, YouTube, etc all work perfectly fine and only $30!", "verified": true, "helpfulness": "0/0", "author": "madnav"}, {"rating": 5.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "Thomas M. Howard, Sr. \"Bob's Bistro\""}, {"rating": 3.0, "review": "It hard to use without a remote and all the apps you have to down load on your phone do you can see a show.  To confusing.", "verified": true, "helpfulness": "0/0", "author": "Rosina Channell"}, {"rating": 4.0, "review": "recommend", "verified": true, "helpfulness": "0/0", "author": "Eduardo Salazar"}]