[{"rating": 5.0, "review": "I was attempting to watch Netflix through my Sony Blu Ray DVD player and it was horrible!  It kept stalling to the point that it just wasn't worth watching. My niece told me about the Cromecast and it's fabulous! It hasn't stalled once. So glad I found this alternative!", "verified": true, "helpfulness": "0/0", "author": "Denise"}, {"rating": 5.0, "review": "I love Chromecast. I use it every day. It's the coolest thing ever. I'm really looking forward to what developers will come up with for it. As it is, it's still one of the handiest purchases I've made in a while", "verified": true, "helpfulness": "0/0", "author": "Christine Barrows"}, {"rating": 5.0, "review": "My wife and I love this thing.  We have it hooked up to our receiver, rather than directly to the TV, so I can't vouch for how well the auto-switching works.  However, we use this thing a ton.  We mostly use it for Netflix, but we also have All Access subscriptions to Play Music and it's great.  We ended up buying a couple as Christmas gifts!", "verified": true, "helpfulness": "1/1", "author": "Brian"}, {"rating": 5.0, "review": "Easy to use. Plugged in and synced with my laptop immediately. Just wish it would work for amazon prime movies!", "verified": true, "helpfulness": "1/1", "author": "Laura Belle"}, {"rating": 5.0, "review": "WI FI CONNECTION MUST BE SUPERIOR OTHERWISE THERE IS LAG. GREAT PRODUCT. USA NEEDS TO UPDATE THEIR INTERNET INFRASTRUCTURE REALLY BAD.", "verified": true, "helpfulness": "0/0", "author": "Joseph Dinsmore"}, {"rating": 5.0, "review": "I use it in the bedroom to watch instructional YouTube videos on how to do stuff. Instructional videos are ofter lengthy and watching them in bed is more comfortable than sitting in front of a compute. I watch how to perform Photoshop and Lightroom edits all the time.", "verified": true, "helpfulness": "0/0", "author": "R. M. Watt"}, {"rating": 5.0, "review": "the best option to convert your normal tv into a smart tv.you can stream videos from your PC to your TV WITHOUT ANY problem using many app already developed.really worth it and it works fine.netflix works very well", "verified": true, "helpfulness": "0/0", "author": "Raimundo Salas"}, {"rating": 5.0, "review": "After connecting this to my TV, I really got rid of the messy cables lying between my laptop and TV. The streaming looks good through Chromecast. The only problem I see was the picture was shaking in my TV whereas it was good on the PC. Not sure whether it is problem on my TV or with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "bayman"}, {"rating": 5.0, "review": "a lot of fun great, google does it again just plug, find it, and wholla, its right there !!!! hours of fun", "verified": true, "helpfulness": "0/0", "author": "Pilgrim"}, {"rating": 5.0, "review": "this is great for parties settign up you tube playlistsinstant smart tv with hbo go and you tube i just wish more apps for apple were supported by google chrome.", "verified": true, "helpfulness": "1/1", "author": "Beachbaby"}]