[{"rating": 4.0, "review": "Cool,  Broadcast your internet to your tv.  Set it up on my laptop. Really like broadcasting youtube. Cons:  doesn't work perfect all the time. Have to mess with it to get it to work sometimes. Interferes with my TV reception. I use an outside antenna . I just unplug Chrome cast when I am not using. All in All really cool.  Worth the Money!!! Google still classifies as Beta. I am sure they will get the bugs out. It is the future!!!  Enjoy!!!", "verified": true, "helpfulness": "1/1", "author": "Sam Thompson"}, {"rating": 5.0, "review": "I have read a lot of reviews at other sites by users complaining about various things. I have only found a few video sources I cannot stream from my Mac laptop. Amazon Instant Video and PBS SO CAL are the only sources I could not get to work using the Chrome browser from my Mac. The image quality is not as good as a Roku but having the ability to throw almost any free or paid video source on my TV makes it well worth the $35. I can't play HBOGO on my Roku because Directv does not allow it.  But I can do it via the Chromecast. There is an amazing amount of free content you can stream to this thing. I also can stream local movie, music and photo files from my Mac using a 3rd party media server app via the Chrome bowser. I keep wondering if Google is going to cripple it sometime in the future. For now it works great.", "verified": true, "helpfulness": "0/0", "author": "Citizen Kaine"}, {"rating": 5.0, "review": "Forget apple tv this is it.Hard to beat the ability to broadcast and free 3 mouths of Netflix. and all for just the $35.00", "verified": true, "helpfulness": "0/1", "author": "lite guy"}, {"rating": 1.0, "review": "Iam very upset that amazon prime can not be used with this device. I mainly bought this item for the solely purpose of watching movies on amazon prime and renewing my membership evey year.but that might not be the case now.", "verified": true, "helpfulness": "1/6", "author": "robert adeleke"}, {"rating": 1.0, "review": "Advertising says you can view your phone on your tv. Not quite. What they forget to mention is that the Internet you access on your phone via 3G or 4G cannot be cast to your tv. The only way chromecast works is when your phone is connected to a wireless signal that is connected to the Internet. Current advertising leads you to believe your phone communicates (casts) its Internet access to your tv, not true. There is no option for 3G (or higher) Internet access to be cast. Would have been a huge change if it could cast 3G or better service instead it's just another google hyped disappointment.", "verified": true, "helpfulness": "2/9", "author": "M. Lovern"}, {"rating": 5.0, "review": "I bought the google chrome assuming that it would not work in my country Colombia. Well, it works perfectly... i can see netflix movies, and use the youtube app... i have not been able to download the app from the app store, because it only sells in the USA, but i have not needed it.Totally recommend it!!!", "verified": true, "helpfulness": "1/1", "author": "Elispapafrita \":)\""}, {"rating": 5.0, "review": "This is awesome. I love being able to stream music as well my movies from all my devices. Very portable.", "verified": true, "helpfulness": "0/0", "author": "VC"}, {"rating": 5.0, "review": "Works flawlessly, cross platform support, and so simple.  Sets the tv and computer free of the chord, doesnt draw power from the controlling device.  Sweet.", "verified": true, "helpfulness": "0/1", "author": "Thomas B. Crowley"}, {"rating": 1.0, "review": "I feel like a lawsuit is in order for false advertising since the box clearly states \"Send video or anything on the web to your TV from your smartphone, tablet or laptop\".  Googles latest forced update breaks all that... Which is the ONLY reason I bought it.  Google white listed a very small set of apps to work with it.  It's trash to me now.  Boo Google. Epic fail. I want my money back.[...]", "verified": false, "helpfulness": "3/6", "author": "John Harper"}, {"rating": 1.0, "review": "It seems like a neat little device but I can't get it to work properly.The youtube app works but I can't get it to play Netflix from my tablet or my computer.  That is a problem considering that is the soul reason I bought it.I called Chromecast support and they said there was a known problem with the device and my router (which I'm not sure if I believed).", "verified": true, "helpfulness": "0/1", "author": "Photog"}]