[{"rating": 2.0, "review": "Not impressed - MY Roku interface is better. It is hard to (for me) to navigate. I would like to see more of the apps at one time. I do not notice an improvement in speed or picture. Being able to listen using my bluetooth headphones is a great option but they do not work with PLEX. I would think Amazon would address that with them.", "verified": true, "helpfulness": "0/0", "author": "Richard Forbes"}, {"rating": 2.0, "review": "Your best bet is to get something else like a chrome cast or apple tv and stream it from your phone. Amazon fire has the worst connectivity and always loses connection and the sad part is is that there is no other device using the Internet . It's impossible to watch anything on this hardware. I don't recommend it at all.", "verified": true, "helpfulness": "0/1", "author": "Jason Shotwell"}, {"rating": 4.0, "review": "Only bought HDMI stick and remote...love it.  Works way better than Chromecast. I admit for me its not very user friendly to use advance features, but then you don't get any instructions w it, it's all on screen. But as far as buying, even if free, n watching shows/movies very easy, as long as you have your Amazon acct set up (which you need to do to order from them anyways, so you will.) I have a small town internet service w dish satellite n Verizon cell phones...we can never get good signals on our phones, sometimes when boys play Xbox games they get some \"lagging\", but  we bought the new Mad Max and NOT ONE ISSUE for anytime we watch it n it's streaming. No problems w anything downloads as fast as a snap! I love how the stick comes w an extended hdmi adapter, makes easier to reach. And so far the pictures are not real dark like you find on some movies.....", "verified": false, "helpfulness": "0/0", "author": "Sweet Stacy \"Stacy Horton- Weiss\""}, {"rating": 5.0, "review": "Very slim, stylish and useful I mean worth it. Amazon Prime is awesome addition and to be honest for more juice I end up installing KODI/XBMC killer platform...", "verified": true, "helpfulness": "0/0", "author": "Faisal Ali"}, {"rating": 4.0, "review": "It's been 4 months and so far very happy I really like and so many things to choose from, probably my only complain would bee a little disorganized in the selection for movies .", "verified": true, "helpfulness": "0/0", "author": "Janeska Hernandez"}, {"rating": 5.0, "review": "If you don't think having a voice search available is a big deal, just give this a try.  After using the Amazon Fire TV for a few weeks I'm convinced I could never live without it.  It makes it so easy to find shows.  My toddler is constantly wanting to watch Thomas the Train.  I just press the voice search, say the magic words and voile! Amazon Fire finds it for me! Easy peasy!  If you have a kid and you're wondering if this is worth it, buy it. You'll thank me later.", "verified": true, "helpfulness": "0/0", "author": "Colleen Lawrence \"Peanutfish\""}, {"rating": 4.0, "review": "It's a good player for my master bedroom equipped with 1080p TV because current Amazon TV is unable to play 4k contents ( from Netflix ) on my Living room Samsung SUHD. ( -1 star for that ).I would like to see newer refreshed version with below spec:-HDMI 2.0 ( 4K playback at 30 or 60 FPS )-Wireless :802.11ac-Ethernet : Gigabit EthernetAccording to apple website, new Apple TV  doesn't comes with above mentioned components , so  take advantage of hardware superiority for next Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Laura"}, {"rating": 5.0, "review": "Very satisfied!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "It seems to work well. Have issues with SlingTV, though.", "verified": true, "helpfulness": "0/0", "author": "Louise O. Leck \"twain_harte\""}, {"rating": 5.0, "review": "Excellent choice, since do not have cable nor satellite. GREAT bargain.", "verified": true, "helpfulness": "0/0", "author": "N.D. \"runnergirl\""}]