[{"rating": 2.0, "review": "This device crashes worse than Bruce Jenner on the highway.  But I'm not letting Amazon get away with it.I have to restart the Amazon Fire TV every time I use it.  It doesn't connect well to my wifi, which is strange because it's less than 2 feet away.  None of my other devices have connective issues.  My Apple TV sits right next to it (actually further from the router) and it runs smooth as hell.The only reason I'm keeping the Fire is because I got a Sling TV deal with it.  I'm actively looking for other devices that can stream my subscription so I can get rid of this thing.  Think this will streamline the amazon videos that you have already purchased?  It won't.  It stutters as it plays.  I actually prefer using the PS3 or PS4 for playback when I'm watching my amazon purchases.  I'm just not satisfied at all with the device.I returned my Fire tablet (7\" I think) because it was stuttering on playback even when I was just playing videos purchased from the device on the Fire TV.  I want to invest more in the Amazon architecture, but I'm not getting the quality I need to do so.  Please please please improve the device performance!", "verified": true, "helpfulness": "0/1", "author": "William Ford"}, {"rating": 4.0, "review": "It's a good. Wish it had full Google Play. Wished it was a little easier to find content other than Amazon. Wished it had a web browser.", "verified": true, "helpfulness": "0/1", "author": "Dan"}, {"rating": 4.0, "review": "It works ok. Was very easy to set up. Haven't been able to make the voice control work.  Was dissapointed that Vudu Is not available.", "verified": true, "helpfulness": "0/0", "author": "Sharon Hurtig"}, {"rating": 5.0, "review": "Fire TV met my expectations.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great product, easy setup and use.", "verified": true, "helpfulness": "0/0", "author": "David Sugihara"}, {"rating": 5.0, "review": "Amazon Fire works great and shows a perfect picture.", "verified": true, "helpfulness": "0/0", "author": "Terrell Rogers"}, {"rating": 5.0, "review": "I got the Amazon Fire TV after having great experiences with a couple of the Amazon Fire Sticks.  I used it to replaced my WDTV Live box and am so glad that I did.  The interface, options for apps, and speed all blow my old device out of the water. Being a Prime customer also grants me easy access to the unlimited videos that membership provides.Another great feature is that the remote controls for the Fire TV and Fire Sticks are bluetooth allowing for non line of sight controlling.As far as my most used apps I have Netflix and Plex running on them and they both connect smoothly and have a very nice, easy to navigate and understand interface.Whether you're streaming content from Amazon, other online services or within you own network, I strongly recommend the Amazon Fire TV for your needs!", "verified": true, "helpfulness": "0/0", "author": "AJ Hofmann"}, {"rating": 4.0, "review": "Yes I'm actually impressed. I like the interface and the functionality of it.", "verified": true, "helpfulness": "1/1", "author": "khalif jibri"}, {"rating": 4.0, "review": "Very happy with the variety of services available and the overall quality/ performance of this thing. Lots of good tv programming and solid video feed to the TV", "verified": true, "helpfulness": "0/0", "author": "Old Scooter Guy"}, {"rating": 5.0, "review": "Love it!  Works great. i also like that if you lose the remote you can download an app on your phone", "verified": true, "helpfulness": "0/0", "author": "Alexandria Phillips"}]