[{"rating": 5.0, "review": "Fire TV is a great addition to our viewing choices. Very good product. Thanks Amazon!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "The box works great and was very easy to set up.  Unfortunately most of the Prime free content is not of much interest to me.", "verified": true, "helpfulness": "0/0", "author": "Doug Deaver"}, {"rating": 4.0, "review": "Got it over Christmas for $79 which was $20 off than the regular $99 it sells for but, like the speed, quality of the menus and the overall layout. Very user-friendly interface and remote control with voice controls is great. Great job Jeff! Now only if you could have done the same with the Fire phone ;)", "verified": true, "helpfulness": "0/0", "author": "Abid Syed \"AbidSyedK\""}, {"rating": 5.0, "review": "Fire TV is great, and we enjoy the beautiful pictures on the stand-by mode.  The voice recognition works great too.  Although we had some tough bugs to work out with the updated Netflix version, Amazon in South Africa did a wonderful and patient job of troubleshooting the problems.  It ended up in an exchange, and the replacement works great!  It's a little difficult to navigate away from Amazon Prime, and the included prime selections pale in comparison to Netflix.  Then again, Amazon Prime is not Netflix, and the Prime offerings load faster than Netflix most of the time.Fire TV certainly outshines the Roku it replaced!", "verified": true, "helpfulness": "0/0", "author": "Azoomer"}, {"rating": 5.0, "review": "My son loves it. Uses it in his room to access all he wants to watch", "verified": true, "helpfulness": "0/0", "author": "Jaelithe"}, {"rating": 5.0, "review": "Works great. I just wish more of the movies were included in the \"Prime\" category. I believe Netflix has a better selection without paying more.However, the Fire TV is very fast and easy to use.", "verified": true, "helpfulness": "0/0", "author": "RotorDaddy \"Rotordaddy\""}, {"rating": 5.0, "review": "Very easy to use!  I think I need more speakers for the bedroom TV", "verified": true, "helpfulness": "0/0", "author": "Cori D"}, {"rating": 5.0, "review": "Watched a movie and also looked pictures on Amazon Cloud Drive.  Worked perfectly.  The voice search was pretty accurate.", "verified": true, "helpfulness": "0/0", "author": "KoffeeKid"}, {"rating": 5.0, "review": "Very nice! I wish there was a power switch,", "verified": true, "helpfulness": "0/0", "author": "T. Watts"}, {"rating": 5.0, "review": "Favorite gift of my husband and daughter.  Always can find something to watch.  Bought other one for my daughter to take with her to her college dorm.", "verified": true, "helpfulness": "0/0", "author": "Theresa Frechette"}]