[{"rating": 3.0, "review": "Not enough apps right now, so I hardly ever actually use. Also, since it draws its power from the TV, it gets insanely heated up even when it is not in use (but the TV is otherwise being used).", "verified": true, "helpfulness": "0/1", "author": "KT"}, {"rating": 5.0, "review": "Great, I didn't even tried to root it, because it really does what I need: stream fro youtube and cas my tabs! Well what about local content? I suspect that soon, particularly in December we will see a bunch of apps for it.", "verified": true, "helpfulness": "0/0", "author": "levon83 \"Levon S.\""}, {"rating": 5.0, "review": "Amazing, for 35 dollars everyone should own one of these, there's simply no reason not too. To just stream you tube to my TV alone is worth the cost.", "verified": true, "helpfulness": "0/0", "author": "Kenny Benoit"}, {"rating": 2.0, "review": "Very disappointing. I bought it because you are told it works with tablets. I loaded the app on my IPAD and realized it did not work with chrome like on a laptop. It works only with Itunes and .. I was not expecting these misleading claims from a company like Google. The should fix that ASAP, I don't see any reason why it should not work with chrome on IPAD. it is really very bad for their image.", "verified": true, "helpfulness": "0/1", "author": "JBLP"}, {"rating": 3.0, "review": "Meh. This might be nice one day, but with the limited apps, it seems kind of pointless. Netflix, youtube and Hulu are already available on my xbox and bluray player, and they buffer the video streams much better and they've got better interfaces. Plus I can never get audio to work when I'm streaming a tab from Chrome. Maybe in a few years, when they start letting developers actually release stuff for it, it will be better, for right now, at least it's pretty cheap.", "verified": true, "helpfulness": "0/0", "author": "Jlowman"}, {"rating": 3.0, "review": "I am still trying to work on it. I am getting a picture on my TV that is going out and in.", "verified": true, "helpfulness": "0/1", "author": "Anthony Woods"}, {"rating": 4.0, "review": "It did the work well for what it is designed for....love the big screen. Wish it can stream more stuff to the big screen thou.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "System is too locked down.  Cannot stream your own content -- ONLY stuff purchased in the Play store.  Extremely disappointed in this device.", "verified": true, "helpfulness": "0/0", "author": "N. Thompson"}, {"rating": 4.0, "review": "So far so good.  It appears to not want to run videos direct from my iPad.  I will have to continue to play with it to see if I can figure it out.  Will update as I get more familiar with product.", "verified": true, "helpfulness": "0/0", "author": "DPAZ"}, {"rating": 4.0, "review": "Im removing one star just because it still does not stream local content, but as per google news this little monster will do it.You can go wrong with this dongle just be sure to know what can do and what cannot do.Pros:-Small and it fits any HDMI port, it comes with an extender in case that you HDMI is in a complicated location.-Streams Youtube, Netflix, Google Music and Video without any problems.-Easy Setup.Cons:-Still does not have local media support for streaming.For $35 you convert any regular TV into an Smart one!", "verified": true, "helpfulness": "0/0", "author": "Carlos Saborio Badilla \"C. Ivan\""}]