[{"rating": 5.0, "review": "Works perfect. Costing only $35, its value is much better than  Apple TV (I have both), particularly because it functions nearly exactly the same as its peer Apple TV,and the setting up procedure is much more efficient than Apple TV, which costs $90-$100.Apple devices works with ChromeCast, but Apple TV has an optic audio output and can have a landline internet cable, also a remote control.", "verified": true, "helpfulness": "0/0", "author": "D. Xu \"-dxu\""}, {"rating": 1.0, "review": "Honestly, I was excited for this. I bought it on black friday to save a bill, I was thinking this was gonna be awesome and i almost bought a second one as a christmas gift in confidence. It has severe lag issues, even with a high quality router. There really is just no hope for this sad device.", "verified": true, "helpfulness": "0/1", "author": "connor lucas"}, {"rating": 5.0, "review": "I love this little thing! I had problems with it connecting the first time, but after I plugged it in the second time, the setup process was easy and painless. This works great if you have a smartphone or tablet and want to get YouTube, Netflix, Hulu +, or other services onto your TV.", "verified": false, "helpfulness": "0/0", "author": "Faithman"}, {"rating": 4.0, "review": "Although there are not enough apps to make the chromecast a must buy, this is one of the devices I have purchased with the hope of cutting the chord on cable.  Setup of the chromecast is simple and quick (Galaxy S3).", "verified": true, "helpfulness": "0/0", "author": "v_dogg12"}, {"rating": 5.0, "review": "Drop your cable and get one of these. Then don't turn back.  If you have fast internet, a strong gigabit or wireless N network, and a computer with >4GB RAM and >2GHz processor, you can pretty cast whatever you want through Chrome onto your TV. That includes Hulu, CBS, etc. free streaming from just the Chrome tab. Netflix, Pandora and such work seamlessly.", "verified": true, "helpfulness": "0/0", "author": "Mark"}, {"rating": 3.0, "review": "The world doesn't need another chromecast review. You know what it does and how it works basically.My experience is that it is just too buggy. The Netflix app goes all wonky sometimes, and switching videos glitches out sometimes. YouTube forgets what it was doing and similarly glitches out.The Chrome app on the PC can stream any movie Chrome can play... For a while. It also glitches out, regularly losing connection with the chromecast.WiFi setup is clever, but buggy again. If you are switching between networks it will not remember multiple networks, and you might as well assume it will need a factory reset to switch.Now that I have a smart TV, I have no use for it... Maybe when less buggy", "verified": true, "helpfulness": "0/1", "author": "Jason"}, {"rating": 4.0, "review": "The app is only needed to set it up - then you use chrome or other aps from providers like pandora and netflix to \"cast\" your content to the unit/TV.  Took a while to figure that out, but once done, it works great.  Best results with aps optimized for it vs casting from a browser stream.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "It took about a day and half for it to download the first full update.  Even after that, I spent about 4-5 hours tinkering with it, my laptop, my tablet and my router to get it to connect to the internet.  I read through countless forums trying the random tips and tricks they mention, but still can't get it to work.  After all of this time I can try to cast something to the device, then the screen goes black before my device says that it can no longer locate the chromecast.  Really poorly done Google.", "verified": false, "helpfulness": "0/1", "author": "Ben"}, {"rating": 1.0, "review": "After 5 hours of fooling around with this product, it is being sent back.I read 20 blogs, with about 50 things to try in order to make it work----disable IGMP, enable multicast, disable multicast, configure NAT, add Chrome to firewall exception list, disable firewall, disable AP isolation, reboot this, reboot that, stand on one foot....I was briefly able to display my laptop PC on my TV using the Chromecast device, then the screen went away.  Re-casted, only to experience the same thing.  After numerous tries, factory resets, and 3 different devices, I never was able to connect again.Seriously---what a piece of crap.  I suggest a new name for this device------ \"CrapCast\".", "verified": true, "helpfulness": "0/0", "author": "Steve T."}, {"rating": 5.0, "review": "I mostly wanted it because I hate using my blu ray for netflix and this was worth the $32 to try it out. It only takes about 20 seconds at most to switch from watching on my phone to watching on the TV. Being able to easily take it with you anywhere is great too.", "verified": true, "helpfulness": "1/1", "author": "Jason"}]