[{"rating": 1.0, "review": "The box starts with \"checking for updates\" and hangs FOREVER. There's no way you can bypass the \"checking for updates\".  You might waste hours of your time then end up at a UPS store to return this MONSTER. Why such a big name like AMAZON could have a terrible product like this? DON'T BUY IT.", "verified": true, "helpfulness": "2/14", "author": "Do Huynh"}, {"rating": 5.0, "review": "It is very easy to set up and start using.  I am thinking of getting another one for my guest bedroom. If you do not have cable, I highly recommend Amazon Fire!", "verified": true, "helpfulness": "0/0", "author": "Lissa"}, {"rating": 5.0, "review": "I'm new to streaming media players but since I'm already an Amazon Prime customer, I thought I'd give it a try.  For $99 I had to see what I was missing with these streaming devices.  First, the packaging was excellent, almost overkill for what is contained in the box.  Very Apple-like.  Setup was very easy.  I just connected the box directly to the available HDMI3 port on my Yamaha audio receiver, installed the supplied batteries in the remote and pressed the Home button.  That was it!  The audio system switched to HDMI3 and Amazon Fire TV was live on my 60\" HDTV ready for initial setup.  First challenge was that it was not able to identify my WiFi as the SSID is hidden, so the process literally stalls with no warning or error message.  The instructions alluded to the fact that it would allow you to manually configure the WiFi connection, but I never saw that.  It just hangs.  So I reconfigured my router to broadcast my SSID and rebooted Fire TV.  This time it quickly found my WiFi network and proceeded to the configuration. Once setup, it worked great!  I was able to select apps that I will definitely use, like Netflix, YouTube, etc., and the picture and sound quality is excellent.  I have Verizon FIOS Quantum and there is no buffering delays whatsoever.  We've watched a few movies and documentaries already, and the sound and picture quality is as good as my Verizon FIOS subscription service.  I was thinking of dropping Amazon Prime, but with Fire TV, I think I'll be a customer for some time now.", "verified": true, "helpfulness": "1/1", "author": "T. M. Caridi \"TC\""}, {"rating": 4.0, "review": "I am still learning how to navigate it, but so far it is great. Saves a lot of time from manually searching for movies.", "verified": true, "helpfulness": "0/0", "author": "J Renee Baker"}, {"rating": 5.0, "review": "I love this thing.I have a Tivo, and I like having access to Amazon instant video, Netflix, Pandora,etc on my TV. Nothing against Tivo (except the monthly fee) but it was simply not going to work with my set-up anymore. So I got this lovely little device and love it.First of all, no monthly fee. You pay for what you want and with Prime, most things I want are free or pretty reasonably priced. I have been a Prime member forever so I didn't have to add or change anything to get what I wanted from it.Amazon products don't disappoint me. It was super easy to set up, I had no problems connecting or figure out how to navigate. The remote is simple. The box is small and I didn't have to make room for it.Very happy with the device and it shipped fast.", "verified": true, "helpfulness": "2/2", "author": "DStar"}, {"rating": 5.0, "review": "I am not a techie by any means but I wanted to watch Prime movies on my TV.  First I had to see if my flat screen was HDL.  To do that I found the label on the back and discovered it is.  Then I went online and read about the Fire TV.  Reviews said it was easy to do.It was!I love this.  It even lets me used closed caption so the sound won't disturb my husband at night.  Closed caption also is in different sizes and backgrounds (white or black).The voice feature is a nice idea but I find it just as easy to use the buttons.Remote is a nice small size and easy to hold.I got the high speed connector they offered extra.", "verified": true, "helpfulness": "2/2", "author": "M. Macleod \"ReadingJM\""}, {"rating": 5.0, "review": "Out of the box, it's a rock solid device.  It was the easiest network device to setup.  It easily found my WiFi and my Prime account.  I was up and running in just a few minutes.  Honestly, it took longer to unwrap everything than it did to configiure it.  The voice recognition search is awesome and incredibly accurate.It's a very \"portable\" device so you don't really need to buy one for every room.  Just carry it around to where ever you need it.Finding content and previewing that content is quick and easy.", "verified": true, "helpfulness": "2/2", "author": "Robert Bedal"}, {"rating": 3.0, "review": "movies are to expensive, number of apps not what I expected, technically the unit works well, but after the prime membership costs and the movie rental costs I'm very disappointed. cheaper for me to go to Redbox and rent a movie...... Also why do my apps on the kindle HDX not sync to the fire TV?", "verified": true, "helpfulness": "1/3", "author": "David R. Smith"}, {"rating": 5.0, "review": "We love it.  What else can we say? We were doing the same thing through our DVD player but it was extremely slow and the menus were complicated.  The Fire TV is really fast and very simple.  Our DVD player would conk-out on us all the time too. Very annoying.  The Fire TV doesn't do this.  Also... we aren't gamers, but have discovered that we are really enjoying some of the games.  We like using the regular Fire TV remote because it's simple.  We haven't bought the gaming remotes yet.  Anyway... very wonderful machine and we really love it.", "verified": true, "helpfulness": "1/1", "author": "Murray"}, {"rating": 4.0, "review": "Quality:-Audio: 10-Video: 10Excellent and snappy interface.Lots of options and channels to choose from, both free and premium.Voice search is fantastic to quickly search the Amazon servers for content. (It would be nice to open up the voice search to the rest of the apps, or at least as a keyboard replacement when you have to log into your apps)I would give this product 5 stars except for 1 thing.A deal HAS to be made with Google so you can use the Play store or at least carry purchases over from the Play store.I have had to re-purchase several apps that I have already purchased from either Google or direct from the developer.For instance I have a Plex-Pass subscription. with that I am supposed to have access to all of the apps to connect to my plex server. However, I had to re-purchase the app on the FireTV.", "verified": true, "helpfulness": "0/0", "author": "John Denton"}]