[{"rating": 3.0, "review": "To be clear: as of this writing, this product does not support screen mirroring or even casting your Chrome browser if you are using any smartphone or tablet. Chrome casting is only available from a laptop/desktop computer.  On a smartphone/tablet, it will only cast a limited lineup of services like Youtube, Pandora, and Netflix - you know, the ones your smartTV already supports.I was somewhat confused by other reviews, until I got this unit myself. I have a Google Nexus 7 and thought surely I would be able to at least cast my Chrome browser from my Android tablet (since it is after all a Google machine). Nope. It sounds like Android screen mirroring support is in the works, but currently it does not exist.It was also disappointing that Vimeo is not yet supported, and Vimeo has been very nebulous on when or if this will ever happen.  This is disappointing because many of the hi resolution videos I would like to see on a bigger screen screen for viewing are on Vimeo. I will say that when I cast Youtube on my Smart TV, the resolution is much better than the Youtube app built into my TV. For some reason my TV (and my Youtube-equipped DVD player for that matter) seem to only display low-res or the hi-res is choppy. Not the case w/ the Chromecast: its been hi-def all the time with relatively quick buffering.With all that said, I don't feel like I've gained much functionality with Chromecast over what I previously had. I'm debating on returning the item and waiting until Android screen mirroring is available, which is really what I want.", "verified": false, "helpfulness": "1/1", "author": "Amazon Customer \"Nate\""}, {"rating": 2.0, "review": "listing states \"Easy setup: Plug into any HDTV and connect to your home WiFi network\".  Simple, right?  Not so.  I have a perfectly good router, but the Chromecast is not compatible with it for some technical reason beyond my comprehension.So beware when you buy this - be sure you know the in's and out's of routers and their settings etc.  I will have to hire an IT guy or gal to figure it out for me. Unfortunately I waited too long and can not return it without paying a hefty penalty.", "verified": true, "helpfulness": "0/0", "author": "Auntie Em"}, {"rating": 5.0, "review": "My favorite purchase yet. LOVE IT! I bought more for my other televisions. Great purchase I recommend everyone should have one.", "verified": true, "helpfulness": "0/0", "author": "Jasmine"}, {"rating": 5.0, "review": "It is so awesome to be able to cast my Netflix movie to my TV so my husband and I no longer get stiff necks trying to watch a movie. Definitely worth the money.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The media player is just fantastic!!  Since it arrived I have been watching movies and looking at photos from my laptop on my TV.  Screen size does matter.", "verified": true, "helpfulness": "0/0", "author": "Marc Ostinato"}, {"rating": 5.0, "review": "I haven't reviewed anything on Amazon in a while, so I thought my experience with Chromecast would be a good place to get back in the review game.First, what you will need:A wireless (wifi) connection that you have accessA computer / tablet / smartphone that can access the same networkA device with an HDMI input connection (TV / Projector / Monitor)What you get in the box:1 x Chromecast device (dongle) with HDMI male end and micro USB female end.1 x HDMI extension cable (HDMI male and female end) for when you can't squeeze the device itself into an HDMI port due to lack of space1 x USB cord with AC Power adapter end (removeable)User ManualThe box itself has a simplistic design with a popping image of the device itself.  Somehow, looking at how it is packaged and presented is very satisfying.  How does Google do it?Hookup is an ease.  It's pretty simple to grasp, even for those not extremely well-versed in the field of electronics.  The HDMI end can only hook up to one spot, though you may need to use the HDMI extension cable depending on the layout or positioning of your HDMI ports or existing cables.  The USB cable can be used to connect to your TV or device's USB port, or you can use the adapter to connect it directly to an AC power outlet - the latter is recommended by Google as some devices power off the USB port when the device itself powers down.  Essentially, hooking to an AC power outlet ensures the device remains powered on at all times to eliminate boot / wifi connection lags.Once connected and powered on, change your TV or components to the appropriate input and you will see the initial setup menu.  Unlike typical streaming components, there is no device for direct input.  Let me clarify:  you do not directly control the chromecast device.  All control is done through tablet / smartphone / computer and relayed through your network to the device.  At first, this seems a little strange, but you'll get used to it once you find out how simple it is to use.The setup process will ask you to use your computer / tablet / phone to activate the Chromecast on your network.  Simply follow the on-screen prompts and soon the device will check for updates, reboot, and come back up on its own ready for normal operation.  You will be prompted to enter your home wifi network security key (password).Once connected, you are ready to \"Cast\".  As long as you have access to the web pages through Google Chrome browser, or have the apps on your mobile devices, you are ready to go.  Youtube, Netflix, Google Play, and HBO Go are the apps I have been able to test so far.  Once you pull up one of these apps or web pages, you will notice the Chromecast icon usually positioned in the top right of that app (if you can't find it, google it and find an example).  Upon clicking this icon, you will need to pick the actual device you want to Cast to.  If you have more than one Chromecast, they will be shown with the names you set up during the setup process.  Pick your device, and the app or service you are watching on your device will immediately begin streaming to the Chromecast instead.  That's it.  Have fun.Now, here's the part where I need to correct a lot of the reviews on here.I see a lot of in-depth reviews with great information.  A few of these always state that there's no way to \"Cast\" items from a local network without installing a 3rd party piece of software.  This is true to an extent, but the only piece of software you need to accomplish this is Google Chrome with the Chromecast extension installed.  With this extension, you can Cast any page you can open in Google Chrome directly to the Chromecast device.  Most people don't know this part:  you can drag and drop music, movies, and sometimes photos directly into the Google Chrome address bar to open them directly in the browser.  I know for sure this works for movies, I have personally used it many times with my Chromecast device.  Any file you have stored on a network drive or hard drive can be dragged and dropped into Google Chrome's address bar and then just click the Cast icon at the top right and you're set.  From this point on, consider anyone explaining this process using a 3rd party software other than Google Chrome as an advertisement for that software, personal preferences aside.Any feedback on my review is recommended.  I would rate this more closely to maybe 4.5 out of 5 if I could due to the fact that this is not a typical streaming device, with no apps built in to the device itself.  I can understand the simplistic design makes it more cost-effective, but at just 20-40 dollars more, a device like the Roku accomplishes the same ends without REQUIRING you to have another computer or device.  Otherwise, a very innovative design and hopefully more app support will be coming this year.Thanks for reading my review.  Have a great day, and enjoy your Chromecast.", "verified": true, "helpfulness": "1/1", "author": "Derek"}, {"rating": 5.0, "review": "With nothing but a TV in my living room since we do most of the extra ciricular watching in the basement theater, I wanted something for the occasional internet viewing upstairs but it wasn't a big enough need to warrant paying even $99 for an apple TV. At this price-point I thought, why not? So far, so good. I've watched content from my laptop and from my iPhone and it's great! Heart you google!", "verified": true, "helpfulness": "0/0", "author": "Myler \"jmyler\""}, {"rating": 5.0, "review": "So simple to use!Google really made a miracle device. It has provided a new dimension to entertainment! I set this up in few minutes and before you know it, a beautiful Chrome logo greets you! And just like that I was hooked!Don't wait, just get this brilliant piece of technology today!Thank you, Google.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 5.0, "review": "It works as expected. Very small and easy to use. Youtube and Netflix work like a charm! The only thing I still can't manage is to obtain digital 5.1 output.", "verified": true, "helpfulness": "0/0", "author": "Rodrigo B."}, {"rating": 5.0, "review": "I bought a Nexus7 with Chromecast together. Now i can always use my TV to watch whatever i have on Nexus7.", "verified": true, "helpfulness": "0/0", "author": "chen xu"}]