[{"rating": 5.0, "review": "This device is fantastic and has made me a cable quitter!  Straightforward, easy set up; just plug into your TV and download the Chromecast app to your phone or install in your Chrome browser.  The one complaint I have, which may be a result of my internet connection, is the quality from my Chrome browser to TV is pretty poor.  The quality when I use my iPad or iPhone is great.", "verified": true, "helpfulness": "0/0", "author": "Ser"}, {"rating": 5.0, "review": "works great", "verified": true, "helpfulness": "0/0", "author": "Daniel Knapp"}, {"rating": 5.0, "review": "Love it,,,,", "verified": true, "helpfulness": "0/0", "author": "diana johansen"}, {"rating": 5.0, "review": "Awesome product! I stream from my Windows, Ubuntu & Linux Chrome Browser Tabs, from our phones, iPad and the Nexus 7 - all seamlessly. Set up was a breeze and the connectivity is excellent. Not a single drop or problem so far. Great value for the money.", "verified": true, "helpfulness": "0/0", "author": "Mysticman"}, {"rating": 5.0, "review": "Dear,I made a request shortly 2 Chromecast that even my hands are already there, but there was a misunderstanding on are charging U$ 99 for a AmazonPrimeMembership and the moment would not be my intention. So I'd be kind enough to do the reverse of the same value to be not charged in my bill.Very grateful,Jefferson", "verified": true, "helpfulness": "0/0", "author": "Jefferson José Benevides"}, {"rating": 5.0, "review": "Great way to play videos for my kids on tv.", "verified": true, "helpfulness": "0/0", "author": "jshaw"}, {"rating": 5.0, "review": "Great product.", "verified": true, "helpfulness": "0/0", "author": "tx49er"}, {"rating": 5.0, "review": "absolutely love my chromecast.  Streaming is so easy.  I teached my 6yr old niece to use it with no problems.For the people that are having issues streaming, most likely your WiFi needs an upgrade or your Internet speed is not very good.", "verified": true, "helpfulness": "0/0", "author": "Tom Pescatore"}, {"rating": 5.0, "review": "This little device turned my dumb Sony TV into a smart TV! Setup was as easy as advertised. So far, I've streamed YouTube, and my home movies via Plex Media Server. I use my Android phone and tablet PC, my wife uses her iPad to cast videos to this. Cool device, great price!", "verified": true, "helpfulness": "0/0", "author": "Peter Filippone"}, {"rating": 1.0, "review": "Could not get to work may be because of my limited knowledge of the computers, instructions seemed easy but could not get to work", "verified": true, "helpfulness": "0/0", "author": "George Verdugo"}]