[{"rating": 4.0, "review": "The microphone feature makes it so easy to find programs. Just say \"Bosch, Season one, Episode one,\" and there it is. Or \"Ron Perlman\" and shows with the actor show up on your screen.  Or \"Science Fiction,\" and the genre appears on screen so you can choose the title. Great!", "verified": true, "helpfulness": "0/0", "author": "Steven"}, {"rating": 5.0, "review": "The Fire TV was simple to set up, and its controls are intuitive and easy to operate. The operating system is fast and I have had no problems streaming movies over Wi-Fi with only a basic DSL set up; 3Mbps download speeds.  I bought the box version so I could run the sound through my stereo speakers as opposed to the TV's speakers, and the sound is crystal clear.  I am in the process of upgrading my broadband connection and so expect an even better viewing experience.  As for the apps, I have only used the Netflix app so far and it too has worked flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Jeff"}, {"rating": 4.0, "review": "Needs an off button that isn't buried in menus.", "verified": true, "helpfulness": "0/0", "author": "Murray"}, {"rating": 5.0, "review": "If your a cord cutter and media junkie like myself, this thing is a great alternative to the Apple TV (or addition to your streaming device collection), but depending on what specific content you're looking for, it's not easy to say which device is better. What I can say is different about this device is it's selection and games and optional third-party apps, which is a great feature to customizing your media intake.", "verified": true, "helpfulness": "0/0", "author": "Andrew Alexander"}, {"rating": 5.0, "review": "Easy to set up and works great!!", "verified": true, "helpfulness": "0/0", "author": "June Carlsen"}, {"rating": 1.0, "review": "Had it since December. ..haven't been able to get it to work.", "verified": false, "helpfulness": "3/6", "author": "Robert Cortez"}, {"rating": 4.0, "review": "I love my Amazon Fire TV. Great service. Excellent streaming. Usually flawless. Only thing I would like to see added is a straight out web browsing app. Works great as a streaming device, remote is the fastest responding remote I've seen. Easy to work with, and you can download app to use kindle or your phone as a remote. Nice device. I think of you are looking for a streaming device, this is one to definitely try out.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Well, when it works, it works well.However, I have had to return two units when they failed to re-start.  In both instances, the unit worked (no.1 for two weeks) (no.2 for about 4 hours) before they conked out.  I will be getting another replacement unit on Monday.  Perhaps the third time will be a charm.", "verified": true, "helpfulness": "4/6", "author": "J V O"}, {"rating": 5.0, "review": "Awesome!!!!  This thing is great. Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "Debby Zukosky"}, {"rating": 3.0, "review": "Most of the stuff you have to pay or rent?", "verified": true, "helpfulness": "0/0", "author": "antonio"}]