[{"rating": 4.0, "review": "works excellent just wished Google allowed true streaming from your devices own video files. other than that works as advertised", "verified": true, "helpfulness": "0/0", "author": "Abram Baca"}, {"rating": 3.0, "review": "Chromecast is a great idea and it works perfectly for Youtube and Netflix but i cannot get it to stream a google chrome tab that i have dropped a video file into. It was advertised as being able to do this but it definitely cannot for me. good thing it was only $35.", "verified": true, "helpfulness": "0/0", "author": "Highlander"}, {"rating": 2.0, "review": "If your intention is to use Youtube, Netflix, Web sites it's ok! But the ridiculous is: you can not show videos or photos from your pc/notebook/tablet. So modern ...so backwards.....", "verified": true, "helpfulness": "0/0", "author": "Carlos A. Rodela"}, {"rating": 4.0, "review": "This is one of the best computer gadgets I have used. Works perfect right out fo the box. Now if would just work with Amazon Prime it would be perfect.", "verified": true, "helpfulness": "0/0", "author": "Photo Nelson \"jmn\""}, {"rating": 5.0, "review": "This device is so col, especial for the money. yes, there are similar solutions but nothing this versatile, mobile and inexpensive. Love it.", "verified": true, "helpfulness": "0/0", "author": "pdgrimes"}, {"rating": 4.0, "review": "Great product.  Well worth the money.  I would like it to support more streaming options.  Hopefully that will come with updates.", "verified": true, "helpfulness": "0/0", "author": "dave brown"}, {"rating": 4.0, "review": "Solid, for 35 bones can't be beat.  Make sure it's within line of sight of your WAP or it'll have some skipping issues.  Even a thru drywall it has issues at times.", "verified": true, "helpfulness": "0/0", "author": "Matt Scott"}, {"rating": 4.0, "review": "I like it - but I was hoping for more.  The video from my Chromebook is VERY choppy at best (even on the lowest setting).Surprisingly, everything I cast from my phone is PERFECT.Using the TV as a monitor is not bad either.Its worth the $35 - I am hoping they come out with better versions.", "verified": true, "helpfulness": "0/0", "author": "William Gargaro"}, {"rating": 5.0, "review": "Awesome product needs more apps but great UI!! Chrome needs to Cast Alittle better. I have already recomended to everyone I know!", "verified": true, "helpfulness": "0/0", "author": "Ronald"}, {"rating": 4.0, "review": "It is technically as good or better than Roku, but the lack of content providers supporting the device is limiting.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]