[{"rating": 5.0, "review": "Best tech investment of 2014!", "verified": true, "helpfulness": "0/0", "author": "Justin Bogart \"Never stop being a student! Your mind is a muscle, exercise it through reading, through listening. Learn, apply and grow!\""}, {"rating": 3.0, "review": "It works. Interface with an I phone 4s seems to be a little to flaky. I would highly recommend the Amazon Fire stick over this if your main purpose is streaming movies from Netflix or Amazon prime. This WILL NOT stream Amazon prime video", "verified": true, "helpfulness": "0/0", "author": "Bradley Ryals"}, {"rating": 5.0, "review": "I love this little unit I take it with me when I travel and hook it up to the HDMI input on the hotel TV and I can watch my Netflix and Hulu plus if I want to just relax and listen to music it's right there with Google Music and much more....... right from my cell phone are tablet, I love it.", "verified": true, "helpfulness": "0/0", "author": "Ken Duncan"}, {"rating": 4.0, "review": "Requires phone, tablet or PC to select programming.Has the advantage that anyone on your WiFi can use their own NetFlix/Hulu/Vudu account to stream.Easy to enter a secure (64+ character) WiFi passwords by cut-paste with the configuration app.Lacks Amazon app streaming. Allegedly flash-player casting from web browser can be used to stream Amazon content but have not tried it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"super_haggis\""}, {"rating": 3.0, "review": "It works very well for some things, not so much for others. In conjunction with iOS support must be built into the app and there are a limited number of those, but luckily two services I use all the time, Netflix and Vudu, are two of them. It also works with YouTube. Those all work very well, almost seamlessly. However, Chromecasting from the Chrome browser on a computer has been frustrating at times. It works sporadically on my older MacBook Pro, sometimes not working at all, and sometimes with stuttering video. Other times it works fine. I've found no correlation for when or why. It could be some video sources require more CPU/GPU resources that when combined with what's required to Chromecast becomes too much for the older machine. I've had much better luck with a year-old Samsung Ultrabook, though recently when watching a rented movie on YouTube the broadcast was interrupted several times by some sort of network issue and had to be restarted. The best feature is it works with my A/V receiver. I have a smart TV with a Netfllix and Vudu app but then I can't pipe that audio through the receiver. Now I can watch streaming video from those services and enjoy high-quality audio as well. I can't really complain. For the $25 I paid for it, it's definitely been worth it.", "verified": true, "helpfulness": "0/0", "author": "K. Brown"}, {"rating": 4.0, "review": "Very Good product, I love it.", "verified": true, "helpfulness": "0/0", "author": "Veronica"}, {"rating": 4.0, "review": "Works as advertised, makes a great addition to the home entertainment plan", "verified": true, "helpfulness": "0/0", "author": "Ian"}, {"rating": 1.0, "review": "Its reception is not always so goodIt does not allow to view the content of the computer", "verified": true, "helpfulness": "0/0", "author": "pazit"}, {"rating": 5.0, "review": "Excellent product! Easy to install and setup. 1) Plug into any available HDMI port,  2) Follow the instructions on the screen. 3) Now stream any video from a tablet to the tv. Perfect.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 4.0, "review": "I think that this product is great and has worked amazingly so far. The only problem I have is when you go to use the chrome extension on your pc or Mac and you choose to broadcast you browser or desktop it is very laggy when moving the mouse and the frame rate dips a little. But overall this is a great product and I would highly recommend this to anyone!", "verified": false, "helpfulness": "0/0", "author": "Aidan Shea"}]