[{"rating": 5.0, "review": "it really helped with the fact that I could not play music on my home stereo without directly plugging my phone into the stereo.  not to mention I can share pictures and videos, and watch netflix.  worked great on a trip out of town to make the stay at the hotel much more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "Bobby F."}, {"rating": 5.0, "review": "This is the next best thing to a smart tv, for a lot less money. I have two of them and the only thing I have found is that the boys don't want to share the time on it. We don't have the fastest internet but can watch movies from HBO-Go with no problems. Tablet, Phone or computer, doesn't matter what we are on, it makes sharing the media easy. get one from somewhere if you can.", "verified": true, "helpfulness": "0/0", "author": "George L Golden"}, {"rating": 2.0, "review": "By using Google Chromecast, I was wishing to view everything from the laptop on the TV, but Chromecast is limited to certain applications, like youtube and etc. It doesn't even work for Amazon videos.", "verified": true, "helpfulness": "0/0", "author": "Dolly"}, {"rating": 5.0, "review": "I have been using a Wii to stream netflix and amazon.  However, I wanted something less expensive and smaller for my bedroom TV.  This was really reasonably priced and was simple to set up.  I would definitely recommend it!", "verified": true, "helpfulness": "0/0", "author": "LKP"}, {"rating": 5.0, "review": "CONNECTIVITY IS AWESOME WETHER THROUGH THE PHONE OR IPAD. WE CAN WATCH YOUTUBE OR NETFLIX OR ANY OTHER SUPPORTED APPLICATION WITH EASE AND CLARITY. SAVES ME THE TROUBLE OF CONNECTING HDMI WIRES. IM HOPING THE PROGRAMMING WILL IMPROVE ITS RANGE WITH OTHER PROVIDERS JOINING CHROMECAST. ONLY ISSUE I HAD WAS THAT THERE IS CURRENTLY LIMITED SOFTWARE TO STREAM USER CONTENT (LIKE IF YOU WANT TO WATCH A SHORT VIDEO CLIP OR PHOTOS FROM YOUR DEVICE).", "verified": true, "helpfulness": "0/0", "author": "Juan"}, {"rating": 4.0, "review": "It was very easy to install and set up.  Works pretty good but for some items, the words and sound are out of synch.", "verified": true, "helpfulness": "0/0", "author": "BigMac"}, {"rating": 3.0, "review": "Like most people I mostly care about getting Netflix on my TV without an expensive piece of hardware,  For that purpose it works just ok.  One TV has a PS3 and the other this Chromecast.  The quality of the picture on the Chromecast is noticeably worse than the PS3.My Chromecast has recently started to stop working after about an hour of usage, like a heat-related issue.Using the Chromecast extension on Windows 7 inside of Chrome browser is not quite consistent enough for my liking with YouTube.  Sometimes when you switch from one video to another it just works as expected.  Other times (more often than not actually), you have to change the output to the computer screen and then switch it back to the Chromecast in order to get a second, third, etc video to show in sequence.However with all that said, for $30 (not sure if that offer is still out there), this is hard not to recommend.  Other than the recent problem of freezing after an hour or so, I think it's a nice gadget to get video easily into your TV from your computer.  Hopefully the ability to play local videos rather than internet-streamed videos will improve.  I think Plex is the current officially supported way of doing this.Seems to get frequent updates from Google, which happen automatically.  Hopefully they fix the stuff that ain't to my liking and make a nicer product as time goes on.", "verified": true, "helpfulness": "0/0", "author": "M. Lofaso"}, {"rating": 1.0, "review": "It was very hard to sync this to our wireless network (there's a long list of modems it doesn't work with - suggest you check this before you buy the product).  Then Google's software site said our iPad 4 wasn't supported for casting software. So after spending several hours trying to get it working, we gave up and returned the product.", "verified": true, "helpfulness": "0/0", "author": "Rosemary"}, {"rating": 5.0, "review": "I love it because I can take it everywhere and it not in view, but I would like to see everything in Full HD", "verified": true, "helpfulness": "0/0", "author": "Eliuth Flores"}, {"rating": 1.0, "review": "If I could rate it zero stars I would. Talk about aggravating. It worked like a charm for 3 weeks then it (the device), on its own, decided that my laptop could not find it (the device). So I troubleshot it but no go. Ordered another, installed it, worked fine on every device in the house (other laptops and smart phones) but not my laptop. It kept telling me that I did not have the device connected right. Helllllllllo ... it is working on everything else but not my laptop. Got a hold of Google support ... hahahaha. That was joke. They basically don't read what you write. They send canned responses. Finally when I had enough a real human being wrote back and said SORRY we can't help you, enjoy you device. REALLY Google?I made an intelligent buy after that lovely experience, I bought Apple TV. See you later Google. WOW what an experience.", "verified": true, "helpfulness": "0/1", "author": "Daniel Badran"}]