[{"rating": 5.0, "review": "Very happy with this item, watching a lot of shows on my 55 inch tv through my iPod. Best ever", "verified": true, "helpfulness": "0/0", "author": "sam"}, {"rating": 1.0, "review": "Could not figure out how to use this.  Too complicated with downloading all kinds of stuff. I sent it back.", "verified": true, "helpfulness": "0/0", "author": "cybershopper \"cybershopper\""}, {"rating": 5.0, "review": "love this product  I got a big screen and can use it instead of my computer to watch my prime movies", "verified": true, "helpfulness": "0/0", "author": "brachycanis says: I'm semi-retired and thinning out our vast collections of life."}, {"rating": 5.0, "review": "I now can watch on my TV anything I have on my computer.  We dropped our cable years ago and have Hulu Plus and Netflix but there were still some things we couldn't watch on those.  Now I can enjoy sports, TV, and anything else I can get on my computer on my TV.  Can't beat the price!  It does for less what Apple TV does.  Great buy, Highly recommended!", "verified": true, "helpfulness": "0/0", "author": "Doug"}, {"rating": 1.0, "review": "it has some issues with Netgear R6300 even though i followed the workaround with Net gear support it did not work", "verified": true, "helpfulness": "0/0", "author": "Jenny De La Piedra \"Art\""}, {"rating": 4.0, "review": "First off, with my Amazon Prime, I got my Chromecast the next day I ordered it!As far as the set-up goes, it's fairly easy. Open the package, connect the power source, connect the Chromecast device/dongle to your TV's HDMI port, connect your wi-fi using your smart phone or tablet, and then you're set to view the available applications from your phone/tablet on your TV.I used the USB port from my old LCD to power up my Chromecast. My main purpose for the Chromecast at this time is for Netflix, YouTube, and Pandora. They work seamlessly! Once VuDu is supported, I will definitely use it for that, too!There is few seconds delay/rendering of about 3-8 seconds from when I start casting from my devices before the content plays on my TV.  The device quickly acknowledged (about 1 second) that I was casting content, but since the device need to connect to web to gather the content, it takes the 3-8 seconds before the content plays.One thing you SHOULD NOT DO... do not plug and unplug the device and expect to not give you errors. It gave me an error when I unplugged it from one HDMI port and moved it to another HDMI port.  Apparently, the device needs to complete shut down and boot-up.  So if you that, make sure to unplug the power source, wait about 10 seconds before plugging everything back in.Also, you do not have to unplug the device when turning-off your TV. It will shut off when the TV power is off.Once there are more applications supported, I will/might give it a better rating.", "verified": true, "helpfulness": "0/0", "author": "N. David"}, {"rating": 1.0, "review": "This worked once, then it would stream video but no audio. I tried everything and finally called the help desk for google. I waited 20 minutes only to be insulted and treated like an idiot. He asked if I had pressed mute or turned the volume down! Then he told me to take the device out of its port and try another one. As I turned the TV the device broke. The process for replacing this is truly draconian. I stayed on the phone for 45 minutes just so I would have the opportunity to give him a bad review.Now I am waiting for the replacement. They are charging me for this, and it probably still won't work.I am disgusted.", "verified": true, "helpfulness": "0/2", "author": "Ainslie"}, {"rating": 5.0, "review": "What can I say? It's inexpensive and brings the smart tv experience to your regular HD tv. I use this with my PLEX and MediaBrowser servers and have no issues at all. Great little device.", "verified": true, "helpfulness": "0/0", "author": "notap"}, {"rating": 3.0, "review": "The device eliminates the need to have a cable from my laptop to my tv, however, I as with most Google downloads I am bombarded with offers to download third party applications.  Also, I have  experienced more problems with streaming programs from my computer than with the cable attachment.", "verified": true, "helpfulness": "0/0", "author": "Ron Wisnia"}, {"rating": 5.0, "review": "Couldn't believe that this small item could do so much.  We use it mainly for music videos from You Tube.  The girls love to do just dance videos on it.  We already have Netflix and Hulu on our main T.V.  I can't believe how clear and the quality of the videos come out.  No jumping or skipping.  Very impressed.  I'm thinking of ordering another one for one of the back bedrooms.", "verified": true, "helpfulness": "0/0", "author": "Tara Branson"}]