[{"rating": 5.0, "review": "Literally changed my life for the better. Canceled my cable and now just pay for Hulu and Netflix, so $19 per month vs. $80", "verified": true, "helpfulness": "0/0", "author": "Jared"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "Darrel G"}, {"rating": 1.0, "review": "Bought this to watch HBO Now on. Works horrible. Have to control it using an HBO app on your phone which doesn't work right and won't pause the show. Sometimes even having problems even starting a show. Will return it and try the Amazon fire stick.", "verified": true, "helpfulness": "0/0", "author": "S"}, {"rating": 5.0, "review": "5/5", "verified": true, "helpfulness": "0/0", "author": "chinmay chotaray"}, {"rating": 1.0, "review": "Great for watching silent movies, or perhaps if you have lots of spare time to spend on the web trying to find answers like so many others on why after 3 or 4 uses the mute is stuck on.  No thanks.  Complete garbage.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "axel rivera"}, {"rating": 5.0, "review": "Works great with android phone! But not too easy to get it working with Kindle fire", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "In time, and hardware it's ok", "verified": true, "helpfulness": "0/0", "author": "albita"}, {"rating": 5.0, "review": "Works as described, good purchase.Will convert non-HD TV's into semi-smart TV's, but you WILL need at least one HDMI input. This is where or how this device \"plugs into or connects\" too your flat screen TV.The TV Man\"", "verified": true, "helpfulness": "0/0", "author": "Ralph The TV Man"}, {"rating": 2.0, "review": "It was nice while it worked. We have a smart tv so this wasn't super necessary but it was better than the built in software on the tv. I would rate it higher but at one point it did an \"update\" which never finished. This completely ruined the Chromecast as I haven't been able to use it since. We've tried factory resetting it but I think the software on it is hosed. Maybe I'll get a 2nd one someday but for now we'll just stick with the crappier built in smart tv functionality.", "verified": true, "helpfulness": "0/0", "author": "H.W."}]