[{"rating": 5.0, "review": "Just what I needed to bring Broadband to my TV.", "verified": true, "helpfulness": "0/0", "author": "Kim G."}, {"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "S I S"}, {"rating": 5.0, "review": "Right out of the box this thing is awesome! Just plug it in and go, it's that easy.  The only thing I would say they can do better is at this point is have the voice recognition work for YouTube and everything else.  Not just prime. It is still very easy to use and navigate.  I think that someone new to electronics would even be able to navigate with no problems at all.  It is also VERY VERY FAST. All in all I love this thing. I highly recommend it.", "verified": true, "helpfulness": "0/0", "author": "Matt"}, {"rating": 3.0, "review": "The product was easy to get set up. Instructions were clear and precise. I was surprised that so much of the content available had to be purchased. That is why I gave it only 3 stars.", "verified": true, "helpfulness": "1/3", "author": "Dennis Carey"}, {"rating": 5.0, "review": "I'm really happy with my Fire TV.  It's super easy to navigate.  My six year old niece figured it out no problem.  Has the apps I like to watch and more I didn't know about too.  Amazons customer service was great when I asked for a price adjustment due to it going on sale the day after I bought it.  Very satisfied customer here!!", "verified": true, "helpfulness": "0/0", "author": "Robert Markwell"}, {"rating": 5.0, "review": "outstanding product . works seamlessly ,fast easy .i was reluctant because playstation was working well. differrence between  a car and a bus both get you there one is faster easier more convient etc", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"nomind\""}, {"rating": 5.0, "review": "There are no words besides LOVE. This little remote and the fast way you set this up was/is perfect. The Prime videos are so great, and varied and they keep adding more-- this pays for itself.", "verified": true, "helpfulness": "0/0", "author": "AEM \"LOVE IT!\""}, {"rating": 5.0, "review": "FUN", "verified": true, "helpfulness": "0/0", "author": "D. Hefler \"Toyman2\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Margaret  Manning"}, {"rating": 1.0, "review": "Good product but with only 8gb storage.  About 5 usable this product cannot be used as advertised.  You can download a few games and ypur memory will be full right away...  Amazon removed the capability to root your device and use a usb as external storage for games which is reason #1 i bought this.  Stay away from this product if you want to use it for games", "verified": true, "helpfulness": "3/7", "author": "Rick"}]