[{"rating": 5.0, "review": "Works great.  Easy to set up.  Picture is great and the voice remote hasn't missed yet.  I am very happy with this purchase.", "verified": true, "helpfulness": "0/0", "author": "fordian"}, {"rating": 5.0, "review": "Love, Love , Love!!!!!!", "verified": true, "helpfulness": "0/0", "author": "P. Silva \"Profesora\""}, {"rating": 3.0, "review": "Could not connect to network unless it was located next to router.", "verified": true, "helpfulness": "0/0", "author": "Robert Bowman"}, {"rating": 5.0, "review": "Someone finally made a tech product that even I could install and get running with NO help.  Quite the accomplishment.  Extremely easy to hook up and start using.  Literally, within minutes I was watching the original Jurassic Park with my wife and daughter.  Every tech product should be as user friendly as this, although I realize I expect things to be more simple than I have a right to.  This product delivers!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 4.0, "review": "No start-up problems; easy install; works flawlessly; hardly noticeable by the TV set.For older movies, cost could be more reasonable, even free. I'm a prime customer and would like more value for cost.", "verified": true, "helpfulness": "1/1", "author": "E. McNamara"}, {"rating": 4.0, "review": "I like this product.  I was a little creeped out that it knew it was mine when i connected it to my internet.  However i am not a total fan of the IPHONE remote app.  I also like how it has the latest verison of netflix and allows you to change pofiles, unlike my samsung smart tv netflix app.", "verified": true, "helpfulness": "1/1", "author": "megan bates"}, {"rating": 3.0, "review": "Generally the Amazon Fire TV box does what it is supposed to. The controls are responsive and the unit is fast. There are issues using the Amazon music service as it demands that your TV stay on as long as you are playing music, which is unnecessary and a waste of energy.  Other music streaming services don't have this same issue.  The Fire TV customer reps were excellent in one call, pleasant, engaging and competent, and in another call, irritated and unhelpful and did not get back to me as promised. Installation was simple and setup also easy.", "verified": true, "helpfulness": "2/2", "author": "coopmax"}, {"rating": 1.0, "review": "unit was non functioning. Had to return and replace with ROKU.", "verified": false, "helpfulness": "1/5", "author": "Garry Baldrey"}, {"rating": 4.0, "review": "this was a bday present for my mom she loves it but at times being 73 has difficulty using it", "verified": true, "helpfulness": "1/1", "author": "michelle dawn marquis"}, {"rating": 5.0, "review": "great and easy to use", "verified": true, "helpfulness": "0/0", "author": "michael ray pitts"}]