[{"rating": 5.0, "review": "It is great. It works well.  It came perfectly packaged. It was so good are affordable. I love it. It is great.", "verified": true, "helpfulness": "0/1", "author": "loopdogg"}, {"rating": 1.0, "review": "Was working great. Watched many shows, movies etc....Netflix, I actually subscribed just because I purchased this. Youtube was working great. Even rented a couple movies off of AMAZON. Then now, after a couple months it quits working correctly. All I get was like others stated a streaming icon buffering which timed out with message error playing video. First started with NETFLIX, and now just tonight started same with YOUTUBE. I will be looking into other alternatives.", "verified": false, "helpfulness": "9/10", "author": "Guy M. Manuel"}, {"rating": 4.0, "review": "This is a product for various usage. I use it for Netflix, but, understand its potential. Well worth exploring the possibilities.", "verified": true, "helpfulness": "0/0", "author": "clsiowa"}, {"rating": 5.0, "review": "Simple and practical product. Indispensable for those who want to integrate their mobile devices to view movies, photos and websites on your TV.", "verified": true, "helpfulness": "0/0", "author": "Marcelo Lima"}, {"rating": 5.0, "review": "These are great if you have Netflix and others. Super easy to set up and use. Wife loves them too. Cut cable years ago and this has replaced my htpc.", "verified": true, "helpfulness": "0/0", "author": "Mathew"}, {"rating": 3.0, "review": "i did not know that i control this device with a kindle. now i must upgrade to an android phone", "verified": true, "helpfulness": "0/3", "author": "Riker"}, {"rating": 5.0, "review": "1. Cheap 2. Getting better and better with more support. For those in the android camp or even the iOS camp, this is a great dongle to connect to your TV and stream from phone and tablet.", "verified": true, "helpfulness": "0/0", "author": "D. Sun"}, {"rating": 5.0, "review": "Very easy to install and set up was a breeze.  Within a few short minutes we were watching netflix movies \"cast\" onto our flat screen tv with an amazing picture!  Can't believe this is so easy to use and inexpensive!  LOVE IT!!!", "verified": true, "helpfulness": "0/0", "author": "Catherine"}, {"rating": 5.0, "review": "I got it at the start and it only gets better!Pros:Works great from Phone appsFar superior to my Samsung Blu Ray player for NetflixYoutube from the Phone rocksDoesn't kill Android batteryCostEasily move from one TV to another.Apps being added at a fast rateCons:Lag from ChromeWorks better with Android Phone apps than computer.Amazon hasn't (and probably) won't add support for Amazon Instant Video (sad because that will drive me to rent from other sites like HuluPlus, Premium YouTube, or Google Play.No support for 802.11ac (but neither do it's competitors)", "verified": false, "helpfulness": "0/0", "author": "GWG"}, {"rating": 1.0, "review": "Google chrome is running my battery down on my laptop.  Google chrome should be classified as a worm or virus.", "verified": true, "helpfulness": "0/8", "author": "librarian option \"great books\""}]