[{"rating": 4.0, "review": "I love love live it. The Nerflix ap could work better but otherwise so far it's amazing!  The quality is superb.", "verified": true, "helpfulness": "0/0", "author": "Bri Show"}, {"rating": 5.0, "review": "Fire TV puts Amazon in a position to be a major player in streaming AV content as well as the not that yet relevant android gaming platform (growing, with other entries out like the OUYA and of course tablets and phones). This is a sweet piece of hardware for a meager 100 bones, top of the line, slick looking, and full featured. Picture quality on this looks as good or better than my AT&T; UVERSE set top box does (both HDMI connected to the same TV). The only things that I do not like about this device are that it is not #1 in the content channels yet (but off to a good start), with a few key things missing like HBO-Go and no VUDU (not sure if there is another way to get to my UV streaming content yet).  The Netflix app on it is not quite as good as the PS3 one, so hopefully they will update that and get it up to the state of the art for that platform. Another cool feature about the Fire TV is that if you have a Kindle Fire HDX tablet, your videos, pictures, and other content can be displayed on the Fire TV just streaming it over to it. Not sure if this also works with Fire HD or not or the original Kindle Fire. As Amazon improves this and makes it even more appealing I can see this becoming the best streaming hardware and platform on the web.PROS:Fantastic picture quality and performance.Voice search is actually useful and actually works.Hardware powerful enough to run the most demanding android titles available on a big screen TV.Gaming controller for the Fire TV is solid, not quite Dual Shock 3 solid, but far better than most third party offerings.Fantastic free content available if you have Amazon Prime (and lets face it, if you're reading this, you probably do).Good selection of third party streaming content apps and services available.Share content and library with Kindle Fire HDX (HD? not sure).CONS:Not quite the best selection of third party streaming content, Roku 3 edges it out here.If you do not have Amazon Prime and do not want that you probably don't want the Fire TV.If you have no interest in android gaming you probably won't get full use out of this.If you have no mouth and must scream, well, the voice control may not do much for you, either.Controller is additional cost that a lot of people may pass which may lessen game developer interest in the platform.No really easy way to filter out paid content from Amazon versus free Prime content, I want a way to only see the free stuff.The BOTTOM LINE:If you are invested in Amazon already, this is a no-brainer addition to your toy box. Your Kindle stuff will work on it, your Prime membership will be awesome with it, and your Amazon App store stuff will (partially) be supported on it (partially with plans from Amazon to have a lot more Fire TV conversions, they need to make sure the apps support the controller).If you have no investment or interest in Amazon's Kindle Fire line, Amazon Prime, or their App store library, then this is still a very solid piece of streaming hardware that outperforms the Roku 3, but does not quite have the content advantage, which could be an ever-moving-target anyway in the world of streaming. Maybe just wait and see if a clear winner happens or pick one and be happy.", "verified": true, "helpfulness": "2/2", "author": "knight37 \"knight37\""}, {"rating": 3.0, "review": "Excellent access and streaming to Amazon prime video content, tried a few games which were mildly entertaining (not a gamer so just browsed them for testing purposes).  Attempting to search for non prime content such as you tube videos was a frustrating endeavor and quickly abandoned, easy to find what I was looking for on my PC not so much with the Fire TV search.", "verified": true, "helpfulness": "1/1", "author": "azblue"}, {"rating": 5.0, "review": "I highly recommend it! This could be the next big thing! Amazon Fire TV > Apple T.V  any day baby!!!", "verified": false, "helpfulness": "0/0", "author": "Christine Lau"}, {"rating": 5.0, "review": "I had had the Chromecast for months now. Not being able to watch Amazon Instant Videos through it was disappointing, so I bought a Kindle Fire. I enjoy watching on my Fire, but still wished I could watch on my big screen TV. I then saw the ad for Amazon Fire TV. I can now watch all the Amazon Prime movies, Netflix, and Hulu Plus! Haven't had cable in years and now with Amazon Fire TV, I definitely don't need it!", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"classics fan\""}, {"rating": 1.0, "review": "Unusable unless you are right next to the remote.  There is no IR control, no IP control and no RS232 (serial) control at all.Will not work for any whole home set up or any set up where the TV and receiver are not in the same room.Would not suggest anyone purchase this product until they fix this and work out the bugs in the system.", "verified": true, "helpfulness": "5/17", "author": "Modes"}, {"rating": 3.0, "review": "Speed is not instant, but better than Roku 3.  Very hard to get out of box,  took multiple trys to download update, when it did it took 30 minutes.  Very few apps worthwhile, even had to actually download Netflix, it is not preloaded.  Netflix does work for me as good as on Roku 3, but the app itself is not as good.At this point I do like the way the Rokus work much better.  The faster speed of the Fire is really the only plus for me. I do think the future of the Fire is great. I like looks and feel of the unit, but don't like the click on the remote or the location of the Home button.  The menu & settings are no where near as good as Roku.  I have no issues with finding or using Prime like other have mentioned.I really wanted to love the Fire and get it 5 stars, but at this point giving it 4 is pushing it.I do have 2 Roku 3, a Roku Stick, 4 other Rokus.  I have read many reviews, but most of what others are using this unit for is over my head.  All I need it for is streaming.Having said all this I must say, my Internet is dsl 3.0 thats my only choice in my rural location.  I do not have any buffering issues with my Roku once cthey get started.", "verified": true, "helpfulness": "3/3", "author": "dcbag"}, {"rating": 3.0, "review": "I've owned every version of the Roku, Apple TV's and I've recently purchased the Fire TV.Navigation and Layout  The Roku 3's simple and modifiable navigation screen is the best hands down.  I can add or remove a channel from the main screen with ease and it reduces the clutter.  Fire TV is categorized and really frustrates efforts finding anything (such as MY INSTANT VIDEOS) in comparison.  Its not HARD.  Its just not as clean as the Roku.  The Apple TV is stuck to whatever they allow you to have access to.  Both the Fire TV and Roku allow you to add and remove.  Apple TV does not.  I give the Roku a 5, Fire TV a 3 and the Apple TV a 1.5 (yes, its easy to navigate...just limited).GamesRoku has a handful of games and a motion sensor, but the Fire TV games are amazingly better.  Forget talking Apple TV on games.  I give the Roku a 2 (some nostalgic games and motion sensor for Angry Birds) and the Fire TV a 5.SearchFire TV has voice control...but I'm not impressed.  If I want to find a movie, that's great, but again, its not a clean navigation.  Roku will search other services (Amazon, Netflix, Hulu, Crackle...wherever it is) and list its price and availability.  I give the Fire TV a 2.5 and the Roku a 5.  Apple TV doesn't rank (btw, I'm a fan of the iPad and iPhone).StabilityRoku will restart on its own every couple of weeks and it loses its icon cache on occasion (quick return to the menu and back and its there).  It is slower at boot (but entertaining).  Overall though, its stable.  The FireTV is new so it will take a bit more time, but it caches the wrong movies in my instant movies (a movie with the same name) but I'm sure they'll fix that.  The Kindle fire has issues with second screen (won't connect)...but overall it seems the unit is pretty stable.Overall, I'd give the Apple a 1 - only because it allows me to connect my iPad (which I rarely do), The FireTV a 3.5 (so far) - because of its speed and some of its content and the Roku I give a 4.5 because I consider its ease of use and search feature to be top notch.But I'm sure the Fire TV will improve as it matures.", "verified": true, "helpfulness": "3/3", "author": "Don K. Riess \"devon_7\""}, {"rating": 5.0, "review": "We ordered the Amazon Fire TV as a way to eventually get rid of DirecTV. We bought one for now, but potentially we will buy more for the other TV's in the house. Since we ordered it with our amazon account it came programed, that was awesome. It is very easy to use, I really enjoy the voice command feature instead of having to type in a name or title to search.Update 4/28/14Last week we ordered 2 more boxes, for a total of 3. Today we disconnected our DirecTV service, saving $1600 a year. We have subscriptions to Hulu Plus, Netflix, and Amazon Prime. We have found between those 3 services we get all of our needs met. The BIG thing I would love to see Amazon improve on is the programing that is free for Prime members instead of having to hunt for it.", "verified": true, "helpfulness": "3/3", "author": "Shiovahn"}, {"rating": 5.0, "review": "what a great addition to my media center.  I have just opened a world of possibilities.  The games are a lot of fun also. Very pleased with this purchase.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}]