[{"rating": 5.0, "review": "Item works as advertised. It was super easy to set up. There are a few small glitches, but they can be worked through.", "verified": true, "helpfulness": "0/0", "author": "kollase"}, {"rating": 5.0, "review": "Loving my Chromecast.Got it set up within a minute using my laptop, just had to click a couple buttons and done. And now it just works.Using Youtube and Google Music apps on my 2013 Nexus 7 casting onto the TV. No Netflix in Australia without a lot of work.Hoping sometime Google will open up local content to stream to the Chromecast, and let other apps use it too, so far Google seems to be taking their time. At the moment, it's the easiest and best way to use Youtube and Google Play on the TV.", "verified": true, "helpfulness": "0/0", "author": "Jay"}, {"rating": 5.0, "review": "Chromecast is super simple to set up, the instructions are extremely simple and straightforward, the rest happens quite magically.I've had this product for about a month now and enjoy using it with Netflix on my phone, tablet, and laptop, have also used it to play a few YouTube videos. I haven't tried streaming music through Google Play Music yet, and have only played with casting my chrome browser, haven't had a real need for it yet.I have noticed a few issues in quality of the stream from time to time, but it usually resolves itself quickly. Another thing to note about Chromecast is that it does put out a constant stream. One of my TVs only has one HDMI input, so I use an automatic HDMI switch.  Chromecast and Verizon FiOS put out constant streams, so the switch's automatic feature doesn't work well, requiring me to press a button on the switch to manually change inputs. On my other TV which has multiple HDMI inputs built in, I have no issues, just change the input with the TV remote.One of the great things about this product is that it doesn't stream from your personal device (phone, tablet, computer) which would drain the battery, instead, it streams directly to Chromecast and allows you to control (play/pause/scrub) from your personal device.I would recommend this product, because it's simple and it works. In fact, as I type, my mom who is retired is casting a YouTube video from her phone.", "verified": true, "helpfulness": "0/0", "author": "Roshan B"}, {"rating": 4.0, "review": "It's a great product that works exactly as described.  Looking forward to support of more apps, and possibly local content.", "verified": true, "helpfulness": "0/0", "author": "TXKSSnapper"}, {"rating": 5.0, "review": "I have used this with Android phone, Apple phone, Surface, and iPad.  They all work!  You can pause it from your device while it's playing.  Here is a great review that describes the features well:  [...]", "verified": false, "helpfulness": "0/0", "author": "johnP"}, {"rating": 1.0, "review": "My HDMI port wore out on my laptop so I bought this incomplete piece of crap. I've used it for a few weeks now and it's usable,but limited.Many small bugs and the text is blurry on the TV.", "verified": true, "helpfulness": "1/3", "author": "Scott Wood"}, {"rating": 1.0, "review": "Chromecast is such a great idea......except when it falls in the hands of a control freak that controls everything but their design and quality. Google is basically using us as guinea pigs for product research and market research while having us finance that research.I was debating if it should be a 1 or 2 star review. I think I would have preferred 1.5 stars, since it's not totally useless.1. Netflix and youtube work: Surprise, something actually works. It doesn't work all that well. Half of the time, my android netflix doesn't even have cast enabled. It actually works better on the iphone. Youtube is in the same boat, but in slightly worse shape. It's difficult to use in android and in ios. And again, on the adroid, it doesn't get \"Cast\" half of the time.2. Setup.....the worst designed setup procedure of anything I have ever purchased. I swear that even my made in china treadmill with god knows what manual was easier to set up. If you have more than 1 wireless router in your house, you may be screwed. If you are able to, turn them all off except for one. Hopefully you can get it within the range of the chromecast dongle and whatever the device you use to set it up......and no, setup only works from chrome.3. Streaming from chrome......it also works but at lower resolution and it freezes and crashes all the time. Think first gen android.4. Stonewalling developers...that's why when someone comes up with an app to support local content streaming that just about everyone wants, Google goes and breaks it. The worst of all, they flat out lie about it. Google, how dumb do you think we are? We know you want the control, just admit it.5. I don't know how long it's going to last, but it runs very hot. I don't think it knows when and how to turn itself off. Even if your TV is off, this thing is still cranking out heat. I probably is too small to affect your electricity bill, but it can't last too long with the kind of careless design that constantly running at a high temperature even when it's not supposedly in use.All in all, it's a poor man's roku box that just doesn't work too well. If you got it for 11 bucks, you might as well keep it. If you paid $35, I feel for you. We got ripped off.", "verified": true, "helpfulness": "1/3", "author": "Da Pig"}, {"rating": 4.0, "review": "I see more than one thousand reviews are here. Let me keep this simple. I don't have a netflix account neither i use google video&music.; I watch some youtubes but those are short clips. I do watch amazon prime videos but no chromecast apps are available for that. Still, as you know, these is a way though.When you set up your chromecast, wifi connection is required even if you are using the wired lan cable. Here is the point.WIFI IS NOT REQUIRED AFTER THE INITIAL SETUP.The reason casting your chrome browser lags is this. When casting youtube, it's pretty much the dongle that is doing most of the job. That's why it works great. However, when you casting your browser, two way traffics are going on. That's why it lags. Most wireless connections are slower than wired lan. Well some hi-tech wireless would certainly beat wired but that's not for many of us. Then, if we can make at least one way faster, we can assume that casting with your browser would be much better.(I assume you know how to do it. 1)Get the chrome browser for PC 2) download the extension named as google cast 3) put folder's path on the browser 4) browse and run the file 5) click the extension on the right top and cast 6)if you are just casting the screen of your chrome then you don't need 3)and4))Okay, once I set up, I took off my wifi usb adapter for my desktop and connect it with lan cable. Nothing fancy, just a simple cat5e cable. Do I have an expensive router? No way. Mine is refurbished Cisco Valet M20. Got it less than $20.My computer is a bit high-tech. But I assume it doesn't matter since my laptop returned the same result.The difference is huge. With two-way WIFI, I can't even make it with high 720p option on the chrome browser. The amazon video lags so bad that I had to set it to 480p. Playing local video files was worse. I played 2 gb 720p mkv file just FYI.With wired and WIFI, it works great. I would say it's 90% perfect. With wired cable, I can set it to extreme 720p and it still works great. NO lags whatsoever. amazon prime videos or local media files. Since I don't have 1080p files in my HDD, I couldn't test it. However, 720p mkv file worked just great. This means ANY STREAMING on your PC chrome will cast to your tv with the dongle without lagging. hulu, hbo, vemeo.. you just name it.I know the chromcast app on your PC will still ask for wifi connection. However, it works without it as long as you are connected to the same router.Well, hope this helps for those non-netflix users but still thinking about buying this.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I've had this device for over a month& get nothing from it .complete run around. On tech support.Not user friendly!!!!", "verified": true, "helpfulness": "0/2", "author": "Dennis Shaw"}, {"rating": 4.0, "review": "So far, the Chromecast has been extremely useful in my apartment with 5 roommates and two TVs.  It works excellently with Netflix and YouTube after the initial setup (very simple and quick).  The quality is great and can be changed from 720p high bitrate to 720p low bitrate or 480p in order to accommodate slower connections.  Tab Casting works relatively well, but is dependent on having your computer do the streaming (rather than from the server end in the case of Netflix, YouTube or Play Store).  Can't wait to have other services such as HBOgo and whatnot join in.", "verified": true, "helpfulness": "0/0", "author": "Sudsington"}]