[{"rating": 4.0, "review": "Works as expected.", "verified": true, "helpfulness": "0/0", "author": "D. Att"}, {"rating": 5.0, "review": "Excellent items and excellent sealer.", "verified": true, "helpfulness": "0/0", "author": "Abdlmohsen A."}, {"rating": 5.0, "review": "If you know how to utilize a Chromecast and take advantage of everything that it has to offer then by all means go ahead and purchase one. I got one for myself when they first came out and last year gave them out as Christmas presents to everyone in my life that I know is tech-y that regularly streams movies, had a laptop plugged into their TV with an HDMI cable or enjoys sharing photos or videos off their phone. If you know anyone that does any of the aforementioned things then this is the perfect present for them, you might have to walk them through it at first but it makes life a whole lot easier when it comes to mirroring off laptops, streaming or sharing things with others.", "verified": true, "helpfulness": "0/0", "author": "CTM22"}, {"rating": 5.0, "review": "Just perfect now i can stream movies and videos great price thank u guys...5 stars", "verified": true, "helpfulness": "0/0", "author": "omar a martinez"}, {"rating": 5.0, "review": "When Igot my first one it was as a cheap alternative to roku.  I quickly realized it does more and I like it better. A must own for every tv in your home.  Even smart tvs.", "verified": false, "helpfulness": "1/1", "author": "Elisabeth Rockwell"}, {"rating": 5.0, "review": "Fast shipping and hassle free ordering! Great product! Will order again!", "verified": true, "helpfulness": "0/0", "author": "David McCarthy"}, {"rating": 1.0, "review": "not compatible with a PC only system", "verified": false, "helpfulness": "0/1", "author": "99 I Love You \"dabman\""}, {"rating": 3.0, "review": "I wish chromecast worked on more platforms and applications. Windows USB device is far superior to this.", "verified": true, "helpfulness": "0/0", "author": "Ashu"}, {"rating": 5.0, "review": "Great, loved it", "verified": true, "helpfulness": "0/0", "author": "TJ"}, {"rating": 5.0, "review": "OMG  what a cool toy.  I love it.  My son came over and his Iphone found it before I even told him had it.", "verified": true, "helpfulness": "0/0", "author": "isadore"}]