[{"rating": 5.0, "review": "I recently purchased a Google Chromecast device for my techie boyfriend and I wanted to share his findings and thoughts.The challenge of getting audio and video from a computer to a monitor has always required specialized cabling with length limitations, and the challenges are even greater with tablets and smart devices.  However, if a reliable 802.11g wireless connection is available, the Chromecast device becomes a component of your network, the wireless signal becomes your cabling, and certain devices on the network become Chromecast aware, capable of handing off the job of displaying a/v content from the computer monitor to the HDMI-capable TV.Currently, Netflix and YouTube are the only services that are Chromecast-ready, but I’m betting more will jump on the bandwagon.  However, running the Chrome browser and selecting to Chromecast a specific tab works incredibly well.  I’m watching and listening to Tom Petty videos as I type, and there’s zero choppiness or buffering.  Excellent quality requires excellent wireless, which I have here.For only $35, this device is awesome, and should be a part of anybody’s wireless network.  It could be used for any situation that requires displaying audio and video to one or more flat panel TV monitors.  Imagine the possibilities, the ease of implementing this technology, and the affordability!!  Add a couple inexpensive IP surveillance cameras and you would have a surveillance system that can be watched wirelessly on TV or computer.I would give this device more than five stars if I could!  Totally recommended.", "verified": true, "helpfulness": "0/0", "author": "Sparkle Plenty \"Flamingo Queen\""}, {"rating": 5.0, "review": "Thanks you so much, really a great product that just need more apps.  (for now only netflix, music and chrome from pc)", "verified": true, "helpfulness": "0/0", "author": "Ilmnetwork \"iLMNETWORK\""}, {"rating": 5.0, "review": "Good unit and function very well.  Only complain is not enough applications supporting it except YouTube yet.  I wish it can support Miracast as well but not sure the protocals can co-exist.", "verified": true, "helpfulness": "0/0", "author": "Misty"}, {"rating": 3.0, "review": "I really like the price and the quality of this product. Easy installation. Only catch is that you can't use it for anything but YouTube (all devices) or Google Chrome (PC only). That's too limited. It would have been awesome if I could use it to just project my phone\\PC screen into the TV.", "verified": true, "helpfulness": "1/1", "author": "Ali BaderEddin"}, {"rating": 5.0, "review": "This is a no brainer. Was able to install quickly with no issues. Immediately after I installed this thing, my brother sent me a YouTube link via text. I was able to immediate view it on my big screen television. Will only get better with time.", "verified": true, "helpfulness": "0/0", "author": "Jose Cervantes"}, {"rating": 5.0, "review": "I love this gadget.  Compact high-quality and functional at an unbeatable price.  I highly recommend Chromecast And I love all things Google", "verified": true, "helpfulness": "0/1", "author": "Michele A. Franklin"}, {"rating": 4.0, "review": "I finally decided to try Google Chrome... It is very easy to set up, installed app on my tablet and in no time I was streaming from Youtube.  My only issue with Google Chrome, as many have mentioned, is that streaming is limited to Netflix, Hulu and Youtube basically.  I have Amazon Prime, and do not have Hulu account or Netflix.", "verified": true, "helpfulness": "1/1", "author": "Peggy \"Amazon all the way!\""}, {"rating": 1.0, "review": "This produck SUCK, no app, no devloper freedom, i dont understand the sense of this product... Google would be refound my money", "verified": true, "helpfulness": "0/5", "author": "Vladimir Monsanto"}, {"rating": 5.0, "review": "So much for so little!!!  This will be your go to device for all movie watching experience.  You will enjoy the easy to install and set, that's it.", "verified": true, "helpfulness": "1/2", "author": "BCM"}, {"rating": 4.0, "review": "I've been using it for two days now and it works well.I'm using an old smartphone (connected to my Wi-Fi, with no cell service) as a remote control. Interesting that it's not a remote control in a regular sense - you don't need to point it at the TV. For example, I start the Netflix app on that phone, choose the movie or show to play, and press the Cast button instead of Play. It sends instructions over the Internet to Netflix to send the show to the Chromecast device attached to my TV, So the phone (remote control) and Chromecast communicate via the Internet, not directly. It's been very reliable. Theoretically, I could be in another city and use my phone to start casting a show to my home TV (if it was turned on). Maybe if I had a dog at home and wanted to entertain it... It may be good for tech support of gadget-challenged relatives. You can control their casting remotely when they get stuck.I'm giving it 4 stars and not 5, because it supports a limited number of channels. If you only use Netflix, HBO GO, or Hulu Plus, then you are fine. There's also Google Play. But you can't cast Amazon Instant Video or many other services that Roku or other streaming players support. I got this Chromecast player for one of the TV's on which I'll be fine with a limited choice of channels and I'll continue using Roku on other TVs.On the plus side, it's cheaper than other players and easy to install and activate.If your TV has a USB port, then you just plug the device to the HDMI port and the USB port on the TV and it's neat and hidden from view. If the TV doesn't have a USB port, then you can plug it into a regular electrical outlet through a converter (which is included).", "verified": true, "helpfulness": "0/0", "author": "Andrew in Illinois \"Andrew\""}]