[{"rating": 4.0, "review": "Tiny, discrete, easy to setup. Very powerful with Chrome tab extension from a computer but doesn't have as many apps as the Apple TV... Great \"toy\" for a very cheap price though. Let's hope they'll develop more applications compatible from other Android devices.", "verified": true, "helpfulness": "2/3", "author": "J"}, {"rating": 3.0, "review": "I rated it three stars because:1) It needs a power supply (another cable, ugh), my TV didnt have USB input, product page didnt spell that out at all.2) It can basically only stream chrome browser, it needs to be able to stream divx video to be worthwhile.  If there was a decent chrome browser plugin for that (key word : decent) it would annihilate #1 and be worth 4 out of 5.Three stars only cuz it was so cheap.", "verified": true, "helpfulness": "1/3", "author": "stimmedcows"}, {"rating": 4.0, "review": "It works great. Wonderful picture quality. The easiest set up.Just wish there was more apps available, like Amazon Instant Video.", "verified": true, "helpfulness": "0/0", "author": "Scorp10101"}, {"rating": 2.0, "review": "The chromecast stops working in the middle. Not sure what to look for to get a better reception. I passed my return window otherwise I would have returned it.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 1.0, "review": "I have Samsung Stratosphere 2 smartphone, an ASUS RT-n66u router, ASUS AE-n66 repeater, and an HP laptop running Windows 8 with Intel i3 cpu. The chromecast software installed fine on my laptop but it would not cast from Google Chrome to my tv.", "verified": false, "helpfulness": "5/7", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I have had the Chromecast for a month now.So far I have streamed with Chromcast with my Android tablet and my laptop using the chrome browser or the Chromecast plugin.  The set up is simple. It is similar to connecting your device via Bluetooth.  Streaming Netflix, Pandora, Hulu +, and Youtube has been smooth.  I have connected my Chromecast to my WiFi network and added my laptop and tablet as my supported devices.The device is a simple USB device (I assume is to power the device via the TV) and you are provided the option to use the provided HDMI wire or the AC power cord that is also provided.  The simplest connection, at least for me, was using the HMDI wire.Things to consider, if you don't use a majority of the supported apps I do not recommend getting this device.Also, I have seen others ask whether or not this device syncs or can connect with their receiver.  This is a fair question.  I was wondering about this too.  I was worried using the device will not allow me to utilize my surround sound that was managed by my receiver and I would reluctantly have to use the speakers on my TV or figure out some way to connect the audio that was to be streamed.  Luckily, when testing the device the audio instantly, automatically, came from my surround sound speakers.  I did not have to do a thing.  Now, I can't say that this could be applied for all receivers, but as this device can connect to your TV via HDMI, if your TV is connected to your receiver than audio thru you receiver shouldn't be a problem.  Again, I am not sure if this works with all receivers.  This is only my logic.Another thing to consider, I am not sure if other users have mentioned this detail.  I have discovered that using Chromecast requires a great deal of broadband as it must be connected with your home network and then synced with your device.  Streaming requires a lot of data.  So if your contract with your ISP does not cover a great deal of data/broadband than you will find yourself frustrated and feel like you're back in the early internet stages when streaming was interrupted by buffering.Also, from my experience while using the device, you can simultaneously stream the content you selected on your device (your laptop, tablet, or phone) and perform other tasks, whatever they may be, without interruption.One thing to keep in mind, once you have selected content to stream, Chromecast will continue to stream it without interruption unless you are having internet issues or discontinue the stream.Let me explain further, I was streaming a youtube playlist via my laptop to the Chromecast device. To test the integrity of the product, I shutdown my laptop assuming this will interrupt my streaming, however it did not.  The playlist continued to play, despite the fact that my laptop was off.  I thought this was cool at first until I was done watching and then turned off my television.  A few minute later, when I turned the TV back on, my playlist was still playing.  It did not pause or was interrupted, the data was still streaming.To solve this I attempted to 'shutdown' the Chromecast device, but the best way that worked for me, was to completely remove the device from the TV.  So now, when I am not using the device, I disconnect it.  Another reason is because when using the internet on any of my synced devices, although I had no desire to stream it truly slowed down my connection, even though I had removed the Chromecast plugin from my Chromebrowser.If you're someone who uses the internet  a lot or one that likes to reserve energy, keep this in mind.  However, the device works well, I truly am looking forward to when Chromecast will be compatible with other apps.  Like Amazon Prime, DramaFever, Spotify, who knows.", "verified": true, "helpfulness": "5/6", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Greatest.  Thing.  Ever.  Will continue to get better as more apps are added for it.  Google is hosting a Chromecast hackathon next week and from that we'll start seeing a bunch more ways to use this device.  Check out info online if you'd like to learn more about what to expect.  In the meantime, Hulu Plus, YouTube, Netflix, Pandora and casting any tab in Chrome to your TV monitor is what's natively available.  I actually just watched a basketball game tonight full screen on my TV through the Chromecast, however, and that was broadcast on ESPN3.com.  Worked very well.  This is unbeatable at the $35 price, and once the anticipated future apps are added soon, it will become a steal.", "verified": true, "helpfulness": "2/2", "author": "Joe D."}, {"rating": 5.0, "review": "Bought this on pure potential, youtube streaming now is a bonus. This device has soo much potential the things that it does now is in beta but works seamlessly.Con: no streaming youtube directly from the web browser on ios.no streaming of videos on websites such as watchdub", "verified": true, "helpfulness": "1/1", "author": "TankCCR"}, {"rating": 1.0, "review": "Does nothing but say \"ready to cast\" All connections are right. Video's available and youtube but nothing shows on my TV. A piece of junk nicely packaged.", "verified": true, "helpfulness": "4/6", "author": "Higrade"}, {"rating": 5.0, "review": "The Chromecast works exactly as promised. It streams Netflix, YouTube and Pandora. More options will likely be added. Then it will be even more valuable.", "verified": true, "helpfulness": "1/1", "author": "Technophile"}]