[{"rating": 3.0, "review": "Like many others have said, it’s pretty limited.  The quality is ok, but being limited to Chrome only is a drag.  Using Apple TV with 3rd party products is a more flexible and better quality solution for Windows PC's.", "verified": true, "helpfulness": "0/1", "author": "Mr. Mc"}, {"rating": 5.0, "review": "This useful little gadget was a snap to set up and gives new functionality to my Macbook Pro, my iPad and my iPhone. You install it on a free HDMI port on your TV, download the app to your computer, and Bob's your uncle. Now anything I see within Chrome I can see on my TV. And of course, being a Google product, all YouTube videos are visible on my TV as well. I fired up YouTube on my iPhone and there were the videos on my big screen. Have videos in your hard drive? Use \"Open File\" on Chrome, run the videos within the browser, and they're on your big screen as well. The sound comes through loud and clear. All this for $35. Thank you, Google!", "verified": true, "helpfulness": "0/0", "author": "Roberto Lebron \"Author of Raising Children on Planet Earth\""}, {"rating": 5.0, "review": "Followed the instructions which came in the package and it worked great right out of the box. I have tested my laptop, iPod and iPhone - could not find an App for Blackberry.", "verified": true, "helpfulness": "0/0", "author": "GoPSU"}, {"rating": 5.0, "review": "I was searching for this product because I own an Xbox and wanted to watch Netflix and youtube on my TV. However, It's a pain to have to pay for monthly XBox Gold Membership to use these apps on XBox server. This product is relatively cheap compared to Apple TV and other Microsoft devices that costs $99.00 not including cables and HDMI connector. The package arrived on time, the box was tiny and had everything that I would need to connect it to my TV, including the Chromecast itself, a charger (if your TV doesn't have a USB outlet) to charge the Chromecast, an HDMI cable (this supposingly boost your wifi reception and in case the Chromecast did not fit directly in your TV). Set up was very easy. I plug the devices in, turn on my laptop and download the Chromecast app. Install and set up took about 10 mins total. If you want to control Chromecast on your phone on Netflix and Youtube, there's an icon to press and it shows option to watch on your iphone or stream on TV. Super easy to use and navigate. Did exaclty what I bought it for: streaming my Netflix shows on TV. Only draw-back is on Netflix, you have to manually start a new episode, it doesn't automatically starts like on your laptop. Overall, I love it.", "verified": true, "helpfulness": "0/0", "author": "T. Hoang"}, {"rating": 5.0, "review": "Works great if you have a tablet, or a place to charge your phone near your TV. Otherwise you'll be frustrated when your phone is dying and then you have no alternate means of controlling your Chromecast. Other than that, this device works amazingly well. Must buy if you don't have a smart TV.", "verified": true, "helpfulness": "0/0", "author": "sonictt1"}, {"rating": 1.0, "review": "If you are a Verizon FIOS customer and you are NOT a techy person - DONT BUY THIS!!. Make sure you try seting up this device on a laptop, phone or desktop. If one doesnt work and connection is not establised - try another one. I had to try 3 different laptops. 3rd one was a charm after I changed the configuration on the router.If you have a Verizon Actiontech router you need to enable UNPN and disable IGMP. When you call Verizon - they will not help you. Menus to these items are disabled on the router. Even verizon tech will not now where they are. After a long search here is a workaround. You have to enable UNPS it with this link http://192.168.1.1/index.cgi?active_page=900 and you have to disable IGMP with this link http://192.168.1.1/index.cgi?active_page=6059. If that doesnt work then you are on your own. It tooke me a good 2 hrs or reasearch, 1hr wasted with stupid verizon tech that didnt help me a bit. Calling actiontech will not help you either.", "verified": false, "helpfulness": "2/3", "author": "Doktorek \"Doktorek\""}, {"rating": 5.0, "review": "Google Chromecast works as described.  I'm very excited to have it.  I use it to watch Netflix.  It its an affordable alternative to other devices.", "verified": true, "helpfulness": "0/0", "author": "Amanda Brooks"}, {"rating": 5.0, "review": "Hidden gem of digital streaming i love this little device works great, i stream movies off my PC HDD right to the TV", "verified": true, "helpfulness": "0/0", "author": "spuds420"}, {"rating": 5.0, "review": "I give it 5 stars as it just plugs in and takes you the steps to installed in less than 5 minutes. Works with any phone and on multiple devices. I highly recommend it if you are a Netflix user.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The Google Chromecast is cheap in price, simple to use, and streams in HD for crystal clear picture.I was dubious at first having used the roku box and Apple TV-both of which are a pale comparison to the Chromecast. With some external programs you can stream anything from your computer or tablet/smartphone.Love it. Add more programming and this will continue to get better.", "verified": true, "helpfulness": "0/0", "author": "Jason Duncan \"Gamer by day, Batman by night.\""}]