[{"rating": 1.0, "review": "Product would not connect to U-Verse. That would be fine if there was ANY support.  There is no support, don't buy the product unless you are ready to send it back if it does not work.  I know someone who loves the product because it connected to their internet.  If it works, I guess it is a great product, but it did not work for me.", "verified": true, "helpfulness": "0/3", "author": "Chadd Ridenour"}, {"rating": 5.0, "review": "Exceeded my expectations. Plex, YouTube, screencasting, Google Play casting... It does it all. The only slight disappointment is there is occasionally a few second lag between my device and the chromecast, but it's bearable and possibly due to other factors.", "verified": true, "helpfulness": "0/0", "author": "M. Malek"}, {"rating": 5.0, "review": "Great product for me and I love the screen pictures when you not playing a movie. Beautiful.", "verified": true, "helpfulness": "0/0", "author": "Cishma"}, {"rating": 4.0, "review": "Works good.  I think they could do a lot more with it but for a cheap streaming device I am happy with it.  If you are looking to stream your own content and not netflix or hulu I would consider something else.", "verified": true, "helpfulness": "0/0", "author": "stephen"}, {"rating": 5.0, "review": "I'm quite the fan of google products, and this one is a nice addition.  Haven't had any issues, here's to hoping Google get even more app compatibility!", "verified": true, "helpfulness": "0/0", "author": "Shannon Flinders"}, {"rating": 1.0, "review": "Is anybody aware if the bug has been fixed for Apple iOS?  I've had it for days and can't get it set up via my iMac/Airport Express-iPad or iPhone.  Any suggestions?  Or, should I try their customer service or tech folks?", "verified": true, "helpfulness": "0/2", "author": "J. Robertson \"telljr\""}, {"rating": 5.0, "review": "Love it. So easy to get setup. Now I can take my Netflix with me when traveling and cast it to the TV. I wish I had purchased it sooner.", "verified": true, "helpfulness": "0/0", "author": "Janice"}, {"rating": 5.0, "review": "Remarkably easy to set up. You'll need compatible apps, like the Netflix app, the Youtube app, the cCrackle app, etc. But after you have that it's as easy as clicking the icon.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 5.0, "review": "I am very pleased. I have used it to watch Netflix with my Kindle Fire as a controller. For just about everything else, PBS, MSNBC, etc I cast from my desktop and it works great for me.", "verified": true, "helpfulness": "0/0", "author": "Mark L. Swisshelm"}, {"rating": 3.0, "review": "Have had a lot of problems with this, one day it works the next day it doesn't. Could be a router issue (Verizon FIOS router) but I implemented every recommended setting for my particular router/setup. When it does work it is awesome.", "verified": true, "helpfulness": "0/1", "author": "Person who bought stuff"}]