[{"rating": 1.0, "review": "I did everything the directions told me to do, followed it to a T and my laptop still won't cast. My husband was able to get his smartphone to work with it, but because of limited storage on a phone he can't keep the app on there. Very frustrated in constantly throwing my money into things on amazon that don't work.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Home School Mother of 2\""}, {"rating": 4.0, "review": "This worked as expected.  It took me a bit to figure out how to launch my \"apps' on chromecast once downloaded it, but I was able to muster through it.  Like the title implies, for the price this product is wonderful.  It lived up to my expectations.", "verified": true, "helpfulness": "0/0", "author": "Beth S. Scott"}, {"rating": 3.0, "review": "I had a computer hooked up to my television for playing media, but Chromecast frees up that computer by filling in that primary need.There are a few limitations, and it's still early days for its app development and support. I look forward to seeing how this thing grows.I primarily use it to stream Netflix and youtube playlists from my tablet, and local files from my computer through the (relatively) new chrome extension. Nobody seems to be writing about it, but the extension helps the local file play at a reasonable rate (it used to lag when played through chrome all alone). I believe it only supports mp4s at this time, but there are other third-party applications that are supposed to free this up.However, streaming youtube from mobile devices means that you are locked out from certain content, and I have lost a significant amount of control in my media by using this.For $30, it's definitely worth a try- but it really depends on how much future support this dongle receives that will make it a staple in my house. This product could be a solution to home media, but it could also just get completely nerfed by other companies' interests to be worthwhile.", "verified": true, "helpfulness": "0/0", "author": "Geoffrey P Smith"}, {"rating": 5.0, "review": "Easy to set up!Computer in and HDMI stick! Crazy!Connect from any Android device in your network.Several apps supported already, ex: Netflix (works like a charm)Code was just released so more app support on the way, including Vudu!Misconception about the dongle, it's not streaming Netflix from your phone or tablet when you cast it.Your Android device is telling the Chromecast dongle to go out to the web and load this web app and play the video.So your Android device is basically just nice remote control.The only time it's actually streaming media is if the media, like a family movie recorded from your phone, is on the phones memory and you're streaming it. (hope that made sense, lol)I can also stream media from my home NAS synology server and it works like a charm!Sadly MKV format is not supported at this time. but I'm sure that wont last much longer w/that code release.It NEVER freezes!the pix that are cycling when no media is being streamed are nice and changed.It's very easy to use and I can control what my kids watch from any room in my house.You can turn volume up and down as well.This is just a great product, once more video/audio codec's are supported this will replace my huge PC I'm using as an HTPC.Great product for only $35! You can't beat that IMO.Help this information helps. Cheers!*** UPDATE... Nothing really, just wanted to say this thing still rocks!I have a few other streaming dongles and set top boxes that I use in other TV's and what not.But what I want to add is that this Chromecast is used almost every single day and never has it locked! Not even once as apposed to every other dongle and set top box that does lock up all the time.Now that DEV kit is released I can't wait to see what else is added, support wise. Cheers!", "verified": true, "helpfulness": "0/0", "author": "1m2"}, {"rating": 5.0, "review": "I've use this Chromecast for a little while now, and I love it. I can cast Netflix, Hulu Plus, but not Crackle which I like. I then bought a book on how to use this device, and it show me how useful Chromecast is. It showed me work arounds to issues like not casting Crakle, and other things that Chromecast didn't do. It's a steal for the money.", "verified": true, "helpfulness": "0/0", "author": "James Hogue \"James W. Hogue\""}, {"rating": 5.0, "review": "This product was exactly what i expected it to be. No surprises. Excellent quality product and the Product was received on-time.", "verified": true, "helpfulness": "0/0", "author": "Richard Baker"}, {"rating": 5.0, "review": "Finally, Google releases what we always needed. Smart TV functionality without the price tag of a Smart TV. Easy as:1. Open Netflix app on your smartphone.2. Tap your selected show to start watching.3. Tap on the cast icon on the top right of the screen.Boom. Now you have Netflix on your TV. Not to mention the other apps that work great (keep in mind you have to pay for each services separately): Hulu Plus, HBO To Go, Google Play Movies and Music. Great Job Google; I love to know that someone out there is reaching their customers with a great price and great value for really cool stuff.", "verified": true, "helpfulness": "0/0", "author": "laszlo Kecskes"}, {"rating": 5.0, "review": "I had comcast who routinely liked charging me well over our agreed upon monthly price for no-good reason.  I got this and canceled my cable with them.  Best decision ever.  Not only do I get to watch what I want when I want to (obviously netflix and hulu have more options than On Demand) but I can use my phone as a remote.  Only downside is I wish Amazon Instant Video was supported.", "verified": true, "helpfulness": "0/0", "author": "Melissa Barwick"}, {"rating": 5.0, "review": "We love the ability to stream from computer to the TV, not only Netflix, but also Ted talks and technical videos.  It has transformed our evening TV viewing from the unendurable 20-minutes-per-half-hour of advertisements per 10 minutes of content to a much more reasonable, educational and enjoyable window on the world.", "verified": true, "helpfulness": "0/0", "author": "M. Thornberry \"grins\""}, {"rating": 4.0, "review": "Great Gift Item, not my personal cup of tea for a network device though. i would say moderate technical skills are required", "verified": true, "helpfulness": "0/0", "author": "iPodTouchMyself"}]