[{"rating": 5.0, "review": "Love it with a chromebook! So easy to show your computer on the t.v. and for an incredible price! Can't wait to see what's next!", "verified": true, "helpfulness": "0/0", "author": "Natalie R Regier"}, {"rating": 5.0, "review": "Best purchase I've made in the last 5 years. Truly amazing.", "verified": true, "helpfulness": "0/0", "author": "Tim"}, {"rating": 1.0, "review": "I give it a one star rating as an actual streaming media player, but a five star rating as a paper weight.  PLEASE buy if you enjoy diagnosing and configuring your hardware more than you do actually using.  Google really screwed the pooch on this one folks.  Why release a product with terrible known flaws and about a 27% operation rate.  What genius came up with that idea!  Give up a few more bucks and go for a ROKU or something that actually works the way intended.", "verified": true, "helpfulness": "0/1", "author": "Sean G Slone"}, {"rating": 4.0, "review": "Good.", "verified": true, "helpfulness": "0/0", "author": "Edmundo G."}, {"rating": 2.0, "review": "Out of about 6 attempts on different networks, the cromecast has only worked for me once.  Just states I need to change router settings with little to no indication or help on how to configure them.  I didnt have the time or patience to continue trying.", "verified": true, "helpfulness": "0/0", "author": "James OBrien"}, {"rating": 5.0, "review": "Google has done it again! These guys are definitely one of my favorite tech companies. I admit, the Chromecast wasn't quite what I expected. I assumed it would have an interface more like the Apple TV. Instead it interfaces with your computer or phone, so instead of you using your phone as a remote like you might on the Apple TV, you open your app on your phone, then choose to send it to the chromecast. The chromecast then picks up the stream off the net, so you can close your app and everything and continue to use your phone, even watch other things on it. In that sense it is superior to the Apple TV, it just takes getting used to. I set this up plugged it into a USB port on my TV and that provided enough power for it so I didn't even have to use the included power adapter. It also comes with a kind of floppy HDMI extender so you can plug it into your mounted TV, I was surprised and happy when I found that out.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 1.0, "review": "Pretty much drops connection all the time. Save your money", "verified": true, "helpfulness": "0/0", "author": "karen3678"}, {"rating": 5.0, "review": "Awesome !!!!!!!!!!!!!!!!!!!!!!!!!!!!! The smartest and bestest !!!", "verified": true, "helpfulness": "0/0", "author": "Mushka"}, {"rating": 5.0, "review": "I use it regularly.... It is so good", "verified": true, "helpfulness": "0/0", "author": "Ehsan"}, {"rating": 5.0, "review": "best $35 spent on any electronic streaming device!", "verified": true, "helpfulness": "0/0", "author": "Alexandra Pasquale \"Lexi\""}]