[{"rating": 5.0, "review": "Very good,", "verified": true, "helpfulness": "0/0", "author": "sarah"}, {"rating": 3.0, "review": "Not very stable.  Sometimes it loses connection with the streaming device in which you can no longer control your videos.Work around is to just que up a few at a time.", "verified": true, "helpfulness": "0/0", "author": "Average Jim"}, {"rating": 1.0, "review": "very limited use since I purchased 2 of these.  just not much you can do with them", "verified": true, "helpfulness": "0/0", "author": "Hector North"}, {"rating": 4.0, "review": "Really Fast Shipping!  The product is good , easy to connect on TV . We tested for a couple of months now and for some reason sometimes we are losing connection when watching clips on YouTube and also frizzed  my Tablet from time to time.  Everything else is working normally! Thanks", "verified": true, "helpfulness": "0/0", "author": "emiliya"}, {"rating": 5.0, "review": "These are amazing. I wish more Apple apps supported it but with Android or any computer it works great. I own two and plan on getting another two.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Quick"}, {"rating": 3.0, "review": "It's good but only one problem if I only said it to one in tonight I can't reactivated to another that's the only down fall for Google Chrome cast", "verified": true, "helpfulness": "0/0", "author": "Elijha Perez"}, {"rating": 5.0, "review": "For those who refuse to pay cable TV but can't live without internet, this is great!", "verified": true, "helpfulness": "0/0", "author": "AndreaC"}, {"rating": 5.0, "review": "Turns every TV into a smart TV or HD slideshow!  These little things are brilliant! My only complaint is that you can't use amazon instant video but that's not going to be possible,. This is better than the fire TV stick in the fact that you can control it from your phone and cast so many different things to your TV (netflix, hulu, youtube, etc.) I highly recommend this to anyone looking to improve their TV experience. Why spend extra money on a smart TV when you can get one of these?", "verified": true, "helpfulness": "0/0", "author": "Raymond L. Hebert"}, {"rating": 3.0, "review": "Eh! cuts out a lot and can't connect.  Great screen savers...eh!", "verified": true, "helpfulness": "0/0", "author": "Thomas Scimone"}, {"rating": 5.0, "review": "Works great and easy to use.", "verified": true, "helpfulness": "0/0", "author": "mrsjenkins2009"}]