[{"rating": 3.0, "review": "It is Ok.  This was not for me.  My brother wanted this for a while and so it was an easy choice for a birthday present.  I am not a big fan of streaming things via wireless in the house but it seemed to work well when I visited him last week.  It is a great device if you like to stream Netflix, Amazon Prime, and other apps and do not already have a smart tv or other device that will serve as an interface to stream these services (xbox, many blu-ray players).", "verified": true, "helpfulness": "0/0", "author": "budmax"}, {"rating": 3.0, "review": "While it works o.k., Using your smartphone instead of a remote is clunky and annoying. The phone \"sleeps\" after 5 minutes and it is simply too difficult to FF and rewind. I replaced it with a Roku. I'll use this for traveling in the future.", "verified": true, "helpfulness": "1/1", "author": "Christopher McMahon"}, {"rating": 4.0, "review": "Very happy I bought this.  Sometimes picture quality isn't perfect, specifically when running from amazon prime... still watchable, but not quite as nice as Netflix.", "verified": true, "helpfulness": "0/0", "author": "Jennifer Fagre"}, {"rating": 5.0, "review": "Fantastic device that I used in combination with plex to watch shows with it. Love the ability to easily plug it into an HDMI plug. I actually like this more than my roku as I can do everything I want on my phone then cast it to the chrome cast once I'm ready.", "verified": true, "helpfulness": "0/0", "author": "-"}, {"rating": 2.0, "review": "I bought this and thought it would work fine in every situation. Nope. Turns out it has a LOT of incompatibilities with a wide range of routers AND monitors. And it even has issues with compatible routers. It's a great device, but doesn't work as expected.If you're planning to buy this, make sure your TV and router are 100% compatible. (some TVs have 3 hdmi ports and aren't compatible. Just remember that)", "verified": true, "helpfulness": "0/0", "author": "Renan"}, {"rating": 1.0, "review": "It does not work with my Samsung TV, the TV is a Samsung UE55ES6500 and it is not all that old, has 3D and HDMI 1.4, but the Chromecast stick won't recognize itself to the Samsung as Chromecast most of the time.I can try and find it with Anynet+ but even if the TV finds the stick, it won't allow me to see it for long enough. With the next list update, the Chromecast stick is gone.Even when the TV finds the stick, it won't allow me to use the TV control to pause or fast forward Netflix movies. This product is not ready for marked, seriously, what is a mediaplayer worth if you need to control pause and playback from a phone or tablet?Not much in my opinion. The stick has been advertized as being HDMI-CEC compatible and well it does not cost much,yet I am certainly keeping my Samsung TV and will return the Chromecast hardware. Let's hope that the next version is better than this one.", "verified": false, "helpfulness": "0/1", "author": "Bartman \"Bartman\""}, {"rating": 4.0, "review": "It's awesome! It not may be a fully media player, but it can stream content from Netflix, Youtube and other sources.I would love it to be able to broadcast RTSP content.", "verified": true, "helpfulness": "0/0", "author": "Andres Rovira"}, {"rating": 1.0, "review": "This wasn't working well with my Sony LCD TV, when Chrome case is connected, TV resets to Chrome case while I watch Blu-Ray movie or connected to ROKU device. They are working fine before and after Chrome cast installation.", "verified": true, "helpfulness": "0/0", "author": "amazfan"}, {"rating": 5.0, "review": "This is my 2nd Chromecast and I absolutely love it. So easy to use and a great investment overall.", "verified": true, "helpfulness": "0/0", "author": "NathanH"}, {"rating": 5.0, "review": "i love this! if you love movies a must get imo", "verified": true, "helpfulness": "0/0", "author": "Carlo"}]