[{"rating": 2.0, "review": "Decided to cut the cord and buying the Chromecast was the first step. I put it in my sons bedroom since I already had a Roku 3 in my bedroom and didn't know how much I would use the Chromecast.", "verified": false, "helpfulness": "0/3", "author": "Entropia Universe"}, {"rating": 4.0, "review": "Its good for its purpose.  I have an iphone and I would prefer apple tv, and you get more options with apple tv.", "verified": true, "helpfulness": "0/1", "author": "Francisco"}, {"rating": 5.0, "review": "This works great!  Now just need to buy the book and find out how to unleash all its potential.  Recommended for all geeks :)", "verified": true, "helpfulness": "0/0", "author": "Richard Desilets \"RDesi\""}, {"rating": 1.0, "review": "I had high expectations of the Google Chromecast, but what a failure in my situation.  Additional applications required (download & pay for quality video app)Setup:Samsung HD TVSamsung Note 3 8\" TabletNewly purchased Google ChormecastI plugged in the Chromecast into my TV HDMI and using the USB for power I also attached the USB to my TV's USB input.  The device immediately came up on my TV which was nice.  I then downloaded the Chromecast app on my tablet.  I went through the sync between the device and my tablet, connection to the internet, and update for Chromecast.  Once all of that was done (about 10 minutes), I was connected and good to go.The Chromecast device and app do nothing more than stream data from your tablet, phone, or pc to your TV.  That is all.  There is no additional function.  So this device is essentially duplicating what Samsung is doing on their new TV's, what Dish does with their Hopper, and Samsung does with Allcast (which also sucks).In order to use this device, you need to utilize applications on your tablet.  Here is where the massive disappointment comes in.  So Youtube and Netflix work, but if you are like me and store video on your tablet for travel, it will be a bit more of a challenge.  You will need to BUY another software that works with Chromecast.  I tried one of the ones Google Chromecast recommended.  No luck.  I spent $4.99 on the app which just offered movies for purchase (like every other app out there).  My current MX player which is awesome, didn't work with Chromecast.  Anyways this Plex app (or whatever it was called) could not find my video on the device.  In fact after going through everything, there was not even a location to do this.  The Sync option is just for online content that would download to your device (lame).  Fortunately, this plex app offered a refund which I took.Long story short, Google should have included a video and song player in their app.  Why would they require me to purchase another app to use their device for video...silly.  I already have Netflix and Youtube on my TV and DVD player.  Why would I want another device that requires me to tie up my tablet to achieve the same function.  It really does not hold up to what it looks like it does in the advertising.  Hopefully, Goggle will make some adjustments.", "verified": true, "helpfulness": "0/3", "author": "MBuyer"}, {"rating": 5.0, "review": "I love LOVE my Roku 2 XS 1080p Streaming Player (Old Model) but the glaring hole was the ability to watch Youtube. Being able to 'cast' Facebook up onto my tv screen is just gravy.", "verified": true, "helpfulness": "0/0", "author": "D. Boling \"celebrating diversity\""}, {"rating": 5.0, "review": "Does exactly what it claims, I am able to watch movies/videos from my i-pad and my phone on my tv.  Very easy to setup and I use my wi-fi connection which uses up no data from my phone.  Plus the video looks great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This is a good product that's getting better.  A lot of the newer TV's don't necessarily need a device like this, but it's great for the generations before.  Installation was painless, and connection was easy and intuitive.  I'm not really sure what else to say.  It's just good product.", "verified": true, "helpfulness": "0/0", "author": "Ralph"}, {"rating": 2.0, "review": "Seems to be at its core a raspberry pi device, but the wireless-only nature means that in a \"noisy\" environment, this really is not very useful.  Great idea but needs to mature a bit.", "verified": true, "helpfulness": "0/0", "author": "David Z. Smith \"Breaker of Things\""}, {"rating": 4.0, "review": "I bought this with the hope of using it while in the hospital so I wouldnt be stuck with their limited channels. But that is when I found out that this doesnt work on Guest or Open Networks, This is due to the port that is required to be opened so it needs to be on a home or managed network. Now that I'm home I havent had the chance to use it. I plan on putting it on an upstairs TV in my office but since i cant go upstairs due to the severity of my injuries, it can wait. I also suggest that you make sure your TV has a side-mounted HDMI port. If not it can go in the rear but make sure you get a 90degree HDMI adapter. Preferably one that is hinged. Or even a 3ft HDMI extender cable. Most rear HDMI ports are recessed and if you have your TV wall-mounted, it likely wont have space to go in straight. Still, cant wait to put this in my office which means I wont have to run another cable line upstairs. And that alone is worth it (plus the very low price)!!", "verified": true, "helpfulness": "0/0", "author": "The Dark Side Shopper"}, {"rating": 3.0, "review": "It has great potential, but still early days.I hooked it up with my Vizio and was controlling from my HP laptop. Setup was easy.Videos lag on TV with this dongle.", "verified": true, "helpfulness": "0/1", "author": "DS"}]