[{"rating": 5.0, "review": "Gift for my parents who aren't very tech savvy. They love it and were able to figure it out :)", "verified": true, "helpfulness": "0/0", "author": "Charlcie Cagle"}, {"rating": 3.0, "review": "I tried out tab cast from a Lenovo Yoga 2 Pro running Win 8.1.  It sent the video and sound to the television, but the picture was choppy.  I tried a few of the fixes listed online and it didn't improve it.  Tried with a Yoga 2 (lower specs than the 2 Pro) and the performance was worst, so it doesn't work for me with my PCs.", "verified": true, "helpfulness": "0/0", "author": "SilverSurfer"}, {"rating": 5.0, "review": "Easy to install, great functionality. It makes things so much simplier. I recommend this device 100% to anyone, you don't have to be a tech-geek to put hands on this piece of wonder.", "verified": true, "helpfulness": "0/0", "author": "Tyrone Celix"}, {"rating": 5.0, "review": "I love this thing! Works great, my nephew loves it too lol", "verified": true, "helpfulness": "0/0", "author": "Anna"}, {"rating": 5.0, "review": "I love this! It's amazing and so easy to use!", "verified": true, "helpfulness": "0/0", "author": "tiff0307"}, {"rating": 5.0, "review": "It arrived as promised and works perfectly.This is our second one.Now we have one in the living room and bedroom.", "verified": true, "helpfulness": "0/0", "author": "Gayla Alvarez"}, {"rating": 5.0, "review": "As of this posting, Tabcasting (non optimized pages) works, even though its in Beta. If you want to throw a stream to the tv you can. Optimized sites(like Youtube) have some UI changes. You need 0 computer expertise, just a proficiency in following directions and mouse usage. The install instructions that are part of the packaging has 3 steps. Spoiler alert! 1. plug in the power and the dongle (comes with a small hdmi extension). 2. switch the input on your tv. 3.. go to the website and follow directions. the dongle and computer did everything, no need to put in the full 20+ wifi pass, no need to forward ports.this is not a dongle that has app functionality like amazon fire or roku. this is to throw w/e u have on your chrome screen(i wish it screen cast) to the tv to share with the room. you know, in the movies when u see the tech person gesture with their hand when they 'throw' their screen to a bigger one so they can all see the info? this is what that does (minus the cool gesturing, but i've still tried to pull off the look).TL;DRWorks Out of the Boxheadache free installation (assuming u have access to the hdmi port on tv and a free power port.)reason it exists: \"Hey Significant Human(s) in my life, I have media from the internet I would like to view/share with you.\" Response from those Significant Humans: \"After, we watch what i want! (and everyone in the room can take turns, since they are all on the same wifi network)\"", "verified": true, "helpfulness": "1/1", "author": "NinjaBard"}, {"rating": 5.0, "review": "One of the best choise for convert your LED TV into a more smart device...", "verified": true, "helpfulness": "0/0", "author": "Ernesto Urquia"}, {"rating": 5.0, "review": "what was i thinking? great service and device", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Ok", "verified": true, "helpfulness": "0/0", "author": "Amaya Silvia Zalazar"}]