[{"rating": 5.0, "review": "Easy to hook up, does what it says it does, and does it well. Hopefully they expand the arsenal of apps!", "verified": true, "helpfulness": "0/0", "author": "Colin P. Callahan \"classical\""}, {"rating": 4.0, "review": "great compact design and streaming ability. HD picture quality is awesome. very reasonable price and easy set up as expected from Google", "verified": true, "helpfulness": "0/0", "author": "sunil sakhalkar"}, {"rating": 2.0, "review": "It doesn't work on Chrome for my Windows 8 RT tablet, and my Android phone (Samsung S4). Only works on youtube for my phone.Using Chrome, it only works on my desktop Windows 8 professional.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "This only gives you Youtube and Netflix, which many already Smart TV offers, Google should greatly improve this product definitely apple tv or Roku 3 are a better choice today. Do not waste your money.", "verified": true, "helpfulness": "0/0", "author": "Alfredo Gonzalez"}, {"rating": 5.0, "review": "With very little, and simple setup, was able to stream Youtube and Netflix vids from cell phone and tablets.  Video stream was very solid, rare to pause or skip.  Also tried it on other TV in Canada (I'm from NY), and it setup just as easy and was able to stream Netflix there as well.", "verified": true, "helpfulness": "0/0", "author": "Lukas \"Lukas M\""}, {"rating": 2.0, "review": "It worked for about 2 months perfectly, but now It only works with YouTube on my Big Screen LCD TV. it works sometimes on my smaller LCD. Go figure. I a waiting to see what Chromecast says. I own two so they can't both be bad. Update. I have canceled my subscription to Netflix and signed up for Hulu Plus and it is working perfectly. So there is nothing wrong with the Chromecast it, seems to be a problem with Netflix.", "verified": true, "helpfulness": "0/0", "author": "Eugenio C. Garza"}, {"rating": 5.0, "review": "There is really no point is not having one of these. I have a roku and a ps3 to cover the majority of my streaming needs, but this little guys still has some added benefit. It is not my primary go to for streaming, but it has significant advantages for youtube videos and such. I am a little disappointed with the stream quality from an open chrome tab, but it is a feature no one else really has. Great on the road.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 4.0, "review": "While Chromecast is not the most versatile streaming media player, as it is fairly new to the market and does not support all formats, it does work for me.  I was looking for something to stream Netflix and Hulu Plus, primarily, and this fits the bill - and a very small bill that is, too, at only $35.  It works great and does what I got it to do.", "verified": true, "helpfulness": "0/0", "author": "CHK84"}, {"rating": 5.0, "review": "This is a great little gadget for watching shows from Netflix and Hulu. Doesn't work on some other media, such as streaming Amazon. Still, worth the money, if you don't yet have a fully interactive \"smart\" TV.", "verified": true, "helpfulness": "0/0", "author": "Richard Bequette \"Avid reader\""}, {"rating": 2.0, "review": "I've seriously tried everything with this device.  Even went so far as to buy a new router.  This POS just stops working all the time.  Might be able to get in about 2 or 3 episodes then starts to have connection issues, or just s***s the bed.  I've never had connection issues with any of my other devices.  I've tried changing my router settings with the channels etc.  I am so utterly disappointed.  I was expecting it to be everything it was hyped up to be and that it would reflect the other reviews on here.", "verified": true, "helpfulness": "0/0", "author": "Ky Theriault"}]