[{"rating": 5.0, "review": "Very easy and convenient to set up. Queuing videos on the tablet to play on the TV is something I'll never want to miss anymore.", "verified": true, "helpfulness": "0/0", "author": "SMai"}, {"rating": 5.0, "review": "This product is exactly what I was looking for.  The integration with Netflix and YouTube works very well, and being able to share a tab from Chrome is extremely handy.  It is easy to set up and works as advertised.  I highly recommend this product and will be getting this for my friends and family.  You will get a great value for your money if you buy this.", "verified": true, "helpfulness": "0/0", "author": "JMinn"}, {"rating": 4.0, "review": "For price - you cannot beat - and setup took less than 5 minutes - allows for easy streaming from computer to big screen", "verified": true, "helpfulness": "0/0", "author": "Charles Erwin"}, {"rating": 2.0, "review": "All this product is, is a beta, and we the consumers are testing it.  More and more companies are doing this.  Instead of releasing something that's ready to go, they are releasing a test product, to judge demand and to work out the bugs.  They also want complete control.  Yes, there is much potential for the chromecast, but it's far from ready and very limited.  I'm not sure what Google is so afraid of.  Just open this thing up to developers and let them put their apps on it.  Instead, we have yet another product that has great potential, and that's about it.  It's fun to dream about what the chromecast might be able to do in the future, but I'm tired of that.  Apple TV is the same way.  Huge potential, but Apple wants complete control and has been dangle a carrot in front of us for years.  Maybe some day, someone will release a product that works great out of the box with no limitations.  There I go dreaming again.", "verified": true, "helpfulness": "1/1", "author": "nealham"}, {"rating": 3.0, "review": "Disappointed that it doesn't broadcast content from my iPhone, or from anywhere/anything else other than Netflix and Youtube. Perhaps they will upgrade it to do more as time rolls on... but for $35 bucks, it was well worth the experiment.", "verified": true, "helpfulness": "0/0", "author": "Phillip Withers \"PapaGuk\""}, {"rating": 3.0, "review": "I've been looking for a reliable device that's able to stream using a multitude of platform/devices and as of late came across the Chromecast player.At first glance the device appears to do what it was designed to do: stream content to the TV. However, upon closer inspection, one can see the various limitations that are put in place:- Extremely limited streaming capabilities on iOS: Have to use the Chromecast app and YouTube app and can only stream YouTube videos.- Relatively laggy for regular home networks and require high-performing internet networks to achieve smooth and enjoyable media.The first point with regards to iOS devices is what makes this hardware so off-putting. I was hoping to use the Chromecast application to stream anything I wanted through my iPhone much like screen capture. In its current state, the player can only do so using Windows.If Google decides to further integrate screen capture streaming with iOS devices, this piece of work will blast all other competitor products out of the market as something that works nearly like a portable projector. But in its current state, it's not worth the price it's selling for on the market.", "verified": true, "helpfulness": "0/0", "author": "Jerry L."}, {"rating": 5.0, "review": "Stopped using cable services about a year ago and now I can wirelessly watch items from my computer, etc on my big screen.  Easy to setup.  LOVE IT", "verified": true, "helpfulness": "0/0", "author": "James Leatherberry"}, {"rating": 5.0, "review": "Product arrived a couple of days before the delivery date. Great product. It was very simple to install and make it work. Good for non-smart TVs", "verified": true, "helpfulness": "0/0", "author": "Eduardo Suarez-Rivero"}, {"rating": 4.0, "review": "Update - Chromecast now supports Pandora and HBO Go.  We use this all the time and ut's usefulness is growing, if it takes Amazon Prime I may move it to 5 Stars.Original review - I love this concept and it works well for what it is.  However, I never saw this addressed on any of the reviews and it would have changed my decision to buy this item.  You can ONLY use this with certain apps for your android, computer or phone.  The only apps that are available for your phone are Hulu, Netflix, Google YouTube and Google play (and Google Play wont play most of the music that is loaded on my phone).  Currently there is not provision to play the videos I have taken with my phone over the ChromeCast directly.  The only way to do that would be to upload my videos to YouTube first (which I don't want to do with private family videos).  You also do not have the ability to view any movies you have loaded on your computer or phone or to even work with other sites like Flixster.  If you are only using Netflix, Hulu and YouTube it works fine but it is limited to those at this time.", "verified": true, "helpfulness": "0/0", "author": "R. J. Ellingsen"}, {"rating": 5.0, "review": "I just use this for Netflix.  Its easy to control from my computer.  Picture quality is much better compared to running Netflix off my computer and connecting it directly to my TV monitor.  Can't seem to get my Samsung Nexus phone to control it though. Great value and better picture than my DVD Players WiFi.", "verified": true, "helpfulness": "0/0", "author": "Mr. Sunil A. Sharma"}]