[{"rating": 1.0, "review": "I loved the conept of Fire TV and I own Kindle Fires; I have had them all at one time and constantly upgrading; love the Kindle line but this product was terrible. I had to reset my box every time I used it; I was left with no sound and not everything on Netflix would play. I returned the first one (great customer service) and the next day I had my replacement. The same thing continued to happen. Navigation; use and hookup of Amazon Fire TV is very simple. I think this item needs some help to be a worthy item. I went out and bought the ROKU stick for less money $49.95 and I never have to reset it and I love it. I reccomend doing some research on line before purchasing this item.", "verified": true, "helpfulness": "4/4", "author": "katcon"}, {"rating": 5.0, "review": "If you have prime and like to watch movies or tv.  This is the way to go.  Excellent picture quality and huge selection", "verified": true, "helpfulness": "0/0", "author": "fsu928"}, {"rating": 2.0, "review": "Fluid, with a lot of potential. Games market is tiny. Still fun and a fantastic addition to my collection of set top boxes.Update: Twice in the last 4 months that have passed since the release of the Fire TV, Amazon has put their beloved media streamer on sale for %15 off for a couple days at a time. Apparently, I just purchased this device at the wrong time. Feeling a little ripped off while seriously regretting paying full price. I understand they want people to buy their device, but it just looks like they over-estimated the worth of their device at first and took advantage of the fact that their first investors of their product, the consumers, would make the same over-estimations. The least they could do is offer compensation close to the difference of the full price and what they put it on sale for to the people who payed $100, like $5-$15 credit to be used on the Fire TV, a free game or a free movie rental.For $85, this device is worth considering. If the price goes back up again, just hold out for it to inevitably go on sale again and save yourself $15. DON'T SPEND $100!", "verified": true, "helpfulness": "1/1", "author": "Taylor Berrier"}, {"rating": 1.0, "review": "No good. Just buy a Roku 3 and you will be much happier.", "verified": true, "helpfulness": "3/11", "author": "Bryce Van Horn"}, {"rating": 3.0, "review": "The title of this review isn't a pun, the Fire TV literally gets very hot. It's uncomfortable to touch, and caused problems with nearby electronics that couldn't take the heat.It's a decent way to watch prime videos, but be careful where you place it", "verified": true, "helpfulness": "1/1", "author": "Jeremy"}, {"rating": 5.0, "review": "Just Watched over 5 video reviews online comparing all the current media streaming devices and in my opinion i think that the amazon fire is hands down the best of them,its faster,more features,games with gaming remote,voice command,very nice menu and home screen,remote looks pretty nice,basically from what ive seen this device looks very nice and i cant wait to order mine this week", "verified": false, "helpfulness": "0/1", "author": "TYLER HICKEY"}, {"rating": 4.0, "review": "I am pleased with the availability of so many movies, but so many times the ones I really want to watch are still requiring a fee.", "verified": true, "helpfulness": "3/3", "author": "LoveKinderKids"}, {"rating": 4.0, "review": "I have AppleTV throughout my house. Got this just because. Nice to have Amazon Prime but I use Mac computers and have my entire audio and video libraries on iTunes so this really just gets used for amazon prime video and a couple games. It's a fine product if you aren't glued to Apple, just not the ideal device for my home.", "verified": true, "helpfulness": "0/1", "author": "Rob M"}, {"rating": 4.0, "review": "It looks like a good idea. With just the control included, you can do a lot of things, and the possibility to install XBMC is awesome, but. Yeah, but.I have an Apple TV 3, a Samsung Blu Ray, and the Amazon TV in the same space. The Apple TV streams flawlessly, not a hiccup, but when comes the turn for the Amazon TV, Netflix begins to chop the streaming and not just that, when it stops, the app does not keep the place where it stopped streaming, so I have to begin again and look manually for the place where it stopped. Or the streaming sucks or the app sucks, but now I have the Amazon TV just to play games and watch youtube. It is a shame.", "verified": true, "helpfulness": "0/1", "author": "Cam D"}, {"rating": 5.0, "review": "Amazing!!!", "verified": true, "helpfulness": "0/1", "author": "Michael Donavon"}]