[{"rating": 5.0, "review": "I've tried many different devices for streaming my local media. I thought it was a lost cause because they were all jittery or took far too long to load. Even the Apple TV was a sub par experience. My mind was instantly changed by this device which was surprising due to its price point. I was considering building a small home theater PC for a few hundred dollars, but with this device I was able to pair it with my old note 3 to stream media right to my tv. It's definitely worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Ryan eman"}, {"rating": 5.0, "review": "Everything was great!", "verified": true, "helpfulness": "0/0", "author": "Ellen"}, {"rating": 5.0, "review": "Simple and Easy to use, so glad I own this product", "verified": true, "helpfulness": "0/1", "author": "Jose Ortiz"}, {"rating": 1.0, "review": "The Arabic TV channels are not there . will return it", "verified": false, "helpfulness": "0/0", "author": "Ashraf M Badri"}, {"rating": 3.0, "review": "Its laggy in casting from desktop and with flash to be unusable in some situations that i use daily. IF that is fixed then it would be a 5/5 but until then it works okay to play my Netflix or YouTube videos until i can just use a hdmi thats more normal.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "excelente", "verified": true, "helpfulness": "0/0", "author": "cesar vazquez"}, {"rating": 1.0, "review": "Incomplete and confusing instructions..  Unable to connect without more help...", "verified": true, "helpfulness": "0/1", "author": "Kathy Rosted"}, {"rating": 4.0, "review": "Like this device easy put together watch movies on Netflix", "verified": true, "helpfulness": "0/0", "author": "Wesley"}, {"rating": 5.0, "review": "This is awesome for any hdtv. We have a non smart tv in our bedroom and this device basically makes the tv smart with acess to tons of apps. My kids love vevo and pandora on their tv.", "verified": false, "helpfulness": "1/1", "author": "MC Doso"}, {"rating": 1.0, "review": "I spent all day trying to get it to work. I don't know how to change my router settings, and didn't want to mess up my wifi. This was a waste of money.", "verified": true, "helpfulness": "0/1", "author": "Molly Richard"}]