[{"rating": 5.0, "review": "Amazing...", "verified": true, "helpfulness": "0/0", "author": "Ness"}, {"rating": 5.0, "review": "I've only had it about a week but it is great.  Very simple to hook up; very simple to use.  Lots of good 30 minute TV series choices.", "verified": true, "helpfulness": "0/0", "author": "J. Smith \"Jack Smith\""}, {"rating": 5.0, "review": "Using these to replace cable boxes. Nice!", "verified": true, "helpfulness": "0/0", "author": "Mr Edward F Finn"}, {"rating": 5.0, "review": "This is our favorite of all the television options out there. Very glad a friend told us about this!", "verified": true, "helpfulness": "0/0", "author": "Connie Connolly"}, {"rating": 5.0, "review": "I've had this for about 5 days. I absolutely LOVE it! We have DirecTV and this completely enhances the entertainment experience. I am not a gamer but, truth be told, I can actually see myself becoming evolved in that aspect in the near future. Although I did have a small problem, I simply opened a live chat and within minutes the problem was solved, software updated and I've not watched DirecTV since. I highly recommend this for anyone of any age group. BTW... I am a woman in the mid-60 age group...", "verified": true, "helpfulness": "0/0", "author": "D. Boinay \"TexasRuby\""}, {"rating": 5.0, "review": "Definitely so much better then the Apple TV. I am just using the Fire TV for Netflix and Hulu Plus currently but having the options of games too is great. My parents have the Apple TV and the interface for Netflix is so much better and more user friendly.", "verified": true, "helpfulness": "0/0", "author": "Jennifer D."}, {"rating": 1.0, "review": "Returned it for a Chromecast.  Only good if you have Amazon prime. Since I don't it didn't work for me.", "verified": false, "helpfulness": "2/7", "author": "Amazon Customer"}, {"rating": 5.0, "review": "But when you have no direct tv to date & E TV and History Channel and you need the food to app also but l as its kick butt though I like it", "verified": true, "helpfulness": "0/0", "author": "Benjamin Thomas"}, {"rating": 4.0, "review": "Works Great, Only issue is that Showtime does not have DirectV as a service provider. This means that you can not log in. Hulu and Netflix works well. HBO is supposed to be coming and I hope that DirectV is on the provider list.", "verified": true, "helpfulness": "0/0", "author": "Grant Bowden"}, {"rating": 4.0, "review": "I like this product and find it pretty user friendly.  We purchase two of these devices to help us cut the cord to our cable company.  So far it has worked out pretty well.  However, I do have some problems with it.  The \"one click\", buying content can get you in a lot of trouble if you accidentally set on the remote.  So, beware of this and change your account settings before you hook it up.I am also annoyed about the lack of support that I have for my already purchased digital movie copies.  I find it very frustrating that I have held onto my non-redeemed digital copies, in hopes of redeeming them through Amazon, to watch on this device.  Come to find out Amazon does not even support them.  However, iTunes supports every single digital copy I have.  But, Amazon doesn't even have an iTunes app, how frustrating for those people like me that has all of this digital media content that they have purchased over the years.  Also, it is not like Amazon’s content is competitively priced either.  I can purchase a DVD/Blue-Ray/Digital copy combo pack for $30 or less.  So roughly that would be $10 per DVD/Blue-Ray/Digital copy.  ITunes charges $15 for their HD digital copies and they also support the majority of digital copies that are purchased with a DVD.  Why does Amazon have to be so expensive at $20 a pop for an instant video HD digital copy, especially when they don’t support the already purchased digital media you may already have.  I just don’t get it and am completely frustrated by this.  I wouldn’t mind purchasing digital versions of something I already owned if it were more competitively priced, but I just can't see re-building or building a digital library at these prices.Amazon needs to step up their game a little more on this product for this to be perfect in my eyes.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]