[{"rating": 5.0, "review": "This is a great devices with great services. I really like the experience. Really wish it had more services like MLB.TV.", "verified": true, "helpfulness": "4/10", "author": "Amazon Customer \"ssaponas\""}, {"rating": 1.0, "review": "I really wanted to like the Amazon Fire TV, but without BlazeTV, I'll be sticking with my Roku.  So the question is, when are you adding the Blaze?", "verified": false, "helpfulness": "36/163", "author": "B. Appel"}, {"rating": 5.0, "review": "I'm an avid Roku user.  Having said that, I believe that the Amazon Fire TV is the next step in the pre-made streaming box market.  It's noticeably faster and snappier than my Roku3, and the ASAP reduces buffering times.  In fact I was rather surprised to skip to random scenes while streaming off Amazon Prime and noticed zero lag in my selections.Eagerly awaiting what apps will be available soon.If this is what we should expect on a Day 1 launch, the next 6 months will be amazing.", "verified": true, "helpfulness": "53/62", "author": "Brian M Griffin"}, {"rating": 2.0, "review": "I want to make clear I don't own one and will likely never own one.There are a few really annoying things about this product.  Amazon was rumored to be doing game streaming- and then tried to side step it a launch no offer no mention.  It tried to talk about this feature as if all that mattered was comparatively useless local streaming. The predictably useless gaming media and media in general acted in its typical sponsored (censorship by being paid to mislead on the the important stuff)  failed intentionally to bring up the issue.  Product is obviously capable of it but them deliberately not addressing it and the press not asking questions is so annoying. Larger firms in the gaming industry also don't an all you can eat subscription approach or even an itunes like set up .  So they've done a kind of content strike.  Amazon instead of using its clout on behalf of its real customers is apparently just bending over, looking like its colluding with likes of EA and others to keep game prices artificially high- like the old RIAA did with music.Let me proffer another reason for this black out.  Its because its unfortunately being billed as \"TV\" (TV is supposed to be dying- but instead of dying it seems to be converting the internet into cable with the help of the courts- anti neutrality is pro-censorship)  the useless Wall St. sponsors want to sell you ads and they want to continue to corrupt streaming with a sponsor model.  They don't want gamer culture which tends to reject modal ads and interruption leading to the public demanding something like the early pre-corrupted Netflix.  They saw what happened with gamer's  rejection of Xbox One's sponsorship and spyware mechanisms and got spooked.  This is the problem with Amazon as of let, they seem like sell outs. They have forgotten who their customers are.  They think their customers are their suppliers and that makes them weak- weak in the way Walmart became weak when it started thinking this way.  Both Amazon and Walmart will built on not thinking that way.  We don't need supply side enclosure BS.  Xbox One was all about trying to repair sponsorship by making it more efficient by tracking the eye to the ad.  What Amazon is trying to do here is link the one click to the modal ad temporally to capture more impulse buys- kind of like a voice click.  Its got some utility to it but again Amazon is getting foolishly confused about who its customers are.  We don't want ads ever- and we don't need them if we have accurate ad/sponsor free search.  But shot gun and even targeted ads, while obsolete are not about sales as much as censorship (below.)Amazon is becoming a sponsored medium. Which will make is useless.  It sure looks like its becoming collusion focused (i.e., its announced intention not to compete with Sony and MS as if it were paid behind the scenes not to do so or told via interlocking boards not to do so.)  Look at what it's doing with Kindle. The only version you can buy at retail are the sponsored versions but you can pay a premium for one without ads.  This is deceptive.  Problem is if the sponsorship is let in which it is, the medium is already corrupted, stuff that doesn't appease sponsored won't be offered- remember censorship- its only a matter of time until it sets in.  Amazon is also getting into deceptive marketing practices (probably been hiring people from its sponsor firms)  with its Kindle lending library on Prime.  It what appears to be unlimited access to 500K book, which is of course only a fraction of Amazon's book inventory.  But to a prime subscriber considering a Kindle purchase Amazon makes it look like everything marked Prime is eligible.  Once you buy you learn that's is not the case but Amazon does nothing to dissuade this impression.  Once you get in you also find that you can only access one such book per month with a prime membership.  Black lie level of apparently intentional misrepresentation.  Needs consumer protection agency attention.People have to understand the cost of sponsorship.Clue Amazon, as above, we don't want ads ever, ads are never value added and on Fire they will all Fortune 500 Wall St. ads that try to pimp unearned income by selling and justifying more wage slavery that is always the underlying message.  Here's a hint Amazon: you need to include the true cost of the interruption, cost of stolen attention and time, accumulation of poor purchase decisions that undermine buying power and financial health and most of all the loss of crucial political representation (hard to delegate your power to begin with) that is the point of sponsorship to being with (yes its censorship that is only nominally connected to commerce and need not be at all now that we have the basic technology behind search.)2 stars, its a flawed presentation and it looks like the approach (get people to pay for useless regressive modal ads i.e., TV) is horrid.  If the medium is the message TV old mass broad cast TV was top down hierarchical  the definition of tyranny.  At a time when we need more horizontal speech to survive this is another attempt to get people to pay for and cultivate a continuing perverse addiction to vertical speech.  .", "verified": false, "helpfulness": "7/68", "author": "Qoqoqoq"}, {"rating": 5.0, "review": "Yes, I have a  Amazon Prime account and I use it every week. Rarely do I give reviews because I'm too busy to write 10 page long reviews when I purchase an item. I went to this device reviews to get a feel from the people that had or has purchased the box. These reviews can be classified as bullying. You would have that Jeff Bezos was some of these reviewers daddy or something. I am so turned off from the review bashers or the everything Amazon makes is gold behind kissers it's hard to read the reviews and make a call. Cut it out let everyone have their say. If you don't like it as grandma used to say \" eat the meat and throw away the bones\" don't read the review skip it. When I do get my hands on one of these I will update my review. I already own a Google Chromecast I'm not happy with. No, I didn't bash google either.... And yes I do read the comments also....", "verified": true, "helpfulness": "6/28", "author": "L. M. SINGLETON \"Book Nerd !!!\""}, {"rating": 4.0, "review": "Update: 1/9/2015 I have done some more playing around with this unit and have gained some more respect for the unit. It is actually quite easy to side-load android apps to the Fire TV, you do not even need to disconnect or move the unit. You can use PC software, and the network address to add \"non-approved\" apk's. I have added Kodi (XBMC) and ShowBox, both work well, but to be able to use ShowBox it will require a mouse (for touchscreen operations). I am able to run my logitech K400 keyboard/touchpad through the USB port. Finally a use for the USB port, other users have also used bluetooth ones, but that requires another side-loaded app to configure. Another issue I have discovered is that this box is almost useless without a network connection. When my router was down due to upgrades, I could not access anything, it would just prompt me to connect to a network. My Roku still runs all local content including through Plex without the internet. However, the Fire TV still lacks the local network compatibility, and ability to stream local music and content (other than Plex), so I still rate this as a four star item, I am still hopeful it will make the five star mark in the future.Updated: 6/9/2014 I purchased this as soon as it was available hoping it would surpass my expectations. I have now spent a few months using this unit. Unfortunately this box has fallen short of my high expectations for an Amazon product. Below is my results and conclusions (Note: These are just my experiences, and my opinion about what is important to me)Size: Fire TV has a significantly larger footprint, and is quite heavier compared to the Roku's. But is about half the height. (See comparison pictures under customer images). The foot print is over double the Roku 2 XS, and feels like it is almost 3 times the weight. My guess is the weight increase is due to the fan-less heat sink required for the faster processor and video chip. Also for those that may want analog options there are no analog audio or video options. HDMI and Optical Audio out only (not a big deal for me).Initial Impressions: The Fire TV seems to run quickly and smoothly. Automatically syncs with your Amazon account (if you do not want this option be sure to check gift item when purchasing from Amazon) Navigation is not as easy or user friendly as the Roku or WD Live TV. The graphics are nice, but it seems the voice search options is the only way to truly navigate well, which means you need to know what you are looking for. Also Voice Search currently only works for searching Amazon Apps and Amazon video content. It is not a very browsable type interface; it reminds me of my Sony smart Blu-ray player's interface, but with better graphics.Services/Features: The apps are Android based like the kindle. The streaming apps work well, and buffer quickly. As a streaming box this is a 5-star unit, unfortunately for a network capable device it is severely lacking. Amazon states it is \"Made for Music\" yet I cannot stream any of my music library not purchased from Amazon or stored on Amazon Cloud. It also says \"Sync photos from all your devices\" but that is only for Kindles otherwise it requires upload and transfer to the Amazon cloud, which has only a 5GB limit for the free service (currently have almost 20GB music). Also I have not been able to find an app, or a way to play movies and music from a USB drive, I can't even see if it detects/recognizes the connected USB drive (WD recognizes and plays these easily; Roku requires a media player app but still works easily). There is also no DLNA support either that I could find, so if you want to play network video/music you will not be able to yet. The only way to watch locally stored contend is to have a Plex server running and install on one of your computers and install the Plex app. However Fire TV is also missing the free Plex for PlexPass android app, Fire TV only lists the Plex pay app for $4.99 (was discounted to $0.99 on when I purchased), even with a PlexPass Lifetime membership you will still have to pay. I have had a chance to test out many of the free games that work with just the remote. The games seem to run just as well, or better than they do on my Samsung Galaxy S3. But the selection is still quite limited 3 months out now. I may purchase the controller in future months to do more testing.Conclusion: It is good for those who use strictly Amazon for all their music and video, but for those with multiple sources, it is not up to par with the current competitors. The Fire TV is a good start for Amazon into these small smart TV boxes. Great Video Quality, and Sound Quality. It is great for streaming popular channels and Amazon content, but falls short, and fails in the ability to stream off a local network, or USB drive. I have come to expect both these capabilities in modern TV boxes like this. I hope with time and some updates it can become a true contender. I will also update my review if these features become available and work well. Still a 4-star product in my opinion.", "verified": true, "helpfulness": "22/23", "author": "D. Fox"}, {"rating": 5.0, "review": "I wasn't sure what to think when it first come out since I had already own a Roku. I was happy with the Roku2 until I received this thing! This is way snappier, easier to use, and just pure awesome IMO. I wouldn't hesitate to recommend this to anyone thinking about getting a new video player. The interface is clear and easy to understand.From the pictures I was thinking it was bigger than it actually was, but its a nice small size.I'll update more the longer I own it.", "verified": true, "helpfulness": "11/13", "author": "Ricky"}, {"rating": 2.0, "review": "It's fast, sharp, crisp and lovely but that doesn't overcome the fact that Showtime doesn't work with Charter, no HBOGo (I could have waited), voice search results are limited, and other minor issues that may be resolved in the future. I may buy again in the future when everything is worked out, but not without Showtime and HBOGo- so it's going back tomorrow. For now, I'll stick with my good ole' Roku because it works.", "verified": true, "helpfulness": "11/30", "author": "Sheshechic"}, {"rating": 4.0, "review": "So far I like this thing. The picture quality is very good and sharp. It's easy to use, and the remote is going to be a game-changer. This goes great with an Apple TV and it's another excellent reason to dump cable.", "verified": true, "helpfulness": "5/7", "author": "Bruce James"}, {"rating": 1.0, "review": "I don't begrudge Amazon for coming out with their own devices, competition is good for the consumer after all. It's when you do anti competitive things like keeping Amazon Prime off Android devices yet still provide the service iOS or other Amazon devices (which also happen to run android). Amazon Fire TV is just the latest slap in the face to Prime Users that pay for a service yet are unable to use it on their device of choice, so no Amazon, you can keep your set top box, kindles, and whatever derivative junk you copy off Google.P.S. Global chromecast sales are off the charts, good luck catching up pfft", "verified": false, "helpfulness": "28/167", "author": "Joseph Lee"}]