[{"rating": 5.0, "review": "I am new to certain types of technology. And I was very impressed with Amazon Fire. Movies and TV come through quickly and clearly. I was just thinking about getting what we used to call a stereo so I could play more music. But to my surprise my TV has now become my stereo. Amazon Fire automatically picked up the music on my computer and saved me some bucks! I have not tried any other type of TV streaming (or whatever you should call it) but I give Amazon Fire 2 thumbs up!", "verified": true, "helpfulness": "0/0", "author": "Dawn M. Phillips"}, {"rating": 5.0, "review": "Works and looks just like a new one", "verified": true, "helpfulness": "0/0", "author": "Scott Faniola"}, {"rating": 2.0, "review": "My entire family, including myself were very disappointed with our purchase of Fire TV. What was not made clear in the Fire TV advertisement on Amazon, is that it is ALL PAY TV. You have a choice to rent or purchase everything that you watch, nothing is free. Also, to make matters worse, If you rent a movie or a particular TV program to watch, you are allocated a certain amount of time to watch it, before you must pay to watch it again. If you elect to purchase the program or movie or video, you can watch it as long as you want to, but of course you pay a lot more for this option.We all came to the same conclusion that our Metrocast Cable TV was a far superior option for the amount of money involved. Everything is built in from local TV stations, to Boston stations, including a free movie station, to a full range of music selections, including classical and light classical, special stations for children, including the Disney channels etc.The Fire TV is an elective option for only upper income and high income families. It is just too much money for middle and lower income families, like mine, for the programming that is offered.Very Truly Yours,Philip Nordmark and family, Northfield, New Hampshire", "verified": true, "helpfulness": "2/4", "author": "Philip Nordmark"}, {"rating": 5.0, "review": "A great little device: I couldn't be happier with the technology,especially the voice activated search feature. However, you guys at Amazon  are a little behind Netflix in movie selection (quality not quantity). You probable won't post this because of that last statement but I'm just trying to help.I love Fire TV and the Amazon business model, even thinking of buying some stock.", "verified": true, "helpfulness": "0/0", "author": "Bruce"}, {"rating": 5.0, "review": "More than expected. Amazon TV capabilities are beyond belief. Only drawback is I want to play the games and some games require the game controller which I have ordered. Only problem is they are backordered until at least expected shipping date in May 2015. Want to play games.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "The fire tv basically turns your tv into a tablet. there are many apps on its app store everything works and it feels like it is very good quality.all you need is the game controller if you plan to play any games. Also its games are very fluent even on there highest setting. there is almost no lag what so ever. 1080 videos come through perfectly with little to no buffering at all (depends on what app your using) netflix works great. i could not be more happier with the fire tv. Butthe only thing i wish they would put into the OS is to be able to expand the memory of the fire tv with a usb flash drive.", "verified": true, "helpfulness": "0/0", "author": "David Diedrich 2"}, {"rating": 1.0, "review": "It sucks. Wish I didn't buy it.", "verified": true, "helpfulness": "1/7", "author": "Torrey"}, {"rating": 4.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Neil"}, {"rating": 5.0, "review": "Save your money and switch from cable to amazon tv", "verified": true, "helpfulness": "0/0", "author": "joshua"}, {"rating": 5.0, "review": "Works great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]