[{"rating": 5.0, "review": "Excellent and handy product.", "verified": true, "helpfulness": "0/1", "author": "Jeremy Johnston"}, {"rating": 5.0, "review": "very useful and a money saver!!", "verified": true, "helpfulness": "0/0", "author": "Ana G. Done"}, {"rating": 1.0, "review": "This thing is unreliable. It has only ever completed a stream once. It simply loses connection randomly 99% the rest of the time. I decided to relegate it to a music streaming device then, connected to my receiver. It can't even handle that. After a few hours connected, the thing just crashes and needs a reboot. Defeats my goals of effortless streaming. I hooked up a raspberry pi to pull the same duty and it has never crashed in the year or so it's been back there. Roku is also much more reliable. This thing sits unused. I never successfully used it continuously to start with. At least I can reuse the 5v USB charger.", "verified": true, "helpfulness": "0/0", "author": "raphe \"raphy\""}, {"rating": 5.0, "review": "Awesome product!", "verified": true, "helpfulness": "0/0", "author": "alex campbell"}, {"rating": 5.0, "review": "I haven't compared Chromecast to any of the other streaming sticks/boxes so I don't know how they compare (probably the same or very similar) but if you do not have one of these it is well worth the investment.  The UI on those so called 'smart TVs' is so crummy but these make it clean, pretty, and easy to use.", "verified": true, "helpfulness": "0/0", "author": "tim"}, {"rating": 5.0, "review": "The delivery was fast, setup was very quick and easy. Every thing works as expected, though I think, i miss remote.", "verified": true, "helpfulness": "0/0", "author": "NewToHomeGym"}, {"rating": 5.0, "review": "No doubt thats is the best item I purchased this year...", "verified": true, "helpfulness": "0/0", "author": "ahmed abdulsalam"}, {"rating": 5.0, "review": "Great device.", "verified": true, "helpfulness": "0/0", "author": "Lyle A. Roberts"}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "jen"}, {"rating": 3.0, "review": "Doesn't work all the time, needed to unplug for an hour...", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]