[{"rating": 2.0, "review": "This thing rarely works. It's nice when it does work because it makes it easier to watch things. However, mine hasn't worked for a few months now which is unfortunate.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I will recommend this to anyone. Bummer that I can't use it on Amazon video (I know they've got their own version), but I watch Netflix more anyhow.Very easy setup, and easy to queue up videos (if you're watching YouTube videos, for example).", "verified": true, "helpfulness": "0/0", "author": "Nora Therese Hanlon"}, {"rating": 5.0, "review": "I love my Google chrome and use it all the time. This is definitely the best bang for your buck! EVERY PENNY IS WORTH IT!", "verified": false, "helpfulness": "0/0", "author": "alberta mccabe"}, {"rating": 5.0, "review": "The girlfriend and I use this almost daily to stream movies, TV shows, Music, whatever on here.", "verified": true, "helpfulness": "0/0", "author": "A. J."}, {"rating": 3.0, "review": "not as great as I thought it would be- use Roku", "verified": true, "helpfulness": "0/0", "author": "MO'Brien"}, {"rating": 5.0, "review": "toy for hubby. he loved it!", "verified": true, "helpfulness": "0/0", "author": "BuddingRose66"}, {"rating": 1.0, "review": "ROCU is easier to use.", "verified": true, "helpfulness": "0/0", "author": "Bebo"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Omar Almutairi"}, {"rating": 5.0, "review": "A++", "verified": true, "helpfulness": "0/0", "author": "Jorge R. Duran"}, {"rating": 5.0, "review": "best thing since HDMI Tv's! I am able to Chromecast so many things, especially with using Chrome Beta. It adds to the amount of videos, tv shows, movies you are able to cast by simply having the addition of the symbol in Chrome Beta. I love it, love it. So glad I have it and use it most everyday. Who needs Redbox when you have so many options, and more added weekly. So simple to connect, even I was able to do it without assistance. Would reccommend it to anyone.", "verified": true, "helpfulness": "0/0", "author": "Mary Sitzler"}]