[{"rating": 4.0, "review": "I like this device.  It works well for me.  It's pretty easy to set up.  I have my old smartphone that I don't use as a remote control.  I have bought a few from Amazon and a few from best buy for friends and family member.", "verified": true, "helpfulness": "0/0", "author": "DonaldC"}, {"rating": 2.0, "review": "Chromecast... that's like seeing everything that's on your laptop right on your big TV minus the HDMI cable, right? WRONG! This thing is seriously limited in its capacity to cast, it's ridiculous. I am very disappointed with Google and with what this device can do. It is hyped up so much to make you think it can cast your computer and your smart phone.What can it do?- It can cast one tab on google chrome at a time. Wanna switch tabs? Then you gotta click on the icon on the top right corner and a few more buttons until you can cast from that screen. Wanna switch back to the first tab? Waste another 30 seconds.- It can cast from your smart phone, well at least form your android phone? iPhone? I'm not so sure. The process seems a lot more complicated on an iPhone. But I am thoroughly satisfied with casting from my android phone. It will cast images, but no sound. So if you wanna cast a video, you're out of luck on sound.- It can cast from youtube. It does youtube really well.What can't it do?- Everything else!- Have a presentation on powerpoint, excel, etc? You're out of luck because 9/10 times it cannot cast that even with a decent internet. I have a 125/15 mb internet and anything that is on my computer and not on a chromecast tab, will be extremely choppy when cast from desktop. Yes, there is an option to cast your entire computer screen onto your TV but google warns that this is \"experimental\" and \"beta\". AKA worthless. The experience is choppy and definitely not pleasant.- Wanna show those photos you have on your computer to everyone watching your tv? You have three options, all of which are equally bad. You can try your luck by casting your entire screen. We already said this was supper choppy and laggy. You can drag your photos one by one on your chromecast tab which you are casting. So friggin tedious and pointless. You can upload to plex or something and then stream that on your chrome tab. Yeah...no. And forget about videos. It's tripple the wasted time.You know, google chrome sounds like a really cool idea. Put up what you got on your laptop on your screen! Awesome! But in practice, you can't do much with it, unless you just want it to watch youtube videos, netflix, or cast visuals from your phone. For me this capability is not worth the $35 price tag. I'm returning mine. I think I'll just stick to the HDMI cable for now, until google fixes their user experience and makes it as smooth as it seems on the commercials. And don't be greedy, google. Create an addon so we can cast from firefox too!", "verified": false, "helpfulness": "0/0", "author": "AmznAlb"}, {"rating": 5.0, "review": "Item was exactly as described and arrived in 2 days.  Great Buy!  Buying another.", "verified": true, "helpfulness": "0/0", "author": "Jason M."}, {"rating": 4.0, "review": "Great way to stream stuff from Mi-Note to HD TV. Would be better if phone supports mirrorcast.", "verified": true, "helpfulness": "0/0", "author": "Kok-Hong Wong"}, {"rating": 5.0, "review": "Thank you", "verified": true, "helpfulness": "0/0", "author": "Christian Nororis"}, {"rating": 5.0, "review": "Works well. You cant beat the price.", "verified": true, "helpfulness": "0/0", "author": "J. Aleman"}, {"rating": 3.0, "review": "Never used this much.. Kinda pointless if you have a smart tv/cable /Internet", "verified": true, "helpfulness": "0/0", "author": "brian"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Meguel Stillwell"}, {"rating": 1.0, "review": "Exited to unbox it. Plugged it in. Updated it. Connected it. Tried to stream from Netflix - FAIL (16001 error - probably not just it's fault). Factory reset. Netflix finally plays. But now I can only stream Netflix or Youtube at a decent quality. I was hoping for Airplay functionality. I commend Google for trying to support many devices (like PC compatible and M$ back in the day - try to support a broad range of devices), but I think this product fell flat on it's face. I'm not happy with it, and the cost to return it is just as ridiculous as keeping it and hoping that software updates actually make it usable.", "verified": true, "helpfulness": "0/0", "author": "JTM"}, {"rating": 1.0, "review": "Very disappointed. Lack of many features it claims. Even a Chinese knockoff has much richer features. The screen mirror/cast function does not work at all. The photo sharing is so slow, I have to wait about 10 sec for completely loading each picture.", "verified": true, "helpfulness": "0/0", "author": "Dawn"}]