[{"rating": 5.0, "review": "i love this product", "verified": true, "helpfulness": "0/0", "author": "jhoan juarez"}, {"rating": 3.0, "review": "Loses connection to my network pretty frequently", "verified": true, "helpfulness": "0/0", "author": "Michael Whitehurst"}, {"rating": 3.0, "review": "Worked as expected. Recieved in time as posted. Product is of good quality.", "verified": false, "helpfulness": "0/1", "author": "Johnny"}, {"rating": 3.0, "review": "I wish there would be more apps for this product.  And perhaps easier to share apps from my Android phone and tablet (and even laptop) like photos and videos without having to upload everything to the Google Photo!", "verified": false, "helpfulness": "0/0", "author": "KP"}, {"rating": 5.0, "review": "So much better than an apple tv. If you are comparing the two, look no further. For a third of the price this blows the apple tv out of the water even though its still in beta for software.", "verified": true, "helpfulness": "0/0", "author": "Bakir"}, {"rating": 5.0, "review": "Works great. Easy set up.", "verified": true, "helpfulness": "0/0", "author": "Craig Sturm"}, {"rating": 5.0, "review": "If you love all your google products, you can't miss this one. If you want immediate satisfaction with a product that has a lot of function, there are a few more generic streamers out there. But if you're patient and love the way google integrates product functionality overtime, you need this for sure. Or just get both and a few more like me :-)", "verified": true, "helpfulness": "0/0", "author": "An Honest Engineer"}, {"rating": 5.0, "review": "awesome product. I've had an apple tv for years and thought I would test out the chromecast on another TV because it is so cheap. And now I wont use my apple TV at all, the chromecast has completely replaced it. for the price of one apple TV I could have nearly 3 TVs in my house set up with chromecast. definitely recomend.", "verified": true, "helpfulness": "0/0", "author": "Jaren Petrusich"}, {"rating": 5.0, "review": "I bought this pretty much exclusively for Plex. It works great! Not a single hiccup, even on HD streams.", "verified": true, "helpfulness": "0/0", "author": "Larry"}, {"rating": 4.0, "review": "I wish I could use it with other browsers than Chrome.", "verified": true, "helpfulness": "0/0", "author": "A. Bloch"}]