[{"rating": 5.0, "review": "great device", "verified": true, "helpfulness": "0/0", "author": "Arlene Godfrey"}, {"rating": 1.0, "review": "Pretty useless tool. I used it for a few months and gave it away. It heavily restricts your viewing and does not allow for binge viewing of HULU. You are much better off hooking your phone or laptop to your TV, it works better and is much much cheaper and completely hassle free. If you don't have a wireless router you must have one to use chrome cast. Oh and they spy on your viewing habits with this device, it sends data to google for target marketing. Forget about using it to view home movies.", "verified": true, "helpfulness": "0/1", "author": "E. Sears \"A. Passerby\""}, {"rating": 3.0, "review": "I did get this to work well, but only after extensive tinkering. First problem was finding out the Chromecast doesn't recognize the 5 ghz wifi band with my dual-band router. Once I set up the chromecast on my 2.4 ghz connection, however, I was then able to use a laptop that was connected to the 5ghz. The built-in screen mirroring functionality doesn't work with all Android devices. Screen mirroring didn't work with my Nook HD+ tablet, but I was able to find a 3rd-party app called Web Video Caster to let me view web video on my TV. Screen casting also worked with the YouTube Android app on my Nook HD+. This is pretty cool and fun for somebody who likes to tinker around, but I really can't recommend it for anyone else who wants reliability or convenience. For the $22.99 I paid, however, I got my money's worth just for the entertainment value.If you want reliability and convenience, I'd say put the money towards a more expensive streaming box like the Roku, or see if you can just connect an HDMI cable or adapter to your laptop or tablet directly if you want true screen mirroring.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Very limited to what I can see. I mainly bought this to see dishnetwork program from my iphone. NO CAN DO. I can not even watch Amazon prime video also. NO GOOD! Why is this highly rated? I don't know. To Ebay!", "verified": true, "helpfulness": "1/2", "author": "The Buyer"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "edgar"}, {"rating": 4.0, "review": "Great product!", "verified": true, "helpfulness": "0/0", "author": "jimmy"}, {"rating": 5.0, "review": "Purchased for a gift. As expected. price comparable.", "verified": true, "helpfulness": "0/0", "author": "Cathy Reist"}, {"rating": 5.0, "review": "So far it works great.  I have yet to fully explore all that it can do", "verified": true, "helpfulness": "0/0", "author": "B. Shaff"}, {"rating": 3.0, "review": "This is actually pretty good if you want to stream movies from your computer.  You have to use the chrome browser and download a chromecast extension and you have to have existing wifi , but that is all pretty easy.  Once I opened the box it took a few min for an update to load and about 5 min to set it up on the computer to cast things from various web sites.  Your tv has to have a spare HDMI slot and there has to be an available USB port (or a nearby wall plug) to charge the device.The iPad and the iPhone are a different story.  That is a bit glitchy and still haven't gotten it up and running, but to be fair I haven't tried yet to trouble shoot.Keep in mind that the quality of the streaming doesn't get better on a high def tv - so the audio and  visual quality are only as good as the source your are streaming from.You can do other things on the computer without any issue and without anything on your screen showing up on the tv or and crosstalk interference.  Worth the 25$ I paid for itWill update when I try the native programs.", "verified": true, "helpfulness": "0/0", "author": "mg New York \"mg\""}, {"rating": 1.0, "review": "It only allows for all features with an extremely small group of phones.  Check their website before buying.  If your phone is not on that list don't bother.I have a quad core 1.2GHz, 1GB, Kit-Kat 4.4.2, and it basically only let me use YouTube and Netflix.  No mirroring, no vudu, etc.Biggest let down ever.", "verified": true, "helpfulness": "1/1", "author": "Nena"}]