[{"rating": 5.0, "review": "We only stream Amazon instant videos and prime movies, so the Fire has been great for us. Honestly, if my new BluRay player had the Amazon app, we probably wouldn't have needed the Fire. However, the ease of browsing, the ability to create and view the watch list, and the very user-friendly remote make it fun to use. No problems or complaints thus far (have had it a couple of weeks).", "verified": true, "helpfulness": "0/1", "author": "PhilFactor \"phlomas\""}, {"rating": 1.0, "review": "As much as I really don't care for the Roku, it sure beats the Amazon Fire... It keeps dropping the Wi-Fi signal for poor signal strength... As soon as you disconnect the power supply the signal strength is great, for awhile... Then it repeats... Your voice search islimited to Amazon only... I agree with all the other 1 Stars and their comments...Let Me Add..... The router is about 15ft away from the Fire... The signal strength is shown as excellent, very strong... The laptop being used in the same room is working fine... I switched back to the Roku and it works great...So I can only assume that the Amazon Fire is defective and has been returned for a refund...", "verified": true, "helpfulness": "7/15", "author": "IBMRBOB \"Mr. Bob\""}, {"rating": 5.0, "review": "It works exactly as advertised. This is so much more convenient for streaming movies and TV shows than my X-box gold account.  I programmed my universal remote with it so one click and I've switched from TV viewing to Amazon Fire. I then use the little remote that came with the Amazon Fire TV to actually select what I want to watch. I love the ease with which I can move between streaming content and just watching regular cable TV. I've never used Roku or any other device except the x-box so I can't compare this to those but I can't imagine anything working better.", "verified": true, "helpfulness": "0/0", "author": "Arthur Dameron"}, {"rating": 3.0, "review": "I have been exploring my television options, as most of the time I am happy enough with my big antenna and three sets of PBS stations, along with network TV. The day after I got the Amazon box I signed up with Netflix, as there just aren't many watchable items on Amazon prime. I can't justify $2.99 for a TV episode of a program I have heard about but never seen, and recent movies are priced at 4.99 or more for HD versions. With Netflix I can at least get a feel for Breaking Bad or Mad Men, to name a couple or well-known cable shows. The box installed easily and I am learning the navigation system. I will likely sign up with cable or satellite to increase my access to new and sports.", "verified": true, "helpfulness": "1/1", "author": "Lucinda B. Conley \"Cindy\""}, {"rating": 4.0, "review": "Needs some work but I'm sure you will get it fixed up betterBigger iconsAlpha selectless sensitive control", "verified": true, "helpfulness": "0/0", "author": "Margo D. Schafer \"Mrs Bear\""}, {"rating": 4.0, "review": "I gave this a few weeks of use before writing a review.It's a slick little box, with a great interface, and the fact that it plays Android games (relatively well) is very cool.The good points stop there for me. This is supposed to be a video player, but it's a really poor one. I'm not even talking about the issues with Plex, which I hope will soon get fixed by the Plex people. Simply streaming 1080p videos from Amazon, movies or TV shows, is a really poor experience.I have the Roku 3 as well, and both Roku and Fire TV are wired to the same gigabit ethernet switch, and going out to the internet with a 100mb+ connection. All 1080p streaming played on the Fire TV is very choppy, with dropped frames (even dropping digital sound) every few seconds, hang ups etc...doesn't matter what you play, be it a movie like the Avengers or a TV show like The Americans. It's just a jerky, choppy mess and is unwatchable.On the Roku, despite its really ugly interface, the exact same videos, from the same source, playing over the same network, are perfectly fluid. And I can say the same for my Kindle Fire HDX, which even plays them fluidly over wifi.Since this is primarily a video player, that's really too bad. It's as if the hardware is not strong enough to play 1080p video, but since the specs say this box should have no trouble, looks to me like something is very poorly optimized.As for the interface, it looks good and is great to navigate, much better than anything I've seen on the Roku, but they should really work on the animations because it's jerky as heck and annoying.As I was using only the Fire TV for a while, I tried everything I could to troubleshoot the choppy videos, even removing my router and connecting the box right to the cable modem, trying 5g wifi as well, swapping cables, bypassing the switch, and nothing worked, then I decided to reconnect the Roku and there is no sign of those issues on that box.Looks to me like the software/video player needs a lot of work and wasn't ready for prime time.Another issue: when streaming and playing movies, the Dolby Digital Plus sound level is very low compared to the \"classic\" DD 5.1 that's output by the Roku. I have to turn the sound up in my decoder much, much higher, getting really close to the max. Not a very full sound either. It is not possible to disable Dolby Digital Plus and simply have DD passthrough, as all you get is 2.0 sound otherwise.I hope the devs are working on new software for this because the nice hardware is really wasted on this box.--------------------------UPDATE 05/01/14--------------------------Update: I received a replacement Fire TV from Amazon, as I suspected a problem with the other one. I cannot tell if it was a hardware or software issue but so far the new box has been playing streamed 1080p videos very smoothly, all choppiness gone. So it is doing what it is supposed to do, and doing it well. I updated my rating from 1 to 4 stars. If the box had a good DLNA solution to play local files (with a good browser as well), I could probably give it 5 stars, but as it is, we have to use Plex for that purpose, and Plex is currently broken on the Fire TV. The issue is the same with Roku (although Plex works fine there) but my Boxee Box was great at organizing and playing local files from connected hard drive or DLNA server. Please activate USB storage, and give us a good DLNA solution, and this would be a perfect player.", "verified": true, "helpfulness": "4/9", "author": "David P."}, {"rating": 5.0, "review": "So I bought this product on the same day it was offered and it installed quickly and is working just fine.  The voice command button works OK but sometimes misunderstands my words.  This is a minor problem.  Every thing that the system was advertised to do it does with no difficulty.  I would recommend this product to any customer who has the prime subscription.", "verified": true, "helpfulness": "0/0", "author": "E. McConnell"}, {"rating": 2.0, "review": "I had intended to use this for Netflix and other subscription services which I already have.  While it's possible to do this, the voice interface does not work with these services, it only returns results from Amazon instant video, most of which must be purchased.  I was willing to give Amazon video a try, since I'd heard that a lot of content was included with my Prime membership.  It turns out that I couldn't find one single thing, except for very few shows actually produced by Amazon, that was available without an additional charge.  Even searching the web for free movies on Amazon Prime, I found that all of the results had since ceased to be free.What's even more irritating, however, is that along with the Amazon-only search results, you also see a \"more ways to watch\" button, implying that it will tell you whether the content is available through another service.  In reality, \"more ways to watch\" consistently neglects to show you results from other services, such as Netflix, even when they are available!  This is blatantly misleading, an obvious attempt to defraud consumers into purchasing content that they already have access to.  It's insulting.Moreover, the overall performance and interface experience are disappointing.  Non-amazon sources such as Netflix and Hulu Plus are apps, and their interfaces are not as sleek or consistent as the primary one.  Also, while some reviews claim that you will spend less time waiting for videos to load, my experience has been the opposite.  On several occasions, I've had Netflix videos become riddled with frequent, seemingly endless interruptions for buffering, and then gone to my computer and had the same video available immediately and without interruption.In short, Fire TV is little more than a portal for purchasing content, a la carte, from Amazon.  If that's what Amazon is going for, this device should be provided at no charge, since one could easily rack up $100 in video purchases a month or two.  The hardware itself seems to have potential (though I'm no expert in this), but the interface is currently mediocre.  I'm a returning the Fire TV and will order either Roku or Chromecast.", "verified": true, "helpfulness": "22/23", "author": "Taylor Haywood"}, {"rating": 5.0, "review": "No choking in the middle of a movie and no mysterious re-boots of the system. The games are a bonus and a great fill-in when there's nothing to watch. The only change I would suggest is that any Kindle on my network be allowed to interface with the system. At this time it appears that only Kindles registered to me will interact.Good Job!", "verified": true, "helpfulness": "0/0", "author": "Yo' Daddy"}, {"rating": 3.0, "review": "So, I bought this after my Roku died a month after its warranty expired, leaving a yucky taste in my mouth for that product. Figured I would switch to the Fire TV, since I love my Kindle.Here's my problem: NO HOCKEY.I have a subscription to the NHL Game center and no longer have access to it on my tv!  I've been watching on my Kindle (which is better than not watching at all, or on my phone), and am sorely disappointed that the NHL app, nor the NBC Sports Extra app cannot be viewed.Add these apps, and I'll change my rating to a 5!!! :)", "verified": true, "helpfulness": "3/3", "author": "thedanicakes"}]