[{"rating": 1.0, "review": "Had to disable UPnP on my router in order to install.  (No tech support to do this).- Once installed, the broadcast quality, transmission speed, was very poor.- Had to change setting to \"Poor Quality\" in order to \"cast,\" but the \"casting\" kept disconnecting.  I tried multiple times.- Nothing else was running over my network, so there was no interference either.  I pay for high-broadband speeds on Comcast, so I know it's not my router.- Could not display other things from my laptop either (like pics, videos, etc.) b/c it kept disconnecting.Very disappointed in this.", "verified": true, "helpfulness": "1/2", "author": "Tony B."}, {"rating": 5.0, "review": "The chromecast did exactly what it advertised and what I needed to do. Extremely satisfied and everyone loves it. I've used it in 4 different homes. I have no drawbacks and just expect it to get better!", "verified": true, "helpfulness": "0/0", "author": "Shelomythe Nelson"}, {"rating": 5.0, "review": "My family and I consistently watch NetFlix, gathered around the living room TV, slave to the Xbox.  Chromecast is perfect for us because we can now lay in bed and watch our movies and shows!  Setup was very simply (essentially plug and play).  As long as you're familiar with the NetFlix app for your phone or Ipad, using it is a breeze.  Just switch the TV input, pick your video, and press the ChromeCast button on your phone (which automatically shows up during setup).I highly recommend this product to anyone without internet capable TV's.", "verified": true, "helpfulness": "0/0", "author": "Evan MacIntyre"}, {"rating": 4.0, "review": "It is a great product. Very easy to use and clear picture. Only wish you could view anything from laptop or tablet instead of just selected apps like Netflixs and Pandora.", "verified": true, "helpfulness": "0/0", "author": "Peter Petersen"}, {"rating": 1.0, "review": "After getting the Chromecast as a Christmas stocking stuffer, we tried to get it working ourselves on our Toshiba and Philips flatscreen tvs.  We have broadband dish internet and using a brand new Linksys N750 wireless router.  After 30-minutes with the Google tech guy, an hour with the Linksys tech lady, a couple calls to the broadband service provider, a 30-message-long IM with an IT friend, and a couple hours searching the web for solutions...we got nowhere.  The Chromecast kept getting \"brainfreeze\".  Our wireless signal was strong as could be, too.Disappointed.  An entire vacation evening wasted on pulling my hair out trying to get Chromecast to work instead of enjoying it with my family.  THANKS!  =(", "verified": false, "helpfulness": "1/3", "author": "Daniel J. Auxter"}, {"rating": 1.0, "review": "Netflix doesnot work all the time. Devices like  these should work all the time. Bought Apple TV after got very disappointed with chromecast.", "verified": true, "helpfulness": "0/2", "author": "Andy"}, {"rating": 4.0, "review": "The Chromecast media player works as advertised.  Setup is very simple and straight forward.  Hopefully in the near future Chromecast will be able to stream more video file types.", "verified": true, "helpfulness": "0/0", "author": "Alex"}, {"rating": 5.0, "review": "I like the ease of use.  I wish, however, that I could stream other media such as Amazon movies as well.", "verified": true, "helpfulness": "0/0", "author": "Cistalu \"Cistalu\""}, {"rating": 5.0, "review": "I had no idea whether this thing would be worthwhile or not when I bought it. But at $35, I thought it was worth the risk. Turns out it works better than I ever thought it might. We were having connection issues when streaming movies from Netflix using our Netflix-enabled Blu-Ray player, and that was using a wired Ethernet cable. This device relies on our wi-fi connection, which you'd think would be even more prone to dropping the connection, but instead, it works much better. So now, we start the movie on a laptop, then \"cast\" it to the TV, close the laptop, and so far, it's played flawlessly every time. I only wish I could cast anything on my computer screen, not just web pages. Maybe next version...", "verified": false, "helpfulness": "0/0", "author": "lynne goldin"}, {"rating": 3.0, "review": "Works as advertised but needs more content.  Wouldn't play my mp3 s even though It said it would.  Add photos to list", "verified": true, "helpfulness": "0/0", "author": "David Parkinson"}]