[{"rating": 1.0, "review": "Got a dlink router? Then this isn't the dongle you're looking for.I have never had problems with a vast array of wireless devices until the chromecast.For your own sanity, try to get confirmation the device will be compatible with your network before you purchase.", "verified": true, "helpfulness": "45/57", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I think Google puts out a great product, but at times can be a little elusive in its descriptions.  I bought this to stream sports from the internet to my TV, which it did just fine through the Chrome browser.  Whe I went to the show full screen mode to stream a movie I was watching on my laptop to the TV, only video came through.  I researched this and that's all you get.  No audio, meant return of product.", "verified": true, "helpfulness": "0/2", "author": "Blake Lugenbeal \"Blake1806\""}, {"rating": 2.0, "review": "Can't stream HBO and numerous other video platforms.  Maybe once it gets upgraded a few times I will try it again.  Until then - it will remain shoved in a drawer with other useless gadgets.", "verified": true, "helpfulness": "0/2", "author": "Play Hooky \"Play Hooky Rocks!\""}, {"rating": 2.0, "review": "I am a huge fan of Google and their products, but was disappointed with the performance of the Chromecast. Most of the time I would try to cast something and my computer couldn't find Chromecast, even though the TV screen said that it was ready. I think that there were probably issues with my network, and perhaps I need to upgrade my modem and/or router. Having said that, I still think that the Chromecast device had something to do with it. I'm sure I will try again once I manage to sort out my network and make sure everything is up to speed.", "verified": true, "helpfulness": "0/0", "author": "Chad"}, {"rating": 2.0, "review": "So most of my music is not purchased from the Google play store and says that it can't play via Chromecast because it was sideloaded.  This is ridiculous as most customers music will be placed on a device via side loading which means you uploaded from another device, media card or wifi. Thinking about returning it for this reason alone.Also it would be helpful to be able to display my screen through Chromecast which is what I thought it would do.  There is some content also from YouTube that cannot play because of content restrictions.Netflix works fine.  Unless you are totally googlefied and all your content is bought via google looks like this product it not for you.", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great quality video, occasionally the sound is out of sync.Set up is a smooth as it gets.The cost would be great if it didn't mean I purchased a separate TV to ChromeCast my Chrome tab too while watching football.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I really like being able to send from virtually any device but it seems to buffer a lot more than other wireless devices need to, I was thinking that maybe it is overheating but I am still not sure. Sometimes it just locks up and I have to pull it out and let it cool down for a bit. I leave it powered up and plugged in all of the time for the convenience and maybe that causes it to get hot, I'm not sure.", "verified": true, "helpfulness": "0/0", "author": "Ben Engel"}, {"rating": 5.0, "review": "A quick unboxing a review of the New Google Chromecast. Google claims this is the easiest way to stream online media to your television, and they were right! This small device packs a big punch, at a price of only $35. check it out", "verified": true, "helpfulness": "1/1", "author": "Meredith \"Meredith\""}, {"rating": 5.0, "review": "We really enjoy the Chromecast, it was easy to set-up and we are now constantly broadcasting web pages and YouTube videos to the TV in full HD quality.  We are looking forward to try it with full length movies next.", "verified": true, "helpfulness": "0/0", "author": "Greg Gehlen"}, {"rating": 3.0, "review": "The synopsis:It at least works most of the time, and I basically got what I paid for - a $35 piece of plastic that plugs into a port on my TV and lets me send YouTube videos to it.The good (praises):* Setup was easy.  Plugged into my TV, and was pretty much painless to setup with an Android smartphone.* Getting the device to play YouTube videos and Play Music audio is straightforward and pretty simple to figure out.The bad (condemnations):* YouTube playback is awful.  Not only that, it's *inconistently* awful.  It's one thing when every single video experiences stuttering, but in this case, it seems like some videos play great and others - for no explicable reason whatsoever - mysteriously start stuttering.  It doesn't help that there's no easy way to install YouTube Center (or some equivalent) on this thing to disable YouTube's poorly-implemented DASH functionality; thus, it's not possible to pause the video and wait for it to buffer.  Thanks, Google!*** As an addendum to the above, VEVO's ads play without any issue whatsoever.  Y'all know that meme image that shows a massive datacenter for YouTube ads and an old 80386 desktop for the YouTube videos?  Yeah, the truth in that joke is more prevalent than anyone could possibly imagine...* When using the Play Music app, playback works fine when connecting to the Chromecast first, *then* playing a song.  Switch this around, and the Play Music app crashes upon trying to connect to the Chromecast.  This is probably a limitation of the Play Music app, however.The ugly (nitpicks):* The reconfiguration portion of the Chromecast app (i.e. for changing network details / device name, viewing license info, etc.) doesn't respond to touches half the time, making it a nightmare to reconfigure the device.* Zero Firefox support is lame, but at least I went in expecting this.  At least it's not too hard to launch a Chrome session if I want to send web pages to the thing.* Zero ability to change the backgrounds on the \"Ready to Cast\" screen.  Not *that* big of a deal, but I hope Google implements this in the future; I'd much prefer to have some of my own photos on there.* Zero ability to stream arbitrary files/streams, i.e. from one's local device.  I suppose I'll have to wait for a suitable app (and hope that said app doesn't get removed.  Thanks, Google!).The conclusion:* You get what you pay for.  If you want something more capable, I reckon you'd be better off with one of those full-Android plug computers.* My four-year-old niece could probably throw together a more competently-designed ARM-based Linux and stick it onto a Raspberry Pi, and it would only cost $20 or so more to do, SD card / HDMI cable / USB cable / USB-to-mains adapter inclusive.  The hardware's great, but Google really dropped the ball on the software - which somehow doesn't surprise me, come to think of it, now that I recall the various services that have gone to crap lately (*coughcough*YouTube*cough*).* Given that the majority of the issues I've been running into are software-based, I hope to someday be able to edit this review and bump up the number of stars.  Until then, the 3-star rating is generous.", "verified": true, "helpfulness": "0/0", "author": "YellowApple \"Ryan\""}]