[{"rating": 5.0, "review": "It works so well I bought another one for my other TV!", "verified": true, "helpfulness": "0/0", "author": "D. Chmielewski"}, {"rating": 5.0, "review": "So helpful and makes watching Netflix and YouTube on my phone so much easier!", "verified": true, "helpfulness": "0/0", "author": "Nikki"}, {"rating": 1.0, "review": "It's the worst. I'm not a tech guy. I want simple and I want something that works consistently. Chromecast is not that. It is always pausing in the middle if a show. When the phone rings I have to tap the app on my iphone, wait for Netflix to catch up, then pause it. Give me a break. Despite the iPhone, I am not an apple guy. However, the Apple TV I have on another TV has none of these problems. I will risk losing the Apple remote any day rather than struggle with Chromecast. Given this experience I seriously doubt I will be a passenger in a Google driverless car anytime soon!", "verified": false, "helpfulness": "0/1", "author": "Dospar"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "lucas"}, {"rating": 5.0, "review": "Gift", "verified": true, "helpfulness": "0/0", "author": "Grape \"wine\""}, {"rating": 5.0, "review": "great one.", "verified": true, "helpfulness": "0/0", "author": "Balasubramaniam Palanisamy"}, {"rating": 2.0, "review": "I can't get the thing to work properly.  If you like the nice photos it displays from the internet...it's ok.  Otherwise, I can't get the video from my pc to this device, regardless of the number of times I fiddle with it.  Maybe the Amazon fire stick is better.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Very satisfied", "verified": true, "helpfulness": "0/0", "author": "JIM  GREGO"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Carol"}, {"rating": 3.0, "review": "I was excited to get my Chromecast, but I have to admit I've ended up not using it that much. It needs more apps and more mobile apps and browsers need to be compatible with it. We have used it several times to allow people to present content on a 52\" LCD in our small theater for workshops and lectures and it worked fine for that.", "verified": true, "helpfulness": "0/0", "author": "J. S. Keck \"improviz\""}]