[{"rating": 5.0, "review": "love my fire!!!! i also have an old apple tv..the fire is 1080  the apple isn't.", "verified": true, "helpfulness": "0/0", "author": "Barbara S. Lubin"}, {"rating": 1.0, "review": "I ordered 1 fire unit and got 2 and was charged for 2. Brand new never used, won't work with my audio sound system. Would like to return. New unused.", "verified": true, "helpfulness": "0/2", "author": "3 kindles Customer"}, {"rating": 2.0, "review": "I have had my Amazon TV hooked up since Christmas 2014. But, I have one very major complaint. Although I pay for movies sometimes, I feel cheated when I pay for a movie that I could have watched free. How does this happen, you ask? Well when a movie is free on HBO Go, Amazon TV has a nice little check box stating\" watch now for free with HBO Go\" (a free app available on Amazon TV if you subscribe to HBO with your cable co). However if that same movie is available on Netflix (which also requires a subscription) another free app available on Amazon TV, there is no check box and Amazon will just charge you to rent or buy the movie instead.Now, after reading a bit about this issue, I find that Amazon and Netflix are having a petty squabble about money (pfft what a shock) but, as a consumer, that is not my problem and I find it extremely unfair for Amazon to cheat me out of my hard earned money to rent a movie that I could have watched for free.FIX THIS AMAZON!", "verified": false, "helpfulness": "3/5", "author": "Wendy WPB"}, {"rating": 3.0, "review": "It do not like the fact that I am not able to turn it off.", "verified": true, "helpfulness": "0/1", "author": "Francisco Romero"}, {"rating": 5.0, "review": "I had the Fire stick and was unhappy because it was constantly cutting out. This device is great, no problem with reloading or cutting out  The fire stick seems to work much better in the living room so I'm happy with both products now!", "verified": true, "helpfulness": "0/1", "author": "Lenora O Klinger"}, {"rating": 4.0, "review": "Good and fast to use", "verified": true, "helpfulness": "0/1", "author": "SENTHIL KUMAR"}, {"rating": 3.0, "review": "using fire TV keeps shutting down can not keep working. How can I get a new fire TV, I proceed a my yearly rate for Direct TV, anyway can a new so I get up and running. Any help would really be appreciation.Donald", "verified": false, "helpfulness": "0/1", "author": "Donald R. Bilbey"}, {"rating": 3.0, "review": "It's OK but needs more channels and access to local channels. Make next box with HD antenna.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I agree with  other reviewers that Fire TV seems cold. It is fast but it is also a sales tool for Amazon, everything points you to Amazon services. I have many DVDs that came with Digital Content codes for use with VUDU and / or Flixster; so far I have been unable to load the these apps on my Fire TV. This is a real issue for me as I don't wish to purchase all of the titles again on Amazon. I understand  that VUDU and Flixster are competitors with Amazon, however they bill Fire TV as a Streaming player so I think they should allow competitor's sites access. I will be looking forward to the Roku 4 release.", "verified": true, "helpfulness": "0/1", "author": "R. Daniels"}, {"rating": 4.0, "review": "was as expected love the talk feature", "verified": true, "helpfulness": "0/1", "author": "louis swiech jr."}]