[{"rating": 5.0, "review": "I originally bought a roku. I hated it. Returned it.  I wasn't sure what to get, so I went with the reputation of amazon. It is so easy to use. I would definitely recommend it!", "verified": true, "helpfulness": "0/0", "author": "VICKI DUNN"}, {"rating": 1.0, "review": "Amazon Fire TV did not work for me.  Movies kept freezing...however, I was able to stream them on other devices in my home.", "verified": true, "helpfulness": "4/6", "author": "Sheryl D. Rivers"}, {"rating": 5.0, "review": "It was easy to set up and works far better than expected.", "verified": true, "helpfulness": "0/0", "author": "Rachel Beasley \"Rae\""}, {"rating": 5.0, "review": "Awsome product we use everyday", "verified": true, "helpfulness": "0/0", "author": "stacy pokrinchak"}, {"rating": 3.0, "review": "no good free movies without subscribing to Netflix or purchase through Amazoncannot load music with Fire TV device, have to use phone or tabletDolby digital not compatible with my AV system, so have to use TV speakers", "verified": true, "helpfulness": "1/2", "author": "harry"}, {"rating": 5.0, "review": "Amazon sent me another remote, which works perfectly fine. Hopefully this new remote will not chew through batteries, so we'll see. Assuming that it won't, then all I can say is that Fire TV is better than Apple TV or even using the Xbox to watch Amazon, Netflix, HBO Go, etc. As of right now, I am extremely pleased with this product, and even more extremely pleased with Amazon's customer service! Well done Amazon!!!", "verified": true, "helpfulness": "4/7", "author": "By BizeeMama2"}, {"rating": 5.0, "review": "Absolutely love this!!!!!", "verified": true, "helpfulness": "0/0", "author": "Dee"}, {"rating": 1.0, "review": "Very excited to purchase and use this product. Set up was easy....I used it 2 or 3 times and loved it. Went to use it again and the device was broken. Wouldn't even turn on. Tried resetting it, tried a different HDMI cord, tried a different TV; all with negative results. I am sending it back for a refund. Afterwards, I read multiple reviews saying the same thing happened to them which makes me hesitant to buy another one.", "verified": true, "helpfulness": "3/4", "author": "Tracer"}, {"rating": 1.0, "review": "Why pay for prime when they shove banner ads on the home screen and front loaded on prime videos. Key word prime. why bother paying for the prime service if we have to suffer through ads now. Nice double dipping by Amazon. I'm off to find a hack for my firetv box, or just toss it in the garbage and try something else.", "verified": true, "helpfulness": "2/7", "author": "Gberdan"}, {"rating": 3.0, "review": "Can the Amazon Fire TV browse the internet?", "verified": false, "helpfulness": "0/3", "author": "Haden"}]