[{"rating": 3.0, "review": "It works but disappointed that I have to use a smart phone to navigate.  Tried using a Samsung tablet but because you need a 'device' where you can set the time to automatic, it would not work.  A good, affordable option for my use.", "verified": false, "helpfulness": "0/0", "author": "Erica Nembhard"}, {"rating": 2.0, "review": "i find it comical that amazon ads for the chromecast is all over the website but it doesn't cast amazon prime. that just seems idiotic. i have friends who have it and use it they love it it works great for netflix youtube hulu etc. get is working with prime then advertise the crap outta it not the other way around. then i would be excited to purchase it why is there no prime player in the google play store but one in itunes??? idk what issues amazon has with google but work it out the market is big enough for both giants.", "verified": false, "helpfulness": "1/1", "author": "DomDiesel"}, {"rating": 5.0, "review": "Changed how I watch tv. Easy to set up. Fun to use. Who needs cable now huh?", "verified": true, "helpfulness": "0/0", "author": "Leona O"}, {"rating": 5.0, "review": "Got tired of watching movies on my small desktop monitor.  With Chrome browsers tab casting feature, I can now enjoy streaming content on my 56\" set in the living room.  Setup is fairly easy with good directions.  Well worth the small price.", "verified": true, "helpfulness": "0/0", "author": "dnust1 \"dnust1\""}, {"rating": 5.0, "review": "Great device, updates itself", "verified": true, "helpfulness": "0/0", "author": "Roberto Serrato"}, {"rating": 4.0, "review": "We purchased two and have recommended it to our friends and family. We use it to stream Netflix, HuluPlus, and Viki through their respective apps. The chrome tab casting worked well on my newer macbook air, but it had some syncing issues (audio didn't match the video) when using an older samsung i5 windows 7 machine.", "verified": true, "helpfulness": "0/0", "author": "PiyoPiyo"}, {"rating": 5.0, "review": "This thing is great.  If you can't get Amazon movies/TV shows to stream, google the directions on the web.  You can do it.  Terrific and cheap.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great service and great product!I love this product for watching YouTube videos!  The experience is the best of both worlds; You get the ease of searching on your Ipad and the video quality of viewing on your TV.", "verified": true, "helpfulness": "0/0", "author": "CF"}, {"rating": 5.0, "review": "We use it every week.  Makes it nice to share content from mobile devices with family and friends.  It also works nicely if you have netflix.", "verified": true, "helpfulness": "0/0", "author": "Chad E. Stevens"}, {"rating": 5.0, "review": "ok", "verified": true, "helpfulness": "0/0", "author": "JOHN F TOURTELLOTTE JR"}]