[{"rating": 4.0, "review": "We love this Chromecast and I would have given it 5 stars, but it was difficult to get it started.When we plugged it into the TV, it did not want to stay one.We've had a few other issues with it.Sometimes it does not want to work and we have to keep retrying it.When it does work, it is awesome.I would recomment it to friends.", "verified": true, "helpfulness": "0/0", "author": "Judy D"}, {"rating": 5.0, "review": "This has allowed family members to watch movies on Netflix and videos from Youtube within the comfort of the family room where the big screen TV is located. I am presently benefiting from the Netflix 3 month free trial resulting from said purchase (made btw within hours of product launch).", "verified": true, "helpfulness": "0/0", "author": "EFG"}, {"rating": 5.0, "review": "Was on time and I'm glad to have it ,was easy to install, I'll recommended ,I used it on my iPhone and MacBook Pro", "verified": false, "helpfulness": "0/0", "author": "Guero"}, {"rating": 5.0, "review": "I have owned my Chromecast for a couple months now, and can easily say it is the most used gadget in my house. Netflix, YouTube, and Pandora all perform incredibly well on this little device, and have improved my living room experience. With the Chromecast, I can easily go from TV off to watching House of Cards in 30 seconds flat - much faster than having to turn on your game device or smart DVD player to watch. You can also use a beta function in the Chromecast extension for Google Chrome that allows you to cast your entire desktop to the TV (much like AirPlay mirroring on an Apple TV). This works decently well, albeit fairly slow for me.Definitely going to be buying a couple of these as Christmas gifts this year.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 5.0, "review": "This a great product. Works as described with no issues. I do wish they would add more services to this but seeing that you can watch anything through Chrome browser, it works fine.", "verified": true, "helpfulness": "0/0", "author": "David"}, {"rating": 5.0, "review": "I have an apple tv and a roku 3, so the Chromecast wasn't really needed. But at $35 I bought two: one for me and one for my Dad. I can say I'm very satisfied. I can cast youtube and netflix videos from my pc and my smartphone straight to my tv.", "verified": true, "helpfulness": "0/0", "author": "damarques"}, {"rating": 5.0, "review": "Works as expected. Cannot beat it given the functionality and price point. If you're eager to minimize cable and device clutter, this is for you.", "verified": true, "helpfulness": "0/0", "author": "Igor Vrcel"}, {"rating": 4.0, "review": "I love Google Chromecast.  What a great alternative to having cable.  It does disconnect every now and then, but now often.", "verified": true, "helpfulness": "0/0", "author": "T Williams"}, {"rating": 2.0, "review": "I was disappointed by the functionally. It only provides. Plugins for netflix and hulu.  I was expecting to be able to stream local,content to my tv using chromecast.Basically a waste of money for what it can do. Google needs to open it up to third party developers", "verified": true, "helpfulness": "0/1", "author": "Bert Paquin"}, {"rating": 4.0, "review": "Works great, easy setup etc. I watch streamed shows from NBC, etc. via Chrome browser to TV and it works great. Would like more apps that support it (Amazon, etc). Watching Netflix / Web Videos on 60\" plasma come out perfect. Can't beat the price for what it does.", "verified": true, "helpfulness": "0/0", "author": "Curt S. Hayes"}]