[{"rating": 5.0, "review": "Order was processed very quickly - initially they said shipment in 7-10 days, but they shipped it the day after I ordered! Packaging is very simple, easy-to-follow directions are printed right on the inside of the box when you open it. It is truly plug and play -  just follow the directions and you'll be up and running in 5 minutes. Just watched a TV episode on Netflix, excellent picture quality, no lag time or stuttering, really awesome to be able to control everything directly from my phone (I have a Galaxy S4)!", "verified": true, "helpfulness": "0/0", "author": "Sarah P."}, {"rating": 3.0, "review": "Others have reviewed the Google Chromecast for it's capabilities and ease of use. I want to make a couple points on it's limitations.First, it only works for applications that are designed (or have been modified) for it. That currently (September 2013) means Netflix, YouTube and Google Play. I use Netflix and very occasionally YouTube, but I don't buy/rent individual DVDs from Google Play, so this thing is pretty limited. Maybe other app developers will upgrade their products. Wait and see.Second, it doesn't work with Chrome (!!) browsers except on certain devices. It definitely doesn't work with any smartphone browser and it doesn't work with Google Chrome on my \"ancient\" Galaxy Tab 7.In fact, the only real use I get out of it is to cast via Netflix (smartphone and browser). At $35, that is a worthwhile convenience, but if you are buying this to do more (especially to cast tabs from a browser), you may be disappointed. I know I was.Google says it is early -- that many more cast-enabled apps are in the pipeline. But I doubt they'll go back to add cast capabilities to (pre-28) Chrome browsers in earlier Android OS versions. My Samsung Galaxy Tab 7 cannot be upgraded as this time, so it looks like Netflix today, Netflix tomorrow and Netflix forever. (With apologies to George Wallace.)It also should have MiraCast capability.", "verified": true, "helpfulness": "1/4", "author": "Rob Pecherer"}, {"rating": 2.0, "review": "I have the unit but I was it was better, keeps freezing up on my.I may need to get closer so it will work. but you would think you can sit away where but I guess not", "verified": true, "helpfulness": "1/5", "author": "Darnell"}, {"rating": 5.0, "review": "great device.  easy to setup and use.  A few companies are blocking it's mirroring capabilities (silverlight and therefore amazon instant) when full screen.  Otherwise it is perfect.  For the same cost as many HDMI cables, this acts as a wireless HDMI with some (albeit limited) apps.", "verified": true, "helpfulness": "0/0", "author": "AmandaC"}, {"rating": 5.0, "review": "Easy and Simple setup.  Great streaming of Netflix and Youtube.  Very impressed with the quality of the stream and ease of use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Best thing about this is its price compared to the Roku and AppleTV. But, all it runs is Netflix, Youtube, and your Google Play stuff. That's it! That's all it does! You like Amazon Prime video? Too bad! Hulu Plus subscriber? Go hang!Also, while the device itself is famously tiny, it still requires a power cord which largely negates the convenience factor.If all you subscribe to is Netflix and you never buy or rent video from the site you are currently browsing, and if you never plan on ever getting Amazon Prime either, and you have no interest in the vast channel line-up of the Roku, then sure, I guess buy this and save a few bucks... otherwise, go for the Roku 3 and never look back.UPDATE: despite several tries at rebooting our Android phobe and uninstalling and reinstalling Google Play, there is simply no way we can stream movies from Google Play to the chromecast, despite being on the same wifi network. The \"cast\" button simply does not appear in the app, and nothing will bring it up. It should be noted that the Roku is not limited by a failure on a phone/tablet app since all its apps are stored internally and does not require a smartphone or tablet whatsoever. Anyway, the Chromecast has been an unmitigated disappointment, and we regret the purchase.", "verified": true, "helpfulness": "1/2", "author": "Mark Cardinal"}, {"rating": 5.0, "review": "Is a must have I have one on each tv hope they will have more apps well worth the money", "verified": true, "helpfulness": "0/0", "author": "robert lucas"}, {"rating": 3.0, "review": "I'm a techy guy so I was impressed with how the Chromecast device found the wifi using an app.  That being said, you need to install software on your computer/phone in order to get it setup and it took a few attempts for it to all get setup correctly.  The streaming quality is good when the signal is strong, but quickly degrades if not.  My biggest gripe is with how they chose to implement the casting software in Chrome.  It's a little wonky and only streams certain things (like NetFlix and YouTube) but sometimes the controls are weird and so if you navigate away from the page you're watching it can be hard to regain control of the streaming video.  I wish I had a more traditional \"remote control like interface\".", "verified": true, "helpfulness": "1/1", "author": "JMac"}, {"rating": 3.0, "review": "We live in a neighborhood where part of our dues pay for wifi.  Since there is a splash screen to log in, we cant use it.  We are thinking of setting up a private network, but why bother.  So if you live in an apartment, dorm, condo, hotel don't bother.", "verified": true, "helpfulness": "1/1", "author": "Scott Stillman"}, {"rating": 4.0, "review": "Slick little item.  For $35 you can't complain much.  It's a little deceiving the way it's marketed.  It makes it look like it'll just plug and play in the HDMI port, like a USB stick, but it does have to plug into a power source to function so make sure you have another outlet handy nearby.  There is a little delay on the Chrome browser to Chromecast but the Netflix and YouTube player is seamless.  At the office, everyone on the network using Chrome (even on the iPads), automatically saw the cast icon so it was instant for anyone to cast without having to setup any machines. It would be great if they add Amazon Prime or Hulu Plus to the player capabilities.  We'll see.", "verified": true, "helpfulness": "0/0", "author": "Dan the Man"}]