[{"rating": 1.0, "review": "This might be a good product, but it overheats and turns off every time I watch Netflix.", "verified": true, "helpfulness": "1/4", "author": "POP!"}, {"rating": 5.0, "review": "I received this a Christmas gift....I love it!!!", "verified": true, "helpfulness": "0/0", "author": "Anne Lee Ureta"}, {"rating": 4.0, "review": "I received this as a Christmas gift and I have really come to love it. I have netflix, and the ability to access this and other apps is great. The only drawback I (and the reason for only 4stars) is that I don't find it easy to find the free prime content through this menu system. It may just be a learning curve and I may adjust my rating in the future, but for now searching Prime content via computer is easier for me.", "verified": true, "helpfulness": "0/0", "author": "Steve S."}, {"rating": 5.0, "review": "Bought this item after trying another brand streamer. Was not able to do what I wanted on other product. Opened this and within minutes was up and going and absolutely marveling at a whole new world of media available to me. I admit am a prime member so there is a multitude of things available to me. But with all the things you can do with this you will be surprised. Streaming is all but instantaneous. Choices are extensive in tv movies and games.I use Plex app and am able to stream videos and pictures and music right to it from my computer with ease. Over all am quite pleased as I learn more and more with it how much is opened to me with this awesome box! The usb availability really makes it more versatile as I use it to hook up a wireless mouse and keyboard.One little thing I would like to see added to it would be a browser app or a built in browser as the choices would be even more. Owning this am seriously thinking about cutting my cable cord and maybe adding netfilx and be totally happy", "verified": true, "helpfulness": "0/0", "author": "Dragonfyre"}, {"rating": 5.0, "review": "Love this!  Allows me to watch Amazon Prime and Netflix.  Fantastic!", "verified": true, "helpfulness": "0/0", "author": "Diana L. Mieltowski"}, {"rating": 4.0, "review": "The voice recognition system is very good.", "verified": true, "helpfulness": "0/0", "author": "James Henley"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Stephen Liscinsky II"}, {"rating": 5.0, "review": "Good product, easy to use.", "verified": true, "helpfulness": "0/0", "author": "Deanna M. Lowell"}, {"rating": 5.0, "review": "Oh my goodness does my husband LOVE this Amazon Fire! I got this for him as a Christmas gift and he has been using it more than cable to watch TV shows and movies. The only smart TV we have is in the bedroom, so he hooked this up in the family room. Amazon loads really fast and it's user friendly too. I honestly can't see anyone having problems setting it up. It's also so small and compact, that you will hardly notice it sitting there. The remote is small too so you don't have another big old clunker sitting out. Great purchase and am very happy we went with this instead of the Amazon Fire stick.", "verified": true, "helpfulness": "1/1", "author": "Kathy"}, {"rating": 5.0, "review": "The Fire TV has really made me glad that I chose to \"cut the cord\" and stream television.  Between having Amazon Prime, Hulu, and Netflix-I have plenty of entertainment and this device has saved me money by dropping my cable bill in just one month that it basically paid for itself.  It is a very simple device to use and I really like the interface to navigate to all of the shows and apps.  I haven't gotten to use the voice search as much because it only searches for shows on Amazon and not on Hulu or Netflix (hopefully that will be something it can do in the future).  All in all a really great device and another reason why I enjoy Amazon, not only as a company, but also for the devices they produce.  I have the Fire TV stick coming so I can have it for another television in my house.  I really don't think you can go wrong getting the Fire TV.  Just a note, I had ordered an extra voice remote, but found out after sending one remote back and two different calls to customer service that only one remote can have voice control.  So just be aware of that fact that you will spend 30 dollars on something that you can't fully use.  Other than that I really think I made a great purchase.", "verified": true, "helpfulness": "1/1", "author": "Luke B"}]