[{"rating": 5.0, "review": "Chromecast is pretty wicked. All you need to know.", "verified": true, "helpfulness": "0/0", "author": "Brian Keener"}, {"rating": 5.0, "review": "cheap, easy to setup, simply amazing!", "verified": true, "helpfulness": "0/0", "author": "Jose B"}, {"rating": 3.0, "review": "you have to keep reseting Chromecast application,which becomes very annoying.", "verified": true, "helpfulness": "0/0", "author": "Marsella"}, {"rating": 1.0, "review": "The back wire broke.", "verified": true, "helpfulness": "0/0", "author": "jean santiago"}, {"rating": 5.0, "review": "It's still a work in progress, but there is plenty to love about it. I use it mainly to cast YouTube on TV. Others of its functions are quickly being debugged currently for hardware compatibility. Check recent blogs for latest status.", "verified": true, "helpfulness": "0/0", "author": "Vernon Cooper"}, {"rating": 4.0, "review": "This thing is great. Set up is a breeze (if you're a bit tech savvy), just unbox, plug into hdmi, and log into your wifi--done. Being able to stream any kind of online media to the tv in this digital age of streaming media is awesome. Stream silly youtube videos to your tv or movies--or blast youtube music at a party. All wonderful.Pros: Rock solid reliability (never failed once, still kicking)  $35 is an incredible deal for this kind of utility.  Works with any device with HDMI (make sure it has a way to play volume though, won't work on a monitor without it)Cons: The streaming can sometimes get a bit laggy when streaming from a chrome browser. I'm not sure if this is related to my internet speed, or the device itself. But it is occasionally frustrating to have your show get choppy right at that climactic moment. But this is a small price to pay for the ease of watching whatever you want on anything that happens to have an HDMI port.I would give it a five star review if the streaming was always perfect. I'm sure newer models or newer internet speeds might make this happen eventually though. For now it is still fantastic.", "verified": true, "helpfulness": "0/0", "author": "Elliot Scott"}, {"rating": 5.0, "review": "LOVE IT! It is so convenient to have this on our TV since we don't have any cable, but watching endless videos on YouTube streaming on the TV makes it much easier and fun for us!", "verified": true, "helpfulness": "0/0", "author": "Lei Francisco"}, {"rating": 1.0, "review": "great item if it would work and not froze up every twenty minutes", "verified": true, "helpfulness": "0/0", "author": "a"}, {"rating": 4.0, "review": "I purchased a Chromecast in November of 2013. It finally quit working last night. I will likely end up purchasing another one because its competition, such as the Fire Stick (I also own one of these), doesn't offer the same functionality. With this I can watch online videos without needing a long cable to reach my TV or need the videos to come from a specific subscription. Another advantage is my computer can cast a single tab and leave the computer still functional for another user (versus just plugging my computer directly into the TV). At the beginning the chrome extension was not all that reliable, but over time has improved to the point of no question the streaming will work.Disadvantages: At least the version I had (not sure if any fixes/new versions have been made) consistently got very hot to the touch. This was concerning and sometimes caused it to stop working. You'd have to unplug it and wait for it to cool down. It would of course heat right back up, but it would at least function again. The HDMI connector didn't seem that sturdy. My Chromecast was not really ever moved from being in the television yet that seems close to breaking off. The final nail in the coffin for my Chromecast was the small USB port (of whatever variety it is, micro, mini, whatever.) has become loose to the point that the cable will not really fully connect and it no longer can stay powered up.I hope that a new one will be more sturdy from the version that I purchased in 2013, but I have no idea if they have made any changes.", "verified": true, "helpfulness": "1/1", "author": "K.F."}, {"rating": 5.0, "review": "Very good,", "verified": true, "helpfulness": "0/0", "author": "sarah"}]