[{"rating": 5.0, "review": "Love this! Easy to set up too!", "verified": true, "helpfulness": "0/0", "author": "Mikaela"}, {"rating": 5.0, "review": "Good product. Great delivery time. Arrived as promised. Love Amazon.", "verified": true, "helpfulness": "0/0", "author": "raf dog \"raf dog\""}, {"rating": 3.0, "review": "unit is fine but dissapointed in how it will not easily play movies from pc to tv", "verified": false, "helpfulness": "0/0", "author": "Arthur Collins"}, {"rating": 1.0, "review": "The Google Chromecast is definitely a poor choice if your Internet service is provided via DSL. The bandwidth my modem transmits is not adequate to support wireless streaming through this device (and my wireless modem is about 6 feet from the device - with no obstruction). I am an experienced user, and cannot recommend this item to anyone, unless that user has the knowledge they have the adequate bandwidth to support wireless streaming. I was also disappointed to find that Google Chrome running on my Mac could not cast to this device. What a disappointment! Apple TV has been a much better device for me, since it allows a wired connection to my DSL modem.", "verified": true, "helpfulness": "0/2", "author": "Bwdgran \"bwdgran\""}, {"rating": 5.0, "review": "this thing worth the 5 stars for the cheap price great fast performance ..I used it for a while now and I think if you have a fast internet connection then buy it and don't hesitate ..the new chromecast update allow you cast your whole screen which is useful in playing games on the big screen..", "verified": true, "helpfulness": "0/0", "author": "Hasan"}, {"rating": 3.0, "review": "Can't use in WiFi with a redirect (hotels, barracks,  anywhere you have to sign in)", "verified": true, "helpfulness": "0/0", "author": "John Menger"}, {"rating": 5.0, "review": "Just terrific!", "verified": false, "helpfulness": "0/0", "author": "Victor Guevara"}, {"rating": 5.0, "review": "Love my Chromecast.  Super easy to setup and download app onto my phone.  Even my kids know how to put a show on from their iPods.  Great product at a GREAT price!!", "verified": true, "helpfulness": "0/0", "author": "Dora"}, {"rating": 5.0, "review": "Love Chromecast!  This is actually my fourth one.  Use them to stream basically anything I need (even screen cast from my phone).  Well done, Google.  Simple. Easy to use.  And always getting better.", "verified": true, "helpfulness": "0/0", "author": "Cranberryfries"}, {"rating": 2.0, "review": "The price was right and I picked it up.  The set up required some web searches but was eventually successful.  The device is similar to airplay in the sense you play a video on your apple (or android) device and send it wirelessly to the chromecast which displays the video to your tv (similar to airplay and the Apple TV).  Not every apple app supports the device though the big ones primarily do. Once you send the video over to chromecast, the device takes over streaming the video and you can use your apple device for something else. I even turned mine off and the video kept playing. That brings me to the flaw. Trying to pause or stop the video is almost impossible unless you still have the app up and running in memory. If the app is cancelled the chromecast keeps merrily playing the video until you unplug the chromecast power, hence the flaw.  If you can live with that, the price is right.  Otherwise, I would pass.", "verified": false, "helpfulness": "0/0", "author": "Richard"}]