[{"rating": 4.0, "review": "I bought this because the TV in my bedroom isn't a \"smart TV.\" The Chromecast does exactly what it says it does, was really easy to set up, and works great. I wish it was compatible with amazon Prime streaming, but sadly, it is not. That's just about the only downside.", "verified": true, "helpfulness": "0/0", "author": "Misti Mackey"}, {"rating": 5.0, "review": "This is a great product to have. I enjoy listening to Pandora on my tv. My kids love to stream youtube videos.", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 5.0, "review": "We use this all the time. It generally works flawlessly. I hope more and more companies make their streaming products compatible with Chromecast. If you think you may want this, you do. Will be buying another for my house. Main use on this is at office.", "verified": true, "helpfulness": "0/0", "author": "Tim Benton"}, {"rating": 4.0, "review": "This is a great little gadget, I just wish there were more apps that I could use with it -", "verified": true, "helpfulness": "0/0", "author": "Melissa"}, {"rating": 5.0, "review": "Works fine.  The only problem I found is the Apps for the iPhone seem to be limited for pictures, but the Android picture App (Dayframe) works fine. For videos, RealPlayer Cloud works great for both Windows PC and my iPhone.  I would like more Windows Apps for my PC to work with Chromecast.", "verified": true, "helpfulness": "0/0", "author": "Stephen G"}, {"rating": 4.0, "review": "I like it a lot very easy to install and setup it took less then 15 minutes from open box to plugged in and working no complaints", "verified": true, "helpfulness": "0/0", "author": "Dale S. Reeder IV"}, {"rating": 5.0, "review": "Great little device. It may be small, but works great. Stream from Netflix, Youtube, HBO Go, and the library continues to grow. Use apps like Allcast to see your own videos from your phone ot tablet on your TV. Price is way better than similar devices.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Once I figured out how to install it then I liked it but it was not too intuitive. They should consider improving the instuctions", "verified": true, "helpfulness": "0/0", "author": "Harold F. Kessinger"}, {"rating": 4.0, "review": "Does everything it says on the tin, works with plex and netflix, was well as other video sites. makes youtube very functional on the tv.", "verified": true, "helpfulness": "0/0", "author": "Justin Reiners"}, {"rating": 5.0, "review": "I love my Chromecast.  I have had 0 issues with it since purchasing it.  I primarily use Chromecast for Netflix and HBO Go and it works flawlessly.  I highly recommend this item.", "verified": true, "helpfulness": "0/0", "author": "Eric Hamilton"}]