[{"rating": 4.0, "review": "This thing works great and you can stream anything that you can play in the Chrome web browser. For local content, just drag and drop into Chrome, and it will play on your TV! Would be nice if it would store multiple SSIDs for portability though!", "verified": true, "helpfulness": "0/0", "author": "Dan Marafino"}, {"rating": 5.0, "review": "I have several Rokus that can't stream youtube and a modern large Panasonic Plasma and a large Sharp LCD that do stream youtube terribly.This device fits works seamlessly with all of the Android and IOS devices in the house for control and I would definitely recommend it as a great value.", "verified": true, "helpfulness": "0/0", "author": "Dustin Aldridge"}, {"rating": 5.0, "review": "I love all my favorites video I can watch on my big screen. Doesn't freeze, I enjoy a lot, I think every person sure try one of the best item I bougth", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 5.0, "review": "Simple to install, easy to use, inexpensive. I usually can't get any electronic device to work without help but I had no problem with the Chromecast.", "verified": true, "helpfulness": "0/0", "author": "David Creutzinger"}, {"rating": 5.0, "review": "i am very interested in a 46-47inch smart tv google lg.Waiting on finding a good deal during the holiday sales at best buy in my area.", "verified": true, "helpfulness": "0/0", "author": "VERNON COLEMAN"}, {"rating": 5.0, "review": "He was right.  ;)  Now when he wants to show me something online he just tosses it up on the tv, and I do the same, rather than running back and forth to the others computers.  Toss Netflix up to watch movies.  So easy.  Now we just need an easy way to get our amazon videos up there and we would have it all.", "verified": true, "helpfulness": "0/0", "author": "Melissa Smith"}, {"rating": 4.0, "review": "Looks like it will be nice to have product / service.  The device itself is very inexpensive.  It was however not simple to install and there is NO DOCUMENTATION to help.  It got on the wrong wireless network in my house and I had problems uninstalling it, then re-installing correctly.  Mostly by trial and error.  The costs of service plans from different vendors are not easy to find but some like UTube are free and fun to watch.  Controls to re-run portions of what you are watching are very crude and not easy to use.Overall --  it is a good entry point for this kind of service (Web downloaded TV programs) but you need some technical knowledge to install properly and use.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"Frugal Consumer\""}, {"rating": 5.0, "review": "Works just like it says.It would be nice if you could play movies or video from your phone or iPad,", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"sboston2000\""}, {"rating": 5.0, "review": "I love these chromecasts.  they are extremely easy to set up and function perfectly.  I have bought several of these and plan to buy more for the holidays.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Great productsmall and handy and at very low priceIt fits well the TV and connected well to my home WIFI and my laptopOnly \"problem\" is that apple wants money for the \"free\" appwhile it is fee for Android and Chrome", "verified": true, "helpfulness": "0/0", "author": "Yuval"}]