[{"rating": 5.0, "review": "I tend to be on the frugal, minimalist side and wait until I'm sure if I need something before purchasing.  I was hooking a laptop or tablet up to my TV using a HDMI cord, but every time I needed to pause or play, I had to get off the sofa and squat down by the TV to pause/play on the computer--the old-fashioned way.  If you use the chromecast, you hook it in your TV once, and then you can stream from your tablet, iphone, laptop, chromebook, etc. without getting up once--SOOOOO NICE!!!  If you're like me and on the fence about purchasing this, I'm here to tell you that you will not be disappointed!!!  Why didn't I buy this five years ago!!", "verified": true, "helpfulness": "0/0", "author": "Heidi"}, {"rating": 3.0, "review": "Works for what it does, but does not fulfill its potential.  Disappointing that it is not able to stream DLNA.  Also, having to initiate on another device and then cast to this is a bit of a pain, when plenty of products keep everything natively on the device.  This was a first for devices being this small, but is far from the best.", "verified": true, "helpfulness": "0/0", "author": "Bricketh"}, {"rating": 5.0, "review": "Great Device...", "verified": true, "helpfulness": "0/0", "author": "Jeffrey McFall"}, {"rating": 5.0, "review": "I liked it so much that I've bought more for every television in the house.  Have even given as a gift.", "verified": true, "helpfulness": "0/0", "author": "rod"}, {"rating": 5.0, "review": "This is the best send image in hd!!", "verified": true, "helpfulness": "0/0", "author": "fernando"}, {"rating": 4.0, "review": "Usually works great, but has a tendency to freeze-up about once a week. Unplugging power and plugging back in fixes it.", "verified": true, "helpfulness": "0/0", "author": "MATTHEW T MILLER"}, {"rating": 5.0, "review": "I highly recommend this for anyone who enjoys Netflix (& If you have an Android phone).", "verified": true, "helpfulness": "0/0", "author": "scholzyy"}, {"rating": 5.0, "review": "Awesomely gadget", "verified": true, "helpfulness": "0/0", "author": "JONATHAN DURVELLE"}, {"rating": 5.0, "review": "I get to use the word \"Dongle\", need I say more?", "verified": true, "helpfulness": "0/0", "author": "MacDonald's"}, {"rating": 5.0, "review": "Really nice, my only beef is that the chromecast won't let me turn on my tv when the chromecast is plugged in so I have to unplug it before I can turn on the tv or else it will make the tv turn off again", "verified": true, "helpfulness": "0/0", "author": "Miss da mina"}]