[{"rating": 5.0, "review": "Excellent product. I bought it as a gift for my daughter. I bought one when they came out and is one of the best products of this type.", "verified": true, "helpfulness": "0/0", "author": "David Ruiz"}, {"rating": 4.0, "review": "One of the easiest Android-centric streaming devices to use. Downside is that it loses sync to the phone sometimes, making you close out of Netflix or the like and reopen to regain play control.Hope they make a next gen product and keep improving!", "verified": true, "helpfulness": "0/0", "author": "Kim"}, {"rating": 5.0, "review": "Great product for the price! Works great with all my wi-fi capable media devices. Good picture quality. Perfect gift idea!", "verified": true, "helpfulness": "0/0", "author": "oleg mashkov"}, {"rating": 3.0, "review": "Returned it because could not use my mobile hotspot from my cell phone, I realized  because it is single and not dual band.", "verified": true, "helpfulness": "0/0", "author": "Ms.Toy"}, {"rating": 5.0, "review": "Works like it's a supposed to. I love how simple it is. It has a little delay when you're streaming google chrome web browser. But that's definitely not a deal breaker especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Galen"}, {"rating": 4.0, "review": "depends on your internet connection.  I think apple works better", "verified": true, "helpfulness": "0/0", "author": "Randy Lay"}, {"rating": 5.0, "review": "I love this thing. I have bought like 5 of them for myself and my family. Its the best way to watch Netflix, Hulu, Plex Etc.", "verified": true, "helpfulness": "0/0", "author": "Misericordia"}, {"rating": 1.0, "review": "It wouldn't stream quickly enough!  Super choppy.  We have very fast wifi on our computers and devices, so I don't think that was the problem.", "verified": true, "helpfulness": "0/0", "author": "S. McKenna"}, {"rating": 2.0, "review": "This product is Ok. Lack in apps and channels and mirroring feature work fines with netflix and youtube only.Mirroring is too slow for any online video other than netflix and youtube.Apple tv or roku are better than this.", "verified": true, "helpfulness": "0/0", "author": "Dhruv"}, {"rating": 5.0, "review": "Love it , I cast screen and watch music and youtube on TV", "verified": true, "helpfulness": "0/0", "author": "Ali Saberi"}]