[{"rating": 5.0, "review": "I wanted to try Crome cast for a while and when I saw it was on sale I jumped at the opportunity. You pretty much plug it in and go. It can be plugged into your tvs USB port to power it or if your TV lacks USB it comes with an adaptor with about 6' of cord. The picture is great! My one and only \"complaint\" is that you have to select each time you want to watch so TV shows won't automatically go to the next episode (hulu and netflix) which is just a mild inconvenience really and likely has more to do with the Netflix and hulu apps.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Awesome idea, great price. I'm getting great reception. Can't watch Netflix yet,but as I understand it ; it does not work with slower internet reception. Unfortunately that's the best I can get from my Country in US location. Otherwise, great since my son, who lives in the city, recomended it. It is working great for him. Try it! Great clarity!", "verified": true, "helpfulness": "0/0", "author": "mame"}, {"rating": 1.0, "review": "My tv is only 5 years old.  After 2 hours on the phone I was told that the Chromecast has a different communication protocol than my tv and will not work.  Try it with a different tv!!!!!!  If I can't use it with the tv I bought it for I don't want it.", "verified": true, "helpfulness": "1/3", "author": "Debisz"}, {"rating": 5.0, "review": "I now have wifi on my TV - mostly Youtube and HBO GO. Would love to use Amazon streaming (as soon as they get it on Android) - tick tock!", "verified": true, "helpfulness": "0/0", "author": "Heath"}, {"rating": 5.0, "review": "Simple to setup, simple to use, works as advertised/expected. The fact that just about anything can control it makes it a *must have* item", "verified": true, "helpfulness": "0/0", "author": "Thomas Ehardt"}, {"rating": 4.0, "review": "Great product with lots of more apps coming now that the api is opened up for developers. Great for Netflix streaming alone.", "verified": true, "helpfulness": "0/0", "author": "Michael Schafir \"RVaddict\""}, {"rating": 5.0, "review": "Who would have thought that a 35$ product could eliminate my need for cable or satellite. Considering the fact that I only watch about 12 stations, why pay for 200?  Works well with a small inexpensive tablet. I replacing all my TV's in the home and saving 80$/month in satellite bills.  And that was without premium channels,", "verified": true, "helpfulness": "0/0", "author": "barbara e lewis"}, {"rating": 5.0, "review": "First off let me say that this is the first streaming device I've tried. I use to run an HDMI cable and the last thing I need is more cablesto trip over & for the cat to attack.(look bad too!)  Best $35  I ever spent towards entertainment! Works exactly as described. Many sites like,Netflix,Youtube,Vevo, etc. are optimized for Chromecast and the list seems to be growing. The tab casting which is still beta says it requires a fast internet connection & powerful PC. I'm using a chromebook & a 2011 Xperia play 4g cell phone. The HD picture quality & digital sound are incredible. Absolutely no lag, looks great! I love the fact that I can watch any video online now on my T.V. right from my cell. When I cast tabs in settings in order for it to stream well, I drop down to 480 p & uncheck the automatic resize & then works awesomely and that's using a lousy chromebook with 30 mb wi fi connection. I just love how it makes watching anything now in HD on the big screen as simple as tapping a button!!", "verified": true, "helpfulness": "0/0", "author": "Xtremedj \"djxtreme\""}, {"rating": 5.0, "review": "The Google Chromecast Media Player is great.  It was easy to setup and use.  It works with my computer and my iPhone which is great.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I bought this when it was first released and promptly put it away when it became apparent that it was incompatible with my Samsung Chromebook.  I pulled it out every month or so to try it again... and finally in February it worked!!!Now I can cast to my television and it works well almost all of the time.  Once in a while, my cable internet isn't quite up to the task and it buffers, buy 99% of the time it works as it should.I really like this device since I don't have cable tv and it allows me to stream programs effortlessly.  I use it with the free Amazon Prime television offering most and it affords me programming I can't receive over the air.I would give it 5 stars if Google would have been a little more forthcoming with compatibility info in the early days... and if they would have covered their Chromebook customers first.", "verified": true, "helpfulness": "1/1", "author": "moozical"}]