[{"rating": 3.0, "review": "I love the Amazon Fire, and the user friendly applications.  However, it is not compatible with Comcast or Xfinity.  So even though Iit has Showtime anytime, I am not able to connect to it with my cable provider.  I also own a Kindle Fire which is compatible to my Xfinity, and after asking questions and reading reviews, it was made to seem that the Fire TV would also be compatible.  This was a big disappointment, as that is my service provider, so half of the shows and network options are no longer available to me, hence the low rating.The picture and ease of use is fantastic and if I could watch half of my programing, which I already pay for with cable, I would have given this a 5 star rating.  I am considering getting rid of it for another option though as I am not able to connect to my service provider.  Also, the prime search should be better, as a prime member and being one for many, many years, I have to go through hoops to find those movies/shows that are free with my membership, it takes twice as long to find a movie.  why pay $99 if I am not able to easily search movies I have technically already paid for?", "verified": true, "helpfulness": "1/2", "author": "Neon Niki"}, {"rating": 5.0, "review": "It is a nice little addition to our multimedia center. This is much easier to use than going through our Smart TV. There is more than enough content for the entire family. Interface is easy to use and the voice command feature has been spot on. Being a PRIME customer really makes this shine even more with all the free content available.", "verified": true, "helpfulness": "0/0", "author": "Jeff Gaipo \"Jeff\""}, {"rating": 4.0, "review": "Very cool. Didn't include a hdmi cable. Thank goodness I had an extra one so I could watch right away.", "verified": true, "helpfulness": "0/1", "author": "Kindle Customer"}, {"rating": 3.0, "review": "If all you want to do is stream video from Netflix, Amazon Prime and other Internet sources, this is the best box I've owned, including Roku3, AppleTV and WDTV Live. It has the fastest processor, quickest performance, nicest interface and best remote of the bunch. If I stopped there, it would rate a 5, but unlike Roku3 and WDTV Live, it can't play local media via its USB port (unless a future firmware update enables USB for this purpose), and streaming from a media server in your house is not built-in. At this time, you can purchase the Plex app for Amazon Fire TV to stream from a local server, but you're limited to 2-channel audio since it can't handle Dolby Digital 5.1 or DTS audio at this time.Roku3 can play local USB media (app required), but it lacks a built-in decoder for Dolby Digital 5.1 and DTS, so my AC3 pass-through encoded media had NO audio at all (regular stereo 2-channel encoded audio played fine).By comparison, WDTV Live has two fully functioning USB ports for local media, no app required, and it plays just about every media format in existence. Plus it has a built-in decoder for Dolby Digital 5.1 and DTS. Its interface and features otherwise fall short compared to AFTV, Roku3 and AppleTV.Amazon Fire TV is excellent at streaming Internet media, and so is Roku3. WDTV Live is excellent at playing local media. Apple TV is great for AirPlay and integration with the Apple ecosystem. If Amazon Fire TV ever enables USB local media and 5.1 audio streaming, it will be a winner. In the meantime, I have not found a sub-$100 box that does everything well. Until that day, I'll continue to use a Mac Mini with Plex Home Theatre (at much greater cost, of course) to get the features that are missing from inexpensive boxes like Amazon Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}, {"rating": 3.0, "review": "I know there are over 11,000 reviews of this product, but I wanted to review the Fire TV for what it is good for and what the problem is. The good. It's blazing fast and it is excellent for watching Amazon Videos. Voice search is incredible. The problem is, the Netlifx interface is pretty bad. It's not customizable and the closed captioning doesn't have the same features. So this is frustrating. I find myself never using the Fire TV over the Roku because of this. I hope Amazon doesn't try so hard to crush their competitors they make their own products inferior. It doesn't make sense. My Fire TV is currently in a drawer, packed away.", "verified": true, "helpfulness": "1/2", "author": "John G. Comas \"Amazon user\""}, {"rating": 5.0, "review": "Clever and it works. Bang...it's great.", "verified": true, "helpfulness": "0/0", "author": "ADK_Jr \"Leonidas at Thermopylae\""}, {"rating": 5.0, "review": "i love it !! it's bad asssssss", "verified": true, "helpfulness": "0/0", "author": "alejandro kassir"}, {"rating": 3.0, "review": "I like the speed of this device but I gave 3 stars because I'm not a streaming video fan. Lack of some features(should be able to hide some menu). If this one run completely android, I think that would be much better.", "verified": true, "helpfulness": "0/1", "author": "nnrpro"}, {"rating": 2.0, "review": "So many of my AV devices offer access to video streaming services. I put Amazon Fire in the \"also ran\" category.  Compared to the Roku 3, it's a dog.  To select a service, PBS for example, Fire asks you to log into the internet; for Roku just click and your in.  For Roku you pick the channels you want to watch and you have a fairly clean screen.  For the Fire you have a confusing screen focused on Amazon services and other featured products that you cannot get rid of.  Hey, Amazon when will you learn I have no interest in cooking channels.  There are just too many clicks to get where you want to be and you also find you can't really get there from Amazon Fire to many of your favorite Roku sites because they are not available.I am generally an Amazon fan - but this was a disappoitment", "verified": true, "helpfulness": "4/7", "author": "Q. T. JACKSON"}, {"rating": 4.0, "review": "Positives: voice search works great (hint: speak softly); netflix and most other film streaming apps have close caption options; optical output enables good home theater sound; most problems corrected by power reset.Negatives: enclosed remote batteries had shortest life imaginable (remember your remote might not be working because of this).", "verified": true, "helpfulness": "1/1", "author": "KCS"}]