[{"rating": 5.0, "review": "Good!", "verified": true, "helpfulness": "0/0", "author": "Daniela Marmolejo"}, {"rating": 5.0, "review": "THIS ONE IS MY SECOND, AND I WILL LOVE IT AS MUCH I DO LOVE THE FIRST", "verified": true, "helpfulness": "0/0", "author": "Don Smith"}, {"rating": 5.0, "review": "Easy too use!", "verified": true, "helpfulness": "0/0", "author": "LRC102882"}, {"rating": 5.0, "review": "Love it! Easy to install (plug into a slot on the TV) and use. I bought it for our flat screen tv in the bedroom so that I could watch Netflix shows in when I go to bed. I control it through my iPad, but could use a computer or smart phone. I change the source input on the TV to the HDMi slot that Chrome is plugged into and then open Netflix on my iPad (or computer, or smartphone). There is an icon that appears in a corner of Netflix that when I click on it it will send the signal to the TV so I can watch it on my TV instead of my iPad. It is even easier to use than my smart TV, in fact I am thinking about getting another to use with my smart TV downstairs. You can view more than just Netflix, Hulu, YouTube, (etc.), but that is what I use it for mostly.", "verified": true, "helpfulness": "0/0", "author": "Lisa Tichavsky \"book worm\""}, {"rating": 5.0, "review": "This is our second Chromecast purchase.", "verified": true, "helpfulness": "0/0", "author": "Carrie Berlin"}, {"rating": 5.0, "review": "Great product fast shipping", "verified": true, "helpfulness": "0/0", "author": "David Woods"}, {"rating": 5.0, "review": "👍👍👍👍👍", "verified": true, "helpfulness": "0/0", "author": "Jesús"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "Omar Aziz ahmed"}, {"rating": 5.0, "review": "I use my Chromecast all the time and love it.  I use it more then I thought I would.  There are so many multi-player android apps with it, it is great!", "verified": false, "helpfulness": "0/0", "author": "Derek"}, {"rating": 5.0, "review": "Great device. EASY to set up.  Started using immediately.  How nice to be able to wireless stream, or \"cast,\" video content otherwise being viewed on your smart mobile devices to your big-screen TV.  Picture quality, sound, and features such as optional captions all met or exceeded my expectations ... and I'm PICKY.The only thing hoped for that doesn't work is the ability to cast anything viewed on Google's Chrome browser to your TV.  Google apparently wants to offer this feature but doesn't seem to have it working yet in the general way promised.", "verified": false, "helpfulness": "0/0", "author": "RBondi"}]