[{"rating": 2.0, "review": "I'm always an early adopter so I understand that products get released sometimes without near future features. However the Fire TV is just another device with limited capabilities and designed around the media offered by a specific vendor. If you an iOS user than you should buy and Apple TV, if you've purchased a lot of digital movies (for download) from Amazon then get the Fire TV. But if you're looking for something to stream your own movies or the digital versions you get with your Blu-ray combo packages then this devices isn't for you. Hopefully in the future it will have DLNA and the ability to stream from network files.Another major flaw that I'm sure will be fixed quickly is Amazon Music. I buy all my music from Amazon but I can't listen to any of it currently on the Fire TV. I can listen to Pandora though...Most smart TVs have all the (non-gaming) capabilities of the Amazon Fire TV built into them.", "verified": true, "helpfulness": "7/12", "author": "Sun Rae"}, {"rating": 5.0, "review": "Best purchase ever So glad I bought this. Fast and flawless. So much faster than my other streamer.can't wait for the game controllers to arrive", "verified": true, "helpfulness": "2/2", "author": "chris"}, {"rating": 5.0, "review": "We subscribe to Amazon Prime and previously used a PS3 to stream content before this box arrived.  This is MUCH easier to use and much faster as well.  We love it so far.  Well worth the price if you mainly use Prime as your source of entertainment.  We've never used Roku or Apple TV so we can't compare it, but for what we need it for it works great.", "verified": true, "helpfulness": "4/4", "author": "Renovating Queen"}, {"rating": 3.0, "review": "I currently own (and use) AppleTV, Roku 3, Roku 2, Roku Streaming Stick, ChromeCast, and several other boxes.My two main go to units are the 1) Roku 3 and 2) Apple TV.The Apple TV has a nice polish that Roku doesn't have but Apple has you locked into iTunes and they're fixed pricing structure.Roku 3 replaces iTunes with Vudu, Amazon Video, Flixster, M-Go, Target and any number of (mainly UltraViolet) services which allows you the flexibility to choose where you want to buy or rent your content and where you want to play it. Cheaper to buy it on M-Go but you prefer to play it in Vudu, if it's UltraViolet no problem.Roku also supports Dolby Digital 7.1 and 3D which Apple TV doesn't.The Fire TV gives you, what \"I\" feel is a much smoother, faster, and more polished interface than Roku or especially Apple TV. Though both Apple TV and Roku are probably more \"grandma\" friendly as Fire TV is a big flashy as well.While Fire also includes NetFlix and Hulu+ like Apple TV or Roku and obviously Amazon video like Roku it doesn't include Vudu, M-Go, or any other UltraViolet service \"except\" for Flixster. For some reason Flxister is really stripped down and almost archaic. After selecting a movie it runs through all these command line scripts letting you know what it's doing in the background, little of which makes any sense. Also even though while selecting most of the movies shows HD as available after selecting most every time I got an error message saying that HD was not available at this time. Often like what happens when you try and watch a movie on some web streamers. And the SD was REALLY bad.There appears to be 7.1 in the Fire TV specs but I couldn't find any material, unlike Vudu where there is even a collection of all the 7.1 material. Likewise Fire also doesn't mention 3D support. The Hardware seems capable so perhaps this will come later but not for now.For someone that doesn't have any UltraViolet or iTunes movies and will be doing all their viewing through Amazon, Hulu+ and Netflix I would say it's a great box. If the flash doesn't mean anything to you then you could get something that displays the content in a similar quality and works \"about\" as well. Perhaps not as pretty but easier. Those boxes like Roku 2, or Roku Streaming Stick (HDMI version), or even Roku 3 (best choice if on sale) can be found for less than Fire TV. As low as $40 in some cases. Even Amazon has had the Apple TV on sale for around $80 delivered.If you already have something no need to jump ship. If you need something and want access to the digital copies from Blu-Ray or DVD then this is not for you (right now). If you want something with a 1000 (mostly useless) channels but is cheap and easy to use and has similar picture quality again not for you.Amazon makes a decent effort out the gate. It was probably a bit rushed. It could have included a little more and perhaps been priced a little cheaper (ESPECIALLY the controllers, WAY to much money for what they are).Something to WATCH and WAIT I think.", "verified": true, "helpfulness": "2/5", "author": "."}, {"rating": 1.0, "review": "I've had a Fire for a day now. It's got major problems.1 - The interface is clearly designed to do everything possible to make me purchase content from Amazon.2 - There is no way to search for content that is free for Prime members, which I am (and the Fire came to me already set up to know that), and that is the major reason I purchased it.3 - In the Netflix App I have to log in EVERY SINGLE TIME! That is insane. Clearly that was done deliberately to discourage me from using Netflix.4 - Using a QWERTY style keyboard makes no sense when one is navigating the keyboard with a remote. Apple TV uses a keyboard layout that is in alpha order, which is very logical.5 - The Fire \"SImple\" Search using voice doesn't work in Netflix. It only works for Amazon content.The only plus is that content appears to load more quickly than on my Apple TV and it appears to consistently show in 1080P quality whereas on Apple TV sometimes HD content doesn't play in HD it plays in a degraded quality. It seems that Amazon has faster pipes from my house to their servers? My home internet connection is AT&T; Uverse.So to sum up, I am extremely disappointed in the Fire and wish I had not bought it. I should have waited and read the numerous other negative reviews that have come out in the past few days.", "verified": true, "helpfulness": "229/277", "author": "Rosemary Brisco \"Rosemary Brisco, SEO Pro\""}, {"rating": 3.0, "review": "I have been a mostly happy Roku user for 4+ years now. I started with the XDS model, which was their top of the line with dual band Wi-Fi, Ethernet, 1080p output, and optical audio output. Later, I added a Roku XD player in the basement, but that never got much use and it got sold. A few months ago, I \"upgraded\" to the Roku 3 because it promised improved performance. I liked the XDS, but frankly it was slow to navigate, the GUI was awkward, and it took a long time to spool video initially or if signal was dropped. Roku 3 improved the general GUI navigation speed and vastly improved the Wi-Fi connection issues. But they took away the optical audio output. Now, if you're one who has the latest receiver with HDMI inputs, this might not bother you too much. Me, it bothered, because my older discrete audio preamp/processor lacks HDMI inputs, and the only way to get digital audio for Dolby 5.1 into the prepro is via coax or optical audio outputs from the source.So when I first saw Amazon Fire TV, I thought it looked nice. But, other than the Roku 3's lack of audio output (it IS annoying that I cannot stream a 1080p movie with surround sound from this new \"top of the line\" product), and the fact that I keep losing video sync with the Roku 3 and have to pull the HDMI cable and sometimes the power cable to get everything to work again (yeah, 3 times in the past week). Well, I was happy-ish with the Roku 3 but was going to pass on Amazon Fire TV until the next gen, after all I just bought the Roku 3.WHAT? Kindle Fire TV has optical audio out? And better hardware specs? Yeah, I had to try it. There's always Ebay for the Roku 3, if the Fire TV is as good a performer on the A/V rack as it looks on paper ... or for the Fire TV if it just doesn't measure up.I'm sorry, I can't add any comparison to Apple TV. I have not used the Apple product. I think even without that comparison, this is still a decent evaluation of the Fire TV device.So let's have a go at it then, folks; here's what I have found after a weekend of extensive use of the new Kindle Fire TV. First, I'll give you pros and cons of Fire TV. Then some wins and losses for Roku 3 and for Fire TV. Last I provide a general summary.Fire TV PROS:Some great hardware specs: 2x the RAM of other leading players, dedicated Adrena 320 graphics processor, quad core main processor ... this box has the specs of a mid-high end smartphone. But specs are just numbers and words. Does Fire TV live up to the spec hype? Well, it's fast. Navigating the GUI is fast, bootup is about 30 seconds (and about 45 for Roku 3). It's not going to blow your mind, but it's not going to annoy you by making you wait too long for much of anything.Optical Audio Output: Even if you do not need or use this output, it's a definite plus for the box to have it. It's a selling point if, some day in the future, you decide to upgrade to the future next-gen Fire TV.Dolby Digital Plus: I can't personally take advantage of it, but it's always good to have a device with the latest audio and video standards. Dolby Digital Plus gives you that, with the ability to utilize 7.1-channel audio if you have 7.1 speakers hanging around your place.Voice search: If you have ever had to input a title via a 4-way navigator and pecking out each letter, you will quickly understand the Power and Magic of being able to speak the title you want to search for. And how does it work? Well, frankly, it actually took me about 5 minutes to get it to work. At first I pushed the button and let go. Fail. Then I noticed it said to push the button and hold it down and speak. I pushed it and held it down for 2 seconds and let go and spoke. Fail. Then I finally got it. I have to hold it down THE WHOLE TIME while I'm speaking. It will then think about my words for a moment, then display them. But does it search then? Oh, no, it does not. Then I have to click \"OK\" which isn't really labelled, it's in the middle of the navigation circle. (So 1940s. So counter-intuitive.) THEN it will search. Win on Voice search; lose on awkward implementation.Worked without a hiccup: It does work without any glitches that I experienced. No dropped HDMI sync. No lost WiFi. Just viewing happiness. Any product should work, so that's not a Fire TV win per se ... it's a win over Roku 3 though, which for me, often loses HDMI sync.CONS:Where's my water ... er ... apps?: Well, don't expect to be able to connect to the Play store and start loading up your Fire TV with all your favorite Android games and apps. In fact, don't expect to load the games and apps you've already bought from Amazon App Store. For me, though I've bought (or scored for free) dozens of games and apps from Amazon, only 2 lonely games out of the lot showed up on my Fire. TV. Now, it's possible that your Kindle Fire apps will all show up; can't confirm that for you since I have a Nexus 7 not a Kindle Fire. I think it kind of sucks that my games don't show up on the Fire TV, and hopefully enough users will complain about this to get Amazon to make them available to us. And how about all my audio stored in Amazon's Cloud? ... my MP3's and CD/digital content? Sure would be nice to be able to stream that to my hifi system.Apps (think Channels) availability: This is clearly the biggest weakness of the Fire TV product. It becomes readily apparent that there is merely a fraction of the number of channels available on Roku. The major ones are mostly there, but to me, the attraction of a product like Roku is that it makes enough content available to make cutting the cord a clear possibility. With Roku, it is. With Fire TV, well, I suppose it could be, if you want to pay for everything you watch - even items that may be free elsewhere. Make no mistake. Fire TV is about selling you content from Amazon, just as Kindle Fire and Kindle are about selling you content on those devices. There are a few, but not many free apps, and currently some major channels like HBO Go are missing. I don't think it is useful to list all the differences, as within a few weeks, information like this will be outdated. Both products will add, and occasionally lose channels. Let it suffice to say, a LOT of Roku channels are not available on Kindle. (It kind of reminds me of Apple's foray into online environments many years ago. Eworld. Anyone else remember that? It was like wandering around in a vast, empty hall, or like on Nostromo, where no one could hear you scream. But I digress.) It's not just that channels available on Roku aren't here, it's just that there aren't that many channels AT ALL here. Amazon says 100+ games are now available with thousands coming. Darned if I can find 100 games. And we'll see how the thousands coming thing goes. You don't get a \"plus\" for vapor, and you don't get one for \"we make you pay for everything, even what's free on Google Play.\"Some so-so hardware specs: WiFi doesn't include 802.11ac. With the other higher-end specs in the hardware design, not including 802.11ac is a bit of a surprise. My router is 802.11n, but I'm sure some of you would like to see 802.11ac in this product. USB is version 2.0. Come on Amazon, USB 3.0 has been out for a couple of years now.No headphone jack on the remote: If you don't have one now, you might not realize how handy that can be. Partner wants to snooze? No problem. Plug your favorite buds into the remote and go into silent mode. And not have to read lips.Push, push, push the Amazon content: Not \"push\" as in send downstream. Push as in ram their paid content down your throat. At every turn in the GUI, you are prompted and suggested to buy something from Amazon. Give it a rest. It's just annoying. That doesn't happen with Roku ... yeah there is paid content, but it's not crammed down your throat. Also see below under Confusing GUI for how paid Amazon content is pushed when the same thing is available on a different non-Amazon channel (that you've likely already paid for).Confusing GUI: The User Interface is a bit confusing. I was talking earlier about channel availability. Actually you don't have channels on Fire TV (forget everything you've ever known about using tv for the past 70 years and do things OUR way!). Now your channels are apps. And so are your games. And TV shows and movies aren't apps, they're in their own categories. I think these must be Amazon-revenued movies and TV, as opposed to the ones you can watch on Netflix or Hulu Plus. Like TV series ... search for \"Orange is the New Black\" and your search result only brings you Amazon's paid offering, not the Netflix one (even if you're subscribed to Netflix). Also, under the Home menu, there are also selections for movies, TV, games, etc. Very similar selections are at the top menu level (same as Home). Why the same thing in different places? Crap, don't make me work this hard for entertainment. I work hard enough at work. Entertainment is supposed to be fun, not puzzling, repetitive, and illogical. It's like a GUI that they let Marketing design, not engineers. Engineers give us logic. Marketing gives us multiple ways to buy stuff.Fire TV Wins:Hardware Specs: A class above the others. The entrails of a medium to high range smartphone. Not all that it could be, but heads above the others. It makes navigating the GUI VERY fast.Optional gaming controller: If those games turn out to be worthwhile, having a real game controller to interface with them is a nice advantage. While the Roku 3 features a motion-sensitive remote, it does not have the familiar controller layout. (Well, if you turn it on its side, it does kind of resemble the old Nintendo Wii controller a little ... but not a full-fledged gaming controller, nope.) Still, for an \"optional\" controller, it becomes readily apparent that many of the games require it.Pretty screensavers: Amazon loads up some lovely photos for your screensaver. Which is the least important place to score a win over the competition.ROKU Wins:Better remote options (plural): Headphone jack. Motion sensitive remote. True, I can't talk to it, but I can still talk to the cats. And I can install a Roku remote app on my phone or tablet and easily type in the item I'm searching for. While Fire TV remote is slimmer and has that nice Nexus 5-like grippy rubber feel, and fewer buttons, it feels like there are too few buttons, and the other cool stuff isn't there.Content. As in, more channels: In essentially every area other than games, Roku spanks the Fire TV currently on channel availability. Roku content is richer, deeper, and far, far more varied. The difference is significant, make no mistake.Search across multiple channels: A top-level search box lets you enter the name of a program or movie you want to watch, and the Roku returns a list of channels providing the content. Sweet. You can pick the lower cost alternative ... you can actually SEE lower cost alternatives.The channels are built in: With Roku, all the channels are there in the Channel Store. Just click and it's added. All the channels are stored in the software. With Fire TV, you have to download the ones you want. And watch that 5 GB melt, melt away like cellulite on a late night commercial.Arranging the channels. I don't want them to appear in the order I added them, nor even by how often I use them. I want to decide which ones I see first. I want an area where I control what I see, my personal channel area. (Elsewhere, I have to live with the ones Amazon is pushing me to buy appearing first, in the middle, and when you're not paying attention, oopsie, there too! It's everywhere, that paid content!)Ties with Fire TV and Roku 3:Both Roku 3 and Fire TV have Ethernet, both have dual band WiFi, both have Ethernet ports. Both have 1080p and HDMI-only output. BOTH boxes let you throw content to them in various manners.Video start: Amazon says it's immediate. I found the wait time to be about 3-5 seconds. Roku vastly improved their \"spool\" time (i.e., they decreased the wait) with their latest generation, I generally only wait about 4 seconds or so for the show to start. Not game changing. Pretty much the same as the competition there.Conclusion:Fire TV is not a Roku killer, nor even a GAME CHANGER!!!!!!! It is a good product with some clear weaknesses and a few hits. Its wins include very good hardware specs and performance to match, good audio support, voice search (that needs some refinement in implementation), the intended functionality to be both a media player and game machine, and a competitive price with other top of line media devices. Fire TV's weaknesses include much less content than Roku, especially free content; lack of transportability for your purchased Android apps (from the Amazon app store); no access to your Amazon Cloud audio content; a confusing GUI design; weak, barebones remote; and a none-too-subtle tendency to cram Amazon content down your data pipe in every possible way.Is Fire TV worth buying? Bottom line. Not unless you have a very specific need for some unique feature or option (for me, it was the optical audio output). Otherwise, these boxes are all about the content. Where the content is clearly thinner and weaker, what is the advantage? Now, perhaps in 3 -6 months, Amazon will provide more channels. Perhaps they never will, just more games to sell you. Maybe they are making it look like they are competing with Roku and Apple TV, but are really just getting the box placed wherever they can by dangling shiny specs before your eyes, but with no plan to ever truly make the device equal to the very capable Roku product. I don't know. I think that's a clear possibility though.So is my Roku 3 going on Ebay? Fortunately, I have extra HDMI ports on the TV. No, I'm not selling the Roku yet. I would miss all those channels that Roku has that Fire TV does not. So I'll live with 2 boxes for the time being. Maybe Fire TV will acquire more free fun channels. Or maybe I'll find that I just don't care about that optical audio output enough to keep the Fire TV. Time alone will tell.", "verified": true, "helpfulness": "0/0", "author": "L. Kirk \"Crabseye\""}, {"rating": 4.0, "review": "If I wasn't locked into Apple I wound get it so maybe I'll but as an gift for someone someday. The only real downside I see with it is almost 100% of us have thing's like Pictures on our Computers.The Apple TV, Chromecast and Roku do have local media options if Fire TV wound add that by software on PC and/or USB it wound be much better then it is now.", "verified": false, "helpfulness": "1/1", "author": "Lancep2012"}, {"rating": 5.0, "review": "I am very happy with this set-top box. It is blazing fast for Amazon Instant Video content. Videos start and resume instantly and play flawlessly. The voice search works great as well. I moved from a Roku 2 XS to this box, and love, love, love the speed, clean design, and content available.I use it for Plex as well, and it handles all my local media with aplomb. You do need another computer to act as your Plex Media Server, but once you are over that hurdle, you are all set. Plex looks great and runs very quickly. Running it on this device is a great experience.", "verified": true, "helpfulness": "2/3", "author": "Michael J. Descy"}, {"rating": 2.0, "review": "UPDATE: 9/8/2014I now have two FireTV, and I will not be getting any more. We bought the devices to stream from Netflix, and Amazon, Vudu. Since purchasing these boxes (one the first day it was released), we've had nothing but issues with Netflix. As I type this, both of my Amazon boxes will not stream Netflix, while both of my Roku boxes, and all Tablets/PCs will. The Netflix app refuses to load on both boxes. It just happened within this week. Given that Netflix is a big portion of our TV time, this is a great inconvenience. I'm dropping the rating. It's very disappointing.When I saw this announced, I was very curious. I currently have 2 Roku boxes, and am in need of 2 more streaming devices. Given it's success with the Kindle, I decided to take a shot with the Fire TV. Upon arrival, I could tell it was a quality item. As I unpackaged it, i noticed that the box itself had more weight compared to my Roku. It \"feels\" better made in all respects.  Once I hooked it up and \"fired\" (pun intended) it up, I was greeted with a nice little intro video. Given that speech was a big selling point, I made that my first attempt to use it. I raised the controller close to my face and said \"House of Cards\" (in reference to the Netflix show), and the Fire TV didn't recognize it. (It asked if I was looking for Hearts). It took about 3 attempts, with each one me speaking more slower and having longer pauses between the words, before it finally got it. The search was cool, but I think it needs some more work.Digging around the screens/menus, I found that this device is great for someone who buys into Amazon services (tv, music, etc). When ever you search, you are taken to Amazon's TV/Movie service (although they don't make it to obvious, as it's presented generically).  While that is great, there are many (most?) of us, who use Amazon as ONE of our entertainment sources. Amazon includes many of the monthly subscription services (Netflix, Hulu, Crackle, etc) as apps on the device. However, what is absent are the services that would compete with Amazon, notably Vudu, MGo, Redbox Instant, etc. It appears that Amazon offers you no alternatives to rent/buy your TV and Movies through. Given this box is made by them, this is understandable to me, although I don't particularly agree with it. I'm finding that I'm streaming more and more from Vudu, as their quality is outstanding (although they do require higher internet service capacity). As such, I like to have options, and thus this is a negative to me. If Amazon creates apps for these additional service providers, then my overall opinion of the device will change.If you buy in to the Amazon entertainment lifestyle, then this is definatly the box for you, as it has deep integration with all of their services. However, if you like other streaming services, then I don't know that this is for you. I will keep it (as we have one TV that we use to stream cartoons from Prime/Netflix for our daughter), but I think I will be going back to Roku for boxes for other TV's, given Roku's impartiality to the service providers.", "verified": true, "helpfulness": "5/7", "author": "Texas Mom"}, {"rating": 4.0, "review": "I've never used any of the competition just purchased it to see if it helps me with prime.. and I have to say i'm totally happy with the search... gaming is kind of cool i'm not a big gamer but my wife loved playing minios or whatever its called on the big screen.. its definitely worth the 99 dollars after buying the Kindle for 4 times that or more.... they should offer you a discount though to buy more than one so I can replace the rest of my extra cable boxes!!i'm tired of having those annoying wires running all over my house lol.. definitely more valuable if your a pre existing prime member", "verified": true, "helpfulness": "2/2", "author": "goose"}]