[{"rating": 3.0, "review": "I ordered this item over a month ago,cannot set it up tried to set it up with tablet and directions does not work.bought new tv and tablet tried phone still does not set up. what should i do? does it need its own remote?", "verified": true, "helpfulness": "0/0", "author": "gladys"}, {"rating": 1.0, "review": "I have 2 cheomecasts.  They were great for a few weeks.  I mean the coolest thing since sliced bread.  However after an update 3 months ago the stream NEVER goes HD now.  I have the best Internet available to xfinity customers.  So I know it isn't my connection.  My smart TV never loses focus on Netflix.  Three out of every four times using it, during an episode on netflix it will buffer to 99% and stay there.  Only way to fix it is turning off the TV and rebooting chromecast.  Was the coolest thing ever but now nothing more than a pain.  Hoping the amazon fire stick will be better.  To bad Google won't give me my money back :(", "verified": false, "helpfulness": "0/1", "author": "Aaron Monreal"}, {"rating": 3.0, "review": "Needs more info abt. Surround sound.", "verified": true, "helpfulness": "0/0", "author": "susan j winnegar"}, {"rating": 5.0, "review": "great purchase", "verified": true, "helpfulness": "0/0", "author": "Free Walker \"BigDaddy\""}, {"rating": 5.0, "review": "It was a very good deal by amazon and works like a charm, thank you", "verified": true, "helpfulness": "0/0", "author": "Ariel"}, {"rating": 5.0, "review": "Love this! great option for a regular hdtv if you cant afford a smart tv", "verified": true, "helpfulness": "0/0", "author": "Saul Serrano"}, {"rating": 5.0, "review": "Amazing. In the past I connected my laptop to my TV through HDMI. Now I stream wirelessly through my tablet.", "verified": true, "helpfulness": "0/0", "author": "Kris Beran"}, {"rating": 4.0, "review": "wish amazon would update the prime app to play on it, otherwise, super easy, super cheap and I accidentally smashed it and it works fine still :)", "verified": true, "helpfulness": "0/0", "author": "Aaron Smith"}, {"rating": 2.0, "review": "I sent it back tought it was two slow for my use.", "verified": true, "helpfulness": "0/0", "author": "Walter C \"Walter T. Cochran\""}, {"rating": 5.0, "review": "I got this for my daughter as a Christmas present. I'm happy with my Roku, but she thinks it is the greatest thing since sliced bread. She can go on and on -- who am I to argue!", "verified": true, "helpfulness": "0/0", "author": "Old Goat \"Forrest\""}]