[{"rating": 4.0, "review": "I purchased this item so that for my online classes, I could cast content in my Chrome browser (usually lectures) to my living room LCD and watch in comfort (no other convenient way to do that unless it is a YouTube video). It is GREAT for that. Do keep in mind this is not an Apple TV (which I own as well) or Roku. There is no remote with this. No application that runs directly on it and allows you some direct control (that I've seen yet anyway). This is literally sending certain online content directly to your television (like YouTube videos) that specific support has been written for OR the Chromecast casting Beta which is a little icon in the top of your Chrome browser that allows you to cast the whole page of the browser window. However, that last method doesn't look perfect yet. That's why there is particular app support, like the aforementioned YouTube, where you'll have a little casting icon from within the YouTube video (so you're blowing up just the video in a nice edge-to-edge proper ratio, NOT the whole Chrome screen with all the menus and other stuff that sometimes doesn't display just perfect). Anyway, the YouTube support is great. Haven't tested the other video streaming application support yet, but I'm sure Netflix probably is fine too.I should be more clear, it doesn't just \"blow up\" your video from your PC to the TV connected to the adapter, it \"casts\" it which basically means that Chromecast grabs that feed somehow directly and you're free to do other stuff on your computer while it's playing. I have had some odd control issues at times, where within the YouTube application for instance it will show you the progress bar, but sometimes it won't (so you can't control the profess bar to forward the video on the TV, remember there ins't a remote for this) Anyway, some occasional odd behavior there, but hardly noticed in my light use the first month. It is \"beta\" after all, but hopefully Google doesn't beta it forever like other products and instead puts a lot of development in this. If Google could invent a very affordable HDMI streaming box that you would hook up to any of your HDMI supports and watch them via network or wireless through the Chromecast, it would be one heck of a unifying product.The other thing I really wondered about before purchasing this to \"cast\" my online course material was whether a site I was logged into on my computer (that required a log-in, like my online Canvas courses), if they would cast properly to the TV because they required a password. No problem doing this via the Chromecast beta so far, so pleasantly pleased in using it for my coursework for sure.", "verified": true, "helpfulness": "0/0", "author": "B. Tambling"}, {"rating": 5.0, "review": "I bought it at a discount otherwise may not get one so soon. the results surprised me. we can control media stream from anything anywhere from 4 yr old Samsung to Nexus to Nook Hd+ to laptops.... while support still limited it plays as designed without draining systems and we can still make calls or use other app. A smart bonus to our 48 inch LED TV. luckly I hadn't pay extra for a smart tv.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"greenday\""}, {"rating": 2.0, "review": "The advertising all shows the chromecast as a stand alone device.  This is not accurate.  It requires an external power source,  so has to be plugged in.  It also requires a wifi network to work.", "verified": true, "helpfulness": "0/4", "author": "Sean A Kirkpatrick"}, {"rating": 5.0, "review": "This is an amazing device. When I got it I was going to get an HDMI cable to watch Netflix movies from my computer. When I read the reviews and realized that this could be done remotely, I decided to buy this item immediately. Not only the speed and quality of the streaming is great, but also the comfort of controlling the streaming from a tablet, a computer or even a smartphone.I was so satisfied with this purchase that I brought  a couple with me to South America as Christmas presents, and they worked well over there too.", "verified": true, "helpfulness": "0/0", "author": "A. Diaz \"sundanceh\""}, {"rating": 5.0, "review": "I got this handy gadget as soon as it came out. I primarily use it to watch Netflix in garage on a big screen tv via my Samsung Android phone. Also use it to watch through HBO Go, Google Play, etc. Many other apps will be coming out down the road. I gave these out for Christmas gifts as well. Can't beat the price and future enhancements to come.", "verified": true, "helpfulness": "0/0", "author": "Jim Benton"}, {"rating": 5.0, "review": "I love the chromecast. It was so easy to install. I am very please with the capabilty of the unit. I've streamed videos, movies, all kinds of things and control it from the computer in the family room,", "verified": true, "helpfulness": "0/0", "author": "Mary T. Davison \"Mary T\""}, {"rating": 5.0, "review": "I love it. Awsome, does everything it is supposed to.  I am so very glad I bought two of them.", "verified": true, "helpfulness": "0/0", "author": "Daniel L. Dutton"}, {"rating": 5.0, "review": "I had been watching Netfix on my notebook for quite some time, wishing I could watch the movies on my TV.  Then my daughter gave her husband a GoogleChromecast HDMI player for Christmas, and I was so happy to know there was such a creature!  I bought one as soon as I could and have been using it ever since..It was super easy to set up and use, and I have not had any problems with it.  What a great price too!", "verified": true, "helpfulness": "0/0", "author": "M. Cooke"}, {"rating": 4.0, "review": "I read a lot of professional and user reviews of this device before buying it. I think I know what I should expect and it works as expected.First let me answer some myth about this device.1) You do need external power. Some early reviews suggest you can get power from HDMI, But for a monitor and a TV I tried, I do always need power from a USB port.2) For most applications, (except casting browser content) you are not casting from your devices. You phone or tablet is simply a remote control telling Chromecast to get content from the internet.I had a PS3 and have been casting YouTube and Amazon Instant Videos for a while. Comparing with PS3, the good thing about this is 1) you don't need to turn on and login. 2) many more supported apps. The cons are 1) you have no direct control if you have no mobile device or a computer in hand; 2) if not rooting, it doesn't support DLNA streaming. (I've been using PS3 Media Server software to stream my computer contents to TV through PS3).Now the Google cast API is open to public and I am waiting to see what the developers can do to this simple but convent device.", "verified": true, "helpfulness": "0/1", "author": "MTF"}, {"rating": 5.0, "review": "So I looked at a myriad of miracast devices, and the Chromecast, although limited is the best bang for the buck. Just remember that you get the most out a Chromecast if you utilize the Google suite of products.", "verified": true, "helpfulness": "0/0", "author": "InBK \"BK\""}]