[{"rating": 5.0, "review": "I wanted this so I could stream movies from my PC to my TV, and to watch MLB games on any of my TV's. It does a great job and has worked great from the first day.", "verified": true, "helpfulness": "0/0", "author": "Nebraska Red \"harassed Dad\""}, {"rating": 5.0, "review": "This is the third one I purchased.  One for my dad then my boyfriend. Now this one is for myself. I love my Chrome cast.", "verified": true, "helpfulness": "0/0", "author": "linda"}, {"rating": 3.0, "review": "Have to use phone to navigate. Amazon stock might be better.", "verified": true, "helpfulness": "0/0", "author": "Andrew Minderman"}, {"rating": 5.0, "review": "Excellent. Works Great.", "verified": true, "helpfulness": "0/0", "author": "cchrane"}, {"rating": 5.0, "review": "Great product fast delivery.", "verified": true, "helpfulness": "0/0", "author": "r Gysin"}, {"rating": 5.0, "review": "Exactly what it says it was and worked as well as it needed to.", "verified": true, "helpfulness": "0/0", "author": "fred"}, {"rating": 3.0, "review": "Doesn't work in the 5ghz band so I have to constantly switch my router to make this work.  I live in a apartment so its idea to keep it in 5ghz for gaming.  But this won't recognize on the band.", "verified": true, "helpfulness": "0/0", "author": "brian"}, {"rating": 5.0, "review": "Bought one locally on sale for same price as here. Always thought the concept sucked, but picked one up for screen casting, as this was the cheapest of any kind of box where reviews said delay was low enough for gaming. It is much more than a screen caster. I found with Bubble UPnP, I can render all content on my network with on the fly transcoding. Offloading videos from apps like Netflix is a snap too. As is playing radio and locally stored music. Forget the Chrome workaround. Bubble UPnP was well worth the $5 before I had a Chromecast, but now idespensible as it integrates very well with the Chromecast, making local, cloud stored, and network content a breeze to stream. I was wrong about the concept sucking and am glad I discovered this by buying it as a dumb box for screen casting. It has given me much more than that.", "verified": false, "helpfulness": "0/0", "author": "Michael J. Duclos \"Applying technology to solve real world problems\""}, {"rating": 1.0, "review": "Worked with older versions of tv. Upgraded to a Smart TV and Chromecast would always pop up with downloading after successful download. Detached and never attached again. What a waste. When getting a product, I'd expect on using for more years than 1.", "verified": true, "helpfulness": "0/0", "author": "Robin Pagaduan"}, {"rating": 4.0, "review": "Nice but it is not compatible with all devices", "verified": true, "helpfulness": "0/0", "author": "mohammed"}]