[{"rating": 4.0, "review": "Fast. I like the remote except the home button row and play/pause rows should be swapped. Use primarily for xbmc but Netflix is more responsive on this box than in any other device I've used so far, including consoles. Haven't tried any of the games.  Most say that they require the gamepad which I don't have.", "verified": true, "helpfulness": "0/0", "author": "Vegas \"chiefs5859\""}, {"rating": 5.0, "review": "it is truly great! The voice recognition is outstanding. Wish there were more free TV on demands on Prime", "verified": true, "helpfulness": "0/0", "author": "joel orenstein"}, {"rating": 2.0, "review": "Hoping someone can answer my questions about Fire prior to me purchasing. I am all done with the cable companies, no mater what, however, I am confused as to how this would help me. I have 3 smart TV's that link to most of these apps ( most of which require a fee) anyway. Additionally, I see no way to get \"real\" TV, i.e. the NFL, local news, Jeporady, etc. I dont do the on demand rip off, for redbox is a block away and only 99cents, so how would this really do anything for me. It is deceptive to say it is TV. It seems to be more like 'access to some TV stations/mostly shows. Smart TV's have these 'access' routes built-in. Please ring in and square me away, thank you.", "verified": false, "helpfulness": "1/3", "author": "PK"}, {"rating": 5.0, "review": "Its awesome!! The only problem I've had with it is that I'm using more data then my current internet plan allows. Guess I'll have to go up a plan.", "verified": true, "helpfulness": "0/0", "author": "Joe Kampman"}, {"rating": 5.0, "review": "Wonderful!  Much better than chromcast.", "verified": true, "helpfulness": "0/0", "author": "Frances"}, {"rating": 4.0, "review": "All in all very happy with this. It's made really well, looks sharp, and gets me about everything I need. I had an issue with it constantly prompting me for my Prime password, but it has since resolved itself. I would highly recommend this item!", "verified": true, "helpfulness": "0/0", "author": "Nikolai"}, {"rating": 3.0, "review": "Some of it great fetures do not work in other countries. Be aware!", "verified": true, "helpfulness": "0/1", "author": "O.Ilg"}, {"rating": 5.0, "review": "Extremely happy with this purchase!  Unit responds instantaneously to commands and streams video without a glitch.  The quality of the video is excellent.  Voice search works amazingly well.I connected the unit to TV and power, and it was up and running in seconds.  Couldn't have been easier.  (It took me longer to get the battery cover off the remote than anything else :)I was already an Amazon Prime customer, but really enjoy watching Prime videos so much more now that I don't have to hook up a laptop to watch it on my TV.  The addition of  HBO content was a big plus for me (currently enjoying Six Feet Under) although if you've subscribed to HBO all along I guess that isn't as much of a big deal.", "verified": true, "helpfulness": "0/0", "author": "The Somnambulist \"CGC\""}, {"rating": 4.0, "review": "Oh Joy!! Only thing I would like is some site where I could ask some questions - i.e.  How often are certain shows or TV series updated?  Or links to 'help' sites for the various channels.How often are movies updated? Once you have it you are basically on your own.Otherwise I would have given it a 5 star.", "verified": true, "helpfulness": "1/1", "author": "Cecelle"}, {"rating": 5.0, "review": "We like using it with amazon prime.", "verified": true, "helpfulness": "0/0", "author": "d"}]