[{"rating": 3.0, "review": "It is easy to navigate with th Ipas than it is with a lap top. When you go into netflix it' hard to turn it off , you than have to go into YouTube to turn it off.", "verified": true, "helpfulness": "0/1", "author": "Kathy Marji"}, {"rating": 4.0, "review": "This unit works as expected, is nice and small, and hooks up easily.", "verified": true, "helpfulness": "0/0", "author": "JulieG"}, {"rating": 4.0, "review": "Pretty cool but some functionality still left me wanting more.", "verified": true, "helpfulness": "0/0", "author": "Jason"}, {"rating": 5.0, "review": "great idea!  this was easy to install, totally plug and play.  i use it to stream Netflix and TV shows, works great.", "verified": true, "helpfulness": "0/0", "author": "Gala Daftary"}, {"rating": 5.0, "review": "Came on time. Works great.", "verified": true, "helpfulness": "0/0", "author": "Sam smith"}, {"rating": 5.0, "review": "Works great, seamlessly streams Netflix, YouTube, Music, etc from anyone's phone, tablet, laptop, or Chromebook. Just works.", "verified": false, "helpfulness": "0/0", "author": "DHS"}, {"rating": 5.0, "review": "If you are still reading these reviews, you should buy this product. End of discussion.", "verified": true, "helpfulness": "0/1", "author": "Paul Yeager"}, {"rating": 2.0, "review": "Pros: Its cheap, works ok- at firstCons: Begins to freeze and bug out relatively quickly.  I have not even owned for a full year and it already barely works.  Probably going to spend the extra dough and get something better next time.", "verified": true, "helpfulness": "0/1", "author": "Jordan kabbani"}, {"rating": 1.0, "review": "I bought this worthless piece of garbage for the sole purpose of watching the World Cup.I was traveling a lot and wanted to alleviate any worry that I would miss World Cup matches in the event that ESPN wasn't available at my destinations.Unfortunately, it would frequently stop \"casting\" during the matches, causing me to miss many of the best moments.At first I was angry at the WatchESPN app, but soon found that Netflix and HBOGo both experienced frequent pausing, disconnections, delays, etc.I tried everything I could think of: restarting the chromecast; restarting  the TV; restarting the apps; restarting the wifi modem. You name it, I I tried it. The only common denominator was the chromecast.The only consistency was consistent failure. Regardless of my location, time of day, signal strength, this thing was worthless. I ended up watching several matches on my iPad, which worked great aside from the tiny screen.I suppose my options are to spend more money on a Roku and hope it actually works, or bring my big, heavy playstation with me when I travel (not happening).", "verified": true, "helpfulness": "1/4", "author": "Raynocirous"}, {"rating": 4.0, "review": "Yeah Google. Awesome as always. Only issue is that some things....like Amazon Instant Video...wont cast. Get with it Amazon", "verified": true, "helpfulness": "1/1", "author": "enterthemeowmix"}]