[{"rating": 3.0, "review": "Overall, Chromecast is a great product. However, there needs to be some adjustments made on this product in order t for it to work much better. I think it would be a better product if it directly connected to the Internet and came with a remote. When streaming from the computer to the Internet, it may become glitchy. While it streams perfectly fine on Chrome when looking at the computer, it lags and appears to be buffering constantly throughout the entire play time. It is annoying, at best.", "verified": true, "helpfulness": "0/0", "author": "Jaimie M"}, {"rating": 5.0, "review": "One of the best purchases I have ever made in value for money. Let me finally commit to being a chord cutter. Absolutely love the thing and cannot wait for google and other developers to continue to make this better.", "verified": true, "helpfulness": "0/0", "author": "Adam Lauer"}, {"rating": 5.0, "review": "Work perfect!", "verified": true, "helpfulness": "0/0", "author": "Tailwind"}, {"rating": 5.0, "review": "Love this little thing! It took us a few days to really figure out what it was capable of. We are used to streaming everything via a Wii. Ordered two more for other TVs too. Works great. Even when it's not in use, I like the changing backgrounds and the clock. :)", "verified": true, "helpfulness": "0/0", "author": "A. Sylvester"}, {"rating": 5.0, "review": "I've had 2 smart tv devices.  And chromecast is so much easier to use.  This easily is number 1. Love it!!!", "verified": false, "helpfulness": "0/0", "author": "Barry T."}, {"rating": 5.0, "review": "I love this product. It works flawlessly.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "Takes time to set up and will only stream video from apps when using an IPad or a tablet operating on Android.  So, I can stream YouTube, but not something directly from the Internet.  Still haven't used it with the WatchABC or WatchESPN apps. Was hoping for something that would show whatever is on my tablet onto my TV, and am disappointed.", "verified": true, "helpfulness": "0/0", "author": "Krissy"}, {"rating": 2.0, "review": "Not what I expected out of this.  Several things lag and don't sync video with sound.  Some things it works well with but if it's not designed for it, things won't go well.", "verified": true, "helpfulness": "0/0", "author": "St. B Owner"}, {"rating": 5.0, "review": "We use this ALL the time...I was not sure if I would be happy with it based on some of the reviews but now I can't imagine my life without it...seriously, it's that dramatic!!Great price, works great (have had no problems with this and wifi connection or the streaming quality) and Prime is always great!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Excellent product. Don't hesitate to acquire it, Easily installation and configuration, you can control it by your smartphone or tablet or PC.", "verified": true, "helpfulness": "0/0", "author": "NORMAN TATE BONINO"}]