[{"rating": 5.0, "review": "We have had a PC computer connected to our TV for the last 5 years. It works great for streaming Netflix, Hulu, Youtube or others. We bought the Chromecast so that I could connect it to projectors and display presentations on my phone. We didn't think that we would use it much but over the last 3 weeks, we have used it non-stop. It starts up so much faster than my PC ever would, plus we can control it with our phones.There are a ton of great apps that use the chromecast. Youtube and Netflix work great. We don't have a Hulu plus subscription so i cannot say anything about that. We also use BeyondPod to cast podcasts and TuneIn for streaming radio. If you have select devices you can cast your entire screen so that all apps can be displayed on your TV.For only $35 this is a must have! We might buy another just to have.", "verified": true, "helpfulness": "0/1", "author": "K. Sterling"}, {"rating": 1.0, "review": "Terrible! It does not stream smoothly. If your streaming something off your computer then It will appear all jerky and slow on your tv screen, but at the same time it is playing smoothly on the computer. We have a new Samsung Smart TV and 25MB internet, so I put all of the responsabilty on the inadequate device", "verified": false, "helpfulness": "1/1", "author": "jim"}, {"rating": 1.0, "review": "does not work with my internet, and ups has yet to pick it up", "verified": true, "helpfulness": "1/1", "author": "patrick"}, {"rating": 4.0, "review": "Heard all the good thing about this and I have a tablet that does not have a HDMI output so I would give this a try. Installation is easy, download is easy and connection is easy as well. However, the TV/chromecast location to the nearest wifi router is the KEY. If the chromecast is barely near the router, there will be a connection problem.As long as the chromecast/TV connected to the wifi, it is all good....tested with my 3 years old tablet and play YOUTUBE video with 720p display....TV take a few second to stream to the 720P resolution and the picture quality is very acceptable. Try to use a newer tablet and play 1080P display but now it is getting questionable. I think it is still about 720p. But overall, it is a great alternative for those that does not have HDMI output device on the phone/tablet computer and this products is great.Also....only a few APP is allow to use Chromecast, Not all the APP can stream to the TV. Only those who is working with GOOGLE CHROME right now are able to stream via chromecast such as Youtube. By youtube is what I like to stream the most and that is good enough for me.", "verified": true, "helpfulness": "0/1", "author": "Solara"}, {"rating": 3.0, "review": "Ehhh... Great for streaming Music, youtube and that's about that...Con!Can't stream your screen for Crud :) very laggy and slow... I know it's a beta program for it but when they fix it I'll up my review.!", "verified": true, "helpfulness": "0/0", "author": "Joseph"}, {"rating": 5.0, "review": "This is the greatest invention ever. I have one on every tv in our house now.", "verified": true, "helpfulness": "0/0", "author": "AnthonyH"}, {"rating": 1.0, "review": "Only work through Crome.", "verified": true, "helpfulness": "0/0", "author": "R. Sloniker \"baladilady\""}, {"rating": 5.0, "review": "Excellent Product!", "verified": true, "helpfulness": "0/0", "author": "Gabriel S."}, {"rating": 5.0, "review": "This is small, easy, and works MOST of the time!", "verified": true, "helpfulness": "0/0", "author": "Marsha"}, {"rating": 5.0, "review": "I love being able to stream movies from my Nexus 7 to my 4k TV.", "verified": true, "helpfulness": "0/0", "author": "LT \"Luke Thornberry\""}]