[{"rating": 5.0, "review": "when you go to sign in and use it, there's a little triangle at the upper right-hand corner.  Click it and you can broadcast the current page you're on and when you type and use word processing, etc, it will broadcast onto the TV.This has worked so much better than I thought possible.  I'm a home educator and I can use this instead of using a chalkboard and type what I want to teach.  If my student wants to show what their working on, they can also do so, while I sign off for a few minutes and then go back and forth.This is a must-have for the classroom for the school day and for after to chill out with movies and fun.With a wireless keyboard and mouse, you can be up to 20 feet away from the TV and be totally chillin on the couch and surf.This is definitely worth the small price.  All you need is a USB plug to power the chromecast and an HDMI port on your TV", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very easy connection as long as there's some internet connection. I bought it for PowerPoint presentations with my mobile devices. I just wish it would not depend fully on WiFi but work like the SanDisk for places where there is no WiFi. Maybe I am the one who hasn't experimented enough. Small gadget but very powerful.", "verified": true, "helpfulness": "0/0", "author": "Lloyd Makamure"}, {"rating": 4.0, "review": "I would have rated the item a five but, seeing as the mirroring feature is developing as of yet that feature is not available for my s3. In every other aspect it works well. If you're a big netflix or YouTube user than you will get your money worth. The one thing that I loved is being able to use my phone means I don't have to hear my annoying fan on the Xbox.", "verified": true, "helpfulness": "0/0", "author": "willman3005"}, {"rating": 5.0, "review": "I love chromecast!!! It is amazing :)", "verified": true, "helpfulness": "0/0", "author": "M0mm13"}, {"rating": 5.0, "review": "Perfect", "verified": false, "helpfulness": "0/0", "author": "Jack K."}, {"rating": 3.0, "review": "Not Kindle compatible ((sigh)).  I haven't had a chance to use the Google Chrome.  I'll update my review when hear that Amazon has a workable Google Chrome browser for the Kindle.", "verified": true, "helpfulness": "0/0", "author": "Tsarstepan \"Tsarstepan\""}, {"rating": 3.0, "review": "It is good for YouTube and Netflix.  But you can't play any other videos from you I pad. It doesn't supports chrome cast extention.", "verified": true, "helpfulness": "0/0", "author": "zulfiqar mohd"}, {"rating": 5.0, "review": "Love it, work as a charm, I use it all the time on netflix and youtubeThe only problem for me its the wifi range, had to move the TV closer to access point, from places where my cell phone or my laptop can connect, my chromecast couldn't.", "verified": true, "helpfulness": "0/0", "author": "Jose Cerrato"}, {"rating": 3.0, "review": "Thought I would use it but I don't the streaming quality is not that good.", "verified": true, "helpfulness": "0/0", "author": "Howie"}, {"rating": 5.0, "review": "I can watch so many exciting things now yipieee", "verified": true, "helpfulness": "0/0", "author": "Andrew"}]