[{"rating": 5.0, "review": "Works great on my big screen tv ! This is so very cool! It works great with my I pad !", "verified": true, "helpfulness": "0/0", "author": "kris keen"}, {"rating": 5.0, "review": "This is an amazing device especially if you use hulu or netflix alot. It's very easy to use, so I believe anyone with basic knowledge of hdmi ports, smart phones and apps can use it well. There are two bad things(not necessarily the chromecasts fault) though, Google isn't currently spreading the API, so some apps wont get chromecast capability for awhile. Second thing is that I live with family and quite a few devices are using the internet on certain weekends, so I have alot of problems with Hulu and chromecast. Constantly desyncing, pausing and sometimes even stopping all together. It's not really the chromecasts fault, but be warned if you live in a family that does alot of online gaming be warned it may cause problems with you connectivity.Other than that I LOVE this thing, it's my favorite purchase so far.", "verified": true, "helpfulness": "0/0", "author": "Tyler Kellett"}, {"rating": 2.0, "review": "I bought this for the attractive price tag despite living in an ios environment. However, after using it for a couple days, I can confidently say I'd pay three times more for an Apple TV. The chromecast lacks a lot of flexibility and ironically, openness. Whereas with an Apple TV I can go to any random video/audio app and in all likelihood it will AirPlay (not to mention near seamless mirroring), one can only chromecast from a handful of apps. The chromecast feels like a middle man rather than a liaison between my ipad and the TV. It honestly feels prohibitive. The lack of a Dedicated GUI and remote is unfortunate, sometimes you just want media controls handy without using your device.I also get audio/volume issues when switching between casting apps and other apps I'm using, though this could just be an ios bug.Ultimately it lacks a lot functionality and flexibility that I had grown accustomed to on the Apple TV. Perhaps I should've researched what I was buying but I don't even see them as competitors or substitutes at this point in time. At the moment I'd certainly recommend an Apple TV or a roku over the chromecast. While I do love the chromecast's compact design, it leaves me wanting. Perhaps in time, the chromecast can make strides, but bottom line it feels inferior.", "verified": false, "helpfulness": "0/0", "author": "Jeremy Yang"}, {"rating": 5.0, "review": "Easy to install and use. It's fun being able to broadcast from my computer sites like Netflix, etc. Kudos Google!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"jamo@yahoo.com\""}, {"rating": 1.0, "review": "Couldn't get all movies to work with Netflix. Works well with Pandora, but when downloading movies it would reach 100 percent then not play no matter how long I waited. Will try Hulu next & see what happens but really bought it to work with movies from Netflix.", "verified": false, "helpfulness": "1/2", "author": "Debra Rogers"}, {"rating": 4.0, "review": "Works as advertised and easy to set up with compatible Android device with the free Chromecast app downloaded.  Nice to be able to view Youtube on the main boobtube, though otherwise pretty much duplicates content offered on Roku, but has only a fraction as much.  If you already have a Roku or similar with wider content offerings, it's not particularly exciting, and we have ended up using it only to watch Youtube videos on the TV so far, but it's worth the modest price.", "verified": true, "helpfulness": "0/0", "author": "John Marshall"}, {"rating": 4.0, "review": "Right now its a little limited, but I expect that to change in time as things are added and revamped.simple to setup, simple to use especially with a laptop.picture is great!$25 to $30 is easy to swallow for the convenience", "verified": true, "helpfulness": "0/0", "author": "JP Miller"}, {"rating": 1.0, "review": "Slow wifiPoor app supportIt's a dumb relay lacking a lot of audio support and plex chokes on it if you use direct stream...which for NAS users is a must.  The painful wifi removes any chance of a decent qualityEven if you want Netflix or YouTube , just buy a roku, the cheapest you can find..at least you have a pause button handy.Google had a semi good idea, but lack of 5ghz, and format support ruined it. Hbo stream from ipad is nowhere near the quality of airplay neither is tivo or YouTube. Both of which are even better on the TiVo premiere.Returned.", "verified": true, "helpfulness": "1/2", "author": "Aphonic"}, {"rating": 3.0, "review": "If you dont already stream Netflix through a gaming console, then this is good for that purpose. I use Amazon Prime Instant Video a lot and this is not supported (as it is well documented). I'm hoping that will change in the future.", "verified": true, "helpfulness": "0/0", "author": "HeatherW"}, {"rating": 5.0, "review": "Came promptly, works well.  Great alternative to multiple visual conversion cables.  Must have a good internet for it to work flawlessly though.", "verified": true, "helpfulness": "0/0", "author": "Chrissy"}]