[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "jennifer burgess"}, {"rating": 5.0, "review": "This was very easy to connect and it's easy to use.  Everything I expected it to be.", "verified": true, "helpfulness": "0/0", "author": "D. R. Duhon"}, {"rating": 4.0, "review": "Easy to use", "verified": false, "helpfulness": "0/0", "author": "Mary Billington"}, {"rating": 5.0, "review": "Bought two.  One for my wife & one for me.  Both of us have enjoyed it very much.", "verified": true, "helpfulness": "0/0", "author": "Wallace G. Worley Jr"}, {"rating": 4.0, "review": "I am pleased with the actual equipment itself, however, when my grandson came to visit every single single show he would request to watch was either not available or cost additional money. I was thinking there would be more free movies with Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Tony R."}, {"rating": 4.0, "review": "Works great. Only negative is my lame cable provider, COMCAST doesn't support HBO Go or Showtime to Go. Not Amazon's fault. There are lots cable companies that do, even one called WOW, but not my beloved COMCAST.", "verified": true, "helpfulness": "0/0", "author": "vgcalta"}, {"rating": 5.0, "review": "does everything i had hoped and with prime and/or netflicks fantastic!!!", "verified": true, "helpfulness": "0/0", "author": "Harry"}, {"rating": 1.0, "review": "I love my kindle and was so excited to get the fire TV. I get HBO go on my kindle and I also get xfinity to go on my iPhone BUT the fire TV does not have any of this. You have the app but it won't work with xfinity. I was disappointed in that aspect of the fire TV. I do get net flix and Amazon TV.  Amizon prime which I love. The fire TV is very user friendly and I love the speak to chose option which is very convent. I sincerely hope Amizon gets licensed  to use HBO Go and xfinity to go app. Then it would be perfect.", "verified": true, "helpfulness": "2/3", "author": "Lori Dyer"}, {"rating": 3.0, "review": "It works fine, but I don't like that whenever you search for a program or movie it reverts back to Amazon's Prime's listing of shows. I cannot search and get the results for all my programming apps, like Netflix and Hulu.", "verified": true, "helpfulness": "0/0", "author": "J. Callahan"}, {"rating": 5.0, "review": "I got the amozon fire tv a two weeks ago very easy to set up. I love it!", "verified": true, "helpfulness": "0/0", "author": "Donisette Parreira"}]