[{"rating": 5.0, "review": "I have one TV at home that is not \"smart\", and this device made it possible to have most of the functions/features of a smart TV on my \"non-smart\" TV.Very easy to set up the app on your smart phone and play.The price is perfect and way cheaper than upgrading the TV that is functioning just fine!Great low-price gadget gift idea!!!", "verified": true, "helpfulness": "1/1", "author": "McNett Corporation"}, {"rating": 1.0, "review": "I acquired the proper gadget last year...I installed the gadget  properly....I placed the computer  close  to the TV screen...Only God knows how many times I tried to  connect and start the show....Well nothing shows up on TV... except that the TV screen shows that is ready ...I tried to get support from google....many times...There is no support for me to call ...The written instructions are insufficient...Well...when you are such a  big company...you do not have time to deal with stuff ..even though people buy their contraptions...Victor Cheloliber", "verified": true, "helpfulness": "0/6", "author": "Victor Cheloliber"}, {"rating": 3.0, "review": "i am sure there is more but i cna only stream you tube and netflix. for the price it is worth it but not amazing or anything. a hdmi dongle is almost as easy , and better qaulity and faster resopnse. it has to be plugged in anyway so looks odd on wall mounted tv , so your plugging it in and out anyway.", "verified": true, "helpfulness": "0/1", "author": "M. Brown"}, {"rating": 5.0, "review": "Got this one to replace a Roku in the master bedroom. I like being able to use the phone to control Netflix and YouTube. Great device and getting better all the time.", "verified": true, "helpfulness": "0/0", "author": "David Heston"}, {"rating": 5.0, "review": "Setup is extremely simple.  Good range.  Automatically updates. Like it so much I bought another one for the family room.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I hope development for Chromecast takes off because I love how well streaming works on the Chromecast and how convenient it is to use. I will be buying another one at some point so my wife stops unplugging it and moving it around the house.", "verified": true, "helpfulness": "0/0", "author": "Brett"}, {"rating": 5.0, "review": "Love this thing, I can watch YouTube, Netflix etc. Don't have to disconnect from my computer screen with Chromecast because I have an older flat panel tv I always have to disconnect my computer screen and hook it to my tv if I wanted to stream netflix or youtube on to my TV, also pain to see computer screen on tv as no matter how you tried to adjust computer screen (panel fit)was not made to fit tv panel, my son inlaw told me because of older tv model..  Now  I can keep my computer screen connected to my computer and stream all the videos I want to my tv..", "verified": true, "helpfulness": "0/0", "author": "lady di"}, {"rating": 5.0, "review": "My entire family enjoys using this to do most all of the PC stuff on the television. My children love using YOUTUBE on the TV. Very easy to set up. I would definitely recommend it.", "verified": true, "helpfulness": "0/0", "author": "mommiecrow"}, {"rating": 5.0, "review": "got this for my dad as a Christmas present and he loves it. he is in florida for winter so now he can watch his Netflix down there", "verified": true, "helpfulness": "0/0", "author": "Richard J Smith"}, {"rating": 5.0, "review": "works as advertised and easy to get setup. Have it setup on multiple devices, and have moved it from different TV's, without a hitch.", "verified": true, "helpfulness": "0/0", "author": "D. Patterson"}]