[{"rating": 5.0, "review": "Absolutely love it!", "verified": true, "helpfulness": "0/0", "author": "Richard Harris"}, {"rating": 5.0, "review": "Streaming was continually interrupted.  I returned the device because the Wii system that I already had does experience continual interruptions.  I am not willing to pay higher prices for Prime, when my Netflix on Wii works great for a whole lot less money.", "verified": true, "helpfulness": "0/0", "author": "Cathie H."}, {"rating": 4.0, "review": "I'm still learning but love that I can bring up just about anything I want and watch it on my schedule.  My husband has been using it and enjoying it even more than me.", "verified": true, "helpfulness": "0/0", "author": "gamer \"mahjong obsessed\""}, {"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "Kat"}, {"rating": 5.0, "review": "Totally awesome", "verified": false, "helpfulness": "0/0", "author": "shanard boyd"}, {"rating": 5.0, "review": "Excellent product.  Super easy to hook up and start using right away.  I'm very pleased.", "verified": true, "helpfulness": "0/0", "author": "Trish Davis"}, {"rating": 5.0, "review": "Excellent product. Replaced my Apple TV on my main tv and am very pleased. Easy to setup and operate!", "verified": true, "helpfulness": "0/0", "author": "Clarence M."}, {"rating": 5.0, "review": "This gadget is great!  We have replaced our cable/directv with this and of course use amazon prime and order tv shows with season pass.  This is a great alternative to having to scroll through 80 stations of hispanic that isn't watched.", "verified": true, "helpfulness": "0/0", "author": "Robin Elaine Bledsoe"}, {"rating": 5.0, "review": "Works", "verified": true, "helpfulness": "0/0", "author": "Austen womack"}, {"rating": 5.0, "review": "Great way to watch Netflix and Hulu without buying an expensive game console like an Xbox. Works well streaming video but wish more videos and TV shows were available with prime. The voice commands is pretty fun to mess with and makes finding movies a lot faster.", "verified": true, "helpfulness": "0/0", "author": "Sarah"}]