[{"rating": 1.0, "review": "After 5 hours of fooling around with this product, it is being sent back.I read 20 blogs, with about 50 things to try in order to make it work----disable IGMP, enable multicast, disable multicast, configure NAT, add Chrome to firewall exception list, disable firewall, disable AP isolation, reboot this, reboot that, stand on one foot....I was briefly able to display my laptop PC on my TV using the Chromecast device, then the screen went away.  Re-casted, only to experience the same thing.  After numerous tries, factory resets, and 3 different devices, I never was able to connect again.Seriously---what a piece of crap.  I suggest a new name for this device------ \"CrapCast\".", "verified": true, "helpfulness": "0/0", "author": "Steve T."}, {"rating": 5.0, "review": "I mostly wanted it because I hate using my blu ray for netflix and this was worth the $32 to try it out. It only takes about 20 seconds at most to switch from watching on my phone to watching on the TV. Being able to easily take it with you anywhere is great too.", "verified": true, "helpfulness": "1/1", "author": "Jason"}, {"rating": 3.0, "review": "-Doesn't work on my Windows 7 dual core 2.5ghz Vaio or even more disappointing my IPAD4 it plays video with no sound.  It is not compatible with Firefox used for some Amazon Prime streaming.  Kind of a let down for that is really what I wanted it for so I am going to hold off on buying a New Kindle Fire HDX for a bit longer.Below is the table from the Chrome cast site.Operating System -/-HQ=High quality -/-SQ=Standard quality-Windows Vista, 7, 8&8.1 -/-HQ:2nd-gen Core i5(2GHz+) -/-SQ: 3rd-4th-gen Core i5 processor, equivalent Core i3 or equivalent-Apple OS X 10.6, 10.7, 10.8 -/- HQ: Macbook Pro 2011 or newer & Air 2012 or newer -/-SQ: Macbook Pro 2010 & Air 2011-Chrome OS -/-HQ: Chromebook Pixel, HP Chromebook 14 -/-SQ: Acer C720 Chromebook, Acer C720P ChromebookWindows XP and Linux  Casting video from a tab is not supported.", "verified": false, "helpfulness": "0/0", "author": "Robert M. Kirwan \"World Traveller\""}, {"rating": 4.0, "review": "UPDATE: After a bit of research, I found that if you change the quality from high def to standard before casting a browser video from you computer - the video on the TV is pretty smooth and the audio is in sync.Overall, I am happy with the quality and functionality of this feature after all.I already have a Roku and Tivo which can stream, so Chromecast doesn't offer much more functionality.What you do get from Chromecast is the ability to use a phone/tablet as the remote. As far as I see - this has to be why you want it.If you buy a chromecast and wish it came with a remote, then you should just buy a Roku or blu-ray player with wifi apps.The ability to navigate on a tablet and queue up shows on the TV is the main draw here.If you think about it - when you imagine a millionaire watching TV, the remote you picture is probably similar to a large smartphone or tablet, right? So Chromecast allows you to use your expensive smartphone to enhance the TV navigation experience.For that, I think the price is just right.Netflix and youtube worked well. I tried casting video from my computer chrome browser and it did not work well.Choppy, and it really had the computer working hard to stream the video.If they figure out how to get the Chromecast to stream directly from a URL rather than streaming through your computer - they would have a real valuable feature. That is why I got it, but really for $35 - its cool enough to keep.", "verified": false, "helpfulness": "1/1", "author": "mattyj"}, {"rating": 5.0, "review": "I got this so we could stream netflix shows into the tvs in our young daughters' rooms.  I like this solution better than adding a roku or other device because we can easily control when TV time is over.  I installed the app on my Nexus and extension on my Chrome browser and had them watching a show in about 10 minutes.  We have only had it a few day but totally love it.  I'm already thinking of getting one for me to use when traveling.", "verified": true, "helpfulness": "0/0", "author": "Gregory D Cruess"}, {"rating": 5.0, "review": "Basically another way to access video content straight to your TV (Netflix, Youtube, Google Play music, movies, and tv shows). While current smart TVs and blu-ray players also have apps, what makes the chromecast better is that it actually uses your phone (or tablet, or pc) as the remote. So I can surf my for movies on my phone and then stream it right to the TV. Then your phone becomes the remote for whatever you are streaming. Hit pause on your phone and it pauses it on the tv.Since the content is not actually streaming From your phone, but rather just letting your TV know what to play, you can use your phones other apps while watch the video. You can even leave.And you don't need to be signed into any particular account to cast to chromecast. Anyone you allow on your wifi network can cast to the tv.And being able to cast a tab from google chrome on your computer is awesome. You can stream countless videos from the internet from there also. Also, since it is only streaming from one tab, you can open another tab and use your facebook or anything else you want without interrupting what you are casting to the tv.AMAZING for $35", "verified": true, "helpfulness": "0/0", "author": "Ryan Pacchiano"}, {"rating": 4.0, "review": "Works pretty slick. Easy set up and use. Took about 10 min and I was streaming from my iPad to my tv", "verified": true, "helpfulness": "0/0", "author": "A. Dwyer"}, {"rating": 5.0, "review": "We both love Google Chromecast as its easy to stream anything we see in our laptop or phone to show it in on TV.We both use this a lot and we gifted two Chromecasts to our family and friends too as it does the tough job easy way without any wires attached to laptop .I would recommend this product to everyone who want to easily stream in to TV using there laptops and Smart Phones.", "verified": true, "helpfulness": "0/0", "author": "D3"}, {"rating": 5.0, "review": "Pretty awesome device, o have two of them an is that easy to use, my mother uses it without any kind of trouble...", "verified": true, "helpfulness": "1/1", "author": "Carlos"}, {"rating": 5.0, "review": "Works quite well.  It is easy to install and use. I now have a large quantity of programming to chose from.", "verified": true, "helpfulness": "0/0", "author": "G. Coons \"Painter\""}]