[{"rating": 4.0, "review": "Can be a bit difficult to set up if you don't know how to configure your WiFi, but once it's set up it works good!", "verified": true, "helpfulness": "0/0", "author": "Dag Roar Eidem"}, {"rating": 4.0, "review": "It's a great bit of kit, but it's somewhat limited.  However, what it does, it does really well.Easy to set up and very simple to use.  Looking forward to it being launched on the European market so that more apps are opened up to it.  Currently only Youtube and Netflix seem to work with it - but to be fair, I knew that whan I bought it.", "verified": true, "helpfulness": "0/1", "author": "Michael Kirwan"}, {"rating": 4.0, "review": "It does everything it said it would, but I think it should be able to do more. I think more functions will be available later", "verified": true, "helpfulness": "0/0", "author": "Asgeir Misund \"Misund007\""}, {"rating": 4.0, "review": "The Chromecast proves to be a solid device for streaming content. It is easy to setup and stops you from messing around with the hard to control UI of your Smart TV. It also seems that streaming content from Google Services is more reliable. The browser mirroring function is still in beta but anything else just works fine. A good device, even if some of the advertised features (apps) do not work in Europe.", "verified": true, "helpfulness": "0/0", "author": "Oskar"}, {"rating": 5.0, "review": "it works just fine as I was expecting. Even better. For the price it is amazing. Only shame that in Europe we dont have better support.", "verified": true, "helpfulness": "0/0", "author": "Michal Vítovec"}, {"rating": 4.0, "review": "I like it. It works perfect with Chromecast Android app. I have some problem with a ZTE router, switch to another brand and it went OK. I would like to have local playback from mobile Chrome.", "verified": true, "helpfulness": "0/0", "author": "Liber Bracesco"}, {"rating": 1.0, "review": "Cannot make this thing connect to the router. Useless. No point trying the support groups as they cover just a few scenarios and some of them are just: bad luck, we're sorrry. Very poor customer experience.", "verified": true, "helpfulness": "0/0", "author": "Carlos Pinto Cruz \"Carlos Cruz\""}, {"rating": 4.0, "review": "Need some apps, and occasionally it lags and I have to restart the movie, but other than that, it's a so much more convenient device!", "verified": true, "helpfulness": "1/1", "author": "Søren Resbo"}, {"rating": 5.0, "review": "one of the greatest devices ever made uses it all the time with Chrome web browser , iPhone 5 ,or tablet streaming YouTube streaming Netflix is just a perfect device it's a must haves for a person who into streaming videos", "verified": true, "helpfulness": "0/1", "author": "Alex"}, {"rating": 4.0, "review": "Easy to Use. But lack of apps to support for the time being. Hopefully, Google will open more apps developer to do so.", "verified": true, "helpfulness": "0/0", "author": "Chun Yeow"}]