[{"rating": 5.0, "review": "Easy and works as described.", "verified": true, "helpfulness": "0/1", "author": "Toots"}, {"rating": 5.0, "review": "Ez to setup", "verified": true, "helpfulness": "0/1", "author": "Talha Mujahid Alfayadh"}, {"rating": 5.0, "review": "Works great has potential to be better though", "verified": true, "helpfulness": "0/1", "author": "isaiah lucio"}, {"rating": 5.0, "review": "have two of these now i share with my family. i take one on every vacation. only wish it worked with amazon prime...", "verified": true, "helpfulness": "1/1", "author": "master katsu"}, {"rating": 1.0, "review": "Garbage.  Bought this thing to stream Netflix to my TV.  Will work fine for awhile, then re-buffers and gets stuck on \"Loading 99%\".  If I reboot the device and/or my phone and/or my wi-fi router, it'll will buy me some minutes of uninterrupted watching, but then the hang-up happens again, and again, and again.Meanwhile, get this:  When I try streaming Netflix directly to my PC (i.e. bypassing the Chromecast), all is well.  It will sometimes glitch momentarily, and in a great while will have to re-buffer, but never to the outrageous extent that this Chromecast thing does.What a waste of money.  I'm going to throw this thing in the trash and buy a DVD / Blu-Ray  player that offers Netflix streaming and whatnot, and then hope for the best.", "verified": true, "helpfulness": "0/1", "author": "J. Peake \"an open-minded skeptic\""}, {"rating": 1.0, "review": "Hardly any apps to work worth watching", "verified": true, "helpfulness": "0/1", "author": "Heather Matteson"}, {"rating": 5.0, "review": "Great way to stream from my phone and watch youtube! great product and i love that it comes with a HDMI extension", "verified": true, "helpfulness": "0/0", "author": "Sam Daniel"}, {"rating": 2.0, "review": "This will play Youtube videos or Netflix, but don't expect it to stream much video content from your local media server. The wi-fi connection streams in stops and starts and is extremely frustrating. Too bad they didn't include a wired connection like the Roku.", "verified": false, "helpfulness": "0/0", "author": "S. Kerns"}, {"rating": 5.0, "review": "Excelent", "verified": true, "helpfulness": "0/0", "author": "kalex rondon"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/0", "author": "Ritteach"}]