[{"rating": 3.0, "review": "It was a christmas gift for my son. easy to set up, worked as expected right out of the box, some issues with sound quality on some sites, could be my internet speeds so I am not sure about that as of yet. Netflix, Hulu, Amazon worked fine, no problems.", "verified": true, "helpfulness": "0/1", "author": "tim mcconkey"}, {"rating": 5.0, "review": "Love it!  This one was for the bedroom.  Already have one for the living room.", "verified": true, "helpfulness": "0/0", "author": "E. Semple"}, {"rating": 5.0, "review": "Works as expected. Very convenient.", "verified": true, "helpfulness": "0/0", "author": "Tom Sexton"}, {"rating": 2.0, "review": "Gave it away don't care for it.", "verified": true, "helpfulness": "0/0", "author": "Bear"}, {"rating": 5.0, "review": "Love it! I love how there's no monthly fee and you can easily stream Netflix, Hulu, your own pictures and videos from your phone and more! It's worked great for us and has lasted a couple of years now.", "verified": true, "helpfulness": "0/0", "author": "SLM \"SLM\""}, {"rating": 2.0, "review": "Not the best streaming device to be honest. \"Cast this tab\" feature disconnects every so often. Happens with youtube too", "verified": true, "helpfulness": "0/0", "author": "Geethike"}, {"rating": 5.0, "review": "One of the better streaming dongles for the price. Easy to set up, just make sure you have a decent WiFi connection and you should be set. The good part about Chromecast is that they are making more and more apps that are compliant so the possibilities are endless. You can also stream content directly from your PC as long as you are connected to the same network.", "verified": true, "helpfulness": "0/0", "author": "Gary Lombardo"}, {"rating": 3.0, "review": "So limited. Good for the price but the lack of remote and slowness of the connection makes it a hassle", "verified": true, "helpfulness": "0/0", "author": "Franccesca De Struct"}, {"rating": 1.0, "review": "It did not work but I figured it would be more trouble to send it back rather than throw it away, so I threw it away.", "verified": true, "helpfulness": "0/0", "author": "Vicki Turner"}, {"rating": 4.0, "review": "Is not exactly what I was expecting.  I should have done more research.  I still have it connected but also bought Amazon Fire.", "verified": true, "helpfulness": "0/0", "author": "Jonluk"}]