[{"rating": 4.0, "review": "Had a hell of a time getting it set up. Had to recruit my techy brother to help. After finally getting it to work, it streams well and it was super easy from there on to use. I've had continuing issues with my devices not being able to locate the chromecast and I have to reset the router every once in a while. Which is not too bothersome. I heard rumor that these just do not work well with a Belkin router, which is what I have. Hopefully things will work much better with a different router.", "verified": true, "helpfulness": "0/0", "author": "Beverly"}, {"rating": 5.0, "review": "Fantastic device...brilliant and out-of-the-box thinking! It changed all our TV experience in a bigger house with many challenges for our wireless service!", "verified": false, "helpfulness": "0/0", "author": "Norik \"elinorka\""}, {"rating": 4.0, "review": "Great addition to my TV. Works like a charm. Looking forward to seeing more apps. Wish you could stream your own videos/ photos easier.", "verified": true, "helpfulness": "0/0", "author": "Zachary J Lytwyn"}, {"rating": 5.0, "review": "I like it because it is small and easy to set up and don't cost you much. Though it is not a full fledged player ,but it serves my limited purpose.", "verified": true, "helpfulness": "0/0", "author": "PREMNATH"}, {"rating": 5.0, "review": "For someone without a smart tv, and so much stuff entertainment available on my phone, this solved all my problems. Shows netflix, google play movies, youtube and more! Just Awesome!", "verified": true, "helpfulness": "0/0", "author": "Larry Gene Webb"}, {"rating": 5.0, "review": "Imagine yourself dumb but then suddenly you got really smart, without reading a lot of books, without living a variety of experiences, and without any expensive education. Wouldn't that be awesome? Google Chromecast makes this awesome thing happen to your TV. It turns your dumb TV into a smart TV, costing you only $35, which is practically nothing compared to retail price of born smart TVs. I first bought Chromecast for 30 during thanksgiving sale, loved it so much that when amazon later listed it for 29, I snapped up another one to give as a christmas gift.Best features:1. Anyone connected to your home wifi can play or queue up entertainment (YouTube videos, Netflix, Pandora etc) for all to see.2. Once you play or queue up, say a youtube video, your phone is free to do anything, you don't need YouTube phone app running. Turn off the phone completely, leave the house, it doesn't matter. The TV will still play those cat videos everyone can enjoy. And some one else can keep the party going in your absence. Genius, no?3. Price, price, price. Only 35 bucks retail. But often on slickdeals.net and amazon here, you will find it even cheaper. I've seen it as low as $25 (for student amazon prime account).4. Simplicity is key. All your TV must have is an HDMI port. Plug this USB sized chromecast into that port, and install chromecast app on the phone, laptop, tablets whatever and you are ready to chromecast.5. Makes very affordable gifts that everyone will love and thank you for.Not best features:1. It requires internet connection, which means that even if you hate your job, you still have to drag yourself to work everyday to pay for that internet bill at the end of the month.2. It doesn't walk your dog in the 20 degrees weather.", "verified": true, "helpfulness": "0/0", "author": "Review Guru"}, {"rating": 5.0, "review": "Great little device that installed easily and worked like a charm. I love that it simplifies my life- less devices to worry about.", "verified": true, "helpfulness": "0/0", "author": "Richard R. Capuozzo \"Also known as \"Cap\"\""}, {"rating": 5.0, "review": "It's awesome does everything advertised, I'm very happy with product. Perfect product to watch Netflix or YouTube on your t.v without having to paying to much", "verified": true, "helpfulness": "0/0", "author": "miguel"}, {"rating": 4.0, "review": "Awesome, just needs to support more apps! Clear picture quality, and good sound. Just needs more apps that support chromecast!", "verified": true, "helpfulness": "0/0", "author": "Melissa McLaughlin"}, {"rating": 5.0, "review": "This was a gift and was said to be very cool,  My best friends youngest loves to play on Instagram and YouTube so she loves that she can cast it up to her television.", "verified": true, "helpfulness": "0/0", "author": "Michael0924"}]