[{"rating": 3.0, "review": "There are plenty of youtube videos reviewing and explaining the chromecast, but now that I actually have it, I quickly noticed the limitations.  The fact that it only does youtube videos and netflix (and pandora) is very limited.  I don't have a Netflix account so I can really only use it for youtube. I really thought I'd be able to cast chrome pages and then watch, for example, a video clip on a website.  But it doesn't work that way.  it will play the video, but the audio does not sync up.I don't think it's really worth it right now (I barely cast youtube videos now after 3 months), but I'm sure in a few years, its capabilities will expand, so I guess I'm investing for the future. =)", "verified": true, "helpfulness": "0/0", "author": "J L"}, {"rating": 5.0, "review": "we signed up to netflex and enjoy movies, documentaries and other entertainment that helps us relax. We have definitely gotten our money's worth!", "verified": true, "helpfulness": "0/0", "author": "Sheila"}, {"rating": 4.0, "review": "I like my chromecast except the fact that I can't cast my chrome browsers from android phone and iPad.I just hope that it is supported in the future with other application. :)", "verified": true, "helpfulness": "0/0", "author": "Arslan Qadri"}, {"rating": 1.0, "review": "I was very excited about getting this Chromecast and being able to watch Netflix on the big screen.  I'm not a tech guy, so was glad to see the device billed as \"plug and play\" and easy to set up.  It was indeed easy to set up -- until the Chromecast could not connect with my router.  I called teach support, and they told me that this was a COMMON problem, and that I needed to change some settings on my router.  No.  Again, I'm not a tech guy.  I'm not about to go through the hassle of getting tech support for my router to walk me through changing the necessary settings.  If I'm having to adjust settings on my other hardware to use this device with a common router (medialink), then it does not qualify as \"plug and play\"", "verified": true, "helpfulness": "3/4", "author": "M. Horn"}, {"rating": 2.0, "review": "Way to much hype about this product.  I returned after one day of use.  TV shows skipped to much.  I supposed i could have done something to my network to make it work better.  I have good connection speeds and i can stream other media to my playstation no problem  Once this product reaches the next level it might be worth buying", "verified": true, "helpfulness": "0/0", "author": "Roy Watanabe"}, {"rating": 3.0, "review": "Its a good product as long as you have the compatible router.My router (Arris) isn't compatable to the Chromcast.Make sure you check your router first for compatibilty.", "verified": true, "helpfulness": "0/0", "author": "Gary R. Jordan"}, {"rating": 5.0, "review": "Chromecast is just a great and affordable product, not much more to say, thanks to Google only for providing this nice piece of product!", "verified": true, "helpfulness": "0/0", "author": "Samuel Redekop"}, {"rating": 4.0, "review": "When it works, this device is an absolute dream come true!  What a lifesaver for people (like us) who watch TV on the internet.  I've wanted a device like this for years, it's amazing.  There are some occasional connectivity problems, and it cuts out sometimes (especially when broadcasting from the Chrome browser), but for the low pricetag, it certainly does not disappoint.", "verified": true, "helpfulness": "0/0", "author": "teejax"}, {"rating": 4.0, "review": "Perfect for anyone who can't upgrade their tv to smart tvs. Love having my movies on my tv now and it's fun surprising my guests on how easy to watch what is on my phone on the tv. I say this is great for bedrooms or offices. I have it in my living room the only reason y it won't stay there for long is no real remote controller and based on the connection of your phone apps or webpages. I'd may go for a roku for the living room but I'm certain in love with this for its affordabilty and streaming abilities.", "verified": true, "helpfulness": "0/1", "author": "quinnyk \"Quindara\""}, {"rating": 5.0, "review": "I'm able to cast both my Netflix and Hulu selections as well as YouTube.  And you can't beat the $35 price.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]