[{"rating": 3.0, "review": "It does what it's supposed to. For the most part. There are some issues where it loses connection but that's to be expected, I guess.", "verified": true, "helpfulness": "0/0", "author": "Julie C"}, {"rating": 4.0, "review": "I really enjoy the freedom of streaming from my cell phone, however sometimes I would pause the movie on my phone but it continues to play on my TV.  This got really frustrating and caused me to try to end the application on my phone and restart the app and hope it works.", "verified": true, "helpfulness": "0/0", "author": "LZ"}, {"rating": 4.0, "review": "Must have a strong Wi-Fi connection otherwise it won't work. Preferably have it in the same room as your router.", "verified": true, "helpfulness": "0/0", "author": "Nathan Lawrence"}, {"rating": 5.0, "review": "Pretty easy setup. Works with most online streaming service. Hopefully as promised the VLC team also adds support for this. Then anything can be sent to this bad boy. Now I don;t have to hook up my laptop everytime we wanna watch something. Just plug in and forget it.", "verified": true, "helpfulness": "0/0", "author": "Bat Myag"}, {"rating": 5.0, "review": "I Love It", "verified": true, "helpfulness": "0/0", "author": "Carlos Villa-lobos"}, {"rating": 5.0, "review": "Really solid device. Replaced a $1000 computer that was just hooked up to my TV. Once VLC casting works on phone and desktop you need nothing else on your TV.", "verified": true, "helpfulness": "0/0", "author": "Rance T. Reinhardt"}, {"rating": 1.0, "review": "I expected a little bit more of the product, because mostly works fine with netflix and youtube, but I cannot use it to show my screen well", "verified": true, "helpfulness": "0/0", "author": "Jerry Brian Osorio Alvarado"}, {"rating": 5.0, "review": "Bought it for my girlfriend and she loves it. She doesn't have cable or a device or console that she can stream media but with the chromecast she can do it all from her phone.", "verified": true, "helpfulness": "0/0", "author": "Matt K."}, {"rating": 5.0, "review": "Google actually got it right with Chromecast. All 3 TVs in my house are running Chromecasts.", "verified": true, "helpfulness": "0/0", "author": "Petey"}, {"rating": 5.0, "review": "What a nifty device!  At first I couldn't get it to work, eventually I figured out that my old wireless router is incompatible with chromecast - so i bought a new router and it works flawlessly!  It's really incredible how this has changed how I watch video. Now when I browse the internet and come across a video, i just cast it to my home entertainment system - the video plays over my big screen and the sound is piped through my surround sound. Plus it works perfectly with my mobile phone or laptop - really a remarkable device.  And only $35!", "verified": true, "helpfulness": "0/0", "author": "James"}]