[{"rating": 5.0, "review": "Love this thing especially now that I learned there is an Ethernet adapter for it", "verified": true, "helpfulness": "0/0", "author": "Yeks"}, {"rating": 4.0, "review": "Works really well and is pretty simple", "verified": true, "helpfulness": "0/0", "author": "elizabeth brooks"}, {"rating": 3.0, "review": "it only casts from a list of approved apps. but if you want to watch your personal videos from your phone or computer, this is not the product for you.", "verified": true, "helpfulness": "0/0", "author": "Ina from China"}, {"rating": 3.0, "review": "Its been working on and off. It seems it works very well once I'm using it for a while, but once I'm not chromecasting for a while, I need to reset it and it takes about 10 min to get it going without any problems. I was going to exchange it to see if it was just this unit, but my 30 day refund period had passed already.", "verified": true, "helpfulness": "0/0", "author": "patricialorcao"}, {"rating": 5.0, "review": "Very good iteam", "verified": true, "helpfulness": "0/0", "author": "juan"}, {"rating": 4.0, "review": "Works as advertised.  Can stream Netflix and Plex media from a Plex server.  Sadly, no 5.8GHz WiFi.", "verified": true, "helpfulness": "0/0", "author": "LFoD-NH"}, {"rating": 5.0, "review": "Amazing product", "verified": true, "helpfulness": "0/0", "author": "Anton \"AL\""}, {"rating": 5.0, "review": "I don't care if Google takes over the world (they will). My Chromecast is a fatal blow to the cable companies & that's all that matters to me.", "verified": true, "helpfulness": "1/1", "author": "Turd Ferguson"}, {"rating": 5.0, "review": "Love Chromecast!! Works as described and more reliable than Roku", "verified": true, "helpfulness": "0/0", "author": "Joyce Locke"}, {"rating": 3.0, "review": "Had to re-enable the 2.4GHz band on my router just to get the Chromecast to connect to my network since it doesn't work with 5GHz routers. Also had issues getting the Chromecast to \"wake from sleep\", would no longer display picture, rebooting it didn't work, had to do full factory reset. I also don't find much use for this device, it kind of sits there like my Apple TV. Oh well.", "verified": true, "helpfulness": "0/0", "author": "Scott S."}]