[{"rating": 2.0, "review": "Does not work with Samsung Smart TVs.  It constantly buffers.  Annoying.", "verified": true, "helpfulness": "0/7", "author": "Rev. Richard Brensinger"}, {"rating": 5.0, "review": "Great so far, need more movie choices.", "verified": true, "helpfulness": "0/1", "author": "Thomas Donofrio"}, {"rating": 5.0, "review": "I love simple and easy to use and this device is fabulous!  I enjoy watching TV series in marathons and Amazon Fire TV makes it really intuitive.  When one episode ends, just press the right side of the ring to select the next episode, press the center to confirm your choice and it starts playing.  If you want a change of pace during a heavy drama (I'm currently watching Oz from HBO), just press the pause/play button; select your next program from your watchlist and now you have American Pickers season 3.  The \"recently watched\" selection at the top of the list makes it super easy to go back to your drama exactly where you left off.Together with Amazon Prime, this is the best entertainment bundle for me.  I use over-the-air antennas for local programming and Prime for all the rest.", "verified": true, "helpfulness": "0/0", "author": "Diane Kohn \"ariasolo3\""}, {"rating": 5.0, "review": "Love it.", "verified": true, "helpfulness": "0/0", "author": "blenniss"}, {"rating": 5.0, "review": "The best pic has I made in entertainment .I would say you want hours of fun on movies & tv show.", "verified": true, "helpfulness": "0/0", "author": "gloria brown"}, {"rating": 5.0, "review": "Wow this media player is amazing:) It replaced my AppleTV and Roku. It has a super fast interface. Plex client super fast. Looking at buying another Fire TV for our 2nd room TV.", "verified": true, "helpfulness": "0/0", "author": "Richard Trotter"}, {"rating": 5.0, "review": "Beat Apple TV and others", "verified": true, "helpfulness": "1/1", "author": "walner bienaime"}, {"rating": 5.0, "review": "This is it fast never gets lost or overwhelmed like roku great serch used it for two weeks . I have three roku and loved them but now this is it.Thanks Amazon", "verified": true, "helpfulness": "0/0", "author": "Robert A Hartsing"}, {"rating": 4.0, "review": "I like the fire TV. The 3 star rating is because of 2 issues that are disappointing to me.[EDIT: One of these has been fixed, so I am upgrading to 4 stars. That said, it still has some disappointments)Lets start with them:1. The no OFF button (or no off combination). Yup, no way to turn it off and stop using power when you want. Sure the appliance is not power hungry, but it stays on for about half an hour or more after you are done using it. I don't care how many excuses Amazon makes (oh it iss to download updates and update the system, etc...)There have been times when I come back to it, and the device is very hot to the touch and on after more than 24 hours of the TV being off and we haven't used the thing. Not sure yet when it triggers this, but it has happened at least 6 times since we bought it. It takes a lot to get the fire tv box hot, so it clearly had been on for the 24 hours or so. And since there is no OFF button, you can't force it off... you have to unplug the thing... Frustrating. (Edit: Apple TV allows you to turn it off by holding the play/pause button for 6 seconds for example)2. Voice search right now is still mainly for Amazon content. HBO is set to be adding that capability to their content (HBO GO whenever it hits in the next 6 months) and Netflix might do the same. But right now, Voice search is virtually just for Amazon content. While this has the potential to get better overtime wth software updates, right now it's lacking. The more frustrating part, is you can't really do voice search per section. Say you are an Amazon Prime member, and want to search just the included Prime content, you can't do that with Voice. Voice returns everything, paid or unpaid. You can't really search say... \"Action movies on Prime\" or something to that effect. Or \"cartoons on prime\". Not possible.You can do those types of searches using the remote and sifting through content but not through Voice search.Those things made it lose 2 stars. There are a few minor quibbles as well:- When watching a series, after you are done with 1 episode, it does not default to the next... it stays on the current one. If you've ever used Netflix (even on the netflix app on the fire tv) you know it immediately skips to the next episode. This should be a very easy fix, disappointed it is still there.-The rest is postive, so lets start with it:- Voice understands me very well. On par if not better than Siri which has had many more years of practice. Friends with heavier accents were also understood quite well. (my first language is Spanish)- The remote is very well made. It's small, it's simple. Easy to hold, great grip. Overall one of the best remotes on the market. Great design.- The box itself is good. It plays the content in great graphic, the preloading of content works well, and you are rarely waiting on buffering.- Easy to connect via HDMI. and has dolby 5.1 (though I haven't tested this feature).- Preloads your amazon.com account to it, so you don't have to set that up manually (saves you 5 minutes)- I really like that by tapping the firetv remote, my Samsung tv automatically comes on. (here it would come in handy to have a way to turn firetv off via the remote, and it triggering the TV to turn off as well)Overall, I am happy with the fire tv, and i HBO GO app does come soon and you can do Voice search there, I might up the review to 4 or 5 stars. I also hope they add a way to turn the thing OFF when you want to, not whenever it decides.Update July 2015:- At this time, there is an HBO GO app, but Amazon hasn't reached a deal with Comcast - which provides a huge number of households with internet, so it's essential not available to a lot of owners.- Now you can turn it off (to sleep) by holding the home button. Thank you Amazon.- After all this time in the market, the voice search is still only good for pretty much just Amazon content, which is disappointing. No netflix or anything like that yet in the fold.", "verified": true, "helpfulness": "1/4", "author": "M. Cordoba \"mxc\""}, {"rating": 2.0, "review": "It happens to be a Great product, WHEN IT WORKS. WE keep having all sorts of failures when using this product. It will pause during play sometimes, or suddenly state that this title cannot be retrieved or played at this time. We had a power surged and then the device quit working all together, Amazon sent out another box to replace it (amazing customer service). This one will have good days and bad days, it is hooked up to a cable so not attacked to WI-FI, i even tracked my internet usage to see if it dropped at the moment the Fire TV quit working and it was solid. I realize the device is new, but these seem like simple bugs that should have been worked out during ALPHA testing or at least Beta testing.Well i am now on my third box (Warrenty replacement) , and i still have issues. I dropped my rating from 4 stars to two. Its boggles the mind to have the same issues with each box they sent me. Its also a pain to use amazon prime when looking for things to watch. There is no filter for prime videos and videos you need to pay for. IF I was able to make my decision again for a internet tv box I simply would not choose this device. It uses outdated apps that my 3 year old phone has newer versions of (netflix). The screensaver sucks up data like nobody buisness.Now this is my first real review ever. I usually dont bother with these but this drove me to write one.", "verified": true, "helpfulness": "0/2", "author": "Medic"}]