[{"rating": 4.0, "review": "Very convenient to use, especially if you are attempting to pull the cable plug.  I do not miss having a remote, and controlling the device from my iPhone works well. The only problem is the device does not pick up wifi signals very well, even when used with the HDMI extender.  I solved this problem by moving my router closer to the television.  The WatchESPN application is almost unusable.  The buffering is always bad and usually an error will occur which requires a reset of the application.  This occurs even though I am on a 30 mb/s cable internet connection.  I have no buffering issues using WatchESPN on my Roku LT which is located in another room.", "verified": true, "helpfulness": "0/0", "author": "dsk"}, {"rating": 5.0, "review": "Love the Chromecast! I use it all the time to watch Netflix, YouTube videos, etc. almost considering getting rid of my AT&T; TV service.", "verified": true, "helpfulness": "0/0", "author": "Molly Wiebe"}, {"rating": 5.0, "review": "I'm now able to watch all my You Tube video on full screen, for the price it's a must have for anyone who using a tablet.", "verified": true, "helpfulness": "0/0", "author": "JerseyDevil1949"}, {"rating": 5.0, "review": "Basically only useful for Netflix so far for me", "verified": true, "helpfulness": "0/0", "author": "Kelly"}, {"rating": 4.0, "review": "sometimes needs reset, other than that satisfied", "verified": true, "helpfulness": "0/0", "author": "nancy salander"}, {"rating": 5.0, "review": "So so sooo cool.  This little inexpensive device has saved me from going out of my mind by not being able to afford cable TV service.  I highly recommend this product if you have a non-smart HD TV with an HDMI and USB connection, a wireless internet addition from your cable TV provider and a standard (for me, I have 7 mgs) internet speed.  I'm constantly casting Netflix onto my TV and I love it!", "verified": true, "helpfulness": "0/0", "author": "cat"}, {"rating": 5.0, "review": "I really like it!", "verified": true, "helpfulness": "0/0", "author": "Donghyun Yun"}, {"rating": 5.0, "review": "Worked as it was advertised. However I did download a separate app to transmit my phone pics to tv screen. Now works well for all asked of it.", "verified": true, "helpfulness": "0/0", "author": "Jerilin M Gregouire"}, {"rating": 4.0, "review": "Google chrome cast is well worth it, that is of course if you have the good apps that go well with it. It's useful to those who don't have a smart tv but have Netflix, Pandora, and use YouTube. My personal downside is that my windows surface tablet is not compatible with Google Chromecast, but that's not why I rated the item a four star. Connecting an electronic device can be kinda complicated to those who aren't familiar with electronic devices. I struggled to connect my phone to my Chromecast because I wasn't familiar with the device, and there isn't any instruction manuals step by step to connect other then the three steps on the box when you open it. Over all it's a good item to own when or if traveling or have in the house.", "verified": true, "helpfulness": "0/0", "author": "Diego"}, {"rating": 5.0, "review": "Got it in 2 days so far so good", "verified": true, "helpfulness": "0/0", "author": "Salena"}]