[{"rating": 5.0, "review": "AWESOME!!!!", "verified": true, "helpfulness": "0/0", "author": "chad bundy"}, {"rating": 5.0, "review": "I love it.", "verified": true, "helpfulness": "0/0", "author": "Mary Kimbrough"}, {"rating": 5.0, "review": "It's AWESOME! I LOVE it! Gary Busey WAS RIGHT......LOL", "verified": true, "helpfulness": "0/0", "author": "Kacey"}, {"rating": 5.0, "review": "This is a great product for people who love Amazon. The Amazon TV offers a plethora of television entertainment options like Netflix, Hulu, and Amazon Prime. The product works better when you are an amazon prime member because you can play prime music on the amazon television. The product was sleek and very slim; the product does not take up a lot of space at all. At the end of the day, this product is great for people who do not have cable or who needs a media solution for another bedroom or entertainment room.", "verified": true, "helpfulness": "0/0", "author": "Eric D Carter"}, {"rating": 5.0, "review": "I love it...but after only having it for 1 week...there is no power from the box;so I'm replacing it.Hopefully it is just a one time issue!", "verified": true, "helpfulness": "0/0", "author": "Carol Fite"}, {"rating": 4.0, "review": "Very easy to install and easy to use. The voice activate menu is great it will even adjust to your accent.", "verified": true, "helpfulness": "0/0", "author": "Robert Bogardus"}, {"rating": 4.0, "review": "I love the variety we get on this TV, but I expected more free channel options from being a Prime member. We also have a lot of delayed time, but I am sure that is just the Internet connection. Overall though, I am glad we switched from Cable to this.", "verified": true, "helpfulness": "0/0", "author": "Nicola B."}, {"rating": 4.0, "review": "Haven't had any issues this is a great device.", "verified": true, "helpfulness": "0/0", "author": "Derrick Augustus"}, {"rating": 5.0, "review": "We love this!  So much easier to use than a Roku and does so much more.  I highly recommend this product.", "verified": true, "helpfulness": "0/0", "author": "Camilla O'Keefe"}, {"rating": 3.0, "review": "I'm still learning how to work all the features but so far I'm satisfied", "verified": true, "helpfulness": "0/0", "author": "troy mckay"}]