[{"rating": 5.0, "review": "It is what it is and does what it says........can't ask for more than that! Windows XP and Vista users don't need to worry,you can load it with a Linux live CD (IN LIVE MODE)!( Just plug in your Ethernet cable and use WiFi together.once it's set up it works great on Windows! (NO LINUX INSTALL NEEDED!)  Linux is a free download DVD.", "verified": true, "helpfulness": "1/1", "author": "paul cooper"}, {"rating": 1.0, "review": "Rarely works and many apps have to be compatible and we keep running into the problem where the app is NOT compatible, like NHL Gamecenter from my Android phone and the PAC 12 Network app. Netflix works sometimes. But if Netflix is all you need to stream, go buy something that gets the job done. We have not been able to use this Chromecast device hardly at all for one reason or other.", "verified": true, "helpfulness": "1/2", "author": "Strong5"}, {"rating": 4.0, "review": "It is a really cool device for streaming, and sharing video/music with friends. I use it for Pandora, YouTube, Netflix, etc. You get good picture quality out of it, and it is a great value for just $35! Would definitely recommend to friends, and already have.", "verified": true, "helpfulness": "1/1", "author": "farrell304"}, {"rating": 1.0, "review": "Worst device ever purchased.  Was really looking forward to the usefulness but only gained hours of wasted time. Every time is has to be setup, connection issue, even with wifi and android device less than a foot away. Not worth the time or energy", "verified": true, "helpfulness": "0/0", "author": "Dave. Dave"}, {"rating": 2.0, "review": "Not that muchos usefull...i regret not buying a roku", "verified": true, "helpfulness": "0/1", "author": "facu"}, {"rating": 3.0, "review": "Five star at first sight. Downgrade two stars because it has so many bugs.", "verified": true, "helpfulness": "0/0", "author": "name_hidden_by_system"}, {"rating": 5.0, "review": "If you want to stream avi, mp4, rmvb, etc. from your PC to Chromecast, install Videostream - https://chrome.google.com/webstore/detail/videostream-for-google-ch/cnciopoikihiagdjbjpnocolokfelagl?hl=en - and be happy.", "verified": true, "helpfulness": "0/0", "author": "@eldertanaka"}, {"rating": 5.0, "review": "* Update: Solved with update and now the Cast screen option with Chrome Browser is just awesome, can watch anithing I see or play in my laptop (You can also cast the S5 screen or Nexus 7 2nd Gen screen an see/play anithing!).﻿ Install de Chromecast app and check if your phone/tablet can cast its screen too.* Video: [...]* Old Review: After 10 months using or trying to use it, I found it has a serious issue with the video buffering which makes it almost useless. The first months it worked great, I could play several YouTube videos without any issue; then it started pausing and resuming every second (yeah every single second) so it made it useless.I tried by resetting it to default and it did not work. I decided to try it with another TV and another wireless network, and got the same result. The annoying thing is the fact that I cannot pause the video once it gets in that Pause/Resume cycle and it starts at the very beginning of the YouTube video, the only thing I can do is to play another video and maybe I will be able to pause it at start so it can be buffered. Once I pause the video and wait for a while, if I play again the video may play normally. The problem is I cannot pause the video sometimes and it should not work like that.Hope google finds the issue and solve it one day. Should be an easy task. It is not a network problem, it is a Chromecast / YouTube issue.", "verified": true, "helpfulness": "62/77", "author": "FROILAN MORALES"}, {"rating": 5.0, "review": "Good just plug and view on your TV. Excellent gadget.", "verified": true, "helpfulness": "0/0", "author": "Srini"}, {"rating": 5.0, "review": "This thing is amazing.  I'm officially dumping my cable bill and this bad boy is helping out.  We've had our first one for quite a while and kept moving it between rooms.  My laziness has forced me to purchase a second.  Team this up with a Nexus 5 and you can cast a whole lot of stuff.It seems as though companies are really starting to embrace Chromecast.  Definitely a worthwhile investment!", "verified": false, "helpfulness": "0/0", "author": "Anthony H."}]