[{"rating": 3.0, "review": "The item seems to work OK but Iam still working on the WIfi connection which I share with a next door neighbor so I cannot give a positive answer until the setup is on.", "verified": true, "helpfulness": "0/0", "author": "R. Gréville"}, {"rating": 3.0, "review": "I'm giving this little device three stars only because if I give it two stars it means I don't like it. I do like the concept, but I just wish it worked for more televisions. I have an LG 60\" television new enough to have every connection option possible; certainly more than the Chromecast instructions require. Because the television is new and so high tech, I never had any doubt that the Chromcast device would work on my television, but it simply won't. Only after you get the device up and running on your wireless network, which is simple, are you given instructions to register the device you want to use to stream videos to. There is a long list of televisions, blue rays, and other devices that are compatible, but mine was just not on the list. The problem is that there's no way to know whether the equipment you own is on that list of compatible devices BEFORE you purchase the Chromecast device.  I contacted Chromecast after several failed attempts to stream the video from Amazon Prime. Their representative spent considerable time going through every step and option, only to finally tell me that I was not going to be able to use the Chromecast device. It would help considerably if there was more information available to consumers BEFORE they purchase and install this device that would tell them if the device they plan to use can be registered. I returned the devise to the store where I purchased it. The person who sold it to me was also unaware of the limited list of devices that could be registered. Maybe the next version will offer more choices. If it does, and I can know before I buy it if my equipment will work with it, I'll buy it again. For now, I'm just disappointed that I can't use it.", "verified": false, "helpfulness": "0/0", "author": "Eva M. Thompson"}, {"rating": 5.0, "review": "Follow the directions carefully, and whatever WiFi network you use to setup with, make sure that is the connection you'll use for then on.", "verified": true, "helpfulness": "0/0", "author": "steve bowens"}, {"rating": 5.0, "review": "Really love this item you can share from your google chrome browser to your TV and from your mobile iphone and andriod what you love to share. I recommend it to every one go and buy it without hesitation", "verified": true, "helpfulness": "0/0", "author": "Hozaifa F Al Safwa"}, {"rating": 5.0, "review": "simple and easy to plug in and use with our flat screen. Loaded the software from the Chrome browser and now we broadcast anything we have on the Chrome browser to the TV. Wife loves using her laptop to then cast music videos on the TV. We use it all the time with Netflix and Hulu and Amazon. By far my favorite Google product ever!!", "verified": true, "helpfulness": "0/0", "author": "SandersWI"}, {"rating": 5.0, "review": "I love it, but my LCD TV doesn't have a USB port which allows the Chromecast to turn on/off with the TV power.  I had to use the USB power, but it seems that the Chromecast doesn't like being on the time.  Sometimes my iphone loses connection with the player and I need to reset the power on the player for it to become responsive.", "verified": true, "helpfulness": "0/0", "author": "Lost Dad"}, {"rating": 5.0, "review": "Very easy to setup and having Google chrome already setup puts you one step ahead. Awesome. Just missing the adapter for VGA/DVI and audio splitter to use on any monitor but $35 is already too low for what you get", "verified": true, "helpfulness": "0/0", "author": "Cisco"}, {"rating": 3.0, "review": "This is a really simple solution to stream YouTube content of your TV. Only drawback is not I want one on every TV in the house!Google needs to get more content providers on board, and endorse the sharing of screen from your android device so you can put up your own media from the phone/table gallery.", "verified": true, "helpfulness": "0/0", "author": "K. High"}, {"rating": 5.0, "review": "we love it! i wish it had more apps but its still awesome. my husband and i love it, my mother and brother love it too. easily watch your shows from apps", "verified": true, "helpfulness": "0/0", "author": "mystic"}, {"rating": 5.0, "review": "This device is a great buy for $35.  At first we used it only for watching Netflix but now we've started using it to watch Hulu & YouTube videos on the big screen as well.As of today Google has publicly released the SDK for all developers which means anyone can now integrate Chromecast with their application.  Not only useful for video but its also conceivable that game developers will integrate as well so you can play games on the TV via the cast option.If you've been on the fence for this item I suggest you give it a shot.  Lots of similar devices on the market but at least 3 times as expensive.", "verified": true, "helpfulness": "0/0", "author": "D. Roth \"MunkyXTC\""}]