[{"rating": 5.0, "review": "It is a great product.  Thanks Amazon", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer \"spark_plug_y2k\""}, {"rating": 5.0, "review": "Fast. Comes on almost instantly. No buffering when you press play. Great value. Very happy.", "verified": true, "helpfulness": "0/0", "author": "Bob"}, {"rating": 5.0, "review": "Exceeded expectations. Arrived sooner than expected. The packaging was superb. It was boxed like a piece of fine jewelry. It is obvious that Amazon is very proud of this product. Hooking it up was a no brainer. Ten minutes from box to being \"on the air\".  Program and movie content is exceptional. Lots of good free movies plus many more to rent. Rental is less than Uverse. Other choices beyond the movies are endless. Nobody should ever get bored with this service. Picture quality is perfect, sound quality is perfect, no waiting for selections to start. Remote is small with all the features you need. The voice search is great. What else can I say. A product that lives up to it's sales pitch. Hard to believe in today's world of junk. Buy it...... You won't be sorry.", "verified": true, "helpfulness": "0/0", "author": "Bob Walter"}, {"rating": 5.0, "review": "I love this thing!  It's so easy to search using the quality search by voice feature.  My second favorite feature is the \"Other ways to watch\" option when you find what you are searching for.  The show might be $6.99 on Amazon, but FREE on Hulu PLUS.  The Amazon Fire actually makes it easy for you to watch the free version.  Major thumbs up on that feature.", "verified": true, "helpfulness": "0/0", "author": "LoonieLake"}, {"rating": 3.0, "review": "The Good: Voice search works well for Amazon Prime and Hulu content.  Content loads quickly.  Resuming a show that you stopped watching is nearly instantaneous.  A very good experience for Hulu and Prime content. The Bad: Voice search does not work for content from any other source besides Hulu/Prime.  For example, searching for Frontline will find the PBS Frontline show and provide options for purchasing from Amazon Prime.  However if you open the PBS app and look for Frontline, you can watch for free.  For anything except Prime/Hulu, you appear to have to know which app to open to watch the content for free.  If you do not know the content provider, this can be difficult.No volume control (that I could find).  I understand that there is no IR blaster to control the TV volume, but controlling the volume via the HDMI input to the TV is done by other set TV boxes.  Also, my TV will auto turn off if it does not detect an HDMI input for some period of time.  There should be a way to \"turn off\" the fire TV where \"turn off\" means disable the HDMI output so that the TV will auto off.  Similarly, the TV will \"turn on\" when it detects an HDMI connection.  Currently, the fire TV goes into screen saver mode and shows pictures when not active.  There may be a setting to change this, I didn't notice one. The Indifferent: For non-Prime/Hulu content, this is just a standard streaming box.", "verified": true, "helpfulness": "0/0", "author": "Heidi"}, {"rating": 2.0, "review": "High hopes for this product.  The specs are overwhelming.  The performance is underwhelming, actually.  My Roku3 loads apps quicker and is last years model.  Netflix App would not install,  giving errors.  Plex would not function properly at all.  The Fire TV Stick has worked and functioned better than it's big brother.", "verified": true, "helpfulness": "1/2", "author": "Joshua M. Thomason Sr."}, {"rating": 4.0, "review": "Out of the box I found the Firetv to have the fit and finish of a high quality product, similar feel to an Apple product. In terms of content available there is nothing else that has as much. It streams Amazon prime content most reliably and the voice search function for Amazon content is outstanding. The only reason I give it 4 instead of 5 stars is that the streaming of Netflix did not work until I updated the firmware, and once I did get Netflix to work it would freeze or buffer about every 15 minutes. I'm not sure if the problem has been resolved, but lately our Netflix service has streamed without issues so it may have been fixed. Also, it would be great if the voice search function worked in apps like Netflix, it does not. I purchased the Firetv on black Friday for $75 at Best Buy. I don't think you could find a streaming device that is more reliable, with as much available content, or a better user interface for the money. Well done Amazon.", "verified": true, "helpfulness": "0/0", "author": "Angela Kiesz"}, {"rating": 5.0, "review": "Works great really enjoy it, easy set-up.", "verified": true, "helpfulness": "1/1", "author": "HOWIE"}, {"rating": 5.0, "review": "This was a great purchase. No hassle hook up, and works wonderfully. I am impressed.", "verified": true, "helpfulness": "1/1", "author": "BAXTER"}, {"rating": 1.0, "review": "I like my Roku much better.", "verified": true, "helpfulness": "3/11", "author": "Ronald W Spotts"}]