[{"rating": 3.0, "review": "Works good, but Comcast  apps have no support yet.", "verified": true, "helpfulness": "0/1", "author": "nate22"}, {"rating": 5.0, "review": "Would recommend perfect price for a great product", "verified": true, "helpfulness": "0/0", "author": "good stuff"}, {"rating": 1.0, "review": "Beware! New Fire TVs shipped from amazon cannot be rooted any more due to an efuse in the latest firmware. If you're lucky, you can still get one from a third party with the old firmware and prevent it from updating in order to get root relatively easily. Very low, scumbag move amazon.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Wasn't what I expected", "verified": true, "helpfulness": "0/1", "author": "Karen Lindeman"}, {"rating": 4.0, "review": "It took two to get one that worked. The problem was the unit on set up did not prompt me to enter the password for my Wi-Fi, which I immediately noticed when I got the replacement unit. One other thing, each remote is matched to the unit it comes with, didn't think it would matter but is seems to. I like it a lot more then using my PS3 to watch movies and there is just so much more with it. A good deal in my mind.", "verified": true, "helpfulness": "0/1", "author": "Stephen Ariosa"}, {"rating": 5.0, "review": "Awesome piece of tech.  I bought it to replace my Blu Ray players Wi-Fi issues while trying to stream HULU and Netflix.  Love the voice search and picked it over the Amazon stick for the increased RAM to thwart any \"buffering\" issues. Highly recommend it!!", "verified": true, "helpfulness": "0/0", "author": "Jackdef"}, {"rating": 4.0, "review": "It works well.", "verified": true, "helpfulness": "0/0", "author": "Jack Shing"}, {"rating": 5.0, "review": "very fast downloads", "verified": true, "helpfulness": "0/0", "author": "GE BECK"}, {"rating": 5.0, "review": "Yes, it is great.  Thanks", "verified": true, "helpfulness": "0/0", "author": "Warren Christy"}, {"rating": 3.0, "review": "Easy install but you do have to purchase the HTML cable separately. The best functionality of Amazon Fire TV is with the $100 subscription to Amazon Prime. With Amazon Prime the TV movie, HBO series and the video music offerings are really impressive. The one complaint is that the batteries shipped with Amazon Fire TV for the remote quickly went dead after about two days of usage. Other batteries installed also went dead very quickly as well. There is no off and on switch on the remote or the little black box. Apparently the Amazon Fire TV is always on even if you are not viewing it. My current solution is to take the batteries out of the remote after each use and then reinstall them when using Amazon Fire again. Still trying to figure how to contact Amazon on this issue.", "verified": true, "helpfulness": "1/1", "author": "Bill K."}]