[{"rating": 1.0, "review": "You can already get Amazon Prime on other devices.  Devices that cost less.This is no different than Roku, Netgear's device, Vizio, Sony's devices, etc, etc.  All of them lock you down to their own service.  You want something they don't have... to bad, you can't go to play store and get it.  They are all doing this crap, and you are always locked down to what they offer you.  Oh, and the remote is crap... the cpu not that great.  Really, it's just a locked down rebranded solution that others already offer.  Hell, with the crappy game controller, this looks like an Ouya.Go buy a generic Android TV device.  Amazon sells them.  One that has a better remote, a keyboard for example.Want to play good games, ones that support the default android multi-touch?  Then go get that.  One that allows you to chose the games you want from play store, not one where they chose what you should have.", "verified": false, "helpfulness": "7/30", "author": "BackAssward \"BackAssward\""}, {"rating": 5.0, "review": "Very east  to install, immediately watched a movie.  User friendly to operate.  Love IT!!! Don't hesitate to purchase Amazon  Fire,", "verified": true, "helpfulness": "2/2", "author": "Clean Corners"}, {"rating": 5.0, "review": "Very easy to install and use. The voice search is a very useful feature also.  I had a very good experience with this feature.  It makes using and watching movies or other genres great", "verified": true, "helpfulness": "1/1", "author": "Sandra Maddox"}, {"rating": 4.0, "review": "I bought this based on the general reviews. I have not owned a Roku or Apple TV so am not an expert. It is easy to set up, really fast and I love that it is a controller (in theory as I haven’t received mine yet. The only reason I didn’t give 5 stars is that I wish the navigation was a bit better. I don’t mean the way the remote works (it is excellent with Bluetooth connection, I’m not fighting the normal IR fight) but the navigation of content. The Voice Search is great (which helps) but I wish it had the ability to filter solely by Amazon Prime movies and content. It does have what’s new on Prime, but I wish I could filter by all Prime, or all games or possibly a customizable Launchpad like on the Dolphin Browser for all the Android users out there.", "verified": true, "helpfulness": "2/2", "author": "Amazon Customer"}, {"rating": 1.0, "review": "Haven't been able to stream anything from Netflix or YouTube without the app crashing or the video stuck loading forever.", "verified": true, "helpfulness": "22/31", "author": "Sean Tanimoto"}, {"rating": 4.0, "review": "I had a Roku 2 for some time and Fire TV blows it out of the water in performance. The picture and sound quality are superb. The voice command is effortless. The only gripe I have is that the voice command only works with Amazon content. I primarily use Netflix for streaming and although the netflix app works even better than Roku and the programing of Fire is a pleasure to use, I would rate Fire TV with five stars if the voice command was available to other apps. In terms of hardware and programming, this box is definitely worth a look.", "verified": true, "helpfulness": "3/3", "author": "Russell Olsen"}, {"rating": 1.0, "review": "Every unit in the world has HBO GO but this one!!  Very Disappointed because Best Buy sales guy at store said it had it.  Should have done a little research before purchase!", "verified": false, "helpfulness": "5/27", "author": "J.S."}, {"rating": 3.0, "review": "Just had this for a couple of days now and my first impressions are that while the unit looks good (alabite edges are a little to sharp which can be a bit of a 'pain' when trying to push in cables in the back of it).The GUI is a bit clutered compared to the more srteamlined ROKU interface.My main problem with this streamer is that the voice control (which is very accurate) only searches on Amazon Media and not Netflix,  I also could not find an option to search only Amazon Prime Media that come free with the Prime membership.I hope a later software update will solve these issues.Otherwise quality of streaming is excellent - i don't know whether it is because of the streamer itslef or because of the high bandwidth that i have.", "verified": true, "helpfulness": "2/4", "author": "Kamil"}, {"rating": 5.0, "review": "Got the Fire TV on Monday and had some problems with it finding the wireless network.  After a few calls to customer support they said to use an Ethernet cable from the wireless router to the box.  That did the trick and it downloaded the updates and began to receive the wireless signal.  I could not be happier with the Fire TV.  The picture and sound are great and the microphone feature works very well. The selection of movies and shows is awesome and this unit has everything I will ever need and it adds more value to my Prime membership.  If you are looking for a video streaming device this is the one.", "verified": true, "helpfulness": "2/2", "author": "David Feland"}, {"rating": 5.0, "review": "The Fire TV has a lot of the same features (e.g., Netflix, Pandora) that are built in to my brand new Samsung \"smart\" TV. However, the Fire TV interface is far superior in terms of its ease of use, speed, and overall functionality. It makes my \"smart\" TV look downright dumb. For example:- Multitasking: On my Fire TV I can play music (Pandora, TuneIn, etc.) and then do other things with my Fire TV (like play a game) with the music still playing in the background. (My Samsung TV does not multi-task and will stop playing music as soon as I leave the music app.)- I can quickly pause/start/skip music via the Fire TV remote or game controller without having to navigate back to the music app.- The Fire TV's \"Recent\" apps section allows me to quickly start my favorite apps. For instance, I can get to Netflix with only a couple clicks of the remote, while my Samsung TV always makes me start from the Home screen and navigate to the Apps screen and then finally to the Netflix icon -- a minimum of 6 clicks away.- On top of that, apps open on the Fire TV almost instantaneously. Apps on my Samsung TV always take several seconds to load.- The apps and games available on Fire TV are far superior to anything on the Samsung TV.It's too late to return my \"smart\" TV for a refund, so I'll just continue to use it as a dumb monitor for my Fire TV.", "verified": true, "helpfulness": "1/1", "author": "Seattle Steve"}]