[{"rating": 1.0, "review": "I assumed Amazon Fire included free content.  I was disappointed with the cost", "verified": true, "helpfulness": "1/4", "author": "connie krisman"}, {"rating": 5.0, "review": "We have had our fire tv for about a month. We love it. Our internet usage has risen sharply, but so nice to watch we want,when we want to.", "verified": true, "helpfulness": "0/0", "author": "sherri jones"}, {"rating": 5.0, "review": "So simple it has changed the way we watch TV", "verified": true, "helpfulness": "0/0", "author": "Sam Lindsey III"}, {"rating": 4.0, "review": "A good versatile box.", "verified": true, "helpfulness": "0/0", "author": "Christopher L."}, {"rating": 5.0, "review": "Got this as a gift for my mother-in-law and she loves it.  Very snappy, no lag on controls.  Voice search is actually pretty impressive and way better than keying something in with a on screen keyboard.  Wish it had Vudu, but prime has overall been impressive in content.", "verified": true, "helpfulness": "0/0", "author": "Brian"}, {"rating": 5.0, "review": "Great item!!! Lots of app choices and very easy to operate!!!", "verified": true, "helpfulness": "0/0", "author": "penny metzgar"}, {"rating": 5.0, "review": "Amazon Fire TV is awesome!  It was an extremely easy set up and our HD picture quality and sound is so much better with Amazon Fire than it was with our cable provider.  We are enjoying all the TV shows and movies that we missed because these programs were too expensive with our cable company.  I highly recommend Amazon Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Lucky Trish"}, {"rating": 5.0, "review": "I love it, it so easy to use, I love the voice command controller", "verified": true, "helpfulness": "0/0", "author": "Olivia j r kiley"}, {"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "frank celindro"}, {"rating": 5.0, "review": "Excellent picture and clarity. The unit plays continuously, very little interruptions, and prime contents are clearly labeled.  Voice activation is helpful and it was easy to set up.", "verified": true, "helpfulness": "0/0", "author": "W. Parker \"Parker Notations\""}]