[{"rating": 3.0, "review": "Here is the deal with this item.  It allows you to turn your phone, tablet, or computer into a \"nerve center\".  When I got this item, I thought it was going to be the same as roku or apple tv.  It will allow you to turn your phone, computer, tablet into a delivery system, but that is all.  It takes your content on those devices, and streams it.  When you look at the other two devices, it actually has apps that connect directly to the computer so that you don't need another app.  I figure that it does work as far as you only have your phone, your tablet, or other and you want to stream to the tv with it plugged in, but in all, it did not live up to the hype that I had heard from the commercials.", "verified": true, "helpfulness": "0/1", "author": "Malcolm"}, {"rating": 2.0, "review": "Unfortunately Google did not release the SDK for this product therefore you can only beam netflix and youtube from your phone. Could not get the chrome web browser to work from my iphone.  Really needs to be compatible with more apps to be better than the competition.", "verified": true, "helpfulness": "0/1", "author": "Eli"}, {"rating": 5.0, "review": "love it and mom will be to when she unwraps hers under the tree. Thank you so much. Skye Jackson,", "verified": true, "helpfulness": "0/0", "author": "skye"}, {"rating": 3.0, "review": "I bought this because I had heard lots of great hype about it and at just $35, how could I not try it?  Installation was easy enough, although a little oversimplified to the point that minor details on how to actually use it were omitted.  I don't recall the device telling me that there would be an icon at the top-right of my Netflix app.  But that only took a minute to figure out.  Using it with my iPhone is a breeze and an awesome experience.  Not only being able to toggle captioning without pausing the movie, but I'm also able to close the app and use my phone normally without interrupting the stream.  So far, flawless in that respect.HOWEVER, when you're not using it, unplug it.  That sucker gets HOT.  I don't know if it's an issue with mine or what but keep an eye on that.I'm happy with it, overall.  But I feel like it could do more and from what I understand, there should soon be support for local media.  We'll see.  In the meantime, it's a low price tag and while it does very little, it is very good at the little it does.", "verified": false, "helpfulness": "3/3", "author": "J. Kimray"}, {"rating": 5.0, "review": "Highly recommend this product.  For the functionality and the fact that they are putting out new and useful applications that can sync with the device and cast to it.", "verified": true, "helpfulness": "0/0", "author": "Jonathon Gates"}, {"rating": 1.0, "review": "As of 12/2/2013 It's just not that useful. I already have a couple devices that do Youtube, and Netflix. I tried to stream Amazon Prime to it, but it requires a far more powerful computer than my laptop to do so. The potential is there, but until they have more apps then it's just not that useful.", "verified": true, "helpfulness": "0/1", "author": "Raja Ramanathan \"ramaloma\""}, {"rating": 5.0, "review": "Amazing quality and ease of use for the price. I own three, one for each TV and my family routinely broadcasts Netflix and YouTube. Can't wait for Google to expand the number of apps that work with it, currently only wireless PC Chrome browser, YouTube, Netflix, Hulu & HBO Go. Device is still in Beta so future potential is limitless.", "verified": true, "helpfulness": "0/0", "author": "P"}, {"rating": 5.0, "review": "There are a million reviews about Chromecast on the net. Just a few simple thing about this product... easy to use ( my retired dad just started using a computer about 2 years ago and he has one) ..... cheap media player....setup was easy.just get it dont think about it.", "verified": true, "helpfulness": "0/0", "author": "Vic Singh"}, {"rating": 2.0, "review": "Great idea. but stopped working after 2 months...google support gave run around and hence finally trashed. Google should have made exchanges process little easier.", "verified": false, "helpfulness": "0/0", "author": "Jg"}, {"rating": 5.0, "review": "This is a great product!  And for the price, it can't be beat.  We absolutely love it!  I love that I can operate it on my HDTV from a smartphone, a tablet or my PC and the picture is beautiful and clear!", "verified": true, "helpfulness": "0/0", "author": "T&V.R.;"}]