[{"rating": 5.0, "review": "Works Great and very easy to set for a Novice like myself. Love it! On time delivery also!. Would definitly do business with these guys again!", "verified": true, "helpfulness": "0/0", "author": "Archana Patel"}, {"rating": 5.0, "review": "We use this on our tv as an easy no hassle way to shoot show from Netflix to our TV wirelessly. We had some issues initially with streaming stutters, but after upgrading to a nice router with more throughput and range, we have not had another problem even upstairs with the router downstairs.", "verified": true, "helpfulness": "0/0", "author": "Bobby McDonald"}, {"rating": 5.0, "review": "Works great past 3-4 months", "verified": true, "helpfulness": "0/0", "author": "Amos Samuel"}, {"rating": 4.0, "review": "Works good I had a few problems setting up at first .it might be my Internet connection. I paid about $30. I've seen other a lot more expensive.", "verified": false, "helpfulness": "0/0", "author": "Mario"}, {"rating": 5.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Edward Andrews"}, {"rating": 5.0, "review": "I love this little device. I can easily cast You Tube or Netflix from either phone or computer to my TV. It has transformed our OLD Sony Wega (which luckily was ahead of its time and actually had a HDMI port on the back) into a \"smarter\" tv. This old TV might weigh a million pounds, but it still has a beautiful picture, and I figure it's burglar proof! Now we can view any online content right on this old TV. I also tried it on our newer large Samsung flat screen TV and it worked fine on it as well.", "verified": true, "helpfulness": "1/1", "author": "Ibuystuff"}, {"rating": 5.0, "review": "I cant say enough about this, but its all been said... this thing is great. why i waited so long to buy it i have no idea.here on amazon its like $5 cheaper than its normal advertised price... which is still VERY affordable. this is a one time cost, no monthly fees, no subscriptions. (i did hear that a certain 'coupon' site had it even cheaper but i still have no regrets)2 things i was uncertain of when i purchased... first you can cast from ANY chrome browser connected to you ROUTER not just your WiFi. Laptops AND desktops work even if they are hardwired. Second, using the associated app (so just phones and tablets i think) you can cast your actual screen... whatevers on it.", "verified": true, "helpfulness": "0/0", "author": "Dr. Joseph Bell"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Mercedes do Mato"}, {"rating": 2.0, "review": "I loved it initially then It stopped working after a couple of months, never could get it to connect to network after that very disappointed.  Its a great idea", "verified": true, "helpfulness": "0/0", "author": "Barbara A Stebbins \"Barb from MI\""}, {"rating": 5.0, "review": "Works perfectly as intended.", "verified": true, "helpfulness": "0/0", "author": "Daniel Denney"}]