[{"rating": 4.0, "review": "I'm really happy that I bought the Google Chromecast! It works as expected and it turned my non-smart tv into a internet tv. I can now stream wirelessly from my computer, tablet, and phone. I give it 4 stars, not 5 only because my tv is somewhat far from my wireless router and sometimes I have streaming issues and the picture quality is not that great. Also I wish the chromecast was compatible with more sites and apps that offer streaming. Super fast shipping!", "verified": true, "helpfulness": "0/0", "author": "Jewel M."}, {"rating": 3.0, "review": "I got one of these for Christmas, and while it does stream music, Netflix and a few other apps, it does not reliably stream local content, which was half the reason I wanted it. Should have done my homework a little better, I guess, but to save someone else the trouble: .mkv files play without sound and it cannot stream .avi. .mp4 is okay, but only files of a certain size.", "verified": false, "helpfulness": "0/0", "author": "E. Chase"}, {"rating": 1.0, "review": "Only works with you tube and netflix, not amazon and other apps. Apple TV will work with any app on iPad or iPhone.", "verified": false, "helpfulness": "0/1", "author": "Tina Little"}, {"rating": 4.0, "review": "This thing works great! The only reason it is not 5 star is it does not have 802.11 n or ac. With 1080p streaming simple 802.11 g just does NOT cut it.", "verified": true, "helpfulness": "0/0", "author": "BobOki"}, {"rating": 5.0, "review": "Great little invention. We really enjoy watching on TV what we were only able to watch online. We can't wait for more channels to be availible, but right now is cool.", "verified": true, "helpfulness": "0/0", "author": "R.J.O. \"4theheart\""}, {"rating": 1.0, "review": "Several features seem to be missing from this device that were once available...  Suggest apple TV or an HDM cord to your laptop instead.", "verified": true, "helpfulness": "0/0", "author": "K"}, {"rating": 2.0, "review": "Installed it in moments, and it worked out of the box.  Intuitive, clean interface, with all the content I wanted from the net.  I'm also glad that Google broke with convention and took an open approach, working well with both iPhones and Android, as well as all flavors of PC.But I was surprised to find, one day, that it simply stopped working.  I reached out to Google's abysmal customer service line and had a robot walk me through a number of steps I had already tried.  When I asked for an address to exchange it, she passed me on to another person who gave me the same list of steps.  Finally, I got through to someone who confessed that they didn't handle returns (in spite of their warranty).  If I wanted to exchange it, I needed to go back to where I bought it.That worked without a hitch, and the new one worked for a few days as well.  Finally, it stopped connecting altogether as well (the cute error message says \"Uh Oh\" and \"failed to authenticate\" but offers no helpful steps to redress the issue.  The most frustrating part was the lack of good troubleshooting documentation online.  But it's also clear that the Chromecast product team simply doesn't have an adequate QA matrix of devices and routers, and Google doesn't feel the need to invest in a top flight customer service department to handle a $35 device.  As Netflix spun off Roku, it seems Google can't get rid of Chromecast fast enough....and it's too bad.  This has the potential to revolutionize the third screen experience.  I see a future where people have chromecast in their car and in the home, and even, perhaps, in the hotel room.  But, for now, it's just a beta, and you're the guinea pig.I would recommend that anyone who buys this product keep the receipt.  If it doesn't work, exchange it...for an apple TV or Roku.", "verified": true, "helpfulness": "0/0", "author": "Nola Caine"}, {"rating": 5.0, "review": "This device works so well ... the newest version comes with some more apps -  wish it could stream directly from browser -  High quality and easy installation .  need a strong wifi connection to make it work to its potential -  I have three of them!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I was looking for a way to get my older Toshiba plasma connected to the internet and this worked seamlessly. Plays well with Uverse.  We use primarily Windows and Android and have had no issues with connectivity, sluggishness or stuttering. Wish there were more apps available. Google Play Music works great in direct HD mode.", "verified": true, "helpfulness": "0/0", "author": "Britishmechanic"}, {"rating": 5.0, "review": "I love this thing it works really well. I have a few issues with Netflix casting from my computer and haven't been able to figure that out but it works with everything else and works great on my iphone.", "verified": true, "helpfulness": "0/0", "author": "Brittany Potrawski"}]