[{"rating": 2.0, "review": "This would be a great product... except that it keeps freezing.  It freezes with HD and standard definition movies and tv shows that I stream to it from my computer.  I use a fairly fast Windows 7 laptop with an i5 processor, and I have an incoming 12mbps from AT&T; Uverse, so unless the Uverse router is the bottleneck, then the Chromecast is the problem.", "verified": false, "helpfulness": "0/0", "author": "Robert"}, {"rating": 3.0, "review": "It was OK but I could have gotten it locally for less.  But I did not have to go to a store to get it.", "verified": true, "helpfulness": "0/0", "author": "nancy"}, {"rating": 4.0, "review": "This has proven to be more useful than I thought it would be when I got it.  Mainly because my Roku box doesn't do YouTube.  You can stream net content and photos from your phone to your TV.", "verified": true, "helpfulness": "0/0", "author": "Mark Bentz"}, {"rating": 5.0, "review": "Great product that's easy to use and set up!  I plugged it in and it way ready to go; no instructions really needed", "verified": true, "helpfulness": "0/0", "author": "Scott Benedict"}, {"rating": 5.0, "review": "If you have more than one TV, then you should buy one for each. This device is a game changer.", "verified": true, "helpfulness": "0/0", "author": "Joseph Frawley"}, {"rating": 5.0, "review": "love it!!!!! even my 3yr old can work it from her play phone! may order more of them for other rooms!", "verified": true, "helpfulness": "0/0", "author": "rissa bates"}, {"rating": 4.0, "review": "This device has about the easiest and quickest installation procedure of any computer product I've encountered.  Unfortunately, I was never successful in getting it to work. In theory that should mean a one star rating. However, the lovely lady on the Google help line strove mightily for over an hour to resolve the problem which we both eventually concluded was due to an incompatibility with my router which, in fairness, is not listed on Google's list of known compatible equipment. Often, people at the other end of a help line (if you can even find a help line) are obviously reading from scripts, too often with an accent hard to decipher while giving the impression they want nothing more than to hurry you off the phone.  This person was was unfailingly polite, very knowledgeable, and clearly wanted to succeed in resolving my problem rather than hurrying to the next call to make some sort of quota.  And she was in Seattle, if you get my drift. That a company would devote such resources to trying to get a $35 device to work is more than impressive, it's unheard of.  So they get 4 stars for the effort with one subtracted for the unfortunate failure.  However, the vast majority of 5 star reviews for this device tell me my experience was an anomaly and that most folks will probably have an easy installation. The painless Amazon return policy I encountered after abandoning my attempts to install the Chromecast also make trying out this product a good risk.", "verified": true, "helpfulness": "0/0", "author": "S. Horn"}, {"rating": 5.0, "review": "Item functioned exactly as adverized. Easy and most enjoyable to use.  Can't say that for Windows/Outlook-absolutely terrible. Windows 8 is not compatible with verizon and the crack(ed) Outlook Team wants the User to contact Verizon and have them change the Verizon Protocol. LOL", "verified": true, "helpfulness": "0/0", "author": "Didymus T. Tocs \"Didy\""}, {"rating": 4.0, "review": "Not a lot of apps for it yet, but there are some good ones and the list is growing.  Make sure your WiFi network devices can 'see' each other, or this thing isn't going to work with your tablet/phone.  Very good video quality on Netflix app and Chrome browser mirroring.  I hope they add 'full screen' PC mirroring at some point.", "verified": true, "helpfulness": "0/0", "author": "MDaytona"}, {"rating": 2.0, "review": "It can not cast videos on TABS. Keep complaining and WIFI. Tried resetting many times. But no help. Our Roku, Playstation or laptop do not have issues with WIFI. Sometime complains about the home network. Did not want to waste my time.", "verified": true, "helpfulness": "0/0", "author": "Manu"}]