[{"rating": 4.0, "review": "Chromecast was easy to setup and works well.  It doesn't interfere with the TV.  It worked with the U tube videos that I played and works very smoothly with Netflix.  It is a shame that it will not play Amazon movies which is why I did not give it five stars.  If you simply want to watch Netflix movies with no hassle, this device is perfect!", "verified": true, "helpfulness": "1/1", "author": "Donna L. Ianni \"Donna\""}, {"rating": 1.0, "review": "Received my Chromecast almost a full week after placing my order, even though I selected 2 day shipping at check out. After finally receiving the product, I set it up and after 3 seconds of being plugged in and powered on, my TV screen went black, with vertical black lines across the screen. After calling Google and going through the troubleshooting methods, I now have to return the Chromecast to Google and wait another 3-5 days to get another one. I am EXTREMELY disappointed with the performance of both Amazon and Google in regards to the shipping and performance of the product. Maybe once I get a working Chromecast I can write a better review.", "verified": true, "helpfulness": "1/8", "author": "Christopher LaPointe"}, {"rating": 4.0, "review": "very easy to connect and use.  Once google come up with more apps that can be casted i will come back and do another review.", "verified": true, "helpfulness": "1/1", "author": "pc \"applepenney\""}, {"rating": 5.0, "review": "I love being able to control from my phone!  I can't wait for more options for the Chromecast!  I love being able to play my playlist through my surround sound!", "verified": true, "helpfulness": "1/1", "author": "Misty \"Misty\""}, {"rating": 5.0, "review": "This gadget has really won me over, especially considering the price!Also THIS WEEK, Google has announced support for a number of additional apps including Avia.  I am new to Avia, but last night I used Avia on my Samsung Galaxy Tablet to send all sorts of video files from my NAS connected WD My Book Hard drive to the Chromecast (the WD drive has a twonky media server on it).  The functionality of sending my own media of videos or whatever via an app to Chromecast from a HDrive of my own is the main thing I felt was missing, and now its not!  In my tests the Chromecast was able to handle most video codecs (but not all) and I could play most anything.  In our bedroom we have the WDTV Live streaming box which can REALLY play all codecs pretty much, and the Avia app works with that too, but for the living room Avia plus chromecast is working great for most things, including locally stored music and pictures.I have a subscription to Google's music service and that was seamless to use.  Netflix, Hulu Plus, YouTube, all of them the interface was very slick with no hiccups with Chromecast and especially on youtube it is so much easier to search for things on my phone or tablet and then send to Chromecast than on the PS3 or other device.Love how you can turn the phone app off and keep using your phone or tablet to do other things once Chromecast is running (works with Avia too).  On my SG3's lock screen Hulu Plus and Netflix have controls that pop up so I can pause things quickly without fully returning to the app if my phone was off.I miss some of Hulu and Netflix's autoplay features (automatically playing next ep of a show) - this is not yet a feature on Chromecast, but if I really want those, or for everyone in the room to see the Netflix interface to make a choice as a group, I just use the PS3 like I used to.", "verified": true, "helpfulness": "1/1", "author": "CMad \"tc5998\""}, {"rating": 5.0, "review": "This is an amazing dongle to have if you have a lot of roommates like I do. Everyone can easily install the app onto their phones and tablets, and then effortlessly push youtube or netflix videos to the TV.", "verified": true, "helpfulness": "1/1", "author": "Harry Blackwood"}, {"rating": 5.0, "review": "Gadget of the year 2013!  I have some issues with the way it handles Netflix when my phone is locked but that is a minor annoyance.  It is easy to set up and the quality of the picture is great.  Perfect for any non-smart TVs.", "verified": true, "helpfulness": "1/1", "author": "icepick"}, {"rating": 3.0, "review": "I tested this out recently. Pros: I like the size and it work fine. It does not work with Amazon Prime video streaming service and some other online streaming services.However for the price, I thought I give it a try.I have a Netgear Push to TV adapter better. (Word of caution your laptop needs to have intel WiDi = \"Wireless Display\" capability and not all laptops have this capability = so if you have an AMD processor it won't work). However if you do have Intel Widl capability, then the Netgear Push to TV adapter is better fit.). .", "verified": true, "helpfulness": "0/1", "author": "dtducla \"bruintraveller\""}, {"rating": 5.0, "review": "This does exactly what it says it does.  I am able to use my tablet and yet watch it on my tv.  I like to play games or watch movies on my tablet and now I can do that and watch it on my tv.  I can pull my pictures up and show them to everyone on my tv at one time.  I was not sure if it was going to do what it said it would, I don't know technology so I am not sure how it works, but it does.", "verified": true, "helpfulness": "1/2", "author": "Debra Chalmers"}, {"rating": 3.0, "review": "It has potential, but for now it's 3 star worthy.  I purchased it expecting Google to allow new apps for it, but they haven't done anything since it's release.  It's getting demoted to the TV in our exercise room, while I try a Roku box.  If they will ever add more apps to Chromecast it will be better.On another note, setup was a snap and I haven't had any trouble with it.", "verified": true, "helpfulness": "1/1", "author": "Joe G"}]