[{"rating": 1.0, "review": "I have never wasted so much time trying to play a video from my pc. Sure it's kind of a cool gadget if all you do is watch Netflix and listen to music but for the people that enjoy watching there own movies on their pc, which are not in a MP4 format you are just wasting your time because the chromecast does not all that to happen.", "verified": true, "helpfulness": "1/1", "author": "Carter"}, {"rating": 1.0, "review": "I  use and love my Apple TV but I'm sitting with my sister trying to watch YouTube on her chrome cast. Disaster. Pauses or quits every 5 min or so. My Apple TV is on the same cable and wifi service in the house do we decided it couldn't be anything but the chromecast. I expect she will take it back.", "verified": false, "helpfulness": "1/1", "author": "A. Martin \"Amart\""}, {"rating": 5.0, "review": "No more wires, easy casting of pretty much all videos from your laptop to TV. Super glad we bought this!", "verified": true, "helpfulness": "0/0", "author": "Nagalakshmi V"}, {"rating": 1.0, "review": "If I could give this piece of tech a 0 I would, this is a total piece of junk that I have wasted more hours than I could ever get back, trying to set this thing up. Do a search on the web about this device and read the disappointment of many people who cannot get this thing to run for there are many.The setup is straight forward, the way it appears, all the way until you need to join it to your WiFi. That is where the setup stops as this device is very finicky with what routers it will and will not work with. It does not matter if you have a 'big brand' router or not either, this piece of gear is very temperamental and you are very likely to end up pulling your hair out in frustration trying to get this device to communicate with your router only to end up out $30 for a device that does not work.The concept is great, the execution if incredibly flawed. If they can get this device to work, it would be a neat little device to have but they should offer refunds to those of us who are stuck with a device that I can only look upon as a lemon. Before you jump to conclusions that this is a great device because it's by Google, research the issues people are having with this thing as you will more than likely end up on the losing end with this device.If you are determined to get it, you can buy mine for $30 as it is in brand new condition but sadly it's beyond the 30 day return limit for Amazon otherwise it would be in the mail right now.", "verified": true, "helpfulness": "1/2", "author": "M. Fitzgerald"}, {"rating": 4.0, "review": "I wasn't sure if I should have bought the Google Chromecast or a Roku product, but after a lot of research I went with this and I have no regrets! It all depends on the person and what you're going to use it for. I love having easy access to a flat screen via my iphone with this product and I can easily take it with me on my flights when I am traveling or on a lay over from flying with the airlines! The only thing that bothers me sometimes is my wifi connection at home. My internet downstairs doesn't have the fastest nor best connection with the Chromecast that's connected to my T.V. in my bedroom upstairs. I think it's because I need to upgrade on my internet service, it's pretty slow in general with speed too! Nevertheless, I like this Google Chromecast for what it has to offer me and I already got my brother excited about purchasing one!", "verified": true, "helpfulness": "0/0", "author": "Deidre Marie"}, {"rating": 5.0, "review": "I was on the fence about this streamer. I tried another streamer form Lenovo and it was terrible so I was worried about buying this. However I am glad I finally gave in as it is amazing. There is zero lag streaming from my phone. The setup took about 15 minutes and was just a hair more complicated than I think the average person would like but it was fine for me. The only thing negative I can find is that initially I thought it got power from the HDMI port but you do need to plug it in to a power outlet via the supplied microusb cable/charger. Other than that it has been amazing and I only wish I bought it sooner!", "verified": true, "helpfulness": "0/0", "author": "E. Meza \"drunk monkey\""}, {"rating": 5.0, "review": "A breeze to set up!Picture quality is fantastic!I'm a big Google fan, but was wary of this product but I was wrong. It's definitely worth it!", "verified": true, "helpfulness": "0/0", "author": "Hattrix"}, {"rating": 5.0, "review": "I have a Roku and Apple TV but for the price of the Chromecast, it beats them both, it does exactly as advertised, the set up instructions are easy to follow, I had my Chromecast up and running in about ten minutes, and it performs flawlessly at 1080p, I only wish that Google would eventually add Red Box to it.", "verified": true, "helpfulness": "0/0", "author": "Carlos E. Ku"}, {"rating": 2.0, "review": "This would be a great product... except that it keeps freezing.  It freezes with HD and standard definition movies and tv shows that I stream to it from my computer.  I use a fairly fast Windows 7 laptop with an i5 processor, and I have an incoming 12mbps from AT&T; Uverse, so unless the Uverse router is the bottleneck, then the Chromecast is the problem.", "verified": false, "helpfulness": "0/0", "author": "Robert"}, {"rating": 3.0, "review": "It was OK but I could have gotten it locally for less.  But I did not have to go to a store to get it.", "verified": true, "helpfulness": "0/0", "author": "nancy"}]