[{"rating": 5.0, "review": "I really like it!", "verified": true, "helpfulness": "0/0", "author": "Donghyun Yun"}, {"rating": 5.0, "review": "Worked as it was advertised. However I did download a separate app to transmit my phone pics to tv screen. Now works well for all asked of it.", "verified": true, "helpfulness": "0/0", "author": "Jerilin M Gregouire"}, {"rating": 4.0, "review": "Google chrome cast is well worth it, that is of course if you have the good apps that go well with it. It's useful to those who don't have a smart tv but have Netflix, Pandora, and use YouTube. My personal downside is that my windows surface tablet is not compatible with Google Chromecast, but that's not why I rated the item a four star. Connecting an electronic device can be kinda complicated to those who aren't familiar with electronic devices. I struggled to connect my phone to my Chromecast because I wasn't familiar with the device, and there isn't any instruction manuals step by step to connect other then the three steps on the box when you open it. Over all it's a good item to own when or if traveling or have in the house.", "verified": true, "helpfulness": "0/0", "author": "Diego"}, {"rating": 5.0, "review": "Got it in 2 days so far so good", "verified": true, "helpfulness": "0/0", "author": "Salena"}, {"rating": 2.0, "review": "All the apps I use I can find on my very basic smart television, I have the Chromecast plugged in but hardly use it.  I find it almost useless now.", "verified": false, "helpfulness": "0/0", "author": "L. Calderon \"The One.\""}, {"rating": 5.0, "review": "GOOD ,", "verified": true, "helpfulness": "0/0", "author": "HenryFlex \"hungdieu\""}, {"rating": 5.0, "review": "Awesome", "verified": true, "helpfulness": "0/0", "author": "Gal Amado"}, {"rating": 1.0, "review": "Absolute piece of crap.  Always freezes up and won't stop playing even after you close app + turn phone off + anything humanly possible besides ripping it out from your TV.  Be a better person than me and buy a ROKU.", "verified": true, "helpfulness": "0/0", "author": "Timothy Lederman"}, {"rating": 4.0, "review": "Great and easy setup", "verified": true, "helpfulness": "1/1", "author": "Rjs \"Rjs\""}, {"rating": 3.0, "review": "I thought this going to be like ROKU or at least it would allow me to use the APPS on my phone that I downloaded thru Google Playstore. It isnt I can only use NETFLIX, YOU TUBE AND HULU with it I assumed that I would be able to use PANDORA or FACEBOOK you have to go thru extra steps to get your FACEBOOK to work with it. ROKU has a Streaming Media Player just like this one that is much better and offers you a better variety AMAZON MEDIA PLAYER  included", "verified": true, "helpfulness": "0/0", "author": "Robert Taylor"}]