[{"rating": 5.0, "review": "a few minutes set up & away I went, it's great", "verified": true, "helpfulness": "0/0", "author": "Michael A. Ferrero"}, {"rating": 5.0, "review": "My second one. Awesome", "verified": true, "helpfulness": "0/0", "author": "Keith Hare"}, {"rating": 5.0, "review": "Looks to offer much more variety than NetFlex. Much better streaming.  1080p format. Time will tell, but so far so good.", "verified": true, "helpfulness": "0/0", "author": "JAMES RAY"}, {"rating": 5.0, "review": "Love it so far. Easy install, no issues.", "verified": true, "helpfulness": "0/0", "author": "Jon Sigl"}, {"rating": 2.0, "review": "80% of the shows I want to watch I have to pay for.  When I signed up for the  Prime membership I thought I would have more access to tv shows and movies.  that's only about 20% true.", "verified": true, "helpfulness": "1/4", "author": "Manny Nevarez"}, {"rating": 5.0, "review": "After Xmas we'll have to plug in. I feel sure we will love it.", "verified": true, "helpfulness": "0/1", "author": "Deborah Bell-Schwartz"}, {"rating": 2.0, "review": "Was disappointed for you have to purchase many of the shows in order to watch them, very few are free.  Wished at least that it would allow internet searches for channel websites to at least view them on their own website such as Discovery Channel.", "verified": true, "helpfulness": "0/2", "author": "Nicole Jackson"}, {"rating": 5.0, "review": "I'm obssesed with my Fire TV!!!!! Can't stop watching movies and series on High Definition, I loooove it!!!!! Me and my husband have become addicted to the XMBC app.", "verified": true, "helpfulness": "0/0", "author": "Ana Indhira"}, {"rating": 5.0, "review": "Love it!  Great product.  I need the stick now, as I would like it to be more portable, but did bring this  to Hawaii to attach to a tv without cable!  It is pretty small on it's own!  And I just now realized that you can download Netflix and HBO apps, etc to get your content on your \"not-smart\" tv.  lolThe remote has a voice command, and you can change the channel or search for something from another room with it!", "verified": true, "helpfulness": "0/0", "author": "Cat Maru"}, {"rating": 5.0, "review": "We just LOVE it I am recommending this to everyone.  The system is easy and what we will save over the years gives us so much extra money to spend on other things.", "verified": true, "helpfulness": "0/0", "author": "Susan Brown"}]