[{"rating": 5.0, "review": "nothing is wrong with this deal !", "verified": true, "helpfulness": "0/0", "author": "netlover"}, {"rating": 5.0, "review": "thanks", "verified": true, "helpfulness": "0/0", "author": "mohmmad"}, {"rating": 5.0, "review": "Wasn't sure how useful this would be at first, but with frequent updates to Chrome and Chromecast, it makes watching different media so easy! Chrome browser mirror has improved a ton, so that I can watch Hulu or ABCgo videos in a high quality screencast with no problem. So inexpensive and so easy! The other day we used it with a game app called \"CardCast\" to play Cards Against Humanity - fun party game with no clean up. I can only imagine this will become better as it continues to get improved.", "verified": true, "helpfulness": "0/0", "author": "Amanda"}, {"rating": 4.0, "review": "No ability to screencast my tab except for YT It's okay, for$22 can't complain..", "verified": true, "helpfulness": "1/1", "author": "Herb Salls"}, {"rating": 5.0, "review": "Great Product", "verified": true, "helpfulness": "0/0", "author": "hokie fan"}, {"rating": 2.0, "review": "Item works as described but the interaction with the device is nos good, no interface on screen is confusing.", "verified": true, "helpfulness": "0/0", "author": "Noldan Briceño Gonzalez \"nolbrigo\""}, {"rating": 4.0, "review": "For $35, this is an amazing device. Works with Android devices, iDevices and computers running Chrome.  The only features that would make this a killer is a sleep option and some sort of built in web browser to hook it up to hotel WiFi.", "verified": true, "helpfulness": "0/0", "author": "Michael"}, {"rating": 5.0, "review": "Awesome device! This is my second one.", "verified": true, "helpfulness": "0/0", "author": "blacksheep"}, {"rating": 2.0, "review": "My wifi network has never been a problem before, but chromecast can barely operate, especially when using Hulu+ or when casting from a tab.", "verified": true, "helpfulness": "0/0", "author": "James Mickley"}, {"rating": 4.0, "review": "I've had a Chromecast since it was released back in 2013.  I just recently bought a second TV so I picked up a second device to go with it.  Overall, I really do love it.  It makes it easy to watch Netflix, Youtube, WatchESPN, and a variety of other apps on TV using either an Android or iOS device.  I was really excited when Plex support came to the Chromecast.  Unfortunately, that is what causes me to give this four instead of five stars.When streaming with Plex (and if I'm being honest, sometimes Netflix), it will occassionally lose connectivity with the controlling device, resulting in the inability to stop or pause what you're watching.  When this happens you pretty much have to turn off the TV and wait a few seconds for the Chromecast to power down, then turn it back on and re-cast from the phone.Overall it's a great little device, especially if you don't want to deal with another remote like the Roku Stick or Fire Stick require.  I just wish it functioned at its best at all times.", "verified": true, "helpfulness": "0/0", "author": "RM"}]