[{"rating": 4.0, "review": "Gift.  Recipient likes it.", "verified": true, "helpfulness": "0/1", "author": "Charles B."}, {"rating": 1.0, "review": "Only compatible with certain routers. Nowhere does it indicate that. A lesson learned. I'll addit to my collection of useless POS. Wish I could give it zero stars.", "verified": true, "helpfulness": "1/1", "author": "Rocketrider"}, {"rating": 5.0, "review": "I like it but it is a bit frustrating some times on the installation, besides that it works.", "verified": true, "helpfulness": "0/0", "author": "Saad Al-Otaibi"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/1", "author": "David Salas"}, {"rating": 1.0, "review": "These work in the beginning but now don't charge at all. I bought 6 and after a little over a month only 1 of them works.", "verified": true, "helpfulness": "0/4", "author": "Jaylen Gilmore"}, {"rating": 3.0, "review": "It's really hard to set it up. Too complicated and sometimes it doesn't even work.", "verified": true, "helpfulness": "0/0", "author": "manny"}, {"rating": 5.0, "review": "Streams like a dream. I've noticed the chromecast tends to disconnect from my phone when I lock my phone, or start fiddling with my phone while streaming (a couple of things you're supposed to be able to do), but it's not much of an issue as it's easy to reconnect the cast to my phone (open the app you're streaming from and tap the cast button on the top right to reconnect, won't disturb stream at all).", "verified": true, "helpfulness": "0/0", "author": "Jesus F. Serrano"}, {"rating": 5.0, "review": "Works great. I have them on all my TVs at home.", "verified": true, "helpfulness": "0/0", "author": "MG"}, {"rating": 4.0, "review": "Item arrived in perfect condition, I am very satisfied with the purchase. is what is described in the purchase, thanks", "verified": true, "helpfulness": "0/0", "author": "luis asdrubal"}, {"rating": 5.0, "review": "I love my Chromecast. I use this all the time when I am in a different room and want to show my wife something in the living room. Works great and set up is a breeze. Takes about 5 minutes to set up plus time to download any updates that it needs.I'm adding a bit more information in my review since I've seen a lot of questions out there.First the Chromecast doesn't need to be charged as it doesn't run on batteries. There is a micro USB port on the side of the unit, opposite the HDMI, that you plug in a USB cable to (included). This then plugs in to a USB port on your TV. If your TV doesn't have a USB port, or if the port is being used by something else no worries because you can connect the USB to a USB to wall outlet adapter and plug it into a standard outlet.The Chromecast does not need to have applications installed on your TV or on the Chromecast itself to work. You can cast what is on your laptop, phone, or tablet to the Chromecast from supported apps on your device.", "verified": true, "helpfulness": "0/0", "author": "Joe"}]