[{"rating": 1.0, "review": "Steaming is laggy and Chromecast causes my network to crash when attempting to stream from a browser window.  Not worth it.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "This is deceiving.  It does not work like an iPhone with the Apple TV.  The app on your android phone has to be able to work with the chromcast in order to mirror your android phone on the tv. Many apps on an android phone don't work with it. My son has a Sony Xperia Z2. He has a particular movie app whereby he gets to see many movies. We thought the chromcast would have been able to allow us to see the movie from the phone, on our tv. No. You can see you tube stuff and other Google approved stuff. Truly not what I thought it would do. Nowhere does it say that it streams particular apps. Bleh!", "verified": false, "helpfulness": "0/3", "author": "Nirmala Dindial \"Amazon shopper maniac\""}, {"rating": 5.0, "review": "For the price, this can't be beat.  It's really easy to set up, seriously, anyone can do this.  A lot of the apps I'm already using (HBO GO, Pandora, etc.) are supported by Chromecast.  It works really well with YouTube and GooglePlay, but if you try to play Amazon Instant Video just through the Chrome plug-in, it's pretty choppy.  That would be my only con.  Which would be great if that was fixed up as I am an Amazon Prime member!", "verified": true, "helpfulness": "0/0", "author": "Book Sake \"Family of Reviewers\""}, {"rating": 5.0, "review": "Wish Amazon Prime would make it compatible, but I know they are trying to compete with this, and that's why they won't. Chromecast is pretty much amazing! I use it for everything from watching my TV shows (via Hulu, Watch ESPN, etc...) to playing Youtube videos.If you don't have a Smart TV, this is the next best thing. Awesome. Oh, and I screen share my computer for company meetings at work.", "verified": false, "helpfulness": "0/0", "author": "Felix Felix Felix"}, {"rating": 5.0, "review": "Awesome does everything it said it would", "verified": true, "helpfulness": "0/0", "author": "michael mcgrath"}, {"rating": 5.0, "review": "Great gift.", "verified": true, "helpfulness": "0/0", "author": "Connie Westbrook"}, {"rating": 5.0, "review": "Excelente", "verified": true, "helpfulness": "0/0", "author": "silvio Gutiérrez"}, {"rating": 5.0, "review": "Very convenient device to stream mainstream options such as netflix and youtube. Hopefully with more apps in the future, we can bring entire desktop streaming to chromecast.", "verified": true, "helpfulness": "0/0", "author": "Wansheng Zhu"}, {"rating": 5.0, "review": "While I wouldn't use it often, for the price it's nice having the option to throw video from any PC to the TV.", "verified": true, "helpfulness": "0/0", "author": "John S. Holzer"}, {"rating": 4.0, "review": "perfect", "verified": true, "helpfulness": "0/0", "author": "poorworld \"PR\""}]