[{"rating": 5.0, "review": "Chromecast... It really whips the llama's a$$ (and costs a FRACTION of @ppl3TV and most other streaming players!) As long as the folks at G keep adding and updating apps, I'll be happy.", "verified": true, "helpfulness": "0/0", "author": "James Wiora"}, {"rating": 5.0, "review": "I ordered my first one though Google. But My 2nd one was ordered right here. With free 2 day shipping why would I not. I love this little guy. Makes my non Smart TV a little bit smarter. Love to be able to stream pretty much anything to the TV wirelessly. You can actually run local videos through your browser and Volla!", "verified": true, "helpfulness": "0/0", "author": "OneTw0 \"M Mehrizi\""}, {"rating": 5.0, "review": "Easy as can be to install. Plug it in, follow the prompts on your TV, tell it how to connect to wifi, install the app, and you are done. Streamed Netflix, Google Play, and Youtube within minutes of unpacking. Clearly, this is the way to go if you are in the Google/Android (or Apple) universe. Worked with both my Droid and my dad's iPhone. I suppose if you are a die-hard Apple fan, Apple TV does the same thing but at 3 times the cost, why?", "verified": true, "helpfulness": "0/0", "author": "Psi 5"}, {"rating": 5.0, "review": "Has turned my old flat screen into a smart TV. However I am having trouble connecting it so sound comes out through my home theatre set up. Sound coming out from TV speakers is fine. Have yet to use it to mirror playing games on my phone. Don't know if that will work.", "verified": true, "helpfulness": "0/0", "author": "Nnanna Ezuma-Ngwu"}, {"rating": 4.0, "review": "Easy to set up and  use. Cheap item for a nice feature. Netflix and YouTube play well on it, yes.", "verified": true, "helpfulness": "1/1", "author": "barbara loiselle"}, {"rating": 4.0, "review": "I got this on a lark to see what it was.  It works.  Not a big hassle to set up and what makes it nice is that I can unplug from one TV and just plug it into another.", "verified": true, "helpfulness": "0/0", "author": "TravelNut101"}, {"rating": 5.0, "review": "Arrived on time, Easy to use, Price is right and above all it allow us to project web content on TV.  Love this product.Good Job Goo Goo.", "verified": true, "helpfulness": "0/0", "author": "Faisal Hussain"}, {"rating": 5.0, "review": "great product. I only wish it would work with iOS. I would like to see more apps about moving things from devices /pcs to TV", "verified": true, "helpfulness": "0/0", "author": "Paul V Colombo"}, {"rating": 5.0, "review": "This is a great idea and it works, waiting for more apps to use on my tv. I like it and plan to purchase for family and friends who have wifi compatibility in their homes.", "verified": true, "helpfulness": "0/0", "author": "Jacqueline Brock"}, {"rating": 5.0, "review": "This works great as a present but watch your internet usage as most companies track the number of gigabits you use.", "verified": true, "helpfulness": "0/0", "author": "Nick H."}]