[{"rating": 3.0, "review": "If you have Verizon FiOS you might want to check and make sure your equipment supports the required protocols. I did get it to work at the office and is pretty slick little toy.", "verified": true, "helpfulness": "0/0", "author": "shopper"}, {"rating": 5.0, "review": "If you're big into netflix, but don't own a game console, THIS IS FOR YOU!!!  Streams with great quality, easy to install and control. With a little technical know how you can even stream your own library of videos from your computer to your tv. Home run for the price!! Requires PERSONAL wifi.", "verified": true, "helpfulness": "0/0", "author": "Jaunell"}, {"rating": 5.0, "review": "Works flawlessly was easy to setup. I love it and suggest anyone buy one! Simply a great item Thanks Chromecast meow!", "verified": true, "helpfulness": "1/1", "author": "Ransom"}, {"rating": 5.0, "review": "I have used it on different TV's and with You Tube and Net Flicks. Works pretty slick. Wish it would work with more services but I suppose that more will come on board eventually.", "verified": true, "helpfulness": "0/0", "author": "Tim Thometz"}, {"rating": 5.0, "review": "Best $35 i have ever spent! Effectively turn your old (HDMI equipped) TV into a smart TV! Great idea, and works as advertised, I can't recommend it enough!", "verified": true, "helpfulness": "0/0", "author": "Steve McMahon"}, {"rating": 4.0, "review": "I have to say I won this and didn't purchase the item.  My TV sits about 8 feet from my wireless router.  My laptop is about 5 feet away.  First installation, it knocked my wireless router off and took over as the main router for everything.  Took about 3 minutes to reset that and had everyone reconnect to the network.  Easy fix, but it was pain not knowing why I suddenly had not wifi in the house.The only thing I can stream is Youtube.  I tried streaming from my laptop and it runs great the fisrt 2 minutes, then the screen freezes but the audio continues to go along as if nothing is wrong.  I've tried to fix this but I can't seem to make it work with streaming videos from my laptop.  The upside of streaming Youtube from my S4 is that I can create a play list and leave it alone or add new videos.  This works great for thinks like Nerd Machine panel interviews that run an hour long.  Once in a while it will drop the network connection.I have a roku plugged into my tv, plus an xbox, and HD attentna.  I have no problems with my roku connection and can stream movies from amazon prime no problem, netflix no problem.  I've read some reviews that says the roku box can cause interference, but the two are not next to each other and the roku is off when I'm using the Chromecast.  I'll try disconnecting the roku this weekend, if that's the cause, it will be disappointing because the roku is used more than the chromecast.Finally got it working and loving it.  I don't use it much but it has been useful.", "verified": false, "helpfulness": "0/0", "author": "twister411 \"twister411\""}, {"rating": 4.0, "review": "Great affordable way to watch netflix and Google Play with friends. I only wish that google would continue to roll out support for the rest of its applications, (media stored in drive, etc). Excited for Pandora Radio and other third party clients to begin using the hardware. Super easy to use and much cheaper than the alternatives.", "verified": true, "helpfulness": "0/0", "author": "Barry Travis"}, {"rating": 4.0, "review": "This is a great gadget - especially for $35. Would highly recommend to anyone who does not have WiFi enabled devise connected to their TV.Only complaint I have is that when I used the USB port as the source of power (on my Sharp Aquos TV), the pictures often got fuzzy.  It did not happen all the time, but it was annoying enough, that I used the provided power adapter instead.  Since then I have had no problems.", "verified": true, "helpfulness": "0/0", "author": "Kulla Nair"}, {"rating": 4.0, "review": "Yes, I like this product. One thing I don't know why I have to try it off if I am not using it. Or, it will not talk to my WiFi after.", "verified": true, "helpfulness": "0/0", "author": "Henry Chao"}, {"rating": 4.0, "review": "Chromecast is a great tool to broadcast HDMI wirelessly. It would have a nice 5 stars if they would add more compatible apps.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Eberly"}]