[{"rating": 5.0, "review": "I'm 21 years old and Love the chromecastI had it for a little over a day now. I got to say I love using YouTube and Netflix on this device. Before I would have to connect my chromebook to my Monitor just to see YouTube in a bigger screen, and the quality was horrible.I can plug this Item into a computer monitor or even a TV (Any HDMI input device). It has clear HD (1080p) when watching Play Movies and Netflix, as well as HD YouTube videos.If you have your living room media center set up correctly you can watch your chromecast videos using your stereo! Surround sound for me!The only problem with it is that it has no password to use it. Anyone in your home (Siblings, parents) can hijack the feed and start a different video.I heard streaming a chrome tab requites a good PC, I've tried it on the Chromebook and it wasn't very good. So I will need to get my brother to bring his good laptop and try it.I WILL UPDATE WHEN AND WHERE NEEDED", "verified": false, "helpfulness": "4/5", "author": "Traceguy"}, {"rating": 4.0, "review": "This is a pretty neat little device.  It's got a few quirks and hiccups, but that's what you get with a device that's still in beta.  Sounds like more apps are headed down the pipe soon so this will only get better.  Got it early enough to get the Netflix credit too!", "verified": true, "helpfulness": "0/1", "author": "Eric"}, {"rating": 5.0, "review": "The build quality is excellent. The whole installation and set up, including attaching the cables took less than five minutes. Just one recommendation: Even if you don't need the HDMI extender, you may want to still use it since it greatly improves the Wifi signal.", "verified": true, "helpfulness": "4/6", "author": "Amazon Customer \"FJ\""}, {"rating": 5.0, "review": "It is simple. And works. And quality is excellent. And I'm about to pick up another one for the bedroom. Honestly, even without the extra content that is coming, this device has changed how I watch TV - I can't stop sending content from my phone to the big screen even as I own 3 Roku devices. Another not-so-obvious advantage, related to the simplicity of the device, is that anybody can just break out their phone (be it iOS or Android), and just play YouTube vids or whatever else on your screen. I had a friend over the other day and he wanted to show me something on YouTube, and did just that! And yet another PLUS is the device's portability - take it on the road and watch stuff in a hotel (most hotels now have HDMI equipped TVs). I will be taking it with me on the road this weekend, actually. Just pick it up when it is back in stock.", "verified": true, "helpfulness": "0/0", "author": "Davor Devcic"}, {"rating": 5.0, "review": "I received this unit yesterday.  It works PERFECTLY with my Nexus 4 phone (who would have guessed).  It even works with my Kindle Fire HD 8.9\" on Netflix (perfect) and on Youtube (cannot signin so you have to search for what you want) and the Google Play would not work no matter how it is loaded.  The Kindle Fire HD had to be sideloaded with the Chromecast app and Youtube app but surprisingly it works very nicely.  Haven't tried it with chrome running on windows yet.Wish I could use it with my Amazon Prime.Well worth the price!***** Hulu+ *****I have just received an email from Hulu+ that their latest version now supports the chromecast... it does!  Works great!", "verified": true, "helpfulness": "0/0", "author": "R. MIller \"RJMiller\""}, {"rating": 5.0, "review": "Total setup time 2.5 minutes.I was blown away by how easily this thing was to setup.Performance: awesome.Previously I was using my PS3 for streaming both YouTube and NetFlix.  I would get horrible buffering on the PS3 and always assumed it was a limitation of my wifi network.The ChromeCast buffers for a second when I start a video up (if that)... and plays.... no interruption.  Just flawless. I truly was not expecting that.The power of this thing is really going to be demonstrated in the coming weeks and months when app developers jump on board (and they are).Already Pandora, Songza, HBO Go, Hulu, RedBox Instant, Vimeo are in the works and more to come I am sure (Amazon, I am looking at you!)Also a popular Android Developer has already created an app that will allow you to send videos/pictures/etc that are on your phone directly to the ChromeCast (Don't listen to Gruber when he says it isn't possible... He's wrong).  The app is not released at the time of this writing, but it shouldn't be long now.For $35 I am definitely looking to get more of these.", "verified": false, "helpfulness": "1/2", "author": "Dan B."}, {"rating": 4.0, "review": "I ordered the Chromecast direct from Google within an hour of the announcement, and have been pleased with the product thus far. It is somewhat easier setting up and watching Netflix videos with Chromecast and a tablet than with the Wii, although on (effectively) single-tasking devices such as my iPad, switching back to the Netflix app to hit pause is somewhat less convenient.Setup was fairly quick, although I was surprised that you must switch your laptop (or other setup device's) wifi to the Chromecast's ad hoc wifi network briefly during setup to configure it, then switch back. No instructions were given on how to do this, so non-technical people may want to read up on wifi network configuration for the device you'll use for initial setup before you begin, and ensure you are running no downloads or other activities on that device requiring continuous wifi access while setting up your Chromecast.Although Google doesn't mention support for Linux, replicating a Chromium tab from Ubuntu to my Chromecast was seamless and worked perfectly. I also launched and watched Youtube videos from Ubuntu with no problem. I haven't tested Netflix yet, but plan to do so shortly.Happily, my original iPad (stuck at iOS 5) also works with no issues.I have 3 different Wi-Fi SSIDs, by the way (one for the cable modem, a separate router, and then a range extender), and devices controlling the Chromecast must be on the same SSID or wired to the device hosting the SSID to which the Chromecast is connected to control it. This won't affect many people, but it was puzzling at first when some devices \"saw\" the Chromecast and others didn't.Overall, despite the current rather limited video service support and slightly more complex than expected setup, I think Chromecast is a bargain and am pleased to have added it to our system.", "verified": true, "helpfulness": "5/6", "author": "George F. Rice \"free software fan\""}, {"rating": 5.0, "review": "At first when I saw that the tab cast was still in beta I was very skeptical that I could watch content with the tab cast but when I used it it work perfect!. Overall it's worth $35", "verified": false, "helpfulness": "0/0", "author": "Rafael"}, {"rating": 5.0, "review": "It looks like there is no ads shown if I play the video with Chromecast.It is a good buy.", "verified": true, "helpfulness": "2/4", "author": "NON"}, {"rating": 5.0, "review": "Works really well with Netflix and YouTube. All I need is Hulu support and that would cover 100% of my use case.I was particularly pleased to find that YouTube videos look so great when compared to how YouTube videos looked on my TV via Xbox 360. For some reason the Xbox wouldn't show the best quality image on the YouTube app. That's definitely not a problem with the Chromecast.The Beta feature of streaming video from your PC Chrome browser is a mixed bag. Trying to stream from my 5 yr old laptop, the video was stuttering and audio sync was way off by a few seconds. When I tried from my desktop it worked way better. I was shocked to see the video looked excellent and crisp, but audio sync was just every so slightly off still.Now I was trying this at the 720 P High setting. On my laptop, when I reduced it to 720P Low bit rate and 480p bitrate, it worked much better but my laptop experience was still crappy. I did not try to stream using the low bit rate 720p from my desktop but I'm pretty sure that would probably have worked great and still looked quite acceptable.So please note that there definitely is a difference in how well the Beta feature of PC streaming will work depending on how powerful your computer is. If you have an old laptop or desktop, you may as well forget about that feature unless you choose the 480p setting.I'm quite certain that if your computers are also placed far away from your wireless router and don't get the best signal, then you will probably also have a subpar experience.But I repeat, that feature is still in Beta, which means its still undergoing refinement and testing even though it is a public beta. Don't buy the Chrome Cast device just for the streaming feature unless you have an excellent, newer, speedy computer, with equally excellent internet connection between all of your devices.A HUGE CON!!! That everyone should know:I have 30 gigs of my own music that I uploaded to Google Music when the service first went live. It took me days to upload all that stuff and I've been using it now without issues since the Google Music service began. The sticking point is that when you attempt to Chromecast your music that you uploaded yourself to Google, you get the following error message:\"Playback error\"\"Unable to play that song. Can't play a sideloaded song remotely.\"And then you have to click \"Done\" and that's it. Your songs simply will not play. I have to figure out what the policy is here and if there is any work around. But for now, I can't play any of my 30 gigs of music on Google Music via Chromecast which is really a feature I was looking forward too.", "verified": true, "helpfulness": "4/6", "author": "J. Morales \"deitiphobia\""}]