[{"rating": 3.0, "review": "This could be a 5 star product but it has a really limited use when it only works with a couple of apps.", "verified": true, "helpfulness": "0/1", "author": "Gustavo Antonio Farrar"}, {"rating": 3.0, "review": "It's really good for Netflix,  Pandora but there is not yet enough of a selection of apps.  I still haven't figured out how to surf the net, which to me seems like THE most basic and important use.  I certainly didn't know when I got chromecast, that I wouldn't be able to use it for the Internet", "verified": true, "helpfulness": "0/1", "author": "Cindy"}, {"rating": 3.0, "review": "For the apps that are out, this works well. Streaming from chrome browser - does not work well. When this has more apps and support streaming from Iphone or IPad it will be much more useful.", "verified": true, "helpfulness": "0/0", "author": "CincyTom"}, {"rating": 5.0, "review": "That was quick - plug in, quick set up and I was off.  Bought this for my husband who \"doesn't do buttons\", too much fiddling around and he gives up.  Wish it did have more channels, but these are the ones he watches most so no problem.  And itis so portable we take it on trips.", "verified": true, "helpfulness": "1/2", "author": "wutzers"}, {"rating": 4.0, "review": "I use this a lot with my kids who watch youtube, I think it will be better if they can also add the feature for viewing pictures and videos from your device", "verified": true, "helpfulness": "0/1", "author": "LuckyGuy"}, {"rating": 1.0, "review": "I bought this as a gift and wanted to make sure it worked, and how to use it before giving it to my Dad and stepmom.  I know that they don't like setting up wifi access points and always call geek squad when--if i am in town--I can do it for them.  So I tried to set this up, followed the instructions.  I am using an iphone 5, and it autoupdated, leaving my iphone app to lockup unable to do anything.  When it finished updating, I saw the nice landscape screen and was able to confirm the code that links the iphone app to the chromecast, but the step where it then links to my wifi did not work.  I can confirm by the everyday use of my wifi for the last 2 yrs that my wifi works for my iphone, so not sure why this conduit did not work.  The handoff from chromecast wifi to regular wifi failed again and again.  I turned every device in the mix completely off for a minute, hooked them up and still no dice.  Seems the update broke the device and I'll be sending it back to google.", "verified": true, "helpfulness": "1/2", "author": "hoarselord"}, {"rating": 5.0, "review": "Its small enough to hide behind the TV, Awesome enough to see HD Vids there.I will not duplicate what other users and reviewers have extensively written about, but i did find a minor snagWell, shouldnt really call it a snag, as it is an unexpected feature...When connecting to Youtube Chromecast compatible sites/applications the streaming is great.however, if you browse to any in-compatible site which does show videos on Flash, and you can stream it via chromecast, there were some significant audio sync issues.on the up side, it showed me that when you use chrome on desktop/laptop, you can not only cast the some additional flash players, but also the entire browser screen on TV.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This device should be in every home. It is so easy to use as long as you have a wireless internet connection in your home.I watch Netflix in my bedroom. My daughter watches youtube videos in her bedroom. We all watch videos on the bigscreen.", "verified": true, "helpfulness": "0/1", "author": "Todd H. Orr"}, {"rating": 5.0, "review": "Super cool device. Tried it out right away and in minutes we were casting you tube Netflix and hbo onto our tv", "verified": true, "helpfulness": "0/1", "author": "Ashley S."}, {"rating": 5.0, "review": "for $35 you cant beat this thing. works off of my computer or my phone. super easy to setup and will either mirror what im looking at in chrome browser or play direct with certain apps such as netflix or youtube while i continue to browse other things on my device. very convenient, very cool. Love that i can use it with HBO GO. And as usual amazon had it to me in a day or so no problem. I highly recommend this for the price.", "verified": true, "helpfulness": "0/1", "author": "Cmiller"}]