[{"rating": 4.0, "review": "The concept is nice but I wish it could project more information from a Nexus phone.  Maybe there is way to share more tablet/phone information to a bigger screen.", "verified": true, "helpfulness": "0/0", "author": "Jim Kendall"}, {"rating": 5.0, "review": "This is/was the coolest gadget in 2013 and no wonder why a must have for all geeks and TVs in the house. I also bought three as gifts, way cool to give someone special.", "verified": true, "helpfulness": "0/0", "author": "David J. Baxter"}, {"rating": 5.0, "review": "I have been using the product since last 2 months and find the product to be excellent device to play from your laptop / desktop / tablet / Smartphones.So far I rate this product at 5/5. I have not experienced any issues with the product.", "verified": true, "helpfulness": "0/0", "author": "SUDHAKAR SRIKANT"}, {"rating": 1.0, "review": "I guess I should have done more research before purchasing. Granted, I'm no technology whiz kid but I don't consider myself inept either. Google should stress the point that this thing is not compatible with a lot of cable company modem/ routers are NOT compatible. You will NOT just plug this into your tv and be able to watch what you want. I will try again one day but it got the best of me right out of the box. Best advice? Don't purchase unless you or a close friend are very savvy.", "verified": true, "helpfulness": "0/1", "author": "pjm"}, {"rating": 5.0, "review": "If i lived on my own i would have cable just a cromecast. It is that great. i need a few mords... blahhhh", "verified": true, "helpfulness": "0/0", "author": "Leo"}, {"rating": 5.0, "review": "I had a brain storm to buy each of my kids and their families this item as well as subscription to Netflix....it was a perfect present which they all loved and continue to love!  They were all delivered in a timely fashion...no complaints!", "verified": true, "helpfulness": "0/0", "author": "Fari Gummerson"}, {"rating": 4.0, "review": "Easy to set up and works great. I received Google Chrome and less than one hour later I was up a running.", "verified": true, "helpfulness": "0/0", "author": "Clint"}, {"rating": 5.0, "review": "For what it promises it works great!  The set up was very simple and I could not be happier.  The price is right!  I own two Apple TVs and got this one for basic use for my kids to watch Netflix.  If you want more features look into a Roku or WDTV.A+", "verified": false, "helpfulness": "1/1", "author": "Fullnelsonreilly \"fullnelsonreilly\""}, {"rating": 5.0, "review": "Amazing, very easy  to connect from mobile or iPad, and also your friends they can enjoy with you from there mobiles.It's really clear HDMI.", "verified": true, "helpfulness": "0/0", "author": "Tariq jaafar Almeseh"}, {"rating": 4.0, "review": "I love the chromecast and it's ease of setup.Great picture and sound quality.The app store is a little crowded with unnecessary apps.Wish apps for online news sites were available then I couldcancel my cable subscription.", "verified": true, "helpfulness": "0/0", "author": "elvis cho"}]