[{"rating": 5.0, "review": "I love my Amazon Fire TV and I love my subscription to Amazon Prime.  It's easy to connect, easy to use, and delivers what's promised.", "verified": true, "helpfulness": "0/0", "author": "Richard F. Steventon, Jr."}, {"rating": 2.0, "review": "The device lacks the ability to stream from my server. This is a big disappointment. It does what it is supposed to do, I guess I expected too much.", "verified": true, "helpfulness": "0/3", "author": "Amazon Customer \"pokemon lover\""}, {"rating": 5.0, "review": "A+", "verified": true, "helpfulness": "0/0", "author": "jws"}, {"rating": 5.0, "review": "The greatest, easiest to use device I've used!", "verified": true, "helpfulness": "0/0", "author": "BGRick"}, {"rating": 5.0, "review": "Very happy with this purchase. Got it for the bed room instead of paying for another cable box.", "verified": true, "helpfulness": "0/0", "author": "Patrick"}, {"rating": 4.0, "review": "I'm at the outer reaches of DSL and have at&t; router about 20ft. from the TV and I get pretty uninterrupted streaming with very little buffering. $100 for the unit and $99 per yr. for prime.", "verified": true, "helpfulness": "0/0", "author": "johnarnold \"john\""}, {"rating": 5.0, "review": "I love my Fire TV!! I would highly recommend it to anyone", "verified": true, "helpfulness": "0/0", "author": "Brenny"}, {"rating": 5.0, "review": "Really cool - better than I expected.", "verified": true, "helpfulness": "0/0", "author": "Norbert Vercammen"}, {"rating": 5.0, "review": "The device is everything I expected.  Very happy.", "verified": true, "helpfulness": "0/0", "author": "Charles D Gill Jr"}, {"rating": 2.0, "review": "I purchased this for my parents because I thought the voice search would be great tool for them.  The voice search is useless because it takes you directly to \"pay\" options even if it is available for free through other applications.  The other problem is apps like Showtime Anytime aren't available if you certain cable providers. I bought a Roku stick for my sister after the Fire TV experience with my parents and it was far superior in it's user experience and the availability of apps.  I strongly recommend the Roku Stick over the Fire TV.", "verified": true, "helpfulness": "0/2", "author": "Duke"}]