[{"rating": 5.0, "review": "My tv is far from my pcs and this was the exact solution for me. Now my tv got an improvement, all the content of internet in my tv with just a click. And my cellphone became my remote control.", "verified": true, "helpfulness": "0/0", "author": "alvaro guzman"}, {"rating": 1.0, "review": "netflix, no developer support (google released an update to not let you root / unlock the device), not much yet in terms of third party support.most of the people who bought it ended up taking the netflix and selling it for a profit.i'll stick to my roku... sold my chromecast.", "verified": false, "helpfulness": "1/6", "author": "Sammual \"nobodyspecial\""}, {"rating": 4.0, "review": "It took only five minutes to configure my tv, computer, and phone to the device. Being able to stream videos and movies while being able to check my email is great.", "verified": true, "helpfulness": "1/1", "author": "Alexander B. Thompson"}, {"rating": 4.0, "review": "The device does work as advertized but not on iPad and iPhone. I would like to see iit work from Chrome browser on all devices.", "verified": true, "helpfulness": "1/2", "author": "Habibullah Karim"}, {"rating": 3.0, "review": "It took about a month or 45 days to receive due to the popularity, but this was worth the wait.The unit is small, well built and has a USB cable and plug in charger. This requires a powered USB port on a TV.The unit required to be reset in order for me to set it up initially.The chromecast works well with my android and iOS phone. I am able to also broadcast my Chrome browser onto the TV. This mimics the Airplay functionality built into MAC OS X. The fluidity is a little rough and I'm not gonna say it's bad...but it's not as good as my Apple TV.Overall, for $35 this is an amazing value for a decent product. Google is at the front, pushing to expand it's product line and value for their services. I will keep this Chromecast in my suitcase for travel, enabling me to turn any hotel TV into a SMART TV with Netflix and (eventually) Hulu.", "verified": true, "helpfulness": "1/1", "author": "Meddle"}, {"rating": 4.0, "review": "It works really well but occasionally my devices have trouble discovering the chromecast over my network. Not really sure why this is happening.", "verified": true, "helpfulness": "0/0", "author": "William Bryce Angell"}, {"rating": 1.0, "review": "Update...here is my review...The MAIN reason it stinks is that I had to get up a few times because a YouTube video hung up for several mintues and the only way to continue was to unplug and re-plug the unit at which time it would play fine until it stalled again for as much as 15 minutes without self-starting.It also sort of stinks because the only free video is on YouTube.  You cannot watch any personal videos that are on on your tablet; it does not show the internet on the TV; You cannot search the Internet; You cannot play your own music. Google play has no free videos...zero.  You cannot connect a desktop pc; only certain phones and tablets and laptops.Suggestion: Get a Blu-Ray or other player that lets you do much more.Original:I now often DELETE many products that I order from Amazon because of the Georgia TAX.  Liberals don't realize that we pay shipping costs or pay for Prime at $79 a year.  And, used books and DVDs cost 3.99 shipping, so why are we punished by paying additional taxes?  Yeah, I know some are going to say 'tuff luck!'.  Go ahead, it is 'free speech' [unless you are a liberal; then only YOUR speech is free; not mine].  Anyway, it is my way of saying NO to taxing the internet [PS, we already pay huge taxes for internet and phone services].", "verified": false, "helpfulness": "2/21", "author": "hotchas \"hotchas\""}, {"rating": 3.0, "review": "This device was cheap and is pretty good for streaming Netflix to tv from my pc. It could use more apps for streaming other content but if you just want to use for Netflix and YouTube it is a good device.", "verified": true, "helpfulness": "0/0", "author": "Chris"}, {"rating": 4.0, "review": "This works great for streaming Netflix, Google Play and even web sites via Google Chrome but it does not support Amazon Instant Video via an app or through web site casting.  The site itself can be \"cast\" but the video content can not.  This is very disappointing as it was the main reason I wanted this device.  I'd rather not have both Netflix and Instant Video and this could be the reason I switch when my free trial ends.", "verified": true, "helpfulness": "2/2", "author": "archshrk"}, {"rating": 5.0, "review": "This little divice is so good. Its easy to use, very usefull and can use it in any TV with HDMI output.", "verified": true, "helpfulness": "0/0", "author": "Carlos Alberto Gonzalez Rodea"}]