[{"rating": 1.0, "review": "I bought this player mainly for plex sever only. However, only stereo mode is working.Disappointing product....I havent seen a new version update also.", "verified": true, "helpfulness": "1/4", "author": "Tiggar"}, {"rating": 4.0, "review": "I received this as a Christmas gift and am crazy about it! I love the voice search and the ease of use. My only real complaint, is that you have to go onto Amazon to find the 40,000 prime movies rather than looking on the fire tv. But it's not that big a deal. Well worth the money and it takes a minute to hook it up.", "verified": true, "helpfulness": "1/2", "author": "bosox fan"}, {"rating": 5.0, "review": "so far i am enjoying watching old movies and tv series.i love the remote that responds to voice commands !!!", "verified": true, "helpfulness": "0/0", "author": "hank"}, {"rating": 4.0, "review": "Four stars because I have used for only three weeks.  Thusfar, I am pleased with the Amazon Fire TV.  If there is a challenge to its use, I would say it is remembering which input signal is the Fire TV.  The inputs to my TV include a Blu-ray, tuner, cable TV set-top box (which I plan to discontinue).  The voice command is very, very helpful for my non-technical husband.  He speaks name of the movie he would like to see and up pops the title.  He knows enough to click okay.  Also, he likes the feature where similar movies are available.  On the other hand, I enjoy pushing buttons and exploring/surfing the libraries.We signed up with Netflix 30-day trial, but so far, mostly use my Amazon Prime video, expecially the free shows and movies.  Husband and I are fans of the old black and white mystery-thriller movies (we're silver-lining mature folks), so the Genre feature is really nice.Overall, it appears that Amazon Fire TV has a broader variety of selections, plus the other free streaming than the others.", "verified": true, "helpfulness": "0/0", "author": "SmallBizShopper \"SmallBizShopper\""}, {"rating": 5.0, "review": "Great variety in viewable programs.", "verified": true, "helpfulness": "0/0", "author": "pbsx"}, {"rating": 5.0, "review": "Easy to use. Plenty of choice.", "verified": true, "helpfulness": "0/0", "author": "Sandra Brigida"}, {"rating": 5.0, "review": "Easy setup.Easy to use.Entertaining.", "verified": true, "helpfulness": "0/0", "author": "Kurt Tauzel"}, {"rating": 5.0, "review": "Great product, especially for the price.", "verified": true, "helpfulness": "0/0", "author": "Joel Niekamp"}, {"rating": 2.0, "review": "I just got this today & am loving it!  The set up was nothing... seriously smooth & already registered to my amazon acct & super easy to access my netflix & hulu plus accts.  Off to a great start!!  & It' so amazing (Amazoning?) to be able to have remote control access to all this great stuff! Yeah!update_February 7th.  Hulu has stopped working on my Fire TV.. it's a big problem for me.  Prime/ Amazon stuff works great & Hulu worked great when I first set up my Fire TV, but now when you pick a show to watch in Hulu it just sits and tries to connect... AND NEVER CONNECTS TO HULU STUFF ANYMORE!!  I'M REALLY MAD.  IT'S MORE THAN AN INCONVENIENCE.  I'm contemplating a return... I'm just worried that it will get sent out to someone else with my Amazon Prime, Netflix & Hulu account info on it.  I was so happy with it at first.. now it's just not of much use.  I had a daily morning ritual of watching (Hulu)the daily show & a couple other things on my living room TV while getting b'fast..etc.  So now to do that I have to bring my laptop from my office down with me..the reason I got the fire TV was to eliminate this added morning step & make my morning flow easier...so, now since Fire TV won't play Hulu content I am back to my original routine & wasted $99 on the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 1.0, "review": "The Prime TV/Movie/Music selections fit most of our needs after about one months of trial, so we think it may be a good idea to get the Fire TV and watch them on large screen as well.  The unit arrived on time and in good shape. The navigation can be much better, but able to do what needed.  The catch is on the remote, it went through 2 new batteries (fresh from package bough last month with guaranteed won't lose battery power for 10 years) in 1.5 days with avg. 6 hours actual viewing time - continuous 6 hours same program, no channel changes. .Called Amazon to find solution today, had to went through 3 Amazon reps.  1st one is in Kindle Dep. handles kindle refund swiftly (had to return Kindle Voyage received last week due to flashing and page rendering issue); when it got to Fire TV set issue, he had to transfer the request to Fire TV Dep.; the refp in Fire TV dep. had to transfer to Fire TV tech to understand the issue.  The Fire TV agreed the need of replacement without any questions, but took about 1 hour to get back with a solution(3 times in between to ask for address, phone #, etc). According to the Fire TV tech, it took so long because he needed to go through Fire TV Replacement department to get  an approval or sort.  The replacement confirmation and instruction will send in 24 hours, it is at least 23.5 hours longer than other items purchased from Amazon, including those not fulfilled by Amazon center.  One thing may worth mentioning, even though the tech did not ask any question after described the battery life issue, he is pretty certain the issue is the remote and nothing to do with the program embedded nor the Fire TV hardware.Of course, all the efforts are appreciated but the process have a lot to improve.  Observing from how many people and time required to solve one replacement case for a customer waiting online, the quality and process control flow of the Fire TV seem deserve 2nd thoughts.  Wonder Return then order new set will be the \"right\" way to resolve issues more effectively.  If the replacement did not work, the whole set will got back to Amazon and give Apple TV a chance.  Will update after going through the whole replacement process with review for new remote.", "verified": true, "helpfulness": "3/6", "author": "Jessica"}]