[{"rating": 5.0, "review": "Very interesting as more and more applications will use this product. I'll be interested to see what this does in a year.", "verified": true, "helpfulness": "0/0", "author": "Dave Phillips"}, {"rating": 5.0, "review": "This productos is exellentI recommended itI fun so much with itI like youtube videosI like netflix movies", "verified": true, "helpfulness": "0/0", "author": "César Sevilla"}, {"rating": 4.0, "review": "I had heard that the internet would be accessable with the use of this device. That I cannot is my only complaint.", "verified": true, "helpfulness": "0/0", "author": "Charles"}, {"rating": 4.0, "review": "Practical, affordable  and effective product  I believe that as soon as other Apps are added it will pwrfect. I recommend it.", "verified": true, "helpfulness": "0/0", "author": "ANTONIO CESAR NOVAES"}, {"rating": 5.0, "review": "Received as scheduled and very easy to unpack and install. Use it with an iPad and Hulu+ for shows that we missed. At first was not supported by Hulu but they issued an update which allows us to use the Chromecast with Hulu. Worth every penny!", "verified": true, "helpfulness": "0/0", "author": "Robert Colson"}, {"rating": 3.0, "review": "I know it's beta extension.. but still... Can't wait till it gonna work.. And google release the SDK for delvp....", "verified": true, "helpfulness": "0/0", "author": "Peter Stephan"}, {"rating": 4.0, "review": "The item didn't work with my TV as I only had one HDMI connection. I have an older TV. So, I gave it to a friend who loved it. CH", "verified": true, "helpfulness": "0/0", "author": "Carol Hubbard"}, {"rating": 3.0, "review": "The current list of apps are really limited. and there are so many constraints on usage,Hopefully Google will have support more Apps in the future.", "verified": true, "helpfulness": "0/0", "author": "Yong Chee Wai"}, {"rating": 5.0, "review": "Did just what I wanted gave me netflix and youtube on a tv that did not have the ability to use netflixI did have to purchase a range extender to go along with the chromecast device.  My wireless signal was not strong enough for it to work properly but the range extender worked well for the chromecast device and also made connections for my phone and laptop much better throughout the house.I did find that when I installed the range extender I had to be sure it had the same name as the wireless router and not the default name the range extender would have given to the new extended wireless network, the insturctions that came with the range extender did allow me to keep the name the same,  I assume since the content comes from the main wireless router and the chromecast device was working through the extender they needed the same network name to be recognized by the phone which is how you control the netflix movies.  Also the phone must also be using the same extended wifi network as the chromecast device.so it took a little getting use to becaue of the distance of the tv from the primary router and the need for the range extender.", "verified": true, "helpfulness": "0/0", "author": "Rocco Costello \"Engineer\""}, {"rating": 4.0, "review": "Very useful for me because I spend long hours to watch YouTube more than TVThank you thank you thank you", "verified": true, "helpfulness": "0/0", "author": "sultan"}]