[{"rating": 1.0, "review": "I was very eager to get this and waited on back order for probably 3 months.  Setup was a P.A.I.N.  I was able to finally achieve it, but no way would I give this to my neighbor to try and solve.  Even after setup I find it mostly useless and although I used it to watch Youtube for the first few weeks, I can't say that I've used it any in the past 4 months.  My Roku does everything this does, better, and I don't need a e-pad to use it.  Sorry, Google, in the end, this thing just doesn't do enough, regardless of the low cost,and it does nothing that an internet \"tv\" box can't do better.", "verified": true, "helpfulness": "1/2", "author": "Shark Likes \"I'm the most boring person on the planet.\""}, {"rating": 5.0, "review": "I haven't had cable or satellite tv for over 5 years now, so I have gone through the most basic caveman techniques to this little beauty. The Google Chromecast is the best device i have ever bought, no joke. To think it only costs $35 and solves so many issues is a blessing of some sort lol. There is also an apk or two out there that can give you access to plenty of content for free, I'm sure if you dig into XDA's forums you can find it.", "verified": true, "helpfulness": "0/0", "author": "Jonathan Parkinson \"Jonathan Parkinson\""}, {"rating": 5.0, "review": "good", "verified": true, "helpfulness": "0/0", "author": "Luis Miguel Pimentel Tavarez"}, {"rating": 5.0, "review": "Every time I wanted to enjoy a short movie or documentary I would fall asleep when watching in on my tablet. My Sony XBR2 TV still provides great picture but it was lacking some type of network connection. Google Chromecast is just what I was missing to bring to find the full potential of this TV. No matter how old your TV is, you can use this device as long as you have a HDMI available port. My TV only had one but that is more than enough. Not sure if I can take this on my trip and use it on another TV.Pros: Once you start casting, you tablet does not waste any more battery as it seems that Chromecast is bypassing in. While watching your show on TV, you can use your table to check your email. Casting does not stop. It feels like an added multitasking capability.Cons:1. You need to download the YouTube or Netflix app in order to start casting.2. Set up is not that difficult but it takes time.3. You need to press stop or pause 2-3 times in order to stop casting. They need to update or refine the application.4. It requires an USB port for power. They supply it but it would be less wirebattle without it.Overall we love this product and all the breakthoughs that Google comes up. Unlike the giants who sale expensive tables, Google thinks of the consumer and creates affortable solutions. Get yours and extent the life of your older TV", "verified": true, "helpfulness": "0/0", "author": "Dimitrios Kostopoulos"}, {"rating": 5.0, "review": "Had some trouble connecting this to my home wifi router, and from what I've read other people have as well. But after calling technical support I got it up and running and it's great, really cool way to stream netflix and youtube to the tv!", "verified": true, "helpfulness": "0/0", "author": "Austin Reeves"}, {"rating": 5.0, "review": "Sometimes a little slow but it works fairly well.  My teenage daughter has taken it over and enjoys using it for streaming movies.  A great buy!", "verified": true, "helpfulness": "0/0", "author": "tia"}, {"rating": 4.0, "review": "I'm a tech guy and I haven't made the time to really delve into the Chromecast yet.I've played with it a bit and what I've seen so far is really cool.There are a couple features I'd like to see (media access on network shares) but I suspect I just haven't found that yet.Cool to be able to manage through the phone or tablet as well.I expect it will continue to add functionality and will get better over time.", "verified": true, "helpfulness": "0/0", "author": "Mark Bisaillon"}, {"rating": 5.0, "review": "So convenient to be able to use your phone (which most people have with them at all times). Plus you can control volume as well. Works with Hulu, Netflix, HBO GO, but NOT Amazon Prime.", "verified": true, "helpfulness": "0/0", "author": "Scott Dunnigan"}, {"rating": 5.0, "review": "This has transformed family movie time together. It works so well and so easily, its condition was brand new. I am so grateful for this.", "verified": true, "helpfulness": "0/0", "author": "BlewJ"}, {"rating": 1.0, "review": "Got this mainly for streaming amazon prime, which is what I spend the most time on. Does not work :/ bummer.But worse than that, streaming anything from my computer from Chrome sucked up so much power that my computer overheated twice and shut down. It has never done that before. I returned it the next day and ordered the Amazon fire tv. WAY BETTER.Also, my computer continued to overheat after I stopped using it, until I realized that the Chromecast add on was still installed on my Chrome browser. Once that was deleted my computer returned to its normal state. I would not recommend this.", "verified": false, "helpfulness": "1/2", "author": "Kailah Gonzalez"}]