[{"rating": 5.0, "review": "Yes, you should buy this", "verified": true, "helpfulness": "0/0", "author": "ckylet899"}, {"rating": 4.0, "review": "Still need development but has a great future", "verified": true, "helpfulness": "0/0", "author": "Fabian Zuniga Duarte"}, {"rating": 5.0, "review": "Great addition for anyone who watches movies/shows on your computer. Note: the faster your wifi connection, the better Chromecast works (and vice versa).", "verified": true, "helpfulness": "0/0", "author": "Eric Kiser"}, {"rating": 5.0, "review": "Love my Chromecast- so much cheaper than an Apple TV and works just as well.  Finally bought a second one for our second TV.  Only really worth it though if you watch tv on netflix or hulu.  If you have full cable and a dvr, I doubt you would use it as frequently.", "verified": true, "helpfulness": "0/0", "author": "A. Gleaton \"aag\""}, {"rating": 4.0, "review": "Rated 4 of 5 stars , because it doesn't stream everything.  Easy to setup, easy to use, and works as advertised.", "verified": true, "helpfulness": "0/0", "author": "R. Stein"}, {"rating": 5.0, "review": "Awesome.  Our netflix box runs slow and buffers all the time, what we do is run Netflix on our smart phone and chromecast it to our tv.  it works brilliantly.  the picture is very sharp and good.  technology is amazing.", "verified": true, "helpfulness": "0/0", "author": "Lawrence"}, {"rating": 3.0, "review": "Bought mainly to stream from my Synology NAS (ds214 play).Cons: DSVideo won't work with https (chromecast needs a trusted certificate - good luck trying to find one). http works fine though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "mistyandebony"}, {"rating": 5.0, "review": "Really love the simplicity here, my only complaint (and this is inherent to any of these types of devices) is that it's annoying to change the TV source back and forth between lets say a cable box and the Chromecast. It's still a 5-star product for the price though, I can't blame them for the TV interface. I could get a \"connected\" TV for a lot more if I needed a better experience.Wish it was easier to stream Amazon Instant Prime, but doing it through a chrome tab works just fine.", "verified": true, "helpfulness": "0/0", "author": "Tara T"}, {"rating": 5.0, "review": "Can't do without it now, it's a must have device and very portable", "verified": true, "helpfulness": "0/0", "author": "oluwaseun ayankoya"}]