[{"rating": 4.0, "review": "Best thing I've ever purchased!! I use it in the bedroom where I don't bother with a cable box. So easy and convenient. Just needs Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "BargainLuxury"}, {"rating": 1.0, "review": "very poor- don't buy this peice of s", "verified": true, "helpfulness": "0/4", "author": "RAN \"R\""}, {"rating": 4.0, "review": "I love streaming with my Chromecast but I'd love it more if it were compatible with more streaming programs.  Doesn't work with Amazon Prime.  Works with Netflix and HBO GO.  I've never tried using it with other programs yet.", "verified": true, "helpfulness": "0/0", "author": "amber"}, {"rating": 5.0, "review": "Great device and keeps getting better.", "verified": true, "helpfulness": "0/0", "author": "Ryan Egan"}, {"rating": 5.0, "review": "Pretty much the greatest invention of all time. I've been going without cable TV since 2008, and this only help facilitate that. I relied on HTPCs or tablets/laptops for a while, but this if a lot more compact, cheaper, and works just as well if not better. Pretty much everything you could ever want is available either through official apps or unofficial plugins. From Netflix, Hulu, to streaming from your desktop or NAS. I have one hooked up to every tv in my house.", "verified": true, "helpfulness": "0/0", "author": "CA"}, {"rating": 5.0, "review": "Love the Chromecast. I use this to watch my movie collection while i'm away from my home. Chromecast + Plex = watch my movies/music/pictures anywhere there is a wifi network. If I go on vacation, then I have access to all my movies. This is especially great for my kids, since I don't have to bring any harddrives or any other device, just my Chromecast. It is also cool to stream Youtube to my TV.", "verified": true, "helpfulness": "0/0", "author": "Jeremy Thompson"}, {"rating": 4.0, "review": "Works almost as advertised. There are some negatives/catches/hoops to jump through though to really get what you paid for with this thing. It works pretty good for youtube, netflix and google play pretty effortlessly but it relies too heavily on third party apps to include casting in their apps to make it work rather than just having it so it will cast any video played on your device. For example, when using safari web browser almost every video I ran into would play but when using the Galaxy Note 3's Facebook app NONE of the videos could be cast because Facebook doesn't write it into their app. Also I found it annoying that if you want to see your photo's on your tv you have to search around google play and find an app that will work with chromecast rather than it just working natively like most videos do. Also, and probably obviously, it won't play videos that aren't on the internet, meaning if you have videos on your phone they can't be sent to your tv with this device. Maybe there's an app for that but I haven't found it yet. The key here is that this isn't a \"screen mirroring device\" this is an \"internet dongle\" for playing internet content.It sets up super easy, automatically updates and works almost flawlessly. I waited to purchase this until Google claimed the new updated software included screen mirroring... Well... They lied, it doesn't do that, not at all, not even a little, so if that's what you want, buy the samsung screen mirroring device that's made for screen mirroring and costs twice as much, if you want to watch netflix, youtube, google play movies or music, or almost any video you can find using the chrome web browser, then this is the device for you. My main use is netflix so I'm happy with it to say the least.", "verified": false, "helpfulness": "0/0", "author": "Wm D. S."}, {"rating": 2.0, "review": "Worked the first time but not since. Will rate again if it starts to work again", "verified": true, "helpfulness": "0/0", "author": "Steve"}, {"rating": 5.0, "review": "Great device. Even better now that they add mirroring in the latest update. Samsung galaxy s4. Works great use it to watch xfinity on demand when I travel. Must have for.the price!", "verified": true, "helpfulness": "0/0", "author": "Megan Frazier"}, {"rating": 5.0, "review": "The item is truly worth to buy.!", "verified": true, "helpfulness": "0/0", "author": "Daifeny"}]