[{"rating": 1.0, "review": "It didn't work. I returned it over a month ago and have yet to receive my refund.", "verified": true, "helpfulness": "0/1", "author": "CaroleSO"}, {"rating": 4.0, "review": "Great product", "verified": true, "helpfulness": "0/0", "author": "Richard Troup"}, {"rating": 5.0, "review": "Great!", "verified": true, "helpfulness": "0/0", "author": "Vladimir"}, {"rating": 4.0, "review": "I think the product is cool, and definitely worth the 30 dollars.My main purpose of buy was to mirror chrome tabs which doesn't appear to be perfected yet (in beta now).  It works for most part but streaming any video from the tab for more than a few seconds causes lag, choppyness.However, YouTube and Netflix work great.  It's amazing product for the price.Though it's not doing what I wanted it to do perfectly.  Surely it will improve.  For the price I can't comain.  It is great!", "verified": true, "helpfulness": "0/0", "author": "Mike S"}, {"rating": 5.0, "review": "Works like a charm.", "verified": true, "helpfulness": "0/0", "author": "ThaiTasteSA"}, {"rating": 4.0, "review": "I have 2 of them.  Easy to hide behind the TV.  Occasionally have difficulty loading.", "verified": true, "helpfulness": "0/0", "author": "Lawrence E Connor"}, {"rating": 5.0, "review": "No more watching Netflix on a small screen! This the best thing ever if you don't happen to have a smart tv. Easy to hook up and use and the price is so right!", "verified": true, "helpfulness": "0/0", "author": "mr. sticks \"Fred\""}, {"rating": 5.0, "review": "Best value for a streaming dongle ever. Went above and beyond my expectations. You can easily stream all your online videos from your internet browser onto a television without the hassle of an hdmi cable. You can even stream local content on your computer if you drag it into chrome and stream your tab. Setup is easy and takes 5 min. You just need an hdmi port and you're good to go. You can even use a usb port to power the stick without an outlet if your tv has one. Supports a great deal of streaming websites like youtube, xfinity (comcast), hbo go, netflix, etc. Can't really complain since its only $35. This obviously isn't a cable replacement unless everything you watch can be accessed online. But for most people, this device is great to stream a lot of stuff and provides a lot of convenience.", "verified": true, "helpfulness": "0/0", "author": "E.G"}, {"rating": 2.0, "review": "The Roku I bought from Target is so much better and more reliable. I junked this one.", "verified": true, "helpfulness": "0/1", "author": "Greg Coltrin"}, {"rating": 5.0, "review": "I have a few other products like this and the Chromecast is by far the best! Its speed it great compared to the other.  It is great quality smooth picture not a lot of buffering like the others.", "verified": false, "helpfulness": "1/1", "author": "Jeffery"}]