[{"rating": 5.0, "review": "Its cool different only thing I wish was more that we can add any apps we wanted not just what they pick..", "verified": true, "helpfulness": "0/0", "author": "Debbie"}, {"rating": 1.0, "review": "This is great hardware but it is totally crippled by the operating system.1. It is useless if it is not connected to the internet2. It cannot store any movies on it, so you have to keep downloading everything. This is terrible if your data limited to 15Gb/month3. It has Bluetooth but does not accept a keyboard.4. It cannot browse the webIt would be much much better with a touch pad controller and the kindle operating system.Love the hardware.  The software stinks...  you cant even buy amazon store products with it.", "verified": true, "helpfulness": "1/7", "author": "H"}, {"rating": 5.0, "review": "Fire TV is so much better than Apple TV. It's faster, offers more, and simply awesome. I have all Apple devices from iPhone to Mac Pro, and when I first used my Apple TV I was extremely disappointed. But I held on to it because I thought an update would fix or improve it. However, after a year, it never happened. I saw the Fire TV being marked down and I had some Amazon credit to use so I decided to give it a try. Plus all the reviews were very positive. Well, right out of the box I was impressed, I really like the packaging. Then once I hooked it up I was sold. If you've got Amazon Prime then it's even more awesome. The Fire TV is very impressive and far better than Apple TV. If your curious or looking for a device that brings internet to your TV then try the Fire TV. You won't be disappointed. I can't say it enough....it's simply amazing. Great Job Amazon.", "verified": true, "helpfulness": "0/0", "author": "KFree"}, {"rating": 5.0, "review": "This product is excellent it's surpassed my expectations I am very please thank you", "verified": true, "helpfulness": "0/0", "author": "Willie Porter"}, {"rating": 5.0, "review": "I have had it a couple of weeks.  Works great. Fast and responsive.  Definitely recommend.", "verified": true, "helpfulness": "0/0", "author": "Clint Ludeman"}, {"rating": 5.0, "review": "Love it! Extremely fast! Like the microphone feature works perfectly.", "verified": true, "helpfulness": "0/0", "author": "rick"}, {"rating": 5.0, "review": "works great!", "verified": true, "helpfulness": "0/0", "author": "matthew E stewart"}, {"rating": 4.0, "review": "I think I'm going to be very happy with it, but haven't had it long enough to explore the possibilities yet. One thing I do not like is that the \"windows\" that some movies, videos, etc., are shown in are smaller than my TV screen. I left the disc in my tower when I had to take it in to have viruses removed recently, and now I don't know where it is.  One person told me, \"We always take any discs out before working on it, and give them to the owner. I'm starting to search for it!", "verified": true, "helpfulness": "0/2", "author": "wolfophile"}, {"rating": 3.0, "review": "I was looking for a replacement for my Apple TV, since the iOS upgrade made all of my older idevices useless. I thought this was a perfect opportunity to try the Amazon Fire TV. Ordered it and received it almost immediately. But when I plugged everything in, I couldn't get to the home screen. I was using wifi, but to get it to work, I had to move it to a place where I had a lan drop. In other words, I was unable to install it in my house over wifi, had to have a cable to my router. Instructions fail to mention this fact. Now it works fine, other than that it rarely turns itself off. Seems to always have the power light on. Don't know why, but it doesn't draw much current so I am not too worried.  Overall, I wish the setup was easier. Had to figure it out on my own.", "verified": true, "helpfulness": "0/0", "author": "Jr. Bauer"}, {"rating": 4.0, "review": "I absolutely loved this!!! I have only used it maybe ten times, and I have only had it for maybe a month and my remote has stopped working :(. I have tried everything, I unplugged it and plugged it in again, tried new batteries, and cannot seem to find a way to get it to work again. I feel like it should have lasted a little longer than that. But it is a great product and I would recommend it, I have already preordered the fire stick.", "verified": true, "helpfulness": "0/0", "author": "Jessica Brady"}]