[{"rating": 5.0, "review": "Love it! The best one out there so far", "verified": true, "helpfulness": "0/2", "author": "Nurse O \"Nurse O\""}, {"rating": 5.0, "review": "Very easy to set up and use.", "verified": true, "helpfulness": "0/1", "author": "Bruce Johnson"}, {"rating": 5.0, "review": "Happy with it. If you are a wwe fan and have the computer network you can watch it on your big tv with this box.", "verified": true, "helpfulness": "0/0", "author": "clifford jeffery collett"}, {"rating": 5.0, "review": "Better than apple tv", "verified": false, "helpfulness": "0/1", "author": "parr"}, {"rating": 2.0, "review": "Poor man's Roku.  Unless you only use Amazon content this is not the machine for you.I find the apps for HULU, PBS and Netflix work poorly.  Often times have connection errors, fatal errors.  Fast forward in these apps is a joke.  The apps don't remember where you left off so heaven help you if you stop 1 1/2 hours into a 2 hour movie.I've also tried Panasonics version and that was disappointing.Roku got it right and is still the best as far as I'm concerned.I recently purchased an Insignia TV which is Roku Ready and I purchased the Roku Ready stick, this is slick.  You use the TV remote, no separate one.  No box, no additional power cord.  This is the way to go and more TVs should have this I think.Oh back to Fire TV, waste of money and I wish I had saved the box so I could return it.  Slick and flashy doesn't mean good.", "verified": true, "helpfulness": "1/8", "author": "B. Dalager"}, {"rating": 5.0, "review": "Amazon u are the best LOVE this device I have a smart tv now", "verified": true, "helpfulness": "0/1", "author": "L.phillips"}, {"rating": 3.0, "review": "Why is Amazon Fire TV more on Amazon than if I get it at Best Buy?Does it have extras from Amazon?", "verified": true, "helpfulness": "0/2", "author": "Amazon Customer"}, {"rating": 5.0, "review": "This thing really works! Ok, I have an old 42\" LG flat screen in the bedroom, I believe its their first model and it's not so smart, so I went shopping for a brain for this 8 year old TV. I tried Roku & Cromecast they both failed for whatever reason, they just wouldn't work! I started  looking for brand new TV for the bedroom to solve this problem but I saw this commercial with my good old freind Gary Busey! (Hello pants). Watching this commercial made me laugh and made me want to give this product a try, so I went on-line to Amazon and purchased the FIRE TV hoping for the best. I received it in the mail in 4 days, got it up and running in 15 minutes! Now my old TV is smart, Hello pants!", "verified": true, "helpfulness": "1/2", "author": "Gajit Bx."}, {"rating": 3.0, "review": "It's okay when it works....", "verified": true, "helpfulness": "0/1", "author": "Ray T Porter"}, {"rating": 3.0, "review": "It's a nice little box that works a lot better than most streaming devices. I thought being able to play the game apps would be awesome but dinky mobile games really are only useful on mobile devices. I guess if your board out of your mind at home, your phone is dead, the screen on your tablet is cracked, your xbox 360 had the red light of death, you lost your ps4 controller, then maybe game apps on your Fire TV would be useful.My complaints has nothing to do with the box itself, but just the lack of content and quality of Prime. Definitely not an replacement for Netflix. I don't know why anyone would provide Dolby Digital 5.1 for kid shows like Shaun the Sheep and not provide it on full feature films like The Centurion.", "verified": true, "helpfulness": "0/0", "author": "SS"}]