[{"rating": 1.0, "review": "We bought this  device so that we could stream videos from Netflix, which is pretty much what it is supposed to do. Easy enough, right? If only. We have two windows laptops and three android devices (two phones and one tablet). Chrome on windows just stopped seeing the device, out of the blue. Nothing seems to fix it. As for Android, same story: in a completely random way, the device refuses to connect, or drops the connection while you are watching a show. Resetting the device helps with Android, but it's time consuming and a pain in the butt to do every time we want to watch a show. And resetting the device does NOT solve the problem of Chrome on Windows refusing to see it. I have sent my feedback to Google, with no response. Apparently asking that a device works as advertised is too much these days.Moral of the story: it is so not worth the aggravation. Yes, it's cheap, but frankly if I had thrown the money down the toilet it would have been as useful and less time consuming.", "verified": false, "helpfulness": "0/1", "author": "Grumpy"}, {"rating": 5.0, "review": "Work great, particularly when my other streams don't work.", "verified": true, "helpfulness": "0/0", "author": "Parker23se"}, {"rating": 5.0, "review": "Did all it should! Used it outside of the US and had some issue communicating with the router, but changing the broadcast channel at the 2.4ghz frequency did the trick.", "verified": true, "helpfulness": "0/0", "author": "ariele"}, {"rating": 5.0, "review": "Great gift", "verified": true, "helpfulness": "0/0", "author": "Aimee N Bott"}, {"rating": 5.0, "review": "Best price ever! And arrived quickly.", "verified": true, "helpfulness": "0/0", "author": "Donnamarie Schey"}, {"rating": 3.0, "review": "leaves static on my regular channels when plugged in.", "verified": true, "helpfulness": "0/0", "author": "Beth Bellows Hooper \"BB Hooper\""}, {"rating": 5.0, "review": "Wonderful", "verified": true, "helpfulness": "0/0", "author": "Alfredo V."}, {"rating": 5.0, "review": "works very well!! Bought it for a gift now I want one too!", "verified": true, "helpfulness": "0/0", "author": "jan kummerr"}, {"rating": 1.0, "review": "exacted to stream netflix, hulu, etc and only able to stream youtube. suckssssssss.", "verified": true, "helpfulness": "0/0", "author": "r"}, {"rating": 5.0, "review": "Chrome Cast does what you want, but you want to make sure there is a strong wifi signal in the room you plan on using it.I use it in my classroom as a teacher, and it works very well. Fairly easy to use even if you are not very technology savvy.It would help if you knew someone with some experience with Chromecast or someone who knows about wifi networks.", "verified": true, "helpfulness": "0/0", "author": "pH 14 \"pH14\""}]