[{"rating": 3.0, "review": "Connecting and configuring the device is very easy, however, performance was so spotty I had to send it back. Often times my apps on my Android phone would lose connection or not see the device. The few times I could get it to stream video, it took nearly a minute for the stream to start and then it would buffer often. I never could get it to work with the Google Music app on Android at all.Also, and this is a personal preference, I thought it would be convenient to use my phone as a remote, but it's really more of a pain than anything.So it was a nice experiment, but I'll stick with my Roku.", "verified": true, "helpfulness": "0/0", "author": "Dana Pellerin"}, {"rating": 3.0, "review": "Works perfectly with strong wifi signal.  Google should add applications sooner. With compatible apps it works perfectly. The browser casting needs to improve a lot", "verified": true, "helpfulness": "0/0", "author": "Mithun Biswas"}, {"rating": 4.0, "review": "Not enough content to play on it but YouTube and netflix using my iTouch, be nice if amazon prime worked on it", "verified": true, "helpfulness": "1/1", "author": "Anna"}, {"rating": 5.0, "review": "This device intrigued me at first. Even though they only offered little apps at first I knew the way things normally go is if it gets popular the support and apps come rolling in. Slowly and sure they started coming out.When I first got this I only used it for Netflix and Hulu. As of now (FEB 2014) there is SO MUCH I do with this device. I have 4 of these and recommend it to anyone who asks. Its not that hard to setup, but if you work in the IT field or somewhat tech savy, this device opens up HUGE amount of media playback. While netflix and hulu and google play is fine. What sets this device apart for me is the price 30-35$ and the PLEX support.I have a NAS setup in my home with Plex running on it. Plex + Chromecast = I cut the cord (cable). WIth each Chromecast I can acess ALL of my media on any TV in my home, and because its a NAS, and on all the time. When I leave home I just turn off my pc and I can watch all my movies and TV shows anywhere I have internet acess to. All I have to do is bring my chromecast with me, as if its such a huge thing to carry. Its simple to setup in another home and I can watch my media on someones elses tv.Aside from the Plex support I love the googlecast tab feature. There is so much free media online in this day and age.However alot of the free tv episodes and such are only available through web browser, not anymore. With googlecast extension in Chrome, all I do it cast the tab to my Chromecast. Works great when I am cooking and want to watch an online show on the kitchen tv.For those who dont know you can ALSO cast your WHOLE desktop, its in beta but you can turn your tv into a pc monitor with this device also.Little by little more and more apps will be coming and I am just more than satisfied with this product.", "verified": false, "helpfulness": "3/3", "author": "Cesar Murillo"}, {"rating": 4.0, "review": "This little stick immediately became one of the most used pieces of hardware I own. I needed a streaming video solution for YouTube, Netflix and Hulu videos, as well as a way to play Pandora radio through my surround speakers. Chromecast was the perfect solution. Easy to install and use, stunning quality of streaming videos, and it even turns on my TV for me when I connect using my iPhone!Unfortunately, the iPhone apps that I am now forced to use in order to control the casting, such as YouTube and Netflix, are not great apps, and sometimes it can take forever to navigate my way through the apps to the video I am trying to play. Not to mention the crashes that both apps inevitably cause. Obviously, that is out of Google's control, but I do hope to see them expand their list of Chromecast-compatible apps in the future. Ie. social website apps, Spotify, third-party YouTube players.Also, Chrome on my Windows Vista laptop refuses to recognize my Chromecast, no matter what I do. Google acknowledges this incompatibility on their website, but I really hope it gets resolved in the future.", "verified": true, "helpfulness": "0/0", "author": "Danny"}, {"rating": 4.0, "review": "It works wonderfully. I bought this for my wife as a birthday present and she loves it. Downside is dont send it to a Post Office box, I did and it showed up 8 days late", "verified": true, "helpfulness": "0/0", "author": "pisec80"}, {"rating": 5.0, "review": "works seamlessly with YouTube. improvements needed (stated as Beta for now) in sending the tab to the TV.i love that for youtube it doesn't stream through the laptop but connects directly.waiting to see how to better share the desktop though", "verified": true, "helpfulness": "0/0", "author": "Omega \"Omega\""}, {"rating": 4.0, "review": "I got this because of the price.  I have a smart tv that does most of the things this does. However my cousin did not and I gave this to her and it changed her life. She uses it to watch Netflix and not having to use a small screen to watch entire series is awesome.", "verified": true, "helpfulness": "0/0", "author": "VIP910"}, {"rating": 5.0, "review": "This thing is awesome! It is great being able to stream content from all of your devices and the list expands all most monthly.", "verified": true, "helpfulness": "0/0", "author": "Techie One"}, {"rating": 1.0, "review": "It connect to my WIFI network but no browser can find it on iPad or google Tablet (even using chrome browser) What a waste of my time.", "verified": true, "helpfulness": "0/5", "author": "Sport lover"}]