[{"rating": 4.0, "review": "Misunderstood when I was looking at it. Thought it would have connection \"free\" for net flex and hulu. But in fact you have to subscribe to them also and then can easily use and amazon fire to connect.  Was disappointed on that aspect.  But enjoy the movies even though most are old.  Not too many new releases.  Red box has more variety.  Books are interesting but need to investigate more before I can say more.  don't do much shipping", "verified": true, "helpfulness": "1/1", "author": "April"}, {"rating": 5.0, "review": "This is a fantastic product. It is perfect for me as a college student who doesn't pay for tv but still likes to watch tv.", "verified": true, "helpfulness": "0/0", "author": "Lauren Bower"}, {"rating": 3.0, "review": "Not as good as expected", "verified": true, "helpfulness": "0/1", "author": "john burns"}, {"rating": 2.0, "review": "The layout of the main screen was difficult to navigate through and apps like Netflix and Hulu plus had to be downloaded. It was very fast and responsive but I think they could have come up with a better layout like the play station ,xbox ,or the Apple TV .", "verified": true, "helpfulness": "0/1", "author": "Nadia L"}, {"rating": 3.0, "review": "Obviously skewed toward amazon content.  Netflix on fire tv signs me out so that I have to keep signing back in. No other device (Roku, PS3, PS4) has this issue. They need to fix this. Once signed in Netflix should remain available rather that the Fire requiring continuous sign ins. 4/2/15 Amazon Fire continues to have problems with Netflix. Often states that Netflix has no connection, however Netflix connects perfectly on other devices.", "verified": true, "helpfulness": "0/0", "author": "Thomas Smolich"}, {"rating": 5.0, "review": "Great way to watch Amazon Prime!", "verified": true, "helpfulness": "0/0", "author": "Brenda S Long"}, {"rating": 3.0, "review": "I don't like  that I have to change the source on my TV to get Amazon Fire TV and yet another remote control..This was given to me as an Xmas gift and if you have lots of time there are a lot of  movies, documentaries etc. to watch.At moment I'll give it  3 stars.", "verified": true, "helpfulness": "0/1", "author": "Modzu"}, {"rating": 4.0, "review": "Works as advertised.", "verified": true, "helpfulness": "0/0", "author": "Michael Savoie"}, {"rating": 2.0, "review": "Amazon doesn't post videos to their hulu plus feed in real time. I can watch shows on my computer on hulu plus but not on fire boo to Amazon!", "verified": true, "helpfulness": "0/1", "author": "Kermit"}, {"rating": 5.0, "review": "Totally awesome since I have a son and grandson who set everything up for me.  We recently retired and it is so much fun to be able to watch movies whenever we want to do so.  It was a wonderful Christmas gift that we shall enjoy all year!", "verified": true, "helpfulness": "0/0", "author": "Marm"}]