[{"rating": 5.0, "review": "Super fast and really easy to use. We currently only use it to watch movies. The interface is really quick and the voice control is awesome.", "verified": true, "helpfulness": "0/0", "author": "Nathan Carmona"}, {"rating": 4.0, "review": "Being a Prime member, it makes sense to own the Amazon Fire TV. Easy and quick setup. Menus are simple and straightforward.", "verified": true, "helpfulness": "1/1", "author": "Prime time.Dot"}, {"rating": 3.0, "review": "Am still experimenting with my new purchase", "verified": true, "helpfulness": "0/1", "author": "M Zamb"}, {"rating": 5.0, "review": "works good but you have to get prime", "verified": true, "helpfulness": "1/1", "author": "Steven"}, {"rating": 5.0, "review": "Good to go when it comes in... just plug and play.  No extra logins for watch ESPN or other apps I have tried.  Enjoying both programs and movies.", "verified": true, "helpfulness": "0/0", "author": "RayFish"}, {"rating": 2.0, "review": "I was really hoping to love Fire Tv. I bought it in hopes of retiring my Apple Tv to another television and putting this in my main media room. I love my Apple Tv but it lacks the one thing that us Amazon patrons desire the most, Amazon Prime! Fire Tv boasts the Prime feature along with everything that Apple has to offer but it falls short.After fumbling around to get it synced with everything and all functions figured out, I was left feeling cheated. Granted it has Prime and every other streaming media platform out there, but it lacks navigational fortitude. I loath the way it \"flips\" through everything from side to side. The apps are in no particular order and you have to \"flip\" through them in sequence to find the one you're looking for. This doesn't sound like a big deal but it is very cumbersome and I am always left feeling that it needs to be cleaned up and organized.The remote is propriatary and works via Bluetooth instead of IR or RF like most remotes. This is a very neat feature since you dont need line of sight for the remote to work but I have home entertainment down to a science and prefer using one remote for everything. With Fire, you must use their remote only.The only thing that comes pre-loaded is Prime, all other features or applications have to be downloaded and in some cases purchased seperatly. I am a big user of AirPlay use it with Apple Tv several times a week. In order to do this with Fire, you have to purchase the AirBuddy app for $0.99 or you are limited to 15 minutes of airplay per day. After reluctantly buying an app that should be free and pre-loaded, I streamed everything through it only to find that the sound quality is horrible. It pops and cracks worse than Rice Krispies even after trying all sound settings on my television and the Fire Tv itself. What a let down.In conclusion, I have completely ditched all forms of television entertainment and am a streaming media user only. Maybe my hopes were too high for Fire Tv. It has been demoted to a small tv that only gets used occassionaly. I'll stick with Apple unfortunatly.", "verified": true, "helpfulness": "2/3", "author": "Trent Brickman"}, {"rating": 4.0, "review": "Amazon Fire TV is a great device.  I am switching from a Roku 2 to this and I'll just say the speeds are amazing.  The only issue I have with this device is that the Netflix is very slow.  It has to buffer way too much until I just give up.  I have a Google Chromecast in the same house and Netflix hardly ever has to buffer, it's weird because the Chromecast is hooked up to wi-fi and the Amazon Fire is hooked up via Ethernet.  I hope they get the issue fixed.Being an Amazon Prime member, I have access to all kinds of TV shows that are readily made available on your home screen as well as the apps.  I would like to see a few more apps come to the device and also a wi-fi remote like the Roku.  This was such a handy feature on the Roku and when I couldn't find the small remote, I just used my phone to operate the system.Overall, the device is well worth it.  I would buy again if I needed another one.", "verified": true, "helpfulness": "1/1", "author": "looker"}, {"rating": 5.0, "review": "Has been a great investment,works as good as expected,and love that its compact and doesn't take alot of space.", "verified": true, "helpfulness": "0/0", "author": "Renee M. Brown"}, {"rating": 4.0, "review": "Very responsive unit, however it somehow confusing regarding which apps are loaded and which not, and the left menu. Maybe because I'm use to the Apple TV and the iOS standard between all devices, but I think it could be simplified. Also, it should be more obvious to select Amazon Prime Free Movies.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Fast shipping!! Very cool! Added XBMC & Works AWESOME!!!!!!!!! Thanks!!!!!", "verified": true, "helpfulness": "0/0", "author": "tjheaf"}]