[{"rating": 3.0, "review": "I have a question for anyone who has used Fire TV. Is the show Homeland on Showtime available to watch free if you are a Prime customer?", "verified": false, "helpfulness": "0/0", "author": "Harish Chinai \"PM Leader\""}, {"rating": 5.0, "review": "I happen to make my living in the TV and film business - making promos (i.e. \"trailers\") of the kind you see available now when you peruse movies on amazon or netflix or whatever. About six months ago I sent an e-mail to amazon cs complaining that even though you could sign into IMDB with your amazon password and make a \"Watchlist\" that list would not show up on both IMDB AND amazon (via the Roku box we had)Like any normal person, I neither expected a response, nor a solution. YET, the folks at amazon not only responded, they solved the issue and thanked me for pointing it out. I share that long-winded story as a preface to my review of FIRE TV to make a point, and that point is this: the good folks at amazon \"get it\" BIG TIME.I have -- and use -- Roku, Apple TV, and some TV based similar services. FIRE TV PUTS THEM ALL TO SHAME.There is no lag time.There is no stupid multi-screen click thru bs.The image quality is absurdly good - the best I've ever seen in streaming devices.The voice search actually....works.The interface allows you to watch a trailer (moi important to me) and then return to your choices seamlessly - there is no hard sell.The bottom line is this --I watched the ghouls on CNBC talk about this device the day it was released as \"trying to re-invent the wheel\" i.e. nothing to see hereas usual, they were wrong...this is the best streaming device on the market PERIOD.and no, I don't work for amazon...", "verified": true, "helpfulness": "6/6", "author": "S. Rome \"sterlingrome\""}, {"rating": 5.0, "review": "This could not be any easier! Connect the HDMI cable (not included) plug it in and turn it on. That's it. It does just what it says it does and it does it effortlessly. I bought an Xbox last year to do the same thing on another TV in another room (I don't play games) and it's great but it cost about 3 times what this little black box did. And it works seamlessly with my other devices. I started watching an Amazon Prime TV show on one TV (with Amazon Fire TV), moved to the kitchen and picked up where I left off on my Mac Air and then moved to the den and finished watching on the TV with the Xbox. Awesome!", "verified": true, "helpfulness": "0/0", "author": "Barbara M"}, {"rating": 5.0, "review": "I've only had it for a few days, but so far it has been perfect.  I have been using a Roku HD (original model) for years, and it was starting to bug me - sometimes the \"enter\" key would freeze and I'd have to go all the way back to Home to start over again.  Not sure if it was the Roku's problem or Amazon.I got the Fire TV on a 30-day trial, and thought I'd give it a chance.  FIrst off, it has both Ethernet and WiFi, so I could put it in several rooms.  It also has both HDMI and Optical Audio, which is a requirement for my home theater.  I set it up in the guest bedroom on WiFi and HDMI, it connected right up, asked for my wireless info, and it was up and running instantly.  No need to authorize it either - it knows it's on my account.  Interface is extremely fast - no waiting for it to catch up like the Roku.  Much more intuitive and easier to navigate.  The voice search is wonderful - no more typing in letter by letter as you search for movies.  I have Amazon Prime, but not NetFlix, so I don't have the search problem other people have mentioned.What was not expected, was being able to browse photos, movies and online content in both my Amazon Cloud Drive and my Video Library.  Hey!  How did those pictures get on there? (I forgot I had backed up all my photos to my Amazon Cloud Drive!)Next I took it to the home theater room and replaced the Roku:  wired connection, HDMI for video, and Optical for Audio.  Went to program my universal remote, and found out the Fire TV remote is bluetooth.  My universal remote does not support bluetooth.  Maybe time for a new universal remote :).  But until then, the bluetooth Fire TV remote works from any direction, and is uncluttered and easy to use.Then I watched a movie.  Wow.  Fast, no buffering, easy to navigate, voice search was awesome.  I packed up the Roku the next day and I'm keeping the Fire TV.  Maybe I'll have to get another one for the guest bedroom.For my needs, this is perfect.", "verified": true, "helpfulness": "0/0", "author": "Gadget Girl \"gadget queen\""}, {"rating": 5.0, "review": "First I want to say about the only downside, and it's currently temporary, is the usb port.  It is not active, but if you think about it, why did they include one?  Eventually, with a firmware upgrade, is all it would take to activate it.  It's just a matter of time.My TV has a lot of these internet addons.  I have a Roku 2, Apple TV 2, and a computer with XBMC installed on it.  The Roku and the Apple TV are very similar to the Fire TV, various apps, Netfilx, Hulu Plus etc.  The Apple TV 2 and the Fire TV have the distinction of being able to have XBMC installed on it.  With the much larger ram capacity and faster processor, the Fire TV runs the apps, and especially XBMC, much faster and smoother.My favorite box is the Fire TV, especially for how it runs XBMC.  It runs it smoother than on my computer.", "verified": true, "helpfulness": "0/0", "author": "Patrick J Runcie"}, {"rating": 5.0, "review": "Just what I needed to stream movies, shows and music. The picture is great and lots to choose from with Prime.", "verified": true, "helpfulness": "0/0", "author": "Neal G. Drury"}, {"rating": 4.0, "review": "Set up took longer than I expected because it took me a while to figure out that the batteries for the remote that came with the unit were dead.  Note to self:  This thing is completely worthless without the remote, so I probably should order a back up.  I also was disappointed to find out that there seems to be no way to run this thru my (admittedly older) A/V receiver so that I can take advantage of my full sound system rather than just the TV's sound.  I also think it's misleading to advertise this item at less than $100 when it obviously requires an HDMI cable to operate.Having said those grumbles, it is easy to use and has a good selection.  I will join the chorus of others who want a way to search just Amazon Prime offerings and an easier way to block my kids from ordering without my permission.  I should be able to set that from the unit itself.", "verified": true, "helpfulness": "0/0", "author": "Sad Duck"}, {"rating": 5.0, "review": "Love this little box !!! I waited before I cancelled my other service of which I was paying $100.00 a month, guess what? With Fire TV, (the initial cost of the box) Amazon Prime. and Netflix, around $24 a month!! CUT THE CORDS and SAVE BIG!", "verified": true, "helpfulness": "0/0", "author": "Philip"}, {"rating": 5.0, "review": "I have a smart TV in my living room, but just a regular LED TV in my bedroom which is what I bought this for. We have a blue-ray hooked up to the bedroom TV that has Netflix and Pandora but you're not able to update any new apps to it, such as Hulu+ or Amazon-Prime. Amazon Fire TV was setup in less than a minute, has every app that we could want and boy is it FAST. My smart TV is a newer Samsung, which is at the top of the list, but even it doesn't come close to how fast this is and neither is the blue-ray. I also love the look of the Amazon Fire TV, very sleek looking, even though no one will ever see it seeing how it's so small and is set back behind the TV.The search feature is nearly instant and when it comes time to play something there is little to no lag at all, unlike others that have anywhere between a 10 to 30 second loading time. I also love how seamlessly it works with your smart phone and tablet. Say I want to search for something in an app that the voice recognition isn't compatible with, because it doesn't work for every app YET, I just pull up the app on my phone, pair it with my Amazon Fire TV and type it in rather than use the screen keyboard and I have full control over the video as well.The only things that they need to work on, which they already know about, is that they need to clean up their Amazon-Prime app so that you can easily filter out Prime video from paid video, which the Amazon-Prime app on my Samsung TV lets me do, so they know how to do it, either they just didn't for this or they have some kind of agreement with Samsung. Also they need their search to be able to search multiple apps at once, which Roku can do- but let's face it, Roku is something that runs and looks like it was built by Fisher-Price... they just so happened to get their search feature down a little better than everyone else. Roku may have a patent on this though, so I'm not sure if Amazon will be able to make their search quite as good without coming to some kind of agreement with Roku.Over all though I would recommend it to anyone and everyone. We got this in hope to finally cut the cord with our satellite provider, which is what we did the same day after using Amazon Fire TV. We were paying $105 a month to Dish along with having Netflix, Hulu+ and Amazon-Prime accounts, which added up to $25 (granted Amazon-Prime is paid annually and not monthly, but the monthly break-down was included in the monthly cost). Between those three apps and everything else that you can watch for free, we were able to just get rid of Dish. And like I had said before, it is fast- so fast that I'm now considering getting a second one to use on my Smart TV.", "verified": true, "helpfulness": "2/3", "author": "Lew"}, {"rating": 3.0, "review": "It is geared to make you pay.  It is very difficult to use the search to find the movies that are eligible for free viewing.  I am very disappointed that Amazon decided to leave out a feature to search for the free movies only.  I payed for prime to watch the free movies.  Other than that it does what it says pretty good.", "verified": true, "helpfulness": "1/1", "author": "FireTV User"}]