[{"rating": 5.0, "review": "Amazing!  Right out of the box...plug and play at its best.  Easy to use and understand.  It has changed the waywe view TV!!  Looking forward to more viewing options in the future.", "verified": true, "helpfulness": "0/0", "author": "snrubs"}, {"rating": 4.0, "review": "My review of the Amazon Fire TV is probably slanted because of my age, etc.  When I ordered the Amazon Fire TV I was using a Roku 2. I thought the AFTV would do a better job playing my music from the Amazon Cloud Player. Of course when I got it and found out at that time it didn’t even work with the Amazon Cloud Player I was fit to be tied! However I chose to keep it because I did like some things about it and they did promise me that it would play my music “someday”.  That did happen about a month later and when I first tried it I found a new feature for my music that I am thrilled with – LYRICS! I am a hearing challenged 72 year old that lives with a dog and a cat. Because of my hearing I have never been able to understand all of the lyrics and in the last 15 years or so practically none. In fact I would often find the lyrics of certain songs on my computer where I could read them as I listened. I realize that may sound like I am getting off of the review of the AFTV but I don’t think there is any other device that takes advantage of the Lyrics. I know my old Roku doesn’t.  On the down side Amazon could take some ideas from Roku on the way my music selections are laid out when I start browsing. I have 6,000 plus albums and if I am searching for a particular album that lets say if about the middle of that list it can take me 7 or 8 minutes to scroll through that far, where Roku displays them in groups of 100 with notation at the first of each 100 so that I know what is in that group so I can actually start going down the list 100 at at time until I get to the group that it is in.I actually have a good bit to say about the remote, and I am talking about what they call the Fire TV Remote (the one that comes standard).  It looks great but I have a couple of issues with it. First of all when I am watching something on Netflix there is no “instant replay” feature like the Roku remote has. It does have that if I’m watching a video from Amazon Instant. Next it is far too easy to accidently hit the “Home” button while scrolling down through a list like songs in an album. If I have scrolled for the 7 or so minutes to get to that album and then do that I usually scream!", "verified": true, "helpfulness": "0/1", "author": "SuperAggie"}, {"rating": 5.0, "review": "Just hooked it up & am still figuring out what I can do with it. Very easy to set up, even for a technically challenged older person (like me). I think I'm going to love it!", "verified": true, "helpfulness": "0/0", "author": "titans#1fan"}, {"rating": 3.0, "review": "Worked just like advertised but I just wasn't that happy with its features and returned it", "verified": true, "helpfulness": "1/3", "author": "Robert C Warren"}, {"rating": 4.0, "review": "I would like better if you could pickup Fox News......", "verified": true, "helpfulness": "0/4", "author": "Michael"}, {"rating": 5.0, "review": "My son has one and uses it with his Plex server with the Plex app. I have used it with Amazon Prime movies as well as with Hulu Plus and Netflix. It works great with no stuttering i sometimes get using my PS3 for streaming video. I also really like the voice search features for Amazon content. It would be nice if it could work with the other services too.Plex was a bit more work to set up as I wanted to just share my sons server. After I set up my own server it linked to his fine so it is more a procedure thing but now works great.", "verified": true, "helpfulness": "0/0", "author": "mchipguru"}, {"rating": 3.0, "review": "Remote poorly laid out. I was always hitting the wrong button and going to the main menu instead of OK.  Channels are also limited and the voice control is iffy.I returned this and ordered a Roku 3 for my second TV.  I am much happier with that.", "verified": true, "helpfulness": "2/3", "author": "N. Mininger \"Sanity is Over-Rated!\""}, {"rating": 3.0, "review": "It's alright. The Vimeo app is very useful if you want to stream from your pc shared folders to the amazon tv, but the pc needs to be on and awake for it to be detected. Has netflix and all the usual money sucks. Interface is a little clunky and it's hard to find the free amazon prime videos; there are several videos that cost money to 'rent' or buy and there isn't a way to filter those out. Hard to even tell when a video is free to begin with. You often have to go into the info to find out more and see if it will let you watch now or not. Overall, it was only $100, so whatever, but I prefer leaving my PC hooked up to the TV directly.", "verified": true, "helpfulness": "1/1", "author": "libellus"}, {"rating": 4.0, "review": "Good movie & show selection Not as current as I thought it would be", "verified": true, "helpfulness": "0/0", "author": "Mr Mcgoo"}, {"rating": 5.0, "review": "i love it - i can watch shows from amazon prime in my bedroom that i can't watch in the tv roomeasy to use - great voice recognitionwould definitely recommend it", "verified": true, "helpfulness": "0/0", "author": "nancyann"}]