[{"rating": 3.0, "review": "I was very pleased (like other reviewers) with the fast setup and ease of use. I also thought the near-instant start ofvideo was nice. But then, in a little further on, and the show stops dead while a spinning circle gyrates for almost a minute, thenit plays some more, back comes the circle again (and this was not even an HD show). Eventually it complains that my network speed is too slow...  Knowing that I have a highspeed cable modem - I check out my download speed - no surprise, it is 56Mb - which is near the top end of the internet speed apps.After having this happen in show after show with the Fire. I decided to try my older Roku box to watch the same shows, and they run fine from start to end with no pauses for buffering except for the slight pause before starting.Is it just me - do I have a bad version of the box, or are others seeing the same thing?I'd really prefer to use the Fire, because the user interface is much nicer - but until they fix this issue, I'll probably stick withthe old Roku.", "verified": true, "helpfulness": "2/2", "author": "Ray R. Larson \"Book Junkie\""}, {"rating": 4.0, "review": "Fire TV turns your TV or computer monitor into a Smart TV.  Your TV or monitor must have an HDMI port, and you must have an internet connection(wired or wireless) where you intend to use Fire TV.  The USB port on the Fire TV is not usable now.First of all, if you need written instructions or video instructions, check the Amazon website.http://www.amazon.com/gp/help/customer/display.html?nodeId=201348270Attach an HDMI cable(none is supplied) from the Fire TV and the TV, plug-in the power supply to the Fire TV and the wall socket.  If you are going to use a wired LAN connection, hook that up.  Turn on the power.  It took 18 minutes from the time I started opening the shipping box to the start of download for the update.  In 35 minutes I was looking at the Home screen.If you have a wireless connection with a password, you will have to input the password.  My Amazon account was already installed on the Fire TV, but if you want to change your account or start one, do so.  You are on the air!!What’s Good:1.  The famous apps are here(Amazon Instant, Netflex, Hulu, Pandora, etc.) and lots of other stuff.2. Operation is fast3. Voice activation, through the remote, works pretty well and eliminates awkward typing schemes.4. Easy to set up5. Small size6. Can play games.  I was able to play Riptide and Asphalt 8 with the Fire TV remote.  You might check the app list on the Amazon web site to see how many games you can play without the controller.7.  Apps are grouped in categories.  This is not trivial: my “smart tv” has dozens of apps, but in no discernible order, leading to chaos.8. Nice slide show screen saver which can operate while Pandora plays.9. The HDMI interface, in newer TVs, will allow interactive control between the TV and Fire TV.What’s Not So Good:1. Personal photos and videos have to be loaded from Amazon Cloud.  You have to set up Cloud service on your computer.  (No USB or SD card service on Fire TV).  Amazon says you can throw stuff to the Fire TV from the Kindle Fire HD.  I tried using a Galaxy S3 phone and was not able to do this.2. Not a lot of apps: By far , games constitute the largest app category(134 today).  There’s no web app, very few news apps, no weather app, etc.  Hopefully, the app coverage will increase soon.So Who’s It For?Fire TV is very good for families with young children.  There’s plenty of movies, tv, and games in an attractive, high performance package.  Hardcore gamers and web shoppers will be better served elsewhere.Remote Surprise:A very pleasant surprise with the Fire TV was my discovery that my TV remote controlled Fire TV.  I could navigate menus on Fire TV and control my TV’s volume from the TV remote.  In addition, if the TV and Fire TV were turned off, pressing the enter button on the Fire TV remote caused Fire TV to turn on and the TV to turn on and switch the TV to the Fire TV input on the TV.  This requires a newer TV with HDMI control functions.  The result is a seamlessly integrated TV/Fire TV.Search Surprise:Its been said that search only applies to Amazon stuff, but that’s not quite true.  I searched “Criterion” and got a list of Criterion movies.  The Amazon entries were there, but the Hulu entry was also.", "verified": true, "helpfulness": "3/3", "author": "ElViejo"}, {"rating": 2.0, "review": "Roku is actually better at Universal Search, meaning it has one. The Fire TV is easy to use, but if you have HuluPlus, Netflix, etc. and search for something using the Fire TV remote control (voice or otherwise) it seems to default to Amazon content only. My 7 year old might want to watch a kid show and I pay 3.99 to rent it on Amazon instead of letting it find the free one I have available with my Netflix subscriptiuon that Amazon already knows about. As a result I have to search for it for my 7 year old by going to Netflix and typing it using the remote. I might have to return it since I can already do this kind of search on anything else, like a wii.I'm not disappointed at the rest of the experience, it works great. Its simply failing to make it easier for me to not have to be in command of the control when my child deserves to watch something as a treat and let her be in control (I can do this but then the child would control my wallet too!). Amazon, please make the search \"Universal\"! I was trying to make something simpler and easier and it was really an epic fail in this regard.", "verified": true, "helpfulness": "3/4", "author": "L. M. Graziano \"Avid Reader\""}, {"rating": 5.0, "review": "Very responsive. Great remote. Great size and look.Could use some software refining, both of the core system and of the apps.", "verified": true, "helpfulness": "0/1", "author": "Andrew Smith"}, {"rating": 2.0, "review": "It is very nice. Streams well, fast and even the games are decent.,  I ordered the game controller as well. When I got it I was excited to play some games. However, I quickly realized that the lack of memory in the device was RIDICULOUSI downloaded a few games and when i went to get NBA2K14, it advised me to delete some other ones due to memory!!!!BACK IN THE BOX IT WENT........ I cannot and will not deal with them.... LISTED AMAZON.... MEMORY IS CHEAPPPPPPP8GB REALLY?????", "verified": true, "helpfulness": "2/3", "author": "kenny Novak"}, {"rating": 4.0, "review": "This is my first media box, not counting game consoles.  I've avoided the Apple TV because it didn't include Amazon Prime movies, which made me jump on the Fire TV when I learned about it.  The installation is seamless and my entire family loves how easy it is to operate.  I highly recommend this device for the ease of use.However, one gripe I have deals with the very accurate voice search.  When I want to search for a movie or show, I'd like to see all options available.  Sadly the search only goes through the top level and doesn't search within all available services.  So a free Netflix movie (with paid subscription) will not show up in the search results.  Thus the 4 star rating.", "verified": true, "helpfulness": "0/0", "author": "T. Tran \"oldmantran\""}, {"rating": 4.0, "review": "It sets up VERY easily. More so than Apple TV.Overall quality is very good.I have one MAJOR complaint:It interfaces well with Amazon Prime, but not in the same way as via a PC. It needs to have a way to selectively offer only Prime Eligible menu choices. I have to go through several selection steps to find out if I can view something for free under my Prime membership.", "verified": true, "helpfulness": "1/1", "author": "ParkerB"}, {"rating": 3.0, "review": "Pros:  fast, great design, flawless video.Cons: Lack of apps.  HBOGO and MAXGO are 2 apps i use on a regular basis and not available here.  When it comes to apps its very immature and not even in the same LEAGUE as Roku.  Voice is a nice gadget but only focused on Amazon.  Amazon: here's a hint, not every movement on this appliance should be geared to spending money on Amazon!Bottom line: def not worth rushing out to purchase.  Once they boost their apps and it becomes more mature I would purchase.  No value for being an early adopter .", "verified": true, "helpfulness": "2/3", "author": "Joseph Maccrory \"J Mac\""}, {"rating": 5.0, "review": "I have used a number of these devices from Roku's, vizio co-star, D-link, and several others.  I am a IT professional and pretty picky on my electronics.  I can honestly say that this is hands down the best streaming device I have ever used.  The speed and video quality is top notch.  WAY faster loading HD video, way cleaner audio and video, way faster navigating the menus, very easy to use.  I would recommend this to anyone who wants the highest quality streaming video device.", "verified": true, "helpfulness": "5/5", "author": "Cody S. Nutt \"MIR\""}, {"rating": 3.0, "review": "Set up was really easy, basically a plug and play.  The response was very good.  I wish it had an off button though because once it has gone to sleep it usually has a hard time re-opening Netflix.  Actually have to unplug the box to reset it to get it to load Netflix.I am thinking of returning this for a smart Blue Ray Player.  I have Amazon Prime but watch very little video since everything I want to watch costs extra!  I order so much from Amazon they certainly are not making money on me!  I can get the same usage from a slightly cheaper Blue Ray and also use it to play Blue Ray versus using the Fire TV.", "verified": true, "helpfulness": "0/3", "author": "V. Edwards"}]