[{"rating": 4.0, "review": "Not enough free movies.  Netflix has some advantages on fixed monthly charge for all streaming.", "verified": true, "helpfulness": "0/0", "author": "Phil Heald"}, {"rating": 5.0, "review": "Love it! I would like an option to scroll down through list of titles rather than cover photos for quicker searching.", "verified": true, "helpfulness": "0/0", "author": "henrydevane"}, {"rating": 4.0, "review": "Great functionality. Nice interface. Just needs to have a reset function on screen. I've had to unplug the box several times to restart the Service.", "verified": true, "helpfulness": "0/0", "author": "Matthew Bradford"}, {"rating": 5.0, "review": "Having the ability to install apps like XBMC is what sold me on Amazon Fire TV. Being able to have Amazon Prime, Netflix and Hulu Plus on the same device is also a plus. Watch out Satellite and Cable companies, this device is going to bite you.The only negative thing I have found so far is I wish there was a power button on the remote. If you get a wireless keyboard (see below) the power button on it will turn off/on Fire TVSince getting this device I have used it daily, Apple TV not so much. Much more free content on this and I have only scratched the surface of what is available. Things I actually want to watch also. Apple TV is mostly what is trending on the internet right now or pay for this and that and the other thing to watch.Checking Amazon Prime, most of my favorite TV shows are available for free (as a member).  Only show I'm missing for free is Walking Dead, Amazon Prime please get this show (for free).Got the Amazon Fire TV, dumped Satellite and now saving apx $100 a month. Granted you can not watch TV live so you have to walk away from the office water cooler at times. Big deal, now I can watch on my schedule, just like a DVR, but I don't have to remember to set it to record. Also get your self a cheap $10 digital antenna (also available here on Amazon) and get your local channels, also free, crystal clear. Where I live I can get 23 local channels, only one I'm missing is NBC, but those shows can be streamed on line the next day. Install a browser on Fire TV and there you go. You will need a mouse or touch pad to make the stream full screen (check below about keyboard).If you stream off the internet you need minimum 5mbps, 10mbps for HD. I had to fire my previous internet provider due to this so now I'm getting much faster download speeds for less money, saving there also thanks to Amazon fire TV.Get yourself a NAS (I got the WD mycloud), install XBMC on Fire TV, put your entire video library on the NAS, everything you own is available at the push of a button on the Fire TV.Handy to have addition is the Logitech Wireless Touch Keyboard K400 (apx $20 here at amazon). This keyboard has a built in touch pad that can act as the mouse. Not quite as big as a full size keyboard but big enough and handy. While installing icons for XBMC (see below) I made a mistake and could not figure out how to delete the icons that were put in the wrong directory. Once I got this keyboard it was easy. In the \"explorer\" type ape that comes on the Fire TV, drag the offending file to the bottom right corner to delete. WARNING: Be sure you know what your deleting or you can screw up your Fire TV to the point where it will not be usable.If your not very computer savvy, watch video's on you-tube how to install XBMC, browser, etc, it is not that hard. The plug ins you will want for XBMC are Mashup (can be installed but currently not working, they plan to come back from what I hear) iStream and NaviX. There are more but these are the ones I mostly use.One thing I would recommend, several videos say to use a sacrificial app so XBMC will show up in your recent's menu. The app they recommend I actually find entertaining (Classic TV (TV shows from the 70's and 80's)) so look at other apps to find one you really don't want and use it as your sacrificial app. This is a little more complicated and time consuming but directions can be found on the internet to do this. Before you decide on an app, look at the file size first and pick a small one. For example I can care less for anime, was going to use that app to sacrifice, but it was much larger then others. I decided to use Kino Lorber as my sacrificial app. The file size is small and the content I'm not interested in. The apps are not actually installed from the factory, just a link to install them. Also there are directions on youtube how to change the icon of the sacrificial app so it is not XBMC's icon.What do I mean by sacrifice? you will have to install an app called Llama. With this app you tell it any time I open app \"X\" (your sacrificial app) do not open X but instead open XBMC. The sacrificial app is installed on the Fire TV but will not open by this method. Other wise every time you want to open XBMC you have to go way down into the sub menus to find it.In short: if your looking for a streaming device, Amazon Fire TV is the device you want.", "verified": true, "helpfulness": "0/0", "author": "Vandel"}, {"rating": 5.0, "review": "The fire is very entertaining.  I like that you can place apps right on your tv. We play crossy roads which is so much fun.", "verified": true, "helpfulness": "0/0", "author": "luvinamzn"}, {"rating": 5.0, "review": "Amazing", "verified": true, "helpfulness": "0/0", "author": "David A santos"}, {"rating": 5.0, "review": "fatastic", "verified": true, "helpfulness": "0/0", "author": "Kathy Thir"}, {"rating": 4.0, "review": "My wife and I decided to not have cable anymore. We already own an Apple TV and thought this would compliment it well, which it does. Add in a prime membership and you really get a good selection of movies and shows. My only complaint is I was hoping it would have the VUDU app available, but it doesn't. This sucks considering I have a good amount of movie through Vudu. This isn't Amazon's fault though, I didn't do my research. So outside of that I say get it!Update: The controller is extremely touchy. The slightest tap and it responds, so I suggest putting it on a table or away from you while watching. Also, Hulu Plus has issues on the Amazon Fire TV. It constantly stalls, tried on my Apple TV on a different tv and had no issues (at the same time). This isn't the fault of the Fire TV though, but just be aware of the issue.", "verified": true, "helpfulness": "0/0", "author": "James S."}, {"rating": 4.0, "review": "Exceptional. Clear and worth every penny.", "verified": true, "helpfulness": "0/0", "author": "Turien Cram"}, {"rating": 5.0, "review": "Dear Amazon, I just had to tell you how much your devices have helped change my life! I am disabled and due to mobility issues and just not liking being around large crowds the Amazon Fire TV gaming bundle purchase has sincerely changed my life. I haven't gone out to see a movie in years for the listed reasons and since receiving my devise I can finally watch movies I've long wanted to. I also purchased the Echo and love it for many of the same reasons. I don't have to try to get up when wife's not around to listen to music or just see what the weather is like outside. Plus now she no longer has to call me to remind me to take my medications, we just set the reminders with the Echo. I honestly can't thank your company enough in words alone. Please tell the entire Amazon team to please keep up the great work because they are truly changing the lives of so many. I do have one request! I would like to be able to have the Echo be able to call 911 emergency services if ever possible.", "verified": true, "helpfulness": "0/0", "author": "spuds366"}]