[{"rating": 4.0, "review": "Our main use case is wife watches K-Dramas on her laptop, thought it would be better for her to show on the HD TV. I got a Roku 2 because it looked better in the store, but after 30 minutes got bored and returned it for the Chromecast. The Roku had many channels, but they were all like a few videos, and please pay to get more. K-Dramas are on Hulu (free), but the Roku would only find the Hulu Plus (pay) channel. Plus, it was slow to start a video -- same as finding and watching videos on Internet. The positive - the Roku had a good picture when it came on.Got the Chromecast, and figured out how to get it working fairly quickly. Setting up the Google software and running it was not too painful. I've got 4 devices, and this is my experience with them, why I'm giving only 4 stars:- phone and tablet -- I got the Hulu and Dramfever apps so my wife could her K-Dramas. But when I went to send by Chrome Cast, they both insist on upgrading (and paying) to the premium version. I even tried just playing the video, and Chrome Cast sending the screen image. After 2 minutes, Chrome Cast shuts down, I guess they were smart enough to anticipate me trying to workaround.- 2007 laptop -- installed Chrome, then ChromeCast, and the playback was terrible. Lots of stuttering. I noticed the CPU maxed out, and the playback on the laptop was not very good, much worse then Firefox. So, that did not work (after experience on next machine, I conclude it was due to the laptop being under powered).- 2009 Desktop -- this machine is much more powerful, and the TV playback was as good as on the computer monitor. The only problem -- it is my workstation in another room.In all, I would have been better off getting a cable from the laptop to the TV -- cheaper, and more control of how I want to find and playback videos (Firefox) to send to the TV.But, ChromeCast gets 4 stars, because painless to set up (got up and running on above 4 devices in around 30 minutes), and it does what it promises, a wireless connection from you device to your TV. I've cut one star because it is really annoying that the full machines can go to a website to get the free content, but the apps require the premium upgrade. I suppose not Cast's fault rather the sites and the app developers, but still seems like a sneaky fact they don't tell you when you buy it. I've only cut 1 star because the full machine allows a bypass, whereas the Roku I would cut 3 stars because it's worse, and you can't use a full machine with browser.", "verified": false, "helpfulness": "0/1", "author": "David L"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Luis"}, {"rating": 5.0, "review": "Works great. We are enjoying it and purchased another for our daughter.", "verified": true, "helpfulness": "0/0", "author": "criss02003"}, {"rating": 5.0, "review": "Great for what it is and does. it is not a Roku but it is neat to broadcast web pages to the TV.", "verified": true, "helpfulness": "0/0", "author": "Chris Healey"}, {"rating": 3.0, "review": "I'm fairly impressed with it.  There's a lot of potential and I'm sure new apps are being developed daily.I'd like to see more group interactive apps.", "verified": true, "helpfulness": "0/0", "author": "Patrick J. Huser"}, {"rating": 5.0, "review": "I love this thing, turns my boring tv into a smart tv, I live on Netflix and have logged in plenty of hours with this thing with slim to no problems.", "verified": true, "helpfulness": "0/0", "author": "michael"}, {"rating": 5.0, "review": "Reliable product and it cheap too.", "verified": true, "helpfulness": "0/0", "author": "Hong C. Do"}, {"rating": 5.0, "review": "A gift for my friend", "verified": true, "helpfulness": "0/0", "author": "Andre Chevalier"}, {"rating": 5.0, "review": "I purchased my chromecast from amazon a few months ago, and all in all it is a great little device. Setup is extremely simple, and once you plug it in you can have it up and running in just a few minutes. I mainly use the chromecast to stream netflix, but with the recent updates to the chromecast app (which you have to download from your phone or tablet, its free btw) you can also mirror your mobile devices screen to your tv. This in effect alows you to watch any media you have on your device. All in all a great device with plenty of compatible apps and fantastic ease of use", "verified": true, "helpfulness": "0/0", "author": "brandon tingle"}, {"rating": 5.0, "review": "Good", "verified": true, "helpfulness": "0/0", "author": "rahulvarun balivada"}]