[{"rating": 4.0, "review": "It does a great job streaming video from my Android phone to my HDTV if the streaming service (Amazon Prime, Netflix, etc) support it. The only problems I have is that the initial setting it didn't go too smoothly (My TV didn't display what the instructions said I should be seeing) so I had to keep resetting the device as well as stopping and starting the App on my phone to finally get them to connect, and the HDMI connector isn't very secure so the video quality is degraded until I can seat it properly and get it to stay in that position. I have the connection problem on two TVs, so I'm blaming the device for this issue.", "verified": true, "helpfulness": "0/0", "author": "Computer savvy"}, {"rating": 4.0, "review": "I wish that more platforms worked with chromecast. Otherwise it works great.", "verified": true, "helpfulness": "0/0", "author": "citrus_warrior"}, {"rating": 4.0, "review": "There's plenty of media streaming devices out there but probably the most popular are the Google Chromecast, Amazon Fire Stick, Roku, and in addition to those there are tons of others.I picked up a Google Chromecast after some thought and evaluation among all of these choices - two of the biggest reasons being the popularity of the Google Chromecast as well as its amazingly cheap price, around $30 to $35 when I bought it.The Chromecast is hard to beat, being a simple, cheap and very popular media streaming device, controlled via your tablet, phone, or a desktop or laptop computer.That's it, pretty simple, huh?  It seems that way but for the price it does pack a lot of ability.The Chromecast runs on software based loosely on some developed for Google TV, according to a group of hackers who disassembled it's software.  The hardware, all on one little board; is a 'system on a chip', with 802.11b/g/n Wi-Fi, 512 MB of RAM and 2 Gig of flash memory, a male HDMI plug on one end, and a micro-USB port and LED and button on the other end, all packaged in a black case much smaller than the palm of your hand.In the current world of streaming video devices Chromecast is likely the most popular right at the moment (mid-2015), and indeed Google has stated that Chromecasts have handled over a billion stream requests with over ten million units sold in 2014.That's a heck of a lot for sure.For the relatively small coinage you get the ability to 'cast' from nearly any even faintly 'smart' device to most any modern TV or monitor via HDMI and with up to full 1080p capability. And it is possible to use it with older TV's that do not have HDMI, via adapters and converters.As I said above; there are other similar devices like Amazon's Fire Stick, the Roku, and tons of other ones as well as clones of the Chromecast and other devices that are Miracast-compatible (Miracast is just a standardized data transfer protocol for sending streaming data over WiFi).As a tech person I had a familiarity with Chromecast, as well as other standalone streaming devices.On our home network we have two desktops, two tablets, an iPod, our Smart TV, dumb TV's, Android smart phones, two DVD players, a server, and a few miscellaneous remote webcam and test computers connected, with most able to stream from and to most of the other devices.It sounds good in theory but leaves a lot of to be desired in practice.I hear people give others advice on tech, or advise me - and many times people's resolutions make the solution an even bigger pain in the rear.  It may work fine - but I want a simple way to do things, not a complex solution that I have to carry out every time I want to do something.  Technology should make things easier, and I don't want to Rube Goldberg what should be a simple task into something complicated.So unfortunately the apps on our Samsung smart TV frankly suck, and the DVD player apps aren't much better - one can only stream from the Internet, not from our network.  One computer connected to the TV handles most of the sharing work for that TV but it's a pain to have to control things via computer - even with nice little remote control apps and wireless mice and remotes.  Through into the mix our exercise room TV which I had for a time connected to the network via a decrepit junkheap of a computer I had lying around.  I have better things to do with my computers than having them used just for multimedia once in a while, and I have better things to do then to be plugging in, unplugging, connecting mice and apps, and generally finagling things around.  And then we have a bedroom TV, and a computer room TV - both of which we want the choice to stream everything to without connecting them to computers or other devices.So it was a Chromecast to the rescue.Inside the box is a little warranty info, the Chromecast itself, an HDMI extender, a USB power cable, and a power transformer with a USB port.  Just as simple as the device itself really.The HDMI extender is good for tight spots in the back of TV's but also gives the Chromecast a little distance from the side of the tv for better signal reception, it really makes a difference.  Since the Chromecast only has a tiny internal antenna this was a good move on Google's part.  I leave the extender on mine all of the time, no matter what TV I plug it into.Plug the Chromecast into the HDMI port on your TV, plug the USB cord into it and the other end either into the power transformer or the TV's USB port for power.  Most of our TV's USB ports provide plenty of power for it.  But some TV's USB ports may not and you'll have to use the power transformer.One thing to note here is that when it is plugged into the USB port on the TV it likely can not turn the TV on by itself - something it can do if it IS powered by its own power transformer.  The problem with this, in my opinion, is that if it's always on it is always quite warm.  And heat is kinda a bad thing for electronics so I don't leave mine plugged into something that is powered.  Just my personal preference, other's leave their's plugged in all of the time and have no problems.  Also, not all TV's are capable of being turned of by the Chromecast even if the Chromecast is always powered.Usually, whether you have it powered all the time or just when the TV is on - it can switch the TV to the correct input (one of the HDMI ports), but if you have something older you may have to manually switch it to that port via your TV's remote.Once the Chromecast is powered up all you do is go to http://google.com/chromecast/setup in a browser on a PC, Mac, or laptop (you will need the Chrome browser for this) or download the computer program (app), or download the app on your Android or IOS device.Eventually you will see an authorization code on both the TV screen as well as the browser/app you are using to set it up, you want to just verify they match of course and follow the easy instructions to get it all set up.There aren't a heck of a lot of options.  You can change the Chromecast's name, switch Wi-Fi, change time zone and format, language and see the firmware version as well as do a factory reset, a reboot, and check for Google offers.  You can also change the backdrop of Chromecast - which is what you see on your TV screen when you plug the Chromecast in and there is no device casting to it.  You can display stock images, your own photos, weather, artwork, and a few other things.You can also enable guest access if you want to allow someone else to cast something from their smart device but not give them full permanent access.One thing that needs improvement here is the switching of WiFi access points/routers/WiFi.  When you are connected it keeps the password but as soon as you go into the settings and switch to another you have to enter the password for the changes WiFi connection, even if you have used it before.  If you have multiple routers and access points in your home with different SSID's this can be a PITA, or use it elsewhere regularly.When I set up my Chromecast the process was easy and quick up until I tried to actually 'cast something.  It didn't work, but after perusing some website help about it, and checking the firmware version on the Chromecast (it was a VERY outdated) - the solution seemed to be to let it sit connected to the network for a while until it automatically updated.  It's updates are without notification - it just happens, and restarts itself.  This also happened a few other times initially right as I plugged it in.Once updated it worked just fine, except for very occasionally when there may be a little blip.  Most of the problems I have had are with the devices I am using to control it or stream to it and not the Chromecast itself.There's basically three ways to use the Chromecast; through an app that supports Chromecast and has a Chromecast button, Chromecasting all audio and video from your entire screen, or through a Chrome browser tab on a PC or Mac.You can see in the picture above-left that this particular Android app (Pandora) has a built-in Chromecast button (it looks like the example at right).  Any app that has one of these buttons will allow you to Chromecast directly from the app, no extra steps.  Click the button, select your Chromecast and after a few moments it will start playing the app on the Chromecast.Also, if your TV is on and switched to another input then casting an app will automatically switch your TV's input to the proper input (providing your TV allows this, most modern TV's should), and if the TV is off but the Chromecast is powered up it can turn your TV on too (again, some or most  TV's).As you can see in the above-right photo the Pandora app is running on my tablet, but it has sent a version of the Pandora app to the Chromecast so that the Chromecast itself is running the app (and playing the audio), all by itself and autonomously - the tablet is just a glorified remote control in this mode.So now the tablet is free to be used for other things.  In fact shutting down the app on the tablet or even powering down the tablet itself is not going to affect the app playing on the Chromecast.  The Chromecast will happily (figuratively) play the next song and the next song until Pandora times out at some point.  There's no overhead for the remote device itself, as everything is being done by the Chromecast.To stop an app from playing, or fast forward to another song, or to interact with the app running on the Chromecast - you use the original app on the device you initiated the Chromecast from.  Basically, you are using the device that you initiated the app from as a remote control.  The Chromecast itself has no dedicated remote (though a few people have hacked devices together to do this very thing) so you use your smart device as the remote.  This is one of the few downsides to the Chromecast, I believe that Google should have offered a remote as an option.I'd like to say that this is where the Chromecast really shines but it works just as well running it the other two ways (which I will go into in a moment), albeit with a few extra steps.The number of apps that have a built-in Chromecast button increases over time, right now there are quite a number of them though I wish some more of the TV networks would add the ability (at this time ABC is the only network that has included it in the Android version of their Watch ABC app), as well as companies like Time Warner and their app.  Here's a list of apps that have a Chromecast button from Google and here's a list of all apps that have Chromecast from Wikipedia.I found that the Chromecast works especially well for a special purpose that I needed it for.  While using the treadmill or exercise bike I wanted to display a running or biking video on the TV screen in our exercise room, but for audio I wanted to play a Pandora channel through the fairly good sound system we have in the exercise room.  I could do this without the Chromecast by using my laptop - by plugging the laptop's video output into the TV and opening a Youtube video in one browser tab while muting the video, start playing Pandora in another tab, and then switch back to the Youtube tab and making the tab full-screen.  But lugging my laptop to the exercise room along with a tray table to put the laptop on, plugging in the power and video cables, and starting and setting up the whole process was a PITA each time so I wanted something simpler.Chromecast was good for this purpose as I could offload the Youtube app to the Chromecast and start playing the video I wanted, mute the TV and play the music through the sounded system via my tablet.  Pretty easily done.  You can see my post about this, with some more info here.Another way to use the Chromecast is to cast the entire screen (as well as audio) from a smart device.This involves an extra short step - open the Chromecast app on your device, click the \"Cast screen\" option, select your Chromecast and your screen will mirror to the TV.  You can then play ANY app on your device and have it duplicated on your TV, including audio.  Not only apps but websites, video shared on sharing sites, games, cloud-saved photos, anything off your network, etc - anything that plays on your tablet will play through the Chromecast as far as I can tell.This works nicely for the most part, but if you have a slow device, bad WiFi, or have too many things running on your device you may see skips and drop-outs.  This likely won't be the fault of the Chromecast but of your device, as it must stream both video and audio out to your router or access point at the same time as it is doing whatever it is that you are asking it to do.  If it's playing video off the Internet it has to receive the video through your WiFi, play it on its own screen, and then stream all of that video back through the WiFi so that the Chromecast can receive it.  Likely most any newer smart device is going to be able to handle this pretty well, and probably your WiFi bandwidth is going to be able to also, but older devices or ones with lots running in the background may have the occasional stutter.  Possibly more limited or cheaper devices with less power may also have problems (see my review of the Asus MeMO Pad 7).Expect an occasional stutter under even the best conditions.  But for the most part it works very amazingly nicely.  You can even play games, and video conference this way.  Just be aware of a slight delay, depending on your devices and network.You can also play video and audio and photos off your network or from other devices connected to your network.  There's various ways to do this, like using Plex but I like to use the excellent and free ES File Explorer and browse around to what I need manually.  I can explore any compatible device on my network, pick the file I want to stream, and click it.  I also use VLC as my default video player, and this is Chromecast-friendly itself.If you use Google's browser Chrome on your PC or Mac you can also use your computer to cast Chrome tabs directly.Make sure your Chromecast is plugged into your TV.  Then you need the free Chrome Extension from the Chrome Store.  Once that is installed you click it, choose your Chromecast and it will start mirroring your tab to the TV.  It's that easy, and most anything (with some exceptions) in that tab is going to be sent to the Chromecast.  To stop just close that tab, or click the stop button in the extension.In the Chromecast extension you can also select options and choose your video quality, which can be good if you are getting stuttering.  Also, in the upper right-hand corner of the extension is a small drop-down box that can be opened via a little down-arrow.  This gives you some more options including optimizing the tab for audio and an experimental ability to cast your whole screen, when clicked it will pop up and give you the option of tabs or screen (if you have multiple monitors).  'Experimental' as I mentioned - I had mixed results with this.Using Chrome to cast works just as well as the other two methods of using the Chromecast, and the fun thing about this is that if you open a website that has an accompanying Chromecast-compatible app, like Youtube, instead of showing just the Chrome tab it loads the app and plays it.Sometimes hotels or motels require that you to click a terms of service \"agree\" button, or enter a room number or password.  Some also block access between devices on the network.If the hotel room has a hardwired network connection you can bring along your own router and plug it in, connect to the router with another device and go through the authentication process and then you're set to use the Chromecast on the router's WiFi.But if there is no ethernet port in the room you either are out of luck, must use your phone's hotspot options (thus using your own bandwidth), or you can try cloning the Chromecast's MAC address on your laptop, getting logged in, and then release the MAC address and plug in the Chromecast.I haven't tried this but I believe that if you can't find an ethernet port in you room and instead of spoofing the MAC address; you could use a hacked router in repeater mode (or a repeater), authenticate the hotel/motel's connection with another device through this router, and then connect with the Chromecast to the router and carry out the same thing.  The benefit of this is that you could set up the Chromecast and router ahead of time, for the most part - except for the hotel/motel's SSID and such.  The only caveat would be a slight decrease in bandwidth when using the router in repeater mode, but probably not enough to affect your streaming.ConclusionAs I said earlier - for the price you really can't go wrong.  Even if you have a device similar to this already the price is so cheap that it might even be worth it to get another so that you don't have to plug and unplug things and transfer your device from one tv/room to another.If you don't mind paying a bit more and need a faster streaming device, or one with more storage, or need a remote control then you can go with something like the Amazon Fire Stick.But if you want a cheap and relatively easy to use and slickly-working piece of streaming electronics then the Google Chromecast may just be what you are looking for.  You can even find some cheaper clone versions of it if you look around, though I don't know how well these clones may work.The only downsides to the Chromecast would be the lack of a dedicated remote, and somewhat more limited resources than some of the other streaming devices.  Personally, I haven't seen that the latter is an issue in any way though I would love to have a dedicated remote control.It is a nice little device, and a cheap way to get streaming for any TV - even those with their own limited streaming apps.  An additional note - don't rule out new features being added as time goes on, via updated firmware and updates apps.I have a few more pics in my blog post - http://randombitsbytes.com/review-google-chromecast/ and I also go into using it with the treadmill and stationary bike for displaying video but listening to separate audio - http://randombitsbytes.com/bored-treadmill-indoor-bike-trainer-elliptical-get-chromecast/", "verified": false, "helpfulness": "3/3", "author": "Lectrichead"}, {"rating": 5.0, "review": "Great product!! Cheap and very useful. Love it and will recommend it to others. Very easy to use.", "verified": true, "helpfulness": "0/0", "author": "CJ Perez"}, {"rating": 5.0, "review": "shipping was Fast and Chromecast works perfectly. Thanks.", "verified": false, "helpfulness": "0/0", "author": "Luz Diaz"}, {"rating": 5.0, "review": "Works great.  Does what it is suppose to at a decent price.", "verified": true, "helpfulness": "0/0", "author": "Nikoli"}, {"rating": 5.0, "review": "I bought it just beacuse a friend recommended it. I love it! It's AWESOME!", "verified": true, "helpfulness": "0/0", "author": "Dbon"}, {"rating": 2.0, "review": "Does not work as well as Roku plus no remote", "verified": true, "helpfulness": "0/0", "author": "laura miller"}, {"rating": 5.0, "review": "Best 30 bucks I ever spent", "verified": true, "helpfulness": "0/0", "author": "timothy m"}, {"rating": 5.0, "review": "The best product I bought so far.", "verified": true, "helpfulness": "0/0", "author": "richardson0327"}]