[{"rating": 3.0, "review": "The good:* Simple to set up.* Great picture quality, full 1080p.* Easy to operate with your favorite Apple or Android gadgets.* Supports Netflix, YouTube, Hulu Plus, and now Pandora. More to come, I'm sure.* For unsupported media streams, anything that plays in a Chrome browser (on a reasonably beefy system; my 4-year-old laptop can't handle this) will also work on Chromecast. Just takes some extra fiddling.The bad:* My aging plasma TV doesn't support HDMI 1.4, so the screen doesn't turn on to the Chromecast channel when I start watching stuff. Where's my TV remote? Annoying.* No separate audio outputs, so my surround speaker system goes unused until I splurge on an HDMI audio breakout connector that costs more than the Chromecast itself. Yeah, that won't happen. A darn shame.The ugly:* The silly thing never turns off. Turning off the video signal when the device isn't in use would let my screen behave corretly when the video starts.* Buggy, buggy, buggy. Most notably, YouTube videos often require me to hit \"play\" several times before the video starts. Waiting isn't good enough.", "verified": true, "helpfulness": "0/0", "author": "Anders Bylund"}, {"rating": 3.0, "review": "Chromecast was easy to install and use. Works great with YouTube and Netflix, but I was under the impression that if I saw it on my iPad, I would be able to see it on my flatscreen.  Once in a while, my iPad won't find the chromecast and it becomes a pain. I am confident with time that google will upgrade a lot of software so it works with more apps.", "verified": true, "helpfulness": "0/0", "author": "Delbert Stapp"}, {"rating": 5.0, "review": "I love this! I watch a lot of Netflix, and Youtube and I was incredbly tired of paying $60+ a year for Xbox live Gold just to watch those on my TV. Now I can control this easily through my smartphone, and I don't pay any yearly fee!", "verified": true, "helpfulness": "0/0", "author": "Evan \"Game Master, Gamer, DIY Enthusiast\""}, {"rating": 1.0, "review": "Google Chromecast is a Piece of Crap, Total Crap, so don't even think about getting one or dealing with Google...wasted hours trying to activate it to the point where Google owes me, and the rest of us, big bucks for our time.  Google deserves nationwide class action suits and the rest of us are entitled to a free device that actually works within seconds, not minutes. And should it take hours, hope the ambulance of lawyers slap on more class action suits and collect big fees and punitive damages.  How Google can be so shameless, arrogant, and self-deluded with this piece of S*** is beyond me.  But then again, witness Polaroid and Xerox.  Sergei, Teller, etc., are you listening?  This should be another wake-up call for your strategy and for your incompetent honchos.  And you people at Amazon should be sued for aiding and abetting a massive fraud that you knew or should have known about based on your own buyer comments and reviews.  Shame on you Amazon.  And shame on you Google for insulting our intelligence and kindling our wrath...", "verified": true, "helpfulness": "0/11", "author": "Metaphysics"}, {"rating": 4.0, "review": "Fantastic product that still needs further development. Sadly the only real streaming video site that pairs with this is netflix. I'm a huge fan of amazon prime video and it simply won't stream. There are apps in development for all streaming sites but they are not completed yet.", "verified": true, "helpfulness": "0/0", "author": "Michael Cole"}, {"rating": 2.0, "review": "I have different device for streaming media but I haven't experience problems than using google Chromecast. Unfortunately, i can't find the device all the time! sometimes it works fine and most of the time doesn't work. I send message to google explaining my problem but their answer looks like they didn't read my explaining because I told them in my message that the solution in their website doesn't work with me at all. But they send me again the same step solutions that I already tried it.Bad customer service after sales.", "verified": true, "helpfulness": "0/0", "author": "Ahmed Abuhamad"}, {"rating": 4.0, "review": "Cool gadget. Unless you're watching a lot online, the novelty will fade pretty fast. It works as it is supposed to though!!", "verified": true, "helpfulness": "0/0", "author": "S. Cherry"}, {"rating": 5.0, "review": "the main draw for me with the Chromecast was the ability to take it anywhere, mainly on trips where i'm visiting people, and plug it in and have the music and movies available. I don't even do it that much, but the idea of building a collection of purchased media that is portable is more attractive to me than spending money for digital copies that are accessible in just once place. Controlling it from my phone is just awesome, and now I actually have a reason to spend money on a digital library of movies.", "verified": true, "helpfulness": "0/0", "author": "Bill Ahern \"technologist\""}, {"rating": 4.0, "review": "This thing works great and you can stream anything that you can play in the Chrome web browser. For local content, just drag and drop into Chrome, and it will play on your TV! Would be nice if it would store multiple SSIDs for portability though!", "verified": true, "helpfulness": "0/0", "author": "Dan Marafino"}, {"rating": 5.0, "review": "I have several Rokus that can't stream youtube and a modern large Panasonic Plasma and a large Sharp LCD that do stream youtube terribly.This device fits works seamlessly with all of the Android and IOS devices in the house for control and I would definitely recommend it as a great value.", "verified": true, "helpfulness": "0/0", "author": "Dustin Aldridge"}]