[{"rating": 5.0, "review": "Now with HBO GO, it is definitely worth $35. Will only get better with more services like screen mirroring and Spotify.", "verified": true, "helpfulness": "0/0", "author": "Justin R"}, {"rating": 5.0, "review": "This is an amazing product! I can be on my tablet or iphone and throw a video up on my TV and it's right there! The commercial has it right! Simple, easy to use and fun! Thanks again Google for a terrific product!", "verified": true, "helpfulness": "0/0", "author": "klp"}, {"rating": 3.0, "review": "Would have need amazing but doesn't work with my internet set up. Before you buy this look in to was type of internet you have before and make sure it compatible.", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 3.0, "review": "I wanted to be able to watch Netflix in my bedroom...I want to get an Apple TV but I figured I'd give this a try for $35 bucks first. Set up was super easy, had no problems took just a few minutes. Picture quality looks really good too. I typically watch Netflix from the Xbox Live and I like how when you are watching a series it will automatically play the next episode...this doesn't do this. My Iphone will go into sleep mode, like the screen turns off when you don't touch it for awhile. The problem with this is I have to go back into Netflix and try and pause or find the other episode. I have kids, animals, and a husband which I need I usually have to pause the TV a lot...this doesn't pause fast enough for me, especially if my phone goes into sleep mode, its actually a pain. Now if you were going to sit down and watch a movie with no interruptions this would be great...guess it depends what you're used too. It's okay, I like it and for price its a good deal, so I'll keep it...we will find another use for it. I'm going to ask Santa for Apple TV though.", "verified": false, "helpfulness": "1/1", "author": "IrishErin"}, {"rating": 5.0, "review": "Fantastic! I've been enjoying the option to stream my Hulu videos from the Computer downstairs to the TV upstairs. I highly recommend the Chromecast to anyone with a few PCs and multiple HDMI enabled TVs. Now the house feels more connected.", "verified": true, "helpfulness": "0/0", "author": "NONAME"}, {"rating": 3.0, "review": "Over all, is ok. It does what it promised, but from time to time it goes crazy and it takes a full reset for the dongle to see the network again. I am not too impressed as the whole complex ( Google / Youtube / and this dongle ) will only allow you to see SOME videos on your tv, not all.", "verified": true, "helpfulness": "0/0", "author": "John S. Smith"}, {"rating": 5.0, "review": "Works as expected, crystal clear netflix on my non-smart tv set....  slight problem with loading google chrome on my laptop, I think because I have an older version on windows, but got it working.", "verified": true, "helpfulness": "0/0", "author": "Fan of Mark Lane"}, {"rating": 5.0, "review": "I love it!!! Excelent perfomance playing videos from netflix and youtube. Very easy to setup an very easy to use with a smartphone or tablet", "verified": true, "helpfulness": "0/0", "author": "Francisco Mellado K \"FMK\""}, {"rating": 4.0, "review": "It's a pretty neat device! It'd be nice if developers didn't have to wait and to be approved to use Google's api.", "verified": true, "helpfulness": "0/0", "author": "Adam Bradford"}, {"rating": 2.0, "review": "Not what I was thinking it was, not really an apples to apples with Apple TV.  Dont buy if you are expecting that.", "verified": true, "helpfulness": "1/1", "author": "Amazon Customer"}]