[{"rating": 4.0, "review": "Only thing that kept me from giving it five stars was that there is a little bit of lag sometimes, otherwise it would get 5 stars.", "verified": true, "helpfulness": "0/0", "author": "Julie Edwards"}, {"rating": 5.0, "review": "Great product and easy to use. Lots of apps to use with in iOS and android environments.", "verified": false, "helpfulness": "0/0", "author": "Abraham"}, {"rating": 1.0, "review": "My Roku and Apple TV work with both my TVs, but Google's device fails and offers no useful configuration guidance.\"reconnect me\" is its most specific technical advice. On the Android tablet end, I get \"we recommend not stting up this Chromecast until you can verify the PIN.\" Which I cannot. A Google device at any price point should at least guide the user thru the configuration task and work as advertised.", "verified": true, "helpfulness": "0/1", "author": "James Egitto"}, {"rating": 5.0, "review": "Works great!", "verified": true, "helpfulness": "0/0", "author": "Shayne Paykel"}, {"rating": 4.0, "review": "Good buy", "verified": true, "helpfulness": "0/0", "author": "John M Reilly"}, {"rating": 5.0, "review": "This is great when you can get it near a wireless router so that the signal is strong. My signal was not at first and I was getting frustrated. I purchased the TP-LINK TL-WPA4220 300Mbps AV500 WiFi Powerline Add-On Extender (I already had a powerline adapter by my router) and it fixed the problem. I now love the Chromecast stick.", "verified": true, "helpfulness": "0/0", "author": "BigRig61"}, {"rating": 5.0, "review": "Great", "verified": true, "helpfulness": "0/0", "author": "Tiago"}, {"rating": 4.0, "review": "Very nice little device for when my niece and nephew come over and want to YouTube it or watch Netflix, Vudu, etc. Took a while for me to set up because it didn't pick up a strong Wi-Fi signal, but it eventually got it and works great.", "verified": true, "helpfulness": "0/0", "author": "RickW"}, {"rating": 5.0, "review": "It's easy to set up and use, and has very smooth streaming. Love it", "verified": true, "helpfulness": "0/0", "author": "Britton Clay"}, {"rating": 1.0, "review": "BUYER BEWARE CHROMECAST IS TOTAL JUNK AMAZON NOT HELP OUT, BAD OUT OF BOX.", "verified": true, "helpfulness": "0/2", "author": "Louis G."}]