[{"rating": 5.0, "review": "GREAT USER & PRODUCT.. LOVE WATCHING YOUTUBE & OLD ROCK VIDEOS ON MY 60\" TV", "verified": true, "helpfulness": "0/0", "author": "Steve W."}, {"rating": 5.0, "review": "Works great. Hooks it up to an HDMI port on your TV, follow the easy setup instructions, and you are all set. I have a spar USB port on my TV, so I didn't need to use the power adapter.With the recent announcement at Google I/O about Android mirroring to the Chromecast, I'll be ordering at least two more of these.", "verified": true, "helpfulness": "0/0", "author": "Jonathan B."}, {"rating": 3.0, "review": "Can`t get it to work om y laptop, even after calling the service people", "verified": true, "helpfulness": "0/1", "author": "Lester H Garber"}, {"rating": 4.0, "review": "Very nice product, works excellent on youtube but needs non Google dedicated applications with photos and videos.It would be even much better if it had screen mirroring capabilities because it does not broadcast directly from the gallery yet, but it I think it's only a matter of time.", "verified": true, "helpfulness": "0/0", "author": "Gerardo Gonzalez"}, {"rating": 5.0, "review": "I bought it to have netflix and it works great", "verified": true, "helpfulness": "0/0", "author": "Gabriel Caldano"}, {"rating": 5.0, "review": "Love, love, love it. Set up is a cinch and it works brilliantly with Netflix and HBOGo", "verified": true, "helpfulness": "0/0", "author": "Richard"}, {"rating": 1.0, "review": "Such a fuss for nothing . All you can use it for with your phone is for YouTube and Netflix , which I can already access with my blue ray player . I thought I was gonna be able to face time and view it on the big screen. I find this product useless", "verified": true, "helpfulness": "0/1", "author": "Javier Espino"}, {"rating": 5.0, "review": "Work very well.", "verified": true, "helpfulness": "0/0", "author": "Junior Ferri"}, {"rating": 3.0, "review": "Well, weve all read the reviews and it does what its meant for. What i think it lacks is more creativity in the app availability. Eg adaptation to games or simpler apps. Started having problems with the chromecast app with netflix for gs4, i think its a common issue and support is working on it.", "verified": true, "helpfulness": "0/1", "author": "SEBASTIAN BRUNO"}, {"rating": 5.0, "review": "purchase arrived in the estimated time, it is a great buy, now I can take all the content on all tvs internet, browser, netflix etc.", "verified": false, "helpfulness": "0/0", "author": "eacuna"}]