[{"rating": 1.0, "review": "I hooked this up with my MacBook Pro. If you're just going to stream videos from YouTube and have a Netflix account, this is for you - as long as you don't mind lagging videos. Quick solution? Adjust the settings so you can see the videos with LESS lag in 480p (that looks soooo good on HD TVs - sarcasm intended). I don't have a Netflix account - I have an Amazon Prime account (and with it Prime video) so no need for Netflix. (Speaking of Amazon Prime Instant Video, let's get with the HD streaming on Mac, Amazon!) so the only thing I can really use this for is YouTube videos.I have an Apple TV on a separate TV and that streams flawlessly and there are no limitation; if I can see it on my computer, I can see it on the TV - anything and everything (pics, videos, music, Office, anything).Pros:Cool pictures on the screensaver!Relatively inexpensiveCons:Limited uses (YouTube and apparently NetFlix work)Lagging videosIt's waste of money.", "verified": false, "helpfulness": "1/2", "author": "R. Jones"}, {"rating": 3.0, "review": "Appearance is fine. but i think it is not so useful. I may use this again, if google do update more app for chromecast.", "verified": true, "helpfulness": "0/0", "author": "Hyegyung"}, {"rating": 5.0, "review": "more than what i expected at the price, the very next day i bought it, streaming local media via plex was announced.", "verified": true, "helpfulness": "0/0", "author": "srinivas"}, {"rating": 1.0, "review": "Google makes things that Google doesn't support. Another misfire. Google on my Android phone does not support Chromecast and their app doesn't allow me to do anything except buy more apps that do nothing. False advertising. This is just like you can't get Google toolbar for Google Chrome!", "verified": true, "helpfulness": "1/2", "author": "William H Henderson"}, {"rating": 4.0, "review": "Great device, not quite as smooth transitions as Apple TV. Absolutely better for it's monetary value. You just can't beat $35", "verified": true, "helpfulness": "0/0", "author": "Austin Eiler"}, {"rating": 1.0, "review": "Never connected with my wifi. Extremely disappointed with product. I'm not that goofy that I don't know how to set up a home network or pc. The directions were clear and straightforward. I downloaded the app and follow the instructions. Every time I get it to connect to the wifi as soon as it tried to authenticate,  it disconnected from the wifi and say I was not connected.  After about 5 attempts,  I just quit. Plug and play it is not. I factory reset, plugged it into the wall, into the TV... Nothing. The TV detected the device - never found wifi signal even with the unit sitting directly next to it.I'll wait for the 18 months Google decides to update the unit.  In the meantime I'll just buy a cable and hook my phone up the old fashioned way.", "verified": true, "helpfulness": "1/2", "author": "Amazon Customer"}, {"rating": 2.0, "review": "while this product appears to work it losses connection with my network after a few seconds...obviously this device needs a more robust network than I have.", "verified": true, "helpfulness": "0/0", "author": "Mike Pulliam"}, {"rating": 2.0, "review": "This is pretty lame, you need a pay for subscription for most of the HD content, you can cast your Chrome Browser but it runs so slow and choppy you have to downgrade to SD and get a crappy picture.  for $35 it was worth the try, at least now I can get all FREE music videos from VEVO which is fantastic.", "verified": true, "helpfulness": "0/0", "author": "SAL"}, {"rating": 5.0, "review": "I purchased 3 of these and it makes so much sense to use this to access Netflix, etc. on your TV.  Great Price too.", "verified": true, "helpfulness": "0/0", "author": "D.L. Cook"}, {"rating": 5.0, "review": "Bought it for my brother in law! He loved it and can't wait to use it with his tv and computer.", "verified": true, "helpfulness": "0/0", "author": "Rachelle Ragnar"}]