[{"rating": 5.0, "review": "What a huge selection of shows, movies, games and music. I am considering getting rid of cable now. Very easy to install. Very easy to find what I am looking for. The only con I see so far is when you choose a movie or show that you have to buy it gives you the most expensive option in a big bold highlighted box but to the far right in a much smaller un-highlighted box it says more ways to watch and there are cheaper option like SD vs HD or a rental.", "verified": true, "helpfulness": "0/0", "author": "Sharon Collins"}, {"rating": 1.0, "review": "Wouldnt Load any Movies. Unit had a problem at the start with the Welcome Video playing 1/3 speed had to Reset the Plug. After picking Movies from Amazon Prime Video it wouldnt Play any Movies. Refund !", "verified": true, "helpfulness": "1/4", "author": "Joseph bonanno"}, {"rating": 5.0, "review": "I already have a Roku and AppleTV and was surprised that the Amazon Fire TV beats them both. Why?1. Obviously the voice-search (and you can also search via keyboard if you wish, but it's a pain).2. Easy and comfortable access to your Amazon movies/music3. The interface is really smooth, and I love that I can look at IMDB immediately after watching a movie (which I used to do on a laptop/tablet manually).4. The apps are fun.5. Non proprietary- you can watch Amazon Prime or Netflix. So it still makes sense if you don't have Amazon Prime, although it's far better if you have it.Downsides?1. Many of the games require the overpriced game controller, which stinks. Some use the remote that comes with it.2. I had some initial problems with the remote... took some digging to figure out how to reconnect it (after ruling out batteries don't work). The problem is that there's no indicator that tells you the remote is even functioning or has batteries.It's a little more difficult to get into my Netflix collection, but it's there.3. Can't figure out how to stream my non-Amazon movies sitting on my Mac laptop. Hopefully an app solves that.Roku has some advantages with the version that comes with headphones attached to the remote, although I use this feature less than I expected. AppleTV, while an initial bold leader, hasn't evolved and only makes sense to access your Apple purchases. It's a lot of work to convert a Mac desktop movie to play on AppleTV.", "verified": true, "helpfulness": "2/2", "author": "Nalts \"Kevin \"Nalts\" Nalty is the author of \"Beyond Viral,\" and a career marketer who has 250 million views on YouTube.\""}, {"rating": 4.0, "review": "I love being able to stream Hulu, Netflix and Amazon Prime  shows and movies on my TV. Happy with my purchase.", "verified": true, "helpfulness": "0/0", "author": "Kindle Customer"}, {"rating": 3.0, "review": "The hardware is great, once it has more apps like mlb.tv, I'm sure it will have most of the important ones a year from now, then it will be a 5 star device.", "verified": true, "helpfulness": "2/5", "author": "M.D. Stanford"}, {"rating": 1.0, "review": "My original review was a Five star until 6 months later when I was having trouble viewing Netflix. I noticed that while viewing my Netflix movies there was sporadic freezing; frame freeze with sound still playing. I went through all the items on Amazon's help link to correct the issue which didn't work.My next step was to contact tech support. After talking to three different tech support individuals and running through more procedures to correct the issue, it still didn't work. Amazon's conclusion was that it was my router, that it didn't put out a strong enough signal for the Netflix app for this devise. I have two TV's that use the same router, one in the living-room and the other in the bedroom next to the router. The tv in the bedroom has no problem with the Netflix app..Here I'm left with having to decide whether I need to purchase another router or try another devise, Amazon would not refund or replace this devise after 6 months.So I purchased a Sony Blu-ray player with the same apps and installed it. Guess what it works great! The freeze frame is gone and I can watch my Netflix again.Because I felt that I can't use the Amazon Five TV because of the problem mentioned above, I should be entitled to a refund or credit. I contacted Amazon Customer Service and explained everything to them. At first they tried to tell me that is was the fault of my internet provider, which was hog wash, my other TV worked fine. They wouldn't budge, NO REFUND, NO CREDIT! I was told I could sell the devise to someone. My response was how could I honestly sell something that is defective?Bottom line is that I was left with a $99.00 devise I couldn't use or sell so I decided to cancel my Amazon Prime if this is the way their going treat a long standing customer.", "verified": true, "helpfulness": "0/1", "author": "Raymond Riha"}, {"rating": 4.0, "review": "This is good but it really, really wantts you to watch Amazon movies; the interface feels more like an ad than a user interface. It lacks the personality and friendly feel of the Roku3. It's fast and there's not really anything wrong with it, but I feel like I turned my back on an old friend, the Roku3, in favor of of the new popular kid that everyone's talking about", "verified": true, "helpfulness": "0/1", "author": "J. Hall"}, {"rating": 4.0, "review": "as far as a streaming device is concerned, this works well.  there have been a few hiccups with netflix but those may be a netflix issue.", "verified": true, "helpfulness": "0/0", "author": "JR"}, {"rating": 5.0, "review": "the Amazon Fire was very easy to install and opreate, just as advertised.Still learning but this will ba a great entertainment addition to our home.", "verified": true, "helpfulness": "0/0", "author": "Edw. C. Chandler Sr."}, {"rating": 4.0, "review": "I've been an diehard AppleTV fan for a couple of years now. I don't have cable or the tiny satellite dishes, I do get over-the-air (which I'm very happy with). I just recently replaced my old 300 lbs. tv with a new one and figured I'd also get the Amazon Fire TV. It's great! Gary Busey was right the voice search feature is the best! The speed in which this thing returns search results is amazing. The speed that TV shows or movies you want to watch start up is like, FIRE! Pun intended. I really don't think you'll be disappointed in this. Just remember to order an HDMI cable when you order the Amazon Fire TV because it doesn't come with one.", "verified": true, "helpfulness": "0/0", "author": "S. Jeffries"}]