[{"rating": 5.0, "review": "It only took five minutes to install and get everything set up.  We will be getting another one very soon!", "verified": true, "helpfulness": "0/0", "author": "jennifer kramer"}, {"rating": 4.0, "review": "Obviously early days yet so once it has full media streaming abilities I.E play items from my own library then this will be a top notch product.", "verified": true, "helpfulness": "0/0", "author": "Simonw"}, {"rating": 3.0, "review": "I've been having some issues with it. It overheats and then disconnects with the internet. It is a decent device.", "verified": true, "helpfulness": "0/0", "author": "Marlayna"}, {"rating": 4.0, "review": "It works very well when streaming youtube from the android or chrome browser on my pc, but doesn't allow to stream much more from the android, and when streaming a video from the chrome tab on my PC, the speed is really slow.If more applications or interfaces to stream to it are produced, it will keep to be a great addition to both my work environment, and home lifestyle.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer \"tico dan\""}, {"rating": 5.0, "review": "Works as advertised with excellent image quality and convenience. Very reasonably priced for what you get in such a small unobtrusive package", "verified": true, "helpfulness": "0/0", "author": "Parkerproductions"}, {"rating": 1.0, "review": "Good idea but it basically doesn't work. I tried it on two different routers. You have to throttle down your wifi network for it to even connect and, even then, the connection in unreliable and it uses up all the bandwidth on the network.", "verified": true, "helpfulness": "0/0", "author": "Patrick J Liddy"}, {"rating": 5.0, "review": "Works great. Don't have to buy a smart TV now. Saved us 100s of dollars. Wonderful product. Would recommend this to anyone who is looking to buy a smart TV first.", "verified": true, "helpfulness": "0/0", "author": "Glenn White"}, {"rating": 5.0, "review": "Chromecast is the best option for those that do not have a smart tv. You can't beat the functionality or the price. You just plug it in, enter your wireless network password, it runs an update and you're done. So easy to set up and use. Google did a great job with this product. I have given this to all my friends that don't have a smart tv and they all love it.", "verified": true, "helpfulness": "0/0", "author": "Javier Capo"}, {"rating": 5.0, "review": "It's easy to use and do the job with no problem.The easiest way to stream contact to your TV", "verified": true, "helpfulness": "0/0", "author": "Shai Israel"}, {"rating": 3.0, "review": "INTERESTING PRODUCT IT HAS POTENTIAL TO BE GREAT...IT IS JUST NOT GREAT YET...VERY GLITCHY...KINDA LIKE WANNA GIVE UP AND JUST PLAY A DVD...BUT I HAVE FAITH IN GOOGLE AND IN TIME IM SURE IT WILL BE FUNCTIONING LIKE A WELL OILED MACHINE...SO FOR 30 DOLLARS WHAT THE HECK...GIVE IT A TEST RUN AND PREPARE FOR IT TO BE BETTER IN THE FUTURE", "verified": true, "helpfulness": "0/0", "author": "LordDietrich \"█ ▄█▀ █ ▀█▀ █\""}]