[{"rating": 5.0, "review": "My favorite little tool ever. I can watch anything from my computer or phone on my tv instantly. I also love that it displays my photos as a screen saver", "verified": true, "helpfulness": "0/0", "author": "Stefanie Lynn"}, {"rating": 5.0, "review": "had the apple, this is cheaper and ten times easier and there is no little remote", "verified": true, "helpfulness": "0/0", "author": "Charles M."}, {"rating": 3.0, "review": "The one weakness with this product is that it needs a really strong wi-fi signal. My TV is well away from my router and the signal is average at best. A weak signal makes this product unusable. Choppy, constantly buffering and endless hanging while it tries to do its magic has been my experience. I do understand that its my problem not having a decent signal because on the odd occasion when the signal is strong this works really well. I plan to buy the Ethernet adapter that is available for this and put an end to slow flaky wireless connections. If you are not sure about the strength of your signal there is a free android app called Wifi Analyzer that displays signal strength.", "verified": true, "helpfulness": "0/0", "author": "carjam \"carjam18\""}, {"rating": 5.0, "review": "Excellent product", "verified": true, "helpfulness": "0/0", "author": "ed40288"}, {"rating": 5.0, "review": "Great product, no issues, you only need a very good internet connection.", "verified": true, "helpfulness": "0/0", "author": "LuRoggio"}, {"rating": 2.0, "review": "Extremely difficult to configure.  If you're looking for a streaming device that doesn't require a lot of time to install and use try one of the other devices.  I can't speak for all of the other devices but I have 3 Roku devices all of which we much easier to configure and use. I'm on day 2 with my Chrome device and still trying to get it to work as advertised.  The idea of using your phone, iPad, or tablet as a remote is a neat idea but after this experience I'd opt for a product with its own remote.  However, if you love puzzles buy a Chrome Cast device!", "verified": true, "helpfulness": "0/0", "author": "allen Hegarty"}, {"rating": 5.0, "review": "Seems like it would have been a great device , only it didn't work over my schools wifi in my dorm! I could power mine via the tv.It can be personalized when set up such as background. Really wish I could have kept it !", "verified": true, "helpfulness": "0/0", "author": "Randyn"}, {"rating": 5.0, "review": "Have 2 of these things, way way cheaper than paying for the cable bill. we could not cut the cord without these things. Netflix and Hulu cost a total of 25ish a month between the two of them and we can watch what we want when we want... my local cable service wants to charge $130 a month for basic cable, you do the math.", "verified": true, "helpfulness": "0/0", "author": "Seth Hoar"}, {"rating": 5.0, "review": "Great product, great price and quick shipping", "verified": true, "helpfulness": "0/0", "author": "Stephen C Davis"}, {"rating": 5.0, "review": "Love my chromecast. Opens up a whole new world of entertainment", "verified": true, "helpfulness": "0/0", "author": "ronny"}]