[{"rating": 5.0, "review": "Outstanding! Should have done this earlier. As a Prime member, I saved money as well because there is no further need for satellite TV provider's movie channels.", "verified": true, "helpfulness": "0/0", "author": "Barbara"}, {"rating": 5.0, "review": "Excellent", "verified": true, "helpfulness": "0/0", "author": "Kyle N."}, {"rating": 5.0, "review": "Love it! Best money every spent!", "verified": true, "helpfulness": "0/0", "author": "Tiffany Conley"}, {"rating": 5.0, "review": "Easy enough for my 3 year old to operate.  My kids love the games and we bought the wireless game controller to go with it.", "verified": true, "helpfulness": "0/0", "author": "momto2boys"}, {"rating": 5.0, "review": "Love this box...so easy to side load additional content, integrates easily with the rest of my entertainment setup and super portable!!", "verified": true, "helpfulness": "0/0", "author": "Lael H."}, {"rating": 5.0, "review": "I bought the Amazon fire, it was a best buy...works great!  I would definetly buy the fire versus the stick.....you can rewind pause....quality of picture is great no lag......can 't complain....", "verified": true, "helpfulness": "0/0", "author": "Stone"}, {"rating": 5.0, "review": "good.", "verified": true, "helpfulness": "0/0", "author": "pinakin"}, {"rating": 5.0, "review": "This is a great device.  Works extremely well.  I am currently cable free using Tivo OTA, Netflix, Showtime, Amazon Prime, and Sling TV.  Total cost including my Internet access saves me over $75 per month. I'm using the Fire TV for everything except the OTA broadcasts which I record with the Tivo.", "verified": true, "helpfulness": "1/1", "author": "Mark D \"Mark in DFW\""}, {"rating": 1.0, "review": "We assumed it was like net flix where you pay for a subscription and down liad all for free. We paid $100 for a box and didnt get anything for it", "verified": true, "helpfulness": "0/6", "author": "laura1313"}, {"rating": 5.0, "review": "I've had apple tv's for several years and recently ditched them for the Fire TV hoping for a better experience. Boy was that a good idea! These remotes are WAY better because they're bluetooth and don't require line of sight (especially nice when laying in bed). Also, the overall functionality of the operating system provides a much richer experience. The back button, the home button, the menu button. I get that Apple wanted to keep their ATV remote simple, but it came at the cost of utility. Amazon got it right with the Fire TV. So much better! We now have two in the house.", "verified": true, "helpfulness": "0/0", "author": "Eric F \"40\""}]