[{"rating": 5.0, "review": "Love it!", "verified": true, "helpfulness": "0/0", "author": "MotherDuckBowls"}, {"rating": 5.0, "review": "Love it....better than cable", "verified": true, "helpfulness": "0/0", "author": "Donald Reed"}, {"rating": 5.0, "review": "Just what my wife wanted!", "verified": true, "helpfulness": "0/0", "author": "Alasdair Conn"}, {"rating": 3.0, "review": "I'm disappointed that even with Hulu I can't even watch CBS' latest episodes of Hawaii 5-0 Blue Bloods and I was charged $2.99 to see that last Big Bang Theory Episode. I'm disappointed as the impression of what one can get and the reality aren't the same. Even with Prime Membership one is limited. Can't get AMC \"Hell on Wheels\" without paying for each episode Etc. I plan to return the unit soon.", "verified": true, "helpfulness": "0/3", "author": "Roger Willert"}, {"rating": 5.0, "review": "So simple to set up and operate!", "verified": true, "helpfulness": "0/0", "author": "Kathy in CT \"book addict\""}, {"rating": 5.0, "review": "It was easy to set up, and it's really fast!", "verified": true, "helpfulness": "0/0", "author": "Lynn D. Black"}, {"rating": 5.0, "review": "great", "verified": true, "helpfulness": "0/0", "author": "Robert L. Hildom"}, {"rating": 4.0, "review": "Love the Amazon Fire TV device and all the continuing updates.. Should have purchared a long time ago..", "verified": true, "helpfulness": "0/0", "author": "Gerard Johnson"}, {"rating": 5.0, "review": "I absolutely love it.  There is so much for everyone in the family.  I also was ecstatic that I could sinc my kindle, which allows all my music to be shared.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Vito"}, {"rating": 4.0, "review": "I purchased the FireTV in an attempt to cut my $100 cable bill and sell my TiVos on eBay.  This idea occurred to me after I looked at all the TV shows I actually record, and added up how much I would spend just buying every episode on Amazon Instant Video.  The amount was around $491 dollars a year, or just over $40 bucks a month.  Compared to $1,200 a year going to Comcast, this seemed like a win!  On top of this, no more fast forwarding commercials, no more sports games screwing up broadcast schedules, and no more of those silly emergency broadcast tests messing up the recording.The FireTV has an amazing interface, and it's quick and responsive.  The voice search is absolutely incredible!  Purchasing and finding content on Amazon works like a charm, and the video quality is also top notch.However, this device simply is not a DVR replacement.  What I'd like is a single place where I can see all the new episodes of all of my shows, and be notified when I have a new show to watch.  If I don't own it, I should quickly be able to purchase the episode, or the remainder of the season.  I'd like a user interface centered around individual on-going TV shows that I've \"subscribed\" to.  FireTV is just not there.  Instead, you have to continually \"browse\" your media library.  You can add a show to your watch list, but you'll find yourself constantly digging through seasons and episodes trying to track down where you left off.  This device is designed to be a media archive, allowing access to content you've previously purchased, all stored in the cloud.I think if Amazon ran with this idea and turned the FireTV into a \"DVR in the cloud\", with Amazon Instant Video replacing the cable provider, they'd have something huge there.  For people who just watch 5-10 shows, this would be hugely more cost effective than an expensive cable packages.  Not to mention you'd be able to throw in content from Netflix and other Internet services as well!  Hopefully Amazon will see this opportunity, and we'll begin to see basic features that start to enable these scenarios.", "verified": true, "helpfulness": "3/3", "author": "Mike Christensen \"Mike Christensen\""}]