[{"rating": 5.0, "review": "Al these features for half the cost of other devices, what are you waiting for? Just buy it already.", "verified": true, "helpfulness": "0/0", "author": "Brandon"}, {"rating": 5.0, "review": "For the price you have to get it", "verified": true, "helpfulness": "0/0", "author": "jesus cox"}, {"rating": 1.0, "review": "sent it back", "verified": true, "helpfulness": "0/4", "author": "dave dembitzer"}, {"rating": 5.0, "review": "This is Kool", "verified": true, "helpfulness": "0/0", "author": "mray"}, {"rating": 5.0, "review": "Works great on my Sony smart tv. Looking to give a couple as gifts this xmas!", "verified": true, "helpfulness": "0/0", "author": "Christine K."}, {"rating": 2.0, "review": "I love you guys in Google. But it's the worst product ever. It's just good in playing youtube. THAT'S IT", "verified": true, "helpfulness": "0/0", "author": "Nima Rafibakhsh"}, {"rating": 5.0, "review": "Nifty little thing!", "verified": true, "helpfulness": "0/0", "author": "Sarah Shayne Lim Uy"}, {"rating": 5.0, "review": "I cannot stress enough how much I love Google Chromecast.  I have been using android phones after i ditched iOS a few years back.  Chromecast is the perfect complement to an Android device (and it also works with iPhone, if that is your poison of choice).  Besides the usual Hulu, Netflix, Youtube etc. that run so seamlessly on your TV via this dongle, the best feature is the seamless screen-mirroring from your Android device.  Showing photos and videos to family from your phone is a breeze.  Reading emails on your big screen TV via mirroring is a breeze.  Compare it to Apple  TV and the price-point is just so much better with Chromecast.Its seamless, its easy.  I love it for everything I use it for.There is a limited selection of Apps that currently support Chromecast, so check and make sure that it will run anything specific you are looking for.  However, remember, screen mirroring is always an option.", "verified": true, "helpfulness": "0/0", "author": "Mayrut"}, {"rating": 3.0, "review": "RETURN ONLY GOOD FOR USA AND I WANT IT FOR A GIFT TO A BROTHER IN ECUADOR", "verified": true, "helpfulness": "0/2", "author": "jorge rugel"}, {"rating": 5.0, "review": "love it", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]