[{"rating": 5.0, "review": "Maybe the best entertainment bargain out there, especiallyif you already belong to Amazon Prime.  Voice recognitionfeature really does work.", "verified": true, "helpfulness": "0/0", "author": "G.R."}, {"rating": 2.0, "review": "Does not capture a perfectly fine wi fi signal. I don't understand why Amazon always has this problem.", "verified": true, "helpfulness": "0/1", "author": "waltk \"wally\""}, {"rating": 5.0, "review": "A simpler, more convenient or more useful device would be hard to find. As soon as I had it plugged in, it started to amaze me. The controls are right there where you need them and they all work as they are supposed to. It is intuitive and complete. I look forward to each time I press the start button and get underway to enjoy my next selection. The \"microphone\" button to choose what you want is excellent - a real good way to get started every time.The 'play,pause,fast forward and fast reverse' buttons work exactly the way they are intended to work.After I have chosen what I want to watch - it starts up and gives me a wonderful clear picture.When I have to pause for any length of time - on come the beautiful scenery photos in a wonderful slide show. When I am ready to go back to viewing, push the start button and away we go.  A wonderful and useful product. I am very glad I got it.", "verified": true, "helpfulness": "0/0", "author": "Warren Munson"}, {"rating": 4.0, "review": "Fast but can't connect my Samsung Note 3 through Display Mirroring.", "verified": true, "helpfulness": "0/0", "author": "Ted"}, {"rating": 5.0, "review": "Super easy to install and I don't have to keep messing with my computer to stream on my tv!", "verified": true, "helpfulness": "0/0", "author": "Jennifer Dodd"}, {"rating": 5.0, "review": "I LOVE this! I did make one mistake in my understanding of things I can or cannot view via Fire TV! That is, I should had realized that in order to watch ESPN3 via it I would have to have aCable TV contract with TimeWarner! When we were in Norfolk, VA and had Cox Cable we could watch soccer & other games via ESPN3 on our computer. But, TimeWarner doesn't allow this feature. They are saying that via IFC they can't allow us to view these types of programs if we don't have cable. Since we only use our TV for DVD's we have no use for Cable. Now that we are able to watch Amazon Prime & other stuff via Fire TV it's helpful. Would love to see them include FoxNews as part of the package. Thankfully we can see WSJ TV!", "verified": true, "helpfulness": "0/0", "author": "James J. Bauers \"Yaakov\""}, {"rating": 5.0, "review": "When I was reviewing the different streaming products out there, I wound up considering 3 options: Apple TV, Roku 3, and Amazon Fire TV. Other than the obvious 1080p requirement, I had an uncommon list of special demands:1) Support optical S/PDIF audio output (Toslink).2) Downmix Dolby Digital Plus to Dolby Digital (I'm connecting the box to a SoundBar that does not speak DD+)3) I was upgrading XtreamerPro, and wanted to be able to view my 2TB of downloaded .mkv movies without having to switch inputs. So I needed a device that supported playing .mkv files from an SMB NAS.Amazon Fire TV was the only product capable of delivering the entire package. #1 and #2 are built-in the device - you can configure it specifically to output DD via optical audio (along with an option to output DD+ via HDMI, for those who need it). #3 was relatively easy after installing Kodi 14.1 (XBMC), which supports SMB like a charm, and even displays .srt subtitles.Overall: Amazon Fire TV is a successful combination of powerful hardware with an open, extensible OS (if you root the device you can install Google Play Store), that gets the job done better than its competitors, and gives you the freedom to unlock its full potential with various customizations.", "verified": true, "helpfulness": "0/0", "author": "Alexander Sharay"}, {"rating": 4.0, "review": "I like the Fire TV. I don;t use it that much because I'm not about to pay for watching newer movies but if you like older movies then they are free to watch.", "verified": true, "helpfulness": "0/0", "author": "Michelle Heath"}, {"rating": 5.0, "review": "Setup could not be any easy!!!  Very user friendly!!!  Would highly recommend.  Another great product from Amazon!!!", "verified": true, "helpfulness": "0/0", "author": "Robin Cursey"}, {"rating": 4.0, "review": "I bought this for my mother. She loves it. Easy to set up and use. She moved to the US from Germany. It seems, though, that Amazon Prime has a lot more (nearly twice as much) on offer in Germany for only 46 Euros ($52)/month. Too bad that material cannot be seen here in the U.S. She misses the nature documentaries. Otherwise the service is great.", "verified": true, "helpfulness": "0/0", "author": "Stephan"}]