[{"rating": 5.0, "review": "It is incredible.", "verified": true, "helpfulness": "0/0", "author": "Charles R. Frank"}, {"rating": 3.0, "review": "It's just an aggregate.  So as far as that goes it's OK. The videos offered as part of Prime doesn't make it worth the $100 per year.", "verified": true, "helpfulness": "1/1", "author": "Michael W. Pearson \"Mike P.\""}, {"rating": 5.0, "review": "Works like charm!", "verified": true, "helpfulness": "0/0", "author": "Yue Tian"}, {"rating": 4.0, "review": "No www browser available ...", "verified": true, "helpfulness": "0/0", "author": "Brian Buck"}, {"rating": 5.0, "review": "Best for the money. Side load XBMC and you'll have endless hours of free movies.", "verified": true, "helpfulness": "0/0", "author": "B.N \"tennis freak\""}, {"rating": 3.0, "review": "[edited.  I had previously assumed Amazon was to blame for the lack of Synology DS Video support]I don't actually dislike it.  It's a fine device, with a pleasant user interface, and plenty of processing power and a good wifi receiver.  The voice search is cool.  What is extremely unfortunate for me is that Synology has still not released a DS Video app for it.  I have hundreds of movies on my NAS, home movies, photos, etc. that I can't watch with this.  I've been waiting 6 months.  I really wish that I had bought a Roku 3 instead.", "verified": true, "helpfulness": "3/6", "author": "Kevin C. Pauli"}, {"rating": 5.0, "review": "Absolutely love my new Amazon Fire TV. It is fast and there is no lag when watching shows and movies. The image quality is incredible. I could not be happier with this purchase.", "verified": true, "helpfulness": "1/1", "author": "Jason N. Smith \"Aubie26\""}, {"rating": 1.0, "review": "You would have to be out your mind to pay $2-$3 per episode. Hulu Plus & Netflix win HANDS DOWN.", "verified": true, "helpfulness": "1/4", "author": "Tandelaya"}, {"rating": 5.0, "review": "Loving It. So easy and fast. As I am looking for one show, I find a lot of others, can quickly add to the watch list. Makes it easy for spouse who is not interested in the search to just pick a show to watch. The voice search is awesome too. I say an actor's name and all their movies, shows pop up and I can easily find the one that I want to watch. Highly recommend.  Only issue is the remote is a little small, slips around in my big hands, easy to lose in the couch, too. (here is an inventor's idea...a skin for the remotes)", "verified": true, "helpfulness": "0/0", "author": "Knightimereader \"Knight Time Reader\""}, {"rating": 5.0, "review": "One of my better purchase choices in 2014. Streams better than the BR player, Xbox and my IPad or laptop. Easy set up, easy use and popular with everyone in the family. Excellent picture and the voice search works better than any others I've messed with (Siri for example). If you are shopping for a stream device, you cannot go wrong with this one!!", "verified": true, "helpfulness": "1/1", "author": "Michael Pierce"}]