[{"rating": 1.0, "review": "Worst product I have ever purchased. I debated whether to purchase the Chromecast player or Apple TV. I made the wrong choice. Although it is a lot smaller than the Apple TV (plugs into the back of the TV), it is honestly the worst piece of junk I've ever purchased. You can ONLY play music through Google web browser or the Google Play App. You cannot directly access your own iTunes on your computer or iPhone. The player cuts in and out and then disconnects all together.I bought this product primarily to play music through my TV, not to project my computer screen or play videos. It is a piece of crap!", "verified": true, "helpfulness": "0/3", "author": "Jeff Richards"}, {"rating": 5.0, "review": "This gadget is the best invention - I can view netflix movies on my big tv and enjoy the larger picture.", "verified": true, "helpfulness": "0/0", "author": "Debbie L. Dragon"}, {"rating": 3.0, "review": "At first I was in love with the Chromecast. It was better than my Roku because it has access to Youtube and could be controlled by my phone. The device worked flawlessly since I got it at Christmas 2013 and now just says that it is connected to the my network but \"can't access the internet\". This is frustrating. I am no network expert and have tried to do some of the things the Chromecast help has led me to but now getting the device to work is about a 1 out of 4 chance. Just not acceptable.Update 2/18/15: The reason it will no longer work in my bedroom is because it is too far from my router. So be sure that this device is going to be in a relatively close location to your router. I have now moved it to another room and it works great, but it is pretty lame that it wont work in my bedroom. I think the fine print says something like 20 feet from router.", "verified": false, "helpfulness": "0/0", "author": "C. Turner \"cmturner82\""}, {"rating": 5.0, "review": "The Chromecast is easy to set-up, and handles pretty much everything that it needs to, clear picture, good audio. Casting a Chrome tab needs a little work, but is good unless you want to cast something like a video or live sports. Easily the best money I have spent, as more and more things are added to work with chromecast its value will continue to grow.", "verified": true, "helpfulness": "0/0", "author": "Peter P"}, {"rating": 5.0, "review": "So far have only used it at home, but next time I travel, I'm going to take it with me.  It works great and easy to install. Allows me to watch Netflix on the 'big' screen but I wish I could watch whatever is on my screen (e.g., Amazon Prime).  Except for inability to watch Amazon Prime, it's a great addition to the electronic entertainment arsenal.", "verified": true, "helpfulness": "0/0", "author": "mmarq"}, {"rating": 5.0, "review": "Works great once I figured out how to use it.  My computer is older model so had to use a friends computer to program it. Once it was programmed it worked fine.", "verified": true, "helpfulness": "0/0", "author": "Candice Helekahi"}, {"rating": 5.0, "review": "I love it, it's true it doesn't have a remote but still works grate from my apple devices. And the available apps are very limited but you get the best ones Netflix,Hulu,YouTube and vevo. I use it all the time on my back yard tv.", "verified": true, "helpfulness": "0/0", "author": "David Perez"}, {"rating": 4.0, "review": "I bought this for my husband for Christmas, and it was a huge hit! We enjoyed taking it to a hotel over New Year's and accessing movies and shows we like. It's small and portable and works like a charm. We love it!!", "verified": true, "helpfulness": "0/0", "author": "Dave'nJanna"}, {"rating": 4.0, "review": "Since we use this device to get vids from our mobile device to a 1080p HD TV. It will be good to have some nice videos other than what is available to mobile devices. Quality  gets compromised otherwise.A great product anyways :)", "verified": true, "helpfulness": "0/0", "author": "PrimeMember1 \"PrimeMember1\""}, {"rating": 1.0, "review": "I am not sure how Apple TV works, but probably better than this. There is such a limited number of apps that work with Chromecast that it's nearly not worth it.I really hope the google guys have bigger plans than this.", "verified": true, "helpfulness": "0/2", "author": "PIZANA Enrique"}]