[{"rating": 3.0, "review": "Let's start by talking about the competition.  Roku has 100's of channels where you can browse content right on the device and play what you want.  Apple TV does the same but also lets you transfer what you are playing on another device to your TV.  That includes not only streaming content but also photos, music and videos that are on the device itself.  Even some games have AirPlay support, letting you play them on your TV, in high def with full motion video.In comparison, Chromecast doesn't have any \"channels.\"  It only plays content that you \"cast\" from a small number of apps that support it.  And for the most part, it's only capable of playing what it can stream straight from the internet, not the device you are using to control it.  For example, Google's own Play Music app can play MP3's that I loaded onto my Nexus 7 but it won't cast them.  \"Unable to play the song.  Can't play a sideloaded song remotely.\"  I'm not sure if that's a legal/licensing limitation or a technical one but from what I've seen on the developer site (I'm an Android software developer,) Chromecast just really isn't made to have much content sent to it from the controlling device.  Even casting a browser tab in Chrome is pretty sluggish and unresponsive.Chromecast is like an AppleTV that only does AirPlay... poorly... and with a small set of apps.  It's really only good for one thing - transferring a YouTube video from your phone to your TV, so you don't have to go and find it on your PS3 or Roku or Apple TV or whatever.  Sure, Chromecasts are cheap.  But is the novelty even worth the price tag?  Personally, if I weren't also looking into the software development aspect of the Chromecast, I would want my $30 back.", "verified": true, "helpfulness": "1/1", "author": "Brandon C. Rich"}, {"rating": 5.0, "review": "This is a great device - plugs into an HDMI port on a video device (aka TV) which then displays whatever is streamed to it. It really is the size of a large thumb drive.Pros -* Cheap!* Small* No IAPs or licensing or recurring costs* Updates its own firmware - adds new services, supports, etc.Cons -* Despite being small, it does have a power cord. I guess HDMI does not provide power, or enough power.* Not (yet?) integrated into core operating systems. So, only applications that support it will send their content.  Right now, I only know of one application - Google Chrome - that broadcasts, but I know there is at least or two others.  Since Chrome will broadcast, it will (should?) broadcast every browser based movie service, etc..", "verified": true, "helpfulness": "0/0", "author": "xyz"}, {"rating": 5.0, "review": "Works great at an ultra low price so it is a no brainer to get rid of the old school hdmi cables and it is super easy to use", "verified": true, "helpfulness": "0/0", "author": "GREGORY M LOOSE"}, {"rating": 5.0, "review": "I brought this over Christmas, and I damn-near use it every day.  Love love love it.Very helpful when I want to binge-watch shows on Netflix on my big screen!", "verified": true, "helpfulness": "0/0", "author": "Bishi"}, {"rating": 4.0, "review": "although it is limited to only two channels (YouTube and Netflix) what it does it does well.  My wish would be that it could accept all internet, all Microsoft office so I can demo at work and movies from the computers drive.  Lots of limitations but good at what it is intended to do.", "verified": true, "helpfulness": "1/1", "author": "John"}, {"rating": 4.0, "review": "The Chromecast was designed to allow you to stream YouTube and other Google apps to your TV, and it does this very well. Setup for me was easy, and done within 10 minuets. I immediately tried it out, and it streamed YouTube fairly well. Now I had received this as a gift, and was not sure what to expect. The 1st thing I tested, being an Amazon Prime subscriber, was if it could stream Amazon Instant Video. When I 1st tried it did not work, but with a little research I was able to find out that was due to the Microsoft Silverlight plugin, and once that was disabled it would cast Amazon Instant Video perfectly fine using the tab cast option. Overall this is a great product that does was it was designed to do perfectly.", "verified": false, "helpfulness": "1/1", "author": "wg"}, {"rating": 5.0, "review": "very good product exceeded my expectations, if it's more apps needed to improve even more, wait for more improvements, highly recommended", "verified": true, "helpfulness": "0/0", "author": "Jofavene"}, {"rating": 5.0, "review": "Great gadget if you don't have a \"smart TV\". Very easy installation and use. Unbeatable price. Hopefully more apps will support chromcast.", "verified": true, "helpfulness": "0/0", "author": "THTK"}, {"rating": 2.0, "review": "I amc already  wifi'ed throughout the house and can access movie channels direct on the TV\"s have seen no advantage.", "verified": true, "helpfulness": "1/2", "author": "John W. Stevenson"}, {"rating": 5.0, "review": "Absolutely one of the easiest electronic products to set up and use.  Great for playing music on your home sound system.", "verified": true, "helpfulness": "0/0", "author": "Cecil C. Chappelow"}]