[{"rating": 5.0, "review": "the reason i give it 5 stars is because unlike the ruko its not constantly having issues that need to be solved.", "verified": true, "helpfulness": "0/0", "author": "Darksun"}, {"rating": 5.0, "review": "I love it already. The queue and no waiting feature is amazing. It blows away waiting for the Apple TV spinning wheel. I can't wait for iPhone connectivity later this year.", "verified": true, "helpfulness": "0/0", "author": "Barry Johnson"}, {"rating": 5.0, "review": "I like all Amazon HW, Fire HDX is the nicest 7\" tablet I have used; similarly the FireTV is the best streaming media I have used, quick, idiot proof to set up and due to the fast chipset enhanced video and audio playback. Only thing missing is the ability to play my music collection. I hope this functionality will come soon", "verified": true, "helpfulness": "1/2", "author": "A. Ross"}, {"rating": 3.0, "review": "After playing around with the Fire TV for a few weeks I have to say it does great with video streaming. However the lack of storage becomes evident once you install a few of the games that will work with the game controller. These games are too large for the limited amount of space given to you. Once again a company misleads consumers with a stated HD space that is no where near what is stated after they install all their bloat ware! If amazon adds support for adding more memory via the USB I will def add another star.", "verified": true, "helpfulness": "1/3", "author": "gohan2021"}, {"rating": 3.0, "review": "The amount of apps available for this on release is pretty lack-luster.  If they were really serious about it being an open product, they'd allow access to the google play store.  The way things are accessed from the home screen is not as smooth nor as efficient as a Roku 3.  The voice search works well.  If it gives you problems after an update, reboot the device.  I think it will improve, but as of now it only gets 3 stars.", "verified": true, "helpfulness": "0/4", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Very slick presentation..............However I find it difficult to fill text when required: Changing to Netflex, how does one complete the required texting ?", "verified": true, "helpfulness": "0/3", "author": "Shutterbug \"Shutterbug\""}, {"rating": 5.0, "review": "I am very impressed with Fire TV.  Especially the remote.  All the actions are crisp and smooth.  Much better than my Xfinity X-one controller.  And the size is nice too.  Not so big that you can't find a place to store it.  Overall, I am very happy with my purchase.  And, all the free movies that come along with Prime just make this a double good deal.", "verified": true, "helpfulness": "1/1", "author": "Rfabbre"}, {"rating": 5.0, "review": "Overall for what I use it for, I would spend $99 for the Fire over Apple TV. Although the Apple TV is a good product, the Fire meets my needs better. I don't need something for Hulu or HBO or ESPN or Red Bull. - Netflix works and streams faster. I noticed there's less lag and less wait time for load - Prime TV works. Perfect since my kids like to watch cartoons. Again this load pretty fast and the stream is very smooth - Games. Although not many the ones that are available are enough to keep the kids happy (mainly minecraft) - Remote is bigger and easier on the hands - Ability to add game controller - Has not locked up or have any errors (with the Apple TV, I had to occasionally reset it)", "verified": true, "helpfulness": "2/2", "author": "Eric T."}, {"rating": 4.0, "review": "I haven't tried all the features yet but what I have tried was just as advertised.  Set up was amazingly easy.  I wish that I could use my Kindle HD for the second screen but all I see is that it supports only the HDX.  The only real problem I found was with the voice system on the remote.  I said the title of a movie and I did see the correct movie on the screen however not one of the options available allowed me to see the movie I already owned without buying or renting it.  I was able to get to my purchased copy the old fashioned way.", "verified": true, "helpfulness": "0/0", "author": "Darlinda Diaz-Gonzalez"}, {"rating": 5.0, "review": "Easy to install, great interface and love the speech search function.  Easier to use than my Apple TV box and has lots to offer.", "verified": true, "helpfulness": "0/0", "author": "P. Farrell"}]