[{"rating": 5.0, "review": "Finally a good product from google and enjoying it very much.Cons = sometimes it hangs or little bit slow in sharing", "verified": true, "helpfulness": "0/0", "author": "Ajay kumar Batta"}, {"rating": 5.0, "review": "very easy to use cut my cable in half first time a product has worked as advertised I realy like this", "verified": true, "helpfulness": "0/0", "author": "phil cardaci"}, {"rating": 1.0, "review": "Thus does not work and Google customer service is a joke been trying to get them to fix this situation for weeks to no avail.", "verified": true, "helpfulness": "0/1", "author": "LMT"}, {"rating": 1.0, "review": "I bought this very excited to stream video.  Plugged it in.  Went to connect it and EPIC FAIL.  It can connect to my network but not to the internet.  A google search (ha) indicated that I needed to change router settings.  I spent a completely wasted hour with Comcast, who then directed me to a port-forwarding website and just told me to follow the instructions.  What instructions?  When I did try to sort through that information using my router model info, there were no port forwarding instructions for chromecast.  A further search on the chromecast troubleshooting doesn't even list my router (used by a MAJOR company), much less indicate whether it is compatible or not.  So, people get duped into buying a product with no indication in the store that the product is likely to currently be unusable.  What a crock.", "verified": false, "helpfulness": "1/2", "author": "Kyle"}, {"rating": 5.0, "review": "We have a complex media-center setup in our house: not a good idea when you have a 3 years old who can't wait a moment for the media center to start up when he is ready for his cartoons. Chromecast enables us to quickly 'cast' whatever show he wants to see without having to fumble with remotes etc. We can be anywhere in the house and change shows etc.If you don't wana invest into an actual Smart TV, and don't care for a plethora of channels (if you do, consider RoKU), this product is highly recommended.", "verified": true, "helpfulness": "0/0", "author": "AS"}, {"rating": 1.0, "review": "So I saw the ad for it and I was so excited to get it because the ad said I could watch anything on my TV from my Smartphone or from my tablet... So I got it today and went to setup... turns out it isn't compatible with my Smartphone or my Windows Tablet.... So its a useless piece of junk.", "verified": true, "helpfulness": "2/3", "author": "A. Bergk"}, {"rating": 4.0, "review": "It is a good product but it is a bit misleading. I bought it because I have seen write ups for streaming from the internet. I can stream YouTube just fine but there are other sites that I wanted to stream to my television. I even tried to stream ESPN3.com and it wouldn't stream. I am not sure if there is something special I need to do to set it up but the manual is not all that helpful either. I like it but it needs some improvement. If it is supposed to let me stream any site that my tablet or laptop accesses then I expect that to be the case.", "verified": true, "helpfulness": "0/0", "author": "LDJames69"}, {"rating": 5.0, "review": "The player easy to install.  The transition from computer to TV is quick and easy and the reception is excellent.", "verified": true, "helpfulness": "0/0", "author": "Bonnie Larson"}, {"rating": 4.0, "review": "I couldn't connect with my laptop or phone but eventually i connected with my nexus 7. But other that the connection problem it does what its supposed to do.", "verified": true, "helpfulness": "0/0", "author": "penname"}, {"rating": 1.0, "review": "I own 3 ROKU so I thought i would try this since it is so cheap.I can not find a use for it. No remote, need something turned on pc/laptop/phone to do anything. pointlessI am starting to notice the only people who like this have no clue what a Roku is.", "verified": true, "helpfulness": "1/3", "author": "dom"}]