[{"rating": 5.0, "review": "Got this mostly for Plex and Amazon Prime movies. Does what it's supposed to do. Plex works great on it.", "verified": true, "helpfulness": "0/0", "author": "A. Russa \"OC\""}, {"rating": 5.0, "review": "i love it", "verified": true, "helpfulness": "0/0", "author": "jaime meza"}, {"rating": 4.0, "review": "If you're looking to run Kodi (former XBMC) on a cheap build, nothing beats this. It runs perfectly smooth. I also have a Acer Revo (love it), but it is bigger and cost more, if you build a small pc you're in for 300$ min. That device is plenty powerful for the task.The only two cons are:1. The usb cannot accept any storage, so no usb stick or external usb. The usb plug is only for HID (keyboard or mouse).2. The remote is Bluetooth, there is no IR receiver. Be aware that you need an IR dongle if you'd like to use your remote (like the harmony).", "verified": true, "helpfulness": "0/0", "author": "Erik"}, {"rating": 5.0, "review": "thank you", "verified": true, "helpfulness": "0/0", "author": "Morris N. Dobres"}, {"rating": 1.0, "review": "I was very excited for my Amazon Fire TV. I haven't had cable in years so I use all the streaming services frequently. For the four hours that I got to test it out I was pretty happy with it. Then after watching a few new episodes of It's Always Sunny on Amazon Video I went back to Netflix and found that every time I tried to play anything it said the title was not available at this time and I should try again later. I tested over thirty titles which all came up with the same error. I searched on the amazon forums and came across a fix that sounded like it could work. I unplugged the device, left it off for ten seconds and plugged it back in only this time the power light didn't come back on. After waiting another minute I realized it wasn't going to power back on. I unplugged it again and tried in three other known good outlets with no change. Basically, it turned into a brick after four hours of use. I realize that the reviews are generally good for this device but I can't rate it based on others experience with it, only my own which was worse than poor. If I could give it zero stars I probably would. At least Amazon customer service didn't waste a lot of my time diagnosing the issue.", "verified": true, "helpfulness": "2/3", "author": "bigmclargehuge"}, {"rating": 5.0, "review": "This is so awesome! It's tiny, hidden behind the tv and has the easiest remote in the world! LOVE IT!", "verified": true, "helpfulness": "0/0", "author": "Sandy333"}, {"rating": 5.0, "review": "This little thing is great.  I was using chromecast but it did not have a remote which I like having when watching movies.  The voice search is pretty good but I wish you could use it to search Netflix  and YouTube as well, you can search within them just not by using voice. There are plenty of apps and games so you should be able to find things you want. You can start watching YouTube on your phone and then send the video to Fire TV just like you can do with chromecast. I know they will keep updating this and it will get even better. Give it a try you won't be disappointed.", "verified": true, "helpfulness": "0/0", "author": "michaelwy \"michaelwy\""}, {"rating": 1.0, "review": "This device doesn't  have any use full apps, neither have a Web browser and also have Delay  when you use netflix. If you live out of the us amazon prime doesn't  work either. The worst choice", "verified": true, "helpfulness": "1/2", "author": "Ivan Talavera"}, {"rating": 4.0, "review": "Works perfectly. If the device had more storage capacity and  the remote was equipped with a keyboard and air mouse I would then rate it 5.", "verified": true, "helpfulness": "0/0", "author": "andre edwards"}, {"rating": 5.0, "review": "Like this very much. So far what was expected. Good job", "verified": true, "helpfulness": "1/1", "author": "gary"}]