[{"rating": 5.0, "review": "I enjoy the fire very much. It saves me money from renting and buying movies and games. I would suggest the fire to anyone.", "verified": true, "helpfulness": "1/1", "author": "Michael Allen Davidson"}, {"rating": 4.0, "review": "The Amazon Fire TV performs as advertised and we are enjoying having it on one of our TV's.  We wish the load speed was a little faster but this is a minor problem.  We feel that we have gotten our money's worth from this product.", "verified": true, "helpfulness": "0/0", "author": "Rodger Isom"}, {"rating": 4.0, "review": "Great product. Best thing about it is voice search, and how fast it reacts to everything in general. The cons would be that if you want to watch recently released movies, we'll just like everywhere else you need to pay. And for slightly older movies you need to be a prime member/Netflix owner/hulu, etc. Listen folks, for  up to the minute content there will always be a price. Overall, the pros far outweigh the cons once you get over this is not \"free.\" Almost everything on it has some sort of small cost. Even channels require a cable subscription and verification. Look it's $99 and you get a ton of content at your fingertips, at lightning speed and super user friendly. It's definitely worth the money.", "verified": true, "helpfulness": "1/1", "author": "Jeremy"}, {"rating": 4.0, "review": "Like it so far but only been using Fire TV for 3 days. controller is nice and simple, comfortable in hand. Voice search works amazing well. Will be nice when they include Netflix in the results. So far plenty of programs/movies to watch. Need to add Vudu service as that is were all my movies are currently stored. They have Flixster but it isn't as good.", "verified": true, "helpfulness": "0/0", "author": "S. V. Metre"}, {"rating": 4.0, "review": "it's a quality is excellent much better than cablemuch better PlayStation threelove the surround sound. That is great,", "verified": true, "helpfulness": "0/0", "author": "Gerald H. Nelson"}, {"rating": 5.0, "review": "i like it fine it does what as it was advertised to do set up was easy just follow the screen", "verified": true, "helpfulness": "0/0", "author": "joseph blackwell"}, {"rating": 5.0, "review": "VERY EASY TO HOOK UP AND GET WORKING,  VOICE ACTIVATION A CERTAIN PLUS.  GREAT FOR NETFLIX AND AMAZON PRIME SHOWS.", "verified": false, "helpfulness": "0/0", "author": "Kris"}, {"rating": 2.0, "review": "There isn't enough in comparison to the other devices out there. Amazon has access to other apps that allow you to watch TV shows such as ABC, NBC, HBO, showtime, ABC family, fox, and many more. If they added these apps to Fire TV I would love it giving more reason to use it. I got rid of my cable for that purpose. There isn't enough reason for me to stream to this device.", "verified": true, "helpfulness": "1/1", "author": "Jordan Carter"}, {"rating": 5.0, "review": "Wished I would have ordered this sooner.  Easy to set up, access to all the TV shows & movies.  If your on the fence about ordering this, I don't think you'll regret the purchase.", "verified": true, "helpfulness": "0/0", "author": "Carolyn \"COM\""}, {"rating": 5.0, "review": "Gave my ROKU away and went to this.  Its incredible for me. i have Hulu Plus,  netflix and amazon prime.the talking and finding movies by title or actor etc wow", "verified": true, "helpfulness": "0/0", "author": "W. Moritz \"Arnold Ziffel for President\""}]