[{"rating": 1.0, "review": "I loved this product when I got it! It streamed Netflix and all kinds of other apps that I enjoyed, but I got it mostly because it was Netflix compatible. After their last update, Netflix will not stream ANYTHING! I wish they would fix it or that I could send it back.", "verified": true, "helpfulness": "1/1", "author": "KillerBees"}, {"rating": 1.0, "review": "I purchased an Amazon prime membership and was told I would be able to stream over 200,000 movies and television programs through my Samsung wi-Fi Blu-ray player just like I do Netflix. Unfortunately this was not true as my particular Blu-ray player was not one of the \"compatible\" devices so I bought the Amazon Fire TV to access the streaming content however in being able to do so I realized that all of the content had to be purchased to be able to view it which I had wrongly assumed was included in my Amazon prime membership. So I will go back to streaming Netflix through my existing Blu-ray player and the label is printed to send this back to Amazon at my own expense, very disappointed with Amazon prime and Amazon fire TV the speak and play remote was a nice feature however. So basically for Amazon prime you just pay $99 to be able to have free shipping on a few items.", "verified": true, "helpfulness": "9/13", "author": "Michele"}, {"rating": 5.0, "review": "Voice search works phenomenally! Interface is super fast. Everything on this box just works. Only gripe is that voice search doesn't work in non-Amazon apps...yet?If you are a prime member and like watching amazon content. Get one now.", "verified": true, "helpfulness": "0/0", "author": "Mountmonty"}, {"rating": 5.0, "review": "Love it", "verified": true, "helpfulness": "0/1", "author": "Julissa"}, {"rating": 5.0, "review": "It works really well", "verified": true, "helpfulness": "0/0", "author": "William"}, {"rating": 4.0, "review": "excellent device, ecosystem rapidly catching up.  If you are an Amazon Prime member (which I think is a no-brainer anyway) then this is one of the best accessories that you can get for that membership.  I have a Chromecast stick on another television in the house and the Fire TV is preferred out of those two streaming devices.  Of course, the dongle's huge advantage is it's price ($35 versus $90).  But the Fire has excellent hardware, is very snappy and responsive compared to Chromecast and the remote/voice recognition is excellent as advertised.  It would make an awesome main streaming box for someone who is moving towards cable cutting.  OTA HDTV for the main networks, Hulu Plus, unlimited streaming of Prime video via Amazon, Netflix and maybe a couple more a la carte options?  I think you'd be just fine.  Of course, we're in the midst of the \"ecosystem wars\" and that's really what this boils down to.  If you're an Apple kind person?  Then Apple TV.  Google = chromecast, Fire TV = Amazon.  For folks who are stuck in the middle or platform agnostic?  I'd really look at Roku.  The only, and I mean only, gripe is NO HBO Go at this point!  Which means no GoT and that sucks.", "verified": true, "helpfulness": "0/0", "author": "volsfan \"volsfan\""}, {"rating": 4.0, "review": "I could not find an APP that would allow me access to the internet.", "verified": true, "helpfulness": "0/1", "author": "Larry J."}, {"rating": 5.0, "review": "Quick and easy to use.  I love that my Amazon music is available to listen to and there are lyrics with a lot of the songs", "verified": true, "helpfulness": "0/0", "author": "justin robert proett"}, {"rating": 5.0, "review": "I'm a cord cutter and I love it,  the only thing I miss is live hockey games.", "verified": true, "helpfulness": "0/0", "author": "Jarrod"}, {"rating": 5.0, "review": " I just got XBMC on fire tv, I can watch everything for free. Latest TV showes, movies, music, weather, international TV channels, Live TV channels, Android apps, even adult videos. I also got Android app store, Shafa app store, Amazon app store, etc.", "verified": true, "helpfulness": "0/1", "author": "Yi Wang"}]