[{"rating": 5.0, "review": "Love it.  Lacks functionality at the moment but for the price it is definitely worth it.  Go ahead and pull the trigger.", "verified": true, "helpfulness": "0/0", "author": "NeverCaredForCursive"}, {"rating": 5.0, "review": "Installation and configuration were trouble-free.I use Netflix and Youtube, but since I live in Ecuador Google Play Movies is not available here.Netflix and Youtube satisfy my entertaiment needs, so Chromecast is all I need in my TV.", "verified": true, "helpfulness": "0/0", "author": "Miryam"}, {"rating": 5.0, "review": "We don't have cable and were looking for a way to find more things to watch streamed to our TV. Chromecast is easy to set up and super easy to use! Loving it!", "verified": true, "helpfulness": "0/0", "author": "April Redden"}, {"rating": 4.0, "review": "Really nice, very simple to set up. It's very useful now, as one of the best ways to get Netflix or Youtube onto your TV. There's a lot of promises to get other apps to work with this, which if it happens, makes this an absolute essential gadget. The $35 price is genius, if you have any question as to if you want it, just get it. You won't be out much, and you might get a really killer experience in a few months.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "If you watch Netflix and don't want to spend close to a hundred dollars for the ROKU, then this is a must for you. I've used the PS3, Nintendo Wii and Android PC to stream Netflix on my TV with high-speed internet, but the quality on the Chromecast is much superior. Although, please note that if you don't have high-speed internet, you may not get the same quality. I've done an apples to apples comparison using the same internet speed.That being said, my primary reason for this purchase was to use the browser and cast directly onto my TV. It works! But the quality is very poor. Unless you want to read articles on your TV, movie streaming is very choppy, poor at best, it's nearly unviewable. This is very important because I have a laptop that surpasses Chromecast's minimum PC requirements for browser tab casting. I have a quad-core i7 chip. Just to be fair, this functionality is still in BETA.I own an android mini pc stick, which I use to stream video and movies on my tv now and I was hoping that the Chromecast would replace it. But unfortunately, the quality doesn't even come close and it won't be replacing it anytime soon. For the time being, it's only use is Netflix, for everything else, it's either the android mini pc stick or hdmi cable connection.", "verified": true, "helpfulness": "0/0", "author": "Reaz \"RiZ\""}, {"rating": 5.0, "review": "The Chromecast is amazing, if you have a good internet connection and know your way around a computer, you will love this product! I have been using it for shows and streams and have just about cancelled my cable because of it. It has a built in Netflix and Youtube app that is automatically activated and more apps are soon to come. The one iffy thing is that it gets a little hot when used but that manual says that it is normal and nothing to worry about.For $35 though you should try it if you are on the fence!", "verified": true, "helpfulness": "0/0", "author": "Elizabeth"}, {"rating": 4.0, "review": "When using with Netflix or Youtube, this device is pretty awesome since it has a chromecast player built into those websites. If you have a smart tv, xbox, ps3, this is pretty pointless, but if you don't- this sort of turns it into that.BEWARE- You can only stream stuff on google chrome from your device. That means, if you have something on VLC or your computer, you will not be able to stream it directly to your tv. I really wish it had this capability. If anyone knows how to do this, please let me know :)", "verified": true, "helpfulness": "1/1", "author": "Matthew"}, {"rating": 5.0, "review": "I received my Chromecast last week and was excited to connection and get started. I had a little trouble getting it set up to my home network, but I have been having network issue for a few weeks (I need to get Comcast out.My first impression of the Chromecast was it has a nice clear picture and nice screen save which displays the date and time I believe and background picture changes according to the time of day. I was able to set my Netflix up and watch a movie. I liked watching Netflix via the Chromecast because I was able to get a clearer HD picture. Before I was watching Netflix on the same 60in LED HDTV via my bluray player.Over I'm happy with the Chromecast, but am looking forward to seeing new apps for it.", "verified": true, "helpfulness": "0/0", "author": "Aimdoom"}, {"rating": 5.0, "review": "Nice to sit on couch with iphoneAnd see screen items on TV.Thanks do providing great service to us north Georgia folks.", "verified": true, "helpfulness": "0/0", "author": "Curtis"}, {"rating": 5.0, "review": "does every thing they say it will has great picture very nice unit well made google put a lot of thought into tis product", "verified": true, "helpfulness": "0/0", "author": "Steve"}]