[{"rating": 3.0, "review": "waiting for better firmware and applicationsfor now very limited use", "verified": true, "helpfulness": "0/1", "author": "compernolle"}, {"rating": 5.0, "review": "Very handy, can use it with your pc, tablet, IPad, to watch film, movies, show, series, etc. ...", "verified": true, "helpfulness": "0/1", "author": "Peter Martin"}, {"rating": 5.0, "review": "A++", "verified": true, "helpfulness": "0/1", "author": "julio davalos"}, {"rating": 5.0, "review": "It is very good", "verified": true, "helpfulness": "0/0", "author": "Annelis"}, {"rating": 5.0, "review": "You know it, you love it.  Works with many apps and the chrome browser.  Sometimes a bit of lag with the browser function but it's the best in class at what it does.", "verified": true, "helpfulness": "0/0", "author": "Joe"}, {"rating": 3.0, "review": "It's okay but not as good as we were expecting. Set up was easy enough, but initially we had extremely choppy video and okay audio - the video was like one of those old flip-picture books and we could see that the TV was not keeping up with the laptop. We increased the speed of our internet and that helped a lot.  We continue to have a problem with the show completely locking up randomly - audio and video - and we have to go to the laptop, slide the cursor back on the bar (showing where the program is) a minute or two and start it again.  It typically does this several times during a show, which is more than a little annoying.When I called to find out why this was happening, the tech's explanation is that our router is more than 15' away from the Chromecast (it's about 30' in our nearby office) and there was nothing to be done about it.  Nowhere in the literature or set up or even Consumer Reports did we see any warning about that; since we have no option as to where our router is, that would have definitely made a difference in choosing this casting device. Live and learn.", "verified": false, "helpfulness": "1/1", "author": "Phil J."}, {"rating": 4.0, "review": "Its Awsome,", "verified": true, "helpfulness": "0/0", "author": "Danny Dominguez"}, {"rating": 5.0, "review": "very good accesory for a non smart tv, a must have", "verified": true, "helpfulness": "0/1", "author": "Edil Bertini Baro \"Edilbertini\""}, {"rating": 5.0, "review": "Work greatWell worth the price", "verified": true, "helpfulness": "0/0", "author": "joe"}, {"rating": 5.0, "review": "So...I did research on both ChromeCast and Apple TV, and decided to go with ChromeCast mainly because the Apple TV was more expensive. Amazon readers gave me feedback on my questions, and I bought the ChromeCast. $31.00 is a lot better than $100.00. Received it yesterday, and just let me say, it's has already blown me away.  I have a wealth of movies in my collections, and to watch them, I had to load them into the BluRay. Not really heinous to do so, but I love time-saving, effortless movements. I try to avoid removing myself from my comfy sitting position. With ChromeCast, I can access all of my stored movies from my iPad or iPhone, and I never have to leave the sofa. Rich, clear, HD picture and sound, and all I have to do is pick up the iPhone or iPad. Since I only watch movies, and very little other tv, this is a goldmine. I do feel bad that I can't access my iTunes collection, but what the heck? I have all of them on disk, so I'll need to get my butt up and load the BluRay occasionally. Not a bad trade off since I need to exercise once in a while. This is a great, inexpensive alternative, and I know I'm going to acquire more movies, so it is definitely a win-win.", "verified": true, "helpfulness": "0/0", "author": "Rio"}]