[{"rating": 5.0, "review": "Best streaming device on the market!!", "verified": true, "helpfulness": "0/0", "author": "Mark Ngo"}, {"rating": 5.0, "review": "Amazing piece of equipment.  Works like a charm. We have a cottage in an out of the way place and was using rabbit ears to get a signal in other parts of the house.  Now we can watch lots of great stuff.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "Mostly good so far. Some intital problems with synching it to my TV, but that was because I had lost my Samsung TV remote. I have not tried out the games yet. TV series selection is particularly good. One problem that has been coming up with movies is buffering interruptions but I am hoping that this is a temporary problem. Not sure what the difference is between this and the Fire stick, also.", "verified": true, "helpfulness": "0/1", "author": "Michael GM"}, {"rating": 2.0, "review": "It's very glitchy. It's constantly needing to be reset", "verified": true, "helpfulness": "0/1", "author": "paulina levyash"}, {"rating": 4.0, "review": "It's crazy not to have one of these or a Fire Stick if you are a Prime member. Set up was painless. I wanted Prime video on my secondary TV and this has done well for the past month. I would like to have seen a more robust Spotify app. Spotify Connect allows the FireTV to output the audio from my phone. I would prefer not to encumber my phone. This might be a limitation from Spotify though.The Amazon Prime Music app is also not as functional as I would like. Not nearly as nice as the web interface.I haven't really used the other apps or games.  Since this has an optional controller, that's the big advantage this has over the Stick. Given what I like about this, I might also buy a Fire Stick for the bedroom TV though.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Device worked as expected.  Picture quality is excellent.  I am very impressed with the wifi range as well, did not need to hard wire the unit to my router.  Highly recommended.", "verified": true, "helpfulness": "0/0", "author": "John"}, {"rating": 4.0, "review": "The System was easy to install and easy to use", "verified": true, "helpfulness": "0/0", "author": "Len Crescenzo"}, {"rating": 5.0, "review": "Very easy to install and along with prime service makes it better than any other streaming box.", "verified": true, "helpfulness": "0/0", "author": "Jesus Ramon Pietri"}, {"rating": 5.0, "review": "Blazing fast.  Throwing out my Apple TV.", "verified": true, "helpfulness": "0/0", "author": "Ron C"}, {"rating": 5.0, "review": "very easy", "verified": true, "helpfulness": "0/0", "author": "Boo"}]