[{"rating": 5.0, "review": "I love how fast this is and also the voice search. It functions as a game player which is an added bonus ... Love it ;)", "verified": true, "helpfulness": "1/1", "author": "Military wife"}, {"rating": 5.0, "review": "Surprisingly easy to hook up. Connects to programs very fast. The voice feature works a lot better than I expected, it's not necessary to clearly enunciate each word, just speak normally. I also purchased a mount that attaches to the back of the TV so it's a very clean installation. So far, so good...", "verified": true, "helpfulness": "2/2", "author": "Mike P"}, {"rating": 5.0, "review": "I'm very happy with the Fire TV - although I wish it did even more!  The streaming is smooth and fast, and the content is excellent!  I particularly like being able to watch the Amazon Studios original series on a bigger screen!  Mozart in the Jungle is not to be missed! I do wish that there were more capability to search and buy (or select) music from the Fire TV, but it's easy enough to go to my computer and download it - once it's on my computer it's accessible on the Fire.  It's easy to set up and comes already registered (if you're a prime member).  I've watched more movies and TV in the past four or five days than I have in the past two months.  All in all it was a really good purchase at $99 - and from what I just saw, you might be able to get it for $79!", "verified": true, "helpfulness": "2/2", "author": "Ann"}, {"rating": 5.0, "review": "Still enjoying it", "verified": true, "helpfulness": "1/1", "author": "BBodacious"}, {"rating": 5.0, "review": "Unbelievably simple.  The setup took just a couple minutes, the voice response and streaming are seamless, the selection is enormous and the device is completely intuitive.", "verified": true, "helpfulness": "2/2", "author": "Will in VT"}, {"rating": 1.0, "review": "Useless outside the US", "verified": false, "helpfulness": "1/7", "author": "Ricardo Thomas"}, {"rating": 3.0, "review": "Scared to let kids use, due to how easy it is to purchase movies.", "verified": true, "helpfulness": "1/3", "author": "Thomas Strickland"}, {"rating": 5.0, "review": "works well", "verified": true, "helpfulness": "1/1", "author": "Anon"}, {"rating": 5.0, "review": "This is one of the most awesome things Amazon has put out. Easy to hookup and download in 5min. I like it alot! Now time to down grade my directv channels.", "verified": true, "helpfulness": "1/1", "author": "Christopher Beach"}, {"rating": 3.0, "review": "Currently no Netflix access that I can find, so the advertising for Netflix access is miss leading.  Other items seem to work after accounts are set up or linked.  Easy to receive and set up!  Read what is included in the box, no HDMI, so include one with your order if you need one or pick one up somewhere.  Including the HDMI cable was easiest for me.  Feel free to correct me if I am wrong on any of my comments.", "verified": true, "helpfulness": "0/1", "author": "Maleko"}]