[{"rating": 2.0, "review": "This device is much less utilitarian than was indicated in its description. Voice selection is only usable with Prime when selecting options. It selects Netflix but not the desired option (Video).I was replacing a WDTV Device with the AMAZON Fire TV for the voice capability, HOWEVER, the disadvantages I found were unacceptable…i.e.1. The single site voice only, (Netflix, which I use extensively, is the same with either device.)2. Most AMAZON options are either Rent or Buy.3. No Computer Interface for personal Libraries.4. No Local source w/o Internet or Network connection for personal recordings.", "verified": true, "helpfulness": "3/7", "author": "NLWood"}, {"rating": 5.0, "review": "Fire TV is a must for anyone with a prime membership. It is so easy to set up, streams extremely fast and has loads of content. I can't wait till future updates make it even better. I'm watching less and less cable now and am getting spoiled by fire tv.  Watch out Fios.  Amazon Fire tv is changing the way we watch tv.", "verified": true, "helpfulness": "0/0", "author": "Tony P23"}, {"rating": 5.0, "review": "Be patient with a very non-tech-savvy person! I have Amazon Prime, I ordered Amazon Fire, and I set it up with no trouble (proud of myself for that!). But when I look at movies, I see a few dozen under the Prime listing and then the rest all have to be rented. I know there are thousands of movies available for free through Prime; how do I get to them????? Giving it five stars because I know the problem is my lack of knowledge and not anything to do with Amazon Fire :)", "verified": true, "helpfulness": "1/2", "author": "New Yorker"}, {"rating": 5.0, "review": "Super easy set-up, great performance and best voice search I have ever experienced! Remote control can be used to play some games! Easy access to all my digital content, photos and music. Remote control has a good form factor, the fire tv itself is small and doesn't occupy a lot of space in my cabinet. Overall, I am loving the movie experience - convenient to fast forward and rewind in blocks of 10seconds. ASAP feature is amazing!", "verified": true, "helpfulness": "2/2", "author": "Preeti"}, {"rating": 5.0, "review": "I am able to take advantage of being a Prime member by being able to watch the great content they offer on my television, just he way I want to relax at the end of the day.", "verified": true, "helpfulness": "1/1", "author": "Texas Reader"}, {"rating": 1.0, "review": "too bad  you have to pay for all the films... and after register  account .it  say  ... change you country ..I live in Kurdistan Iraq .", "verified": false, "helpfulness": "2/27", "author": "Salamee"}, {"rating": 5.0, "review": "So I am not a tech geek. I am a mom of a toddler. A toddler who loves dinosaur train and thomas the train. We are also not big \"tv\" people. We haven't had cable in 15 years. We have survived on rabbit ears to get local broadcast and TiVo. So we recently moved and we realized that our \"rabbit ears antenna\" wouldn't really get anything. We got \"basic\" cable, but well, that turned out to be a pain in the butt as well. After two frustrated installations, I noticed that Amazon had this Fire TV thing. We were thinking of RoKu but having been an Amazon Mom member, we knew there was all this Amazon content available through prime so we decided to try it out. Well we hooked the Fire TV box up in about 10 minutes and we have been really happy. I got Hulu Plus as well and found out there was wayyy more content then what we had with the antenna (and basic cable for that matter), and we have been more then satisfied. And no more digital signal outages. It is a little weird that the voice search doesn't integrate with Hulu Plus (I guess that is coming) and with Pandora but we find ourselves just running Pandora and working around the house, the pictures that come out of the cloud are lovely. And a lot of the PBS- like content that we actually watch is available through Prime, so it makes our lives super easy.A few weird things is the box sometimes just \"shuts\" off and we have to reset it (by plugging in and unplugging the cable). My husband also made the mistake of downloading \"Smash\" and purchasing it rather then being pushed to Hulu Plus - so you have to click a little bit to get the free content. That takes some getting used too. And of course the Hulu interface is different then the Amazon one - so that takes some getting used too as well. Well, we like the Amazon Fire TV enough that we are not even using the TiVo or the Cable at all so we are just going to cancel that and probably get NetFlix for movies. So it definitely works for us.", "verified": true, "helpfulness": "3/3", "author": "Kerin S"}, {"rating": 3.0, "review": "I'm writing my review as I, regrettably, box my FireTV up for return. No hard feelings, though - and I will almost definitely purchase again down the road - just not right now.Here are my thoughts, and why I ultimately returned mine:The Good:- The interface is great. It needs some more polish, as it can get a bit cluttered at times, but it is definitely a solid base.- Scrolling is very quick, and, unlike my Roku 3, there is absolutely NO lag to speak of.- The design of the unit is fantastic, in my opinion.- Voice search is an excellent feature - because it works so well. I used it constantly. It kept me through having to dig through the menus all the time to find what I was looking for. Once Hulu and Netflix are integrated, it will be even more valuable of a feature. Definitely the part I'm going to miss the most.- The remote is great. The feel, the shape, everything - it's perfectly suited to your hand. They did a great job with this - it's significantly better than the Roku and TiVo remotes, which says a lot.The Bad:- The batteries on the remote. Holy crap, I tore through a set in 2 weeks. Granted, I use voice search very liberally, but I still expected a bit more life. It could be the AmazonBasics batteries it came with. Either way - make sure to stockpile AAA batteries. Not a deal-breaker.- The controller is bluetooth. It's fantastic, because it's so responsive. Unfortunately, it also makes it difficult to integrate the Fire TV into my A/V system, which, previously, was controlled solely with my Harmony remote. Since the Harmony has a VERY limited number of bluetooth devices it works with, this integration isn't likely to ever happen. Not a deal-breaker, though, as the FireTV remote is fantastic, as stated above.- No HBO Go. Of course, everyone is talking about it. It's definitely a con, especially when you released a geeky new device just before a new season of Game of Thrones, which will then lead to a new season of True Blood, and so-on. I'm sure this is HBO's fault, but they should have pushed harder on this. I hated having to use my Chromecast just for HBO Go, as I enjoy having one device to rule them all. Not quite a deal-breaker, for me, but I could see how this could be the final nail in the coffin.- Buggy video playback. In all of the apps - Netflix, Roku, and even Amazon's own, I have issues with video playback. It's one of the better devices for Hulu, too - It was VERY rare that I experienced Hulu pausing to buffer - so it's a shame. What happens to me, is this: Randomly, constantly, the video will pause. JUST the video. The audio continues. You can pause, resume, etc - the video stays paused. You have to exit out of the video you are watching, and go back in. At that point, it continues playing just fine, as if nothing ever happened. If this was a once-in-a-while occurrence, I could easily look past it, as it has a quick and simple workaround. Unfortunately, this happens to me at LEAST once a night, while watching the 2 hours or so of TV we do - many nights, it happens 2-3 times in that same 2 hours. Rebooting the FireTV seems to help the issue, but it will always happen again in the next day or so. I do not have this problem with any of my other devices (Original Roku HD, Roku 3, Chromecast, Panasonic TV, etc), so it is a FireTV issue. I have seen others with this issue, as well. This is a definite software issue with the device. This is definitely a deal-breaker.With that said, I honestly can't wait for them to resolve this issue, and get HBO Go added. I would just hold onto the FireTV, knowing that I will re-purchase in the future - but, since I won't be using it in the mean-time, I would rather that $100 collect interest for me, than for Amazon.Lastly, this box has the potential to be the best of its kind. With another few months under its belt, I'm sure that it will be nearly as good as the Roku, at least. With another year? I doubt there will be a contest. Just my opinion. :)Thanks!", "verified": true, "helpfulness": "4/5", "author": "H.Taylor"}, {"rating": 3.0, "review": "I bought this the day it was released. I have the Kindle Fire, Kindle Fire HDX, Amazon Cloud Player, Prime, etc... I am fully vested in the Amazon ecosystem, but being honest, the Fire TV has some work ahead of it to equal the Roku. Right now, I find my Roku 2 much more useful. Here are my thoughts ordered by personal priority1. Free Prime shows / movies are intermingled with paid shows / movies. With no ability to fully filter.  I get the reason ($$) but as user, this is a deal breaker. When trying to find things to watch for 2 young kids, I can't use this. I find Scooby Doo & they are clamoring for one they never seen & I have to tell them \"sorry, this is not free, can't watch it\" or rent / buy something each time. Even with items I OWN I am getting results for more stuff to buy. It's extremely frustrating. So 90% of the time, I am using Netflix instead of the native content.2.  Amazon Cloud Player  This is in my Roku but not my Amazon Fire TV? Seriously? If it was just for TV, then why have Pandora & I Heart? This bothers me quite a bit since all my music is with Amazon.3. MLB.tv (or HBO.go, etc...)  Personally, I watch MLB.tv at night. But the same holds true for all the other popular apps expected from a streaming player - HBO.go, Disney Jr, etc... I'm sure its just a matter of time, but RIGHT NOW, my Roku is more valuable.4. Search  Voice search is good on Amazon, but for all the other apps, you are using the same hunt and peck type search as you are with all the other players in streaming. Thats fine, its standard, but the voice search is much narrower in scope that expected & oversold in the demo.5. No \"Start from Beginning\" short cut? Less an issue, but still makes it feel incomplete.It is super fast & easy to set up & streams start immediately, etc... Hopefully a software update will knock out my major issues, but I have relegated this to a second room & continue to use my Roku 2 for most of my streaming needs. It has potential, but I feel like it is just not ready to be MY primary device.Others may feel differently, which is fine, but this is my personal opinion & the reasons why I feel that way.", "verified": true, "helpfulness": "2/4", "author": "Martin"}, {"rating": 5.0, "review": "This is the best thing since sliced bread. If you want entertainment on demand, as you need it or want it ,this is definitely for you. I have apple TV and Roku, this is far and away superior. I prefer it over cable TV as well. The best of the best for this, for real. The games are mediocre in that they are expensive. I have spent $45.00 on games and it's gonna get worse, because they are addicting. There are only about 30 games total. Not that many.", "verified": true, "helpfulness": "0/0", "author": "Nan Twain"}]