[{"rating": 4.0, "review": "Really an awesome product. The only reason it's getting 4 stars is because the options for streaming source are VERY limited. I understand the reason, but a few more options should be added, such as iTunes or the Amazon Prime Instant Video player.", "verified": true, "helpfulness": "0/0", "author": "R"}, {"rating": 5.0, "review": "This small device plugs into a usb port in the back of your tv. So if you want to purchase one, be sure that your tv is one of the newer ones that have a usb port.  The second caveat is that you must have a good strong wifi signal in the room your tv is located. I purchased an inexpensive wifi extender to bring the signal into my living room.  I found the Chromecast HDMI Streaming Media Player extremely easy to set up and install with the directions that come in the box. It is very useful, not only for streaming things like Netflix and You Tube, but with the Google cast app, you can stream pretty much anything on your Chrome browser.  Well worth the price.", "verified": true, "helpfulness": "0/1", "author": "Amazon Customer"}, {"rating": 5.0, "review": "Love this product...so convenient that I have no need for cable anymore basically... I think this is much easier to use then Apple TV and that's why it works for me :)", "verified": true, "helpfulness": "0/1", "author": "M.V."}, {"rating": 4.0, "review": "Everyone in our family has been able to use this product in the way they want.  The only downside isthere aren't yet tons of choices for streaming.  What we can use it for has worked well (youtube, hbo).", "verified": true, "helpfulness": "0/0", "author": "Beth A. Medina"}, {"rating": 5.0, "review": "My new favorite toy. I have been having network issues with my \"smart\" dvd players taking too long to load streaming content and stopping to buffer way to often. No more issues. I have seamless transfer with no buffering while using this.  You can load things like Netflix and even use your TV to surf the web from your pc (Google Chrome for mobile does not currently support streaming). I think I won't even bother with a smart device purchase next time. It seems like you can save a lot of money with this convenient little dongle.", "verified": true, "helpfulness": "0/0", "author": "Todd C. Feitl"}, {"rating": 2.0, "review": "I ordered this roughly 6 months ago. They stated that they only supported a few apps (Netflix, Youtube, etc.) but that more options were coming. I purchased on the assumption that \"more apps coming soon\" meant that they were actually coming soon. Almost nothing has happened (pandora & HBO were added), and i feel that for a company like google 6+ months of almost nothing is a long time. Streaming from the computer was still a \"beta\" option when i got it, even though google advertised it like it actually worked, and still didn't months after (haven't checked recently). I tried it many times on a new Macbook Pro and it never worked for me (just got an error and no help from google), so why advertise it? I had high hopes for Google on this one. It sounded like a great product in its infancy, but is sadly underwhelming in the end due to its continued limited options and nearly stagnant development. If all you want is the limited service that it provides, i can say that it does them well and you will love it. I have had minimal issues using it on my IOS device. Hopefully something interesting will happen with this in the next few years.Update (4/16/2014): I lowered my rating by 1-star from 3-stars. Mostly, I do not see this as a very competitive device anymore. If you want more features, There is Amazon FireTV. If you want the small profile of the chromecast, go for the new Roku Stick. Chromecast doesn't have nearly the apps that these others do. Although (to be fair) Amazon's is more expensive, however Roku is similar in price(~$15 more). personally, I would rather spend a little more and get more. The biggest thing for me is that Both alternatives have Amazon Prime streaming, but i also enjoy the addition things they offer. I still think that the Chomecast does well for what little it does, but I would not recommend it given the superior alternatives, that is the only reason for the 2-stars.", "verified": true, "helpfulness": "0/0", "author": "Kyle"}, {"rating": 4.0, "review": "I heard a lot of good things about this cool little gadget. The instructions are a little lacking. I've learned more information  from others online that the instructions neglect to give you. Especially it's operation, different ways you install, and locations. There are not a lot of apps that are compatible at this time, but more are on the way.It does work very well with you-tube.The price is very reasonable and shipping is sonic fast.", "verified": true, "helpfulness": "0/0", "author": "SJM"}, {"rating": 5.0, "review": "Use my Chromecast daily. I love it more daily. My children keep trying to put it in their rooms. The best gifting product out there.", "verified": true, "helpfulness": "0/0", "author": "Shawn Thomas"}, {"rating": 5.0, "review": "it really helped with the fact that I could not play music on my home stereo without directly plugging my phone into the stereo.  not to mention I can share pictures and videos, and watch netflix.  worked great on a trip out of town to make the stay at the hotel much more enjoyable.", "verified": true, "helpfulness": "0/0", "author": "Bobby F."}, {"rating": 5.0, "review": "This is the next best thing to a smart tv, for a lot less money. I have two of them and the only thing I have found is that the boys don't want to share the time on it. We don't have the fastest internet but can watch movies from HBO-Go with no problems. Tablet, Phone or computer, doesn't matter what we are on, it makes sharing the media easy. get one from somewhere if you can.", "verified": true, "helpfulness": "0/0", "author": "George L Golden"}]