[{"rating": 4.0, "review": "I love it. Will be cancelling cable shortly.", "verified": true, "helpfulness": "0/0", "author": "Shoaib"}, {"rating": 4.0, "review": "It really was easy to set up and get running, EXCEPT for the fact it looked like the Netflix app was already downloaded and I couldn't figure out how to sign in.  It took looking at the Netflix site to figure out that the device is just showing possible apps and are not downloaded until you download them.  Thank you Netflix =).", "verified": true, "helpfulness": "0/1", "author": "JRobinson"}, {"rating": 5.0, "review": "GREAT!", "verified": true, "helpfulness": "0/0", "author": "Sharon"}, {"rating": 3.0, "review": "So far I'm irritated.  We had to wait about a week because the item wasn't in stock. I understand that it happens. Nonetheless, we finally received the TV box, set it up and everything was fine. After a while we went to set up Netflix. The box decided it needed to update and continued to attempt to do so for quite some time. I called into customer service and after two phone calls and much frustration the box is deemed faulty. Things do happen and I understand that but now the new box that is being sent is out of stock and not to be delivered for 3 weeks. I'm frustrated but I'm hopeful and when we receive a box that works properly we will be satisfied. I feel for technical issues or the like they should have items in stock for these customers. Grrr.", "verified": true, "helpfulness": "0/0", "author": "busymom1"}, {"rating": 4.0, "review": "Fairly easy to use would give it 5 if it had a user guide that would explain small details like you don't turn it off, it goes to sleep spent a lot of time looking on how to power it off", "verified": true, "helpfulness": "0/0", "author": "robin hinderman"}, {"rating": 5.0, "review": "Used as a source of entertainment for both the family and when we have guest.", "verified": true, "helpfulness": "0/0", "author": "Gremlin \"Daniel S. Rodriguez\""}, {"rating": 5.0, "review": "LOVE it!!  I have a Samsung smart TV so I could access the most of the same items (including Amazon Video, Netflix, etc...) from the TV's interface as long as I was connected to the internet.  I bought this because my cable/internet provider refused to run an ethernet connection from the TV to the modem that was in a different room.  They told me to puchase a wifi stick.  I had been researching those, but the refiews on the wifi sticks were 50/50 - when the worked, great, but half the folks said they just did not work.  Started looking at Amazon TV as a connection tomy wifi.  I have to say I am SO glad I purchased this!  The interface with the Amazon TV is SO much better than what came with my smart TV.  The menu, settings and remote funcion much more like the type of set up you get with a service provider so finding what I want is super fast.  Also the voice search option is fabulous - just state the name of what you want and it really works!  So glad I bought this - it works so much better than what I had previously and it saved me from hiring an electrician to run ethernet under my new house.", "verified": true, "helpfulness": "0/0", "author": "Aleea Major \"knowledge seeker\""}, {"rating": 1.0, "review": "Unit would have worked well, however, my present Kindle tablet is not HD so I could not use the \"mirroring\" feature, a major reason I purchased it in the first place.", "verified": true, "helpfulness": "1/2", "author": "James Crowley"}, {"rating": 1.0, "review": "BAIT AND SWITCHI wanted the $39.00 Fire that was being advertised highly on TV but it wasn't going to be in stock until late Feb.SAO I went for the $99.00 unit.Good news, it came on time.Bad news, I can't make it work in the next room from my router.guess the more you pay for a lesson the better you learn it.", "verified": true, "helpfulness": "1/3", "author": "Kindle Customer"}, {"rating": 3.0, "review": "I like the quality of the picture and simple functionable remote.  I guess if you like games you have some which I don't use.  very little new and desirable movies to watch. The voice only works for Amazon movies not for other apps.  At $99/year it is too much unless I shop a lot to get get free deliveries, which I will get with shopping over $35.  I have not used any books available on Fire to read, for the book readers that could be a plus.", "verified": true, "helpfulness": "0/0", "author": "Behnam Moghadasi"}]