[{"rating": 4.0, "review": "I was surprised at the ease of setup for this remarkably inexpensive TV add-on. Once it has more streaming options, this will be a five-star accessory. Still it's a bargain I recommend strongly.", "verified": true, "helpfulness": "1/1", "author": "Steve Lee"}, {"rating": 5.0, "review": "I love this thing! I have AppleTV, I have Google TV, and I have a smart TV. This Chromecast gadget is what I use the most. I can't wait for them to add more apps. Plus it is so easy to use. If you don't have one you are missing out. I will take it whenever I travel.", "verified": true, "helpfulness": "0/0", "author": "Gayle Rupert"}, {"rating": 5.0, "review": "I was one of the lucky individuals who was able to purchase a Chromecast in the first wave of orders, before they sold out almost immediately. I purchased it mostly out of excitement and curiosity fueled by my love of consumer gadgets. To be perfectly clear, this product fills absolutely no niche that is not already satisfied by either my smart TV or my Xbox 360, both of which are sufficiently capable of playing back content from numerous sources. The best role to which this dongle could reasonably aspire is to perform these same music/video streaming better or more conveniently than my current solutions. I am happy to say that, for the most part, it accomplishes this role. There are a handful of beneficial reasons for which the Chromecast has become, if not my only streaming device, then at least my primary one of choice for most circumstances.First, it is faster. Considering the time it takes my Xbox 360 to start up, load the Netflix app, browse to a particular TV show, switch episodes (because for some silly reason their design team decided to not let users select an episode first), buffer the introduction and play, it is really not surprising that a tiny device from Google is able to reach the same destination much faster. This is partly due to the simple hardware requiring virtually no start-up time once the TV is turned on. It is also partly due to what I perceive as a faster buffering time to start playing (although initially it performed this task relatively slowly, it has improved significantly since the earlier days). It is also partly due to the fact that it doesn't really have to load an app so much as recognize a streaming source online. The final reason for this significantly reduced wait time is directly tied to the second benefit of the Chromecast.Second, selecting content is easier. The Chromecast is designed entirely as a receiver of instructions from a wide variety of other devices. This means you can use your computer, phone, or tablet to select content for playback. Generally speaking, controlling any of these devices, especially a touchscreen phone or tablet, is much faster for searching for and selecting media content. I certainly have a much easier time finding what I want to watch on my Nexus 7 than I ever did on my Xbox 360. This makes the browsing process both faster and less of a hassle. It also means you don't have to hunt for a particular remote to operate the TV or console; whatever you have at hand will probably do the trick.Third, the available media sources better fits my own device catalogue and service preferences. This reason will vary greatly depending on personal tastes, but until now it has been challenging finding a single service that would work ideally for purchasing movies and TV shows. I've used Amazon's Instant Video in the past, which plays nice with both PC and Xbox 360, but sadly there is no Android support and none forthcoming, which rules out playback on my tablet or phone. Since I'm not plugged into the Apple ecosystem iTunes Video is pretty much useless to me. Finally, with the Chromecast I have found a pair of services that work across all my screens with Google Play Video and Google Play Music. With Chromecast, content that before could make it to my desktop, phone, and tablet can finally play back through the TV as well, the final screen in my house that was previously lacking. This has been a huge relief for me, and helped me decide how I wish to purchase new seasons of upcoming shows.There are two obvious downsides to the functionality of Chromecast at the moment. First, the number of primarily supported sources is very limited. Right now it is mostly just Google services (YouTube, Google Play) and Netflix. There are plenty of other content providers who would add a great deal of value to the service, including but certainly not limited to Amazon, Pandora, Spotify, Hulu, and Vimeo. It seems very likely that Google will get these other content providers onboard in a reasonably short time frame, but it is risky to rely on such future business decisions, and right now the number of options you have for Chromecast is decidedly spartan. Second, sometimes control of playback can be a challenge. It is not always easy to make one's way back to the control app on a given device, meaning urgently pausing a movie is no longer as simple as snatching up the remote or controller in your lap, but unlocking a device and switching back to the proper app.The good news is that, like most Google products, the first couple releases are always large-scale dogfooding among the general populace. It is highly likely that Google will continue to improve the value and functionality of the Chromecast over the coming months, and I for one very much look forward to seeing how they improve the gadget.", "verified": true, "helpfulness": "0/0", "author": "Sam F."}, {"rating": 4.0, "review": "The device works as described, but if your TV is on the wall, you'll probably need an extension cord for the power.  Well, unless you have a TV with a powered USB port.", "verified": true, "helpfulness": "1/1", "author": "LeeBo"}, {"rating": 5.0, "review": "I do not have devices to use this with besides my google samsung chromebook. I just used it to stream a phillipine viki.comshow called Amaya to my tv and really love it. The quality of the video is actually better than the quality on the chromebook, but since it is internet video it is not the greatest. The sound is wonderful.  Everything worked so easily. It takes two minutes to set it up, really, even for non techies like me, and poof, you can stream your webpage onto the big screen. What fun!  I am very impressed and happy with it for my purposes.", "verified": false, "helpfulness": "0/0", "author": "Madeleine Dunn"}, {"rating": 4.0, "review": "I received the item after a delay because it was sold out. Installed it into a HDMI slot on my HDTV (Sony) and followed the instructions. It started up and seemed to work okay. Below are the differences in using a HDMI cable from my Android to the HDTV and using a Chromecast player:1. It does not play on my Tablet and the TV at the same time like when using HDMI cable.2. You can actually surf the net on your Android at the same time playing the movie.3. It does not seem to draw on the battery when using Chromecast like HDMI cable. I have only lost about 5% playing almost 2 hours of Walking Dead when it would be 30% or more when using the cable to the TV.4. Also my tablet heats up when using HDMI and it's stone cold when using Chromecast. That is great.5. I am not sure about the video and sound quality when using either one. It seems louder with Chromecast but better quality using HDMI cable. Then again I need to use it for awhile longer before I can make final judgement.6. I also have been using the 1 month free on Netflix and bought on Ebay for $7.49 an extra 3 months using the code someone gave me. I bought this in August and the deadline was July 24th, but a correct code is good until the end of 2013. Normally it would have cost me $24.00 for the extra months. So if anyone is interested just go to Ebay and look for the best deal.So after a few days of using this I think it's a great deal. You will be able to play wireless Netflix, YouTube and Google play movies and music. Hopefully they will come up with more in the future. Now if Amazon would get off their butts and make one for Android to play their Prime Movies it will even be a better buy. I have a $500 Nexus 10 as the Tablet. It is probably one of the best things I have ever bought in my life.I will be back to update this in a couple of months to make a final judgement. Right now I am giving it 4 stars.", "verified": true, "helpfulness": "1/1", "author": "Alan Sheriff \"Texasluva\""}, {"rating": 3.0, "review": "I purchased this because of a review on a local news station.  They had an interview with a person who the station said was from Google.  That person said that Google was constantly upgrading the software on this item so that it works with an ever expanding group of services.After I got it I found out that it did not work with Amazon videos.  Google's information about when they will add services was useless.  Amazon will only say they are working on it.Amazon should be even more specific about this item not working with their videos.  I am sure I am not the only customer that was fooled by this item.It does work well but just not as i was lead to believe.  Spend a little more money and get something that works with more services.Right now, this is a rip off.", "verified": true, "helpfulness": "2/3", "author": "Mike"}, {"rating": 5.0, "review": "Now to be honest , I am loving it. Great on Led TV. I am sure Google will add many more features and will send lots of updates with new applications. This is still it's early days. Give it some time and I am sure it will be wonderful. It is better if you have a good connection. I get a good video qulity as to my connection speed which is MBPS/75down/45up Verizon Fios. Still if your connection is slow...  for now what it does , it is still worth every Cent. I love it.", "verified": true, "helpfulness": "0/1", "author": "Brazil D Uluwita"}, {"rating": 1.0, "review": "I have no idea what people are praising this for. This thing is nothing more than a basic streamer but has been given a fancy name -chromecast.I tossed this in the trash and went back to my Apple TV.", "verified": true, "helpfulness": "1/16", "author": "jumbo"}, {"rating": 5.0, "review": "The Chromecast is the easiest media device to use, period.  My mother, who is not very tech savvy, figured out how to use it by herself in no time.  I have used it for netflix, youtube, and play store and it works great in all cases.  The YouTube app is especially nice since you can browse (and add to queue) more videos while playing one on the TV.  I use Netflix every day and I never go back to my TV app anymore - Chromecast works better/faster/easier.I have even tried to chromecast a video from the web and it worked almost perfectly.  We watched Duck Dynasty streamed from its website on our laptop and cast it to the tv.  It worked great but you need a decent computer to do that - a low powered laptop would not be able to do that well.There is one thing that would make the Chromecast better - more apps.  I would love to see espn and amazon video apps for the Chromecast.", "verified": true, "helpfulness": "0/1", "author": "Lukasz"}]