[{"rating": 5.0, "review": "It is the best way to broadcast your pc/phone/table to the tv and to actually work. Just make sure you are in range of the wifi network.", "verified": true, "helpfulness": "0/1", "author": "Rad"}, {"rating": 5.0, "review": "I was able to set this up in a matter of minutes. If I can do it, anyone can. It's so convenient to watch my shows/movies from Netflix with this device. I highly recommend it. I also love that I can control the TV with the app on my iPhone/iPad.I haven't tried streaming You Tube clips but honestly can't think of why I would want to. All in all, this was a great purchase.", "verified": true, "helpfulness": "0/1", "author": "Michelle \"ThinkBlue\""}, {"rating": 1.0, "review": "requires too much power with wifi,caNT GET GOOD QUALITY VIDEO,requires too much power with wifi,caNT GET GOOD QUALITY VIDEO BG", "verified": true, "helpfulness": "0/5", "author": "pm"}, {"rating": 4.0, "review": "Great device and it was a challenge to get it to work with the Xfinity Arris TG862 router/wireless. I found help online and decided to set the MAC address with filter on the router and it worked. Only had to make a single change. Read where others called Comcast and they wanted a fee to make it work. Now I can catch up on shows that are on late. Hope it keeps working. May add Apple TV later.", "verified": true, "helpfulness": "0/1", "author": "David B. Kundert \"DBK\""}, {"rating": 1.0, "review": "Tried dozens of times to cast something to a bedroom tv not 20 feet from a wi-fi enabled laptop. Got the Chromecast screen, but absolutely nothing came through on this HDTV. What a waste of time. Send several messages to Google about this POS, but no reply. Wow, what a waste of time but fortunately it doesn't cost that much.", "verified": true, "helpfulness": "1/4", "author": "BH"}, {"rating": 2.0, "review": "It would have been nice to know before ordering it... and trying several hours and screwing up our house wireless network.....;(", "verified": true, "helpfulness": "0/1", "author": "Jennifer Mascheck"}, {"rating": 2.0, "review": "Very delayed sound, choppy picture sometimes.  Good idea but has not worked out all of the problems yet.  Would like it if it wasn't so delayed.", "verified": true, "helpfulness": "0/2", "author": "Nichole Veches"}, {"rating": 5.0, "review": "Arrived quickly and in original packaging--chromecast is Easy to set up / easy to use.  Run it from your iPhone!", "verified": true, "helpfulness": "0/1", "author": "L. KUTNICKI \"Rketekt434\""}, {"rating": 4.0, "review": "This was easy to connect and use.  I was disappointed that it only works with SOME apps, and does not allow me to, say, use my iPad to show iTunes-bought movies on the TV.  The suite of apps that support this continues to grow, of course.  Make sure the content you want to use works with it.  If it does, I can only say that it works as expected, no issues.", "verified": true, "helpfulness": "0/0", "author": "P. Canniff \"paul206\""}, {"rating": 4.0, "review": "I ordered this because I have three android phones and a very nice wifi network at home. However it's usability isn't that great. Streaming YouTube and Netflix from my phones work like a charm. However streaming webpages and my desktop with videos stutter like no other and makes things unwatchable. It's a great idea of a device but has a long way in development to be actually good and usable for everyday entertainment streaming.", "verified": true, "helpfulness": "0/0", "author": "AJZ \"~AZ\""}]