[{"rating": 5.0, "review": "This system it kik ass bay owll means incranbull video exultation so far the it is the altemit system off all do not tel me abut ruko apple or any think els they need 2 more years to catche up to this encranubul speed and exultation if u watch amazon movies and gamesThanksDoc shovaqo", "verified": true, "helpfulness": "0/0", "author": "Doc shovaqo"}, {"rating": 4.0, "review": "Pretty good but would be great if Youtube was added", "verified": true, "helpfulness": "0/0", "author": "EC"}, {"rating": 5.0, "review": "Its great TV", "verified": true, "helpfulness": "0/0", "author": "C. Michael Canady"}, {"rating": 5.0, "review": "We love this product. We watch TV shows and movies 3-4 nights a week over what's on DISH. Good quality. So glad we got it.", "verified": true, "helpfulness": "0/0", "author": "Mickimary43"}, {"rating": 5.0, "review": "The best media box hands down. The quad core processor makes this the fastest and best hd unit in the market very clean and new technology looking blends right in with my other electronics thanks Amazon.", "verified": true, "helpfulness": "0/0", "author": "Jesselvarez A"}, {"rating": 4.0, "review": "This product is really, really, good. The only one thing that I don't like is that it doesn't have a built in Roku like feature. Which is casting. Other than that, it packs with nexus 5 specs, which is crazy for $99. I'd rather gave this a 4.5/5, but it doesn't let me, so I'll give it a 4/5. This really is a good TV system. If you are considering to buy this, you won't regret. It's just that you need a work around app that takes a little bit more step in order to cast things from my phone.", "verified": true, "helpfulness": "0/0", "author": "Dorupero"}, {"rating": 5.0, "review": "Have had it for a few months now. Completely replaced my roku. Faster, with better picture. The voice search feature is great, if only for amazon stuff. Can always use www.canistream.it for searching all the other streaming video sites.", "verified": true, "helpfulness": "0/0", "author": "G. E. Hudson \"Game Fiend\""}, {"rating": 1.0, "review": "Not worth it.  There are too many things I don't like about it.  I have an Xbox, BD player, AV receiver, TV, all with apps.  So I thought I'd get the FireTV, figuring that it would be the one place for all apps.  Not only was I wrong, (does not have all the popular aps and instead has a lot of garbage apps) but the experience is awful.", "verified": true, "helpfulness": "1/5", "author": "Baby Jocko \"babyjocko\""}, {"rating": 4.0, "review": "Not as many free shows or movies as I thought there would be as a Prime Member. Great selection if you don't mind paying", "verified": true, "helpfulness": "0/0", "author": "Tom R. Phelps"}, {"rating": 4.0, "review": "Works as advertised. Picture is clearer that my satellite provider picture. However, even though I subscribe to Amazon Prime, it does not give me access to the popular shows my wife and i enjoy watching without additional charges. Perhaps that should be taken as a gig against Amazon Prime and not Fire TV.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]