[{"rating": 5.0, "review": "owesome product.  I have netflix and youtube on my tv from my cell!", "verified": true, "helpfulness": "0/1", "author": "Afrodita \"Afrodita\""}, {"rating": 5.0, "review": "Love It", "verified": true, "helpfulness": "0/0", "author": "Tamara Caesar \"Mara3680\""}, {"rating": 5.0, "review": "took me a couple times to set up - but works just fine, fun to shoot to the TV and continue with regular web browser no interference and using windows 8.1 seems no hassle as was trying to download it to tablet but will retry again in a few when more comfortable of how program runs.  Use this also for teaching at the church and compact for packing", "verified": true, "helpfulness": "0/0", "author": "W. Finnegan"}, {"rating": 2.0, "review": "Easy installation but very limited in available media.", "verified": true, "helpfulness": "0/0", "author": "R. Scholz"}, {"rating": 5.0, "review": "The device works great and it is easy to set up.", "verified": true, "helpfulness": "0/0", "author": "R. Lee"}, {"rating": 5.0, "review": "When Chromecase first came out it didn't offer many channels or options. It has lots of options now and it is so easy to use from my cell phone or iPad. It is great! Love it.", "verified": true, "helpfulness": "0/0", "author": "bslo"}, {"rating": 5.0, "review": "Working very well.", "verified": true, "helpfulness": "0/0", "author": "Mangesh"}, {"rating": 5.0, "review": "I love it it works with all of my devices great", "verified": false, "helpfulness": "0/0", "author": "jerryleetilley"}, {"rating": 5.0, "review": "recommended!", "verified": true, "helpfulness": "0/0", "author": "Daniel Vannucchi"}, {"rating": 5.0, "review": "So far so good. Just got it..set up took literally 5 minutes on my laptop. I like it, it hasn't lagged only if I'm running alot of tabs on the Google chrome browser. I like the fact that I can minimize the screen go to safari and multi task and it will still play on the screen uninterrupted.  Just wish I could display anything in my laptop and not just websites on google chrome. But I'm pretty sure they are working on that feature", "verified": true, "helpfulness": "0/0", "author": "Lovely Kamara"}]