[{"rating": 3.0, "review": "i was under the impression that you could play the videos right from the phone without the need of wifi. still havent set it up since i dont have wifi at home", "verified": true, "helpfulness": "0/0", "author": "salvador marquez"}, {"rating": 3.0, "review": "You probably wont be using this too much but its a cool concept and its cheap its really small too and i like the packaging", "verified": true, "helpfulness": "0/0", "author": "Albert B."}, {"rating": 5.0, "review": "This gadget can let you watch computer, just like a TV,any web site you can access, this item can \"cast\" to your tv, with minimum amounts of setup.  Great for $30 - $35.00", "verified": true, "helpfulness": "0/0", "author": "Mr & Mrs We Care"}, {"rating": 4.0, "review": "For a while, I was looking for something to play Netflix on my bedroom tv without breaking the bank. I stumbled upon this little guy, and it's perfect for me! I use it with my iPad and iPhone 4S, and it works beautifully. Good picture, decent controls, and easy to set up. I put only 4 stars just because of the lack of apps available. But if you're looking for a cheap way to watch YouTube, Netflix, or a few other apps on your tv, I recommend it (I also suggest looking at the compatible apps on their site before buying as well)", "verified": true, "helpfulness": "0/0", "author": "Daniel"}, {"rating": 5.0, "review": "Can't believe this thing is so cheap for what it does. I love pulling amazon prime content from my computer over when my ps3 is not available and it's fun to share youtube clips in a party setting. My TV is properly equipped so that the chromecast can turn the TV on and switch it to the proper input when casting begins. I haven't tried attaching the chromecast to my AV system yet but I've heard certain AV systems can do it.The only thing that lags is full screen hulu from computer to chromecast but I believe that is an issue with data speeds of my wifi. With more apps developing compatibility with chromecast, I am excited to see what is next.", "verified": true, "helpfulness": "0/0", "author": "carpenttree"}, {"rating": 5.0, "review": "I had a Roku 1 for about 3 years before its performance just started to lets just say \"buffer\".  I couldnt watch anything without eternal buffering or losing network connection with a router 20 feet away.  Got the Chromecast and I havent looked back.  I just use my phone to access the media and cast it to the TV!  I really like this as a cheap way to turn a non cable connected TV into a partial media center.  Im just waiting on more apps and media sources now.", "verified": true, "helpfulness": "0/0", "author": "LosPinas"}, {"rating": 5.0, "review": "very satisfied", "verified": true, "helpfulness": "0/0", "author": "Guillermo Rosado"}, {"rating": 2.0, "review": "I am sure this product is good.  What you have to know is you need a 2.4 gh processor or above  It doesn't work with Vista.  Only Windows 7 and above is what the instructions say.  Anything below 2.4 gh processor is gong to be choppy.  Words don't match the movements of the mouth sort of thing.  Uses lots of power and slows your computer down with anything under 2.4.  If you don't have the required, skip the purchase.  I returned mine, and the one I bought for my daughter.  Nice concept if you have a super computer.", "verified": false, "helpfulness": "0/0", "author": "A. Kay"}, {"rating": 5.0, "review": "Plug it into your TV or receivers empty HDMI slot, follow the simple instructions and in just a couple of minutes you are streaming Youtube video (and other content) from your phone, Laptop or tablet to the big screen. It's so nice to have the big picture and sound.", "verified": true, "helpfulness": "0/0", "author": "Victor Wright"}, {"rating": 4.0, "review": "I haven't used it as much as I would like.  I'm not sure how long I should wait for the new apps to show support but for the ones that it does have support for like Netflix and HBO go it's great.  I would like to ditch my Direct TV and use it along with other subscription services to get my entertainment.", "verified": true, "helpfulness": "0/0", "author": "Ibrahim M. Ghalaini \"Ibrahim G.\""}]