[{"rating": 1.0, "review": "Does not work properly. Has not worked right since I got it. Tried on 3 different internet services, each one faster than the one before, and none seems fast enough. Did all the troubleshooting. Customer support is lousy. I sent email with no response. Really ruined my holidays as I have not been able to enjoy any of the movies I looked forward to. It was mainly a gift for my 88 year old mother who is home bound. I guess I will get cable or satellite as this does not work right. Big waste of time and money. My experience with Fire TV is a big disappointment and I will not continue or renew Prime.", "verified": true, "helpfulness": "3/5", "author": "Tsigani"}, {"rating": 5.0, "review": "East to set up and use.  Snychs to your prime account wishlist with ease. Great for binge watching seasons.", "verified": true, "helpfulness": "0/0", "author": "John W. Ewart II"}, {"rating": 5.0, "review": "I have had plenty of these devices like the Logitech Revue, Sony NSZ-GS7 & GS8, Roku 2 & 3, and the Vizio Costar.  The Amazon Fire TV is far and away better product than any of those that I have tried.  I use it exclusively as a client that talks to my media server at home.  It has no lag or delay when playing any of media.  All of the other devices were definitely slower than the Fire TV. Only thing I wish it had is aHDMI input and output ports.  I love that feature, the Revue and Sony GS7/8 has it. But other than that I would recommend this product to anyone looking for these type of devices.", "verified": true, "helpfulness": "0/1", "author": "Von Anthony"}, {"rating": 4.0, "review": "ProsI do like the Amazon Fire Tv.  The menus are easy to navigate and make logical sense.  I use it mostly for Amazon prime videos, netflix, and hulu and they all work well on this device. And the speak and search function is really accurate and convenient.ConsThere is a drawback to this device that I was not aware of at the time of purchase.  Depending on your TV provider you may not be able to stream all of your streaming services/apps to this device.  A good popular example with some catches is HBO GO. Even though there is an HBO GO app for Fire TV you may not be be to activate it.  Check with your cable provider and the streaming sight to see if they are supported on Amazon Fire TV first before you buy this device.", "verified": true, "helpfulness": "0/0", "author": "RCAndrus"}, {"rating": 5.0, "review": "Simple, fast and easy to use!", "verified": true, "helpfulness": "0/0", "author": "deek"}, {"rating": 4.0, "review": "It's what I expected. The voice search is cool, just wish it worked on all the apps.", "verified": true, "helpfulness": "0/0", "author": "Mikhael Gajic"}, {"rating": 5.0, "review": "If you put xbmc(kodi) on here this is well worth the $70-100 that u spent on it.", "verified": true, "helpfulness": "0/0", "author": "bryan nakashima"}, {"rating": 5.0, "review": "Cool little device ,  simple to set up and works smooth.  Prime & Netflix work great.", "verified": true, "helpfulness": "0/0", "author": "Marc F \"Bocce King\""}, {"rating": 5.0, "review": "Love the performance of the user experience. Very snappy and fluid", "verified": true, "helpfulness": "0/0", "author": "David C. Stewart"}, {"rating": 3.0, "review": "This is a question what if I have want to watch Netflix r any other one of the others would I have to get all of them r will they be ready to use when I get them I need three?", "verified": false, "helpfulness": "0/2", "author": "Cassandra guidry"}]