[{"rating": 4.0, "review": "Would have helped if the instructions were more clear. Required more technical expertise than this 77 yr. old man has.Forced to request assistance from my son who is an SE at IBM. Took us about 40 minutes over the phone. Otherwise worksgreat once you get past the installation.", "verified": true, "helpfulness": "0/0", "author": "Walter Thyer"}, {"rating": 5.0, "review": "I LOVE IT!!!!! easy to use, and innovative way to watch youtube or Netflex and stream it either from your phone or computer... the best investment I ever made with a $35!! GO GOOGLE!", "verified": true, "helpfulness": "0/0", "author": "ANK2"}, {"rating": 3.0, "review": "Need more apps! Hardware is nothing without apps. although this is my second purchase, functionality is very limited. My Apple frfiends are laughing.", "verified": true, "helpfulness": "0/0", "author": "cma2001"}, {"rating": 3.0, "review": "It's great when it works, audio and picture quality if excellent. However, my iPhone and iPad don't \"see\" it as available at least half the time. I've re-set it up as a new device multiple times, but I still have problems. And of course, the tech support people are the only ones who work less than the government, so good luck getting help from them unless you take a day off to call when they're actually there.", "verified": true, "helpfulness": "0/0", "author": "A. Bullock \"slicktop\""}, {"rating": 5.0, "review": "For the price you cannot beat this thing. Just the ability to play Youtube and Netflix is worth it for me, especially with kids. Hopefully they continue to add more supported apps to make it even more valuable.", "verified": true, "helpfulness": "0/0", "author": "R.J."}, {"rating": 5.0, "review": "Works great with computer, tablet and phone.  Easier to set up on my tablet than on my computer, but working great.", "verified": true, "helpfulness": "0/0", "author": "skloucks"}, {"rating": 5.0, "review": "It is a must have for any android user got it out of the box was easy to setup. I kept watching hulu on and the best part is I can watch it on my projector and then flip back to my cellphone or tablet when I walk away and watch there and then throw it back up onto the big screen when I get back to the media room.Enough Said!", "verified": true, "helpfulness": "0/0", "author": "HKing"}, {"rating": 4.0, "review": "Especially at thirty five dollars! This newer technology from Google has basically one function: it connects to your flat screen and wirelessly streams data from nearly any mobile device to the TV, including video. So, you plug the Chromecast into the back of your TV using one of its HDMI ports, wirelessly connect the device to your home network (yes, this little device is a wireless device that uses your home network, so you must connect it to your network, just like you do everything else, including your smart phone, your laptop, your tablet, etc.), then install one of the Chromecast apps on either your tablet or PC (including the Google Chrome browser, which is Chromecast aware), and then you fiddle around until you will see the content on your mobile device showing up on your TV.The interesting thing about this is that, sitting on your couch with tablet in hand, you can browse YouTube, NetFlix, etc, etc. (more applets are added over time) and then watch them on your large TV screen. It's like having a projection device without all the cables, and much more convenient, because once you have all the configurations set and the apps installed, it's like having a huge screen tablet or PC on which to watch your content!Is it ready for prime time? Yes, but \"yes\" at about 80%. There are still some apps we would wish to see, and not every device you have is equally supported. And I've had some issues where, after watching something on YouTube (on my second generation Nexus 7, no less), the system freezes up, and I have to disconnect and reconnect to move forward to the next thing. Resolution is generally good, but it's not going to look like your Blu-Ray player in terms of sharpness. And configuring the Chromecast to connect to your router may require changing some router settings. And again, my own mobile device is Google's own Nexus 7 (2nd generation), and even it is not 100% perfect in functionality with Chromecast, so you cannot expect absolute perfection yet in terms of functionality.But as this is a new technological device, and because it brings new functionality to your home computer-based devices, and because the price is so affordable (think of what the case would be if this device had been priced at $100, instead of $35), its really worth trying out and getting to know. It will likely turn out to be a lot of fun and give you some new ways to watch digital media. Four stars out of five, and it will probably move to a \"five over time as more apps are released.", "verified": true, "helpfulness": "1/2", "author": "Ray \"A Reader\""}, {"rating": 5.0, "review": "Great product. Able to stream all of my favorite shows off of my ipad on to the TV. Would recommend.", "verified": true, "helpfulness": "0/0", "author": "Nina"}, {"rating": 4.0, "review": "Works great and as advertised when plugged directly into the HDMI port on our TV. However, when I tried to \"permanently\" install using an A/B switch to choose between Chromecast and normal cable feed, it would not work. I don't know if this problem lies with  Chromecast or in the A/B switch I chose. Bottom line: Chromecast works well when used precisely as directed.", "verified": true, "helpfulness": "1/1", "author": "Mark D. Robinson \"Maine Islander\""}]