[{"rating": 5.0, "review": "Very nice tool to watch wirelessly. Enjoy using this a lot. Easy installation, a real breeze to hook up and use.", "verified": true, "helpfulness": "0/0", "author": "Keith B."}, {"rating": 5.0, "review": "Now that the API is available, more and more apps are using the Chromecast so it becomes easier to use.It is the most simple option once an app integrates Chromecast support. Plug in the Chromecast and set it up, when you're on the same WIFI as the Chromecast an icon will show up on your app. Press it and it begins casting.It stays in hibernation mode until you use it, no need to turn it on or plug it in whenever you want to use it.Also, if you have a smart TV and you're watching cable or something and then you press the cast button on an app, the Chromecast signal will automatically tell your TV to switch to the Chromecast input as it begins casting.", "verified": true, "helpfulness": "0/0", "author": "J. Kile"}, {"rating": 5.0, "review": "Lots of my Android apps can be sent to the living room tv for viewing or listening. Very useful for watching Youtube.", "verified": true, "helpfulness": "0/0", "author": "daniel cranmore \"dcreed\""}, {"rating": 1.0, "review": "I already had Apple TV and so I tried this because it was cheap to use on on another TV.Honestly if you have an apple device pay the little extra and get Apple TV it is soooo much better! This is so limited in its use and the quality is not good.Put it this way, I tried it connected through my IPhone right next to the TV, the TV was in the same room as my router which is supplied by FIOS (extremely fast internet speeds) and the quality of netflix was so compromized! you can use it for Netflix and a handful of other sites but you can't stream for example what is on your phone or tablet which is really poor in this day and age of technology.Mine is back in the box gathering dust sorry.", "verified": false, "helpfulness": "1/4", "author": "MickKnowles"}, {"rating": 1.0, "review": "this product only displays google apps onto the tv. miracast displays the entire screen no matter what youre doing. google failed.", "verified": true, "helpfulness": "0/3", "author": "Bryan Anderson"}, {"rating": 4.0, "review": "I cancelled cable a little over a year ago so everything we watch we stream through the Xbox or our Roku players. I was really excited when I found out that the Chromcast would allow for anything through the Chrome browser to be streamed through your TV. It works! However the only thing that works seamlessly is the You Tube app. When I stream from other sites that are not supported through the app it's choppy and pauses a lot. I am specifically talking about streaming tv shows and movies on unsupported sites. I believe once they improve the quality of the streaming through the browser this will be my go to streaming device. My husband could watch You Tube all day if he were able to.Quick recap:ProsYou Tube straight to your TVYou can use phones, tablets, or PCs as a remoteStreams any site through the Google Chrome Browser to the TVConsFew apps to support it at this time (compared to other devices,) but more being addedStreaming through the Chrome browser can be choppy and frustratingAfter all is said and done I would still buy this item as it is only $35 and has awesome potential.", "verified": true, "helpfulness": "0/0", "author": "Happy Buyer"}, {"rating": 5.0, "review": "This product works as advertised. I love throwing videos from my phone and laptop up on the TV for everyone to watch!", "verified": true, "helpfulness": "0/0", "author": "Dylan J Thompson"}, {"rating": 4.0, "review": "This was very easy to set up. I plugged it in, downloaded a few things on my laptop, and voila! It played.", "verified": true, "helpfulness": "0/0", "author": "Mordecai"}, {"rating": 4.0, "review": "It was a pain in the rear to set up.  Check the setup requirements, i'm a savvy network administrator and I did not have a single device at home that was capable of setting up the chromecast w/o significant upgrades.  It was further complicated by no broadcasting the SSID of my network.  This required a call to google tech support.  Several days later they sent an e-mail w/ some suggestions, though they seemed stumped.  It mysteriously started working.There is NO user interface whatsoever which is a smidge annoying but it has worked quite reliably since getting past the installation troubles.", "verified": true, "helpfulness": "0/0", "author": "Matt Monsour"}, {"rating": 3.0, "review": "Easy to install.Can not view video at HD and full screen.  Video and sound not synced, (think old Godzilla movie with dubbed voices) video drops out and sections of picture go missing.IF I reduce resolution to 144dpi or 240 max these problems disappear.Internet connection is 20mb and WiFi is high band.  Expected a lot more from Google.You get what you pay for, $30 and you get low end video.", "verified": true, "helpfulness": "0/0", "author": "Mark"}]