[{"rating": 4.0, "review": "Have tried this and the Roku 3. This item works great but because it needs a smartphone or tablet I would consider it more techie than the Roku3. Mine got pretty hot when using the USB at its power. Used my Instaoutlet for the power and didn't get near as hot. Not sure why.", "verified": true, "helpfulness": "0/0", "author": "Jill Kaskel"}, {"rating": 5.0, "review": "This thing is great. Now that HBO Go is available, I can watch that app on my TV instead of on tablets. I can't wait for more apps to be added.", "verified": true, "helpfulness": "0/0", "author": "Dan R \"Dan R\""}, {"rating": 5.0, "review": "I love this thing and as time passes and more apps are compatible with it I'm gonna love it even more.", "verified": true, "helpfulness": "0/0", "author": "mahmoud hassan"}, {"rating": 4.0, "review": "My Xbox 360 recently died so I was looking for a quick and easy way to watch Netflix, HBO and YouTube without having to hook my computer up and mirror the screen. Lo and behold the Google Chromecast!  Based on the specs I was pretty excited since they supported apps fall squarely in my usage pattern.  In particular, I stream a lot of live content from YouTube--mainly cricket broadcasts, so was hoping this would allow me to watch, and surf the web at the same time.  Sadly, while the support of static YouTube, Netflix, and mirroring is pretty responsive, it is a dud with live streaming--I simply could not get it to work, and YouTube also error'ed out.  It's great if you want to do do a House of Cards marathon, but not useful if you are trying to stream the Oscars or Golden Globes.Pros:Easy to setupWorks well with Netflix and Youtube static contentTravels well (hotel rooms, friends houses)Cons:Does not support live streams on YouTubePower cord is really quite short", "verified": true, "helpfulness": "0/0", "author": "Raka"}, {"rating": 5.0, "review": "For $35, this thing is a must have.  It makes a great gift for anyone who watches TV shows online.Works great with products that are fully Chromecast integrated (e.g. Netflix, Hulu, Play, YouTube).  With other online streaming (using tab casting) you may have issues that force you to play the video at 480p instead of 720p in order to cut back stuttering.  Some part of that could be limitations of my router, but the complaint seems to be fairly common.  That being said, more major websites seem to be adding Chromecast, so this product will keep getting better.My only complaint is that this device is wireless 802.11n and not 802.11ac.  We can only hope that there will be future versions with greater video capabilities, and limiting the hardware to N means that any future higher def Chromecast is going to need a new piece of hardware instead of a firmware patch.", "verified": true, "helpfulness": "0/0", "author": "Netchel"}, {"rating": 5.0, "review": "its cheap, it works, its easy to setup and use.  I would sell my kidney and buy 400 of them if I could.", "verified": true, "helpfulness": "0/1", "author": "JPR \"sinewave\""}, {"rating": 1.0, "review": "It is not doing what it says; like streaming video's and photo's. Also it only supports Youtube and Netflix on my IPhone; I allready got that in my TV and DVD player so it is basicly a waste of money", "verified": true, "helpfulness": "3/6", "author": "Johannes M. Kraakman"}, {"rating": 4.0, "review": "It usually works pretty well, it's very obvious that this is a first-edition. Sometimes the streaming is a bit spotty but overall I think it is most definitely worth the low price tag attached to it.", "verified": true, "helpfulness": "0/0", "author": "amken"}, {"rating": 5.0, "review": "For what its purpose is, you just can't beat the value.  Impulse buy by a long shot.  Be sure to have a good router to support the best possible 2.4ghz speed if you play on using HD streaming.", "verified": false, "helpfulness": "0/0", "author": "JT"}, {"rating": 1.0, "review": "I don't know what else I can do with it besides playing YouTube video, because I don't have Hulu or Neflex account which requires subscription!", "verified": true, "helpfulness": "2/9", "author": "Song"}]