[{"rating": 5.0, "review": "I stream the app Avia  to it and it works great .I am watching a lot of movies with it .", "verified": true, "helpfulness": "0/0", "author": "Amado Garcia"}, {"rating": 4.0, "review": "Easy to set up, works well. For $35 it's a great deal. Unfortunately it doesn't work with my desktop PC.  My desktop is wired through the router so I thought it would. However, it works fine with my laptop tablet and phone.", "verified": true, "helpfulness": "0/0", "author": "Nathaniel Harris"}, {"rating": 5.0, "review": "Fantastic. Great for someone like me who relies on hulu and netflix for tv. And a great price to top it off. I would recommend.", "verified": true, "helpfulness": "0/0", "author": "Kaitlin Maloney"}, {"rating": 5.0, "review": "Simply plug it into you TV and go. It works as intended. I would definitely recommend it over Roku or Apple TV.", "verified": true, "helpfulness": "0/0", "author": "leadora"}, {"rating": 5.0, "review": "The thing is awesome and the best for the price for sure. I recommend it to everyone out their. 😊", "verified": true, "helpfulness": "0/0", "author": "Scott S"}, {"rating": 5.0, "review": "It works very well with my TV. Now can seamlessly stream my video from various handheld device to my TV", "verified": true, "helpfulness": "0/0", "author": "Dang Nam Hai"}, {"rating": 5.0, "review": "Awesome product. It does exactly what it needs to do and does it well. And all at a great price. I got 2 to try it out and liked it so much I got a couple more as gifts.", "verified": true, "helpfulness": "0/0", "author": "Jason Croes"}, {"rating": 5.0, "review": "Gave it the 5 star rating because it changed the way I watched TV.  In a word, this device is incredible.  And, for what it does the price is very low.", "verified": true, "helpfulness": "0/0", "author": "George Ruehling"}, {"rating": 3.0, "review": "I have been thrilled idea of Chromecast, but as I found out you can only play Youtube and Netflix over the air... so far I am happy with the unit, sad about the lack of connectivity to all the other content I cannot get though my IPAD. Fix that and 5 stars.", "verified": true, "helpfulness": "1/1", "author": "Music Maineiac \"musicianscorner\""}, {"rating": 3.0, "review": "cool product but lacks software support for most applications.you cannot protect pictures from any mobile device until additional software is available.additional application will allow more usefulness of this product.", "verified": true, "helpfulness": "0/0", "author": "daniel wasilausky"}]