[{"rating": 4.0, "review": "It was very easy to set up and works consistently with anything streaming. Bye cable tv, we may just stream Netflix and Amazon Prime now", "verified": true, "helpfulness": "0/0", "author": "lorraine"}, {"rating": 3.0, "review": "Short on applications.  Nice if a person could get into personal files like pictures, videos, etc.  Thanks for your time.", "verified": true, "helpfulness": "0/0", "author": "Robert W. Keeler"}, {"rating": 5.0, "review": "We bought it to cast from the iPAD or desktop. It allowed us to unplug cable. I'd like to see it be able to cast from the Chrome browser from the iPAD as it does from the PC. The cool thing is that the connection between the iPAD/PC and the television is all wireless, and I don't even have a smart TV, although, fortunately I had an HDMI port on the television, which is key.", "verified": true, "helpfulness": "0/0", "author": "smiling.in.hicksville"}, {"rating": 5.0, "review": "Was what I expected and arrived in full working order.  I had to do some moderate futzing with my AT&T; wireless settings to get it to work but otherwise very easy to set up and use", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "The apple TV is far beyond what this unit is capable of. Less apps and things to choose from. Also..if your wifi is iffy and picks up another signal..it screws up this signal and disconnects. Sorry…but the apple tv for $99 has a HUGE advantage.", "verified": true, "helpfulness": "0/0", "author": "Cliff \"Gunite\""}, {"rating": 3.0, "review": "the reason i am not a huge fan of the chromecast is you cant cast everything you want like on a apple tv! if they would let you cast photos or dvds or something of that sort i would definately give it 5 stars. but it also is a lot cheaper than the apple tv which is why i got it", "verified": false, "helpfulness": "0/0", "author": "Andrea W."}, {"rating": 5.0, "review": "The Chromecast was very east to install land start using. Although I had just a bit of trouble at first (pilot error), I called Google and got a very quick response that solved my problems. I know there are other products that perform the same function but what excites me about Chromecast is that it is new and has a lot of promising developments to come I'm sure. I know because I have a family member that works for Google.", "verified": true, "helpfulness": "0/0", "author": "Riviera Imaging, Inc."}, {"rating": 4.0, "review": "Highly recommend!  I don't have cable or satellite so Netflix and Hulu are my main source of entertainment.  Sometimes it jumps to a lower res while buffering, but it comes right back within a few seconds.  I just wish Chromecast supported more aps!!!  Where's Amazon Prime's Instant Video!?!?!", "verified": true, "helpfulness": "0/0", "author": "Markus"}, {"rating": 4.0, "review": "I love this.  It's so easy to use.  The only issue I've had is that it must received a fully strong signal, or it wants to buffer.  Once that was resolved, it has worked flawlessly.  I would give it 5 stars if Google would add more streaming options, such as Amazon Video on Demand.", "verified": true, "helpfulness": "0/0", "author": "Stephanie Harrison"}, {"rating": 4.0, "review": "had high hopes for this; thought i could sling any streaming internet content to my tv but that is not the case, it's only good for about six providers, two of which are fee based ( netflix and hulu plus), but i'm burning up you tube with it so okay. in time i hope it offers more content.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}]