[{"rating": 5.0, "review": "I love itIt's simple to use", "verified": true, "helpfulness": "0/0", "author": "Hesham Tariq"}, {"rating": 3.0, "review": "it is fair to say it is limited to youtube casting and nothing else. little disappointed.", "verified": true, "helpfulness": "0/0", "author": "AG"}, {"rating": 5.0, "review": "Amazing idea Google!!!  I love it!However!!!  Your WIFI needs to be strong enough for it to work... so if you have weak signal, it may not work.... BUT, it does make the wifi work better than just using wifi directly !!!!  Imagine that?", "verified": true, "helpfulness": "0/0", "author": "Carmen Patton"}, {"rating": 5.0, "review": "I love my chromecast!", "verified": true, "helpfulness": "0/0", "author": "Christopher Burke"}, {"rating": 5.0, "review": "As was described, was delivered quickly and was packaged well. Good price too.", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 3.0, "review": "Excellent concept but had connectivity issue. It takes 3 to tango... computer, media player and internet... when everything is working well... Excellent ! When one of those is failing... no comment...", "verified": true, "helpfulness": "0/0", "author": "bob 2012"}, {"rating": 5.0, "review": "This is an incredible device. I've been nothing but satisfied with it since purchasing. I'll sometimes use my tablet or my phone to play my Google Play Music or watch YouTube, or even Netflix from my device! Extremely easy to use and most definitely worth the price! Another excellent product....", "verified": true, "helpfulness": "0/0", "author": "Charlie"}, {"rating": 5.0, "review": "It changed everything for me...I love this and it works good", "verified": true, "helpfulness": "0/0", "author": "brighteyes"}, {"rating": 5.0, "review": "Wonderful purchase! Great for a 720p tv. While I do have a new Smart TV,  my older, little Sharp 720p tv seemed like I was going to have to donate it because I didn't know when I bought it a few years ago that I would have trouble streaming Netflix or Pandora on it like the 1080p tvs, which Apple TV doesn't easily work on 720p.This little gem is a must for anyone who does not have a smart tv nor do they need to purchase a new tv. You can use your laptop or smart phone or media device (I have an ipod touch) to set it up, which takes minutes to do. This is affordable enough to have on different tvs around the house. I streamed Pandora on it and Netflix and I just couldn't be any happier with this product!Just be sure that you already have internet and you're good to go!", "verified": true, "helpfulness": "0/0", "author": "Diamond Star"}, {"rating": 5.0, "review": "I have a roku for me and my roommate to use but I wanted something to use in my room so I decided to try to chromecast after reading reviews on Amazon.Now Im thinking about getting rid of the roku and buying a second chromecast.The picture is always the highest quality. The only down side is when you use the cast to stream media from your laptop there is a slight lag so I use my phone to tablet to control my cast.", "verified": true, "helpfulness": "0/0", "author": "chris olsen"}]