[{"rating": 5.0, "review": "Awesome!", "verified": true, "helpfulness": "0/0", "author": "Charles Burnett"}, {"rating": 3.0, "review": "Not unhappy with it, But.....", "verified": true, "helpfulness": "0/1", "author": "nbpk"}, {"rating": 3.0, "review": "Once we got it working consistently, I really enjoy it.  However, getting it to that point took a long time.  Months of trial and error and troubleshooting and updates.  If you can get a good wireless signal it should be find, if you have just okay wireless, I wouldn't recommend it.", "verified": true, "helpfulness": "0/0", "author": "_Aos_"}, {"rating": 4.0, "review": "It Works perfectly, you can use it with lot of sources. I used with netflix and Works great !!! The only comply is that you can't use it with vídeos on your computer without an external software.", "verified": true, "helpfulness": "0/1", "author": "Alexis Flores"}, {"rating": 3.0, "review": "easy to set up but not sure if it will work as well as i hoped have watched one hulu show and it quit half way through hopefully i can get it to work better", "verified": true, "helpfulness": "0/0", "author": "dan mannebach"}, {"rating": 5.0, "review": "I have one (not an Amazon purchase) and after reading a number of reviews, I have these comments:Chromecast seems most compatible with Android devices or the Chrome operating system. I use a Nexus 7 or an Acer Chromebook (IMO best choice for a standby internet home computer) to access the device. It doesn't surprise me that some users have problems with IOS or Windows - Google CHROMECAST, right?Once set up I have had NO problems watching YouTube movies or anything else on YouTube thru my HDTV. Do you have to think & choose and operate things to make sure you have or to manage a connection? Of course! This is WIFI stuff - we expect things to get a little quirky sometimes. I don't bother with Netflix or any other subscription service ... there's so much out there gratis. There are Chromecast compatible internet radio apps. IHeart is planning compatibility soon. Pandora is compatible. Connect your TV to your sound system & enjoy for only $35.", "verified": false, "helpfulness": "0/0", "author": "AJL"}, {"rating": 4.0, "review": "I am still learning what it can do. When I get it to work correctly it works fine! I recently upgraded my laptop to 8.1pro and I have an app (which you can't get anymore I think) called Youtube Art and I can actually download youtube to my hard drive and play on my hdtv with the Chromecast.I am talking LFL Jacksonville Breeze!  We have a great defense this year!", "verified": true, "helpfulness": "0/0", "author": "Richard  Owens"}, {"rating": 5.0, "review": "Easy to set up.  Works great,  very user friendly. That's all I have to say about that I am out", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 2.0, "review": "A major disappointment. Try to show a video from Youtube or netflix on IOS, and 1/2 the time it cant find the chromecast, the other 1/2 the time I have to literally restart my iPad and the chromecast button MIGHT show up in the interface for the app.  Bought mine straight from Google Play.", "verified": false, "helpfulness": "0/0", "author": "Greg LaPalomento"}, {"rating": 5.0, "review": "I have Netflix but wanted to try something different like you tube which is not offered on Netflix. Chromecast was just what was needed and streams just fine,Thank you", "verified": true, "helpfulness": "0/0", "author": "dfern22"}]