[{"rating": 5.0, "review": "Love it!!", "verified": true, "helpfulness": "0/0", "author": "terry harrison"}, {"rating": 5.0, "review": "Does everything it says it does!!!", "verified": true, "helpfulness": "0/0", "author": "william emery"}, {"rating": 5.0, "review": "its so easy to use , I just love it!", "verified": true, "helpfulness": "0/0", "author": "saundra davies"}, {"rating": 3.0, "review": "Its good but I can't use hbogo  and showtime apps because my internet provider won't support. Comcast by the way or should I say Comcash!", "verified": true, "helpfulness": "0/0", "author": "James A. Bishop"}, {"rating": 5.0, "review": "Very easy to set up. Very easy to use. Can't wait to cut the cable chord. All I need now is a digital antenna.", "verified": true, "helpfulness": "0/1", "author": "Anthony Funaro"}, {"rating": 5.0, "review": "A must have if you are a Prime member. I think I like it better than my Apple TV. Liked it so much I bought one for for my son and one for my daughter.", "verified": false, "helpfulness": "0/0", "author": "Yolosdca"}, {"rating": 5.0, "review": "I love this thing.  Seriously.  We've used our Blu-ray player, a first-generation Roku, our Wii, and our computer to stream content to our TV, but this is my favorite device to do so.  Our Sony blu-ray player had a terrible netflix interface that I kept hoping in vain they'd update since we dropped cable a couple years ago.  Our Wii is connected in standard definition, so it's not ideal either.  The Roku was good while it lasted, but it eventually died.  The Amazon Fire TV has been our Go-to content device since we got it, and I prefer it to the Roku.  It's more flexible (can run some android apps) and a nicer interface.", "verified": true, "helpfulness": "0/0", "author": "Benjamin J. Caracello"}, {"rating": 5.0, "review": "Fantastic product.  Fast, fluid, and intuitive.  5 Stars!", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 5.0, "review": "I got it for my granddaughter and my two great grandsons they love it", "verified": true, "helpfulness": "0/0", "author": "Mary Leighton"}, {"rating": 4.0, "review": "The system is easy to use.  I was surprised at how many movies available to rent are much older than ones included with Prime.  Seems odd, but maybe it has something to do with rights.  It is also much easier to add movies to your watch list from the computer vs. on the Fire TV.", "verified": true, "helpfulness": "0/0", "author": "JosieOBX"}]