[{"rating": 5.0, "review": "This thing is awesome for anyone who regularly uses Netflix or other apps to stream tv/movies. Both our tv and blu-ray player are wi-fi enabled, but they take forever to turn on, connect, and choose the apps. Since the Chromecast can be controlled either by Apple or Android hand-held devices, it's awesome. Perhaps the coolest feature is that it automatically turns on the tv and chooses the correct video source, so I no longer have to deal with 2-3 different remotes.", "verified": true, "helpfulness": "0/0", "author": "Francophile Américaine"}, {"rating": 5.0, "review": "it Works great, awesome product. it Works for netflix, and YouTube. the setting up it's  so easy. i recommend it", "verified": true, "helpfulness": "0/0", "author": "GASTON TORRES"}, {"rating": 5.0, "review": "I was lucky enough to get one of these in the first days it was offered with the Netflix promotion.  After using it for about 4 months not, I can say that I would have paid full price for it as well.  We use it for our TV in our bedroom and it's great for being able to watch a streaming show while still surfing the internet on the iPad.  It doesn't have as many features as a Roku, but for the price the features can't be beat.  A great item to put in a guest room!", "verified": true, "helpfulness": "0/1", "author": "Annie K."}, {"rating": 1.0, "review": "This thing is a useless piece of junk. It only works about half of the time and when it does work it skips and buffers like crazy. It is located about 3 feet from my router and yet is almost never detected. It has been set up properly and I get the same results from my phone, iPad, and laptop. I can't believe that google would release a product so heinous! I would rather smash it to pieces for its insolence than return it! Hurumph!", "verified": false, "helpfulness": "18/22", "author": "michael papale"}, {"rating": 5.0, "review": "Works Just Fine.Able to use most of my devices. And the pictures looks great and this is the end of my rating.", "verified": true, "helpfulness": "0/1", "author": "Wray \"Rā\""}, {"rating": 5.0, "review": "I have to say that i use Chromecast at least 3 times a week when i'm relaxing and watching youtube videos and also great to use Pandora during parties", "verified": true, "helpfulness": "0/0", "author": "Marc B"}, {"rating": 5.0, "review": "The Chromecast, in all honesty, is kind of useless without software. Watching YouTube on TV? YAWN.However, Plex recently released software that works with Chromecast. I can \"cast\" my movies/tv shows right from the Plex iOS app! Brilliant!", "verified": true, "helpfulness": "0/1", "author": "Dustin Brewer"}, {"rating": 4.0, "review": "Easy to use, setup was quick.  The quality of the video's streamed from netflix, youtube are great.  recommended to those that are looking for a low cost streaming player", "verified": true, "helpfulness": "0/1", "author": "NeoOwnz"}, {"rating": 5.0, "review": "We enjoy our Chromecast tremendously. It was easy to set-up and pair with our phones, laptop and tablet and running youtube, netflix, and pandora with ease. I am sure that it has many capabilities that we have yet to take advantage of as we have not had it for long and are still learning. Very impressed so far.", "verified": true, "helpfulness": "0/1", "author": "Brian Norton"}, {"rating": 2.0, "review": "Slow and choppy playback on HBO GO and YouTube.  Amazon Prime doesn't work.  If you already have your computer plugged into your computer like I do this thing is useless.  I bought it so I could go wireless but the bandwith is just not there yet.  No biggie though.  It was worth the try at less than $30.", "verified": true, "helpfulness": "1/1", "author": "Hokiefan"}]