[{"rating": 5.0, "review": "Just received this and set up was easy.  It works great.  I am glad I purchased it.  I recommend this.  I have an older TV, so it was an easy process.  I only use it for Netflex and UTube.", "verified": true, "helpfulness": "0/0", "author": "Clarice Duncan \"CLARICE\""}, {"rating": 5.0, "review": "I used to use an HDMI cable to stream from laptop to TV, mainly Netflix and Youtube. Chromecast quality seems to be just as good, and no cable in the way. What's not to like? Although Google doesn't technically support doing this, you should be able to plug Chromecast directly into your receiver to get sound through your stereo speakers, rather than plugging into your TV and then having to run an audio cable to the receiver.", "verified": false, "helpfulness": "0/0", "author": "César Chávez \"Tax the Rich... free the poor.\""}, {"rating": 5.0, "review": "love it ,wish that I brought two at the time .My sister want one now for her house great job", "verified": true, "helpfulness": "0/0", "author": "Amazon Customer"}, {"rating": 4.0, "review": "I got this in my quest to put YouTube on my TV, since that's the one thing a Roku doesn't do, and I was tired of having to plug my laptop into the TV with an HDMI cable. I also wanted to watch websites with video that don't have apps for Roku or tablets, such as RiffTrax. You're supposed to still be able to do other things on your computer while casting video to the Chromecast, but you can't switch tabs or applications while you're watching full-screen video. The only way you can send a video to your TV and still do other things on the computer is if you don't make the video full-screen. That might be fine if you're watching alone, since if you're doing things on the computer you may not be looking at the TV screen that much. It also dropped the connection once while I was using it the first time, and it got really hot after two hours of use. The setup was a little bit complicated and annoying. Not hard, just too long and involved. The screens didn't download all the way so I had to roll over them with the mouse and sometimes guess what I was clicking on. The only real advantages of the Chromecast over just plugging your computer, phone, or tablet into the TV with an HDMI or micro HDMI cable are that it turns the device you're casting from into a remote so you don't have to get off the couch, and it might be easier if you don't have space to put a laptop near the TV or if you need to cast from a desktop computer. It's not horribly expensive, so the remote aspect alone might make it worth it to you.", "verified": true, "helpfulness": "0/0", "author": "MsE0 \"Elaine\""}, {"rating": 4.0, "review": "This is no apple TV but then again it works great. The set up is a little quirky. Also the functionality is not like that of an Apple TV. I have owned several Apple TVs and also am familiar with Roku3. All are good products. This product and Apple TV do not require a subscription.", "verified": true, "helpfulness": "1/2", "author": "R. Warrier"}, {"rating": 1.0, "review": "I will keep this short. Chromecast is a good idea but it is a beta grade product. Chromecast is infamous for troubles connecting to routers. It has pages of support for ways to connect to different types of routers. Consumers should not work like network engineers for Google to get their products that they paid for to work.Your story may vary but I tried this thing on the following routers with no success: 1) Netgear WGR614. 2) D-Link N300 (DIR-605L). 3) Belkin N300. 4) Linksys N300 (E1200).No matter what I tried over 4 days, nothing worked. It would get connected to the router but it would say \"connected to XX router but can't access the internet\". Routers tech support suggestions and Google's support suggestions all failed to get that thing online. After so many hours wasted and after utter frustration. I had to return it to Amazon.On the other hand, my apple TV worked like a charm $35 vs $88 for an Apple TV. Thank you, I will pay a premium to get a working product plus on an Apple TV, there is actually content and a remote. No thank you Google for another beta quality product. Good luck next time.", "verified": true, "helpfulness": "0/0", "author": "Mohamed"}, {"rating": 1.0, "review": "Most of the time this thing never seems to be available. It seems to have a mind of its own - sometimes it works, but at least half the time all you get is a \"No cast devices found message\". Going to google's miserable help still says the product is beta. How many have you sold and you're still beta. Give me a break. Don't buy this piece of junk.", "verified": true, "helpfulness": "0/1", "author": "Brian Peterson"}, {"rating": 5.0, "review": "Like many of the other reviewers, I picked up this device when Google announced it a few months ago since they were bundling a few months of Netflix with it (making the actual device cost more like...$10).The device is astonishingly simple. It's no bigger than an over sized flash drive, has a male HDMI connector, reset button, and micro-usb connector. The micro-usb is for power since the current HDMI standard doesn't support power applications (even though it is capable). You can either plug it into the wall or plug it into your TV if you have a TV with a USB port (like many HDMI equipped HDTVs made in the past decade).To reiterate to many, this isn't a typical \"local content\" kind of device. It's a streaming device that is told where to get its content from via another device. There is no interface, no channels, nothing (well, there is a \"splash screen\" that tells you its name and what WiFi network it is connected to). So if you have Netflix running on your phone and stream to Chromecast, your phone just told the Chromecast where to get the video stream, the CC connects to it, displays it, and your phone is now free to do whatever it wants (even turn off if you so choose). There are pros and cons to all of this.Now as of December 2013, the application PLEX now supports Chromecast (only if you're subscribed to the Plex Pass though seeing as it's only in alpha/beta releases). This was done because of all of the people who wanted a way to play their local content and I have to say, it works amazingly well. You simply install your PLEX Server on whatever desktop or laptop that has your media, pull up the PLEX App (phone, web browser, etc.), select your content, and then beam it to your Chromecast. What's great about this is that PLEX will transcode through it's own cloud and makes your entire library available through their cloud (so you don't need to worry about network shares, security, ssh, etc.). In summary, you can bring your Chromecast wherever you want, plug it in, go through the setup, and then have access to your media server on the go. I travel a decent bit and it's nice to be able to throw it in my suitcase, hook it up to a hotel's WiFi network and play videos off my NAS back home.As for the set up, it's really simple. You install the Chromecast app on your phone/tablet and it does a step-by-step walk through and will have you up and running in a few minutes.And as for one last perk, it supports HDMI-CEC. What this means is that when you go to use it, it will change your TV's input (assuming you have a TV that supports it...which is most that have an HDMI port) to the input of the active device (your Chromecast in this case). Albeit you'll need to switch back to your regular TV input if you watch cable or play games, but it definitely does a good job at trying to get content to your big screen in as few taps, clicks, and swipes as possible.", "verified": false, "helpfulness": "0/0", "author": "C. Kelly"}, {"rating": 2.0, "review": "With all the hype around this gadget I had pretty high expectations.  Unfortunately I was disappointed.  The only casting that worked at all was Netflix.  Anything else just froze on the TV (if it ever casted at all).  In addition, it was virtually impossible to get audio and video to sync when I watched Netflix (despite attempting several trouble-shooting tips from Google).  Also I could only cast one show from Netflix and then the device had to be power cycled before it would recognize another cast.  All in all, extremely annoying, far too much work.  I like my Roku much better.", "verified": true, "helpfulness": "1/1", "author": "Marti R"}, {"rating": 3.0, "review": "It is a good product and it does what it is supposed to. However, If you already have  ROKU, smart TV or smart DVD, there is no need to purchase this.", "verified": true, "helpfulness": "0/0", "author": "S. Chhak"}]